Repository: python/python-docs-pt-br
Catalog: faq/design.po
Languages: pt_br

source: Python 2.6 adds an :mod:`abc` module that lets you define Abstract Base Classes (ABCs). You can then use :func:`isinstance` and :func:`issubclass` to check whether an instance or a class implements a particular ABC. The :mod:`collections.abc` module defines a set of useful ABCs such as :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container`, and :class:`~collections.abc.MutableMapping`.
pt_br: Python 2.6 adiciona um módulo :mod:`abc` que permite definir Classes Base Abstratas (ABCs). Você pode então usar :func:`isinstance` e :func:`issubclass` para verificar se uma instância ou classe implementa um ABC específico. O módulo :mod:`collections.abc` define um conjunto de ABCs úteis como :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container` e :class:`~collections.abc.MutableMapping`

source: For Python, many of the advantages of interface specifications can be obtained by an appropriate test discipline for components.
pt_br: Para Python, muitas das vantagens das especificações de interface podem ser obtidas por uma disciplina de teste apropriada para componentes.

source: A good test suite for a module can both provide a regression test and serve as a module interface specification and a set of examples. Many Python modules can be run as a script to provide a simple "self test." Even modules which use complex external interfaces can often be tested in isolation using trivial "stub" emulations of the external interface. The :mod:`doctest` and :mod:`unittest` modules or third-party test frameworks can be used to construct exhaustive test suites that exercise every line of code in a module.
pt_br: Um bom conjunto de testes para um módulo pode fornecer um teste de regressão e servir como uma especificação de interface do módulo e um conjunto de exemplos. Muitos módulos Python podem ser executados como um script para fornecer um simples "autoteste". Mesmo módulos que usam interfaces externas complexas muitas vezes podem ser testados isoladamente usando emulações triviais da interface externa. Os módulos :mod:`doctest` e :mod:`unittest` ou estruturas de teste de terceiros podem ser usados para construir conjuntos de testes exaustivos que exercitam cada linha de código em um módulo.

source: An appropriate testing discipline can help build large complex applications in Python as well as having interface specifications would. In fact, it can be better because an interface specification cannot test certain properties of a program. For example, the :meth:`!list.append` method is expected to add new elements to the end of some internal list; an interface specification cannot test that your :meth:`!list.append` implementation will actually do this correctly, but it's trivial to check this property in a test suite.
pt_br: Uma disciplina de teste apropriada pode ajudar a construir aplicações grandes e complexas no Python, assim como ter especificações de interface. Na verdade, pode ser melhor porque uma especificação de interface não pode testar certas propriedades de um programa. Por exemplo, espera-se que o método :meth:`!list.append` adicione novos elementos ao final de alguma lista interna; uma especificação de interface não pode testar se sua implementação :meth:`!list.append` realmente fará isso corretamente, mas é trivial verificar esta propriedade em um conjunto de testes.

source: Writing test suites is very helpful, and you might want to design your code to make it easily tested. One increasingly popular technique, test-driven development, calls for writing parts of the test suite first, before you write any of the actual code. Of course Python allows you to be sloppy and not write test cases at all.
pt_br: Escrever conjuntos de testes é muito útil e você pode querer projetar seu código para torná-lo facilmente testável. Uma técnica cada vez mais popular, o desenvolvimento orientado a testes, exige a escrita de partes do conjunto de testes primeiro, antes de escrever qualquer parte do código real. É claro que o Python permite que você seja desleixado e nem escreva casos de teste.

source: Why is there no goto?
pt_br: Por que não há goto?

source: In the 1970s people realized that unrestricted goto could lead to messy "spaghetti" code that was hard to understand and revise. In a high-level language, it is also unneeded as long as there are ways to branch (in Python, with :keyword:`if` statements and :keyword:`or`, :keyword:`and`, and :keyword:`if`/:keyword:`else` expressions) and loop (with :keyword:`while` and :keyword:`for` statements, possibly containing :keyword:`continue` and :keyword:`break`).
pt_br: Na década de 1970, as pessoas perceberam que o goto irrestrito poderia levar a um código "espaguete" confuso, difícil de entender e revisar. Em uma linguagem de alto nível, também é desnecessário, desde que existam maneiras de ramificar (em Python, com instruções :keyword:`if` e :keyword:`or`, :keyword:`and` e expressões :keyword:`if`/:keyword:`else`) e iterar (com instruções :keyword:`while` e :keyword:`for`, possivelmente contendo :keyword:`continue` e :keyword:`break`).

source: One can also use exceptions to provide a "structured goto" that works even across function calls. Many feel that exceptions can conveniently emulate all reasonable uses of the ``go`` or ``goto`` constructs of C, Fortran, and other languages. For example::
pt_br: Também é possível usar exceções para fornecer um "goto estruturado" que funcione mesmo em chamadas de função. Muitos acham que as exceções podem convenientemente emular todos os usos razoáveis das construções ``go`` ou ``goto`` de C, Fortran e outras linguagens. Por exemplo::

source: class label(Exception): pass # declare a label try: ... if condition: raise label() # goto label ... except label: # where to goto pass ...
pt_br: class label(Exception): pass # declara um label try: ... if condition: raise label() # goto label ... except label: # destino do goto pass ...

source: This doesn't allow you to jump into the middle of a loop, but that's usually considered an abuse of ``goto`` anyway. Use sparingly.
pt_br: Isso não permite que você pule para o meio de um laço, mas isso geralmente é considerado um abuso de ``goto`` de qualquer maneira. Use com moderação.

source: Why can't raw strings (r-strings) end with a backslash?
pt_br: Por que strings brutas (r-strings) não podem terminar com uma contrabarra?

source: More precisely, they can't end with an odd number of backslashes: the unpaired backslash at the end escapes the closing quote character, leaving an unterminated string.
pt_br: Mais precisamente, eles não podem terminar com um número ímpar de contrabarras: a contrabarra não pareada no final escapa do caractere de aspa de fechamento, deixando uma string não terminada.

source: Raw strings were designed to ease creating input for processors (chiefly regular expression engines) that want to do their own backslash escape processing. Such processors consider an unmatched trailing backslash to be an error anyway, so raw strings disallow that. In return, they allow you to pass on the string quote character by escaping it with a backslash. These rules work well when r-strings are used for their intended purpose.
pt_br: Strings brutas foram projetadas para facilitar a criação de entrada para processadores (principalmente mecanismos de expressão regular) que desejam fazer seu próprio processamento de escape de contrabarra. De qualquer forma, esses processadores consideram uma contrabarra incomparável como um erro, portanto, as strings brutas não permitem isso. Em troca, eles permitem que você transmita o caractere de aspas da string escapando dele com uma contrabarra. Essas regras funcionam bem quando r-strings são usadas para a finalidade pretendida.

source: If you're trying to build Windows pathnames, note that all Windows system calls accept forward slashes too::
pt_br: Se você estiver tentando criar nomes de caminho do Windows, observe que todas as chamadas do sistema do Windows também aceitam barras::

source: f = open("/mydir/file.txt") # works fine!
pt_br: f = open("/mydir/file.txt") # funciona normalmente!

source: If you're trying to build a pathname for a DOS command, try e.g. one of ::
pt_br: Se você estiver tentando construir um nome de caminho para um comando DOS, tente, por exemplo, algum desses ::

source: Why doesn't Python have a "with" statement for attribute assignments?
pt_br: Por que o Python não tem uma instrução "with" para atribuição de atributos?

source: Python has a :keyword:`with` statement that wraps the execution of a block, calling code on the entrance and exit from the block. Some languages have a construct that looks like this::
pt_br: Python tem uma instrução :keyword:`with` que envolve a execução de um bloco, chamando o código na entrada e na saída do bloco. Algumas linguagens têm uma construção desta forma::

source: with obj: a = 1 # equivalent to obj.a = 1 total = total + 1 # obj.total = obj.total + 1
pt_br: with obj: a = 1 # equivalente a obj.a = 1 total = total + 1 # obj.total = obj.total + 1

source: In Python, such a construct would be ambiguous.
pt_br: Em Python, tal construção seria ambígua.

source: Other languages, such as Object Pascal, Delphi, and C++, use static types, so it's possible to know, in an unambiguous way, what member is being assigned to. This is the main point of static typing -- the compiler *always* knows the scope of every variable at compile time.
pt_br: Outras linguagens, como Object Pascal, Delphi, e C++, usam tipos estáticos, então é possível saber, de maneira não ambígua, que membro está sendo atribuído. Esse é o principal ponto da tipagem estática -- o compilador *sempre* sabe o escopo de toda variável em tempo de compilação.

source: Python uses dynamic types. It is impossible to know in advance which attribute will be referenced at runtime. Member attributes may be added or removed from objects on the fly. This makes it impossible to know, from a simple reading, what attribute is being referenced: a local one, a global one, or a member attribute?
pt_br: O Python usa tipos dinâmicos. É impossível saber com antecedência que atributo vai ser referenciado em tempo de execução. Atributos membro podem ser adicionados ou removidos de objetos dinamicamente. Isso torna impossível saber, de uma leitura simples, que atributo está sendo referenciado: um atributo local, um atributo global ou um atributo membro?

source: For instance, take the following incomplete snippet::
pt_br: Por exemplo, pegue o seguinte trecho incompleto::

source: The snippet assumes that ``a`` must have a member attribute called ``x``. However, there is nothing in Python that tells the interpreter this. What should happen if ``a`` is, let us say, an integer? If there is a global variable named ``x``, will it be used inside the :keyword:`with` block? As you see, the dynamic nature of Python makes such choices much harder.
pt_br: O trecho presume que ``a`` deve ter um atributo de membro chamado ``x``. No entanto, não há nada em Python que diga isso ao interpretador. O que deveria acontecer se ``a`` for, digamos, um número inteiro? Se houver uma variável global chamada ``x``, ela será usada dentro do bloco :keyword:`with`? Como você pode ver, a natureza dinâmica do Python torna essas escolhas muito mais difíceis.

source: The primary benefit of :keyword:`with` and similar language features (reduction of code volume) can, however, easily be achieved in Python by assignment. Instead of::
pt_br: O principal benefício de :keyword:`with` e recursos de linguagem semelhantes (redução do volume de código) pode, no entanto, ser facilmente alcançado em Python por atribuição. Em vez de::

source: write this::
pt_br: escreva isso::

source: This also has the side-effect of increasing execution speed because name bindings are resolved at run-time in Python, and the second version only needs to perform the resolution once.
pt_br: Isso também tem o efeito colateral de aumentar a velocidade de execução porque as ligações de nome são resolvidas a tempo de execução em Python, e a segunda versão só precisa performar a resolução uma vez.

source: Similar proposals that would introduce syntax to further reduce code volume, such as using a 'leading dot', have been rejected in favour of explicitness (see https://mail.python.org/pipermail/python-ideas/2016-May/040070.html).
pt_br: Propostas semelhantes que introduziriam sintaxe para reduzir ainda mais o volume do código, como o uso de um 'ponto inicial', foram rejeitadas em favor da explicitação (consulte https://mail.python.org/pipermail/python-ideas/2016-May/040070.html).

source: Why don't generators support the with statement?
pt_br: Por que os geradores não suportam a instrução with?

source: For technical reasons, a generator used directly as a context manager would not work correctly. When, as is most common, a generator is used as an iterator run to completion, no closing is needed. When it is, wrap it as :func:`contextlib.closing(generator) <contextlib.closing>` in the :keyword:`with` statement.
pt_br: Por razões técnicas, um gerador usado diretamente como gerenciador de contexto não funcionaria corretamente. Quando, como é mais comum, um gerador é usado como um iterador executado até a conclusão, nenhum fechamento é necessário. Quando estiver, envolva-o como :func:`contextlib.closing(generator) <contextlib.closing>` na instrução :keyword:`with`.

source: Why are colons required for the if/while/def/class statements?
pt_br: Por que dois pontos são necessários para as instruções de if/while/def/class?

source: The colon is required primarily to enhance readability (one of the results of the experimental ABC language). Consider this::
pt_br: Os dois pontos são obrigatórios primeiramente para melhorar a leitura (um dos resultados da linguagem experimental ABC). Considere isso::

source: Notice how the second one is slightly easier to read. Notice further how a colon sets off the example in this FAQ answer; it's a standard usage in English.
pt_br: Note como a segunda é ligeiramente mais fácil de ler. Note com mais atenção como os dois pontos iniciam o exemplo nessa resposta de FAQ; é um uso padrão em inglês.

source: Another minor reason is that the colon makes it easier for editors with syntax highlighting; they can look for colons to decide when indentation needs to be increased instead of having to do a more elaborate parsing of the program text.
pt_br: Outro motivo menor é que os dois pontos deixam mais fácil para os editores com realce de sintaxe; eles podem procurar por dois pontos para decidir quando a recuo precisa ser aumentada em vez de precisarem fazer uma análise mais elaborada do texto do programa.

source: Why does Python allow commas at the end of lists and tuples?
pt_br: Por que o Python permite vírgulas ao final de listas e tuplas?

source: Python lets you add a trailing comma at the end of lists, tuples, and dictionaries::
pt_br: O Python deixa você adicionar uma vírgula ao final de listas, tuplas e dicionários::

source: [1, 2, 3,] ('a', 'b', 'c',) d = { "A": [1, 5], "B": [6, 7], # last trailing comma is optional but good style }
pt_br: [1, 2, 3,] ('a', 'b', 'c',) d = { "A": [1, 5], "B": [6, 7], # a vírgula ao final é opcional, mas é bom estilo }

source: There are several reasons to allow this.
pt_br: Existem várias razões para permitir isso.

source: When you have a literal value for a list, tuple, or dictionary spread across multiple lines, it's easier to add more elements because you don't have to remember to add a comma to the previous line. The lines can also be reordered without creating a syntax error.
pt_br: Quando você possui um valor literal para uma lista, tupla, ou dicionário disposta através de múltiplas linhas, é mais fácil adicionar mais elementos porque você não precisa lembrar de adicionar uma vírgula na linha anterior. As linhas também podem ser reordenadas sem criar um erro de sintaxe.

source: Accidentally omitting the comma can lead to errors that are hard to diagnose. For example::
pt_br: Acidentalmente omitir a vírgula pode levar a erros que são difíceis de diagnosticar. Por exemplo::

source: This list looks like it has four elements, but it actually contains three: "fee", "fiefoo" and "fum". Always adding the comma avoids this source of error.
pt_br: Essa lista parece ter quatro elementos, mas na verdade contém três: "fee", "fiefoo" e "fum". Sempre adicionar a vírgula evita essa fonte de erro.

source: Allowing the trailing comma may also make programmatic code generation easier.
pt_br: Permitir a vírgula no final também pode deixar a geração de código programático mais fácil.
