Repository: python/python-docs-pt-br
Catalog: faq/design.po
Languages: pt_br

source: Design and History FAQ
pt_br: FAQ sobre design e histórico

source: Contents
pt_br: Conteúdo

source: Why does Python use indentation for grouping of statements?
pt_br: Por que o Python usa indentação para agrupamento de instruções?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
pt_br: Guido van Rossum acredita que usar indentação para agrupamento é extremamente elegante e contribui muito para a clareza de programa Python mediano. Muitas pessoas aprendem a amar esta ferramenta depois de um tempo.

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
pt_br: Uma vez que não há colchetes de início / fim, não pode haver um desacordo entre o agrupamento percebido pelo analisador sintático e pelo leitor humano. Ocasionalmente, programadores C irão encontrar um fragmento de código como este::

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads many to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering as to why ``y`` is being decremented even for ``x > y``.
pt_br: Somente a instrução ``x++`` é executada se a condição for verdadeira, mas a indentação leva muitos a acreditarem no contrário. Com frequência, até programadores C experientes a observam fixamente por um longo tempo, perguntando-se por que ``y`` está sendo decrementada até mesmo para ``x > y``.

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. After becoming used to reading and writing code using a particular style, it is normal to feel somewhat uneasy when reading (or being required to write) in a different one.
pt_br: Como não há chaves de início / fim, o Python é muito menos propenso a conflitos no estilo de codificação. Em C, existem muitas maneiras diferentes de colocar as chaves. Depois de se tornar habitual a leitura e escrita de código usando um estilo específico, é normal sentir-se um pouco receoso ao ler (ou precisar escrever) em um estilo diferente.

source: Many coding styles place begin/end brackets on a line by themselves. This makes programs considerably longer and wastes valuable screen space, making it harder to get a good overview of a program. Ideally, a function should fit on one screen (say, 20--30 lines). 20 lines of Python can do a lot more work than 20 lines of C. This is not solely due to the lack of begin/end brackets -- the lack of declarations and the high-level data types are also responsible -- but the indentation-based syntax certainly helps.
pt_br: Muitos estilos de codificação colocam chaves de início / fim em uma linha sozinhos. Isto torna os programas consideravelmente mais longos e desperdiça espaço valioso na tela, dificultando a obtenção de uma boa visão geral de um programa. Idealmente, uma função deve caber em uma tela (digamos, 20 a 30 linhas). 20 linhas de Python podem fazer muito mais trabalho do que 20 linhas de C. Isso não se deve apenas à falta de colchetes de início/fim -- a falta de declarações e os tipos de dados de alto nível também são responsáveis -- mas a sintaxe baseada em indentação certamente ajuda.

source: Why am I getting strange results with simple arithmetic operations?
pt_br: Por que eu estou recebendo resultados estranhos com simples operações aritméticas?

source: See the next question.
pt_br: Veja a próxima questão.

source: Why are floating-point calculations so inaccurate?
pt_br: Por que o cálculo de pontos flutuantes são tão imprecisos?

source: Users are often surprised by results like this::
pt_br: Usuários são frequentemente surpreendidos por resultados como este::

source: and think it is a bug in Python. It's not. This has little to do with Python, and much more to do with how the underlying platform handles floating-point numbers.
pt_br: e pensam que isto é um bug do Python. Não é não. Isto tem pouco a ver com o Python, e muito mais a ver com como a estrutura da plataforma lida com números em ponto flutuante.

source: The :class:`float` type in CPython uses a C ``double`` for storage. A :class:`float` object's value is stored in binary floating-point with a fixed precision (typically 53 bits) and Python uses C operations, which in turn rely on the hardware implementation in the processor, to perform floating-point operations. This means that as far as floating-point operations are concerned, Python behaves like many popular languages including C and Java.
pt_br: O tipo :class:`float` no CPython usa um ``double`` do C para armazenamento. O valor de um objeto :class:`float` é armazenado em ponto flutuante binário com uma precisão fixa (normalmente 53 bits) e Python usa operações C, que por sua vez dependem da implementação de hardware no processador, para realizar operações de ponto flutuante. Isso significa que, no que diz respeito às operações de ponto flutuante, Python se comporta como muitas linguagens populares, incluindo C e Java.

source: Many numbers that can be written easily in decimal notation cannot be expressed exactly in binary floating point. For example, after::
pt_br: Muitos números podem ser escritos facilmente em notação decimal, mas não podem ser expressados exatamente em ponto flutuante binário. Por exemplo, após::

source: the value stored for ``x`` is a (very good) approximation to the decimal value ``1.2``, but is not exactly equal to it. On a typical machine, the actual stored value is::
pt_br: o valor armazenado para ``x`` é uma (ótima) aproximação para o valor decimal ``1.2``, mas não é exatamente igual. Em uma máquina típica, o valor real armazenado é::

source: 1.0011001100110011001100110011001100110011001100110011 (binary)
pt_br: 1.0011001100110011001100110011001100110011001100110011 (binário)

source: which is exactly::
pt_br: que é exatamente::

source: The typical precision of 53 bits provides Python floats with 15--16 decimal digits of accuracy.
pt_br: A precisão típica de 53 bits fornece floats do Python com precisão de 15 a 16 dígitos decimais.

source: For a fuller explanation, please see the :ref:`floating-point arithmetic <tut-fp-issues>` chapter in the Python tutorial.
pt_br: Para uma explicação mais completa, consulte o capítulo de :ref:`aritmética de ponto flutuante <tut-fp-issues>` no tutorial Python.

source: Why are Python strings immutable?
pt_br: Por que strings do Python são imutáveis?

source: There are several advantages.
pt_br: Existem várias vantagens.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
pt_br: Uma delas é o desempenho: saber que uma string é imutável significa que podemos alocar espaço para ela no momento da criação, e os requisitos de armazenamento são fixos e imutáveis. Esta é também uma das razões para a distinção entre tuplas e listas.

source: Another advantage is that strings in Python are considered as "elemental" as numbers. No amount of activity will change the value 8 to anything else, and in Python, no amount of activity will change the string "eight" to anything else.
pt_br: Outra vantagem é que strings em Python são consideradas tão “elementares” quanto números. Nenhuma atividade alterará o valor 8 para qualquer outra coisa e, em Python, nenhuma atividade alterará a string “oito” para qualquer outra coisa.

source: Why must 'self' be used explicitly in method definitions and calls?
pt_br: Por que o 'self' deve ser usado explicitamente em definições de método e chamadas?

source: The idea was borrowed from Modula-3. It turns out to be very useful, for a variety of reasons.
pt_br: A ideia foi emprestada do Modula-3. Acontece dela ser muito útil, por vários motivos.

source: First, it's more obvious that you are using a method or instance attribute instead of a local variable. Reading ``self.x`` or ``self.meth()`` makes it absolutely clear that an instance variable or method is used even if you don't know the class definition by heart. In C++, you can sort of tell by the lack of a local variable declaration (assuming globals are rare or easily recognizable) -- but in Python, there are no local variable declarations, so you'd have to look up the class definition to be sure. Some C++ and Java coding standards call for instance attributes to have an ``m_`` prefix, so this explicitness is still useful in those languages, too.
pt_br: Primeiro, é mais óbvio que você está usando um método ou atributo de instância em vez de uma variável local. Ler ``self.x`` ou ``self.meth()`` deixa absolutamente claro que uma variável de instância ou método é usado mesmo se você não souber a definição da classe de cor. Em C++, você pode perceber pela falta de uma declaração de variável local (presumindo que globais são raras ou facilmente reconhecíveis) -- mas no Python não há declarações de variáveis locais, então você teria que procurar a definição de classe para tenha certeza. Alguns padrões de codificação C++ e Java exigem que atributos de instância tenham um prefixo ``m_``, portanto, essa explicitação ainda é útil nessas linguagens também.

source: Second, it means that no special syntax is necessary if you want to explicitly reference or call the method from a particular class. In C++, if you want to use a method from a base class which is overridden in a derived class, you have to use the ``::`` operator -- in Python you can write ``baseclass.methodname(self, <argument list>)``. This is particularly useful for :meth:`~object.__init__` methods, and in general in cases where a derived class method wants to extend the base class method of the same name and thus has to call the base class method somehow.
pt_br: Segundo, significa que nenhuma sintaxe especial é necessária se você quiser referenciar ou chamar explicitamente o método de uma classe específica. Em C++, se você quiser usar um método de uma classe base que é substituído em uma classe derivada, você deve usar o operador ``::`` -- no Python, você pode escrever ``baseclass.methodname(self, <lista de argumentos>)``. Isto é particularmente útil para métodos :meth:`~object.__init__` e, em geral, em casos onde um método de classe derivada deseja estender o método da classe base de mesmo nome e, portanto, precisa chamar o método da classe base de alguma forma.

source: Finally, for instance variables it solves a syntactic problem with assignment: since local variables in Python are (by definition!) those variables to which a value is assigned in a function body (and that aren't explicitly declared global), there has to be some way to tell the interpreter that an assignment was meant to assign to an instance variable instead of to a local variable, and it should preferably be syntactic (for efficiency reasons). C++ does this through declarations, but Python doesn't have declarations and it would be a pity having to introduce them just for this purpose. Using the explicit ``self.var`` solves this nicely. Similarly, for using instance variables, having to write ``self.var`` means that references to unqualified names inside a method don't have to search the instance's directories. To put it another way, local variables and instance variables live in two different namespaces, and you need to tell Python which namespace to use.
pt_br: Finalmente, por exemplo, variáveis, ele resolve um problema sintático com atribuição: uma vez que variáveis locais em Python são (por definição!) aquelas variáveis às quais um valor é atribuído em um corpo de função (e que não são explicitamente declaradas globais), é necessário deve haver alguma forma de dizer ao interpretador que uma atribuição deveria ser atribuída a uma variável de instância em vez de a uma variável local, e deve ser preferencialmente sintática (por razões de eficiência). C++ faz isso através de declarações, mas Python não possui declarações e seria uma pena ter que introduzi-las apenas para esse fim. Usar o ``self.var`` explícito resolve isso muito bem. Da mesma forma, para usar variáveis de instância, ter que escrever ``self.var`` significa que referências a nomes não qualificados dentro de um método não precisam pesquisar nos diretórios da instância. Em outras palavras, variáveis locais e variáveis de instância residem em dois espaço de nomes diferentes, e você precisa informar ao Python qual espaço de nomes usar.

source: Why can't I use an assignment in an expression?
pt_br: Por que não posso usar uma atribuição em uma expressão?

source: Starting in Python 3.8, you can!
pt_br: A partir do Python 3.8, você pode!

source: Assignment expressions using the walrus operator ``:=`` assign a variable in an expression::
pt_br: Expressões de atribuição usando o operador morsa ``:=`` atribuem uma variável em uma expressão::

source: See :pep:`572` for more information.
pt_br: Veja :pep:`572` para mais informações.

source: Why does Python use methods for some functionality (e.g. list.index()) but functions for other (e.g. len(list))?
pt_br: Por que o Python usa métodos para algumas funcionalidades (ex: lista.index()) mas funções para outras (ex: len(lista))?

source: As Guido said:
pt_br: Como Guido disse:

source: (a) For some operations, prefix notation just reads better than postfix -- prefix (and infix!) operations have a long tradition in mathematics which likes notations where the visuals help the mathematician thinking about a problem. Compare the easy with which we rewrite a formula like x*(a+b) into x*a + x*b to the clumsiness of doing the same thing using a raw OO notation.
pt_br: (a) Para algumas operações, a notação de prefixo é melhor lida do que as operações de prefixo (e infixo!) têm uma longa tradição em matemática que gosta de notações onde os recursos visuais ajudam o matemático a pensar sobre um problema. Compare a facilidade com que reescrevemos uma fórmula como x*(a+b) em x*a + x*b com a falta de jeito de fazer a mesma coisa usando uma notação OO bruta.

source: (b) When I read code that says len(x) I *know* that it is asking for the length of something. This tells me two things: the result is an integer, and the argument is some kind of container. To the contrary, when I read x.len(), I have to already know that x is some kind of container implementing an interface or inheriting from a class that has a standard len(). Witness the confusion we occasionally have when a class that is not implementing a mapping has a get() or keys() method, or something that isn't a file has a write() method.
pt_br: (b) Quando leio o código que diz len(x) eu *sei* que ele está perguntando o comprimento de alguma coisa. Isso me diz duas coisas: o resultado é um número inteiro e o argumento é algum tipo de contêiner. Pelo contrário, quando leio x.len(), já devo saber que x é algum tipo de contêiner implementando uma interface ou herdando de uma classe que possui um len() padrão. Veja a confusão que ocasionalmente temos quando uma classe que não está implementando um mapeamento tem um método get() ou keys(), ou algo que não é um arquivo tem um método write().

source: Why is join() a string method instead of a list or tuple method?
pt_br: Por que o join() é um método de string em vez de ser um método de lista ou tupla?

source: Strings became much more like other standard types starting in Python 1.6, when methods were added which give the same functionality that has always been available using the functions of the string module. Most of these new methods have been widely accepted, but the one which appears to make some programmers feel uncomfortable is::
pt_br: Strings se tornaram muito parecidas com outros tipos padrão a partir do Python 1.6, quando métodos que dão a mesma funcionalidade que sempre esteve disponível utilizando as funções do módulo de string foram adicionados. A maior parte desses novos métodos foram amplamente aceitos, mas o que parece deixar alguns programadores desconfortáveis é::

source: which gives the result::
pt_br: que dá o resultado::

source: There are two common arguments against this usage.
pt_br: Existem dois argumentos comuns contra esse uso.

source: The first runs along the lines of: "It looks really ugly using a method of a string literal (string constant)", to which the answer is that it might, but a string literal is just a fixed value. If the methods are to be allowed on names bound to strings there is no logical reason to make them unavailable on literals.
pt_br: O primeiro segue as linhas de: "Parece muito feio usar um método de uma string literal (constante de string)", para o qual a resposta é que pode, mas uma string literal é apenas um valor fixo. Se os métodos devem ser permitidos em nomes vinculados a strings, não há razão lógica para torná-los indisponíveis em literais.

source: The second objection is typically cast as: "I am really telling a sequence to join its members together with a string constant". Sadly, you aren't. For some reason there seems to be much less difficulty with having :meth:`~str.split` as a string method, since in that case it is easy to see that ::
pt_br: A segunda objeção é normalmente formulada como: "Na verdade, estou dizendo a uma sequência para unir seus membros com uma constante de string". Infelizmente, você não está. Por alguma razão parece haver muito menos dificuldade em ter :meth:`~str.split` como um método string, já que nesse caso é fácil ver que ::

source: is an instruction to a string literal to return the substrings delimited by the given separator (or, by default, arbitrary runs of white space).
pt_br: é uma instrução para uma string literal para retornar as substrings delimitadas pelo separador fornecido (ou, por padrão, execuções arbitrárias de espaço em branco).

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
pt_br: :meth:`~str.join` é um método de string porque ao usá-lo você está dizendo à string separadora para iterar sobre uma sequência de strings e se inserir entre elementos adjacentes. Este método pode ser usado com qualquer argumento que obedeça às regras para objetos sequência, incluindo quaisquer novas classes que você mesmo possa definir. Existem métodos semelhantes para bytes e objetos bytearray.

source: How fast are exceptions?
pt_br: Quão rápidas são as exceções?

source: A :keyword:`try`/:keyword:`except` block is extremely efficient if no exceptions are raised. Actually catching an exception is expensive. In versions of Python prior to 2.0 it was common to use this idiom::
pt_br: Um bloco :keyword:`try`/:keyword:`except` é extremamente eficiente se nenhuma exceção for levantada. Na verdade, capturar uma exceção é caro. Nas versões do Python anteriores à 2.0 era comum usar esta expressão::

source: This only made sense when you expected the dict to have the key almost all the time. If that wasn't the case, you coded it like this::
pt_br: Isso somente fazia sentido quando você esperava que o dicionário tivesse uma chave quase que toda vez. Se esse não fosse o caso, você escrevia desta maneira::

source: For this specific case, you could also use ``value = dict.setdefault(key, getvalue(key))``, but only if the ``getvalue()`` call is cheap enough because it is evaluated in all cases.
pt_br: Para este caso específico, você também pode usar ``value = dict.setdefault(key, getvalue(key))``, mas apenas se a chamada ``getvalue()`` tiver pouco custosa o suficiente porque é avaliada em todos os casos.

source: Why isn't there a switch or case statement in Python?
pt_br: Por que não existe uma instrução de switch ou case no Python?

source: In general, structured switch statements execute one block of code when an expression has a particular value or set of values. Since Python 3.10 one can easily match literal values, or constants within a namespace, with a ``match ... case`` statement. An older alternative is a sequence of ``if... elif... elif... else``.
pt_br: Em geral, as instruções switch estruturadas executam um bloco de código quando uma expressão possui um valor ou conjunto de valores específico. Desde o Python 3.10 é possível combinar facilmente valores literais, ou constantes dentro de um espaço de nomes, com uma instrução ``match ... case``. Uma alternativa mais antiga é uma sequência de ``if... elif... elif... else``.

source: For cases where you need to choose from a very large number of possibilities, you can create a dictionary mapping case values to functions to call. For example::
pt_br: Para casos em que você precisa escolher entre um grande número de possibilidades, você pode criar um dicionário mapeando valores de caso para funções a serem chamadas. Por exemplo::

source: For calling methods on objects, you can simplify yet further by using the :func:`getattr` built-in to retrieve methods with a particular name::
pt_br: Para chamar métodos em objetos, você pode simplificar ainda mais usando olá função embutida :func:`getattr` para recuperar métodos com um nome específico::

source: It's suggested that you use a prefix for the method names, such as ``visit_`` in this example. Without such a prefix, if values are coming from an untrusted source, an attacker would be able to call any method on your object.
pt_br: É sugerido que você use um prefixo para os nomes dos métodos, como ``visit_`` neste exemplo. Sem esse prefixo, se os valores vierem de uma fonte não confiável, um invasor poderá chamar qualquer método no seu objeto.

source: Imitating switch with fallthrough, as with C's switch-case-default, is possible, much harder, and less needed.
pt_br: Imitar o comportamento do switch no C, em que a execução atravessa as instruções de um case para outro caso não seja interrompida, é possível, mais difícil, e menos necessário.

source: Can't you emulate threads in the interpreter instead of relying on an OS-specific thread implementation?
pt_br: Você não pode emular threads no interpretador em vez de confiar em uma implementação de thread específica do sistema operacional?

source: Answer 1: Unfortunately, the interpreter pushes at least one C stack frame for each Python stack frame. Also, extensions can call back into Python at almost random moments. Therefore, a complete threads implementation requires thread support for C.
pt_br: Resposta 1: Infelizmente, o interpretador envia pelo menos um quadro de pilha C para cada quadro de pilha Python. Além disso, as extensões podem retornar ao Python em momentos quase aleatórios. Portanto, uma implementação completa de threads requer suporte de thread para C.

source: Answer 2: Fortunately, there is `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, which has a completely redesigned interpreter loop that avoids the C stack.
pt_br: Resposta 2: Felizmente, existe o `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, que tem um laço de interpretador completamente redesenhado que evita a pilha C.

source: Why can't lambda expressions contain statements?
pt_br: Por que expressões lambda não podem conter instruções?
