Repository: python/python-docs-pt-br
Catalog: faq/extending.po
Languages: pt_br

source: Extending/Embedding FAQ
pt_br: FAQ sobre Extensão/Incorporação

source: Contents
pt_br: Conteúdo

source: Can I create my own functions in C?
pt_br: Posso criar minhas próprias funções em C?

source: Yes, you can create built-in modules containing functions, variables, exceptions and even new types in C. This is explained in the document :ref:`extending-index`.
pt_br: Sim, você pode construir módulos embutidos contendo funções, variáveis, exceções e até mesmo novos tipos em C. Isso é explicado no documento :ref:`extending-index`.

source: Most intermediate or advanced Python books will also cover this topic.
pt_br: A maioria dos livros intermediários ou avançados em Python também abordará esse tópico.

source: Can I create my own functions in C++?
pt_br: Posso criar minhas próprias funções em C++?

source: Yes, using the C compatibility features found in C++. Place ``extern "C" { ... }`` around the Python include files and put ``extern "C"`` before each function that is going to be called by the Python interpreter. Global or static C++ objects with constructors are probably not a good idea.
pt_br: Sim, usando recursos de compatibilidade encontrados em C++. Coloque ``extern "C" { ... }`` em torno dos arquivos de inclusão do Python e coloque ``extern "C"`` antes de cada função que será chamada pelo interpretador do Python. Objetos globais ou estáticos em C++ com construtores provavelmente não são uma boa ideia.

source: Writing C is hard; are there any alternatives?
pt_br: Escrever C é difícil; há alguma alternativa?

source: There are a number of alternatives to writing your own C extensions, depending on what you're trying to do.
pt_br: Há um número de alternativas para escrever suas próprias extensões em C, dependendo daquilo que você está tentando fazer.

source: `Cython <https://cython.org>`_ and its relative `Pyrex <https://www.csse.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ are compilers that accept a slightly modified form of Python and generate the corresponding C code. Cython and Pyrex make it possible to write an extension without having to learn Python's C API.
pt_br: O `Cython <https://cython.org>`_ e o seu parente `Pyrex <https://www.csse.canterbury.ac.nz/greg.ewing/python/Pyrex/>`_ são compiladores que aceitam uma forma de Python levemente modificada e geram o código C correspondente. Cython e Pyrex possibilitam escrever extensões sem que seja necessário aprender a usar a API C do Python.

source: If you need to interface to some C or C++ library for which no Python extension currently exists, you can try wrapping the library's data types and functions with a tool such as `SWIG <https://www.swig.org>`_. `SIP <https://github.com/Python-SIP/sip>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs/python/doc/index.html>`_, or `Weave <https://github.com/scipy/weave>`_ are also alternatives for wrapping C++ libraries.
pt_br: Se você precisar interagir com alguma biblioteca C ou C++ que não é suportada por nenhuma extensão do Python no momento, você pode tentar envolver os tipos de dados e funções da biblioteca usando uma ferramenta como o `SWIG <https://www.swig.org>`_. `SIP <https://github.com/Python-SIP/sip>`__, `CXX <https://cxx.sourceforge.net/>`_ `Boost <https://www.boost.org/libs/python/doc/index.html>`_, e `Weave <https://github.com/scipy/weave>`_ são outras alternativas para criar invólucros de bibliotecas C++.

source: How can I execute arbitrary Python statements from C?
pt_br: Como posso executar instruções arbitrárias de Python a partir de C?

source: The highest-level function to do this is :c:func:`PyRun_SimpleString` which takes a single string argument to be executed in the context of the module ``__main__`` and returns ``0`` for success and ``-1`` when an exception occurred (including :exc:`SyntaxError`). If you want more control, use :c:func:`PyRun_String`; see the source for :c:func:`PyRun_SimpleString` in ``Python/pythonrun.c``.
pt_br: A função mais alto-nível para isso é a :c:func:`PyRun_SimpleString`, que recebe como único argumento uma string a ser executada no contexto do módulo ``__main__`` e retorna ``0`` para sucesso e ``-1`` quando uma exceção ocorrer (incluindo :exc:`SyntaxError`). Se quiser mais controle, use :c:func:`PyRun_String`; veja o código-fonte de :c:func:`PyRun_SimpleString` em ``Python/pythonrun.c``.

source: How can I evaluate an arbitrary Python expression from C?
pt_br: Como posso executar e obter o resultado de uma expressão Python arbitrária a partir de C?

source: Call the function :c:func:`PyRun_String` from the previous question with the start symbol :c:data:`Py_eval_input`; it parses an expression, evaluates it and returns its value.
pt_br: Chame a função :c:func:`PyRun_String` da pergunta anterior passando :c:data:`Py_eval_input` como o símbolo de início; ela faz a análise sintática de uma expressão, a executa, e retorna o seu valor.

source: How do I extract C values from a Python object?
pt_br: Como extraio valores em C a partir de um objeto Python?

source: That depends on the object's type. If it's a tuple, :c:func:`PyTuple_Size` returns its length and :c:func:`PyTuple_GetItem` returns the item at a specified index. Lists have similar functions, :c:func:`PyList_Size` and :c:func:`PyList_GetItem`.
pt_br: Depende do tipo do objeto. Se for uma tupla, a :c:func:`PyTuple_Size` retorna o seu comprimento e a :c:func:`PyTuple_GetItem` retorna o item em um determinado índice. Listas têm funções similares, :c:func:`PyList_Size` e :c:func:`PyList_GetItem`.

source: For bytes, :c:func:`PyBytes_Size` returns its length and :c:func:`PyBytes_AsStringAndSize` provides a pointer to its value and its length. Note that Python bytes objects may contain null bytes so C's :c:func:`!strlen` should not be used.
pt_br: Para bytes, a :c:func:`PyBytes_Size` retorna o comprimento e a :c:func:`PyBytes_AsStringAndSize` fornece um ponteiro para o seu valor e o seu comprimento. Note que objetos bytes em Python podem conter bytes nulos, de forma que a :c:func:`!strlen` do C não deve ser usada.

source: To test the type of an object, first make sure it isn't ``NULL``, and then use :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, etc.
pt_br: Para testar o tipo de um objeto, primeiramente se certifique de que ele não é ``NULL``, e então use :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, etc.

source: There is also a high-level API to Python objects which is provided by the so-called 'abstract' interface -- read ``Include/abstract.h`` for further details. It allows interfacing with any kind of Python sequence using calls like :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, etc. as well as many other useful protocols such as numbers (:c:func:`PyNumber_Index` et al.) and mappings in the PyMapping APIs.
pt_br: Também existe uma API alto-nível para objetos Python fornecida pela chamada interface "abstrata" -- leia ``Include/abstract.h`` para mais detalhes. Ela permite interagir com qualquer tipo de sequência Python usando chamadas como :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, etc, além de vários outros protocolos úteis tais como números (:c:func:`PyNumber_Index` e outros) e mapeamentos nas APIs PyMapping.

source: How do I use Py_BuildValue() to create a tuple of arbitrary length?
pt_br: Como posso utilizar Py_BuildValue() para criar uma tupla de comprimento arbitrário?

source: You can't. Use :c:func:`PyTuple_Pack` instead.
pt_br: Não é possível. Use a função :c:func:`PyTuple_Pack` para isso.

source: How do I call an object's method from C?
pt_br: Como eu chamo um método de um objeto a partir do C?

source: The :c:func:`PyObject_CallMethod` function can be used to call an arbitrary method of an object. The parameters are the object, the name of the method to call, a format string like that used with :c:func:`Py_BuildValue`, and the argument values::
pt_br: A função :c:func:`PyObject_CallMethod` pode ser usada para chamar um método arbitrário de um objeto. Os parâmetros são o objeto, o nome do método a ser chamado, uma string de formato como a usada em :c:func:`Py_BuildValue`, e os valores dos argumentos::

source: This works for any object that has methods -- whether built-in or user-defined. You are responsible for eventually :c:func:`Py_DECREF`\ 'ing the return value.
pt_br: Isso funciona para qualquer objeto que tenha métodos -- sejam eles embutidos ou definidos por usuário. Você fica então responsável por chamar :c:func:`Py_DECREF` no valor de retorno.

source: To call, e.g., a file object's "seek" method with arguments 10, 0 (assuming the file object pointer is "f")::
pt_br: Para chamar, por exemplo, o método "seek" de um objeto arquivo com argumentos 10, 0 (presumindo que "f" é o ponteiro para o objeto arquivo)::

source: res = PyObject_CallMethod(f, "seek", "(ii)", 10, 0); if (res == NULL) { ... an exception occurred ... } else { Py_DECREF(res); }
pt_br: res = PyObject_CallMethod(f, "seek", "(ii)", 10, 0); if (res == NULL) { ... ocorreu uma exceção ... } else { Py_DECREF(res); }

source: Note that since :c:func:`PyObject_CallObject` *always* wants a tuple for the argument list, to call a function without arguments, pass "()" for the format, and to call a function with one argument, surround the argument in parentheses, e.g. "(i)".
pt_br: Note que a função :c:func:`PyObject_CallObject` *sempre* recebe os argumentos da chamada como uma tupla, de forma que para chamar uma função sem argumentos deve-se passar "()" como formato, e para chamar uma função com 1 argumento, coloque-o entre parênteses, por exemplo "(i)".

source: How do I catch the output from PyErr_Print() (or anything that prints to stdout/stderr)?
pt_br: Como posso capturar a saída da função PyErr_Print() (ou qualquer outra coisa que escreva para stdout/stderr)?

source: In Python code, define an object that supports the ``write()`` method. Assign this object to :data:`sys.stdout` and :data:`sys.stderr`. Call print_error, or just allow the standard traceback mechanism to work. Then, the output will go wherever your ``write()`` method sends it.
pt_br: Com código Python, defina um objeto que suporte o método ``write()``. Atribua esse objeto a :data:`sys.stdout` e :data:`sys.stderr`. Chame print_error, or simplesmente deixe o mecanismo padrão de traceback acontecer. Assim, a saída irá para onde quer que o seu método ``write()`` a envie.

source: The easiest way to do this is to use the :class:`io.StringIO` class:
pt_br: O jeito mais fácil de fazer isso é usar a classe :class:`io.StringIO`:

source: A custom object to do the same would look like this:
pt_br: Um objeto personalizado para fazer a mesma coisa seria esse:

source: How do I access a module written in Python from C?
pt_br: Como faço para acessar a partir do C um módulo escrito em Python?

source: You can get a pointer to the module object as follows::
pt_br: Você pode obter um pointeiro para o objeto de módulo da seguinte maneira::

source: If the module hasn't been imported yet (i.e. it is not yet present in :data:`sys.modules`), this initializes the module; otherwise it simply returns the value of ``sys.modules["<modulename>"]``. Note that it doesn't enter the module into any namespace -- it only ensures it has been initialized and is stored in :data:`sys.modules`.
pt_br: Se o módulo ainda não foi importado (isto é, ainda não aparece no :data:`sys.modules`), essa função vai inicializar o módulo; caso contrário, ela vai simplesmente retornar o valor de ``sys.modules["<modulename>"]``. Note que ela não adiciona o módulo a nenhum espaço de nomes -- ela simplesmente garante que ele foi inicializado e colocado no :data:`sys.modules`.

source: You can then access the module's attributes (i.e. any name defined in the module) as follows::
pt_br: Você pode então acessar os atributos do módulo (isto é, qualquer nome definido no módulo) assim::

source: Calling :c:func:`PyObject_SetAttrString` to assign to variables in the module also works.
pt_br: Chamar :c:func:`PyObject_SetAttrString` para definir variáveis no módulo também funciona.

source: How do I interface to C++ objects from Python?
pt_br: Como posso interagir com objetos C++ a partir do Python?

source: Depending on your requirements, there are many approaches. To do this manually, begin by reading :ref:`the "Extending and Embedding" document <extending-index>`. Realize that for the Python run-time system, there isn't a whole lot of difference between C and C++ -- so the strategy of building a new Python type around a C structure (pointer) type will also work for C++ objects.
pt_br: Dependendo das suas necessidades, há diversas abordagens. Para fazer isso manualmente, comece lendo :ref:`o documento "Estendendo e Incorporando" <extending-index>`. Note que, para o sistema Python em tempo de execução, não há muita diferença entre C e C++ -- de forma que a estratégia de construir um novo tipo Python ao redor de uma estrutura C (ou ponteiro para uma) também funciona para objetos C++.

source: For C++ libraries, see :ref:`c-wrapper-software`.
pt_br: Para bibliotecas C++, veja :ref:`c-wrapper-software`.

source: I added a module using the Setup file and the make fails; why?
pt_br: Adicionei um módulo usando o arquivo de Setup e o make falha; por quê?

source: Setup must end in a newline, if there is no newline there, the build process fails. (Fixing this requires some ugly shell script hackery, and this bug is so minor that it doesn't seem worth the effort.)
pt_br: O Setup deve terminar com uma quebra de linha; se não houver uma quebra de linha no final, o processo de compilação falha. (Consertar isso requer umas gambiarras feias em shell script, e esse bug é tão pequeno que o esforço não parece valer a pena.)

source: How do I debug an extension?
pt_br: Como eu depuro uma extensão?

source: When using GDB with dynamically loaded extensions, you can't set a breakpoint in your extension until your extension is loaded.
pt_br: Ao usar o GDB com extensões carregadas dinamicamente, você não consegue definir um ponto de interrupção antes da sua extensão ser carregada.

source: In your ``.gdbinit`` file (or interactively), add the command:
pt_br: No seu arquivo ``.gdbinit`` (ou então interativamente), adicione o comando:

source: Then, when you run GDB:
pt_br: Então, ao executar o GDB:

source: $ gdb /local/bin/python gdb) run myscript.py gdb) continue # repeat until your extension is loaded gdb) finish # so that your extension is loaded gdb) br myfunction.c:50 gdb) continue
pt_br: $ gdb /local/bin/python gdb) run myscript.py gdb) continue # repita até que a sua extensão seja carregada gdb) finish # para que a sua extensão seja carregada gdb) br myfunction.c:50 gdb) continue

source: I want to compile a Python module on my Linux system, but some files are missing. Why?
pt_br: Quero compilar um módulo Python no meu sistema Linux, mas alguns arquivos estão faltando. Por quê?

source: Most packaged versions of Python omit some files required for compiling Python extensions.
pt_br: A maioria das versões empacotadas de Python omitem alguns arquivos necessários para compilar extensões do Python.

source: For Red Hat, install the python3-devel RPM to get the necessary files.
pt_br: Em sistemas Red Hat, instale o RPM python3-devel para obter os arquivos necessários.

source: For Debian, run ``apt-get install python3-dev``.
pt_br: Para Debian, execute ``apt-get install python3-dev``.

source: How do I tell "incomplete input" from "invalid input"?
pt_br: Como posso distinguir "entrada incompleta" de "entrada inválida"?

source: Sometimes you want to emulate the Python interactive interpreter's behavior, where it gives you a continuation prompt when the input is incomplete (e.g. you typed the start of an "if" statement or you didn't close your parentheses or triple string quotes), but it gives you a syntax error message immediately when the input is invalid.
pt_br: Às vezes você quer emular o comportamento do interpretador interativo do Python, que te dá um prompt de continuação quando a entrada está incompleta (por exemplo, você digitou o início de uma instrução "if", ou então não fechou os parênteses ou aspas triplas), mas que te dá um mensagem de erro de sintaxe imediatamente se a entrada for inválida.

source: In Python you can use the :mod:`codeop` module, which approximates the parser's behavior sufficiently. IDLE uses this, for example.
pt_br: Em Python você pode usar o módulo :mod:`codeop`, que aproxima suficientemente o comportamento do analisador sintático. Por exemplo, o IDLE o usa.

source: The easiest way to do it in C is to call :c:func:`PyRun_InteractiveLoop` (perhaps in a separate thread) and let the Python interpreter handle the input for you. You can also set the :c:func:`PyOS_ReadlineFunctionPointer` to point at your custom input function. See ``Modules/readline.c`` and ``Parser/myreadline.c`` for more hints.
pt_br: Em C, a forma mais fácil de fazer isso é chamar :c:func:`PyRun_InteractiveLoop` (talvez em uma thread separada) e deixar o interpretador do Python tratar a entrada para você. Você tambémm pode apontar o :c:func:`PyOS_ReadlineFunctionPointer` para a sua função de entrada personalizada. Consulte ``Modules/readline.c`` e ``Parser/myreadline.c`` para mais dicas.

source: How do I find undefined g++ symbols __builtin_new or __pure_virtual?
pt_br: Como encontro os símbolos __builtin_new ou __pure_virtual não-definidos no g++?

source: To dynamically load g++ extension modules, you must recompile Python, relink it using g++ (change LINKCC in the Python Modules Makefile), and link your extension module using g++ (e.g., ``g++ -shared -o mymodule.so mymodule.o``).
pt_br: Para carregar dinamicamente módulos de extensão feitos com g++, você precisa recompilar o Python, usando o g++ como ligador (mude a constante LINKCC no Makefile dos módulos de extensão do Python), e use o g++ também como ligador do seu módulo (por exemplo, ``g++ -shared -o mymodule.so mymodule.o``).

source: Can I create an object class with some methods implemented in C and others in Python (e.g. through inheritance)?
pt_br: Posso criar uma classe de objetos com alguns métodos implementados em C e outros em Python (por exemplo, via herança)?

source: Yes, you can inherit from built-in classes such as :class:`int`, :class:`list`, :class:`dict`, etc.
pt_br: Sim, você pode herdar de classes embutidas como :class:`int`, :class:`list`, :class:`dict` etc.

source: The Boost Python Library (BPL, https://www.boost.org/libs/python/doc/index.html) provides a way of doing this from C++ (i.e. you can inherit from an extension class written in C++ using the BPL).
pt_br: A Boost Python Library (BPL, https://www.boost.org/libs/python/doc/index.html) fornece uma forma de fazer isso a partir do C++ (quer dizer, você consegue herdar de uma classe de extensão escrita em C++ usando a BPL).
