Repository: python/python-docs-pt-br
Catalog: faq/general.po
Languages: pt_br

source: General Python FAQ
pt_br: Python FAQ Geral

source: Contents
pt_br: Conteúdo

source: General Information
pt_br: Informações Gerais

source: What is Python?
pt_br: O que é Python?

source: Python is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants, on the Mac, and on Windows 2000 and later.
pt_br: O Python é uma linguagem de programação interpretada, interativa e orientada a objetos. O mesmo incorporou módulos, exceções, tipagem dinâmica, tipos de dados dinâmicos de alto nível e classes. O Python fornece ao desenvolvedor um poder notável aliado a uma sintaxe simples de clara. Possui interfaces para muitas chamadas e bibliotecas do sistema, bem como para vários sistemas de janelas, e é extensível através de linguagem como o C ou C ++. Também é utilizado como linguagem de extensão para aplicativos que precisam de uma interface programável. Finalmente, o Python é portátil: o mesmo pode ser executado em várias variantes do Unix, no Mac e no Windows 2000 ou versões posteriores.

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
pt_br: Para saber mais, inicie pelo nosso tutorial :ref:`tutorial-index`. Os links do `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ para outros tutoriais introdutórios e recursos da linguagem Python.

source: What is the Python Software Foundation?
pt_br: O que é a Python Software Foundation?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
pt_br: O Python Software Foundation é uma organização independente e sem fins lucrativos que detém os direitos autorais sobre as versões 2.1 do Python e as mais recentes. A missão do PSF é avançar a tecnologia de código aberto relacionada à linguagem de programação Python e divulgar a utilização do Python. A página inicial do PSF pode ser acessada pelo link a seguir https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
pt_br: Doações para o PSF estão isentas de impostos nos EUA. Se utilizares o Python e achares útil, contribua através da página de doação do PSF `the PSF donation page <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
pt_br: Existem restrições de direitos autorais sobre o uso do Python?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
pt_br: Podemos fazer tudo o que quisermos com os fontes, desde que deixemos os direitos autorais e exibimos esses direitos em qualquer documentação sobre o Python que produzirmos. Se honrarmos as regras dos direitos autorais, não há quaisquer problema em utilizar o Python em versões comerciais, vende-lo cópia-lo na forma de código fonte ou o seu binária (modificado ou não modificado), ou para vender produtos que incorporem o Python de alguma forma. Ainda gostaríamos de saber sobre todo o uso comercial de Python, é claro.

source: See `the PSF license page <https://www.python.org/psf/license/>`_ to find further explanations and a link to the full text of the license.
pt_br: Veja `the PSF license page <https://www.python.org/psf/license/>`_ para encontrar mais explicações e um link para o texto completo da licença.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
pt_br: O logotipo do Python é marca registrada e, em certos casos, é necessária permissão para usá-la. Consulte a Política de Uso da Marca comercial `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ para obter mais informações.

source: Why was Python created in the first place?
pt_br: Em primeiro lugar, por que o Python foi desenvolvido?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
pt_br: Aqui está um resumo *muito* breve de como que tudo começou, escrito por Guido van Rossum:

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
pt_br: Eu tive vasta experiência na implementação de linguagens interpretada no grupo ABC da CWI e, ao trabalhar com esse grupo, aprendi muito sobre o design de linguagens. Este é a origem de muitos recursos do Python, incluindo o uso da indentação para o agrupamento de instruções e a inclusão de tipos de dados de alto nível (embora existam diversos detalhes diferentes em Python).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
pt_br: Eu tinha uma série de queixas sobre a língua ABC, mas também havia gostado de muitos das suas características. Era impossível estender o idioma ABC (ou melhorar a implementação) para remediar minhas queixas - na verdade, a falta de extensibilidade era um dos maiores problemas. Eu tinha alguma experiência com o uso de Modula-2+ e conversei com os designers do Modula-3 e li o relatório do Modula-3. Modula-3 foi a origem da sintaxe e semântica usada nas exceções, e alguns outros recursos do Python.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
pt_br: Eu estava trabalhando no grupo de sistema operacional distribuído da Amoeba na CWI. Precisávamos de uma maneira melhor de administrar o sistema do que escrevendo programas em C ou Bourne Shell Scripts, uma vez que o Amoeba tinha a sua própria interface de chamada do sistema, que não era facilmente acessível a partir do Shell Bourne. Minha experiência com o tratamento de erros em Amoeba me conscientizou da importância das exceções como um recurso das linguagem de programação.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
pt_br: Percebi que uma linguagem de Script com uma sintaxe semelhante a do ABC, mas com acesso às chamadas do sistema Amoeba, preencheria a necessidade. Percebi também que seria uma boa escrever uma linguagem específica do ameba, então, decidi que precisava de uma linguagem realmente extensível.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
pt_br: Durante as férias do Natal de 1989, tive bastante tempo disponível e então decidi tentar a construção de algo. Durante ano seguinte, continuei trabalhando em minhas horas vagas, e o Python foi usado no projeto Amoeba com crescente sucesso, e o feedback dos colegas me fez implementar muita melhoria.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
pt_br: Em fevereiro de 1991, depois de mais de um ano de desenvolvimento, decidi publicar no USENET. O resto está no arquivo ``Misc/HISTORY``.

source: What is Python good for?
pt_br: Para o que que o Python é excelente?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
pt_br: O Python é uma linguagem de programação de propósito geral, de alto nível e que pode ser aplicada em muitos tipos diferentes de problemas.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), Internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, CGI programming), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
pt_br: A linguagem vem com uma larga biblioteca padrão que cobre áreas como processamento de cadeias de caracteres (expressões regulares, Unicode, cálculo de diferença entre arquivos), protocolos da Internet (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, programação CGI), engenharia de software (testes unitários, logging, análise de desempenho, parsing de código Python), e interfaces do sistema operacional (chamadas de sistema, sistemas de arquivos, sockets TCP/IP). Veja a tabela de conteúdo :ref:`library-index` para ter uma ideia do que está disponível. Uma grande variedade de extensões de terceiros também está disponível. Consulte `o Índice de Pacotes Python <https://pypi.org>`_ para encontrar pacotes que possam interessar a você.

source: How does the Python version numbering scheme work?
pt_br: Como funciona o esquema de numeração de versões do Python?

source: Python versions are numbered A.B.C or A.B. A is the major version number -- it is only incremented for really major changes in the language. B is the minor version number, incremented for less earth-shattering changes. C is the micro-level -- it is incremented for each bugfix release. See :pep:`6` for more information about bugfix releases.
pt_br: As versões do Python são numeradas na forma A.B.C ou A.B. A é o número da versão principal - só é incrementado quando ocorre mudanças realmente importantes na linguagem. O B é o número da versão menor, incrementado quando ocorre mudanças menores. O C é o micro-nível - é incrementado para cada versão do bugfix. Veja p :pep:`6` para obter mais informações sobre as versões do bugfix.

source: Not all releases are bugfix releases. In the run-up to a new major release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
pt_br: Nem todos as versões são lançamentos de bugfix. Na corrida por uma nova versão principal, uma série de lançamentos de desenvolvimento são feitas, denotadas como alfa, beta ou candidate. As versões Alphas são lançamentos iniciais (early releases) em que as interfaces ainda não estão finalizadas; não é inesperado ver uma mudança de interface entre duas versões alfa. Os Betas são mais estáveis, preservando as interfaces existentes, mas possivelmente adicionando novos módulos, e os candidatos a lançamento são congelados, sem alterações, exceto quando necessário para corrigir erros críticos.

source: Alpha, beta and release candidate versions have an additional suffix. The suffix for an alpha version is "aN" for some small number N, the suffix for a beta version is "bN" for some small number N, and the suffix for a release candidate version is "cN" for some small number N. In other words, all versions labeled 2.0aN precede the versions labeled 2.0bN, which precede versions labeled 2.0cN, and *those* precede 2.0.
pt_br: As versões de lançamento Alpha, beta e candidate possuem um sufixo adicional. O sufixo para uma versão alfa é "aN" para algum número pequeno N, o sufixo para uma versão beta é "bN" para algum número pequeno N e o sufixo para uma versão candidata a ser lançamenta é "cN" para algum pequeno número N. Em outras palavras, todas as versões rotuladas como 2.0aN precedem as versões rotuladas como 2.0bN, que precedem as versões rotuladas como 2.0cN e * essas* precederam a 2.0.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
pt_br: Também podemos encontrar números de versão com um sufixo "+", por exemplo, "2.2+". Estas são versões não lançadas, construídas diretamente do repositório de desenvolvimento do CPython. Na prática, após uma última versão menor, a versão é incrementada para a próxima versão secundária, que se torna a versão "a0", por exemplo, "2.4a0".

source: See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
pt_br: Veja também a documentação para :data:`sys.version`, :data:`sys.hexversion`, e :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
pt_br: Como faço para obter uma cópia dos fonte do Python?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
pt_br: A última distribuição fonte do Python sempre está disponível no python.org, em https://www.python.org/downloads/. As últimas fontes de desenvolvimento podem ser obtidas em https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
pt_br: A distribuição fonte é um arquivo .tar com .gzip contendo o código-fonte C completo, a documentação formatada com o Sphinx, módulos de biblioteca Python, programas de exemplo e várias peças úteis de software livremente distribuível. A fonte compilará e ficará fora da caixa na maioria das plataformas UNIX.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
pt_br: Consulte a seção Introdução do Guia do Desenvolvedor Python <https://devguide.python.org/setup/>`__ para obter mais informações sobre como obter o código-fonte e compilá-lo.

source: How do I get documentation on Python?
pt_br: Como faço para obter a documentação do Python?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
pt_br: A documentação padrão para a versão atualmente estável do Python está disponível em https://docs.python.org/3/. Em PDF, texto simples e versões HTML para download também estão disponíveis em https://docs.python.org/3/download.html.

source: The documentation is written in reStructuredText and processed by `the Sphinx documentation tool <http://sphinx-doc.org/>`__. The reStructuredText source for the documentation is part of the Python source distribution.
pt_br: A documentação é escrita em reStructuredText e processada pela `the Sphinx documentation tool <http://sphinx-doc.org/>`__. Os fonte do reStructuredText para documentação fazem parte da distribuição fonte do Python.

source: I've never programmed before. Is there a Python tutorial?
pt_br: Eu nunca programei antes. Existe um tutorial básico do Python?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
pt_br: Existem inúmeros tutoriais e livros disponíveis. A documentação padrão inclui :ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
pt_br: Consulte o Guia do Iniciante `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ para encontrar informações referewntes a quem está começando agora na programação Python, incluindo uma lista com tutoriais.

source: Is there a newsgroup or mailing list devoted to Python?
pt_br: Existe um grupo de discussão ou lista de discussão dedicada ao Python?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
pt_br: Existe um grupo de notícias :newsgroup:`comp.lang.python`, e uma lista de discussão, ` python-list <https://mail.python.org/mailman/listinfo/python-list> `_. O grupo de discussão e a lista de endereços são entregues - se poderes ler as notícias, não será necessário se inscrever na lista de endereços. :newsgroup:`comp.lang.python` possui bastante postagem, recebendo centenas de postagens todos os dias, e os leitores do Usenet geralmente são mais capazes de lidar com esse volume.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman/listinfo/python-announce-list>`_.
pt_br: Os anúncios de novas versões e eventos de software podem ser encontrados em comp.lang.python.announce, uma lista moderada de baixo tráfego que recebe cerca de cinco postagens por dia. Está disponível como `the python-announce mailing list <https://mail.python.org/mailman/listinfo/python-announce-list>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
pt_br: Mais informações sobre outras listas de discussão e Newsgroups podem ser encontradas em https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
pt_br: Como faço para obter uma versão de teste beta do Python?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
pt_br: As versões Alpha e beta estão disponíveis em https://www.python.org/downloads/. Todos os lançamentos são anunciados nos grupos de notícias comp.lang.python e comp.lang.python.announce e na página inicial do Python em https://www.python.org/; um feed RSS de notícias está disponível.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
pt_br: Você também pode acessar a versão de desenvolvimento do Python através do Git. Veja `O Guia do Desenvolvedor Python <https://devguide.python.org/>` _ para detalhes.

source: How do I submit bug reports and patches for Python?
pt_br: Como eu envio um bug report e patches para o Python?

source: To report a bug or submit a patch, please use the Roundup installation at https://bugs.python.org/.
pt_br: Para reportar um erro ou enviar um patch, use a instalação Roundup em https://bugs.python.org/.

source: You must have a Roundup account to report bugs; this makes it possible for us to contact you if we have follow-up questions. It will also enable Roundup to send you updates as we act on your bug. If you had previously used SourceForge to report bugs to Python, you can obtain your Roundup password through Roundup's `password reset procedure <https://bugs.python.org/user?@template=forgotten>`_.
pt_br: Você deve ter uma conta em Roundup para poder enviar um bug report; Isso nos permite contactá-lo se tivermos mais perguntas a serem feitas. Também permitirá que o Roundup lhe envie atualizações à medida que trabalhamos na correção do bug por você relatado. Se tiveres usado o SourceForge anteriormente para relatar erros do Python, você pode obter sua senha do Roundup através do `password reset procedure <https://bugs.python.org/user?@template=forgotten>`_.

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
pt_br: Para mais informações sobre como o Python é desenvolvido, consulte `o Guia do Desenvolvedor Python <https://devguide.python.org/>` _.

source: Are there any published articles about Python that I can reference?
pt_br: Existem alguns artigos publicados sobre o Python para que eu possa fazer referência?

source: It's probably best to cite your favorite book about Python.
pt_br: Provavelmente será melhor citar o seu livro favorito sobre o Python.

source: The very first article about Python was written in 1991 and is now quite outdated.
pt_br: O primeiro artigo sobre Python foi escrito em 1991 e atualmente o mesmo se encontra bastante desatualizado.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
pt_br: Guido van Rossum e Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Edição 4 (dezembro de 1991), Amsterdam, pp. 283--303.q

source: Are there any books on Python?
pt_br: Existem alguns livros sobre o Python?
