Repository: python/python-docs-pt-br
Catalog: faq/general.po
Languages: pt_br

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
pt_br: Sim, há muitos publicados e muitos outros que estão sendo nesse momento escritos!! Veja o wiki python.org em https://wiki.python.org/moin/PythonBooks para obter uma listagem.

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
pt_br: Você também pode pesquisar livrarias online sobre "Python" e filtrar as referências a respeito do Monty Python; ou talvez procure por "Python" e "linguagem".

source: Where in the world is www.python.org located?
pt_br: Onde está armazenado o site www.python.org?

source: The Python project's infrastructure is located all over the world and is managed by the Python Infrastructure Team. Details `here <http://infra.psf.io>`__.
pt_br: A infraestrutura do projeto Python está localizada em todo o mundo e é gerenciada pela equipe de infraestrutura do Python. Detalhes `aqui <http://infra.psf.io>` __.

source: Why is it called Python?
pt_br: Por que o nome Python?

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
pt_br: Quando o Guido van Rossum começou a implementar o Python, o mesmo também estava lendo os scripts publicados do `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, uma série de comédia da BBC da década de 1970. Van Rossum pensou que precisava de um nome curto, único e ligeiramente misterioso, então resolveu chamar a sua linguagem de Python.

source: Do I have to like "Monty Python's Flying Circus"?
pt_br: Eu tenho que gostar de "Monty Python's Flying Circus"?

source: No, but it helps. :)
pt_br: Não, mas isso ajuda. :)

source: How stable is Python?
pt_br: Quão estável é o Python?

source: Very stable. New, stable releases have been coming out roughly every 6 to 18 months since 1991, and this seems likely to continue. Currently there are usually around 18 months between major releases.
pt_br: Muito estável. Novos lançamentos estáveis são divulgados aproximadamente de 6 a 18 meses desde 1991, e isso provavelmente continuará. Atualmente, o ritmo de publicação vem sendo a cada 18 meses das versões principais.

source: The developers issue "bugfix" releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
pt_br: Os desenvolvedores lançam versões "bugfix" de versões mais antigas, então a estabilidade dos lançamentos existentes melhora gradualmente. As liberações de correções de erros, indicadas por um terceiro componente do número da versão (por exemplo, 3.5.3, 3.6.2), são gerenciadas para estabilidade; somente correções para problemas conhecidos são incluídas em uma versão de correções de erros, e é garantido que as interfaces permanecerão as mesmas durante uma série de liberações de correções de erros.

source: The latest stable releases can always be found on the `Python download page <https://www.python.org/downloads/>`_. There are two production-ready versions of Python: 2.x and 3.x. The recommended version is 3.x, which is supported by most widely used libraries. Although 2.x is still widely used, `it will not be maintained after January 1, 2020 <https://www.python.org/dev/peps/pep-0373/>`_.
pt_br: As últimas versões estáveis ​​sempre podem ser encontradas na página de download do Python <https://www.python.org/downloads/> `_. Existem duas versões prontas para produção do Python: 2.xe 3.x. A versão recomendada é 3.x, que é suportada pelas bibliotecas mais usadas. Embora 2.x ainda seja amplamente utilizado, `não será mantido após 1 de janeiro de 2020 <https://www.python.org/dev/peps/pep-0373/>` _.

source: How many people are using Python?
pt_br: Quantas pessoas usam o Python?

source: There are probably tens of thousands of users, though it's difficult to obtain an exact count.
pt_br: Provavelmente existem dezenas de milhares de usuários, embora seja difícil obter uma contagem exata.

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
pt_br: O Python está disponível para download gratuito, portanto, não há números de vendas, e o mesmo está disponível em vários diferentes sites e é empacotado em muitas distribuições Linux, portanto, utilizar as estatísticas de downloads não seria a melhor forma para contabilizarmos a base de usuários.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
pt_br: O grupo de notícias comp.lang.python é bastante ativo, mas nem todos os usuários Python postam no grupo ou mesmo o leem regularmente.

source: Have any significant projects been done in Python?
pt_br: Exizte algum projeto significativo feito em Python?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
pt_br: Veja a lista em https://www.python.org/about/success para obter uma listagem de projetos que usam o Python. Consultar os procedimentos para as conferências passadas do Python, `past Python conferences <https://www.python.org/community/workshops/>`_ revelará as contribuições de várias empresas e de diferentes organizações.

source: High-profile Python projects include `the Mailman mailing list manager <http://www.list.org>`_ and `the Zope application server <http://www.zope.org>`_. Several Linux distributions, most notably `Red Hat <https://www.redhat.com>`_, have written part or all of their installer and system administration software in Python. Companies that use Python internally include Google, Yahoo, and Lucasfilm Ltd.
pt_br: Os projetos Python de alto perfil incluem o gerenciador da lista e-mail Mailman `the Mailman mailing list manager <http://www.list.org>`_ e o servidor de aplicativos Zope `the Zope application server <http://www.zope.org>`_. Várias distribuições Linux, mais notavelmente o `Red Hat <https://www.redhat.com>`_, escreveram parte ou a totalidade do seus instaladores e software de administração do sistema em Python. Empresas que usam Python internamente incluem Google, Yahoo e Lucasfilm Ltd.

source: What new developments are expected for Python in the future?
pt_br: Quais são os novos desenvolvimentos esperados para o Python no futuro?

source: See https://www.python.org/dev/peps/ for the Python Enhancement Proposals (PEPs). PEPs are design documents describing a suggested new feature for Python, providing a concise technical specification and a rationale. Look for a PEP titled "Python X.Y Release Schedule", where X.Y is a version that hasn't been publicly released yet.
pt_br: Consulte https://www.python.org/dev/peps/ para ver a lista de propostas de aprimoramento do python (PEPs). As PEPs são documentos de design que descrevem novos recurso que foram sugerido para o Python, fornecendo uma especificação técnica concisa e a sua lógica. Procure uma PEP intitulado de "Python X.Y Release Schedule", onde X.Y é uma versão que ainda não foi lançada publicamente.

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman/listinfo/python-dev/>`_.
pt_br: Novos desenvolvimentos são discutido na lista de discussão do python-dev `the python-dev mailing list <https://mail.python.org/mailman/listinfo/python-dev/>`_.

source: Is it reasonable to propose incompatible changes to Python?
pt_br: É razoável propor mudanças incompatíveis com o Python?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
pt_br: Normalmente não. Já existem milhões de linhas de código Python em todo o mundo, de modo que qualquer alteração na linguagem que invalide mais de uma fração muito pequena dos programas existentes deverá ser desaprovada. Mesmo que possamos fornecer um programa de conversão, ainda haverá o problema de atualizar toda a documentação; muitos livros foram escritos sobre o Python, e não queremos invalidá-los todos de uma vez só.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
pt_br: Fornecer um caminho de atualização gradual será necessário se um recurso precisar ser alterado. A :pep:`5` descreve o procedimento e em seguida introduz alterações incompatíveis com versões anteriores ao mesmo tempo em que minimiza a interrupção dos usuários.

source: Is Python a good language for beginning programmers?
pt_br: O Python é uma boa linguagem para quem está começando na programação agora?

source: Yes.
pt_br: Sim.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
pt_br: Ainda é bastante comum que os alunos iniciem com uma linguagem procedura e estaticamente tipada como Pascal e o C ou um subconjunto do C++ ou do Java. Os alunos podem ser melhor atendidos ao aprender Python como sua primeira língua. O Python possui uma sintaxe muito simples e consistente e uma grande quantidade de bibliotecas padrão e, o mais importante, o uso do Python em um curso de programação para iniciantes permite aos alunos se concentrarem em habilidades de programação importantes, como a decomposição do problema e o design do tipo de dados. Com o Python, os alunos podem ser introduzidos rapidamente em conceitos básicos, como loops e procedimentos. Provavelmente os mesmos até poderão trabalhar com objetos definidos por ele mesmos logo em seu primeiro curso.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
pt_br: Para um aluno que nunca programou antes, usar um idioma estaticamente tipado parece não que não é natural. O mesmo apresenta uma complexidade adicional que o aluno deverá dominar e geralmente retarda o ritmo do curso. Os alunos estão tentando aprender a pensar como um computador, decompor problemas, projetar interfaces consistentes e encapsular dados. Embora aprender a usar uma linguagem tipicamente estatica seja importante a longo prazo, não é necessariamente o melhor tópico a ser abordado no primeiro momento de um curso de programação.

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
pt_br: Muitos outros aspectos do Python fazem do mesmo uma excelente linguagem para quem está aprendendo a programar. Como o Java, o Python possui uma biblioteca padrão grande para que o estudantes possam receber projetos de programação muito cedo no curso e que possam *fazer* trabalhos úteis. As atribuições não estão restritas à calculadora padrão de quatro funções e verificam os programas de balanceamento. Ao usar a biblioteca padrão, os alunos podem ter a satisfação de trabalhar em aplicações reais à medida que aprendem os fundamentos da programação. O uso da biblioteca padrão também ensina os alunos sobre a reutilização de código. Os módulos de terceiros, como o PyGame, também são úteis para ampliar o alcance dos estudantes.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
pt_br: O intérprete interativo do Python permite aos alunos testar recursos da linguagem enquanto estão programando. Os mesmos podem manter uma janela com o intérprete executado enquanto digitam a fonte do seu programa numa outra janela. Se eles não conseguirem se lembrar dos métodos de uma lista, eles podem fazer algo assim::

source: With the interpreter, documentation is never far from the student as they are programming.
pt_br: Com o intérprete, a documentação nunca está longe do aluno, pois estão programando.

source: There are also good IDEs for Python. IDLE is a cross-platform IDE for Python that is written in Python using Tkinter. PythonWin is a Windows-specific IDE. Emacs users will be happy to know that there is a very good Python mode for Emacs. All of these programming environments provide syntax highlighting, auto-indenting, and access to the interactive interpreter while coding. Consult `the Python wiki <https://wiki.python.org/moin/PythonEditors>`_ for a full list of Python editing environments.
pt_br: Há também boas IDEs para o Python. O IDLE é uma IDE multiplataforma para o Python e que foi escrito em Python usando o Tkinter. O PythonWin é uma IDE específica para o Windows. Os usuários do Emacs estarão felizes em saber que existe um ótimo modo Python para Emacs. Todos esses ambientes de programação fornecem destaque de sintaxe, recuo automático e acesso ao intérprete interativo durante o tempo de desenvolvimento. Consulte `o wiki do Python <https://wiki.python.org/moin/PythonEditors>`_ para obter uma lista completa dos ambientes de desenvolvimento para o Python.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
pt_br: Se você quiseres discutir o uso do Python na educação, poderás estar interessado em se juntar à lista de discussão edu-sig `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
