Repository: python/python-docs-pt-br
Catalog: faq/gui.po
Languages: pt_br

source: Graphic User Interface FAQ
pt_br: FAQ da Interface Gráfica do Usuário

source: Contents
pt_br: Conteúdo

source: General GUI Questions
pt_br: Perguntas Gerais sobre a GUI

source: What platform-independent GUI toolkits exist for Python?
pt_br: Que ferramentas de GUI independentes da plataforma existem para o Python?

source: Depending on what platform(s) you are aiming at, there are several. Some of them haven't been ported to Python 3 yet. At least `Tkinter`_ and `Qt`_ are known to be Python 3-compatible.
pt_br: Dependendo da plataforma (s) que você está apontando, existem vários. Alguns deles ainda não foram portados para o Python 3. Pelo menos, 'Tkinter`_ e `Qt`_ são conhecidos como compatíveis com Python 3.

source: Standard builds of Python include an object-oriented interface to the Tcl/Tk widget set, called :ref:`tkinter <Tkinter>`. This is probably the easiest to install (since it comes included with most `binary distributions <https://www.python.org/downloads/>`_ of Python) and use. For more info about Tk, including pointers to the source, see the `Tcl/Tk home page <https://www.tcl.tk>`_. Tcl/Tk is fully portable to the Mac OS X, Windows, and Unix platforms.
pt_br: As versões padrão do Python incluem uma interface orientada a objetos para o conjunto de widgets Tcl / Tk, chamado: ref: `tkinter 1`. Este é provavelmente o mais fácil de instalar (uma vez que vem incluído na maioria das "distribuições binárias <https://www.python.org/downloads/>` _ of Python) e uso. Para obter mais informações sobre o Tk, incluindo ponteiros para a fonte, consulte a página inicial do `Tcl / Tk <https://www.tcl.tk>` _. Tcl / Tk é totalmente portátil para as plataformas Mac OS X, Windows e Unix.

source: wxWidgets (https://www.wxwidgets.org) is a free, portable GUI class library written in C++ that provides a native look and feel on a number of platforms, with Windows, Mac OS X, GTK, X11, all listed as current stable targets. Language bindings are available for a number of languages including Python, Perl, Ruby, etc.
pt_br: WxWidgets (https://www.wxwidgets.org) é uma biblioteca de classe GUI livre e portátil escrita em C ++ que fornece uma aparência e sensação nativas em várias plataformas, com Windows, Mac OS X, GTK, X11, todos listados como Metas estáveis atuais. As ligações de idiomas estão disponíveis para vários idiomas, incluindo Python, Perl, Ruby, etc.

source: `wxPython <https://www.wxpython.org>`_ is the Python binding for wxwidgets. While it often lags slightly behind the official wxWidgets releases, it also offers a number of features via pure Python extensions that are not available in other language bindings. There is an active wxPython user and developer community.
pt_br: `wxPython <https://www.wxpython.org>`_ é a ligação do Python para wxwidgets. Embora muitas vezes fique um pouco atrás dos lançamentos oficiais do wxWidgets, também oferece vários recursos por meio de extensões Python puras que não estão disponíveis em outras associações de linguagem. Há uma comunidade ativa de usuários e desenvolvedores do wxPython.

source: Both wxWidgets and wxPython are free, open source, software with permissive licences that allow their use in commercial products as well as in freeware or shareware.
pt_br: Ambos wxWidgets e wxPython são gratuitos, de código aberto, software com licenças permissivas que permitem seu uso em produtos comerciais, bem como em freeware ou shareware.

source: There are bindings available for the Qt toolkit (using either `PyQt <https://riverbankcomputing.com/software/pyqt/intro>`_ or `PySide <https://wiki.qt.io/PySide>`_) and for KDE (`PyKDE4 <https://techbase.kde.org/Languages/Python/Using_PyKDE_4>`__). PyQt is currently more mature than PySide, but you must buy a PyQt license from `Riverbank Computing <https://www.riverbankcomputing.com/commercial/license-faq>`_ if you want to write proprietary applications. PySide is free for all applications.
pt_br: Existem ligações disponíveis para o kit de ferramentas Qt (usando PyQt <https://riverbankcomputing.com/software/pyqt/intro> `_ ou` PySide <https://wiki.qt.io/PySide> `_) e Para o KDE (`PyKDE4 <https://techbase.kde.org/Languages/Python/Using_PyKDE_4>` __). O PyQt é atualmente mais maduro do que o PySide, mas você deve comprar uma licença PyQt da `Riverbank Computing <https://www.riverbankcomputing.com/commercial/license-faq>` _ se você deseja escrever aplicativos proprietários. PySide é gratuito para todas as aplicações.

source: Qt 4.5 upwards is licensed under the LGPL license; also, commercial licenses are available from `The Qt Company <https://www.qt.io/licensing/>`_.
pt_br: Qt 4.5 para cima é licenciado sob a licença LGPL; Além disso, as licenças comerciais estão disponíveis na `The Qt Company <https://www.qt.io/licensing/>` _.

source: The `GObject introspection bindings <https://wiki.gnome.org/Projects/PyGObject>`_ for Python allow you to write GTK+ 3 applications. There is also a `Python GTK+ 3 Tutorial <https://python-gtk-3-tutorial.readthedocs.io>`_.
pt_br: As `ligações de introspecção de GObject <https://wiki.gnome.org/Projects/PyGObject>`_ para o Python permitem escrever aplicativos GTK+ 3. Há também um tutorial `Python GTK+ 3 <https://python-gtk-3-tutorial.readthedocs.io>`_.

source: The older PyGtk bindings for the `Gtk+ 2 toolkit <https://www.gtk.org>`_ have been implemented by James Henstridge; see <http://www.pygtk.org>.
pt_br: As ligações PyGtk mais antigas para o `kit de ferramentas GTK+ 2 <https://www.gtk.org>`_ foram implementadas por James Henstridge; veja <http://www.pygtk.org>.

source: `Kivy <https://kivy.org/>`_ is a cross-platform GUI library supporting both desktop operating systems (Windows, macOS, Linux) and mobile devices (Android, iOS). It is written in Python and Cython, and can use a range of windowing backends.
pt_br: `Kivy <https://kivy.org/>` _ é uma biblioteca GUI multi-plataforma que suporta sistemas operacionais de desktop (Windows, MacOS, Linux) e dispositivos móveis (Android, iOS). Está escrito em Python e Cython, e pode usar uma gama de backends de janelas.

source: Kivy is free and open source software distributed under the MIT license.
pt_br: O Kivy é um software livre e de código aberto distribuído sob a licença MIT.

source: Python bindings for `the FLTK toolkit <http://www.fltk.org>`_, a simple yet powerful and mature cross-platform windowing system, are available from `the PyFLTK project <http://pyfltk.sourceforge.net>`_.
pt_br: As ligações Python para `the FLTK toolkit <http://www.fltk.org>` _, um sistema de janelas multiplataforma simples, porém poderoso e maduro, estão disponíveis no `projeto PyFLTK <http://pyfltk.sourceforge.net > `_.

source: For OpenGL bindings, see `PyOpenGL <http://pyopengl.sourceforge.net>`_.
pt_br: Para ligações OpenGL, veja `PyOpenGL <http://pyopengl.sourceforge.net>` _.

source: What platform-specific GUI toolkits exist for Python?
pt_br: Que kits de ferramentas GUI específicos da plataforma existem para o Python?

source: By installing the `PyObjc Objective-C bridge <https://pypi.org/project/pyobjc/>`_, Python programs can use Mac OS X's Cocoa libraries.
pt_br: Instalando a `ponte PyObjc Objective-C <https://pypi.org/project/pyobjc/>`_, os programas Python podem usar as bibliotecas Cocoa do Mac OS X.

source: :ref:`Pythonwin <windows-faq>` by Mark Hammond includes an interface to the Microsoft Foundation Classes and a Python programming environment that's written mostly in Python using the MFC classes.
pt_br: : Ref: `Pythonwin 1 'de Mark Hammond inclui uma interface para o Microsoft Foundation Classes e um ambiente de programação Python que está escrito principalmente em Python usando as classes MFC.

source: Tkinter questions
pt_br: Perguntas do Tkinter

source: How do I freeze Tkinter applications?
pt_br: Como eu pauso as aplicações Tkinter?

source: Freeze is a tool to create stand-alone applications. When freezing Tkinter applications, the applications will not be truly stand-alone, as the application will still need the Tcl and Tk libraries.
pt_br: Freeze é uma ferramenta para criar aplicativos autônomos. Ao congelar aplicativos Tkinter, os aplicativos não serão verdadeiramente autônomos, pois o aplicativo ainda precisará das bibliotecas Tcl e Tk.

source: One solution is to ship the application with the Tcl and Tk libraries, and point to them at run-time using the :envvar:`TCL_LIBRARY` and :envvar:`TK_LIBRARY` environment variables.
pt_br: Uma solução é enviar o aplicativo com as bibliotecas Tcl e Tk e apontá-las em tempo de execução usando as variáveis de ambiente: envvar: `TCL_LIBRARY` e: envvar:` TK_LIBRARY`.

source: To get truly stand-alone applications, the Tcl scripts that form the library have to be integrated into the application as well. One tool supporting that is SAM (stand-alone modules), which is part of the Tix distribution (http://tix.sourceforge.net/).
pt_br: Para obter aplicativos verdadeiramente autônomos, os scripts Tcl que formam a biblioteca também precisam ser integrados no aplicativo. Uma ferramenta que suporta isso é SAM (módulos autônomos), que faz parte da distribuição Tix (http://tix.sourceforge.net/).

source: Build Tix with SAM enabled, perform the appropriate call to :c:func:`Tclsam_init`, etc. inside Python's :file:`Modules/tkappinit.c`, and link with libtclsam and libtksam (you might include the Tix libraries as well).
pt_br: Crie o Tix com SAM habilitado, execute a chamada apropriada para: c: func: `Tclsam_init`, etc. dentro do arquivo Python:` Módulos / tkappinit.c` e link com libtclsam e libtksam (você também pode incluir as bibliotecas Tix) ).

source: Can I have Tk events handled while waiting for I/O?
pt_br: Posso ter eventos Tk manipulados enquanto aguardo I / O?

source: On platforms other than Windows, yes, and you don't even need threads! But you'll have to restructure your I/O code a bit. Tk has the equivalent of Xt's :c:func:`XtAddInput()` call, which allows you to register a callback function which will be called from the Tk mainloop when I/O is possible on a file descriptor. See :ref:`tkinter-file-handlers`.
pt_br: Em plataformas diferentes do Windows, sim, e você nem precisa de threads! Mas você terá que reestruturar seu código de E / S um pouco. O Tk tem o equivalente a Xt: c: func: `XtAddInput ()` chamada, que permite que você registre uma função de retorno de chamada que será chamada a partir do mainkop Tk quando I / O é possível em um descritor de arquivo. Consulte: ref: `tkinter-file-handlers`.

source: I can't get key bindings to work in Tkinter: why?
pt_br: Não consigo obter ligações chave para trabalhar em Tkinter: por quê?

source: An often-heard complaint is that event handlers bound to events with the :meth:`bind` method don't get handled even when the appropriate key is pressed.
pt_br: Uma queixa frequentemente ouvida é que os manipuladores de eventos vinculados a eventos com o método: meth: `bind` não são manipulados mesmo quando a tecla apropriada é pressionada.

source: The most common cause is that the widget to which the binding applies doesn't have "keyboard focus". Check out the Tk documentation for the focus command. Usually a widget is given the keyboard focus by clicking in it (but not for labels; see the takefocus option).
pt_br: A causa mais comum é que o widget para o qual a ligação se aplica não possui "foco no teclado". Confira a documentação do Tk para o comando de foco. Normalmente, um widget é dado o foco do teclado clicando nele (mas não para rótulos, veja a opção takefocus).
