Repository: python/python-docs-pt-br
Catalog: faq/library.po
Languages: pt_br

source: Library and Extension FAQ
pt_br: FAQ de Bibliotecas e Extensões

source: Contents
pt_br: Conteúdo

source: General Library Questions
pt_br: Questões gerais sobre bibliotecas

source: How do I find a module or application to perform task X?
pt_br: Como encontrar um módulo ou aplicação para realizar uma tarefa X?

source: Check :ref:`the Library Reference <library-index>` to see if there's a relevant standard library module. (Eventually you'll learn what's in the standard library and will be able to skip this step.)
pt_br: Verifique :ref:`a Referência de Bibliotecas <library-index>` para ver se há um módulo relevante da biblioteca padrão. (Eventualmente, você aprenderá o que está na biblioteca padrão e poderá pular esta etapa.)

source: For third-party packages, search the `Python Package Index <https://pypi.org>`_ or try `Google <https://www.google.com>`_ or another web search engine. Searching for "Python" plus a keyword or two for your topic of interest will usually find something helpful.
pt_br: Para pacotes de terceiros, pesquise no `Python Package Index <https://pypi.org>`_ ou tente no `Google <https://www.google.com>`_ ou outro buscador na web. Pesquisando por "Python" mais uma ou dois argumentos nomeados do seu tópico de interesse geralmente encontrará algo útil.

source: Where is the math.py (socket.py, regex.py, etc.) source file?
pt_br: Onde está o código-fonte do math.py (socket.py, regex.py, etc.)?

source: If you can't find a source file for a module it may be a built-in or dynamically loaded module implemented in C, C++ or other compiled language. In this case you may not have the source file or it may be something like :file:`mathmodule.c`, somewhere in a C source directory (not on the Python Path).
pt_br: Se você não conseguir encontrar um arquivo de origem para um módulo, ele pode ser um módulo embutido ou carregado dinamicamente, implementado em C, C++ ou outra linguagem compilada. Nesse caso, você pode não ter o arquivo de origem ou pode ser algo como :file:`mathmodule.c`, em algum lugar do diretório de origem C (não no caminho do Python).

source: There are (at least) three kinds of modules in Python:
pt_br: Existem (pelo menos) três tipos de módulos no Python:

source: modules written in Python (.py);
pt_br: módulos escritos em Python (.py)

source: modules written in C and dynamically loaded (.dll, .pyd, .so, .sl, etc);
pt_br: módulos escritos em C e carregados dinamicamente (.dll, .pyd, .so, .sl, etc.);

source: modules written in C and linked with the interpreter; to get a list of these, type::
pt_br: módulos escritos em C e vinculados ao interpretador; para obter uma dessas listas, digite::

source: How do I make a Python script executable on Unix?
pt_br: Como tornar um script Python executável no Unix?

source: You need to do two things: the script file's mode must be executable and the first line must begin with ``#!`` followed by the path of the Python interpreter.
pt_br: Você precisa fazer duas coisas: o arquivo do script deve ser executável e a primeira linha deve começar com ``#!`` seguido do caminho do interpretador Python.

source: The first is done by executing ``chmod +x scriptfile`` or perhaps ``chmod 755 scriptfile``.
pt_br: Inicialmente, execute o ``chmod +x scriptfile`` ou, talvez, o ``chmod 755 scriptfile``.

source: The second can be done in a number of ways. The most straightforward way is to write ::
pt_br: A segunda coisa pode ser feita de várias maneiras. A maneira mais direta é escrever ::

source: as the very first line of your file, using the pathname for where the Python interpreter is installed on your platform.
pt_br: como a primeira linha do seu arquivo, usando o endereço do caminho onde o interpretador Python está instalado.

source: If you would like the script to be independent of where the Python interpreter lives, you can use the :program:`env` program. Almost all Unix variants support the following, assuming the Python interpreter is in a directory on the user's :envvar:`PATH`::
pt_br: Se você deseja que o script seja independente de onde o interpretador Python mora, você pode usar o programa :program:`env`. Quase todas as variantes do Unix suportam o seguinte, presumindo que o interpretador Python esteja em um diretório no :envvar:`PATH` do usuário::

source: *Don't* do this for CGI scripts. The :envvar:`PATH` variable for CGI scripts is often very minimal, so you need to use the actual absolute pathname of the interpreter.
pt_br: Não faça isso para CGI scripts. A variável :envvar:`PATH` para CGI scripts é normalmente muito pequena, portanto, você precisa usar o caminho completo do interpretador.

source: Occasionally, a user's environment is so full that the :program:`/usr/bin/env` program fails; or there's no env program at all. In that case, you can try the following hack (due to Alex Rezinsky):
pt_br: Ocasionalmente, o ambiente de um usuário está tão cheio que o programa :program:`/usr/bin/env` falha; ou não há nenhum programa env. Nesse caso, você pode tentar o seguinte hack (graças a Alex Rezinsky):

source: The minor disadvantage is that this defines the script's __doc__ string. However, you can fix that by adding ::
pt_br: Uma pequena desvantagem é que isso define o script's __doc__ string. Entretanto, você pode corrigir isso adicionando ::

source: __doc__ = """...Whatever..."""
pt_br: __doc__ = """...Alguma coisa..."""

source: Is there a curses/termcap package for Python?
pt_br: Existe um pacote de curses/termcap para Python?

source: For Unix variants: The standard Python source distribution comes with a curses module in the :source:`Modules` subdirectory, though it's not compiled by default. (Note that this is not available in the Windows distribution -- there is no curses module for Windows.)
pt_br: Para variantes Unix: A distribuição fonte padrão do Python vem com um módulo do curses no subdiretório :source:`Modules`, embora não seja compilado por padrão. (Observe que isso não está disponível na distribuição do Windows -- não há módulo curses para o Windows.)

source: The :mod:`curses` module supports basic curses features as well as many additional functions from ncurses and SYSV curses such as colour, alternative character set support, pads, and mouse support. This means the module isn't compatible with operating systems that only have BSD curses, but there don't seem to be any currently maintained OSes that fall into this category.
pt_br: O módulo :mod:`curses` provê recursos básicos de curses, bem como muitas funções adicionais de ncurses e curses SYSV, como cor, suporte a conjuntos de caracteres alternativos, pads e suporte a mouse. Isso significa que o módulo não é compatível com sistemas operacionais que possuem apenas maldições BSD, mas não parece haver nenhum sistema operacional mantido atualmente que se enquadre nesta categoria.

source: Is there an equivalent to C's onexit() in Python?
pt_br: Existe a função onexit() equivalente ao C no Python?

source: The :mod:`atexit` module provides a register function that is similar to C's :c:func:`!onexit`.
pt_br: O módulo :mod:`atexit` fornece uma função de registro similar ao :c:func:`!onexit` do C.

source: Why don't my signal handlers work?
pt_br: Por que o meu manipulador de sinal não funciona?

source: The most common problem is that the signal handler is declared with the wrong argument list. It is called as ::
pt_br: O maior problema é que o manipulador de sinal é declarado com uma lista de argumentos incorretos. Isso é chamado como ::

source: handler(signum, frame)
pt_br: manipulador(num_sinal, quadro)

source: so it should be declared with two parameters::
pt_br: portanto, isso deve ser declarado com dois parâmetros::

source: def handler(signum, frame): ...
pt_br: def manipulador(num_sinal, quadro): ...

source: Common tasks
pt_br: Tarefas comuns

source: How do I test a Python program or component?
pt_br: Como testar um programa ou componente Python?

source: Python comes with two testing frameworks. The :mod:`doctest` module finds examples in the docstrings for a module and runs them, comparing the output with the expected output given in the docstring.
pt_br: A Python vem com dois frameworks de teste. O módulo :mod:`doctest` busca por exemplos nas docstrings de um módulo e os executa, comparando o resultado com a saída esperada informada na docstring.

source: The :mod:`unittest` module is a fancier testing framework modelled on Java and Smalltalk testing frameworks.
pt_br: O módulo :mod:`unittest` é uma estrutura de teste mais sofisticada, modelada nas estruturas de teste do Java e do Smalltalk.

source: To make testing easier, you should use good modular design in your program. Your program should have almost all functionality encapsulated in either functions or class methods -- and this sometimes has the surprising and delightful effect of making the program run faster (because local variable accesses are faster than global accesses). Furthermore the program should avoid depending on mutating global variables, since this makes testing much more difficult to do.
pt_br: Para facilitar os testes, você deve usar um bom design modular em seu programa. Seu programa deve ter quase todas as funcionalidades encapsuladas em funções ou métodos de classe -- e isso às vezes tem o efeito surpreendente e agradável de fazer o programa executar mais rápido (porque os acessos às variáveis locais são mais rápidos que os acessos globais). Além disso, o programa deve evitar depender de variáveis globais mutantes, pois isso torna os testes muito mais difíceis de serem realizados.

source: The "global main logic" of your program may be as simple as ::
pt_br: A lógica principal do seu programa pode tão simples quanto ::

source: at the bottom of the main module of your program.
pt_br: no botão do módulo principal do seus programa.

source: Once your program is organized as a tractable collection of function and class behaviours, you should write test functions that exercise the behaviours. A test suite that automates a sequence of tests can be associated with each module. This sounds like a lot of work, but since Python is so terse and flexible it's surprisingly easy. You can make coding much more pleasant and fun by writing your test functions in parallel with the "production code", since this makes it easy to find bugs and even design flaws earlier.
pt_br: Depois que seu programa estiver organizado como uma coleção tratável de comportamentos de funções e classes, você deverá escrever funções de teste que exercitem os comportamentos. Um conjunto de testes que automatiza uma sequência de testes pode ser associado a cada módulo. Parece muito trabalhoso, mas como o Python é tão conciso e flexível, é surpreendentemente fácil. Você pode tornar a codificação muito mais agradável e divertida escrevendo suas funções de teste em paralelo com o "código de produção", pois isso torna mais fácil encontrar bugs e até mesmo falhas de design mais cedo.

source: "Support modules" that are not intended to be the main module of a program may include a self-test of the module. ::
pt_br: Os "módulos de suporte" que não se destinam a ser o módulo principal de um programa podem incluir um autoteste do módulo. ::

source: Even programs that interact with complex external interfaces may be tested when the external interfaces are unavailable by using "fake" interfaces implemented in Python.
pt_br: Mesmo quando as interfaces externas não estiverem disponíveis, os programas que interagem com interfaces externas complexas podem ser testados usando as interfaces "falsas" implementadas no Python.

source: How do I create documentation from doc strings?
pt_br: Como faço para criar uma documentação de doc strings?

source: The :mod:`pydoc` module can create HTML from the doc strings in your Python source code. An alternative for creating API documentation purely from docstrings is `epydoc <https://epydoc.sourceforge.net/>`_. `Sphinx <https://www.sphinx-doc.org>`_ can also include docstring content.
pt_br: O módulo :mod:`pydoc` pode criar HTML a partir das strings de documentos em seu código-fonte Python. Uma alternativa para criar documentação de API puramente a partir de docstrings é `epydoc <https://epydoc.sourceforge.net/>`_. `Sphinx <https://www.sphinx-doc.org>`_ também pode incluir conteúdo docstring.

source: How do I get a single keypress at a time?
pt_br: Como faço para pressionar uma tecla de cada vez?

source: For Unix variants there are several solutions. It's straightforward to do this using curses, but curses is a fairly large module to learn.
pt_br: Para variantes do Unix existem várias soluções. Apesar de ser um módulo grande para aprender, é simples fazer isso usando o módulo curses.

source: How do I program using threads?
pt_br: Como faço para programar usando threads?

source: Be sure to use the :mod:`threading` module and not the :mod:`_thread` module. The :mod:`threading` module builds convenient abstractions on top of the low-level primitives provided by the :mod:`_thread` module.
pt_br: Certifique-se de usar o módulo :mod:`threading` e não o módulo :mod:`_thread`. O módulo :mod:`threading` constrói abstrações convenientes sobre as primitivas de baixo nível fornecidas pelo módulo :mod:`_thread`.

source: None of my threads seem to run: why?
pt_br: Nenhuma de minhas threads parece funcionar, por que?

source: As soon as the main thread exits, all threads are killed. Your main thread is running too quickly, giving the threads no time to do any work.
pt_br: Assim que a thread principal acaba, todas as threads são eliminadas. Sua thread principal está sendo executada tão rápida que não está dando tempo para realizar qualquer trabalho.

source: A simple fix is to add a sleep to the end of the program that's long enough for all the threads to finish::
pt_br: Uma solução simples é adicionar um tempo de espera no final do programa até que todos os threads sejam concluídos::

source: But now (on many platforms) the threads don't run in parallel, but appear to run sequentially, one at a time! The reason is that the OS thread scheduler doesn't start a new thread until the previous thread is blocked.
pt_br: Mas agora (em muitas plataformas) as threads não funcionam em paralelo, mas parecem funcionar sequencialmente, um de cada vez! O motivo é que o agendador de threads do sistema operacional não inicia uma nova thread até que a thread anterior seja bloqueada.

source: A simple fix is to add a tiny sleep to the start of the run function::
pt_br: Uma solução simples é adicionar um pequeno tempo de espera no início da função::

source: Instead of trying to guess a good delay value for :func:`time.sleep`, it's better to use some kind of semaphore mechanism. One idea is to use the :mod:`queue` module to create a queue object, let each thread append a token to the queue when it finishes, and let the main thread read as many tokens from the queue as there are threads.
pt_br: Em vez de tentar adivinhar um bom valor de atraso para :func:`time.sleep`, é melhor usar algum tipo de mecanismo de semáforo. Uma ideia é usar o módulo :mod:`queue` para criar um objeto fila, deixar cada thread anexar um token à fila quando terminar e deixar a thread principal ler tantos tokens da fila quantos threads houver.

source: How do I parcel out work among a bunch of worker threads?
pt_br: Como distribuo o trabalho entre várias threads de trabalho?

source: The easiest way is to use the :mod:`concurrent.futures` module, especially the :mod:`~concurrent.futures.ThreadPoolExecutor` class.
pt_br: A maneira mais fácil é usar o módulo :mod:`concurrent.futures`, especialmente a classe :mod:`~concurrent.futures.ThreadPoolExecutor`.

source: Or, if you want fine control over the dispatching algorithm, you can write your own logic manually. Use the :mod:`queue` module to create a queue containing a list of jobs. The :class:`~queue.Queue` class maintains a list of objects and has a ``.put(obj)`` method that adds items to the queue and a ``.get()`` method to return them. The class will take care of the locking necessary to ensure that each job is handed out exactly once.
pt_br: Ou, se quiser um controle preciso sobre o algoritmo de despacho, você pode escrever sua própria lógica manualmente. Use o módulo :mod:`queue` para criar uma fila contendo uma lista de tarefas. A classe :class:`~queue.Queue` mantém uma lista de objetos e possui um método ``.put(obj)`` que adiciona itens à fila e um método ``.get()`` para retorná-los. A classe cuidará da trava necessário para garantir que cada trabalho seja entregue exatamente uma vez.

source: Here's a trivial example::
pt_br: Aqui está um exemplo simples::

source: import threading, queue, time # The worker thread gets jobs off the queue. When the queue is empty, it # assumes there will be no more work and exits. # (Realistically workers will run until terminated.) def worker(): print('Running worker') time.sleep(0.1) while True: try: arg = q.get(block=False) except queue.Empty: print('Worker', threading.current_thread(), end=' ') print('queue empty') break else: print('Worker', threading.current_thread(), end=' ') print('running with argument', arg) time.sleep(0.5) # Create queue q = queue.Queue() # Start a pool of 5 workers for i in range(5): t = threading.Thread(target=worker, name='worker %i' % (i+1)) t.start() # Begin adding work to the queue for i in range(50): q.put(i) # Give threads time to run print('Main thread sleeping') time.sleep(5)
pt_br: import threading, queue, time # A thread do worker obtém a tarefa da fila. Quando a fila está vazia, # ela presume que não haverá mais tarefas e encerra. # (Realisticamente, workers trabalharão até serem encerrados.) def worker(): print('Running worker') time.sleep(0.1) while True: try: arg = q.get(block=False) except queue.Empty: print('Worker', threading.current_thread(), end=' ') print('queue empty') break else: print('Worker', threading.current_thread(), end=' ') print('running with argument', arg) time.sleep(0.5) # Cria a fila q = queue.Queue() # Inicia um pool de 5 workers for i in range(5): t = threading.Thread(target=worker, name='worker %i' % (i+1)) t.start() # Começa a adicionar tarefa à fila for i in range(50): q.put(i) # Dá às threads tempo para executar print('Main thread sleeping') time.sleep(5)

source: When run, this will produce the following output:
pt_br: Quando executado, isso produzirá a seguinte saída:

source: Consult the module's documentation for more details; the :class:`~queue.Queue` class provides a featureful interface.
pt_br: Consulte a documentação do módulo para mais detalhes; a classe :class:`~queue.Queue` fornece uma interface com recursos.

source: What kinds of global value mutation are thread-safe?
pt_br: Que tipos de variáveis globais mutáveis são seguras para thread?

source: A :term:`global interpreter lock` (GIL) is used internally to ensure that only one thread runs in the Python VM at a time. In general, Python offers to switch among threads only between bytecode instructions; how frequently it switches can be set via :func:`sys.setswitchinterval`. Each bytecode instruction and therefore all the C implementation code reached from each instruction is therefore atomic from the point of view of a Python program.
pt_br: Uma :term:`trava global do interpretador` (GIL) é usada internamente para garantir que apenas um thread seja executado na VM Python por vez. Em geral, Python oferece alternar entre threads apenas entre instruções de bytecode; a frequência com que ele muda pode ser definida via :func:`sys.setswitchinterval`. Cada instrução de bytecode e, portanto, todo o código de implementação C alcançado por cada instrução é, portanto, atômico do ponto de vista de um programa Python.

source: In theory, this means an exact accounting requires an exact understanding of the PVM bytecode implementation. In practice, it means that operations on shared variables of built-in data types (ints, lists, dicts, etc) that "look atomic" really are.
pt_br: Em teoria, isso significa que uma contabilidade exata requer um entendimento exato da implementação do bytecode PVM. Na prática, isso significa que as operações em variáveis compartilhadas de tipos de dados integrados (inteiros, listas, dicionarios, etc.) que "parecem atômicas" realmente são.

source: For example, the following operations are all atomic (L, L1, L2 are lists, D, D1, D2 are dicts, x, y are objects, i, j are ints)::
pt_br: Por exemplo, as seguintes operações são todas atômicas (L, L1, L2 são listas, D, D1, D2 são dicionários, x, y são objetos, i, j são inteiros)::

source: These aren't::
pt_br: Esses não são::

source: Operations that replace other objects may invoke those other objects' :meth:`~object.__del__` method when their reference count reaches zero, and that can affect things. This is especially true for the mass updates to dictionaries and lists. When in doubt, use a mutex!
pt_br: Operações que substituem outros objetos podem invocar o método :meth:`~object.__del__` desses outros objetos quando sua contagem de referências chega a zero, e isso pode afetar as coisas. Isto é especialmente verdadeiro para as atualizações em massa de dicionários e listas. Em caso de dúvida, use um mutex!

source: Can't we get rid of the Global Interpreter Lock?
pt_br: Não podemos remover a Trava Global do interpretador?

source: The :term:`global interpreter lock` (GIL) is often seen as a hindrance to Python's deployment on high-end multiprocessor server machines, because a multi-threaded Python program effectively only uses one CPU, due to the insistence that (almost) all Python code can only run while the GIL is held.
pt_br: A :term:`trava global do interpretador` (GIL) é frequentemente vista como um obstáculo para a implantação do Python em máquinas servidoras multiprocessadas de ponta, porque um programa Python multi-threaded efetivamente usa apenas uma CPU, devido à insistência de que (quase) todo código Python só pode ser executado enquanto a GIL é mantida.

source: With the approval of :pep:`703` work is now underway to remove the GIL from the CPython implementation of Python. Initially it will be implemented as an optional compiler flag when building the interpreter, and so separate builds will be available with and without the GIL. Long-term, the hope is to settle on a single build, once the performance implications of removing the GIL are fully understood. Python 3.13 is likely to be the first release containing this work, although it may not be completely functional in this release.
pt_br: Com a aprovação da :pep:`703`, o trabalho está em andamento para remover a GIL da implementação CPython do Python. Inicialmente, ele será implementado como um sinalizador opcional de compilador ao construir o interpretador, e assim construções separadas estarão disponíveis com e sem a GIL. A longo prazo, a esperança é estabelecer uma única construção, uma vez que as implicações de desempenho da remoção do GIL sejam totalmente compreendidas. O Python 3.13 provavelmente será a primeira versão contendo esse trabalho, embora possa não ser completamente funcional nesta versão.
