Repository: python/python-docs-pt-br
Catalog: faq/library.po
Languages: pt_br

source: The current work to remove the GIL is based on a `fork of Python 3.9 with the GIL removed <https://github.com/colesbury/nogil>`_ by Sam Gross. Prior to that, in the days of Python 1.5, Greg Stein actually implemented a comprehensive patch set (the "free threading" patches) that removed the GIL and replaced it with fine-grained locking. Adam Olsen did a similar experiment in his `python-safethread <https://code.google.com/archive/p/python-safethread>`_ project. Unfortunately, both of these earlier experiments exhibited a sharp drop in single-thread performance (at least 30% slower), due to the amount of fine-grained locking necessary to compensate for the removal of the GIL. The Python 3.9 fork is the first attempt at removing the GIL with an acceptable performance impact.
pt_br: O trabalho atual para remover a GIL é baseado em um `fork do Python 3.9 com a GIL removida <https://github.com/colesbury/nogil>`_ por Sam Gross. Antes disso, na época do Python 1.5, Greg Stein implementou um conjunto abrangente de patches (os patches de "threads livres") que removeu a GIL e a substituiu por um travamento de granulação fina. Adam Olsen fez um experimento semelhante em seu projeto `python-safethread <https://code.google.com/archive/p/python-safethread>`_. Infelizmente, ambos os experimentos iniciais exibiram uma queda acentuada no desempenho de thread único (pelo menos 30% mais lento), devido à quantidade de travamento de granulação fina necessária para compensar a remoção da GIL. O fork do Python 3.9 é a primeira tentativa de remover a GIL com um impacto aceitável no desempenho.

source: The presence of the GIL in current Python releases doesn't mean that you can't make good use of Python on multi-CPU machines! You just have to be creative with dividing the work up between multiple *processes* rather than multiple *threads*. The :class:`~concurrent.futures.ProcessPoolExecutor` class in the new :mod:`concurrent.futures` module provides an easy way of doing so; the :mod:`multiprocessing` module provides a lower-level API in case you want more control over dispatching of tasks.
pt_br: A presença da GIL nas versões atuais do Python não significa que você não pode fazer bom uso do Python em máquinas com várias CPUs! Você só precisa ser criativo ao dividir o trabalho entre vários *processos* em vez de vários *threads*. A classe :class:`~concurrent.futures.ProcessPoolExecutor` no novo módulo :mod:`concurrent.futures` fornece uma maneira fácil de fazer isso; o módulo :mod:`multiprocessing` fornece uma API de nível inferior, caso você queira mais controle sobre o despacho de tarefas.

source: Judicious use of C extensions will also help; if you use a C extension to perform a time-consuming task, the extension can release the GIL while the thread of execution is in the C code and allow other threads to get some work done. Some standard library modules such as :mod:`zlib` and :mod:`hashlib` already do this.
pt_br: O uso criterioso de extensões C também ajudará; se você usar uma extensão C para executar uma tarefa demorada, a extensão poderá liberar a GIL enquanto o thread de execução estiver no código C e permitir que outros threads realizem algum trabalho. Alguns módulos de biblioteca padrão como :mod:`zlib` e :mod:`hashlib` já fazem isso.

source: An alternative approach to reducing the impact of the GIL is to make the GIL a per-interpreter-state lock rather than truly global. This was :ref:`first implemented in Python 3.12 <whatsnew312-pep684>` and is available in the C API. A Python interface to it is expected in Python 3.13. The main limitation to it at the moment is likely to be 3rd party extension modules, since these must be written with multiple interpreters in mind in order to be usable, so many older extension modules will not be usable.
pt_br: Uma abordagem alternativa para reduzir o impacto da GIL é fazer da GIL uma trava por estado do interpretador em vez de verdadeiramente global. Isso foi :ref:`implementado pela primeira vez no Python 3.12 <whatsnew312-pep684>` e está disponível na API C. Uma interface Python para ele é esperada no Python 3.13. A principal limitação para ele no momento provavelmente são módulos de extensão de terceiros, já que estes devem ser escritos com múltiplos interpretadores em mente para serem utilizáveis, então muitos módulos de extensão mais antigos não serão utilizáveis.

source: Input and Output
pt_br: Entrada e Saída

source: How do I delete a file? (And other file questions...)
pt_br: Como faço para excluir um arquivo? (E outras perguntas sobre arquivos)

source: Use ``os.remove(filename)`` or ``os.unlink(filename)``; for documentation, see the :mod:`os` module. The two functions are identical; :func:`~os.unlink` is simply the name of the Unix system call for this function.
pt_br: Use ``os.remove(arquivo)`` ou ``os.unlink(arquivo)``; para documentação, veja o módulo :mod:`os`. As duas funções são idênticas; :func:`~os.unlink` é simplesmente o nome da chamada do sistema para esta função no Unix.

source: To remove a directory, use :func:`os.rmdir`; use :func:`os.mkdir` to create one. ``os.makedirs(path)`` will create any intermediate directories in ``path`` that don't exist. ``os.removedirs(path)`` will remove intermediate directories as long as they're empty; if you want to delete an entire directory tree and its contents, use :func:`shutil.rmtree`.
pt_br: Para remover um diretório, use :func:`os.rmdir`; use :func:`os.mkdir` para criar um. ``os.makedirs(caminho)`` criará quaisquer diretórios intermediários em ``path`` que não existam. ``os.removedirs(caminho)`` removerá diretórios intermediários, desde que estejam vazios; se quiser excluir toda uma árvore de diretórios e seu conteúdo, use :func:`shutil.rmtree`.

source: To rename a file, use ``os.rename(old_path, new_path)``.
pt_br: Para renomear um arquivos, use ``os.rename(caminho_antigo, caminho_novo)``.

source: To truncate a file, open it using ``f = open(filename, "rb+")``, and use ``f.truncate(offset)``; offset defaults to the current seek position. There's also ``os.ftruncate(fd, offset)`` for files opened with :func:`os.open`, where *fd* is the file descriptor (a small integer).
pt_br: Para truncar um arquivo, abra-o usando ``f = open(arquivo, "rb+")``, e use ``f.truncate(posição)``; a posição tem como padrão a posição atual de busca. Há também ``os.ftruncate(fd, posição)`` para arquivos abertos com :func:`os.open`, onde *fd* é o descritor de arquivo (um pequeno inteiro).

source: The :mod:`shutil` module also contains a number of functions to work on files including :func:`~shutil.copyfile`, :func:`~shutil.copytree`, and :func:`~shutil.rmtree`.
pt_br: O módulo :mod:`shutil` também contém uma série de funções para trabalhar em arquivos, incluindo :func:`~shutil.copyfile`, :func:`~shutil.copytree` e :func:`~shutil.rmtree`.

source: How do I copy a file?
pt_br: Como eu copio um arquivo?

source: The :mod:`shutil` module contains a :func:`~shutil.copyfile` function. Note that on Windows NTFS volumes, it does not copy `alternate data streams <https://en.wikipedia.org/wiki/NTFS#Alternate_data_stream_(ADS)>`_ nor `resource forks <https://en.wikipedia.org/wiki/Resource_fork>`__ on macOS HFS+ volumes, though both are now rarely used. It also doesn't copy file permissions and metadata, though using :func:`shutil.copy2` instead will preserve most (though not all) of it.
pt_br: O módulo :mod:`shutil` contém uma função :func:`~shutil.copyfile`. Observe que em volumes NTFS do Windows, ele não copia `fluxos de dados alternativos <https://en.wikipedia.org/wiki/NTFS#Alternate_data_stream_(ADS)>`_ nem `forks de recursos <https://en.wikipedia.org/wiki/Resource_fork>`__ em volumes HFS+ do macOS, embora ambos sejam raramente usados agora. Ele também não copia permissões de arquivo e metadados, embora usar :func:`shutil.copy2` em vez disso preserve a maioria (embora não todos) deles.

source: How do I read (or write) binary data?
pt_br: Como leio (ou escrevo) dados binários?

source: To read or write complex binary data formats, it's best to use the :mod:`struct` module. It allows you to take a string containing binary data (usually numbers) and convert it to Python objects; and vice versa.
pt_br: Para ler ou escrever formatos de dados binários complexos, é melhor usar o módulo :mod:`struct`. Ele permite que você pegue uma string contendo dados binários (geralmente números) e a converta em objetos Python; e vice-versa.

source: For example, the following code reads two 2-byte integers and one 4-byte integer in big-endian format from a file::
pt_br: Por exemplo, o código a seguir lê dois inteiros de 2 bytes e um inteiro de 4 bytes no formato big-endian de um arquivo:

source: The '>' in the format string forces big-endian data; the letter 'h' reads one "short integer" (2 bytes), and 'l' reads one "long integer" (4 bytes) from the string.
pt_br: O '>' na string de formato força dados big-endian; a letra 'h' lê um "inteiro curto" (2 bytes) e 'l' lê um "inteiro longo" (4 bytes) da string.

source: For data that is more regular (e.g. a homogeneous list of ints or floats), you can also use the :mod:`array` module.
pt_br: Para dados mais regulares (por exemplo, uma lista homogênea de ints ou floats), você também pode usar o módulo :mod:`array`.

source: To read and write binary data, it is mandatory to open the file in binary mode (here, passing ``"rb"`` to :func:`open`). If you use ``"r"`` instead (the default), the file will be open in text mode and ``f.read()`` will return :class:`str` objects rather than :class:`bytes` objects.
pt_br: Para ler e escrever dados binários, é obrigatório abrir o arquivo no modo binário (aqui, passando ``"rb"`` para :func:`open`). Se você usar ``"r"`` em vez disso (o padrão), o arquivo será aberto no modo texto e ``f.read()`` retornará objetos :class:`str` em vez de objetos :class:`bytes`.

source: I can't seem to use os.read() on a pipe created with os.popen(); why?
pt_br: Por que não consigo usar os.read() em um encadeamento com os.popen()?

source: :func:`os.read` is a low-level function which takes a file descriptor, a small integer representing the opened file. :func:`os.popen` creates a high-level file object, the same type returned by the built-in :func:`open` function. Thus, to read *n* bytes from a pipe *p* created with :func:`os.popen`, you need to use ``p.read(n)``.
pt_br: :func:`os.read` é uma função de baixo nível que pega um descritor de arquivo, um pequeno inteiro representando o arquivo aberto. :func:`os.popen` cria um objeto arquivo de alto nível, o mesmo tipo retornado pela função embutida :func:`open`. Assim, para ler *n* bytes de um pipe *p* criado com :func:`os.popen`, você precisa usar ``p.read(n)``.

source: How do I access the serial (RS232) port?
pt_br: Como acesso a porta serial (RS232)?

source: For Win32, OSX, Linux, BSD, Jython, IronPython:
pt_br: Para Win32, OSX, Linux, BSD, Jython, IronPython:

source: For Unix, see a Usenet post by Mitch Chapman:
pt_br: Para Unix, veja uma postagem da Usenet de Mitch Chapman:

source: Why doesn't closing sys.stdout (stdin, stderr) really close it?
pt_br: Por que o sys.stdout (stdin, stderr) não fecha?

source: Python :term:`file objects <file object>` are a high-level layer of abstraction on low-level C file descriptors.
pt_br: Os :term:`objetos arquivos <file object>` do Python são uma camada de alto nível de abstração em descritores de arquivo C de baixo nível.

source: For most file objects you create in Python via the built-in :func:`open` function, ``f.close()`` marks the Python file object as being closed from Python's point of view, and also arranges to close the underlying C file descriptor. This also happens automatically in ``f``'s destructor, when ``f`` becomes garbage.
pt_br: Para a maioria dos objetos arquivo que você cria em Python por meio da função embutida :func:`open`, ``f.close()`` marca o objeto arquivo Python como fechado do ponto de vista do Python e também organiza o fechamento do descritor de arquivo C subjacente. Isso também acontece automaticamente no destrutor de ``f``, quando ``f`` se torna lixo.

source: But stdin, stdout and stderr are treated specially by Python, because of the special status also given to them by C. Running ``sys.stdout.close()`` marks the Python-level file object as being closed, but does *not* close the associated C file descriptor.
pt_br: Mas stdin, stdout e stderr são tratados de forma especial pelo Python, devido ao status especial que também lhes é dado pelo C. Executar ``sys.stdout.close()`` marca o objeto arquivo de nível Python como fechado, mas *não* fecha o descritor de arquivo C associado.

source: To close the underlying C file descriptor for one of these three, you should first be sure that's what you really want to do (e.g., you may confuse extension modules trying to do I/O). If it is, use :func:`os.close`::
pt_br: Para fechar o descritor de arquivo C subjacente para um desses três, você deve primeiro ter certeza de que é isso que você realmente quer fazer (por exemplo, você pode confundir módulos de extensão tentando fazer E/S). Se for, use :func:`os.close`::

source: Or you can use the numeric constants 0, 1 and 2, respectively.
pt_br: Ou você pode usar as constantes numéricas 0, 1 e 2, respectivamente.

source: Network/Internet Programming
pt_br: Programação Rede / Internet

source: What WWW tools are there for Python?
pt_br: Quais ferramentas para WWW existem no Python?

source: See the chapters titled :ref:`internet` and :ref:`netdata` in the Library Reference Manual. Python has many modules that will help you build server-side and client-side web systems.
pt_br: Veja os capítulos intitulados :ref:`internet` e :ref:`netdata` no Manual de Referência da Biblioteca. Python tem muitos módulos que ajudarão você a construir sistemas web do lado do servidor e do lado do cliente.

source: A summary of available frameworks is maintained by Paul Boddie at https://wiki.python.org/moin/WebProgramming\ .
pt_br: Um resumo dos frameworks disponíveis é disponibilizado por Paul Boddie em https://wiki.python.org/moin/WebProgramming\ .

source: What module should I use to help with generating HTML?
pt_br: Qual módulo devo usar para ajudar na geração do HTML?

source: You can find a collection of useful links on the `Web Programming wiki page <https://wiki.python.org/moin/WebProgramming>`_.
pt_br: Você pode encontrar uma coleção de links úteis na `página wiki WebProgramming <https://wiki.python.org/moin/WebProgramming>`_.

source: How do I send mail from a Python script?
pt_br: Como envio um e-mail de um script Python?

source: Use the standard library module :mod:`smtplib`.
pt_br: Use a biblioteca padrão do módulo :mod:`smtplib`.

source: Here's a very simple interactive mail sender that uses it. This method will work on any host that supports an SMTP listener. ::
pt_br: Aqui está um remetente de e-mail interativo muito simples. Este método funcionará em qualquer host que suporte o protocolo SMTP. ::

source: import sys, smtplib fromaddr = input("From: ") toaddrs = input("To: ").split(',') print("Enter message, end with ^D:") msg = '' while True: line = sys.stdin.readline() if not line: break msg += line # The actual mail send server = smtplib.SMTP('localhost') server.sendmail(fromaddr, toaddrs, msg) server.quit()
pt_br: import sys, smtplib fromaddr = input("From: ") toaddrs = input("To: ").split(',') print("Enter message, end with ^D:") msg = '' while True: line = sys.stdin.readline() if not line: break msg += line # O envio de e-mail real server = smtplib.SMTP('localhost') server.sendmail(fromaddr, toaddrs, msg) server.quit()

source: A Unix-only alternative uses sendmail. The location of the sendmail program varies between systems; sometimes it is ``/usr/lib/sendmail``, sometimes ``/usr/sbin/sendmail``. The sendmail manual page will help you out. Here's some sample code::
pt_br: Uma alternativa somente para Unix usa o sendmail. A localização do programa sendmail varia entre os sistemas; às vezes é ``/usr/lib/sendmail``, às vezes ``/usr/sbin/sendmail``. A página de manual do sendmail vai ajudar você. Aqui está um código de exemplo::

source: import os SENDMAIL = "/usr/sbin/sendmail" # sendmail location p = os.popen("%s -t -i" % SENDMAIL, "w") p.write("To: receiver@example.com\n") p.write("Subject: test\n") p.write("\n") # blank line separating headers from body p.write("Some text\n") p.write("some more text\n") sts = p.close() if sts != 0: print("Sendmail exit status", sts)
pt_br: import os SENDMAIL = "/usr/sbin/sendmail" # local do sendmail p = os.popen("%s -t -i" % SENDMAIL, "w") p.write("To: receiver@example.com\n") p.write("Subject: teste\n") p.write("\n") # linha vazia separando cabeçalho do corpo p.write("Algum texto\n") p.write("mais um pouco de texto\n") sts = p.close() if sts != 0: print("Status de saída do sendmail", sts)

source: How do I avoid blocking in the connect() method of a socket?
pt_br: Como evito um bloqueio no método connect() de um soquete?

source: The :mod:`select` module is commonly used to help with asynchronous I/O on sockets.
pt_br: O módulo :mod:`select` é normalmente usado para ajudar com E/S assíncrona nos soquetes.

source: To prevent the TCP connect from blocking, you can set the socket to non-blocking mode. Then when you do the :meth:`~socket.socket.connect`, you will either connect immediately (unlikely) or get an exception that contains the error number as ``.errno``. ``errno.EINPROGRESS`` indicates that the connection is in progress, but hasn't finished yet. Different OSes will return different values, so you're going to have to check what's returned on your system.
pt_br: Para evitar que a conexão TCP bloqueie, você pode definir o soquete para o modo sem bloqueio. Então, quando você fizer o :meth:`~socket.socket.connect`, você se conectará imediatamente (improvável) ou obterá uma exceção que contém o número de erro como ``.errno``. ``errno.EINPROGRESS`` indica que a conexão está em andamento, mas ainda não terminou. Diferentes sistemas operacionais retornarão valores diferentes, então você terá que verificar o que é retornado no seu sistema.

source: You can use the :meth:`~socket.socket.connect_ex` method to avoid creating an exception. It will just return the errno value. To poll, you can call :meth:`~socket.socket.connect_ex` again later -- ``0`` or ``errno.EISCONN`` indicate that you're connected -- or you can pass this socket to :meth:`select.select` to check if it's writable.
pt_br: Você pode usar o método :meth:`~socket.socket.connect_ex` para evitar criar uma exceção. Ele retornará apenas o valor de errno. Para pesquisar, você pode chamar :meth:`~socket.socket.connect_ex` novamente mais tarde -- ``0`` ou ``errno.EISCONN`` indicam que você está conectado -- ou você pode passar este soquete para :meth:`select.select` para verificar se ele é gravável.

source: The :mod:`asyncio` module provides a general purpose single-threaded and concurrent asynchronous library, which can be used for writing non-blocking network code. The third-party `Twisted <https://twisted.org/>`_ library is a popular and feature-rich alternative.
pt_br: O módulo :mod:`asyncio` fornece uma biblioteca assíncrona de thread única e concorrente de propósito geral, que pode ser usada para escrever código de rede não bloqueante. A biblioteca de terceiros `Twisted <https://twisted.org/>`_ é uma alternativa popular e rica em recursos.

source: Databases
pt_br: Base de Dados

source: Are there any interfaces to database packages in Python?
pt_br: Existem interfaces para banco de dados em Python?

source: Yes.
pt_br: Sim.

source: Interfaces to disk-based hashes such as :mod:`DBM <dbm.ndbm>` and :mod:`GDBM <dbm.gnu>` are also included with standard Python. There is also the :mod:`sqlite3` module, which provides a lightweight disk-based relational database.
pt_br: Interfaces para hashes baseados em disco, como :mod:`DBM <dbm.ndbm>` e :mod:`GDBM <dbm.gnu>` também estão incluídas no Python padrão. Há também o módulo :mod:`sqlite3`, que fornece um banco de dados relacional baseado em disco leve.

source: Support for most relational databases is available. See the `DatabaseProgramming wiki page <https://wiki.python.org/moin/DatabaseProgramming>`_ for details.
pt_br: Suporte para a maioria dos bancos de dados relacionais está disponível. Para mais detalhes, veja a `página wiki DatabaseProgramming <https://wiki.python.org/moin/DatabaseProgramming>`_ para detalhes.

source: How do you implement persistent objects in Python?
pt_br: Como você implementa objetos persistentes no Python?

source: The :mod:`pickle` library module solves this in a very general way (though you still can't store things like open files, sockets or windows), and the :mod:`shelve` library module uses pickle and (g)dbm to create persistent mappings containing arbitrary Python objects.
pt_br: O módulo de biblioteca :mod:`pickle` resolve isso de uma maneira muito geral (embora você ainda não possa armazenar coisas como arquivos abertos, soquetes ou janelas), e o módulo de biblioteca :mod:`shelve` usa pickle e (g)dbm para criar mapeamentos persistentes contendo objetos Python arbitrários.

source: Mathematics and Numerics
pt_br: Matemáticos e Numéricos

source: How do I generate random numbers in Python?
pt_br: Como gero número aleatórios no Python?

source: The standard module :mod:`random` implements a random number generator. Usage is simple::
pt_br: O módulo padrão :mod:`random` implementa um gerador de números aleatórios. O uso é simples::

source: This returns a random floating-point number in the range [0, 1).
pt_br: Isso retorna um número flutuante aleatório no intervalo [0, 1).

source: There are also many other specialized generators in this module, such as:
pt_br: Existem também muitos outros geradores aleatórios neste módulo, como:

source: ``randrange(a, b)`` chooses an integer in the range [a, b).
pt_br: ``randrange(a, b)`` escolhe um número inteiro no intervalo entre [a, b).

source: ``uniform(a, b)`` chooses a floating-point number in the range [a, b).
pt_br: ``uniform(a, b)`` escolhe um número de ponto flutuante no intervalo [a, b).

source: ``normalvariate(mean, sdev)`` samples the normal (Gaussian) distribution.
pt_br: ``normalvariate(mean, sdev)`` gera números pseudoaleatórios que seguem uma distribuição normal (Gaussiana).

source: Some higher-level functions operate on sequences directly, such as:
pt_br: Algumas funções de nível elevado operam diretamente em sequencia, como:

source: ``choice(S)`` chooses a random element from a given sequence.
pt_br: ``choice(S)`` escolhe um elemento aleatório de uma determinada sequência.

source: ``shuffle(L)`` shuffles a list in-place, i.e. permutes it randomly.
pt_br: ``shuffle(L)`` embaralha uma lista internamente, ou seja permuta seus elementos aleatoriamente.

source: There's also a ``Random`` class you can instantiate to create independent multiple random number generators.
pt_br: Existe também uma classe ``Random`` que você pode instanciar para criar vários geradores de números aleatórios independentes.
