Repository: python/python-docs-pt-br
Catalog: faq/programming.po
Languages: pt_br

source: The first time you call this function, ``mydict`` contains a single item. The second time, ``mydict`` contains two items because when ``foo()`` begins executing, ``mydict`` starts out with an item already in it.
pt_br: Na primeira vez que chamar essa função, ``meudict`` vai conter um único item. Na segunda vez, ``meudict`` vai conter dois itens porque, quando ``foo()`` começar a ser executado, ``meudict`` começará com um item já existente.

source: It is often expected that a function call creates new objects for default values. This is not what happens. Default values are created exactly once, when the function is defined. If that object is changed, like the dictionary in this example, subsequent calls to the function will refer to this changed object.
pt_br: Muitas vezes, espera-se que ao invocar uma função sejam criados novos objetos referente aos valores padrão. Isso não é o que acontece. Os valores padrão são criados exatamente uma vez, quando a função está sendo definida. Se esse objeto for alterado, como o dicionário neste exemplo, as chamadas subsequentes para a essa função se referirão a este objeto alterado.

source: By definition, immutable objects such as numbers, strings, tuples, and ``None``, are safe from change. Changes to mutable objects such as dictionaries, lists, and class instances can lead to confusion.
pt_br: Por definição, objetos imutáveis, como números, strings, tuplas e o ``None``, estão protegidos de sofrerem alteração. Alterações em objetos mutáveis, como dicionários, listas e instâncias de classe, podem levar à confusão.

source: Because of this feature, it is good programming practice to not use mutable objects as default values. Instead, use ``None`` as the default value and inside the function, check if the parameter is ``None`` and create a new list/dictionary/whatever if it is. For example, don't write::
pt_br: Por causa desse recurso, é uma boa prática de programação para evitar o uso de objetos mutáveis contendo valores padrão. Em vez disso, utilize ``None`` como o valor padrão e dentro da função, verifique se o parâmetro é ``None`` e crie uma nova lista, dicionário ou o que quer que seja. Por exemplo, escreva o seguinte código::

source: def foo(mydict={}): ...
pt_br: def foo(meudict={}): ...

source: but::
pt_br: mas::

source: def foo(mydict=None): if mydict is None: mydict = {} # create a new dict for local namespace
pt_br: def foo(meudict=None): if meudict is None: meudict = {} # cria um novo dicionário para o espaço de nomes local

source: This feature can be useful. When you have a function that's time-consuming to compute, a common technique is to cache the parameters and the resulting value of each call to the function, and return the cached value if the same value is requested again. This is called "memoizing", and can be implemented like this::
pt_br: Esse recurso pode ser útil. Quando se tem uma função que consome muito tempo para calcular, uma técnica comum é armazenar em cache os parâmetros e o valor resultante de cada chamada para a função e retornar o valor em cache se o mesmo valor for solicitado novamente. Isso se chama "memoizar", e pode ser implementado da seguinte forma::

source: # Callers can only provide two parameters and optionally pass _cache by keyword def expensive(arg1, arg2, *, _cache={}): if (arg1, arg2) in _cache: return _cache[(arg1, arg2)] # Calculate the value result = ... expensive computation ... _cache[(arg1, arg2)] = result # Store result in the cache return result
pt_br: # Chamadores só podem fornecer dois parâmetros e opcionalmente passar _cache como parâmetro nomeado def expensive(arg1, arg2, *, _cache={}): if (arg1, arg2) in _cache: return _cache[(arg1, arg2)] # Cacula o valor result = ... cálculo custoso ... _cache[(arg1, arg2)] = result # Armazena o resultado no cache return result

source: You could use a global variable containing a dictionary instead of the default value; it's a matter of taste.
pt_br: Pode-se usar uma variável global contendo um dicionário ao invés do valor padrão; isso é uma questão de gosto.

source: How can I pass optional or keyword parameters from one function to another?
pt_br: Como passo parâmetros opcionais ou parâmetros nomeados de uma função para outra?

source: Collect the arguments using the ``*`` and ``**`` specifiers in the function's parameter list; this gives you the positional arguments as a tuple and the keyword arguments as a dictionary. You can then pass these arguments when calling another function by using ``*`` and ``**``::
pt_br: Colete os argumentos usando os especificadores ``*`` ou ``**`` na lista de parâmetros da função. Isso faz com que os argumentos posicionais como tupla e os argumentos nomeados sejam passados como um dicionário. Você pode, também, passar esses argumentos ao invocar outra função usando ``*`` e ``**``::

source: What is the difference between arguments and parameters?
pt_br: Qual a diferença entre argumentos e parâmetros?

source: :term:`Parameters <parameter>` are defined by the names that appear in a function definition, whereas :term:`arguments <argument>` are the values actually passed to a function when calling it. Parameters define what :term:`kind of arguments <parameter>` a function can accept. For example, given the function definition::
pt_br: :term:`Parâmetros <parameter>` são definidos pelos nomes que aparecem na definição da função, enquanto :term:`argumentos <argument>` são os valores que serão passados para a função no momento em que esta estiver sendo invocada. Os parâmetros irão definir quais os :term:`tipos de argumentos <parameter>` que uma função pode receber. Por exemplo, dada a definição da função::

source: *foo*, *bar* and *kwargs* are parameters of ``func``. However, when calling ``func``, for example::
pt_br: *foo*, *bar* e *kwargs* são parâmetros de ``func``. Dessa forma, ao invocar ``func``, por exemplo::

source: func(42, bar=314, extra=somevar)
pt_br: func(42, bar=314, extra=algumvalor)

source: the values ``42``, ``314``, and ``somevar`` are arguments.
pt_br: os valores ``42``, ``314``, e ``algumvalor`` são os argumentos.

source: Why did changing list 'y' also change list 'x'?
pt_br: Por que ao alterar a lista 'y' também altera a lista 'x'?

source: If you wrote code like::
pt_br: Se você escreveu um código como::

source: you might be wondering why appending an element to ``y`` changed ``x`` too.
pt_br: pode estar se perguntando por que acrescentar um elemento a ``y`` também mudou ``x``.

source: There are two factors that produce this result:
pt_br: Há dois fatores que produzem esse resultado:

source: Variables are simply names that refer to objects. Doing ``y = x`` doesn't create a copy of the list -- it creates a new variable ``y`` that refers to the same object ``x`` refers to. This means that there is only one object (the list), and both ``x`` and ``y`` refer to it.
pt_br: As variáveis são simplesmente nomes que referem-se a objetos. Usar ``y = x`` não cria uma cópia da lista. Isso cria uma nova variável ``y`` que faz referência ao mesmo objeto ao qual ``x`` está se referindo. Isso significa que existe apenas um objeto (a lista) e que ambos ``x`` e ``y`` fazem referência a ele.

source: Lists are :term:`mutable`, which means that you can change their content.
pt_br: Listas são objetos :term:`mutáveis <mutável>`, o que significa que você pode alterar o seu conteúdo.

source: After the call to :meth:`!append`, the content of the mutable object has changed from ``[]`` to ``[10]``. Since both the variables refer to the same object, using either name accesses the modified value ``[10]``.
pt_br: Após a chamada para :meth:`!append`, o conteúdo do objeto mutável mudou de ``[]`` para ``[10]``. Uma vez que ambas as variáveis referem-se ao mesmo objeto, usar qualquer um dos nomes acessará o valor modificado ``[10]``.

source: If we instead assign an immutable object to ``x``::
pt_br: Se por acaso, atribuímos um objeto imutável a ``x``::

source: >>> x = 5 # ints are immutable >>> y = x >>> x = x + 1 # 5 can't be mutated, we are creating a new object here >>> x 6 >>> y 5
pt_br: >>> x = 5 # ints são imutáveis >>> y = x >>> x = x + 1 # 5 não pode ser mutado, estamos criando um novo objeto aqui >>> x 6 >>> y 5

source: we can see that in this case ``x`` and ``y`` are not equal anymore. This is because integers are :term:`immutable`, and when we do ``x = x + 1`` we are not mutating the int ``5`` by incrementing its value; instead, we are creating a new object (the int ``6``) and assigning it to ``x`` (that is, changing which object ``x`` refers to). After this assignment we have two objects (the ints ``6`` and ``5``) and two variables that refer to them (``x`` now refers to ``6`` but ``y`` still refers to ``5``).
pt_br: podemos ver que nesse caso ``x`` e ``y`` não são mais iguais. Isso ocorre porque os números inteiros são :term:`imutáveis <imutável>`, e quando fazemos ``x = x + 1`` não estamos mudando o int ``5`` e incrementando o seu valor. Em vez disso, estamos criando um novo objeto (o int ``6``) e atribuindo-o a ``x`` (isto é, mudando para o objeto no qual ``x`` se refere). Após esta atribuição, temos dois objetos (os ints ``6`` e ``5``) e duas variáveis que referem-se a elas (``x`` agora se refere a ``6``, mas ``y`` ainda refere-se a ``5``).

source: Some operations (for example ``y.append(10)`` and ``y.sort()``) mutate the object, whereas superficially similar operations (for example ``y = y + [10]`` and :func:`sorted(y) <sorted>`) create a new object. In general in Python (and in all cases in the standard library) a method that mutates an object will return ``None`` to help avoid getting the two types of operations confused. So if you mistakenly write ``y.sort()`` thinking it will give you a sorted copy of ``y``, you'll instead end up with ``None``, which will likely cause your program to generate an easily diagnosed error.
pt_br: Algumas operações (por exemplo, ``y.append(10)`` e ``y.sort()``) alteram o objeto, enquanto operações superficialmente semelhantes (por exemplo, ``y = y + [10]`` e :func:`sorted(y) <sorted>`) criam um novo objeto. Em geral, em Python (e em todos os casos na biblioteca padrão) um método que causa mutação em um objeto retornará ``None`` para ajudar a evitar confundir os dois tipos de operações. Portanto, se você escrever por engano ``y.sort()`` pensando que lhe dará uma cópia ordenada de ``y``, você terminará com ``None``, o que provavelmente fará com que seu programa gere um erro facilmente diagnosticado.

source: However, there is one class of operations where the same operation sometimes has different behaviors with different types: the augmented assignment operators. For example, ``+=`` mutates lists but not tuples or ints (``a_list += [1, 2, 3]`` is equivalent to ``a_list.extend([1, 2, 3])`` and mutates ``a_list``, whereas ``some_tuple += (1, 2, 3)`` and ``some_int += 1`` create new objects).
pt_br: No entanto, há uma classe de operações em que a mesma operação às vezes tem comportamentos diferentes com tipos diferentes: os operadores de atribuição aumentada. Por exemplo, ``+=`` transforma listas, mas não tuplas ou ints (``uma_lista += [1, 2, 3]`` equivale a ``uma_lista.extend([1, 2, 3])`` a transforma ``uma_lista``, sendo que ``alguma_tupla += (1, 2, 3)`` e ``algum_int += 1`` cria novos objetos).

source: In other words:
pt_br: Em outras palavras:

source: If we have a mutable object (:class:`list`, :class:`dict`, :class:`set`, etc.), we can use some specific operations to mutate it and all the variables that refer to it will see the change.
pt_br: Se tivermos um objeto mutável (:class:`list`, :class:`dict`, :class:`set`, etc.), podemos usar algumas operações específicas para alterá-lo e todas as variáveis que fazem referência a ele verão também a mudança.

source: If we have an immutable object (:class:`str`, :class:`int`, :class:`tuple`, etc.), all the variables that refer to it will always see the same value, but operations that transform that value into a new value always return a new object.
pt_br: Caso tenhamos um objeto imutável (:class:`str`, :class:`int`, :class:`tuple`, etc.), todas as variáveis que se referem a ele sempre verão o mesmo valor, mas as operações que transformam-se nesses valores sempre retornarão novos objetos.

source: If you want to know if two variables refer to the same object or not, you can use the :keyword:`is` operator, or the built-in function :func:`id`.
pt_br: Caso queira saber se duas variáveis fazem referência ao mesmo objeto ou não, pode-se usar o operador :keyword:`is` ou a função embutida :func:`id`.

source: How do I write a function with output parameters (call by reference)?
pt_br: Como escrevo uma função com parâmetros de saída (chamada por referência)?

source: Remember that arguments are passed by assignment in Python. Since assignment just creates references to objects, there's no alias between an argument name in the caller and callee, and so no call-by-reference per se. You can achieve the desired effect in a number of ways.
pt_br: Lembre-se de que os argumentos são passados por atribuição em Python. Uma vez que a atribuição apenas cria referências a objetos, não existe apelido entre um nome de argumento no chamador e no chamado e, portanto, não há referência de chamada por si. É possível alcançar o efeito desejado de várias maneiras.

source: By returning a tuple of the results::
pt_br: Retornando um tupla com os resultados::

source: >>> def func1(a, b): ... a = 'new-value' # a and b are local names ... b = b + 1 # assigned to new objects ... return a, b # return new values ... >>> x, y = 'old-value', 99 >>> func1(x, y) ('new-value', 100)
pt_br: >>> def func1(a, b): ... a = 'valor-novo' # a e b são nomes locais ... b = b + 1 # atribuídos a novos objetos ... return a, b # retorna novos valores ... >>> x, y = 'valor-antigo', 99 >>> func1(x, y) ('valor-novo', 100)

source: This is almost always the clearest solution.
pt_br: Esta é quase sempre a solução mais clara.

source: By using global variables. This isn't thread-safe, and is not recommended.
pt_br: Utilizando variáveis globais. Essa forma não é segura para thread e, portanto, não é recomendada.

source: By passing a mutable (changeable in-place) object::
pt_br: Pela passagem de um objeto mutável (que possa ser alterado internamente)::

source: >>> def func2(a): ... a[0] = 'new-value' # 'a' references a mutable list ... a[1] = a[1] + 1 # changes a shared object ... >>> args = ['old-value', 99] >>> func2(args) >>> args ['new-value', 100]
pt_br: >>> def func2(a): ... a[0] = 'valor-novo' # 'a' referencia uma lista mutável ... a[1] = a[1] + 1 # altera um objeto compartilhado ... >>> args = ['valor-antigo', 99] >>> func2(args) >>> args ['valor-novo', 100]

source: By passing in a dictionary that gets mutated::
pt_br: Pela passagem de um dicionário que sofra mutação::

source: >>> def func3(args): ... args['a'] = 'new-value' # args is a mutable dictionary ... args['b'] = args['b'] + 1 # change it in-place ... >>> args = {'a': 'old-value', 'b': 99} >>> func3(args) >>> args {'a': 'new-value', 'b': 100}
pt_br: >>> def func3(args): ... args['a'] = 'valor-novo' # args é um dicionário mutável ... args['b'] = args['b'] + 1 # alteração local, nele mesmo ... >>> args = {'a': 'valor-antigo', 'b': 99} >>> func3(args) >>> args {'a': 'valor-novo', 'b': 100}

source: Or bundle up values in a class instance::
pt_br: Ou agrupando valores numa instância de classe::

source: >>> class Namespace: ... def __init__(self, /, **args): ... for key, value in args.items(): ... setattr(self, key, value) ... >>> def func4(args): ... args.a = 'new-value' # args is a mutable Namespace ... args.b = args.b + 1 # change object in-place ... >>> args = Namespace(a='old-value', b=99) >>> func4(args) >>> vars(args) {'a': 'new-value', 'b': 100}
pt_br: >>> class Namespace: ... def __init__(self, /, **args): ... for key, value in args.items(): ... setattr(self, key, value) ... >>> def func4(args): ... args.a = 'valor-novo' # args é um Namespace mutável ... args.b = args.b + 1 # alteração local do objeto, nele mesmo ... >>> args = Namespace(a='valor-antigo', b=99) >>> func4(args) >>> vars(args) {'a': 'valor-novo', 'b': 100}

source: There's almost never a good reason to get this complicated.
pt_br: Quase nunca existe uma boa razão para complicar isso.

source: Your best choice is to return a tuple containing the multiple results.
pt_br: A sua melhor escolha será retornar uma tupla contendo os múltiplos resultados.

source: How do you make a higher order function in Python?
pt_br: Como fazer uma função de ordem superior em Python?

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
pt_br: Existem duas opções: pode-se usar escopos aninhados ou usar objetos chamáveis. Por exemplo, suponha que queira definir ``linear(a,b)``, o qual retorna uma função ``f(x)`` que calcula o valor ``a*x+b``. Usando escopos aninhados, temos::

source: Or using a callable object::
pt_br: Ou utilizando um objeto chamável::

source: In both cases, ::
pt_br: Em ambos os casos::

source: taxes = linear(0.3, 2)
pt_br: taxas = linear(0.3, 2)

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
pt_br: resulta em um objeto chamável, onde ``taxes(10e6) == 0.3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
pt_br: A abordagem do objeto chamável tem a desvantagem de que é um pouco mais lenta e resulta num código ligeiramente mais longo. No entanto, note que uma coleção de chamáveis pode compartilhar sua assinatura via herança::

source: class exponential(linear): # __init__ inherited def __call__(self, x): return self.a * (x ** self.b)
pt_br: class exponential(linear): # __init__ herdado def __call__(self, x): return self.a * (x ** self.b)

source: Object can encapsulate state for several methods::
pt_br: Objetos podem encapsular o estado para vários métodos::

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
pt_br: Aqui ``inc()``, ``dec()`` e ``reset()`` funcionam como funções que compartilham a mesma variável contadora.

source: How do I copy an object in Python?
pt_br: Como faço para copiar um objeto no Python?

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
pt_br: Basicamente, tente utilizar a função :func:`copy.copy` ou a função :func:`copy.deepcopy` para casos gerais. Nem todos os objetos podem ser copiados, mas a maioria poderá.

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
pt_br: Alguns objetos podem ser copiados com mais facilidade. Os dicionários têm um método :meth:`~dict.copy`::

source: newdict = olddict.copy()
pt_br: novodict = antigodict.copy()

source: Sequences can be copied by slicing::
pt_br: As sequências podem ser copiadas através do uso de fatiamento::

source: new_l = l[:]
pt_br: nova_l = l[:]

source: How can I find the methods or attributes of an object?
pt_br: Como posso encontrar os métodos ou atributos de um objeto?

source: For an instance ``x`` of a user-defined class, :func:`dir(x) <dir>` returns an alphabetized list of the names containing the instance attributes and methods and attributes defined by its class.
pt_br: Para uma instância ``x`` de uma classe definida pelo usuário, :func:`dir(x) <dir>` retorna uma lista organizada alfabeticamente dos nomes contidos, os atributos da instância e os métodos e atributos definidos por sua classe.

source: How can my code discover the name of an object?
pt_br: Como que o meu código pode descobrir o nome de um objeto?

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; the same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
pt_br: De um modo geral, não pode, porque os objetos realmente não têm nomes. Essencialmente, a atribuição sempre liga um nome a um valor; o mesmo é verdade para as instruções ``def`` e ``class``, mas nesse caso o valor é um chamável. Considere o seguinte código::

source: Arguably the class has a name: even though it is bound to two names and invoked through the name ``B`` the created instance is still reported as an instance of class ``A``. However, it is impossible to say whether the instance's name is ``a`` or ``b``, since both names are bound to the same value.
pt_br: Provavelmente, a classe tem um nome: mesmo que seja vinculada a dois nomes e invocada através do nome ``B``, a instância criada ainda é relatada como uma instância da classe ``A``. No entanto, é impossível dizer se o nome da instância é ``a`` ou ``b``, uma vez que ambos os nomes estão vinculados ao mesmo valor.

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
pt_br: De um modo geral, não deveria ser necessário que o seu código "conheça os nomes" de valores específicos. A menos que se escreva deliberadamente programas introspectivos, isso geralmente é uma indicação de que uma mudança de abordagem pode ser benéfica.

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
pt_br: Em comp.lang.python, Fredrik Lundh deu uma excelente analogia em resposta a esta pergunta:

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
pt_br: Da mesma forma que você pega o nome daquele gato que encontrou na sua varanda: o próprio gato (objeto) não pode lhe dizer o seu nome, e ele realmente não se importa -- então, a única maneira de descobrir como ele se chama é perguntar a todos os seus vizinhos (espaços de nomes) se é o gato deles (objeto)...

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
pt_br: ....e não fique surpreso se você descobrir que é conhecido por muitos nomes, ou até mesmo nenhum nome.

source: What's up with the comma operator's precedence?
pt_br: O que há com a precedência do operador vírgula?

source: Comma is not an operator in Python. Consider this session::
pt_br: A vírgula não é um operador em Python. Considere este código::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
pt_br: Uma vez que a vírgula não seja um operador, mas um separador entre as expressões acima, o código será avaliado como se tivéssemos entrado::

source: not::
pt_br: não::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
pt_br: O mesmo é verdade para as várias operações de atribuição (``=``, ``+=`` etc). Eles não são operadores de verdade mas delimitadores sintáticos em instruções de atribuição.

source: Is there an equivalent of C's "?:" ternary operator?
pt_br: Existe um equivalente ao operador ternário "?:" do C?

source: Yes, there is. The syntax is as follows::
pt_br: Sim, existe. A sintaxe é a seguinte::
