Repository: python/python-docs-pt-br
Catalog: faq/programming.po
Languages: pt_br

source: Abstractions tend to create indirections and force the interpreter to work more. If the levels of indirection outweigh the amount of useful work done, your program will be slower. You should avoid excessive abstraction, especially under the form of tiny functions or methods (which are also often detrimental to readability).
pt_br: As abstrações tendem a criar indireções e forçar o interpretador a trabalhar mais. Se os níveis de indireção superarem a quantidade de trabalho útil feito, seu programa ficará mais lento. Você deve evitar a abstração excessiva, especialmente sob a forma de pequenas funções ou métodos (que também são muitas vezes prejudiciais à legibilidade).

source: If you have reached the limit of what pure Python can allow, there are tools to take you further away. For example, `Cython <https://cython.org>`_ can compile a slightly modified version of Python code into a C extension, and can be used on many different platforms. Cython can take advantage of compilation (and optional type annotations) to make your code significantly faster than when interpreted. If you are confident in your C programming skills, you can also :ref:`write a C extension module <extending-index>` yourself.
pt_br: Se você atingiu o limite do que Python puro pode permitir, existem ferramentas para levá-lo mais longe. Por exemplo, o `Cython <https://cython.org>`_ pode compilar uma versão ligeiramente modificada do código Python numa extensão C e pode ser usado em muitas plataformas diferentes. O Cython pode tirar proveito da compilação (e anotações tipo opcional) para tornar o seu código significativamente mais rápido do que quando interpretado. Se você está confiante em suas habilidades de programação C, também pode :ref:`escrever um módulo de extensão de C <extending-index>`.

source: The wiki page devoted to `performance tips <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
pt_br: A página wiki dedicada a `dicas de desempenho <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.

source: What is the most efficient way to concatenate many strings together?
pt_br: Qual é a maneira mais eficiente de concatenar muitas strings?

source: :class:`str` and :class:`bytes` objects are immutable, therefore concatenating many strings together is inefficient as each concatenation creates a new object. In the general case, the total runtime cost is quadratic in the total string length.
pt_br: Objetos das classes :class:`str` e :class:`bytes` são imutáveis e, portanto, concatenar muitas strings é ineficiente, pois cada concatenação criará um novo objeto. No caso geral, o custo total do tempo de execução é quadrático no comprimento total da string.

source: To accumulate many :class:`str` objects, the recommended idiom is to place them into a list and call :meth:`str.join` at the end::
pt_br: Para juntar vários objetos :class:`str`, a linguagem recomendada colocá-los numa lista e invocar o método :meth:`str.join`::

source: (another reasonably efficient idiom is to use :class:`io.StringIO`)
pt_br: (outra forma razoavelmente eficiente é usar a classe :class:`io.StringIO`)

source: To accumulate many :class:`bytes` objects, the recommended idiom is to extend a :class:`bytearray` object using in-place concatenation (the ``+=`` operator)::
pt_br: Para juntar vários objetos :class:`bytes`, a forma recomendada é estender uma classe :class:`bytearray` usando a concatenação local (com o operador ``+=``)::

source: Sequences (Tuples/Lists)
pt_br: Sequencias (Tuplas/Listas)

source: How do I convert between tuples and lists?
pt_br: Como faço para converter tuplas em listas?

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
pt_br: O construtor de tipo ``tuple(seq)`` converte qualquer sequência (na verdade, qualquer iterável) numa tupla com os mesmos itens na mesma ordem.

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
pt_br: Por exemplo, ``tuple([1, 2, 3])`` produz ``(1, 2, 3)`` e ``tuple('abc')`` produz ``('a', 'b', 'c')``. Se o argumento for uma tupla, a mesma não faz uma cópia, mas retorna o mesmo objeto, por isso é barato invocar a função :func:`tuple` quando você não tiver certeza que determinado objeto já é uma tupla.

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
pt_br: O construtor de tipos ``list(seq)`` converte qualquer sequência ou iterável em uma lista com os mesmos itens na mesma ordem. Por exemplo, ``list((1, 2, 3))`` produz ``[1, 2, 3]`` e ``list('abc')`` produz ``['a', 'b', 'c']``. Se o argumento for uma lista, o meso fará uma cópia como em ``seq[:]``.

source: What's a negative index?
pt_br: O que é um índice negativo?

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
pt_br: Sequências em Python são indexadas com números positivos e números negativos. Para números positivos, 0 é o índice do primeiro elemento, 1 é o índice do segundo elemento e assim por diante. Para números negativos, -1 é índice do último elemento e -2 é o penúltimo (anterior ao último) índice e assim por diante. Pense em ``seq[-n]`` como o mesmo que ``seq[len(seq)-n]``.

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
pt_br: Usar índices negativos pode ser muito conveniente. Por exemplo, ``S[:-1]`` é a string inteira exceto pelo seu último caractere, o que é útil para remover o caractere de nova linha no final de uma string.

source: How do I iterate over a sequence in reverse order?
pt_br: Como que eu itero uma sequência na ordem inversa?

source: Use the :func:`reversed` built-in function::
pt_br: Use a função embutida :func:`reversed`::

source: for x in reversed(sequence): ... # do something with x ...
pt_br: for x in reversed(sequence): ... # faz alguma coisa com x ...

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
pt_br: Isso não vai alterar sua sequência original, mas construir uma nova cópia com a ordem inversa para iteração.

source: How do you remove duplicates from a list?
pt_br: Como que removo itens duplicados de uma lista?

source: See the Python Cookbook for a long discussion of many ways to do this:
pt_br: Veja o Python Cookbook para uma longa discussão de várias formas de fazer isso:

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
pt_br: Se você não se importar em reordenar a lista, ordene-a e depois examine a partir do final da lista, excluindo duplicatas conforme avança::

source: If all elements of the list may be used as set keys (i.e. they are all :term:`hashable`) this is often faster ::
pt_br: Se todos os elementos da lista podem ser usados como chaves de conjunto (isto é, eles são todos :term:`hasheáveis <hasheável>`) isso é muitas vezes mais rápido ::

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
pt_br: Isso converte a lista em um conjunto, deste modo removendo itens duplicados, e depois de volta em uma lista.

source: How do you remove multiple items from a list
pt_br: Como remover múltiplos itens de uma lista?

source: As with removing duplicates, explicitly iterating in reverse with a delete condition is one possibility. However, it is easier and faster to use slice replacement with an implicit or explicit forward iteration. Here are three variations.::
pt_br: Assim como para remover valores duplicados, explicitamente iterar em uma lista reversa com uma condição de remoção é uma possibilidade. Contudo, é mais fácil e rápido usar substituição de fatias com um iteração reversa implícita ou explícita. Aqui estão três variações.::

source: The list comprehension may be fastest.
pt_br: A compreensão de lista pode ser a mais rápida.

source: How do you make an array in Python?
pt_br: Como fazer um vetor em Python?

source: Use a list::
pt_br: Utilize uma lista::

source: ["this", 1, "is", "an", "array"]
pt_br: ["isto", 1, "é", "um", "vetor"]

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
pt_br: Listas são equivalentes aos vetores de C ou Pascal em termos de complexidade de tempo; a diferença primária é que uma lista em Python pode conter objetos de tipos diferentes.

source: The ``array`` module also provides methods for creating arrays of fixed types with compact representations, but they are slower to index than lists. Also note that `NumPy <https://numpy.org/>`_ and other third party packages define array-like structures with various characteristics as well.
pt_br: O módulo ``array`` também provê métodos para criar vetores de tipos fixos com representações compactas, mas eles são mais lentos para indexar que listas. Observe também que `NumPy <https://numpy.org/>`_ e outros pacotes de terceiros definem estruturas semelhantes a arrays com várias características.

source: To get Lisp-style linked lists, you can emulate *cons cells* using tuples::
pt_br: Para obter listas ligadas no estilo Lisp, você pode emular *células cons* usando tuplas::

source: lisp_list = ("like", ("this", ("example", None) ) )
pt_br: lista_lisp = ("como", ("este", ("exemplo", None) ) )

source: If mutability is desired, you could use lists instead of tuples. Here the analogue of a Lisp *car* is ``lisp_list[0]`` and the analogue of *cdr* is ``lisp_list[1]``. Only do this if you're sure you really need to, because it's usually a lot slower than using Python lists.
pt_br: Se mutabilidade é desejada, você pode usar listas no lugar de tuplas. Aqui o análogo de um *car* Lisp é ``lista_lisp[0]`` e o análogo de *cdr* é ``lista_lisp[1]``. Faça isso somente se você tem certeza que precisa disso, porque isso é usualmente muito mais lento que usar listas Python.

source: How do I create a multidimensional list?
pt_br: Como faço para criar uma lista multidimensional?

source: You probably tried to make a multidimensional array like this::
pt_br: Você provavelmente tentou fazer um vetor multidimensional assim::

source: This looks correct if you print it:
pt_br: Isso parece correto se você imprimir:

source: But when you assign a value, it shows up in multiple places:
pt_br: Mas quando atribuíres um valor, o mesmo aparecerá em vários lugares:

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
pt_br: A razão é que replicar uma lista com ``*`` não cria cópias, ela apenas cria referências aos objetos existentes. O ``*3`` cria uma lista contendo 3 referências para a mesma lista que contém 2 itens cada. Mudanças numa linha serão mostradas em todas as linhas, o que certamente não é o que você deseja.

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
pt_br: A abordagem sugerida é criar uma lista com o comprimento desejado primeiro e, em seguida, preencher cada elemento com uma lista recém-criada::

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
pt_br: Isso gera uma lista contendo 3 listas diferentes contendo 2 itens cada. Você também pode usar uma compreensão de lista::

source: Or, you can use an extension that provides a matrix datatype; `NumPy <https://numpy.org/>`_ is the best known.
pt_br: Ou você pode usar uma extensão que provê um tipo de dados matrix; `NumPy <https://numpy.org/>`_ é o mais conhecido.

source: How do I apply a method or function to a sequence of objects?
pt_br: Como eu aplico um método ou função para uma sequência de objetos?

source: To call a method or function and accumulate the return values is a list, a :term:`list comprehension` is an elegant solution::
pt_br: Para chamar um método ou função e acumular os valores retornados como uma lista, uma :term:`compreensão de lista` é uma solução elegante::

source: To just run the method or function without saving the return values, a plain :keyword:`for` loop will suffice::
pt_br: Para apenas chamar o método ou função sem salvar os valores retornados, um laço :keyword:`for` será o suficiente::

source: Why does a_tuple[i] += ['item'] raise an exception when the addition works?
pt_br: Porque uma_tupla[i] += ['item'] levanta uma exceção quando a adição funciona?

source: This is because of a combination of the fact that augmented assignment operators are *assignment* operators, and the difference between mutable and immutable objects in Python.
pt_br: Isso se deve a uma combinação do fato de que os operadores de atribuição aumentada são operadores de *atribuição* e à diferença entre objetos mutáveis e imutáveis no Python.

source: This discussion applies in general when augmented assignment operators are applied to elements of a tuple that point to mutable objects, but we'll use a ``list`` and ``+=`` as our exemplar.
pt_br: Essa discussão se aplica em geral quando operadores de atribuição aumentada são aplicados a elementos de uma tupla que aponta para objetos mutáveis, mas usaremos uma ``lista`` e ``+=`` como exemplo.

source: If you wrote::
pt_br: Se você escrever::

source: The reason for the exception should be immediately clear: ``1`` is added to the object ``a_tuple[0]`` points to (``1``), producing the result object, ``2``, but when we attempt to assign the result of the computation, ``2``, to element ``0`` of the tuple, we get an error because we can't change what an element of a tuple points to.
pt_br: O motivo da exceção deve ser imediatamente claro: ``1`` é adicionado ao objeto que ``a_tuple[0]`` aponta para (``1``), produzindo o objeto de resultado, ``2``, mas quando tentamos atribuir o resultado do cálculo, ``2``, ao elemento ``0`` da tupla, recebemos um erro porque não podemos alterar o que um elemento de uma tupla aponta.

source: Under the covers, what this augmented assignment statement is doing is approximately this::
pt_br: Por baixo, o que a instrução de atribuição aumentada está fazendo é aproximadamente isso::

source: It is the assignment part of the operation that produces the error, since a tuple is immutable.
pt_br: Essa é a parte da atribuição da operação que produz o erro, já que a tupla é imutável.

source: When you write something like::
pt_br: Quando você escreve algo como::

source: The exception is a bit more surprising, and even more surprising is the fact that even though there was an error, the append worked::
pt_br: A exceção é um pouco mais surpreendente, e ainda mais surpreendente é o fato de que, embora tenha havido um erro, o acréscimo à lista funcionou::

source: To see why this happens, you need to know that (a) if an object implements an :meth:`~object.__iadd__` magic method, it gets called when the ``+=`` augmented assignment is executed, and its return value is what gets used in the assignment statement; and (b) for lists, :meth:`!__iadd__` is equivalent to calling :meth:`!extend` on the list and returning the list. That's why we say that for lists, ``+=`` is a "shorthand" for :meth:`!list.extend`::
pt_br: Para entender por que isso acontece, você precisa saber que (a) se um objeto implementa um método mágico :meth:`~object.__iadd__`, ele é chamado quando a atribuição aumentada ``+=`` é executada, e seu valor de retorno é o que é usado na instrução de atribuição; e (b) para listas, :meth:`!__iadd__` é equivalente a chamar :meth:`!extend` na lista e retornar a lista. É por isso que dizemos que, para listas, ``+=`` é uma “abreviação” para :meth:`!list.extend`::

source: This is equivalent to::
pt_br: Isso equivale a::

source: The object pointed to by a_list has been mutated, and the pointer to the mutated object is assigned back to ``a_list``. The end result of the assignment is a no-op, since it is a pointer to the same object that ``a_list`` was previously pointing to, but the assignment still happens.
pt_br: O objeto apontado por a_list foi alterado e o ponteiro para o objeto alterado é atribuído novamente a ``a_list``. O resultado final da atribuição é um no-op, pois é um ponteiro para o mesmo objeto para o qual ``a_list`` estava apontando anteriormente, mas a atribuição ainda acontece.

source: Thus, in our tuple example what is happening is equivalent to::
pt_br: Portanto, em nosso exemplo da tupla, o que está acontecendo é equivalente a:

source: The :meth:`!__iadd__` succeeds, and thus the list is extended, but even though ``result`` points to the same object that ``a_tuple[0]`` already points to, that final assignment still results in an error, because tuples are immutable.
pt_br: O :meth:`!__iadd__` é bem-sucedido e, portanto, a lista é estendida, mas mesmo que ``result`` aponte para o mesmo objeto para o qual ``a_tuple[0]`` já aponta, essa atribuição final ainda resulta em um erro, pois as tuplas são imutáveis.

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
pt_br: Quero fazer uma ordenação confusa: você pode fazer uma transformação schwartziana em Python?

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, use the ``key`` argument for the :meth:`list.sort` method::
pt_br: A técnica, atribuída a Randal Schwartz da comunidade Perl, ordena os elementos de uma lista por uma métrica que mapeia cada elemento para seu “valor de ordem”. Em Python, use o argumento ``key`` para o método :meth:`list.sort`::

source: How can I sort one list by values from another list?
pt_br: Como eu posso ordenar uma lista pelos valores de outra lista?

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
pt_br: Combine-as em um iterador de tuplas, ordene a lista resultante e, em seguida, escolha o elemento desejado:

source: >>> list1 = ["what", "I'm", "sorting", "by"] >>> list2 = ["something", "else", "to", "sort"] >>> pairs = zip(list1, list2) >>> pairs = sorted(pairs) >>> pairs [("I'm", 'else'), ('by', 'sort'), ('sorting', 'to'), ('what', 'something')] >>> result = [x[1] for x in pairs] >>> result ['else', 'sort', 'to', 'something']
pt_br: >>> list1 = ["lista", "usada", "na", "ordenação"] >>> list2 = ["alguma", "coisa", "para", "ordenar"] >>> pairs = zip(list1, list2) >>> pairs = sorted(pairs) >>> pairs [('lista', 'alguma'), ('na', 'para'), ('ordenação', 'ordenar'), ('usada', 'coisa')] >>> result = [x[1] for x in pairs] >>> result ['alguma', 'para', 'ordenar', 'coisa']

source: Objects
pt_br: Objetos

source: What is a class?
pt_br: O que é uma classe?

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
pt_br: Uma classe é o tipo de objeto específico criado pela execução da instrução class. Os objetos classe são usados como modelos para criar objetos instância, que incorporam os dados (atributos) e o código (métodos) específicos de um tipo de dado.

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
pt_br: Uma classe pode ser baseada em uma ou mais outras classes, chamadas de classe(s) base(s), herdando seus atributos e métodos. Isso permite que um modelo de objeto seja sucessivamente refinado por herança. Você pode ter uma classe genérica ``Mailbox`` que fornece métodos básicos para uma caixa de correio e subclasses como ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` que manipula vários formatos específicos de caixa de correio.

source: What is a method?
pt_br: O que é um método?

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
pt_br: Um método é uma função em algum objeto ``x`` que você normalmente chama com ``x.name(arguments...)``. Métodos são definidos como funções dentro da definição da classe::

source: What is self?
pt_br: O que é o self?

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
pt_br: Self é apenas um nome convencional para o primeiro argumento de um método. Um método definido como ``meth(self, a, b, c)`` deve ser chamado com ``x.meth(a, b, c)`` para alguma instância ``x`` da classe em que a definição ocorre; o método chamado pensará que é chamado com ``meth(x, a, b, c)``.

source: See also :ref:`why-self`.
pt_br: Veja também :ref:`why-self`.

source: How do I check if an object is an instance of a given class or of a subclass of it?
pt_br: Como eu verifico se um objeto é uma instância de uma dada classe ou de uma subclasse dela?

source: Use the built-in function :func:`isinstance(obj, cls) <isinstance>`. You can check if an object is an instance of any of a number of classes by providing a tuple instead of a single class, e.g. ``isinstance(obj, (class1, class2, ...))``, and can also check whether an object is one of Python's built-in types, e.g. ``isinstance(obj, str)`` or ``isinstance(obj, (int, float, complex))``.
pt_br: Use a função embutida :func:`isinstance(obj, cls) <isinstance>`. Você pode verificar se um objeto é uma instância de qualquer uma de várias classes fornecendo um tupla em vez de uma única classe, por exemplo, ``isinstance(obj, (class1, class2, ...))``, e também pode verificar se um objeto é de um dos tipos embutidos no Python, por exemplo, ``isinstance(obj, str)`` ou ``isinstance(obj, (int, float, complex))``.

source: Note that :func:`isinstance` also checks for virtual inheritance from an :term:`abstract base class`. So, the test will return ``True`` for a registered class even if hasn't directly or indirectly inherited from it. To test for "true inheritance", scan the :term:`MRO` of the class:
pt_br: Observe que :func:`isinstance` também verifica se há herança virtual de uma :term:`classe base abstrata`. Portanto, o teste retorna ``True`` para uma classe registrada, mesmo que não tenha herdado direta ou indiretamente dela. Para testar a "herança verdadeira", verifique o :term:`MRO` da classe:
