Repository: python/python-docs-pt-br
Catalog: faq/programming.po
Languages: pt_br

source: Programming FAQ
pt_br: FAQ sobre programação

source: Contents
pt_br: Conteúdo

source: General Questions
pt_br: Perguntas gerais

source: Is there a source code level debugger with breakpoints, single-stepping, etc.?
pt_br: Existe um depurador a nível de código-fonte que possua pontos de interrupção (*breakpoints*), single-stepping, etc.?

source: Yes.
pt_br: Sim.

source: Several debuggers for Python are described below, and the built-in function :func:`breakpoint` allows you to drop into any of them.
pt_br: Vários depuradores para Python estão descritos abaixo, e a função embutida :func:`breakpoint` permite que você caia em qualquer um desses pontos.

source: The pdb module is a simple but adequate console-mode debugger for Python. It is part of the standard Python library, and is :mod:`documented in the Library Reference Manual <pdb>`. You can also write your own debugger by using the code for pdb as an example.
pt_br: O módulo pdb é um depurador em modo Console simples, mas adequado, para o Python. Faz parte da biblioteca padrão do Python e está documentado no :mod:`manual de referencia da biblioteca <pdb>`. Você também pode construir do seu próprio depurador usando o código do pdb como um exemplo.

source: The IDLE interactive development environment, which is part of the standard Python distribution (normally available as `Tools/scripts/idle3 <https://github.com/python/cpython/blob/main/Tools/scripts/idle3>`_), includes a graphical debugger.
pt_br: O IDLE é um ambiente interativo de desenvolvimento que faz parte da distribuição padrão do Python (normalmente acessível como `Tools/scripts/idle3 <https://github.com/python/cpython/blob/main/Tools/scripts/idle3>`_), e inclui um depurador gráfico.

source: PythonWin is a Python IDE that includes a GUI debugger based on pdb. The PythonWin debugger colors breakpoints and has quite a few cool features such as debugging non-PythonWin programs. PythonWin is available as part of `pywin32 <https://github.com/mhammond/pywin32>`_ project and as a part of the `ActivePython <https://www.activestate.com/products/python/>`_ distribution.
pt_br: O PythonWin é uma IDE feita para o Python que inclui um depurador gráfico baseado no pdb. O depurador do PythonWin colore os pontos de interrupção e tem alguns recursos legais, como a depuração de programas que não são PythonWin. O PythonWin está disponível como parte do projeto `pywin32 <https://github.com/mhammond/pywin32>`_ e como parte da distribuição `ActivePython <https://www.activestate.com/products/python/>`_.

source: `Eric <https://eric-ide.python-projects.org/>`_ is an IDE built on PyQt and the Scintilla editing component.
pt_br: `Eric <https://eric-ide.python-projects.org/>`_ é uma IDE construída com PyQt e o componente de edição Scintilla.

source: `trepan3k <https://github.com/rocky/python3-trepan/>`_ is a gdb-like debugger.
pt_br: `trepan3k <https://github.com/rocky/python3-trepan/>`_ é um depurador similar ao gdb.

source: `Visual Studio Code <https://code.visualstudio.com/>`_ is an IDE with debugging tools that integrates with version-control software.
pt_br: `Visual Studio Code <https://code.visualstudio.com/>`_ é uma IDE com ferramentas de depuração integrada com softwares de controle de versão.

source: There are a number of commercial Python IDEs that include graphical debuggers. They include:
pt_br: Há uma série de IDE comerciais para desenvolvimento com o Python que inclui depuradores gráficos. Dentre tantas temos:

source: Are there tools to help find bugs or perform static analysis?
pt_br: Existem ferramentas para ajudar a encontrar bugs ou fazer análise estática de desempenho?

source: `Pylint <https://pylint.pycqa.org/en/latest/index.html>`_ and `Pyflakes <https://github.com/PyCQA/pyflakes>`_ do basic checking that will help you catch bugs sooner.
pt_br: `Pylint <https://pylint.pycqa.org/en/latest/index.html>`_ e `Pyflakes <https://github.com/PyCQA/pyflakes>`_ fazem verificações básicas que te ajudarão a encontrar erros mais cedo.

source: Static type checkers such as `Mypy <https://mypy-lang.org/>`_, `Pyre <https://pyre-check.org/>`_, and `Pytype <https://github.com/google/pytype>`_ can check type hints in Python source code.
pt_br: Verificadores de tipo estático como `Mypy <https://mypy-lang.org/>`_, `Pyre <https://pyre-check.org/>`_ e `Pytype <https://github.com/google/pytype>`_ conseguem verificar dicas de tipo em código-fonte Python.

source: How can I create a stand-alone binary from a Python script?
pt_br: Como posso criar um binário independente a partir de um script Python?

source: You don't need the ability to compile Python to C code if all you want is a stand-alone program that users can download and run without having to install the Python distribution first. There are a number of tools that determine the set of modules required by a program and bind these modules together with a Python binary to produce a single executable.
pt_br: Você não precisa possuir a capacidade de compilar o código Python para C se o que deseja é um programa autônomo que os usuários possam baixar e executar sem ter que instalar a distribuição Python primeiro. Existem várias ferramentas que determinam o conjunto de módulos exigidos por um programa e vinculam esses módulos ao binário do Python para produzir um único executável.

source: One is to use the freeze tool, which is included in the Python source tree as `Tools/freeze <https://github.com/python/cpython/tree/main/Tools/freeze>`_. It converts Python byte code to C arrays; with a C compiler you can embed all your modules into a new program, which is then linked with the standard Python modules.
pt_br: Uma delas é usar a ferramenta *freeze*, que está incluída na árvore de código-fonte Python como `Tools/freeze <https://github.com/python/cpython/tree/main/Tools/freeze>`_. Ela converte o *bytecode* de Python em vetores de C. Com um compilador de C, você consegue incorporar todos os seus módulos em um novo programa, que é então vinculado aos módulos-padrão de Python.

source: It works by scanning your source recursively for import statements (in both forms) and looking for the modules in the standard Python path as well as in the source directory (for built-in modules). It then turns the bytecode for modules written in Python into C code (array initializers that can be turned into code objects using the marshal module) and creates a custom-made config file that only contains those built-in modules which are actually used in the program. It then compiles the generated C code and links it with the rest of the Python interpreter to form a self-contained binary which acts exactly like your script.
pt_br: A *freeze* trabalha percorrendo seu código recursivamente, procurando por instruções de importação (ambas as formas), e procurando por módulos tanto no caminho padrão do Python, quanto por módulos embutidos no diretório fonte. Ela então transforma o *bytecode* de módulos Python em código C (inicializadores de vetor que podem ser transformados em objetos código usando o módulo `marshal`), e depois cria um arquivo de configurações personalizado que só contém os módulos embutidos usados no programa. A ferramenta então compila os códigos C e os vincula como o resto do interpretador Python, formando um binário autônomo que funciona exatamente como seu *script*.

source: The following packages can help with the creation of console and GUI executables:
pt_br: Os pacotes a seguir podem ajudar com a criação dos executáveis do console e da GUI:

source: `Nuitka <https://nuitka.net/>`_ (Cross-platform)
pt_br: `Nuitka <https://nuitka.net/>`_ (Multiplataforma)

source: `PyInstaller <https://pyinstaller.org/>`_ (Cross-platform)
pt_br: `PyInstaller <https://pyinstaller.org/>`_ (Multiplataforma)

source: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Cross-platform)
pt_br: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Multiplataforma)

source: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Cross-platform)
pt_br: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Multiplataforma)

source: `py2app <https://github.com/ronaldoussoren/py2app>`_ (macOS only)
pt_br: `py2app <https://github.com/ronaldoussoren/py2app>`_ (somente macOS)

source: `py2exe <https://www.py2exe.org/>`_ (Windows only)
pt_br: `py2exe <https://www.py2exe.org/>`_ (somente Windows)

source: Are there coding standards or a style guide for Python programs?
pt_br: Existem padrões para a codificação ou um guia de estilo utilizado pela comunidade Python?

source: Yes. The coding style required for standard library modules is documented as :pep:`8`.
pt_br: Sim. O guia de estilo esperado para módulos e biblioteca padrão possui o nome de PEP8 e você pode acessar a sua documentação em :pep:`8`.

source: Core Language
pt_br: Núcleo da linguagem

source: Why am I getting an UnboundLocalError when the variable has a value?
pt_br: Porque recebo o erro UnboundLocalError quando a variável possui um valor associado?

source: It can be a surprise to get the :exc:`UnboundLocalError` in previously working code when it is modified by adding an assignment statement somewhere in the body of a function.
pt_br: Pode ser uma surpresa obter a exceção :exc:`UnboundLocalError` em um código previamente funcional quando adicionamos uma instrução de atribuição em algum lugar no corpo de uma função.

source: This code:
pt_br: Este código:

source: works, but this code:
pt_br: funciona, mas este código:

source: results in an :exc:`!UnboundLocalError`:
pt_br: resulta em uma :exc:`!UnboundLocalError`:

source: This is because when you make an assignment to a variable in a scope, that variable becomes local to that scope and shadows any similarly named variable in the outer scope. Since the last statement in foo assigns a new value to ``x``, the compiler recognizes it as a local variable. Consequently when the earlier ``print(x)`` attempts to print the uninitialized local variable and an error results.
pt_br: Isso acontece porque, quando atribuímos um valor a uma variável em determinado escopo, essa variável torna-se local desse escopo, acabando por esconder qualquer outra variável de mesmo nome no escopo externo. Como a última instrução em foo atribui um novo valor a ``x``, o interpretador a reconhece como uma variável local. Consequentemente, quando o ``print(x)`` anterior tentar exibir a variável local não inicializada, um erro aparece.

source: In the example above you can access the outer scope variable by declaring it global:
pt_br: No exemplo acima, podemos acessar a variável do escopo externo declarando-a como global:

source: This explicit declaration is required in order to remind you that (unlike the superficially analogous situation with class and instance variables) you are actually modifying the value of the variable in the outer scope:
pt_br: Esta declaração explícita é necessária para lembrarmos que estamos modificando o valor da variável no escopo externo (ao contrário da situação superficialmente análoga com variáveis de classe e instância):

source: You can do a similar thing in a nested scope using the :keyword:`nonlocal` keyword:
pt_br: Podemos fazer algo parecido num escopo aninhado usando a palavra reservada :keyword:`nonlocal`:

source: What are the rules for local and global variables in Python?
pt_br: Quais são as regras para variáveis locais e globais em Python?

source: In Python, variables that are only referenced inside a function are implicitly global. If a variable is assigned a value anywhere within the function's body, it's assumed to be a local unless explicitly declared as global.
pt_br: Em Python, as variáveis que são apenas utilizadas (referenciadas) dentro de uma função são implicitamente globais. Se uma variável for associada a um valor em qualquer lugar dentro do corpo da função, presume-se que a mesma seja local, a menos que seja explicitamente declarada como global.

source: Though a bit surprising at first, a moment's consideration explains this. On one hand, requiring :keyword:`global` for assigned variables provides a bar against unintended side-effects. On the other hand, if ``global`` was required for all global references, you'd be using ``global`` all the time. You'd have to declare as global every reference to a built-in function or to a component of an imported module. This clutter would defeat the usefulness of the ``global`` declaration for identifying side-effects.
pt_br: Embora um pouco surpreendente no início, um momento de consideração explica isso. Por um lado, exigir :keyword:`global` para variáveis atribuídas fornece uma barreira contra efeitos colaterais indesejados. Por outro lado, se ``global`` fosse necessário para todas as referências globais, você estaria usando ``global`` o tempo todo. Você teria que declarar como global todas as referências a uma função embutida ou a um componente de um módulo importado. Essa desordem anularia a utilidade da declaração de ``global`` para identificar efeitos colaterais.

source: Why do lambdas defined in a loop with different values all return the same result?
pt_br: Por que os lambdas definidos em um laço com valores diferentes retornam o mesmo resultado?

source: Assume you use a for loop to define a few different lambdas (or even plain functions), e.g.::
pt_br: Suponha que se utilize um laço `for` para definir algumas funções lambdas (ou mesmo funções simples), por exemplo.::

source: This gives you a list that contains 5 lambdas that calculate ``x**2``. You might expect that, when called, they would return, respectively, ``0``, ``1``, ``4``, ``9``, and ``16``. However, when you actually try you will see that they all return ``16``::
pt_br: Isso oferece uma lista que contém 5 lambdas que calculam ``x**2``. Você pensar que, quando invocado, os mesmos retornam, respectivamente, ``0``, ``1``, ``4``, ``9``, e ``16``. No entanto, quando realmente tentar, vai ver que todos retornam ``16``::

source: This happens because ``x`` is not local to the lambdas, but is defined in the outer scope, and it is accessed when the lambda is called --- not when it is defined. At the end of the loop, the value of ``x`` is ``4``, so all the functions now return ``4**2``, i.e. ``16``. You can also verify this by changing the value of ``x`` and see how the results of the lambdas change::
pt_br: Isso acontece porque ``x`` não é local para os lambdas, mas é definido no escopo externo, e é acessado quando o lambda for chamado --- não quando é definido. No final do laço, o valor de ``x`` será ``4``, e então, todas as funções agora retornarão ``4**2``, ou seja, ``16``. Também é possível verificar isso alterando o valor de ``x`` e vendo como os resultados dos lambdas mudam::

source: In order to avoid this, you need to save the values in variables local to the lambdas, so that they don't rely on the value of the global ``x``::
pt_br: Para evitar isso, é necessário salvar os valores nas variáveis locais para os lambdas, para que eles não dependam do valor de ``x`` global::

source: Here, ``n=x`` creates a new variable ``n`` local to the lambda and computed when the lambda is defined so that it has the same value that ``x`` had at that point in the loop. This means that the value of ``n`` will be ``0`` in the first lambda, ``1`` in the second, ``2`` in the third, and so on. Therefore each lambda will now return the correct result::
pt_br: Aqui, ``n=x`` cria uma nova variável ``n`` local para o lambda e é calculada quando o lambda é definido para que ele tenha o mesmo valor que ``x`` tem nesse ponto no laço. Isso significa que o valor de ``n`` será ``0`` no primeiro "ciclo" do lambda, ``1`` no segundo "ciclo", ``2`` no terceiro, e assim por diante. Portanto, cada lambda agora retornará o resultado correto::

source: Note that this behaviour is not peculiar to lambdas, but applies to regular functions too.
pt_br: Observe que esse comportamento não é peculiar dos lambdas, o mesmo também ocorre com as funções regulares.

source: How do I share global variables across modules?
pt_br: Como definir variáveis globais dentro de módulos?

source: The canonical way to share information across modules within a single program is to create a special module (often called config or cfg). Just import the config module in all modules of your application; the module then becomes available as a global name. Because there is only one instance of each module, any changes made to the module object get reflected everywhere. For example:
pt_br: A maneira canônica de compartilhar informações entre módulos dentro de um único programa é criando um módulo especial (geralmente chamado de config ou cfg). Basta importar o módulo de configuração em todos os módulos da sua aplicação; o módulo ficará disponível como um nome global. Como há apenas uma instância de cada módulo, todas as alterações feitas no objeto do módulo se refletem em todos os lugares. Por exemplo:

source: x = 0 # Default value of the 'x' configuration setting
pt_br: x = 0 # Valor padrão para a configuração de 'x'

source: Note that using a module is also the basis for implementing the singleton design pattern, for the same reason.
pt_br: Note que usar um módulo também é a base para a implementação do padrão de projeto Singleton, pela mesma razão.

source: What are the "best practices" for using import in a module?
pt_br: Quais são as "melhores práticas" quando fazemos uso da importação de módulos?

source: In general, don't use ``from modulename import *``. Doing so clutters the importer's namespace, and makes it much harder for linters to detect undefined names.
pt_br: Em geral, não use ``from nomemódulo import *``. Isso desorganiza o espaço de nomes do importador e torna muito mais difícil para as ferramentas de análise estática detectarem nomes indefinidos.

source: Import modules at the top of a file. Doing so makes it clear what other modules your code requires and avoids questions of whether the module name is in scope. Using one import per line makes it easy to add and delete module imports, but using multiple imports per line uses less screen space.
pt_br: Faça a importação de módulos na parte superior do arquivo. Isso deixa claro quais outros módulos nosso código necessita e evita dúvidas sobre, por exemplo, se o nome do módulo está no escopo. Usar uma importação por linha facilita a adição e exclusão de importações de módulos, porém, usar várias importações num única linha, ocupa menos espaço da tela.

source: It's good practice if you import modules in the following order:
pt_br: É uma boa prática importar os módulos na seguinte ordem:

source: standard library modules -- e.g. :mod:`sys`, :mod:`os`, :mod:`argparse`, :mod:`re`
pt_br: módulos da biblioteca padrão -- por exemplo: :mod:`sys`, :mod:`os`, :mod:`argparse` e :mod:`re`

source: third-party library modules (anything installed in Python's site-packages directory) -- e.g. :mod:`!dateutil`, :mod:`!requests`, :mod:`!PIL.Image`
pt_br: módulos de biblioteca de terceiros (qualquer instalação feita contida no repositório de códigos na pasta site-packages) -- por exemplo: :mod:`!dateutil`, :mod:`!requests` e :mod:`!PIL.Image`

source: locally developed modules
pt_br: módulos desenvolvidos localmente

source: It is sometimes necessary to move imports to a function or class to avoid problems with circular imports. Gordon McMillan says:
pt_br: Às vezes, é necessário transferir as importações para uma função ou classe para evitar problemas com importação circular. Gordon McMillan diz:

source: Circular imports are fine where both modules use the "import <module>" form of import. They fail when the 2nd module wants to grab a name out of the first ("from module import name") and the import is at the top level. That's because names in the 1st are not yet available, because the first module is busy importing the 2nd.
pt_br: As importações circulares vão bem onde ambos os módulos utilizam a forma de importação "import <módulo>". Elas falham quando o 2º módulo quer pegar um nome do primeiro ("from módulo import nome") e a importação está no nível superior. Isso porque os nomes no primeiro ainda não estão disponíveis, porque o 1º módulo está ocupado importando o 2º.

source: In this case, if the second module is only used in one function, then the import can easily be moved into that function. By the time the import is called, the first module will have finished initializing, and the second module can do its import.
pt_br: Nesse caso, se o segundo módulo for usado apenas numa função, a importação pode ser facilmente movida para dentro do escopo dessa função. No momento em que a importação for chamada, o primeiro módulo terá finalizado a inicialização e o segundo módulo poderá ser importado sem maiores complicações.

source: It may also be necessary to move imports out of the top level of code if some of the modules are platform-specific. In that case, it may not even be possible to import all of the modules at the top of the file. In this case, importing the correct modules in the corresponding platform-specific code is a good option.
pt_br: Também poderá ser necessário mover as importações para fora do nível superior do código se alguns dos módulos forem específicos de uma determinada plataforma (SO). Nesse caso, talvez nem seja possível importar todos os módulos na parte superior do arquivo. Nessas situações devemos importar os módulos que são específicos de cada plataforma antes de necessitar utilizar os mesmos.

source: Only move imports into a local scope, such as inside a function definition, if it's necessary to solve a problem such as avoiding a circular import or are trying to reduce the initialization time of a module. This technique is especially helpful if many of the imports are unnecessary depending on how the program executes. You may also want to move imports into a function if the modules are only ever used in that function. Note that loading a module the first time may be expensive because of the one time initialization of the module, but loading a module multiple times is virtually free, costing only a couple of dictionary lookups. Even if the module name has gone out of scope, the module is probably available in :data:`sys.modules`.
pt_br: Apenas mova as importações para um escopo local, como dentro da definição de função, se for necessário resolver algum tipo de problema, como, por exemplo, evitar importações circulares ou tentar reduzir o tempo de inicialização do módulo. Esta técnica é especialmente útil se muitas das importações forem desnecessárias, dependendo de como o programa é executado. Também podemos desejar mover as importações para uma função se os módulos forem usados somente nessa função. Note que carregar um módulo pela primeira vez pode ser demorado devido ao tempo de inicialização de cada módulo, no entanto, carregar um módulo várias vezes é praticamente imperceptível, tendo somente o custo de processamento de pesquisas no dicionário de nomes. Mesmo que o nome do módulo tenha saído do escopo, o módulo provavelmente estará disponível em :data:`sys.modules`.

source: Why are default values shared between objects?
pt_br: Por que os valores padrão são compartilhados entre objetos?

source: This type of bug commonly bites neophyte programmers. Consider this function::
pt_br: Este tipo de erro geralmente pega programadores neófitos. Considere esta função::

source: def foo(mydict={}): # Danger: shared reference to one dict for all calls ... compute something ... mydict[key] = value return mydict
pt_br: def foo(meudict={}): # Perigo: referência compartilhada a um dicionário para todas as chamadas ... faz alguma coisa ... meudict[chave] = valor return meudict
