Repository: python/python-docs-pt-br
Catalog: faq/programming.po
Languages: pt_br

source: [on_true] if [expression] else [on_false] x, y = 50, 25 small = x if x < y else y
pt_br: [quando_verdadeiro] if [expressão] else [quando_falso] x, y = 50, 25 small = x if x < y else y

source: Before this syntax was introduced in Python 2.5, a common idiom was to use logical operators::
pt_br: Antes que essa sintaxe fosse introduzida no Python 2.5, uma expressão comum era usar operadores lógicos::

source: [expression] and [on_true] or [on_false]
pt_br: [expressão] and [quando_verdadeiro] or [quando_falso]

source: However, this idiom is unsafe, as it can give wrong results when *on_true* has a false boolean value. Therefore, it is always better to use the ``... if ... else ...`` form.
pt_br: No entanto, essa forma não é segura, pois pode dar resultados inesperados quando *quando_verdadeiro* tiver um valor booleano falso. Portanto, é sempre melhor usar a forma ``... if ... else ...``.

source: Is it possible to write obfuscated one-liners in Python?
pt_br: É possível escrever instruções de uma só linha ofuscadas em Python?

source: Yes. Usually this is done by nesting :keyword:`lambda` within :keyword:`!lambda`. See the following three examples, slightly adapted from Ulf Bartelt::
pt_br: Sim. Normalmente, isso é feito aninhando :keyword:`lambda` dentro de :keyword:`!lambda`. Veja os três exemplos a seguir, ligeiramente adaptados de Ulf Bartelt::

source: from functools import reduce # Primes < 1000 print(list(filter(None,map(lambda y:y*reduce(lambda x,y:x*y!=0, map(lambda x,y=y:y%x,range(2,int(pow(y,0.5)+1))),1),range(2,1000))))) # First 10 Fibonacci numbers print(list(map(lambda x,f=lambda x,f:(f(x-1,f)+f(x-2,f)) if x>1 else 1: f(x,f), range(10)))) # Mandelbrot set print((lambda Ru,Ro,Iu,Io,IM,Sx,Sy:reduce(lambda x,y:x+'\n'+y,map(lambda y, Iu=Iu,Io=Io,Ru=Ru,Ro=Ro,Sy=Sy,L=lambda yc,Iu=Iu,Io=Io,Ru=Ru,Ro=Ro,i=IM, Sx=Sx,Sy=Sy:reduce(lambda x,y:x+y,map(lambda x,xc=Ru,yc=yc,Ru=Ru,Ro=Ro, i=i,Sx=Sx,F=lambda xc,yc,x,y,k,f=lambda xc,yc,x,y,k,f:(k<=0)or (x*x+y*y >=4.0) or 1+f(xc,yc,x*x-y*y+xc,2.0*x*y+yc,k-1,f):f(xc,yc,x,y,k,f):chr( 64+F(Ru+x*(Ro-Ru)/Sx,yc,0,0,i)),range(Sx))):L(Iu+y*(Io-Iu)/Sy),range(Sy ))))(-2.1, 0.7, -1.2, 1.2, 30, 80, 24)) # \___ ___/ \___ ___/ | | |__ lines on screen # V V | |______ columns on screen # | | |__________ maximum of "iterations" # | |_________________ range on y axis # |____________________________ range on x axis
pt_br: from functools import reduce # Primos < 1000 print(list(filter(None,map(lambda y:y*reduce(lambda x,y:x*y!=0, map(lambda x,y=y:y%x,range(2,int(pow(y,0.5)+1))),1),range(2,1000))))) # Primeiros 10 números de Fibonacci print(list(map(lambda x,f=lambda x,f:(f(x-1,f)+f(x-2,f)) if x>1 else 1: f(x,f), range(10)))) # Conjunto de Mandelbrot print((lambda Ru,Ro,Iu,Io,IM,Sx,Sy:reduce(lambda x,y:x+'\n'+y,map(lambda y, Iu=Iu,Io=Io,Ru=Ru,Ro=Ro,Sy=Sy,L=lambda yc,Iu=Iu,Io=Io,Ru=Ru,Ro=Ro,i=IM, Sx=Sx,Sy=Sy:reduce(lambda x,y:x+y,map(lambda x,xc=Ru,yc=yc,Ru=Ru,Ro=Ro, i=i,Sx=Sx,F=lambda xc,yc,x,y,k,f=lambda xc,yc,x,y,k,f:(k<=0)or (x*x+y*y >=4.0) or 1+f(xc,yc,x*x-y*y+xc,2.0*x*y+yc,k-1,f):f(xc,yc,x,y,k,f):chr( 64+F(Ru+x*(Ro-Ru)/Sx,yc,0,0,i)),range(Sx))):L(Iu+y*(Io-Iu)/Sy),range(Sy ))))(-2.1, 0.7, -1.2, 1.2, 30, 80, 24)) # \___ ___/ \___ ___/ | | |__ linhas na tela # V V | |______ colunas na tela # | | |__________ máximo de "interações" # | |_________________ faixa no eixo y # |____________________________ faixa no eixo x

source: Don't try this at home, kids!
pt_br: Não tente isso em casa, crianças!

source: What does the slash(/) in the parameter list of a function mean?
pt_br: O que a barra(/) na lista de parâmetros de uma função significa?

source: A slash in the argument list of a function denotes that the parameters prior to it are positional-only. Positional-only parameters are the ones without an externally usable name. Upon calling a function that accepts positional-only parameters, arguments are mapped to parameters based solely on their position. For example, :func:`divmod` is a function that accepts positional-only parameters. Its documentation looks like this::
pt_br: Uma barra na lista de argumentos de uma função indica que os parâmetros anteriores a ela são somente-posicionais. Os parâmetros somente-posicionais são aqueles que não têm nome utilizável externamente. Ao chamar uma função que aceita parâmetros somente-posicionais, os argumentos são mapeados para parâmetros com base apenas em sua posição. Por exemplo, :func:`divmod` é uma função que aceita parâmetros somente-posicionais. Sua documentação tem esta forma::

source: The slash at the end of the parameter list means that both parameters are positional-only. Thus, calling :func:`divmod` with keyword arguments would lead to an error::
pt_br: A barra no final da lista de parâmetros significa que ambos os parâmetros são somente-posicionais. Assim, chamar :func:`divmod` com argumentos nomeados levaria a um erro::

source: Numbers and strings
pt_br: Números e strings

source: How do I specify hexadecimal and octal integers?
pt_br: Como faço para especificar números inteiros hexadecimais e octais?

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
pt_br: Para especificar um dígito no formato octal, preceda o valor octal com um zero e, em seguida, um "o" minúsculo ou maiúsculo. Por exemplo, para definir a variável "a" para o valor octal "10" (8 em decimal), digite::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
pt_br: Hexadecimal é bem fácil. Basta preceder o número hexadecimal com um zero e, em seguida, um "x" minúsculo ou maiúsculo. Os dígitos hexadecimais podem ser especificados em letras maiúsculas e minúsculas. Por exemplo, no interpretador Python::

source: Why does -22 // 10 return -3?
pt_br: Por que -22 // 10 retorna -3?

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
pt_br: Esta dúvida é primariamente direcionado pelo desejo de que ``i % j`` tenha o mesmo sinal que ``j``. Se quiser isso, e também quiser::

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
pt_br: então a divisão inteira deve retornar o piso. C também requer que essa identidade seja mantida, e então os compiladores que truncarem ``i // j`` precisam fazer com que ``i % j`` tenham o mesmo sinal que ``i``.

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
pt_br: Existem poucos casos de uso reais para ``i % j`` quando ``j`` é negativo. Quando ``j`` é positivo, existem muitos, e em virtualmente todos eles é mais útil para ``i % j`` ser ``>= 0``. Se o relógio marca 10 agora, o que dizia há 200 horas? ``-190 % 12 == 2`` é útil, enquanto ``-190 % 12 == -10`` é um bug esperando para morder.

source: How do I get int literal attribute instead of SyntaxError?
pt_br: Como obtenho um atributo de um literal int em vez de SyntaxError?

source: Trying to lookup an ``int`` literal attribute in the normal manner gives a :exc:`SyntaxError` because the period is seen as a decimal point::
pt_br: Tentar obter um atributo de um literal ``int`` da maneira normal retorna um :exc:`SyntaxError` porque o ponto é visto como um ponto decimal::

source: The solution is to separate the literal from the period with either a space or parentheses.
pt_br: A solução é separar o literal do ponto com um espaço ou parênteses.

source: How do I convert a string to a number?
pt_br: Como faço para converter uma string em um número?

source: For integers, use the built-in :func:`int` type constructor, e.g. ``int('144') == 144``. Similarly, :func:`float` converts to a floating-point number, e.g. ``float('144') == 144.0``.
pt_br: Para inteiros, use o construtor do tipo embutido :func:`int`, por exemplo, ``int('144') == 144``. Da mesma forma, :func:`float` converterá para um número de ponto flutuante, por exemplo ``float('144') == 144.0``.

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` holds true, and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int( '0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0o' indicates octal, and '0x' indicates a hex number.
pt_br: Por padrão, eles interpretam o número como decimal, de modo que ``int('0144') == 144`` é verdadeiro e ``int('0x144')`` levanta :exc:`ValueError`. ``int(string, base)`` toma a base para converter como um segundo argumento opcional, então ``int( '0x144', 16) == 324``. Se a base for especificada como 0, o número é interpretado usando as regras do Python: um "0o" à esquerda indica octal e "0x" indica um número hexadecimal.

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
pt_br: Não use a função embutida :func:`eval` se tudo que você precisa é converter strings em números. :func:`eval` será significativamente mais lento e apresenta um risco de segurança: alguém pode passar a você uma expressão Python que pode ter efeitos colaterais indesejados. Por exemplo, alguém poderia passar ``__import__('os').system("rm -rf $HOME")`` que apagaria seu diretório pessoal.

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
pt_br: :func:`eval` também tem o efeito de interpretar números como expressões Python, de forma que, por exemplo, ``eval('09')`` resulta em um erro de sintaxe porque Python não permite '0' inicial em um número decimal (exceto '0').

source: How do I convert a number to a string?
pt_br: Como faço para converter um número em uma string?

source: To convert, e.g., the number ``144`` to the string ``'144'``, use the built-in type constructor :func:`str`. If you want a hexadecimal or octal representation, use the built-in functions :func:`hex` or :func:`oct`. For fancy formatting, see the :ref:`f-strings` and :ref:`formatstrings` sections, e.g. ``"{:04d}".format(144)`` yields ``'0144'`` and ``"{:.3f}".format(1.0/3.0)`` yields ``'0.333'``.
pt_br: Para converter, por exemplo, o número ``144`` para a string ``'144'``, use o construtor do tipo embutido :func:`str`. Caso queira uma representação hexadecimal ou octal, use as funções embutidas :func:`hex` ou :func:`oct`. Para a formatação sofisticada, veja as seções :ref:`f-strings` e :ref:`formatstrings`, por exemplo, ``"{:04d}".format(144)`` produz ``'0144'`` e ``"{:.3f}".format(1.0/3.0)`` produz ``'0.333'``.

source: How do I modify a string in place?
pt_br: Como faço para modificar uma string internamente?

source: You can't, because strings are immutable. In most situations, you should simply construct a new string from the various parts you want to assemble it from. However, if you need an object with the ability to modify in-place unicode data, try using an :class:`io.StringIO` object or the :mod:`array` module::
pt_br: Você não pode fazer isso porque as strings são objetos imutáveis. Na maioria das situações, você simplesmente deve construir uma nova string a partir das várias partes das quais deseja montá-la. No entanto, caso precise de um objeto com a capacidade de modificar dados Unicode internamente, tente usar a classe :class:`io.StringIO` ou o módulo :mod:`array`::

source: How do I use strings to call functions/methods?
pt_br: Como faço para invocar funções/métodos através de strings?

source: There are various techniques.
pt_br: Existem várias técnicas.

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
pt_br: A melhor forma é usar um dicionário que mapeie strings para funções. A principal vantagem desta técnica é que estas strings não precisam corresponder aos nomes das funções. Esta é também a principal técnica utilizada para emular uma construção de instrução estilo *case*::

source: def a(): pass def b(): pass dispatch = {'go': a, 'stop': b} # Note lack of parens for funcs dispatch[get_input()]() # Note trailing parens to call function
pt_br: def a(): pass def b(): pass dispatch = {'go': a, 'stop': b} # Note a falta de parênteses para funções dispatch[get_input()]() # Note os parênteses ao final para chamar a função

source: Use the built-in function :func:`getattr`::
pt_br: Usar a função embutida :func:`getattr`::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
pt_br: Observe que a função :func:`getattr` funciona com qualquer objeto, incluindo classes, instâncias de classe, módulos e assim por diante.

source: This is used in several places in the standard library, like this::
pt_br: A mesma é usado em vários lugares na biblioteca padrão, como este::

source: class Foo: def do_foo(self): ... def do_bar(self): ... f = getattr(foo_instance, 'do_' + opname) f()
pt_br: class Foo: def faz_foo(self): ... def faz_bar(self): ... f = getattr(instancia_foo, 'faz_' + opname) f()

source: Use :func:`locals` to resolve the function name::
pt_br: Use :func:`locals` para determinar o nome da função::

source: def myFunc(): print("hello") fname = "myFunc" f = locals()[fname] f()
pt_br: def minhaFunc(): print("hello") fname = "minhaFunc" f = locals()[fname] f()

source: Is there an equivalent to Perl's ``chomp()`` for removing trailing newlines from strings?
pt_br: Existe um equivalente em Perl ``chomp()`` para remover linhas novas ao final de strings?

source: You can use ``S.rstrip("\r\n")`` to remove all occurrences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
pt_br: Pode-se utilizar ``S.rstrip("\r\n")`` para remover todas as ocorrência de qualquer terminador de linha que esteja no final da string ``S`` sem remover os espaços em branco. Se a string ``S`` representar mais de uma linha, contendo várias linhas vazias no final, os terminadores de linha de todas linhas em branco serão removidos::

source: >>> lines = ("line 1 \r\n" ... "\r\n" ... "\r\n") >>> lines.rstrip("\n\r") 'line 1 '
pt_br: >>> linhas = ("linha 1 \r\n" ... "\r\n" ... "\r\n") >>> linhas.rstrip("\n\r") 'linha 1 '

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
pt_br: Geralmente isso só é desejado ao ler um texto linha por linha, usando ``S.rstrip()`` dessa maneira funciona bem.

source: Is there a ``scanf()`` or ``sscanf()`` equivalent?
pt_br: Existe uma função ``scanf()`` ou ``sscanf()`` ou algo equivalente?

source: Not as such.
pt_br: Não como tal.

source: For simple input parsing, the easiest approach is usually to split the line into whitespace-delimited words using the :meth:`~str.split` method of string objects and then convert decimal strings to numeric values using :func:`int` or :func:`float`. :meth:`!split` supports an optional "sep" parameter which is useful if the line uses something other than whitespace as a separator.
pt_br: Para a análise de entrada simples, a abordagem mais fácil geralmente é dividir a linha em palavras delimitadas por espaços em branco usando o método :meth:`~str.split` de objetos strings e, em seguida, converter as strings decimais para valores numéricos usando a função :func:`int` ou a função :func:`float`. O método :meth:`!split` aceita um parâmetro "sep" opcional que é útil se a linha utilizar algo diferente de espaço em branco como separador.

source: For more complicated input parsing, regular expressions are more powerful than C's ``sscanf`` and better suited for the task.
pt_br: Para análise de entradas de textos mais complicadas, as expressões regulares são mais poderosas do que a ``sscanf`` do C e mais adequadas para essa tarefa.

source: What does ``UnicodeDecodeError`` or ``UnicodeEncodeError`` error mean?
pt_br: O que significa o erro ``UnicodeDecodeError`` ou ``UnicodeEncodeError``?

source: See the :ref:`unicode-howto`.
pt_br: Consulte :ref:`unicode-howto`.

source: Can I end a raw string with an odd number of backslashes?
pt_br: Posso terminar uma string bruta com um número ímpar de contrabarras?

source: A raw string ending with an odd number of backslashes will escape the string's quote::
pt_br: Uma string bruta terminando com um número ímpar de contrabarras vai escapar as aspas da string::

source: >>> r'C:\this\will\not\work\' File "<stdin>", line 1 r'C:\this\will\not\work\' ^ SyntaxError: unterminated string literal (detected at line 1)
pt_br: >>> r'C:\isso\não\vai\funcionar\' File "<stdin>", line 1 r'C:\isso\não\vai\funcionar\' ^ SyntaxError: unterminated string literal (detected at line 1)

source: There are several workarounds for this. One is to use regular strings and double the backslashes::
pt_br: Há várias soluções alternativas para isso. Uma delas é usar strings regulares e duplicar as contrabarras::

source: >>> 'C:\\this\\will\\work\\' 'C:\\this\\will\\work\\'
pt_br: >>> 'C:\\isso\\vai\\funcionar\\' 'C:\\isso\\vai\\funcionar\\'

source: Another is to concatenate a regular string containing an escaped backslash to the raw string::
pt_br: Outra é concatenar uma string regular contendo uma contrabarra de escape à string bruta::

source: >>> r'C:\this\will\work' '\\' 'C:\\this\\will\\work\\'
pt_br: >>> r'C:\isso\vai\funcionar' '\\' 'C:\\isso\\vai\\funcionar\\'

source: It is also possible to use :func:`os.path.join` to append a backslash on Windows::
pt_br: Também é possível usar :func:`os.path.join` para acrescentar uma contrabarra no Windows::

source: >>> os.path.join(r'C:\this\will\work', '') 'C:\\this\\will\\work\\'
pt_br: >>> os.path.join(r'C:\isso\vai\funcionar', '') 'C:\\isso\\vai\\funcionar\\'

source: Note that while a backslash will "escape" a quote for the purposes of determining where the raw string ends, no escaping occurs when interpreting the value of the raw string. That is, the backslash remains present in the value of the raw string::
pt_br: Note que, embora uma contrabarra vai "escapar" uma aspa para fins de determinar onde a string bruta termina, nenhum escape ocorre ao interpretar o valor da string bruta. Ou seja, a contrabarra permanece presente no valor da string bruta::

source: >>> r'backslash\'preserved' "backslash\\'preserved"
pt_br: >>> r'contrabarra\'preservada' "contrabarra\\'preservada"

source: Also see the specification in the :ref:`language reference <strings>`.
pt_br: Veja também a especificação na :ref:`referência da linguagem <strings>`.

source: Performance
pt_br: Desempenho

source: My program is too slow. How do I speed it up?
pt_br: Meu programa está muito lento. Como faço para melhorar o desempenho?

source: That's a tough one, in general. First, here are a list of things to remember before diving further:
pt_br: Isso geralmente é algo difícil de conseguir. Primeiro, aqui está uma lista de situações que devemos lembrar para melhorar o desempenho da nossa aplicação antes de buscarmos outras soluções:

source: Performance characteristics vary across Python implementations. This FAQ focuses on :term:`CPython`.
pt_br: As características da desempenho podem variar conforme a implementação do Python. Esse FAQ se concentra no :term:`CPython`.

source: Behaviour can vary across operating systems, especially when talking about I/O or multi-threading.
pt_br: O comportamento pode variar em cada sistemas operacionais, especialmente quando estivermos tratando de E/S ou multi-threading.

source: You should always find the hot spots in your program *before* attempting to optimize any code (see the :mod:`profile` module).
pt_br: Sempre devemos encontrar os hot spots em nosso programa *antes de* tentar otimizar qualquer código (veja o módulo :mod:`profile`).

source: Writing benchmark scripts will allow you to iterate quickly when searching for improvements (see the :mod:`timeit` module).
pt_br: Escrever scripts de benchmark permitirá iterar rapidamente buscando melhorias (veja o módulo :mod:`timeit`).

source: It is highly recommended to have good code coverage (through unit testing or any other technique) before potentially introducing regressions hidden in sophisticated optimizations.
pt_br: É altamente recomendável ter boa cobertura de código (através de testes de unidade ou qualquer outra técnica) antes de potencialmente apresentar regressões escondidas em otimizações sofisticadas.

source: That being said, there are many tricks to speed up Python code. Here are some general principles which go a long way towards reaching acceptable performance levels:
pt_br: Dito isto, existem muitos truques para acelerar nossos códigos Python. Aqui estão alguns dos principais tópicos e que geralmente ajudam a atingir níveis de desempenho aceitáveis:

source: Making your algorithms faster (or changing to faster ones) can yield much larger benefits than trying to sprinkle micro-optimization tricks all over your code.
pt_br: Fazer seus algoritmos rápidos (ou mudando para mais rápidos) podem produzir benefícios maiores que tentar encaixar várias micro-otimizações no seu código.

source: Use the right data structures. Study documentation for the :ref:`bltin-types` and the :mod:`collections` module.
pt_br: Usar as estruturas de dados corretas. Estude a documentação para :ref:`bltin-types` e o módulo :mod:`collections`.

source: When the standard library provides a primitive for doing something, it is likely (although not guaranteed) to be faster than any alternative you may come up with. This is doubly true for primitives written in C, such as builtins and some extension types. For example, be sure to use either the :meth:`list.sort` built-in method or the related :func:`sorted` function to do sorting (and see the :ref:`sortinghowto` for examples of moderately advanced usage).
pt_br: Quando a biblioteca padrão fornecer um tipo primitivo para fazer algo, é provável (embora não garantido) que isso seja mais rápido do que qualquer alternativa que possa surgir. Isso geralmente é verdade para os tipos primitivos escritos em C, como os embutidos e alguns tipos de extensão. Por exemplo, certifique-se de usar o método embutido :meth:`list.sort` ou a função relacionada :func:`sorted` para fazer a ordenação (e veja :ref:`sortinghowto` para exemplos de uso moderadamente avançado).
