Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: The rounding library responsible for this improvement works on Windows and on Unix platforms using the gcc, icc, or suncc compilers. There may be a small number of platforms where correct operation of this code cannot be guaranteed, so the code is not used on such systems. You can find out which code is being used by checking :data:`sys.float_repr_style`, which will be ``short`` if the new code is in use and ``legacy`` if it isn't.
pt_br: A biblioteca de arredondamento responsável por essa melhoria funciona no Windows e em plataformas Unix usando os compiladores gcc, icc ou suncc. Pode haver um pequeno número de plataformas onde a operação correta deste código não pode ser garantida, então o código não é usado em tais sistemas. Você pode descobrir qual código está sendo usado verificando :data:`sys.float_repr_style`, que será ``short`` se o novo código estiver em uso e ``legacy`` se não estiver.

source: Implemented by Eric Smith and Mark Dickinson, using David Gay's :file:`dtoa.c` library; :issue:`7117`.
pt_br: Implementada por Eric Smith and Mark Dickinson, usando a biblioteca :file:`dtoa.c` de David Gay; :issue:`7117`.

source: Conversions from long integers and regular integers to floating point now round differently, returning the floating-point number closest to the number. This doesn't matter for small integers that can be converted exactly, but for large numbers that will unavoidably lose precision, Python 2.7 now approximates more closely. For example, Python 2.6 computed the following::
pt_br: As conversões de inteiros longos e inteiros regulares para ponto flutuante agora arredondam de maneira diferente, retornando o número de ponto flutuante mais próximo ao número. Isso não importa para pequenos inteiros que podem ser convertidos exatamente, mas para grandes números que inevitavelmente perderão a precisão, o Python 2.7 agora se aproxima mais. Por exemplo, o Python 2.6 computou o seguinte::

source: Python 2.7's floating-point result is larger, but much closer to the true value::
pt_br: O resultado de ponto flutuante do Python 2.7 é maior, mas muito mais próximo do valor verdadeiro::

source: (Implemented by Mark Dickinson; :issue:`3166`.)
pt_br: (Implementada por Mark Dickinson; :issue:`3166`.)

source: Integer division is also more accurate in its rounding behaviours. (Also implemented by Mark Dickinson; :issue:`1811`.)
pt_br: A divisão inteira também é mais precisa em seus comportamentos de arredondamento. (Também implementada por Mark Dickinson; :issue:`1811`.)

source: Implicit coercion for complex numbers has been removed; the interpreter will no longer ever attempt to call a :meth:`!__coerce__` method on complex objects. (Removed by Meador Inge and Mark Dickinson; :issue:`5211`.)
pt_br: A coerção implícita para números complexos foi removida; o interpretador nunca mais tentará chamar um método :meth:`!__coerce__` em objetos complexos. (Removido por Meador Inge e Mark Dickinson; :issue:`5211`.)

source: The :meth:`str.format` method now supports automatic numbering of the replacement fields. This makes using :meth:`str.format` more closely resemble using ``%s`` formatting::
pt_br: O método :meth:`str.format` agora tem suporte à numeração automática dos campos de substituição. Isso torna o uso de :meth:`str.format` mais parecido com o uso da formatação ``%s``::

source: The auto-numbering takes the fields from left to right, so the first ``{...}`` specifier will use the first argument to :meth:`str.format`, the next specifier will use the next argument, and so on. You can't mix auto-numbering and explicit numbering -- either number all of your specifier fields or none of them -- but you can mix auto-numbering and named fields, as in the second example above. (Contributed by Eric Smith; :issue:`5237`.)
pt_br: A numeração automática leva os campos da esquerda para a direita, então o primeiro especificador ``{...}`` usará o primeiro argumento para :meth:`str.format`, o próximo especificador usará o próximo argumento e breve. Você não pode misturar a numeração automática e a numeração explícita -- numerar todos os seus campos especificadores ou nenhum deles -- mas você pode misturar a numeração automática e os campos nomeados, como no segundo exemplo acima. (Contribuição de Eric Smith; :issue:`5237`.)

source: Complex numbers now correctly support usage with :func:`format`, and default to being right-aligned. Specifying a precision or comma-separation applies to both the real and imaginary parts of the number, but a specified field width and alignment is applied to the whole of the resulting ``1.5+3j`` output. (Contributed by Eric Smith; :issue:`1588` and :issue:`7988`.)
pt_br: Números complexos agora suportam corretamente o uso com :func:`format`, e o padrão é alinhamento à direita. A especificação de uma precisão ou separação por vírgula aplica-se às partes reais e imaginárias do número, mas uma largura de campo e alinhamento especificados são aplicados a toda a saída ``1.5+3j`` resultante. (Contribuição de Eric Smith; :issue:`1588` e :issue:`7988`.)

source: The 'F' format code now always formats its output using uppercase characters, so it will now produce 'INF' and 'NAN'. (Contributed by Eric Smith; :issue:`3382`.)
pt_br: O código de formato 'F' agora sempre formata sua saída usando caracteres maiúsculos, então agora produzirá 'INF' e 'NAN'. (Contribuição de Eric Smith; :issue:`3382`.)

source: A low-level change: the :meth:`object.__format__` method now triggers a :exc:`PendingDeprecationWarning` if it's passed a format string, because the :meth:`!__format__` method for :class:`object` converts the object to a string representation and formats that. Previously the method silently applied the format string to the string representation, but that could hide mistakes in Python code. If you're supplying formatting information such as an alignment or precision, presumably you're expecting the formatting to be applied in some object-specific way. (Fixed by Eric Smith; :issue:`7994`.)
pt_br: Uma alteração de baixo nível: o método :meth:`object.__format__` agora aciona um :exc:`PendingDeprecationWarning` se for passado uma string de formato, porque o método :meth:`!__format__` para :class:`object` converte o objeto para uma representação de string e formata isso. Anteriormente, o método aplicava silenciosamente a string de formato à representação da string, mas isso poderia ocultar erros no código Python. Se você estiver fornecendo informações de formatação, como alinhamento ou precisão, presumivelmente espera que a formatação seja aplicada de alguma maneira específica do objeto. (Correção de Eric Smith; :issue:`7994`.)

source: The :func:`int` and :func:`!long` types gained a ``bit_length`` method that returns the number of bits necessary to represent its argument in binary::
pt_br: Os tipos :func:`int` e :func:`!long` ganharam um método ``bit_length`` que retorna o número de bits necessários para representar seu argumento em binário::

source: (Contributed by Fredrik Johansson and Victor Stinner; :issue:`3439`.)
pt_br: (Contribuição de Fredrik Johansson e Victor Stinner; :issue:`3439`.)

source: The :keyword:`import` statement will no longer try an absolute import if a relative import (e.g. ``from .os import sep``) fails. This fixes a bug, but could possibly break certain :keyword:`!import` statements that were only working by accident. (Fixed by Meador Inge; :issue:`7902`.)
pt_br: A instrução :keyword:`import` não tentará mais uma importação absoluta se uma importação relativa (por exemplo, ``from .os import sep``) falhar. Isso corrige um bug, mas pode possivelmente quebrar certas instruções :keyword:`!import` que estavam funcionando apenas por acidente. (Correção de Meador Inge; :issue:`7902`.)

source: It's now possible for a subclass of the built-in :class:`!unicode` type to override the :meth:`!__unicode__` method. (Implemented by Victor Stinner; :issue:`1583863`.)
pt_br: Agora é possível para uma subclasse do tipo embutido :class:`!unicode` substituir o método :meth:`!__unicode__`. (Implementado por Victor Stinner; :issue:`1583863`.)

source: The :class:`bytearray` type's :meth:`~bytearray.translate` method now accepts ``None`` as its first argument. (Fixed by Georg Brandl; :issue:`4759`.)
pt_br: O método :meth:`~bytearray.translate` do tipo :class:`bytearray` agora aceita ``None`` como seu primeiro argumento. (Correção de Georg Brandl; :issue:`4759`.)

source: When using :deco:`classmethod` and :deco:`staticmethod` to wrap methods as class or static methods, the wrapper object now exposes the wrapped function as their :attr:`~method.__func__` attribute. (Contributed by Amaury Forgeot d'Arc, after a suggestion by George Sakkis; :issue:`5982`.)
pt_br: Ao usar :deco:`classmethod` e :deco:`staticmethod` para agrupar métodos como classe ou métodos estáticos, o objeto envólucro agora expõe a função agrupada como seu atributo :attr:`~method.__func__`. (Contribuição de Amaury Forgeot d'Arc, após sugestão de George Sakkis; :issue:`5982`.)

source: When a restricted set of attributes were set using ``__slots__``, deleting an unset attribute would not raise :exc:`AttributeError` as you would expect. Fixed by Benjamin Peterson; :issue:`7604`.)
pt_br: Quando um conjunto restrito de atributos foi definido usando ``__slots__``, excluir um atributo não definido não levantaria :exc:`AttributeError` como seria de esperar. Correção de Benjamin Peterson; :issue:`7604`.)

source: Two new encodings are now supported: "cp720", used primarily for Arabic text; and "cp858", a variant of CP 850 that adds the euro symbol. (CP720 contributed by Alexander Belchenko and Amaury Forgeot d'Arc in :issue:`1616979`; CP858 contributed by Tim Hatch in :issue:`8016`.)
pt_br: Duas novas codificações agora são suportadas: "cp720", usado principalmente para texto em árabe; e "cp858", uma variante do CP 850 que adiciona o símbolo do euro. (CP720 foi contribuição de Alexander Belchenko e Amaury Forgeot d'Arc em :issue:`1616979`; CP858 foi contribuição de Tim Hatch em :issue:`8016`.)

source: The :class:`!file` object will now set the :attr:`!filename` attribute on the :exc:`IOError` exception when trying to open a directory on POSIX platforms (noted by Jan Kaliszewski; :issue:`4764`), and now explicitly checks for and forbids writing to read-only file objects instead of trusting the C library to catch and report the error (fixed by Stefan Krah; :issue:`5677`).
pt_br: O objeto :class:`!file` agora definirá o atributo :attr:`!filename` na exceção :exc:`IOError` ao tentar abrir um diretório em plataformas POSIX (observado por Jan Kaliszewski; :issue:`4764`) , e agora verifica explicitamente e proíbe a gravação em objetos arquivo somente leitura em vez de confiar na biblioteca C para detectar e relatar o erro (correção de Stefan Krah; :issue:`5677`).

source: The Python tokenizer now translates line endings itself, so the :func:`compile` built-in function now accepts code using any line-ending convention. Additionally, it no longer requires that the code end in a newline.
pt_br: O tokenizador do Python agora traduz as próprias terminações de linha, então a função embutida :func:`compile` agora aceita código usando qualquer convenção de terminação de linha. Além disso, não requer mais que o código termine em uma nova linha.

source: Extra parentheses in function definitions are illegal in Python 3.x, meaning that you get a syntax error from ``def f((x)): pass``. In Python3-warning mode, Python 2.7 will now warn about this odd usage. (Noted by James Lingard; :issue:`7362`.)
pt_br: Parênteses extras em definições de função são ilegais no Python 3.x, o que significa que você obtém um erro de sintaxe de ``def f((x)): pass``. No modo de aviso do Python3, o Python 2.7 agora avisará sobre esse uso estranho. (Notado por James Lingard; :issue:`7362`.)

source: It's now possible to create weak references to old-style class objects. New-style classes were always weak-referenceable. (Fixed by Antoine Pitrou; :issue:`8268`.)
pt_br: Agora é possível criar referências fracas para objetos de classe de estilo antigo. As classes de novo estilo sempre tiveram referências fracas. (Correção de Antoine Pitrou; :issue:`8268`.)

source: When a module object is garbage-collected, the module's dictionary is now only cleared if no one else is holding a reference to the dictionary (:issue:`7140`).
pt_br: Quando um objeto de módulo é coletado como lixo, o dicionário do módulo agora só é limpo se ninguém mais estiver mantendo uma referência ao dicionário (:issue:`7140`).

source: Interpreter Changes
pt_br: Alterações no interpretador

source: A new environment variable, :envvar:`PYTHONWARNINGS`, allows controlling warnings. It should be set to a string containing warning settings, equivalent to those used with the :option:`-W` switch, separated by commas. (Contributed by Brian Curtin; :issue:`7301`.)
pt_br: Uma nova variável de ambiente, :envvar:`PYTHONWARNINGS`, permite controlar os avisos. Deve ser definido como uma string contendo configurações de aviso, equivalentes àquelas usadas com a opção :option:`-W`, separadas por vírgulas. (Contribuição de Brian Curtin; :issue:`7301`.)

source: For example, the following setting will print warnings every time they occur, but turn warnings from the :mod:`Cookie <http.cookies>` module into an error. (The exact syntax for setting an environment variable varies across operating systems and shells.)
pt_br: Por exemplo, a configuração a seguir imprimirá avisos toda vez que ocorrerem, mas transformará os avisos do módulo :mod:`Cookie <http.cookies>` em um erro. (A sintaxe exata para definir uma variável de ambiente varia entre sistemas operacionais e shells.)

source: Optimizations
pt_br: Otimizações

source: Several performance enhancements have been added:
pt_br: Vários aprimoramentos de desempenho foram adicionados:

source: A new opcode was added to perform the initial setup for :keyword:`with` statements, looking up the :meth:`~object.__enter__` and :meth:`~object.__exit__` methods. (Contributed by Benjamin Peterson.)
pt_br: Um novo opcode foi adicionado para executar a configuração inicial das instruções :keyword:`with`, procurando os métodos :meth:`~object.__enter__` e :meth:`~object.__exit__`. (Contribuição de Benjamin Peterson.)

source: The garbage collector now performs better for one common usage pattern: when many objects are being allocated without deallocating any of them. This would previously take quadratic time for garbage collection, but now the number of full garbage collections is reduced as the number of objects on the heap grows. The new logic only performs a full garbage collection pass when the middle generation has been collected 10 times and when the number of survivor objects from the middle generation exceeds 10% of the number of objects in the oldest generation. (Suggested by Martin von Löwis and implemented by Antoine Pitrou; :issue:`4074`.)
pt_br: O coletor de lixo agora funciona melhor para um padrão de uso comum: quando muitos objetos estão sendo alocados sem desalocar nenhum deles. Anteriormente, isso levaria um tempo quadrático para coleta de lixo, mas agora o número de coletas de lixo completas é reduzido à medida que o número de objetos no heap aumenta. A nova lógica só executa uma passagem completa de coleta de lixo quando a geração intermediária tiver sido coletada 10 vezes e quando o número de objetos sobreviventes da geração intermediária exceder 10% do número de objetos da geração mais antiga. (Sugerido por Martin von Löwis e implementado por Antoine Pitrou; :issue:`4074`.)

source: The garbage collector tries to avoid tracking simple containers which can't be part of a cycle. In Python 2.7, this is now true for tuples and dicts containing atomic types (such as ints, strings, etc.). Transitively, a dict containing tuples of atomic types won't be tracked either. This helps reduce the cost of each garbage collection by decreasing the number of objects to be considered and traversed by the collector. (Contributed by Antoine Pitrou; :issue:`4688`.)
pt_br: O coletor de lixo tenta evitar o rastreamento de contêineres simples que não podem fazer parte de um ciclo. No Python 2.7, isso agora é verdade para tuplas e dicts contendo tipos atômicos (como ints, strings, etc.). Transitivamente, um dict contendo tuplas de tipos atômicos também não será rastreado. Isso ajuda a reduzir o custo de cada coleta de lixo diminuindo o número de objetos a serem considerados e percorridos pelo coletor. (Contribuição de Antoine Pitrou; :issue:`4688`.)

source: Long integers are now stored internally either in base ``2**15`` or in base ``2**30``, the base being determined at build time. Previously, they were always stored in base ``2**15``. Using base ``2**30`` gives significant performance improvements on 64-bit machines, but benchmark results on 32-bit machines have been mixed. Therefore, the default is to use base ``2**30`` on 64-bit machines and base ``2**15`` on 32-bit machines; on Unix, there's a new configure option :option:`!--enable-big-digits` that can be used to override this default.
pt_br: Inteiros longos agora são armazenados internamente na base ``2**15`` ou na base ``2**30``, sendo a base determinada no momento da compilação. Anteriormente, eles eram sempre armazenados na base ``2**15``. O uso de base ``2**30`` oferece melhorias significativas de desempenho em máquinas de 64 bits, mas os resultados de benchmark em máquinas de 32 bits foram mistos. Portanto, o padrão é usar base ``2**30`` em máquinas de 64 bits e base ``2**15`` em máquinas de 32 bits; no Unix, há uma nova opção de configuração :option:`!--enable-big-digits` que pode ser usada para substituir esse padrão.

source: Apart from the performance improvements this change should be invisible to end users, with one exception: for testing and debugging purposes there's a new structseq :data:`!sys.long_info` that provides information about the internal format, giving the number of bits per digit and the size in bytes of the C type used to store each digit::
pt_br: Além das melhorias de desempenho, essa alteração deve ser invisível para os usuários finais, com uma exceção: para fins de teste e depuração, há um novo structseq :data:`!sys.long_info` que fornece informações sobre o formato interno, fornecendo o número de bits por dígito e o tamanho em bytes do tipo C usado para armazenar cada dígito::

source: (Contributed by Mark Dickinson; :issue:`4258`.)
pt_br: (Contribuição de Mark Dickinson; :issue:`4258`.)

source: Another set of changes made long objects a few bytes smaller: 2 bytes smaller on 32-bit systems and 6 bytes on 64-bit. (Contributed by Mark Dickinson; :issue:`5260`.)
pt_br: Outro conjunto de alterações tornou os objetos longos alguns bytes menores: 2 bytes menores em sistemas de 32 bits e 6 bytes em sistemas de 64 bits. (Contribuição de Mark Dickinson; :issue:`5260`.)

source: The division algorithm for long integers has been made faster by tightening the inner loop, doing shifts instead of multiplications, and fixing an unnecessary extra iteration. Various benchmarks show speedups of between 50% and 150% for long integer divisions and modulo operations. (Contributed by Mark Dickinson; :issue:`5512`.) Bitwise operations are also significantly faster (initial patch by Gregory Smith; :issue:`1087418`).
pt_br: O algoritmo de divisão para números inteiros longos ficou mais rápido apertando o laço interno, fazendo deslocamentos em vez de multiplicações e corrigindo uma iteração extra desnecessária. Vários benchmarks mostram acelerações entre 50% e 150% para divisões inteiras longas e operações de módulo. (Contribuição de Mark Dickinson; :issue:`5512`.) Operações bit a bit também são significativamente mais rápidas (patch inicial de Gregory Smith; :issue:`1087418`).

source: The implementation of ``%`` checks for the left-side operand being a Python string and special-cases it; this results in a 1--3% performance increase for applications that frequently use ``%`` with strings, such as templating libraries. (Implemented by Collin Winter; :issue:`5176`.)
pt_br: A implementação de ``%`` verifica se o operando do lado esquerdo é uma string Python e usa casos especiais; isso resulta em um aumento de desempenho de 1 a 3% para aplicativos que usam frequentemente ``%`` com strings, como templates em bibliotecas. (Implementação de Collin Winter; :issue:`5176`.)

source: List comprehensions with an ``if`` condition are compiled into faster bytecode. (Patch by Antoine Pitrou, back-ported to 2.7 by Jeffrey Yasskin; :issue:`4715`.)
pt_br: Compreensões de lista com uma condição ``if`` são compiladas em bytecode mais rápido. (Patch de Antoine Pitrou, retroportado para 2.7 por Jeffrey Yasskin; :issue:`4715`.)

source: Converting an integer or long integer to a decimal string was made faster by special-casing base 10 instead of using a generalized conversion function that supports arbitrary bases. (Patch by Gawain Bolton; :issue:`6713`.)
pt_br: A conversão de um inteiro ou inteiro longo em uma string decimal ficou mais rápida com o uso de maiúsculas e minúsculas especiais na base 10, em vez de usar uma função de conversão generalizada que oferece suporte a bases arbitrárias. (Patch por Gawain Bolton; :issue:`6713`.)

source: The :meth:`!split`, :meth:`!replace`, :meth:`!rindex`, :meth:`!rpartition`, and :meth:`!rsplit` methods of string-like types (strings, Unicode strings, and :class:`bytearray` objects) now use a fast reverse-search algorithm instead of a character-by-character scan. This is sometimes faster by a factor of 10. (Added by Florent Xicluna; :issue:`7462` and :issue:`7622`.)
pt_br: Os métodos :meth:`!split`, :meth:`!replace`, :meth:`!rindex`, :meth:`!rpartition` e :meth:`!rsplit` de tipos semelhantes a strings (strings, Strings Unicode e objetos :class:`bytearray`) agora usam um algoritmo de pesquisa reversa rápida em vez de uma varredura caractere por caractere. Às vezes, isso é mais rápido por um fator de 10. (Adicionado por Florent Xicluna; :issue:`7462` e :issue:`7622`.)

source: The :mod:`pickle` and :mod:`!cPickle` modules now automatically intern the strings used for attribute names, reducing memory usage of the objects resulting from unpickling. (Contributed by Jake McGuire; :issue:`5084`.)
pt_br: Os módulos :mod:`pickle` e :mod:`!cPickle` agora internalizam automaticamente as strings usadas para nomes de atributos, reduzindo o uso de memória dos objetos resultantes da desserialização com pickle. (Contribuição de Jake McGuire; :issue:`5084`.)

source: The :mod:`!cPickle` module now special-cases dictionaries, nearly halving the time required to pickle them. (Contributed by Collin Winter; :issue:`5670`.)
pt_br: O módulo :mod:`!cPickle` agora usa dicionários de casos especiais, reduzindo quase pela metade o tempo necessário para serializá-los com pickle. (Contribuição de Collin Winter; :issue:`5670`.)

source: New and Improved Modules
pt_br: Módulos Novos ou Aprimorados

source: As in every release, Python's standard library received a number of enhancements and bug fixes. Here's a partial list of the most notable changes, sorted alphabetically by module name. Consult the :file:`Misc/NEWS` file in the source tree for a more complete list of changes, or look through the Subversion logs for all the details.
pt_br: Como em todas os lançamentos, a biblioteca padrão do Python recebeu diversas melhorias e correções de bugs. Aqui está uma lista parcial das mudanças mais notáveis, classificadas em ordem alfabética por nome do módulo. Consulte o arquivo :file:`Misc/NEWS` na árvore de código-fonte para uma lista mais completa de alterações, ou procure nos logs do Subversion para todos os detalhes.
