Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: This mechanism is not adaptable at all; commas are always used as the separator and the grouping is always into three-digit groups. The comma-formatting mechanism isn't as general as the :mod:`locale` module, but it's easier to use.
pt_br: Este mecanismo não é adaptável de forma alguma; vírgulas são sempre usadas como separadores e o agrupamento é sempre em grupos de três dígitos. O mecanismo de formatação de vírgula não é tão geral quanto o módulo :mod:`locale`, mas é mais fácil de usar.

source: :pep:`378` - Format Specifier for Thousands Separator
pt_br: :pep:`378` - Especificador de formato para separador de milhares

source: PEP written by Raymond Hettinger; implemented by Eric Smith.
pt_br: PEP escrita por Raymond Hettinger; implementada por Eric Smith.

source: PEP 389: The argparse Module for Parsing Command Lines
pt_br: PEP 389: O módulo argparse para analisar linhas de comando

source: The :mod:`argparse` module for parsing command-line arguments was added as a more powerful replacement for the :mod:`optparse` module.
pt_br: O módulo :mod:`argparse` para analisar argumentos de linha de comando foi adicionado como um substituto mais poderoso para o módulo :mod:`optparse`.

source: This means Python now supports three different modules for parsing command-line arguments: :mod:`getopt`, :mod:`optparse`, and :mod:`argparse`. The :mod:`getopt` module closely resembles the C library's :c:func:`!getopt` function, so it remains useful if you're writing a Python prototype that will eventually be rewritten in C. :mod:`optparse` becomes redundant, but there are no plans to remove it because there are many scripts still using it, and there's no automated way to update these scripts. (Making the :mod:`argparse` API consistent with :mod:`optparse`'s interface was discussed but rejected as too messy and difficult.)
pt_br: Isso significa que Python agora oferece suporte a três módulos diferentes para analisar argumentos de linha de comando: :mod:`getopt`, :mod:`optparse` e :mod:`argparse`. O módulo :mod:`getopt` se assemelha muito à função :c:func:`!getopt` da biblioteca C, portanto continua útil se você estiver escrevendo um protótipo Python que eventualmente será reescrito em C. :mod:`optparse` torna-se redundante, mas não há planos para removê-lo porque muitos scripts ainda o utilizam e não há uma maneira automatizada de atualizar esses scripts. (Tornar a API :mod:`argparse` consistente com a interface de :mod:`optparse` foi discutido, mas rejeitado por ser muito confuso e difícil.)

source: In short, if you're writing a new script and don't need to worry about compatibility with earlier versions of Python, use :mod:`argparse` instead of :mod:`optparse`.
pt_br: Resumindo, se você está escrevendo um novo script e não precisa se preocupar com a compatibilidade com versões anteriores do Python, use :mod:`argparse` ao invés de :mod:`optparse`.

source: Here's an example::
pt_br: Aqui está um exemplo::

source: import argparse parser = argparse.ArgumentParser(description='Command-line example.') # Add optional switches parser.add_argument('-v', action='store_true', dest='is_verbose', help='produce verbose output') parser.add_argument('-o', action='store', dest='output', metavar='FILE', help='direct output to FILE instead of stdout') parser.add_argument('-C', action='store', type=int, dest='context', metavar='NUM', default=0, help='display NUM lines of added context') # Allow any number of additional arguments. parser.add_argument(nargs='*', action='store', dest='inputs', help='input filenames (default is stdin)') args = parser.parse_args() print args.__dict__
pt_br: import argparse parser = argparse.ArgumentParser(description='Command-line example.') # Adiciona alterações opcionais parser.add_argument('-v', action='store_true', dest='is_verbose', help='produce verbose output') parser.add_argument('-o', action='store', dest='output', metavar='FILE', help='direct output to FILE instead of stdout') parser.add_argument('-C', action='store', type=int, dest='context', metavar='NUM', default=0, help='display NUM lines of added context') # Permite qualquer número de argumentos adicionais. parser.add_argument(nargs='*', action='store', dest='inputs', help='input filenames (default is stdin)') args = parser.parse_args() print args.__dict__

source: Unless you override it, :option:`!-h` and :option:`!--help` switches are automatically added, and produce neatly formatted output::
pt_br: A menos que você o substitua, as opções :option:`!-h` e :option:`!--help` são adicionadas automaticamente e produzem uma saída formatada de maneira organizada::

source: As with :mod:`optparse`, the command-line switches and arguments are returned as an object with attributes named by the *dest* parameters::
pt_br: Como em :mod:`optparse`, as opções e argumentos da linha de comando são retornados como um objeto com atributos nomeados pelos parâmetros *dest*::

source: :mod:`argparse` has much fancier validation than :mod:`optparse`; you can specify an exact number of arguments as an integer, 0 or more arguments by passing ``'*'``, 1 or more by passing ``'+'``, or an optional argument with ``'?'``. A top-level parser can contain sub-parsers to define subcommands that have different sets of switches, as in ``svn commit``, ``svn checkout``, etc. You can specify an argument's type as :class:`~argparse.FileType`, which will automatically open files for you and understands that ``'-'`` means standard input or output.
pt_br: :mod:`argparse` tem uma validação muito mais sofisticada que :mod:`optparse`; você pode especificar um número exato de argumentos como um inteiro, 0 ou mais argumentos passando ``'*'``, 1 ou mais passando ``'+'``, ou um argumento opcional com ``'?'``. Um analisador de nível superior pode conter sub-analisadores para definir subcomandos que possuem diferentes conjuntos de opções, como em ``svn commit``, ``svn checkout``, etc. Você pode especificar o tipo de um argumento como :class:`~argparse.FileType`, que abrirá arquivos automaticamente para você e entende que ``'-'`` significa entrada ou saída padrão.

source: :mod:`argparse` documentation
pt_br: Documentação do :mod:`argparse`

source: The documentation page of the argparse module.
pt_br: A página de documentação do módulo argparse.

source: Part of the Python documentation, describing how to convert code that uses :mod:`optparse`.
pt_br: Parte da documentação do Python, descrevendo como converter o código que usa :mod:`optparse`.

source: :pep:`389` - argparse - New Command Line Parsing Module
pt_br: :pep:`389` - argparse - Novo módulo de análise sintática de linha de comando

source: PEP written and implemented by Steven Bethard.
pt_br: PEP escrita e implementada por Steven Bethard.

source: PEP 391: Dictionary-Based Configuration For Logging
pt_br: PEP 391: Configuração baseada em dicionário para logging

source: The :mod:`logging` module is very flexible; applications can define a tree of logging subsystems, and each logger in this tree can filter out certain messages, format them differently, and direct messages to a varying number of handlers.
pt_br: O módulo :mod:`logging` é muito flexível; os aplicativos podem definir uma árvore de subsistemas de log e cada logger nessa árvore pode filtrar determinadas mensagens, formatá-las de maneira diferente e direcionar mensagens para um número variável de manipuladores.

source: All this flexibility can require a lot of configuration. You can write Python statements to create objects and set their properties, but a complex set-up requires verbose but boring code. :mod:`logging` also supports a :func:`~logging.config.fileConfig` function that parses a file, but the file format doesn't support configuring filters, and it's messier to generate programmatically.
pt_br: Toda essa flexibilidade pode exigir muita configuração. Você pode escrever instruções Python para criar objetos e definir suas propriedades, mas uma configuração complexa requer um código detalhado, mas enfadonho. :mod:`logging` também suporta uma função :func:`~logging.config.fileConfig` que analisa um arquivo, mas o formato do arquivo não oferece suporte à configuração de filtros, e é mais confuso gerar programaticamente.

source: Python 2.7 adds a :func:`~logging.config.dictConfig` function that uses a dictionary to configure logging. There are many ways to produce a dictionary from different sources: construct one with code; parse a file containing JSON; or use a YAML parsing library if one is installed. For more information see :ref:`logging-config-api`.
pt_br: O Python 2.7 adiciona uma função :func:`~logging.config.dictConfig` que usa um dicionário para configurar o log. Existem muitas maneiras de produzir um dicionário a partir de diferentes fontes: construir um com código; analisar um arquivo contendo JSON; ou use uma biblioteca de análise de YAML se houver uma instalada. Para mais informações veja :ref:`logging-config-api`.

source: The following example configures two loggers, the root logger and a logger named "network". Messages sent to the root logger will be sent to the system log using the syslog protocol, and messages to the "network" logger will be written to a :file:`network.log` file that will be rotated once the log reaches 1MB.
pt_br: O exemplo a seguir configura dois loggers, o logger raiz e um logger denominado "network". As mensagens enviadas para o registrador raiz serão enviadas para o log do sistema usando o protocolo syslog, e as mensagens para o logger "network" serão gravadas em um arquivo :file:`network.log` que será rotacionado assim que o log atingir 1 MB.

source: import logging import logging.config configdict = { 'version': 1, # Configuration schema in use; must be 1 for now 'formatters': { 'standard': { 'format': ('%(asctime)s %(name)-15s ' '%(levelname)-8s %(message)s')}}, 'handlers': {'netlog': {'backupCount': 10, 'class': 'logging.handlers.RotatingFileHandler', 'filename': '/logs/network.log', 'formatter': 'standard', 'level': 'INFO', 'maxBytes': 1000000}, 'syslog': {'class': 'logging.handlers.SysLogHandler', 'formatter': 'standard', 'level': 'ERROR'}}, # Specify all the subordinate loggers 'loggers': { 'network': { 'handlers': ['netlog'] } }, # Specify properties of the root logger 'root': { 'handlers': ['syslog'] }, } # Set up configuration logging.config.dictConfig(configdict) # As an example, log two error messages logger = logging.getLogger('/') logger.error('Database not found') netlogger = logging.getLogger('network') netlogger.error('Connection failed')
pt_br: import logging import logging.config configdict = { 'version': 1, # Configuration schema in use; must be 1 for now 'formatters': { 'standard': { 'format': ('%(asctime)s %(name)-15s ' '%(levelname)-8s %(message)s')}}, 'handlers': {'netlog': {'backupCount': 10, 'class': 'logging.handlers.RotatingFileHandler', 'filename': '/logs/network.log', 'formatter': 'standard', 'level': 'INFO', 'maxBytes': 1000000}, 'syslog': {'class': 'logging.handlers.SysLogHandler', 'formatter': 'standard', 'level': 'ERROR'}}, # Especifica todos os loggers subordinados 'loggers': { 'network': { 'handlers': ['netlog'] } }, # Especifica propriedades do logger raiz 'root': { 'handlers': ['syslog'] }, } # Prepara as configurações logging.config.dictConfig(configdict) # Como um exemplo, registra duas mensagens de erro logger = logging.getLogger('/') logger.error('Database not found') netlogger = logging.getLogger('network') netlogger.error('Connection failed')

source: Three smaller enhancements to the :mod:`logging` module, all implemented by Vinay Sajip, are:
pt_br: Três melhorias menores no módulo :mod:`logging`, todas implementadas por Vinay Sajip, são:

source: The :class:`~logging.handlers.SysLogHandler` class now supports syslogging over TCP. The constructor has a *socktype* parameter giving the type of socket to use, either :const:`socket.SOCK_DGRAM` for UDP or :const:`socket.SOCK_STREAM` for TCP. The default protocol remains UDP.
pt_br: A classe :class:`~logging.handlers.SysLogHandler` agora tem suporte a syslogging sobre TCP. O construtor tem um parâmetro *socktype* que fornece o tipo de soquete a ser usado, :const:`socket.SOCK_DGRAM` para UDP ou :const:`socket.SOCK_STREAM` para TCP. O protocolo padrão permanece UDP.

source: :class:`~logging.Logger` instances gained a :meth:`~logging.Logger.getChild` method that retrieves a descendant logger using a relative path. For example, once you retrieve a logger by doing ``log = getLogger('app')``, calling ``log.getChild('network.listen')`` is equivalent to ``getLogger('app.network.listen')``.
pt_br: As instâncias :class:`~logging.Logger` ganharam um método :meth:`~logging.Logger.getChild` que recupera um logger descendente usando um caminho relativo. Por exemplo, depois de recuperar um logger fazendo ``log = getLogger('app')``, chamar ``log.getChild('network.listen')`` é equivalente a ``getLogger('app.network.listen')``.

source: The :class:`~logging.LoggerAdapter` class gained an :meth:`~logging.Logger.isEnabledFor` method that takes a *level* and returns whether the underlying logger would process a message of that level of importance.
pt_br: A classe :class:`~logging.LoggerAdapter` ganhou um método :meth:`~logging.Logger.isEnabledFor` que pega um *level* e retorna se o logger subjacente processaria uma mensagem desse nível de importância.

source: :pep:`391` - Dictionary-Based Configuration For Logging
pt_br: :pep:`391` - Configuração baseada em dicionário para logging

source: PEP written and implemented by Vinay Sajip.
pt_br: PEP escrita e implementada por Vinay Sajip.

source: PEP 3106: Dictionary Views
pt_br: PEP 3106: Views de dicionário

source: The dictionary methods :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` are different in Python 3.x. They return an object called a :dfn:`view` instead of a fully materialized list.
pt_br: Os métodos de dicionário :meth:`~dict.keys`, :meth:`~dict.values` e :meth:`~dict.items` são diferentes no Python 3.x. Eles retornam um objeto chamado :dfn:`view` em vez de uma lista totalmente materializada.

source: It's not possible to change the return values of :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` in Python 2.7 because too much code would break. Instead the 3.x versions were added under the new names :meth:`!viewkeys`, :meth:`!viewvalues`, and :meth:`!viewitems`.
pt_br: Não é possível alterar os valores de retorno de :meth:`~dict.keys`, :meth:`~dict.values` e :meth:`~dict.items` no Python 2.7 porque muito código seria interrompido. Em vez disso, as versões 3.x foram adicionadas com os novos nomes :meth:`!viewkeys`, :meth:`!viewvalues` e :meth:`!viewitems`.

source: Views can be iterated over, but the key and item views also behave like sets. The ``&`` operator performs intersection, and ``|`` performs a union::
pt_br: As views podem ser iteradas, mas as exibições de chave e item também se comportam como conjuntos. O operador ``&`` realiza a interseção, e o ``|`` realiza uma união::

source: The view keeps track of the dictionary and its contents change as the dictionary is modified::
pt_br: A view acompanha o dicionário e seu conteúdo muda à medida que o dicionário é modificado::

source: However, note that you can't add or remove keys while you're iterating over the view::
pt_br: No entanto, observe que você não pode adicionar ou remover chaves enquanto estiver iterando na view::

source: You can use the view methods in Python 2.x code, and the 2to3 converter will change them to the standard :meth:`~dict.keys`, :meth:`~dict.values`, and :meth:`~dict.items` methods.
pt_br: Você pode usar os métodos de exibição no código Python 2.x, e o conversor 2to3 irá alterá-los para os métodos padrão :meth:`~dict.keys`, :meth:`~dict.values` e :meth:`~dict.items`.

source: :pep:`3106` - Revamping dict.keys(), .values() and .items()
pt_br: :pep:`3106` - Repaginação de dict.keys(), .values() e .items()

source: PEP written by Guido van Rossum. Backported to 2.7 by Alexandre Vassalotti; :issue:`1967`.
pt_br: PEP escrita por Guido van Rossum. Backported para 2.7 por Alexandre Vassalotti; :issue:`1967`.

source: PEP 3137: The memoryview Object
pt_br: PEP 3137: O objeto memoryview

source: The :class:`memoryview` object provides a view of another object's memory content that matches the :class:`bytes` type's interface.
pt_br: O objeto :class:`memoryview` fornece uma visão do conteúdo da memória de outro objeto que corresponde à interface do tipo :class:`bytes`.

source: >>> import string >>> m = memoryview(string.letters) >>> m <memory at 0x37f850> >>> len(m) # Returns length of underlying object 52 >>> m[0], m[25], m[26] # Indexing returns one byte ('a', 'z', 'A') >>> m2 = m[0:26] # Slicing returns another memoryview >>> m2 <memory at 0x37f080>
pt_br: >>> import string >>> m = memoryview(string.letters) >>> m <memory at 0x37f850> >>> len(m) # Retorna o comprimento de objeto subjacente 52 >>> m[0], m[25], m[26] # Indexação retorna um byte ('a', 'z', 'A') >>> m2 = m[0:26] # Fatiamento retorna outra memoryview >>> m2 <memory at 0x37f080>

source: The content of the view can be converted to a string of bytes or a list of integers:
pt_br: O conteúdo da viewq pode ser convertido em uma string de bytes ou uma lista de inteiros:

source: :class:`memoryview` objects allow modifying the underlying object if it's a mutable object.
pt_br: Objetos :class:`memoryview` permitem modificar o objeto subjacente se for um objeto mutável.

source: >>> m2[0] = 75 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: cannot modify read-only memory >>> b = bytearray(string.letters) # Creating a mutable object >>> b bytearray(b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ') >>> mb = memoryview(b) >>> mb[0] = '*' # Assign to view, changing the bytearray. >>> b[0:5] # The bytearray has been changed. bytearray(b'*bcde') >>>
pt_br: >>> m2[0] = 75 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: cannot modify read-only memory >>> b = bytearray(string.letters) # Criando um objeto mutável >>> b bytearray(b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ') >>> mb = memoryview(b) >>> mb[0] = '*' # Atribui para visão, alterando o bytearray. >>> b[0:5] # O bytearray foi alterado. bytearray(b'*bcde') >>>

source: :pep:`3137` - Immutable Bytes and Mutable Buffer
pt_br: :pep:`3137` - Bytes imutáveis e buffer mutável

source: PEP written by Guido van Rossum. Implemented by Travis Oliphant, Antoine Pitrou and others. Backported to 2.7 by Antoine Pitrou; :issue:`2396`.
pt_br: PEP escrita por Guido van Rossum. Implementada por Travis Oliphant, Antoine Pitrou e outros. Portado para 2.7 por Antoine Pitrou; :issue:`2396`.

source: Other Language Changes
pt_br: Outras mudanças na linguagem

source: Some smaller changes made to the core Python language are:
pt_br: Algumas das mudanças menores feitas no núcleo da linguagem Python são:

source: The syntax for set literals has been backported from Python 3.x. Curly brackets are used to surround the contents of the resulting mutable set; set literals are distinguished from dictionaries by not containing colons and values. ``{}`` continues to represent an empty dictionary; use ``set()`` for an empty set.
pt_br: A sintaxe para set literais foi portada do Python 3.x. Os colchetes são usados para cercar o conteúdo do conjunto mutável resultante; os literais definidos são diferenciados dos dicionários por não conterem caracteres de dois pontos e valores. ``{}`` continua a representar um dicionário vazio; use ``set()`` para um conjunto vazio.

source: >>> {1, 2, 3, 4, 5} set([1, 2, 3, 4, 5]) >>> set() # empty set set([]) >>> {} # empty dict {}
pt_br: >>> {1, 2, 3, 4, 5} set([1, 2, 3, 4, 5]) >>> set() # conjunto vazio set([]) >>> {} # dicionário vazio {}

source: Backported by Alexandre Vassalotti; :issue:`2335`.
pt_br: Portado por Alexandre Vassalotti; :issue:`2335`.

source: Dictionary and set comprehensions are another feature backported from 3.x, generalizing list/generator comprehensions to use the literal syntax for sets and dictionaries.
pt_br: As compreensões de dicionário e conjunto são outro recurso importado do 3.x, generalizando as compreensões de lista/gerador para usar a sintaxe literal para conjuntos e dicionários.

source: Backported by Alexandre Vassalotti; :issue:`2333`.
pt_br: Portado por Alexandre Vassalotti; :issue:`2333`.

source: The :keyword:`with` statement can now use multiple context managers in one statement. Context managers are processed from left to right and each one is treated as beginning a new :keyword:`!with` statement. This means that::
pt_br: A instrução :keyword:`with` agora pode usar vários gerenciadores de contexto em uma instrução. Os gerenciadores de contexto são processados da esquerda para a direita e cada um é tratado como o início de uma nova instrução :keyword:`!with`. Isso significa que::

source: with A() as a, B() as b: ... suite of statements ...
pt_br: with A() as a, B() as b: ... conjunto de instruções ...

source: is equivalent to::
pt_br: é equivalente a::

source: with A() as a: with B() as b: ... suite of statements ...
pt_br: with A() as a: with B() as b: ... conjunto de instruções ...

source: The :func:`!contextlib.nested` function provides a very similar function, so it's no longer necessary and has been deprecated.
pt_br: A função :func:`!contextlib.nested` fornece uma função muito similar, então não é mais necessária e foi descontinuada.

source: (Proposed in https://codereview.appspot.com/53094; implemented by Georg Brandl.)
pt_br: (Proposta em https://codereview.appspot.com/53094; implementada por Georg Brandl.)

source: Conversions between floating-point numbers and strings are now correctly rounded on most platforms. These conversions occur in many different places: :func:`str` on floats and complex numbers; the :class:`float` and :class:`complex` constructors; numeric formatting; serializing and deserializing floats and complex numbers using the :mod:`marshal`, :mod:`pickle` and :mod:`json` modules; parsing of float and imaginary literals in Python code; and :class:`~decimal.Decimal`-to-float conversion.
pt_br: As conversões entre números de ponto flutuante, ou float. e strings agora são arredondadas corretamente na maioria das plataformas. Estas conversões ocorrem em muitos lugares diferentes: :func:`str` em floats e números complexos; os construtores :class:`float` e :class:`complex`; formatação numérica; serializar e desserializar floats e números complexos usando os módulos :mod:`marshal`, :mod:`pickle` e :mod:`json`; análise de float e literais imaginários no código Python; e a conversão :class:`~decimal.Decimal`-para-float.

source: Related to this, the :func:`repr` of a floating-point number *x* now returns a result based on the shortest decimal string that's guaranteed to round back to *x* under correct rounding (with round-half-to-even rounding mode). Previously it gave a string based on rounding x to 17 decimal digits.
pt_br: Relacionado a isso, o :func:`repr` de um número de ponto flutuante *x* agora retorna um resultado baseado na string decimal mais curta que é garantida para arredondar de volta para *x* sob o arredondamento correto (com o modo de arredondamento round-half-to-even). Anteriormente, fornecia uma string baseada no arredondamento x para 17 dígitos decimais.
