Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: The version of OpenSSL being used is now available as the module attributes :const:`ssl.OPENSSL_VERSION` (a string), :const:`ssl.OPENSSL_VERSION_INFO` (a 5-tuple), and :const:`ssl.OPENSSL_VERSION_NUMBER` (an integer). (Added by Antoine Pitrou; :issue:`8321`.)
pt_br: A versão do OpenSSL usada agora está disponível como os atributos do módulo :const:`ssl.OPENSSL_VERSION` (uma string), :const:`ssl.OPENSSL_VERSION_INFO` (uma tupla de 5) e :const:`ssl.OPENSSL_VERSION_NUMBER` (um número inteiro). (Adição de Antoine Pitrou; :issue:`8321`.)

source: The :mod:`struct` module will no longer silently ignore overflow errors when a value is too large for a particular integer format code (one of ``bBhHiIlLqQ``); it now always raises a :exc:`struct.error` exception. (Changed by Mark Dickinson; :issue:`1523`.) The :func:`~struct.pack` function will also attempt to use :meth:`~object.__index__` to convert and pack non-integers before trying the :meth:`~object.__int__` method or reporting an error. (Changed by Mark Dickinson; :issue:`8300`.)
pt_br: O módulo :mod:`struct` não irá mais ignorar silenciosamente erros de overflow quando um valor for muito grande para um código de formato inteiro específico (um de ``bBhHiIlLqQ``); agora sempre levanta uma exceção :exc:`struct.error`. (Alteração de Mark Dickinson; :issue:`1523`.) A função :func:`~struct.pack` também tentará usar :meth:`~object.__index__` para converter e empacotar números não inteiros antes de tentar o método :meth:`~object.__int__` ou relatar um erro. (Alteração de Mark Dickinson; :issue:`8300`.)

source: New function: the :mod:`subprocess` module's :func:`~subprocess.check_output` runs a command with a specified set of arguments and returns the command's output as a string when the command runs without error, or raises a :exc:`~subprocess.CalledProcessError` exception otherwise.
pt_br: Nova função: o :func:`~subprocess.check_output` do módulo :mod:`subprocess` executa um comando com um conjunto especificado de argumentos e retorna a saída do comando como uma string quando o comando é executado sem erros, ou levanta uma exceção :exc:`~subprocess.CalledProcessError` caso contrário.

source: (Contributed by Gregory P. Smith.)
pt_br: (Contribuição de Gregory P. Smith.)

source: The :mod:`subprocess` module will now retry its internal system calls on receiving an :const:`~errno.EINTR` signal. (Reported by several people; final patch by Gregory P. Smith in :issue:`1068268`.)
pt_br: O módulo :mod:`subprocess` agora tentará novamente suas chamadas internas do sistema ao receber um sinal :const:`~errno.EINTR`. (Relato por várias pessoas; patch final por Gregory P. Smith em :issue:`1068268`.)

source: New function: :func:`~symtable.Symbol.is_declared_global` in the :mod:`symtable` module returns true for variables that are explicitly declared to be global, false for ones that are implicitly global. (Contributed by Jeremy Hylton.)
pt_br: Nova função: :func:`~symtable.Symbol.is_declared_global` no módulo :mod:`symtable` retorna verdadeiro para variáveis que são explicitamente declaradas como globais, falso para aquelas que são implicitamente globais. (Contribuição de Jeremy Hylton.)

source: The :mod:`syslog` module will now use the value of ``sys.argv[0]`` as the identifier instead of the previous default value of ``'python'``. (Changed by Sean Reifschneider; :issue:`8451`.)
pt_br: O módulo :mod:`syslog` agora usará o valor de ``sys.argv[0]`` como identificador em vez do valor padrão anterior de ``'python'``. (Alteração de Sean Reifschneider; :issue:`8451`.)

source: The :data:`sys.version_info` value is now a named tuple, with attributes named :attr:`!major`, :attr:`!minor`, :attr:`!micro`, :attr:`!releaselevel`, and :attr:`!serial`. (Contributed by Ross Light; :issue:`4285`.)
pt_br: O valor :data:`sys.version_info` agora é uma tupla nomeada, com atributos chamados :attr:`!major`, :attr:`!minor`, :attr:`!micro`, :attr:`!releaselevel` e :attr:`!serial`. (Contribuição de Ross Light; :issue:`4285`.)

source: :func:`sys.getwindowsversion` also returns a named tuple, with attributes named :attr:`!major`, :attr:`!minor`, :attr:`!build`, :attr:`!platform`, :attr:`!service_pack`, :attr:`!service_pack_major`, :attr:`!service_pack_minor`, :attr:`!suite_mask`, and :attr:`!product_type`. (Contributed by Brian Curtin; :issue:`7766`.)
pt_br: :func:`sys.getwindowsversion` também retorna uma tupla nomeada, com atributos chamados :attr:`!major`, :attr:`!minor`, :attr:`!build`, :attr:`!platform`, :attr:`!service_pack`, :attr:`!service_pack_major`, :attr:`!service_pack_minor`, :attr:`!suite_mask` e :attr:`!product_type`. (Contribuição de Brian Curtin; :issue:`7766`.)

source: The :mod:`tarfile` module's default error handling has changed, to no longer suppress fatal errors. The default error level was previously 0, which meant that errors would only result in a message being written to the debug log, but because the debug log is not activated by default, these errors go unnoticed. The default error level is now 1, which raises an exception if there's an error. (Changed by Lars Gustäbel; :issue:`7357`.)
pt_br: O tratamento de erros padrão do módulo :mod:`tarfile` foi alterado, para não mais suprimir erros fatais. O nível de erro padrão era anteriormente 0, o que significava que os erros resultariam apenas na gravação de uma mensagem no log de depuração, mas como o log de depuração não está ativado por padrão, esses erros passam despercebidos. O nível de erro padrão agora é 1, o que levanta uma exceção se houver um erro. (Alteração de Lars Gustäbel; :issue:`7357`.)

source: :mod:`tarfile` now supports filtering the :class:`~tarfile.TarInfo` objects being added to a tar file. When you call :meth:`~tarfile.TarFile.add`, you may supply an optional *filter* argument that's a callable. The *filter* callable will be passed the :class:`~tarfile.TarInfo` for every file being added, and can modify and return it. If the callable returns ``None``, the file will be excluded from the resulting archive. This is more powerful than the existing *exclude* argument, which has therefore been deprecated. (Added by Lars Gustäbel; :issue:`6856`.) The :class:`~tarfile.TarFile` class also now supports the context management protocol. (Added by Lars Gustäbel; :issue:`7232`.)
pt_br: :mod:`tarfile` agora oferece suporte à filtragem de objetos :class:`~tarfile.TarInfo` sendo adicionados a um arquivo tar. Quando você chama :meth:`~tarfile.TarFile.add`, você pode fornecer um argumento *filter* opcional que é chamável. O chamável *filter* receberá o :class:`~tarfile.TarInfo` para cada arquivo sendo adicionado, e pode modificá-lo e retorná-lo. Se o chamável retornar ``None``, o arquivo será excluído do arquivo resultante. Isto é mais poderoso do que o argumento *exclude* existente, que foi, portanto, descontinuado. (Adição de Lars Gustäbel; :issue:`6856`.) A classe :class:`~tarfile.TarFile` agora também oferece suporte ao protocolo de gerenciamento de contexto. (Adição de Lars Gustäbel; :issue:`7232`.)

source: The :meth:`~threading.Event.wait` method of the :class:`threading.Event` class now returns the internal flag on exit. This means the method will usually return true because :meth:`~threading.Event.wait` is supposed to block until the internal flag becomes true. The return value will only be false if a timeout was provided and the operation timed out. (Contributed by Tim Lesher; :issue:`1674032`.)
pt_br: O método :meth:`~threading.Event.wait` da classe :class:`threading.Event` agora retorna o sinalizador interno na saída. Isso significa que o método geralmente retornará verdadeiro porque :meth:`~threading.Event.wait` deve ser bloqueado até que o sinalizador interno se torne verdadeiro. O valor de retorno só será falso se um tempo limite tiver sido fornecido e a operação tiver expirado. (Contribuição de Tim Lesher; :issue:`1674032`.)

source: The Unicode database provided by the :mod:`unicodedata` module is now used internally to determine which characters are numeric, whitespace, or represent line breaks. The database also includes information from the :file:`Unihan.txt` data file (patch by Anders Chrigström and Amaury Forgeot d'Arc; :issue:`1571184`) and has been updated to version 5.2.0 (updated by Florent Xicluna; :issue:`8024`).
pt_br: O banco de dados Unicode fornecido pelo módulo :mod:`unicodedata` agora é usado internamente para determinar quais caracteres são numéricos, espaços em branco ou representam quebras de linha. O banco de dados também inclui informações do arquivo de dados :file:`Unihan.txt` (patch de Anders Chrigström e Amaury Forgeot d'Arc; :issue:`1571184`) e foi atualizado para a versão 5.2.0 (atualização de Florent Xicluna; :issue:`8024`).

source: The :mod:`urlparse <urllib.parse>` module's :func:`~urllib.parse.urlsplit` now handles unknown URL schemes in a fashion compliant with :rfc:`3986`: if the URL is of the form ``"<something>://..."``, the text before the ``://`` is treated as the scheme, even if it's a made-up scheme that the module doesn't know about. This change may break code that worked around the old behaviour. For example, Python 2.6.4 or 2.5 will return the following:
pt_br: A função :func:`~urllib.parse.urlsplit` do módulo :mod:`urlparse <urllib.parse>` agora lida com esquemas de URL desconhecidos de uma forma compatível com :rfc:`3986`: se a URL estiver no formato ``"<alguma_coisa>://..."``, o texto antes de ``://`` é tratado como o esquema, mesmo que seja um esquema inventado que o módulo não conhece. Essa alteração pode quebrar o código que contornava o comportamento antigo. Por exemplo, Python 2.6.4 ou 2.5 retornará o seguinte:

source: Python 2.7 (and Python 2.6.5) will return:
pt_br: Python 2.7 (e Python 2.6.5) vai retornar:

source: (Python 2.7 actually produces slightly different output, since it returns a named tuple instead of a standard tuple.)
pt_br: (Na verdade, o Python 2.7 produz uma saída ligeiramente diferente, pois retorna uma tupla nomeada em vez de uma tupla padrão.)

source: The :mod:`urlparse <urllib.parse>` module also supports IPv6 literal addresses as defined by :rfc:`2732` (contributed by Senthil Kumaran; :issue:`2987`).
pt_br: O módulo :mod:`urlparse <urllib.parse>` também oferece suporte a endereços IPv6 literais conforme definido pelo :rfc:`2732` (contribuição de Senthil Kumaran; :issue:`2987`).

source: New class: the :class:`~weakref.WeakSet` class in the :mod:`weakref` module is a set that only holds weak references to its elements; elements will be removed once there are no references pointing to them. (Originally implemented in Python 3.x by Raymond Hettinger, and backported to 2.7 by Michael Foord.)
pt_br: Nova classe: a classe :class:`~weakref.WeakSet` no módulo :mod:`weakref` é um conjunto que contém apenas referências fracas aos seus elementos; os elementos serão removidos quando não houver referências apontando para eles. (Originalmente implementado em Python 3.x por Raymond Hettinger e portado para 2.7 por Michael Foord.)

source: The :mod:`xml.etree.ElementTree` library, no longer escapes ampersands and angle brackets when outputting an XML processing instruction (which looks like ``<?xml-stylesheet href="#style1"?>``) or comment (which looks like ``<!-- comment -->``). (Patch by Neil Muller; :issue:`2746`.)
pt_br: A biblioteca :mod:`xml.etree.ElementTree` não escapa mais caracteres de E comercial e de sinal de maior e de menor ao gerar uma instrução de processamento XML (que se parece com ``<?xml-stylesheet href="#style1"?>``) ou comentário (que se parece com ``<!-- comentário -->``). (Patch de Neil Muller; :issue:`2746`.)

source: The XML-RPC client and server, provided by the :mod:`xmlrpclib <xmlrpc.client>` and :mod:`SimpleXMLRPCServer <xmlrpc.server>` modules, have improved performance by supporting HTTP/1.1 keep-alive and by optionally using gzip encoding to compress the XML being exchanged. The gzip compression is controlled by the :attr:`!encode_threshold` attribute of :class:`~xmlrpc.server.SimpleXMLRPCRequestHandler`, which contains a size in bytes; responses larger than this will be compressed. (Contributed by Kristján Valur Jónsson; :issue:`6267`.)
pt_br: O cliente e servidor de XML-RPC, fornecidos pelos módulos :mod:`xmlrpclib <xmlrpc.client>` e :mod:`SimpleXMLRPCServer <xmlrpc.server>`, melhoraram o desempenho ao prover suporte a kep-alive do HTTP/1.1 e, opcionalmente, usando a codificação gzip para compactar o XML que está sendo trocado. A compactação gzip é controlada pelo atributo :attr:`!encode_threshold` de :class:`~xmlrpc.server.SimpleXMLRPCRequestHandler`, que contém um tamanho em bytes; respostas maiores que isso serão compactadas. (Contribuição de Kristján Valur Jónsson; :issue:`6267`.)

source: The :mod:`zipfile` module's :class:`~zipfile.ZipFile` now supports the context management protocol, so you can write ``with zipfile.ZipFile(...) as f:``. (Contributed by Brian Curtin; :issue:`5511`.)
pt_br: A classe :class:`~zipfile.ZipFile` do módulo :mod:`zipfile` agora oferece suporte ao protocolo de gerenciamento de contexto, então você pode escrever ``with zipfile.ZipFile(...) as f:``. (Contribuição de Brian Curtin; :issue:`5511`.)

source: :mod:`zipfile` now also supports archiving empty directories and extracts them correctly. (Fixed by Kuba Wieczorek; :issue:`4710`.) Reading files out of an archive is faster, and interleaving :meth:`read() <io.BufferedIOBase.read>` and :meth:`readline() <io.IOBase.readline>` now works correctly. (Contributed by Nir Aides; :issue:`7610`.)
pt_br: :mod:`zipfile` agora também oferece suporte ao arquivamento de diretórios vazios e os extrai corretamente. (Correção de Kuba Wieczorek; :issue:`4710`.) Ler arquivos de um arquivo é mais rápido e intercalar :meth:`read() <io.BufferedIOBase.read>` e :meth:`readline() <io .IOBase.readline>` agora funciona corretamente. (Contribuição de Nir Aides; :issue:`7610`.)

source: The :func:`~zipfile.is_zipfile` function now accepts a file object, in addition to the path names accepted in earlier versions. (Contributed by Gabriel Genellina; :issue:`4756`.)
pt_br: A função :func:`~zipfile.is_zipfile` agora aceita um objeto arquivo, além dos nomes de caminho aceitos em versões anteriores. (Contribuição de Gabriel Genellina; :issue:`4756`.)

source: The :meth:`~zipfile.ZipFile.writestr` method now has an optional *compress_type* parameter that lets you override the default compression method specified in the :class:`~zipfile.ZipFile` constructor. (Contributed by Ronald Oussoren; :issue:`6003`.)
pt_br: O método :meth:`~zipfile.ZipFile.writestr` agora tem um parâmetro *compress_type* opcional que permite substituir o método de compactação padrão especificado no construtor de :class:`~zipfile.ZipFile`. (Contribuição de Ronald Oussoren; :issue:`6003`.)

source: New module: importlib
pt_br: Novo módulo: importlib

source: Python 3.1 includes the :mod:`importlib` package, a re-implementation of the logic underlying Python's :keyword:`import` statement. :mod:`importlib` is useful for implementers of Python interpreters and to users who wish to write new importers that can participate in the import process. Python 2.7 doesn't contain the complete :mod:`importlib` package, but instead has a tiny subset that contains a single function, :func:`~importlib.import_module`.
pt_br: Python 3.1 inclui o pacote :mod:`importlib`, uma reimplementação da lógica subjacente à instrução :keyword:`import` do Python. :mod:`importlib` é útil para implementadores de interpretadores Python e para usuários que desejam escrever novos importadores que possam participar do processo de importação. Python 2.7 não contém o pacote :mod:`importlib` completo, mas em vez disso possui um pequeno subconjunto que contém uma única função, :func:`~importlib.import_module`.

source: ``import_module(name, package=None)`` imports a module. *name* is a string containing the module or package's name. It's possible to do relative imports by providing a string that begins with a ``.`` character, such as ``..utils.errors``. For relative imports, the *package* argument must be provided and is the name of the package that will be used as the anchor for the relative import. :func:`~importlib.import_module` both inserts the imported module into ``sys.modules`` and returns the module object.
pt_br: ``import_module(name, package=None)`` importa um módulo. *name* é uma string contendo o nome do módulo ou pacote. É possível fazer importações relativas fornecendo uma string que começa com um caractere ``.``, como ``..utils.errors``. Para importações relativas, o argumento *package* deve ser fornecido e é o nome do pacote que será usado como âncora para a importação relativa. :func:`~importlib.import_module` insere o módulo importado em ``sys.modules`` e retorna o objeto do módulo.

source: Here are some examples::
pt_br: Veja alguns exemplos::

source: >>> from importlib import import_module >>> anydbm = import_module('anydbm') # Standard absolute import >>> anydbm <module 'anydbm' from '/p/python/Lib/anydbm.py'> >>> # Relative import >>> file_util = import_module('..file_util', 'distutils.command') >>> file_util <module 'distutils.file_util' from '/python/Lib/distutils/file_util.pyc'>
pt_br: >>> from importlib import import_module >>> anydbm = import_module('anydbm') # Importação absoluta padrão >>> anydbm <module 'anydbm' from '/p/python/Lib/anydbm.py'> >>> # Importação relativa >>> file_util = import_module('..file_util', 'distutils.command') >>> file_util <module 'distutils.file_util' from '/python/Lib/distutils/file_util.pyc'>

source: :mod:`importlib` was implemented by Brett Cannon and introduced in Python 3.1.
pt_br: :mod:`importlib` foi implementado por Brett Cannon e introduzido no Python 3.1.

source: New module: sysconfig
pt_br: Novo módulo: sysconfig

source: The :mod:`sysconfig` module has been pulled out of the Distutils package, becoming a new top-level module in its own right. :mod:`sysconfig` provides functions for getting information about Python's build process: compiler switches, installation paths, the platform name, and whether Python is running from its source directory.
pt_br: O módulo :mod:`sysconfig` foi retirado do pacote Distutils, tornando-se um novo módulo de nível independente. :mod:`sysconfig` fornece funções para obter informações sobre o processo de construção do Python: opções do compilador, caminhos de instalação, o nome da plataforma e se o Python está sendo executado a partir de seu diretório de código-fonte.

source: Some of the functions in the module are:
pt_br: Algumas das funções do módulo são:

source: :func:`~sysconfig.get_config_var` returns variables from Python's Makefile and the :file:`pyconfig.h` file.
pt_br: :func:`~sysconfig.get_config_var` retorna variáveis do Makefile do Python e do arquivo :file:`pyconfig.h`.

source: :func:`~sysconfig.get_config_vars` returns a dictionary containing all of the configuration variables.
pt_br: :func:`~sysconfig.get_config_vars` retorna um dicionário contendo todas as variáveis de configuração.

source: :func:`~sysconfig.get_path` returns the configured path for a particular type of module: the standard library, site-specific modules, platform-specific modules, etc.
pt_br: :func:`~sysconfig.get_path` retorna o caminho configurado para um tipo específico de módulo: a biblioteca padrão, módulos específicos do site, módulos específicos da plataforma, etc.

source: :func:`~sysconfig.is_python_build` returns true if you're running a binary from a Python source tree, and false otherwise.
pt_br: :func:`~sysconfig.is_python_build` retorna verdadeiro se você estiver executando um binário de uma árvore de código-fonte em Python, e falso caso contrário.

source: Consult the :mod:`sysconfig` documentation for more details and for a complete list of functions.
pt_br: Consulte a documentação do :mod:`sysconfig` para mais detalhes e para uma lista completa de funções.

source: The Distutils package and :mod:`sysconfig` are now maintained by Tarek Ziadé, who has also started a Distutils2 package (source repository at https://hg.python.org/distutils2/) for developing a next-generation version of Distutils.
pt_br: O pacote Distutils e :mod:`sysconfig` agora são mantidos por Tarek Ziadé, que também iniciou um pacote Distutils2 (repositório fonte em https://hg.python.org/distutils2/) para desenvolver uma versão de próxima geração do Distutils.

source: ttk: Themed Widgets for Tk
pt_br: ttk: Widgets temáticos para Tk

source: Tcl/Tk 8.5 includes a set of themed widgets that re-implement basic Tk widgets but have a more customizable appearance and can therefore more closely resemble the native platform's widgets. This widget set was originally called Tile, but was renamed to Ttk (for "themed Tk") on being added to Tcl/Tck release 8.5.
pt_br: O Tcl/Tk 8.5 inclui um conjunto de widgets temáticos que reimplementam widgets Tk básicos, mas têm uma aparência mais personalizável e podem, portanto, se assemelhar mais aos widgets da plataforma nativa. Este conjunto de widgets foi originalmente chamado de Tile, mas foi renomeado para Ttk (para "Tk temático") ao ser adicionado ao Tcl/Tck versão 8.5.

source: To learn more, read the :mod:`~tkinter.ttk` module documentation. You may also wish to read the Tcl/Tk manual page describing the Ttk theme engine, available at https://www.tcl.tk/man/tcl8.5/TkCmd/ttk_intro.html. Some screenshots of the Python/Ttk code in use are at https://code.google.com/archive/p/python-ttk/wikis/Screenshots.wiki.
pt_br: Para saber mais, leia a documentação do módulo :mod:`~tkinter.ttk`. Você também pode ler a página de manual do Tcl/Tk que descreve o mecanismo do tema Ttk, disponível em https://www.tcl.tk/man/tcl8.5/TkCmd/ttk_intro.html. Algumas capturas de tela do código Python/Ttk em uso estão em https://code.google.com/archive/p/python-ttk/wikis/Screenshots.wiki.

source: The :mod:`tkinter.ttk` module was written by Guilherme Polo and added in :issue:`2983`. An alternate version called ``Tile.py``, written by Martin Franklin and maintained by Kevin Walzer, was proposed for inclusion in :issue:`2618`, but the authors argued that Guilherme Polo's work was more comprehensive.
pt_br: O módulo :mod:`tkinter.ttk` foi escrito por Guilherme Polo e adicionado em :issue:`2983`. Uma versão alternativa chamada ``Tile.py``, escrita por Martin Franklin e mantida por Kevin Walzer, foi proposta para inclusão em :issue:`2618`, mas os autores argumentaram que o trabalho de Guilherme Polo era mais abrangente.

source: Updated module: unittest
pt_br: Módulo atualizado: unittest

source: The :mod:`unittest` module was greatly enhanced; many new features were added. Most of these features were implemented by Michael Foord, unless otherwise noted. The enhanced version of the module is downloadable separately for use with Python versions 2.4 to 2.6, packaged as the :mod:`!unittest2` package, from :pypi:`unittest2`.
pt_br: O módulo :mod:`unittest` foi bastante aprimorado; muitos novos recursos foram adicionados. A maioria desses recursos foi implementada por Michael Foord, salvo indicação em contrário. A versão aprimorada do módulo pode ser baixada separadamente para uso com as versões 2.4 a 2.6 do Python, empacotadas como o pacote :mod:`!unittest2`, de :pypi:`unittest2`.
