Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: When used from the command line, the module can automatically discover tests. It's not as fancy as `py.test <https://pytest.org>`__ or `nose <https://nose.readthedocs.io/>`__, but provides a simple way to run tests kept within a set of package directories. For example, the following command will search the :file:`test/` subdirectory for any importable test files named ``test*.py``::
pt_br: Quando usado na linha de comando, o módulo pode descobrir testes automaticamente. Não é tão sofisticado quanto `py.test <https://pytest.org>`__ ou `nose <https://nose.readthedocs.io/>`__, mas fornece uma maneira simples de executar testes mantidos dentro de um conjunto de diretórios de pacotes. Por exemplo, o comando a seguir irá pesquisar no subdiretório :file:`test/` por quaisquer arquivos de teste importáveis chamados ``test*.py``::

source: Consult the :mod:`unittest` module documentation for more details. (Developed in :issue:`6001`.)
pt_br: Consulte a documentação do módulo :mod:`unittest` para mais detalhes. (Desenvolvido em :issue:`6001`.)

source: The :func:`~unittest.main` function supports some other new options:
pt_br: A função :func:`~unittest.main` oferece suporte a algumas outras novas opções:

source: :option:`-b <unittest -b>` or :option:`!--buffer` will buffer the standard output and standard error streams during each test. If the test passes, any resulting output will be discarded; on failure, the buffered output will be displayed.
pt_br: :option:`-b <unittest -b>` ou :option:`!--buffer` armazenará em buffer a saída padrão e os fluxos de erro padrão durante cada teste. Se o teste for aprovado, qualquer saída resultante será descartada; em caso de falha, a saída em buffer será exibida.

source: :option:`-c <unittest -c>` or :option:`!--catch` will cause the control-C interrupt to be handled more gracefully. Instead of interrupting the test process immediately, the currently running test will be completed and then the partial results up to the interruption will be reported. If you're impatient, a second press of control-C will cause an immediate interruption.
pt_br: :option:`-c <unittest -c>` ou :option:`!--catch` fará com que a interrupção control-C seja tratada com mais elegância. Em vez de interromper imediatamente o processo de teste, o teste em execução será concluído e então os resultados parciais até a interrupção serão relatados. Se você estiver impaciente, um segundo toque no controle C causará uma interrupção imediata.

source: This control-C handler tries to avoid causing problems when the code being tested or the tests being run have defined a signal handler of their own, by noticing that a signal handler was already set and calling it. If this doesn't work for you, there's a :func:`~unittest.removeHandler` decorator that can be used to mark tests that should have the control-C handling disabled.
pt_br: Este manipulador de control-C tenta evitar causar problemas quando o código que está sendo testado ou os testes em execução definiram um manipulador de sinal próprio, percebendo que um manipulador de sinal já estava definido e chamando-o. Se isso não funcionar para você, existe um decorador :func:`~unittest.removeHandler` que pode ser usado para marcar testes que devem ter o manuseio de control-C desabilitado.

source: :option:`-f <unittest -f>` or :option:`!--failfast` makes test execution stop immediately when a test fails instead of continuing to execute further tests. (Suggested by Cliff Dyer and implemented by Michael Foord; :issue:`8074`.)
pt_br: :option:`-f <unittest -f>` ou :option:`!--failfast` faz com que a execução do teste pare imediatamente quando um teste falha, em vez de continuar a executar testes adicionais. (Sugerido por Cliff Dyer e implementado por Michael Foord; :issue:`8074`.)

source: The progress messages now show 'x' for expected failures and 'u' for unexpected successes when run in verbose mode. (Contributed by Benjamin Peterson.)
pt_br: As mensagens de progresso agora mostram 'x' para falhas esperadas e 'u' para sucessos inesperados quando executadas em modo detalhado. (Contribuição de Benjamin Peterson.)

source: Test cases can raise the :exc:`~unittest.SkipTest` exception to skip a test (:issue:`1034053`).
pt_br: Os casos de teste podem levantar a exceção :exc:`~unittest.SkipTest` para pular um teste (:issue:`1034053`).

source: The error messages for :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue`, and :meth:`~unittest.TestCase.assertFalse` failures now provide more information. If you set the :attr:`~unittest.TestCase.longMessage` attribute of your :class:`~unittest.TestCase` classes to true, both the standard error message and any additional message you provide will be printed for failures. (Added by Michael Foord; :issue:`5663`.)
pt_br: As mensagens de erro para falhas :meth:`~unittest.TestCase.assertEqual`, :meth:`~unittest.TestCase.assertTrue` e :meth:`~unittest.TestCase.assertFalse` agora fornecem mais informações. Se você definir o atributo :attr:`~unittest.TestCase.longMessage` de suas classes :class:`~unittest.TestCase` como true, tanto a mensagem de erro padrão quanto qualquer mensagem adicional que você fornecer serão impressas para falhas. (Adição de Michael Foord; :issue:`5663`.)

source: The :meth:`~unittest.TestCase.assertRaises` method now returns a context handler when called without providing a callable object to run. For example, you can write this::
pt_br: O método :meth:`~unittest.TestCase.assertRaises` agora retorna um manipulador de contexto quando chamado sem fornecer um objeto chamável para ser executado. Por exemplo, você pode escrever isto::

source: (Implemented by Antoine Pitrou; :issue:`4444`.)
pt_br: (implementação de Antoine Pitrou; :issue:`4444`.)

source: Module- and class-level setup and teardown fixtures are now supported. Modules can contain :func:`~unittest.setUpModule` and :func:`~unittest.tearDownModule` functions. Classes can have :meth:`~unittest.TestCase.setUpClass` and :meth:`~unittest.TestCase.tearDownClass` methods that must be defined as class methods (using ``@classmethod`` or equivalent). These functions and methods are invoked when the test runner switches to a test case in a different module or class.
pt_br: Correções de desmontagem e configuração em nível de módulo e classe agora são suportados. Os módulos podem conter funções :func:`~unittest.setUpModule` e :func:`~unittest.tearDownModule`. As classes podem ter métodos :meth:`~unittest.TestCase.setUpClass` e :meth:`~unittest.TestCase.tearDownClass` que devem ser definidos como métodos de classe (usando ``@classmethod`` ou equivalente). Essas funções e métodos são invocados quando o executor de teste alterna para um caso de teste em um módulo ou classe diferente.

source: The methods :meth:`~unittest.TestCase.addCleanup` and :meth:`~unittest.TestCase.doCleanups` were added. :meth:`~unittest.TestCase.addCleanup` lets you add cleanup functions that will be called unconditionally (after :meth:`~unittest.TestCase.setUp` if :meth:`~unittest.TestCase.setUp` fails, otherwise after :meth:`~unittest.TestCase.tearDown`). This allows for much simpler resource allocation and deallocation during tests (:issue:`5679`).
pt_br: Os métodos :meth:`~unittest.TestCase.addCleanup` e :meth:`~unittest.TestCase.doCleanups` foram adicionados. :meth:`~unittest.TestCase.addCleanup` permite adicionar funções de limpeza que serão chamadas incondicionalmente (após :meth:`~unittest.TestCase.setUp` se :meth:`~unittest.TestCase.setUp` falhar, caso contrário, após :meth:`~unittest.TestCase.tearDown`). Isso permite uma alocação e desalocação de recursos muito mais simples durante os testes (:issue:`5679`).

source: A number of new methods were added that provide more specialized tests. Many of these methods were written by Google engineers for use in their test suites; Gregory P. Smith, Michael Foord, and GvR worked on merging them into Python's version of :mod:`unittest`.
pt_br: Foram adicionados vários novos métodos que fornecem testes mais especializados. Muitos desses métodos foram escritos por engenheiros do Google para uso em seus conjuntos de testes; Gregory P. Smith, Michael Foord e GvR trabalharam na fusão deles na versão Python de :mod:`unittest`.

source: :meth:`~unittest.TestCase.assertIsNone` and :meth:`~unittest.TestCase.assertIsNotNone` take one expression and verify that the result is or is not ``None``.
pt_br: :meth:`~unittest.TestCase.assertIsNone` e :meth:`~unittest.TestCase.assertIsNotNone` pegam uma expressão e verificam se o resultado é ou não ``None``.

source: :meth:`~unittest.TestCase.assertIs` and :meth:`~unittest.TestCase.assertIsNot` take two values and check whether the two values evaluate to the same object or not. (Added by Michael Foord; :issue:`2578`.)
pt_br: :meth:`~unittest.TestCase.assertIs` e :meth:`~unittest.TestCase.assertIsNot` pegam dois valores e verificam se os dois valores são avaliados como o mesmo objeto ou não. (Adicionado por Michael Foord; :issue:`2578`.)

source: :meth:`~unittest.TestCase.assertIsInstance` and :meth:`~unittest.TestCase.assertNotIsInstance` check whether the resulting object is an instance of a particular class, or of one of a tuple of classes. (Added by Georg Brandl; :issue:`7031`.)
pt_br: :meth:`~unittest.TestCase.assertIsInstance` e :meth:`~unittest.TestCase.assertNotIsInstance` verificam se o objeto resultante é uma instância de uma classe específica ou de uma tupla de classes. (Adicionado por Georg Brandl; :issue:`7031`.)

source: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess`, and :meth:`~unittest.TestCase.assertLessEqual` compare two quantities.
pt_br: :meth:`~unittest.TestCase.assertGreater`, :meth:`~unittest.TestCase.assertGreaterEqual`, :meth:`~unittest.TestCase.assertLess`, e :meth:`~unittest.TestCase.assertLessEqual` comparam duas quantidades.

source: :meth:`~unittest.TestCase.assertMultiLineEqual` compares two strings, and if they're not equal, displays a helpful comparison that highlights the differences in the two strings. This comparison is now used by default when Unicode strings are compared with :meth:`~unittest.TestCase.assertEqual`.
pt_br: :meth:`~unittest.TestCase.assertMultiLineEqual` compara duas strings e, se não forem iguais, exibe uma comparação útil que destaca as diferenças nas duas strings. Esta comparação agora é usada por padrão quando strings Unicode são comparadas com :meth:`~unittest.TestCase.assertEqual`.

source: :meth:`assertRegexpMatches() <unittest.TestCase.assertRegex>` and :meth:`assertNotRegexpMatches() <unittest.TestCase.assertNotRegex>` checks whether the first argument is a string matching or not matching the regular expression provided as the second argument (:issue:`8038`).
pt_br: :meth:`assertRegexpMatches() <unittest.TestCase.assertRegex>` e :meth:`assertNotRegexpMatches() <unittest.TestCase.assertNotRegex>` verificam se o primeiro argumento é uma string que corresponde ou não à expressão regular fornecida como o segundo argumento (:issue:`8038`).

source: :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>` checks whether a particular exception is raised, and then also checks that the string representation of the exception matches the provided regular expression.
pt_br: :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>` verifica se uma exceção específica foi levantada e também verifica se a representação da string da exceção corresponde à expressão regular fornecida.

source: :meth:`~unittest.TestCase.assertIn` and :meth:`~unittest.TestCase.assertNotIn` tests whether *first* is or is not in *second*.
pt_br: :meth:`~unittest.TestCase.assertIn` e :meth:`~unittest.TestCase.assertNotIn` testa se *primeiro* está ou não em *segundo*.

source: :meth:`assertItemsEqual() <unittest.TestCase.assertCountEqual>` tests whether two provided sequences contain the same elements.
pt_br: :meth:`assertItemsEqual() <unittest.TestCase.assertCountEqual>` testa se duas sequências fornecidas contêm os mesmos elementos.

source: :meth:`~unittest.TestCase.assertSetEqual` compares whether two sets are equal, and only reports the differences between the sets in case of error.
pt_br: :meth:`~unittest.TestCase.assertSetEqual` compara se dois conjuntos são iguais e apenas relata as diferenças entre os conjuntos em caso de erro.

source: Similarly, :meth:`~unittest.TestCase.assertListEqual` and :meth:`~unittest.TestCase.assertTupleEqual` compare the specified types and explain any differences without necessarily printing their full values; these methods are now used by default when comparing lists and tuples using :meth:`~unittest.TestCase.assertEqual`. More generally, :meth:`~unittest.TestCase.assertSequenceEqual` compares two sequences and can optionally check whether both sequences are of a particular type.
pt_br: Da mesma forma, :meth:`~unittest.TestCase.assertListEqual` e :meth:`~unittest.TestCase.assertTupleEqual` comparam os tipos especificados e explicam quaisquer diferenças sem necessariamente imprimir seus valores completos; esses métodos agora são usados por padrão ao comparar listas e tuplas usando :meth:`~unittest.TestCase.assertEqual`. De forma mais geral, :meth:`~unittest.TestCase.assertSequenceEqual` compara duas sequências e pode opcionalmente verificar se ambas as sequências são de um tipo específico.

source: :meth:`~unittest.TestCase.assertDictEqual` compares two dictionaries and reports the differences; it's now used by default when you compare two dictionaries using :meth:`~unittest.TestCase.assertEqual`. :meth:`!assertDictContainsSubset` checks whether all of the key/value pairs in *first* are found in *second*.
pt_br: :meth:`~unittest.TestCase.assertDictEqual` compara dois dicionários e relata as diferenças; agora é usado por padrão quando você compara dois dicionários usando :meth:`~unittest.TestCase.assertEqual`. :meth:`!assertDictContainsSubset` verifica se todos os pares chave/valor em *first* são encontrados em *second*.

source: :meth:`~unittest.TestCase.assertAlmostEqual` and :meth:`~unittest.TestCase.assertNotAlmostEqual` test whether *first* and *second* are approximately equal. This method can either round their difference to an optionally specified number of *places* (the default is 7) and compare it to zero, or require the difference to be smaller than a supplied *delta* value.
pt_br: :meth:`~unittest.TestCase.assertAlmostEqual` e :meth:`~unittest.TestCase.assertNotAlmostEqual` testam se *first* e *second* são aproximadamente iguais. Este método pode arredondar a diferença para um número opcionalmente especificado de *places* (o padrão é 7) e compará-lo com zero, ou exigir que a diferença seja menor que um valor *delta* fornecido.

source: :meth:`~unittest.TestLoader.loadTestsFromName` properly honors the :attr:`~unittest.TestLoader.suiteClass` attribute of the :class:`~unittest.TestLoader`. (Fixed by Mark Roddy; :issue:`6866`.)
pt_br: :meth:`~unittest.TestLoader.loadTestsFromName` respeita corretamente o atributo :attr:`~unittest.TestLoader.suiteClass` do :class:`~unittest.TestLoader`. (Correção de Mark Roddy; :issue:`6866`.)

source: A new hook lets you extend the :meth:`~unittest.TestCase.assertEqual` method to handle new data types. The :meth:`~unittest.TestCase.addTypeEqualityFunc` method takes a type object and a function. The function will be used when both of the objects being compared are of the specified type. This function should compare the two objects and raise an exception if they don't match; it's a good idea for the function to provide additional information about why the two objects aren't matching, much as the new sequence comparison methods do.
pt_br: Um novo gancho permite estender o método :meth:`~unittest.TestCase.assertEqual` para lidar com novos tipos de dados. O método :meth:`~unittest.TestCase.addTypeEqualityFunc` leva um objeto de tipo e uma função. A função será usada quando ambos os objetos comparados forem do tipo especificado. Esta função deve comparar os dois objetos e gerar uma exceção se eles não corresponderem; é uma boa ideia que a função forneça informações adicionais sobre por que os dois objetos não correspondem, assim como fazem os novos métodos de comparação de sequências.

source: :func:`unittest.main` now takes an optional ``exit`` argument. If false, :func:`~unittest.main` doesn't call :func:`sys.exit`, allowing :func:`~unittest.main` to be used from the interactive interpreter. (Contributed by J. Pablo Fernández; :issue:`3379`.)
pt_br: :func:`unittest.main` agora recebe um argumento ``exit`` opcional. Se for falso, :func:`~unittest.main` não chama :func:`sys.exit`, permitindo que :func:`~unittest.main` seja usado a partir do interpretador interativo. (Contribuição de J. Pablo Fernández; :issue:`3379`.)

source: :class:`~unittest.TestResult` has new :meth:`~unittest.TestResult.startTestRun` and :meth:`~unittest.TestResult.stopTestRun` methods that are called immediately before and after a test run. (Contributed by Robert Collins; :issue:`5728`.)
pt_br: :class:`~unittest.TestResult` tem novos métodos :meth:`~unittest.TestResult.startTestRun` e :meth:`~unittest.TestResult.stopTestRun` que são chamados imediatamente antes e depois de uma execução de teste. (Contribuição de Robert Collins; :issue:`5728`.)

source: With all these changes, the :file:`unittest.py` was becoming awkwardly large, so the module was turned into a package and the code split into several files (by Benjamin Peterson). This doesn't affect how the module is imported or used.
pt_br: Com todas essas mudanças, o :file:`unittest.py` estava ficando estranhamente grande, então o módulo foi transformado em um pacote e o código dividido em vários arquivos (por Benjamin Peterson). Isso não afeta como o módulo é importado ou usado.

source: Describes the new features, how to use them, and the rationale for various design decisions. (By Michael Foord.)
pt_br: Descreve os novos recursos, como usá-los e a justificativa para diversas decisões de design. (Por Michael Foord.)

source: Updated module: ElementTree 1.3
pt_br: Módulo atualizado: ElementTree 1.3

source: The version of the ElementTree library included with Python was updated to version 1.3. Some of the new features are:
pt_br: A versão da biblioteca ElementTree incluída no Python foi atualizada para a versão 1.3. Alguns dos novos recursos são:

source: The various parsing functions now take a *parser* keyword argument giving an :class:`~xml.etree.ElementTree.XMLParser` instance that will be used. This makes it possible to override the file's internal encoding::
pt_br: As várias funções de análise agora recebem um argumento nomeado *parser* fornecendo uma instância :class:`~xml.etree.ElementTree.XMLParser` que será usada. Isso torna possível substituir a codificação interna do arquivo::

source: Errors in parsing XML now raise a :exc:`~xml.etree.ElementTree.ParseError` exception, whose instances have a :attr:`!position` attribute containing a (*line*, *column*) tuple giving the location of the problem.
pt_br: Erros na análise de XML agora levantam uma exceção :exc:`~xml.etree.ElementTree.ParseError`, cujas instâncias possuem um atributo :attr:`!position` contendo uma tupla (*linha*, *coluna*) fornecendo a localização do problema.

source: ElementTree's code for converting trees to a string has been significantly reworked, making it roughly twice as fast in many cases. The :meth:`ElementTree.write() <xml.etree.ElementTree.ElementTree.write>` and :meth:`!Element.write` methods now have a *method* parameter that can be "xml" (the default), "html", or "text". HTML mode will output empty elements as ``<empty></empty>`` instead of ``<empty/>``, and text mode will skip over elements and only output the text chunks. If you set the :attr:`~xml.etree.ElementTree.Element.tag` attribute of an element to ``None`` but leave its children in place, the element will be omitted when the tree is written out, so you don't need to do more extensive rearrangement to remove a single element.
pt_br: O código do ElementTree para converter árvores em strings foi significativamente reformulado, tornando-o quase duas vezes mais rápido em muitos casos. Os métodos :meth:`ElementTree.write() <xml.etree.ElementTree.ElementTree.write>` e :meth:`!Element.write` agora têm um parâmetro *method* que pode ser "xml" (o padrão), "html" ou "text". O modo HTML exibirá elementos vazios como ``<empty></empty>`` em vez de ``<empty/>``, e o modo texto ignorará os elementos e exibirá apenas os blocos de texto. Se você definir o atributo :attr:`~xml.etree.ElementTree.Element.tag` de um elemento como ``None``, mas deixar seus filhos no lugar, o elemento será omitido quando a árvore for gravada, portanto, não será necessário fazer uma reorganização mais extensa para remover um único elemento.

source: Namespace handling has also been improved. All ``xmlns:<whatever>`` declarations are now output on the root element, not scattered throughout the resulting XML. You can set the default namespace for a tree by setting the :attr:`!default_namespace` attribute and can register new prefixes with :meth:`~xml.etree.ElementTree.register_namespace`. In XML mode, you can use the true/false *xml_declaration* parameter to suppress the XML declaration.
pt_br: O tratamento de espaços de nomes também foi aprimorado. Todas as declarações ``xmlns:<alguma-coisa>`` agora são geradas no elemento raiz, e não espalhadas pelo XML resultante. Você pode definir o espaço de nomes padrão para uma árvore definindo o atributo :attr:`!default_namespace` e registrar novos prefixos com :meth:`~xml.etree.ElementTree.register_namespace`. No modo XML, você pode usar o parâmetro true/false *xml_declaration* para suprimir a declaração XML.

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.extend` appends the items from a sequence to the element's children. Elements themselves behave like sequences, so it's easy to move children from one element to another::
pt_br: Novo método :class:`~xml.etree.ElementTree.Element`: :meth:`~xml.etree.ElementTree.Element.extend` anexa os itens de uma sequência aos filhos do elemento. Os próprios elementos se comportam como sequências, por isso é fácil mover os filhos de um elemento para outro::

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.iter` yields the children of the element as a generator. It's also possible to write ``for child in elem:`` to loop over an element's children. The existing method :meth:`!getiterator` is now deprecated, as is :meth:`!getchildren` which constructs and returns a list of children.
pt_br: Novo método :class:`~xml.etree.ElementTree.Element`: :meth:`~xml.etree.ElementTree.Element.iter` produz os filhos do elemento como um gerador. Também é possível escrever ``for child in elem:`` para percorrer os filhos de um elemento. O método existente :meth:`!getiterator` agora está descontinuado, assim como :meth:`!getchildren` que constrói e retorna uma lista de filhos.

source: New :class:`~xml.etree.ElementTree.Element` method: :meth:`~xml.etree.ElementTree.Element.itertext` yields all chunks of text that are descendants of the element. For example::
pt_br: Novo método :class:`~xml.etree.ElementTree.Element`: :meth:`~xml.etree.ElementTree.Element.itertext` produz todos os pedaços de texto que são descendentes do elemento. Por exemplo::
