Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: Deprecated: using an element as a Boolean (i.e., ``if elem:``) would return true if the element had any children, or false if there were no children. This behaviour is confusing -- ``None`` is false, but so is a childless element? -- so it will now trigger a :exc:`FutureWarning`. In your code, you should be explicit: write ``len(elem) != 0`` if you're interested in the number of children, or ``elem is not None``.
pt_br: Descontinuado: usar um elemento como booleano (ou seja, ``if elem:``) retornaria verdadeiro se o elemento tivesse algum filho, ou falso se não houvesse nenhum filho. Este comportamento é confuso -- ``None`` é falso, mas um elemento sem filhos também o é? -- então agora irá acionar um :exc:`FutureWarning`. Em seu código, você deve ser explícito: escreva ``len(elem) != 0`` se estiver interessado no número de filhos, ou ``elem is not None``.

source: Fredrik Lundh develops ElementTree and produced the 1.3 version; you can read his article describing 1.3 at https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Florent Xicluna updated the version included with Python, after discussions on python-dev and in :issue:`6472`.)
pt_br: Fredrik Lundh desenvolve ElementTree e produziu a versão 1.3; você pode ler o artigo dele descrevendo 1.3 em https://web.archive.org/web/20200703234532/http://effbot.org/zone/elementtree-13-intro.htm. Florent Xicluna atualizou a versão incluída no Python, após discussões em python-dev e em :issue:`6472`.)

source: Build and C API Changes
pt_br: Mudanças a construções e API C

source: Changes to Python's build process and to the C API include:
pt_br: As alterações no processo de construção do Python e na API C incluem:

source: The latest release of the GNU Debugger, GDB 7, can be `scripted using Python <https://web.archive.org/web/20110715084810/http://sourceware.org/gdb/current/onlinedocs/gdb/Python.html>`__. When you begin debugging an executable program P, GDB will look for a file named ``P-gdb.py`` and automatically read it. Dave Malcolm contributed a :file:`python-gdb.py` that adds a number of commands useful when debugging Python itself. For example, ``py-up`` and ``py-down`` go up or down one Python stack frame, which usually corresponds to several C stack frames. ``py-print`` prints the value of a Python variable, and ``py-bt`` prints the Python stack trace. (Added as a result of :issue:`8032`.)
pt_br: O uso da versão mais recente do GNU Debugger, GDB 7, pode ser `programado usando Python <https://web.archive.org/web/20110715084810/http://sourceware.org/gdb/current/onlinedocs/gdb/Python.html>`__. Quando você começa a depurar um programa executável P, o GDB irá procurar por um arquivo chamado ``P-gdb.py`` e lê-lo automaticamente. Dave Malcolm contribuiu com um :file:`python-gdb.py` que adiciona vários comandos úteis ao depurar o próprio Python. Por exemplo, ``py-up`` e ``py-down`` sobem ou descem um quadro de pilha Python, que geralmente corresponde a vários quadros de pilha C. ``py-print`` imprime o valor de uma variável Python e ``py-bt`` imprime o stack trace do Python. (Adicionado como resultado de :issue:`8032`.)

source: If you use the :file:`.gdbinit` file provided with Python, the "pyo" macro in the 2.7 version now works correctly when the thread being debugged doesn't hold the GIL; the macro now acquires it before printing. (Contributed by Victor Stinner; :issue:`3632`.)
pt_br: Se você usar o arquivo :file:`.gdbinit` fornecido com Python, a macro "pyo" na versão 2.7 agora funciona corretamente quando o thread que está sendo depurado não contém a GIL; a macro agora a adquire antes de imprimir. (Contribuição de Victor Stinner; :issue:`3632`.)

source: :c:func:`Py_AddPendingCall` is now thread-safe, letting any worker thread submit notifications to the main Python thread. This is particularly useful for asynchronous IO operations. (Contributed by Kristján Valur Jónsson; :issue:`4293`.)
pt_br: :c:func:`Py_AddPendingCall` agora é segura para thread, permitindo que qualquer thread de trabalho envie notificações para o thread principal do Python. Isto é particularmente útil para operações de E/S assíncronas. (Contribuição de Kristján Valur Jónsson; :issue:`4293`.)

source: New function: :c:func:`PyCode_NewEmpty` creates an empty code object; only the filename, function name, and first line number are required. This is useful for extension modules that are attempting to construct a more useful traceback stack. Previously such extensions needed to call :c:func:`!PyCode_New`, which had many more arguments. (Added by Jeffrey Yasskin.)
pt_br: Nova função: :c:func:`PyCode_NewEmpty` cria um objeto código vazio; apenas o nome do arquivo, o nome da função e o número da primeira linha são necessários. Isto é útil para módulos de extensão que estão tentando construir uma pilha de traceback mais útil. Anteriormente, essas extensões precisavam chamar :c:func:`!PyCode_New`, que tinha muito mais argumentos. (Adição de Jeffrey Yasskin.)

source: New function: :c:func:`PyErr_NewExceptionWithDoc` creates a new exception class, just as the existing :c:func:`PyErr_NewException` does, but takes an extra ``char *`` argument containing the docstring for the new exception class. (Added by 'lekma' on the Python bug tracker; :issue:`7033`.)
pt_br: Nova função: :c:func:`PyErr_NewExceptionWithDoc` cria uma nova classe de exceção, assim como a :c:func:`PyErr_NewException` existente faz, mas recebe um argumento ``char *`` extra contendo a docstring para a nova classe de exceção . (Adição de 'lekma' no rastreador de bugs do Python; :issue:`7033`.)

source: New function: :c:func:`PyFrame_GetLineNumber` takes a frame object and returns the line number that the frame is currently executing. Previously code would need to get the index of the bytecode instruction currently executing, and then look up the line number corresponding to that address. (Added by Jeffrey Yasskin.)
pt_br: Nova função: :c:func:`PyFrame_GetLineNumber` pega um objeto quadro e retorna o número da linha que o frame está executando atualmente. Anteriormente, o código precisaria obter o índice da instrução de bytecode atualmente em execução e, em seguida, procurar o número da linha correspondente a esse endereço. (Adição de Jeffrey Yasskin.)

source: New functions: :c:func:`PyLong_AsLongAndOverflow` and :c:func:`PyLong_AsLongLongAndOverflow` approximates a Python long integer as a C :c:expr:`long` or :c:expr:`long long`. If the number is too large to fit into the output type, an *overflow* flag is set and returned to the caller. (Contributed by Case Van Horsen; :issue:`7528` and :issue:`7767`.)
pt_br: Novas funções: :c:func:`PyLong_AsLongAndOverflow` e :c:func:`PyLong_AsLongLongAndOverflow` aproxima um inteiro longo do Python como um :c:expr:`long` ou :c:expr:`long long` do C. Se o número for muito grande para caber no tipo de saída, um sinalizador *overflow* será definido e retornado ao chamador. (Contribuição de Case Van Horsen; :issue:`7528` e :issue:`7767`.)

source: New function: stemming from the rewrite of string-to-float conversion, a new :c:func:`PyOS_string_to_double` function was added. The old :c:func:`!PyOS_ascii_strtod` and :c:func:`!PyOS_ascii_atof` functions are now deprecated.
pt_br: Nova função: decorrente da reescrita da conversão string-para-float, uma nova função :c:func:`PyOS_string_to_double` foi adicionada. As antigas funções :c:func:`!PyOS_ascii_strtod` e :c:func:`!PyOS_ascii_atof` agora foram descontinuadas.

source: New function: :c:func:`!PySys_SetArgvEx` sets the value of ``sys.argv`` and can optionally update ``sys.path`` to include the directory containing the script named by ``sys.argv[0]`` depending on the value of an *updatepath* parameter.
pt_br: Nova função: :c:func:`!PySys_SetArgvEx` define o valor de ``sys.argv`` e pode opcionalmente atualizar ``sys.path`` para incluir o diretório que contém o script nomeado por ``sys.argv[0]`` dependendo do valor de um parâmetro *updatepath*.

source: This function was added to close a security hole for applications that embed Python. The old function, :c:func:`!PySys_SetArgv`, would always update ``sys.path``, and sometimes it would add the current directory. This meant that, if you ran an application embedding Python in a directory controlled by someone else, attackers could put a Trojan-horse module in the directory (say, a file named :file:`os.py`) that your application would then import and run.
pt_br: Esta função foi adicionada para fechar uma falha de segurança em aplicativos que incorporam Python. A função antiga, :c:func:`!PySys_SetArgv`, sempre atualizava ``sys.path``, e às vezes adicionava o diretório atual. Isso significava que, se você executasse uma aplicação incorporando Python em um diretório controlado por outra pessoa, os invasores poderiam colocar um módulo cavalo de Troia no diretório (digamos, um arquivo chamado :file:`os.py`) que sua aplicação então usaria. importar e executar.

source: If you maintain a C/C++ application that embeds Python, check whether you're calling :c:func:`!PySys_SetArgv` and carefully consider whether the application should be using :c:func:`!PySys_SetArgvEx` with *updatepath* set to false.
pt_br: Se você mantém uma aplicação C/C++ que incorpora Python, verifique se está chamando :c:func:`!PySys_SetArgv` e considere cuidadosamente se a aplicação deve usar :c:func:`!PySys_SetArgvEx` com *updatepath* definido como false.

source: Security issue reported as :cve:`2008-5983`; discussed in :issue:`5753`, and fixed by Antoine Pitrou.
pt_br: Problema de segurança relatado como :cve:`2008-5983`; discutido em :issue:`5753`, e corrigido por Antoine Pitrou.

source: New macros: the Python header files now define the following macros: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, :c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER`, and :c:macro:`Py_TOUPPER`. All of these functions are analogous to the C standard macros for classifying characters, but ignore the current locale setting, because in several places Python needs to analyze characters in a locale-independent way. (Added by Eric Smith; :issue:`5793`.)
pt_br: Novas macros: os arquivos de cabeçalho do Python agora definem as seguintes macros: :c:macro:`Py_ISALNUM`, :c:macro:`Py_ISALPHA`, :c:macro:`Py_ISDIGIT`, :c:macro:`Py_ISLOWER`, :c:macro:`Py_ISSPACE`, :c:macro:`Py_ISUPPER`, :c:macro:`Py_ISXDIGIT`, :c:macro:`Py_TOLOWER` e :c:macro:`Py_TOUPPER`. Todas essas funções são análogas às macros padrão C para classificação de caracteres, mas ignoram a configuração de localidade atual, porque em vários lugares o Python precisa analisar caracteres de maneira independente de localidade. (Adição de Eric Smith; :issue:`5793`.)

source: Removed function: :c:func:`!PyEval_CallObject` is now only available as a macro. A function version was being kept around to preserve ABI linking compatibility, but that was in 1997; it can certainly be deleted by now. (Removed by Antoine Pitrou; :issue:`8276`.)
pt_br: Função removida: :c:func:`!PyEval_CallObject` agora está disponível apenas como uma macro. Uma versão de função estava sendo mantida para preservar a compatibilidade de links ABI, mas isso foi em 1997; certamente pode ser excluído agora. (Remoção de Antoine Pitrou; :issue:`8276`.)

source: New format codes: the :c:func:`!PyString_FromFormat`, :c:func:`!PyString_FromFormatV`, and :c:func:`PyErr_Format` functions now accept ``%lld`` and ``%llu`` format codes for displaying C's :c:expr:`long long` types. (Contributed by Mark Dickinson; :issue:`7228`.)
pt_br: Novos códigos de formato: as funções :c:func:`!PyString_FromFormat`, :c:func:`!PyString_FromFormatV` e :c:func:`PyErr_Format` agora aceitam ``%lld`` e ``%llu`` códigos de formato para exibir os tipos :c:expr:`long long` de C. (Contribuição de Mark Dickinson; :issue:`7228`.)

source: The complicated interaction between threads and process forking has been changed. Previously, the child process created by :func:`os.fork` might fail because the child is created with only a single thread running, the thread performing the :func:`os.fork`. If other threads were holding a lock, such as Python's import lock, when the fork was performed, the lock would still be marked as "held" in the new process. But in the child process nothing would ever release the lock, since the other threads weren't replicated, and the child process would no longer be able to perform imports.
pt_br: A complicada interação entre threads e forks de processos foi alterada. Anteriormente, o processo filho criado por :func:`os.fork` pode falhar porque o filho é criado com apenas um único thread em execução, a thread executando :func:`os.fork`. Se outros threads estivessem mantendo uma trava, como a trava de importação do Python, quando o fork fosse executado, a trava ainda seria marcada como "retida" no novo processo. Mas no processo filho nada liberaria a trava, pois os outros threads não foram replicados e o processo filho não seria mais capaz de realizar importações.

source: Python 2.7 acquires the import lock before performing an :func:`os.fork`, and will also clean up any locks created using the :mod:`threading` module. C extension modules that have internal locks, or that call :c:func:`fork()` themselves, will not benefit from this clean-up.
pt_br: Python 2.7 adquire a trava de importação antes de executar um :func:`os.fork`, e também limpará quaisquer travas criadas usando o módulo :mod:`threading`. Módulos de extensão C que possuem travas internas, ou que chamam :c:func:`fork()` eles próprios, não se beneficiarão desta limpeza.

source: (Fixed by Thomas Wouters; :issue:`1590864`.)
pt_br: (Correção de Thomas Wouters; :issue:`1590864`.)

source: The :c:func:`Py_Finalize` function now calls the internal :func:`!threading._shutdown` function; this prevents some exceptions from being raised when an interpreter shuts down. (Patch by Adam Olsen; :issue:`1722344`.)
pt_br: A função :c:func:`Py_Finalize` agora chama a função interna :func:`!threading._shutdown`; isso evita que algumas exceções sejam levantadas quando um interpretador é encerrado. (Patch de Adam Olsen; :issue:`1722344`.)

source: When using the :c:type:`PyMemberDef` structure to define attributes of a type, Python will no longer let you try to delete or set a :c:macro:`!T_STRING_INPLACE` attribute.
pt_br: Ao usar a estrutura :c:type:`PyMemberDef` para definir atributos de um tipo, o Python não permitirá mais que você tente excluir ou definir um atributo :c:macro:`!T_STRING_INPLACE`.

source: Global symbols defined by the :mod:`ctypes` module are now prefixed with ``Py``, or with ``_ctypes``. (Implemented by Thomas Heller; :issue:`3102`.)
pt_br: Símbolos globais definidos pelo módulo :mod:`ctypes` agora são prefixados com ``Py``, ou com ``_ctypes``. (Implementado por Thomas Heller; :issue:`3102`.)

source: New configure option: the :option:`!--with-system-expat` switch allows building the :mod:`pyexpat <xml.parsers.expat>` module to use the system Expat library. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`7609`.)
pt_br: Nova opção de configuração: a opção :option:`!--with-system-expat` permite construir o módulo :mod:`pyexpat <xml.parsers.expat>` para usar a biblioteca Expat do sistema. (Contribuição de Arfrever Frehtes Taifersar Arahesis; :issue:`7609`.)

source: New configure option: the :option:`!--with-valgrind` option will now disable the pymalloc allocator, which is difficult for the Valgrind memory-error detector to analyze correctly. Valgrind will therefore be better at detecting memory leaks and overruns. (Contributed by James Henstridge; :issue:`2422`.)
pt_br: Nova opção de configuração: a opção :option:`!--with-valgrind` agora desativará o alocador pymalloc, o que é difícil para o detector de erros de memória Valgrind analisar corretamente. Valgrind será, portanto, melhor na detecção de vazamentos e sobrecargas de memória. (Contribuição de James Henstridge; :issue:`2422`.)

source: New configure option: you can now supply an empty string to :option:`!--with-dbmliborder=` in order to disable all of the various DBM modules. (Added by Arfrever Frehtes Taifersar Arahesis; :issue:`6491`.)
pt_br: Nova opção de configuração: agora você pode fornecer uma string vazia para :option:`!--with-dbmliborder=` para desabilitar todos os vários módulos DBM. (Adição de Arfrever Frehtes Taifersar Arahesis; :issue:`6491`.)

source: The :program:`configure` script now checks for floating-point rounding bugs on certain 32-bit Intel chips and defines a :c:macro:`!X87_DOUBLE_ROUNDING` preprocessor definition. No code currently uses this definition, but it's available if anyone wishes to use it. (Added by Mark Dickinson; :issue:`2937`.)
pt_br: O script :program:`configure` agora verifica bugs de arredondamento de ponto flutuante em determinados chips Intel de 32 bits e define uma definição de pré-processador :c:macro:`!X87_DOUBLE_ROUNDING`. Nenhum código usa essa definição no momento, mas ela está disponível para quem quiser. (Adicionado por Mark Dickinson; :issue:`2937`.)

source: :program:`configure` also now sets a :envvar:`!LDCXXSHARED` Makefile variable for supporting C++ linking. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`1222585`.)
pt_br: :program:`configure` agora também define uma variável Makefile :envvar:`!LDCXXSHARED` para oferecer suporte à ligação C++. (Contribuição de Arfrever Frehtes Taifersar Arahesis; :issue:`1222585`.)

source: The build process now creates the necessary files for pkg-config support. (Contributed by Clinton Roy; :issue:`3585`.)
pt_br: O processo de construção agora cria os arquivos necessários para suporte ao pkg-config. (Contribuição de Clinton Roy; :issue:`3585`.)

source: The build process now supports Subversion 1.7. (Contributed by Arfrever Frehtes Taifersar Arahesis; :issue:`6094`.)
pt_br: O processo de construção agora prover suporte ao Subversion 1.7. (Contribuição de Arfrever Frehtes Taifersar Arahesis; :issue:`6094`.)

source: Python 3.1 adds a new C datatype, :c:type:`PyCapsule`, for providing a C API to an extension module. A capsule is essentially the holder of a C ``void *`` pointer, and is made available as a module attribute; for example, the :mod:`socket` module's API is exposed as ``socket.CAPI``, and :mod:`unicodedata` exposes ``ucnhash_CAPI``. Other extensions can import the module, access its dictionary to get the capsule object, and then get the ``void *`` pointer, which will usually point to an array of pointers to the module's various API functions.
pt_br: Python 3.1 adiciona um novo tipo de dados C, :c:type:`PyCapsule`, para fornecer uma API C para um módulo de extensão. Uma cápsula é essencialmente o detentor de um ponteiro C ``void *`` e é disponibilizada como um atributo de módulo; por exemplo, a API do módulo :mod:`socket` é exposta como ``socket.CAPI``, e :mod:`unicodedata` expõe ``ucnhash_CAPI``. Outras extensões podem importar o módulo, acessar seu dicionário para obter o objeto cápsula e então obter o ponteiro ``void *``, que normalmente apontará para uma matriz de ponteiros para as diversas funções da API do módulo.

source: There is an existing data type already used for this, :c:type:`!PyCObject`, but it doesn't provide type safety. Evil code written in pure Python could cause a segmentation fault by taking a :c:type:`!PyCObject` from module A and somehow substituting it for the :c:type:`!PyCObject` in module B. Capsules know their own name, and getting the pointer requires providing the name:
pt_br: Já existe um tipo de dados usado para isso, :c:type:`!PyCObject`, mas ele não fornece segurança de tipo. Código maligno escrito em Python puro pode causar uma falha de segmentação pegando um :c:type:`!PyCObject` do módulo A e de alguma forma substituindo-o por :c:type:`!PyCObject` no módulo B. As cápsulas sabem seu próprio nome , e para obter o ponteiro é necessário fornecer o nome:

source: You are assured that ``vtable`` points to whatever you're expecting. If a different capsule was passed in, :c:func:`PyCapsule_IsValid` would detect the mismatched name and return false. Refer to :ref:`using-capsules` for more information on using these objects.
pt_br: Você tem certeza de que ``vtable`` aponta para o que você espera. Se uma cápsula diferente fosse passada, :c:func:`PyCapsule_IsValid` detectaria o nome incompatível e retornaria falso. Consulte :ref:`using-capsules` para mais informações sobre como usar esses objetos.

source: Python 2.7 now uses capsules internally to provide various extension-module APIs, but the :c:func:`!PyCObject_AsVoidPtr` was modified to handle capsules, preserving compile-time compatibility with the :c:type:`!PyCObject` interface. Use of :c:func:`!PyCObject_AsVoidPtr` will signal a :exc:`PendingDeprecationWarning`, which is silent by default.
pt_br: Python 2.7 agora usa cápsulas internamente para fornecer várias APIs de módulo de extensão, mas o :c:func:`!PyCObject_AsVoidPtr` foi modificado para lidar com cápsulas, preservando a compatibilidade em tempo de compilação com a interface :c:type:`!PyCObject`. O uso de :c:func:`!PyCObject_AsVoidPtr` sinalizará uma exceção :exc:`PendingDeprecationWarning`, que é silencioso por padrão.

source: Implemented in Python 3.1 and backported to 2.7 by Larry Hastings; discussed in :issue:`5630`.
pt_br: Implementado em Python 3.1 e portado para 2.7 por Larry Hastings; discutido em :issue:`5630`.

source: Port-Specific Changes: Windows
pt_br: Alterações específicas da porta: Windows

source: The :mod:`msvcrt` module now contains some constants from the :file:`crtassem.h` header file: :data:`~msvcrt.CRT_ASSEMBLY_VERSION`, :data:`~msvcrt.VC_ASSEMBLY_PUBLICKEYTOKEN`, and :data:`~msvcrt.LIBRARIES_ASSEMBLY_NAME_PREFIX`. (Contributed by David Cournapeau; :issue:`4365`.)
pt_br: O módulo :mod:`msvcrt` agora contém algumas constantes do arquivo de cabeçalho :file:`crtassem.h`: :data:`~msvcrt.CRT_ASSEMBLY_VERSION`, :data:`~msvcrt.VC_ASSEMBLY_PUBLICKEYTOKEN` e :data:`~msvcrt.LIBRARIES_ASSEMBLY_NAME_PREFIX`. (Contribuição de David Cournapeau; :issue:`4365`.)

source: The :mod:`_winreg <winreg>` module for accessing the registry now implements the :func:`~winreg.CreateKeyEx` and :func:`~winreg.DeleteKeyEx` functions, extended versions of previously supported functions that take several extra arguments. The :func:`~winreg.DisableReflectionKey`, :func:`~winreg.EnableReflectionKey`, and :func:`~winreg.QueryReflectionKey` were also tested and documented. (Implemented by Brian Curtin: :issue:`7347`.)
pt_br: O módulo :mod:`_winreg <winreg>` para acessar o registro agora implementa as funções :func:`~winreg.CreateKeyEx` e :func:`~winreg.DeleteKeyEx`, versões estendidas de funções suportadas anteriormente que recebem vários argumentos extras. Os :func:`~winreg.DisableReflectionKey`, :func:`~winreg.EnableReflectionKey` e :func:`~winreg.QueryReflectionKey` também foram testados e documentados. (Implementação de Brian Curtin: :issue:`7347`.)

source: The new :c:func:`!_beginthreadex` API is used to start threads, and the native thread-local storage functions are now used. (Contributed by Kristján Valur Jónsson; :issue:`3582`.)
pt_br: A nova API :c:func:`!_beginthreadex` é usada para iniciar threads, e as funções nativas de armazenamento local de thread agora são usadas. (Contribuição de Kristján Valur Jónsson; :issue:`3582`.)
