Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: The :mod:`!ihooks` module now supports relative imports. Note that :mod:`!ihooks` is an older module for customizing imports, superseded by the :mod:`!imputil` module added in Python 2.0. (Relative import support added by Neil Schemenauer.)
pt_br: O módulo :mod:`!ihooks` agora oferece suporte a importações relativas. Observe que :mod:`!ihooks` é um módulo mais antigo para personalizar importações, substituído pelo módulo :mod:`!imputil` adicionado no Python 2.0. (Suporte relativo à importação adicionado por Neil Schemenauer.)

source: The :mod:`imaplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1655`.)
pt_br: O módulo :mod:`imaplib` agora oferece suporte a endereços IPv6. (Contribuição de Derek Morr; :issue:`1655`.)

source: New function: the :mod:`inspect` module's :func:`~inspect.getcallargs` takes a callable and its positional and keyword arguments, and figures out which of the callable's parameters will receive each argument, returning a dictionary mapping argument names to their values. For example::
pt_br: Nova função: :func:`~inspect.getcallargs` do módulo :mod:`inspect` pega um chamável e seus argumentos nomeados e posicionais, e descobre quais dos parâmetros do chamável receberão cada argumento, retornando um dicionário mapeando nomes de argumentos para seus valores. Por exemplo::

source: Contributed by George Sakkis; :issue:`3135`.
pt_br: Contribuição de George Sakkis; :issue:`3135`.

source: Updated module: The :mod:`io` library has been upgraded to the version shipped with Python 3.1. For 3.1, the I/O library was entirely rewritten in C and is 2 to 20 times faster depending on the task being performed. The original Python version was renamed to the :mod:`!_pyio` module.
pt_br: Módulo atualizado: A biblioteca :mod:`io` foi atualizada para a versão fornecida com Python 3.1. Para 3.1, a biblioteca de E/S foi totalmente reescrita em C e é de 2 a 20 vezes mais rápida dependendo da tarefa que está sendo executada. A versão original do Python foi renomeada para o módulo :mod:`!_pyio`.

source: One minor resulting change: the :class:`io.TextIOBase` class now has an :attr:`~io.TextIOBase.errors` attribute giving the error setting used for encoding and decoding errors (one of ``'strict'``, ``'replace'``, ``'ignore'``).
pt_br: Uma pequena mudança resultante: a classe :class:`io.TextIOBase` agora tem um atributo :attr:`~io.TextIOBase.errors` fornecendo a configuração de erro usada para erros de codificação e decodificação (um dos ``'strict'`` , ``'replace'``, ``'ignore'``).

source: The :class:`io.FileIO` class now raises an :exc:`OSError` when passed an invalid file descriptor. (Implemented by Benjamin Peterson; :issue:`4991`.) The :meth:`~io.IOBase.truncate` method now preserves the file position; previously it would change the file position to the end of the new file. (Fixed by Pascal Chambon; :issue:`6939`.)
pt_br: A classe :class:`io.FileIO` agora levanta uma exceção :exc:`OSError` quando passa um descritor de arquivo inválido. (Implementado por Benjamin Peterson; :issue:`4991`.) O método :meth:`~io.IOBase.truncate` agora preserva a posição do arquivo; anteriormente, mudaria a posição do arquivo para o final do novo arquivo. (Correção de Pascal Chambon; :issue:`6939`.)

source: New function: ``itertools.compress(data, selectors)`` takes two iterators. Elements of *data* are returned if the corresponding value in *selectors* is true::
pt_br: Nova função: ``itertools.compress(data, selectors)`` aceita dois iteradores. Elementos de *data* serão retornados se o valor correspondente em *selectors* for verdadeiro::

source: New function: ``itertools.combinations_with_replacement(iter, r)`` returns all the possible *r*-length combinations of elements from the iterable *iter*. Unlike :func:`~itertools.combinations`, individual elements can be repeated in the generated combinations::
pt_br: Nova função: ``itertools.combinations_with_replacement(iter, r)`` retorna todas as combinações possíveis de elementos de comprimento *r* do *iter* iterável. Ao contrário de :func:`~itertools.combinations`, elementos individuais podem ser repetidos nas combinações geradas::

source: Note that elements are treated as unique depending on their position in the input, not their actual values.
pt_br: Observe que os elementos são tratados como únicos dependendo de sua posição na entrada, não de seus valores reais.

source: The :func:`itertools.count` function now has a *step* argument that allows incrementing by values other than 1. :func:`~itertools.count` also now allows keyword arguments, and using non-integer values such as floats or :class:`~decimal.Decimal` instances. (Implemented by Raymond Hettinger; :issue:`5032`.)
pt_br: A função :func:`itertools.count` agora tem um argumento *step* que permite incrementar por valores diferentes de 1. :func:`~itertools.count` agora também permite argumentos nomeados e o uso de valores não inteiros, como floats ou :class:`~decimal.Decimal` instâncias. (Implementação de Raymond Hettinger; :issue:`5032`.)

source: :func:`itertools.combinations` and :func:`itertools.product` previously raised :exc:`ValueError` for values of *r* larger than the input iterable. This was deemed a specification error, so they now return an empty iterator. (Fixed by Raymond Hettinger; :issue:`4816`.)
pt_br: :func:`itertools.combinations` e :func:`itertools.product` anteriormente levantavam :exc:`ValueError` para valores de *r* maiores que o iterável de entrada. Isto foi considerado um erro de especificação, então agora elas retornam um iterador vazio. (Corrigido por Raymond Hettinger; :issue:`4816`.)

source: Updated module: The :mod:`json` module was upgraded to version 2.0.9 of the simplejson package, which includes a C extension that makes encoding and decoding faster. (Contributed by Bob Ippolito; :issue:`4136`.)
pt_br: Módulo atualizado: O módulo :mod:`json` foi atualizado para a versão 2.0.9 do pacote simplejson, que inclui uma extensão C que torna a codificação e decodificação mais rápidas. (Contribuição de Bob Ippolito; :issue:`4136`.)

source: To support the new :class:`collections.OrderedDict` type, :func:`json.load` now has an optional *object_pairs_hook* parameter that will be called with any object literal that decodes to a list of pairs. (Contributed by Raymond Hettinger; :issue:`5381`.)
pt_br: Para oferecer suporte ao novo tipo :class:`collections.OrderedDict`, :func:`json.load` agora tem um parâmetro opcional *object_pairs_hook* que será chamado com qualquer literal de objeto que decodifica para uma lista de pares. (Contribuição de Raymond Hettinger; :issue:`5381`.)

source: The :mod:`mailbox` module's :class:`~mailbox.Maildir` class now records the timestamp on the directories it reads, and only re-reads them if the modification time has subsequently changed. This improves performance by avoiding unneeded directory scans. (Fixed by A.M. Kuchling and Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)
pt_br: A classe :class:`~mailbox.Maildir` do módulo :mod:`mailbox` agora registra o registro de data e hora nos diretórios que lê, e apenas os relê se o horário de modificação for alterado posteriormente. Isso melhora o desempenho, evitando varreduras de diretório desnecessárias. (Corrigido por AM Kuchling e Antoine Pitrou; :issue:`1607951`, :issue:`6896`.)

source: New functions: the :mod:`math` module gained :func:`~math.erf` and :func:`~math.erfc` for the error function and the complementary error function, :func:`~math.expm1` which computes ``e**x - 1`` with more precision than using :func:`~math.exp` and subtracting 1, :func:`~math.gamma` for the Gamma function, and :func:`~math.lgamma` for the natural log of the Gamma function. (Contributed by Mark Dickinson and nirinA raseliarison; :issue:`3366`.)
pt_br: Novas funções: o módulo :mod:`math` ganhou :func:`~math.erf` e :func:`~math.erfc` para a função de erro e a função de erro complementar, :func:`~math.expm1` que calcula ``e**x - 1`` com mais precisão do que usar :func:`~math.exp` e subtrair 1, :func:`~math.gamma` para a função Gamma, e :func:`~math.lgamma` para o log natural da função Gamma. (Contribuição de Mark Dickinson e nirinA raseliarison; :issue:`3366`.)

source: The :mod:`multiprocessing` module's :class:`!Manager*` classes can now be passed a callable that will be called whenever a subprocess is started, along with a set of arguments that will be passed to the callable. (Contributed by lekma; :issue:`5585`.)
pt_br: As classes :class:`!Manager*` do módulo :mod:`multiprocessing` agora podem receber um chamável que será chamado sempre que um subprocesso for iniciado, junto com um conjunto de argumentos que serão passados para o chamável. (Contribuição de lekma; :issue:`5585`.)

source: The :class:`~multiprocessing.pool.Pool` class, which controls a pool of worker processes, now has an optional *maxtasksperchild* parameter. Worker processes will perform the specified number of tasks and then exit, causing the :class:`!Pool` to start a new worker. This is useful if tasks may leak memory or other resources, or if some tasks will cause the worker to become very large. (Contributed by Charles Cazabon; :issue:`6963`.)
pt_br: A classe :class:`~multiprocessing.pool.Pool`, que controla um conjunto de processos de trabalho, agora possui um parâmetro opcional *maxtasksperchild*. Os processos de trabalho executarão o número especificado de tarefas e então sairão, fazendo com que :class:`!Pool` inicie um novo trabalhador. Isso é útil se as tarefas puderem vazar memória ou outros recursos, ou se algumas tarefas fizerem com que o trabalho fique muito grande. (Contribuição de Charles Cazabon; :issue:`6963`.)

source: The :mod:`!nntplib` module now supports IPv6 addresses. (Contributed by Derek Morr; :issue:`1664`.)
pt_br: O módulo :mod:`!nntplib` agora oferece suporte para endereços IPv6. (Contribuição de Derek Morr; :issue:`1664`.)

source: New functions: the :mod:`os` module wraps the following POSIX system calls: :func:`~os.getresgid` and :func:`~os.getresuid`, which return the real, effective, and saved GIDs and UIDs; :func:`~os.setresgid` and :func:`~os.setresuid`, which set real, effective, and saved GIDs and UIDs to new values; :func:`~os.initgroups`, which initialize the group access list for the current process. (GID/UID functions contributed by Travis H.; :issue:`6508`. Support for initgroups added by Jean-Paul Calderone; :issue:`7333`.)
pt_br: Novas funções: o módulo :mod:`os` envolve as seguintes chamadas de sistema POSIX: :func:`~os.getresgid` e :func:`~os.getresuid`, que retornam os GIDs e UIDs reais, efetivos e salvos ; :func:`~os.setresgid` e :func:`~os.setresuid`, que definem GIDs e UIDs reais, efetivos e salvos para novos valores; :func:`~os.initgroups`, que inicializa a lista de acesso do grupo para o processo atual. (Funções GID/UID foram contribuição de Travis H.; :issue:`6508`. Suporte para initgroups adicionado por Jean-Paul Calderone; :issue:`7333`.)

source: The :func:`os.fork` function now re-initializes the import lock in the child process; this fixes problems on Solaris when :func:`~os.fork` is called from a thread. (Fixed by Zsolt Cserna; :issue:`7242`.)
pt_br: A função :func:`os.fork` agora reinicializa a trava de importação no processo filho; isso corrige problemas no Solaris quando :func:`~os.fork` é chamado de um thread. (Correção de Zsolt Cserna; :issue:`7242`.)

source: In the :mod:`os.path` module, the :func:`~os.path.normpath` and :func:`~os.path.abspath` functions now preserve Unicode; if their input path is a Unicode string, the return value is also a Unicode string. (:meth:`~os.path.normpath` fixed by Matt Giuca in :issue:`5827`; :meth:`~os.path.abspath` fixed by Ezio Melotti in :issue:`3426`.)
pt_br: No módulo :mod:`os.path`, as funções :func:`~os.path.normpath` e :func:`~os.path.abspath` agora preservam o Unicode; se o caminho de entrada for uma string Unicode, o valor de retorno também será uma string Unicode. (:meth:`~os.path.normpath` corrigido por Matt Giuca em :issue:`5827`; :meth:`~os.path.abspath` corrigido por Ezio Melotti em :issue:`3426`.)

source: The :mod:`pydoc` module now has help for the various symbols that Python uses. You can now do ``help('<<')`` or ``help('@')``, for example. (Contributed by David Laban; :issue:`4739`.)
pt_br: O módulo :mod:`pydoc` agora tem ajuda para os vários símbolos que o Python usa. Agora você pode fazer ``help('<<')`` ou ``help('@')``, por exemplo. (Contribuição de David Laban; :issue:`4739`.)

source: The :mod:`re` module's :func:`~re.split`, :func:`~re.sub`, and :func:`~re.subn` now accept an optional *flags* argument, for consistency with the other functions in the module. (Added by Gregory P. Smith.)
pt_br: Os módulos :mod:`re` :func:`~re.split`, :func:`~re.sub` e :func:`~re.subn` agora aceitam um argumento opcional *flags*, para consistência com as outras funções do módulo. (Adição de Gregory P. Smith.)

source: New function: :func:`~runpy.run_path` in the :mod:`runpy` module will execute the code at a provided *path* argument. *path* can be the path of a Python source file (:file:`example.py`), a compiled bytecode file (:file:`example.pyc`), a directory (:file:`./package/`), or a zip archive (:file:`example.zip`). If a directory or zip path is provided, it will be added to the front of ``sys.path`` and the module :mod:`__main__` will be imported. It's expected that the directory or zip contains a :file:`__main__.py`; if it doesn't, some other :file:`__main__.py` might be imported from a location later in ``sys.path``. This makes more of the machinery of :mod:`runpy` available to scripts that want to mimic the way Python's command line processes an explicit path name. (Added by Nick Coghlan; :issue:`6816`.)
pt_br: Nova função: :func:`~runpy.run_path` no módulo :mod:`runpy` executará o código em um argumento *path* fornecido. *path* pode ser o caminho de um arquivo fonte Python (:file:`example.py`), um arquivo de bytecode compilado (:file:`example.pyc`), um diretório (:file:`./package/`) ou um arquivo zip (:file:`example.zip`). Se um diretório ou zip path for fornecido, ele será adicionado na frente de ``sys.path`` e o módulo :mod:`__main__` será importado. É esperado que o diretório ou zip contenha um :file:`__main__.py`; caso contrário, algum outro :file:`__main__.py` poderá ser importado de um local posteriormente em ``sys.path``. Isso torna mais o maquinário de :mod:`runpy` disponível para scripts que desejam imitar a maneira como a linha de comando do Python processa um nome de caminho explícito. (Adição de Nick Coghlan; :issue:`6816`.)

source: New function: in the :mod:`shutil` module, :func:`~shutil.make_archive` takes a filename, archive type (zip or tar-format), and a directory path, and creates an archive containing the directory's contents. (Added by Tarek Ziadé.)
pt_br: Nova função: no módulo :mod:`shutil`, :func:`~shutil.make_archive` pega um nome de arquivo, tipo de arquivo (formato zip ou tar) e um caminho de diretório, e cria um arquivo contendo o conteúdo do diretório. (Adição de Tarek Ziadé.)

source: :mod:`shutil`'s :func:`~shutil.copyfile` and :func:`~shutil.copytree` functions now raise a :exc:`~shutil.SpecialFileError` exception when asked to copy a named pipe. Previously the code would treat named pipes like a regular file by opening them for reading, and this would block indefinitely. (Fixed by Antoine Pitrou; :issue:`3002`.)
pt_br: As funções :func:`~shutil.copyfile` e :func:`~shutil.copytree` de :mod:`shutil` agora levantam uma exceção :exc:`~shutil.SpecialFileError` quando solicitado a copiar um encadeamento nomeado. Anteriormente, o código trataria pipes nomeados como um arquivo normal, abrindo-os para leitura, e isso seria bloqueado indefinidamente. (Correção de Antoine Pitrou; :issue:`3002`.)

source: The :mod:`signal` module no longer re-installs the signal handler unless this is truly necessary, which fixes a bug that could make it impossible to catch the EINTR signal robustly. (Fixed by Charles-Francois Natali; :issue:`8354`.)
pt_br: O módulo :mod:`signal` não reinstala mais o manipulador de sinal a menos que isso seja realmente necessário, o que corrige um bug que poderia tornar impossível capturar o sinal EINTR de forma robusta. (Correção de Charles-François Natali; :issue:`8354`.)

source: New functions: in the :mod:`site` module, three new functions return various site- and user-specific paths. :func:`~site.getsitepackages` returns a list containing all global site-packages directories, :func:`~site.getusersitepackages` returns the path of the user's site-packages directory, and :func:`~site.getuserbase` returns the value of the :data:`~site.USER_BASE` environment variable, giving the path to a directory that can be used to store data. (Contributed by Tarek Ziadé; :issue:`6693`.)
pt_br: Novas funções: no módulo :mod:`site`, três novas funções retornam vários caminhos específicos do site e do usuário. :func:`~site.getsitepackages` retorna uma lista contendo todos os diretórios globais de pacotes de sites, :func:`~site.getusersitepackages` retorna o caminho do diretório de pacotes de sites do usuário e :func:`~site.getuserbase` retorna o valor da variável de ambiente :data:`~site.USER_BASE`, fornecendo o caminho para um diretório que pode ser usado para armazenar dados. (Contribuição de Tarek Ziadé; :issue:`6693`.)

source: The :mod:`site` module now reports exceptions occurring when the :mod:`sitecustomize` module is imported, and will no longer catch and swallow the :exc:`KeyboardInterrupt` exception. (Fixed by Victor Stinner; :issue:`3137`.)
pt_br: O módulo :mod:`site` agora reporta exceções que ocorrem quando o módulo :mod:`sitecustomize` é importado, e não irá mais capturar e engolir a exceção :exc:`KeyboardInterrupt`. (Correção de Victor Stinner; :issue:`3137`.)

source: The :func:`~socket.create_connection` function gained a *source_address* parameter, a ``(host, port)`` 2-tuple giving the source address that will be used for the connection. (Contributed by Eldon Ziegler; :issue:`3972`.)
pt_br: A função :func:`~socket.create_connection` ganhou um parâmetro *source_address*, uma tupla de 2 elementos ``(host, port)`` fornecendo o endereço de origem que será usado para a conexão. (Contribuição de Eldon Ziegler; :issue:`3972`.)

source: The :meth:`~socket.socket.recv_into` and :meth:`~socket.socket.recvfrom_into` methods will now write into objects that support the buffer API, most usefully the :class:`bytearray` and :class:`memoryview` objects. (Implemented by Antoine Pitrou; :issue:`8104`.)
pt_br: Os métodos :meth:`~socket.socket.recv_into` e :meth:`~socket.socket.recvfrom_into` agora escreverão em objetos que oferecem suporte à API de buffer, mais utilmente objetos :class:`bytearray` e :class:`memoryview`. (Implementação de Antoine Pitrou; :issue:`8104`.)

source: The :mod:`SocketServer <socketserver>` module's :class:`~socketserver.TCPServer` class now supports socket timeouts and disabling the Nagle algorithm. The :attr:`!disable_nagle_algorithm` class attribute defaults to ``False``; if overridden to be true, new request connections will have the TCP_NODELAY option set to prevent buffering many small sends into a single TCP packet. The :attr:`~socketserver.BaseServer.timeout` class attribute can hold a timeout in seconds that will be applied to the request socket; if no request is received within that time, :meth:`~socketserver.BaseServer.handle_timeout` will be called and :meth:`~socketserver.BaseServer.handle_request` will return. (Contributed by Kristján Valur Jónsson; :issue:`6192` and :issue:`6267`.)
pt_br: A classe :class:`~socketserver.TCPServer` do módulo :mod:`SocketServer <socketserver>` agora oferece suporte a limite de tempo de soquete e desativação do algoritmo Nagle. O atributo de classe :attr:`!disable_nagle_algorithm` é padronizado como ``False``; se substituído como verdadeiro, novas conexões de solicitação terão a opção TCP_NODELAY definida para evitar o armazenamento em buffer de muitos envios pequenos em um único pacote TCP. O atributo de classe :attr:`~socketserver.BaseServer.timeout` pode conter um tempo limite em segundos que será aplicado ao soquete de solicitação; se nenhuma solicitação for recebida dentro desse tempo, :meth:`~socketserver.BaseServer.handle_timeout` será chamado e :meth:`~socketserver.BaseServer.handle_request` retornará. (Contribuição de Kristján Valur Jónsson; :issue:`6192` e :issue:`6267`.)

source: Updated module: the :mod:`sqlite3` module has been updated to version 2.6.0 of the `pysqlite package <https://github.com/ghaering/pysqlite>`__. Version 2.6.0 includes a number of bugfixes, and adds the ability to load SQLite extensions from shared libraries. Call the ``enable_load_extension(True)`` method to enable extensions, and then call :meth:`~sqlite3.Connection.load_extension` to load a particular shared library. (Updated by Gerhard Häring.)
pt_br: Módulo atualizado: o módulo :mod:`sqlite3` foi atualizado para a versão 2.6.0 do pacote `pysqlite <https://github.com/ghaering/pysqlite>`__. A versão 2.6.0 inclui uma série de correções de bugs e adiciona a capacidade de carregar extensões SQLite de bibliotecas compartilhadas. Chame o método ``enable_load_extension(True)`` para habilitar extensões, e então chame :meth:`~sqlite3.Connection.load_extension` para carregar uma biblioteca compartilhada específica. (Atualização de Gerhard Häring.)

source: The :mod:`ssl` module's :class:`~ssl.SSLSocket` objects now support the buffer API, which fixed a test suite failure (fix by Antoine Pitrou; :issue:`7133`) and automatically set OpenSSL's :c:macro:`!SSL_MODE_AUTO_RETRY`, which will prevent an error code being returned from :meth:`!recv` operations that trigger an SSL renegotiation (fix by Antoine Pitrou; :issue:`8222`).
pt_br: Os objetos :class:`~ssl.SSLSocket` do módulo :mod:`ssl` agora oferecem suporte à API de buffer, que corrigiu uma falha no conjunto de testes (correção por Antoine Pitrou; :issue:`7133`) e definiu automaticamente o :c:macro:`!SSL_MODE_AUTO_RETRY` do OpenSSL, o que impedirá que um código de erro seja retornado de operações :meth:`!recv` que acionam uma renegociação SSL (correção por Antoine Pitrou; :issue:`8222`).

source: The :func:`~ssl.SSLContext.wrap_socket` constructor function now takes a *ciphers* argument that's a string listing the encryption algorithms to be allowed; the format of the string is described `in the OpenSSL documentation <https://docs.openssl.org/1.0.2/man1/ciphers/>`__. (Added by Antoine Pitrou; :issue:`8322`.)
pt_br: A função construtora :func:`~ssl.SSLContext.wrap_socket` agora recebe um argumento *ciphers* que é uma string listando os algoritmos de criptografia a serem permitidos; o formato da string é descrito `na documentação do OpenSSL <https://docs.openssl.org/1.0.2/man1/ciphers/>`__. (Adição de Antoine Pitrou; :issue:`8322`.)

source: Another change makes the extension load all of OpenSSL's ciphers and digest algorithms so that they're all available. Some SSL certificates couldn't be verified, reporting an "unknown algorithm" error. (Reported by Beda Kosata, and fixed by Antoine Pitrou; :issue:`8484`.)
pt_br: Outra mudança faz com que a extensão carregue todas as cifras e algoritmos de resumo do OpenSSL para que estejam todos disponíveis. Não foi possível verificar alguns certificados SSL, reportando um erro de "algoritmo desconhecido". (Relato de Beda Kosata e correção de Antoine Pitrou; :issue:`8484`.)
