Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: By default, the commands ``pip``, ``pipX`` and ``pipX.Y`` will be installed on all platforms (where X.Y stands for the version of the Python installation), along with the ``pip`` Python package and its dependencies.
pt_br: Por padrão, os comandos ``pip``, ``pipX`` e ``pipX.Y`` serão instalados em todas as plataformas (onde X.Y representa a versão da instalação do Python), junto com o pacote Python via ``pip`` e suas dependências.

source: For CPython :ref:`source builds on POSIX systems <building-python-on-unix>`, the ``make install`` and ``make altinstall`` commands do not bootstrap ``pip`` by default. This behaviour can be controlled through configure options, and overridden through Makefile options.
pt_br: Para :ref:`construções de fontes do CPython em sistemas POSIX <building-python-on-unix>`, os comandos ``make install`` e ``make altinstall`` não inicializam ``pip`` por padrão. Este comportamento pode ser controlado através de opções de configuração e substituído através de opções do Makefile.

source: On Windows and Mac OS X, the CPython installers now default to installing ``pip`` along with CPython itself (users may opt out of installing it during the installation process). Window users will need to opt in to the automatic ``PATH`` modifications to have ``pip`` available from the command line by default, otherwise it can still be accessed through the Python launcher for Windows as ``py -m pip``.
pt_br: No Windows e Mac OS X, os instaladores do CPython agora instalam o ``pip`` junto com o próprio CPython (os usuários podem optar por não instalá-lo durante o processo de instalação). Os usuários do Windows precisarão optar pelas modificações automáticas do ``PATH`` para ter o ``pip`` disponível na linha de comando por padrão, caso contrário ele ainda poderá ser acessado através do iniciador Python para Windows como ``py -m pip``.

source: As :pep:`discussed in the PEP <0477#disabling-ensurepip-by-downstream-distributors>`, platform packagers may choose not to install these commands by default, as long as, when invoked, they provide clear and simple directions on how to install them on that platform (usually using the system package manager).
pt_br: Como :pep:`discutido na PEP <0477#disabling-ensurepip-by-downstream-distributors>`, os empacotadores de plataforma podem optar por não instalar estes comandos por padrão, desde que, quando invocados, forneçam instruções claras e simples sobre como instalá-los naquela plataforma (geralmente usando o gerenciador de pacotes do sistema). .

source: Documentation Changes
pt_br: Mudanças na documentação

source: As part of this change, the :ref:`installing-index` and :ref:`distributing-index` sections of the documentation have been completely redesigned as short getting started and FAQ documents. Most packaging documentation has now been moved out to the Python Packaging Authority maintained `Python Packaging User Guide <https://packaging.python.org>`__ and the documentation of the individual projects.
pt_br: Como parte desta mudança, as seções :ref:`installing-index` e :ref:`distributing-index` da documentação foram completamente redesenhadas como breves documentos de introdução e FAQ. A maior parte da documentação de empacotamento agora foi transferida para o Python Packaging Authority, mantido no `Guia de Usuário para Empacotamento de Python <https://packaging.python.org>`__ e na documentação dos projetos individuais.

source: However, as this migration is currently still incomplete, the legacy versions of those guides remaining available as :ref:`install-index` and :ref:`setuptools-index`.
pt_br: No entanto, como esta migração ainda está incompleta, as versões legadas desses guias permanecem disponíveis como :ref:`install-index` e :ref:`setuptools-index`.

source: :pep:`453` -- Explicit bootstrapping of pip in Python installations
pt_br: :pep:`453` -- Inicialização explícita do pip em instalações Python

source: PEP written by Donald Stufft and Nick Coghlan, implemented by Donald Stufft, Nick Coghlan, Martin von Löwis and Ned Deily.
pt_br: PEP escrita por Donald Stufft e Nick Coghlan, implementada por Donald Stufft, Nick Coghlan, Martin von Löwis e Ned Deily.

source: PEP 476: Enabling certificate verification by default for stdlib http clients
pt_br: PEP 476: Habilitando verificação de certificado por padrão para clientes http stdlib

source: :pep:`476` updated :mod:`httplib <http>` and modules which use it, such as :mod:`urllib2 <urllib.request>` and :mod:`xmlrpclib <xmlrpc.client>`, to now verify that the server presents a certificate which is signed by a Certificate Authority in the platform trust store and whose hostname matches the hostname being requested by default, significantly improving security for many applications. This change was made in the Python 2.7.9 release.
pt_br: :pep:`476` atualizou :mod:`httplib <http>` e módulos que o utilizam, como :mod:`urllib2 <urllib.request>` e :mod:`xmlrpclib <xmlrpc.client>`, para agora verificar se o servidor apresenta um certificado que é assinado por uma Autoridade Certificadora no armazenamento confiável da plataforma e cujo nome de host corresponde ao nome de host solicitado por padrão, melhorando significativamente a segurança para muitas aplicações. Essa alteração foi feita na versão 2.7.9 do Python.

source: For applications which require the old previous behavior, they can pass an alternate context::
pt_br: Para aplicações que exigem o antigo comportamento anterior, elas podem passar um contexto alternativo::

source: import urllib2 import ssl # This disables all verification context = ssl._create_unverified_context() # This allows using a specific certificate for the host, which doesn't need # to be in the trust store context = ssl.create_default_context(cafile="/path/to/file.crt") urllib2.urlopen("https://invalid-cert", context=context)
pt_br: import urllib2 import ssl # Isso desabilita toda verificação context = ssl._create_unverified_context() # Isso permite usar um certificado específico para o host, # o que não precisa ser no armazenamento de confiança context = ssl.create_default_context(cafile="/path/to/file.crt") urllib2.urlopen("https://invalid-cert", context=context)

source: PEP 493: HTTPS verification migration tools for Python 2.7
pt_br: PEP 493: Ferramentas de migração de verificação HTTPS para Python 2.7

source: :pep:`493` provides additional migration tools to support a more incremental infrastructure upgrade process for environments containing applications and services relying on the historically permissive processing of server certificates when establishing client HTTPS connections. These additions were made in the Python 2.7.12 release.
pt_br: :pep:`493` fornece ferramentas de migração adicionais para provê um processo de atualização de infraestrutura mais incremental para ambientes contendo aplicações e serviços que dependem do processamento historicamente permissivo de certificados de servidor ao estabelecer conexões HTTPS de clientes. Essas adições foram feitas na versão 2.7.12 do Python.

source: These tools are intended for use in cases where affected applications and services can't be modified to explicitly pass a more permissive SSL context when establishing the connection.
pt_br: Estas ferramentas destinam-se a ser utilizadas em casos em que as aplicações e serviços afetados não podem ser modificados para passar explicitamente um contexto SSL mais permissivo ao estabelecer a ligação.

source: For applications and services which can't be modified at all, the new ``PYTHONHTTPSVERIFY`` environment variable may be set to ``0`` to revert an entire Python process back to the default permissive behaviour of Python 2.7.8 and earlier.
pt_br: Para aplicações e serviços que não podem ser modificados, a nova variável de ambiente ``PYTHONHTTPSVERIFY`` pode ser definida como ``0`` para reverter todo um processo Python de volta ao comportamento permissivo padrão do Python 2.7.8 e anteriores.

source: For cases where the connection establishment code can't be modified, but the overall application can be, the new :func:`!ssl._https_verify_certificates` function can be used to adjust the default behaviour at runtime.
pt_br: Para casos em que o código de estabelecimento da conexão não pode ser modificado, mas a aplicação geral pode, a nova função :func:`!ssl._https_verify_certificates` pode ser usada para ajustar o comportamento padrão em tempo de execução.

source: New ``make regen-all`` build target
pt_br: Novo alvo de construção ``make regen-all``

source: To simplify cross-compilation, and to ensure that CPython can reliably be compiled without requiring an existing version of Python to already be available, the autotools-based build system no longer attempts to implicitly recompile generated files based on file modification times.
pt_br: Para simplificar a compilação cruzada e garantir que o CPython possa ser compilado de forma confiável sem exigir que uma versão existente do Python já esteja disponível, o sistema de construção baseado em autotools não tenta mais recompilar implicitamente os arquivos gerados com base nos tempos de modificação dos arquivos.

source: Instead, a new ``make regen-all`` command has been added to force regeneration of these files when desired (e.g. after an initial version of Python has already been built based on the pregenerated versions).
pt_br: Em vez disso, um novo comando ``make regen-all`` foi adicionado para forçar a regeneração desses arquivos quando desejado (por exemplo, após uma versão inicial do Python já ter sido construída com base nas versões pré-geradas).

source: More selective regeneration targets are also defined - see :source:`Makefile.pre.in` for details.
pt_br: Alvos de regeneração mais seletivos também são definidos -- veja :source:`Makefile.pre.in` para detalhes.

source: (Contributed by Victor Stinner in :issue:`23404`.)
pt_br: (Contribuição de Victor Stinner em :issue:`23404`.)

source: Removal of ``make touch`` build target
pt_br: Remoção do alvo de construção ``make touch``

source: The ``make touch`` build target previously used to request implicit regeneration of generated files by updating their modification times has been removed.
pt_br: O alvo de construção ``make touch`` usado anteriormente para solicitar regeneração implícita de arquivos gerados atualizando seus tempos de modificação foi removido.

source: It has been replaced by the new ``make regen-all`` target.
pt_br: Ele foi substituído pelo novo alvo ``make regen-all``.

source: Acknowledgements
pt_br: Reconhecimentos

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Nick Coghlan, Philip Jenvey, Ryan Lovett, R. David Murray, Hugh Secker-Walker.
pt_br: O autor gostaria de agradecer às seguintes pessoas por oferecerem sugestões, correções e assistência com vários rascunhos deste artigo: Nick Coghlan, Philip Jenvey, Ryan Lovett, R. David Murray, Hugh Secker-Walker.
