Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: The :func:`os.kill` function now works on Windows. The signal value can be the constants :const:`~signal.CTRL_C_EVENT`, :const:`~signal.CTRL_BREAK_EVENT`, or any integer. The first two constants will send :kbd:`Control-C` and :kbd:`Control-Break` keystroke events to subprocesses; any other value will use the :c:func:`!TerminateProcess` API. (Contributed by Miki Tebeka; :issue:`1220212`.)
pt_br: A função :func:`os.kill` agora funciona no Windows. O valor do sinal pode ser as constantes :const:`~signal.CTRL_C_EVENT`, :const:`~signal.CTRL_BREAK_EVENT` ou qualquer número inteiro. As duas primeiras constantes enviarão eventos de pressionamento de tecla :kbd:`Control-C` e :kbd:`Control-Break` para subprocessos; qualquer outro valor usará a API :c:func:`!TerminateProcess`. (Contribuição de Miki Tebeka; :issue:`1220212`.)

source: The :func:`os.listdir` function now correctly fails for an empty path. (Fixed by Hirokazu Yamamoto; :issue:`5913`.)
pt_br: A função :func:`os.listdir` agora falha corretamente para um caminho vazio. (Correção de Hirokazu Yamamoto; :issue:`5913`.)

source: The :mod:`mimetypes` module will now read the MIME database from the Windows registry when initializing. (Patch by Gabriel Genellina; :issue:`4969`.)
pt_br: O módulo :mod:`mimetypes` agora irá ler o banco de dados MIME do registro do Windows ao inicializar. (Patch de Gabriel Genellina; :issue:`4969`.)

source: Port-Specific Changes: Mac OS X
pt_br: Alterações específicas da porta: Mac OS X

source: The path ``/Library/Python/2.7/site-packages`` is now appended to ``sys.path``, in order to share added packages between the system installation and a user-installed copy of the same version. (Changed by Ronald Oussoren; :issue:`4865`.)
pt_br: O caminho ``/Library/Python/2.7/site-packages`` agora é anexado a ``sys.path``, para compartilhar pacotes adicionados entre a instalação do sistema e uma cópia da mesma versão instalada pelo usuário. (Alteração de Ronald Oussoren; :issue:`4865`.)

source: As of 2.7.13, this change was removed. ``/Library/Python/2.7/site-packages``, the site-packages directory used by the Apple-supplied system Python 2.7 is no longer appended to ``sys.path`` for user-installed Pythons such as from the python.org installers. As of macOS 10.12, Apple changed how the system site-packages directory is configured, which could cause installation of pip components, like setuptools, to fail. Packages installed for the system Python will no longer be shared with user-installed Pythons. (:issue:`28440`)
pt_br: A partir da versão 2.7.13, esta alteração foi removida. ``/Library/Python/2.7/site-packages``, o diretório site-packages usado pelo sistema Python 2.7 fornecido pela Apple não é mais anexado a ``sys.path`` para Pythons instalados pelo usuário, como do Instaladores do python.org. A partir do macOS 10.12, a Apple mudou a forma como o diretório site-packages do sistema é configurado, o que pode causar falha na instalação de componentes pip, como setuptools. Os pacotes instalados para o sistema Python não serão mais compartilhados com Pythons instalados pelo usuário. ( :issue:`28440`)

source: Port-Specific Changes: FreeBSD
pt_br: Alterações específicas da porta: FreeBSD

source: FreeBSD 7.1's :const:`!SO_SETFIB` constant, used with the :func:`~socket.socket` methods :func:`~socket.socket.getsockopt`/:func:`~socket.socket.setsockopt` to select an alternate routing table, is now available in the :mod:`socket` module. (Added by Kyle VanderBeek; :issue:`8235`.)
pt_br: Constante :const:`!SO_SETFIB` do FreeBSD 7.1, usada com os métodos :func:`~socket.socket.getsockopt` e :func:`~socket.socket.setsockopt` do :func:`~socket.socket` para selecionar uma tabela de roteamento alternativa, agora está disponível no módulo :mod:`socket`. (Adição de Kyle VanderBeek; :issue:`8235`.)

source: Other Changes and Fixes
pt_br: Outras alterações e correções

source: Two benchmark scripts, :file:`iobench` and :file:`ccbench`, were added to the :file:`Tools` directory. :file:`iobench` measures the speed of the built-in file I/O objects returned by :func:`open` while performing various operations, and :file:`ccbench` is a concurrency benchmark that tries to measure computing throughput, thread switching latency, and IO processing bandwidth when performing several tasks using a varying number of threads.
pt_br: Dois scripts de benchmark, :file:`iobench` e :file:`ccbench`, foram adicionados ao diretório :file:`Tools`. :file:`iobench` mede a velocidade dos objetos embutidos de E/S de arquivo retornados por :func:`open` durante a execução de várias operações, e :file:`ccbench` é um benchmark de simultaneidade que tenta medir o rendimento da computação, latência de comutação de threads e largura de banda de processamento de E/S ao executar diversas tarefas usando um número variável de threads.

source: The :file:`Tools/i18n/msgfmt.py` script now understands plural forms in :file:`.po` files. (Fixed by Martin von Löwis; :issue:`5464`.)
pt_br: O script :file:`Tools/i18n/msgfmt.py` agora entende formas plurais em arquivos :file:`.po`. (Correção de Martin von Löwis; :issue:`5464`.)

source: When importing a module from a :file:`.pyc` or :file:`.pyo` file with an existing :file:`.py` counterpart, the :attr:`~codeobject.co_filename` attributes of the resulting code objects are overwritten when the original filename is obsolete. This can happen if the file has been renamed, moved, or is accessed through different paths. (Patch by Ziga Seilnacht and Jean-Paul Calderone; :issue:`1180193`.)
pt_br: Ao importar um módulo de um arquivo :file:`.pyc` ou :file:`.pyo` com uma contraparte :file:`.py` existente, os atributos :attr:`~codeobject.co_filename` dos objetos código resultantes são substituídos quando o nome do arquivo original fica obsoleto. Isso pode acontecer se o arquivo tiver sido renomeado, movido ou acessado por caminhos diferentes. (Patch de Ziga Seilnacht e Jean-Paul Calderone; :issue:`1180193`.)

source: The :file:`regrtest.py` script now takes a :option:`!--randseed=` switch that takes an integer that will be used as the random seed for the :option:`!-r` option that executes tests in random order. The :option:`!-r` option also reports the seed that was used (Added by Collin Winter.)
pt_br: O script :file:`regrtest.py` agora usa uma opção :option:`!--randseed=` que recebe um número inteiro que será usado como semente aleatória para a opção :option:`!-r` que executa testes em ordem aleatória. A opção :option:`!-r` também informa a semente que foi usada (Adição de Collin Winter.)

source: Another :file:`regrtest.py` switch is :option:`!-j`, which takes an integer specifying how many tests run in parallel. This allows reducing the total runtime on multi-core machines. This option is compatible with several other options, including the :option:`!-R` switch which is known to produce long runtimes. (Added by Antoine Pitrou, :issue:`6152`.) This can also be used with a new :option:`!-F` switch that runs selected tests in a loop until they fail. (Added by Antoine Pitrou; :issue:`7312`.)
pt_br: Outra opção :file:`regrtest.py` é :option:`!-j`, que recebe um número inteiro especificando quantos testes são executados em paralelo. Isto permite reduzir o tempo total de execução em máquinas com vários núcleos. Esta opção é compatível com várias outras opções, incluindo a opção :option:`!-R` que é conhecida por produzir longos tempos de execução. (Adicionado por Antoine Pitrou, :issue:`6152`.) Isso também pode ser usado com uma nova opção :option:`!-F` que executa testes selecionados em um loop até que eles falhem. (Adição de Antoine Pitrou; :issue:`7312`.)

source: When executed as a script, the :file:`py_compile.py` module now accepts ``'-'`` as an argument, which will read standard input for the list of filenames to be compiled. (Contributed by Piotr Ożarowski; :issue:`8233`.)
pt_br: Quando executado como um script, o módulo :file:`py_compile.py` agora aceita ``'-'`` como argumento, que lerá a entrada padrão para a lista de nomes de arquivos a serem compilados. (Contribuição de Piotr Ożarowski; :issue:`8233`.)

source: Porting to Python 2.7
pt_br: Portando para Python 2.7

source: This section lists previously described changes and other bugfixes that may require changes to your code:
pt_br: Esta seção lista as alterações descritas anteriormente e outras correções de bugs que podem exigir alterações em seu código:

source: The :func:`range` function processes its arguments more consistently; it will now call :meth:`~object.__int__` on non-float, non-integer arguments that are supplied to it. (Fixed by Alexander Belopolsky; :issue:`1533`.)
pt_br: A função :func:`range` processa seus argumentos de forma mais consistente; agora ele chamará :meth:`~object.__int__` em argumentos que não são ponto flutuantes nem inteiros que são fornecidos a ele. (Correção de Alexander Belopolsky; :issue:`1533`.)

source: The string :meth:`format` method changed the default precision used for floating-point and complex numbers from 6 decimal places to 12, which matches the precision used by :func:`str`. (Changed by Eric Smith; :issue:`5920`.)
pt_br: O método string :meth:`format` alterou a precisão padrão usada para números de ponto flutuante e complexos de 6 casas decimais para 12, o que corresponde à precisão usada por :func:`str`. (Alteração de Eric Smith; :issue:`5920`.)

source: Because of an optimization for the :keyword:`with` statement, the special methods :meth:`~object.__enter__` and :meth:`~object.__exit__` must belong to the object's type, and cannot be directly attached to the object's instance. This affects new-style classes (derived from :class:`object`) and C extension types. (:issue:`6101`.)
pt_br: Por causa de uma otimização para a instrução :keyword:`with`, os métodos especiais :meth:`~object.__enter__` e :meth:`~object.__exit__` devem pertencer ao tipo do objeto e não podem ser diretamente anexados ao instância do objeto. Isto afeta classes de novo estilo (derivadas de :class:`object`) e tipos de extensão C. (:issue:`6101`.)

source: Due to a bug in Python 2.6, the *exc_value* parameter to :meth:`~object.__exit__` methods was often the string representation of the exception, not an instance. This was fixed in 2.7, so *exc_value* will be an instance as expected. (Fixed by Florent Xicluna; :issue:`7853`.)
pt_br: Devido a um bug no Python 2.6, o parâmetro *exc_value* para os métodos :meth:`~object.__exit__` era frequentemente a representação de string da exceção, não uma instância. Isso foi corrigido na versão 2.7, então *exc_value* será uma instância conforme esperado. (Correção de Florent Xicluna; :issue:`7853`.)

source: In the standard library:
pt_br: Na biblioteca padrão:

source: Operations with :class:`~datetime.datetime` instances that resulted in a year falling outside the supported range didn't always raise :exc:`OverflowError`. Such errors are now checked more carefully and will now raise the exception. (Reported by Mark Leander, patch by Anand B. Pillai and Alexander Belopolsky; :issue:`7150`.)
pt_br: Operações com instâncias :class:`~datetime.datetime` que resultaram em um ano fora do intervalo suportado nem sempre levantam :exc:`OverflowError`. Esses erros agora são verificados com mais cuidado e irão levantar a exceção. (Relato de Mark Leander, patch de Anand B. Pillai e Alexander Belopolsky; :issue:`7150`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which might change the output of your programs. (Changed by Mark Dickinson; :issue:`6857`.)
pt_br: Ao usar instâncias :class:`~decimal.Decimal` com o método :meth:`format` de uma string, o alinhamento padrão era anteriormente o alinhamento à esquerda. Isso foi alterado para alinhamento à direita, o que pode alterar a saída dos seus programas. (Alteração de Mark Dickinson; :issue:`6857`.)

source: The :mod:`xml.etree.ElementTree` library no longer escapes ampersands and angle brackets when outputting an XML processing instruction (which looks like ``<?xml-stylesheet href="#style1"?>``) or comment (which looks like ``<!-- comment -->``). (Patch by Neil Muller; :issue:`2746`.)
pt_br: A biblioteca :mod:`xml.etree.ElementTree` não escapa mais os caracteres de e-comercial e colchetes angulares ao gerar uma instrução de processamento XML (que se parece com ``<?xml-stylesheet href="#style1"?>``) ou comentário ( que se parece com ``<!-- comment -->``). (Patch de Neil Muller; :issue:`2746`.)

source: The :meth:`!readline` method of :class:`~io.StringIO` objects now does nothing when a negative length is requested, as other file-like objects do. (:issue:`7348`).
pt_br: O método :meth:`!readline` dos objetos :class:`~io.StringIO` agora não faz nada quando um comprimento negativo é solicitado, como fazem outros objetos arquivo ou similares. (:issue:`7348`).

source: For C extensions:
pt_br: Para extensões C:

source: C extensions that use integer format codes with the ``PyArg_Parse*`` family of functions will now raise a :exc:`TypeError` exception instead of triggering a :exc:`DeprecationWarning` (:issue:`5080`).
pt_br: Extensões C que usam códigos de formato inteiro com a família de funções ``PyArg_Parse*`` agora levantarão uma exceção :exc:`TypeError` em vez de disparar uma :exc:`DeprecationWarning` (:issue:`5080`).

source: Use the new :c:func:`PyOS_string_to_double` function instead of the old :c:func:`!PyOS_ascii_strtod` and :c:func:`!PyOS_ascii_atof` functions, which are now deprecated.
pt_br: Use a nova função :c:func:`PyOS_string_to_double` em vez das antigas funções :c:func:`!PyOS_ascii_strtod` e :c:func:`!PyOS_ascii_atof`, que agora estão descontinuadas.

source: For applications that embed Python:
pt_br: Para aplicações que incorporam Python:

source: The :c:func:`!PySys_SetArgvEx` function was added, letting applications close a security hole when the existing :c:func:`!PySys_SetArgv` function was used. Check whether you're calling :c:func:`!PySys_SetArgv` and carefully consider whether the application should be using :c:func:`!PySys_SetArgvEx` with *updatepath* set to false.
pt_br: A função :c:func:`!PySys_SetArgvEx` foi adicionada, permitindo que aplicativos fechem uma falha de segurança quando a função :c:func:`!PySys_SetArgv` existente for usada. Verifique se você está chamando :c:func:`!PySys_SetArgv` e considere cuidadosamente se a aplicação deve usar :c:func:`!PySys_SetArgvEx` com *updatepath* definido como falso.

source: New Features Added to Python 2.7 Maintenance Releases
pt_br: Novos recursos adicionados às versões de manutenção do Python 2.7

source: New features may be added to Python 2.7 maintenance releases when the situation genuinely calls for it. Any such additions must go through the Python Enhancement Proposal process, and make a compelling case for why they can't be adequately addressed by either adding the new feature solely to Python 3, or else by publishing it on the Python Package Index.
pt_br: Novos recursos podem ser adicionados às versões de manutenção do Python 2.7 quando a situação realmente exigir. Quaisquer adições devem passar pelo processo de proposta de melhoria do Python, ou em inglês Python Enhancement Proposal -- PEP, e apresentar um argumento convincente sobre por que não podem ser abordadas adequadamente adicionando o novo recurso apenas ao Python 3 ou publicando-o no Python Package Index.

source: In addition to the specific proposals listed below, there is a general exemption allowing new ``-3`` warnings to be added in any Python 2.7 maintenance release.
pt_br: Além das propostas específicas listadas abaixo, há uma isenção geral que permite que novos avisos ``-3`` sejam adicionados em qualquer versão de manutenção do Python 2.7.

source: Two new environment variables for debug mode
pt_br: Duas novas variáveis de ambiente para modo de depuração

source: In debug mode, the ``[xxx refs]`` statistic is not written by default, the :envvar:`!PYTHONSHOWREFCOUNT` environment variable now must also be set. (Contributed by Victor Stinner; :issue:`31733`.)
pt_br: No modo de depuração, a estatística ``[xxx refs]`` não é escrita por padrão, a variável de ambiente :envvar:`!PYTHONSHOWREFCOUNT` agora também deve ser definida. (Contribuição de Victor Stinner; :issue:`31733`.)

source: When Python is compiled with ``COUNT_ALLOC`` defined, allocation counts are no longer dumped by default anymore: the :envvar:`!PYTHONSHOWALLOCCOUNT` environment variable must now also be set. Moreover, allocation counts are now dumped into stderr, rather than stdout. (Contributed by Victor Stinner; :issue:`31692`.)
pt_br: Quando Python é compilado com ``COUNT_ALLOC`` definido, as contagens de alocação não são mais despejadas por padrão: a variável de ambiente :envvar:`!PYTHONSHOWALLOCCOUNT` agora também deve ser definida. Além disso, as contagens de alocação agora são despejadas no stderr, em vez do stdout. (Contribuição de Victor Stinner; :issue:`31692`.)

source: PEP 434: IDLE Enhancement Exception for All Branches
pt_br: PEP 434: Exceção de aprimoramento do IDLE para todos os branches

source: :pep:`434` describes a general exemption for changes made to the IDLE development environment shipped along with Python. This exemption makes it possible for the IDLE developers to provide a more consistent user experience across all supported versions of Python 2 and 3.
pt_br: :pep:`434` descreve uma isenção geral para alterações feitas no ambiente de desenvolvimento IDLE enviado junto com o Python. Esta isenção permite que os desenvolvedores de IDLE forneçam uma experiência de usuário mais consistente em todas as versões suportadas do Python 2 e 3.

source: For details of any IDLE changes, refer to the NEWS file for the specific release.
pt_br: Para obter detalhes sobre quaisquer alterações do IDLE, consulte o arquivo NEWS da versão específica.

source: PEP 466: Network Security Enhancements for Python 2.7
pt_br: PEP 466: Aprimoramentos de segurança de rede do Python 2.7

source: :pep:`466` describes a number of network security enhancement proposals that have been approved for inclusion in Python 2.7 maintenance releases, with the first of those changes appearing in the Python 2.7.7 release.
pt_br: :pep:`466` descreve uma série de propostas de melhoria de segurança de rede que foram aprovadas para inclusão nas versões de manutenção do Python 2.7, com a primeira dessas mudanças aparecendo na versão Python 2.7.7.

source: :pep:`466` related features added in Python 2.7.7:
pt_br: Recursos relacionados a :pep:`466` adicionados no Python 2.7.7:

source: :func:`hmac.compare_digest` was backported from Python 3 to make a timing attack resistant comparison operation available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21306`.)
pt_br: :func:`hmac.compare_digest` foi portado do Python 3 para disponibilizar uma operação de comparação resistente a ataques de tempo para aplicações em Python 2. (Contribuição de Alex Gaynor; :issue:`21306`.)

source: OpenSSL 1.0.1g was upgraded in the official Windows installers published on python.org. (Contributed by Zachary Ware; :issue:`21462`.)
pt_br: OpenSSL 1.0.1g foi atualizado nos instaladores oficiais do Windows publicados em python.org. (Contribuição de Zachary Ware; :issue:`21462`.)

source: :pep:`466` related features added in Python 2.7.8:
pt_br: Recursos relacionados a :pep:`466` adicionados no Python 2.7.8:

source: :func:`hashlib.pbkdf2_hmac` was backported from Python 3 to make a hashing algorithm suitable for secure password storage broadly available to Python 2 applications. (Contributed by Alex Gaynor; :issue:`21304`.)
pt_br: :func:`hashlib.pbkdf2_hmac` foi portado do Python 3 para tornar um algoritmo de hash adequado para armazenamento seguro de senhas amplamente disponível para aplicações Python 2. (Contribuição de Alex Gaynor; :issue:`21304`.)

source: OpenSSL 1.0.1h was upgraded for the official Windows installers published on python.org. (Contributed by Zachary Ware in :issue:`21671` for :cve:`2014-0224`.)
pt_br: OpenSSL 1.0.1h foi atualizado para os instaladores oficiais do Windows publicados em python.org. (Contribuição de Zachary Ware em :issue:`21671` para :cve:`2014-0224`.)

source: :pep:`466` related features added in Python 2.7.9:
pt_br: Recursos relacionados a :pep:`466` adicionados no Python 2.7.9:

source: Most of Python 3.4's :mod:`ssl` module was backported. This means :mod:`ssl` now supports Server Name Indication, TLS1.x settings, access to the platform certificate store, the :class:`~ssl.SSLContext` class, and other features. (Contributed by Alex Gaynor and David Reid; :issue:`21308`.)
pt_br: A maior parte do módulo :mod:`ssl` do Python 3.4 foi portada. Isso significa que :mod:`ssl` agora provê suporte a indicar de nome de servidor, configurações TLS1.x, acesso ao armazenamento de certificados da plataforma, a classe :class:`~ssl.SSLContext` e outros recursos. (Contribuição de Alex Gaynor e David Reid; :issue:`21308`.)

source: Refer to the "Version added: 2.7.9" notes in the module documentation for specific details.
pt_br: Consulte as notas "Versão adicionada: 2.7.9" na documentação do módulo para obter detalhes específicos.

source: :func:`os.urandom` was changed to cache a file descriptor to ``/dev/urandom`` instead of reopening ``/dev/urandom`` on every call. (Contributed by Alex Gaynor; :issue:`21305`.)
pt_br: :func:`os.urandom` foi alterado para armazenar em cache um descritor de arquivo para ``/dev/urandom`` em vez de reabrir ``/dev/urandom`` em cada chamada. (Contribuição de Alex Gaynor; :issue:`21305`.)

source: :data:`hashlib.algorithms_guaranteed` and :data:`hashlib.algorithms_available` were backported from Python 3 to make it easier for Python 2 applications to select the strongest available hash algorithm. (Contributed by Alex Gaynor in :issue:`21307`)
pt_br: :data:`hashlib.algorithms_guaranteed` e :data:`hashlib.algorithms_available` foram portados do Python 3 para tornar mais fácil para os aplicações Python 2 selecionarem o algoritmo de hash mais forte disponível. (Contribuição de Alex Gaynor em :issue:`21307`)

source: PEP 477: Backport ensurepip (PEP 453) to Python 2.7
pt_br: PEP 477: Backport do ensurepip (PEP 453) para o Python 2.7

source: :pep:`477` approves the inclusion of the :pep:`453` ensurepip module and the improved documentation that was enabled by it in the Python 2.7 maintenance releases, appearing first in the Python 2.7.9 release.
pt_br: A :pep:`477` aprova a inclusão do módulo ensurepip do :pep:`453` e da documentação aprimorada que foi habilitada por ele nas versões de manutenção do Python 2.7, aparecendo primeiro na versão Python 2.7.9.

source: Bootstrapping pip By Default
pt_br: Inicializando pip por padrão

source: The new :mod:`ensurepip` module (defined in :pep:`453`) provides a standard cross-platform mechanism to bootstrap the pip installer into Python installations. The version of ``pip`` included with Python 2.7.9 is ``pip`` 1.5.6, and future 2.7.x maintenance releases will update the bundled version to the latest version of ``pip`` that is available at the time of creating the release candidate.
pt_br: O novo módulo :mod:`ensurepip` (definido em :pep:`453`) fornece um mecanismo padrão de plataforma cruzada para inicializar o instalador pip em instalações Python. A versão do ``pip`` incluída no Python 2.7.9 é ``pip`` 1.5.6, e futuras versões de manutenção 2.7.x atualizarão a versão empacotada para a versão mais recente do ``pip`` que está disponível em o momento da criação do candidato a lançamento.
