Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: What's New in Python 2.7
pt_br: O que há de novo no Python 2.7

source: Author
pt_br: Autor

source: This article explains the new features in Python 2.7. Python 2.7 was released on July 3, 2010.
pt_br: Este artigo explica os novos recursos do Python 2.7. O Python 2.7 foi lançado em 3 de julho de 2010.

source: Numeric handling has been improved in many ways, for both floating-point numbers and for the :class:`~decimal.Decimal` class. There are some useful additions to the standard library, such as a greatly enhanced :mod:`unittest` module, the :mod:`argparse` module for parsing command-line options, convenient :class:`~collections.OrderedDict` and :class:`~collections.Counter` classes in the :mod:`collections` module, and many other improvements.
pt_br: A manipulação numérica foi aprimorada de várias maneiras, tanto para números de ponto flutuante quanto para a classe :class:`~decimal.Decimal`. Existem algumas adições úteis à biblioteca padrão, como um módulo :mod:`unittest` bastante aprimorado, o módulo :mod:`argparse` para analisar as opções da linha de comando, classes convenientes :class:`~collections.OrderedDict` e :class:`~collections.Counter` no módulo :mod:`collections` e muitas outras melhorias.

source: Python 2.7 is planned to be the last of the 2.x releases, so we worked on making it a good release for the long term. To help with porting to Python 3, several new features from the Python 3.x series have been included in 2.7.
pt_br: O Python 2.7 está planejado para ser o último dos lançamentos 2.x, por isso trabalhamos para torná-lo um bom lançamento a longo prazo. Para ajudar na migração para o Python 3, vários novos recursos da série Python 3.x foram incluídos no 2.7.

source: This article doesn't attempt to provide a complete specification of the new features, but instead provides a convenient overview. For full details, you should refer to the documentation for Python 2.7 at https://docs.python.org. If you want to understand the rationale for the design and implementation, refer to the PEP for a particular new feature or the issue on https://bugs.python.org in which a change was discussed. Whenever possible, "What's New in Python" links to the bug/patch item for each change.
pt_br: Este artigo não tenta fornecer uma especificação completa dos novos recursos, mas fornece uma visão geral conveniente. Para detalhes completos, você deve consultar a documentação do Python 2.7 em https://docs.python.org. Se você deseja entender a lógica do design e implementação, consulte a PEP para obter um novo recurso específico ou o problema em https://bugs.python.org no qual uma alteração foi discutida. Sempre que possível, o "O que há de novo no Python" é vinculado ao item de bug/patch de cada alteração.

source: The Future for Python 2.x
pt_br: O futuro para o Python 2.x

source: Python 2.7 is the last major release in the 2.x series, as the Python maintainers have shifted the focus of their new feature development efforts to the Python 3.x series. This means that while Python 2 continues to receive bug fixes, and to be updated to build correctly on new hardware and versions of supported operated systems, there will be no new full feature releases for the language or standard library.
pt_br: Python 2.7 é o último grande lançamento da série 2.x, já que os mantenedores do Python mudaram o foco de seus esforços de desenvolvimento de novos recursos para a série Python 3.x. Isso significa que, embora o Python 2 continue recebendo correções de bugs e seja atualizado para construir corretamente em novo hardware e versões de sistemas operados com suporte, não haverá novos lançamentos de recursos completos para a linguagem ou biblioteca padrão.

source: However, while there is a large common subset between Python 2.7 and Python 3, and many of the changes involved in migrating to that common subset, or directly to Python 3, can be safely automated, some other changes (notably those associated with Unicode handling) may require careful consideration, and preferably robust automated regression test suites, to migrate effectively.
pt_br: No entanto, embora haja um grande subconjunto comum entre Python 2.7 e Python 3, e muitas das mudanças envolvidas na migração para esse subconjunto comum, ou diretamente para Python 3, podem ser automatizadas com segurança, algumas outras mudanças (principalmente aquelas associadas ao tratamento Unicode) pode exigir uma consideração cuidadosa e, de preferência, conjuntos de testes de regressão automatizados robustos, para migrar com eficácia.

source: This means that Python 2.7 will remain in place for a long time, providing a stable and supported base platform for production systems that have not yet been ported to Python 3. The full expected lifecycle of the Python 2.7 series is detailed in :pep:`373`.
pt_br: Isso significa que o Python 2.7 permanecerá em vigor por um longo tempo, fornecendo uma plataforma base estável e com suporte para sistemas de produção que ainda não foram portados para Python 3. O ciclo de vida completo esperado da série Python 2.7 é detalhado na :pep:`373`.

source: Some key consequences of the long-term significance of 2.7 are:
pt_br: Algumas consequências principais da significância de longo prazo de 2.7 são:

source: As noted above, the 2.7 release has a much longer period of maintenance when compared to earlier 2.x versions. Python 2.7 is currently expected to remain supported by the core development team (receiving security updates and other bug fixes) until at least 2020 (10 years after its initial release, compared to the more typical support period of 18--24 months).
pt_br: Conforme observado acima, a versão 2.7 tem um período de manutenção muito mais longo em comparação com as versões 2.x anteriores. Atualmente, espera-se que o Python 2.7 continue com o suporte da equipe de desenvolvimento central (recebendo atualizações de segurança e outras correções de bugs) até pelo menos 2020 (10 anos após seu lançamento inicial, em comparação com o período de suporte mais típico de 18-24 meses).

source: As the Python 2.7 standard library ages, making effective use of the Python Package Index (either directly or via a redistributor) becomes more important for Python 2 users. In addition to a wide variety of third party packages for various tasks, the available packages include backports of new modules and features from the Python 3 standard library that are compatible with Python 2, as well as various tools and libraries that can make it easier to migrate to Python 3. The `Python Packaging User Guide <https://packaging.python.org>`__ provides guidance on downloading and installing software from the Python Package Index.
pt_br: Conforme a biblioteca padrão do Python 2.7 envelhece, fazer uso efetivo do Python Package Index (diretamente ou por meio de um redistribuidor) torna-se mais importante para os usuários do Python 2. Além de uma grande variedade de pacotes de terceiros para várias tarefas, os pacotes disponíveis incluem backports de novos módulos e recursos da biblioteca padrão do Python 3 que são compatíveis com o Python 2, bem como várias ferramentas e bibliotecas que podem tornar mais fácil migre para Python 3. O `Guia de Usuário para Empacotamento de Python <https://packaging.python.org>`__ fornece orientação sobre como baixar e instalar software do Python Package Index.

source: While the preferred approach to enhancing Python 2 is now the publication of new packages on the Python Package Index, this approach doesn't necessarily work in all cases, especially those related to network security. In exceptional cases that cannot be handled adequately by publishing new or updated packages on PyPI, the Python Enhancement Proposal process may be used to make the case for adding new features directly to the Python 2 standard library. Any such additions, and the maintenance releases where they were added, will be noted in the :ref:`py27-maintenance-enhancements` section below.
pt_br: Embora a abordagem preferida para aprimorar o Python 2 agora seja a publicação de novos pacotes no Python Package Index, essa abordagem não funciona necessariamente em todos os casos, especialmente aqueles relacionados à segurança de rede. Em casos excepcionais que não podem ser tratados adequadamente com a publicação de pacotes novos ou atualizados no PyPI, o processo de Proposta de Melhoria do Python, ou PEP, pode ser usado para justificar a adição de novos recursos diretamente à biblioteca padrão do Python 2. Quaisquer adições, e as versões de manutenção onde foram adicionadas, serão observadas na seção :ref:`py27-maintenance-enhancements` abaixo.

source: For projects wishing to migrate from Python 2 to Python 3, or for library and framework developers wishing to support users on both Python 2 and Python 3, there are a variety of tools and guides available to help decide on a suitable approach and manage some of the technical details involved. The recommended starting point is the :ref:`pyporting-howto` HOWTO guide.
pt_br: Para projetos que desejam migrar de Python 2 para Python 3, ou para desenvolvedores de bibliotecas e frameworks que desejam oferecer suporte a usuários em Python 2 e Python 3, há uma variedade de ferramentas e guias disponíveis para ajudar a decidir sobre uma abordagem adequada e gerenciar alguns dos os detalhes técnicos envolvidos. O ponto de partida recomendado é o guia :ref:`pyporting-howto`.

source: Changes to the Handling of Deprecation Warnings
pt_br: Mudanças no tratamento de avisos de descontinuação

source: For Python 2.7, a policy decision was made to silence warnings only of interest to developers by default. :exc:`DeprecationWarning` and its descendants are now ignored unless otherwise requested, preventing users from seeing warnings triggered by an application. This change was also made in the branch that became Python 3.2. (Discussed on stdlib-sig and carried out in :issue:`7319`.)
pt_br: Para Python 2.7, uma decisão política foi feita para silenciar avisos apenas de interesse para desenvolvedores por padrão. :exc:`DeprecationWarning` e seus descendentes agora são ignorados a menos que solicitado de outra forma, evitando que os usuários vejam avisos acionados por uma aplicação. Essa mudança também foi feita no branch que se tornou o Python 3.2. (Discutido em stdlib-sig e realizado em :issue:`7319`.)

source: In previous releases, :exc:`DeprecationWarning` messages were enabled by default, providing Python developers with a clear indication of where their code may break in a future major version of Python.
pt_br: Em versões anteriores, as mensagens :exc:`DeprecationWarning` eram habilitadas por padrão, fornecendo aos desenvolvedores de Python uma indicação clara de onde seu código pode quebrar em uma versão principal futura do Python.

source: However, there are increasingly many users of Python-based applications who are not directly involved in the development of those applications. :exc:`DeprecationWarning` messages are irrelevant to such users, making them worry about an application that's actually working correctly and burdening application developers with responding to these concerns.
pt_br: No entanto, há cada vez mais usuários de aplicações baseadas em Python que não estão diretamente envolvidos no desenvolvimento dessas aplicações. Mensagens de :exc:`DeprecationWarning` são irrelevantes para tais usuários, fazendo-os se preocupar com uma aplicação que está realmente funcionando corretamente e sobrecarregando os desenvolvedores de aplicações com a resposta a essas preocupações.

source: You can re-enable display of :exc:`DeprecationWarning` messages by running Python with the :option:`-Wdefault <-W>` (short form: :option:`-Wd <-W>`) switch, or by setting the :envvar:`PYTHONWARNINGS` environment variable to ``"default"`` (or ``"d"``) before running Python. Python code can also re-enable them by calling ``warnings.simplefilter('default')``.
pt_br: Você pode reativar a exibição de mensagens :exc:`DeprecationWarning` executando Python com a opção :option:`-Wdefault <-W>` (forma curta: :option:`-Wd <-W>`) ou definindo a variável de ambiente :envvar:`PYTHONWARNINGS` para ``"default"`` (ou ``"d"``) antes de executar o Python. O código Python também pode reativá-los chamando ``warnings.simplefilter('default')``.

source: The ``unittest`` module also automatically reenables deprecation warnings when running tests.
pt_br: O módulo ``unittest`` também reativa automaticamente os avisos de depreciação ao executar testes.

source: Python 3.1 Features
pt_br: Recursos do Python 3.1

source: Much as Python 2.6 incorporated features from Python 3.0, version 2.7 incorporates some of the new features in Python 3.1. The 2.x series continues to provide tools for migrating to the 3.x series.
pt_br: Assim como o Python 2.6 incorporou recursos do Python 3.0, a versão 2.7 incorpora alguns dos novos recursos do Python 3.1. A série 2.x continua a fornecer ferramentas para migração para a série 3.x.

source: A partial list of 3.1 features that were backported to 2.7:
pt_br: Uma lista parcial de recursos do 3.1 que foram transferidos para o 2.7:

source: The syntax for set literals (``{1,2,3}`` is a mutable set).
pt_br: A sintaxe para conjuntos de literais (``{1,2,3}`` é um conjunto mutável).

source: Dictionary and set comprehensions (``{i: i*2 for i in range(3)}``).
pt_br: Compreensões de dicionário e conjunto (``{i: i*2 for i in range(3)}``).

source: Multiple context managers in a single :keyword:`with` statement.
pt_br: Vários gerenciadores de contexto em uma única instrução :keyword:`with`.

source: A new version of the :mod:`io` library, rewritten in C for performance.
pt_br: Uma nova versão da biblioteca :mod:`io`, reescrita em C para melhor desempenho.

source: The ordered-dictionary type described in :ref:`pep-0372`.
pt_br: O tipo de dicionário ordenado descrito na :ref:`pep-0372`.

source: The new ``","`` format specifier described in :ref:`pep-0378`.
pt_br: O novo especificador de formato ``","`` descrito na :ref:`pep-0378`.

source: The :class:`memoryview` object.
pt_br: O objeto :class:`memoryview`.

source: A small subset of the :mod:`importlib` module, `described below <#importlib-section>`__.
pt_br: Um pequeno subconjunto do módulo :mod:`importlib`, `descrito sob <#importlib-section>`__.

source: The :func:`repr` of a float ``x`` is shorter in many cases: it's now based on the shortest decimal string that's guaranteed to round back to ``x``. As in previous versions of Python, it's guaranteed that ``float(repr(x))`` recovers ``x``.
pt_br: O :func:`repr` de um ponto flutuante ``x`` é mais curto em muitos casos: agora é baseado na string decimal mais curta que é garantida para arredondar de volta para ``x``. Como nas versões anteriores do Python, é garantido que ``float(repr(x))`` recupera ``x``.

source: Float-to-string and string-to-float conversions are correctly rounded. The :func:`round` function is also now correctly rounded.
pt_br: As conversões de ponto flutuante para string e string para ponto flutuante são arredondadas corretamente. A função :func:`round` também está agora corretamente arredondada.

source: The :c:type:`PyCapsule` type, used to provide a C API for extension modules.
pt_br: O tipo :c:type:`PyCapsule`, usado para fornecer uma API C para módulos de extensão.

source: The :c:func:`PyLong_AsLongAndOverflow` C API function.
pt_br: A função de API C :c:func:`PyLong_AsLongAndOverflow`.

source: Other new Python3-mode warnings include:
pt_br: Outros novos avisos do modo Python3 incluem:

source: :func:`!operator.isCallable` and :func:`!operator.sequenceIncludes`, which are not supported in 3.x, now trigger warnings.
pt_br: :func:`!operator.isCallable` e :func:`!operator.sequenceIncludes`, que não são suportados no 3.x, agora disparam avisos.

source: The :option:`!-3` switch now automatically enables the :option:`!-Qwarn` switch that causes warnings about using classic division with integers and long integers.
pt_br: A opção :option:`!-3` agora habilita automaticamente a opção :option:`!-Qwarn` que causa avisos sobre o uso de divisão clássica com inteiros e inteiros longos.

source: PEP 372: Adding an Ordered Dictionary to collections
pt_br: PEP 372: Adicionando um dicionário ordenado a coleções

source: Regular Python dictionaries iterate over key/value pairs in arbitrary order. Over the years, a number of authors have written alternative implementations that remember the order that the keys were originally inserted. Based on the experiences from those implementations, 2.7 introduces a new :class:`~collections.OrderedDict` class in the :mod:`collections` module.
pt_br: Dicionários regulares no Python iteram sobre pares de chave/valor em ordem arbitrária. Ao longo dos anos, vários autores escreveram implementações alternativas que lembram a ordem em que as chaves foram inseridas originalmente. Com base nas experiências dessas implementações, 2.7 introduz uma nova classe :class:`~collections.OrderedDict` no módulo :mod:`collections`.

source: The :class:`~collections.OrderedDict` API provides the same interface as regular dictionaries but iterates over keys and values in a guaranteed order depending on when a key was first inserted::
pt_br: A API :class:`~collections.OrderedDict` fornece a mesma interface que os dicionários regulares, mas itera sobre chaves e valores em uma ordem garantida dependendo de quando uma chave foi inserida pela primeira vez::

source: If a new entry overwrites an existing entry, the original insertion position is left unchanged::
pt_br: Se uma nova entrada substituir uma entrada existente, a posição de inserção original permanece inalterada::

source: Deleting an entry and reinserting it will move it to the end::
pt_br: Excluir uma entrada e reinseri-la irá movê-la para o final::

source: The :meth:`~collections.OrderedDict.popitem` method has an optional *last* argument that defaults to ``True``. If *last* is true, the most recently added key is returned and removed; if it's false, the oldest key is selected::
pt_br: O método :meth:`~collections.OrderedDict.popitem` tem um argumento opcional *last* cujo valor padrão é ``True``. Se *last* for true, a chave adicionada mais recentemente é retornada e removida; se for falso, a chave mais antiga é selecionada::

source: Comparing two ordered dictionaries checks both the keys and values, and requires that the insertion order was the same::
pt_br: A comparação de dois dicionários ordenados verifica as chaves e os valores e exige que o pedido de inserção seja o mesmo::

source: >>> od1 = OrderedDict([('first', 1), ... ('second', 2), ... ('third', 3)]) >>> od2 = OrderedDict([('third', 3), ... ('first', 1), ... ('second', 2)]) >>> od1 == od2 False >>> # Move 'third' key to the end >>> del od2['third']; od2['third'] = 3 >>> od1 == od2 True
pt_br: >>> od1 = OrderedDict([('first', 1), ... ('second', 2), ... ('third', 3)]) >>> od2 = OrderedDict([('third', 3), ... ('first', 1), ... ('second', 2)]) >>> od1 == od2 False >>> # Move a chave 'third' para o fim >>> del od2['third']; od2['third'] = 3 >>> od1 == od2 True

source: Comparing an :class:`~collections.OrderedDict` with a regular dictionary ignores the insertion order and just compares the keys and values.
pt_br: Comparar um :class:`~collections.OrderedDict` com um dicionário regular ignora a ordem de inserção e apenas compara as chaves e valores.

source: How does the :class:`~collections.OrderedDict` work? It maintains a doubly linked list of keys, appending new keys to the list as they're inserted. A secondary dictionary maps keys to their corresponding list node, so deletion doesn't have to traverse the entire linked list and therefore remains *O*\ (1).
pt_br: Como funciona a :class:`~collections.OrderedDict`? Ela mantém uma lista duplamente vinculada de chaves, acrescentando novas chaves à lista à medida que são inseridas. Um dicionário secundário mapeia as chaves para seu nó de lista correspondente, portanto, a exclusão não precisa percorrer toda a lista vinculada e, portanto, permanece *O*\ (1).

source: The standard library now supports use of ordered dictionaries in several modules.
pt_br: A biblioteca padrão agora oferece suporte ao uso de dicionários ordenados em vários módulos.

source: The :mod:`ConfigParser <configparser>` module uses them by default, meaning that configuration files can now be read, modified, and then written back in their original order.
pt_br: O módulo :mod:`ConfigParser <configparser>` os usa por padrão, o que significa que os arquivos de configuração agora podem ser lidos, modificados e então escritos de volta em sua ordem original.

source: The :meth:`~collections.somenamedtuple._asdict` method for :func:`collections.namedtuple` now returns an ordered dictionary with the values appearing in the same order as the underlying tuple indices.
pt_br: O método :meth:`~collections.somenamedtuple._asdict` para :func:`collections.namedtuple` agora retorna um dicionário ordenado com os valores aparecendo na mesma ordem que os índices de tupla subjacentes.

source: The :mod:`json` module's :class:`~json.JSONDecoder` class constructor was extended with an *object_pairs_hook* parameter to allow :class:`OrderedDict` instances to be built by the decoder. Support was also added for third-party tools like `PyYAML <https://pyyaml.org/>`_.
pt_br: O construtor de classe :class:`~json.JSONDecoder` do módulo :mod:`json` foi estendido com um parâmetro *object_pairs_hook* para permitir que instâncias :class:`OrderedDict` sejam construídas pelo decodificador. O suporte também foi adicionado para ferramentas de terceiros como `PyYAML <https://pyyaml.org/>`_.

source: :pep:`372` - Adding an ordered dictionary to collections
pt_br: :pep:`372` - Adicionando um dicionário ordenado às coleções

source: PEP written by Armin Ronacher and Raymond Hettinger; implemented by Raymond Hettinger.
pt_br: PEP escrita por Armin Ronacher e Raymond Hettinger; implementada por Raymond Hettinger.

source: PEP 378: Format Specifier for Thousands Separator
pt_br: PEP 378: Especificador de formato para separador de milhares

source: To make program output more readable, it can be useful to add separators to large numbers, rendering them as 18,446,744,073,709,551,616 instead of 18446744073709551616.
pt_br: Para tornar a saída do programa mais legível, pode ser útil adicionar separadores a números grandes, renderizando-os como 18,446,744.073,709,551,616 em vez de 18446744073709551616.

source: The fully general solution for doing this is the :mod:`locale` module, which can use different separators ("," in North America, "." in Europe) and different grouping sizes, but :mod:`locale` is complicated to use and unsuitable for multi-threaded applications where different threads are producing output for different locales.
pt_br: A solução totalmente geral para fazer isso é o módulo :mod:`locale`, que pode usar diferentes separadores ("," na América do Norte, "." na Europa) e diferentes tamanhos de agrupamento, mas :mod:`locale` é complicado para usar e inadequado para aplicativos multithread onde diferentes threads estão produzindo saída para diferentes localidades.

source: Therefore, a simple comma-grouping mechanism has been added to the mini-language used by the :meth:`str.format` method. When formatting a floating-point number, simply include a comma between the width and the precision::
pt_br: Portanto, um mecanismo simples de agrupamento de vírgulas foi adicionado à minilinguagem usada pelo método :meth:`str.format`. Ao formatar um número de ponto flutuante, basta incluir uma vírgula entre a largura e a precisão::

source: When formatting an integer, include the comma after the width:
pt_br: Ao formatar um número inteiro, inclua a vírgula após a largura:
