Repository: python/python-docs-pt-br
Catalog: whatsnew/2.7.po
Languages: pt_br

source: The :mod:`bdb` module's base debugging class :class:`~bdb.Bdb` gained a feature for skipping modules. The constructor now takes an iterable containing glob-style patterns such as ``django.*``; the debugger will not step into stack frames from a module that matches one of these patterns. (Contributed by Maru Newby after a suggestion by Senthil Kumaran; :issue:`5142`.)
pt_br: A classe de depuração base do módulo :mod:`bdb` :class:`~bdb.Bdb` ganhou um recurso para pular módulos. O construtor agora usa um iterável contendo padrões estilo glob como ``django.*``; o depurador não entrará nos quadros de pilha de um módulo que corresponda a um desses padrões. (Contribuição de Maru Newby após sugestão de Senthil Kumaran; :issue:`5142`.)

source: The :mod:`binascii` module now supports the buffer API, so it can be used with :class:`memoryview` instances and other similar buffer objects. (Backported from 3.x by Florent Xicluna; :issue:`7703`.)
pt_br: O módulo :mod:`binascii` agora oferece suporte à API de buffer, então ele pode ser usado com instâncias :class:`memoryview` e outros objetos buffer similares. (Backport de 3.x por Florent Xicluna; :issue:`7703`.)

source: Updated module: the :mod:`!bsddb` module has been updated from 4.7.2devel9 to version 4.8.4 of `the pybsddb package <https://www.jcea.es/programacion/pybsddb.htm>`__. The new version features better Python 3.x compatibility, various bug fixes, and adds several new BerkeleyDB flags and methods. (Updated by Jesús Cea Avión; :issue:`8156`. The pybsddb changelog can be read at https://hg.jcea.es/pybsddb/file/tip/ChangeLog.)
pt_br: Módulo atualizado: o módulo :mod:`!bsddb` foi atualizado de 4.7.2devel9 para a versão 4.8.4 do `pacote pybsddb <https://www.jcea.es/programacion/pybsddb.htm>`__. A nova versão apresenta melhor compatibilidade com Python 3.x, várias correções de bugs e adiciona vários novos sinalizadores e métodos BerkeleyDB. (Atualizado por Jesús Cea Avión; :issue:`8156`. O changelog do pybsddb pode ser lido em https://hg.jcea.es/pybsddb/file/tip/ChangeLog.)

source: The :mod:`bz2` module's :class:`~bz2.BZ2File` now supports the context management protocol, so you can write ``with bz2.BZ2File(...) as f:``. (Contributed by Hagen Fürstenau; :issue:`3860`.)
pt_br: O :class:`~bz2.BZ2File` do módulo :mod:`bz2` agora oferece suporte ao protocolo de gerenciamento de contexto, então você pode escrever ``with bz2.BZ2File(...) as f:``. (Contribuição de Hagen Fürstenau; :issue:`3860`.)

source: New class: the :class:`~collections.Counter` class in the :mod:`collections` module is useful for tallying data. :class:`~collections.Counter` instances behave mostly like dictionaries but return zero for missing keys instead of raising a :exc:`KeyError`:
pt_br: Nova classe: a classe :class:`~collections.Counter` no módulo :mod:`collections` é útil para contabilizar dados. As instâncias :class:`~collections.Counter` se comportam principalmente como dicionários, mas retornam zero para chaves ausentes em vez de levantar uma exceção :exc:`KeyError`:

source: There are three additional :class:`~collections.Counter` methods. :meth:`~collections.Counter.most_common` returns the N most common elements and their counts. :meth:`~collections.Counter.elements` returns an iterator over the contained elements, repeating each element as many times as its count. :meth:`~collections.Counter.subtract` takes an iterable and subtracts one for each element instead of adding; if the argument is a dictionary or another :class:`Counter`, the counts are subtracted. ::
pt_br: Existem três métodos :class:`~collections.Counter` adicionais. :meth:`~collections.Counter.most_common` retorna os N elementos mais comuns e suas contagens. :meth:`~collections.Counter.elements` retorna um iterador sobre os elementos contidos, repetindo cada elemento tantas vezes quanto sua contagem. :meth:`~collections.Counter.subtract` pega um iterável e subtrai um para cada elemento em vez de adicionar; se o argumento for um dicionário ou outro :class:`Counter`, as contagens são subtraídas. ::

source: Contributed by Raymond Hettinger; :issue:`1696199`.
pt_br: Contribuição de Raymond Hettinger; :issue:`1696199`.

source: New class: :class:`~collections.OrderedDict` is described in the earlier section :ref:`pep-0372`.
pt_br: Nova classe: :class:`~collections.OrderedDict` é descrita na seção anterior :ref:`pep-0372`.

source: New method: The :class:`~collections.deque` data type now has a :meth:`~collections.deque.count` method that returns the number of contained elements equal to the supplied argument *x*, and a :meth:`~collections.deque.reverse` method that reverses the elements of the deque in-place. :class:`~collections.deque` also exposes its maximum length as the read-only :attr:`~collections.deque.maxlen` attribute. (Both features added by Raymond Hettinger.)
pt_br: Novo método: O tipo de dados :class:`~collections.deque` agora tem um método :meth:`~collections.deque.count` que retorna o número de elementos contidos igual ao argumento fornecido *x*, e um :meth:`~collections.deque.reverse` método que inverte os elementos do deque no local. :class:`~collections.deque` também expõe seu comprimento máximo como o atributo somente leitura :attr:`~collections.deque.maxlen`. (Ambos os recursos adicionados por Raymond Hettinger.)

source: The :class:`~collections.namedtuple` class now has an optional *rename* parameter. If *rename* is true, field names that are invalid because they've been repeated or aren't legal Python identifiers will be renamed to legal names that are derived from the field's position within the list of fields:
pt_br: A classe :class:`~collections.namedtuple` agora possui um parâmetro opcional *rename*. Se *rename* for verdadeiro, os nomes de campos inválidos porque foram repetidos ou não são identificadores Python legais serão renomeados para nomes legais derivados da posição do campo na lista de campos:

source: (Added by Raymond Hettinger; :issue:`1818`.)
pt_br: (Adição de Raymond Hettinger; :issue:`1818`.)

source: Finally, the :class:`~collections.abc.Mapping` abstract base class now returns :data:`NotImplemented` if a mapping is compared to another type that isn't a :class:`Mapping`. (Fixed by Daniel Stutzbach; :issue:`8729`.)
pt_br: Finalmente, a classe base abstrata :class:`~collections.abc.Mapping` agora retorna :data:`NotImplemented` se um mapeamento for comparado a outro tipo que não seja um :class:`Mapping`. (Correção de Daniel Stutzbach; :issue:`8729`.)

source: Constructors for the parsing classes in the :mod:`ConfigParser <configparser>` module now take an *allow_no_value* parameter, defaulting to false; if true, options without values will be allowed. For example::
pt_br: Construtores para as classes de análise no módulo :mod:`ConfigParser <configparser>` agora recebem um parâmetro *allow_no_value*, cujo padrão é false; se verdadeiro, opções sem valores serão permitidas. Por exemplo::

source: (Contributed by Mats Kindahl; :issue:`7005`.)
pt_br: (Contribuição de Mats Kindahl; :issue:`7005`.)

source: Deprecated function: :func:`!contextlib.nested`, which allows handling more than one context manager with a single :keyword:`with` statement, has been deprecated, because the :keyword:`!with` statement now supports multiple context managers.
pt_br: Função descontinuada: :func:`!contextlib.nested`, que permite lidar com mais de um gerenciador de contexto com uma única instrução :keyword:`with`, foi descontinuada porque a instrução :keyword:`!with` agora oferece suporte a múltiplos contextos gerentes.

source: The :mod:`cookielib <http.cookiejar>` module now ignores cookies that have an invalid version field, one that doesn't contain an integer value. (Fixed by John J. Lee; :issue:`3924`.)
pt_br: O módulo :mod:`cookielib <http.cookiejar>` agora ignora cookies que possuem um campo de versão inválido, que não contém um valor inteiro. (Correção de John J. Lee; :issue:`3924`.)

source: The :mod:`copy` module's :func:`~copy.deepcopy` function will now correctly copy bound instance methods. (Implemented by Robert Collins; :issue:`1515`.)
pt_br: A função :func:`~copy.deepcopy` do módulo :mod:`copy` agora copiará corretamente os métodos de instância vinculados. (Implementado por Robert Collins; :issue:`1515`.)

source: The :mod:`ctypes` module now always converts ``None`` to a C ``NULL`` pointer for arguments declared as pointers. (Changed by Thomas Heller; :issue:`4606`.) The underlying `libffi library <https://sourceware.org/libffi/>`__ has been updated to version 3.0.9, containing various fixes for different platforms. (Updated by Matthias Klose; :issue:`8142`.)
pt_br: O módulo :mod:`ctypes` agora sempre converte ``None`` em um ponteiro C ``NULL`` para argumentos declarados como ponteiros. (Alterado por Thomas Heller; :issue:`4606`.) A `biblioteca libffi <https://sourceware.org/libffi/>`__ subjacente foi atualizada para a versão 3.0.9, contendo várias correções para diferentes plataformas. (Atualizado por Matthias Klose; :issue:`8142`.)

source: New method: the :mod:`datetime` module's :class:`~datetime.timedelta` class gained a :meth:`~datetime.timedelta.total_seconds` method that returns the number of seconds in the duration. (Contributed by Brian Quinlan; :issue:`5788`.)
pt_br: Novo método: a classe :class:`~datetime.timedelta` do módulo :mod:`datetime` ganhou um método :meth:`~datetime.timedelta.total_seconds` que retorna o número de segundos na duração. (Contribuição de Brian Quinlan; :issue:`5788`.)

source: New method: the :class:`~decimal.Decimal` class gained a :meth:`~decimal.Decimal.from_float` class method that performs an exact conversion of a floating-point number to a :class:`!Decimal`. This exact conversion strives for the closest decimal approximation to the floating-point representation's value; the resulting decimal value will therefore still include the inaccuracy, if any. For example, ``Decimal.from_float(0.1)`` returns ``Decimal('0.1000000000000000055511151231257827021181583404541015625')``. (Implemented by Raymond Hettinger; :issue:`4796`.)
pt_br: Novo método: a classe :class:`~decimal.Decimal` ganhou um método de classe :meth:`~decimal.Decimal.from_float` que realiza uma conversão exata de um número de ponto flutuante para um :class:`!Decimal`. Essa conversão exata busca a maior aproximação decimal do valor da representação de ponto flutuante; o valor decimal resultante ainda incluirá a imprecisão, se houver. Por exemplo, ``Decimal.from_float(0.1)`` retorna ``Decimal('0.1000000000000000055511151231257827021181583404541015625')``. (Implementado por Raymond Hettinger; :issue:`4796`.)

source: Comparing instances of :class:`~decimal.Decimal` with floating-point numbers now produces sensible results based on the numeric values of the operands. Previously such comparisons would fall back to Python's default rules for comparing objects, which produced arbitrary results based on their type. Note that you still cannot combine :class:`!Decimal` and floating point in other operations such as addition, since you should be explicitly choosing how to convert between float and :class:`!Decimal`. (Fixed by Mark Dickinson; :issue:`2531`.)
pt_br: Comparar instâncias de :class:`~decimal.Decimal` com números de ponto flutuante agora produz resultados sensatos com base nos valores numéricos dos operandos. Anteriormente, essas comparações recorreriam às regras padrão do Python para comparar objetos, que produziam resultados arbitrários com base em seu tipo. Observe que você ainda não pode combinar :class:`!Decimal` e ponto flutuante em outras operações, como adição, já que você deve escolher explicitamente como converter entre float e :class:`!Decimal`. (Corrigido por Mark Dickinson; :issue:`2531`.)

source: The constructor for :class:`~decimal.Decimal` now accepts floating-point numbers (added by Raymond Hettinger; :issue:`8257`) and non-European Unicode characters such as Arabic-Indic digits (contributed by Mark Dickinson; :issue:`6595`).
pt_br: O construtor para :class:`~decimal.Decimal` agora aceita números de ponto flutuante (adicionados por Raymond Hettinger; :issue:`8257`) e caracteres Unicode não europeus, como dígitos árabe-índicos (contribuição de Mark Dickinson; :issue:`6595`).

source: Most of the methods of the :class:`~decimal.Context` class now accept integers as well as :class:`~decimal.Decimal` instances; the only exceptions are the :meth:`~decimal.Context.canonical` and :meth:`~decimal.Context.is_canonical` methods. (Patch by Juan José Conti; :issue:`7633`.)
pt_br: A maioria dos métodos da classe :class:`~decimal.Context` agora aceitam números inteiros, bem como instâncias :class:`~decimal.Decimal`; as únicas exceções são os métodos :meth:`~decimal.Context.canonical` e :meth:`~decimal.Context.is_canonical`. (Patch de Juan José Conti; :issue:`7633`.)

source: When using :class:`~decimal.Decimal` instances with a string's :meth:`~str.format` method, the default alignment was previously left-alignment. This has been changed to right-alignment, which is more sensible for numeric types. (Changed by Mark Dickinson; :issue:`6857`.)
pt_br: Ao usar instâncias :class:`~decimal.Decimal` com o método :meth:`~str.format` de uma string, o alinhamento padrão era anteriormente o alinhamento à esquerda. Isso foi alterado para alinhamento à direita, que é mais sensato para tipos numéricos. (Alteração de Mark Dickinson; :issue:`6857`.)

source: Comparisons involving a signaling NaN value (or ``sNAN``) now signal :const:`~decimal.InvalidOperation` instead of silently returning a true or false value depending on the comparison operator. Quiet NaN values (or ``NaN``) are now hashable. (Fixed by Mark Dickinson; :issue:`7279`.)
pt_br: Comparações envolvendo um valor NaN de sinalização (ou ``sNAN``) agora sinalizam :const:`~decimal.InvalidOperation` em vez de retornar silenciosamente um valor verdadeiro ou falso dependendo do operador de comparação. Valores silenciosos de NaN (ou ``NaN``) agora são hasheáveis. (Corrigido por Mark Dickinson; :issue:`7279`.)

source: The :mod:`difflib` module now produces output that is more compatible with modern :command:`diff`/:command:`patch` tools through one small change, using a tab character instead of spaces as a separator in the header giving the filename. (Fixed by Anatoly Techtonik; :issue:`7585`.)
pt_br: O módulo :mod:`difflib` agora produz uma saída que é mais compatível com as ferramentas :command:`diff`/:command:`patch` modernas através de uma pequena mudança, usando um caractere de tabulação em vez de espaços como separador no cabeçalho, fornecendo o nome do arquivo. (Correção de Anatoly Techtonik; :issue:`7585`.)

source: The Distutils ``sdist`` command now always regenerates the :file:`MANIFEST` file, since even if the :file:`MANIFEST.in` or :file:`setup.py` files haven't been modified, the user might have created some new files that should be included. (Fixed by Tarek Ziadé; :issue:`8688`.)
pt_br: O comando Distutils ``sdist`` agora sempre regenera o arquivo :file:`MANIFEST`, pois mesmo que os arquivos :file:`MANIFEST.in` ou :file:`setup.py` não tenham sido modificados, o usuário pode ter criado alguns novos arquivos que deveriam ser incluídos. (Correção de Tarek Ziadé; :issue:`8688`.)

source: The :mod:`doctest` module's :const:`~doctest.IGNORE_EXCEPTION_DETAIL` flag will now ignore the name of the module containing the exception being tested. (Patch by Lennart Regebro; :issue:`7490`.)
pt_br: O sinalizador :const:`~doctest.IGNORE_EXCEPTION_DETAIL` do módulo :mod:`doctest` irá agora ignorar o nome do módulo que contém a exceção que está sendo testada. (Patch de Lennart Regebro; :issue:`7490`.)

source: The :mod:`email` module's :class:`~email.message.Message` class will now accept a Unicode-valued payload, automatically converting the payload to the encoding specified by :attr:`!output_charset`. (Added by R. David Murray; :issue:`1368247`.)
pt_br: A classe :class:`~email.message.Message` do módulo :mod:`email` agora aceitará uma carga útil com valor Unicode, convertendo automaticamente a carga útil para a codificação especificada por :attr:`!output_charset`. (Adição de R. David Murray; :issue:`1368247`.)

source: The :class:`~fractions.Fraction` class now accepts a single float or :class:`~decimal.Decimal` instance, or two rational numbers, as arguments to its constructor. (Implemented by Mark Dickinson; rationals added in :issue:`5812`, and float/decimal in :issue:`8294`.)
pt_br: A classe :class:`~fractions.Fraction` agora aceita uma única instância float ou :class:`~decimal.Decimal`, ou dois números racionais, como argumentos para seu construtor. (Implementação de Mark Dickinson; racionais adicionados em :issue:`5812` e float/decimal em :issue:`8294`.)

source: Ordering comparisons (``<``, ``<=``, ``>``, ``>=``) between fractions and complex numbers now raise a :exc:`TypeError`. This fixes an oversight, making the :class:`~fractions.Fraction` match the other numeric types.
pt_br: Ordenar comparações (``<``, ``<=``, ``>``, ``>=``) entre frações e números complexos agora levanta um :exc:`TypeError`. Isso corrige um descuido, fazendo com que :class:`~fractions.Fraction` corresponda aos outros tipos numéricos.

source: New class: :class:`~ftplib.FTP_TLS` in the :mod:`ftplib` module provides secure FTP connections using TLS encapsulation of authentication as well as subsequent control and data transfers. (Contributed by Giampaolo Rodola; :issue:`2054`.)
pt_br: Nova classe: :class:`~ftplib.FTP_TLS` no módulo :mod:`ftplib` fornece conexões FTP seguras usando encapsulamento TLS de autenticação, bem como controle subsequente e transferências de dados. (Contribuição de Giampaolo Rodola; :issue:`2054`.)

source: The :meth:`~ftplib.FTP.storbinary` method for binary uploads can now restart uploads thanks to an added *rest* parameter (patch by Pablo Mouzo; :issue:`6845`.)
pt_br: O método :meth:`~ftplib.FTP.storbinary` para envios de binários agora pode reiniciar envios graças a um parâmetro *rest* adicionado (patch de Pablo Mouzo; :issue:`6845`.)

source: New class decorator: :func:`~functools.total_ordering` in the :mod:`functools` module takes a class that defines an :meth:`~object.__eq__` method and one of :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, or :meth:`~object.__ge__`, and generates the missing comparison methods. Since the :meth:`!__cmp__` method is being deprecated in Python 3.x, this decorator makes it easier to define ordered classes. (Added by Raymond Hettinger; :issue:`5479`.)
pt_br: Novo decorador de classe: :func:`~functools.total_ordering` no módulo :mod:`functools` pega uma classe que define um método :meth:`~object.__eq__` e um de :meth:`~object.__lt__` , :meth:`~object.__le__`, :meth:`~object.__gt__` ou :meth:`~object.__ge__` e gera os métodos de comparação ausentes. Como o método :meth:`!__cmp__` está sendo descontinuado no Python 3.x, esse decorador facilita a definição de classes ordenadas. (Adicionado por Raymond Hettinger; :issue:`5479`.)

source: New function: :func:`~functools.cmp_to_key` will take an old-style comparison function that expects two arguments and return a new callable that can be used as the *key* parameter to functions such as :func:`sorted`, :func:`min` and :func:`max`, etc. The primary intended use is to help with making code compatible with Python 3.x. (Added by Raymond Hettinger.)
pt_br: Nova função: :func:`~functools.cmp_to_key` usará uma função de comparação de estilo antigo que espera dois argumentos e retornará um novo chamável que pode ser usado como parâmetro *key* para funções como :func:`sorted`, :func:`min` e :func:`max`, etc. O principal uso pretendido é ajudar a tornar o código compatível com Python 3.x. (Adição de Raymond Hettinger.)

source: New function: the :mod:`gc` module's :func:`~gc.is_tracked` returns true if a given instance is tracked by the garbage collector, false otherwise. (Contributed by Antoine Pitrou; :issue:`4688`.)
pt_br: Nova função: o :func:`~gc.is_tracked` do módulo :mod:`gc` retorna verdadeiro se uma determinada instância for rastreada pelo coletor de lixo, falso caso contrário. (Contribuição de Antoine Pitrou; :issue:`4688`)

source: The :mod:`gzip` module's :class:`~gzip.GzipFile` now supports the context management protocol, so you can write ``with gzip.GzipFile(...) as f:`` (contributed by Hagen Fürstenau; :issue:`3860`), and it now implements the :class:`io.BufferedIOBase` ABC, so you can wrap it with :class:`io.BufferedReader` for faster processing (contributed by Nir Aides; :issue:`7471`). It's also now possible to override the modification time recorded in a gzipped file by providing an optional timestamp to the constructor. (Contributed by Jacques Frechet; :issue:`4272`.)
pt_br: O :class:`~gzip.GzipFile` do módulo :mod:`gzip` agora oferece suporte ao protocolo de gerenciamento de contexto, então você pode escrever ``with gzip.GzipFile(...) as f:`` (contribuição de Hagen Fürstenau; :issue:`3860`), e agora implementa o :class:`io.BufferedIOBase` ABC, então você pode envolvê-lo com :class:`io.BufferedReader` para processamento mais rápido (contribuição de Nir Aides; :issue:`7471`). Agora também é possível substituir o horário de modificação registrado em um arquivo compactado, fornecendo um registro de data e hora opcional ao construtor. (Contribuição de Jacques Frechet; :issue:`4272`.)

source: Files in gzip format can be padded with trailing zero bytes; the :mod:`gzip` module will now consume these trailing bytes. (Fixed by Tadek Pietraszek and Brian Curtin; :issue:`2846`.)
pt_br: Arquivos no formato gzip podem ser preenchidos com zero bytes à direita; o módulo :mod:`gzip` agora consumirá esses bytes finais. (Correção de Tadek Pietraszek e Brian Curtin; :issue:`2846`.)

source: New attribute: the :mod:`hashlib` module now has an :attr:`!algorithms` attribute containing a tuple naming the supported algorithms. In Python 2.7, ``hashlib.algorithms`` contains ``('md5', 'sha1', 'sha224', 'sha256', 'sha384', 'sha512')``. (Contributed by Carl Chenet; :issue:`7418`.)
pt_br: Novo atributo: o módulo :mod:`hashlib` agora possui um atributo :attr:`!algorithms` contendo uma tupla nomeando os algoritmos suportados. No Python 2.7, ``hashlib.algorithms`` contém ``('md5', 'sha1', 'sha224', 'sha256', 'sha384', 'sha512')``. (Contribuição de Carl Chenet; :issue:`7418`.)

source: The default :class:`~http.client.HTTPResponse` class used by the :mod:`httplib <http>` module now supports buffering, resulting in much faster reading of HTTP responses. (Contributed by Kristján Valur Jónsson; :issue:`4879`.)
pt_br: A classe padrão :class:`~http.client.HTTPResponse` usada pelo módulo :mod:`httplib <http>` agora oferece suporte a buffering, resultando em uma leitura muito mais rápida de respostas HTTP. (Contribuição de Kristján Valur Jónsson; :issue:`4879`.)

source: The :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` classes now support a *source_address* parameter, a ``(host, port)`` 2-tuple giving the source address that will be used for the connection. (Contributed by Eldon Ziegler; :issue:`3972`.)
pt_br: As classes :class:`~http.client.HTTPConnection` e :class:`~http.client.HTTPSConnection` agora oferecem suporte a um parâmetro *source_address*, uma tupla de 2 elementos ``(host, port)`` fornecendo o endereço de origem que será usado para a conexão. (Contribuição de Eldon Ziegler; :issue:`3972`.)
