Repository: python/python-docs-pt-br
Catalog: whatsnew/3.0.po
Languages: pt_br

source: A common pattern in Python 2.x is to have one version of a module implemented in pure Python, with an optional accelerated version implemented as a C extension; for example, :mod:`pickle` and :mod:`!cPickle`. This places the burden of importing the accelerated version and falling back on the pure Python version on each user of these modules. In Python 3.0, the accelerated versions are considered implementation details of the pure Python versions. Users should always import the standard version, which attempts to import the accelerated version and falls back to the pure Python version. The :mod:`pickle` / :mod:`!cPickle` pair received this treatment. The :mod:`profile` module is on the list for 3.1. The :mod:`!StringIO` module has been turned into a class in the :mod:`io` module.
pt_br: Um padrão comum no Python 2.x é ter uma versão de um módulo implementada em Python puro, com uma versão acelerada opcional implementada como uma extensão C; por exemplo, :mod:`pickle` e :mod:`!cPickle`. Isso coloca o fardo de importar a versão acelerada e recorrer à versão Python pura em cada usuário desses módulos. No Python 3.0, as versões aceleradas são consideradas detalhes de implementação das versões Python puras. Os usuários devem sempre importar a versão padrão, que tenta importar a versão acelerada e recorrer à versão Python pura. O par :mod:`pickle` / :mod:`!cPickle` recebeu esse tratamento. O módulo :mod:`profile` está na lista para 3.1. O módulo :mod:`!StringIO` foi transformado em uma classe no módulo :mod:`io`.

source: Some related modules have been grouped into packages, and usually the submodule names have been simplified. The resulting new packages are:
pt_br: Alguns módulos relacionados foram agrupados em pacotes e, geralmente, os nomes dos submódulos foram simplificados. Os novos pacotes resultantes são:

source: :mod:`tkinter` (all ``Tkinter``-related modules except :mod:`turtle`). The target audience of :mod:`turtle` doesn't really care about :mod:`tkinter`. Also note that as of Python 2.6, the functionality of :mod:`turtle` has been greatly enhanced.
pt_br: :mod:`tkinter` (todos os módulos relacionados a ``Tkinter``, exceto :mod:`turtle`). O público-alvo de :mod:`turtle` não se importa muito com :mod:`tkinter`. Observe também que, a partir do Python 2.6, a funcionalidade de :mod:`turtle` foi bastante aprimorada.

source: Some other changes to standard library modules, not covered by :pep:`3108`:
pt_br: Algumas outras mudanças nos módulos da biblioteca padrão, não cobertas pela :pep:`3108`:

source: Killed :mod:`!sets`. Use the built-in :func:`set` class.
pt_br: :mod:`!sets` eliminado. Use a classe embutida :func:`set`.

source: Cleanup of the :mod:`sys` module: removed :func:`!sys.exitfunc`, :func:`!sys.exc_clear`, :data:`!sys.exc_type`, :data:`!sys.exc_value`, :data:`!sys.exc_traceback`. (Note that :data:`sys.last_type` etc. remain.)
pt_br: Limpeza do módulo :mod:`sys`: removidos :func:`!sys.exitfunc`, :func:`!sys.exc_clear`, :data:`!sys.exc_type`, :data:`!sys.exc_value`, :data:`!sys.exc_traceback`. (Observe que :data:`sys.last_type` etc. permanecem.)

source: Cleanup of the :class:`array.array` type: the :meth:`!read` and :meth:`!write` methods are gone; use :meth:`~array.array.fromfile` and :meth:`~array.array.tofile` instead. Also, the ``'c'`` typecode for array is gone -- use either ``'b'`` for bytes or ``'u'`` for Unicode characters.
pt_br: Limpeza do tipo :class:`array.array`: os métodos :meth:`!read` e :meth:`!write` foram removidos; use :meth:`~array.array.fromfile` e :meth:`~array.array.tofile` em vez disso. Além disso, o typecode ``'c'`` para vetor foi removido -- use ``'b'`` para bytes ou ``'u'`` para caracteres Unicode.

source: Cleanup of the :mod:`!thread` module: :func:`!acquire_lock` and :func:`!release_lock` are gone; use :meth:`~threading.Lock.acquire` and :meth:`~threading.Lock.release` instead.
pt_br: Limpeza do módulo :mod:`!thread`: :func:`!acquire_lock` e :func:`!release_lock` foram removidos; use :meth:`~threading.Lock.acquire` e :meth:`~threading.Lock.release` em vez disso.

source: The :mod:`!new` module is gone.
pt_br: O módulo :mod:`!new` foi removido.

source: The :mod:`tokenize` module has been changed to work with bytes. The main entry point is now :func:`tokenize.tokenize`, instead of generate_tokens.
pt_br: O módulo :mod:`tokenize` foi alterado para funcionar com bytes. O ponto de entrada principal agora é :func:`tokenize.tokenize`, em vez de generate_tokens.

source: :pep:`3101`: A New Approach To String Formatting
pt_br: :pep:`3101`: Uma nova abordagem para formatação de strings

source: A new system for built-in string formatting operations replaces the ``%`` string formatting operator. (However, the ``%`` operator is still supported; it will be deprecated in Python 3.1 and removed from the language at some later time.) Read :pep:`3101` for the full scoop.
pt_br: Um novo sistema para operações de formatação de strings embutidas substitui o operador de formatação de strings ``%``. (No entanto, o operador ``%`` ainda é suportado; ele será descontinuado no Python 3.1 e removido da linguagem em algum momento posterior.) Leia a :pep:`3101` para obter informações completas.

source: Changes To Exceptions
pt_br: Mudanças para exceções

source: The APIs for raising and catching exception have been cleaned up and new powerful features added:
pt_br: As APIs para levantar e capturar exceções foram limpas e novos recursos poderosos foram adicionados:

source: :pep:`352`: All exceptions must be derived (directly or indirectly) from :exc:`BaseException`. This is the root of the exception hierarchy. This is not new as a recommendation, but the *requirement* to inherit from :exc:`BaseException` is new. (Python 2.6 still allowed classic classes to be raised, and placed no restriction on what you can catch.) As a consequence, string exceptions are finally truly and utterly dead.
pt_br: :pep:`352`: Todas as exceções devem ser derivadas (direta ou indiretamente) de :exc:`BaseException`. Esta é a raiz da hierarquia de exceções. Isso não é novo como recomendação, mas o *requisito* para herdar de :exc:`BaseException` é novo. (O Python 2.6 ainda permitia que classes clássicas fossem levantadas e não colocava nenhuma restrição sobre o que você pode capturar.) Como consequência, exceções de string estão finalmente verdadeira e completamente mortas.

source: Almost all exceptions should actually derive from :exc:`Exception`; :exc:`BaseException` should only be used as a base class for exceptions that should only be handled at the top level, such as :exc:`SystemExit` or :exc:`KeyboardInterrupt`. The recommended idiom for handling all exceptions except for this latter category is to use :keyword:`except` :exc:`Exception`.
pt_br: Quase todas as exceções devem derivar de :exc:`Exception`; :exc:`BaseException` deve ser usado apenas como uma classe base para exceções que devem ser manipuladas apenas no nível superior, como :exc:`SystemExit` ou :exc:`KeyboardInterrupt`. O idioma recomendado para manipular todas as exceções, exceto para esta última categoria, é usar :keyword:`except` :exc:`Exception`.

source: :pep:`3109`: Raising exceptions. You must now use :samp:`raise {Exception}({args})` instead of :samp:`raise {Exception}, {args}`. Additionally, you can no longer explicitly specify a traceback; instead, if you *have* to do this, you can assign directly to the :attr:`~BaseException.__traceback__` attribute (see below).
pt_br: :pep:`3109`: levantando exceções. Agora você deve usar :samp:`raise {Exception}({args})` em vez de :samp:`raise {Exception}, {args}`. Além disso, você não pode mais especificar explicitamente um traceback (situação da pilha de execução); em vez disso, se você *precisar* fazer isso, você pode atribuir diretamente ao atributo :attr:`~BaseException.__traceback__` (veja abaixo).

source: :pep:`3110`: Catching exceptions. You must now use :samp:`except {SomeException} as {variable}` instead of :samp:`except {SomeException}, {variable}`. Moreover, the *variable* is explicitly deleted when the :keyword:`except` block is left.
pt_br: :pep:`3110`: Capturando exceções. Agora você deve usar :samp:`except {SomeException} as {variable}` em vez de :samp:`except {SomeException}, {variable}`. Além disso, a variável *variable* é explicitamente excluída quando o bloco :keyword:`except` é deixado.

source: :pep:`3134`: Exception chaining. There are two cases: implicit chaining and explicit chaining. Implicit chaining happens when an exception is raised in an :keyword:`except` or :keyword:`finally` handler block. This usually happens due to a bug in the handler block; we call this a *secondary* exception. In this case, the original exception (that was being handled) is saved as the :attr:`~BaseException.__context__` attribute of the secondary exception. Explicit chaining is invoked with this syntax::
pt_br: :pep:`3134`: Encadeamento de exceções. Existem dois casos: encadeamento implícito e encadeamento explícito. O encadeamento implícito acontece quando uma exceção é levantada em um bloco manipulador :keyword:`except` ou :keyword:`finally`. Isso geralmente acontece devido a um bug no bloco do manipulador; chamamos isso de exceção *secundária*. Nesse caso, a exceção original (que estava sendo manipulada) é salva como o atributo :attr:`~BaseException.__context__` da exceção secundária. O encadeamento explícito é invocado com esta sintaxe::

source: (where *primary_exception* is any expression that produces an exception object, probably an exception that was previously caught). In this case, the primary exception is stored on the :attr:`~BaseException.__cause__` attribute of the secondary exception. The traceback printed when an unhandled exception occurs walks the chain of :attr:`!__cause__` and :attr:`~BaseException.__context__` attributes and prints a separate traceback for each component of the chain, with the primary exception at the top. (Java users may recognize this behavior.)
pt_br: (onde *primary_exception* é qualquer expressão que produz um objeto de exceção, provavelmente uma exceção que foi capturada anteriormente). Neste caso, a exceção primária é armazenada no atributo :attr:`~BaseException.__cause__` da exceção secundária. O traceback impresso quando uma exceção não tratada ocorre percorre a cadeia de atributos :attr:`!__cause__` e :attr:`~BaseException.__context__` e imprime um traceback separado para cada componente da cadeia, com a exceção primária no topo. (Usuários Java podem reconhecer este comportamento.)

source: :pep:`3134`: Exception objects now store their traceback as the :attr:`~BaseException.__traceback__` attribute. This means that an exception object now contains all the information pertaining to an exception, and there are fewer reasons to use :func:`sys.exc_info` (though the latter is not removed).
pt_br: :pep:`3134`: Objetos exceção agora armazenam seu traceback como o atributo :attr:`~BaseException.__traceback__`. Isso significa que um objeto de exceção agora contém todas as informações pertencentes a uma exceção, e há menos motivos para usar :func:`sys.exc_info` (embora o último não seja removido).

source: A few exception messages are improved when Windows fails to load an extension module. For example, ``error code 193`` is now ``%1 is not a valid Win32 application``. Strings now deal with non-English locales.
pt_br: Algumas mensagens de exceção estão melhores quando o Windows falha ao carregar um módulo de extensão. Por exemplo, ``error code 193`` agora é ``%1 is not a valid Win32 application``. As strings agora lidam com localidades que não sejam em inglês.

source: Miscellaneous Other Changes
pt_br: Outras mudanças diversas

source: Operators And Special Methods
pt_br: Operadores e métodos especiais

source: ``!=`` now returns the opposite of ``==``, unless ``==`` returns :data:`NotImplemented`.
pt_br: ``!=`` agora retorna o oposto de ``==``, a menos que ``==`` retorne :data:`NotImplemented`.

source: The concept of "unbound methods" has been removed from the language. When referencing a method as a class attribute, you now get a plain function object.
pt_br: O conceito de "métodos não vinculados" foi removido da linguagem. Ao referenciar um método como um atributo de classe, agora você obtém um objeto função simples.

source: :pep:`3114`: the standard :meth:`next` method has been renamed to :meth:`~iterator.__next__`.
pt_br: :pep:`3114`: o método padrão :meth:`next` foi renomeado para :meth:`~iterator.__next__`.

source: The function attributes named :attr:`!func_X` have been renamed to use the :attr:`!__X__` form, freeing up these names in the function attribute namespace for user-defined attributes. To wit, :attr:`!func_closure`, :attr:`!func_code`, :attr:`!func_defaults`, :attr:`!func_dict`, :attr:`!func_doc`, :attr:`!func_globals`, :attr:`!func_name` were renamed to :attr:`~function.__closure__`, :attr:`~function.__code__`, :attr:`~function.__defaults__`, :attr:`~function.__dict__`, :attr:`~function.__doc__`, :attr:`~function.__globals__`, :attr:`~function.__name__`, respectively.
pt_br: Os atributos de função chamados :attr:`!func_X` foram renomeados para usar o formato :attr:`!__X__`, liberando esses nomes no espaço de nomes de atributos de função para atributos definidos pelo usuário. A saber, :attr:`!func_closure`, :attr:`!func_code`, :attr:`!func_defaults`, :attr:`!func_dict`, :attr:`!func_doc`, :attr:`!func_globals`, :attr:`!func_name` foram renomeados para :attr:`~function.__closure__`, :attr:`~function.__code__`, :attr:`~function.__defaults__`, :attr:`~function.__dict__`, :attr:`~function.__doc__`, :attr:`~function.__globals__`, :attr:`~function.__name__`, respectivamente.

source: :meth:`!__nonzero__` is now :meth:`~object.__bool__`.
pt_br: :meth:`!__nonzero__` agora é :meth:`~object.__bool__`.

source: Builtins
pt_br: Funções embutidas

source: :pep:`3135`: New :func:`super`. You can now invoke :func:`super` without arguments and (assuming this is in a regular instance method defined inside a :keyword:`class` statement) the right class and instance will automatically be chosen. With arguments, the behavior of :func:`super` is unchanged.
pt_br: :pep:`3135`: Nova função :func:`super`. Agora você pode invocar :func:`super` sem argumentos e (presumindo que isso esteja em um método de instância regular definido dentro de uma instrução :keyword:`class`) a classe e instância corretas serão automaticamente escolhidas. Com argumentos, o comportamento de :func:`super` não é alterado.

source: A new built-in function :func:`next` was added to call the :meth:`~iterator.__next__` method on an object.
pt_br: Uma nova função embutido :func:`next` foi adicionada para chamar o método :meth:`~iterator.__next__` em um objeto.

source: The :func:`round` function rounding strategy and return type have changed. Exact halfway cases are now rounded to the nearest even result instead of away from zero. (For example, ``round(2.5)`` now returns ``2`` rather than ``3``.) ``round(x[, n])`` now delegates to ``x.__round__([n])`` instead of always returning a float. It generally returns an integer when called with a single argument and a value of the same type as ``x`` when called with two arguments.
pt_br: A estratégia de arredondamento da função :func:`round` e o tipo de retorno foram alterados. Casos exatos de meio caminho agora são arredondados para o resultado par mais próximo em vez de para longe de zero. (Por exemplo, ``round(2.5)`` agora retorna ``2`` em vez de ``3``.) ``round(x[, n])`` agora delega para ``x.__round__([n])`` em vez de sempre retornar um float. Geralmente retorna um inteiro quando chamado com um único argumento e um valor do mesmo tipo que ``x`` quando chamado com dois argumentos.

source: Build and C API Changes
pt_br: Mudanças a construções e API C

source: Due to time constraints, here is a *very* incomplete list of changes to the C API.
pt_br: Devido a restrições de tempo, aqui está uma lista *muito* incompleta de alterações na API C.

source: Support for several platforms was dropped, including but not limited to Mac OS 9, BeOS, RISCOS, Irix, and Tru64.
pt_br: O suporte para várias plataformas foi descartado, incluindo, mas não se limitando a Mac OS 9, BeOS, RISCOS, Irix e Tru64.

source: :pep:`3118`: New Buffer API.
pt_br: :pep:`3118`: Nova API de Buffer.

source: :pep:`3121`: Extension Module Initialization & Finalization.
pt_br: :pep:`3121`: Inicialização e finalização do módulo de extensão.

source: :pep:`3123`: Making :c:macro:`PyObject_HEAD` conform to standard C.
pt_br: :pep:`3123`: Tornando :c:macro:`PyObject_HEAD` conforme o padrão C.

source: No more C API support for restricted execution.
pt_br: Não há mais suporte à API C para execução restrita.

source: :c:func:`!PyNumber_Coerce`, :c:func:`!PyNumber_CoerceEx`, :c:func:`!PyMember_Get`, and :c:func:`!PyMember_Set` C APIs are removed.
pt_br: As APIs C :c:func:`!PyNumber_Coerce`, :c:func:`!PyNumber_CoerceEx`, :c:func:`!PyMember_Get` e :c:func:`!PyMember_Set` foram removidas.

source: New C API :c:func:`PyImport_ImportModuleNoBlock`, works like :c:func:`PyImport_ImportModule` but won't block on the import lock (returning an error instead).
pt_br: Nova API C :c:func:`PyImport_ImportModuleNoBlock`, funciona como :c:func:`PyImport_ImportModule`, mas não bloqueia na trava de importação (retornando um erro).

source: Renamed the boolean conversion C-level slot and method: ``nb_nonzero`` is now ``nb_bool``.
pt_br: Renomeado o slot e o método de nível C de conversão booleana: ``nb_nonzero`` agora é ``nb_bool``.

source: Removed :c:macro:`!METH_OLDARGS` and :c:macro:`!WITH_CYCLE_GC` from the C API.
pt_br: Removidas :c:macro:`!METH_OLDARGS` e :c:macro:`!WITH_CYCLE_GC` da API C.

source: Performance
pt_br: Desempenho

source: The net result of the 3.0 generalizations is that Python 3.0 runs the pystone benchmark around 10% slower than Python 2.5. Most likely the biggest cause is the removal of special-casing for small integers. There's room for improvement, but it will happen after 3.0 is released!
pt_br: O resultado líquido das generalizações do 3.0 é que o Python 3.0 executa o benchmark pystone cerca de 10% mais lento que o Python 2.5. Provavelmente a maior causa é a remoção do uso de maiúsculas e minúsculas especiais para números inteiros pequenos. Há espaço para melhorias, mas isso acontecerá após o lançamento do 3.0!

source: Porting To Python 3.0
pt_br: Portando para o Python 3.0

source: For porting existing Python 2.5 or 2.6 source code to Python 3.0, the best strategy is the following:
pt_br: Para portar o código-fonte existente do Python 2.5 ou 2.6 para o Python 3.0, a melhor estratégia é a seguinte:

source: (Prerequisite:) Start with excellent test coverage.
pt_br: (Pré-requisito:) Comece com uma excelente cobertura de teste.

source: Port to Python 2.6. This should be no more work than the average port from Python 2.x to Python 2.(x+1). Make sure all your tests pass.
pt_br: Portar para o Python 2.6. Isso não deve dar mais trabalho do que o port médio do Python 2.x para o Python 2.(x+1). Certifique-se de que todos os seus testes passem.

source: (Still using 2.6:) Turn on the :option:`!-3` command line switch. This enables warnings about features that will be removed (or change) in 3.0. Run your test suite again, and fix code that you get warnings about until there are no warnings left, and all your tests still pass.
pt_br: (Ainda usando 2.6:) Ative a opção de linha de comando :option:`!-3`. Isso habilita avisos sobre recursos que serão removidos (ou alterados) no 3.0. Execute seu conjunto de testes novamente e corrija o código sobre o qual você recebe avisos até que não haja mais avisos e todos os seus testes ainda passem.

source: Run the ``2to3`` source-to-source translator over your source code tree. Run the result of the translation under Python 3.0. Manually fix up any remaining issues, fixing problems until all tests pass again.
pt_br: Execute o tradutor de fonte para fonte ``2to3`` em sua árvore de código-fonte. Execute o resultado da tradução no Python 3.0. Corrija manualmente quaisquer problemas restantes, corrigindo problemas até que todos os testes passem novamente.

source: It is not recommended to try to write source code that runs unchanged under both Python 2.6 and 3.0; you'd have to use a very contorted coding style, e.g. avoiding ``print`` statements, metaclasses, and much more. If you are maintaining a library that needs to support both Python 2.6 and Python 3.0, the best approach is to modify step 3 above by editing the 2.6 version of the source code and running the ``2to3`` translator again, rather than editing the 3.0 version of the source code.
pt_br: Não é recomendado tentar escrever código-fonte que seja executado inalterado no Python 2.6 e 3.0; você teria que usar um estilo de codificação muito distorcido, por exemplo, evitando instruções ``print``, metaclasses e muito mais. Se você estiver mantendo uma biblioteca que precisa ter suporte ao Python 2.6 e Python 3.0, a melhor abordagem é modificar a etapa 3 acima editando a versão 2.6 do código-fonte e executando o tradutor ``2to3`` novamente, em vez de editar a versão 3.0 do código-fonte.

source: For porting C extensions to Python 3.0, please see :ref:`cporting-howto`.
pt_br: Para portar extensões C para Python 3.0, consulte :ref:`cporting-howto`.
