Repository: python/python-docs-pt-br
Catalog: whatsnew/3.0.po
Languages: pt_br

source: Filenames are passed to and returned from APIs as (Unicode) strings. This can present platform-specific problems because on some platforms filenames are arbitrary byte strings. (On the other hand, on Windows filenames are natively stored as Unicode.) As a work-around, most APIs (e.g. :func:`open` and many functions in the :mod:`os` module) that take filenames accept :class:`bytes` objects as well as strings, and a few APIs have a way to ask for a :class:`bytes` return value. Thus, :func:`os.listdir` returns a list of :class:`bytes` instances if the argument is a :class:`bytes` instance, and :func:`os.getcwdb` returns the current working directory as a :class:`bytes` instance. Note that when :func:`os.listdir` returns a list of strings, filenames that cannot be decoded properly are omitted rather than raising :exc:`UnicodeError`.
pt_br: Nomes de arquivo são passados e retornados de APIs como strings (Unicode). Isso pode apresentar problemas específicos de plataforma porque em algumas plataformas nomes de arquivo são strings de bytes arbitrárias. (Por outro lado, no Windows nomes de arquivo são armazenados nativamente como Unicode.) Como solução alternativa, a maioria das APIs (por exemplo, :func:`open` e muitas funções no módulo :mod:`os`) que aceitam nomes de arquivo aceitam objetos :class:`bytes` assim como strings, e algumas APIs têm uma maneira de pedir um valor de retorno :class:`bytes`. Assim, :func:`os.listdir` retorna uma lista de instâncias :class:`bytes` se o argumento for uma instância :class:`bytes`, e :func:`os.getcwdb` retorna o diretório de trabalho atual como uma instância :class:`bytes`. Observe que quando :func:`os.listdir` retorna uma lista de strings, os nomes de arquivos que não podem ser decodificados corretamente são omitidos em vez de levantar :exc:`UnicodeError`.

source: Some system APIs like :data:`os.environ` and :data:`sys.argv` can also present problems when the bytes made available by the system is not interpretable using the default encoding. Setting the ``LANG`` variable and rerunning the program is probably the best approach.
pt_br: Algumas APIs de sistema como :data:`os.environ` e :data:`sys.argv` também podem apresentar problemas quando os bytes disponibilizados pelo sistema não são interpretáveis usando a codificação padrão. Definir a variável ``LANG`` e executar o programa novamente é provavelmente a melhor abordagem.

source: :pep:`3138`: The :func:`repr` of a string no longer escapes non-ASCII characters. It still escapes control characters and code points with non-printable status in the Unicode standard, however.
pt_br: :pep:`3138`: A :func:`repr` de uma string não escapa mais caracteres não-ASCII. No entanto, ele ainda escapa caracteres de controle e pontos de código com status não imprimível no padrão Unicode.

source: :pep:`3120`: The default source encoding is now UTF-8.
pt_br: :pep:`3120`: A codificação de fontes padrão agora é UTF-8.

source: :pep:`3131`: Non-ASCII letters are now allowed in identifiers. (However, the standard library remains ASCII-only with the exception of contributor names in comments.)
pt_br: :pep:`3131`: Letras não ASCII agora são permitidas em identificadores. (No entanto, a biblioteca padrão permanece somente ASCII, com exceção dos nomes dos colaboradores nos comentários.)

source: The :mod:`!StringIO` and :mod:`!cStringIO` modules are gone. Instead, import the :mod:`io` module and use :class:`io.StringIO` or :class:`io.BytesIO` for text and data respectively.
pt_br: Os módulos :mod:`!StringIO` e :mod:`!cStringIO` se foram. Em vez disso, importe o módulo :mod:`io` e use :class:`io.StringIO` ou :class:`io.BytesIO` para texto e dados, respectivamente.

source: See also the :ref:`unicode-howto`, which was updated for Python 3.0.
pt_br: Veja também o guia :ref:`unicode-howto`, que foi atualizado para o Python 3.0.

source: Overview Of Syntax Changes
pt_br: Visão geral das alterações da sintaxe

source: This section gives a brief overview of every *syntactic* change in Python 3.0.
pt_br: Esta seção fornece uma breve visão geral de cada mudança *sintática* no Python 3.0.

source: New Syntax
pt_br: Nova sintaxe

source: :pep:`3107`: Function argument and return value annotations. This provides a standardized way of annotating a function's parameters and return value. There are no semantics attached to such annotations except that they can be introspected at runtime using the :attr:`~object.__annotations__` attribute. The intent is to encourage experimentation through metaclasses, decorators or frameworks.
pt_br: :pep:`3107`: Anotações de argumento de função e valor de retorno. Isso fornece uma maneira padronizada de anotar os parâmetros e o valor de retorno de uma função. Não há semântica anexada a essas anotações, exceto que elas podem ser introspectadas em tempo de execução usando o atributo :attr:`~object.__annotations__`. A intenção é encorajar a experimentação por meio de metaclasses, decoradores ou frameworks.

source: :pep:`3102`: Keyword-only arguments. Named parameters occurring after ``*args`` in the parameter list *must* be specified using keyword syntax in the call. You can also use a bare ``*`` in the parameter list to indicate that you don't accept a variable-length argument list, but you do have keyword-only arguments.
pt_br: :pep:`3102`: Argumentos somente-nomeados. Parâmetros nomeados que ocorrem após ``*args`` na lista de parâmetros *devem* ser especificados usando a sintaxe dos nomes na chamada. Você também pode usar um ``*`` simples na lista de parâmetros para indicar que não aceita uma lista de argumentos de comprimento variável, mas tem argumentos somente-nomeados.

source: Keyword arguments are allowed after the list of base classes in a class definition. This is used by the new convention for specifying a metaclass (see next section), but can be used for other purposes as well, as long as the metaclass supports it.
pt_br: Argumentos nomeados são permitidos após a lista de classes base em uma definição de classe. Isso é usado pela nova convenção para especificar uma metaclasse (veja a próxima seção), mas pode ser usado para outros propósitos também, desde que a metaclasse dê suporte.

source: :pep:`3104`: :keyword:`nonlocal` statement. Using ``nonlocal x`` you can now assign directly to a variable in an outer (but non-global) scope. :keyword:`!nonlocal` is a new reserved word.
pt_br: :pep:`3104`: instrução :keyword:`nonlocal`. Usando ``nonlocal x``, agora você pode atribuir diretamente a uma variável em um escopo externo (mas não global). :keyword:`!nonlocal` é uma nova palavra reservada.

source: :pep:`3132`: Extended Iterable Unpacking. You can now write things like ``a, b, *rest = some_sequence``. And even ``*rest, a = stuff``. The ``rest`` object is always a (possibly empty) list; the right-hand side may be any iterable. Example::
pt_br: :pep:`3132`: Desempacotamento iterável estendido. Agora você pode escrever coisas como ``a, b, *rest = some_sequence``. E até mesmo ``*rest, a = stuff``. O objeto ``rest`` é sempre uma lista (possivelmente vazia); o lado direito pode ser qualquer iterável. Exemplo::

source: This sets *a* to ``0``, *b* to ``4``, and *rest* to ``[1, 2, 3]``.
pt_br: Isso define *a* como ``0``, *b* como ``4`` e *rest* como ``[1, 2, 3]``.

source: Dictionary comprehensions: ``{k: v for k, v in stuff}`` means the same thing as ``dict(stuff)`` but is more flexible. (This is :pep:`274` vindicated. :-)
pt_br: Compreensões de dicionário: ``{k: v for k, v in stuff}`` significa a mesma coisa que ``dict(stuff)``, mas é mais flexível. (Isto é :pep:`274` justificada. :-)

source: Set literals, e.g. ``{1, 2}``. Note that ``{}`` is an empty dictionary; use ``set()`` for an empty set. Set comprehensions are also supported; e.g., ``{x for x in stuff}`` means the same thing as ``set(stuff)`` but is more flexible.
pt_br: Definir literais, por exemplo, ``{1, 2}``. Note que ``{}`` é um dicionário vazio; use ``set()`` para um conjunto vazio. Compreensões de conjuntos também são suportadas; por exemplo, ``{x for x in stuff}`` significa a mesma coisa que ``set(stuff)``, mas é mais flexível.

source: New octal literals, e.g. ``0o720`` (already in 2.6). The old octal literals (``0720``) are gone.
pt_br: Novos literais octais, por exemplo, ``0o720`` (já em 2.6). Os antigos literais octais (``0720``) se foram.

source: New binary literals, e.g. ``0b1010`` (already in 2.6), and there is a new corresponding built-in function, :func:`bin`.
pt_br: Novos literais binários, por exemplo, ``0b1010`` (já em 2.6), e há uma nova função embutida correspondente, :func:`bin`.

source: Bytes literals are introduced with a leading ``b`` or ``B``, and there is a new corresponding built-in function, :func:`bytes`.
pt_br: Literais de bytes são introduzidos com um ``b`` ou ``B`` no início, e há uma nova função embutida correspondente, :func:`bytes`.

source: Changed Syntax
pt_br: Sintaxe alterada

source: :pep:`3109` and :pep:`3134`: new :keyword:`raise` statement syntax: :samp:`raise [{expr} [from {expr}]]`. See below.
pt_br: :pep:`3109` e :pep:`3134`: nova sintaxe da instrução :keyword:`raise`: :samp:`raise [{expr} [from {expr}]]`. Veja abaixo.

source: :keyword:`!as` and :keyword:`with` are now reserved words. (Since 2.6, actually.)
pt_br: :keyword:`!as` e :keyword:`with` agora são palavras reservadas. (Desde a versão 2.6, na verdade.)

source: ``True``, ``False``, and ``None`` are reserved words. (2.6 partially enforced the restrictions on ``None`` already.)
pt_br: ``True``, ``False`` e ``None`` são palavras reservadas. (A versão 2.6 já aplicava parcialmente as restrições em ``None``.)

source: Change from :keyword:`except` *exc*, *var* to :keyword:`!except` *exc* :keyword:`!as` *var*. See :pep:`3110`.
pt_br: Alteração de :keyword:`except` *exc*, *var* para :keyword:`!except` *exc* :keyword:`!as` *var*. Veja a :pep:`3110`.

source: :pep:`3115`: New Metaclass Syntax. Instead of::
pt_br: :pep:`3115`: Nova sintaxe de metaclasse. Em vez de::

source: you must now use::
pt_br: agora você deve usar::

source: The module-global :data:`!__metaclass__` variable is no longer supported. (It was a crutch to make it easier to default to new-style classes without deriving every class from :class:`object`.)
pt_br: A variável global do módulo :data:`!__metaclass__` não é mais suportada. (Era uma ajuda para facilitar a mudança do padrão para classes de novo estilo sem derivar cada classe de :class:`object`.)

source: List comprehensions no longer support the syntactic form :samp:`[... for {var} in {item1}, {item2}, ...]`. Use :samp:`[... for {var} in ({item1}, {item2}, ...)]` instead. Also note that list comprehensions have different semantics: they are closer to syntactic sugar for a generator expression inside a :func:`list` constructor, and in particular the loop control variables are no longer leaked into the surrounding scope.
pt_br: As compreensões de lista não têm mais suporte a mais a forma sintática :samp:`[... for {var} in {item1}, {item2}, ...]`. Use :samp:`[... for {var} in ({item1}, {item2}, ...)]` em vez disso. Observe também que as compreensões de lista têm semântica diferente: elas estão mais próximas do açúcar sintático para uma expressão geradora dentro de um construtor :func:`list` e, em particular, as variáveis de controle de laço não são mais vazadas para o escopo circundante.

source: The *ellipsis* (``...``) can be used as an atomic expression anywhere. (Previously it was only allowed in slices.) Also, it *must* now be spelled as ``...``. (Previously it could also be spelled as ``. . .``, by a mere accident of the grammar.)
pt_br: As *reticências* (``...``) podem ser usadas como uma expressão atômica em qualquer lugar. (Anteriormente, eram permitidas apenas em fatias.) Além disso, agora *devem* ser escritas como ``...``. (Anteriormente, também poderiam ser escritas como ``. . .``, por um mero acidente da gramática.)

source: Removed Syntax
pt_br: Sintaxe removida

source: :pep:`3113`: Tuple parameter unpacking removed. You can no longer write ``def foo(a, (b, c)): ...``. Use ``def foo(a, b_c): b, c = b_c`` instead.
pt_br: :pep:`3113`: Desempacotamento de parâmetro de tupla removido. Você não pode mais escrever ``def foo(a, (b, c)): ...``. Em vez disso, use ``def foo(a, b_c): b, c = b_c``.

source: Removed backticks (use :func:`repr` instead).
pt_br: Removidos backticks (use :func:`repr`).

source: Removed ``<>`` (use ``!=`` instead).
pt_br: Removido ``<>`` (use ``!=``).

source: Removed keyword: :func:`exec` is no longer a keyword; it remains as a function. (Fortunately the function syntax was also accepted in 2.x.) Also note that :func:`exec` no longer takes a stream argument; instead of ``exec(f)`` you can use ``exec(f.read())``.
pt_br: Removida palavra reservada: :func:`exec` não é mais uma palavra reservada; ela permanece como uma função. (Felizmente a sintaxe da função também era aceita nas versões 2.x.) Observe também que :func:`exec` não aceita mais um argumento de fluxo; em vez de ``exec(f)`` você pode usar ``exec(f.read())``.

source: Integer literals no longer support a trailing ``l`` or ``L``.
pt_br: Literais de inteiro não mais têm suporte a um ``l`` ou ``L`` final.

source: String literals no longer support a leading ``u`` or ``U``.
pt_br: Literais de string não mais têm suporte a um ``u`` ou ``U`` no início.

source: The :keyword:`from` *module* :keyword:`import` ``*`` syntax is only allowed at the module level, no longer inside functions.
pt_br: A sintaxe :keyword:`from` *módulo* :keyword:`import` ``*`` é permitida somente no nível do módulo, não mais dentro de funções.

source: The only acceptable syntax for relative imports is :samp:`from .[{module}] import {name}`. All :keyword:`import` forms not starting with ``.`` are interpreted as absolute imports. (:pep:`328`)
pt_br: A única sintaxe aceitável para importações relativas é :samp:`from .[{module}] import {name}`. Todos as formas de :keyword:`import` que não começam com ``.`` são interpretadas como importações absolutas. (:pep:`328`)

source: Classic classes are gone.
pt_br: As classes clássicas se foram.

source: Changes Already Present In Python 2.6
pt_br: Mudanças já presentes no Python 2.6

source: Since many users presumably make the jump straight from Python 2.5 to Python 3.0, this section reminds the reader of new features that were originally designed for Python 3.0 but that were back-ported to Python 2.6. The corresponding sections in :ref:`whats-new-in-2.6` should be consulted for longer descriptions.
pt_br: Como muitos usuários provavelmente fazem o salto direto do Python 2.5 para o Python 3.0, esta seção lembra o leitor dos novos recursos que foram originalmente projetados para o Python 3.0, mas que foram portados de volta para o Python 2.6. As seções correspondentes em :ref:`whats-new-in-2.6` devem ser consultadas para descrições mais longas.

source: :ref:`pep-0343`. The :keyword:`with` statement is now a standard feature and no longer needs to be imported from the :mod:`__future__`. Also check out :ref:`new-26-context-managers` and :ref:`new-module-contextlib`.
pt_br: :ref:`pep-0343`. A instrução :keyword:`with` agora é um recurso padrão e não precisa mais ser importada de :mod:`__future__`. Confira também :ref:`new-26-context-managers` e :ref:`new-module-contextlib`.

source: :ref:`pep-0366`. This enhances the usefulness of the :option:`-m` option when the referenced module lives in a package.
pt_br: :ref:`pep-0366`. Isso aumenta a utilidade da opção :option:`-m` quando o módulo referenciado reside em um pacote.

source: :ref:`pep-3101`. Note: the 2.6 description mentions the :meth:`format` method for both 8-bit and Unicode strings. In 3.0, only the :class:`str` type (text strings with Unicode support) supports this method; the :class:`bytes` type does not. The plan is to eventually make this the only API for string formatting, and to start deprecating the ``%`` operator in Python 3.1.
pt_br: :ref:`pep-3101`. Nota: a descrição da versão 2.6 menciona o método :meth:`format` para strings de 8 bits e Unicode. No 3.0, apenas o tipo :class:`str` (strings de texto com suporte a Unicode) tem suporte a esse método; o tipo :class:`bytes` não. O plano é eventualmente tornar esta a única API para formatação de strings e começar a descontinuar o operador ``%`` no Python 3.1.

source: :ref:`pep-3105`. This is now a standard feature and no longer needs to be imported from :mod:`__future__`. More details were given above.
pt_br: :ref:`pep-3105`. Este é agora um recurso padrão e não precisa mais ser importado de :mod:`__future__`. Mais detalhes foram fornecidos acima.

source: :ref:`pep-3110`. The :keyword:`except` *exc* :keyword:`!as` *var* syntax is now standard and :keyword:`!except` *exc*, *var* is no longer supported. (Of course, the :keyword:`!as` *var* part is still optional.)
pt_br: :ref:`pep-3110`. A sintaxe :keyword:`except` *exc* :keyword:`!as` *var* agora é padrão e :keyword:`!except` *exc*, *var* não é mais suportado. (Claro, a parte :keyword:`!as` *var* ainda é opcional.)

source: :ref:`pep-3112`. The ``b"..."`` string literal notation (and its variants like ``b'...'``, ``b"""..."""``, and ``br"..."``) now produces a literal of type :class:`bytes`.
pt_br: :ref:`pep-3112`. A notação de literal de string ``b"..."`` (e suas variantes como ``b'...'``, ``b"""..."""`` e ``br"..."``) agora produz um literal do tipo :class:`bytes`.

source: :ref:`pep-3116`. The :mod:`io` module is now the standard way of doing file I/O. The built-in :func:`open` function is now an alias for :func:`io.open` and has additional keyword arguments *encoding*, *errors*, *newline* and *closefd*. Also note that an invalid *mode* argument now raises :exc:`ValueError`, not :exc:`IOError`. The binary file object underlying a text file object can be accessed as :attr:`!f.buffer` (but beware that the text object maintains a buffer of itself in order to speed up the encoding and decoding operations).
pt_br: :ref:`pep-3116`. O módulo :mod:`io` agora é a maneira padrão de fazer E/S de arquivo. A função embutida :func:`open` agora é um apelido para :func:`io.open` e tem argumentos nomeados adicionais *encoding*, *errors*, *newline* e *closefd*. Observe também que um argumento *mode* inválido agora levanta :exc:`ValueError`, não :exc:`IOError`. O objeto arquivo binário subjacente a um objeto arquivo texto pode ser acessado como :attr:`!f.buffer` (mas tome cuidado, pois o objeto texto mantém um buffer de si mesmo para acelerar as operações de codificação e decodificação).

source: :ref:`pep-3118`. The old builtin :func:`!buffer` is now really gone; the new builtin :func:`memoryview` provides (mostly) similar functionality.
pt_br: :ref:`pep-3118`. A antiga função embutida :func:`!buffer` agora realmente se foi; a nova função embutida :func:`memoryview` fornece funcionalidade (principalmente) semelhante.

source: :ref:`pep-3119`. The :mod:`abc` module and the ABCs defined in the :mod:`collections` module plays a somewhat more prominent role in the language now, and built-in collection types like :class:`dict` and :class:`list` conform to the :class:`collections.MutableMapping <collections.abc.MutableMapping>` and :class:`collections.MutableSequence <collections.abc.MutableSequence>` ABCs, respectively.
pt_br: :ref:`pep-3119`. O módulo :mod:`abc` e as ABCs definidas no módulo :mod:`collections` desempenham um papel um pouco mais proeminente na linguagem agora, e tipos embutidos de coleção como :class:`dict` e :class:`list` estão em conformidade com as ABCs :class:`collections.MutableMapping <collections.abc.MutableMapping>` e :class:`collections.MutableSequence <collections.abc.MutableSequence>`, respectivamente.

source: :ref:`pep-3127`. As mentioned above, the new octal literal notation is the only one supported, and binary literals have been added.
pt_br: :ref:`pep-3127`. Conforme mencionado acima, a nova notação de literal octal é a única suportada, e literais binários foram adicionados.

source: :ref:`pep-3141`. The :mod:`numbers` module is another new use of ABCs, defining Python's "numeric tower". Also note the new :mod:`fractions` module which implements :class:`numbers.Rational`.
pt_br: :ref:`pep-3141`. O módulo :mod:`numbers` é outro novo uso de ABCs, definindo a "torre numérica" do Python. Observe também o novo módulo :mod:`fractions` que implementa :class:`numbers.Rational`.

source: Library Changes
pt_br: Mudanças na biblioteca

source: Due to time constraints, this document does not exhaustively cover the very extensive changes to the standard library. :pep:`3108` is the reference for the major changes to the library. Here's a capsule review:
pt_br: Devido a restrições de tempo, este documento não cobre exaustivamente as mudanças muito extensas na biblioteca padrão. :pep:`3108` é a referência para as principais mudanças na biblioteca. Aqui está uma revisão resumida:

source: Many old modules were removed. Some, like :mod:`!gopherlib` (no longer used) and :mod:`!md5` (replaced by :mod:`hashlib`), were already deprecated by :pep:`4`. Others were removed as a result of the removal of support for various platforms such as Irix, BeOS and Mac OS 9 (see :pep:`11`). Some modules were also selected for removal in Python 3.0 due to lack of use or because a better replacement exists. See :pep:`3108` for an exhaustive list.
pt_br: Muitos módulos antigos foram removidos. Alguns, como :mod:`!gopherlib` (não mais usado) e :mod:`!md5` (substituído por :mod:`hashlib`), já tinham sido descontinuados pela :pep:`4`. Outros foram removidos como resultado da remoção do suporte para várias plataformas, como Irix, BeOS e Mac OS 9 (veja :pep:`11`). Alguns módulos também foram selecionados para remoção no Python 3.0 devido à falta de uso ou porque existe uma substituição melhor. Veja :pep:`3108` para uma lista exaustiva.

source: The :mod:`!bsddb3` package was removed because its presence in the core standard library has proved over time to be a particular burden for the core developers due to testing instability and Berkeley DB's release schedule. However, the package is alive and well, externally maintained at https://www.jcea.es/programacion/pybsddb.htm.
pt_br: O pacote :mod:`!bsddb3` foi removido porque sua presença na biblioteca padrão principal provou ao longo do tempo ser um fardo particular para os desenvolvedores principais devido à instabilidade dos testes e ao cronograma de lançamento do Berkeley DB. No entanto, o pacote está vivo e bem, mantido externamente em https://www.jcea.es/programacion/pybsddb.htm.

source: Some modules were renamed because their old name disobeyed :pep:`8`, or for various other reasons. Here's the list:
pt_br: Alguns módulos foram renomeados porque seu nome antigo desobedecia a :pep:`8`, ou por vários outros motivos. Aqui está a lista:

source: Old Name
pt_br: Antigo nome

source: New Name
pt_br: Novo nome
