Repository: python/python-docs-pt-br
Catalog: whatsnew/3.0.po
Languages: pt_br

source: What's New In Python 3.0
pt_br: O que há de novo no Python 3.0

source: Author
pt_br: Autor

source: This article explains the new features in Python 3.0, compared to 2.6. Python 3.0, also known as "Python 3000" or "Py3K", is the first ever *intentionally backwards incompatible* Python release. Python 3.0 was released on December 3, 2008. There are more changes than in a typical release, and more that are important for all Python users. Nevertheless, after digesting the changes, you'll find that Python really hasn't changed all that much -- by and large, we're mostly fixing well-known annoyances and warts, and removing a lot of old cruft.
pt_br: Este artigo explica os novos recursos do Python 3.0, em comparação com o 2.6. O Python 3.0, também conhecido como "Python 3000" ou "Py3K", é o primeiro lançamento do Python *intencionalmente incompatível com versões anteriores*. O Python 3.0 foi lançado em 3 de dezembro de 2008. Há mais mudanças do que em um lançamento típico, e mais que são importantes para todos os usuários do Python. No entanto, depois de digerir as mudanças, você verá que o Python realmente não mudou tanto assim -- em geral, estamos principalmente corrigindo aborrecimentos bem conhecidos, e removendo muita sujeira antiga.

source: This article doesn't attempt to provide a complete specification of all new features, but instead tries to give a convenient overview. For full details, you should refer to the documentation for Python 3.0, and/or the many PEPs referenced in the text. If you want to understand the complete implementation and design rationale for a particular feature, PEPs usually have more details than the regular documentation; but note that PEPs usually are not kept up-to-date once a feature has been fully implemented.
pt_br: Este artigo não tenta fornecer uma especificação completa de todos os novos recursos, mas tenta dar uma visão geral conveniente. Para detalhes completos, você deve consultar a documentação do Python 3.0 e/ou as muitas PEPs referenciadas no texto. Se você quiser entender a implementação completa e a lógica de design para um recurso específico, as PEPs geralmente têm mais detalhes do que a documentação regular; mas observe que as PEPs geralmente não são mantidas atualizadas depois que um recurso foi totalmente implementado.

source: Due to time constraints this document is not as complete as it should have been. As always for a new release, the ``Misc/NEWS`` file in the source distribution contains a wealth of detailed information about every small thing that was changed.
pt_br: Devido a restrições de tempo, este documento não está tão completo quanto deveria ser. Como sempre para um novo lançamento, o arquivo ``Misc/NEWS`` na distribuição fonte contém uma riqueza de informações detalhadas sobre cada pequena coisa que foi alterada.

source: Common Stumbling Blocks
pt_br: Obstáculos comuns

source: This section lists those few changes that are most likely to trip you up if you're used to Python 2.5.
pt_br: Esta seção lista as poucas mudanças que provavelmente irão lhe atrapalhar se você estiver acostumado com o Python 2.5.

source: Print Is A Function
pt_br: print é uma função

source: The ``print`` statement has been replaced with a :func:`print` function, with keyword arguments to replace most of the special syntax of the old ``print`` statement (:pep:`3105`). Examples::
pt_br: A instrução ``print`` foi substituída por uma função :func:`print`, com argumentos nomeados para substituir a maior parte da sintaxe especial da antiga instrução ``print`` (:pep:`3105`). Exemplos::

source: Old: print "The answer is", 2*2 New: print("The answer is", 2*2) Old: print x, # Trailing comma suppresses newline New: print(x, end=" ") # Appends a space instead of a newline Old: print # Prints a newline New: print() # You must call the function! Old: print >>sys.stderr, "fatal error" New: print("fatal error", file=sys.stderr) Old: print (x, y) # prints repr((x, y)) New: print((x, y)) # Not the same as print(x, y)!
pt_br: Antigo: print "The answer is", 2*2 Novo: print("The answer is", 2*2) Antigo: print x, # Vírgula no final suprime nova linha Novo: print(x, end=" ") # Anexa um espaço em vez de uma nova linha Antigo: print # Exibe uma nova linha Novo: print() # Você precisa chamar a função! Antigo: print >>sys.stderr, "fatal error" Novo: print("fatal error", file=sys.stderr) Antigo: print (x, y) # Exibe repr((x, y)) Novo: print((x, y)) # Não é o mesmo que print(x, y)!

source: You can also customize the separator between items, e.g.::
pt_br: Você também pode personalizar o separador entre itens, por exemplo::

source: print("There are <", 2**32, "> possibilities!", sep="")
pt_br: print("Há <", 2**32, "> possibilidades!", sep="")

source: which produces:
pt_br: que produz:

source: There are <4294967296> possibilities!
pt_br: Há <4294967296> possibilidades!

source: Note:
pt_br: Nota:

source: The :func:`print` function doesn't support the "softspace" feature of the old ``print`` statement. For example, in Python 2.x, ``print "A\n", "B"`` would write ``"A\nB\n"``; but in Python 3.0, ``print("A\n", "B")`` writes ``"A\n B\n"``.
pt_br: A função :func:`print` não tem suporte ao recurso "softspace" da antiga instrução ``print``. Por exemplo, no Python 2.x, ``print "A\n", "B"`` escreveria ``"A\nB\n"``; mas no Python 3.0, ``print("A\n", "B")`` escreve ``"A\n B\n"``.

source: Initially, you'll be finding yourself typing the old ``print x`` a lot in interactive mode. Time to retrain your fingers to type ``print(x)`` instead!
pt_br: Inicialmente, você vai se pegar digitando o antigo ``print x`` bastante no modo interativo. É hora de treinar seus dedos para digitar ``print(x)`` em vez disso!

source: When using the ``2to3`` source-to-source conversion tool, all ``print`` statements are automatically converted to :func:`print` function calls, so this is mostly a non-issue for larger projects.
pt_br: Ao usar a ferramenta de conversão de fonte para fonte ``2to3``, todas as instruções ``print`` são automaticamente convertidas em chamadas de função :func:`print`, então isso geralmente não é um problema para projetos maiores.

source: Views And Iterators Instead Of Lists
pt_br: Visualizações e iteradores em vez de listas

source: Some well-known APIs no longer return lists:
pt_br: Algumas APIs conhecidas não retornam mais listas:

source: :class:`dict` methods :meth:`dict.keys`, :meth:`dict.items` and :meth:`dict.values` return "views" instead of lists. For example, this no longer works: ``k = d.keys(); k.sort()``. Use ``k = sorted(d)`` instead (this works in Python 2.5 too and is just as efficient).
pt_br: Os métodos :meth:`dict.keys`, :meth:`dict.items` e :meth:`dict.values` de :class:`dict` retornam visualizações, ou "views", em vez de listas. Por exemplo, isso não funciona mais: ``k = d.keys(); k.sort()``. Use ``k = sorted(d)`` em vez disso (isso funciona no Python 2.5 também e é igualmente eficiente).

source: Also, the :meth:`!dict.iterkeys`, :meth:`!dict.iteritems` and :meth:`!dict.itervalues` methods are no longer supported.
pt_br: Além disso, os métodos :meth:`!dict.iterkeys`, :meth:`!dict.iteritems` e :meth:`!dict.itervalues` não são mais suportados.

source: :func:`map` and :func:`filter` return iterators. If you really need a list and the input sequences are all of equal length, a quick fix is to wrap :func:`map` in :func:`list`, e.g. ``list(map(...))``, but a better fix is often to use a list comprehension (especially when the original code uses :keyword:`lambda`), or rewriting the code so it doesn't need a list at all. Particularly tricky is :func:`map` invoked for the side effects of the function; the correct transformation is to use a regular :keyword:`for` loop (since creating a list would just be wasteful).
pt_br: :func:`map` e :func:`filter` retornam iteradores. Se você realmente precisa de uma lista e as sequências de entrada são todas de comprimento igual, uma solução rápida é envolver :func:`map` em :func:`list`, por exemplo, ``list(map(...))``, mas uma solução melhor é frequentemente usar uma compreensão de lista (especialmente quando o código original usa :keyword:`lambda`), ou reescrever o código para que ele não precise de uma lista. Particularmente complicado é :func:`map` invocado para os efeitos colaterais da função; a transformação correta é usar um laço :keyword:`for` regular (já que criar uma lista seria apenas desperdício).

source: If the input sequences are not of equal length, :func:`map` will stop at the termination of the shortest of the sequences. For full compatibility with :func:`map` from Python 2.x, also wrap the sequences in :func:`itertools.zip_longest`, e.g. ``map(func, *sequences)`` becomes ``list(map(func, itertools.zip_longest(*sequences)))``.
pt_br: Se as sequências de entrada não tiverem o mesmo comprimento, :func:`map` irá parar no término da mais curta das sequências. Para compatibilidade total com :func:`map` do Python 2.x, também envolva as sequências em :func:`itertools.zip_longest`, por exemplo, ``map(func, *sequences)`` se torna ``list(map(func, itertools.zip_longest(*sequences)))``.

source: :func:`range` now behaves like :func:`!xrange` used to behave, except it works with values of arbitrary size. The latter no longer exists.
pt_br: :func:`range` agora se comporta como :func:`!xrange` costumava se comportar, exceto que funciona com valores de tamanho arbitrário. Este último não existe mais.

source: :func:`zip` now returns an iterator.
pt_br: :func:`zip` agora retorna um iterador.

source: Ordering Comparisons
pt_br: Comparações de ordenação

source: Python 3.0 has simplified the rules for ordering comparisons:
pt_br: O Python 3.0 simplificou as regras para ordenar comparações:

source: The ordering comparison operators (``<``, ``<=``, ``>=``, ``>``) raise a TypeError exception when the operands don't have a meaningful natural ordering. Thus, expressions like ``1 < ''``, ``0 > None`` or ``len <= len`` are no longer valid, and e.g. ``None < None`` raises :exc:`TypeError` instead of returning ``False``. A corollary is that sorting a heterogeneous list no longer makes sense -- all the elements must be comparable to each other. Note that this does not apply to the ``==`` and ``!=`` operators: objects of different incomparable types always compare unequal to each other.
pt_br: Os operadores de comparação de ordenação (``<``, ``<=``, ``>=``, ``>``) levantam uma exceção TypeError quando os operandos não têm uma ordenação natural significativa. Assim, expressões como ``1 < ''``, ``0 > None`` ou ``len <= len`` não são mais válidas e, por exemplo, ``None < None`` levanta :exc:`TypeError` em vez de retornar ``False``. Um corolário é que classificar uma lista heterogênea não faz mais sentido -- todos os elementos devem ser comparáveis entre si. Observe que isso não se aplica aos operadores ``==`` e ``!=``: objetos de diferentes tipos incomparáveis sempre são comparados de forma diferente entre si.

source: :meth:`sorted` and :meth:`list.sort` no longer accept the *cmp* argument providing a comparison function. Use the *key* argument instead. N.B. the *key* and *reverse* arguments are now "keyword-only".
pt_br: :meth:`sorted` e :meth:`list.sort` não aceitam mais o argumento *cmp* fornecendo uma função de comparação. Use o argumento *key* em vez disso. N.B. os argumentos *key* e *reverse* agora são "somente-nomeados".

source: The :func:`!cmp` function should be treated as gone, and the :meth:`!__cmp__` special method is no longer supported. Use :meth:`~object.__lt__` for sorting, :meth:`~object.__eq__` with :meth:`~object.__hash__`, and other rich comparisons as needed. (If you really need the :func:`!cmp` functionality, you could use the expression ``(a > b) - (a < b)`` as the equivalent for ``cmp(a, b)``.)
pt_br: A função :func:`!cmp` deve ser tratada como extinta, e o método especial :meth:`!__cmp__` não é mais suportado. Use :meth:`~object.__lt__` para classificação, :meth:`~object.__eq__` com :meth:`~object.__hash__` e outras comparações avançadas conforme necessário. (Se você realmente precisa da funcionalidade :func:`!cmp`, pode usar a expressão ``(a > b) - (a < b)`` como o equivalente para ``cmp(a, b)``.)

source: Integers
pt_br: Inteiros

source: :pep:`237`: Essentially, :class:`!long` renamed to :class:`int`. That is, there is only one built-in integral type, named :class:`int`; but it behaves mostly like the old :class:`!long` type.
pt_br: :pep:`237`: Essencialmente, :class:`!long` foi renomeado para :class:`int`. Ou seja, há apenas um tipo integral embutido, chamado :class:`int`; mas ele se comporta principalmente como o antigo tipo :class:`!long`.

source: :pep:`238`: An expression like ``1/2`` returns a float. Use ``1//2`` to get the truncating behavior. (The latter syntax has existed for years, at least since Python 2.2.)
pt_br: :pep:`238`: Uma expressão como ``1/2`` retorna um float. Use ``1//2`` para obter o comportamento de truncamento. (A última sintaxe existe há anos, pelo menos desde o Python 2.2.)

source: The :data:`!sys.maxint` constant was removed, since there is no longer a limit to the value of integers. However, :data:`sys.maxsize` can be used as an integer larger than any practical list or string index. It conforms to the implementation's "natural" integer size and is typically the same as :data:`!sys.maxint` in previous releases on the same platform (assuming the same build options).
pt_br: A constante :data:`!sys.maxint` foi removida, pois não há mais um limite para o valor de inteiros. No entanto, :data:`sys.maxsize` pode ser usado como um inteiro maior do que qualquer lista prática ou índice de string. Ele está em conformidade com o tamanho inteiro "natural" da implementação e é tipicamente o mesmo que :data:`!sys.maxint` em versões anteriores na mesma plataforma (assumindo as mesmas opções de construção).

source: The :func:`repr` of a long integer doesn't include the trailing ``L`` anymore, so code that unconditionally strips that character will chop off the last digit instead. (Use :func:`str` instead.)
pt_br: O :func:`repr` de um inteiro longo não inclui mais o ``L`` final, então o código que remove esse caractere incondicionalmente cortará o último dígito. (Use :func:`str` em vez disso.)

source: Octal literals are no longer of the form ``0720``; use ``0o720`` instead.
pt_br: Literais octais não estão mais no formato ``0720``; em vez disso, use ``0o720``.

source: Text Vs. Data Instead Of Unicode Vs. 8-bit
pt_br: Texto vs. Dados em vez de Unicode vs. 8 bits

source: Everything you thought you knew about binary data and Unicode has changed.
pt_br: Tudo o que você achava que sabia sobre dados binários e Unicode mudou.

source: Python 3.0 uses the concepts of *text* and (binary) *data* instead of Unicode strings and 8-bit strings. All text is Unicode; however *encoded* Unicode is represented as binary data. The type used to hold text is :class:`str`, the type used to hold data is :class:`bytes`. The biggest difference with the 2.x situation is that any attempt to mix text and data in Python 3.0 raises :exc:`TypeError`, whereas if you were to mix Unicode and 8-bit strings in Python 2.x, it would work if the 8-bit string happened to contain only 7-bit (ASCII) bytes, but you would get :exc:`UnicodeDecodeError` if it contained non-ASCII values. This value-specific behavior has caused numerous sad faces over the years.
pt_br: O Python 3.0 usa os conceitos de *texto* e *dados* (binários) em vez de strings Unicode e strings de 8 bits. Todo texto é Unicode; no entanto, o Unicode *codificado* é representado como dados binários. O tipo usado para armazenar texto é :class:`str`, o tipo usado para armazenar dados é :class:`bytes`. A maior diferença com a situação 2.x é que qualquer tentativa de misturar texto e dados no Python 3.0 levanta :exc:`TypeError`, enquanto que se você misturasse strings Unicode e de 8 bits no Python 2.x, funcionaria se a string de 8 bits contivesse apenas bytes de 7 bits (ASCII), mas você obteria :exc:`UnicodeDecodeError` se contivesse valores não ASCII. Esse comportamento específico de valor causou inúmeras caras tristes ao longo dos anos.

source: As a consequence of this change in philosophy, pretty much all code that uses Unicode, encodings or binary data most likely has to change. The change is for the better, as in the 2.x world there were numerous bugs having to do with mixing encoded and unencoded text. To be prepared in Python 2.x, start using :class:`!unicode` for all unencoded text, and :class:`str` for binary or encoded data only. Then the ``2to3`` tool will do most of the work for you.
pt_br: Como consequência dessa mudança na filosofia, praticamente todo código que usa Unicode, codificações ou dados binários provavelmente terá que mudar. A mudança é para melhor, pois no mundo 2.x havia vários bugs relacionados à mistura de texto codificado e não codificado. Para estar preparado no Python 2.x, comece a usar :class:`!unicode` para todo texto não codificado e :class:`str` apenas para dados binários ou codificados. Então a ferramenta ``2to3`` fará a maior parte do trabalho para você.

source: You can no longer use ``u"..."`` literals for Unicode text. However, you must use ``b"..."`` literals for binary data.
pt_br: Você não pode mais usar literais ``u"..."`` para texto Unicode. No entanto, você deve usar literais ``b"..."`` para dados binários.

source: As the :class:`str` and :class:`bytes` types cannot be mixed, you must always explicitly convert between them. Use :meth:`str.encode` to go from :class:`str` to :class:`bytes`, and :meth:`bytes.decode` to go from :class:`bytes` to :class:`str`. You can also use ``bytes(s, encoding=...)`` and ``str(b, encoding=...)``, respectively.
pt_br: Como os tipos :class:`str` e :class:`bytes` não podem ser misturados, você deve sempre converter explicitamente entre eles. Use :meth:`str.encode` para ir de :class:`str` para :class:`bytes`, e :meth:`bytes.decode` para ir de :class:`bytes` para :class:`str`. Você também pode usar ``bytes(s, encoding=...)`` e ``str(b, encoding=...)``, respectivamente.

source: Like :class:`str`, the :class:`bytes` type is immutable. There is a separate *mutable* type to hold buffered binary data, :class:`bytearray`. Nearly all APIs that accept :class:`bytes` also accept :class:`bytearray`. The mutable API is based on :class:`collections.MutableSequence <collections.abc.MutableSequence>`.
pt_br: Assim como :class:`str`, o tipo :class:`bytes` é imutável. Há um tipo *mutável* separado para armazenar dados binários em buffer, :class:`bytearray`. Quase todas as APIs que aceitam :class:`bytes` também aceitam :class:`bytearray`. A API mutável é baseada em :class:`collections.MutableSequence <collections.abc.MutableSequence>`.

source: All backslashes in raw string literals are interpreted literally. This means that ``'\U'`` and ``'\u'`` escapes in raw strings are not treated specially. For example, ``r'\u20ac'`` is a string of 6 characters in Python 3.0, whereas in 2.6, ``ur'\u20ac'`` was the single "euro" character. (Of course, this change only affects raw string literals; the euro character is ``'\u20ac'`` in Python 3.0.)
pt_br: Todas as contrabarras em literais de strings brutas são interpretadas literalmente. Isso significa que os escapes ``'\U'`` e ``'\u'`` em strings brutas não são tratados de forma especial. Por exemplo, ``r'\u20ac'`` é uma string de 6 caracteres no Python 3.0, enquanto no 2.6, ``ur'\u20ac'`` era o único caractere "euro". (É claro que essa mudança afeta apenas literais de strings brutas; o caractere euro é ``'\u20ac'`` no Python 3.0.)

source: The built-in :class:`!basestring` abstract type was removed. Use :class:`str` instead. The :class:`str` and :class:`bytes` types don't have functionality enough in common to warrant a shared base class. The ``2to3`` tool (see below) replaces every occurrence of :class:`!basestring` with :class:`str`.
pt_br: O tipo abstrato embutido :class:`!basestring` foi removido. Use :class:`str` em vez disso. Os tipos :class:`str` e :class:`bytes` não têm funcionalidade suficiente em comum para garantir uma classe base compartilhada. A ferramenta ``2to3`` (veja abaixo) substitui cada ocorrência de :class:`!basestring` por :class:`str`.

source: Files opened as text files (still the default mode for :func:`open`) always use an encoding to map between strings (in memory) and bytes (on disk). Binary files (opened with a ``b`` in the mode argument) always use bytes in memory. This means that if a file is opened using an incorrect mode or encoding, I/O will likely fail loudly, instead of silently producing incorrect data. It also means that even Unix users will have to specify the correct mode (text or binary) when opening a file. There is a platform-dependent default encoding, which on Unixy platforms can be set with the ``LANG`` environment variable (and sometimes also with some other platform-specific locale-related environment variables). In many cases, but not all, the system default is UTF-8; you should never count on this default. Any application reading or writing more than pure ASCII text should probably have a way to override the encoding. There is no longer any need for using the encoding-aware streams in the :mod:`codecs` module.
pt_br: Arquivos abertos como arquivos texto (ainda o modo padrão para :func:`open`) sempre usam uma codificação para mapear entre strings (na memória) e bytes (no disco). Arquivos binários (abertos com um ``b`` no argumento mode) sempre usam bytes na memória. Isso significa que se um arquivo for aberto usando um modo ou codificação incorretos, a E/S provavelmente falhará ruidosamente, em vez de produzir dados incorretos silenciosamente. Isso também significa que até mesmo usuários Unix terão que especificar o modo correto (texto ou binário) ao abrir um arquivo. Há uma codificação padrão dependente da plataforma, que em plataformas Unixy pode ser definida com a variável de ambiente ``LANG`` (e às vezes também com algumas outras variáveis de ambiente relacionadas à localidade específicas da plataforma). Em muitos casos, mas não em todos, o padrão do sistema é UTF-8; você nunca deve contar com esse padrão. Qualquer aplicação que leia ou escreva mais do que texto ASCII puro provavelmente deve ter uma maneira de substituir a codificação. Não há mais necessidade de usar os fluxos com reconhecimento de codificação no módulo :mod:`codecs`.

source: The initial values of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` are now unicode-only text files (i.e., they are instances of :class:`io.TextIOBase`). To read and write bytes data with these streams, you need to use their :data:`io.TextIOBase.buffer` attribute.
pt_br: Os valores iniciais de :data:`sys.stdin`, :data:`sys.stdout` e :data:`sys.stderr` agora são arquivos texto somente unicode (ou seja, são instâncias de :class:`io.TextIOBase`). Para ler e gravar dados de bytes com esses fluxos, você precisa usar o atributo :data:`io.TextIOBase.buffer` deles.
