Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: Add a new :c:member:`~PyConfig.orig_argv` member to the :c:type:`PyConfig` structure: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
pt_br: Adiciona um novo membro :c:member:`~PyConfig.orig_argv` à estrutura :c:type:`PyConfig`: a lista dos argumentos originais da linha de comando passados para o executável Python. (Contribuição de Victor Stinner em :issue:`23427`.)

source: The :c:func:`PyDateTime_DATE_GET_TZINFO` and :c:func:`PyDateTime_TIME_GET_TZINFO` macros have been added for accessing the ``tzinfo`` attributes of :class:`datetime.datetime` and :class:`datetime.time` objects. (Contributed by Zackery Spytz in :issue:`30155`.)
pt_br: As macros :c:func:`PyDateTime_DATE_GET_TZINFO` e :c:func:`PyDateTime_TIME_GET_TZINFO` foram adicionadas para acessar os atributos ``tzinfo`` dos objetos :class:`datetime.datetime` e :class:`datetime.time`. (Contribuição de Zackery Spytz em :issue:`30155`.)

source: Add a :c:func:`PyCodec_Unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
pt_br: Adiciona uma função :c:func:`PyCodec_Unregister` para cancelar um registro de uma função de pesquisa de codecs. (Contribuição de Hai Shi em :issue:`41842`.)

source: The :c:func:`PyIter_Send` function was added to allow sending value into iterator without raising ``StopIteration`` exception. (Contributed by Vladimir Matveev in :issue:`41756`.)
pt_br: A função :c:func:`PyIter_Send` foi adicionada para permitir o envio de valor para o iterador sem levantar a exceção ``StopIteration``. (Contribuição de Vladimir Matveev em :issue:`41756`.)

source: Add :c:func:`PyUnicode_AsUTF8AndSize` to the limited C API. (Contributed by Alex Gaynor in :issue:`41784`.)
pt_br: Adiciona :c:func:`PyUnicode_AsUTF8AndSize` à API C limitada. (Contribuição de Alex Gaynor em :issue:`41784`.)

source: Add :c:func:`PyModule_AddObjectRef` function: similar to :c:func:`PyModule_AddObject` but don't steal a reference to the value on success. (Contributed by Victor Stinner in :issue:`1635741`.)
pt_br: Adiciona a função :c:func:`PyModule_AddObjectRef`: semelhante a :c:func:`PyModule_AddObject`, mas não roube uma referência ao valor em caso de sucesso. (Contribuição de Victor Stinner em :issue:`1635741`.)

source: Add :c:func:`Py_NewRef` and :c:func:`Py_XNewRef` functions to increment the reference count of an object and return the object. (Contributed by Victor Stinner in :issue:`42262`.)
pt_br: Adiciona as funções :c:func:`Py_NewRef` e :c:func:`Py_XNewRef` para incrementar a contagem de referências de um objeto e retornar o objeto. (Contribuição de Victor Stinner em :issue:`42262`.)

source: The :c:func:`PyType_FromSpecWithBases` and :c:func:`PyType_FromModuleAndSpec` functions now accept a single class as the *bases* argument. (Contributed by Serhiy Storchaka in :issue:`42423`.)
pt_br: As funções :c:func:`PyType_FromSpecWithBases` e :c:func:`PyType_FromModuleAndSpec` agora aceitam uma única classe como o argumento *bases*. (Contribuição de Serhiy Storchaka em :issue:`42423`.)

source: The :c:func:`PyType_FromModuleAndSpec` function now accepts NULL ``tp_doc`` slot. (Contributed by Hai Shi in :issue:`41832`.)
pt_br: A função :c:func:`PyType_FromModuleAndSpec` agora aceita o slot NULL ``tp_doc``. (Contribuição de Hai Shi em :issue:`41832`.)

source: The :c:func:`PyType_GetSlot` function can accept :ref:`static types <static-types>`. (Contributed by Hai Shi and Petr Viktorin in :issue:`41073`.)
pt_br: A função :c:func:`PyType_GetSlot` pode aceitar :ref:`tipos estáticos <static-types>`. (Contribuição de Hai Shi e Petr Viktorin em :issue:`41073`.)

source: Add a new :c:func:`PySet_CheckExact` function to the C-API to check if an object is an instance of :class:`set` but not an instance of a subtype. (Contributed by Pablo Galindo in :issue:`43277`.)
pt_br: Adiciona uma nova função :c:func:`PySet_CheckExact` à C-API para verificar se um objeto é uma instância de :class:`set`, mas não uma instância de um subtipo. (Contribuição de Pablo Galindo em :issue:`43277`.)

source: Add :c:func:`PyErr_SetInterruptEx` which allows passing a signal number to simulate. (Contributed by Antoine Pitrou in :issue:`43356`.)
pt_br: Adiciona :c:func:`PyErr_SetInterruptEx` que permite passar um número de sinal para simular. (Contribuição de Antoine Pitrou em :issue:`43356`.)

source: The limited C API is now supported if :ref:`Python is built in debug mode <debug-build>` (if the ``Py_DEBUG`` macro is defined). In the limited C API, the :c:func:`Py_INCREF` and :c:func:`Py_DECREF` functions are now implemented as opaque function calls, rather than accessing directly the :c:member:`PyObject.ob_refcnt` member, if Python is built in debug mode and the ``Py_LIMITED_API`` macro targets Python 3.10 or newer. It became possible to support the limited C API in debug mode because the :c:type:`PyObject` structure is the same in release and debug mode since Python 3.8 (see :issue:`36465`).
pt_br: A API C limitada agora é suportada se o :ref:`Python for compilado no modo de depuração <debug-build>` (se a macro ``Py_DEBUG`` estiver definida). Na API C limitada, as funções :c:func:`Py_INCREF` e :c:func:`Py_DECREF` agora são implementadas como chamadas de função opacas, em vez de acessar diretamente o membro :c:member:`PyObject.ob_refcnt`, se o Python for compilado no modo de depuração e a macro ``Py_LIMITED_API`` tiver como alvo o Python 3.10 ou mais recente. Tornou-se possível suportar a API C limitada no modo de depuração porque a estrutura :c:type:`PyObject` é a mesma no modo de lançamento e depuração desde o Python 3.8 (consulte :issue:`36465`).

source: The limited C API is still not supported in the :option:`--with-trace-refs` special build (``Py_TRACE_REFS`` macro). (Contributed by Victor Stinner in :issue:`43688`.)
pt_br: A API C limitada ainda não é suportada na compilação especial :option:`--with-trace-refs` (macro ``Py_TRACE_REFS``). (Contribuição de Victor Stinner em :issue:`43688`.)

source: Add the :c:func:`Py_Is(x, y) <Py_Is>` function to test if the *x* object is the *y* object, the same as ``x is y`` in Python. Add also the :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse` functions to test if an object is, respectively, the ``None`` singleton, the ``True`` singleton or the ``False`` singleton. (Contributed by Victor Stinner in :issue:`43753`.)
pt_br: Adiciona a função :c:func:`Py_Is(x, y) <Py_Is>` para testar se o objeto *x* é o objeto *y*, o mesmo que ``x is y`` em Python. Adiciona também as funções :c:func:`Py_IsNone`, :c:func:`Py_IsTrue`, :c:func:`Py_IsFalse` para testar se um objeto é, respectivamente, o singleton ``None``, o singleton ``True`` ou o singleton ``False``. (Contribuição de Victor Stinner em :issue:`43753`.)

source: Add new functions to control the garbage collector from C code: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. These functions allow to activate, deactivate and query the state of the garbage collector from C code without having to import the :mod:`gc` module.
pt_br: Adiciona novas funções para controlar o coletor de lixo do código C: :c:func:`PyGC_Enable()`, :c:func:`PyGC_Disable()`, :c:func:`PyGC_IsEnabled()`. Estas funções permitem ativar, desativar e consultar o estado do coletor de lixo do código C sem precisar importar o módulo :mod:`gc`.

source: Add a new :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` type flag to disallow creating type instances. (Contributed by Victor Stinner in :issue:`43916`.)
pt_br: Adiciona um novo sinalizador de tipo :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` para impedir a criação de instâncias de tipo. (Contribuição de Victor Stinner em :issue:`43916`.)

source: Add a new :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` type flag for creating immutable type objects: type attributes cannot be set nor deleted. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
pt_br: Adiciona um novo sinalizador de tipo :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` para criar objetos de tipo imutável: atributos de tipo não podem ser definidos nem excluídos. (Contribuição de Victor Stinner e Erlend E. Aasland em :issue:`43908`.)

source: The ``PY_SSIZE_T_CLEAN`` macro must now be defined to use :c:func:`PyArg_ParseTuple` and :c:func:`Py_BuildValue` formats which use ``#``: ``es#``, ``et#``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` and ``Z#``. See :ref:`arg-parsing` and :pep:`353`. (Contributed by Victor Stinner in :issue:`40943`.)
pt_br: A macro ``PY_SSIZE_T_CLEAN`` deve agora ser definida para usar os formatos :c:func:`PyArg_ParseTuple` e :c:func:`Py_BuildValue` que usam ``#``: ``es#``, ``et#``, ``s#``, ``u#``, ``y#``, ``z#``, ``U#`` e ``Z#``. Veja :ref:`arg-parsing` e :pep:`353`. (Contribuição de Victor Stinner em :issue:`40943`.)

source: Since :c:func:`Py_REFCNT()` is changed to the inline static function, ``Py_REFCNT(obj) = new_refcnt`` must be replaced with ``Py_SET_REFCNT(obj, new_refcnt)``: see :c:func:`Py_SET_REFCNT()` (available since Python 3.9). For backward compatibility, this macro can be used::
pt_br: Como :c:func:`Py_REFCNT()` é alterado para a função estática em linha, ``Py_REFCNT(obj) = new_refcnt`` deve ser substituído por ``Py_SET_REFCNT(obj, new_refcnt)``: veja :c:func:`Py_SET_REFCNT()` (disponível desde o Python 3.9). Para compatibilidade com versões anteriores, esta macro pode ser usada::

source: (Contributed by Victor Stinner in :issue:`39573`.)
pt_br: (Contribuição de Victor Stinner em :issue:`39573`.)

source: Calling :c:func:`PyDict_GetItem` without :term:`GIL` held had been allowed for historical reason. It is no longer allowed. (Contributed by Victor Stinner in :issue:`40839`.)
pt_br: A chamada de :c:func:`PyDict_GetItem` sem a :term:`GIL` retida era permitido por razões históricas. Isso não é mais permitido. (Contribuição de Victor Stinner em :issue:`40839`.)

source: ``PyUnicode_FromUnicode(NULL, size)`` and ``PyUnicode_FromStringAndSize(NULL, size)`` raise ``DeprecationWarning`` now. Use :c:func:`PyUnicode_New` to allocate Unicode object without initial data. (Contributed by Inada Naoki in :issue:`36346`.)
pt_br: ``PyUnicode_FromUnicode(NULL, size)`` e ``PyUnicode_FromStringAndSize(NULL, size)`` levantam ``DeprecationWarning`` agora. Use :c:func:`PyUnicode_New` para alocar objeto Unicode sem dados iniciais. (Contribuição de Inada Naoki em :issue:`36346`.)

source: The private ``_PyUnicode_Name_CAPI`` structure of the PyCapsule API ``unicodedata.ucnhash_CAPI`` has been moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
pt_br: A estrutura privada ``_PyUnicode_Name_CAPI`` da API PyCapsule ``unicodedata.ucnhash_CAPI`` foi movida para a API C interna. (Contribuição de Victor Stinner em :issue:`42157`.)

source: :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` and :c:func:`Py_GetProgramName` functions now return ``NULL`` if called before :c:func:`Py_Initialize` (before Python is initialized). Use the new :ref:`init-config` API to get the :ref:`init-path-config`. (Contributed by Victor Stinner in :issue:`42260`.)
pt_br: As funções :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome` e :c:func:`Py_GetProgramName` agora retornam ``NULL`` se chamadas antes de :c:func:`Py_Initialize` (antes do Python ser inicializado). Use a nova API de :ref:`init-config` para obter a :ref:`init-path-config`. (Contribuição de Victor Stinner em :issue:`42260`.)

source: :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` and :c:func:`PyCell_SET` macros can no longer be used as l-value or r-value. For example, ``x = PyList_SET_ITEM(a, b, c)`` and ``PyList_SET_ITEM(a, b, c) = x`` now fail with a compiler error. It prevents bugs like ``if (PyList_SET_ITEM (a, b, c) < 0) ...`` test. (Contributed by Zackery Spytz and Victor Stinner in :issue:`30459`.)
pt_br: As macros :c:func:`PyList_SET_ITEM`, :c:func:`PyTuple_SET_ITEM` e :c:func:`PyCell_SET` não podem mais ser usadas como valor-l ou valor-r. Por exemplo, ``x = PyList_SET_ITEM(a, b, c)`` e ``PyList_SET_ITEM(a, b, c) = x`` agora falham com um erro do compilador. Isso previne bugs como o teste ``if (PyList_SET_ITEM (a, b, c) < 0) ...``. (Contribuição de Zackery Spytz e Victor Stinner em :issue:`30459`.)

source: The non-limited API files ``odictobject.h``, ``parser_interface.h``, ``picklebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug.h``, ``pyfpe.h``, and ``pytime.h`` have been moved to the ``Include/cpython`` directory. These files must not be included directly, as they are already included in ``Python.h``; see :ref:`api-includes`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Nicholas Sim in :issue:`35134`.)
pt_br: Os arquivos de API não limitada ``odictobject.h``, ``parser_interface.h``, ``piclebufobject.h``, ``pyarena.h``, ``pyctype.h``, ``pydebug. h``, ``pyfpe.h`` e ``pytime.h`` foram movidos para o diretório ``Include/cpython``. Esses arquivos não devem ser incluídos diretamente, pois já estão incluídos em ``Python.h``; veja :ref:`api-includes`. Se eles foram incluídos diretamente, considere incluir ``Python.h`` em vez disso. (Contribuição de Nicholas Sim em :issue:`35134`.)

source: Use the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` type flag to create immutable type objects. Do not rely on :c:macro:`Py_TPFLAGS_HEAPTYPE` to decide if a type object is mutable or not; check if :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` is set instead. (Contributed by Victor Stinner and Erlend E. Aasland in :issue:`43908`.)
pt_br: Use o sinalizador de tipo :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` para criar objetos de tipo imutável. Não confie em :c:macro:`Py_TPFLAGS_HEAPTYPE` para decidir se um objeto de tipo é mutável ou não; verifique se :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` está definido. (Contribuição de Victor Stinner e Erlend E. Aasland em :issue:`43908`.)

source: The undocumented function ``Py_FrozenMain`` has been removed from the limited API. The function is mainly useful for custom builds of Python. (Contributed by Petr Viktorin in :issue:`26241`.)
pt_br: A função não documentada ``Py_FrozenMain`` foi removida da API limitada. A função é útil principalmente para compilações personalizadas do Python. (Contribuição de Petr Viktorin em :issue:`26241`.)

source: The ``PyUnicode_InternImmortal()`` function is now deprecated and will be removed in Python 3.12: use :c:func:`PyUnicode_InternInPlace` instead. (Contributed by Victor Stinner in :issue:`41692`.)
pt_br: A função ``PyUnicode_InternImmortal()`` agora foi descontinuada e será removida no Python 3.12: use :c:func:`PyUnicode_InternInPlace` em vez disso. (Contribuição de Victor Stinner em :issue:`41692`.)

source: Removed ``Py_UNICODE_str*`` functions manipulating ``Py_UNICODE*`` strings. (Contributed by Inada Naoki in :issue:`41123`.)
pt_br: Removidas as funções ``Py_UNICODE_str*`` que manipulam strings ``Py_UNICODE*``. (Contribuição de Inada Naoki em :issue:`41123`.)

source: ``Py_UNICODE_strlen``: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
pt_br: ``Py_UNICODE_strlen``: use :c:func:`PyUnicode_GetLength` ou :c:macro:`PyUnicode_GET_LENGTH`

source: ``Py_UNICODE_strcat``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
pt_br: ``Py_UNICODE_strcat``: use :c:func:`PyUnicode_CopyCharacters` ou :c:func:`PyUnicode_FromFormat`

source: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
pt_br: ``Py_UNICODE_strcpy``, ``Py_UNICODE_strncpy``: use :c:func:`PyUnicode_CopyCharacters` ou :c:func:`PyUnicode_Substring`

source: Removed ``PyUnicode_GetMax()``. Please migrate to new (:pep:`393`) APIs. (Contributed by Inada Naoki in :issue:`41103`.)
pt_br: Removida ``PyUnicode_GetMax()``. Migre para as novas APIs (:pep:`393`). (Contribuição de Inada Naoki em :issue:`41103`.)

source: Removed ``PyLong_FromUnicode()``. Please migrate to :c:func:`PyLong_FromUnicodeObject`. (Contributed by Inada Naoki in :issue:`41103`.)
pt_br: Removida ``PyLong_FromUnicode()``. Migre para :c:func:`PyLong_FromUnicodeObject`. (Contribuição de Inada Naoki em :issue:`41103`.)

source: Removed ``PyUnicode_AsUnicodeCopy()``. Please use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString` (Contributed by Inada Naoki in :issue:`41103`.)
pt_br: Removida ``PyUnicode_AsUnicodeCopy()``. Use :c:func:`PyUnicode_AsUCS4Copy` ou :c:func:`PyUnicode_AsWideCharString` (Contribuição de Inada Naoki em :issue:`41103`.)

source: Removed ``_Py_CheckRecursionLimit`` variable: it has been replaced by ``ceval.recursion_limit`` of the :c:type:`PyInterpreterState` structure. (Contributed by Victor Stinner in :issue:`41834`.)
pt_br: Removida a variável ``_Py_CheckRecursionLimit``: foi substituída por ``ceval.recursion_limit`` da estrutura :c:type:`PyInterpreterState`. (Contribuição de Victor Stinner em :issue:`41834`.)

source: Removed undocumented macros ``Py_ALLOW_RECURSION`` and ``Py_END_ALLOW_RECURSION`` and the ``recursion_critical`` field of the :c:type:`PyInterpreterState` structure. (Contributed by Serhiy Storchaka in :issue:`41936`.)
pt_br: Removidas as macros não documentadas ``Py_ALLOW_RECURSION`` e ``Py_END_ALLOW_RECURSION`` e o campo ``recursion_critical`` da estrutura :c:type:`PyInterpreterState`. (Contribuição de Serhiy Storchaka em :issue:`41936`.)

source: Removed the undocumented ``PyOS_InitInterrupts()`` function. Initializing Python already implicitly installs signal handlers: see :c:member:`PyConfig.install_signal_handlers`. (Contributed by Victor Stinner in :issue:`41713`.)
pt_br: Removida a função ``PyOS_InitInterrupts()`` não documentada. Inicializar o Python já instala implicitamente manipuladores de sinal: veja :c:member:`PyConfig.install_signal_handlers`. (Contribuição de Victor Stinner em :issue:`41713`.)

source: Remove the ``PyAST_Validate()`` function. It is no longer possible to build a AST object (``mod_ty`` type) with the public C API. The function was already excluded from the limited C API (:pep:`384`). (Contributed by Victor Stinner in :issue:`43244`.)
pt_br: Remova a função ``PyAST_Validate()``. Não é mais possível construir um objeto AST (tipo ``mod_ty``) com a API C pública. A função já foi excluída da API C limitada (:pep:`384`). (Contribuição de Victor Stinner em :issue:`43244`.)

source: Remove the ``symtable.h`` header file and the undocumented functions:
pt_br: Remove o arquivo de cabeçalho ``symtable.h`` e as funções não documentadas:

source: The ``Py_SymtableString()`` function was part the stable ABI by mistake but it could not be used, because the ``symtable.h`` header file was excluded from the limited C API.
pt_br: A função ``Py_SymtableString()`` fazia parte da ABI estável por engano, mas não pôde ser usada, porque o arquivo de cabeçalho ``symtable.h`` foi excluído da API C limitada.

source: Use Python :mod:`symtable` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
pt_br: Use o módulo Python :mod:`symtable` em vez disso. (Contribuição de Victor Stinner em :issue:`43244`.)

source: Remove :c:func:`PyOS_ReadlineFunctionPointer` from the limited C API headers and from ``python3.dll``, the library that provides the stable ABI on Windows. Since the function takes a ``FILE*`` argument, its ABI stability cannot be guaranteed. (Contributed by Petr Viktorin in :issue:`43868`.)
pt_br: Remove :c:func:`PyOS_ReadlineFunctionPointer` dos cabeçalhos limitados da API C e de ``python3.dll``, a biblioteca que fornece a ABI estável no Windows. Como a função recebe um argumento ``FILE*``, sua estabilidade ABI não pode ser garantida. (Contribuição de Petr Viktorin em :issue:`43868`.)

source: Remove ``ast.h``, ``asdl.h``, and ``Python-ast.h`` header files. These functions were undocumented and excluded from the limited C API. Most names defined by these header files were not prefixed by ``Py`` and so could create names conflicts. For example, ``Python-ast.h`` defined a ``Yield`` macro which was conflict with the ``Yield`` name used by the Windows ``<winbase.h>`` header. Use the Python :mod:`ast` module instead. (Contributed by Victor Stinner in :issue:`43244`.)
pt_br: Remove os arquivos de cabeçalho ``ast.h``, ``asdl.h`` e ``Python-ast.h``. Essas funções não estavam documentadas e excluídas da API C limitada. A maioria dos nomes definidos por esses arquivos de cabeçalho não foram prefixados por ``Py`` e, portanto, podem criar conflitos de nomes. Por exemplo, ``Python-ast.h`` definiu uma macro ``Yield`` que estava em conflito com o nome ``Yield`` usado pelo cabeçalho ``<winbase.h>`` do Windows. Use o módulo Python :mod:`ast` em vez disso. (Contribuição de Victor Stinner em :issue:`43244`.)

source: Remove the compiler and parser functions using ``struct _mod`` type, because the public AST C API was removed:
pt_br: Remove as funções do compilador e do analisador usando o tipo ``struct _mod``, porque a API AST C pública foi removida:

source: These functions were undocumented and excluded from the limited C API. (Contributed by Victor Stinner in :issue:`43244`.)
pt_br: Essas funções não estavam documentadas e excluídas da API C limitada. (Contribuição de Victor Stinner em :issue:`43244`.)

source: Remove the ``pyarena.h`` header file with functions:
pt_br: Remove o arquivo de cabeçalho ``pyarena.h`` com funções:

source: These functions were undocumented, excluded from the limited C API, and were only used internally by the compiler. (Contributed by Victor Stinner in :issue:`43244`.)
pt_br: Essas funções não estavam documentadas, excluídas da API C limitada e eram usadas apenas internamente pelo compilador. (Contribuição de Victor Stinner em :issue:`43244`.)

source: The ``PyThreadState.use_tracing`` member has been removed to optimize Python. (Contributed by Mark Shannon in :issue:`43760`.)
pt_br: O membro ``PyThreadState.use_tracing`` foi removido para otimizar o Python. (Contribuição de Mark Shannon em :issue:`43760`.)

source: Notable security feature in 3.10.7
pt_br: Recursos de segurança notáveis no 3.10.7

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
pt_br: Converter entre :class:`int` e :class:`str` em bases diferentes de 2 (binário), 4, 8 (octal), 16 (hexadecimal) ou 32 como base 10 (decimal) agora levanta uma exceção :exc:`ValueError` se o número de dígitos em forma de string estiver acima de um limite para evitar possíveis ataques de negação de serviço devido à complexidade algorítmica. Esta é uma mitigação para :cve:`2020-10735`. Este limite pode ser configurado ou desabilitado por variável de ambiente, sinalizador de linha de comando ou APIs de :mod:`sys`. Veja a documentação de :ref:`limitação de comprimento de conversão de string inteira <int_max_str_digits>`. O limite padrão é de 4300 dígitos em forma de string.

source: Notable security feature in 3.10.8
pt_br: Recursos de segurança notáveis no 3.10.8
