Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: NPN features like :meth:`ssl.SSLSocket.selected_npn_protocol` and :meth:`ssl.SSLContext.set_npn_protocols` are replaced by ALPN.
pt_br: Recurso de NPN como :meth:`ssl.SSLSocket.selected_npn_protocol` e :meth:`ssl.SSLContext.set_npn_protocols` foram substituídos por ALPN.

source: The threading debug (:envvar:`!PYTHONTHREADDEBUG` environment variable) is deprecated in Python 3.10 and will be removed in Python 3.12. This feature requires a :ref:`debug build of Python <debug-build>`. (Contributed by Victor Stinner in :issue:`44584`.)
pt_br: A depuração de threads (variável de ambiente :envvar:`!PYTHONTHREADDEBUG`) foi descontinuada no Python 3.10 e será removida no Python 3.12. Este recurso exige uma :ref:`construção de depuração de Python <debug-build>`. (Contribuição de Victor Stinner em :issue:`44584`.)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules will be removed in a future version of Python. Anything belonging to these submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`.)
pt_br: A importação dos submódulos ``typing.io`` e ``typing.re`` agora emitirá :exc:`DeprecationWarning`. Esses submódulos serão removidos em uma versão futura do Python. Qualquer coisa pertencente a esses submódulos deve ser importada diretamente de :mod:`typing`. (Contribuição de Sebastian Rittau em :issue:`38291`.)

source: Removed
pt_br: Removidos

source: Removed special methods ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` and ``__rdivmod__`` of the :class:`complex` class. They always raised a :exc:`TypeError`. (Contributed by Serhiy Storchaka in :issue:`41974`.)
pt_br: Removidos os métodos especiais ``__int__``, ``__float__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__rfloordiv__``, ``__rmod__`` e ``__rdivmod__`` da classe :class:`complex`. Eles sempre levantavam uma exceção :exc:`TypeError`. (Contribuição de Serhiy Storchaka em :issue:`41974`.)

source: The ``ParserBase.error()`` method from the private and undocumented ``_markupbase`` module has been removed. :class:`html.parser.HTMLParser` is the only subclass of ``ParserBase`` and its ``error()`` implementation was already removed in Python 3.5. (Contributed by Berker Peksag in :issue:`31844`.)
pt_br: O método ``ParserBase.error()`` do módulo privado e não documentado ``_markupbase`` foi removido. :class:`html.parser.HTMLParser` é a única subclasse de ``ParserBase`` e sua implementação de ``error()`` já tinha sido removida no Python 3.5. (Contribuição de Berker Peksag em :issue:`31844`.)

source: Removed the ``unicodedata.ucnhash_CAPI`` attribute which was an internal PyCapsule object. The related private ``_PyUnicode_Name_CAPI`` structure was moved to the internal C API. (Contributed by Victor Stinner in :issue:`42157`.)
pt_br: Removido o atributo ``unicodedata.ucnhash_CAPI`` que foi um objeto interno PyCapsule. A estrutura privada relacionada ``_PyUnicode_Name_CAPI`` foi movida para uma API C interna. (Contribuição de Victor Stinner em :issue:`42157`.)

source: Removed the ``parser`` module, which was deprecated in 3.9 due to the switch to the new PEG parser, as well as all the C source and header files that were only being used by the old parser, including ``node.h``, ``parser.h``, ``graminit.h`` and ``grammar.h``.
pt_br: Removido o módulo ``parser``, que foi descontinuado em 3.9 em razão da mudança para o novo analisador sintático GASE, bem como todo os arquivos código-fonte e cabeçalhos C que estavam sendo usados pelo analisador sintático antigo, incluindo ``node.h``, ``parser.h``, ``graminit.h`` e ``grammar.h``.

source: Removed the Public C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags`` and ``PyNode_Compile`` that were deprecated in 3.9 due to the switch to the new PEG parser.
pt_br: Removidas as funções de API C pública ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags`` e ``PyNode_Compile`` que foram descontinuadas no 3.9 em razão da mudança para o novo analisador sintático GASE.

source: Removed the ``formatter`` module, which was deprecated in Python 3.4. It is somewhat obsolete, little used, and not tested. It was originally scheduled to be removed in Python 3.6, but such removals were delayed until after Python 2.7 EOL. Existing users should copy whatever classes they use into their code. (Contributed by Donghee Na and Terry J. Reedy in :issue:`42299`.)
pt_br: Removido o módulo ``formatter``, que foi descontinuado no Python 3.4. É um tanto obsoleto, pouco usado e não testado. Ele foi originalmente programado para ser removido no Python 3.6, mas tais remoções foram adiadas até depois do fim de vida do Python 2.7. Os usuários existentes devem copiar quaisquer classes que usam em seu código. (Contribuição de Dong-hee Na e Terry J. Reedy em :issue:`42299`.)

source: Removed the :c:func:`!PyModule_GetWarningsModule` function that was useless now due to the :mod:`!_warnings` module was converted to a builtin module in 2.6. (Contributed by Hai Shi in :issue:`42599`.)
pt_br: Removida a função :c:func:`!PyModule_GetWarningsModule` que era inútil agora porque o módulo :mod:`!_warnings` foi convertido em um módulo embutido no 2.6. (Contribuição de Hai Shi em :issue:`42599`.)

source: Remove deprecated aliases to :ref:`collections-abstract-base-classes` from the :mod:`collections` module. (Contributed by Victor Stinner in :issue:`37324`.)
pt_br: Remove apelidos descontinuados para :ref:`collections-abstract-base-classes` do módulo :mod:`collections`. (Contribuição de Victor Stinner em :issue:`37324`.)

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8. The motivation behind this change is multifold:
pt_br: O parâmetro ``loop`` foi removido da maioria da :doc:`API de alto nível <../library/asyncio-api-index>` do :mod:`asyncio` seguindo a descontinuidade no Python 3.8. A motivação por trás desta alteração é multifacetada:

source: This simplifies the high-level API.
pt_br: Isso simplifica a API de alto nível.

source: The functions in the high-level API have been implicitly getting the current thread's running event loop since Python 3.7. There isn't a need to pass the event loop to the API in most normal use cases.
pt_br: As funções na API de alto nível obtêm implicitamente o laço de eventos em execução do thread atual desde o Python 3.7. Não há necessidade de passar o laço de eventos para a API na maioria dos casos de uso normais.

source: Event loop passing is error-prone especially when dealing with loops running in different threads.
pt_br: A passagem de laço de eventos está sujeita a erros, especialmente ao lidar com laços em execução em diferentes threads.

source: Note that the low-level API will still accept ``loop``. See :ref:`changes-python-api` for examples of how to replace existing code.
pt_br: Observe que a API de baixo nível ainda aceitará ``loop``. Veja :ref:`changes-python-api` para exemplos de como substituir o código existente.

source: (Contributed by Yurii Karabas, Andrew Svetlov, Yury Selivanov and Kyle Stanley in :issue:`42392`.)
pt_br: (Contribuição de Yurii Karabas, Andrew Svetlov, Yury Selivanov e Kyle Stanley em :issue:`42392`.)

source: Porting to Python 3.10
pt_br: Portando para Python 3.10

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_br: Esta seção lista as alterações descritas anteriormente e outras correções que podem exigir alterações no seu código.

source: Changes in the Python syntax
pt_br: Alterações na sintaxe Python

source: Deprecation warning is now emitted when compiling previously valid syntax if the numeric literal is immediately followed by a keyword (like in ``0in x``). In future releases it will be changed to syntax warning, and finally to a syntax error. To get rid of the warning and make the code compatible with future releases just add a space between the numeric literal and the following keyword. (Contributed by Serhiy Storchaka in :issue:`43833`.)
pt_br: O aviso de descontinuação agora é emitido ao compilar a sintaxe anteriormente válida se o literal numérico for seguido imediatamente por uma palavra reservada (como em ``0in x``). Em versões futuras, ele será alterado para aviso de sintaxe e, finalmente, para um erro de sintaxe. Para se livrar do aviso e tornar o código compatível com versões futuras, basta adicionar um espaço entre o literal numérico e a palavra reservada seguinte. (Contribuição de Serhiy Storchaka em :issue:`43833`.)

source: Changes in the Python API
pt_br: Alterações na API Python

source: The *etype* parameters of the :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions in the :mod:`traceback` module have been renamed to *exc*. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
pt_br: Os parâmetros *etype* das funções :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only` e :func:`~traceback.print_exception` no módulo :mod:`traceback` foram renomeadas para *exc*. (Contribuição de Zackery Spytz e Matthias Bussonnier em :issue:`26389`.)

source: :mod:`atexit`: At Python exit, if a callback registered with :func:`atexit.register` fails, its exception is now logged. Previously, only some exceptions were logged, and the last exception was always silently ignored. (Contributed by Victor Stinner in :issue:`42639`.)
pt_br: :mod:`atexit`: ao sair do Python, se uma função de retorno registrada com :func:`atexit.register` falhar, sua exceção agora é registrada nos logs. Anteriormente, apenas algumas exceções eram registradas nos logs e a última exceção era sempre ignorada silenciosamente. (Contribuição de Victor Stinner em :issue:`42639`.)

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. Furthermore, :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
pt_br: A classe genérica :class:`Collections.abc.Callable` agora nivela os parâmetros de tipo, similar ao que :data:`typing.Callable` faz atualmente. Isso significa que ``collections.abc.Callable[[int, str], str]`` terá ``__args__`` de ``(int, str, str)``; anteriormente era ``([int, str], str)``. O código que acessa os argumentos via :func:`typing.get_args` ou ``__args__`` precisa levar em conta esta mudança. Além disso, :exc:`TypeError` pode ser levantada para formas inválidas de parametrização :class:`Collections.abc.Callable` que pode ter passada silenciosamente no Python 3.9. (Contribuição de Ken Jin em :issue:`42195`.)

source: :meth:`socket.htons` and :meth:`socket.ntohs` now raise :exc:`OverflowError` instead of :exc:`DeprecationWarning` if the given parameter will not fit in a 16-bit unsigned integer. (Contributed by Erlend E. Aasland in :issue:`42393`.)
pt_br: :meth:`socket.htons` e :meth:`socket.ntohs` agora levantam :exc:`OverflowError` em vez de :exc:`DeprecationWarning` se o parâmetro dado não couber em um inteiro sem sinal de 16 bits. (Contribuição de Erlend E. Aasland em :issue:`42393`.)

source: The ``loop`` parameter has been removed from most of :mod:`asyncio`\ 's :doc:`high-level API <../library/asyncio-api-index>` following deprecation in Python 3.8.
pt_br: O parâmetro ``loop`` foi removido da maioria da :doc:`API de alto nível <../library/asyncio-api-index>` do :mod:`asyncio` seguindo a descontinuidade no Python 3.8.

source: A coroutine that currently looks like this::
pt_br: A corrotina que atualmente se parece com isso::

source: Should be replaced with this::
pt_br: Deve ser substituída por isso::

source: If ``foo()`` was specifically designed *not* to run in the current thread's running event loop (e.g. running in another thread's event loop), consider using :func:`asyncio.run_coroutine_threadsafe` instead.
pt_br: Se ``foo()`` for especificamente projetado para *não* executar no laço de eventos em execução da thread atual (por exemplo, executar no laço de eventos de outra thread), considere usar :func:`asyncio.run_coroutine_threadsafe`.

source: The :data:`types.FunctionType` constructor now inherits the current builtins if the *globals* dictionary has no ``"__builtins__"`` key, rather than using ``{"None": None}`` as builtins: same behavior as :func:`eval` and :func:`exec` functions. Defining a function with ``def function(...): ...`` in Python is not affected, globals cannot be overridden with this syntax: it also inherits the current builtins. (Contributed by Victor Stinner in :issue:`42990`.)
pt_br: O construtor :data:`types.FunctionType` agora herda os embutidos atuais se o dicionário *globals* tiver nenhuma chave ``"__builtins__"``, em vez de usar ``{"None": None}`` como embutidos: o mesmo comportamento que as funções :func:`eval` e :func:`exec`. Definir uma função com ``def function(...): ...`` no Python não é afetado, globais não podem ser substituídos com esta sintaxe: também herda os embutidos atuais. (Contribuição de Victor Stinner em :issue:`42990`.)

source: Changes in the C API
pt_br: Alterações na API C

source: The C API functions ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags``, ``PyNode_Compile`` and the type used by these functions, ``struct _node``, were removed due to the switch to the new PEG parser.
pt_br: As funções de API C ``PyParser_SimpleParseStringFlags``, ``PyParser_SimpleParseStringFlagsFilename``, ``PyParser_SimpleParseFileFlags``, ``PyNode_Compile`` e o tipo usado por essas funções, ``struct _node``, foram removidos em razão da mudança para o novo analisador sintático GASE.

source: Source should be now be compiled directly to a code object using, for example, :c:func:`Py_CompileString`. The resulting code object can then be evaluated using, for example, :c:func:`PyEval_EvalCode`.
pt_br: O código-fonte deve ser agora compilado diretamente para um objeto código usando, por exemplo, :c:func:`Py_CompileString`. O objeto código resultante pode ser então avaliado usando, por exemplo, :c:func:`PyEval_EvalCode`.

source: Specifically:
pt_br: Especificamente:

source: A call to ``PyParser_SimpleParseStringFlags`` followed by ``PyNode_Compile`` can be replaced by calling :c:func:`Py_CompileString`.
pt_br: Uma chamada para ``PyParser_SimpleParseStringFlags`` seguida por ``PyNode_Compile`` pode ser substituída por :c:func:`Py_CompileString`.

source: There is no direct replacement for ``PyParser_SimpleParseFileFlags``. To compile code from a ``FILE *`` argument, you will need to read the file in C and pass the resulting buffer to :c:func:`Py_CompileString`.
pt_br: Não há substituição direta para ``PyParser_SimpleParseFileFlags``. Para compilar código de um argumento ``FILE *``, você vai precisar ler o arquivo em C e passar o buffer resultante para :c:func:`Py_CompileString`.

source: To compile a file given a ``char *`` filename, explicitly open the file, read it and compile the result. One way to do this is using the :py:mod:`io` module with :c:func:`PyImport_ImportModule`, :c:func:`PyObject_CallMethod`, :c:func:`PyBytes_AsString` and :c:func:`Py_CompileString`, as sketched below. (Declarations and error handling are omitted.) ::
pt_br: Para compilar um arquivo de um nome de arquivo ``char *`` dado, abra explicitamente o arquivo, leia-o e compile o resultado. Uma forma de fazer isso é usando o módulo :py:mod:`io` com :c:func:`PyImport_ImportModule`, :c:func:`PyObject_CallMethod`, :c:func:`PyBytes_AsString` e :c:func:`Py_CompileString`, como esboçado abaixo. (Declarações e tratamento de erro foram omitidos.) ::

source: For ``FrameObject`` objects, the :attr:`~frame.f_lasti` member now represents a wordcode offset instead of a simple offset into the bytecode string. This means that this number needs to be multiplied by 2 to be used with APIs that expect a byte offset instead (like :c:func:`PyCode_Addr2Line` for example). Notice as well that the :attr:`!f_lasti` member of ``FrameObject`` objects is not considered stable: please use :c:func:`PyFrame_GetLineNumber` instead.
pt_br: Para objetos ``FrameObject``, o membro :attr:`~frame.f_lasti` agora representa um deslocamento de código de palavra em vez de um deslocamento simples na string de bytecode. Isso significa que esse número precisa ser multiplicado por 2 para ser usado com APIs que esperam um deslocamento de byte (como :c:func:`PyCode_Addr2Line`, por exemplo). Observe também que o membro :attr:`!f_lasti` de objetos ``FrameObject`` não é considerado estável: por favor, use :c:func:`PyFrame_GetLineNumber` em vez disso.

source: CPython bytecode changes
pt_br: Alterações de bytecode do CPython

source: The ``MAKE_FUNCTION`` instruction now accepts either a dict or a tuple of strings as the function's annotations. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`.)
pt_br: A instrução ``MAKE_FUNCTION`` agora aceita um dicionário ou uma tupla de strings como as anotações da função. (Contribuição de Yurii Karabas e Inada Naoki em :issue:`42202`.)

source: Build Changes
pt_br: Mudanças na construção

source: :pep:`644`: Python now requires OpenSSL 1.1.1 or newer. OpenSSL 1.0.2 is no longer supported. (Contributed by Christian Heimes in :issue:`43669`.)
pt_br: :pep:`644`: Python agora exige OpenSSL 1.1.1 ou mais novo. OpenSSL 1.0.2 não é mais suportado. (Contribuição de Christian Heimes em :issue:`43669`.)

source: The C99 functions :c:func:`snprintf` and :c:func:`vsnprintf` are now required to build Python. (Contributed by Victor Stinner in :issue:`36020`.)
pt_br: As funções C99 :c:func:`snprintf` e :c:func:`vsnprintf` agora são exigidas para compilar o Python. (Contribuição de Victor Stinner em :issue:`36020`.)

source: :mod:`sqlite3` requires SQLite 3.7.15 or higher. (Contributed by Sergey Fedoseev and Erlend E. Aasland in :issue:`40744` and :issue:`40810`.)
pt_br: :mod:`sqlite3` exige SQLite 3.7.15 ou superior. (Contribuição de Sergey Fedoseev e Erlend E. Aasland em :issue:`40744` e :issue:`40810`.)

source: The :mod:`atexit` module must now always be built as a built-in module. (Contributed by Victor Stinner in :issue:`42639`.)
pt_br: O módulo :mod:`atexit` deve agora sempre ser construído como um módulo embutido. (Contribuição de Victor Stinner em :issue:`42639`.)

source: Add :option:`--disable-test-modules` option to the ``configure`` script: don't build nor install test modules. (Contributed by Xavier de Gaye, Thomas Petazzoni and Peixing Xin in :issue:`27640`.)
pt_br: Adiciona a opção :option:`--disable-test-modules` ao script ``configure``: não constrói nem instala módulos de teste. (Contribuição de Xavier de Gaye, Thomas Petazzoni e Peixing Xin em :issue:`27640`.)

source: Add :option:`--with-wheel-pkg-dir=PATH option <--with-wheel-pkg-dir>` to the ``./configure`` script. If specified, the :mod:`ensurepip` module looks for ``setuptools`` and ``pip`` wheel packages in this directory: if both are present, these wheel packages are used instead of ensurepip bundled wheel packages.
pt_br: Adiciona a :option:`option --with-wheel-pkg-dir=CAMINHO <--with-wheel-pkg-dir>` ao script ``./configure``. Se especificado, o módulo :mod:`ensurepip` procura por pacotes wheel de ``setuptools`` e ``pip`` neste diretório: se ambos estiverem presentes, esses pacotes wheel são usados em vez de pacotes wheel empacotados por ensurepip.

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the ``ensurepip._bundled`` package.
pt_br: Algumas distribuições Linux possuem políticas de empacotamento recomendando evitar o empacotamento de dependências. Por exemplo, Fedora instala pacotes wheel no diretório ``/usr/share/python-wheels/`` e não instala o pacote ``ensurepip._bundled``.

source: (Contributed by Victor Stinner in :issue:`42856`.)
pt_br: (Contribuição de Victor Stinner em :issue:`42856`.)

source: Add a new :option:`configure --without-static-libpython option <--without-static-libpython>` to not build the ``libpythonMAJOR.MINOR.a`` static library and not install the ``python.o`` object file.
pt_br: Adiciona uma nova :option:`opção --without-static-libpython de configure <--without-static-libpython>` para não construir biblioteca estática ``libpythonMAJOR.MINOR.a`` e não instala o arquivo objeto ``python.o``.

source: (Contributed by Victor Stinner in :issue:`43103`.)
pt_br: (Contribuição de Victor Stinner em :issue:`43103`.)

source: The ``configure`` script now uses the ``pkg-config`` utility, if available, to detect the location of Tcl/Tk headers and libraries. As before, those locations can be explicitly specified with the ``--with-tcltk-includes`` and ``--with-tcltk-libs`` configuration options. (Contributed by Manolis Stamatogiannakis in :issue:`42603`.)
pt_br: O script ``configure`` agora usa o utilitário ``pkg-config``, se disponível, para detectar a localização dos cabeçalhos Tcl/Tk e bibliotecas. Como antes, esses locais podem ser explicitamente especificados com as opções de configuração ``--with-tcltk-includes`` e ``--with-tcltk-libs`` . (Contribuição de Manolis Stamatogiannakis em :issue:`42603`.)

source: Add :option:`--with-openssl-rpath` option to ``configure`` script. The option simplifies building Python with a custom OpenSSL installation, e.g. ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Contributed by Christian Heimes in :issue:`43466`.)
pt_br: Adiciona a opção :option:`--with-openssl-rpath` ao script ``configure``. A opção simplifica a construção do Python com uma instalação OpenSSL personalizada, por exemplo, ``./configure --with-openssl=/path/to/openssl --with-openssl-rpath=auto``. (Contribuição de Christian Heimes em :issue:`43466`.)

source: C API Changes
pt_br: Alterações na API C

source: PEP 652: Maintaining the Stable ABI
pt_br: PEP 652: Mantendo a ABI estável

source: The Stable ABI (Application Binary Interface) for extension modules or embedding Python is now explicitly defined. :ref:`stable` describes C API and ABI stability guarantees along with best practices for using the Stable ABI.
pt_br: A ABI (interface binária de aplicação) Estável para módulos de extensão ou Python embutido agora está explicitamente definido. :ref:`stable` descreve as garantias de estabilidade da API C e ABI junto com as melhores práticas para usar a ABI estável.

source: (Contributed by Petr Viktorin in :pep:`652` and :issue:`43795`.)
pt_br: (Contribuição de Petr Viktorin em :pep:`652` e :issue:`43795`.)

source: The result of :c:func:`PyNumber_Index` now always has exact type :class:`int`. Previously, the result could have been an instance of a subclass of ``int``. (Contributed by Serhiy Storchaka in :issue:`40792`.)
pt_br: O resultado de :c:func:`PyNumber_Index` agora sempre tem o tipo exato :class:`int`. Anteriormente, o resultado poderia ser uma instância de uma subclasse de ``int``. (Contribuição de Serhiy Storchaka em :issue:`40792`.)
