Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
pt_br: A presença de caracteres de nova linha ou tab em partes de um URL permite algumas formas de ataques. Seguindo a especificação WHATWG que atualiza :rfc:`3986`, nova linha ASCII ``\n``, ``\r`` e os caracteres de tabulação ``\t`` são retirados da URL pelo analisador sintático em :mod:`urllib.parse` impedindo tais ataques. Os caracteres de remoção são controlados por uma nova variável de nível de módulo ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Veja :gh:`88048`)

source: Add a :class:`~xml.sax.handler.LexicalHandler` class to the :mod:`xml.sax.handler` module. (Contributed by Jonathan Gossage and Zackery Spytz in :issue:`35018`.)
pt_br: Adiciona uma classe :class:`~xml.sax.handler.LexicalHandler` ao módulo :mod:`xml.sax.handler`. (Contribuição de Jonathan Gossage e Zackery Spytz em :issue:`35018`.)

source: Add methods related to :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module`, and :meth:`zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`42131`.)
pt_br: Adiciona métodos relacionados à :pep:`451`: :meth:`~zipimport.zipimporter.find_spec`, :meth:`zipimport.zipimporter.create_module` e :meth:`zipimport.zipimporter.exec_module`. (Contribuição de Brett Cannon em :issue:`42131`.)

source: Add :meth:`~zipimport.zipimporter.invalidate_caches` method. (Contributed by Desmond Cheong in :issue:`14678`.)
pt_br: Adiciona o método :meth:`~zipimport.zipimporter.invalidate_caches`. (Contribuição de Desmond Cheong em :issue:`14678`.)

source: Optimizations
pt_br: Otimizações

source: Constructors :func:`str`, :func:`bytes` and :func:`bytearray` are now faster (around 30--40% for small objects). (Contributed by Serhiy Storchaka in :issue:`41334`.)
pt_br: Os construtores :func:`str`, :func:`bytes` e :func:`bytearray` estão agora mais rápido (cerca de 30--40% para objetos pequenos). (Contribuição de Serhiy Storchaka em :issue:`41334`.)

source: The :mod:`runpy` module now imports fewer modules. The ``python3 -m module-name`` command startup time is 1.4x faster in average. On Linux, ``python3 -I -m module-name`` imports 69 modules on Python 3.9, whereas it only imports 51 modules (-18) on Python 3.10. (Contributed by Victor Stinner in :issue:`41006` and :issue:`41718`.)
pt_br: O módulo :mod:`runpy` agora importa menos módulos. O tempo de inicialização do comando ``python3 -m module-name`` é 1,4 vezes mais rápido em média. No Linux, ``python3 -I -m module-name`` importa 69 módulos no Python 3.9, sendo que importa apenas 51 módulos (-18) no Python 3.10. (Contribuição de Victor Stinner em :issue:`41006` e :issue:`41718`.)

source: The ``LOAD_ATTR`` instruction now uses new "per opcode cache" mechanism. It is about 36% faster now for regular attributes and 44% faster for slots. (Contributed by Pablo Galindo and Yury Selivanov in :issue:`42093` and Guido van Rossum in :issue:`42927`, based on ideas implemented originally in PyPy and MicroPython.)
pt_br: A instrução ``LOAD_ATTR`` agora usa o novo mecanismo "cache por opcode". É cerca de 36% mais rápido agora para atributos regulares e 44% mais rápido para slots. (Contribuição de Pablo Galindo e Yury Selivanov em :issue:`42093` e Guido van Rossum em :issue:`42927`, com base em ideias implementadas originalmente em PyPy e MicroPython.)

source: When building Python with :option:`--enable-optimizations` now ``-fno-semantic-interposition`` is added to both the compile and link line. This speeds builds of the Python interpreter created with :option:`--enable-shared` with ``gcc`` by up to 30%. See `this article <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/>`_ for more details. (Contributed by Victor Stinner and Pablo Galindo in :issue:`38980`.)
pt_br: Ao construir o Python com :option:`--enable-optimizations` agora, ``-fno-semantic-interposition`` é adicionado à linha de compilação e vinculação. Isso acelera as compilações do interpretador Python criado com :option:`--enable-shared` com ``gcc`` em até 30%. Consulte `este artigo <https://developers.redhat.com/blog/2020/06/25/red-hat-enterprise-linux-8-2-brings-faster-python-3-8-run-speeds/>`_ para mais detalhes. (Contribuição de Victor Stinner e Pablo Galindo em :issue:`38980`.)

source: Use a new output buffer management code for :mod:`bz2` / :mod:`lzma` / :mod:`zlib` modules, and add ``.readall()`` function to ``_compression.DecompressReader`` class. bz2 decompression is now 1.09x ~ 1.17x faster, lzma decompression 1.20x ~ 1.32x faster, ``GzipFile.read(-1)`` 1.11x ~ 1.18x faster. (Contributed by Ma Lin, reviewed by Gregory P. Smith, in :issue:`41486`)
pt_br: Usa um novo código de gerenciamento de buffer de saída para os módulos :mod:`bz2` / :mod:`lzma` / :mod:`zlib` e adiciona a função ``.readall()`` à classe ``_compression.DecompressReader``. A descompressão bz2 agora é 1,09x ~ 1.17x mais rápida, a descompressão lzma 1.20x ~ 1.32x mais rápida, ``GzipFile.read(-1)`` 1,11x ~ 1.18x mais rápida. (Contribuição de Ma Lin, revisada por Gregory P. Smith, em :issue:`41486`)

source: When using stringized annotations, annotations dicts for functions are no longer created when the function is created. Instead, they are stored as a tuple of strings, and the function object lazily converts this into the annotations dict on demand. This optimization cuts the CPU time needed to define an annotated function by half. (Contributed by Yurii Karabas and Inada Naoki in :issue:`42202`.)
pt_br: Ao usar anotações em strings, dicts de anotações para funções não são mais criados quando a função é criada. Em vez disso, eles são armazenados como uma tupla de strings, e o objeto função converte lentamente isso no dict de anotações sob demanda. Essa otimização reduz pela metade o tempo de CPU necessário para definir uma função anotada. (Contribuição de Yurii Karabas e Inada Naoki em :issue:`42202`.)

source: Substring search functions such as ``str1 in str2`` and ``str2.find(str1)`` now sometimes use Crochemore & Perrin's "Two-Way" string searching algorithm to avoid quadratic behavior on long strings. (Contributed by Dennis Sweeney in :issue:`41972`)
pt_br: Funções de pesquisa de substring como ``str1 in str2`` e ``str2.find(str1)`` agora às vezes usam o algoritmo de pesquisa de string "Two-Way" de Crochemore & Perrin para evitar comportamento quadrático em strings longas. (Contribuição de Dennis Sweeney em :issue:`41972`)

source: Add micro-optimizations to ``_PyType_Lookup()`` to improve type attribute cache lookup performance in the common case of cache hits. This makes the interpreter 1.04 times faster on average. (Contributed by Dino Viehland in :issue:`43452`.)
pt_br: Adiciona micro-otimizações a ``_PyType_Lookup()`` para melhorar o desempenho de pesquisa de cache de atributo de tipo no caso comum de acessos de cache. Isso torna o interpretador 1,04 vezes mais rápido, em média. (Contribuição de Dino Viehland em :issue:`43452`.)

source: The following built-in functions now support the faster :pep:`590` vectorcall calling convention: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` and :func:`float`. (Contributed by Donghee Na and Jeroen Demeyer in :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` and :issue:`41870`.)
pt_br: As seguintes funções embutidas agora oferecem suporte a uma convenção de chamada de vectorcalls mais rápidos da :pep:`590`: :func:`map`, :func:`filter`, :func:`reversed`, :func:`bool` e :func:`float`. (Contribuição de Donghee Na e Jeroen Demeyer em :issue:`43575`, :issue:`43287`, :issue:`41922`, :issue:`41873` e :issue:`41870`.)

source: :class:`~bz2.BZ2File` performance is improved by removing internal ``RLock``. This makes :class:`!BZ2File` thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been. (Contributed by Inada Naoki in :issue:`43785`.)
pt_br: O desempenho de :class:`~bz2.BZ2File` foi melhorado removendo o ``RLock`` interno. Isso torna :class:`!BZ2File` inseguro para threads em face a vários leitores ou gravadores simultâneos, da mesma forma que suas classes equivalentes em :mod:`gzip` e :mod:`lzma` têm sido. (Contribuição de Inada Naoki em :issue:`43785`.)

source: Deprecated
pt_br: Descontinuados

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). Starting in this release, a deprecation warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In future releases it will be changed to syntax warning, and finally to syntax error. (Contributed by Serhiy Storchaka in :issue:`43833`.)
pt_br: Atualmente Python aceita literais numéricos imediatamente seguidos por palavras-chave, por exemplo ``0in x``, ``1or x``, ``0if 1else 2``. Permite expressões confusas e ambíguas como ``[0x1for x in y]`` (que pode ser interpretada como ``[0x1 for x in y]`` ou ``[0x1f or x in y]``). A partir desta versão, um aviso de descontinuidade é levantado se o literal numérico for seguido imediatamente por uma das palavras-chave :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` e :keyword:`or`. Em versões futuras, ele será alterado para aviso de sintaxe e, finalmente, para erro de sintaxe. (Contribuição de Serhiy Storchaka em :issue:`43833`.)

source: Starting in this release, there will be a concerted effort to begin cleaning up old import semantics that were kept for Python 2.7 compatibility. Specifically, :meth:`!find_loader`/:meth:`!find_module` (superseded by :meth:`~importlib.abc.MetaPathFinder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (superseded by :meth:`~importlib.abc.Loader.exec_module`), :meth:`!module_repr` (which the import system takes care of for you), the ``__package__`` attribute (superseded by ``__spec__.parent``), the ``__loader__`` attribute (superseded by ``__spec__.loader``), and the ``__cached__`` attribute (superseded by ``__spec__.cached``) will slowly be removed (as well as other classes and methods in :mod:`importlib`). :exc:`ImportWarning` and/or :exc:`DeprecationWarning` will be raised as appropriate to help identify code which needs updating during this transition.
pt_br: A partir desta versão, haverá um esforço concentrado para começar a limpar a semântica de importação antiga que foi mantida para compatibilidade com Python 2.7. Especificamente, :meth:`!find_loader`/:meth:`!find_module` (substituídos por :meth:`~importlib.abc.MetaPathFinder.find_spec`), :meth:`~importlib.abc.Loader.load_module` (substituído por :meth:`~importlib.abc.Loader.exec_module`), :meth:`!module_repr` (que o sistema de importação cuida para você), o atributo ``__package__`` (substituído por ``__spec__.parent``), o atributo ``__loader__`` (substituído por ``__spec__.loader``), e o atributo ``__cached__`` ( substituído por ``__spec__.cached``) será removido lentamente (assim como outras classes e métodos em :mod:`importlib`). :exc:`ImportWarning` e/ou :exc:`DeprecationWarning` será levantada conforme apropriado para ajudar a identificar o código que precisa ser atualizado durante esta transição.

source: The entire ``distutils`` namespace is deprecated, to be removed in Python 3.12. Refer to the :ref:`module changes <distutils-deprecated>` section for more information.
pt_br: Todo o espaço de nomes de ``distutils`` foi descontinuado, para ser removido no Python 3.12. Consulte a seção de :ref:`alterações do módulo <distutils-deprecated>` para mais informações.

source: Non-integer arguments to :func:`random.randrange` are deprecated. The :exc:`ValueError` is deprecated in favor of a :exc:`TypeError`. (Contributed by Serhiy Storchaka and Raymond Hettinger in :issue:`37319`.)
pt_br: Argumentos não inteiros para :func:`random.randrange` foram descontinuados. A exceção :exc:`ValueError` foi descontinuada em favor de uma exceção :exc:`TypeError`. (Contribuição de Serhiy Storchaka e Raymond Hettinger em :issue:`37319`.)

source: The various ``load_module()`` methods of :mod:`importlib` have been documented as deprecated since Python 3.6, but will now also trigger a :exc:`DeprecationWarning`. Use :meth:`~importlib.abc.Loader.exec_module` instead. (Contributed by Brett Cannon in :issue:`26131`.)
pt_br: Os vários métodos de ``load_module()`` de :mod:`importlib` foram documentados como descontinuados desde Python 3.6, mas agora também irão disparar um :exc:`DeprecationWarning`. Use :meth:`~importlib.abc.Loader.exec_module` em vez disso. (Contribuição de Brett Cannon em :issue:`26131`.)

source: :meth:`!zimport.zipimporter.load_module` has been deprecated in preference for :meth:`~zipimport.zipimporter.exec_module`. (Contributed by Brett Cannon in :issue:`26131`.)
pt_br: :meth:`!zimport.zipimporter.load_module` foi descontinuado em preferência a :meth:`~zipimport.zipimporter.exec_module`. (Contribuição de Brett Cannon em :issue:`26131`.)

source: The use of :meth:`~importlib.abc.Loader.load_module` by the import system now triggers an :exc:`ImportWarning` as :meth:`~importlib.abc.Loader.exec_module` is preferred. (Contributed by Brett Cannon in :issue:`26131`.)
pt_br: O uso de :meth:`~importlib.abc.Loader.load_module` pelo sistema de importação agora dispara uma exceção :exc:`ImportWarning`, pois :meth:`~importlib.abc.Loader.exec_module` é preferível. (Contribuição de Brett Cannon em :issue:`26131`.)

source: The use of :meth:`!importlib.abc.MetaPathFinder.find_module` and :meth:`!importlib.abc.PathEntryFinder.find_module` by the import system now trigger an :exc:`ImportWarning` as :meth:`importlib.abc.MetaPathFinder.find_spec` and :meth:`importlib.abc.PathEntryFinder.find_spec` are preferred, respectively. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`42134`.)
pt_br: O uso de :meth:`!importlib.abc.MetaPathFinder.find_module` e :meth:`!importlib.abc.PathEntryFinder.find_module` pelo sistema de importação agora dispara uma exceção :exc:`ImportWarning`, pois :meth:`importlib.abc.MetaPathFinder.find_spec` e :meth:`importlib.abc.PathEntryFinder.find_spec` são preferidos, respectivamente. Você pode usar :func:`importlib.util.spec_from_loader` para ajudar no port. (Contribuição de Brett Cannon em :issue:`42134`.)

source: The use of :meth:`!importlib.abc.PathEntryFinder.find_loader` by the import system now triggers an :exc:`ImportWarning` as :meth:`importlib.abc.PathEntryFinder.find_spec` is preferred. You can use :func:`importlib.util.spec_from_loader` to help in porting. (Contributed by Brett Cannon in :issue:`43672`.)
pt_br: O uso de :meth:`!importlib.abc.PathEntryFinder.find_loader` pelo sistema de importação agora dispara uma exceção :exc:`ImportWarning`, pois :meth:`importlib.abc.PathEntryFinder.find_spec` é preferido. Você pode usar :func:`importlib.util.spec_from_loader` para ajudar no port. (Contribuição de Brett Cannon em :issue:`43672`.)

source: The various implementations of :meth:`!importlib.abc.MetaPathFinder.find_module` ( :meth:`!importlib.machinery.BuiltinImporter.find_module`, :meth:`!importlib.machinery.FrozenImporter.find_module`, :meth:`!importlib.machinery.WindowsRegistryFinder.find_module`, :meth:`!importlib.machinery.PathFinder.find_module`, :meth:`!importlib.abc.MetaPathFinder.find_module` ), :meth:`!importlib.abc.PathEntryFinder.find_module` ( :meth:`!importlib.machinery.FileFinder.find_module` ), and :meth:`!importlib.abc.PathEntryFinder.find_loader` ( :meth:`!importlib.machinery.FileFinder.find_loader` ) now raise :exc:`DeprecationWarning` and are slated for removal in Python 3.12 (previously they were documented as deprecated in Python 3.4). (Contributed by Brett Cannon in :issue:`42135`.)
pt_br: As várias implementações de :meth:`!importlib.abc.MetaPathFinder.find_module` ( :meth:`!importlib.machinery.BuiltinImporter.find_module`, :meth:`!importlib.machinery.FrozenImporter.find_module`, :meth:`!importlib.machinery.WindowsRegistryFinder.find_module`, :meth:`!importlib.machinery.PathFinder.find_module`, :meth:`!importlib.abc.MetaPathFinder.find_module` ), :meth:`!importlib.abc.PathEntryFinder.find_module` (:meth:`!importlib.machinery.FileFinder.find_module` ) e :meth:`!importlib.abc.PathEntryFinder.find_loader` ( :meth:`!importlib.machinery.FileFinder.find_loader` ) agora levantam :exc:`DeprecationWarning` e estão programadas para remoção no Python 3.12 (anteriormente, eles foram documentados como descontinuados no Python 3.4). (Contribuição de Brett Cannon em :issue:`42135`.)

source: :class:`!importlib.abc.Finder` is deprecated (including its sole method, :meth:`!find_module`). Both :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder` no longer inherit from the class. Users should inherit from one of these two classes as appropriate instead. (Contributed by Brett Cannon in :issue:`42135`.)
pt_br: :class:`!importlib.abc.Finder` foi descontinuada (incluindo seu único método, :meth:`!find_module`). :class:`importlib.abc.MetaPathFinder` e :class:`importlib.abc.PathEntryFinder` não mais herdam da classe. Usuários devem herdar de uma dessas duas classes conforme apropriado. (Contribuição de Brett Cannon em :issue:`42135`.)

source: The deprecations of :mod:`!imp`, :func:`!importlib.find_loader`, :func:`!importlib.util.set_package_wrapper`, :func:`!importlib.util.set_loader_wrapper`, :func:`!importlib.util.module_for_loader`, :class:`!pkgutil.ImpImporter`, and :class:`!pkgutil.ImpLoader` have all been updated to list Python 3.12 as the slated version of removal (they began raising :exc:`DeprecationWarning` in previous versions of Python). (Contributed by Brett Cannon in :issue:`43720`.)
pt_br: As descontinuações de :mod:`!imp`, :func:`!importlib.find_loader`, :func:`!importlib.util.set_package_wrapper`, :func:`!importlib.util.set_loader_wrapper`, :func:`!importlib.util.module_for_loader`, :class:`!pkgutil.ImpImporter` e :class:`!pkgutil.ImpLoader` foram todas atualizadas para listar Python 3.12 como a versão programada para remoção (elas começaram a levantar :exc:`DeprecationWarning` em versões anteriores do Python). (Contribuição de Brett Cannon em :issue:`43720`.)

source: The import system now uses the ``__spec__`` attribute on modules before falling back on :meth:`!module_repr` for a module's ``__repr__()`` method. Removal of the use of ``module_repr()`` is scheduled for Python 3.12. (Contributed by Brett Cannon in :issue:`42137`.)
pt_br: O sistema de importação agora usa o atributo ``__spec__`` em módulos antes de recorrer a :meth:`!module_repr` para um método ``__repr__()`` do módulo. A remoção do uso de ``module_repr()`` está programado para Python 3.12. (Contribuição de Brett Cannon em :issue:`42137`.)

source: :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.machinery.FrozenLoader.module_repr`, and :meth:`!importlib.machinery.BuiltinLoader.module_repr` are deprecated and slated for removal in Python 3.12. (Contributed by Brett Cannon in :issue:`42136`.)
pt_br: :meth:`!importlib.abc.Loader.module_repr`, :meth:`!importlib.machinery.FrozenLoader.module_repr` e :meth:`!importlib.machinery.BuiltinLoader.module_repr` foram descontinuadas e programadas para remoção no Python 3.12. (Contribuição de Brett Cannon em :issue:`42136`.)

source: ``sqlite3.OptimizedUnicode`` has been undocumented and obsolete since Python 3.3, when it was made an alias to :class:`str`. It is now deprecated, scheduled for removal in Python 3.12. (Contributed by Erlend E. Aasland in :issue:`42264`.)
pt_br: ``sqlite3.OptimizedUnicode`` teve a documentação removida e foi descontinuado desde o Python 3.3, quando foi tornado um apelido para :class:`str`. Foi agora descontinuado, programado para remoção no Python 3.12. (Contribuição de Erlend E. Aasland em :issue:`42264`.)

source: The undocumented built-in function ``sqlite3.enable_shared_cache`` is now deprecated, scheduled for removal in Python 3.12. Its use is strongly discouraged by the SQLite3 documentation. See `the SQLite3 docs <https://sqlite.org/c3ref/enable_shared_cache.html>`_ for more details. If a shared cache must be used, open the database in URI mode using the ``cache=shared`` query parameter. (Contributed by Erlend E. Aasland in :issue:`24464`.)
pt_br: A função embutida não documentada ``sqlite3.enable_shared_cache`` foi agora descontinuada, agendada para remoção no Python 3.12. Seu uso é fortemente desencorajado pela documentação do SQLite3. Veja `a documentação do SQLite3 <https://sqlite.org/c3ref/enable_shared_cache.html>`_ para mais detalhes. Se um cache compartilhado deve ser usado, abra o banco de dados no modo URI usando o parâmetro de consulta ``cache=shared``. (Contribuição de Erlend E. Aasland em :issue:`24464`.)

source: The following ``threading`` methods are now deprecated:
pt_br: Os seguintes métodos de ``threading`` foram agora descontinuados:

source: (Contributed by Jelle Zijlstra in :gh:`87889`.)
pt_br: (Contribuição de Jelle Zijlstra em :gh:`87889`.)

source: :meth:`!pathlib.Path.link_to` is deprecated and slated for removal in Python 3.12. Use :meth:`pathlib.Path.hardlink_to` instead. (Contributed by Barney Gale in :issue:`39950`.)
pt_br: :meth:`!pathlib.Path.link_to` foi descontinuado e programado para remoção no Python 3.12. Use :meth:`pathlib.Path.hardlink_to` em vez disso. (Contribuição de Barney Gale em :issue:`39950`.)

source: ``cgi.log()`` is deprecated and slated for removal in Python 3.12. (Contributed by Inada Naoki in :issue:`41139`.)
pt_br: ``cgi.log()`` foi descontinuado e programado para remoção no Python 3.12. (Contribuição de Inada Naoki em :issue:`41139`.)

source: The following :mod:`ssl` features have been deprecated since Python 3.6, Python 3.7, or OpenSSL 1.1.0 and will be removed in 3.11:
pt_br: Os recurso a seguir do :mod:`ssl` foram descontinuados desde o Python 3.6, Python 3.7 ou OpenSSL 1.1.0, e serão removidos no 3.11:

source: :data:`!OP_NO_SSLv2`, :data:`!OP_NO_SSLv3`, :data:`!OP_NO_TLSv1`, :data:`!OP_NO_TLSv1_1`, :data:`!OP_NO_TLSv1_2`, and :data:`!OP_NO_TLSv1_3` are replaced by :attr:`~ssl.SSLContext.minimum_version` and :attr:`~ssl.SSLContext.maximum_version`.
pt_br: :data:`!OP_NO_SSLv2`, :data:`!OP_NO_SSLv3`, :data:`!OP_NO_TLSv1`, :data:`!OP_NO_TLSv1_1`, :data:`!OP_NO_TLSv1_2` e :data:`!OP_NO_TLSv1_3` foram substituídos por :attr:`~ssl.SSLContext.minimum_version` e :attr:`~ssl.SSLContext.maximum_version`.

source: :data:`!PROTOCOL_SSLv2`, :data:`!PROTOCOL_SSLv3`, :data:`!PROTOCOL_SSLv23`, :data:`!PROTOCOL_TLSv1`, :data:`!PROTOCOL_TLSv1_1`, :data:`!PROTOCOL_TLSv1_2`, and :const:`!PROTOCOL_TLS` are deprecated in favor of :const:`~ssl.PROTOCOL_TLS_CLIENT` and :const:`~ssl.PROTOCOL_TLS_SERVER`
pt_br: :data:`!PROTOCOL_SSLv2`, :data:`!PROTOCOL_SSLv3`, :data:`!PROTOCOL_SSLv23`, :data:`!PROTOCOL_TLSv1`, :data:`!PROTOCOL_TLSv1_1`, :data:`!PROTOCOL_TLSv1_2` e :const:`!PROTOCOL_TLS` foram descontinuados em favor de :const:`~ssl.PROTOCOL_TLS_CLIENT` e :const:`~ssl.PROTOCOL_TLS_SERVER`

source: :func:`!wrap_socket` is replaced by :meth:`ssl.SSLContext.wrap_socket`
pt_br: :func:`!wrap_socket` foi substituída por :meth:`ssl.SSLContext.wrap_socket`
