Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: Static methods (:func:`@staticmethod <staticmethod>`) and class methods (:func:`@classmethod <classmethod>`) now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__``, ``__annotations__``) and have a new ``__wrapped__`` attribute. Moreover, static methods are now callable as regular functions. (Contributed by Victor Stinner in :issue:`43682`.)
pt_br: Métodos estáticos (:func:`@staticmethod <staticmethod>`) e métodos de classe (:func:`@classmethod <classmethod>`) agora herdam os atributos de método (``__module__``, ``__name__``, ``__qualname__``, ``__doc__``, ``__annotations__``) e têm um novo atributo ``__wrapped__`` . Além disso, métodos estáticos são agora chamáveis como funções comuns. (Contribuição de Victor Stinner em :issue:`43682`.)

source: Annotations for complex targets (everything beside ``simple name`` targets defined by :pep:`526`) no longer cause any runtime effects with ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42737`.)
pt_br: Anotações para alvos complexos (tudo além de alvos de nome simples, ou ``simple name``, definidos pela :pep:`526`) não causam mais nenhum efeito de tempo de execução com ``from __future__ import annotations``. (Contribuição de Batuhan Taskaya em :issue:`42737`.)

source: Class and module objects now lazy-create empty annotations dicts on demand. The annotations dicts are stored in the object’s ``__dict__`` for backwards compatibility. This improves the best practices for working with ``__annotations__``; for more information, please see :ref:`annotations-howto`. (Contributed by Larry Hastings in :issue:`43901`.)
pt_br: Objetos classe e módulo agora criam preguiçosamente dados vazios de anotações sob demanda. Os dicionários de anotações são armazenados em ``__dict__`` do objeto para compatibilidade com versões anteriores. Isso melhora as melhores práticas para trabalhar com ``__annotations__``; para mais informações, veja :ref:`annotations-howto`. (Contribuição de Larry Hastings em :issue:`43901`.)

source: Annotations consist of ``yield``, ``yield from``, ``await`` or named expressions are now forbidden under ``from __future__ import annotations`` due to their side effects. (Contributed by Batuhan Taskaya in :issue:`42725`.)
pt_br: Anotações consistindo em ``yield``, ``yield from``, ``await`` ou expressões nomeadas agora são proibidas em ``from __future__ import annotations`` por causa de seus efeitos colaterais. (Contribuição de Batuhan Taskaya em :issue:`42725`.)

source: Usage of unbound variables, ``super()`` and other expressions that might alter the processing of symbol table as annotations are now rendered effectless under ``from __future__ import annotations``. (Contributed by Batuhan Taskaya in :issue:`42725`.)
pt_br: O uso de variáveis não ligadas, ``super()`` e outras expressões que podem alterar o processamento da tabela de símbolos como anotações são agora processadas sem efeito sob ``from __future__ import annotations``. (Contribuição de Batuhan Taskaya em :issue:`42725`.)

source: Hashes of NaN values of both :class:`float` type and :class:`decimal.Decimal` type now depend on object identity. Formerly, they always hashed to ``0`` even though NaN values are not equal to one another. This caused potentially quadratic runtime behavior due to excessive hash collisions when creating dictionaries and sets containing multiple NaNs. (Contributed by Raymond Hettinger in :issue:`43475`.)
pt_br: Hashes de valores NaN de ambos os tipos :class:`float` e :class:`decimal.Decimal` agora dependem da identidade do objeto. Anteriormente, eles sempre hash para ``0`` mesmo que os valores NaN não sejam iguais uns aos outros. Isso causou um comportamento de tempo de execução potencialmente quadrático devido a colisões de hash excessivas ao criar dicionários e conjuntos contendo vários NaNs. (Contribuição de Raymond Hettinger em :issue:`43475`.)

source: A :exc:`SyntaxError` (instead of a :exc:`NameError`) will be raised when deleting the :const:`__debug__` constant. (Contributed by Donghee Na in :issue:`45000`.)
pt_br: Uma :exc:`SyntaxError` (ao invés de uma :exc:`NameError`) será levantada ao excluir a constante :const:`__debug__`. (Contribuição de Donghee Na em :issue:`45000`.)

source: :exc:`SyntaxError` exceptions now have ``end_lineno`` and ``end_offset`` attributes. They will be ``None`` if not determined. (Contributed by Pablo Galindo in :issue:`43914`.)
pt_br: Exceções :exc:`SyntaxError` agora possuem atributos ``end_lineno`` e ``end_offset``. Eles serão ``None`` se não forem determinados. (Contribuição de Pablo Galindo em :issue:`43914`.)

source: New Modules
pt_br: Novos módulos

source: None.
pt_br: Nenhum.

source: Improved Modules
pt_br: Módulos melhorados

source: Add missing :meth:`~asyncio.loop.connect_accepted_socket` method. (Contributed by Alex Grönholm in :issue:`41332`.)
pt_br: Adiciona o método :meth:`~asyncio.loop.connect_accepted_socket` até então em falta. (Contribuição de Alex Grönholm em :issue:`41332`.)

source: Misleading phrase "optional arguments" was replaced with "options" in argparse help. Some tests might require adaptation if they rely on exact output match. (Contributed by Raymond Hettinger in :issue:`9694`.)
pt_br: A frase enganosa "argumentos opcionais" foi substituída por "opções" na ajuda do argparse. Alguns testes podem exigir adaptação se eles dependerem da correspondência de saída exata. (Contribuição de Raymond Hettinger em :issue:`9694`.)

source: The :meth:`~array.array.index` method of :class:`array.array` now has optional *start* and *stop* parameters. (Contributed by Anders Lorentsen and Zackery Spytz in :issue:`31956`.)
pt_br: O método :meth:`~array.array.index` de :class:`array.array` agora possui os parâmetros *start* e *stop*. (Contribuição de Anders Lorentsen e Zackery Spytz em :issue:`31956`.)

source: These modules have been marked as deprecated in their module documentation since Python 3.6. An import-time :class:`DeprecationWarning` has now been added to all three of these modules.
pt_br: Esses módulos foram marcados como descontinuados em sua documentação de módulo desde o Python 3.6. Uma exceção :class:`DeprecationWarning` em tempo de importação agora foi adicionada a todos esses três módulos.

source: Add :func:`base64.b32hexencode` and :func:`base64.b32hexdecode` to support the Base32 Encoding with Extended Hex Alphabet.
pt_br: Adiciona :func:`base64.b32hexencode` e :func:`base64.b32hexdecode` para dar suporte a Codificação Base32 com alfabeto hexa estendido.

source: Add :meth:`!clearBreakpoints` to reset all set breakpoints. (Contributed by Irit Katriel in :issue:`24160`.)
pt_br: Adiciona :meth:`!clearBreakpoints` para redefinir todos os pontos de interrupção definidos. (Contribuição de Irit Katriel em :issue:`24160`.)

source: Added the possibility of providing a *key* function to the APIs in the :mod:`bisect` module. (Contributed by Raymond Hettinger in :issue:`4356`.)
pt_br: Adicionada a possibilidade de fornecer uma função *key* para as APIs no módulo :mod:`bisect`. (Contribuição de Raymond Hettinger em :issue:`4356`.)

source: Add a :func:`codecs.unregister` function to unregister a codec search function. (Contributed by Hai Shi in :issue:`41842`.)
pt_br: Adiciona uma função :func:`codecs.unregister` para cancelar um registro de uma função de pesquisa de codecs. (Contribuição de Hai Shi em :issue:`41842`.)

source: The ``__args__`` of the :ref:`parameterized generic <types-genericalias>` for :class:`collections.abc.Callable` are now consistent with :data:`typing.Callable`. :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Note that a :exc:`TypeError` may be raised for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9. (Contributed by Ken Jin in :issue:`42195`.)
pt_br: Os ``__args__`` do :ref:`genérico parametrizado <types-genericalias>` para :class:`collections.abc.Callable` agora são consistentes com :data:`typing.Callable`. A classe genérica :class:`collections.abc.Callable` agora achata parâmetros de tipo, de forma semelhante ao que :data:`typing.Callable` atualmente faz. Isso significa que ``collections.abc.Callable[[int, str], str]`` terá ``__args__`` de ``(int, str, str)``; anteriormente, isso era ``([int, str], str)``. Para permitir esta alteração, agora é possível criar subclasse de :class:`types.GenericAlias` e uma subclasse será retornada ao fazer um subscript do tipo :class:`collections.abc.Callable`. Observe que uma :exc:`TypeError` pode ser levantada para formas inválidas de parametrizar :class:`collections.abc.Callable` que podem ter passado silenciosamente no Python 3.9. (Contribuição de Ken Jin em :issue:`42195`.)

source: Add a :func:`contextlib.aclosing` context manager to safely close async generators and objects representing asynchronously released resources. (Contributed by Joongi Kim and John Belmonte in :issue:`41229`.)
pt_br: Adiciona um gerenciador de contexto :func:`contextlib.aclosing` para fechar com segurança geradores assíncronos e objetos que representam recursos liberados de forma assíncrona. (Contribuição de Joongi Kim e John Belmonte em :issue:`41229`.)

source: Add asynchronous context manager support to :func:`contextlib.nullcontext`. (Contributed by Tom Gringauz in :issue:`41543`.)
pt_br: Adiciona suporte a gerenciador de contexto assíncrono a :func:`contextlib.nullcontext`. (Contribuição de Tom Gringauz em :issue:`41543`.)

source: Add :class:`~contextlib.AsyncContextDecorator`, for supporting usage of async context managers as decorators.
pt_br: Adiciona :class:`~contextlib.AsyncContextDecorator`, para dar suporte ao uso de gerenciadores de contexto assíncronos como decoradores.

source: The extended color functions added in ncurses 6.1 will be used transparently by :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair`, and :func:`curses.pair_content`. A new function, :func:`curses.has_extended_color_support`, indicates whether extended color support is provided by the underlying ncurses library. (Contributed by Jeffrey Kintscher and Hans Petter Jansson in :issue:`36982`.)
pt_br: As funções de cores estendidas adicionadas no ncurses 6.1 serão usadas transparentemente por :func:`curses.color_content`, :func:`curses.init_color`, :func:`curses.init_pair` e :func:`curses.pair_content`. Uma nova função, :func:`curses.has_extended_color_support`, indica se o suporte a cores estendidas é fornecido pela biblioteca ncurses subjacente. (Contribuição de Jeffrey Kintscher e Hans Petter Jansson em :issue:`36982`.)

source: The ``BUTTON5_*`` constants are now exposed in the :mod:`curses` module if they are provided by the underlying curses library. (Contributed by Zackery Spytz in :issue:`39273`.)
pt_br: As constantes ``BUTTON5_*`` agora são expostas no módulo :mod:`curses` se forem fornecidas pela biblioteca curses subjacente. (Contribuição de Zackery Spytz em :issue:`39273`.)

source: Added ``slots`` parameter in :func:`dataclasses.dataclass` decorator. (Contributed by Yurii Karabas in :issue:`42269`)
pt_br: Adicionado o parâmetro ``slots`` no decorador :func:`dataclasses.dataclass`. (Contribuição de Yurii Karabas em :issue:`42269`)

source: Keyword-only fields
pt_br: Campos somente-nomeados

source: dataclasses now supports fields that are keyword-only in the generated __init__ method. There are a number of ways of specifying keyword-only fields.
pt_br: dataclasses agora oferece suporte a campos que são somente-nomeados no método __init__ gerado. Há várias maneiras de especificar campos somente-nomeados.

source: You can say that every field is keyword-only:
pt_br: Você pode dizer que todos os campos são somente-nomeados:

source: Both ``name`` and ``birthday`` are keyword-only parameters to the generated __init__ method.
pt_br: Ambos ``name`` e ``birthday`` são parâmetros somente-nomeados para o método __init__ gerado.

source: You can specify keyword-only on a per-field basis:
pt_br: Você pode especificar somente-nomeado por campo:

source: Here only ``birthday`` is keyword-only. If you set ``kw_only`` on individual fields, be aware that there are rules about re-ordering fields due to keyword-only fields needing to follow non-keyword-only fields. See the full dataclasses documentation for details.
pt_br: Aqui apenas ``birthday`` é somente-nomeado. Se você definir ``kw_only`` em campos individuais, esteja ciente de que existem regras sobre a reordenação de campos devido a campos somente-nomeados que precisam seguir campos não somente-nomeados. Consulte a documentação completa de dataclasses para obter detalhes.

source: You can also specify that all fields following a KW_ONLY marker are keyword-only. This will probably be the most common usage:
pt_br: Você também pode especificar que todos os campos a partir de um marcador KW_ONLY sejam somente-nomeados. Este provavelmente será o uso mais comum:

source: Here, ``z`` and ``t`` are keyword-only parameters, while ``x`` and ``y`` are not. (Contributed by Eric V. Smith in :issue:`43532`.)
pt_br: Aqui, ``z`` e ``t`` são parâmetros somente-nomeados, enquanto ``x`` e ``y`` não são. (Contribuição de Eric V. Smith em :issue:`43532`.)

source: The entire ``distutils`` package is deprecated, to be removed in Python 3.12. Its functionality for specifying package builds has already been completely replaced by third-party packages ``setuptools`` and ``packaging``, and most other commonly used APIs are available elsewhere in the standard library (such as :mod:`platform`, :mod:`shutil`, :mod:`subprocess` or :mod:`sysconfig`). There are no plans to migrate any other functionality from ``distutils``, and applications that are using other functions should plan to make private copies of the code. Refer to :pep:`632` for discussion.
pt_br: Todo o pacote ``distutils`` foi descontinuado, para ser removido no Python 3.12. Sua funcionalidade para especificar compilações de pacote já foi completamente substituída por pacotes de terceiros ``setuptools`` e ``packaging``, e a maioria das outras APIs comumente usadas estão disponíveis em outro lugar na biblioteca padrão (como :mod:`platform`, :mod:`shutil`, :mod:`subprocess` ou :mod:`sysconfig`). Não há planos para migrar qualquer outra funcionalidade de ``distutils``, e aplicativos que estão usando outras funções devem planejar fazer cópias privadas do código. Consulte :pep:`632` para discussão.

source: The ``bdist_wininst`` command deprecated in Python 3.8 has been removed. The ``bdist_wheel`` command is now recommended to distribute binary packages on Windows. (Contributed by Victor Stinner in :issue:`42802`.)
pt_br: O comando descontinuado ``bdist_wininst`` no Python 3.8 foi removido. O comando ``bdist_wheel`` agora é recomendado para distribuir pacotes binários no Windows. (Contribuição de Victor Stinner em :issue:`42802`.)

source: When a module does not define ``__loader__``, fall back to ``__spec__.loader``. (Contributed by Brett Cannon in :issue:`42133`.)
pt_br: Quando um módulo não define ``__loader__``, recorre a ``__spec__.loader``. (Contribuição de Brett Cannon em :issue:`42133`.)

source: :func:`encodings.normalize_encoding` now ignores non-ASCII characters. (Contributed by Hai Shi in :issue:`39337`.)
pt_br: :func:`encodings.normalize_encoding` agora ignora caracteres não-ASCII. (Contribuição de Hai Shi em :issue:`39337`.)

source: :class:`~enum.Enum` :func:`~object.__repr__` now returns ``enum_name.member_name`` and :func:`~object.__str__` now returns ``member_name``. Stdlib enums available as module constants have a :func:`repr` of ``module_name.member_name``. (Contributed by Ethan Furman in :issue:`40066`.)
pt_br: :func:`~object.__repr__` do :class:`~enum.Enum` agora retorna ``enum_name.member_name`` e :func:`~object.__str__` agora retorna ``member_name``. Os enums da stdlib disponíveis como constantes de módulo têm :func:`repr` de ``module_name.member_name``. (Contribuição de Ethan Furman em :issue:`40066`.)

source: Add :class:`enum.StrEnum` for enums where all members are strings. (Contributed by Ethan Furman in :issue:`41816`.)
pt_br: Adiciona :class:`enum.StrEnum` para enums onde todos os membros são strings. (Contribuição de Ethan Furman em :issue:`41816`.)

source: Add *encoding* and *errors* parameters in :func:`fileinput.input` and :class:`fileinput.FileInput`. (Contributed by Inada Naoki in :issue:`43712`.)
pt_br: Adiciona os parâmetros *encoding* e *errors* a :func:`fileinput.input` e :class:`fileinput.FileInput`. (Contribuição de Inada Naoki em :issue:`43712`.)

source: :func:`fileinput.hook_compressed` now returns :class:`~io.TextIOWrapper` object when *mode* is "r" and file is compressed, like uncompressed files. (Contributed by Inada Naoki in :issue:`5758`.)
pt_br: :func:`fileinput.hook_compressed` agora retorna um objeto :class:`~io.TextIOWrapper` quando *mode* é "r" e o arquivo está compactado, como arquivos descompactados. (Contribuição de Inada Naoki em :issue:`5758`.)

source: The :mod:`faulthandler` module now detects if a fatal error occurs during a garbage collector collection. (Contributed by Victor Stinner in :issue:`44466`.)
pt_br: O módulo :mod:`faulthandler` agora detecta se um erro fatal ocorre durante a coleta do coletor de lixo. (Contribuição de Victor Stinner em :issue:`44466`.)

source: Add audit hooks for :func:`gc.get_objects`, :func:`gc.get_referrers` and :func:`gc.get_referents`. (Contributed by Pablo Galindo in :issue:`43439`.)
pt_br: Adiciona ganchos de auditoria para :func:`gc.get_objects`, :func:`gc.get_referrers` e :func:`gc.get_referents`. (Contribuição de Pablo Galindo em :issue:`43439`.)

source: Add the *root_dir* and *dir_fd* parameters in :func:`~glob.glob` and :func:`~glob.iglob` which allow to specify the root directory for searching. (Contributed by Serhiy Storchaka in :issue:`38144`.)
pt_br: Adiciona os parâmetros *root_dir* e *dir_fd* em :func:`~glob.glob` e :func:`~glob.iglob`, o que permite especificar o diretório raiz para a pesquisa. (Contribuição de Serhiy Storchaka em :issue:`38144`.)

source: The hashlib module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
pt_br: O módulo hashlib requer OpenSSL 1.1.1 ou mais recente. (Contribuição de Christian Heimes em :pep:`644` e :issue:`43669`.)

source: The hashlib module has preliminary support for OpenSSL 3.0.0. (Contributed by Christian Heimes in :issue:`38820` and other issues.)
pt_br: O módulo hashlib tem suporte preliminar a OpenSSL 3.0.0. (Contribuição de Christian Heimes em :issue:`38820` e outras issues.)

source: The pure-Python fallback of :func:`~hashlib.pbkdf2_hmac` is deprecated. In the future PBKDF2-HMAC will only be available when Python has been built with OpenSSL support. (Contributed by Christian Heimes in :issue:`43880`.)
pt_br: A alternativa puramente Python de :func:`~hashlib.pbkdf2_hmac` foi descontinuada. No futuro, o PBKDF2-HMAC só estará disponível quando o Python for desenvolvido com suporte a OpenSSL. (Contribuição de Christian Heimes em :issue:`43880`.)

source: The hmac module now uses OpenSSL's HMAC implementation internally. (Contributed by Christian Heimes in :issue:`40645`.)
pt_br: O módulo hmac agora usa a implementação HMAC do OpenSSL internamente. (Contribuição de Christian Heimes em :issue:`40645`.)

source: IDLE and idlelib
pt_br: IDLE e idlelib

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
pt_br: Faz o IDLE invocar :func:`sys.excepthook` (quando iniciado sem '-n'). Ganchos de usuário eram ignorados anteriormente. (Contribuição de Ken Hilton em :issue:`43008`.)

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
pt_br: Reorganiza a caixa de diálogo de configurações. Divide a aba General nas abas Windows e Shell/Ed. Move as fontes de ajuda, que estendem o menu Help, para a aba Extensions. Abre espaço para novas opções e encurta a caixa de diálogo. O último faz com que o diálogo se ajuste melhor a telas pequenas. (Contribuição de Terry Jan Reedy em :issue:`40468`.) Move a configuração do espaço de recuo da aba Font para a nova aba Windows. (Contribuição de Mark Roseman e Terry Jan Reedy em :issue:`33962`.)

source: The changes above were backported to a 3.9 maintenance release.
pt_br: As alterações acima foram portadas para uma versão de manutenção 3.9.

source: Add a Shell sidebar. Move the primary prompt ('>>>') to the sidebar. Add secondary prompts ('...') to the sidebar. Left click and optional drag selects one or more lines of text, as with the editor line number sidebar. Right click after selecting text lines displays a context menu with 'copy with prompts'. This zips together prompts from the sidebar with lines from the selected text. This option also appears on the context menu for the text. (Contributed by Tal Einat in :issue:`37903`.)
pt_br: Adiciona uma barra lateral ao console. Move o prompt principal ('>>>') para a barra lateral. Adiciona prompts secundários ('...') à barra lateral. Clicar com o botão esquerdo e opcionalmente arrastar seleciona uma ou mais linhas de texto, como na barra lateral do número da linha do editor. Clicar com o botão direito após selecionar as linhas de texto exibe um menu de contexto com "copy with prompts". Isso compacta os prompts da barra lateral com linhas do texto selecionado. Esta opção também aparece no menu de contexto para o texto. (Contribuição de Tal Einat em :issue:`37903`.)

source: Use spaces instead of tabs to indent interactive code. This makes interactive code entries 'look right'. Making this feasible was a major motivation for adding the shell sidebar. (Contributed by Terry Jan Reedy in :issue:`37892`.)
pt_br: Use espaços em vez de tabulações para indentar o código interativo. Isso faz com que as entradas de código interativo "pareçam corretas". Tornar isso viável foi a principal motivação para adicionar a barra lateral do console. Contribuição de Terry Jan Reedy em :issue:`37892`.)

source: Highlight the new :ref:`soft keywords <soft-keywords>` :keyword:`match`, :keyword:`case <match>`, and :keyword:`_ <wildcard-patterns>` in pattern-matching statements. However, this highlighting is not perfect and will be incorrect in some rare cases, including some ``_``-s in ``case`` patterns. (Contributed by Tal Einat in :issue:`44010`.)
pt_br: Realça as novas :ref:`palavra reservada suave <soft-keywords>` :keyword:`match`, :keyword:`case <match>` e :keyword:`_ <wildcard-patterns>` em instruções de correspondência de padrões. No entanto, este realce não é perfeito e estará incorreto em alguns casos raros, incluindo alguns ``_`` em padrões de ``case``. (Contribuição de Tal Einat em :issue:`44010`.)

source: New in 3.10 maintenance releases.
pt_br: Novo nas versões de manutenção 3.10.

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
pt_br: Aplica realce de sintaxe em arquivos ``.pyi``. (Contribuição de Alex Waygood e Terry Jan Reedy em :issue:`45447`.)
