Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: What's New In Python 3.10
pt_br: O que há de novo no Python 3.10

source: This article explains the new features in Python 3.10, compared to 3.9. Python 3.10 was released on October 4, 2021. For full details, see the :ref:`changelog <changelog>`.
pt_br: Este artigo explica os novos recursos no Python 3.10, em comparação com 3.9. Python 3.10 foi lançado em 4 de outubro de 2021. Veja :ref:`changelog<changelog>` para uma lista completa de mudanças.

source: Summary -- Release highlights
pt_br: Resumo -- Destaques da versão

source: New syntax features:
pt_br: Novos recursos de sintaxe:

source: :pep:`634`, Structural Pattern Matching: Specification
pt_br: :pep:`634`, Correspondência de padrão estrutural: especificação

source: :pep:`635`, Structural Pattern Matching: Motivation and Rationale
pt_br: :pep:`635`, Correspondência de padrão estrutural: motivação e justificativa

source: :pep:`636`, Structural Pattern Matching: Tutorial
pt_br: :pep:`636`, Correspondência de padrão estrutural: Tutorial

source: :issue:`12782`, Parenthesized context managers are now officially allowed.
pt_br: :issue:`12782`, Gerenciadores de contexto entre parênteses agora são permitidos oficialmente.

source: New features in the standard library:
pt_br: Novos recursos na biblioteca padrão:

source: :pep:`618`, Add Optional Length-Checking To zip.
pt_br: :pep:`618`, Adiciona verificação de comprimento opcional ao zip.

source: Interpreter improvements:
pt_br: Melhorias no interpretador:

source: :pep:`626`, Precise line numbers for debugging and other tools.
pt_br: :pep:`626`, Números de linha precisos para depuração e outras ferramentas.

source: New typing features:
pt_br: Novos recursos de tipagem:

source: :pep:`604`, Allow writing union types as X | Y
pt_br: :pep:`604`, Permite escrever tipos de união como X | Y

source: :pep:`612`, Parameter Specification Variables
pt_br: :pep:`612`, Variáveis de especificação de parâmetro

source: :pep:`613`, Explicit Type Aliases
pt_br: :pep:`613`, Apelidos de tipo explícitos

source: :pep:`647`, User-Defined Type Guards
pt_br: :pep:`647`, Guardas de Tipo Definidas Pelo Usuário

source: Important deprecations, removals or restrictions:
pt_br: Descontinuações, remoções ou restrições importantes:

source: :pep:`644`, Require OpenSSL 1.1.1 or newer
pt_br: :pep:`644`, Exige OpenSSL 1.1.1 ou mais novo

source: :pep:`632`, Deprecate distutils module.
pt_br: :pep:`632`, Descontinua o módulo distutils.

source: :pep:`623`, Deprecate and prepare for the removal of the wstr member in PyUnicodeObject.
pt_br: :pep:`623`, Descontinua e prepara para a remoção do membro wstr em PyUnicodeObject.

source: :pep:`624`, Remove Py_UNICODE encoder APIs
pt_br: :pep:`624`, Remove APIs codificadoras de Py_UNICODE

source: :pep:`597`, Add optional EncodingWarning
pt_br: :pep:`597`, Adiciona EncodingWarning opcional

source: New Features
pt_br: Novas funcionalidades

source: Parenthesized context managers
pt_br: Gerenciadores de contexto entre parênteses

source: Using enclosing parentheses for continuation across multiple lines in context managers is now supported. This allows formatting a long collection of context managers in multiple lines in a similar way as it was previously possible with import statements. For instance, all these examples are now valid:
pt_br: O uso de parênteses para continuação em várias linhas em gerenciadores de contexto agora é suportado. Isso permite a formatação de uma longa coleção de gerenciadores de contexto em várias linhas de maneira semelhante à que era possível anteriormente com instruções de importação. Por exemplo, todos esses exemplos agora são válidos:

source: with (CtxManager() as example): ... with ( CtxManager1(), CtxManager2() ): ... with (CtxManager1() as example, CtxManager2()): ... with (CtxManager1(), CtxManager2() as example): ... with ( CtxManager1() as example1, CtxManager2() as example2 ): ...
pt_br: with (CtxManager() as exemplo): ... with ( CtxManager1(), CtxManager2() ): ... with (CtxManager1() as exemplo, CtxManager2()): ... with (CtxManager1(), CtxManager2() as exemplo): ... with ( CtxManager1() as exemplo1, CtxManager2() as exemplo2 ): ...

source: it is also possible to use a trailing comma at the end of the enclosed group:
pt_br: também é possível usar uma vírgula no final do grupo fechado:

source: with ( CtxManager1() as example1, CtxManager2() as example2, CtxManager3() as example3, ): ...
pt_br: with ( CtxManager1() as exemplo1, CtxManager2() as exemplo2, CtxManager3() as exemplo3, ): ...

source: This new syntax uses the non LL(1) capacities of the new parser. Check :pep:`617` for more details.
pt_br: Esta nova sintaxe usa as capacidades não LL(1) do novo analisador sintático. Confira :pep:`617` para mais detalhes.

source: (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`12782` and :issue:`40334`.)
pt_br: (Contribuição de Guido van Rossum, Pablo Galindo e Lysandros Nikolaou em :issue:`12782` e :issue:`40334`.)

source: Better error messages
pt_br: Melhores mensagens de erro

source: When parsing code that contains unclosed parentheses or brackets the interpreter now includes the location of the unclosed bracket of parentheses instead of displaying *SyntaxError: unexpected EOF while parsing* or pointing to some incorrect location. For instance, consider the following code (notice the unclosed '{'):
pt_br: Ao analisar o código que contém parênteses ou chaves não fechados, o interpretador agora inclui o local da chave não fechado de parênteses em vez de exibir *SyntaxError: unexpected EOF while parsing* ou apontando para algum local incorreto. Por exemplo, considere o seguinte código (observe o "{" não fechado):

source: expected = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, 38: 4, 39: 4, 45: 5, 46: 5, 47: 5, 48: 5, 49: 5, 54: 6, some_other_code = foo()
pt_br: esperado = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, 38: 4, 39: 4, 45: 5, 46: 5, 47: 5, 48: 5, 49: 5, 54: 6, algum_outro_codigo = foo()

source: Previous versions of the interpreter reported confusing places as the location of the syntax error:
pt_br: Versões anteriores do interpretador relatavam lugares confusos como local do erro de sintaxe:

source: File "example.py", line 3 some_other_code = foo() ^ SyntaxError: invalid syntax
pt_br: File "exemplo.py", line 3 algum_outro_codigo = foo() ^ SyntaxError: invalid syntax

source: but in Python 3.10 a more informative error is emitted:
pt_br: mas no Python 3.10, um erro mais informativo é emitido:

source: File "example.py", line 1 expected = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, ^ SyntaxError: '{' was never closed
pt_br: File "exemplo.py", line 1 esperado = {9: 1, 18: 2, 19: 2, 27: 3, 28: 3, 29: 3, 36: 4, 37: 4, ^ SyntaxError: '{' was never closed

source: In a similar way, errors involving unclosed string literals (single and triple quoted) now point to the start of the string instead of reporting EOF/EOL.
pt_br: De maneira semelhante, erros envolvendo literais de string não fechadas (entre aspas simples e triplas) agora apontam para o início da string em vez de relatar EOF/EOL.

source: These improvements are inspired by previous work in the PyPy interpreter.
pt_br: Essas melhorias são inspiradas em trabalhos anteriores no interpretador PyPy.

source: (Contributed by Pablo Galindo in :issue:`42864` and Batuhan Taskaya in :issue:`40176`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`42864` e Batuhan Taskaya em :issue:`40176`.)

source: :exc:`SyntaxError` exceptions raised by the interpreter will now highlight the full error range of the expression that constitutes the syntax error itself, instead of just where the problem is detected. In this way, instead of displaying (before Python 3.10):
pt_br: As exceções :exc:`SyntaxError` levantadas pelo interpretador agora destacam o intervalo total de erros da expressão que constitui o próprio erro de sintaxe, em vez de apenas onde o problema foi detectado. Desta forma, em vez de exibir (antes do Python 3.10):

source: now Python 3.10 will display the exception as:
pt_br: agora o Python 3.10 vai exibir a exceção como:

source: This improvement was contributed by Pablo Galindo in :issue:`43914`.
pt_br: Esta melhoria foi contribuída por Pablo Galindo em :issue:`43914`.

source: A considerable amount of new specialized messages for :exc:`SyntaxError` exceptions have been incorporated. Some of the most notable ones are as follows:
pt_br: Uma quantidade considerável de novas mensagens especializadas para exceções :exc:`SyntaxError` foram incorporadas. Alguns dos mais notáveis são os seguintes:

source: Missing ``:`` before blocks:
pt_br: Faltando ``:`` antes de blocos:

source: >>> if rocket.position > event_horizon File "<stdin>", line 1 if rocket.position > event_horizon ^ SyntaxError: expected ':'
pt_br: >>> if foguete.posicao > horizonte_evento File "<stdin>", line 1 if foguete.posicao > horizonte_evento ^ SyntaxError: expected ':'

source: (Contributed by Pablo Galindo in :issue:`42997`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`42997`.)

source: Unparenthesised tuples in comprehensions targets:
pt_br: Tuplas sem parênteses em alvos de compreensão:

source: (Contributed by Pablo Galindo in :issue:`43017`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`43017`.)

source: Missing commas in collection literals and between expressions:
pt_br: Faltando vírgulas em literais de coleção e entre expressões:

source: (Contributed by Pablo Galindo in :issue:`43822`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`43822`.)

source: Multiple Exception types without parentheses:
pt_br: Vários tipos de exceção sem parênteses:

source: >>> try: ... build_dyson_sphere() ... except NotEnoughScienceError, NotEnoughResourcesError: File "<stdin>", line 3 except NotEnoughScienceError, NotEnoughResourcesError: ^ SyntaxError: multiple exception types must be parenthesized
pt_br: >>> try: ... construir_esfera_de_dyson() ... except NotEnoughScienceError, NotEnoughResourcesError: File "<stdin>", line 3 except NotEnoughScienceError, NotEnoughResourcesError: ^ SyntaxError: multiple exception types must be parenthesized

source: (Contributed by Pablo Galindo in :issue:`43149`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`43149`.)

source: Missing ``:`` and values in dictionary literals:
pt_br: Faltando ``:`` em valores em literais de dicionário:

source: (Contributed by Pablo Galindo in :issue:`43823`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`43823`.)

source: ``try`` blocks without ``except`` or ``finally`` blocks:
pt_br: Blocos ``try`` sem blocos ``except`` ou ``finally``:

source: >>> try: ... x = 2 ... something = 3 File "<stdin>", line 3 something = 3 ^^^^^^^^^ SyntaxError: expected 'except' or 'finally' block
pt_br: >>> try: ... x = 2 ... algumacoisa = 3 File "<stdin>", line 3 algumacoisa = 3 ^^^^^^^^^^^ SyntaxError: expected 'except' or 'finally' block

source: (Contributed by Pablo Galindo in :issue:`44305`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`44305`.)

source: Usage of ``=`` instead of ``==`` in comparisons:
pt_br: Uso de ``=`` em vez de ``==`` nas comparações:

source: >>> if rocket.position = event_horizon: File "<stdin>", line 1 if rocket.position = event_horizon: ^ SyntaxError: cannot assign to attribute here. Maybe you meant '==' instead of '='?
pt_br: >>> if foguete.posicao = horizonte_evento: File "<stdin>", line 1 if foguete.posicao = horizonte_evento: ^ SyntaxError: cannot assign to attribute here. Maybe you meant '==' instead of '='?

source: (Contributed by Pablo Galindo in :issue:`43797`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`43797`.)

source: Usage of ``*`` in f-strings:
pt_br: Uso de ``*`` em f-strings:

source: >>> f"Black holes {*all_black_holes} and revelations" File "<stdin>", line 1 (*all_black_holes) ^ SyntaxError: f-string: cannot use starred expression here
pt_br: >>> f"Buracos negros {*all_black_holes} e revelações" File "<stdin>", line 1 (*all_black_holes) ^ SyntaxError: f-string: cannot use starred expression here

source: (Contributed by Pablo Galindo in :issue:`41064`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`41064`.)

source: Many :exc:`IndentationError` exceptions now have more context regarding what kind of block was expecting an indentation, including the location of the statement:
pt_br: Muitas exceções :exc:`IndentationError` agora têm mais contexto sobre que tipo de bloco estava esperando um indentação, incluindo a localização da instrução:

source: When printing :exc:`AttributeError`, :c:func:`!PyErr_Display` will offer suggestions of similar attribute names in the object that the exception was raised from:
pt_br: Ao exibir :exc:`AttributeError`, :c:func:`!PyErr_Display` oferecerá sugestões de nomes de atributos semelhantes no objeto a partir do qual a exceção foi levantada:

source: (Contributed by Pablo Galindo in :issue:`38530`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`38530`.)

source: Notice this won't work if :c:func:`!PyErr_Display` is not called to display the error which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
pt_br: Observe que isso não funcionará se :c:func:`!PyErr_Display` não for chamado para exibir o erro que pode ocorrer se alguma outra função personalizada de exibição de erro for usada. Este é um cenário comum em alguns REPLs, laços de leitura-avaliação-impressão, como o IPython.

source: When printing :exc:`NameError` raised by the interpreter, :c:func:`!PyErr_Display` will offer suggestions of similar variable names in the function that the exception was raised from:
pt_br: Ao exibir :exc:`NameError` levantada pelo interpretador, :c:func:`!PyErr_Display` irá oferecer sugestões de nomes de variáveis semelhantes na função de onde a exceção foi levantada:

source: >>> schwarzschild_black_hole = None >>> schwarschild_black_hole Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'schwarschild_black_hole' is not defined. Did you mean: schwarzschild_black_hole?
pt_br: >>> buraco_negro_de_schwarzschild = None >>> buraco_negro_de_schwarschild Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'buraco_negro_de_schwarschild' is not defined. Did you mean: buraco_negro_de_schwarzschild?

source: Notice this won't work if :c:func:`!PyErr_Display` is not called to display the error, which can happen if some other custom error display function is used. This is a common scenario in some REPLs like IPython.
pt_br: Observe que isso não funcionará se :c:func:`!PyErr_Display` não for chamado para exibir o erro que pode ocorrer se alguma outra função personalizada de exibição de erro for usada. Este é um cenário comum em alguns REPLs, laços de leitura-avaliação-impressão, como o IPython.

source: PEP 626: Precise line numbers for debugging and other tools
pt_br: PEP 626: Números de linha precisos para depuração e outras ferramentas

source: PEP 626 brings more precise and reliable line numbers for debugging, profiling and coverage tools. Tracing events, with the correct line number, are generated for all lines of code executed and only for lines of code that are executed.
pt_br: O PEP 626 traz números de linha mais precisos e confiáveis para ferramentas de depuração, criação de perfil e cobertura. Eventos de rastreamento, com o número de linha correto, são gerados para todas as linhas de código executadas e apenas para linhas de código que são executadas.

source: The :attr:`~frame.f_lineno` attribute of frame objects will always contain the expected line number.
pt_br: O atributo :attr:`~frame.f_lineno` de objetos de quadro sempre conterá o número de linha esperado.

source: The :attr:`~codeobject.co_lnotab` attribute of :ref:`code objects <code-objects>` is deprecated and will be removed in 3.12. Code that needs to convert from offset to line number should use the new :meth:`~codeobject.co_lines` method instead.
pt_br: O atributo :attr:`~codeobject.co_lnotab` :ref:`code objects <code-objects>` foi descontinuado e será removido no 3.12. O código que precisa ser convertido do deslocamento para o número da linha deve usar o novo método :meth:`~codeobject.co_lines`.

source: PEP 634: Structural Pattern Matching
pt_br: PEP 634: Correspondência de padrão estrutural

source: Structural pattern matching has been added in the form of a *match statement* and *case statements* of patterns with associated actions. Patterns consist of sequences, mappings, primitive data types as well as class instances. Pattern matching enables programs to extract information from complex data types, branch on the structure of data, and apply specific actions based on different forms of data.
pt_br: A correspondência de padrão estrutural foi adicionada na forma de uma *instrução de correspondência* e *instruções de caso* de padrões com ações associadas. Os padrões consistem em sequências, mapeamentos, tipos de dados primitivos, bem como instâncias de classe. A correspondência de padrão permite que os programas extraiam informações de tipos de dados complexos, ramifiquem na estrutura de dados e apliquem ações específicas com base em diferentes formas de dados.

source: Syntax and operations
pt_br: Sintaxe e operações

source: The generic syntax of pattern matching is::
pt_br: A sintaxe genérica da correspondência de padrão é::

source: match subject: case <pattern_1>: <action_1> case <pattern_2>: <action_2> case <pattern_3>: <action_3> case _: <action_wildcard>
pt_br: match sujeito: case <padrão_1>: <ação_1> case <padrão_2>: <ação_2> case <padrão_3>: <ação_3> case _: <ação_curinga>

source: A match statement takes an expression and compares its value to successive patterns given as one or more case blocks. Specifically, pattern matching operates by:
pt_br: Uma instrução de correspondência pega uma expressão e compara seu valor com padrões sucessivos fornecidos como um ou mais blocos de caso. Especificamente, a correspondência de padrões opera:

source: using data with type and shape (the ``subject``)
pt_br: usando dados com tipo e forma (o ``sujeito``)

source: evaluating the ``subject`` in the ``match`` statement
pt_br: avaliando o ``sujeito`` na instrução ``match``

source: comparing the subject with each pattern in a ``case`` statement from top to bottom until a match is confirmed.
pt_br: comparando o assunto com cada padrão em uma instrução ``case`` de cima para baixo até que uma correspondência seja confirmada.

source: executing the action associated with the pattern of the confirmed match
pt_br: executando a ação associada ao padrão da correspondência confirmada

source: If an exact match is not confirmed, the last case, a wildcard ``_``, if provided, will be used as the matching case. If an exact match is not confirmed and a wildcard case does not exist, the entire match block is a no-op.
pt_br: Se uma correspondência exata não for confirmada, no último caso, um curinga ``_``, se fornecido, será usado como o caso de correspondência. Se uma correspondência exata não for confirmada e não houver um caractere curinga, todo o bloco de correspondência será autônomo.

source: Declarative approach
pt_br: Abordagem declarativa

source: Readers may be aware of pattern matching through the simple example of matching a subject (data object) to a literal (pattern) with the switch statement found in C, Java or JavaScript (and many other languages). Often the switch statement is used for comparison of an object/expression with case statements containing literals.
pt_br: Os leitores podem estar cientes da correspondência de padrão por meio do exemplo simples de correspondência de um assunto (objeto de dados) a um literal (padrão) com a instrução switch encontrada em C, Java ou JavaScript (e muitas outras linguagens). Frequentemente, a instrução switch é usada para comparação de um objeto/expressão com instruções case contendo literais.

source: More powerful examples of pattern matching can be found in languages such as Scala and Elixir. With structural pattern matching, the approach is "declarative" and explicitly states the conditions (the patterns) for data to match.
pt_br: Exemplos mais poderosos de correspondência de padrão podem ser encontrados em linguagens como Scala e Elixir. Com a correspondência de padrão estrutural, a abordagem é "declarativa" e declara explicitamente as condições (os padrões) para que os dados correspondam.

source: While an "imperative" series of instructions using nested "if" statements could be used to accomplish something similar to structural pattern matching, it is less clear than the "declarative" approach. Instead the "declarative" approach states the conditions to meet for a match and is more readable through its explicit patterns. While structural pattern matching can be used in its simplest form comparing a variable to a literal in a case statement, its true value for Python lies in its handling of the subject's type and shape.
pt_br: Embora uma série "imperativa" de instruções usando instruções "if" aninhadas possa ser usada para realizar algo semelhante à correspondência de padrão estrutural, é menos clara do que a abordagem "declarativa". Em vez disso, a abordagem "declarativa" estabelece as condições a serem atendidas para uma correspondência e é mais legível por meio de seus padrões explícitos. Embora a correspondência de padrão estrutural possa ser usada em sua forma mais simples comparando uma variável a um literal em uma instrução case, seu verdadeiro valor para Python reside em seu tratamento do tipo e forma do sujeito.

source: Simple pattern: match to a literal
pt_br: Padrão simples: corresponder a um literal

source: Let's look at this example as pattern matching in its simplest form: a value, the subject, being matched to several literals, the patterns. In the example below, ``status`` is the subject of the match statement. The patterns are each of the case statements, where literals represent request status codes. The associated action to the case is executed after a match::
pt_br: Vejamos este exemplo como correspondência de padrão em sua forma mais simples: um valor, o assunto, sendo correspondido a vários literais, os padrões. No exemplo abaixo, ``status`` é o assunto da instrução de correspondência. Os padrões são cada uma das instruções de caso, onde literais representam códigos de status de solicitação. A ação associada ao caso é executada após uma partida:

source: If the above function is passed a ``status`` of 418, "I'm a teapot" is returned. If the above function is passed a ``status`` of 500, the case statement with ``_`` will match as a wildcard, and "Something's wrong with the internet" is returned. Note the last block: the variable name, ``_``, acts as a *wildcard* and insures the subject will always match. The use of ``_`` is optional.
pt_br: Se a função acima receber um ``status`` de 418, "I'm a teapot" será retornado. Se a função acima receber um ``status`` de 500, a instrução case com ``_`` irá corresponder a um curinga, e "Something's wrong with the Internet" é retornado. Observe o último bloco: o nome da variável, ``_``, atua como um *curinga* e garante que o assunto sempre corresponderá. O uso de ``_`` é opcional.

source: You can combine several literals in a single pattern using ``|`` ("or")::
pt_br: Você pode combinar vários literais em um único padrão usando ``|`` ("ou")::

source: case 401 | 403 | 404: return "Not allowed"
pt_br: case 401 | 403 | 404: return "Não permitido"

source: Behavior without the wildcard
pt_br: Comportamento sem o curinga

source: If we modify the above example by removing the last case block, the example becomes::
pt_br: Se modificarmos o exemplo acima removendo o último bloco case, o exemplo se tornará::
