Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: The deprecated :mod:`!mailcap` module now refuses to inject unsafe text (filenames, MIME types, parameters) into shell commands. Instead of using such text, it will warn and act as if a match was not found (or for test commands, as if the test failed). (Contributed by Petr Viktorin in :gh:`98966`.)
pt_br: O módulo descontinuado :mod:`!mailcap` agora se recusa a injetar texto não seguro (nomes de arquivos, tipos MIME, parâmetros) em comandos shell. Em vez de usar esse texto, ele avisará e agirá como se uma correspondência não fosse encontrada (ou para comandos de teste, como se o teste tivesse falhado). (Contribuição de Petr Viktorin em :gh:`98966`.)

source: Notable changes in 3.10.12
pt_br: Alterações notáveis no 3.10.12

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
pt_br: Os métodos de extração em :mod:`tarfile` e :func:`shutil.unpack_archive`, têm um novo argumento *filter* que permite limitar recursos do tar que podem ser surpreendentes ou perigosos, como criar arquivos fora do diretório de destino. Veja :ref:`tarfile-extraction-filter` para detalhes. No Python 3.12, usar sem o argumento *filter* mostrará um :exc:`DeprecationWarning`. No Python 3.14, o padrão mudará para ``'data'``. (Contribuição de Petr Viktorin em :pep:`706`.)
