Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: Without the use of ``_`` in a case statement, a match may not exist. If no match exists, the behavior is a no-op. For example, if ``status`` of 500 is passed, a no-op occurs.
pt_br: Sem o uso de ``_`` em uma instrução case, uma correspondência pode não existir. Se não houver correspondência, o comportamento é autônomo. Por exemplo, se o ``status`` de 500 for passado, ocorre um no-op.

source: Patterns with a literal and variable
pt_br: Padrões com uma literal e variável

source: Patterns can look like unpacking assignments, and a pattern may be used to bind variables. In this example, a data point can be unpacked to its x-coordinate and y-coordinate::
pt_br: Os padrões podem parecer atribuições de desempacotamento e um padrão pode ser usado para vincular variáveis. Neste exemplo, um ponto de dados pode ser desempacotado em sua coordenada x e coordenada y::

source: # point is an (x, y) tuple match point: case (0, 0): print("Origin") case (0, y): print(f"Y={y}") case (x, 0): print(f"X={x}") case (x, y): print(f"X={x}, Y={y}") case _: raise ValueError("Not a point")
pt_br: # ponto é uma tupla (x, y) match ponto: case (0, 0): print("Origem") case (0, y): print(f"Y={y}") case (x, 0): print(f"X={x}") case (x, y): print(f"X={x}, Y={y}") case _: raise ValueError("Não é um ponto")

source: The first pattern has two literals, ``(0, 0)``, and may be thought of as an extension of the literal pattern shown above. The next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
pt_br: O primeiro padrão tem dois literais, ``(0, 0)``, e pode ser considerado uma extensão do padrão literal mostrado acima. Os próximos dois padrões combinam um literal e uma variável, e a variável *vincula* um valor do assunto (``ponto``). O quarto padrão captura dois valores, o que o torna conceitualmente semelhante à atribuição de desempacotamento ``(x, y) = ponto``.

source: Patterns and classes
pt_br: Padrões e classes

source: If you are using classes to structure your data, you can use as a pattern the class name followed by an argument list resembling a constructor. This pattern has the ability to capture instance attributes into variables::
pt_br: Se estiver usando classes para estruturar seus dados, você pode usar como padrão o nome da classe seguido por uma lista de argumentos semelhante a um construtor. Este padrão tem a capacidade de capturar atributos da instância em variáveis::

source: class Point: def __init__(self, x, y): self.x = x self.y = y def location(point): match point: case Point(x=0, y=0): print("Origin is the point's location.") case Point(x=0, y=y): print(f"Y={y} and the point is on the y-axis.") case Point(x=x, y=0): print(f"X={x} and the point is on the x-axis.") case Point(): print("The point is located somewhere else on the plane.") case _: print("Not a point")
pt_br: class Point: def __init__(self, x, y): self.x = x self.y = y def location(point): match point: case Point(x=0, y=0): print("O ponto está na origem.") case Point(x=0, y=y): print(f "Y={y} e o ponto está no eixo y.") case Point(x=x, y=0): print(f "X={x} e o ponto está no eixo x.") case Point(): print("O ponto está localizado em outro lugar no plano.") case _: print("Não é um ponto")

source: Patterns with positional parameters
pt_br: Padrões com parâmetros posicionais

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
pt_br: Você pode usar parâmetros posicionais com algumas classes embutidas que fornecem uma ordem para seus atributos (por exemplo, classes de dados). Você também pode definir uma posição específica para atributos em padrões configurando o atributo especial ``__match_args__`` em suas classes. Se for definido como ("x", "y"), os seguintes padrões são todos equivalentes (e todos ligam o atributo ``y`` à variável ``var``)::

source: Point(1, var) Point(1, y=var) Point(x=1, y=var) Point(y=var, x=1)
pt_br: Ponto(1, var) Ponto(1, y=var) Ponto(x=1, y=var) Ponto(y=var, x=1)

source: Nested patterns
pt_br: Padrões aninhados

source: Patterns can be arbitrarily nested. For example, if our data is a short list of points, it could be matched like this::
pt_br: Os padrões podem ser aninhados arbitrariamente. Por exemplo, se nossos dados forem uma pequena lista de pontos, eles podem ser correspondidos assim::

source: match points: case []: print("No points in the list.") case [Point(0, 0)]: print("The origin is the only point in the list.") case [Point(x, y)]: print(f"A single point {x}, {y} is in the list.") case [Point(0, y1), Point(0, y2)]: print(f"Two points on the Y axis at {y1}, {y2} are in the list.") case _: print("Something else is found in the list.")
pt_br: match points: case []: print("Nenhum ponto na lista.") case [Point(0, 0)]: print("A origem é o único ponto na lista.") case [Point(x, y)]: print(f"Um único ponto {x}, {y} está na lista.") case [Point(0, y1), Point(0, y2)]: print(f"Dois pontos no eixo Y em {y1}, {y2} estão na lista.") case _: print("Algo diferente foi encontrado na lista.")

source: Complex patterns and the wildcard
pt_br: Padrões complexos e o curinga

source: To this point, the examples have used ``_`` alone in the last case statement. A wildcard can be used in more complex patterns, such as ``('error', code, _)``. For example::
pt_br: Até este ponto, os exemplos usaram ``_`` sozinho na última instrução case. Um curinga pode ser usado em padrões mais complexos, como ``('error', code, _)``. Por exemplo::

source: match test_variable: case ('warning', code, 40): print("A warning has been received.") case ('error', code, _): print(f"An error {code} occurred.")
pt_br: match test_variable: case ('warning', code, 40): print("Foi recebido um alerta.") case ('error', code, _): print(f"Ocorreu um erro {code}.")

source: In the above case, ``test_variable`` will match for ('error', code, 100) and ('error', code, 800).
pt_br: No caso acima, ``test_variable`` irá corresponder a ('erro', código, 100) e ('erro', código, 800).

source: Guard
pt_br: Guarda

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
pt_br: Podemos adicionar uma cláusula ``if`` a um padrão, conhecido como "guarda". Se a guarda for falsa, ``match`` tenta o próximo bloco de caso. Observe que a captura de valor ocorre antes que a guarda seja avaliada::

source: match point: case Point(x, y) if x == y: print(f"The point is located on the diagonal Y=X at {x}.") case Point(x, y): print(f"Point is not on the diagonal.")
pt_br: match point: case Point(x, y) if x == y: print(f"O ponto está localizado em uma diagonal Y=X at {x}.") case Point(x, y): print(f"Ponto não está na diagonal.")

source: Other Key Features
pt_br: Outros recursos-chave

source: Several other key features:
pt_br: Vários outros recursos-chave:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. Technically, the subject must be a sequence. Therefore, an important exception is that patterns don't match iterators. Also, to prevent a common mistake, sequence patterns don't match strings.
pt_br: Assim como desempacotar atribuições, os padrões de tupla e lista têm exatamente o mesmo significado e realmente correspondem a sequências arbitrárias. Tecnicamente, o sujeito deve ser uma sequência. Portanto, uma exceção importante é que padrões não correspondem a iteradores. Também evita um erro comum, sequência de padrões não correspondem a strings.

source: Sequence patterns support wildcards: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to wildcards in unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
pt_br: Os padrões de sequência têm suporte a curingas: ``[x, y, *rest]`` e ``(x, y, *rest)`` funcionam de forma semelhante a curingas em desempacotamentos de atribuições. O nome depois de ``*`` também pode ser ``_``, então ``(x, y, *_)`` corresponde a uma sequência de pelo menos dois itens sem ligar os itens restantes.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dict. Unlike sequence patterns, extra keys are ignored. A wildcard ``**rest`` is also supported. (But ``**_`` would be redundant, so is not allowed.)
pt_br: Padrões de mapeamento: ``{"bandwidth": b, "latency": l}`` captura os valores ``"bandwidth"`` e ``"latency"`` de um dicionário. Diferente dos padrões de sequência, chaves extra são ignoradas. Um curinga ``**rest`` também é permitido. (Mas ``**_`` seria redundante, então não é permitido.)

source: Subpatterns may be captured using the ``as`` keyword::
pt_br: Subpadrões podem ser capturados usando a palavra reservada ``as`` ::

source: case (Point(x1, y1), Point(x2, y2) as p2): ...
pt_br: case (Ponto(x1, y1), Ponto(x2, y2) as p2): ...

source: This binds x1, y1, x2, y2 like you would expect without the ``as`` clause, and p2 to the entire second item of the subject.
pt_br: Isso liga x1, y1, x2, y2 como você esperaria sem a cláusula ``as`` e p2 a todo o segundo item do sujeito.

source: Most literals are compared by equality. However, the singletons ``True``, ``False`` and ``None`` are compared by identity.
pt_br: A maioria dos literais são comparados por igualdade. No entanto, os singletons ``True``, ``False`` e ``None`` são comparados por identidade.

source: Named constants may be used in patterns. These named constants must be dotted names to prevent the constant from being interpreted as a capture variable::
pt_br: Constantes nomeadas podem ser usadas em padrões. Essas constantes nomeadas devem ser nomes pontilhados para evitar que a constante seja interpretada como uma variável de captura::

source: from enum import Enum class Color(Enum): RED = 0 GREEN = 1 BLUE = 2 color = Color.GREEN match color: case Color.RED: print("I see red!") case Color.GREEN: print("Grass is green") case Color.BLUE: print("I'm feeling the blues :(")
pt_br: from enum import Enum class Color(Enum): RED = 0 GREEN = 1 BLUE = 2 color = Color.GREEN match color: case Color.RED: print("Eu vejo vermelho!") case Color.GREEN: print("A grama é verde") case Color.BLUE: print("Eu azul de fome :(")

source: For the full specification see :pep:`634`. Motivation and rationale are in :pep:`635`, and a longer tutorial is in :pep:`636`.
pt_br: Para obter as especificações completas, consulte a :pep:`634`. A motivação e o raciocínio estão na :pep:`635`, e um tutorial mais longo está na :pep:`636`.

source: Optional ``EncodingWarning`` and ``encoding="locale"`` option
pt_br: ``EncodingWarning`` opcional e opção ``encoding="locale"``

source: The default encoding of :class:`~io.TextIOWrapper` and :func:`open` is platform and locale dependent. Since UTF-8 is used on most Unix platforms, omitting ``encoding`` option when opening UTF-8 files (e.g. JSON, YAML, TOML, Markdown) is a very common bug. For example::
pt_br: A codificação padrão de :class:`~io.TextIOWrapper` e :func:`open` depende da plataforma e da localidade. Como o UTF-8 é usado na maioria das plataformas Unix, omitir a opção ``encoding`` ao abrir arquivos UTF-8 (por exemplo, JSON, YAML, TOML, Markdown) é um bug muito comum. Por exemplo::

source: # BUG: "rb" mode or encoding="utf-8" should be used. with open("data.json") as f: data = json.load(f)
pt_br: # BUG: mode "rb" ou encoding="utf-8" deve ser usado. with open("data.json") as f: data = json.load(f)

source: To find this type of bug, an optional ``EncodingWarning`` is added. It is emitted when :data:`sys.flags.warn_default_encoding <sys.flags>` is true and locale-specific default encoding is used.
pt_br: Para encontrar este tipo de bug, uma ``EncodingWarning`` opcional é adicionada. É emitido quando :data:`sys.flags.warn_default_encoding <sys.flags>` é verdadeiro e a codificação padrão específica da localidade é usada.

source: ``-X warn_default_encoding`` option and :envvar:`PYTHONWARNDEFAULTENCODING` are added to enable the warning.
pt_br: A opção ``-X warn_default_encoding`` e :envvar:`PYTHONWARNDEFAULTENCODING` são adicionadas para ativar o aviso.

source: See :ref:`io-text-encoding` for more information.
pt_br: Veja :ref:`io-text-encoding` para mais informações.

source: New Features Related to Type Hints
pt_br: Novos recursos relacionados a dicas de tipo

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
pt_br: Esta seção cobre as principais mudanças que afetam as dicas de tipo da :pep:`484` e o módulo :mod:`typing`.

source: PEP 604: New Type Union Operator
pt_br: PEP 604: novo operador de união de tipo

source: A new type union operator was introduced which enables the syntax ``X | Y``. This provides a cleaner way of expressing 'either type X or type Y' instead of using :class:`typing.Union`, especially in type hints.
pt_br: Um novo operador de união de tipo foi introduzido, o que permite a sintaxe ``X | Y``. Isso fornece uma maneira mais limpa de expressar "tanto o tipo X quanto o tipo Y" ao invés de usar :class:`typing.Union`, especialmente em dicas de tipo.

source: In previous versions of Python, to apply a type hint for functions accepting arguments of multiple types, :class:`typing.Union` was used::
pt_br: Nas versões anteriores do Python, para aplicar uma dica de tipo para funções que aceitam argumentos de vários tipos, era usado :class:`typing.Union`::

source: Type hints can now be written in a more succinct manner::
pt_br: As dicas de tipo agora podem ser escritas de uma maneira mais sucinta::

source: This new syntax is also accepted as the second argument to :func:`isinstance` and :func:`issubclass`::
pt_br: Esta nova sintaxe também é aceita como o segundo argumento para :func:`isinstance` e :func:`issubclass`::

source: See :ref:`types-union` and :pep:`604` for more details.
pt_br: Veja :ref:`types-union` e :pep:`604` para mais detalhes.

source: (Contributed by Maggie Moss and Philippe Prados in :issue:`41428`, with additions by Yurii Karabas and Serhiy Storchaka in :issue:`44490`.)
pt_br: (Contribuição de Maggie Moss e Philippe Prados em :issue:`41428`, com acréscimos por Yurii Karabas e Serhiy Storchaka em :issue:`44490`.)

source: PEP 612: Parameter Specification Variables
pt_br: PEP 612: variáveis de especificação de parâmetros

source: Two new options to improve the information provided to static type checkers for :pep:`484`\ 's ``Callable`` have been added to the :mod:`typing` module.
pt_br: Duas novas opções para melhorar as informações fornecidas para verificadores de tipo estático para ``Callable`` da :pep:`484` foram adicionadas ao módulo :mod:`typing`.

source: The first is the parameter specification variable. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. Examples of usage can be found in :class:`typing.ParamSpec`. Previously, there was no easy way to type annotate dependency of parameter types in such a precise manner.
pt_br: A primeira é a variável de especificação de parâmetro. Eles são usados para encaminhar os tipos de parâmetro de um chamável para outro chamável -- um padrão comumente encontrado em funções de ordem superior e decoradores. Exemplos de uso podem ser encontrados em :class:`typing.ParamSpec`. Anteriormente, não havia uma maneira fácil de digitar a dependência de anotação de tipos de parâmetro de maneira tão precisa.

source: The second option is the new ``Concatenate`` operator. It's used in conjunction with parameter specification variables to type annotate a higher order callable which adds or removes parameters of another callable. Examples of usage can be found in :class:`typing.Concatenate`.
pt_br: A segunda opção é o novo operador ``Concatenate``. É usado em conjunto com variáveis de especificação de parâmetro para digitar anotar um chamável de ordem superior que adiciona ou remove parâmetros de outro chamável. Exemplos de uso podem ser encontrados em :class:`typing.Concatenate`.

source: See :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs`, and :pep:`612` for more details.
pt_br: Veja :class:`typing.Callable`, :class:`typing.ParamSpec`, :class:`typing.Concatenate`, :class:`typing.ParamSpecArgs`, :class:`typing.ParamSpecKwargs` e :pep:`612` para mais detalhes.

source: (Contributed by Ken Jin in :issue:`41559`, with minor enhancements by Jelle Zijlstra in :issue:`43783`. PEP written by Mark Mendoza.)
pt_br: (Contribuição de Ken Jin em :issue:`41559`, com pequenas melhorias por Jelle Zijlstra em :issue:`43783`. PEP escrita por Mark Mendoza.)

source: :pep:`484` introduced the concept of type aliases, only requiring them to be top-level unannotated assignments. This simplicity sometimes made it difficult for type checkers to distinguish between type aliases and ordinary assignments, especially when forward references or invalid types were involved. Compare::
pt_br: :pep:`484` introduziu o conceito de apelidos de tipo, exigindo apenas que fossem atribuições não anotadas de nível superior. Essa simplicidade às vezes tornava difícil para os verificadores de tipo distinguirem entre apelidos de tipo e atribuições comuns, especialmente quando referências diretas ou tipos inválidos estavam envolvidos. Compare::

source: StrCache = 'Cache[str]' # a type alias LOG_PREFIX = 'LOG[DEBUG]' # a module constant
pt_br: StrCache = 'Cache[str]' # um apelido de tipo LOG_PREFIX = 'LOG[DEBUG]' # uma constante do módulo

source: Now the :mod:`typing` module has a special value :data:`~typing.TypeAlias` which lets you declare type aliases more explicitly::
pt_br: Agora o módulo :mod:`typing` tem um valor especial :data:`~typing.TypeAlias` que permite declarar apelidos de tipo, mais explicitamente::

source: StrCache: TypeAlias = 'Cache[str]' # a type alias LOG_PREFIX = 'LOG[DEBUG]' # a module constant
pt_br: StrCache: TypeAlias = 'Cache[str]' # um apelido de tipo LOG_PREFIX = 'LOG[DEBUG]' # uma constante do módulo

source: See :pep:`613` for more details.
pt_br: Veja :pep:`613` para mais detalhes.

source: (Contributed by Mikhail Golubev in :issue:`41923`.)
pt_br: (Contribuição de Mikhail Golubev em :issue:`41923`.)

source: PEP 647: User-Defined Type Guards
pt_br: PEP 647: guardas de tipo definidas pelo usuário

source: :data:`~typing.TypeGuard` has been added to the :mod:`typing` module to annotate type guard functions and improve information provided to static type checkers during type narrowing. For more information, please see :data:`~typing.TypeGuard`\ 's documentation, and :pep:`647`.
pt_br: :data:`~typing.TypeGuard` foi adicionado ao módulo :mod:`typing` para anotar funções de guarda de tipo e melhorar informações fornecidas a verificadores de tipo estático durante um estreitamento de tipo. Para mais informações, veja a documentação do :data:`~typing.TypeGuard` e a :pep:`647`.

source: (Contributed by Ken Jin and Guido van Rossum in :issue:`43766`. PEP written by Eric Traut.)
pt_br: (Contribuição de Ken Jin e Guido van Rossum em :issue:`43766`. PEP escrita por Eric Traut.)

source: Other Language Changes
pt_br: Outras mudanças na linguagem

source: The :class:`int` type has a new method :meth:`int.bit_count`, returning the number of ones in the binary expansion of a given integer, also known as the population count. (Contributed by Niklas Fiekas in :issue:`29882`.)
pt_br: O tipo :class:`int` tem um novo método :meth:`int.bit_count`, retornando o número de unidades na expansão binária de um dado inteiro, também conhecido como contagem da população. (Contribuição de Niklas Fiekas em :issue:`29882`.)

source: The views returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` now all have a ``mapping`` attribute that gives a :class:`types.MappingProxyType` object wrapping the original dictionary. (Contributed by Dennis Sweeney in :issue:`40890`.)
pt_br: As visualizações retornadas por :meth:`dict.keys`, :meth:`dict.values` e :meth:`dict.items` agora têm um atributo ``mapping`` que fornece um objeto :class:`types.MappingProxyType` que envolve o dicionário original. (Contribuição de Dennis Sweeney em :issue:`40890`.)

source: :pep:`618`: The :func:`zip` function now has an optional ``strict`` flag, used to require that all the iterables have an equal length.
pt_br: :pep:`618`: A função :func:`zip` agora tem um sinalizador opcional ``strict``, usado para exigir que todos os iteráveis tenham um comprimento igual.

source: Builtin and extension functions that take integer arguments no longer accept :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). (Contributed by Serhiy Storchaka in :issue:`37999`.)
pt_br: Funções embutidas e de extensão que recebem argumentos inteiros não aceitam mais :class:`~decimal.Decimal`, :class:`~fractions.Fraction` e outros objetos que podem ser convertidos em inteiros apenas com uma perda (por exemplo, tem o método :meth:`~object.__int__`, mas não tem o método :meth:`~object.__index__`). (Contribuição de Serhiy Storchaka em :issue:`37999`.)

source: If :func:`object.__ipow__` returns :data:`NotImplemented`, the operator will correctly fall back to :func:`object.__pow__` and :func:`object.__rpow__` as expected. (Contributed by Alex Shkop in :issue:`38302`.)
pt_br: Se :func:`object.__ipow__` retorna :data:`NotImplemented`, o operador vai corretamente recorrer ao :func:`object.__pow__` e :func:`object.__rpow__` como esperado. (Contribuição de Alex Shkop em :issue:`38302`.)

source: Assignment expressions can now be used unparenthesized within set literals and set comprehensions, as well as in sequence indexes (but not slices).
pt_br: Expressões de atribuição agora podem ser usadas sem parênteses dentro de literais de conjuntos e compreensões de conjuntos, bem como em índices de sequência (mas não em fatias).

source: Functions have a new ``__builtins__`` attribute which is used to look for builtin symbols when a function is executed, instead of looking into ``__globals__['__builtins__']``. The attribute is initialized from ``__globals__["__builtins__"]`` if it exists, else from the current builtins. (Contributed by Mark Shannon in :issue:`42990`.)
pt_br: As funções têm um novo atributo ``__builtins__`` que é usado para procurar por símbolos embutidos quando uma função é executada, em vez de procurar em ``__globals__['__builtins__']``. O atributo é inicializado a partir de ``__globals__["__builtins__"]`` se existir; do contrário, a partir dos embutidos atuais. (Contribuição de Mark Shannon em :issue:`42990`.)

source: Two new builtin functions -- :func:`aiter` and :func:`anext` have been added to provide asynchronous counterparts to :func:`iter` and :func:`next`, respectively. (Contributed by Joshua Bronson, Daniel Pope, and Justin Wang in :issue:`31861`.)
pt_br: Duas novas funções embutidas -- :func:`aiter` e :func:`anext` foram adicionadas para fornecer contrapartes assíncronas para :func:`iter` e :func:`next`, respectivamente. (Contribuição de Joshua Bronson, Daniel Pope e Justin Wang em :issue:`31861`.)
