Repository: python/python-docs-pt-br
Catalog: whatsnew/3.10.po
Languages: pt_br

source: Include prompts when saving Shell with inputs and outputs. (Contributed by Terry Jan Reedy in :gh:`95191`.)
pt_br: Inclui prompts ao salvar o console com entradas e saídas. (Contribuição de Terry Jan Reedy em :gh:`95191`.)

source: Feature parity with ``importlib_metadata`` 4.6 (`history <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).
pt_br: Paridade de recursos com ``importlib_metadata`` 4.6 (`histórico <https://importlib-metadata.readthedocs.io/en/latest/history.html>`_).

source: :ref:`importlib.metadata entry points <entry-points>` now provide a nicer experience for selecting entry points by group and name through a new :ref:`importlib.metadata.EntryPoints <entry-points>` class. See the Compatibility Note in the docs for more info on the deprecation and usage.
pt_br: :ref:`Pontos de entrada importlib.metadata <entry-points>` agora oferecem uma experiência melhor para selecionar pontos de entrada por grupo e nome através do novo :ref:`importlib.metadata.EntryPoints <entry-points>`. Consulte a Nota de Compatibilidade nos documentos para obter mais informações sobre a descontinuação e uso.

source: Added :ref:`importlib.metadata.packages_distributions() <package-distributions>` for resolving top-level Python modules and packages to their :ref:`importlib.metadata.Distribution <distributions>`.
pt_br: Adicionada :ref:`importlib.metadata.packages_distributions() <package-distributions>` para resolver módulos e pacotes Python de alto nível com suas :ref:`importlib.metadata.Distribution <distributions>`.

source: Add :func:`inspect.get_annotations`, which safely computes the annotations defined on an object. It works around the quirks of accessing the annotations on various types of objects, and makes very few assumptions about the object it examines. :func:`inspect.get_annotations` can also correctly un-stringize stringized annotations. :func:`inspect.get_annotations` is now considered best practice for accessing the annotations dict defined on any Python object; for more information on best practices for working with annotations, please see :ref:`annotations-howto`. Relatedly, :func:`inspect.signature`, :func:`inspect.Signature.from_callable`, and :func:`!inspect.Signature.from_function` now call :func:`inspect.get_annotations` to retrieve annotations. This means :func:`inspect.signature` and :func:`inspect.Signature.from_callable` can also now un-stringize stringized annotations. (Contributed by Larry Hastings in :issue:`43817`.)
pt_br: Adiciona :func:`inspect.get_annotations`, que calcula com segurança as anotações definidas em um objeto. Ele contorna as peculiaridades de acessar as anotações em vários tipos de objetos e faz poucas suposições sobre o objeto que examina. :func:`inspect.get_annotations` também pode desfazer a string corretamente de anotações em string. :func:`inspect.get_annotations` agora é considerada a melhor prática para acessar o dict de anotações definido em qualquer objeto Python; para mais informações sobre as melhores práticas para trabalhar com anotações, consulte :ref:`annotations-howto`. Da mesma forma, :func:`inspect.signature`, :func:`inspect.Signature.from_callable` e :func:`!inspect.Signature.from_function` agora chamam :func:`inspect.get_annotations` para recuperar anotações. Isso significa que :func:`inspect.signature` e :func:`inspect.Signature.from_callable` agora também podem remover a string de anotações em string. (Contribuição de Larry Hastings em :issue:`43817`.)

source: Add :func:`itertools.pairwise`. (Contributed by Raymond Hettinger in :issue:`38200`.)
pt_br: Adiciona :func:`itertools.pairwise`. (Contribuição de Raymond Hettinger em :issue:`38200`.)

source: Add :func:`os.cpu_count` support for VxWorks RTOS. (Contributed by Peixing Xin in :issue:`41440`.)
pt_br: Adiciona suporte a :func:`os.cpu_count` para RTOS de VxWorks. (Contribuição de Peixing Xin em :issue:`41440`.)

source: Add a new function :func:`os.eventfd` and related helpers to wrap the ``eventfd2`` syscall on Linux. (Contributed by Christian Heimes in :issue:`41001`.)
pt_br: Adiciona uma nova função :func:`os.eventfd` e auxiliares relacionados para envolver a chamada de sistema ``eventfd2`` no Linux. (Contribuição de Christian Heimes em :issue:`41001`.)

source: Add :func:`os.splice` that allows to move data between two file descriptors without copying between kernel address space and user address space, where one of the file descriptors must refer to a pipe. (Contributed by Pablo Galindo in :issue:`41625`.)
pt_br: Adiciona :func:`os.splice` que permite mover dados entre dois descritores de arquivo sem copiar entre o espaço de endereço do kernel e o espaço de endereço do usuário, onde um dos descritores de arquivo deve se referir a um encadeamento (pipe). (Contribuição de Pablo Galindo em :issue:`41625`.)

source: Add :const:`~os.O_EVTONLY`, :const:`~os.O_FSYNC`, :const:`~os.O_SYMLINK` and :const:`~os.O_NOFOLLOW_ANY` for macOS. (Contributed by Donghee Na in :issue:`43106`.)
pt_br: Adiciona :const:`~os.O_EVTONLY`, :const:`~os.O_FSYNC`, :const:`~os.O_SYMLINK` e :const:`~os.O_NOFOLLOW_ANY` para macOS. (Contribuição de Donghee Na em :issue:`43106`.)

source: :func:`os.path.realpath` now accepts a *strict* keyword-only argument. When set to ``True``, :exc:`OSError` is raised if a path doesn't exist or a symlink loop is encountered. (Contributed by Barney Gale in :issue:`43757`.)
pt_br: :func:`os.path.realpath` agora aceita um argumento somente-nomeado *strict*. Quando definido como ``True``, a exceção :exc:`OSError` é levantada se um caminho não existe ou um loop de link simbólico é encontrado. (Contribuição de Barney Gale em :issue:`43757`.)

source: Add slice support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Joshua Cannon in :issue:`35498`.)
pt_br: Adiciona suporte a fatiamento a :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contribuição de Joshua Cannon em :issue:`35498`.)

source: Add negative indexing support to :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contributed by Yaroslav Pankovych in :issue:`21041`.)
pt_br: Adiciona suporte a indexação negativa a :attr:`PurePath.parents <pathlib.PurePath.parents>`. (Contribuição de Yaroslav Pankovych em :issue:`21041`.)

source: Add :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>` method that supersedes :meth:`!link_to`. The new method has the same argument order as :meth:`~pathlib.Path.symlink_to`. (Contributed by Barney Gale in :issue:`39950`.)
pt_br: Adiciona o método :meth:`Path.hardlink_to <pathlib.Path.hardlink_to>` que substitui :meth:`!link_to`. O novo método tem a mesma ordem de argumentos que :meth:`~pathlib.Path.symlink_to`. (Contribuição de Barney Gale em :issue:`39950`.)

source: :meth:`pathlib.Path.stat` and :meth:`~pathlib.Path.chmod` now accept a *follow_symlinks* keyword-only argument for consistency with corresponding functions in the :mod:`os` module. (Contributed by Barney Gale in :issue:`39906`.)
pt_br: :meth:`pathlib.Path.stat` e :meth:`~pathlib.Path.chmod` agora aceita um argumento somente-nomeado *follow_symlinks* para consistência com as funções correspondentes no módulo :mod:`os`. (Contribuição de Barney Gale em :issue:`39906`.)

source: Add :func:`platform.freedesktop_os_release` to retrieve operation system identification from `freedesktop.org os-release <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ standard file. (Contributed by Christian Heimes in :issue:`28468`.)
pt_br: Adiciona :func:`platform.freedesktop_os_release` para obter a identificação do sistema operacional a partir do arquivo padrão `os-release do freedesktop.org <https://www.freedesktop.org/software/systemd/man/os-release.html>`_. (Contribuição de Christian Heimes em :issue:`28468`.)

source: :func:`pprint.pprint` now accepts a new ``underscore_numbers`` keyword argument. (Contributed by sblondon in :issue:`42914`.)
pt_br: :func:`pprint.pprint` agora aceita um novo argumento nomeado ``underscore_numbers``. (Contribuição de sblondon em :issue:`42914`.)

source: :mod:`pprint` can now pretty-print :class:`dataclasses.dataclass` instances. (Contributed by Lewis Gaul in :issue:`43080`.)
pt_br: :mod:`pprint` agora pode fazer impressão bonita de instâncias de :class:`dataclasses.dataclass`. (Contribuição de Lewis Gaul em :issue:`43080`.)

source: Add ``--quiet`` option to command-line interface of :mod:`py_compile`. (Contributed by Gregory Schevchenko in :issue:`38731`.)
pt_br: Adiciona a opção ``--quiet`` à interface de linha de comando de :mod:`py_compile`. (Contribuição de Gregory Schevchenko em :issue:`38731`.)

source: Add an ``end_lineno`` attribute to the ``Function`` and ``Class`` objects in the tree returned by :func:`pyclbr.readmodule` and :func:`pyclbr.readmodule_ex`. It matches the existing (start) ``lineno``. (Contributed by Aviral Srivastava in :issue:`38307`.)
pt_br: Adiciona um atributo ``end_lineno`` aos objetos ``Function`` e ``Class`` na árvore retornada por :func:`pyclbr.readmodule` e :func:`pyclbr.readmodule_ex`. Isso corresponde ao ``lineno`` (início) existente. (Contribuição de Aviral Srivastava em :issue:`38307`.)

source: The :mod:`shelve` module now uses :const:`pickle.DEFAULT_PROTOCOL` by default instead of :mod:`pickle` protocol ``3`` when creating shelves. (Contributed by Zackery Spytz in :issue:`34204`.)
pt_br: O módulo :mod:`shelve` agora usa :const:`pickle.DEFAULT_PROTOCOL` por padrão em vez do protocolo ``3`` do :mod:`pickle` ao criar "shelves". (Contribuição de Zackery Spytz em :issue:`34204`.)

source: Add :func:`~statistics.covariance`, Pearson's :func:`~statistics.correlation`, and simple :func:`~statistics.linear_regression` functions. (Contributed by Tymoteusz Wołodźko in :issue:`38490`.)
pt_br: Adiciona :func:`~statistics.covariance`, :func:`~statistics.correlation` do Pearson, e funções simples :func:`~statistics.linear_regression`. (Contribuição de Tymoteusz Wołodźko em :issue:`38490`.)

source: The exception :exc:`socket.timeout` is now an alias of :exc:`TimeoutError`. (Contributed by Christian Heimes in :issue:`42413`.)
pt_br: A exceção :exc:`socket.timeout` é agora um apelido de :exc:`TimeoutError`. (Contribuição de Christian Heimes em :issue:`42413`.)

source: Add option to create MPTCP sockets with ``IPPROTO_MPTCP`` (Contributed by Rui Cunha in :issue:`43571`.)
pt_br: Adiciona a opção de criar soquetes MPTCP com ``IPPROTO_MPTCP`` (Contribuição de Rui Cunha em :issue:`43571`.)

source: Add ``IP_RECVTOS`` option to receive the type of service (ToS) or DSCP/ECN fields (Contributed by Georg Sauthoff in :issue:`44077`.)
pt_br: Adiciona a opção ``IP_RECVTOS`` para receber o tipo do serviço (ToS) ou campos DSCP/ECN (Contribuição de Georg Sauthoff em :issue:`44077`.)

source: The ssl module requires OpenSSL 1.1.1 or newer. (Contributed by Christian Heimes in :pep:`644` and :issue:`43669`.)
pt_br: O módulo ssl requer OpenSSL 1.1.1 ou mais recente. (Contribuição de Christian Heimes em :pep:`644` e :issue:`43669`.)

source: The ssl module has preliminary support for OpenSSL 3.0.0 and new option :const:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Contributed by Christian Heimes in :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue:`43789`, and :issue:`43811`.)
pt_br: O módulo ssl tem um suporte preliminar para OpenSSL 3.0.0 e a nova opção :const:`~ssl.OP_IGNORE_UNEXPECTED_EOF`. (Contribuição de Christian Heimes em :issue:`38820`, :issue:`43794`, :issue:`43788`, :issue:`43791`, :issue:`43799`, :issue:`43920`, :issue:`43789` e :issue:`43811`.)

source: Deprecated function and use of deprecated constants now result in a :exc:`DeprecationWarning`. :attr:`ssl.SSLContext.options` has :data:`~ssl.OP_NO_SSLv2` and :data:`~ssl.OP_NO_SSLv3` set by default and therefore cannot warn about setting the flag again. The :ref:`deprecation section <whatsnew310-deprecated>` has a list of deprecated features. (Contributed by Christian Heimes in :issue:`43880`.)
pt_br: Função descontinuada e o uso de constantes descontinuadas agora resultam em uma :exc:`DeprecationWarning`. :attr:`ssl.SSLContext.options` tem :data:`~ssl.OP_NO_SSLv2` e :data:`~ssl.OP_NO_SSLv3` definidos por padrão e, portanto, não consegue avisar sobre a definição do sinalizador novamente. A :ref:`seção de descontinuidade <whatsnew310-deprecated>` tem uma lista de recursos descontinuados. (Contribuição de Christian Heimes em :issue:`43880`.)

source: The ssl module now has more secure default settings. Ciphers without forward secrecy or SHA-1 MAC are disabled by default. Security level 2 prohibits weak RSA, DH, and ECC keys with less than 112 bits of security. :class:`~ssl.SSLContext` defaults to minimum protocol version TLS 1.2. Settings are based on Hynek Schlawack's research. (Contributed by Christian Heimes in :issue:`43998`.)
pt_br: O módulo ssl agora tem configurações padrão mais seguras. Cifras sem *forward secrecy* ou SHA-1 MAC são desabilitadas por padrão. O nível de segurança 2 proíbe chaves fracas RSA, DH e ECC com menos de 112 bits de segurança. :class:`~ssl.SSLContext` assume como padrão a versão mínima do protocolo TLS 1.2. As configurações são baseadas na pesquisa de Hynek Schlawack. (Contribuição de Christian Heimes em :issue:`43998`.)

source: The deprecated protocols SSL 3.0, TLS 1.0, and TLS 1.1 are no longer officially supported. Python does not block them actively. However OpenSSL build options, distro configurations, vendor patches, and cipher suites may prevent a successful handshake.
pt_br: Os protocolos descontinuados SSL 3.0, TLS 1.0 e TLS 1.1 não são mais oficialmente suportados. Python não os bloqueia ativamente. No entanto, as opções de compilação do OpenSSL, configurações de distro, patches de fornecedores e suítes de criptografia podem impedir um handshake bem-sucedido.

source: Add a *timeout* parameter to the :func:`ssl.get_server_certificate` function. (Contributed by Zackery Spytz in :issue:`31870`.)
pt_br: Adiciona um parâmetro *timeout* à função :func:`ssl.get_server_certificate`. (Contribuição de Zackery Spytz em :issue:`31870`.)

source: The ssl module uses heap-types and multi-phase initialization. (Contributed by Christian Heimes in :issue:`42333`.)
pt_br: O módulo ssl usa tipos de heap e inicialização multifásica. (Contribuição de Christian Heimes em :issue:`42333`.)

source: A new verify flag :const:`~ssl.VERIFY_X509_PARTIAL_CHAIN` has been added. (Contributed by l0x in :issue:`40849`.)
pt_br: Uma nova sinalização de verificação :const:`~ssl.VERIFY_X509_PARTIAL_CHAIN` foi adicionada. (Contribuição de l0x em :issue:`40849`.)

source: Add audit events for :func:`~sqlite3.connect`, :meth:`~sqlite3.Connection.enable_load_extension`, and :meth:`~sqlite3.Connection.load_extension`. (Contributed by Erlend E. Aasland in :issue:`43762`.)
pt_br: Adiciona eventos de auditoria para :func:`~sqlite3.connect`, :meth:`~sqlite3.Connection.enable_load_extension` e :meth:`~sqlite3.Connection.load_extension`. (Contribuição de Erlend E. Aasland em :issue:`43762`.)

source: Add :data:`sys.orig_argv` attribute: the list of the original command line arguments passed to the Python executable. (Contributed by Victor Stinner in :issue:`23427`.)
pt_br: Adiciona o atributo :data:`sys.orig_argv`: a lista de argumentos de linha de comando originais passada para o executável Python. (Contribuição de Victor Stinner em :issue:`23427`.)

source: Add :data:`sys.stdlib_module_names`, containing the list of the standard library module names. (Contributed by Victor Stinner in :issue:`42955`.)
pt_br: Adiciona :data:`sys.stdlib_module_names`, contendo a lista de nomes de módulos da biblioteca padrão. (Contribuição de Victor Stinner em :issue:`42955`.)

source: :func:`_thread.interrupt_main` now takes an optional signal number to simulate (the default is still :const:`signal.SIGINT`). (Contributed by Antoine Pitrou in :issue:`43356`.)
pt_br: :func:`_thread.interrupt_main` agora aceita um número de sinal opcional para simular (o padrão ainda é :const:`signal.SIGINT`). (Contribuição de Antoine Pitrou em :issue:`43356`.)

source: Add :func:`threading.gettrace` and :func:`threading.getprofile` to retrieve the functions set by :func:`threading.settrace` and :func:`threading.setprofile` respectively. (Contributed by Mario Corchero in :issue:`42251`.)
pt_br: Adiciona :func:`threading.gettrace` e :func:`threading.getprofile` para obter as funções definidas por :func:`threading.settrace` e :func:`threading.setprofile`, respectivamente. (Contribuição de Mario Corchero em :issue:`42251`.)

source: Add :data:`threading.__excepthook__` to allow retrieving the original value of :func:`threading.excepthook` in case it is set to a broken or a different value. (Contributed by Mario Corchero in :issue:`42308`.)
pt_br: Adiciona :data:`threading.__excepthook__` para permitir obtenção do valor original de :func:`threading.excepthook` no caso dele estar definido com um valor quebrado ou diferente. (Contribuição de Mario Corchero em :issue:`42308`.)

source: The :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only`, and :func:`~traceback.print_exception` functions can now take an exception object as a positional-only argument. (Contributed by Zackery Spytz and Matthias Bussonnier in :issue:`26389`.)
pt_br: As funções :func:`~traceback.format_exception`, :func:`~traceback.format_exception_only` e :func:`~traceback.print_exception` podem agora receber um objeto exceção como um argumento somente-posicional. (Contribuição de Zackery Spytz e Matthias Bussonnier em :issue:`26389`.)

source: Reintroduce the :data:`types.EllipsisType`, :data:`types.NoneType` and :data:`types.NotImplementedType` classes, providing a new set of types readily interpretable by type checkers. (Contributed by Bas van Beek in :issue:`41810`.)
pt_br: Reintroduz as classes :data:`types.EllipsisType`, :data:`types.NoneType` e :data:`types.NotImplementedType`, fornecendo um novo conjunto de tipos prontamente interpretáveis pelos verificadores de tipo. (Contribuição de Bas van Beek em :issue:`41810`.)

source: For major changes, see :ref:`new-feat-related-type-hints`.
pt_br: Para alterações principais, veja :ref:`new-feat-related-type-hints`.

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
pt_br: O comportamento de :class:`typing.Literal` foi alterado para ficar em conformidade com a :pep:`586` e para corresponder ao comportamento de verificadores de tipo estático especificados na PEP.

source: ``Literal`` now de-duplicates parameters.
pt_br: ``Literal`` agora elimina a duplicação de parâmetros.

source: Equality comparisons between ``Literal`` objects are now order independent.
pt_br: Comparações de igualdade entre objetos ``Literal`` agora são independentes da ordem.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
pt_br: Comparações de ``Literal`` agora respeitam os tipos. Por exemplo, ``Literal[0] == Literal[False]`` avaliava anteriormente como ``True``. Agora é ``False``. Para oferecer suporte a essa mudança, o cache de tipo usado internamente agora oferece suporte a tipos de diferenciação.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with unhashable parameters will not throw an error::
pt_br: Objetos ``Literal`` agora irão levantar uma exceção :exc:`TypeError` durante as comparações de igualdade se algum de seus parâmetros não for :term:`hasheáveis <hasheável>`. Observe que declarar ``Literal`` com parâmetros inalteráveis não acusará um erro::

source: (Contributed by Yurii Karabas in :issue:`42345`.)
pt_br: (Contribuição de Yurii Karabas em :issue:`42345`.)

source: Add new function :func:`typing.is_typeddict` to introspect if an annotation is a :class:`typing.TypedDict`. (Contributed by Patrick Reader in :issue:`41792`.)
pt_br: Adiciona uma nova função :func:`typing.is_typeddict` para fazer introspecção se uma anotação for uma :class:`typing.TypedDict`. (Contribuição de Patrick Reader em :issue:`41792`.)

source: Subclasses of ``typing.Protocol`` which only have data variables declared will now raise a ``TypeError`` when checked with ``isinstance`` unless they are decorated with :func:`~typing.runtime_checkable`. Previously, these checks passed silently. Users should decorate their subclasses with the :func:`!runtime_checkable` decorator if they want runtime protocols. (Contributed by Yurii Karabas in :issue:`38908`.)
pt_br: Subclasses de ``typing.Protocol`` que apenas têm variáveis de dados declaradas agora irão levantar um ``TypeError`` quando verificadas com ``isinstance`` a menos que sejam decoradas com :func:`~typing.runtime_checkable`. Anteriormente, essas verificações eram aprovadas silenciosamente. Os usuários devem decorar suas subclasses com o decorador :func:`!runtime_checkable` se quiserem protocolos de tempo de execução. (Contribuição de Yurii Karabas em :issue:`38908`.)

source: Importing from the ``typing.io`` and ``typing.re`` submodules will now emit :exc:`DeprecationWarning`. These submodules have been deprecated since Python 3.8 and will be removed in a future version of Python. Anything belonging to those submodules should be imported directly from :mod:`typing` instead. (Contributed by Sebastian Rittau in :issue:`38291`.)
pt_br: A importação dos submódulos ``typing.io`` e ``typing.re`` agora emitirá :exc:`DeprecationWarning`. Esses submódulos fora descontinuados desde o Python 3.8 e serão removidos em uma versão futura do Python. Qualquer coisa pertencente a esses submódulos deve ser importada diretamente de :mod:`typing`. (Contribuição de Sebastian Rittau em :issue:`38291`.)

source: Add new method :meth:`~unittest.TestCase.assertNoLogs` to complement the existing :meth:`~unittest.TestCase.assertLogs`. (Contributed by Kit Yan Choi in :issue:`39385`.)
pt_br: Adiciona novo método new :meth:`~unittest.TestCase.assertNoLogs` para complementar o existente :meth:`~unittest.TestCase.assertLogs`. (Contribuição de Kit Yan Choi em :issue:`39385`.)

source: Python versions earlier than Python 3.10 allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
pt_br: Versões do Python anteriores ao Python 3.10 permitiam o uso de ``;`` e ``&`` como separadores de parâmetros de consulta em :func:`urllib.parse.parse_qs` e :func:`urllib.parse.parse_qsl`. Devido a questões de segurança e em conformidade com as recomendações mais recentes do W3C, isso foi alterado para permitir apenas uma única chave separadora, com ``&`` como padrão. Esta mudança também afeta :func:`!cgi.parse` e :func:`!cgi.parse_multipart` já que elas usam as funções afetadas internamente. Para obter mais detalhes, consulte a respectiva documentação. (Contribuição de Adam Goldschmidt, Senthil Kumaran e Ken Jin em :issue:`42967`.)
