Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: Changed :class:`~enum.Flag` to only consider primary values (power of two) canonical while composite values (``3``, ``6``, ``10``, etc.) are considered aliases; inverted flags are coerced to their positive equivalent.
pt_br: Alterada :class:`~enum.Flag` para considerar apenas valores primários (potência de dois) canônicos enquanto valores compostos (``3``, ``6``, ``10``, etc.) são considerados apelidos; bandeiras invertidas são coagidas ao seu equivalente positivo.

source: On FreeBSD, the :data:`!F_DUP2FD` and :data:`!F_DUP2FD_CLOEXEC` flags respectively are supported, the former equals to ``dup2`` usage while the latter set the ``FD_CLOEXEC`` flag in addition.
pt_br: No FreeBSD, os sinalizadores :data:`!F_DUP2FD` e :data:`!F_DUP2FD_CLOEXEC` respectivamente são suportados, o primeiro é igual ao uso de ``dup2`` enquanto o último define o sinalizador ``FD_CLOEXEC`` adicionalmente.

source: Support :PEP:`515`-style initialization of :class:`~fractions.Fraction` from string. (Contributed by Sergey B Kirpichev in :issue:`44258`.)
pt_br: Suporte à inicialização no estilo :PEP:`515` de :class:`~fractions.Fraction` da string. (Contribuição de Sergey B Kirpichev em :issue:`44258`.)

source: :class:`~fractions.Fraction` now implements an ``__int__`` method, so that an ``isinstance(some_fraction, typing.SupportsInt)`` check passes. (Contributed by Mark Dickinson in :issue:`44547`.)
pt_br: :class:`~fractions.Fraction` agora implementa um método ``__int__``, para que uma verificação de ``isinstance(some_fraction, typing.SupportsInt)`` seja aprovada. (Contribuição de Mark Dickinson em :issue:`44547`.)

source: :func:`functools.singledispatch` now supports :class:`types.UnionType` and :class:`typing.Union` as annotations to the dispatch argument.::
pt_br: :func:`functools.singledispatch` agora oferece suporte a :class:`types.UnionType` e :class:`typing.Union` como anotações para o argumento de dispatch.::

source: >>> from functools import singledispatch >>> @singledispatch ... def fun(arg, verbose=False): ... if verbose: ... print("Let me just say,", end=" ") ... print(arg) ... >>> @fun.register ... def _(arg: int | float, verbose=False): ... if verbose: ... print("Strength in numbers, eh?", end=" ") ... print(arg) ... >>> from typing import Union >>> @fun.register ... def _(arg: Union[list, set], verbose=False): ... if verbose: ... print("Enumerate this:") ... for i, elem in enumerate(arg): ... print(i, elem) ...
pt_br: >>> from functools import singledispatch >>> @singledispatch ... def fun(arg, verboso=False): ... if verboso: ... print("Deixe-me apenas dizer,", end=" ") ... print(arg) ... >>> @fun.register ... def _(arg: int | float, verboso=False): ... if verboso: ... print("Força nos números, não é?", end=" ") ... print(arg) ... >>> from typing import Union >>> @fun.register ... def _(arg: Union[list, set], verbose=False): ... if verboso: ... print("Enumere isso:") ... for i, elem in enumerate(arg): ... print(i, elem) ...

source: (Contributed by Yurii Karabas in :issue:`46014`.)
pt_br: (Contribuição de Yurii Karabas na :issue:`46014`.)

source: The :func:`gzip.compress` function is now faster when used with the **mtime=0** argument as it delegates the compression entirely to a single :func:`zlib.compress` operation. There is one side effect of this change: The gzip file header contains an "OS" byte in its header. That was traditionally always set to a value of 255 representing "unknown" by the :mod:`gzip` module. Now, when using :func:`~gzip.compress` with **mtime=0**, it may be set to a different value by the underlying zlib C library Python was linked against. (See :gh:`112346` for details on the side effect.)
pt_br: A função :func:`gzip.compress` agora é mais rápida quando usada com o argumento **mtime=0**, pois delega a compactação inteiramente para uma única operação :func:`zlib.compress`. Há um efeito colateral dessa mudança: o cabeçalho do arquivo gzip contém um byte de "OS" em seu cabeçalho. Tradicionalmente, isso sempre foi definido com um valor de 255 representando "desconhecido" pelo módulo :mod:`gzip`. Agora, ao usar :func:`~gzip.compress` com **mtime=0**, ele pode ser definido com um valor diferente pela biblioteca zlib C subjacente à qual o Python estava vinculado. (Veja :gh:`112346` para detalhes sobre o efeito colateral.)

source: :func:`hashlib.blake2b` and :func:`hashlib.blake2s` now prefer `libb2`_ over Python's vendored copy. (Contributed by Christian Heimes in :issue:`47095`.)
pt_br: :func:`hashlib.blake2b` e :func:`hashlib.blake2s` agora preferem `libb2`_ em vez da cópia do Python. (Contribuição de Christian Heimes em :issue:`47095`.)

source: The internal ``_sha3`` module with SHA3 and SHAKE algorithms now uses *tiny_sha3* instead of the *Keccak Code Package* to reduce code and binary size. The :mod:`hashlib` module prefers optimized SHA3 and SHAKE implementations from OpenSSL. The change affects only installations without OpenSSL support. (Contributed by Christian Heimes in :issue:`47098`.)
pt_br: O módulo interno ``_sha3`` com algoritmos SHA3 e SHAKE agora usa *tiny_sha3* em vez do *Keccak Code Package* para reduzir o código e o tamanho binário. O módulo :mod:`hashlib` prefere implementações otimizadas de SHA3 e SHAKE do OpenSSL. A alteração afeta apenas instalações sem suporte a OpenSSL. (Contribuição de Christian Heimes em :issue:`47098`.)

source: Add :func:`hashlib.file_digest`, a helper function for efficient hashing of files or file-like objects. (Contributed by Christian Heimes in :gh:`89313`.)
pt_br: Adiciona :func:`hashlib.file_digest`, uma função auxiliar para hash eficiente de objetos arquivo ou similar. (Contribuição de Christian Heimes em :gh:`89313`.)

source: IDLE and idlelib
pt_br: IDLE e idlelib

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
pt_br: Aplica realce de sintaxe em arquivos ``.pyi``. (Contribuição de Alex Waygood e Terry Jan Reedy em :issue:`45447`.)

source: Include prompts when saving Shell with inputs and outputs. (Contributed by Terry Jan Reedy in :gh:`95191`.)
pt_br: Inclui prompts ao salvar o console com entradas e saídas. (Contribuição de Terry Jan Reedy em :gh:`95191`.)

source: Add :func:`~inspect.getmembers_static` to return all members without triggering dynamic lookup via the descriptor protocol. (Contributed by Weipeng Hong in :issue:`30533`.)
pt_br: Adiciona :func:`~inspect.getmembers_static` para retornar todos os membros sem acionar a pesquisa dinâmica por meio do protocolo descritor. (Contribuição de Weipeng Hong em :issue:`30533`.)

source: Add :func:`~inspect.ismethodwrapper` for checking if the type of an object is a :class:`~types.MethodWrapperType`. (Contributed by Hakan Çelik in :issue:`29418`.)
pt_br: Adiciona :func:`~inspect.ismethodwrapper` para verificar se o tipo de um objeto é um :class:`~types.MethodWrapperType`. (Contribuição de Hakan Çelik em :issue:`29418`.)

source: Change the frame-related functions in the :mod:`inspect` module to return new :class:`~inspect.FrameInfo` and :class:`~inspect.Traceback` class instances (backwards compatible with the previous :term:`named tuple`-like interfaces) that includes the extended :pep:`657` position information (end line number, column and end column). The affected functions are:
pt_br: Altera as funções relacionadas a quadros no módulo :mod:`inspect` para retornar novas instâncias de classe :class:`~inspect.FrameInfo` e :class:`~inspect.Traceback` (compatíveis com as anteriores interfaces do tipo :term:`tupla nomeada`) que inclui as informações de posição estendidas :pep:`657` (número da linha final, coluna e coluna final). As funções afetadas são:

source: (Contributed by Pablo Galindo in :gh:`88116`.)
pt_br: (Contribuição por Pablo Galindo em :gh:`88116`.)

source: Add :func:`locale.getencoding` to get the current locale encoding. It is similar to ``locale.getpreferredencoding(False)`` but ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_br: Adiciona :func:`locale.getencoding` para obter a codificação local atual. É semelhante a ``locale.getpreferredencoding(False)``, mas ignora o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: Added :func:`~logging.getLevelNamesMapping` to return a mapping from logging level names (e.g. ``'CRITICAL'``) to the values of their corresponding :ref:`levels` (e.g. ``50``, by default). (Contributed by Andrei Kulakovin in :gh:`88024`.)
pt_br: Adicionada :func:`~logging.getLevelNamesMapping` para retornar um mapeamento de nomes de nível de registro (por exemplo, ``'CRITICAL'``) para os valores de seus :ref:`levels` correspondentes (por exemplo, ``50``, por padrão ). (Contribuição de Andrei Kulakovin em :gh:`88024`.)

source: Added a :meth:`~logging.handlers.SysLogHandler.createSocket` method to :class:`~logging.handlers.SysLogHandler`, to match :meth:`SocketHandler.createSocket() <logging.handlers.SocketHandler.createSocket>`. It is called automatically during handler initialization and when emitting an event, if there is no active socket. (Contributed by Kirill Pinchuk in :gh:`88457`.)
pt_br: Adicionado um método :meth:`~logging.handlers.SysLogHandler.createSocket` a :class:`~logging.handlers.SysLogHandler`, para corresponder a :meth:`SocketHandler.createSocket() <logging.handlers.SocketHandler.createSocket>` . Ele é chamado automaticamente durante a inicialização do manipulador e ao emitir um evento, se não houver nenhum soquete ativo. (Contribuição de Kirill Pinchuk em :gh:`88457`.)

source: Add :func:`math.exp2`: return 2 raised to the power of x. (Contributed by Gideon Mitchell in :issue:`45917`.)
pt_br: Adiciona :func:`math.exp2`: retorna 2 elevado à potência de x. (Contribuição de Gideon Mitchell em :issue:`45917`.)

source: Add :func:`math.cbrt`: return the cube root of x. (Contributed by Ajith Ramachandran in :issue:`44357`.)
pt_br: Adiciona :func:`math.cbrt`: retorna a raiz cúbica de x. (Contribuição de Ajith Ramachandran em :issue:`44357`.)

source: The behaviour of two :func:`math.pow` corner cases was changed, for consistency with the IEEE 754 specification. The operations ``math.pow(0.0, -math.inf)`` and ``math.pow(-0.0, -math.inf)`` now return ``inf``. Previously they raised :exc:`ValueError`. (Contributed by Mark Dickinson in :issue:`44339`.)
pt_br: O comportamento de dois casos excepcionais :func:`math.pow` foi alterado, para consistência com a especificação IEEE 754. As operações ``math.pow(0.0, -math.inf)`` e ``math.pow(-0.0, -math.inf)`` agora retornam ``inf``. Anteriormente eles levantavam :exc:`ValueError`. (Contribuição de Mark Dickinson em :issue:`44339`.)

source: The :data:`math.nan` value is now always available. (Contributed by Victor Stinner in :issue:`46917`.)
pt_br: O valor :data:`math.nan` agora está sempre disponível. (Contribuição de Victor Stinner em :issue:`46917`.)

source: A new function ``operator.call`` has been added, such that ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)``. (Contributed by Antony Lee in :issue:`44019`.)
pt_br: Uma nova função ``operator.call`` foi adicionada, tal que ``operator.call(obj, *args, **kwargs) == obj(*args, **kwargs)`` (Contribuição de Antony Lee em :issue:`44019`.)

source: On Windows, :func:`os.urandom` now uses ``BCryptGenRandom()``, instead of ``CryptGenRandom()`` which is deprecated. (Contributed by Donghee Na in :issue:`44611`.)
pt_br: No Windows, :func:`os.urandom` agora usa ``BCryptGenRandom()``, em vez de ``CryptGenRandom()`` que foi descontinuado. (Contribuição de Dong-hee Na em :issue:`44611`.)

source: :meth:`~pathlib.Path.glob` and :meth:`~pathlib.Path.rglob` return only directories if *pattern* ends with a pathname components separator: :data:`~os.sep` or :data:`~os.altsep`. (Contributed by Eisuke Kawasima in :issue:`22276` and :issue:`33392`.)
pt_br: :meth:`~pathlib.Path.glob` e :meth:`~pathlib.Path.rglob` retornam apenas diretórios se *pattern* terminar com um separador de componentes de nome de caminho: :data:`~os.sep` ou :data:`~os.altsep`. (Contribuição de Eisuke Kawasima em :issue:`22276` e :issue:`33392`.)

source: Atomic grouping (``(?>...)``) and possessive quantifiers (``*+``, ``++``, ``?+``, ``{m,n}+``) are now supported in regular expressions. (Contributed by Jeffrey C. Jacobs and Serhiy Storchaka in :issue:`433030`.)
pt_br: Agrupamento atômico (``(?>...)``) e quantificadores possessivos (``*+``, ``++``, ``?+``, ``{m,n}+`` ) agora são suportados em expressões regulares. (Contribuição de Jeffrey C. Jacobs e Serhiy Storchaka em :issue:`433030`.)

source: Add optional parameter *dir_fd* in :func:`shutil.rmtree`. (Contributed by Serhiy Storchaka in :issue:`46245`.)
pt_br: Adicione o parâmetro opcional *dir_fd* em :func:`shutil.rmtree`. (Contribuição de Serhiy Storchaka em :issue:`46245`.)

source: Add CAN Socket support for NetBSD. (Contributed by Thomas Klausner in :issue:`30512`.)
pt_br: Adiciona suporte ao soquete CAN para NetBSD. (Contribuição de Thomas Klausner em :issue:`30512`.)

source: :meth:`~socket.create_connection` has an option to raise, in case of failure to connect, an :exc:`ExceptionGroup` containing all errors instead of only raising the last error. (Contributed by Irit Katriel in :issue:`29980`.)
pt_br: :meth:`~socket.create_connection` tem a opção de levantar, em caso de falha na conexão, um :exc:`ExceptionGroup` contendo todos os erros ao invés de somente levantar o último erro. (Contribuição de Irit Katriel em :issue:`29980`.)

source: You can now disable the authorizer by passing :const:`None` to :meth:`~sqlite3.Connection.set_authorizer`. (Contributed by Erlend E. Aasland in :issue:`44491`.)
pt_br: Agora você pode desabilitar o autorizador passando :const:`None` para :meth:`~sqlite3.Connection.set_authorizer`. (Contribuição de Erlend E. Aasland em :issue:`44491`.)

source: Collation name :meth:`~sqlite3.Connection.create_collation` can now contain any Unicode character. Collation names with invalid characters now raise :exc:`UnicodeEncodeError` instead of :exc:`sqlite3.ProgrammingError`. (Contributed by Erlend E. Aasland in :issue:`44688`.)
pt_br: O nome do agrupamento :meth:`~sqlite3.Connection.create_collation` agora pode conter qualquer caractere Unicode. Nomes de agrupamento com caracteres inválidos agora levantar :exc:`UnicodeEncodeError` em vez de :exc:`sqlite3.ProgrammingError`. (Contribuição de Erlend E. Aasland em :issue:`44688`.)

source: :mod:`sqlite3` exceptions now include the SQLite extended error code as :attr:`~sqlite3.Error.sqlite_errorcode` and the SQLite error name as :attr:`~sqlite3.Error.sqlite_errorname`. (Contributed by Aviv Palivoda, Daniel Shahaf, and Erlend E. Aasland in :issue:`16379` and :issue:`24139`.)
pt_br: As exceções :mod:`sqlite3` agora incluem o código de erro estendido SQLite como :attr:`~sqlite3.Error.sqlite_errorcode` e o nome do erro SQLite como :attr:`~sqlite3.Error.sqlite_errorname`. (Contribuição de Aviv Palivoda, Daniel Shahaf e Erlend E. Aasland em :issue:`16379` e :issue:`24139`.)

source: Add :meth:`~sqlite3.Connection.setlimit` and :meth:`~sqlite3.Connection.getlimit` to :class:`sqlite3.Connection` for setting and getting SQLite limits by connection basis. (Contributed by Erlend E. Aasland in :issue:`45243`.)
pt_br: Adiciona :meth:`~sqlite3.Connection.setlimit` e :meth:`~sqlite3.Connection.getlimit` a :class:`sqlite3.Connection` para definir e obter limites SQLite por base de conexão. (Contribuição de Erlend E. Aasland em :issue:`45243`.)

source: :mod:`sqlite3` now sets :attr:`sqlite3.threadsafety` based on the default threading mode the underlying SQLite library has been compiled with. (Contributed by Erlend E. Aasland in :issue:`45613`.)
pt_br: :mod:`sqlite3` agora define :attr:`sqlite3.threadsafety` com base no modo de threading padrão com o qual a biblioteca SQLite subjacente foi compilada. (Contribuição de Erlend E. Aasland em :issue:`45613`.)

source: :mod:`sqlite3` C callbacks now use unraisable exceptions if callback tracebacks are enabled. Users can now register an :func:`unraisable hook handler <sys.unraisablehook>` to improve their debug experience. (Contributed by Erlend E. Aasland in :issue:`45828`.)
pt_br: O retorno de chamadas C :mod:`sqlite3` agora usam exceções que não podem ser levantadas se os rastreamentos de retorno de chamada estiverem habilitados. Os usuários agora podem registrar um :func:`unraisable hook handler <sys.unraisablehook>` para melhorar sua experiência de depuração. (Contribuição de Erlend E. Aasland em :issue:`45828`.)

source: Fetch across rollback no longer raises :exc:`~sqlite3.InterfaceError`. Instead we leave it to the SQLite library to handle these cases. (Contributed by Erlend E. Aasland in :issue:`44092`.)
pt_br: A busca por rollback não levanta mais :exc:`~sqlite3.InterfaceError`. Em vez disso, deixamos para a biblioteca SQLite lidar com esses casos. (Contribuição de Erlend E. Aasland em :issue:`44092`.)

source: Add :meth:`~sqlite3.Connection.serialize` and :meth:`~sqlite3.Connection.deserialize` to :class:`sqlite3.Connection` for serializing and deserializing databases. (Contributed by Erlend E. Aasland in :issue:`41930`.)
pt_br: Adiciona :meth:`~sqlite3.Connection.serialize` e :meth:`~sqlite3.Connection.deserialize` a :class:`sqlite3.Connection` para serializar e desserializar bancos de dados. (Contribuição de Erlend E. Aasland em :issue:`41930`.)

source: Add :meth:`~sqlite3.Connection.create_window_function` to :class:`sqlite3.Connection` for creating aggregate window functions. (Contributed by Erlend E. Aasland in :issue:`34916`.)
pt_br: Adiciona :meth:`~sqlite3.Connection.create_window_function` a :class:`sqlite3.Connection` para criar funções de janela agregadas. (Contribuição de Erlend E. Aasland em :issue:`34916`.)

source: Add :meth:`~sqlite3.Connection.blobopen` to :class:`sqlite3.Connection`. :class:`sqlite3.Blob` allows incremental I/O operations on blobs. (Contributed by Aviv Palivoda and Erlend E. Aasland in :issue:`24905`.)
pt_br: Adiciona :meth:`~sqlite3.Connection.blobopen` a :class:`sqlite3.Connection`. :class:`sqlite3.Blob` permite operações de E/S incrementais em blobs. (Contribuição de Aviv Palivoda e Erlend E. Aasland em :issue:`24905`.)

source: Add :meth:`~string.Template.get_identifiers` and :meth:`~string.Template.is_valid` to :class:`string.Template`, which respectively return all valid placeholders, and whether any invalid placeholders are present. (Contributed by Ben Kehoe in :gh:`90465`.)
pt_br: Adiciona :meth:`~string.Template.get_identifiers` e :meth:`~string.Template.is_valid` a :class:`string.Template`, que respectivamente retornam todos os marcadores de posição válidos e se quaisquer marcadores de posição inválidos estão presentes. (Contribuição de Ben Kehoe em :gh:`90465`.)

source: :func:`sys.exc_info` now derives the ``type`` and ``traceback`` fields from the ``value`` (the exception instance), so when an exception is modified while it is being handled, the changes are reflected in the results of subsequent calls to :func:`!exc_info`. (Contributed by Irit Katriel in :issue:`45711`.)
pt_br: :func:`sys.exc_info` agora deriva os campos ``type`` e ``traceback`` do ``value`` (a instância de exceção) de forma que quanto uma exceção é modificada enquanto está sendo tratada, são refletidos nos resultados de chamadas subsequentes para :func:`!exc_info`. (Contribuição de Irit Katriel em :issue:`45711`.)

source: Add :func:`sys.exception` which returns the active exception instance (equivalent to ``sys.exc_info()[1]``). (Contributed by Irit Katriel in :issue:`46328`.)
pt_br: Adiciona :func:`sys.exception` que retorna a instância de exceção ativa (equivalente a ``sys.exc_info()[1]``). (Contribuição de Irit Katriel em :issue:`46328`.)

source: Add the :data:`sys.flags.safe_path <sys.flags>` flag. (Contributed by Victor Stinner in :gh:`57684`.)
pt_br: Adiciona o sinalizador :data:`sys.flags.safe_path <sys.flags>`. (Contribuição de Victor Stinner em :gh:`57684`.)

source: Three new :ref:`installation schemes <installation_paths>` (*posix_venv*, *nt_venv* and *venv*) were added and are used when Python creates new virtual environments or when it is running from a virtual environment. The first two schemes (*posix_venv* and *nt_venv*) are OS-specific for non-Windows and Windows, the *venv* is essentially an alias to one of them according to the OS Python runs on. This is useful for downstream distributors who modify :func:`sysconfig.get_preferred_scheme`. Third party code that creates new virtual environments should use the new *venv* installation scheme to determine the paths, as does :mod:`venv`. (Contributed by Miro Hrončok in :issue:`45413`.)
pt_br: Três novos :ref:`esquemas de instalação <installation_paths>` (*posix_venv*, *nt_venv* e *venv*) foram adicionados e são usados quando o Python cria novos ambientes virtuais ou quando está sendo executado a partir de um ambiente virtual. Os dois primeiros esquemas (*posix_venv* e *nt_venv*) são específicos do SO para não Windows e Windows, o *venv* é essencialmente um apelido para um deles de acordo com o SO em que o Python é executado. Isso é útil para distribuidores downstream que modificam :func:`sysconfig.get_preferred_scheme`. O código de terceiros que cria novos ambientes virtuais deve usar o novo esquema de instalação *venv* para determinar os caminhos, assim como :mod:`venv`. (Contribuição de Miro Hrončok em :issue:`45413`.)

source: :class:`~tempfile.SpooledTemporaryFile` objects now fully implement the methods of :class:`io.BufferedIOBase` or :class:`io.TextIOBase` (depending on file mode). This lets them work correctly with APIs that expect file-like objects, such as compression modules. (Contributed by Carey Metcalfe in :gh:`70363`.)
pt_br: Objetos :class:`~tempfile.SpooledTemporaryFile` agora implementam totalmente os métodos de :class:`io.BufferedIOBase` ou :class:`io.TextIOBase` (dependendo do modo de arquivo). Isso permite que eles funcionem corretamente com APIs que esperam objetos arquivo ou similares, como módulos de compactação. (Contribuição de Carey Metcalfe em :gh:`70363`.)

source: On Unix, if the ``sem_clockwait()`` function is available in the C library (glibc 2.30 and newer), the :meth:`threading.Lock.acquire` method now uses the monotonic clock (:const:`time.CLOCK_MONOTONIC`) for the timeout, rather than using the system clock (:const:`time.CLOCK_REALTIME`), to not be affected by system clock changes. (Contributed by Victor Stinner in :issue:`41710`.)
pt_br: No Unix, se a função ``sem_clockwait()`` estiver disponível na biblioteca C (glibc 2.30 e mais recente), o método :meth:`threading.Lock.acquire` agora usa o relógio monotônico (:const:`time.CLOCK_MONOTONIC`) para o tempo limite, em vez de usar o relógio do sistema (:const:`time.CLOCK_REALTIME`), para não ser afetado pelas alterações do relógio do sistema. (Contribuição de Victor Stinner em :issue:`41710`.)

source: On Unix, :func:`time.sleep` now uses the ``clock_nanosleep()`` or ``nanosleep()`` function, if available, which has a resolution of 1 nanosecond (10\ :sup:`-9` seconds), rather than using ``select()`` which has a resolution of 1 microsecond (10\ :sup:`-6` seconds). (Contributed by Benjamin Szőke and Victor Stinner in :issue:`21302`.)
pt_br: No Unix, :func:`time.sleep` agora usa a função ``clock_nanosleep()`` ou ``nanosleep()``, se disponível, que tem uma resolução de 1 nanossegundo (10\ :sup:`-9` segundos), em vez de usar ``select()`` que tem uma resolução de 1 microssegundo (10\ :sup:`-6` segundos). (Contribuição de Benjamin Szőke e Victor Stinner em :issue:`21302`.)
