Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: What's New In Python 3.11
pt_br: O que há de novo no Python 3.11

source: This article explains the new features in Python 3.11, compared to 3.10. Python 3.11 was released on October 24, 2022. For full details, see the :ref:`changelog <changelog>`.
pt_br: Este artigo explica os novos recursos no Python 3.11, em comparação com 3.10. Python 3.11 foi lançado em 24 de outubro de 2022. Veja :ref:`changelog <changelog>` para uma lista completa de mudanças.

source: Summary -- Release highlights
pt_br: Resumo -- Destaques da versão

source: Python 3.11 is between 10-60% faster than Python 3.10. On average, we measured a 1.25x speedup on the standard benchmark suite. See :ref:`whatsnew311-faster-cpython` for details.
pt_br: O Python 3.11 é entre 10-60% mais rápido que o Python 3.10. Em média, medimos uma aceleração de 1,25x no conjunto de benchmarks padrão. Veja :ref:`whatsnew311-faster-cpython` para detalhes.

source: New syntax features:
pt_br: Novos recursos de sintaxe:

source: New built-in features:
pt_br: Novos recursos embutidos:

source: New standard library modules:
pt_br: Novos módulos da biblioteca padrão:

source: :pep:`680`: :mod:`tomllib` — Support for parsing `TOML <https://toml.io/>`_ in the Standard Library
pt_br: :pep:`680`: :mod:`tomllib` — Suporte para analisar `TOML <https://toml.io/>`_ na Biblioteca Padrão

source: Interpreter improvements:
pt_br: Melhorias no interpretador:

source: New :option:`-P` command line option and :envvar:`PYTHONSAFEPATH` environment variable to :ref:`disable automatically prepending potentially unsafe paths <whatsnew311-pythonsafepath>` to :data:`sys.path`
pt_br: Nova opção de linha de comando :option:`-P` e variável de ambiente :envvar:`PYTHONSAFEPATH` para :ref:`desabilitar automaticamente a anteposição automática de caminhos potencialmente inseguros <whatsnew311-pythonsafepath>` para :data:`sys.path`

source: New typing features:
pt_br: Novos recursos de tipagem:

source: Important deprecations, removals and restrictions:
pt_br: Descontinuações, remoções e restrições importantes:

source: :pep:`594`: :ref:`Many legacy standard library modules have been deprecated <whatsnew311-pep594>` and will be removed in Python 3.13
pt_br: :pep:`594`: :ref:`Muitos módulos legados de biblioteca padrão foram descontinuados <whatsnew311-pep594>` e serão removidos no Python 3.13

source: :pep:`624`: :ref:`Py_UNICODE encoder APIs have been removed <whatsnew311-pep624>`
pt_br: :pep:`624`: :ref:`APIs do codificador Py_UNICODE foram removidas <whatsnew311-pep624>`

source: :pep:`670`: :ref:`Macros converted to static inline functions <whatsnew311-pep670>`
pt_br: :pep:`670`: :ref:`Macros convertidos em funções estáticas em linha <whatsnew311-pep670>`

source: New Features
pt_br: Novas funcionalidades

source: PEP 657: Fine-grained error locations in tracebacks
pt_br: PEP 657: Localizações de erros refinadas em tracebacks

source: When printing tracebacks, the interpreter will now point to the exact expression that caused the error, instead of just the line. For example:
pt_br: Ao imprimir tracebacks (situação da pilha de execução), o interpretador agora apontará para a expressão exata que causou o erro, em vez de apenas a linha. Por exemplo:

source: Traceback (most recent call last): File "distance.py", line 11, in <module> print(manhattan_distance(p1, p2)) ^^^^^^^^^^^^^^^^^^^^^^^^^^ File "distance.py", line 6, in manhattan_distance return abs(point_1.x - point_2.x) + abs(point_1.y - point_2.y) ^^^^^^^^^ AttributeError: 'NoneType' object has no attribute 'x'
pt_br: Traceback (most recent call last): File "distância.py", line 11, in <module> print(distância_de_manhattan(p1, p2)) ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ File "distância.py", line 6, in distância_de_manhattan return abs(ponto_1.x - ponto_2.x) + abs(ponto_1.y - ponto_2.y) ^^^^^^^^^ AttributeError: 'NoneType' object has no attribute 'x'

source: Previous versions of the interpreter would point to just the line, making it ambiguous which object was ``None``. These enhanced errors can also be helpful when dealing with deeply nested :class:`dict` objects and multiple function calls:
pt_br: Versões anteriores do interpretador apontavam apenas para a linha, tornando ambíguo qual objeto era ``None``. Esses erros aprimorados também podem ser úteis ao lidar com objetos :class:`dict` profundamente aninhados e várias chamadas de função:

source: Traceback (most recent call last): File "query.py", line 37, in <module> magic_arithmetic('foo') File "query.py", line 18, in magic_arithmetic return add_counts(x) / 25 ^^^^^^^^^^^^^ File "query.py", line 24, in add_counts return 25 + query_user(user1) + query_user(user2) ^^^^^^^^^^^^^^^^^ File "query.py", line 32, in query_user return 1 + query_count(db, response['a']['b']['c']['user'], retry=True) ~~~~~~~~~~~~~~~~~~^^^^^ TypeError: 'NoneType' object is not subscriptable
pt_br: Traceback (most recent call last): File "consultar.py", line 37, in <module> mágica_aritmética('foo') File "consultar.py", line 18, in mágica_aritmética return adicionar_contagens(x) / 25 ^^^^^^^^^^^^^ File "consultar.py", line 24, in adicionar_contagens return 25 + consultar_usuário(usuário1) + consultar_usuário(usuário2) ^^^^^^^^^^^^^^^^^ File "consultar.consultar", line 32, in consultar_usuário return 1 + consultar_contagem(db, resposta['a']['b']['c']['user'], tentar_novamente=True) ~~~~~~~~~~~~~~~~~~^^^^^ TypeError: 'NoneType' object is not subscriptable

source: As well as complex arithmetic expressions:
pt_br: Bem como expressões aritméticas complexas:

source: Traceback (most recent call last): File "calculation.py", line 54, in <module> result = (x / y / z) * (a / b / c) ~~~~~~^~~ ZeroDivisionError: division by zero
pt_br: Traceback (most recent call last): File "cálculo.py", line 54, in <module> resultado = (x / y / z) * (a / b / c) ~~~~~~^~~ ZeroDivisionError: division by zero

source: Additionally, the information used by the enhanced traceback feature is made available via a general API, that can be used to correlate :term:`bytecode` :ref:`instructions <bytecodes>` with source code location. This information can be retrieved using:
pt_br: Além disso, as informações usadas pela funcionalidade de traceback aprimorado são disponibilizadas por meio de uma API geral, que pode ser usada para correlacionar :ref:`instruções <bytecodes>` :term:`bytecode` com a localização do código-fonte. Essas informações podem ser recuperadas usando:

source: The :meth:`codeobject.co_positions` method in Python.
pt_br: O método :meth:`codeobject.co_positions` no Python.

source: The :c:func:`PyCode_Addr2Location` function in the C API.
pt_br: A função :c:func:`PyCode_Addr2Location` na API C.

source: See :pep:`657` for more details. (Contributed by Pablo Galindo, Batuhan Taskaya and Ammar Askar in :issue:`43950`.)
pt_br: Veja :pep:`657` para mais detalhes. (Contribuição de Pablo Galindo, Batuhan Taskaya e Ammar Askar em :issue:`43950`.)

source: This feature requires storing column positions in :ref:`codeobjects`, which may result in a small increase in interpreter memory usage and disk usage for compiled Python files. To avoid storing the extra information and deactivate printing the extra traceback information, use the :option:`-X no_debug_ranges <-X>` command line option or the :envvar:`PYTHONNODEBUGRANGES` environment variable.
pt_br: Esse recurso requer o armazenamento de posições de coluna em :ref:`codeobjects`, o que pode resultar em um pequeno aumento no uso de memória do interpretador e no uso de disco para arquivos Python compilados. Para evitar armazenar as informações extras e desativar a exibição das informações extras de rastreamento, use a opção de linha de comando :option:`-X no_debug_ranges <-X>` ou a variável de ambiente :envvar:`PYTHONNODEBUGRANGES`.

source: PEP 654: Exception Groups and ``except*``
pt_br: PEP 654: Grupos de exceção e ``except*``

source: :pep:`654` introduces language features that enable a program to raise and handle multiple unrelated exceptions simultaneously. The builtin types :exc:`ExceptionGroup` and :exc:`BaseExceptionGroup` make it possible to group exceptions and raise them together, and the new :keyword:`except* <except_star>` syntax generalizes :keyword:`except` to match subgroups of exception groups.
pt_br: :pep:`654` introduz recursos de linguagem que permitem que um programa levante e manipule várias exceções não relacionadas simultaneamente. Os tipos internos :exc:`ExceptionGroup` e :exc:`BaseExceptionGroup` tornam possível agrupar exceções e criá-las juntas, e a nova sintaxe :keyword:`except* <except_star>` generaliza :keyword:`except` para corresponder a subgrupos de grupos de exceção.

source: See :pep:`654` for more details.
pt_br: Veja :pep:`654` para mais detalhes.

source: (Contributed by Irit Katriel in :issue:`45292`. PEP written by Irit Katriel, Yury Selivanov and Guido van Rossum.)
pt_br: (Contribuição de Irit Katriel em :issue:`45292`. PEP escrita por Irit Katriel, Yury Selivanov e Guido van Rossum.)

source: PEP 678: Exceptions can be enriched with notes
pt_br: PEP 678: Exceções podem ser enriquecidas com notas

source: The :meth:`~BaseException.add_note` method is added to :exc:`BaseException`. It can be used to enrich exceptions with context information that is not available at the time when the exception is raised. The added notes appear in the default traceback.
pt_br: O método :meth:`~BaseException.add_note` é adicionado a :exc:`BaseException`. Ele pode ser usado para enriquecer exceções com informações de contexto que não estão disponíveis no momento em que a exceção é gerada. As notas adicionadas aparecem no traceback padrão.

source: See :pep:`678` for more details.
pt_br: Veja :pep:`678` para mais detalhes.

source: (Contributed by Irit Katriel in :issue:`45607`. PEP written by Zac Hatfield-Dodds.)
pt_br: (Contribuição de Irit Katriel em :issue:`45607`. PEP escrita por Zac Hatfield-Dodds.)

source: Windows ``py.exe`` launcher improvements
pt_br: Melhorias no inicializador ``py.exe`` do Windows

source: The copy of the :ref:`launcher` included with Python 3.11 has been significantly updated. It now supports company/tag syntax as defined in :pep:`514` using the :samp:`-V:{<company>}/{<tag>}` argument instead of the limited :samp:`-{<major>}.{<minor>}`. This allows launching distributions other than ``PythonCore``, the one hosted on `python.org <https://www.python.org>`_.
pt_br: A cópia do :ref:`launcher` incluída no Python 3.11 foi significativamente atualizada. Ele agora oferece suporte à sintaxe de company/tag conforme definido em :pep:`514` usando o argumento :samp:`-V:{<company>}/{<tag>}` em vez do limitado :samp:`-{<major>}.{<minor>}`. Isso permite iniciar outras distribuições além de ``PythonCore``, aquela hospedada em `python.org <https://www.python.org>`_.

source: When using ``-V:`` selectors, either company or tag can be omitted, but all installs will be searched. For example, ``-V:OtherPython/`` will select the "best" tag registered for ``OtherPython``, while ``-V:3.11`` or ``-V:/3.11`` will select the "best" distribution with tag ``3.11``.
pt_br: Ao usar seletores ``-V:``, tanto company quanto tag podem ser omitidos, mas todas as instalações serão pesquisadas. Por exemplo, ``-V:OtherPython/`` selecionará a "melhor" tag registrada para ``OtherPython``, enquanto ``-V:3.11`` ou ``-V:/3.11`` selecionará o "best" com a tag ``3.11``.

source: When using the legacy :samp:`-{<major>}`, :samp:`-{<major>}.{<minor>}`, :samp:`-{<major>}-{<bitness>}` or :samp:`-{<major>}.{<minor>}-{<bitness>}` arguments, all existing behaviour should be preserved from past versions, and only releases from ``PythonCore`` will be selected. However, the ``-64`` suffix now implies "not 32-bit" (not necessarily x86-64), as there are multiple supported 64-bit platforms. 32-bit runtimes are detected by checking the runtime's tag for a ``-32`` suffix. All releases of Python since 3.5 have included this in their 32-bit builds.
pt_br: Ao usar os argumentos legados :samp:`-{<major>}`, :samp:`-{<major>}.{<minor>}`, :samp:`-{<major>}-{<bitness>}` ou :samp:`-{<major>}.{<minor>}-{<bitness>}`, todo o comportamento existente deve ser preservado de versões anteriores e somente lançamentos de ``PythonCore`` será selecionado. No entanto, o sufixo ``-64`` agora implica "não 32 bits" (não necessariamente x86-64), pois existem várias plataformas de 64 bits suportadas. Tempos de execução de 32 bits são detectados verificando a tag do tempo de execução para um sufixo ``-32``. Todas as versões do Python desde 3.5 incluíram isso em suas compilações de 32 bits.

source: New Features Related to Type Hints
pt_br: Novos recursos relacionados a dicas de tipo

source: This section covers major changes affecting :pep:`484` type hints and the :mod:`typing` module.
pt_br: Esta seção cobre as principais mudanças que afetam as dicas de tipo da :pep:`484` e o módulo :mod:`typing`.

source: PEP 646: Variadic generics
pt_br: PEP 646: Genéricos variádicos

source: :pep:`484` previously introduced :data:`~typing.TypeVar`, enabling creation of generics parameterised with a single type. :pep:`646` adds :data:`~typing.TypeVarTuple`, enabling parameterisation with an *arbitrary* number of types. In other words, a :data:`~typing.TypeVarTuple` is a *variadic* type variable, enabling *variadic* generics.
pt_br: :pep:`484` introduzido anteriormente :data:`~typing.TypeVar`, permitindo a criação de genéricos parametrizados com um único tipo. :pep:`646` adiciona :data:`~typing.TypeVarTuple`, permitindo a parametrização com um número *arbitrário* de tipos. Em outras palavras, uma :data:`~typing.TypeVarTuple` é uma variável do tipo *variádico*, habilitando genéricos *variádicos*.

source: This enables a wide variety of use cases. In particular, it allows the type of array-like structures in numerical computing libraries such as NumPy and TensorFlow to be parameterised with the array *shape*. Static type checkers will now be able to catch shape-related bugs in code that uses these libraries.
pt_br: Isso permite uma ampla variedade de casos de uso. Em particular, ele permite que o tipo de estruturas do tipo array em bibliotecas de computação numérica, como NumPy e TensorFlow, sejam parametrizadas com o array *shape*. Os verificadores de tipo estáticos agora poderão capturar bugs relacionados a formas no código que usa essas bibliotecas.

source: See :pep:`646` for more details.
pt_br: Veja :pep:`646` para mais detalhes.

source: (Contributed by Matthew Rahtz in :issue:`43224`, with contributions by Serhiy Storchaka and Jelle Zijlstra. PEP written by Mark Mendoza, Matthew Rahtz, Pradeep Kumar Srinivasan, and Vincent Siles.)
pt_br: (Contribuição de Matthew Rahtz em :issue:`43224`, com contribuições de Serhiy Storchaka e Jelle Zijlstra. PEP escrita por Mark Mendoza, Matthew Rahtz, Pradeep Kumar Srinivasan e Vincent Siles.)

source: PEP 655: Marking individual ``TypedDict`` items as required or not-required
pt_br: PEP 655: Marcando itens ``TypedDict`` individuais como obrigatórios ou não obrigatórios

source: :data:`~typing.Required` and :data:`~typing.NotRequired` provide a straightforward way to mark whether individual items in a :class:`~typing.TypedDict` must be present. Previously, this was only possible using inheritance.
pt_br: :data:`~typing.Required` e :data:`~typing.NotRequired` fornecem uma maneira direta de marcar se itens individuais em um :class:`~typing.TypedDict` devem estar presentes. Anteriormente, isso só era possível usando herança.

source: All fields are still required by default, unless the *total* parameter is set to ``False``, in which case all fields are still not-required by default. For example, the following specifies a :class:`!TypedDict` with one required and one not-required key::
pt_br: Todos os campos ainda são obrigatórios por padrão, a menos que o parâmetro *total* seja definido como ``False``, caso em que todos os campos ainda não são obrigatórios por padrão. Por exemplo, o seguinte especifica um :class:`!TypedDict` com uma chave obrigatória e uma chave não obrigatória::

source: class Movie(TypedDict): title: str year: NotRequired[int] m1: Movie = {"title": "Black Panther", "year": 2018} # OK m2: Movie = {"title": "Star Wars"} # OK (year is not required) m3: Movie = {"year": 2022} # ERROR (missing required field title)
pt_br: class Filme(TypedDict): título: str ano: NotRequired[int] m1: Filme = {"título": "Pantera Negra", "ano": 2018} # OK m2: Filme = {"título": "Star Wars"} # OK (ano não é obrigatório) m3: Filme = {"ano": 2022} # ERRO (falta título, um campo obrigatório)

source: The following definition is equivalent::
pt_br: A seguinte definição é equivalente::

source: class Movie(TypedDict, total=False): title: Required[str] year: int
pt_br: class File(TypedDict, total=False): título: Required[str] ano: int

source: See :pep:`655` for more details.
pt_br: Veja :pep:`655` para mais detalhes.

source: (Contributed by David Foster and Jelle Zijlstra in :issue:`47087`. PEP written by David Foster.)
pt_br: (Contribuição de David Foster e Jelle Zijlstra em :issue:`47087`. PEP escrita por David Foster.)

source: PEP 673: ``Self`` type
pt_br: PEP 673: Tipo ``Self``

source: The new :data:`~typing.Self` annotation provides a simple and intuitive way to annotate methods that return an instance of their class. This behaves the same as the :class:`~typing.TypeVar`-based approach :pep:`specified in PEP 484 <484#annotating-instance-and-class-methods>`, but is more concise and easier to follow.
pt_br: A nova anotação :data:`~typing.Self` fornece uma maneira simples e intuitiva de anotar métodos que retornam uma instância de sua classe. Isso se comporta da mesma forma que a abordagem baseada em :class:`~typing.TypeVar` :pep:`especificada na PEP 484 <484#annotating-instance-and-class-methods>`, mas é mais concisa e fácil de seguir.

source: Common use cases include alternative constructors provided as :func:`classmethod <classmethod>`\s, and :meth:`~object.__enter__` methods that return ``self``::
pt_br: Casos de uso comuns incluem construtores alternativos fornecidos como :func:`classmethod <classmethod>`\s e métodos :meth:`~object.__enter__` que retornam ``self``::

source: class MyLock: def __enter__(self) -> Self: self.lock() return self ... class MyInt: @classmethod def fromhex(cls, s: str) -> Self: return cls(int(s, 16)) ...
pt_br: class MinhaTrava: def __enter__(self) -> Self: self.trava() return self ... class MeuInt: @classmethod def de_hex(cls, s: str) -> Self: return cls(int(s, 16)) ...

source: :data:`~typing.Self` can also be used to annotate method parameters or attributes of the same type as their enclosing class.
pt_br: :data:`~typing.Self` também pode ser usado para anotar parâmetros de métodos ou atributos do mesmo tipo que sua classe de inclusão.

source: See :pep:`673` for more details.
pt_br: Veja :pep:`673` para mais detalhes.

source: (Contributed by James Hilton-Balfe in :issue:`46534`. PEP written by Pradeep Kumar Srinivasan and James Hilton-Balfe.)
pt_br: (Contribuição de James Hilton-Balfe em :issue:`46534`. PEP escrita por Pradeep Kumar Srinivasan e James Hilton-Balfe.)

source: PEP 675: Arbitrary literal string type
pt_br: PEP 675: Tipo de string literal arbitrário

source: The new :data:`~typing.LiteralString` annotation may be used to indicate that a function parameter can be of any literal string type. This allows a function to accept arbitrary literal string types, as well as strings created from other literal strings. Type checkers can then enforce that sensitive functions, such as those that execute SQL statements or shell commands, are called only with static arguments, providing protection against injection attacks.
pt_br: A nova anotação :data:`~typing.LiteralString` pode ser usada para indicar que um parâmetro de função pode ser de qualquer tipo de string literal. Isso permite que uma função aceite tipos de string literais arbitrários, bem como strings criadas a partir de outras strings literais. Os verificadores de tipo podem então impor que funções confidenciais, como aquelas que executam instruções SQL ou comandos de console, sejam chamadas apenas com argumentos estáticos, fornecendo proteção contra ataques de injeção.

source: For example, a SQL query function could be annotated as follows::
pt_br: Por exemplo, uma função de consulta SQL pode ser anotada da seguinte forma::

source: def run_query(sql: LiteralString) -> ... ... def caller( arbitrary_string: str, query_string: LiteralString, table_name: LiteralString, ) -> None: run_query("SELECT * FROM students") # ok run_query(query_string) # ok run_query("SELECT * FROM " + table_name) # ok run_query(arbitrary_string) # type checker error run_query( # type checker error f"SELECT * FROM students WHERE name = {arbitrary_string}" )
pt_br: def faz_consulta(sql: LiteralString) -> ... ... def chamador( string_arbitrária: str, string_consulta: LiteralString, nome_tabela: LiteralString, ) -> None: faz_consulta("SELECT * FROM students") # ok faz_consulta(string_consulta) # ok faz_consulta("SELECT * FROM " + nome_tabela) # ok faz_consulta(string_arbitrária) # erro no verificador de tipo faz_consulta( # erro no verificador de tipo f"SELECT * FROM students WHERE name = {string_arbitrária}" )

source: See :pep:`675` for more details.
pt_br: Veja :pep:`675` para mais detalhes.

source: (Contributed by Jelle Zijlstra in :issue:`47088`. PEP written by Pradeep Kumar Srinivasan and Graham Bleaney.)
pt_br: (Contribuição de Jelle Zijlstra em :issue:`47088`. PEP escrita por Pradeep Kumar Srinivasan e Graham Bleaney.)

source: PEP 681: Data class transforms
pt_br: PEP 681: Transformações de classe de dados

source: :data:`~typing.dataclass_transform` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class, giving it :func:`dataclass <dataclasses.dataclass>`-like behaviors.
pt_br: :data:`~typing.dataclass_transform` pode ser usado para decorar uma classe, metaclasse ou uma função que é um decorador. A presença de ``@dataclass_transform()`` informa a um verificador de tipo estático que o objeto decorado executa uma "mágica" de tempo de execução que transforma uma classe, dando a ela comportamentos semelhantes a :func:`dataclass <dataclasses.dataclass>`.

source: For example::
pt_br: Por exemplo::

source: # The create_model decorator is defined by a library. @typing.dataclass_transform() def create_model(cls: Type[T]) -> Type[T]: cls.__init__ = ... cls.__eq__ = ... cls.__ne__ = ... return cls # The create_model decorator can now be used to create new model classes: @create_model class CustomerModel: id: int name: str c = CustomerModel(id=327, name="Eric Idle")
pt_br: # O decorador cria_modelo está definido por uma biblioteca. @typing.dataclass_transform() def cria_modelo(cls: Type[T]) -> Type[T]: cls.__init__ = ... cls.__eq__ = ... cls.__ne__ = ... return cls # O decorador cria_modelo agora pode ser usado para criar novas classes de modelo: @cria_modelo class ModeloCliente: id: int nome: str c = ModeloCliente(id=327, nome="Eric Idle")

source: See :pep:`681` for more details.
pt_br: Veja :pep:`681` para mais detalhes.

source: (Contributed by Jelle Zijlstra in :gh:`91860`. PEP written by Erik De Bonte and Eric Traut.)
pt_br: (Contribuição de Jelle Zijlstra em :gh:`91860`. PEP escrita por Erik De Bonte e Eric Traut.)

source: PEP 563 may not be the future
pt_br: PEP 563 pode não ser o futuro
