Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: At runtime, Python will try to look for common patterns and type stability in the executing code. Python will then replace the current operation with a more specialized one. This specialized operation uses fast paths available only to those use cases/types, which generally outperform their generic counterparts. This also brings in another concept called *inline caching*, where Python caches the results of expensive operations directly in the :term:`bytecode`.
pt_br: Em tempo de execução, o Python tentará procurar padrões comuns e estabilidade de tipo no código em execução. O Python substituirá a operação atual por uma mais especializada. Essa operação especializada usa caminhos rápidos disponíveis apenas para esses casos/tipos de uso, que geralmente superam suas contrapartes genéricas. Isso também traz outro conceito chamado *cache inline*, onde o Python armazena em cache os resultados de operações caras diretamente no :term:`bytecode`.

source: The specializer will also combine certain common instruction pairs into one superinstruction, reducing the overhead during execution.
pt_br: O especializador também combinará certos pares de instruções comuns em uma superinstrução, reduzindo a sobrecarga durante a execução.

source: Python will only specialize when it sees code that is "hot" (executed multiple times). This prevents Python from wasting time on run-once code. Python can also de-specialize when code is too dynamic or when the use changes. Specialization is attempted periodically, and specialization attempts are not too expensive, allowing specialization to adapt to new circumstances.
pt_br: O Python só se especializará quando vir um código "quente" (executado várias vezes). Isso evita que o Python perca tempo com código de execução única. O Python também pode se especializar quando o código é muito dinâmico ou quando o uso muda. A especialização é tentada periodicamente e as tentativas de especialização não são muito caras, permitindo que a especialização se adapte às novas circunstâncias.

source: (PEP written by Mark Shannon, with ideas inspired by Stefan Brunthaler. See :pep:`659` for more information. Implementation by Mark Shannon and Brandt Bucher, with additional help from Irit Katriel and Dennis Sweeney.)
pt_br: (PEP escrita por Mark Shannon, com ideias inspiradas por Stefan Brunthaler. Veja :pep:`659` para mais informações. Implementação por Mark Shannon e Brandt Bucher, com ajuda adicional de Irit Katriel e Dennis Sweeney.)

source: Operation
pt_br: Operação

source: Form
pt_br: Forma

source: Specialization
pt_br: Especialização

source: Operation speedup (up to)
pt_br: Aceleração da operação

source: Contributor(s)
pt_br: Contribuidor(es)

source: Binary operations
pt_br: Operações binárias

source: Binary add, multiply and subtract for common types such as :class:`int`, :class:`float` and :class:`str` take custom fast paths for their underlying types.
pt_br: Adicionar, multiplicar e subtrair binários para tipos comuns como :class:`int`, :class:`float` e :class:`str` usam caminhos rápidos personalizados para seus tipos subjacentes.

source: Subscript
pt_br: Subscrição

source: Subscripting container types such as :class:`list`, :class:`tuple` and :class:`dict` directly index the underlying data structures.
pt_br: Subscrever tipos contêineres como :class:`list`, :class:`tuple` e :class:`dict` indexam diretamente as estruturas de dados subjacentes.

source: Subscripting custom :meth:`~object.__getitem__` is also inlined similar to :ref:`inline-calls`.
pt_br: Subscrever :meth:`~object.__getitem__` personalizado também é inserido em linha de forma similar a :ref:`inline-calls`.

source: Store subscript
pt_br: Armazenar com subscrição

source: Similar to subscripting specialization above.
pt_br: Similar à especialização de subscrição acima.

source: Calls
pt_br: Chamadas

source: Calls to common builtin (C) functions and types such as :func:`len` and :class:`str` directly call their underlying C version. This avoids going through the internal calling convention.
pt_br: Chamadas para funções e tipos (C) embutidos comuns como :func:`len` e :class:`str` chamam diretamente sua versão C subjacente. Isso evita passar pela convenção de chamada interna.

source: Load global variable
pt_br: Carregar variável global

source: The object's index in the globals/builtins namespace is cached. Loading globals and builtins require zero namespace lookups.
pt_br: O índice do objeto no espaço de nomes globais/embutidas é armazenado em cache. Carregar globais e embutidas requer zero pesquisas de espaço de nomes.

source: Load attribute
pt_br: Carregar atributo

source: Similar to loading global variables. The attribute's index inside the class/object's namespace is cached. In most cases, attribute loading will require zero namespace lookups.
pt_br: Semelhante ao carregamento de variáveis globais. O índice do atributo dentro do espaço de nomes da classe/objeto é armazenado em cache. Na maioria dos casos, o carregamento de atributos exigirá zero pesquisas de espaço de nomes.

source: Load methods for call
pt_br: Carregar métodos para chamada

source: The actual address of the method is cached. Method loading now has no namespace lookups -- even for classes with long inheritance chains.
pt_br: O endereço real do método é armazenado em cache. O carregamento de método agora não tem pesquisas de espaço de nomes -- mesmo para classes com longas cadeias de herança.

source: Store attribute
pt_br: Armazenar atributo

source: Similar to load attribute optimization.
pt_br: Semelhante à otimização de carregamento de atributos.

source: 2% in pyperformance
pt_br: 2% no pyperformance

source: Unpack Sequence
pt_br: Desempacotar sequência

source: Specialized for common containers such as :class:`list` and :class:`tuple`. Avoids internal calling convention.
pt_br: Especializado para contêineres comuns como :class:`list` e :class:`tuple`. Evita convenção de chamada interna.

source: A similar optimization already existed since Python 3.8. 3.11 specializes for more forms and reduces some overhead.
pt_br: Uma otimização semelhante já existia desde o Python 3.8. O 3.11 é especializado em mais formas e reduz algumas despesas gerais.

source: A similar optimization already existed since Python 3.10. 3.11 specializes for more forms. Furthermore, all attribute loads should be sped up by :issue:`45947`.
pt_br: Uma otimização semelhante já existia desde o Python 3.10. 3.11 é especializado em mais formas. Além disso, todos os carregamentos de atributos devem ser acelerados por :issue:`45947`.

source: Misc
pt_br: Diversos

source: Objects now require less memory due to lazily created object namespaces. Their namespace dictionaries now also share keys more freely. (Contributed Mark Shannon in :issue:`45340` and :issue:`40116`.)
pt_br: Os objetos agora requerem menos memória devido aos espaços de nomes de objetos criados lentamente. Seus dicionários de espaços de nomes agora também compartilham chaves mais livremente. (Contribuição de Mark Shannon em :issue:`45340` e :issue:`40116`.)

source: "Zero-cost" exceptions are implemented, eliminating the cost of :keyword:`try` statements when no exception is raised. (Contributed by Mark Shannon in :issue:`40222`.)
pt_br: Exceções de "custo zero" estão implementadas, eliminando o custo das instruções :keyword:`try` quando nenhuma exceção é gerada. (Contribuição de Mark Shannon em :issue:`40222`.)

source: A more concise representation of exceptions in the interpreter reduced the time required for catching an exception by about 10%. (Contributed by Irit Katriel in :issue:`45711`.)
pt_br: Uma representação mais concisa de exceções no interpretador reduziu o tempo necessário para capturar uma exceção em cerca de 10%. (Contribuição de Irit Katriel em :issue:`45711`.)

source: :mod:`re`'s regular expression matching engine has been partially refactored, and now uses computed gotos (or "threaded code") on supported platforms. As a result, Python 3.11 executes the `pyperformance regular expression benchmarks <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ up to 10% faster than Python 3.10. (Contributed by Brandt Bucher in :gh:`91404`.)
pt_br: O mecanismo de correspondência de expressão regular do :mod:`re` foi parcialmente refatorado e agora usa *gotos* computados (ou "código encadeado") em plataformas suportadas. Como resultado, o Python 3.11 executa os `benchmarks de expressão regular do pyperformance <https://pyperformance.readthedocs.io/benchmarks.html#regex-dna>`_ até 10% mais rápido que o Python 3.10. (Contribuição de Brandt Bucher em :gh:`91404`.)

source: How should I write my code to utilize these speedups?
pt_br: Como devo escrever meu código para utilizar esses aceleradores?

source: Write Pythonic code that follows common best practices; you don't have to change your code. The Faster CPython project optimizes for common code patterns we observe.
pt_br: Escrever código pythônico que segue as melhores práticas comuns; você não precisa alterar seu código. O projeto Faster CPython otimiza para padrões de código comuns que observamos.

source: Will CPython 3.11 use more memory?
pt_br: O CPython 3.11 usará mais memória?

source: Maybe not; we don't expect memory use to exceed 20% higher than 3.10. This is offset by memory optimizations for frame objects and object dictionaries as mentioned above.
pt_br: Talvez não; não esperamos que o uso de memória exceda 20% a mais que 3.10. Isso é compensado por otimizações de memória para objetos quadro e dicionários de objetos, conforme mencionado acima.

source: I don't see any speedups in my workload. Why?
pt_br: Não vejo nenhuma aceleração em minha carga de trabalho. Por que?

source: Certain code won't have noticeable benefits. If your code spends most of its time on I/O operations, or already does most of its computation in a C extension library like NumPy, there won't be significant speedups. This project currently benefits pure-Python workloads the most.
pt_br: Certos códigos não terão benefícios perceptíveis. Se seu código passa a maior parte do tempo em operações de E/S ou já faz a maior parte de sua computação em uma biblioteca de extensão C como NumPy, não haverá acelerações significativas. Atualmente, esse projeto é o que mais beneficia as cargas de trabalho Python puro.

source: Furthermore, the pyperformance figures are a geometric mean. Even within the pyperformance benchmarks, certain benchmarks have slowed down slightly, while others have sped up by nearly 2x!
pt_br: Além disso, os valores de desempenho py são uma média geométrica. Mesmo dentro dos benchmarks de pyperformance, alguns benchmarks desaceleraram um pouco, enquanto outros aceleraram quase 2x!

source: Is there a JIT compiler?
pt_br: Existe um compilador JIT?

source: No. We're still exploring other optimizations.
pt_br: Não. Ainda estamos explorando outras otimizações.

source: About
pt_br: Sobre

source: Faster CPython explores optimizations for :term:`CPython`. The main team is funded by Microsoft to work on this full-time. Pablo Galindo Salgado is also funded by Bloomberg LP to work on the project part-time. Finally, many contributors are volunteers from the community.
pt_br: O Faster CPython explora otimizações para o :term:`CPython`. A equipe principal é financiada pela Microsoft para trabalhar nisso em tempo integral. Pablo Galindo Salgado também é financiado pela Bloomberg LP para trabalhar no projeto em tempo parcial. Finalmente, muitos colaboradores são voluntários da comunidade.

source: CPython bytecode changes
pt_br: Alterações de bytecode do CPython

source: The bytecode now contains inline cache entries, which take the form of the newly-added :opcode:`CACHE` instructions. Many opcodes expect to be followed by an exact number of caches, and instruct the interpreter to skip over them at runtime. Populated caches can look like arbitrary instructions, so great care should be taken when reading or modifying raw, adaptive bytecode containing quickened data.
pt_br: O bytecode agora contém entradas de cache inline, que assumem a forma das instruções recém-adicionadas :opcode:`CACHE`. Muitos códigos de operações, ou *opcodes*, esperam ser seguidos por um número exato de caches e instruem o interpretador a ignorá-los em tempo de execução. Os caches preenchidos podem parecer instruções arbitrárias, portanto, muito cuidado deve ser tomado ao ler ou modificar o bytecode adaptativo bruto que contém dados acelerados.

source: New opcodes
pt_br: Novos opcodes

source: :opcode:`!ASYNC_GEN_WRAP`, :opcode:`RETURN_GENERATOR` and :opcode:`SEND`, used in generators and co-routines.
pt_br: :opcode:`!ASYNC_GEN_WRAP`, :opcode:`RETURN_GENERATOR` e :opcode:`SEND`, usados em geradores e corrotinas.

source: :opcode:`COPY_FREE_VARS`, which avoids needing special caller-side code for closures.
pt_br: :opcode:`COPY_FREE_VARS`, que evita precisar de código especial no lado do chamado para fechamentos.

source: :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, for use in certain loops where handling interrupts is undesirable.
pt_br: :opcode:`JUMP_BACKWARD_NO_INTERRUPT`, para usasr em certos loops nos quais o tratamento de interrupções é indesejável.

source: :opcode:`MAKE_CELL`, to create :ref:`cell-objects`.
pt_br: :opcode:`MAKE_CELL`, para criar :ref:`cell-objects`.

source: :opcode:`CHECK_EG_MATCH` and :opcode:`!PREP_RERAISE_STAR`, to handle the :ref:`new exception groups and except* <whatsnew311-pep654>` added in :pep:`654`.
pt_br: :opcode:`CHECK_EG_MATCH` e :opcode:`!PREP_RERAISE_STAR`, para manipular :ref:`novos grupos de exceção e except* <whatsnew311-pep654>`, adicionados na :pep:`654`.

source: :opcode:`PUSH_EXC_INFO`, for use in exception handlers.
pt_br: :opcode:`PUSH_EXC_INFO`, para uso em manipuladores de exceção.

source: :opcode:`RESUME`, a no-op, for internal tracing, debugging and optimization checks.
pt_br: :opcode:`RESUME`, um *no-op*, para rastreamento interno, depuração e verificações de otimização.

source: Replaced opcodes
pt_br: Opcodes substituídos

source: Replaced Opcode(s)
pt_br: Opcode(s) substituído(s)

source: New Opcode(s)
pt_br: Novo(s) opcode(s)

source: Notes
pt_br: Notas

source: Replaced all numeric binary/in-place opcodes with a single opcode
pt_br: Substituiu todos os opcodes numéricos binários/no local por um único opcode

source: Decouples argument shifting for methods from handling of keyword arguments; allows better specialization of calls
pt_br: Separa a mudança de argumento para métodos da manipulação de argumentos nomeados; permite uma melhor especialização dos atendimentos

source: Stack manipulation instructions
pt_br: Instruções de manipulação de pilha

source: Now performs check but doesn't jump
pt_br: Agora efetua verificações, mas não pula

source: See [#bytecode-jump]_; ``TRUE``, ``FALSE``, ``NONE`` and ``NOT_NONE`` variants for each direction
pt_br: Veja [#bytecode-jump]_. Variantes ``TRUE``, ``FALSE``, ``NONE`` e ``NOT_NONE`` para cada direção

source: :keyword:`with` block setup
pt_br: Configuração de bloco :keyword:`with`

source: All jump opcodes are now relative, including the existing :opcode:`!JUMP_IF_TRUE_OR_POP` and :opcode:`!JUMP_IF_FALSE_OR_POP`. The argument is now an offset from the current instruction rather than an absolute location.
pt_br: Todos os opcodes de salto agora são relativos, incluindo os existentes :opcode:`!JUMP_IF_TRUE_OR_POP` e :opcode:`!JUMP_IF_FALSE_OR_POP`. O argumento agora é um deslocamento da instrução atual em vez de um local absoluto.

source: Changed/removed opcodes
pt_br: Opcodes alterados/removidos

source: Changed :opcode:`MATCH_CLASS` and :opcode:`MATCH_KEYS` to no longer push an additional boolean value to indicate success/failure. Instead, ``None`` is pushed on failure in place of the tuple of extracted values.
pt_br: Alterados :opcode:`MATCH_CLASS` e :opcode:`MATCH_KEYS` para não enviar mais um valor booleano adicional para indicar sucesso/falha. Em vez disso, ``None`` é enviado em caso de falha no lugar da tupla de valores extraídos.

source: Changed opcodes that work with exceptions to reflect them now being represented as one item on the stack instead of three (see :gh:`89874`).
pt_br: Alterados opcodes que funcionam com exceções para refleti-los agora sendo representados como um item na pilha em vez de três (consulte :gh:`89874`).

source: Removed :opcode:`!COPY_DICT_WITHOUT_KEYS`, :opcode:`!GEN_START`, :opcode:`!POP_BLOCK`, :opcode:`!SETUP_FINALLY` and :opcode:`!YIELD_FROM`.
pt_br: Removidos :opcode:`!COPY_DICT_WITHOUT_KEYS`, :opcode:`!GEN_START`, :opcode:`!POP_BLOCK`, :opcode:`!SETUP_FINALLY` e :opcode:`!YIELD_FROM`.

source: Deprecated
pt_br: Descontinuados

source: This section lists Python APIs that have been deprecated in Python 3.11.
pt_br: Esta seção lista as APIs do Python que foram descontinuadas no Python 3.11.

source: Deprecated C APIs are :ref:`listed separately <whatsnew311-c-api-deprecated>`.
pt_br: As APIs C descontinuadas são :ref:`listadas separadamente <whatsnew311-c-api-deprecated>`.

source: Language/Builtins
pt_br: Linguagem/Embutidos

source: Chaining :class:`classmethod` descriptors (introduced in :issue:`19072`) is now deprecated. It can no longer be used to wrap other descriptors such as :class:`property`. The core design of this feature was flawed and caused a number of downstream problems. To "pass-through" a :class:`classmethod`, consider using the :attr:`!__wrapped__` attribute that was added in Python 3.10. (Contributed by Raymond Hettinger in :gh:`89519`.)
pt_br: O encadeamento de descritores :class:`classmethod` (introduzido em :issue:`19072`) agora foi descontinuado. Ele não pode mais ser usado para agrupar outros descritores como :class:`property`. O design principal desse recurso era falho e causava vários problemas posteriores. Para "passar" um :class:`classmethod`, considere usar o atributo :attr:`!__wrapped__` que foi adicionado no Python 3.10. (Contribuição de Raymond Hettinger em :gh:`89519`.)

source: Octal escapes in string and bytes literals with values larger than ``0o377`` (255 in decimal) now produce a :exc:`DeprecationWarning`. In a future Python version, they will raise a :exc:`SyntaxWarning` and eventually a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :gh:`81548`.)
pt_br: Escapes octais em strings e bytes literais com valores maiores que ``0o377`` (255 em decimal) agora produzem um :exc:`DeprecationWarning`. Em uma versão futura do Python, eles levantarão um :exc:`SyntaxWarning` e eventualmente um :exc:`SyntaxError`. (Contribuição de Serhiy Storchaka em :gh:`81548`.)

source: The delegation of :func:`int` to :meth:`~object.__trunc__` is now deprecated. Calling ``int(a)`` when ``type(a)`` implements :meth:`!__trunc__` but not :meth:`~object.__int__` or :meth:`~object.__index__` now raises a :exc:`DeprecationWarning`. (Contributed by Zackery Spytz in :issue:`44977`.)
pt_br: A delegação de :func:`int` para :meth:`~object.__trunc__` agora foi descontinuada. Chamar ``int(a)`` quando ``type(a)`` implementa :meth:`!__trunc__`, mas não :meth:`~object.__int__` ou :meth:`~object.__index__`, agora levanta uma exceção :exc:`DeprecationWarning`. (Contribuição de Zackery Spytz em :issue:`44977`.)

source: Modules
pt_br: Módulos

source: :pep:`594` led to the deprecations of the following modules slated for removal in Python 3.13:
pt_br: :pep:`594` levou à descontinuação dos seguintes módulos programados para remoção no Python 3.13:

source: (Contributed by Brett Cannon in :issue:`47061` and Victor Stinner in :gh:`68966`.)
pt_br: (Contribuição de Brett Cannon em :issue:`47061` e Victor Stinner em :gh:`68966`.)

source: The :mod:`!asynchat`, :mod:`!asyncore` and :mod:`!smtpd` modules have been deprecated since at least Python 3.6. Their documentation and deprecation warnings have now been updated to note they will be removed in Python 3.12. (Contributed by Hugo van Kemenade in :issue:`47022`.)
pt_br: Os módulos :mod:`!asynchat`, :mod:`!asyncore` e :mod:`!smtpd` foram descontinuados desde pelo menos o Python 3.6. A documentação e os avisos de descontinuação foram atualizados para observar que serão removidos no Python 3.12. (Contribuição de Hugo van Kemenade em :issue:`47022`.)

source: The :mod:`!lib2to3` package and ``2to3`` tool are now deprecated and may not be able to parse Python 3.10 or newer. See :pep:`617`, introducing the new PEG parser, for details. (Contributed by Victor Stinner in :issue:`40360`.)
pt_br: O pacote :mod:`!lib2to3` e a ferramenta ``2to3`` agora foram descontinuados e podem não ser capazes de analisar o Python 3.10 ou mais recente. Veja :pep:`617`, apresentando o novo analisador GASE, para detalhes. (Contribuição de Victor Stinner em :issue:`40360`.)

source: Undocumented modules :mod:`!sre_compile`, :mod:`!sre_constants` and :mod:`!sre_parse` are now deprecated. (Contributed by Serhiy Storchaka in :issue:`47152`.)
pt_br: Módulos não documentados :mod:`!sre_compile`, :mod:`!sre_constants` e :mod:`!sre_parse` agora fora descontinuados. (Contribuição de Serhiy Storchaka em :issue:`47152`.)

source: Standard Library
pt_br: Biblioteca Padrão

source: The following have been deprecated in :mod:`configparser` since Python 3.2. Their deprecation warnings have now been updated to note they will be removed in Python 3.12:
pt_br: Os itens a seguir foram descontinuados em :mod:`configparser` desde o Python 3.2. Seus avisos de descontinuação agora foram atualizados para observar que serão removidos no Python 3.12:

source: the :class:`!configparser.SafeConfigParser` class
pt_br: a classe :class:`!configparser.SafeConfigParser`

source: the :attr:`!configparser.ParsingError.filename` property
pt_br: a propriedade :attr:`!configparser.ParsingError.filename`

source: the :meth:`!configparser.RawConfigParser.readfp` method
pt_br: o método :meth:`!configparser.RawConfigParser.readfp`

source: (Contributed by Hugo van Kemenade in :issue:`45173`.)
pt_br: (Contribuição de Hugo van Kemenade em :issue:`45173`.)

source: :class:`!configparser.LegacyInterpolation` has been deprecated in the docstring since Python 3.2, and is not listed in the :mod:`configparser` documentation. It now emits a :exc:`DeprecationWarning` and will be removed in Python 3.13. Use :class:`configparser.BasicInterpolation` or :class:`configparser.ExtendedInterpolation` instead. (Contributed by Hugo van Kemenade in :issue:`46607`.)
pt_br: :class:`!configparser.LegacyInterpolation` foi descontinuada na docstring desde o Python 3.2, e não está listada na documentação do :mod:`configparser`. Agora ela emite um :exc:`DeprecationWarning` e será removida no Python 3.13. Use :class:`configparser.BasicInterpolation` ou :class:`configparser.ExtendedInterpolation`. (Contribuição de Hugo van Kemenade em :issue:`46607`.)

source: The older set of :mod:`importlib.resources` functions were deprecated in favor of the replacements added in Python 3.9 and will be removed in a future Python version, due to not supporting resources located within package subdirectories:
pt_br: O antigo conjunto de funções :mod:`importlib.resources` foi descontinuado em favor das substituições adicionadas no Python 3.9 e será removido em uma versão futura do Python, devido ao não suporte de recursos localizados nos subdiretórios do pacote:

source: The :func:`locale.getdefaultlocale` function is deprecated and will be removed in Python 3.15. Use :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` and :func:`locale.getlocale` functions instead. (Contributed by Victor Stinner in :gh:`90817`.)
pt_br: A função :func:`locale.getdefaultlocale` foi descontinuada e será removida no Python 3.15. Use as funções :func:`locale.setlocale`, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` e :func:`locale.getlocale`. (Contribuição de Victor Stinner em :gh:`90817`.)
