Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: :pep:`563` Postponed Evaluation of Annotations (the ``from __future__ import annotations`` :ref:`future statement <future>`) that was originally planned for release in Python 3.10 has been put on hold indefinitely. See `this message from the Steering Council <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__ for more information.
pt_br: :pep:`563` Avaliação adiada de anotações (a ``from __future__ import annotations`` :ref:`instrução future <future>`) que foi originalmente planejada para lançamento no Python 3.10 foi colocada em espera indefinidamente. Veja `esta mensagem do Conselho Diretor <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__ para mais informações.

source: Other Language Changes
pt_br: Outras mudanças na linguagem

source: Starred unpacking expressions can now be used in :keyword:`for` statements. (See :issue:`46725` for more details.)
pt_br: Expressões de desempacotamento com asterisco agora podem ser usadas em instruções :keyword:`for`. (Veja :issue:`46725` para mais detalhes.)

source: Asynchronous :ref:`comprehensions <comprehensions>` are now allowed inside comprehensions in :ref:`asynchronous functions <async def>`. Outer comprehensions implicitly become asynchronous in this case. (Contributed by Serhiy Storchaka in :issue:`33346`.)
pt_br: :ref:`Compreensões <comprehensions>` assíncronas agora são permitidas dentro de compreensões em :ref:`funções assíncronas <async def>`. As compreensões externas tornam-se implicitamente assíncronas neste caso. (Contribuição de Serhiy Storchaka em :issue:`33346`.)

source: A :exc:`TypeError` is now raised instead of an :exc:`AttributeError` in :keyword:`with` statements and :meth:`contextlib.ExitStack.enter_context` for objects that do not support the :term:`context manager` protocol, and in :keyword:`async with` statements and :meth:`contextlib.AsyncExitStack.enter_async_context` for objects not supporting the :term:`asynchronous context manager` protocol. (Contributed by Serhiy Storchaka in :issue:`12022` and :issue:`44471`.)
pt_br: Uma exceção :exc:`TypeError` agora é levantada em vez de uma :exc:`AttributeError` em instruções :keyword:`with` e :meth:`contextlib.ExitStack.enter_context` para objetos que não oferecem suporte ao protocolo de :term:`gerenciador de contexto`, e em instruções :keyword:`async with` e :meth:`contextlib.AsyncExitStack.enter_async_context` para objetos que não oferecem suporte ao protocolo de :term:`gerenciador de contexto assíncrono`. (Contribuição de Serhiy Storchaka em :issue:`12022` e :issue:`44471`.)

source: Added :meth:`object.__getstate__`, which provides the default implementation of the :meth:`!__getstate__` method. :mod:`copy`\ing and :mod:`pickle`\ing instances of subclasses of builtin types :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict`, :class:`collections.deque`, :class:`weakref.WeakSet`, and :class:`datetime.tzinfo` now copies and pickles instance attributes implemented as :term:`slots <__slots__>`. This change has an unintended side effect: It trips up a small minority of existing Python projects not expecting :meth:`object.__getstate__` to exist. See the later comments on :gh:`70766` for discussions of what workarounds such code may need. (Contributed by Serhiy Storchaka in :issue:`26579`.)
pt_br: Adicionado :meth:`object.__getstate__`, que fornece a implementação padrão do método :meth:`!__getstate__`. Fazer :mod:`copy` e :mod:`pickle` de instâncias de subclasses de tipos embutidos :class:`bytearray`, :class:`set`, :class:`frozenset`, :class:`collections.OrderedDict`, :class:`collections.deque`, :class:`weakref.WeakSet` e :class:`datetime.tzinfo` agora copia e serializa com pickle atributos de instância implementados como :term:`slots <__slots__>`. Essa mudança tem um efeito colateral não intencional: ela atrapalha uma pequena minoria de projetos Python existentes que não esperavam que :meth:`object.__getstate__` existisse. Consulte os comentários posteriores em :gh:`70766` para discussões sobre quais soluções alternativas esse código pode precisar. (Contribuição de Serhiy Storchaka em :issue:`26579`.)

source: Added a :option:`-P` command line option and a :envvar:`PYTHONSAFEPATH` environment variable, which disable the automatic prepending to :data:`sys.path` of the script's directory when running a script, or the current directory when using :option:`-c` and :option:`-m`. This ensures only stdlib and installed modules are picked up by :keyword:`import`, and avoids unintentionally or maliciously shadowing modules with those in a local (and typically user-writable) directory. (Contributed by Victor Stinner in :gh:`57684`.)
pt_br: Adicionada uma opção de linha de comando :option:`-P` e uma variável de ambiente :envvar:`PYTHONSAFEPATH`, que desativa o prefixo automático para :data:`sys.path` do diretório do script ao executar um script ou o diretório atual ao usar :option:`-c` e :option:`-m`. Isso garante que apenas os módulos stdlib e instalados sejam escolhidos por :keyword:`import`, e evita sombreamento involuntário ou mal-intencionado de módulos com aqueles em um diretório local (e normalmente gravável pelo usuário). (Contribuição de Victor Stinner em :gh:`57684`.)

source: A ``"z"`` option was added to the :ref:`formatspec` that coerces negative to positive zero after rounding to the format precision. See :pep:`682` for more details. (Contributed by John Belmonte in :gh:`90153`.)
pt_br: Uma opção ``"z"`` foi adicionada ao :ref:`formatspec` que força zero negativo para positivo após o arredondamento para a precisão do formato. Veja :pep:`682` para mais detalhes. (Contribuição de John Belmonte em :gh:`90153`.)

source: Bytes are no longer accepted on :data:`sys.path`. Support broke sometime between Python 3.2 and 3.6, with no one noticing until after Python 3.10.0 was released. In addition, bringing back support would be problematic due to interactions between :option:`-b` and :data:`sys.path_importer_cache` when there is a mixture of :class:`str` and :class:`bytes` keys. (Contributed by Thomas Grainger in :gh:`91181`.)
pt_br: Bytes não são mais aceitos em :data:`sys.path`. O suporte quebrou em algum momento entre o Python 3.2 e o 3.6, sem que ninguém percebesse até o lançamento do Python 3.10.0. Além disso, trazer de volta o suporte seria problemático devido às interações entre :option:`-b` e :data:`sys.path_importer_cache` quando há uma mistura de chaves :class:`str` e :class:`bytes`. (Contribuição de Thomas Grainger em :gh:`91181`.)

source: Other CPython Implementation Changes
pt_br: Outras mudanças na implementação do CPython

source: The special methods :meth:`~object.__complex__` for :class:`complex` and :meth:`~object.__bytes__` for :class:`bytes` are implemented to support the :class:`typing.SupportsComplex` and :class:`typing.SupportsBytes` protocols. (Contributed by Mark Dickinson and Donghee Na in :issue:`24234`.)
pt_br: Os métodos especiais :meth:`~object.__complex__` para :class:`complex` e :meth:`~object.__bytes__` para :class:`bytes` são implementados para oferecer suporte aos protocolos :class:`typing.SupportsComplex` e :class:`typing.SupportsBytes`. (Contribuição de Mark Dickinson e Donghee Na em :issue:`24234`.)

source: ``siphash13`` is added as a new internal hashing algorithm. It has similar security properties as ``siphash24``, but it is slightly faster for long inputs. :class:`str`, :class:`bytes`, and some other types now use it as the default algorithm for :func:`hash`. :pep:`552` :ref:`hash-based .pyc files <pyc-invalidation>` now use ``siphash13`` too. (Contributed by Inada Naoki in :issue:`29410`.)
pt_br: ``siphash13`` foi adicionado como um novo algoritmo de hash interno. Ele tem propriedades de segurança semelhantes ao ``siphash24``, mas é um pouco mais rápido para entradas longas. :class:`str`, :class:`bytes` e alguns outros tipos agora o usam como o algoritmo padrão para :func:`hash`. :ref:`Arquivos .pyc baseados em hash <pyc-invalidation>` da :pep:`552` agora usam ``siphash13`` também. (Contribuição de Inada Naoki em :issue:`29410`.)

source: When an active exception is re-raised by a :keyword:`raise` statement with no parameters, the traceback attached to this exception is now always ``sys.exc_info()[1].__traceback__``. This means that changes made to the traceback in the current :keyword:`except` clause are reflected in the re-raised exception. (Contributed by Irit Katriel in :issue:`45711`.)
pt_br: Quando uma exceção ativa é reativada por uma instrução :keyword:`raise` sem parâmetros, o traceback anexado a essa exceção agora é sempre ``sys.exc_info()[1].__traceback__``. Isso significa que as alterações feitas no traceback na cláusula :keyword:`except` atual são refletidas na exceção levantada novamente. (Contribuição de Irit Katriel em :issue:`45711`.)

source: The interpreter state's representation of handled exceptions (aka ``exc_info`` or ``_PyErr_StackItem``) now only has the ``exc_value`` field; ``exc_type`` and ``exc_traceback`` have been removed, as they can be derived from ``exc_value``. (Contributed by Irit Katriel in :issue:`45711`.)
pt_br: A representação do estado do interpretador de exceções tratadas (também conhecidas como ``exc_info`` ou ``_PyErr_StackItem``) agora tem apenas o campo ``exc_value``; ``exc_type`` e ``exc_traceback`` foram removidos, pois podem ser derivados de ``exc_value``. (Contribuição de Irit Katriel em :issue:`45711`.)

source: A new :ref:`command line option <install-quiet-option>`, ``AppendPath``, has been added for the Windows installer. It behaves similarly to ``PrependPath``, but appends the install and scripts directories instead of prepending them. (Contributed by Bastian Neuburger in :issue:`44934`.)
pt_br: Uma nova :ref:`opção de linha de comando <install-quiet-option>`, ``AppendPath``, foi adicionada para o instalador do Windows. Ela se comporta de maneira semelhante ao ``PrependPath``, mas anexa os diretórios de instalação e scripts em vez de antecedê-los. (Contribuição de Bastian Neuburger em :issue:`44934`.)

source: The :c:member:`PyConfig.module_search_paths_set` field must now be set to ``1`` for initialization to use :c:member:`PyConfig.module_search_paths` to initialize :data:`sys.path`. Otherwise, initialization will recalculate the path and replace any values added to ``module_search_paths``.
pt_br: O campo :c:member:`PyConfig.module_search_paths_set` agora deve ser definido como ``1`` para a inicialização usar :c:member:`PyConfig.module_search_paths` para inicializar :data:`sys.path`. Caso contrário, a inicialização irá recalcular o caminho e substituir quaisquer valores adicionados a ``module_search_paths``.

source: The output of the :option:`--help` option now fits in 50 lines/80 columns. Information about :ref:`Python environment variables <using-on-envvars>` and :option:`-X` options is now available using the respective :option:`--help-env` and :option:`--help-xoptions` flags, and with the new :option:`--help-all`. (Contributed by Éric Araujo in :issue:`46142`.)
pt_br: A saída da opção :option:`--help` agora cabe em 50 linhas/80 colunas. Informações sobre as :ref:`variáveis de ambiente do Python <using-on-envvars>` e a opção :option:`-X` agora estão disponíveis usando os respectivos sinalizadores :option:`--help-env` e :option:`--help-xoptions`, e com o novo :option:`--help-all`. (Contribuição de Éric Araujo em :issue:`46142`.)

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
pt_br: Converter entre :class:`int` e :class:`str` em bases diferentes de 2 (binário), 4, 8 (octal), 16 (hexadecimal) ou 32 como base 10 (decimal) agora levanta uma exceção :exc:`ValueError` se o número de dígitos em forma de string estiver acima de um limite para evitar possíveis ataques de negação de serviço devido à complexidade algorítmica. Esta é uma mitigação para :cve:`2020-10735`. Este limite pode ser configurado ou desabilitado por variável de ambiente, sinalizador de linha de comando ou APIs de :mod:`sys`. Veja a documentação de :ref:`limitação de comprimento de conversão de string inteira <int_max_str_digits>`. O limite padrão é de 4300 dígitos em forma de string.

source: New Modules
pt_br: Novos módulos

source: :mod:`tomllib`: For parsing `TOML <https://toml.io/>`_. See :pep:`680` for more details. (Contributed by Taneli Hukkinen in :issue:`40059`.)
pt_br: :mod:`tomllib`: Para analisar `TOML <https://toml.io/>`_. Veja :pep:`680` para mais detalhes. (Contribuição de Taneli Hukkinen em :issue:`40059`.)

source: :mod:`wsgiref.types`: :pep:`WSGI <3333>`-specific types for static type checking. (Contributed by Sebastian Rittau in :issue:`42012`.)
pt_br: :mod:`wsgiref.types`: Tipos específicos de :pep:`WSGI <3333>` para verificação de tipo estático. (Contribuição de Sebastian Rittau em :issue:`42012`.)

source: Improved Modules
pt_br: Módulos melhorados

source: Added the :class:`~asyncio.TaskGroup` class, an :ref:`asynchronous context manager <async-context-managers>` holding a group of tasks that will wait for all of them upon exit. For new code this is recommended over using :func:`~asyncio.create_task` and :func:`~asyncio.gather` directly. (Contributed by Yury Selivanov and others in :gh:`90908`.)
pt_br: Adicionada a classe :class:`~asyncio.TaskGroup`, um :ref:`assíncrono gerenciador de contexto <async-context-managers>` contendo um grupo de tarefas que irá esperar por todas elas ao sair. Para código novo, é recomendado usar :func:`~asyncio.create_task` e :func:`~asyncio.gather` diretamente. (Contribuição de Yury Selivanov e outros em :gh:`90908`.)

source: Added :func:`~asyncio.timeout`, an asynchronous context manager for setting a timeout on asynchronous operations. For new code this is recommended over using :func:`~asyncio.wait_for` directly. (Contributed by Andrew Svetlov in :gh:`90927`.)
pt_br: Adicionado :func:`~asyncio.timeout`, um gerenciador de contexto assíncrono para definir um tempo limite em operações assíncronas. Para código novo, é recomendado usar :func:`~asyncio.wait_for` diretamente. (Contribuição de Andrew Svetlov em :gh:`90927`.)

source: Added the :class:`~asyncio.Runner` class, which exposes the machinery used by :func:`~asyncio.run`. (Contributed by Andrew Svetlov in :gh:`91218`.)
pt_br: Adicionada a classe :class:`~asyncio.Runner`, que expõe o maquinário usado por :func:`~asyncio.run`. (Contribuição de Andrew Svetlov em :gh:`91218`.)

source: Added the :class:`~asyncio.Barrier` class to the synchronization primitives in the asyncio library, and the related :exc:`~asyncio.BrokenBarrierError` exception. (Contributed by Yves Duprat and Andrew Svetlov in :gh:`87518`.)
pt_br: Adicionada a classe :class:`~asyncio.Barrier` às primitivas de sincronização na biblioteca asyncio, e a exceção :exc:`~asyncio.BrokenBarrierError` relacionada. (Contribuição de Yves Duprat e Andrew Svetlov em :gh:`87518`.)

source: Added keyword argument *all_errors* to :meth:`asyncio.loop.create_connection` so that multiple connection errors can be raised as an :exc:`ExceptionGroup`.
pt_br: Adicionado o argumento nomeado *all_errors* para :meth:`asyncio.loop.create_connection` para que vários erros de conexão possam ser levantados como :exc:`ExceptionGroup`.

source: Added the :meth:`asyncio.StreamWriter.start_tls` method for upgrading existing stream-based connections to TLS. (Contributed by Ian Good in :issue:`34975`.)
pt_br: Adicionado o método :meth:`asyncio.StreamWriter.start_tls` para atualizar conexões baseadas em fluxo existentes para TLS. (Contribuição de Ian Good em :issue:`34975`.)

source: Added raw datagram socket functions to the event loop: :meth:`~asyncio.loop.sock_sendto`, :meth:`~asyncio.loop.sock_recvfrom` and :meth:`~asyncio.loop.sock_recvfrom_into`. These have implementations in :class:`~asyncio.SelectorEventLoop` and :class:`~asyncio.ProactorEventLoop`. (Contributed by Alex Grönholm in :issue:`46805`.)
pt_br: Adicionadas funções de soquete de datagrama *raw* ao laço de eventos: :meth:`~asyncio.loop.sock_sendto`, :meth:`~asyncio.loop.sock_recvfrom` e :meth:`~asyncio.loop.sock_recvfrom_into`. Eles têm implementações em :class:`~asyncio.SelectorEventLoop` e :class:`~asyncio.ProactorEventLoop`. (Contribuição de Alex Grönholm em :issue:`46805`.)

source: Added :meth:`~asyncio.Task.cancelling` and :meth:`~asyncio.Task.uncancel` methods to :class:`~asyncio.Task`. These are primarily intended for internal use, notably by :class:`~asyncio.TaskGroup`.
pt_br: Adicionados os métodos :meth:`~asyncio.Task.cancelling` e :meth:`~asyncio.Task.uncancel` a :class:`~asyncio.Task`. Estes são destinados principalmente para uso interno, notadamente por :class:`~asyncio.TaskGroup`.

source: Added non parallel-safe :func:`~contextlib.chdir` context manager to change the current working directory and then restore it on exit. Simple wrapper around :func:`~os.chdir`. (Contributed by Filipe Laíns in :issue:`25625`)
pt_br: Adicionado gerenciador de contexto não paralelo seguro :func:`~contextlib.chdir` para alterar o diretório de trabalho atual e depois restaurá-lo na saída. Wrapper simples em torno de :func:`~os.chdir`. (Contribuição de Filipe Laíns em :issue:`25625`)

source: Change field default mutability check, allowing only defaults which are :term:`hashable` instead of any object which is not an instance of :class:`dict`, :class:`list` or :class:`set`. (Contributed by Eric V. Smith in :issue:`44674`.)
pt_br: Alterar a verificação de mutabilidade padrão do campo, permitindo apenas padrões que são :term:`hasheáveis <hashable>` em vez de qualquer objeto que não seja uma instância de :class:`dict`, :class:`list` ou :class:`set`. (Contribuição de Eric V. Smith em :issue:`44674`.)

source: Add :const:`datetime.UTC`, a convenience alias for :attr:`datetime.timezone.utc`. (Contributed by Kabir Kwatra in :gh:`91973`.)
pt_br: Adicione :const:`datetime.UTC`, um apelido de conveniência para :attr:`datetime.timezone.utc`. (Contribuição de Kabir Kwatra em :gh:`91973`.)

source: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` and :meth:`datetime.datetime.fromisoformat` can now be used to parse most ISO 8601 formats (barring only those that support fractional hours and minutes). (Contributed by Paul Ganssle in :gh:`80010`.)
pt_br: :meth:`datetime.date.fromisoformat`, :meth:`datetime.time.fromisoformat` e :meth:`datetime.datetime.fromisoformat` agora podem ser usados para analisar a maioria dos formatos ISO 8601 (exceto aqueles que têm suporte a horas fracionárias e minutos). (Contribuição de Paul Ganssle em :gh:`80010`.)

source: Renamed :class:`!EnumMeta` to :class:`~enum.EnumType` (:class:`!EnumMeta` kept as an alias).
pt_br: Renomeado :class:`!EnumMeta` para :class:`~enum.EnumType` (:class:`!EnumMeta` mantido como um apelido).

source: Added :class:`~enum.StrEnum`, with members that can be used as (and must be) strings.
pt_br: Adicionada :class:`~enum.StrEnum`, com membros que podem ser usados como (e devem ser) strings.

source: Added :class:`~enum.ReprEnum`, which only modifies the :meth:`~object.__repr__` of members while returning their literal values (rather than names) for :meth:`~object.__str__` and :meth:`~object.__format__` (used by :func:`str`, :func:`format` and :term:`f-string`\s).
pt_br: Adicionada :class:`~enum.ReprEnum`, que apenas modifica o :meth:`~object.__repr__` dos membros enquanto retorna seus valores literais (ao invés de nomes) para :meth:`~object.__str__` e :meth:`~object.__format__` (usado por :func:`str`, :func:`format` e :term:`f-string`\s).

source: Changed :meth:`Enum.__format__() <enum.Enum.__format__>` (the default for :func:`format`, :meth:`str.format` and :term:`f-string`\s) to always produce the same result as :meth:`Enum.__str__() <enum.Enum.__str__>`: for enums inheriting from :class:`~enum.ReprEnum` it will be the member's value; for all other enums it will be the enum and member name (e.g. ``Color.RED``).
pt_br: Alterado :meth:`Enum.__format__() <enum.Enum.__format__>` (o padrão para :func:`format`, :meth:`str.format` e :term:`f-string`\s) para sempre produz o mesmo resultado que :meth:`Enum.__str__() <enum.Enum.__str__>`: para enums herdados de :class:`~enum.ReprEnum` será o valor do membro; para todos os outros enums, será o enum e o nome do membro (por exemplo, ``Color.RED``).

source: Added a new *boundary* class parameter to :class:`~enum.Flag` enums and the :class:`~enum.FlagBoundary` enum with its options, to control how to handle out-of-range flag values.
pt_br: Adicionado um novo parâmetro de classe *boundary* para enums :class:`~enum.Flag` e :class:`~enum.FlagBoundary` com suas opções, para controlar como lidar com valores de sinalizadores fora do intervalo.

source: Added the :func:`~enum.verify` enum decorator and the :class:`~enum.EnumCheck` enum with its options, to check enum classes against several specific constraints.
pt_br: Adicionado o decorador de enum :func:`~enum.verify` e o enum :class:`~enum.EnumCheck` com suas opções, para verificar classes de enum em relação a várias restrições específicas.

source: Added the :func:`~enum.member` and :func:`~enum.nonmember` decorators, to ensure the decorated object is/is not converted to an enum member.
pt_br: Adicionados os decoradores :func:`~enum.member` e :func:`~enum.nonmember`, para garantir que o objeto decorado seja/não seja convertido em um membro enum.

source: Added the :func:`~enum.property` decorator, which works like :func:`property` except for enums. Use this instead of :func:`types.DynamicClassAttribute`.
pt_br: Adicionado o decorador :func:`~enum.property`, que funciona como :func:`property` exceto para enums. Use isso em vez de :func:`types.DynamicClassAttribute`.

source: Added the :func:`~enum.global_enum` enum decorator, which adjusts :meth:`~object.__repr__` and :meth:`~object.__str__` to show values as members of their module rather than the enum class. For example, ``'re.ASCII'`` for the :const:`~re.ASCII` member of :class:`re.RegexFlag` rather than ``'RegexFlag.ASCII'``.
pt_br: Adicionado o decorador enum :func:`~enum.global_enum`, que ajusta :meth:`~object.__repr__` e :meth:`~object.__str__` para mostrar valores como membros de seu módulo em vez da classe enum. Por exemplo, ``'re.ASCII'`` para o membro :const:`~re.ASCII` de :class:`re.RegexFlag` em vez de ``'RegexFlag.ASCII'``.

source: Enhanced :class:`~enum.Flag` to support :func:`len`, iteration and :keyword:`in`/:keyword:`not in` on its members. For example, the following now works: ``len(AFlag(3)) == 2 and list(AFlag(3)) == (AFlag.ONE, AFlag.TWO)``
pt_br: Aprimorada :class:`~enum.Flag` para ter suporte a :func:`len`, iteração e :keyword:`in`/:keyword:`not in` em seus membros. Por exemplo, o seguinte agora funciona: ``len(AFlag(3)) == 2 and list(AFlag(3)) == (AFlag.ONE, AFlag.TWO)``

source: Changed :class:`~enum.Enum` and :class:`~enum.Flag` so that members are now defined before :meth:`~object.__init_subclass__` is called; :func:`dir` now includes methods, etc., from mixed-in data types.
pt_br: Alterada :class:`~enum.Enum` e :class:`~enum.Flag` para que os membros sejam agora definidos antes de :meth:`~object.__init_subclass__` ser chamado; :func:`dir` agora inclui métodos, etc., de tipos de dados mistos.
