Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: On Windows 8.1 and newer, :func:`time.sleep` now uses a waitable timer based on `high-resolution timers <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ which has a resolution of 100 nanoseconds (10\ :sup:`-7` seconds). Previously, it had a resolution of 1 millisecond (10\ :sup:`-3` seconds). (Contributed by Benjamin Szőke, Donghee Na, Eryk Sun and Victor Stinner in :issue:`21302` and :issue:`45429`.)
pt_br: No Windows 8.1 e mais recente, :func:`time.sleep` agora usa um temporizador aguardável baseado em `temporizadores de alta resolução <https://docs.microsoft.com/en-us/windows-hardware/drivers/kernel/high-resolution-timers>`_ que tem uma resolução de 100 nanossegundos (10\ :sup:`-7` segundos). Anteriormente, tinha uma resolução de 1 milissegundo (10\ :sup:`-3` segundos). (Contribuição de Benjamin Szőke, Donghee Na, Eryk Sun e Victor Stinner em :issue:`21302` e :issue:`45429`.)

source: Added method ``info_patchlevel()`` which returns the exact version of the Tcl library as a named tuple similar to :data:`sys.version_info`. (Contributed by Serhiy Storchaka in :gh:`91827`.)
pt_br: Adicionado o método ``info_patchlevel()`` que retorna a versão exata da biblioteca Tcl como uma tupla nomeada semelhante a :data:`sys.version_info`. (Contribuição de Serhiy Storchaka em :gh:`91827`.)

source: Add :func:`traceback.StackSummary.format_frame_summary` to allow users to override which frames appear in the traceback, and how they are formatted. (Contributed by Ammar Askar in :issue:`44569`.)
pt_br: Adiciona :func:`traceback.StackSummary.format_frame_summary` para permitir que os usuários substituam quais quadros aparecem no traceback e como eles são formatados. (Contribuição de Ammar Askar em :issue:`44569`.)

source: Add :func:`traceback.TracebackException.print`, which prints the formatted :exc:`~traceback.TracebackException` instance to a file. (Contributed by Irit Katriel in :issue:`33809`.)
pt_br: Adiciona :func:`traceback.TracebackException.print`, que imprime a instância formatada :exc:`~traceback.TracebackException` em um arquivo. (Contribuição de Irit Katriel em :issue:`33809`.)

source: For major changes, see :ref:`new-feat-related-type-hints-311`.
pt_br: Para alterações principais, veja :ref:`new-feat-related-type-hints-311`.

source: Add :func:`typing.assert_never` and :class:`typing.Never`. :func:`typing.assert_never` is useful for asking a type checker to confirm that a line of code is not reachable. At runtime, it raises an :exc:`AssertionError`. (Contributed by Jelle Zijlstra in :gh:`90633`.)
pt_br: Adiciona :func:`typing.assert_never` e :class:`typing.Never`. :func:`typing.assert_never` é útil para pedir a um verificador de tipo para confirmar que uma linha de código não está acessível. Em tempo de execução, ele levanta uma exceção :exc:`AssertionError`. (Contribuição de Jelle Zijlstra em :gh:`90633`.)

source: Add :func:`typing.reveal_type`. This is useful for asking a type checker what type it has inferred for a given expression. At runtime it prints the type of the received value. (Contributed by Jelle Zijlstra in :gh:`90572`.)
pt_br: Adiciona :func:`typing.reveal_type`. Isso é útil para perguntar a um verificador de tipo qual tipo ele inferiu para uma determinada expressão. Em tempo de execução imprime o tipo do valor recebido. (Contribuição de Jelle Zijlstra em :gh:`90572`.)

source: Add :func:`typing.assert_type`. This is useful for asking a type checker to confirm that the type it has inferred for a given expression matches the given type. At runtime it simply returns the received value. (Contributed by Jelle Zijlstra in :gh:`90638`.)
pt_br: Adicione :func:`typing.assert_type`. Isso é útil para solicitar a um verificador de tipos que confirme se o tipo que ele inferiu para uma determinada expressão corresponde ao tipo fornecido. Em tempo de execução ele simplesmente retorna o valor recebido. (Contribuição de Jelle Zijlstra em :gh:`90638`.)

source: :data:`typing.TypedDict` types can now be generic. (Contributed by Samodya Abeysiriwardane in :gh:`89026`.)
pt_br: Os tipos :data:`typing.TypedDict` agora podem ser genéricos. (Contribuição de Samodya Abeysiriwardane em :gh:`89026`.)

source: :class:`~typing.NamedTuple` types can now be generic. (Contributed by Serhiy Storchaka in :issue:`43923`.)
pt_br: Os tipos :class:`~typing.NamedTuple` agora podem ser genéricos. (Contribuição de Serhiy Storchaka em :issue:`43923`.)

source: Allow subclassing of :class:`typing.Any`. This is useful for avoiding type checker errors related to highly dynamic class, such as mocks. (Contributed by Shantanu Jain in :gh:`91154`.)
pt_br: Permite criar subclasse de :class:`typing.Any`. Isso é útil para evitar erros de verificador de tipo relacionados a classes altamente dinâmicas, como mocks. (Contribuição de Shantanu Jain em :gh:`91154`.)

source: The :func:`typing.final` decorator now sets the ``__final__`` attributed on the decorated object. (Contributed by Jelle Zijlstra in :gh:`90500`.)
pt_br: O decorador :func:`typing.final` agora define o ``__final__`` atribuído no objeto decorado. (Contribuição de Jelle Zijlstra em :gh:`90500`.)

source: The :func:`typing.get_overloads` function can be used for introspecting the overloads of a function. :func:`typing.clear_overloads` can be used to clear all registered overloads of a function. (Contributed by Jelle Zijlstra in :gh:`89263`.)
pt_br: A função :func:`typing.get_overloads` pode ser usada para introspecção das sobrecargas de uma função. :func:`typing.clear_overloads` pode ser usado para limpar todas as sobrecargas registradas de uma função. (Contribuição de Jelle Zijlstra em :gh:`89263`.)

source: The :meth:`~object.__init__` method of :class:`~typing.Protocol` subclasses is now preserved. (Contributed by Adrian Garcia Badarasco in :gh:`88970`.)
pt_br: O método :meth:`~object.__init__` das subclasses :class:`~typing.Protocol` agora é preservado. (Contribuição de Adrian Garcia Badarasco em :gh:`88970`.)

source: The representation of empty tuple types (``Tuple[()]``) is simplified. This affects introspection, e.g. ``get_args(Tuple[()])`` now evaluates to ``()`` instead of ``((),)``. (Contributed by Serhiy Storchaka in :gh:`91137`.)
pt_br: A representação de tipos de tupla vazias (``Tuple[()]``) está simplificada. Isso afeta a introspecção, por exemplo. ``get_args(Tuple[()])`` agora é avaliado como ``()`` em vez de ``((),)``. (Contribuição de Serhiy Storchaka em :gh:`91137`.)

source: Loosen runtime requirements for type annotations by removing the callable check in the private ``typing._type_check`` function. (Contributed by Gregory Beauregard in :gh:`90802`.)
pt_br: Afrouxa os requisitos de tempo de execução para anotações de tipo removendo a verificação chamável na função privada ``typing._type_check``. (Contribuição de Gregory Beauregard em :gh:`90802`.)

source: :func:`typing.get_type_hints` now supports evaluating strings as forward references in :ref:`PEP 585 generic aliases <types-genericalias>`. (Contributed by Niklas Rosenstein in :gh:`85542`.)
pt_br: :func:`typing.get_type_hints` agora tem suporte à avaliação de strings como referências diretas em :ref:`apelidos genéricos da PEP 585 <types-genericalias>`. (Contribuição de Niklas Rosenstein em :gh:`85542`.)

source: :func:`typing.get_type_hints` no longer adds :data:`~typing.Optional` to parameters with ``None`` as a default. (Contributed by Nikita Sobolev in :gh:`90353`.)
pt_br: :func:`typing.get_type_hints` não adiciona mais :data:`~typing.Optional` aos parâmetros com ``None`` como padrão. (Contribuição de Nikita Sobolev em :gh:`90353`.)

source: :func:`typing.get_type_hints` now supports evaluating bare stringified :data:`~typing.ClassVar` annotations. (Contributed by Gregory Beauregard in :gh:`90711`.)
pt_br: :func:`typing.get_type_hints` agora tem suporte à avaliação de anotações :data:`~typing.ClassVar` de strings simples. (Contribuição de Gregory Beauregard em :gh:`90711`.)

source: :func:`typing.no_type_check` no longer modifies external classes and functions. It also now correctly marks classmethods as not to be type checked. (Contributed by Nikita Sobolev in :gh:`90729`.)
pt_br: :func:`typing.no_type_check` não modifica mais classes e funções externas. Agora também marca corretamente os métodos de classe para não serem verificados quanto ao tipo. (Contribuição de Nikita Sobolev em :gh:`90729`.)

source: The Unicode database has been updated to version 14.0.0. (Contributed by Benjamin Peterson in :issue:`45190`).
pt_br: O banco de dados Unicode foi atualizado para a versão 14.0.0. (Contribuição de Benjamin Peterson em :issue:`45190`).

source: Added methods :meth:`~unittest.TestCase.enterContext` and :meth:`~unittest.TestCase.enterClassContext` of class :class:`~unittest.TestCase`, method :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` of class :class:`~unittest.IsolatedAsyncioTestCase` and function :func:`unittest.enterModuleContext`. (Contributed by Serhiy Storchaka in :issue:`45046`.)
pt_br: Adicionados os métodos :meth:`~unittest.TestCase.enterContext` e :meth:`~unittest.TestCase.enterClassContext` da classe :class:`~unittest.TestCase`, método :meth:`~unittest.IsolatedAsyncioTestCase.enterAsyncContext` da classe :class:`~unittest.IsolatedAsyncioTestCase` e a função :func:`unittest.enterModuleContext`. (Contribuição de Serhiy Storchaka em :issue:`45046`.)

source: When new Python virtual environments are created, the *venv* :ref:`sysconfig installation scheme <installation_paths>` is used to determine the paths inside the environment. When Python runs in a virtual environment, the same installation scheme is the default. That means that downstream distributors can change the default sysconfig install scheme without changing behavior of virtual environments. Third party code that also creates new virtual environments should do the same. (Contributed by Miro Hrončok in :issue:`45413`.)
pt_br: Quando novos ambientes virtuais Python são criados, o :ref:`esquema de instalação do sysconfig <installation_paths>` do *venv* é usado para determinar os caminhos dentro do ambiente. Quando o Python é executado em um ambiente virtual, o mesmo esquema de instalação é o padrão. Isso significa que os distribuidores downstream podem alterar o esquema de instalação padrão do sysconfig sem alterar o comportamento dos ambientes virtuais. O código de terceiros que também cria novos ambientes virtuais deve fazer o mesmo. (Contribuição de Miro Hrončok em :issue:`45413`.)

source: :func:`warnings.catch_warnings` now accepts arguments for :func:`warnings.simplefilter`, providing a more concise way to locally ignore warnings or convert them to errors. (Contributed by Zac Hatfield-Dodds in :issue:`47074`.)
pt_br: :func:`warnings.catch_warnings` agora aceita argumentos para :func:`warnings.simplefilter`, fornecendo uma maneira mais concisa de ignorar localmente avisos ou convertê-los em erros. (Contribuição de Zac Hatfield-Dodds em :issue:`47074`.)

source: Added support for specifying member name encoding for reading metadata in a :class:`~zipfile.ZipFile`'s directory and file headers. (Contributed by Stephen J. Turnbull and Serhiy Storchaka in :issue:`28080`.)
pt_br: Adicionado suporte para especificar a codificação de nome de membro para leitura de metadados em um diretório :class:`~zipfile.ZipFile` e cabeçalhos de arquivo. (Contribuição de Stephen J. Turnbull e Serhiy Storchaka em :issue:`28080`.)

source: Added :meth:`ZipFile.mkdir() <zipfile.ZipFile.mkdir>` for creating new directories inside ZIP archives. (Contributed by Sam Ezeh in :gh:`49083`.)
pt_br: Adicionado :meth:`ZipFile.mkdir() <zipfile.ZipFile.mkdir>` para criar novos diretórios dentro de arquivos ZIP. (Contribuição de Sam Ezeh em :gh:`49083`.)

source: Added :attr:`~zipfile.Path.stem`, :attr:`~zipfile.Path.suffix` and :attr:`~zipfile.Path.suffixes` to :class:`zipfile.Path`. (Contributed by Miguel Brito in :gh:`88261`.)
pt_br: Adicionado :attr:`~zipfile.Path.stem`, :attr:`~zipfile.Path.suffix` e :attr:`~zipfile.Path.suffixes` a :class:`zipfile.Path`. (Contribuição de Miguel Brito em :gh:`88261`.)

source: Optimizations
pt_br: Otimizações

source: This section covers specific optimizations independent of the :ref:`whatsnew311-faster-cpython` project, which is covered in its own section.
pt_br: Esta seção cobre otimizações específicas independentes do projeto :ref:`whatsnew311-faster-cpython`, que é abordado em sua própria seção.

source: The compiler now optimizes simple :ref:`printf-style % formatting <old-string-formatting>` on string literals containing only the format codes ``%s``, ``%r`` and ``%a`` and makes it as fast as a corresponding :term:`f-string` expression. (Contributed by Serhiy Storchaka in :issue:`28307`.)
pt_br: O compilador agora otimiza a :ref:`formatação simples de % no estilo printf <old-string-formatting>` em literais de string contendo apenas os códigos de formato ``%s``, ``%r`` e ``%a`` e a torna tão rápida quanto uma expressão :term:`f-string` correspondente. (Contribuição de Serhiy Storchaka em :issue:`28307`.)

source: Integer division (``//``) is better tuned for optimization by compilers. It is now around 20% faster on x86-64 when dividing an :class:`int` by a value smaller than ``2**30``. (Contributed by Gregory P. Smith and Tim Peters in :gh:`90564`.)
pt_br: A divisão inteira (``//``) é melhor ajustada para otimização por compiladores. Agora é cerca de 20% mais rápido em x86-64 ao dividir um :class:`int` por um valor menor que ``2**30``. (Contribuição de Gregory P. Smith e Tim Peters em :gh:`90564`.)

source: :func:`sum` is now nearly 30% faster for integers smaller than ``2**30``. (Contributed by Stefan Behnel in :gh:`68264`.)
pt_br: :func:`sum` agora é quase 30% mais rápida para inteiros menores que ``2**30``. (Contribuição de Stefan Behnel em :gh:`68264`.)

source: Dictionaries don't store hash values when all keys are Unicode objects, decreasing :class:`dict` size. For example, ``sys.getsizeof(dict.fromkeys("abcdefg"))`` is reduced from 352 bytes to 272 bytes (23% smaller) on 64-bit platforms. (Contributed by Inada Naoki in :issue:`46845`.)
pt_br: Dicionários não armazenam valores de hash quando todas as chaves são objetos Unicode, diminuindo o tamanho de :class:`dict`. Por exemplo, ``sys.getsizeof(dict.fromkeys("abcdefg"))`` foi reduzido de 352 bytes para 272 bytes (23% menor) em plataformas de 64 bits. (Contribuição de Inada Naoki em :issue:`46845`.)

source: Using :class:`asyncio.DatagramProtocol` is now orders of magnitude faster when transferring large files over UDP, with speeds over 100 times higher for a ≈60 MiB file. (Contributed by msoxzw in :gh:`91487`.)
pt_br: Usar :class:`asyncio.DatagramProtocol` agora é muito mais rápido ao transferir arquivos grandes por UDP, com velocidades mais de 100 vezes maiores para um arquivo de ≈60 MiB. (Contribuição de msoxzw em :gh:`91487`.)

source: :mod:`math` functions :func:`~math.comb` and :func:`~math.perm` are now ≈10 times faster for large arguments (with a larger speedup for larger *k*). (Contributed by Serhiy Storchaka in :issue:`37295`.)
pt_br: As funções :func:`~math.comb` e :func:`~math.perm` de :mod:`math` são agora ≈10 vezes mais rápidas para argumentos grandes (com uma aceleração maior para *k* maiores). (Contribuição de Serhiy Storchaka em :issue:`37295`.)

source: The :mod:`statistics` functions :func:`~statistics.mean`, :func:`~statistics.variance` and :func:`~statistics.stdev` now consume iterators in one pass rather than converting them to a :class:`list` first. This is twice as fast and can save substantial memory. (Contributed by Raymond Hettinger in :gh:`90415`.)
pt_br: As funções :func:`~statistics.mean`, :func:`~statistics.variance` e :func:`~statistics.stdev` do :mod:`statistics` agora consomem iteradores em uma passagem em vez de convertê-los em uma :class:`list` primeiro. Isso é duas vezes mais rápido e pode economizar memória de forma substancial. (Contribuição de Raymond Hettinger em :gh:`90415`.)

source: :func:`unicodedata.normalize` now normalizes pure-ASCII strings in constant time. (Contributed by Donghee Na in :issue:`44987`.)
pt_br: :func:`unicodedata.normalize` agora normaliza strings de puro ASCII em tempo constante. (Contribuição de Dong-hee Na em :issue:`44987`.)

source: Faster CPython
pt_br: CPython mais rápido

source: CPython 3.11 is an average of `25% faster <https://github.com/faster-cpython/ideas#published-results>`_ than CPython 3.10 as measured with the `pyperformance <https://github.com/python/pyperformance>`_ benchmark suite, when compiled with GCC on Ubuntu Linux. Depending on your workload, the overall speedup could be 10-60%.
pt_br: O CPython 3.11 é em média `25% mais rápido <https://github.com/faster-cpython/ideas#published-results>`_ que o CPython 3.10 medido com o conjunto de ferramentas de benchmarks `pyperformance <https://github.com/python/pyperformance>`_, quando compilado com GCC no Ubuntu Linux. Dependendo da sua carga de trabalho, a aceleração geral pode ser de 10 a 60%.

source: This project focuses on two major areas in Python: :ref:`whatsnew311-faster-startup` and :ref:`whatsnew311-faster-runtime`. Optimizations not covered by this project are listed separately under :ref:`whatsnew311-optimizations`.
pt_br: Este projeto se concentra em duas áreas principais em Python: :ref:`whatsnew311-faster-startup` e :ref:`whatsnew311-faster-runtime`. Otimizações que não são abordadas neste projeto estão listadas em :ref:`whatsnew311-optimizations`.

source: Faster Startup
pt_br: Inicialização mais rápida

source: Frozen imports / Static code objects
pt_br: Importações congeladas/objetos de código estático

source: Python caches :term:`bytecode` in the :ref:`__pycache__ <tut-pycache>` directory to speed up module loading.
pt_br: O Python armazena o :term:`bytecode` no diretório :ref:`__pycache__ <tut-pycache>` para acelerar o carregamento do módulo.

source: Previously in 3.10, Python module execution looked like this:
pt_br: Anteriormente na versão 3.10, a execução do módulo Python era assim:

source: In Python 3.11, the core modules essential for Python startup are "frozen". This means that their :ref:`codeobjects` (and bytecode) are statically allocated by the interpreter. This reduces the steps in module execution process to:
pt_br: No Python 3.11, os principais módulos essenciais para a inicialização do Python são "congelados". Isso significa que seus :ref:`codeobjects` (e bytecode) são alocados estaticamente pelo interpretador. Isso reduz as etapas no processo de execução do módulo para isso:

source: Interpreter startup is now 10-15% faster in Python 3.11. This has a big impact for short-running programs using Python.
pt_br: A inicialização do interpretador agora é 10-15% mais rápida no Python 3.11. Isso tem um grande impacto para programas de execução curta usando Python.

source: (Contributed by Eric Snow, Guido van Rossum and Kumar Aditya in many issues.)
pt_br: (Contribuição de Eric Snow, Guido van Rossum e Kumar Aditya em vários issues.)

source: Faster Runtime
pt_br: Tempo de execução mais rápido

source: Cheaper, lazy Python frames
pt_br: Quadros Python menos custosos e mais preguiçosos

source: Python frames, holding execution information, are created whenever Python calls a Python function. The following are new frame optimizations:
pt_br: Os quadros do Python, contendo informações de execução, são criados sempre que o Python chama uma função do Python. A seguir estão as novas otimizações de quadro:

source: Streamlined the frame creation process.
pt_br: Simplificado o processo de criação do quadro.

source: Avoided memory allocation by generously re-using frame space on the C stack.
pt_br: Alocação de memória evitada reutilizando generosamente o espaço do quadro na pilha C.

source: Streamlined the internal frame struct to contain only essential information. Frames previously held extra debugging and memory management information.
pt_br: Simplificada a estrutura interna do quadro para conter apenas as informações essenciais. Os quadros anteriormente continham informações extras de depuração e gerenciamento de memória.

source: Old-style :ref:`frame objects <frame-objects>` are now created only when requested by debuggers or by Python introspection functions such as :func:`sys._getframe` and :func:`inspect.currentframe`. For most user code, no frame objects are created at all. As a result, nearly all Python functions calls have sped up significantly. We measured a 3-7% speedup in pyperformance.
pt_br: Os antigos :ref:`objetos quadros <frame-objects>` agora são criados apenas quando solicitados por depuradores ou por funções de introspecção do Python, como :func:`sys._getframe` e :func:`inspect.currentframe`. Para a maioria dos códigos de usuário, nenhum objeto quadro é criado. Como resultado, quase todas as chamadas de funções do Python aceleraram significativamente. Medimos uma aceleração de 3 a 7% no desempenho do py.

source: (Contributed by Mark Shannon in :issue:`44590`.)
pt_br: (Contribuição de Mark Shannon em :issue:`44590`.)

source: Inlined Python function calls
pt_br: Chamadas de função Python em linha

source: During a Python function call, Python will call an evaluating C function to interpret that function's code. This effectively limits pure Python recursion to what's safe for the C stack.
pt_br: Durante a chamada de uma função Python, o Python chamará uma função C de avaliação para interpretar o código dessa função. Isso efetivamente limita a recursão Python pura ao que é seguro para a pilha C.

source: In 3.11, when CPython detects Python code calling another Python function, it sets up a new frame, and "jumps" to the new code inside the new frame. This avoids calling the C interpreting function altogether.
pt_br: No 3.11, quando o CPython detecta o código Python chamando outra função Python, ele configura um novo quadro e "pula" para o novo código dentro do novo quadro. Isso evita chamar a função de interpretação C completamente.

source: Most Python function calls now consume no C stack space, speeding them up. In simple recursive functions like fibonacci or factorial, we observed a 1.7x speedup. This also means recursive functions can recurse significantly deeper (if the user increases the recursion limit with :func:`sys.setrecursionlimit`). We measured a 1-3% improvement in pyperformance.
pt_br: A maioria das chamadas de função do Python agora não consome espaço de pilha C, acelerando-as. Em funções recursivas simples como fibonacci ou fatorial, observamos um aumento de velocidade de 1,7x. Isso também significa que as funções recursivas podem recursar significativamente mais profundamente (se o usuário aumentar o limite de recursão com :func:`sys.setrecursionlimit`). Medimos uma melhoria de 1 a 3% no desempenho do py.

source: (Contributed by Pablo Galindo and Mark Shannon in :issue:`45256`.)
pt_br: (Contribuição de Pablo Galindo e Mark Shannon em :issue:`45256`.)

source: PEP 659: Specializing Adaptive Interpreter
pt_br: PEP 659: Interpretador adaptativo especializado

source: :pep:`659` is one of the key parts of the Faster CPython project. The general idea is that while Python is a dynamic language, most code has regions where objects and types rarely change. This concept is known as *type stability*.
pt_br: :pep:`659` é uma das partes principais do projeto Faster CPython. A ideia geral é que, embora o Python seja uma linguagem dinâmica, a maior parte do código possui regiões onde objetos e tipos raramente mudam. Este conceito é conhecido como *estabilidade de tipo*.
