Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: The :c:macro:`!Py_NO_NAN` macro has been removed. Since CPython now requires IEEE 754 floats, NaN values are always available. (Contributed by Victor Stinner in :issue:`46656`.)
pt_br: A macro :c:macro:`!Py_NO_NAN` foi removida. Como o CPython agora requer pontos flutuantes de IEEE 754, os valores NaN estão sempre disponíveis. (Contribuição de Victor Stinner em :issue:`46656`.)

source: The :mod:`tkinter` package now requires `Tcl/Tk <https://www.tcl.tk>`_ version 8.5.12 or newer. (Contributed by Serhiy Storchaka in :issue:`46996`.)
pt_br: O pacote :mod:`tkinter` agora requer `Tcl/Tk <https://www.tcl.tk>`_ versão 8.5.12 ou mais recente. (Contribuição de Serhiy Storchaka em :issue:`46996`.)

source: Build dependencies, compiler flags, and linker flags for most stdlib extension modules are now detected by :program:`configure`. libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk, and uuid flags are detected by `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ (when available). :mod:`tkinter` now requires a pkg-config command to detect development settings for `Tcl/Tk`_ headers and libraries. (Contributed by Christian Heimes and Erlend Egeberg Aasland in :issue:`45847`, :issue:`45747`, and :issue:`45763`.)
pt_br: Dependências de construção, sinalizadores de compilador e sinalizadores de vinculador para a maioria dos módulos de extensão stdlib agora são detectados pelo :program:`configure`. Os sinalizadores, ou *flags*, de libffi, libnsl, libsqlite3, zlib, bzip2, liblzma, libcrypt, Tcl/Tk e uuid são detectados por `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ (Quando disponível). :mod:`tkinter` agora requer um comando pkg-config para detectar configurações de desenvolvimento para cabeçalhos e bibliotecas `Tcl/Tk`_. (Contribuição de Christian Heimes e Erlend Egeberg Aasland em :issue:`45847`, :issue:`45747` e :issue:`45763`.)

source: libpython is no longer linked against libcrypt. (Contributed by Mike Gilbert in :issue:`45433`.)
pt_br: libpython não está mais vinculado a libcrypt. (Contribuição de Mike Gilbert em :issue:`45433`.)

source: CPython can now be built with the `ThinLTO <https://clang.llvm.org/docs/ThinLTO.html>`_ option via passing ``thin`` to :option:`--with-lto`, i.e. ``--with-lto=thin``. (Contributed by Donghee Na and Brett Holman in :issue:`44340`.)
pt_br: O CPython agora pode ser construído com a opção `ThinLTO <https://clang.llvm.org/docs/ThinLTO.html>`_ passando ``thin`` para :option:`--with-lto`, ou seja, ``--with-lto=thin``. (Contribuição de Donghee Na e Brett Holman em :issue:`44340`.)

source: Freelists for object structs can now be disabled. A new :program:`configure` option ``--without-freelists`` can be used to disable all freelists except empty tuple singleton. (Contributed by Christian Heimes in :issue:`45522`.)
pt_br: Freelists para structs de objeto agora podem ser desabilitadas. Uma nova opção ``--without-freelists`` do :program:`configure` pode ser usada para desabilitar todas as freelists, exceto a tupla singleton vazia. (Contribuição de Christian Heimes em :issue:`45522`.)

source: ``Modules/Setup`` and ``Modules/makesetup`` have been improved and tied up. Extension modules can now be built through ``makesetup``. All except some test modules can be linked statically into a main binary or library. (Contributed by Brett Cannon and Christian Heimes in :issue:`45548`, :issue:`45570`, :issue:`45571`, and :issue:`43974`.)
pt_br: ``Modules/Setup`` e ``Modules/makesetup`` foram melhorados e amarrados. Módulos de extensão agora podem ser construídos através do ``makesetup``. Todos, exceto alguns módulos de teste, podem ser vinculados estaticamente em um binário principal ou biblioteca. (Contribuição de Brett Cannon e Christian Heimes em :issue:`45548`, :issue:`45570`, :issue:`45571` e :issue:`43974`.)

source: Use the environment variables :envvar:`!TCLTK_CFLAGS` and :envvar:`!TCLTK_LIBS` to manually specify the location of Tcl/Tk headers and libraries. The :program:`configure` options :option:`!--with-tcltk-includes` and :option:`!--with-tcltk-libs` have been removed.
pt_br: Use as variáveis de ambiente :envvar:`!TCLTK_CFLAGS` e :envvar:`!TCLTK_LIBS` para especificar manualmente a localização dos cabeçalhos e bibliotecas Tcl/Tk. As opções :program:`configure` :option:`!--with-tcltk-includes` e :option:`!--with-tcltk-libs` foram removidas.

source: On RHEL 7 and CentOS 7 the development packages do not provide ``tcl.pc`` and ``tk.pc``; use ``TCLTK_LIBS="-ltk8.5 -ltkstub8.5 -ltcl8.5"``. The directory ``Misc/rhel7`` contains ``.pc`` files and instructions on how to build Python with RHEL 7's and CentOS 7's Tcl/Tk and OpenSSL.
pt_br: No RHEL 7 e CentOS 7 os pacotes de desenvolvimento não fornecem ``tcl.pc`` e ``tk.pc``; use ``TCLTK_LIBS="-ltk8.5 -ltkstub8.5 -ltcl8.5"``. O diretório ``Misc/rhel7`` contém arquivos ``.pc`` e instruções sobre como construir Python com RHEL 7's e CentOS 7's Tcl/Tk e OpenSSL.

source: CPython will now use 30-bit digits by default for the Python :class:`int` implementation. Previously, the default was to use 30-bit digits on platforms with ``SIZEOF_VOID_P >= 8``, and 15-bit digits otherwise. It's still possible to explicitly request use of 15-bit digits via either the :option:`--enable-big-digits` option to the configure script or (for Windows) the ``PYLONG_BITS_IN_DIGIT`` variable in ``PC/pyconfig.h``, but this option may be removed at some point in the future. (Contributed by Mark Dickinson in :issue:`45569`.)
pt_br: O CPython agora usará dígitos de 30 bits por padrão para a implementação de :class:`int` do Python. Anteriormente, o padrão era usar dígitos de 30 bits em plataformas com ``SIZEOF_VOID_P >= 8`` e, caso contrário, dígitos de 15 bits. Ainda é possível solicitar explicitamente o uso de dígitos de 15 bits através da opção :option:`--enable-big-digits` para o script de configuração ou (para Windows) a variável ``PYLONG_BITS_IN_DIGIT`` em ``PC/pyconfig.h``, mas esta opção pode ser removida em algum momento no futuro. (Contribuição de Mark Dickinson em :issue:`45569`.)

source: C API Changes
pt_br: Alterações na API C

source: Add a new :c:func:`PyType_GetName` function to get type's short name. (Contributed by Hai Shi in :issue:`42035`.)
pt_br: Adiciona uma nova função :c:func:`PyType_GetName` para obter o nome curto do tipo. (Contribuição de Hai Shi em :issue:`42035`.)

source: Add a new :c:func:`PyType_GetQualName` function to get type's qualified name. (Contributed by Hai Shi in :issue:`42035`.)
pt_br: Adiciona uma nova função :c:func:`PyType_GetQualName` para obter o nome qualificado do tipo. (Contribuição de Hai Shi em :issue:`42035`.)

source: Add new :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` functions to the limited C API to suspend and resume tracing and profiling. (Contributed by Victor Stinner in :issue:`43760`.)
pt_br: Adiciona novas funções :c:func:`PyThreadState_EnterTracing` e :c:func:`PyThreadState_LeaveTracing` à API C limitada para suspender e retomar rastreamento e criação de perfil. (Contribuição de Victor Stinner em :issue:`43760`.)

source: Added the :c:data:`Py_Version` constant which bears the same value as :c:macro:`PY_VERSION_HEX`. (Contributed by Gabriele N. Tornetta in :issue:`43931`.)
pt_br: Adicionada a constante :c:data:`Py_Version` que possui o mesmo valor que :c:macro:`PY_VERSION_HEX`. (Contribuição de Gabriele N. Tornetta em :issue:`43931`.)

source: :c:type:`Py_buffer` and APIs are now part of the limited API and the stable ABI:
pt_br: :c:type:`Py_buffer` e APIs agora fazem parte da API limitada e da ABI estável:

source: :c:member:`~PyBufferProcs.bf_getbuffer` and :c:member:`~PyBufferProcs.bf_releasebuffer` type slots
pt_br: Slotes de tipo :c:member:`~PyBufferProcs.bf_getbuffer` e :c:member:`~PyBufferProcs.bf_releasebuffer`

source: (Contributed by Christian Heimes in :issue:`45459`.)
pt_br: (Contribuição de Christian Heimes em :issue:`45459`.)

source: Added the :c:func:`PyType_GetModuleByDef` function, used to get the module in which a method was defined, in cases where this information is not available directly (via :c:type:`PyCMethod`). (Contributed by Petr Viktorin in :issue:`46613`.)
pt_br: Adicionada a função :c:func:`PyType_GetModuleByDef`, utilizada para obter o módulo no qual um método foi definido, nos casos em que esta informação não está disponível diretamente (via :c:type:`PyCMethod`). (Contribuição de Petr Viktorin em :issue:`46613`.)

source: Add new functions to pack and unpack C double (serialize and deserialize): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2`, :c:func:`PyFloat_Unpack4` and :c:func:`PyFloat_Unpack8`. (Contributed by Victor Stinner in :issue:`46906`.)
pt_br: Adiciona novas funções para compactar e desempacotar double C (serializar e desserializar): :c:func:`PyFloat_Pack2`, :c:func:`PyFloat_Pack4`, :c:func:`PyFloat_Pack8`, :c:func:`PyFloat_Unpack2` , :c:func:`PyFloat_Unpack4` e :c:func:`PyFloat_Unpack8`. (Contribuição de Victor Stinner em :issue:`46906`.)

source: Add new functions to get frame object attributes: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.
pt_br: Adiciona novas funções para obter atributos do objeto quadro: :c:func:`PyFrame_GetBuiltins`, :c:func:`PyFrame_GetGenerator`, :c:func:`PyFrame_GetGlobals`, :c:func:`PyFrame_GetLasti`.

source: Added two new functions to get and set the active exception instance: :c:func:`PyErr_GetHandledException` and :c:func:`PyErr_SetHandledException`. These are alternatives to :c:func:`PyErr_SetExcInfo()` and :c:func:`PyErr_GetExcInfo()` which work with the legacy 3-tuple representation of exceptions. (Contributed by Irit Katriel in :issue:`46343`.)
pt_br: Adicionadas duas novas funções para obter e definir a instância de exceção ativa: :c:func:`PyErr_GetHandledException` e :c:func:`PyErr_SetHandledException`. Estas são alternativas para :c:func:`PyErr_SetExcInfo()` e :c:func:`PyErr_GetExcInfo()` que funcionam com a representação de tuplas de 3 elementos legadas de exceções. (Contribuição de Irit Katriel em :issue:`46343`.)

source: Added the :c:member:`PyConfig.safe_path` member. (Contributed by Victor Stinner in :gh:`57684`.)
pt_br: Adicionada o membro :c:member:`PyConfig.safe_path`. (Contribuição de Victor Stinner em :gh:`57684`.)

source: Some macros have been converted to static inline functions to avoid `macro pitfalls <https://gcc.gnu.org/onlinedocs/cpp/Macro-Pitfalls.html>`_. The change should be mostly transparent to users, as the replacement functions will cast their arguments to the expected types to avoid compiler warnings due to static type checks. However, when the limited C API is set to >=3.11, these casts are not done, and callers will need to cast arguments to their expected types. See :pep:`670` for more details. (Contributed by Victor Stinner and Erlend E. Aasland in :gh:`89653`.)
pt_br: Algumas macros foram convertidas em funções inline estáticas para evitar `armadilhas de macro <https://gcc.gnu.org/onlinedocs/cpp/Macro-Pitfalls.html>`_. A alteração deve ser transparente para os usuários, pois as funções de substituição converterão seus argumentos para os tipos esperados para evitar avisos do compilador devido a verificações de tipo estático. No entanto, quando a API C limitada é definida como >=3.11, essas conversões não são feitas e os chamadores precisarão converter argumentos para seus tipos esperados. Veja :pep:`670` para mais detalhes. (Contribuição de Victor Stinner e Erlend E. Aasland em :gh:`89653`.)

source: :c:func:`PyErr_SetExcInfo()` no longer uses the ``type`` and ``traceback`` arguments, the interpreter now derives those values from the exception instance (the ``value`` argument). The function still steals references of all three arguments. (Contributed by Irit Katriel in :issue:`45711`.)
pt_br: :c:func:`PyErr_SetExcInfo()` não usa mais os argumentos ``type`` e ``traceback``, o interpretador agora deriva esses valores da instância de exceção (o argumento ``value``). A função ainda rouba referências de todos os três argumentos. (Contribuição de Irit Katriel em :issue:`45711`.)

source: :c:func:`PyErr_GetExcInfo()` now derives the ``type`` and ``traceback`` fields of the result from the exception instance (the ``value`` field). (Contributed by Irit Katriel in :issue:`45711`.)
pt_br: :c:func:`PyErr_GetExcInfo()` agora deriva os campos ``type`` e ``traceback`` do resultado da instância de exceção (o campo ``value``). (Contribuição de Irit Katriel em :issue:`45711`.)

source: :c:struct:`_frozen` has a new ``is_package`` field to indicate whether or not the frozen module is a package. Previously, a negative value in the ``size`` field was the indicator. Now only non-negative values be used for ``size``. (Contributed by Kumar Aditya in :issue:`46608`.)
pt_br: :c:struct:`_frozen` tem um novo campo ``is_package`` para indicar se o módulo frozen é ou não um pacote. Anteriormente, um valor negativo no campo ``size`` era o indicador. Agora apenas valores não negativos serão usados para ``size``. (Contribuição de Kumar Aditya em :issue:`46608`.)

source: :c:func:`_PyFrameEvalFunction` now takes ``_PyInterpreterFrame*`` as its second parameter, instead of ``PyFrameObject*``. See :pep:`523` for more details of how to use this function pointer type.
pt_br: :c:func:`_PyFrameEvalFunction` agora usa ``_PyInterpreterFrame*`` como seu segundo parâmetro, em vez de ``PyFrameObject*``. Veja :pep:`523` para mais detalhes de como usar este tipo de ponteiro de função.

source: :c:func:`!PyCode_New` and :c:func:`!PyCode_NewWithPosOnlyArgs` now take an additional ``exception_table`` argument. Using these functions should be avoided, if at all possible. To get a custom code object: create a code object using the compiler, then get a modified version with the ``replace`` method.
pt_br: :c:func:`!PyCode_New` e :c:func:`!PyCode_NewWithPosOnlyArgs` agora recebem um argumento adicional ``exception_table``. O uso dessas funções deve ser evitado, se possível. Para obter um objeto código personalizado: crie um objeto código usando o compilador e obtenha uma versão modificada com o método ``replace``.

source: :c:type:`PyCodeObject` no longer has the ``co_code``, ``co_varnames``, ``co_cellvars`` and ``co_freevars`` fields. Instead, use :c:func:`PyCode_GetCode`, :c:func:`PyCode_GetVarnames`, :c:func:`PyCode_GetCellvars` and :c:func:`PyCode_GetFreevars` respectively to access them via the C API. (Contributed by Brandt Bucher in :issue:`46841` and Ken Jin in :gh:`92154` and :gh:`94936`.)
pt_br: :c:type:`PyCodeObject` não possui mais os campos ``co_code``, ``co_varnames``, ``co_cellvars`` e ``co_freevars``. Em vez disso, use :c:func:`PyCode_GetCode`, :c:func:`PyCode_GetVarnames`, :c:func:`PyCode_GetCellvars` e :c:func:`PyCode_GetFreevars` respectivamente para acessá-los por meio da API C. (Contribuição de Brandt Bucher em :issue:`46841` e Ken Jin em :gh:`92154` e :gh:`94936`.)

source: The old trashcan macros (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) are now deprecated. They should be replaced by the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``.
pt_br: As antigas macros trashcan (``Py_TRASHCAN_SAFE_BEGIN``/``Py_TRASHCAN_SAFE_END``) foram descontinuadas. Elas devem ser substituídas pelas novas macros ``Py_TRASHCAN_BEGIN`` e ``Py_TRASHCAN_END``.

source: A tp_dealloc function that has the old macros, such as::
pt_br: Uma função tp_dealloc que possui as macros antigas, como::

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }
pt_br: static void dealocador_de_meutipo(meutipo *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }

source: should migrate to the new macros as follows::
pt_br: deve migrar para as novas macros da seguinte forma::

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, mytype_dealloc) ... Py_TRASHCAN_END }
pt_br: static void dealocador_de_meutipo(meutipo *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, dealocador_de_meutipo); ... Py_TRASHCAN_END }

source: Note that ``Py_TRASHCAN_BEGIN`` has a second argument which should be the deallocation function it is in.
pt_br: Observe que ``Py_TRASHCAN_BEGIN`` tem um segundo argumento que deve ser a função de desalocação em que está.

source: To support older Python versions in the same codebase, you can define the following macros and use them throughout the code (credit: these were copied from the ``mypy`` codebase)::
pt_br: Para oferecer suporte a versões mais antigas do Python na mesma base de código, você pode definir as seguintes macros e usá-las em todo o código (crédito: elas foram copiadas da base de código do ``mypy``)::

source: The :c:func:`PyType_Ready` function now raises an error if a type is defined with the :c:macro:`Py_TPFLAGS_HAVE_GC` flag set but has no traverse function (:c:member:`PyTypeObject.tp_traverse`). (Contributed by Victor Stinner in :issue:`44263`.)
pt_br: A função :c:func:`PyType_Ready` agora levanta um erro se um tipo é definido com o sinalizador :c:macro:`Py_TPFLAGS_HAVE_GC` definido, mas não tem função transversal (:c:member:`PyTypeObject.tp_traverse`). (Contribuição de Victor Stinner em :issue:`44263`.)

source: Heap types with the :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` flag can now inherit the :pep:`590` vectorcall protocol. Previously, this was only possible for :ref:`static types <static-types>`. (Contributed by Erlend E. Aasland in :issue:`43908`)
pt_br: Tipos de heap com o sinalizador :c:macro:`Py_TPFLAGS_IMMUTABLETYPE` agora podem herdar o protocolo vectorcall da :pep:`590`. Anteriormente, isso só era possível para :ref:`tipos estáticos <static-types>`. (Contribuição de Erlend E. Aasland em :issue:`43908`)

source: Since :c:func:`Py_TYPE()` is changed to a inline static function, ``Py_TYPE(obj) = new_type`` must be replaced with ``Py_SET_TYPE(obj, new_type)``: see the :c:func:`Py_SET_TYPE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
pt_br: Uma vez que :c:func:`Py_TYPE()` é alterada para uma função estática inline, ``Py_TYPE(obj) = new_type`` deve ser substituído por ``Py_SET_TYPE(obj, new_type)``: consulte a função :c:func:`Py_SET_TYPE()` (disponível desde Python 3.9). Para compatibilidade com versões anteriores, esta macro pode ser usada::

source: (Contributed by Victor Stinner in :issue:`39573`.)
pt_br: (Contribuição de Victor Stinner em :issue:`39573`.)

source: Since :c:func:`Py_SIZE()` is changed to a inline static function, ``Py_SIZE(obj) = new_size`` must be replaced with ``Py_SET_SIZE(obj, new_size)``: see the :c:func:`Py_SET_SIZE()` function (available since Python 3.9). For backward compatibility, this macro can be used::
pt_br: Uma vez que :c:func:`Py_SIZE()` é alterada para uma função estática inline, ``Py_SIZE(obj) = new_size`` deve ser substituído por ``Py_SET_SIZE(obj, new_size)``: veja a função :c:func:`Py_SET_SIZE()` (disponível desde Python 3.9). Para compatibilidade com versões anteriores, esta macro pode ser usada::

source: ``<Python.h>`` no longer includes the header files ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` and ``<string.h>`` when the ``Py_LIMITED_API`` macro is set to ``0x030b0000`` (Python 3.11) or higher. C extensions should explicitly include the header files after ``#include <Python.h>``. (Contributed by Victor Stinner in :issue:`45434`.)
pt_br: ``<Python.h>`` não inclui mais os arquivos de cabeçalho ``<stdlib.h>``, ``<stdio.h>``, ``<errno.h>`` e ``<string.h>`` quando a macro ``Py_LIMITED_API`` é definida como ``0x030b0000`` (Python 3.11) ou superior. As extensões C devem incluir explicitamente os arquivos de cabeçalho após ``#include <Python.h>``. (Contribuição de Victor Stinner em :issue:`45434`.)

source: The non-limited API files ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject.h`` and ``longintrepr.h`` have been moved to the ``Include/cpython`` directory. Moreover, the ``eval.h`` header file was removed. These files must not be included directly, as they are already included in ``Python.h``: :ref:`Include Files <api-includes>`. If they have been included directly, consider including ``Python.h`` instead. (Contributed by Victor Stinner in :issue:`35134`.)
pt_br: Os arquivos API não limitados ``cellobject.h``, ``classobject.h``, ``code.h``, ``context.h``, ``funcobject.h``, ``genobject.h`` e ``longintrepr.h`` foram movidos para o diretório ``Include/cpython``. Além disso, o arquivo de cabeçalho ``eval.h`` foi removido. Esses arquivos não devem ser incluídos diretamente, pois já estão incluídos aos :ref:`arquivos de inclusão <api-includes>` do ``Python.h``. Se eles foram incluídos diretamente, considere incluir ``Python.h`` em seu lugar. (Contribuição de Victor Stinner em :issue:`35134`.)

source: The :c:func:`!PyUnicode_CHECK_INTERNED` macro has been excluded from the limited C API. It was never usable there, because it used internal structures which are not available in the limited C API. (Contributed by Victor Stinner in :issue:`46007`.)
pt_br: A macro :c:func:`!PyUnicode_CHECK_INTERNED` foi excluída da API C limitada. Nunca foi utilizável lá, porque usava estruturas internas que não estão disponíveis na API C limitada. (Contribuição de Victor Stinner em :issue:`46007`.)

source: The following frame functions and type are now directly available with ``#include <Python.h>``, it's no longer needed to add ``#include <frameobject.h>``:
pt_br: As seguintes funções e tipo de quadro agora estão disponíveis diretamente com ``#include <Python.h>``, não é mais necessário adicionar ``#include <frameobject.h>``:

source: (Contributed by Victor Stinner in :gh:`93937`.)
pt_br: (Contribuição de Victor Stinner em :gh:`93937`.)

source: The :c:type:`PyFrameObject` structure members have been removed from the public C API.
pt_br: Os membros da estrutura :c:type:`PyFrameObject` foram removidos da API C pública.

source: While the documentation notes that the :c:type:`PyFrameObject` fields are subject to change at any time, they have been stable for a long time and were used in several popular extensions.
pt_br: Embora a documentação observe que os campos :c:type:`PyFrameObject` estão sujeitos a alterações a qualquer momento, eles permaneceram estáveis por um longo tempo e foram usados em várias extensões populares.

source: In Python 3.11, the frame struct was reorganized to allow performance optimizations. Some fields were removed entirely, as they were details of the old implementation.
pt_br: No Python 3.11, a estrutura do quadro foi reorganizada para permitir otimizações de desempenho. Alguns campos foram totalmente removidos, pois eram detalhes da antiga implementação.

source: :c:type:`PyFrameObject` fields:
pt_br: Campos do :c:type:`PyFrameObject`:

source: ``f_blockstack``: removed.
pt_br: ``f_blockstack``: removido.

source: ``f_iblock``: removed.
pt_br: ``f_iblock``: removido.

source: ``f_lasti``: use :c:func:`PyFrame_GetLasti`. Code using ``f_lasti`` with ``PyCode_Addr2Line()`` should use :c:func:`PyFrame_GetLineNumber` instead; it may be faster.
pt_br: ``f_lasti``: use :c:func:`PyFrame_GetLasti`. Código usando ``f_lasti`` com ``PyCode_Addr2Line()`` deve usar :c:func:`PyFrame_GetLineNumber`, pois deve ser mais rápido.

source: ``f_stackdepth``: removed.
pt_br: ``f_stackdepth``: removido.

source: ``f_state``: no public API (renamed to ``f_frame.f_state``).
pt_br: ``f_state``: nenhuma API pública (renomeado para ``f_frame.f_state``).

source: ``f_trace``: no public API.
pt_br: ``f_trace``: nenhuma API pública.

source: ``f_localsplus``: no public API (renamed to ``f_frame.localsplus``).
pt_br: ``f_localsplus``: nenhuma API pública (renomeado para ``f_frame.localsplus``).
