Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: The :func:`!locale.resetlocale` function is deprecated and will be removed in Python 3.13. Use ``locale.setlocale(locale.LC_ALL, "")`` instead. (Contributed by Victor Stinner in :gh:`90817`.)
pt_br: A função :func:`!locale.resetlocale` foi descontinuada e será removida no Python 3.13. Use ``locale.setlocale(locale.LC_ALL, "")``. (Contribuição de Victor Stinner em :gh:`90817`.)

source: Stricter rules will now be applied for numerical group references and group names in :ref:`regular expressions <re-syntax>`. Only sequences of ASCII digits will now be accepted as a numerical reference, and the group name in :class:`bytes` patterns and replacement strings can only contain ASCII letters, digits and underscores. For now, a deprecation warning is raised for syntax violating these rules. (Contributed by Serhiy Storchaka in :gh:`91760`.)
pt_br: Regras mais rígidas agora serão aplicadas para referências numéricas de grupos e nomes de grupos em :ref:`expressões regulares <re-syntax>`. Apenas sequências de dígitos ASCII serão aceitas como referência numérica, e o nome do grupo em padrões :class:`bytes` e strings de substituição podem conter apenas letras ASCII, dígitos e sublinhados. Por enquanto, um aviso de descontinuação é levantado para a sintaxe que viola essas regras. (Contribuição de Serhiy Storchaka em :gh:`91760`.)

source: In the :mod:`re` module, the :func:`!re.template` function and the corresponding :const:`!re.TEMPLATE` and :const:`!re.T` flags are deprecated, as they were undocumented and lacked an obvious purpose. They will be removed in Python 3.13. (Contributed by Serhiy Storchaka and Miro Hrončok in :gh:`92728`.)
pt_br: No módulo :mod:`re`, a função :func:`!re.template` e os sinalizadores :const:`!re.TEMPLATE` e :const:`!re.T` correspondentes foram descontinuados, pois não foram documentados e careciam da um propósito óbvio. Eles serão removidos no Python 3.13. (Contribuição de Serhiy Storchaka e Miro Hrončok em :gh:`92728`.)

source: :func:`!turtle.settiltangle` has been deprecated since Python 3.1; it now emits a deprecation warning and will be removed in Python 3.13. Use :func:`turtle.tiltangle` instead (it was earlier incorrectly marked as deprecated, and its docstring is now corrected). (Contributed by Hugo van Kemenade in :issue:`45837`.)
pt_br: :func:`!turtle.settiltangle` foi descontinuada desde o Python 3.1; ela agora emite um aviso de descontinuação e será removida no Python 3.13. Em vez dela, use :func:`turtle.tiltangle` (foi marcada anteriormente incorretamente como descontinuada e sua docstring agora está corrigida). (Contribuição de Hugo van Kemenade em :issue:`45837`.)

source: :class:`typing.Text`, which exists solely to provide compatibility support between Python 2 and Python 3 code, is now deprecated. Its removal is currently unplanned, but users are encouraged to use :class:`str` instead wherever possible. (Contributed by Alex Waygood in :gh:`92332`.)
pt_br: :class:`typing.Text`, que existe apenas para fornecer suporte de compatibilidade entre o código Python 2 e Python 3, foi descontinuada nesta versão. Sua remoção não está planejada, mas os usuários são encorajados a usar :class:`str` sempre que possível. (Contribuição de Alex Waygood em :gh:`92332`.)

source: The keyword argument syntax for constructing :data:`typing.TypedDict` types is now deprecated. Support will be removed in Python 3.13. (Contributed by Jingchen Ye in :gh:`90224`.)
pt_br: A sintaxe do argumento nomeado para a construção de tipos :data:`typing.TypedDict` foi descontinuado neste versão. O suporte será removido no Python 3.13. (Contribuição de Jingchen Ye em :gh:`90224`.)

source: :class:`!webbrowser.MacOSX` is deprecated and will be removed in Python 3.13. It is untested, undocumented, and not used by :mod:`webbrowser` itself. (Contributed by Donghee Na in :issue:`42255`.)
pt_br: :class:`!webbrowser.MacOSX` foi descontinuada e será removida no Python 3.13. Ela não foi testada, não foi documentada e não é usada pelo próprio :mod:`webbrowser`. (Contribuição de Dong-hee Na em :issue:`42255`.)

source: The behavior of returning a value from a :class:`~unittest.TestCase` and :class:`~unittest.IsolatedAsyncioTestCase` test methods (other than the default ``None`` value) is now deprecated.
pt_br: O comportamento de retornar um valor de um dos métodos de teste de :class:`~unittest.TestCase` e :class:`~unittest.IsolatedAsyncioTestCase` (diferente do valor padrão ``None``) foi descontinuado nesta versão.

source: Deprecated the following not-formally-documented :mod:`unittest` functions, scheduled for removal in Python 3.13:
pt_br: Foram descontinuadas as seguintes funções :mod:`unittest` não formalmente documentadas, agendadas para remoção no Python 3.13:

source: Use :class:`~unittest.TestLoader` methods instead:
pt_br: Em vez delas, use os métodos de :class:`~unittest.TestLoader`:

source: (Contributed by Erlend E. Aasland in :issue:`5846`.)
pt_br: (Contribuição de Erlend E. Aasland em :issue:`5846`.)

source: :meth:`!unittest.TestProgram.usageExit` is marked deprecated, to be removed in 3.13. (Contributed by Carlos Damázio in :gh:`67048`.)
pt_br: :meth:`!unittest.TestProgram.usageExit` foi marcado como descontinuado, para ser removido em 3.13. (Contribuição de Carlos Damázio em :gh:`67048`.)

source: Pending Removal in Python 3.12
pt_br: Pendente remoção no Python 3.12

source: The following Python APIs have been deprecated in earlier Python releases, and will be removed in Python 3.12.
pt_br: As seguintes APIs do Python foram descontinuadas em versões anteriores do Python e serão removidas no Python 3.12.

source: C APIs pending removal are :ref:`listed separately <whatsnew311-c-api-pending-removal>`.
pt_br: As APIs C com remoção pendente são :ref:`listadas separadamente <whatsnew311-c-api-pending-removal>`.

source: The :mod:`!asynchat` module
pt_br: O módulo :mod:`!asynchat`

source: The :mod:`!asyncore` module
pt_br: O módulo :mod:`!asyncore`

source: The :ref:`entire distutils package <distutils-deprecated>`
pt_br: :ref:`Todo o pacote distutils <distutils-deprecated>`

source: The :mod:`!imp` module
pt_br: O módulo :mod:`!imp`

source: The :class:`typing.io <typing.IO>` namespace
pt_br: O espaço de nomes :class:`typing.io <typing.IO>`

source: The :class:`typing.re <typing.Pattern>` namespace
pt_br: O espaço de nomes :class:`typing.re <typing.Pattern>`

source: :envvar:`!PYTHONTHREADDEBUG` environment variable
pt_br: Variável de ambiente :envvar:`!PYTHONTHREADDEBUG`

source: The following deprecated aliases in :mod:`unittest`:
pt_br: Os seguintes aliases foram descontinuados no :mod:`unittest`:

source: Deprecated alias
pt_br: Apelido descontinuado

source: Method Name
pt_br: Nome do método

source: Deprecated in
pt_br: Descontinuado em

source: Removed
pt_br: Removidos

source: This section lists Python APIs that have been removed in Python 3.11.
pt_br: Esta seção lista as APIs do Python que foram removidas no Python 3.11.

source: Removed C APIs are :ref:`listed separately <whatsnew311-c-api-removed>`.
pt_br: As APIs C removidas são :ref:`listadas separadamente <whatsnew311-c-api-removed>`.

source: Removed the :func:`!@asyncio.coroutine` :term:`decorator` enabling legacy generator-based coroutines to be compatible with :keyword:`async` / :keyword:`await` code. The function has been deprecated since Python 3.8 and the removal was initially scheduled for Python 3.10. Use :keyword:`async def` instead. (Contributed by Illia Volochii in :issue:`43216`.)
pt_br: Removido o :term:`decorador` :func:`!@asyncio.coroutine` permitindo que corrotinas baseadas em gerador legado sejam compatíveis com o código :keyword:`async` / :keyword:`await`. A função foi descontinuada desde o Python 3.8 e a remoção foi inicialmente agendada para o Python 3.10. Use :keyword:`async def` em vez disso. (Contribuição de Illia Volochii em :issue:`43216`.)

source: Removed :class:`!asyncio.coroutines.CoroWrapper` used for wrapping legacy generator-based coroutine objects in the debug mode. (Contributed by Illia Volochii in :issue:`43216`.)
pt_br: Removida :class:`!asyncio.coroutines.CoroWrapper`, que era usada para encapsular objetos de corrotina baseados em gerador legado no modo de depuração. (Contribuição de Illia Volochii em :issue:`43216`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint`, disabled in Python 3.9, is now entirely removed. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. (Contributed by Hugo van Kemenade in :issue:`45129`.)
pt_br: Devido a preocupações significativas de segurança, o parâmetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint`, desabilitado no Python 3.9, agora foi totalmente removido. Isto é devido ao comportamento da opção de socket ``SO_REUSEDDR`` no UDP. (Contribuição de Hugo van Kemenade em :issue:`45129`.)

source: Removed the :mod:`!binhex` module, deprecated in Python 3.9. Also removed the related, similarly-deprecated :mod:`binascii` functions:
pt_br: Removido o módulo :mod:`!binhex`, descontinuado no Python 3.9. Também foram removidas as funções :mod:`binascii` relacionadas e igualmente descontinuadas:

source: The :func:`binascii.crc_hqx` function remains available.
pt_br: A função :func:`binascii.crc_hqx` continua disponível.

source: (Contributed by Victor Stinner in :issue:`45085`.)
pt_br: (Contribuição de Victor Stinner em :issue:`45085`.)

source: Removed the :mod:`!distutils` ``bdist_msi`` command deprecated in Python 3.9. Use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`45124`.)
pt_br: Removido o comando ``bdist_msi`` do :mod:`!distutils` que foi descontinuado no Python 3.9. Em vez disso, use ``bdist_wheel`` (pacotes wheel). (Contribuição de Hugo van Kemenade em :issue:`45124`.)

source: Removed the :meth:`~object.__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput`, deprecated since Python 3.9. (Contributed by Hugo van Kemenade in :issue:`45132`.)
pt_br: Removidos os métodos :meth:`~object.__getitem__` das classes :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` e :class:`fileinput.FileInput`, descontinuados desde o Python 3.9 . (Contribuição de Hugo van Kemenade em :issue:`45132`.)

source: Removed the deprecated :mod:`gettext` functions :func:`!lgettext`, :func:`!ldgettext`, :func:`!lngettext` and :func:`!ldngettext`. Also removed the :func:`!bind_textdomain_codeset` function, the :meth:`!NullTranslations.output_charset` and :meth:`!NullTranslations.set_output_charset` methods, and the *codeset* parameter of :func:`!translation` and :func:`!install`, since they are only used for the :func:`!l*gettext` functions. (Contributed by Donghee Na and Serhiy Storchaka in :issue:`44235`.)
pt_br: Removidas as funções descontinuadas :func:`!lgettext`, :func:`!ldgettext`, :func:`!lngettext` e :func:`!ldngettext` de :mod:`gettext`. Também removidas a função :func:`!bind_textdomain_codeset`, os métodos :meth:`!NullTranslations.output_charset` e :meth:`!NullTranslations.set_output_charset`, e o parâmetro *codeset* de :func:`!translation` e :func:`!install`, já que eles são usados apenas para as funções :func:`!l*gettext`. (Contribuição de Dong-hee Na e Serhiy Storchaka em :issue:`44235`.)

source: Removed from the :mod:`inspect` module:
pt_br: Removido do módulo :mod:`inspect`:

source: The :func:`!getargspec` function, deprecated since Python 3.0; use :func:`inspect.signature` or :func:`inspect.getfullargspec` instead.
pt_br: A função :func:`!getargspec`, descontinuada desde o Python 3.0; use :func:`inspect.signature` ou :func:`inspect.getfullargspec`.

source: The :func:`!formatargspec` function, deprecated since Python 3.5; use the :func:`inspect.signature` function or the :class:`inspect.Signature` object directly.
pt_br: A função :func:`!formatargspec`, descontinuada desde o Python 3.5; use a função :func:`inspect.signature` ou o objeto :class:`inspect.Signature` diretamente.

source: The undocumented :meth:`!Signature.from_builtin` and :meth:`!Signature.from_function` methods, deprecated since Python 3.5; use the :meth:`Signature.from_callable() <inspect.Signature.from_callable>` method instead.
pt_br: Os métodos não documentados :meth:`!Signature.from_builtin` e :meth:`!Signature.from_function`, descontinuados desde o Python 3.5; use o método :meth:`Signature.from_callable() <inspect.Signature.from_callable>`.

source: (Contributed by Hugo van Kemenade in :issue:`45320`.)
pt_br: (Contribuição de Hugo van Kemenade em :issue:`45320`.)

source: Removed the :meth:`~object.__class_getitem__` method from :class:`pathlib.PurePath`, because it was not used and added by mistake in previous versions. (Contributed by Nikita Sobolev in :issue:`46483`.)
pt_br: Removido o método :meth:`~object.__class_getitem__` de :class:`pathlib.PurePath`, pois não era usado e foi adicionado por engano em versões anteriores. (Contribuição de Nikita Sobolev em :issue:`46483`.)

source: Removed the :class:`!MailmanProxy` class in the :mod:`!smtpd` module, as it is unusable without the external :mod:`!mailman` package. (Contributed by Donghee Na in :issue:`35800`.)
pt_br: Removida a classe :class:`!MailmanProxy` do módulo :mod:`!smtpd`, pois ela não pode ser usada sem o pacote :mod:`!mailman` externo. (Contribuição de Dong-hee Na em :issue:`35800`.)

source: Removed the deprecated :meth:`!split` method of :class:`!_tkinter.TkappType`. (Contributed by Erlend E. Aasland in :issue:`38371`.)
pt_br: Removido o método descontinuado :meth:`!split` de :class:`!_tkinter.TkappType`. (Contribuição de Erlend E. Aasland em :issue:`38371`.)

source: Removed namespace package support from :mod:`unittest` discovery. It was introduced in Python 3.4 but has been broken since Python 3.7. (Contributed by Inada Naoki in :issue:`23882`.)
pt_br: Removido o suporte a pacote de espaço de nomes da descoberta de :mod:`unittest`. Foi introduzido no Python 3.4, mas está quebrado desde o Python 3.7. (Contribuição de Inada Naoki em :issue:`23882`.)

source: Removed the undocumented private :meth:`!float.__set_format__` method, previously known as :meth:`!float.__setformat__` in Python 3.7. Its docstring said: "You probably don't want to use this function. It exists mainly to be used in Python's test suite." (Contributed by Victor Stinner in :issue:`46852`.)
pt_br: Removido o método privado não documentado :meth:`!float.__set_format__`, anteriormente conhecido como :meth:`!float.__setformat__` no Python 3.7. Sua docstring dizia: "Você provavelmente não quer usar esta função. Ela existe principalmente para ser usada na conjunto de testes do Python." (Contribuição de Victor Stinner em :issue:`46852`.)

source: The :option:`!--experimental-isolated-subinterpreters` configure flag (and corresponding :c:macro:`!EXPERIMENTAL_ISOLATED_SUBINTERPRETERS` macro) have been removed.
pt_br: O sinalizador de configuração :option:`!--experimental-isolated-subinterpreters` e a macro :c:macro:`!EXPERIMENTAL_ISOLATED_SUBINTERPRETERS` correspondente foram removidos.

source: :pypi:`Pynche` --- The Pythonically Natural Color and Hue Editor --- has been moved out of ``Tools/scripts`` and is `being developed independently <https://gitlab.com/warsaw/pynche/-/tree/main>`_ from the Python source tree.
pt_br: :pypi:`Pynche` -- O Pythonically Natural Color and Hue Editor -- foi removido de ``Tools/scripts`` e está `sendo desenvolvido independentemente <https://gitlab.com/warsaw/pynche/-/tree/main>`_ da árvore fonte do Python.

source: Porting to Python 3.11
pt_br: Portando para Python 3.11

source: This section lists previously described changes and other bugfixes in the Python API that may require changes to your Python code.
pt_br: Esta seção lista as alterações descritas anteriormente e outras correções de bugs na API do Python que podem exigir alterações em seu código Python.

source: Porting notes for the C API are :ref:`listed separately <whatsnew311-c-api-porting>`.
pt_br: As notas de portabilidade para a API C são :ref:`listadas separadamente <whatsnew311-c-api-porting>`.

source: :func:`open`, :func:`io.open`, :func:`codecs.open` and :class:`fileinput.FileInput` no longer accept ``'U'`` ("universal newline") in the file mode. In Python 3, "universal newline" mode is used by default whenever a file is opened in text mode, and the ``'U'`` flag has been deprecated since Python 3.3. The :ref:`newline parameter <open-newline-parameter>` to these functions controls how universal newlines work. (Contributed by Victor Stinner in :issue:`37330`.)
pt_br: :func:`open`, :func:`io.open`, :func:`codecs.open` e :class:`fileinput.FileInput` não aceitam mais ``'U'`` ("nova linha universal") em o modo de arquivo. No Python 3, o modo "nova linha universal" é usado por padrão sempre que um arquivo é aberto no modo de texto, e o sinalizador ``'U'`` foi descontinuado desde o Python 3.3. O :ref:`parâmetro de nova linha <open-newline-parameter>` para essas funções controla como as novas linhas universais funcionam. (Contribuição de Victor Stinner em :issue:`37330`.)

source: :class:`ast.AST` node positions are now validated when provided to :func:`compile` and other related functions. If invalid positions are detected, a :exc:`ValueError` will be raised. (Contributed by Pablo Galindo in :gh:`93351`)
pt_br: As posições do nó da :class:`ast.AST` agora são validadas quando fornecidas para :func:`compile` e outras funções relacionadas. Se posições inválidas forem detectadas, uma exceção :exc:`ValueError` será levantado. (Contribuição de Pablo Galindo em :gh:`93351`)

source: Prohibited passing non-:class:`concurrent.futures.ThreadPoolExecutor` executors to :meth:`asyncio.loop.set_default_executor` following a deprecation in Python 3.8. (Contributed by Illia Volochii in :issue:`43234`.)
pt_br: Proibido passar executores que não sejam :class:`concurrent.futures.ThreadPoolExecutor` para :meth:`asyncio.loop.set_default_executor` após uma descontinuação no Python 3.8. (Contribuição de Illia Volochii em :issue:`43234`.)

source: :mod:`calendar`: The :class:`calendar.LocaleTextCalendar` and :class:`calendar.LocaleHTMLCalendar` classes now use :func:`locale.getlocale`, instead of using :func:`locale.getdefaultlocale`, if no locale is specified. (Contributed by Victor Stinner in :issue:`46659`.)
pt_br: :mod:`calendar`: As classes :class:`calendar.LocaleTextCalendar` e :class:`calendar.LocaleHTMLCalendar` agora usam :func:`locale.getlocale`, em vez de usar :func:`locale.getdefaultlocale`, se nenhuma localidade é especificada. (Contribuição de Victor Stinner em :issue:`46659`.)

source: The :mod:`pdb` module now reads the :file:`.pdbrc` configuration file with the ``'UTF-8'`` encoding. (Contributed by Srinivas Reddy Thatiparthy (శ్రీనివాస్ రెడ్డి తాటిపర్తి) in :issue:`41137`.)
pt_br: O módulo :mod:`pdb` agora lê o arquivo de configuração :file:`.pdbrc` com a codificação ``'UTF-8'``. (Contribuição de Srinivas Reddy Thatiparty (శ్రీనివాస్ రెడ్డి తాటిపర్తి) em :issue:`41137`.)

source: The *population* parameter of :func:`random.sample` must be a sequence, and automatic conversion of :class:`set`\s to :class:`list`\s is no longer supported. Also, if the sample size is larger than the population size, a :exc:`ValueError` is raised. (Contributed by Raymond Hettinger in :issue:`40465`.)
pt_br: O parâmetro *population* de :func:`random.sample` deve ser uma sequência, e a conversão automática de :class:`set`\s para :class:`list`\s não é mais suportada. Além disso, se o tamanho da amostra for maior que o tamanho da população, uma exceção :exc:`ValueError` é levantada. (Contribuição de Raymond Hettinger em :issue:`40465`.)

source: The *random* optional parameter of :func:`random.shuffle` was removed. It was previously an arbitrary random function to use for the shuffle; now, :func:`random.random` (its previous default) will always be used.
pt_br: O parâmetro opcional *random* de :func:`random.shuffle` foi removido. Anteriormente, era uma função aleatória arbitrária a ser usada para o shuffle; agora, :func:`random.random` (seu padrão anterior) sempre será usado.

source: In :mod:`re` :ref:`re-syntax`, global inline flags (e.g. ``(?i)``) can now only be used at the start of regular expressions. Using them elsewhere has been deprecated since Python 3.6. (Contributed by Serhiy Storchaka in :issue:`47066`.)
pt_br: Em :ref:`re-syntax` do :mod:`re`, sinalizadores globais inline (por exemplo, ``(?i)``) agora só podem ser usados no início de expressões regulares. Se uso em outro lugar foi descontinuado no Python 3.6. (Contribuição de Serhiy Storchaka em :issue:`47066`.)

source: In the :mod:`re` module, several long-standing bugs where fixed that, in rare cases, could cause capture groups to get the wrong result. Therefore, this could change the captured output in these cases. (Contributed by Ma Lin in :issue:`35859`.)
pt_br: No módulo :mod:`re`, vários bugs de longa data foram corrigidos que, em casos raros, poderiam fazer com que os grupos de captura obtivessem o resultado errado. Portanto, isso pode alterar a saída capturada nesses casos. (Contribuição de Ma Lin em :issue:`35859`.)

source: Build Changes
pt_br: Mudanças na construção

source: CPython now has :pep:`11` :pep:`Tier 3 support <11#tier-3>` for cross compiling to the `WebAssembly <https://webassembly.org/>`_ platforms `Emscripten <https://emscripten.org/>`_ (``wasm32-unknown-emscripten``, i.e. Python in the browser) and `WebAssembly System Interface (WASI) <https://wasi.dev/>`_ (``wasm32-unknown-wasi``). The effort is inspired by previous work like `Pyodide <https://pyodide.org/>`_. These platforms provide a limited subset of POSIX APIs; Python standard libraries features and modules related to networking, processes, threading, signals, mmap, and users/groups are not available or don't work. (Emscripten contributed by Christian Heimes and Ethan Smith in :gh:`84461` and WASI contributed by Christian Heimes in :gh:`90473`; platforms promoted in :gh:`95085`)
pt_br: CPython agora tem :pep:`suporte a Tier 3 <11#tier-3>` da :pep:`11` para compilação cruzada para as plataformas `WebAssembly <https://webassembly.org/>`_ `Emscripten <https://emscripten.org/>`_ (``wasm32-unknown-emscripten``, ou seja, Python no navegador) e `WebAssembly System Interface (WASI) <https://wasi.dev/>`_ (``wasm32-unknown-wasi``). O esforço é inspirado em trabalhos anteriores como `Pyodide <https://pyodide.org/>`_. Essas plataformas fornecem um subconjunto limitado de APIs POSIX; Os recursos e módulos das bibliotecas padrão do Python relacionados a redes, processos, encadeamento, sinais, mmap e usuários/grupos não estão disponíveis ou não funcionam. (Emscripten contribuído por Christian Heimes e Ethan Smith em :gh:`84461` e WASI contribuído por Christian Heimes em :gh:`90473`; plataformas promovidas em :gh:`95085`)

source: Building CPython now requires:
pt_br: A construção do CPython agora requer:

source: A `C11 <https://en.cppreference.com/w/c/11>`_ compiler and standard library. `Optional C11 features <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ are not required. (Contributed by Victor Stinner in :issue:`46656`, :issue:`45440` and :issue:`46640`.)
pt_br: Um compilador `C11 <https://en.cppreference.com/w/c/11>`_. `Recursos C11 opcionais <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ não são necessários. (Contribuição de Victor Stinner em :issue:`46656`, :issue:`45440` e :issue:`46640`.)

source: Support for `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ floating-point numbers. (Contributed by Victor Stinner in :issue:`46917`.)
pt_br: Suporte para números de ponto flutuante `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_. (Contribuição de Victor Stinner em :issue:`46917`.)
