Repository: python/python-docs-pt-br
Catalog: whatsnew/3.11.po
Languages: pt_br

source: ``f_valuestack``: removed.
pt_br: ``f_valuestack``: removido.

source: The Python frame object is now created lazily. A side effect is that the :attr:`~frame.f_back` member must not be accessed directly, since its value is now also computed lazily. The :c:func:`PyFrame_GetBack` function must be called instead.
pt_br: O objeto quadro do Python agora é criado de forma "preguiçosa" (*lazy*). Um efeito colateral é que o membro :attr:`~frame.f_back` não deve ser acessado diretamente, já que seu valor agora também é calculado de forma "preguiçosa". A função :c:func:`PyFrame_GetBack` deve ser chamada em seu lugar.

source: Debuggers that accessed the :attr:`~frame.f_locals` directly *must* call :c:func:`PyFrame_GetLocals` instead. They no longer need to call :c:func:`!PyFrame_FastToLocalsWithError` or :c:func:`!PyFrame_LocalsToFast`, in fact they should not call those functions. The necessary updating of the frame is now managed by the virtual machine.
pt_br: Depuradores que acessam :attr:`~frame.f_locals` diretamente *devem* chamar :c:func:`PyFrame_GetLocals`. Eles não precisam mais chamar :c:func:`!PyFrame_FastToLocalsWithError` ou :c:func:`!PyFrame_LocalsToFast`. Na verdade, eles não devem chamar essas funções. A atualização necessária do quadro agora é gerenciada pela máquina virtual.

source: Code defining ``PyFrame_GetCode()`` on Python 3.8 and older::
pt_br: Código definindo ``PyFrame_GetCode()`` no Python 3.8 e anteriores::

source: Code defining ``PyFrame_GetBack()`` on Python 3.8 and older::
pt_br: Código definindo ``PyFrame_GetBack()`` no Python 3.8 e anteriores::

source: Or use the `pythoncapi_compat project <https://github.com/python/pythoncapi-compat>`__ to get these two functions on older Python versions.
pt_br: Ou use o projeto `pythoncapi_compat <https://github.com/python/pythoncapi-compat>`__ para obter essas duas funções em versões mais antigas do Python.

source: Changes of the :c:type:`PyThreadState` structure members:
pt_br: Mudanças nos membros da estrutura :c:type:`PyThreadState`:

source: ``frame``: removed, use :c:func:`PyThreadState_GetFrame` (function added to Python 3.9 by :issue:`40429`). Warning: the function returns a :term:`strong reference`, need to call :c:func:`Py_XDECREF`.
pt_br: ``frame``: removido, use :c:func:`PyThreadState_GetFrame` (função adicionada ao Python 3.9 por :issue:`40429`). Aviso: a função retorna um :term:`referência forte`, precisa chamar :c:func:`Py_XDECREF`.

source: ``tracing``: changed, use :c:func:`PyThreadState_EnterTracing` and :c:func:`PyThreadState_LeaveTracing` (functions added to Python 3.11 by :issue:`43760`).
pt_br: ``tracing``: alterado, use :c:func:`PyThreadState_EnterTracing` e :c:func:`PyThreadState_LeaveTracing` (funções adicionadas ao Python 3.11 por :issue:`43760`).

source: ``recursion_depth``: removed, use ``(tstate->recursion_limit - tstate->recursion_remaining)`` instead.
pt_br: ``recursion_depth``: removido, use ``(tstate->recursion_limit - tstate->recursion_remaining)``.

source: ``stackcheck_counter``: removed.
pt_br: ``stackcheck_counter``: removido.

source: Code defining ``PyThreadState_GetFrame()`` on Python 3.8 and older::
pt_br: Código definindo ``PyThreadState_GetFrame()`` no Python 3.8 e anteriores::

source: Code defining ``PyThreadState_EnterTracing()`` and ``PyThreadState_LeaveTracing()`` on Python 3.10 and older::
pt_br: Código definindo ``PyThreadState_EnterTracing()`` e ``PyThreadState_LeaveTracing()`` no Python 3.10 e anteriores::

source: Or use `the pythoncapi-compat project <https://github.com/python/pythoncapi-compat>`__ to get these functions on old Python functions.
pt_br: Ou use `o projeto pythoncapi-compat <https://github.com/python/pythoncapi-compat>`__ para obter essas funções em funções antigas do Python.

source: Distributors are encouraged to build Python with the optimized Blake2 library `libb2`_.
pt_br: Os distribuidores são encorajados a compilar o Python com a biblioteca Blake2 otimizada `libb2`_.

source: The :c:member:`PyConfig.module_search_paths_set` field must now be set to 1 for initialization to use :c:member:`PyConfig.module_search_paths` to initialize :data:`sys.path`. Otherwise, initialization will recalculate the path and replace any values added to ``module_search_paths``.
pt_br: O campo :c:member:`PyConfig.module_search_paths_set` agora deve ser definido como 1 para inicialização para usar :c:member:`PyConfig.module_search_paths` para inicializar :data:`sys.path`. Caso contrário, a inicialização recalculará o caminho e substituirá quaisquer valores adicionados a ``module_search_paths``.

source: :c:func:`PyConfig_Read` no longer calculates the initial search path, and will not fill any values into :c:member:`PyConfig.module_search_paths`. To calculate default paths and then modify them, finish initialization and use :c:func:`PySys_GetObject` to retrieve :data:`sys.path` as a Python list object and modify it directly.
pt_br: :c:func:`PyConfig_Read` não calcula mais o caminho de pesquisa inicial e não preencherá nenhum valor em :c:member:`PyConfig.module_search_paths`. Para calcular caminhos padrão e modificá-los, termine a inicialização e use :c:func:`PySys_GetObject` para recuperar :data:`sys.path` como um objeto lista do Python e modifique-o diretamente.

source: Deprecate the following functions to configure the Python initialization:
pt_br: Descontinua as seguintes funções para configurar a inicialização do Python:

source: Use the new :c:type:`PyConfig` API of the :ref:`Python Initialization Configuration <init-config>` instead (:pep:`587`). (Contributed by Victor Stinner in :gh:`88279`.)
pt_br: Em vez disso, use a nova API :c:type:`PyConfig` da :ref:`Configuração de Inicialização do Python <init-config>` (:pep:`587`). (Contribuição de Victor Stinner em :gh:`88279`.)

source: Deprecate the ``ob_shash`` member of the :c:type:`PyBytesObject`. Use :c:func:`PyObject_Hash` instead. (Contributed by Inada Naoki in :issue:`46864`.)
pt_br: Descontinua o membro ``ob_shash`` do :c:type:`PyBytesObject`. Use :c:func:`PyObject_Hash` em vez disso. (Contribuição de Inada Naoki em :issue:`46864`.)

source: The following C APIs have been deprecated in earlier Python releases, and will be removed in Python 3.12.
pt_br: As seguintes APIs C foram descontinuadas em versões anteriores do Python e serão removidas no Python 3.12.

source: :c:func:`!PyFrame_BlockSetup` and :c:func:`!PyFrame_BlockPop` have been removed. (Contributed by Mark Shannon in :issue:`40222`.)
pt_br: :c:func:`!PyFrame_BlockSetup` e :c:func:`!PyFrame_BlockPop` foram removidas. (Contribuição de Mark Shannon em :issue:`40222`.)

source: Remove the following math macros using the ``errno`` variable:
pt_br: Remove as seguintes macros matemáticas usando a variável ``errno``:

source: (Contributed by Victor Stinner in :issue:`45412`.)
pt_br: (Contribuição de Victor Stinner em :issue:`45412`.)

source: Remove ``Py_UNICODE_COPY()`` and ``Py_UNICODE_FILL()`` macros, deprecated since Python 3.3. Use ``PyUnicode_CopyCharacters()`` or ``memcpy()`` (``wchar_t*`` string), and ``PyUnicode_Fill()`` functions instead. (Contributed by Victor Stinner in :issue:`41123`.)
pt_br: Remove as macros ``Py_UNICODE_COPY()`` e ``Py_UNICODE_FILL()``, descontinuadas desde o Python 3.3. Use ``PyUnicode_CopyCharacters()`` ou ``memcpy()`` (string ``wchar_t*``) e as funções ``PyUnicode_Fill()``. (Contribuição de Victor Stinner em :issue:`41123`.)

source: Remove the ``pystrhex.h`` header file. It only contains private functions. C extensions should only include the main ``<Python.h>`` header file. (Contributed by Victor Stinner in :issue:`45434`.)
pt_br: Remove o arquivo de cabeçalho ``pystrhex.h``. Ele contém apenas funções privadas. As extensões C devem incluir apenas o arquivo principal ``<Python.h>``. (Contribuição de Victor Stinner em :issue:`45434`.)

source: Remove the ``Py_FORCE_DOUBLE()`` macro. It was used by the ``Py_IS_INFINITY()`` macro. (Contributed by Victor Stinner in :issue:`45440`.)
pt_br: Remove a macro ``Py_FORCE_DOUBLE()``. Era usada pela macro ``Py_IS_INFINITY()``. (Contribuição de Victor Stinner em :issue:`45440`.)

source: The following items are no longer available when :c:macro:`Py_LIMITED_API` is defined:
pt_br: Os seguintes itens não estão mais disponíveis quando :c:macro:`Py_LIMITED_API` é definida:

source: the ``Py_MARSHAL_VERSION`` macro
pt_br: a macro ``Py_MARSHAL_VERSION``

source: These are not part of the :ref:`limited API <limited-api-list>`.
pt_br: Eles não fazem parte da :ref:`API limitada <limited-api-list>`.

source: (Contributed by Victor Stinner in :issue:`45474`.)
pt_br: (Contribuição de Victor Stinner em :issue:`45474`.)

source: Exclude :c:func:`PyWeakref_GET_OBJECT` from the limited C API. It never worked since the :c:type:`!PyWeakReference` structure is opaque in the limited C API. (Contributed by Victor Stinner in :issue:`35134`.)
pt_br: Exclui :c:func:`PyWeakref_GET_OBJECT` da API C limitada. Nunca funcionou porque a estrutura :c:type:`!PyWeakReference` é opaca na API C limitada. (Contribuição de Victor Stinner em :issue:`35134`.)

source: Remove the ``PyHeapType_GET_MEMBERS()`` macro. It was exposed in the public C API by mistake, it must only be used by Python internally. Use the ``PyTypeObject.tp_members`` member instead. (Contributed by Victor Stinner in :issue:`40170`.)
pt_br: Remove a macro ``PyHeapType_GET_MEMBERS()``. Estava exposta na API C pública por engano, deve ser usada apenas pelo Python internamente. Em vez disso, use o membro ``PyTypeObject.tp_members``. (Contribuição de Victor Stinner em :issue:`40170`.)

source: Remove the ``HAVE_PY_SET_53BIT_PRECISION`` macro (moved to the internal C API). (Contributed by Victor Stinner in :issue:`45412`.)
pt_br: Remove a macro ``HAVE_PY_SET_53BIT_PRECISION`` (movida para a API C interna). (Contribuição de Victor Stinner em :issue:`45412`.)

source: Remove the :c:type:`Py_UNICODE` encoder APIs, as they have been deprecated since Python 3.3, are little used and are inefficient relative to the recommended alternatives.
pt_br: Remove as APIs de codificação :c:type:`Py_UNICODE`, pois foram descontinuadas desde o Python 3.3, são pouco usadas e ineficientes em relação às alternativas recomendadas.

source: The removed functions are:
pt_br: As funções removidas são:

source: See :pep:`624` for details and :pep:`migration guidance <624#alternative-apis>`. (Contributed by Inada Naoki in :issue:`44029`.)
pt_br: Veja a :pep:`624` para detalhes e :pep:`orientação sobre migração <624#alternative-apis>`. (Contribuição de Inada Naoki em :issue:`44029`.)

source: Notable changes in 3.11.4
pt_br: Alterações notáveis no 3.11.4

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
pt_br: Os métodos de extração em :mod:`tarfile` e :func:`shutil.unpack_archive`, têm um novo argumento *filter* que permite limitar recursos do tar que podem ser surpreendentes ou perigosos, como criar arquivos fora do diretório de destino. Veja :ref:`tarfile-extraction-filter` para detalhes. No Python 3.12, usar sem o argumento *filter* mostrará um :exc:`DeprecationWarning`. No Python 3.14, o padrão mudará para ``'data'``. (Contribuição de Petr Viktorin em :pep:`706`.)

source: Notable changes in 3.11.5
pt_br: Alterações notáveis no 3.11.5

source: Windows builds and macOS installers from python.org now use OpenSSL 3.0.
pt_br: Construções do Windows e instaladores do macOS em python.org agora usam OpenSSL 3.0.
