Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: These functions are no longer deprecated and are not scheduled for removal. (Contributed by Petr Viktorin in :gh:`116608`.)
pt_br: Essas funções não estão mais descontinuadas e não estão programadas para remoção. (Contribuição de Petr Viktorin em :gh:`116608`.)

source: :func:`~importlib.resources.contents` remains deprecated in favor of the fully-featured :class:`~importlib.resources.abc.Traversable` API. However, there is now no plan to remove it. (Contributed by Petr Viktorin in :gh:`116608`.)
pt_br: A função :func:`~importlib.resources.contents` permanece descontinuada em favor da API completa :class:`~importlib.resources.abc.Traversable`. No entanto, agora não há planos para removê-la. (Contribuição de Petr Viktorin em :gh:`116608`.)

source: The :class:`~io.IOBase` finalizer now logs any errors raised by the :meth:`~io.IOBase.close` method with :data:`sys.unraisablehook`. Previously, errors were ignored silently by default, and only logged in :ref:`Python Development Mode <devmode>` or when using a :ref:`Python debug build <debug-build>`. (Contributed by Victor Stinner in :gh:`62948`.)
pt_br: O finalizador :class:`~io.IOBase` agora registra quaisquer erros levantados pelo método :meth:`~io.IOBase.close` com :data:`sys.unraisablehook`. Anteriormente, os erros eram ignorados silenciosamente por padrão e registrados apenas em :ref:`Modo de Desenvolvimento do Python <devmode>` ou ao usar uma :ref:`construção de depuração do Python <debug-build>`. (Contribuição de Victor Stinner em :gh:`62948`.)

source: Add the :attr:`.IPv4Address.ipv6_mapped` property, which returns the IPv4-mapped IPv6 address. (Contributed by Charles Machalow in :gh:`109466`.)
pt_br: Adiciona a propriedade :attr:`.IPv4Address.ipv6_mapped`, que retorna o endereço IPv6 mapeado para IPv4. (Contribuição de Charles Machalow em :gh:`109466`.)

source: Fix ``is_global`` and ``is_private`` behavior in :class:`~ipaddress.IPv4Address`, :class:`~ipaddress.IPv6Address`, :class:`~ipaddress.IPv4Network`, and :class:`~ipaddress.IPv6Network`. (Contributed by Jakub Stasiak in :gh:`113171`.)
pt_br: Corrige os comportamentos de ``is_global`` e ``is_private`` em :class:`~ipaddress.IPv4Address`, :class:`~ipaddress.IPv6Address`, :class:`~ipaddress.IPv4Network` e :class:`~ipaddress.IPv6Network`. (Contribuição de Jakub Stasiak em :gh:`113171`.)

source: :func:`~itertools.batched` has a new *strict* parameter, which raises a :exc:`ValueError` if the final batch is shorter than the specified batch size. (Contributed by Raymond Hettinger in :gh:`113202`.)
pt_br: :func:`~itertools.batched` tem um novo parâmetro *strict*, que levanta uma :exc:`ValueError` se o lote final for menor que o tamanho do lote especificado. (Contribuição de Raymond Hettinger em :gh:`113202`.)

source: Add the *allow_code* parameter in module functions. Passing ``allow_code=False`` prevents serialization and de-serialization of code objects which are incompatible between Python versions. (Contributed by Serhiy Storchaka in :gh:`113626`.)
pt_br: Adiciona o parâmetro *allow_code* nas funções do módulo. Passar ``allow_code=False`` evita a serialização e desserialização de objetos de código que são incompatíveis entre versões do Python. (Contribuição de Serhiy Storchaka em :gh:`113626`.)

source: The new function :func:`~math.fma` performs fused multiply-add operations. This computes ``x * y + z`` with only a single round, and so avoids any intermediate loss of precision. It wraps the ``fma()`` function provided by C99, and follows the specification of the IEEE 754 "fusedMultiplyAdd" operation for special cases. (Contributed by Mark Dickinson and Victor Stinner in :gh:`73468`.)
pt_br: A nova função :func:`~math.fma` realiza operações fundidas de multiplicação e adição. Ela calcula ``x * y + z`` com apenas uma única rodada e, portanto, evita qualquer perda intermediária de precisão. Ele envolve a função ``fma()`` fornecida pelo C99 e segue a especificação da operação IEEE 754 "fusedMultiplyAdd" para casos especiais. (Contribuição de Mark Dickinson e Victor Stinner em :gh:`73468`.)

source: Add the :func:`~mimetypes.guess_file_type` function to guess a MIME type from a filesystem path. Using paths with :func:`~mimetypes.guess_type` is now :term:`soft deprecated`. (Contributed by Serhiy Storchaka in :gh:`66543`.)
pt_br: Adiciona a função :func:`~mimetypes.guess_file_type` para adivinhar um tipo MIME de um caminho do sistema de arquivos. Usar caminhos com :func:`~mimetypes.guess_type` agora está :term:`suavemente descontinuada <suavemente descontinuado>`. (Contribuição de Serhiy Storchaka em :gh:`66543`.)

source: :class:`~mmap.mmap` is now protected from crashing on Windows when the mapped memory is inaccessible due to file system errors or access violations. (Contributed by Jannis Weigend in :gh:`118209`.)
pt_br: :class:`~mmap.mmap` agora está protegida contra travamentos no Windows quando a memória mapeada está inacessível devido a erros no sistema de arquivos ou violações de acesso. (Contribuição de Jannis Weigend em :gh:`118209`.)

source: :class:`~mmap.mmap` has a new :meth:`~mmap.mmap.seekable` method that can be used when a seekable file-like object is required. The :meth:`~mmap.mmap.seek` method now returns the new absolute position. (Contributed by Donghee Na and Sylvie Liberman in :gh:`111835`.)
pt_br: :class:`~mmap.mmap` tem um novo método :meth:`~mmap.mmap.seekable` que pode ser usado quando um objeto arquivo ou similar pesquisável é necessário. O método :meth:`~mmap.mmap.seek` agora retorna a nova posição absoluta. (Contribuição de Donghee Na e Sylvie Liberman em :gh:`111835`.)

source: The new UNIX-only *trackfd* parameter for :class:`~mmap.mmap` controls file descriptor duplication; if false, the file descriptor specified by *fileno* will not be duplicated. (Contributed by Zackery Spytz and Petr Viktorin in :gh:`78502`.)
pt_br: O novo parâmetro *trackfd* somente para UNIX para :class:`~mmap.mmap` controla a duplicação do descritor de arquivo; se falso, o descritor de arquivo especificado por *fileno* não será duplicado. (Contribuição de Zackery Spytz e Petr Viktorin em :gh:`78502`.)

source: Add :func:`~os.process_cpu_count` function to get the number of logical CPU cores usable by the calling thread of the current process. (Contributed by Victor Stinner in :gh:`109649`.)
pt_br: Adiciona a função :func:`~os.process_cpu_count` para obter o número de núcleos lógicos de CPU utilizáveis pela thread de chamada do processo atual. (Contribuição de Victor Stinner em :gh:`109649`.)

source: :func:`~os.cpu_count` and :func:`~os.process_cpu_count` can be overridden through the new environment variable :envvar:`PYTHON_CPU_COUNT` or the new command-line option :option:`-X cpu_count <-X>`. This option is useful for users who need to limit CPU resources of a container system without having to modify application code or the container itself. (Contributed by Donghee Na in :gh:`109595`.)
pt_br: :func:`~os.cpu_count` e :func:`~os.process_cpu_count` podem ser substituídos através da nova variável de ambiente :envvar:`PYTHON_CPU_COUNT` ou da nova opção de linha de comando :option:`-X cpu_count <-X>`. Esta opção é útil para usuários que precisam limitar os recursos da CPU de um sistema contêiner sem precisar modificar código da aplicação ou o contêiner em si. (Contribuição de Donghee Na em :gh:`109595`.)

source: Add a :ref:`low level interface <os-timerfd>` to Linux's :manpage:`timer file descriptors <timerfd_create(2)>` via :func:`~os.timerfd_create`, :func:`~os.timerfd_settime`, :func:`~os.timerfd_settime_ns`, :func:`~os.timerfd_gettime`, :func:`~os.timerfd_gettime_ns`, :const:`~os.TFD_NONBLOCK`, :const:`~os.TFD_CLOEXEC`, :const:`~os.TFD_TIMER_ABSTIME`, and :const:`~os.TFD_TIMER_CANCEL_ON_SET` (Contributed by Masaru Tsuchiyama in :gh:`108277`.)
pt_br: Adiciona uma :ref:`interface de baixo nível <os-timerfd>` aos :manpage:`descritores de arquivo de temporizador <timerfd_create(2)>` do Linux via :func:`~os.timerfd_create`, :func:`~os.timerfd_settime`, :func:`~os.timerfd_settime_ns`, :func:`~os.timerfd_gettime`, :func:`~os.timerfd_gettime_ns`, :const:`~os.TFD_NONBLOCK`, :const:`~os.TFD_CLOEXEC`, :const:`~os.TFD_TIMER_ABSTIME` e :const:`~os.TFD_TIMER_CANCEL_ON_SET` (Contribuição de Masaru Tsuchiyama em :gh:`108277`.)

source: :func:`~os.lchmod` and the *follow_symlinks* argument of :func:`~os.chmod` are both now available on Windows. Note that the default value of *follow_symlinks* in :func:`!lchmod` is ``False`` on Windows. (Contributed by Serhiy Storchaka in :gh:`59616`.)
pt_br: :func:`~os.lchmod` e o argumento *follow_symlinks* em :func:`~os.chmod` estão agora disponíveis no Windows. Observe que o valor padrão de *follow_symlinks* em :func:`!lchmod` é ``False`` no Windows. (Contribuição de Serhiy Storchaka em :gh:`59616`.)

source: :func:`~os.fchmod` and support for file descriptors in :func:`~os.chmod` are both now available on Windows. (Contributed by Serhiy Storchaka in :gh:`113191`.)
pt_br: :func:`~os.fchmod` e suporte para descritores de arquivo em :func:`~os.chmod` estão agora disponíveis no Windows. (Contribuição de Serhiy Storchaka em :gh:`113191`.)

source: On Windows, :func:`~os.mkdir` and :func:`~os.makedirs` now support passing a *mode* value of ``0o700`` to apply access control to the new directory. This implicitly affects :func:`tempfile.mkdtemp` and is a mitigation for :cve:`2024-4030`. Other values for *mode* continue to be ignored. (Contributed by Steve Dower in :gh:`118486`.)
pt_br: No Windows, :func:`~os.mkdir` e :func:`~os.makedirs` agora oferecem suporte a passar um valor *mode* de ``0o700`` para aplicar controle de acesso ao novo diretório. Isso afeta implicitamente :func:`tempfile.mkdtemp` e é uma mitigação para :cve:`2024-4030`. Outros valores para *mode* continuam a ser ignorados. (Contribuição de Steve Dower em :gh:`118486`.)

source: :func:`~os.posix_spawn` now accepts ``None`` for the *env* argument, which makes the newly spawned process use the current process environment. (Contributed by Jakub Kulik in :gh:`113119`.)
pt_br: :func:`~os.posix_spawn` agora aceita ``None`` para o argumento *env*, o que faz com que o processo recém-gerado use o ambiente de processo atual. (Contribuição de Jakub Kulik em :gh:`113119`.)

source: :func:`~os.posix_spawn` can now use the :const:`~os.POSIX_SPAWN_CLOSEFROM` attribute in the *file_actions* parameter on platforms that support :c:func:`!posix_spawn_file_actions_addclosefrom_np`. (Contributed by Jakub Kulik in :gh:`113117`.)
pt_br: :func:`~os.posix_spawn` agora pode usar o atributo :const:`~os.POSIX_SPAWN_CLOSEFROM` no parâmetro *file_actions* em plataformas que oferecem suporte a :c:func:`!posix_spawn_file_actions_addclosefrom_np`. (Contribuição de Jakub Kulik em :gh:`113117`.)

source: Add :func:`~os.path.isreserved` to check if a path is reserved on the current system. This function is only available on Windows. (Contributed by Barney Gale in :gh:`88569`.)
pt_br: Adiciona :func:`~os.path.isreserved` para verificar se um caminho está reservado no sistema atual. Esta função está disponível apenas no Windows. (Contribuição de Barney Gale em :gh:`88569`.)

source: On Windows, :func:`~os.path.isabs` no longer considers paths starting with exactly one slash (``\`` or ``/``) to be absolute. (Contributed by Barney Gale and Jon Foster in :gh:`44626`.)
pt_br: No Windows, :func:`~os.path.isabs` não considera mais caminhos que começam com exatamente uma barra (``\`` ou ``/``) como absolutos. (Contribuição de Barney Gale e Jon Foster em :gh:`44626`.)

source: :func:`~os.path.realpath` now resolves MS-DOS style file names even if the file is not accessible. (Contributed by Moonsik Park in :gh:`82367`.)
pt_br: :func:`~os.path.realpath` agora resolve nomes de arquivos no estilo MS-DOS, mesmo que o arquivo não esteja acessível. (Contribuição de Moonsik Park em :gh:`82367`.)

source: Add :exc:`~pathlib.UnsupportedOperation`, which is raised instead of :exc:`NotImplementedError` when a path operation isn't supported. (Contributed by Barney Gale in :gh:`89812`.)
pt_br: Adiciona :exc:`~pathlib.UnsupportedOperation`, que é levantada em vez de :exc:`NotImplementedError` quando uma operação de caminho não é possível. (Contribuição de Barney Gale em :gh:`89812`.)

source: Add a new constructor for creating :class:`~pathlib.Path` objects from 'file' URIs (``file:///``), :meth:`.Path.from_uri`. (Contributed by Barney Gale in :gh:`107465`.)
pt_br: Adiciona um novo construtor para criar objetos :class:`~pathlib.Path` a partir de URIs 'file' (``file:///``), :meth:`.Path.from_uri`. (Contribuição de Barney Gale em :gh:`107465`.)

source: Add :meth:`.PurePath.full_match` for matching paths with shell-style wildcards, including the recursive wildcard "``**``". (Contributed by Barney Gale in :gh:`73435`.)
pt_br: Adiciona :meth:`.PurePath.full_match` para corresponder caminhos com curingas do tipo shell, incluindo o curinga recursivo "``**``". (Contribuição de Barney Gale em :gh:`73435`.)

source: Add the :attr:`.PurePath.parser` class attribute to store the implementation of :mod:`os.path` used for low-level path parsing and joining. This will be either :mod:`!posixpath` or :mod:`!ntpath`.
pt_br: Adiciona o atributo de classe :attr:`.PurePath.parser` para armazenar a implementação de :mod:`os.path` usada para análise e junção de caminhos de baixo nível. Isso vai ser :mod:`!posixpath` ou :mod:`!ntpath`.

source: Add *recurse_symlinks* keyword-only argument to :meth:`.Path.glob` and :meth:`~pathlib.Path.rglob`. (Contributed by Barney Gale in :gh:`77609`.)
pt_br: Adiciona o argumento somente-nomeado *recurse_symlinks* a :meth:`.Path.glob` e :meth:`~pathlib.Path.rglob`. (Contribuição de Barney Gale em :gh:`77609`.)

source: :meth:`.Path.glob` and :meth:`~pathlib.Path.rglob` now return files and directories when given a pattern that ends with "``**``". Previously, only directories were returned. (Contributed by Barney Gale in :gh:`70303`.)
pt_br: :meth:`.Path.glob` e :meth:`~pathlib.Path.rglob` agora retornam arquivos e diretórios quando recebem um padrão que termina com "``**``". Anteriormente, apenas os diretórios eram retornados. (Contribuição de Barney Gale em :gh:`70303`.)

source: Add the *follow_symlinks* keyword-only argument to :meth:`Path.is_file <pathlib.Path.is_file>`, :meth:`Path.is_dir <pathlib.Path.is_dir>`, :meth:`.Path.owner`, and :meth:`.Path.group`. (Contributed by Barney Gale in :gh:`105793` and Kamil Turek in :gh:`107962`.)
pt_br: Adiciona o argumento somente-nomeado *follow_symlinks* a :meth:`Path.is_file <pathlib.Path.is_file>`, :meth:`Path.is_dir <pathlib.Path.is_dir>`, :meth:`.Path.owner` e :meth:`.Path.group`. (Contribuição de Barney Gale em :gh:`105793` e Kamil Turek em :gh:`107962`.)

source: :func:`breakpoint` and :func:`~pdb.set_trace` now enter the debugger immediately rather than on the next line of code to be executed. This change prevents the debugger from breaking outside of the context when :func:`!breakpoint` is positioned at the end of the context. (Contributed by Tian Gao in :gh:`118579`.)
pt_br: :func:`breakpoint` e :func:`~pdb.set_trace` agora entram no depurador imediatamente em vez de na próxima linha de código a ser executada. Esta mudança evita que o depurador quebre fora do contexto quando :func:`!breakpoint` estiver posicionado no final do contexto. (Contribuição de Tian Gao em :gh:`118579`.)

source: ``sys.path[0]`` is no longer replaced by the directory of the script being debugged when :attr:`sys.flags.safe_path` is set. (Contributed by Tian Gao and Christian Walther in :gh:`111762`.)
pt_br: ``sys.path[0]`` não mais é substituído pelo diretório do script que está sendo depurado quando :attr:`sys.flags.safe_path` está definido.(Contribuição de Tian Gao e Christian Walther em :gh:`111762`.)

source: :mod:`zipapp` is now supported as a debugging target. (Contributed by Tian Gao in :gh:`118501`.)
pt_br: :mod:`zipapp` agora é aceito como alvo de depuração. (Contribuição de Tian Gao em :gh:`118501`.)

source: Add ability to move between chained exceptions during post-mortem debugging in :func:`~pdb.pm` using the new :pdbcmd:`exceptions [exc_number] <exceptions>` command for Pdb. (Contributed by Matthias Bussonnier in :gh:`106676`.)
pt_br: Adiciona a capacidade de mover entre exceções encadeadas durante a depuração post-mortem em :func:`~pdb.pm` usando o novo comando :pdbcmd:`exceptions [número_exc] <exceptions>` para Pdb. (Contribuição de Matthias Bussonnier em :gh:`106676`.)

source: Expressions and statements whose prefix is a pdb command are now correctly identified and executed. (Contributed by Tian Gao in :gh:`108464`.)
pt_br: Expressões e instruções cujo prefixo é um comando pdb agora são identificadas e executadas corretamente. (Contribuição de Tian Gao em :gh:`108464`.)

source: Add :meth:`Queue.shutdown <queue.Queue.shutdown>` and :exc:`~queue.ShutDown` to manage queue termination. (Contributed by Laurie Opperman and Yves Duprat in :gh:`104750`.)
pt_br: Adiciona :meth:`Queue.shutdown <queue.Queue.shutdown>` e :exc:`~queue.ShutDown` para gerenciar a finalização da fila. (Contribuição de Laurie Opperman e Yves Duprat em :gh:`104750`.)

source: Add a :ref:`command-line interface <random-cli>`. (Contributed by Hugo van Kemenade in :gh:`118131`.)
pt_br: Adiciona uma :ref:`interface de linha de comando <random-cli>`. (Contribuição de Hugo van Kemenade em :gh:`118131`.)

source: Rename :exc:`!re.error` to :exc:`~re.PatternError` for improved clarity. :exc:`!re.error` is kept for backward compatibility.
pt_br: Renomeia :exc:`!re.error` para :exc:`~re.PatternError` para maior clareza. :exc:`!re.error` é mantido para compatibilidade com versões anteriores.

source: Support the *dir_fd* and *follow_symlinks* keyword arguments in :func:`~shutil.chown`. (Contributed by Berker Peksag and Tahia K in :gh:`62308`)
pt_br: Suporte aos argumentos nomeados *dir_fd* e *follow_symlinks* em :func:`~shutil.chown`. (Contribuição de Berker Peksag e Tahia K em :gh:`62308`)

source: :file:`.pth` files are now decoded using UTF-8 first, and then with the :term:`locale encoding` if UTF-8 decoding fails. (Contributed by Inada Naoki in :gh:`117802`.)
pt_br: Os arquivos :file:`.pth` agora são decodificados primeiro usando UTF-8 e depois usando :term:`codificação da localidade` se a decodificação UTF-8 falhar. (Contribuição de Inada Naoki em :gh:`117802`.)

source: A :exc:`ResourceWarning` is now emitted if a :class:`~sqlite3.Connection` object is not :meth:`closed <sqlite3.Connection.close>` explicitly. (Contributed by Erlend E. Aasland in :gh:`105539`.)
pt_br: Uma :exc:`ResourceWarning` agora é emitida se um objeto :class:`~sqlite3.Connection` não for explicitamente :meth:`fechado <sqlite3.Connection.close>`. (Contribuição de Erlend E. Aasland em :gh:`105539`.)

source: Add the *filter* keyword-only parameter to :meth:`.Connection.iterdump` for filtering database objects to dump. (Contributed by Mariusz Felisiak in :gh:`91602`.)
pt_br: Adiciona o parâmetro somente-nomeado *filter* a :meth:`.Connection.iterdump` para filtrar objetos de banco de dados para despejo. (Contribuição de Mariusz Felisiak em :gh:`91602`.)

source: The :func:`~ssl.create_default_context` API now includes :data:`~ssl.VERIFY_X509_PARTIAL_CHAIN` and :data:`~ssl.VERIFY_X509_STRICT` in its default flags.
pt_br: A API :func:`~ssl.create_default_context` agora inclui :data:`~ssl.VERIFY_X509_PARTIAL_CHAIN` e :data:`~ssl.VERIFY_X509_STRICT` em seus sinalizadores padrão.

source: :data:`~ssl.VERIFY_X509_STRICT` may reject pre-:rfc:`5280` or malformed certificates that the underlying OpenSSL implementation might otherwise accept. Whilst disabling this is not recommended, you can do so using:
pt_br: :data:`~ssl.VERIFY_X509_STRICT` pode rejeitar certificados pré-:rfc:`5280` ou malformados que a implementação OpenSSL subjacente poderia aceitar. Embora não seja recomendado desativar isso, você pode fazer isso usando::

source: (Contributed by William Woodruff in :gh:`112389`.)
pt_br: (Contribuição de William Woodruff em :gh:`112389`.)

source: Add :func:`~statistics.kde` for kernel density estimation. This makes it possible to estimate a continuous probability density function from a fixed number of discrete samples. (Contributed by Raymond Hettinger in :gh:`115863`.)
pt_br: Adiciona :func:`~statistics.kde` para estimativa de densidade do núcleo. Isto torna possível estimar uma função de densidade de probabilidade contínua a partir de um número fixo de amostras discretas. (Contribuição de Raymond Hettinger em :gh:`115863`.)

source: Add :func:`~statistics.kde_random` for sampling from an estimated probability density function created by :func:`~statistics.kde`. (Contributed by Raymond Hettinger in :gh:`115863`.)
pt_br: Adiciona :func:`~statistics.kde_random` para amostragem de uma função de densidade de probabilidade estimada criada por :func:`~statistics.kde`. (Contribuição de Raymond Hettinger em :gh:`115863`.)

source: The :mod:`subprocess` module now uses the :func:`~os.posix_spawn` function in more situations.
pt_br: O módulo :mod:`subprocess` agora usa a função :func:`~os.posix_spawn` em mais situações.

source: Notably, when *close_fds* is ``True`` (the default), :func:`~os.posix_spawn` will be used when the C library provides :c:func:`!posix_spawn_file_actions_addclosefrom_np`, which includes recent versions of Linux, FreeBSD, and Solaris. On Linux, this should perform similarly to the existing Linux :c:func:`!vfork` based code.
pt_br: Notavelmente, quando *close_fds* é ``True`` (o padrão), :func:`~os.posix_spawn` será usado quando a biblioteca C fornecer :c:func:`!posix_spawn_file_actions_addclosefrom_np`, que inclui versões recentes do Linux, FreeBSD e Solaris. No Linux, isso deve ter um desempenho semelhante ao código existente baseado em :c:func:`!vfork` do Linux.

source: A private control knob :attr:`!subprocess._USE_POSIX_SPAWN` can be set to ``False`` if you need to force :mod:`subprocess` to never use :func:`~os.posix_spawn`. Please report your reason and platform details in the :ref:`issue tracker <using-the-tracker>` if you set this so that we can improve our API selection logic for everyone. (Contributed by Jakub Kulik in :gh:`113117`.)
pt_br: Um botão de controle privado :attr:`!subprocess._USE_POSIX_SPAWN` pode ser definido como ``False`` se você precisar forçar :mod:`subprocess` a nunca usar :func:`~os.posix_spawn`. Por favor, informe o motivo e os detalhes da plataforma no :ref:`rastreador de problemas <using-the-tracker>` se você definir isso para que possamos melhorar nossa lógica de seleção de API para todos. (Contribuído por Jakub Kulik em :gh:`113117`.)

source: Add the :func:`~sys._is_interned` function to test if a string was interned. This function is not guaranteed to exist in all implementations of Python. (Contributed by Serhiy Storchaka in :gh:`78573`.)
pt_br: Adiciona a função :func:`~sys._is_interned` para testar se uma string foi internada. Não há garantia de que esta função exista em todas as implementações do Python. (Contribuição de Serhiy Storchaka em :gh:`78573`.)

source: On Windows, the default mode ``0o700`` used by :func:`tempfile.mkdtemp` now limits access to the new directory due to changes to :func:`os.mkdir`. This is a mitigation for :cve:`2024-4030`. (Contributed by Steve Dower in :gh:`118486`.)
pt_br: No Windows, o modo padrão ``0o700`` usado por :func:`tempfile.mkdtemp` agora limita o acesso ao novo diretório devido a alterações em :func:`os.mkdir`. Esta é uma mitigação para :cve:`2024-4030`. (Contribuição de Steve Dower em :gh:`118486`.)
