Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: Many functions now emit a warning if a boolean value is passed as a file descriptor argument. This can help catch some errors earlier. (Contributed by Serhiy Storchaka in :gh:`82626`.)
pt_br: Muitas funções agora emitem um aviso se um valor booleano for passado como argumento do descritor de arquivo. Isso pode ajudar a detectar alguns erros mais cedo. (Contribuição de Serhiy Storchaka em :gh:`82626`.)

source: Added :attr:`!name` and :attr:`!mode` attributes for compressed and archived file-like objects in the :mod:`bz2`, :mod:`lzma`, :mod:`tarfile`, and :mod:`zipfile` modules. (Contributed by Serhiy Storchaka in :gh:`115961`.)
pt_br: Adicionados atributos :attr:`!name` e :attr:`!mode` para objetos arquivo ou similar compactados e arquivados nos módulos :mod:`bz2`, :mod:`lzma`, :mod:`tarfile` e :mod:`zipfile`. (Contribuição de Serhiy Storchaka em :gh:`115961`.)

source: New Modules
pt_br: Novos módulos

source: :mod:`dbm.sqlite3`: An SQLite backend for :mod:`dbm`. (Contributed by Raymond Hettinger and Erlend E. Aasland in :gh:`100414`.)
pt_br: :mod:`dbm.sqlite3`: um backend SQLite para :mod:`dbm`. (Contribuição de Raymond Hettinger e Erlend E. Aasland em :gh:`100414`.)

source: Improved Modules
pt_br: Módulos melhorados

source: Add the *deprecated* parameter to the :meth:`~argparse.ArgumentParser.add_argument` and :meth:`!add_parser` methods, to enable deprecating command-line options, positional arguments, and subcommands. (Contributed by Serhiy Storchaka in :gh:`83648`.)
pt_br: Adiciona o parâmetro *deprecated* aos métodos :meth:`~argparse.ArgumentParser.add_argument` e :meth:`!add_parser`, o qual permite descontinuar opções de linha de comando, argumentos posicionais e subcomandos. (Contribuição de Serhiy Storchaka em :gh:`83648`.)

source: Add the ``'w'`` type code (``Py_UCS4``) for Unicode characters. It should be used instead of the deprecated ``'u'`` type code. (Contributed by Inada Naoki in :gh:`80480`.)
pt_br: Adiciona o código do tipo ``'w'`` (``Py_UCS4``) para caracteres Unicode. Ele deve ser usado no lugar do código do tipo ``'u'`` descontinuado. (Contribuição de Inada Naoki em :gh:`80480`.)

source: Register :class:`array.array` as a :class:`~collections.abc.MutableSequence` by implementing the :meth:`~array.array.clear` method. (Contributed by Mike Zimin in :gh:`114894`.)
pt_br: Registra :class:`array.array` como :class:`~collections.abc.MutableSequence` implementando o método :meth:`~array.array.clear`. (Contribuição de Mike Zimin em :gh:`114894`.)

source: The constructors of node types in the :mod:`ast` module are now stricter in the arguments they accept, with more intuitive behavior when arguments are omitted.
pt_br: Os construtores dos tipos de nós no módulo :mod:`ast` agora são mais rígidos nos argumentos que aceitam, com um comportamento mais intuitivo quando os argumentos são omitidos.

source: If an optional field on an AST node is not included as an argument when constructing an instance, the field will now be set to ``None``. Similarly, if a list field is omitted, that field will now be set to an empty list, and if an :class:`!expr_context` field is omitted, it defaults to :class:`Load() <ast.Load>`. (Previously, in all cases, the attribute would be missing on the newly constructed AST node instance.)
pt_br: Se um campo opcional em um nó da AST não for incluído como argumento ao construir uma instância, o campo agora será definido como ``None``. Da mesma forma, se um campo de lista for omitido, esse campo será agora definido como uma lista vazia, e se um campo :class:`!expr_context` for omitido, o padrão será :class:`Load() <ast.Load>`. (Anteriormente, em todos os casos, o atributo estaria ausente na instância do nó da AST recém-construída.)

source: In all other cases, where a required argument is omitted, the node constructor will emit a :exc:`DeprecationWarning`. This will raise an exception in Python 3.15. Similarly, passing a keyword argument to the constructor that does not map to a field on the AST node is now deprecated, and will raise an exception in Python 3.15.
pt_br: Em todos os outros casos, nos quais um argumento é omitido, o construtor de nós vai emitir uma :exc:`DeprecationWarning`. Isso vai levantar uma exceção no Python 3.15. Da mesma forma, passar um argumento nomeado para o construtor que não mapeia para um campo no nó da AST agora está descontinuado e vai levantar uma exceção no Python 3.15.

source: These changes do not apply to user-defined subclasses of :class:`ast.AST` unless the class opts in to the new behavior by defining the :attr:`.AST._field_types` mapping.
pt_br: Estas mudanças não se aplicam às subclasses de :class:`ast.AST` definidas pelo usuário, a menos que a classe opte pelo novo comportamento definindo o mapeamento :attr:`.AST._field_types`.

source: (Contributed by Jelle Zijlstra in :gh:`105858`, :gh:`117486`, and :gh:`118851`.)
pt_br: (Contribuição de Jelle Zijlstra em :gh:`105858`, :gh:`117486` e :gh:`118851`.)

source: :func:`ast.parse` now accepts an optional argument *optimize* which is passed on to :func:`compile`. This makes it possible to obtain an optimized AST. (Contributed by Irit Katriel in :gh:`108113`.)
pt_br: :func:`ast.parse` agora aceita um argumento opcional *optimize* que é passado para :func:`compile`. Isto torna possível obter uma AST otimizada. (Contribuição de Irit Katriel em :gh:`108113`.)

source: :func:`asyncio.as_completed` now returns an object that is both an :term:`asynchronous iterator` and a plain :term:`iterator` of :term:`awaitables <awaitable>`. The awaitables yielded by asynchronous iteration include original task or future objects that were passed in, making it easier to associate results with the tasks being completed. (Contributed by Justin Arthur in :gh:`77714`.)
pt_br: :func:`asyncio.as_completed` agora retorna um objeto que é ao mesmo tempo um :term:`iterador assíncrono` e um :term:`iterator` simples de :term:`aguardáveis <awaitable>`. Os aguardáveis gerados pela iteração assíncrona incluem tarefas originais ou objetos futuros que foram passados, facilitando a associação dos resultados às tarefas que estão sendo concluídas. (Contribuição de Justin Arthur em :gh:`77714`.)

source: :meth:`asyncio.loop.create_unix_server` will now automatically remove the Unix socket when the server is closed. (Contributed by Pierre Ossman in :gh:`111246`.)
pt_br: :meth:`asyncio.loop.create_unix_server` agora removerá automaticamente o soquete Unix quando o servidor for fechado. (Contribuição de Pierre Ossman em :gh:`111246`.)

source: :meth:`.DatagramTransport.sendto` will now send zero-length datagrams if called with an empty bytes object. The transport flow control also now accounts for the datagram header when calculating the buffer size. (Contributed by Jamie Phan in :gh:`115199`.)
pt_br: :meth:`.DatagramTransport.sendto` agora enviará datagramas de comprimento zero se for chamado com um objeto de bytes vazios. O controle de fluxo de transporte agora também leva em conta o cabeçalho do datagrama ao calcular o tamanho do buffer. (Contribuição de Jamie Phan em :gh:`115199`.)

source: Add :meth:`Queue.shutdown <asyncio.Queue.shutdown>` and :exc:`~asyncio.QueueShutDown` to manage queue termination. (Contributed by Laurie Opperman and Yves Duprat in :gh:`104228`.)
pt_br: Adiciona :meth:`Queue.shutdown <asyncio.Queue.shutdown>` e :exc:`~asyncio.QueueShutDown` para gerenciar a terminação da fila. (Contribuição de Laurie Opperman e Yves Duprat em :gh:`104228`.)

source: Add the :meth:`.Server.close_clients` and :meth:`.Server.abort_clients` methods, which more forcefully close an asyncio server. (Contributed by Pierre Ossman in :gh:`113538`.)
pt_br: Adiciona os métodos :meth:`.Server.close_clients` e :meth:`.Server.abort_clients`, que fecham de forma mais forçada um servidor asyncio. (Contribuição de Pierre Ossman em :gh:`113538`.)

source: Accept a tuple of separators in :meth:`.StreamReader.readuntil`, stopping when any one of them is encountered. (Contributed by Bruce Merry in :gh:`81322`.)
pt_br: Aceita uma tupla de separadores em :meth:`.StreamReader.readuntil`, parando quando qualquer um deles for encontrado. (Contribuição de Bruce Merry em :gh:`81322`.)

source: Improve the behavior of :class:`~asyncio.TaskGroup` when an external cancellation collides with an internal cancellation. For example, when two task groups are nested and both experience an exception in a child task simultaneously, it was possible that the outer task group would hang, because its internal cancellation was swallowed by the inner task group.
pt_br: Melhora o comportamento de :class:`~asyncio.TaskGroup` quando um cancelamento externo colide com um cancelamento interno. Por exemplo, quando dois grupos de tarefas estão aninhados e ambos experimentam uma exceção em uma tarefa filho simultaneamente, é possível que o grupo de tarefas externo seja interrompido, porque seu cancelamento interno foi engolido pelo grupo de tarefas interno.

source: In the case where a task group is cancelled externally and also must raise an :exc:`ExceptionGroup`, it will now call the parent task's :meth:`~asyncio.Task.cancel` method. This ensures that a :exc:`~asyncio.CancelledError` will be raised at the next :keyword:`await`, so the cancellation is not lost.
pt_br: No caso em que um grupo de tarefas é cancelado externamente e também deve levantar :exc:`ExceptionGroup`, ele agora chamará o método :meth:`~asyncio.Task.cancel` da tarefa pai. Isso garante que uma :exc:`~asyncio.CancelledError` será levantada no próximo :keyword:`await`, para que o cancelamento não seja perdido.

source: An added benefit of these changes is that task groups now preserve the cancellation count (:meth:`~asyncio.Task.cancelling`).
pt_br: Um benefício adicional dessas mudanças é que os grupos de tarefas agora preservam a contagem de cancelamentos (:meth:`~asyncio.Task.cancelling`).

source: In order to handle some corner cases, :meth:`~asyncio.Task.uncancel` may now reset the undocumented ``_must_cancel`` flag when the cancellation count reaches zero.
pt_br: Para lidar com alguns casos extremos, :meth:`~asyncio.Task.uncancel` agora pode redefinir o sinalizador não documentado ``_must_cancel`` quando a contagem de cancelamentos chegar a zero.

source: (Inspired by an issue reported by Arthur Tacca in :gh:`116720`.)
pt_br: (Inspirado por um relatório de problema enviado por Arthur Tacca em :gh:`116720`.)

source: When :meth:`.TaskGroup.create_task` is called on an inactive :class:`~asyncio.TaskGroup`, the given coroutine will be closed (which prevents a :exc:`RuntimeWarning` about the given coroutine being never awaited). (Contributed by Arthur Tacca and Jason Zhang in :gh:`115957`.)
pt_br: Quando :meth:`.TaskGroup.create_task` é chamado em um :class:`~asyncio.TaskGroup` inativo, a corrotina fornecida será fechada (o que evita um :exc:`RuntimeWarning` sobre uma corrotina que nunca foi aguardada). (Contribuição de Arthur Tacca e Jason Zhang em :gh:`115957`.)

source: The function and methods named ``create_task`` have received a new ``**kwargs`` argument that is passed through to the task constructor. This change was accidentally added in 3.13.3, and broke the API contract for custom task factories. Several third-party task factories implemented workarounds for this. In 3.13.4 and later releases the old factory contract is honored once again (until 3.14). To keep the workarounds working, the extra ``**kwargs`` argument still allows passing additional keyword arguments to :class:`~asyncio.Task` and to custom task factories.
pt_br: A função e os métodos ``create_task`` receberam um novo argumento ``**kwargs`` que é passado para o construtor da tarefa. Essa alteração foi adicionada acidentalmente na versão 3.13.3 e quebrou o contrato da API para fábricas de tarefas personalizadas. Várias fábricas de tarefas de terceiros implementaram soluções alternativas para isso. Na versão 3.13.4 e versões posteriores, o antigo contrato de fábrica é mantido novamente (até a versão 3.14). Para manter as soluções alternativas funcionando, o argumento extra ``**kwargs`` ainda permite a passagem de argumentos nomeados adicionais para :class:`~asyncio.Task` e para fábricas de tarefas personalizadas.

source: This affects the following function and methods: :meth:`asyncio.create_task`, :meth:`asyncio.loop.create_task`, :meth:`asyncio.TaskGroup.create_task`. (Contributed by Thomas Grainger in :gh:`128307`.)
pt_br: Isso afeta as seguintes funções e métodos: :meth:`asyncio.create_task`, :meth:`asyncio.loop.create_task`, :meth:`asyncio.TaskGroup.create_task`. (Contribuição de Thomas Grainger em :gh:`128307`.)

source: Add :func:`~base64.z85encode` and :func:`~base64.z85decode` functions for encoding :class:`bytes` as `Z85 data`_ and decoding Z85-encoded data to :class:`!bytes`. (Contributed by Matan Perelman in :gh:`75299`.)
pt_br: Adiciona as funções :func:`~base64.z85encode` e :func:`~base64.z85decode` para codificar :class:`bytes` como `dados Z85`_ e decodificar dados codificados em Z85 para :class:`!bytes`. (Contribuição de Matan Perelman em :gh:`75299`.)

source: The default number of worker threads and processes is now selected using :func:`os.process_cpu_count` instead of :func:`os.cpu_count`. (Contributed by Victor Stinner in :gh:`109649`.)
pt_br: O número padrão de threads e processos de trabalho é agora selecionado usando :func:`os.process_cpu_count` em vez de :func:`os.cpu_count`. (Contribuição de Victor Stinner em :gh:`109649`.)

source: :class:`~configparser.ConfigParser` now has support for unnamed sections, which allows for top-level key-value pairs. This can be enabled with the new *allow_unnamed_section* parameter. (Contributed by Pedro Sousa Lacerda in :gh:`66449`.)
pt_br: :class:`~configparser.ConfigParser` agora tem suporte para seções sem nome, o que permite pares de chave-valor de nível superior. Isso pode ser habilitado com o novo parâmetro *allow_unnamed_section*. (Contribuição de Pedro Sousa Lacerda em :gh:`66449`.)

source: The new :func:`~copy.replace` function and the :meth:`replace protocol <object.__replace__>` make creating modified copies of objects much simpler. This is especially useful when working with immutable objects. The following types support the :func:`~copy.replace` function and implement the replace protocol:
pt_br: A nova função :func:`~copy.replace` e o protocolo :meth:`replace <object.__replace__>` tornam a criação de cópias modificadas de objetos muito mais simples. Isso é especialmente útil ao trabalhar com objetos imutáveis. Os seguintes tipos dão suporte à função :func:`~copy.replace` e implementam o protocolo replace:

source: :ref:`code objects <code-objects>`
pt_br: :ref:`objetos código <code-objects>`

source: Any user-defined class can also support :func:`copy.replace` by defining the :meth:`~object.__replace__` method. (Contributed by Serhiy Storchaka in :gh:`108751`.)
pt_br: Qualquer classe definida pelo usuário também pode ter suporte a :func:`copy.replace` definindo o método :meth:`~object.__replace__`. (Contribuição de Serhiy Storchaka em :gh:`108751`.)

source: As a consequence of necessary internal refactoring, initialization of internal metaclasses now happens in ``__init__`` rather than in ``__new__``. This affects projects that subclass these internal metaclasses to provide custom initialization. Generally:
pt_br: Como consequência da refatoração interna necessária, a inicialização de metaclasses internas agora acontece em ``__init__`` em vez de ``__new__``. Isso afeta projetos que fazem subclasse dessas metaclasses internas para fornecer inicialização personalizada. De forma geral:

source: Custom logic that was done in ``__new__`` after calling ``super().__new__`` should be moved to ``__init__``.
pt_br: A lógica personalizada que foi feita em ``__new__`` após chamar ``super().__new__`` deve ser movida para ``__init__``.

source: To create a class, call the metaclass, not only the metaclass's ``__new__`` method.
pt_br: Para criar uma classe, chame a metaclasse, não apenas o método ``__new__`` da metaclasse.

source: See :gh:`124520` for discussion and links to changes in some affected projects.
pt_br: Veja :gh:`124520` para discussão e links para mudanças em alguns projetos afetados.

source: :class:`ctypes.Structure` objects have a new :attr:`~ctypes.Structure._align_` attribute which allows the alignment of the structure being packed to/from memory to be specified explicitly. (Contributed by Matt Sanderson in :gh:`112433`)
pt_br: Os objetos :class:`ctypes.Structure` têm um novo atributo :attr:`~ctypes.Structure._align_` que permite que o alinhamento da estrutura que está sendo empacotada para/da memória seja especificado explicitamente. (Contribuição de Matt Sanderson em :gh:`112433`)

source: Add :mod:`dbm.sqlite3`, a new module which implements an SQLite backend, and make it the default :mod:`!dbm` backend. (Contributed by Raymond Hettinger and Erlend E. Aasland in :gh:`100414`.)
pt_br: Adiciona :mod:`dbm.sqlite3`, um novo módulo que implementa um backend SQLite, e torna-o o backend padrão :mod:`!dbm`. (Contribuição de Raymond Hettinger e Erlend E. Aasland em :gh:`100414`.)

source: Allow removing all items from the database through the new :meth:`.gdbm.clear` and :meth:`.ndbm.clear` methods. (Contributed by Donghee Na in :gh:`107122`.)
pt_br: Permite a remoção de todos os itens do banco de dados por meio dos novos métodos :meth:`.gdbm.clear` e :meth:`.ndbm.clear`. (Contribuição de Donghee Na em :gh:`107122`.)

source: Change the output of :mod:`dis` module functions to show logical labels for jump targets and exception handlers, rather than offsets. The offsets can be added with the new :option:`-O <dis --show-offsets>` command-line option or the *show_offsets* argument. (Contributed by Irit Katriel in :gh:`112137`.)
pt_br: Altera a saída das funções do módulo :mod:`dis` para mostrar rótulos lógicos para alvos de salto e manipuladores de exceção, em vez de deslocamentos. Os deslocamentos podem ser adicionados com a nova opção de linha de comando :option:`-O <dis --show-offsets>` ou o argumento *show_offsets*. (Contribuição de Irit Katriel em :gh:`112137`.)

source: :meth:`~dis.get_instructions` no longer represents cache entries as separate instructions. Instead, it returns them as part of the :class:`~dis.Instruction`, in the new *cache_info* field. The *show_caches* argument to :meth:`~dis.get_instructions` is deprecated and no longer has any effect. (Contributed by Irit Katriel in :gh:`112962`.)
pt_br: :meth:`~dis.get_instructions` não representa mais entradas de cache como instruções separadas. Em vez disso, ele os retorna como parte de :class:`~dis.Instruction`, no novo campo *cache_info*. O argumento *show_caches* para :meth:`~dis.get_instructions` foi descontinuado e não tem mais nenhum efeito. (Contribuição de Irit Katriel em :gh:`112962`.)

source: :mod:`doctest` output is now colored by default. This can be controlled via the new :envvar:`PYTHON_COLORS` environment variable as well as the canonical |NO_COLOR|_ and |FORCE_COLOR|_ environment variables. See also :ref:`using-on-controlling-color`. (Contributed by Hugo van Kemenade in :gh:`117225`.)
pt_br: A saída do :mod:`doctest` é agora colorida por padrão. Isso pode ser controlado através da nova variável de ambiente :envvar:`PYTHON_COLORS`, bem como das variáveis de ambiente canônicas |NO_COLOR|_ e |FORCE_COLOR|_. Veja também :ref:`using-on-controlling-color`. (Contribuição de Hugo van Kemenade em :gh:`117225`.)

source: The :meth:`.DocTestRunner.run` method now counts the number of skipped tests. Add the :attr:`.DocTestRunner.skips` and :attr:`.TestResults.skipped` attributes. (Contributed by Victor Stinner in :gh:`108794`.)
pt_br: O método :meth:`.DocTestRunner.run` agora conta o número de testes ignorados. Adiciona os atributos :attr:`.DocTestRunner.skips` e :attr:`.TestResults.skipped`. (Contribuição de Victor Stinner em :gh:`108794`.)

source: Headers with embedded newlines are now quoted on output. The :mod:`~email.generator` will now refuse to serialize (write) headers that are improperly folded or delimited, such that they would be parsed as multiple headers or joined with adjacent data. If you need to turn this safety feature off, set :attr:`~email.policy.Policy.verify_generated_headers`. (Contributed by Bas Bloemsaat and Petr Viktorin in :gh:`121650`.)
pt_br: Cabeçalhos com novas linhas embutidas são agora colocadas entre aspas na saída. O :mod:`~email.generator` agora se recusará a serializar (escrever) cabeçalhos que estão dobrados ou delimitados incorretamente, de modo que eles seriam analisados como vários cabeçalhos ou unidos a dados adjacentes. Se você precisar desativar esse recurso de segurança, defina :attr:`~email.policy.Policy.verify_generated_headers`. (Contribuição de Bas Bloemsaat e Petr Viktorin em :gh:`121650`.)

source: :func:`~email.utils.getaddresses` and :func:`~email.utils.parseaddr` now return ``('', '')`` pairs in more situations where invalid email addresses are encountered instead of potentially inaccurate values. The two functions have a new optional *strict* parameter (default ``True``). To get the old behavior (accepting malformed input), use ``strict=False``. ``getattr(email.utils, 'supports_strict_parsing', False)`` can be used to check if the *strict* parameter is available. (Contributed by Thomas Dwyer and Victor Stinner for :gh:`102988` to improve the :cve:`2023-27043` fix.)
pt_br: :func:`~email.utils.getaddresses` e :func:`~email.utils.parseaddr` agora retornam pares ``('', '')`` em mais situações onde endereços de e-mail inválidos são encontrados em vez de valores potencialmente imprecisos. As duas funções têm agora um novo parâmetro opcional *strict* (padrão ``True``). Para obter o comportamento antigo (aceitar entrada malformada), ``strict=False``. ``getattr(email.utils, 'supports_strict_parsing', False)`` pode ser usado para verificar se o parâmetro *strict* está disponível. (Contribuição de Thomas Dwyer e Victor Stinner para :gh:`102988` para melhorar a correção :cve:`2023-27043`.)

source: :class:`~enum.EnumDict` has been made public to better support subclassing :class:`~enum.EnumType`.
pt_br: :class:`~enum.EnumDict` foi tornada pública para melhor suporte às subclasses de :class:`~enum.EnumType`.

source: :class:`~fractions.Fraction` objects now support the standard :ref:`format specification mini-language <formatspec>` rules for fill, alignment, sign handling, minimum width, and grouping. (Contributed by Mark Dickinson in :gh:`111320`.)
pt_br: Os objetos :class:`~fractions.Fraction` agora oferecem suporte às regras padrões da :ref:`minilinguagem de especificação de formato <formatspec>` para preenchimento, alinhamento, manipulação de sinais, largura mínima e agrupamento. (Contribuição de Mark Dickinson em :gh:`111320`.)

source: Add :func:`~glob.translate`, a function to convert a path specification with shell-style wildcards to a regular expression. (Contributed by Barney Gale in :gh:`72904`.)
pt_br: Adiciona :func:`~glob.translate`, uma função que converte uma especificação de caminho com curingas estilo shell em uma expressão regular. (Contribuição de Barney Gale em :gh:`72904`.)

source: The following functions in :mod:`importlib.resources` now allow accessing a directory (or tree) of resources, using multiple positional arguments (the *encoding* and *errors* arguments in the text-reading functions are now keyword-only):
pt_br: As seguintes funções em :mod:`importlib.resources` agora permitem acessar um diretório (ou árvore) de recursos, usando múltiplos argumentos posicionais (os argumentos *encoding* e *errors* nas funções de leitura de texto agora são somente-nomeados):
