Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: Remove support for chained :class:`classmethod` descriptors (introduced in :gh:`63272`). These can no longer be used to wrap other descriptors, such as :class:`property`. The core design of this feature was flawed and led to several problems. To "pass-through" a :class:`classmethod`, consider using the :attr:`!__wrapped__` attribute that was added in Python 3.10. (Contributed by Raymond Hettinger in :gh:`89519`.)
pt_br: Remove suporte aos descritores :class:`classmethod` encadeados (introduzidos em :gh:`63272`). Eles não podem mais serem usados para agrupar outros descritores como :class:`property`. O design central desse recurso apresentava falhas e levou a problemas. Para "passar" um :class:`classmethod`, considere usar o atributo :attr:`!__wrapped__` que foi adicionado no Python 3.10. (Contribuição de Raymond Hettinger em :gh:`89519`.)

source: Raise a :exc:`RuntimeError` when calling :meth:`frame.clear` on a suspended frame (as has always been the case for an executing frame). (Contributed by Irit Katriel in :gh:`79932`.)
pt_br: Chamar :meth:`frame.clear` em um quadro suspenso levanta :exc:`RuntimeError` (como sempre foi o caso para um quadro em execução). (Contribuição de Irit Katriel em :gh:`79932`.)

source: Remove the undocumented :class:`!LegacyInterpolation` class, deprecated in the docstring since Python 3.2, and at runtime since Python 3.11. (Contributed by Hugo van Kemenade in :gh:`104886`.)
pt_br: Remove a classe não documentada :class:`!LegacyInterpolation`, descontinuada na docstring desde Python 3.2 e em tempo de execução desde Python 3.11. (Contribuição de Hugo van Kemenade em :gh:`104886`.)

source: Remove deprecated subscript (:meth:`~object.__getitem__`) access for :ref:`EntryPoint <entry-points>` objects. (Contributed by Jason R. Coombs in :gh:`113175`.)
pt_br: Remove o acesso descontinuado a subscrito (:meth:`~object.__getitem__`) para objetos :ref:`EntryPoint <entry-points>`. (Contribuição de Jason R. Coombs em :gh:`113175`.)

source: Remove the :func:`!locale.resetlocale` function, deprecated in Python 3.11. Use ``locale.setlocale(locale.LC_ALL, "")`` instead. (Contributed by Victor Stinner in :gh:`104783`.)
pt_br: Remove a função :func:`!locale.resetlocale`, descontinuada no Python 3.11. Use ``locale.setlocale(locale.LC_ALL, "")``. (Contribuição de Victor Stinner em :gh:`104783`.)

source: Move :attr:`!opcode.ENABLE_SPECIALIZATION` to :attr:`!_opcode.ENABLE_SPECIALIZATION`. This field was added in 3.12, it was never documented, and is not intended for external use. (Contributed by Irit Katriel in :gh:`105481`.)
pt_br: Move :attr:`!opcode.ENABLE_SPECIALIZATION` para :attr:`!_opcode.ENABLE_SPECIALIZATION`. Este campo foi adicionado na versão 3.12, nunca foi documentado e não se destina ao uso externo. (Contribuição de Irit Katriel em :gh:`105481`.)

source: Remove :func:`!opcode.is_pseudo`, :attr:`!opcode.MIN_PSEUDO_OPCODE`, and :attr:`!opcode.MAX_PSEUDO_OPCODE`, which were added in Python 3.12, but were neither documented nor exposed through :mod:`dis`, and were not intended to be used externally. (Contributed by Irit Katriel in :gh:`105481`.)
pt_br: Remove :func:`!opcode.is_pseudo`, :attr:`!opcode.MIN_PSEUDO_OPCODE` e :attr:`!opcode.MAX_PSEUDO_OPCODE`, que foram adicionados no Python 3.12, mas nunca foram documentados nem expostos através de :mod:`dis`, e não foram planejados para serem usados externamente. (Contribuição de Irit Katriel em :gh:`105481`.)

source: This module is no longer considered :term:`soft deprecated`. While :mod:`argparse` remains preferred for new projects that aren't using a third party command line argument processing library, there are aspects of the way ``argparse`` works that mean the lower level ``optparse`` module may provide a better foundation for *writing* argument processing libraries, and for implementing command line applications which adhere more strictly than ``argparse`` does to various Unix command line processing conventions that originate in the behaviour of the C :c:func:`!getopt` function . (Contributed by Alyssa Coghlan and Serhiy Storchaka in :gh:`126180`.)
pt_br: Este módulo não é mais considerado :term:`suavemente descontinuado`. Enquanto o :mod:`argparse` continua sendo o preferido para novos projetos que não estão usando uma biblioteca de processamento de argumentos de linha de comando de terceiros, há aspectos da maneira como ``argparse`` funciona que significam que o módulo ``optparse`` de nível inferior pode fornecer uma base melhor para *escrever* bibliotecas de processamento de argumentos e para implementar aplicações de linha de comando que aderem mais estritamente do que ``argparse`` a várias convenções de processamento de linha de comando Unix que se originam no comportamento da função C :c:func:`!getopt`. (Contribuição de Alyssa Coghlan e Serhiy Storchaka em :gh:`126180`.)

source: Remove the ability to use :class:`~pathlib.Path` objects as context managers. This functionality was deprecated and has had no effect since Python 3.9. (Contributed by Barney Gale in :gh:`83863`.)
pt_br: Remove a capacidade de usar objetos :class:`~pathlib.Path` como gerenciadores de contexto. Essa funcionalidade foi descontinuada e não tinha efeito desde o Python 3.9. (Contribuição de Barney Gale em :gh:`83863`.)

source: Remove the undocumented, deprecated, and broken :func:`!re.template` function and :attr:`!re.TEMPLATE` / :attr:`!re.T` flag. (Contributed by Serhiy Storchaka and Nikita Sobolev in :gh:`105687`.)
pt_br: Remove a função :func:`!re.template` não documentada, descontinuada e quebrada e o sinalizador :attr:`!re.TEMPLATE` / :attr:`!re.T`. (Contribuição de Serhiy Storchaka e Nikita Sobolev em :gh:`105687`.)

source: Remove the :mod:`!tkinter.tix` module, deprecated in Python 3.6. The third-party Tix library which the module wrapped is unmaintained. (Contributed by Zachary Ware in :gh:`75552`.)
pt_br: Remove o módulo :mod:`!tkinter.tix`, descontinuado no Python 3.6. A biblioteca Tix de terceiros que o módulo empacota não é mantida. (Contribuição de Zachary Ware em :gh:`75552`.)

source: Remove the :meth:`!RawTurtle.settiltangle` method, deprecated in the documentation since Python 3.1 and at runtime since Python 3.11. (Contributed by Hugo van Kemenade in :gh:`104876`.)
pt_br: Remove o método :meth:`!RawTurtle.settiltangle`, descontinuado na documentação desde o Python 3.1 e em tempo de execução desde o Python 3.11. (Contribuição de Hugo van Kemenade em :gh:`104876`.)

source: Remove the :mod:`!typing.io` and :mod:`!typing.re` namespaces, deprecated since Python 3.8. The items in those namespaces can be imported directly from the :mod:`typing` module. (Contributed by Sebastian Rittau in :gh:`92871`.)
pt_br: Remove os espaços de nomes :mod:`!typing.io` e :mod:`!typing.re`, descontinuados desde o Python 3.8. Os itens nesses espaços de nomes podem ser importados diretamente do módulo :mod:`typing`. (Contribuição de Sebastian Rittau em :gh:`92871`.)

source: Remove the keyword-argument method of creating :class:`~typing.TypedDict` types, deprecated in Python 3.11. (Contributed by Tomas Roun in :gh:`104786`.)
pt_br: Remove o método de argumento nomeado de criação de tipos :class:`~typing.TypedDict`, descontinuados no Python 3.11. (Contribuição de Tomas Roun em :gh:`104786`.)

source: Remove the following :mod:`unittest` functions, deprecated in Python 3.11:
pt_br: Remove as seguintes funções :mod:`unittest`, descontinuadas no Python 3.11:

source: Use :class:`~unittest.TestLoader` methods instead:
pt_br: Em vez delas, use os métodos de :class:`~unittest.TestLoader`:

source: (Contributed by Hugo van Kemenade in :gh:`104835`.)
pt_br: (Contribuição de Hugo van Kemenade em :gh:`104835`.)

source: Remove the untested and undocumented :meth:`!TestProgram.usageExit` method, deprecated in Python 3.11. (Contributed by Hugo van Kemenade in :gh:`104992`.)
pt_br: Remove o método :meth:`!TestProgram.usageExit` não testado e não documentado, descontinuado no Python 3.11. (Contribuição de Hugo van Kemenade em :gh:`104992`.)

source: Remove the *cafile*, *capath*, and *cadefault* parameters of the :func:`urllib.request.urlopen` function, deprecated in Python 3.6. Use the *context* parameter instead with an :class:`~ssl.SSLContext` instance. The :meth:`ssl.SSLContext.load_cert_chain` function can be used to load specific certificates, or let :func:`ssl.create_default_context` select the operating system's trusted certificate authority (CA) certificates. (Contributed by Victor Stinner in :gh:`105382`.)
pt_br: Remove os parâmetros *cafile*, *capath* e *cadefault* da função :func:`urllib.request.urlopen`, descontinuada no Python 3.6. Em vez disso, use o parâmetro *context* com uma instância de :class:`~ssl.SSLContext`. A função :meth:`ssl.SSLContext.load_cert_chain` pode ser usada para carregar certificados específicos ou deixe :func:`ssl.create_default_context` selecionar os certificados de autoridade certificadora (AC) confiável do sistema operacional. (Contribuição de Victor Stinner em :gh:`105382`.)

source: Remove the untested and undocumented :class:`!MacOSX` class, deprecated in Python 3.11. Use the :class:`!MacOSXOSAScript` class (introduced in Python 3.2) instead. (Contributed by Hugo van Kemenade in :gh:`104804`.)
pt_br: Remove a classe :class:`!MacOSX` não testada e não documentada, descontinuada no Python 3.11. Use a classe :class:`!MacOSXOSAScript` (introduzida no Python 3.2). (Contribuição de Hugo van Kemenade em :gh:`104804`.)

source: Remove the deprecated :attr:`!MacOSXOSAScript._name` attribute. Use the :attr:`MacOSXOSAScript.name <webbrowser.controller.name>` attribute instead. (Contributed by Nikita Sobolev in :gh:`105546`.)
pt_br: Remove o atributo descontinuado :attr:`!MacOSXOSAScript._name`. Use o atributo :attr:`MacOSXOSAScript.name <webbrowser.controller.name>`. (Contribuição de Nikita Sobolev em :gh:`105546`.)

source: New Deprecations
pt_br: Novas descontinuações

source: :ref:`User-defined functions <user-defined-funcs>`:
pt_br: :ref:`Funções definidas pelo usuário <user-defined-funcs>`:

source: Deprecate assignment to a function's :attr:`~function.__code__` attribute, where the new code object's type does not match the function's type. The different types are: plain function, generator, async generator, and coroutine. (Contributed by Irit Katriel in :gh:`81137`.)
pt_br: A atribuição ao atributo :attr:`~function.__code__` de uma função onde o tipo do novo objeto código não corresponde ao tipo da função está descontinuada. Os diferentes tipos são: função simples, gerador, gerador assíncrono e corrotina. (Contribuição de Irit Katriel em :gh:`81137`.)

source: Deprecate the ``'u'`` format code (:c:type:`wchar_t`) at runtime. This format code has been deprecated in documentation since Python 3.3, and will be removed in Python 3.16. Use the ``'w'`` format code (:c:type:`Py_UCS4`) for Unicode characters instead. (Contributed by Hugo van Kemenade in :gh:`80480`.)
pt_br: Descontinua o código de formato ``'u'`` (:c:type:`wchar_t`). Este código de formato foi descontinuado na documentação desde o Python 3.3 e será removido no Python 3.16. Use o código de formato ``'w'`` (:c:type:`Py_UCS4`) para caracteres Unicode. (Contribuição de Hugo van Kemenade em :gh:`80480`.)

source: Deprecate the undocumented :func:`!SetPointerType` function, to be removed in Python 3.15. (Contributed by Victor Stinner in :gh:`105733`.)
pt_br: Descontinua a função não documentada :func:`!SetPointerType`, que será removida no Python 3.15. (Contribuição de Victor Stinner em :gh:`105733`.)

source: :term:`Soft-deprecate <soft deprecated>` the :func:`~ctypes.ARRAY` function in favour of ``type * length`` multiplication. (Contributed by Victor Stinner in :gh:`105733`.)
pt_br: :term:`Descontinua suavemente <soft deprecated>` a função :func:`~ctypes.ARRAY` em favor da multiplicação ``type * length``. (Contribuição de Victor Stinner em :gh:`105733`.)

source: Deprecate the non-standard and undocumented :class:`~decimal.Decimal` format specifier ``'N'``, which is only supported in the :mod:`!decimal` module's C implementation. (Contributed by Serhiy Storchaka in :gh:`89902`.)
pt_br: Descontinua o especificador de formato de :class:`~decimal.Decimal` não padrão e não documentado ``'N'``, que só é suportado na implementação C do módulo :mod:`!decimal`. (Contribuição de Serhiy Storchaka em :gh:`89902`.)

source: Deprecate the :attr:`!HAVE_ARGUMENT` separator. Check membership in :data:`~dis.hasarg` instead. (Contributed by Irit Katriel in :gh:`109319`.)
pt_br: Descontinua o separador :attr:`!HAVE_ARGUMENT`. Em vez disso, Verifique a associação em :data:`~dis.hasarg`. (Contribuição de Irit Katriel em :gh:`109319`.)

source: Deprecate non-integer numbers as arguments to functions and methods that consider plural forms in the :mod:`!gettext` module, even if no translation was found. (Contributed by Serhiy Storchaka in :gh:`88434`.)
pt_br: Descontinua números não inteiros como argumentos para funções e métodos que consideram formas plurais no módulo :mod:`!gettext`, ainda que nenhuma tradução tenha sido encontrada. (Contribuição de Serhiy Storchaka em :gh:`88434`.)

source: Deprecate the undocumented :func:`!glob0` and :func:`!glob1` functions. Use :func:`~glob.glob` and pass a :term:`path-like object` specifying the root directory to the *root_dir* parameter instead. (Contributed by Barney Gale in :gh:`117337`.)
pt_br: Descontinua as funções não documentadas :func:`!glob0` e :func:`!glob1`. Em vez disso, use :func:`~glob.glob` e passe um :term:`objeto caminho ou similar` especificando o diretório raiz para o parâmetro *root_dir*. (Contribuição de Barney Gale em :gh:`117337`.)

source: Deprecate :class:`~http.server.CGIHTTPRequestHandler`, to be removed in Python 3.15. Process-based CGI HTTP servers have been out of favor for a very long time. This code was outdated, unmaintained, and rarely used. It has a high potential for both security and functionality bugs. (Contributed by Gregory P. Smith in :gh:`109096`.)
pt_br: Descontinua :class:`~http.server.CGIHTTPRequestHandler`, a ser removido no Python 3.15. Servidores HTTP CGI baseados em processos estão fora de moda há muito tempo. Este código estava desatualizado, sem manutenção e raramente era usado. Ele tem um alto potencial para bugs de segurança e funcionalidade. (Contribuição de Gregory P. Smith em :gh:`109096`.)

source: Deprecate the :option:`!--cgi` flag to the :program:`python -m http.server` command-line interface, to be removed in Python 3.15. (Contributed by Gregory P. Smith in :gh:`109096`.)
pt_br: Descontinua o sinalizador :option:`!--cgi` para a interface de linha de comando :program:`python -m http.server`, a ser removido no Python 3.15. (Contribuição de Gregory P. Smith em :gh:`109096`.)

source: :term:`Soft-deprecate <soft deprecated>` file path arguments to :func:`~mimetypes.guess_type`, use :func:`~mimetypes.guess_file_type` instead. (Contributed by Serhiy Storchaka in :gh:`66543`.)
pt_br: :term:`Descontinua suavemente <soft deprecated>` argumentos caminho de arquivo para :func:`~mimetypes.guess_type`, use :func:`~mimetypes.guess_file_type` em vez disso. (Contribuição de Serhiy Storchaka em :gh:`66543`.)

source: Deprecate passing the optional *maxsplit*, *count*, or *flags* arguments as positional arguments to the module-level :func:`~re.split`, :func:`~re.sub`, and :func:`~re.subn` functions. These parameters will become :ref:`keyword-only <keyword-only_parameter>` in a future version of Python. (Contributed by Serhiy Storchaka in :gh:`56166`.)
pt_br: Descontinua a passagem dos argumentos opcionais *maxsplit*, *count* ou *flags* como argumentos posicionais para as funções de nível de módulo :func:`~re.split`, :func:`~re.sub` e :func:`~re.subn`. Esses parâmetros se tornarão :ref:`somente-nomeados <keyword-only_parameter>` em uma versão futura do Python. (Contribuição de Serhiy Storchaka em :gh:`56166`.)

source: Deprecate :meth:`.PurePath.is_reserved`, to be removed in Python 3.15. Use :func:`os.path.isreserved` to detect reserved paths on Windows. (Contributed by Barney Gale in :gh:`88569`.)
pt_br: Descontinua :meth:`.PurePath.is_reserved`, a ser removido no Python 3.15. Use :func:`os.path.isreserved` para detectar caminhos reservados no Windows. (Contribuição de Barney Gale em :gh:`88569`.)

source: Deprecate :func:`~platform.java_ver`, to be removed in Python 3.15. This function is only useful for Jython support, has a confusing API, and is largely untested. (Contributed by Nikita Sobolev in :gh:`116349`.)
pt_br: Descontinua :func:`~platform.java_ver`, a ser removida no Python 3.15. Esta função é útil apenas para suporte a Jython, tem uma API confusa e é amplamente não testada. (Contribuição de Nikita Sobolev em :gh:`116349`.)

source: Deprecate the undocumented :func:`!ispackage` function. (Contributed by Zackery Spytz in :gh:`64020`.)
pt_br: Descontinua a função não documentada :func:`!ispackage`. (Contribuição de Zackery Spytz em :gh:`64020`.)

source: Deprecate passing more than one positional argument to the :func:`~sqlite3.connect` function and the :class:`~sqlite3.Connection` constructor. The remaining parameters will become keyword-only in Python 3.15. (Contributed by Erlend E. Aasland in :gh:`107948`.)
pt_br: Descontinua a passagem de mais de um argumento posicional para a função :func:`~sqlite3.connect` e o construtor :class:`~sqlite3.Connection`. Os parâmetros restantes se tornarão somente-nomeados no Python 3.15. (Contribuição de Erlend E. Aasland em :gh:`107948`.)

source: Deprecate passing name, number of arguments, and the callable as keyword arguments for :meth:`.Connection.create_function` and :meth:`.Connection.create_aggregate` These parameters will become positional-only in Python 3.15. (Contributed by Erlend E. Aasland in :gh:`108278`.)
pt_br: Descontinua a passagem de nome, número de argumentos e o chamável como argumentos nomeados para :meth:`.Connection.create_function` e :meth:`.Connection.create_aggregate` Esses parâmetros se tornarão somente-posicionais no Python 3.15. (Contribuição de Erlend E. Aasland em :gh:`108278`.)

source: Deprecate passing the callback callable by keyword for the :meth:`~sqlite3.Connection.set_authorizer`, :meth:`~sqlite3.Connection.set_progress_handler`, and :meth:`~sqlite3.Connection.set_trace_callback` :class:`~sqlite3.Connection` methods. The callback callables will become positional-only in Python 3.15. (Contributed by Erlend E. Aasland in :gh:`108278`.)
pt_br: Descontinua a passagem do chamável de função de retorno como argumento nomeado para os métodos :meth:`~sqlite3.Connection.set_authorizer`, :meth:`~sqlite3.Connection.set_progress_handler` e :meth:`~sqlite3.Connection.set_trace_callback` da classe :class:`~sqlite3.Connection`. Os chamáveis de função de retorno se tornarão somente-posicionais no Python 3.15. (Contribuição de Erlend E. Aasland em :gh:`108278`.)

source: Deprecate the :func:`~sys._enablelegacywindowsfsencoding` function, to be removed in Python 3.16. Use the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable instead. (Contributed by Inada Naoki in :gh:`73427`.)
pt_br: Descontinua a função :func:`~sys._enablelegacywindowsfsencoding`, para ser removida no Python 3.16. Em vez disso, use a variável de ambiente :envvar:`PYTHONLEGACYWINDOWSFSENCODING`. (Contribuição de Inada Naoki em :gh:`73427`.)

source: Deprecate the undocumented and unused :attr:`!TarFile.tarfile` attribute, to be removed in Python 3.16. (Contributed in :gh:`115256`.)
pt_br: Descontinua o atributo :attr:`!TarFile.tarfile` não documentado e não utilizado, a ser removido no Python 3.16. (Contribuição em :gh:`115256`.)

source: Deprecate the :attr:`.TracebackException.exc_type` attribute. Use :attr:`.TracebackException.exc_type_str` instead. (Contributed by Irit Katriel in :gh:`112332`.)
pt_br: Descontinua o atributo :attr:`.TracebackException.exc_type`. Em vez disso, use :attr:`.TracebackException.exc_type_str`. (Contribuição de Irit Katriel em :gh:`112332`.)

source: Deprecate the undocumented keyword argument syntax for creating :class:`~typing.NamedTuple` classes (e.g. ``Point = NamedTuple("Point", x=int, y=int)``), to be removed in Python 3.15. Use the class-based syntax or the functional syntax instead. (Contributed by Alex Waygood in :gh:`105566`.)
pt_br: Descontinua a não-documentada sintaxe de argumento nomeado para criação de classes :class:`~typing.NamedTuple` (por exemplo, ``Point = NamedTuple("Point", x=int, y=int)``), para ser removido no Python 3.15. Em vez disso, use as sintaxes baseada em classe ou a funcional. (Contribuição de Alex Waygood in :gh:`105566`.)

source: Deprecate omitting the *fields* parameter when creating a :class:`~typing.NamedTuple` or :class:`typing.TypedDict` class, and deprecate passing ``None`` to the *fields* parameter of both types. Python 3.15 will require a valid sequence for the *fields* parameter. To create a NamedTuple class with zero fields, use ``class NT(NamedTuple): pass`` or ``NT = NamedTuple("NT", ())``. To create a TypedDict class with zero fields, use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})``. (Contributed by Alex Waygood in :gh:`105566` and :gh:`105570`.)
pt_br: Descontinua a omissão do parâmetro *fields* ao criar uma classe :class:`~typing.NamedTuple` ou :class:`typing.TypedDict` e descontinua a passagem de ``None`` para o parâmetro *fields* de ambos os tipos. O Python 3.15 exigirá uma sequência válida para o parâmetro *fields*. Para criar uma classe NamedTuple com zero campos, use ``class NT(NamedTuple): pass`` ou ``NT = NamedTuple("NT", ())``. Para criar uma classe TypedDict com zero campos, use ``class TD(TypedDict): pass`` ou ``TD = TypedDict("TD", {})``. (Contribuição de Alex Waygood em :gh:`105566` e :gh:`105570`.)

source: Deprecate the :func:`typing.no_type_check_decorator` decorator function, to be removed in in Python 3.15. After eight years in the :mod:`typing` module, it has yet to be supported by any major type checker. (Contributed by Alex Waygood in :gh:`106309`.)
pt_br: Descontinua o decorador de função :func:`typing.no_type_check_decorator` para ser removido no Python 3.15. Depois de oito anos no módulo :mod:`typing`, ele ainda não foi implementado por nenhum dos principais verificadores de tipos. (Contribuição de Alex Waygood em :gh:`106309`.)

source: Deprecate :data:`typing.AnyStr`. In Python 3.16, it will be removed from ``typing.__all__``, and a :exc:`DeprecationWarning` will be emitted at runtime when it is imported or accessed. It will be removed entirely in Python 3.18. Use the new :ref:`type parameter syntax <type-params>` instead. (Contributed by Michael The in :gh:`107116`.)
pt_br: Descontinua :data:`typing.AnyStr`. No Python 3.16, isso será removido de ``typing.__all__``, e uma :exc:`DeprecationWarning` será levantada em tempo de execução quando isso for importado ou acessado. Será removido completamente em Python 3.18. Em vez disso, use a nova :ref:`sintaxe de parâmetro de tipo <type-params>`. (Contribuição de Michael The em :gh:`107116`.)

source: Deprecate the :meth:`~wave.Wave_read.getmark`, :meth:`!setmark`, and :meth:`~wave.Wave_read.getmarkers` methods of the :class:`~wave.Wave_read` and :class:`~wave.Wave_write` classes, to be removed in Python 3.15. (Contributed by Victor Stinner in :gh:`105096`.)
pt_br: Descontinua os métodos :meth:`~wave.Wave_read.getmark`, :meth:`!setmark` e :meth:`~wave.Wave_read.getmarkers` das classes :class:`~wave.Wave_read` e :class:`~wave.Wave_write`, a serem removidos no Python 3.15. (Contribuição de Victor Stinner em :gh:`105096`.)

source: Pending removal in Python 3.14
pt_br: Remoção pendente no Python 3.14
