Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: CPython now bundles the `mimalloc library`_ by default. It is licensed under the MIT license; see :ref:`mimalloc license <mimalloc-license>`. The bundled mimalloc has custom changes, see :gh:`113141` for details. (Contributed by Dino Viehland in :gh:`109914`.)
pt_br: CPython agora inclui a `biblioteca mimalloc`_ por padrão. Está licenciada sob a licença do MIT; veja :ref:`licença do mimalloc <mimalloc-license>`. O mimalloc incluído tem alterações personalizadas, veja :gh:`113141` para detalhes. (Contribuição de Dino Viehland em :gh:`109914`.)

source: The :file:`configure` option :option:`--with-system-libmpdec` now defaults to ``yes``. The bundled copy of ``libmpdecimal`` will be removed in Python 3.15.
pt_br: A opção :option:`--with-system-libmpdec` do :file:`configure` agora tem como padrão ``yes``. A cópia empacotada de ``libmpdecimal`` será removida no Python 3.15.

source: Python built with :file:`configure` :option:`--with-trace-refs` (tracing references) is now ABI compatible with the Python release build and :ref:`debug build <debug-build>`. (Contributed by Victor Stinner in :gh:`108634`.)
pt_br: Python construído com :option:`--with-trace-refs` (referências de rastreamento) do :file:`configure` tem compatibilidade de ABI com a construção de lançamento do Python e a :ref:`construção de depuração <debug-build>`. (Contribuição de Victor Stinner em :gh:`108634`.)

source: On POSIX systems, the pkg-config (``.pc``) filenames now include the ABI flags. For example, the free-threaded build generates ``python-3.13t.pc`` and the debug build generates ``python-3.13d.pc``.
pt_br: Em sistemas POSIX, os nomes de arquivos pkg-config (``.pc``) agora incluem os sinalizadores de ABI. Por exemplo, a construção com threads livres gera ``python-3.13t.pc`` e a construção de depuração gera ``python-3.13d.pc``.

source: The ``errno``, ``fcntl``, ``grp``, ``md5``, ``pwd``, ``resource``, ``termios``, ``winsound``, ``_ctypes_test``, ``_multiprocessing.posixshmem``, ``_scproxy``, ``_stat``, ``_statistics``, ``_testconsole``, ``_testimportmultiple`` and ``_uuid`` C extensions are now built with the :ref:`limited C API <limited-c-api>`. (Contributed by Victor Stinner in :gh:`85283`.)
pt_br: As extensões C ``errno``, ``fcntl``, ``grp``, ``md5``, ``pwd``, ``resource``, ``termios``, ``winsound``, ``_ctypes_test``, ``_multiprocessing.posixshmem``, ``_scproxy``, ``_stat``, ``_statistics``, ``_testconsole``, ``_testimportmultiple`` e ``_uuid`` são agora construídas com a :ref:`API C limitada <limited-c-api>`. (Contribuição de Victor Stinner em :gh:`85283`.)

source: Porting to Python 3.13
pt_br: Portando para o Python 3.13

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_br: Esta seção lista as alterações descritas anteriormente e outras correções que podem exigir alterações no seu código.

source: Changes in the Python API
pt_br: Alterações na API Python

source: :ref:`PEP 667 <whatsnew313-locals-semantics>` introduces several changes to the semantics of :func:`locals` and :attr:`f_locals <frame.f_locals>`:
pt_br: :ref:`PEP 667 <whatsnew313-locals-semantics>` introduz várias mudanças na semântica de :func:`locals` e :attr:`f_locals <frame.f_locals>`:

source: Calling :func:`locals` in an :term:`optimized scope` now produces an independent snapshot on each call, and hence no longer implicitly updates previously returned references. Obtaining the legacy CPython behavior now requires explicit calls to update the initially returned dictionary with the results of subsequent calls to :func:`!locals`. Code execution functions that implicitly target :func:`!locals` (such as ``exec`` and ``eval``) must be passed an explicit namespace to access their results in an optimized scope. (Changed as part of :pep:`667`.)
pt_br: Chamar :func:`locals` em um :term:`escopo otimizado` agora produz uma captura independente em cada chamada e, portanto, não atualiza mais implicitamente as referências retornadas anteriormente. Obter o comportamento legado do CPython agora requer chamadas explícitas para atualizar o dicionário inicialmente retornado com os resultados de chamadas subsequentes para :func:`!locals`. Funções de execução de código que visam implicitamente :func:`!locals` (como ``exec`` e ``eval``) devem receber um espaço de nomes explícito para acessar seus resultados em um escopo otimizado. (Alterado como parte da :pep:`667`.)

source: Calling :func:`locals` from a comprehension at module or class scope (including via ``exec`` or ``eval``) once more behaves as if the comprehension were running as an independent nested function (i.e. the local variables from the containing scope are not included). In Python 3.12, this had changed to include the local variables from the containing scope when implementing :pep:`709`. (Changed as part of :pep:`667`.)
pt_br: Chamar :func:`locals` de uma compreensão no módulo ou escopo de classe (inclusive via ``exec`` ou ``eval``) mais uma vez se comporta como se a compreensão estivesse sendo executada como uma função aninhada independente (isto é, as variáveis locais de o escopo que contém não está incluído). No Python 3.12, isso mudou para incluir as variáveis locais do escopo que o contém ao implementar a :pep:`709`. (Alterado como parte da :pep:`667`.)

source: Accessing :attr:`FrameType.f_locals <frame.f_locals>` in an :term:`optimized scope` now returns a write-through proxy rather than a snapshot that gets updated at ill-specified times. If a snapshot is desired, it must be created explicitly with ``dict`` or the proxy's ``.copy()`` method. (Changed as part of :pep:`667`.)
pt_br: Acessar :attr:`FrameType.f_locals <frame.f_locals>` em um :term:`escopo otimizado` agora retorna um proxy de "write-through" em vez de uma captura que é atualizado em horários mal especificados. Se uma captura for desejada, ela deve ser criada explicitamente com ``dict`` ou com o método ``.copy()`` do proxy. (Alterado como parte da :pep:`667`.)

source: :class:`functools.partial` now emits a :exc:`FutureWarning` when used as a method. The behavior will change in future Python versions. Wrap it in :func:`staticmethod` if you want to preserve the old behavior. (Contributed by Serhiy Storchaka in :gh:`121027`.)
pt_br: :class:`functools.partial` agora emite uma :exc:`FutureWarning` quando é usado como método. Seu comportamento será alterado em versões futuras do Python. Envolva-a em :func:`staticmethod` se quiser preservar o comportamento antigo. (Contribuição de Serhiy Storchaka em :gh:`121027`.)

source: An :exc:`OSError` is now raised by :func:`getpass.getuser` for any failure to retrieve a username, instead of :exc:`ImportError` on non-Unix platforms or :exc:`KeyError` on Unix platforms where the password database is empty.
pt_br: Uma exceção :exc:`OSError` agora é levantada por :func:`getpass.getuser` para qualquer falha na recuperação de um nome de usuário, em vez de :exc:`ImportError` em plataformas não-Unix ou :exc:`KeyError` em plataformas Unix onde o banco de dados de senhas está vazio.

source: The value of the :attr:`!mode` attribute of :class:`gzip.GzipFile` is now a string (``'rb'`` or ``'wb'``) instead of an integer (``1`` or ``2``). The value of the :attr:`!mode` attribute of the readable file-like object returned by :meth:`zipfile.ZipFile.open` is now ``'rb'`` instead of ``'r'``. (Contributed by Serhiy Storchaka in :gh:`115961`.)
pt_br: O valor do atributo :attr:`!mode` de :class:`gzip.GzipFile` agora é uma string (``'rb'`` ou ``'wb'``) e não mais um inteiro (``1`` ou ``2``). O valor do atributo :attr:`!mode` do objeto arquivo ou similar legível retornado por :meth:`zipfile.ZipFile.open` é agora ``'rb'`` e não mais ``'r'``. (Contribuição de Serhiy Storchaka em :gh:`115961`.)

source: :class:`mailbox.Maildir` now ignores files with a leading dot (``.``). (Contributed by Zackery Spytz in :gh:`65559`.)
pt_br: :class:`mailbox.Maildir` agora ignora arquivos com um ponto inicial (``.``). (Contribuição de Zackery Spytz em :gh:`65559`.)

source: :meth:`pathlib.Path.glob` and :meth:`~pathlib.Path.rglob` now return both files and directories if a pattern that ends with "``**``" is given, rather than directories only. Add a trailing slash to keep the previous behavior and only match directories.
pt_br: :meth:`pathlib.Path.glob` e :meth:`~pathlib.Path.rglob` agora retornam arquivos e diretórios se um padrão que termina com "``**``" for fornecido, em vez de apenas diretórios. Os usuários podem adicionar uma barra final para manter o comportamento anterior e corresponder apenas aos diretórios.

source: The :mod:`threading` module now expects the :mod:`!_thread` module to have an :func:`!_is_main_interpreter` function. This function takes no arguments and returns ``True`` if the current interpreter is the main interpreter.
pt_br: O módulo :mod:`threading` agora espera que o módulo :mod:`!_thread` tenha uma função ``_is_main_interpreter``. É uma função sem argumentos que retorna ``True`` se o interpretador atual for o interpretador principal.

source: Any library or application that provides a custom :mod:`!_thread` module must provide :func:`!_is_main_interpreter`, just like the module's other "private" attributes. (:gh:`112826`.)
pt_br: Qualquer biblioteca ou aplicação que forneça um módulo :mod:`!_thread` personalizado deve obrigatoriamente fornecer :func:`!_is_main_interpreter`, da mesma forma que outros atributos "privados" do módulo. (Veja :gh:`112826`.)

source: Changes in the C API
pt_br: Alterações na API C

source: ``Python.h`` no longer includes the ``<ieeefp.h>`` standard header. It was included for the :c:func:`!finite` function which is now provided by the ``<math.h>`` header. It should now be included explicitly if needed. Remove also the ``HAVE_IEEEFP_H`` macro. (Contributed by Victor Stinner in :gh:`108765`.)
pt_br: ``Python.h`` não inclui mais o cabeçalho padrão ``<ieeefp.h>``. Ele foi incluído para a função :c:func:`!finite` que agora é fornecida pelo cabeçalho ``<math.h>``. Agora deve ser incluído explicitamente, se necessário. Remove também a macro ``HAVE_IEEEFP_H``. (Contribuição de Victor Stinner em :gh:`108765`.)

source: ``Python.h`` no longer includes these standard header files: ``<time.h>``, ``<sys/select.h>`` and ``<sys/time.h>``. If needed, they should now be included explicitly. For example, ``<time.h>`` provides the :c:func:`!clock` and :c:func:`!gmtime` functions, ``<sys/select.h>`` provides the :c:func:`!select` function, and ``<sys/time.h>`` provides the :c:func:`!futimes`, :c:func:`!gettimeofday` and :c:func:`!setitimer` functions. (Contributed by Victor Stinner in :gh:`108765`.)
pt_br: ``Python.h`` não inclui mais estes arquivos de cabeçalho padrão: ``<time.h>``, ``<sys/select.h>`` e ``<sys/time.h>``. Se necessário, deverão agora ser incluídos explicitamente. Por exemplo, ``<time.h>`` fornece as funções :c:func:`!clock` e :c:func:`!gmtime`, ``<sys/select.h>`` fornece o :c:func:`!select`, e ``<sys/time.h>`` fornece as funções :c:func:`!futimes`, :c:func:`!gettimeofday` e :c:func:`!setitimer`. (Contribuição de Victor Stinner em :gh:`108765`.)

source: On Windows, ``Python.h`` no longer includes the ``<stddef.h>`` standard header file. If needed, it should now be included explicitly. For example, it provides :c:func:`!offsetof` function, and ``size_t`` and ``ptrdiff_t`` types. Including ``<stddef.h>`` explicitly was already needed by all other platforms, the ``HAVE_STDDEF_H`` macro is only defined on Windows. (Contributed by Victor Stinner in :gh:`108765`.)
pt_br: No Windows, ``Python.h`` não inclui mais o arquivo de cabeçalho padrão ``<stddef.h>``. Se necessário, deverá agora ser incluído explicitamente. Por exemplo, ele fornece a função :c:func:`!offsetof` e os tipos ``size_t`` e ``ptrdiff_t``. Incluindo ``<stddef.h>`` explicitamente já era necessário para todas as outras plataformas, a macro ``HAVE_STDDEF_H`` só é definida no Windows. (Contribuição de Victor Stinner em :gh:`108765`.)

source: If the :c:macro:`Py_LIMITED_API` macro is defined, :c:macro:`!Py_BUILD_CORE`, :c:macro:`!Py_BUILD_CORE_BUILTIN` and :c:macro:`!Py_BUILD_CORE_MODULE` macros are now undefined by ``<Python.h>``. (Contributed by Victor Stinner in :gh:`85283`.)
pt_br: Se a macro :c:macro:`Py_LIMITED_API` estiver definida, as macros :c:macro:`!Py_BUILD_CORE`, :c:macro:`!Py_BUILD_CORE_BUILTIN` e :c:macro:`!Py_BUILD_CORE_MODULE` agora são indefinidas por ``<Python.h>``. (Contribuição de Victor Stinner em :gh:`85283`.)

source: The old trashcan macros ``Py_TRASHCAN_SAFE_BEGIN`` and ``Py_TRASHCAN_SAFE_END`` were removed. They should be replaced by the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``.
pt_br: As macros antigas da lixeira ``Py_TRASHCAN_SAFE_BEGIN`` e ``Py_TRASHCAN_SAFE_END`` foram removidas. Elas devem ser substituídas pelas novas macros ``Py_TRASHCAN_BEGIN`` e ``Py_TRASHCAN_END``.

source: A ``tp_dealloc`` function that has the old macros, such as::
pt_br: Uma função ``tp_dealloc`` que contém as macros antigas, como::

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }
pt_br: static void dealocador_de_meutipo(meutipo *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_SAFE_BEGIN(p); ... Py_TRASHCAN_SAFE_END }

source: should migrate to the new macros as follows::
pt_br: deve migrar para as novas macros da seguinte forma::

source: static void mytype_dealloc(mytype *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, mytype_dealloc) ... Py_TRASHCAN_END }
pt_br: static void dealocador_de_meutipo(meutipo *p) { PyObject_GC_UnTrack(p); Py_TRASHCAN_BEGIN(p, dealocador_de_meutipo); ... Py_TRASHCAN_END }

source: Note that ``Py_TRASHCAN_BEGIN`` has a second argument which should be the deallocation function it is in. The new macros were added in Python 3.8 and the old macros were deprecated in Python 3.11. (Contributed by Irit Katriel in :gh:`105111`.)
pt_br: Observe que ``Py_TRASHCAN_BEGIN`` tem um segundo argumento que deve ser a função de desalocação em que está. As novas macros foram adicionadas no Python 3.8 e as macros antigas foram descontinuadas no Python 3.11. (Contribuição de Irit Katriel em :gh:`105111`.)

source: :ref:`PEP 667 <whatsnew313-locals-semantics>` introduces several changes to frame-related functions:
pt_br: :ref:`PEP 667 <whatsnew313-locals-semantics>` introduz várias mudanças em funções relacionadas a quadro:

source: The effects of mutating the dictionary returned from :c:func:`PyEval_GetLocals` in an :term:`optimized scope` have changed. New dict entries added this way will now *only* be visible to subsequent :c:func:`PyEval_GetLocals` calls in that frame, as :c:func:`PyFrame_GetLocals`, :func:`locals`, and :attr:`FrameType.f_locals <frame.f_locals>` no longer access the same underlying cached dictionary. Changes made to entries for actual variable names and names added via the write-through proxy interfaces will be overwritten on subsequent calls to :c:func:`PyEval_GetLocals` in that frame. The recommended code update depends on how the function was being used, so refer to the deprecation notice on the function for details.
pt_br: Os efeitos da mutação do dicionário retornado de :c:func:`PyEval_GetLocals` em um :term:`escopo otimizado` foram alterados. Novas entradas de dict adicionadas desta forma agora *apenas* ficarão visíveis para chamadas :c:func:`PyEval_GetLocals` subsequentes nesse quadro, como :c:func:`PyFrame_GetLocals`, :func:`locals` e :attr:`FrameType.f_locals <frame.f_locals>` não acessa mais o mesmo dicionário armazenado em cache subjacente. As alterações feitas nas entradas para nomes de variáveis reais e nomes adicionados através das interfaces proxy de "write-through" serão substituídas em chamadas subsequentes para :c:func:`PyEval_GetLocals` nesse quadro. A atualização de código recomendada depende de como a função estava sendo usada, portanto, consulte o aviso de descontinuação na função para obter detalhes.

source: Calling :c:func:`PyFrame_GetLocals` in an :term:`optimized scope` now returns a write-through proxy rather than a snapshot that gets updated at ill-specified times. If a snapshot is desired, it must be created explicitly (e.g. with :c:func:`PyDict_Copy`), or by calling the new :c:func:`PyEval_GetFrameLocals` API.
pt_br: Chamar :c:func:`PyFrame_GetLocals` em um :term:`escopo otimizado` agora retorna um proxy de "write-through" em vez de uma captura que é atualizada em horários mal especificados. Se uma captura for desejada, ela deve ser criada explicitamente (por exemplo, com :c:func:`PyDict_Copy`) ou chamando a nova API :c:func:`PyEval_GetFrameLocals`.

source: :c:func:`!PyFrame_FastToLocals` and :c:func:`!PyFrame_FastToLocalsWithError` no longer have any effect. Calling these functions has been redundant since Python 3.11, when :c:func:`PyFrame_GetLocals` was first introduced.
pt_br: :c:func:`!PyFrame_FastToLocals` e :c:func:`!PyFrame_FastToLocalsWithError` não têm mais nenhum efeito. Chamar essas funções tem sido redundante desde o Python 3.11, quando :c:func:`PyFrame_GetLocals` foi introduzido pela primeira vez.

source: :c:func:`!PyFrame_LocalsToFast` no longer has any effect. Calling this function is redundant now that :c:func:`PyFrame_GetLocals` returns a write-through proxy for :term:`optimized scopes <optimized scope>`.
pt_br: :c:func:`!PyFrame_LocalsToFast` não tem mais efeito. Chamar esta função é redundante agora que :c:func:`PyFrame_GetLocals` retorna um proxy de "write-through" para :term:`escopos otimizados <escopo otimizado>`.

source: Python 3.13 removed many private functions. Some of them can be replaced using these alternatives:
pt_br: O Python 3.13 removeu muitas funções privadas. Algumas delas podem ser substituídas usando estas alternativas:

source: ``_PyDict_Pop()``: :c:func:`PyDict_Pop` or :c:func:`PyDict_PopString`;
pt_br: ``_PyDict_Pop()``: :c:func:`PyDict_Pop` ou :c:func:`PyDict_PopString`;

source: ``_PyEval_SetTrace()``: :c:func:`PyEval_SetTrace` or :c:func:`PyEval_SetTraceAllThreads`;
pt_br: ``_PyEval_SetTrace()``: :c:func:`PyEval_SetTrace` ou :c:func:`PyEval_SetTraceAllThreads`;

source: ``_PyTime_GetMonotonicClock()``: :c:func:`PyTime_Monotonic` or :c:func:`PyTime_MonotonicRaw`;
pt_br: ``_PyTime_GetMonotonicClock()``: :c:func:`PyTime_Monotonic` ou :c:func:`PyTime_MonotonicRaw`;

source: ``_PyTime_GetPerfCounter()``: :c:func:`PyTime_PerfCounter` or :c:func:`PyTime_PerfCounterRaw`;
pt_br: ``_PyTime_GetPerfCounter()``: :c:func:`PyTime_PerfCounter` ou :c:func:`PyTime_PerfCounterRaw`;

source: ``_PyTime_GetSystemClock()``: :c:func:`PyTime_Time` or :c:func:`PyTime_TimeRaw`;
pt_br: ``_PyTime_GetSystemClock()``: :c:func:`PyTime_Time` ou :c:func:`PyTime_TimeRaw`;

source: The `pythoncapi-compat project`_ can be used to get most of these new functions on Python 3.12 and older.
pt_br: O `projeto pythoncapi-compat`_ pode ser usado para obter a maioria dessas novas funções no Python 3.12 e versões anteriores.

source: Regression Test Changes
pt_br: Mudanças em teste de regressão

source: Python built with :file:`configure` :option:`--with-pydebug` now supports a :option:`-X presite=package.module <-X>` command-line option. If used, it specifies a module that should be imported early in the lifecycle of the interpreter, before ``site.py`` is executed. (Contributed by Łukasz Langa in :gh:`110769`.)
pt_br: Python construído com :option:`--with-pydebug` do :file:`configure` agora oferece suporte a uma opção de linha de comando :option:`-X presite=pacote.módulo <-X>`. Se usado, especifica um módulo que deve ser importado no início do ciclo de vida do interpretador, antes que ``site.py`` seja executado. (Contribuição de Łukasz Langa em :gh:`110769`.)
