Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: Add the :c:func:`PyThreadState_GetUnchecked()` function as an alternative to :c:func:`PyThreadState_Get()` that doesn't kill the process with a fatal error if it is ``NULL``. The caller is responsible for checking if the result is ``NULL``. (Contributed by Victor Stinner in :gh:`108867`.)
pt_br: Adiciona a função :c:func:`PyThreadState_GetUnchecked()` como uma alternativa a :c:func:`PyThreadState_Get()` que não mata o processo com um erro fatal se for ``NULL``. O chamador é responsável por verificar se o resultado é ``NULL``. (Contribuição de Victor Stinner em :gh:`108867`.)

source: Add the :c:func:`PyType_GetFullyQualifiedName` function to get the type's fully qualified name. The module name is prepended if :attr:`type.__module__` is a string and is not equal to either ``'builtins'`` or ``'__main__'``. (Contributed by Victor Stinner in :gh:`111696`.)
pt_br: Adiciona a função :c:func:`PyType_GetFullyQualifiedName` para obter o nome totalmente qualificado do tipo. O nome do módulo é prefixado se :attr:`type.__module__` for uma string e não for igual a ``'builtins'`` ou ``'__main__'``. (Contribuição de Victor Stinner em :gh:`111696`.)

source: Add the :c:func:`PyType_GetModuleName` function to get the type's module name. This is equivalent to getting the :attr:`type.__module__` attribute. (Contributed by Eric Snow and Victor Stinner in :gh:`111696`.)
pt_br: Adiciona a função :c:func:`PyType_GetModuleName` para obter o nome do módulo do tipo. Isto é equivalente a obter o atributo :attr:`type.__module__`. (Contribuição de Eric Snow e Victor Stinner em :gh:`111696`.)

source: Add the :c:func:`PyUnicode_EqualToUTF8AndSize` and :c:func:`PyUnicode_EqualToUTF8` functions to compare a Unicode object with a :c:expr:`const char*` UTF-8 encoded string and ``1`` if they are equal or ``0`` otherwise. These functions do not raise exceptions. (Contributed by Serhiy Storchaka in :gh:`110289`.)
pt_br: Adiciona as funções :c:func:`PyUnicode_EqualToUTF8AndSize` e :c:func:`PyUnicode_EqualToUTF8`: comparam o objeto Unicode com uma string :c:expr:`const char*` codificada em UTF-8 e retornam ``1`` se forem iguais ou ``0`` caso contrário. Essas funções não levantam exceções. (Contribuição de Serhiy Storchaka em :gh:`110289`.)

source: Add the :c:func:`PyWeakref_GetRef` function as an alternative to :c:func:`PyWeakref_GetObject` that returns a :term:`strong reference` or ``NULL`` if the referent is no longer live. (Contributed by Victor Stinner in :gh:`105927`.)
pt_br: Adiciona a função :c:func:`PyWeakref_GetRef` como uma alternativa a :c:func:`PyWeakref_GetObject`, mas retorna uma :term:`referência forte`, ou ``NULL`` se o referente não mais existir. (Contribuição de Victor Stinner em :gh:`105927`.)

source: Add fixed variants of functions which silently ignore errors:
pt_br: Adiciona variantes fixas de funções que ignoram erros silenciosamente:

source: :c:func:`PyObject_HasAttrWithError` replaces :c:func:`PyObject_HasAttr`.
pt_br: :c:func:`PyObject_HasAttrWithError` substitui :c:func:`PyObject_HasAttr`.

source: :c:func:`PyObject_HasAttrStringWithError` replaces :c:func:`PyObject_HasAttrString`.
pt_br: :c:func:`PyObject_HasAttrStringWithError` substitui :c:func:`PyObject_HasAttrString`.

source: :c:func:`PyMapping_HasKeyWithError` replaces :c:func:`PyMapping_HasKey`.
pt_br: :c:func:`PyMapping_HasKeyWithError` substitui :c:func:`PyMapping_HasKey`.

source: :c:func:`PyMapping_HasKeyStringWithError` replaces :c:func:`PyMapping_HasKeyString`.
pt_br: :c:func:`PyMapping_HasKeyStringWithError` substitui :c:func:`PyMapping_HasKeyString`.

source: The new functions return ``-1`` for errors and the standard ``1`` for true and ``0`` for false.
pt_br: As novas funções retornam ``-1`` para erros e o padrão ``1`` para verdadeiro e ``0`` para falso.

source: (Contributed by Serhiy Storchaka in :gh:`108511`.)
pt_br: (Contribuição de Serhiy Storchaka em :gh:`108511`.)

source: Changed C APIs
pt_br: Alterações na API C

source: The *keywords* parameter of :c:func:`PyArg_ParseTupleAndKeywords` and :c:func:`PyArg_VaParseTupleAndKeywords` now has type :c:expr:`char * const *` in C and :c:expr:`const char * const *` in C++, instead of :c:expr:`char **`. In C++, this makes these functions compatible with arguments of type :c:expr:`const char * const *`, :c:expr:`const char **`, or :c:expr:`char * const *` without an explicit type cast. In C, the functions only support arguments of type :c:expr:`char * const *`. This can be overridden with the :c:macro:`PY_CXX_CONST` macro. (Contributed by Serhiy Storchaka in :gh:`65210`.)
pt_br: O parâmetro *keywords* das funções :c:func:`PyArg_ParseTupleAndKeywords` e :c:func:`PyArg_VaParseTupleAndKeywords` agora é do tipo :c:expr:`char * const *` em C e :c:expr:`const char * const *` em C++, em vez de :c:expr:`char **`. Em C++, isso torna essas funções compatíveis com argumentos dos tipos :c:expr:`const char * const *`, :c:expr:`const char **`, ou :c:expr:`char * const *` sem uma conversão de tipo explícita. Em C, as funções aceitam apenas argumentos do tipo :c:expr:`char * const *`. Isso pode ser sobrescrito com a macro :c:macro:`PY_CXX_CONST`. (Contribuição de Serhiy Storchaka em :gh:`65210`.)

source: :c:func:`PyArg_ParseTupleAndKeywords` now supports non-ASCII keyword parameter names. (Contributed by Serhiy Storchaka in :gh:`110815`.)
pt_br: :c:func:`PyArg_ParseTupleAndKeywords` agora oferece suporte a nomes de parâmetros nomeados não-ASCII. (Contribuição de Serhiy Storchaka em :gh:`110815`.)

source: The :c:func:`!PyCode_GetFirstFree` function is now unstable API and is now named :c:func:`PyUnstable_Code_GetFirstFree`. (Contributed by Bogdan Romanyuk in :gh:`115781`.)
pt_br: A função :c:func:`!PyCode_GetFirstFree` é agora uma API instável e foi renomeada para :c:func:`PyUnstable_Code_GetFirstFree`. (Contribuição de Bogdan Romanyuk em :gh:`115781`.)

source: The :c:func:`PyDict_GetItem`, :c:func:`PyDict_GetItemString`, :c:func:`PyMapping_HasKey`, :c:func:`PyMapping_HasKeyString`, :c:func:`PyObject_HasAttr`, :c:func:`PyObject_HasAttrString`, and :c:func:`PySys_GetObject` functions, each of which clears all errors which occurred when calling them now reports these errors using :func:`sys.unraisablehook`. You may replace them with other functions as recommended in the documentation. (Contributed by Serhiy Storchaka in :gh:`106672`.)
pt_br: As funções :c:func:`PyDict_GetItem`, :c:func:`PyDict_GetItemString`, :c:func:`PyMapping_HasKey`, :c:func:`PyMapping_HasKeyString`, :c:func:`PyObject_HasAttr`, :c:func:`PyObject_HasAttrString`, e :c:func:`PySys_GetObject`, que apagam todos os erros que ocorrem ao chamá-las, agora reportam tais erros usando :func:`sys.unraisablehook`. Você pode substituí-las por outras funções conforme recomendado na documentação. (Contribuição de Serhiy Storchaka em :gh:`106672`.)

source: Add support for the ``%T``, ``%#T``, ``%N`` and ``%#N`` formats to :c:func:`PyUnicode_FromFormat`:
pt_br: Adiciona suporte para os formatos ``%T``, ``%#T``, ``%N`` e ``%#N`` a :c:func:`PyUnicode_FromFormat`:

source: ``%T``: Get the fully qualified name of an object type
pt_br: ``%T``: Obtém o nome totalmente qualificado de um tipo de objeto

source: ``%#T``: As above, but use a colon as the separator
pt_br: ``%#T``: Como acima, mas usa dois pontos como separador

source: ``%N``: Get the fully qualified name of a type
pt_br: ``%N``: Obtém o nome totalmente qualificado de um tipo

source: ``%#N``: As above, but use a colon as the separator
pt_br: ``%#N``: Como acima, mas usa dois pontos como separador

source: See :pep:`737` for more information. (Contributed by Victor Stinner in :gh:`111696`.)
pt_br: Veja :pep:`737` para uma descrição completa. (Contribuição de Victor Stinner em :gh:`111696`.)

source: You no longer have to define the ``PY_SSIZE_T_CLEAN`` macro before including :file:`Python.h` when using ``#`` formats in :ref:`format codes <arg-parsing-string-and-buffers>`. APIs accepting the format codes always use ``Py_ssize_t`` for ``#`` formats. (Contributed by Inada Naoki in :gh:`104922`.)
pt_br: Você não precisa mais definir a macro ``PY_SSIZE_T_CLEAN`` antes de incluir :file:`Python.h` ao usar formatos ``#`` em :ref:`códigos de formato <arg-parsing-string-and-buffers>`. APIs que aceitam os códigos de formato sempre usam ``Py_ssize_t`` para formatos ``#``. (Contribuição de Inada Naoki em :gh:`104922`.)

source: If Python is built in :ref:`debug mode <debug-build>` or :option:`with assertions <--with-assertions>`, :c:func:`PyTuple_SET_ITEM` and :c:func:`PyList_SET_ITEM` now check the index argument with an assertion. (Contributed by Victor Stinner in :gh:`106168`.)
pt_br: Se Python for construído em :ref:`modo de depuração <debug-build>` ou :option:`com asserções <--with-assertions>`, :c:func:`PyTuple_SET_ITEM` e :c:func:`PyList_SET_ITEM` agora verificam o argumento do índice com uma asserção. (Contribuição de Victor Stinner em :gh:`106168`.)

source: Limited C API Changes
pt_br: Mudanças na API C Limitada

source: The following functions are now included in the Limited C API:
pt_br: As seguintes funções agora estão incluídas na API C limitada:

source: (Contributed by Victor Stinner in :gh:`85283`, :gh:`85283`, and :gh:`116936`.)
pt_br: (Contribuição de Victor Stinner em :gh:`85283`, :gh:`85283` e :gh:`116936`.)

source: Python built with :option:`--with-trace-refs` (tracing references) now supports the :ref:`Limited API <limited-c-api>`. (Contributed by Victor Stinner in :gh:`108634`.)
pt_br: Python construído com :option:`--with-trace-refs` (referências de rastreamento) agora oferece suporte à :ref:`API Limitada <limited-c-api>`. (Contribuição de Victor Stinner em :gh:`108634`.)

source: Removed C APIs
pt_br: APIs C removidas

source: Remove several functions, macros, variables, etc with names prefixed by ``_Py`` or ``_PY`` (which are considered private). If your project is affected by one of these removals and you believe that the removed API should remain available, please :ref:`open a new issue <using-the-tracker>` to request a public C API and add ``cc: @vstinner`` to the issue to notify Victor Stinner. (Contributed by Victor Stinner in :gh:`106320`.)
pt_br: Remove diversas funções, macros, variáveis, etc com nomes prefixados por ``_Py`` ou ``_PY`` (consideradas como API privada). Se o seu projeto for afetado por uma dessas remoções e você acreditar que a API removida deve permanecer disponível, por favor :ref:`abra um novo relatório de problema <using-the-tracker>` para solicitar uma API C pública e adicione ``cc: @vstinner`` ao problema para notificar Victor Stinner. (Contribuição de Victor Stinner em :gh:`106320`.)

source: Remove old buffer protocols deprecated in Python 3.0. Use :ref:`bufferobjects` instead.
pt_br: Remove protocolos de buffer antigos descontinuados no Python 3.0: use :ref:`bufferobjects`.

source: :c:func:`!PyObject_CheckReadBuffer`: Use :c:func:`PyObject_CheckBuffer` to test whether the object supports the buffer protocol. Note that :c:func:`PyObject_CheckBuffer` doesn't guarantee that :c:func:`PyObject_GetBuffer` will succeed. To test if the object is actually readable, see the next example of :c:func:`PyObject_GetBuffer`.
pt_br: :c:func:`!PyObject_CheckReadBuffer`: use :c:func:`PyObject_CheckBuffer` para testar se o objeto oferece suporte ao protocolo de buffer. Observe que :c:func:`PyObject_CheckBuffer` não garante que :c:func:`PyObject_GetBuffer` terá sucesso. Para testar se o objeto é realmente legível, veja o próximo exemplo de :c:func:`PyObject_GetBuffer`.

source: :c:func:`!PyObject_AsCharBuffer`, :c:func:`!PyObject_AsReadBuffer`: Use :c:func:`PyObject_GetBuffer` and :c:func:`PyBuffer_Release` instead:
pt_br: :c:func:`!PyObject_AsCharBuffer`, :c:func:`!PyObject_AsReadBuffer`: use :c:func:`PyObject_GetBuffer` e :c:func:`PyBuffer_Release`:

source: Py_buffer view; if (PyObject_GetBuffer(obj, &view, PyBUF_SIMPLE) < 0) { return NULL; } // Use `view.buf` and `view.len` to read from the buffer. // You may need to cast buf as `(const char*)view.buf`. PyBuffer_Release(&view);
pt_br: Py_buffer view; if (PyObject_GetBuffer(obj, &view, PyBUF_SIMPLE) < 0) { return NULL; } // Usa `view.buf` e `view.len` para ler do buffer. // Você pode precisar converter buf como `(const char*)view.buf`. PyBuffer_Release(&view);

source: :c:func:`!PyObject_AsWriteBuffer`: Use :c:func:`PyObject_GetBuffer` and :c:func:`PyBuffer_Release` instead:
pt_br: :c:func:`!PyObject_AsWriteBuffer`: use :c:func:`PyObject_GetBuffer` e :c:func:`PyBuffer_Release`:

source: Py_buffer view; if (PyObject_GetBuffer(obj, &view, PyBUF_WRITABLE) < 0) { return NULL; } // Use `view.buf` and `view.len` to write to the buffer. PyBuffer_Release(&view);
pt_br: Py_buffer view; if (PyObject_GetBuffer(obj, &view, PyBUF_WRITABLE) < 0) { return NULL; } // Usa `view.buf` e `view.len` para gravar no buffer. PyBuffer_Release(&view);

source: (Contributed by Inada Naoki in :gh:`85275`.)
pt_br: (Contribuição de Inada Naoki in :gh:`85275`.)

source: Remove various functions deprecated in Python 3.9:
pt_br: Remove diversas funções descontinuadas no Python 3.9:

source: :c:func:`!PyEval_CallObject`, :c:func:`!PyEval_CallObjectWithKeywords`: Use :c:func:`PyObject_CallNoArgs` or :c:func:`PyObject_Call` instead.
pt_br: :c:func:`!PyEval_CallObject`, :c:func:`!PyEval_CallObjectWithKeywords`: use :c:func:`PyObject_CallNoArgs` ou :c:func:`PyObject_Call`.

source: In :c:func:`PyObject_Call`, positional arguments must be a :class:`tuple` and must not be ``NULL``, and keyword arguments must be a :class:`dict` or ``NULL``, whereas the removed functions checked argument types and accepted ``NULL`` positional and keyword arguments. To replace ``PyEval_CallObjectWithKeywords(func, NULL, kwargs)`` with :c:func:`PyObject_Call`, pass an empty tuple as positional arguments using :c:func:`PyTuple_New(0) <PyTuple_New>`.
pt_br: Os argumentos posicionais de :c:func:`PyObject_Call` devem ser uma :class:`tuple` e não podem ser ``NULL``, os argumentos nomeados devem ser :class:`dict` ou ``NULL``, enquanto funções removidas verificavam o tipo de argumentos e aceitavam argumentos posicionais e nomeados ``NULL``. Para substituir ``PyEval_CallObjectWithKeywords(func, NULL, kwargs)`` por :c:func:`PyObject_Call`, passe uma tupla vazia como argumentos posicionais usando :c:func:`PyTuple_New(0) <PyTuple_New>`.

source: :c:func:`!PyEval_CallFunction`: Use :c:func:`PyObject_CallFunction` instead.
pt_br: :c:func:`!PyEval_CallFunction`: use :c:func:`PyObject_CallFunction`.

source: :c:func:`!PyEval_CallMethod`: Use :c:func:`PyObject_CallMethod` instead.
pt_br: :c:func:`!PyEval_CallMethod`: use :c:func:`PyObject_CallMethod`.

source: :c:func:`!PyCFunction_Call`: Use :c:func:`PyObject_Call` instead.
pt_br: :c:func:`!PyCFunction_Call`: use :c:func:`PyObject_Call`.

source: (Contributed by Victor Stinner in :gh:`105107`.)
pt_br: (Contribuição de Victor Stinner em :gh:`105107`.)

source: Remove the following old functions to configure the Python initialization, deprecated in Python 3.11:
pt_br: Remove as seguintes funções antigas da configuração de inicialização do Python, descontinuadas no Python 3.11:

source: :c:func:`!PySys_AddWarnOptionUnicode`: Use :c:member:`PyConfig.warnoptions` instead.
pt_br: :c:func:`!PySys_AddWarnOptionUnicode`: use :c:member:`PyConfig.warnoptions`.

source: :c:func:`!PySys_AddWarnOption`: Use :c:member:`PyConfig.warnoptions` instead.
pt_br: :c:func:`!PySys_AddWarnOption`: use :c:member:`PyConfig.warnoptions`.

source: :c:func:`!PySys_AddXOption`: Use :c:member:`PyConfig.xoptions` instead.
pt_br: :c:func:`!PySys_AddXOption`: use :c:member:`PyConfig.xoptions`.

source: :c:func:`!PySys_HasWarnOptions`: Use :c:member:`PyConfig.xoptions` instead.
pt_br: :c:func:`!PySys_HasWarnOptions`: use :c:member:`PyConfig.xoptions`.

source: :c:func:`!PySys_SetPath`: Set :c:member:`PyConfig.module_search_paths` instead.
pt_br: :c:func:`!PySys_SetPath`: defina :c:member:`PyConfig.module_search_paths`.

source: :c:func:`!Py_SetPath`: Set :c:member:`PyConfig.module_search_paths` instead.
pt_br: :c:func:`!Py_SetPath`: defina :c:member:`PyConfig.module_search_paths`.

source: :c:func:`!Py_SetStandardStreamEncoding`: Set :c:member:`PyConfig.stdio_encoding` instead, and set also maybe :c:member:`PyConfig.legacy_windows_stdio` (on Windows).
pt_br: :c:func:`!Py_SetStandardStreamEncoding`: defina :c:member:`PyConfig.stdio_encoding`, e também talvez :c:member:`PyConfig.legacy_windows_stdio` (no Windows).

source: :c:func:`!_Py_SetProgramFullPath`: Set :c:member:`PyConfig.executable` instead.
pt_br: :c:func:`!_Py_SetProgramFullPath`: defina :c:member:`PyConfig.executable`.

source: Use the new :c:type:`PyConfig` API of the :ref:`Python Initialization Configuration <init-config>` instead (:pep:`587`), added to Python 3.8. (Contributed by Victor Stinner in :gh:`105145`.)
pt_br: Em vez disso, use a nova API :c:type:`PyConfig` da :ref:`Configuração de Inicialização do Python <init-config>` (:pep:`587`), adicionada ao Python 3.8. (Contribuição de Victor Stinner em :gh:`105145`.)

source: Remove :c:func:`!PyEval_AcquireLock` and :c:func:`!PyEval_ReleaseLock` functions, deprecated in Python 3.2. They didn't update the current thread state. They can be replaced with:
pt_br: Remove as funções :c:func:`!PyEval_AcquireLock` e :c:func:`!PyEval_ReleaseLock`, descontinuadas no Python 3.2. Eles não atualizavam o estado atual da thread. Elas podem ser substituídas por:

source: :c:func:`PyEval_SaveThread` and :c:func:`PyEval_RestoreThread`;
pt_br: :c:func:`PyEval_SaveThread` e :c:func:`PyEval_RestoreThread`;

source: low-level :c:func:`PyEval_AcquireThread` and :c:func:`PyEval_RestoreThread`;
pt_br: :c:func:`PyEval_AcquireThread` e :c:func:`PyEval_RestoreThread` de baixo nível;

source: or :c:func:`PyGILState_Ensure` and :c:func:`PyGILState_Release`.
pt_br: ou :c:func:`PyGILState_Ensure` e :c:func:`PyGILState_Release`.

source: (Contributed by Victor Stinner in :gh:`105182`.)
pt_br: (Contribuição de Victor Stinner em :gh:`105182`.)

source: Remove the :c:func:`!PyEval_ThreadsInitialized` function, deprecated in Python 3.9. Since Python 3.7, :c:func:`!Py_Initialize` always creates the GIL: calling :c:func:`!PyEval_InitThreads` does nothing and :c:func:`!PyEval_ThreadsInitialized` always returns non-zero. (Contributed by Victor Stinner in :gh:`105182`.)
pt_br: Remove a função :c:func:`!PyEval_ThreadsInitialized`, descontinuada no Python 3.9. Desde Python 3.7, :c:func:`!Py_Initialize` sempre cria a GIL: chamar :c:func:`!PyEval_InitThreads` não faz nada e :c:func:`!PyEval_ThreadsInitialized` sempre retorna diferente de zero. (Contribuição de Victor Stinner em :gh:`105182`.)

source: Remove the :c:func:`!_PyInterpreterState_Get` alias to :c:func:`PyInterpreterState_Get()` which was kept for backward compatibility with Python 3.8. The `pythoncapi-compat project`_ can be used to get :c:func:`PyInterpreterState_Get()` on Python 3.8 and older. (Contributed by Victor Stinner in :gh:`106320`.)
pt_br: Remove o apelido :c:func:`!_PyInterpreterState_Get` de :c:func:`PyInterpreterState_Get()` que era mantido para compatibilidade com versões anteriores do Python 3.8. O projeto `pythoncapi-compat`_ pode ser usado para obter :c:func:`PyInterpreterState_Get()` no Python 3.8 e versões anteriores. (Contribuição de Victor Stinner em :gh:`106320`.)

source: Remove the private :c:func:`!_PyObject_FastCall` function: use :c:func:`!PyObject_Vectorcall` which is available since Python 3.8 (:pep:`590`). (Contributed by Victor Stinner in :gh:`106023`.)
pt_br: Remove a função privada :c:func:`!_PyObject_FastCall`: use :c:func:`!PyObject_Vectorcall`, a qual está disponível desde Python 3.8 (:pep:`590`). (Contribuição de Victor Stinner em :gh:`106023`.)

source: Remove the ``cpython/pytime.h`` header file, which only contained private functions. (Contributed by Victor Stinner in :gh:`106316`.)
pt_br: Remove o arquivo de cabeçalho ``cpython/pytime.h``, que continha apenas funções privadas. (Contribuição de Victor Stinner em :gh:`106316`.)

source: Remove the undocumented ``PY_TIMEOUT_MAX`` constant from the limited C API. (Contributed by Victor Stinner in :gh:`110014`.)
pt_br: Remove a constante não documentada ``PY_TIMEOUT_MAX`` da API C limitada. (Contribuição de Victor Stinner em :gh:`110014`.)

source: Remove the old trashcan macros ``Py_TRASHCAN_SAFE_BEGIN`` and ``Py_TRASHCAN_SAFE_END``. Replace both with the new macros ``Py_TRASHCAN_BEGIN`` and ``Py_TRASHCAN_END``. (Contributed by Irit Katriel in :gh:`105111`.)
pt_br: Remove as antigas macros de trashcan ``Py_TRASHCAN_SAFE_BEGIN`` e ``Py_TRASHCAN_SAFE_END``. Substitua ambas pelas novas macros ``Py_TRASHCAN_BEGIN`` e ``Py_TRASHCAN_END``. (Contribuição de Irit Katriel em :gh:`105111`.)

source: Deprecated C APIs
pt_br: APIs C descontinuadas

source: Deprecate old Python initialization functions:
pt_br: Descontinua antigas funções de inicialização do Python:

source: :c:func:`PySys_ResetWarnOptions`: Clear :data:`sys.warnoptions` and :data:`!warnings.filters` instead.
pt_br: :c:func:`PySys_ResetWarnOptions`: apague :data:`sys.warnoptions` e :data:`!warnings.filters`.

source: :c:func:`Py_GetExecPrefix`: Get :data:`sys.exec_prefix` instead.
pt_br: :c:func:`Py_GetExecPrefix`: leia :data:`sys.exec_prefix`.

source: :c:func:`Py_GetPath`: Get :data:`sys.path` instead.
pt_br: :c:func:`Py_GetPath`: leia :data:`sys.path`.

source: :c:func:`Py_GetPrefix`: Get :data:`sys.prefix` instead.
pt_br: :c:func:`Py_GetPrefix`: leia :data:`sys.prefix`.

source: :c:func:`Py_GetProgramFullPath`: Get :data:`sys.executable` instead.
pt_br: :c:func:`Py_GetProgramFullPath`: leia :data:`sys.executable`.

source: :c:func:`Py_GetProgramName`: Get :data:`sys.executable` instead.
pt_br: :c:func:`Py_GetProgramName`: leia :data:`sys.executable`.

source: :c:func:`Py_GetPythonHome`: Get :c:member:`PyConfig.home` or the :envvar:`PYTHONHOME` environment variable instead.
pt_br: :c:func:`Py_GetPythonHome`: leia :c:member:`PyConfig.home` ou a variável de ambiente :envvar:`PYTHONHOME`.

source: (Contributed by Victor Stinner in :gh:`105145`.)
pt_br: (Contribuição de Victor Stinner em :gh:`105145`.)

source: :term:`Soft deprecate <soft deprecated>` the :c:func:`PyEval_GetBuiltins`, :c:func:`PyEval_GetGlobals`, and :c:func:`PyEval_GetLocals` functions, which return a :term:`borrowed reference`. (Soft deprecated as part of :pep:`667`.)
pt_br: :term:`Descontinua suavemente <soft deprecated>` as funções :c:func:`PyEval_GetBuiltins`, :c:func:`PyEval_GetGlobals` e :c:func:`PyEval_GetLocals`, que retornam uma :term:`referência emprestada`. (Suavemente descontinuadas como parte da :pep:`667`.)

source: Deprecate the :c:func:`PyImport_ImportModuleNoBlock` function, which is just an alias to :c:func:`PyImport_ImportModule` since Python 3.3. (Contributed by Victor Stinner in :gh:`105396`.)
pt_br: Descontinua a função :c:func:`PyImport_ImportModuleNoBlock` que é apenas um apelido para :c:func:`PyImport_ImportModule` desde o Python 3.3. (Contribuição de Victor Stinner em :gh:`105396`.)

source: :term:`Soft deprecate <soft deprecated>` the :c:func:`PyModule_AddObject` function. It should be replaced with :c:func:`PyModule_Add` or :c:func:`PyModule_AddObjectRef`. (Contributed by Serhiy Storchaka in :gh:`86493`.)
pt_br: :term:`Descontinua suavemente <soft deprecated>` a função :c:func:`PyModule_AddObject`. Ela deve ser substituída por :c:func:`PyModule_Add` ou :c:func:`PyModule_AddObjectRef`. (Contribuição de Serhiy Storchaka em :gh:`86493`.)
