Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: What's New In Python 3.13
pt_br: O que há de novo no Python 3.13

source: Editors
pt_br: Editores

source: Adam Turner and Thomas Wouters
pt_br: Adam Turner e Thomas Wouters

source: This article explains the new features in Python 3.13, compared to 3.12. Python 3.13 was released on October 7, 2024. For full details, see the :ref:`changelog <changelog>`.
pt_br: Este artigo explica os novos recursos no Python 3.13, em comparação com 3.12. Python 3.13 foi lançado em 7 de outubro de 2024. Veja :ref:`changelog <changelog>` para uma lista completa de mudanças.

source: :pep:`719` -- Python 3.13 Release Schedule
pt_br: :pep:`719` -- Cronograma de lançamento do Python 3.13

source: Summary -- Release Highlights
pt_br: Resumo -- Destaques da versão

source: Python 3.13 is the latest stable release of the Python programming language, with a mix of changes to the language, the implementation and the standard library. The biggest changes include a new `interactive interpreter <whatsnew313-better-interactive-interpreter_>`_, experimental support for running in a `free-threaded mode <whatsnew313-free-threaded-cpython_>`_ (:pep:`703`), and a `Just-In-Time compiler <whatsnew313-jit-compiler_>`_ (:pep:`744`).
pt_br: O Python 3.13 é a versão estável mais recente da linguagem de programação Python, com uma mistura de mudanças na linguagem, na implementação e na biblioteca padrão. As maiores mudanças incluem um novo `interpretador interativo <whatsnew313-better-interactive-interpreter_>`_, suporte experimental para execução em um `modo de threads livres <whatsnew313-free-threaded-cpython_>`_ (:pep:`703`) e um `compilador Just-In-Time <whatsnew313-jit-compiler_>`_ (:pep:`744`).

source: Error messages continue to improve, with tracebacks now highlighted in color by default. The :func:`locals` builtin now has :ref:`defined semantics <whatsnew313-locals-semantics>` for changing the returned mapping, and type parameters now support default values.
pt_br: As mensagens de erro continuam a melhorar, com tracebacks (situação da pilha de execução) agora realçados em cores por padrão. A função embutida :func:`locals` agora tem :ref:`semânticas definidas <whatsnew313-locals-semantics>` para alterar o mapeamento retornado, e os parâmetros de tipo agora oferecem suporte a valores padrão.

source: The library changes contain removal of deprecated APIs and modules, as well as the usual improvements in user-friendliness and correctness. Several legacy standard library modules have now `been removed <whatsnew313-pep594_>`_ following their deprecation in Python 3.11 (:pep:`594`).
pt_br: As alterações da biblioteca contêm a remoção de APIs e módulos descontinuados, bem como as melhorias usuais em facilidade de uso e correção. Vários módulos da biblioteca padrão legados agora `foram removidos <whatsnew313-pep594_>`_ após sua descontinuação no Python 3.11 (:pep:`594`).

source: This article doesn't attempt to provide a complete specification of all new features, but instead gives a convenient overview. For full details refer to the documentation, such as the :ref:`Library Reference <library-index>` and :ref:`Language Reference <reference-index>`. To understand the complete implementation and design rationale for a change, refer to the PEP for a particular new feature; but note that PEPs usually are not kept up-to-date once a feature has been fully implemented. See `Porting to Python 3.13`_ for guidance on upgrading from earlier versions of Python.
pt_br: Este artigo não tenta fornecer uma especificação completa de todos os novos recursos, mas fornece uma visão geral conveniente. Para detalhes completos, consulte a documentação, como :ref:`Referência da Biblioteca <library-index>` e :ref:`Referência da Linguagem <reference-index>`. Para entender a implementação completa e a justificativa do design para uma mudança, consulte a PEP para um novo recurso específico; mas observe que as PEPs geralmente não são mantidas atualizadas depois que um recurso é totalmente implementado. Veja `Portando para o Python 3.13`_ para orientação sobre atualização a partir de versões anteriores do Python.

source: Interpreter improvements:
pt_br: Melhorias no interpretador:

source: A greatly improved :ref:`interactive interpreter <whatsnew313-better-interactive-interpreter>` and :ref:`improved error messages <whatsnew313-improved-error-messages>`.
pt_br: Um :ref:`interpretador interativo <whatsnew313-better-interactive-interpreter>` bastante aprimorado e :ref:`mensagens de erro aprimoradas <whatsnew313-improved-error-messages>`.

source: :pep:`667`: The :func:`locals` builtin now has :ref:`defined semantics <whatsnew313-locals-semantics>` when mutating the returned mapping. Python debuggers and similar tools may now more reliably update local variables in optimized scopes even during concurrent code execution.
pt_br: :pep:`667`: a função embutida :func:`locals` agora tem :ref:`semântica definida <whatsnew313-locals-semantics>` ao fazer a mutação do mapeamento retornado. Os depuradores do Python e ferramentas semelhantes agora podem atualizar variáveis locais de maneira mais confiável em escopos otimizados, mesmo durante a execução simultânea de código.

source: :pep:`703`: CPython 3.13 has experimental support for running with the :term:`global interpreter lock` disabled. See :ref:`Free-threaded CPython <whatsnew313-free-threaded-cpython>` for more details.
pt_br: :pep:`703`: CPython 3.13 tem suporte experimental para ser executado com a :term:`trava global do interpretador`, ou GIL, desabilitada. Veja :ref:`CPython com threads livres <whatsnew313-free-threaded-cpython>` para mais detalhes.

source: :pep:`744`: A basic :ref:`JIT compiler <whatsnew313-jit-compiler>` was added. It is currently disabled by default (though we may turn it on later). Performance improvements are modest -- we expect to improve this over the next few releases.
pt_br: :pep:`744`: um :ref:`compilador JIT <whatsnew313-jit-compiler>` básico foi adicionado. Atualmente está desativado por padrão (embora possamos ativá-lo mais tarde). As melhorias de desempenho são modestas -- esperamos melhorar isso nas próximas versões.

source: Color support in the new :ref:`interactive interpreter <whatsnew313-better-interactive-interpreter>`, as well as in :ref:`tracebacks <whatsnew313-improved-error-messages>` and :ref:`doctest <whatsnew313-doctest>` output. This can be disabled through the :envvar:`PYTHON_COLORS` and |NO_COLOR|_ environment variables.
pt_br: Suporte a cores no novo :ref:`interpretador interativo <whatsnew313-better-interactive-interpreter>`, bem como na saída de :ref:`tracebacks <whatsnew313-improved-error-messages>` e de :ref:`doctest <whatsnew313-doctest>`. Isso pode ser desabilitado através das variáveis de ambiente :envvar:`PYTHON_COLORS` e |NO_COLOR|_.

source: Python data model improvements:
pt_br: Melhorias no modelo de dados Python:

source: :attr:`~type.__static_attributes__` stores the names of attributes accessed through ``self.X`` in any function in a class body.
pt_br: :attr:`~type.__static_attributes__` armazena os nomes dos atributos acessados por meio de ``self.X`` em qualquer função no corpo da classe.

source: :attr:`~type.__firstlineno__` records the first line number of a class definition.
pt_br: :attr:`~type.__firstlineno__` registra o número da primeira linha da definição de classe.

source: Significant improvements in the standard library:
pt_br: Melhorias significativas na biblioteca padrão:

source: Add a new :exc:`PythonFinalizationError` exception, raised when an operation is blocked during :term:`finalization <interpreter shutdown>`.
pt_br: Adiciona uma nova exceção :exc:`PythonFinalizationError`, levantada quando uma operação é bloqueada durante a :term:`finalização <interpreter shutdown>`.

source: The :mod:`argparse` module now supports deprecating command-line options, positional arguments, and subcommands.
pt_br: O módulo :mod:`argparse` agora oferece suporte a descontinuar opções de linha de comando, argumentos posicionais e subcomandos.

source: The new functions :func:`base64.z85encode` and :func:`base64.z85decode` support encoding and decoding `Z85 data`_.
pt_br: As novas funções :func:`base64.z85encode` e :func:`base64.z85decode` oferecem suporte à codificação e decodificação de `dados Z85`_.

source: The :mod:`copy` module now has a :func:`copy.replace` function, with support for many builtin types and any class defining the :func:`~object.__replace__` method.
pt_br: O módulo :mod:`copy` agora tem uma função :func:`copy.replace`, com suporte para muitos tipos embutidos e qualquer classe que defina o método :func:`~object.__replace__`.

source: The new :mod:`dbm.sqlite3` module is now the default :mod:`dbm` backend.
pt_br: O novo módulo :mod:`dbm.sqlite3` agora é o backend :mod:`dbm` padrão.

source: The :mod:`os` module has a :ref:`suite of new functions <os-timerfd>` for working with Linux's timer notification file descriptors.
pt_br: O módulo :mod:`os` tem um :ref:`conjunto de novas funções <os-timerfd>` para trabalhar com os descritores de arquivo de notificação de temporizador do Linux.

source: The :mod:`random` module now has a :ref:`command-line interface <random-cli>`.
pt_br: O módulo :mod:`random` agora tem uma :ref:`interface de linha de comando <random-cli>`.

source: Security improvements:
pt_br: Melhorias de segurança:

source: :func:`ssl.create_default_context` sets :data:`ssl.VERIFY_X509_PARTIAL_CHAIN` and :data:`ssl.VERIFY_X509_STRICT` as default flags.
pt_br: :func:`ssl.create_default_context` define :data:`ssl.VERIFY_X509_PARTIAL_CHAIN` e :data:`ssl.VERIFY_X509_STRICT` como sinalizadores padrão.

source: C API improvements:
pt_br: Melhorias na API C:

source: The :c:data:`Py_mod_gil` slot is now used to indicate that an extension module supports running with the :term:`GIL` disabled.
pt_br: O slot :c:data:`Py_mod_gil` agora é usado para indicar que um módulo de extensão oferece suporte à execução com a :term:`GIL` desabilitada.

source: The :doc:`PyTime C API </c-api/time>` has been added, providing access to system clocks.
pt_br: A :doc:`API C PyTime </c-api/time>` foi adicionada, fornecendo acesso aos relógios do sistema.

source: :c:type:`PyMutex` is a new lightweight mutex that occupies a single byte.
pt_br: :c:type:`PyMutex` é um novo mutex leve que ocupa um único byte.

source: There is a new :ref:`suite of functions <c-api-monitoring>` for generating :pep:`669` monitoring events in the C API.
pt_br: Há um novo :ref:`conjunto de funções <c-api-monitoring>` para gerar eventos de monitoramento da :pep:`669` na API C.

source: New typing features:
pt_br: Novos recursos de tipagem:

source: :pep:`696`: Type parameters (:data:`typing.TypeVar`, :data:`typing.ParamSpec`, and :data:`typing.TypeVarTuple`) now support defaults.
pt_br: :pep:`696`: parâmetros de tipo (:data:`typing.TypeVar`, :data:`typing.ParamSpec` e :data:`typing.TypeVarTuple`) agora oferecem suporte a valores padrão.

source: :pep:`702`: The new :func:`warnings.deprecated` decorator adds support for marking deprecations in the type system and at runtime.
pt_br: :pep:`702`: o novo decorador :func:`warnings.deprecated` adiciona suporte para marcar descontinuações no sistema de tipos e ambiente de execução.

source: :pep:`705`: :data:`typing.ReadOnly` can be used to mark an item of a :class:`typing.TypedDict` as read-only for type checkers.
pt_br: :pep:`705`: :data:`typing.ReadOnly` pode ser usado para marcar um item de :class:`typing.TypedDict` como somente leitura para verificadores de tipo.

source: :pep:`742`: :data:`typing.TypeIs` provides more intuitive type narrowing behavior, as an alternative to :data:`typing.TypeGuard`.
pt_br: :pep:`742`: :data:`typing.TypeIs` fornece um comportamento de estreitamento de tipo mais intuitivo, como uma alternativa ao :data:`typing.TypeGuard`.

source: Platform support:
pt_br: Suporte à plataforma:

source: :pep:`730`: Apple's iOS is now an :ref:`officially supported platform <whatsnew313-platform-support>`, at :pep:`tier 3 <11#tier-3>`.
pt_br: :pep:`730`: iOS da Apple agora é uma :ref:`plataforma oficialmente com suporte <whatsnew313-platform-support>`, no :pep:`tier 3 <11#tier-3>`.

source: :pep:`738`: Android is now an :ref:`officially supported platform <whatsnew313-platform-support>`, at :pep:`tier 3 <11#tier-3>`.
pt_br: :pep:`738`: Android é agora uma :ref:`plataforma oficialmente com suporte <whatsnew313-platform-support>`, no :pep:`tier 3 <11#tier-3>`.

source: ``wasm32-wasi`` is now supported as a :pep:`tier 2 <11#tier-2>` platform.
pt_br: ``wasm32-wasi`` agora é uma plataforma com suporte :pep:`tier 2 <11#tier-2>`.

source: ``wasm32-emscripten`` is no longer an officially supported platform.
pt_br: ``wasm32-emscripten`` não é mais uma plataforma oficialmente com suporte.

source: Important removals:
pt_br: Remoções importantes:

source: :ref:`PEP 594 <whatsnew313-pep594>`: The remaining 19 "dead batteries" (legacy stdlib modules) have been removed from the standard library: :mod:`!aifc`, :mod:`!audioop`, :mod:`!cgi`, :mod:`!cgitb`, :mod:`!chunk`, :mod:`!crypt`, :mod:`!imghdr`, :mod:`!mailcap`, :mod:`!msilib`, :mod:`!nis`, :mod:`!nntplib`, :mod:`!ossaudiodev`, :mod:`!pipes`, :mod:`!sndhdr`, :mod:`!spwd`, :mod:`!sunau`, :mod:`!telnetlib`, :mod:`!uu` and :mod:`!xdrlib`.
pt_br: :ref:`PEP 594 <whatsnew313-pep594>`: as 19 "baterias descarregadas" (módulos legados da biblioteca padrão) restantes foram removidas da biblioteca padrão: :mod:`!aifc`, :mod:`!audioop`, :mod:`!cgi`, :mod:`!cgitb`, :mod:`!chunk`, :mod:`!crypt`, :mod:`!imghdr`, :mod:`!mailcap`, :mod:`!msilib`, :mod:`!nis`, :mod:`!nntplib`, :mod:`!ossaudiodev`, :mod:`!pipes`, :mod:`!sndhdr`, :mod:`!spwd`, :mod:`!sunau`, :mod:`!telnetlib`, :mod:`!uu` e :mod:`!xdrlib`.

source: Remove the :program:`2to3` tool and :mod:`!lib2to3` module (deprecated in Python 3.11).
pt_br: Remove a ferramenta :program:`2to3` e o módulo :mod:`!lib2to3` (descontinuados no Python 3.11).

source: Remove the :mod:`!tkinter.tix` module (deprecated in Python 3.6).
pt_br: Remove o módulo :mod:`!tkinter.tix` (descontinuado no Python 3.6).

source: Remove the :func:`!locale.resetlocale` function.
pt_br: Remove a função :func:`!locale.resetlocale`.

source: Remove the :mod:`!typing.io` and :mod:`!typing.re` namespaces.
pt_br: Remove os espaços de nomes :mod:`!typing.io` e :mod:`!typing.re`.

source: Remove chained :class:`classmethod` descriptors.
pt_br: Remove descritores encadeados de :class:`classmethod`.

source: Release schedule changes:
pt_br: Mudanças no cronograma de lançamento:

source: :pep:`602` ("Annual Release Cycle for Python") has been updated to extend the full support ('bugfix') period for new releases to two years. This updated policy means that:
pt_br: :pep:`602` ("Ciclo de Lançamento Anual para Python") foi atualizado para estender o período de suporte total ("bugfix") para novos lançamentos para dois anos. Esta política atualizada significa que:

source: Python 3.9--3.12 have one and a half years of full support, followed by three and a half years of security fixes.
pt_br: O Python 3.9--3.12 tem um ano e meio de suporte total, seguido por três anos e meio de correções de segurança.

source: Python 3.13 and later have two years of full support, followed by three years of security fixes.
pt_br: Python 3.13 e posteriores têm dois anos de suporte total, seguidos de três anos de correções de segurança.

source: New Features
pt_br: Novas funcionalidades

source: A better interactive interpreter
pt_br: Um melhor interpretador interativo

source: Python now uses a new :term:`interactive` shell by default, based on code from the `PyPy project`_. When the user starts the :term:`REPL` from an interactive terminal, the following new features are now supported:
pt_br: Python agora usa um novo console :term:`interativo` por padrão, com base no código do `projeto PyPy`_. Quando o usuário inicia o :term:`REPL` de um terminal interativo, agora os seguintes novos recursos estão disponíveis:

source: Multiline editing with history preservation.
pt_br: Edição multilinha com preservação do histórico.

source: Direct support for REPL-specific commands like :kbd:`help`, :kbd:`exit`, and :kbd:`quit`, without the need to call them as functions.
pt_br: Suporte direto para comandos específicos do REPL, como :kbd:`help`, :kbd:`exit` e :kbd:`quit`, sem a necessidade de chamá-los como funções.

source: Prompts and tracebacks with :ref:`color enabled by default <using-on-controlling-color>`.
pt_br: Prompts e tracebacks com :ref:`cores habilitadas por padrão <using-on-controlling-color>`.

source: Interactive help browsing using :kbd:`F1` with a separate command history.
pt_br: Ajuda interativa para navegar usando :kbd:`F1` com um histórico de comandos separado.

source: History browsing using :kbd:`F2` that skips output as well as the :term:`>>>` and :term:`...` prompts.
pt_br: Navegação no histórico usando :kbd:`F2` que ignora a saída, bem como os prompts :term:`>>>` e :term:`...`.

source: "Paste mode" with :kbd:`F3` that makes pasting larger blocks of code easier (press :kbd:`F3` again to return to the regular prompt).
pt_br: "Modo de colagem" com :kbd:`F3` que facilita colar blocos de código maiores (pressione :kbd:`F3` novamente para retornar ao prompt normal).

source: To disable the new interactive shell, set the :envvar:`PYTHON_BASIC_REPL` environment variable. For more on interactive mode, see :ref:`tut-interac`.
pt_br: Para desabilitar o novo console interativo, defina a variável de ambiente :envvar:`PYTHON_BASIC_REPL`. Para mais informações sobre o modo interativo, veja :ref:`tut-interac`.

source: (Contributed by Pablo Galindo Salgado, Łukasz Langa, and Lysandros Nikolaou in :gh:`111201` based on code from the PyPy project. Windows support contributed by Dino Viehland and Anthony Shaw.)
pt_br: (Contribuição de Pablo Galindo Salgado, Łukasz Langa e Lysandros Nikolaou em :gh:`111201` baseado no código do projeto PyPy. Suporte ao Windows foi uma contribuição de Dino Viehland e Anthony Shaw.)

source: Improved error messages
pt_br: Mensagens de erro melhoradas

source: The interpreter now uses color by default when displaying tracebacks in the terminal. This feature :ref:`can be controlled <using-on-controlling-color>` via the new :envvar:`PYTHON_COLORS` environment variable as well as the canonical |NO_COLOR|_ and |FORCE_COLOR|_ environment variables. (Contributed by Pablo Galindo Salgado in :gh:`112730`.)
pt_br: O interpretador agora usa cores por padrão ao exibir tracebacks no terminal. Este recurso :ref:`pode ser controlado <using-on-controlling-color>` por meio da nova variável de ambiente :envvar:`PYTHON_COLORS`, bem como das variáveis de ambiente canônicas |NO_COLOR|_ e |FORCE_COLOR|_. (Contribuição de Pablo Galindo Salgado em :gh:`112730`.)

source: A common mistake is to write a script with the same name as a standard library module. When this results in errors, we now display a more helpful error message:
pt_br: Um erro comum é escrever um script com o mesmo nome de um módulo de biblioteca padrão. Quando isso resulta em erros, agora exibimos uma mensagem de erro mais útil:

source: Similarly, if a script has the same name as a third-party module that it attempts to import and this results in errors, we also display a more helpful error message:
pt_br: Da mesma forma, se um script tiver o mesmo nome de um módulo de terceiros que ele tentar importar e isso resultar em erros, também exibiremos uma mensagem de erro mais útil:

source: (Contributed by Shantanu Jain in :gh:`95754`.)
pt_br: (Contribuição de Shantanu Jain em :gh:`95754`.)

source: The error message now tries to suggest the correct keyword argument when an incorrect keyword argument is passed to a function.
pt_br: A mensagem de erro agora tenta sugerir o argumento nomeado correto quando um argumento nomeado incorreto é passado para uma função.

source: (Contributed by Pablo Galindo Salgado and Shantanu Jain in :gh:`107944`.)
pt_br: (Contribuição de Pablo Galindo Salgado e Shantanu Jain em :gh:`107944`.)

source: Free-threaded CPython
pt_br: CPython com threads livres

source: CPython now has experimental support for running in a free-threaded mode, with the :term:`global interpreter lock` (GIL) disabled. This is an experimental feature and therefore is not enabled by default. The free-threaded mode requires a different executable, usually called ``python3.13t`` or ``python3.13t.exe``. Pre-built binaries marked as *free-threaded* can be installed as part of the official :ref:`Windows <install-freethreaded-windows>` and :ref:`macOS <install-freethreaded-macos>` installers, or CPython can be built from source with the :option:`--disable-gil` option.
pt_br: O CPython agora tem suporte experimental para execução em modo de threads livres, com a :term:`trava global do interpretador` (GIL) desabilitada. Este é um recurso experimental e, portanto, não é habilitado por padrão. O modo de threads livres requer um executável diferente, geralmente chamado de ``python3.13t`` ou ``python3.13t.exe``. Binários pré-construídos marcados como *free-threaded* podem ser instalados como parte dos instaladores oficiais :ref:`Windows <install-freethreaded-windows>` e :ref:`macOS <getting-and-installing-macpython>`, ou o CPython pode ser construído a partir da fonte com a opção :option:`--disable-gil`.

source: Free-threaded execution allows for full utilization of the available processing power by running threads in parallel on available CPU cores. While not all software will benefit from this automatically, programs designed with threading in mind will run faster on multi-core hardware. **The free-threaded mode is experimental** and work is ongoing to improve it: expect some bugs and a substantial single-threaded performance hit. Free-threaded builds of CPython support optionally running with the GIL enabled at runtime using the environment variable :envvar:`PYTHON_GIL` or the command-line option :option:`-X gil=1`.
pt_br: A execução de threads livres permite a utilização total do poder de processamento disponível ao executar threads em paralelo nos núcleos de CPU disponíveis. Embora nem todos os softwares se beneficiem disso automaticamente, programas projetados com threading em mente serão executados mais rapidamente em hardware multi-core. **O modo de threads livres é experimental** e o trabalho está em andamento para melhorá-lo: espere alguns bugs e um impacto substancial no desempenho de thread único. As construções de threads livres do CPython oferecem suporte à execução opcional com a GIL habilitada no tempo de execução usando a variável de ambiente :envvar:`PYTHON_GIL` ou a opção de linha de comando :option:`-X gil=1`.

source: To check if the current interpreter supports free-threading, :option:`python -VV <-V>` and :data:`sys.version` contain "experimental free-threading build". The new :func:`!sys._is_gil_enabled` function can be used to check whether the GIL is actually disabled in the running process.
pt_br: Para verificar se o interpretador atual oferece suporte a threads livres, :option:`python -VV <-V>` e :data:`sys.version` contêm "experimental free-threading build". A nova função :func:`!sys._is_gil_enabled` pode ser usada para verificar se a GIL está realmente desabilitada no processo em execução.
