Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: Deprecate the old ``Py_UNICODE`` and ``PY_UNICODE_TYPE`` types and the :c:macro:`!Py_UNICODE_WIDE` define. Use the :c:type:`wchar_t` type directly instead. Since Python 3.3, ``Py_UNICODE`` and ``PY_UNICODE_TYPE`` are just aliases to :c:type:`!wchar_t`. (Contributed by Victor Stinner in :gh:`105156`.)
pt_br: Descontinua os tipos antigos ``Py_UNICODE`` e ``PY_UNICODE_TYPE`` e define :c:macro:`!Py_UNICODE_WIDE`. Em vez disso, use o tipo :c:type:`wchar_t` diretamente. Desde Python 3.3, ``Py_UNICODE`` e ``PY_UNICODE_TYPE`` são apenas apelidos para :c:type:`!wchar_t`. (Contribuição de Victor Stinner em :gh:`105156`.)

source: Deprecate the :c:func:`PyWeakref_GetObject` and :c:func:`PyWeakref_GET_OBJECT` functions, which return a :term:`borrowed reference`. Replace them with the new :c:func:`PyWeakref_GetRef` function, which returns a :term:`strong reference`. The `pythoncapi-compat project`_ can be used to get :c:func:`PyWeakref_GetRef` on Python 3.12 and older. (Contributed by Victor Stinner in :gh:`105927`.)
pt_br: Descontinua as funções :c:func:`PyWeakref_GetObject` e :c:func:`PyWeakref_GET_OBJECT`, que retornam uma :term:`referência emprestada`. Em vez disso, use a nova função :c:func:`PyWeakref_GetRef`, que retorna uma :term:`referência forte`. O `projeto pythoncapi-compat`_ pode ser usado para obter :c:func:`PyWeakref_GetRef` no Python 3.12 e versões anteriores. (Contribuição de Victor Stinner em :gh:`105927`.)

source: The ``ma_version_tag`` field in :c:type:`PyDictObject` for extension modules (:pep:`699`; :gh:`101193`).
pt_br: O campo ``ma_version_tag`` em :c:type:`PyDictObject` para módulos de extensão (:pep:`699`; :gh:`101193`).

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases (:gh:`95388`).
pt_br: A criação de :c:data:`tipos imutáveis <Py_TPFLAGS_IMMUTABLETYPE>` com bases mutáveis (:gh:`95388`).

source: The bundled copy of ``libmpdecimal``.
pt_br: A cópia empacotada do ``libmpdecimal``.

source: The :c:func:`PyImport_ImportModuleNoBlock`: Use :c:func:`PyImport_ImportModule` instead.
pt_br: :c:func:`PyImport_ImportModuleNoBlock`: use :c:func:`PyImport_ImportModule`.

source: :c:func:`PyWeakref_GetObject` and :c:func:`PyWeakref_GET_OBJECT`: Use :c:func:`PyWeakref_GetRef` instead. The `pythoncapi-compat project <https://github.com/python/pythoncapi-compat/>`__ can be used to get :c:func:`PyWeakref_GetRef` on Python 3.12 and older.
pt_br: :c:func:`PyWeakref_GetObject` e :c:func:`PyWeakref_GET_OBJECT`: Use :c:func:`PyWeakref_GetRef`. O `projeto pythoncapi-compat <https://github.com/python/pythoncapi-compat/>`__ pode ser usado para usar :c:func:`PyWeakref_GetRef` no Python 3.12 e versões anteriores.

source: :c:type:`Py_UNICODE` type and the :c:macro:`!Py_UNICODE_WIDE` macro: Use :c:type:`wchar_t` instead.
pt_br: O tipo :c:type:`Py_UNICODE` e a macro :c:macro:`!Py_UNICODE_WIDE`: use :c:type:`wchar_t`.

source: :c:func:`!PyUnicode_AsDecodedObject`: Use :c:func:`PyCodec_Decode` instead.
pt_br: :c:func:`!PyUnicode_AsDecodedObject`: use :c:func:`PyCodec_Decode`.

source: :c:func:`!PyUnicode_AsDecodedUnicode`: Use :c:func:`PyCodec_Decode` instead; Note that some codecs (for example, "base64") may return a type other than :class:`str`, such as :class:`bytes`.
pt_br: :c:func:`!PyUnicode_AsDecodedUnicode`: Use :c:func:`PyCodec_Decode`; Note que alguns codecs (por exemplo, "base64") podem retornar um tipo diferente de :class:`str`, tal como :class:`bytes`.

source: :c:func:`!PyUnicode_AsEncodedObject`: Use :c:func:`PyCodec_Encode` instead.
pt_br: :c:func:`!PyUnicode_AsEncodedObject`: use :c:func:`PyCodec_Encode`.

source: :c:func:`!PyUnicode_AsEncodedUnicode`: Use :c:func:`PyCodec_Encode` instead; Note that some codecs (for example, "base64") may return a type other than :class:`bytes`, such as :class:`str`.
pt_br: :c:func:`!PyUnicode_AsEncodedUnicode`: Use :c:func:`PyCodec_Encode`; Note que alguns codecs (por exemplo, "base64") podem retornar um tipo diferente de :class:`bytes`, tal com :class:`str`.

source: Python initialization functions, deprecated in Python 3.13:
pt_br: Funções de inicialização do Python, descontinuadas no Python 3.9:

source: :c:func:`Py_GetPath`: Use :c:func:`PyConfig_Get("module_search_paths") <PyConfig_Get>` (:data:`sys.path`) instead.
pt_br: :c:func:`Py_GetPath`: Use :c:func:`PyConfig_Get("module_search_paths") <PyConfig_Get>` (:data:`sys.path`).

source: :c:func:`Py_GetPrefix`: Use :c:func:`PyConfig_Get("base_prefix") <PyConfig_Get>` (:data:`sys.base_prefix`) instead. Use :c:func:`PyConfig_Get("prefix") <PyConfig_Get>` (:data:`sys.prefix`) if :ref:`virtual environments <venv-def>` need to be handled.
pt_br: :c:func:`Py_GetPrefix`: Use :c:func:`PyConfig_Get("base_prefix") <PyConfig_Get>` (:data:`sys.base_prefix`). Use :c:func:`PyConfig_Get("prefix") <PyConfig_Get>` (:data:`sys.prefix`) se :ref:`ambientes virtuais <venv-def>` precisam ser tratados.

source: :c:func:`Py_GetExecPrefix`: Use :c:func:`PyConfig_Get("base_exec_prefix") <PyConfig_Get>` (:data:`sys.base_exec_prefix`) instead. Use :c:func:`PyConfig_Get("exec_prefix") <PyConfig_Get>` (:data:`sys.exec_prefix`) if :ref:`virtual environments <venv-def>` need to be handled.
pt_br: :c:func:`Py_GetExecPrefix`: Use :c:func:`PyConfig_Get("base_exec_prefix") <PyConfig_Get>` (:data:`sys.base_exec_prefix`). Use :c:func:`PyConfig_Get("exec_prefix") <PyConfig_Get>` (:data:`sys.exec_prefix`) se :ref:`ambientes virtuais <venv-def>` precisam ser tratados.

source: :c:func:`Py_GetProgramFullPath`: Use :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`) instead.
pt_br: :c:func:`Py_GetProgramFullPath`: Use :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`).

source: :c:func:`Py_GetProgramName`: Use :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`) instead.
pt_br: :c:func:`Py_GetProgramName`: Use :c:func:`PyConfig_Get("executable") <PyConfig_Get>` (:data:`sys.executable`).

source: :c:func:`Py_GetPythonHome`: Use :c:func:`PyConfig_Get("home") <PyConfig_Get>` or the :envvar:`PYTHONHOME` environment variable instead.
pt_br: :c:func:`Py_GetPythonHome`: Use :c:func:`PyConfig_Get("home") <PyConfig_Get>` ou a variável de ambiente :envvar:`PYTHONHOME`.

source: The `pythoncapi-compat project <https://github.com/python/pythoncapi-compat/>`__ can be used to get :c:func:`PyConfig_Get` on Python 3.13 and older.
pt_br: O projeto `pythoncapi-compat <https://github.com/python/pythoncapi-compat/>`__ pode ser usado para obter :c:func:`PyConfig_Get` no Python 3.13 e versões anteriores.

source: Functions to configure Python's initialization, deprecated in Python 3.11:
pt_br: Funções para configurar a inicialização do Python, descontinuadas no Python 3.11:

source: :c:func:`!PySys_SetArgvEx()`: Set :c:member:`PyConfig.argv` instead.
pt_br: :c:func:`!PySys_SetArgvEx()`: defina :c:member:`PyConfig.argv`.

source: :c:func:`!PySys_SetArgv()`: Set :c:member:`PyConfig.argv` instead.
pt_br: :c:func:`!PySys_SetArgv()`: defina :c:member:`PyConfig.argv`.

source: :c:func:`!Py_SetProgramName()`: Set :c:member:`PyConfig.program_name` instead.
pt_br: :c:func:`!Py_SetProgramName()`: defina :c:member:`PyConfig.program_name`.

source: :c:func:`!Py_SetPythonHome()`: Set :c:member:`PyConfig.home` instead.
pt_br: :c:func:`!Py_SetPythonHome()`: defina :c:member:`PyConfig.home`.

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead.
pt_br: Em vez disso, a API :c:func:`Py_InitializeFromConfig` deve ser usada com :c:type:`PyConfig`.

source: Global configuration variables:
pt_br: Variáveis de configuração globais

source: :c:var:`Py_DebugFlag`: Use :c:member:`PyConfig.parser_debug` or :c:func:`PyConfig_Get("parser_debug") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_DebugFlag`: Use :c:member:`PyConfig.parser_debug` ou :c:func:`PyConfig_Get("parser_debug") <PyConfig_Get>`.

source: :c:var:`Py_VerboseFlag`: Use :c:member:`PyConfig.verbose` or :c:func:`PyConfig_Get("verbose") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_VerboseFlag`: Use :c:member:`PyConfig.verbose` ou :c:func:`PyConfig_Get("verbose") <PyConfig_Get>`.

source: :c:var:`Py_QuietFlag`: Use :c:member:`PyConfig.quiet` or :c:func:`PyConfig_Get("quiet") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_QuietFlag`: Use :c:member:`PyConfig.quiet` ou :c:func:`PyConfig_Get("quiet") <PyConfig_Get>`.

source: :c:var:`Py_InteractiveFlag`: Use :c:member:`PyConfig.interactive` or :c:func:`PyConfig_Get("interactive") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_InteractiveFlag`: Use :c:member:`PyConfig.interactive` ou :c:func:`PyConfig_Get("interactive") <PyConfig_Get>`.

source: :c:var:`Py_InspectFlag`: Use :c:member:`PyConfig.inspect` or :c:func:`PyConfig_Get("inspect") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_InspectFlag`: Use :c:member:`PyConfig.inspect` ou :c:func:`PyConfig_Get("inspect") <PyConfig_Get>`.

source: :c:var:`Py_OptimizeFlag`: Use :c:member:`PyConfig.optimization_level` or :c:func:`PyConfig_Get("optimization_level") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_OptimizeFlag`: Use :c:member:`PyConfig.optimization_level` ou :c:func:`PyConfig_Get("optimization_level") <PyConfig_Get>`.

source: :c:var:`Py_NoSiteFlag`: Use :c:member:`PyConfig.site_import` or :c:func:`PyConfig_Get("site_import") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_NoSiteFlag`: Use :c:member:`PyConfig.site_import` ou :c:func:`PyConfig_Get("site_import") <PyConfig_Get>`.

source: :c:var:`Py_BytesWarningFlag`: Use :c:member:`PyConfig.bytes_warning` or :c:func:`PyConfig_Get("bytes_warning") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_BytesWarningFlag`: Use :c:member:`PyConfig.bytes_warning` ou :c:func:`PyConfig_Get("bytes_warning") <PyConfig_Get>`.

source: :c:var:`Py_FrozenFlag`: Use :c:member:`PyConfig.pathconfig_warnings` or :c:func:`PyConfig_Get("pathconfig_warnings") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_FrozenFlag`: Use :c:member:`PyConfig.pathconfig_warnings` ou :c:func:`PyConfig_Get("pathconfig_warnings") <PyConfig_Get>`.

source: :c:var:`Py_IgnoreEnvironmentFlag`: Use :c:member:`PyConfig.use_environment` or :c:func:`PyConfig_Get("use_environment") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_IgnoreEnvironmentFlag`: Use :c:member:`PyConfig.use_environment` ou :c:func:`PyConfig_Get("use_environment") <PyConfig_Get>`.

source: :c:var:`Py_DontWriteBytecodeFlag`: Use :c:member:`PyConfig.write_bytecode` or :c:func:`PyConfig_Get("write_bytecode") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_DontWriteBytecodeFlag`: Use :c:member:`PyConfig.write_bytecode` ou :c:func:`PyConfig_Get("write_bytecode") <PyConfig_Get>`.

source: :c:var:`Py_NoUserSiteDirectory`: Use :c:member:`PyConfig.user_site_directory` or :c:func:`PyConfig_Get("user_site_directory") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_NoUserSiteDirectory`: Use :c:member:`PyConfig.user_site_directory` ou :c:func:`PyConfig_Get("user_site_directory") <PyConfig_Get>`.

source: :c:var:`Py_UnbufferedStdioFlag`: Use :c:member:`PyConfig.buffered_stdio` or :c:func:`PyConfig_Get("buffered_stdio") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_UnbufferedStdioFlag`: Use :c:member:`PyConfig.buffered_stdio` ou :c:func:`PyConfig_Get("buffered_stdio") <PyConfig_Get>`.

source: :c:var:`Py_HashRandomizationFlag`: Use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed` or :c:func:`PyConfig_Get("hash_seed") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_HashRandomizationFlag`: Use :c:member:`PyConfig.use_hash_seed` e :c:member:`PyConfig.hash_seed` ou :c:func:`PyConfig_Get("hash_seed") <PyConfig_Get>`.

source: :c:var:`Py_IsolatedFlag`: Use :c:member:`PyConfig.isolated` or :c:func:`PyConfig_Get("isolated") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_IsolatedFlag`: Use :c:member:`PyConfig.isolated` ou :c:func:`PyConfig_Get("isolated") <PyConfig_Get>`.

source: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Use :c:member:`PyPreConfig.legacy_windows_fs_encoding` or :c:func:`PyConfig_Get("legacy_windows_fs_encoding") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Use :c:member:`PyPreConfig.legacy_windows_fs_encoding` ou :c:func:`PyConfig_Get("legacy_windows_fs_encoding") <PyConfig_Get>`.

source: :c:var:`Py_LegacyWindowsStdioFlag`: Use :c:member:`PyConfig.legacy_windows_stdio` or :c:func:`PyConfig_Get("legacy_windows_stdio") <PyConfig_Get>` instead.
pt_br: :c:var:`Py_LegacyWindowsStdioFlag`: Use :c:member:`PyConfig.legacy_windows_stdio` ou :c:func:`PyConfig_Get("legacy_windows_stdio") <PyConfig_Get>`.

source: :c:var:`!Py_FileSystemDefaultEncoding`, :c:var:`!Py_HasFileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` or :c:func:`PyConfig_Get("filesystem_encoding") <PyConfig_Get>` instead.
pt_br: :c:var:`!Py_FileSystemDefaultEncoding`, :c:var:`!Py_HasFileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` ou :c:func:`PyConfig_Get("filesystem_encoding") <PyConfig_Get>`.

source: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Use :c:member:`PyConfig.filesystem_errors` or :c:func:`PyConfig_Get("filesystem_errors") <PyConfig_Get>` instead.
pt_br: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Use :c:member:`PyConfig.filesystem_errors` ou :c:func:`PyConfig_Get("filesystem_errors") <PyConfig_Get>`.

source: :c:var:`!Py_UTF8Mode`: Use :c:member:`PyPreConfig.utf8_mode` or :c:func:`PyConfig_Get("utf8_mode") <PyConfig_Get>` instead. (see :c:func:`Py_PreInitialize`)
pt_br: :c:var:`!Py_UTF8Mode`: Use :c:member:`PyPreConfig.utf8_mode` ou :c:func:`PyConfig_Get("utf8_mode") <PyConfig_Get>`. (veja :c:func:`Py_PreInitialize`)

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` to set these options. Or :c:func:`PyConfig_Get` can be used to get these options at runtime.
pt_br: A API :c:func:`Py_InitializeFromConfig` deve ser usada com :c:type:`PyConfig` para definir essas opções. Ou :c:func:`PyConfig_Get` pode ser usado para obter essas opções em tempo de execução.

source: Pending removal in Python 3.18
pt_br: Remoção pendente no Python 3.18

source: Deprecated private functions (:gh:`128863`):
pt_br: Funções privadas descontinuadas (:gh:`128863`):

source: :c:func:`!_PyLong_FromDigits` and :c:func:`!_PyLong_New`: use :c:func:`PyLongWriter_Create`.
pt_br: :c:func:`!_PyLong_FromDigits` e :c:func:`!_PyLong_New`: use :c:func:`PyLongWriter_Create`.

source: :c:func:`!_PyUnicodeWriter_Init`: replace ``_PyUnicodeWriter_Init(&writer)`` with :c:func:`writer = PyUnicodeWriter_Create(0) <PyUnicodeWriter_Create>`.
pt_br: :c:func:`!_PyUnicodeWriter_Init`: substitua ``_PyUnicodeWriter_Init(&writer)`` com :c:func:`writer = PyUnicodeWriter_Create(0) <PyUnicodeWriter_Create>`.

source: :c:func:`!_PyUnicodeWriter_Finish`: replace ``_PyUnicodeWriter_Finish(&writer)`` with :c:func:`PyUnicodeWriter_Finish(writer) <PyUnicodeWriter_Finish>`.
pt_br: :c:func:`!_PyUnicodeWriter_Finish`: substitua ``_PyUnicodeWriter_Finish(&writer)`` por :c:func:`PyUnicodeWriter_Finish(writer) <PyUnicodeWriter_Finish>`.

source: :c:func:`!_PyUnicodeWriter_Dealloc`: replace ``_PyUnicodeWriter_Dealloc(&writer)`` with :c:func:`PyUnicodeWriter_Discard(writer) <PyUnicodeWriter_Discard>`.
pt_br: :c:func:`!_PyUnicodeWriter_Dealloc`: substitua ``_PyUnicodeWriter_Dealloc(&writer)`` por :c:func:`PyUnicodeWriter_Discard(writer) <PyUnicodeWriter_Discard>`.

source: :c:func:`!_PyUnicodeWriter_WriteChar`: replace ``_PyUnicodeWriter_WriteChar(&writer, ch)`` with :c:func:`PyUnicodeWriter_WriteChar(writer, ch) <PyUnicodeWriter_WriteChar>`.
pt_br: :c:func:`!_PyUnicodeWriter_WriteChar`: substituta ``_PyUnicodeWriter_WriteChar(&writer, ch)`` com :c:func:`PyUnicodeWriter_WriteChar(writer, ch) <PyUnicodeWriter_WriteChar>`.

source: :c:func:`!_PyUnicodeWriter_WriteStr`: replace ``_PyUnicodeWriter_WriteStr(&writer, str)`` with :c:func:`PyUnicodeWriter_WriteStr(writer, str) <PyUnicodeWriter_WriteStr>`.
pt_br: :c:func:`!_PyUnicodeWriter_WriteStr`: substitua ``_PyUnicodeWriter_WriteStr(&writer, str)`` por :c:func:`PyUnicodeWriter_WriteStr(writer, str) <PyUnicodeWriter_WriteStr>`.

source: :c:func:`!_PyUnicodeWriter_WriteSubstring`: replace ``_PyUnicodeWriter_WriteSubstring(&writer, str, start, end)`` with :c:func:`PyUnicodeWriter_WriteSubstring(writer, str, start, end) <PyUnicodeWriter_WriteSubstring>`.
pt_br: :c:func:`!_PyUnicodeWriter_WriteSubstring`: substitua ``_PyUnicodeWriter_WriteSubstring(&writer, str, start, end)`` por :c:func:`PyUnicodeWriter_WriteSubstring(writer, str, start, end) <PyUnicodeWriter_WriteSubstring>`.

source: :c:func:`!_PyUnicodeWriter_WriteASCIIString`: replace ``_PyUnicodeWriter_WriteASCIIString(&writer, str)`` with :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.
pt_br: :c:func:`!_PyUnicodeWriter_WriteASCIIString`: substitua ``_PyUnicodeWriter_WriteASCIIString(&writer, str)`` por :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.

source: :c:func:`!_PyUnicodeWriter_WriteLatin1String`: replace ``_PyUnicodeWriter_WriteLatin1String(&writer, str)`` with :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.
pt_br: :c:func:`!_PyUnicodeWriter_WriteLatin1String`: substitua ``_PyUnicodeWriter_WriteLatin1String(&writer, str)`` por :c:func:`PyUnicodeWriter_WriteUTF8(writer, str) <PyUnicodeWriter_WriteUTF8>`.

source: :c:func:`!_PyUnicodeWriter_Prepare`: (no replacement).
pt_br: :c:func:`!_PyUnicodeWriter_Prepare`: (sem substituto).

source: :c:func:`!_PyUnicodeWriter_PrepareKind`: (no replacement).
pt_br: :c:func:`!_PyUnicodeWriter_PrepareKind`: (sem substituto).

source: The `pythoncapi-compat project <https://github.com/python/pythoncapi-compat/>`__ can be used to get these new public functions on Python 3.13 and older.
pt_br: O projeto `pythoncapi-compat <https://github.com/python/pythoncapi-compat/>`__ pode ser usado para obter essas novas funções públicas no Python 3.13 e versões anteriores.

source: The following APIs are deprecated and will be removed, although there is currently no date scheduled for their removal.
pt_br: As APIs a seguir foram descontinuadas e serão removidas, embora atualmente não haja uma data agendada para sua remoção.

source: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: Unneeded since Python 3.8.
pt_br: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: desnecessária desde o Python 3.8.

source: :c:func:`PyErr_Fetch`: Use :c:func:`PyErr_GetRaisedException` instead.
pt_br: :c:func:`PyErr_Fetch`: use :c:func:`PyErr_GetRaisedException`.

source: :c:func:`PyErr_NormalizeException`: Use :c:func:`PyErr_GetRaisedException` instead.
pt_br: :c:func:`PyErr_NormalizeException`: use :c:func:`PyErr_GetRaisedException`.

source: :c:func:`PyErr_Restore`: Use :c:func:`PyErr_SetRaisedException` instead.
pt_br: :c:func:`PyErr_Restore`: use :c:func:`PyErr_SetRaisedException`.

source: :c:func:`PyModule_GetFilename`: Use :c:func:`PyModule_GetFilenameObject` instead.
pt_br: :c:func:`PyModule_GetFilename`: use :c:func:`PyModule_GetFilenameObject`.

source: :c:func:`PyOS_AfterFork`: Use :c:func:`PyOS_AfterFork_Child` instead.
pt_br: :c:func:`PyOS_AfterFork`: use :c:func:`PyOS_AfterFork_Child`.

source: :c:func:`PySlice_GetIndicesEx`: Use :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` instead.
pt_br: :c:func:`PySlice_GetIndicesEx`: use :c:func:`PySlice_Unpack` e :c:func:`PySlice_AdjustIndices`.

source: :c:func:`PyUnicode_READY`: Unneeded since Python 3.12
pt_br: :c:func:`PyUnicode_READY`: desnecessário desde o Python 3.12

source: :c:func:`!PyErr_Display`: Use :c:func:`PyErr_DisplayException` instead.
pt_br: :c:func:`!PyErr_Display`: use :c:func:`PyErr_DisplayException`.

source: :c:func:`!_PyErr_ChainExceptions`: Use :c:func:`!_PyErr_ChainExceptions1` instead.
pt_br: :c:func:`!_PyErr_ChainExceptions`: use :c:func:`!_PyErr_ChainExceptions1`.

source: :c:member:`!PyBytesObject.ob_shash` member: call :c:func:`PyObject_Hash` instead.
pt_br: O membro :c:member:`!PyBytesObject.ob_shash`: chame :c:func:`PyObject_Hash`.

source: Thread Local Storage (TLS) API:
pt_br: API do Thread Local Storage (TLS):

source: :c:func:`PyThread_create_key`: Use :c:func:`PyThread_tss_alloc` instead.
pt_br: :c:func:`PyThread_create_key`: use :c:func:`PyThread_tss_alloc`.

source: :c:func:`PyThread_delete_key`: Use :c:func:`PyThread_tss_free` instead.
pt_br: :c:func:`PyThread_delete_key`: use :c:func:`PyThread_tss_free`.

source: :c:func:`PyThread_set_key_value`: Use :c:func:`PyThread_tss_set` instead.
pt_br: :c:func:`PyThread_set_key_value`: use :c:func:`PyThread_tss_set`.

source: :c:func:`PyThread_get_key_value`: Use :c:func:`PyThread_tss_get` instead.
pt_br: :c:func:`PyThread_get_key_value`: use :c:func:`PyThread_tss_get`.

source: :c:func:`PyThread_delete_key_value`: Use :c:func:`PyThread_tss_delete` instead.
pt_br: :c:func:`PyThread_delete_key_value`: use :c:func:`PyThread_tss_delete`.

source: :c:func:`PyThread_ReInitTLS`: Unneeded since Python 3.7.
pt_br: :c:func:`PyThread_ReInitTLS`: desnecessário desde o Python 3.7.

source: Build Changes
pt_br: Mudanças na construção

source: ``arm64-apple-ios`` and ``arm64-apple-ios-simulator`` are both now :pep:`11` tier 3 platforms. (:ref:`PEP 730 <whatsnew313-platform-support>` written and implementation contributed by Russell Keith-Magee in :gh:`114099`.)
pt_br: ``arm64-apple-ios`` e ``arm64-apple-ios-simulator`` são agora plataformas de nível 3 da :pep:`11`. (Escrita e implementação da :ref:`PEP 730 <whatsnew313-platform-support>` foi uma contribuição de Russell Keith-Magee em :gh:`114099`.)

source: ``aarch64-linux-android`` and ``x86_64-linux-android`` are both now :pep:`11` tier 3 platforms. (:ref:`PEP 738 <whatsnew313-platform-support>` written and implementation contributed by Malcolm Smith in :gh:`116622`.)
pt_br: ``aarch64-linux-android`` e ``x86_64-linux-android`` são agora plataformas de nível 3 da :pep:`11`. (Escrita e implementação da :ref:`PEP 738 <whatsnew313-platform-support>` foi uma contribuição de Malcolm Smith em :gh:`116622`.)

source: ``wasm32-wasi`` is now a :pep:`11` tier 2 platform. (Contributed by Brett Cannon in :gh:`115192`.)
pt_br: ``wasm32-wasi`` agora é uma plataforma de nível 2 segundo a :pep:`11`. (Contribuição de Brett Cannon em :gh:`115192`.)

source: ``wasm32-emscripten`` is no longer a :pep:`11` supported platform. (Contributed by Brett Cannon in :gh:`115192`.)
pt_br: ``wasm32-emscripten`` não é mais uma plataforma suportada pela :pep:`11`. (Contribuição de Brett Cannon em :gh:`115192`.)

source: Building CPython now requires a compiler with support for the C11 atomic library, GCC built-in atomic functions, or MSVC interlocked intrinsics.
pt_br: Construir CPython agora requer um compilador com suporte para a biblioteca atômica C11, funções atômicas embutidas do GCC ou intrínsecos interligados MSVC.

source: Autoconf 2.71 and aclocal 1.16.5 are now required to regenerate the :file:`configure` script. (Contributed by Christian Heimes in :gh:`89886` and by Victor Stinner in :gh:`112090`.)
pt_br: Autoconf 2.71 e aclocal 1.16.5 agora são necessários para regerar o script :file:`configure`. (Contribuição de Christian Heimes em :gh:`89886` e de Victor Stinner em :gh:`112090`.)

source: SQLite 3.15.2 or newer is required to build the :mod:`sqlite3` extension module. (Contributed by Erlend Aasland in :gh:`105875`.)
pt_br: SQLite 3.15.2 ou mais recente é necessário para construir o módulo de extensão :mod:`sqlite3`. (Contribuição de Erlend Aasland em :gh:`105875`.)
