Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: :mod:`argparse`: The *type*, *choices*, and *metavar* parameters of :class:`!argparse.BooleanOptionalAction` are deprecated and will be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`92248`.)
pt_br: :mod:`argparse`: Os parâmetros *type*, *choices* e *metavar* de :class:`!argparse.BooleanOptionalAction` foram descontinuados e serão removidos na versão 3.14. (Contribuição de Nikita Sobolev em :gh:`92248`.)

source: :mod:`ast`: The following features have been deprecated in documentation since Python 3.8, now cause a :exc:`DeprecationWarning` to be emitted at runtime when they are accessed or used, and will be removed in Python 3.14:
pt_br: :mod:`ast`: os seguintes recursos foram descontinuados na documentação desde Python 3.8, agora fazem com que um :exc:`DeprecationWarning` seja emitido em tempo de execução quando eles são acessados ou usados, e serão removidos no Python 3.14:

source: Use :class:`ast.Constant` instead. (Contributed by Serhiy Storchaka in :gh:`90953`.)
pt_br: Em vez disso, use :class:`ast.Constant`. (Contribuição de Serhiy Storchaka em :gh:`90953`.)

source: The child watcher classes :class:`!asyncio.MultiLoopChildWatcher`, :class:`!asyncio.FastChildWatcher`, :class:`!asyncio.AbstractChildWatcher` and :class:`!asyncio.SafeChildWatcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
pt_br: As classes filhas dos observadores :class:`!asyncio.MultiLoopChildWatcher`, :class:`!asyncio.FastChildWatcher`, :class:`!asyncio.AbstractChildWatcher` e :class:`!asyncio.SafeChildWatcher` foram descontinuadas e serão removidas no Python 3.14. (Contribuição de Kumar Aditya em :gh:`94597`.)

source: :func:`!asyncio.set_child_watcher`, :func:`!asyncio.get_child_watcher`, :meth:`!asyncio.AbstractEventLoopPolicy.set_child_watcher` and :meth:`!asyncio.AbstractEventLoopPolicy.get_child_watcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
pt_br: :func:`!asyncio.set_child_watcher`, :func:`!asyncio.get_child_watcher`, :meth:`!asyncio.AbstractEventLoopPolicy.set_child_watcher` e :meth:`!asyncio.AbstractEventLoopPolicy.get_child_watcher` foram descontinuados e serão removidos no Python 3.14. (Contribuição de Kumar Aditya em :gh:`94597`.)

source: The :meth:`~asyncio.get_event_loop` method of the default event loop policy now emits a :exc:`DeprecationWarning` if there is no current event loop set and it decides to create one. (Contributed by Serhiy Storchaka and Guido van Rossum in :gh:`100160`.)
pt_br: O método :meth:`~asyncio.get_event_loop` da política de laço de eventos padrão agora emite um :exc:`DeprecationWarning` se não houver nenhum laço de eventos atual definido e decidir criar um. (Contribuição de Serhiy Storchaka e Guido van Rossum em :gh:`100160`.)

source: :mod:`collections.abc`: Deprecated :class:`!collections.abc.ByteString`. Prefer :class:`!Sequence` or :class:`~collections.abc.Buffer`. For use in typing, prefer a union, like ``bytes | bytearray``, or :class:`collections.abc.Buffer`. (Contributed by Shantanu Jain in :gh:`91896`.)
pt_br: :mod:`collections.abc`: :class:`!collections.abc.ByteString` foi descontinuado. Prefira :class:`!Sequence` ou :class:`~collections.abc.Buffer`. Para uso em tipagem, prefira uma união, como ``bytes | bytearray`` ou :class:`collections.abc.Buffer`. (Contribuição de Shantanu Jain em :gh:`91896`.)

source: :mod:`email`: Deprecated the *isdst* parameter in :func:`email.utils.localtime`. (Contributed by Alan Williams in :gh:`72346`.)
pt_br: :mod:`email`: Descontinua o parâmetro *isdst* em :func:`email.utils.localtime`. (Contribuição de Alan Williams em :gh:`72346`.)

source: :mod:`importlib.abc` deprecated classes:
pt_br: :mod:`importlib.abc` descontinuou as classes:

source: Use :mod:`importlib.resources.abc` classes instead:
pt_br: Em vez disso, use classes de :mod:`importlib.resources.abc`:

source: (Contributed by Jason R. Coombs and Hugo van Kemenade in :gh:`93963`.)
pt_br: (Contribuição de Jason R. Coombs e Hugo van Kemenade em :gh:`93963`.)

source: :mod:`itertools` had undocumented, inefficient, historically buggy, and inconsistent support for copy, deepcopy, and pickle operations. This will be removed in 3.14 for a significant reduction in code volume and maintenance burden. (Contributed by Raymond Hettinger in :gh:`101588`.)
pt_br: :mod:`itertools` tinha suporte não documentado, ineficiente, historicamente cheio de bugs e inconsistente para operações de cópia, cópia profunda e serialização com pickle. Isso será removido na versão 3.14 para uma redução significativa no volume de código e na carga de manutenção. (Contribuição de Raymond Hettinger em :gh:`101588`.)

source: :mod:`multiprocessing`: The default start method will change to a safer one on Linux, BSDs, and other non-macOS POSIX platforms where ``'fork'`` is currently the default (:gh:`84559`). Adding a runtime warning about this was deemed too disruptive as the majority of code is not expected to care. Use the :func:`~multiprocessing.get_context` or :func:`~multiprocessing.set_start_method` APIs to explicitly specify when your code *requires* ``'fork'``. See :ref:`multiprocessing-start-methods`.
pt_br: :mod:`multiprocessing`: o método de inicialização padrão será alterado para um mais seguro no Linux, BSDs e outras plataformas POSIX não-macOS onde ``'fork'`` é atualmente o padrão (:gh:`84559`). Adicionar um aviso de tempo de execução sobre isso foi considerado muito perturbador, pois não se espera que a maior parte do código se importe. Use as APIs :func:`~multiprocessing.get_context` ou :func:`~multiprocessing.set_start_method` para especificar explicitamente quando seu código *requer* ``'fork'``. Veja :ref:`multiprocessing-start-methods`.

source: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` and :meth:`~pathlib.PurePath.relative_to`: passing additional arguments is deprecated.
pt_br: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` e :meth:`~pathlib.PurePath.relative_to`: passar argumentos adicionais foi descontinuado.

source: :mod:`pkgutil`: :func:`!pkgutil.find_loader` and :func:`!pkgutil.get_loader` now raise :exc:`DeprecationWarning`; use :func:`importlib.util.find_spec` instead. (Contributed by Nikita Sobolev in :gh:`97850`.)
pt_br: :mod:`pkgutil`: :func:`!pkgutil.find_loader` e :func:`!pkgutil.get_loader` agora levantam :exc:`DeprecationWarning`; use :func:`importlib.util.find_spec`. (Contribuição de Nikita Sobolev em :gh:`97850`.)

source: :data:`!version` and :data:`!version_info`.
pt_br: :data:`!version` e :data:`!version_info`.

source: :meth:`~sqlite3.Cursor.execute` and :meth:`~sqlite3.Cursor.executemany` if :ref:`named placeholders <sqlite3-placeholders>` are used and *parameters* is a sequence instead of a :class:`dict`.
pt_br: :meth:`~sqlite3.Cursor.execute` e :meth:`~sqlite3.Cursor.executemany` se :ref:`espaços reservados nomeados <sqlite3-placeholders>` forem usados e *parameters* for uma sequência em vez de um :class:`dict` .

source: :mod:`typing`: :class:`!typing.ByteString`, deprecated since Python 3.9, now causes a :exc:`DeprecationWarning` to be emitted when it is used.
pt_br: :mod:`typing`: :class:`!typing.ByteString`, descontinuado desde Python 3.9, agora faz com que uma :exc:`DeprecationWarning` seja emitida quando é usado.

source: :mod:`urllib`: :class:`!urllib.parse.Quoter` is deprecated: it was not intended to be a public API. (Contributed by Gregory P. Smith in :gh:`88168`.)
pt_br: :mod:`urllib`: :class:`!urllib.parse.Quoter` está obsoleto: não foi planejado para ser uma API pública. (Contribuição de Gregory P. Smith em :gh:`88168`.)

source: Pending removal in Python 3.15
pt_br: Remoção pendente no Python 3.15

source: The import system:
pt_br: O sistema de importação:

source: Setting :attr:`~module.__cached__` on a module while failing to set :attr:`__spec__.cached <importlib.machinery.ModuleSpec.cached>` is deprecated. In Python 3.15, :attr:`!__cached__` will cease to be set or take into consideration by the import system or standard library. (:gh:`97879`)
pt_br: A definição de :attr:`~module.__cached__` em um módulo enquanto falha na definição de :attr:`__spec__.loader <importlib.machinery.ModuleSpec.cached>` está descontinuado. No Python 3.15, :attr:`!__cached__` deixará de ser definido ou levado em consideração pelo sistema de importação ou pela biblioteca padrão. (:gh:`97879`)

source: Setting :attr:`~module.__package__` on a module while failing to set :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>` is deprecated. In Python 3.15, :attr:`!__package__` will cease to be set or take into consideration by the import system or standard library. (:gh:`97879`)
pt_br: A definição de :attr:`~module.__package__` em um módulo enquanto falha na definição de :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>` está descontinuado. No Python 3.15, :attr:`!__package__` deixará de ser definido ou levado em consideração pelo sistema de importação ou pela biblioteca padrão. (:gh:`97879`)

source: The undocumented :func:`!ctypes.SetPointerType` function has been deprecated since Python 3.13.
pt_br: A função não documentada :func:`!ctypes.SetPointerType` foi descontinuada desde o Python 3.13.

source: The obsolete and rarely used :class:`~http.server.CGIHTTPRequestHandler` has been deprecated since Python 3.13. No direct replacement exists. *Anything* is better than CGI to interface a web server with a request handler.
pt_br: A classe obsoleta e raramente usada :class:`~http.server.CGIHTTPRequestHandler` foi descontinuada desde o Python 3.13. Não existe substituição direta. *Qualquer coisa* é melhor que CGI para fazer a interface de um servidor web com um manipulador de requisição.

source: The :option:`!--cgi` flag to the :program:`python -m http.server` command-line interface has been deprecated since Python 3.13.
pt_br: O sinalizador :option:`!--cgi` para a interface de linha de comando :program:`python -m http.server` foi descontinuado desde o Python 3.13.

source: ``load_module()`` method: use ``exec_module()`` instead.
pt_br: Método ``load_module()``: use ``exec_module()``.

source: The :func:`~locale.getdefaultlocale` function has been deprecated since Python 3.11. Its removal was originally planned for Python 3.13 (:gh:`90817`), but has been postponed to Python 3.15. Use :func:`~locale.getlocale`, :func:`~locale.setlocale`, and :func:`~locale.getencoding` instead. (Contributed by Hugo van Kemenade in :gh:`111187`.)
pt_br: A função :func:`~locale.getdefaultlocale` foi descontinuada desde o Python 3.11. Sua remoção foi planejada originalmente para o Python 3.13 (:gh:`90817`), mas foi adiada para o Python 3.15. Em vez disso, use :func:`~locale.getlocale`, :func:`~locale.setlocale` e :func:`~locale.getencoding`. (Contribuição de Hugo van Kemenade em :gh:`111187`.)

source: :meth:`.PurePath.is_reserved` has been deprecated since Python 3.13. Use :func:`os.path.isreserved` to detect reserved paths on Windows.
pt_br: :meth:`.PurePath.is_reserved` foi descontinuado desde o Python 3.13. Use :func:`os.path.isreserved` para detectar caminhos reservados no Windows.

source: :func:`~platform.java_ver` has been deprecated since Python 3.13. This function is only useful for Jython support, has a confusing API, and is largely untested.
pt_br: :func:`~platform.java_ver` foi descontinuada desde o Python 3.13. Esta função é útil apenas para suporte Jython, tem uma API confusa e é amplamente não testada.

source: The *check_home* argument of :func:`sysconfig.is_python_build` has been deprecated since Python 3.12.
pt_br: O argumento *check_home* de :func:`sysconfig.is_python_build` foi descontinuado desde o Python 3.12.

source: :func:`~threading.RLock` will take no arguments in Python 3.15. Passing any arguments has been deprecated since Python 3.14, as the Python version does not permit any arguments, but the C version allows any number of positional or keyword arguments, ignoring every argument.
pt_br: :func:`~threading.RLock` não aceitará argumentos no Python 3.15. A passagem quaisquer argumentos foi descontinuada desde o Python 3.14, pois a versão Python não permite nenhum argumento, mas a versão C permite qualquer número de argumentos posicionais ou nomeados, ignorando todos os argumentos.

source: :class:`types.CodeType`: Accessing :attr:`~codeobject.co_lnotab` was deprecated in :pep:`626` since 3.10 and was planned to be removed in 3.12, but it only got a proper :exc:`DeprecationWarning` in 3.12. May be removed in 3.15. (Contributed by Nikita Sobolev in :gh:`101866`.)
pt_br: :class:`types.CodeType`: o acesso a :attr:`~codeobject.co_lnotab` foi descontinuado na :pep:`626` desde 3.10 e foi planejado para ser removido em 3.12, mas só recebeu uma :exc:`DeprecationWarning` adequada em 3.12. Pode ser removido em 3.15. (Contribuição de Nikita Sobolev em :gh:`101866`.)

source: The undocumented keyword argument syntax for creating :class:`~typing.NamedTuple` classes (for example, ``Point = NamedTuple("Point", x=int, y=int)``) has been deprecated since Python 3.13. Use the class-based syntax or the functional syntax instead.
pt_br: A não-documentada sintaxe de argumento nomeado para criar classes :class:`~typing.NamedTuple` (por exemplo, ``Point = NamedTuple("Point", x=int, y=int)``) foi descontinuada desde o Python 3.13. Em vez disso, use as sintaxes baseada em classe ou funcional.

source: When using the functional syntax of :class:`~typing.TypedDict`\s, failing to pass a value to the *fields* parameter (``TD = TypedDict("TD")``) or passing ``None`` (``TD = TypedDict("TD", None)``) has been deprecated since Python 3.13. Use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})`` to create a TypedDict with zero field.
pt_br: Ao usar a sintaxe funcional de :class:`~typing.TypedDict`\s, não passar um valor para o parâmetro *fields* (``TD = TypedDict("TD")``) ou passar ``None`` (``TD = TypedDict("TD", None)``) foi está descontinuado desde o Python 3.13. Use ``class TD(TypedDict): pass`` ou ``TD = TypedDict("TD", {})`` para criar uma classe TypedDict com nenhum campo.

source: The :func:`typing.no_type_check_decorator` decorator function has been deprecated since Python 3.13. After eight years in the :mod:`typing` module, it has yet to be supported by any major type checker.
pt_br: A função decoradora :func:`typing.no_type_check_decorator` foi descontinuada desde o Python 3.13. Após oito anos no módulo :mod:`typing`, ela ainda não foi suportada por nenhum verificador de tipo importante.

source: The :meth:`~wave.Wave_read.getmark`, :meth:`!setmark`, and :meth:`~wave.Wave_read.getmarkers` methods of the :class:`~wave.Wave_read` and :class:`~wave.Wave_write` classes have been deprecated since Python 3.13.
pt_br: Os métodos :meth:`~wave.Wave_read.getmark`, :meth:`!setmark` e :meth:`~wave.Wave_read.getmarkers` das classes :class:`~wave.Wave_read` e :class:`~wave.Wave_write` foram descontinuados desde o Python 3.13.

source: :meth:`~zipimport.zipimporter.load_module` has been deprecated since Python 3.10. Use :meth:`~zipimport.zipimporter.exec_module` instead. (Contributed by Jiahao Li in :gh:`125746`.)
pt_br: :meth:`~zipimport.zipimporter.load_module` está descontinuado desde o Python 3.10. Em vez disso, use :meth:`~zipimport.zipimporter.exec_module`. (Contribuição de Jiahao Li em :gh:`125746`.)

source: Pending removal in Python 3.16
pt_br: Remoção pendente no Python 3.16

source: Setting :attr:`~module.__loader__` on a module while failing to set :attr:`__spec__.loader <importlib.machinery.ModuleSpec.loader>` is deprecated. In Python 3.16, :attr:`!__loader__` will cease to be set or taken into consideration by the import system or the standard library.
pt_br: A definição de :attr:`~module.__loader__` em um módulo enquanto falha na definição de :attr:`__spec__.loader <importlib.machinery.ModuleSpec.loader>` está descontinuado. No Python 3.16, :attr:`!__loader__` deixará de ser definido ou levado em consideração pelo sistema de importação ou pela biblioteca padrão.

source: The ``'u'`` format code (:c:type:`wchar_t`) has been deprecated in documentation since Python 3.3 and at runtime since Python 3.13. Use the ``'w'`` format code (:c:type:`Py_UCS4`) for Unicode characters instead.
pt_br: O código de formato ``'u'`` (:c:type:`wchar_t`) foi descontinuado na documentação desde o Python 3.3 e do ambiente de execução desde o Python 3.13. Em vez disso, use o código de formato ``'w'`` (:c:type:`Py_UCS4`) para caracteres Unicode.

source: :func:`!asyncio.iscoroutinefunction` is deprecated and will be removed in Python 3.16; use :func:`inspect.iscoroutinefunction` instead. (Contributed by Jiahao Li and Kumar Aditya in :gh:`122875`.)
pt_br: :func:`!asyncio.iscoroutinefunction` foi descontinuado e será removido no Python 3.16, use :func:`inspect.iscoroutinefunction` em vez disso. (Contribuição de Jiahao Li e Kumar Aditya em :gh:`122875`.)

source: :mod:`asyncio` policy system is deprecated and will be removed in Python 3.16. In particular, the following classes and functions are deprecated:
pt_br: O sistema de políticas :mod:`asyncio` está descontinuado e será removido no Python 3.16. Em particular, as seguintes classes e funções estão descontinuadas:

source: Users should use :func:`asyncio.run` or :class:`asyncio.Runner` with *loop_factory* to use the desired event loop implementation.
pt_br: Os usuários devem usar :func:`asyncio.run` ou :class:`asyncio.Runner` com *loop_factory* para usar a implementação de loop de eventos desejada.

source: For example, to use :class:`asyncio.SelectorEventLoop` on Windows::
pt_br: por exemplo, para usar :class:`asyncio.SelectorEventLoop` no Windows::

source: (Contributed by Kumar Aditya in :gh:`127949`.)
pt_br: (Contribuição de Kumar Aditya em :gh:`127949`.)

source: Bitwise inversion on boolean types, ``~True`` or ``~False`` has been deprecated since Python 3.12, as it produces surprising and unintuitive results (``-2`` and ``-1``). Use ``not x`` instead for the logical negation of a Boolean. In the rare case that you need the bitwise inversion of the underlying integer, convert to ``int`` explicitly (``~int(x)``).
pt_br: A inversão bit a bit em tipos booleanos, ``~True`` ou ``~False`` foi descontinuada desde o Python 3.12, pois produz resultados surpreendentes e não intuitivos (``-2`` e ``-1``). Em vez disso, use ``not x`` para a negação lógica de um booleano. No caso raro de você precisar da inversão bit a bit do inteiro subjacente, converta para ``int`` explicitamente (``~int(x)``).

source: Calling the Python implementation of :func:`functools.reduce` with *function* or *sequence* as keyword arguments has been deprecated since Python 3.14.
pt_br: A chamada da implementação Python de :func:`functools.reduce` com *function* ou *sequence* como argumentos nomeados foi descontinuada desde o Python 3.14.

source: Support for custom logging handlers with the *strm* argument is deprecated and scheduled for removal in Python 3.16. Define handlers with the *stream* argument instead. (Contributed by Mariusz Felisiak in :gh:`115032`.)
pt_br: O suporte para manipuladores de registro personalizados com o argumento *strm* foi descontinuado e está programado para ser removido no Python 3.16. Em vez disso, defina manipuladores com o argumento *stream*. (Contribuição de Mariusz Felisiak em :gh:`115032`.)

source: Valid extensions start with a '.' or are empty for :meth:`mimetypes.MimeTypes.add_type`. Undotted extensions are deprecated and will raise a :exc:`ValueError` in Python 3.16. (Contributed by Hugo van Kemenade in :gh:`75223`.)
pt_br: Extensões válidas começam com um '.' ou estão vazias para :meth:`mimetypes.MimeTypes.add_type`. Extensões sem ponto estão descontinuadas e levantarão uma exceção :exc:`ValueError` no Python 3.16. (Contribuição de Hugo van Kemenade em :gh:`75223`.)

source: The :class:`!ExecError` exception has been deprecated since Python 3.14. It has not been used by any function in :mod:`!shutil` since Python 3.4, and is now an alias of :exc:`RuntimeError`.
pt_br: A exceção :class:`!ExecError` foi descontinuada desde o Python 3.14. Ela não foi usada por nenhuma função em :mod:`!shutil` desde o Python 3.4, e agora é um alias de :exc:`RuntimeError`.

source: The :meth:`Class.get_methods <symtable.Class.get_methods>` method has been deprecated since Python 3.14.
pt_br: O método :meth:`Class.get_methods <symtable.Class.get_methods>` foi descontinuado desde o Python 3.14.

source: The :func:`~sys._enablelegacywindowsfsencoding` function has been deprecated since Python 3.13. Use the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable instead.
pt_br: A função :func:`~sys._enablelegacywindowsfsencoding` foi descontinuada desde o Python 3.13. Em vez disso, use a variável de ambiente :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.

source: The :func:`!sysconfig.expand_makefile_vars` function has been deprecated since Python 3.14. Use the ``vars`` argument of :func:`sysconfig.get_paths` instead.
pt_br: A função :func:`!sysconfig.expand_makefile_vars` está descontinuada desde o Python 3.14. Em vez disso, use o argumento ``vars`` de :func:`sysconfig.get_paths`.

source: The undocumented and unused :attr:`!TarFile.tarfile` attribute has been deprecated since Python 3.13.
pt_br: O atributo não documentado e não utilizado :attr:`!TarFile.tarfile` foi descontinuado desde o Python 3.13.

source: Pending removal in Python 3.17
pt_br: Remoção pendente no Python 3.17

source: Before Python 3.14, old-style unions were implemented using the private class ``typing._UnionGenericAlias``. This class is no longer needed for the implementation, but it has been retained for backward compatibility, with removal scheduled for Python 3.17. Users should use documented introspection helpers like :func:`typing.get_origin` and :func:`typing.get_args` instead of relying on private implementation details.
pt_br: Antes do Python 3.14, as uniões antigas eram implementadas usando a classe privada ``typing._UnionGenericAlias``. Essa classe não é mais necessária para a implementação, mas foi mantida para compatibilidade com versões anteriores, com remoção prevista para o Python 3.17. Os usuários devem usar auxiliares de introspecção documentados, como :func:`typing.get_origin` e :func:`typing.get_args`, em vez de depender de detalhes de implementação privada.

source: Pending removal in future versions
pt_br: Remoção pendente em versões futuras

source: The following APIs will be removed in the future, although there is currently no date scheduled for their removal.
pt_br: As APIs a seguir serão removidas no futuro, embora atualmente não haja uma data agendada para sua remoção.

source: Nesting argument groups and nesting mutually exclusive groups are deprecated.
pt_br: O aninhamento de grupos de argumentos e o aninhamento de grupos mutuamente exclusivos estão descontinuado.

source: Passing the undocumented keyword argument *prefix_chars* to :meth:`~argparse.ArgumentParser.add_argument_group` is now deprecated.
pt_br: A passagem do argumento nomeado não documentado *prefix_chars* para :meth:`~argparse.ArgumentParser.add_argument_group` agora está descontinuado.

source: The :class:`argparse.FileType` type converter is deprecated.
pt_br: O conversor de tipo :class:`argparse.FileType` está descontinuado.

source: Generators: ``throw(type, exc, tb)`` and ``athrow(type, exc, tb)`` signature is deprecated: use ``throw(exc)`` and ``athrow(exc)`` instead, the single argument signature.
pt_br: Geradores: a assinatura ``throw(type, exc, tb)`` e ``athrow(type, exc, tb)`` está descontinuada: use ``throw(exc)`` e ``athrow(exc)``, a assinatura com um único argumento.
