Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). A syntax warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In a future release it will be changed to a syntax error. (:gh:`87999`)
pt_br: Atualmente Python aceita literais numéricos imediatamente seguidos por palavras reservadas como, por exemplo, ``0in x``, ``1or x``, ``0if 1else 2``. Ele permite expressões confusas e ambíguas como ``[0x1for x in y]`` (que pode ser interpretada como ``[0x1 for x in y]`` ou ``[0x1f or x in y]``). Um aviso de sintaxe é levantado se o literal numérico for imediatamente seguido por uma das palavras reservadas :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in` , :keyword:`is` e :keyword:`or`. Em uma versão futura, será alterado para um erro de sintaxe. (:gh:`87999`)

source: Support for ``__index__()`` and ``__int__()`` method returning non-int type: these methods will be required to return an instance of a strict subclass of :class:`int`.
pt_br: Suporte para métodos ``__index__()`` e ``__int__()`` retornando tipo não-int: esses métodos serão necessários para retornar uma instância de uma subclasse estrita de :class:`int`.

source: Support for ``__float__()`` method returning a strict subclass of :class:`float`: these methods will be required to return an instance of :class:`float`.
pt_br: Suporte para o método ``__float__()`` retornando uma subclasse estrita de :class:`float`: esses métodos serão necessários para retornar uma instância de :class:`float`.

source: Support for ``__complex__()`` method returning a strict subclass of :class:`complex`: these methods will be required to return an instance of :class:`complex`.
pt_br: Suporte para o método ``__complex__()`` retornando uma subclasse estrita de :class:`complex`: esses métodos serão necessários para retornar uma instância de :class:`complex`.

source: Delegation of ``int()`` to ``__trunc__()`` method.
pt_br: Delegação do método ``int()`` para o ``__trunc__()``.

source: Passing a complex number as the *real* or *imag* argument in the :func:`complex` constructor is now deprecated; it should only be passed as a single positional argument. (Contributed by Serhiy Storchaka in :gh:`109218`.)
pt_br: Passar um número complexo como argumento *real* ou *imag* no construtor :func:`complex` agora está descontinuado; deve ser passado apenas como um único argumento posicional. (Contribuição de Serhiy Storchaka em :gh:`109218`.)

source: :mod:`calendar`: ``calendar.January`` and ``calendar.February`` constants are deprecated and replaced by :data:`calendar.JANUARY` and :data:`calendar.FEBRUARY`. (Contributed by Prince Roshan in :gh:`103636`.)
pt_br: :mod:`calendar`: as constantes ``calendar.January`` e ``calendar.February`` foram descontinuadas e substituídas por :data:`calendar.JANUARY` e :data:`calendar.FEBRUARY`. (Contribuição de Prince Roshan em :gh:`103636`.)

source: :mod:`codecs`: use :func:`open` instead of :func:`codecs.open`. (:gh:`133038`)
pt_br: :mod:`codecs`: use :func:`open` em vez de :func:`codecs.open`. (:gh:`133038`)

source: :attr:`codeobject.co_lnotab`: use the :meth:`codeobject.co_lines` method instead.
pt_br: :attr:`codeobject.co_lnotab`: use o método :meth:`codeobject.co_lines`.

source: :mod:`gettext`: Plural value must be an integer.
pt_br: :mod:`gettext`: o valor de plural deve ser um número inteiro.

source: :func:`~importlib.util.cache_from_source` *debug_override* parameter is deprecated: use the *optimization* parameter instead.
pt_br: O parâmetro *debug_override* de :func:`~importlib.util.cache_from_source` foi descontinuado: use o parâmetro *optimization*.

source: ``EntryPoints`` tuple interface.
pt_br: Interface de tupla ``EntryPoints``.

source: Implicit ``None`` on return values.
pt_br: ``None`` implícito nos valores de retorno.

source: :mod:`logging`: the ``warn()`` method has been deprecated since Python 3.3, use :meth:`~logging.warning` instead.
pt_br: :mod:`logging`: o método ``warn()`` foi descontinuado desde o Python 3.3, use :meth:`~logging.warning`.

source: :mod:`mailbox`: Use of StringIO input and text mode is deprecated, use BytesIO and binary mode instead.
pt_br: :mod:`mailbox`: o uso da entrada StringIO e do modo de texto foi descontinuado, use BytesIO e o modo binário.

source: :mod:`os`: Calling :func:`os.register_at_fork` in multi-threaded process.
pt_br: :mod:`os`: chamar :func:`os.register_at_fork` em processo multithread.

source: :class:`!pydoc.ErrorDuringImport`: A tuple value for *exc_info* parameter is deprecated, use an exception instance.
pt_br: :class:`!pydoc.ErrorDuringImport`: Um valor de tupla para o parâmetro *exc_info* foi descontinuado, use uma instância de exceção.

source: :mod:`re`: More strict rules are now applied for numerical group references and group names in regular expressions. Only sequence of ASCII digits is now accepted as a numerical reference. The group name in bytes patterns and replacement strings can now only contain ASCII letters and digits and underscore. (Contributed by Serhiy Storchaka in :gh:`91760`.)
pt_br: :mod:`re`: regras mais rigorosas agora são aplicadas para referências numéricas de grupos e nomes de grupos em expressões regulares. Apenas a sequência de dígitos ASCII agora é aceita como referência numérica. O nome do grupo em padrões de bytes e strings de substituição agora pode conter apenas letras e dígitos ASCII e sublinhado. (Contribuição de Serhiy Storchaka em :gh:`91760`.)

source: :mod:`!sre_compile`, :mod:`!sre_constants` and :mod:`!sre_parse` modules.
pt_br: Módulos :mod:`!sre_compile`, :mod:`!sre_constants` e :mod:`!sre_parse`.

source: :mod:`shutil`: :func:`~shutil.rmtree`'s *onerror* parameter is deprecated in Python 3.12; use the *onexc* parameter instead.
pt_br: :mod:`shutil`: o parâmetro *onerror* de :func:`~shutil.rmtree` foi descontinuado no Python 3.12; use o parâmetro *onexc*.

source: :mod:`ssl` options and protocols:
pt_br: Protocolos e opções de :mod:`ssl`

source: :class:`ssl.SSLContext` without protocol argument is deprecated.
pt_br: :class:`ssl.SSLContext` sem argumento de protocolo foi descontinuado.

source: :class:`ssl.SSLContext`: :meth:`~ssl.SSLContext.set_npn_protocols` and :meth:`!selected_npn_protocol` are deprecated: use ALPN instead.
pt_br: :class:`ssl.SSLContext`: :meth:`~ssl.SSLContext.set_npn_protocols` e :meth:`!selected_npn_protocol` foram descontinuados, use ALPN.

source: ``ssl.OP_NO_SSL*`` options
pt_br: Opções de ``ssl.OP_NO_SSL*``

source: ``ssl.OP_NO_TLS*`` options
pt_br: Opções de ``ssl.OP_NO_TLS*``

source: :mod:`threading` methods:
pt_br: Métodos de :mod:`threading`:

source: :meth:`!threading.Thread.isDaemon`, :meth:`threading.Thread.setDaemon`: use :attr:`threading.Thread.daemon` attribute.
pt_br: :meth:`!threading.Thread.isDaemon`, :meth:`threading.Thread.setDaemon`: use o atributo :attr:`threading.Thread.daemon`.

source: :meth:`!threading.Thread.getName`, :meth:`threading.Thread.setName`: use :attr:`threading.Thread.name` attribute.
pt_br: :meth:`!threading.Thread.getName`, :meth:`threading.Thread.setName`: use o atributo :attr:`threading.Thread.name`.

source: The internal class ``typing._UnionGenericAlias`` is no longer used to implement :class:`typing.Union`. To preserve compatibility with users using this private class, a compatibility shim will be provided until at least Python 3.17. (Contributed by Jelle Zijlstra in :gh:`105499`.)
pt_br: A classe interna ``typing._UnionGenericAlias`` não é mais usada para implementar :class:`typing.Union`. Para preservar a compatibilidade com usuários que utilizam esta classe privada, uma correção de compatibilidade será fornecida pelo menos até a versão 3.17 do Python. (Contribuição de Jelle Zijlstra em :gh:`105499`.)

source: :class:`unittest.IsolatedAsyncioTestCase`: it is deprecated to return a value that is not ``None`` from a test case.
pt_br: :class:`unittest.IsolatedAsyncioTestCase`: foi descontinuado retornar um valor que não seja ``None`` de um caso de teste.

source: :mod:`urllib.parse` deprecated functions: :func:`~urllib.parse.urlparse` instead
pt_br: Funções descontinuadas de :mod:`urllib.parse`: use :func:`~urllib.parse.urlparse`

source: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` should not do partial writes.
pt_br: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` não deve fazer gravações parciais.

source: :mod:`xml.etree.ElementTree`: Testing the truth value of an :class:`~xml.etree.ElementTree.Element` is deprecated. In a future release it will always return ``True``. Prefer explicit ``len(elem)`` or ``elem is not None`` tests instead.
pt_br: :mod:`xml.etree.ElementTree`: testar o valor verdade de um :class:`~xml.etree.ElementTree.Element` está descontinuado. Em um lançamento futuro isso sempre retornará ``True``. Em vez disso, prefira os testes explícitos ``len(elem)`` ou ``elem is not None``.

source: :func:`sys._clear_type_cache` is deprecated: use :func:`sys._clear_internal_caches` instead.
pt_br: :func:`sys._clear_type_cache` está descontinuada: use :func:`sys._clear_internal_caches`.

source: CPython Bytecode Changes
pt_br: Alterações de bytecode do CPython

source: The oparg of :opcode:`YIELD_VALUE` is now ``1`` if the yield is part of a yield-from or await, and ``0`` otherwise. The oparg of :opcode:`RESUME` was changed to add a bit indicating if the except-depth is 1, which is needed to optimize closing of generators. (Contributed by Irit Katriel in :gh:`111354`.)
pt_br: O oparg de :opcode:`YIELD_VALUE` agora é ``1`` se o yield fizer parte de um yield-from ou um await, e ``0`` caso contrário. O oparg de :opcode:`RESUME` foi alterado para adicionar um bit indicando se a profundidade de exceção é 1, o que é necessário para otimizar o fechamento dos geradores. (Contribuição de Irit Katriel em :gh:`111354`.)

source: C API Changes
pt_br: Alterações na API C

source: Add the :ref:`PyMonitoring C API <c-api-monitoring>` for generating :pep:`669` monitoring events:
pt_br: Adiciona a :ref:`API C PyMonitoring C <c-api-monitoring>` para gerar eventos de monitoramento da :pep:`669`:

source: (Contributed by Irit Katriel in :gh:`111997`).
pt_br: (Contribuição de Irit Katriel em :gh:`111997`).

source: Add :c:type:`PyMutex`, a lightweight mutex that occupies a single byte, and the new :c:func:`PyMutex_Lock` and :c:func:`PyMutex_Unlock` functions. :c:func:`!PyMutex_Lock` will release the :term:`GIL` (if currently held) if the operation needs to block. (Contributed by Sam Gross in :gh:`108724`.)
pt_br: Adiciona :c:type:`PyMutex`, um mutex leve que ocupa um único byte, e as novas funções :c:func:`PyMutex_Lock` e :c:func:`PyMutex_Unlock`. :c:func:`!PyMutex_Lock` irá liberar a :term:`GIL` (se atualmente mantida) se a operação precisar de bloqueio. (Contribuição de Sam Gross em :gh:`108724`.)

source: Add the :ref:`PyTime C API <c-api-time>` to provide access to system clocks:
pt_br: Adiciona a :doc:`API C PyTime </c-api/time>`, fornecendo acesso aos relógios do sistema.

source: :c:var:`PyTime_MIN` and :c:var:`PyTime_MAX`.
pt_br: :c:var:`PyTime_MIN` e :c:var:`PyTime_MAX`.

source: (Contributed by Victor Stinner and Petr Viktorin in :gh:`110850`.)
pt_br: (Contribuição de Victor Stinner e Petr Viktorin em :gh:`110850`.)

source: Add the :c:func:`PyDict_ContainsString` function with the same behavior as :c:func:`PyDict_Contains`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`. (Contributed by Victor Stinner in :gh:`108314`.)
pt_br: Adiciona a função :c:func:`PyDict_ContainsString` com o mesmo comportamento de :c:func:`PyDict_Contains`, mas *key* é especificada como uma string de bytes :c:expr:`const char*` codificada em UTF-8, em vez de um :c:expr:`PyObject*`. (Contribuição de Victor Stinner em :gh:`108314`.)

source: Add the :c:func:`PyDict_GetItemRef` and :c:func:`PyDict_GetItemStringRef` functions, which behave similarly to :c:func:`PyDict_GetItemWithError`, but return a :term:`strong reference` instead of a :term:`borrowed reference`. Moreover, these functions return ``-1`` on error, removing the need to check :c:func:`!PyErr_Occurred`. (Contributed by Victor Stinner in :gh:`106004`.)
pt_br: Adiciona as funções :c:func:`PyDict_GetItemRef` e :c:func:`PyDict_GetItemStringRef` functions, que são semelhantes a :c:func:`PyDict_GetItemWithError`, mas retornam uma :term:`referência forte` em vez de uma :term:`referência emprestada`. Além disso, essas funções retornam ``-1`` em caso de erro, dispensando a necessidade de checar :c:func:`!PyErr_Occurred`. (Contribuição de Victor Stinner em :gh:`106004`.)

source: Add the :c:func:`PyDict_SetDefaultRef` function, which behaves similarly to :c:func:`PyDict_SetDefault`, but returns a :term:`strong reference` instead of a :term:`borrowed reference`. This function returns ``-1`` on error, ``0`` on insertion, and ``1`` if the key was already present in the dictionary. (Contributed by Sam Gross in :gh:`112066`.)
pt_br: Adiciona a função :c:func:`PyDict_SetDefaultRef`, que é semelhante a :c:func:`PyDict_SetDefault`, mas retorna uma :term:`referência forte` em vez de uma :term:`referência emprestada`. Esta função retorna ``-1`` em caso de erro, ``0`` na inserção e ``1`` se a chave já estivesse presente no dicionário. (Contribuição de Sam Gross em :gh:`112066`.)

source: Add the :c:func:`PyDict_Pop` and :c:func:`PyDict_PopString` functions to remove a key from a dictionary and optionally return the removed value. This is similar to :meth:`dict.pop`, though there is no default value, and :exc:`KeyError` is not raised for missing keys. (Contributed by Stefan Behnel and Victor Stinner in :gh:`111262`.)
pt_br: Adiciona as funções :c:func:`PyDict_Pop` e :c:func:`PyDict_PopString` para remover uma chave de um dicionário e, opcionalmente, retornam o valor removido. Isto é semelhante a :meth:`dict.pop`, mas sem o valor padrão e sem levantar :exc:`KeyError` se a chave estiver ausente. (Contribuição de Stefan Behnel e Victor Stinner em :gh:`111262`.)

source: Add the :c:func:`PyMapping_GetOptionalItem` and :c:func:`PyMapping_GetOptionalItemString` functions as alternatives to :c:func:`PyObject_GetItem` and :c:func:`PyMapping_GetItemString` respectively. The new functions do not raise :exc:`KeyError` if the requested key is missing from the mapping. These variants are more convenient and faster if a missing key should not be treated as a failure. (Contributed by Serhiy Storchaka in :gh:`106307`.)
pt_br: Adiciona as funções :c:func:`PyMapping_GetOptionalItem` e :c:func:`PyMapping_GetOptionalItemString` como alternativas a :c:func:`PyObject_GetAttr` e :c:func:`PyObject_GetAttrString`, respectivamente. As novas funções não levantam :exc:`KeyError` se o atributo não for encontrado no mapeamento. Essas variantes são mais convenientes e rápidas se o atributo ausente não for tratado como uma falha. (Contribuição de Serhiy Storchaka em :gh:`106307`.)

source: Add the :c:func:`PyObject_GetOptionalAttr` and :c:func:`PyObject_GetOptionalAttrString` functions as alternatives to :c:func:`PyObject_GetAttr` and :c:func:`PyObject_GetAttrString` respectively. The new functions do not raise :exc:`AttributeError` if the requested attribute is not found on the object. These variants are more convenient and faster if the missing attribute should not be treated as a failure. (Contributed by Serhiy Storchaka in :gh:`106521`.)
pt_br: Adiciona as funções :c:func:`PyObject_GetOptionalAttr` e :c:func:`PyObject_GetOptionalAttrString`, variantes de :c:func:`PyObject_GetAttr` e :c:func:`PyObject_GetAttrString`, respectivamente. Essas novas funções não levantam :exc:`AttributeError` se o atributo não for encontrado. Essas variantes são mais convenientes e rápidas se o atributo ausente não for tratado como uma falha. (Contribuição de Serhiy Storchaka em :gh:`106521`.)

source: Add the :c:func:`PyErr_FormatUnraisable` function as an extension to :c:func:`PyErr_WriteUnraisable` that allows customizing the warning message. (Contributed by Serhiy Storchaka in :gh:`108082`.)
pt_br: Adiciona a função :c:func:`PyErr_FormatUnraisable` como uma extensão para :c:func:`PyErr_WriteUnraisable`, que permite personalizar a mensagem de aviso. (Contribuição de Serhiy Storchaka em :gh:`108082`.)

source: Add new functions that return a :term:`strong reference` instead of a :term:`borrowed reference` for frame locals, globals, and builtins, as part of :ref:`PEP 667 <whatsnew313-locals-semantics>`:
pt_br: Adiciona novas funções que retornam uma :term:`referência forte` em vez de uma :term:`referência emprestada` para quadros locais, globais, e embutidos, como parte de :ref:`PEP 667 <whatsnew313-locals-semantics>`:

source: :c:func:`PyEval_GetFrameBuiltins` replaces :c:func:`PyEval_GetBuiltins`
pt_br: :c:func:`PyEval_GetFrameBuiltins` substitui :c:func:`PyEval_GetBuiltins`

source: :c:func:`PyEval_GetFrameGlobals` replaces :c:func:`PyEval_GetGlobals`
pt_br: :c:func:`PyEval_GetFrameGlobals` substitui :c:func:`PyEval_GetGlobals`

source: :c:func:`PyEval_GetFrameLocals` replaces :c:func:`PyEval_GetLocals`
pt_br: :c:func:`PyEval_GetFrameLocals` substitui :c:func:`PyEval_GetLocals`

source: (Contributed by Mark Shannon and Tian Gao in :gh:`74929`.)
pt_br: (Contribuição de Mark Shannon e Tian Gao em :gh:`74929`.)

source: Add the :c:func:`Py_GetConstant` and :c:func:`Py_GetConstantBorrowed` functions to get :term:`strong <strong reference>` or :term:`borrowed <borrowed reference>` references to constants. For example, ``Py_GetConstant(Py_CONSTANT_ZERO)`` returns a strong reference to the constant zero. (Contributed by Victor Stinner in :gh:`115754`.)
pt_br: Adiciona as funções :c:func:`Py_GetConstant` e :c:func:`Py_GetConstantBorrowed` para referências :term:`fortes <strong reference>` ou :term:`emprestadas <borrowed reference>` para constantes. Por exemplo, ``Py_GetConstant(Py_CONSTANT_ZERO)`` retorna uma referência forte para a constante zero. (Contribuição de Victor Stinner em :gh:`115754`.)

source: Add the :c:func:`PyImport_AddModuleRef` function as a replacement for :c:func:`PyImport_AddModule` that returns a :term:`strong reference` instead of a :term:`borrowed reference`. (Contributed by Victor Stinner in :gh:`105922`.)
pt_br: Adiciona a função :c:func:`PyImport_AddModuleRef` como uma substituta para :c:func:`PyImport_AddModule` mas retorna uma :term:`referência forte` em vez de uma :term:`referência emprestada`. (Contribuição de Victor Stinner em :gh:`105922`.)

source: Add the :c:func:`Py_IsFinalizing` function to check whether the main Python interpreter is :term:`shutting down <interpreter shutdown>`. (Contributed by Victor Stinner in :gh:`108014`.)
pt_br: Adiciona a função :c:func:`Py_IsFinalizing` para verificar se o interpretador Python principal está :term:`sendo desligado <interpreter shutdown>`. (Contribuição de Victor Stinner em :gh:`108014`.)

source: Add the :c:func:`PyList_GetItemRef` function as a replacement for :c:func:`PyList_GetItem` that returns a :term:`strong reference` instead of a :term:`borrowed reference`. (Contributed by Sam Gross in :gh:`114329`.)
pt_br: Adiciona a função :c:func:`PyList_GetItemRef` como uma substituta para :c:func:`PyList_GetItem` mas que retorna uma :term:`referência forte` em vez de uma :term:`referência emprestada`. (Contribuição de Sam Gross em :gh:`114329`.)

source: Add the :c:func:`PyList_Extend` and :c:func:`PyList_Clear` functions, mirroring the Python :meth:`!list.extend` and :meth:`!list.clear` methods. (Contributed by Victor Stinner in :gh:`111138`.)
pt_br: Adiciona as funções :c:func:`PyList_Extend` e :c:func:`PyList_Clear`, espelhando os métodos :meth:`!list.extend` e :meth:`!list.clear` do Python. (Contribuição de Victor Stinner em :gh:`111138`.)

source: Add the :c:func:`PyLong_AsInt` function. It behaves similarly to :c:func:`PyLong_AsLong`, but stores the result in a C :c:expr:`int` instead of a C :c:expr:`long`. (Contributed by Victor Stinner in :gh:`108014`.)
pt_br: Adiciona a função :c:func:`PyLong_AsInt`, semelhante à :c:func:`PyLong_AsLong`, mas armazena o resultado em um :c:expr:`int` em vez de um :c:expr:`long` em C. (Contribuição de Victor Stinner em :gh:`108014`.)

source: Add the :c:func:`PyLong_AsNativeBytes`, :c:func:`PyLong_FromNativeBytes`, and :c:func:`PyLong_FromUnsignedNativeBytes` functions to simplify converting between native integer types and Python :class:`int` objects. (Contributed by Steve Dower in :gh:`111140`.)
pt_br: Adiciona as funções :c:func:`PyLong_AsNativeBytes`, :c:func:`PyLong_FromNativeBytes` e :c:func:`PyLong_FromUnsignedNativeBytes` para simplificar a conversão entre tipos inteiros nativos e objetos :class:`int` do Python. (Contribuição de Steve Dower em :gh:`111140`.)

source: Add :c:func:`PyModule_Add` function, which is similar to :c:func:`PyModule_AddObjectRef` and :c:func:`PyModule_AddObject`, but always steals a reference to the value. (Contributed by Serhiy Storchaka in :gh:`86493`.)
pt_br: Adiciona a função :c:func:`PyModule_Add`, que é semelhante a :c:func:`PyModule_AddObjectRef` e :c:func:`PyModule_AddObject`, mas sempre rouba uma referência ao valor. (Contribuição de Serhiy Storchaka em :gh:`86493`.)

source: Add the :c:func:`PyObject_GenericHash` function that implements the default hashing function of a Python object. (Contributed by Serhiy Storchaka in :gh:`113024`.)
pt_br: Adiciona a função :c:func:`PyObject_GenericHash` que implementa a função hashing padrão de um objeto Python. (Contribuição de Serhiy Storchaka em :gh:`113024`.)

source: Add the :c:func:`Py_HashPointer` function to hash a raw pointer. (Contributed by Victor Stinner in :gh:`111545`.)
pt_br: Adiciona a função :c:func:`Py_HashPointer` para fazer hash de um ponteiro. (Contribuição de Victor Stinner em :gh:`111545`.)

source: Add the :c:func:`PyObject_VisitManagedDict` and :c:func:`PyObject_ClearManagedDict` functions. which must be called by the traverse and clear functions of a type using the :c:macro:`Py_TPFLAGS_MANAGED_DICT` flag. The `pythoncapi-compat project`_ can be used to use these functions with Python 3.11 and 3.12. (Contributed by Victor Stinner in :gh:`107073`.)
pt_br: Adiciona as funções :c:func:`PyObject_VisitManagedDict` e :c:func:`PyObject_ClearManagedDict` que devem ser chamadas pelas funções traverse e clear de um tipo usando o sinalizador :c:macro:`Py_TPFLAGS_MANAGED_DICT`. O `projeto pythoncapi-compat`_ pode ser usado para obter essas funções no Python 3.11 e 3.12. (Contribuição de Victor Stinner em :gh:`107073`.)

source: Add the :c:func:`PyRefTracer_SetTracer` and :c:func:`PyRefTracer_GetTracer` functions, which enable tracking object creation and destruction in the same way that the :mod:`tracemalloc` module does. (Contributed by Pablo Galindo in :gh:`93502`.)
pt_br: Adiciona as funções :c:func:`PyRefTracer_SetTracer` e :c:func:`PyRefTracer_GetTracer`, que permitem rastrear a criação e destruição de objetos da mesma forma que o módulo :mod:`tracemalloc`. (Contribuição de Pablo Galindo em :gh:`93502`.)

source: Add the :c:func:`PySys_AuditTuple` function as an alternative to :c:func:`PySys_Audit` that takes event arguments as a Python :class:`tuple` object. (Contributed by Victor Stinner in :gh:`85283`.)
pt_br: Adiciona a função :c:func:`PySys_AuditTuple` como uma alternativa à :c:func:`PySys_Audit`, que recebe argumentos de evento como um objeto :class:`tuple` do Python. (Contribuição de Victor Stinner em :gh:`85283`.)
