Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: C-API extension modules need to be built specifically for the free-threaded build. Extensions that support running with the :term:`GIL` disabled should use the :c:data:`Py_mod_gil` slot. Extensions using single-phase init should use :c:func:`PyUnstable_Module_SetGIL` to indicate whether they support running with the GIL disabled. Importing C extensions that don't use these mechanisms will cause the GIL to be enabled, unless the GIL was explicitly disabled with the :envvar:`PYTHON_GIL` environment variable or the :option:`-X gil=0` option. pip 24.1 or newer is required to install packages with C extensions in the free-threaded build.
pt_br: Os módulos de extensão da API C precisam ser construídos especificamente para a construção com threads livres. Extensões que oferecem suporte à execução com :term:`GIL` desabilitada devem usar o slot :c:data:`Py_mod_gil`. Extensões que usam inicialização monofásica devem usar :c:func:`PyUnstable_Module_SetGIL` para indicar se oferecem suporte à execução com a GIL desabilitada. A importação de extensões C que não usam esses mecanismos fará com que a GIL seja habilitada, a menos que a GIL tenha sido explicitamente desabilitada com a variável de ambiente :envvar:`PYTHON_GIL` ou a opção :option:`-X gil=0`. pip 24.1 ou mais recentes é necessário para instalar pacotes com extensões C na construção de threads livres.

source: This work was made possible thanks to many individuals and organizations, including the large community of contributors to Python and third-party projects to test and enable free-threading support. Notable contributors include: Sam Gross, Ken Jin, Donghee Na, Itamar Oren, Matt Page, Brett Simmers, Dino Viehland, Carl Meyer, Nathan Goldbaum, Ralf Gommers, Lysandros Nikolaou, and many others. Many of these contributors are employed by Meta, which has provided significant engineering resources to support this project.
pt_br: Este trabalho foi possível graças a muitos indivíduos e organizações, incluindo a grande comunidade de colaboradores do Python e projetos de terceiros para testar e habilitar o suporte para threads livres. Colaboradores notáveis incluem: Sam Gross, Ken Jin, Donghee Na, Itamar Oren, Matt Page, Brett Simmers, Dino Viehland, Carl Meyer, Nathan Goldbaum, Ralf Gommers, Lysandros Nikolaou e muitos outros. Muitos desses colaboradores são empregados pela Meta, que forneceu recursos de engenharia significativos para dar suporte a este projeto.

source: :pep:`703` "Making the Global Interpreter Lock Optional in CPython" contains rationale and information surrounding this work.
pt_br: :pep:`703` "Tornando a trava global do interpretador opcional no CPython" contém justificativa e informações sobre este trabalho.

source: `Porting Extension Modules to Support Free-Threading <https://py-free-threading.github.io/porting/>`_: A community-maintained porting guide for extension authors.
pt_br: `Portando módulos de extensão para oferecer suporte a threads livres <https://py-free-threading.github.io/porting/>`_: um guia de portabilidade mantido pela comunidade para autores de extensões.

source: An experimental just-in-time (JIT) compiler
pt_br: Um compilador just-in-time (JIT) experimental

source: When CPython is configured and built using the :option:`!--enable-experimental-jit` option, a just-in-time (JIT) compiler is added which may speed up some Python programs. On Windows, use ``PCbuild/build.bat --experimental-jit`` to enable the JIT or ``--experimental-jit-interpreter`` to enable the Tier 2 interpreter. Build requirements and further supporting information `are contained at`__ :file:`Tools/jit/README.md`.
pt_br: Quando o CPython é configurado e construído usando a opção :option:`!--enable-experimental-jit`, um compilador just-in-time (JIT) é adicionado, o que pode acelerar alguns programas Python. No Windows, use ``PCbuild/build.bat --experimental-jit`` para habilitar o JIT ou ``--experimental-jit-interpreter`` para habilitar o interpretador Tier 2. Os requisitos de construção e outras informações de suporte `estão contidos em`__ :file:`Tools/jit/README.md`.

source: The :option:`!--enable-experimental-jit` option takes these (optional) values, defaulting to ``yes`` if :option:`!--enable-experimental-jit` is present without the optional value.
pt_br: A opção :option:`!--enable-experimental-jit` aceita esses valores (opcionais), assumindo como padrão ``yes`` se :option:`!--enable-experimental-jit` estiver presente sem o valor opcional.

source: ``no``: Disable the entire Tier 2 and JIT pipeline.
pt_br: ``no``: desativa todo o pipeline de Tier 2 e JIT.

source: ``yes``: Enable the JIT. To disable the JIT at runtime, pass the environment variable ``PYTHON_JIT=0``.
pt_br: ``yes``: habilita o JIT. Para desabilitar o JIT em tempo de execução, passe a variável de ambiente ``PYTHON_JIT=0``.

source: ``yes-off``: Build the JIT but disable it by default. To enable the JIT at runtime, pass the environment variable ``PYTHON_JIT=1``.
pt_br: ``yes-off``: constrói o JIT, mas desabilita-o por padrão. Para habilitar o JIT em tempo de execução, passe a variável de ambiente ``PYTHON_JIT=1``.

source: ``interpreter``: Enable the Tier 2 interpreter but disable the JIT. The interpreter can be disabled by running with ``PYTHON_JIT=0``.
pt_br: ``interpreter``: habilita o interpretador Tier 2, mas desabilita o JIT. O interpretador pode ser desabilitado executando com ``PYTHON_JIT=0``.

source: The internal architecture is roughly as follows:
pt_br: A arquitetura interna é aproximadamente a seguinte:

source: We start with specialized *Tier 1 bytecode*. See :ref:`What's new in 3.11 <whatsnew311-pep659>` for details.
pt_br: Começamos com especializado *bytecode de Tier 1*. Veja :ref:`O que há de novo no 3.11 <whatsnew311-pep659>` para detalhes.

source: When the Tier 1 bytecode gets hot enough, it gets translated to a new purely internal intermediate representation (IR), called the *Tier 2 IR*, and sometimes referred to as micro-ops ("uops").
pt_br: Quando o bytecode Tier 1 fica quente o suficiente, ele é traduzido para uma nova representação intermediária (IR) puramente interna, também chamado de *IR Tier 2*, e às vezes chamada de micro-ops ("uops").

source: The Tier 2 IR uses the same stack-based virtual machine as Tier 1, but the instruction format is better suited to translation to machine code.
pt_br: O IR Tier 2 usa a mesma máquina virtual baseada em pilha que o Tier 1, mas o formato de instrução é mais adequado para tradução em código de máquina.

source: We have several optimization passes for Tier 2 IR, which are applied before it is interpreted or translated to machine code.
pt_br: Temos vários passes de otimização para IR Tier 2, que são aplicados antes de serem interpretados ou traduzidos em código de máquina.

source: There is a Tier 2 interpreter, but it is mostly intended for debugging the earlier stages of the optimization pipeline. The Tier 2 interpreter can be enabled by configuring Python with ``--enable-experimental-jit=interpreter``.
pt_br: Existe um interpretador de Tier 2, mas ele se destina principalmente à depuração dos estágios iniciais do pipeline de otimização. O interpretador Tier 2 pode ser habilitado configurando o Python com ``--enable-experimental-jit=interpreter``.

source: When the JIT is enabled, the optimized Tier 2 IR is translated to machine code, which is then executed.
pt_br: Quando o JIT está habilitado, o IR Tier 2 otimizado é traduzido em código de máquina, que é então executado.

source: The machine code translation process uses a technique called *copy-and-patch*. It has no runtime dependencies, but there is a new build-time dependency on LLVM.
pt_br: O processo de tradução de código de máquina usa uma técnica chamada *copiar e corrigir*. Não possui dependências de tempo de execução, mas há uma nova dependência de tempo de construção no LLVM.

source: (JIT by Brandt Bucher, inspired by a paper by Haoran Xu and Fredrik Kjolstad. Tier 2 IR by Mark Shannon and Guido van Rossum. Tier 2 optimizer by Ken Jin.)
pt_br: (JIT de Brandt Bucher, inspirado em um artigo de Haoran Xu e Fredrik Kjolstad. Tier 2 IR de Mark Shannon e Guido van Rossum. Otimizador Tier 2 de Ken Jin.)

source: Defined mutation semantics for :py:func:`locals`
pt_br: Definidas semânticas de mutação para :py:func:`locals`

source: Historically, the expected result of mutating the return value of :func:`locals` has been left to individual Python implementations to define. Starting from Python 3.13, :pep:`667` standardises the historical behavior of CPython for most code execution scopes, but changes :term:`optimized scopes <optimized scope>` (functions, generators, coroutines, comprehensions, and generator expressions) to explicitly return independent snapshots of the currently assigned local variables, including locally referenced nonlocal variables captured in closures.
pt_br: Historicamente, o resultado esperado da mutação do valor de retorno de :func:`locals` foi deixada para as implementações individuais de Python definirem. A partir do Python 3.13, :pep:`667` padroniza o comportamento histórico do CPython para a maioria dos escopos de execução de código, mas altera :term:`escopos otimizados <optimized scope>` (funções, geradores, corrotinas, compreensões e expressões geradoras) para retornar explicitamente instantâneos independentes das variáveis locais atualmente atribuídas, incluindo variáveis não locais referenciadas localmente capturadas em encerramentos.

source: This change to the semantics of :func:`locals` in optimized scopes also affects the default behavior of code execution functions that implicitly target :func:`!locals` if no explicit namespace is provided (such as :func:`exec` and :func:`eval`). In previous versions, whether or not changes could be accessed by calling :func:`!locals` after calling the code execution function was implementation-dependent. In CPython specifically, such code would typically appear to work as desired, but could sometimes fail in optimized scopes based on other code (including debuggers and code execution tracing tools) potentially resetting the shared snapshot in that scope. Now, the code will always run against an independent snapshot of the local variables in optimized scopes, and hence the changes will never be visible in subsequent calls to :func:`!locals`. To access the changes made in these cases, an explicit namespace reference must now be passed to the relevant function. Alternatively, it may make sense to update affected code to use a higher level code execution API that returns the resulting code execution namespace (e.g. :func:`runpy.run_path` when executing Python files from disk).
pt_br: Esta mudança na semântica de :func:`locals` em escopos otimizados também afeta o comportamento padrão das funções de execução de código que visam implicitamente :func:`!locals` se nenhum espaço de nomes explícito for fornecido (como :func:`exec` e :func:`eval`). Nas versões anteriores, se as alterações podiam ou não ser acessadas chamando :func:`!locals` após chamar a função de execução de código dependia da implementação. Especificamente no CPython, esse código normalmente parece funcionar conforme desejado, mas às vezes pode falhar em escopos otimizados com base em outro código (incluindo depuradores e ferramentas de rastreamento de execução de código), redefinindo potencialmente o instantâneo compartilhado nesse escopo. Agora, o código sempre será executado em um instantâneo independente das variáveis locais em escopos otimizados e, portanto, as alterações nunca serão visíveis em chamadas subsequentes para :func:`!locals`. Para acessar as alterações feitas nesses casos, uma referência explícita de espaço de nomes deve agora ser passada para a função relevante. Alternativamente, pode fazer sentido atualizar o código afetado para usar uma API de execução de código de nível mais alto que retorne o espaço de nomes de execução de código resultante (por exemplo, :func:`runpy.run_path` ao executar arquivos Python do disco).

source: To ensure debuggers and similar tools can reliably update local variables in scopes affected by this change, :attr:`FrameType.f_locals <frame.f_locals>` now returns a write-through proxy to the frame's local and locally referenced nonlocal variables in these scopes, rather than returning an inconsistently updated shared ``dict`` instance with undefined runtime semantics.
pt_br: Para garantir que depuradores e ferramentas semelhantes possam atualizar de forma confiável variáveis locais em escopos afetados por esta mudança, :attr:`FrameType.f_locals <frame.f_locals>` agora retorna um proxy write-through para as variáveis locais e não locais referenciadas localmente do quadro nesses escopos, em vez de retornar uma instância ``dict`` compartilhada atualizada inconsistentemente com semântica de tempo de execução indefinida.

source: See :pep:`667` for more details, including related C API changes and deprecations. Porting notes are also provided below for the affected :ref:`Python APIs <pep667-porting-notes-py>` and :ref:`C APIs <pep667-porting-notes-c>`.
pt_br: Veja :pep:`667` para mais detalhes, incluindo alterações e descontinuações relacionadas à API C. Notas de portabilidade também são fornecidas abaixo para as :ref:`APIs de Python <pep667-porting-notes-py>` e as :ref:`APIs de C <pep667-porting-notes-c>` afetadas.

source: (PEP and implementation contributed by Mark Shannon and Tian Gao in :gh:`74929`. Documentation updates provided by Guido van Rossum and Alyssa Coghlan.)
pt_br: (PEP e implementação são contribuição de Mark Shannon e Tian Gao em :gh:`74929`. Atualizações da documentação fornecidas por Guido van Rossum e Alyssa Coghlan.)

source: Support for mobile platforms
pt_br: Suporte para plataformas móveis

source: :pep:`730`: iOS is now a :pep:`11` supported platform, with the ``arm64-apple-ios`` and ``arm64-apple-ios-simulator`` targets at tier 3 (iPhone and iPad devices released after 2013 and the Xcode iOS simulator running on Apple silicon hardware, respectively). ``x86_64-apple-ios-simulator`` (the Xcode iOS simulator running on older ``x86_64`` hardware) is not a tier 3 supported platform, but will have best-effort support. (PEP written and implementation contributed by Russell Keith-Magee in :gh:`114099`.)
pt_br: :pep:`730`: iOS agora é uma plataforma com suporte conforme a :pep:`11`, com os alvos ``arm64-apple-ios`` e ``arm64-apple-ios-simulator`` no nível 3 (dispositivos iPhone e iPad lançados após 2013 e o simulador Xcode iOS sendo executado em hardware Apple Silicon, respectivamente). ``x86_64-apple-ios-simulator`` (o simulador Xcode iOS sendo executado em hardware ``x86_64`` mais antigo) não é uma plataforma com suporte nível 3, mas terá o melhor suporte possível. (PEP escrita e implementação como contribuição de Russell Keith-Magee em :gh:`114099`.)

source: :pep:`738`: Android is now a :pep:`11` supported platform, with the ``aarch64-linux-android`` and ``x86_64-linux-android`` targets at tier 3. The 32-bit targets ``arm-linux-androideabi`` and ``i686-linux-android`` are not tier 3 supported platforms, but will have best-effort support. (PEP written and implementation contributed by Malcolm Smith in :gh:`116622`.)
pt_br: :pep:`738`: Android agora é uma plataforma com suporte conforme a :pep:`11`, com os alvos ``aarch64-linux-android`` e ``x86_64-linux-android`` no nível 3. Os alvos de 32 bits ``arm-linux-androideabi`` e ``i686-linux-android`` não são plataformas com suporte de nível 3, mas terão o melhor suporte possível. (PEP escrita e implementação como contribuição de Malcolm Smith em :gh:`116622`.)

source: Other Language Changes
pt_br: Outras mudanças na linguagem

source: The compiler now strips common leading whitespace from every line in a docstring. This reduces the size of the :term:`bytecode cache <bytecode>` (such as ``.pyc`` files), with reductions in file size of around 5%, for example in :mod:`!sqlalchemy.orm.session` from SQLAlchemy 2.0. This change affects tools that use docstrings, such as :mod:`doctest`.
pt_br: O compilador agora remove espaços em branco comuns de cada linha em uma docstring. Isso reduz o tamanho do :term:`cache de bytecode <bytecode>` (como arquivos ``.pyc``), com reduções no tamanho do arquivo de cerca de 5%, por exemplo, em :mod:`!sqlalchemy.orm.session` do SQLAlchemy 2.0. Essa alteração afeta ferramentas que usam docstrings, como :mod:`doctest`.

source: >>> def spam(): ... """ ... This is a docstring with ... leading whitespace. ... ... It even has multiple paragraphs! ... """ ... >>> spam.__doc__ '\nThis is a docstring with\n leading whitespace.\n\nIt even has multiple paragraphs!\n'
pt_br: >>> def spam(): ... """ ... Esta é uma docstring com ... espaços em branco no começo. ... ... Ela atém mesmo tem vários parágrafos! ... """ ... >>> spam.__doc__ '\n\nEsta é uma docstring com\n\n espaços em branco no começo.\n\n\nEla atém mesmo tem vários parágrafos!\n\n'

source: (Contributed by Inada Naoki in :gh:`81283`.)
pt_br: (Contribuição de Inada Naoki em :gh:`81283`.)

source: :ref:`Annotation scopes <annotation-scopes>` within class scopes can now contain lambdas and comprehensions. Comprehensions that are located within class scopes are not inlined into their parent scope.
pt_br: :ref:`Escopos de anotação <annotation-scopes>` dentro dos escopos de classe agora pode conter lambdas e compreensões. As compreensões localizadas nos escopos de classe não são incorporadas ao escopo pai.

source: (Contributed by Jelle Zijlstra in :gh:`109118` and :gh:`118160`.)
pt_br: (Contribuição de Jelle Zijlstra em :gh:`109118` e :gh:`118160`.)

source: :ref:`Future statements <future>` are no longer triggered by relative imports of the :mod:`__future__` module, meaning that statements of the form ``from .__future__ import ...`` are now simply standard relative imports, with no special features activated. (Contributed by Jeremiah Gabriel Pascual in :gh:`118216`.)
pt_br: :ref:`Instruções future <future>` não são mais acionadas por importações relativas do módulo :mod:`__future__`, o que significa que instruções no formato ``from .__future__ import ...`` agora são simplesmente importações relativas padrão, sem recursos especiais ativados. (Contribuição de Jeremiah Gabriel Pascual em :gh:`118216`.)

source: :keyword:`global` declarations are now permitted in :keyword:`except` blocks when that global is used in the :keyword:`else` block. Previously this raised an erroneous :exc:`SyntaxError`. (Contributed by Irit Katriel in :gh:`111123`.)
pt_br: Declarações :keyword:`global` agora são permitidas em blocos :keyword:`except` quando esse global é usado no bloco :keyword:`else`. Anteriormente, isso erroneamente levantava uma exceção :exc:`SyntaxError`. (Contribuição de Irit Katriel em :gh:`111123`.)

source: Add :envvar:`PYTHON_FROZEN_MODULES`, a new environment variable that determines whether frozen modules are ignored by the import machinery, equivalent to the :option:`-X frozen_modules <-X>` command-line option. (Contributed by Yilei Yang in :gh:`111374`.)
pt_br: Adiciona :envvar:`PYTHON_FROZEN_MODULES`, uma nova variável de ambiente que determina se os módulos congelados são ignorados pelo maquinário de importação, equivalente à opção de linha de comando :option:`-X frozen_modules <-X>`. (Contribuição de Yilei Yang em :gh:`111374`.)

source: Add :ref:`support for the perf profiler <perf_profiling>` working without `frame pointers <https://en.wikipedia.org/wiki/Call_stack>`_ through the new environment variable :envvar:`PYTHON_PERF_JIT_SUPPORT` and command-line option :option:`-X perf_jit <-X>`. (Contributed by Pablo Galindo in :gh:`118518`.)
pt_br: Adicionado :ref:`suporte ao perfilador perf <perf_profiling>` funcionando sem `ponteiros de quadro <https://pt.wikipedia.org/wiki/Pilha_de_chamada>`_ através da nova variável de ambiente :envvar:`PYTHON_PERF_JIT_SUPPORT` e opção de linha de comando :option:`-X perf_jit <-X>`. (Contribuição de Pablo Galindo em :gh:`118518`.)

source: The location of a :file:`.python_history` file can be changed via the new :envvar:`PYTHON_HISTORY` environment variable. (Contributed by Levi Sabah, Zackery Spytz and Hugo van Kemenade in :gh:`73965`.)
pt_br: A localização de um arquivo :file:`.python_history` pode ser alterada por meio da nova variável de ambiente :envvar:`PYTHON_HISTORY`. (Contribuição de Levi Sabah, Zackery Spytz e Hugo van Kemenade em :gh:`73965`.)

source: Classes have a new :attr:`~type.__static_attributes__` attribute. This is populated by the compiler with a tuple of the class's attribute names which are assigned through ``self.<name>`` from any function in its body. (Contributed by Irit Katriel in :gh:`115775`.)
pt_br: As classes têm um novo atributo :attr:`~type.__static_attributes__`. Isso é preenchido pelo compilador, com uma tupla de nomes de atributos da classe que são atribuídos através de ``self.<name>`` de qualquer função em seu corpo. (Contribuição de Irit Katriel em :gh:`115775`.)

source: The compiler now creates a :attr:`!__firstlineno__` attribute on classes with the line number of the first line of the class definition. (Contributed by Serhiy Storchaka in :gh:`118465`.)
pt_br: O compilador agora cria um atributo :attr:`!__firstlineno__` em classes com o número da primeira linha da definição de classe. (Contribuição de Serhiy Storchaka em :gh:`118465`.)

source: The :func:`exec` and :func:`eval` builtins now accept the *globals* and *locals* arguments as keywords. (Contributed by Raphael Gaschignard in :gh:`105879`)
pt_br: As funções embutidas :func:`exec` e :func:`eval` agora aceitam os argumentos *globals* e *locals* como nomeados. (Contribuição de Raphael Gaschignard em :gh:`105879`)

source: The :func:`compile` builtin now accepts a new flag, ``ast.PyCF_OPTIMIZED_AST``, which is similar to ``ast.PyCF_ONLY_AST`` except that the returned AST is optimized according to the value of the *optimize* argument. (Contributed by Irit Katriel in :gh:`108113`).
pt_br: A função embutida :func:`compile` agora aceita um novo sinalizador, ``ast.PyCF_OPTIMIZED_AST``, que é semelhante a ``ast.PyCF_ONLY_AST`` exceto que a AST retornada é otimizada de acordo com o valor do argumento *optimize*. (Contribuição de Irit Katriel em :gh:`108113`).

source: Add a :attr:`~property.__name__` attribute on :class:`property` objects. (Contributed by Eugene Toder in :gh:`101860`.)
pt_br: Adiciona um atributo :attr:`~property.__name__` em objetos :class:`property`. (Contribuição de Eugene Toder em :gh:`101860`.)

source: Add :exc:`PythonFinalizationError`, a new exception derived from :exc:`RuntimeError` and used to signal when operations are blocked during :term:`finalization <interpreter shutdown>`. The following callables now raise :exc:`!PythonFinalizationError`, instead of :exc:`RuntimeError`:
pt_br: Adiciona :exc:`PythonFinalizationError`, uma nova exceção derivada de :exc:`RuntimeError` e usada para sinalizar quando as operações são bloqueadas durante a :term:`finalização <interpreter shutdown>`. Os seguintes chamáveis agora levantam :exc:`!PythonFinalizationError`, em vez de :exc:`RuntimeError`:

source: (Contributed by Victor Stinner in :gh:`114570`.)
pt_br: (Contribuição de Victor Stinner em :gh:`114570`.)

source: Allow the *count* argument of :meth:`str.replace` to be a keyword. (Contributed by Hugo van Kemenade in :gh:`106487`.)
pt_br: Permite que o argumento *count* de :meth:`str.replace` seja um argumento nomeado. (Contribuição de Hugo van Kemenade em :gh:`106487`.)
