Repository: python/python-docs-pt-br
Catalog: whatsnew/3.13.po
Languages: pt_br

source: On Windows, :func:`~time.monotonic` now uses the ``QueryPerformanceCounter()`` clock for a resolution of 1 microsecond, instead of the ``GetTickCount64()`` clock which has a resolution of 15.6 milliseconds. (Contributed by Victor Stinner in :gh:`88494`.)
pt_br: No Windows, :func:`~time.monotonic` agora usa o relógio ``QueryPerformanceCounter()`` para uma resolução de 1 microssegundo, em vez do relógio ``GetTickCount64()`` que tem uma resolução de 15.6 milissegundos. (Contribuição de Victor Stinner em :gh:`88494`.)

source: On Windows, :func:`~time.time` now uses the ``GetSystemTimePreciseAsFileTime()`` clock for a resolution of 1 microsecond, instead of the ``GetSystemTimeAsFileTime()`` clock which has a resolution of 15.6 milliseconds. (Contributed by Victor Stinner in :gh:`63207`.)
pt_br: No Windows, :func:`~time.time` agora usa o relógio ``GetSystemTimePreciseAsFileTime()`` para uma resolução de 1 microssegundo, em vez do relógio ``GetSystemTimeAsFileTime()`` que tem uma resolução de 15.6 milissegundos. (Contribuição de Victor Stinner em :gh:`63207`.)

source: Add :mod:`tkinter` widget methods: :meth:`!tk_busy_hold`, :meth:`!tk_busy_configure`, :meth:`!tk_busy_cget`, :meth:`!tk_busy_forget`, :meth:`!tk_busy_current`, and :meth:`!tk_busy_status`. (Contributed by Miguel, klappnase and Serhiy Storchaka in :gh:`72684`.)
pt_br: Adiciona métodos de widget :mod:`tkinter`: :meth:`!tk_busy_hold`, :meth:`!tk_busy_configure`, :meth:`!tk_busy_cget`, :meth:`!tk_busy_forget`, :meth:`!tk_busy_current` e :meth:`!tk_busy_status`. (Contribuição de Miguel, klappnase e Serhiy Storchaka em :gh:`72684`.)

source: The :mod:`tkinter` widget method :meth:`!wm_attributes` now accepts the attribute name without the minus prefix to get window attributes, for example ``w.wm_attributes('alpha')`` and allows specifying attributes and values to set as keyword arguments, for example ``w.wm_attributes(alpha=0.5)``. (Contributed by Serhiy Storchaka in :gh:`43457`.)
pt_br: O método :meth:`!wm_attributes` de widget :mod:`tkinter` agora aceita o nome do atributo sem o prefixo negativo para obter atributos de janela (por exemplo, ``w.wm_attributes('alpha')``) e permite especificar atributos e valores para definir como argumentos nomeados (por exemplo, ``w.wm_attributes(alpha=0.5)``). (Contribuição de Serhiy Storchaka em :gh:`43457`.)

source: :meth:`!wm_attributes` can now return attributes as a :class:`dict`, by using the new optional keyword-only parameter *return_python_dict*. (Contributed by Serhiy Storchaka in :gh:`43457`.)
pt_br: :meth:`!wm_attributes` agora pode retornar atributos como um :class:`dict`, usando o novo parâmetro somente-nomeado opcional *return_python_dict*. (Contribuição de Serhiy Storchaka em :gh:`43457`.)

source: :meth:`!Text.count` can now return a simple :class:`int` when the new optional keyword-only parameter *return_ints* is used. Otherwise, the single count is returned as a 1-tuple or ``None``. (Contributed by Serhiy Storchaka in :gh:`97928`.)
pt_br: :meth:`!Text.count` agora pode retornar um :class:`int` simples quando o novo parâmetro somente-nomeado opcional *return_ints* é usado. Caso contrário, a contagem única é retornada como uma tupla de 1 elemento ou ``None``. (Contribuição de Serhiy Storchaka em :gh:`97928`.)

source: Support the "vsapi" element type in the :meth:`~tkinter.ttk.Style.element_create` method of :class:`tkinter.ttk.Style`. (Contributed by Serhiy Storchaka in :gh:`68166`.)
pt_br: Suporte ao tipo de elemento "vsapi" no método :meth:`~tkinter.ttk.Style.element_create` de :class:`tkinter.ttk.Style`. (Contribuição de Serhiy Storchaka em :gh:`68166`.)

source: Add the :meth:`!after_info` method for Tkinter widgets. (Contributed by Cheryl Sabella in :gh:`77020`.)
pt_br: Adiciona o método :meth:`!after_info` para widgets do Tkinter. (Contribuição de Cheryl Sabella em :gh:`77020`.)

source: Add a new :meth:`!copy_replace` method to :class:`!PhotoImage` to copy a region from one image to another, possibly with pixel zooming, subsampling, or both. (Contributed by Serhiy Storchaka in :gh:`118225`.)
pt_br: Adiciona um novo método :meth:`!copy_replace` a :class:`!PhotoImage` para copiar uma região de uma imagem para outra, possivelmente com zoom de pixel, subamostragem ou ambos. (Contribuição de Serhiy Storchaka em :gh:`118225`.)

source: Add *from_coords* parameter to the :class:`!PhotoImage` methods :meth:`!copy`, :meth:`!zoom` and :meth:`!subsample`. Add *zoom* and *subsample* parameters to the :class:`!PhotoImage` method :meth:`!copy`. (Contributed by Serhiy Storchaka in :gh:`118225`.)
pt_br: Adiciona parâmetro *from_coords* para os métodos :meth:`!copy`, :meth:`!zoom` e :meth:`!subsample` da classe :class:`!PhotoImage`. Adiciona parâmetros *zoom* e *subsample* para o método :meth:`!copy` da classe :class:`!PhotoImage`. (Contribuição de Serhiy Storchaka em :gh:`118225`.)

source: Add the :class:`!PhotoImage` methods :meth:`!read` to read an image from a file and :meth:`!data` to get the image data. Add *background* and *grayscale* parameters to the :meth:`!write` method. (Contributed by Serhiy Storchaka in :gh:`118271`.)
pt_br: Adiciona os métodos :class:`!PhotoImage` :meth:`!read` para ler uma imagem de um arquivo e :meth:`!data` para obter os dados da imagem. Adiciona os parâmetros *background* e *grayscale* ao método :meth:`!write`. (Contribuição de Serhiy Storchaka em :gh:`118271`.)

source: Add the :attr:`~traceback.TracebackException.exc_type_str` attribute to :class:`~traceback.TracebackException`, which holds a string display of the *exc_type*. Deprecate the :attr:`~traceback.TracebackException.exc_type` attribute, which holds the type object itself. Add parameter *save_exc_type* (default ``True``) to indicate whether ``exc_type`` should be saved. (Contributed by Irit Katriel in :gh:`112332`.)
pt_br: Adiciona o atributo :attr:`~traceback.TracebackException.exc_type_str` a :class:`~traceback.TracebackException`, que contém uma exibição de string do *exc_type*. Descontinua o atributo :attr:`~traceback.TracebackException.exc_type`, que contém o próprio objeto de tipo. Adicione o parâmetro *save_exc_type* (padrão ``True``) para indicar se ``exc_type`` deve ser salvo. (Contribuição de Irit Katriel em :gh:`112332`.)

source: Add a new *show_group* keyword-only parameter to :meth:`.TracebackException.format_exception_only` to (recursively) format the nested exceptions of a :exc:`BaseExceptionGroup` instance. (Contributed by Irit Katriel in :gh:`105292`.)
pt_br: Adiciona um novo parâmetro somente-nomeado *show_group* a :meth:`.TracebackException.format_exception_only` para formatar (recursivamente) as exceções aninhadas de uma instância :exc:`BaseExceptionGroup`. (Contribuição de Irit Katriel em :gh:`105292`.)

source: :class:`~types.SimpleNamespace` can now take a single positional argument to initialise the namespace's arguments. This argument must either be a mapping or an iterable of key-value pairs. (Contributed by Serhiy Storchaka in :gh:`108191`.)
pt_br: :class:`~types.SimpleNamespace` agora pode receber um único argumento posicional para inicializar os argumentos do espaço de nomes. Este argumento deve ser um mapeamento ou um iterável de pares chave-valor. (Contribuição de Serhiy Storchaka em :gh:`108191`.)

source: :pep:`705`: Add :data:`~typing.ReadOnly`, a special typing construct to mark a :class:`~typing.TypedDict` item as read-only for type checkers.
pt_br: :pep:`705`: adiciona :data:`~typing.ReadOnly`, uma construção especial de tipagem para marcar um item :class:`~typing.TypedDict` como somente leitura para verificadores de tipo.

source: :pep:`742`: Add :data:`~typing.TypeIs`, a typing construct that can be used to instruct a type checker how to narrow a type.
pt_br: :pep:`742`: adiciona :data:`~typing.TypeIs`, uma construção de tipagem que pode ser usada para instruir um verificador de tipos sobre como restringir um tipo.

source: Add :data:`~typing.NoDefault`, a sentinel object used to represent the defaults of some parameters in the :mod:`typing` module. (Contributed by Jelle Zijlstra in :gh:`116126`.)
pt_br: Adiciona :data:`~typing.NoDefault`, um objeto sinalizador usado para representar os padrões de alguns parâmetros no módulo :mod:`typing`. (Contribuição de Jelle Zijlstra em :gh:`116126`.)

source: Add :func:`~typing.get_protocol_members` to return the set of members defining a :class:`typing.Protocol`. (Contributed by Jelle Zijlstra in :gh:`104873`.)
pt_br: Adicione :func:`~typing.get_protocol_members` para retornar o conjunto de membros que definem uma :class:`typing.Protocol`. (Contribuição de Jelle Zijlstra em :gh:`104873`.)

source: Add :func:`~typing.is_protocol` to check whether a class is a :class:`~typing.Protocol`. (Contributed by Jelle Zijlstra in :gh:`104873`.)
pt_br: Adiciona :func:`~typing.is_protocol` para verificar se uma classe é uma :class:`~typing.Protocol`. (Contribuição de Jelle Zijlstra em :gh:`104873`.)

source: :data:`~typing.ClassVar` can now be nested in :data:`~typing.Final`, and vice versa. (Contributed by Mehdi Drissi in :gh:`89547`.)
pt_br: :data:`~typing.ClassVar` agora pode ser aninhado em :data:`~typing.Final`, e vice-versa. (Contribuição de Mehdi Drissi em :gh:`89547`.)

source: Update the Unicode database to `version 15.1.0`__. (Contributed by James Gerity in :gh:`109559`.)
pt_br: Atualiza o banco de dados Unicode para a `versão 15.1.0`__. (Contribuição de James Gerity em :gh:`109559`.)

source: Add support for creating source control management (SCM) ignore files in a virtual environment's directory. By default, Git is supported. This is implemented as opt-in via the API, which can be extended to support other SCMs (:class:`~venv.EnvBuilder` and :func:`~venv.create`), and opt-out via the CLI, using :option:`!--without-scm-ignore-files`. (Contributed by Brett Cannon in :gh:`108125`.)
pt_br: Adiciona suporte para criar arquivos ignorados pelo gerenciamento de controle de fontes (SCM) no diretório de um ambiente virtual. Por padrão, o Git é compatível. Isso está implementado como ativado por padrão por meio da API, que pode ser estendido para oferecer suporte a outros SCMs (:class:`~venv.EnvBuilder` e :func:`~venv.create`) e desativado por padrão por meio da CLI, usando :option:`!--without-scm-ignore-files`. (Contribuição de Brett Cannon em :gh:`108125`.)

source: :pep:`702`: The new :func:`warnings.deprecated` decorator provides a way to communicate deprecations to a :term:`static type checker` and to warn on usage of deprecated classes and functions. A :exc:`DeprecationWarning` may also be emitted when a decorated function or class is used at runtime. (Contributed by Jelle Zijlstra in :gh:`104003`.)
pt_br: :pep:`702`: O novo decorador :func:`warnings.deprecated` fornece uma maneira de comunicar descontinuações para um :term:`verificador de tipo estático` e avisar sobre o uso de classes e funções obsoletas. Um :exc:`DeprecationWarning` também pode ser emitido quando uma função ou classe decorada é usada em tempo de execução. (Contribuição de Jelle Zijlstra em :gh:`104003`.)

source: Allow controlling Expat >=2.6.0 reparse deferral (:cve:`2023-52425`) by adding five new methods:
pt_br: Permite controlar o adiamento da nova análise do Expat >=2.6.0 (:cve:`2023-52425`) adicionando cinco novos métodos:

source: (Contributed by Sebastian Pipping in :gh:`115623`.)
pt_br: (Contribuição de Sebastian Pipping em :gh:`115623`.)

source: Add the :meth:`!close` method for the iterator returned by :func:`~xml.etree.ElementTree.iterparse` for explicit cleanup. (Contributed by Serhiy Storchaka in :gh:`69893`.)
pt_br: Adiciona o método :meth:`!close` para o iterador retornado por :func:`~xml.etree.ElementTree.iterparse` para limpeza explícita. (Contribuição de Serhiy Storchaka em :gh:`69893`.)

source: Add support for ZIP64_ format files. Everybody loves huge data, right? (Contributed by Tim Hatch in :gh:`94146`.)
pt_br: Adiciona suporte para arquivos no formato ZIP64_. Todo mundo adora dados enormes, certo? (Contribuição de Tim Hatch em :gh:`94146`.)

source: Optimizations
pt_br: Otimizações

source: Several standard library modules have had their import times significantly improved. For example, the import time of the :mod:`typing` module has been reduced by around a third by removing dependencies on :mod:`re` and :mod:`contextlib`. Other modules to enjoy import-time speedups include :mod:`email.utils`, :mod:`enum`, :mod:`functools`, :mod:`importlib.metadata`, and :mod:`threading`. (Contributed by Alex Waygood, Shantanu Jain, Adam Turner, Daniel Hollas, and others in :gh:`109653`.)
pt_br: Vários módulos de biblioteca padrão tiveram seus tempos de importação significativamente melhorados. Por exemplo, o tempo de importação do módulo :mod:`typing` foi reduzido em cerca de um terço pela remoção de dependências em :mod:`re` e :mod:`contextlib`. Outros módulos para aproveitar a aceleração no tempo de importação incluem :mod:`email.utils`, :mod:`enum`, :mod:`functools`, :mod:`importlib.metadata` e :mod:`threading`. (Contribuição de Alex Waygood, Shantanu Jain, Adam Turner, Daniel Hollas e outros em :gh:`109653`.)

source: :func:`textwrap.indent` is now around 30% faster than before for large input. (Contributed by Inada Naoki in :gh:`107369`.)
pt_br: :func:`textwrap.indent` agora é cerca de 30% mais rápido do que antes para entradas grandes. (Contribuição de Inada Naoki em :gh:`107369`.)

source: The :mod:`subprocess` module now uses the :func:`~os.posix_spawn` function in more situations, including when *close_fds* is ``True`` (the default) on many modern platforms. This should provide a notable performance increase when launching processes on FreeBSD and Solaris. See the :ref:`subprocess <whatsnew313-subprocess>` section above for details. (Contributed by Jakub Kulik in :gh:`113117`.)
pt_br: O módulo :mod:`subprocess` agora a função :func:`~os.posix_spawn` em mais situações, incluindo quando *close_fds* é ``True`` (o padrão) em muitas plataformas. Isto deve fornecer um aumento notável de desempenho ao iniciar processos no FreeBSD e Solaris. Veja a seção de :ref:`subprocess <whatsnew313-subprocess>` acima para detalhes. (Contribuição de Jakub Kulik em :gh:`113117`.)

source: Removed Modules And APIs
pt_br: Módulos e APIs removidas

source: PEP 594: Remove "dead batteries" from the standard library
pt_br: PEP 594: remove "baterias descarregadas" da biblioteca padrão

source: :pep:`594` proposed removing 19 modules from the standard library, colloquially referred to as 'dead batteries' due to their historic, obsolete, or insecure status. All of the following modules were deprecated in Python 3.11, and are now removed:
pt_br: :pep:`594` propôs remover 19 módulos da biblioteca padrão, coloquialmente chamados de "baterias descarregadas" devido ao seu status histórico, obsoleto ou inseguro. Todos os módulos a seguir foram descontinuados no Python 3.11 e agora foram removidos:

source: :pypi:`standard-aifc`: Use the redistribution of ``aifc`` library from PyPI.
pt_br: :pypi:`standard-aifc`: Use a redistribuição da biblioteca ``aifc`` do PyPI.

source: :pypi:`audioop-lts`: Use ``audioop-lts`` library from PyPI.
pt_br: :pypi:`audioop-lts`: Use a biblioteca ``audioop-lts`` do PyPI.

source: :pypi:`standard-chunk`: Use the redistribution of ``chunk`` library from PyPI.
pt_br: :pypi:`standard-chunk`: Use a redistribuição da biblioteca ``chunk`` do PyPI.

source: :mod:`!cgi` and :mod:`!cgitb`
pt_br: :mod:`!cgi` e :mod:`!cgitb`

source: :class:`!cgi.FieldStorage` can typically be replaced with :func:`urllib.parse.parse_qsl` for ``GET`` and ``HEAD`` requests, and the :mod:`email.message` module or the :pypi:`multipart` library for ``POST`` and ``PUT`` requests.
pt_br: :class:`!cgi.FieldStorage` normalmente pode ser substituído por :func:`urllib.parse.parse_qsl` para solicitações ``GET`` e ``HEAD``, e o módulo :mod:`email.message` ou a biblioteca :pypi:`multipart` para solicitações ``POST`` e ``PUT``.

source: :func:`!cgi.parse` can be replaced by calling :func:`urllib.parse.parse_qs` directly on the desired query string, unless the input is ``multipart/form-data``, which should be replaced as described below for :func:`!cgi.parse_multipart`.
pt_br: :func:`!cgi.parse` pode ser substituído chamando :func:`urllib.parse.parse_qs` diretamente na string de consulta desejada, a menos que a entrada seja ``multipart/form-data``, que deve ser substituída conforme descrito abaixo para :func:`!cgi.parse_multipart`.

source: :func:`!cgi.parse_header` can be replaced with the functionality in the :mod:`email` package, which implements the same MIME RFCs. For example, with :class:`email.message.EmailMessage`:
pt_br: :func:`!cgi.parse_header` pode ser substituído pela funcionalidade do pacote :mod:`email`, que implementa os mesmos RFCs MIME. Por exemplo, com :class:`email.message.EmailMessage`::

source: :func:`!cgi.parse_multipart` can be replaced with the functionality in the :mod:`email` package, which implements the same MIME RFCs, or with the :pypi:`multipart` library. For example, the :class:`email.message.EmailMessage` and :class:`email.message.Message` classes.
pt_br: :func:`!cgi.parse_multipart` pode ser substituído pela funcionalidade no pacote :mod:`email`, que implementa os mesmos RFCs de MIME, ou pela biblioteca :pypi:`multipart`. Por exemplo, as classes :class:`email.message.EmailMessage` e :class:`email.message.Message`.

source: :pypi:`standard-cgi`: and :pypi:`standard-cgitb`: Use the redistribution of ``cgi`` and ``cgitb`` library from PyPI.
pt_br: :pypi:`standard-cgi`: e :pypi:`standard-cgitb`: Use a redistribuição das bibliotecas ``cgi`` e ``cgitb`` do PyPI.

source: :mod:`!crypt` and the private :mod:`!_crypt` extension. The :mod:`hashlib` module may be an appropriate replacement when simply hashing a value is required. Otherwise, various third-party libraries on PyPI are available:
pt_br: :mod:`!crypt` e a extensão privada :mod:`!_crypt`. O módulo :mod:`hashlib` pode ser uma substituição apropriada quando simplesmente fazer hash de um valor é necessário. Caso contrário, várias bibliotecas de terceiros no PyPI estão disponíveis:

source: :pypi:`bcrypt`: Modern password hashing for your software and your servers.
pt_br: :pypi:`bcrypt`: hashing de senha moderno para seu software e servidores.

source: :pypi:`passlib`: Comprehensive password hashing framework supporting over 30 schemes.
pt_br: :pypi:`passlib`: framework abrangente de hash de senha com suporte para mais de 30 esquemas.

source: :pypi:`argon2-cffi`: The secure Argon2 password hashing algorithm.
pt_br: :pypi:`argon2-cffi`: algoritmo seguro de hashing de senha Argon2.

source: :pypi:`legacycrypt`: :mod:`ctypes` wrapper to the POSIX crypt library call and associated functionality.
pt_br: :pypi:`legacycrypt`: envólucro ao :mod:`ctypes` para a chamada POSIX da biblioteca de criptografia e funcionalidade associada.

source: :pypi:`crypt_r`: Fork of the :mod:`!crypt` module, wrapper to the :manpage:`crypt_r(3)` library call and associated functionality.
pt_br: :pypi:`crypt_r`: fork do módulo :mod:`!crypt`, um envólucro para a chamada da biblioteca :manpage:`crypt_r(3)` e funcionalidade associada.

source: :pypi:`standard-crypt` and :pypi:`deprecated-crypt-alternative`: Use the redistribution of ``crypt`` and reimplementation of ``_crypt`` libraries from PyPI.
pt_br: :pypi:`standard-crypt` e :pypi:`deprecated-crypt-alternative`: Use a redistribuição de ``crypt`` e a reimplementação das bibliotecas ``_crypt`` do PyPI.

source: :mod:`!imghdr`: The :pypi:`filetype`, :pypi:`puremagic`, or :pypi:`python-magic` libraries should be used as replacements. For example, the :func:`!puremagic.what` function can be used to replace the :func:`!imghdr.what` function for all file formats that were supported by :mod:`!imghdr`.
pt_br: :mod:`!imghdr`: as bibliotecas :pypi:`filetype`, :pypi:`puremagic` ou :pypi:`python-magic` devem ser usadas como substituições. Por exemplo, a função :func:`!puremagic.what` pode ser usada para substituir a função :func:`!imghdr.what` para todos os formatos de arquivo que tinham suporte de :mod:`!imghdr`.

source: :pypi:`standard-imghdr`: Use the redistribution of ``imghdr`` library from PyPI.
pt_br: :pypi:`standard-imghdr`: Use a redistribuição da biblioteca ``imghdr`` do PyPI.

source: :mod:`!mailcap`: Use the :mod:`mimetypes` module instead.
pt_br: :mod:`!mailcap`: use o módulo :mod:`mimetypes`.

source: :pypi:`standard-mailcap`: Use the redistribution of ``mailcap`` library from PyPI.
pt_br: :pypi:`standard-mailcap`: Use a redistribuição da biblioteca ``mailcap`` do PyPI.

source: :mod:`!nntplib`: Use the :pypi:`pynntp` library from PyPI instead.
pt_br: :mod:`!nntplib`: use a biblioteca :pypi:`pynntp` do PyPI.

source: :pypi:`standard-nntplib`: Use the redistribution of ``nntplib`` library from PyPI.
pt_br: :pypi:`standard-nntplib`: Use a redistribuição da biblioteca ``nntplib`` do PyPI.

source: :mod:`!ossaudiodev`: For audio playback, use the :pypi:`pygame` library from PyPI instead.
pt_br: :mod:`!ossaudiodev`: para reprodução de áudio, use a biblioteca :pypi:`pygame` do PyPI.

source: :mod:`!pipes`: Use the :mod:`subprocess` module instead. Use :func:`shlex.quote` to replace the undocumented ``pipes.quote`` function.
pt_br: :mod:`!pipes`: Use o módulo :mod:`subprocess` em vez disso. Use :func:`shlex.quote` para substituir a função não documentada ``pipes.quote``.

source: :pypi:`standard-pipes`: Use the redistribution of ``pipes`` library from PyPI.
pt_br: :pypi:`standard-pipes`: Use a redistribuição da biblioteca ``pipes`` do PyPI.

source: :mod:`!sndhdr`: The :pypi:`filetype`, :pypi:`puremagic`, or :pypi:`python-magic` libraries should be used as replacements.
pt_br: :mod:`!sndhdr`: as bibliotecas :pypi:`filetype`, :pypi:`puremagic` ou :pypi:`python-magic` devem ser usadas como substitutas.

source: :pypi:`standard-sndhdr`: Use the redistribution of ``sndhdr`` library from PyPI.
pt_br: :pypi:`standard-sndhdr`: Use a redistribuição da biblioteca ``sndhdr`` do PyPI.

source: :mod:`!spwd`: Use the :pypi:`python-pam` library from PyPI instead.
pt_br: :mod:`!spwd`: use a biblioteca :pypi:`python-pam` do PyPI.

source: :pypi:`standard-sunau`: Use the redistribution of ``sunau`` library from PyPI.
pt_br: :pypi:`standard-sunau`: Use a redistribuição da biblioteca ``sunau`` do PyPI.

source: :mod:`!telnetlib`, Use the :pypi:`telnetlib3` or :pypi:`Exscript` libraries from PyPI instead.
pt_br: :mod:`!telnetlib`: use as bibliotecas :pypi:`telnetlib3` ou :pypi:`Exscript` do PyPI.

source: :pypi:`standard-telnetlib`: Use the redistribution of ``telnetlib`` library from PyPI.
pt_br: :pypi:`standard-telnetlib`: Use a redistribuição da biblioteca ``telnetlib`` do PyPI.

source: :mod:`!uu`: Use the :mod:`base64` module instead, as a modern alternative.
pt_br: :mod:`!uu`: use o módulo :mod:`base64` como uma alternativa moderna.

source: :pypi:`standard-uu`: Use the redistribution of ``uu`` library from PyPI.
pt_br: :pypi:`standard-uu`: Use a redistribuição da biblioteca ``uu`` do PyPI.

source: :pypi:`standard-xdrlib`: Use the redistribution of ``xdrlib`` library from PyPI.
pt_br: :pypi:`standard-xdrlib`: Use a redistribuição da biblioteca ``xdrlib`` do PyPI.

source: (Contributed by Victor Stinner and Zachary Ware in :gh:`104773` and :gh:`104780`.)
pt_br: (Contribuição de Victor Stinner e Zachary Ware em :gh:`104773` e :gh:`104780`.)

source: Remove the :program:`2to3` program and the :mod:`!lib2to3` module, previously deprecated in Python 3.11. (Contributed by Victor Stinner in :gh:`104780`.)
pt_br: Remove o programa :program:`2to3` e o módulo :mod:`!lib2to3`, já descontinuados no Python 3.11. (Contribuição de Victor Stinner em :gh:`104780`.)

source: builtins
pt_br: embutidos
