Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: In Python 3.8, the abstract base classes in :mod:`collections.abc` will no longer be exposed in the regular :mod:`collections` module. This will help create a clearer distinction between the concrete classes and the abstract base classes. (Contributed by Serhiy Storchaka in :issue:`25988`.)
pt_br: У Python 3.8 абстрактні базові класи в :mod:`collections.abc` більше не відображатимуться в звичайному модулі :mod:`collections`. Це допоможе створити більш чітке розмежування між конкретними класами та абстрактними базовими класами. (Надав Сергій Сторчака в :issue:`25988`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed. A deprecation warning is now emitted if the index file is missing and recreated in the ``'r'`` and ``'w'`` modes (this will be an error in future Python releases). (Contributed by Serhiy Storchaka in :issue:`28847`.)
pt_br: :mod:`dbm.dumb` тепер підтримує читання файлів лише для читання та більше не записує файл індексу, якщо він не змінений. Тепер видається попередження про застаріння, якщо файл індексу відсутній і створений заново в режимах ``'r'`` і ``'w'`` (це буде помилка в майбутніх випусках Python). (Надав Сергій Сторчака в :issue:`28847`.)

source: In Python 3.8, attempting to check for non-Enum objects in :class:`Enum` classes will raise a :exc:`TypeError` (e.g. ``1 in Color``); similarly, attempting to check for non-Flag objects in a :class:`Flag` member will raise :exc:`TypeError` (e.g. ``1 in Perm.RW``); currently, both operations return :const:`False` instead. (Contributed by Ethan Furman in :issue:`33217`.)
pt_br: У Python 3.8 спроба перевірити об’єкти, що не належать до Enum, у класах :class:`Enum` викличе :exc:`TypeError` (наприклад, ``1 in Color``); аналогічно спроба перевірити об’єкти без прапорців у члені :class:`Flag` викличе :exc:`TypeError` (наприклад, ``1 in Perm.RW``); наразі обидві операції замість цього повертають :const:`False`. (Надав Ітан Фурман у :issue:`33217`.)

source: Using non-integer value for selecting a plural form in :mod:`gettext` is now deprecated. It never correctly worked. (Contributed by Serhiy Storchaka in :issue:`28692`.)
pt_br: Використання нецілого значення для вибору форми множини в :mod:`gettext` тепер застаріло. Він ніколи не працював правильно. (Надав Сергій Сторчака в :issue:`28692`.)

source: The :class:`importlib.abc.ResourceLoader` ABC has been deprecated in favour of :class:`importlib.abc.ResourceReader`.
pt_br: :class:`importlib.abc.ResourceLoader` ABC застаріло на користь :class:`importlib.abc.ResourceReader`.

source: :func:`locale.format` has been deprecated, use :meth:`locale.format_string` instead. (Contributed by Garvit in :issue:`10379`.)
pt_br: :func:`locale.format` застаріло, замість нього використовуйте :meth:`locale.format_string`. (Надано Гарвітом у :issue:`10379`.)

source: The :mod:`macpath` is now deprecated and will be removed in Python 3.8. (Contributed by Chi Hsuan Yen in :issue:`9850`.)
pt_br: :mod:`macpath` тепер не підтримується та буде видалено в Python 3.8. (Надано Чі Сюань Єном у :issue:`9850`.)

source: The silent argument value truncation in :func:`socket.htons` and :func:`socket.ntohs` has been deprecated. In future versions of Python, if the passed argument is larger than 16 bits, an exception will be raised. (Contributed by Oren Milman in :issue:`28332`.)
pt_br: Безмовне скорочення значення аргументу в :func:`socket.htons` і :func:`socket.ntohs` застаріло. У майбутніх версіях Python, якщо переданий аргумент перевищує 16 біт, буде створено виняток. (Надав Орен Мілман у :issue:`28332`.)

source: :func:`ssl.wrap_socket` is deprecated. Use :meth:`ssl.SSLContext.wrap_socket` instead. (Contributed by Christian Heimes in :issue:`28124`.)
pt_br: :func:`ssl.wrap_socket` застаріло. Замість цього використовуйте :meth:`ssl.SSLContext.wrap_socket`. (Надав Крістіан Хеймс у :issue:`28124`.)

source: :func:`sunau.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`sunau.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
pt_br: :func:`sunau.openfp` визнано застарілим і буде видалено в Python 3.9. Замість цього використовуйте :func:`sunau.open`. (Надав Браян Кертін у :issue:`31985`.)

source: Deprecated :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper`.
pt_br: Застаріли :func:`sys.set_coroutine_wrapper` і :func:`sys.get_coroutine_wrapper`.

source: The undocumented ``sys.callstats()`` function has been deprecated and will be removed in a future Python version. (Contributed by Victor Stinner in :issue:`28799`.)
pt_br: Недокументована функція ``sys.callstats()`` застаріла та буде видалена в майбутній версії Python. (Надав Віктор Стіннер у :issue:`28799`.)

source: :func:`wave.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`wave.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
pt_br: :func:`wave.openfp` визнано застарілим і буде видалено в Python 3.9. Натомість використовуйте :func:`wave.open`. (Надав Браян Кертін у :issue:`31985`.)

source: Deprecated functions and types of the C API
pt_br: Застарілі функції та типи C API

source: Function :c:func:`PySlice_GetIndicesEx` is deprecated and replaced with a macro if ``Py_LIMITED_API`` is not set or set to a value in the range between ``0x03050400`` and ``0x03060000`` (not inclusive), or is ``0x03060100`` or higher. (Contributed by Serhiy Storchaka in :issue:`27867`.)
pt_br: Функція :c:func:`PySlice_GetIndicesEx` застаріла та замінена на макрос, якщо ``Py_LIMITED_API`` не встановлено або встановлено значення в діапазоні від ``0x03050400`` до ``0x03060000`` (не включно), або ``0x03060100`` або вище. (Надав Сергій Сторчака в :issue:`27867`.)

source: :c:func:`PyOS_AfterFork` has been deprecated. Use :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` or :c:func:`PyOS_AfterFork_Child()` instead. (Contributed by Antoine Pitrou in :issue:`16500`.)
pt_br: :c:func:`PyOS_AfterFork` застаріло. Замість цього використовуйте :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` або :c:func:`PyOS_AfterFork_Child()`. (Надав Антуан Пітру в :issue:`16500`.)

source: Platform Support Removals
pt_br: Видалення підтримки платформи

source: FreeBSD 9 and older are no longer officially supported.
pt_br: FreeBSD 9 і старіші більше офіційно не підтримуються.

source: For full Unicode support, including within extension modules, \*nix platforms are now expected to provide at least one of ``C.UTF-8`` (full locale), ``C.utf8`` (full locale) or ``UTF-8`` (``LC_CTYPE``-only locale) as an alternative to the legacy ``ASCII``-based ``C`` locale.
pt_br: Для повної підтримки Unicode, включно з модулями розширення, очікується, що платформи \*nix нададуть принаймні один із ``C.UTF-8`` (повна локаль), ``C.utf8`` (повна локаль) або ``UTF-8`` (``LC_CTYPE``-only locale) як альтернатива застарілому ``ASCII`` на основі ``C`` локалі.

source: OpenSSL 0.9.8 and 1.0.1 are no longer supported, which means building CPython 3.7 with SSL/TLS support on older platforms still using these versions requires custom build options that link to a more recent version of OpenSSL.
pt_br: OpenSSL 0.9.8 і 1.0.1 більше не підтримуються, що означає, що створення CPython 3.7 із підтримкою SSL/TLS на старіших платформах, які все ще використовують ці версії, потребує спеціальних параметрів збірки, які посилаються на новішу версію OpenSSL.

source: Notably, this issue affects the Debian 8 (aka "jessie") and Ubuntu 14.04 (aka "Trusty") LTS Linux distributions, as they still use OpenSSL 1.0.1 by default.
pt_br: Зокрема, ця проблема стосується дистрибутивів LTS Linux Debian 8 (він же "jessie") і Ubuntu 14.04 (він же "Trusty"), оскільки вони все ще використовують OpenSSL 1.0.1 за замовчуванням.

source: Debian 9 ("stretch") and Ubuntu 16.04 ("xenial"), as well as recent releases of other LTS Linux releases (e.g. RHEL/CentOS 7.5, SLES 12-SP3), use OpenSSL 1.0.2 or later, and remain supported in the default build configuration.
pt_br: Debian 9 ("stretch") і Ubuntu 16.04 ("xenial"), а також останні випуски інших версій LTS Linux (наприклад, RHEL/CentOS 7.5, SLES 12-SP3) використовують OpenSSL 1.0.2 або пізнішої версії та залишаються підтримуваними у конфігурації збірки за замовчуванням.

source: CPython's own `CI configuration file <https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ provides an example of using the SSL :source:`compatibility testing infrastructure <Tools/ssl/multissltests.py>` in CPython's test suite to build and link against OpenSSL 1.1.0 rather than an outdated system provided OpenSSL.
pt_br: Собственный `файл конфигурации CI CPython <https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ представляет собой пример использования инфраструктуры тестирования совместимости SSL <Tools/ssl /multissltests.py>` в наборе тестов CPython для сборки и связывания с OpenSSL 1.1.0, а не с устаревшей системой, предоставляющей OpenSSL.

source: API and Feature Removals
pt_br: Remoção de APIs e recursos

source: The following features and APIs have been removed from Python 3.7:
pt_br: З Python 3.7 видалено наступні функції та API:

source: The ``os.stat_float_times()`` function has been removed. It was introduced in Python 2.3 for backward compatibility with Python 2.2, and was deprecated since Python 3.1.
pt_br: Функцію ``os.stat_float_times()`` було видалено. Він був представлений у Python 2.3 для зворотної сумісності з Python 2.2, і був застарілим з Python 3.1.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter in replacement templates for :func:`re.sub` were deprecated in Python 3.5, and will now cause an error.
pt_br: Невідомі вихідні коди, що складаються з ``'\'`` і літери ASCII у шаблонах заміни для :func:`re.sub` були застарілими в Python 3.5 і тепер викликають помилку.

source: Removed support of the *exclude* argument in :meth:`tarfile.TarFile.add`. It was deprecated in Python 2.7 and 3.2. Use the *filter* argument instead.
pt_br: Вилучено підтримку аргументу *exclude* у :meth:`tarfile.TarFile.add`. Він був застарілим у Python 2.7 і 3.2. Натомість використовуйте аргумент *filter*.

source: The :func:`!ntpath.splitunc` function was deprecated in Python 3.1, and has now been removed. Use :func:`~os.path.splitdrive` instead.
pt_br: Функция :func:`!ntpath.splitunc` устарела в Python 3.1 и теперь удалена. Вместо этого используйте :func:`~os.path.splitdrive`.

source: :func:`collections.namedtuple` no longer supports the *verbose* parameter or ``_source`` attribute which showed the generated source code for the named tuple class. This was part of an optimization designed to speed-up class creation. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
pt_br: :func:`collections.namedtuple` більше не підтримує параметр *verbose* або атрибут ``_source``, який показував згенерований вихідний код для іменованого класу кортежу. Це було частиною оптимізації, спрямованої на прискорення створення класів. (Надано Jelle Zijlstra з подальшими вдосконаленнями INADA Naoki, Сергієм Сторчакою та Raymond Hettinger у :issue:`28638`.)

source: Functions :func:`bool`, :func:`float`, :func:`list` and :func:`tuple` no longer take keyword arguments. The first argument of :func:`int` can now be passed only as positional argument.
pt_br: Функції :func:`bool`, :func:`float`, :func:`list` і :func:`tuple` більше не приймають аргументи ключових слів. Перший аргумент :func:`int` тепер можна передати лише як позиційний аргумент.

source: Removed previously deprecated in Python 2.4 classes ``Plist``, ``Dict`` and ``_InternalDict`` in the :mod:`plistlib` module. Dict values in the result of functions :func:`~plistlib.readPlist` and :func:`~plistlib.readPlistFromBytes` are now normal dicts. You no longer can use attribute access to access items of these dictionaries.
pt_br: Вилучено раніше застарілі в Python 2.4 класи ``Plist``, ``Dict`` і ``_InternalDict`` у модулі :mod:`plistlib`. Значення Dict у результатах функцій :func:`~plistlib.readPlist` і :func:`~plistlib.readPlistFromBytes` тепер є звичайними dicts. Ви більше не можете використовувати доступ до атрибутів для доступу до елементів цих словників.

source: The ``asyncio.windows_utils.socketpair()`` function has been removed. Use the :func:`socket.socketpair` function instead, it is available on all platforms since Python 3.5. ``asyncio.windows_utils.socketpair`` was just an alias to ``socket.socketpair`` on Python 3.5 and newer.
pt_br: Функцію ``asyncio.windows_utils.socketpair()`` видалено. Натомість використовуйте функцію :func:`socket.socketpair`, вона доступна на всіх платформах, починаючи з Python 3.5. ``asyncio.windows_utils.socketpair`` був просто псевдонімом ``socket.socketpair`` на Python 3.5 і новіших версіях.

source: Direct instantiation of :class:`ssl.SSLSocket` and :class:`ssl.SSLObject` objects is now prohibited. The constructors were never documented, tested, or designed as public constructors. Users were supposed to use :func:`ssl.wrap_socket` or :class:`ssl.SSLContext`. (Contributed by Christian Heimes in :issue:`32951`.)
pt_br: Пряме створення об’єктів :class:`ssl.SSLSocket` і :class:`ssl.SSLObject` тепер заборонено. Конструктори ніколи не документувалися, не тестувалися і не проектувалися як публічні конструктори. Користувачі повинні були використовувати :func:`ssl.wrap_socket` або :class:`ssl.SSLContext`. (Надав Крістіан Хеймс у :issue:`32951`.)

source: Module Removals
pt_br: Penghapusan Modul

source: The ``fpectl`` module has been removed. It was never enabled by default, never worked correctly on x86-64, and it changed the Python ABI in ways that caused unexpected breakage of C extensions. (Contributed by Nathaniel J. Smith in :issue:`29137`.)
pt_br: Модуль ``fpectl`` видалено. Він ніколи не був увімкнений за замовчуванням, ніколи не працював правильно на x86-64, і він змінював Python ABI таким чином, що викликав неочікувану поломку розширень C. (Надано Натаніелем Дж. Смітом у :issue:`29137`.)

source: Windows-only Changes
pt_br: Perubahan di Windows-saja

source: The python launcher, (py.exe), can accept 32 & 64 bit specifiers **without** having to specify a minor version as well. So ``py -3-32`` and ``py -3-64`` become valid as well as ``py -3.7-32``, also the -*m*-64 and -*m.n*-64 forms are now accepted to force 64 bit python even if 32 bit would have otherwise been used. If the specified version is not available py.exe will error exit. (Contributed by Steve Barnes in :issue:`30291`.)
pt_br: Засіб запуску Python (py.exe) може приймати 32- та 64-бітні специфікатори **без** необхідності вказувати проміжну версію. Тож ``py -3-32`` і ``py -3-64`` стають дійсними, а також ``py -3.7-32``, а також -*m*-64 і -*m.n*-64 тепер дозволено використовувати 64-бітний Python, навіть якщо в іншому випадку використовувався б 32-бітний. Якщо зазначена версія недоступна, py.exe завершить роботу з помилкою. (Надав Стів Барнс у :issue:`30291`.)

source: The launcher can be run as ``py -0`` to produce a list of the installed pythons, *with default marked with an asterisk*. Running ``py -0p`` will include the paths. If py is run with a version specifier that cannot be matched it will also print the *short form* list of available specifiers. (Contributed by Steve Barnes in :issue:`30362`.)
pt_br: Засіб запуску можна запустити як ``py -0``, щоб створити список встановлених пітонів, *за умовчанням позначених зірочкою*. Запуск ``py -0p`` включатиме шляхи. Якщо py запускається зі специфікатором версії, який не може бути зіставлений, він також надрукує *короткий* список доступних специфікаторів. (Надав Стів Барнс у :issue:`30362`.)

source: Porting to Python 3.7
pt_br: Перенесення на Python 3.7

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_br: Esta seção lista as alterações descritas anteriormente e outras correções que podem exigir alterações no seu código.

source: Changes in Python Behavior
pt_br: Perubahan di Perilaku Python

source: :keyword:`async` and :keyword:`await` names are now reserved keywords. Code using these names as identifiers will now raise a :exc:`SyntaxError`. (Contributed by Jelle Zijlstra in :issue:`30406`.)
pt_br: Імена :keyword:`async` і :keyword:`await` тепер є зарезервованими ключовими словами. Код, який використовує ці імена як ідентифікатори, тепер викличе :exc:`SyntaxError`. (Надано Jelle Zijlstra в :issue:`30406`.)

source: :pep:`479` is enabled for all code in Python 3.7, meaning that :exc:`StopIteration` exceptions raised directly or indirectly in coroutines and generators are transformed into :exc:`RuntimeError` exceptions. (Contributed by Yury Selivanov in :issue:`32670`.)
pt_br: :pep:`479` увімкнено для всього коду в Python 3.7, тобто винятки :exc:`StopIteration`, викликані прямо чи опосередковано в співпрограмах і генераторах, перетворюються на винятки :exc:`RuntimeError`. (Надав Юрій Селіванов у :issue:`32670`.)

source: :meth:`object.__aiter__` methods can no longer be declared as asynchronous. (Contributed by Yury Selivanov in :issue:`31709`.)
pt_br: Методи :meth:`object.__aiter__` більше не можна оголошувати як асинхронні. (Надав Юрій Селіванов у :issue:`31709`.)

source: Due to an oversight, earlier Python versions erroneously accepted the following syntax::
pt_br: Через помилку попередні версії Python помилково приймали такий синтаксис:

source: Python 3.7 now correctly raises a :exc:`SyntaxError`, as a generator expression always needs to be directly inside a set of parentheses and cannot have a comma on either side, and the duplication of the parentheses can be omitted only on calls. (Contributed by Serhiy Storchaka in :issue:`32012` and :issue:`32023`.)
pt_br: Python 3.7 тепер правильно викликає :exc:`SyntaxError`, оскільки вираз генератора завжди має бути безпосередньо всередині набору дужок і не може мати коми з обох боків, а дублювання дужок можна опустити лише під час викликів. (Надав Сергій Сторчака в :issue:`32012` і :issue:`32023`.)

source: When using the :option:`-m` switch, the initial working directory is now added to :data:`sys.path`, rather than an empty string (which dynamically denoted the current working directory at the time of each import). Any programs that are checking for the empty string, or otherwise relying on the previous behaviour, will need to be updated accordingly (e.g. by also checking for ``os.getcwd()`` or ``os.path.dirname(__main__.__file__)``, depending on why the code was checking for the empty string in the first place).
pt_br: Під час використання перемикача :option:`-m` початковий робочий каталог тепер додається до :data:`sys.path`, а не порожній рядок (який динамічно позначає поточний робочий каталог під час кожного імпорту). Будь-які програми, які перевіряють порожній рядок або іншим чином покладаються на попередню поведінку, потрібно буде відповідним чином оновити (наприклад, також перевіривши ``os.getcwd()`` або ``os.path.dirname(__main__. __file__)``, залежно від того, чому код спочатку перевіряв порожній рядок).

source: Changes in the Python API
pt_br: Alterações na API Python

source: :meth:`socketserver.ThreadingMixIn.server_close` now waits until all non-daemon threads complete. Set the new :attr:`socketserver.ThreadingMixIn.block_on_close` class attribute to ``False`` to get the pre-3.7 behaviour. (Contributed by Victor Stinner in :issue:`31233` and :issue:`33540`.)
pt_br: :meth:`socketserver.ThreadingMixIn.server_close` тепер очікує, поки завершаться всі потоки, що не є демонами. Встановіть новий атрибут класу :attr:`socketserver.ThreadingMixIn.block_on_close` на ``False``, щоб отримати поведінку до 3.7. (Надав Віктор Стіннер у :issue:`31233` і :issue:`33540`.)

source: :meth:`socketserver.ForkingMixIn.server_close` now waits until all child processes complete. Set the new :attr:`socketserver.ForkingMixIn.block_on_close` class attribute to ``False`` to get the pre-3.7 behaviour. (Contributed by Victor Stinner in :issue:`31151` and :issue:`33540`.)
pt_br: :meth:`socketserver.ForkingMixIn.server_close` тепер очікує, поки завершаться всі дочірні процеси. Встановіть новий атрибут класу :attr:`socketserver.ForkingMixIn.block_on_close` на ``False``, щоб отримати поведінку до 3.7. (Надав Віктор Стіннер у :issue:`31151` і :issue:`33540`.)

source: The :func:`locale.localeconv` function now temporarily sets the ``LC_CTYPE`` locale to the value of ``LC_NUMERIC`` in some cases. (Contributed by Victor Stinner in :issue:`31900`.)
pt_br: У деяких випадках функція :func:`locale.localeconv` тепер тимчасово встановлює для локалі ``LC_CTYPE`` значення ``LC_NUMERIC``. (Надав Віктор Стіннер у :issue:`31900`.)

source: :meth:`pkgutil.walk_packages` now raises a :exc:`ValueError` if *path* is a string. Previously an empty list was returned. (Contributed by Sanyam Khurana in :issue:`24744`.)
pt_br: :meth:`pkgutil.walk_packages` тепер викликає :exc:`ValueError`, якщо *path* є рядком. Раніше повертався порожній список. (Надано Sanyam Khurana в :issue:`24744`.)

source: A format string argument for :meth:`string.Formatter.format` is now :ref:`positional-only <positional-only_parameter>`. Passing it as a keyword argument was deprecated in Python 3.5. (Contributed by Serhiy Storchaka in :issue:`29193`.)
pt_br: Аргумент рядка форматування для :meth:`string.Formatter.format` тепер :ref:`positional-only <positional-only_parameter>`. Передача його як аргументу ключового слова застаріла в Python 3.5. (Надав Сергій Сторчака в :issue:`29193`.)

source: Attributes :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` and :attr:`~http.cookies.Morsel.coded_value` of class :class:`http.cookies.Morsel` are now read-only. Assigning to them was deprecated in Python 3.5. Use the :meth:`~http.cookies.Morsel.set` method for setting them. (Contributed by Serhiy Storchaka in :issue:`29192`.)
pt_br: Атрибути :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` і :attr:`~http.cookies.Morsel.coded_value` класу :class:`http. cookies.Morsel` тепер доступні лише для читання. Призначення їм було застарілим у Python 3.5. Для їх налаштування використовуйте метод :meth:`~http.cookies.Morsel.set`. (Надав Сергій Сторчака в :issue:`29192`.)

source: The *mode* argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. To set their file permission bits you can set the umask before invoking ``makedirs()``. (Contributed by Serhiy Storchaka in :issue:`19930`.)
pt_br: Аргумент *mode* :func:`os.madeirs` больше не влияет на биты прав доступа к файлам вновь созданных каталогов промежуточного уровня. Чтобы установить биты прав доступа к файлам, вы можете установить umask перед вызовом makedirs(). (Предоставлено Сергеем Сторчакой в ​​:issue:`19930`.)

source: The :attr:`struct.Struct.format` type is now :class:`str` instead of :class:`bytes`. (Contributed by Victor Stinner in :issue:`21071`.)
pt_br: Тип :attr:`struct.Struct.format` тепер :class:`str` замість :class:`bytes`. (Надав Віктор Стіннер у :issue:`21071`.)

source: Due to internal changes in :mod:`socket`, calling :func:`socket.fromshare` on a socket created by :func:`socket.share <socket.socket.share>` in older Python versions is not supported.
pt_br: Через внутрішні зміни в :mod:`socket` виклик :func:`socket.fromshare` для сокета, створеного :func:`socket.share <socket.socket.share>` у старіших версіях Python, не підтримується.

source: ``repr`` for :exc:`BaseException` has changed to not include the trailing comma. Most exceptions are affected by this change. (Contributed by Serhiy Storchaka in :issue:`30399`.)
pt_br: ``repr`` для :exc:`BaseException` змінено, щоб не включати кінцеву кому. Ця зміна стосується більшості винятків. (Надав Сергій Сторчака в :issue:`30399`.)
