Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: Validation of server certificates containing internationalized domain names (IDNs) is now supported. As part of this change, the :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` attribute now stores the expected hostname in A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``). (Contributed by Nathaniel J. Smith and Christian Heimes in :issue:`28414`.)
pt_br: Тепер підтримується перевірка сертифікатів сервера, що містять інтернаціоналізовані доменні імена (IDN). У рамках цієї зміни атрибут :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` тепер зберігає очікуване ім’я хоста у формі A-мітки (``"xn--pythn-mua.org"``), а не U-мітки форма (``"pythön.org"``). (Надано Натаніелем Дж. Смітом і Крістіаном Хеймсом у :issue:`28414`.)

source: The ``ssl`` module has preliminary and experimental support for TLS 1.3 and OpenSSL 1.1.1. At the time of Python 3.7.0 release, OpenSSL 1.1.1 is still under development and TLS 1.3 hasn't been finalized yet. The TLS 1.3 handshake and protocol behaves slightly differently than TLS 1.2 and earlier, see :ref:`ssl-tlsv1_3`. (Contributed by Christian Heimes in :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` and :issue:`33618`)
pt_br: Модуль ``ssl`` має попередню та експериментальну підтримку TLS 1.3 і OpenSSL 1.1.1. На момент випуску Python 3.7.0 OpenSSL 1.1.1 все ще перебуває в стадії розробки, а TLS 1.3 ще не завершено. Рукостискання та протокол TLS 1.3 поводяться дещо інакше, ніж TLS 1.2 і раніші версії, див. :ref:`ssl-tlsv1_3`. (Надано Крістіаном Хеймсом у :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` та :issue:`33618`)

source: :class:`~ssl.SSLSocket` and :class:`~ssl.SSLObject` no longer have a public constructor. Direct instantiation was never a documented and supported feature. Instances must be created with :class:`~ssl.SSLContext` methods :meth:`~ssl.SSLContext.wrap_socket` and :meth:`~ssl.SSLContext.wrap_bio`. (Contributed by Christian Heimes in :issue:`32951`)
pt_br: :class:`~ssl.SSLSocket` і :class:`~ssl.SSLObject` більше не мають відкритого конструктора. Пряме створення екземплярів ніколи не було задокументованою та підтримуваною функцією. Екземпляри мають бути створені за допомогою :class:`~ssl.SSLContext` методів :meth:`~ssl.SSLContext.wrap_socket` і :meth:`~ssl.SSLContext.wrap_bio`. (Надав Крістіан Хеймс у :issue:`32951`)

source: OpenSSL 1.1 APIs for setting the minimum and maximum TLS protocol version are available as :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` and :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Supported protocols are indicated by several new flags, such as :data:`~ssl.HAS_TLSv1_1`. (Contributed by Christian Heimes in :issue:`32609`.)
pt_br: API OpenSSL 1.1 для встановлення мінімальної та максимальної версій протоколу TLS доступні як :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` і :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Підтримувані протоколи позначаються кількома новими прапорцями, наприклад :data:`~ssl.HAS_TLSv1_1`. (Надав Крістіан Хеймс у :issue:`32609`.)

source: Added :attr:`ssl.SSLContext.post_handshake_auth` to enable and :meth:`ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :gh:`78851`.)
pt_br: Добавлен :attr:`ssl.SSLContext.post_handshake_auth` для включения и :meth:`ssl.SSLSocket.verify_client_post_handshake` для инициации аутентификации TLS 1.3 после рукопожатия. (Предоставлено Кристианом Хаймсом в :gh:`78851`.)

source: :class:`string.Template` now lets you to optionally modify the regular expression pattern for braced placeholders and non-braced placeholders separately. (Contributed by Barry Warsaw in :issue:`1198569`.)
pt_br: :class:`string.Template` тепер дозволяє вам окремо змінювати шаблон регулярного виразу для заповнювачів у дужках і без дужок. (Надав Баррі Варшава в :issue:`1198569`.)

source: The :func:`subprocess.run` function accepts the new *capture_output* keyword argument. When true, stdout and stderr will be captured. This is equivalent to passing :const:`subprocess.PIPE` as *stdout* and *stderr* arguments. (Contributed by Bo Bayles in :issue:`32102`.)
pt_br: Функция :func:`subprocess.run` принимает новый аргумент ключевого слова *capture_output*. Если это правда, то stdout и stderr будут перехвачены. Это эквивалентно передаче :const:`subprocess.PIPE` в качестве аргументов *stdout* и *stderr*. (Предоставлено Бо Бейлсом в :issue:`32102`.)

source: The ``subprocess.run`` function and the :class:`subprocess.Popen` constructor now accept the *text* keyword argument as an alias to *universal_newlines*. (Contributed by Andrew Clegg in :issue:`31756`.)
pt_br: Функція ``subprocess.run`` і конструктор :class:`subprocess.Popen` тепер приймають аргумент ключового слова *text* як псевдонім *universal_newlines*. (Надав Ендрю Клегг у :issue:`31756`.)

source: On Windows the default for *close_fds* was changed from ``False`` to ``True`` when redirecting the standard handles. It's now possible to set *close_fds* to true when redirecting the standard handles. See :class:`subprocess.Popen`. This means that *close_fds* now defaults to ``True`` on all supported platforms. (Contributed by Segev Finer in :issue:`19764`.)
pt_br: У Windows стандартне значення для *close_fds* було змінено з ``False`` на ``True`` під час переспрямування стандартних дескрипторів. Тепер можна встановити для *close_fds* значення true під час перенаправлення стандартних дескрипторів. Перегляньте :class:`subprocess.Popen`. Це означає, що *close_fds* тепер має значення ``True`` на всіх підтримуваних платформах. (Надав Сегев Файнер у :issue:`19764`.)

source: The subprocess module is now more graceful when handling :exc:`KeyboardInterrupt` during :func:`subprocess.call`, :func:`subprocess.run`, or in a :class:`~subprocess.Popen` context manager. It now waits a short amount of time for the child to exit, before continuing the handling of the ``KeyboardInterrupt`` exception. (Contributed by Gregory P. Smith in :issue:`25942`.)
pt_br: Модуль підпроцесу тепер більш витончений під час обробки :exc:`KeyboardInterrupt` під час :func:`subprocess.call`, :func:`subprocess.run` або в контекстному менеджері :class:`~subprocess.Popen`. Тепер він деякий час очікує на вихід дочірнього елемента, перш ніж продовжити обробку виняткової ситуації ``KeyboardInterrupt``. (Надав Грегорі П. Сміт у :issue:`25942`.)

source: The new :func:`sys.breakpointhook` hook function is called by the built-in :func:`breakpoint`. (Contributed by Barry Warsaw in :issue:`31353`.)
pt_br: Нова функція :func:`sys.breakpointhook` викликається вбудованою :func:`breakpoint`. (Надав Баррі Варшау у :issue:`31353`.)

source: On Android, the new :func:`sys.getandroidapilevel` returns the build-time Android API version. (Contributed by Victor Stinner in :issue:`28740`.)
pt_br: На Android новий :func:`sys.getandroidapilevel` повертає версію Android API під час збирання. (Надав Віктор Стіннер у :issue:`28740`.)

source: The new :func:`sys.get_coroutine_origin_tracking_depth` function returns the current coroutine origin tracking depth, as set by the new :func:`sys.set_coroutine_origin_tracking_depth`. :mod:`asyncio` has been converted to use this new API instead of the deprecated :func:`sys.set_coroutine_wrapper`. (Contributed by Nathaniel J. Smith in :issue:`32591`.)
pt_br: Нова функція :func:`sys.get_coroutine_origin_tracking_depth` повертає поточну глибину відстеження джерела співпрограми, встановлену новим :func:`sys.set_coroutine_origin_tracking_depth`. :mod:`asyncio` було перетворено на використання цього нового API замість застарілого :func:`sys.set_coroutine_wrapper`. (Надано Натаніелем Дж. Смітом у :issue:`32591`.)

source: :pep:`564` adds six new functions with nanosecond resolution to the :mod:`time` module:
pt_br: :pep:`564` додає шість нових функцій із наносекундною роздільною здатністю до модуля :mod:`time`:

source: New clock identifiers have been added:
pt_br: Додано нові ідентифікатори годинника:

source: :const:`time.CLOCK_BOOTTIME` (Linux): Identical to :const:`time.CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
pt_br: :const:`time.CLOCK_BOOTTIME` (Linux): Идентичен :const:`time.CLOCK_MONOTONIC`, за исключением того, что он также включает время, когда система приостановлена.

source: :const:`time.CLOCK_PROF` (FreeBSD, NetBSD and OpenBSD): High-resolution per-process CPU timer.
pt_br: :const:`time.CLOCK_PROF` (FreeBSD, NetBSD и OpenBSD): таймер ЦП с высоким разрешением для каждого процесса.

source: :const:`time.CLOCK_UPTIME` (FreeBSD, OpenBSD): Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement.
pt_br: :const:`time.CLOCK_UPTIME` (FreeBSD, OpenBSD): Время, абсолютное значение которого равно времени, когда система работала и не была приостановлена, обеспечивая точное измерение времени безотказной работы.

source: The new :func:`time.thread_time` and :func:`time.thread_time_ns` functions can be used to get per-thread CPU time measurements. (Contributed by Antoine Pitrou in :issue:`32025`.)
pt_br: Нові функції :func:`time.thread_time` і :func:`time.thread_time_ns` можна використовувати для отримання вимірювань часу процесора для кожного потоку. (Надав Антуан Пітру в :issue:`32025`.)

source: The new :func:`time.pthread_getcpuclockid` function returns the clock ID of the thread-specific CPU-time clock.
pt_br: Нова функція :func:`time.pthread_getcpuclockid` повертає ідентифікатор годинника ЦП-годинника для конкретного потоку.

source: The new :class:`tkinter.ttk.Spinbox` class is now available. (Contributed by Alan Moore in :issue:`32585`.)
pt_br: Тепер доступний новий клас :class:`tkinter.ttk.Spinbox`. (Надав Алан Мур у :issue:`32585`.)

source: :class:`tracemalloc.Traceback` behaves more like regular tracebacks, sorting the frames from oldest to most recent. :meth:`Traceback.format() <tracemalloc.Traceback.format>` now accepts negative *limit*, truncating the result to the ``abs(limit)`` oldest frames. To get the old behaviour, use the new *most_recent_first* argument to ``Traceback.format()``. (Contributed by Jesse Bakker in :issue:`32121`.)
pt_br: :class:`tracemalloc.Traceback` поводиться більше як звичайне трасування, сортуючи кадри від найстаріших до найновіших. :meth:`Traceback.format() <tracemalloc.Traceback.format>` тепер приймає негативний *ліміт*, скорочуючи результат до найстаріших кадрів ``abs(limit)``. Щоб отримати стару поведінку, використовуйте новий аргумент *most_recent_first* для ``Traceback.format()``. (Надав Джессі Беккер у :issue:`32121`.)

source: The new :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType`, and :class:`~types.ClassMethodDescriptorType` classes are now available. (Contributed by Manuel Krebber and Guido van Rossum in :issue:`29377`, and Serhiy Storchaka in :issue:`32265`.)
pt_br: Тепер доступні нові класи :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType` і :class:`~types.ClassMethodDescriptorType`. (Надано Мануелем Креббером і Гвідо ван Россумом у :issue:`29377` та Сергієм Сторчакою у :issue:`32265`.)

source: The new :func:`types.resolve_bases` function resolves MRO entries dynamically as specified by :pep:`560`. (Contributed by Ivan Levkivskyi in :issue:`32717`.)
pt_br: Нова функція :func:`types.resolve_bases` динамічно вирішує записи MRO, як зазначено в :pep:`560`. (Надав Іван Левківський у :issue:`32717`.)

source: The internal :mod:`unicodedata` database has been upgraded to use `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Contributed by Benjamin Peterson.)
pt_br: Внутренняя база данных :mod:`unicodedata` была обновлена ​​для использования `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Предоставлено Бенджамином Петерсоном.)

source: The new ``-k`` command-line option allows filtering tests by a name substring or a Unix shell-like pattern. For example, ``python -m unittest -k foo`` runs ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``. (Contributed by Jonas Haag in :issue:`32071`.)
pt_br: Новий параметр командного рядка ``-k`` command-line option allows filtering tests by a name substring or a Unix shell-like pattern. For example, ``python -m unittest -k foo`` runs ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``. (Надав by Jonas Haag in :issue:`32071`.)

source: The :const:`~unittest.mock.sentinel` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`. (Contributed by Serhiy Storchaka in :issue:`20804`.)
pt_br: Атрибути :const:`~unittest.mock.sentinel` тепер зберігають свою ідентичність, коли їх :mod:`скопіюють <copy>` або :mod:`маринують <pickle>`. (Надав Сергій Сторчака в :issue:`20804`.)

source: The new :func:`~unittest.mock.seal` function allows sealing :class:`~unittest.mock.Mock` instances, which will disallow further creation of attribute mocks. The seal is applied recursively to all attributes that are themselves mocks. (Contributed by Mario Corchero in :issue:`30541`.)
pt_br: Нова функція :func:`~unittest.mock.seal` дозволяє запечатувати екземпляри :class:`~unittest.mock.Mock`, що забороняє подальше створення макетів атрибутів. Печатка застосовується рекурсивно до всіх атрибутів, які самі по собі є макетами. (Надав Маріо Корчеро в :issue:`30541`.)

source: :func:`urllib.parse.quote` has been updated from :rfc:`2396` to :rfc:`3986`, adding ``~`` to the set of characters that are never quoted by default. (Contributed by Christian Theune and Ratnadeep Debnath in :issue:`16285`.)
pt_br: :func:`urllib.parse.quote` було оновлено з :rfc:`2396` до :rfc:`3986`, додавши ``~`` до набору символів, які за замовчуванням ніколи не беруться в лапки. (Надано Крістіаном Теуном і Ратнадіпом Дебнатом у :issue:`16285`.)

source: The :func:`uu.encode` function now accepts an optional *backtick* keyword argument. When it's true, zeros are represented by ``'`'`` instead of spaces. (Contributed by Xiang Zhang in :issue:`30103`.)
pt_br: Функція :func:`uu.encode` тепер приймає додатковий аргумент ключового слова *backtick*. Коли це істина, нулі представлені ``'`'`` замість пробілів. (Надав Xiang Zhang у :issue:`30103`.)

source: The new :attr:`UUID.is_safe <uuid.UUID.is_safe>` attribute relays information from the platform about whether generated UUIDs are generated with a multiprocessing-safe method. (Contributed by Barry Warsaw in :issue:`22807`.)
pt_br: Новий атрибут :attr:`UUID.is_safe <uuid.UUID.is_safe>` передає інформацію з платформи про те, чи згенеровані UUID генеруються за допомогою багатопроцесорного безпечного методу. (Надав Баррі Варшау у :issue:`22807`.)

source: :func:`uuid.getnode` now prefers universally administered MAC addresses over locally administered MAC addresses. This makes a better guarantee for global uniqueness of UUIDs returned from :func:`uuid.uuid1`. If only locally administered MAC addresses are available, the first such one found is returned. (Contributed by Barry Warsaw in :issue:`32107`.)
pt_br: :func:`uuid.getnode` тепер надає перевагу універсально адміністрованим MAC-адресам над локально адміністрованими MAC-адресами. Це забезпечує кращу гарантію глобальної унікальності UUID, що повертається з :func:`uuid.uuid1`. Якщо доступні лише локально адміністровані MAC-адреси, повертається перша така знайдена. (Надав Баррі Варшау у :issue:`32107`.)

source: warnings
pt_br: avisos

source: The initialization of the default warnings filters has changed as follows:
pt_br: Ініціалізація стандартних фільтрів попереджень змінена таким чином:

source: warnings enabled via command line options (including those for :option:`-b` and the new CPython-specific :option:`-X` ``dev`` option) are always passed to the warnings machinery via the :data:`sys.warnoptions` attribute.
pt_br: попередження, увімкнені за допомогою параметрів командного рядка (включно з параметрами :option:`-b` і новим параметром :option:`-X` ``dev``) завжди передаються механізму попереджень через атрибут :data:`sys.warnoptions`.

source: warnings filters enabled via the command line or the environment now have the following order of precedence:
pt_br: фільтри попереджень, увімкнені через командний рядок або середовище, тепер мають такий порядок пріоритету:

source: the ``BytesWarning`` filter for :option:`-b` (or ``-bb``)
pt_br: фільтр ``BytesWarning`` для :option:`-b` (або ``-bb``)

source: any filters specified with the :option:`-W` option
pt_br: будь-які фільтри, визначені параметром :option:`-W`

source: any filters specified with the :envvar:`PYTHONWARNINGS` environment variable
pt_br: будь-які фільтри, указані за допомогою змінної середовища :envvar:`PYTHONWARNINGS`

source: any other CPython specific filters (e.g. the ``default`` filter added for the new ``-X dev`` mode)
pt_br: будь-які інші спеціальні фільтри CPython (наприклад, фільтр ``за замовчуванням``, доданий для нового режиму ``-X dev``)

source: any implicit filters defined directly by the warnings machinery
pt_br: будь-які неявні фільтри, визначені безпосередньо механізмом попереджень

source: in :ref:`CPython debug builds <debug-build>`, all warnings are now displayed by default (the implicit filter list is empty)
pt_br: у :ref:`CPython debug builds <debug-build>`, усі попередження тепер відображаються за замовчуванням (неявний список фільтрів порожній)

source: (Contributed by Nick Coghlan and Victor Stinner in :issue:`20361`, :issue:`32043`, and :issue:`32230`.)
pt_br: (Надано Ніком Когланом і Віктором Стіннером у :issue:`20361`, :issue:`32043` і :issue:`32230`.)

source: Deprecation warnings are once again shown by default in single-file scripts and at the interactive prompt. See :ref:`whatsnew37-pep565` for details. (Contributed by Nick Coghlan in :issue:`31975`.)
pt_br: Попередження про застарілу знову відображаються за замовчуванням в однофайлових сценаріях та в інтерактивному запиті. Докладніше див. :ref:`whatsnew37-pep565`. (Надав Нік Коглан у :issue:`31975`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :gh:`61441`.)
pt_br: В целях защиты от DTD и извлечения внешних объектов модули :mod:`xml.dom.minidom` и :mod:`xml.sax` больше не обрабатывают внешние объекты по умолчанию. (Предоставлено Кристианом Хаймсом в :gh:`61441`.)

source: :ref:`ElementPath <elementtree-xpath>` predicates in the :meth:`find` methods can now compare text of the current node with ``[. = "text"]``, not only text in children. Predicates also allow adding spaces for better readability. (Contributed by Stefan Behnel in :issue:`31648`.)
pt_br: Предикати :ref:`ElementPath <elementtree-xpath>` в методах :meth:`find` тепер можуть порівнювати текст поточного вузла з ``[. = "текст"]``, не тільки текст у дітей. Предикати також дозволяють додавати пробіли для кращої читабельності. (Надав Стефан Бенель у :issue:`31648`.)

source: :meth:`SimpleXMLRPCDispatcher.register_function <xmlrpc.server.SimpleXMLRPCDispatcher>` can now be used as a decorator. (Contributed by Xiang Zhang in :issue:`7769`.)
pt_br: :meth:`SimpleXMLRPCDispatcher.register_function <xmlrpc.server.SimpleXMLRPCDispatcher>` тепер можна використовувати як декоратор. (Надав Xiang Zhang у :issue:`7769`.)

source: Function :func:`~zipapp.create_archive` now accepts an optional *filter* argument to allow the user to select which files should be included in the archive. (Contributed by Irmen de Jong in :issue:`31072`.)
pt_br: Функція :func:`~zipapp.create_archive` тепер приймає додатковий аргумент *filter*, щоб дозволити користувачеві вибрати, які файли слід включити в архів. (Надано Irmen de Jong у :issue:`31072`.)

source: Function :func:`~zipapp.create_archive` now accepts an optional *compressed* argument to generate a compressed archive. A command line option ``--compress`` has also been added to support compression. (Contributed by Zhiming Wang in :issue:`31638`.)
pt_br: Функція :func:`~zipapp.create_archive` тепер приймає додатковий аргумент *compressed* для створення стисненого архіву. Для підтримки стиснення також додано параметр командного рядка ``--compress``. (Надав Zhiming Wang у :issue:`31638`.)

source: :class:`~zipfile.ZipFile` now accepts the new *compresslevel* parameter to control the compression level. (Contributed by Bo Bayles in :issue:`21417`.)
pt_br: :class:`~zipfile.ZipFile` тепер приймає новий параметр *compresslevel* для керування рівнем стиснення. (Надав Бо Бейлс у :issue:`21417`.)

source: Subdirectories in archives created by ``ZipFile`` are now stored in alphabetical order. (Contributed by Bernhard M. Wiedemann in :issue:`30693`.)
pt_br: Підкаталоги в архівах, створених ``ZipFile``, тепер зберігаються в алфавітному порядку. (Надав Bernhard M. Wiedemann у :issue:`30693`.)

source: C API Changes
pt_br: Alterações na API C

source: A new API for thread-local storage has been implemented. See :ref:`whatsnew37-pep539` for an overview and :ref:`thread-specific-storage-api` for a complete reference. (Contributed by Masayuki Yamamoto in :issue:`25658`.)
pt_br: Реалізовано новий API для локального зберігання потоків. Перегляньте :ref:`whatsnew37-pep539` для огляду та :ref:`thread-specific-storage-api` для повної довідки. (Надав Масаюкі Ямамото в :issue:`25658`.)

source: The new :ref:`context variables <whatsnew37-pep567>` functionality exposes a number of :ref:`new C APIs <contextvarsobjects>`.
pt_br: Нова функція :ref:`контекстних змінних <whatsnew37-pep567>` відкриває ряд :ref:`нових API C <contextvarsobjects>`.

source: The new :c:func:`PyImport_GetModule` function returns the previously imported module with the given name. (Contributed by Eric Snow in :issue:`28411`.)
pt_br: Нова функція :c:func:`PyImport_GetModule` повертає попередньо імпортований модуль із вказаною назвою. (Надав Ерік Сноу в :issue:`28411`.)

source: The new :c:macro:`Py_RETURN_RICHCOMPARE` macro eases writing rich comparison functions. (Contributed by Petr Victorin in :issue:`23699`.)
pt_br: Новий макрос :c:macro:`Py_RETURN_RICHCOMPARE` полегшує написання розширених функцій порівняння. (Надав Петро Вікторін у :issue:`23699`.)

source: The new :c:macro:`Py_UNREACHABLE` macro can be used to mark unreachable code paths. (Contributed by Barry Warsaw in :issue:`31338`.)
pt_br: Новий макрос :c:macro:`Py_UNREACHABLE` можна використовувати для позначення недоступних шляхів коду. (Надав Баррі Варшау у :issue:`31338`.)

source: The :mod:`tracemalloc` now exposes a C API through the new :c:func:`PyTraceMalloc_Track` and :c:func:`PyTraceMalloc_Untrack` functions. (Contributed by Victor Stinner in :issue:`30054`.)
pt_br: :mod:`tracemalloc` тепер відкриває C API за допомогою нових функцій :c:func:`PyTraceMalloc_Track` і :c:func:`PyTraceMalloc_Untrack`. (Надав Віктор Стіннер у :issue:`30054`.)

source: The new :c:func:`import__find__load__start` and :c:func:`import__find__load__done` static markers can be used to trace module imports. (Contributed by Christian Heimes in :issue:`31574`.)
pt_br: Нові статичні маркери :c:func:`import__find__load__start` і :c:func:`import__find__load__done` можна використовувати для відстеження імпорту модуля. (Надав Крістіан Хеймс у :issue:`31574`.)
