Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: The new :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` coroutine method allows waiting until the stream writer is closed. The new :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` method can be used to determine if the writer is closing. (Contributed by Andrew Svetlov in :issue:`32391`.)
pt_br: O novo método de corrotina :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` permite esperar até que o gravador de fluxo seja fechado. O novo método :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` pode ser usado para determinar se o gravador está fechando. (Contribuição de Andrew Svetlov em :issue:`32391`.)

source: The new :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` coroutine method allows sending files using :mod:`os.sendfile` when possible. (Contributed by Andrew Svetlov in :issue:`32410`.)
pt_br: O novo método de corrotina :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` permite enviar arquivos usando :mod:`os.sendfile` quando possível. (Contribuição de Andrew Svetlov em :issue:`32410`.)

source: The new :meth:`Future.get_loop() <asyncio.Future.get_loop>` and ``Task.get_loop()`` methods return the instance of the loop on which a task or a future were created. :meth:`Server.get_loop() <asyncio.Server.get_loop>` allows doing the same for :class:`asyncio.Server` objects. (Contributed by Yury Selivanov in :issue:`32415` and Srinivas Reddy Thatiparthy in :issue:`32418`.)
pt_br: Os novos métodos :meth:`Future.get_loop() <asyncio.Future.get_loop>` e ``Task.get_loop()`` retornam a instância do laço no qual uma tarefa ou um future foi criado. :meth:`Server.get_loop() <asyncio.Server.get_loop>` permite fazer o mesmo para objetos :class:`asyncio.Server`. (Contribuição de Yury Selivanov em :issue:`32415` e Srinivas Reddy Thatiparthy em :issue:`32418`.)

source: It is now possible to control how instances of :class:`asyncio.Server` begin serving. Previously, the server would start serving immediately when created. The new *start_serving* keyword argument to :meth:`loop.create_server() <asyncio.loop.create_server>` and :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, as well as :meth:`Server.start_serving() <asyncio.Server.start_serving>`, and :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` can be used to decouple server instantiation and serving. The new :meth:`Server.is_serving() <asyncio.Server.is_serving>` method returns ``True`` if the server is serving. :class:`~asyncio.Server` objects are now asynchronous context managers::
pt_br: Agora é possível controlar como as instâncias de :class:`asyncio.Server` começam a servir. Anteriormente, o servidor começaria a servir imediatamente após ser criado. O novo argumento nomeado *start_serving* para :meth:`loop.create_server() <asyncio.loop.create_server>` e :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, bem como :meth:`Server.start_serving() <asyncio.Server.start_serving>` e :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` podem ser usados para dissociar a instanciação e o serviço do servidor. O novo método :meth:`Server.is_serving() <asyncio.Server.is_serving>` retorna ``True`` se o servidor estiver servindo. Os objetos :class:`~asyncio.Server` agora são gerenciadores de contexto assíncronos::

source: (Contributed by Yury Selivanov in :issue:`32662`.)
pt_br: (Contribuição de Yury Selivanov em :issue:`32662`.)

source: Callback objects returned by :func:`loop.call_later() <asyncio.loop.call_later>` gained the new :meth:`when() <asyncio.TimerHandle.when>` method which returns an absolute scheduled callback timestamp. (Contributed by Andrew Svetlov in :issue:`32741`.)
pt_br: Objetos de retorno de chamada retornados por :func:`loop.call_later() <asyncio.loop.call_later>` ganharam o novo método :meth:`when() <asyncio.TimerHandle.when>` que retorna um registro de data e hora de retorno de chamada agendado absoluto. (Contribuição de Andrew Svetlov em :issue:`32741`.)

source: The :meth:`loop.create_datagram_endpoint() \ <asyncio.loop.create_datagram_endpoint>` method gained support for Unix sockets. (Contributed by Quentin Dawans in :issue:`31245`.)
pt_br: O método :meth:`loop.create_datagram_endpoint() \ <asyncio.loop.create_datagram_endpoint>` ganhou suporte para soquetes Unix. (Contribuição de Quentin Dawans em :issue:`31245`.)

source: The :func:`asyncio.open_connection`, :func:`asyncio.start_server` functions, :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio.loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>` methods and their corresponding UNIX socket variants now accept the *ssl_handshake_timeout* keyword argument. (Contributed by Neil Aspinall in :issue:`29970`.)
pt_br: As funções :func:`asyncio.open_connection`, :func:`asyncio.start_server`, os métodos :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio.loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>` e suas variantes de soquete UNIX correspondentes agora aceitam o argumento nomeado *ssl_handshake_timeout*. (Contribuição de Neil Aspinall em :issue:`29970`.)

source: The new :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` method returns ``True`` if the callback was cancelled. (Contributed by Marat Sharafutdinov in :issue:`31943`.)
pt_br: O novo método :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` retorna ``True`` se o retorno de chamada foi cancelado. (Contribuição de Marat Sharafutdinov em :issue:`31943`.)

source: The asyncio source has been converted to use the :keyword:`async`/:keyword:`await` syntax. (Contributed by Andrew Svetlov in :issue:`32193`.)
pt_br: A fonte de asyncio foi convertida para usar a sintaxe :keyword:`async`/:keyword:`await`. (Contribuição de Andrew Svetlov em :issue:`32193`.)

source: The new :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` method can be used to determine the reading state of the transport. Additionally, calls to :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` and :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` are now idempotent. (Contributed by Yury Selivanov in :issue:`32356`.)
pt_br: O novo método :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` pode ser usado para determinar o estado de leitura do transporte. Além disso, chamadas para :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` e :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` agora são idempotentes. (Contribuição de Yury Selivanov em :issue:`32356`.)

source: Loop methods which accept socket paths now support passing :term:`path-like objects <path-like object>`. (Contributed by Yury Selivanov in :issue:`32066`.)
pt_br: Методи циклу, які приймають шляхи до сокетів, тепер підтримують передачу :term:`path-подібних об’єктів <path-like object>`. (Надав Юрій Селіванов у :issue:`32066`.)

source: In :mod:`asyncio` TCP sockets on Linux are now created with ``TCP_NODELAY`` flag set by default. (Contributed by Yury Selivanov and Victor Stinner in :issue:`27456`.)
pt_br: У :mod:`asyncio` TCP-сокети в Linux тепер створюються з прапорцем ``TCP_NODELAY``, установленим за замовчуванням. (Надано Юрієм Селівановим і Віктором Стіннером у :issue:`27456`.)

source: Exceptions occurring in cancelled tasks are no longer logged. (Contributed by Yury Selivanov in :issue:`30508`.)
pt_br: Винятки, що виникають у скасованих завданнях, більше не реєструються. (Надав Юрій Селіванов у :issue:`30508`.)

source: New ``WindowsSelectorEventLoopPolicy`` and ``WindowsProactorEventLoopPolicy`` classes. (Contributed by Yury Selivanov in :issue:`33792`.)
pt_br: Нові класи ``WindowsSelectorEventLoopPolicy`` і ``WindowsProactorEventLoopPolicy``. (Надав Юрій Селіванов у :issue:`33792`.)

source: Several ``asyncio`` APIs have been :ref:`deprecated <whatsnew37-asyncio-deprecated>`.
pt_br: Кілька ``asyncio`` API були :ref:`застарілими <whatsnew37-asyncio-deprecated>`.

source: The :func:`~binascii.b2a_uu` function now accepts an optional *backtick* keyword argument. When it's true, zeros are represented by ``'`'`` instead of spaces. (Contributed by Xiang Zhang in :issue:`30103`.)
pt_br: Функція :func:`~binascii.b2a_uu` тепер приймає додатковий аргумент ключового слова *backtick*. Коли це істина, нулі представлені ``'`'`` замість пробілів. (Надав Xiang Zhang у :issue:`30103`.)

source: The :class:`~calendar.HTMLCalendar` class has new class attributes which ease the customization of CSS classes in the produced HTML calendar. (Contributed by Oz Tiram in :issue:`30095`.)
pt_br: Клас :class:`~calendar.HTMLCalendar` має нові атрибути класу, які спрощують налаштування класів CSS у створеному HTML-календарі. (Надав Оз Тірам у :issue:`30095`.)

source: ``collections.namedtuple()`` now supports default values. (Contributed by Raymond Hettinger in :issue:`32320`.)
pt_br: ``collections.namedtuple()`` тепер підтримує значення за замовчуванням. (Надав Реймонд Геттінгер у :issue:`32320`.)

source: :func:`compileall.compile_dir` learned the new *invalidation_mode* parameter, which can be used to enable :ref:`hash-based .pyc invalidation <whatsnew37-pep552>`. The invalidation mode can also be specified on the command line using the new ``--invalidation-mode`` argument. (Contributed by Benjamin Peterson in :issue:`31650`.)
pt_br: :func:`compileall.compile_dir` отримав новий параметр *invalidation_mode*, який можна використовувати для ввімкнення :ref:`анулювання .pyc на основі хешу <whatsnew37-pep552>`. Режим недійсності також можна вказати в командному рядку за допомогою нового аргументу ``--invalidation-mode``. (Надав Бенджамін Петерсон у :issue:`31650`.)

source: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` and :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` now support the new *initializer* and *initargs* constructor arguments. (Contributed by Antoine Pitrou in :issue:`21423`.)
pt_br: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` і :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` тепер підтримують нові аргументи конструктора *initializer* і *initargs*. (Надав Антуан Пітру в :issue:`21423`.)

source: The :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` can now take the multiprocessing context via the new *mp_context* argument. (Contributed by Thomas Moreau in :issue:`31540`.)
pt_br: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` тепер може приймати багатопроцесорний контекст за допомогою нового аргументу *mp_context*. (Надав Томас Моро в :issue:`31540`.)

source: The new :func:`~contextlib.nullcontext` is a simpler and faster no-op context manager than :class:`~contextlib.ExitStack`. (Contributed by Jesse-Bakker in :issue:`10049`.)
pt_br: Новий :func:`~contextlib.nullcontext` є простішим і швидшим безопераційним менеджером контексту, ніж :class:`~contextlib.ExitStack`. (Надано Jesse-Bakker у :issue:`10049`.)

source: The new :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager`, and :class:`~contextlib.AsyncExitStack` have been added to complement their synchronous counterparts. (Contributed by Jelle Zijlstra in :issue:`29679` and :issue:`30241`, and by Alexander Mohr and Ilya Kulakov in :issue:`29302`.)
pt_br: Нові :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager` і :class:`~contextlib.AsyncExitStack` додано, щоб доповнити їх синхронні аналоги. (Надано Джелле Зійлстра в :issue:`29679` і :issue:`30241`, а також Олександром Мором та Іллею Кулаковим у :issue:`29302`.)

source: The :mod:`cProfile` command line now accepts ``-m module_name`` as an alternative to script path. (Contributed by Sanyam Khurana in :issue:`21862`.)
pt_br: Командний рядок :mod:`cProfile` тепер приймає ``-m module_name`` як альтернативу шляху сценарію. (Надано Sanyam Khurana в :issue:`21862`.)

source: The :mod:`crypt` module now supports the Blowfish hashing method. (Contributed by Serhiy Storchaka in :issue:`31664`.)
pt_br: Модуль :mod:`crypt` тепер підтримує метод хешування Blowfish. (Надав Сергій Сторчака в :issue:`31664`.)

source: The :func:`~crypt.mksalt` function now allows specifying the number of rounds for hashing. (Contributed by Serhiy Storchaka in :issue:`31702`.)
pt_br: Функція :func:`~crypt.mksalt` тепер дозволяє вказувати кількість раундів для хешування. (Надав Сергій Сторчака в :issue:`31702`.)

source: The new :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` method constructs a :class:`~datetime.datetime` object from a string in one of the formats output by :meth:`datetime.isoformat() <datetime.datetime.isoformat>`. (Contributed by Paul Ganssle in :issue:`15873`.)
pt_br: Новий метод :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` створює об’єкт :class:`~datetime.datetime` із рядка в одному з форматів, виведених :meth:`datetime.isoformat() <datetime.datetime.isoformat>`. (Надав Пол Ганссле в :issue:`15873`.)

source: The :class:`tzinfo <datetime.tzinfo>` class now supports sub-minute offsets. (Contributed by Alexander Belopolsky in :issue:`5288`.)
pt_br: Клас :class:`tzinfo <datetime.tzinfo>` тепер підтримує субхвилинні зсуви. (Надав Олександр Бєлопольський у :issue:`5288`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed.
pt_br: :mod:`dbm.dumb` тепер підтримує читання файлів лише для читання та більше не записує файл індексу, якщо він не змінений.

source: The :mod:`decimal` module now uses :ref:`context variables <whatsnew37-pep567>` to store the decimal context. (Contributed by Yury Selivanov in :issue:`32630`.)
pt_br: Модуль :mod:`decimal` тепер використовує :ref:`контекстні змінні <whatsnew37-pep567>` для зберігання десяткового контексту. (Надав Юрій Селіванов у :issue:`32630`.)

source: The :func:`~dis.dis` function is now able to disassemble nested code objects (the code of comprehensions, generator expressions and nested functions, and the code used for building nested classes). The maximum depth of disassembly recursion is controlled by the new *depth* parameter. (Contributed by Serhiy Storchaka in :issue:`11822`.)
pt_br: Функція :func:`~dis.dis` тепер може розбирати об’єкти вкладеного коду (код розуміння, вирази генератора та вкладені функції, а також код, який використовується для створення вкладених класів). Максимальна глибина рекурсії розбирання контролюється новим параметром *depth*. (Надав Сергій Сторчака в :issue:`11822`.)

source: ``README.rst`` is now included in the list of distutils standard READMEs and therefore included in source distributions. (Contributed by Ryan Gonzalez in :issue:`11913`.)
pt_br: ``README.rst`` тепер включено до списку стандартних файлів README Distutils і, отже, включено до вихідних дистрибутивів. (Надав Райан Гонзалес у :issue:`11913`.)

source: The :class:`Enum <enum.Enum>` learned the new ``_ignore_`` class property, which allows listing the names of properties which should not become enum members. (Contributed by Ethan Furman in :issue:`31801`.)
pt_br: :class:`Enum <enum.Enum>` отримав нову властивість класу ``_ignore_``, яка дозволяє перераховувати назви властивостей, які не повинні стати членами переліку. (Надав Ітан Фурман у :issue:`31801`.)

source: In Python 3.8, attempting to check for non-Enum objects in :class:`Enum` classes will raise a :exc:`TypeError` (e.g. ``1 in Color``); similarly, attempting to check for non-Flag objects in a :class:`Flag` member will raise :exc:`TypeError` (e.g. ``1 in Perm.RW``); currently, both operations return :const:`False` instead and are deprecated. (Contributed by Ethan Furman in :issue:`33217`.)
pt_br: У Python 3.8 спроба перевірити об’єкти, відмінні від Enum, у класах :class:`Enum` викличе :exc:`TypeError` (наприклад, ``1 in Color``); аналогічно спроба перевірити об’єкти без прапорців у члені :class:`Flag` викличе :exc:`TypeError` (наприклад, ``1 in Perm.RW``); наразі обидві операції замість цього повертають :const:`False` і є застарілими. (Надав Ітан Фурман у :issue:`33217`.)

source: :func:`functools.singledispatch` now supports registering implementations using type annotations. (Contributed by Łukasz Langa in :issue:`32227`.)
pt_br: :func:`functools.singledispatch` тепер підтримує реєстрацію реалізацій за допомогою анотацій типів. (Надав Łukasz Langa в :issue:`32227`.)

source: The new :func:`gc.freeze` function allows freezing all objects tracked by the garbage collector and excluding them from future collections. This can be used before a POSIX ``fork()`` call to make the GC copy-on-write friendly or to speed up collection. The new :func:`gc.unfreeze` functions reverses this operation. Additionally, :func:`gc.get_freeze_count` can be used to obtain the number of frozen objects. (Contributed by Li Zekun in :issue:`31558`.)
pt_br: Нова функція :func:`gc.freeze` дозволяє заморозити всі об’єкти, які відстежує збирач сміття, і виключити їх із майбутніх колекцій. Це можна використовувати перед викликом POSIX ``fork()``, щоб зробити GC зручним для копіювання під час запису або прискорити збір. Нові функції :func:`gc.unfreeze` скасовують цю операцію. Крім того, :func:`gc.get_freeze_count` можна використовувати для отримання кількості заморожених об’єктів. (Надав Лі Зекун у :issue:`31558`.)

source: The :mod:`hmac` module now has an optimized one-shot :func:`~hmac.digest` function, which is up to three times faster than :func:`~hmac.HMAC`. (Contributed by Christian Heimes in :issue:`32433`.)
pt_br: Модуль :mod:`hmac` тепер має оптимізовану одноразову функцію :func:`~hmac.digest`, яка втричі швидша, ніж :func:`~hmac.HMAC`. (Надав Крістіан Хеймс у :issue:`32433`.)

source: :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` now support the new *blocksize* argument for improved upload throughput. (Contributed by Nir Soffer in :issue:`31945`.)
pt_br: :class:`~http.client.HTTPConnection` і :class:`~http.client.HTTPSConnection` тепер підтримують новий аргумент *blocksize* для покращення пропускної здатності завантаження. (Надав Нір Соффер у :issue:`31945`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` now supports the HTTP ``If-Modified-Since`` header. The server returns the 304 response status if the target file was not modified after the time specified in the header. (Contributed by Pierre Quentel in :issue:`29654`.)
pt_br: :class:`~http.server.SimpleHTTPRequestHandler` тепер підтримує заголовок HTTP ``If-Modified-Since``. Сервер повертає статус відповіді 304, якщо цільовий файл не було змінено після часу, зазначеного в заголовку. (Надано П’єром Квентелем у :issue:`29654`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` accepts the new *directory* argument, in addition to the new ``--directory`` command line argument. With this parameter, the server serves the specified directory, by default it uses the current working directory. (Contributed by Stéphane Wirtel and Julien Palard in :issue:`28707`.)
pt_br: :class:`~http.server.SimpleHTTPRequestHandler` приймає новий аргумент *directory* на додаток до нового аргументу командного рядка ``--directory``. З цим параметром сервер обслуговує вказаний каталог, за замовчуванням він використовує поточний робочий каталог. (Надано Стефаном Віртелем і Жюльєном Палардом у :issue:`28707`.)

source: The new :class:`ThreadingHTTPServer <http.server.ThreadingHTTPServer>` class uses threads to handle requests using :class:`~socketserver.ThreadingMixin`. It is used when ``http.server`` is run with ``-m``. (Contributed by Julien Palard in :issue:`31639`.)
pt_br: Новий клас :class:`ThreadingHTTPServer <http.server.ThreadingHTTPServer>` використовує потоки для обробки запитів за допомогою :class:`~socketserver.ThreadingMixin`. Він використовується, коли ``http.server`` запускається з ``-m``. (Надав Жюльєн Палард у :issue:`31639`.)

source: idlelib and IDLE
pt_br: idlelib e IDLE

source: Multiple fixes for autocompletion. (Contributed by Louie Lu in :issue:`15786`.)
pt_br: Кілька виправлень для автозавершення. (Надав Луї Лу в :issue:`15786`.)

source: Module Browser (on the File menu, formerly called Class Browser), now displays nested functions and classes in addition to top-level functions and classes. (Contributed by Guilherme Polo, Cheryl Sabella, and Terry Jan Reedy in :issue:`1612262`.)
pt_br: Браузер модулів (у меню "Файл", раніше називався "Браузер класів") тепер відображає вкладені функції та класи на додаток до функцій і класів верхнього рівня. (Надано Гільєрме Поло, Шеріл Сабелла та Террі Ян Ріді в :issue:`1612262`.)

source: The Settings dialog (Options, Configure IDLE) has been partly rewritten to improve both appearance and function. (Contributed by Cheryl Sabella and Terry Jan Reedy in multiple issues.)
pt_br: Діалогове вікно налаштувань (параметри, налаштування IDLE) було частково переписано, щоб покращити зовнішній вигляд і функції. (Надано Шеріл Сабеллою та Террі Джен Ріді в кількох випусках.)

source: The font sample now includes a selection of non-Latin characters so that users can better see the effect of selecting a particular font. (Contributed by Terry Jan Reedy in :issue:`13802`.) The sample can be edited to include other characters. (Contributed by Serhiy Storchaka in :issue:`31860`.)
pt_br: Зразок шрифту тепер містить вибірку нелатинських символів, щоб користувачі могли краще побачити ефект від вибору певного шрифту. (Надав Террі Ян Ріді в :issue:`13802`.) Зразок можна редагувати, щоб включити інші символи. (Надав Сергій Сторчака в :issue:`31860`.)

source: The IDLE features formerly implemented as extensions have been reimplemented as normal features. Their settings have been moved from the Extensions tab to other dialog tabs. (Contributed by Charles Wohlganger and Terry Jan Reedy in :issue:`27099`.)
pt_br: Функції IDLE, раніше реалізовані як розширення, були повторно реалізовані як звичайні функції. Їх налаштування переміщено з вкладки "Розширення" на інші вкладки діалогу. (Надано Чарльзом Волгангером і Террі Джаном Ріді в :issue:`27099`.)

source: Editor code context option revised. Box displays all context lines up to maxlines. Clicking on a context line jumps the editor to that line. Context colors for custom themes is added to Highlights tab of Settings dialog. (Contributed by Cheryl Sabella and Terry Jan Reedy in :issue:`33642`, :issue:`33768`, and :issue:`33679`.)
pt_br: Опцію контексту коду редактора переглянуто. Box відображає всі контекстні рядки до maxlines. Клацання на рядку контексту переводить редактор до цього рядка. Кольори контексту для спеціальних тем додано на вкладку "Висвітлення" діалогового вікна "Параметри". (Надано Шеріл Сабелла та Террі Ян Ріді в :issue:`33642`, :issue:`33768` та :issue:`33679`.)

source: On Windows, a new API call tells Windows that tk scales for DPI. On Windows 8.1+ or 10, with DPI compatibility properties of the Python binary unchanged, and a monitor resolution greater than 96 DPI, this should make text and lines sharper. It should otherwise have no effect. (Contributed by Terry Jan Reedy in :issue:`33656`.)
pt_br: У Windows новий виклик API повідомляє Windows, що tk масштабується для DPI. У Windows 8.1+ або 10 із незмінними властивостями сумісності DPI двійкового коду Python і роздільною здатністю монітора понад 96 DPI текст і лінії мають бути чіткішими. В іншому випадку це не повинно мати ефекту. (Надав Террі Ян Ріді в :issue:`33656`.)

source: New in 3.7.1:
pt_br: Yang Baru di 3.7.1:
