Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: What's New In Python 3.7
pt_br: O que há de novo no Python 3.7

source: This article explains the new features in Python 3.7, compared to 3.6. Python 3.7 was released on June 27, 2018. For full details, see the :ref:`changelog <changelog>`.
pt_br: Este artigo explica os novos recursos no Python 3.7, em comparação com 3.6. Python 3.7 foi lançado em 27 de Junho de 2018. Veja :ref:`changelog<changelog>` para uma lista completa de mudanças.

source: Summary -- Release Highlights
pt_br: Resumo -- Destaques da versão

source: New syntax features:
pt_br: Novos recursos de sintaxe:

source: :ref:`PEP 563 <whatsnew37-pep563>`, postponed evaluation of type annotations.
pt_br: :ref:`PEP 563 <whatsnew37-pep563>`, avaliação postergada de anotações de tipos.

source: Backwards incompatible syntax changes:
pt_br: Alterações de sintaxe incompatíveis com versões anteriores:

source: :keyword:`async` and :keyword:`await` are now reserved keywords.
pt_br: :keyword:`async` e :keyword:`await` são agora palavras chave reservadas.

source: New library modules:
pt_br: Novos módulos de biblioteca:

source: :mod:`contextvars`: :ref:`PEP 567 -- Context Variables <whatsnew37-pep567>`
pt_br: :mod:`contextvars`: :ref:`PEP 567 -- Variáveis de Contexto <whatsnew37-pep567>`

source: :mod:`dataclasses`: :ref:`PEP 557 -- Data Classes <whatsnew37-pep557>`
pt_br: :mod:`dataclasses`: :ref:`PEP 557 -- Classes de Dados <whatsnew37-pep557>`

source: New built-in features:
pt_br: Novos recursos embutidos:

source: :ref:`PEP 553 <whatsnew37-pep553>`, the new :func:`breakpoint` function.
pt_br: :ref:`PEP 553 <whatsnew37-pep553>`, a nova função :func:`breakpoint`.;

source: Python data model improvements:
pt_br: Melhorias no modelo de dados Python:

source: :ref:`PEP 562 <whatsnew37-pep562>`, customization of access to module attributes.
pt_br: :ref:`PEP 562 <whatsnew37-pep562>`, personalização de acesso aos atributos do módulo.

source: :ref:`PEP 560 <whatsnew37-pep560>`, core support for typing module and generic types.
pt_br: :ref:`PEP 560 <whatsnew37-pep560>`, suporte principal para o módulo typing e tipos genéricos.

source: the insertion-order preservation nature of :ref:`dict <typesmapping>` objects `has been declared`_ to be an official part of the Python language spec.
pt_br: a natureza de preservação da ordem de inserção de objetos :ref:`dict <typesmapping>` `foi declarada`_ como uma parte oficial da especificação da linguagem Python.

source: Significant improvements in the standard library:
pt_br: Melhorias significativas na biblioteca padrão:

source: The :mod:`asyncio` module has received new features, significant :ref:`usability and performance improvements <whatsnew37_asyncio>`.
pt_br: O módulo :mod:`asyncio` recebeu novos recursos, significativo à :ref:`melhorias de usabilidade e desempenho <whatsnew37_asyncio>`.

source: The :mod:`time` module gained support for :ref:`functions with nanosecond resolution <whatsnew37-pep564>`.
pt_br: O módulo :mod:`time` ganhou suporte para :ref:`funções com resolução de nanossegundos <whatsnew37-pep564>`.

source: CPython implementation improvements:
pt_br: Melhorias na implementação do CPython:

source: Avoiding the use of ASCII as a default text encoding:
pt_br: Evitando o uso de ASCII como a codificação de texto padrão:

source: :ref:`PEP 538 <whatsnew37-pep538>`, legacy C locale coercion
pt_br: :ref:`PEP 538 <whatsnew37-pep538>`, coerção de localidade C legada

source: :ref:`PEP 540 <whatsnew37-pep540>`, forced UTF-8 runtime mode
pt_br: :ref:`PEP 540 <whatsnew37-pep540>`, modo de tempo de execução UTF-8 forçado.

source: :ref:`PEP 552 <whatsnew37-pep552>`, deterministic .pycs
pt_br: :ref:`PEP 552 <whatsnew37-pep552>`, .pycs determinísticos

source: :ref:`New Python Development Mode <whatsnew37-devmode>`
pt_br: :ref:`Novo Modo de Desenvolvimento do Python <whatsnew37-devmode>`

source: :ref:`PEP 565 <whatsnew37-pep565>`, improved :exc:`DeprecationWarning` handling
pt_br: :ref:`PEP 565 <whatsnew37-pep565>`, aprimorada o tratamento de :exc:`DeprecationWarning`

source: C API improvements:
pt_br: Melhorias na API C:

source: :ref:`PEP 539 <whatsnew37-pep539>`, new C API for thread-local storage
pt_br: :ref:`PEP 539 <whatsnew37-pep539>`, nova API C para armazenamento local de thread

source: Documentation improvements:
pt_br: Melhorias na documentação:

source: :ref:`PEP 545 <whatsnew37-pep545>`, Python documentation translations
pt_br: :ref:`PEP 545 <whatsnew37-pep545>`, Traduções da documentação do Python

source: New documentation translations: `Japanese <https://docs.python.org/ja/>`_, `French <https://docs.python.org/fr/>`_, and `Korean <https://docs.python.org/ko/>`_.
pt_br: Novas traduções da documentação: `japonês <https://docs.python.org/ja/>`_, `francês <https://docs.python.org/fr/>`_ e `coreano <https://docs.python.org/ko/>`_.

source: This release features notable performance improvements in many areas. The :ref:`whatsnew37-perf` section lists them in detail.
pt_br: Esta versão apresenta melhorias de desempenho notáveis em muitas áreas. A seção :ref:`whatsnew37-perf` os lista em detalhes.

source: For a list of changes that may affect compatibility with previous Python releases please refer to the :ref:`porting-to-python-37` section.
pt_br: Para uma lista de mudanças que podem afetar a compatibilidade com versões anteriores do Python, consulte a seção :ref:`porting-to-python-37`.

source: New Features
pt_br: Novas funcionalidades

source: PEP 563: Postponed Evaluation of Annotations
pt_br: PEP 563: Avaliação Postergada de Anotações

source: The advent of type hints in Python uncovered two glaring usability issues with the functionality of annotations added in :pep:`3107` and refined further in :pep:`526`:
pt_br: O advento das dicas de tipo no Python revelou dois problemas de usabilidade gritantes com a funcionalidade das anotações adicionadas em :pep:`3107` e refinadas ainda mais em :pep:`526`:

source: annotations could only use names which were already available in the current scope, in other words they didn't support forward references of any kind; and
pt_br: as anotações só podiam usar nomes que já estavam disponíveis no escopo atual, ou seja, não suportavam referências de encaminhamento de nenhum tipo; e

source: annotating source code had adverse effects on startup time of Python programs.
pt_br: anotar o código-fonte teve efeitos adversos no tempo de inicialização dos programas Python.

source: Both of these issues are fixed by postponing the evaluation of annotations. Instead of compiling code which executes expressions in annotations at their definition time, the compiler stores the annotation in a string form equivalent to the AST of the expression in question. If needed, annotations can be resolved at runtime using :func:`typing.get_type_hints`. In the common case where this is not required, the annotations are cheaper to store (since short strings are interned by the interpreter) and make startup time faster.
pt_br: Ambos os problemas são corrigidos com o adiamento da avaliação das anotações. Em vez de compilar o código que executa expressões em anotações em seu tempo de definição, o compilador armazena a anotação em um formato de string equivalente ao AST da expressão em questão. Se necessário, as anotações podem ser resolvidas em tempo de execução usando :func:`digitando.get_type_hints`. No caso comum em que isso não é necessário, as anotações são mais baratas de armazenar (uma vez que strings curtas são internadas pelo interpretador) e tornam o tempo de inicialização mais rápido.

source: Usability-wise, annotations now support forward references, making the following syntax valid::
pt_br: Em termos de usabilidade, as anotações agora suportam referências futuras, tornando a seguinte sintaxe válida::

source: Since this change breaks compatibility, the new behavior needs to be enabled on a per-module basis in Python 3.7 using a :mod:`__future__` import::
pt_br: Como essa mudança quebra a compatibilidade, o novo comportamento precisa ser habilitado por módulo no Python 3.7 usando uma importação de :mod:`__future__` ::

source: It will become the default in Python 3.10.
pt_br: Ele se tornará o padrão no Python 3.10.

source: :pep:`563` -- Postponed evaluation of annotations
pt_br: :pep:`563` -- avaliação postergada de anotações de tipos

source: PEP written and implemented by Łukasz Langa.
pt_br: PEP escrita e implementada por Łukasz Langa.

source: PEP 538: Legacy C Locale Coercion
pt_br: PEP 538: Coerção de localidade C legada

source: An ongoing challenge within the Python 3 series has been determining a sensible default strategy for handling the "7-bit ASCII" text encoding assumption currently implied by the use of the default C or POSIX locale on non-Windows platforms.
pt_br: Um desafio contínuo dentro da série Python 3 tem sido determinar uma estratégia padrão sensata para lidar com a suposição de codificação de texto "ASCII de 7 bits" atualmente implícita pelo uso da localidade C ou POSIX padrão em plataformas não Windows.

source: :pep:`538` updates the default interpreter command line interface to automatically coerce that locale to an available UTF-8 based locale as described in the documentation of the new :envvar:`PYTHONCOERCECLOCALE` environment variable. Automatically setting ``LC_CTYPE`` this way means that both the core interpreter and locale-aware C extensions (such as :mod:`readline`) will assume the use of UTF-8 as the default text encoding, rather than ASCII.
pt_br: A :pep:`538` atualiza a interface de linha de comando do interpretador padrão para forçar automaticamente essa localidade para uma localidade baseada em UTF-8 disponível conforme descrito na documentação da nova variável de ambiente :envvar:`PYTHONCOERCECLOCALE`. Configurar automaticamente ``LC_CTYPE`` desta forma significa que tanto o interpretador central quanto as extensões C com reconhecimento da localidade (como :mod:`readline`) irão presumir o uso de UTF-8 como a codificação de texto padrão, ao invés de ASCII.

source: The platform support definition in :pep:`11` has also been updated to limit full text handling support to suitably configured non-ASCII based locales.
pt_br: A definição de suporte de plataforma na :pep:`11` também foi atualizada para limitar o suporte de manipulação de texto completo para localidades não baseadas em ASCII adequadamente configuradas.

source: As part of this change, the default error handler for :data:`~sys.stdin` and :data:`~sys.stdout` is now ``surrogateescape`` (rather than ``strict``) when using any of the defined coercion target locales (currently ``C.UTF-8``, ``C.utf8``, and ``UTF-8``). The default error handler for :data:`~sys.stderr` continues to be ``backslashreplace``, regardless of locale.
pt_br: Como parte dessa mudança, o tratador de erros padrão para :data:`~sys.stdin` e :data:`~sys.stdout` agora é ``surrogateescape`` (em vez de ``strict``) ao usar qualquer uma das localidades de destino de coerção definidas (atualmente ``C.UTF-8``, ``C.utf8`` e ``UTF-8``). O tratador de erros padrão para :data:`~sys.stderr` continua a ser ``backslashreplace``, independente da localidade.

source: Locale coercion is silent by default, but to assist in debugging potentially locale related integration problems, explicit warnings (emitted directly on :data:`~sys.stderr`) can be requested by setting ``PYTHONCOERCECLOCALE=warn``. This setting will also cause the Python runtime to emit a warning if the legacy C locale remains active when the core interpreter is initialized.
pt_br: A coerção de localidade é silenciosa por padrão, mas para ajudar na depuração de problemas de integração potencialmente relacionados à localidade, avisos explícitos (emitidos diretamente em :data:`~sys.stderr`) podem ser solicitados configurando ``PYTHONCOERCECLOCALE=warn``. Essa configuração também fará com que o tempo de execução do Python emita um aviso se a localidade C legada permanecer ativa quando o interpretador principal for inicializado.

source: While :pep:`538`'s locale coercion has the benefit of also affecting extension modules (such as GNU ``readline``), as well as child processes (including those running non-Python applications and older versions of Python), it has the downside of requiring that a suitable target locale be present on the running system. To better handle the case where no suitable target locale is available (as occurs on RHEL/CentOS 7, for example), Python 3.7 also implements :ref:`whatsnew37-pep540`.
pt_br: Embora a coerção de localidade :pep:`538` tenha o benefício de também afetar os módulos de extensão (como GNU ``readline``), bem como processos filhos (incluindo aqueles que executam aplicativos não Python e versões mais antigas do Python), tem a desvantagem de exigir que uma localidade de destino adequado esteja presente no sistema em execução. Para tratador melhor o caso em que nenhuma localidade de destino adequado está disponível (como ocorre no RHEL/CentOS 7, por exemplo), o Python 3.7 também implementa :ref:`whatsnew37-pep540`.

source: :pep:`538` -- Coercing the legacy C locale to a UTF-8 based locale
pt_br: :pep:`538` -- Forçando a localidade C legada para uma localidade baseada em UTF-8

source: PEP written and implemented by Nick Coghlan.
pt_br: PEP escrita e implementada por Nick Coghlan.

source: PEP 540: Forced UTF-8 Runtime Mode
pt_br: PEP 540: Modo de tempo de execução UTF-8 forçado

source: The new :option:`-X` ``utf8`` command line option and :envvar:`PYTHONUTF8` environment variable can be used to enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_br: A nova opção de linha de comando :option:`-X` ``utf8`` e a variável de ambiente :envvar:`PYTHONUTF8` podem ser usadas para habilitar o :ref:`modo UTF-8 do Python <utf8-mode>`.

source: When in UTF-8 mode, CPython ignores the locale settings, and uses the UTF-8 encoding by default. The error handlers for :data:`sys.stdin` and :data:`sys.stdout` streams are set to ``surrogateescape``.
pt_br: Quando no modo UTF-8, o CPython ignora as configurações de localidade e usa a codificação UTF-8 por padrão. Os tratador de erros para fluxos :data:`sys.stdin` e :data:`sys.stdout` são configurados para ``surrogateescape``.

source: The forced UTF-8 mode can be used to change the text handling behavior in an embedded Python interpreter without changing the locale settings of an embedding application.
pt_br: O modo UTF-8 forçado pode ser usado para alterar o comportamento de manipulação de texto em um interpretador Python embutido sem alterar as configurações de localidade de uma aplicação embutida.

source: While :pep:`540`'s UTF-8 mode has the benefit of working regardless of which locales are available on the running system, it has the downside of having no effect on extension modules (such as GNU ``readline``), child processes running non-Python applications, and child processes running older versions of Python. To reduce the risk of corrupting text data when communicating with such components, Python 3.7 also implements :ref:`whatsnew37-pep540`).
pt_br: Embora o modo UTF-8 da :pep:`540` tenha a vantagem de funcionar independentemente de quais localidades estão disponíveis no sistema em execução, ele tem a desvantagem de não ter efeito sobre os módulos de extensão (como GNU ``readline``) , processos filho executando aplicativos não-Python e processos filho executando versões anteriores do Python. Para reduzir o risco de corromper dados de texto ao se comunicar com tais componentes, o Python 3.7 também implementa :ref:`whatsnew37-pep540`).

source: The UTF-8 mode is enabled by default when the locale is ``C`` or ``POSIX``, and the :pep:`538` locale coercion feature fails to change it to a UTF-8 based alternative (whether that failure is due to ``PYTHONCOERCECLOCALE=0`` being set, ``LC_ALL`` being set, or the lack of a suitable target locale).
pt_br: O modo UTF-8 é habilitado por padrão quando a localidade é ``C`` ou ``POSIX``, e o recurso de coerção de localidade :pep:`538` falha em mudá-la para uma alternativa baseada em UTF-8 (seja falha é devido a ``PYTHONCOERCECLOCALE=0`` sendo definido, ``LC_ALL`` sendo definido, ou a falta de uma localidade de destino adequada).

source: :pep:`540` -- Add a new UTF-8 mode
pt_br: :pep:`540` -- Adiciona um novo modo UTF-8

source: PEP written and implemented by Victor Stinner
pt_br: PEP escrito e implementado por Victor Stinner

source: PEP 553: Built-in ``breakpoint()``
pt_br: PEP 553: ``breakpoint()`` embutida

source: Python 3.7 includes the new built-in :func:`breakpoint` function as an easy and consistent way to enter the Python debugger.
pt_br: Python 3.7 inclui a nova função embutida :func:`breakpoint` como uma maneira fácil e consistente de entrar no depurador Python.

source: Built-in ``breakpoint()`` calls :func:`sys.breakpointhook`. By default, the latter imports :mod:`pdb` and then calls ``pdb.set_trace()``, but by binding ``sys.breakpointhook()`` to the function of your choosing, ``breakpoint()`` can enter any debugger. Additionally, the environment variable :envvar:`PYTHONBREAKPOINT` can be set to the callable of your debugger of choice. Set ``PYTHONBREAKPOINT=0`` to completely disable built-in ``breakpoint()``.
pt_br: ``breakpoint()`` embutida chama :func:`sys.breakpointhook`. Por padrão, o último importa :mod:`pdb` e então chama ``pdb.set_trace()``, mas ao ligar ``sys.breakpointhook()`` à função de sua escolha, ``breakpoint()`` pode entrar em qualquer depurador. Além disso, a variável de ambiente :envvar:`PYTHONBREAKPOINT` pode ser configurada para o chamável de seu depurador de escolha. Defina ``PYTHONBREAKPOINT=0`` para desabilitar completamente o ``breakpoint()`` embutida.

source: :pep:`553` -- Built-in breakpoint()
pt_br: :pep:`553` -- breakpoint() embutida

source: PEP written and implemented by Barry Warsaw
pt_br: PEP escrita e implementada por Barry Warsaw

source: PEP 539: New C API for Thread-Local Storage
pt_br: PEP 539: Nova API C para armazenamento local de thread

source: While Python provides a C API for thread-local storage support; the existing :ref:`Thread Local Storage (TLS) API <thread-local-storage-api>` has used :c:expr:`int` to represent TLS keys across all platforms. This has not generally been a problem for officially support platforms, but that is neither POSIX-compliant, nor portable in any practical sense.
pt_br: Enquanto Python fornece uma API C para suporte de armazenamento local de thread; a existente :ref:`API da armazenamento local de thread (TLS) <thread-local-storage-api>` usou :c:expr:`int` para representar as chaves TLS em todas as plataformas. Isso geralmente não tem sido um problema para plataformas oficialmente suportadas, mas isso não é compatível com POSIX, nem portátil em qualquer sentido prático.

source: :pep:`539` changes this by providing a new :ref:`Thread Specific Storage (TSS) API <thread-specific-storage-api>` to CPython which supersedes use of the existing TLS API within the CPython interpreter, while deprecating the existing API. The TSS API uses a new type :c:type:`Py_tss_t` instead of :c:expr:`int` to represent TSS keys--an opaque type the definition of which may depend on the underlying TLS implementation. Therefore, this will allow to build CPython on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`.
pt_br: A :pep:`539` muda isso fornecendo uma nova :ref:`API de armazenamento específico de thread (TSS) <thread-specific-storage-api>` para CPython que substitui o uso da API de TLS existente dentro do interpretador CPython, enquanto descontinua a API existente. A API de TSS usa um novo tipo :c:type:`Py_tss_t` em vez de :c:expr:`int` para representar as chaves de TSS -- um tipo não visível cuja definição pode depender da implementação TLS subjacente. Portanto, isso permitirá construir CPython em plataformas onde a chave nativa de TLS é definida de uma forma que não pode ser convertida com segurança para :c:expr:`int`.

source: Note that on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`, all functions of the existing TLS API will be no-op and immediately return failure. This indicates clearly that the old API is not supported on platforms where it cannot be used reliably, and that no effort will be made to add such support.
pt_br: Observe que em plataformas onde a chave TLS nativa é definida de uma forma que não pode ser convertida com segurança para :c:expr:`int`, todas as funções da API TLS existente serão no-op e retornarão falha imediatamente. Isso indica claramente que a API antiga não é suportada em plataformas onde não pode ser usada de forma confiável e que nenhum esforço será feito para adicionar tal suporte.

source: :pep:`539` -- A New C-API for Thread-Local Storage in CPython
pt_br: :pep:`539` -- Uma nova API C para armazenamento local de thread no CPython

source: PEP written by Erik M. Bray; implementation by Masayuki Yamamoto.
pt_br: PEP escrita por Erik M. Bray; implementação por Masayuki Yamamoto.

source: PEP 562: Customization of Access to Module Attributes
pt_br: PEP 562: Personalização de acesso aos atributos do módulo

source: Python 3.7 allows defining :meth:`__getattr__` on modules and will call it whenever a module attribute is otherwise not found. Defining :meth:`__dir__` on modules is now also allowed.
pt_br: Python 3.7 permite definir :meth:`__getattr__` em módulos e irá chamá-lo sempre que um atributo de módulo não for encontrado. Definir :meth:`__dir__` em módulos agora também é permitido.

source: A typical example of where this may be useful is module attribute deprecation and lazy loading.
pt_br: Um exemplo típico de onde isso pode ser útil é a descontinuação do atributo do módulo e o carregamento preguiçoso ou *lazy*.

source: :pep:`562` -- Module ``__getattr__`` and ``__dir__``
pt_br: :pep:`562` -- Módulo ``__getattr__`` e ``__dir__``

source: PEP written and implemented by Ivan Levkivskyi
pt_br: PEP escrita e implementada por Ivan Levkivskyi

source: PEP 564: New Time Functions With Nanosecond Resolution
pt_br: PEP 564: Novas funções de tempo com resolução de nanossegundos

source: The resolution of clocks in modern systems can exceed the limited precision of a floating point number returned by the :func:`time.time` function and its variants. To avoid loss of precision, :pep:`564` adds six new "nanosecond" variants of the existing timer functions to the :mod:`time` module:
pt_br: A resolução dos relógios em sistemas modernos pode exceder a precisão limitada de um número de ponto flutuante retornado pela função :func:`time.time` e suas variantes. Para evitar perda de precisão, :pep:`564` adiciona seis novas variantes em "nanossegundos" das funções de temporizador existentes ao módulo :mod:`time`:

source: The new functions return the number of nanoseconds as an integer value.
pt_br: As novas funções retornam o número de nanossegundos como um valor inteiro.

source: `Measurements <https://peps.python.org/pep-0564/#annex-clocks-resolution-in-python>`_ show that on Linux and Windows the resolution of :func:`time.time_ns` is approximately 3 times better than that of :func:`time.time`.
pt_br: `Medições <https://peps.python.org/pep-0564/#annex-clocks-resolution-in-python>`_ mostram que no Linux e no Windows a resolução de :func:`time.time_ns` é aproximadamente 3 vezes melhor do que :func:`time.time`.

source: :pep:`564` -- Add new time functions with nanosecond resolution
pt_br: :pep:`564` -- Adiciona novas funções de tempo com resolução de nanossegundos

source: PEP 565: Show DeprecationWarning in ``__main__``
pt_br: PEP 565: Mostra DeprecationWarning em ``__main__``
