Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
pt_br: A saída em N linhas (50 por padrão) é compactada até um limite inferior. N pode ser alterado na seção PyShell da página General da caixa de diálogo Settings. Menos linhas, mas possivelmente extra longas, podem ser espremidas clicando com o botão direito do mouse na saída. A saída compactada pode ser expandida no local clicando duas vezes no botão ou na área de transferência ou em uma janela separada clicando com o botão direito do mouse. (Contribuição de Tal Einat em :issue:`1529353`.)

source: The changes above have been backported to 3.6 maintenance releases.
pt_br: Зазначені вище зміни було перенесено до випусків обслуговування 3.6.

source: NEW in 3.7.4:
pt_br: BARU di 3.7.4:

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
pt_br: Додайте "Run Customized" до меню "Run", щоб запустити модуль із налаштованими налаштуваннями. Будь-які введені аргументи командного рядка додаються до sys.argv. Вони знову з’являються в полі для наступного налаштованого запуску. Можна також придушити звичайний перезапуск головного модуля Shell. (Надано Шеріл Сабелла, Террі Ян Ріді та іншими в :issue:`5680` і :issue:`37627`.)

source: New in 3.7.5:
pt_br: Baru di 3.7.5:

source: Add optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
pt_br: Додайте додаткові номери рядків для вікон редактора IDLE. Вікна відкриваються без номерів рядків, якщо не встановлено інше на вкладці "Загальні" діалогового вікна налаштування. Номери рядків для існуючого вікна відображаються та ховаються в меню "Параметри". (Надано Тал Ейнат і Саймадхав Геблікар у :issue:`17535`.)

source: The :class:`importlib.abc.ResourceReader` ABC was introduced to support the loading of resources from packages. See also :ref:`whatsnew37_importlib_resources`. (Contributed by Barry Warsaw, Brett Cannon in :issue:`32248`.)
pt_br: :class:`importlib.abc.ResourceReader` ABC було представлено для підтримки завантаження ресурсів із пакетів. Дивіться також :ref:`whatsnew37_importlib_resources`. (Надано Баррі Варшау, Бреттом Кенноном у :issue:`32248`.)

source: :func:`importlib.reload` now raises :exc:`ModuleNotFoundError` if the module lacks a spec. (Contributed by Garvit Khatri in :issue:`29851`.)
pt_br: :func:`importlib.reload` тепер викликає :exc:`ModuleNotFoundError`, якщо модуль не має специфікації. (Надав Гарвіт Хатрі в :issue:`29851`.)

source: :func:`importlib.find_spec` now raises :exc:`ModuleNotFoundError` instead of :exc:`AttributeError` if the specified parent module is not a package (i.e. lacks a ``__path__`` attribute). (Contributed by Milan Oberkirch in :issue:`30436`.)
pt_br: :func:`importlib.find_spec` тепер викликає :exc:`ModuleNotFoundError` замість :exc:`AttributeError`, якщо вказаний батьківський модуль не є пакетом (тобто не має атрибута ``__path__``). (Надав Мілан Оберкірх у :issue:`30436`.)

source: The new :func:`importlib.source_hash` can be used to compute the hash of the passed source. A :ref:`hash-based .pyc file <whatsnew37-pep552>` embeds the value returned by this function.
pt_br: Новий :func:`importlib.source_hash` можна використовувати для обчислення хешу переданого джерела. :ref:`файл .pyc на основі хешу <whatsnew37-pep552>` вбудовує значення, яке повертає ця функція.

source: The new :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` method can be used to reconfigure the text stream with the new settings. (Contributed by Antoine Pitrou in :issue:`30526` and INADA Naoki in :issue:`15216`.)
pt_br: Новий метод :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` можна використовувати для переналаштування текстового потоку з новими налаштуваннями. (Надано Антуаном Пітру в :issue:`30526` та INADA Naoki в :issue:`15216`.)

source: The new ``subnet_of()`` and ``supernet_of()`` methods of :class:`ipaddress.IPv6Network` and :class:`ipaddress.IPv4Network` can be used for network containment tests. (Contributed by Michel Albert and Cheryl Sabella in :issue:`20825`.)
pt_br: Нові методи ``subnet_of()`` і ``supernet_of()`` :class:`ipaddress.IPv6Network` і :class:`ipaddress.IPv4Network` можна використовувати для перевірки обмеження мережі. (Надано Мішелем Альбертом і Шеріл Сабеллою в :issue:`20825`.)

source: :func:`itertools.islice` now accepts :meth:`integer-like objects <object.__index__>` as start, stop, and slice arguments. (Contributed by Will Roberts in :issue:`30537`.)
pt_br: :func:`itertools.islice` тепер приймає :meth:`цілочисельні об’єкти <object.__index__>` як аргументи запуску, зупинки та фрагмента. (Надав Вілл Робертс у :issue:`30537`.)

source: The new *monetary* argument to :func:`locale.format_string` can be used to make the conversion use monetary thousands separators and grouping strings. (Contributed by Garvit in :issue:`10379`.)
pt_br: Новий аргумент *monetary* для :func:`locale.format_string` можна використовувати, щоб перетворення використовувало грошові розділювачі тисяч і рядки групування. (Надано Гарвітом у :issue:`10379`.)

source: The :func:`locale.getpreferredencoding` function now always returns ``'UTF-8'`` on Android or when in the :ref:`forced UTF-8 mode <whatsnew37-pep540>`.
pt_br: Функція :func:`locale.getpreferredencoding` тепер завжди повертає ``'UTF-8'`` на Android або в :ref:`примусовому режимі UTF-8 <whatsnew37-pep540>`.

source: :class:`~logging.Logger` instances can now be pickled. (Contributed by Vinay Sajip in :issue:`30520`.)
pt_br: Тепер екземпляри :class:`~logging.Logger` можна маринувати. (Надав Віней Саджип у :issue:`30520`.)

source: The new :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` method can be used to replace the logger stream after handler creation. (Contributed by Vinay Sajip in :issue:`30522`.)
pt_br: Новий метод :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` можна використовувати для заміни потоку реєстратора після створення обробника. (Надав Віней Саджип у :issue:`30522`.)

source: It is now possible to specify keyword arguments to handler constructors in configuration passed to :func:`logging.config.fileConfig`. (Contributed by Preston Landers in :issue:`31080`.)
pt_br: Тепер можна вказати ключові аргументи для конструкторів обробників у конфігурації, переданій у :func:`logging.config.fileConfig`. (Надано Престоном Лендерсом у :issue:`31080`.)

source: The new :func:`math.remainder` function implements the IEEE 754-style remainder operation. (Contributed by Mark Dickinson in :issue:`29962`.)
pt_br: Нова функція :func:`math.remainder` реалізує операцію залишку у стилі IEEE 754. (Надав Марк Дікінсон у :issue:`29962`.)

source: The MIME type of .bmp has been changed from ``'image/x-ms-bmp'`` to ``'image/bmp'``. (Contributed by Nitish Chandra in :issue:`22589`.)
pt_br: Тип MIME .bmp змінено з ``'image/x-ms-bmp`` на ``'image/bmp'``. (Надано Nitish Chandra в :issue:`22589`.)

source: The new :meth:`Database.Close() <msilib.Database.Close>` method can be used to close the :abbr:`MSI` database. (Contributed by Berker Peksag in :issue:`20486`.)
pt_br: Новий метод :meth:`Database.Close() <msilib.Database.Close>` можна використовувати для закриття бази даних :abbr:`MSI`. (Надано Berker Peksag у :issue:`20486`.)

source: The new :meth:`Process.close() <multiprocessing.Process.close>` method explicitly closes the process object and releases all resources associated with it. :exc:`ValueError` is raised if the underlying process is still running. (Contributed by Antoine Pitrou in :issue:`30596`.)
pt_br: Новий метод :meth:`Process.close() <multiprocessing.Process.close>` явно закриває об’єкт процесу та звільняє всі пов’язані з ним ресурси. :exc:`ValueError` виникає, якщо основний процес все ще виконується. (Надав Антуан Пітру в :issue:`30596`.)

source: The new :meth:`Process.kill() <multiprocessing.Process.kill>` method can be used to terminate the process using the :data:`SIGKILL` signal on Unix. (Contributed by Vitor Pereira in :issue:`30794`.)
pt_br: Новий метод :meth:`Process.kill() <multiprocessing.Process.kill>` можна використовувати для завершення процесу за допомогою сигналу :data:`SIGKILL` в Unix. (Надав Вітор Перейра в :issue:`30794`.)

source: Non-daemonic threads created by :class:`~multiprocessing.Process` are now joined on process exit. (Contributed by Antoine Pitrou in :issue:`18966`.)
pt_br: Недемонічні потоки, створені :class:`~multiprocessing.Process`, тепер об’єднуються після виходу з процесу. (Надав Антуан Пітру в :issue:`18966`.)

source: :func:`os.fwalk` now accepts the *path* argument as :class:`bytes`. (Contributed by Serhiy Storchaka in :issue:`28682`.)
pt_br: :func:`os.fwalk` тепер приймає аргумент *path* як :class:`bytes`. (Надав Сергій Сторчака в :issue:`28682`.)

source: :func:`os.scandir` gained support for :ref:`file descriptors <path_fd>`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
pt_br: :func:`os.scandir` отримав підтримку для :ref:`дескрипторів файлів <path_fd>`. (Надав Сергій Сторчака в :issue:`25996`.)

source: The new :func:`~os.register_at_fork` function allows registering Python callbacks to be executed at process fork. (Contributed by Antoine Pitrou in :issue:`16500`.)
pt_br: Нова функція :func:`~os.register_at_fork` дозволяє реєструвати зворотні виклики Python для виконання в розгалуженні процесу. (Надав Антуан Пітру в :issue:`16500`.)

source: Added :func:`os.preadv` (combine the functionality of :func:`os.readv` and :func:`os.pread`) and :func:`os.pwritev` functions (combine the functionality of :func:`os.writev` and :func:`os.pwrite`). (Contributed by Pablo Galindo in :issue:`31368`.)
pt_br: Додано функції :func:`os.preadv` (поєднує функції :func:`os.readv` і :func:`os.pread`) і :func:`os.pwritev` (поєднує функції :func:`os.writev` і :func:`os.pwrite`). (Надав Пабло Галіндо в :issue:`31368`.)

source: The mode argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. (Contributed by Serhiy Storchaka in :issue:`19930`.)
pt_br: Аргумент режима :func:`os.madeirs` больше не влияет на биты прав доступа к файлам вновь созданных каталогов промежуточного уровня. (Предоставлено Сергеем Сторчакой в ​​:issue:`19930`.)

source: :func:`os.dup2` now returns the new file descriptor. Previously, ``None`` was always returned. (Contributed by Benjamin Peterson in :issue:`32441`.)
pt_br: :func:`os.dup2` тепер повертає новий дескриптор файлу. Раніше завжди повертався ``None``. (Надав Бенджамін Петерсон у :issue:`32441`.)

source: The structure returned by :func:`os.stat` now contains the :attr:`~os.stat_result.st_fstype` attribute on Solaris and its derivatives. (Contributed by Jesús Cea Avión in :issue:`32659`.)
pt_br: Структура, яку повертає :func:`os.stat`, тепер містить атрибут :attr:`~os.stat_result.st_fstype` у Solaris та його похідних. (Надав Jesús Cea Avión у :issue:`32659`.)

source: The new :meth:`Path.is_mount() <pathlib.Path.is_mount>` method is now available on POSIX systems and can be used to determine whether a path is a mount point. (Contributed by Cooper Ry Lees in :issue:`30897`.)
pt_br: Новий метод :meth:`Path.is_mount() <pathlib.Path.is_mount>` тепер доступний у системах POSIX і може використовуватися для визначення того, чи є шлях точкою монтування. (Надав Купер Рай Ліз у :issue:`30897`.)

source: :func:`pdb.set_trace` now takes an optional *header* keyword-only argument. If given, it is printed to the console just before debugging begins. (Contributed by Barry Warsaw in :issue:`31389`.)
pt_br: :func:`pdb.set_trace` тепер приймає необов’язковий аргумент *заголовок*, що містить лише ключове слово. Якщо вказано, воно друкується на консолі безпосередньо перед початком налагодження. (Надав Баррі Варшау у :issue:`31389`.)

source: :mod:`pdb` command line now accepts ``-m module_name`` as an alternative to script file. (Contributed by Mario Corchero in :issue:`32206`.)
pt_br: :mod:`pdb` командний рядок тепер приймає ``-m module_name`` як альтернативу файлу сценарію. (Надав Маріо Корчеро в :issue:`32206`.)

source: :func:`py_compile.compile` -- and by extension, :mod:`compileall` -- now respects the :envvar:`SOURCE_DATE_EPOCH` environment variable by unconditionally creating ``.pyc`` files for hash-based validation. This allows for guaranteeing `reproducible builds <https://reproducible-builds.org/>`_ of ``.pyc`` files when they are created eagerly. (Contributed by Bernhard M. Wiedemann in :issue:`29708`.)
pt_br: :func:`py_compile.compile` -- і за розширенням :mod:`compileall` -- тепер поважає змінну середовища :envvar:`SOURCE_DATE_EPOCH` шляхом безумовного створення файлів ``.pyc`` для перевірки на основі хешу. Це дозволяє гарантувати `відтворювані збірки <https://reproducible-builds.org/>`_ файлів ``.pyc``, коли вони створюються з бажанням. (Надав Бернхард М. Відеманн у :issue:`29708`.)

source: The pydoc server can now bind to an arbitrary hostname specified by the new ``-n`` command-line argument. (Contributed by Feanil Patel in :issue:`31128`.)
pt_br: Сервер pydoc тепер може прив’язуватися до довільного імені хоста, визначеного новим аргументом командного рядка ``-n``. (Надав Feanil Patel у :issue:`31128`.)

source: The new :class:`~queue.SimpleQueue` class is an unbounded :abbr:`FIFO` queue. (Contributed by Antoine Pitrou in :issue:`14976`.)
pt_br: Новий клас :class:`~queue.SimpleQueue` є необмеженою чергою :abbr:`FIFO`. (Надав Антуан Пітру в :issue:`14976`.)

source: The flags :const:`re.ASCII`, :const:`re.LOCALE` and :const:`re.UNICODE` can be set within the scope of a group. (Contributed by Serhiy Storchaka in :issue:`31690`.)
pt_br: Прапори :const:`re.ASCII`, :const:`re.LOCALE` і :const:`re.UNICODE` можна встановити в межах групи. (Надав Сергій Сторчака в :issue:`31690`.)

source: :func:`re.split` now supports splitting on a pattern like ``r'\b'``, ``'^$'`` or ``(?=-)`` that matches an empty string. (Contributed by Serhiy Storchaka in :issue:`25054`.)
pt_br: :func:`re.split` тепер підтримує розбиття за шаблоном, таким як ``r'\b'``, ``'^$'`` або ``(?=-)``, який відповідає порожньому рядку. (Надав Сергій Сторчака в :issue:`25054`.)

source: Regular expressions compiled with the :const:`re.LOCALE` flag no longer depend on the locale at compile time. Locale settings are applied only when the compiled regular expression is used. (Contributed by Serhiy Storchaka in :issue:`30215`.)
pt_br: Регулярні вирази, скомпільовані з прапорцем :const:`re.LOCALE`, більше не залежать від локалі під час компіляції. Параметри мови застосовуються лише тоді, коли використовується скомпільований регулярний вираз. (Надав Сергій Сторчака в :issue:`30215`.)

source: :exc:`FutureWarning` is now emitted if a regular expression contains character set constructs that will change semantically in the future, such as nested sets and set operations. (Contributed by Serhiy Storchaka in :issue:`30349`.)
pt_br: :exc:`FutureWarning` тепер видається, якщо регулярний вираз містить конструкції набору символів, які зміняться семантично в майбутньому, наприклад вкладені набори та операції з наборами. (Надав Сергій Сторчака в :issue:`30349`.)

source: Compiled regular expression and match objects can now be copied using :func:`copy.copy` and :func:`copy.deepcopy`. (Contributed by Serhiy Storchaka in :issue:`10076`.)
pt_br: Зкомпільований регулярний вираз і відповідні об’єкти тепер можна копіювати за допомогою :func:`copy.copy` і :func:`copy.deepcopy`. (Надав Сергій Сторчака в :issue:`10076`.)

source: The new *warn_on_full_buffer* argument to the :func:`signal.set_wakeup_fd` function makes it possible to specify whether Python prints a warning on stderr when the wakeup buffer overflows. (Contributed by Nathaniel J. Smith in :issue:`30050`.)
pt_br: Новий аргумент *warn_on_full_buffer* для функції :func:`signal.set_wakeup_fd` дає змогу вказати, чи друкує Python попередження на stderr у разі переповнення буфера пробудження. (Надано Натаніелем Дж. Смітом у :issue:`30050`.)

source: The new :func:`socket.getblocking() <socket.socket.getblocking>` method returns ``True`` if the socket is in blocking mode and ``False`` otherwise. (Contributed by Yury Selivanov in :issue:`32373`.)
pt_br: Новий метод :func:`socket.getblocking() <socket.socket.getblocking>` повертає ``True``, якщо сокет перебуває в режимі блокування, і ``False`` в іншому випадку. (Надав Юрій Селіванов у :issue:`32373`.)

source: The new :func:`socket.close` function closes the passed socket file descriptor. This function should be used instead of :func:`os.close` for better compatibility across platforms. (Contributed by Christian Heimes in :issue:`32454`.)
pt_br: Нова функція :func:`socket.close` закриває переданий дескриптор файлу сокета. Цю функцію слід використовувати замість :func:`os.close` для кращої сумісності між платформами. (Надав Крістіан Хеймс у :issue:`32454`.)

source: The :mod:`socket` module now exposes the :const:`socket.TCP_CONGESTION` (Linux 2.6.13), :const:`socket.TCP_USER_TIMEOUT` (Linux 2.6.37), and :const:`socket.TCP_NOTSENT_LOWAT` (Linux 3.12) constants. (Contributed by Omar Sandoval in :issue:`26273` and Nathaniel J. Smith in :issue:`29728`.)
pt_br: Модуль :mod:`socket` теперь предоставляет :const:`socket.TCP_CONGESTION` (Linux 2.6.13), :const:`socket.TCP_USER_TIMEOUT` (Linux 2.6.37) и :const:`socket.TCP_NOTSENT_LOWAT` (Linux 3.12) константы. (Предоставлено Омаром Сандовалем в :issue:`26273` и Натаниэлем Дж. Смитом в :issue:`29728`.)

source: Support for :const:`socket.AF_VSOCK` sockets has been added to allow communication between virtual machines and their hosts. (Contributed by Cathy Avery in :issue:`27584`.)
pt_br: Добавлена ​​поддержка сокетов :const:`socket.AF_VSOCK` для обеспечения связи между виртуальными машинами и их хостами. (Предоставлено Кэти Эйвери в :issue:`27584`.)

source: Sockets now auto-detect family, type and protocol from file descriptor by default. (Contributed by Christian Heimes in :issue:`28134`.)
pt_br: Тепер сокети за замовчуванням автоматично визначають сімейство, тип і протокол із файлового дескриптора. (Надав Крістіан Хеймс у :issue:`28134`.)

source: :meth:`socketserver.ThreadingMixIn.server_close` now waits until all non-daemon threads complete. :meth:`socketserver.ForkingMixIn.server_close` now waits until all child processes complete.
pt_br: :meth:`socketserver.ThreadingMixIn.server_close` тепер чекає, поки завершаться всі потоки, що не є демонами. :meth:`socketserver.ForkingMixIn.server_close` тепер очікує, поки завершаться всі дочірні процеси.

source: Add a new :attr:`socketserver.ForkingMixIn.block_on_close` class attribute to :class:`socketserver.ForkingMixIn` and :class:`socketserver.ThreadingMixIn` classes. Set the class attribute to ``False`` to get the pre-3.7 behaviour.
pt_br: Додайте новий атрибут класу :attr:`socketserver.ForkingMixIn.block_on_close` до класів :class:`socketserver.ForkingMixIn` і :class:`socketserver.ThreadingMixIn`. Встановіть атрибут класу на ``False``, щоб отримати поведінку до 3.7.

source: :class:`sqlite3.Connection` now exposes the :meth:`~sqlite3.Connection.backup` method when the underlying SQLite library is at version 3.6.11 or higher. (Contributed by Lele Gaifax in :issue:`27645`.)
pt_br: :class:`sqlite3.Connection` тепер надає метод :meth:`~sqlite3.Connection.backup`, якщо базова бібліотека SQLite має версію 3.6.11 або новішу. (Надано Леле Гайфакс у :issue:`27645`.)

source: The *database* argument of :func:`sqlite3.connect` now accepts any :term:`path-like object`, instead of just a string. (Contributed by Anders Lorentsen in :issue:`31843`.)
pt_br: Аргумент *database* :func:`sqlite3.connect` тепер приймає будь-який :term:`path-like object`, а не просто рядок. (Надав Андерс Лоренцен у :issue:`31843`.)

source: The :mod:`ssl` module now uses OpenSSL's builtin API instead of :func:`~ssl.match_hostname` to check a host name or an IP address. Values are validated during TLS handshake. Any certificate validation error including failing the host name check now raises :exc:`~ssl.SSLCertVerificationError` and aborts the handshake with a proper TLS Alert message. The new exception contains additional information. Host name validation can be customized with :attr:`SSLContext.hostname_checks_common_name <ssl.SSLContext.hostname_checks_common_name>`. (Contributed by Christian Heimes in :issue:`31399`.)
pt_br: Модуль :mod:`ssl` тепер використовує вбудований API OpenSSL замість :func:`~ssl.match_hostname` для перевірки імені хоста або IP-адреси. Значення перевіряються під час рукостискання TLS. Будь-яка помилка перевірки сертифіката, включно з помилкою перевірки імені хоста, тепер викликає :exc:`~ssl.SSLCertVerificationError` і перериває рукостискання з належним повідомленням сповіщення TLS. Новий виняток містить додаткову інформацію. Перевірку імені хоста можна налаштувати за допомогою :attr:`SSLContext.hostname_checks_common_name <ssl.SSLContext.hostname_checks_common_name>`. (Надав Крістіан Хеймс у :issue:`31399`.)

source: The improved host name check requires a *libssl* implementation compatible with OpenSSL 1.0.2 or 1.1. Consequently, OpenSSL 0.9.8 and 1.0.1 are no longer supported (see :ref:`37-platform-support-removals` for more details). The ssl module is mostly compatible with LibreSSL 2.7.2 and newer.
pt_br: Покращена перевірка імені хоста вимагає реалізації *libssl*, сумісної з OpenSSL 1.0.2 або 1.1. Відповідно, OpenSSL 0.9.8 і 1.0.1 більше не підтримуються (див. :ref:`37-platform-support-removals` для отримання додаткової інформації). Модуль ssl здебільшого сумісний із LibreSSL 2.7.2 і новішими версіями.

source: The ``ssl`` module no longer sends IP addresses in SNI TLS extension. (Contributed by Christian Heimes in :issue:`32185`.)
pt_br: Модуль ``ssl`` більше не надсилає IP-адреси в розширенні SNI TLS. (Надав Крістіан Хеймс у :issue:`32185`.)

source: :func:`~ssl.match_hostname` no longer supports partial wildcards like ``www*.example.org``. (Contributed by Mandeep Singh in :issue:`23033` and Christian Heimes in :issue:`31399`.)
pt_br: :func:`~ssl.match_hostname` більше не підтримує часткові символи підстановки, такі як ``www*.example.org``. (Надано Мандіпом Сінгхом у :issue:`23033` та Крістіаном Хеймсом у :issue:`31399`.)

source: The default cipher suite selection of the ``ssl`` module now uses a blacklist approach rather than a hard-coded whitelist. Python no longer re-enables ciphers that have been blocked by OpenSSL security updates. Default cipher suite selection can be configured at compile time. (Contributed by Christian Heimes in :issue:`31429`.)
pt_br: Вибір набору шифрів за замовчуванням модуля ``ssl`` тепер використовує підхід чорного списку, а не жорстко закодований білий список. Python більше не вмикає повторно шифри, які були заблоковані оновленнями безпеки OpenSSL. Вибір набору шифрів за замовчуванням можна налаштувати під час компіляції. (Надав Крістіан Хеймс у :issue:`31429`.)
