Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: The fields :c:member:`!name` and :c:member:`!doc` of structures :c:type:`PyMemberDef`, :c:type:`PyGetSetDef`, :c:type:`PyStructSequence_Field`, :c:type:`PyStructSequence_Desc`, and :c:struct:`wrapperbase` are now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`28761`.)
pt_br: Поля :c:member:`!name` и :c:member:`!doc` структур :c:type:`PyMemberDef`, :c:type:`PyGetSetDef`, :c:type:`PyStructSequence_Field`, :c:type:`PyStructSequence_Desc` и :c:struct:`wrapperbase` теперь имеют тип ``const char *``, а не ``char *``. (Предоставлено Сергеем Сторчакой в ​​:issue:`28761`.)

source: The result of :c:func:`PyUnicode_AsUTF8AndSize` and :c:func:`PyUnicode_AsUTF8` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`28769`.)
pt_br: Результат :c:func:`PyUnicode_AsUTF8AndSize` і :c:func:`PyUnicode_AsUTF8` тепер має тип ``const char *``, а не ``char *``. (Надав Сергій Сторчака в :issue:`28769`.)

source: The result of :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` and :c:func:`PyMapping_Items` is now always a list, rather than a list or a tuple. (Contributed by Oren Milman in :issue:`28280`.)
pt_br: Результатом :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` і :c:func:`PyMapping_Items` тепер завжди є список, а не список або кортеж. (Надав Орен Мілман у :issue:`28280`.)

source: Added functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
pt_br: Додано функції :c:func:`PySlice_Unpack` і :c:func:`PySlice_AdjustIndices`. (Надав Сергій Сторчака в :issue:`27867`.)

source: :c:func:`PyOS_AfterFork` is deprecated in favour of the new functions :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`. (Contributed by Antoine Pitrou in :issue:`16500`.)
pt_br: :c:func:`PyOS_AfterFork` застаріла на користь нових функцій :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` і :c:func:`PyOS_AfterFork_Child`. (Надав Антуан Пітру в :issue:`16500`.)

source: The ``PyExc_RecursionErrorInst`` singleton that was part of the public API has been removed as its members being never cleared may cause a segfault during finalization of the interpreter. Contributed by Xavier de Gaye in :issue:`22898` and :issue:`30697`.
pt_br: Синглтон ``PyExc_RecursionErrorInst``, який був частиною загальнодоступного API, було видалено, оскільки його члени, які ніколи не очищалися, можуть спричинити помилку сегмента під час фіналізації інтерпретатора. Надав Ксав’є де Гає в :issue:`22898` і :issue:`30697`.

source: Added C API support for timezones with timezone constructors :c:func:`PyTimeZone_FromOffset` and :c:func:`PyTimeZone_FromOffsetAndName`, and access to the UTC singleton with :c:data:`PyDateTime_TimeZone_UTC`. Contributed by Paul Ganssle in :issue:`10381`.
pt_br: Додано підтримку C API для часових поясів за допомогою конструкторів часових поясів :c:func:`PyTimeZone_FromOffset` і :c:func:`PyTimeZone_FromOffsetAndName`, а також доступ до синглтона UTC за допомогою :c:data:`PyDateTime_TimeZone_UTC`. Надав Пол Ганссле в :issue:`10381`.

source: The type of results of :c:func:`PyThread_start_new_thread` and :c:func:`PyThread_get_thread_ident`, and the *id* parameter of :c:func:`PyThreadState_SetAsyncExc` changed from :c:expr:`long` to :c:expr:`unsigned long`. (Contributed by Serhiy Storchaka in :issue:`6532`.)
pt_br: Тип результатов :c:func:`PyThread_start_new_thread` и :c:func:`PyThread_get_thread_ident`, а также параметр *id* :c:func:`PyThreadState_SetAsyncExc` изменился с :c:expr:`long` на : c:expr:`unsigned long`. (Предоставлено Сергеем Сторчакой в ​​:issue:`6532`.)

source: :c:func:`PyUnicode_AsWideCharString` now raises a :exc:`ValueError` if the second argument is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters. (Contributed by Serhiy Storchaka in :issue:`30708`.)
pt_br: :c:func:`PyUnicode_AsWideCharString` теперь вызывает :exc:`ValueError`, если второй аргумент равен ``NULL`` и строка :c:expr:`wchar_t*` содержит нулевые символы. (Предоставлено Сергеем Сторчакой в ​​:issue:`30708`.)

source: Changes to the startup sequence and the management of dynamic memory allocators mean that the long documented requirement to call :c:func:`Py_Initialize` before calling most C API functions is now relied on more heavily, and failing to abide by it may lead to segfaults in embedding applications. See the :ref:`porting-to-python-37` section in this document and the :ref:`pre-init-safe` section in the C API documentation for more details.
pt_br: Зміни в послідовності запуску та управлінні розподільниками динамічної пам’яті означають, що давно задокументована вимога виклику :c:func:`Py_Initialize` перед викликом більшості функцій C API тепер покладається більшою мірою, і її недотримання може призвести до segfaults у програмах для вбудовування. Додаткову інформацію див. у розділі :ref:`porting-to-python-37` у цьому документі та розділі :ref:`pre-init-safe` в документації C API.

source: The new :c:func:`PyInterpreterState_GetID` returns the unique ID for a given interpreter. (Contributed by Eric Snow in :issue:`29102`.)
pt_br: Новий :c:func:`PyInterpreterState_GetID` повертає унікальний ідентифікатор для заданого інтерпретатора. (Надав Ерік Сноу в :issue:`29102`.)

source: :c:func:`Py_DecodeLocale`, :c:func:`Py_EncodeLocale` now use the UTF-8 encoding when the :ref:`UTF-8 mode <whatsnew37-pep540>` is enabled. (Contributed by Victor Stinner in :issue:`29240`.)
pt_br: :c:func:`Py_DecodeLocale`, :c:func:`Py_EncodeLocale` тепер використовують кодування UTF-8, коли ввімкнено :ref:`режим UTF-8 <whatsnew37-pep540>`. (Надав Віктор Стіннер у :issue:`29240`.)

source: :c:func:`PyUnicode_DecodeLocaleAndSize` and :c:func:`PyUnicode_EncodeLocale` now use the current locale encoding for ``surrogateescape`` error handler. (Contributed by Victor Stinner in :issue:`29240`.)
pt_br: :c:func:`PyUnicode_DecodeLocaleAndSize` і :c:func:`PyUnicode_EncodeLocale` тепер використовують поточне кодування мови для обробника помилок ``surrogateescape``. (Надав Віктор Стіннер у :issue:`29240`.)

source: The *start* and *end* parameters of :c:func:`PyUnicode_FindChar` are now adjusted to behave like string slices. (Contributed by Xiang Zhang in :issue:`28822`.)
pt_br: Параметри *start* і *end* :c:func:`PyUnicode_FindChar` тепер налаштовані так, щоб поводитися як фрагменти рядків. (Надав Xiang Zhang у :issue:`28822`.)

source: Build Changes
pt_br: Mudanças na construção

source: Support for building ``--without-threads`` has been removed. The :mod:`threading` module is now always available. (Contributed by Antoine Pitrou in :issue:`31370`.).
pt_br: Підтримку створення ``--without-threads`` видалено. Модуль :mod:`threading` тепер завжди доступний. (Надав Антуан Пітру в :issue:`31370`.).

source: A full copy of libffi is no longer bundled for use when building the :mod:`_ctypes <ctypes>` module on non-OSX UNIX platforms. An installed copy of libffi is now required when building ``_ctypes`` on such platforms. (Contributed by Zachary Ware in :issue:`27979`.)
pt_br: Повна копія libffi більше не додається для використання під час створення модуля :mod:`_ctypes <ctypes>` на платформах UNIX, відмінних від OSX. Тепер для створення ``_ctypes`` на таких платформах потрібна встановлена копія libffi. (Надано Zachary Ware у :issue:`27979`.)

source: The Windows build process no longer depends on Subversion to pull in external sources, a Python script is used to download zipfiles from GitHub instead. If Python 3.6 is not found on the system (via ``py -3.6``), NuGet is used to download a copy of 32-bit Python for this purpose. (Contributed by Zachary Ware in :issue:`30450`.)
pt_br: Процес збирання Windows більше не залежить від Subversion для залучення зовнішніх джерел, замість цього для завантаження zip-файлів із GitHub використовується сценарій Python. Якщо Python 3.6 не знайдено в системі (через ``py -3.6``), NuGet використовується для завантаження копії 32-розрядної версії Python для цієї мети. (Надано Zachary Ware у :issue:`30450`.)

source: The :mod:`ssl` module requires OpenSSL 1.0.2 or 1.1 compatible libssl. OpenSSL 1.0.1 has reached end of lifetime on 2016-12-31 and is no longer supported. LibreSSL is temporarily not supported as well. LibreSSL releases up to version 2.6.4 are missing required OpenSSL 1.0.2 APIs.
pt_br: Для модуля :mod:`ssl` потрібен OpenSSL 1.0.2 або 1.1, сумісний libssl. Термін експлуатації OpenSSL 1.0.1 завершився 31 грудня 2016 року, тому він більше не підтримується. LibreSSL також тимчасово не підтримується. У версіях LibreSSL до версії 2.6.4 відсутні необхідні API OpenSSL 1.0.2.

source: Optimizations
pt_br: Otimizações

source: The overhead of calling many methods of various standard library classes implemented in C has been significantly reduced by porting more code to use the ``METH_FASTCALL`` convention. (Contributed by Victor Stinner in :issue:`29300`, :issue:`29507`, :issue:`29452`, and :issue:`29286`.)
pt_br: Накладні витрати на виклик багатьох методів різних стандартних бібліотечних класів, реалізованих у C, були значно зменшені завдяки портуванню більшої кількості коду для використання конвенції ``METH_FASTCALL``. (Надано Віктором Стіннером у :issue:`29300`, :issue:`29507`, :issue:`29452` та :issue:`29286`.)

source: Various optimizations have reduced Python startup time by 10% on Linux and up to 30% on macOS. (Contributed by Victor Stinner, INADA Naoki in :issue:`29585`, and Ivan Levkivskyi in :issue:`31333`.)
pt_br: Різні оптимізації дозволили скоротити час запуску Python на 10% у Linux і до 30% у macOS. (Надано Віктором Стіннером, INADA Naoki у :issue:`29585` та Іваном Левківським у :issue:`31333`.)

source: Method calls are now up to 20% faster due to the bytecode changes which avoid creating bound method instances. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26110`.)
pt_br: Виклики методів тепер на 20% швидші завдяки змінам байт-коду, що дозволяє уникнути створення зв’язаних екземплярів методів. (Надано Юрієм Селівановим та INADA Naoki у :issue:`26110`.)

source: The :mod:`asyncio` module received a number of notable optimizations for commonly used functions:
pt_br: Модуль :mod:`asyncio` отримав низку помітних оптимізацій для часто використовуваних функцій:

source: The :func:`asyncio.get_event_loop` function has been reimplemented in C to make it up to 15 times faster. (Contributed by Yury Selivanov in :issue:`32296`.)
pt_br: Функцію :func:`asyncio.get_event_loop` було повторно реалізовано в C, щоб зробити її в 15 разів швидшою. (Надав Юрій Селіванов у :issue:`32296`.)

source: :class:`asyncio.Future` callback management has been optimized. (Contributed by Yury Selivanov in :issue:`32348`.)
pt_br: :class:`asyncio.Future` управління зворотними викликами оптимізовано. (Надав Юрій Селіванов у :issue:`32348`.)

source: :func:`asyncio.gather` is now up to 15% faster. (Contributed by Yury Selivanov in :issue:`32355`.)
pt_br: :func:`asyncio.gather` тепер на 15% швидше. (Надав Юрій Селіванов у :issue:`32355`.)

source: :func:`asyncio.sleep` is now up to 2 times faster when the *delay* argument is zero or negative. (Contributed by Andrew Svetlov in :issue:`32351`.)
pt_br: :func:`asyncio.sleep` тепер у 2 рази швидше, якщо аргумент *delay* дорівнює нулю або від’ємний. (Надав Ендрю Свєтлов у :issue:`32351`.)

source: The performance overhead of asyncio debug mode has been reduced. (Contributed by Antoine Pitrou in :issue:`31970`.)
pt_br: Накладні витрати на продуктивність асинхронного режиму налагодження зменшено. (Надав Антуан Пітру в :issue:`31970`.)

source: As a result of :ref:`PEP 560 work <whatsnew37-pep560>`, the import time of :mod:`typing` has been reduced by a factor of 7, and many typing operations are now faster. (Contributed by Ivan Levkivskyi in :issue:`32226`.)
pt_br: У результаті :ref:`PEP 560 work <whatsnew37-pep560>`, час імпорту :mod:`typing` було зменшено в 7 разів, і багато операцій набору тексту тепер виконуються швидше. (Надав Іван Левківський у :issue:`32226`.)

source: :func:`sorted` and :meth:`list.sort` have been optimized for common cases to be up to 40-75% faster. (Contributed by Elliot Gorokhovsky in :issue:`28685`.)
pt_br: :func:`sorted` і :meth:`list.sort` оптимізовано для звичайних випадків, щоб працювати на 40-75% швидше. (Надав Еліот Гороховський у :issue:`28685`.)

source: :meth:`dict.copy` is now up to 5.5 times faster. (Contributed by Yury Selivanov in :issue:`31179`.)
pt_br: :meth:`dict.copy` тепер у 5,5 разів швидше. (Надав Юрій Селіванов у :issue:`31179`.)

source: :func:`hasattr` and :func:`getattr` are now about 4 times faster when *name* is not found and *obj* does not override :meth:`object.__getattr__` or :meth:`object.__getattribute__`. (Contributed by INADA Naoki in :issue:`32544`.)
pt_br: :func:`hasattr` і :func:`getattr` тепер приблизно в 4 рази швидше, якщо *name* не знайдено і *obj* не перевизначає :meth:`object.__getattr__` або :meth:`object.__getattribute__` . (Надано INADA Naoki в :issue:`32544`.)

source: Searching for certain Unicode characters (like Ukrainian capital "Є") in a string was up to 25 times slower than searching for other characters. It is now only 3 times slower in the worst case. (Contributed by Serhiy Storchaka in :issue:`24821`.)
pt_br: Пошук певних символів Unicode (наприклад, української великої "Є") у рядку був у 25 разів повільнішим, ніж пошук інших символів. Тепер це лише в 3 рази повільніше в гіршому випадку. (Надав Сергій Сторчака в :issue:`24821`.)

source: The :func:`collections.namedtuple` factory has been reimplemented to make the creation of named tuples 4 to 6 times faster. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
pt_br: Фабрику :func:`collections.namedtuple` було оновлено, щоб зробити створення іменованих кортежів у 4-6 разів швидшим. (Надано Jelle Zijlstra з подальшими вдосконаленнями INADA Naoki, Сергієм Сторчакою та Raymond Hettinger у :issue:`28638`.)

source: :meth:`date.fromordinal` and :meth:`date.fromtimestamp` are now up to 30% faster in the common case. (Contributed by Paul Ganssle in :issue:`32403`.)
pt_br: :meth:`date.fromordinal` і :meth:`date.fromtimestamp` тепер на 30% швидше в звичайному регістрі. (Надав Пол Ганссле в :issue:`32403`.)

source: The :func:`os.fwalk` function is now up to 2 times faster thanks to the use of :func:`os.scandir`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
pt_br: Функція :func:`os.fwalk` тепер у 2 рази швидша завдяки використанню :func:`os.scandir`. (Надав Сергій Сторчака в :issue:`25996`.)

source: The speed of the :func:`shutil.rmtree` function has been improved by 20--40% thanks to the use of the :func:`os.scandir` function. (Contributed by Serhiy Storchaka in :issue:`28564`.)
pt_br: Швидкість функції :func:`shutil.rmtree` покращено на 20--40% завдяки використанню функції :func:`os.scandir`. (Надав Сергій Сторчака в :issue:`28564`.)

source: Optimized case-insensitive matching and searching of :mod:`regular expressions <re>`. Searching some patterns can now be up to 20 times faster. (Contributed by Serhiy Storchaka in :issue:`30285`.)
pt_br: Оптимізовано без урахування регістру зіставлення та пошук :mod:`регулярних виразів <re>`. Тепер пошук деяких шаблонів може бути в 20 разів швидшим. (Надав Сергій Сторчака в :issue:`30285`.)

source: :func:`re.compile` now converts ``flags`` parameter to int object if it is ``RegexFlag``. It is now as fast as Python 3.5, and faster than Python 3.6 by about 10% depending on the pattern. (Contributed by INADA Naoki in :issue:`31671`.)
pt_br: :func:`re.compile` тепер перетворює параметр ``flags`` на об’єкт int, якщо це ``RegexFlag``. Тепер він такий же швидкий, як Python 3.5, і швидший за Python 3.6 приблизно на 10% залежно від шаблону. (Надано INADA Naoki в :issue:`31671`.)

source: The :meth:`~selectors.BaseSelector.modify` methods of classes :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` and :class:`selectors.DevpollSelector` may be around 10% faster under heavy loads. (Contributed by Giampaolo Rodola' in :issue:`30014`)
pt_br: Методи :meth:`~selectors.BaseSelector.modify` класів :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` і :class:`selectors.DevpollSelector` можуть бути приблизно на 10% швидшими за великих навантажень . (Надав Джампаоло Родола в :issue:`30014`)

source: Constant folding has been moved from the peephole optimizer to the new AST optimizer, which is able perform optimizations more consistently. (Contributed by Eugene Toder and INADA Naoki in :issue:`29469` and :issue:`11549`.)
pt_br: Постійне згортання було перенесено з оптимізатора вічка в новий оптимізатор AST, який може виконувати оптимізацію більш послідовно. (Надано Євгеном Тодером та INADA Naoki у :issue:`29469` та :issue:`11549`.)

source: Most functions and methods in :mod:`abc` have been rewritten in C. This makes creation of abstract base classes, and calling :func:`isinstance` and :func:`issubclass` on them 1.5x faster. This also reduces Python start-up time by up to 10%. (Contributed by Ivan Levkivskyi and INADA Naoki in :issue:`31333`)
pt_br: Більшість функцій і методів у :mod:`abc` було переписано на C. Це робить створення абстрактних базових класів і виклик :func:`isinstance` і :func:`issubclass` на них у 1,5 рази швидшим. Це також скорочує час запуску Python до 10%. (Надано Іваном Левківським та INADA Naoki у :issue:`31333`)

source: Significant speed improvements to alternate constructors for :class:`datetime.date` and :class:`datetime.datetime` by using fast-path constructors when not constructing subclasses. (Contributed by Paul Ganssle in :issue:`32403`)
pt_br: Значні покращення швидкості альтернативних конструкторів для :class:`datetime.date` і :class:`datetime.datetime` завдяки використанню конструкторів швидкого шляху, коли не створюються підкласи. (Надав Пол Ганссле в :issue:`32403`)

source: The speed of comparison of :class:`array.array` instances has been improved considerably in certain cases. It is now from 10x to 70x faster when comparing arrays holding values of the same integer type. (Contributed by Adrian Wielgosik in :issue:`24700`.)
pt_br: Швидкість порівняння екземплярів :class:`array.array` була значно покращена в деяких випадках. Тепер це від 10 до 70 разів швидше під час порівняння масивів, що містять значення одного цілого типу. (Надав Adrian Wielgosik у :issue:`24700`.)

source: The :func:`math.erf` and :func:`math.erfc` functions now use the (faster) C library implementation on most platforms. (Contributed by Serhiy Storchaka in :issue:`26121`.)
pt_br: Функції :func:`math.erf` і :func:`math.erfc` тепер використовують (швидшу) реалізацію бібліотеки C на більшості платформ. (Надав Сергій Сторчака в :issue:`26121`.)

source: Other CPython Implementation Changes
pt_br: Outras mudanças na implementação do CPython

source: Trace hooks may now opt out of receiving the ``line`` and opt into receiving the ``opcode`` events from the interpreter by setting the corresponding new :attr:`~frame.f_trace_lines` and :attr:`~frame.f_trace_opcodes` attributes on the frame being traced. (Contributed by Nick Coghlan in :issue:`31344`.)
pt_br: Перехватчики трассировки теперь могут отказаться от получения строки и включить получение событий кода операции от интерпретатора, установив соответствующие новые :attr:`~frame.f_trace_lines` и :attr:`~frame. Атрибуты f_trace_opcodes` в отслеживаемом кадре. (Предоставлено Ником Когланом в :issue:`31344`.)

source: Fixed some consistency problems with namespace package module attributes. Namespace module objects now have an ``__file__`` that is set to ``None`` (previously unset), and their ``__spec__.origin`` is also set to ``None`` (previously the string ``"namespace"``). See :issue:`32305`. Also, the namespace module object's ``__spec__.loader`` is set to the same value as ``__loader__`` (previously, the former was set to ``None``). See :issue:`32303`.
pt_br: Виправлено деякі проблеми узгодженості з атрибутами модуля пакета простору імен. Об’єкти модуля простору імен тепер мають ``__file__``, для якого встановлено значення ``None`` (раніше не було встановлено), а для їх ``__spec__.origin`` також встановлено значення ``None`` (раніше це був рядок ``" простір імен"``). Див. :issue:`32305`. Крім того, об’єкт модуля простору імен ``__spec__.loader`` має те саме значення, що і ``__loader__`` (раніше для першого було встановлено значення ``None``). Див. :issue:`32303`.

source: The :func:`locals` dictionary now displays in the lexical order that variables were defined. Previously, the order was undefined. (Contributed by Raymond Hettinger in :issue:`32690`.)
pt_br: Словник :func:`locals` тепер відображається в лексичному порядку, у якому були визначені змінні. Раніше порядок був невизначеним. (Надав Реймонд Геттінгер у :issue:`32690`.)

source: Deprecated Python Behavior
pt_br: Comportamento do Python descontinuado

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now deprecated in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). This ensures that comprehensions always immediately return a container of the appropriate type (rather than potentially returning a :term:`generator iterator` object), while generator expressions won't attempt to interleave their implicit output with the output from any explicit yield expressions. In Python 3.7, such expressions emit :exc:`DeprecationWarning` when compiled, in Python 3.8 this will be a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :issue:`10544`.)
pt_br: Вирази yield (як ``yield``, так і ``yield from`` пункти) тепер застаріли у виразах розуміння та генераторі (окрім ітераційного виразу в крайньому лівому пункті :keyword:`!for`). Це гарантує, що розуміння завжди негайно повертатиме контейнер відповідного типу (замість потенційного повернення об’єкта :term:`generator iterator`), тоді як вирази генератора не намагатимуться перемежовувати свій неявний вихід з виводом будь-яких явних виразів yield. У Python 3.7 такі вирази видають :exc:`DeprecationWarning` під час компіляції, у Python 3.8 це буде :exc:`SyntaxError`. (Надав Сергій Сторчака в :issue:`10544`.)

source: Returning a subclass of :class:`complex` from :meth:`object.__complex__` is deprecated and will be an error in future Python versions. This makes ``__complex__()`` consistent with :meth:`object.__int__` and :meth:`object.__float__`. (Contributed by Serhiy Storchaka in :issue:`28894`.)
pt_br: Повернення підкласу :class:`complex` з :meth:`object.__complex__` є застарілим і буде помилкою в майбутніх версіях Python. Це робить ``__complex__()`` сумісним з :meth:`object.__int__` і :meth:`object.__float__`. (Надав Сергій Сторчака в :issue:`28894`.)

source: Deprecated Python modules, functions and methods
pt_br: Застарілі модулі, функції та методи Python

source: :func:`aifc.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`aifc.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
pt_br: :func:`aifc.openfp` визнано застарілим і буде видалено в Python 3.9. Натомість використовуйте :func:`aifc.open`. (Надав Браян Кертін у :issue:`31985`.)

source: Support for directly ``await``-ing instances of :class:`asyncio.Lock` and other asyncio synchronization primitives has been deprecated. An asynchronous context manager must be used in order to acquire and release the synchronization resource. (Contributed by Andrew Svetlov in :issue:`32253`.)
pt_br: Підтримка для ``очікування`` екземплярів :class:`asyncio.Lock` та інших примітивів синхронізації asyncio застаріла. Для отримання та звільнення ресурсу синхронізації необхідно використовувати диспетчер асинхронного контексту. (Надав Ендрю Свєтлов у :issue:`32253`.)
