Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: The default handling of :exc:`DeprecationWarning` has been changed such that these warnings are once more shown by default, but only when the code triggering them is running directly in the :mod:`__main__` module. As a result, developers of single file scripts and those using Python interactively should once again start seeing deprecation warnings for the APIs they use, but deprecation warnings triggered by imported application, library and framework modules will continue to be hidden by default.
pt_br: O tratamento padrão de :exc:`DeprecationWarning` foi alterado de forma que esses avisos sejam mais uma vez mostrados por padrão, mas apenas quando o código que os aciona está sendo executado diretamente no módulo :mod:`__main__`. Como resultado, os desenvolvedores de scripts de arquivo único e aqueles que usam Python interativamente devem mais uma vez começar a ver avisos de descontinuação para as APIs que usam, mas os avisos de descontinuação acionados por aplicações importadas, biblioteca e módulos de estrutura continuarão ocultos por padrão.

source: As a result of this change, the standard library now allows developers to choose between three different deprecation warning behaviours:
pt_br: Como resultado dessa mudança, a biblioteca padrão agora permite que os desenvolvedores escolham entre três comportamentos diferentes de aviso de descontinuação:

source: :exc:`FutureWarning`: always displayed by default, recommended for warnings intended to be seen by application end users (e.g. for deprecated application configuration settings).
pt_br: :exc:`FutureWarning`: sempre exibida por padrão, recomendado para avisos que devem ser vistos pelos usuários finais da aplicação (por exemplo, para definições de configuração de aplicações descontinuadas).

source: :exc:`DeprecationWarning`: displayed by default only in :mod:`__main__` and when running tests, recommended for warnings intended to be seen by other Python developers where a version upgrade may result in changed behaviour or an error.
pt_br: :exc:`DeprecationWarning`: exibida por padrão apenas em :mod:`__main__` e ao executar testes, recomendado para avisos que devem ser vistos por outros desenvolvedores Python onde uma atualização de versão pode resultar em mudança de comportamento ou um erro.

source: :exc:`PendingDeprecationWarning`: displayed by default only when running tests, intended for cases where a future version upgrade will change the warning category to :exc:`DeprecationWarning` or :exc:`FutureWarning`.
pt_br: :exc:`PendingDeprecationWarning`: exibida por padrão apenas ao executar testes, destinados a casos em que uma atualização de versão futura mudará a categoria de aviso para :exc:`DeprecationWarning` ou :exc:`FutureWarning`.

source: Previously both :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning` were only visible when running tests, which meant that developers primarily writing single file scripts or using Python interactively could be surprised by breaking changes in the APIs they used.
pt_br: Anteriormente, ambas :exc:`DeprecationWarning` e :exc:`PendingDeprecationWarning` eram visíveis apenas durante a execução de testes, o que significava que os desenvolvedores principalmente escrevendo scripts de arquivo único ou usando Python interativamente poderiam ser surpreendidos por alterações nas APIs que usavam.

source: PEP written and implemented by Nick Coghlan
pt_br: PEP escrita e implementada por Nick Coghlan

source: PEP 560: Core Support for ``typing`` module and Generic Types
pt_br: PEP 560: Suporte básico para módulo ``typing`` e tipos genéricos

source: Initially :pep:`484` was designed in such way that it would not introduce *any* changes to the core CPython interpreter. Now type hints and the :mod:`typing` module are extensively used by the community, so this restriction is removed. The PEP introduces two special methods :meth:`__class_getitem__` and ``__mro_entries__``, these methods are now used by most classes and special constructs in :mod:`typing`. As a result, the speed of various operations with types increased up to 7 times, the generic types can be used without metaclass conflicts, and several long standing bugs in :mod:`typing` module are fixed.
pt_br: Inicialmente a :pep:`484` foi projetado de tal forma que não introduziria *nenhuma* mudança no interpretador CPython central. Agora que type hints e o módulo :mod:`typing` são amplamente usados pela comunidade, então esta restrição foi removida. A PEP introduz dois métodos especiais :meth:`__class_getitem__` e ``__mro_entries__``, esses métodos agora são usados pela maioria das classes e construções especiais em :mod:`typing`. Como resultado, a velocidade de várias operações com tipos aumentou em até 7 vezes, os tipos genéricos podem ser usados sem conflitos de metaclasse e vários bugs de longa data no módulo :mod:`typing` foram corrigidos.

source: :pep:`560` -- Core support for typing module and generic types
pt_br: :pep:`560` -- Suporte básico para módulo typing e tipos genéricos

source: PEP 552: Hash-based .pyc Files
pt_br: PEP 552: Arquivos .pyc baseados em hash

source: Python has traditionally checked the up-to-dateness of bytecode cache files (i.e., ``.pyc`` files) by comparing the source metadata (last-modified timestamp and size) with source metadata saved in the cache file header when it was generated. While effective, this invalidation method has its drawbacks. When filesystem timestamps are too coarse, Python can miss source updates, leading to user confusion. Additionally, having a timestamp in the cache file is problematic for `build reproducibility <https://reproducible-builds.org/>`_ and content-based build systems.
pt_br: O Python tradicionalmente verifica a atualização dos arquivos de cache em bytecode (ou seja, arquivos ``.pyc``) comparando os metadados da fonte (registro de data e hora e tamanho da última modificação) com os metadados da fonte salvos no cabeçalho do arquivo de cache quando foi gerado. Embora eficaz, esse método de invalidação tem suas desvantagens. Quando os registros de data e hora do sistema de arquivos são muito grosseiros, o Python pode perder as atualizações de origem, levando à confusão do usuário. Além disso, ter um registro de data e hora no arquivo de cache é problemático para `reprodutibilidade de compilação <https://reproducible-builds.org/>`_ e sistemas de compilação baseados em conteúdo.

source: :pep:`552` extends the pyc format to allow the hash of the source file to be used for invalidation instead of the source timestamp. Such ``.pyc`` files are called "hash-based". By default, Python still uses timestamp-based invalidation and does not generate hash-based ``.pyc`` files at runtime. Hash-based ``.pyc`` files may be generated with :mod:`py_compile` or :mod:`compileall`.
pt_br: :pep:`552` estende o formato pyc para permitir que o hash do arquivo de origem seja usado para invalidação em vez do registro de data e hora da fonte. Esses arquivos ``.pyc`` são chamados de "baseados em hash". Por padrão, Python ainda usa invalidação baseada em registro de data e hora e não gera arquivos ``.pyc`` baseados em hash em tempo de execução. Arquivos ``.pyc`` baseados em hash podem ser gerados com :mod:`py_compile` ou :mod:`compileall`.

source: Hash-based ``.pyc`` files come in two variants: checked and unchecked. Python validates checked hash-based ``.pyc`` files against the corresponding source files at runtime but doesn't do so for unchecked hash-based pycs. Unchecked hash-based ``.pyc`` files are a useful performance optimization for environments where a system external to Python (e.g., the build system) is responsible for keeping ``.pyc`` files up-to-date.
pt_br: Arquivos ``.pyc`` baseados em hash vêm em duas variantes: verificados e não verificados. Python valida arquivos ``.pyc`` baseados em hash verificados em relação aos arquivos fonte correspondentes em tempo de execução, mas não o faz para pycs baseados em hash não verificados. Arquivos ``.pyc`` baseados em hash não verificados são uma otimização de desempenho útil para ambientes onde um sistema externo ao Python (por exemplo, o sistema de construção) é responsável por manter os arquivos ``.pyc`` atualizados.

source: See :ref:`pyc-invalidation` for more information.
pt_br: Veja a função :ref:`pyc-invalidation` para mais informações.

source: :pep:`552` -- Deterministic pycs
pt_br: :pep:`552` -- pycs determinísticos

source: PEP written and implemented by Benjamin Peterson
pt_br: PEP escrita e implementada por Benjamin Peterson

source: PEP 545: Python Documentation Translations
pt_br: PEP 545: Traduções da documentação do Python

source: :pep:`545` describes the process of creating and maintaining Python documentation translations.
pt_br: :pep:`545` descreve o processo de criação a manutenção das traduções da documentação do Python.

source: Three new translations have been added:
pt_br: Três novas traduções foram adicionadas:

source: Japanese: https://docs.python.org/ja/
pt_br: Japonês: https://docs.python.org/ja/

source: French: https://docs.python.org/fr/
pt_br: Francês: https://docs.python.org/fr/

source: Korean: https://docs.python.org/ko/
pt_br: Coreano: https://docs.python.org/ko/

source: :pep:`545` -- Python Documentation Translations
pt_br: :pep:`545` -- Traduções da documentação do Python

source: PEP written and implemented by Julien Palard, Inada Naoki, and Victor Stinner.
pt_br: PEP escrita e implementada por Julien Palard, Inada Naoki e Victor Stinner.

source: Python Development Mode (-X dev)
pt_br: Modo de Desenvolvimento do Python (-X dev)

source: The new :option:`-X` ``dev`` command line option or the new :envvar:`PYTHONDEVMODE` environment variable can be used to enable :ref:`Python Development Mode <devmode>`. When in development mode, Python performs additional runtime checks that are too expensive to be enabled by default. See :ref:`Python Development Mode <devmode>` documentation for the full description.
pt_br: A nova opção de linha de comando :option:`-X` ``dev`` ou a nova variável de ambiente :envvar:`PYTHONDEVMODE` pode ser usada para habilitar :ref:`Modo de Desenvolvimento do Python <devmode>`. Quando está no modo de desenvolvimento, o Python executa verificações adicionais em tempo de execução que são muito caras para serem habilitadas por padrão. Veja a documentação :ref:`Modo de Desenvolvimento do Python <devmode>` para a descrição completa.

source: Other Language Changes
pt_br: Outras mudanças na linguagem

source: An :keyword:`await` expression and comprehensions containing an :keyword:`async for` clause were illegal in the expressions in :ref:`formatted string literals <f-strings>` due to a problem with the implementation. In Python 3.7 this restriction was lifted.
pt_br: Uma expressão :keyword:`await` e compreensões contendo uma cláusula :keyword:`async for` eram ilegais nas expressões em :ref:`literais de strings formatadas <f-strings>` devido a um problema com a implementação. No Python 3.7, esta restrição foi retirada.

source: More than 255 arguments can now be passed to a function, and a function can now have more than 255 parameters. (Contributed by Serhiy Storchaka in :issue:`12844` and :issue:`18896`.)
pt_br: Mais de 255 argumentos agora podem ser passados para uma função, e uma função agora pode ter mais de 255 parâmetros. (Contribuição de Serhiy Storchaka em :issue:`12844` e :issue:`18896`.)

source: :meth:`bytes.fromhex` and :meth:`bytearray.fromhex` now ignore all ASCII whitespace, not only spaces. (Contributed by Robert Xiao in :issue:`28927`.)
pt_br: :meth:`bytes.fromhex` e :meth:`bytearray.fromhex` agora ignoram todos os espaços em branco ASCII, não apenas espaços. (Contribuição de Robert Xiao em :issue:`28927`.)

source: :class:`str`, :class:`bytes`, and :class:`bytearray` gained support for the new :meth:`isascii() <str.isascii>` method, which can be used to test if a string or bytes contain only the ASCII characters. (Contributed by INADA Naoki in :issue:`32677`.)
pt_br: :class:`str`, :class:`bytes` e :class:`bytearray` ganharam suporte para o novo método :meth:`isascii() <str.isascii>`, que pode ser usado para testar se uma string ou bytes contêm apenas os caracteres ASCII. (Contribuição de INADA Naoki em :issue:`32677`.)

source: :exc:`ImportError` now displays module name and module ``__file__`` path when ``from ... import ...`` fails. (Contributed by Matthias Bussonnier in :issue:`29546`.)
pt_br: :exc:`ImportError` agora exibe o nome do módulo e o caminho do módulo ``__file__`` quando ``from ... import ...`` falha. (Contribuição de Matthias Bussonnier em :issue:`29546`.)

source: Circular imports involving absolute imports with binding a submodule to a name are now supported. (Contributed by Serhiy Storchaka in :issue:`30024`.)
pt_br: Importações circulares envolvendo importações absolutas com ligação de um submódulo a um nome agora são suportadas. (Contribuição de Serhiy Storchaka em :issue:`30024`.)

source: ``object.__format__(x, '')`` is now equivalent to ``str(x)`` rather than ``format(str(self), '')``. (Contributed by Serhiy Storchaka in :issue:`28974`.)
pt_br: ``object.__format__(x, '')`` agora é equivalente a ``str(x)`` em vez de ``format(str(self), '')``. (Contribuição de Serhiy Storchaka em :issue:`28974`.)

source: In order to better support dynamic creation of stack traces, :class:`types.TracebackType` can now be instantiated from Python code, and the :attr:`~traceback.tb_next` attribute on :ref:`tracebacks <traceback-objects>` is now writable. (Contributed by Nathaniel J. Smith in :issue:`30579`.)
pt_br: Para melhor prover suporte à criação dinâmica de rastreamentos de pilha, :class:`types.TracebackType` agora pode ser instanciado a partir do código Python, e o atributo :attr:`~traceback.tb_next` em :ref:`tracebacks <traceback-objects>` agora é gravável. (Contribuição de Nathaniel J. Smith em :issue:`30579`.)

source: When using the :option:`-m` switch, ``sys.path[0]`` is now eagerly expanded to the full starting directory path, rather than being left as the empty directory (which allows imports from the *current* working directory at the time when an import occurs) (Contributed by Nick Coghlan in :issue:`33053`.)
pt_br: Ao usar a opção :option:`-m`, ``sys.path[0]`` agora é expandido para o caminho completo do diretório inicial, em vez de ser deixado como o diretório vazio (o que permite importações do *atual* diretório de trabalho no momento em que ocorre uma importação) (Contribuição de Nick Coghlan em :issue:`33053`.)

source: The new :option:`-X` ``importtime`` option or the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable can be used to show the timing of each module import. (Contributed by Inada Naoki in :issue:`31415`.)
pt_br: A nova opção :option:`-X` ``importtime`` ou a variável de ambiente :envvar:`PYTHONPROFILEIMPORTTIME` pode ser usada para mostrar o tempo de cada importação de módulo. (Contribuição de Inada Naoki em :issue:`31415`.)

source: New Modules
pt_br: Novos módulos

source: The new :mod:`contextvars` module and a set of :ref:`new C APIs <contextvarsobjects>` introduce support for *context variables*. Context variables are conceptually similar to thread-local variables. Unlike TLS, context variables support asynchronous code correctly.
pt_br: O novo módulo :mod:`contextvars` e um conjunto de :ref:`novas APIs C <contextvarsobjects>` introduzem suporte para *variáveis de contexto*. Variáveis de contexto são conceitualmente semelhantes às variáveis locais de thread. Ao contrário do TLS, as variáveis de contexto oferecem suporte a código assíncrono corretamente.

source: The :mod:`asyncio` and :mod:`decimal` modules have been updated to use and support context variables out of the box. Particularly the active decimal context is now stored in a context variable, which allows decimal operations to work with the correct context in asynchronous code.
pt_br: Os módulos :mod:`asyncio` e :mod:`decimal` foram atualizados para usar e prover suporte a variáveis de contexto prontas para uso. Particularmente o contexto decimal ativo agora é armazenado em uma variável de contexto, o que permite que operações decimais funcionem com o contexto correto em código assíncrono.

source: :pep:`567` -- Context Variables
pt_br: :pep:`567` -- Variáveis de contexto

source: PEP written and implemented by Yury Selivanov
pt_br: PEP escrita e implementada por Yury Selivanov

source: The new :func:`~dataclasses.dataclass` decorator provides a way to declare *data classes*. A data class describes its attributes using class variable annotations. Its constructor and other magic methods, such as :meth:`~object.__repr__`, :meth:`~object.__eq__`, and :meth:`~object.__hash__` are generated automatically.
pt_br: O novo decorador :func:`~dataclasses.dataclass` fornece uma maneira de declarar *classes de dados*. Uma classe de dados descreve seus atributos usando anotações de variáveis de classe. Seu construtor e outros métodos mágicos, como :meth:`~object.__repr__`, :meth:`~object.__eq__` e :meth:`~object.__hash__` são gerados automaticamente.

source: Example::
pt_br: Exemplo::

source: :pep:`557` -- Data Classes
pt_br: :pep:`557` -- Classes de dados

source: PEP written and implemented by Eric V. Smith
pt_br: PEP escrita e implementada por Eric V. Smith

source: The new :mod:`importlib.resources` module provides several new APIs and one new ABC for access to, opening, and reading *resources* inside packages. Resources are roughly similar to files inside packages, but they needn't be actual files on the physical file system. Module loaders can provide a :meth:`get_resource_reader()` function which returns a :class:`importlib.abc.ResourceReader` instance to support this new API. Built-in file path loaders and zip file loaders both support this.
pt_br: O novo módulo :mod:`importlib.resources` fornece diversas novas APIs e um novo ABC para acesso, abertura e leitura de *recursos* dentro de pacotes. Os recursos são aproximadamente semelhantes aos arquivos dentro dos pacotes, mas não precisam ser arquivos reais no sistema de arquivos físico. Os carregadores de módulo podem fornecer uma função :meth:`get_resource_reader()` que retorna uma instância :class:`importlib.abc.ResourceReader` para suportar esta nova API. Carregadores embutidos de caminho de arquivo e carregadores de arquivo zip oferecem suporte a isso.

source: Contributed by Barry Warsaw and Brett Cannon in :issue:`32248`.
pt_br: (Contribuição de Barry Warsaw e Brett Cannon em :issue:`32248`.)

source: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_ -- a PyPI backport for earlier Python versions.
pt_br: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_ -- um backport do PyPI para versões anteriores do Python.

source: Improved Modules
pt_br: Módulos melhorados

source: The new :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` method allows intermixing options and positional arguments. (Contributed by paul.j3 in :issue:`14191`.)
pt_br: O novo método :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` permite misturar opções e argumentos posicionais. (Contribuição de paul.j3 em :issue:`14191`.)

source: The :mod:`asyncio` module has received many new features, usability and :ref:`performance improvements <whatsnew37-asyncio-perf>`. Notable changes include:
pt_br: O módulo :mod:`asyncio` recebeu muitos novos recursos, usabilidade e :ref:`melhorias de desempenho <whatsnew37-asyncio-perf>`. Mudanças notáveis incluem:

source: The new :term:`provisional <provisional API>` :func:`asyncio.run` function can be used to run a coroutine from synchronous code by automatically creating and destroying the event loop. (Contributed by Yury Selivanov in :issue:`32314`.)
pt_br: A nova função :term:`provisória <provisional API>` :func:`asyncio.run` pode ser usada para executar uma corrotina a partir de código síncrono criando e destruindo automaticamente o laço de eventos. (Contribuição de Yury Selivanov em :issue:`32314`.)

source: asyncio gained support for :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop.call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>`, and :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` have a new optional keyword-only *context* parameter. :class:`Tasks <asyncio.Task>` now track their context automatically. See :pep:`567` for more details. (Contributed by Yury Selivanov in :issue:`32436`.)
pt_br: asyncio ganhou suporte para :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop. call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>` e :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` têm um novo parâmetro somente-nomeado opcional *context*. :class:`Tasks <asyncio.Task>` agora rastreia seu contexto automaticamente. Veja :pep:`567` para mais detalhes. (Contribuição de Yury Selivanov em :issue:`32436`.)

source: The new :func:`asyncio.create_task` function has been added as a shortcut to ``asyncio.get_event_loop().create_task()``. (Contributed by Andrew Svetlov in :issue:`32311`.)
pt_br: A nova função :func:`asyncio.create_task` foi adicionada como um atalho para ``asyncio.get_event_loop().create_task()``. (Contribuição de Andrew Svetlov em :issue:`32311`.)

source: The new :meth:`loop.start_tls() <asyncio.loop.start_tls>` method can be used to upgrade an existing connection to TLS. (Contributed by Yury Selivanov in :issue:`23749`.)
pt_br: O novo método :meth:`loop.start_tls() <asyncio.loop.start_tls>` pode ser usado para atualizar uma conexão existente para TLS. (Contribuição de Yury Selivanov em :issue:`23749`.)

source: The new :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` method allows reading data from a socket directly into a provided buffer making it possible to reduce data copies. (Contributed by Antoine Pitrou in :issue:`31819`.)
pt_br: O novo método :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` permite a leitura de dados de um soquete diretamente em um buffer fornecido, tornando possível reduzir as cópias de dados. (Contribuição de Antoine Pitrou em :issue:`31819`.)

source: The new *provisional* :class:`~asyncio.BufferedProtocol` class allows implementing streaming protocols with manual control over the receive buffer. (Contributed by Yury Selivanov in :issue:`32251`.)
pt_br: A nova classe *provisória* :class:`~asyncio.BufferedProtocol` permite implementar protocolos de streaming com controle manual sobre o buffer de recebimento. (Contribuição de Yury Selivanov em :issue:`32251`.)

source: The new :func:`asyncio.get_running_loop` function returns the currently running loop, and raises a :exc:`RuntimeError` if no loop is running. This is in contrast with :func:`asyncio.get_event_loop`, which will *create* a new event loop if none is running. (Contributed by Yury Selivanov in :issue:`32269`.)
pt_br: A nova função :func:`asyncio.get_running_loop` retorna o laço atualmente em execução e levanta uma exceção :exc:`RuntimeError` se nenhum laço estiver em execução. Isto contrasta com :func:`asyncio.get_event_loop`, que irá *criar* um novo laço de eventos se nenhum estiver em execução. (Contribuição de Yury Selivanov em :issue:`32269`.)
