Repository: python/python-docs-pt-br
Catalog: whatsnew/3.7.po
Languages: pt_br

source: ``repr`` for :class:`datetime.timedelta` has changed to include the keyword arguments in the output. (Contributed by Utkarsh Upadhyay in :issue:`30302`.)
pt_br: ``repr`` для :class:`datetime.timedelta` змінено, щоб включити ключові аргументи у вивід. (Надав Utkarsh Upadhyay у :issue:`30302`.)

source: Because :func:`shutil.rmtree` is now implemented using the :func:`os.scandir` function, the user specified handler *onerror* is now called with the first argument ``os.scandir`` instead of ``os.listdir`` when listing the directory is failed.
pt_br: Оскільки :func:`shutil.rmtree` тепер реалізовано за допомогою функції :func:`os.scandir`, вказаний користувачем обробник *onerror* тепер викликається з першим аргументом ``os.scandir`` замість ``os .listdir`` під час перерахування каталогу не вдається.

source: Support for nested sets and set operations in regular expressions as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax. To facilitate this future change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That include sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning, escape them with a backslash. (Contributed by Serhiy Storchaka in :issue:`30349`.)
pt_br: У майбутньому може бути додано підтримку вкладених наборів і операцій із наборами в регулярних виразах, як у `Технічному стандарті Unicode #18`_. Це змінило б синтаксис. Для сприяння цій майбутній зміні :exc:`FutureWarning` на даний момент буде викликано у неоднозначних випадках. Це включає в себе набори, що починаються з літерала ``'['`` або містять літеральні послідовності символів ``'--'``, ``'&&'``, ``'~~'`` і ``'| |'``. Щоб уникнути попередження, екрануйте їх за допомогою зворотної косої риски. (Надав Сергій Сторчака в :issue:`30349`.)

source: The result of splitting a string on a :mod:`regular expression <re>` that could match an empty string has been changed. For example splitting on ``r'\s*'`` will now split not only on whitespaces as it did previously, but also on empty strings before all non-whitespace characters and just before the end of the string. The previous behavior can be restored by changing the pattern to ``r'\s+'``. A :exc:`FutureWarning` was emitted for such patterns since Python 3.5.
pt_br: Результат поділу рядка на :mod:`регулярний вираз <re>`, який міг відповідати порожньому рядку, було змінено. Наприклад, розділення на ``r'\s*'`` тепер розділятиметься не лише на пробіли, як це було раніше, але також на порожні рядки перед усіма символами, які не є пробілами, і безпосередньо перед кінцем рядка. Попередню поведінку можна відновити, змінивши шаблон на ``r'\s+'``. :exc:`FutureWarning` було видано для таких шаблонів, починаючи з Python 3.5.

source: For patterns that match both empty and non-empty strings, the result of searching for all matches may also be changed in other cases. For example in the string ``'a\n\n'``, the pattern ``r'(?m)^\s*?$'`` will not only match empty strings at positions 2 and 3, but also the string ``'\n'`` at positions 2--3. To match only blank lines, the pattern should be rewritten as ``r'(?m)^[^\S\n]*$'``.
pt_br: Для шаблонів, які відповідають як порожнім, так і непорожнім рядкам, результат пошуку всіх збігів також може бути змінений в інших випадках. Наприклад, у рядку ``'a\n\n'``, шаблон ``r'(?m)^\s*?$'`` не лише відповідатиме порожнім рядкам у позиціях 2 і 3, але також рядок ``'\n'`` на позиціях 2--3. Щоб відповідати лише порожнім рядкам, шаблон слід переписати як ``r'(?m)^[^\S\n]*$''``.

source: (Contributed by Serhiy Storchaka in :issue:`25054` and :issue:`32308`.)
pt_br: (Kontribusi dari Serhiy Storchaka di :issue:`25054` dan :issue:`32308`.)

source: Change :func:`re.escape` to only escape regex special characters instead of escaping all characters other than ASCII letters, numbers, and ``'_'``. (Contributed by Serhiy Storchaka in :issue:`29995`.)
pt_br: Змініть :func:`re.escape`, щоб екранувати лише спеціальні символи регулярних виразів замість екранування всіх символів, крім літер ASCII, цифр і ``'_'``. (Надав Сергій Сторчака в :issue:`29995`.)

source: :class:`tracemalloc.Traceback` frames are now sorted from oldest to most recent to be more consistent with :mod:`traceback`. (Contributed by Jesse Bakker in :issue:`32121`.)
pt_br: :class:`tracemalloc.Traceback` кадри тепер сортуються від найстаріших до найновіших, щоб бути більш узгодженими з :mod:`traceback`. (Надав Джессі Беккер у :issue:`32121`.)

source: On OSes that support :const:`socket.SOCK_NONBLOCK` or :const:`socket.SOCK_CLOEXEC` bit flags, the :attr:`socket.type <socket.socket.type>` no longer has them applied. Therefore, checks like ``if sock.type == socket.SOCK_STREAM`` work as expected on all platforms. (Contributed by Yury Selivanov in :issue:`32331`.)
pt_br: В ОС, які підтримують :const:`socket.SOCK_NONBLOCK` або :const:`socket.SOCK_CLOEXEC` бітові прапорці, :attr:`socket.type <socket.socket.type>` більше не застосовують їх. Тому такі перевірки, як ``if sock.type == socket.SOCK_STREAM``, працюють належним чином на всіх платформах. (Надав Юрій Селіванов у :issue:`32331`.)

source: On Windows the default for the *close_fds* argument of :class:`subprocess.Popen` was changed from :const:`False` to :const:`True` when redirecting the standard handles. If you previously depended on handles being inherited when using :class:`subprocess.Popen` with standard io redirection, you will have to pass ``close_fds=False`` to preserve the previous behaviour, or use :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.
pt_br: У Windows стандартне значення для аргументу *close_fds* :class:`subprocess.Popen` було змінено з :const:`False` на :const:`True` під час перенаправлення стандартних дескрипторів. Якщо раніше ви залежали від успадкованих дескрипторів під час використання :class:`subprocess.Popen` зі стандартним переспрямуванням io, вам доведеться передати ``close_fds=False``, щоб зберегти попередню поведінку, або використати :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.

source: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- which implicitly affects :func:`importlib.invalidate_caches` -- now deletes entries in :data:`sys.path_importer_cache` which are set to ``None``. (Contributed by Brett Cannon in :issue:`33169`.)
pt_br: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- що неявно впливає на :func:`importlib.invalidate_caches` -- тепер видаляє записи в :data:`sys.path_importer_cache`, для яких встановлено значення ``None``. (Надано Бреттом Кенноном у :issue:`33169`.)

source: In :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop.sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>`, :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` have been changed to be proper coroutine methods to match their documentation. Previously, these methods returned :class:`asyncio.Future` instances. (Contributed by Yury Selivanov in :issue:`32327`.)
pt_br: У :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop.sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop. getaddrinfo() <asyncio.loop.getaddrinfo>`, :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` були змінені на належні методи співпрограми відповідно до їх документації. Раніше ці методи повертали екземпляри :class:`asyncio.Future`. (Надав Юрій Селіванов у :issue:`32327`.)

source: :attr:`asyncio.Server.sockets` now returns a copy of the internal list of server sockets, instead of returning it directly. (Contributed by Yury Selivanov in :issue:`32662`.)
pt_br: :attr:`asyncio.Server.sockets` тепер повертає копію внутрішнього списку серверних сокетів замість того, щоб повертати його безпосередньо. (Надав Юрій Селіванов у :issue:`32662`.)

source: :attr:`Struct.format <struct.Struct.format>` is now a :class:`str` instance instead of a :class:`bytes` instance. (Contributed by Victor Stinner in :issue:`21071`.)
pt_br: :attr:`Struct.format <struct.Struct.format>` тепер є екземпляром :class:`str` замість екземпляра :class:`bytes`. (Надав Віктор Стіннер у :issue:`21071`.)

source: :mod:`argparse` subparsers can now be made mandatory by passing ``required=True`` to :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Contributed by Anthony Sottile in :issue:`26510`.)
pt_br: Підрозбірники :mod:`argparse` тепер можна зробити обов’язковими, передавши ``required=True`` у :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Надав Ентоні Соттіле в :issue:`26510`.)

source: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` will now consistently raise an exception when a date falls outside of the ``0001-01-01`` through ``9999-12-31`` range. To support applications that cannot tolerate such exceptions, the new :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` and :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>` can be used. The new methods return tuples and are not restricted by the range supported by :class:`datetime.date`. (Contributed by Alexander Belopolsky in :issue:`28292`.)
pt_br: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` тепер постійно створюватиме виняток, якщо дата виходить за межі діапазону ``0001-01-01`` до ``9999-12-31``. Для підтримки програм, які не можуть допускати такі винятки, можна використовувати нові :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` і :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>`. Нові методи повертають кортежі та не обмежені діапазоном, який підтримує :class:`datetime.date`. (Надав Олександр Бєлопольський у :issue:`28292`.)

source: :class:`collections.ChainMap` now preserves the order of the underlying mappings. (Contributed by Raymond Hettinger in :issue:`32792`.)
pt_br: :class:`collections.ChainMap` тепер зберігає порядок базових відображень. (Надав Реймонд Геттінгер у :issue:`32792`.)

source: The ``submit()`` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor` now raises a :exc:`RuntimeError` if called during interpreter shutdown. (Contributed by Mark Nemec in :issue:`33097`.)
pt_br: Метод ``submit()`` :class:`concurrent.futures.ThreadPoolExecutor` і :class:`concurrent.futures.ProcessPoolExecutor` тепер викликає :exc:`RuntimeError`, якщо викликається під час завершення роботи інтерпретатора. (Надав Марк Немек у :issue:`33097`.)

source: The :class:`configparser.ConfigParser` constructor now uses ``read_dict()`` to process the default values, making its behavior consistent with the rest of the parser. Non-string keys and values in the defaults dictionary are now being implicitly converted to strings. (Contributed by James Tocknell in :issue:`23835`.)
pt_br: Конструктор :class:`configparser.ConfigParser` тепер використовує ``read_dict()`` для обробки значень за замовчуванням, роблячи його поведінку узгодженою з рештою синтаксичного аналізатора. Нерядкові ключі та значення в словнику за замовчуванням тепер неявно перетворюються на рядки. (Надав Джеймс Токнелл у :issue:`23835`.)

source: Several undocumented internal imports were removed. One example is that ``os.errno`` is no longer available; use ``import errno`` directly instead. Note that such undocumented internal imports may be removed any time without notice, even in micro version releases.
pt_br: Кілька незадокументованих внутрішніх імпортів було вилучено. Одним із прикладів є те, що ``os.errno`` більше не доступний; натомість використовуйте ``import errno`` безпосередньо. Зауважте, що такий незадокументований внутрішній імпорт може бути видалено будь-коли без попередження, навіть у випусках мікроверсій.

source: Changes in the C API
pt_br: Alterações na API C

source: The function :c:func:`PySlice_GetIndicesEx` is considered unsafe for resizable sequences. If the slice indices are not instances of :class:`int`, but objects that implement the :meth:`!__index__` method, the sequence can be resized after passing its length to :c:func:`!PySlice_GetIndicesEx`. This can lead to returning indices out of the length of the sequence. For avoiding possible problems use new functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
pt_br: Функція :c:func:`PySlice_GetIndicesEx` вважається небезпечною для послідовностей змінного розміру. Якщо індекси фрагментів не є екземплярами :class:`int`, а об’єктами, які реалізують метод :meth:`!__index__`, розмір послідовності можна змінити після передачі її довжини :c:func:`!PySlice_GetIndicesEx`. Це може призвести до повернення індексів поза довжиною послідовності. Щоб уникнути можливих проблем, використовуйте нові функції :c:func:`PySlice_Unpack` і :c:func:`PySlice_AdjustIndices`. (Надав Сергій Сторчака в :issue:`27867`.)

source: CPython bytecode changes
pt_br: Alterações de bytecode do CPython

source: The file used to override :data:`sys.path` is now called ``<python-executable>._pth`` instead of ``'sys.path'``. See :ref:`windows_finding_modules` for more information. (Contributed by Steve Dower in :issue:`28137`.)
pt_br: Файл, используемый для переопределения :data:`sys.path`, теперь называется ``<python-executable>._pth`` вместо ``'sys.path'``. Дополнительную информацию см. в разделе :ref:`windows_finding_modules`. (Предоставлено Стивом Дауэром в :issue:`28137`.)

source: Other CPython implementation changes
pt_br: Інші зміни реалізації CPython

source: In preparation for potential future changes to the public CPython runtime initialization API (see :pep:`432` for an initial, but somewhat outdated, draft), CPython's internal startup and configuration management logic has been significantly refactored. While these updates are intended to be entirely transparent to both embedding applications and users of the regular CPython CLI, they're being mentioned here as the refactoring changes the internal order of various operations during interpreter startup, and hence may uncover previously latent defects, either in embedding applications, or in CPython itself. (Initially contributed by Nick Coghlan and Eric Snow as part of :issue:`22257`, and further updated by Nick, Eric, and Victor Stinner in a number of other issues). Some known details affected:
pt_br: Готуючись до потенційних майбутніх змін у загальнодоступному API ініціалізації середовища виконання CPython (перегляньте :pep:`432` для початкового, але дещо застарілого чернетки), внутрішню логіку запуску та керування конфігурацією CPython було значно перероблено. Хоча ці оновлення мають бути повністю прозорими як для програм для вбудовування, так і для користувачів звичайного CLI CPython, вони згадуються тут, оскільки рефакторинг змінює внутрішній порядок різних операцій під час запуску інтерпретатора, і, отже, може виявити раніше приховані дефекти, або у програмах для вбудовування або в самому CPython. (Спочатку створено Ніком Когланом і Еріком Сноу як частину :issue:`22257`, а потім оновлено Ніком, Еріком і Віктором Стіннером у ряді інших випусків). Впливають деякі відомі деталі:

source: :c:func:`PySys_AddWarnOptionUnicode` is not currently usable by embedding applications due to the requirement to create a Unicode object prior to calling ``Py_Initialize``. Use :c:func:`PySys_AddWarnOption` instead.
pt_br: :c:func:`PySys_AddWarnOptionUnicode` в настоящее время нельзя использовать для встраивания приложений из-за требования создания объекта Unicode перед вызовом ``Py_Initialize``. Вместо этого используйте :c:func:`PySys_AddWarnOption`.

source: warnings filters added by an embedding application with :c:func:`PySys_AddWarnOption` should now more consistently take precedence over the default filters set by the interpreter
pt_br: фільтри попереджень, додані програмою для вбудовування за допомогою :c:func:`PySys_AddWarnOption`, тепер мають більш узгоджено мати перевагу над фільтрами за замовчуванням, установленими інтерпретатором

source: Due to changes in the way the default warnings filters are configured, setting :c:data:`Py_BytesWarningFlag` to a value greater than one is no longer sufficient to both emit :exc:`BytesWarning` messages and have them converted to exceptions. Instead, the flag must be set (to cause the warnings to be emitted in the first place), and an explicit ``error::BytesWarning`` warnings filter added to convert them to exceptions.
pt_br: Через зміни в способі налаштування фільтрів попереджень за замовчуванням встановлення :c:data:`Py_BytesWarningFlag` значення, більшого за одиницю, більше не є достатнім для видачі повідомлень :exc:`BytesWarning` і їх перетворення на винятки. Натомість потрібно встановити прапорець (щоб спершу видавати попередження) і додати явний фільтр попереджень ``error::BytesWarning``, щоб перетворити їх на винятки.

source: Due to a change in the way docstrings are handled by the compiler, the implicit ``return None`` in a function body consisting solely of a docstring is now marked as occurring on the same line as the docstring, not on the function's header line.
pt_br: У зв’язку зі зміною способу обробки рядків документації компілятором неявне "повернення None" у тілі функції, що складається виключно з рядка документації, тепер позначається як таке, що міститься в тому самому рядку, що й рядок документації, а не в рядку заголовка функції. .

source: The current exception state has been moved from the frame object to the co-routine. This simplified the interpreter and fixed a couple of obscure bugs caused by having swap exception state when entering or exiting a generator. (Contributed by Mark Shannon in :issue:`25612`.)
pt_br: Поточний винятковий стан було переміщено з об’єкта кадру до спільної процедури. Це спростило інтерпретатор і виправило кілька незрозумілих помилок, спричинених зміною виняткового стану під час входу або виходу з генератора. (Надав Марк Шеннон у :issue:`25612`.)

source: Notable changes in Python 3.7.1
pt_br: Perubahan penting di Python 3.7.1

source: Starting in 3.7.1, :c:func:`Py_Initialize` now consistently reads and respects all of the same environment settings as :c:func:`Py_Main` (in earlier Python versions, it respected an ill-defined subset of those environment variables, while in Python 3.7.0 it didn't read any of them due to :issue:`34247`). If this behavior is unwanted, set :c:data:`Py_IgnoreEnvironmentFlag` to 1 before calling :c:func:`Py_Initialize`.
pt_br: Починаючи з версії 3.7.1, :c:func:`Py_Initialize` тепер узгоджено читає та поважає всі ті самі параметри середовища, що й :c:func:`Py_Main` (у попередніх версіях Python він поважав неправильно визначену підмножину цього середовища змінні, тоді як у Python 3.7.0 він не читав жодної з них через :issue:`34247`). Якщо така поведінка є небажаною, встановіть :c:data:`Py_IgnoreEnvironmentFlag` на 1 перед викликом :c:func:`Py_Initialize`.

source: In 3.7.1 the C API for Context Variables :ref:`was updated <contextvarsobjects_pointertype_change>` to use :c:type:`PyObject` pointers. See also :issue:`34762`.
pt_br: У версії 3.7.1 C API для змінних контексту :ref:`було оновлено <contextvarsobjects_pointertype_change>` для використання покажчиків :c:type:`PyObject`. Дивіться також :issue:`34762`.

source: In 3.7.1 the :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
pt_br: У версії 3.7.1 модуль :mod:`tokenize` тепер неявно видає маркер ``NEWLINE``, коли надходить із введенням, яке не має кінцевого нового рядка. Ця поведінка тепер відповідає внутрішнім функціям C tokenizer. (Надав Аммар Аскар у :issue:`33899`.)

source: Notable changes in Python 3.7.2
pt_br: Perubahan penting di Python 3.7.2

source: In 3.7.2, :mod:`venv` on Windows no longer copies the original binaries, but creates redirector scripts named ``python.exe`` and ``pythonw.exe`` instead. This resolves a long standing issue where all virtual environments would have to be upgraded or recreated with each Python update. However, note that this release will still require recreation of virtual environments in order to get the new scripts.
pt_br: У версії 3.7.2 :mod:`venv` у Windows більше не копіює оригінальні двійкові файли, а замість них створює сценарії перенаправлення під назвами ``python.exe`` і ``pythonw.exe``. Це вирішує давню проблему, коли всі віртуальні середовища потрібно було оновлювати або створювати заново з кожним оновленням Python. Однак зауважте, що для отримання нових сценаріїв цей випуск все одно потребуватиме відтворення віртуальних середовищ.

source: Notable changes in Python 3.7.6
pt_br: Помітні зміни в Python 3.7.6

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
pt_br: Devido a significativas preocupações de segurança, o parâmetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` não é mais suportado. Isso ocorre devido ao comportamento da opção de soquete ``SO_REUSEADDR`` no UDP. Para mais detalhes, consulte a documentação de ``loop.create_datagram_endpoint()``. (Contribuição de Kyle Stanley, Antoine Pitrou e Yury Selivanov em :issue:`37228`.)

source: Notable changes in Python 3.7.10
pt_br: Помітні зміни в Python 3.7.10

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
pt_br: Versões anteriores do Python permitiam o uso de ``;`` e ``&`` como separadores de parâmetros de consulta nas funções :func:`urllib.parse.parse_qs` e :func:`urllib.parse.parse_qsl`. Devido a questões de segurança, e em conformidade com as recomendações mais recentes do W3C, isso foi alterado para permitir apenas uma única chave separadora, com ``&`` como padrão. Esta mudança também afeta as funções :func:`cgi.parse` e :func:`cgi.parse_multipart` já que elas usam as funções afetadas internamente. Para obter mais detalhes, consulte sua respectiva documentação. (Contribuição de Adam Goldschmidt, Senthil Kumaran e Ken Jin em :issue:`42967`.)

source: Notable changes in Python 3.7.11
pt_br: Заметные изменения в Python 3.7.11
