Repository: python/python-docs-pt-br
Catalog: whatsnew/3.8.po
Languages: pt_br

source: What's New In Python 3.8
pt_br: O que há de novo no Python 3.8

source: This article explains the new features in Python 3.8, compared to 3.7. Python 3.8 was released on October 14, 2019. For full details, see the :ref:`changelog <changelog>`.
pt_br: Este artigo explica os novos recursos no Python 3.8, em comparação com 3.7. Python 3.8 foi lançado em 14 de outubro de 2019. Veja :ref:`changelog<changelog>` para uma lista completa de mudanças.

source: Summary -- Release highlights
pt_br: Resumo -- Destaques da versão

source: New Features
pt_br: Novas funcionalidades

source: Assignment expressions
pt_br: Expressões de atribuição

source: There is new syntax ``:=`` that assigns values to variables as part of a larger expression. It is affectionately known as "the walrus operator" due to its resemblance to `the eyes and tusks of a walrus <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168).jpg>`_.
pt_br: Existe uma nova sintaxe ``:=`` que atribui valores a variáveis como parte de uma expressão maior. É carinhosamente conhecido como "o operador morsa" ("the walrus operator", em inglês) devido à sua semelhança com `os olhos e presas de uma morsa <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168).jpg>`_

source: In this example, the assignment expression helps avoid calling :func:`len` twice::
pt_br: Neste exemplo, a expressão de atribuição ajuda a evitar a chamada de :func:`len` duas vezes::

source: A similar benefit arises during regular expression matching where match objects are needed twice, once to test whether a match occurred and another to extract a subgroup::
pt_br: Um benefício semelhante surge durante a correspondência de expressões regulares, onde os objetos de correspondência são necessários duas vezes, uma vez para testar se ocorreu uma correspondência e outra para extrair um subgrupo::

source: The operator is also useful with while-loops that compute a value to test loop termination and then need that same value again in the body of the loop::
pt_br: O operador também é útil com loops while que calculam um valor para testar a finalização do loop e, em seguida, precisam desse mesmo valor novamente no corpo do loop::

source: Another motivating use case arises in list comprehensions where a value computed in a filtering condition is also needed in the expression body::
pt_br: Outro caso de uso motivador surge em compreensões de lista em que um valor calculado em uma condição de filtragem também é necessário no corpo da expressão::

source: Try to limit use of the walrus operator to clean cases that reduce complexity and improve readability.
pt_br: Tente limitar o uso do operador morsa para limpar os casos que reduzem a complexidade e melhoram a legibilidade.

source: See :pep:`572` for a full description.
pt_br: Consulte :pep:`572` para uma descrição completa.

source: (Contributed by Emily Morehouse in :issue:`35224`.)
pt_br: (Contribuição de Emily Morehouse em :issue:`35224`.)

source: Positional-only parameters
pt_br: Parâmetros somente-posicionais

source: There is a new function parameter syntax ``/`` to indicate that some function parameters must be specified positionally and cannot be used as keyword arguments. This is the same notation shown by ``help()`` for C functions annotated with Larry Hastings' `Argument Clinic <https://devguide.python.org/development-tools/clinic/>`__ tool.
pt_br: Existe uma nova sintaxe de parâmetro de função ``/`` para indicar que alguns parâmetros de função devem ser especificados posicionalmente e não podem ser usados como argumentos nomeados. Esta é a mesma notação mostrada por ``help()`` para funções C anotadas com a ferramenta `Argument Clinic <https://devguide.python.org/development-tools/clinic/>`_ de Larry Hastings.

source: In the following example, parameters *a* and *b* are positional-only, while *c* or *d* can be positional or keyword, and *e* or *f* are required to be keywords::
pt_br: No exemplo a seguir, os parâmetros *a* e *b* são apenas posicionais, enquanto *c* ou *d* podem ser posicionais ou nomeados e *e* ou *f* são obrigatoriamente nomeados::

source: The following is a valid call::
pt_br: A seguir, uma chamada válida::

source: However, these are invalid calls::
pt_br: Porém, essas chamadas são inválidas::

source: One use case for this notation is that it allows pure Python functions to fully emulate behaviors of existing C coded functions. For example, the built-in :func:`divmod` function does not accept keyword arguments::
pt_br: Um caso de uso para essa notação é que ele permite que funções puras do Python emulem completamente os comportamentos das funções codificadas em C existentes. Por exemplo, a função embutida :func:`divmod` não aceita argumentos nomeados::

source: Another use case is to preclude keyword arguments when the parameter name is not helpful. For example, the builtin :func:`len` function has the signature ``len(obj, /)``. This precludes awkward calls such as::
pt_br: Outro caso de uso é impedir argumentos nomeados quando o nome do parâmetro não for útil. Por exemplo, a função embutida :func:`len` possui a assinatura ``len(obj, /)``. Isso exclui chamadas estranhas, como::

source: A further benefit of marking a parameter as positional-only is that it allows the parameter name to be changed in the future without risk of breaking client code. For example, in the :mod:`statistics` module, the parameter name *dist* may be changed in the future. This was made possible with the following function specification::
pt_br: Um benefício adicional de marcar um parâmetro como somente posicional é que ele permite que o nome do parâmetro seja alterado no futuro sem risco de quebrar o código do cliente. Por exemplo, no módulo :mod:`statistics`, o nome do parâmetro *dist* pode ser alterado no futuro. Isso foi possível com a seguinte especificação de função::

source: Since the parameters to the left of ``/`` are not exposed as possible keywords, the parameters names remain available for use in ``**kwargs``::
pt_br: Como os parâmetros à esquerda de ``/`` não são expostos como possíveis palavras-chave, os nomes dos parâmetros permanecem disponíveis para uso em ``**kwargs``::

source: This greatly simplifies the implementation of functions and methods that need to accept arbitrary keyword arguments. For example, here is an excerpt from code in the :mod:`collections` module::
pt_br: Isso simplifica bastante a implementação de funções e métodos que precisam aceitar argumentos nomeados arbitrários. Por exemplo, aqui está um trecho do código no módulo :mod:`collections`::

source: See :pep:`570` for a full description.
pt_br: Consulte a :pep:`570` para uma descrição completa.

source: (Contributed by Pablo Galindo in :issue:`36540`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`36540`.)

source: Parallel filesystem cache for compiled bytecode files
pt_br: Cache do sistema de arquivos paralelo para arquivos de bytecode compilados

source: The new :envvar:`PYTHONPYCACHEPREFIX` setting (also available as :option:`-X` ``pycache_prefix``) configures the implicit bytecode cache to use a separate parallel filesystem tree, rather than the default ``__pycache__`` subdirectories within each source directory.
pt_br: A nova configuração :envvar:`PYTHONPYCACHEPREFIX` (também disponível como :option:`-X` ``pycache_prefix``) configura o cache implícito de bytecode para usar uma árvore paralela separada do sistema de arquivos, em vez dos subdiretórios padrão ``__pycache__`` dentro cada diretório fonte.

source: The location of the cache is reported in :data:`sys.pycache_prefix` (:const:`None` indicates the default location in ``__pycache__`` subdirectories).
pt_br: O local do cache é relatado em :data:`sys.pycache_prefix` (:const:`None` indica o local padrão nos subdiretórios ``__pycache__``).

source: (Contributed by Carl Meyer in :issue:`33499`.)
pt_br: (Contribuição de Carl Meyer em :issue:`33499`.)

source: Debug build uses the same ABI as release build
pt_br: A compilação de depuração usa a mesma ABI da compilação de lançamento

source: Python now uses the same ABI whether it's built in release or debug mode. On Unix, when Python is built in debug mode, it is now possible to load C extensions built in release mode and C extensions built using the stable ABI.
pt_br: Agora, o Python usa a mesma ABI, seja ele compilado no modo de lançamento ou depuração. No Unix, quando o Python é compilado no modo de depuração, agora é possível carregar extensões C compiladas no modo de lançamento e extensões C compiladas usando a ABI estável.

source: Release builds and :ref:`debug builds <debug-build>` are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro, which introduces the only ABI incompatibility. The ``Py_TRACE_REFS`` macro, which adds the :func:`sys.getobjects` function and the :envvar:`PYTHONDUMPREFS` environment variable, can be set using the new :option:`./configure --with-trace-refs <--with-trace-refs>` build option. (Contributed by Victor Stinner in :issue:`36465`.)
pt_br: Compilações de lançamento e :ref:`compilações de depuração <debug-build>` agora são compatíveis com ABI: definir a macro ``Py_DEBUG`` não implica mais a macro ``Py_TRACE_REFS``, que introduz a única incompatibilidade ABI. A macro ``Py_TRACE_REFS``, que adiciona a função :func:`sys.getobjects` e a variável de ambiente :envvar:`PYTHONDUMPREFS`, pode ser configurada usando a nova opção de compilação :option:`./configure --with-trace-refs <--with-trace-refs>`. (Contribuição de Victor Stinner em :issue:`36465`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. It is now possible for a statically linked Python to load a C extension built using a shared library Python. (Contributed by Victor Stinner in :issue:`21536`.)
pt_br: No Unix, as extensões C não estão mais vinculadas ao libpython, exceto no Android e Cygwin. Agora é possível que um Python vinculado estaticamente carregue uma extensão C criada usando uma biblioteca compartilhada Python. (Contribuição de Victor Stinner em :issue:`21536`.)

source: On Unix, when Python is built in debug mode, import now also looks for C extensions compiled in release mode and for C extensions compiled with the stable ABI. (Contributed by Victor Stinner in :issue:`36722`.)
pt_br: No Unix, quando o Python é compilado no modo de depuração, a importação agora também procura extensões C compiladas no modo de lançamento e extensões C compiladas com a ABI estável. (Contribuição de Victor Stinner em :issue:`36722`.)

source: To embed Python into an application, a new ``--embed`` option must be passed to ``python3-config --libs --embed`` to get ``-lpython3.8`` (link the application to libpython). To support both 3.8 and older, try ``python3-config --libs --embed`` first and fallback to ``python3-config --libs`` (without ``--embed``) if the previous command fails.
pt_br: Para incorporar o Python em uma aplicação, uma nova opção ``--embed`` deve ser passada para ``python3-config --libs --embed`` para obter o ``-lpython3.8`` (vincula a aplicação ao libpython). Para dar suporte a 3.8 e versões mais antigas, tente ``python3-config --libs --embed`` primeiro e use como fallback para ``python3-config --libs`` (sem ``--embed``) se o comando anterior falhar.

source: Add a pkg-config ``python-3.8-embed`` module to embed Python into an application: ``pkg-config python-3.8-embed --libs`` includes ``-lpython3.8``. To support both 3.8 and older, try ``pkg-config python-X.Y-embed --libs`` first and fallback to ``pkg-config python-X.Y --libs`` (without ``--embed``) if the previous command fails (replace ``X.Y`` with the Python version).
pt_br: Adicione um módulo pkg-config ``python-3.8-embed`` para incorporar o Python em uma aplicação: ``pkg-config python-3.8-embed --libs`` inclui ``-lpython3.8``. Para suportar tanto o 3.8 quanto o anterior, tente ``pkg-config python-X.Y-embed --libs`` primeiro e use como fallback ``pkg-config python-X.Y --libs`` (sem ``--embed``) se o comando anterior falhar (substitua ``X.Y`` pela versão do Python).

source: On the other hand, ``pkg-config python3.8 --libs`` no longer contains ``-lpython3.8``. C extensions must not be linked to libpython (except on Android and Cygwin, whose cases are handled by the script); this change is backward incompatible on purpose. (Contributed by Victor Stinner in :issue:`36721`.)
pt_br: Por outro lado, ``pkg-config python3.8 --libs`` não contém mais ``-lpython3.8``. As extensões C não devem estar vinculadas ao libpython (exceto no Android e Cygwin, cujos casos são tratados pelo script); essa alteração é retroativamente incompatível de propósito. (Contribuição de Victor Stinner em :issue:`36721`.)

source: f-strings support ``=`` for self-documenting expressions and debugging
pt_br: O suporte a f-strings ``=`` para expressões de auto-documentação e depuração

source: Added an ``=`` specifier to :term:`f-string`\s. An f-string such as ``f'{expr=}'`` will expand to the text of the expression, an equal sign, then the representation of the evaluated expression. For example:
pt_br: Adicionado um especificador ``=`` para :term:`f-string`\s. Uma f-string como ``f'{expr=}'`` será expandida para o texto da expressão, um sinal de igual e, em seguida, a representação da expressão avaliada. Por exemplo:

source: The usual :ref:`f-string format specifiers <f-strings>` allow more control over how the result of the expression is displayed::
pt_br: O habitual :ref:`f-string especificadores de formato <f-strings>` permite mais controle sobre como o resultado da expressão é exibido::

source: The ``=`` specifier will display the whole expression so that calculations can be shown::
pt_br: O especificador ``=`` exibirá toda a expressão para que os cálculos possam ser mostrados::

source: (Contributed by Eric V. Smith and Larry Hastings in :issue:`36817`.)
pt_br: (Contribuição de Eric V. Smith e Larry Hastings em :issue:`36817`.)

source: PEP 578: Python Runtime Audit Hooks
pt_br: PEP 578: Ganchos de auditoria em tempo de execução Python

source: The PEP adds an Audit Hook and Verified Open Hook. Both are available from Python and native code, allowing applications and frameworks written in pure Python code to take advantage of extra notifications, while also allowing embedders or system administrators to deploy builds of Python where auditing is always enabled.
pt_br: O PEP adiciona um Gancho de Auditoria e um Gancho Aberto Verificado. Ambos estão disponíveis no Python e no código nativo, permitindo que aplicações e estruturas escritas em código Python puro aproveitem as notificações extras, além de permitir que incorporadores ou administradores de sistema implementem versões do Python onde a auditoria está sempre ativada.

source: See :pep:`578` for full details.
pt_br: Veja :pep:`578` para mais detalhes.

source: PEP 587: Python Initialization Configuration
pt_br: PEP 587: Configuração de Inicialização do Python

source: The :pep:`587` adds a new C API to configure the Python Initialization providing finer control on the whole configuration and better error reporting.
pt_br: O :pep:`587` adiciona uma nova API C para configurar a Inicialização do Python, fornecendo um controle mais preciso de toda a configuração e melhores relatórios de erros.

source: New structures:
pt_br: Novas estruturas:

source: New functions:
pt_br: Novas Funções:

source: This PEP also adds ``_PyRuntimeState.preconfig`` (:c:type:`PyPreConfig` type) and ``PyInterpreterState.config`` (:c:type:`PyConfig` type) fields to these internal structures. ``PyInterpreterState.config`` becomes the new reference configuration, replacing global configuration variables and other private variables.
pt_br: Esse PEP também adiciona os campos ``_PyRuntimeState.preconfig`` (tipo :c:type:`PyPreConfig`) e ``PyInterpreterState.config`` (tipo :c:type:`PyConfig`) campos a essas estruturas internas. ``PyInterpreterState.config`` se torna a nova configuração de referência, substituindo variáveis de configuração global e outras variáveis privadas.

source: See :ref:`Python Initialization Configuration <init-config>` for the documentation.
pt_br: Veja :ref:`Configuração de Inicialização do Python <init-config>` para a documentação.

source: See :pep:`587` for a full description.
pt_br: Consulte a :pep:`587` para uma descrição completa.

source: (Contributed by Victor Stinner in :issue:`36763`.)
pt_br: (Contribuição de Victor Stinner em :issue:`36763`.)

source: PEP 590: Vectorcall: a fast calling protocol for CPython
pt_br: PEP 590: Vectorcall: um protocolo de chamada rápida para CPython

source: :ref:`vectorcall` is added to the Python/C API. It is meant to formalize existing optimizations which were already done for various classes. Any :ref:`static type <static-types>` implementing a callable can use this protocol.
pt_br: :ref:`vectorcall` é adicionado à API Python/C. Ele visa formalizar as otimizações existentes que já foram feitas para várias classes. Qualquer :ref:`tipo estático <static-types>` que implemente um chamável pode usar esse protocolo.

source: This is currently provisional. The aim is to make it fully public in Python 3.9.
pt_br: Atualmente, isso é provisório. O objetivo é torná-lo totalmente público no Python 3.9.

source: See :pep:`590` for a full description.
pt_br: Consulte a :pep:`590` para uma descrição completa.

source: (Contributed by Jeroen Demeyer, Mark Shannon and Petr Viktorin in :issue:`36974`.)
pt_br: (Contribuição de Jeroen Demeyer, Mark Shannon e Petr Viktorin em :issue:`36974`.)

source: Pickle protocol 5 with out-of-band data buffers
pt_br: Protocolo de Pickle 5 com buffers de dados fora da banda

source: When :mod:`pickle` is used to transfer large data between Python processes in order to take advantage of multi-core or multi-machine processing, it is important to optimize the transfer by reducing memory copies, and possibly by applying custom techniques such as data-dependent compression.
pt_br: Quando :mod:`pickle` é usado para transferir grande quantidade de dados entre processos Python, a fim de tirar proveito do processamento com vários núcleos ou com várias máquinas, é importante otimizar a transferência reduzindo cópias de memória e, possivelmente, aplicando técnicas personalizadas, como como compactação dependente de dados.

source: The :mod:`pickle` protocol 5 introduces support for out-of-band buffers where :pep:`3118`-compatible data can be transmitted separately from the main pickle stream, at the discretion of the communication layer.
pt_br: O protocolo :mod:`pickle` 5 introduz suporte para buffers fora de banda, onde dados compatíveis com a :pep:`3118` podem ser transmitidos separadamente do fluxo de pickle principal, a critério da camada de comunicação.

source: See :pep:`574` for a full description.
pt_br: Consulte a :pep:`574` para uma descrição completa.

source: (Contributed by Antoine Pitrou in :issue:`36785`.)
pt_br: (Contribuição de Antoine Pitrou em :issue:`36785`.)

source: Other Language Changes
pt_br: Outras mudanças na linguagem

source: A :keyword:`continue` statement was illegal in the :keyword:`finally` clause due to a problem with the implementation. In Python 3.8 this restriction was lifted. (Contributed by Serhiy Storchaka in :issue:`32489`.)
pt_br: A instrução :keyword:`continue` era ilegal na cláusula :keyword:`finally` devido a um problema com a implementação. No Python 3.8, essa restrição foi levantada. (Contribuição de Serhiy Storchaka em :issue:`32489`.)

source: The :class:`bool`, :class:`int`, and :class:`fractions.Fraction` types now have an :meth:`~int.as_integer_ratio` method like that found in :class:`float` and :class:`decimal.Decimal`. This minor API extension makes it possible to write ``numerator, denominator = x.as_integer_ratio()`` and have it work across multiple numeric types. (Contributed by Lisa Roach in :issue:`33073` and Raymond Hettinger in :issue:`37819`.)
pt_br: Os tipos :class:`bool`, :class:`int` e :class:`fractions.Fraction` agora têm o método :meth:`~int.as_integer_ratio` como o encontrado em :class:`float` e :class:`decimal.Decimal`. Esta pequena extensão da API torna possível escrever ``numerator, denominator = x.as_integer_ratio()`` e fazer com que funcione em vários tipos numéricos. (Contribuição de Lisa Roach em :issue:`33073` e Raymond Hettinger em :issue:`37819`.)

source: Constructors of :class:`int`, :class:`float` and :class:`complex` will now use the :meth:`~object.__index__` special method, if available and the corresponding method :meth:`~object.__int__`, :meth:`~object.__float__` or :meth:`~object.__complex__` is not available. (Contributed by Serhiy Storchaka in :issue:`20092`.)
pt_br: Os construtores de :class:`int`, :class:`float` e :class:`complex` agora usarão o método especial :meth:`~object.__index__`, se disponível, e o método correspondente :meth:`~object.__int__`, :meth:`~object.__float__` ou :meth:`~object.__complex__` não está disponível. (Contribuição de Serhiy Storchaka em :issue:`20092`.)

source: Added support of :samp:`\\N\\{{name}\\}` escapes in :mod:`regular expressions <re>`::
pt_br: Adicionado suporte a escapes :samp:`\\N\\{{name}\\}` em :mod:`expressões regulares <re>`::

source: (Contributed by Jonathan Eunice and Serhiy Storchaka in :issue:`30688`.)
pt_br: (Contribuição de Jonathan Eunice e Serhiy Storchaka em :issue:`30688`.)

source: Dict and dictviews are now iterable in reversed insertion order using :func:`reversed`. (Contributed by Rémi Lapeyre in :issue:`33462`.)
pt_br: Dict e dictviews agora são iteráveis em ordem de inserção reversa usando :func:`reversed`. (Contribuição de Rémi Lapeyre em :issue:`33462`.)

source: The syntax allowed for keyword names in function calls was further restricted. In particular, ``f((keyword)=arg)`` is no longer allowed. It was never intended to permit more than a bare name on the left-hand side of a keyword argument assignment term. (Contributed by Benjamin Peterson in :issue:`34641`.)
pt_br: A sintaxe permitida para nomes de palavras-chave em chamadas de função foi ainda mais restrita. Em particular, ``f((keyword)=arg)`` não é mais permitido. Ele nunca teve a intenção de permitir mais do que um nome simples no lado esquerdo de um termo de atribuição de argumento nomeado. (Contribuição de Benjamin Peterson em :issue:`34641`.)

source: Generalized iterable unpacking in :keyword:`yield` and :keyword:`return` statements no longer requires enclosing parentheses. This brings the *yield* and *return* syntax into better agreement with normal assignment syntax::
pt_br: O desempacotamento de iterável generalizado das instruções :keyword:`yield` e :keyword:`return` não requer mais parênteses. Isso traz a sintaxe *yield* e *return* uma melhor concordância com a sintaxe de atribuição normal::

source: (Contributed by David Cuthbert and Jordan Chapman in :issue:`32117`.)
pt_br: (Contribuição de David Cuthbert e Jordan Chapman em :issue:`32117`.)

source: When a comma is missed in code such as ``[(10, 20) (30, 40)]``, the compiler displays a :exc:`SyntaxWarning` with a helpful suggestion. This improves on just having a :exc:`TypeError` indicating that the first tuple was not callable. (Contributed by Serhiy Storchaka in :issue:`15248`.)
pt_br: Quando uma vírgula está faltando em código como ``[(10, 20) (30, 40)]``, o compilador exibe um :exc:`SyntaxWarning` com uma sugestão útil. Isso melhora apenas tendo um :exc:`TypeError` indicando que a primeira tupla não era chamável. (Contribuição de Serhiy Storchaka em :issue:`15248`.)
