Repository: python/python-docs-pt-br
Catalog: whatsnew/3.8.po
Languages: pt_br

source: Arithmetic operations between subclasses of :class:`datetime.date` or :class:`datetime.datetime` and :class:`datetime.timedelta` objects now return an instance of the subclass, rather than the base class. This also affects the return type of operations whose implementation (directly or indirectly) uses :class:`datetime.timedelta` arithmetic, such as :meth:`~datetime.datetime.astimezone`. (Contributed by Paul Ganssle in :issue:`32417`.)
pt_br: As operações aritméticas entre as subclasses de :class:`datetime.date` ou :class:`datetime.datetime` e :class:`datetime.timedelta` agora retornam uma instância da subclasse, em vez da classe base. Isso também afeta o tipo de retorno de operações cuja implementação (direta ou indiretamente) utiliza aritmética de :class:`datetime.timedelta`, como :meth:`~datetime.datetime.astimezone`. (Contribuição de Paul Ganssle em :issue:`32417`.)

source: When the Python interpreter is interrupted by Ctrl-C (SIGINT) and the resulting :exc:`KeyboardInterrupt` exception is not caught, the Python process now exits via a SIGINT signal or with the correct exit code such that the calling process can detect that it died due to a Ctrl-C. Shells on POSIX and Windows use this to properly terminate scripts in interactive sessions. (Contributed by Google via Gregory P. Smith in :issue:`1054041`.)
pt_br: Quando o interpretador Python é interrompido por Ctrl-C (SIGINT) e a exceção resultante :exc:`KeyboardInterrupt` não é capturada, o processo Python agora sai por meio de um sinal SIGINT ou com o código de saída correto, para que o processo de chamada possa detectar que foi encerrado devido a um Ctrl-C. Os shells no POSIX e Windows usam isso para finalizar corretamente os scripts em sessões interativas. (Contribuição do Google via Gregory P. Smith em :issue:`1054041`.)

source: Some advanced styles of programming require updating the :class:`types.CodeType` object for an existing function. Since code objects are immutable, a new code object needs to be created, one that is modeled on the existing code object. With 19 parameters, this was somewhat tedious. Now, the new ``replace()`` method makes it possible to create a clone with a few altered parameters.
pt_br: Alguns estilos avançados de programação requerem a atualização do objeto :class:`types.CodeType` para uma função existente. Como os objetos código são imutáveis, um novo objeto código precisa ser criado, modelado no objeto código existente. Com 19 parâmetros, isso foi um pouco tedioso. Agora, o novo método ``replace()`` torna possível criar um clone com alguns parâmetros alterados.

source: Here's an example that alters the :func:`statistics.mean` function to prevent the *data* parameter from being used as a keyword argument::
pt_br: Aqui está um exemplo que altera a função :func:`Statistics.mean` para impedir que o parâmetro *data* seja usado como argumento nomeado::

source: (Contributed by Victor Stinner in :issue:`37032`.)
pt_br: (Contribuição de Victor Stinner em :issue:`37032`.)

source: For integers, the three-argument form of the :func:`pow` function now permits the exponent to be negative in the case where the base is relatively prime to the modulus. It then computes a modular inverse to the base when the exponent is ``-1``, and a suitable power of that inverse for other negative exponents. For example, to compute the `modular multiplicative inverse <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ of 38 modulo 137, write::
pt_br: Para números inteiros, a forma de três argumentos da função :func:`pow` agora permite que o expoente seja negativo no caso em que a base é relativamente primária ao módulo. Em seguida, calcula um inverso modular para a base quando o expoente é ``-1`` e uma potência adequada desse inverso para outros expoentes negativos. Por exemplo, para calcular o `inverso multiplicativo modular <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ de 38 módulo 137, escreva::

source: Modular inverses arise in the solution of `linear Diophantine equations <https://en.wikipedia.org/wiki/Diophantine_equation>`_. For example, to find integer solutions for ``4258𝑥 + 147𝑦 = 369``, first rewrite as ``4258𝑥 ≡ 369 (mod 147)`` then solve:
pt_br: Inversos modulares surgem na solução de `equações diofantinas lineares <https://en.wikipedia.org/wiki/Diophantine_equation>`_. Por exemplo, para encontrar soluções inteiras para ``4258𝑥 + 147𝑦 = 369``, primeiro reescreva como ``4258𝑥 ≡ 369 (mod 147)`` e depois resolva:

source: (Contributed by Mark Dickinson in :issue:`36027`.)
pt_br: (Contribuição de Mark Dickinson em :issue:`36027`.)

source: Dict comprehensions have been synced-up with dict literals so that the key is computed first and the value second::
pt_br: As compreensões de dict foram sincronizadas com literais de dict, para que a chave seja computada primeiro e o valor em segundo::

source: The guaranteed execution order is helpful with assignment expressions because variables assigned in the key expression will be available in the value expression::
pt_br: A ordem de execução garantida é útil nas expressões de atribuição, porque as variáveis atribuídas na expressão de chave estarão disponíveis na expressão de valor::

source: (Contributed by Jörn Heissler in :issue:`35224`.)
pt_br: (Contribuição de Jörn Heissler em :issue:`35224`.)

source: The :meth:`object.__reduce__` method can now return a tuple from two to six elements long. Formerly, five was the limit. The new, optional sixth element is a callable with a ``(obj, state)`` signature. This allows the direct control over the state-updating behavior of a specific object. If not *None*, this callable will have priority over the object's :meth:`~__setstate__` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
pt_br: O método :meth:`object.__reduce__` agora pode retornar uma tupla de dois a seis elementos. Anteriormente, cinco era o limite. O novo sexto elemento opcional é um chamável com uma assinatura ``(obj, state)``. Isso permite o controle direto sobre o comportamento de atualização de estado de um objeto específico. Caso contrário, *None*, esse chamável terá prioridade sobre o método :meth:`~__setstate__` do objeto. (Contribuição de Pierre Glaser e Olivier Grisel em :issue:`35900`.)

source: New Modules
pt_br: Novos módulos

source: The new :mod:`importlib.metadata` module provides (provisional) support for reading metadata from third-party packages. For example, it can extract an installed package's version number, list of entry points, and more::
pt_br: O novo módulo :mod:`importlib.metadata` fornece suporte (provisório) para a leitura de metadados de pacotes de terceiros. Por exemplo, ele pode extrair o número da versão de um pacote instalado, a lista de pontos de entrada e muito mais::

source: (Contributed by Barry Warsaw and Jason R. Coombs in :issue:`34632`.)
pt_br: (Contribuição de Barry Warsaw e Jason R. Coombs em :issue:`34632`.)

source: Improved Modules
pt_br: Módulos melhorados

source: AST nodes now have ``end_lineno`` and ``end_col_offset`` attributes, which give the precise location of the end of the node. (This only applies to nodes that have ``lineno`` and ``col_offset`` attributes.)
pt_br: Os nós de AST agora têm os atributos ``end_lineno`` e ``end_col_offset``, que fornecem a localização precisa do final do nó. (Isso se aplica apenas aos nós que possuem os atributos ``lineno`` e ``col_offset``.)

source: New function :func:`ast.get_source_segment` returns the source code for a specific AST node.
pt_br: Nova função :func:`ast.get_source_segment` retorna o código-fonte para um nó AST específico.

source: (Contributed by Ivan Levkivskyi in :issue:`33416`.)
pt_br: (Contribuição de Ivan Levkivskyi em :issue:`33416`.)

source: The :func:`ast.parse` function has some new flags:
pt_br: A função :func:`ast.parse` possui alguns novos sinalizadores:

source: ``type_comments=True`` causes it to return the text of :pep:`484` and :pep:`526` type comments associated with certain AST nodes;
pt_br: ``type_comments=True`` faz com que retorne o texto dos comentários de tipos de :pep:`484` e :pep:`526` associados a determinados nós AST;

source: ``mode='func_type'`` can be used to parse :pep:`484` "signature type comments" (returned for function definition AST nodes);
pt_br: ``mode='func_type'`` pode ser usado para analisar "comentários do tipo de assinatura" do :pep:`484` (retornados para nós AST de definição de função);

source: ``feature_version=(3, N)`` allows specifying an earlier Python 3 version. For example, ``feature_version=(3, 4)`` will treat :keyword:`async` and :keyword:`await` as non-reserved words.
pt_br: ``feature_version=(3, N)`` permite especificar uma versão anterior do Python 3. Por exemplo, ``feature_version=(3, 4)`` tratará :keyword:`async` e :keyword:`await` como palavras não reservadas.

source: (Contributed by Guido van Rossum in :issue:`35766`.)
pt_br: (Contribuição de Guido van Rossum em :issue:`35766`.)

source: :func:`asyncio.run` has graduated from the provisional to stable API. This function can be used to execute a :term:`coroutine` and return the result while automatically managing the event loop. For example::
pt_br: :func:`asyncio.run` passou da API provisória para a estável. Esta função pode ser usada para executar uma :term:`corrotina <coroutine>` e retornar o resultado enquanto gerencia automaticamente o loop de eventos. Por exemplo::

source: This is *roughly* equivalent to::
pt_br: Isso é *aproximadamente* equivalente a::

source: The actual implementation is significantly more complex. Thus, :func:`asyncio.run` should be the preferred way of running asyncio programs.
pt_br: A implementação real é significativamente mais complexa. Assim, :func:`asyncio.run` deve ser a maneira preferida de executar programas assíncronos.

source: (Contributed by Yury Selivanov in :issue:`32314`.)
pt_br: (Contribuição de Yury Selivanov em :issue:`32314`.)

source: Running ``python -m asyncio`` launches a natively async REPL. This allows rapid experimentation with code that has a top-level :keyword:`await`. There is no longer a need to directly call ``asyncio.run()`` which would spawn a new event loop on every invocation:
pt_br: A execução de ``python -m asyncio`` lança um REPL nativo assíncrono. Isso permite a experimentação rápida de código que possui um nível superior :keyword:`await`. Não é mais necessário chamar diretamente ``asyncio.run()``, o que geraria um novo loop de evento a cada chamada:

source: (Contributed by Yury Selivanov in :issue:`37028`.)
pt_br: (Contribuição de Yury Selivanov em :issue:`37028`.)

source: The exception :class:`asyncio.CancelledError` now inherits from :class:`BaseException` rather than :class:`Exception` and no longer inherits from :class:`concurrent.futures.CancelledError`. (Contributed by Yury Selivanov in :issue:`32528`.)
pt_br: A exceção :class:`asyncio.CancelledError` agora herda de :class:`BaseException` em vez de :class:`Exception` e não mais herda de :class:`concurrent.futures.CancelledError`. (Contribuição de Yury Selivanov em :issue:`32528`.)

source: On Windows, the default event loop is now :class:`~asyncio.ProactorEventLoop`. (Contributed by Victor Stinner in :issue:`34687`.)
pt_br: No Windows, o loop de eventos padrão é agora :class:`~asyncio.ProactorEventLoop`. (Contribuição de Victor Stinner em :issue:`34687`.)

source: :class:`~asyncio.ProactorEventLoop` now also supports UDP. (Contributed by Adam Meily and Andrew Svetlov in :issue:`29883`.)
pt_br: :class:`~asyncio.ProactorEventLoop` agora também tem suporte a UDP. (Contribuição de Adam Meily e Andrew Svetlov em :issue:`29883`.)

source: :class:`~asyncio.ProactorEventLoop` can now be interrupted by :exc:`KeyboardInterrupt` ("CTRL+C"). (Contributed by Vladimir Matveev in :issue:`23057`.)
pt_br: :class:`~asyncio.ProactorEventLoop` pode agora ser interrompido por :exc:`KeyboardInterrupt` ("CTRL+C"). (Contribuição de Vladimir Matveev em :issue:`23057`.)

source: Added :meth:`asyncio.Task.get_coro` for getting the wrapped coroutine within an :class:`asyncio.Task`. (Contributed by Alex Grönholm in :issue:`36999`.)
pt_br: Adicionado :meth:`asyncio.Task.get_coro` para obter a corrotina de dentro de um :class:`asyncio.Task`. (Contribuição de Alex Grönholm em :issue:`36999`.)

source: Asyncio tasks can now be named, either by passing the ``name`` keyword argument to :func:`asyncio.create_task` or the :meth:`~asyncio.loop.create_task` event loop method, or by calling the :meth:`~asyncio.Task.set_name` method on the task object. The task name is visible in the ``repr()`` output of :class:`asyncio.Task` and can also be retrieved using the :meth:`~asyncio.Task.get_name` method. (Contributed by Alex Grönholm in :issue:`34270`.)
pt_br: As tarefas de asyncio agora podem ser nomeadas, passando o argumento nomeado ``name`` para :func:`asyncio.create_task` ou o método de loop de evento :meth:`~asyncio.loop.create_task` ou chamando o método :meth:`~asyncio.Task.set_name` no objeto de tarefa. O nome da tarefa é visível na saída de ``repr()`` de :class:`asyncio.Task` e também pode ser recuperado usando o método :meth:`~asyncio.Task.get_name`. (Contribuição de Alex Grönholm em :issue:`34270`.)

source: Added support for `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ to :func:`asyncio.loop.create_connection`. To specify the behavior, two new parameters have been added: *happy_eyeballs_delay* and *interleave*. The Happy Eyeballs algorithm improves responsiveness in applications that support IPv4 and IPv6 by attempting to simultaneously connect using both. (Contributed by twisteroid ambassador in :issue:`33530`.)
pt_br: Adicionado suporte a `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ para :func:`asyncio.loop.create_connection`. Para especificar o comportamento, dois novos parâmetros foram adicionados: *happy_eyeballs_delay* e *interleave*. O algoritmo Happy Eyeballs melhora a capacidade de resposta em aplicativos compatíveis com IPv4 e IPv6, tentando conectar-se simultaneamente usando os dois. (Contribuição de twisteroid ambassador em :issue:`33530`.)

source: The :func:`compile` built-in has been improved to accept the ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` flag. With this new flag passed, :func:`compile` will allow top-level ``await``, ``async for`` and ``async with`` constructs that are usually considered invalid syntax. Asynchronous code object marked with the ``CO_COROUTINE`` flag may then be returned. (Contributed by Matthias Bussonnier in :issue:`34616`)
pt_br: A função embutida :func:`compile` foi aprimorada para aceitar o sinalizador ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT``. Com esse novo sinalizador passado, :func:`compile` permitirá construções de nível superior ``await``, ``async for`` e ``async with`` que geralmente são consideradas sintaxe inválida. O objeto de código assíncrono marcado com o sinalizador ``CO_COROUTINE`` pode ser retornado. (Contribuição de Matthias Bussonnier em :issue:`34616`)

source: The :meth:`~collections.somenamedtuple._asdict` method for :func:`collections.namedtuple` now returns a :class:`dict` instead of a :class:`collections.OrderedDict`. This works because regular dicts have guaranteed ordering since Python 3.7. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``. (Contributed by Raymond Hettinger in :issue:`35864`.)
pt_br: O método :meth:`~collections.somenamedtuple._asdict` para :func:`collections.namedtuple` agora retorna a :class:`dict` em vez de um :class:`collections.OrderedDict`. Isso funciona porque os dict regulares garantem pedidos desde o Python 3.7. Se os recursos extras de :class:`OrderedDict` forem necessários, a solução sugerida é converter o resultado no tipo desejado: ``OrderedDict(nt._asdict())``. (Contribuição de Raymond Hettinger em :issue:`35864`.)

source: The :class:`cProfile.Profile <profile.Profile>` class can now be used as a context manager. Profile a block of code by running::
pt_br: A classe :class:`cProfile.Profile <profile.Profile>` agora pode ser usada como um gerenciador de contexto. Perfile um bloco de código executando::

source: (Contributed by Scott Sanderson in :issue:`29235`.)
pt_br: (Contribuição de Scott Sanderson em :issue:`29235`.)

source: The :class:`csv.DictReader` now returns instances of :class:`dict` instead of a :class:`collections.OrderedDict`. The tool is now faster and uses less memory while still preserving the field order. (Contributed by Michael Selik in :issue:`34003`.)
pt_br: O :class:`csv.DictReader` agora retorna instâncias de :class:`dict` em vez de um :class:`collections.OrderedDict`. Agora, a ferramenta é mais rápida e utiliza menos memória enquanto preserva a ordem dos campos. (Contribuição de Michael Selik em :issue:`34003`.)

source: Added a new variable holding structured version information for the underlying ncurses library: :data:`~curses.ncurses_version`. (Contributed by Serhiy Storchaka in :issue:`31680`.)
pt_br: Adicionada uma nova variável contendo informações de versão estruturada para a biblioteca ncurses subjacente: :data:`~curses.ncurses_version`. (Contribuição de Serhiy Storchaka em :issue:`31680`.)

source: On Windows, :class:`~ctypes.CDLL` and subclasses now accept a *winmode* parameter to specify flags for the underlying ``LoadLibraryEx`` call. The default flags are set to only load DLL dependencies from trusted locations, including the path where the DLL is stored (if a full or partial path is used to load the initial DLL) and paths added by :func:`~os.add_dll_directory`. (Contributed by Steve Dower in :issue:`36085`.)
pt_br: No Windows, :class:`~ctypes.CDLL` e subclasses agora aceitam um parâmetro *winmode* para especificar sinalizadores para a chamada subjacente ``LoadLibraryEx``. Os sinalizadores padrão são definidos para carregar apenas dependências da DLL em locais confiáveis, incluindo o caminho em que a DLL está armazenada (se um caminho completo ou parcial for usado para carregar a DLL inicial) e os caminhos adicionados por :func:`~os.add_dll_directory` . (Contribuição de Steve Dower em :issue:`36085`.)

source: Added new alternate constructors :meth:`datetime.date.fromisocalendar` and :meth:`datetime.datetime.fromisocalendar`, which construct :class:`~datetime.date` and :class:`~datetime.datetime` objects respectively from ISO year, week number, and weekday; these are the inverse of each class's ``isocalendar`` method. (Contributed by Paul Ganssle in :issue:`36004`.)
pt_br: Adicionados novos construtores alternativos :meth:`datetime.date.fromisocalendar` e :meth:`datetime.datetime.fromisocalendar`, que constroem objetos de :class:`~datetime.date` e :class:`~datetime.datetime` respectivamente do ano ISO, número da semana e dia da semana; estes são o inverso do método ``isocalendar`` de cada classe. (Contribuição de Paul Ganssle em :issue:`36004`.)

source: :func:`functools.lru_cache` can now be used as a straight decorator rather than as a function returning a decorator. So both of these are now supported::
pt_br: :func:`functools.lru_cache` agora pode ser usado como um decorador direto, e não como uma função retornando um decorador. Portanto, agora ambos são suportados::

source: (Contributed by Raymond Hettinger in :issue:`36772`.)
pt_br: (Contribuição de Raymond Hettinger em :issue:`36772`.)

source: Added a new :func:`functools.cached_property` decorator, for computed properties cached for the life of the instance. ::
pt_br: Adicionado um novo decorador :func:`functools.cached_property`, para propriedades computadas armazenadas em cache durante toda a vida útil da instância. ::

source: (Contributed by Carl Meyer in :issue:`21145`)
pt_br: (Contribuição de Carl Meyer em :issue:`21145`)

source: Added a new :func:`functools.singledispatchmethod` decorator that converts methods into :term:`generic functions <generic function>` using :term:`single dispatch`::
pt_br: Adicionado um novo decorador :func:`functools.singledispatchmethod` que converte métodos em :term:`funções genéricas <generic function>` usando :term:`despacho único <single dispatch>`::

source: (Contributed by Ethan Smith in :issue:`32380`)
pt_br: (Contribuição de Ethan Smith em :issue:`32380`)

source: :func:`~gc.get_objects` can now receive an optional *generation* parameter indicating a generation to get objects from. (Contributed by Pablo Galindo in :issue:`36016`.)
pt_br: :func:`~gc.get_objects` agora pode receber um parâmetro opcional *generation* indicando uma geração da qual obter objetos. (Contribuição de Pablo Galindo em :issue:`36016`.)

source: Added :func:`~gettext.pgettext` and its variants. (Contributed by Franz Glasner, Éric Araujo, and Cheryl Sabella in :issue:`2504`.)
pt_br: Adicionado :func:`~gettext.pgettext` e suas variantes. (Contribuição de Franz Glasner, Éric Araujo e Cheryl Sabella em :issue:`2504`.)

source: Added the *mtime* parameter to :func:`gzip.compress` for reproducible output. (Contributed by Guo Ci Teo in :issue:`34898`.)
pt_br: Adicionado o parâmetro *mtime* em :func:`gzip.compress` para saída reproduzível. (Contribuição de Guo Ci Teo em :issue:`34898`.)

source: A :exc:`~gzip.BadGzipFile` exception is now raised instead of :exc:`OSError` for certain types of invalid or corrupt gzip files. (Contributed by Filip Gruszczyński, Michele Orrù, and Zackery Spytz in :issue:`6584`.)
pt_br: A exceção :exc:`~gzip.BadGzipFile` agora é levantada em vez de :exc:`OSError` para certos tipos de arquivos gzip inválidos ou corrompidos. (Contribuição de Filip Gruszczyński, Michele Orrù e Zackery Spytz em :issue:`6584`.)

source: IDLE and idlelib
pt_br: IDLE e idlelib

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
pt_br: A saída em N linhas (50 por padrão) é compactada até um limite inferior. N pode ser alterado na seção PyShell da página General da caixa de diálogo Settings. Menos linhas, mas possivelmente extra longas, podem ser espremidas clicando com o botão direito do mouse na saída. A saída compactada pode ser expandida no local clicando duas vezes no botão ou na área de transferência ou em uma janela separada clicando com o botão direito do mouse. (Contribuição de Tal Einat em :issue:`1529353`.)

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They also re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
pt_br: Adiciona "Run Customized" ao menu Executar para executar um módulo com configurações personalizadas. Quaisquer argumentos de linha de comando inseridos são adicionados ao sys.argv. Eles também reaparecem na caixa para a próxima execução personalizada. Pode-se também suprimir a reinicialização normal do módulo principal do console. (Contribuição de Cheryl Sabella, Terry Jan Reedy e outros em :issue:`5680` e :issue:`37627`.)
