Repository: python/python-docs-pt-br
Catalog: whatsnew/3.8.po
Languages: pt_br

source: Functions that convert Python number to C integer like :c:func:`PyLong_AsLong` and argument parsing functions like :c:func:`PyArg_ParseTuple` with integer converting format units like ``'i'`` will now use the :meth:`~object.__index__` special method instead of :meth:`~object.__int__`, if available. The deprecation warning will be emitted for objects with the ``__int__()`` method but without the ``__index__()`` method (like :class:`~decimal.Decimal` and :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` will now return ``1`` for objects implementing ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` and :c:func:`PyFloat_AsDouble` also now use the ``__index__()`` method if available. (Contributed by Serhiy Storchaka in :issue:`36048` and :issue:`20092`.)
pt_br: Funções que convertem um número Python em número inteiro C, como :c:func:`PyLong_AsLong`, e funções de análise de argumentos, como :c:func:`PyArg_ParseTuple`, com unidades de formato de conversão de números inteiros, como ``'i'``, agora usarão o método especial :meth:`~object.__index__` em vez de :meth:`~object.__int__`, se disponível. O aviso de descontinuação será emitido para objetos com o método ``__int__()``, mas sem o método ``__index__()`` (como :class:`~decimal.Decimal` e :class:`~fractions.Fraction` ). :c:func:`PyNumber_Check` agora retornará ``1`` para objetos implementando ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` e :c:func:`PyFloat_AsDouble` agora também usam o método ``__index__()``, se disponível. (Contribuição de Serhiy Storchaka em :issue:`36048` e :issue:`20092`.)

source: Heap-allocated type objects will now increase their reference count in :c:func:`PyObject_Init` (and its parallel macro ``PyObject_INIT``) instead of in :c:func:`PyType_GenericAlloc`. Types that modify instance allocation or deallocation may need to be adjusted. (Contributed by Eddie Elizondo in :issue:`35810`.)
pt_br: Objetos de tipo alocado a heap agora aumentarão sua contagem de referências em :c:func:`PyObject_Init` (e sua macro paralela ``PyObject_INIT``) em vez de em :c:func:`PyType_GenericAlloc`. Os tipos que modificam a alocação ou desalocação de instância podem precisar ser ajustados. (Contribuição de Eddie Elizondo em :issue:`35810`.)

source: The new function :c:func:`!PyCode_NewWithPosOnlyArgs` allows to create code objects like :c:func:`!PyCode_New`, but with an extra *posonlyargcount* parameter for indicating the number of positional-only arguments. (Contributed by Pablo Galindo in :issue:`37221`.)
pt_br: A nova função :c:func:`!PyCode_NewWithPosOnlyArgs` permite criar objetos de código como :c:func:`!PyCode_New`, mas com um parâmetro extra *posonlyargcount* para indicar o número de argumentos somente posicionais. (Contribuição de Pablo Galindo em :issue:`37221`.)

source: :c:func:`!Py_SetPath` now sets :data:`sys.executable` to the program full path (:c:func:`Py_GetProgramFullPath`) rather than to the program name (:c:func:`Py_GetProgramName`). (Contributed by Victor Stinner in :issue:`38234`.)
pt_br: :c:func:`!Py_SetPath` agora define :data:`sys.executable` para o caminho completo do programa (:c:func:`Py_GetProgramFullPath`) em vez do nome do programa (:c:func:`Py_GetProgramName`). (Contribuição de Victor Stinner em :issue:`38234`.)

source: Deprecated
pt_br: Descontinuados

source: The distutils ``bdist_wininst`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Victor Stinner in :issue:`37481`.)
pt_br: O comando distutils ``bdist_wininst`` agora está descontinuado; use ``bdist_wheel`` (pacotes wheel). (Contribuição de Victor Stinner em :issue:`37481`.)

source: Deprecated methods ``getchildren()`` and ``getiterator()`` in the :mod:`~xml.etree.ElementTree` module now emit a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`. They will be removed in Python 3.9. (Contributed by Serhiy Storchaka in :issue:`29209`.)
pt_br: Os métodos descontinuados ``getchildren()`` e ``getiterator()`` no módulo :mod:`~xml.etree.ElementTree` agora emitem um :exc:`DeprecationWarning` em vez de :exc:`PendingDeprecationWarning`. Eles serão removidos no Python 3.9. (Contribuição de Serhiy Storchaka em :issue:`29209`.)

source: Passing an object that is not an instance of :class:`concurrent.futures.ThreadPoolExecutor` to :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` is deprecated and will be prohibited in Python 3.9. (Contributed by Elvis Pranskevichus in :issue:`34075`.)
pt_br: Passar um objeto que não é uma instância de :class:`concurrent.futures.ThreadPoolExecutor` para :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` foi descontinuado e será proibido no Python 3.9. (Contribuição de Elvis Pranskevichus em :issue:`34075`.)

source: The :meth:`~object.__getitem__` methods of :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` and :class:`fileinput.FileInput` have been deprecated.
pt_br: Os métodos :meth:`~object.__getitem__` de :class:`xml.dom.pulldom.DOMEventStream`, :class:`wsgiref.util.FileWrapper` e :class:`fileinput.FileInput` foram descontinuados.

source: Implementations of these methods have been ignoring their *index* parameter, and returning the next item instead. (Contributed by Berker Peksag in :issue:`9372`.)
pt_br: As implementações desses métodos têm ignorado seu parâmetro *index* e retornado o próximo item. (Contribuição de Berker Peksag em :issue:`9372`.)

source: The :class:`typing.NamedTuple` class has deprecated the ``_field_types`` attribute in favor of the ``__annotations__`` attribute which has the same information. (Contributed by Raymond Hettinger in :issue:`36320`.)
pt_br: A classe :class:`typing.NamedTuple` descontinuou o atributo ``_field_types`` em favor do atributo ``__annotations__`` que possui as mesmas informações. (Contribuição de Raymond Hettinger em :issue:`36320`.)

source: :mod:`ast` classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` are considered deprecated and will be removed in future Python versions. :class:`~ast.Constant` should be used instead. (Contributed by Serhiy Storchaka in :issue:`32892`.)
pt_br: As classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` e ``Ellipsis`` do módulo :mod:`ast` são consideradas descontinuadas e serão removidos em versões futuras do Python. A :class:`~ast.Constant` deve ser usado. (Contribuição de Serhiy Storchaka em :issue:`32892`.)

source: :class:`ast.NodeVisitor` methods ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` and ``visit_Ellipsis()`` are deprecated now and will not be called in future Python versions. Add the :meth:`~ast.NodeVisitor.visit_Constant` method to handle all constant nodes. (Contributed by Serhiy Storchaka in :issue:`36917`.)
pt_br: Os métodos ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` e ``visit_Ellipsis()`` da classe :class:`ast.NodeVisitor` estão agora descontinuados e não serão chamados nas versões futuras do Python. Adicione o método :meth:`~ast.NodeVisitor.visit_Constant` para manipular todos os nós constantes. (Contribuição de Serhiy Storchaka em :issue:`36917`.)

source: The :func:`asyncio.coroutine` :term:`decorator` is deprecated and will be removed in version 3.10. Instead of ``@asyncio.coroutine``, use :keyword:`async def` instead. (Contributed by Andrew Svetlov in :issue:`36921`.)
pt_br: O :term:`decorador <decorator>` de :func:`asyncio.coroutine` foi descontinuado e será removido na versão 3.10. Em vez de ``@asyncio.coroutine``, use :keyword:`async def`. (Contribuição de Andrew Svetlov em :issue:`36921`.)

source: In :mod:`asyncio`, the explicit passing of a *loop* argument has been deprecated and will be removed in version 3.10 for the following: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, and :func:`asyncio.create_subprocess_shell`.
pt_br: Em :mod:`asyncio`, a passagem explícita de um argumento *loop* foi descontinuado e será removido na versão 3.10 para os seguintes: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec` e :func:`asyncio.create_subprocess_shell`.

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov in :issue:`34790`.)
pt_br: A passagem explícita dos objetos da corrotina para :func:`asyncio.wait` foi descontinuada e será removida na versão 3.11. (Contribuição de Yury Selivanov em :issue:`34790`.)

source: The following functions and methods are deprecated in the :mod:`gettext` module: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` and :func:`~gettext.ldngettext`. They return encoded bytes, and it's possible that you will get unexpected Unicode-related exceptions if there are encoding problems with the translated strings. It's much better to use alternatives which return Unicode strings in Python 3. These functions have been broken for a long time.
pt_br: As seguintes funções e os seguintes métodos estão descontinuados no módulo :mod:`gettext`: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` e :func:`~gettext.ldngettext`. Eles retornam bytes codificados e é possível que você obtenha exceções relacionadas ao Unicode inesperadas se houver problemas de codificação com as strings traduzidas. É muito melhor usar alternativas que retornam strings Unicode no Python 3. Essas funções estiveram quebradas por um longo tempo.

source: Function :func:`~gettext.bind_textdomain_codeset`, methods :meth:`~gettext.NullTranslations.output_charset` and :meth:`~gettext.NullTranslations.set_output_charset`, and the *codeset* parameter of functions :func:`~gettext.translation` and :func:`~gettext.install` are also deprecated, since they are only used for the ``l*gettext()`` functions. (Contributed by Serhiy Storchaka in :issue:`33710`.)
pt_br: A função :func:`~gettext.bind_textdomain_codeset`, os métodos :meth:`~gettext.NullTranslations.output_charset` e :meth:`~gettext.NullTranslations.set_output_charset` e o parâmetro *codeset* das funções :func:`~gettext.translation` e :func:`~gettext.install` também estão descontinuados, pois são usados apenas para as funções ``l*gettext()``. (Contribuição de Serhiy Storchaka em :issue:`33710`.)

source: Many builtin and extension functions that take integer arguments will now emit a deprecation warning for :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and any other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). In future version they will be errors. (Contributed by Serhiy Storchaka in :issue:`36048`.)
pt_br: Muitas funções internas e de extensão que recebem argumentos inteiros agora emitem um aviso de descontinuidade para objetos de :class:`~decimal.Decimal`, de :class:`~fractions.Fraction` e quaisquer outros objetos que possam ser convertidos apenas em números inteiros com perda (por exemplo, que possuem o método :meth:`~object.__int__`, mas não têm o método :meth:`~object.__index__`). Em uma versão futura, haverá erros. (Contribuição de Serhiy Storchaka em :issue:`36048`.)

source: Deprecated passing the following arguments as keyword arguments:
pt_br: Descontinuada a passagem dos seguintes argumentos como argumentos nomeados:

source: *func* in :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` and :func:`curses.wrapper`.
pt_br: *func* em :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` e :func:`curses.wrapper`.

source: *function* in :meth:`unittest.TestCase.addCleanup`.
pt_br: *function* em :meth:`unittest.TestCase.addCleanup`.

source: *fn* in the :meth:`~concurrent.futures.Executor.submit` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor`.
pt_br: *fn* no método :meth:`~concurrent.futures.Executor.submit` de :class:`concurrent.futures.ThreadPoolExecutor` e :class:`concurrent.futures.ProcessPoolExecutor`.

source: *callback* in :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` and :meth:`contextlib.AsyncExitStack.push_async_callback`.
pt_br: *callback* em :meth:`contextlib.ExitStack.callback`, :meth:`contextlib.AsyncExitStack.callback` e :meth:`contextlib.AsyncExitStack.push_async_callback`.

source: *c* and *typeid* in the :meth:`~multiprocessing.managers.Server.create` method of :class:`multiprocessing.managers.Server` and :class:`multiprocessing.managers.SharedMemoryServer`.
pt_br: *c* e *typeid* no método :meth:`~multiprocessing.managers.Server.create` de :class:`multiprocessing.managers.Server` e :class:`multiprocessing.managers.SharedMemoryServer`.

source: *obj* in :func:`weakref.finalize`.
pt_br: *obj* em :func:`weakref.finalize`.

source: In future releases of Python, they will be :ref:`positional-only <positional-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`36492`.)
pt_br: Em versões futuras do Python, elas serão :ref:`somente-posicionais <positional-only_parameter>`. (Contribuição de Serhiy Storchaka em :issue:`36492`.)

source: API and Feature Removals
pt_br: Remoção de APIs e recursos

source: The following features and APIs have been removed from Python 3.8:
pt_br: Os seguintes recursos e APIs foram removidos do Python 3.8:

source: Starting with Python 3.3, importing ABCs from :mod:`collections` was deprecated, and importing should be done from :mod:`collections.abc`. Being able to import from collections was marked for removal in 3.8, but has been delayed to 3.9. (See :issue:`36952`.)
pt_br: A partir do Python 3.3, a importação de ABCs de :mod:`collections` foi descontinuada e a importação deve ser feita de :mod:`collections.abc`. A possibilidade de importar de coleções foi marcada para remoção em 3.8, mas foi adiada para 3.9. (Veja :issue:`36952`.)

source: The :mod:`macpath` module, deprecated in Python 3.7, has been removed. (Contributed by Victor Stinner in :issue:`35471`.)
pt_br: O módulo :mod:`macpath`, descontinuado no Python 3.7, foi removido. (Contribuição de Victor Stinner em :issue:`35471`.)

source: The function :func:`platform.popen` has been removed, after having been deprecated since Python 3.3: use :func:`os.popen` instead. (Contributed by Victor Stinner in :issue:`35345`.)
pt_br: A função :func:`platform.popen` foi removida, após ter sido descontinuada desde o Python 3.3: use :func:`os.popen`. (Contribuição de Victor Stinner em :issue:`35345`.)

source: The function :func:`time.clock` has been removed, after having been deprecated since Python 3.3: use :func:`time.perf_counter` or :func:`time.process_time` instead, depending on your requirements, to have well-defined behavior. (Contributed by Matthias Bussonnier in :issue:`36895`.)
pt_br: A função :func:`time.clock` foi removida, após ter sido descontinuada desde o Python 3.3: use :func:`time.perf_counter` ou :func:`time.process_time`, dependendo de seus requisitos, para ter o comportamento já definido. (Contribuição de Matthias Bussonnier em :issue:`36895`.)

source: The ``pyvenv`` script has been removed in favor of ``python3.8 -m venv`` to help eliminate confusion as to what Python interpreter the ``pyvenv`` script is tied to. (Contributed by Brett Cannon in :issue:`25427`.)
pt_br: O script ``pyvenv`` foi removido em favor do ``python3.8 -m venv`` para ajudar a eliminar a confusão sobre a qual interpretador Python o script ``pyvenv`` está associado. (Contribuição de Brett Cannon em :issue:`25427`.)

source: ``parse_qs``, ``parse_qsl``, and ``escape`` are removed from the :mod:`cgi` module. They are deprecated in Python 3.2 or older. They should be imported from the ``urllib.parse`` and ``html`` modules instead.
pt_br: ``parse_qs``, ``parse_qsl`` e ``escape`` foram removidos do módulo :mod:`cgi`. Eles foram descontinuados no Python 3.2 ou mais antigo. Eles devem ser importados dos módulos ``urllib.parse`` e ``html``.

source: ``filemode`` function is removed from the :mod:`tarfile` module. It is not documented and deprecated since Python 3.3.
pt_br: A função ``filemode`` foi removida do módulo :mod:`tarfile`. Não é documentada e foi descontinuada desde o Python 3.3.

source: The :class:`~xml.etree.ElementTree.XMLParser` constructor no longer accepts the *html* argument. It never had an effect and was deprecated in Python 3.4. All other parameters are now :ref:`keyword-only <keyword-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
pt_br: O construtor :class:`~xml.etree.ElementTree.XMLParser` não aceita mais o argumento *html*. Isso nunca teve efeito e foi descontinuado no Python 3.4. Todos os outros parâmetros agora são :ref:`somente-nomeados <keyword-only_parameter>`. (Contribuição de Serhiy Storchaka em :issue:`29209`.)

source: Removed the ``doctype()`` method of :class:`~xml.etree.ElementTree.XMLParser`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
pt_br: Removido o método ``doctype()`` de :class:`~xml.etree.ElementTree.XMLParser`. (Contribuição de Serhiy Storchaka em :issue:`29209`.)

source: "unicode_internal" codec is removed. (Contributed by Inada Naoki in :issue:`36297`.)
pt_br: O codec "unicode_internal" foi removido. (Contribuição de Inada Naoki em :issue:`36297`.)

source: The ``Cache`` and ``Statement`` objects of the :mod:`sqlite3` module are not exposed to the user. (Contributed by Aviv Palivoda in :issue:`30262`.)
pt_br: Os objetos ``Cache`` e ``Statement`` do módulo :mod:`sqlite3` não expostos para o usuário. (Contribuição de Aviv Palivoda em :issue:`30262`.)

source: The ``bufsize`` keyword argument of :func:`fileinput.input` and :func:`fileinput.FileInput` which was ignored and deprecated since Python 3.6 has been removed. :issue:`36952` (Contributed by Matthias Bussonnier.)
pt_br: O argumento nomeado ``bufsize`` de :func:`fileinput.input` e :func:`fileinput.FileInput`, que era ignorado e estava descontinuado desde o Python 3.6, foi removido. :issue:`36952` (Contribuição de Matthias Bussonnier.)

source: The functions :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper` deprecated in Python 3.7 have been removed; :issue:`36933` (Contributed by Matthias Bussonnier.)
pt_br: As funções descontinuadas :func:`sys.set_coroutine_wrapper` e :func:`sys.get_coroutine_wrapper` no Python 3.7 foram removidas; :issue:`36933` (Contribuição de Matthias Bussonnier.)

source: Porting to Python 3.8
pt_br: Portando para o Python 3.8

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_br: Esta seção lista as alterações descritas anteriormente e outras correções que podem exigir alterações no seu código.

source: Changes in Python behavior
pt_br: Alterações no comportamento do Python

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now disallowed in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). (Contributed by Serhiy Storchaka in :issue:`10544`.)
pt_br: Expressões *yield* (ambas as cláusulas ``yield`` e ``yield from``) agora não são permitidas nas compreensões e expressões geradoras (além da expressão iterável na cláusula mais à esquerda :keyword:`!for`). (Contribuição de Serhiy Storchaka em :issue:`10544`.)

source: The compiler now produces a :exc:`SyntaxWarning` when identity checks (``is`` and ``is not``) are used with certain types of literals (e.g. strings, numbers). These can often work by accident in CPython, but are not guaranteed by the language spec. The warning advises users to use equality tests (``==`` and ``!=``) instead. (Contributed by Serhiy Storchaka in :issue:`34850`.)
pt_br: Agora, o compilador produz um :exc:`SyntaxWarning` quando verificações de identidade (``is`` e ``is not``) são usadas com certos tipos de literais (por exemplo, strings, números). Geralmente, eles podem funcionar acidentalmente no CPython, mas não são garantidos pelas especificações da linguagem. O aviso aconselha os usuários a usar testes de igualdade (``==`` e ``!=``). (Contribuição de Serhiy Storchaka em :issue:`34850`.)

source: The CPython interpreter can swallow exceptions in some circumstances. In Python 3.8 this happens in fewer cases. In particular, exceptions raised when getting the attribute from the type dictionary are no longer ignored. (Contributed by Serhiy Storchaka in :issue:`35459`.)
pt_br: O interpretador do CPython pode engolir exceções em algumas circunstâncias. No Python 3.8, isso acontece em menos casos. Em particular, as exceções levantadas ao obter o atributo do dicionário de tipos não são mais ignoradas. (Contribuição de Serhiy Storchaka em :issue:`35459`.)

source: Removed ``__str__`` implementations from builtin types :class:`bool`, :class:`int`, :class:`float`, :class:`complex` and few classes from the standard library. They now inherit ``__str__()`` from :class:`object`. As result, defining the ``__repr__()`` method in the subclass of these classes will affect their string representation. (Contributed by Serhiy Storchaka in :issue:`36793`.)
pt_br: Removidas as implementações ``__str__`` dos tipos embutidos :class:`bool`, :class:`int`, :class:`float`, :class:`complex` e poucas classes da biblioteca padrão. Agora eles herdam ``__str__()`` de :class:`object`. Como resultado, definir o método ``__repr__()`` na subclasse dessas classes afetará sua representação de string. (Contribuição de Serhiy Storchaka em :issue:`36793`.)

source: On AIX, :data:`sys.platform` doesn't contain the major version anymore. It is always ``'aix'``, instead of ``'aix3'`` .. ``'aix7'``. Since older Python versions include the version number, so it is recommended to always use ``sys.platform.startswith('aix')``. (Contributed by M. Felt in :issue:`36588`.)
pt_br: No AIX, :data:`sys.platform` não contém mais a versão principal. É sempre ``'aix'``, em vez de ``'aix3'`` .. ``'aix7'``. Como as versões mais antigas do Python incluem o número da versão, é recomendável usar sempre ``sys.platform.startswith('aix')``. (Contribuição de M. Felt em :issue:`36588`.)
