Repository: python/python-docs-pt-br
Catalog: whatsnew/3.8.po
Languages: pt_br

source: The location of an installed :file:`pythonXY.dll` will depend on the installation options and the version and language of Windows. See :ref:`using-on-windows` for more information. The resulting library should be placed in the same directory as :file:`pythonXY.lib`, which is generally the :file:`libs` directory under your Python installation.
pt_br: A localização de um arquivo :file:`pythonXY.dll` dependerá das opções de instalação e da versão e idioma do Windows. Consulte :ref:`using-on-windows` para mais informações. A biblioteca resultante deve ser colocada no mesmo diretório que :file:`pythonXY.lib`, que geralmente é o diretório :file:`libs` na sua instalação do Python.

source: (Contributed by Steve Dower in :issue:`37351`.)
pt_br: (Contribuição de Steve Dower em :issue:`37351`.)

source: CPython bytecode changes
pt_br: Alterações de bytecode do CPython

source: The interpreter loop has been simplified by moving the logic of unrolling the stack of blocks into the compiler. The compiler emits now explicit instructions for adjusting the stack of values and calling the cleaning-up code for :keyword:`break`, :keyword:`continue` and :keyword:`return`.
pt_br: O loop do interpretador foi simplificado movendo a lógica de desenrolar a pilha de blocos no compilador. O compilador agora emite instruções explícitas para ajustar a pilha de valores e chamar o código de limpeza para :keyword:`break`, :keyword:`continue` e :keyword:`return`.

source: Removed opcodes :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` and :opcode:`SETUP_EXCEPT`. Added new opcodes :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` and :opcode:`POP_FINALLY`. Changed the behavior of :opcode:`END_FINALLY` and :opcode:`WITH_CLEANUP_START`.
pt_br: Removidos os códigos de operação :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` e :opcode:`SETUP_EXCEPT`. Adicionados novos códigos de operação :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` e :opcode:`POP_FINALLY`. Alterado o comportamento de :opcode:`END_FINALLY` e :opcode:`WITH_CLEANUP_START`.

source: (Contributed by Mark Shannon, Antoine Pitrou and Serhiy Storchaka in :issue:`17611`.)
pt_br: (Contribuição de Mark Shannon, Antoine Pitrou e Serhiy Storchaka em :issue:`17611`.)

source: Added new opcode :opcode:`END_ASYNC_FOR` for handling exceptions raised when awaiting a next item in an :keyword:`async for` loop. (Contributed by Serhiy Storchaka in :issue:`33041`.)
pt_br: Adicionado novo código de operação :opcode:`END_ASYNC_FOR` para lidar com exceções geradas ao aguardar um próximo item em um loop :keyword:`async for`. (Contribuição de Serhiy Storchaka em :issue:`33041`.)

source: The :opcode:`MAP_ADD` now expects the value as the first element in the stack and the key as the second element. This change was made so the key is always evaluated before the value in dictionary comprehensions, as proposed by :pep:`572`. (Contributed by Jörn Heissler in :issue:`35224`.)
pt_br: O :opcode:`MAP_ADD` agora espera o valor como o primeiro elemento na pilha e a chave como o segundo elemento. Essa alteração foi feita para que a chave seja sempre avaliada antes do valor na compreensão do dicionário, conforme proposto em :pep:`572`. (Contribuição de Jörn Heissler em :issue:`35224`.)

source: Demos and Tools
pt_br: Ferramentas e daemons

source: Added a benchmark script for timing various ways to access variables: ``Tools/scripts/var_access_benchmark.py``. (Contributed by Raymond Hettinger in :issue:`35884`.)
pt_br: Adicionado um script de benchmark para cronometrar várias maneiras de acessar variáveis: ``Tools/scripts/var_access_benchmark.py``. (Contribuição de Raymond Hettinger em :issue:`35884`.)

source: Here's a summary of performance improvements since Python 3.3:
pt_br: Aqui está um resumo das melhorias de desempenho desde Python 3.3:

source: The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/macos/>`_. The benchmark script displays timings in nanoseconds.
pt_br: Os benchmarks foram medidos em um processador `Intel® Core™ i7-4960HQ <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ nos sistemas macOS 64-bit encontrados em `python.org <https://www.python.org/downloads/macos/>`_. O script de benchmark exibe tempos em nanossegundos.

source: Notable changes in Python 3.8.1
pt_br: Alterações notáveis no Python 3.8.1

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
pt_br: Devido a significativas preocupações de segurança, o parâmetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` não é mais suportado. Isso ocorre devido ao comportamento da opção de soquete ``SO_REUSEADDR`` no UDP. Para mais detalhes, consulte a documentação de ``loop.create_datagram_endpoint()``. (Contribuição de Kyle Stanley, Antoine Pitrou e Yury Selivanov em :issue:`37228`.)

source: Notable changes in Python 3.8.2
pt_br: Alterações notáveis no Python 3.8.2

source: Fixed a regression with the ``ignore`` callback of :func:`shutil.copytree`. The argument types are now str and List[str] again. (Contributed by Manuel Barkhau and Giampaolo Rodola in :gh:`83571`.)
pt_br: Corrigida uma regressão com o retorno de chamada ``ignore`` de :func:`shutil.copytree`. Os tipos de argumento agora são str e List[str] novamente. (Contribuição de Manuel Barkhau e Giampaolo Rodola em :gh:`83571`.)

source: Notable changes in Python 3.8.3
pt_br: Alterações notáveis no Python 3.8.3

source: The constant values of future flags in the :mod:`__future__` module are updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :gh:`83743`)
pt_br: Os valores constantes dos futuros sinalizadores no módulo :mod:`__future__` fpram atualizados para evitar colisão com os sinalizadores do compilador. Anteriormente, ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` estava colidindo com ``CO_FUTURE_DIVISION``. (Contribuição de Batuhan Taskaya em :gh:`83743`)

source: Notable changes in Python 3.8.8
pt_br: Alterações notáveis no Python 3.8.8

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
pt_br: Versões anteriores do Python permitiam o uso de ``;`` e ``&`` como separadores de parâmetros de consulta nas funções :func:`urllib.parse.parse_qs` e :func:`urllib.parse.parse_qsl`. Devido a questões de segurança, e em conformidade com as recomendações mais recentes do W3C, isso foi alterado para permitir apenas uma única chave separadora, com ``&`` como padrão. Esta mudança também afeta as funções :func:`cgi.parse` e :func:`cgi.parse_multipart` já que elas usam as funções afetadas internamente. Para obter mais detalhes, consulte sua respectiva documentação. (Contribuição de Adam Goldschmidt, Senthil Kumaran e Ken Jin em :issue:`42967`.)

source: Notable changes in Python 3.8.9
pt_br: Alterações notáveis no Python 3.8.9

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
pt_br: Uma correção de segurança altera o comportamento :class:`ftplib.FTP` para não confiar no endereço IPv4 enviado do servidor remoto ao configurar um canal de dados passivo. Em vez disso, reutilizamos o endereço IP do servidor ftp. Para códigos incomuns que requerem o comportamento antigo, defina um atributo ``trust_server_pasv_ipv4_address`` em sua instância de FTP para ``True``. (Veja :gh:`87451`)

source: Notable changes in Python 3.8.10
pt_br: Alterações notáveis no Python 3.8.10

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
pt_br: Suporte a macOS 11.0 (Big Sur) e Apple Silicon Mac

source: As of 3.8.10, Python now supports building and running on macOS 11 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Note that support for "weaklinking", building binaries targeted for newer versions of macOS that will also run correctly on older versions by testing at runtime for missing features, is not included in this backport from Python 3.9; to support a range of macOS versions, continue to target for and build on the oldest version in the range.
pt_br: A partir do 3.8.10, Python oferece suporte total à construção e execução no macOS 11 (Big Sur) e no Apple Silicon Macs (baseado na arquitetura ``ARM64``). Uma nova variante de compilação universal, ``universal2``, está agora disponível com suporte nativo para ``ARM64`` e ``Intel 64`` em um conjunto de executáveis. Observe que suporte para "ligação fraca", criar binários direcionados para versões mais recentes do macOS que também serão executados corretamente em versões mais antigas através da verificação em tempo de execução por recursos ausentes, não está mais incluída de forma retroativa do Python 3.9; para oferece suporte a uma gama de versões do macOS, continue a visar e a desenvolver para a versão mais antiga do intervalo.

source: (Originally contributed by Ronald Oussoren and Lawrence D'Anna in :gh:`85272`, with fixes by FX Coudert and Eli Rykoff, and backported to 3.8 by Maxime Bélanger and Ned Deily)
pt_br: (Contribuição original de Ronald Oussoren e Lawrence D'Anna em :gh:`85272`, com correções de FX Coudert e Eli Rykoff, e portado para a versão 3.8 por Maxime Bélanger e Ned Deily)

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :issue:`43882`)
pt_br: A presença de caracteres de nova linha ou tab em partes de um URL permite algumas formas de ataques. Seguindo a especificação WHATWG que atualiza :rfc:`3986`, nova linha ASCII ``\n``, ``\r`` e os caracteres de tabulação ``\t`` são retirados da URL pelo analisador sintático em :mod:`urllib.parse` impedindo tais ataques. Os caracteres de remoção são controlados por uma nova variável de nível de módulo ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Veja :issue:`43882`)

source: Notable changes in Python 3.8.12
pt_br: Alterações notáveis no Python 3.8.12

source: Starting with Python 3.8.12 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros.
pt_br: A partir do Python 3.8.12, o módulo :mod:`ipaddress` não aceita mais zeros à esquerda em strings de endereço IPv4. Os zeros à esquerda são ambíguos e interpretados como notação octal por algumas bibliotecas. Por exemplo, a função legada :func:`socket.inet_aton` trata os zeros à esquerda como notação octal. A implementação glibc de :func:`~socket.inet_pton` moderna não aceita nenhum zeros à esquerda.

source: (Originally contributed by Christian Heimes in :issue:`36384`, and backported to 3.8 by Achraf Merzouki.)
pt_br: (Originalmente contribuição de Christian Heimes em :issue:`36384` e backport para 3.8 por Achraf Merzouki.)

source: Notable security feature in 3.8.14
pt_br: Recursos de segurança notáveis no 3.8.14

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
pt_br: Converter entre :class:`int` e :class:`str` em bases diferentes de 2 (binário), 4, 8 (octal), 16 (hexadecimal) ou 32 como base 10 (decimal) agora levanta uma exceção :exc:`ValueError` se o número de dígitos em forma de string estiver acima de um limite para evitar possíveis ataques de negação de serviço devido à complexidade algorítmica. Esta é uma mitigação para :cve:`2020-10735`. Este limite pode ser configurado ou desabilitado por variável de ambiente, sinalizador de linha de comando ou APIs de :mod:`sys`. Veja a documentação de :ref:`limitação de comprimento de conversão de string inteira <int_max_str_digits>`. O limite padrão é de 4300 dígitos em forma de string.

source: Notable changes in 3.8.17
pt_br: Alterações notáveis no 3.8.17

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
pt_br: Os métodos de extração em :mod:`tarfile` e :func:`shutil.unpack_archive`, têm um novo argumento *filter* que permite limitar recursos do tar que podem ser surpreendentes ou perigosos, como criar arquivos fora do diretório de destino. Veja :ref:`tarfile-extraction-filter` para detalhes. No Python 3.12, usar sem o argumento *filter* mostrará um :exc:`DeprecationWarning`. No Python 3.14, o padrão mudará para ``'data'``. (Contribuição de Petr Viktorin em :pep:`706`.)
