Repository: python/python-docs-pt-br
Catalog: whatsnew/3.8.po
Languages: pt_br

source: :c:func:`!PyEval_AcquireLock` and :c:func:`!PyEval_AcquireThread` now terminate the current thread if called while the interpreter is finalizing, making them consistent with :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS`, and :c:func:`PyGILState_Ensure`. If this behavior is not desired, guard the call by checking :c:func:`!_Py_IsFinalizing` or :func:`sys.is_finalizing`. (Contributed by Joannah Nanjekye in :issue:`36475`.)
pt_br: :c:func:`!PyEval_AcquireLock` e :c:func:`!PyEval_AcquireThread` agora encerram a thread atual se chamado enquanto o interpretador está finalizando, tornando-os consistentes com :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS` e :c:func:`PyGILState_Ensure`. Se esse comportamento não for desejado, proteja a chamada verificando :c:func:`!_Py_IsFinalizing` ou :func:`sys.is_finalizing`. (Contribuição de Joannah Nanjekye em :issue:`36475`.)

source: Changes in the Python API
pt_br: Alterações na API Python

source: The :func:`os.getcwdb` function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows. (Contributed by Victor Stinner in :issue:`37412`.)
pt_br: A função :func:`os.getcwdb` agora usa a codificação UTF-8 no Windows, em vez da página de códigos ANSI: veja :pep:`529` para a justificativa. A função não é mais descontinuada no Windows. (Contribuição de Victor Stinner em :issue:`37412`.)

source: :class:`subprocess.Popen` can now use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, the :class:`Popen` constructor using :func:`os.posix_spawn` no longer raises an exception on errors like "missing program". Instead the child process fails with a non-zero :attr:`~Popen.returncode`. (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
pt_br: :class:`subprocess.Popen` agora pode usar :func:`os.posix_spawn` em alguns casos, para obter melhor desempenho. No Windows Subsystem para Linux e emulação de usuário QEMU, o construtor :class:`Popen` usando :func:`os.posix_spawn` não levanta mais uma exceção em erros como "missing program". Em vez disso, o processo filho falha com um diferente de zero :attr:`~Popen.returncode`. (Contribuição de Joannah Nanjekye e Victor Stinner em :issue:`35537`.)

source: The *preexec_fn* argument of * :class:`subprocess.Popen` is no longer compatible with subinterpreters. The use of the parameter in a subinterpreter now raises :exc:`RuntimeError`. (Contributed by Eric Snow in :issue:`34651`, modified by Christian Heimes in :issue:`37951`.)
pt_br: O argumento *preexec_fn* de * :class:`subprocess.Popen` não é mais compatível com subinterpretadores. O uso do parâmetro em um subinterpretador agora levanta :exc:`RuntimeError`. (Contribuição de Eric Snow em :issue:`34651`, modificado por Christian Heimes em :issue:`37951`.)

source: The :meth:`imap.IMAP4.logout` method no longer silently ignores arbitrary exceptions. (Contributed by Victor Stinner in :issue:`36348`.)
pt_br: O método :meth:`imap.IMAP4.logout` não mais ignora silenciosamente exceções arbitrárias. (Contribuição de Victor Stinner em :issue:`36348`.)

source: The :func:`statistics.mode` function no longer raises an exception when given multimodal data. Instead, it returns the first mode encountered in the input data. (Contributed by Raymond Hettinger in :issue:`35892`.)
pt_br: A função :func:`Statistics.mode` não levanta mais uma exceção quando dados multimodais são fornecidos. Em vez disso, ela retorna o primeiro modo encontrado nos dados de entrada. (Contribuição de Raymond Hettinger em :issue:`35892`.)

source: The :meth:`~tkinter.ttk.Treeview.selection` method of the :class:`tkinter.ttk.Treeview` class no longer takes arguments. Using it with arguments for changing the selection was deprecated in Python 3.6. Use specialized methods like :meth:`~tkinter.ttk.Treeview.selection_set` for changing the selection. (Contributed by Serhiy Storchaka in :issue:`31508`.)
pt_br: O método :meth:`~tkinter.ttk.Treeview.selection` da classe :class:`tkinter.ttk.Treeview` não recebe mais argumentos. Seu uso com argumentos para alterar a seleção foi descontinuado no Python 3.6. Use métodos especializados como :meth:`~tkinter.ttk.Treeview.selection_set` para alterar a seleção. (Contribuição de Serhiy Storchaka em :issue:`31508`.)

source: The :meth:`writexml`, :meth:`toxml` and :meth:`toprettyxml` methods of :mod:`xml.dom.minidom`, and the :meth:`write` method of :mod:`xml.etree`, now preserve the attribute order specified by the user. (Contributed by Diego Rojas and Raymond Hettinger in :issue:`34160`.)
pt_br: Os métodos :meth:`writexml`, :meth:`toxml` e :meth:`toprettyxml` de :mod:`xml.dom.minidom`, e o método :meth:`write` de :mod:`xml.etree`, agora preservam a ordem dos atributos especificados pelo usuário. (Contribuição de Diego Rojas e Raymond Hettinger em :issue:`34160`.)

source: A :mod:`dbm.dumb` database opened with flags ``'r'`` is now read-only. :func:`dbm.dumb.open` with flags ``'r'`` and ``'w'`` no longer creates a database if it does not exist. (Contributed by Serhiy Storchaka in :issue:`32749`.)
pt_br: Um banco de dados :mod:`dbm.dumb` aberto com sinalizadores ``'r'`` agora é somente leitura. :func:`dbm.dumb.open` com os sinalizadores ``'r'`` e ``'w'`` não cria mais um banco de dados se ele não existir. (Contribuição de Serhiy Storchaka em :issue:`32749`.)

source: The ``doctype()`` method defined in a subclass of :class:`~xml.etree.ElementTree.XMLParser` will no longer be called and will emit a :exc:`RuntimeWarning` instead of a :exc:`DeprecationWarning`. Define the :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` method on a target for handling an XML doctype declaration. (Contributed by Serhiy Storchaka in :issue:`29209`.)
pt_br: O método ``doctype()`` definido em uma subclasse de :class:`~xml.etree.ElementTree.XMLParser` não será mais chamado e emitirá um :exc:`RuntimeWarning` em vez de um :exc:`DeprecationWarning`. Defina o método :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` em um alvo para manipular uma declaração doctype XML. (Contribuição de Serhiy Storchaka em :issue:`29209`.)

source: A :exc:`RuntimeError` is now raised when the custom metaclass doesn't provide the ``__classcell__`` entry in the namespace passed to ``type.__new__``. A :exc:`DeprecationWarning` was emitted in Python 3.6--3.7. (Contributed by Serhiy Storchaka in :issue:`23722`.)
pt_br: Uma :exc:`RuntimeError` agora é levantada quando a metaclasse personalizada não fornece a entrada ``__classcell__`` no espaço de nomes passado para ``type.__new__``. Uma :exc:`DeprecationWarning` era emitida no Python 3.6-3.7. (Contribuição de Serhiy Storchaka em :issue:`23722`.)

source: The :class:`cProfile.Profile` class can now be used as a context manager. (Contributed by Scott Sanderson in :issue:`29235`.)
pt_br: A classe :class:`cProfile.Profile` agora pode ser usada como um gerenciador de contexto. (Contribuição de Scott Sanderson em :issue:`29235`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls (see :ref:`shutil-platform-dependent-efficient-copy-operations` section).
pt_br: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` e :func:`shutil.copytree` usam chamadas de sistema de "cópia rápido" específica da plataforma (veja a seção :ref:`shutil-platform-dependent-efficient-copy-operations`).

source: :func:`shutil.copyfile` default buffer size on Windows was changed from 16 KiB to 1 MiB.
pt_br: O tamanho padrão do buffer de :func:`shutil.copyfile` no Windows foi alterado de 16 KiB para 1 MiB.

source: The ``PyGC_Head`` struct has changed completely. All code that touched the struct member should be rewritten. (See :issue:`33597`.)
pt_br: A estrutura de ``PyGC_Head`` mudou completamente. Todo o código que tocava no membro struct deve ser reescrito. (Veja :issue:`33597`.)

source: The :c:type:`PyInterpreterState` struct has been moved into the "internal" header files (specifically Include/internal/pycore_pystate.h). An opaque ``PyInterpreterState`` is still available as part of the public API (and stable ABI). The docs indicate that none of the struct's fields are public, so we hope no one has been using them. However, if you do rely on one or more of those private fields and have no alternative then please open a BPO issue. We'll work on helping you adjust (possibly including adding accessor functions to the public API). (See :issue:`35886`.)
pt_br: A estrutura de :c:type:`PyInterpreterState` foi movida para os arquivos de cabeçalho "internal" (especificamente Include/internal/pycore_pystate.h). Um ``PyInterpreterState`` opaco ainda está disponível como parte da API pública (e ABI estável). Os documentos indicam que nenhum dos campos da estrutura é público, por isso esperamos que ninguém os tenha usado. No entanto, se você confia em um ou mais desses campos em particular e não tiver alternativa, abra um relatório de erro no BPO. Vamos trabalhar para ajudá-lo a ajustar (possivelmente incluindo a adição de funções de acessador à API pública). (Veja :issue:`35886`.)

source: The :meth:`mmap.flush() <mmap.mmap.flush>` method now returns ``None`` on success and raises an exception on error under all platforms. Previously, its behavior was platform-dependent: a nonzero value was returned on success; zero was returned on error under Windows. A zero value was returned on success; an exception was raised on error under Unix. (Contributed by Berker Peksag in :issue:`2122`.)
pt_br: O método :meth:`mmap.flush() <mmap.mmap.flush>` agora retorna ``None`` com êxito e levanta uma exceção no erro em todas as plataformas. Anteriormente, seu comportamento dependia da plataforma: um valor diferente de zero era retornado com êxito; zero era retornado com erro no Windows. Um valor zero era retornado com sucesso; uma exceção era levanta no caso de erro no Unix. (Contribuição de Berker Peksag em :issue:`2122`.)

source: :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
pt_br: Os módulos :mod:`xml.dom.minidom` e :mod:`xml.sax` não mais processam entidades externas por padrão. (Contribuição de Christian Heimes em :issue:`17239`.)

source: Deleting a key from a read-only :mod:`dbm` database (:mod:`dbm.dumb`, :mod:`dbm.gnu` or :mod:`dbm.ndbm`) raises :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` or :exc:`dbm.ndbm.error`) instead of :exc:`KeyError`. (Contributed by Xiang Zhang in :issue:`33106`.)
pt_br: A exclusão de uma chave de um banco de dados somente leitura :mod:`dbm` (:mod:`dbm.dumb`, :mod:`dbm.gnu` ou :mod:`dbm.ndbm`) levanta :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` ou :exc:`dbm.ndbm.error`) em vez de :exc:`KeyError`. (Contribuição de Xiang Zhang em :issue:`33106`.)

source: Simplified AST for literals. All constants will be represented as :class:`ast.Constant` instances. Instantiating old classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` will return an instance of ``Constant``. (Contributed by Serhiy Storchaka in :issue:`32892`.)
pt_br: AST foi simplificado para literais. Todas as constantes serão representadas como instâncias de :class:`ast.Constant`. Instanciar classes antigas ``Num``, ``Str``, ``Bytes``, ``NameConstant`` e ``Ellipsis`` retornará uma instância de ``Constant``. (Contribuição de Serhiy Storchaka em :issue:`32892`.)

source: The function :func:`asyncio.wait_for` now correctly waits for cancellation when using an instance of :class:`asyncio.Task`. Previously, upon reaching *timeout*, it was cancelled and immediately returned. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
pt_br: A função :func:`asyncio.wait_for` agora aguarda corretamente o cancelamento ao usar uma instância de :class:`asyncio.Task`. Anteriormente, ao atingir tempo limite, ele era cancelado e devolvido imediatamente. (Contribuição de Elvis Pranskevichus em :issue:`32751`.)

source: The function :func:`asyncio.BaseTransport.get_extra_info` now returns a safe to use socket object when 'socket' is passed to the *name* parameter. (Contributed by Yury Selivanov in :issue:`37027`.)
pt_br: A função :func:`asyncio.BaseTransport.get_extra_info` agora retorna um objeto soquete seguro de usar quando 'socket' é passado para o parâmetro *name*. (Contribuição de Yury Selivanov em :issue:`37027`.)

source: :class:`asyncio.BufferedProtocol` has graduated to the stable API.
pt_br: :class:`asyncio.BufferedProtocol` foi promovida a API estável.

source: DLL dependencies for extension modules and DLLs loaded with :mod:`ctypes` on Windows are now resolved more securely. Only the system paths, the directory containing the DLL or PYD file, and directories added with :func:`~os.add_dll_directory` are searched for load-time dependencies. Specifically, :envvar:`PATH` and the current working directory are no longer used, and modifications to these will no longer have any effect on normal DLL resolution. If your application relies on these mechanisms, you should check for :func:`~os.add_dll_directory` and if it exists, use it to add your DLLs directory while loading your library. Note that Windows 7 users will need to ensure that Windows Update KB2533623 has been installed (this is also verified by the installer). (Contributed by Steve Dower in :issue:`36085`.)
pt_br: As dependências de DLL para módulos de extensão e DLLs carregadas com :mod:`ctypes` no Windows agora são resolvidas com mais segurança. Somente os caminhos do sistema, o diretório que contém o arquivo DLL ou PYD e os diretórios adicionados com :func:`~os.add_dll_directory` são pesquisados por dependências de tempo de carregamento. Especificamente, :envvar:`PATH` e o diretório de trabalho atual não são mais usados, e as modificações nelas não terão mais efeito na resolução normal da DLL. Se seu aplicativo conta com esses mecanismos, você deve verificar :func:`~os.add_dll_directory` e, se existir, use-o para adicionar seu diretório DLLs ao carregar sua biblioteca. Observe que os usuários do Windows 7 precisarão garantir que o Windows Update KB2533623 esteja instalado (isso também é verificado pelo instalador). (Contribuição de Steve Dower em :issue:`36085`.)

source: The header files and functions related to pgen have been removed after its replacement by a pure Python implementation. (Contributed by Pablo Galindo in :issue:`36623`.)
pt_br: Os arquivos de cabeçalho e as funções relacionadas ao pgen foram removidos após sua substituição por uma implementação pura do Python. (Contribuição de Pablo Galindo em :issue:`36623`.)

source: :class:`types.CodeType` has a new parameter in the second position of the constructor (*posonlyargcount*) to support positional-only arguments defined in :pep:`570`. The first argument (*argcount*) now represents the total number of positional arguments (including positional-only arguments). The new ``replace()`` method of :class:`types.CodeType` can be used to make the code future-proof.
pt_br: :class:`types.CodeType` possui um novo parâmetro na segunda posição do construtor (*posonlyargcount *) para suportar argumentos apenas de posição definidos em :pep:`570`. O primeiro argumento (*argcount*) agora representa o número total de argumentos posicionais (incluindo argumentos somente posicionais). O novo método ``replace()`` de :class:`types.CodeType` pode ser usado para tornar o código à prova de futuro.

source: The parameter ``digestmod`` for :func:`hmac.new` no longer uses the MD5 digest by default.
pt_br: O parâmetro ``digestmod`` para :func:`hmac.new` não usa mais o resumo MD5 por padrão.

source: Changes in the C API
pt_br: Alterações na API C

source: The :c:struct:`PyCompilerFlags` structure got a new *cf_feature_version* field. It should be initialized to ``PY_MINOR_VERSION``. The field is ignored by default, and is used if and only if ``PyCF_ONLY_AST`` flag is set in *cf_flags*. (Contributed by Guido van Rossum in :issue:`35766`.)
pt_br: A estrutura :c:struct:`PyCompilerFlags` recebeu um novo campo *cf_feature_version*. Ele deve ser inicializado para ``PY_MINOR_VERSION``. O campo é ignorado por padrão e é usado se e somente se o sinalizador ``PyCF_ONLY_AST`` estiver definido em *cf_flags*. (Contribuição de Guido van Rossum em :issue:`35766`.)

source: The :c:func:`!PyEval_ReInitThreads` function has been removed from the C API. It should not be called explicitly: use :c:func:`PyOS_AfterFork_Child` instead. (Contributed by Victor Stinner in :issue:`36728`.)
pt_br: A função :c:func:`!PyEval_ReInitThreads` foi removida da API C. Não deve ser chamada explicitamente: use :c:func:`PyOS_AfterFork_Child`. (Contribuição de Victor Stinner em :issue:`36728`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. When Python is embedded, ``libpython`` must not be loaded with ``RTLD_LOCAL``, but ``RTLD_GLOBAL`` instead. Previously, using ``RTLD_LOCAL``, it was already not possible to load C extensions which were not linked to ``libpython``, like C extensions of the standard library built by the ``*shared*`` section of ``Modules/Setup``. (Contributed by Victor Stinner in :issue:`21536`.)
pt_br: No Unix, as extensões C não estão mais vinculadas ao libpython, exceto no Android e Cygwin. Quando o Python é incorporado, ``libpython`` não deve ser carregado com ``RTLD_LOCAL``, mas ``RTLD_GLOBAL``. Anteriormente, usando ``RTLD_LOCAL``, já não era possível carregar extensões C que não estavam vinculadas a ``libpython``, como extensões C da biblioteca padrão criada pela seção ``*shared*`` de ``Modules/Setup``. (Contribuição de Victor Stinner em :issue:`21536`.)

source: Use of ``#`` variants of formats in parsing or building value (e.g. :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, etc.) without ``PY_SSIZE_T_CLEAN`` defined raises ``DeprecationWarning`` now. It will be removed in 3.10 or 4.0. Read :ref:`arg-parsing` for detail. (Contributed by Inada Naoki in :issue:`36381`.)
pt_br: O uso de variantes ``#`` de formatos na análise ou construção de valor (por exemplo, :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, etc.) sem ``PY_SSIZE_T_CLEAN`` definido agora levanta ``DeprecationWarning``. Será removido em 3.10 ou 4.0. Leia :ref:`arg-parsing` para detalhes. (Contribuição de Inada Naoki em :issue:`36381`.)

source: Instances of heap-allocated types (such as those created with :c:func:`PyType_FromSpec`) hold a reference to their type object. Increasing the reference count of these type objects has been moved from :c:func:`PyType_GenericAlloc` to the more low-level functions, :c:func:`PyObject_Init` and :c:func:`PyObject_INIT`. This makes types created through :c:func:`PyType_FromSpec` behave like other classes in managed code.
pt_br: Instâncias de tipos alocados por heap (como aqueles criados com :c:func:`PyType_FromSpec`) mantêm uma referência ao seu objeto de tipo. O aumento da contagem de referências desses objetos de tipo foi movido de :c:func:`PyType_GenericAlloc` para as funções de nível mais baixo, :c:func:`PyObject_Init` e :c:func:`PyObject_INIT`. Isso faz com que os tipos criados através de :c:func:`PyType_FromSpec` se comportem como outras classes no código gerenciado.

source: :ref:`Statically allocated types <static-types>` are not affected.
pt_br: :ref:`Tipos alocados estaticamente <static-types>` não são afetados.

source: For the vast majority of cases, there should be no side effect. However, types that manually increase the reference count after allocating an instance (perhaps to work around the bug) may now become immortal. To avoid this, these classes need to call Py_DECREF on the type object during instance deallocation.
pt_br: Para a grande maioria dos casos, não deve haver efeito colateral. No entanto, tipos que aumentam manualmente a contagem de referência após alocar uma instância (talvez para solucionar o bug) agora podem se tornar imortais. Para evitar isso, essas classes precisam chamar Py_DECREF no objeto de tipo durante a desalocação da instância.

source: To correctly port these types into 3.8, please apply the following changes:
pt_br: Para portar corretamente esses tipos para o 3.8, aplique as seguintes alterações:

source: Remove :c:macro:`Py_INCREF` on the type object after allocating an instance - if any. This may happen after calling :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar`, or any other custom allocator that uses :c:func:`PyObject_Init` or :c:func:`PyObject_INIT`.
pt_br: Remove :c:macro:`Py_INCREF` no objeto de tipo depois de alocar uma instância -- se houver. Isso pode acontecer após a chamada de :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar`, :c:func:`PyObject_GC_New`, :c:func:`PyObject_GC_NewVar` ou qualquer outro alocador personalizado que use :c:func:`PyObject_Init` ou :c:func:`PyObject_INIT`.

source: Example:
pt_br: Exemplo:

source: Ensure that all custom ``tp_dealloc`` functions of heap-allocated types decrease the type's reference count.
pt_br: Certifica-se de que todas as funções ``tp_dealloc`` personalizadas de tipos alocados em heap diminuam a contagem de referências do tipo.

source: (Contributed by Eddie Elizondo in :issue:`35810`.)
pt_br: (Contribuição de Eddie Elizondo em :issue:`35810`.)

source: The :c:macro:`Py_DEPRECATED()` macro has been implemented for MSVC. The macro now must be placed before the symbol name.
pt_br: A macro :c:macro:`Py_DEPRECATED()` foi implementada para MSVC. A macro agora deve ser colocada antes do nome do símbolo.

source: (Contributed by Zackery Spytz in :issue:`33407`.)
pt_br: (Contribuição de Zackery Spytz em :issue:`33407`.)

source: The interpreter does not pretend to support binary compatibility of extension types across feature releases, anymore. A :c:type:`PyTypeObject` exported by a third-party extension module is supposed to have all the slots expected in the current Python version, including :c:member:`~PyTypeObject.tp_finalize` (:c:macro:`Py_TPFLAGS_HAVE_FINALIZE` is not checked anymore before reading :c:member:`~PyTypeObject.tp_finalize`).
pt_br: O interpretador não pretende mais dar suporte à compatibilidade binária de tipos de extensão nas liberações de recursos. O :c:type:`PyTypeObject` exportado por um módulo de extensão de terceiros deve ter todos os slots esperados na versão atual do Python, incluindo :c:member:`~PyTypeObject.tp_finalize` (:c:macro:`Py_TPFLAGS_HAVE_FINALIZE` não é mais verificado antes de ler :c:member:`~PyTypeObject.tp_finalize`).

source: (Contributed by Antoine Pitrou in :issue:`32388`.)
pt_br: (Contribuição de Antoine Pitrou em :issue:`32388`.)

source: The functions :c:func:`!PyNode_AddChild` and :c:func:`!PyParser_AddToken` now accept two additional ``int`` arguments *end_lineno* and *end_col_offset*.
pt_br: As funções :c:func:`!PyNode_AddChild` e :c:func:`!PyParser_AddToken` agora aceitam dois argumentos adicionais ``int`` *end_lineno* e *end_col_offset*.

source: The :file:`libpython38.a` file to allow MinGW tools to link directly against :file:`python38.dll` is no longer included in the regular Windows distribution. If you require this file, it may be generated with the ``gendef`` and ``dlltool`` tools, which are part of the MinGW binutils package:
pt_br: O arquivo :file:`libpython38.a` para permitir que as ferramentas do MinGW se vinculem diretamente a :file:`python38.dll` não está mais incluído na distribuição regular do Windows. Se você precisar deste arquivo, ele poderá ser gerado com as ferramentas ``gendef`` e ``dlltool``, que fazem parte do pacote binutils do MinGW:
