Repository: python/python-docs-pt-br
Catalog: whatsnew/3.8.po
Languages: pt_br

source: Added new clock :const:`~time.CLOCK_UPTIME_RAW` for macOS 10.12. (Contributed by Joannah Nanjekye in :issue:`35702`.)
pt_br: Adiciona o novo relógio :const:`~time.CLOCK_UPTIME_RAW` ao macOS 10.12. (Contribuição de Joannah Nanjekye em :issue:`35702`.)

source: The :mod:`typing` module incorporates several new features:
pt_br: O módulo :mod:`typing` incorpora vários novos recursos:

source: A dictionary type with per-key types. See :pep:`589` and :class:`typing.TypedDict`. TypedDict uses only string keys. By default, every key is required to be present. Specify "total=False" to allow keys to be optional::
pt_br: Um tipo de dicionário com tipos por chave. Veja :pep:`589` e :class:`typing.TypedDict`. TypedDict usa apenas chaves de strings. Por padrão, é necessário que todas as chaves estejam presentes. Especifique "total=False" para permitir que as chaves sejam opcionais::

source: Literal types. See :pep:`586` and :class:`typing.Literal`. Literal types indicate that a parameter or return value is constrained to one or more specific literal values::
pt_br: Tipos literais. Veja :pep:`586` e :class:`typing.Literal`. Tipos literais indicam que um parâmetro ou valor de retorno está restrito a um ou mais valores literais específicos::

source: "Final" variables, functions, methods and classes. See :pep:`591`, :class:`typing.Final` and :func:`typing.final`. The final qualifier instructs a static type checker to restrict subclassing, overriding, or reassignment::
pt_br: Variáveis, funções, métodos e classes "finais". Veja :pep:`591`, :class:`typing.Final` e :func:`typing.final`. O qualificador final instrui um verificador de tipo estático a restringir criação de subclasse, substituição ou reatribuição::

source: Protocol definitions. See :pep:`544`, :class:`typing.Protocol` and :func:`typing.runtime_checkable`. Simple ABCs like :class:`typing.SupportsInt` are now ``Protocol`` subclasses.
pt_br: Definições de protocolo. Veja :pep:`544`, :class:`typing.Protocol` e :func:`typing.runtime_checkable`. ABCs simples como :class:`typing.SupportsInt` agora são subclasses de ``Protocol``.

source: New protocol class :class:`typing.SupportsIndex`.
pt_br: Nova classe de protocolo :class:`typing.SupportsIndex`.

source: New functions :func:`typing.get_origin` and :func:`typing.get_args`.
pt_br: Novas funções :func:`typing.get_origin` e :func:`typing.get_args`.

source: The :mod:`unicodedata` module has been upgraded to use the `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_ release.
pt_br: O módulo :mod:`unicodedata` agora foi atualizado para usar o `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_.

source: New function :func:`~unicodedata.is_normalized` can be used to verify a string is in a specific normal form, often much faster than by actually normalizing the string. (Contributed by Max Belanger, David Euresti, and Greg Price in :issue:`32285` and :issue:`37966`).
pt_br: A nova função :func:`~unicodedata.is_normalized` pode ser usada para verificar se uma string está em uma forma normal específica, geralmente muito mais rápida do que normalizar a string. (Contribuição de Max Belanger, David Euresti e Greg Price em :issue:`32285` e :issue:`37966`).

source: Added :class:`~unittest.mock.AsyncMock` to support an asynchronous version of :class:`~unittest.mock.Mock`. Appropriate new assert functions for testing have been added as well. (Contributed by Lisa Roach in :issue:`26467`).
pt_br: Adicionada :class:`~unittest.mock.AsyncMock` para dar suporte a uma versão assíncrona de :class:`~unittest.mock.Mock`. Também foram adicionadas novas funções apropriadas para teste. (Contribuição de Lisa Roach em :issue:`26467`).

source: Several mock assert functions now also print a list of actual calls upon failure. (Contributed by Petter Strandmark in :issue:`35047`.)
pt_br: Várias funções de declaração de mock agora também exibem uma lista de chamadas reais em caso de falha. (Contribuição de Petter Strandmark em :issue:`35047`.)

source: :mod:`unittest` module gained support for coroutines to be used as test cases with :class:`unittest.IsolatedAsyncioTestCase`. (Contributed by Andrew Svetlov in :issue:`32972`.)
pt_br: O módulo :mod:`unittest` ganhou suporte a corrotinas a serem usadas como casos de teste com :class:`unittest.IsolatedAsyncioTestCase`. (Contribuição de Andrew Svetlov em :issue:`32972`.)

source: Example::
pt_br: Exemplo::

source: :mod:`venv` now includes an ``Activate.ps1`` script on all platforms for activating virtual environments under PowerShell Core 6.1. (Contributed by Brett Cannon in :issue:`32718`.)
pt_br: :mod:`venv` agora inclui um script ``Activate.ps1`` em todas as plataformas para ativar ambientes virtuais no PowerShell Core 6.1. (Contribuição de Brett Cannon em :issue:`32718`.)

source: The proxy objects returned by :func:`weakref.proxy` now support the matrix multiplication operators ``@`` and ``@=`` in addition to the other numeric operators. (Contributed by Mark Dickinson in :issue:`36669`.)
pt_br: Os objetos proxy retornados por :func:`weakref.proxy` agora possuem suporte aos operadores de multiplicação de matrizes ``@`` e ``@=`` além dos outros operadores numéricos. (Contribuição de Mark Dickinson em :issue:`36669`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
pt_br: Como atenuação a DTD e recuperação de entidade externa, os módulos :mod:`xml.dom.minidom` e :mod:`xml.sax` não processam mais entidades externas por padrão. (Contribuição de Christian Heimes em :issue:`17239`.)

source: The ``.find*()`` methods in the :mod:`xml.etree.ElementTree` module support wildcard searches like ``{*}tag`` which ignores the namespace and ``{namespace}*`` which returns all tags in the given namespace. (Contributed by Stefan Behnel in :issue:`28238`.)
pt_br: Os métodos ``.find*()`` no módulo :mod:`xml.etree.ElementTree` possuem suporte a pesquisas curinga como ``{*}tag``, que ignora o espaço para nome e ``{namespace}*``, que retorna todas as tags no espaço para nome especificado. (Contribuição de Stefan Behnel em :issue:`28238`.)

source: The target object of :class:`xml.etree.ElementTree.XMLParser` can receive namespace declaration events through the new callback methods ``start_ns()`` and ``end_ns()``. Additionally, the :class:`xml.etree.ElementTree.TreeBuilder` target can be configured to process events about comments and processing instructions to include them in the generated tree. (Contributed by Stefan Behnel in :issue:`36676` and :issue:`36673`.)
pt_br: O objeto de destino de :class:`xml.etree.ElementTree.XMLParser` pode receber eventos de declaração de espaço de nomes através dos novos métodos de retorno de chamada ``start_ns()`` e ``end_ns ()``. Além disso, o destino :class:`xml.etree.ElementTree.TreeBuilder` pode ser configurado para processar eventos sobre comentários e instruções de processamento para incluí-los na árvore gerada. (Contribuição de Stefan Behnel em :issue:`36676` e :issue:`36673`.)

source: :class:`xmlrpc.client.ServerProxy` now supports an optional *headers* keyword argument for a sequence of HTTP headers to be sent with each request. Among other things, this makes it possible to upgrade from default basic authentication to faster session authentication. (Contributed by Cédric Krier in :issue:`35153`.)
pt_br: :class:`xmlrpc.client.ServerProxy` agora possui suporte a um argumento nomeado *headers* opcional para que uma sequência de cabeçalhos HTTP seja enviada a cada solicitação. Entre outras coisas, isso possibilita a atualização da autenticação básica padrão para uma autenticação de sessão mais rápida. (Contribuição de Cédric Krier em :issue:`35153`.)

source: Optimizations
pt_br: Otimizações

source: The :mod:`subprocess` module can now use the :func:`os.posix_spawn` function in some cases for better performance. Currently, it is only used on macOS and Linux (using glibc 2.24 or newer) if all these conditions are met:
pt_br: O módulo :mod:`subprocess` agora pode usar a função :func:`os.posix_spawn` em alguns casos para obter melhor desempenho. Atualmente, ele é usado apenas no macOS e Linux (usando glibc 2.24 ou mais recente) se todas essas condições forem atendidas:

source: *close_fds* is false;
pt_br: *close_fds* ser false;

source: *preexec_fn*, *pass_fds*, *cwd* and *start_new_session* parameters are not set;
pt_br: os parâmetros *preexec_fn*, *pass_fds*, *cwd* and *start_new_session* não estarem definidos;

source: the *executable* path contains a directory.
pt_br: o caminho *executable* conter um diretório.

source: (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
pt_br: (Contribuição de Joannah Nanjekye e Victor Stinner em :issue:`35537`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls on Linux and macOS in order to copy the file more efficiently. "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``". On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 16 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used. The speedup for copying a 512 MiB file within the same partition is about +26% on Linux, +50% on macOS and +40% on Windows. Also, much less CPU cycles are consumed. See :ref:`shutil-platform-dependent-efficient-copy-operations` section. (Contributed by Giampaolo Rodolà in :issue:`33671`.)
pt_br: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` e :func:`shutil.copytree` usam chamadas de sistema "fast-copy" específicas da plataforma no Linux e no macOS para copiar o arquivo com mais eficiência. "fast-copy" significa que a operação de cópia ocorre dentro do kernel, evitando o uso de buffers de espaço do usuário no Python como em "``outfd.write(infd.read())``". No Windows, :func:`shutil.copyfile` usa um buffer padrão com tamanho maior (1 MiB em vez de 16 KiB) e é usada uma variante de :func:`shutil.copyfileobj` baseada em :func:`memoryview`. A velocidade de cópia de um arquivo 512 MiB na mesma partição é de aproximadamente +26% no Linux, +50% no macOS e +40% no Windows. Além disso, muito menos ciclos de CPU são consumidos. Veja a seção :ref:`shutil-platform-dependent-efficient-copy-operations`. (Contribuição de Giampaolo Rodolà em :issue:`33671`.)

source: :func:`shutil.copytree` uses :func:`os.scandir` function and all copy functions depending from it use cached :func:`os.stat` values. The speedup for copying a directory with 8000 files is around +9% on Linux, +20% on Windows and +30% on a Windows SMB share. Also the number of :func:`os.stat` syscalls is reduced by 38% making :func:`shutil.copytree` especially faster on network filesystems. (Contributed by Giampaolo Rodolà in :issue:`33695`.)
pt_br: :func:`shutil.copytree` usa a função :func:`os.scandir` e todas as funções de cópia que dependem dela usam valores em cache de :func:`os.stat`. A velocidade para copiar um diretório com 8000 arquivos é de cerca de +9% no Linux, +20% no Windows e +30% em um compartilhamento SMB do Windows. Além disso, o número de chamadas de sistema :func:`os.stat` é reduzido em 38%, tornando :func:`shutil.copytree` especialmente mais rápida em sistemas de arquivos em rede. (Contribuição de Giampaolo Rodolà em :issue:`33695`.)

source: The default protocol in the :mod:`pickle` module is now Protocol 4, first introduced in Python 3.4. It offers better performance and smaller size compared to Protocol 3 available since Python 3.0.
pt_br: O protocolo padrão no módulo :mod:`pickle` agora é o Protocolo 4, introduzido pela primeira vez no Python 3.4. Ele oferece melhor desempenho e tamanho menor em comparação com o Protocolo 3 disponível desde o Python 3.0.

source: Removed one :c:type:`Py_ssize_t` member from ``PyGC_Head``. All GC tracked objects (e.g. tuple, list, dict) size is reduced 4 or 8 bytes. (Contributed by Inada Naoki in :issue:`33597`.)
pt_br: Removido um membro :c:type:`Py_ssize_t` de ``PyGC_Head``. O tamanho de todos os objetos rastreados pelo coletor de lixo (por exemplo, tupla, lista, ditado) é reduzido em 4 ou 8 bytes. (Contribuição de Inada Naoki em :issue:`33597`.)

source: :class:`uuid.UUID` now uses ``__slots__`` to reduce its memory footprint. (Contributed by Wouter Bolsterlee and Tal Einat in :issue:`30977`)
pt_br: :class:`uuid.UUID` agora usa ``__slots__`` para reduzir seu uso de espaço de memória. (Contribuição de Wouter Bolsterlee e Tal Einat em :issue:`30977`)

source: Improved performance of :func:`operator.itemgetter` by 33%. Optimized argument handling and added a fast path for the common case of a single non-negative integer index into a tuple (which is the typical use case in the standard library). (Contributed by Raymond Hettinger in :issue:`35664`.)
pt_br: Melhor desempenho de :func:`operator.itemgetter` em 33%. Manipulação de argumento otimizada e incluído um caminho rápido para o caso comum de um único índice inteiro não negativo em uma tupla (que é o caso de uso típico na biblioteca padrão). (Contribuição de Raymond Hettinger em :issue:`35664`.)

source: Sped-up field lookups in :func:`collections.namedtuple`. They are now more than two times faster, making them the fastest form of instance variable lookup in Python. (Contributed by Raymond Hettinger, Pablo Galindo, and Joe Jevnik, Serhiy Storchaka in :issue:`32492`.)
pt_br: Pesquisas de campo aceleradas em :func:`collections.namedtuple`. Agora elas são duas vezes mais rápidas, tornando-as a forma mais rápida de pesquisa de variáveis de instância no Python. (Contribuição de Raymond Hettinger, Pablo Galindo e Joe Jevnik, Serhiy Storchaka em :issue:`32492`.)

source: The :class:`list` constructor does not overallocate the internal item buffer if the input iterable has a known length (the input implements ``__len__``). This makes the created list 12% smaller on average. (Contributed by Raymond Hettinger and Pablo Galindo in :issue:`33234`.)
pt_br: O construtor :class:`list` não atribui globalmente o buffer interno do item se a entrada iterável tiver um comprimento conhecido (a entrada implementa ``__len__``). Isso torna a lista criada 12% menor em média. (Contribuição de Raymond Hettinger e Pablo Galindo em :issue:`33234`.)

source: Doubled the speed of class variable writes. When a non-dunder attribute was updated, there was an unnecessary call to update slots. (Contributed by Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer, and Serhiy Storchaka in :issue:`36012`.)
pt_br: Duplicada a velocidade de gravação de variável de classe. Quando um atributo não-dunder era atualizado, havia uma chamada desnecessária para atualizar os slots. (Contribuição de Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer e Serhiy Storchaka em :issue:`36012`.)

source: Reduced an overhead of converting arguments passed to many builtin functions and methods. This sped up calling some simple builtin functions and methods up to 20--50%. (Contributed by Serhiy Storchaka in :issue:`23867`, :issue:`35582` and :issue:`36127`.)
pt_br: Reduzida a sobrecarga dos argumentos de conversão passados para muitas funções e métodos internos. Isso acelerou chamando algumas funções e métodos internos simples de 20--50%. (Contribuição de Serhiy Storchaka em :issue:`23867`, :issue:`35582` e :issue:`36127`.)

source: ``LOAD_GLOBAL`` instruction now uses new "per opcode cache" mechanism. It is about 40% faster now. (Contributed by Yury Selivanov and Inada Naoki in :issue:`26219`.)
pt_br: A instrução ``LOAD_GLOBAL`` agora usa o novo mecanismo "por cache de código de operação". É cerca de 40% mais rápido agora. (Contribuição de Yury Selivanov e Inada Naoki em :issue: `26219`.)

source: Build and C API Changes
pt_br: Mudanças a construções e API C

source: Default :data:`sys.abiflags` became an empty string: the ``m`` flag for pymalloc became useless (builds with and without pymalloc are ABI compatible) and so has been removed. (Contributed by Victor Stinner in :issue:`36707`.)
pt_br: O :data:`sys.abiflags` padrão se tornou uma string vazia: o sinalizador ``m`` para pymalloc se tornou inútil (compilações com e sem pymalloc são compatíveis com ABI) e, portanto, foi removido. (Contribuição de Victor Stinner em :issue:`36707`.)

source: Example of changes:
pt_br: Exemplos de alterações:

source: Only ``python3.8`` program is installed, ``python3.8m`` program is gone.
pt_br: Somente o programa ``python3.8`` é instalado, o programa ``python3.8m`` se foi.

source: Only ``python3.8-config`` script is installed, ``python3.8m-config`` script is gone.
pt_br: Somente o script ``python3.8-config`` é instalado, o programa ``python3.8m-config`` se foi.

source: The ``m`` flag has been removed from the suffix of dynamic library filenames: extension modules in the standard library as well as those produced and installed by third-party packages, like those downloaded from PyPI. On Linux, for example, the Python 3.7 suffix ``.cpython-37m-x86_64-linux-gnu.so`` became ``.cpython-38-x86_64-linux-gnu.so`` in Python 3.8.
pt_br: O sinalizador ``m`` foi removido do sufixo dos nomes de arquivos da biblioteca dinâmica: módulos de extensão na biblioteca padrão, bem como daqueles produzidos e instalados por pacotes de terceiros, como os baixados do PyPI. No Linux, por exemplo, o sufixo de ``.cpython-37m-x86_64-linux-gnu.so`` do Python 3.7 se tornou ``.cpython-38-x86_64-linux-gnu.so`` no Python 3.8.

source: The header files have been reorganized to better separate the different kinds of APIs:
pt_br: Os arquivos de cabeçalho foram reorganizados para separar melhor os diferentes tipos de APIs:

source: ``Include/*.h`` should be the portable public stable C API.
pt_br: ``Include/*.h`` deve ser a API C pública estável e portátil.

source: ``Include/cpython/*.h`` should be the unstable C API specific to CPython; public API, with some private API prefixed by ``_Py`` or ``_PY``.
pt_br: ``Include/cpython/*.h`` deve ser a API C instável específica do CPython; API pública, com alguma API privada prefixada por ``_Py`` ou ``_PY``.

source: ``Include/internal/*.h`` is the private internal C API very specific to CPython. This API comes with no backward compatibility warranty and should not be used outside CPython. It is only exposed for very specific needs like debuggers and profiles which has to access to CPython internals without calling functions. This API is now installed by ``make install``.
pt_br: ``Include/internal/*.h`` é a API C interna privada muito específica do CPython. Essa API é fornecida sem garantia de compatibilidade com versões anteriores e não deve ser usada fora do CPython. Ele é exposto apenas a necessidades muito específicas, como depuradores e perfis, que precisam acessar os componentes internos do CPython sem chamar funções. Esta API agora está instalada por ``make install``.

source: (Contributed by Victor Stinner in :issue:`35134` and :issue:`35081`, work initiated by Eric Snow in Python 3.7.)
pt_br: (Contribuição de Victor Stinner em :issue:`35134` e :issue:`35081`, trabalho iniciado por Eric Snow em Python 3.7.)

source: Some macros have been converted to static inline functions: parameter types and return type are well defined, they don't have issues specific to macros, variables have a local scopes. Examples:
pt_br: Algumas macros foram convertidas em funções in-line estáticas: os tipos de parâmetros e o tipo de retorno são bem definidos, eles não têm problemas específicos para as macros, as variáveis têm escopos locais. Exemplos:

source: Private functions: :c:func:`!_PyObject_GC_TRACK`, :c:func:`!_PyObject_GC_UNTRACK`, :c:func:`!_Py_Dealloc`
pt_br: Funções privadas: :c:func:`!_PyObject_GC_TRACK`, :c:func:`!_PyObject_GC_UNTRACK`, :c:func:`!_Py_Dealloc`

source: (Contributed by Victor Stinner in :issue:`35059`.)
pt_br: (Contribuição de Victor Stinner em :issue:`35059`.)

source: The :c:func:`!PyByteArray_Init` and :c:func:`!PyByteArray_Fini` functions have been removed. They did nothing since Python 2.7.4 and Python 3.2.0, were excluded from the limited API (stable ABI), and were not documented. (Contributed by Victor Stinner in :issue:`35713`.)
pt_br: As funções :c:func:`!PyByteArray_Init` e :c:func:`!PyByteArray_Fini` foram removidas. Elas não faziam nada desde o Python 2.7.4 e o Python 3.2.0, foram excluídas da API limitada (ABI estável) e não foram documentados. (Contribuição de Victor Stinner em :issue:`35713`.)

source: The result of :c:func:`PyExceptionClass_Name` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`33818`.)
pt_br: O resultado de :c:func:`PyExceptionClass_Name` agora é do tipo ``const char *`` em vez de ``char *``. (Contribuição de Serhiy Storchaka em :issue:`33818`.)

source: The duality of ``Modules/Setup.dist`` and ``Modules/Setup`` has been removed. Previously, when updating the CPython source tree, one had to manually copy ``Modules/Setup.dist`` (inside the source tree) to ``Modules/Setup`` (inside the build tree) in order to reflect any changes upstream. This was of a small benefit to packagers at the expense of a frequent annoyance to developers following CPython development, as forgetting to copy the file could produce build failures.
pt_br: A dualidade de ``Modules/Setup.dist`` e ``Modules/Setup`` foi removida. Anteriormente, ao atualizar a árvore de fontes do CPython, era necessário copiar manualmente ``Modules/Setup.dist`` (dentro da árvore de fontes) para ``Modules/Setup`` (dentro da árvore de compilação), a fim de refletir todas as alterações upstream. Isso foi um pequeno benefício para os empacotadores, à custa de um aborrecimento frequente para os desenvolvedores após o desenvolvimento do CPython, pois esquecer de copiar o arquivo pode causar falhas na compilação.

source: Now the build system always reads from ``Modules/Setup`` inside the source tree. People who want to customize that file are encouraged to maintain their changes in a git fork of CPython or as patch files, as they would do for any other change to the source tree.
pt_br: Agora, o sistema de compilação sempre lê ``Modules/Setup`` dentro da árvore de fontes. As pessoas que desejam personalizar esse arquivo são incentivadas a manter suas alterações em um fork do git do CPython ou como arquivos de patch, como faria em qualquer outra alteração na árvore de fontes.

source: (Contributed by Antoine Pitrou in :issue:`32430`.)
pt_br: (Contribuição de Antoine Pitrou em :issue:`32430`.)
