Repository: python/python-docs-pt-br
Catalog: whatsnew/3.8.po
Languages: pt_br

source: Added optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
pt_br: Adicionados números de linha opcionais para janelas do editor IDLE. O Windows é aberto sem números de linha, a menos que definido de outra forma na guia General da caixa de diálogo de configuração. Os números de linha de uma janela existente são mostrados e ocultos no menu Opções. (Contribuição de Tal Einat e Saimadhav Heblikar em :issue:`17535`.)

source: OS native encoding is now used for converting between Python strings and Tcl objects. This allows IDLE to work with emoji and other non-BMP characters. These characters can be displayed or copied and pasted to or from the clipboard. Converting strings from Tcl to Python and back now never fails. (Many people worked on this for eight years but the problem was finally solved by Serhiy Storchaka in :issue:`13153`.)
pt_br: A codificação nativa do sistema operacional agora é usada para converter entre strings Python e objetos Tcl. Isso permite que o IDLE trabalhe com emoji e outros caracteres não BMP. Esses caracteres podem ser exibidos ou copiados e colados na ou da área de transferência. A conversão de strings de Tcl para Python e de volta agora nunca falha. (Muitas pessoas trabalharam nisso por oito anos, mas o problema foi finalmente resolvido por Serhiy Storchaka em :issue:`13153`.)

source: New in 3.8.1:
pt_br: Novo em 3.8.1:

source: Add option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
pt_br: Adiciona a opção para ativar e desativar o piscar do cursor. (Contribuição de Zackery Spytz na :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
pt_br: A tecla Escape agora fecha as janelas de conclusão IDLE. (Contribuição de Johnny Najera em :issue:`38944`.)

source: The changes above have been backported to 3.7 maintenance releases.
pt_br: As alterações acima foram suportadas para versões de manutenção 3.7.

source: Add keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
pt_br: Adiciona argumentos nomeados à lista de completamento de nome de módulo. (Contribuição de Terry J. Reedy em :issue:`37765`.)

source: The :func:`inspect.getdoc` function can now find docstrings for ``__slots__`` if that attribute is a :class:`dict` where the values are docstrings. This provides documentation options similar to what we already have for :func:`property`, :func:`classmethod`, and :func:`staticmethod`::
pt_br: A função :func:`inspect.getdoc` agora pode encontrar docstrings para ``__slots__`` se esse atributo for :class:`dict` onde os valores são docstrings. Isso fornece opções de documentação semelhantes às que já temos para :func:`property`, :func:`classmethod` e :func:`staticmethod`::

source: (Contributed by Raymond Hettinger in :issue:`36326`.)
pt_br: (Contribuição de Raymond Hettinger em :issue:`36326`.)

source: In development mode (:option:`-X` ``env``) and in :ref:`debug build <debug-build>`, the :class:`io.IOBase` finalizer now logs the exception if the ``close()`` method fails. The exception is ignored silently by default in release build. (Contributed by Victor Stinner in :issue:`18748`.)
pt_br: No modo de desenvolvimento (:option:`-X` ``env``) e na :ref:`compilação de depuração <debug-build>`, o finalizador :class:`io.IOBase` agora registra a exceção se o método ``close()`` falhar. A exceção é ignorada silenciosamente por padrão na compilação de lançamento. (Contribuição de Victor Stinner em :issue:`18748`.)

source: The :func:`itertools.accumulate` function added an option *initial* keyword argument to specify an initial value::
pt_br: A função :func:`itertools.accumulate` adicionou uma opção de argumento nomeado *initial* para especificar um valor inicial::

source: (Contributed by Lisa Roach in :issue:`34659`.)
pt_br: (Contribuído por Lisa Roach em :issue:`34659`.)

source: Add option ``--json-lines`` to parse every input line as a separate JSON object. (Contributed by Weipeng Hong in :issue:`31553`.)
pt_br: Adiciona a opção ``--json-lines`` para analisar cada linha de entrada como um objeto JSON separado. (Contribuição de Weipeng Hong em :issue:`31553`.)

source: This solves a long-standing problem. Once a logger or *basicConfig()* had been called, subsequent calls to *basicConfig()* were silently ignored. This made it difficult to update, experiment with, or teach the various logging configuration options using the interactive prompt or a Jupyter notebook.
pt_br: Isso resolve um problema de longa data. Depois que um logger ou *basicConfig()* foi chamado, as chamadas subsequentes para *basicConfig()* foram ignoradas silenciosamente. Isso dificultava a atualização, a experimentação ou o ensino das várias opções de configuração de log usando o prompt interativo ou um bloco de notas de Jupyter.

source: (Suggested by Raymond Hettinger, implemented by Donghee Na, and reviewed by Vinay Sajip in :issue:`33897`.)
pt_br: (Sugestão de Raymond Hettinger, implementação de Dong-hee Na e revisão de Vinay Sajip em :issue:`33897`.)

source: Added new function :func:`math.dist` for computing Euclidean distance between two points. (Contributed by Raymond Hettinger in :issue:`33089`.)
pt_br: Adicionada nova função :func:`math.dist` para calcular a distância euclidiana entre dois pontos. (Contribuição de Raymond Hettinger em :issue:`33089`.)

source: Expanded the :func:`math.hypot` function to handle multiple dimensions. Formerly, it only supported the 2-D case. (Contributed by Raymond Hettinger in :issue:`33089`.)
pt_br: Expandida a função :func:`math.hypot` para manipular várias dimensões. Anteriormente, suportava apenas o caso 2-D. (Contribuição de Raymond Hettinger em :issue:`33089`.)

source: Added new function, :func:`math.prod`, as analogous function to :func:`sum` that returns the product of a 'start' value (default: 1) times an iterable of numbers::
pt_br: Adicionada nova função, :func:`math.prod`, como função análoga a :func:`sum` que retorna o produto de um valor 'start' (padrão: 1) vezes uma iterável de números::

source: (Contributed by Pablo Galindo in :issue:`35606`.)
pt_br: (Contribuição de Pablo Galindo em :issue:`35606`.)

source: Added two new combinatoric functions :func:`math.perm` and :func:`math.comb`::
pt_br: Adicionadas duas novas funções combinatórias :func:`math.perm` e :func:`math.comb`::

source: (Contributed by Yash Aggarwal, Keller Fuchs, Serhiy Storchaka, and Raymond Hettinger in :issue:`37128`, :issue:`37178`, and :issue:`35431`.)
pt_br: (Contribuição de Yash Aggarwal, Keller Fuchs, Serhiy Storchaka e Raymond Hettinger em :issue:`37128`, :issue:`37178` e :issue:`35431`.)

source: Added a new function :func:`math.isqrt` for computing accurate integer square roots without conversion to floating point. The new function supports arbitrarily large integers. It is faster than ``floor(sqrt(n))`` but slower than :func:`math.sqrt`::
pt_br: Adicionada uma nova função :func:`math.isqrt` para calcular raízes quadradas inteiras precisas sem conversão para ponto flutuante. A nova função suporta números inteiros arbitrariamente grandes. É mais rápido que ``floor(sqrt(n))``, mas mais lento que :func:`math.sqrt`::

source: (Contributed by Mark Dickinson in :issue:`36887`.)
pt_br: (Contribuição de Mark Dickinson em :issue:`36887`.)

source: The function :func:`math.factorial` no longer accepts arguments that are not int-like. (Contributed by Pablo Galindo in :issue:`33083`.)
pt_br: A função :func:`math.factorial` não aceita mais argumentos que não são parecidos com int. (Contribuição de Pablo Galindo em :issue:`33083`.)

source: The :class:`mmap.mmap` class now has an :meth:`~mmap.mmap.madvise` method to access the ``madvise()`` system call. (Contributed by Zackery Spytz in :issue:`32941`.)
pt_br: A classe :class:`mmap.mmap` agora possui o método :meth:`~mmap.mmap.madvise` para acessar a chamada do sistema ``madvise()``. (Contribuição de Zackery Spytz em :issue:`32941`.)

source: Added new :mod:`multiprocessing.shared_memory` module. (Contributed by Davin Potts in :issue:`35813`.)
pt_br: Adicionado novo módulo :mod:`multiprocessing.shared_memory`. (Contribuição de Davin Potts em :issue:`35813`.)

source: On macOS, the *spawn* start method is now used by default. (Contributed by Victor Stinner in :issue:`33725`.)
pt_br: No macOS, o método inicial *spawn* agora é usado por padrão. (Contribuição de Victor Stinner em :issue:`33725`.)

source: Added new function :func:`~os.add_dll_directory` on Windows for providing additional search paths for native dependencies when importing extension modules or loading DLLs using :mod:`ctypes`. (Contributed by Steve Dower in :issue:`36085`.)
pt_br: Adicionada nova função :func:`~os.add_dll_directory` no Windows para fornecer caminhos de pesquisa adicionais para dependências nativas ao importar módulos de extensão ou carregar DLLs usando :mod:`ctypes`. (Contribuição de Steve Dower em :issue:`36085`.)

source: A new :func:`os.memfd_create` function was added to wrap the ``memfd_create()`` syscall. (Contributed by Zackery Spytz and Christian Heimes in :issue:`26836`.)
pt_br: Uma nova função :func:`os.memfd_create` foi adicionada para envolver a chamada de sistema ``memfd_create()``. (Contribuição de Zackery Spytz e Christian Heimes em :issue:`26836`.)

source: On Windows, much of the manual logic for handling reparse points (including symlinks and directory junctions) has been delegated to the operating system. Specifically, :func:`os.stat` will now traverse anything supported by the operating system, while :func:`os.lstat` will only open reparse points that identify as "name surrogates" while others are opened as for :func:`os.stat`. In all cases, :attr:`stat_result.st_mode` will only have ``S_IFLNK`` set for symbolic links and not other kinds of reparse points. To identify other kinds of reparse point, check the new :attr:`stat_result.st_reparse_tag` attribute.
pt_br: No Windows, grande parte da lógica manual para manipular pontos de nova análise (incluindo links simbólicos e junções de diretório) foi delegada ao sistema operacional. Especificamente, :func:`os.stat` agora percorrerá qualquer coisa suportada pelo sistema operacional, enquanto :func:`os.lstat` abrirá apenas pontos de nova análise que se identificam como "substitutos de nome" enquanto outros são abertos como :func:`os.stat`. Em todos os casos, :attr:`stat_result.st_mode` terá apenas ``S_IFLNK`` definido para links simbólicos e não para outros tipos de pontos de nova análise. Para identificar outros tipos de pontos de nova análise, verifique o novo atributo :attr:`stat_result.st_reparse_tag`.

source: On Windows, :func:`os.readlink` is now able to read directory junctions. Note that :func:`~os.path.islink` will return ``False`` for directory junctions, and so code that checks ``islink`` first will continue to treat junctions as directories, while code that handles errors from :func:`os.readlink` may now treat junctions as links.
pt_br: No Windows, :func:`os.readlink` agora pode ler junções de diretório. Observe que :func:`~os.path.islink` retornará ``False`` para junções de diretório e, portanto, o código que verifica primeiro ``islink`` continuará tratando junções como diretórios, enquanto o código que lida com erros de :func:`os.readlink` agora pode tratar junções como links.

source: (Contributed by Steve Dower in :issue:`37834`.)
pt_br: (Contribuição de Steve Dower em :issue:`37834`.)

source: :mod:`os.path` functions that return a boolean result like :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink`, and :func:`~os.path.ismount` now return ``False`` instead of raising :exc:`ValueError` or its subclasses :exc:`UnicodeEncodeError` and :exc:`UnicodeDecodeError` for paths that contain characters or bytes unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
pt_br: Funções de :mod:`os.path` que retornam um resultado booleano como :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink` e :func:`~os.path.ismount` agora retornam ``False`` em vez de levantar :exc:`ValueError` ou suas subclasses :exc:`UnicodeEncodeError` e :exc:`UnicodeDecodeError` para caminhos que contêm caracteres ou bytes não representáveis no nível do SO. (Contribuição de Serhiy Storchaka em :issue:`33721`.)

source: :func:`~os.path.expanduser` on Windows now prefers the :envvar:`USERPROFILE` environment variable and does not use :envvar:`HOME`, which is not normally set for regular user accounts. (Contributed by Anthony Sottile in :issue:`36264`.)
pt_br: :func:`~os.path.expanduser` no Windows agora prefere a variável de ambiente :envvar:`USERPROFILE` e não usa :envvar:`HOME`, que normalmente não é definido para contas de usuário comuns. (Contribuição de Anthony Sottile em :issue:`36264`.)

source: :func:`~os.path.isdir` on Windows no longer returns ``True`` for a link to a non-existent directory.
pt_br: :func:`~os.path.isdir` no Windows não retorna mais ``True`` para um link para um diretório inexistente.

source: :func:`~os.path.realpath` on Windows now resolves reparse points, including symlinks and directory junctions.
pt_br: :func:`~os.path.realpath` no Windows agora resolve pontos de nova análise, incluindo links simbólicos e junções de diretório.

source: :mod:`pickle` extensions subclassing the C-optimized :class:`~pickle.Pickler` can now override the pickling logic of functions and classes by defining the special :meth:`~pickle.Pickler.reducer_override` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
pt_br: Extensões de :mod:`pickle`, que atuem como subclasse da classe otimizada para C :class:`~pickle.Pickler`, agora podem substituir a lógica de "pickling" de funções e classes definindo o método especial :meth:`~pickle.Pickler.reducer_override`. (Contribuição de Pierre Glaser e Olivier Grisel em :issue:`35900`.)

source: Added new :class:`plistlib.UID` and enabled support for reading and writing NSKeyedArchiver-encoded binary plists. (Contributed by Jon Janzen in :issue:`26707`.)
pt_br: Adicionado novo :class:`plistlib.UID` e habilitado suporte para leitura e escrita de plists binárias codificadas em NSKeyedArchiver. (Contribuição de Jon Janzen em :issue:`26707`.)

source: The :mod:`pprint` module added a *sort_dicts* parameter to several functions. By default, those functions continue to sort dictionaries before rendering or printing. However, if *sort_dicts* is set to false, the dictionaries retain the order that keys were inserted. This can be useful for comparison to JSON inputs during debugging.
pt_br: O módulo :mod:`pprint` adicionou um parâmetro *sort_dicts* a várias funções. Por padrão, essas funções continuam a classificar dicionários antes da renderização ou impressão. No entanto, se *sort_dicts* estiver definido como false, os dicionários manterão a ordem em que as chaves foram inseridas. Isso pode ser útil para comparação com entradas JSON durante a depuração.

source: In addition, there is a convenience new function, :func:`pprint.pp` that is like :func:`pprint.pprint` but with *sort_dicts* defaulting to ``False``::
pt_br: Além disso, existe uma nova função de conveniência, :func:`pprint.pp`, que é como :func:`pprint.pprint`, mas com *sort_dicts* padronizando como ``False``::

source: (Contributed by Rémi Lapeyre in :issue:`30670`.)
pt_br: (Contribuição de Rémi Lapeyre em :issue:`30670`.)

source: :func:`py_compile.compile` now supports silent mode. (Contributed by Joannah Nanjekye in :issue:`22640`.)
pt_br: :func:`py_compile.compile` agora possui suporte a um modo silencioso. (Contribuição de Joannah Nanjekye em :issue:`22640`.)

source: The new :func:`shlex.join` function acts as the inverse of :func:`shlex.split`. (Contributed by Bo Bayles in :issue:`32102`.)
pt_br: A nova função :func:`shlex.join` atua como o inverso da :func:`shlex.split`. (Contribuição de Bo Bayles em :issue:`32102`.)

source: :func:`shutil.copytree` now accepts a new ``dirs_exist_ok`` keyword argument. (Contributed by Josh Bronson in :issue:`20849`.)
pt_br: :func:`shutil.copytree` agora aceita um novo argumento nomeado ``dirs_exist_ok``. (Contribuição de Josh Bronson em :issue:`20849`.)

source: :func:`shutil.make_archive` now defaults to the modern pax (POSIX.1-2001) format for new archives to improve portability and standards conformance, inherited from the corresponding change to the :mod:`tarfile` module. (Contributed by C.A.M. Gerlach in :issue:`30661`.)
pt_br: :func:`shutil.make_archive` agora tem como pádrão o formato pax moderno (POSIX.1-2001) de novos arquivos para melhorar a portabilidade e a conformidade com os padrões, herdados da alteração correspondente no módulo :mod:`tarfile`. (Contribuição de C.A.M. Gerlach em :issue:`30661`.)

source: :func:`shutil.rmtree` on Windows now removes directory junctions without recursively removing their contents first. (Contributed by Steve Dower in :issue:`37834`.)
pt_br: :func:`shutil.rmtree` no Windows agora remove junções de diretórios sem remover recursivamente o conteúdo primeiro. (Contribuição de Steve Dower em :issue:`37834`.)

source: Added :attr:`~ssl.SSLContext.post_handshake_auth` to enable and :meth:`~ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :issue:`34670`.)
pt_br: Adicionado :attr:`~ssl.SSLContext.post_handshake_auth` para ativar e :meth:`~ssl.SSLSocket.verify_client_post_handshake` para iniciar a autenticação pós-handshake do TLS 1.3. (Contribuição de Christian Heimes em :issue:`34670`.)

source: Added :func:`statistics.multimode` that returns a list of the most common values. (Contributed by Raymond Hettinger in :issue:`35892`.)
pt_br: Adicionada :func:`Statistics.multimode` que retorna uma lista dos valores mais comuns. (Contribuição de Raymond Hettinger em :issue:`35892`.)

source: Added :func:`statistics.quantiles` that divides data or a distribution in to equiprobable intervals (e.g. quartiles, deciles, or percentiles). (Contributed by Raymond Hettinger in :issue:`36546`.)
pt_br: Adicionada :func:`statistics.quantiles` que divide dados ou uma distribuição em intervalos equivalentes (por exemplo, quartis, decis ou percentis). (Contribuição de Raymond Hettinger em :issue:`36546`.)

source: Added :class:`statistics.NormalDist`, a tool for creating and manipulating normal distributions of a random variable. (Contributed by Raymond Hettinger in :issue:`36018`.)
pt_br: Adicionada :class:`statistics.NormalDist`, uma ferramenta para criar e manipular distribuições normais de uma variável aleatória. (Contribuição de Raymond Hettinger em :issue:`36018`.)

source: Add new :func:`sys.unraisablehook` function which can be overridden to control how "unraisable exceptions" are handled. It is called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`). (Contributed by Victor Stinner in :issue:`36829`.)
pt_br: Adiciona uma nova função :func:`sys.unraisablehook`, que pode ser substituída para controlar como as "exceções não passíveis de levantamento" são tratadas. É chamada quando uma exceção ocorre, mas não há como o Python manipulá-la. Por exemplo, quando um destruidor gera uma exceção ou durante a coleta de lixo (:func:`gc.collect`). (Contribuição de Victor Stinner em :issue:`36829`.)

source: The :mod:`tarfile` module now defaults to the modern pax (POSIX.1-2001) format for new archives, instead of the previous GNU-specific one. This improves cross-platform portability with a consistent encoding (UTF-8) in a standardized and extensible format, and offers several other benefits. (Contributed by C.A.M. Gerlach in :issue:`36268`.)
pt_br: O módulo :mod:`tarfile` agora tem como padrão o formato pax moderno (POSIX.1-2001) para novos arquivos, em vez do anterior específico do GNU. Isso melhora a portabilidade de plataforma cruzada com uma codificação consistente (UTF-8) em um formato padronizado e extensível e oferece vários outros benefícios. (Contribuição de C.A.M. Gerlach em :issue:`36268`.)

source: Add a new :func:`threading.excepthook` function which handles uncaught :meth:`threading.Thread.run` exception. It can be overridden to control how uncaught :meth:`threading.Thread.run` exceptions are handled. (Contributed by Victor Stinner in :issue:`1230540`.)
pt_br: Adiciona uma nova função :func:`threading.excepthook` que manipula a exceção não capturada :meth:`threading.Thread.run`. Pode ser substituída para controlar como exceções não capturadas :meth:`threading.Thread.run` são manipuladas. (Contribuição de Victor Stinner em :issue:`1230540`.)

source: Add a new :func:`threading.get_native_id` function and a :data:`~threading.Thread.native_id` attribute to the :class:`threading.Thread` class. These return the native integral Thread ID of the current thread assigned by the kernel. This feature is only available on certain platforms, see :func:`get_native_id <threading.get_native_id>` for more information. (Contributed by Jake Tesler in :issue:`36084`.)
pt_br: Adiciona uma nova função :func:`threading.get_native_id` e um atributo :data:`~threading.Thread.native_id` à classe :class:`threading.Thread`. Eles retornam o Thread ID integral nativo do thread atual atribuído pelo kernel. Este recurso está disponível apenas em determinadas plataformas, consulte :func:`get_native_id <threading.get_native_id>` para mais informações. (Contribuição de Jake Tesler em :issue:`36084`.)

source: The :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
pt_br: O módulo :mod:`tokenize` agora emite implicitamente um token ``NEWLINE`` quando fornecido com entrada que não possui uma nova linha à direita. Esse comportamento agora corresponde ao que o tokenizador do C faz internamente. (Contribuição de Ammar Askar em :issue:`33899`.)

source: Added methods :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` and :meth:`~tkinter.Spinbox.selection_to` in the :class:`tkinter.Spinbox` class. (Contributed by Juliette Monsel in :issue:`34829`.)
pt_br: Adicionados os métodos :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` e :meth:`~tkinter.Spinbox.selection_to` à classe :class:`tkinter.Spinbox`. (Contribuição de Juliette Monsel em :issue:`34829`.)

source: Added method :meth:`~tkinter.Canvas.moveto` in the :class:`tkinter.Canvas` class. (Contributed by Juliette Monsel in :issue:`23831`.)
pt_br: Adicionado o método :meth:`~tkinter.Canvas.moveto` na classe :class:`tkinter.Canvas`. (Contribuição de Juliette Monsel em :issue:`23831`.)

source: The :class:`tkinter.PhotoImage` class now has :meth:`~tkinter.PhotoImage.transparency_get` and :meth:`~tkinter.PhotoImage.transparency_set` methods. (Contributed by Zackery Spytz in :issue:`25451`.)
pt_br: A classe :class:`tkinter.PhotoImage` agore tem os métodos :meth:`~tkinter.PhotoImage.transparency_get` e :meth:`~tkinter.PhotoImage.transparency_set`. (Contribuição de Zackery Spytz em :issue:`25451`.)
