Repository: python/python-docs-pt-br
Catalog: whatsnew/3.9.po
Languages: pt_br

source: Exposed the Linux-specific :func:`signal.pidfd_send_signal` for sending to signals to a process using a file descriptor instead of a pid. (:issue:`38712`)
pt_br: Exposta a :func:`signal.pidfd_send_signal` específica do Linux para enviar sinais a um processo usando um descritor de arquivo em vez de um pid. (:issue:`38712`)

source: :class:`~smtplib.SMTP` and :class:`~smtplib.SMTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
pt_br: :class:`~smtplib.SMTP` e :class:`~smtplib.SMTP_SSL` agora levantam uma :class:`ValueError` se o tempo limite especificado para seu construtor for zero para impedir a criação de um soquete sem bloqueio. (Contribuição de Dong-hee Na em :issue:`39259`.)

source: :class:`~smtplib.LMTP` constructor now has an optional *timeout* parameter. (Contributed by Donghee Na in :issue:`39329`.)
pt_br: O construtor de :class:`~smtplib.LMTP` agora tem um parâmetro opcional *timeout*. (Contribuição de Dong-hee Na em :issue:`39329`.)

source: The :mod:`socket` module now exports the :const:`~socket.CAN_RAW_JOIN_FILTERS` constant on Linux 4.1 and greater. (Contributed by Stefan Tatschner and Zackery Spytz in :issue:`25780`.)
pt_br: O módulo :mod:`socket` agora exporta a constante :const:`~socket.CAN_RAW_JOIN_FILTERS` no Linux 4.1 e superior. (Contribuição de Stefan Tatschner e Zackery Spytz em :issue:`25780`.)

source: The socket module now supports the :const:`~socket.CAN_J1939` protocol on platforms that support it. (Contributed by Karl Ding in :issue:`40291`.)
pt_br: O módulo socket agora suporta o protocolo :const:`~socket.CAN_J1939` nas plataformas que o suportam. (Contribuição de Karl Ding em :issue:`40291`.)

source: The socket module now has the :func:`socket.send_fds` and :func:`socket.recv_fds` functions. (Contributed by Joannah Nanjekye, Shinya Okano and Victor Stinner in :issue:`28724`.)
pt_br: O módulo socket agora tem as funções :func:`socket.send_fds` e :func:`socket.recv_fds`. (Contribuição de Joannah Nanjekye, Shinya Okano e Victor Stinner em :issue:`28724`.)

source: On AIX, :func:`~time.thread_time` is now implemented with ``thread_cputime()`` which has nanosecond resolution, rather than ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` which has a resolution of 10 milliseconds. (Contributed by Batuhan Taskaya in :issue:`40192`)
pt_br: No AIX, :func:`~time.thread_time` agora é implementado com ``thread_cputime()`` que possui resolução de nanossegundos, em vez de ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)``, que tem uma resolução de 10 milissegundos. (Contribuição de Batuhan Taskaya em :issue:`40192`)

source: Added a new :data:`sys.platlibdir` attribute: name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules. It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
pt_br: Adicionado um novo atributo :data:`sys.platlibdir`: nome do diretório da biblioteca específica da plataforma. É usado para construir o caminho da biblioteca padrão e os caminhos dos módulos de extensão instalados. É igual a ``"lib"`` na maioria das plataformas. No Fedora e SuSE, é igual a ``"lib64"`` nas plataformas de 64 bits. (Contribuição de Jan Matějek, Matěj Cepl, Charalampos Stratakis e Victor Stinner em :issue:`1294959`.)

source: Previously, :data:`sys.stderr` was block-buffered when non-interactive. Now ``stderr`` defaults to always being line-buffered. (Contributed by Jendrik Seipp in :issue:`13601`.)
pt_br: Anteriormente, :data:`sys.stderr` era armazenado em buffer quando não interativo. Agora, ``stderr`` assume como padrão sempre o buffer de linha. (Contribuição de Jendrik Seipp em :issue:`13601`.)

source: Added :func:`tracemalloc.reset_peak` to set the peak size of traced memory blocks to the current size, to measure the peak of specific pieces of code. (Contributed by Huon Wilson in :issue:`40630`.)
pt_br: Adicionada :func:`tracemalloc.reset_peak` para definir o tamanho do pico dos blocos de memória rastreados para o tamanho atual, para medir o pico de partes específicas do código. (Contribuição de Huon Wilson em :issue:`40630`.)

source: :pep:`593` introduced an :data:`typing.Annotated` type to decorate existing types with context-specific metadata and new ``include_extras`` parameter to :func:`typing.get_type_hints` to access the metadata at runtime. (Contributed by Till Varoquaux and Konstantin Kashin.)
pt_br: :pep:`593` introduziu um tipo :data:`typing.Annotated` para decorar tipos existentes com metadados específicos de contexto e o novo parâmetro ``include_extras`` para :func:`typing.get_type_hints` para acessar os metadados em tempo de execução. (Contribuição de Till Varoquaux e Konstantin Kashin.)

source: The Unicode database has been updated to version 13.0.0. (:issue:`39926`).
pt_br: O banco de dados Unicode foi atualizado para a versão 13.0.0. (:issue:`39926`).

source: The activation scripts provided by :mod:`venv` now all specify their prompt customization consistently by always using the value specified by ``__VENV_PROMPT__``. Previously some scripts unconditionally used ``__VENV_PROMPT__``, others only if it happened to be set (which was the default case), and one used ``__VENV_NAME__`` instead. (Contributed by Brett Cannon in :issue:`37663`.)
pt_br: Os scripts de ativação fornecidos por :mod:`venv` agora especificam sua personalização de prompt de forma consistente, sempre usando o valor especificado por ``__VENV_PROMPT__``. Anteriormente, alguns scripts usavam incondicionalmente ``__VENV_PROMPT__``, outros apenas se fosse definido (que era o caso padrão) e um usava ``__VENV_NAME__``. (Contribuição de Brett Cannon em :issue:`37663`.)

source: White space characters within attributes are now preserved when serializing :mod:`xml.etree.ElementTree` to XML file. EOLNs are no longer normalized to "\n". This is the result of discussion about how to interpret section 2.11 of XML spec. (Contributed by Mefistotelis in :issue:`39011`.)
pt_br: Os caracteres de espaço em branco nos atributos agora são preservados ao serializar :mod:`xml.etree.ElementTree` para o arquivo XML. EOLNs não são mais normalizados para "\n". Este é o resultado da discussão sobre como interpretar a seção 2.11 da especificação XML. (Contribuição de Mefistotelis em :issue:`39011`.)

source: Optimizations
pt_br: Otimizações

source: Optimized the idiom for assignment a temporary variable in comprehensions. Now ``for y in [expr]`` in comprehensions is as fast as a simple assignment ``y = expr``. For example:
pt_br: Otimizado o idioma para atribuição de uma variável temporária nas compreensões. Agora ``for y in [expr]`` nas compreensões é tão rápido quanto uma atribuição simples ``y = expr``. Por exemplo:

source: Unlike the ``:=`` operator this idiom does not leak a variable to the outer scope.
pt_br: Ao contrário do operador ``:=``, este idioma não vaza uma variável para o escopo externo.

source: (Contributed by Serhiy Storchaka in :issue:`32856`.)
pt_br: (Contribuição de Serhiy Storchaka em :issue:`32856`.)

source: Optimized signal handling in multithreaded applications. If a thread different than the main thread gets a signal, the bytecode evaluation loop is no longer interrupted at each bytecode instruction to check for pending signals which cannot be handled. Only the main thread of the main interpreter can handle signals.
pt_br: Otimizada a manipulação de sinais em aplicações multithread. Se uma thread diferente da thread principal obtiver um sinal, o loop de avaliação do bytecode não será mais interrompido a cada instrução de bytecode para verificar se há sinais pendentes que não podem ser manipulados. Somente o segmento principal do interpretador principal pode manipular sinais.

source: Previously, the bytecode evaluation loop was interrupted at each instruction until the main thread handles signals. (Contributed by Victor Stinner in :issue:`40010`.)
pt_br: Anteriormente, o loop de avaliação do bytecode era interrompido em cada instrução até que a thread principal lidasse com os sinais. (Contribuição de Victor Stinner em :issue:`40010`.)

source: Optimized the :mod:`subprocess` module on FreeBSD using ``closefrom()``. (Contributed by Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak and Victor Stinner in :issue:`38061`.)
pt_br: Otimizado o módulo :mod:`subprocess` no FreeBSD usando ``closefrom()``. (Contribuição de Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak e Victor Stinner em :issue:`38061`.)

source: :c:func:`PyLong_FromDouble` is now up to 1.87x faster for values that fit into :c:expr:`long`. (Contributed by Sergey Fedoseev in :issue:`37986`.)
pt_br: :c:func:`PyLong_FromDouble` está agora até 1.87x mais rápido para valores que cabem em um :c:expr:`long`. (Contribuição de Sergey Fedoseev em :issue:`37986`.)

source: A number of Python builtins (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) are now sped up by using :pep:`590` vectorcall protocol. (Contributed by Donghee Na, Mark Shannon, Jeroen Demeyer and Petr Viktorin in :issue:`37207`.)
pt_br: Vários componentes embutidos do Python (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) agora são acelerados usando o protocolo vectorcall da :pep:`590`. (Contribuição de Donghee Na, Mark Shannon, Jeroen Demeyer e Petr Viktorin em :issue:`37207`.)

source: Optimized :meth:`!set.difference_update` for the case when the other set is much larger than the base set. (Suggested by Evgeny Kapun with code contributed by Michele Orrù in :issue:`8425`.)
pt_br: Otimizada a :meth:`!set.difference_update` para o caso em que o outro conjunto é muito maior do que o conjunto base. (Sugestão de Evgeny Kapun com contribuição de código de Michele Orrù em :issue:`8425`.)

source: Python's small object allocator (``obmalloc.c``) now allows (no more than) one empty arena to remain available for immediate reuse, without returning it to the OS. This prevents thrashing in simple loops where an arena could be created and destroyed anew on each iteration. (Contributed by Tim Peters in :issue:`37257`.)
pt_br: O alocador de pequenos objetos do Python (``obmalloc.c``) agora permite (não mais que) uma arena vazia para permanecer disponível para reutilização imediata, sem retorná-la ao sistema operacional. Isso evita o desperdiçar loops simples, onde uma arena pode ser criada e destruída novamente em cada iteração. (Contribuição de Tim Peters em :issue:`37257`.)

source: :term:`floor division` of float operation now has a better performance. Also the message of :exc:`ZeroDivisionError` for this operation is updated. (Contributed by Donghee Na in :issue:`39434`.)
pt_br: :term:`divisão pelo piso <floor division>` de operação flutuante agora tem um melhor desempenho. Além disso, a mensagem de :exc:`ZeroDivisionError` para esta operação foi atualizada. (Contribuição de Donghee Na em :issue:`39434`.)

source: Decoding short ASCII strings with UTF-8 and ascii codecs is now about 15% faster. (Contributed by Inada Naoki in :issue:`37348`.)
pt_br: A decodificação de strings curtas ASCII com codecs UTF-8 e ascii é agora cerca de 15% mais rápida. (Contribuição de Inada Naoki em :issue:`37348`.)

source: Here's a summary of performance improvements from Python 3.4 through Python 3.9:
pt_br: Aqui está um resumo das melhorias de desempenho do Python 3.4 ao Python 3.9:

source: Python version 3.4 3.5 3.6 3.7 3.8 3.9 -------------- --- --- --- --- --- --- Variable and attribute read access: read_local 7.1 7.1 5.4 5.1 3.9 3.9 read_nonlocal 7.1 8.1 5.8 5.4 4.4 4.5 read_global 15.5 19.0 14.3 13.6 7.6 7.8 read_builtin 21.1 21.6 18.5 19.0 7.5 7.8 read_classvar_from_class 25.6 26.5 20.7 19.5 18.4 17.9 read_classvar_from_instance 22.8 23.5 18.8 17.1 16.4 16.9 read_instancevar 32.4 33.1 28.0 26.3 25.4 25.3 read_instancevar_slots 27.8 31.3 20.8 20.8 20.2 20.5 read_namedtuple 73.8 57.5 45.0 46.8 18.4 18.7 read_boundmethod 37.6 37.9 29.6 26.9 27.7 41.1 Variable and attribute write access: write_local 8.7 9.3 5.5 5.3 4.3 4.3 write_nonlocal 10.5 11.1 5.6 5.5 4.7 4.8 write_global 19.7 21.2 18.0 18.0 15.8 16.7 write_classvar 92.9 96.0 104.6 102.1 39.2 39.8 write_instancevar 44.6 45.8 40.0 38.9 35.5 37.4 write_instancevar_slots 35.6 36.1 27.3 26.6 25.7 25.8 Data structure read access: read_list 24.2 24.5 20.8 20.8 19.0 19.5 read_deque 24.7 25.5 20.2 20.6 19.8 20.2 read_dict 24.3 25.7 22.3 23.0 21.0 22.4 read_strdict 22.6 24.3 19.5 21.2 18.9 21.5 Data structure write access: write_list 27.1 28.5 22.5 21.6 20.0 20.0 write_deque 28.7 30.1 22.7 21.8 23.5 21.7 write_dict 31.4 33.3 29.3 29.2 24.7 25.4 write_strdict 28.4 29.9 27.5 25.2 23.1 24.5 Stack (or queue) operations: list_append_pop 93.4 112.7 75.4 74.2 50.8 50.6 deque_append_pop 43.5 57.0 49.4 49.2 42.5 44.2 deque_append_popleft 43.7 57.3 49.7 49.7 42.8 46.4 Timing loop: loop_overhead 0.5 0.6 0.4 0.3 0.3 0.3
pt_br: Versão do Python 3.4 3.5 3.6 3.7 3.8 3.9 -------------- --- --- --- --- --- --- Acesso de leitura a variável e atributo: read_local 7.1 7.1 5.4 5.1 3.9 3.9 read_nonlocal 7.1 8.1 5.8 5.4 4.4 4.5 read_global 15.5 19.0 14.3 13.6 7.6 7.8 read_builtin 21.1 21.6 18.5 19.0 7.5 7.8 read_classvar_from_class 25.6 26.5 20.7 19.5 18.4 17.9 read_classvar_from_instance 22.8 23.5 18.8 17.1 16.4 16.9 read_instancevar 32.4 33.1 28.0 26.3 25.4 25.3 read_instancevar_slots 27.8 31.3 20.8 20.8 20.2 20.5 read_namedtuple 73.8 57.5 45.0 46.8 18.4 18.7 read_boundmethod 37.6 37.9 29.6 26.9 27.7 41.1 Acesso de escrita a variável e atributo: write_local 8.7 9.3 5.5 5.3 4.3 4.3 write_nonlocal 10.5 11.1 5.6 5.5 4.7 4.8 write_global 19.7 21.2 18.0 18.0 15.8 16.7 write_classvar 92.9 96.0 104.6 102.1 39.2 39.8 write_instancevar 44.6 45.8 40.0 38.9 35.5 37.4 write_instancevar_slots 35.6 36.1 27.3 26.6 25.7 25.8 Acesso de leitura a estrutura de dados: read_list 24.2 24.5 20.8 20.8 19.0 19.5 read_deque 24.7 25.5 20.2 20.6 19.8 20.2 read_dict 24.3 25.7 22.3 23.0 21.0 22.4 read_strdict 22.6 24.3 19.5 21.2 18.9 21.5 Acesso de escrita a estrutura de dados: write_list 27.1 28.5 22.5 21.6 20.0 20.0 write_deque 28.7 30.1 22.7 21.8 23.5 21.7 write_dict 31.4 33.3 29.3 29.2 24.7 25.4 write_strdict 28.4 29.9 27.5 25.2 23.1 24.5 Operações em pilha (ou fila): list_append_pop 93.4 112.7 75.4 74.2 50.8 50.6 deque_append_pop 43.5 57.0 49.4 49.2 42.5 44.2 deque_append_popleft 43.7 57.3 49.7 49.7 42.8 46.4 Tempo de laços: loop_overhead 0.5 0.6 0.4 0.3 0.3 0.3

source: These results were generated from the variable access benchmark script at: ``Tools/scripts/var_access_benchmark.py``. The benchmark script displays timings in nanoseconds. The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/macos/>`_.
pt_br: Estes resultados foram gerados a partir do script de benchmark de acesso variável em: ``Tools/scripts/var_access_benchmark.py``. O script de benchmark exibe tempos em nanossegundos. Os benchmarks foram medidos em um processador `Intel® Core ™ i7-4960HQ <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ executando as compilações do macOS de 64 bits encontradas em `python.org <https://www.python.org/downloads/macos/>`_.

source: Deprecated
pt_br: Descontinuados

source: The distutils ``bdist_msi`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`39586`.)
pt_br: O comando ``bdist_msi`` do distutils está agora descontinuado, use ``bdist_wheel`` (pacotes wheel). (Contribuição de Hugo van Kemenade em :issue:`39586`.)

source: Currently :func:`math.factorial` accepts :class:`float` instances with non-negative integer values (like ``5.0``). It raises a :exc:`ValueError` for non-integral and negative floats. It is now deprecated. In future Python versions it will raise a :exc:`TypeError` for all floats. (Contributed by Serhiy Storchaka in :issue:`37315`.)
pt_br: Atualmente :func:`math.factorial` aceita instâncias da :class:`float` com valores inteiros não negativos (como ``5.0``). Ela levanta uma :exc:`ValueError` para flutuadores não integrais e negativos. Agora está descontinuado. Nas versões futuras do Python, será levantada uma :exc:`TypeError` para todos os flutuadores. (Contribuição de Serhiy Storchaka em :issue:`37315`.)

source: The :mod:`!parser` and :mod:`!symbol` modules are deprecated and will be removed in future versions of Python. For the majority of use cases, users can leverage the Abstract Syntax Tree (AST) generation and compilation stage, using the :mod:`ast` module.
pt_br: Os módulos :mod:`!parser` e :mod:`!symbol` foram descontinuados e serão removidos em versões futuras do Python. Para a maioria dos casos de uso, os usuários podem aproveitar o estágio de geração e compilação da Árvore de Sintaxe Abstrata (AST), usando o módulo :mod:`ast`.

source: The Public C API functions :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` and :c:func:`!PyNode_Compile` are deprecated and will be removed in Python 3.10 together with the old parser.
pt_br: As funções públicas de API C :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` e :c:func:`!PyNode_Compile` foram descontinuados e serão removidos no Python 3.10 junto com o analisador sintático antigo.

source: Using :data:`NotImplemented` in a boolean context has been deprecated, as it is almost exclusively the result of incorrect rich comparator implementations. It will be made a :exc:`TypeError` in a future version of Python. (Contributed by Josh Rosenberg in :issue:`35712`.)
pt_br: O uso de :data:`NotImplemented` em um contexto booleano foi descontinuado, pois é quase exclusivamente o resultado de implementações incorretas de comparadores avançados. Isso será tornado em uma :exc:`TypeError` em uma versão futura do Python. (Contribuição de Josh Rosenberg em :issue:`35712`.)

source: The :mod:`random` module currently accepts any hashable type as a possible seed value. Unfortunately, some of those types are not guaranteed to have a deterministic hash value. After Python 3.9, the module will restrict its seeds to :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, and :class:`bytearray`.
pt_br: O módulo :mod:`random` atualmente aceita qualquer tipo hasheável como um possível valor inicial. Infelizmente, alguns desses tipos não têm garantia de ter um valor de hash determinístico. Após o Python 3.9, o módulo restringirá suas sementes a :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` e :class:`bytearray`.

source: Opening the :class:`~gzip.GzipFile` file for writing without specifying the *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* argument for opening it for writing and silencing a warning. (Contributed by Serhiy Storchaka in :issue:`28286`.)
pt_br: A abertura do arquivo :class:`~gzip.GzipFile` para escrita sem especificar o argumento *mode* foi descontinuado. Nas versões futuras do Python, ele sempre será aberto para leitura por padrão. Especifique o argumento *mode* para abri-lo para escrever e silenciar um aviso. (Contribuição de Serhiy Storchaka em :issue:`28286`.)

source: Deprecated the ``split()`` method of :class:`!_tkinter.TkappType` in favour of the ``splitlist()`` method which has more consistent and predictable behavior. (Contributed by Serhiy Storchaka in :issue:`38371`.)
pt_br: Descontinuado o método ``split()`` de :class:`!_tkinter.TkappType` a favor do método ``splitlist()`` que possui um comportamento mais consistente e previsível. (Contribuição de Serhiy Storchaka em :issue:`38371`.)

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov and Kyle Stanley in :issue:`34790`.)
pt_br: A passagem explícita dos objetos da corrotina para :func:`asyncio.wait` foi descontinuada e será removida na versão 3.11. (Contribuição de Yury Selivanov e Kyle Stanley em :issue:`34790`.)

source: binhex4 and hexbin4 standards are now deprecated. The :mod:`!binhex` module and the following :mod:`binascii` functions are now deprecated:
pt_br: Os padrões binhex4 e hexbin4 agora foram descontinuados. O módulo :mod:`!binhex` e as seguintes funções :mod:`binascii` foram descontinuadas:

source: (Contributed by Victor Stinner in :issue:`39353`.)
pt_br: (Contribuição de Victor Stinner em :issue:`39353`.)

source: :mod:`ast` classes ``slice``, ``Index`` and ``ExtSlice`` are considered deprecated and will be removed in future Python versions. ``value`` itself should be used instead of ``Index(value)``. ``Tuple(slices, Load())`` should be used instead of ``ExtSlice(slices)``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
pt_br: As classes ``slice``, ``Index`` e ``ExtSlice`` de :mod:`ast` são consideradas descontinuadas e serão removidas nas versões futuras do Python. O próprio ``value`` deve ser usado em vez de ``Index(value)``. ``Tuple(slices, Load())`` deve ser usada em vez de ``ExtSlice(slices)``. (Contribuição de Serhiy Storchaka em :issue:`34822`.)

source: :mod:`ast` classes ``Suite``, ``Param``, ``AugLoad`` and ``AugStore`` are considered deprecated and will be removed in future Python versions. They were not generated by the parser and not accepted by the code generator in Python 3. (Contributed by Batuhan Taskaya in :issue:`39639` and :issue:`39969` and Serhiy Storchaka in :issue:`39988`.)
pt_br: As classes ``Suite``, ``Param``, ``AugLoad`` e ``AugStore`` de :mod:`ast` são consideradas descontinuadas e serão removidas nas versões futuras do Python. Elas não foram geradas pelo analisador sintático e não foram aceitos pelo gerador de código no Python 3. (Contribuição de Batuhan Taskaya em :issue:`39639` e :issue:`39969` e Serhiy Storchaka em :issue:`39988`.)

source: The :c:func:`!PyEval_InitThreads` and :c:func:`!PyEval_ThreadsInitialized` functions are now deprecated and will be removed in Python 3.11. Calling :c:func:`!PyEval_InitThreads` now does nothing. The :term:`GIL` is initialized by :c:func:`Py_Initialize` since Python 3.7. (Contributed by Victor Stinner in :issue:`39877`.)
pt_br: As funções :c:func:`!PyEval_InitThreads` e :c:func:`!PyEval_ThreadsInitialized` agora estão descontinuadas e serão removidas no Python 3.11. Chamar :c:func:`!PyEval_InitThreads` agora não faz nada. A :term:`GIL` é inicializada por :c:func:`Py_Initialize` desde o Python 3.7. (Contribuição de Victor Stinner em :issue:`39877`.)

source: Passing ``None`` as the first argument to the :func:`shlex.split` function has been deprecated. (Contributed by Zackery Spytz in :issue:`33262`.)
pt_br: Passar ``None`` como o primeiro argumento para a função :func:`shlex.split` foi descontinuada. (Contribuição de Zackery Spytz em :issue:`33262`.)

source: :func:`!smtpd.MailmanProxy` is now deprecated as it is unusable without an external module, ``mailman``. (Contributed by Samuel Colvin in :issue:`35800`.)
pt_br: :func:`!smtpd.MailmanProxy` está agora descontinuado, pois está inutilizável sem um módulo externo, ``mailman``. (Contribuição de Samuel Colvin em :issue:`35800`.)
