Repository: python/python-docs-pt-br
Catalog: whatsnew/3.9.po
Languages: pt_br

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
pt_br: As funções ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` e ``PyEval_CallObjectWithKeywords`` foram descontinuadas. Use :c:func:`PyObject_Call` e suas variantes. (Veja mais detalhes em :issue:`29548`.)

source: CPython bytecode changes
pt_br: Alterações de bytecode do CPython

source: The :opcode:`!LOAD_ASSERTION_ERROR` opcode was added for handling the :keyword:`assert` statement. Previously, the assert statement would not work correctly if the :exc:`AssertionError` exception was being shadowed. (Contributed by Zackery Spytz in :issue:`34880`.)
pt_br: O opcode :opcode:`!LOAD_ASSERTION_ERROR` foi adicionado para tratar a instrução :keyword:`assert`. Anteriormente, a instrução assert não funcionava corretamente se a exceção :exc:`AssertionError` estivesse sendo ocultada. (Contribuição de Zackery Spytz em :issue:`34880`.)

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
pt_br: O código de operação :opcode:`COMPARE_OP` foi dividido em quatro instruções distintas:

source: ``COMPARE_OP`` for rich comparisons
pt_br: ``COMPARE_OP`` para comparações ricas

source: ``IS_OP`` for 'is' and 'is not' tests
pt_br: ``IS_OP`` para testes "is" e "is not"

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
pt_br: ``CONTAINS_OP`` para testes "in" e "not in"

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
pt_br: ``JUMP_IF_NOT_EXC_MATCH`` para verificar exceções em instruções "try-except".

source: (Contributed by Mark Shannon in :issue:`39156`.)
pt_br: (Contribuição de Mark Shannon em :issue:`39156`.)

source: Build Changes
pt_br: Mudanças na construção

source: Added ``--with-platlibdir`` option to the ``configure`` script: name of the platform-specific library directory, stored in the new :data:`sys.platlibdir` attribute. See :data:`sys.platlibdir` attribute for more information. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
pt_br: Adicionada a opção ``--with-platlibdir`` ao script ``configure``: nome do diretório de biblioteca específico da plataforma, armazenado no novo atributo :data:`sys.platlibdir`. Veja o atributo :data:`sys.platlibdir` para mais informações. (Contribuição de Jan Matějek, Matěj Cepl, Charalampos Stratakis e Victor Stinner em :issue:`1294959`.)

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
pt_br: A macro especial de construção ``COUNT_ALLOCS`` foi removida. (Contribuição de Victor Stinner em :issue:`39489`.)

source: On non-Windows platforms, the :c:func:`!setenv` and :c:func:`!unsetenv` functions are now required to build Python. (Contributed by Victor Stinner in :issue:`39395`.)
pt_br: Em plataformas não Windows, as funções :c:func:`!setenv` e :c:func:`!unsetenv` agora são necessárias para construir o Python. (Contribuição de Victor Stinner em :issue:`39395`.)

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
pt_br: Em plataformas não-Windows, a criação de instaladores ``bdist_wininst`` não possui mais suporte oficial. (Veja :issue:`10945` para mais detalhes.)

source: When building Python on macOS from source, ``_tkinter`` now links with non-system Tcl and Tk frameworks if they are installed in ``/Library/Frameworks``, as had been the case on older releases of macOS. If a macOS SDK is explicitly configured, by using :option:`--enable-universalsdk` or ``-isysroot``, only the SDK itself is searched. The default behavior can still be overridden with ``--with-tcltk-includes`` and ``--with-tcltk-libs``. (Contributed by Ned Deily in :issue:`34956`.)
pt_br: Ao compilar Python no macOS a partir do código-fonte, ``_tkinter`` agora se vincula a frameworks Tcl e Tk não pertencentes ao sistema se eles estiverem instalados em ``/Library/Frameworks``, como era o caso em versões mais antigas do macOS. Se um macOS SDK for explicitamente configurado, usando :option:`--enable-universalsdk` ou ``-isysroot``, somente o SDK em si será procurado. Esse comportamento padrão pode ser sobreposto com ``--with-tcltk-include`` e ``--with-tcltk-libs``. (Contribuição de Ned Deily em :issue:`34956`.)

source: Python can now be built for Windows 10 ARM64. (Contributed by Steve Dower in :issue:`33125`.)
pt_br: Python pode agora ser construído para Windows 10 ARM64. (Contribuição de Steve Dower em :issue:`33125`.)

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
pt_br: Alguns testes individuais agora são ignorados quando ``--pgo`` é usada. Os testes em questão aumentaram significativamente o tempo da tarefa de PGO e provavelmente não ajudaram a melhorar a otimização do executável final. Isso acelera a tarefa por um fator de cerca de 15x. A execução de todo o conjunto de testes de unidade é lenta. Esta mudança pode resultar em uma construção um pouco menos otimizada, uma vez que nem tantos ramos de código serão executados. Se você estiver disposto a esperar por uma construção muito mais lenta, o comportamento antigo pode ser restaurado usando ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. Não oferecemos garantia de qual conjunto de tarefas de PGO produz uma construção mais rápida. Os usuários que se importam devem executar seus próprios benchmarks relevantes, pois os resultados podem depender do ambiente, da carga de trabalho e da cadeia de ferramentas do compilador. (Veja :issue:`36044` e :issue:`37707` para mais detalhes.)

source: C API Changes
pt_br: Alterações na API C

source: :pep:`573`: Added :c:func:`PyType_FromModuleAndSpec` to associate a module with a class; :c:func:`PyType_GetModule` and :c:func:`PyType_GetModuleState` to retrieve the module and its state; and :c:type:`PyCMethod` and :c:macro:`METH_METHOD` to allow a method to access the class it was defined in. (Contributed by Marcel Plch and Petr Viktorin in :issue:`38787`.)
pt_br: :pep:`573`: Adicionada :c:func:`PyType_FromModuleAndSpec` para associar um módulo a uma classe; :c:func:`PyType_GetModule` e :c:func:`PyType_GetModuleState` para obter o módulo e seu estado; e :c:type:`PyCMethod` e :c:macro:`METH_METHOD` para permitir que um método acesse a classe na qual ela foi definida. (Contribuição de Marcel Plch e Petr Viktorin em :issue:`38787`.)

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
pt_br: Adicionada a função :c:func:`PyFrame_GetCode`: obtém um código de quadro. Adiciona a função :c:func:`PyFrame_GetBack`: obtém o próximo quadro externo. (Contribuição de Victor Stinner em :issue:`40421`.)

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
pt_br: Adicionada :c:func:`PyFrame_GetLineNumber` à API C limitada. (Contribuição de Victor Stinner em :issue:`40421`.)

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
pt_br: Adicionada as funções :c:func:`PyThreadState_GetInterpreter` e :c:func:`PyInterpreterState_Get` para obter o interpretador. Adiciona a função :c:func:`PyThreadState_GetFrame` para obter o quadro atual de um estado de thread do Python. Adiciona a função :c:func:`PyThreadState_GetID`: obtém o identificador único de um estado de thread do Python. (Contribuição de Victor Stinner em :issue:`39947`.)

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
pt_br: Adicionada uma nova função pública :c:func:`PyObject_CallNoArgs` à API C, que chama um objeto chamável Python sem nenhum argumento. É a maneira mais eficiente de chamar um objeto chamável Python sem nenhum argumento. (Contribuição de Victor Stinner em :issue:`37194`.)

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
pt_br: Alterações na API C limitada (se a macro ``Py_LIMITED_API`` estiver definida):

source: Provide :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` as regular functions for the limited API. Previously, there were defined as macros, but these macros didn't compile with the limited C API which cannot access ``PyThreadState.recursion_depth`` field (the structure is opaque in the limited C API).
pt_br: Fornece :c:func:`Py_EnterRecursiveCall` e :c:func:`Py_LeaveRecursiveCall` como funções regulares para a API limitada. Anteriormente, eram definidas como macros, mas essas macros não compilavam com a API C limitada, que não pode acessar o campo ``PyThreadState.recursion_depth`` (a estrutura não é visível na API C limitada).

source: ``PyObject_INIT()`` and ``PyObject_INIT_VAR()`` become regular "opaque" function to hide implementation details.
pt_br: ``PyObject_INIT()`` e ``PyObject_INIT_VAR()`` se uma função regular não visível para ocultar os detalhes da implementação.

source: (Contributed by Victor Stinner in :issue:`38644` and :issue:`39542`.)
pt_br: (Contribuição de Victor Stinner em :issue:`38644` e :issue:`39542`.)

source: The :c:func:`PyModule_AddType` function is added to help adding a type to a module. (Contributed by Donghee Na in :issue:`40024`.)
pt_br: A função :c:func:`PyModule_AddType` é adicionado para ajudar a adicionar um tipo a um módulo. (Contribuição de Donghee Na em :issue:`40024`.)

source: Added the functions :c:func:`PyObject_GC_IsTracked` and :c:func:`PyObject_GC_IsFinalized` to the public API to allow to query if Python objects are being currently tracked or have been already finalized by the garbage collector respectively. (Contributed by Pablo Galindo Salgado in :issue:`40241`.)
pt_br: Adicionadas as funções :c:func:`PyObject_GC_IsTracked` e :c:func:`PyObject_GC_IsFinalized` para a API pública para permitir a consulta se os objetos Python estão sendo rastreados ou já foram finalizados pelo coletor de lixo, respectivamente. (Contribuição de Pablo Galindo em :issue:`40241`.)

source: Added :c:func:`!_PyObject_FunctionStr` to get a user-friendly string representation of a function-like object. (Patch by Jeroen Demeyer in :issue:`37645`.)
pt_br: Adicionada a :c:func:`!_PyObject_FunctionStr` para obter uma representação amigável para o usuário de strings de um objeto função ou similar. (Patch por Jeroen Demeyer em :issue:`37645`.)

source: Added :c:func:`PyObject_CallOneArg` for calling an object with one positional argument (Patch by Jeroen Demeyer in :issue:`37483`.)
pt_br: Adicionada :c:func:`PyObject_CallOneArg` para chamar um objeto com um argumento posicional (Patch de Jeroen Demeyer em :issue:`37483`.)

source: ``PyInterpreterState.eval_frame`` (:pep:`523`) now requires a new mandatory *tstate* parameter (``PyThreadState*``). (Contributed by Victor Stinner in :issue:`38500`.)
pt_br: ``PyInterpreterState.eval_frame`` (:pep:`523`) agora exige um novo parâmetro *tstate* obrigatório (``PyThreadState*``). (Contribuição de Victor Stinner em :issue:`38500`.)

source: Extension modules: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef` are no longer called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, these functions are not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
pt_br: Módulos de extensão: As funções :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` e :c:member:`~PyModuleDef.m_free` de :c:type:`PyModuleDef` não são mais chamados se o estado do módulo foi solicitado, mas ainda não está alocado. Este é o caso imediatamente após o módulo ser criado e antes de o módulo ser executado (função :c:data:`Py_mod_exec`). Mais precisamente, estas funções são são chamados se :c:member:`~PyModuleDef.m_size` for maior que 0 e o estado do módulo (como retornado por :c:func:`PyModule_GetState`) for ``NULL``.

source: Extension modules without module state (``m_size <= 0``) are not affected.
pt_br: Módulos de extensão sem um estado de módulo (``m_size <= 0``) não são afetados.

source: If :c:func:`Py_AddPendingCall` is called in a subinterpreter, the function is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls. (Contributed by Victor Stinner in :issue:`39984`.)
pt_br: Se :c:func:`Py_AddPendingCall` for chamada em um subinterpretador, a função agora está programada para ser chamada a partir do subinterpretador, em vez de ser chamada a partir do interpretador principal. Cada subinterpretador agora tem sua própria lista de chamadas programadas. (Contribuição de Victor Stinner em :issue:`39984`.)

source: The Windows registry is no longer used to initialize :data:`sys.path` when the ``-E`` option is used (if :c:member:`PyConfig.use_environment` is set to ``0``). This is significant when embedding Python on Windows. (Contributed by Zackery Spytz in :issue:`8901`.)
pt_br: O registro do Windows não é mais usado para inicializar :data:`sys.path` quando a opção ``-E`` é usada (se :c:member:`PyConfig.use_environment` estiver definido como ``0``). Isso é significativo ao incorporar Python no Windows. (Contribuição de Zackery Spytz na :issue:`8901`.)

source: The global variable :c:data:`PyStructSequence_UnnamedField` is now a constant and refers to a constant string. (Contributed by Serhiy Storchaka in :issue:`38650`.)
pt_br: A variável global :c:data:`PyStructSequence_UnnamedField` agora é uma constante e se refere a uma string constante. (Contribuição de Serhiy Storchaka em :issue:`38650`.)

source: The :c:type:`!PyGC_Head` structure is now opaque. It is only defined in the internal C API (``pycore_gc.h``). (Contributed by Victor Stinner in :issue:`40241`.)
pt_br: A estrutura :c:type:`!PyGC_Head` agora é opaca. Ela só é definida na API C interna (``pycore_gc.h``). (Contribuição de Victor Stinner em :issue:`40241`.)

source: The ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, and :c:func:`!PyUnicode_AsUnicodeAndSize` are marked as deprecated in C. They have been deprecated by :pep:`393` since Python 3.3. (Contributed by Inada Naoki in :issue:`36346`.)
pt_br: ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, , ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode`` e :c:func:`!PyUnicode_AsUnicodeAndSize` estão marcadas como descontinuadas no C. Elas foram descontinuadas pela :pep:`393` desde Python 3.3. (Contribuição de Inada Naoki em :issue:`36346`.)

source: The :c:func:`Py_FatalError` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined. (Contributed by Victor Stinner in :issue:`39882`.)
pt_br: A função :c:func:`Py_FatalError` é substituída por uma macro que registra automaticamente o nome da função atual, a menos que a macro ``Py_LIMITED_API`` seja definida. (Contribuição de Victor Stinner em :issue:`39882`.)

source: The vectorcall protocol now requires that the caller passes only strings as keyword names. (See :issue:`37540` for more information.)
pt_br: O protocolo vectorcall agora exige que o chamador passe apenas strings como nomes de argumentos. (Veja :issue:`37540` para mais informações.)

source: Implementation details of a number of macros and functions are now hidden:
pt_br: Os detalhes de implementação de uma série de macros e funções agora estão ocultos:

source: :c:func:`PyObject_IS_GC` macro was converted to a function.
pt_br: A macro :c:func:`PyObject_IS_GC` foi convertida para uma função.

source: The :c:func:`!PyObject_NEW` macro becomes an alias to the :c:macro:`PyObject_New` macro, and the :c:func:`!PyObject_NEW_VAR` macro becomes an alias to the :c:macro:`PyObject_NewVar` macro. They no longer access directly the :c:member:`PyTypeObject.tp_basicsize` member.
pt_br: A macro :c:func:`!PyObject_NEW` se torna um apelido para a macro :c:macro:`PyObject_New` e a macro :c:func:`!PyObject_NEW_VAR` se torna um apelido para a macro :c:macro:`PyObject_NewVar`. Elas não acessam mais diretamente o membro :c:member:`PyTypeObject.tp_basicsize`.

source: :c:func:`!PyObject_GET_WEAKREFS_LISTPTR` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_weaklistoffset` member.
pt_br: A macro :c:func:`!PyObject_GET_WEAKREFS_LISTPTR` foi convertida para uma função: a macro acessava diretamente o membro :c:member:`PyTypeObject.tp_weaklistoffset`.

source: :c:func:`PyObject_CheckBuffer` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_as_buffer` member.
pt_br: A macro :c:func:`PyObject_CheckBuffer` foi convertida para uma função: a macro acessava diretamente o membro :c:member:`PyTypeObject.tp_as_buffer`.

source: :c:func:`PyIndex_Check` is now always declared as an opaque function to hide implementation details: removed the ``PyIndex_Check()`` macro. The macro accessed directly the :c:member:`PyTypeObject.tp_as_number` member.
pt_br: :c:func:`PyIndex_Check` está agora declarada como uma função "opaca" para ocultar detalhes da implementação: removida a macro ``PyIndex_Check()``. A macro acessava diretamente o membro :c:member:`PyTypeObject.tp_as_number`.

source: (See :issue:`40170` for more details.)
pt_br: (Veja :issue:`40170` para mais detalhes.)

source: Excluded ``PyFPE_START_PROTECT()`` and ``PyFPE_END_PROTECT()`` macros of ``pyfpe.h`` from the limited C API. (Contributed by Victor Stinner in :issue:`38835`.)
pt_br: Excluídas as macros ``PyFPE_START_PROTECT()`` e ``PyFPE_END_PROTECT()`` de ``pyfpe.h`` da API C limitada. (Contribuição por Victor Stinner em :issue:`38835`.)

source: The ``tp_print`` slot of :ref:`PyTypeObject <type-structs>` has been removed. It was used for printing objects to files in Python 2.7 and before. Since Python 3.0, it has been ignored and unused. (Contributed by Jeroen Demeyer in :issue:`36974`.)
pt_br: O slot ``tp_print`` de :ref:`PyTypeObject <type-structs>` foi removido. Ele era usado para imprimir objetos em arquivos no Python 2.7 e anteriores. Desde Python 3.0, ele era ignorado e não utilizado. (Contribuição de Jeroen Demeyer em :issue:`36974`.)

source: Excluded the following functions from the limited C API:
pt_br: Excluídas as seguintes funções da API C limitada:

source: ``PyThreadState_DeleteCurrent()`` (Contributed by Joannah Nanjekye in :issue:`37878`.)
pt_br: ``PyThreadState_DeleteCurrent()`` (Contribuição de Joannah Nanjekye em :issue:`37878`.)

source: The trashcan mechanism which never worked in the limited C API.
pt_br: O mecanismo trashcan que nunca funcionou na API C limitada.

source: Moved following functions and definitions to the internal C API:
pt_br: Movidas as seguintes funções e definições para a API C interna:

source: ``_Py_AddToAllObjects()`` (specific to ``Py_TRACE_REFS`` build)
pt_br: ``_Py_AddToAllObjects()`` (específico para construção de ``Py_TRACE_REFS``)

source: Removed ``_PyRuntime.getframe`` hook and removed ``_PyThreadState_GetFrame`` macro which was an alias to ``_PyRuntime.getframe``. They were only exposed by the internal C API. Removed also ``PyThreadFrameGetter`` type. (Contributed by Victor Stinner in :issue:`39946`.)
pt_br: Removido o gancho ``_PyRuntime.getframe`` e removida a macro ``_PyThreadState_GetFrame`` que era um alias para ``_PyRuntime.getframe``. Eles eram os únicos expostos pela API C interna. Removido também o tipo ``PyThreadFrameGetter``. (Contribuição de Victor Stinner em :issue:`39946`.)

source: Removed the following functions from the C API. Call :c:func:`PyGC_Collect` explicitly to clear all free lists. (Contributed by Inada Naoki and Victor Stinner in :issue:`37340`, :issue:`38896` and :issue:`40428`.)
pt_br: Removidas as funções a seguir da API C. Chame :c:func:`PyGC_Collect` explicitamente para limpar todas as listas livres. (Contribuição de Inada Naoki e Victor Stinner em :issue:`37340`, :issue:`38896` e :issue:`40428`.)

source: ``PyMethod_ClearFreeList()`` and ``PyCFunction_ClearFreeList()``: the free lists of bound method objects have been removed.
pt_br: ``PyMethod_ClearFreeList()`` e ``PyCFunction_ClearFreeList()``: as listas livres de objetos de método vinculado foram removidas.

source: ``PySet_ClearFreeList()``: the set free list has been removed in Python 3.4.
pt_br: ``PySet_ClearFreeList()``: a definição de lista livres foi removida no Python 3.4.

source: ``PyUnicode_ClearFreeList()``: the Unicode free list has been removed in Python 3.3.
pt_br: ``PyUnicode_ClearFreeList()``: a lista livre de Unicode foi removida no Python 3.3.

source: Removed ``_PyUnicode_ClearStaticStrings()`` function. (Contributed by Victor Stinner in :issue:`39465`.)
pt_br: Removida a função ``_PyUnicode_ClearStaticStrings()``. (Contribuição de Victor Stinner em :issue:`39465`.)

source: Removed ``Py_UNICODE_MATCH``. It has been deprecated by :pep:`393`, and broken since Python 3.3. The :c:func:`PyUnicode_Tailmatch` function can be used instead. (Contributed by Inada Naoki in :issue:`36346`.)
pt_br: Removido ``Py_UNICODE_MATCH``. Ele foi descontinuado por :pep:`393` e quebrado desde o Python 3.3. A função :c:func:`PyUnicode_Tailmatch` pode ser usada em seu lugar. (Contribuição de Inada Naoki em :issue:`36346`.)
