Repository: python/python-docs-pt-br
Catalog: whatsnew/3.9.po
Languages: pt_br

source: What's New In Python 3.9
pt_br: O que há de novo no Python 3.9

source: This article explains the new features in Python 3.9, compared to 3.8. Python 3.9 was released on October 5, 2020. For full details, see the :ref:`changelog <changelog>`.
pt_br: Este artigo explica os novos recursos no Python 3.9, em comparação com 3.8. Python 3.9 foi lançado em 15 de outubro de 2020. Veja o :ref:`changelog <changelog>`. para uma lista completa de mudanças.

source: Summary -- Release highlights
pt_br: Resumo -- Destaques da versão

source: New syntax features:
pt_br: Novos recursos de sintaxe:

source: :pep:`584`, union operators added to ``dict``;
pt_br: :pep:`584`, operadores de união adicionados ao ``dict``;

source: :pep:`585`, type hinting generics in standard collections;
pt_br: :pep:`585`, type hinting genéricos em coleções comuns;

source: :pep:`614`, relaxed grammar restrictions on decorators.
pt_br: :pep:`614`, restrições de gramática relaxadas em decoradores.

source: New built-in features:
pt_br: Novos recursos embutidos:

source: :pep:`616`, string methods to remove prefixes and suffixes.
pt_br: :pep:`616`, métodos de strings para remover prefixos e sufixos.

source: New features in the standard library:
pt_br: Novos recursos na biblioteca padrão:

source: :pep:`593`, flexible function and variable annotations;
pt_br: :pep:`593`, anotações flexíveis de função e variável;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
pt_br: :func:`os.pidfd_open` adicionada para permitidos gerenciamento de processo sem corridas e sinais.

source: Interpreter improvements:
pt_br: Melhorias no interpretador:

source: :pep:`573`, fast access to module state from methods of C extension types;
pt_br: :pep:`573`, acesso rápido ao estado do módulo a partir de métodos de tipos de extensão C;

source: :pep:`617`, CPython now uses a new parser based on PEG;
pt_br: :pep:`617`, CPython agora usa um novo analisador sintático com base em GASE;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
pt_br: vários tipos embutidos do Python (range, tuple, set, frozenset, list, dict) estão agora mais rápidos usando vectorcall da :pep:`590`;

source: garbage collection does not block on resurrected objects;
pt_br: coleta de lixo não causa bloqueio em objetos ressuscitados;

source: a number of Python modules (:mod:`!_abc`, :mod:`!audioop`, :mod:`!_bz2`, :mod:`!_codecs`, :mod:`!_contextvars`, :mod:`!_crypt`, :mod:`!_functools`, :mod:`!_json`, :mod:`!_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`!_weakref`) now use multiphase initialization as defined by PEP 489;
pt_br: vários módulos do Python (:mod:`!_abc`, :mod:`!audioop`, :mod:`!_bz2`, :mod:`!_codecs`, :mod:`!_contextvars`, :mod:`!_crypt`, :mod:`!_functools`, :mod:`!_json`, :mod:`!_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`!_weakref`) agora usam inicialização multifásica conforme definido pela PEP 489;

source: a number of standard library modules (:mod:`!audioop`, :mod:`ast`, :mod:`grp`, :mod:`!_hashlib`, :mod:`pwd`, :mod:`!_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) are now using the stable ABI defined by PEP 384.
pt_br: vários módulos da biblioteca padrão (:mod:`!audioop`, :mod:`ast`, :mod:`grp`, :mod:`!_hashlib`, :mod:`pwd`, :mod:`!_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) estão agora usando a ABI estável definida pela PEP 384.

source: New library modules:
pt_br: Novos módulos de biblioteca:

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
pt_br: :pep:`615`, o banco de dados de fusos horários da IANA é agora apresentado na biblioteca padrão no módulo :mod:`zoneinfo`;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
pt_br: uma implementação de um tipo topológico de um grafo agora é fornecida no novo módulo :mod:`graphlib`.

source: Release process changes:
pt_br: Alterações no processo de lançamento:

source: :pep:`602`, CPython adopts an annual release cycle.
pt_br: :pep:`602`, CPython adota um ciclo de lançamento anual.

source: You should check for DeprecationWarning in your code
pt_br: Você deve verificar DeprecationWarning no seu código

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
pt_br: Quando o Python 2.7 ainda tinha suporte, muitas funcionalidades do Python 3 foram mantidas para compatibilidade com versões anteriores do Python 2.7. Com o fim do suporte ao Python 2, essas camadas de compatibilidade com versões anteriores foram removidas ou serão removidas em breve. A maioria deles emitia um aviso de :exc:`DeprecationWarning` por vários anos. Por exemplo, usar ``collections.Mapping`` em vez de ``collections.abc.Mapping`` emite uma :exc:`DeprecationWarning` desde Python 3.3, lançado em 2012.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
pt_br: Teste sua aplicação com a opção de linha de comando :option:`-W` ``default`` para ver :exc:`DeprecationWarning` e :exc:`PendingDeprecationWarning`, ou mesmo com :option:`-W` ``error`` para tratá-los como erros. :ref:`Filtro de avisos <warning-filter>` pode ser usado para ignorar avisos de código de terceiros.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
pt_br: Python 3.9 é a última versão que fornece essas camadas de compatibilidade com versões anteriores do Python 2, para dar mais tempo aos mantenedores de projetos Python para organizar a remoção do suporte Python 2 e adicionar suporte para Python 3.9.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
pt_br: Aliases para :ref:`classes bases abstratas <collections-abstract-base-classes>` no módulo :mod:`collections`, como o alias ``collections.Mapping`` para :class:`collections.abc.Mapping`, são mantidos para uma última versão para compatibilidade reversa. Eles serão removidos do Python 3.10.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
pt_br: De maneira mais geral, experimente executar seus testes no :ref:`Modo de Desenvolvimento do Python <devmode>`, que ajuda a preparar seu código para torná-lo compatível com a próxima versão do Python.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
pt_br: Observação: vários itens descontinuados pré-existentes também foram removidos nesta versão do Python. Consulte a seção :ref:`removed-in-python-39`.

source: New Features
pt_br: Novas funcionalidades

source: Dictionary Merge & Update Operators
pt_br: Operadores de mesclagem & atualização de dicionário

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
pt_br: Operadores de mesclagem (``|``) e atualização (``|=``) foram adicionados à classe embutida :class:`dict`. Eles complementam o métodos ``dict.update`` e ``{**d1, **d2}`` existentes de mesclagem de dicionários.

source: Example::
pt_br: Exemplo::

source: >>> x = {"key1": "value1 from x", "key2": "value2 from x"} >>> y = {"key2": "value2 from y", "key3": "value3 from y"} >>> x | y {'key1': 'value1 from x', 'key2': 'value2 from y', 'key3': 'value3 from y'} >>> y | x {'key2': 'value2 from x', 'key3': 'value3 from y', 'key1': 'value1 from x'}
pt_br: >>> x = {"chave1": "valor1 from x", "chave2": "valor2 from x"} >>> y = {"chave2": "valor2 from y", "chave3": "valor3 from y"} >>> x | y {'chave1': 'valor1 from x', 'chave2': 'valor2 from y', 'chave3': 'valor3 from y'} >>> y | x {'chave2': 'valor2 from x', 'chave3': 'valor3 from y', 'chave1': 'valor1 from x'}

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
pt_br: Veja :pep:`584` para uma descrição completa. (Contribuição de Brandt Bucher em :issue:`36144`.)

source: New String Methods to Remove Prefixes and Suffixes
pt_br: Novos métodos de strings para remover prefixos e sufixos

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
pt_br: :meth:`str.removeprefix(prefix)<str.removeprefix>` e :meth:`str.removesuffix(suffix)<str.removesuffix>` foram adicionados para remover facilmente um prefixo ou sufixo desnecessário de uma string. Os métodos correspondentes ``bytes``, ``bytearray`` e ``collections.UserString`` também foram adicionados. Veja :pep:`616` para uma descrição completa. (Contribuição de Dennis Sweeney em :issue:`39939`.)

source: Type Hinting Generics in Standard Collections
pt_br: Type hinting genéricos nas coleções padrão

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
pt_br: Agora, nas anotações de tipo, você pode usar tipos de coleção embutidos como ``list`` e ``dict`` como tipos genéricos, em vez de importar os tipos de letras maiúsculas correspondentes (por exemplo, ``List`` ou ``Dict``) de ``typing``. Agora, outros tipos na biblioteca padrão também são genéricos, por exemplo, ``queue.Queue``.

source: Example:
pt_br: Exemplo:

source: def greet_all(names: list[str]) -> None: for name in names: print("Hello", name)
pt_br: def cumprimentar_todos(nomes: list[str]) -> None: for nome in nomes: print("Olá", nome)

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
pt_br: Consulte :pep:`585` para mais detalhes. (Contribuição de Guido van Rossum, Ethan Smith e Batuhan Taşkaya em :issue:`39481`.)

source: New Parser
pt_br: Novo analisador sintático

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
pt_br: O Python 3.9 usa um novo analisador sintático, baseado em `GASE <https://pt.wikipedia.org/wiki/Gramática_de_análise_sintática_de_expressão>`_ em vez de `LL(1) <https://pt.wikipedia.org/wiki/Analisador_sintático_LL>`_. O desempenho do novo analisador sintático é aproximadamente comparável ao do analisador sintático antigo, mas o formalismo do GASE é mais flexível que do LL(1) quando se trata de projetar novos recursos de linguagem. Começaremos a usar essa flexibilidade no Python 3.10 e posterior.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
pt_br: O módulo :mod:`ast` usa o novo analisador e produz o mesmo AST que o analisador antigo.

source: In Python 3.10, the old parser will be deleted and so will all functionality that depends on it (primarily the :mod:`!parser` module, which has long been deprecated). In Python 3.9 *only*, you can switch back to the LL(1) parser using a command line switch (``-X oldparser``) or an environment variable (``PYTHONOLDPARSER=1``).
pt_br: No Python 3.10, o analisador antigo será excluído e todas as funcionalidades que dependem dele (principalmente o módulo :mod:`!parser`, que foi descontinuado a muito tempo). No Python 3.9 *apenas*, você pode voltar ao analisador LL(1) usando uma opção de linha de comando (``-X oldparser``) ou uma variável de ambiente (``PYTHONOLDPARSER=1``).

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
pt_br: Consulte :pep:`617` para mais detalhes. (Contribuição de Guido van Rossum, Pablo Galindo e Lysandros Nikolaou em :issue:`40334`.)

source: Other Language Changes
pt_br: Outras mudanças na linguagem

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
pt_br: :func:`__import__` agora levanta :exc:`ImportError` em vez de :exc:`ValueError`, o que é usado para ocorrer quando uma importação relativa passou de seu um pacote de nível superior. (Contribuição de Ngalim Siregar em :issue:`37444`.)

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
pt_br: Agora, o Python obtém o caminho absoluto do nome do arquivo do script especificado na linha de comando (p.ex., ``python3 script.py``): o atributo ``__file__`` do módulo :mod:`__main__` tornou-se um caminho absoluto, não um caminho relativo. Esses caminhos agora permanecem válidos depois que o diretório atual é alterado por :func:`os.chdir`. Como efeito colateral, o traceback também exibe o caminho absoluto para quadros de módulos de :mod:`__main__` neste caso. (Contribuição de Victor Stinner em :issue:`20443`.)

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
pt_br: No :ref:`Modo de Desenvolvimento do Python <devmode>` e na :ref:`compilação de depuração <debug-build>` , os argumentos *encoding* e *errors* agora são verificados quanto às operações de codificação e decodificação de strings. Exemplos: :func:`open`, :meth:`str.encode` e :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
pt_br: Por padrão, para obter o melhor desempenho, o argumento *errors* é verificado apenas no primeiro erro de codificação/decodificação, e o argumento *encoding* às vezes é ignorado para strings vazias. (Contribuição de Victor Stinner em :issue:`37388`.)

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
pt_br: ``"".replace("", s, n)`` agora retorna ``s`` em vez de uma string vazia para todos ``n`` não zero. Isso é agora consistente com ``"".replace("", s)``. Há alterações similares para objetos :class:`bytes` e :class:`bytearray`. (Contribuição de Serhiy Storchaka em :issue:`28029`.)

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
pt_br: Qualquer expressão válida agora pode ser usada como :term:`decorador <decorator>`. Anteriormente, a gramática era muito mais restritiva. Veja :pep:`614` para detalhes. (Contribuição de Brandt Bucher em :issue:`39702`.)

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
pt_br: Aprimorada a ajuda para o módulo :mod:`digitando`. Agora, as linhas de documento são mostradas para todos os formulários especiais e aliases genéricos especiais (como ``Union`` e ``List``). Usando :func:`help` com alias genérico como ``List[int]`` mostrará a ajuda para o tipo concreto correspondente (neste caso, ``list``). (Contribuição de Serhiy Storchaka em :issue:`40257`.)

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
pt_br: A execução paralela de :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` é agora proibida e ``ag_running`` agora reflete o status atual de execução do gerador async. (Contribuição de Yury Selivanov em :issue:`30773`.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
pt_br: Erros inesperados ao chamar o método ``__iter__`` não são mais mascarados por ``TypeError`` no operador :keyword:`in` e nas funções :func:`~operator.contains`, :func:`~operator.indexOf` e :func:`~operator.countOf` do módulo :mod:`operator`. (Contribuição de Serhiy Storchaka em :issue:`40824`.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
pt_br: Expressões lambda sem parênteses não podem mais ser a parte da expressão em uma cláusula ``if`` em compreensões e expressões geradoras. Veja :issue:`41848` e :issue:`43755` para detalhes.

source: New Modules
pt_br: Novos módulos

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
pt_br: O módulo :mod:`zoneinfo` oferece suporte ao banco de dados de fuso horário da IANA para a biblioteca padrão. Ele adiciona :class:`zoneinfo.ZoneInfo`, uma implementação concreta :class:`datetime.tzinfo`, apoiada pelos dados do fuso horário do sistema.

source: >>> from zoneinfo import ZoneInfo >>> from datetime import datetime, timedelta >>> # Daylight saving time >>> dt = datetime(2020, 10, 31, 12, tzinfo=ZoneInfo("America/Los_Angeles")) >>> print(dt) 2020-10-31 12:00:00-07:00 >>> dt.tzname() 'PDT' >>> # Standard time >>> dt += timedelta(days=7) >>> print(dt) 2020-11-07 12:00:00-08:00 >>> print(dt.tzname()) PST
pt_br: >>> from zoneinfo import ZoneInfo >>> from datetime import datetime, timedelta >>> # Tempo em fuso horário com horário de verão >>> dt = datetime(2020, 10, 31, 12, tzinfo=ZoneInfo("America/Los_Angeles")) >>> print(dt) 2020-10-31 12:00:00-07:00 >>> dt.tzname() 'PDT' >>> # Tempo padrão >>> dt += timedelta(days=7) >>> print(dt) 2020-11-07 12:00:00-08:00 >>> print(dt.tzname()) PST

source: As a fall-back source of data for platforms that don't ship the IANA database, the :pypi:`tzdata` module was released as a first-party package -- distributed via PyPI and maintained by the CPython core team.
pt_br: Como fonte alternativa de dados para plataformas que não entregam o banco de dados da IANA, o módulo :pypi:`tzdata` foi lançado como um pacote inicial -- distribuído via PyPI e mantido pela equipe principal do CPython.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
pt_br: :pep:`615` -- Suporte ao banco de dados de fuso horário da IANA na biblioteca padrão

source: PEP written and implemented by Paul Ganssle
pt_br: PEP escrita e implementada por Paul Ganssle

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
pt_br: Um novo módulo, :mod:`graphlib`, foi adicionado contendo a classe :class:`graphlib.TopologicalSorter` para oferecer funcionalidade de realizar classificação topológica de grafos. (Contribuição de Pablo Galindo, Tim Peters e Larry Hastings em :issue:`17005`.)

source: Improved Modules
pt_br: Módulos melhorados

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
pt_br: Adicionada a opção *indent* a :func:`~ast.dump`, que permite produzir uma saída indentada com várias linhas. (Contribuição de Serhiy Storchaka em :issue:`37995`.)

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
pt_br: Adicionada :func:`ast.unparse` como uma função no módulo :mod:`ast` que pode ser usado para remover um objeto :class:`ast.AST` e produzir uma string com código que produziria um objeto :class:`ast.AST` equivalente quando analisado. (Contribuição de Pablo Galindo e Batuhan Taskaya em :issue:`38870`.)

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
pt_br: Adicionadas docstrings aos nós AST que contêm a assinatura ASDL usada para construir esse nó. (Contribuição de Batuhan Taskaya em :issue:`39638`.)
