Repository: python/python-docs-pt-br
Catalog: whatsnew/3.9.po
Languages: pt_br

source: The :mod:`!lib2to3` module now emits a :exc:`PendingDeprecationWarning`. Python 3.9 switched to a PEG parser (see :pep:`617`), and Python 3.10 may include new language syntax that is not parsable by lib2to3's LL(1) parser. The :mod:`!lib2to3` module may be removed from the standard library in a future Python version. Consider third-party alternatives such as `LibCST`_ or `parso`_. (Contributed by Carl Meyer in :issue:`40360`.)
pt_br: O módulo :mod:`!lib2to3` agora emite um :exc:`PendingDeprecationWarning`. Python 3.9 mudou para um analisador sintático GASE (veja :pep:`617`) e Python 3.10 pode incluir uma nova sintaxe de linguagem que não é analisável pelo analisador sintático LL(1) de lib2to3. O módulo :mod:`!lib2to3` pode ser removido da biblioteca padrão em uma versão futura do Python. Considere alternativas de terceiros, como `LibCST`_ ou `parso`_. (Contribuição de Carl Meyer em :issue:`40360`.)

source: The *random* parameter of :func:`random.shuffle` has been deprecated. (Contributed by Raymond Hettinger in :issue:`40465`)
pt_br: Adicionado o parâmetro *random* da :func:`random.shuffle` foi descontinuado. (Contribuição de Raymond Hettinger em :issue:`40465`)

source: Removed
pt_br: Removidos

source: The erroneous version at :data:`!unittest.mock.__version__` has been removed.
pt_br: A versão errônea em :data:`!unittest.mock.__version__` foi removida.

source: :class:`!nntplib.NNTP`: ``xpath()`` and ``xgtitle()`` methods have been removed. These methods are deprecated since Python 3.3. Generally, these extensions are not supported or not enabled by NNTP server administrators. For ``xgtitle()``, please use :meth:`!nntplib.NNTP.descriptions` or :meth:`!nntplib.NNTP.description` instead. (Contributed by Donghee Na in :issue:`39366`.)
pt_br: :class:`!nntplib.NNTP`: os métodos ``xpath()`` e ``xgtitle()`` foram removidos. Esses métodos foram descontinuados desde Python 3.3. Geralmente, essas extensões não são suportadas ou não são habilitadas pelos administradores do servidor NNTP. Para ``xgtitle()``, use :meth:`!nntplib.NNTP.descriptions` ou :meth:`!nntplib.NNTP.description`. (Contribuição de Donghee Na em :issue:`39366`.)

source: :class:`array.array`: ``tostring()`` and ``fromstring()`` methods have been removed. They were aliases to ``tobytes()`` and ``frombytes()``, deprecated since Python 3.2. (Contributed by Victor Stinner in :issue:`38916`.)
pt_br: :class:`array.array`: os métodos ``tostring()`` e ``fromstring()`` foram removidos. Eles eram aliases para ``tobytes()`` e ``frombytes()``, descontinuado desde Python 3.2. (Contribuição de Victor Stinner em :issue:`38916`.)

source: The undocumented ``sys.callstats()`` function has been removed. Since Python 3.7, it was deprecated and always returned :const:`None`. It required a special build option ``CALL_PROFILE`` which was already removed in Python 3.7. (Contributed by Victor Stinner in :issue:`37414`.)
pt_br: A função ``sys.callstats()`` não documentada foi removida. Desde o Python 3.7, ela foi descontinuada e sempre retornou :const:`None`. É necessária uma opção de compilação especial ``CALL_PROFILE`` que já foi removida no Python 3.7. (Contribuição de Victor Stinner em :issue:`37414`.)

source: The ``sys.getcheckinterval()`` and ``sys.setcheckinterval()`` functions have been removed. They were deprecated since Python 3.2. Use :func:`sys.getswitchinterval` and :func:`sys.setswitchinterval` instead. (Contributed by Victor Stinner in :issue:`37392`.)
pt_br: As funções ``sys.getcheckinterval()`` e ``sys.setcheckinterval()`` foram removidas. Elas foram descontinuadas desde o Python 3.2. Use :func:`sys.getswitchinterval` e :func:`sys.setswitchinterval` em seu lugar. (Contribuição de Victor Stinner em :issue:`37392`.)

source: The C function ``PyImport_Cleanup()`` has been removed. It was documented as: "Empty the module table. For internal use only." (Contributed by Victor Stinner in :issue:`36710`.)
pt_br: A função C ``PyImport_Cleanup()`` foi removida. Foi documentada como: "Esvazia a tabela do módulo. Apenas para uso interno." (Contribuição de Victor Stinner em :issue:`36710`.)

source: ``_dummy_thread`` and ``dummy_threading`` modules have been removed. These modules were deprecated since Python 3.7 which requires threading support. (Contributed by Victor Stinner in :issue:`37312`.)
pt_br: Os módulos ``_dummy_thread`` e ``dummy_threading`` foram removidos. Esses módulos foram descontinuados desde o Python 3.7, que requer suporte a threading. (Contribuição de Victor Stinner em :issue:`37312`.)

source: ``aifc.openfp()`` alias to ``aifc.open()``, ``sunau.openfp()`` alias to ``sunau.open()``, and ``wave.openfp()`` alias to :func:`wave.open` have been removed. They were deprecated since Python 3.7. (Contributed by Victor Stinner in :issue:`37320`.)
pt_br: O apelido ``aifc.openfp()`` para ``aifc.open()``, o apelido ``sunau.openfp()`` para ``sunau.open()`` e o apelido ``wave.openfp()`` para :func:`wave.open` foram removidos. Eles estavam descontinuados desde o Python 3.7. (Contribuição de Victor Stinner em :issue:`37320`.)

source: The :meth:`!isAlive` method of :class:`threading.Thread` has been removed. It was deprecated since Python 3.8. Use :meth:`~threading.Thread.is_alive` instead. (Contributed by Donghee Na in :issue:`37804`.)
pt_br: O método :meth:`!isAlive` de :class:`threading.Thread` foi removido. Ele foi descontinuado desde o Python 3.8. Use :meth:`~threading.Thread.is_alive` ao invés. (Contribuição de Donghee Na em :issue:`37804`.)

source: Methods ``getchildren()`` and ``getiterator()`` of classes :class:`~xml.etree.ElementTree.ElementTree` and :class:`~xml.etree.ElementTree.Element` in the :mod:`~xml.etree.ElementTree` module have been removed. They were deprecated in Python 3.2. Use ``iter(x)`` or ``list(x)`` instead of ``x.getchildren()`` and ``x.iter()`` or ``list(x.iter())`` instead of ``x.getiterator()``. (Contributed by Serhiy Storchaka in :issue:`36543`.)
pt_br: Os métodos ``getchildren()`` e ``getiterator()`` das classes :class:`~xml.etree.ElementTree.ElementTree` e :class:`~xml.etree.ElementTree.Element` no módulo :mod:`~xml.etree.ElementTree` foram removidos. Eles foram descontinuados no Python 3.2. Use ``iter(x)`` ou ``list(x)`` em vez de ``x.getchildren()`` e ``x.iter()`` ou ``list(x.iter())`` em vez de ``x.getiterator()``. (Contribuição Serhiy Storchaka no :issue:`36543`.)

source: The old :mod:`plistlib` API has been removed, it was deprecated since Python 3.4. Use the :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump`, and :func:`~plistlib.dumps` functions. Additionally, the *use_builtin_types* parameter was removed, standard :class:`bytes` objects are always used instead. (Contributed by Jon Janzen in :issue:`36409`.)
pt_br: A API antiga :mod:`plistlib` foi removida. Ela tinha sido descontinuada desde o Python 3.4. Use as funções :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump` e :func:`~plistlib.dumps`. Além disso, o parâmetro *use_builtin_types* foi removido, os objetos padrão :class:`bytes` são sempre usados em seu lugar. (Contribuição de Jon Janzen em :issue:`36409`.)

source: The C function ``PyGen_NeedsFinalizing`` has been removed. It was not documented, tested, or used anywhere within CPython after the implementation of :pep:`442`. Patch by Joannah Nanjekye. (Contributed by Joannah Nanjekye in :issue:`15088`)
pt_br: A função C ``PyGen_NeedsFinalizing`` foi removida. Ela não foi documentada, testada ou usada em qualquer lugar dentro do CPython após a implementação de :pep:`442`. Patch de Joannah Nanjekye. (Contribuição de Joannah Nanjekye em :issue:`15088`)

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
pt_br: ``base64.encodestring()`` e ``base64.decodestring()``, aliases descontinuados desde Python 3.1, foram removidos: use :func:`base64.encodebytes` e :func:`base64.decodebytes`. (Contribuição de Victor Stinner em :issue:`39351`.)

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
pt_br: A função ``fractions.gcd()`` foi removida, foi descontinuado desde Python 3.5 (:issue:`22486`): use :func:`math.gcd` em seu lugar. (Contribuição de Victor Stinner em :issue:`39350`.)

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
pt_br: O parâmetro *buffering* de :class:`bz2.BZ2File` foi removido. Desde Python 3.0, ele era ignorado e ao usá-lo emitia uma :exc:`DeprecationWarning`. Passe um objeto arquivo aberto para controlar como o arquivo é aberto. (Contribuição de Victor Stinner em :issue:`39357`.)

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
pt_br: O parâmetro *encoding* de :func:`json.loads` foi removido. A partir do Python 3.1, ele foi descontinuado e ignorado; usá-lo emitia uma :exc:`DeprecationWarning` desde Python 3.8. (Contribuição de Inada Naoki em :issue:`39377`)

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
pt_br: As instruções ``with (await asyncio.lock):`` e ``with (yield from asyncio.lock):`` não são mais suportadas, use ``async with lock``. O mesmo é se aplica para ``asyncio.Condition`` e ``asyncio.Semaphore``. (Contribuição de Andrew Svetlov em :issue:`34793`.)

source: The :func:`!sys.getcounts` function, the ``-X showalloccount`` command line option and the ``show_alloc_count`` field of the C structure :c:type:`PyConfig` have been removed. They required a special Python build by defining ``COUNT_ALLOCS`` macro. (Contributed by Victor Stinner in :issue:`39489`.)
pt_br: A função :func:`!sys.getcounts`, a opção de linha de comando ``-X showalloccount`` e o campo ``show_alloc_count`` da estrutura C :c:type:`PyConfig` foram removidos. Eles exigiam uma construção especial do Python definindo a macro ``COUNT_ALLOCS``. (Contribuição de Victor Stinner em :issue:`39489`.)

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
pt_br: O atributo ``_field_types`` da classe :class:`typing.NamedTuple` foi removido. Ele foi descontinuado desde o Python 3.8. Use o atributo ``__annotations__``. (Contribuição de Serhiy Storchaka em :issue:`40182`.)

source: The :meth:`!symtable.SymbolTable.has_exec` method has been removed. It was deprecated since 2006, and only returning ``False`` when it's called. (Contributed by Batuhan Taskaya in :issue:`40208`)
pt_br: O método :meth:`!symtable.SymbolTable.has_exec` foi removido. Ele foi descontinuado desde 2006, e retornando apenas ``False`` quando é chamado. (Contribuição de Batuhan Taskaya em :issue:`40208`)

source: The :meth:`!asyncio.Task.current_task` and :meth:`!asyncio.Task.all_tasks` have been removed. They were deprecated since Python 3.7 and you can use :func:`asyncio.current_task` and :func:`asyncio.all_tasks` instead. (Contributed by Rémi Lapeyre in :issue:`40967`)
pt_br: Os métodos :meth:`!asyncio.Task.current_task` e :meth:`!asyncio.Task.all_tasks` foram removidos. Eles foram descontinuados desde o Python 3.7 e você pode usar :func:`asyncio.current_task` e :func:`asyncio.all_tasks` em seu lugar. (Contribuição de Rémi Lapeyre em :issue:`40967`)

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
pt_br: O método ``unescape()`` na classe :class:`html.parser.HTMLParser` foi removido (foi descontinuado desde o Python 3.4). :func:`html.unescape` deve ser usada para converter referências de caracteres para os caracteres Unicode correspondentes.

source: Porting to Python 3.9
pt_br: Portando para Python 3.9

source: This section lists previously described changes and other bugfixes that may require changes to your code.
pt_br: Esta seção lista as alterações descritas anteriormente e outras correções que podem exigir alterações no seu código.

source: Changes in the Python API
pt_br: Alterações na API Python

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
pt_br: :func:`__import__` e :func:`importlib.util.resolve_name` agora levanta :exc:`ImportError` onde anteriormente levantava :exc:`ValueError`. Os chamadores capturando o tipo de exceção específico e suportando Python 3.9 e versões anteriores precisarão capturar ambas usando ``except (ImportError, ValueError):``.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
pt_br: Os scripts de ativação :mod:`venv` não são mais casos especiais quando ``__VENV_PROMPT__`` está definido como ``""``.

source: The :meth:`select.epoll.unregister` method no longer ignores the :const:`~errno.EBADF` error. (Contributed by Victor Stinner in :issue:`39239`.)
pt_br: O método :meth:`select.epoll.unregister` não ignora mais o erro :const:`~errno.EBADF`. (Contribuição de Victor Stinner em :issue:`39239`.)

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
pt_br: O parâmetro *compresslevel* de :class:`bz2.BZ2File` tornou-se uma parâmetro somente-nomeado, uma vez que o parâmetro *buffering* foi removido. (Contribuição de Victor Stinner em :issue:`39357`.)

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
pt_br: AST simplificada para assinatura. Índices simples serão representados por seus valores, fatias estendidas serão representadas como tuplas. ``Index(value)`` retornará um ``value`` em si, ``ExtSlice(slices)`` retornará ``Tuple(slices, Load())``. (Contribuição de Serhiy Storchaka em :issue:`34822`.)

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
pt_br: O módulo :mod:`importlib` agora ignora a variável de ambiente :envvar:`PYTHONCASEOK` quando as opções de linha de comando :option:`-E` ou :option:`-I` estão sendo usadas.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
pt_br: O parâmetro *encoding* foi adicionado às classes :class:`ftplib.FTP` e :class:`ftplib.FTP_TLS` como um parâmetro somente-nomeado, e a codificação padrão foi alterada de Latin-1 para UTF-8 para siga :rfc:`2640`.

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
pt_br: :meth:`asyncio.loop.shutdown_default_executor` foi adicionado a :class:`~asyncio.AbstractEventLoop`, significando que laços de eventos alternativos que herdam dele devem ter este método definido. (Contribuição de Kyle Stanley em :issue:`34037`.)

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
pt_br: Os valores constantes de futuras sinalizações no módulo :mod:`__future__` são atualizados para evitar colisão com sinalizações do compilador. Anteriormente, ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` estava em conflito com ``CO_FUTURE_DIVISION``. (Contribuição de Batuhan Taskaya em :issue:`39562`)

source: ``array('u')`` now uses :c:type:`wchar_t` as C type instead of ``Py_UNICODE``. This change doesn't affect to its behavior because ``Py_UNICODE`` is alias of :c:type:`wchar_t` since Python 3.3. (Contributed by Inada Naoki in :issue:`34538`.)
pt_br: ``array('u')`` agora usa :c:type:`wchar_t` como tipo C em vez de ``Py_UNICODE``. Esta mudança não afeta seu comportamento porque ``Py_UNICODE`` é um apelido de :c:type:`wchar_t` desde Python 3.3. (Contribuição de Inada Naoki em :issue:`34538`.)

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
pt_br: A API de :func:`logging.getLogger` agora retorna o logger raiz quando passado o nome ``'root'``, enquanto anteriormente retornava um logger não-raiz chamado ``'root'``. Isso pode afetar casos onde o código do usuário deseja explicitamente um logger não-root chamado ``'root'``, ou instancia um logger usando ``logging.getLogger(__name__)`` em algum módulo de nível superior chamado ``'root.py'``. (Contribuição de Vinay Sajip em :issue:`37742`.)

source: Division handling of :class:`~pathlib.PurePath` now returns :data:`NotImplemented` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
pt_br: O tratamento de divisão de :class:`~pathlib.PurePath` agora retorna :data:`NotImplemented` ao invés de levantar um :exc:`TypeError` quando passado algo diferente de uma instância de ``str`` ou :class:`~pathlib.PurePath`. Isso permite a criação de classes compatíveis que não herdam desses tipos mencionados. (Contribuição de Roger Aiudi em :issue:`34775`).

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notatation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros. (Contributed by Christian Heimes in :issue:`36384`).
pt_br: A partir do Python 3.9.5, o módulo :mod:`ipaddress` não aceita mais zeros à esquerda em strings de endereço IPv4. Os zeros à esquerda são ambíguos e interpretados como notação octal por algumas bibliotecas. Por exemplo, a função legada :func:`socket.inet_aton` trata os zeros à esquerda como notação octal. A implementação glibc de :func:`~socket.inet_pton` moderna não aceita nenhum zeros à esquerda. (Contribuição de Christian Heimes em :issue:`36384`).

source: :func:`codecs.lookup` now normalizes the encoding name the same way as :func:`encodings.normalize_encoding`, except that :func:`codecs.lookup` also converts the name to lower case. For example, ``"latex+latin1"`` encoding name is now normalized to ``"latex_latin1"``. (Contributed by Jordon Xu in :issue:`37751`.)
pt_br: :func:`codecs.lookup` agora normaliza o nome da codificação da mesma forma que :func:`encodings.normalize_encoding`, exceto que :func:`codecs.lookup` também converte o nome para minúsculas. Por exemplo, ``"latex+latin1"`` nome de codificação agora está normalizado para ``"latex_latin1"``. (Contribuição de Jordon Xu em :issue:`37751`.)

source: Changes in the C API
pt_br: Alterações na API C

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
pt_br: Instâncias de :ref:`tipos alocados por heap <heap-types>` (como aquelas criadas com :c:func:`PyType_FromSpec` e APIs semelhantes) mantêm uma referência para seu objeto de tipo desde o Python 3.8. Conforme indicado nas "Mudanças na API C" do Python 3.8, para a grande maioria dos casos, não deve haver nenhum efeito colateral, mas para os tipos que têm uma função personalizada :c:member:`~PyTypeObject.tp_traverse`, certifique-se de que todas as funções ``tp_traverse`` personalizadas de tipos alocados por heap visitam o tipo do objeto.

source: int foo_traverse(PyObject *self, visitproc visit, void *arg) { // Rest of the traverse function #if PY_VERSION_HEX >= 0x03090000 // This was not needed before Python 3.9 (Python issue 35810 and 40217) Py_VISIT(Py_TYPE(self)); #endif }
pt_br: int travessia_foo(PyObject *self, visitproc visit, void *arg) { // Resto da função de travessia #if PY_VERSION_HEX >= 0x03090000 // Isso não era necessário antes do Python 3.9 (problemas 35810 e 40217 do Python) Py_VISIT(Py_TYPE(self)); #endif }

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
pt_br: Se sua função transversal delega para ``tp_traverse`` de sua classe base (ou outro tipo), certifique-se de que ``Py_TYPE(self)`` seja visitado apenas uma vez. Observe que apenas os :ref:`tipos de heap <heap-types>` devem visitar o tipo em ``tp_traverse``.

source: For example, if your ``tp_traverse`` function includes:
pt_br: Por exemplo, se sua função ``tp_traverse`` inclui:

source: then add:
pt_br: adicione:

source: #if PY_VERSION_HEX >= 0x03090000 // This was not needed before Python 3.9 (bpo-35810 and bpo-40217) if (base->tp_flags & Py_TPFLAGS_HEAPTYPE) { // a heap type's tp_traverse already visited Py_TYPE(self) } else { Py_VISIT(Py_TYPE(self)); } #else
pt_br: #if PY_VERSION_HEX >= 0x03090000 // Isso não era necessário antes do Python 3.9 (bpo-35810 e bpo-40217) if (base->tp_flags & Py_TPFLAGS_HEAPTYPE) { // tp_traverse de um tipo de heap já visitou Py_TYPE(self) } else { Py_VISIT(Py_TYPE(self)); } #else

source: (See :issue:`35810` and :issue:`40217` for more information.)
pt_br: (Veja :issue:`35810` e :issue:`40217` para mais informações.)
