Repository: python/python-docs-pt-br
Catalog: whatsnew/3.9.po
Languages: pt_br

source: Cleaned header files of interfaces defined but with no implementation. The public API symbols being removed are: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contributed by Pablo Galindo Salgado in :issue:`39372`.)
pt_br: Limpados os arquivos de cabeçalho de interfaces definidas, mas sem implementação. Os símbolos públicos da API sendo removidos são: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contribuição de Pablo Galindo Salgado em :issue:`39372`.)

source: Notable changes in Python 3.9.1
pt_br: Alterações notáveis no Python 3.9.1

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
pt_br: O comportamento de :class:`typing.Literal` foi alterado para ficar em conformidade com a :pep:`586` e para corresponder ao comportamento de verificadores de tipo estático especificados na PEP.

source: ``Literal`` now de-duplicates parameters.
pt_br: ``Literal`` agora elimina a duplicação de parâmetros.

source: Equality comparisons between ``Literal`` objects are now order independent.
pt_br: Comparações de igualdade entre objetos ``Literal`` agora são independentes da ordem.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
pt_br: Comparações de ``Literal`` agora respeitam os tipos. Por exemplo, ``Literal[0] == Literal[False]`` avaliava anteriormente como ``True``. Agora é ``False``. Para oferecer suporte a essa mudança, o cache de tipo usado internamente agora oferece suporte a tipos de diferenciação.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with mutable parameters will not throw an error::
pt_br: Objetos ``Literal`` agora irão levantar uma exceção :exc:`TypeError` durante as comparações de igualdade se algum de seus parâmetros não for :term:`hasheável`. Observe que declarar ``Literal`` com parâmetros mutáveis não gerará um erro::

source: (Contributed by Yurii Karabas in :issue:`42345`.)
pt_br: (Contribuição de Yurii Karabas em :issue:`42345`.)

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
pt_br: Suporte a macOS 11.0 (Big Sur) e Apple Silicon Mac

source: As of 3.9.1, Python now fully supports building and running on macOS 11.0 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Binaries can also now be built on current versions of macOS to be deployed on a range of older macOS versions (tested to 10.9) while making some newer OS functions and options conditionally available based on the operating system version in use at runtime ("weaklinking").
pt_br: A partir do 3.9.1, o Python agora oferece suporte total à construção e execução no macOS 11.0 (Big Sur) e no Apple Silicon Macs (baseado na arquitetura ``ARM64``). Uma nova variante de compilação universal, ``universal2``, está agora disponível para suportar nativamente ambos ``ARM64`` e ``Intel 64`` em um conjunto de executáveis. Os binários também podem ser construídos em versões atuais do macOS para serem implantados em uma variedade de versões mais antigas do macOS (testado para 10.9), enquanto algumas funções e opções do sistema operacional mais recentes estão disponíveis condicionalmente com base na versão do sistema operacional em uso no tempo de execução ("ligação fraca")

source: (Contributed by Ronald Oussoren and Lawrence D'Anna in :issue:`41100`.)
pt_br: (Contribuição de Ronald Oussoren e Lawrence D'Anna em :issue:`41100`.)

source: Notable changes in Python 3.9.2
pt_br: Alterações notáveis no Python 3.9.2

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. A :exc:`DeprecationWarning` may be emitted for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9.1. This :exc:`DeprecationWarning` will become a :exc:`TypeError` in Python 3.10. (Contributed by Ken Jin in :issue:`42195`.)
pt_br: :class:`collections.abc.Callable` genérica agora nivela os parâmetros de tipo, semelhante ao que :data:`typing.Callable` faz atualmente. Isso significa que ``collections.abc.Callable[[int, str], str]`` terá ``__args__`` de ``(int, str, str)``; anteriormente era ``([int, str], str)``. Para permitir esta mudança, :class:`types.GenericAlias` agora pode ter uma subclasse, e uma subclasse será retornada ao subscrever o tipo :class:`Collections.abc.Callable`. O código que acessa os argumentos via :func:`typing.get_args` ou ``__args__`` precisa levar em conta esta mudança. Um :exc:`DeprecationWarning` pode ser emitido para formas inválidas de parametrização :class:`Collections.abc.Callable` que pode ter passado silenciosamente no Python 3.9.1. Esta :exc:`DeprecationWarning` se tornará uma :exc:`TypeError` no Python 3.10. (Contribuição de Ken Jin em :issue:`42195`.)

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
pt_br: Versões anteriores do Python permitiam o uso de ``;`` e ``&`` como separadores de parâmetros de consulta nas funções :func:`urllib.parse.parse_qs` e :func:`urllib.parse.parse_qsl`. Devido a questões de segurança, e em conformidade com as recomendações mais recentes do W3C, isso foi alterado para permitir apenas uma única chave separadora, com ``&`` como padrão. Esta mudança também afeta as funções :func:`!cgi.parse` e :func:`!cgi.parse_multipart` já que elas usam as funções afetadas internamente. Para obter mais detalhes, consulte sua respectiva documentação. (Contribuição de Adam Goldschmidt, Senthil Kumaran e Ken Jin em :issue:`42967`.)

source: Notable changes in Python 3.9.3
pt_br: Alterações notáveis no Python 3.9.3

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
pt_br: Uma correção de segurança altera o comportamento :class:`ftplib.FTP` para não confiar no endereço IPv4 enviado do servidor remoto ao configurar um canal de dados passivo. Em vez disso, reutilizamos o endereço IP do servidor ftp. Para códigos incomuns que requerem o comportamento antigo, defina um atributo ``trust_server_pasv_ipv4_address`` em sua instância de FTP para ``True``. (Veja :gh:`87451`)

source: Notable changes in Python 3.9.5
pt_br: Alterações notáveis no Python 3.9.5

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
pt_br: A presença de caracteres de nova linha ou tab em partes de um URL permite algumas formas de ataques. Seguindo a especificação WHATWG que atualiza :rfc:`3986`, nova linha ASCII ``\n``, ``\r`` e os caracteres de tabulação ``\t`` são retirados da URL pelo analisador sintático em :mod:`urllib.parse` impedindo tais ataques. Os caracteres de remoção são controlados por uma nova variável de nível de módulo ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (Veja :gh:`88048`)

source: Notable security feature in 3.9.14
pt_br: Recursos de segurança notáveis no 3.9.14

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
pt_br: Converter entre :class:`int` e :class:`str` em bases diferentes de 2 (binário), 4, 8 (octal), 16 (hexadecimal) ou 32 como base 10 (decimal) agora levanta uma exceção :exc:`ValueError` se o número de dígitos em forma de string estiver acima de um limite para evitar possíveis ataques de negação de serviço devido à complexidade algorítmica. Esta é uma mitigação para :cve:`2020-10735`. Este limite pode ser configurado ou desabilitado por variável de ambiente, sinalizador de linha de comando ou APIs de :mod:`sys`. Veja a documentação de :ref:`limitação de comprimento de conversão de string inteira <int_max_str_digits>`. O limite padrão é de 4300 dígitos em forma de string.

source: Notable changes in 3.9.17
pt_br: Alterações notáveis no 3.9.17

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
pt_br: Os métodos de extração em :mod:`tarfile` e :func:`shutil.unpack_archive`, têm um novo argumento *filter* que permite limitar recursos do tar que podem ser surpreendentes ou perigosos, como criar arquivos fora do diretório de destino. Veja :ref:`tarfile-extraction-filter` para detalhes. No Python 3.12, usar sem o argumento *filter* mostrará um :exc:`DeprecationWarning`. No Python 3.14, o padrão mudará para ``'data'``. (Contribuição de Petr Viktorin em :pep:`706`.)
