Repository: python/python-docs-pt-br
Catalog: whatsnew/3.9.po
Languages: pt_br

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
pt_br: Devido a significativas preocupações de segurança, o parâmetro *reuse_address* de :meth:`asyncio.loop.create_datagram_endpoint` não é mais suportado. Isso ocorre devido ao comportamento da opção de soquete ``SO_REUSEADDR`` no UDP. Para mais detalhes, consulte a documentação de ``loop.create_datagram_endpoint()``. (Contribuição de Kyle Stanley, Antoine Pitrou e Yury Selivanov em :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
pt_br: Adicionada uma nova :term:`corrotina <coroutine>` :meth:`~asyncio.loop.shutdown_default_executor` que agenda um desligamento para o executor padrão que espera na :class:`~concurrent.futures.ThreadPoolExecutor` para concluir o fechamento. Além disso, :func:`asyncio.run` foi atualizada para usar o novo :term:`corrotina <coroutine>`. (Contribuição de Kyle Stanley em :issue:`34037`.)

source: Added :class:`!asyncio.PidfdChildWatcher`, a Linux-specific child watcher implementation that polls process file descriptors. (:issue:`38692`)
pt_br: Adicionada :class:`!asyncio.PidfdChildWatcher`, uma implementação de monitorador de filhos específica do Linux que controla descritores de arquivo de processo. (:issue:`38692`)

source: Added a new :term:`coroutine` :func:`asyncio.to_thread`. It is mainly used for running IO-bound functions in a separate thread to avoid blocking the event loop, and essentially works as a high-level version of :meth:`~asyncio.loop.run_in_executor` that can directly take keyword arguments. (Contributed by Kyle Stanley and Yury Selivanov in :issue:`32309`.)
pt_br: Adicionada uma nova :term:`corrotina <coroutine>` :func:`asyncio.to_thread`. É usada principalmente para executar funções vinculadas à E/S em uma thread separada para evitar o bloqueio do loop de eventos e funciona essencialmente como uma versão de alto nível de :meth:`~asyncio.loop.run_in_executor` que pode receber argumentos nomeados diretamente. (Contribuição de Kyle Stanley e Yury Selivanov em :issue:`32309`.)

source: When cancelling the task due to a timeout, :meth:`asyncio.wait_for` will now wait until the cancellation is complete also in the case when *timeout* is <= 0, like it does with positive timeouts. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
pt_br: Ao cancelar a tarefa devido a um tempo limite, :meth:`asyncio.wait_for` irá agora esperar até que o cancelamento seja concluído também no caso quando *timeout* é <= 0, como acontece com tempos limite positivos. (Contribuição de Elvis Pranskevichus em :issue:`32751`.)

source: :mod:`asyncio` now raises :exc:`TypeError` when calling incompatible methods with an :class:`ssl.SSLSocket` socket. (Contributed by Ido Michael in :issue:`37404`.)
pt_br: :mod:`asyncio` agora levanta :exc:`TypeError` ao chamar métodos incompatíveis com um soquete :class:`ssl.SSLSocket`. (Contribuição de Ido Michael em :issue:`37404`.)

source: Added new possibility to use hardlinks for duplicated ``.pyc`` files: *hardlink_dupes* parameter and --hardlink-dupes command line option. (Contributed by Lumír 'Frenzy' Balhar in :issue:`40495`.)
pt_br: Adicionada nova possibilidade de usar hardlinks para arquivos ``.pyc`` duplicados: parâmetro *hardlink_dupes* e opção de linha de comando --hardlink-dupes. (Contribuição de Lumír 'Frenzy' Balhar em :issue:`40495`.)

source: Added new options for path manipulation in resulting ``.pyc`` files: *stripdir*, *prependdir*, *limit_sl_dest* parameters and -s, -p, -e command line options. Added the possibility to specify the option for an optimization level multiple times. (Contributed by Lumír 'Frenzy' Balhar in :issue:`38112`.)
pt_br: Adicionadas novas opções para manipulação de caminho nos arquivos ``.pyc`` resultantes: parâmetros *stripdir*, *prependdir*, *limit_sl_dest* e opções de linha de comando -s, -p, -e. Foi adicionada a possibilidade de especificar a opção para um nível de otimização várias vezes. (Contribuição de Lumír 'Frenzy' Balhar em :issue:`38112`.)

source: Added a new *cancel_futures* parameter to :meth:`concurrent.futures.Executor.shutdown` that cancels all pending futures which have not started running, instead of waiting for them to complete before shutting down the executor. (Contributed by Kyle Stanley in :issue:`39349`.)
pt_br: Adicionado um novo parâmetro *cancel_futures* em :meth:`concurrent.futures.Executor.shutdown` que cancela todos os futuros pendentes que ainda não começaram a ser executados, em vez de esperar que eles sejam concluídos antes de desligar o executor. (Contribuição de Kyle Stanley em :issue:`39349`.)

source: Removed daemon threads from :class:`~concurrent.futures.ThreadPoolExecutor` and :class:`~concurrent.futures.ProcessPoolExecutor`. This improves compatibility with subinterpreters and predictability in their shutdown processes. (Contributed by Kyle Stanley in :issue:`39812`.)
pt_br: Removidos as threads do daemon de :class:`~concurrent.futures.ThreadPoolExecutor` e :class:`~concurrent.futures.ProcessPoolExecutor`. Isso melhora a compatibilidade com subinterpretadores e a previsibilidade em seus processos de desligamento. (Contribuição de Kyle Stanley em :issue:`39812`.)

source: Workers in :class:`~concurrent.futures.ProcessPoolExecutor` are now spawned on demand, only when there are no available idle workers to reuse. This optimizes startup overhead and reduces the amount of lost CPU time to idle workers. (Contributed by Kyle Stanley in :issue:`39207`.)
pt_br: Workers em :class:`~concurrent.futures.ProcessPoolExecutor` agora são gerados sob demanda, apenas quando não há workers ociosos disponíveis para reutilização. Isso otimiza a sobrecarga da inicialização e reduz a quantidade de tempo perdido da CPU para os workers ociosos. (Contribuição de Kyle Stanley em :issue:`39207`.)

source: Added :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, and :func:`curses.set_tabsize` functions. (Contributed by Anthony Sottile in :issue:`38312`.)
pt_br: Adicionadas as funções :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize` e :func:`curses.set_tabsize`. (Contribuição de Anthony Sottile em :issue:`38312`.)

source: The :meth:`~datetime.date.isocalendar` of :class:`datetime.date` and :meth:`~datetime.datetime.isocalendar` of :class:`datetime.datetime` methods now returns a :func:`~collections.namedtuple` instead of a :class:`tuple`. (Contributed by Donghee Na in :issue:`24416`.)
pt_br: Os métodos :meth:`~datetime.date.isocalendar` de :class:`datetime.date` e :meth:`~datetime.datetime.isocalendar` de :class:`datetime.datetime` agora retornam uma :func:`~collections.namedtuple` em vez de uma :class:`tuple`. (Contribuição de Donghee Na em :issue:`24416`.)

source: The :command:`upload` command now creates SHA2-256 and Blake2b-256 hash digests. It skips MD5 on platforms that block MD5 digest. (Contributed by Christian Heimes in :issue:`40698`.)
pt_br: O comando :command:`upload` agora cria digests de hash SHA2-256 e Blake2b-256. Ele pula o MD5 em plataformas que bloqueiam digest do MD5. (Contribuição de Christian Heimes em :issue:`40698`.)

source: Added constants :const:`!fcntl.F_OFD_GETLK`, :const:`!fcntl.F_OFD_SETLK` and :const:`!fcntl.F_OFD_SETLKW`. (Contributed by Donghee Na in :issue:`38602`.)
pt_br: Adicionadas as constantes :const:`!fcntl.F_OFD_GETLK`, :const:`!fcntl.F_OFD_SETLK` e :const:`!fcntl.F_OFD_SETLKW`. (Contribuição de Donghee Na em :issue:`38602`.)

source: :class:`~ftplib.FTP` and :class:`~ftplib.FTP_TLS` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
pt_br: :class:`~ftplib.FTP` e :class:`~ftplib.FTP_TLS` agora levantam a :class:`ValueError` se o tempo limite especificado para o construtor for zero para impedir a criação de um soquete não-bloqueante. (Contribuição de Donghee Na em :issue:`39259`.)

source: When the garbage collector makes a collection in which some objects resurrect (they are reachable from outside the isolated cycles after the finalizers have been executed), do not block the collection of all objects that are still unreachable. (Contributed by Pablo Galindo and Tim Peters in :issue:`38379`.)
pt_br: Quando o coletor de lixo faz uma coleção na qual alguns objetos ressuscitam (são alcançáveis fora dos ciclos isolados após a execução dos finalizadores), não bloqueia a coleção de todos os objetos que ainda estão inacessíveis. (Contribuição de Pablo Galindo e Tim Peters em :issue:`38379`.)

source: Added a new function :func:`gc.is_finalized` to check if an object has been finalized by the garbage collector. (Contributed by Pablo Galindo in :issue:`39322`.)
pt_br: Adicionada uma nova função :func:`gc.is_finalized` para verificar se um objeto foi finalizado pelo coletor de lixo. (Contribuição de Pablo Galindo em :issue:`39322`.)

source: The :mod:`hashlib` module can now use SHA3 hashes and SHAKE XOF from OpenSSL when available. (Contributed by Christian Heimes in :issue:`37630`.)
pt_br: O módulo :mod:`hashlib` pode agora usar hashes SHA3 e SHAKE XOF de OpenSSL quando disponível. (Contribuição de Christian Heimes em :issue:`37630`.)

source: Builtin hash modules can now be disabled with ``./configure --without-builtin-hashlib-hashes`` or selectively enabled with e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` to force use of OpenSSL based implementation. (Contributed by Christian Heimes in :issue:`40479`)
pt_br: Os módulos hash integrados agora podem ser desativados com ``./configure --without-builtin-hashlib-hashes`` ou ativados seletivamente com por exemplo ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` para forçar o uso da implementação baseada em OpenSSL. (Contribuição de Christian Heimes em :issue:`40479`)

source: HTTP status codes ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` and ``425 TOO_EARLY`` are added to :class:`http.HTTPStatus`. (Contributed by Donghee Na in :issue:`39509` and Ross Rhodes in :issue:`39507`.)
pt_br: Códigos de status HTTP ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` e ``425 TOO_EARLY`` foram adicionados a :class:`http.HTTPStatus`. (Contribuição de Donghee Na em :issue:`39509` e Ross Rhodes em :issue:`39507`.)

source: IDLE and idlelib
pt_br: IDLE e idlelib

source: Added option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
pt_br: Adicionada a opção para ativar e desativar o piscar do cursor. (Contribuição de Zackery Spytz na :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
pt_br: A tecla Escape agora fecha as janelas de conclusão IDLE. (Contribuição de Johnny Najera em :issue:`38944`.)

source: Added keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
pt_br: Adicionada argumentos nomeados à lista de completamento de nome de módulo. (Contribuição de Terry J. Reedy em :issue:`37765`.)

source: New in 3.9 maintenance releases
pt_br: Novo nas versões de manutenção 3.9.

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
pt_br: Faz o IDLE invocar :func:`sys.excepthook` (quando iniciado sem '-n'). Ganchos de usuário eram ignorados anteriormente. (Contribuição de Ken Hilton em :issue:`43008`.)

source: The changes above have been backported to 3.8 maintenance releases.
pt_br: As alterações acima foram portadas para versões de manutenção do 3.8.

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
pt_br: Reorganiza a caixa de diálogo de configurações. Divide a aba General nas abas Windows e Shell/Ed. Move as fontes de ajuda, que estendem o menu Help, para a aba Extensions. Abre espaço para novas opções e encurta a caixa de diálogo. O último faz com que o diálogo se ajuste melhor a telas pequenas. (Contribuição de Terry Jan Reedy em :issue:`40468`.) Move a configuração do espaço de recuo da aba Font para a nova aba Windows. (Contribuição de Mark Roseman e Terry Jan Reedy em :issue:`33962`.)

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
pt_br: Aplica realce de sintaxe em arquivos ``.pyi``. (Contribuição de Alex Waygood e Terry Jan Reedy em :issue:`45447`.)

source: :class:`~imaplib.IMAP4` and :class:`~imaplib.IMAP4_SSL` now have an optional *timeout* parameter for their constructors. Also, the :meth:`~imaplib.IMAP4.open` method now has an optional *timeout* parameter with this change. The overridden methods of :class:`~imaplib.IMAP4_SSL` and :class:`~imaplib.IMAP4_stream` were applied to this change. (Contributed by Donghee Na in :issue:`38615`.)
pt_br: :class:`~imaplib.IMAP4` e :class:`~imaplib.IMAP4_SSL` agora possuem o parâmetro opcional *timeout* para seus construtores. Também, o método :meth:`~imaplib.IMAP4.open` agora possui um parâmetro opcional *timeout* com esta alteração. Os métodos substituídos de :class:`~imaplib.IMAP4_SSL` e :class:`~imaplib.IMAP4_stream` foram aplicados nesta alteração. (Contribuição de Dong-hee Na em :issue:`38615`.)

source: :meth:`imaplib.IMAP4.unselect` is added. :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox. (Contributed by Donghee Na in :issue:`40375`.)
pt_br: :meth:`imaplib.IMAP4.unselect` foi adicionado. :meth:`imaplib.IMAP4.unselect` libera os recursos do servidor associados à caixa de correio selecionada e retorna o servidor ao estado autenticado. Este comando executa as mesmas ações que :meth:`imaplib.IMAP4.close`, exceto que nenhuma mensagem é removida permanentemente da caixa de correio selecionada no momento. (Contribuição de Dong-hee Na em :issue:`40375`.)

source: To improve consistency with import statements, :func:`importlib.util.resolve_name` now raises :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts. (Contributed by Ngalim Siregar in :issue:`37444`.)
pt_br: Para melhorar a consistência com as instruções de importação, :func:`importlib.util.resolve_name` agora levanta :exc:`ImportError` em vez de :exc:`ValueError` para tentativas de importação relativas inválidas. (Contribuição de Ngalim Siregar em :issue:`37444`.)

source: Import loaders which publish immutable module objects can now publish immutable packages in addition to individual modules. (Contributed by Dino Viehland in :issue:`39336`.)
pt_br: Carregadores de importação que publicam objetos de módulo imutáveis agora podem publicar pacotes imutáveis além de módulos individuais. (Contribuição de Dino Viehland em :issue:`39336`.)

source: Added :func:`importlib.resources.files` function with support for subdirectories in package data, matching backport in ``importlib_resources`` version 1.5. (Contributed by Jason R. Coombs in :issue:`39791`.)
pt_br: Adicionada a função :func:`importlib.resources.files` com suporte a subdiretórios nos dados do pacote, correspondendo ao backport na versão 1.5 do ``importlib_resources``. (Contribuição de Jason R. Coombs em :issue:`39791`.)

source: Refreshed ``importlib.metadata`` from ``importlib_metadata`` version 1.6.1.
pt_br: Renovado ``importlib.metadata`` de ``importlib_metadata`` versão 1.6.1.

source: :attr:`inspect.BoundArguments.arguments` is changed from ``OrderedDict`` to regular dict. (Contributed by Inada Naoki in :issue:`36350` and :issue:`39775`.)
pt_br: :attr:`inspect.BoundArguments.arguments` foi alterado de ``OrderedDict`` para dict regular. (Contribuição de Inada Naoki em :issue:`36350` e :issue:`39775`.)

source: :mod:`ipaddress` now supports IPv6 Scoped Addresses (IPv6 address with suffix ``%<scope_id>``).
pt_br: :mod:`ipaddress` agora suporta endereços IPv6 com escopo definido (endereço IPv6 com sufixo ``%<scope_id>``).

source: Scoped IPv6 addresses can be parsed using :class:`ipaddress.IPv6Address`. If present, scope zone ID is available through the :attr:`~ipaddress.IPv6Address.scope_id` attribute. (Contributed by Oleksandr Pavliuk in :issue:`34788`.)
pt_br: Os endereços IPv6 com escopo definido podem ser analisados usando :class:`ipaddress.IPv6Address`. Se presente, o ID da zona de escopo está disponível através do atributo :attr:`~ipaddress.IPv6Address.scope_id`. (Contribuição de Oleksandr Pavliuk em :issue:`34788`.)

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. (Contributed by Christian Heimes in :issue:`36384`).
pt_br: A partir do Python 3.9.5, o módulo :mod:`ipaddress` não aceita mais zeros à esquerda em strings de endereço IPv4. (Contribuição de Christian Heimes em :issue:`36384`).

source: Expanded the :func:`math.gcd` function to handle multiple arguments. Formerly, it only supported two arguments. (Contributed by Serhiy Storchaka in :issue:`39648`.)
pt_br: Expandida a função :func:`math.gcd` para manipular vários argumentos. Anteriormente, tinha suporte apenas a dois argumentos. (Contribuição de Serhiy Storchaka em :issue:`39648`.)

source: Added :func:`math.lcm`: return the least common multiple of specified arguments. (Contributed by Mark Dickinson, Ananthakrishnan and Serhiy Storchaka in :issue:`39479` and :issue:`39648`.)
pt_br: Adicionada :func:`math.lcm`: retorna o menor múltiplo comum dos argumentos especificados. (Contribuição de Mark Dickinson, Ananthakrishnan e Serhiy Storchaka em :issue:`39479` e :issue:` 39648`.)

source: Added :func:`math.nextafter`: return the next floating-point value after *x* towards *y*. (Contributed by Victor Stinner in :issue:`39288`.)
pt_br: Adicionada :func:`math.nextafter`: retorna o próximo valor de ponto flutuante após *x* em direção a *y*. (Contribuição de Victor Stinner em :issue:`39288`.)

source: Added :func:`math.ulp`: return the value of the least significant bit of a float. (Contributed by Victor Stinner in :issue:`39310`.)
pt_br: Adicionada :func:`math.ulp`: retorna o valor do bit menos significativo de um ponto flutuante. (Contribuição de Victor Stinner em :issue:`39310`.)

source: The :class:`multiprocessing.SimpleQueue` class has a new :meth:`~multiprocessing.SimpleQueue.close` method to explicitly close the queue. (Contributed by Victor Stinner in :issue:`30966`.)
pt_br: A classe :class:`multiprocessing.SimpleQueue` tem um novo método :meth:`~multiprocessing.SimpleQueue.close` para fechar explicitamente a fila. (Contribuição de Victor Stinner em :issue:`30966`.)

source: :class:`!NNTP` and :class:`!NNTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
pt_br: :class:`!NNTP` e :class:`!NNTP_SSL` agora levantam uma exceção :class:`ValueError` se o tempo limite fornecido ao construtor é zero, para prevenir a criação de um socket não-bloqueante. (Contribuição de Donghee Na em :issue:`39259`.)

source: Added :const:`~os.CLD_KILLED` and :const:`~os.CLD_STOPPED` for :attr:`!si_code`. (Contributed by Donghee Na in :issue:`38493`.)
pt_br: Adicionadas as constantes :const:`~os.CLD_KILLED` e :const:`~os.CLD_STOPPED` para :attr:`!si_code`. (Contribuição de Donghee Na em :issue:`38493`.)

source: Exposed the Linux-specific :func:`os.pidfd_open` (:issue:`38692`) and :const:`os.P_PIDFD` (:issue:`38713`) for process management with file descriptors.
pt_br: Exposta :func:`os.pidfd_open` específica do Linux (:issue:`38692`) e :const:`os.P_PIDFD` (:issue:`38713`) para gerenciamento de processos com descritores de arquivo.

source: The :func:`os.unsetenv` function is now also available on Windows. (Contributed by Victor Stinner in :issue:`39413`.)
pt_br: A função :func:`os.unsetenv` agora também está disponível no Windows. (Contribuição de Victor Stinner em :issue:`39413`.)

source: The :func:`os.putenv` and :func:`os.unsetenv` functions are now always available. (Contributed by Victor Stinner in :issue:`39395`.)
pt_br: As funções :func:`os.putenv` e :func:`os.unsetenv` estão agora sempre disponíveis. (Contribuição de Victor Stinner em :issue:`39395`.)

source: Added :func:`os.waitstatus_to_exitcode` function: convert a wait status to an exit code. (Contributed by Victor Stinner in :issue:`40094`.)
pt_br: Adicionada a função :func:`os.waitstatus_to_exitcode`: converte um status de espera em um código de saída. (Contribuição de Victor Stinner em :issue:`40094`.)

source: Added :meth:`pathlib.Path.readlink` which acts similarly to :func:`os.readlink`. (Contributed by Girts Folkmanis in :issue:`30618`)
pt_br: Adicionado :meth:`pathlib.Path.readlink`, que age de maneira semelhante a :func:`os.readlink`. (Contribuição de Girts Folkmanis em :issue:`30618`)

source: On Windows now :class:`~pdb.Pdb` supports ``~/.pdbrc``. (Contributed by Tim Hopper and Dan Lidral-Porter in :issue:`20523`.)
pt_br: No Windows, agora :class:`~pdb.Pdb` tem suporte a ``~/.pdbrc``. (Contribuição de Tim Hopper e Dan Lidral-Porter em :issue:`20523`.)

source: :class:`~poplib.POP3` and :class:`~poplib.POP3_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
pt_br: :class:`~poplib.POP3` e :class:`~poplib.POP3_SSL` agora levantam a :class:`ValueError` se o tempo limite especificado para o construtor for zero para impedir a criação de um soquete sem bloqueio. (Contribuição de Donghee Na em :issue:`39259`.)

source: :mod:`pprint` can now pretty-print :class:`types.SimpleNamespace`. (Contributed by Carl Bordum Hansen in :issue:`37376`.)
pt_br: :mod:`pprint` agora pode imprimir :class:`types.SimpleNamespace`. (Contribuição de Carl Bordum Hansen em :issue:`37376`.)

source: The documentation string is now shown not only for class, function, method etc, but for any object that has its own :attr:`~definition.__doc__` attribute. (Contributed by Serhiy Storchaka in :issue:`40257`.)
pt_br: A string de documentação agora é mostrada não apenas para classe, função, método etc, mas para qualquer objeto que tenha seu próprio atributo :attr:`~definition.__doc__`. (Contribuição de Serhiy Storchaka em :issue:`40257`.)

source: Added a new :meth:`random.Random.randbytes` method: generate random bytes. (Contributed by Victor Stinner in :issue:`40286`.)
pt_br: Adicionado um novo método :meth:`random.Random.randbytes`: gera bytes aleatórios. (Contribuição de Victor Stinner em :issue:`40286`.)
