Repository: python/python-docs-pt-br
Catalog: tutorial/classes.po
Languages: pt_br

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
pt_br: Não há nada de especial sobre instanciação de classes derivadas: ``NomeClasseDerivada()`` cria uma nova instância da classe. Referências a métodos são resolvidas da seguinte forma: o atributo correspondente é procurado através da cadeia de classes base, e referências a métodos são válidas se essa procura produzir um objeto função.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
pt_br: Classes derivadas podem sobrescrever métodos das suas classes base. Uma vez que métodos não possuem privilégios especiais quando invocam outros métodos no mesmo objeto, um método na classe base que invoca um outro método da mesma classe base pode, efetivamente, acabar invocando um método sobreposto por uma classe derivada. (Para programadores C++ isso significa que todos os métodos em Python são realmente ``virtuais``.)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
pt_br: Um método sobrescrito em uma classe derivada, de fato, pode querer estender, em vez de simplesmente substituir, o método da classe base, de mesmo nome. Existe uma maneira simples de chamar diretamente o método da classe base: apenas chame ``BaseClassName.methodname(self, arguments)``. Isso é geralmente útil para os clientes também. (Note que isto só funciona se a classe base estiver acessível como ``BaseClassName`` no escopo global).

source: Python has two built-in functions that work with inheritance:
pt_br: Python tem duas funções embutidas que trabalham com herança:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
pt_br: Use :func:`isinstance` para verificar o tipo de uma instância: ``isinstance(obj, int)`` será ``True`` somente se ``obj.__class__`` é a classe :class:`int` ou alguma classe derivada de :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
pt_br: Use :func:`issubclass` para verificar herança entre classes: ``issubclass(bool, int)`` é ``True`` porque :class:`bool` é uma subclasse de :class:`int`. Porém, ``issubclass(float, int)`` é ``False`` porque :class:`float` não é uma subclasse de :class:`int`.

source: Multiple Inheritance
pt_br: Herança múltipla

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
pt_br: Python também suporta uma forma de herança múltipla. Uma definição de classe com várias classes bases tem esta forma::

source: class DerivedClassName(Base1, Base2, Base3): <statement-1> . . . <statement-N>
pt_br: class NomeClasseDerivada(Base1, Base2, Base3): <instrução-1> . . . <instrução-N>

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`!DerivedClassName`, it is searched for in :class:`!Base1`, then (recursively) in the base classes of :class:`!Base1`, and if it was not found there, it was searched for in :class:`!Base2`, and so on.
pt_br: Para a maioria dos casos mais simples, pense na pesquisa de atributos herdados de uma classe pai como o primeiro nível de profundidade, da esquerda para a direita, não pesquisando duas vezes na mesma classe em que há uma sobreposição na hierarquia. Assim, se um atributo não é encontrado em :class:`!DerivedClassName`, é procurado em :class:`!Base1`, depois, recursivamente, nas classes base de :class:`!Base1`, e se não for encontrado lá, é pesquisado em :class:`!Base2` e assim por diante.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
pt_br: De fato, é um pouco mais complexo que isso; a ordem de resolução de métodos muda dinamicamente para suportar chamadas cooperativas para :func:`super`. Essa abordagem é conhecida em outras linguagens de herança múltipla como chamar-o-próximo-método, e é mais poderosa que a chamada à função super, encontrada em linguagens de herança única.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see :ref:`python_2.3_mro`.
pt_br: A ordenação dinâmica é necessária porque todos os casos de herança múltipla exibem um ou mais relacionamentos de diamante (em que pelo menos uma das classes bases pode ser acessada por meio de vários caminhos da classe mais inferior). Por exemplo, todas as classes herdam de :class:`object`, portanto, qualquer caso de herança múltipla fornece mais de um caminho para alcançar :class:`object`. Para evitar que as classes base sejam acessadas mais de uma vez, o algoritmo dinâmico lineariza a ordem de pesquisa, de forma a preservar a ordenação da esquerda para a direita, especificada em cada classe, que chama cada pai apenas uma vez, e que é monotônica (significando que uma classe pode ser subclassificada sem afetar a ordem de precedência de seus pais). Juntas, essas propriedades tornam possível projetar classes confiáveis e extensíveis com herança múltipla. Para mais detalhes, veja :ref:`python_2.3_mro`.

source: Private Variables
pt_br: Variáveis privadas

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
pt_br: Variáveis de instância "privadas", que não podem ser acessadas, exceto em métodos do próprio objeto, não existem em Python. No entanto, existe uma convenção que é seguida pela maioria dos programas em Python: um nome prefixado com um sublinhado (por exemplo: ``_spam`` ) deve ser tratado como uma parte não-pública da API (seja uma função, um método ou um atributo de dados). Tais nomes devem ser considerados um detalhe de implementação e sujeito a alteração sem aviso prévio.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
pt_br: Uma vez que existe um caso de uso válido para a definição de atributos privados em classes (especificamente para evitar conflitos com nomes definidos em subclasses), existe um suporte limitado a identificadores privados em classes, chamado :dfn:`desfiguração de nomes`. Qualquer identificador no formato ``__spam`` (pelo menos dois sublinhados no início, e no máximo um sublinhado no final) é textualmente substituído por ``_classname__spam``, onde ``classname`` é o nome da classe atual com sublinhado(s) iniciais omitidos. Essa desfiguração independe da posição sintática do identificador, desde que ele apareça dentro da definição de uma classe.

source: The :ref:`private name mangling specifications <private-name-mangling>` for details and special cases.
pt_br: O :ref:`especificações de desfiguração de nome privado <private-name-mangling>` para detalhes e casos especiais.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
pt_br: A desfiguração de nomes é útil para que subclasses possam sobrescrever métodos sem quebrar invocações de métodos dentro de outra classe. Por exemplo::

source: class Mapping: def __init__(self, iterable): self.items_list = [] self.__update(iterable) def update(self, iterable): for item in iterable: self.items_list.append(item) __update = update # private copy of original update() method class MappingSubclass(Mapping): def update(self, keys, values): # provides new signature for update() # but does not break __init__() for item in zip(keys, values): self.items_list.append(item)
pt_br: class Mapeamento: def __init__(self, iterável): self.lista_itens = [] self.__atualizar(iterável) def atualizar(self, iterável): for item in iterável: self.lista_itens.append(item) __atualizar = atualizar # cópia privada do método atualizar() original class SubclasseMapeamento(Mapeamento): def update(self, chaves, valores): # fornece nova assinatura para atualizar(), # mas não quebra __init__() for item in zip(chaves, valores): self.lista_itens.append(item)

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
pt_br: O exemplo acima deve funcionar mesmo se ``SubclasseMapeamento`` introduzisse um identificador ``__atualizar`` uma vez que é substituído por ``_Mapeamento__atualizar`` na classe ``Mapeamento`` e ``_SubclasseMapeamento__atualizar`` na classe ``SubclasseMapeamento``, respectivamente.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
pt_br: Note que as regras de desfiguração de nomes foram projetadas para evitar acidentes; ainda é possível acessar ou modificar uma variável que é considerada privada. Isso pode ser útil em certas circunstâncias especiais, como depuração de código.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
pt_br: Código passado para ``exec()`` ou ``eval()`` não considera o nome da classe que invocou como sendo a classe corrente; isso é semelhante ao funcionamento da instrução ``global``, cujo efeito se aplica somente ao código que é compilado junto. A mesma restrição se aplica às funções ``getattr()``, ``setattr()`` e ``delattr()``, e quando acessamos diretamente o ``__dict__`` da classe.

source: Odds and Ends
pt_br: Curiosidades e conclusões

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. The idiomatic approach is to use :mod:`dataclasses` for this purpose::
pt_br: Às vezes, é útil ter um tipo semelhante ao "record" de Pascal ou ao "struct" de C, para agrupar alguns itens de dados. A maneira pythônica para este fim é usar :mod:`dataclasses`::

source: from dataclasses import dataclass @dataclass class Employee: name: str dept: str salary: int
pt_br: from dataclasses import dataclass @dataclass class Empregado: nome: str dept: str salário: int

source: >>> john = Employee('john', 'computer lab', 1000) >>> john.dept 'computer lab' >>> john.salary 1000
pt_br: >>> joão = Empregado('joão', 'lab de computadores', 1000) >>> joão.dept 'lab de computadores' >>> joão.salário 1000

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` that get the data from a string buffer instead, and pass it as an argument.
pt_br: Um trecho de código Python que espera um tipo de dado abstrato em particular, pode receber, ao invés disso, uma classe que imita os métodos que aquele tipo suporta. Por exemplo, se você tem uma função que formata dados obtidos de um objeto do tipo "arquivo", pode definir uma classe com métodos :meth:`~io.TextIOBase.read` e :meth:`~io.TextIOBase.readline` que obtém os dados de um "buffer de caracteres" e passar como argumento.

source: :ref:`Instance method objects <instance-methods>` have attributes, too: :attr:`m.__self__ <method.__self__>` is the instance object with the method :meth:`!m`, and :attr:`m.__func__ <method.__func__>` is the :ref:`function object <user-defined-funcs>` corresponding to the method.
pt_br: :ref:`Métodos de instância <instance-methods>` têm atributos também: :attr:`m.__self__ <method.__self__>` é o objeto instância com o método :meth:`!m`, e :attr:`m.__func__ <method.__func__>` é o :ref:`objeto função <user-defined-funcs>` correspondente ao método.

source: Iterators
pt_br: Iteradores

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
pt_br: Você já deve ter notado que pode usar laços :keyword:`for` com a maioria das coleções em Python::

source: for element in [1, 2, 3]: print(element) for element in (1, 2, 3): print(element) for key in {'one':1, 'two':2}: print(key) for char in "123": print(char) for line in open("myfile.txt"): print(line, end='')
pt_br: for elemento in [1, 2, 3]: print(elemento) for elemento in (1, 2, 3): print(elemento) for chave in {'um':1, 'dois':2}: print(chave) for char in "123": print(char) for linha in open("meuarquivo.txt"): print(linha, end='')

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
pt_br: Esse estilo de acesso é claro, conciso e conveniente. O uso de iteradores permeia e unifica o Python. Nos bastidores, a instrução :keyword:`for` chama :func:`iter` no objeto contêiner. A função retorna um objeto iterador que define o método :meth:`~iterator.__next__` que acessa elementos no contêiner, um de cada vez. Quando não há mais elementos, :meth:`~iterator.__next__` levanta uma exceção :exc:`StopIteration` que informa ao :keyword:`!for` para terminar. Você pode chamar o método :meth:`~iterator.__next__` usando a função embutida :func:`next`; este exemplo mostra como tudo funciona::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`~container.__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`!__next__`, then :meth:`!__iter__` can just return ``self``::
pt_br: Observando o mecanismo por trás do protocolo dos iteradores, fica fácil adicionar esse comportamento às suas classes. Defina um método :meth:`~container.__iter__` que retorna um objeto que tenha um método :meth:`~iterator.__next__`. Se uma classe já define :meth:`!__next__`, então :meth:`!__iter__` pode simplesmente retornar ``self``::

source: class Reverse: """Iterator for looping over a sequence backwards.""" def __init__(self, data): self.data = data self.index = len(data) def __iter__(self): return self def __next__(self): if self.index == 0: raise StopIteration self.index = self.index - 1 return self.data[self.index]
pt_br: class Inverter: """Iterador para fazer um laço em uma sequência de trás para frente.""" def __init__(self, dados): self.dados = dados self.índice = len(dados) def __iter__(self): return self def __next__(self): if self.índice == 0: raise StopIteration self.índice = self.índice - 1 return self.dados[self.índice]

source: >>> rev = Reverse('spam') >>> iter(rev) <__main__.Reverse object at 0x00A1DB50> >>> for char in rev: ... print(char) ... m a p s
pt_br: >>> rev = Interverter('spam') >>> iter(rev) <__main__.Interverter object at 0x00A1DB50> >>> for char in rev: ... print(char) ... m a p s

source: Generators
pt_br: Geradores

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
pt_br: :term:`Geradores <generator>` são uma ferramenta simples e poderosa para criar iteradores. São escritos como funções normais mas usam a instrução :keyword:`yield` quando precisam retornar dados. Cada vez que :func:`next` é chamado, o gerador volta ao ponto onde parou (lembrando todos os valores de dados e qual instrução foi executada pela última vez). Um exemplo mostra como geradores podem ser trivialmente fáceis de criar::

source: def reverse(data): for index in range(len(data)-1, -1, -1): yield data[index]
pt_br: def inverter(dados): for índice in range(len(dados)-1, -1, -1): yield dados[índice]

source: >>> for char in reverse('golf'): ... print(char) ... f l o g
pt_br: >>> for char in inverter('golf'): ... print(char) ... f l o g

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`~iterator.__iter__` and :meth:`~generator.__next__` methods are created automatically.
pt_br: Qualquer coisa que possa ser feita com geradores também pode ser feita com iteradores baseados numa classe, como descrito na seção anterior. O que torna geradores tão compactos é que os métodos :meth:`~iterator.__iter__` e :meth:`~generator.__next__` são criados automaticamente.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
pt_br: Outro ponto chave é que as variáveis locais e o estado da execução são preservados automaticamente entre as chamadas. Isto torna a função mais fácil de escrever e muito mais clara do que uma implementação usando variáveis de instância como ``self.index`` e ``self.data``.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
pt_br: Além disso, quando geradores terminam, eles levantam :exc:`StopIteration` automaticamente. Combinados, todos estes aspectos tornam a criação de iteradores tão fácil quanto escrever uma função normal.

source: Generator Expressions
pt_br: Expressões geradoras

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
pt_br: Alguns geradores simples podem ser codificados, de forma sucinta, como expressões, usando uma sintaxe semelhante a compreensões de lista, mas com parênteses em vez de colchetes. Essas expressões são projetadas para situações em que o gerador é usado imediatamente, pela função que o engloba. As expressões geradoras são mais compactas, mas menos versáteis do que as definições completas do gerador, e tendem a usar menos memória do que as compreensões de lista equivalentes.

source: Examples::
pt_br: Exemplos::

source: >>> sum(i*i for i in range(10)) # sum of squares 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # dot product 260 >>> unique_words = set(word for line in page for word in line.split()) >>> valedictorian = max((student.gpa, student.name) for student in graduates) >>> data = 'golf' >>> list(data[i] for i in range(len(data)-1, -1, -1)) ['f', 'l', 'o', 'g']
pt_br: >>> sum(i*i for i in range(10)) # soma dos quadrados 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # produto escalar 260 >>> palavras_únicas = set(palavra for linha página for palavra in linha.split()) >>> orador_da_turma = max((estudante.gpa, estudante.nome) for estudante in graduados) >>> dados = 'golf' >>> list(dados[i] for i in range(len(dados)-1, -1, -1)) ['f', 'l', 'o', 'g']

source: Footnotes
pt_br: Notas de rodapé
