Repository: python/python-docs-pt-br
Catalog: tutorial/classes.po
Languages: pt_br

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`!ClassName` in the example).
pt_br: Quando uma definição de classe é finalizada normalmente (até o fim), um *objeto classe* é criado. Este objeto encapsula o conteúdo do espaço de nomes criado pela definição da classe; aprenderemos mais sobre objetos classe na próxima seção. O escopo local (que estava vigente antes da definição da classe) é reativado, e o objeto classe é vinculado ao identificador da classe nesse escopo (:class:`!NomeClasse` no exemplo).

source: Class Objects
pt_br: Objetos classe

source: Class objects support two kinds of operations: attribute references and instantiation.
pt_br: Objetos classe suportam dois tipos de operações: *referências a atributos* e *instanciação*.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
pt_br: *Referências a atributos* de classe utilizam a sintaxe padrão utilizada para quaisquer referências a atributos em Python: ``obj.nome``. Nomes de atributos válidos são todos os nomes presentes dentro do espaço de nomes da classe, quando o objeto classe foi criado. Portanto, se a definição de classe tem esta forma::

source: class MyClass: """A simple example class""" i = 12345 def f(self): return 'hello world'
pt_br: class MinhaClasse: """Um exemplo de classe simples""" i = 12345 def f(self): return 'olá mundo'

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`~type.__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
pt_br: então ``MinhaClasse.i`` e ``MinhaClasse.f`` são referências a atributo válidas, retornando, respectivamente, um inteiro e um objeto função. Atributos de classe podem receber valores, pode-se modificar o valor de ``MinhaClasse.i`` num atribuição. :attr:`~type.__doc__` também é um atributo válido da classe, retornando a docstring associada à classe: ``"Um exemplo de classe simples"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
pt_br: Para *instanciar* uma classe, usa-se a mesma sintaxe de invocar uma função. Apenas finja que o objeto classe do exemplo é uma função sem parâmetros, que devolve uma nova instância da classe. Por exemplo (presumindo a classe acima)::

source: x = MyClass()
pt_br: x = MinhaClasse()

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
pt_br: cria uma nova *instância* da classe e atribui o objeto resultante à variável local ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`~object.__init__`, like this::
pt_br: A operação de instanciação ("invocar" um objeto classe) cria um objeto vazio. Muitas classes preferem criar novos objetos com um estado inicial predeterminado. Para tanto, a classe pode definir um método especial chamado :meth:`~object.__init__`, assim::

source: When a class defines an :meth:`~object.__init__` method, class instantiation automatically invokes :meth:`!__init__` for the newly created class instance. So in this example, a new, initialized instance can be obtained by::
pt_br: Quando uma classe define um método :meth:`~object.__init__`, o processo de instanciação automaticamente invoca :meth:`!__init__` sobre a instância recém criada. Em nosso exemplo, uma nova instância já inicializada pode ser obtida desta maneira::

source: Of course, the :meth:`~object.__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`!__init__`. For example, ::
pt_br: Naturalmente, o método :meth:`~object.__init__` pode ter parâmetros para maior flexibilidade. Neste caso, os argumentos fornecidos na invocação da classe serão passados para o método :meth:`!__init__`. Por exemplo, ::

source: Instance Objects
pt_br: Objetos instância

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
pt_br: Agora o que podemos fazer com objetos de instância? As únicas operações compreendidas por objetos de instância são os atributos de referência. Existem duas maneiras válidas para nomear atributos: atributos de dados e métodos.

source: *Data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`!MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
pt_br: *Atributos de dados* correspondem a "variáveis de instância" em Smalltalk, e a "membros de dados" em C++. Atributos de dados não precisam ser declarados. Assim como variáveis locais, eles passam a existir na primeira vez em que é feita uma atribuição. Por exemplo, se ``x`` é uma instância da :class:`!MinhaClasse` criada acima, o próximo trecho de código irá exibir o valor ``16``, sem deixar nenhum rastro::

source: x.counter = 1 while x.counter < 10: x.counter = x.counter * 2 print(x.counter) del x.counter
pt_br: x.contador = 1 while x.contador < 10: x.contador = x.contador * 2 print(x.contador) del x.contador

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object.
pt_br: O outro tipo de referência a um atributo de instância é um *método*. Um método é uma função que "pertence a" um objeto.

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
pt_br: Nomes de métodos válidos de uma instância dependem de sua classe. Por definição, cada atributo de uma classe que é uma função corresponde a um método das instâncias. Em nosso exemplo, ``x.f`` é uma referência de método válida já que ``MinhaClasse.f`` é uma função, enquanto ``x.i`` não é, já que ``MinhaClasse.i`` não é uma função. Entretanto, ``x.f`` não é o mesmo que ``MinhaClasse.f``. A referência ``x.f`` acessa um objeto método e a ``MinhaClasse.f`` acessa um objeto função.

source: Method Objects
pt_br: Objetos método

source: Usually, a method is called right after it is bound::
pt_br: Normalmente, um método é chamado imediatamente após ser referenciado::

source: will continue to print ``hello world`` until the end of time.
pt_br: exibirá o texto ``olá mundo`` até o mundo acabar.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`!f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
pt_br: O que ocorre precisamente quando um método é invocado? Você deve ter notado que ``x.f()`` foi chamado sem nenhum argumento, porém a definição da função :meth:`!f` especificava um argumento. O que aconteceu com esse argumento? Certamente Python levanta uma exceção quando uma função que declara um argumento é invocada sem nenhum argumento --- mesmo que o argumento não seja usado no corpo da função...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
pt_br: Na verdade, pode-se supor a resposta: a particularidade sobre os métodos é que o objeto da instância é passado como o primeiro argumento da função. Em nosso exemplo, a chamada ``x.f()`` é exatamente equivalente a ``MinhaClasse.f(x)``. Em geral, chamar um método com uma lista de *n* argumentos é equivalente a chamar a função correspondente com uma lista de argumentos que é criada inserindo o objeto de instância do método antes do primeiro argumento.

source: In general, methods work as follows. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, references to both the instance object and the function object are packed into a method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
pt_br: Em geral, os métodos funcionam da seguinte forma. Quando um atributo de uma instância, não relacionado a dados, é referenciado, a classe da instância é pesquisada. Se o nome é um atributo de classe válido que é um objeto função, referências ao objeto de instância e ao objeto função serão empacotadas em um objeto método. Quando o objeto método é chamado com uma lista de argumentos, uma nova lista de argumentos é construída a partir do objeto de instância e da lista de argumentos, e o objeto função é chamado com essa nova lista de argumentos.

source: Class and Instance Variables
pt_br: Variáveis de classe e instância

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
pt_br: De forma geral, variáveis de instância são variáveis que indicam dados que são únicos a cada instância individual, e variáveis de classe são variáveis de atributos e de métodos que são comuns a todas as instâncias de uma classe::

source: class Dog: kind = 'canine' # class variable shared by all instances def __init__(self, name): self.name = name # instance variable unique to each instance >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.kind # shared by all dogs 'canine' >>> e.kind # shared by all dogs 'canine' >>> d.name # unique to d 'Fido' >>> e.name # unique to e 'Buddy'
pt_br: class Cachorro: tipo = 'canino' # variável de classe compartilhada por todas as instâncias def __init__(self, nome): self.nome = nome # variável de instância única para cada instância >>> d = Cachorro('Fido') >>> e = Cachorro('Buddy') >>> d.tipo # compartilhada por todos os cachorros 'canino' >>> e.tipo # compartilhada por todos os cachorros 'canino' >>> d.nome # exclusiva do d 'Fido' >>> e.nome # exclusiva do e 'Buddy'

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
pt_br: Como vimos em :ref:`tut-object`, dados compartilhados podem causar efeitos inesperados quando envolvem objetos (:term:`mutáveis <mutável>`), como listas ou dicionários. Por exemplo, a lista *tricks* do código abaixo não deve ser usada como variável de classe, pois assim seria compartilhada por todas as instâncias de *Cachorro*::

source: class Dog: tricks = [] # mistaken use of a class variable def __init__(self, name): self.name = name def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks # unexpectedly shared by all dogs ['roll over', 'play dead']
pt_br: class Cachorro: truques = [] # uso incorreto de uma variável de classe def __init__(self, nome): self.nome = nome def adicionar_truque(self, truque): self.truques.append(truque) >>> d = Cachorro('Fido') >>> e = Cachorro('Buddy') >>> d.adicionar_truque('rolar') >>> e.adicionar_truque('fingir de morto') >>> d.truques # inesperadamente compartilhado por todos os cães ['rolar', 'fingir de morto']

source: Correct design of the class should use an instance variable instead::
pt_br: Em vez disso, o modelo correto da classe deve usar uma variável de instância::

source: class Dog: def __init__(self, name): self.name = name self.tricks = [] # creates a new empty list for each dog def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks ['roll over'] >>> e.tricks ['play dead']
pt_br: class Cachorro: def __init__(self, nome): self.nome = nome self.truques = [] # cria uma nova lista vazia para cada cachorro def adicionar_truque(self, truque): self.truques.append(truque) >>> d = Cachorro('Fido') >>> e = Cachorro('Buddy') >>> d.adicionar_truque('rolar') >>> e.adicionar_truque('fingir de morto') >>> d.truques ['rolar'] >>> e.truques ['fingir de morto']

source: Random Remarks
pt_br: Observações aleatórias

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
pt_br: Se um mesmo nome de atributo ocorre tanto na instância quanto na classe, a busca pelo atributo prioriza a instância::

source: >>> class Warehouse: ... purpose = 'storage' ... region = 'west' ... >>> w1 = Warehouse() >>> print(w1.purpose, w1.region) storage west >>> w2 = Warehouse() >>> w2.region = 'east' >>> print(w2.purpose, w2.region) storage east
pt_br: >>> class Armazém: ... propósito = 'armazenar' ... região = 'oeste' ... >>> a1 = Armazém() >>> print(a1.propósito, a1.região) armazenar oeste >>> a2 = Armazém() >>> a2.região = 'leste' >>> print(a2.propósito, a2.região) armazenar leste

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
pt_br: Atributos de dados podem ser referenciados por métodos da própria instância, bem como por qualquer outro usuário do objeto (também chamados "clientes" do objeto). Em outras palavras, classes não servem para implementar tipos puramente abstratos de dados. De fato, nada em Python torna possível assegurar o encapsulamento de dados --- tudo é baseado em convenção. (Por outro lado, a implementação de Python, escrita em C, pode esconder completamente detalhes de um objeto e controlar o acesso ao objeto, se necessário; isto pode ser utilizado por extensões de Python escritas em C.)

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
pt_br: Clientes devem utilizar atributos de dados com cuidado, pois podem bagunçar invariantes assumidas pelos métodos ao esbarrar em seus atributos de dados. Note que clientes podem adicionar atributos de dados a suas próprias instâncias, sem afetar a validade dos métodos, desde que seja evitado o conflito de nomes. Novamente, uma convenção de nomenclatura poupa muita dor de cabeça.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
pt_br: Não existe atalho para referenciar atributos de dados (ou outros métodos!) de dentro de um método. Isso aumenta a legibilidade dos métodos: não há como confundir variáveis locais com variáveis da instância quando lemos rapidamente um método.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
pt_br: Frequentemente, o primeiro argumento de um método é chamado ``self``. Isso não passa de uma convenção: o identificador ``self`` não é uma palavra reservada nem possui qualquer significado especial em Python. Mas note que, ao seguir essa convenção, seu código se torna legível por uma grande comunidade de desenvolvedores Python e é possível que alguma *IDE* dependa dessa convenção para analisar seu código.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
pt_br: Qualquer objeto função que é atributo de uma classe, define um método para as instâncias dessa classe. Não é necessário que a definição da função esteja textualmente embutida na definição da classe. Atribuir um objeto função a uma variável local da classe é válido. Por exemplo::

source: # Function defined outside the class def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'hello world' h = g
pt_br: # Função definida fora da classe def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'olá mundo' h = g

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`!C` that refer to function objects, and consequently they are all methods of instances of :class:`!C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
pt_br: Agora ``f``, ``g`` e ``h`` são todos atributos da classe :class:`!C` que referenciam funções, e consequentemente são todos métodos de instâncias da classe :class:`!C`, onde ``h`` é exatamente equivalente a ``g``. No entanto, essa prática serve apenas para confundir o leitor do programa.

source: Methods may call other methods by using method attributes of the ``self`` argument::
pt_br: Métodos podem invocar outros métodos usando atributos de método do argumento ``self``::

source: class Bag: def __init__(self): self.data = [] def add(self, x): self.data.append(x) def addtwice(self, x): self.add(x) self.add(x)
pt_br: class Bolsa: def __init__(self): self.data = [] def adicionar(self, x): self.data.append(x) def adicionar_em_dobro(self, x): self.adicionar(x) self.adicionar(x)

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
pt_br: Métodos podem referenciar nomes globais da mesma forma que funções comuns. O escopo global associado a um método é o módulo contendo sua definição na classe (a classe propriamente dita nunca é usada como escopo global!). Ainda que seja raro justificar o uso de dados globais em um método, há diversos usos legítimos do escopo global. Por exemplo, funções e módulos importados no escopo global podem ser usados por métodos, bem como as funções e classes definidas no próprio escopo global. Provavelmente, a classe contendo o método em questão também foi definida neste escopo global. Na próxima seção veremos razões pelas quais um método pode querer referenciar sua própria classe.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
pt_br: Cada valor é um objeto e, portanto, tem uma *classe* (também chamada de *tipo*). Ela é armazenada como ``object.__class__``.

source: Inheritance
pt_br: Herança

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
pt_br: Obviamente, uma característica da linguagem não seria digna do nome "classe" se não suportasse herança. A sintaxe para uma classe derivada é assim::

source: class DerivedClassName(BaseClassName): <statement-1> . . . <statement-N>
pt_br: class NomeClasseDerivada(NomeClasseBase): <instrução-1> . . . <instrução-N>

source: The name :class:`!BaseClassName` must be defined in a namespace accessible from the scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
pt_br: O identificador :class:`!BaseClassName` deve estar definido em um espaço de nomes acessível do escopo que contém a definição da classe derivada. No lugar do nome da classe base, também são aceitas outras expressões. Isso é muito útil, por exemplo, quando a classe base é definida em outro módulo::

source: class DerivedClassName(modname.BaseClassName):
pt_br: class NomeClasseDerivada(nomemódulo.NomeClasseBase):

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
pt_br: A execução de uma definição de classe derivada procede da mesma forma que a de uma classe base. Quando o objeto classe é construído, a classe base é lembrada. Isso é utilizado para resolver referências a atributos. Se um atributo requisitado não for encontrado na classe, ele é procurado na classe base. Essa regra é aplicada recursivamente se a classe base por sua vez for derivada de outra.
