Repository: python/python-docs-pt-br
Catalog: tutorial/classes.po
Languages: pt_br

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name ``__dict__`` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
pt_br: Exceto por uma coisa. Os objetos módulo têm um atributo secreto e somente para leitura chamado :attr:`~object.__dict__` que retorna o dicionário usado para implementar o espaço de nomes do módulo; o nome ``__dict__`` é um atributo, mas não um nome global. Obviamente, usar isso viola a abstração da implementação do espaço de nomes, e deve ser restrito a coisas como depuradores post-mortem.

source: object
pt_br: objeto

source: method
pt_br: método

source: name
pt_br: nome

source: mangling
pt_br: desfiguração
