Repository: python/python-docs-pt-br
Catalog: tutorial/controlflow.po
Languages: pt_br

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
pt_br: Agora que está prestes a escrever códigos mais longos e complexos em Python, é um bom momento para falar sobre *estilo de codificação*. A maioria das linguagens podem ser escritas (ou *formatadas*) em diferentes estilos; alguns são mais legíveis do que outros. Tornar o seu código mais fácil de ler, para os outros, é sempre uma boa ideia, e adotar um estilo de codificação agradável ajuda bastante.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
pt_br: Em Python, a :pep:`8` tornou-se o guia de estilo adotado pela maioria dos projetos; promove um estilo de codificação muito legível e visualmente agradável. Todo desenvolvedor Python deve lê-lo em algum momento; eis os pontos mais importantes, selecionados para você:

source: Use 4-space indentation, and no tabs.
pt_br: Use indentação com 4 espaços, e não use tabulações.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
pt_br: 4 espaços são um bom meio termo entre indentação estreita (permite maior profundidade de aninhamento) e indentação larga (mais fácil de ler). Tabulações trazem complicações, e o melhor é não usar.

source: Wrap lines so that they don't exceed 79 characters.
pt_br: Quebre as linhas de modo que não excedam 79 caracteres.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
pt_br: Isso ajuda os usuários com telas pequenas e torna possível abrir vários arquivos de código lado a lado em telas maiores.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
pt_br: Deixe linhas em branco para separar funções e classes, e blocos de código dentro de funções.

source: When possible, put comments on a line of their own.
pt_br: Quando possível, coloque comentários em uma linha própria.

source: Use docstrings.
pt_br: Escreva strings de documentação.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
pt_br: Use espaços ao redor de operadores e após vírgulas, mas não diretamente dentro de parênteses, colchetes e chaves: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
pt_br: Nomeie suas classes e funções de forma consistente; a convenção é usar ``MaiusculoCamelCase`` para classes e ``minusculo_com_sublinhado`` para funções e métodos. Sempre use ``self`` como o nome para o primeiro argumento dos métodos (veja :ref:`tut-firstclasses` para mais informações sobre classes e métodos).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
pt_br: Não use codificações exóticas se o seu código é feito para ser usado em um contexto internacional. O padrão do Python, UTF-8, ou mesmo ASCII puro funciona bem em qualquer caso.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
pt_br: Da mesma forma, não use caracteres não-ASCII em identificadores se houver apenas a menor chance de pessoas falando um idioma diferente ler ou manter o código.

source: Footnotes
pt_br: Notas de rodapé

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
pt_br: Na verdade, *passagem por referência para objeto* seria uma descrição melhor, pois, se um objeto mutável for passado, quem chamou verá as alterações feitas por quem foi chamado (por exemplo, a inclusão de itens em uma lista).

source: statement
pt_br: instrução

source: ellipsis literal
pt_br: literal de reticências

source: documentation strings
pt_br: strings, documentação

source: strings, documentation
pt_br: strings, documentação

source: * (asterisk)
pt_br: * (asterisco)

source: in function calls
pt_br: em chamadas de função

source: function
pt_br: função

source: function annotations
pt_br: anotações de função

source: : (colon)
pt_br: : (dois pontos)

source: coding
pt_br: codificação

source: style
pt_br: estilo
