Repository: python/python-docs-pt-br
Catalog: tutorial/controlflow.po
Languages: pt_br

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
pt_br: Por padrão, argumentos podem ser passadas para uma função Python tanto por posição quanto explicitamente pelo nome. Para uma melhor legibilidade e desempenho, faz sentido restringir a maneira pelo qual argumentos possam ser passados, assim um desenvolvedor precisa apenas olhar para a definição da função para determinar se os itens são passados por posição, por posição e nome, ou por nome.

source: A function definition may look like:
pt_br: A definição de uma função pode parecer com:

source: def f(pos1, pos2, /, pos_or_kwd, *, kwd1, kwd2): ----------- ---------- ---------- | | | | Positional or keyword | | - Keyword only -- Positional only
pt_br: def f(pos1, pos2, /, pos_ou_kwd, *, kwd1, kwd2): ----------- ---------- ---------- | | | | Posicional ou nomeado | | - Somente nomeado -- Somente posicional

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
pt_br: onde ``/`` e ``*`` são opcionais. Se usados, esses símbolos indicam o tipo de parâmetro pelo qual os argumentos podem ser passados para as funções: somente-posicional, posicional-ou-nomeado, e somente-nomeado. Parâmetros nomeados são também conhecidos como parâmetros palavra-chave.

source: Positional-or-Keyword Arguments
pt_br: Argumentos posicional-ou-nomeados

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
pt_br: Se ``/`` e ``*`` não estão presentes na definição da função, argumentos podem ser passados para uma função por posição ou por nome.

source: Positional-Only Parameters
pt_br: Parâmetros somente-posicionais

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
pt_br: Olhando com um pouco mais de detalhes, é possível definir certos parâmetros como *somente-posicional*. Se *somente-posicional*, a ordem do parâmetro importa, e os parâmetros não podem ser passados por nome. Parâmetros somente-posicional são colocados antes de ``/`` (barra). A ``/`` é usada para logicamente separar os argumentos somente-posicional dos demais parâmetros. Se não existe uma ``/`` na definição da função, não existe parâmetros somente-posicionais.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
pt_br: Parâmetros após a ``/`` podem ser *posicional-ou-nomeado* ou *somente-nomeado*.

source: Keyword-Only Arguments
pt_br: Argumentos somente-nomeados

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
pt_br: Para definir parâmetros como *somente-nomeado*, indicando que o parâmetro deve ser passado por argumento nomeado, colocamos um ``*`` na lista de argumentos imediatamente antes do primeiro parâmetro *somente-nomeado*.

source: Function Examples
pt_br: Exemplos de funções

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
pt_br: Considere o seguinte exemplo de definição de função com atenção redobrada para os marcadores ``/`` e ``*``::

source: >>> def standard_arg(arg): ... print(arg) ... >>> def pos_only_arg(arg, /): ... print(arg) ... >>> def kwd_only_arg(*, arg): ... print(arg) ... >>> def combined_example(pos_only, /, standard, *, kwd_only): ... print(pos_only, standard, kwd_only)
pt_br: >>> def arg_padrão(arg): ... print(arg) ... >>> def arg_somente_pos(arg, /): ... print(arg) ... >>> def arg_somente_nom(*, arg): ... print(arg) ... >>> def exemplo_combinado(somente_pos, /, padrão, *, somente_nom): ... print(somente_pos, padrão, somente_nom)

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
pt_br: A definição da primeira função, ``arg_padrão``, a forma mais familiar, não coloca nenhuma restrição para a chamada da função e argumentos podem ser passados por posição ou nome::

source: >>> standard_arg(2) 2 >>> standard_arg(arg=2) 2
pt_br: >>> arg_padrão(2) 2 >>> arg_padrão(arg=2) 2

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
pt_br: A segunda função ``arg_somente_pos`` está restrita ao uso de parâmetros somente posicionais, uma vez que existe uma ``/`` na definição da função::

source: >>> pos_only_arg(1) 1 >>> pos_only_arg(arg=1) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: pos_only_arg() got some positional-only arguments passed as keyword arguments: 'arg'
pt_br: >>> arg_somente_pos(1) 1 >>> arg_somente_pos(arg=1) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: arg_somente_pos() got some positional-only arguments passed as keyword arguments: 'arg'

source: The third function ``kwd_only_arg`` only allows keyword arguments as indicated by a ``*`` in the function definition::
pt_br: A terceira função ``arg_somente_nom`` permite somente argumentos nomeados como indicado pelo ``*`` na definição da função::

source: >>> kwd_only_arg(3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: kwd_only_arg() takes 0 positional arguments but 1 was given >>> kwd_only_arg(arg=3) 3
pt_br: >>> arg_somente_nom(3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: arg_somente_nom() takes 0 positional arguments but 1 was given >>> arg_somente_nom(arg=3) 3

source: And the last uses all three calling conventions in the same function definition::
pt_br: E a última usa as três convenções de chamada na mesma definição de função::

source: >>> combined_example(1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: combined_example() takes 2 positional arguments but 3 were given >>> combined_example(1, 2, kwd_only=3) 1 2 3 >>> combined_example(1, standard=2, kwd_only=3) 1 2 3 >>> combined_example(pos_only=1, standard=2, kwd_only=3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: combined_example() got some positional-only arguments passed as keyword arguments: 'pos_only'
pt_br: >>> exemplo_combinado(1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: exemplo_combinado() takes 2 positional arguments but 3 were given >>> exemplo_combinado(1, 2, somente_nom=3) 1 2 3 >>> exemplo_combinado(1, padrão=2, somente_nom=3) 1 2 3 >>> exemplo_combinado(somente_pos=1, padrão=2, somente_nom=3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: exemplo_combinado() got some positional-only arguments passed as keyword arguments: 'somente_pos'

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
pt_br: Finalmente, considere essa definição de função que possui uma potencial colisão entre o argumento posicional ``nome`` e ``**kwds`` que possui ``nome`` como uma chave::

source: def foo(name, **kwds): return 'name' in kwds
pt_br: def foo(nome, **kwds): return 'nome' in kwds

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
pt_br: Não é possível essa chamada devolver ``True``, uma vez que o argumento nomeado ``'nome'`` sempre será aplicado para o primeiro parâmetro. Por exemplo::

source: >>> foo(1, **{'name': 2}) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: foo() got multiple values for argument 'name' >>>
pt_br: >>> foo(1, **{'nome': 2}) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: foo() got multiple values for argument 'nome' >>>

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
pt_br: Mas usando ``/`` (argumentos somente-posicionais), isso é possível já que permite ``nome`` como um argumento posicional e ``'nome'`` como uma chave nos argumentos nomeados::

source: >>> def foo(name, /, **kwds): ... return 'name' in kwds ... >>> foo(1, **{'name': 2}) True
pt_br: >>> def foo(nome, /, **kwds): ... return 'nome' in kwds ... >>> foo(1, **{'nome': 2}) True

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
pt_br: Em outras palavras, o nome de parâmetros somente-posicional podem ser usados em ``**kwds`` sem ambiguidade.

source: Recap
pt_br: Recapitulando

source: The use case will determine which parameters to use in the function definition::
pt_br: A situação irá determinar quais parâmetros usar na definição da função::

source: def f(pos1, pos2, /, pos_or_kwd, *, kwd1, kwd2):
pt_br: def f(pos1, pos2, /, pos_ou_nom *, nom1, nom2):

source: As guidance:
pt_br: Como guia:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
pt_br: Use somente-posicional se você não quer que o nome do parâmetro esteja disponível para o usuário. Isso é útil quando nomes de parâmetros não tem um significado real, se você quer forçar a ordem dos argumentos da função quando ela é chamada ou se você precisa ter alguns parâmetros posicionais e alguns nomeados.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
pt_br: Use somente-nomeado quando os nomes tem significado e a definição da função fica mais clara deixando esses nomes explícitos ou se você quer evitar que usuários confiem na posição dos argumentos que estão sendo passados.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
pt_br: Para uma API, use somente-posicional para evitar quebras na mudança da API se os nomes dos parâmetros forem alterados no futuro.

source: Arbitrary Argument Lists
pt_br: Listas de argumentos arbitrárias

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
pt_br: Finalmente, a opção menos usada é especificar que a função pode ser chamada com um número arbitrário de argumentos. Esses argumentos serão empacotados em uma tupla (ver :ref:`tut-tuples`). Antes dos argumentos em número variável, zero ou mais argumentos normais podem estar presentes. ::

source: def write_multiple_items(file, separator, *args): file.write(separator.join(args))
pt_br: def escreve_vários_itens(arquivo, separador, *args): file.write(separador.join(args))

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
pt_br: Normalmente, esses argumentos *variádicos* estarão no final da lista de parâmetros formais, porque eles englobam todos os argumentos de entrada restantes, que são passados para a função. Quaisquer parâmetros formais que ocorrem após o parâmetro ``*args`` são argumentos 'somente-nomeados' , o que significa que eles só podem ser usados como chave-valor, em vez de argumentos posicionais::

source: >>> def concat(*args, sep="/"): ... return sep.join(args) ... >>> concat("earth", "mars", "venus") 'earth/mars/venus' >>> concat("earth", "mars", "venus", sep=".") 'earth.mars.venus'
pt_br: >>> def concat(*args, sep="/"): ... return sep.join(args) ... >>> concat("terra", "marte", "vênus") 'terra/marte/vênus' >>> concat("terra", "marte", "vênus", sep=".") 'terra.marte.vênus'

source: Unpacking Argument Lists
pt_br: Desempacotando listas de argumentos

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
pt_br: A situação inversa ocorre quando os argumentos já estão numa lista ou tupla mas ela precisa ser explodida para invocarmos uma função que requer argumentos posicionais separados. Por exemplo, a função :func:`range` espera argumentos separados, *start* e *stop*. Se os valores já estiverem juntos em uma lista ou tupla, escreva a chamada de função com o operador ``*`` para desempacotá-los da sequência::

source: >>> list(range(3, 6)) # normal call with separate arguments [3, 4, 5] >>> args = [3, 6] >>> list(range(*args)) # call with arguments unpacked from a list [3, 4, 5]
pt_br: >>> list(range(3, 6)) # chamada normal com argumentos separados [3, 4, 5] >>> args = [3, 6] >>> list(range(*args)) # chamada com argumentos desempacotados a partir de uma lista [3, 4, 5]

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
pt_br: Da mesma forma, dicionários podem produzir argumentos nomeados com o operador ``**``::

source: >>> def parrot(voltage, state='a stiff', action='voom'): ... print("-- This parrot wouldn't", action, end=' ') ... print("if you put", voltage, "volts through it.", end=' ') ... print("E's", state, "!") ... >>> d = {"voltage": "four million", "state": "bleedin' demised", "action": "VOOM"} >>> parrot(**d) -- This parrot wouldn't VOOM if you put four million volts through it. E's bleedin' demised !
pt_br: >>> def papagaio(voltagem, estado='um cadáver', ação='voar'): ... print("-- Este papagaio não conseguiria", ação, end=' ') ... print("nem se você desse um choque de", voltagem, "de volts nele.", end=' ') ... print("Ele", estado, "!") ... >>> d = {"voltagem": "quatro milhões", "estado": "está realmente morto", "ação": "voar"} >>> papagaio(**d) -- Este papagaio não conseguiria voar nem se você desse um choque de quatro milhões de volts nele. Ele está realmente morto !

source: Lambda Expressions
pt_br: Expressões lambda

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
pt_br: Pequenas funções anônimas podem ser criadas com a palavra-chave :keyword:`lambda`. Esta função retorna a soma de seus dois argumentos: ``lambda a, b: a+b``. As funções lambda podem ser usadas sempre que objetos função forem necessários. Eles são sintaticamente restritos a uma única expressão. Semanticamente, eles são apenas açúcar sintático para uma definição de função normal. Como definições de funções aninhadas, as funções lambda podem referenciar variáveis contidas no escopo::

source: >>> def make_incrementor(n): ... return lambda x: x + n ... >>> f = make_incrementor(42) >>> f(0) 42 >>> f(1) 43
pt_br: >>> def cria_incrementador(n): ... return lambda x: x + n ... >>> f = cria_incrementador(42) >>> f(0) 42 >>> f(1) 43

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument. For instance, :meth:`list.sort` takes a sorting key function *key* which can be a lambda function::
pt_br: O exemplo acima usa uma expressão lambda para retornar uma função. Outro uso é passar uma pequena função como um argumento. Por exemplo, :meth:`list.sort` recebe uma função chave de ordenação *key* que pode ser uma função lambda::

source: >>> pairs = [(1, 'one'), (2, 'two'), (3, 'three'), (4, 'four')] >>> pairs.sort(key=lambda pair: pair[1]) >>> pairs [(4, 'four'), (1, 'one'), (3, 'three'), (2, 'two')]
pt_br: >>> pairs = [(1, 'um'), (2, 'dois'), (3, 'três), (4, 'quatro')] >>> pairs.sort(key=lambda pair: pair[1]) >>> pairs [(4, 'quatro'), (1, 'um'), (3, 'três'), (2, 'dois')]

source: Documentation Strings
pt_br: Strings de documentação

source: Here are some conventions about the content and formatting of documentation strings.
pt_br: Aqui estão algumas convenções sobre o conteúdo e formatação de strings de documentação, também conhecidas como docstrings.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
pt_br: A primeira linha deve sempre ser curta, um resumo conciso do propósito do objeto. Por brevidade, não deve explicitamente se referir ao nome ou tipo do objeto, uma vez que estas informações estão disponíveis por outros meios (exceto se o nome da função for o próprio verbo que descreve a finalidade da função). Essa linha deve começar com letra maiúscula e terminar com ponto.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
pt_br: Se existem mais linhas na string de documentação, a segunda linha deve estar em branco, separando visualmente o resumo do resto da descrição. As linhas seguintes devem conter um ou mais parágrafos descrevendo as convenções de chamada ao objeto, seus efeitos colaterais, etc.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
pt_br: O analisador Python não remove a indentação de literais string multilinha. Portanto, ferramentas que processem strings de documentação precisam lidar com isso, quando desejável. Existe uma convenção para isso. A primeira linha não vazia após a linha de sumário determina a indentação para o resto da string de documentação. (Não podemos usar a primeira linha para isso porque ela em geral está adjacente às aspas que iniciam a string, portanto sua indentação real não fica aparente.) Espaços em branco "equivalentes" a essa indentação são então removidos do início das demais linhas da string. Linhas com indentação menor não devem ocorrer, mas se ocorrerem, todos os espaços à sua esquerda são removidos. A equivalência de espaços em branco deve ser testada após a expansão das tabulações (8 espaços, normalmente).

source: Here is an example of a multi-line docstring::
pt_br: Eis um exemplo de uma string de documentação multilinha::

source: >>> def my_function(): ... """Do nothing, but document it. ... ... No, really, it doesn't do anything. ... """ ... pass ... >>> print(my_function.__doc__) Do nothing, but document it. No, really, it doesn't do anything.
pt_br: >>> def minha_função(): ... """Não faça nada, mas documente o fato. ... ... Não, é sério, ela faz nada mesmo. ... """ ... pass ... >>> print(minha_função.__doc__) Não faça nada, mas documente o fato. Não, é sério, ela faz nada mesmo.

source: Function Annotations
pt_br: Anotações de função

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
pt_br: :ref:`Anotações de função<function>` são informações de metadados completamente opcionais sobre os tipos usados pelas funções definidas pelo usuário (veja :pep:`3107` e :pep:`484` para mais informações).

source: :term:`Annotations <function annotation>` are stored in the :attr:`~object.__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a required argument, an optional argument, and the return value annotated::
pt_br: :term:`Anotações <function annotation>` são armazenadas no atributo :attr:`~object.__annotations__` da função como um dicionário e não tem nenhum efeito em qualquer outra parte da função. Anotações de parâmetro são definidas por dois-pontos (":") após o nome do parâmetro, seguida por uma expressão que quando avaliada determina o valor da anotação. Anotações do tipo do retorno são definidas por um literal ``->``, seguida por uma expressão, entre a lista de parâmetro e os dois-pontos que marcam o fim da instrução :keyword:`def` . O exemplo a seguir possui um argumento obrigatório, um argumento opcional e o valor de retorno anotados::

source: >>> def f(ham: str, eggs: str = 'eggs') -> str: ... print("Annotations:", f.__annotations__) ... print("Arguments:", ham, eggs) ... return ham + ' and ' + eggs ... >>> f('spam') Annotations: {'ham': <class 'str'>, 'return': <class 'str'>, 'eggs': <class 'str'>} Arguments: spam eggs 'spam and eggs'
pt_br: >>> def f(ham: str, ovos: str = 'ovos') -> str: ... print("Anotações:", f.__annotations__) ... print("Argumentos:", ham, ovos) ... return ham + ' e ' + ovos ... >>> f('spam') Anotações: {'ham': <class 'str'>, 'return': <class 'str'>, 'ovos': <class 'str'>} Argumentos: spam ovos 'spam e ovos'

source: Intermezzo: Coding Style
pt_br: Intermezzo: estilo de codificação
