Repository: python/python-docs-pt-br
Catalog: tutorial/controlflow.po
Languages: pt_br

source: More Control Flow Tools
pt_br: Mais ferramentas de controle de fluxo

source: As well as the :keyword:`while` statement just introduced, Python uses a few more that we will encounter in this chapter.
pt_br: Assim como a instrução :keyword:`while` que acabou de ser apresentada, o Python usa mais algumas que encontraremos neste capítulo.

source: :keyword:`!if` Statements
pt_br: Instruções :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
pt_br: Provavelmente a mais conhecida instrução de controle de fluxo é o :keyword:`if`. Por exemplo::

source: >>> x = int(input("Please enter an integer: ")) Please enter an integer: 42 >>> if x < 0: ... x = 0 ... print('Negative changed to zero') ... elif x == 0: ... print('Zero') ... elif x == 1: ... print('Single') ... else: ... print('More') ... More
pt_br: >>> x = int(input("Insira um número inteiro: ")) Insira um número inteiro: 42 >>> if x < 0: ... x = 0 ... print('Negativo alterado para zero') ... elif x == 0: ... print('Zero') ... elif x == 1: ... print('Um') ... else: ... print('Mais') ... Mais

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
pt_br: Pode haver zero ou mais partes :keyword:`elif`, e a parte :keyword:`else` é opcional. A palavra-chave ':keyword:`!elif`' é uma abreviação para 'else if', e é útil para evitar indentação excessiva. Uma sequência :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... substitui as instruções ``switch`` ou ``case``, encontrados em outras linguagens.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
pt_br: Se você está comparando o mesmo valor com várias constantes, ou verificando por tipos ou atributos específicos, você também pode achar a instrução :keyword:`!match` útil. Para mais detalhes veja :ref:`tut-match`.

source: :keyword:`!for` Statements
pt_br: Instruções :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
pt_br: A instrução :keyword:`for` em Python é um pouco diferente do que costuma ser em C ou Pascal. Ao invés de sempre iterar sobre uma progressão aritmética de números (como no Pascal), ou permitir ao usuário definir o passo de iteração e a condição de parada (como C), a instrução :keyword:`!for` do Python itera sobre os itens de qualquer sequência (seja uma lista ou uma string), na ordem que aparecem na sequência. Por exemplo:

source: >>> # Measure some strings: >>> words = ['cat', 'window', 'defenestrate'] >>> for w in words: ... print(w, len(w)) ... cat 3 window 6 defenestrate 12
pt_br: >>> # Mede algumas strings: >>> palavras = ['gato', 'janela', 'defenestrar'] >>> for p in palavras: ... print(p, len(p)) ... gato 4 janela 6 defenestrar 11

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
pt_br: Código que modifica uma coleção sobre a qual está iterando pode ser inseguro. No lugar disso, usualmente você deve iterar sobre uma cópia da coleção ou criar uma nova coleção::

source: # Create a sample collection users = {'Hans': 'active', 'Éléonore': 'inactive', '景太郎': 'active'} # Strategy: Iterate over a copy for user, status in users.copy().items(): if status == 'inactive': del users[user] # Strategy: Create a new collection active_users = {} for user, status in users.items(): if status == 'active': active_users[user] = status
pt_br: # Cria uma amostra de coleção users = {'Hans': 'active', 'Éléonore': 'inactive', '景太郎': 'active'} # Estratégia: iterar por uma cópia for user, status in users.copy().items(): if status == 'inactive': del users[user] # Estratégia: criar uma nova coleção active_users = {} for user, status in users.items(): if status == 'active': active_users[user] = status

source: The :func:`range` Function
pt_br: A função :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
pt_br: Se você precisa iterar sobre sequências numéricas, a função embutida :func:`range` é a resposta. Ela gera progressões aritméticas::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
pt_br: O ponto de parada fornecido nunca é incluído na lista; ``range(10)`` gera uma lista com 10 valores, exatamente os índices válidos para uma sequência de comprimento 10. É possível iniciar o intervalo com outro número, ou alterar a razão da progressão (inclusive com passo negativo)::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
pt_br: Para iterar sobre os índices de uma sequência, combine :func:`range` e :func:`len` da seguinte forma::

source: >>> a = ['Mary', 'had', 'a', 'little', 'lamb'] >>> for i in range(len(a)): ... print(i, a[i]) ... 0 Mary 1 had 2 a 3 little 4 lamb
pt_br: >>> a = ['Maria', 'tinha', 'um', 'carneirinho'] >>> for i in range(len(a)): ... print(i, a[i]) ... 0 Maria 1 tinha 2 um 3 carneirinho

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
pt_br: Na maioria dos casos, porém, é mais conveniente usar a função :func:`enumerate`, veja :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
pt_br: Uma coisa estranha acontece se você imprime um intervalo::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
pt_br: Em muitos aspectos, o objeto retornado pela função :func:`range` se comporta como se fosse uma lista, mas na verdade não é. É um objeto que retorna os itens sucessivos da sequência desejada quando você itera sobre a mesma, mas na verdade ele não gera a lista, economizando espaço.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
pt_br: Dizemos que um objeto é :term:`iterável`, isso é, candidato a ser alvo de uma função ou construção que espera alguma coisa capaz de retornar sucessivamente seus elementos um de cada vez. Nós vimos que a instrução :keyword:`for` é um exemplo de construção, enquanto que um exemplo de função que recebe um iterável é :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
pt_br: Mais tarde, veremos mais funções que retornam iteráveis e tomam iteráveis como argumentos. No capítulo :ref:`tut-structures`, iremos discutir em mais detalhes sobre :func:`list`.

source: :keyword:`!break` and :keyword:`!continue` Statements
pt_br: Instruções :keyword:`!break` e :keyword:`!continue`

source: The :keyword:`break` statement breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop::
pt_br: A instrução :keyword:`break` sai imediatamente do laço de repetição mais interno, seja :keyword:`for` ou :keyword:`while`::

source: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(f"{n} equals {x} * {n//x}") ... break ... 4 equals 2 * 2 6 equals 2 * 3 8 equals 2 * 4 9 equals 3 * 3
pt_br: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(f"{n} igual a {x} * {n//x}") ... break ... 4 igual a 2 * 2 6 igual a 2 * 3 8 igual a 2 * 4 9 equals 3 * 3

source: The :keyword:`continue` statement continues with the next iteration of the loop::
pt_br: A instrução :keyword:`continue` continua com a próxima iteração do laço::

source: >>> for num in range(2, 10): ... if num % 2 == 0: ... print(f"Found an even number {num}") ... continue ... print(f"Found an odd number {num}") ... Found an even number 2 Found an odd number 3 Found an even number 4 Found an odd number 5 Found an even number 6 Found an odd number 7 Found an even number 8 Found an odd number 9
pt_br: >>> for num in range(2, 10): ... if num % 2 == 0: ... print(f"Encontrado um número par {num}") ... continue ... print(f"Encontrado um número ímpar {num}") ... Encontrado um número par 2 Encontrado um número ímpar 3 Encontrado um número par 4 Encontrado um número ímpar 5 Encontrado um número par 6 Encontrado um número ímpar 7 Encontrado um número par 8 Encontrado um número ímpar 9

source: :keyword:`!else` Clauses on Loops
pt_br: Cláusulas :keyword:`!else` em laços

source: In a :keyword:`!for` or :keyword:`!while` loop the :keyword:`!break` statement may be paired with an :keyword:`!else` clause. If the loop finishes without executing the :keyword:`!break`, the :keyword:`!else` clause executes.
pt_br: Em um laço :keyword:`!for` ou :keyword:`!while` a instrução :keyword:`!break` pode ser pareada com uma cláusula :keyword:`!else`. Se o laço terminar sem executar o :keyword:`!break`, a cláusula :keyword:`!else` será executada.

source: In a :keyword:`for` loop, the :keyword:`!else` clause is executed after the loop finishes its final iteration, that is, if no break occurred.
pt_br: Em um laço :keyword:`for`, a cláusula :keyword:`!else` é executada após o laço finalizar sua iteração final, ou seja, se não ocorrer nenhuma interrupção.

source: In a :keyword:`while` loop, it's executed after the loop's condition becomes false.
pt_br: Em um laço :keyword:`while`, ele é executado após a condição do laço se tornar falsa.

source: In either kind of loop, the :keyword:`!else` clause is **not** executed if the loop was terminated by a :keyword:`break`. Of course, other ways of ending the loop early, such as a :keyword:`return` or a raised exception, will also skip execution of the :keyword:`else` clause.
pt_br: Em qualquer tipo de laço, a cláusula :keyword:`!else` **não** é executada se o laço foi encerrado por um :keyword:`break`. Claro, outras maneiras de encerrar o laço mais cedo, como um :keyword:`return` ou uma exceção levantada, também pularão a execução da cláusula :keyword:`else`.

source: This is exemplified in the following :keyword:`!for` loop, which searches for prime numbers::
pt_br: Isso é exemplificado no seguinte laço :keyword:`!for`, que procura por números primos::

source: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(n, 'equals', x, '*', n//x) ... break ... else: ... # loop fell through without finding a factor ... print(n, 'is a prime number') ... 2 is a prime number 3 is a prime number 4 equals 2 * 2 5 is a prime number 6 equals 2 * 3 7 is a prime number 8 equals 2 * 4 9 equals 3 * 3
pt_br: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(n, 'igual a', x, '*', n//x) ... break ... else: ... # a iteração passou direto sem encontrar um fator ... print(n, 'é um número primo') ... 2 é um número primo 3 é um número primo 4 igual a 2 * 2 5 é um número primo 6 igual a 2 * 3 7 é um número primo 8 igual a 2 * 4 9 igual a 3 * 3

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the ``for`` loop, **not** the ``if`` statement.)
pt_br: (Sim, este é o código correto. Observe atentamente: a cláusula ``else`` pertence ao laço ``for``, **não** à instrução ``if``.)

source: One way to think of the else clause is to imagine it paired with the ``if`` inside the loop. As the loop executes, it will run a sequence like if/if/if/else. The ``if`` is inside the loop, encountered a number of times. If the condition is ever true, a ``break`` will happen. If the condition is never true, the ``else`` clause outside the loop will execute.
pt_br: Uma maneira de pensar na cláusula else é imaginá-la pareada com o ``if`` dentro do laço. Conforme o laço é executado, ele executará uma sequência como if/if/if/else. O ``if`` está dentro do laço, encontrado várias vezes. Se a condição for verdadeira, um ``break`` acontecerá. Se a condição nunca for verdadeira, a cláusula ``else`` fora do laço será executada.

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does with that of ``if`` statements: a ``try`` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the ``try`` statement and exceptions, see :ref:`tut-handling`.
pt_br: Quando usado em um laço, a cláusula ``else`` tem mais em comum com a cláusula ``else`` de uma instrução :keyword:`try` do que com a de instruções ``if``: a cláusula ``else`` de uma instrução ``try`` é executada quando não ocorre exceção, e a cláusula ``else`` de um laço é executada quando não ocorre um ``break``. Para mais informações sobre instrução ``try`` e exceções, veja :ref:`tut-handling`.

source: :keyword:`!pass` Statements
pt_br: Instruções :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
pt_br: A instrução :keyword:`pass` não faz nada. Pode ser usada quando a sintaxe exige uma instrução, mas a semântica do programa não requer nenhuma ação. Por exemplo::

source: >>> while True: ... pass # Busy-wait for keyboard interrupt (Ctrl+C) ...
pt_br: >>> while True: ... pass # Ocupado, aguardando interrupção por teclado (Ctrl+C) ...

source: This is commonly used for creating minimal classes::
pt_br: Isto é usado muitas vezes para se definir classes mínimas::

source: >>> class MyEmptyClass: ... pass ...
pt_br: >>> class MinhaClasseVazia: ... pass ...

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
pt_br: Outra ocasião em que o :keyword:`pass` pode ser usado é como um substituto temporário para uma função ou bloco condicional, quando se está trabalhando com código novo, ainda indefinido, permitindo que mantenha-se o pensamento num nível mais abstrato. O :keyword:`!pass` é silenciosamente ignorado::

source: >>> def initlog(*args): ... pass # Remember to implement this! ...
pt_br: >>> def initlog(*args): ... pass # Lembre-se de implementar isso! ...

source: For this last case, many people use the ellipsis literal :code:`...` instead of :code:`pass`. This use has no special meaning to Python, and is not part of the language definition (you could use any constant expression here), but :code:`...` is used conventionally as a placeholder body as well. See :ref:`bltin-ellipsis-object`.
pt_br: Para este último caso, muitas pessoas usam o literal de reticências :code:`...` em vez de :code:`pass`. Este uso não tem significado especial para Python e não faz parte da definição da linguagem (você pode usar qualquer expressão constante aqui), mas :code:`...` também é usado convencionalmente como um espaço reservado. Consulte :ref:`bltin-ellipsis-object`.

source: :keyword:`!match` Statements
pt_br: Instruções :keyword:`!match`

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables. If no case matches, none of the branches is executed.
pt_br: Uma instrução :keyword:`match` pega uma expressão e compara seu valor com padrões sucessivos fornecidos como um ou mais blocos de case. Isso é superficialmente semelhante a uma instrução switch em C, Java ou JavaScript (e muitas outras linguagens), mas muito mais parecido com a correspondência de padrões em linguages como Rust ou Haskell. Apenas o primeiro padrão que corresponder será executado, podendo também extrair componentes (elementos de sequência ou atributos de objetos) do valor para variáveis. Se nenhum caso corresponder, nenhuma das ramificações será executada.

source: The simplest form compares a subject value against one or more literals::
pt_br: A forma mais simples compara um valor de assunto com um ou mais literais::

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match.
pt_br: Observe o último bloco: o "nome da variável" ``_`` atua como um *curinga* e nunca falha em corresponder.

source: You can combine several literals in a single pattern using ``|`` ("or")::
pt_br: Você pode combinar vários literais em um único padrão usando ``|`` ("ou")::

source: case 401 | 403 | 404: return "Not allowed"
pt_br: case 401 | 403 | 404: return "Não permitido"

source: Patterns can look like unpacking assignments, and can be used to bind variables::
pt_br: Os padrões podem se parecer com atribuições de desempacotamento e podem ser usados para vincular variáveis::

source: # point is an (x, y) tuple match point: case (0, 0): print("Origin") case (0, y): print(f"Y={y}") case (x, 0): print(f"X={x}") case (x, y): print(f"X={x}, Y={y}") case _: raise ValueError("Not a point")
pt_br: # ponto é uma tupla (x, y) match ponto: case (0, 0): print("Origem") case (0, y): print(f"Y={y}") case (x, 0): print(f"X={x}") case (x, y): print(f"X={x}, Y={y}") case _: raise ValueError("Não é um ponto")

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
pt_br: Estude isso com cuidado! O primeiro padrão tem dois literais e pode ser considerado uma extensão do padrão literal mostrado acima. Mas os próximos dois padrões combinam um literal e uma variável, e a variável *vincula* um valor do assunto (``ponto``). O quarto padrão captura dois valores, o que o torna conceitualmente semelhante à atribuição de desempacotamento ``(x, y) = ponto``.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
pt_br: Se você estiver usando classes para estruturar seus dados, você pode usar o nome da classe seguido por uma lista de argumentos semelhante a um construtor, mas com a capacidade de capturar atributos em variáveis::

source: class Point: def __init__(self, x, y): self.x = x self.y = y def where_is(point): match point: case Point(x=0, y=0): print("Origin") case Point(x=0, y=y): print(f"Y={y}") case Point(x=x, y=0): print(f"X={x}") case Point(): print("Somewhere else") case _: print("Not a point")
pt_br: class Ponto: def __init__(self, x, y): self.x = x self.y = y def onde_está(ponto): match ponto: case Ponto(x=0, y=0): print("Origem") case Ponto(x=0, y=y): print(f"Y={y}") case Ponto(x=x, y=0): print(f"X={x}") case Ponto(): print("Em outro lugar") case _: print("Não é um ponto")

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
pt_br: Você pode usar parâmetros posicionais com algumas classes embutidas que fornecem uma ordem para seus atributos (por exemplo, classes de dados). Você também pode definir uma posição específica para atributos em padrões configurando o atributo especial ``__match_args__`` em suas classes. Se for definido como ("x", "y"), os seguintes padrões são todos equivalentes (e todos vinculam o atributo ``y`` à variável ``var``)::

source: Point(1, var) Point(1, y=var) Point(x=1, y=var) Point(y=var, x=1)
pt_br: Ponto(1, var) Ponto(1, y=var) Ponto(x=1, y=var) Ponto(y=var, x=1)

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
pt_br: Uma maneira recomendada de ler padrões é vê-los como uma forma estendida do que você colocaria à esquerda de uma atribuição, para entender quais variáveis seriam definidas para quê. Apenas os nomes autônomos (como ``var`` acima) são atribuídos por uma instrução de correspondência. Nomes pontilhados (como ``foo.bar``), nomes de atributos (o ``x=`` e ``y=`` acima) ou nomes de classes (reconhecidos pelo "(...)" próximo a eles, como ``Ponto`` acima) nunca são atribuídos.

source: Patterns can be arbitrarily nested. For example, if we have a short list of Points, with ``__match_args__`` added, we could match it like this::
pt_br: Os padrões podem ser aninhados arbitrariamente. Por exemplo, se tivermos uma pequena lista de Pontos, com ``__match_args__`` adicionado, poderíamos correspondê-la assim::

source: class Point: __match_args__ = ('x', 'y') def __init__(self, x, y): self.x = x self.y = y match points: case []: print("No points") case [Point(0, 0)]: print("The origin") case [Point(x, y)]: print(f"Single point {x}, {y}") case [Point(0, y1), Point(0, y2)]: print(f"Two on the Y axis at {y1}, {y2}") case _: print("Something else")
pt_br: class Ponto: __match_args__ = ('x', 'y') def __init__(self, x, y): self.x = x self.y = y match pontos: case []: print("Sem pontos") case [Ponto(0, 0)]: print("A origem") case [Ponto(x, y)]: print(f"Ponto único {x}, {y}") case [Ponto(0, y1), Ponto(0, y2)]: print(f"Dois do eixo Y em {y1}, {y2}") case _: print("Outra coisa")
