Repository: python/python-docs-pt-br
Catalog: tutorial/controlflow.po
Languages: pt_br

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
pt_br: Podemos adicionar uma cláusula ``if`` a um padrão, conhecido como "guarda". Se a guarda for falsa, ``match`` continua para tentar o próximo bloco de caso. Observe que a captura de valor ocorre antes que a guarda seja avaliada::

source: match point: case Point(x, y) if x == y: print(f"Y=X at {x}") case Point(x, y): print(f"Not on the diagonal")
pt_br: match ponto: case Ponto(x, y) if x == y: print(f"Y=X at {x}") case Ponto(x, y): print(f"Não está na diagonal")

source: Several other key features of this statement:
pt_br: Vários outros recursos importantes desta instrução::

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
pt_br: Assim como desempacotar atribuições, os padrões de tupla e lista têm exatamente o mesmo significado e realmente correspondem a sequências arbitrárias. Uma exceção importante é que eles não correspondem a iteradores ou strings.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
pt_br: Os padrões de sequência têm suporte ao desempacotamento estendido: ``[x, y, *rest]`` e ``(x, y, *rest)`` funcionam de forma semelhante ao desempacotamento de atribuições. O nome depois de ``*`` também pode ser ``_``, então ``(x, y, *_)`` corresponde a uma sequência de pelo menos dois itens sem ligar os itens restantes.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
pt_br: Padrões de mapeamento: ``{"bandwidth": b, "latency": l}`` captura os valores ``"bandwidth"`` e ``"latency"`` de um dicionário. Diferente dos padrões de sequência, chaves extra são ignoradas. Um desempacotamento como ``**rest`` também é permitido. (Mas ``**_`` seria redundante, então não é permitido.)

source: Subpatterns may be captured using the ``as`` keyword::
pt_br: Subpadrões podem ser capturados usando a palavra reservada ``as``::

source: case (Point(x1, y1), Point(x2, y2) as p2): ...
pt_br: case (Ponto(x1, y1), Ponto(x2, y2) as p2): ...

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
pt_br: Vai capturar o segundo elemento da entrada como ``p2`` (se a entrada for uma sequência de dois pontos)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
pt_br: A maioria dos literais são comparados por igualdade, no entanto os singletons ``True``, ``False`` e ``None`` são comparados por identidade.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
pt_br: Padrões podem usar constantes nomeadas. Estas devem ser nomes pontilhados para prevenir que sejam interpretadas como variáveis de captura::

source: from enum import Enum class Color(Enum): RED = 'red' GREEN = 'green' BLUE = 'blue' color = Color(input("Enter your choice of 'red', 'blue' or 'green': ")) match color: case Color.RED: print("I see red!") case Color.GREEN: print("Grass is green") case Color.BLUE: print("I'm feeling the blues :(")
pt_br: from enum import Enum class Cor(Enum): VERMELHO = 'vermelho' VERDE = 'verde' AZUL = 'azul' cor = Cor(input("Insira sua escolha de 'vermelho, 'azul' ou 'verde': ")) match color: case Cor.VERMELHO: print("Eu vejo vermelho!") case Cor.VERDE: print("Grama é verde") case Cor.AZUL: print("O céu é azul :)")

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
pt_br: Para uma explicação mais detalhada e exemplos adicionais, você pode olhar :pep:`636` que foi escrita em formato de tutorial.

source: Defining Functions
pt_br: Definindo funções

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
pt_br: Podemos criar uma função que escreve a série de Fibonacci até um limite arbitrário::

source: >>> def fib(n): # write Fibonacci series less than n ... """Print a Fibonacci series less than n.""" ... a, b = 0, 1 ... while a < n: ... print(a, end=' ') ... a, b = b, a+b ... print() ... >>> # Now call the function we just defined: >>> fib(2000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597
pt_br: >>> def fib(n): # escreve série de Fibonacci menor que n ... """Imprime uma série de Fibonacci menor que n.""" ... a, b = 0, 1 ... while a < n: ... print(a, end=' ') ... a, b = b, a+b ... print() ... >>> # Agora chamamos a função que acabamos de definir: >>> fib(2000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
pt_br: A palavra reservada :keyword:`def` inicia a *definição* de uma função. Ela deve ser seguida do nome da função e da lista de parâmetros formais entre parênteses. As instruções que formam o corpo da função começam na linha seguinte e devem ser indentados.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
pt_br: Opcionalmente, a primeira linha do corpo da função pode ser uma literal string, cujo propósito é documentar a função. Se presente, essa string chama-se :dfn:`docstring`. (Há mais informação sobre docstrings na seção :ref:`tut-docstrings`.) Existem ferramentas que utilizam docstrings para produzir automaticamente documentação online ou para imprimir, ou ainda, permitir que o usuário navegue interativamente pelo código. É uma boa prática incluir sempre docstrings em suas funções, portanto, tente fazer disso um hábito.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
pt_br: A *execução* de uma função cria uma nova tabela de símbolos para as variáveis locais da função. Mais precisamente, todas as atribuições de variáveis numa função são armazenadas na tabela de símbolos local; referências a variáveis são buscadas primeiro na tabela de símbolos local, em seguida na tabela de símbolos locais de funções delimitadoras ou circundantes, depois na tabela de símbolos global e, finalmente, na tabela de nomes da própria linguagem. Embora possam ser referenciadas, variáveis globais e de funções externas não podem ter atribuições (a menos que seja utilizada a instrução :keyword:`global`, para variáveis globais, ou :keyword:`nonlocal`, para variáveis de funções externas).

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
pt_br: Os parâmetros reais (argumentos) de uma chamada de função são introduzidos na tabela de símbolos local da função no momento da chamada; portanto, argumentos são passados *por valor* (onde o *valor* é sempre uma *referência* para objeto, não o valor do objeto). [#]_ Quando uma função chama outra função, ou chama a si mesma recursivamente, uma nova tabela de símbolos é criada para tal chamada.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
pt_br: Uma definição de função associa o nome da função com o objeto função na tabela de símbolos atual. O interpretador reconhece o objeto apontado pelo nome como uma função definida pelo usuário. Outros nomes também podem apontar para o mesmo objeto função e também pode ser usados pra acessar a função::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
pt_br: Conhecendo outras linguagens, pode-se questionar que ``fib`` não é uma função, mas um procedimento, pois ela não devolve um valor. Na verdade, mesmo funções que não usam a instrução :keyword:`return` devolvem um valor, ainda que pouco interessante. Esse valor é chamado ``None`` (é um nome embutido). O interpretador interativo evita escrever ``None`` quando ele é o único resultado de uma expressão. Mas se quiser vê-lo pode usar a função :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
pt_br: É fácil escrever uma função que retorna uma lista de números da série de Fibonacci, ao invés de exibi-los::

source: >>> def fib2(n): # return Fibonacci series up to n ... """Return a list containing the Fibonacci series up to n.""" ... result = [] ... a, b = 0, 1 ... while a < n: ... result.append(a) # see below ... a, b = b, a+b ... return result ... >>> f100 = fib2(100) # call it >>> f100 # write the result [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
pt_br: >>> def fib2(n): # retorna série de Fibonacci até n ... """Retorna uma lista contendo a série de Fibonacci até n.""" ... resultado = [] ... a, b = 0, 1 ... while a < n: ... resultado.append(a) # veja abaixo ... a, b = b, a+b ... return resultado ... >>> f100 = fib2(100) # chama-o >>> f100 # escreve o resultado [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

source: This example, as usual, demonstrates some new Python features:
pt_br: Este exemplo demonstra novos recursos de Python:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
pt_br: A instrução :keyword:`return` finaliza a execução e retorna um valor da função. :keyword:`!return` sem qualquer expressão como argumento retorna ``None``. Atingir o final da função também retorna ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`~list.append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
pt_br: A instrução ``result.append(a)`` chama um *método* do objeto lista ``result``. Um método é uma função que 'pertence' a um objeto, e é chamada ``obj.nomemetodo``, onde ``obj`` é um objeto qualquer (pode ser uma expressão), e ``nomemetodo`` é o nome de um método que foi definido pelo tipo do objeto. Tipos diferentes definem métodos diferentes. Métodos de diferentes tipos podem ter o mesmo nome sem ambiguidade. (É possível definir seus próprios tipos de objetos e métodos, utilizando *classes*, veja em :ref:`tut-classes`) O método :meth:`~list.append`, mostrado no exemplo é definido para objetos do tipo lista; adiciona um novo elemento ao final da lista. Neste exemplo, ele equivale a ``result = result + [a]``, só que mais eficiente.

source: More on Defining Functions
pt_br: Mais sobre definição de funções

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
pt_br: É possível definir funções com um número variável de argumentos. Existem três formas, que podem ser combinadas.

source: Default Argument Values
pt_br: Argumentos com valor padrão

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
pt_br: A mais útil das três é especificar um valor padrão para um ou mais argumentos. Isso cria uma função que pode ser invocada com menos argumentos do que os que foram definidos. Por exemplo::

source: def ask_ok(prompt, retries=4, reminder='Please try again!'): while True: reply = input(prompt) if reply in {'y', 'ye', 'yes'}: return True if reply in {'n', 'no', 'nop', 'nope'}: return False retries = retries - 1 if retries < 0: raise ValueError('invalid user response') print(reminder)
pt_br: def pergunta_ok(mensagem, tentativas=4, lembrete='Por favor, tente novamente!'): while True: resposta = input(mensagem) if resposta in {'s', 'sim', 'é}: return True if resposta in {'n', 'não', 'nah'}: return False tentativas = tentativas - 1 if tentativas < 0: raise ValueError('resposta inválida de usuário') print(lembrete)

source: This function can be called in several ways:
pt_br: Essa função pode ser chamada de várias formas:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
pt_br: fornecendo apenas o argumento obrigatório: ``ask_ok('Do you really want to quit?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
pt_br: fornecendo um dos argumentos opcionais: ``ask_ok('OK to overwrite the file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
pt_br: ou fornecendo todos os argumentos: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
pt_br: Este exemplo também introduz a palavra-chave :keyword:`in`, que verifica se uma sequência contém ou não um determinado valor.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
pt_br: Os valores padrões são avaliados no momento da definição da função, e no escopo em que a função foi *definida*, portanto::

source: will print ``5``.
pt_br: irá exibir ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
pt_br: **Aviso importante:** Valores padrões são avaliados apenas uma vez. Isso faz diferença quando o valor é um objeto mutável, como uma lista, dicionário, ou instâncias de classes. Por exemplo, a função a seguir acumula os argumentos passados, nas chamadas subsequentes::

source: This will print ::
pt_br: Isso exibirá::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
pt_br: Se não quiser que o valor padrão seja compartilhado entre chamadas subsequentes, pode reescrever a função assim::

source: Keyword Arguments
pt_br: Argumentos nomeados

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
pt_br: Funções também podem ser chamadas usando :term:`argumentos nomeados <keyword argument>` da forma ``chave=valor``. Por exemplo, a função a seguir::

source: def parrot(voltage, state='a stiff', action='voom', type='Norwegian Blue'): print("-- This parrot wouldn't", action, end=' ') print("if you put", voltage, "volts through it.") print("-- Lovely plumage, the", type) print("-- It's", state, "!")
pt_br: def papagaio(voltagem, estado='é um cadáver', ação='voar', tipo='Azul Norueguês'): print("-- Este papagaio não conseguiria", ação, end=' ') print("nem se você desse um choque de", voltagem, "de volts nele.") print("-- Plumagem formosa, o", tipo) print("-- Ele", estado, "!")

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
pt_br: aceita um argumento obrigatório (``voltagem``) e três argumentos opcionais (``estado``, ``ação``, e ``tipo``). Esta função pode ser chamada de qualquer uma dessas formas::

source: parrot(1000) # 1 positional argument parrot(voltage=1000) # 1 keyword argument parrot(voltage=1000000, action='VOOOOOM') # 2 keyword arguments parrot(action='VOOOOOM', voltage=1000000) # 2 keyword arguments parrot('a million', 'bereft of life', 'jump') # 3 positional arguments parrot('a thousand', state='pushing up the daisies') # 1 positional, 1 keyword
pt_br: papagaio(1000) # 1 argumento posicional papagaio(voltagem=1000) # 1 argumento nomeado papagaio(voltagem=1000000, ação='fazer VOOOOOM') # 2 argumentos nomeados papagaio(ação='fazer VOOOOOM', voltagem=1000000) # 2 argumentos nomeados papagaio('um milhão', 'sem vida', 'pular') # 3 argumentos posicionais papagaio('mil', estado='estaria no céu') # 1 posicional, 1 argumento

source: but all the following calls would be invalid::
pt_br: mas todas as formas a seguir seriam inválidas::

source: parrot() # required argument missing parrot(voltage=5.0, 'dead') # non-keyword argument after a keyword argument parrot(110, voltage=220) # duplicate value for the same argument parrot(actor='John Cleese') # unknown keyword argument
pt_br: papagaio() # faltando argumento obrigatório papagaio(voltagem=5.0, 'morto') # argumento não nomeado após um argumento nomeado papagaio(110, voltagem=220) # valor duplicado para o mesmo argumento papagaio(ator='John Cleese') # argumento nomeado desconhecido

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
pt_br: Em uma chamada de função, argumentos nomeados devem vir depois dos argumentos posicionais. Todos os argumentos nomeados passados devem corresponder com argumentos aceitos pela função (ex. ``ator`` não é um argumento nomeado válido para a função ``papagaio``), mas sua ordem é irrelevante. Isto também inclui argumentos obrigatórios (ex.: ``papagaio(voltagem=1000)`` funciona). Nenhum argumento pode receber mais de um valor. Eis um exemplo que não funciona devido a esta restrição::

source: >>> def function(a): ... pass ... >>> function(0, a=0) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: function() got multiple values for argument 'a'
pt_br: >>> def função(a): ... pass ... >>> função(0, a=0) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: função() got multiple values for argument 'a'

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
pt_br: Quando um último parâmetro formal no formato ``**nome`` está presente, ele recebe um dicionário (veja :ref:`typesmapping`) contendo todos os argumentos nomeados, exceto aqueles que correspondem a um parâmetro formal. Isto pode ser combinado com um parâmetro formal no formato ``*nome`` (descrito na próxima subseção) que recebe uma :ref:`tupla <tut-tuples>` contendo os argumentos posicionais, além da lista de parâmetros formais. (``*nome`` deve ocorrer antes de ``**nome``.) Por exemplo, se definirmos uma função assim::

source: def cheeseshop(kind, *arguments, **keywords): print("-- Do you have any", kind, "?") print("-- I'm sorry, we're all out of", kind) for arg in arguments: print(arg) print("-" * 40) for kw in keywords: print(kw, ":", keywords[kw])
pt_br: def loja_de_queijos(tipo, *argumentos, **argumentos_nomeados): print("-- Você tem algum", tipo, "?") print("-- Lamento, acabou o", tipo) for arg in argumentos: print(arg) print("-" * 40) for kw in argumentos_nomeados: print(kw, ":", argumentos_nomeados[kw])

source: It could be called like this::
pt_br: Pode ser chamada assim::

source: cheeseshop("Limburger", "It's very runny, sir.", "It's really very, VERY runny, sir.", shopkeeper="Michael Palin", client="John Cleese", sketch="Cheese Shop Sketch")
pt_br: loja_de_queijos("Limburger", "Está muito mole, senhor", "Está realmente muito, MUITO mole, senhor.", vendedor="Michael Palin", cliente="John Cleese", sketch="Sketch da Loja de Queijos")

source: and of course it would print:
pt_br: e, claro, exibiria:

source: -- Do you have any Limburger ? -- I'm sorry, we're all out of Limburger It's very runny, sir. It's really very, VERY runny, sir. ---------------------------------------- shopkeeper : Michael Palin client : John Cleese sketch : Cheese Shop Sketch
pt_br: -- Você tem algum Limburger ? -- Lamento, acabou o Limburger Está muito mole, senhor. Está realmente muito, MUITO mole, senhor. ---------------------------------------- vendedor : Michael Palin cliente : John Cleese sketch : Cheese Shop Sketch

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
pt_br: Observe que a ordem em que os argumentos nomeados são exibidos é garantida para corresponder à ordem em que foram fornecidos na chamada da função.

source: Special parameters
pt_br: Parâmetros especiais
