Repository: python/python-docs-pt-br
Catalog: tutorial/datastructures.po
Languages: pt_br

source: Data Structures
pt_br: Estruturas de dados

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
pt_br: Esse capítulo descreve algumas coisas que você já aprendeu em detalhes e adiciona algumas coisas novas também.

source: More on Lists
pt_br: Mais sobre listas

source: The list data type has some more methods. Here are all of the methods of list objects:
pt_br: O tipo de dado lista tem ainda mais métodos. Aqui estão apresentados todos os métodos de objetos do tipo lista:

source: Add an item to the end of the list. Similar to ``a[len(a):] = [x]``.
pt_br: Adiciona um item ao fim da lista. Similar a ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Similar to ``a[len(a):] = iterable``.
pt_br: Estende a lista, adicionando no fim todos os elementos do argumento iterável passado como parâmetro. Similar a ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
pt_br: Insere um item em uma dada posição. O primeiro argumento é o índice do elemento antes do qual será feita a inserção, assim ``a.insert(0, x)`` insere um elemento na frente da lista e ``a.insert(len(a), x)`` e equivale a ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
pt_br: Remove o primeiro item encontrado na lista cujo valor é igual a *x*. Se não existir valor igual, uma exceção :exc:`ValueError` é levantada.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. It raises an :exc:`IndexError` if the list is empty or the index is outside the list range.
pt_br: Remove o item na posição fornecida na lista e retorna. Se nenhum índice for especificado, ``a.pop()`` remove e retorna o último item da lista. Levanta um :exc:`IndexError` se a lista estiver vazia ou o índice estiver fora do intervalo da lista.

source: Remove all items from the list. Similar to ``del a[:]``.
pt_br: Remove todos os itens de uma lista. Similar a ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
pt_br: Devolve o índice base-zero do primeiro item cujo valor é igual a *x*, levantando :exc:`ValueError` se este valor não existe.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
pt_br: Os argumentos opcionais *start* e *end* são interpretados como nas notações de fatiamento e são usados para limitar a busca para uma subsequência específica da lista. O índice retornado é calculado relativo ao começo da sequência inteira e não referente ao argumento *start*.

source: Return the number of times *x* appears in the list.
pt_br: Devolve o número de vezes em que *x* aparece na lista.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
pt_br: Ordena os itens na lista (os argumentos podem ser usados para personalizar a ordenação, veja a função :func:`sorted` para maiores explicações).

source: Reverse the elements of the list in place.
pt_br: Inverte a ordem dos elementos na lista.

source: Return a shallow copy of the list. Similar to ``a[:]``.
pt_br: Devolve uma cópia rasa da lista. Similar a ``a[:]``.

source: An example that uses most of the list methods::
pt_br: Um exemplo que usa a maior parte dos métodos das listas::

source: >>> fruits = ['orange', 'apple', 'pear', 'banana', 'kiwi', 'apple', 'banana'] >>> fruits.count('apple') 2 >>> fruits.count('tangerine') 0 >>> fruits.index('banana') 3 >>> fruits.index('banana', 4) # Find next banana starting at position 4 6 >>> fruits.reverse() >>> fruits ['banana', 'apple', 'kiwi', 'banana', 'pear', 'apple', 'orange'] >>> fruits.append('grape') >>> fruits ['banana', 'apple', 'kiwi', 'banana', 'pear', 'apple', 'orange', 'grape'] >>> fruits.sort() >>> fruits ['apple', 'apple', 'banana', 'banana', 'grape', 'kiwi', 'orange', 'pear'] >>> fruits.pop() 'pear'
pt_br: >>> frutas = ['laranja', 'maçã', 'pera', 'banana', 'kiwi', 'maçã', 'banana'] >>> frutas.count('maçã') 2 >>> frutas.count('tangerina') 0 >>> frutas.index('banana') 3 >>> frutas.index('banana', 4) # Encontra a próxima banana iniciando da posição 4 6 >>> frutas.reverse() >>> frutas ['banana', 'maçã', 'kiwi', 'banana', 'pera', 'maçã', 'laranja'] >>> frutas.append('uva') >>> frutas ['banana', 'maçã', 'kiwi', 'banana', 'pera', 'maçã', 'laranja', 'uva'] >>> frutas.sort() >>> frutas ['maçã', 'maçã', 'banana', 'banana', 'uva', 'kiwi', 'laranja', 'pera'] >>> frutas.pop() 'pera'

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
pt_br: Você pode ter percebido que métodos como ``insert``, ``remove`` ou ``sort``, que apenas modificam a lista, não têm valor de retorno impresso -- eles retornam o ``None`` padrão. [#]_ Isto é um princípio de design para todas as estruturas de dados mutáveis em Python.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and ``None`` can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
pt_br: Outro aspecto que você pode notar é que nem todos os dados podem ser classificados ou comparados. Por exemplo, ``[None, 'hello', 10]`` não é ordenável porque os inteiros não podem ser comparados a strings e ``None`` não pode ser comparado a outros tipos. Além disso, há alguns tipos que não têm uma relação de ordenação definida. Por exemplo, ``3+4j < 5+7j`` não é uma comparação válida.

source: Using Lists as Stacks
pt_br: Usando listas como pilhas

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`~list.append`. To retrieve an item from the top of the stack, use :meth:`~list.pop` without an explicit index. For example::
pt_br: Os métodos de lista tornam muito fácil utilizar listas como pilhas, onde o item adicionado por último é o primeiro a ser recuperado (política “último a entrar, primeiro a sair”). Para adicionar um item ao topo da pilha, use :meth:`~list.append`. Para recuperar um item do topo da pilha use :meth:`~list.pop` sem nenhum índice explícito. Por exemplo::

source: >>> stack = [3, 4, 5] >>> stack.append(6) >>> stack.append(7) >>> stack [3, 4, 5, 6, 7] >>> stack.pop() 7 >>> stack [3, 4, 5, 6] >>> stack.pop() 6 >>> stack.pop() 5 >>> stack [3, 4]
pt_br: >>> pilha = [3, 4, 5] >>> pilha.append(6) >>> pilha.append(7) >>> pilha [3, 4, 5, 6, 7] >>> pilha.pop() 7 >>> pilha [3, 4, 5, 6] >>> pilha.pop() 6 >>> pilha.pop() 5 >>> pilha [3, 4]

source: Using Lists as Queues
pt_br: Usando listas como filas

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
pt_br: Você também pode usar uma lista como uma fila, onde o primeiro item adicionado é o primeiro a ser recuperado (política “primeiro a entrar, primeiro a sair”); porém, listas não são eficientes para esta finalidade. Embora *appends* e *pops* no final da lista sejam rápidos, fazer *inserts* ou *pops* no início da lista é lento (porque todos os demais elementos têm que ser deslocados).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
pt_br: Para implementar uma fila, use a classe :class:`collections.deque` que foi projetada para permitir *appends* e *pops* eficientes nas duas extremidades. Por exemplo::

source: >>> from collections import deque >>> queue = deque(["Eric", "John", "Michael"]) >>> queue.append("Terry") # Terry arrives >>> queue.append("Graham") # Graham arrives >>> queue.popleft() # The first to arrive now leaves 'Eric' >>> queue.popleft() # The second to arrive now leaves 'John' >>> queue # Remaining queue in order of arrival deque(['Michael', 'Terry', 'Graham'])
pt_br: >>> from collections import deque >>> fila = deque(["Erik", "João", "Miguel"]) >>> fila.append("Tiago") # Tiago chega >>> fila.append("George") # George chega >>> fila.popleft() # O primeiro a chegar agora sai 'Erik' >>> fila.popleft() # O segundo a chegar agora sai 'João' >>> fila # A fila restante na ordem de chegada deque(['Miguel', 'Tiago', 'George'])

source: List Comprehensions
pt_br: Compreensões de lista

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
pt_br: Compreensões de lista fornece uma maneira concisa de criar uma lista. Aplicações comuns são criar novas listas onde cada elemento é o resultado de alguma operação aplicada a cada elemento de outra sequência ou iterável, ou criar uma subsequência de elementos que satisfaçam uma certa condição. (N.d.T. o termo original em inglês é *list comprehensions*, muito utilizado no Brasil; também se usa a abreviação *listcomp*).

source: For example, assume we want to create a list of squares, like::
pt_br: Por exemplo, suponha que queremos criar uma lista de quadrados, assim::

source: >>> squares = [] >>> for x in range(10): ... squares.append(x**2) ... >>> squares [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
pt_br: >>> quadrados = [] >>> for x in range(10): ... quadrados.append(x**2) ... >>> quadrados [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
pt_br: Note que isto cria (ou sobrescreve) uma variável chamada ``x`` que ainda existe após o término do laço. Podemos calcular a lista dos quadrados sem qualquer efeito colateral usando::

source: squares = list(map(lambda x: x**2, range(10)))
pt_br: quadrados = list(map(lambda x: x**2, range(10)))

source: or, equivalently::
pt_br: ou, de maneira equivalente::

source: squares = [x**2 for x in range(10)]
pt_br: quadrados = [x**2 for x in range(10)]

source: which is more concise and readable.
pt_br: que é mais conciso e legível.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
pt_br: Um compreensão de lista consiste de um par de colchetes contendo uma expressão seguida de uma cláusula :keyword:`!for`, e então zero ou mais cláusulas :keyword:`!for` ou :keyword:`!if`. O resultado será uma nova lista resultante da avaliação da expressão no contexto das cláusulas :keyword:`!for` e :keyword:`!if`. Por exemplo, essa compreensão combina os elementos de duas listas se eles forem diferentes::

source: and it's equivalent to::
pt_br: e é equivalente a::

source: >>> combs = [] >>> for x in [1,2,3]: ... for y in [3,1,4]: ... if x != y: ... combs.append((x, y)) ... >>> combs [(1, 3), (1, 4), (2, 3), (2, 1), (2, 4), (3, 1), (3, 4)]
pt_br: >>> combos = [] >>> for x in [1,2,3]: ... for y in [3,1,4]: ... if x != y: ... combos.append((x, y)) ... >>> combos [(1, 3), (1, 4), (2, 3), (2, 1), (2, 4), (3, 1), (3, 4)]

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
pt_br: Note como a ordem das instruções :keyword:`for` e :keyword:`if` é a mesma em ambos os trechos.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
pt_br: Se a expressão é uma tupla (ex., ``(x, y)`` no exemplo anterior), ela deve ser inserida entre parênteses. ::

source: >>> vec = [-4, -2, 0, 2, 4] >>> # create a new list with the values doubled >>> [x*2 for x in vec] [-8, -4, 0, 4, 8] >>> # filter the list to exclude negative numbers >>> [x for x in vec if x >= 0] [0, 2, 4] >>> # apply a function to all the elements >>> [abs(x) for x in vec] [4, 2, 0, 2, 4] >>> # call a method on each element >>> freshfruit = [' banana', ' loganberry ', 'passion fruit '] >>> [weapon.strip() for weapon in freshfruit] ['banana', 'loganberry', 'passion fruit'] >>> # create a list of 2-tuples like (number, square) >>> [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] >>> # the tuple must be parenthesized, otherwise an error is raised >>> [x, x**2 for x in range(6)] File "<stdin>", line 1 [x, x**2 for x in range(6)] ^^^^^^^ SyntaxError: did you forget parentheses around the comprehension target? >>> # flatten a list using a listcomp with two 'for' >>> vec = [[1,2,3], [4,5,6], [7,8,9]] >>> [num for elem in vec for num in elem] [1, 2, 3, 4, 5, 6, 7, 8, 9]
pt_br: >>> vec = [-4, -2, 0, 2, 4] >>> # cria uma nova lista com os valores dobrados >>> [x*2 for x in vec] [-8, -4, 0, 4, 8] >>> # filtra a lista para excluir números negativos >>> [x for x in vec if x >= 0] [0, 2, 4] >>> # aplica uma função para todos os elementos >>> [abs(x) for x in vec] [4, 2, 0, 2, 4] >>> # chama um método em cada elemento >>> frutafresca = [' banana', ' baga-de-logan ', 'maracujá '] >>> [arma.strip() for arma in frutafresca] ['banana', 'baga-de-logan', 'maracujá'] >>> # cria uma lista de tuplas de 2 elementos como (número, quadrado) >>> [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] >>> # a tupla deve estar entre parênteses, do contrário um erro é levantado >>> [x, x**2 for x in range(6)] File "<stdin>", line 1 [x, x**2 for x in range(6)] ^^^^^^^ SyntaxError: did you forget parentheses around the comprehension target? >>> # achatamento de uma lista usando uma compreensão de lista com dois 'for' >>> vec = [[1,2,3], [4,5,6], [7,8,9]] >>> [num for elem in vec for num in elem] [1, 2, 3, 4, 5, 6, 7, 8, 9]

source: List comprehensions can contain complex expressions and nested functions::
pt_br: Compreensões de lista podem conter expressões complexas e funções aninhadas::

source: Nested List Comprehensions
pt_br: Compreensões de lista aninhadas

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
pt_br: A expressão inicial em uma compreensão de lista pode ser qualquer expressão arbitrária, incluindo outra compreensão de lista.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
pt_br: Observe este exemplo de uma matriz 3x4 implementada como uma lista de 3 listas de comprimento 4::

source: >>> matrix = [ ... [1, 2, 3, 4], ... [5, 6, 7, 8], ... [9, 10, 11, 12], ... ]
pt_br: >>> matriz = [ ... [1, 2, 3, 4], ... [5, 6, 7, 8], ... [9, 10, 11, 12], ... ]

source: The following list comprehension will transpose rows and columns::
pt_br: A compreensão de lista abaixo transpõe as linhas e colunas::

source: >>> [[row[i] for row in matrix] for i in range(4)] [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
pt_br: >>> [[linha[i] for linha in matriz] for i in range(4)] [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
pt_br: Como vimos na seção anterior, a compreensão de lista interna é computada no contexto da cláusula :keyword:`for` seguinte, portanto o exemplo acima equivale a::

source: >>> transposed = [] >>> for i in range(4): ... transposed.append([row[i] for row in matrix]) ... >>> transposed [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
pt_br: >>> transposta = [] >>> for i in range(4): ... transposta.append([row[i] for linha in matriz]) ... >>> transposta [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: which, in turn, is the same as::
pt_br: e isso, por sua vez, faz o mesmo que isto::

source: >>> transposed = [] >>> for i in range(4): ... # the following 3 lines implement the nested listcomp ... transposed_row = [] ... for row in matrix: ... transposed_row.append(row[i]) ... transposed.append(transposed_row) ... >>> transposed [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
pt_br: >>> transposta = [] >>> for i in range(4): ... # as 3 linhas a seguir implementam uma compreensão de lista aninhada ... linha_transposta = [] ... for linha in matriz: ... linha_transposta.append(linha[i]) ... transposta.append(linha_transposta) ... >>> transposta [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
pt_br: Na prática, você deve dar preferência a funções embutidas em vez de instruções complexas. A função :func:`zip` resolve muito bem este caso de uso::

source: >>> list(zip(*matrix)) [(1, 5, 9), (2, 6, 10), (3, 7, 11), (4, 8, 12)]
pt_br: >>> list(zip(*matriz)) [(1, 5, 9), (2, 6, 10), (3, 7, 11), (4, 8, 12)]

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
pt_br: Veja :ref:`tut-unpacking-arguments` para entender o uso do asterisco neste exemplo.

source: The :keyword:`!del` statement
pt_br: A instrução :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`~list.pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
pt_br: Existe uma maneira de remover um item de uma lista usando seu índice no lugar do seu valor: a instrução :keyword:`del`. Ele difere do método :meth:`~list.pop` que devolve um valor. A instrução :keyword:`!del` pode também ser utilizada para remover fatias de uma lista ou limpar a lista inteira (que fizemos antes por atribuição de uma lista vazia à fatia ``a[:]``). Por exemplo::

source: :keyword:`del` can also be used to delete entire variables::
pt_br: :keyword:`del` também pode ser usado para remover totalmente uma variável::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
pt_br: Referenciar a variável ``a`` depois de sua remoção constitui erro (pelo menos até que seja feita uma nova atribuição para ela). Encontraremos outros usos para a instrução :keyword:`del` mais tarde.

source: Tuples and Sequences
pt_br: Tuplas e Sequências

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
pt_br: Vimos que listas e strings têm muitas propriedades em comum, como indexação e operações de fatiamento. Elas são dois exemplos de *sequências* (veja :ref:`typesseq`). Como Python é uma linguagem em evolução, outros tipos de sequências podem ser adicionados. Existe ainda um outro tipo de sequência padrão na linguagem: a *tupla*.

source: A tuple consists of a number of values separated by commas, for instance::
pt_br: Uma tupla consiste em uma sequência de valores separados por vírgulas, por exemplo::

source: >>> t = 12345, 54321, 'hello!' >>> t[0] 12345 >>> t (12345, 54321, 'hello!') >>> # Tuples may be nested: >>> u = t, (1, 2, 3, 4, 5) >>> u ((12345, 54321, 'hello!'), (1, 2, 3, 4, 5)) >>> # Tuples are immutable: >>> t[0] = 88888 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'tuple' object does not support item assignment >>> # but they can contain mutable objects: >>> v = ([1, 2, 3], [3, 2, 1]) >>> v ([1, 2, 3], [3, 2, 1])
pt_br: >>> t = 12345, 54321, 'olá!' >>> t[0] 12345 >>> t (12345, 54321, 'olá!') >>> # Tuplas pode ser aninhadas: >>> u = t, (1, 2, 3, 4, 5) >>> u ((12345, 54321, 'olá!'), (1, 2, 3, 4, 5)) >>> # Tuplas são imutáveis: >>> t[0] = 88888 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'tuple' object does not support item assignment >>> # mas elas podem conter objetos mutáveis: >>> v = ([1, 2, 3], [3, 2, 1]) >>> v ([1, 2, 3], [3, 2, 1])

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
pt_br: Como você pode ver no trecho acima, na saída do console as tuplas são sempre envolvidas por parênteses, assim tuplas aninhadas podem ser lidas corretamente. Na criação, tuplas podem ser envolvidas ou não por parênteses, desde que o contexto não exija os parênteses (como no caso da tupla dentro de uma expressão maior). Não é possível atribuir itens individuais de uma tupla, contudo é possível criar tuplas que contenham objetos mutáveis, como listas.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
pt_br: Apesar de tuplas serem similares a listas, elas são frequentemente utilizadas em situações diferentes e com propósitos distintos. Tuplas são :term:`imutáveis <imutável>`, e usualmente contém uma sequência heterogênea de elementos que são acessados via desempacotamento (ver a seguir nessa seção) ou índice (ou mesmo por um atributo no caso de :func:`namedtuples <collections.namedtuple>`). Listas são :term:`mutáveis <mutável>`, e seus elementos geralmente são homogêneos e são acessados iterando sobre a lista.
