Repository: python/python-docs-pt-br
Catalog: tutorial/datastructures.po
Languages: pt_br

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
pt_br: Um problema especial é a criação de tuplas contendo 0 ou 1 itens: a sintaxe usa certos truques para acomodar estes casos. Tuplas vazias são construídas por um par de parênteses vazios; uma tupla unitária é construída por um único valor e uma vírgula entre parênteses (não basta colocar um único valor entre parênteses). Feio, mas funciona. Por exemplo::

source: >>> empty = () >>> singleton = 'hello', # <-- note trailing comma >>> len(empty) 0 >>> len(singleton) 1 >>> singleton ('hello',)
pt_br: >>> vazio = () >>> singleton = 'olá', # <!- note a linha ao final vazia >>> len(vazio) 0 >>> len(singleton) 1 >>> singleton ('olá',)

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
pt_br: A instrução ``t = 12345, 54321, 'bom dia!'`` é um exemplo de *empacotamento de tupla*: os valores ``12345``, ``54321`` e ``'bom dia!'`` são empacotados em uma tupla. A operação inversa também é possível::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
pt_br: Isso é chamado, apropriadamente, de *desempacotamento de sequência* e funciona para qualquer sequência no lado direito. O desempacotamento de sequência requer que haja tantas variáveis no lado esquerdo do sinal de igual, quanto existem de elementos na sequência. Observe que a atribuição múltipla é, na verdade, apenas uma combinação de empacotamento de tupla e desempacotamento de sequência.

source: Sets
pt_br: Conjuntos

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
pt_br: Python também inclui um tipo de dados para conjuntos, chamado ``set``. Um conjunto é uma coleção desordenada de elementos, sem elementos repetidos. Usos comuns para conjuntos incluem a verificação eficiente da existência de objetos e a eliminação de itens duplicados. Conjuntos também suportam operações matemáticas como união, interseção, diferença e diferença simétrica.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
pt_br: Chaves ou a função :func:`set` podem ser usados para criar conjuntos. Note: para criar um conjunto vazio você precisa usar ``set()``, não ``{}``; este último cria um dicionário vazio, uma estrutura de dados que discutiremos na próxima seção.

source: Here is a brief demonstration::
pt_br: Uma pequena demonstração::

source: >>> basket = {'apple', 'orange', 'apple', 'pear', 'orange', 'banana'} >>> print(basket) # show that duplicates have been removed {'orange', 'banana', 'pear', 'apple'} >>> 'orange' in basket # fast membership testing True >>> 'crabgrass' in basket False >>> # Demonstrate set operations on unique letters from two words >>> >>> a = set('abracadabra') >>> b = set('alacazam') >>> a # unique letters in a {'a', 'r', 'b', 'c', 'd'} >>> a - b # letters in a but not in b {'r', 'd', 'b'} >>> a | b # letters in a or b or both {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # letters in both a and b {'a', 'c'} >>> a ^ b # letters in a or b but not both {'r', 'd', 'b', 'm', 'z', 'l'}
pt_br: >>> cesta = {'maçã', 'laranja', 'maçã', 'pera', 'laranja', 'banana'} >>> print(cesta) # mostra que itens duplicados foram removidos {'laranja', 'banana', 'pera', 'maçã'} >>> 'laranja' in cesta # teste de pertinência rápido True >>> 'crabgrass' in cesta False >>> # Demonstra operações de conjunto em letras únicas de duas palavras >>> >>> a = set('abracadabra') >>> b = set('alacazam') >>> a # letras únicas em a {'a', 'r', 'b', 'c', 'd'} >>> a - b # letras em a, mas não em b {'r', 'd', 'b'} >>> a | b # letras em a ou em b ou ambos {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # letras em ambos a e b {'a', 'c'} >>> a ^ b # letras em a ou b, mas não em ambos {'r', 'd', 'b', 'm', 'z', 'l'}

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
pt_br: Da mesma forma que :ref:`compreensão de listas <tut-listcomps>`, compreensões de conjunto também são suportadas::

source: Dictionaries
pt_br: Dicionários

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`~list.append` and :meth:`~list.extend`.
pt_br: Outra estrutura de dados muito útil embutida em Python é o *dicionário*, cujo tipo é ``dict`` (ver :ref:`typesmapping`). Dicionários são também chamados de “memória associativa” ou “vetor associativo” em outras linguagens. Diferente de sequências que são indexadas por inteiros, dicionários são indexados por chaves (*keys*), que podem ser de qualquer tipo imutável (como strings e inteiros). Tuplas também podem ser chaves se contiverem apenas strings, inteiros ou outras tuplas. Se a tupla contiver, direta ou indiretamente, qualquer valor mutável, não poderá ser chave. Listas não podem ser usadas como chaves porque podem ser modificadas *internamente* pela atribuição em índices ou fatias, e por métodos como :meth:`~list.append` e :meth:`~list.extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
pt_br: Um bom modelo mental é imaginar um dicionário como um conjunto não-ordenado de pares *chave:valor*, onde as chaves são únicas em uma dada instância do dicionário. Dicionários são delimitados por chaves: ``{}``, e contém uma lista de pares chave:valor separada por vírgulas. Dessa forma também será exibido o conteúdo de um dicionário no console do Python. O dicionário vazio é ``{}``.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
pt_br: As principais operações em um dicionário são armazenar e recuperar valores a partir de chaves. Também é possível remover um par *chave:valor* com o comando ``del``. Se você armazenar um valor utilizando uma chave já presente, o antigo valor será substituído pelo novo. Se tentar recuperar um valor usando uma chave inexistente, será gerado um erro.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
pt_br: Executar ``list(d)`` em um dicionário devolve a lista de todas as chaves presentes no dicionário, na ordem de inserção (se desejar ordená-las basta usar a função ``sorted(d)``). Para verificar a existência de uma chave, use o operador :keyword:`in`.

source: Here is a small example using a dictionary::
pt_br: A seguir, um exemplo de uso do dicionário::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
pt_br: O construtor :func:`dict` produz dicionários diretamente de sequências de pares chave-valor::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
pt_br: Além disso, as compreensões de dicionários podem ser usadas para criar dicionários a partir de expressões arbitrárias de chave e valor::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
pt_br: Quando chaves são strings simples, é mais fácil especificar os pares usando argumentos nomeados no construtor::

source: Looping Techniques
pt_br: Técnicas de iteração

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
pt_br: Ao iterar sobre dicionários, a chave e o valor correspondente podem ser obtidos simultaneamente usando o método :meth:`~dict.items`. ::

source: >>> knights = {'gallahad': 'the pure', 'robin': 'the brave'} >>> for k, v in knights.items(): ... print(k, v) ... gallahad the pure robin the brave
pt_br: >>> cavaleiros = {'gallahad': 'o puro', 'robin': 'o bravo'} >>> for k, v in cavaleiros.items(): ... print(k, v) ... gallahad o puro robin o bravo

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
pt_br: Ao iterar sobre sequências, a posição e o valor correspondente podem ser obtidos simultaneamente usando a função :func:`enumerate`. ::

source: >>> for i, v in enumerate(['tic', 'tac', 'toe']): ... print(i, v) ... 0 tic 1 tac 2 toe
pt_br: >>> for i, v in enumerate(['jogo', 'da', 'velha']): ... print(i, v) ... 0 jogo 1 da 2 velha

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
pt_br: Para percorrer duas ou mais sequências ao mesmo tempo, as entradas podem ser pareadas com a função :func:`zip`. ::

source: >>> questions = ['name', 'quest', 'favorite color'] >>> answers = ['lancelot', 'the holy grail', 'blue'] >>> for q, a in zip(questions, answers): ... print('What is your {0}? It is {1}.'.format(q, a)) ... What is your name? It is lancelot. What is your quest? It is the holy grail. What is your favorite color? It is blue.
pt_br: >>> perguntas = ['Nome', 'Missão', 'Cor favorita'] >>> respostas = ['Lancelot', 'o santo graal', 'azul'] >>> for q, a in zip(perguntas, respostas): ... print('{0}? É {1}.'.format(q, a)) ... Nome? É Lancelot. Missão? É o santo graal. Cor favorita? É azul.

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
pt_br: Para percorrer uma sequência em ordem inversa, chame a função :func:`reversed` com a sequência na ordem original. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
pt_br: Para percorrer uma sequência de maneira ordenada, use a função :func:`sorted`, que retorna uma lista ordenada com os itens, mantendo a sequência original inalterada. ::

source: >>> basket = ['apple', 'orange', 'apple', 'pear', 'orange', 'banana'] >>> for i in sorted(basket): ... print(i) ... apple apple banana orange orange pear
pt_br: >>> cesta = ['maçã', 'laranja', 'maçã', 'pera', 'laranja', 'banana'] >>> for i in sorted(cesta): ... print(i) ... maçã maçã banana laranja laranja pera

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
pt_br: Usar :func:`set` em uma sequência elimina elementos duplicados. O uso de :func:`sorted` em combinação com :func:`set` sobre uma sequência é uma maneira idiomática de fazer um loop sobre elementos exclusivos da sequência na ordem de classificação. ::

source: >>> basket = ['apple', 'orange', 'apple', 'pear', 'orange', 'banana'] >>> for f in sorted(set(basket)): ... print(f) ... apple banana orange pear
pt_br: >>> cesta = ['maçã', 'laranja', 'maçã', 'pera', 'laranja', 'banana'] >>> for i in sorted(cesta): ... print(i) ... maçã maçã banana laranja laranja pera

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
pt_br: Às vezes é tentador alterar uma lista enquanto você itera sobre ela; porém, costuma ser mais simples e seguro criar uma nova lista. ::

source: >>> import math >>> raw_data = [56.2, float('NaN'), 51.7, 55.3, 52.5, float('NaN'), 47.8] >>> filtered_data = [] >>> for value in raw_data: ... if not math.isnan(value): ... filtered_data.append(value) ... >>> filtered_data [56.2, 51.7, 55.3, 52.5, 47.8]
pt_br: >>> import math >>> dados_brutos = [56.2, float('NaN'), 51.7, 55.3, 52.5, float('NaN'), 47.8] >>> dados_filtrados = [] >>> for valor in dados_brutos: ... if not math.isnan(value): ... dados_filtrados.append(valor) ... >>> dados_filtrados [56.2, 51.7, 55.3, 52.5, 47.8]

source: More on Conditions
pt_br: Mais sobre condições

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
pt_br: As condições de controle usadas nas instruções ``while`` e ``if`` podem conter quaisquer operadores, não apenas comparações.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
pt_br: Os operadores de comparação ``in`` e ``not in`` fazem testes de inclusão que determinam se um valor está (ou não está) em um contêiner. Os operadores ``is`` e ``is not`` comparam se dois objetos são realmente o mesmo objeto. Todos os operadores de comparação possuem a mesma prioridade, que é menor que a prioridade de todos os operadores numéricos.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
pt_br: Comparações podem ser encadeadas: Por exemplo ``a < b == c`` testa se ``a`` é menor que ``b`` e também se ``b`` é igual a ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
pt_br: Comparações podem ser combinadas através de operadores booleanos ``and`` e ``or``, e o resultado de uma comparação (ou de qualquer outra expressão), pode ter seu valor booleano negado através de ``not``. Estes possuem menor prioridade que os demais operadores de comparação. Entre eles, ``not`` é o de maior prioridade e ``or`` o de menor. Dessa forma, a condição ``A and not B or C`` é equivalente a ``(A and (not B)) or C``. Naturalmente, parênteses podem ser usados para expressar o agrupamento desejado.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
pt_br: Os operadores booleanos ``and`` e ``or`` são operadores *curto-circuito*: seus argumentos são avaliados da esquerda para a direita, e a avaliação encerra quando o resultado é determinado. Por exemplo, se ``A`` e ``C`` são expressões verdadeiras, mas ``B`` é falsa, então ``A and B and C`` não chega a avaliar a expressão ``C``. Em geral, quando usado sobre valores genéricos e não como booleanos, o valor do resultado de um operador curto-circuito é o último valor avaliado na expressão.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
pt_br: É possível atribuir o resultado de uma comparação ou outra expressão booleana para uma variável. Por exemplo::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
pt_br: Observe que no Python, ao contrário de C, a atribuição dentro de expressões deve ser feita explicitamente com o :ref:`operador morsa <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. Isso evita uma classe comum de problemas encontrados nos programas C: digitar ``=`` em uma expressão quando ``==`` era o planejado.

source: Comparing Sequences and Other Types
pt_br: Comparando sequências e outros tipos

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
pt_br: Objetos sequência podem ser comparados com outros objetos sequência, desde que o tipo das sequências seja o mesmo. A comparação utiliza a ordem lexicográfica: primeiramente os dois primeiros itens são comparados, e se diferirem isto determinará o resultado da comparação, caso contrário os próximos dois itens serão comparados, e assim por diante até que se tenha exaurido alguma das sequências. Se em uma comparação de itens, os mesmos forem também sequências (aninhadas), então é disparada recursivamente outra comparação lexicográfica. Se todos os itens da sequência forem iguais, então as sequências são ditas iguais. Se uma das sequências é uma subsequência da outra, então a subsequência é a menor. A comparação lexicográfica de strings utiliza codificação Unicode para definir a ordenação. Alguns exemplos de comparações entre sequências do mesmo tipo::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
pt_br: Note que comparar objetos de tipos diferentes com ``<`` ou ``>`` é permitido desde que os objetos possuam os métodos de comparação apropriados. Por exemplo, tipos numéricos mistos são comparados de acordo com os seus valores numéricos, portanto 0 é igual a 0.0, etc. Em caso contrário, ao invés de fornecer uma ordenação arbitrária, o interpretador levantará um :exc:`TypeError`.

source: Footnotes
pt_br: Notas de rodapé

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
pt_br: Outras linguagens podem retornar o objeto modificado, o que permite encadeamento de métodos, como ``d->insert("a")->remove("b")->sort();``.
