Repository: python/python-docs-pt-br
Catalog: tutorial/errors.po
Languages: pt_br

source: Errors and Exceptions
pt_br: Erros e exceções

source: Until now error messages haven't been more than mentioned, but if you have tried out the examples you have probably seen some. There are (at least) two distinguishable kinds of errors: *syntax errors* and *exceptions*.
pt_br: Até agora mensagens de erro foram apenas mencionadas, mas se você testou os exemplos, talvez tenha esbarrado em algumas. Existem pelo menos dois tipos distintos de erros: *erros de sintaxe* e *exceções*.

source: Syntax Errors
pt_br: Erros de sintaxe

source: Syntax errors, also known as parsing errors, are perhaps the most common kind of complaint you get while you are still learning Python::
pt_br: Erros de sintaxe, também conhecidos como erros de parse, são provavelmente os mais frequentes entre aqueles que ainda estão aprendendo Python::

source: >>> while True print('Hello world') File "<stdin>", line 1 while True print('Hello world') ^^^^^ SyntaxError: invalid syntax
pt_br: >>> while True print('Olá mundo') File "<stdin>", line 1 while True print('Olá mundo') ^^^^^ SyntaxError: invalid syntax

source: The parser repeats the offending line and displays little arrows pointing at the place where the error was detected. Note that this is not always the place that needs to be fixed. In the example, the error is detected at the function :func:`print`, since a colon (``':'``) is missing just before it.
pt_br: O analisador sintático repete a linha ofensiva e exibe pequenas setas apontando para o local onde o erro foi detectado. Note que esse nem sempre é o local que precisa ser corrigido. No exemplo, o erro é detectado na função :func:`print`, já que dois pontos (``':'``) estão faltando logo antes dele.

source: The file name (``<stdin>`` in our example) and line number are printed so you know where to look in case the input came from a file.
pt_br: O nome do arquivo (``<stdin>`` no nosso exemplo) e o número da linha são impressos para que você saiba onde procurar caso a entrada tenha vindo de um arquivo.

source: Exceptions
pt_br: Exceções

source: Even if a statement or expression is syntactically correct, it may cause an error when an attempt is made to execute it. Errors detected during execution are called *exceptions* and are not unconditionally fatal: you will soon learn how to handle them in Python programs. Most exceptions are not handled by programs, however, and result in error messages as shown here::
pt_br: Mesmo que um comando ou expressão estejam sintaticamente corretos, talvez ocorra um erro na hora de sua execução. Erros detectados durante a execução são chamados *exceções* e não são necessariamente fatais: logo veremos como tratá-las em programas Python. A maioria das exceções não são tratadas pelos programas e acabam resultando em mensagens de erro::

source: The last line of the error message indicates what happened. Exceptions come in different types, and the type is printed as part of the message: the types in the example are :exc:`ZeroDivisionError`, :exc:`NameError` and :exc:`TypeError`. The string printed as the exception type is the name of the built-in exception that occurred. This is true for all built-in exceptions, but need not be true for user-defined exceptions (although it is a useful convention). Standard exception names are built-in identifiers (not reserved keywords).
pt_br: A última linha da mensagem de erro indica o que aconteceu. Exceções surgem com diferentes tipos, e o tipo é exibido como parte da mensagem: os tipos no exemplo são :exc:`ZeroDivisionError`, :exc:`NameError` e :exc:`TypeError`. A string exibida como sendo o tipo da exceção é o nome da exceção embutida que ocorreu. Isso é verdade para todas exceções pré-definidas em Python, mas não é necessariamente verdade para exceções definidas pelo usuário (embora seja uma convenção útil). Os nomes das exceções padrões são identificadores embutidos (não palavras reservadas).

source: The rest of the line provides detail based on the type of exception and what caused it.
pt_br: O resto da linha é um detalhamento que depende do tipo da exceção ocorrida e sua causa.

source: The preceding part of the error message shows the context where the exception occurred, in the form of a stack traceback. In general it contains a stack traceback listing source lines; however, it will not display lines read from standard input.
pt_br: A parte anterior da mensagem de erro apresenta o contexto onde ocorreu a exceção. Essa informação é denominada *stack traceback* (situação da pilha de execução). Em geral, contém uma lista de linhas do código-fonte, sem apresentar, no entanto, linhas lidas da entrada padrão.

source: :ref:`bltin-exceptions` lists the built-in exceptions and their meanings.
pt_br: :ref:`bltin-exceptions` lista as exceções pré-definidas e seus significados.

source: Handling Exceptions
pt_br: Tratamento de exceções

source: It is possible to write programs that handle selected exceptions. Look at the following example, which asks the user for input until a valid integer has been entered, but allows the user to interrupt the program (using :kbd:`Control-C` or whatever the operating system supports); note that a user-generated interruption is signalled by raising the :exc:`KeyboardInterrupt` exception. ::
pt_br: É possível escrever programas que tratam exceções específicas. Observe o exemplo seguinte, que pede dados ao usuário até que um inteiro válido seja fornecido, ainda permitindo que o programa seja interrompido (utilizando :kbd:`Control-C` ou seja lá o que for que o sistema operacional suporte); note que uma interrupção gerada pelo usuário será sinalizada pela exceção :exc:`KeyboardInterrupt`. ::

source: >>> while True: ... try: ... x = int(input("Please enter a number: ")) ... break ... except ValueError: ... print("Oops! That was no valid number. Try again...") ...
pt_br: >>> while True: ... try: ... x = int(input("Insira um número: ")) ... break ... except ValueError: ... print("Ops! Esse não é um número válido. Tente novamente...") ...

source: The :keyword:`try` statement works as follows.
pt_br: A instrução :keyword:`try` funciona da seguinte maneira:

source: First, the *try clause* (the statement(s) between the :keyword:`try` and :keyword:`except` keywords) is executed.
pt_br: Primeiramente, a *cláusula try* (o conjunto de instruções entre as palavras reservadas :keyword:`try` e :keyword:`except` ) é executada.

source: If no exception occurs, the *except clause* is skipped and execution of the :keyword:`try` statement is finished.
pt_br: Se nenhuma exceção ocorrer, a *cláusula except* é ignorada e a execução da instrução :keyword:`try` é finalizada.

source: If an exception occurs during execution of the :keyword:`try` clause, the rest of the clause is skipped. Then, if its type matches the exception named after the :keyword:`except` keyword, the *except clause* is executed, and then execution continues after the try/except block.
pt_br: Se ocorrer uma exceção durante a execução de uma cláusura :keyword:`try`, as instruções remanescentes na cláusula são ignoradas. Se o tipo da exceção ocorrida tiver sido previsto em algum :keyword:`except`, essa *cláusura except* é executada, e então depois a execução continua após o bloco try/except.

source: If an exception occurs which does not match the exception named in the *except clause*, it is passed on to outer :keyword:`try` statements; if no handler is found, it is an *unhandled exception* and execution stops with an error message.
pt_br: Se a exceção levantada não corresponder a nenhuma exceção listada na *cláusula de exceção*, então ela é entregue a uma instrução :keyword:`try` mais externa. Se não existir nenhum tratador previsto para tal exceção, trata-se de uma *exceção não tratada* e a execução do programa termina com uma mensagem de erro.

source: A :keyword:`try` statement may have more than one *except clause*, to specify handlers for different exceptions. At most one handler will be executed. Handlers only handle exceptions that occur in the corresponding *try clause*, not in other handlers of the same :keyword:`!try` statement. An *except clause* may name multiple exceptions as a parenthesized tuple, for example::
pt_br: A instrução :keyword:`try` pode ter uma ou mais *cláusula de exceção*, para especificar múltiplos tratadores para diferentes exceções. No máximo um único tratador será executado. Tratadores só são sensíveis às exceções levantadas no interior da *cláusula de tentativa*, e não às que tenham ocorrido no interior de outro tratador numa mesma instrução :keyword:`!try`. Uma *cláusula de exceção* pode ser sensível a múltiplas exceções, desde que as especifique em uma tupla, por exemplo::

source: A class in an :keyword:`except` clause matches exceptions which are instances of the class itself or one of its derived classes (but not the other way around --- an *except clause* listing a derived class does not match instances of its base classes). For example, the following code will print B, C, D in that order::
pt_br: Uma classe em uma cláusula :keyword:`except` corresponde a exceções que são instâncias da própria classe ou de uma de suas classes derivadas (mas o contrário não é válido --- uma *cláusula except* listando uma classe derivada não corresponde a instâncias de suas classes base). Por exemplo, o seguinte código irá mostrar B, C, D nessa ordem::

source: Note that if the *except clauses* were reversed (with ``except B`` first), it would have printed B, B, B --- the first matching *except clause* is triggered.
pt_br: Se a ordem das *cláusulas de exceção* fosse invertida (``except B`` no início), seria exibido B, B, B --- somente a primeira *cláusula de exceção* compatível é ativada.

source: When an exception occurs, it may have associated values, also known as the exception's *arguments*. The presence and types of the arguments depend on the exception type.
pt_br: Quando uma exceção ocorre, ela pode estar associada a valores chamados *argumentos* da exceção. A presença e os tipos dos argumentos dependem do tipo da exceção.

source: The *except clause* may specify a variable after the exception name. The variable is bound to the exception instance which typically has an ``args`` attribute that stores the arguments. For convenience, builtin exception types define :meth:`~object.__str__` to print all the arguments without explicitly accessing ``.args``. ::
pt_br: A *cláusula except* pode especificar uma variável após o nome da exceção. A variável está vinculada à instância de exceção que normalmente possui um atributo ``args`` que armazena os argumentos. Por conveniência, os tipos de exceção embutidos definem :meth:`~object.__str__` para exibir todos os argumentos sem acessar explicitamente ``.args``. ::

source: >>> try: ... raise Exception('spam', 'eggs') ... except Exception as inst: ... print(type(inst)) # the exception type ... print(inst.args) # arguments stored in .args ... print(inst) # __str__ allows args to be printed directly, ... # but may be overridden in exception subclasses ... x, y = inst.args # unpack args ... print('x =', x) ... print('y =', y) ... <class 'Exception'> ('spam', 'eggs') ('spam', 'eggs') x = spam y = eggs
pt_br: >>> try: ... raise Exception('spam', 'ovos') ... except Exception as inst: ... print(type(inst)) # o tipo da exceção ... print(inst.args) # argumentos armazenados em .args ... print(inst) # __str__ permite imprimir args diretamente, ... # mas pode ser substituído em subclasses de exceção ... x, y = inst.args # desempacota args ... print('x =', x) ... print('y =', y) ... <class 'Exception'> ('spam', 'ovos') ('spam', 'ovos') x = spam y = ovos

source: The exception's :meth:`~object.__str__` output is printed as the last part ('detail') of the message for unhandled exceptions.
pt_br: A saída :meth:`~object.__str__` da exceção é exibida como a última parte ("detalhe") da mensagem para exceções não tratadas.

source: :exc:`BaseException` is the common base class of all exceptions. One of its subclasses, :exc:`Exception`, is the base class of all the non-fatal exceptions. Exceptions which are not subclasses of :exc:`Exception` are not typically handled, because they are used to indicate that the program should terminate. They include :exc:`SystemExit` which is raised by :meth:`sys.exit` and :exc:`KeyboardInterrupt` which is raised when a user wishes to interrupt the program.
pt_br: :exc:`BaseException` é a classe base comum de todas as exceções. Uma de suas subclasses, :exc:`Exception`, é a classe base de todas as exceções não fatais. Exceções que não são subclasses de :exc:`Exception` normalmente não são tratadas, pois são usadas para indicar que o programa deve terminar. Elas incluem :exc:`SystemExit` que é kevantada por :meth:`sys.exit` e :exc:`KeyboardInterrupt` que é levantada quando um usuário deseja interromper o programa.

source: :exc:`Exception` can be used as a wildcard that catches (almost) everything. However, it is good practice to be as specific as possible with the types of exceptions that we intend to handle, and to allow any unexpected exceptions to propagate on.
pt_br: :exc:`Exception` pode ser usada como um curinga que captura (quase) tudo. No entanto, é uma boa prática ser o mais específico possível com os tipos de exceções que pretendemos manipular e permitir que quaisquer exceções inesperadas se propaguem.

source: The most common pattern for handling :exc:`Exception` is to print or log the exception and then re-raise it (allowing a caller to handle the exception as well)::
pt_br: O padrão mais comum para lidar com :exc:`Exception` é imprimir ou registrar a exceção e então levantá-la novamente (permitindo que um chamador lide com a exceção também)::

source: import sys try: f = open('myfile.txt') s = f.readline() i = int(s.strip()) except OSError as err: print("OS error:", err) except ValueError: print("Could not convert data to an integer.") except Exception as err: print(f"Unexpected {err=}, {type(err)=}") raise
pt_br: import sys try: f = open('meuarquivo.txt') s = f.readline() i = int(s.strip()) except OSError as err: print("Erro de E/S:", err) except ValueError: print("Não foi possível converter dados para um inteiro.") except Exception as err: print(f"Não esperava {err=}, {type(err)=}") raise

source: The :keyword:`try` ... :keyword:`except` statement has an optional *else clause*, which, when present, must follow all *except clauses*. It is useful for code that must be executed if the *try clause* does not raise an exception. For example::
pt_br: A construção :keyword:`try` ... :keyword:`except` possui uma *cláusula else* opcional, que quando presente, deve ser colocada depois de todas as outras cláusulas. É útil para um código que precisa ser executado se nenhuma exceção foi levantada. Por exemplo::

source: for arg in sys.argv[1:]: try: f = open(arg, 'r') except OSError: print('cannot open', arg) else: print(arg, 'has', len(f.readlines()), 'lines') f.close()
pt_br: for arg in sys.argv[1:]: try: f = open(arg, 'r') except OSError: print('não foi possível abrir', arg) else: print(arg, 'tem', len(f.readlines()), 'linhas') f.close()

source: The use of the :keyword:`!else` clause is better than adding additional code to the :keyword:`try` clause because it avoids accidentally catching an exception that wasn't raised by the code being protected by the :keyword:`!try` ... :keyword:`!except` statement.
pt_br: É melhor usar a cláusula :keyword:`!else` do que adicionar código adicional à cláusula :keyword:`try` porque ela evita que acidentalmente seja tratada uma exceção que não foi levantada pelo código protegido pela construção com as instruções :keyword:`!try` ... :keyword:`!except`.

source: Exception handlers do not handle only exceptions that occur immediately in the *try clause*, but also those that occur inside functions that are called (even indirectly) in the *try clause*. For example::
pt_br: Os manipuladores de exceção não tratam apenas exceções que ocorrem imediatamente na *cláusula try*, mas também aquelas que ocorrem dentro de funções que são chamadas (mesmo indiretamente) na *cláusula try*. Por exemplo::

source: >>> def this_fails(): ... x = 1/0 ... >>> try: ... this_fails() ... except ZeroDivisionError as err: ... print('Handling run-time error:', err) ... Handling run-time error: division by zero
pt_br: >>> def this_fails(): ... x = 1/0 ... >>> try: ... isso_aqui_falha() ... except ZeroDivisionError as err: ... print('Tratando o erro de tempo execução:', err) ... Tratando o erro de tempo execução: division by zero

source: Raising Exceptions
pt_br: Levantando exceções

source: The :keyword:`raise` statement allows the programmer to force a specified exception to occur. For example::
pt_br: A instrução :keyword:`raise` permite ao programador forçar a ocorrência de um determinado tipo de exceção. Por exemplo::

source: >>> raise NameError('HiThere') Traceback (most recent call last): File "<stdin>", line 1, in <module> raise NameError('HiThere') NameError: HiThere
pt_br: >>> raise NameError('Olá') Traceback (most recent call last): File "<stdin>", line 1, in <module> raise NameError('Olá') NameError: Olá

source: The sole argument to :keyword:`raise` indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from :class:`BaseException`, such as :exc:`Exception` or one of its subclasses). If an exception class is passed, it will be implicitly instantiated by calling its constructor with no arguments::
pt_br: O argumento de :keyword:`raise` indica a exceção a ser levantada. Esse argumento deve ser uma instância de exceção ou uma classe de exceção (uma classe que deriva de :class:`BaseException`, tal como :exc:`Exception` ou uma de suas subclasses). Se uma classe de exceção for passada, será implicitamente instanciada invocando o seu construtor sem argumentos::

source: raise ValueError # shorthand for 'raise ValueError()'
pt_br: raise ValueError # abreviação para 'raise ValueError()'

source: If you need to determine whether an exception was raised but don't intend to handle it, a simpler form of the :keyword:`raise` statement allows you to re-raise the exception::
pt_br: Caso você precise determinar se uma exceção foi levantada ou não, mas não quer manipular o erro, uma forma simples de instrução :keyword:`raise` permite que você levante-a novamente::

source: >>> try: ... raise NameError('HiThere') ... except NameError: ... print('An exception flew by!') ... raise ... An exception flew by! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise NameError('HiThere') NameError: HiThere
pt_br: >>> try: ... raise NameError('Olá') ... except NameError: ... print('Uma exceção passou por aqui!') ... raise ... Uma exceção passou por aqui! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise NameError('Olá') NameError: Olá

source: Exception Chaining
pt_br: Encadeamento de exceções

source: If an unhandled exception occurs inside an :keyword:`except` section, it will have the exception being handled attached to it and included in the error message::
pt_br: Se uma exceção não tratada ocorrer dentro de uma seção :keyword:`except`, ela terá a exceção sendo tratada anexada a ela e incluída na mensagem de erro::

source: >>> try: ... open("database.sqlite") ... except OSError: ... raise RuntimeError("unable to handle error") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> open("database.sqlite") ~~~~^^^^^^^^^^^^^^^^^^^ FileNotFoundError: [Errno 2] No such file or directory: 'database.sqlite' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("unable to handle error") RuntimeError: unable to handle error
pt_br: >>> try: ... open("bancodedados.sqlite") ... except OSError: ... raise RuntimeError("não foi possível tratar o erro") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> open("bancodedados.sqlite") ~~~~^^^^^^^^^^^^^^^^^^^ FileNotFoundError: [Errno 2] No such file or directory: 'bancodedados.sqlite' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: não foi possível tratar o erro

source: To indicate that an exception is a direct consequence of another, the :keyword:`raise` statement allows an optional :keyword:`from<raise>` clause::
pt_br: Para indicar que uma exceção é uma consequência direta de outra, a instrução :keyword:`raise` permite uma cláusula opcional :keyword:`from <raise>`::

source: # exc must be exception instance or None. raise RuntimeError from exc
pt_br: # exc deve ser uma instância de exceção ou None. raise RuntimeError from exc

source: This can be useful when you are transforming exceptions. For example::
pt_br: Isso pode ser útil quando você está transformando exceções. Por exemplo::

source: >>> def func(): ... raise ConnectionError ... >>> try: ... func() ... except ConnectionError as exc: ... raise RuntimeError('Failed to open database') from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> func() ~~~~^^ File "<stdin>", line 2, in func ConnectionError The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError('Failed to open database') from exc RuntimeError: Failed to open database
pt_br: >>> def func(): ... raise ConnectionError ... >>> try: ... func() ... except ConnectionError as exc: ... raise RuntimeError('Falha ao abrir banco de dados') from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> func() ~~~~^^ File "<stdin>", line 2, in func ConnectionError The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: Falha ao abrir banco de dados

source: It also allows disabling automatic exception chaining using the ``from None`` idiom::
pt_br: Ele também permite desabilitar o encadeamento automático de exceções usando o idioma ``from None``::

source: >>> try: ... open('database.sqlite') ... except OSError: ... raise RuntimeError from None ... Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError from None RuntimeError
pt_br: >>> try: ... open('bancodedados.sqlite') ... except OSError: ... raise RuntimeError from None ... Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError from None RuntimeError

source: For more information about chaining mechanics, see :ref:`bltin-exceptions`.
pt_br: Para mais informações sobre os mecanismos de encadeamento, veja :ref:`bltin-exceptions`.

source: User-defined Exceptions
pt_br: Exceções definidas pelo usuário

source: Programs may name their own exceptions by creating a new exception class (see :ref:`tut-classes` for more about Python classes). Exceptions should typically be derived from the :exc:`Exception` class, either directly or indirectly.
pt_br: Programas podem definir novos tipos de exceções, através da criação de uma nova classe (veja :ref:`tut-classes` para mais informações sobre classes Python). Exceções devem ser derivadas da classe :exc:`Exception`, direta ou indiretamente.
