Repository: python/python-docs-pt-br
Catalog: tutorial/floatingpoint.po
Languages: pt_br

source: Floating-Point Arithmetic: Issues and Limitations
pt_br: Aritmética de ponto flutuante: problemas e limitações

source: Floating-point numbers are represented in computer hardware as base 2 (binary) fractions. For example, the **decimal** fraction ``0.625`` has value 6/10 + 2/100 + 5/1000, and in the same way the **binary** fraction ``0.101`` has value 1/2 + 0/4 + 1/8. These two fractions have identical values, the only real difference being that the first is written in base 10 fractional notation, and the second in base 2.
pt_br: Os números de ponto flutuante são representados no hardware do computador como frações de base 2 (binárias). Por exemplo, a fração **decimal** ``0.625`` tem valor 6/10 + 2/100 + 5/1000, e da mesma forma a fração **binária** ``0.101`` tem valor 0/2 + 0/4 + 1/8. Essas duas frações têm valores idênticos, a única diferença real é que a primeira é escrita em notação fracionária de base 10 e a segunda em base 2.

source: Unfortunately, most decimal fractions cannot be represented exactly as binary fractions. A consequence is that, in general, the decimal floating-point numbers you enter are only approximated by the binary floating-point numbers actually stored in the machine.
pt_br: Infelizmente, muitas frações decimais não podem ser representadas precisamente como frações binárias. O resultado é que, em geral, os números decimais de ponto flutuante que você digita acabam sendo armazenados de forma apenas aproximada, na forma de números binários de ponto flutuante.

source: The problem is easier to understand at first in base 10. Consider the fraction 1/3. You can approximate that as a base 10 fraction::
pt_br: O problema é mais fácil de entender primeiro em base 10. Considere a fração 1/3. Podemos representá-la aproximadamente como uma fração base 10::

source: or, better, ::
pt_br: ou melhor, ::

source: and so on. No matter how many digits you're willing to write down, the result will never be exactly 1/3, but will be an increasingly better approximation of 1/3.
pt_br: e assim por diante. Não importa quantos dígitos você está disposto a escrever, o resultado nunca será exatamente 1/3, mas será uma aproximação de cada vez melhor de 1/3.

source: In the same way, no matter how many base 2 digits you're willing to use, the decimal value 0.1 cannot be represented exactly as a base 2 fraction. In base 2, 1/10 is the infinitely repeating fraction ::
pt_br: Da mesma forma, não importa quantos dígitos de base 2 estejas disposto a usar, o valor decimal 0.1 não pode ser representado exatamente como uma fração de base 2. No sistema de base 2, 1/10 é uma fração binária que se repete infinitamente::

source: Stop at any finite number of bits, and you get an approximation. On most machines today, floats are approximated using a binary fraction with the numerator using the first 53 bits starting with the most significant bit and with the denominator as a power of two. In the case of 1/10, the binary fraction is ``3602879701896397 / 2 ** 55`` which is close to but not exactly equal to the true value of 1/10.
pt_br: Se parares em qualquer número finito de bits, obterás uma aproximação. Hoje em dia, na maioria dos computadores, as casas decimais são aproximados usando uma fração binária onde o numerado utiliza os primeiros 53 bits iniciando no bit mais significativo e tendo como denominador uma potência de dois. No caso de 1/10, a fração binária seria ``602879701896397 / 2 ** 55`` o que chega bem perto, mas mesmo assim, não é igual ao valor original de 1/10.

source: Many users are not aware of the approximation because of the way values are displayed. Python only prints a decimal approximation to the true decimal value of the binary approximation stored by the machine. On most machines, if Python were to print the true decimal value of the binary approximation stored for 0.1, it would have to display::
pt_br: É fácil esquecer que o valor armazenado é uma aproximação da fração decimal original, devido à forma como os pontos flutuantes são exibidos no interpretador interativo. O Python exibe apenas uma aproximação decimal do verdadeiro valor decimal da aproximação binária armazenada pela máquina. Se o Python exibisse o verdadeiro valor decimal da aproximação binária que representa o decimal 0.1, seria necessário mostrar::

source: That is more digits than most people find useful, so Python keeps the number of digits manageable by displaying a rounded value instead:
pt_br: Isto contém muito mais dígitos do que é o esperado e utilizado pela grande maioria dos desenvolvedores, portanto, o Python limita o número de dígitos exibidos, apresentando um valor arredondado, ao invés de mostrar todas as casas decimais::

source: Just remember, even though the printed result looks like the exact value of 1/10, the actual stored value is the nearest representable binary fraction.
pt_br: Lembre-se, mesmo que o resultado impresso seja o valor exato de 1/10, o valor que verdadeiramente estará armazenado será uma fração binária representável que mais se aproxima.

source: Interestingly, there are many different decimal numbers that share the same nearest approximate binary fraction. For example, the numbers ``0.1`` and ``0.10000000000000001`` and ``0.1000000000000000055511151231257827021181583404541015625`` are all approximated by ``3602879701896397 / 2 ** 55``. Since all of these decimal values share the same approximation, any one of them could be displayed while still preserving the invariant ``eval(repr(x)) == x``.
pt_br: Curiosamente, existem muitos números decimais diferentes que compartilham a mesma fração binária aproximada. Por exemplo, os números ``0.1`` ou o ``0.10000000000000001`` e ``0.1000000000000000055511151231257827021181583404541015625`` são todos aproximações de ``3602879701896397 / 2 ** 55``. Como todos esses valores decimais compartilham um mesma de aproximação, qualquer um poderá ser exibido enquanto for preservado o invariante ``eval(repr(x)) == x``.

source: Historically, the Python prompt and built-in :func:`repr` function would choose the one with 17 significant digits, ``0.10000000000000001``. Starting with Python 3.1, Python (on most systems) is now able to choose the shortest of these and simply display ``0.1``.
pt_br: Historicamente, o prompt do Python e a função embutida :func:`repr` utilizariam o que contivesse 17 dígitos significativos, ``0.10000000000000001``. Desde a versão do Python 3.1, o Python (na maioria dos sistemas) agora é possível optar pela forma mais reduzida, exibindo simplesmente o número ``0.1``.

source: Note that this is in the very nature of binary floating point: this is not a bug in Python, and it is not a bug in your code either. You'll see the same kind of thing in all languages that support your hardware's floating-point arithmetic (although some languages may not *display* the difference by default, or in all output modes).
pt_br: Note que essa é a própria natureza do ponto flutuante binário: não é um bug do Python, e nem é um bug do seu código. Essa situação pode ser observada em todas as linguagens que usam as instruções aritméticas de ponto flutuante do hardware (apesar de algumas linguagens não *mostrarem* a diferença, por padrão, ou em todos os modos de saída).

source: For more pleasant output, you may wish to use string formatting to produce a limited number of significant digits:
pt_br: Para obter um valor mais agradável, poderás utilizar a formatação de sequência de caracteres para produzir um número limitado de dígitos significativos:

source: >>> format(math.pi, '.12g') # give 12 significant digits '3.14159265359' >>> format(math.pi, '.2f') # give 2 digits after the point '3.14' >>> repr(math.pi) '3.141592653589793'
pt_br: >>> format(math.pi, '.12g') # ponto flutuante fornece 12 dígitos significativos '3.14159265359' >>> format(math.pi, '.2f') # ponto flutuante fornece 2 dígitos significativos '3.14' >>> repr(math.pi) '3.141592653589793'

source: It's important to realize that this is, in a real sense, an illusion: you're simply rounding the *display* of the true machine value.
pt_br: É importante perceber que tudo não passa de pura ilusão: estas simplesmente arredondando a *exibição* da verdadeira maquinaria do valor.

source: One illusion may beget another. For example, since 0.1 is not exactly 1/10, summing three values of 0.1 may not yield exactly 0.3, either:
pt_br: Uma ilusão pode gerar outra. Por exemplo, uma vez que 0.1 não é exatamente 1/10, somar três vezes o valor 0.1, não garantirá que o resultado seja exatamente 0.3, isso porque:

source: Also, since the 0.1 cannot get any closer to the exact value of 1/10 and 0.3 cannot get any closer to the exact value of 3/10, then pre-rounding with :func:`round` function cannot help:
pt_br: Inclusive, uma vez que o 0.1 não consegue aproximar-se do valor exato de 1/10 e 0.3 não pode se aproximar mais do valor exato de 3/10, temos então que o pré-arredondamento com a função :func:`round` não servirá como ajuda:

source: Though the numbers cannot be made closer to their intended exact values, the :func:`math.isclose` function can be useful for comparing inexact values:
pt_br: Embora os números não possam se aproximar mais dos exatos valores que desejamos, a função :func:`math.isclose` poderá ser útil para comparar valores inexatos:

source: Alternatively, the :func:`round` function can be used to compare rough approximations:
pt_br: Alternativamente, a função :func:`round` pode ser usada para comparar aproximações aproximadas:

source: Binary floating-point arithmetic holds many surprises like this. The problem with "0.1" is explained in precise detail below, in the "Representation Error" section. See `Examples of Floating Point Problems <https://jvns.ca/blog/2023/01/13/examples-of-floating-point-problems/>`_ for a pleasant summary of how binary floating point works and the kinds of problems commonly encountered in practice. Also see `The Perils of Floating Point <http://www.indowsway.com/floatingpoint.htm>`_ for a more complete account of other common surprises.
pt_br: A aritmética binária de ponto flutuante contém muitas surpresas como essa. O problema com "0.1" é explicado em detalhes precisos abaixo, na seção "Erro de representação". Consulte `Exemplos de problemas de ponto flutuante <https://jvns.ca/blog/2023/01/13/examples-of-floating-point-problems/>`_ (em inglês) para obter um resumo agradável de como o ponto flutuante binário funciona e os tipos de problemas comumente encontrados na prática. Veja também `Os perigos do ponto flutuante <http://www.indowsway.com/floatingpoint.htm>`_ (em inglês) para um relato mais completo de outras surpresas comuns.

source: As that says near the end, "there are no easy answers." Still, don't be unduly wary of floating point! The errors in Python float operations are inherited from the floating-point hardware, and on most machines are on the order of no more than 1 part in 2\*\*53 per operation. That's more than adequate for most tasks, but you do need to keep in mind that it's not decimal arithmetic and that every float operation can suffer a new rounding error.
pt_br: Como dizemos perto do final, "não há respostas fáceis". Ainda assim, não se percam indevidamente no uso do ponto flutuante! Os erros nas operações do tipo float do Python são heranças do hardware de ponto flutuante e, a maioria dos computadores estão na ordem de não mais do que 1 parte em 2\*\*53 por operação. Isso é mais do que o suficiente para a maioria das tarefas, portanto, é importante lembrar que não se trata de uma aritmética decimal e que toda operação com o tipo float poderá via a apresentar novos problemas referentes ao arredondamento.

source: While pathological cases do exist, for most casual use of floating-point arithmetic you'll see the result you expect in the end if you simply round the display of your final results to the number of decimal digits you expect. :func:`str` usually suffices, and for finer control see the :meth:`str.format` method's format specifiers in :ref:`formatstrings`.
pt_br: Embora existam casos patológicos, na maior parte das vezes, terás como resultado final o valor esperado, se simplesmente arredondares a exibição final dos resultados para a quantidade de dígitos decimais que esperas a função :func:`str` geralmente será o suficiente, e , para seja necessário um valor refinado, veja os especificadores de formato :meth:`str.format` contido na seção :ref:`formatstrings`.

source: For use cases which require exact decimal representation, try using the :mod:`decimal` module which implements decimal arithmetic suitable for accounting applications and high-precision applications.
pt_br: Para as situações que exijam uma representação decimal exata, experimente o módulo :mod:`decimal` que possui, a implementação de uma adequada aritmética decimal bastante utilizada nas aplicações contábeis e pelas aplicações que demandam alta precisão.

source: Another form of exact arithmetic is supported by the :mod:`fractions` module which implements arithmetic based on rational numbers (so the numbers like 1/3 can be represented exactly).
pt_br: Uma outra forma de obter uma aritmética exata tem suporte pelo módulo :mod:`fracções` que implementa a aritmética baseada em números racionais (portanto, os números fracionários como o 1/3 conseguem uma representação precisa).

source: If you are a heavy user of floating-point operations you should take a look at the NumPy package and many other packages for mathematical and statistical operations supplied by the SciPy project. See <https://scipy.org>.
pt_br: Caso necessites fazer um intenso uso das operações de ponto flutuante, é importante que conheças o pacote NumPy e, também é importante dizer, que existem diversos pacotes destinados ao trabalho intenso com operações matemáticas e estatísticas que são fornecidas pelo projeto SciPy. Veja <https://scipy.org>.

source: Python provides tools that may help on those rare occasions when you really *do* want to know the exact value of a float. The :meth:`float.as_integer_ratio` method expresses the value of a float as a fraction:
pt_br: O Python fornece ferramentas que podem ajudar nessas raras ocasiões em que realmente *faz* necessário conhecer o valor exato de um ponto flutuante. O método :meth:`float.as_integer_ratio` expressa o valor de um número do tipo float em sua forma fracionária:

source: Since the ratio is exact, it can be used to losslessly recreate the original value:
pt_br: Uma vez que a relação seja exata, será possível utiliza-la para obter, sem que haja quaisquer perda do valor original:

source: The :meth:`float.hex` method expresses a float in hexadecimal (base 16), again giving the exact value stored by your computer:
pt_br: O método :meth:`float.hex` expressa um ponto flutuante em hexadecimal (base 16), o mesmo também retornará o valor exato pelo computador:

source: This precise hexadecimal representation can be used to reconstruct the float value exactly:
pt_br: Sua precisa representação hexadecimal poderá ser utilizada para reconstruir o valor exato do ponto flutuante:

source: Since the representation is exact, it is useful for reliably porting values across different versions of Python (platform independence) and exchanging data with other languages that support the same format (such as Java and C99).
pt_br: Como a representação será exata, é interessante utilizar valores confiáveis em diferentes versões do Python (independente da plataforma) e a troca de dados entre idiomas diferentes que forneçam o mesmo formato (como o Java e o C99).

source: Another helpful tool is the :func:`sum` function which helps mitigate loss-of-precision during summation. It uses extended precision for intermediate rounding steps as values are added onto a running total. That can make a difference in overall accuracy so that the errors do not accumulate to the point where they affect the final total:
pt_br: Uma outra ferramenta que poderá ser útil é a função :func:`sum` que ajuda a mitigar a perda de precisão durante a soma. Ele usa precisão estendida para etapas intermediárias de arredondamento, pois os valores serão adicionados a um total em execução. Isso poderá fazer a diferença na precisão geral de forma que os erros não se acumulem chegando ao ponto de afetar o resultado final:

source: The :func:`math.fsum` goes further and tracks all of the "lost digits" as values are added onto a running total so that the result has only a single rounding. This is slower than :func:`sum` but will be more accurate in uncommon cases where large magnitude inputs mostly cancel each other out leaving a final sum near zero:
pt_br: A função :func:`math.fsum` vai além e rastreia todos os "dígitos perdidos" à medida que os valores são adicionados a um total contínuo, de modo que o resultado tenha apenas um único arredondamento. Isso é mais lento que :func:`sum`, mas será mais preciso em casos incomuns em que entradas de grande magnitude se cancelam, deixando uma soma final próxima de zero:

source: >>> arr = [-0.10430216751806065, -266310978.67179024, 143401161448607.16, ... -143401161400469.7, 266262841.31058735, -0.003244936839808227] >>> float(sum(map(Fraction, arr))) # Exact summation with single rounding 8.042173697819788e-13 >>> math.fsum(arr) # Single rounding 8.042173697819788e-13 >>> sum(arr) # Multiple roundings in extended precision 8.042178034628478e-13 >>> total = 0.0 >>> for x in arr: ... total += x # Multiple roundings in standard precision ... >>> total # Straight addition has no correct digits! -0.0051575902860057365
pt_br: >>> arr = [-0.10430216751806065, -266310978.67179024, 143401161448607.16, ... -143401161400469.7, 266262841.31058735, -0.003244936839808227] >>> float(sum(map(Fraction, arr))) # Soma exata com arredondamento simples 8.042173697819788e-13 >>> math.fsum(arr) # Arredondamento simples 8.042173697819788e-13 >>> sum(arr) # Arredondamentos múltiplos em precisão estendida 8.042178034628478e-13 >>> total = 0.0 >>> for x in arr: ... total += x # Arredondamentos múltiplos em precisão padrão ... >>> total # A adição direta não tem dígitos corretos! -0.0051575902860057365

source: Representation Error
pt_br: Erro de representação

source: This section explains the "0.1" example in detail, and shows how you can perform an exact analysis of cases like this yourself. Basic familiarity with binary floating-point representation is assumed.
pt_br: Esta seção explica o exemplo do "0.1" em detalhes, e mostra como poderás realizar uma análise exata de casos semelhantes. Presumimos que tenhas uma familiaridade básica com a representação binária de ponto flutuante.

source: :dfn:`Representation error` refers to the fact that some (most, actually) decimal fractions cannot be represented exactly as binary (base 2) fractions. This is the chief reason why Python (or Perl, C, C++, Java, Fortran, and many others) often won't display the exact decimal number you expect.
pt_br: :dfn:`Erro de representação` refere-se ao fato de que algumas frações decimais (a maioria, na verdade) não podem ser representadas exatamente como frações binárias (base 2). Esta é a principal razão por que o Python (ou Perl, C, C++, Java, Fortran, e muitas outras) frequentemente não exibe o número decimal exato conforme o esperado::

source: Why is that? 1/10 is not exactly representable as a binary fraction. Since at least 2000, almost all machines use IEEE 754 binary floating-point arithmetic, and almost all platforms map Python floats to IEEE 754 binary64 "double precision" values. IEEE 754 binary64 values contain 53 bits of precision, so on input the computer strives to convert 0.1 to the closest fraction it can of the form *J*/2**\ *N* where *J* is an integer containing exactly 53 bits. Rewriting ::
pt_br: Por que isso acontece? 1/10 não é representado exatamente sendo fração binária. Desde pelo menos 2000, quase todas as máquinas usam aritmética binária de ponto flutuante da IEEE 754 e quase todas as plataformas representam pontos flutuante do Python como valores binary64 de "double precision" (dupla precisão) da IEEE 754. Os valores binary64 da IEEE 754 têm 53 bits de precisão, por isso na entrada o computador se esforça para converter "0.1" para a fração mais próxima que puder, na forma *J*/2**\ *N* onde *J* é um número inteiro contendo exatamente 53 bits. Reescrevendo::

source: as ::
pt_br: como ::

source: and recalling that *J* has exactly 53 bits (is ``>= 2**52`` but ``< 2**53``), the best value for *N* is 56:
pt_br: e recordando que *J* tenha exatamente 53 bits (é ``>= 2**52``, mas ``< 2**53``), o melhor valor para *N* é 56::

source: That is, 56 is the only value for *N* that leaves *J* with exactly 53 bits. The best possible value for *J* is then that quotient rounded:
pt_br: Ou seja, 56 é o único valor de *N* que deixa *J* com exatamente 53 bits. Portanto, o melhor valor que conseguimos obter pra *J* será aquele que possui o quociente arredondado:

source: Since the remainder is more than half of 10, the best approximation is obtained by rounding up:
pt_br: Uma vez que o resto seja maior do que a metade de 10, a melhor aproximação que poderá ser obtida se arredondarmos para cima:

source: Therefore the best possible approximation to 1/10 in IEEE 754 double precision is::
pt_br: Portanto, a melhor aproximação possível de 1/10 como um "IEEE 754 double precision" é::

source: Dividing both the numerator and denominator by two reduces the fraction to::
pt_br: Dividir o numerador e o denominador por dois reduzirá a fração para::

source: Note that since we rounded up, this is actually a little bit larger than 1/10; if we had not rounded up, the quotient would have been a little bit smaller than 1/10. But in no case can it be *exactly* 1/10!
pt_br: Note que, como arredondamos para cima, esse valor é, de fato, um pouco maior que 1/10; se não tivéssemos arredondado para cima, o quociente teria sido um pouco menor que 1/10. Mas em nenhum caso seria possível obter *exatamente* o valor 1/10!

source: So the computer never "sees" 1/10: what it sees is the exact fraction given above, the best IEEE 754 double approximation it can get:
pt_br: Por isso, o computador nunca "vê" 1/10: o que ele vê é exatamente a fração que é obtida pra cima, a melhor aproximação "IEEE 754 double" possível é:

source: If we multiply that fraction by 10\*\*55, we can see the value out to 55 decimal digits:
pt_br: Se multiplicarmos essa fração por 10\*\*55, podemos ver o valor contendo os 55 dígitos mais significativos:

source: meaning that the exact number stored in the computer is equal to the decimal value 0.1000000000000000055511151231257827021181583404541015625. Instead of displaying the full decimal value, many languages (including older versions of Python), round the result to 17 significant digits:
pt_br: o que significa que o número exato armazenado no computador é igual ao valor decimal 0.1000000000000000055511151231257827021181583404541015625. Em vez de exibir o valor decimal completo, muitas linguagens (incluindo versões mais antigas do Python), arredondam o resultado para 17 dígitos significativos:

source: The :mod:`fractions` and :mod:`decimal` modules make these calculations easy:
pt_br: Módulos como o :mod:`fractions` e o :mod:`decimal` tornam esses cálculos muito mais fáceis:
