Repository: python/python-docs-pt-br
Catalog: tutorial/inputoutput.po
Languages: pt_br

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
pt_br: Em modo texto, o padrão durante a leitura é converter terminadores de linha específicos da plataforma (``\n`` no Unix, ``\r\n`` no Windows) para apenas ``\n``. Ao escrever no modo de texto, o padrão é converter as ocorrências de ``\n`` de volta para os finais de linha específicos da plataforma. Essa modificação de bastidores nos dados do arquivo é adequada para arquivos de texto, mas corromperá dados binários, como arquivos :file:`JPEG` ou :file:`EXE`. Tenha muito cuidado para só usar o modo binário, ao ler e gravar esses arquivos.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
pt_br: É uma boa prática usar a palavra-chave :keyword:`with` ao lidar com arquivos. A vantagem é que o arquivo é fechado corretamente após o término de sua utilização, mesmo que uma exceção seja levantada em algum momento. Usar :keyword:`!with` também é muito mais curto que escrever seu bloco equivalente :keyword:`try`\ -\ :keyword:`finally`::

source: >>> with open('workfile', encoding="utf-8") as f: ... read_data = f.read() >>> # We can check that the file has been automatically closed. >>> f.closed True
pt_br: >>> with open('arquivo_de_trabalho', encoding="utf-8") as f: ... read_data = f.read() >>> # Podemos verificar se o arquivo foi fechado automaticamente. >>> f.closed True

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
pt_br: Se você não está usando a palavra reservada :keyword:`with`, então você deveria chamar ``f.close()`` para fechar o arquivo e imediatamente liberar qualquer recurso do sistema usado por ele.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
pt_br: Chamar ``f.write()`` sem usar a palavra reservada :keyword:`!with` ou chamar ``f.close()`` **pode** resultar nos argumentos de ``f.write()`` não serem completamente escritos no disco, mesmo se o programa for encerrado com êxito.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
pt_br: Depois que um arquivo é fechado, seja por uma instrução :keyword:`with` ou chamando ``f.close()``, as tentativas de usar o arquivo falharão automaticamente. ::

source: Methods of File Objects
pt_br: Métodos de objetos arquivo

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
pt_br: Para simplificar, o resto dos exemplos nesta seção presumem que um objeto arquivo chamado ``f`` já foi criado.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
pt_br: Para ler o conteúdo de um arquivo, chame ``f.read(tamanho)``, que lê um punhado de dados devolvendo-os como uma string (em modo texto) ou bytes (em modo binário). *tamanho* é um argumento numérico opcional. Quando *tamanho* é omitido ou negativo, todo o conteúdo do arquivo é lido e devolvido; se o arquivo é duas vezes maior que memória da máquina, o problema é seu. Caso contrário, no máximo *tamanho* caracteres (em modo texto) ou *tamanho* bytes (em modo binário) são lidos e devolvidos. Se o fim do arquivo for atingido, ``f.read()`` devolve uma string vazia (``''``). ::

source: >>> f.read() 'This is the entire file.\n' >>> f.read() ''
pt_br: >>> f.read() 'Este é o arquivo inteiro.\n' >>> f.read() ''

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
pt_br: O método ``f.readline()`` lê uma única linha do arquivo; o caractere de quebra de linha (``\n``) é mantido ao final da string, e só é omitido na última linha do arquivo, se o arquivo não terminar com uma quebra de linha. Isso elimina a ambiguidade do valor retornado; se ``f.readline()`` retorna uma string vazia, o fim do arquivo foi atingido. Linhas em branco são representadas por um ``'\n'`` -- uma string contendo apenas o caractere terminador de linha. ::

source: >>> f.readline() 'This is the first line of the file.\n' >>> f.readline() 'Second line of the file\n' >>> f.readline() ''
pt_br: >>> f.readline() 'Está é a primeira linha do arquivo.\n' >>> f.readline() 'Segunda linha do arquivo\n' >>> f.readline() ''

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
pt_br: Uma maneira alternativa de ler linhas do arquivo é iterar diretamente pelo objeto arquivo. É eficiente, rápido e resulta em código mais simples::

source: >>> for line in f: ... print(line, end='') ... This is the first line of the file. Second line of the file
pt_br: >>> for line in f: ... print(line, end='') ... Esta é a primeira linha do arquivo. Segunda linha do arquivo

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
pt_br: Se desejar ler todas as linhas de um arquivo em uma lista, pode-se usar ``list(f)`` ou ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
pt_br: ``f.write(string)`` escreve o conteúdo de *string* para o arquivo, retornando o número de caracteres escritos. ::

source: >>> f.write('This is a test\n') 15
pt_br: >>> f.write('Este é um teste\n') 15

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
pt_br: Outros tipos de objetos precisam ser convertidos -- seja para uma string (em modo texto) ou para bytes (em modo binário) -- antes de escrevê-los::

source: >>> value = ('the answer', 42) >>> s = str(value) # convert the tuple to string >>> f.write(s) 18
pt_br: >>> value = ('a resposta', 42) >>> s = str(value) # converte a tupla para string >>> f.write(s) 18

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
pt_br: ``f.tell()`` retorna um inteiro dando a posição atual do objeto arquivo, no arquivo representado, como número de bytes desde o início do arquivo, no modo binário, e um número ininteligível, quando no modo de texto.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
pt_br: Para mudar a posição, use ``f.seek(offset, de_onde)``. A nova posição é computada pela soma do deslocamento *offset* a um ponto de referência especificado pelo argumento *de-onde*. Se o valor de *de_onde* é 0,a referência é o início do arquivo, 1 refere-se à posição atual, e 2 refere-se ao fim do arquivo. Este argumento pode ser omitido e o valor padrão é 0, usando o início do arquivo como referência. ::

source: >>> f = open('workfile', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Go to the 6th byte in the file 5 >>> f.read(1) b'5' >>> f.seek(-3, 2) # Go to the 3rd byte before the end 13 >>> f.read(1) b'd'
pt_br: >>> f = open('arquivo_de_trabalho', 'rb+') >>> f.write(b'0123456789abcdef') 16 >>> f.seek(5) # Vai até o 6º byte no arquivo 5 >>> f.read(1) b'5' >>> f.seek(-3, 2) # Vai até o 3º byte antes do fim 13 >>> f.read(1) b'd'

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
pt_br: Em arquivos texto (abertos sem um ``b``, em modo string), somente *seeks* relativos ao início do arquivo serão permitidos (exceto se for indicado o final do arquivo, com ``seek(0, 2)``) e o único valor válido para *offset* são aqueles retornados por chamada à ``f.tell()``, ou zero. Qualquer outro valor para *offset* produz um comportamento indefinido.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
pt_br: Objetos arquivo tem alguns métodos adicionais, como :meth:`~io.IOBase.isatty` e :meth:`~io.IOBase.truncate` que não são usados com frequência; consulte a Biblioteca de Referência para um guia completo de objetos arquivo.

source: Saving structured data with :mod:`json`
pt_br: Gravando dados estruturados com :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
pt_br: Strings podem ser facilmente gravadas e lidas em um arquivo. Números dão um pouco mais de trabalho, já que o método :meth:`~io.TextIOBase.read` só retorna strings, que terão que ser passadas para uma função como :func:`int`, que pega uma string como ``'123'`` e retorna seu valor numérico 123. Quando você deseja salvar tipos de dados mais complexos, como listas e dicionários aninhados, a análise e serialização manual tornam-se complicadas.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
pt_br: Ao invés de ter usuários constantemente escrevendo e depurando código para gravar tipos complicados de dados em arquivos, o Python permite que se use o popular formato de troca de dados chamado `JSON (JavaScript Object Notation) <https://json.org>`_. O módulo padrão chamado :mod:`json` pode pegar hierarquias de dados em Python e convertê-las em representações de strings; esse processo é chamado :dfn:`serialização`. Reconstruir os dados estruturados da representação string é chamado :dfn:`desserialização`. Entre serializar e desserializar, a string que representa o objeto pode ser armazenada em um arquivo, ou estrutura de dados, ou enviada por uma conexão de rede para alguma outra máquina.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
pt_br: O formato JSON é comumente usado por aplicativos modernos para permitir troca de dados. Pessoas que programam já estão familiarizadas com esse formato, o que o torna uma boa opção para interoperabilidade.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
pt_br: Um objeto ``x``, pode ser visualizado na sua representação JSON com uma simples linha de código::

source: >>> import json >>> x = [1, 'simple', 'list'] >>> json.dumps(x) '[1, "simple", "list"]'
pt_br: >>> import json >>> x = [1, 'lista', 'simples'] >>> json.dumps(x) '[1, "lista", "simples"]'

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
pt_br: Outra variação da função :func:`~json.dumps`, chamada :func:`~json.dump`, serializa o objeto para um :term:`arquivo texto`. Se ``f`` é um :term:`arquivo texto` aberto para escrita, podemos fazer isto::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
pt_br: Para decodificar o objeto novamente, se ``f`` é um objeto :term:`arquivo binário` ou :term:`arquivo texto` que foi aberto para leitura::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
pt_br: Arquivos JSON devem ser codificados em UTF-8. Use ``encoding="utf-8"`` quando abrir um arquivo JSON como um :term:`arquivo texto` tanto para leitura quanto para escrita.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
pt_br: Essa técnica de serialização simples pode manipular listas e dicionários, mas a serialização de instâncias de classes arbitrárias no JSON requer um pouco mais de esforço. A referência para o módulo :mod:`json` contém uma explicação disso.

source: :mod:`pickle` - the pickle module
pt_br: O módulo :mod:`pickle`

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
pt_br: Ao contrário do :ref:`JSON <tut-json>`, *pickle* é um protocolo que permite a serialização de objetos Python arbitrariamente complexos. Por isso, é específico do Python e não pode ser usado para se comunicar com aplicativos escritos em outros linguagens. Também é inseguro por padrão: desserializar dados de pickle, provenientes de uma fonte não confiável, pode executar código arbitrário, se os dados foram criados por um invasor habilidoso.

source: formatted string literal
pt_br: literal de string formatado

source: interpolated string literal
pt_br: literal de string interpolada

source: formatted literal
pt_br: literal formatado

source: interpolated literal
pt_br: literal interpolado

source: built-in function
pt_br: função embutida

source: object
pt_br: objeto

source: file
pt_br: arquivo

source: module
pt_br: módulo
