Repository: python/python-docs-pt-br
Catalog: tutorial/inputoutput.po
Languages: pt_br

source: Input and Output
pt_br: Entrada e Saída

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
pt_br: Existem várias maneiras de apresentar a saída de um programa; os dados podem ser exibidos em forma legível para seres humanos, ou escritos em arquivos para uso posterior. Este capítulo apresentará algumas das possibilidades.

source: Fancier Output Formatting
pt_br: Refinando a formatação de saída

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`~io.TextIOBase.write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
pt_br: Até agora vimos duas maneiras de exibir valores: *expressões* e a função :func:`print`. (Uma outra maneira é utilizar o método :meth:`~io.TextIOBase.write` de objetos do tipo arquivo; o arquivo saída padrão pode ser referenciado como ``sys.stdout``. Veja a Referência da Biblioteca Python para mais informações sobre isso.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
pt_br: Muitas vezes se deseja mais controle sobre a formatação da saída do que simplesmente exibir valores separados por espaço. Existem várias maneiras de formatar a saída.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
pt_br: Para usar :ref:`strings literais formatadas <tut-f-strings>`, comece uma string com ``f`` ou ``F``, antes de abrir as aspas ou aspas triplas. Dentro dessa string, pode-se escrever uma expressão Python entre caracteres ``{`` e ``}``, que podem se referir a variáveis, ou valores literais.

source: >>> year = 2016 >>> event = 'Referendum' >>> f'Results of the {year} {event}' 'Results of the 2016 Referendum'
pt_br: >>> ano = 2016 >>> evento = 'Referendo' >>> f'Resultados do {evento} {ano}' 'Resultados do Referendo 2016'

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted. In the following code block there are two examples of how to format variables:
pt_br: O método de strings :meth:`str.format` requer mais esforço manual. Ainda será necessário usar ``{`` e ``}`` para marcar onde a variável será substituída e pode-se incluir diretivas de formatação detalhadas, mas também precisará incluir a informação a ser formatada. No bloco de código a seguir há dois exemplos de como formatar variáveis:

source: >>> yes_votes = 42_572_654 >>> total_votes = 85_705_149 >>> percentage = yes_votes / total_votes >>> '{:-9} YES votes {:2.2%}'.format(yes_votes, percentage) ' 42572654 YES votes 49.67%'
pt_br: >>> votos_sim = 42_572_654 >>> votos_totais = 85_705_149 >>> porcentagem = votos_sim / votos_totais >>> '{:-9} votos SIM {:2.2%}'.format(votos_sim, porcentagem) ' 42572654 votos SIM 49.67%'

source: Notice how the ``yes_votes`` are padded with spaces and a negative sign only for negative numbers. The example also prints ``percentage`` multiplied by 100, with 2 decimal places and followed by a percent sign (see :ref:`formatspec` for details).
pt_br: Observe como ``yes_votes`` são preenchidos com espaços e um sinal negativo apenas para números negativos. O exemplo também imprime ``percentage`` multiplicado por 100, com 2 casas decimais e seguido por um sinal de porcentagem (veja :ref:`formatspec` para detalhes).

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
pt_br: Finalmente, pode-se fazer todo o tratamento da saída usando as operações de fatiamento e concatenação de strings para criar qualquer layout que se possa imaginar. O tipo string possui alguns métodos que realizam operações úteis para preenchimento de strings para uma determinada largura de coluna.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
pt_br: Quando não é necessário sofisticar a saída, mas apenas exibir algumas variáveis com propósito de depuração, pode-se converter qualquer valor para uma string com as funções :func:`repr` ou :func:`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
pt_br: A função :func:`str` serve para retornar representações de valores que sejam legíveis para as pessoas, enquanto :func:`repr` é para gerar representações que o interpretador Python consegue ler (ou levantará uma exceção :exc:`SyntaxError`, se não houver sintaxe equivalente). Para objetos que não têm uma representação adequada para consumo humano, :func:`str` devolve o mesmo valor que :func:`repr`. Muitos valores, tal como números ou estruturas, como listas e dicionários, têm a mesma representação usando quaisquer das funções. Strings, em particular, têm duas representações distintas.

source: Some examples::
pt_br: Alguns exemplos:

source: >>> s = 'Hello, world.' >>> str(s) 'Hello, world.' >>> repr(s) "'Hello, world.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'The value of x is ' + repr(x) + ', and y is ' + repr(y) + '...' >>> print(s) The value of x is 32.5, and y is 40000... >>> # The repr() of a string adds string quotes and backslashes: >>> hello = 'hello, world\n' >>> hellos = repr(hello) >>> print(hellos) 'hello, world\n' >>> # The argument to repr() may be any Python object: >>> repr((x, y, ('spam', 'eggs'))) "(32.5, 40000, ('spam', 'eggs'))"
pt_br: >>> s = 'Olá, mundo.' >>> str(s) 'Olá, mundo.' >>> repr(s) "'Olá, mundo.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'O valor de x é ' + repr(x) + ' e de y é ' + repr(y) + '...' >>> print(s) O valor de x é 32.5 e de y é 40000... >>> # A repr() da string adiciona aspas e contrabarras: >>> olá = 'olá, mundo\n' >>> olás = repr(olá) >>> print(olás) 'olá, mundo\n' >>> # O argumento de repr() pode ser qualquer objeto Python: >>> repr((x, y, ('spam', 'ovos'))) "(32.5, 40000, ('spam', 'ovos'))"

source: The :mod:`string` module contains support for a simple templating approach based upon regular expressions, via :class:`string.Template`. This offers yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary. This syntax is easy to use, although it offers much less control for formatting.
pt_br: O módulo :mod:`string` contém suporte para uma abordagem simples de criação de modelos baseada em expressões regulares, via :class:`string.Template`. Isso oferece outra maneira de substituir valores em strings, usando espaços reservados como ``$x`` e substituindo-os por valores de um dicionário. Essa sintaxe é fácil de usar, embora ofereça muito menos controle sobre a formatação.

source: Formatted String Literals
pt_br: Strings literais formatadas

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
pt_br: :ref:`Strings literais formatadas <f-strings>` (também chamadas f-strings, para abreviar) permite que se inclua o valor de expressões Python dentro de uma string, prefixando-a com ``f`` ou ``F`` e escrevendo expressões na forma ``{expression}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
pt_br: Um especificador opcional de formato pode ser incluído após a expressão. Isso permite maior controle sobre como o valor é formatado. O exemplo a seguir arredonda pi para três casas decimais::

source: >>> import math >>> print(f'The value of pi is approximately {math.pi:.3f}.') The value of pi is approximately 3.142.
pt_br: >>> import math >>> print(f'O valor de pi é aproximadamente {math.pi:.3f}.') O valor de pi é aproximadamente 3.142.

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
pt_br: Passando um inteiro após o ``':'`` fará com que o campo tenha um número mínimo de caracteres de largura. Isso é útil para alinhar colunas. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for name, phone in table.items(): ... print(f'{name:10} ==> {phone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678
pt_br: >>> tabela = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for nome, telefone in tabela.items(): ... print(f'{n9me:10} ==> {telefone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
pt_br: Outros modificadores podem ser usados para converter o valor antes de ser formatado. ``'!a'`` aplica a função :func:`ascii`, ``'!s'`` aplica a função :func:`str` e ``'!r'`` aplica a função :func:`repr` ::

source: >>> animals = 'eels' >>> print(f'My hovercraft is full of {animals}.') My hovercraft is full of eels. >>> print(f'My hovercraft is full of {animals!r}.') My hovercraft is full of 'eels'.
pt_br: >>> animais = 'enguias' >>> print(f'Meu hovercraft está cheio de {animais}.') Meu hovercraft está cheio de enguias. >>> print(f'Meu hovercraft está cheio de {animais!r}.') Meu hovercraft está cheio de 'enguias'.

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression:
pt_br: O especificador ``=`` pode ser usado para expandir uma expressão para o texto da expressão, um sinal de igual e, então, a representação da expressão avaliada:

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
pt_br: Veja :ref:`expressões autodocumentadas <bpo-36817-whatsnew>` para mais informações sobre o especificador ``=``. Para obter uma referência sobre essas especificações de formato, consulte o guia de referência para a :ref:`formatspec`.

source: The String format() Method
pt_br: O método format()

source: Basic usage of the :meth:`str.format` method looks like this::
pt_br: Um uso básico do método :meth:`str.format` tem esta forma::

source: >>> print('We are the {} who say "{}!"'.format('knights', 'Ni')) We are the knights who say "Ni!"
pt_br: >>> print('Nós somos os {} que dizem "{}!"'.format('cavaleiros', 'Ni')) Nós somos os cavaleiros que dizem "Ni!"

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
pt_br: As chaves e seus conteúdos (chamados campos de formatação) são substituídos pelos objetos passados para o método :meth:`str.format`. Um número nas chaves pode ser usado para referenciar a posição do objeto passado no método :meth:`str.format`. ::

source: >>> print('{0} and {1}'.format('spam', 'eggs')) spam and eggs >>> print('{1} and {0}'.format('spam', 'eggs')) eggs and spam
pt_br: >>> print('{0} e {1}'.format('spam', 'ovos')) spam e eggs >>> print('{1} e {0}'.format('spam', 'ovos')) eggs e spam

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
pt_br: Se argumentos nomeados são passados para o método :meth:`str.format`, seus valores serão referenciados usando o nome do argumento::

source: >>> print('This {food} is {adjective}.'.format( ... food='spam', adjective='absolutely horrible')) This spam is absolutely horrible.
pt_br: >>> print('Este {comida} está {adjetivo}.'.format( ... comida='spam', adjetivo='absolutamente horrível')) Este spam está absolutamente horrível.

source: Positional and keyword arguments can be arbitrarily combined::
pt_br: Argumentos posicionais e nomeados podem ser combinados à vontade::

source: >>> print('The story of {0}, {1}, and {other}.'.format('Bill', 'Manfred', ... other='Georg')) The story of Bill, Manfred, and Georg.
pt_br: >>> print('A história de {0}, {1} e {outro}.'.format('Bill', 'Manfred', ... outro='Georg')) A história de Bill, Manfred e Georg.

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
pt_br: Se uma string de formatação é muito longa, e não se deseja quebrá-la, pode ser bom fazer referência aos valores a serem formatados por nome, em vez de posição. Isto pode ser feito passando um dicionário usando colchetes ``'[]'`` para acessar as chaves. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
pt_br: >>> tabela = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {0[Jack]:d}; Sjoerd: {0[Sjoerd]:d}; ' ... 'Dcab: {0[Dcab]:d}'.format(tabela)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
pt_br: Isto também pode ser feito passando o dicionário ``table`` como argumentos nomeados com a notação ``**``. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**table)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678
pt_br: >>> tabela = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 8637678} >>> print('Jack: {Jack:d}; Sjoerd: {Sjoerd:d}; Dcab: {Dcab:d}'.format(**tabela)) Jack: 4098; Sjoerd: 4127; Dcab: 8637678

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables::
pt_br: Isto é particularmente útil em conjunto com a função embutida :func:`vars`, que devolve um dicionário contendo todas as variáveis locais::

source: >>> table = {k: str(v) for k, v in vars().items()} >>> message = " ".join([f'{k}: ' + '{' + k +'};' for k in table.keys()]) >>> print(message.format(**table)) __name__: __main__; __doc__: None; __package__: None; __loader__: ...
pt_br: >>> tabela = {k: str(v) for k, v in vars().items()} >>> mensagem = " ".join([f'{k}: ' + '{' + k +'};' for k in tabela.keys()]) >>> print(mensagem.format(**tabela)) __name__: __main__; __doc__: None; __package__: None; __loader__: ...

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
pt_br: Como exemplo, as linhas seguintes produzem um conjunto de colunas alinhadas, com alguns inteiros e seus quadrados e cubos::

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
pt_br: Para uma visão completa da formatação de strings com :meth:`str.format`, veja a seção :ref:`formatstrings`.

source: Manual String Formatting
pt_br: Formatação manual de string

source: Here's the same table of squares and cubes, formatted manually::
pt_br: Aqui está a mesma tabela de quadrados e cubos, formatados manualmente::

source: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note use of 'end' on previous line ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
pt_br: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Observe o uso do 'end' na linha anterior ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
pt_br: (Note que o espaço entre cada coluna foi adicionado pela forma que a função :func:`print` funciona: sempre adiciona espaços entre seus argumentos.)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
pt_br: O método :meth:`str.rjust` justifica uma string à direita, num campo de tamanho definido, acrescentando espaços à esquerda. De forma similar, os métodos :meth:`str.ljust`, justifica à esquerda, e :meth:`str.center`, para centralizar. Esses métodos não escrevem nada, apenas retornam uma nova string. Se a string de entrada é muito longa, os métodos não truncarão a saída, e retornarão a mesma string, sem mudança; isso vai atrapalhar o layout da coluna, mas geralmente é melhor do que a alternativa, que estaria distorcendo o valor. (Se realmente quiser truncar, sempre se pode adicionar uma operação de fatiamento, como em ``x.ljust(n)[:n]``.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
pt_br: Existe ainda o método :meth:`str.zfill` que preenche uma string numérica com zeros à esquerda, e sabe lidar com sinais positivos e negativos::

source: Old string formatting
pt_br: Formatação de strings à moda antiga

source: The % operator (modulo) can also be used for string formatting. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. This operation is commonly known as string interpolation. For example::
pt_br: O operador % (módulo) também pode ser usado para formatação de string. Dado ``formato % valores`` (onde *formato* é uma string), as instâncias de ``%`` em ``formato`` serão substituídas por zero ou mais elementos de ``valores``. Essa operação é conhecida como interpolação de string. Por exemplo::

source: >>> import math >>> print('The value of pi is approximately %5.3f.' % math.pi) The value of pi is approximately 3.142.
pt_br: >>> import math >>> print('O valor de pi é aproximadamente %5.3f.' % math.pi) O valor de pi é aproximadamente 3.142.

source: More information can be found in the :ref:`old-string-formatting` section.
pt_br: Mais informação pode ser encontrada na seção :ref:`old-string-formatting`.

source: Reading and Writing Files
pt_br: Leitura e escrita de arquivos

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
pt_br: :func:`open` retorna um :term:`objeto arquivo`, e é mais utilizado com dois argumentos posicionais e um argumento nomeado: ``open(filename, mode, encoding=None)``

source: >>> f = open('workfile', 'w', encoding="utf-8")
pt_br: >>> f = open('arquivo_de_trabalho', 'w', encoding="utf-8")

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
pt_br: O primeiro argumento é uma string contendo o nome do arquivo. O segundo argumento é outra string, contendo alguns caracteres que descrevem o modo como o arquivo será usado. *modo* pode ser ``'r'`` quando o arquivo será apenas lido, ``'w'`` para escrever (se o arquivo já existir seu conteúdo prévio será apagado), e ``'a'`` para abrir o arquivo para adição; qualquer escrita será adicionada ao final do arquivo. A opção ``'r+'`` abre o arquivo tanto para leitura como para escrita. O argumento *modo* é opcional, em caso de omissão será presumido ``'r'``.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
pt_br: Normalmente, arquivos são abertos no :dfn:`modo texto`, o que significa que você lê strings de e para o arquivo, o qual está em um codificação específica. Se a *codificação* não for especificada, o padrão irá depender da plataforma (veja :func:`open`). Como o UTF-8 é o padrão mais moderno, ``encoding="utf-8"`` é recomendado a não ser que você precise utilizar uma *codificação* diferente. Adicionando ``'b'`` ao modo irá abrir o o arquivo em :dfn:`modo binário`. Dados no modo binário são lidos e escritos como objetos :class:`bytes`. Você não pode especificar a *codificação* quando estiver abrindo os arquivos em modo binário.
