Repository: python/python-docs-pt-br
Catalog: tutorial/interpreter.po
Languages: pt_br

source: Using the Python Interpreter
pt_br: Utilizando o interpretador Python

source: Invoking the Interpreter
pt_br: Chamando o interpretador

source: The Python interpreter is usually installed as |usr_local_bin_python_x_dot_y_literal| on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
pt_br: O interpretador Python é frequentemente instalado como |usr_local_bin_python_x_dot_y_literal| nas máquinas onde está disponível; adicionando :file:`/usr/local/bin` ao caminho de busca da shell de seu Unix torna-se possível iniciá-lo digitando o comando:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
pt_br: no shell. [#]_ Considerando que a escolha do diretório onde o interpretador está é uma opção de instalação, outros locais são possíveis; verifique com seu guru local de Python ou administrador do sistema local. (Por exemplo, :file:`/usr/local/python` é um local alternativo popular.)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the |python_x_dot_y_literal| command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
pt_br: Em máquinas Windows onde você instalou Python a partir da :ref:`Microsoft Store <windows-store>`, o comando |python_x_dot_y_literal| estará disponível. Se você tem o :ref:`lançador py.exe <launcher>` instalado, você pode usar o comando :file:`py`. Veja :ref:`setting-envvars` para outras maneiras de executar o Python.

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
pt_br: Digitar um caractere de fim de arquivo (:kbd:`Control-D` no Unix, :kbd:`Control-Z` no Windows) diretamente no prompt força o interpretador a sair com status de saída zero. Se isso não funcionar, você pode sair do interpretador digitando o seguinte comando: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
pt_br: Os recursos de edição de linha do interpretador incluem edição interativa, substituição de histórico e complemento de código, em sistemas com suporte à biblioteca `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_. Talvez a verificação mais rápida para ver se o suporte à edição de linha de comando está disponível é digitando :kbd:`Control-P` no primeiro prompt oferecido pelo Python. Se for emitido um bipe, você terá a edição da linha de comando; veja Apêndice :ref:`tut-interacting` para uma introdução às combinações. Se nada acontecer, ou se ``^P`` aparecer na tela, a edição da linha de comando não está disponível; você só poderá usar backspace para remover caracteres da linha atual.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
pt_br: O interpretador trabalha de forma semelhante a uma shell de Unix: quando chamado com a saída padrão conectada a um console de terminal, ele lê e executa comandos interativamente; quando chamado com um nome de arquivo como argumento, ou com redirecionamento da entrada padrão para ler um arquivo, o interpretador lê e executa o *script* contido no arquivo.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety.
pt_br: Uma segunda forma de iniciar o interpretador é ``python -c comando [arg] ...``, que executa uma ou mais instruções especificadas na posição *comando*, analogamente à opção de shell :option:`-c`. Considerando que comandos Python frequentemente têm espaços em branco (ou outros caracteres que são especiais para a shell) é aconselhável que todo o *comando* esteja entre as aspas.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
pt_br: Alguns módulos Python são também úteis como scripts. Estes podem ser chamados usando ``python -m módulo [arg] ...`` que executa o arquivo fonte do *módulo* como se você tivesse digitado seu caminho completo na linha de comando.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
pt_br: Quando um arquivo de script é utilizado, às vezes é útil executá-lo e logo em seguida entrar em modo interativo. Isto pode ser feito acrescentando o argumento :option:`-i` antes do nome do script.

source: All command line options are described in :ref:`using-on-general`.
pt_br: Todas as opções de linha de comando são descritas em :ref:`using-on-general`.

source: Argument Passing
pt_br: Passagem de argumentos

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
pt_br: Quando são de conhecimento do interpretador, o nome do script e demais argumentos da linha de comando da shell são acessíveis ao próprio script através da variável ``argv`` do módulo ``sys``. Pode-se acessar essa lista executando ``import sys``. Essa lista tem sempre ao menos um elemento; quando nenhum script ou argumento for passado para o interpretador, ``sys.argv[0]`` será uma string vazia. Quando o nome do script for ``'-'`` (significando entrada padrão), o conteúdo de ``sys.argv[0]`` será ``'-'``. Quando for utilizado :option:`-c` *comando*, ``sys.argv[0]`` conterá ``'-c'``. Quando for utilizado :option:`-m` *módulo*, ``sys.argv[0]`` conterá o caminho completo do módulo localizado. Opções especificadas após :option:`-c` *comando* ou :option:`-m` *módulo* não serão consumidas pelo interpretador mas deixadas em ``sys.argv`` para serem tratadas pelo comando ou módulo.

source: Interactive Mode
pt_br: Modo interativo

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
pt_br: Quando os comandos são lidos a partir do console, diz-se que o interpretador está em modo interativo. Nesse modo ele solicita um próximo comando através do *prompt primário*, tipicamente três sinais de maior (``>>>``); para linhas de continuação do comando atual, o *prompt secundário* padrão é formado por três pontos (``...``). O interpretador exibe uma mensagem de boas vindas, informando seu número de versão e um aviso de copyright antes de exibir o primeiro prompt::

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
pt_br: Linhas de continuação são necessárias em construções multi-linha. Como exemplo, dê uma olhada nesse comando :keyword:`if`::

source: >>> the_world_is_flat = True >>> if the_world_is_flat: ... print("Be careful not to fall off!") ... Be careful not to fall off!
pt_br: >>> o_mundo_é_plano = True >>> if o_mundo_é_plano: ... print("Cuidado para não cair da borda!") ... Cuidado para não cair da borda!

source: For more on interactive mode, see :ref:`tut-interac`.
pt_br: Para mais informações sobre o modo interativo, veja :ref:`tut-interac`.

source: The Interpreter and Its Environment
pt_br: O interpretador e seu ambiente

source: Source Code Encoding
pt_br: Edição de código-fonte

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
pt_br: Por padrão, arquivos fonte de Python são tratados com codificação UTF-8. Nessa codificação, caracteres de muitos idiomas no mundo podem ser usados simultaneamente em literais string, identificadores e comentários --- embora a biblioteca padrão use apenas caracteres ASCII para identificadores, uma convenção que qualquer código portável deve seguir. Para exibir todos esses caracteres corretamente, seu editor deve reconhecer que o arquivo é UTF-8 e deve usar uma fonte com suporte a todos os caracteres no arquivo.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
pt_br: Para declarar uma codificação diferente da padrão, uma linha de comentário especial deve ser adicionada como *primeira* linha do arquivo. A sintaxe é essa::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
pt_br: onde *encoding* é uma das :mod:`codecs` válidas com suporte do Python.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
pt_br: Por exemplo, para declarar que a codificação Windows-1252 deve ser usada, a primeira linha do seu arquivo fonte deve ser::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
pt_br: Uma exceção para a regra da *primeira linha* é quando o código-fonte inicia com uma :ref:`linha com UNIX "shebang" <tut-scripts>`. Nesse caso, a declaração de codificação deve ser adicionada como a segunda linha do arquivo. Por exemplo::

source: Footnotes
pt_br: Notas de rodapé

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
pt_br: No Unix, o interpretador Python 3.x não é instalado por padrão com o executável nomeado ``python``, então não vai conflitar com um executável Python 2.x instalado simultaneamente.
