Repository: python/python-docs-pt-br
Catalog: tutorial/introduction.po
Languages: pt_br

source: An Informal Introduction to Python
pt_br: Uma introdução informal ao Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
pt_br: Nos exemplos seguintes, pode-se distinguir entrada e saída pela presença ou ausência dos prompts (:term:`>>>` e :term:`...`): para repetir o exemplo, você deve digitar tudo após o prompt, quando o mesmo aparece; linhas que não começarem com um prompt são na verdade as saídas geradas pelo interpretador. Observe que quando aparece uma linha contendo apenas o prompt secundário você deve digitar uma linha em branco; é assim que se encerra um comando de múltiplas linhas.

source: You can use the "Copy" button (it appears in the upper-right corner when hovering over or tapping a code example), which strips prompts and omits output, to copy and paste the input lines into your interpreter.
pt_br: Você pode usar o botão "Copy" (que aparece no canto superior direito ao passar o mouse ou tocar em um exemplo de código), que remove os prompts e omite a saída, para copiar e colar as linhas de entrada no seu interpretador.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
pt_br: Muitos exemplos neste manual, mesmo aqueles inscritos na linha de comando interativa, incluem comentários. Comentários em Python começam com o caractere cerquilha ``#`` e estende até o final da linha. Um comentário pode aparecer no inicio da linha ou após espaço em branco ou código, mas não dentro de uma string literal. O caractere cerquilha dentro de uma string literal é apenas uma cerquilha. Como os comentários são para esclarecer o código e não são interpretados pelo Python, eles podem ser omitidos ao digitar exemplos.

source: Some examples::
pt_br: Alguns exemplos:

source: # this is the first comment spam = 1 # and this is the second comment # ... and now a third! text = "# This is not a comment because it's inside quotes."
pt_br: # este é o primeiro comentário spam = 1 # e este é o segundo comentário # ... e agora um terceiro! texto = "# Este não é um comentário por estar entre aspas."

source: Using Python as a Calculator
pt_br: Usando Python como uma calculadora

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
pt_br: Vamos experimentar alguns comandos simples em Python. Inicie o interpretador e aguarde o prompt primário, ``>>>``. (Não deve demorar muito.)

source: Numbers
pt_br: Números

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` can be used to perform arithmetic; parentheses (``()``) can be used for grouping. For example::
pt_br: O interpretador funciona como uma calculadora bem simples: você pode digitar uma expressão e o resultado será apresentado. A sintaxe de expressões é a usual: operadores ``+``, ``-``, ``*`` e ``/`` podem ser usadas para realizar operações aritméticas; parênteses (``()``) podem ser usados para agrupar expressões. Por exemplo::

source: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # division always returns a floating-point number 1.6
pt_br: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # divisão sempre retorna um número de ponto flutuante 1.6

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
pt_br: Os números inteiros (ex. ``2``, ``4``, ``20``) são do tipo :class:`int`, aqueles com parte fracionária (ex. ``5.0``, ``1.6``) são do tipo :class:`float`. Veremos mais sobre tipos numéricos posteriormente neste tutorial.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
pt_br: Divisão (``/``) sempre retorna ponto flutuante (float). Para fazer uma :term:`divisão pelo piso` e receber um inteiro como resultado você pode usar o operador ``//``; para calcular o resto você pode usar o ``%``::

source: >>> 17 / 3 # classic division returns a float 5.666666666666667 >>> >>> 17 // 3 # floor division discards the fractional part 5 >>> 17 % 3 # the % operator returns the remainder of the division 2 >>> 5 * 3 + 2 # floored quotient * divisor + remainder 17
pt_br: >>> 17 / 3 # divisão clássica retorna um ponto flutuante 5.666666666666667 >>> >>> 17 // 3 # divisão pelo piso descarta a parte fracionária 5 >>> 17 % 3 # o operador % retorna o resto da divisão 2 >>> 5 * 3 + 2 # quociente do piso * divisor + restante 17

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
pt_br: Com Python, é possível usar o operador ``**`` para calcular potências [#]_::

source: >>> 5 ** 2 # 5 squared 25 >>> 2 ** 7 # 2 to the power of 7 128
pt_br: >>> 5 ** 2 # 5 ao quadrado 25 >>> 2 ** 7 # 2 à potência de 7 128

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
pt_br: O sinal de igual (``'='``) é usado para atribuir um valor a uma variável. Depois de uma atribuição, nenhum resultado é exibido antes do próximo prompt::

source: >>> width = 20 >>> height = 5 * 9 >>> width * height 900
pt_br: >>> largura = 20 >>> altura = 5 * 9 >>> largura * altura 900

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
pt_br: Se uma variável não é "definida" (não tem um valor atribuído), tentar utilizá-la gerará um erro::

source: >>> n # try to access an undefined variable Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'n' is not defined
pt_br: >>> n # tenta acessar uma variável não definida Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'n' is not defined

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
pt_br: Há suporte completo para ponto flutuante (*float*); operadores com operandos de diferentes tipos convertem o inteiro para ponto flutuante::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
pt_br: No modo interativo, o valor da última expressão exibida é atribuída a variável ``_``. Assim, ao utilizar Python como uma calculadora, fica mais fácil prosseguir com os cálculos, por exemplo::

source: >>> tax = 12.5 / 100 >>> price = 100.50 >>> price * tax 12.5625 >>> price + _ 113.0625 >>> round(_, 2) 113.06
pt_br: >>> taxa = 12.5 / 100 >>> preço = 100.50 >>> preço * taxa 12.5625 >>> preço + _ 113.0625 >>> round(_, 2) 113.06

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
pt_br: Essa variável especial deve ser tratada como *somente para leitura* pelo usuário. Nunca lhe atribua explicitamente um valor --- do contrário, estaria criando uma outra variável (homônima) independente, que mascararia a variável especial com seu comportamento mágico.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
pt_br: Além de :class:`int` e :class:`float`, o Python suporta outros tipos de números, tais como :class:`~decimal.Decimal` e :class:`~fractions.Fraction`. O Python também possui suporte nativo a :ref:`números complexos <typesnumeric>`, e usa os sufixos ``j`` ou ``J`` para indicar a parte imaginária (por exemplo, ``3+5j``).

source: Text
pt_br: Texto

source: Python can manipulate text (represented by type :class:`str`, so-called "strings") as well as numbers. This includes characters "``!``", words "``rabbit``", names "``Paris``", sentences "``Got your back.``", etc. "``Yay! :)``". They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_.
pt_br: Python pode manipular texto (representado pelo tipo :class:`str`, também chamado de "strings"), bem como números. Isso inclui caracteres "``!``", palavras "``coelho``", nomes "``Paris``", frases "``Eu te protejo.``", etc. "``Oba! :)``". Eles podem ser colocados entre aspas simples (``'...'``) ou aspas duplas (``"..."``) com o mesmo resultado [#]_.

source: >>> 'spam eggs' # single quotes 'spam eggs' >>> "Paris rabbit got your back :)! Yay!" # double quotes 'Paris rabbit got your back :)! Yay!' >>> '1975' # digits and numerals enclosed in quotes are also strings '1975'
pt_br: >>> 'spam eggs' # aspas simples 'spam eggs' >>> "Coelho de Paris, eu te projeto :)! Viva!" # aspas duplas 'Coelho de Paris, eu te projeto :)! Viva!' >>> '1975' # dígitos e numerais envoltos em aspas também são strings '1975'

source: To quote a quote, we need to "escape" it, by preceding it with ``\``. Alternatively, we can use the other type of quotation marks::
pt_br: Para colocar aspas entre aspas, precisamos "escapá-la", precedendo-as com ``\``. Alternativamente, podemos usar o outro tipo de aspas::

source: >>> 'doesn\'t' # use \' to escape the single quote... "doesn't" >>> "doesn't" # ...or use double quotes instead "doesn't" >>> '"Yes," they said.' '"Yes," they said.' >>> "\"Yes,\" they said." '"Yes," they said.' >>> '"Isn\'t," they said.' '"Isn\'t," they said.'
pt_br: >>> 'd\'água' # use \' para escapar a aspa simples... "d'água" >>> "d'água" # ...ou use aspas duplas "d'água" >>> '"Sim", eles disseram.' '"Sim", eles disseram.' >>> "\"Sim\", eles disseram." '"Sim", eles disseram.' >>> '"Copo d\'água", eles pediram.' '"Copo d'água", eles pediram.'

source: In the Python shell, the string definition and output string can look different. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
pt_br: No shell do Python, a definição de string e a string de saída podem parecer diferentes. A função :func:`print` produz uma saída mais legível, omitindo as aspas delimitadoras e imprimindo caracteres de escape e especiais::

source: >>> s = 'First line.\nSecond line.' # \n means newline >>> s # without print(), special characters are included in the string 'First line.\nSecond line.' >>> print(s) # with print(), special characters are interpreted, so \n produces new line First line. Second line.
pt_br: >>> s = 'Primeira linha.\nSegunda linha.' # \n significa nova linha >>> s # sem print(), caracteres especiais são incluídos na string 'Primeira linha.\nSegunda linha.' >>> print(s) # com print(), caracteres especiais são interpretados, então \n produz nova linha Primeira linha. Segunda linha.

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
pt_br: Se não quiseres que os caracteres sejam precedidos por ``\`` para serem interpretados como caracteres especiais, poderás usar *strings raw* (N.d.T: “bruta” ou sem processamento de caracteres de escape) adicionando um ``r`` antes da primeira aspa::

source: >>> print('C:\some\name') # here \n means newline! C:\some ame >>> print(r'C:\some\name') # note the r before the quote C:\some\name
pt_br: >>> print('C:\algum\nome') # aqui \n significa nova linha! C:\algum ome >>> print(r'C:\algum\nome') # observe o r antes das aspas C:\algum\nome

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
pt_br: Há um aspecto sutil nas strings brutas: uma string bruta não pode terminar em um número ímpar de caracteres ``\``; consulte :ref:`o FAQ relacionado <faq-programming-raw-string-backslash>` para mais informações e soluções alternativas.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End-of-line characters are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. In the following example, the initial newline is not included::
pt_br: As strings literais podem abranger várias linhas. Uma maneira é usar as aspas triplas: ``"""..."""`` ou ``'''...'''``. Caracteres de fim de linha são incluídos automaticamente na string, mas é possível evitar isso adicionando uma ``\`` no final. No exemplo a seguir, a nova linha no início não é incluída::

source: >>> print("""\ ... Usage: thingy [OPTIONS] ... -h Display this usage message ... -H hostname Hostname to connect to ... """) Usage: thingy [OPTIONS] -h Display this usage message -H hostname Hostname to connect to >>>
pt_br: >>> print("""\ ... Uso: coisinha [OPÇÕES] ... -h Exibe esta mensagem de uso ... -H hostname Hostname para se conectar ... """) Usage: coisinha [OPÇÕES] -h Exibe esta mensagem de ajuda -H hostname Hostname para se conectar >>>

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
pt_br: Strings podem ser concatenadas (coladas) com o operador ``+``, e repetidas com ``*``::

source: >>> # 3 times 'un', followed by 'ium' >>> 3 * 'un' + 'ium' 'unununium'
pt_br: >>> # 3 vezes 'un', seguido por 'ium' >>> 3 * 'un' + 'ium' 'unununium'

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
pt_br: Duas ou mais *strings literais* (ou seja, entre aspas) ao lado da outra são automaticamente concatenados. ::

source: This feature is particularly useful when you want to break long strings::
pt_br: Esse recurso é particularmente útil quando você quer quebrar strings longas::

source: >>> text = ('Put several strings within parentheses ' ... 'to have them joined together.') >>> text 'Put several strings within parentheses to have them joined together.'
pt_br: >>> texto = ('Coloque várias strings dentro de parênteses ' ... 'para fazer com que elas sejam concatenadas.') >>> texto 'Coloque várias strings dentro de parênteses para fazer com que elas sejam concatenadas.'

source: This only works with two literals though, not with variables or expressions::
pt_br: Isso só funciona com duas strings literais, não com variáveis ou expressões::

source: >>> prefix = 'Py' >>> prefix 'thon' # can't concatenate a variable and a string literal File "<stdin>", line 1 prefix 'thon' ^^^^^^ SyntaxError: invalid syntax >>> ('un' * 3) 'ium' File "<stdin>", line 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: invalid syntax
pt_br: >>> prefixo = 'Py' >>> prefixo 'thon' # não é possível concatenar uma variável e um literal de string File "<stdin>", line 1 prefixi 'thon' ^^^^^^ SyntaxError: invalid syntax >>> ('un' * 3) 'ium' File "<stdin>", line 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: invalid syntax

source: If you want to concatenate variables or a variable and a literal, use ``+``::
pt_br: Se você quiser concatenar variáveis ou uma variável e uma literal, use ``+``::

source: >>> prefix + 'thon' 'Python'
pt_br: >>> prefixo + 'thon' 'Python'

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
pt_br: As strings podem ser *indexadas* (subscritas), com o primeiro caractere como índice 0. Não existe um tipo específico para caracteres; um caractere é simplesmente uma string cujo tamanho é 1::

source: >>> word = 'Python' >>> word[0] # character in position 0 'P' >>> word[5] # character in position 5 'n'
pt_br: >>> palavra = 'Python' >>> palavra[0] # caractere na posição 0 'P' >>> palavra[5] # caractere na posição 5 'n'

source: Indices may also be negative numbers, to start counting from the right::
pt_br: Índices também podem ser números negativos para iniciar a contagem pela direita::

source: >>> word[-1] # last character 'n' >>> word[-2] # second-last character 'o' >>> word[-6] 'P'
pt_br: >>> palavra[-1] # último caractere 'n' >>> palavra[-2] # penúltimo caractere 'o' >>> palavra[-6] 'P'

source: Note that since -0 is the same as 0, negative indices start from -1.
pt_br: Note que dado que -0 é o mesmo que 0, índices negativos começam em -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain a substring::
pt_br: Além da indexação, o *fatiamento* também é permitido. Embora a indexação seja usada para obter caracteres individuais, *fatiar* permite que você obtenha uma substring::

source: >>> word[0:2] # characters from position 0 (included) to 2 (excluded) 'Py' >>> word[2:5] # characters from position 2 (included) to 5 (excluded) 'tho'
pt_br: >>> palavra[0:2] # caracteres da posição 0 (incluída) até 2 (excluída) 'Py' >>> palavra[2:5] # caracteres da posição 2 (incluída) até 5 (excluída) 'tho'

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
pt_br: Os índices do fatiamento possuem padrões úteis; um primeiro índice omitido padrão é zero, um segundo índice omitido é por padrão o tamanho da string sendo fatiada::

source: >>> word[:2] # character from the beginning to position 2 (excluded) 'Py' >>> word[4:] # characters from position 4 (included) to the end 'on' >>> word[-2:] # characters from the second-last (included) to the end 'on'
pt_br: >>> palavra[:2] # caracteres do início até a posição 2 (excluída) 'Py' >>> palavra[4:] # caracteres da posição 4 (incluída) até o fim 'on' >>> palavra[-2:] # caracteres da penúltima (incluída) até o fim 'on'

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
pt_br: Observe como o início sempre está incluído, e o fim sempre é excluído. Isso garante que ``s[:i] + s[i:]`` seja sempre igual a ``s``::

source: >>> word[:2] + word[2:] 'Python' >>> word[:4] + word[4:] 'Python'
pt_br: >>> palavra[:2] + palavra[2:] 'Python' >>> palavra[:4] + palavra[4:] 'Python'

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
pt_br: Uma maneira de lembrar como fatias funcionam é pensar que os índices indicam posições *entre* caracteres, onde a borda esquerda do primeiro caractere é 0. Assim, a borda direita do último caractere de uma string de comprimento *n* tem índice *n*, por exemplo::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
pt_br: A primeira fileira de números indica a posição dos índices 0...6 na string; a segunda fileira indica a posição dos respectivos índices negativos. Uma fatia de *i* a *j* consiste em todos os caracteres entre as bordas *i* e *j*, respectivamente.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
pt_br: Para índices positivos, o comprimento da fatia é a diferença entre os índices, se ambos estão dentro dos limites da string. Por exemplo, o comprimento de ``word[1:3]`` é 2.

source: Attempting to use an index that is too large will result in an error::
pt_br: A tentativa de usar um índice que seja muito grande resultará em um erro::

source: >>> word[42] # the word only has 6 characters Traceback (most recent call last): File "<stdin>", line 1, in <module> IndexError: string index out of range
pt_br: >>> palavra[42] # a palavra só tem 6 caracteres Traceback (most recent call last): File "<stdin>", line 1, in <module> IndexError: string index out of range

source: However, out of range slice indexes are handled gracefully when used for slicing::
pt_br: No entanto, os índices de fatiamento fora do alcance são tratados graciosamente (N.d.T: o termo original “gracefully” indica robustez no tratamento de erros) quando usados para fatiamento. Um índice maior que o comprimento é trocado pelo comprimento, um limite superior menor que o limite inferior produz uma string vazia::

source: >>> word[4:42] 'on' >>> word[42:] ''
pt_br: >>> palavra[4:42] 'on' >>> palavra[42:] ''

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
pt_br: As strings do Python não podem ser alteradas --- uma string é :term:`imutável`. Portanto, atribuir a uma posição indexada na sequência resulta em um erro::

source: >>> word[0] = 'J' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment >>> word[2:] = 'py' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment
pt_br: >>> palavra[0] = 'J' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment >>> palavra[2:] = 'py' Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'str' object does not support item assignment

source: If you need a different string, you should create a new one::
pt_br: Se você precisar de uma string diferente, deverá criar uma nova::

source: >>> 'J' + word[1:] 'Jython' >>> word[:2] + 'py' 'Pypy'
pt_br: >>> 'J' + palavra[1:] 'Jython' >>> palavra[:2] + 'py' 'Pypy'

source: The built-in function :func:`len` returns the length of a string::
pt_br: A função embutida :func:`len` devolve o comprimento de uma string::

source: >>> s = 'supercalifragilisticexpialidocious' >>> len(s) 34
pt_br: >>> s = 'supercalifragilisticexpialidoce' >>> len(s) 31

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
pt_br: As strings são exemplos de *tipos de sequências* e suportam as operações comumente suportadas por esses tipos.

source: Strings support a large number of methods for basic transformations and searching.
pt_br: As strings suportam uma grande quantidade de métodos para transformações básicas e busca.

source: String literals that have embedded expressions.
pt_br: Strings literais que possuem expressões embutidas.
