Repository: python/python-docs-pt-br
Catalog: tutorial/introduction.po
Languages: pt_br

source: Information about string formatting with :meth:`str.format`.
pt_br: Informações sobre formatação de string com o método :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
pt_br: As antigas operações de formatação invocadas quando as strings são o operando esquerdo do operador ``%`` são descritas com mais detalhes aqui.

source: Lists
pt_br: Listas

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
pt_br: Python inclui diversas estruturas de dados *compostas*, usadas para agrupar outros valores. A mais versátil é *list* (lista), que pode ser escrita como uma lista de valores (itens) separados por vírgula, entre colchetes. Os valores contidos na lista não precisam ser todos do mesmo tipo. ::

source: >>> squares = [1, 4, 9, 16, 25] >>> squares [1, 4, 9, 16, 25]
pt_br: >>> quadrados = [1, 4, 9, 16, 25] >>> quadrados [1, 4, 9, 16, 25]

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
pt_br: Como strings (e todos os tipos embutidos de :term:`sequência`), listas pode ser indexados e fatiados::

source: >>> squares[0] # indexing returns the item 1 >>> squares[-1] 25 >>> squares[-3:] # slicing returns a new list [9, 16, 25]
pt_br: >>> quadrados[0] # indexação retorna o item 1 >>> quadrados[-1] 25 >>> quadrados[-3:] # fatiamento retorna uma nova lista [9, 16, 25]

source: Lists also support operations like concatenation::
pt_br: As listas também suportam operações como concatenação::

source: >>> squares + [36, 49, 64, 81, 100] [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
pt_br: >>> quadrados + [36, 49, 64, 81, 100] [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
pt_br: Diferentemente de strings, que são :term:`imutáveis<immutable>`, listas são :term:`mutáveis<mutable>`, ou seja, é possível alterar elementos individuais de uma lista::

source: >>> cubes = [1, 8, 27, 65, 125] # something's wrong here >>> 4 ** 3 # the cube of 4 is 64, not 65! 64 >>> cubes[3] = 64 # replace the wrong value >>> cubes [1, 8, 27, 64, 125]
pt_br: >>> cubos = [1, 8, 27, 65, 125] # algo errado aqui >>> 4 ** 3 # o cubo de 4 é 64, não 65! 64 >>> cubos[3] = 64 # substitui o valor errado >>> cubos [1, 8, 27, 64, 125]

source: You can also add new items at the end of the list, by using the :meth:`!list.append` *method* (we will see more about methods later)::
pt_br: Você também pode adicionar novos itens no final da lista, usando o *método* :meth:`!list.append` (estudaremos mais a respeito dos métodos posteriormente)::

source: >>> cubes.append(216) # add the cube of 6 >>> cubes.append(7 ** 3) # and the cube of 7 >>> cubes [1, 8, 27, 64, 125, 216, 343]
pt_br: >>> cubos.append(216) # adiciona o cubo de 6 >>> cubos.append(7 ** 3) # e o cubo de 7 >>> cubos [1, 8, 27, 64, 125, 216, 343]

source: Simple assignment in Python never copies data. When you assign a list to a variable, the variable refers to the *existing list*. Any changes you make to the list through one variable will be seen through all other variables that refer to it.::
pt_br: A atribuição simples em Python nunca copia dados. Quando você atribui uma lista a uma variável, a variável se refere à *lista existente*. Quaisquer alterações que você fizer na lista por meio de uma variável serão vistas por todas as outras variáveis que se referem a ela::

source: >>> rgb = ["Red", "Green", "Blue"] >>> rgba = rgb >>> id(rgb) == id(rgba) # they reference the same object True >>> rgba.append("Alph") >>> rgb ["Red", "Green", "Blue", "Alph"]
pt_br: >>> rgb = ["Vermelho", "Verde", "Azul"] >>> rgba = rgb >>> id(rgb) == id(rgba) # elas referenciam o mesmo objeto True >>> rgba.append("Alf") >>> rgb ["Vermelho", "Verde", "Azul", "Alf"]

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
pt_br: Todas as operações de fatiamento devolvem uma nova lista contendo os elementos solicitados. Isso significa que o seguinte fatiamento devolve uma :ref:`cópia rasa <shallow_vs_deep_copy>` da lista::

source: >>> correct_rgba = rgba[:] >>> correct_rgba[-1] = "Alpha" >>> correct_rgba ["Red", "Green", "Blue", "Alpha"] >>> rgba ["Red", "Green", "Blue", "Alph"]
pt_br: >>> rgba_correto = rgba[:] >>> rgba_correto[-1] = "Alfa" >>> rgba_correto ["Vermelho", "Verde", "Azul", "Alfa"] >>> rgba ["Vermelho", "Verde", "Azul", "Alf"]

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
pt_br: Atribuição a fatias também é possível, e isso pode até alterar o tamanho da lista ou remover todos os itens dela::

source: >>> letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> letters ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # replace some values >>> letters[2:5] = ['C', 'D', 'E'] >>> letters ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # now remove them >>> letters[2:5] = [] >>> letters ['a', 'b', 'f', 'g'] >>> # clear the list by replacing all the elements with an empty list >>> letters[:] = [] >>> letters []
pt_br: >>> letras = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> letras ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # substitui alguns valores >>> letras[2:5] = ['C', 'D', 'E'] >>> letras ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # agora remove-os >>> letras[2:5] = [] >>> letras ['a', 'b', 'f', 'g'] >>> # limpa a lista substituindo todos os elementos por uma lista vazia >>> letras[:] = [] >>> letras []

source: The built-in function :func:`len` also applies to lists::
pt_br: A função embutida :func:`len` também se aplica a listas::

source: >>> letters = ['a', 'b', 'c', 'd'] >>> len(letters) 4
pt_br: >>> letras = ['a', 'b', 'c', 'd'] >>> len(letras) 4

source: It is possible to nest lists (create lists containing other lists), for example::
pt_br: É possível aninhar listas (criar listas contendo outras listas), por exemplo::

source: First Steps Towards Programming
pt_br: Primeiros passos para a programação

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ as follows::
pt_br: Claro, podemos usar o Python para tarefas mais complicadas do que somar 2+2. Por exemplo, podemos escrever o início da `sequência de Fibonacci <https://pt.wikipedia.org/wiki/Sequência_de_Fibonacci>`_ assim::

source: >>> # Fibonacci series: >>> # the sum of two elements defines the next >>> a, b = 0, 1 >>> while a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8
pt_br: >>> # Sequência de Fibonacci: >>> # a soma de dois elementos define a próxima >>> a, b = 0, 1 >>> while a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8

source: This example introduces several new features.
pt_br: Este exemplo introduz diversas características ainda não mencionadas.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
pt_br: A primeira linha contém uma atribuição múltipla: as variáveis ``a`` e ``b`` recebem simultaneamente os novos valores 0 e 1. Na última linha há outro exemplo de atribuição múltipla demonstrando que expressões do lado direito são sempre avaliadas primeiro, antes da atribuição. As expressões do lado direito são avaliadas da esquerda para a direita.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
pt_br: O laço de repetição :keyword:`while` executa enquanto a condição (aqui: ``a < 10``) permanece verdadeira. Em Python, como em C, qualquer valor inteiro que não seja zero é considerado verdadeiro; zero é considerado falso. A condição pode também ser uma cadeia de caracteres ou uma lista, ou qualquer sequência; qualquer coisa com um tamanho maior que zero é verdadeiro, enquanto sequências vazias são falsas. O teste usado no exemplo é uma comparação simples. Os operadores padrões de comparação são os mesmos de C: ``<`` (menor que), ``>`` (maior que), ``==`` (igual), ``<=`` (menor ou igual), ``>=`` (maior ou igual) e ``!=`` (diferente).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
pt_br: O *corpo* do laço é *indentado*: indentação em Python é a maneira de agrupar comandos em blocos. No console interativo padrão você terá que digitar tab ou espaços para indentar cada linha. Na prática você vai preparar scripts Python mais complicados em um editor de texto; a maioria dos editores de texto tem facilidades de indentação automática. Quando um comando composto é digitado interativamente, deve ser finalizado por uma linha em branco (já que o interpretador não tem como adivinhar qual é a última linha do comando). Observe que toda linha de um mesmo bloco de comandos deve ter a mesma indentação.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating-point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
pt_br: A função :func:`print` escreve o valor dos argumentos fornecidos. É diferente de apenas escrever a expressão no interpretador (como fizemos anteriormente nos exemplos da calculadora) pela forma como lida com múltiplos argumentos, quantidades de ponto flutuante e strings. As strings são impressas sem aspas, e um espaço é inserido entre os itens, assim você pode formatar bem o resultado, dessa forma::

source: >>> i = 256*256 >>> print('The value of i is', i) The value of i is 65536
pt_br: >>> i = 256*256 >>> print('O valor de i é', i) O valor de i é 65536

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
pt_br: O argumento nomeado *end* pode ser usado para evitar uma nova linha após a saída ou finalizar a saída com uma string diferente::

source: Footnotes
pt_br: Notas de rodapé

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
pt_br: Uma vez que ``**`` tem precedência mais alta que ``-``, ``-3**2`` será interpretado como ``-(3**2)`` e assim resultará em ``-9``. Para evitar isso e obter ``9``, você pode usar ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
pt_br: Ao contrário de outras linguagens, caracteres especiais como ``\n`` têm o mesmo significado com as aspas simples (``'...'``) e duplas (``"..."``) . A única diferença entre as duas é que, dentro de aspas simples, você não precisa escapar o ``"`` (mas você deve escapar a ``\'``) e vice-versa.

source: # (hash)
pt_br: # (cerquilha)

source: comment
pt_br: comentário
