Repository: python/python-docs-pt-br
Catalog: tutorial/modules.po
Languages: pt_br

source: Modules
pt_br: Módulos

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
pt_br: Ao sair e entrar de novo no interpretador Python, as definições anteriores (funções e variáveis) são perdidas. Portanto, se quiser escrever um programa maior, será mais eficiente usar um editor de texto para preparar as entradas para o interpretador, e executá-lo usando o arquivo como entrada. Isso é conhecido como criar um *script*. Se o programa se torna ainda maior, é uma boa prática dividi-lo em arquivos menores, para facilitar a manutenção. Também é preferível usar um arquivo separado para uma função que você escreveria em vários programas diferentes, para não copiar a definição de função em cada um deles.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
pt_br: Para permitir isso, Python tem uma maneira de colocar as definições em um arquivo e então usá-las em um script ou em uma execução interativa do interpretador. Tal arquivo é chamado de *módulo*; definições de um módulo podem ser *importadas* para outros módulos, ou para o módulo *principal* (a coleção de variáveis a que você tem acesso num script executado como um programa e no modo calculadora).

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
pt_br: Um módulo é um arquivo contendo definições e instruções Python. O nome do arquivo é o nome do módulo acrescido do sufixo :file:`.py`. Dentro de um módulo, o nome do módulo (como uma string) está disponível como o valor da variável global ``__name__``. Por exemplo, use seu editor de texto favorito para criar um arquivo chamado :file:`fibo.py` no diretório atual com o seguinte conteúdo::

source: # Fibonacci numbers module def fib(n): """Write Fibonacci series up to n.""" a, b = 0, 1 while a < n: print(a, end=' ') a, b = b, a+b print() def fib2(n): """Return Fibonacci series up to n.""" result = [] a, b = 0, 1 while a < n: result.append(a) a, b = b, a+b return result
pt_br: # Módulo de números de Fibonacci def fib(n): """Escreve a série de Fibonacci até n.""" a, b = 0, 1 while a < n: print(a, end=' ') a, b = b, a+b print() def fib2(n): """Retorna a série de Fibonacci até n.""" result = [] a, b = 0, 1 while a < n: result.append(a) a, b = b, a+b return result

source: Now enter the Python interpreter and import this module with the following command::
pt_br: Agora, entre no interpretador Python e importe esse módulo com o seguinte comando::

source: This does not add the names of the functions defined in ``fibo`` directly to the current :term:`namespace` (see :ref:`tut-scopes` for more details); it only adds the module name ``fibo`` there. Using the module name you can access the functions::
pt_br: Isso não adiciona os nomes das funções definidas em ``fibo`` diretamente ao :term:`espaço de nomes` atual (veja :ref:`tut-scopes` para mais detalhes); isso adiciona somente o nome do módulo ``fibo``. Usando o nome do módulo você pode acessar as funções::

source: If you intend to use a function often you can assign it to a local name::
pt_br: Se você pretende usar uma função muitas vezes, você pode atribui-lá a um nome local::

source: More on Modules
pt_br: Mais sobre módulos

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
pt_br: Um módulo pode conter tanto instruções executáveis quanto definições de funções e classes. Essas instruções servem para inicializar o módulo. Eles são executados somente na *primeira* vez que o módulo é encontrado em uma instrução de importação. [#]_ (Também rodam se o arquivo é executado como um script.)

source: Each module has its own private namespace, which is used as the global namespace by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
pt_br: Cada módulo tem seu próprio espaço de nomes privado, que é usado como espaço de nomes global para todas as funções definidas no módulo. Assim, o autor de um módulo pode usar variáveis globais no seu módulo sem se preocupar com conflitos acidentais com as variáveis globais do usuário. Por outro lado, se você precisar usar uma variável global de um módulo, poderá fazê-lo com a mesma notação usada para se referir às suas funções, ``nomemodulo.nomeitem``.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names, if placed at the top level of a module (outside any functions or classes), are added to the module's global namespace.
pt_br: Módulos podem importar outros módulos. É costume, porém não obrigatório, colocar todas as instruções :keyword:`import` no início do módulo (ou script , se preferir). As definições do módulo importado, se colocados no nível de um módulo (fora de quaisquer funções ou classes), elas são adicionadas a espaço de nomes global da módulo.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's namespace. For example::
pt_br: Existe uma variante da instrução :keyword:`import` que importa definições de um módulo diretamente para o espaço de nomes do módulo importador. Por exemplo::

source: This does not introduce the module name from which the imports are taken in the local namespace (so in the example, ``fibo`` is not defined).
pt_br: Isso não coloca o nome do módulo de onde foram feitas as importações no espaço de nomes local (assim, no exemplo, ``fibo`` não está definido).

source: There is even a variant to import all names that a module defines::
pt_br: Existe ainda uma variante que importa todos os nomes definidos em um módulo::

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
pt_br: Isso importa todos as declarações de nomes, exceto aqueles que iniciam com um sublinhado (``_``). Na maioria dos casos, programadores Python não usam esta facilidade porque ela introduz um conjunto desconhecido de nomes no ambiente, podendo esconder outros nomes previamente definidos.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
pt_br: Note que, em geral, a prática do ``import *`` de um módulo ou pacote é desaprovada, uma vez que muitas vezes dificulta a leitura do código. Contudo, é aceitável para diminuir a digitação em sessões interativas.

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
pt_br: Se o nome do módulo é seguido pela palavra-chave :keyword:`!as`, o nome a seguir é vinculado diretamente ao módulo importado.

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
pt_br: Isto efetivamente importa o módulo, da mesma maneira que ``import fibo`` fará, com a única diferença de estar disponível com o nome ``fib``.

source: It can also be used when utilising :keyword:`from` with similar effects::
pt_br: Também pode ser utilizado com a palavra-chave :keyword:`from`, com efeitos similares::

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
pt_br: Por razões de eficiência, cada módulo é importado uma única vez por sessão do interpretador. Portanto, se você alterar seus módulos, você deve reiniciar o interpretador -- ou, se é somente um módulo que você quer testar interativamente, use a função :func:`reload`, ex. ``import importlib; importlib.reload(nomemodulo)``.

source: Executing modules as scripts
pt_br: Executando módulos como scripts

source: When you run a Python module with ::
pt_br: Quando você rodar um módulo Python com ::

source: python fibo.py <arguments>
pt_br: python fibo.py <argumentos>

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
pt_br: o código no módulo será executado, da mesma forma que quando é importado, mas com a variável ``__name__`` com valor ``"__main__"``. Isto significa que adicionando este código ao final do seu módulo::

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
pt_br: você pode tornar o arquivo utilizável tanto como script quanto como um módulo importável, porque o código que analisa a linha de comando só roda se o módulo é executado como arquivo "principal":

source: If the module is imported, the code is not run::
pt_br: Se o módulo é importado, o código não é executado::

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
pt_br: Isso é frequentemente usado para fornecer uma interface de usuário conveniente para um módulo, ou para realizar testes (rodando o módulo como um script executa um conjunto de testes).

source: The Module Search Path
pt_br: O caminho de busca dos módulos

source: When a module named :mod:`!spam` is imported, the interpreter first searches for a built-in module with that name. These module names are listed in :data:`sys.builtin_module_names`. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
pt_br: Quando um módulo chamado :mod:`!spam` é importado, o interpretador procura um módulo embutido com este nome. Estes nomes de módulo são listados em :data:`sys.builtin_module_names`. Se não encontra, procura um arquivo chamado :file:`spam.py` em uma lista de diretórios incluídos na variável :data:`sys.path`. A :data:`sys.path` é inicializada com estes locais:

source: The directory containing the input script (or the current directory when no file is specified).
pt_br: O diretório que contém o script importador (ou o diretório atual quando nenhum arquivo é especificado).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
pt_br: A variável de ambiente :envvar:`PYTHONPATH` (uma lista de nomes de diretórios, com a mesma sintaxe da variável de ambiente :envvar:`PATH`).

source: The installation-dependent default (by convention including a ``site-packages`` directory, handled by the :mod:`site` module).
pt_br: O padrão dependente da instalação (por convenção, incluindo um diretório ``site-packages``, tratado pelo módulo :mod:`site`).

source: More details are at :ref:`sys-path-init`.
pt_br: Mais detalhes em :ref:`sys-path-init`.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
pt_br: Nos sistemas de arquivos que suportam links simbólicos, o diretório contendo o script de entrada é resultante do diretório apontado pelo link simbólico. Em outras palavras o diretório que contém o link simbólico **não** é adicionado ao caminho de busca de módulos.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
pt_br: Após a inicialização, programas Python podem modificar :data:`sys.path`. O diretório que contém o script sendo executado é colocado no início da lista de caminhos, à frente do caminho da biblioteca padrão. Isto significa que módulos nesse diretório serão carregados, no lugar de módulos com o mesmo nome na biblioteca padrão. Isso costuma ser um erro, a menos que seja intencional. Veja a seção :ref:`tut-standardmodules` para mais informações.

source: "Compiled" Python files
pt_br: Arquivos Python "compilados"

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
pt_br: Para acelerar o carregamento de módulos, o Python guarda versões compiladas de cada módulo no diretório ``__pycache__`` com o nome :file:`modulo.{versão}.pyc`, onde a versão corresponde ao formato do arquivo compilado; geralmente contêm o número da versão Python utilizada. Por exemplo, no CPython release 3.3 a versão compilada de spam.py será guardada como ``__pycache__/spam.cpython-33.pyc``. Esta convenção de nomes permite a coexistência de módulos compilados de diferentes releases e versões de Python.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
pt_br: O Python verifica a data de modificação do arquivo fonte mediante a versão compilada, para ver se está desatualizada e precisa ser recompilada. É um processo completamente automático. Além disso, os módulos compilados são independentes de plataforma, portanto a mesma biblioteca pode ser compartilhada entre sistemas de arquiteturas diferentes.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
pt_br: O Python não verifica as versões compiladas em duas circunstâncias. Primeiro, sempre recompila e não armazena o resultado para módulos carregados diretamente da linha de comando. Segundo, não verifica se não houver um módulo fonte. Para suportar uma distribuição sem fontes (somente as versões compiladas), o módulo compilado deve estar no diretório de fontes, e não deve haver um módulo fonte.

source: Some tips for experts:
pt_br: Algumas dicas para especialistas:

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
pt_br: Você pode usar as opções :option:`-O` ou :option:`-OO` no comando Python para reduzir o tamanho de um módulo compilado. A opção ``-O`` remove as instruções assert, e a opção ``-OO`` remove, além das instruções assert, as strings de documentações. Como alguns programas podem contar com essa disponibilidade, só use essa opção se souber o que está fazendo. Módulos "otimizados" tem uma marcação ``opt-`` e são geralmente de menor tamanho. Futuros releases podem mudar os efeitos da otimização.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
pt_br: Um programa não roda mais rápido quando é lido de um arquivo ``.pyc`` do que quando lido de um arquivo ``.py``; a única coisa que é mais rápida com arquivos ``.pyc`` é sua velocidade de carregamento.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
pt_br: O módulo :mod:`compileall` pode criar arquivos .pyc para todos os módulos de um diretório.

source: There is more detail on this process, including a flow chart of the decisions, in :pep:`3147`.
pt_br: Há mais detalhes desse processo, incluindo um fluxograma de decisões, no :pep:`3147`.

source: Standard Modules
pt_br: Módulos padrões

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
pt_br: O Python traz uma biblioteca padrão de módulos, descrita em um documento em separado, a Referência da Biblioteca Python (doravante “Referência da Biblioteca”). Alguns módulos estão embutidos no interpretador; estes possibilitam acesso a operações que não são parte do núcleo da linguagem, mas estão no interpretador seja por eficiência ou para permitir o acesso a chamadas do sistema operacional. O conjunto destes módulos é uma opção de configuração que depende também da plataforma utilizada. Por exemplo, o módulo :mod:`winreg` só está disponível em sistemas Windows. Existe um módulo que requer especial atenção: :mod:`sys`, que é embutido em qualquer interpretador Python. As variáveis ``sys.ps1`` e ``sys.ps2`` definem as strings utilizadas como prompt primário e secundário::

source: >>> import sys >>> sys.ps1 '>>> ' >>> sys.ps2 '... ' >>> sys.ps1 = 'C> ' C> print('Yuck!') Yuck! C>
pt_br: >>> import sys >>> sys.ps1 '>>> ' >>> sys.ps2 '... ' >>> sys.ps1 = 'C> ' C> print('ECA!') Yuck! C>

source: These two variables are only defined if the interpreter is in interactive mode.
pt_br: Essas variáveis só estão definidas se o interpretador está em modo interativo.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
pt_br: A variável ``sys.path`` contém uma lista de strings que determina os caminhos de busca de módulos conhecidos pelo interpretador. Ela é inicializada para um caminho padrão, determinado pela variável de ambiente :envvar:`PYTHONPATH`, ou por um valor padrão embutido, se :envvar:`PYTHONPATH` não estiver definida. Você pode modificá-la com as operações típicas de lista, por exemplo::

source: The :func:`dir` Function
pt_br: A função :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
pt_br: A função embutida :func:`dir` é usada para descobrir quais nomes são definidos por um módulo. Ela devolve uma lista ordenada de strings::

source: Without arguments, :func:`dir` lists the names you have defined currently::
pt_br: Sem argumentos, :func:`dir` lista os nomes atualmente definidos::

source: Note that it lists all types of names: variables, modules, functions, etc.
pt_br: Observe que ela lista todo tipo de nomes: variáveis, módulos, funções, etc.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
pt_br: :func:`dir` não lista os nomes de variáveis e funções embutidas. Esta lista está disponível no módulo padrão :mod:`builtins`::

source: Packages
pt_br: Pacotes

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`!A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
pt_br: Os pacotes são uma maneira de estruturar o "espaço de nomes" dos módulos Python, usando "nomes de módulo com pontos". Por exemplo, o nome do módulo :mod:`!A.B` designa um submódulo chamado ``B``, em um pacote chamado ``A``. Assim como o uso de módulos evita que os autores de módulos diferentes tenham que se preocupar com nomes de variáveis globais, o uso de nomes de módulos com pontos evita que os autores de pacotes com muitos módulos, como NumPy ou Pillow, tenham que se preocupar com os nomes dos módulos uns dos outros.
