Repository: python/python-docs-pt-br
Catalog: tutorial/modules.po
Languages: pt_br

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
pt_br: Suponha que você queira projetar uma coleção de módulos (um "pacote") para o gerenciamento uniforme de arquivos de som. Existem muitos formatos diferentes (normalmente identificados pela extensão do nome de arquivo, por exemplo :file:`.wav`, :file:`.aiff`, :file:`.au`), de forma que você pode precisar criar e manter uma crescente coleção de módulos de conversão entre formatos. Ainda podem existir muitas operações diferentes, passíveis de aplicação sobre os arquivos de som (mixagem, eco, equalização, efeito stereo artificial). Logo, possivelmente você também estará escrevendo uma coleção sempre crescente de módulos para aplicar estas operações. Eis uma possível estrutura para o seu pacote (expressa em termos de um sistema de arquivos hierárquico)::

source: sound/ Top-level package __init__.py Initialize the sound package formats/ Subpackage for file format conversions __init__.py wavread.py wavwrite.py aiffread.py aiffwrite.py auread.py auwrite.py ... effects/ Subpackage for sound effects __init__.py echo.py surround.py reverse.py ... filters/ Subpackage for filters __init__.py equalizer.py vocoder.py karaoke.py ...
pt_br: sound/ pacote de nível superior __init__.py Inicializa o pacote de som formats/ Subpacote para as conversões entre formatos de arquivos __init__.py wavread.py wavwrite.py aiffread.py aiffwrite.py auread.py auwrite.py ... effects/ Subpacote para efeitos de som __init__.py echo.py surround.py reverse.py ... filters/ Subpacote para filtros __init__.py equalizer.py vocoder.py karaoke.py ...

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
pt_br: Ao importar esse pacote, Python busca pelo subdiretório com mesmo nome, nos diretórios listados em ``sys.path``.

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages (unless using a :term:`namespace package`, a relatively advanced feature). This prevents directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
pt_br: Os arquivos :file:`__init__.py` são necessários para que o Python trate diretórios contendo o arquivo como pacotes (a menos que se esteja usando um :term:`pacote de espaço de nomes`, um recurso relativamente avançado). Isso impede que diretórios com um nome comum, como ``string``, ocultem, involuntariamente, módulos válidos que ocorrem posteriormente no caminho de busca do módulo. No caso mais simples, :file:`__init__.py` pode ser apenas um arquivo vazio, mas pode também executar código de inicialização do pacote, ou configurar a variável ``__all__``, descrita mais adiante.

source: Users of the package can import individual modules from the package, for example::
pt_br: Usuários do pacote podem importar módulos individuais, por exemplo::

source: This loads the submodule :mod:`!sound.effects.echo`. It must be referenced with its full name. ::
pt_br: Isso carrega o submódulo :mod:`!sound.effects.echo`. Ele deve ser referenciado com seu nome completo, como em::

source: An alternative way of importing the submodule is::
pt_br: Uma maneira alternativa para a importação desse módulo é::

source: This also loads the submodule :mod:`!echo`, and makes it available without its package prefix, so it can be used as follows::
pt_br: Isso carrega o submódulo :mod:`!echo` sem necessidade de mencionar o prefixo do pacote no momento da utilização, assim::

source: Yet another variation is to import the desired function or variable directly::
pt_br: Também é possível importar diretamente uma única variável ou função::

source: Again, this loads the submodule :mod:`!echo`, but this makes its function :func:`!echofilter` directly available::
pt_br: Novamente, isso carrega o submódulo :mod:`!echo`, mas a função :func:`!echofilter` está acessível diretamente sem prefixo::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
pt_br: Observe que ao utilizar ``from pacote import item``, o item pode ser um subpacote, submódulo, classe, função ou variável. A instrução ``import`` primeiro testa se o item está definido no pacote, senão presume que é um módulo e tenta carregá-lo. Se falhar em encontrar o módulo, uma exceção :exc:`ImportError` é levantada.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
pt_br: Em oposição, em uma construção como ``import item.subitem.subsubitem``, cada item, com exceção do último, deve ser um pacote. O último pode ser também um pacote ou módulo, mas nunca uma classe, função ou variável contida em um módulo.

source: Importing \* From a Package
pt_br: Importando \* de um pacote

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
pt_br: Agora, o que acontece quando um usuário escreve ``from sound.effects import *`` ? Idealmente, poderia se esperar que este comando vasculhasse o sistema de arquivos, encontrasse todos os submódulos presentes no pacote, e os importasse. Isso poderia demorar muito e a importação de submódulos pode ocasionar efeitos colaterais, que somente deveriam ocorrer quando o submódulo é explicitamente importado.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
pt_br: A única solução é o autor do pacote fornecer um índice explícito do pacote. A instrução :keyword:`import` usa a seguinte convenção: se o arquivo :file:`__init__.py` do pacote define uma lista chamada ``__all__``, então esta lista indica os nomes dos módulos a serem importados quando a instrução ``from pacote import *`` é acionada. Fica a cargo do autor do pacote manter esta lista atualizada, inclusive fica a seu critério excluir inteiramente o suporte a importação direta de todo o pacote através de ``from pacote import *``. Por exemplo, o arquivo :file:`sounds/effects/__init__.py` poderia conter apenas::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`!sound.effects` package.
pt_br: Isso significaria que ``from sound.effects import *`` importaria os três submódulos nomeados do pacote :mod:`!sound.effects`.

source: Be aware that submodules might become shadowed by locally defined names. For example, if you added a ``reverse`` function to the :file:`sound/effects/__init__.py` file, the ``from sound.effects import *`` would only import the two submodules ``echo`` and ``surround``, but *not* the ``reverse`` submodule, because it is shadowed by the locally defined ``reverse`` function::
pt_br: Esteja ciente de que os submódulos podem ficar sobrepostos por nomes definidos localmente. Por exemplo, se você adicionou uma função ``reverse`` ao arquivo :file:`sound/effects/__init__.py`, usar ``from sound.effects import *`` só importaria os dois submódulos ``echo`` e ``surround``, mas *não* o submódulo ``reverse``, porque ele fica sobreposto pela função ``reverse`` definida localmente::

source: __all__ = [ "echo", # refers to the 'echo.py' file "surround", # refers to the 'surround.py' file "reverse", # !!! refers to the 'reverse' function now !!! ] def reverse(msg: str): # <-- this name shadows the 'reverse.py' submodule return msg[::-1] # in the case of a 'from sound.effects import *'
pt_br: __all__ = [ "echo", # refere-se ao arquivo 'echo.py' "surround", # refere-se ao arquivo 'surround.py' "reverse", # !!! refere-se à função 'reverse' agora !!! ] def reverse(msg: str): # <-- este nome ofusca o submódulo 'reverse.py' return msg[::-1] # no caso de uma importação 'from sound.effects import *'

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`!sound.effects` into the current namespace; it only ensures that the package :mod:`!sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
pt_br: Se ``__all__`` não estiver definido, a instrução ``from sound.effects import *`` não importa todos os submódulos do pacote :mod:`!sound.effects` no espaço de nomes atual. Há apenas garantia que o pacote :mod:`!sound.effects` foi importado (possivelmente executando qualquer código de inicialização em :file:`__init__.py`) juntamente com os nomes definidos no pacote. Isso inclui todo nome definido em :file:`__init__.py` bem como em qualquer submódulo importado a partir deste. Também inclui quaisquer submódulos do pacote que tenham sido carregados explicitamente por instruções :keyword:`import` anteriores. Considere o código abaixo::

source: In this example, the :mod:`!echo` and :mod:`!surround` modules are imported in the current namespace because they are defined in the :mod:`!sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
pt_br: Nesse exemplo, os módulos :mod:`!echo` e :mod:`!surround` são importados no espaço de nomes atual, no momento em que a instrução ``from...import`` é executada, pois estão definidos no pacote :mod:`!sound.effects`. (Isso também funciona quando ``__all__`` estiver definida.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
pt_br: Apesar de que certos módulos são projetados para exportar apenas nomes conforme algum critério quando se faz ``import *``, ainda assim essa sintaxe é considerada uma prática ruim em código de produção.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
pt_br: Lembre-se, não há nada errado em usar ``from pacote import submodulo_especifico``! De fato, essa é a notação recomendada, a menos que o módulo importado necessite usar submódulos com o mesmo nome, de diferentes pacotes.

source: Intra-package References
pt_br: Referências em um mesmo pacote

source: When packages are structured into subpackages (as with the :mod:`!sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`!sound.filters.vocoder` needs to use the :mod:`!echo` module in the :mod:`!sound.effects` package, it can use ``from sound.effects import echo``.
pt_br: Quando pacotes são estruturados em subpacotes (como no pacote :mod:`!sound` do exemplo), pode-se usar a sintaxe de importações absolutas para se referir aos submódulos de pacotes irmãos (o que na prática é uma forma de fazer um import relativo, a partir da base do pacote). Por exemplo, se o módulo :mod:`!sound.filters.vocoder` precisa usar o módulo :mod:`!echo` do pacote :mod:`!sound.effects`, é preciso importá-lo com ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`!surround` module for example, you might use::
pt_br: Também é possível escrever imports relativos, com a forma ``from module import name``. Esses imports usam pontos para indicar o pacote pai e o atual, envolvidos no import relativo. Do módulo :mod:`!surround`, por exemplo, pode-se usar::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
pt_br: Note que imports relativos são baseados no nome do módulo atual. Uma vez que o nome do módulo principal é sempre ``"__main__"``, módulos destinados ao uso como módulo principal de um aplicativo Python devem sempre usar imports absolutos.

source: Packages in Multiple Directories
pt_br: Pacotes em múltiplos diretórios

source: Packages support one more special attribute, :attr:`~module.__path__`. This is initialized to be a :term:`sequence` of strings containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
pt_br: Pacotes possuem mais um atributo especial, :attr:`~module.__path__`. Inicializado como uma :term:`sequência` de strings contendo o nome do diretório onde está o arquivo :file:`__init__.py` do pacote, antes do código naquele arquivo ser executado. Esta variável pode ser modificada; isso afeta a busca futura de módulos e subpacotes contidos no pacote.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
pt_br: Apesar de não ser muito usado, esse mecanismo permite estender o conjunto de módulos encontrados em um pacote.

source: Footnotes
pt_br: Notas de rodapé

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition adds the function name to the module's global namespace.
pt_br: [#] Na verdade, definições de funções também são 'instruções' que são 'executados'; a execução da definição de uma função adiciona o nome da função no espaço de nomes global do módulo.

source: module
pt_br: módulo

source: search
pt_br: pesquisa

source: path
pt_br: caminho
