Repository: python/python-docs-pt-br
Catalog: tutorial/stdlib.po
Languages: pt_br

source: Brief Tour of the Standard Library
pt_br: Um breve passeio pela biblioteca padrão

source: Operating System Interface
pt_br: Interface com o sistema operacional

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
pt_br: O módulo :mod:`os` fornece dúzias de funções para interagir com o sistema operacional::

source: >>> import os >>> os.getcwd() # Return the current working directory 'C:\\Python314' >>> os.chdir('/server/accesslogs') # Change current working directory >>> os.system('mkdir today') # Run the command mkdir in the system shell 0
pt_br: >>> import os >>> os.getcwd() # Retorna o diretório de trabalho atual 'C:\\Python314' >>> os.chdir('/server/accesslogs') # Altera o diretório de trabalho atual >>> os.system('mkdir hoje') # Executa o comando mkdir no shell do sistema 0

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
pt_br: Certifique-se de usar a forma ``import os`` ao invés de ``from os import *``. Isso evitará que :func:`os.open` oculte a função :func:`open` que opera de forma muito diferente.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
pt_br: As funções embutidas :func:`dir` e :func:`help` são úteis como um sistema de ajuda interativa para lidar com módulos grandes como :mod:`os`::

source: >>> import os >>> dir(os) <returns a list of all module functions> >>> help(os) <returns an extensive manual page created from the module's docstrings>
pt_br: >>> import os >>> dir(os) <retorna uma lista de todas as funções do módulo> >>> help(os) <retorna uma página de manual extensa criada a partir das docstrings do módulo>

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
pt_br: Para tarefas de gerenciamento cotidiano de arquivos e diretórios, o módulo :mod:`shutil` fornece uma interface de alto nível que é mais simples de usar::

source: >>> import shutil >>> shutil.copyfile('data.db', 'archive.db') 'archive.db' >>> shutil.move('/build/executables', 'installdir') 'installdir'
pt_br: >>> import shutil >>> shutil.copyfile('dados.db', 'arquivo.db') 'arquivo.db' >>> shutil.move('/build/executáveis', 'dir_instal') 'dir_instal'

source: File Wildcards
pt_br: Caracteres curinga

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
pt_br: O módulo :mod:`glob` fornece uma função para criar listas de arquivos a partir de buscas em diretórios usando caracteres curinga::

source: >>> import glob >>> glob.glob('*.py') ['primes.py', 'random.py', 'quote.py']
pt_br: >>> import glob >>> glob.glob('*.py') ['primos.py', 'aleatorizar.py', 'aspas.py']

source: Command Line Arguments
pt_br: Argumentos de linha de comando

source: Common utility scripts often need to process command line arguments. These arguments are stored in the :mod:`sys` module's *argv* attribute as a list. For instance, let's take the following :file:`demo.py` file::
pt_br: Scripts geralmente precisam processar argumentos passados na linha de comando. Esses argumentos são armazenados como uma lista no atributo *argv* do módulo :mod:`sys`. Por exemplo, consideremos o arquivo :file:`demo.py` a seguir::

source: # File demo.py import sys print(sys.argv)
pt_br: # Arquivo demo.py import sys print(sys.argv)

source: Here is the output from running ``python demo.py one two three`` at the command line::
pt_br: Aqui está a saída da execução ``python demo.py um dois três`` na linha de comando::

source: ['demo.py', 'one', 'two', 'three']
pt_br: ['demo.py', 'um', 'dois, 'três']

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
pt_br: O módulo :mod:`argparse` fornece um mecanismo mais sofisticado para processar argumentos de linha de comando. O script seguinte extrai e exibe um ou mais nomes de arquivos e um número de linhas opcional::

source: import argparse parser = argparse.ArgumentParser( prog='top', description='Show top lines from each file') parser.add_argument('filenames', nargs='+') parser.add_argument('-l', '--lines', type=int, default=10) args = parser.parse_args() print(args)
pt_br: import argparse parser = argparse.ArgumentParser( prog='topo', description='Mostra as primeiras linhas de cada arquivo') parser.add_argument('arquivos, nargs='+') parser.add_argument('-l', '--linhas', type=int, default=10) args = parser.parse_args() print(args)

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
pt_br: Quando executada na linha de comando ``python topo.py --linhas=5 alfa.txt beta.txt``, o script define ``args.linhas`` para ``5`` e ``args.arquivos`` para ``['alfa.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
pt_br: Redirecionamento de erros e encerramento do programa

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
pt_br: O módulo :mod:`sys` também possui atributos para *stdin*, *stdout* e *stderr*. O último é usado para emitir avisos e mensagens de erros visíveis mesmo quando *stdout* foi redirecionado::

source: >>> sys.stderr.write('Warning, log file not found starting a new one\n') Warning, log file not found starting a new one
pt_br: >>> sys.stderr.write('Aviso, arquivo log não encontrado, iniciando um novo\n') Aviso, arquivo log não encontrado, iniciando um novo

source: The most direct way to terminate a script is to use ``sys.exit()``.
pt_br: A forma mais direta de encerrar um script é usando ``sys.exit()``.

source: String Pattern Matching
pt_br: Reconhecimento de padrões em strings

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
pt_br: O módulo :mod:`re` fornece ferramentas para lidar com processamento de strings através de expressões regulares. Para reconhecimento de padrões complexos, expressões regulares oferecem uma solução sucinta e eficiente::

source: >>> import re >>> re.findall(r'\bf[a-z]*', 'which foot or hand fell fastest') ['foot', 'fell', 'fastest'] >>> re.sub(r'(\b[a-z]+) \1', r'\1', 'cat in the the hat') 'cat in the hat'
pt_br: >>> import re >>> re.findall(r'\br[a-z]*', 'o rato roeu a roupa do rei de roma') ['rato', 'roeu', 'roupa', 'rei', 'roma'] >>> re.sub(r'(\b[a-z]+) \1', r'\1', 'o gato de de chapéu') 'o gato de chapéu'

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
pt_br: Quando as exigências são simples, métodos de strings são preferíveis por serem mais fáceis de ler e depurar::

source: >>> 'tea for too'.replace('too', 'two') 'tea for two'
pt_br: >>> 'xá para dois'.replace('xá', 'chá') 'chá para dois'

source: Mathematics
pt_br: Matemática

source: The :mod:`math` module gives access to the underlying C library functions for floating-point math::
pt_br: O módulo :mod:`math` oferece acesso às funções da biblioteca C para matemática de ponto flutuante::

source: The :mod:`random` module provides tools for making random selections::
pt_br: O módulo :mod:`random` fornece ferramentas para gerar seleções aleatórias::

source: >>> import random >>> random.choice(['apple', 'pear', 'banana']) 'apple' >>> random.sample(range(100), 10) # sampling without replacement [30, 83, 16, 4, 8, 81, 41, 50, 18, 33] >>> random.random() # random float from the interval [0.0, 1.0) 0.17970987693706186 >>> random.randrange(6) # random integer chosen from range(6) 4
pt_br: >>> import random >>> random.choice(['maçã', 'pera', 'banana']) 'maçã' >>> random.sample(range(100), 10) # amostragem sem reposição [30, 83, 16, 4, 8, 81, 41, 50, 18, 33] >>> random.random() # ponto flutuante aleatório do intervalo [0.0, 1.0) 0.17970987693706186 >>> random.randrange(6) # inteiro aleatório escolhido de range(6) 4

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
pt_br: O módulo :mod:`statistics` calcula as propriedades estatísticas básicas (a média, a mediana, a variação, etc.) de dados numéricos::

source: >>> import statistics >>> data = [2.75, 1.75, 1.25, 0.25, 0.5, 1.25, 3.5] >>> statistics.mean(data) 1.6071428571428572 >>> statistics.median(data) 1.25 >>> statistics.variance(data) 1.3720238095238095
pt_br: >>> import statistics >>> dados = [2.75, 1.75, 1.25, 0.25, 0.5, 1.25, 3.5] >>> statistics.mean(dados) 1.6071428571428572 >>> statistics.median(dados) 1.25 >>> statistics.variance(dados) 1.3720238095238095

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
pt_br: O projeto SciPy <https://scipy.org> tem muitos outros módulos para cálculos numéricos.

source: Internet Access
pt_br: Acesso à internet

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
pt_br: Há diversos módulos para acesso e processamento de protocolos da internet. Dois dos mais simples são :mod:`urllib.request` para efetuar download de dados a partir de URLs e :mod:`smtplib` para enviar mensagens de correio eletrônico::

source: >>> from urllib.request import urlopen >>> with urlopen('http://worldtimeapi.org/api/timezone/etc/UTC.txt') as response: ... for line in response: ... line = line.decode() # Convert bytes to a str ... if line.startswith('datetime'): ... print(line.rstrip()) # Remove trailing newline ... datetime: 2022-01-01T01:36:47.689215+00:00 >>> import smtplib >>> server = smtplib.SMTP('localhost') >>> server.sendmail('soothsayer@example.org', 'jcaesar@example.org', ... """To: jcaesar@example.org ... From: soothsayer@example.org ... ... Beware the Ides of March. ... """) >>> server.quit()
pt_br: >>> from urllib.request import urlopen >>> with urlopen('http://worldtimeapi.org/api/timezone/etc/UTC.txt') as response: ... for line in response: ... line = line.decode() # Converte bytes para str ... if line.startswith('datetime'): ... print(line.rstrip()) # Remove nova linha ao final ... datetime: 2022-01-01T01:36:47.689215+00:00 >>> import smtplib >>> server = smtplib.SMTP('localhost') >>> server.sendmail('soothsayer@example.org', 'jcaesar@example.org', ... """To: jcaesar@example.org ... From: soothsayer@example.org ... ... Beware the Ides of March. ... """) >>> server.quit()

source: (Note that the second example needs a mailserver running on localhost.)
pt_br: (Note que o segundo exemplo precisa de um servidor de email rodando em localhost.)

source: Dates and Times
pt_br: Data e hora

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
pt_br: O módulo :mod:`datetime` fornece classes para manipulação de datas e horas nas mais variadas formas. Apesar da disponibilidade de aritmética com data e hora, o foco da implementação é na extração eficiente dos membros para formatação e manipulação. O módulo também oferece objetos que levam os fusos horários em consideração. ::

source: >>> # dates are easily constructed and formatted >>> from datetime import date >>> now = date.today() >>> now datetime.date(2003, 12, 2) >>> now.strftime("%m-%d-%y. %d %b %Y is a %A on the %d day of %B.") '12-02-03. 02 Dec 2003 is a Tuesday on the 02 day of December.' >>> # dates support calendar arithmetic >>> birthday = date(1964, 7, 31) >>> age = now - birthday >>> age.days 14368
pt_br: >>> # datas são facilmente construídas e formatadas >>> from datetime import date >>> now = date.today() >>> now datetime.date(2003, 12, 2) >>> now.strftime("%m-%d-%y. %d %b %Y is a %A on the %d day of %B.") '12-02-03. 02 Dec 2003 is a Tuesday on the 02 day of December.' >>> # datas têm suporte a matemática de calendário >>> birthday = date(1964, 7, 31) >>> age = now - birthday >>> age.days 14368

source: Data Compression
pt_br: Compressão de dados

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
pt_br: Formatos comuns de arquivamento e compressão de dados estão disponíveis diretamente através de alguns módulos, entre eles: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::

source: >>> import zlib >>> s = b'witch which has which witches wrist watch' >>> len(s) 41 >>> t = zlib.compress(s) >>> len(t) 37 >>> zlib.decompress(t) b'witch which has which witches wrist watch' >>> zlib.crc32(s) 226805979
pt_br: >>> import zlib >>> s = b'A vaca malhada foi molhada por outra vaca molhada e malhada.' >>> len(s) 60 >>> t = zlib.compress(s) >>> len(t) 47 >>> zlib.decompress(t) b'A vaca malhada foi molhada por outra vaca molhada e malhada.' >>> zlib.crc32(s) 2444551089

source: Performance Measurement
pt_br: Medição de desempenho

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
pt_br: Alguns usuários de Python desenvolvem um interesse profundo pelo desempenho relativo de diferentes abordagens para o mesmo problema. Python oferece uma ferramenta de medição que esclarece essas dúvidas rapidamente.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
pt_br: Por exemplo, pode ser tentador usar o empacotamento e desempacotamento de tuplas ao invés da abordagem tradicional de permutar os argumentos. O módulo :mod:`timeit` rapidamente mostra uma modesta vantagem de desempenho::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
pt_br: Em contraste com a granularidade fina do módulo :mod:`timeit`, os módulos :mod:`profile` e :mod:`pstats` oferecem ferramentas para identificar os trechos mais críticos em grandes blocos de código.

source: Quality Control
pt_br: Controle de qualidade

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
pt_br: Uma das abordagens usadas no desenvolvimento de software de alta qualidade é escrever testes para cada função à medida que é desenvolvida e executar esses testes frequentemente durante o processo de desenvolvimento.

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
pt_br: O módulo :mod:`doctest` oferece uma ferramenta para realizar um trabalho de varredura e validação de testes escritos nas strings de documentação (docstrings) de um programa. A construção dos testes é tão simples quanto copiar uma chamada típica juntamente com seus resultados e colá-los na docstring. Isto aprimora a documentação, fornecendo ao usuário um exemplo real, e permite que o módulo doctest verifique se o código continua fiel à documentação::

source: def average(values): """Computes the arithmetic mean of a list of numbers. >>> print(average([20, 30, 70])) 40.0 """ return sum(values) / len(values) import doctest doctest.testmod() # automatically validate the embedded tests
pt_br: def average(values): """Calcula a média aritmética da lista de números. >>> print(average([20, 30, 70])) 40.0 """ return sum(values) / len(values) import doctest doctest.testmod() # valida automaticamente os testes incorporados

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
pt_br: O módulo :mod:`unittest` não é tão simples de usar quanto o módulo :mod:`doctest`, mas permite que um conjunto muito maior de testes seja mantido em um arquivo separado::

source: import unittest class TestStatisticalFunctions(unittest.TestCase): def test_average(self): self.assertEqual(average([20, 30, 70]), 40.0) self.assertEqual(round(average([1, 5, 7]), 1), 4.3) with self.assertRaises(ZeroDivisionError): average([]) with self.assertRaises(TypeError): average(20, 30, 70) unittest.main() # Calling from the command line invokes all tests
pt_br: import unittest class TestStatisticalFunctions(unittest.TestCase): def test_average(self): self.assertEqual(average([20, 30, 70]), 40.0) self.assertEqual(round(average([1, 5, 7]), 1), 4.3) with self.assertRaises(ZeroDivisionError): average([]) with self.assertRaises(TypeError): average(20, 30, 70) unittest.main() # Chamar a partir da linha de comando invoca todos os testes

source: Batteries Included
pt_br: Baterias incluídas

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
pt_br: Python tem uma filosofia de "baterias incluídas". Isso fica mais evidente através da sofisticação e robustez dos seus maiores pacotes. Por exemplo:

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
pt_br: Os módulos :mod:`xmlrpc.client` e :mod:`xmlrpc.server` tornam a implementação de chamadas remotas (remote procedure calls) em uma tarefa quase trivial. Apesar dos nomes dos módulos, nenhum conhecimento direto ou manipulação de XML é necessário.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
pt_br: O pacote :mod:`email` é uma biblioteca para gerenciamento de mensagens de correio eletrônico, incluindo MIME e outros baseados no :rfc:`2822`. Diferente dos módulos :mod:`smtplib` e :mod:`poplib` que apenas enviam e recebem mensagens, o pacote de email tem um conjunto completo de ferramentas para construir ou decodificar a estrutura de mensagens complexas (incluindo anexos) e para implementação de protocolos de codificação e cabeçalhos.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
pt_br: O pacote :mod:`json` oferece um suporte robusto para analisar este popular formato para troca de dados. O módulo :mod:`csv` oferece suporte para leitura e escrita direta em arquivos no formato Comma-Separated Value, comumente suportado por bancos de dados e planilhas. O processamento XML é fornecido pelos pacotes :mod:`xml.etree.ElementTree`, :mod:`xml.dom` e :mod:`xml.sax`. Juntos, esses módulos e pacotes simplificam muito a troca de informações entre aplicativos Python e outras ferramentas.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
pt_br: O módulo :mod:`sqlite3` é um wrapper para a biblioteca de banco de dados SQLite, fornecendo um banco de dados persistente que pode ser atualizado e acessado usando sintaxe SQL ligeiramente fora do padrão.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
pt_br: Internacionalização está disponível através de diversos módulos, como :mod:`gettext`, :mod:`locale`, e o pacote :mod:`codecs`.

source: built-in function
pt_br: função embutida
