Repository: python/python-docs-pt-br
Catalog: tutorial/venv.po
Languages: pt_br

source: Virtual Environments and Packages
pt_br: Ambientes virtuais e pacotes

source: Introduction
pt_br: Introdução

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
pt_br: Aplicações em Python normalmente usam pacotes e módulos que não vêm como parte da instalação padrão. Aplicações às vezes necessitam uma versão específica de uma biblioteca, porque ela requer que algum problema em particular tenha sido consertado ou foi escrita utilizando-se de uma versão obsoleta da interface da biblioteca.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
pt_br: Isso significa que talvez não seja possível que uma instalação Python preencha os requisitos de qualquer aplicação. Se uma aplicação A necessita a versão 1.0 de um módulo particular mas a aplicação B necessita a versão 2.0, os requisitos entrarão em conflito e instalar qualquer uma das duas versões 1.0 ou 2.0 fará com que uma das aplicações não consiga executar.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
pt_br: A solução para este problema é criar um :term:`ambiente virtual`, uma árvore de diretórios que contém uma instalação Python para uma versão particular do Python, além de uma série de pacotes adicionais.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
pt_br: Diferentes aplicações podem então usar diferentes ambientes virtuais. Para resolver o exemplo anterior de requisitos conflitantes, a aplicação A deve ter seu próprio ambiente virtual com a versão 1.0 instalada enquanto a aplicação B vai possuir outro ambiente virtual com a versão 2.0. Se a aplicação B precisar fazer uma atualização para a versão 3.0, isso não afetará o ambiente da aplicação A.

source: Creating Virtual Environments
pt_br: Criando ambientes virtuais

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will install the Python version from which the command was run (as reported by the :option:`--version` option). For instance, executing the command with ``python3.12`` will install version 3.12.
pt_br: O módulo usado para criar e gerenciar ambientes virtuais é chamado :mod:`venv`. :mod:`venv` instalará a versão do Python a partir da qual o comando foi executado (conforme relatado pela opção :option:`--version`). Por exemplo, executar o comando com ``python3.12`` instalará a versão 3.12.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
pt_br: Para criar um ambiente virtual, escolha um diretório onde deseja colocá-lo e execute o módulo :mod:`venv` como um script com o caminho do diretório::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
pt_br: Isso irá criar o diretório ``tutorial-env`` se ele não existir, e também criará diretórios dentro dele contendo uma cópia do interpretador Python, a biblioteca padrão e diversos arquivos de suporte.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
pt_br: Um diretório de localização comum para um ambiente virtual é ``.venv``. Esse nome tipicamente mantém o diretório oculto em seu ambiente, portanto é transparente, ao menos tempo que explica o motivo desse diretório existir. Também previne conflitos com ``.env``, arquivos de definição de variáveis de ambiente que algumas ferramentas utilizam.

source: Once you've created a virtual environment, you may activate it.
pt_br: Uma vez criado seu ambiente virtual, você deve ativá-lo.

source: On Windows, run::
pt_br: No Windows, execute::

source: On Unix or MacOS, run::
pt_br: No Unix ou no MacOS, executa::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
pt_br: (Este script é escrito para o shell bash. Se você usa shells :program:`csh` ou :program:`fish`, existem scripts alternativos ``activate.csh`` e ``activate.fish`` para utilização.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
pt_br: Ao ativar seu ambiente virtual haverá uma mudança no prompt do shell para mostrar qual ambiente virtual você está usando e modificará o ambiente para que quando você executar ``python`` ativar a versão e instalação do Python particular àquele ambiente. Por exemplo:

source: To deactivate a virtual environment, type::
pt_br: Para desativar um ambiente virtual, digite::

source: into the terminal.
pt_br: no terminal.

source: Managing Packages with pip
pt_br: Gerenciando pacotes com o pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
pt_br: Você pode instalar, atualizar e remover pacotes usando um programa chamado :program:`pip`. Por padrão ``pip`` irá instalar pacotes do `Python Package Index <https://pypi.org>`_. Você pode navegar pelo Python Package Index através do seu navegador web.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
pt_br: ``pip`` tem uma série de subcomandos: "install", "uninstall", "freeze", etc. (Consulte o guia :ref:`installing-index` para a documentação completa do ``pip``.)

source: You can install the latest version of a package by specifying a package's name:
pt_br: Você pode instalar a última versão de um pacote apenas especificando nome do pacote:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
pt_br: Você também pode instalar uma versão específica de um pacote dando o nome do pacote seguido por ``==`` e o número da versão:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
pt_br: Se você executar novamente o comando, ``pip`` será notificado de que a versão já está instalada, e não fará nada. Você pode fornecer um número de versão diferente para obter essa versão ou pode executar ``python -m pip install --upgrade`` para atualizar o pacote para a versão mais recente:

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
pt_br: ``python -m pip uninstall`` seguido por um ou mais nomes de pacote removerá os pacotes do ambiente virtual.

source: ``python -m pip show`` will display information about a particular package:
pt_br: ``python -m pip show`` exibirá informações sobre um pacote específico:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
pt_br: ``python -m pip list`` exibirá todos os pacotes instalados no ambiente virtual:

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
pt_br: ``python -m pip freeze`` produzirá uma lista semelhante dos pacotes instalados, mas a saída usa o formato que ``python -m pip install`` espera. Uma convenção comum é colocar esta lista em um arquivo ``requirements.txt``:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
pt_br: O arquivo ``requirements.txt`` pode ser submetido no controle de versão e adicionado como parte da aplicação. Usuários poderão então instalar todos os pacotes necessários com um ``install -r``:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
pt_br: ``pip`` tem inúmeras outras opções. Consulte o guia :ref:`installing-index` para a documentação completa do ``pip``. Quando você escrever um pacote e desejar deixá-lo disponível no Python Package Index, consulte o `guia de usuário para empacotamento de Python`_.
