Repository: python/python-docs-pt-br
Catalog: tutorial/whatnow.po
Languages: pt_br

source: What Now?
pt_br: E agora?

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
pt_br: Ler este tutorial provavelmente reforçou seu interesse em usar Python --- você deve estar ansioso para aplicar Python para resolver problemas do mundo real. Aonde você deveria ir para aprender mais?

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
pt_br: Este tutorial é parte do conjunto de documentação da linguagem Python. Alguns outros documentos neste conjunto são:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
pt_br: Você deveria navegar através deste manual, que lhe dará material completo (ainda que breve) de referência sobre tipos, funções e módulos na biblioteca padrão. A distribuição padrão do Python inclui *muito* código adicional. Há módulos para ler caixa de correio Unix, baixar documentos via HTTP, gerar números aleatórios, processar opções de linha de comando, comprimir dados a muitas outras tarefas. Uma lida rápida da Referência da Biblioteca lhe dará uma ideia do que está disponível.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
pt_br: :ref:`installing-index` explica como instalar módulos adicionais escritos por outros usuários de Python.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
pt_br: :ref:`reference-index`: Uma explicação detalhada da sintaxe e da semântica de Python. É uma leitura pesada, mas é útil como um guia completo da linguagem propriamente dita.

source: More Python resources:
pt_br: Mais recursos Python:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
pt_br: https://www.python.org: o principal web site sobre Python. Contém código, documentação, e referências para outras páginas relacionadas a Python ao redor da web.

source: https://docs.python.org: Fast access to Python's documentation.
pt_br: https://docs.python.org: acesso rápido à documentação Python.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
pt_br: https://pypi.org: O Python Package Index, anteriormente apelidado de Cheese Shop [#]_, é um índice de módulos Python criados pelos usuários. Uma vez que você começa a publicar código, pode registrar seus pacotes aqui para que outros possam encontrá-los.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
pt_br: https://code.activestate.com/recipes/langs/python/: O Python Cookbook (livro de receitas de Python) é uma grande coleção de exemplos de código, módulos maiores e scripts úteis.Contribuições particularmente notáveis são coletadas em um livro também chamado Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
pt_br: https://pyvideo.org coleta links para vídeo relacionados a Python de conferências e reuniões de grupos de usuários.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
pt_br: https://scipy.org: o projeto Scientific Python ( Python Científico) inclui módulos para computação e manipulação rápida de vetores e também hospeda pacotes para coisas similares como álgebra linear, transformações de Fourier, resolvedores não-lineares, distribuições de números aleatórios, análise estatística e afins.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
pt_br: Para reportar questões e problemas relacionadas a Python, você pode postar no newsgroup :newsgroup:`comp.lang.python` ou enviá-los para o grupo de e-mail em python-list@python.org. O newsgroup e a lista são conectados, então mensagens postadas em um são automaticamente encaminhadas ao outro. Há centenas de postagem diárias perguntando (e respondendo) perguntas, sugerindo novas funcionalidades e anunciando novos módulos. E-mails arquivados estão disponíveis em https://mail.python.org/pipermail/. Existe também o grupo de discussão da comunidade brasileira de Python: python-brasil no Google Groups (http://groups.google.com/group/python-brasil), com discussões de ótimo nível técnico.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
pt_br: Antes de postar, certifique-se de checar a lista de :ref:`perguntas frequentes <faq-index>` (também chamada de FAQ). O FAQ responde muitas das perguntas que aparecem com frequência e pode já conter a solução para o seu problema.

source: Footnotes
pt_br: Notas de rodapé

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
pt_br: "Cheese Shop" é o título de um quadro do grupo Monty Python: um freguês entra em uma loja especializada em queijos, mas qualquer queijo que ele pede, o balconista diz que está em falta.
