Repository: python/python-docs-pt-br
Catalog: deprecations/c-api-pending-removal-*-3.14.po
Languages: pt_br

source: Pending Removal in Python 3.14
pt_br: Remoção pendente no Python 3.14

source: The ``ma_version_tag`` field in :c:type:`PyDictObject` for extension modules (:pep:`699`; :gh:`101193`).
pt_br: O campo ``ma_version_tag`` em :c:type:`PyDictObject` para módulos de extensão (:pep:`699`; :gh:`101193`).

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases (:gh:`95388`).
pt_br: A criação de :c:data:`tipos imutáveis <Py_TPFLAGS_IMMUTABLETYPE>` com bases mutáveis (:gh:`95388`).

source: Functions to configure Python's initialization, deprecated in Python 3.11:
pt_br: Funções para configurar a inicialização do Python, descontinuadas no Python 3.11:

source: :c:func:`!PySys_SetArgvEx()`: Set :c:member:`PyConfig.argv` instead.
pt_br: :c:func:`!PySys_SetArgvEx()`: Defina :c:member:`PyConfig.argv`.

source: :c:func:`!PySys_SetArgv()`: Set :c:member:`PyConfig.argv` instead.
pt_br: :c:func:`!PySys_SetArgv()`: Defina :c:member:`PyConfig.argv`.

source: :c:func:`!Py_SetProgramName()`: Set :c:member:`PyConfig.program_name` instead.
pt_br: :c:func:`!Py_SetProgramName()`: Defina :c:member:`PyConfig.program_name`.

source: :c:func:`!Py_SetPythonHome()`: Set :c:member:`PyConfig.home` instead.
pt_br: :c:func:`!Py_SetPythonHome()`: Defina :c:member:`PyConfig.home`.

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead.
pt_br: A API :c:func:`Py_InitializeFromConfig` deve ser usada com :c:type:`PyConfig`.

source: Global configuration variables:
pt_br: Variáveis de configuração globais

source: :c:var:`Py_DebugFlag`: Use :c:member:`PyConfig.parser_debug` instead.
pt_br: :c:var:`Py_DebugFlag`: Use :c:member:`PyConfig.parser_debug`.

source: :c:var:`Py_VerboseFlag`: Use :c:member:`PyConfig.verbose` instead.
pt_br: :c:var:`Py_VerboseFlag`: Use :c:member:`PyConfig.verbose`.

source: :c:var:`Py_QuietFlag`: Use :c:member:`PyConfig.quiet` instead.
pt_br: :c:var:`Py_QuietFlag`: Use :c:member:`PyConfig.quiet`.

source: :c:var:`Py_InteractiveFlag`: Use :c:member:`PyConfig.interactive` instead.
pt_br: :c:var:`Py_InteractiveFlag`: Use :c:member:`PyConfig.interactive`.

source: :c:var:`Py_InspectFlag`: Use :c:member:`PyConfig.inspect` instead.
pt_br: :c:var:`Py_InspectFlag`: Use :c:member:`PyConfig.inspect`.

source: :c:var:`Py_OptimizeFlag`: Use :c:member:`PyConfig.optimization_level` instead.
pt_br: :c:var:`Py_OptimizeFlag`: Use :c:member:`PyConfig.optimization_level`.

source: :c:var:`Py_NoSiteFlag`: Use :c:member:`PyConfig.site_import` instead.
pt_br: :c:var:`Py_NoSiteFlag`: Use :c:member:`PyConfig.site_import`.

source: :c:var:`Py_BytesWarningFlag`: Use :c:member:`PyConfig.bytes_warning` instead.
pt_br: :c:var:`Py_BytesWarningFlag`: Use :c:member:`PyConfig.bytes_warning`.

source: :c:var:`Py_FrozenFlag`: Use :c:member:`PyConfig.pathconfig_warnings` instead.
pt_br: :c:var:`Py_FrozenFlag`: Use :c:member:`PyConfig.pathconfig_warnings`.

source: :c:var:`Py_IgnoreEnvironmentFlag`: Use :c:member:`PyConfig.use_environment` instead.
pt_br: :c:var:`Py_IgnoreEnvironmentFlag`: Use :c:member:`PyConfig.use_environment`.

source: :c:var:`Py_DontWriteBytecodeFlag`: Use :c:member:`PyConfig.write_bytecode` instead.
pt_br: :c:var:`Py_DontWriteBytecodeFlag`: Use :c:member:`PyConfig.write_bytecode`.

source: :c:var:`Py_NoUserSiteDirectory`: Use :c:member:`PyConfig.user_site_directory` instead.
pt_br: :c:var:`Py_NoUserSiteDirectory`: Use :c:member:`PyConfig.user_site_directory`.

source: :c:var:`Py_UnbufferedStdioFlag`: Use :c:member:`PyConfig.buffered_stdio` instead.
pt_br: :c:var:`Py_UnbufferedStdioFlag`: Use :c:member:`PyConfig.buffered_stdio`.

source: :c:var:`Py_HashRandomizationFlag`: Use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed` instead.
pt_br: :c:var:`Py_HashRandomizationFlag`: Use :c:member:`PyConfig.use_hash_seed` e :c:member:`PyConfig.hash_seed`.

source: :c:var:`Py_IsolatedFlag`: Use :c:member:`PyConfig.isolated` instead.
pt_br: :c:var:`Py_IsolatedFlag`: Use :c:member:`PyConfig.isolated`.

source: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Use :c:member:`PyPreConfig.legacy_windows_fs_encoding` instead.
pt_br: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Use :c:member:`PyPreConfig.legacy_windows_fs_encoding`.

source: :c:var:`Py_LegacyWindowsStdioFlag`: Use :c:member:`PyConfig.legacy_windows_stdio` instead.
pt_br: :c:var:`Py_LegacyWindowsStdioFlag`: Use :c:member:`PyConfig.legacy_windows_stdio`.

source: :c:var:`!Py_FileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` instead.
pt_br: :c:var:`!Py_FileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding`.

source: :c:var:`!Py_HasFileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` instead.
pt_br: :c:var:`!Py_HasFileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding`.

source: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Use :c:member:`PyConfig.filesystem_errors` instead.
pt_br: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Use :c:member:`PyConfig.filesystem_errors`.

source: :c:var:`!Py_UTF8Mode`: Use :c:member:`PyPreConfig.utf8_mode` instead. (see :c:func:`Py_PreInitialize`)
pt_br: :c:var:`!Py_UTF8Mode`: Use :c:member:`PyPreConfig.utf8_mode`. (veja :c:func:`Py_PreInitialize`)
