Repository: python/python-docs-pt-br
Catalog: about.po
Languages: pt_br

source: About these documents
pt_br: Sobre a Documentação

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
pt_br: Estes documentos são gerados a partir de fontes `reStructuredText`_ utilizando `Sphinx`_, um processador de documentos escrito especificamente para a documentação do Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
pt_br: Desenvolvimento da documentação e suas ferramentas é um esforço totalmente voluntário, como o Python em si. Se você quer contribuir, por favor dê uma olhada na página :ref:`reporting-bugs` para informações sobre como fazer. Novos voluntários são sempre bem vindos!

source: Many thanks go to:
pt_br: Agradecimentos especiais para:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
pt_br: Fred L. Drake, Jr., o criador do primeiro conjunto de ferramentas para documentar o Python e escritor de boa parte do conteúdo;

source: the `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
pt_br: O projeto `Docutils <http://docutils.sourceforge.net/>`_ por ter criado reStructuredText e a suíte Docutils;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
pt_br: Fredrik Lundh por sua `Referência Alternativa para Python <http://effbot.org/zone/pyref.htm>`_ projeto do qual, Sphinx tirou muitas idéias boas.

source: Contributors to the Python Documentation
pt_br: Contribuidores da Documentação do Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
pt_br: Muitas pessoas tem contribuído para a linguagem Python, sua biblioteca padrão e sua documentação. Veja :source:`Misc/ACKS` na distribuição do código-fonte do Python para ver uma lista parcial de contribuidores.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
pt_br: Tudo isso só foi possível com o esforço e a contribuição da comunidade Python, por isso temos essa maravilhosa documentação -- Obrigado a todos!
