Repository: python/python-docs-pt-br
Catalog: bugs.po
Languages: pt_br

source: Dealing with Bugs
pt_br: Lidando com bugs

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
pt_br: O Python é uma linguagem de programação madura que estabeleceu uma reputação pela estabilidade. A fim de manter esta reputação os desenvolvedores gostariam de saber de quaisquer deficiências que você encontrar no Python.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
pt_br: Às vezes, pode ser mais rápido consertar os bugs você mesmo e contribuir com patches para o Python uma vez que isso agiliza o processo e envolve menos pessoas. Veja aqui como :ref:`contribuir <contributing-to-python>`.

source: Documentation bugs
pt_br: Bugs na documentação

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
pt_br: Se você achar um bug nesta documentação ou gostaria de propor uma melhoria, por favor submeta um relatório no :ref:`rastreador <using-the-tracker>`. Se você tem uma sugestão sobre como consertá-lo inclua isso também.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
pt_br: Você também pode abrir um item de discussão em nosso `fórum Discourse de documentação <https://discuss.python.org/c/documentation/26>`_.

source: If you find a bug in the theme (HTML / CSS / JavaScript) of the documentation, please submit a bug report on the `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_.
pt_br: Se você encontrar um bug no tema (HTML/CSS/JavaScript) da documentação, envie um relatório de bug no `rastreador de bugs do python-doc-theme <https://github.com/python/python-docs-theme>`_.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
pt_br: Se você está com pouco tempo, pode também enviar os relatórios de erros de documentação para o e-mail docs@python.org (erros de funcionalidades podem ser enviados para python-list@python.org). 'docs@' é uma lista de discussão mantida por voluntários; seu pedido será recebido, embora possa levar um tempo para ser processado.

source: `Documentation bugs`_
pt_br: `Bugs na documentação`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
pt_br: Uma lista de bugs na documentação que foram submetidos no rastreador de problemas do Python.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
pt_br: `Rastreando problemas <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
pt_br: Visão geral do processo envolvido em reportar uma melhoria no rastreador.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
pt_br: `Ajudando com a Documentação <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
pt_br: Guia compreensivo para os indivíduos que estão interessados em contribuir com a documentação do Python.

source: `Documentation Translations <https://devguide.python.org/documentation/translating/>`_
pt_br: `Traduções da Documentação <https://devguide.python.org/documentation/translating/>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
pt_br: Uma lista de páginas no GitHub relacionadas à tradução da documentação e respectivos contatos iniciais.

source: Using the Python issue tracker
pt_br: Usando o rastreador de problemas do Python

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
pt_br: Relatórios de problemas do Python em si devem ser submetidos ao rastreador de problemas do GitHub (https://github.com/python/cpython/issues). O rastreador de problemas do GitHub oferece um formulário web que permite informações pertinentes serem enviadas para os desenvolvedores.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
pt_br: O primeiro passo para preencher um relatório é determinar se o problema já foi reportado. A vantagem em fazê-lo além de poupar o tempo dos desenvolvedores é que você aprende o que foi feito para consertá-lo; pode ser que o problema já foi consertado para o próximo lançamento, ou que informação adicional seja necessária (nesse caso, você é bem-vindo para fornecê-la se você puder!). Para fazer isso, procure no rastreador usando a caixa de busca no topo da página.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
pt_br: Se o problema que você está relatando ainda não estiver na lista, faça login no GitHub. Se você ainda não tiver uma conta do GitHub, crie uma nova conta usando o link "Sign Up". Não é possível enviar um relatório de bug anonimamente.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
pt_br: Estando agora autenticado, você pode submeter um relatório de problema. Clique no botão "New issue" na barra superior para relatar um novo problema.

source: The submission form has two fields, "Title" and "Comment".
pt_br: O formulário de submissão tem dois campos, "Title" e "Comment".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
pt_br: Para o campo "Title", insira uma descrição *muito* curta do problema; menos de dez palavras é bom.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
pt_br: No campo "Comment", descreva o problema com detalhes, incluindo o que você esperava que acontecesse e o que aconteceu. Certifique-se de incluir se quaisquer módulos de extensão estavam envolvidos, e qual hardware e plataforma de software você está usando (incluindo informações sobre a versão quando apropriado).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
pt_br: Cada relatório de problema será revisado por um desenvolvedor que irá determinar o que é necessário para solucionar o problema. Você receberá atualizações para cada ação tomada para o problema.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
pt_br: `Como Reportar Bugs Eficientemente <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
pt_br: Artigo que entra em algum detalhe sobre como criar um relatório de bug útil. Isto descreve qual tipo de informação é útil e por quê é útil.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
pt_br: `Diretrizes para relatar bugs <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
pt_br: Informação sobre como escrever um bom relatório de bug. Um pouco disto é específico do Projeto Mozilla, mas descreve boas práticas em geral.

source: Getting started contributing to Python yourself
pt_br: Começando a contribuir com o Python por conta própria

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
pt_br: Além de apenas reportar os bugs que você encontrar, você também é bem-vindo para submeter patches para consertá-los. Você pode achar mais informações sobre como começar a contribuir com patches para o Python no `Python Developer's Guide`_. Se você tem mais perguntas, a `lista de discussão core-mentorship`_ é um lugar amigável para obter respostas para qualquer questão relativa ao processo de resolução de problemas no Python.
