Repository: python/python-docs-pt-br
Catalog: glossary.po
Languages: pt_br

source: A method that is called implicitly by Python to execute a certain operation on a type, such as addition. Such methods have names starting and ending with double underscores. Special methods are documented in :ref:`specialnames`.
pt_br: Um método que é chamado implicitamente pelo Python para executar uma certa operação em um tipo, como uma adição por exemplo. Tais métodos tem nomes iniciando e terminando com dois underscores. Métodos especiais estão documentados em :ref:`specialnames`.

source: standard library
pt_br: biblioteca padrão

source: The collection of :term:`packages <package>`, :term:`modules <module>` and :term:`extension modules <extension module>` distributed as a part of the official Python interpreter package. The exact membership of the collection may vary based on platform, available system libraries, or other criteria. Documentation can be found at :ref:`library-index`.
pt_br: A coleção de :term:`pacotes <package>`, :term:`módulos <module>` e :term:`módulos de extensão<extension module>` distribuída como parte do pacote do interpretador Python oficial. A relação exata de elementos da coleção pode variar de acordo com a plataforma, bibliotecas de sistema disponíveis ou outros critérios. A documentação pode ser encontrada em :ref:`library-index`.

source: See also :data:`sys.stdlib_module_names` for a list of all possible standard library module names.
pt_br: Veja também :data:`sys.stdlib_module_names` para obter uma lista de todos os possíveis nomes de módulos da biblioteca padrão.

source: statement
pt_br: instrução

source: A statement is part of a suite (a "block" of code). A statement is either an :term:`expression` or one of several constructs with a keyword, such as :keyword:`if`, :keyword:`while` or :keyword:`for`.
pt_br: Uma instrução é parte de uma suíte (um "bloco" de código). Uma instrução é ou uma :term:`expressão` ou uma de várias construções com uma palavra reservada, tal como :keyword:`if`, :keyword:`while` ou :keyword:`for`.

source: static type checker
pt_br: verificador de tipo estático

source: An external tool that reads Python code and analyzes it, looking for issues such as incorrect types. See also :term:`type hints <type hint>` and the :mod:`typing` module.
pt_br: Uma ferramenta externa que lê código Python e o analisa, procurando por problemas como tipos incorretos. Consulte também :term:`dicas de tipo <type hint>` e o módulo :mod:`typing`.

source: An abbreviation of :term:`standard library`.
pt_br: Uma abreviação para o termo :term:`biblioteca padrão` em inglês (standard library).

source: strong reference
pt_br: referência forte

source: In Python's C API, a strong reference is a reference to an object which is owned by the code holding the reference. The strong reference is taken by calling :c:func:`Py_INCREF` when the reference is created and released with :c:func:`Py_DECREF` when the reference is deleted.
pt_br: Na API C do Python, uma referência forte é uma referência a um objeto que pertence ao código que contém a referência. A referência forte é obtida chamando :c:func:`Py_INCREF` quando a referência é criada e liberada com :c:func:`Py_DECREF` quando a referência é excluída.

source: The :c:func:`Py_NewRef` function can be used to create a strong reference to an object. Usually, the :c:func:`Py_DECREF` function must be called on the strong reference before exiting the scope of the strong reference, to avoid leaking one reference.
pt_br: A função :c:func:`Py_NewRef` pode ser usada para criar uma referência forte para um objeto. Normalmente, a função :c:func:`Py_DECREF` deve ser chamada na referência forte antes de sair do escopo da referência forte, para evitar o vazamento de uma referência.

source: See also :term:`borrowed reference`.
pt_br: Veja também :term:`referência emprestada`.

source: String literals prefixed with ``t`` or ``T`` are commonly called "t-strings" which is short for :ref:`template string literals <t-strings>`.
pt_br: Literais de string prefixados com ``t`` ou ``T`` são comumente chamados de "t-strings", que é uma abreviação de :ref:`literais de strings templates <t-strings>`.

source: text encoding
pt_br: codificador de texto

source: A string in Python is a sequence of Unicode code points (in range ``U+0000``--``U+10FFFF``). To store or transfer a string, it needs to be serialized as a sequence of bytes.
pt_br: Uma string em Python é uma sequência de pontos de código Unicode (no intervalo ``U+0000``--``U+10FFFF``). Para armazenar ou transferir uma string, ela precisa ser serializada como uma sequência de bytes.

source: Serializing a string into a sequence of bytes is known as "encoding", and recreating the string from the sequence of bytes is known as "decoding".
pt_br: A serialização de uma string em uma sequência de bytes é conhecida como "codificação" e a recriação da string a partir de uma sequência de bytes é conhecida como "decodificação".

source: There are a variety of different text serialization :ref:`codecs <standard-encodings>`, which are collectively referred to as "text encodings".
pt_br: Há uma variedade de diferentes serializações de texto :ref:`codecs <standard-encodings>`, que são coletivamente chamadas de "codificações de texto".

source: text file
pt_br: arquivo texto

source: A :term:`file object` able to read and write :class:`str` objects. Often, a text file actually accesses a byte-oriented datastream and handles the :term:`text encoding` automatically. Examples of text files are files opened in text mode (``'r'`` or ``'w'``), :data:`sys.stdin`, :data:`sys.stdout`, and instances of :class:`io.StringIO`.
pt_br: Um :term:`objeto arquivo` apto a ler e escrever objetos :class:`str`. Geralmente, um arquivo texto, na verdade, acessa um fluxo de dados de bytes e captura o :term:`codificador de texto <text encoding>` automaticamente. Exemplos de arquivos texto são: arquivos abertos em modo texto (``'r'`` or ``'w'``), :data:`sys.stdin`, :data:`sys.stdout`, e instâncias de :class:`io.StringIO`.

source: See also :term:`binary file` for a file object able to read and write :term:`bytes-like objects <bytes-like object>`.
pt_br: Veja também :term:`arquivo binário` para um objeto arquivo apto a ler e escrever :term:`objetos bytes ou similares <bytes-like object>`.

source: thread state
pt_br: estado de thread

source: The information used by the :term:`CPython` runtime to run in an OS thread. For example, this includes the current exception, if any, and the state of the bytecode interpreter.
pt_br: As informações usadas pelo ambiente de execução do :term:`CPython` para executar em uma thread do sistema operacional. Por exemplo, isso inclui a exceção atual, se houver, e o estado do interpretador de bytecode.

source: Each thread state is bound to a single OS thread, but threads may have many thread states available. At most, one of them may be :term:`attached <attached thread state>` at once.
pt_br: Cada estado de thread está vinculado a uma única thread do SO, mas as threads podem ter muitos estados de thread disponíveis. No máximo, um deles pode ser :term:`anexado <attached thread state>` por vez.

source: An :term:`attached thread state` is required to call most of Python's C API, unless a function explicitly documents otherwise. The bytecode interpreter only runs under an attached thread state.
pt_br: Um :term:`estado de thread anexado` é necessário para chamar a maioria da API C do Python, a menos que uma função documente explicitamente o contrário. O interpretador de bytecode só é executado em um estado de thread anexado.

source: Each thread state belongs to a single interpreter, but each interpreter may have many thread states, including multiple for the same OS thread. Thread states from multiple interpreters may be bound to the same thread, but only one can be :term:`attached <attached thread state>` in that thread at any given moment.
pt_br: Cada estado de thread pertence a um único interpretador, mas cada interpretador pode ter vários estados de thread, incluindo vários para a mesma thread do sistema operacional. Estados de thread de vários interpretadores podem ser vinculados à mesma thread, mas apenas um pode ser :term:`anexado <attached thread state>` nessa thread a qualquer momento.

source: See :ref:`Thread State and the Global Interpreter Lock <threads>` for more information.
pt_br: Veja :ref:`Estado de thread e a trava global do interpretador <threads>` para mais informações.

source: A small unit of source code, generated by the :ref:`lexical analyzer <lexical>` (also called the *tokenizer*). Names, numbers, strings, operators, newlines and similar are represented by tokens.
pt_br: Uma pequena unidade de código-fonte, gerada pelo :ref:`analisador léxico <lexical>` (também chamado de *tokenizador*). Nomes, números, strings, operadores, quebras de linha e similares são representados por tokens.

source: The :mod:`tokenize` module exposes Python's lexical analyzer. The :mod:`token` module contains information on the various types of tokens.
pt_br: O módulo :mod:`tokenize` expõe o analisador léxico do Python. O módulo :mod:`token` contém informações sobre os vários tipos de tokens.

source: triple-quoted string
pt_br: aspas triplas

source: A string which is bound by three instances of either a quotation mark (") or an apostrophe ('). While they don't provide any functionality not available with single-quoted strings, they are useful for a number of reasons. They allow you to include unescaped single and double quotes within a string and they can span multiple lines without the use of the continuation character, making them especially useful when writing docstrings.
pt_br: Uma string que está definida com três ocorrências de aspas duplas (") ou apóstrofos ('). Enquanto elas não fornecem nenhuma funcionalidade não disponível com strings de aspas simples, elas são úteis para inúmeras razões. Elas permitem que você inclua aspas simples e duplas não escapadas dentro de uma string, e elas podem utilizar múltiplas linhas sem o uso de caractere de continuação, fazendo-as especialmente úteis quando escrevemos documentação em docstrings.

source: type
pt_br: tipo

source: The type of a Python object determines what kind of object it is; every object has a type. An object's type is accessible as its :attr:`~object.__class__` attribute or can be retrieved with ``type(obj)``.
pt_br: O tipo de um objeto Python determina qual classe de objeto ele é; cada objeto tem um tipo. Um tipo de objeto é acessível pelo atributo :attr:`~object.__class__` ou pode ser recuperado com ``type(obj)``.

source: type alias
pt_br: apelido de tipo

source: A synonym for a type, created by assigning the type to an identifier.
pt_br: Um sinônimo para um tipo, criado através da atribuição do tipo para um identificador.

source: Type aliases are useful for simplifying :term:`type hints <type hint>`. For example::
pt_br: Apelidos de tipo são úteis para simplificar :term:`dicas de tipo <type hint>`. Por exemplo::

source: def remove_gray_shades( colors: list[tuple[int, int, int]]) -> list[tuple[int, int, int]]: pass
pt_br: def remove_tons_de_cinza( cores: list[tuple[int, int, int]]) -> list[tuple[int, int, int]]: pass

source: could be made more readable like this::
pt_br: pode tornar-se mais legível desta forma::

source: Color = tuple[int, int, int] def remove_gray_shades(colors: list[Color]) -> list[Color]: pass
pt_br: Cor = tuple[int, int, int] def remove_tons_de_cinza(cores: list[Cor]) -> list[Cor]: pass

source: See :mod:`typing` and :pep:`484`, which describe this functionality.
pt_br: Veja :mod:`typing` e :pep:`484`, a qual descreve esta funcionalidade.

source: type hint
pt_br: dica de tipo

source: An :term:`annotation` that specifies the expected type for a variable, a class attribute, or a function parameter or return value.
pt_br: Uma :term:`anotação` que especifica o tipo esperado para uma variável, um atributo de classe, ou um parâmetro de função ou um valor de retorno.

source: Type hints are optional and are not enforced by Python but they are useful to :term:`static type checkers <static type checker>`. They can also aid IDEs with code completion and refactoring.
pt_br: Dicas de tipo são opcionais e não são forçadas pelo Python, mas elas são úteis para :term:`verificadores de tipo estático <static type checker>`. Eles também ajudam IDEs a completar e refatorar código.

source: Type hints of global variables, class attributes, and functions, but not local variables, can be accessed using :func:`typing.get_type_hints`.
pt_br: Dicas de tipos de variáveis globais, atributos de classes, e funções, mas não de variáveis locais, podem ser acessadas usando :func:`typing.get_type_hints`.

source: universal newlines
pt_br: novas linhas universais

source: A manner of interpreting text streams in which all of the following are recognized as ending a line: the Unix end-of-line convention ``'\n'``, the Windows convention ``'\r\n'``, and the old Macintosh convention ``'\r'``. See :pep:`278` and :pep:`3116`, as well as :func:`bytes.splitlines` for an additional use.
pt_br: Uma maneira de interpretar fluxos de textos, na qual todos estes são reconhecidos como caracteres de fim de linha: a convenção para fim de linha no Unix ``'\n'``, a convenção no Windows ``'\r\n'``, e a antiga convenção no Macintosh ``'\r'``. Veja :pep:`278` e :pep:`3116`, bem como :func:`bytes.splitlines` para uso adicional.

source: variable annotation
pt_br: anotação de variável

source: An :term:`annotation` of a variable or a class attribute.
pt_br: Uma :term:`anotação` de uma variável ou um atributo de classe.

source: When annotating a variable or a class attribute, assignment is optional::
pt_br: Ao fazer uma anotação de uma variável ou um atributo de classe, a atribuição é opcional::

source: class C: field: 'annotation'
pt_br: class C: campo: 'anotação'

source: Variable annotations are usually used for :term:`type hints <type hint>`: for example this variable is expected to take :class:`int` values::
pt_br: Anotações de variáveis são normalmente usadas para :term:`dicas de tipo <type hint>`: por exemplo, espera-se que esta variável receba valores do tipo :class:`int`::

source: count: int = 0
pt_br: contagem: int = 0

source: Variable annotation syntax is explained in section :ref:`annassign`.
pt_br: A sintaxe de anotação de variável é explicada na seção :ref:`annassign`.

source: See :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
pt_br: Veja :term:`anotação de função`, :pep:`484` e :pep:`526`, que descrevem esta funcionalidade. Veja também :ref:`annotations-howto` para as melhores práticas sobre como trabalhar com anotações.

source: virtual environment
pt_br: ambiente virtual

source: A cooperatively isolated runtime environment that allows Python users and applications to install and upgrade Python distribution packages without interfering with the behaviour of other Python applications running on the same system.
pt_br: Um ambiente de execução isolado que permite usuários Python e aplicações instalarem e atualizarem pacotes Python sem interferir no comportamento de outras aplicações Python em execução no mesmo sistema.

source: See also :mod:`venv`.
pt_br: Veja também :mod:`venv`.

source: virtual machine
pt_br: máquina virtual

source: A computer defined entirely in software. Python's virtual machine executes the :term:`bytecode` emitted by the bytecode compiler.
pt_br: Um computador definido inteiramente em software. A máquina virtual de Python executa o :term:`bytecode` emitido pelo compilador de bytecode.

source: walrus operator
pt_br: operador morsa

source: A light-hearted way to refer to the :ref:`assignment expression <assignment-expressions>` operator ``:=`` because it looks a bit like a walrus if you turn your head.
pt_br: Uma maneira bem-humorada de se referir ao operador da :ref:`expressão de atribuição <assignment-expressions>` ``:=`` porque ele se parece um pouco com uma morsa se você virar a cabeça.

source: Zen of Python
pt_br: Zen do Python

source: Listing of Python design principles and philosophies that are helpful in understanding and using the language. The listing can be found by typing "``import this``" at the interactive prompt.
pt_br: Lista de princípios de projeto e filosofias do Python que são úteis para a compreensão e uso da linguagem. A lista é exibida quando se digita "``import this``" no console interativo.

source: ellipsis literal
pt_br: literal de reticências

source: C-contiguous
pt_br: contíguo C

source: Fortran contiguous
pt_br: contíguo Fortran

source: magic
pt_br: mágico

source: special
pt_br: especial
