Repository: python/python-docs-pt-br
Catalog: glossary.po
Languages: pt_br

source: There are two types of finder: :term:`meta path finders <meta path finder>` for use with :data:`sys.meta_path`, and :term:`path entry finders <path entry finder>` for use with :data:`sys.path_hooks`.
pt_br: Existem dois tipos de localizador: :term:`localizadores de metacaminho <meta path finder>` para uso com :data:`sys.meta_path`, e :term:`localizadores de entrada de caminho <path entry finder>` para uso com :data:`sys.path_hooks`.

source: See :ref:`finders-and-loaders` and :mod:`importlib` for much more detail.
pt_br: Veja :ref:`finders-and-loaders` e :mod:`importlib` para muito mais detalhes.

source: floor division
pt_br: divisão pelo piso

source: Mathematical division that rounds down to nearest integer. The floor division operator is ``//``. For example, the expression ``11 // 4`` evaluates to ``2`` in contrast to the ``2.75`` returned by float true division. Note that ``(-11) // 4`` is ``-3`` because that is ``-2.75`` rounded *downward*. See :pep:`238`.
pt_br: Divisão matemática que arredonda para baixo para o inteiro mais próximo. O operador de divisão pelo piso é ``//``. Por exemplo, a expressão ``11 // 4`` retorna o valor ``2`` ao invés de ``2.75``, que seria retornado pela divisão de ponto flutuante. Note que ``(-11) // 4`` é ``-3`` porque é ``-2.75`` arredondado *para baixo*. Consulte a :pep:`238`.

source: free threading
pt_br: threads livres

source: A threading model where multiple threads can run Python bytecode simultaneously within the same interpreter. This is in contrast to the :term:`global interpreter lock` which allows only one thread to execute Python bytecode at a time. See :pep:`703`.
pt_br: Um modelo de threads onde múltiplas threads podem simultaneamente executar bytecode Python no mesmo interpretador. Isso está em contraste com a :term:`trava global do interpretador` que permite apenas uma thread por vez executar bytecode Python. Veja :pep:`703`.

source: free variable
pt_br: variável livre

source: Formally, as defined in the :ref:`language execution model <bind_names>`, a free variable is any variable used in a namespace which is not a local variable in that namespace. See :term:`closure variable` for an example. Pragmatically, due to the name of the :attr:`codeobject.co_freevars` attribute, the term is also sometimes used as a synonym for :term:`closure variable`.
pt_br: Formalmente, conforme definido no :ref:`modelo de execução de linguagem <bind_names>`, uma variável livre é qualquer variável usada em um espaço de nomes que não seja uma variável local naquele espaço de nomes. Veja :term:`variável de clausura` para um exemplo. Pragmaticamente, devido ao nome do atributo :attr:`codeobject.co_freevars`, o termo também é usado algumas vezes como sinônimo de :term:`variável de clausura`.

source: function
pt_br: função

source: A series of statements which returns some value to a caller. It can also be passed zero or more :term:`arguments <argument>` which may be used in the execution of the body. See also :term:`parameter`, :term:`method`, and the :ref:`function` section.
pt_br: Uma série de instruções que retorna algum valor para um chamador. Também pode ser passado zero ou mais :term:`argumentos <argument>` que podem ser usados na execução do corpo. Veja também :term:`parâmetro`, :term:`método` e a seção :ref:`function`.

source: function annotation
pt_br: anotação de função

source: An :term:`annotation` of a function parameter or return value.
pt_br: Uma :term:`anotação` de um parâmetro de função ou valor de retorno.

source: Function annotations are usually used for :term:`type hints <type hint>`: for example, this function is expected to take two :class:`int` arguments and is also expected to have an :class:`int` return value::
pt_br: Anotações de função são comumente usados por :term:`dicas de tipo <type hint>`: por exemplo, essa função espera receber dois argumentos :class:`int` e também é esperado que devolva um valor :class:`int`::

source: def sum_two_numbers(a: int, b: int) -> int: return a + b
pt_br: def soma_dois_numeros(a: int, b: int) -> int: return a + b

source: Function annotation syntax is explained in section :ref:`function`.
pt_br: A sintaxe de anotação de função é explicada na seção :ref:`function`.

source: See :term:`variable annotation` and :pep:`484`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
pt_br: Veja :term:`anotação de variável` e :pep:`484`, que descrevem esta funcionalidade. Veja também :ref:`annotations-howto` para as melhores práticas sobre como trabalhar com anotações.

source: A :ref:`future statement <future>`, ``from __future__ import <feature>``, directs the compiler to compile the current module using syntax or semantics that will become standard in a future release of Python. The :mod:`__future__` module documents the possible values of *feature*. By importing this module and evaluating its variables, you can see when a new feature was first added to the language and when it will (or did) become the default::
pt_br: A :ref:`instrução future <future>`, ``from __future__ import <feature>``, direciona o compilador a compilar o módulo atual usando sintaxe ou semântica que será padrão em uma versão futura de Python. O módulo :mod:`__future__` documenta os possíveis valores de *feature*. Importando esse módulo e avaliando suas variáveis, você pode ver quando um novo recurso foi inicialmente adicionado à linguagem e quando será (ou se já é) o padrão::

source: garbage collection
pt_br: coleta de lixo

source: The process of freeing memory when it is not used anymore. Python performs garbage collection via reference counting and a cyclic garbage collector that is able to detect and break reference cycles. The garbage collector can be controlled using the :mod:`gc` module.
pt_br: Também conhecido como *garbage collection*, é o processo de liberar a memória quando ela não é mais utilizada. Python executa a liberação da memória através da contagem de referências e um coletor de lixo cíclico que é capaz de detectar e interromper referências cíclicas. O coletor de lixo pode ser controlado usando o módulo :mod:`gc`.

source: generator
pt_br: gerador

source: A function which returns a :term:`generator iterator`. It looks like a normal function except that it contains :keyword:`yield` expressions for producing a series of values usable in a for-loop or that can be retrieved one at a time with the :func:`next` function.
pt_br: Uma função que retorna um :term:`iterador gerador <generator iterator>`. É parecida com uma função normal, exceto pelo fato de conter expressões :keyword:`yield` para produzir uma série de valores que podem ser usados em um laço "for" ou que podem ser obtidos um de cada vez com a função :func:`next`.

source: Usually refers to a generator function, but may refer to a *generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
pt_br: Normalmente refere-se a uma função geradora, mas pode referir-se a um *iterador gerador* em alguns contextos. Em alguns casos onde o significado desejado não está claro, usar o termo completo evita ambiguidade.

source: generator iterator
pt_br: iterador gerador

source: An object created by a :term:`generator` function.
pt_br: Um objeto criado por uma função :term:`geradora <gerador>`.

source: Each :keyword:`yield` temporarily suspends processing, remembering the execution state (including local variables and pending try-statements). When the *generator iterator* resumes, it picks up where it left off (in contrast to functions which start fresh on every invocation).
pt_br: Cada :keyword:`yield` suspende temporariamente o processamento, memorizando o estado da execução (incluindo variáveis locais e instruções try pendentes). Quando o *iterador gerador* retorna, ele se recupera do último ponto onde estava (em contrapartida as funções que iniciam uma nova execução a cada vez que são invocadas).

source: generator expression
pt_br: expressão geradora

source: An :term:`expression` that returns an :term:`iterator`. It looks like a normal expression followed by a :keyword:`!for` clause defining a loop variable, range, and an optional :keyword:`!if` clause. The combined expression generates values for an enclosing function::
pt_br: Uma :term:`expressão` que retorna um :term:`iterador`. Parece uma expressão normal, seguido de uma cláusula :keyword:`!for` definindo uma variável de laço, um intervalo, e uma cláusula :keyword:`!if` opcional. A expressão combinada gera valores para uma função encapsuladora::

source: >>> sum(i*i for i in range(10)) # sum of squares 0, 1, 4, ... 81 285
pt_br: >>> sum(i*i for i in range(10)) # soma dos quadrados 0, 1, 4, ... 81 285

source: generic function
pt_br: função genérica

source: A function composed of multiple functions implementing the same operation for different types. Which implementation should be used during a call is determined by the dispatch algorithm.
pt_br: Uma função composta por várias funções implementando a mesma operação para diferentes tipos. Qual implementação deverá ser usada durante a execução é determinada pelo algoritmo de despacho.

source: See also the :term:`single dispatch` glossary entry, the :func:`functools.singledispatch` decorator, and :pep:`443`.
pt_br: Veja também a entrada :term:`despacho único` no glossário, o decorador :func:`functools.singledispatch`, e a :pep:`443`.

source: generic type
pt_br: tipo genérico

source: A :term:`type` that can be parameterized; typically a :ref:`container class<sequence-types>` such as :class:`list` or :class:`dict`. Used for :term:`type hints <type hint>` and :term:`annotations <annotation>`.
pt_br: Um :term:`tipo` que pode ser parametrizado; tipicamente uma :ref:`classe contêiner<sequence-types>` tal como :class:`list` ou :class:`dict`. Usado para :term:`dicas de tipo <type hint>` e :term:`anotações <annotation>`.

source: For more details, see :ref:`generic alias types<types-genericalias>`, :pep:`483`, :pep:`484`, :pep:`585`, and the :mod:`typing` module.
pt_br: Para mais detalhes, veja :ref:`tipo apelido genérico <types-genericalias>`, :pep:`483`, :pep:`484`, :pep:`585`, e o módulo :mod:`typing`.

source: See :term:`global interpreter lock`.
pt_br: Veja :term:`trava global do interpretador`.

source: global interpreter lock
pt_br: trava global do interpretador

source: The mechanism used by the :term:`CPython` interpreter to assure that only one thread executes Python :term:`bytecode` at a time. This simplifies the CPython implementation by making the object model (including critical built-in types such as :class:`dict`) implicitly safe against concurrent access. Locking the entire interpreter makes it easier for the interpreter to be multi-threaded, at the expense of much of the parallelism afforded by multi-processor machines.
pt_br: O mecanismo utilizado pelo interpretador :term:`CPython` para garantir que apenas uma thread execute o :term:`bytecode` Python por vez. Isto simplifica a implementação do CPython ao fazer com que o modelo de objetos (incluindo tipos embutidos críticos como o :class:`dict`) ganhem segurança implícita contra acesso concorrente. Travar todo o interpretador facilita que o interpretador em si seja multithread, às custas de muito do paralelismo já provido por máquinas com multiprocessadores.

source: However, some extension modules, either standard or third-party, are designed so as to release the GIL when doing computationally intensive tasks such as compression or hashing. Also, the GIL is always released when doing I/O.
pt_br: No entanto, alguns módulos de extensão, tanto da biblioteca padrão quanto de terceiros, são desenvolvidos de forma a liberar a GIL ao realizar tarefas computacionalmente muito intensas, como compactação ou cálculos de hash. Além disso, a GIL é sempre liberada nas operações de E/S.

source: As of Python 3.13, the GIL can be disabled using the :option:`--disable-gil` build configuration. After building Python with this option, code must be run with :option:`-X gil=0 <-X>` or after setting the :envvar:`PYTHON_GIL=0 <PYTHON_GIL>` environment variable. This feature enables improved performance for multi-threaded applications and makes it easier to use multi-core CPUs efficiently. For more details, see :pep:`703`.
pt_br: A partir de Python 3.13, o GIL pode ser desabilitado usando a configuração de construção :option:`--disable-gil`. Depois de construir Python com essa opção, o código deve ser executado com a opção :option:`-X gil=0 <-X>` ou a variável de ambiente :envvar:`PYTHON_GIL=0 <PYTHON_GIL>` deve estar definida. Esse recurso provê um desempenho melhor para aplicações com múltiplas threads e torna mais fácil o uso eficiente de CPUs com múltiplos núcleos. Para mais detalhes, veja :pep:`703`.

source: In prior versions of Python's C API, a function might declare that it requires the GIL to be held in order to use it. This refers to having an :term:`attached thread state`.
pt_br: Em versões anteriores da API C do Python, uma função podia declarar que precisava que a GIL fosse mantida para ser usada. Isso se refere a ter um :term:`estado de thread anexado`.

source: hash-based pyc
pt_br: pyc baseado em hash

source: A bytecode cache file that uses the hash rather than the last-modified time of the corresponding source file to determine its validity. See :ref:`pyc-invalidation`.
pt_br: Um arquivo de cache em bytecode que usa hash ao invés do tempo, no qual o arquivo de código-fonte foi modificado pela última vez, para determinar a sua validade. Veja :ref:`pyc-invalidation`.

source: hashable
pt_br: hasheável

source: An object is *hashable* if it has a hash value which never changes during its lifetime (it needs a :meth:`~object.__hash__` method), and can be compared to other objects (it needs an :meth:`~object.__eq__` method). Hashable objects which compare equal must have the same hash value.
pt_br: Um objeto é *hasheável* se tem um valor de hash que nunca muda durante seu ciclo de vida (precisa ter um método :meth:`~object.__hash__`) e pode ser comparado com outros objetos (precisa ter um método :meth:`~object.__eq__`). Objetos hasheáveis que são comparados como iguais devem ter o mesmo valor de hash.

source: Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
pt_br: A hasheabilidade faz com que um objeto possa ser usado como uma chave de dicionário e como um membro de conjunto, pois estas estruturas de dados utilizam os valores de hash internamente.

source: Most of Python's immutable built-in objects are hashable; mutable containers (such as lists or dictionaries) are not; immutable containers (such as tuples and frozensets) are only hashable if their elements are hashable. Objects which are instances of user-defined classes are hashable by default. They all compare unequal (except with themselves), and their hash value is derived from their :func:`id`.
pt_br: A maioria dos objetos embutidos imutáveis do Python são hasheáveis; contêineres mutáveis (tais como listas ou dicionários) não são; contêineres imutáveis (tais como tuplas e frozensets) são hasheáveis apenas se os seus elementos são hasheáveis. Objetos que são instâncias de classes definidas pelo usuário são hasheáveis por padrão. Todos eles comparam de forma desigual (exceto entre si mesmos), e o seu valor hash é derivado a partir do seu :func:`id`.

source: An Integrated Development and Learning Environment for Python. :ref:`idle` is a basic editor and interpreter environment which ships with the standard distribution of Python.
pt_br: Um ambiente de desenvolvimento e aprendizado integrado para Python. :ref:`idle` é um editor básico e um ambiente interpretador que vem junto com a distribuição padrão do Python.

source: immortal
pt_br: imortal

source: *Immortal objects* are a CPython implementation detail introduced in :pep:`683`.
pt_br: *Objetos imortais* são um detalhe da implementação do CPython introduzida na :pep:`683`.

source: If an object is immortal, its :term:`reference count` is never modified, and therefore it is never deallocated while the interpreter is running. For example, :const:`True` and :const:`None` are immortal in CPython.
pt_br: Se um objeto é imortal, sua :term:`contagem de referências` nunca é modificada e, portanto, nunca é desalocado enquanto o interpretador está em execução. Por exemplo, :const:`True` e :const:`None` são imortais no CPython.

source: Immortal objects can be identified via :func:`sys._is_immortal`, or via :c:func:`PyUnstable_IsImmortal` in the C API.
pt_br: Objetos imortais podem ser identificados via :func:`sys._is_immortal` ou via :c:func:`PyUnstable_IsImmortal` na API C.

source: immutable
pt_br: imutável

source: An object with a fixed value. Immutable objects include numbers, strings and tuples. Such an object cannot be altered. A new object has to be created if a different value has to be stored. They play an important role in places where a constant hash value is needed, for example as a key in a dictionary.
pt_br: Um objeto que possui um valor fixo. Objetos imutáveis incluem números, strings e tuplas. Estes objetos não podem ser alterados. Um novo objeto deve ser criado se um valor diferente tiver de ser armazenado. Objetos imutáveis têm um papel importante em lugares onde um valor constante de hash seja necessário, como por exemplo uma chave em um dicionário.

source: import path
pt_br: caminho de importação

source: A list of locations (or :term:`path entries <path entry>`) that are searched by the :term:`path based finder` for modules to import. During import, this list of locations usually comes from :data:`sys.path`, but for subpackages it may also come from the parent package's ``__path__`` attribute.
pt_br: Uma lista de localizações (ou :term:`entradas de caminho <path entry>`) que são buscadas pelo :term:`localizador baseado no caminho` por módulos para importar. Durante a importação, esta lista de localizações usualmente vem a partir de :data:`sys.path`, mas para subpacotes ela também pode vir do atributo ``__path__`` de pacotes-pai.

source: importing
pt_br: importação

source: The process by which Python code in one module is made available to Python code in another module.
pt_br: O processo pelo qual o código Python em um módulo é disponibilizado para o código Python em outro módulo.

source: importer
pt_br: importador

source: An object that both finds and loads a module; both a :term:`finder` and :term:`loader` object.
pt_br: Um objeto que localiza e carrega um módulo; Tanto um :term:`localizador` e o objeto :term:`carregador`.

source: interactive
pt_br: interativo

source: Python has an interactive interpreter which means you can enter statements and expressions at the interpreter prompt, immediately execute them and see their results. Just launch ``python`` with no arguments (possibly by selecting it from your computer's main menu). It is a very powerful way to test out new ideas or inspect modules and packages (remember ``help(x)``). For more on interactive mode, see :ref:`tut-interac`.
pt_br: Python tem um interpretador interativo, o que significa que você pode digitar instruções e expressões no prompt do interpretador, executá-los imediatamente e ver seus resultados. Apenas execute ``python`` sem argumentos (possivelmente selecionando-o a partir do menu de aplicações de seu sistema operacional). O interpretador interativo é uma maneira poderosa de testar novas ideias ou aprender mais sobre módulos e pacotes (lembre-se do comando ``help(x)``). Para saber mais sobre modo interativo, veja :ref:`tut-interac`.

source: interpreted
pt_br: interpretado

source: Python is an interpreted language, as opposed to a compiled one, though the distinction can be blurry because of the presence of the bytecode compiler. This means that source files can be run directly without explicitly creating an executable which is then run. Interpreted languages typically have a shorter development/debug cycle than compiled ones, though their programs generally also run more slowly. See also :term:`interactive`.
pt_br: Python é uma linguagem interpretada, em oposição àquelas que são compiladas, embora esta distinção possa ser nebulosa devido à presença do compilador de bytecode. Isto significa que os arquivos-fontes podem ser executados diretamente sem necessidade explícita de se criar um arquivo executável. Linguagens interpretadas normalmente têm um ciclo de desenvolvimento/depuração mais curto que as linguagens compiladas, apesar de seus programas geralmente serem executados mais lentamente. Veja também :term:`interativo <interactive>`.

source: interpreter shutdown
pt_br: desligamento do interpretador

source: When asked to shut down, the Python interpreter enters a special phase where it gradually releases all allocated resources, such as modules and various critical internal structures. It also makes several calls to the :term:`garbage collector <garbage collection>`. This can trigger the execution of code in user-defined destructors or weakref callbacks. Code executed during the shutdown phase can encounter various exceptions as the resources it relies on may not function anymore (common examples are library modules or the warnings machinery).
pt_br: Quando solicitado para desligar, o interpretador Python entra em uma fase especial, onde ele gradualmente libera todos os recursos alocados, tais como módulos e várias estruturas internas críticas. Ele também faz diversas chamadas para o :term:`coletor de lixo <garbage collection>`. Isto pode disparar a execução de código em destrutores definidos pelo usuário ou função de retorno de referência fraca. Código executado durante a fase de desligamento pode encontrar diversas exceções, pois os recursos que ele depende podem não funcionar mais (exemplos comuns são os módulos de bibliotecas, ou os mecanismos de avisos).

source: The main reason for interpreter shutdown is that the ``__main__`` module or the script being run has finished executing.
pt_br: A principal razão para o interpretador desligar, é que o módulo ``__main__`` ou o script sendo executado terminou sua execução.

source: iterable
pt_br: iterável

source: An object capable of returning its members one at a time. Examples of iterables include all sequence types (such as :class:`list`, :class:`str`, and :class:`tuple`) and some non-sequence types like :class:`dict`, :term:`file objects <file object>`, and objects of any classes you define with an :meth:`~object.__iter__` method or with a :meth:`~object.__getitem__` method that implements :term:`sequence` semantics.
pt_br: Um objeto capaz de retornar seus membros um de cada vez. Exemplos de iteráveis incluem todos os tipos de sequência (tais como :class:`list`, :class:`str` e :class:`tuple`) e alguns tipos de não-sequência, como o :class:`dict` e :term:`objetos arquivo <file object>`, além dos objetos de quaisquer classes que você definir com um método :meth:`~object.__iter__` ou :meth:`~object.__getitem__` que implementam a semântica de :term:`sequência`.
