Repository: python/python-docs-pt-br
Catalog: glossary.po
Languages: pt_br

source: Iterables can be used in a :keyword:`for` loop and in many other places where a sequence is needed (:func:`zip`, :func:`map`, ...). When an iterable object is passed as an argument to the built-in function :func:`iter`, it returns an iterator for the object. This iterator is good for one pass over the set of values. When using iterables, it is usually not necessary to call :func:`iter` or deal with iterator objects yourself. The :keyword:`for` statement does that automatically for you, creating a temporary unnamed variable to hold the iterator for the duration of the loop. See also :term:`iterator`, :term:`sequence`, and :term:`generator`.
pt_br: Iteráveis podem ser usados em um laço :keyword:`for` e em vários outros lugares em que uma sequência é necessária (:func:`zip`, :func:`map`, ...). Quando um objeto iterável é passado como argumento para a função embutida :func:`iter`, ela retorna um iterador para o objeto. Este iterador é adequado para se varrer todo o conjunto de valores. Ao usar iteráveis, normalmente não é necessário chamar :func:`iter` ou lidar com os objetos iteradores em si. A instrução :keyword:`for` faz isso automaticamente para você, criando uma variável temporária para armazenar o iterador durante a execução do laço. Veja também :term:`iterador`, :term:`sequência`, e :term:`gerador`.

source: iterator
pt_br: iterador

source: An object representing a stream of data. Repeated calls to the iterator's :meth:`~iterator.__next__` method (or passing it to the built-in function :func:`next`) return successive items in the stream. When no more data are available a :exc:`StopIteration` exception is raised instead. At this point, the iterator object is exhausted and any further calls to its :meth:`!__next__` method just raise :exc:`StopIteration` again. Iterators are required to have an :meth:`~iterator.__iter__` method that returns the iterator object itself so every iterator is also iterable and may be used in most places where other iterables are accepted. One notable exception is code which attempts multiple iteration passes. A container object (such as a :class:`list`) produces a fresh new iterator each time you pass it to the :func:`iter` function or use it in a :keyword:`for` loop. Attempting this with an iterator will just return the same exhausted iterator object used in the previous iteration pass, making it appear like an empty container.
pt_br: Um objeto que representa um fluxo de dados. Repetidas chamadas ao método :meth:`~iterator.__next__` de um iterador (ou passando o objeto para a função embutida :func:`next`) vão retornar itens sucessivos do fluxo. Quando não houver mais dados disponíveis uma exceção :exc:`StopIteration` será levantada. Neste ponto, o objeto iterador se esgotou e quaisquer chamadas subsequentes a seu método :meth:`!__next__` vão apenas levantar a exceção :exc:`StopIteration` novamente. Iteradores precisam ter um método :meth:`~iterator.__iter__` que retorne o objeto iterador em si, de forma que todo iterador também é iterável e pode ser usado na maioria dos lugares em que um iterável é requerido. Uma notável exceção é código que tenta realizar passagens em múltiplas iterações. Um objeto contêiner (como uma :class:`list`) produz um novo iterador a cada vez que você passá-lo para a função :func:`iter` ou utilizá-lo em um laço :keyword:`for`. Tentar isso com o mesmo iterador apenas iria retornar o mesmo objeto iterador esgotado já utilizado na iteração anterior, como se fosse um contêiner vazio.

source: More information can be found in :ref:`typeiter`.
pt_br: Mais informações podem ser encontradas em :ref:`typeiter`.

source: CPython does not consistently apply the requirement that an iterator define :meth:`~iterator.__iter__`. And also please note that the free-threading CPython does not guarantee the thread-safety of iterator operations.
pt_br: O CPython não aplica consistentemente o requisito de que um iterador defina :meth:`~iterator.__iter__`. E também observe que o CPython com threads livres não garante a segurança do thread das operações do iterador.

source: key function
pt_br: função chave

source: A key function or collation function is a callable that returns a value used for sorting or ordering. For example, :func:`locale.strxfrm` is used to produce a sort key that is aware of locale specific sort conventions.
pt_br: Uma função chave ou função colação é um chamável que retorna um valor usado para ordenação ou classificação. Por exemplo, :func:`locale.strxfrm` é usada para produzir uma chave de ordenação que leva o locale em consideração para fins de ordenação.

source: A number of tools in Python accept key functions to control how elements are ordered or grouped. They include :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest`, and :func:`itertools.groupby`.
pt_br: Uma porção de ferramentas no Python aceitam funções chave para controlar como os elementos são ordenados ou agrupados. Algumas delas incluem :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest` e :func:`itertools.groupby`.

source: There are several ways to create a key function. For example. the :meth:`str.lower` method can serve as a key function for case insensitive sorts. Alternatively, a key function can be built from a :keyword:`lambda` expression such as ``lambda r: (r[0], r[2])``. Also, :func:`operator.attrgetter`, :func:`operator.itemgetter`, and :func:`operator.methodcaller` are three key function constructors. See the :ref:`Sorting HOW TO <sortinghowto>` for examples of how to create and use key functions.
pt_br: Há várias maneiras de se criar funções chave. Por exemplo, o método :meth:`str.lower` pode servir como uma função chave para ordenações insensíveis à caixa. Alternativamente, uma função chave ad-hoc pode ser construída a partir de uma expressão :keyword:`lambda`, como ``lambda r: (r[0], r[2])``. Além disso, :func:`operator.attrgetter`, :func:`operator.itemgetter` e :func:`operator.methodcaller` são três construtores de função chave. Consulte o guia de :ref:`Ordenação <sortinghowto>` para ver exemplos de como criar e utilizar funções chave.

source: keyword argument
pt_br: argumento nomeado

source: See :term:`argument`.
pt_br: Veja :term:`argumento`.

source: An anonymous inline function consisting of a single :term:`expression` which is evaluated when the function is called. The syntax to create a lambda function is ``lambda [parameters]: expression``
pt_br: Uma função de linha anônima consistindo de uma única :term:`expressão`, que é avaliada quando a função é chamada. A sintaxe para criar uma função lambda é ``lambda [parameters]: expression``

source: Look before you leap. This coding style explicitly tests for pre-conditions before making calls or lookups. This style contrasts with the :term:`EAFP` approach and is characterized by the presence of many :keyword:`if` statements.
pt_br: Iniciais da expressão em inglês "look before you leap", que significa algo como "olhe antes de pisar". Este estilo de codificação testa as pré-condições explicitamente antes de fazer chamadas ou buscas. Este estilo contrasta com a abordagem :term:`EAFP` e é caracterizada pela presença de muitas instruções :keyword:`if`.

source: In a multi-threaded environment, the LBYL approach can risk introducing a race condition between "the looking" and "the leaping". For example, the code, ``if key in mapping: return mapping[key]`` can fail if another thread removes *key* from *mapping* after the test, but before the lookup. This issue can be solved with locks or by using the EAFP approach.
pt_br: Em um ambiente multithread, a abordagem LBYL pode arriscar a introdução de uma condição de corrida entre "o olhar" e "o pisar". Por exemplo, o código ``if key in mapping: return mapping[key]`` pode falhar se outra thread remover *key* do *mapping* após o teste, mas antes da olhada. Esse problema pode ser resolvido com travas ou usando a abordagem EAFP.

source: lexical analyzer
pt_br: analisador léxico

source: Formal name for the *tokenizer*; see :term:`token`.
pt_br: Nome formal para o *tokenizador*; veja :term:`token`.

source: list
pt_br: lista

source: A built-in Python :term:`sequence`. Despite its name it is more akin to an array in other languages than to a linked list since access to elements is *O*\ (1).
pt_br: Uma :term:`sequência` embutida no Python. Apesar do seu nome, é mais próximo de um vetor em outras linguagens do que uma lista encadeada, como o acesso aos elementos é da ordem *O*\ (1).

source: list comprehension
pt_br: compreensão de lista

source: A compact way to process all or part of the elements in a sequence and return a list with the results. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` generates a list of strings containing even hex numbers (0x..) in the range from 0 to 255. The :keyword:`if` clause is optional. If omitted, all elements in ``range(256)`` are processed.
pt_br: Uma maneira compacta de processar todos ou parte dos elementos de uma sequência e retornar os resultados em uma lista. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` gera uma lista de strings contendo números hexadecimais (0x..) no intervalo de 0 a 255. A cláusula :keyword:`if` é opcional. Se omitida, todos os elementos no ``range(256)`` serão processados.

source: loader
pt_br: carregador

source: An object that loads a module. It must define the :meth:`!exec_module` and :meth:`!create_module` methods to implement the :class:`~importlib.abc.Loader` interface. A loader is typically returned by a :term:`finder`. See also:
pt_br: Um objeto que carrega um módulo. Ele deve definir os métodos :meth:`!exec_module` e :meth:`!create_module` para implementar a interface :class:`~importlib.abc.Loader`. Um carregador é normalmente retornado por um :term:`localizador`. Veja também:

source: locale encoding
pt_br: codificação da localidade

source: On Unix, it is the encoding of the LC_CTYPE locale. It can be set with :func:`locale.setlocale(locale.LC_CTYPE, new_locale) <locale.setlocale>`.
pt_br: No Unix, é a codificação da localidade do LC_CTYPE, que pode ser definida com :func:`locale.setlocale(locale.LC_CTYPE, new_locale) <locale.setlocale>`.

source: On Windows, it is the ANSI code page (ex: ``"cp1252"``).
pt_br: No Windows, é a página de código ANSI (ex: ``"cp1252"``).

source: On Android and VxWorks, Python uses ``"utf-8"`` as the locale encoding.
pt_br: No Android e no VxWorks, o Python usa ``"utf-8"`` como a codificação da localidade.

source: :func:`locale.getencoding` can be used to get the locale encoding.
pt_br: :func:`locale.getencoding` pode ser usado para obter a codificação da localidade.

source: See also the :term:`filesystem encoding and error handler`.
pt_br: Veja também :term:`tratador de erros e codificação do sistema de arquivos`.

source: magic method
pt_br: método mágico

source: An informal synonym for :term:`special method`.
pt_br: Um sinônimo informal para um :term:`método especial`.

source: mapping
pt_br: mapeamento

source: A container object that supports arbitrary key lookups and implements the methods specified in the :class:`collections.abc.Mapping` or :class:`collections.abc.MutableMapping` :ref:`abstract base classes <collections-abstract-base-classes>`. Examples include :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` and :class:`collections.Counter`.
pt_br: Um objeto contêiner com suporte a pesquisas de chave arbitrária e que implementa os métodos especificados nas :ref:`classes base abstratas <collections-abstract-base-classes>` :class:`collections.abc.Mapping` ou :class:`collections.abc.MutableMapping`. Exemplos incluem :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` e :class:`collections.Counter`.

source: meta path finder
pt_br: localizador de metacaminho

source: A :term:`finder` returned by a search of :data:`sys.meta_path`. Meta path finders are related to, but different from :term:`path entry finders <path entry finder>`.
pt_br: Um :term:`localizador` retornado por uma busca de :data:`sys.meta_path`. Localizadores de metacaminho são relacionados a, mas diferentes de, :term:`localizadores de entrada de caminho <path entry finder>`.

source: See :class:`importlib.abc.MetaPathFinder` for the methods that meta path finders implement.
pt_br: Veja :class:`importlib.abc.MetaPathFinder` para os métodos que localizadores de metacaminho implementam.

source: metaclass
pt_br: metaclasse

source: The class of a class. Class definitions create a class name, a class dictionary, and a list of base classes. The metaclass is responsible for taking those three arguments and creating the class. Most object oriented programming languages provide a default implementation. What makes Python special is that it is possible to create custom metaclasses. Most users never need this tool, but when the need arises, metaclasses can provide powerful, elegant solutions. They have been used for logging attribute access, adding thread-safety, tracking object creation, implementing singletons, and many other tasks.
pt_br: A classe de uma classe. Definições de classe criam um nome de classe, um dicionário de classe e uma lista de classes base. A metaclasse é responsável por receber estes três argumentos e criar a classe. A maioria das linguagens de programação orientadas a objetos provê uma implementação default. O que torna o Python especial é o fato de ser possível criar metaclasses personalizadas. A maioria dos usuários nunca vai precisar deste recurso, mas quando houver necessidade, metaclasses possibilitam soluções poderosas e elegantes. Metaclasses têm sido utilizadas para gerar registros de acesso a atributos, para incluir proteção contra acesso concorrente, rastrear a criação de objetos, implementar singletons, dentre muitas outras tarefas.

source: More information can be found in :ref:`metaclasses`.
pt_br: Mais informações podem ser encontradas em :ref:`metaclasses`.

source: method
pt_br: método

source: A function which is defined inside a class body. If called as an attribute of an instance of that class, the method will get the instance object as its first :term:`argument` (which is usually called ``self``). See :term:`function` and :term:`nested scope`.
pt_br: Uma função que é definida dentro do corpo de uma classe. Se chamada como um atributo de uma instância daquela classe, o método receberá a instância do objeto como seu primeiro :term:`argumento` (que comumente é chamado de ``self``). Veja :term:`função` e :term:`escopo aninhado`.

source: method resolution order
pt_br: ordem de resolução de métodos

source: Method Resolution Order is the order in which base classes are searched for a member during lookup. See :ref:`python_2.3_mro` for details of the algorithm used by the Python interpreter since the 2.3 release.
pt_br: Ordem de resolução de métodos é a ordem em que os membros de uma classe base são buscados durante a pesquisa. Veja :ref:`python_2.3_mro` para detalhes do algoritmo usado pelo interpretador do Python desde a versão 2.3.

source: module
pt_br: módulo

source: An object that serves as an organizational unit of Python code. Modules have a namespace containing arbitrary Python objects. Modules are loaded into Python by the process of :term:`importing`.
pt_br: Um objeto que serve como uma unidade organizacional de código Python. Os módulos têm um espaço de nomes contendo objetos Python arbitrários. Os módulos são carregados pelo Python através do processo de :term:`importação<importing>`.

source: See also :term:`package`.
pt_br: Veja também :term:`pacote<package>`.

source: module spec
pt_br: spec de módulo

source: A namespace containing the import-related information used to load a module. An instance of :class:`importlib.machinery.ModuleSpec`.
pt_br: Um espaço de nomes que contém as informações relacionadas à importação usadas para carregar um módulo. Uma instância de :class:`importlib.machinery.ModuleSpec`.

source: See also :ref:`module-specs`.
pt_br: Veja também :ref:`module-specs`.

source: See :term:`method resolution order`.
pt_br: Veja :term:`ordem de resolução de métodos`.

source: mutable
pt_br: mutável

source: Mutable objects can change their value but keep their :func:`id`. See also :term:`immutable`.
pt_br: Objeto mutável é aquele que pode modificar seus valor mas manter seu :func:`id`. Veja também :term:`imutável`.

source: named tuple
pt_br: tupla nomeada

source: The term "named tuple" applies to any type or class that inherits from tuple and whose indexable elements are also accessible using named attributes. The type or class may have other features as well.
pt_br: O termo "tupla nomeada" é aplicado a qualquer tipo ou classe que herda de tupla e cujos elementos indexáveis também são acessíveis usando atributos nomeados. O tipo ou classe pode ter outras funcionalidades também.

source: Several built-in types are named tuples, including the values returned by :func:`time.localtime` and :func:`os.stat`. Another example is :data:`sys.float_info`::
pt_br: Diversos tipos embutidos são tuplas nomeadas, incluindo os valores retornados por :func:`time.localtime` e :func:`os.stat`. Outro exemplo é :data:`sys.float_info`::

source: >>> sys.float_info[1] # indexed access 1024 >>> sys.float_info.max_exp # named field access 1024 >>> isinstance(sys.float_info, tuple) # kind of tuple True
pt_br: >>> sys.float_info[1] # acesso indexado 1024 >>> sys.float_info.max_exp # acesso a campo nomeado 1024 >>> isinstance(sys.float_info, tuple) # tipo de tupla True

source: Some named tuples are built-in types (such as the above examples). Alternatively, a named tuple can be created from a regular class definition that inherits from :class:`tuple` and that defines named fields. Such a class can be written by hand, or it can be created by inheriting :class:`typing.NamedTuple`, or with the factory function :func:`collections.namedtuple`. The latter techniques also add some extra methods that may not be found in hand-written or built-in named tuples.
pt_br: Algumas tuplas nomeadas são tipos embutidos (tal como os exemplos acima). Alternativamente, uma tupla nomeada pode ser criada a partir de uma definição de classe regular, que herde de :class:`tuple` e que defina campos nomeados. Tal classe pode ser escrita a mão, ou ela pode ser criada herdando :class:`typing.NamedTuple` ou com uma função fábrica :func:`collections.namedtuple`. As duas últimas técnicas também adicionam alguns métodos extras, que podem não ser encontrados quando foi escrita manualmente, ou em tuplas nomeadas embutidas.

source: namespace
pt_br: espaço de nomes

source: The place where a variable is stored. Namespaces are implemented as dictionaries. There are the local, global and built-in namespaces as well as nested namespaces in objects (in methods). Namespaces support modularity by preventing naming conflicts. For instance, the functions :func:`builtins.open <.open>` and :func:`os.open` are distinguished by their namespaces. Namespaces also aid readability and maintainability by making it clear which module implements a function. For instance, writing :func:`random.seed` or :func:`itertools.islice` makes it clear that those functions are implemented by the :mod:`random` and :mod:`itertools` modules, respectively.
pt_br: O lugar em que uma variável é armazenada. Espaços de nomes são implementados como dicionários. Existem os espaços de nomes local, global e nativo, bem como espaços de nomes aninhados em objetos (em métodos). Espaços de nomes suportam modularidade ao prevenir conflitos de nomes. Por exemplo, as funções :func:`__builtin__.open` e :func:`os.open` são diferenciadas por seus espaços de nomes. Espaços de nomes também auxiliam na legibilidade e na manutenibilidade ao torar mais claro quais módulos implementam uma função. Escrever :func:`random.seed` ou :func:`itertools.izip`, por exemplo, deixa claro que estas funções são implementadas pelos módulos :mod:`random` e :mod:`itertools` respectivamente.

source: namespace package
pt_br: pacote de espaço de nomes

source: A :term:`package` which serves only as a container for subpackages. Namespace packages may have no physical representation, and specifically are not like a :term:`regular package` because they have no ``__init__.py`` file.
pt_br: Um :term:`pacote` que serve apenas como contêiner para subpacotes. Pacotes de espaços de nomes podem não ter representação física, e especificamente não são como um :term:`pacote regular` porque eles não tem um arquivo ``__init__.py``.

source: Namespace packages allow several individually installable packages to have a common parent package. Otherwise, it is recommended to use a :term:`regular package`.
pt_br: Pacotes de espaço de nomes permitem que vários pacotes instaláveis individualmente tenham um pacote pai comum. Caso contrário, é recomendado usar um :term:`pacote regular`.

source: For more information, see :pep:`420` and :ref:`reference-namespace-package`.
pt_br: Para mais informações, veja :pep:`420` e :ref:`reference-namespace-package`.

source: See also :term:`module`.
pt_br: Veja também :term:`módulo`.

source: nested scope
pt_br: escopo aninhado

source: The ability to refer to a variable in an enclosing definition. For instance, a function defined inside another function can refer to variables in the outer function. Note that nested scopes by default work only for reference and not for assignment. Local variables both read and write in the innermost scope. Likewise, global variables read and write to the global namespace. The :keyword:`nonlocal` allows writing to outer scopes.
pt_br: A habilidade de referir-se a uma variável em uma definição de fechamento. Por exemplo, uma função definida dentro de outra pode referenciar variáveis da função externa. Perceba que escopos aninhados por padrão funcionam apenas por referência e não por atribuição. Variáveis locais podem ler e escrever no escopo mais interno. De forma similar, variáveis globais podem ler e escrever para o espaço de nomes global. O :keyword:`nonlocal` permite escrita para escopos externos.

source: new-style class
pt_br: classe estilo novo

source: Old name for the flavor of classes now used for all class objects. In earlier Python versions, only new-style classes could use Python's newer, versatile features like :attr:`~object.__slots__`, descriptors, properties, :meth:`~object.__getattribute__`, class methods, and static methods.
pt_br: Antigo nome para o tipo de classes agora usado para todos os objetos de classes. Em versões anteriores do Python, apenas classes estilo novo podiam usar recursos novos e versáteis do Python, tais como :attr:`~object.__slots__`, descritores, propriedades, :meth:`~object.__getattribute__`, métodos de classe e métodos estáticos.

source: object
pt_br: objeto

source: Any data with state (attributes or value) and defined behavior (methods). Also the ultimate base class of any :term:`new-style class`.
pt_br: Qualquer dado que tenha estado (atributos ou valores) e comportamento definidos (métodos). Também a última classe base de qualquer :term:`classe estilo novo`.

source: optimized scope
pt_br: escopo otimizado
