Repository: python/python-docs-pt-br
Catalog: glossary.po
Languages: pt_br

source: A scope where target local variable names are reliably known to the compiler when the code is compiled, allowing optimization of read and write access to these names. The local namespaces for functions, generators, coroutines, comprehensions, and generator expressions are optimized in this fashion. Note: most interpreter optimizations are applied to all scopes, only those relying on a known set of local and nonlocal variable names are restricted to optimized scopes.
pt_br: Um escopo no qual os nomes das variáveis locais de destino são conhecidos de forma confiável pelo compilador quando o código é compilado, permitindo a otimização do acesso de leitura e gravação a esses nomes. Os espaços de nomes locais para funções, geradores, corrotinas, compreensões e expressões geradoras são otimizados desta forma. Nota: a maioria das otimizações de interpretador são aplicadas a todos os escopos, apenas aquelas que dependem de um conjunto conhecido de nomes de variáveis locais e não locais são restritas a escopos otimizados.

source: optional module
pt_br: módulo opcional

source: An :term:`extension module` that is part of the :term:`standard library`, but may be absent in some builds of :term:`CPython`, usually due to missing third-party libraries or because the module is not available for a given platform.
pt_br: Um :term:`módulo de extensão` que faz parte da :term:`biblioteca padrão`, mas pode estar ausente em algumas versões do :term:`CPython`, geralmente devido à falta de bibliotecas de terceiros ou porque o módulo não está disponível para uma determinada plataforma.

source: See :ref:`optional-module-requirements` for a list of optional modules that require third-party libraries.
pt_br: Consulte :ref:`optional-module-requirements` para obter uma lista de módulos opcionais que exigem bibliotecas de terceiros.

source: package
pt_br: pacote

source: A Python :term:`module` which can contain submodules or recursively, subpackages. Technically, a package is a Python module with a ``__path__`` attribute.
pt_br: Um :term:`módulo` Python é capaz de conter submódulos ou recursivamente, subpacotes. Tecnicamente, um pacote é um módulo Python com um atributo ``__path__``.

source: See also :term:`regular package` and :term:`namespace package`.
pt_br: Veja também :term:`pacote regular` e :term:`pacote de espaço de nomes`.

source: parameter
pt_br: parâmetro

source: A named entity in a :term:`function` (or method) definition that specifies an :term:`argument` (or in some cases, arguments) that the function can accept. There are five kinds of parameter:
pt_br: Uma entidade nomeada na definição de uma :term:`função<function>` (ou método) que específica um :term:`argumento<argument>` (ou em alguns casos, argumentos) que a função pode receber. Existem cinco tipos de parâmetros:

source: :dfn:`positional-or-keyword`: specifies an argument that can be passed either :term:`positionally <argument>` or as a :term:`keyword argument <argument>`. This is the default kind of parameter, for example *foo* and *bar* in the following::
pt_br: :dfn:`posicional-ou-nomeado`: especifica um argumento que pode ser tanto :term:`posicional <argument>` quanto :term:`nomeado <argument>`. Esse é o tipo padrão de parâmetro, por exemplo *foo* e *bar* a seguir::

source: :dfn:`positional-only`: specifies an argument that can be supplied only by position. Positional-only parameters can be defined by including a ``/`` character in the parameter list of the function definition after them, for example *posonly1* and *posonly2* in the following::
pt_br: :dfn:`somente-posicional`: especifica um argumento que pode ser fornecido apenas por posição. Parâmetros somente-posicionais podem ser definidos incluindo o caractere ``/`` na lista de parâmetros da definição da função após eles, por exemplo *somentepos1* e *somentepos2* a seguir::

source: def func(posonly1, posonly2, /, positional_or_keyword): ...
pt_br: def func(somentepos1, somentepos2, /, posicional_ou_nomeado): ...

source: :dfn:`keyword-only`: specifies an argument that can be supplied only by keyword. Keyword-only parameters can be defined by including a single var-positional parameter or bare ``*`` in the parameter list of the function definition before them, for example *kw_only1* and *kw_only2* in the following::
pt_br: :dfn:`somente-nomeado`: especifica um argumento que pode ser passado para a função somente por nome. Parâmetros somente-nomeados podem ser definidos com um simples parâmetro var-posicional ou um ``*`` antes deles na lista de parâmetros na definição da função, por exemplo *somente_nom1* and *somente_nom2* a seguir::

source: def func(arg, *, kw_only1, kw_only2): ...
pt_br: def func(arg, *, somente_nom1, somente_nom2): ...

source: :dfn:`var-positional`: specifies that an arbitrary sequence of positional arguments can be provided (in addition to any positional arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``*``, for example *args* in the following::
pt_br: :dfn:`var-posicional`: especifica que uma sequência arbitrária de argumentos posicionais pode ser fornecida (em adição a qualquer argumento posicional já aceito por outros parâmetros). Tal parâmetro pode ser definido colocando um ``*`` antes do nome do parâmetro, por exemplo *args* a seguir::

source: :dfn:`var-keyword`: specifies that arbitrarily many keyword arguments can be provided (in addition to any keyword arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``**``, for example *kwargs* in the example above.
pt_br: :dfn:`var-nomeado`: especifica que, arbitrariamente, muitos argumentos nomeados podem ser fornecidos (em adição a qualquer argumento nomeado já aceito por outros parâmetros). Tal parâmetro pode ser definido colocando-se ``**`` antes do nome, por exemplo, *kwargs* no exemplo acima.

source: Parameters can specify both optional and required arguments, as well as default values for some optional arguments.
pt_br: Parâmetros podem especificar tanto argumentos opcionais quanto obrigatórios, assim como valores padrão para alguns argumentos opcionais.

source: See also the :term:`argument` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, the :class:`inspect.Parameter` class, the :ref:`function` section, and :pep:`362`.
pt_br: Veja também o termo :term:`argumento` no glossário, a pergunta do FAQ sobre :ref:`a diferença entre argumentos e parâmetros <faq-argument-vs-parameter>`, a classe :class:`inspect.Parameter`, a seção :ref:`function` e a :pep:`362`.

source: path entry
pt_br: entrada de caminho

source: A single location on the :term:`import path` which the :term:`path based finder` consults to find modules for importing.
pt_br: Um local único no :term:`caminho de importação` que o :term:`localizador baseado no caminho` consulta para encontrar módulos a serem importados.

source: path entry finder
pt_br: localizador de entrada de caminho

source: A :term:`finder` returned by a callable on :data:`sys.path_hooks` (i.e. a :term:`path entry hook`) which knows how to locate modules given a :term:`path entry`.
pt_br: Um :term:`localizador` retornado por um chamável em :data:`sys.path_hooks` (ou seja, um :term:`gancho de entrada de caminho`) que sabe como localizar os módulos :term:`entrada de caminho`.

source: See :class:`importlib.abc.PathEntryFinder` for the methods that path entry finders implement.
pt_br: Veja :class:`importlib.abc.PathEntryFinder` para os métodos que localizadores de entrada de caminho implementam.

source: path entry hook
pt_br: gancho de entrada de caminho

source: A callable on the :data:`sys.path_hooks` list which returns a :term:`path entry finder` if it knows how to find modules on a specific :term:`path entry`.
pt_br: Um chamável na lista :data:`sys.path_hooks` que retorna um :term:`localizador de entrada de caminho` caso saiba como localizar módulos em uma :term:`entrada de caminho` específica.

source: path based finder
pt_br: localizador baseado no caminho

source: One of the default :term:`meta path finders <meta path finder>` which searches an :term:`import path` for modules.
pt_br: Um dos :term:`localizadores de metacaminho <meta path finder>` padrão que procura por um :term:`caminho de importação` de módulos.

source: path-like object
pt_br: objeto caminho ou similar

source: An object representing a file system path. A path-like object is either a :class:`str` or :class:`bytes` object representing a path, or an object implementing the :class:`os.PathLike` protocol. An object that supports the :class:`os.PathLike` protocol can be converted to a :class:`str` or :class:`bytes` file system path by calling the :func:`os.fspath` function; :func:`os.fsdecode` and :func:`os.fsencode` can be used to guarantee a :class:`str` or :class:`bytes` result instead, respectively. Introduced by :pep:`519`.
pt_br: Um objeto representando um caminho de sistema de arquivos. Um objeto caminho ou similar é ou um objeto :class:`str` ou :class:`bytes` representando um caminho, ou um objeto implementando o protocolo :class:`os.PathLike`. Um objeto que suporta o protocolo :class:`os.PathLike` pode ser convertido para um arquivo de caminho do sistema :class:`str` ou :class:`bytes`, através da chamada da função :func:`os.fspath`; :func:`os.fsdecode` e :func:`os.fsencode` podem ser usadas para garantir um :class:`str` ou :class:`bytes` como resultado, respectivamente. Introduzido na :pep:`519`.

source: Python Enhancement Proposal. A PEP is a design document providing information to the Python community, or describing a new feature for Python or its processes or environment. PEPs should provide a concise technical specification and a rationale for proposed features.
pt_br: Proposta de melhoria do Python. Uma PEP é um documento de design que fornece informação para a comunidade Python, ou descreve uma nova funcionalidade para o Python ou seus predecessores ou ambientes. PEPs devem prover uma especificação técnica concisa e um racional para funcionalidades propostas.

source: PEPs are intended to be the primary mechanisms for proposing major new features, for collecting community input on an issue, and for documenting the design decisions that have gone into Python. The PEP author is responsible for building consensus within the community and documenting dissenting opinions.
pt_br: PEPs têm a intenção de ser os mecanismos primários para propor novas funcionalidades significativas, para coletar opiniões da comunidade sobre um problema, e para documentar as decisões de design que foram adicionadas ao Python. O autor da PEP é responsável por construir um consenso dentro da comunidade e documentar opiniões dissidentes.

source: See :pep:`1`.
pt_br: Veja :pep:`1`.

source: portion
pt_br: porção

source: A set of files in a single directory (possibly stored in a zip file) that contribute to a namespace package, as defined in :pep:`420`.
pt_br: Um conjunto de arquivos em um único diretório (possivelmente armazenado em um arquivo zip) que contribuem para um pacote de espaço de nomes, conforme definido em :pep:`420`.

source: positional argument
pt_br: argumento posicional

source: provisional API
pt_br: API provisória

source: A provisional API is one which has been deliberately excluded from the standard library's backwards compatibility guarantees. While major changes to such interfaces are not expected, as long as they are marked provisional, backwards incompatible changes (up to and including removal of the interface) may occur if deemed necessary by core developers. Such changes will not be made gratuitously -- they will occur only if serious fundamental flaws are uncovered that were missed prior to the inclusion of the API.
pt_br: Uma API provisória é uma API que foi deliberadamente excluída das bibliotecas padrões com compatibilidade retroativa garantida. Enquanto mudanças maiores para tais interfaces não são esperadas, contanto que elas sejam marcadas como provisórias, mudanças retroativas incompatíveis (até e incluindo a remoção da interface) podem ocorrer se consideradas necessárias pelos desenvolvedores principais. Tais mudanças não serão feitas gratuitamente -- elas irão ocorrer apenas se sérias falhas fundamentais forem descobertas, que foram esquecidas anteriormente a inclusão da API.

source: Even for provisional APIs, backwards incompatible changes are seen as a "solution of last resort" - every attempt will still be made to find a backwards compatible resolution to any identified problems.
pt_br: Mesmo para APIs provisórias, mudanças retroativas incompatíveis são vistas como uma "solução em último caso" - cada tentativa ainda será feita para encontrar uma resolução retroativa compatível para quaisquer problemas encontrados.

source: This process allows the standard library to continue to evolve over time, without locking in problematic design errors for extended periods of time. See :pep:`411` for more details.
pt_br: Esse processo permite que a biblioteca padrão continue a evoluir com o passar do tempo, sem se prender em erros de design problemáticos por períodos de tempo prolongados. Veja :pep:`411` para mais detalhes.

source: provisional package
pt_br: pacote provisório

source: See :term:`provisional API`.
pt_br: Veja :term:`API provisória`.

source: Nickname for the Python 3.x release line (coined long ago when the release of version 3 was something in the distant future.) This is also abbreviated "Py3k".
pt_br: Apelido para a linha de lançamento da versão do Python 3.x (cunhada há muito tempo, quando o lançamento da versão 3 era algo em um futuro muito distante.) Esse termo possui a seguinte abreviação: "Py3k".

source: Pythonic
pt_br: Pythônico

source: An idea or piece of code which closely follows the most common idioms of the Python language, rather than implementing code using concepts common to other languages. For example, a common idiom in Python is to loop over all elements of an iterable using a :keyword:`for` statement. Many other languages don't have this type of construct, so people unfamiliar with Python sometimes use a numerical counter instead::
pt_br: Uma ideia ou um pedaço de código que segue de perto as formas de escritas mais comuns da linguagem Python, ao invés de implementar códigos usando conceitos comuns a outras linguagens. Por exemplo, um formato comum em Python é fazer um laço sobre todos os elementos de uma iterável usando a instrução :keyword:`for`. Muitas outras linguagens não têm esse tipo de construção, então as pessoas que não estão familiarizadas com o Python usam um contador numérico::

source: for i in range(len(food)): print(food[i])
pt_br: for i in range(len(comida)): print(comida[i])

source: As opposed to the cleaner, Pythonic method::
pt_br: Ao contrário do método mais limpo, Pythônico::

source: for piece in food: print(piece)
pt_br: for parte in comida: print(parte)

source: qualified name
pt_br: nome qualificado

source: A dotted name showing the "path" from a module's global scope to a class, function or method defined in that module, as defined in :pep:`3155`. For top-level functions and classes, the qualified name is the same as the object's name::
pt_br: Um nome pontilhado (quando 2 termos são ligados por um ponto) que mostra o "path" do escopo global de um módulo para uma classe, função ou método definido num determinado módulo, conforme definido pela :pep:`3155`. Para funções e classes de nível superior, o nome qualificado é o mesmo que o nome do objeto::

source: >>> class C: ... class D: ... def meth(self): ... pass ... >>> C.__qualname__ 'C' >>> C.D.__qualname__ 'C.D' >>> C.D.meth.__qualname__ 'C.D.meth'
pt_br: >>> class C: ... class D: ... def metodo(self): ... pass ... >>> C.__qualname__ 'C' >>> C.D.__qualname__ 'C.D' >>> C.D.metodo.__qualname__ 'C.D.metodo'

source: When used to refer to modules, the *fully qualified name* means the entire dotted path to the module, including any parent packages, e.g. ``email.mime.text``::
pt_br: Quando usado para se referir a módulos, o *nome totalmente qualificado* significa todo o caminho pontilhado para o módulo, incluindo quaisquer pacotes pai, por exemplo: ``email.mime.text``::

source: reference count
pt_br: contagem de referências

source: The number of references to an object. When the reference count of an object drops to zero, it is deallocated. Some objects are :term:`immortal` and have reference counts that are never modified, and therefore the objects are never deallocated. Reference counting is generally not visible to Python code, but it is a key element of the :term:`CPython` implementation. Programmers can call the :func:`sys.getrefcount` function to return the reference count for a particular object.
pt_br: O número de referências a um objeto. Quando a contagem de referências de um objeto cai para zero, ele é desalocado. Alguns objetos são :term:`imortais<immortal>` e têm contagens de referências que nunca são modificadas e, portanto, os objetos nunca são desalocados. A contagem de referências geralmente não é visível para o código Python, mas é um elemento-chave da implementação do :term:`CPython`. Os programadores podem chamar a função :func:`sys.getrefcount` para retornar a contagem de referências para um objeto específico.

source: In :term:`CPython`, reference counts are not considered to be stable or well-defined values; the number of references to an object, and how that number is affected by Python code, may be different between versions.
pt_br: Em :term:`CPython`, as contagens de referências não são consideradas valores estáveis ou bem definidos; o número de referências a um objeto e como esse número é afetado pelo código Python pode ser diferente entre as versões.

source: regular package
pt_br: pacote regular

source: A traditional :term:`package`, such as a directory containing an ``__init__.py`` file.
pt_br: Um :term:`pacote` tradicional, como um diretório contendo um arquivo ``__init__.py``.

source: See also :term:`namespace package`.
pt_br: Veja também :term:`pacote de espaço de nomes`.

source: An acronym for the "read–eval–print loop", another name for the :term:`interactive` interpreter shell.
pt_br: Um acrônimo para "read–eval–print loop", outro nome para o console :term:`interativo` do interpretador.

source: A declaration inside a class that saves memory by pre-declaring space for instance attributes and eliminating instance dictionaries. Though popular, the technique is somewhat tricky to get right and is best reserved for rare cases where there are large numbers of instances in a memory-critical application.
pt_br: Uma declaração dentro de uma classe que economiza memória pré-declarando espaço para atributos de instâncias, e eliminando dicionários de instâncias. Apesar de popular, a técnica é um tanto quanto complicada de acertar, e é melhor se for reservada para casos raros, onde existe uma grande quantidade de instâncias em uma aplicação onde a memória é crítica.

source: sequence
pt_br: sequência

source: An :term:`iterable` which supports efficient element access using integer indices via the :meth:`~object.__getitem__` special method and defines a :meth:`~object.__len__` method that returns the length of the sequence. Some built-in sequence types are :class:`list`, :class:`str`, :class:`tuple`, and :class:`bytes`. Note that :class:`dict` also supports :meth:`~object.__getitem__` and :meth:`!__len__`, but is considered a mapping rather than a sequence because the lookups use arbitrary :term:`hashable` keys rather than integers.
pt_br: Um :term:`iterável` com suporte para acesso eficiente a seus elementos através de índices inteiros via método especial :meth:`~object.__getitem__` e que define o método :meth:`~object.__len__` que devolve o tamanho da sequência. Alguns tipos de sequência embutidos são: :class:`list`, :class:`str`, :class:`tuple`, e :class:`bytes`. Note que :class:`dict` também tem suporte para :meth:`~object.__getitem__` e :meth:`!__len__`, mas é considerado um mapeamento e não uma sequência porque a busca usa uma chave :term:`hasheável` arbitrária em vez de inteiros.

source: The :class:`collections.abc.Sequence` abstract base class defines a much richer interface that goes beyond just :meth:`~object.__getitem__` and :meth:`~object.__len__`, adding :meth:`~sequence.count`, :meth:`~sequence.index`, :meth:`~object.__contains__`, and :meth:`~object.__reversed__`. Types that implement this expanded interface can be registered explicitly using :func:`~abc.ABCMeta.register`. For more documentation on sequence methods generally, see :ref:`Common Sequence Operations <typesseq-common>`.
pt_br: A classe base abstrata :class:`collections.abc.Sequence` define uma interface mais rica que vai além de apenas :meth:`~object.__getitem__` e :meth:`~object.__len__`, adicionando :meth:`~sequence.count`, :meth:`~sequence.index`, :meth:`~object.__contains__`, e :meth:`~object.__reversed__`. Tipos que implementam essa interface podem ser explicitamente registrados usando :func:`~abc.ABCMeta.register`. Para mais documentação sobre métodos de sequências em geral, veja :ref:`Operações comuns de sequências <typesseq-common>`.

source: set comprehension
pt_br: compreensão de conjunto

source: A compact way to process all or part of the elements in an iterable and return a set with the results. ``results = {c for c in 'abracadabra' if c not in 'abc'}`` generates the set of strings ``{'r', 'd'}``. See :ref:`comprehensions`.
pt_br: Uma maneira compacta de processar todos ou parte dos elementos em iterável e retornar um conjunto com os resultados. ``results = {c for c in 'abracadabra' if c not in 'abc'}`` gera um conjunto de strings ``{'r', 'd'}``. Veja :ref:`comprehensions`.

source: single dispatch
pt_br: despacho único

source: A form of :term:`generic function` dispatch where the implementation is chosen based on the type of a single argument.
pt_br: Uma forma de despacho de :term:`função genérica` onde a implementação é escolhida com base no tipo de um único argumento.

source: slice
pt_br: fatia

source: An object usually containing a portion of a :term:`sequence`. A slice is created using the subscript notation, ``[]`` with colons between numbers when several are given, such as in ``variable_name[1:3:5]``. The bracket (subscript) notation uses :class:`slice` objects internally.
pt_br: Um objeto geralmente contendo uma parte de uma :term:`sequência`. Uma fatia é criada usando a notação de subscrito ``[]`` pode conter também até dois pontos entre números, como em ``variable_name[1:3:5]``. A notação de suporte (subscrito) utiliza objetos :class:`slice` internamente.

source: soft deprecated
pt_br: suavemente descontinuado

source: A soft deprecated API should not be used in new code, but it is safe for already existing code to use it. The API remains documented and tested, but will not be enhanced further.
pt_br: Uma API suavemente descontinuada não deve ser usada em código novo, mas é seguro para código já existente usá-la. A API continua documentada e testada, mas não será melhorada.

source: Soft deprecation, unlike normal deprecation, does not plan on removing the API and will not emit warnings.
pt_br: A descontinuação suave, diferentemente da descontinuação normal, não planeja remover a API e não emitirá avisos.

source: See `PEP 387: Soft Deprecation <https://peps.python.org/pep-0387/#soft-deprecation>`_.
pt_br: Veja `PEP 387: Descontinuação suave <https://peps.python.org/pep-0387/#soft-deprecation>`_.

source: special method
pt_br: método especial
