Repository: python/python-docs-pt-br
Catalog: glossary.po
Languages: pt_br

source: Glossary
pt_br: Glossário

source: The default Python prompt of the :term:`interactive` shell. Often seen for code examples which can be executed interactively in the interpreter.
pt_br: O prompt padrão do console :term:`interativo` do Python. Normalmente visto em exemplos de código que podem ser executados interativamente no interpretador.

source: Can refer to:
pt_br: Pode se referir a:

source: The default Python prompt of the :term:`interactive` shell when entering the code for an indented code block, when within a pair of matching left and right delimiters (parentheses, square brackets, curly braces or triple quotes), or after specifying a decorator.
pt_br: O prompt padrão do console :term:`interativo` do Python ao inserir o código para um bloco de código recuado, quando dentro de um par de delimitadores correspondentes esquerdo e direito (parênteses, colchetes, chaves ou aspas triplas) ou após especificar um decorador.

source: The three dots form of the :ref:`Ellipsis <bltin-ellipsis-object>` object.
pt_br: Os três pontos formam o objeto :ref:`Ellipsis <bltin-ellipsis-object>` (reticências).

source: abstract base class
pt_br: classe base abstrata

source: Abstract base classes complement :term:`duck-typing` by providing a way to define interfaces when other techniques like :func:`hasattr` would be clumsy or subtly wrong (for example with :ref:`magic methods <special-lookup>`). ABCs introduce virtual subclasses, which are classes that don't inherit from a class but are still recognized by :func:`isinstance` and :func:`issubclass`; see the :mod:`abc` module documentation. Python comes with many built-in ABCs for data structures (in the :mod:`collections.abc` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). You can create your own ABCs with the :mod:`abc` module.
pt_br: Classes bases abstratas (ABCs, do inglês *abstract base class*) complementam a :term:`tipagem pato`, fornecendo uma maneira de definir interfaces quando outras técnicas, como :func:`hasattr`, seriam desajeitadas ou sutilmente erradas (por exemplo, com :ref:`métodos mágicos <special-lookup>`). ABCs introduzem subclasses virtuais, classes que não herdam de uma classe mas ainda são reconhecidas por :func:`isinstance` e :func:`issubclass`; veja a documentação do módulo :mod:`abc`. Python vem com muitas ABCs embutidas para estruturas de dados (no módulo :mod:`collections.abc`), números (no módulo :mod:`numbers`), fluxos (no módulo :mod:`io`), localizadores e carregadores de importação (no módulo :mod:`importlib.abc`). Você pode criar suas próprias ABCs com o módulo :mod:`abc`.

source: annotate function
pt_br: função de anotação

source: A function that can be called to retrieve the :term:`annotations <annotation>` of an object. This function is accessible as the :attr:`~object.__annotate__` attribute of functions, classes, and modules. Annotate functions are a subset of :term:`evaluate functions <evaluate function>`.
pt_br: Uma função que pode ser chamada para recuperar as :term:`anotações <annotation>` de um objeto. Esta função é acessível como o atributo :attr:`~object.__annotate__` de funções, classes e módulos. Funções de anotação são um subconjunto de :term:`funções de avaliação <evaluate function>`.

source: annotation
pt_br: anotação

source: A label associated with a variable, a class attribute or a function parameter or return value, used by convention as a :term:`type hint`.
pt_br: Um rótulo associado a uma variável, um atributo de classe ou um parâmetro de função ou valor de retorno, usado por convenção como :term:`dica de tipo <type hint>`.

source: Annotations of local variables cannot be accessed at runtime, but annotations of global variables, class attributes, and functions can be retrieved by calling :func:`annotationlib.get_annotations` on modules, classes, and functions, respectively.
pt_br: Anotações de variáveis locais não podem ser acessadas em tempo de execução, mas anotações de variáveis globais, atributos de classe e funções podem ser recuperadas chamando :func:`annotationlib.get_annotations` em módulos, classes e funções, respectivamente.

source: See :term:`variable annotation`, :term:`function annotation`, :pep:`484`, :pep:`526`, and :pep:`649`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
pt_br: Consulte :term:`anotação de variável`, :term:`anotação de função`, :pep:`484`, :pep:`526` e :pep:`649`, que descrevem essa funcionalidade. Consulte também :ref:`annotations-howto` para obter as melhores práticas sobre como trabalhar com anotações.

source: argument
pt_br: argumento

source: A value passed to a :term:`function` (or :term:`method`) when calling the function. There are two kinds of argument:
pt_br: Um valor passado para uma :term:`função<function>` (ou :term:`método<method>`) ao chamar a função. Existem dois tipos de argumento:

source: :dfn:`keyword argument`: an argument preceded by an identifier (e.g. ``name=``) in a function call or passed as a value in a dictionary preceded by ``**``. For example, ``3`` and ``5`` are both keyword arguments in the following calls to :func:`complex`::
pt_br: :dfn:`argumento nomeado`: um argumento precedido por um identificador (por exemplo, ``name=``) na chamada de uma função ou passado como um valor em um dicionário precedido por ``**``. Por exemplo, ``3`` e ``5`` são ambos argumentos nomeados nas chamadas da função :func:`complex` a seguir::

source: :dfn:`positional argument`: an argument that is not a keyword argument. Positional arguments can appear at the beginning of an argument list and/or be passed as elements of an :term:`iterable` preceded by ``*``. For example, ``3`` and ``5`` are both positional arguments in the following calls::
pt_br: :dfn:`argumento posicional`: um argumento que não é um argumento nomeado. Argumentos posicionais podem aparecer no início da lista de argumentos e/ou podem ser passados como elementos de um :term:`iterável` precedidos por ``*``. Por exemplo, ``3`` e ``5`` são ambos argumentos posicionais nas chamadas a seguir::

source: Arguments are assigned to the named local variables in a function body. See the :ref:`calls` section for the rules governing this assignment. Syntactically, any expression can be used to represent an argument; the evaluated value is assigned to the local variable.
pt_br: Argumentos são atribuídos às variáveis locais nomeadas no corpo da função. Veja a seção :ref:`calls` para as regras de atribuição. Sintaticamente, qualquer expressão pode ser usada para representar um argumento; após a expressão ser avaliada, o valor resultante é atribuído à variável local.

source: See also the :term:`parameter` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, and :pep:`362`.
pt_br: Veja também o termo :term:`parâmetro` no glossário, a pergunta no FAQ sobre :ref:`a diferença entre argumentos e parâmetros <faq-argument-vs-parameter>` e :pep:`362`.

source: asynchronous context manager
pt_br: gerenciador de contexto assíncrono

source: An object which controls the environment seen in an :keyword:`async with` statement by defining :meth:`~object.__aenter__` and :meth:`~object.__aexit__` methods. Introduced by :pep:`492`.
pt_br: Um objeto que controla o ambiente envolto numa instrução :keyword:`async with` por meio da definição dos métodos :meth:`~object.__aenter__` e :meth:`~object.__aexit__`. Introduzido pela :pep:`492`.

source: asynchronous generator
pt_br: gerador assíncrono

source: A function which returns an :term:`asynchronous generator iterator`. It looks like a coroutine function defined with :keyword:`async def` except that it contains :keyword:`yield` expressions for producing a series of values usable in an :keyword:`async for` loop.
pt_br: Uma função que retorna um :term:`iterador gerador assíncrono`. É parecida com uma função de corrotina definida com :keyword:`async def` exceto pelo fato de conter instruções :keyword:`yield` para produzir uma série de valores que podem ser usados em um laço :keyword:`async for`.

source: Usually refers to an asynchronous generator function, but may refer to an *asynchronous generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
pt_br: Normalmente se refere a uma função geradora assíncrona, mas pode se referir a um *iterador gerador assíncrono* em alguns contextos. Em casos em que o significado não esteja claro, usar o termo completo evita a ambiguidade.

source: An asynchronous generator function may contain :keyword:`await` expressions as well as :keyword:`async for`, and :keyword:`async with` statements.
pt_br: Uma função geradora assíncrona pode conter expressões :keyword:`await` e também as instruções :keyword:`async for` e :keyword:`async with`.

source: asynchronous generator iterator
pt_br: iterador gerador assíncrono

source: An object created by an :term:`asynchronous generator` function.
pt_br: Um objeto criado por uma função :term:`geradora assíncrona <asynchronous generator>`.

source: This is an :term:`asynchronous iterator` which when called using the :meth:`~object.__anext__` method returns an awaitable object which will execute the body of the asynchronous generator function until the next :keyword:`yield` expression.
pt_br: Este é um :term:`iterador assíncrono` que, quando chamado usando o método :meth:`~object.__anext__`, retorna um objeto aguardável que executará o corpo da função geradora assíncrona até a próxima expressão :keyword:`yield`.

source: Each :keyword:`yield` temporarily suspends processing, remembering the execution state (including local variables and pending try-statements). When the *asynchronous generator iterator* effectively resumes with another awaitable returned by :meth:`~object.__anext__`, it picks up where it left off. See :pep:`492` and :pep:`525`.
pt_br: Cada :keyword:`yield` suspende temporariamente o processamento, lembrando o estado de execução (incluindo variáveis locais e instruções ``try`` pendentes). Quando o *iterador gerador assíncrono* é efetivamente retomado com outro aguardável retornado por :meth:`~object.__anext__`, ele inicia de onde parou. Veja :pep:`492` e :pep:`525`.

source: asynchronous iterable
pt_br: iterável assíncrono

source: An object, that can be used in an :keyword:`async for` statement. Must return an :term:`asynchronous iterator` from its :meth:`~object.__aiter__` method. Introduced by :pep:`492`.
pt_br: Um objeto que pode ser usado em uma instrução :keyword:`async for`. Deve retornar um :term:`iterador assíncrono` do seu método :meth:`~object.__aiter__`. Introduzido por :pep:`492`.

source: asynchronous iterator
pt_br: iterador assíncrono

source: An object that implements the :meth:`~object.__aiter__` and :meth:`~object.__anext__` methods. :meth:`~object.__anext__` must return an :term:`awaitable` object. :keyword:`async for` resolves the awaitables returned by an asynchronous iterator's :meth:`~object.__anext__` method until it raises a :exc:`StopAsyncIteration` exception. Introduced by :pep:`492`.
pt_br: Um objeto que implementa os métodos :meth:`~object.__aiter__` e :meth:`~object.__anext__`. :meth:`~object.__anext__` deve retornar um objeto :term:`aguardável <awaitable>`. :keyword:`async for` resolve os aguardáveis retornados por um método :meth:`~object.__anext__` do iterador assíncrono até que ele levante uma exceção :exc:`StopAsyncIteration`. Introduzido pela :pep:`492`.

source: attached thread state
pt_br: estado de thread anexado

source: A :term:`thread state` that is active for the current OS thread.
pt_br: Um :term:`estado de thread` que está ativo para a thread atual do sistema operacional.

source: When a :term:`thread state` is attached, the OS thread has access to the full Python C API and can safely invoke the bytecode interpreter.
pt_br: Quando um :term:`estado de thread` é anexado, a thread do sistema operacional tem acesso à API C completa do Python e pode invocar com segurança o interpretador de bytecode.

source: Unless a function explicitly notes otherwise, attempting to call the C API without an attached thread state will result in a fatal error or undefined behavior. A thread state can be attached and detached explicitly by the user through the C API, or implicitly by the runtime, including during blocking C calls and by the bytecode interpreter in between calls.
pt_br: A menos que uma função indique explicitamente o contrário, tentar chamar a API C sem um estado de thread anexado resultará em um erro fatal ou comportamento indefinido. Um estado de thread pode ser anexado e desanexado explicitamente pelo usuário por meio da API C, ou implicitamente pelo ambiente de execução, inclusive durante o bloqueio de chamadas C e pelo interpretador de bytecode entre as chamadas.

source: On most builds of Python, having an attached thread state implies that the caller holds the :term:`GIL` for the current interpreter, so only one OS thread can have an attached thread state at a given moment. In :term:`free-threaded <free threading>` builds of Python, threads can concurrently hold an attached thread state, allowing for true parallelism of the bytecode interpreter.
pt_br: Na maioria das construções do Python, ter um estado de thread anexado implica que o chamador mantém a :term:`GIL` para o interpretador atual, portanto, apenas uma thread do SO pode ter um estado de thread anexado em um determinado momento. Em construções do Python com :term:`threads livres`, as threads podem manter simultaneamente um estado de thread anexado, permitindo um verdadeiro paralelismo do interpretador de bytecode.

source: attribute
pt_br: atributo

source: A value associated with an object which is usually referenced by name using dotted expressions. For example, if an object *o* has an attribute *a* it would be referenced as *o.a*.
pt_br: Um valor associado a um objeto que é geralmente referenciado pelo nome separado por um ponto. Por exemplo, se um objeto *o* tem um atributo *a* esse seria referenciado como *o.a*.

source: It is possible to give an object an attribute whose name is not an identifier as defined by :ref:`identifiers`, for example using :func:`setattr`, if the object allows it. Such an attribute will not be accessible using a dotted expression, and would instead need to be retrieved with :func:`getattr`.
pt_br: É possível dar a um objeto um atributo cujo nome não seja um identificador conforme definido por :ref:`identifiers`, por exemplo usando :func:`setattr`, se o objeto permitir. Tal atributo não será acessível usando uma expressão pontilhada e, em vez disso, precisaria ser recuperado com :func:`getattr`.

source: awaitable
pt_br: aguardável

source: An object that can be used in an :keyword:`await` expression. Can be a :term:`coroutine` or an object with an :meth:`~object.__await__` method. See also :pep:`492`.
pt_br: Um objeto que pode ser usado em uma expressão :keyword:`await`. Pode ser uma :term:`corrotina` ou um objeto com um método :meth:`~object.__await__`. Veja também a :pep:`492`.

source: Benevolent Dictator For Life, a.k.a. `Guido van Rossum <https://gvanrossum.github.io/>`_, Python's creator.
pt_br: Abreviação da expressão da língua inglesa "Benevolent Dictator for Life" (em português, "Ditador Benevolente Vitalício"), referindo-se a `Guido van Rossum <https://gvanrossum.github.io/>`_, criador do Python.

source: binary file
pt_br: arquivo binário

source: A :term:`file object` able to read and write :term:`bytes-like objects <bytes-like object>`. Examples of binary files are files opened in binary mode (``'rb'``, ``'wb'`` or ``'rb+'``), :data:`sys.stdin.buffer <sys.stdin>`, :data:`sys.stdout.buffer <sys.stdout>`, and instances of :class:`io.BytesIO` and :class:`gzip.GzipFile`.
pt_br: Um :term:`objeto arquivo <file object>` capaz de ler e gravar em :term:`objetos bytes ou similares <bytes-like object>`. Exemplos de arquivos binários são arquivos abertos no modo binário (``'rb'``, ``'wb'`` ou ``'rb+'``), :data:`sys.stdin.buffer <sys.stdin>`, :data:`sys.stdout.buffer <sys.stdout>`, e instâncias de :class:`io.BytesIO` e :class:`gzip.GzipFile`.

source: See also :term:`text file` for a file object able to read and write :class:`str` objects.
pt_br: Veja também :term:`arquivo texto <text file>` para um objeto arquivo capaz de ler e gravar em objetos :class:`str`.

source: borrowed reference
pt_br: referência emprestada

source: In Python's C API, a borrowed reference is a reference to an object, where the code using the object does not own the reference. It becomes a dangling pointer if the object is destroyed. For example, a garbage collection can remove the last :term:`strong reference` to the object and so destroy it.
pt_br: Na API C do Python, uma referência emprestada é uma referência a um objeto que não é dona da referência. Ela se torna um ponteiro solto se o objeto for destruído. Por exemplo, uma coleta de lixo pode remover a última :term:`referência forte` para o objeto e assim destruí-lo.

source: Calling :c:func:`Py_INCREF` on the :term:`borrowed reference` is recommended to convert it to a :term:`strong reference` in-place, except when the object cannot be destroyed before the last usage of the borrowed reference. The :c:func:`Py_NewRef` function can be used to create a new :term:`strong reference`.
pt_br: Chamar :c:func:`Py_INCREF` na :term:`referência emprestada` é recomendado para convertê-lo, internamente, em uma :term:`referência forte`, exceto quando o objeto não pode ser destruído antes do último uso da referência emprestada. A função :c:func:`Py_NewRef` pode ser usada para criar uma nova :term:`referência forte`.

source: bytes-like object
pt_br: objeto bytes ou similar

source: An object that supports the :ref:`bufferobjects` and can export a C-:term:`contiguous` buffer. This includes all :class:`bytes`, :class:`bytearray`, and :class:`array.array` objects, as well as many common :class:`memoryview` objects. Bytes-like objects can be used for various operations that work with binary data; these include compression, saving to a binary file, and sending over a socket.
pt_br: Um objeto com suporte ao :ref:`bufferobjects` e que pode exportar um buffer C :term:`contíguo`. Isso inclui todos os objetos :class:`bytes`, :class:`bytearray` e :class:`array.array`, além de muitos objetos :class:`memoryview` comuns. Objetos bytes ou similares podem ser usados para várias operações que funcionam com dados binários; isso inclui compactação, salvamento em um arquivo binário e envio por um soquete.

source: Some operations need the binary data to be mutable. The documentation often refers to these as "read-write bytes-like objects". Example mutable buffer objects include :class:`bytearray` and a :class:`memoryview` of a :class:`bytearray`. Other operations require the binary data to be stored in immutable objects ("read-only bytes-like objects"); examples of these include :class:`bytes` and a :class:`memoryview` of a :class:`bytes` object.
pt_br: Algumas operações precisam que os dados binários sejam mutáveis. A documentação geralmente se refere a eles como "objetos bytes ou similares para leitura e escrita". Exemplos de objetos de buffer mutável incluem :class:`bytearray` e um :class:`memoryview` de um :class:`bytearray`. Outras operações exigem que os dados binários sejam armazenados em objetos imutáveis ("objetos bytes ou similares para somente leitura"); exemplos disso incluem :class:`bytes` e a :class:`memoryview` de um objeto :class:`bytes`.

source: Python source code is compiled into bytecode, the internal representation of a Python program in the CPython interpreter. The bytecode is also cached in ``.pyc`` files so that executing the same file is faster the second time (recompilation from source to bytecode can be avoided). This "intermediate language" is said to run on a :term:`virtual machine` that executes the machine code corresponding to each bytecode. Do note that bytecodes are not expected to work between different Python virtual machines, nor to be stable between Python releases.
pt_br: O código-fonte Python é compilado para bytecode, a representação interna de um programa em Python no interpretador CPython. O bytecode também é mantido em cache em arquivos ``.pyc`` e ``.pyo``, de forma que executar um mesmo arquivo é mais rápido na segunda vez (a recompilação dos fontes para bytecode não é necessária). Esta "linguagem intermediária" é adequada para execução em uma :term:`máquina virtual`, que executa o código de máquina correspondente para cada bytecode. Tenha em mente que não se espera que bytecodes sejam executados entre máquinas virtuais Python diferentes, nem que se mantenham estáveis entre versões de Python.

source: A list of bytecode instructions can be found in the documentation for :ref:`the dis module <bytecodes>`.
pt_br: Uma lista de instruções bytecode pode ser encontrada na documentação para :ref:`o módulo dis <bytecodes>`.

source: callable
pt_br: chamável

source: A callable is an object that can be called, possibly with a set of arguments (see :term:`argument`), with the following syntax::
pt_br: Um chamável é um objeto que pode ser chamado, possivelmente com um conjunto de argumentos (veja :term:`argumento`), com a seguinte sintaxe::

source: callable(argument1, argument2, argumentN)
pt_br: chamavel(argumento1, argumento2, argumentoN)

source: A :term:`function`, and by extension a :term:`method`, is a callable. An instance of a class that implements the :meth:`~object.__call__` method is also a callable.
pt_br: Uma :term:`função`, e por extensão um :term:`método`, é um chamável. Uma instância de uma classe que implementa o método :meth:`~object.__call__` também é um chamável.

source: callback
pt_br: função de retorno

source: A subroutine function which is passed as an argument to be executed at some point in the future.
pt_br: Também conhecida como callback, é uma função sub-rotina que é passada como um argumento a ser executado em algum ponto no futuro.

source: class
pt_br: classe

source: A template for creating user-defined objects. Class definitions normally contain method definitions which operate on instances of the class.
pt_br: Um modelo para criação de objetos definidos pelo usuário. Definições de classe normalmente contém definições de métodos que operam sobre instâncias da classe.

source: class variable
pt_br: variável de classe

source: A variable defined in a class and intended to be modified only at class level (i.e., not in an instance of the class).
pt_br: Uma variável definida em uma classe e destinada a ser modificada apenas no nível da classe (ou seja, não em uma instância da classe).

source: closure variable
pt_br: variável de clausura

source: A :term:`free variable` referenced from a :term:`nested scope` that is defined in an outer scope rather than being resolved at runtime from the globals or builtin namespaces. May be explicitly defined with the :keyword:`nonlocal` keyword to allow write access, or implicitly defined if the variable is only being read.
pt_br: Uma :term:`variável livre` referenciada de um :term:`escopo aninhado` que é definida em um escopo externo em vez de ser resolvida em tempo de execução a partir dos espaços de nomes embutido ou globais. Pode ser explicitamente definida com a palavra reservada :keyword:`nonlocal` para permitir acesso de gravação, ou implicitamente definida se a variável estiver sendo somente lida.
