Repository: python/python-docs-pt-br
Catalog: glossary.po
Languages: pt_br

source: For example, in the ``inner`` function in the following code, both ``x`` and ``print`` are :term:`free variables <free variable>`, but only ``x`` is a *closure variable*::
pt_br: Por exemplo, na função ``interna`` no código a seguir, tanto ``x`` quanto ``print`` são :term:`variáveis livres <free variable>`, mas somente ``x`` é uma *variável de clausura*::

source: def outer(): x = 0 def inner(): nonlocal x x += 1 print(x) return inner
pt_br: def externa(): x = 0 def interna(): nonlocal x x += 1 print(x) return interna

source: Due to the :attr:`codeobject.co_freevars` attribute (which, despite its name, only includes the names of closure variables rather than listing all referenced free variables), the more general :term:`free variable` term is sometimes used even when the intended meaning is to refer specifically to closure variables.
pt_br: Devido ao atributo :attr:`codeobject.co_freevars` (que, apesar do nome, inclui apenas os nomes das variáveis de clausura em vez de listar todas as variáveis livres referenciadas), o termo mais geral :term:`variável livre` às vezes é usado mesmo quando o significado pretendido é se referir especificamente às variáveis de clausura.

source: complex number
pt_br: número complexo

source: An extension of the familiar real number system in which all numbers are expressed as a sum of a real part and an imaginary part. Imaginary numbers are real multiples of the imaginary unit (the square root of ``-1``), often written ``i`` in mathematics or ``j`` in engineering. Python has built-in support for complex numbers, which are written with this latter notation; the imaginary part is written with a ``j`` suffix, e.g., ``3+1j``. To get access to complex equivalents of the :mod:`math` module, use :mod:`cmath`. Use of complex numbers is a fairly advanced mathematical feature. If you're not aware of a need for them, it's almost certain you can safely ignore them.
pt_br: Uma extensão ao familiar sistema de números reais em que todos os números são expressos como uma soma de uma parte real e uma parte imaginária. Números imaginários são múltiplos reais da unidade imaginária (a raiz quadrada de ``-1``), normalmente escrita como ``i`` em matemática ou ``j`` em engenharia. O Python tem suporte nativo para números complexos, que são escritos com esta última notação; a parte imaginária escrita com um sufixo ``j``, p.ex., ``3+1j``. Para ter acesso aos equivalentes para números complexos do módulo :mod:`math`, utilize :mod:`cmath`. O uso de números complexos é uma funcionalidade matemática bastante avançada. Se você não sabe se irá precisar deles, é quase certo que você pode ignorá-los sem problemas.

source: context
pt_br: contexto

source: This term has different meanings depending on where and how it is used. Some common meanings:
pt_br: Este termo tem diferentes significados dependendo de onde e como ele é usado. Alguns significados comuns:

source: The temporary state or environment established by a :term:`context manager` via a :keyword:`with` statement.
pt_br: O estado ou ambiente temporário estabelecido por um :term:`gerenciador de contexto` por meio de uma instrução :keyword:`with`.

source: The collection of key­value bindings associated with a particular :class:`contextvars.Context` object and accessed via :class:`~contextvars.ContextVar` objects. Also see :term:`context variable`.
pt_br: A coleção de ligações de chave-valor associadas a um objeto :class:`contextvars.Context` específico e acessadas por meio de objetos :class:`~contextvars.ContextVar`. Veja também :term:`variável de contexto`.

source: A :class:`contextvars.Context` object. Also see :term:`current context`.
pt_br: Um objeto :class:`contextvars.Context`. Veja também :term:`contexto atual`.

source: context management protocol
pt_br: protocolo de gerenciamento de contexto

source: The :meth:`~object.__enter__` and :meth:`~object.__exit__` methods called by the :keyword:`with` statement. See :pep:`343`.
pt_br: Os métodos :meth:`~object.__enter__` e :meth:`~object.__exit__` chamados pela instrução :keyword:`with`. Veja :pep:`343`.

source: context manager
pt_br: gerenciador de contexto

source: An object which implements the :term:`context management protocol` and controls the environment seen in a :keyword:`with` statement. See :pep:`343`.
pt_br: Um objeto que implementa o :term:`protocolo de gerenciamento de contexto` e controla o ambiente envolto em uma instrução :keyword:`with`. Veja :pep:`343`.

source: context variable
pt_br: variável de contexto

source: A variable whose value depends on which context is the :term:`current context`. Values are accessed via :class:`contextvars.ContextVar` objects. Context variables are primarily used to isolate state between concurrent asynchronous tasks.
pt_br: Uma variável cujo valor depende de qual contexto é o :term:`contexto atual`. Os valores são acessados por meio de objetos :class:`contextvars.ContextVar`. Variáveis de contexto são usadas principalmente para isolar o estado entre tarefas assíncronas simultâneas.

source: contiguous
pt_br: contíguo

source: A buffer is considered contiguous exactly if it is either *C-contiguous* or *Fortran contiguous*. Zero-dimensional buffers are C and Fortran contiguous. In one-dimensional arrays, the items must be laid out in memory next to each other, in order of increasing indexes starting from zero. In multidimensional C-contiguous arrays, the last index varies the fastest when visiting items in order of memory address. However, in Fortran contiguous arrays, the first index varies the fastest.
pt_br: Um buffer é considerado contíguo exatamente se for *contíguo C* ou *contíguo Fortran*. Os buffers de dimensão zero são contíguos C e Fortran. Em vetores unidimensionais, os itens devem ser dispostos na memória próximos um do outro, em ordem crescente de índices, começando do zero. Em vetores multidimensionais contíguos C, o último índice varia mais rapidamente ao visitar itens em ordem de endereço de memória. No entanto, nos vetores contíguos do Fortran, o primeiro índice varia mais rapidamente.

source: coroutine
pt_br: corrotina

source: Coroutines are a more generalized form of subroutines. Subroutines are entered at one point and exited at another point. Coroutines can be entered, exited, and resumed at many different points. They can be implemented with the :keyword:`async def` statement. See also :pep:`492`.
pt_br: Corrotinas são uma forma mais generalizada de sub-rotinas. Sub-rotinas tem a entrada iniciada em um ponto, e a saída em outro ponto. Corrotinas podem entrar, sair, e continuar em muitos pontos diferentes. Elas podem ser implementadas com a instrução :keyword:`async def`. Veja também :pep:`492`.

source: coroutine function
pt_br: função de corrotina

source: A function which returns a :term:`coroutine` object. A coroutine function may be defined with the :keyword:`async def` statement, and may contain :keyword:`await`, :keyword:`async for`, and :keyword:`async with` keywords. These were introduced by :pep:`492`.
pt_br: Uma função que retorna um objeto do tipo :term:`corrotina`. Uma função de corrotina pode ser definida com a instrução :keyword:`async def`, e pode conter as palavras chaves :keyword:`await`, :keyword:`async for`, e :keyword:`async with`. Isso foi introduzido pela :pep:`492`.

source: The canonical implementation of the Python programming language, as distributed on `python.org <https://www.python.org>`_. The term "CPython" is used when necessary to distinguish this implementation from others such as Jython or IronPython.
pt_br: A implementação canônica da linguagem de programação Python, como disponibilizada pelo `python.org <https://www.python.org>`_. O termo "CPython" é usado quando necessário distinguir esta implementação de outras como Jython ou IronPython.

source: current context
pt_br: contexto atual

source: The :term:`context` (:class:`contextvars.Context` object) that is currently used by :class:`~contextvars.ContextVar` objects to access (get or set) the values of :term:`context variables <context variable>`. Each thread has its own current context. Frameworks for executing asynchronous tasks (see :mod:`asyncio`) associate each task with a context which becomes the current context whenever the task starts or resumes execution.
pt_br: O :term:`contexto` (objeto :class:`contextvars.Context`) que é usado atualmente pelos objetos :class:`~contextvars.ContextVar` para acessar (obter ou definir) os valores de :term:`variáveis de contexto <variável de contexto>`. Cada thread tem seu próprio contexto atual. Frameworks para executar tarefas assíncronas (veja :mod:`asyncio`) associam cada tarefa a um contexto que se torna o contexto atual sempre que a tarefa inicia ou retoma a execução.

source: cyclic isolate
pt_br: isolado cíclico

source: A subgroup of one or more objects that reference each other in a reference cycle, but are not referenced by objects outside the group. The goal of the :term:`cyclic garbage collector <garbage collection>` is to identify these groups and break the reference cycles so that the memory can be reclaimed.
pt_br: Um subgrupo de um ou mais objetos que se referenciam em um ciclo de referência, mas não são referenciados por objetos de fora do grupo. O objetivo do :term:`coletor de lixo cíclico <garbage collection>` é identificar esses grupos e interromper os ciclos de referência para que a memória possa ser recuperada.

source: decorator
pt_br: decorador

source: A function returning another function, usually applied as a function transformation using the ``@wrapper`` syntax. Common examples for decorators are :func:`classmethod` and :func:`staticmethod`.
pt_br: Uma função que retorna outra função, geralmente aplicada como uma transformação de função usando a sintaxe ``@wrapper``. Exemplos comuns para decoradores são :func:`classmethod` e :func:`staticmethod`.

source: The decorator syntax is merely syntactic sugar, the following two function definitions are semantically equivalent::
pt_br: A sintaxe do decorador é meramente um açúcar sintático, as duas definições de funções a seguir são semanticamente equivalentes::

source: The same concept exists for classes, but is less commonly used there. See the documentation for :ref:`function definitions <function>` and :ref:`class definitions <class>` for more about decorators.
pt_br: O mesmo conceito existe para as classes, mas não é comumente utilizado. Veja a documentação de :ref:`definições de função <function>` e :ref:`definições de classe <class>` para obter mais informações sobre decoradores.

source: descriptor
pt_br: descritor

source: Any object which defines the methods :meth:`~object.__get__`, :meth:`~object.__set__`, or :meth:`~object.__delete__`. When a class attribute is a descriptor, its special binding behavior is triggered upon attribute lookup. Normally, using *a.b* to get, set or delete an attribute looks up the object named *b* in the class dictionary for *a*, but if *b* is a descriptor, the respective descriptor method gets called. Understanding descriptors is a key to a deep understanding of Python because they are the basis for many features including functions, methods, properties, class methods, static methods, and reference to super classes.
pt_br: Qualquer objeto que define os métodos :meth:`~object.__get__`, :meth:`~object.__set__` ou :meth:`~object.__delete__`. Quando um atributo de classe é um descritor, seu comportamento de associação especial é acionado no acesso a um atributo. Normalmente, ao se utilizar *a.b* para se obter, definir ou excluir, um atributo dispara uma busca no objeto chamado *b* no dicionário de classe de *a*, mas se *b* for um descritor, o respectivo método descritor é chamado. Compreender descritores é a chave para um profundo entendimento de Python pois eles são a base de muitas funcionalidades incluindo funções, métodos, propriedades, métodos de classe, métodos estáticos e referências para superclasses.

source: For more information about descriptors' methods, see :ref:`descriptors` or the :ref:`Descriptor How To Guide <descriptorhowto>`.
pt_br: Para obter mais informações sobre os métodos dos descritores, veja: :ref:`descriptors` ou o :ref:`Guia de Descritores <descriptorhowto>`.

source: dictionary
pt_br: dicionário

source: An associative array, where arbitrary keys are mapped to values. The keys can be any object with :meth:`~object.__hash__` and :meth:`~object.__eq__` methods. Called a hash in Perl.
pt_br: Um vetor associativo em que chaves arbitrárias são mapeadas para valores. As chaves podem ser quaisquer objetos que possuam os métodos :meth:`~object.__hash__` e :meth:`~object.__eq__`. Isso é chamado de hash em Perl.

source: dictionary comprehension
pt_br: compreensão de dicionário

source: A compact way to process all or part of the elements in an iterable and return a dictionary with the results. ``results = {n: n ** 2 for n in range(10)}`` generates a dictionary containing key ``n`` mapped to value ``n ** 2``. See :ref:`comprehensions`.
pt_br: Uma maneira compacta de processar todos ou parte dos elementos de um iterável e retornar um dicionário com os resultados. ``results = {n: n ** 2 for n in range(10)}`` gera um dicionário contendo a chave ``n`` mapeada para o valor ``n ** 2``. Veja :ref:`comprehensions`.

source: dictionary view
pt_br: visão de dicionário

source: The objects returned from :meth:`dict.keys`, :meth:`dict.values`, and :meth:`dict.items` are called dictionary views. They provide a dynamic view on the dictionary’s entries, which means that when the dictionary changes, the view reflects these changes. To force the dictionary view to become a full list use ``list(dictview)``. See :ref:`dict-views`.
pt_br: Os objetos retornados por :meth:`dict.keys`, :meth:`dict.values` e :meth:`dict.items` são chamados de visões de dicionário. Eles fornecem uma visão dinâmica das entradas do dicionário, o que significa que quando o dicionário é alterado, a visão reflete essas alterações. Para forçar a visão de dicionário a se tornar uma lista completa use ``list(dictview)``. Veja :ref:`dict-views`.

source: A string literal which appears as the first expression in a class, function or module. While ignored when the suite is executed, it is recognized by the compiler and put into the :attr:`~definition.__doc__` attribute of the enclosing class, function or module. Since it is available via introspection, it is the canonical place for documentation of the object.
pt_br: Abreviatura de "documentation string" (string de documentação). Uma string literal que aparece como primeira expressão numa classe, função ou módulo. Ainda que sejam ignoradas quando a suíte é executada, é reconhecida pelo compilador que a coloca no atributo :attr:`~definition.__doc__` da classe, função ou módulo que a encapsula. Como ficam disponíveis por meio de introspecção, docstrings são o lugar canônico para documentação do objeto.

source: duck-typing
pt_br: tipagem pato

source: A programming style which does not look at an object's type to determine if it has the right interface; instead, the method or attribute is simply called or used ("If it looks like a duck and quacks like a duck, it must be a duck.") By emphasizing interfaces rather than specific types, well-designed code improves its flexibility by allowing polymorphic substitution. Duck-typing avoids tests using :func:`type` or :func:`isinstance`. (Note, however, that duck-typing can be complemented with :term:`abstract base classes <abstract base class>`.) Instead, it typically employs :func:`hasattr` tests or :term:`EAFP` programming.
pt_br: Também conhecida como *duck-typing*, é um estilo de programação que não verifica o tipo do objeto para determinar se ele possui a interface correta; em vez disso, o método ou atributo é simplesmente chamado ou utilizado ("Se se parece com um pato e grasna como um pato, então deve ser um pato.") Enfatizando interfaces ao invés de tipos específicos, o código bem desenvolvido aprimora sua flexibilidade por permitir substituição polimórfica. Tipagem pato evita necessidade de testes que usem :func:`type` ou :func:`isinstance`. (Note, porém, que a tipagem pato pode ser complementada com o uso de :term:`classes base abstratas <abstract base class>`.) Ao invés disso, são normalmente empregados testes :func:`hasattr` ou programação :term:`EAFP`.

source: An informal short-hand for "double underscore", used when talking about a :term:`special method`. For example, ``__init__`` is often pronounced "dunder init".
pt_br: Uma abreviação informal para "double underscore" (em português, sublinhado duplo), usada ao se referir a um :term:`método especial`. Por exemplo, ``__init__`` é frequentemente pronunciado como "dunder init".

source: Easier to ask for forgiveness than permission. This common Python coding style assumes the existence of valid keys or attributes and catches exceptions if the assumption proves false. This clean and fast style is characterized by the presence of many :keyword:`try` and :keyword:`except` statements. The technique contrasts with the :term:`LBYL` style common to many other languages such as C.
pt_br: Iniciais da expressão em inglês "easier to ask for forgiveness than permission" que significa "é mais fácil pedir perdão que permissão". Este estilo de codificação comum no Python presume a existência de chaves ou atributos válidos e captura exceções caso essa premissa se prove falsa. Este estilo limpo e rápido se caracteriza pela presença de várias instruções :keyword:`try` e :keyword:`except`. A técnica diverge do estilo :term:`LBYL`, comum em outras linguagens como C, por exemplo.

source: evaluate function
pt_br: função de avaliação

source: A function that can be called to evaluate a lazily evaluated attribute of an object, such as the value of type aliases created with the :keyword:`type` statement.
pt_br: Uma função que pode ser chamada para avaliar um atributo com avaliação preguiçosa de um objeto, como o valor de apelidos de tipo criados com a instrução :keyword:`type`.

source: expression
pt_br: expressão

source: A piece of syntax which can be evaluated to some value. In other words, an expression is an accumulation of expression elements like literals, names, attribute access, operators or function calls which all return a value. In contrast to many other languages, not all language constructs are expressions. There are also :term:`statement`\s which cannot be used as expressions, such as :keyword:`while`. Assignments are also statements, not expressions.
pt_br: Uma parte da sintaxe que pode ser avaliada para algum valor. Em outras palavras, uma expressão é a acumulação de elementos de expressão como literais, nomes, atributos de acesso, operadores ou chamadas de funções, todos os quais retornam um valor. Em contraste com muitas outras linguagens, nem todas as construções de linguagem são expressões. Também existem :term:`instruções <statement>`, as quais não podem ser usadas como expressões, como, por exemplo, :keyword:`while`. Atribuições também são instruções, não expressões.

source: extension module
pt_br: módulo de extensão

source: A module written in C or C++, using Python's C API to interact with the core and with user code.
pt_br: Um módulo escrito em C ou C++, usando a API C do Python para interagir tanto com código de usuário quanto do núcleo.

source: String literals prefixed with ``f`` or ``F`` are commonly called "f-strings" which is short for :ref:`formatted string literals <f-strings>`. See also :pep:`498`.
pt_br: Literais de string prefixados com ``f`` ou ``F`` são comumente chamados de "f-strings", abreviação em inglês de :ref:`literais de strings formatadas <f-strings>`. Veja também :pep:`498`.

source: file object
pt_br: objeto arquivo

source: An object exposing a file-oriented API (with methods such as :meth:`!read` or :meth:`!write`) to an underlying resource. Depending on the way it was created, a file object can mediate access to a real on-disk file or to another type of storage or communication device (for example standard input/output, in-memory buffers, sockets, pipes, etc.). File objects are also called :dfn:`file-like objects` or :dfn:`streams`.
pt_br: Um objeto que expõe uma API orientada a arquivos (com métodos tais como :meth:`!read` ou :meth:`!write`) para um recurso subjacente. Dependendo da maneira como foi criado, um objeto arquivo pode mediar o acesso a um arquivo real no disco ou outro tipo de dispositivo de armazenamento ou de comunicação (por exemplo a entrada/saída padrão, buffers em memória, soquetes, pipes, etc.). Objetos arquivo também são chamados de :dfn:`objetos arquivo ou similares` ou :dfn:`fluxos`.

source: There are actually three categories of file objects: raw :term:`binary files <binary file>`, buffered :term:`binary files <binary file>` and :term:`text files <text file>`. Their interfaces are defined in the :mod:`io` module. The canonical way to create a file object is by using the :func:`open` function.
pt_br: Atualmente há três categorias de objetos arquivo: :term:`arquivos binários <binary file>` brutos, :term:`arquivos binários <binary file>` em buffer e :term:`arquivos textos <text file>`. Suas interfaces estão definidas no módulo :mod:`io`. A forma canônica para criar um objeto arquivo é usando a função :func:`open`.

source: file-like object
pt_br: objeto arquivo ou similar

source: A synonym for :term:`file object`.
pt_br: Um sinônimo do termo :term:`objeto arquivo`.

source: filesystem encoding and error handler
pt_br: tratador de erros e codificação do sistema de arquivos

source: Encoding and error handler used by Python to decode bytes from the operating system and encode Unicode to the operating system.
pt_br: Tratador de erros e codificação usado pelo Python para decodificar bytes do sistema operacional e codificar Unicode para o sistema operacional.

source: The filesystem encoding must guarantee to successfully decode all bytes below 128. If the file system encoding fails to provide this guarantee, API functions can raise :exc:`UnicodeError`.
pt_br: A codificação do sistema de arquivos deve garantir a decodificação bem-sucedida de todos os bytes abaixo de 128. Se a codificação do sistema de arquivos falhar em fornecer essa garantia, as funções da API podem levantar :exc:`UnicodeError`.

source: The :func:`sys.getfilesystemencoding` and :func:`sys.getfilesystemencodeerrors` functions can be used to get the filesystem encoding and error handler.
pt_br: As funções :func:`sys.getfilesystemencoding` e :func:`sys.getfilesystemencodeerrors` podem ser usadas para obter o tratador de erros e codificação do sistema de arquivos.

source: The :term:`filesystem encoding and error handler` are configured at Python startup by the :c:func:`PyConfig_Read` function: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
pt_br: O :term:`tratador de erros e codificação do sistema de arquivos` são configurados na inicialização do Python pela função :c:func:`PyConfig_Read`: veja os membros :c:member:`~PyConfig.filesystem_encoding` e :c:member:`~PyConfig.filesystem_errors` do :c:type:`PyConfig`.

source: See also the :term:`locale encoding`.
pt_br: Veja também :term:`codificação da localidade`.

source: finder
pt_br: localizador

source: An object that tries to find the :term:`loader` for a module that is being imported.
pt_br: Um objeto que tenta encontrar o :term:`carregador` para um módulo que está sendo importado.
