Repository: python/python-docs-pt-br
Catalog: license.po
Languages: pt_br

source: History and License
pt_br: História e Licença

source: History of the software
pt_br: História do software

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
pt_br: O Python foi criado no início dos anos 1990 por Guido van Rossum na Stichting Mathematisch Centrum (CWI, veja https://www.cwi.nl/) na Holanda como um sucessor de uma linguagem chamada ABC. Guido continua a ser o principal autor de Python, embora inclua muitas contribuições de outros.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
pt_br: Em 1995, Guido continuou seu trabalho em Python na Corporação para Iniciativas Nacionais de Pesquisa (CNRI, veja https://www.cnri.reston.va.us/) em Reston, Virgínia, onde lançou várias versões do software.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see https://www.zope.org/). In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
pt_br: Em maio de 2000, Guido e a equipe principal de desenvolvimento do Python mudaram-se para o BeOpen.com para formar a equipe BeOpen PythonLabs. Em outubro do mesmo ano, a equipe da PythonLabs mudou para a Digital Creations (agora Zope Corporation; veja https://www.zope.org/). Em 2001, formou-se a Python Software Foundation (PSF, ver https://www.python.org/psf/), uma organização sem fins lucrativos criada especificamente para possuir propriedade intelectual relacionada a Python. A Zope Corporation é um membro patrocinador do PSF.

source: All Python releases are Open Source (see https://opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
pt_br: Todas as versões do Python são de código aberto (consulte https://opensource.org/ para a definição de código aberto). Historicamente, a maioria, mas não todas, versões do Python também são compatíveis com GPL; a tabela abaixo resume os vários lançamentos.

source: Derived from
pt_br: Derivado de

source: Year
pt_br: Ano

source: Owner
pt_br: Proprietário

source: GPL compatible?
pt_br: GPL compatível?

source: 0.9.0 thru 1.2
pt_br: 0.9.0 a 1.2

source: yes
pt_br: sim

source: 1.3 thru 1.5.2
pt_br: 1.3 a 1.5.2

source: no
pt_br: não

source: 2.2 and above
pt_br: 2.2 e acima

source: 2001-now
pt_br: 2001-agora

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
pt_br: Compatível com GPL não significa que estamos distribuindo Python sob a GPL. Todas as licenças do Python, ao contrário da GPL, permitem distribuir uma versão modificada sem fazer alterações em código aberto. As licenças compatíveis com GPL possibilitam combinar o Python com outro software lançado sob a GPL; os outros não.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
pt_br: Graças aos muitos voluntários externos que trabalharam sob a direção de Guido para tornar esses lançamentos possíveis.

source: Terms and conditions for accessing or otherwise using Python
pt_br: Termos e condições para acessar ou usar Python

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
pt_br: ACORDO DE LICENÇA DA BEOPEN.COM PARA PYTHON 2.0

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
pt_br: CONTRATO DE LICENÇA DE FONTE ABERTA DO BEOPEN PYTHON VERSÃO 1

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
pt_br: CONTRATO DE LICENÇA DA CNRI PARA O PYTHON 1.6.1

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
pt_br: ACORDO DE LICENÇA DA CWI PARA PYTHON 0.9.0 A 1.2

source: Licenses and Acknowledgements for Incorporated Software
pt_br: Licenças e Reconhecimentos para Software Incorporado

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
pt_br: Esta seção é uma lista incompleta, mas crescente, de licenças e confirmações para softwares de terceiros incorporados na distribuição do Python.

source: The :mod:`_random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
pt_br: O módulo :mod:`_random` inclui código baseado em um download de http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. A seguir estão os comentários literais do código original::

source: The :mod:`socket` module uses the functions, :func:`getaddrinfo`, and :func:`getnameinfo`, which are coded in separate source files from the WIDE Project, http://www.wide.ad.jp/. ::
pt_br: O módulo :mod:`socket` usa as funções :func:`getaddrinfo` e :func:`getnameinfo`, que são codificadas em arquivos de origem separados do Projeto WIDE, http://www.wide.ad.jp/. ::

source: Asynchronous socket services
pt_br: Serviços de soquete assíncrono

source: The :mod:`asynchat` and :mod:`asyncore` modules contain the following notice::
pt_br: Os módulos :mod:`asynchat` e :mod:`asyncore` contêm o seguinte aviso::

source: Cookie management
pt_br: Gerenciamento de cookies

source: The :mod:`http.cookies` module contains the following notice::
pt_br: O módulo :mod:`http.cookies` contém o seguinte aviso::

source: Execution tracing
pt_br: Rastreamento de execução

source: The :mod:`trace` module contains the following notice::
pt_br: O módulo :mod:`trace` contém o seguinte aviso::

source: UUencode and UUdecode functions
pt_br: Funções UUencode e UUdecode

source: The :mod:`uu` module contains the following notice::
pt_br: O módulo :mod:`uu` contém o seguinte aviso::

source: XML Remote Procedure Calls
pt_br: Chamadas de Procedimento Remoto XML

source: The :mod:`xmlrpc.client` module contains the following notice::
pt_br: O módulo :mod:`xmlrpc.client` contém o seguinte aviso::

source: The :mod:`test_epoll` module contains the following notice::
pt_br: O módulo :mod:`test_epoll` contém o seguinte aviso::

source: Select kqueue
pt_br: Selecione o kqueue

source: The :mod:`select` module contains the following notice for the kqueue interface::
pt_br: O módulo :mod:`select` contém o seguinte aviso para a interface do kqueue::

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
pt_br: O arquivo :file:`Python/pyhash.c` contém a implementação de Marek Majkowski do algoritmo SipHash24 de Dan Bernstein. Contém a seguinte nota::

source: strtod and dtoa
pt_br: strtod e dtoa

source: The file :file:`Python/dtoa.c`, which supplies C functions dtoa and strtod for conversion of C doubles to and from strings, is derived from the file of the same name by David M. Gay, currently available from http://www.netlib.org/fp/. The original file, as retrieved on March 16, 2009, contains the following copyright and licensing notice::
pt_br: O arquivo :file:`Python/dtoa.c`, que fornece as funções C dtoa e strtod para conversão de duplas de C para e de strings, é derivado do arquivo com o mesmo nome de David M. Gay, atualmente disponível em http://www.netlib.org/fp/. O arquivo original, conforme recuperado em 16 de março de 2009, contém os seguintes avisos de direitos autorais e de licenciamento::

source: The modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and Mac OS X installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here::
pt_br: Os módulos :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` usam a biblioteca OpenSSL para desempenho adicional se forem disponibilizados pelo sistema operacional. Além disso, os instaladores do Windows e do Mac OS X para Python podem incluir uma cópia das bibliotecas do OpenSSL, portanto incluímos uma cópia da licença do OpenSSL aqui:

source: The :mod:`pyexpat` extension is built using an included copy of the expat sources unless the build is configured ``--with-system-expat``::
pt_br: A extensão :mod:`pyexpat` é construída usando uma cópia incluída das fontes de expatriadas, a menos que a compilação esteja configurada ``--with-system-expat``::

source: The :mod:`_ctypes` extension is built using an included copy of the libffi sources unless the build is configured ``--with-system-libffi``::
pt_br: A extensão :mod:`_ctypes` é construída usando uma cópia incluída das fontes libffi, a menos que a compilação esteja configurada ``--with-system-libffi``::

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
pt_br: A extensão :mod:`zlib` é construída usando uma cópia incluída das fontes zlib se a versão do zlib encontrada no sistema for muito antiga para ser usada na construção::

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
pt_br: A implementação da tabela de hash usada pelo :mod:`tracemalloc` é baseada no projeto cfuhash::

source: The :mod:`_decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
pt_br: O módulo :mod:`_decimal` é construído usando uma cópia incluída da biblioteca libmpdec, a menos que a compilação esteja configurada ``--with-system-libmpdec``::

source: W3C C14N test suite
pt_br: Conjunto de testes C14N do W3C

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license:
pt_br: O conjunto de testes C14N 2.0 no pacote :mod:`test` (``Lib/test/xmltestdata/c14n-20/``) foi recuperado do site do W3C em https://www.w3.org/TR/xml-c14n2-testcases/ e é distribuído sob a licença BSD de 3 cláusulas:

source: Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
pt_br: A redistribuição e uso nas formas de fonte e binárias, com ou sem modificação, são permitidas desde que as seguintes condições sejam atendidas:

source: Redistributions of works must retain the original copyright notice, this list of conditions and the following disclaimer.
pt_br: As redistribuições de obras devem manter o aviso de direitos autorais original, esta lista de condições e o aviso de isenção de responsabilidade a seguir.

source: Redistributions in binary form must reproduce the original copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
pt_br: As redistribuições em formato binário devem reproduzir o aviso de direitos autorais original, esta lista de condições e o aviso de isenção de responsabilidade a seguir na documentação e/ou outros materiais fornecidos com a distribuição.

source: Neither the name of the W3C nor the names of its contributors may be used to endorse or promote products derived from this work without specific prior written permission.
pt_br: Nem o nome do W3C nem os nomes de seus colaboradores podem ser usados para endossar ou promover produtos derivados deste trabalho sem permissão prévia por escrito específica.

source: THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
pt_br: ESTE SOFTWARE É FORNECIDO PELOS DETENTORES DE DIREITOS AUTORAIS E CONTRIBUIDORES "COMO ESTÁ" E QUALQUER GARANTIA EXPRESSA OU IMPLÍCITA, INCLUINDO, MAS NÃO SE LIMITANDO A, AS GARANTIAS IMPLÍCITAS DE COMERCIALIZAÇÃO E ADEQUAÇÃO A UM PROPÓSITO ESPECÍFICO. EM NENHUM CASO O DETENTOR DE DIREITOS AUTORAIS OU OS CONTRIBUIDORES SERÃO RESPONSÁVEIS POR QUALQUER DANO DIRETO, INDIRETO, INCIDENTAL, ESPECIAL, EXEMPLAR OU CONSEQUENCIAL (INCLUINDO, MAS NÃO SE LIMITANDO A, PROCURAÇÃO DE BENS OU SERVIÇOS SUBSTITUTOS; PERDA DE USO, DADOS, LUCROS DE USO; OU INTERRUPÇÃO DE NEGÓCIOS), CAUSADO E QUALQUER TEORIA DE RESPONSABILIDADE, CONTRATADA, RESPONSABILIDADE RÍGIDA OU ATRIBUIÇÃO (INCLUINDO NEGLIGÊNCIA OU DE OUTRA FORMA), SURGINDO DE ALGUMA FORMA FORA DO USO DESTE SOFTWARE, MESMO QUE SEJA ACONSELHÁVEL A POSSIBILIDADE DE TAL CONTEÚDO.
