Repository: python/python-docs-pt-br
Catalog: sphinx.po
Languages: pt_br

source: This Page
pt_br: Esta página

source: Report a Bug
pt_br: Relatar um erro

source: Show Source
pt_br: Exibir código-fonte

source: Download Python %(dl_version)s Documentation
pt_br: Download da documentação do Python %(dl_version)s

source: Last updated on: %(last_updated)s.
pt_br: Última atualização em: %(last_updated)s.

source: To download an archive containing all the documents for this version of Python in one of various formats, follow one of links in this table.
pt_br: Para baixar um arquivo contendo todos os documentos para esta versão do Python em um dos vários formatos, siga um dos links nesta tabela.

source: Format
pt_br: Formatação

source: Packed as .zip
pt_br: Compactado como .zip

source: Packed as .tar.bz2
pt_br: Compactado como .tar.bz2

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-pdf-a4.zip">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-pdf-a4.zip">Baixar</a> (%(download_size)s MiB)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-pdf-a4.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-pdf-a4.tar.bz2">Baixar</a> (%(download_size)s MiB)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-html.zip">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-html.zip">Baixar</a> (%(download_size)s MiB)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-html.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-html.tar.bz2">Baixar</a> (%(download_size)s MiB)

source: Plain text
pt_br: Texto simples

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-text.zip">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-text.zip">Baixar</a> (%(download_size)s MiB)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-text.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-text.tar.bz2">Baixar</a> (%(download_size)s MiB)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-texinfo.zip">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-texinfo.zip">Baixar</a> (%(download_size)s MiB)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-texinfo.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs-texinfo.tar.bz2">Baixar</a> (%(download_size)s MiB)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs.epub">Download</a> (ca. %(download_size)s MiB)
pt_br: <a href="%(dl_base)s/python-%(dl_version)s-docs.epub">Baixar</a> (%(download_size)s MiB)

source: These archives contain all the content in the documentation.
pt_br: Esses arquivos contêm todo o conteúdo da documentação.

source: Unpacking
pt_br: Descompactando

source: Unix users should download the .tar.bz2 archives; these are bzipped tar archives and can be handled in the usual way using tar and the bzip2 program. The <a href="https://infozip.sourceforge.net">Info-ZIP</a> unzip program can be used to handle the ZIP archives if desired. The .tar.bz2 archives provide the best compression and fastest download times.
pt_br: Usuários Unix devem baixar os arquivos .tar.bz2; estes são arquivos tar compactados com bzip2 e podem ser manipulados da maneira usual usando tar e o programa bzip2. O programa unzip do <a href="https://infozip.sourceforge.net">Info-ZIP</a> pode ser usado para manipular os arquivos ZIP se desejado. Os arquivos .tar.bz2 fornecem a melhor compressão e tempos de download mais rápidos.

source: Windows users can use the ZIP archives since those are customary on that platform. These are created on Unix using the Info-ZIP zip program.
pt_br: Usuários do Windows podem usar os arquivos ZIP, pois eles são comuns nessa plataforma. Eles são criados no Unix usando o programa zip do Info-ZIP.

source: Problems
pt_br: Problemas

source: If you have comments or suggestions for the Python documentation, please send email to <a href="mailto:docs@python.org">docs@python.org</a>.
pt_br: Se você tiver comentários ou sugestões para a documentação do Python, envie um e-mail para <a href="mailto:docs@python.org">docs@python.org</a>.

source: CPython implementation detail:
pt_br: Detalhes da implementação do CPython:

source: Deprecated since version {deprecated}, will be removed in version {removed}
pt_br: Descontinuado desde a versão {deprecated}, será removido na versão {removed}

source: Deprecated since version {deprecated}, removed in version {removed}
pt_br: Descontinuado desde a versão {deprecated}, removido na versão {removed}

source: Availability
pt_br: Disponibilidade

source: Part of the
pt_br: Parte da

source: Limited API
pt_br: API Limitada

source: Stable ABI
pt_br: ABI Estável

source: (as an opaque struct)
pt_br: (como uma estrutura opaca)

source: (including all members)
pt_br: (incluindo todos os membros)

source: since version %s
pt_br: desde a versão %s

source: (Only some members are part of the stable ABI.)
pt_br: (Somente alguns membros são parte da ABI estável.)

source: This is
pt_br: Esta é uma

source: Unstable API
pt_br: API Instável

source: . It may change without warning in minor releases.
pt_br: . Isso pode se alterado sem aviso em lançamentos menores.

source: Return value: Always NULL.
pt_br: Retorna valor: Sempre NULL.

source: Return value: New reference.
pt_br: Retorna valor: Nova referência.

source: Return value: Borrowed reference.
pt_br: Retorna valor: Referência emprestada.

source: in development
pt_br: em desenvolvimento

source: pre-release
pt_br: pré-lançamento

source: stable
pt_br: estável

source: security-fixes
pt_br: correções de segurança

source: EOL
pt_br: EOL (fim de vida)

source: Welcome! This is the official documentation for Python %(release)s.
pt_br: Seja bem-vindo! Esta é a documentação oficial do Python %(release)s.

source: Documentation sections:
pt_br: Seções da documentação:

source: What's new in Python %(version)s?
pt_br: O que há de novo no Python %(version)s?

source: Or <a href="%(whatsnew_index)s">all "What's new" documents since Python 2.0</a>
pt_br: Ou <a href="%(whatsnew_index)s">todos os documentos "O que há de novo" desde o Python 2.0</a>

source: Start here: a tour of Python's syntax and features
pt_br: Comece aqui: um passeio pela sintaxe e pelos recursos do Python

source: Library reference
pt_br: Referência da biblioteca

source: Standard library and builtins
pt_br: Biblioteca padrão e embutidos

source: Language reference
pt_br: Referência da linguagem

source: Syntax and language elements
pt_br: Sintaxe e elementos da linguagem

source: Python setup and usage
pt_br: Configurações e uso do Python

source: How to install, configure, and use Python
pt_br: Como instalar, configurar e usar o Python

source: In-depth topic manuals
pt_br: Manuais de tópicos detalhados

source: Installing Python modules
pt_br: Instalando módulos Python

source: Third-party modules and PyPI.org
pt_br: Módulos de terceiros e PyPI.org

source: Distributing Python modules
pt_br: Distribuindo módulos Python

source: Publishing modules for use by other people
pt_br: Publicando módulos para uso por outras pessoas

source: Extending and embedding
pt_br: Estendendo e incorporando

source: For C/C++ programmers
pt_br: Para programadores de C/C++

source: Python's C API
pt_br: API C do Python

source: C API reference
pt_br: Referência da API C

source: Frequently asked questions (with answers!)
pt_br: Perguntas frequentes (com respostas!)

source: Deprecations
pt_br: Descontinuações

source: Deprecated functionality
pt_br: Funcionalidade descontinuada

source: Indices, glossary, and search:
pt_br: Índices, glossário e pesquisa:

source: Global module index
pt_br: Índice global de módulos

source: All modules and libraries
pt_br: Todos os módulos e todas as bibliotecas

source: General index
pt_br: Índice geral

source: All functions, classes, and terms
pt_br: Todas funções, classes e termos

source: Glossary
pt_br: Glossário

source: Terms explained
pt_br: Termos explicados

source: Search page
pt_br: Página de busca

source: Search this documentation
pt_br: Busque nessa documentação

source: Complete table of contents
pt_br: Conteúdo completo

source: Lists all sections and subsections
pt_br: Lista todas seções e subseções

source: Project information:
pt_br: Informações do projeto:

source: Reporting issues
pt_br: Relatando problemas

source: Contributing to Docs
pt_br: Contribuindo para Docs

source: Download the documentation
pt_br: Baixar a documentação

source: History and license of Python
pt_br: História e licença do Python

source: Copyright
pt_br: Direitos autorais

source: About the documentation
pt_br: Sobre a documentação

source: Download these documents
pt_br: Baixar esses documentos

source: Docs by version
pt_br: Documentação por versão

source: Stable
pt_br: Estável

source: In development
pt_br: Em desenvolvimento

source: All versions
pt_br: Todas versões

source: Other resources
pt_br: Outros recursos

source: PEP Index
pt_br: Índice das PEPs

source: Beginner's Guide
pt_br: Guia do Iniciante

source: Book List
pt_br: Lista de Livros

source: Audio/Visual Talks
pt_br: Material Audiovisual

source: Python Developer’s Guide
pt_br: Guia do Desenvolvedor do Python

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
pt_br: Esta documentação é de uma versão antiga do Python que não é mais atualizada. Você deveria atualizar e ler a

source: Python documentation for the current stable release
pt_br: documentação do Python para versão estável atual

source: This is a deploy preview created from a <a href="%(repository_url)s/pull/%(pr_id)s">pull request</a>. For authoritative documentation, see
pt_br: Este é um deploy prévio criado a partir de um <a href="%(repository_url)s/pull/%(pr_id)s">pull request</a>. Para uma documentação oficial, veja

source: the current stable release
pt_br: o lançamento estável atual
