Repository: python/python-docs-pt-br
Catalog: extending/building.po
Languages: pt_br

source: Building C and C++ Extensions
pt_br: Construindo extensões C e C++

source: A C extension for CPython is a shared library (e.g. a ``.so`` file on Linux, ``.pyd`` on Windows), which exports an *initialization function*.
pt_br: Uma extensão C para CPython é uma biblioteca compartilhada (por exemplo, um arquivo ``.so`` no Linux, ``.pyd`` no Windows), que exporta uma *função de inicialização*.

source: To be importable, the shared library must be available on :envvar:`PYTHONPATH`, and must be named after the module name, with an appropriate extension. When using distutils, the correct filename is generated automatically.
pt_br: Para ser importável, a biblioteca compartilhada deve estar disponível em :envvar:`PYTHONPATH`, e deve ser nomeada após o nome do módulo, com uma extensão apropriada. Ao usar distutils, o nome do arquivo correto é gerado automaticamente.

source: The initialization function has the signature:
pt_br: A função de inicialização tem a assinatura:

source: It returns either a fully initialized module, or a :c:type:`PyModuleDef` instance. See :ref:`initializing-modules` for details.
pt_br: Ela retorna um módulo totalmente inicializado ou uma instância de :c:type:`PyModuleDef`. Veja :ref:`initializing-modules` para detalhes.

source: For modules with ASCII-only names, the function must be named ``PyInit_<modulename>``, with ``<modulename>`` replaced by the name of the module. When using :ref:`multi-phase-initialization`, non-ASCII module names are allowed. In this case, the initialization function name is ``PyInitU_<modulename>``, with ``<modulename>`` encoded using Python's *punycode* encoding with hyphens replaced by underscores. In Python::
pt_br: Para módulos com nomes somente ASCII, a função deve ser nomeada ``PyInit_<nomemódulo>``, com ``<nomemódulo>`` substituído pelo nome do módulo. Ao usar :ref:`multi-phase-initialization`, nomes de módulos não ASCII são permitidos. Neste caso, o nome da função de inicialização é ``PyInitU_<nomemódulo>``, com ``<nomemódulo>`` codificado usando a codificação *punycode* do Python com hifenes substituídos por sublinhados. Em Python::

source: It is possible to export multiple modules from a single shared library by defining multiple initialization functions. However, importing them requires using symbolic links or a custom importer, because by default only the function corresponding to the filename is found. See the *"Multiple modules in one library"* section in :pep:`489` for details.
pt_br: É possível exportar vários módulos de uma única biblioteca compartilhada, definindo várias funções de inicialização. No entanto, importá-los requer o uso de links simbólicos ou um importador personalizado, porque por padrão apenas a função correspondente ao nome do arquivo é encontrada. Veja a seção *"Multiple modules in one library"* na :pep:`489` para detalhes.

source: Building C and C++ Extensions with distutils
pt_br: Construindo extensões C e C ++ com distutils

source: Extension modules can be built using distutils, which is included in Python. Since distutils also supports creation of binary packages, users don't necessarily need a compiler and distutils to install the extension.
pt_br: Módulos de extensão podem ser construídos usando distutils, que está incluído no Python. Visto que distutils também suporta a criação de pacotes binários, os usuários não precisam necessariamente de um compilador e distutils para instalar a extensão.

source: A distutils package contains a driver script, :file:`setup.py`. This is a plain Python file, which, in the most simple case, could look like this:
pt_br: Um pacote distutils contém um script guia :file:`setup.py`. Este é um arquivo Python simples, que, no caso mais simples, pode ter a seguinte aparência:

source: With this :file:`setup.py`, and a file :file:`demo.c`, running ::
pt_br: Com este :file:`setup.py` e um arquivo :file:`demo.c`, executando ::

source: will compile :file:`demo.c`, and produce an extension module named ``demo`` in the :file:`build` directory. Depending on the system, the module file will end up in a subdirectory :file:`build/lib.system`, and may have a name like :file:`demo.so` or :file:`demo.pyd`.
pt_br: vai compilar :file:`demo.c`, e produzir um módulo de extensão chamado ``demo`` no diretório :file:`build`. Dependendo do sistema, o arquivo do módulo vai terminar em um subdiretório :file:`build/lib.system`, e pode ter um nome como :file:`demo.so` ou :file:`demo.pyd`.

source: In the :file:`setup.py`, all execution is performed by calling the ``setup`` function. This takes a variable number of keyword arguments, of which the example above uses only a subset. Specifically, the example specifies meta-information to build packages, and it specifies the contents of the package. Normally, a package will contain additional modules, like Python source modules, documentation, subpackages, etc. Please refer to the distutils documentation in :ref:`distutils-index` to learn more about the features of distutils; this section explains building extension modules only.
pt_br: No :file:`setup.py`, toda a execução é realizada chamando a função ``setup``. Isso leva um número variável de argumentos nomeados, dos quais o exemplo acima usa apenas um subconjunto. Especificamente, o exemplo especifica meta-informação para construir pacotes e especifica o conteúdo do pacote. Normalmente, um pacote conterá módulos adicionais, como módulos-fonte Python, documentação, subpacotes etc. Consulte a documentação do distutils em :ref:`distutils-index` para aprender mais sobre os recursos do distutils; esta seção explica apenas a construção de módulos de extensão.

source: It is common to pre-compute arguments to :func:`setup`, to better structure the driver script. In the example above, the ``ext_modules`` argument to :func:`~distutils.core.setup` is a list of extension modules, each of which is an instance of the :class:`~distutils.extension.Extension`. In the example, the instance defines an extension named ``demo`` which is build by compiling a single source file, :file:`demo.c`.
pt_br: É comum pré-computar argumentos para :func:`setup`, para melhor estruturar o script guia. No exemplo acima, o argumento ``ext_modules`` para :func:`~distutils.core.setup` é uma lista de módulos de extensão, cada um dos quais é uma instância de :class:`~distutils.extension.Extension`. No exemplo, a instância define uma extensão chamada ``demo`` que é construída compilando um único arquivo fonte, :file:`demo.c`.

source: In many cases, building an extension is more complex, since additional preprocessor defines and libraries may be needed. This is demonstrated in the example below.
pt_br: Em muitos casos, construir uma extensão é mais complexo, uma vez que definições de pré-processador adicionais e bibliotecas podem ser necessárias. Isso é demonstrado no exemplo abaixo.

source: In this example, :func:`~distutils.core.setup` is called with additional meta-information, which is recommended when distribution packages have to be built. For the extension itself, it specifies preprocessor defines, include directories, library directories, and libraries. Depending on the compiler, distutils passes this information in different ways to the compiler. For example, on Unix, this may result in the compilation commands ::
pt_br: Neste exemplo, :func:`~distutils.core.setup` é chamado com meta-informação adicional, o que é recomendado quando os pacotes de distribuição precisam ser construídos. Para a extensão em si, especifica definições de pré-processador, diretórios de inclusão, diretórios de biblioteca e bibliotecas. Dependendo do compilador, distutils passa essas informações de maneiras diferentes para o compilador. Por exemplo, no Unix, isso pode resultar nos comandos de compilação ::

source: These lines are for demonstration purposes only; distutils users should trust that distutils gets the invocations right.
pt_br: Essas linhas são apenas para fins de demonstração; Os usuários de distutils devem confiar que distutils acertará as invocações.

source: Distributing your extension modules
pt_br: Distribuindo seus módulos de extensão

source: When an extension has been successfully built, there are three ways to use it.
pt_br: Quando uma extensão é construída com sucesso, há três maneiras de usá-la.

source: End-users will typically want to install the module, they do so by running ::
pt_br: Os usuários finais normalmente desejam instalar o módulo, eles fazem isso executando ::

source: Module maintainers should produce source packages; to do so, they run ::
pt_br: Os mantenedores do módulo devem produzir pacotes fonte; para fazer isso, eles executam::

source: In some cases, additional files need to be included in a source distribution; this is done through a :file:`MANIFEST.in` file; see :ref:`manifest` for details.
pt_br: Em alguns casos, arquivos adicionais precisam ser incluídos em uma distribuição fonte; isso é feito através de um arquivo :file:`MANIFEST.in`; veja :ref:`manifest` para detalhes.

source: If the source distribution has been built successfully, maintainers can also create binary distributions. Depending on the platform, one of the following commands can be used to do so. ::
pt_br: Se a distribuição fonte foi construída com sucesso, os mantenedores também podem criar distribuições binárias. Dependendo da plataforma, um dos seguintes comandos pode ser usado para fazer isso. ::
