Repository: python/python-docs-pt-br
Catalog: extending/extending.po
Languages: pt_br

source: One difference with :c:func:`PyArg_ParseTuple`: while the latter requires its first argument to be a tuple (since Python argument lists are always represented as tuples internally), :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
pt_br: Одна відмінність із :c:func:`PyArg_ParseTuple`: у той час як останній вимагає, щоб його перший аргумент був кортежем (оскільки списки аргументів Python завжди представлені у вигляді кортежів), :c:func:`Py_BuildValue` не завжди створює кортеж . Він створює кортеж, лише якщо його рядок формату містить дві або більше одиниць формату. Якщо рядок формату порожній, повертається ``None``; якщо він містить рівно одну одиницю формату, він повертає будь-який об’єкт, описаний цією одиницею формату. Щоб змусити його повертати кортеж розміром 0 або одиницю, візьміть рядок формату в дужки.

source: Examples (to the left the call, to the right the resulting Python value):
pt_br: Приклади (ліворуч виклик, праворуч результуюче значення Python):

source: Reference Counts
pt_br: Contagens de referências

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :c:func:`malloc` and :c:func:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
pt_br: У таких мовах, як C або C++, програміст відповідає за динамічний розподіл і звільнення пам’яті в купі. У C це робиться за допомогою функцій :c:func:`malloc` і :c:func:`free`. У C++ оператори ``new`` і ``delete`` використовуються, по суті, з однаковим значенням, і ми обмежимо наступне обговорення випадком C.

source: Every block of memory allocated with :c:func:`malloc` should eventually be returned to the pool of available memory by exactly one call to :c:func:`free`. It is important to call :c:func:`free` at the right time. If a block's address is forgotten but :c:func:`free` is not called for it, the memory it occupies cannot be reused until the program terminates. This is called a :dfn:`memory leak`. On the other hand, if a program calls :c:func:`free` for a block and then continues to use the block, it creates a conflict with re-use of the block through another :c:func:`malloc` call. This is called :dfn:`using freed memory`. It has the same bad consequences as referencing uninitialized data --- core dumps, wrong results, mysterious crashes.
pt_br: Кожен блок пам’яті, виділений за допомогою :c:func:`malloc`, має бути зрештою повернений до пулу доступної пам’яті рівно одним викликом :c:func:`free`. Важливо подзвонити :c:func:`free` в потрібний час. Якщо адреса блоку забута, але :c:func:`free` не викликається для нього, пам’ять, яку він займає, не може бути повторно використана, доки програма не завершить роботу. Це називається :dfn:`витоком пам’яті`. З іншого боку, якщо програма викликає :c:func:`free` для блоку, а потім продовжує використовувати блок, це створює конфлікт із повторним використанням блоку через інший виклик :c:func:`malloc` . Це називається :dfn:`використанням звільненої пам’яті`. Це має ті ж погані наслідки, що й посилання на неініціалізовані дані --- дампи ядра, неправильні результати, таємничі збої.

source: Common causes of memory leaks are unusual paths through the code. For instance, a function may allocate a block of memory, do some calculation, and then free the block again. Now a change in the requirements for the function may add a test to the calculation that detects an error condition and can return prematurely from the function. It's easy to forget to free the allocated memory block when taking this premature exit, especially when it is added later to the code. Such leaks, once introduced, often go undetected for a long time: the error exit is taken only in a small fraction of all calls, and most modern machines have plenty of virtual memory, so the leak only becomes apparent in a long-running process that uses the leaking function frequently. Therefore, it's important to prevent leaks from happening by having a coding convention or strategy that minimizes this kind of errors.
pt_br: Typowymi przyczynami wycieków pamięci są nietypowe ścieżki przejścia przez kod. Dla przykładu, zadanie może zaalokować blok pamięci, wykonać pewne obliczenia, a potem uwolnić ten blok jeszcze raz. Teraz zmiana w wymaganiach dla zadania może dodać test do obliczenia który wykrywa warunek błędu i może wrócić wcześniej z zadania. Łatwo jest zapomnieć aby uwolnić zaalokowany blok pamięci podczas wybierania tej drogi wcześniejszego zakończenia, szczególnie gdy jest dodawane później do kodu. Takie przecieki, gdy raz wprowadzone, często uchodzą niewykryte przez długi czas: błędne wyjście jest wybierane tylko w małym wycinku wszystkich wywołań, i większość nowoczesnych maszyn ma mnóstwo wirtualnej pamięci, tak że wyciek staje się widoczny tylko w długo działającym procesie który używa cieknącego zadania często. Dlatego też, jest to ważne aby zapobiegać wyciekom przed ich nastąpieniem, przez powzięcie konwencji kodowania lub strategii która minimalizuje ten rodzaj błędu.

source: Since Python makes heavy use of :c:func:`malloc` and :c:func:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
pt_br: Оскільки Python активно використовує :c:func:`malloc` і :c:func:`free`, йому потрібна стратегія, щоб уникнути витоку пам’яті, а також використання звільненої пам’яті. Обраний метод називається :dfn:`reference counting`. Принцип простий: кожен об’єкт містить лічильник, який збільшується, коли десь зберігається посилання на об’єкт, і зменшується, коли посилання на нього видаляється. Коли лічильник досягає нуля, останнє посилання на об’єкт було видалено, а об’єкт звільнено.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :c:func:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :c:func:`malloc` and :c:func:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
pt_br: Альтернативна стратегія називається :dfn:`автоматична збірка сміття <automatic garbage collection>`. (Іноді підрахунок посилань також називають стратегією збирання сміття, тому я використовую "автоматичний", щоб відрізнити ці два.) Великою перевагою автоматичного збирання сміття є те, що користувачеві не потрібно викликати :c:func:`free` явно. (Іншою заявленою перевагою є покращення швидкості або використання пам’яті --- однак це непереконливий факт.) Недоліком є те, що для C немає справді портативного автоматичного збирача сміття, тоді як підрахунок посилань можна реалізувати портативно (за умови, що функції :c:func:`malloc` і :c:func:`free` доступні --- що гарантує стандарт C). Можливо, колись достатньо портативний автоматичний збирач сміття буде доступний для C. До того часу нам доведеться жити з кількістю посилань.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
pt_br: Podczas gdy język pytonowski używa tradycyjnego wypełnienia zliczania odniesień, on także oferuje wykrywanie cykli, które pracuje aby wykrywać cykliczne odniesienia. To pozwala aplikacjom nie martwić się o tworzenie bezpośrednich lub pośrednich cyklicznych odniesień; to są słabości wypełnienia zbiórki śmieci opartego jedynie na zliczaniu odniesień. Cykle odniesień składają się z przedmiotów które zawierają (możliwie pośrednio) odniesienia do samych siebie, tak że każdy przedmiot w cyklu ma liczbę odniesień która jest nie-zerowa. Typowe wypełnienia zliczające odniesienia nie są w stanie przejąć z powrotem pamięci należącej do któregokolwiek z przedmiotów w cyklu odniesień, ani do której odnosi się któryś z przedmiotów w cyklu, nawet jeśli nie ma więcej odniesień do cyklu samego w sobie.

source: Reference Counting in Python
pt_br: Zliczanie odniesień w języku pytonowskim

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :c:func:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :c:func:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
pt_br: Є два макроси, ``Py_INCREF(x)`` і ``Py_DECREF(x)``, які обробляють збільшення та зменшення лічильника посилань. :c:func:`Py_DECREF` також звільняє об’єкт, коли кількість досягає нуля. З міркувань гнучкості він не викликає :c:func:`free` напряму --- він робить виклик через вказівник на функцію в об’єкті :dfn:`type object`. Для цієї мети (та інших) кожен об’єкт також містить покажчик на об’єкт свого типу.

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :c:func:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :c:func:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
pt_br: Тепер залишається велике питання: коли використовувати ``Py_INCREF(x)`` і ``Py_DECREF(x)``? Давайте спочатку введемо деякі терміни. Ніхто не "володіє" об'єктом; проте ви можете :dfn:`володіти посиланням <own a reference>` на об'єкт. Кількість посилань на об’єкт тепер визначається як кількість належних посилань на нього. Власник посилання відповідає за виклик :c:func:`Py_DECREF`, коли посилання більше не потрібне. Право власності на посилання можна передати. Є три способи позбутися посилання, яке належить: передати, зберегти або викликати :c:func:`Py_DECREF`. Якщо забути позбутися посилання, що належить, це призводить до витоку пам’яті.

source: It is also possible to :dfn:`borrow` [#]_ a reference to an object. The borrower of a reference should not call :c:func:`Py_DECREF`. The borrower must not hold on to the object longer than the owner from which it was borrowed. Using a borrowed reference after the owner has disposed of it risks using freed memory and should be avoided completely [#]_.
pt_br: Також можна :dfn:`borrow` [#]_ посилання на об’єкт. Позичальник посилання не повинен викликати :c:func:`Py_DECREF`. Позичальник не повинен утримувати річ довше, ніж власник, у якого вона була позичена. Використання запозиченого посилання після того, як власник позбувся його, ризикує використати звільнену пам’ять, і його слід повністю уникати [#]_.

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
pt_br: Zaletą pożyczania ponad posiadaniem odniesienia jest to że nie potrzebujesz zaprzątać swojej uwagi pozbyciem się odniesienia na wszystkich możliwych ścieżkach przejścia przez kod --- innymi słowy, z pożyczonym odniesieniem nie musisz ryzykować wycieku gdy nastąpi przedwczesne wyjście z programu. Wadą pożyczania ponad posiadaniem jest to że istnieją pewne szczególne sytuacje gdzie w wydawałoby się poprawnym kodzie pożyczone odniesienie może być użyte po tym jak właściciel od którego zostało ono pożyczone faktycznie pozbył się go.

source: A borrowed reference can be changed into an owned reference by calling :c:func:`Py_INCREF`. This does not affect the status of the owner from which the reference was borrowed --- it creates a new owned reference, and gives full owner responsibilities (the new owner must dispose of the reference properly, as well as the previous owner).
pt_br: Позичене посилання можна змінити на власне, викликавши :c:func:`Py_INCREF`. Це не впливає на статус власника, у якого було запозичено посилання --- створюється нове посилання, яке належить, і надається повна відповідальність власника (новий власник повинен правильно розпоряджатися посиланням, як і попередній власник).

source: Ownership Rules
pt_br: Zasady właścicielskie

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
pt_br: Zawsze gdy odniesienie do przedmiotu jest przekazywane do lub z zadania, jest częścią specyfiki sprzęgu zadania to czy własność jest przekazywana z odniesieniem czy też nie.

source: Most functions that return a reference to an object pass on ownership with the reference. In particular, all functions whose function it is to create a new object, such as :c:func:`PyLong_FromLong` and :c:func:`Py_BuildValue`, pass ownership to the receiver. Even if the object is not actually new, you still receive ownership of a new reference to that object. For instance, :c:func:`PyLong_FromLong` maintains a cache of popular values and can return a reference to a cached item.
pt_br: Більшість функцій, які повертають посилання на об’єкт, передають право власності разом із посиланням. Зокрема, усі функції, функцією яких є створення нового об’єкта, такі як :c:func:`PyLong_FromLong` і :c:func:`Py_BuildValue`, передають право власності одержувачу. Навіть якщо об’єкт насправді не новий, ви все одно отримуєте право власності на нове посилання на цей об’єкт. Наприклад, :c:func:`PyLong_FromLong` підтримує кеш популярних значень і може повертати посилання на кешований елемент.

source: Many functions that extract objects from other objects also transfer ownership with the reference, for instance :c:func:`PyObject_GetAttrString`. The picture is less clear, here, however, since a few common routines are exceptions: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, and :c:func:`PyDict_GetItemString` all return references that you borrow from the tuple, list or dictionary.
pt_br: Багато функцій, які витягують об’єкти з інших об’єктів, також передають право власності разом із посиланням, наприклад :c:func:`PyObject_GetAttrString`. Однак тут картина менш зрозуміла, оскільки кілька типових процедур є винятками: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem` і :c:func:`PyDict_GetItemString` повертає всі посилання, які ви запозичили з кортежу, списку або словника.

source: The function :c:func:`PyImport_AddModule` also returns a borrowed reference, even though it may actually create the object it returns: this is possible because an owned reference to the object is stored in ``sys.modules``.
pt_br: Функція :c:func:`PyImport_AddModule` також повертає запозичене посилання, навіть якщо вона може фактично створити об’єкт, який повертає: це можливо, оскільки власне посилання на об’єкт зберігається в ``sys.modules``.

source: When you pass an object reference into another function, in general, the function borrows the reference from you --- if it needs to store it, it will use :c:func:`Py_INCREF` to become an independent owner. There are exactly two important exceptions to this rule: :c:func:`PyTuple_SetItem` and :c:func:`PyList_SetItem`. These functions take over ownership of the item passed to them --- even if they fail! (Note that :c:func:`PyDict_SetItem` and friends don't take over ownership --- they are "normal.")
pt_br: Коли ви передаєте посилання на об’єкт в іншу функцію, функція, як правило, запозичує посилання у вас --- якщо їй потрібно її зберегти, вона використовуватиме :c:func:`Py_INCREF`, щоб стати незалежним власником. З цього правила є два важливих винятки: :c:func:`PyTuple_SetItem` і :c:func:`PyList_SetItem`. Ці функції беруть на себе право власності на переданий їм елемент --- навіть якщо вони виходять з ладу! (Зауважте, що :c:func:`PyDict_SetItem` і друзі не беруть на себе право власності --- вони "нормальні".)

source: When a C function is called from Python, it borrows references to its arguments from the caller. The caller owns a reference to the object, so the borrowed reference's lifetime is guaranteed until the function returns. Only when such a borrowed reference must be stored or passed on, it must be turned into an owned reference by calling :c:func:`Py_INCREF`.
pt_br: Коли функція C викликається з Python, вона запозичує посилання на свої аргументи від викликаючого. Виклик володіє посиланням на об’єкт, тому час життя позиченого посилання гарантується до повернення функції. Лише тоді, коли таке запозичене посилання потрібно зберегти або передати, його потрібно перетворити на власне посилання шляхом виклику :c:func:`Py_INCREF`.

source: The object reference returned from a C function that is called from Python must be an owned reference --- ownership is transferred from the function to its caller.
pt_br: Odniesienie do przedmiotu zwrócone z zadania C które jest wywołane z poziomu języka pytonowskiego musi być posiadanym odniesieniem --- prawo własności jest przekazywane z zadania do wywołującego to ostatnie.

source: Thin Ice
pt_br: Cienki lód

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
pt_br: Istnieje kilka sytuacji gdzie wydawałoby się nieszkodliwe użycie pożyczonych odniesień może prowadzić do kłopotów. Wszystkie one mają do czynienia z niejawnymi wezwaniami programu interpretującego polecenia języka pytonowskiego, które mogą powodować że właściciel odniesienia pozbędzie się go.

source: The first and most important case to know about is using :c:func:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
pt_br: Перший і найважливіший випадок, про який варто знати, це використання :c:func:`Py_DECREF` для непов’язаного об’єкта під час запозичення посилання на елемент списку. Наприклад::

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
pt_br: To zadanie najpierw pożycza odniesienie do ``list[0]``, potem zamienia ``list[1]`` na wartość ``0``, i ostatecznie wypisuje pożyczone odniesienie. Wydaje się nieszkodliwe, czyż nie? A jednak jest!

source: Let's follow the control flow into :c:func:`PyList_SetItem`. The list owns references to all its items, so when item 1 is replaced, it has to dispose of the original item 1. Now let's suppose the original item 1 was an instance of a user-defined class, and let's further suppose that the class defined a :meth:`__del__` method. If this class instance has a reference count of 1, disposing of it will call its :meth:`__del__` method.
pt_br: Давайте прослідкуємо потік керування в :c:func:`PyList_SetItem`. Список має посилання на всі свої елементи, тому, коли елемент 1 замінюється, він повинен позбутися оригінального елемента 1. Тепер припустімо, що вихідний елемент 1 був екземпляром визначеного користувачем класу, і припустімо, що клас визначив метод :meth:`__del__`. Якщо цей екземпляр класу має кількість посилань 1, його видалення викличе його метод :meth:`__del__`.

source: Since it is written in Python, the :meth:`__del__` method can execute arbitrary Python code. Could it perhaps do something to invalidate the reference to ``item`` in :c:func:`bug`? You bet! Assuming that the list passed into :c:func:`bug` is accessible to the :meth:`__del__` method, it could execute a statement to the effect of ``del list[0]``, and assuming this was the last reference to that object, it would free the memory associated with it, thereby invalidating ``item``.
pt_br: Оскільки він написаний на Python, метод :meth:`__del__` може виконувати довільний код Python. Чи може це щось зробити, щоб зробити недійсним посилання на ``item`` у :c:func:`bug`? Будьте впевнені! Якщо припустити, що список, переданий у :c:func:`bug`, доступний для методу :meth:`__del__`, він міг би виконати оператор із ефектом ``del list[0]``, і припустивши, що це був останнє посилання на цей об’єкт, це звільнить пов’язану з ним пам’ять, тим самим зробивши "item" недійсним.

source: The solution, once you know the source of the problem, is easy: temporarily increment the reference count. The correct version of the function reads::
pt_br: Rozwiązanie, gdy znasz już źródło problemu, jest łatwe: tymczasowo zwiększyć ilość odniesień. Poprawna wersja zadania równa jest::

source: This is a true story. An older version of Python contained variants of this bug and someone spent a considerable amount of time in a C debugger to figure out why his :meth:`__del__` methods would fail...
pt_br: To jest prawdziwa historia. Starsza wersja języka pytonowskiego zawierała warianty tego błędu i ktoś spędził zdrowy kawałek czasu w debugerze C aby dowiedzieć się czemu jegosposoby postępowania :meth:`__del__` zawodziły...
