Repository: python/python-docs-pt-br
Catalog: extending/extending.po
Languages: pt_br

source: The :const:`METH_KEYWORDS` bit may be set in the third field if keyword arguments should be passed to the function. In this case, the C function should accept a third ``PyObject *`` parameter which will be a dictionary of keywords. Use :c:func:`PyArg_ParseTupleAndKeywords` to parse the arguments to such a function.
pt_br: Біт :const:`METH_KEYWORDS` можна встановити в третьому полі, якщо ключові аргументи повинні бути передані функції. У цьому випадку функція C повинна прийняти третій параметр ``PyObject *``, який буде словником ключових слів. Використовуйте :c:func:`PyArg_ParseTupleAndKeywords`, щоб проаналізувати аргументи такої функції.

source: The method table must be referenced in the module definition structure::
pt_br: Tabela sposobów postępowania musi być określona w strukturze definicji modułu::

source: This structure, in turn, must be passed to the interpreter in the module's initialization function. The initialization function must be named :c:func:`PyInit_name`, where *name* is the name of the module, and should be the only non-\ ``static`` item defined in the module file::
pt_br: Ця структура, у свою чергу, повинна бути передана інтерпретатору у функції ініціалізації модуля. Функція ініціалізації має мати назву :c:func:`PyInit_name`, де *name* — це ім’я модуля, і це має бути єдиний не\ ``статичний`` елемент, визначений у файлі модуля::

source: Note that PyMODINIT_FUNC declares the function as ``PyObject *`` return type, declares any special linkage declarations required by the platform, and for C++ declares the function as ``extern "C"``.
pt_br: Zauważ że PyMODINIT_FUNC deklaruje zadanie jako zwrotny typ ``PyObject *``, deklaruje wszelkie specjalne deklaracje połączeń wymagane przez maszynę/środowisko, i dla C++ deklaruje zadanie jako ``extern "C"``.

source: When the Python program imports module :mod:`spam` for the first time, :c:func:`PyInit_spam` is called. (See below for comments about embedding Python.) It calls :c:func:`PyModule_Create`, which returns a module object, and inserts built-in function objects into the newly created module based upon the table (an array of :c:type:`PyMethodDef` structures) found in the module definition. :c:func:`PyModule_Create` returns a pointer to the module object that it creates. It may abort with a fatal error for certain errors, or return ``NULL`` if the module could not be initialized satisfactorily. The init function must return the module object to its caller, so that it then gets inserted into ``sys.modules``.
pt_br: Коли програма Python імпортує модуль :mod:`spam` вперше, викликається :c:func:`PyInit_spam`. (Див. коментарі щодо вбудовування Python нижче.) Він викликає :c:func:`PyModule_Create`, який повертає об’єкт модуля та вставляє об’єкти вбудованої функції в щойно створений модуль на основі таблиці (масив :c:type:`PyMethodDef` structures), знайдений у визначенні модуля. :c:func:`PyModule_Create` повертає вказівник на об’єкт модуля, який він створює. Він може перерватися з фатальною помилкою для певних помилок або повернути ``NULL``, якщо модуль не вдалося задовільно ініціалізувати. Функція init має повернути об’єкт модуля до свого виклику, щоб потім він був вставлений у ``sys.modules``.

source: When embedding Python, the :c:func:`PyInit_spam` function is not called automatically unless there's an entry in the :c:data:`PyImport_Inittab` table. To add the module to the initialization table, use :c:func:`PyImport_AppendInittab`, optionally followed by an import of the module::
pt_br: Під час вбудовування Python функція :c:func:`PyInit_spam` не викликається автоматично, якщо немає запису в таблиці :c:data:`PyImport_Inittab`. Щоб додати модуль до таблиці ініціалізації, скористайтеся :c:func:`PyImport_AppendInittab`, необов’язково з наступним імпортом модуля::

source: Removing entries from ``sys.modules`` or importing compiled modules into multiple interpreters within a process (or following a :c:func:`fork` without an intervening :c:func:`exec`) can create problems for some extension modules. Extension module authors should exercise caution when initializing internal data structures.
pt_br: Видалення записів із ``sys.modules`` або імпортування скомпільованих модулів у кілька інтерпретаторів у межах процесу (або виконання :c:func:`fork` без втручання :c:func:`exec`) може створити проблеми для деяких розширень модулі. Авторам модулів розширення слід бути обережними під час ініціалізації внутрішніх структур даних.

source: A more substantial example module is included in the Python source distribution as :file:`Modules/xxmodule.c`. This file may be used as a template or simply read as an example.
pt_br: Bardziej konkretny przykład modułu jest załączony w dystrybucji źródeł języka pytonowskiego jako plik :file:`Modules/xxmodule.c`. Ten plik może być użyty jako wzór lub po prostu czytany jako przykład.

source: Unlike our ``spam`` example, ``xxmodule`` uses *multi-phase initialization* (new in Python 3.5), where a PyModuleDef structure is returned from ``PyInit_spam``, and creation of the module is left to the import machinery. For details on multi-phase initialization, see :PEP:`489`.
pt_br: На відміну від нашого прикладу ``спаму``, ``xxmodule`` використовує *багатофазову ініціалізацію* (нове в Python 3.5), де структура PyModuleDef повертається з ``PyInit_spam``, а створення модуля залишається за імпортне обладнання. Докладніше про багатофазову ініціалізацію див. :PEP:`489`.

source: Compilation and Linkage
pt_br: Kompilacja i łączenie

source: There are two more things to do before you can use your new extension: compiling and linking it with the Python system. If you use dynamic loading, the details may depend on the style of dynamic loading your system uses; see the chapters about building extension modules (chapter :ref:`building`) and additional information that pertains only to building on Windows (chapter :ref:`building-on-windows`) for more information about this.
pt_br: Są jeszcze dwie rzeczy które trzeba zrobić zanim będzie można użyć nowego rozszerzenia: skompilowanie go i podłączenie z systemem Pythona. Jeśli używasz dynamicznego ładowania, szczegóły mogą zależeć od stylu dynamicznego ładowania którego twój system używa; zobacz rozdział o budowaniu rozszerzających modułów (rozdział :ref:`building`) i dodatkowe informacje które odnoszą się tylko do budowania w Windows (rozdział :ref:`building-on-windows`) po więcej informacji na ten temat.

source: If you can't use dynamic loading, or if you want to make your module a permanent part of the Python interpreter, you will have to change the configuration setup and rebuild the interpreter. Luckily, this is very simple on Unix: just place your file (:file:`spammodule.c` for example) in the :file:`Modules/` directory of an unpacked source distribution, add a line to the file :file:`Modules/Setup.local` describing your file:
pt_br: Якщо ви не можете використовувати динамічне завантаження або якщо ви хочете зробити свій модуль постійною частиною інтерпретатора Python, вам доведеться змінити налаштування конфігурації та перебудувати інтерпретатор. На щастя, в Unix це дуже просто: просто розмістіть свій файл (наприклад, :file:`spammodule.c`) у каталозі :file:`Modules/` розпакованого вихідного дистрибутива, додайте рядок до файлу :file:`Modules/Setup.local`, що описує ваш файл:

source: and rebuild the interpreter by running :program:`make` in the toplevel directory. You can also run :program:`make` in the :file:`Modules/` subdirectory, but then you must first rebuild :file:`Makefile` there by running ':program:`make` Makefile'. (This is necessary each time you change the :file:`Setup` file.)
pt_br: i przebuduj program interpretujący przez uruchomienie programu :program:`make` w katalogu głównym instalacji. Możesz także uruchomić program :program:`make` w podkatalogu :file:`Modules/`, ale wtedy musisz najpierw przebudować plik :file:`Makefile` tam przez uruchomienie programu :program:`make` Makefile'. To jest konieczne za każdym razem gdy zmieniasz plik :file:`Setup`.)

source: If your module requires additional libraries to link with, these can be listed on the line in the configuration file as well, for instance:
pt_br: Якщо вашому модулю потрібні додаткові бібліотеки для зв’язування, їх також можна вказати в рядку у файлі конфігурації, наприклад:

source: Calling Python Functions from C
pt_br: Wywoływanie zadań języka pytonowskiego z C

source: So far we have concentrated on making C functions callable from Python. The reverse is also useful: calling Python functions from C. This is especially the case for libraries that support so-called "callback" functions. If a C interface makes use of callbacks, the equivalent Python often needs to provide a callback mechanism to the Python programmer; the implementation will require calling the Python callback functions from a C callback. Other uses are also imaginable.
pt_br: Jak do tej pory koncentrowaliśmy się na uczynieniu zadań C możliwymi do wywołania z poziomu języka pytonowskiego. Odwrotna sytuacja jest także użyteczna: wywoływanie zadań języka pytonowskiego z poziomu języka C. To w szczególności odnosi się do bibliotek które wspierają tak zwane zadania "callback" wstecznie wywołujące. Jeśli sprzęg C używa zadań wstecznie wywołujących, odpowiednik języka pytonowskiego często potrzebuje dostarczyć mechanizm wstecznego wywołania dla programisty języka pytonowskiego; wypełnienie będzie potrzebowało wzywać zadania wywołania wstecznego z poziomu wstecznego C. Inne przypadki są także możliwe do wyobrażenia.

source: Fortunately, the Python interpreter is easily called recursively, and there is a standard interface to call a Python function. (I won't dwell on how to call the Python parser with a particular string as input --- if you're interested, have a look at the implementation of the :option:`-c` command line option in :file:`Modules/main.c` from the Python source code.)
pt_br: Szczęśliwie, program interpretujący polecenia języka pytonowskiego jest łatwo wywoływany rekursywnie i istnieje standardowy sprzęg aby wywołać zadanie języka pytonowskiego. (Nie będę rozpisywał się o tym jak wywołać czytnik języka pytonowskiego z konkretnym ciągiem znaków na wejściu --- jeśli jesteś zainteresowany, spójrz na wypełnienie opcji :option:`-c` wiersza polecenia w :file:`Modules/main.c` z kodu źródłowego języka pytonowskiego.)

source: Calling a Python function is easy. First, the Python program must somehow pass you the Python function object. You should provide a function (or some other interface) to do this. When this function is called, save a pointer to the Python function object (be careful to :c:func:`Py_INCREF` it!) in a global variable --- or wherever you see fit. For example, the following function might be part of a module definition::
pt_br: Викликати функцію Python легко. По-перше, програма Python повинна якимось чином передати вам об’єкт функції Python. Ви повинні надати функцію (або інший інтерфейс), щоб це зробити. Під час виклику цієї функції збережіть вказівник на об’єкт функції Python (будьте обережні, щоб :c:func:`Py_INCREF` це!) у глобальній змінній --- або будь-де, де ви вважаєте за потрібне. Наприклад, наступна функція може бути частиною визначення модуля:

source: This function must be registered with the interpreter using the :const:`METH_VARARGS` flag; this is described in section :ref:`methodtable`. The :c:func:`PyArg_ParseTuple` function and its arguments are documented in section :ref:`parsetuple`.
pt_br: Ця функція має бути зареєстрована в інтерпретаторі за допомогою прапорця :const:`METH_VARARGS`; це описано в розділі :ref:`methodtable`. Функція :c:func:`PyArg_ParseTuple` та її аргументи описані в розділі :ref:`parsetuple`.

source: The macros :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of ``NULL`` pointers (but note that *temp* will not be ``NULL`` in this context). More info on them in section :ref:`refcounts`.
pt_br: Макроси :c:func:`Py_XINCREF` і :c:func:`Py_XDECREF` збільшують/зменшують кількість посилань на об’єкт і безпечні за наявності покажчиків ``NULL`` (але зауважте, що *temp* не буде бути ``NULL`` у цьому контексті). Детальніше про них у розділі :ref:`refcounts`.

source: Later, when it is time to call the function, you call the C function :c:func:`PyObject_CallObject`. This function has two arguments, both pointers to arbitrary Python objects: the Python function, and the argument list. The argument list must always be a tuple object, whose length is the number of arguments. To call the Python function with no arguments, pass in ``NULL``, or an empty tuple; to call it with one argument, pass a singleton tuple. :c:func:`Py_BuildValue` returns a tuple when its format string consists of zero or more format codes between parentheses. For example::
pt_br: Пізніше, коли прийде час викликати функцію, ви викликаєте функцію C :c:func:`PyObject_CallObject`. Ця функція має два аргументи, обидва вказують на довільні об’єкти Python: функція Python і список аргументів. Список аргументів завжди має бути об’єктом кортежу, довжина якого дорівнює кількості аргументів. Щоб викликати функцію Python без аргументів, передайте ``NULL`` або пустий кортеж; щоб викликати його з одним аргументом, передайте одиночний кортеж. :c:func:`Py_BuildValue` повертає кортеж, якщо його рядок формату складається з нуля або більше кодів формату в дужках. Наприклад::

source: :c:func:`PyObject_CallObject` returns a Python object pointer: this is the return value of the Python function. :c:func:`PyObject_CallObject` is "reference-count-neutral" with respect to its arguments. In the example a new tuple was created to serve as the argument list, which is :c:func:`Py_DECREF`\ -ed immediately after the :c:func:`PyObject_CallObject` call.
pt_br: :c:func:`PyObject_CallObject` повертає покажчик на об’єкт Python: це значення, яке повертає функція Python. :c:func:`PyObject_CallObject` є "нейтральним щодо кількості посилань" щодо своїх аргументів. У прикладі було створено новий кортеж, який слугуватиме списком аргументів, який :c:func:`Py_DECREF`\ -редагується відразу після виклику :c:func:`PyObject_CallObject`.

source: The return value of :c:func:`PyObject_CallObject` is "new": either it is a brand new object, or it is an existing object whose reference count has been incremented. So, unless you want to save it in a global variable, you should somehow :c:func:`Py_DECREF` the result, even (especially!) if you are not interested in its value.
pt_br: Значення, що повертається :c:func:`PyObject_CallObject`, є "новим": або це абсолютно новий об’єкт, або це вже існуючий об’єкт, кількість посилань на який було збільшено. Отже, якщо ви не хочете зберегти його в глобальній змінній, ви повинні якимось чином :c:func:`Py_DECREF` результат, навіть (особливо!), якщо вас не цікавить його значення.

source: Before you do this, however, it is important to check that the return value isn't ``NULL``. If it is, the Python function terminated by raising an exception. If the C code that called :c:func:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :c:func:`PyErr_Clear`. For example::
pt_br: Однак перед тим, як це зробити, важливо переконатися, що значення, що повертається, не ``NULL``. Якщо так, функція Python припиняється, викликаючи виняток. Якщо код C, який викликав :c:func:`PyObject_CallObject`, викликається з Python, тепер він має повернути вказівку про помилку своєму виклику Python, щоб інтерпретатор міг надрукувати трасування стека, або викликаючий код Python міг обробити виняткову ситуацію. Якщо це неможливо чи бажано, виняток слід очистити, викликавши :c:func:`PyErr_Clear`. Наприклад::

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :c:func:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :c:func:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
pt_br: Залежно від бажаного інтерфейсу для функції зворотного виклику Python, вам також може знадобитися надати список аргументів для :c:func:`PyObject_CallObject`. У деяких випадках список аргументів також надається програмою Python через той самий інтерфейс, який вказав функцію зворотного виклику. Потім його можна зберегти та використовувати так само, як і об’єкт функції. В інших випадках вам, можливо, доведеться створити новий кортеж для передачі як списку аргументів. Найпростіший спосіб зробити це — викликати :c:func:`Py_BuildValue`. Наприклад, якщо ви хочете передати інтегральний код події, ви можете використати такий код:

source: Note the placement of ``Py_DECREF(arglist)`` immediately after the call, before the error check! Also note that strictly speaking this code is not complete: :c:func:`Py_BuildValue` may run out of memory, and this should be checked.
pt_br: Зверніть увагу на розміщення ``Py_DECREF(arglist)`` одразу після виклику, перед перевіркою помилок! Також зауважте, що строго кажучи, цей код неповний: :c:func:`Py_BuildValue` може не вистачати пам’яті, і це слід перевірити.

source: You may also call a function with keyword arguments by using :c:func:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :c:func:`Py_BuildValue` to construct the dictionary. ::
pt_br: Ви також можете викликати функцію з ключовими аргументами за допомогою :c:func:`PyObject_Call`, який підтримує аргументи та ключові аргументи. Як і в наведеному вище прикладі, ми використовуємо :c:func:`Py_BuildValue` для створення словника. ::

source: Extracting Parameters in Extension Functions
pt_br: Wydobywanie parametrów w zadaniach rozszerzających

source: The :c:func:`PyArg_ParseTuple` function is declared as follows::
pt_br: Функція :c:func:`PyArg_ParseTuple` оголошується таким чином:

source: The *arg* argument must be a tuple object containing an argument list passed from Python to a C function. The *format* argument must be a format string, whose syntax is explained in :ref:`arg-parsing` in the Python/C API Reference Manual. The remaining arguments must be addresses of variables whose type is determined by the format string.
pt_br: Parametr *arg* musi być przedmiotem - krotką zawierającym listę parametrów z języka pytonowskiego dla zadania C. Parametr *format* musi być ciągiem formatu, którego składnia jest wyjaśniona w :ref:`arg-parsing` w podręczniku użytkownika API Python/C. Pozostałe parametry muszą być adresami zmiennych których rodzaj jest określony przez ciąg formatujący.

source: Note that while :c:func:`PyArg_ParseTuple` checks that the Python arguments have the required types, it cannot check the validity of the addresses of C variables passed to the call: if you make mistakes there, your code will probably crash or at least overwrite random bits in memory. So be careful!
pt_br: Зауважте, що хоча :c:func:`PyArg_ParseTuple` перевіряє, чи аргументи Python мають необхідні типи, він не може перевірити дійсність адрес змінних C, переданих до виклику: якщо ви припуститеся там помилки, ваш код, ймовірно, аварійно завершить роботу. найменше перезаписувати випадкові біти в пам'яті. Тому будьте обережні!

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
pt_br: Note que quaisquer referências a objeto Python que são fornecidas ao chamador são referências *emprestadas*; não decremente a contagem de referências delas!

source: Some example calls::
pt_br: Pewne przykładowe wywołania::

source: Keyword Parameters for Extension Functions
pt_br: Parametry kluczowe dla zadań rozszerzających

source: The :c:func:`PyArg_ParseTupleAndKeywords` function is declared as follows::
pt_br: Функція :c:func:`PyArg_ParseTupleAndKeywords` оголошується таким чином:

source: The *arg* and *format* parameters are identical to those of the :c:func:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a ``NULL``-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :c:func:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
pt_br: Параметри *arg* і *format* ідентичні параметрам функції :c:func:`PyArg_ParseTuple`. Параметр *kwdict* — це словник ключових слів, отриманий як третій параметр із середовища виконання Python. Параметр *kwlist* — це список рядків, що завершуються ``NULL`` і ідентифікують параметри; імена зіставляються з інформацією про тип із *format* зліва направо. У разі успіху :c:func:`PyArg_ParseTupleAndKeywords` повертає true, інакше повертає false і викликає відповідний виняток.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
pt_br: Zagnieżdźone krotki nie mogą być wczytane gdy używane są parametry słów kluczowych! Parametry słów kluczowych przekazane do zadania które nie są obecne na liście *kwlist* spowodują że wyjątek :exc:`TypeError` zostanie zgłoszony.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
pt_br: Tu jest przykładowy moduł który używa słów kluczowych, oparty na przykładzie Geoffa Philbricka (philbrick@hks.com)::

source: Building Arbitrary Values
pt_br: Budowanie dowolnych wartości

source: This function is the counterpart to :c:func:`PyArg_ParseTuple`. It is declared as follows::
pt_br: Ця функція є аналогом :c:func:`PyArg_ParseTuple`. Це оголошено наступним чином:

source: It recognizes a set of format units similar to the ones recognized by :c:func:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
pt_br: Він розпізнає набір одиниць формату, подібних до тих, які розпізнає :c:func:`PyArg_ParseTuple`, але аргументи (які є вхідними для функції, а не виведеними) не повинні бути вказівниками, а просто значеннями. Він повертає новий об’єкт Python, придатний для повернення з функції C, викликаної з Python.
