Repository: python/python-docs-pt-br
Catalog: extending/extending.po
Languages: pt_br

source: Extending Python with C or C++
pt_br: Estendendo Python com C ou C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
pt_br: É muito fácil adicionar novos módulos embutidos ao Python, se você souber programar em C. Você pode adicionar :dfn:`módulos de extensão` para fazer duas coisas que não podem ser feitas diretamente no Python: eles podem implementar novos nos tipos de objetos embutidos e eles podem chamar funções da biblioteca C e chamadas do sistema.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
pt_br: Para dar suporte a extensões, a API do Python API (Application Programmers Interface) define um conjunto de funções, macros e variáveis que fornecem acesso à maior parte dos aspectos do sistema de tempo de execução do Python. A API do Python pode ser incorporada em um arquivo fonte em C com a inclusão do cabeçalho ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
pt_br: A compilação de um módulo de extensão depende do uso pretendido e da configuração do sistema; detalhes serão dados nos próximos capítulos.

source: The C extension interface is specific to CPython, and extension modules do not work on other Python implementations. In many cases, it is possible to avoid writing C extensions and preserve portability to other implementations. For example, if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module or the `cffi <https://cffi.readthedocs.io/>`_ library rather than writing custom C code. These modules let you write Python code to interface with C code and are more portable between implementations of Python than writing and compiling a C extension module.
pt_br: A interface de extensões em C é específica para o CPython, e módulos de extensão não funcionam em outras implementações do Python. Em muitos casos, é possível evitar a criação destas extensões em C e preservar a portabilidade para outras implementações. Por exemplo, se o seu caso de uso for o de fazer chamadas a funções em bibliotecas C ou chamadas de sistema, considere utilizar o módulo :mod:`ctypes` ou a biblioteca `cffi <https://cffi.readthedocs.io/>`_ ao invés de escrever código C personalizado. Esses módulos permitem escrever código Python que pode interoperar com código C e que é mais portável entre implementações do Python do que escrever e compilar um módulo de extensão em C.

source: A Simple Example
pt_br: Um Exemplo Simples

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :c:func:`system` [#]_. This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows:
pt_br: Vamos criar um módulo de extensão chamado ``spam`` (a comida favorita dos fãs de Monty Python...) e digamos que nosso objetivo seja criar uma interface em Python para a função da biblioteca C :c:func:`system` [#]_. Essa função toma uma string de caracteres terminada em nulo como argumento e retorna um número inteiro. Queremos que essa função seja chamável a partir do Python como abaixo:

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
pt_br: Comece criando um arquivo chamado :file:`spammodule.c`. (Historicamente, se um módulo for chamado ``spam``, o arquivo C contendo sua implementação é chamado :file:`spammodule.c`; se o nome do módulo for muito longo, como ``spammify``, o nome do arquivo pode ser só :file:`spammify.c`.)

source: The first two lines of our file can be::
pt_br: As duas primeiras linhas do nosso arquivo podem ser::

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
pt_br: o que carrega a API do Python (você pode adicionar um comentário descrevendo o propósito do módulo e uma nota de copyright, se desejar).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
pt_br: Uma vez que Python pode definir algumas definições de pré-processador que afetam os cabeçalhos padrão em alguns sistemas, você *deve* incluir :file:`Python.h` antes de quaisquer cabeçalhos padrão serem incluídos.

source: It is recommended to always define ``PY_SSIZE_T_CLEAN`` before including ``Python.h``. See :ref:`parsetuple` for a description of this macro.
pt_br: É recomendado sempre definir ``PY_SSIZE_T_CLEAN`` antes de incluir ``Python.h``. Veja :ref:`parsetuple` para uma descrição desse macro.

source: All user-visible symbols defined by :file:`Python.h` have a prefix of ``Py`` or ``PY``, except those defined in standard header files. For convenience, and since they are used extensively by the Python interpreter, ``"Python.h"`` includes a few standard header files: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, and ``<stdlib.h>``. If the latter header file does not exist on your system, it declares the functions :c:func:`malloc`, :c:func:`free` and :c:func:`realloc` directly.
pt_br: Усі видимі користувачем символи, визначені :file:`Python.h`, мають префікс ``Py`` або ``PY``, за винятком тих, що визначені у стандартних файлах заголовків. Для зручності та оскільки вони широко використовуються інтерпретатором Python, ``"Python.h"`` містить кілька стандартних файлів заголовків: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, і ``<stdlib.h>``. Якщо останнього файлу заголовка не існує у вашій системі, він безпосередньо оголошує функції :c:func:`malloc`, :c:func:`free` і :c:func:`realloc`.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
pt_br: Następną rzeczą którą dodajemy do naszego pliku modułu jest zadanie C które będzie wzywane gdy wyrażenie języka pytonowskiego ``spam.system(string)`` zostanie obliczone (zobaczymy niedługo, jak to się kończy wywołaniem)::

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
pt_br: Istnieje prosta zamiana nazw z listy parametrów w języku pytonowskim (dla przykładu, pojedyncze wyrażenie ``"ls -l"``) do parametrów przekazanych do zadania C. Zadanie C zawsze ma dwa parametry, dla wygody nazywane *sam* - z ang. - *self* i *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
pt_br: Parametr *sam* - z ang. - *self* - wskazuje na przedmiot modułu dla zadań na poziomie-modułu; dla sposobu postępowania wskazywałby na przykład przedmiotu.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :c:func:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
pt_br: Аргумент *args* буде вказівником на об’єкт кортежу Python, що містить аргументи. Кожен елемент кортежу відповідає аргументу в списку аргументів виклику. Аргументи є об’єктами Python --- щоб щось робити з ними в нашій функції C, ми повинні перетворити їх на значення C. Функція :c:func:`PyArg_ParseTuple` в API Python перевіряє типи аргументів і перетворює їх на значення C. Він використовує рядок шаблону для визначення необхідних типів аргументів, а також типів змінних C, у яких зберігатимуться перетворені значення. Про це пізніше.

source: :c:func:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return ``NULL`` immediately (as we saw in the example).
pt_br: :c:func:`PyArg_ParseTuple` повертає істину (не нуль), якщо всі аргументи мають правильний тип і його компоненти зберігаються в змінних, адреси яких передано. Він повертає false (нуль), якщо було передано недійсний список аргументів. В останньому випадку він також викликає відповідний виняток, щоб функція, що викликає, могла негайно повернути ``NULL`` (як ми бачили в прикладі).

source: Intermezzo: Errors and Exceptions
pt_br: Intermezzo: Błędy i Wyjątki

source: An important convention throughout the Python interpreter is the following: when a function fails, it should set an exception condition and return an error value (usually ``-1`` or a ``NULL`` pointer). Exception information is stored in three members of the interpreter's thread state. These are ``NULL`` if there is no exception. Otherwise they are the C equivalents of the members of the Python tuple returned by :meth:`sys.exc_info`. These are the exception type, exception instance, and a traceback object. It is important to know about them to understand how errors are passed around.
pt_br: Важлива конвенція в інтерпретаторі Python полягає в наступному: коли функція виходить з ладу, вона повинна встановити умову винятку та повернути значення помилки (зазвичай ``-1`` або ``NULL`` покажчик). Інформація про винятки зберігається в трьох членах стану потоку інтерпретатора. Це ``NULL``, якщо немає винятку. В іншому випадку вони є еквівалентами C членів кортежу Python, які повертає :meth:`sys.exc_info`. Це тип винятку, екземпляр винятку та об’єкт трасування. Важливо знати про них, щоб зрозуміти, як передаються помилки.

source: The Python API defines a number of functions to set various types of exceptions.
pt_br: Sprzęg języka pytonowskiego określa pewien zestaw zadań do ustawiania różnych rodzajów wyjątków.

source: The most common one is :c:func:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :c:data:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
pt_br: Найпоширенішим є :c:func:`PyErr_SetString`. Його аргументами є об’єкт винятку та рядок C. Об’єкт винятку зазвичай є попередньо визначеним об’єктом, наприклад :c:data:`PyExc_ZeroDivisionError`. Рядок C вказує на причину помилки, перетворюється на об’єкт рядка Python і зберігається як "пов’язане значення" винятку.

source: Another useful function is :c:func:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :c:data:`errno`. The most general function is :c:func:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :c:func:`Py_INCREF` the objects passed to any of these functions.
pt_br: Іншою корисною функцією є :c:func:`PyErr_SetFromErrno`, яка приймає лише аргумент винятку та створює пов’язане значення шляхом перевірки глобальної змінної :c:data:`errno`. Найбільш загальною функцією є :c:func:`PyErr_SetObject`, яка приймає два аргументи об’єкта, виняток і пов’язане з ним значення. Вам не потрібно :c:func:`Py_INCREF` об’єкти, передані в будь-яку з цих функцій.

source: You can test non-destructively whether an exception has been set with :c:func:`PyErr_Occurred`. This returns the current exception object, or ``NULL`` if no exception has occurred. You normally don't need to call :c:func:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
pt_br: За допомогою :c:func:`PyErr_Occurred` можна неруйнівним чином перевірити, чи встановлено виняток. Це повертає поточний об’єкт винятку або ``NULL``, якщо винятку не сталося. Зазвичай вам не потрібно викликати :c:func:`PyErr_Occurred`, щоб перевірити, чи сталася помилка під час виклику функції, оскільки ви зможете визначити це за значенням, що повертається.

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :c:func:`PyErr_Clear`. The only time C code should call :c:func:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
pt_br: Щоб проігнорувати виняток, встановлений невдалим викликом функції, умову виключення потрібно явно очистити, викликавши :c:func:`PyErr_Clear`. Єдиний раз, коли C-код повинен викликати :c:func:`PyErr_Clear`, це якщо він не хоче передавати помилку інтерпретатору, а хоче обробити її повністю сам (можливо, спробувавши щось інше або вдаючи, що нічого не пішло не так). ).

source: Every failing :c:func:`malloc` call must be turned into an exception --- the direct caller of :c:func:`malloc` (or :c:func:`realloc`) must call :c:func:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :c:func:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :c:func:`malloc` directly.
pt_br: Кожен невдалий виклик :c:func:`malloc` має бути перетворений на виняток --- прямий виклик :c:func:`malloc` (або :c:func:`realloc`) повинен викликати :c:func:`PyErr_NoMemory` і повертає сам індикатор помилки. Усі функції створення об’єктів (наприклад, :c:func:`PyLong_FromLong`) уже це роблять, тому ця примітка актуальна лише для тих, хто викликає :c:func:`malloc` безпосередньо.

source: Also note that, with the important exception of :c:func:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
pt_br: Також зауважте, що, за винятком :c:func:`PyArg_ParseTuple` та друзів, функції, які повертають цілочисельний статус, зазвичай повертають додатне значення або нуль у разі успіху та ``-1`` у разі невдачі, як системні виклики Unix.

source: Finally, be careful to clean up garbage (by making :c:func:`Py_XDECREF` or :c:func:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
pt_br: Нарешті, будьте обережні, щоб очистити сміття (за допомогою викликів :c:func:`Py_XDECREF` або :c:func:`Py_DECREF` для об’єктів, які ви вже створили), коли ви повертаєте індикатор помилки!

source: The choice of which exception to raise is entirely yours. There are predeclared C objects corresponding to all built-in Python exceptions, such as :c:data:`PyExc_ZeroDivisionError`, which you can use directly. Of course, you should choose exceptions wisely --- don't use :c:data:`PyExc_TypeError` to mean that a file couldn't be opened (that should probably be :c:data:`PyExc_IOError`). If something's wrong with the argument list, the :c:func:`PyArg_ParseTuple` function usually raises :c:data:`PyExc_TypeError`. If you have an argument whose value must be in a particular range or must satisfy other conditions, :c:data:`PyExc_ValueError` is appropriate.
pt_br: Вибір, який виняток підняти, повністю залежить від вас. Існують попередньо оголошені об’єкти C, що відповідають усім вбудованим виняткам Python, наприклад :c:data:`PyExc_ZeroDivisionError`, які можна використовувати безпосередньо. Звичайно, ви повинні вибирати винятки з розумом --- не використовуйте :c:data:`PyExc_TypeError`, щоб означати, що файл не вдалося відкрити (це, ймовірно, має бути :c:data:`PyExc_IOError`). Якщо щось не так зі списком аргументів, функція :c:func:`PyArg_ParseTuple` зазвичай викликає :c:data:`PyExc_TypeError`. Якщо у вас є аргумент, значення якого має бути в певному діапазоні або має задовольняти інші умови, :c:data:`PyExc_ValueError` підходить.

source: You can also define a new exception that is unique to your module. For this, you usually declare a static object variable at the beginning of your file::
pt_br: Możesz też określić nowy wyjątek który jest niepowtarzalny dla twojego modułu. Dla tego, zwykle deklarujesz przedmiot statycznej zmiennej na początku pliku::

source: and initialize it in your module's initialization function (:c:func:`PyInit_spam`) with an exception object::
pt_br: та ініціалізуйте його у функції ініціалізації вашого модуля (:c:func:`PyInit_spam`) за допомогою об’єкта винятку::

source: Note that the Python name for the exception object is :exc:`spam.error`. The :c:func:`PyErr_NewException` function may create a class with the base class being :exc:`Exception` (unless another class is passed in instead of ``NULL``), described in :ref:`bltin-exceptions`.
pt_br: Зауважте, що ім’я Python для об’єкта винятку – :exc:`spam.error`. Функція :c:func:`PyErr_NewException` може створити клас із базовим класом :exc:`Exception` (якщо інший клас не передано замість ``NULL``), описано в :ref:`bltin-exceptions`.

source: Note also that the :c:data:`SpamError` variable retains a reference to the newly created exception class; this is intentional! Since the exception could be removed from the module by external code, an owned reference to the class is needed to ensure that it will not be discarded, causing :c:data:`SpamError` to become a dangling pointer. Should it become a dangling pointer, C code which raises the exception could cause a core dump or other unintended side effects.
pt_br: Зауважте також, що змінна :c:data:`SpamError` зберігає посилання на щойно створений клас винятків; це навмисно! Оскільки виняток може бути видалено з модуля за допомогою зовнішнього коду, потрібне власне посилання на клас, щоб гарантувати, що його не буде відкинуто, через що :c:data:`SpamError` стане висячим покажчиком. Якщо він стане висячим покажчиком, код C, який викликає виняток, може спричинити дамп ядра або інші небажані побічні ефекти.

source: We discuss the use of ``PyMODINIT_FUNC`` as a function return type later in this sample.
pt_br: Далі в цьому зразку ми обговорюємо використання ``PyMODINIT_FUNC`` як типу повернення функції.

source: The :exc:`spam.error` exception can be raised in your extension module using a call to :c:func:`PyErr_SetString` as shown below::
pt_br: Виняток :exc:`spam.error` можна викликати у вашому модулі розширення за допомогою виклику :c:func:`PyErr_SetString`, як показано нижче::

source: Back to the Example
pt_br: Z powrotem do Przykładu

source: Going back to our example function, you should now be able to understand this statement::
pt_br: Wracając do naszej przykładowego zadania, powinieneś już być w stanie zrozumieć to wyrażenie::

source: It returns ``NULL`` (the error indicator for functions returning object pointers) if an error is detected in the argument list, relying on the exception set by :c:func:`PyArg_ParseTuple`. Otherwise the string value of the argument has been copied to the local variable :c:data:`command`. This is a pointer assignment and you are not supposed to modify the string to which it points (so in Standard C, the variable :c:data:`command` should properly be declared as ``const char *command``).
pt_br: Він повертає ``NULL`` (індикатор помилки для функцій, що повертають вказівники на об’єкти), якщо помилка виявлена в списку аргументів, покладаючись на виняток, встановлений :c:func:`PyArg_ParseTuple`. В іншому випадку рядкове значення аргументу було скопійовано до локальної змінної :c:data:`command`. Це призначення вказівника, і ви не повинні змінювати рядок, на який він вказує (тому в Standard C змінна :c:data:`command` має бути правильно оголошена як ``const char *command``).

source: The next statement is a call to the Unix function :c:func:`system`, passing it the string we just got from :c:func:`PyArg_ParseTuple`::
pt_br: Наступний оператор — це виклик функції Unix :c:func:`system`, передаючи їй рядок, який ми щойно отримали з :c:func:`PyArg_ParseTuple`::

source: Our :func:`spam.system` function must return the value of :c:data:`sts` as a Python object. This is done using the function :c:func:`PyLong_FromLong`. ::
pt_br: Наша функція :func:`spam.system` має повертати значення :c:data:`sts` як об’єкт Python. Це робиться за допомогою функції :c:func:`PyLong_FromLong`. ::

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
pt_br: W tym przypadku, zwróci przedmiot liczby całkowitej (Tak, nawet liczby całkowite są przedmiotami na stercie w języku pytonowskim!)

source: :c:data:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a ``NULL`` pointer, which means "error" in most contexts, as we have seen.
pt_br: :c:data:`Py_None` — це ім’я C для спеціального об’єкта Python ``None``. Це справжній об’єкт Python, а не покажчик ``NULL``, що означає "помилку" в більшості контекстів, як ми бачили.

source: The Module's Method Table and Initialization Function
pt_br: Zadanie zainicjowania i tabela sposobów postępowania modułu.

source: I promised to show how :c:func:`spam_system` is called from Python programs. First, we need to list its name and address in a "method table"::
pt_br: Я обіцяв показати, як :c:func:`spam_system` викликається з програм Python. По-перше, нам потрібно вказати його назву та адресу в "таблиці методів"::

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :c:func:`PyArg_ParseTuple` is used.
pt_br: Зверніть увагу на третій запис (``METH_VARARGS``). Це прапорець, який повідомляє інтерпретатору умову виклику, яка буде використовуватися для функції C. Зазвичай це завжди має бути ``METH_VARARGS`` або ``METH_VARARGS | METH_KEYWORDS``; значення ``0`` означає, що використовується застарілий варіант :c:func:`PyArg_ParseTuple`.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :c:func:`PyArg_ParseTuple`; more information on this function is provided below.
pt_br: Якщо використовується лише ``METH_VARARGS``, функція повинна очікувати, що параметри рівня Python будуть передані як кортеж, прийнятний для аналізу через :c:func:`PyArg_ParseTuple`; більше інформації про цю функцію наведено нижче.
