Repository: python/python-docs-pt-br
Catalog: extending/extending.po
Languages: pt_br

source: The second case of problems with a borrowed reference is a variant involving threads. Normally, multiple threads in the Python interpreter can't get in each other's way, because there is a global lock protecting Python's entire object space. However, it is possible to temporarily release this lock using the macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, and to re-acquire it using :c:macro:`Py_END_ALLOW_THREADS`. This is common around blocking I/O calls, to let other threads use the processor while waiting for the I/O to complete. Obviously, the following function has the same problem as the previous one::
pt_br: Другий випадок проблем із запозиченим посиланням – це варіант із залученням потоків. Зазвичай кілька потоків в інтерпретаторі Python не можуть перешкоджати один одному, оскільки існує глобальне блокування, яке захищає весь простір об’єктів Python. Однак можна тимчасово зняти це блокування за допомогою макросу :c:macro:`Py_BEGIN_ALLOW_THREADS` і повторно отримати його за допомогою :c:macro:`Py_END_ALLOW_THREADS`. Це часто зустрічається під час блокування викликів введення-виведення, щоб дозволити іншим потокам використовувати процесор під час очікування завершення введення-виведення. Очевидно, що наступна функція має ту саму проблему, що й попередня:

source: NULL Pointers
pt_br: Puste wskaźniki (NULL)

source: In general, functions that take object references as arguments do not expect you to pass them ``NULL`` pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return ``NULL`` only to indicate that an exception occurred. The reason for not testing for ``NULL`` arguments is that functions often pass the objects they receive on to other function --- if each function were to test for ``NULL``, there would be a lot of redundant tests and the code would run more slowly.
pt_br: Загалом, функції, які приймають посилання на об’єкти як аргументи, не очікують, що ви передасте їм покажчики ``NULL``, і, якщо ви це зробите, створять дамп ядра (або викликатимуть дамп ядра пізніше). Функції, які повертають посилання на об’єкт, зазвичай повертають ``NULL`` лише для того, щоб вказати, що стався виняток. Причина не перевіряти аргументи ``NULL`` полягає в тому, що функції часто передають отримані об’єкти іншій функції --- якби кожна функція перевіряла ``NULL``, було б багато зайвих перевірок і код працюватиме повільніше.

source: It is better to test for ``NULL`` only at the "source:" when a pointer that may be ``NULL`` is received, for example, from :c:func:`malloc` or from a function that may raise an exception.
pt_br: Краще перевіряти ``NULL`` лише на "джерело:", коли вказівник, який може бути ``NULL`` отримано, наприклад, від :c:func:`malloc` або від функції, яка може створити виняток.

source: The macros :c:func:`Py_INCREF` and :c:func:`Py_DECREF` do not check for ``NULL`` pointers --- however, their variants :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` do.
pt_br: Макроси :c:func:`Py_INCREF` і :c:func:`Py_DECREF` не перевіряють покажчики ``NULL`` --- однак їх варіанти :c:func:`Py_XINCREF` і :c:func:`Py_XDECREF` робити.

source: The macros for checking for a particular object type (``Pytype_Check()``) don't check for ``NULL`` pointers --- again, there is much code that calls several of these in a row to test an object against various different expected types, and this would generate redundant tests. There are no variants with ``NULL`` checking.
pt_br: Макроси для перевірки певного типу об’єкта (``Pytype_Check()``) не перевіряють покажчики ``NULL`` --- знову ж таки, є багато коду, який викликає кілька з них поспіль для перевірки об’єкта проти різних очікуваних типів, і це створить надлишкові тести. Варіантів із перевіркою ``NULL`` немає.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never ``NULL`` --- in fact it guarantees that it is always a tuple [#]_.
pt_br: Механізм виклику функції C гарантує, що список аргументів, переданий функціям C (``args`` у прикладах), ніколи не буде ``NULL`` --- фактично він гарантує, що це завжди кортеж [#]_.

source: It is a severe error to ever let a ``NULL`` pointer "escape" to the Python user.
pt_br: Дозволити вказівнику ``NULL`` "вийти" користувачеві Python є серйозною помилкою.

source: Writing Extensions in C++
pt_br: Pisanie rozszerzeń w C++

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
pt_br: Jest możliwe pisanie modułów rozszerzających w C++. Niektóre ograniczenia obowiązują. Jeśli główny program (program interpretujący polecenia języka pytonowskiego) jest kompilowany i łączony przez kompilator języka C, nadrzędne lub statyczne przedmioty z konstruktorami nie mogą być używane. To nie jest problemem jeśli główny program jest łączony przez kompilator C++. Zadania które będą wezwane przez program interpretujący polecenia języka pytonowskiego (w szczególności, zadania inicjujące moduł) muszą być deklarowane używając ``extern "C"``. Nie jest to konieczne aby zawierać plik nagłówkowy języka pytonowskiego w ``extern "C" {...}`` --- one używają już tej formy jeśli symbol ``__cplusplus`` jest zdefiniowany (wszystkie niedawne kompilatory C++ definiują ten symbol).

source: Providing a C API for an Extension Module
pt_br: Dostarczanie sprzęgu programowania aplikacji (API) języka C dla modułu rozszerzającego

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
pt_br: Wiele modułów rozszerzających po prostu dostarcza nowych zadań i typów aby były używane z języka pytonowskiego, ale czasami kod w module rozszerzającym może być użyteczny dla innych rozszerzających modułów. Na przykład, moduł rozszerzający mógłby wypełniać typ "kolekcji" który działałby jak lista bez wprowadzonego porządku. Tak jak standardowy typ listy języka pytonowskiego posiada sprzęg programowania aplikacji języka C, który pozwala modułom rozszerzającym tworzenie i zmianę list, ten nowy typ kolekcji powinien mieć zbiór zadań C dla bezpośrednich zmian z innych modułów rozszerzających.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
pt_br: Na pierwszy rzut oka to wydaje się proste: napisać zadania (bez deklarowania ich jako ``statycznych``, oczywiście), dostarczyć odpowiedni plik nagłówkowy, i udokumentować API języka C. I faktycznie to mogłoby zadziałać jeśli wszystkie rozszerzające moduły byłyby zawsze złączone statycznie z interpreterem Pythona. Gdy moduły są używane jako współdzielone biblioteki, jednakże, symbole zdefiniowane w jednym module mogą nie być widoczne dla innych modułów. Szczegóły widoczności zależą od systemu operacyjnego; niektóre systemy używają jednej nadrzędnej przestrzeni nazw dla interpretera Pythona i wszystkich modułów rozszerzających (dla Windows, na przykład), podczas gdy inne wymagają jawnej listy importowanych symboli w czasie łączenia modułów (AIX jest jednym z przykładów), lub oferują wybór różnych strategii (większość Unix-ów). I nawet jeśli symbole są widoczne nadrzędnie, moduł którego zadania ktoś chciałby uruchomić mogły nie zostać jeszcze załadowane!

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
pt_br: Przenośność zatem wymaga aby nie czynić żadnych założeń o widoczności symboli. To oznacza, że wszystkie symbole w rozszerzających modułach powinny być deklarowane jako ``statyczne``, z wyjątkiem zadania zainicjowania modułu, w celu ominięcia wojen nazw z innymi modułami rozszerzającymi (jak określono w rozdziale :ref:`methodtable`). I to oznacza, że symbole, które *powinny* być dostępne z innych rozszerzających modułów muszą być eksportowane w różny sposób.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
pt_br: Istnieje wiele sposobów w jakie kapsuły mogą być używane aby wystawiać na zewnątrz sprzęgi programowania aplikacji (API) języka C dla danego modułu rozszerzającego. Każde zadanie mogłoby dostać swoją własną kapsułę, lub wszystkie wskaźniki sprzęgu programowania aplikacji (API) języka C mogłyby być zachowane w tabeli której adres byłby opublikowany w kapsule. A różne zadania zachowania i odbioru wskaźników mogłyby być rozprowadzone na różne sposoby pomiędzy moduły dostarczające kod i moduły odbierające.

source: In particular, Capsules used to expose C APIs should be given a name following this convention::
pt_br: W szczególności, kapsułom używanym do wystawiania sprzęgów programowania aplikacji języka C ( - z ang. - API) powinna być nadana nazwa stosująca się do następującej konwencji::

source: The convenience function :c:func:`PyCapsule_Import` makes it easy to load a C API provided via a Capsule, but only if the Capsule's name matches this convention. This behavior gives C API users a high degree of certainty that the Capsule they load contains the correct C API.
pt_br: Зручна функція :c:func:`PyCapsule_Import` спрощує завантаження C API, що надається через Capsule, але лише якщо назва Capsule відповідає цій умові. Така поведінка дає користувачам C API високий ступінь впевненості, що капсула, яку вони завантажують, містить правильний C API.

source: The exporting module is a modification of the :mod:`spam` module from section :ref:`extending-simpleexample`. The function :func:`spam.system` does not call the C library function :c:func:`system` directly, but a function :c:func:`PySpam_System`, which would of course do something more complicated in reality (such as adding "spam" to every command). This function :c:func:`PySpam_System` is also exported to other extension modules.
pt_br: Модуль експорту є модифікацією модуля :mod:`spam` із розділу :ref:`extending-simpleexample`. Функція :func:`spam.system` не викликає безпосередньо функцію бібліотеки C :c:func:`system`, а викликає функцію :c:func:`PySpam_System`, яка, звичайно, виконувала б щось складніше в реальності ( наприклад додавання "спаму" до кожної команди). Ця функція :c:func:`PySpam_System` також експортується в інші модулі розширення.

source: The function :c:func:`PySpam_System` is a plain C function, declared ``static`` like everything else::
pt_br: Функція :c:func:`PySpam_System` є звичайною функцією C, оголошеною ``static``, як і все інше::

source: The function :c:func:`spam_system` is modified in a trivial way::
pt_br: Функція :c:func:`spam_system` модифікована тривіально:

source: In the beginning of the module, right after the line ::
pt_br: Na początku modułu, zaraz za linią ::

source: two more lines must be added::
pt_br: muszą być dodane dwie linie::

source: The ``#define`` is used to tell the header file that it is being included in the exporting module, not a client module. Finally, the module's initialization function must take care of initializing the C API pointer array::
pt_br: ``#define`` jest używane aby przekazać plikowi nagłówkowemu że jest załączany w module wystawianym na zewnątrz, nie w module któremu wszystko służy. Ostatecznie zadanie inicjowania musi zadbać o zainicjowanie tabeli wskaźników sprzęgu programowania aplikacji języka C.

source: Note that ``PySpam_API`` is declared ``static``; otherwise the pointer array would disappear when :func:`PyInit_spam` terminates!
pt_br: Zauważ, że ``PySpam_API`` jest zadeklarowane ``statycznie``; w innym przypadku tabela wskaźników zniknęłaby gdy :func:`PyInit_spam` się zakończy!

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
pt_br: Większa część pracy jest wykonywana w pliku nagłówkowym :file:`spammodule.h`, który wygląda następująco::

source: All that a client module must do in order to have access to the function :c:func:`PySpam_System` is to call the function (or rather macro) :c:func:`import_spam` in its initialization function::
pt_br: Все, що повинен зробити клієнтський модуль, щоб мати доступ до функції :c:func:`PySpam_System`, це викликати функцію (точніше макрос) :c:func:`import_spam` у її функції ініціалізації::

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
pt_br: Główną wadą tego podejścia jest to, że plik :file:`spammodule.h` jest raczej skomplikowany. Jednakże podstawowa struktura jest taka sama dla każdego zadania które jest wystawiane na zewnątrz więc trzeba się tego uczyć tylko raz.

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
pt_br: Ostatecznie warto wspomnieć, że kapsuły dają dodatkowe możliwości działania, które są szczególnie użyteczne dla umieszczania i zabierania miejsca w pamięci wskaźników zachowywanych w kapsule. Szczegóły są opisane w podręczniku użytkownika API Python/C w rozdziale :ref:`capsules` i w wypełnieniu programowym kapsuł (plików :file:`Include/pycapsule.h` i :file:`Objects/pycapsule.c` w dystrybucji źródłowej kodu Pythona).

source: Footnotes
pt_br: Notas de rodapé

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
pt_br: sprzęg dla tego zadania już istnieje w standardowym module :mod:`os` --- został on wybrany jako prosty i przejrzysty przykład.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
pt_br: Metafora "pożyczania" odniesienia nie jest do końca poprawna: właściciel wciąż ma kopię odniesienia.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
pt_br: Sprawdzanie że liczba odniesień jest przynajmniej 1 **nie działa** --- liczba odniesień sama w sobie może być w uwolnionej pamięci i dlatego może być ponownie użyta dla innego przedmiotu!

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
pt_br: Te gwarancje nie są w mocy gdy używasz "starego" sposobu wywoływania --- to jest wciąż znajdowane w dużej części istniejącego kodu.
