Repository: python/python-docs-pt-br
Catalog: extending/index.po
Languages: pt_br

source: Extending and Embedding the Python Interpreter
pt_br: Estendendo e Incorporando o Interpretador Python

source: This document describes how to write modules in C or C++ to extend the Python interpreter with new modules. Those modules can not only define new functions but also new object types and their methods. The document also describes how to embed the Python interpreter in another application, for use as an extension language. Finally, it shows how to compile and link extension modules so that they can be loaded dynamically (at run time) into the interpreter, if the underlying operating system supports this feature.
pt_br: Neste documento descreveremos o desenvolvimento de módulos com C ou C++ para adicionar recursos ao interpretador Python criando novos módulos. Esses módulos podem não somente definir novas funções, mas também novos tipos de objetos e seu conjunto de métodos. O documento também descreve como incorporar o interpretador Python em outro aplicativo, de forma a utilizá-lo como sendo um idiota estendido. Por fim, estudaremos como podemos compilar e fazer a vinculação dos módulos de extensão para que estes possam ser carregados dinamicamente (em tempo de execução) pelo interpretador, caso o sistema operacional subjacente suportar esse recurso.

source: This document assumes basic knowledge about Python. For an informal introduction to the language, see :ref:`tutorial-index`. :ref:`reference-index` gives a more formal definition of the language. :ref:`library-index` documents the existing object types, functions and modules (both built-in and written in Python) that give the language its wide application range.
pt_br: Este documento pressupõe conhecimentos básicos sobre Python. Para uma introdução informal à linguagem, consulte :ref:`tutorial-index`. :ref:`reference-index` fornece uma definição mais formal da linguagem. :ref:`library-index` documenta os tipos, funções e módulos de objetos existentes (embutidos e escritos em Python) que dão à linguagem sua ampla gama de aplicações.

source: For a detailed description of the whole Python/C API, see the separate :ref:`c-api-index`.
pt_br: Para uma descrição detalhada de toda a API Python/C, consulte o :ref:`c-api-index` separado.

source: Recommended third party tools
pt_br: Ferramentas de terceiros recomendadas

source: This guide only covers the basic tools for creating extensions provided as part of this version of CPython. Third party tools like `Cython <https://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <https://www.swig.org>`_ and `Numba <https://numba.pydata.org/>`_ offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
pt_br: Esse guia cobre apenas as ferramentas básicas para a criação de extensões fornecidas como parte desta versão do CPython. Ferramentas de terceiros como `Cython <https://cython.org/>`_, `cffi <https://cffi.readthedocs.io>`_, `SWIG <https://www.swig.org>`_ e `Numba <https://numba.pydata.org/>`_ oferecem abordagens mais simples e sofisticadas para criar extensões C e C++ para Python.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
pt_br: `Guia do Usuário de Empacotamento do Python: Extensões Binárias <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
pt_br: O Guia do Usuário de Empacotamento do Python não abrange apenas várias ferramentas disponíveis que simplificam a criação de extensões binárias, mas também discute os vários motivos pelos quais a criação de um módulo de extensão pode ser desejável em primeiro lugar.

source: Creating extensions without third party tools
pt_br: Criando extensões sem ferramentas de terceiros

source: This section of the guide covers creating C and C++ extensions without assistance from third party tools. It is intended primarily for creators of those tools, rather than being a recommended way to create your own C extensions.
pt_br: Esta seção do guia aborda a criação de extensões C e C++ sem assistência de ferramentas de terceiros. Destina-se principalmente aos criadores dessas ferramentas, em vez de ser uma maneira recomendada de criar suas próprias extensões C.

source: Embedding the CPython runtime in a larger application
pt_br: Incorporando o tempo de execução do CPython em uma aplicação maior

source: Sometimes, rather than creating an extension that runs inside the Python interpreter as the main application, it is desirable to instead embed the CPython runtime inside a larger application. This section covers some of the details involved in doing that successfully.
pt_br: Às vezes, em vez de criar uma extensão que é executada dentro do interpretador Python como a aplicação principal, é desejável incorporar o tempo de execução do CPython em uma aplicação maior. Esta seção aborda alguns dos detalhes envolvidos para fazer isso com êxito.
