Repository: python/python-docs-pt-br
Catalog: extending/newtypes_tutorial.po
Languages: pt_br

source: Nevertheless, it is much easier and less error-prone to always use :c:func:`Py_CLEAR` when deleting an attribute. Don't try to micro-optimize at the expense of robustness!
pt_br: Apesar disso, é muito mais fácil e menos propenso a erros, usar sempre :c:func:`Py_CLEAR` ao excluir um atributo. Não tente micro‐otimizar às custas da robustez!

source: The deallocator ``Custom_dealloc`` may call arbitrary code when clearing attributes. It means the circular GC can be triggered inside the function. Since the GC assumes reference count is not zero, we need to untrack the object from the GC by calling :c:func:`PyObject_GC_UnTrack` before clearing members. Here is our reimplemented deallocator using :c:func:`PyObject_GC_UnTrack` and ``Custom_clear``::
pt_br: O desalocador ``Custom_dealloc`` pode executar código arbitrário ao limpar atributos. Isso significa que o GC pode ser acionado dentro da função. Como o GC presume que a contagem de referências não é zero, precisamos remover o objeto do rastreamento do GC chamando :c:func:`PyObject_GC_UnTrack` antes de limpar os membros. A seguir está nossa versão reimplementada do desalocador usando :c:func:`PyObject_GC_UnTrack` e ``Custom_clear``::

source: Finally, we add the :c:macro:`Py_TPFLAGS_HAVE_GC` flag to the class flags::
pt_br: Por fim, adicionamos o macro :c:macro:`Py_TPFLAGS_HAVE_GC` aos sinalizadores da classe::

source: That's pretty much it. If we had written custom :c:member:`~PyTypeObject.tp_alloc` or :c:member:`~PyTypeObject.tp_free` handlers, we'd need to modify them for cyclic garbage collection. Most extensions will use the versions automatically provided.
pt_br: Isso é praticamente tudo. Se tivéssemos escrito manipuladores personalizados para :c:member:`~PyTypeObject.tp_alloc` ou :c:member:`~PyTypeObject.tp_free`, precisaríamos adaptá-los para a coleta de lixo cíclica. A maior parte das extensões usará as versões fornecidas automaticamente.

source: Subclassing other types
pt_br: Criando subclasses de outros tipos

source: It is possible to create new extension types that are derived from existing types. It is easiest to inherit from the built in types, since an extension can easily use the :c:type:`PyTypeObject` it needs. It can be difficult to share these :c:type:`PyTypeObject` structures between extension modules.
pt_br: É possível criar novos tipos de extensão derivados de tipos já existentes. É mais fácil herdar dos tipos embutidos, já que uma extensão pode usar diretamente o :c:type:`PyTypeObject` de que precisa. Pode ser difícil compartilhar essas estruturas :c:type:`PyTypeObject` entre módulos de extensão distintos.

source: In this example we will create a :class:`!SubList` type that inherits from the built-in :class:`list` type. The new type will be completely compatible with regular lists, but will have an additional :meth:`!increment` method that increases an internal counter:
pt_br: Neste exemplo, criaremos um tipo :class:`!SubList` que herda do tipo embutido :class:`list`. O novo tipo será totalmente compatível com listas comuns, mas terá um método adicional, :meth:`!increment`, que incrementa um contador interno:

source: As you can see, the source code closely resembles the :class:`!Custom` examples in previous sections. We will break down the main differences between them. ::
pt_br: Como você pode consultar, o código-fonte se assemelha bastante aos exemplos de :class:`!Custom` das seções anteriores. Vamos detalhar as principais diferenças entre eles. ::

source: The primary difference for derived type objects is that the base type's object structure must be the first value. The base type will already include the :c:func:`PyObject_HEAD` at the beginning of its structure.
pt_br: A diferença principal para objetos de tipos derivados é que a estrutura de objeto do tipo base deve ser o primeiro valor. O tipo base já inclui o :c:func:`PyObject_HEAD` no início de sua própria estrutura.

source: When a Python object is a :class:`!SubList` instance, its ``PyObject *`` pointer can be safely cast to both ``PyListObject *`` and ``SubListObject *``::
pt_br: Quando um objeto Python é uma instância de :class:`!SubList`, seu ponteiro ``PyObject *`` pode ser convertido com segurança tanto para ``PyListObject *`` quanto para ``SubListObject *``::

source: We see above how to call through to the :meth:`~object.__init__` method of the base type.
pt_br: Vemos acima como chamar o método :meth:`~object.__init__` do tipo base.

source: This pattern is important when writing a type with custom :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_dealloc` members. The :c:member:`~PyTypeObject.tp_new` handler should not actually create the memory for the object with its :c:member:`~PyTypeObject.tp_alloc`, but let the base class handle it by calling its own :c:member:`~PyTypeObject.tp_new`.
pt_br: Esse padrão é importante ao escrever um tipo que possui membros personalizados em :c:member:`~PyTypeObject.tp_new` e :c:member:`~PyTypeObject.tp_dealloc`. O manipulador :c:member:`~PyTypeObject.tp_new` não deve realmente criar a memória do objeto usando o seu próprio :c:member:`~PyTypeObject.tp_alloc`; em vez disso, deve permitir que a classe base faça isso, chamando o seu próprio :c:member:`~PyTypeObject.tp_new`.

source: The :c:type:`PyTypeObject` struct supports a :c:member:`~PyTypeObject.tp_base` specifying the type's concrete base class. Due to cross-platform compiler issues, you can't fill that field directly with a reference to :c:type:`PyList_Type`; it should be done in the :c:data:`Py_mod_exec` function::
pt_br: A estrutura :c:type:`PyTypeObject` provê o campo :c:member:`~PyTypeObject.tp_base`, que especifica a classe base concreta do tipo. Devido a problemas de compilação multiplataforma, não se deve preencher esse campo diretamente com uma referência para :c:type:`PyList_Type`; isso deve ser feito dentro da função :c:data:`Py_mod_exec`::

source: Before calling :c:func:`PyType_Ready`, the type structure must have the :c:member:`~PyTypeObject.tp_base` slot filled in. When we are deriving an existing type, it is not necessary to fill out the :c:member:`~PyTypeObject.tp_alloc` slot with :c:func:`PyType_GenericNew` -- the allocation function from the base type will be inherited.
pt_br: Antes de chamar :c:func:`PyType_Ready`, a estrutura do tipo deve ter o slot :c:member:`~PyTypeObject.tp_base` preenchido. Ao derivarmos um tipo existente, não é necessário preencher o slot :c:member:`~PyTypeObject.tp_alloc` com :c:func:`PyType_GenericNew` — a função de alocação do tipo base será herdada.

source: After that, calling :c:func:`PyType_Ready` and adding the type object to the module is the same as with the basic :class:`!Custom` examples.
pt_br: Depois disso, chamar :c:func:`PyType_Ready` e adicionar o objeto de tipo ao módulo é o mesmo processo usado nos exemplos básicos com :class:`!Custom`.

source: Footnotes
pt_br: Notas de rodapé

source: This is true when we know that the object is a basic type, like a string or a float.
pt_br: Isso é verdade quando sabemos que o objeto é um tipo básico, como uma string ou um float.

source: We relied on this in the :c:member:`~PyTypeObject.tp_dealloc` handler in this example, because our type doesn't support garbage collection.
pt_br: Confiamos nisso no manipulador :c:member:`~PyTypeObject.tp_dealloc` neste exemplo, porque o nosso tipo não oferece suporte à coleta de lixo.

source: We now know that the first and last members are strings, so perhaps we could be less careful about decrementing their reference counts, however, we accept instances of string subclasses. Even though deallocating normal strings won't call back into our objects, we can't guarantee that deallocating an instance of a string subclass won't call back into our objects.
pt_br: Agora sabemos que o primeiro e último membros são strings, então talvez pudéssemos ter menos cuidado com a diminuição de suas contagens de referência, no entanto, aceitamos instâncias de subclasses de string. Mesmo que a desalocação de strings normais não retorne aos nossos objetos, não podemos garantir que a desalocação de uma instância de uma subclasse de cadeias de caracteres não retornará aos nossos objetos.

source: Also, even with our attributes restricted to strings instances, the user could pass arbitrary :class:`str` subclasses and therefore still create reference cycles.
pt_br: Além disso, mesmo com nossos atributos restritos a instâncias de strings, o usuário poderia passar arbitrariamente subclasses :class:`str` e, portanto, ainda criar ciclos de referência.
