Repository: python/python-docs-pt-br
Catalog: extending/newtypes.po
Languages: pt_br

source: A number of these abstract interfaces were defined early in the development of the Python implementation. In particular, the number, mapping, and sequence protocols have been part of Python since the beginning. Other protocols have been added over time. For protocols which depend on several handler routines from the type implementation, the older protocols have been defined as optional blocks of handlers referenced by the type object. For newer protocols there are additional slots in the main type object, with a flag bit being set to indicate that the slots are present and should be checked by the interpreter. (The flag bit does not indicate that the slot values are non-``NULL``. The flag may be set to indicate the presence of a slot, but a slot may still be unfilled.) ::
pt_br: Деякі з цих абстрактних інтерфейсів були визначені на початку розробки реалізації Python. Зокрема, протоколи чисел, відображення та послідовності були частиною Python з самого початку. З часом були додані інші протоколи. Для протоколів, які залежать від кількох підпрограм обробників із реалізації типу, старіші протоколи були визначені як додаткові блоки обробників, на які посилається об’єкт типу. Для новіших протоколів є додаткові слоти в об’єкті основного типу, із встановленим бітом прапора, який вказує, що слоти присутні та повинні бути перевірені інтерпретатором. (Біт прапора не вказує на те, що значення слота не є ``NULL``. Прапор може бути встановлений для вказівки на наявність слота, але слот все ще може бути незаповненим.) ::

source: If you wish your object to be able to act like a number, a sequence, or a mapping object, then you place the address of a structure that implements the C type :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, or :c:type:`PyMappingMethods`, respectively. It is up to you to fill in this structure with appropriate values. You can find examples of the use of each of these in the :file:`Objects` directory of the Python source distribution. ::
pt_br: Якщо ви бажаєте, щоб ваш об’єкт діяв як число, послідовність або об’єкт відображення, тоді ви розміщуєте адресу структури, яка реалізує тип C :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods` або :c:type:`PyMappingMethods` відповідно. Ви повинні заповнити цю структуру відповідними значеннями. Ви можете знайти приклади використання кожного з них у каталозі :file:`Objects` вихідного коду Python. ::

source: This function, if you choose to provide it, should return a hash number for an instance of your data type. Here is a simple example::
pt_br: Ця функція, якщо ви вирішите її надати, має повертати хеш-номер для екземпляра вашого типу даних. Ось простий приклад::

source: This function is called when an instance of your data type is "called", for example, if ``obj1`` is an instance of your data type and the Python script contains ``obj1('hello')``, the :c:member:`~PyTypeObject.tp_call` handler is invoked.
pt_br: Ця функція викликається, коли "викликається" екземпляр вашого типу даних, наприклад, якщо ``obj1`` є екземпляром вашого типу даних і сценарій Python містить ``obj1('hello')``, то :c:member:`~PyTypeObject.tp_call` обробник викликається.

source: This function takes three arguments:
pt_br: To zadanie pobiera trzy parametry:

source: *self* is the instance of the data type which is the subject of the call. If the call is ``obj1('hello')``, then *self* is ``obj1``.
pt_br: *self* — це екземпляр типу даних, який є предметом виклику. Якщо виклик ``obj1('hello')``, то *self* є ``obj1``.

source: *args* is a tuple containing the arguments to the call. You can use :c:func:`PyArg_ParseTuple` to extract the arguments.
pt_br: *args* — це кортеж, що містить аргументи виклику. Ви можете використовувати :c:func:`PyArg_ParseTuple`, щоб отримати аргументи.

source: *kwds* is a dictionary of keyword arguments that were passed. If this is non-``NULL`` and you support keyword arguments, use :c:func:`PyArg_ParseTupleAndKeywords` to extract the arguments. If you do not want to support keyword arguments and this is non-``NULL``, raise a :exc:`TypeError` with a message saying that keyword arguments are not supported.
pt_br: *kwds* — це словник переданих ключових аргументів. Якщо це не ``NULL`` і ви підтримуєте аргументи ключових слів, використовуйте :c:func:`PyArg_ParseTupleAndKeywords`, щоб отримати аргументи. Якщо ви не хочете підтримувати аргументи ключових слів і це не ``NULL``, викличте :exc:`TypeError` із повідомленням про те, що аргументи ключових слів не підтримуються.

source: Here is a toy ``tp_call`` implementation::
pt_br: Ось реалізація іграшки ``tp_call``::

source: These functions provide support for the iterator protocol. Both handlers take exactly one parameter, the instance for which they are being called, and return a new reference. In the case of an error, they should set an exception and return ``NULL``. :c:member:`~PyTypeObject.tp_iter` corresponds to the Python :meth:`~object.__iter__` method, while :c:member:`~PyTypeObject.tp_iternext` corresponds to the Python :meth:`~iterator.__next__` method.
pt_br: Эти функции обеспечивают поддержку протокола итератора. Оба обработчика принимают ровно один параметр — экземпляр, для которого они вызываются, — и возвращают новую ссылку. В случае ошибки они должны установить исключение и вернуть NULL. :c:member:`~PyTypeObject.tp_iter` соответствует методу Python :meth:`~object.__iter__`, а :c:member:`~PyTypeObject.tp_iternext` соответствует методу Python :meth:`~iterator.__next__ `метод.

source: Any :term:`iterable` object must implement the :c:member:`~PyTypeObject.tp_iter` handler, which must return an :term:`iterator` object. Here the same guidelines apply as for Python classes:
pt_br: Будь-який об’єкт :term:`iterable` повинен реалізовувати обробник :c:member:`~PyTypeObject.tp_iter`, який має повертати об’єкт :term:`iterator`. Тут застосовуються ті самі правила, що й для класів Python:

source: For collections (such as lists and tuples) which can support multiple independent iterators, a new iterator should be created and returned by each call to :c:member:`~PyTypeObject.tp_iter`.
pt_br: Для колекцій (таких як списки та кортежі), які можуть підтримувати кілька незалежних ітераторів, новий ітератор слід створювати та повертати під час кожного виклику :c:member:`~PyTypeObject.tp_iter`.

source: Objects which can only be iterated over once (usually due to side effects of iteration, such as file objects) can implement :c:member:`~PyTypeObject.tp_iter` by returning a new reference to themselves -- and should also therefore implement the :c:member:`~PyTypeObject.tp_iternext` handler.
pt_br: Об’єкти, які можна повторити лише один раз (зазвичай через побічні ефекти ітерації, такі як файлові об’єкти), можуть реалізувати :c:member:`~PyTypeObject.tp_iter`, повертаючи нове посилання на себе — і тому також повинні реалізувати :c:member:`~PyTypeObject.tp_iternext` обробник.

source: Any :term:`iterator` object should implement both :c:member:`~PyTypeObject.tp_iter` and :c:member:`~PyTypeObject.tp_iternext`. An iterator's :c:member:`~PyTypeObject.tp_iter` handler should return a new reference to the iterator. Its :c:member:`~PyTypeObject.tp_iternext` handler should return a new reference to the next object in the iteration, if there is one. If the iteration has reached the end, :c:member:`~PyTypeObject.tp_iternext` may return ``NULL`` without setting an exception, or it may set :exc:`StopIteration` *in addition* to returning ``NULL``; avoiding the exception can yield slightly better performance. If an actual error occurs, :c:member:`~PyTypeObject.tp_iternext` should always set an exception and return ``NULL``.
pt_br: Будь-який об’єкт :term:`iterator` повинен реалізовувати як :c:member:`~PyTypeObject.tp_iter`, так і :c:member:`~PyTypeObject.tp_iternext`. Обробник :c:member:`~PyTypeObject.tp_iter` ітератора має повертати нове посилання на ітератор. Його :c:member:`~PyTypeObject.tp_iternext` обробник має повернути нове посилання на наступний об’єкт у ітерації, якщо він є. Якщо ітерація досягла кінця, :c:member:`~PyTypeObject.tp_iternext` може повернути ``NULL`` без встановлення винятку, або він може встановити :exc:`StopIteration` *на додаток* до повернення ``NULL``; уникнення винятку може дати трохи кращу продуктивність. Якщо сталася фактична помилка, :c:member:`~PyTypeObject.tp_iternext` має завжди встановлювати виняток і повертати ``NULL``.

source: Weak Reference Support
pt_br: Wsparcie dla słabych odniesień

source: One of the goals of Python's weak reference implementation is to allow any type to participate in the weak reference mechanism without incurring the overhead on performance-critical objects (such as numbers).
pt_br: Одна з цілей реалізації слабкого посилання Python полягає в тому, щоб дозволити будь-якому типу брати участь у механізмі слабкого посилання без накладних витрат на критичні для продуктивності об’єкти (наприклад, числа).

source: Documentation for the :mod:`weakref` module.
pt_br: Documentação do módulo :mod:`weakref`.

source: For an object to be weakly referenceable, the extension type must set the ``Py_TPFLAGS_MANAGED_WEAKREF`` bit of the :c:member:`~PyTypeObject.tp_flags` field. The legacy :c:member:`~PyTypeObject.tp_weaklistoffset` field should be left as zero.
pt_br: Чтобы на объект можно было слабо ссылаться, тип расширения должен установить бит ``Py_TPFLAGS_MANAGED_WEAKREF`` поля :c:member:`~PyTypeObject.tp_flags`. Устаревшее поле :c:member:`~PyTypeObject.tp_weaklistoffset` следует оставить равным нулю.

source: Concretely, here is how the statically declared type object would look::
pt_br: Конкретно, вот как будет выглядеть статически объявленный объект типа:

source: The only further addition is that ``tp_dealloc`` needs to clear any weak references (by calling :c:func:`PyObject_ClearWeakRefs`)::
pt_br: Единственное дополнение заключается в том, что ``tp_dealloc`` должен очищать все слабые ссылки (путем вызова :c:func:`PyObject_ClearWeakRefs`)::

source: More Suggestions
pt_br: Więcej sugestii

source: In order to learn how to implement any specific method for your new data type, get the :term:`CPython` source code. Go to the :file:`Objects` directory, then search the C source files for ``tp_`` plus the function you want (for example, ``tp_richcompare``). You will find examples of the function you want to implement.
pt_br: Щоб дізнатися, як реалізувати певний метод для вашого нового типу даних, отримайте вихідний код :term:`CPython`. Перейдіть до каталогу :file:`Objects`, потім знайдіть у вихідних файлах C ``tp_`` і потрібну функцію (наприклад, ``tp_richcompare``). Ви знайдете приклади функцій, які ви хочете реалізувати.

source: When you need to verify that an object is a concrete instance of the type you are implementing, use the :c:func:`PyObject_TypeCheck` function. A sample of its use might be something like the following::
pt_br: Якщо вам потрібно перевірити, чи об’єкт є конкретним екземпляром типу, який ви реалізуєте, використовуйте функцію :c:func:`PyObject_TypeCheck`. Приклад його використання може бути приблизно таким:

source: Download CPython source releases.
pt_br: Завантажте вихідні версії CPython.

source: The CPython project on GitHub, where the CPython source code is developed.
pt_br: Проект CPython на GitHub, де розробляється вихідний код CPython.

source: object
pt_br: objeto

source: deallocation
pt_br: освобождение

source: deallocation, object
pt_br: освобождение, объект

source: finalization
pt_br: завершение

source: finalization, of objects
pt_br: доработка объектов

source: PyErr_Fetch (C function)
pt_br: PyErr_Fetch (C функция)

source: PyErr_Restore (C function)
pt_br: PyErr_Restore (C функция)

source: object representation
pt_br: представление объекта

source: built-in function
pt_br: função embutida
