Repository: python/python-docs-pt-br
Catalog: extending/newtypes_tutorial.po
Languages: pt_br

source: Defining Extension Types: Tutorial
pt_br: Definindo Tipos de Extensão: Tutorial

source: Python allows the writer of a C extension module to define new types that can be manipulated from Python code, much like the built-in :class:`str` and :class:`list` types. The code for all extension types follows a pattern, but there are some details that you need to understand before you can get started. This document is a gentle introduction to the topic.
pt_br: O Python permite que o desenvolvedor de um módulo de extensão em C defina novos tipos que podem ser manipulados a partir do código Python, da mesma forma que os tipos embutidos :class:`str` e :class:`list`. O código para de todos tipos de extensão segue um padrão, mas há alguns detalhes que você precisa entender antes de começar. Este documento é uma introdução suave ao tópico.

source: The Basics
pt_br: O básico

source: The :term:`CPython` runtime sees all Python objects as variables of type :c:expr:`PyObject*`, which serves as a "base type" for all Python objects. The :c:type:`PyObject` structure itself only contains the object's :term:`reference count` and a pointer to the object's "type object". This is where the action is; the type object determines which (C) functions get called by the interpreter when, for instance, an attribute gets looked up on an object, a method called, or it is multiplied by another object. These C functions are called "type methods".
pt_br: O tempo de execução do :term:`CPython` trata todos os objetos Python como variáveis do tipo :c:expr:`PyObject*`, que funciona como um “tipo base” para todos os objetos Python. A estrutura :c:type:`PyObject` em si contém apenas a :term:`contagem de referências` do objeto e um ponteiro para o “objeto de tipo” correspondente. É nesse objeto de tipo que tudo acontece: ele determina quais funções em C o interpretador chama quando, por exemplo, um atributo é acessado em um objeto, um método é chamado ou o objeto é multiplicado por outro. Essas funções em C são chamadas de “métodos de tipo”.

source: So, if you want to define a new extension type, you need to create a new type object.
pt_br: Então, se você quiser definir um novo tipo de extensão, você precisa criar um novo objeto de tipo.

source: This sort of thing can only be explained by example, so here's a minimal, but complete, module that defines a new type named :class:`!Custom` inside a C extension module :mod:`!custom`:
pt_br: Esse tipo de coisa só pode ser explicado com exemplo, então aqui está um módulo mínimo, mas completo, que define um novo tipo nomeado :class:`!Custom` dentro de um módulo de extensão C :mod:`!custom`:

source: What we're showing here is the traditional way of defining *static* extension types. It should be adequate for most uses. The C API also allows defining heap-allocated extension types using the :c:func:`PyType_FromSpec` function, which isn't covered in this tutorial.
pt_br: O que estamos mostrando aqui é a maneira tradicional de definir tipos de extensão *estáticos*. Deve ser adequada para a maioria dos usos. A API C também permite definir tipos de extensão alocados em heap usando a função :c:func:`PyType_FromSpec`, que não é abordada neste tutorial.

source: #define PY_SSIZE_T_CLEAN #include <Python.h> typedef struct { PyObject_HEAD /* Type-specific fields go here. */ } CustomObject; static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, }; static int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, // Just use this while using static types {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; static PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "custom", .m_doc = "Example module that creates an extension type.", .m_size = 0, .m_slots = custom_module_slots, }; PyMODINIT_FUNC PyInit_custom(void) { return PyModuleDef_Init(&custom_module); }
pt_br: #define PY_SSIZE_T_CLEAN #include <Python.h> typedef struct { PyObject_HEAD /* Campos específico do tipo vão aqui. */ } CustomObject; static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, }; static int custom_module_exec(PyObject *m) { if (PyType_Ready(&CustomType) < 0) { return -1; } if (PyModule_AddObjectRef(m, "Custom", (PyObject *) &CustomType) < 0) { return -1; } return 0; } static PyModuleDef_Slot custom_module_slots[] = { {Py_mod_exec, custom_module_exec}, // Só use isso quando estiver usando tipos estáticos {Py_mod_multiple_interpreters, Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED}, {0, NULL} }; static PyModuleDef custom_module = { .m_base = PyModuleDef_HEAD_INIT, .m_name = "custom", .m_doc = "Example module that creates an extension type.", .m_size = 0, .m_slots = custom_module_slots, }; PyMODINIT_FUNC PyInit_custom(void) { return PyModuleDef_Init(&custom_module); }

source: Now that's quite a bit to take in at once, but hopefully bits will seem familiar from the previous chapter. This file defines three things:
pt_br: Isso é bastante informação para assimilar de uma só vez, mas algumas partes devem parecer familiares pelo que foi visto no capítulo anterior. Este arquivo define três elementos:

source: What a :class:`!Custom` **object** contains: this is the ``CustomObject`` struct, which is allocated once for each :class:`!Custom` instance.
pt_br: O que um **objeto** :class:`!Custom` contém: esta é uma estrutura ``CustomObject``, alocada uma vez para cada instância de :class:`!Custom`.

source: How the :class:`!Custom` **type** behaves: this is the ``CustomType`` struct, which defines a set of flags and function pointers that the interpreter inspects when specific operations are requested.
pt_br: Como o **tipo** :class:`!Custom` se comporta: esta é a estrutura ``CustomType``, que define um conjunto de sinalizadores e ponteiros de função que o interpretador inspeciona quando operações específicas são solicitadas.

source: How to define and execute the :mod:`!custom` module: this is the ``PyInit_custom`` function and the associated ``custom_module`` struct for defining the module, and the ``custom_module_exec`` function to set up a fresh module object.
pt_br: Como definir e executar o módulo :mod:`!custom`: esta é a função ``PyInit_custom`` e a estrutura associada ``custom_module`` para definir o módulo, e a função ``custom_module_exec`` para configurar um novo objeto de módulo.

source: The first bit is::
pt_br: O primeiro bit é ::

source: This is what a Custom object will contain. ``PyObject_HEAD`` is mandatory at the start of each object struct and defines a field called ``ob_base`` of type :c:type:`PyObject`, containing a pointer to a type object and a reference count (these can be accessed using the macros :c:macro:`Py_TYPE` and :c:macro:`Py_REFCNT` respectively). The reason for the macro is to abstract away the layout and to enable additional fields in :ref:`debug builds <debug-build>`.
pt_br: Isto é o que um objeto Custom conterá. ``PyObject_HEAD`` é obrigatório no início de cada estrutura de objeto e define um campo chamado ``ob_base`` do tipo :c:type:`PyObject`, contendo um ponteiro para um objeto de tipo e uma contagem de referências (esses podem ser acessados usando os macros :c:macro:`Py_TYPE` e :c:macro:`Py_REFCNT`, respectivamente). O objetivo do macro é abstrair o layout e permitir campos adicionais em :ref:`construções de depuração <debug-build>`.

source: There is no semicolon above after the :c:macro:`PyObject_HEAD` macro. Be wary of adding one by accident: some compilers will complain.
pt_br: Não há ponto e vírgula acima após o macro :c:macro:`PyObject_HEAD`. Tenha cuidado para não adicionar um por engano: alguns compiladores podem emitir erros.

source: Of course, objects generally store additional data besides the standard ``PyObject_HEAD`` boilerplate; for example, here is the definition for standard Python floats::
pt_br: Obviamente, objetos geralmente armazenam dados adicionais além do padrão ``PyObject_HEAD`` boilerplate; por exemplo, aqui está a definição do padrão Python floats::

source: The second bit is the definition of the type object. ::
pt_br: O segundo bit é a definição do objeto de tipo. ::

source: static PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom.Custom", .tp_doc = PyDoc_STR("Custom objects"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, };
pt_br: estático PyTypeObject CustomType = { .ob_base = PyVarObject_HEAD_INIT(NULL, 0) .tp_name = "custom.Custom", .tp_doc = PyDoc_STR("Custom objeto"), .tp_basicsize = sizeof(CustomObject), .tp_itemsize = 0, .tp_flags = Py_TPFLAGS_DEFAULT, .tp_new = PyType_GenericNew, };

source: We recommend using C99-style designated initializers as above, to avoid listing all the :c:type:`PyTypeObject` fields that you don't care about and also to avoid caring about the fields' declaration order.
pt_br: Recomendamos usar inicializadores nomeados no estilo C99, como mostrado acima, para evitar listar todos os campos de :c:type:`PyTypeObject` com os quais você não precisa se preocupar e também para não depender da ordem de declaração desses campos

source: The actual definition of :c:type:`PyTypeObject` in :file:`object.h` has many more :ref:`fields <type-structs>` than the definition above. The remaining fields will be filled with zeros by the C compiler, and it's common practice to not specify them explicitly unless you need them.
pt_br: A definição real de :c:type:`PyTypeObject` no :file:`object.h` possui muito mais :ref:`campos <type-structs>` do que a definição acima. Os campos restantes serão preenchidos com zeros pelo compilador C, e é prática comum não especificá-los explicitamente, a menos que sejam necessários.

source: We're going to pick it apart, one field at a time::
pt_br: Vamos separá-lo, um campo de cada vez ::

source: This line is mandatory boilerplate to initialize the ``ob_base`` field mentioned above. ::
pt_br: Essa linha é um boilerplate obrigatório para inicializar o campo ``ob_base`` mencionado acima. ::

source: The name of our type. This will appear in the default textual representation of our objects and in some error messages, for example:
pt_br: O nome do nosso tipo. Ele aparecerá na representação textual padrão do nosso objeto e em algumas mensagens erro, por exemplo:

source: Note that the name is a dotted name that includes both the module name and the name of the type within the module. The module in this case is :mod:`!custom` and the type is :class:`!Custom`, so we set the type name to :class:`!custom.Custom`. Using the real dotted import path is important to make your type compatible with the :mod:`pydoc` and :mod:`pickle` modules. ::
pt_br: Observe que o nome é um nome pontilhado que inclui o nome módulo e o nome do tipo dentro do módulo. O módulo, neste caso, é :mod:`!custom` e o tipo é :class:`!Custom`, portanto, definimos o nome do tipo como :class:`!custom.Custom`. O uso do pontilhado real caminho de importação é importante para tornar seu tipo compatível com o :mod:`pydoc` e os módulos :mod:`pickle`. ::

source: This is so that Python knows how much memory to allocate when creating new :class:`!Custom` instances. :c:member:`~PyTypeObject.tp_itemsize` is only used for variable-sized objects and should otherwise be zero.
pt_br: Isso serve para que o Python saiba quanta memória deve ser alocada ao criar novas instâncias do :class:`!Custom`. O :c:member:`~PyTypeObject.tp_itemsize` é usado somente para objeto de tamanho variável e, caso contrário, deve ser zero.

source: If you want your type to be subclassable from Python, and your type has the same :c:member:`~PyTypeObject.tp_basicsize` as its base type, you may have problems with multiple inheritance. A Python subclass of your type will have to list your type first in its :attr:`~type.__bases__`, or else it will not be able to call your type's :meth:`~object.__new__` method without getting an error. You can avoid this problem by ensuring that your type has a larger value for :c:member:`~PyTypeObject.tp_basicsize` than its base type does. Most of the time, this will be true anyway, because either your base type will be :class:`object`, or else you will be adding data members to your base type, and therefore increasing its size.
pt_br: Se você quiser que seu tipo possa ser subclassificado a partir do Python, e seu tipo tiver o mesmo :c:member:`~PyTypeObject.tp_basicsize` que seu tipo base, você poderá ter problemas com herança múltipla. Uma subclasse Python do seu tipo terá de listar o seu tipo primeiro em :attr:`~type.__bases__`, caso contrário ela não conseguirá chamar o método :meth:`~object.__new__` do seu tipo sem gerar um erro. Você pode evitar esse problema garantindo que seu tipo tenha um valor de :c:member:`~PyTypeObject.tp_basicsize` maior que o do tipo base. Na maior parte do tempo, isso já será verdadeiro, pois ou o tipo base será :class:`object`, ou você estará adicionando membros de dados ao seu tipo base e, portanto, aumentando seu tamanho.

source: We set the class flags to :c:macro:`Py_TPFLAGS_DEFAULT`. ::
pt_br: Definimos os sinalizadores da classe como :c:macro:`Py_TPFLAGS_DEFAULT`. ::

source: All types should include this constant in their flags. It enables all of the members defined until at least Python 3.3. If you need further members, you will need to OR the corresponding flags.
pt_br: Todos os tipos devem incluir essa constante em seus sinalizadores. Ela habilita todos os membros definidos até pelo menos o Python 3.3. Se você precisar de membros adicionais, será necessário fazer um OR com os sinalizadores correspondentes.

source: We provide a doc string for the type in :c:member:`~PyTypeObject.tp_doc`. ::
pt_br: Fornecemos uma docstring para o tipo em tp_doc :c:member:`~PyTypeObject.tp_doc`. ::

source: To enable object creation, we have to provide a :c:member:`~PyTypeObject.tp_new` handler. This is the equivalent of the Python method :meth:`~object.__new__`, but has to be specified explicitly. In this case, we can just use the default implementation provided by the API function :c:func:`PyType_GenericNew`. ::
pt_br: Para habilitar a criação de objetos, precisamos fornecer um manipulador para :c:member:`~PyTypeObject.tp_new`. Esse é o equivalente ao método Python :meth:`~object.__new__`, mas precisa ser especificado explicitamente. Neste caso, podemos simplesmente usar a implementação padrão fornecida pela função da API :c:func:`PyType_GenericNew`. ::

source: Everything else in the file should be familiar, except for some code in :c:func:`!custom_module_exec`::
pt_br: Todo o restante do arquivo deve ser familiar, exceto por alguns códigos em :c:func:`!custom_module_exec`::

source: if (PyType_Ready(&CustomType) < 0) { return -1; }
pt_br: se (PyType_Ready(&CustomType) < 0) { retorno -1; }

source: This initializes the :class:`!Custom` type, filling in a number of members to the appropriate default values, including :c:member:`~PyObject.ob_type` that we initially set to ``NULL``. ::
pt_br: Isso inicializa o tipo :class:`!Custom`, preenchendo vários membros com os valores padrão apropriados, incluindo :c:member:`~PyObject.ob_type`, que definimos inicialmente como ``NULL``. ::

source: This adds the type to the module dictionary. This allows us to create :class:`!Custom` instances by calling the :class:`!Custom` class:
pt_br: Isso adiciona o tipo ao dicionário do módulo. Isso nos permite criar instâncias de :class:`!Custom` chamando a classe :class:`!Custom`:

source: That's it! All that remains is to build it; put the above code in a file called :file:`custom.c`,
pt_br: É isso! Só resta compilá-lo; coloque o código acima em um arquivo chamado :file:`custom.c`,

source: in a file called :file:`pyproject.toml`, and
pt_br: Em um arquivo chamado :file:`pyproject.toml`, e

source: in a file called :file:`setup.py`; then typing
pt_br: Em um arquivo chamado :file:`setup.py`; e então digitando

source: in a shell should produce a file :file:`custom.so` in a subdirectory and install it; now fire up Python --- you should be able to ``import custom`` and play around with ``Custom`` objects.
pt_br: no console deverá gerar um arquivo :file:`custom.so` em um subdiretório e instalá-lo; agora abra o Python — você já deve conseguir ``import custom`` e experimentar objetos ``Custom``.

source: That wasn't so hard, was it?
pt_br: Isso não foi tão difícil, foi?

source: Of course, the current Custom type is pretty uninteresting. It has no data and doesn't do anything. It can't even be subclassed.
pt_br: Naturalmente, o tipo Custom atual é bastante desinteressante. Não tem dados e não faz nada. Não pode nem ser subclassificado.

source: Adding data and methods to the Basic example
pt_br: Adicionando dados e métodos ao exemplo básico

source: Let's extend the basic example to add some data and methods. Let's also make the type usable as a base class. We'll create a new module, :mod:`!custom2` that adds these capabilities:
pt_br: Vamos estender o exemplo básico para adicionar alguns dados e métodos. Também vamos tornar o tipo utilizável como uma classe base. Iremos criar um novo módulo, :mod:`!custom2`, que adiciona esses recursos:

source: This version of the module has a number of changes.
pt_br: Esta versão do módulo possui várias alterações.

source: The :class:`!Custom` type now has three data attributes in its C struct, *first*, *last*, and *number*. The *first* and *last* variables are Python strings containing first and last names. The *number* attribute is a C integer.
pt_br: O tipo :class:`!Custom` agora possui três atributos de dados em sua estrutura C: first, last e number. As variáveis first e last são strings Python contendo o primeiro e o último nome. O atributo number é um inteiro em C.

source: The object structure is updated accordingly::
pt_br: A estrutura do objeto é atualizada de acordo ::

source: Because we now have data to manage, we have to be more careful about object allocation and deallocation. At a minimum, we need a deallocation method::
pt_br: Como agora temos dados para gerenciar, precisamos ter mais cuidado com a alocação e a desalocação do objeto. No mínimo, precisamos de método de desalocação::

source: which is assigned to the :c:member:`~PyTypeObject.tp_dealloc` member::
pt_br: que é atribuído ao membro :c:member:`~PyTypeObject.tp_dealloc`::

source: This method first clears the reference counts of the two Python attributes. :c:func:`Py_XDECREF` correctly handles the case where its argument is ``NULL`` (which might happen here if ``tp_new`` failed midway). It then calls the :c:member:`~PyTypeObject.tp_free` member of the object's type (computed by ``Py_TYPE(self)``) to free the object's memory. Note that the object's type might not be :class:`!CustomType`, because the object may be an instance of a subclass.
pt_br: Esse método primeiro limpa a contagem de referências dos dois atributos Python. :c:func:`Py_XDECREF` lida corretamente com o caso em que seu argumento é ``NULL`` (o que pode acontecer aqui se ``tp_new`` falhou no meio do processo). Em seguida, ele chama o membro :c:member:`~PyTypeObject.tp_free` do tipo do objeto (obtido por ``Py_TYPE(self)``) para liberar a memória do objeto. Observe que o tipo do objeto pode não ser :class:`!CustomType`, pois o objeto pode ser uma instância de uma subclasse.

source: The explicit cast to ``CustomObject *`` above is needed because we defined ``Custom_dealloc`` to take a ``PyObject *`` argument, as the ``tp_dealloc`` function pointer expects to receive a ``PyObject *`` argument. By assigning to the ``tp_dealloc`` slot of a type, we declare that it can only be called with instances of our ``CustomObject`` class, so the cast to ``(CustomObject *)`` is safe. This is object-oriented polymorphism, in C!
pt_br: O cast explícito para ``CustomObject *`` acima é necessário porque definimos ``Custom_dealloc`` para receber um argumento do tipo ``PyObject *``, enquanto o ponteiro de função ``tp_dealloc`` espera receber um argumento ``PyObject *``. Ao atribuir nossa função ao slot ``tp_dealloc`` de um tipo, estamos declarando que ela só pode ser chamada com instâncias da classe ``CustomObject``; portanto, o cast para ``(CustomObject *)`` é seguro. Isso é polimorfismo orientado a objetos, em C!

source: In existing code, or in previous versions of this tutorial, you might see similar functions take a pointer to the subtype object structure (``CustomObject*``) directly, like this::
pt_br: Em códigos existentes, ou em versões anteriores deste tutorial, você pode consultar funções semelhantes receberem diretamente um ponteiro para estrutura de objeto do subtipo (``CustomObject*``), assim: ::

source: This does the same thing on all architectures that CPython supports, but according to the C standard, it invokes undefined behavior.
pt_br: Isso faz a mesma coisa em todas as arquiteturas que o CPython oferece suporte, mas, de acordo com o padrão da linguagem C, isso invoca um comportamento indefinido.

source: We want to make sure that the first and last names are initialized to empty strings, so we provide a ``tp_new`` implementation::
pt_br: Queremos nos certificar de que o primeiro e o último nome sejam inicializados como strings vazias, portanto, fornecemos uma implementação:: ``tp_new``::

source: and install it in the :c:member:`~PyTypeObject.tp_new` member::
pt_br: e instale-o no membro:: :c:member:`~PyTypeObject.tp_new`

source: The ``tp_new`` handler is responsible for creating (as opposed to initializing) objects of the type. It is exposed in Python as the :meth:`~object.__new__` method. It is not required to define a ``tp_new`` member, and indeed many extension types will simply reuse :c:func:`PyType_GenericNew` as done in the first version of the :class:`!Custom` type above. In this case, we use the ``tp_new`` handler to initialize the ``first`` and ``last`` attributes to non-``NULL`` default values.
pt_br: O manipulador ``tp_new`` é responsável por criar (em oposição a inicializar) os objetos do tipo. Ele é exposto no Python como o método :meth:`~object.__new__`. Não é obrigatório definir um membro ``tp_new`` e, de fato, muitos tipos de extensão simplesmente reutilizam :c:func:`PyType_GenericNew`, como na primeira versão do tipo :class:`!Custom` acima. Neste caso, usamos o manipulador ``tp_new`` para inicializar os atributos ``first`` e ``last`` com valores padrão que não sejam ``NULL``.
