Repository: python/python-docs-pt-br
Catalog: extending/newtypes.po
Languages: pt_br

source: Defining Extension Types: Assorted Topics
pt_br: Визначення типів розширень: різні теми

source: This section aims to give a quick fly-by on the various type methods you can implement and what they do.
pt_br: Ten rozdział ma na celu szybko oblecieć różne sposoby postępowania typów które możesz wypełnić i omówić co one robią.

source: Here is the definition of :c:type:`PyTypeObject`, with some fields only used in :ref:`debug builds <debug-build>` omitted:
pt_br: Ось визначення :c:type:`PyTypeObject` з деякими полями, які використовуються лише в :ref:`debug builds <debug-build>` опущено:

source: Now that's a *lot* of methods. Don't worry too much though -- if you have a type you want to define, the chances are very good that you will only implement a handful of these.
pt_br: Тепер це *багато* методів. Однак не надто хвилюйтеся - якщо у вас є тип, який ви хочете визначити, дуже високі шанси, що ви реалізуєте лише кілька з них.

source: As you probably expect by now, we're going to go over this and give more information about the various handlers. We won't go in the order they are defined in the structure, because there is a lot of historical baggage that impacts the ordering of the fields. It's often easiest to find an example that includes the fields you need and then change the values to suit your new type. ::
pt_br: Як ви, мабуть, очікуєте, ми розглянемо це та надамо більше інформації про різні обробники. Ми не будемо йти в тому порядку, в якому вони визначені в структурі, тому що існує багато історичного багажу, який впливає на порядок розташування полів. Зазвичай найлегше знайти приклад, який містить потрібні вам поля, а потім змінити значення відповідно до нового типу. ::

source: The name of the type -- as mentioned in the previous chapter, this will appear in various places, almost entirely for diagnostic purposes. Try to choose something that will be helpful in such a situation! ::
pt_br: Назва типу — як згадувалося в попередньому розділі, вона з’являтиметься в різних місцях, майже виключно для діагностичних цілей. Спробуйте вибрати те, що допоможе в такій ситуації! ::

source: These fields tell the runtime how much memory to allocate when new objects of this type are created. Python has some built-in support for variable length structures (think: strings, tuples) which is where the :c:member:`~PyTypeObject.tp_itemsize` field comes in. This will be dealt with later. ::
pt_br: Ці поля повідомляють середовищі виконання, скільки пам’яті виділяти під час створення нових об’єктів цього типу. У Python є деяка вбудована підтримка структур змінної довжини (наприклад, рядків, кортежів), у яких і з’являється поле :c:member:`~PyTypeObject.tp_itemsize`. Це буде розглянуто пізніше. ::

source: Here you can put a string (or its address) that you want returned when the Python script references ``obj.__doc__`` to retrieve the doc string.
pt_br: Tu możesz wstawić ciąg znaków (lub jego adres) który chcesz zwrócić gdy skrypt języka pytonowskiego odnosi się do ``obj.__doc__`` aby otrzymać ciąg znaków dokumentacji.

source: Now we come to the basic type methods -- the ones most extension types will implement.
pt_br: Тепер ми підходимо до методів базового типу — тих, які реалізовуватимуть більшість типів розширень.

source: Finalization and De-allocation
pt_br: Finalizowanie i de-alokacja

source: This function is called when the reference count of the instance of your type is reduced to zero and the Python interpreter wants to reclaim it. If your type has memory to free or other clean-up to perform, you can put it here. The object itself needs to be freed here as well. Here is an example of this function::
pt_br: Ця функція викликається, коли кількість посилань екземпляра вашого типу зменшується до нуля, і інтерпретатор Python хоче відновити його. Якщо у вашому типі є пам’ять, яку потрібно звільнити або виконати інше очищення, ви можете розмістити це тут. Тут також потрібно звільнити сам об'єкт. Ось приклад цієї функції:

source: If your type supports garbage collection, the destructor should call :c:func:`PyObject_GC_UnTrack` before clearing any member fields::
pt_br: Якщо ваш тип підтримує збирання сміття, деструктор має викликати :c:func:`PyObject_GC_UnTrack` перед очищенням будь-яких полів-членів::

source: One important requirement of the deallocator function is that it leaves any pending exceptions alone. This is important since deallocators are frequently called as the interpreter unwinds the Python stack; when the stack is unwound due to an exception (rather than normal returns), nothing is done to protect the deallocators from seeing that an exception has already been set. Any actions which a deallocator performs which may cause additional Python code to be executed may detect that an exception has been set. This can lead to misleading errors from the interpreter. The proper way to protect against this is to save a pending exception before performing the unsafe action, and restoring it when done. This can be done using the :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore` functions::
pt_br: Однією з важливих вимог до функції розповсюджувача є те, що вона залишає будь-які незавершені винятки. Це важливо, оскільки делокатори часто викликаються, коли інтерпретатор розгортає стек Python; коли стек розгортається через виняток (а не звичайні повернення), нічого не робиться для захисту розповсюджувачів від того, що виняток уже встановлено. Будь-які дії, які виконує розповсюджувач, які можуть спричинити виконання додаткового коду Python, можуть виявити, що встановлено виняток. Це може призвести до оманливих помилок перекладача. Правильний спосіб захисту від цього — зберегти очікуваний виняток перед виконанням небезпечної дії та відновити його після завершення. Це можна зробити за допомогою функцій :c:func:`PyErr_Fetch` і :c:func:`PyErr_Restore`:

source: There are limitations to what you can safely do in a deallocator function. First, if your type supports garbage collection (using :c:member:`~PyTypeObject.tp_traverse` and/or :c:member:`~PyTypeObject.tp_clear`), some of the object's members can have been cleared or finalized by the time :c:member:`~PyTypeObject.tp_dealloc` is called. Second, in :c:member:`~PyTypeObject.tp_dealloc`, your object is in an unstable state: its reference count is equal to zero. Any call to a non-trivial object or API (as in the example above) might end up calling :c:member:`~PyTypeObject.tp_dealloc` again, causing a double free and a crash.
pt_br: Існують обмеження щодо того, що ви можете безпечно робити у функції розповсюджувача. По-перше, якщо ваш тип підтримує збирання сміття (за допомогою :c:member:`~PyTypeObject.tp_traverse` та/або :c:member:`~PyTypeObject.tp_clear`), деякі члени об’єкта можуть бути очищені або завершені за допомогою час виклику :c:member:`~PyTypeObject.tp_dealloc`. По-друге, у :c:member:`~PyTypeObject.tp_dealloc` ваш об’єкт перебуває в нестабільному стані: його кількість посилань дорівнює нулю. Будь-який виклик нетривіального об’єкта або API (як у наведеному вище прикладі) може призвести до повторного виклику :c:member:`~PyTypeObject.tp_dealloc`, викликаючи подвійне звільнення та збій.

source: Starting with Python 3.4, it is recommended not to put any complex finalization code in :c:member:`~PyTypeObject.tp_dealloc`, and instead use the new :c:member:`~PyTypeObject.tp_finalize` type method.
pt_br: Починаючи з Python 3.4, рекомендується не розміщувати будь-який складний код фіналізації в :c:member:`~PyTypeObject.tp_dealloc`, а замість цього використовувати новий метод типу :c:member:`~PyTypeObject.tp_finalize`.

source: :pep:`442` explains the new finalization scheme.
pt_br: :pep:`442` пояснює нову схему завершення.

source: Object Presentation
pt_br: Prezentacja Przedmiotów

source: In Python, there are two ways to generate a textual representation of an object: the :func:`repr` function, and the :func:`str` function. (The :func:`print` function just calls :func:`str`.) These handlers are both optional.
pt_br: W Pythonie istnieją dwa sposoby aby wygenerować tekstową reprezentację przedmiotu: funkcja :func:`repr`, i funkcja :func:`str`. (Zadanie :func:`print` po prostu wywołuje zadanie :func:`str`.) Ta zadania obsługi są oba opcjonalne.

source: The :c:member:`~PyTypeObject.tp_repr` handler should return a string object containing a representation of the instance for which it is called. Here is a simple example::
pt_br: Обробник :c:member:`~PyTypeObject.tp_repr` має повертати рядковий об’єкт, що містить представлення примірника, для якого він викликається. Ось простий приклад::

source: If no :c:member:`~PyTypeObject.tp_repr` handler is specified, the interpreter will supply a representation that uses the type's :c:member:`~PyTypeObject.tp_name` and a uniquely identifying value for the object.
pt_br: Если обработчик :c:member:`~PyTypeObject.tp_repr` не указан, интерпретатор предоставит представление, которое использует тип :c:member:`~PyTypeObject.tp_name` и уникально идентифицирующее значение для объекта.

source: The :c:member:`~PyTypeObject.tp_str` handler is to :func:`str` what the :c:member:`~PyTypeObject.tp_repr` handler described above is to :func:`repr`; that is, it is called when Python code calls :func:`str` on an instance of your object. Its implementation is very similar to the :c:member:`~PyTypeObject.tp_repr` function, but the resulting string is intended for human consumption. If :c:member:`~PyTypeObject.tp_str` is not specified, the :c:member:`~PyTypeObject.tp_repr` handler is used instead.
pt_br: Обробник :c:member:`~PyTypeObject.tp_str` є :func:`str` тим же, що описаний вище обробник :c:member:`~PyTypeObject.tp_repr` :func:`repr`; тобто він викликається, коли код Python викликає :func:`str` для екземпляра вашого об’єкта. Його реалізація дуже схожа на функцію :c:member:`~PyTypeObject.tp_repr`, але отриманий рядок призначений для використання людиною. Якщо :c:member:`~PyTypeObject.tp_str` не вказано, замість нього використовується обробник :c:member:`~PyTypeObject.tp_repr`.

source: Here is a simple example::
pt_br: Tu jest prosty przykład::

source: Attribute Management
pt_br: Zarządzanie własnościami

source: For every object which can support attributes, the corresponding type must provide the functions that control how the attributes are resolved. There needs to be a function which can retrieve attributes (if any are defined), and another to set attributes (if setting attributes is allowed). Removing an attribute is a special case, for which the new value passed to the handler is ``NULL``.
pt_br: Для кожного об’єкта, який може підтримувати атрибути, відповідний тип повинен забезпечувати функції, які контролюють, як атрибути вирішуються. Потрібна функція, яка може отримувати атрибути (якщо такі визначені), і інша для встановлення атрибутів (якщо встановлення атрибутів дозволено). Видалення атрибута є особливим випадком, для якого нове значення, передане обробнику, є ``NULL``.

source: Python supports two pairs of attribute handlers; a type that supports attributes only needs to implement the functions for one pair. The difference is that one pair takes the name of the attribute as a :c:expr:`char\*`, while the other accepts a :c:expr:`PyObject*`. Each type can use whichever pair makes more sense for the implementation's convenience. ::
pt_br: Python поддерживает две пары обработчиков атрибутов; тип, поддерживающий атрибуты, должен реализовывать функции только для одной пары. Разница в том, что одна пара принимает имя атрибута как :c:expr:`char\*`, а другая принимает :c:expr:`PyObject*`. Каждый тип может использовать любую пару, которая имеет больше смысла для удобства реализации. ::

source: If accessing attributes of an object is always a simple operation (this will be explained shortly), there are generic implementations which can be used to provide the :c:expr:`PyObject*` version of the attribute management functions. The actual need for type-specific attribute handlers almost completely disappeared starting with Python 2.2, though there are many examples which have not been updated to use some of the new generic mechanism that is available.
pt_br: Если доступ к атрибутам объекта всегда является простой операцией (это будет объяснено ниже), существуют общие реализации, которые можно использовать для предоставления версии :c:expr:`PyObject*` функций управления атрибутами. Фактическая необходимость в обработчиках атрибутов, специфичных для конкретного типа, почти полностью исчезла, начиная с Python 2.2, хотя существует множество примеров, которые не были обновлены для использования некоторых доступных новых универсальных механизмов.

source: Generic Attribute Management
pt_br: Zastępcze zarządzanie właściwościami

source: Most extension types only use *simple* attributes. So, what makes the attributes simple? There are only a couple of conditions that must be met:
pt_br: Większość typów rozszerzeń używa tylko *prostych* właściwości. Więc, co sprawia że właściwości są proste? Istnieje tylko kilka warunków które należy spełnić:

source: The name of the attributes must be known when :c:func:`PyType_Ready` is called.
pt_br: Під час виклику :c:func:`PyType_Ready` мають бути відомі назви атрибутів.

source: No special processing is needed to record that an attribute was looked up or set, nor do actions need to be taken based on the value.
pt_br: Żadne szczególne przetwarzanie nie jest potrzebne aby zarejestrować, że właściwość została pobrana lub ustawiona, ani też działania nie muszą być podejmowane w oparciu o wartość.

source: Note that this list does not place any restrictions on the values of the attributes, when the values are computed, or how relevant data is stored.
pt_br: Zauważ że ta lista nie umieszcza żadnych ograniczeń na wartościach właściwości, gdy wartości są obliczane, lub jak istotne dane są przechowywane.

source: When :c:func:`PyType_Ready` is called, it uses three tables referenced by the type object to create :term:`descriptor`\s which are placed in the dictionary of the type object. Each descriptor controls access to one attribute of the instance object. Each of the tables is optional; if all three are ``NULL``, instances of the type will only have attributes that are inherited from their base type, and should leave the :c:member:`~PyTypeObject.tp_getattro` and :c:member:`~PyTypeObject.tp_setattro` fields ``NULL`` as well, allowing the base type to handle attributes.
pt_br: Коли викликається :c:func:`PyType_Ready`, він використовує три таблиці, на які посилається об’єкт типу, щоб створити :term:`descriptor`\, які розміщуються в словнику об’єкта типу. Кожен дескриптор керує доступом до одного атрибута об'єкта екземпляра. Кожна з таблиць необов'язкова; якщо всі три мають значення ``NULL``, екземпляри типу матимуть лише атрибути, успадковані від їх базового типу, і повинні залишити поля :c:member:`~PyTypeObject.tp_getattro` і :c:member:`~PyTypeObject.tp_setattro` як ``NULL``, що дозволяє базовому типу обробляти атрибути.

source: The tables are declared as three fields of the type object::
pt_br: Tabele są zadeklarowane jako trzy pola przedmiotu typu::

source: If :c:member:`~PyTypeObject.tp_methods` is not ``NULL``, it must refer to an array of :c:type:`PyMethodDef` structures. Each entry in the table is an instance of this structure::
pt_br: Якщо :c:member:`~PyTypeObject.tp_methods` не є ``NULL``, він має посилатися на масив структур :c:type:`PyMethodDef`. Кожен запис у таблиці є екземпляром цієї структури:

source: One entry should be defined for each method provided by the type; no entries are needed for methods inherited from a base type. One additional entry is needed at the end; it is a sentinel that marks the end of the array. The :c:member:`~PyMethodDef.ml_name` field of the sentinel must be ``NULL``.
pt_br: Для каждого метода, предоставляемого типом, должна быть определена одна запись; для методов, унаследованных от базового типа, записи не требуются. В конце необходима еще одна запись; это индикатор, отмечающий конец массива. Поле :c:member:`~PyMethodDef.ml_name` дозорного должно быть ``NULL``.

source: The second table is used to define attributes which map directly to data stored in the instance. A variety of primitive C types are supported, and access may be read-only or read-write. The structures in the table are defined as::
pt_br: Druga tabela jest używana aby określać właściwości które odnoszą się bezpośrednio do danych przechowywanych w przykładzie. Różnorodne podstawowe typy C są wspierane, i dostęp może być albo tylko-do-odczytu lub odczyt-i-zapis. Struktury w tabeli są określone jako::

source: For each entry in the table, a :term:`descriptor` will be constructed and added to the type which will be able to extract a value from the instance structure. The :c:member:`~PyMemberDef.type` field should contain a type code like :c:macro:`Py_T_INT` or :c:macro:`Py_T_DOUBLE`; the value will be used to determine how to convert Python values to and from C values. The :c:member:`~PyMemberDef.flags` field is used to store flags which control how the attribute can be accessed: you can set it to :c:macro:`Py_READONLY` to prevent Python code from setting it.
pt_br: Для каждой записи в таблице будет создан :term:`дескриптор` и добавлен к типу, который сможет извлечь значение из структуры экземпляра. Поле :c:member:`~PyMemberDef.type` должно содержать код типа, например :c:macro:`Py_T_INT` или :c:macro:`Py_T_DOUBLE`; значение будет использоваться для определения способа преобразования значений Python в значения C и обратно. Поле :c:member:`~PyMemberDef.flags` используется для хранения флагов, управляющих доступом к атрибуту: вы можете установить для него значение :c:macro:`Py_READONLY`, чтобы предотвратить его установку кодом Python.

source: An interesting advantage of using the :c:member:`~PyTypeObject.tp_members` table to build descriptors that are used at runtime is that any attribute defined this way can have an associated doc string simply by providing the text in the table. An application can use the introspection API to retrieve the descriptor from the class object, and get the doc string using its :attr:`~type.__doc__` attribute.
pt_br: Интересным преимуществом использования таблицы :c:member:`~PyTypeObject.tp_members` для создания дескрипторов, используемых во время выполнения, является то, что любой атрибут, определенный таким образом, может иметь связанную строку документа, просто предоставляя текст в таблице. Приложение может использовать API интроспекции для получения дескриптора из объекта класса и получения строки документа, используя его атрибут :attr:`~type.__doc__`.

source: As with the :c:member:`~PyTypeObject.tp_methods` table, a sentinel entry with a :c:member:`~PyMethodDef.ml_name` value of ``NULL`` is required.
pt_br: Как и в случае с таблицей :c:member:`~PyTypeObject.tp_methods`, требуется контрольная запись со значением :c:member:`~PyMethodDef.ml_name`, равным ``NULL``.

source: Type-specific Attribute Management
pt_br: Szczególne-dla-typu-przedmiotu zarządzanie właściwościami

source: For simplicity, only the :c:expr:`char\*` version will be demonstrated here; the type of the name parameter is the only difference between the :c:expr:`char\*` and :c:expr:`PyObject*` flavors of the interface. This example effectively does the same thing as the generic example above, but does not use the generic support added in Python 2.2. It explains how the handler functions are called, so that if you do need to extend their functionality, you'll understand what needs to be done.
pt_br: Для простоты здесь будет продемонстрирована только версия :c:expr:`char\*`; тип параметра name — единственное различие между вариантами интерфейса :c:expr:`char\*` и :c:expr:`PyObject*`. Этот пример фактически делает то же самое, что и общий пример выше, но не использует универсальную поддержку, добавленную в Python 2.2. Там объясняется, как вызываются функции-обработчики, так что если вам понадобится расширить их функциональность, вы поймете, что нужно сделать.

source: The :c:member:`~PyTypeObject.tp_getattr` handler is called when the object requires an attribute look-up. It is called in the same situations where the :meth:`~object.__getattr__` method of a class would be called.
pt_br: Обработчик :c:member:`~PyTypeObject.tp_getattr` вызывается, когда объекту требуется поиск атрибута. Он вызывается в тех же ситуациях, когда вызывается метод :meth:`~object.__getattr__` класса.

source: Here is an example::
pt_br: Aqui está um exemplo::

source: The :c:member:`~PyTypeObject.tp_setattr` handler is called when the :meth:`~object.__setattr__` or :meth:`~object.__delattr__` method of a class instance would be called. When an attribute should be deleted, the third parameter will be ``NULL``. Here is an example that simply raises an exception; if this were really all you wanted, the :c:member:`~PyTypeObject.tp_setattr` handler should be set to ``NULL``. ::
pt_br: Обработчик :c:member:`~PyTypeObject.tp_setattr` вызывается, когда будет вызван метод :meth:`~object.__setattr__` или :meth:`~object.__delattr__` экземпляра класса. Если атрибут необходимо удалить, третьим параметром будет значение NULL. Вот пример, который просто вызывает исключение; если бы это было действительно все, что вам нужно, обработчик :c:member:`~PyTypeObject.tp_setattr` должен быть установлен в значение ``NULL``. ::

source: Object Comparison
pt_br: Porównywanie przedmiotów

source: The :c:member:`~PyTypeObject.tp_richcompare` handler is called when comparisons are needed. It is analogous to the :ref:`rich comparison methods <richcmpfuncs>`, like :meth:`!__lt__`, and also called by :c:func:`PyObject_RichCompare` and :c:func:`PyObject_RichCompareBool`.
pt_br: Обработчик :c:member:`~PyTypeObject.tp_richcompare` вызывается, когда необходимо сравнение. Он аналогичен :ref:`методам расширенного сравнения <richcmpfuncs>`, например :meth:`!__lt__`, и также вызывается :c:func:`PyObject_RichCompare` и :c:func:`PyObject_RichCompareBool`.

source: This function is called with two Python objects and the operator as arguments, where the operator is one of ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` or ``Py_GT``. It should compare the two objects with respect to the specified operator and return ``Py_True`` or ``Py_False`` if the comparison is successful, ``Py_NotImplemented`` to indicate that comparison is not implemented and the other object's comparison method should be tried, or ``NULL`` if an exception was set.
pt_br: Ця функція викликається з двома об’єктами Python і оператором як аргументами, де оператор є одним із ``Py_EQ``, ``Py_NE``, ``Py_LE``, ``Py_GE``, ``Py_LT`` або ``Py_GT``. Він має порівняти два об’єкти щодо вказаного оператора та повернути ``Py_True`` або ``Py_False``, якщо порівняння успішне, ``Py_NotImplemented``, щоб вказати, що порівняння не реалізовано, а метод порівняння іншого об’єкта має спробувати, або ``NULL``, якщо встановлено виняток.

source: Here is a sample implementation, for a datatype that is considered equal if the size of an internal pointer is equal::
pt_br: Tu jest przykładowe wypełnienie, dla typu danych który jest uznawany za równy, jeśli rozmiar wewnętrznego wskaźnika jest równy::

source: Abstract Protocol Support
pt_br: Wsparcie protokołu abstrakcyjnego

source: Python supports a variety of *abstract* 'protocols;' the specific interfaces provided to use these interfaces are documented in :ref:`abstract`.
pt_br: Python wspiera różne *abstrakcyjne* 'protokoły;' szczegółowe interfejsy dostarczone do użycia tych interfejsów są udokumentowane w :ref:`abstract`.
