Repository: python/python-docs-pt-br
Catalog: extending/newtypes_tutorial.po
Languages: pt_br

source: ``tp_new`` is passed the type being instantiated (not necessarily ``CustomType``, if a subclass is instantiated) and any arguments passed when the type was called, and is expected to return the instance created. ``tp_new`` handlers always accept positional and keyword arguments, but they often ignore the arguments, leaving the argument handling to initializer (a.k.a. ``tp_init`` in C or ``__init__`` in Python) methods.
pt_br: O ``tp_new`` recebe o tipo que está sendo instanciado (não necessariamente ``CustomType``, caso uma subclasse esteja sendo instanciada) e quaisquer argumentos passados quando o tipo foi chamado, e deve retornar a instância criada. Manipuladores ``tp_new`` sempre aceitam argumentos posicionais e argumentos nomeados, mas frequentemente os ignoram, deixando o tratamento dos argumentos para os métodos inicializadores (ou seja, ``tp_init`` em C ou ``__init__`` em Python).

source: ``tp_new`` shouldn't call ``tp_init`` explicitly, as the interpreter will do it itself.
pt_br: ``tp_new`` não deve chamar ``tp_init`` explicitamente, pois o interpretador fará isso por conta própria.

source: The ``tp_new`` implementation calls the :c:member:`~PyTypeObject.tp_alloc` slot to allocate memory::
pt_br: A implementação de ``tp_new`` chama o slot :c:member:`~PyTypeObject.tp_alloc` para alocar memória::

source: Since memory allocation may fail, we must check the :c:member:`~PyTypeObject.tp_alloc` result against ``NULL`` before proceeding.
pt_br: Como a alocação de memória pode falhar, precisamos verificar se o resultado de :c:member:`~PyTypeObject.tp_alloc` é ``NULL`` antes de prosseguir.

source: We didn't fill the :c:member:`~PyTypeObject.tp_alloc` slot ourselves. Rather :c:func:`PyType_Ready` fills it for us by inheriting it from our base class, which is :class:`object` by default. Most types use the default allocation strategy.
pt_br: Nós não preenchemos o slot :c:member:`~PyTypeObject.tp_alloc` por conta própria. Em vez disso, :c:func:`PyType_Ready` o preenche herdando-o da nossa classe base, que por padrão é :class:`object`. A maioria dos tipos usa a estratégia de alocação padrão.

source: If you are creating a co-operative :c:member:`~PyTypeObject.tp_new` (one that calls a base type's :c:member:`~PyTypeObject.tp_new` or :meth:`~object.__new__`), you must *not* try to determine what method to call using method resolution order at runtime. Always statically determine what type you are going to call, and call its :c:member:`~PyTypeObject.tp_new` directly, or via ``type->tp_base->tp_new``. If you do not do this, Python subclasses of your type that also inherit from other Python-defined classes may not work correctly. (Specifically, you may not be able to create instances of such subclasses without getting a :exc:`TypeError`.)
pt_br: Se você estiver criando um :c:member:`~PyTypeObject.tp_new` cooperativo (um que chama o :c:member:`~PyTypeObject.tp_new` ou :meth:`~object.__new__` de um tipo base), você *não* deve tentar determinar qual método chamar usando a ordem de resolução de métodos em tempo de execução. Sempre determine estaticamente qual tipo você vai chamar e chame seu :c:member:`~PyTypeObject.tp_new` diretamente ou via ``type->tp_base->tp_new``. Se você não fizer isso, as subclasses Python do seu tipo que também herdam de outras classes definidas em Python podem não funcionar corretamente. (Especificamente, você pode não conseguir criar instâncias dessas subclasses sem receber um :exc:`TypeError`.)

source: We also define an initialization function which accepts arguments to provide initial values for our instance::
pt_br: Também definimos uma função de inicialização que aceita argumentos para fornecer valores iniciais para nosso instância::

source: by filling the :c:member:`~PyTypeObject.tp_init` slot. ::
pt_br: preenchendo o slot :: :c:member:`~PyTypeObject.tp_init`.

source: The :c:member:`~PyTypeObject.tp_init` slot is exposed in Python as the :meth:`~object.__init__` method. It is used to initialize an object after it's created. Initializers always accept positional and keyword arguments, and they should return either ``0`` on success or ``-1`` on error.
pt_br: O slot :c:member:`~PyTypeObject.tp_init` é exposto em Python como o método :meth:`~object.__init__`. Ele é usado para inicializar um objeto depois que ele é criado. Inicializadores sempre aceitam argumentos posicionais e argumentos nomeados, e devem retornar ``0`` em caso de sucesso ou ``-1`` em caso de erro.

source: Unlike the ``tp_new`` handler, there is no guarantee that ``tp_init`` is called at all (for example, the :mod:`pickle` module by default doesn't call :meth:`~object.__init__` on unpickled instances). It can also be called multiple times. Anyone can call the :meth:`!__init__` method on our objects. For this reason, we have to be extra careful when assigning the new attribute values. We might be tempted, for example to assign the ``first`` member like this::
pt_br: Ao contrário do manipulador ``tp_new``, não há garantia de que seja chamado (por exemplo, o módulo :mod:`pickle` por padrão não chama :meth:`~object.__init__` em instâncias desserializadas). Além disso, ``tp_init`` pode ser chamado várias vezes. Qualquer um pode chamar o método :meth:`!__init__` em nossos objetos. Por esse motivo, precisamos ter cuidado redobrado ao atribuir os novos valores de atributos. Poderíamos ficar tentados, por exemplo, a atribuir o membro ``first`` assim::

source: But this would be risky. Our type doesn't restrict the type of the ``first`` member, so it could be any kind of object. It could have a destructor that causes code to be executed that tries to access the ``first`` member; or that destructor could detach the :term:`thread state <attached thread state>` and let arbitrary code run in other threads that accesses and modifies our object.
pt_br: Mas isso seria arriscado. Nosso tipo não restringe o tipo do membro ``first``, então ele poderia ser qualquer tipo de objeto. Ele poderia ter um destrutor que executasse código que tentasse acessar o membro ``first``; ou esse destrutor poderia desanexar o :term:`estado de thread <attached thread state>` e permitir que código arbitrário fosse executado em outras threads, acessando e modificando nosso objeto.

source: To be paranoid and protect ourselves against this possibility, we almost always reassign members before decrementing their reference counts. When don't we have to do this?
pt_br: Para sermos extremamente cautelosos e nos proteger dessa possibilidade, quase sempre atribuímos novamente os membros antes de decrementar a contagem de referências. Quando não precisamos fazer isso?

source: when we absolutely know that the reference count is greater than 1;
pt_br: quando sabemos absolutamente que a contagem de referência é maior que 1;

source: when we know that deallocation of the object [#]_ will neither detach the :term:`thread state <attached thread state>` nor cause any calls back into our type's code;
pt_br: quando sabemos que a desalocação do objeto [#]_ não desvinculará o :term:`estado de thread <attached thread state>` nem causará quaisquer chamadas de volta no código do nosso tipo;

source: when decrementing a reference count in a :c:member:`~PyTypeObject.tp_dealloc` handler on a type which doesn't support cyclic garbage collection [#]_.
pt_br: quando estamos decrementando uma contagem de referências em um manipulador :c:member:`~PyTypeObject.tp_dealloc` de um tipo que não oferece suporte à coleta de lixo cíclica [#]_.

source: We want to expose our instance variables as attributes. There are a number of ways to do that. The simplest way is to define member definitions::
pt_br: Queremos expor nossas variáveis de instância como atributos. Há várias maneiras de fazer isso. A forma mais simples é estabelecer definições de membros::

source: and put the definitions in the :c:member:`~PyTypeObject.tp_members` slot::
pt_br: e colocar as definições no slot :c:member:`~PyTypeObject.tp_members`::

source: Each member definition has a member name, type, offset, access flags and documentation string. See the :ref:`Generic-Attribute-Management` section below for details.
pt_br: Cada definição de membro possui um nome de membro, um tipo, um deslocamento, sinalizadores de acesso e uma string de documentação. Consulte a seção :ref:`Generic-Attribute-Management` abaixo para mais detalhes.

source: A disadvantage of this approach is that it doesn't provide a way to restrict the types of objects that can be assigned to the Python attributes. We expect the first and last names to be strings, but any Python objects can be assigned. Further, the attributes can be deleted, setting the C pointers to ``NULL``. Even though we can make sure the members are initialized to non-``NULL`` values, the members can be set to ``NULL`` if the attributes are deleted.
pt_br: Uma desvantagem dessa abordagem é que ela não fornece uma forma de restringir os tipos de objetos que podem ser atribuídos aos atributos em Python. Esperamos que os nomes first e last sejam strings, mas qualquer objeto Python pode ser atribuído. Além disso, os atributos podem ser excluídos, fazendo com que os ponteiros em C sejam definidos como ``NULL``. Mesmo que possamos garantir que os membros sejam inicializados com valores não ``NULL``, eles ainda podem acabar sendo definidos como ``NULL`` caso os atributos sejam apagados.

source: We define a single method, :meth:`!Custom.name`, that outputs the objects name as the concatenation of the first and last names. ::
pt_br: Definimos um único método,:meth:`!Custom.name`, que exibe o nome do objeto como a concatenação do primeiro nome com o último nome ::

source: The method is implemented as a C function that takes a :class:`!Custom` (or :class:`!Custom` subclass) instance as the first argument. Methods always take an instance as the first argument. Methods often take positional and keyword arguments as well, but in this case we don't take any and don't need to accept a positional argument tuple or keyword argument dictionary. This method is equivalent to the Python method:
pt_br: O método é implementado como uma função em C que recebe uma instância de :class:`!Custom` (ou de uma subclasse de :class:`!Custom`) como primeiro argumento. Métodos sempre recebem a instância como primeiro argumento. Eles também costumam aceitar argumentos posicionais e nomeados, mas, neste caso, não recebemos nenhum e não precisamos aceitar uma tupla de argumentos posicionais nem um dicionário de argumentos nomeados. Este método equivale ao método Python:

source: Note that we have to check for the possibility that our :attr:`!first` and :attr:`!last` members are ``NULL``. This is because they can be deleted, in which case they are set to ``NULL``. It would be better to prevent deletion of these attributes and to restrict the attribute values to be strings. We'll see how to do that in the next section.
pt_br: Observe que precisamos verificar a possibilidade de que nossos atributos :attr:`!first` e :attr:`!last` estejam com valor ``NULL``. Isso ocorre porque eles podem ser excluídos e, nesse caso, ficam definidos como ``NULL``. Seria melhor impedir a exclusão desses atributos e restringir seus valores para que sejam sempre strings. Veremos como fazer isso na próxima seção.

source: Now that we've defined the method, we need to create an array of method definitions::
pt_br: Agora que definimos o método, precisamos criar uma array de definições de métodos::

source: (note that we used the :c:macro:`METH_NOARGS` flag to indicate that the method is expecting no arguments other than *self*)
pt_br: note que usamos o sinalizador :c:macro:`METH_NOARGS` para indicar que o método não espera argumentos além de *self*)

source: and assign it to the :c:member:`~PyTypeObject.tp_methods` slot::
pt_br: e atribuí-lo para o slot:: :c:member:`~PyTypeObject.tp_methods`

source: Finally, we'll make our type usable as a base class for subclassing. We've written our methods carefully so far so that they don't make any assumptions about the type of the object being created or used, so all we need to do is to add the :c:macro:`Py_TPFLAGS_BASETYPE` to our class flag definition::
pt_br: Por fim, tornaremos nosso tipo utilizável como classe base para herança. Escrevemos nossos métodos com cuidado até agora, garantindo que eles não façam suposições sobre o tipo do objeto que está sendo criado ou utilizado; portanto, tudo o que precisamos fazer é adicionar a :c:macro:`Py_TPFLAGS_BASETYPE` à definição dos sinalizadores da nossa classe::

source: We rename :c:func:`!PyInit_custom` to :c:func:`!PyInit_custom2`, update the module name in the :c:type:`PyModuleDef` struct, and update the full class name in the :c:type:`PyTypeObject` struct.
pt_br: Renomeamos :c:func:`!PyInit_custom` para :c:func:`!PyInit_custom2`, atualizamos o nome do módulo na estrutura :c:type:`PyModuleDef`, e atualizamos o nome completo da classe na estrutura :c:type:`PyTypeObject`.

source: Finally, we update our :file:`setup.py` file to include the new module,
pt_br: Finalmente, atualizamos nosso arquivo :file:`setup.py` para incluir o novo módulo,

source: and then we re-install so that we can ``import custom2``:
pt_br: então podemos instalar novamente para realizarmos o ``import custom2``

source: Providing finer control over data attributes
pt_br: Fornecendo controle mais preciso sobre atributos de dados

source: In this section, we'll provide finer control over how the :attr:`!first` and :attr:`!last` attributes are set in the :class:`!Custom` example. In the previous version of our module, the instance variables :attr:`!first` and :attr:`!last` could be set to non-string values or even deleted. We want to make sure that these attributes always contain strings.
pt_br: Nesta seção, forneceremos um controle mais preciso sobre como os atributos :attr:`!first` e :attr:`!last` são definidos no exemplo :class:`!Custom`. Na versão anterior do nosso módulo, as variáveis de instância :attr:`!first` e :attr:`!last` podiam receber valores que não fossem strings ou até mesmo ser excluídas. Queremos garantir que esses atributos sempre contenham strings.

source: To provide greater control, over the :attr:`!first` and :attr:`!last` attributes, we'll use custom getter and setter functions. Here are the functions for getting and setting the :attr:`!first` attribute::
pt_br: Para oferecer um controle maior sobre os atributos :attr:`!first` e :attr:`!last`, usaremos funções personalizadas de acesso (getters) e modificação (setters). A seguir estão as funções para obter e definir o atributo :attr:`!first`::

source: The getter function is passed a :class:`!Custom` object and a "closure", which is a void pointer. In this case, the closure is ignored. (The closure supports an advanced usage in which definition data is passed to the getter and setter. This could, for example, be used to allow a single set of getter and setter functions that decide the attribute to get or set based on data in the closure.)
pt_br: A função getter recebe um objeto :class:`!Custom` e um closure, que é um ponteiro para void. Neste caso, o closure é ignorado. (O closure oferece suporte a um modo de usar mais avançado, no qual dados de definição são passados ao getter e ao setter. Isso pode, por exemplo, permitir que um único conjunto de funções getter e setter decida qual atributo obter ou definir com base nos dados presentes no closure.)

source: The setter function is passed the :class:`!Custom` object, the new value, and the closure. The new value may be ``NULL``, in which case the attribute is being deleted. In our setter, we raise an error if the attribute is deleted or if its new value is not a string.
pt_br: A função setter recebe o objeto :class:`!Custom`, o novo valor e o closure. O novo valor pode ser ``NULL``, caso em que o atributo está sendo excluído. No nosso setter, levantamos um erro se o atributo for excluído ou se o novo valor não for uma string.

source: We create an array of :c:type:`PyGetSetDef` structures::
pt_br: Nós criamos um vetor de estruturas :c:type:`PyGetSetDef`::

source: and register it in the :c:member:`~PyTypeObject.tp_getset` slot::
pt_br: e registra isso num slot :c:member:`~PyTypeObject.tp_getset`::

source: The last item in a :c:type:`PyGetSetDef` structure is the "closure" mentioned above. In this case, we aren't using a closure, so we just pass ``NULL``.
pt_br: A última entrada em uma estrutura :c:type:`PyGetSetDef` é o “closure” mencionado acima. Neste caso, não estamos usando um closure, então simplesmente passamos ``NULL``.

source: We also remove the member definitions for these attributes::
pt_br: Também removemos as definições de membros para esses atributos::

source: We also need to update the :c:member:`~PyTypeObject.tp_init` handler to only allow strings [#]_ to be passed::
pt_br: Também precisamos atualizar o manipulador :c:member:`~PyTypeObject.tp_init` para permitir apenas strings [#]_ como valores passados::

source: With these changes, we can assure that the ``first`` and ``last`` members are never ``NULL`` so we can remove checks for ``NULL`` values in almost all cases. This means that most of the :c:func:`Py_XDECREF` calls can be converted to :c:func:`Py_DECREF` calls. The only place we can't change these calls is in the ``tp_dealloc`` implementation, where there is the possibility that the initialization of these members failed in ``tp_new``.
pt_br: Com essas alterações, podemos garantir que os membros ``first`` e ``last`` nunca sejam ``NULL``, de modo que podemos remover quase todas as verificações de valores ``NULL``. Isso significa que a maioria das chamadas para :c:func:`Py_XDECREF` pode ser substituída por chamadas para :c:func:`Py_DECREF`. O único lugar em que não podemos substituir essas chamadas é na implementação de ``tp_dealloc``, onde existe a possibilidade de que a inicialização desses membros tenha falhado em ``tp_new``.

source: We also rename the module initialization function and module name in the initialization function, as we did before, and we add an extra definition to the :file:`setup.py` file.
pt_br: Também renomeamos a função de inicialização do módulo e o nome do módulo dentro da função de inicialização, como fizemos anteriormente, e adicionamos uma definição extra ao arquivo :file:`setup.py`.

source: Supporting cyclic garbage collection
pt_br: Apoiando a coleta de lixo cíclica

source: Python has a :term:`cyclic garbage collector (GC) <garbage collection>` that can identify unneeded objects even when their reference counts are not zero. This can happen when objects are involved in cycles. For example, consider:
pt_br: O Python possui um :term:`coletor de lixo (GC) cíclico <garbage collection>` que pode identificar objetos que não são mais necessários mesmo quando suas contagens de referências não são zero. Isso pode acontecer quando os objetos participam de ciclos. Por exemplo, considere:

source: In this example, we create a list that contains itself. When we delete it, it still has a reference from itself. Its reference count doesn't drop to zero. Fortunately, Python's cyclic garbage collector will eventually figure out that the list is garbage and free it.
pt_br: Neste exemplo, criamos uma lista que contém a si mesma. Quando a apagamos, ela ainda possui uma referência apontando para si própria. Sua contagem de referências não cai para zero. Felizmente, o coletor de lixo cíclico do Python acabará percebendo que a lista é lixo e irá liberá-la.

source: In the second version of the :class:`!Custom` example, we allowed any kind of object to be stored in the :attr:`!first` or :attr:`!last` attributes [#]_. Besides, in the second and third versions, we allowed subclassing :class:`!Custom`, and subclasses may add arbitrary attributes. For any of those two reasons, :class:`!Custom` objects can participate in cycles:
pt_br: No segunda versão do exemplo de :class:`!Custom`, permitimos que qualquer tipo de objeto fosse armazenado nos atributos :attr:`!first` ou :attr:`!last` [#]_. Além disso, na segunda e na terceira versões, permitimos estender :class:`!Custom`, e subclasses podem adicionar atributos arbitrários. Por qualquer um desses dois motivos, instâncias de :class:`!Custom` podem participar de ciclos:

source: To allow a :class:`!Custom` instance participating in a reference cycle to be properly detected and collected by the cyclic GC, our :class:`!Custom` type needs to fill two additional slots and to enable a flag that enables these slots:
pt_br: Para permitir que uma instância de :class:`!Custom` que participa de um ciclo de referência seja corretamente detectada e coletada pelo coletor de lixo cíclico, nosso tipo :class:`!Custom` precisa preencher dois slots adicionais e ativar um sinalizador que habilita esses slots:

source: First, the traversal method lets the cyclic GC know about subobjects that could participate in cycles::
pt_br: Primeiro, o método de travessia informa ao coletor de lixo cíclico quais subobjetos podem participar de ciclos::

source: For each subobject that can participate in cycles, we need to call the :c:func:`!visit` function, which is passed to the traversal method. The :c:func:`!visit` function takes as arguments the subobject and the extra argument *arg* passed to the traversal method. It returns an integer value that must be returned if it is non-zero.
pt_br: Para cada subobjeto que pode participar de ciclos, precisamos chamar a função :c:func:`!visit`, que é passada para o método de travessia. A função :c:func:`!visit` recebe como argumentos o subobjeto e o argumento extra *arg* fornecido ao método de travessia. Ela retorna um valor inteiro que deve ser retornado se for diferente de zero.

source: Python provides a :c:func:`Py_VISIT` macro that automates calling visit functions. With :c:func:`Py_VISIT`, we can minimize the amount of boilerplate in ``Custom_traverse``::
pt_br: O Python fornece o macro :c:func:`Py_VISIT`, que automatiza as chamadas às funções visit. Com :c:func:`Py_VISIT`, podemos minimizar a quantidade de boilerplate em ``Custom_traverse``::

source: The :c:member:`~PyTypeObject.tp_traverse` implementation must name its arguments exactly *visit* and *arg* in order to use :c:func:`Py_VISIT`.
pt_br: A implementação de :c:member:`~PyTypeObject.tp_traverse` deve nomear seus argumentos exatamente como *visit* e *arg* para que seja possível usar :c:func:`Py_VISIT`.

source: Second, we need to provide a method for clearing any subobjects that can participate in cycles::
pt_br: Segundo, precisamos fornecer um método para limpar quaisquer subobjetos que possam participar de ciclos::

source: Notice the use of the :c:func:`Py_CLEAR` macro. It is the recommended and safe way to clear data attributes of arbitrary types while decrementing their reference counts. If you were to call :c:func:`Py_XDECREF` instead on the attribute before setting it to ``NULL``, there is a possibility that the attribute's destructor would call back into code that reads the attribute again (*especially* if there is a reference cycle).
pt_br: Observe o uso do macro :c:func:`Py_CLEAR`. Ele é a forma recomendada e segura de limpar atributos de dados de tipos arbitrários enquanto decrementa suas contagens de referências. Se você chamasse :c:func:`Py_XDECREF` no atributo antes de defini-lo como ``NULL``, haveria a possibilidade de que o destrutor do atributo chamasse novamente algum código que lesse o atributo (especialmente se houver um ciclo de referência).

source: You could emulate :c:func:`Py_CLEAR` by writing::
pt_br: Você poderia emular :c:func:`Py_CLEAR` ao escrever::
