Repository: python/python-docs-pt-br
Catalog: reference/compound_stmts.po
Languages: pt_br

source: All three flavors of type parameters can also have a *default value*, which is used when the type parameter is not explicitly provided. This is added by appending a single equals sign (``=``) followed by an expression. Like the bounds and constraints of type variables, the default value is not evaluated when the object is created, but only when the type parameter's ``__default__`` attribute is accessed. To this end, the default value is evaluated in a separate :ref:`annotation scope <annotation-scopes>`. If no default value is specified for a type parameter, the ``__default__`` attribute is set to the special sentinel object :data:`typing.NoDefault`.
pt_br: Todas as três espécies de parâmetros de tipo também podem ter um *valor padrão*, que é usado quando o parâmetro de tipo não é fornecido explicitamente. Isso é adicionado anexando um único sinal de igual (``=``) seguido por uma expressão. Como os limites e restrições de tipos variáveis, o valor padrão não é avaliado quando o objeto é criado, mas apenas quando o atributo ``__default__`` do parâmetro de tipo é acessado. Para esse fim, o valor padrão é avaliado em um :ref:`escopo de anotação <annotation-scopes>` separado. Se nenhum valor padrão for especificado para um parâmetro de tipo, o atributo ``__default__`` é definido como o objeto sinalizador especial :data:`typing.NoDefault`.

source: The following example indicates the full set of allowed type parameter declarations::
pt_br: O exemplo a seguir indica o conjunto completo de declarações de parâmetros de tipo permitidas:

source: Generic functions
pt_br: Funções genéricas

source: Generic functions are declared as follows::
pt_br: Funções genéricas são declaradas assim:

source: This syntax is equivalent to::
pt_br: Essa sintaxe é equivalente a:

source: Here ``annotation-def`` indicates an :ref:`annotation scope <annotation-scopes>`, which is not actually bound to any name at runtime. (One other liberty is taken in the translation: the syntax does not go through attribute access on the :mod:`typing` module, but creates an instance of :data:`typing.TypeVar` directly.)
pt_br: Aqui, ``annotation-def`` indica um :ref:`escopo de anotação <annotation-scopes>`, que não é vinculado de verdade a nenhum nome em tempo de execução. (Uma outra liberdade foi tomada na tradução: essa sintaxe não faz ocorrer um acesso de atributo no módulo :mod:`typing`; ao invés disso é criada uma instância de :data:`typing.TypeVar` diretamente.)

source: The annotations of generic functions are evaluated within the annotation scope used for declaring the type parameters, but the function's defaults and decorators are not.
pt_br: As anotações das funções genéricas são lidas dentro do escopo de anotação usado para declarar os parâmetros de tipo, mas os valores padrão dos argumentos e decoradores da função não são.

source: The following example illustrates the scoping rules for these cases, as well as for additional flavors of type parameters::
pt_br: Este exemplo ilustra as regras de escopo para estes casos, bem como para outras espécies de parâmetros de tipo::

source: Except for the :ref:`lazy evaluation <lazy-evaluation>` of the :class:`~typing.TypeVar` bound, this is equivalent to::
pt_br: Tirando a :ref:`avaliação preguiçosa <lazy-evaluation>` da delimitação da :class:`~typing.TypeVar`, isso é equivalente a::

source: The capitalized names like ``DEFAULT_OF_arg`` are not actually bound at runtime.
pt_br: Os nomes com maiúsculas como ``DEFAULT_OF_arg`` não são realmente vinculados em tempo de execução.

source: Generic classes
pt_br: Classes genéricas

source: Generic classes are declared as follows::
pt_br: Classes genéricas são declaradas assim:

source: Here again ``annotation-def`` (not a real keyword) indicates an :ref:`annotation scope <annotation-scopes>`, and the name ``TYPE_PARAMS_OF_Bag`` is not actually bound at runtime.
pt_br: Aqui novamente ``annotation-def`` (não é uma palavra reservada real) indica um :ref:`escopo de anotação <annotation-scopes>`, e o nome ``TYPE_PARAMS_OF_Bag`` não é realmente vinculado em tempo de execução.

source: Generic classes implicitly inherit from :data:`typing.Generic`. The base classes and keyword arguments of generic classes are evaluated within the type scope for the type parameters, and decorators are evaluated outside that scope. This is illustrated by this example::
pt_br: Classes genéricas herdam implicitamente de :data:`typing.Generic`. As classes base e os argumentos nomeados de classes genéricas são avaliados dentro do escopo de tipo para os parâmetros de tipo, e os decoradores são avaliados fora desse escopo. Isso é ilustrado por este exemplo::

source: This is equivalent to::
pt_br: Isso equivale a::

source: Generic type aliases
pt_br: Apelidos de tipo genérico

source: The :keyword:`type` statement can also be used to create a generic type alias::
pt_br: A instrução :keyword:`type` também pode ser usada para criar um apelido de tipo genérico::

source: Except for the :ref:`lazy evaluation <lazy-evaluation>` of the value, this is equivalent to::
pt_br: Exceto pela :ref:`avaliação preguiçosa <lazy-evaluation>` do valor, isso é equivalente a::

source: annotation-def TYPE_PARAMS_OF_ListOrSet(): T = typing.TypeVar("T") annotation-def VALUE_OF_ListOrSet(): return list[T] | set[T] # In reality, the value is lazily evaluated return typing.TypeAliasType("ListOrSet", VALUE_OF_ListOrSet(), type_params=(T,)) ListOrSet = TYPE_PARAMS_OF_ListOrSet()
pt_br: annotation-def TYPE_PARAMS_OF_ListOrSet(): T = typing.TypeVar("T") annotation-def VALUE_OF_ListOrSet(): return list[T] | set[T] # Na realidade, o valor é avaliado preguiçosamente return typing.TypeAliasType("ListOrSet", VALUE_OF_ListOrSet(), type_params=(T,)) ListOrSet = TYPE_PARAMS_OF_ListOrSet()

source: Here, ``annotation-def`` (not a real keyword) indicates an :ref:`annotation scope <annotation-scopes>`. The capitalized names like ``TYPE_PARAMS_OF_ListOrSet`` are not actually bound at runtime.
pt_br: Aqui, ``annotation-def`` (não é uma palavra reservada real) indica um :ref:`escopo de anotação <annotation-scopes>`. Os nomes em maiúsculas como ``TYPE_PARAMS_OF_ListOrSet`` não são realmente vinculados em tempo de execução.

source: Annotations
pt_br: Anotações

source: Annotations are now lazily evaluated by default.
pt_br: Anotações são agora avaliados preguiçosamente por padrão.

source: Variables and function parameters may carry :term:`annotations <annotation>`, created by adding a colon after the name, followed by an expression::
pt_br: Variáveis e parâmetros de função podem conter :term:`anotações <annotation>`, criadas adicionando dois pontos após o nome, seguidos de uma expressão::

source: Functions may also carry a return annotation following an arrow::
pt_br: As funções também podem ter uma anotação de retorno seguindo uma seta::

source: Annotations are conventionally used for :term:`type hints <type hint>`, but this is not enforced by the language, and in general annotations may contain arbitrary expressions. The presence of annotations does not change the runtime semantics of the code, except if some mechanism is used that introspects and uses the annotations (such as :mod:`dataclasses` or :func:`functools.singledispatch`).
pt_br: Anotações são convencionalmente usadas para :term:`dicas de tipo <type hint>`, mas isso não é imposto pela linguagem e, em geral, anotações podem conter expressões arbitrárias. A presença de anotações não altera a semântica de tempo de execução do código, exceto se algum mecanismo for usado para introspectar e utilizar as anotações (como :mod:`dataclasses` ou :func:`functools.singledispatch`).

source: By default, annotations are lazily evaluated in an :ref:`annotation scope <annotation-scopes>`. This means that they are not evaluated when the code containing the annotation is evaluated. Instead, the interpreter saves information that can be used to evaluate the annotation later if requested. The :mod:`annotationlib` module provides tools for evaluating annotations.
pt_br: Por padrão, as anotações são avaliadas preguiçosamente em um :ref:`escopo de anotações <annotation-scopes>`. Isso significa que elas não são avaliadas quando o código que contém a anotação é avaliado. Em vez disso, o interpretador salva informações que podem ser usadas para avaliar a anotação posteriormente, se solicitado. O módulo :mod:`annotationlib` fornece ferramentas para avaliar anotações.

source: If the :ref:`future statement <future>` ``from __future__ import annotations`` is present, all annotations are instead stored as strings::
pt_br: Se :ref:`instrução future <future>` ``from __future__ import annotations`` estiver presente, todas as anotações serão armazenadas como strings::

source: This future statement will be deprecated and removed in a future version of Python, but not before Python 3.13 reaches its end of life (see :pep:`749`). When it is used, introspection tools like :func:`annotationlib.get_annotations` and :func:`typing.get_type_hints` are less likely to be able to resolve annotations at runtime.
pt_br: Esta instrução future será descontinuada e removida em uma versão futura do Python, mas não antes do Python 3.13 chegar ao fim de sua vida útil (consulte :pep:`749`). Quando usada, ferramentas de introspecção como :func:`annotationlib.get_annotations` e :func:`typing.get_type_hints` têm menor probabilidade de resolver anotações em tempo de execução.

source: Footnotes
pt_br: Notas de rodapé

source: The exception is propagated to the invocation stack unless there is a :keyword:`finally` clause which happens to raise another exception. That new exception causes the old one to be lost.
pt_br: A exceção é propagada para a pilha de invocação, a menos que haja uma cláusula :keyword:`finally` que por acaso levante outra exceção. Essa nova exceção faz com que a antiga seja perdida.

source: In pattern matching, a sequence is defined as one of the following:
pt_br: Na correspondência de padrões, uma sequência é definida como uma das seguintes:

source: a class that inherits from :class:`collections.abc.Sequence`
pt_br: uma classe que herda de :class:`collections.abc.Sequence`

source: a Python class that has been registered as :class:`collections.abc.Sequence`
pt_br: uma classe Python que foi registrada como :class:`collections.abc.Sequence`

source: a builtin class that has its (CPython) :c:macro:`Py_TPFLAGS_SEQUENCE` bit set
pt_br: uma classe embutida que tem seu bit :c:macro:`Py_TPFLAGS_SEQUENCE` (CPython) definido

source: a class that inherits from any of the above
pt_br: uma classe que herda de qualquer uma das anteriores

source: The following standard library classes are sequences:
pt_br: As seguintes classes de biblioteca padrão são sequências:

source: Subject values of type ``str``, ``bytes``, and ``bytearray`` do not match sequence patterns.
pt_br: Valores de assunto do tipo ``str``, ``bytes`` e ``bytearray`` não correspondem aos padrões de sequência.

source: In pattern matching, a mapping is defined as one of the following:
pt_br: Na correspondência de padrões, um mapeamento é definido como uma das seguintes:

source: a class that inherits from :class:`collections.abc.Mapping`
pt_br: uma classe que herda de :class:`collections.abc.Mapping`

source: a Python class that has been registered as :class:`collections.abc.Mapping`
pt_br: uma classe Python que foi registrada como :class:`collections.abc.Mapping`

source: a builtin class that has its (CPython) :c:macro:`Py_TPFLAGS_MAPPING` bit set
pt_br: uma classe embutida que tem seu bit :c:macro:`Py_TPFLAGS_MAPPING` (CPython) definido

source: The standard library classes :class:`dict` and :class:`types.MappingProxyType` are mappings.
pt_br: As classes de biblioteca padrão :class:`dict` e :class:`types.MappingProxyType` são mapeamentos.

source: A string literal appearing as the first statement in the function body is transformed into the function's :attr:`~function.__doc__` attribute and therefore the function's :term:`docstring`.
pt_br: Um literal de string que aparece como a primeira instrução no corpo da função é transformado no atributo :attr:`~function.__doc__` da função e, portanto, no :term:`docstring` da função.

source: A string literal appearing as the first statement in the class body is transformed into the namespace's :attr:`~type.__doc__` item and therefore the class's :term:`docstring`.
pt_br: Um literal de string que aparece como a primeira instrução no corpo da classe é transformado no item :attr:`~type.__doc__` do espaço de nomes e, portanto, no :term:`docstring` da classe.

source: statement
pt_br: instrução

source: clause
pt_br: cláusula

source: suite
pt_br: conjunto (suite)

source: ; (semicolon)
pt_br: ; (ponto e vírgula)

source: NEWLINE token
pt_br: token NEWLINE

source: DEDENT token
pt_br: token DEDENT

source: dangling
pt_br: pendurado

source: keyword
pt_br: palavra reservada

source: : (colon)
pt_br: : (dois pontos)

source: compound statement
pt_br: instrução composta

source: loop
pt_br: laço

source: target
pt_br: alvo

source: list
pt_br: lista

source: object
pt_br: objeto

source: sequence
pt_br: sequência

source: built-in function
pt_br: função embutida

source: except clause
pt_br: cláusula except

source: module
pt_br: módulo

source: with statement
pt_br: instrução with

source: , (comma)
pt_br: , (vírgula)

source: pattern matching
pt_br: correspondência de padrões

source: match statement
pt_br: instrução match

source: irrefutable case block
pt_br: bloco irrefutável de case

source: case block
pt_br: bloco de case

source: ! patterns
pt_br: padrões !

source: AS pattern, OR pattern, capture pattern, wildcard pattern
pt_br: padrão AS, padrão OR, padrão de captura, padrão curinga

source: parameter
pt_br: parâmetro

source: function definition
pt_br: definição de função

source: function
pt_br: função

source: definition
pt_br: definição

source: name
pt_br: nome

source: binding
pt_br: vinculação

source: user-defined function
pt_br: função definida por usuário

source: () (parentheses)
pt_br: () (parênteses)

source: parameter list
pt_br: lista de parâmetros

source: @ (at)
pt_br: @ (arroba)

source: argument
pt_br: argumento

source: = (equals)
pt_br: = (igual)

source: / (slash)
pt_br: / (barra)

source: * (asterisk)
pt_br: * (asterisco)

source: function annotations
pt_br: anotações de função

source: expression
pt_br: expressão

source: class
pt_br: classe

source: execution
pt_br: execução

source: frame
pt_br: quadro

source: inheritance
pt_br: herança

source: class definition
pt_br: definição de classe

source: expression list
pt_br: expressão, lista de

source: type parameters
pt_br: parâmetros de tipo
