Repository: python/python-docs-pt-br
Catalog: reference/compound_stmts.po
Languages: pt_br

source: Prior to Python 3.8, a :keyword:`continue` statement was illegal in the :keyword:`!finally` clause due to a problem with the implementation.
pt_br: Antes do Python 3.8, uma instrução :keyword:`continue` era ilegal na cláusula :keyword:`!finally` devido a um problema com a implementação.

source: The compiler emits a :exc:`SyntaxWarning` when a :keyword:`return`, :keyword:`break` or :keyword:`continue` appears in a :keyword:`!finally` block (see :pep:`765`).
pt_br: O compilador emite uma exceção :exc:`SyntaxWarning` quando um :keyword:`return`, :keyword:`break` ou :keyword:`continue` aparece em um bloco :keyword:`!finally` (veja :pep:`765`).

source: The :keyword:`!with` statement
pt_br: A instrução :keyword:`!with`

source: The :keyword:`with` statement is used to wrap the execution of a block with methods defined by a context manager (see section :ref:`context-managers`). This allows common :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` usage patterns to be encapsulated for convenient reuse.
pt_br: A instrução :keyword:`with` é usada para envolver em um invólucro a execução de um bloco com métodos definidos por um gerenciador de contexto (veja a seção :ref:`context-managers`). Isso permite que padrões comuns de uso de :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` sejam encapsulados para reutilização conveniente.

source: The execution of the :keyword:`with` statement with one "item" proceeds as follows:
pt_br: A execução da instrução :keyword:`with` com um "item" ocorre da seguinte maneira:

source: The context expression (the expression given in the :token:`~python-grammar:with_item`) is evaluated to obtain a context manager.
pt_br: A expressão de contexto (a expressão fornecida em :token:`~python-grammar:with_item`) é avaliada para obter um gerenciador de contexto.

source: The context manager's :meth:`~object.__enter__` is loaded for later use.
pt_br: O :meth:`~object.__enter__` do gerenciador de contexto é carregado para uso posterior.

source: The context manager's :meth:`~object.__exit__` is loaded for later use.
pt_br: O :meth:`~object.__exit__` do gerenciador de contexto é carregado para uso posterior.

source: The context manager's :meth:`~object.__enter__` method is invoked.
pt_br: O método :meth:`~object.__enter__` do gerenciador de contexto é invocado.

source: If a target was included in the :keyword:`with` statement, the return value from :meth:`~object.__enter__` is assigned to it.
pt_br: Se um alvo foi incluído na instrução :keyword:`with`, o valor de retorno de :meth:`~object.__enter__` é atribuído a ele.

source: The :keyword:`with` statement guarantees that if the :meth:`~object.__enter__` method returns without an error, then :meth:`~object.__exit__` will always be called. Thus, if an error occurs during the assignment to the target list, it will be treated the same as an error occurring within the suite would be. See step 7 below.
pt_br: A instrução :keyword:`with` garante que se o método :meth:`~object.__enter__` retornar sem um erro, então :meth:`~object.__exit__` sempre será chamado. Assim, se ocorrer um erro durante a atribuição à lista de alvos, ele será tratado da mesma forma que um erro ocorrendo dentro do conjunto seria. Veja a etapa 7 abaixo.

source: The suite is executed.
pt_br: O conjunto é executado.

source: The context manager's :meth:`~object.__exit__` method is invoked. If an exception caused the suite to be exited, its type, value, and traceback are passed as arguments to :meth:`~object.__exit__`. Otherwise, three :const:`None` arguments are supplied.
pt_br: O método :meth:`~object.__exit__` do gerenciador de contexto é invocado. Se uma exceção fez com que o conjunto fosse encerrado, seu tipo, valor e traceback são passados como argumentos para :meth:`~object.__exit__`. Caso contrário, três argumentos :const:`None` são fornecidos.

source: If the suite was exited due to an exception, and the return value from the :meth:`~object.__exit__` method was false, the exception is reraised. If the return value was true, the exception is suppressed, and execution continues with the statement following the :keyword:`with` statement.
pt_br: Se o conjunto foi encerrado devido a uma exceção, e o valor de retorno do método :meth:`~object.__exit__` foi falso, a exceção é levantada novamente. Se o valor de retorno era verdadeiro, a exceção é suprimida, e a execução continua com a instrução após a instrução :keyword:`with`.

source: If the suite was exited for any reason other than an exception, the return value from :meth:`~object.__exit__` is ignored, and execution proceeds at the normal location for the kind of exit that was taken.
pt_br: Se o conjunto foi encerrado por qualquer motivo diferente de uma exceção, o valor de retorno de :meth:`~object.__exit__` é ignorado e a execução prossegue no local normal para o tipo de saída que foi realizada.

source: The following code::
pt_br: O seguinte código::

source: is semantically equivalent to::
pt_br: é semanticamente equivalente a::

source: With more than one item, the context managers are processed as if multiple :keyword:`with` statements were nested::
pt_br: Com mais de um item, os gerenciadores de contexto são processados como se várias instruções :keyword:`with` estivessem aninhadas::

source: You can also write multi-item context managers in multiple lines if the items are surrounded by parentheses. For example::
pt_br: Você também pode escrever gerenciadores de contexto multi-item em várias linhas se os itens estiverem entre parênteses. Por exemplo::

source: Support for multiple context expressions.
pt_br: Suporte para múltiplas expressões de contexto.

source: Support for using grouping parentheses to break the statement in multiple lines.
pt_br: Suporte para usar parênteses de agrupamento para dividir a instrução em várias linhas.

source: :pep:`343` - The "with" statement
pt_br: :pep:`343` - A instrução "with"

source: The specification, background, and examples for the Python :keyword:`with` statement.
pt_br: A especificação, o histórico e os exemplos para a instrução Python :keyword:`with`.

source: The :keyword:`!match` statement
pt_br: A instrução :keyword:`!match`

source: The match statement is used for pattern matching. Syntax:
pt_br: A instrução match é usada para correspondência de padrões. Sintaxe:

source: This section uses single quotes to denote :ref:`soft keywords <soft-keywords>`.
pt_br: Esta seção usa aspas simples para denotar :ref:`palavras reservadas contextuais <soft-keywords>`.

source: Pattern matching takes a pattern as input (following ``case``) and a subject value (following ``match``). The pattern (which may contain subpatterns) is matched against the subject value. The outcomes are:
pt_br: A correspondência de padrões aceita um padrão como entrada (seguindo ``case``) e um valor de sujeito (seguindo ``match``). O padrão (que pode conter subpadrões) é correspondido ao valor de assunto. Os resultados são:

source: A match success or failure (also termed a pattern success or failure).
pt_br: Um sucesso ou falha de correspondência (também chamado de sucesso ou falha de padrão).

source: Possible binding of matched values to a name. The prerequisites for this are further discussed below.
pt_br: Possível vinculação de valores correspondentes a um nome. Os pré-requisitos para isso são discutidos mais adiante.

source: The ``match`` and ``case`` keywords are :ref:`soft keywords <soft-keywords>`.
pt_br: As palavras reservadas ``match`` e ``case`` são :ref:`palavras reservadas contextuais <soft-keywords>`.

source: :pep:`636` -- Structural Pattern Matching: Tutorial
pt_br: :pep:`636` -- Correspondência de padrões estruturais: Tutorial

source: Overview
pt_br: Visão Geral

source: Here's an overview of the logical flow of a match statement:
pt_br: Aqui está uma visão geral do fluxo lógico de uma instrução match:

source: The subject expression ``subject_expr`` is evaluated and a resulting subject value obtained. If the subject expression contains a comma, a tuple is constructed using :ref:`the standard rules <typesseq-tuple>`.
pt_br: A expressão de sujeito ``subject_expr`` é avaliada e um valor de sujeito resultante é obtido. Se a expressão de sujeito contiver uma vírgula, uma tupla é construída usando :ref:`as regras padrão <typesseq-tuple>`.

source: Each pattern in a ``case_block`` is attempted to match with the subject value. The specific rules for success or failure are described below. The match attempt can also bind some or all of the standalone names within the pattern. The precise pattern binding rules vary per pattern type and are specified below. **Name bindings made during a successful pattern match outlive the executed block and can be used after the match statement**.
pt_br: Cada padrão em um ``case_block`` é tentado para corresponder ao valor de sujeito. As regras específicas para sucesso ou falha são descritas abaixo. A tentativa de correspondência também pode vincular alguns ou todos os nomes autônomos dentro do padrão. As regras precisas de vinculação de padrão variam por tipo de padrão e são especificadas abaixo. **As vinculações de nome feitas durante uma correspondência de padrão bem-sucedida sobrevivem ao bloco executado e podem ser usadas após a instrução match**.

source: During failed pattern matches, some subpatterns may succeed. Do not rely on bindings being made for a failed match. Conversely, do not rely on variables remaining unchanged after a failed match. The exact behavior is dependent on implementation and may vary. This is an intentional decision made to allow different implementations to add optimizations.
pt_br: Durante correspondências de padrões com falha, alguns subpadrões podem ter sucesso. Não confie em vinculações sendo feitas para uma correspondência com falha. Por outro lado, não confie em variáveis permanecendo inalteradas após uma correspondência com falha. O comportamento exato depende da implementação e pode variar. Esta é uma decisão intencional feita para permitir que diferentes implementações adicionem otimizações.

source: If the pattern succeeds, the corresponding guard (if present) is evaluated. In this case all name bindings are guaranteed to have happened.
pt_br: Se o padrão for bem-sucedido, o *guard* correspondente (se presente) é avaliado. Neste caso, todas as vinculações de nome são garantidas como tendo acontecido.

source: If the guard evaluates as true or is missing, the ``block`` inside ``case_block`` is executed.
pt_br: Se o *guard* for avaliado como verdadeiro ou estiver ausente, o ``block`` dentro de ``case_block`` será executado.

source: Otherwise, the next ``case_block`` is attempted as described above.
pt_br: Caso contrário, o próximo ``case_block`` será tentado conforme descrito acima.

source: If there are no further case blocks, the match statement is completed.
pt_br: Se não houver mais blocos de caso, a instrução match será concluída.

source: Users should generally never rely on a pattern being evaluated. Depending on implementation, the interpreter may cache values or use other optimizations which skip repeated evaluations.
pt_br: Os usuários geralmente nunca devem confiar em um padrão sendo avaliado. Dependendo da implementação, o interpretador pode armazenar valores em cache ou usar outras otimizações que pulam avaliações repetidas.

source: A sample match statement::
pt_br: Um exemplo de instrução match::

source: >>> flag = False >>> match (100, 200): ... case (100, 300): # Mismatch: 200 != 300 ... print('Case 1') ... case (100, 200) if flag: # Successful match, but guard fails ... print('Case 2') ... case (100, y): # Matches and binds y to 200 ... print(f'Case 3, y: {y}') ... case _: # Pattern not attempted ... print('Case 4, I match anything!') ... Case 3, y: 200
pt_br: >>> flag = False >>> match (100, 200): ... case (100, 300): # Não corresponde: 200 != 300 ... print('Case 1') ... case (100, 200) if flag: # Corresponde com sucesso, mas o guard falha... print('Case 2') ... case (100, y): # Corresponde e vincula y a 200 ... print(f'Case 3, y: {y}') ... case _: # Padrão não testado ... print('Case 4, I match anything!') ... Case 3, y: 200

source: In this case, ``if flag`` is a guard. Read more about that in the next section.
pt_br: Neste caso, ``if flag`` é um *guard*. Leia mais sobre isso na próxima seção.

source: A ``guard`` (which is part of the ``case``) must succeed for code inside the ``case`` block to execute. It takes the form: :keyword:`if` followed by an expression.
pt_br: Um ``guard`` (que faz parte do ``case``) deve ter sucesso para que o código dentro do bloco ``case`` seja executado. Ele assume a forma: :keyword:`if` seguido por uma expressão.

source: The logical flow of a ``case`` block with a ``guard`` follows:
pt_br: O fluxo lógico de um bloco ``case`` com um ``guard`` é o seguinte:

source: Check that the pattern in the ``case`` block succeeded. If the pattern failed, the ``guard`` is not evaluated and the next ``case`` block is checked.
pt_br: Verifique se o padrão no bloco ``case`` foi bem-sucedido. Se o padrão falhou, o ``guard`` não é avaliado e o próximo bloco ``case`` é verificado.

source: If the pattern succeeded, evaluate the ``guard``.
pt_br: Se o padrão for bem-sucedido, avalia o ``guard``.

source: If the ``guard`` condition evaluates as true, the case block is selected.
pt_br: Se a condição ``guard`` for avaliada como verdadeira, o bloco de caso será selecionado.

source: If the ``guard`` condition evaluates as false, the case block is not selected.
pt_br: Se a condição ``guard`` for avaliada como falsa, o bloco de caso não será selecionado.

source: If the ``guard`` raises an exception during evaluation, the exception bubbles up.
pt_br: Se o ``guard`` levantar uma exceção durante a avaliação, a exceção surgirá.

source: Guards are allowed to have side effects as they are expressions. Guard evaluation must proceed from the first to the last case block, one at a time, skipping case blocks whose pattern(s) don't all succeed. (I.e., guard evaluation must happen in order.) Guard evaluation must stop once a case block is selected.
pt_br: Guards podem ter efeitos colaterais, pois são expressões. A avaliação de guards deve prosseguir do primeiro ao último bloco de caso, um de cada vez, pulando blocos de caso cujos padrões não são todos bem-sucedidos. (Isto é, a avaliação de guardas deve acontecer em ordem.) A avaliação de guards deve parar quando um bloco de caso for selecionado.

source: Irrefutable Case Blocks
pt_br: Blocos irrefutáveis de case

source: An irrefutable case block is a match-all case block. A match statement may have at most one irrefutable case block, and it must be last.
pt_br: Um bloco irrefutável de case é um bloco de case que corresponde a qualquer valor. Uma instrução match pode ter no máximo um bloco irrefutável de case, e ele deve ser o último.

source: A case block is considered irrefutable if it has no guard and its pattern is irrefutable. A pattern is considered irrefutable if we can prove from its syntax alone that it will always succeed. Only the following patterns are irrefutable:
pt_br: Um bloco de case é considerado irrefutável se não tiver guard e seu padrão for irrefutável. Um padrão é considerado irrefutável se pudermos provar somente por sua sintaxe que ele sempre terá sucesso. Somente os seguintes padrões são irrefutáveis:

source: :ref:`as-patterns` whose left-hand side is irrefutable
pt_br: :ref:`as-patterns` cujo lado esquerdo é irrefutável

source: :ref:`or-patterns` containing at least one irrefutable pattern
pt_br: :ref:`or-patterns` contendo pelo menos um padrão irrefutável

source: parenthesized irrefutable patterns
pt_br: padrões irrefutáveis entre parêteses

source: Patterns
pt_br: Padrões

source: This section uses grammar notations beyond standard EBNF:
pt_br: Esta seção usa notações de gramática para além do padrão de EBNF:

source: the notation ``SEP.RULE+`` is shorthand for ``RULE (SEP RULE)*``
pt_br: a notação ``SEP.RULE+`` é uma abreviação para ``RULE (SEP RULE)*``

source: the notation ``!RULE`` is shorthand for a negative lookahead assertion
pt_br: a notação ``!RULE`` é uma abreviação para uma asserção de negação antecipada.

source: The top-level syntax for ``patterns`` is:
pt_br: Esta é a sintaxe de nível superior para ``patterns`` (padrões):

source: The descriptions below will include a description "in simple terms" of what a pattern does for illustration purposes (credits to Raymond Hettinger for a document that inspired most of the descriptions). Note that these descriptions are purely for illustration purposes and **may not** reflect the underlying implementation. Furthermore, they do not cover all valid forms.
pt_br: As descrições abaixo incluirão uma descrição "em termos simples" de o que o padrão faz para fins ilustrativos (créditos a Raymond Hettinger pelo documento que inspirou a maioria das descrições). Note que essas descrições são puramente para fins ilustrativos, e **não necessariamente** refletem a implementação subjacente. Além disso, elas não cobrem todas as formas válidas.

source: OR Patterns
pt_br: Padrões OR

source: An OR pattern is two or more patterns separated by vertical bars ``|``. Syntax:
pt_br: Um padrão OR é composto por dois ou mais padrões separados por barras verticais ``|``. Sintaxe:

source: Only the final subpattern may be :ref:`irrefutable <irrefutable_case>`, and each subpattern must bind the same set of names to avoid ambiguity.
pt_br: Somente o último subpadrão pode ser :ref:`irrefutável <irrefutable_case>`, e cada subpadrão deve vincular o mesmo conjunto de nomes para evitar ambiguidades.

source: An OR pattern matches each of its subpatterns in turn to the subject value, until one succeeds. The OR pattern is then considered successful. Otherwise, if none of the subpatterns succeed, the OR pattern fails.
pt_br: Um padrão OR testa a correspondência de cada um dos seus subpadrões, em sequência, ao valor do sujeito, até que uma delas seja bem sucedida. O padrão OR é então considerado bem sucedido. Caso contrário, se todas elas falharam, o padrão OR falhou.

source: In simple terms, ``P1 | P2 | ...`` will try to match ``P1``, if it fails it will try to match ``P2``, succeeding immediately if any succeeds, failing otherwise.
pt_br: Em termos simples, ``P1 | P2 | ...`` vai tentar fazer corresponder ``P1``, se falhar vai tentar ``P2``, declarando sucesso se houver sucesso em qualquer uma das tentativas, e falhando caso contrário.

source: AS Patterns
pt_br: Padrões AS

source: An AS pattern matches an OR pattern on the left of the :keyword:`as` keyword against a subject. Syntax:
pt_br: Um padrão AS corresponde a um padrão OR à esquerda da palavra reservada :keyword:`as` de um assunto. Sintaxe:

source: If the OR pattern fails, the AS pattern fails. Otherwise, the AS pattern binds the subject to the name on the right of the as keyword and succeeds. ``capture_pattern`` cannot be a ``_``.
pt_br: Se o padrão OR falhar, o padrão AS falhará. Caso contrário, o padrão AS vincula o assunto ao nome à direita da palavra-chave as e obtém sucesso. ``capture_pattern`` não pode ser um ``_``.

source: In simple terms ``P as NAME`` will match with ``P``, and on success it will set ``NAME = <subject>``.
pt_br: Em termos simples, ``P as NAME`` corresponderá a ``P`` e, em caso de sucesso, definirá ``NAME = <assunto>``.

source: Literal Patterns
pt_br: Padrões literais

source: A literal pattern corresponds to most :ref:`literals <literals>` in Python. Syntax:
pt_br: Um padrão literal corresponde à maioria dos :ref:`literais <literals>` em Python. Sintaxe:

source: The rule ``strings`` and the token ``NUMBER`` are defined in the :doc:`standard Python grammar <./grammar>`. Triple-quoted strings are supported. Raw strings and byte strings are supported. :ref:`f-strings` and :ref:`t-strings` are not supported.
pt_br: A regra ``strings`` e o token ``NUMBER`` são definidos na :doc:`gramática padrão do Python <./grammar>`. Strings entre aspas triplas são suportadas. Strings brutas e strings de bytes são suportadas. :ref:`f-strings` e :ref:`t-strings` não são suportadas.

source: The forms ``signed_number '+' NUMBER`` and ``signed_number '-' NUMBER`` are for expressing :ref:`complex numbers <imaginary>`; they require a real number on the left and an imaginary number on the right. E.g. ``3 + 4j``.
pt_br: As formas ``signed_number '+' NUMBER`` e ``signed_number '-' NUMBER`` são para expressar :ref:`números complexos <imaginary>`; elas requerem um número real à esquerda e um número imaginário à direita. Por exemplo, ``3 + 4j``.

source: In simple terms, ``LITERAL`` will succeed only if ``<subject> == LITERAL``. For the singletons ``None``, ``True`` and ``False``, the :keyword:`is` operator is used.
pt_br: Em termos simples, ``LITERAL`` terá sucesso somente se ``<assunto> == LITERAL``. Para os singletons ``None``, ``True`` e ``False``, o operador :keyword:`is` é usado.

source: Capture Patterns
pt_br: Padrões de captura

source: A capture pattern binds the subject value to a name. Syntax:
pt_br: Um padrão de captura vincula o valor do assunto a um nome. Sintaxe:

source: A single underscore ``_`` is not a capture pattern (this is what ``!'_'`` expresses). It is instead treated as a :token:`~python-grammar:wildcard_pattern`.
pt_br: Um único sublinhado ``_`` não é um padrão de captura (é o que ``!'_'`` expressa). Em vez disso, ele é tratado como um :token:`~python-grammar:wildcard_pattern`.

source: In a given pattern, a given name can only be bound once. E.g. ``case x, x: ...`` is invalid while ``case [x] | x: ...`` is allowed.
pt_br: Em um determinado padrão, um determinado nome só pode ser vinculado uma vez. Por exemplo, ``case x, x: ...`` é inválido enquanto ``case [x] | x: ...`` é permitido.

source: Capture patterns always succeed. The binding follows scoping rules established by the assignment expression operator in :pep:`572`; the name becomes a local variable in the closest containing function scope unless there's an applicable :keyword:`global` or :keyword:`nonlocal` statement.
pt_br: Os padrões de captura sempre são bem-sucedidos. A vinculação segue regras de escopo estabelecidas pelo operador de expressão de atribuição na :pep:`572`; o nome se torna uma variável local no escopo de função de contenção mais próximo, a menos que haja uma instrução :keyword:`global` ou :keyword:`nonlocal` aplicável.

source: In simple terms ``NAME`` will always succeed and it will set ``NAME = <subject>``.
pt_br: Em termos simples, ``NAME`` sempre terá sucesso e definirá ``NAME = <assunto>``.

source: Wildcard Patterns
pt_br: Padrões curingas

source: A wildcard pattern always succeeds (matches anything) and binds no name. Syntax:
pt_br: Um padrão curinga sempre tem sucesso (corresponde a qualquer coisa) e não vincula nenhum nome. Sintaxe:

source: ``_`` is a :ref:`soft keyword <soft-keywords>` within any pattern, but only within patterns. It is an identifier, as usual, even within ``match`` subject expressions, ``guard``\ s, and ``case`` blocks.
pt_br: ``_`` é uma :ref:`palavra reservada contextual <soft-keywords>` dentro de qualquer padrão, mas somente dentro de padrões. É um identificador, como de costume, mesmo dentro de expressões de assunto ``match``\ s, ``guard``\ s e blocos ``case``.

source: In simple terms, ``_`` will always succeed.
pt_br: Em termos simples, ``_`` sempre terá sucesso.

source: Value Patterns
pt_br: Padrões de valor

source: A value pattern represents a named value in Python. Syntax:
pt_br: Um padrão de valor representa um valor nomeado em Python. Sintaxe:
