Repository: python/python-docs-pt-br
Catalog: reference/compound_stmts.po
Languages: pt_br

source: The dotted name in the pattern is looked up using standard Python :ref:`name resolution rules <resolve_names>`. The pattern succeeds if the value found compares equal to the subject value (using the ``==`` equality operator).
pt_br: O nome pontilhado no padrão é pesquisado usando as :ref:`regras de resolução de nomes <resolve_names>` padrão do Python. O padrão é bem-sucedido se o valor encontrado for comparado igual ao valor do assunto (usando o operador de igualdade ``==``).

source: In simple terms ``NAME1.NAME2`` will succeed only if ``<subject> == NAME1.NAME2``
pt_br: Em termos simples, ``NAME1.NAME2`` terá sucesso somente se ``<assunto> == NAME1.NAME2``

source: If the same value occurs multiple times in the same match statement, the interpreter may cache the first value found and reuse it rather than repeat the same lookup. This cache is strictly tied to a given execution of a given match statement.
pt_br: Se o mesmo valor ocorrer várias vezes na mesma instrução match, o interpretador pode armazenar em cache o primeiro valor encontrado e reutilizá-lo em vez de repetir a mesma pesquisa. Esse cache é estritamente vinculado a uma determinada execução de uma determinada instrução match.

source: Group Patterns
pt_br: Padrões de grupo

source: A group pattern allows users to add parentheses around patterns to emphasize the intended grouping. Otherwise, it has no additional syntax. Syntax:
pt_br: Um padrão de grupo permite que os usuários adicionem parênteses em torno de padrões para enfatizar o agrupamento pretendido. Caso contrário, não há sintaxe adicional. Sintaxe:

source: In simple terms ``(P)`` has the same effect as ``P``.
pt_br: Em termos simples, ``(P)`` tem o mesmo efeito que ``P``.

source: Sequence Patterns
pt_br: Padrões de sequência

source: A sequence pattern contains several subpatterns to be matched against sequence elements. The syntax is similar to the unpacking of a list or tuple.
pt_br: Um padrão de sequência contém vários subpadrões a serem correspondidos com elementos de sequência. A sintaxe é similar ao desempacotamento de uma lista ou tupla.

source: There is no difference if parentheses or square brackets are used for sequence patterns (i.e. ``(...)`` vs ``[...]`` ).
pt_br: Não há diferença se parênteses ou colchetes são usados para padrões de sequência (por exemplo, ``(...)`` vs ``[...]``).

source: A single pattern enclosed in parentheses without a trailing comma (e.g. ``(3 | 4)``) is a :ref:`group pattern <group-patterns>`. While a single pattern enclosed in square brackets (e.g. ``[3 | 4]``) is still a sequence pattern.
pt_br: Um único padrão entre parênteses sem uma vírgula final (por exemplo, ``(3 | 4)``) é um :ref:`padrão de grupo <group-patterns>`. Enquanto um único padrão entre colchetes (por exemplo, ``[3 | 4]``) ainda é um padrão de sequência.

source: At most one star subpattern may be in a sequence pattern. The star subpattern may occur in any position. If no star subpattern is present, the sequence pattern is a fixed-length sequence pattern; otherwise it is a variable-length sequence pattern.
pt_br: No máximo um subpadrão de estrela pode estar em um padrão de sequência. O subpadrão de estrela pode ocorrer em qualquer posição. Se nenhum subpadrão de estrela estiver presente, o padrão de sequência é um padrão de sequência de comprimento fixo; caso contrário, é um padrão de sequência de comprimento variável.

source: The following is the logical flow for matching a sequence pattern against a subject value:
pt_br: A seguir está o fluxo lógico para corresponder um padrão de sequência com um valor de assunto:

source: If the subject value is not a sequence [#]_, the sequence pattern fails.
pt_br: Se o valor do assunto não for uma sequência [#]_, o padrão de sequência falhará.

source: If the subject value is an instance of ``str``, ``bytes`` or ``bytearray`` the sequence pattern fails.
pt_br: Se o valor do assunto for uma instância de ``str``, ``bytes`` ou ``bytearray``, o padrão de sequência falhará.

source: The subsequent steps depend on whether the sequence pattern is fixed or variable-length.
pt_br: As etapas subsequentes dependem se o padrão de sequência é fixo ou de comprimento variável.

source: If the sequence pattern is fixed-length:
pt_br: Se o padrão de sequência for de comprimento fixo:

source: If the length of the subject sequence is not equal to the number of subpatterns, the sequence pattern fails
pt_br: Se o comprimento da sequência do assunto não for igual ao número de subpadrões, o padrão da sequência falha

source: Subpatterns in the sequence pattern are matched to their corresponding items in the subject sequence from left to right. Matching stops as soon as a subpattern fails. If all subpatterns succeed in matching their corresponding item, the sequence pattern succeeds.
pt_br: Subpadrões no padrão de sequência são correspondidos aos seus itens correspondentes na sequência de assunto da esquerda para a direita. A correspondência para assim que um subpadrão falha. Se todos os subpadrões tiverem sucesso em corresponder ao seu item correspondente, o padrão de sequência é bem-sucedido.

source: Otherwise, if the sequence pattern is variable-length:
pt_br: Caso contrário, se o padrão de sequência for de comprimento variável:

source: If the length of the subject sequence is less than the number of non-star subpatterns, the sequence pattern fails.
pt_br: Se o comprimento da sequência do assunto for menor que o número de subpadrões não-estrela, o padrão da sequência falha.

source: The leading non-star subpatterns are matched to their corresponding items as for fixed-length sequences.
pt_br: Os principais subpadrões não estelares são correspondidos aos seus itens correspondentes, como nas sequências de comprimento fixo.

source: If the previous step succeeds, the star subpattern matches a list formed of the remaining subject items, excluding the remaining items corresponding to non-star subpatterns following the star subpattern.
pt_br: Se a etapa anterior for bem-sucedida, o subpadrão estrela corresponde a uma lista formada pelos itens de assunto restantes, excluindo os itens restantes correspondentes aos subpadrões não-estrela que seguem o subpadrão estrela.

source: Remaining non-star subpatterns are matched to their corresponding subject items, as for a fixed-length sequence.
pt_br: Os subpadrões não-estrela restantes são correspondidos aos seus itens de assunto correspondentes, como em uma sequência de comprimento fixo.

source: In simple terms ``[P1, P2, P3,`` ... ``, P<N>]`` matches only if all the following happens:
pt_br: Em termos simples, ``[P1, P2, P3,`` ... ``, P<N>]`` corresponde somente se tudo o seguinte acontecer:

source: check ``<subject>`` is a sequence
pt_br: verifica se ``<subject>`` é uma sequência

source: ``P1`` matches ``<subject>[0]`` (note that this match can also bind names)
pt_br: ``P1`` corresponde a ``<subject>[0]`` (observe que esta correspondência também pode vincular nomes)

source: ``P2`` matches ``<subject>[1]`` (note that this match can also bind names)
pt_br: ``P2`` corresponde a ``<subject>[1]`` (observe que esta correspondência também pode vincular nomes)

source: ... and so on for the corresponding pattern/element.
pt_br: ... e assim por diante para o padrão/elemento correspondente.

source: Mapping Patterns
pt_br: Padrões de mapeamento

source: A mapping pattern contains one or more key-value patterns. The syntax is similar to the construction of a dictionary. Syntax:
pt_br: Um padrão de mapeamento contém um ou mais padrões de chave-valor. A sintaxe é similar à construção de um dicionário. Sintaxe:

source: At most one double star pattern may be in a mapping pattern. The double star pattern must be the last subpattern in the mapping pattern.
pt_br: No máximo um padrão de estrela dupla pode estar em um padrão de mapeamento. O padrão de estrela dupla deve ser o último subpadrão no padrão de mapeamento.

source: Duplicate keys in mapping patterns are disallowed. Duplicate literal keys will raise a :exc:`SyntaxError`. Two keys that otherwise have the same value will raise a :exc:`ValueError` at runtime.
pt_br: Chaves duplicadas em padrões de mapeamento não são permitidas. Chaves literais duplicadas levantarão um :exc:`SyntaxError`. Duas chaves que de outra forma têm o mesmo valor levantarão :exc:`ValueError` em tempo de execução.

source: The following is the logical flow for matching a mapping pattern against a subject value:
pt_br: A seguir está o fluxo lógico para comparar um padrão de mapeamento com um valor de assunto:

source: If the subject value is not a mapping [#]_,the mapping pattern fails.
pt_br: Se o valor do assunto não for um mapeamento [#]_, o padrão de mapeamento falhará.

source: If every key given in the mapping pattern is present in the subject mapping, and the pattern for each key matches the corresponding item of the subject mapping, the mapping pattern succeeds.
pt_br: Se cada chave fornecida no padrão de mapeamento estiver presente no mapeamento de assunto, e o padrão para cada chave corresponder ao item correspondente do mapeamento de assunto, o padrão de mapeamento será bem-sucedido.

source: If duplicate keys are detected in the mapping pattern, the pattern is considered invalid. A :exc:`SyntaxError` is raised for duplicate literal values; or a :exc:`ValueError` for named keys of the same value.
pt_br: Se chaves duplicadas forem detectadas no padrão de mapeamento, o padrão será considerado inválido. Uma exceção :exc:`SyntaxError` é levantada para valores literais duplicados; ou :exc:`ValueError` para chaves nomeadas do mesmo valor.

source: In simple terms ``{KEY1: P1, KEY2: P2, ... }`` matches only if all the following happens:
pt_br: Em termos simples, ``{KEY1: P1, KEY2: P2, ... }`` corresponde somente se tudo o seguinte acontecer:

source: check ``<subject>`` is a mapping
pt_br: verifica se ``<assunto>`` é um mapeamento

source: ``KEY1 in <subject>``
pt_br: ``KEY1 in <assunto>``

source: ``P1`` matches ``<subject>[KEY1]``
pt_br: ``P1`` corresponde a ``<assunto>[KEY1]``

source: ... and so on for the corresponding KEY/pattern pair.
pt_br: ... e assim por diante para o par KEY/elemento correspondente.

source: Class Patterns
pt_br: Padrões de classe

source: A class pattern represents a class and its positional and keyword arguments (if any). Syntax:
pt_br: Um padrão de classe representa uma classe e seus argumentos nomeados e posicionais (se houver). Sintaxe:

source: The same keyword should not be repeated in class patterns.
pt_br: O mesmo argumento nomeado não deve ser repetido em padrões de classe.

source: The following is the logical flow for matching a class pattern against a subject value:
pt_br: A seguir está o fluxo lógico para corresponder a um padrão de classe com um valor de assunto:

source: If ``name_or_attr`` is not an instance of the builtin :class:`type` , raise :exc:`TypeError`.
pt_br: Se ``name_or_attr`` não for uma instância do tipo embutido :class:`type` , levanta :exc:`TypeError`.

source: If the subject value is not an instance of ``name_or_attr`` (tested via :func:`isinstance`), the class pattern fails.
pt_br: Se o valor do assunto não for uma instância de ``name_or_attr`` (testado via :func:`isinstance`), o padrão de classe falhará.

source: If no pattern arguments are present, the pattern succeeds. Otherwise, the subsequent steps depend on whether keyword or positional argument patterns are present.
pt_br: Se nenhum argumento de padrão estiver presente, o padrão é bem-sucedido. Caso contrário, as etapas subsequentes dependem se os padrões de argumento posicional ou nomeado estão presentes.

source: For a number of built-in types (specified below), a single positional subpattern is accepted which will match the entire subject; for these types keyword patterns also work as for other types.
pt_br: Para vários tipos embutidos (especificados abaixo), um único subpadrão posicional é aceito, o qual corresponderá a todo o assunto; para esses tipos, os padrões de argumentos nomeados também funcionam como para outros tipos.

source: If only keyword patterns are present, they are processed as follows, one by one:
pt_br: Se apenas padrões de argumentos nomeados estiverem presentes, eles serão processados da seguinte forma, um por um:

source: I. The keyword is looked up as an attribute on the subject.
pt_br: I. A palavra-chave é procurada como um atributo no assunto.

source: If this raises an exception other than :exc:`AttributeError`, the exception bubbles up.
pt_br: Se isso levantar uma exceção diferente de :exc:`AttributeError`, a exceção será exibida.

source: If this raises :exc:`AttributeError`, the class pattern has failed.
pt_br: Se isso levantar :exc:`AttributeError`, o padrão de classe falhou.

source: Else, the subpattern associated with the keyword pattern is matched against the subject's attribute value. If this fails, the class pattern fails; if this succeeds, the match proceeds to the next keyword.
pt_br: Caso contrário, o subpadrão associado ao padrão de argumento nomeado é correspondido ao valor de atributo do sujeito. Se isso falhar, o padrão de classe falha; se isso for bem-sucedido, a correspondência prossegue para o próximo argumento nomeado.

source: II. If all keyword patterns succeed, the class pattern succeeds.
pt_br: II. Se todos os padrões de argumento nomeado forem bem-sucedidos, o padrão de classe será bem-sucedido.

source: If any positional patterns are present, they are converted to keyword patterns using the :data:`~object.__match_args__` attribute on the class ``name_or_attr`` before matching:
pt_br: Se houver algum padrão posicional presente, ele será convertido em padrões de argumento nomeado usando o atributo :data:`~object.__match_args__` na classe ``name_or_attr`` antes da correspondência:

source: I. The equivalent of ``getattr(cls, "__match_args__", ())`` is called.
pt_br: I. O equivalente de ``getattr(cls, "__match_args__", ())`` é chamado.

source: If this raises an exception, the exception bubbles up.
pt_br: Se isso levantar uma exceção, a exceção surgirá.

source: If the returned value is not a tuple, the conversion fails and :exc:`TypeError` is raised.
pt_br: Se o valor retornado não for uma tupla, a conversão falhará e :exc:`TypeError` será levantada.

source: If there are more positional patterns than ``len(cls.__match_args__)``, :exc:`TypeError` is raised.
pt_br: Se houver mais padrões posicionais do que ``len(cls.__match_args__)``, :exc:`TypeError` será levantada.

source: Otherwise, positional pattern ``i`` is converted to a keyword pattern using ``__match_args__[i]`` as the keyword. ``__match_args__[i]`` must be a string; if not :exc:`TypeError` is raised.
pt_br: Caso contrário, o padrão posicional ``i`` é convertido em um padrão de argumento nomeado usando ``__match_args__[i]`` como argumento nomeado. ``__match_args__[i]`` deve ser uma string; caso contrário, :exc:`TypeError` é levantada.

source: If there are duplicate keywords, :exc:`TypeError` is raised.
pt_br: Se houver argumentos nomeados duplicados, :exc:`TypeError` será levantada.

source: II. Once all positional patterns have been converted to keyword patterns,
pt_br: II. Uma vez que todos os padrões posicionais foram convertidos em padrões de argumentos nomeados,

source: the match proceeds as if there were only keyword patterns.
pt_br: a partida prossegue como se houvesse apenas padrões de argumentos nomeados.

source: For the following built-in types the handling of positional subpatterns is different:
pt_br: Para os seguintes tipos embutidos, o tratamento de subpadrões posicionais é diferente:

source: These classes accept a single positional argument, and the pattern there is matched against the whole object rather than an attribute. For example ``int(0|1)`` matches the value ``0``, but not the value ``0.0``.
pt_br: Essas classes aceitam um único argumento posicional, e o padrão ali é correspondido ao objeto inteiro em vez de um atributo. Por exemplo, ``int(0|1)`` corresponde ao valor ``0``, mas não ao valor ``0.0``.

source: In simple terms ``CLS(P1, attr=P2)`` matches only if the following happens:
pt_br: Em termos simples, ``CLS(P1, attr=P2)`` corresponde somente se o seguinte acontecer:

source: ``isinstance(<subject>, CLS)``
pt_br: ``isinstance(<assunto>, CLS)``

source: convert ``P1`` to a keyword pattern using ``CLS.__match_args__``
pt_br: converte ``P1`` em um padrão de argumento nomeado usando ``CLS.__match_args__``

source: For each keyword argument ``attr=P2``:
pt_br: Para cada argumento de palavra-chave ``attr=P2``:

source: ``hasattr(<subject>, "attr")``
pt_br: ``hasattr(<assunto>, "attr")``

source: ``P2`` matches ``<subject>.attr``
pt_br: ``P2`` corresponde a ``<assunto>.attr``

source: ... and so on for the corresponding keyword argument/pattern pair.
pt_br: ... e assim por diante para o par argumento nomeado/elemento correspondente.

source: Function definitions
pt_br: Definições de função

source: A function definition defines a user-defined function object (see section :ref:`types`):
pt_br: Uma definição de função define um objeto de função definido pelo usuário (veja a seção :ref:`types`):

source: A function definition is an executable statement. Its execution binds the function name in the current local namespace to a function object (a wrapper around the executable code for the function). This function object contains a reference to the current global namespace as the global namespace to be used when the function is called.
pt_br: Uma definição de função é uma instrução executável. Sua execução vincula o nome da função no espaço de nomes local atual a um objeto função (um invólucro em torno do código executável para a função). Este objeto função contém uma referência ao espaço de nomes global atual como o espaço de nomes global a ser usado quando a função é chamada.

source: The function definition does not execute the function body; this gets executed only when the function is called. [#]_
pt_br: A definição da função não executa o corpo da função; ela é executada somente quando a função é chamada. [#]_

source: A function definition may be wrapped by one or more :term:`decorator` expressions. Decorator expressions are evaluated when the function is defined, in the scope that contains the function definition. The result must be a callable, which is invoked with the function object as the only argument. The returned value is bound to the function name instead of the function object. Multiple decorators are applied in nested fashion. For example, the following code ::
pt_br: Uma definição de função pode ser encapsulada por uma ou mais expressões :term:`decoradoras <decorador>`. Expressões decoradoras são avaliadas quando a função é definida, no escopo que contém a definição da função. O resultado deve ser um chamável, que é invocado com o objeto de função como o único argumento. O valor retornado é vinculado ao nome da função em vez do objeto de função. Vários decoradores são aplicados de forma aninhada. Por exemplo, o código a seguir ::

source: is roughly equivalent to ::
pt_br: é aproximadamente equivalente a ::

source: except that the original function is not temporarily bound to the name ``func``.
pt_br: exceto que a função original não está temporariamente vinculada ao nome ``func``.

source: Functions may be decorated with any valid :token:`~python-grammar:assignment_expression`. Previously, the grammar was much more restrictive; see :pep:`614` for details.
pt_br: Funções podem ser decoradas com qualquer :token:`~python-grammar:assignment_expression` válida. Anteriormente, a gramática era muito mais restritiva; veja :pep:`614` para detalhes.

source: A list of :ref:`type parameters <type-params>` may be given in square brackets between the function's name and the opening parenthesis for its parameter list. This indicates to static type checkers that the function is generic. At runtime, the type parameters can be retrieved from the function's :attr:`~function.__type_params__` attribute. See :ref:`generic-functions` for more.
pt_br: Uma lista de :ref:`parâmetros de tipo <type-params>` pode ser dada entre colchetes entre o nome da função e o parêntese de abertura para sua lista de parâmetros. Isso indica aos verificadores de tipo estático que a função é genérica. Em tempo de execução, os parâmetros de tipo podem ser recuperados do atributo :attr:`~function.__type_params__` da função. Veja :ref:`generic-functions` para mais.

source: Type parameter lists are new in Python 3.12.
pt_br: Listas de parâmetros de tipo são novas no Python 3.12.

source: When one or more :term:`parameters <parameter>` have the form *parameter* ``=`` *expression*, the function is said to have "default parameter values." For a parameter with a default value, the corresponding :term:`argument` may be omitted from a call, in which case the parameter's default value is substituted. If a parameter has a default value, all following parameters up until the "``*``" must also have a default value --- this is a syntactic restriction that is not expressed by the grammar.
pt_br: Quando um ou mais :term:`parâmetros <parameter>` têm a forma *parameter* ``=`` *expression*, diz-se que a função tem "valores de parâmetro padrão". Para um parâmetro com um valor padrão, o :term:`argumento` correspondente pode ser omitido de uma chamada, em cujo caso o valor padrão do parâmetro é substituído. Se um parâmetro tiver um valor padrão, todos os parâmetros seguintes até "``*``" também devem ter um valor padrão --- esta é uma restrição sintática que não é expressa pela gramática.

source: **Default parameter values are evaluated from left to right when the function definition is executed.** This means that the expression is evaluated once, when the function is defined, and that the same "pre-computed" value is used for each call. This is especially important to understand when a default parameter value is a mutable object, such as a list or a dictionary: if the function modifies the object (e.g. by appending an item to a list), the default parameter value is in effect modified. This is generally not what was intended. A way around this is to use ``None`` as the default, and explicitly test for it in the body of the function, e.g.::
pt_br: **Os valores de parâmetro padrão são avaliados da esquerda para a direita quando a definição da função é executada.** Isso significa que a expressão é avaliada uma vez, quando a função é definida, e que o mesmo valor "pré-calculado" é usado para cada chamada. Isso é especialmente importante para entender quando um valor de parâmetro padrão é um objeto mutável, como uma lista ou um dicionário: se a função modifica o objeto (por exemplo, anexando um item a uma lista), o valor de parâmetro padrão é efetivamente modificado. Isso geralmente não é o que se pretendia. Uma maneira de contornar isso é usar ``None`` como o padrão e testá-lo explicitamente no corpo da função, por exemplo::
