Repository: python/python-docs-pt-br
Catalog: reference/compound_stmts.po
Languages: pt_br

source: Compound statements
pt_br: Instruções compostas

source: Compound statements contain (groups of) other statements; they affect or control the execution of those other statements in some way. In general, compound statements span multiple lines, although in simple incarnations a whole compound statement may be contained in one line.
pt_br: Instruções compostas contém (grupos de) outras instruções; Elas afetam ou controlam a execução dessas outras instruções de alguma maneira. Em geral, instruções compostas abrangem múltiplas linhas, no entanto em algumas manifestações simples uma instrução composta inteira pode estar contida em uma linha.

source: The :keyword:`if`, :keyword:`while` and :keyword:`for` statements implement traditional control flow constructs. :keyword:`try` specifies exception handlers and/or cleanup code for a group of statements, while the :keyword:`with` statement allows the execution of initialization and finalization code around a block of code. Function and class definitions are also syntactically compound statements.
pt_br: As instruções :keyword:`if`, :keyword:`while` e :keyword:`for` implementam construções tradicionais de controle do fluxo de execução. :keyword:`try` especifica tratadores de exceção e/ou código de limpeza para uma instrução ou grupo de instruções, enquanto a palavra reservada :keyword:`with` permite a execução de código de inicialização e finalização em volta de um bloco de código. Definições de função e classe também são sintaticamente instruções compostas.

source: A compound statement consists of one or more 'clauses.' A clause consists of a header and a 'suite.' The clause headers of a particular compound statement are all at the same indentation level. Each clause header begins with a uniquely identifying keyword and ends with a colon. A suite is a group of statements controlled by a clause. A suite can be one or more semicolon-separated simple statements on the same line as the header, following the header's colon, or it can be one or more indented statements on subsequent lines. Only the latter form of a suite can contain nested compound statements; the following is illegal, mostly because it wouldn't be clear to which :keyword:`if` clause a following :keyword:`else` clause would belong::
pt_br: Uma instrução composta consiste em uma ou mais "cláusulas". Uma cláusula consiste em um cabeçalho e um "conjunto". Os cabeçalhos das cláusulas de uma instrução composta específica estão todos no mesmo nível de indentação. Cada cabeçalho de cláusula começa com uma palavra reservada de identificação exclusiva e termina com dois pontos. Um conjunto é um grupo de instruções controladas por uma cláusula. Um conjunto pode ser uma ou mais instruções simples separadas por ponto e vírgula na mesma linha do cabeçalho, após os dois pontos do cabeçalho, ou pode ser uma ou mais instruções indentadas nas linhas subsequentes. Somente a última forma de conjunto pode conter instruções compostas aninhadas; o seguinte é ilegal, principalmente porque não ficaria claro a qual cláusula :keyword:`if` a seguinte cláusula :keyword:`else` pertenceria::

source: Also note that the semicolon binds tighter than the colon in this context, so that in the following example, either all or none of the :func:`print` calls are executed::
pt_br: Observe também que o ponto e vírgula é mais vinculado que os dois pontos neste contexto, de modo que no exemplo a seguir, todas ou nenhuma das chamadas :func:`print` são executadas::

source: Summarizing:
pt_br: Resumindo:

source: Note that statements always end in a ``NEWLINE`` possibly followed by a ``DEDENT``. Also note that optional continuation clauses always begin with a keyword that cannot start a statement, thus there are no ambiguities (the 'dangling :keyword:`else`' problem is solved in Python by requiring nested :keyword:`if` statements to be indented).
pt_br: Note que instruções sempre terminam em uma ``NEWLINE`` possivelmente seguida por uma ``DEDENT``. Note também que cláusulas opcionais de continuação sempre começam com uma palavra reservada que não pode iniciar uma instrução, desta forma não há ambiguidades (o problema do ":keyword:`else` pendurado" é resolvido em Python obrigando que instruções :keyword:`if` aninhadas tenham indentação)

source: The formatting of the grammar rules in the following sections places each clause on a separate line for clarity.
pt_br: A formatação das regras de gramática nas próximas seções põe cada cláusula em uma linha separada para as tornar mais claras.

source: The :keyword:`!if` statement
pt_br: A instrução :keyword:`!if`

source: The :keyword:`if` statement is used for conditional execution:
pt_br: A instrução :keyword:`if` é usada para execução condicional:

source: It selects exactly one of the suites by evaluating the expressions one by one until one is found to be true (see section :ref:`booleans` for the definition of true and false); then that suite is executed (and no other part of the :keyword:`if` statement is executed or evaluated). If all expressions are false, the suite of the :keyword:`else` clause, if present, is executed.
pt_br: Ele seleciona exatamente um dos conjuntos avaliando as expressões uma por uma até que uma seja considerada verdadeira (veja a seção :ref:`booleans` para a definição de verdadeiro e falso); então esse conjunto é executado (e nenhuma outra parte da instrução :keyword:`if` é executada ou avaliada). Se todas as expressões forem falsas, o conjunto da cláusula :keyword:`else`, se presente, é executado.

source: The :keyword:`!while` statement
pt_br: A instrução :keyword:`!while`

source: The :keyword:`while` statement is used for repeated execution as long as an expression is true:
pt_br: A instrução :keyword:`while` é usada para execução repetida desde que uma expressão seja verdadeira:

source: This repeatedly tests the expression and, if it is true, executes the first suite; if the expression is false (which may be the first time it is tested) the suite of the :keyword:`!else` clause, if present, is executed and the loop terminates.
pt_br: Isto testa repetidamente a expressão e, se for verdadeira, executa o primeiro conjunto; se a expressão for falsa (o que pode ser a primeira vez que ela é testada) o conjunto da cláusula :keyword:`!else`, se presente, é executado e o laço termina.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`!else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and goes back to testing the expression.
pt_br: Uma instrução :keyword:`break` executada no primeiro conjunto termina o laço sem executar o conjunto da cláusula :keyword:`!else`. Uma instrução :keyword:`continue` executada no primeiro conjunto ignora o resto do conjunto e volta a testar a expressão.

source: The :keyword:`!for` statement
pt_br: A instrução :keyword:`!for`

source: The :keyword:`for` statement is used to iterate over the elements of a sequence (such as a string, tuple or list) or other iterable object:
pt_br: A instrução :keyword:`for` é usada para iterar sobre os elementos de uma sequência (como uma string, tupla ou lista) ou outro objeto iterável:

source: The :token:`~python-grammar:starred_expression_list` expression is evaluated once; it should yield an :term:`iterable` object. An :term:`iterator` is created for that iterable. The first item provided by the iterator is then assigned to the target list using the standard rules for assignments (see :ref:`assignment`), and the suite is executed. This repeats for each item provided by the iterator. When the iterator is exhausted, the suite in the :keyword:`!else` clause, if present, is executed, and the loop terminates.
pt_br: A expressão :token:`~python-grammar:starred_expression_list` é avaliada uma vez; deve produzir um objeto :term:`iterável`. Um :term:`iterador` é criado para esse iterável. O primeiro item fornecido pelo iterador é então atribuído à lista de alvos usando as regras padrão para atribuições (veja :ref:`assignment`), e o conjunto é executado. Isso se repete para cada item fornecido pelo iterador. Quando o iterador se esgota, o conjunto na cláusula :keyword:`!else`, se presente, é executado e laço termina.

source: A :keyword:`break` statement executed in the first suite terminates the loop without executing the :keyword:`!else` clause's suite. A :keyword:`continue` statement executed in the first suite skips the rest of the suite and continues with the next item, or with the :keyword:`!else` clause if there is no next item.
pt_br: Uma instrução :keyword:`break` executada no primeiro conjunto termina o loop sem executar o conjunto da cláusula :keyword:`!else`. Uma instrução :keyword:`continue` executada no primeiro conjunto pula o resto do conjunto e continua com o próximo item, ou com a cláusula :keyword:`!else` se não houver próximo item.

source: The for-loop makes assignments to the variables in the target list. This overwrites all previous assignments to those variables including those made in the suite of the for-loop::
pt_br: O laço for faz atribuições às variáveis na lista de destino. Isso substitui todas as atribuições anteriores a essas variáveis, incluindo aquelas feitas no conjunto do laço for::

source: for i in range(10): print(i) i = 5 # this will not affect the for-loop # because i will be overwritten with the next # index in the range
pt_br: for i in range(10): print(i) i = 5 # não afeta o laço for, porque i será # substituída pelo índice seguinte no range

source: Names in the target list are not deleted when the loop is finished, but if the sequence is empty, they will not have been assigned to at all by the loop. Hint: the built-in type :func:`range` represents immutable arithmetic sequences of integers. For instance, iterating ``range(3)`` successively yields 0, 1, and then 2.
pt_br: Os nomes na lista de destinos não são excluídos quando o laço termina, mas se a sequência estiver vazia, eles não serão atribuídos pelo laço. Dica: o tipo embutido :func:`range` representa sequências aritméticas imutáveis de inteiros. Por exemplo, iterar ``range(3)`` sucessivamente produz 0, 1 e depois 2.

source: Starred elements are now allowed in the expression list.
pt_br: Elementos marcados com estrela agora são permitidos na lista de expressões.

source: The :keyword:`!try` statement
pt_br: A instrução :keyword:`!try`

source: The :keyword:`!try` statement specifies exception handlers and/or cleanup code for a group of statements:
pt_br: A instrução :keyword:`!try` especifica manipuladores de exceção e/ou código de limpeza para um grupo de instruções:

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information on using the :keyword:`raise` statement to generate exceptions may be found in section :ref:`raise`.
pt_br: Informações adicionais sobre exceções podem ser encontradas na seção :ref:`exceptions`, e informações sobre como usar a instrução :keyword:`raise` para gerar exceções podem ser encontradas na seção :ref:`raise`.

source: Support for optionally dropping grouping parentheses when using multiple exception types. See :pep:`758`.
pt_br: Suporte para a remoção opcional de parênteses de agrupamento ao usar vários tipos de exceção. Veja :pep:`758`.

source: :keyword:`!except` clause
pt_br: Cláusula :keyword:`!except`

source: The :keyword:`!except` clause(s) specify one or more exception handlers. When no exception occurs in the :keyword:`try` clause, no exception handler is executed. When an exception occurs in the :keyword:`!try` suite, a search for an exception handler is started. This search inspects the :keyword:`!except` clauses in turn until one is found that matches the exception. An expression-less :keyword:`!except` clause, if present, must be last; it matches any exception.
pt_br: As cláusulas :keyword:`!except` especificam um ou mais manipuladores de exceção. Quando nenhuma exceção ocorre na cláusula :keyword:`try`, nenhum manipulador de exceção é executado. Quando uma exceção ocorre no conjunto :keyword:`!try`, uma busca por um manipulador de exceção é iniciada. Essa busca inspeciona as cláusulas :keyword:`!except` por vez até que uma seja encontrada que corresponda à exceção. Uma cláusula :keyword:`!except` sem expressão, se presente, deve ser a última; ela corresponde a qualquer exceção.

source: For an :keyword:`!except` clause with an expression, the expression must evaluate to an exception type or a tuple of exception types. Parentheses can be dropped if multiple exception types are provided and the ``as`` clause is not used. The raised exception matches an :keyword:`!except` clause whose expression evaluates to the class or a :term:`non-virtual base class <abstract base class>` of the exception object, or to a tuple that contains such a class.
pt_br: Para uma cláusula :keyword:`!except` com uma expressão, a expressão deve ser avaliada como um tipo de exceção ou uma tupla de tipos de exceção. Parênteses podem ser descartados se vários tipos de exceção forem fornecidos e a cláusula ``as`` não for usada. A exceção levantada corresponde a uma cláusula :keyword:`!except` cuja expressão é avaliada como a classe ou uma :term:`classe base não virtual <abstract base class>` do objeto exceção, ou como uma tupla que contém tal classe.

source: If no :keyword:`!except` clause matches the exception, the search for an exception handler continues in the surrounding code and on the invocation stack. [#]_
pt_br: Se nenhuma cláusula :keyword:`!except` corresponder à exceção, a busca por um manipulador de exceção continua no código circundante e na pilha de invocação. [#]_

source: If the evaluation of an expression in the header of an :keyword:`!except` clause raises an exception, the original search for a handler is canceled and a search starts for the new exception in the surrounding code and on the call stack (it is treated as if the entire :keyword:`try` statement raised the exception).
pt_br: Se a avaliação de uma expressão no cabeçalho de uma cláusula :keyword:`!except` levantar uma exceção, a busca original por um manipulador será cancelada e uma busca pela nova exceção será iniciada no código circundante e na pilha de chamadas (ela é tratado como se toda a instrução :keyword:`try` levantasse a exceção).

source: When a matching :keyword:`!except` clause is found, the exception is assigned to the target specified after the :keyword:`!as` keyword in that :keyword:`!except` clause, if present, and the :keyword:`!except` clause's suite is executed. All :keyword:`!except` clauses must have an executable block. When the end of this block is reached, execution continues normally after the entire :keyword:`try` statement. (This means that if two nested handlers exist for the same exception, and the exception occurs in the :keyword:`!try` clause of the inner handler, the outer handler will not handle the exception.)
pt_br: Quando uma cláusula :keyword:`!except` correspondente é encontrada, a exceção é atribuída ao destino especificado após a palavra reservada :keyword:`!as` nessa cláusula :keyword:`!except`, se presente, e o conjunto da cláusula :keyword:`!except` é executado. Todas as cláusulas :keyword:`!except` devem ter um bloco executável. Quando o final deste bloco é atingido, a execução continua normalmente após toda a instrução :keyword:`try`. (Isso significa que se existirem dois manipuladores aninhados para a mesma exceção, e a exceção ocorrer na cláusula :keyword:`!try` do manipulador interno, o manipulador externo não tratará a exceção.)

source: When an exception has been assigned using ``as target``, it is cleared at the end of the :keyword:`!except` clause. This is as if ::
pt_br: Quando uma exceção foi atribuída usando ``as target``, ela é limpa no final da cláusula :keyword:`!except`. É como se ::

source: was translated to ::
pt_br: fosse traduzido para ::

source: This means the exception must be assigned to a different name to be able to refer to it after the :keyword:`!except` clause. Exceptions are cleared because with the traceback attached to them, they form a reference cycle with the stack frame, keeping all locals in that frame alive until the next garbage collection occurs.
pt_br: Isso significa que a exceção deve ser atribuída a um nome diferente para poder referenciá-la após a cláusula :keyword:`!except`. As exceções são limpas porque, com o traceback (situação da pilha de execução) anexado a elas, elas formam um ciclo de referência com o quadro de pilha, mantendo todos os locais nesse quadro vivos até que ocorra a próxima coleta de lixo.

source: Before an :keyword:`!except` clause's suite is executed, the exception is stored in the :mod:`sys` module, where it can be accessed from within the body of the :keyword:`!except` clause by calling :func:`sys.exception`. When leaving an exception handler, the exception stored in the :mod:`sys` module is reset to its previous value::
pt_br: Antes de um conjunto de cláusulas :keyword:`!except` ser executado, a exceção é armazenada no módulo :mod:`sys`, onde pode ser acessada de dentro do corpo da cláusula :keyword:`!except` chamando :func:`sys.exception`. Ao sair de um manipulador de exceções, a exceção armazenada no módulo :mod:`sys` é redefinida para seu valor anterior::

source: :keyword:`!except*` clause
pt_br: Cláusula :keyword:`!except*`

source: The :keyword:`!except*` clause(s) are used for handling :exc:`ExceptionGroup`\s. The exception type for matching is interpreted as in the case of :keyword:`except`, but in the case of exception groups we can have partial matches when the type matches some of the exceptions in the group. This means that multiple :keyword:`!except*` clauses can execute, each handling part of the exception group. Each clause executes at most once and handles an exception group of all matching exceptions. Each exception in the group is handled by at most one :keyword:`!except*` clause, the first that matches it. ::
pt_br: As cláusulas :keyword:`!except*` são usadas para manipular :exc:`ExceptionGroup`\s. O tipo de exceção para correspondência é interpretado como no caso de :keyword:`except`, mas no caso de grupos de exceção, podemos ter correspondências parciais quando o tipo corresponde a algumas das exceções no grupo. Isso significa que várias cláusulas :keyword:`!except*` podem ser executadas, cada uma manipulando parte do grupo de exceções. Cada cláusula é executada no máximo uma vez e manipula um grupo de exceções de todas as exceções correspondentes. Cada exceção no grupo é manipulada por no máximo uma cláusula :keyword:`!except*`, a primeira que corresponde a ela. ::

source: Any remaining exceptions that were not handled by any :keyword:`!except*` clause are re-raised at the end, along with all exceptions that were raised from within the :keyword:`!except*` clauses. If this list contains more than one exception to reraise, they are combined into an exception group.
pt_br: Quaisquer exceções restantes que não foram manipuladas por nenhuma cláusula :keyword:`!except*` são levantadas novamente no final, junto com todas as exceções que foram levantadas de dentro das cláusulas :keyword:`!except*`. Se esta lista contiver mais de uma exceção para levantar novamente, elas serão combinadas em um grupo de exceções.

source: If the raised exception is not an exception group and its type matches one of the :keyword:`!except*` clauses, it is caught and wrapped by an exception group with an empty message string. ::
pt_br: Se a exceção levantada não for um grupo de exceções e seu tipo corresponder a uma das cláusulas :keyword:`!except*`, ela será capturada e encapsulada por um grupo de exceções com uma string de mensagem vazia. ::

source: An :keyword:`!except*` clause must have a matching expression; it cannot be ``except*:``. Furthermore, this expression cannot contain exception group types, because that would have ambiguous semantics.
pt_br: Uma cláusula :keyword:`!except*` deve ter uma expressão correspondente; não pode ser ``except*:``. Além disso, essa expressão não pode conter tipos de grupo de exceção, porque isso teria semântica ambígua.

source: :keyword:`!else` clause
pt_br: Cláusula :keyword:`!else`

source: The optional :keyword:`!else` clause is executed if the control flow leaves the :keyword:`try` suite, no exception was raised, and no :keyword:`return`, :keyword:`continue`, or :keyword:`break` statement was executed. Exceptions in the :keyword:`!else` clause are not handled by the preceding :keyword:`except` clauses.
pt_br: A cláusula opcional :keyword:`!else` é executada se o fluxo de controle deixar o conjunto :keyword:`try`, nenhuma exceção foi levantada e nenhuma instrução :keyword:`return`, :keyword:`continue` ou :keyword:`break` foi executada. Exceções na cláusula :keyword:`!else` não são manipuladas pelas cláusulas :keyword:`except` precedentes.

source: :keyword:`!finally` clause
pt_br: Cláusula :keyword:`!finally`

source: If :keyword:`!finally` is present, it specifies a 'cleanup' handler. The :keyword:`try` clause is executed, including any :keyword:`except` and :keyword:`else <except_else>` clauses. If an exception occurs in any of the clauses and is not handled, the exception is temporarily saved. The :keyword:`!finally` clause is executed. If there is a saved exception it is re-raised at the end of the :keyword:`!finally` clause. If the :keyword:`!finally` clause raises another exception, the saved exception is set as the context of the new exception. If the :keyword:`!finally` clause executes a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement, the saved exception is discarded. For example, this function returns 42.
pt_br: Se :keyword:`!finally` estiver presente, especifica um manipulador de "limpeza". A cláusula :keyword:`try` é executada, incluindo quaisquer cláusulas :keyword:`except` e :keyword:`else <except_else>`. Se uma exceção ocorrer em qualquer uma das cláusulas e não for tratada, a exceção será salva temporariamente. A cláusula :keyword:`!finally` é executada. Se houver uma exceção salva, ela será levantada novamente no final da cláusula :keyword:`!finally`. Se a cláusula :keyword:`!finally` levantar outra exceção, a exceção salva será definida como o contexto da nova exceção. Se a cláusula :keyword:`!finally` executar uma instrução :keyword:`return`, :keyword:`break` ou :keyword:`continue`, a exceção salva será descartada. Por exemplo, esta função retorna 42.

source: The exception information is not available to the program during execution of the :keyword:`!finally` clause.
pt_br: As informações de exceção não estão disponíveis para o programa durante a execução da cláusula :keyword:`!finally`.

source: When a :keyword:`return`, :keyword:`break` or :keyword:`continue` statement is executed in the :keyword:`try` suite of a :keyword:`!try`...\ :keyword:`!finally` statement, the :keyword:`!finally` clause is also executed 'on the way out.'
pt_br: Quando uma instrução :keyword:`return`, :keyword:`break` ou :keyword:`continue` é executada no conjunto :keyword:`try` de uma instrução :keyword:`!try`...\ :keyword:`!finally`, a cláusula :keyword:`!finally` também é executada "na saída".

source: The return value of a function is determined by the last :keyword:`return` statement executed. Since the :keyword:`!finally` clause always executes, a :keyword:`!return` statement executed in the :keyword:`!finally` clause will always be the last one executed. The following function returns 'finally'.
pt_br: O valor de retorno de uma função é determinado pela última instrução :keyword:`return` executada. Como a cláusula :keyword:`!finally` sempre é executada, uma instrução :keyword:`!return` executada na cláusula :keyword:`!finally` sempre será a última executada. A função a seguir retorna "finally".
