Repository: python/python-docs-pt-br
Catalog: reference/compound_stmts.po
Languages: pt_br

source: Function call semantics are described in more detail in section :ref:`calls`. A function call always assigns values to all parameters mentioned in the parameter list, either from positional arguments, from keyword arguments, or from default values. If the form "``*identifier``" is present, it is initialized to a tuple receiving any excess positional parameters, defaulting to the empty tuple. If the form "``**identifier``" is present, it is initialized to a new ordered mapping receiving any excess keyword arguments, defaulting to a new empty mapping of the same type. Parameters after "``*``" or "``*identifier``" are keyword-only parameters and may only be passed by keyword arguments. Parameters before "``/``" are positional-only parameters and may only be passed by positional arguments.
pt_br: A semântica de chamada de função é descrita em mais detalhes na seção :ref:`calls`. Uma chamada de função sempre atribui valores a todos os parâmetros mencionados na lista de parâmetros, seja de argumentos posicionais, de argumentos nomeados ou de valores padrão. Se o formato "``*identifier``" estiver presente, ele será inicializado para uma tupla que recebe quaisquer parâmetros posicionais excedentes, padronizando para a tupla vazia. Se o formato "``**identifier``" estiver presente, ele será inicializado para um novo mapeamento ordenado que recebe quaisquer argumentos nomeados excedentes, padronizando para um novo mapeamento vazio do mesmo tipo. Parâmetros após "``*``" ou "``*identifier``" são parâmetros somente-nomeados e podem ser passados somente por argumentos nomeados. Parâmetros antes de "``/``" são parâmetros somente-posicionais e podem ser passados somente por argumentos posicionais.

source: The ``/`` function parameter syntax may be used to indicate positional-only parameters. See :pep:`570` for details.
pt_br: A sintaxe do parâmetro de função ``/`` pode ser usada para indicar parâmetros somente-posicionais. Veja a :pep:`570` para detalhes.

source: Parameters may have an :term:`annotation <function annotation>` of the form "``: expression``" following the parameter name. Any parameter may have an annotation, even those of the form ``*identifier`` or ``**identifier``. (As a special case, parameters of the form ``*identifier`` may have an annotation "``: *expression``".) Functions may have "return" annotation of the form "``-> expression``" after the parameter list. These annotations can be any valid Python expression. The presence of annotations does not change the semantics of a function. See :ref:`annotations` for more information on annotations.
pt_br: Os parâmetros podem ter uma :term:`anotação <function annotation>` do formato "``: expressão``" após o nome do parâmetro. Qualquer parâmetro pode ter uma anotação, mesmo aqueles do formato ``*identificador`` ou ``**identificador``. (Como um caso especial, parâmetros do formato ``*identificador`` podem ter uma anotação "``: *expressão``".) As funções podem ter uma anotação "return" do formato "``-> expressão``" após a lista de parâmetros. Essas anotações podem ser qualquer expressão Python válida. A presença de anotações não altera a semântica de uma função. Veja :ref:`annotations` para mais informações sobre anotações.

source: Parameters of the form "``*identifier``" may have an annotation "``: *expression``". See :pep:`646`.
pt_br: Parâmetros do formato "``*identificador``" podem ter uma anotação "``: *expressão``". Veja :pep:`646`.

source: It is also possible to create anonymous functions (functions not bound to a name), for immediate use in expressions. This uses lambda expressions, described in section :ref:`lambda`. Note that the lambda expression is merely a shorthand for a simplified function definition; a function defined in a ":keyword:`def`" statement can be passed around or assigned to another name just like a function defined by a lambda expression. The ":keyword:`!def`" form is actually more powerful since it allows the execution of multiple statements and annotations.
pt_br: Também é possível criar funções anônimas (funções não vinculadas a um nome), para uso imediato em expressões. Isso usa expressões lambda, descritas na seção :ref:`lambda`. Observe que a expressão lambda é meramente uma abreviação para uma definição de função simplificada; uma função definida em uma instrução ":keyword:`def`" pode ser passada adiante ou atribuída a outro nome, assim como uma função definida por uma expressão lambda. O formato ":keyword:`!def`" é, na verdade, mais poderoso, pois permite a execução de várias instruções e anotações.

source: **Programmer's note:** Functions are first-class objects. A "``def``" statement executed inside a function definition defines a local function that can be returned or passed around. Free variables used in the nested function can access the local variables of the function containing the def. See section :ref:`naming` for details.
pt_br: **Nota do programador:** Funções são objetos de primeira classe. Uma instrução "``def``" executada dentro de uma definição de função define uma função local que pode ser retornada ou passada adiante. Variáveis livres usadas na função aninhada podem acessar as variáveis locais da função que contém o "def". Veja a seção :ref:`naming` para detalhes.

source: :pep:`3107` - Function Annotations
pt_br: :pep:`3107` - Anotações de função

source: The original specification for function annotations.
pt_br: A especificação original para anotações de funções.

source: :pep:`484` - Type Hints
pt_br: :pep:`484` - Dicas de tipo

source: Definition of a standard meaning for annotations: type hints.
pt_br: Definição de um significado padrão para anotações: dicas de tipo.

source: :pep:`526` - Syntax for Variable Annotations
pt_br: :pep:`526` - Sintaxe para anotações de variáveis

source: Ability to type hint variable declarations, including class variables and instance variables.
pt_br: Capacidade de fornecer dica de tipo para declarações de variáveis, incluindo variáveis de classe e variáveis de instância.

source: :pep:`563` - Postponed Evaluation of Annotations
pt_br: :pep:`563` - Avaliação postergada de anotações

source: Support for forward references within annotations by preserving annotations in a string form at runtime instead of eager evaluation.
pt_br: Suporte para referências futuras dentro de anotações, preservando anotações em um formato de string em tempo de execução em vez de avaliação antecipada.

source: :pep:`318` - Decorators for Functions and Methods
pt_br: :pep:`318` - Decoradores para funções e métodos

source: Function and method decorators were introduced. Class decorators were introduced in :pep:`3129`.
pt_br: Decoradores de função e método foram introduzidos. Decoradores de classe foram introduzidos na :pep:`3129`.

source: Class definitions
pt_br: Definições de classe

source: A class definition defines a class object (see section :ref:`types`):
pt_br: Uma definição de classe define um objeto classe (veja a seção :ref:`types`):

source: A class definition is an executable statement. The inheritance list usually gives a list of base classes (see :ref:`metaclasses` for more advanced uses), so each item in the list should evaluate to a class object which allows subclassing. Classes without an inheritance list inherit, by default, from the base class :class:`object`; hence, ::
pt_br: Uma definição de classe é uma instrução executável. A lista de herança geralmente fornece uma lista de classes base (veja :ref:`metaclasses` para usos mais avançados), então cada item na lista deve ser executada como um objeto classe que permite extensão via subclasse. Classes sem uma lista de herança herdam, por padrão, da classe base :class:`object`; portanto, ::

source: is equivalent to ::
pt_br: equivale a ::

source: The class's suite is then executed in a new execution frame (see :ref:`naming`), using a newly created local namespace and the original global namespace. (Usually, the suite contains mostly function definitions.) When the class's suite finishes execution, its execution frame is discarded but its local namespace is saved. [#]_ A class object is then created using the inheritance list for the base classes and the saved local namespace for the attribute dictionary. The class name is bound to this class object in the original local namespace.
pt_br: O conjunto da classe é então executado em um novo quadro de execução (veja :ref:`naming`), usando um espaço de nomes local recém-criado e o espaço de nomes global original. (Normalmente, o conjunto contém principalmente definições de função.) Quando o conjunto da classe termina a execução, seu quadro de execução é descartado, mas seu espaço de nomes local é salvo. [#]_ Um objeto classe é então criado usando a lista de herança para as classes base e o espaço de nomes local salvo para o dicionário de atributos. O nome da classe é vinculado a este objeto classe no espaço de nomes local original.

source: The order in which attributes are defined in the class body is preserved in the new class's :attr:`~type.__dict__`. Note that this is reliable only right after the class is created and only for classes that were defined using the definition syntax.
pt_br: A ordem em que os atributos são definidos no corpo da classe é preservada no :attr:`~type.__dict__` da nova classe. Observe que isso é confiável somente logo após a classe ser criada e somente para classes que foram definidas usando a sintaxe de definição.

source: Class creation can be customized heavily using :ref:`metaclasses <metaclasses>`.
pt_br: A criação de classes pode ser bastante personalizada usando :ref:`metaclasses <metaclasses>`.

source: Classes can also be decorated: just like when decorating functions, ::
pt_br: As classes também podem ser decoradas: assim como na decoração de funções, ::

source: The evaluation rules for the decorator expressions are the same as for function decorators. The result is then bound to the class name.
pt_br: As regras de execução para as expressões de decorador são as mesmas que para decoradores de função. O resultado é então vinculado ao nome da classe.

source: Classes may be decorated with any valid :token:`~python-grammar:assignment_expression`. Previously, the grammar was much more restrictive; see :pep:`614` for details.
pt_br: Classes podem ser decoradas com qualquer :token:`~python-grammar:assignment_expression` válida. Anteriormente, a gramática era muito mais restritiva; veja :pep:`614` para detalhes.

source: A list of :ref:`type parameters <type-params>` may be given in square brackets immediately after the class's name. This indicates to static type checkers that the class is generic. At runtime, the type parameters can be retrieved from the class's :attr:`~type.__type_params__` attribute. See :ref:`generic-classes` for more.
pt_br: Uma lista de :ref:`parâmetros de tipo <type-params>` pode ser dada entre colchetes imediatamente após o nome da classe. Isso indica aos verificadores de tipo estático que a classe é genérica. Em tempo de execução, os parâmetros de tipo podem ser recuperados do atributo :attr:`~type.__type_params__` da classe. Veja :ref:`generic-classes` para mais.

source: **Programmer's note:** Variables defined in the class definition are class attributes; they are shared by instances. Instance attributes can be set in a method with ``self.name = value``. Both class and instance attributes are accessible through the notation "``self.name``", and an instance attribute hides a class attribute with the same name when accessed in this way. Class attributes can be used as defaults for instance attributes, but using mutable values there can lead to unexpected results. :ref:`Descriptors <descriptors>` can be used to create instance variables with different implementation details.
pt_br: **Nota do programador:** Variáveis definidas na definição de classe são atributos de classe; elas são compartilhadas por instâncias. Atributos de instância podem ser definidos em um método com ``self.nome = valor``. Atributos de classe e instância são acessíveis por meio da notação "``self.nome``", e um atributo de instância oculta um atributo de classe com o mesmo nome quando acessado dessa forma. Atributos de classe podem ser usados como padrões para atributos de instância, mas usar valores mutáveis pode levar a resultados inesperados. :ref:`Descritores <descriptors>` podem ser usados para criar variáveis de instância com diferentes detalhes de implementação.

source: :pep:`3115` - Metaclasses in Python 3000
pt_br: :pep:`3115` - Metaclasses no Python 3000

source: The proposal that changed the declaration of metaclasses to the current syntax, and the semantics for how classes with metaclasses are constructed.
pt_br: A proposta que alterou a declaração de metaclasses para a sintaxe atual e a semântica de como as classes com metaclasses são construídas.

source: :pep:`3129` - Class Decorators
pt_br: :pep:`3129` - Decoradores de classe

source: The proposal that added class decorators. Function and method decorators were introduced in :pep:`318`.
pt_br: A proposta que adicionou decoradores de classe. Decoradores de função e método foram introduzidos na :pep:`318`.

source: Coroutines
pt_br: Corrotinas

source: Coroutine function definition
pt_br: Definição de função de corrotina

source: Execution of Python coroutines can be suspended and resumed at many points (see :term:`coroutine`). :keyword:`await` expressions, :keyword:`async for` and :keyword:`async with` can only be used in the body of a coroutine function.
pt_br: A execução de corrotinas do Python pode ser suspensa e retomada em muitos pontos (consulte :term:`coroutine`). As expressões :keyword:`await`, :keyword:`async for` e :keyword:`async with` só podem ser usadas no corpo de uma função de corrotina.

source: Functions defined with ``async def`` syntax are always coroutine functions, even if they do not contain ``await`` or ``async`` keywords.
pt_br: Funções definidas com a sintaxe ``async def`` são sempre funções de corrotina, mesmo que não contenham palavras reservadas ``await`` ou ``async``.

source: It is a :exc:`SyntaxError` to use a ``yield from`` expression inside the body of a coroutine function.
pt_br: Ocorre uma :exc:`SyntaxError` se usada uma expressão ``yield from`` dentro do corpo de uma função de corrotina.

source: An example of a coroutine function::
pt_br: Um exemplo de uma função de corrotina::

source: async def func(param1, param2): do_stuff() await some_coroutine()
pt_br: async def func(param1, param2): faz_algo() await alguma_corrotina()

source: ``await`` and ``async`` are now keywords; previously they were only treated as such inside the body of a coroutine function.
pt_br: ``await`` e ``async`` agora são palavras reservadas; anteriormente, elas só eram tratadas como tal dentro do corpo de uma função de corrotina.

source: The :keyword:`!async for` statement
pt_br: A instrução :keyword:`!async for`

source: An :term:`asynchronous iterable` provides an ``__aiter__`` method that directly returns an :term:`asynchronous iterator`, which can call asynchronous code in its ``__anext__`` method.
pt_br: Um :term:`iterável assíncrono` fornece um método ``__aiter__`` que retorna diretamente um :term:`iterador assíncrono`, que pode chamar código assíncrono em seu método ``__anext__``.

source: The ``async for`` statement allows convenient iteration over asynchronous iterables.
pt_br: A instrução ``async for`` permite iteração conveniente sobre iteráveis assíncronos.

source: Is semantically equivalent to::
pt_br: É semanticamente equivalente a::

source: See also :meth:`~object.__aiter__` and :meth:`~object.__anext__` for details.
pt_br: Veja também :meth:`~object.__aiter__` e :meth:`~object.__anext__` para detalhes.

source: It is a :exc:`SyntaxError` to use an ``async for`` statement outside the body of a coroutine function.
pt_br: Ocorre uma :exc:`SyntaxError` se usada uma instrução ``async for`` fora do corpo de uma função de corrotina.

source: The :keyword:`!async with` statement
pt_br: A instrução :keyword:`!async with`

source: An :term:`asynchronous context manager` is a :term:`context manager` that is able to suspend execution in its *enter* and *exit* methods.
pt_br: Um :term:`gerenciador de contexto assíncrono` é um :term:`gerenciador de contexto` que é capaz de suspender a execução em seus métodos *enter* e *exit*.

source: async with EXPRESSION as TARGET: SUITE
pt_br: async with EXPRESSÃO as ALVO: COMANDOS

source: manager = (EXPRESSION) aenter = type(manager).__aenter__ aexit = type(manager).__aexit__ value = await aenter(manager) hit_except = False try: TARGET = value SUITE except: hit_except = True if not await aexit(manager, *sys.exc_info()): raise finally: if not hit_except: await aexit(manager, None, None, None)
pt_br: manager = (EXPRESSÃO) aenter = type(manager).__aenter__ aexit = type(manager).__aexit__ value = await aenter(manager) hit_except = False try: ALVO = value COMANDOS except: hit_except = True if not await aexit(manager, *sys.exc_info()): raise finally: if not hit_except: await aexit(manager, None, None, None)

source: See also :meth:`~object.__aenter__` and :meth:`~object.__aexit__` for details.
pt_br: Veja também :meth:`~object.__aenter__` e :meth:`~object.__aexit__` para detalhes.

source: It is a :exc:`SyntaxError` to use an ``async with`` statement outside the body of a coroutine function.
pt_br: Ocorre uma :exc:`SyntaxError` se usada uma instrução ``async with`` fora do corpo de uma função de corrotina.

source: :pep:`492` - Coroutines with async and await syntax
pt_br: :pep:`492` - Corrotina com sintaxe de async e wait

source: The proposal that made coroutines a proper standalone concept in Python, and added supporting syntax.
pt_br: A proposta que tornou as corrotinas um conceito autônomo em Python e adicionou sintaxe de suporte.

source: Type parameter lists
pt_br: Listas de parâmetros de tipo

source: Support for default values was added (see :pep:`696`).
pt_br: Foi adicionado suporte para valores padrão (veja :pep:`696`).

source: :ref:`Functions <def>` (including :ref:`coroutines <async def>`), :ref:`classes <class>` and :ref:`type aliases <type>` may contain a type parameter list::
pt_br: :ref:`Funções <def>` (incluindo :ref:`corrotinas <async def>`), :ref:`classes <class>` e :ref:`apelidos de tipo <type>` podem conter uma lista de parâmetros de tipo::

source: Semantically, this indicates that the function, class, or type alias is generic over a type variable. This information is primarily used by static type checkers, and at runtime, generic objects behave much like their non-generic counterparts.
pt_br: Semanticamente, isso indica que a função, classe ou apelido de tipo é genérico sobre uma variável de tipo. Essas informações são usadas principalmente por verificadores de tipo estático e, em tempo de execução, objetos genéricos se comportam muito como suas contrapartes não genéricas.

source: Type parameters are declared in square brackets (``[]``) immediately after the name of the function, class, or type alias. The type parameters are accessible within the scope of the generic object, but not elsewhere. Thus, after a declaration ``def func[T](): pass``, the name ``T`` is not available in the module scope. Below, the semantics of generic objects are described with more precision. The scope of type parameters is modeled with a special function (technically, an :ref:`annotation scope <annotation-scopes>`) that wraps the creation of the generic object.
pt_br: Parâmetros de tipo são declarados entre colchetes (``[]``) imediatamente após o nome da função, classe ou apelido de tipo. Os parâmetros de tipo são acessíveis dentro do escopo do objeto genérico, mas não em outro lugar. Assim, após uma declaração ``def func[T](): pass``, o nome ``T`` não está disponível no escopo do módulo. Abaixo, a semântica de objetos genéricos é descrita com mais precisão. O escopo de parâmetros de tipo é modelado com uma função especial (tecnicamente, um :ref:`escopo de anotação <annotation-scopes>`) que encapsula a criação do objeto genérico.

source: Generic functions, classes, and type aliases have a :attr:`~definition.__type_params__` attribute listing their type parameters.
pt_br: Funções genéricas, classes e apelidos de tipo têm um atributo :attr:`~definition.__type_params__` listando seus parâmetros de tipo.

source: Type parameters come in three kinds:
pt_br: Existem três espécies de parâmetros de tipo:

source: :data:`typing.TypeVar`, introduced by a plain name (e.g., ``T``). Semantically, this represents a single type to a type checker.
pt_br: :data:`typing.TypeVar`, introduzido por um nome simples (por exemplo, ``T``). Semanticamente, isso representa um único tipo para um verificador de tipos.

source: :data:`typing.TypeVarTuple`, introduced by a name prefixed with a single asterisk (e.g., ``*Ts``). Semantically, this stands for a tuple of any number of types.
pt_br: :data:`typing.TypeVarTuple`, introduzido por um nome prefixado com um único asterisco (por exemplo, ``*Ts``). Semanticamente, isso representa uma tupla de qualquer número de tipos.

source: :data:`typing.ParamSpec`, introduced by a name prefixed with two asterisks (e.g., ``**P``). Semantically, this stands for the parameters of a callable.
pt_br: :data:`typing.ParamSpec`, introduzido por um nome prefixado com dois asteriscos (por exemplo, ``**P``). Semanticamente, isso representa os parâmetros de um chamável.

source: :data:`typing.TypeVar` declarations can define *bounds* and *constraints* with a colon (``:``) followed by an expression. A single expression after the colon indicates a bound (e.g. ``T: int``). Semantically, this means that the :data:`!typing.TypeVar` can only represent types that are a subtype of this bound. A parenthesized tuple of expressions after the colon indicates a set of constraints (e.g. ``T: (str, bytes)``). Each member of the tuple should be a type (again, this is not enforced at runtime). Constrained type variables can only take on one of the types in the list of constraints.
pt_br: As declarações de :data:`typing.TypeVar` podem definir delimitações (*bounds*) e restrições (*constraints*) com dois pontos (``:``) seguidos por uma expressão. Uma única expressão após os dois pontos indica uma delimitação (por exemplo, ``T: int``). Semanticamente, isso significa que o :data:`!typing.TypeVar` pode representar apenas tipos que são um subtipo desse limite. Uma tupla de expressões entre parênteses após os dois pontos indica um conjunto de restrições (por exemplo, ``T: (str, bytes)``). Cada membro da tupla deve ser um tipo (novamente, isso não é imposto em tempo de execução). Variáveis de tipo restrito podem assumir apenas um dos tipos na lista de restrições.

source: For :data:`!typing.TypeVar`\ s declared using the type parameter list syntax, the bound and constraints are not evaluated when the generic object is created, but only when the value is explicitly accessed through the attributes ``__bound__`` and ``__constraints__``. To accomplish this, the bounds or constraints are evaluated in a separate :ref:`annotation scope <annotation-scopes>`.
pt_br: Para :data:`!typing.TypeVar`\ s declarados usando a sintaxe de lista de parâmetros de tipo, a delimitação e as restrições não são avaliados quando o objeto genérico é criado, mas somente quando o valor é acessado explicitamente por meio dos atributos ``__bound__`` e ``__constraints__``. Para fazer isso, as delimitações ou restrições são avaliados em um :ref:`escopo de anotação <annotation-scopes>` separado.

source: :data:`typing.TypeVarTuple`\ s and :data:`typing.ParamSpec`\ s cannot have bounds or constraints.
pt_br: :data:`typing.TypeVarTuple`\ s e :data:`typing.ParamSpec`\ s não pode ter delimitações e restrições.
