Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: __str__() (object method)
pt_br: __str__() (método de objeto)

source: format() (built-in function)
pt_br: format() (função embutida)

source: print() (built-in function)
pt_br: print() (função embutida)

source: __format__() (object method)
pt_br: __format__() (método de objeto)

source: conversion
pt_br: conversão

source: comparisons
pt_br: comparações

source: __len__() (mapping object method)
pt_br: __len__() (método de objeto mapeamento)

source: __getattr__ (module attribute)
pt_br: __getattr__ (atributo de módulo)

source: __dir__ (module attribute)
pt_br: __dir__ (atributo de módulo)

source: __class__ (module attribute)
pt_br: __class__ (atributo de módulo)

source: metaclass
pt_br: metaclasse

source: = (equals)
pt_br: = (igual)

source: class definition
pt_br: definição de classe

source: metaclass hint
pt_br: dica de metaclasse

source: __prepare__ (metaclass method)
pt_br: __prepare__ (método de metaclasse)

source: body
pt_br: corpo

source: __class__ (method cell)
pt_br: __class__ (célula de método)

source: __classcell__ (class namespace entry)
pt_br: __classcell__ (entrada de espaço de nomes de classe)

source: __bool__() (object method)
pt_br: __bool__() (método de objeto)

source: float
pt_br: ponto flutuante

source: context manager
pt_br: gerenciador de contexto
