Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: Without a :attr:`~object.__dict__` variable, instances cannot be assigned new variables not listed in the *__slots__* definition. Attempts to assign to an unlisted variable name raises :exc:`AttributeError`. If dynamic assignment of new variables is desired, then add ``'__dict__'`` to the sequence of strings in the *__slots__* declaration.
pt_br: Sem uma variável :attr:`~object.__dict__`, as instâncias não podem ser atribuídas a novas variáveis não listadas na definição *__slots__*. As tentativas de atribuir a um nome de variável não listado levantam :exc:`AttributeError`. Se a atribuição dinâmica de novas variáveis for desejada, então adicione ``'__dict__'`` à sequência de strings na declaração de *__slots__*.

source: Without a *__weakref__* variable for each instance, classes defining *__slots__* do not support :mod:`weak references <weakref>` to its instances. If weak reference support is needed, then add ``'__weakref__'`` to the sequence of strings in the *__slots__* declaration.
pt_br: Sem uma variável *__weakref__* para cada instância, as classes que definem *__slots__* não suportam :mod:`referências fracas<weakref>` para suas instâncias. Se for necessário um suporte de referência fraca, adicione ``'__weakref__'`` à sequência de strings na declaração *__slots__*.

source: *__slots__* are implemented at the class level by creating :ref:`descriptors <descriptors>` for each variable name. As a result, class attributes cannot be used to set default values for instance variables defined by *__slots__*; otherwise, the class attribute would overwrite the descriptor assignment.
pt_br: *__slots__* são implementados no nível de classe criando :ref:`descritores <descriptors>` para cada nome de variável. Como resultado, os atributos de classe não podem ser usados para definir valores padrão para variáveis de instância definidas por *__slots__*; caso contrário, o atributo de classe substituiria a atribuição do descritor.

source: The action of a *__slots__* declaration is not limited to the class where it is defined. *__slots__* declared in parents are available in child classes. However, instances of a child subclass will get a :attr:`~object.__dict__` and *__weakref__* unless the subclass also defines *__slots__* (which should only contain names of any *additional* slots).
pt_br: A ação de uma declaração *__slots__* se limita à classe em que é definida. *__slots__* declarados em uma classe base estão disponíveis nas subclasses. No entanto, instâncias de uma subclasse filha vai receber um :attr:`~object.__dict__` e *__weakref__* a menos que a subclasse também defina *__slots__* (que deve conter apenas nomes de quaisquer slots *adicionais*).

source: If a class defines a slot also defined in a base class, the instance variable defined by the base class slot is inaccessible (except by retrieving its descriptor directly from the base class). This renders the meaning of the program undefined. In the future, a check may be added to prevent this.
pt_br: Se uma classe define um slot também definido em uma classe base, a variável de instância definida pelo slot da classe base fica inacessível (exceto por recuperar seu descritor diretamente da classe base). Isso torna o significado do programa indefinido. No futuro, uma verificação pode ser adicionada para evitar isso.

source: :exc:`TypeError` will be raised if nonempty *__slots__* are defined for a class derived from a :c:member:`"variable-length" built-in type <PyTypeObject.tp_itemsize>` such as :class:`int`, :class:`bytes`, and :class:`tuple`.
pt_br: :exc:`TypeError` será levantada se *__slots__* não vazios forem definidos para uma classe derivada de um tipo embutido :c:member:`"variable-length" <PyTypeObject.tp_itemsize>` como :class:`int`, :class:`bytes` e :class:`tuple`.

source: Any non-string :term:`iterable` may be assigned to *__slots__*.
pt_br: Qualquer :term:`iterável` não string pode ser atribuído a *__slots__*.

source: If a :class:`dictionary <dict>` is used to assign *__slots__*, the dictionary keys will be used as the slot names. The values of the dictionary can be used to provide per-attribute docstrings that will be recognised by :func:`inspect.getdoc` and displayed in the output of :func:`help`.
pt_br: Se um :class:`dicionário <dict>` for usado para atribuir *__slots__*, as chaves do dicionário serão usadas como os nomes dos slots. Os valores do dicionário podem ser usados para fornecer strings de documentação (docstrings) por atributo que serão reconhecidos por :func:`inspect.getdoc` e exibidos na saída de :func:`help`.

source: :attr:`~object.__class__` assignment works only if both classes have the same *__slots__*.
pt_br: Atribuição de :attr:`~object.__class__` funciona apenas se ambas as classes têm o mesmo *__slots__*.

source: :ref:`Multiple inheritance <tut-multiple>` with multiple slotted parent classes can be used, but only one parent is allowed to have attributes created by slots (the other bases must have empty slot layouts) - violations raise :exc:`TypeError`.
pt_br: A :ref:`herança múltipla <tut-multiple>` com várias classes bases com slots pode ser usada, mas apenas uma classe base tem permissão para ter atributos criados por slots (as outras classes bases devem ter layouts de slots vazios) -- violações levantam :exc:`TypeError`.

source: If an :term:`iterator` is used for *__slots__* then a :term:`descriptor` is created for each of the iterator's values. However, the *__slots__* attribute will be an empty iterator.
pt_br: Se um :term:`iterador` for usado para *__slots__*, um :term:`descritor` é criado para cada um dos valores do iterador. No entanto, o atributo *__slots__* será um iterador vazio.

source: Customizing class creation
pt_br: Personalizando a criação de classe

source: Whenever a class inherits from another class, :meth:`~object.__init_subclass__` is called on the parent class. This way, it is possible to write classes which change the behavior of subclasses. This is closely related to class decorators, but where class decorators only affect the specific class they're applied to, ``__init_subclass__`` solely applies to future subclasses of the class defining the method.
pt_br: Sempre que uma classe herda de outra classe, :meth:`~object.__init_subclass__` é chamado na classe base. Dessa forma, é possível escrever classes que alteram o comportamento das subclasses. Isso está intimamente relacionado aos decoradores de classe, mas onde decoradores de classe afetam apenas a classe específica à qual são aplicados, ``__init_subclass__`` aplica-se apenas a futuras subclasses da classe que define o método.

source: This method is called whenever the containing class is subclassed. *cls* is then the new subclass. If defined as a normal instance method, this method is implicitly converted to a class method.
pt_br: Este método é chamado sempre que a classe que contém é uma subclasse. *cls* é então a nova subclasse. Se definido como um método de instância normal, esse método é convertido implicitamente em um método de classe.

source: Keyword arguments which are given to a new class are passed to the parent class's ``__init_subclass__``. For compatibility with other classes using ``__init_subclass__``, one should take out the needed keyword arguments and pass the others over to the base class, as in::
pt_br: Argumentos nomeados dados a uma nova classe são passados para ``__init_subclass__`` da classe base. Para compatibilidade com outras classes usando ``__init_subclass__``, deve-se retirar os argumentos nomeados necessários e passar os outros para a classe base, como em::

source: The default implementation ``object.__init_subclass__`` does nothing, but raises an error if it is called with any arguments.
pt_br: A implementação padrão de ``object.__init_subclass__`` não faz nada, mas levanta um erro se for chamada com quaisquer argumentos.

source: The metaclass hint ``metaclass`` is consumed by the rest of the type machinery, and is never passed to ``__init_subclass__`` implementations. The actual metaclass (rather than the explicit hint) can be accessed as ``type(cls)``.
pt_br: A dica da metaclasse ``metaclass`` é consumida pelo resto da maquinaria de tipo, e nunca é passada para implementações ``__init_subclass__``. A metaclasse real (em vez da dica explícita) pode ser acessada como ``type(cls)``.

source: When a class is created, :meth:`type.__new__` scans the class variables and makes callbacks to those with a :meth:`~object.__set_name__` hook.
pt_br: Quando uma classe é criada, :meth:`type.__new__` verifica as variáveis de classe e faz chamadas a funções de retorno (callback) para aqueles com um gancho :meth:`~object.__set_name__`.

source: Automatically called at the time the owning class *owner* is created. The object has been assigned to *name* in that class::
pt_br: Chamado automaticamente no momento em que a classe proprietária *owner* é criada. O objeto foi atribuído a *name* nessa classe::

source: class A: x = C() # Automatically calls: x.__set_name__(A, 'x')
pt_br: class A: x = C() # Automaticamente chama: x.__set_name__(A, 'x')

source: If the class variable is assigned after the class is created, :meth:`__set_name__` will not be called automatically. If needed, :meth:`__set_name__` can be called directly::
pt_br: Se a variável de classe for atribuída após a criação da classe, :meth:`__set_name__` não será chamado automaticamente. Se necessário, :meth:`__set_name__` pode ser chamado diretamente::

source: class A: pass c = C() A.x = c # The hook is not called c.__set_name__(A, 'x') # Manually invoke the hook
pt_br: class A: pass c = C() A.x = c # O gancho não é chamado c.__set_name__(A, 'x') # Invoca manualmente o gancho

source: See :ref:`class-object-creation` for more details.
pt_br: Consulte :ref:`class-object-creation` para mais detalhes.

source: By default, classes are constructed using :func:`type`. The class body is executed in a new namespace and the class name is bound locally to the result of ``type(name, bases, namespace)``.
pt_br: Por padrão, as classes são construídas usando :func:`type`. O corpo da classe é executado em um novo espaço de nomes e o nome da classe é vinculado localmente ao resultado de ``type(name, bases, namespace)``.

source: The class creation process can be customized by passing the ``metaclass`` keyword argument in the class definition line, or by inheriting from an existing class that included such an argument. In the following example, both ``MyClass`` and ``MySubclass`` are instances of ``Meta``::
pt_br: O processo de criação da classe pode ser personalizado passando o argumento nomeado ``metaclass`` na linha de definição da classe, ou herdando de uma classe existente que incluiu tal argumento. No exemplo a seguir, ``MyClass`` e ``MySubclass`` são instâncias de ``Meta``::

source: Any other keyword arguments that are specified in the class definition are passed through to all metaclass operations described below.
pt_br: Quaisquer outros argumentos nomeados especificados na definição de classe são transmitidos para todas as operações de metaclasse descritas abaixo.

source: When a class definition is executed, the following steps occur:
pt_br: Quando uma definição de classe é executada, as seguintes etapas ocorrem:

source: MRO entries are resolved;
pt_br: entradas de MRO são resolvidas;

source: the appropriate metaclass is determined;
pt_br: a metaclasse apropriada é determinada;

source: the class namespace is prepared;
pt_br: o espaço de nomes da classe é preparada;

source: the class body is executed;
pt_br: o corpo da classe é executado;

source: the class object is created.
pt_br: o objeto da classe é criado.

source: Resolving MRO entries
pt_br: Resolvendo entradas de MRO

source: If a base that appears in a class definition is not an instance of :class:`type`, then an :meth:`!__mro_entries__` method is searched on the base. If an :meth:`!__mro_entries__` method is found, the base is substituted with the result of a call to :meth:`!__mro_entries__` when creating the class. The method is called with the original bases tuple passed to the *bases* parameter, and must return a tuple of classes that will be used instead of the base. The returned tuple may be empty: in these cases, the original base is ignored.
pt_br: Se uma classe base que aparece em uma definição de classe não é uma instância de :class:`type`, então um método :meth:`!__mro_entries__` é procurado na base. Se um método :meth:`!__mro_entries__` é encontrado, a base é substituída pelo resultado de uma chamada para :meth:`!__mro_entries__` ao criar a classe. O método é chamado com a tupla de bases original passada como parâmetro *bases*, e deve retornar uma tupla de classes que serão usadas no lugar da base. A tupla retornada pode estar vazia: nesses casos, a base original é ignorada.

source: Dynamically resolve bases that are not instances of :class:`type`.
pt_br: Dinamicamente resolve bases que não são instâncias de :class:`type`.

source: Retrieve a class's "original bases" prior to modifications by :meth:`~object.__mro_entries__`.
pt_br: Recupera as "bases originais" de uma classe antes das modificações feitas por :meth:`~object.__mro_entries__`.

source: Core support for typing module and generic types.
pt_br: Suporte básico para módulo typing e tipos genéricos.

source: Determining the appropriate metaclass
pt_br: Determinando a metaclasse apropriada

source: The appropriate metaclass for a class definition is determined as follows:
pt_br: A metaclasse apropriada para uma definição de classe é determinada da seguinte forma:

source: if no bases and no explicit metaclass are given, then :func:`type` is used;
pt_br: se nenhuma classe base e nenhuma metaclasse explícita forem fornecidas, então :func:`type` é usada;

source: if an explicit metaclass is given and it is *not* an instance of :func:`type`, then it is used directly as the metaclass;
pt_br: se uma metaclasse explícita é fornecida e *não* é uma instância de :func:`type`, então ela é usada diretamente como a metaclasse;

source: if an instance of :func:`type` is given as the explicit metaclass, or bases are defined, then the most derived metaclass is used.
pt_br: se uma instância de :func:`type` é fornecida como a metaclasse explícita, ou classes bases são definidas, então a metaclasse mais derivada é usada.

source: The most derived metaclass is selected from the explicitly specified metaclass (if any) and the metaclasses (i.e. ``type(cls)``) of all specified base classes. The most derived metaclass is one which is a subtype of *all* of these candidate metaclasses. If none of the candidate metaclasses meets that criterion, then the class definition will fail with ``TypeError``.
pt_br: A metaclasse mais derivada é selecionada a partir da metaclasse explicitamente especificada (se houver) e das metaclasses (ou seja, ``type(cls)``) de todas as classes bases especificadas. A metaclasse mais derivada é aquela que é um subtipo de *todas* essas metaclasses candidatas. Se nenhuma das metaclasses candidatas atender a esse critério, a definição de classe falhará com ``TypeError``.

source: Preparing the class namespace
pt_br: Preparando o espaço de nomes da classe

source: Once the appropriate metaclass has been identified, then the class namespace is prepared. If the metaclass has a ``__prepare__`` attribute, it is called as ``namespace = metaclass.__prepare__(name, bases, **kwds)`` (where the additional keyword arguments, if any, come from the class definition). The ``__prepare__`` method should be implemented as a :func:`classmethod <classmethod>`. The namespace returned by ``__prepare__`` is passed in to ``__new__``, but when the final class object is created the namespace is copied into a new ``dict``.
pt_br: Uma vez identificada a metaclasse apropriada, o espaço de nomes da classe é preparado. Se a metaclasse tiver um atributo ``__prepare__``, ela será chamada como ``namespace = metaclass.__prepare__(name, bases, **kwds)`` (onde os argumentos nomeados adicionais, se houver, vêm da definição de classe). O método ``__prepare__`` deve ser implementado como um :func:`classmethod <classmethod>`. O espaço de nomes retornado por ``__prepare__`` é passado para ``__new__``, mas quando o objeto classe final é criado, o espaço de nomes é copiado para um novo ``dict``.

source: If the metaclass has no ``__prepare__`` attribute, then the class namespace is initialised as an empty ordered mapping.
pt_br: Se a metaclasse não tiver o atributo ``__prepare__``, então o espaço de nomes da classe é inicializado como um mapeamento ordenado vazio.

source: :pep:`3115` - Metaclasses in Python 3000
pt_br: :pep:`3115` - Metaclasses no Python 3000

source: Introduced the ``__prepare__`` namespace hook
pt_br: Introduzido o gancho de espaço de nomes ``__prepare__``

source: Executing the class body
pt_br: Executando o corpo da classe

source: The class body is executed (approximately) as ``exec(body, globals(), namespace)``. The key difference from a normal call to :func:`exec` is that lexical scoping allows the class body (including any methods) to reference names from the current and outer scopes when the class definition occurs inside a function.
pt_br: O corpo da classe é executado (aproximadamente) como ``exec(body, globals(), namespace)``. A principal diferença de uma chamada normal para :func:`exec` é que o escopo léxico permite que o corpo da classe (incluindo quaisquer métodos) faça referência a nomes dos escopos atual e externo quando a definição de classe ocorre dentro de uma função.

source: However, even when the class definition occurs inside the function, methods defined inside the class still cannot see names defined at the class scope. Class variables must be accessed through the first parameter of instance or class methods, or through the implicit lexically scoped ``__class__`` reference described in the next section.
pt_br: No entanto, mesmo quando a definição de classe ocorre dentro da função, os métodos definidos dentro da classe ainda não podem ver os nomes definidos no escopo da classe. Variáveis de classe devem ser acessadas através do primeiro parâmetro de instância ou métodos de classe, ou através da referência implícita com escopo léxico ``__class__`` descrita na próxima seção.

source: Creating the class object
pt_br: Criando o objeto classe

source: Once the class namespace has been populated by executing the class body, the class object is created by calling ``metaclass(name, bases, namespace, **kwds)`` (the additional keywords passed here are the same as those passed to ``__prepare__``).
pt_br: Uma vez que o espaço de nomes da classe tenha sido preenchido executando o corpo da classe, o objeto classe é criado chamando ``metaclass(name, bases, namespace, **kwds)`` (os argumentos adicionais passados aqui são os mesmos passados para ``__prepare__``).

source: This class object is the one that will be referenced by the zero-argument form of :func:`super`. ``__class__`` is an implicit closure reference created by the compiler if any methods in a class body refer to either ``__class__`` or ``super``. This allows the zero argument form of :func:`super` to correctly identify the class being defined based on lexical scoping, while the class or instance that was used to make the current call is identified based on the first argument passed to the method.
pt_br: Este objeto classe é aquele que será referenciado pela chamada a :func:`super` sem argumentos. ``__class__`` é uma referência de clausura implícita criada pelo compilador se algum método no corpo da classe se referir a ``__class__`` ou ``super``. Isso permite que a forma de argumento zero de :func:`super` identifique corretamente a classe sendo definida com base no escopo léxico, enquanto a classe ou instância que foi usada para fazer a chamada atual é identificada com base no primeiro argumento passado para o método.

source: In CPython 3.6 and later, the ``__class__`` cell is passed to the metaclass as a ``__classcell__`` entry in the class namespace. If present, this must be propagated up to the ``type.__new__`` call in order for the class to be initialised correctly. Failing to do so will result in a :exc:`RuntimeError` in Python 3.8.
pt_br: No CPython 3.6 e posterior, a célula ``__class__`` é passada para a metaclasse como uma entrada de ``__classcell__`` no espaço de nomes da classe. Se estiver presente, deve ser propagado até a chamada a ``type.__new__`` para que a classe seja inicializada corretamente. Não fazer isso resultará em um :exc:`RuntimeError` no Python 3.8.

source: When using the default metaclass :class:`type`, or any metaclass that ultimately calls ``type.__new__``, the following additional customization steps are invoked after creating the class object:
pt_br: Quando usada a metaclasse padrão :class:`type`, ou qualquer metaclasse que chame ``type.__new__``, as seguintes etapas de personalização adicionais são executadas depois da criação do objeto classe:

source: The ``type.__new__`` method collects all of the attributes in the class namespace that define a :meth:`~object.__set_name__` method;
pt_br: O método ``type.__new__`` coleta todos os atributos no espaço de nomes da classe que definem um método :meth:`~object.__set_name__`;

source: Those ``__set_name__`` methods are called with the class being defined and the assigned name of that particular attribute;
pt_br: Esses métodos ``__set_name__`` são chamados com a classe sendo definida e o nome atribuído para este atributo específico;

source: The :meth:`~object.__init_subclass__` hook is called on the immediate parent of the new class in its method resolution order.
pt_br: O gancho :meth:`~object.__init_subclass__` é chamado na classe base imediata da nova classe em sua ordem de resolução de método.

source: After the class object is created, it is passed to the class decorators included in the class definition (if any) and the resulting object is bound in the local namespace as the defined class.
pt_br: Depois que o objeto classe é criado, ele é passado para os decoradores de classe incluídos na definição de classe (se houver) e o objeto resultante é vinculado ao espaço de nomes local como a classe definida.

source: When a new class is created by ``type.__new__``, the object provided as the namespace parameter is copied to a new ordered mapping and the original object is discarded. The new copy is wrapped in a read-only proxy, which becomes the :attr:`~type.__dict__` attribute of the class object.
pt_br: Quando uma nova classe é criada por ``type.__new__``, o objeto fornecido como o parâmetro do espaço de nomes é copiado para um novo mapeamento ordenado e o objeto original é descartado. A nova cópia é envolta em um proxy de somente leitura, que se torna o atributo :attr:`~type.__dict__` do objeto classe.

source: :pep:`3135` - New super
pt_br: :pep:`3135` - Novo super

source: Describes the implicit ``__class__`` closure reference
pt_br: Descreve a referência de clausura implícita de ``__class__``

source: Uses for metaclasses
pt_br: Usos para metaclasses

source: The potential uses for metaclasses are boundless. Some ideas that have been explored include enum, logging, interface checking, automatic delegation, automatic property creation, proxies, frameworks, and automatic resource locking/synchronization.
pt_br: Os usos potenciais para metaclasses são ilimitados. Algumas ideias que foram exploradas incluem enumeradores, criação de log, verificação de interface, delegação automática, criação automática de propriedade, proxies, estruturas e travamento/sincronização automático/a de recursos.

source: Customizing instance and subclass checks
pt_br: Personalizando verificações de instância e subclasse
