Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: Returns an iterator that yields information about successive ranges of :term:`bytecode`\s. Each item yielded is a ``(start, end, lineno)`` :class:`tuple`:
pt_br: Retorna um iterador que produz informações sobre intervalos sucessivos de :term:`bytecode`\s. Cada item gerado é uma :class:`tuple` de ``(start, end, lineno)``:

source: ``start`` (an :class:`int`) represents the offset (inclusive) of the start of the :term:`bytecode` range
pt_br: ``start`` (um :class:`int`) representa o deslocamento (inclusivo) do início do intervalo :term:`bytecode`

source: ``end`` (an :class:`int`) represents the offset (exclusive) of the end of the :term:`bytecode` range
pt_br: ``end`` (um :class:`int`) representa o deslocamento (exclusivo) do fim do intervalo :term:`bytecode`

source: ``lineno`` is an :class:`int` representing the line number of the :term:`bytecode` range, or ``None`` if the bytecodes in the given range have no line number
pt_br: ``lineno`` é um :class:`int` representando o número da linha do intervalo do :term:`bytecode`, ou ``None`` se os bytecodes no intervalo fornecido não tiverem número de linha

source: The items yielded will have the following properties:
pt_br: Os itens gerados terão as seguintes propriedades:

source: The first range yielded will have a ``start`` of 0.
pt_br: O primeiro intervalo gerado terá um ``start`` de 0.

source: The ``(start, end)`` ranges will be non-decreasing and consecutive. That is, for any pair of :class:`tuple`\s, the ``start`` of the second will be equal to the ``end`` of the first.
pt_br: Os intervalos ``(start, end)`` serão não decrescentes e consecutivos. Ou seja, para qualquer par de :class:`tuple`\s, o ``start`` do segundo será igual ao ``end`` do primeiro.

source: No range will be backwards: ``end >= start`` for all triples.
pt_br: Nenhum intervalo será inverso: ``end >= start`` para todos os trios.

source: The last :class:`tuple` yielded will have ``end`` equal to the size of the :term:`bytecode`.
pt_br: A última :class:`tuple` gerada terá ``end`` igual ao tamanho do :term:`bytecode`.

source: Zero-width ranges, where ``start == end``, are allowed. Zero-width ranges are used for lines that are present in the source code, but have been eliminated by the :term:`bytecode` compiler.
pt_br: Intervalos de largura zero, onde ``start == end``, são permitidos. Intervalos de largura zero são usados para linhas que estão presentes no código-fonte, mas foram eliminadas pelo compilador de :term:`bytecode`.

source: :pep:`626` - Precise line numbers for debugging and other tools.
pt_br: :pep:`626` - Números de linha precisos para depuração e outras ferramentas.

source: The PEP that introduced the :meth:`!co_lines` method.
pt_br: A PEP que introduziu o método :meth:`!co_lines`.

source: Return a copy of the code object with new values for the specified fields.
pt_br: Retorna uma cópia do objeto de código com novos valores para os campos especificados.

source: Code objects are also supported by the generic function :func:`copy.replace`.
pt_br: Objetos de código também são suportados pela função genérica :func:`copy.replace`.

source: Frame objects
pt_br: Objetos quadro

source: Frame objects represent execution frames. They may occur in :ref:`traceback objects <traceback-objects>`, and are also passed to registered trace functions.
pt_br: Objetos quadro representam quadros de execução. Eles podem ocorrer em :ref:`objetos traceback <traceback-objects>` e também são passados para funções de rastreamento registradas.

source: Points to the previous stack frame (towards the caller), or ``None`` if this is the bottom stack frame
pt_br: Aponta para o quadro de pilha anterior (em direção ao chamador), ou ``None`` se este for o quadro de pilha mais abaixo.

source: The :ref:`code object <code-objects>` being executed in this frame. Accessing this attribute raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"f_code"``.
pt_br: O :ref:`objeto código <code-objects>` sendo executado neste quadro. Acessar este atributo levanta um :ref:`evento de auditoria <auditing>` ``object.__getattr__`` com os argumentos ``obj`` e ``"f_code"``.

source: The mapping used by the frame to look up :ref:`local variables <naming>`. If the frame refers to an :term:`optimized scope`, this may return a write-through proxy object.
pt_br: O mapeamento usado pelo quadro para procurar :ref:`variáveis locais <naming>`. Se o quadro se referir a um :term:`escopo otimizado`, isso pode retornar um objeto proxy write-through.

source: Return a proxy for optimized scopes.
pt_br: Retorna um proxy para escopos otimizados.

source: The dictionary used by the frame to look up :ref:`global variables <naming>`
pt_br: O dicionário usado pelo quadro para procurar :ref:`variáveis globais <naming>`

source: The dictionary used by the frame to look up :ref:`built-in (intrinsic) names <naming>`
pt_br: O dicionário usado pelo quadro para procurar :ref:`nomes embutidos (intrínsecos) <naming>`

source: The "precise instruction" of the frame object (this is an index into the :term:`bytecode` string of the :ref:`code object <code-objects>`)
pt_br: A "instrução precisa" do objeto quadro (este é um índice na string :term:`bytecode` do :ref:`objeto código <code-objects>`)

source: If not ``None``, this is a function called for various events during code execution (this is used by debuggers). Normally an event is triggered for each new source line (see :attr:`~frame.f_trace_lines`).
pt_br: Se não for ``None``, esta é uma função chamada para vários eventos durante a execução do código (isso é usado por depuradores). Normalmente, um evento é disparado para cada nova linha de origem (veja :attr:`~frame.f_trace_lines`).

source: Set this attribute to :const:`False` to disable triggering a tracing event for each source line.
pt_br: Defina este atributo como :const:`False` para desabilitar o acionamento de um evento de rastreamento para cada linha de origem.

source: Set this attribute to :const:`True` to allow per-opcode events to be requested. Note that this may lead to undefined interpreter behaviour if exceptions raised by the trace function escape to the function being traced.
pt_br: Defina este atributo para :const:`True` para permitir que eventos por opcode sejam solicitados. Observe que isso pode levar a um comportamento indefinido do interpretador se as exceções levantadas pela função de rastreamento escaparem para a função que está sendo rastreada.

source: The current line number of the frame -- writing to this from within a trace function jumps to the given line (only for the bottom-most frame). A debugger can implement a Jump command (aka Set Next Statement) by writing to this attribute.
pt_br: O número da linha atual do quadro -- escrever para isso de dentro de uma função de rastreamento faz saltar para a linha dada (apenas para o quadro mais abaixo). Um depurador pode implementar um comando Jump (também conhecido como Set Next Statement) escrevendo para esse atributo.

source: Frame object methods
pt_br: Métodos de objetos quadro

source: Frame objects support one method:
pt_br: Objetos quadro têm suporte a um método:

source: This method clears all references to :ref:`local variables <naming>` held by the frame. Also, if the frame belonged to a :term:`generator`, the generator is finalized. This helps break reference cycles involving frame objects (for example when catching an :ref:`exception <bltin-exceptions>` and storing its :ref:`traceback <traceback-objects>` for later use).
pt_br: Este método limpa todas as referências a :ref:`variáveis locais <naming>` mantidas pelo quadro. Além disso, se o quadro pertencer a um :term:`gerador`, o gerador é finalizado. Isso ajuda a quebrar os ciclos de referência que envolvem objetos quadro (por exemplo, ao capturar uma :ref:`exceção <bltin-exceptions>` e armazenar seu :ref:`traceback <traceback-objects>` para uso posterior).

source: :exc:`RuntimeError` is raised if the frame is currently executing or suspended.
pt_br: :exc:`RuntimeError` é levantada se o quadro estiver em execução ou suspenso.

source: Attempting to clear a suspended frame raises :exc:`RuntimeError` (as has always been the case for executing frames).
pt_br: Tentar limpar um quadro suspenso levanta :exc:`RuntimeError` (como sempre foi o caso para quadros em execução).

source: Traceback objects
pt_br: Objetos traceback

source: Traceback objects represent the stack trace of an :ref:`exception <tut-errors>`. A traceback object is implicitly created when an exception occurs, and may also be explicitly created by calling :class:`types.TracebackType`.
pt_br: Objetos traceback representam o stack trace (situação da pilha de execução) de uma :ref:`exceção <tut-errors>`. Um objeto traceback é criado implicitamente quando ocorre uma exceção e também pode ser criado explicitamente chamando :class:`types.TracebackType`.

source: Traceback objects can now be explicitly instantiated from Python code.
pt_br: Objetos traceback agora podem ser instanciados explicitamente a partir de código Python.

source: For implicitly created tracebacks, when the search for an exception handler unwinds the execution stack, at each unwound level a traceback object is inserted in front of the current traceback. When an exception handler is entered, the stack trace is made available to the program. (See section :ref:`try`.) It is accessible as the third item of the tuple returned by :func:`sys.exc_info`, and as the :attr:`~BaseException.__traceback__` attribute of the caught exception.
pt_br: Para tracebacks criados implicitamente, quando a busca por um manipulador de exceção desenrola a pilha de execução, em cada nível desenrolado um objeto traceback é inserido na frente do traceback atual. Quando um manipulador de exceção é inserido, o stack trace é disponibilizado para o programa. (Veja a seção :ref:`try`.) É acessível como o terceiro item da tupla retornada por :func:`sys.exc_info`, e como o atributo :attr:`~BaseException.__traceback__` da exceção capturada.

source: When the program contains no suitable handler, the stack trace is written (nicely formatted) to the standard error stream; if the interpreter is interactive, it is also made available to the user as :data:`sys.last_traceback`.
pt_br: Quando o programa não contém um manipulador adequado, o stack trace é escrito (formatado de maneira adequada) no fluxo de erro padrão; se o interpretador for interativo, ele também é disponibilizado ao usuário como :data:`sys.last_traceback`.

source: For explicitly created tracebacks, it is up to the creator of the traceback to determine how the :attr:`~traceback.tb_next` attributes should be linked to form a full stack trace.
pt_br: Para tracebacks criados explicitamente, cabe ao criador do traceback determinar como os atributos :attr:`~traceback.tb_next` devem ser vinculados para formar um stack trace completo.

source: Points to the execution :ref:`frame <frame-objects>` of the current level.
pt_br: Aponta para o :ref:`quadro <frame-objects>` de execução do nível atual.

source: Accessing this attribute raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"tb_frame"``.
pt_br: Acessar este atributo levanta um :ref:`evento de auditoria <auditing>` ``object.__getattr__`` com os argumentos ``obj`` e ``"tb_frame"``.

source: Gives the line number where the exception occurred
pt_br: Fornece o número da linha onde ocorreu a exceção

source: Indicates the "precise instruction".
pt_br: Indica a "instrução precisa".

source: The line number and last instruction in the traceback may differ from the line number of its :ref:`frame object <frame-objects>` if the exception occurred in a :keyword:`try` statement with no matching except clause or with a :keyword:`finally` clause.
pt_br: O número da linha e a última instrução no traceback podem diferir do número da linha do seu :ref:`objeto quadro <frame-objects>` se a exceção ocorreu em uma instrução :keyword:`try` sem cláusula except correspondente ou com uma cláusula :keyword:`finally`.

source: The special writable attribute :attr:`!tb_next` is the next level in the stack trace (towards the frame where the exception occurred), or ``None`` if there is no next level.
pt_br: O atributo especial de escrita :attr:`!tb_next` é o próximo nível no stack trace (em direção ao quadro onde a exceção ocorreu), ou ``None`` se não houver próximo nível.

source: This attribute is now writable
pt_br: Este atributo agora é gravável

source: Slice objects
pt_br: Objetos slice

source: Slice objects are used to represent slices for :meth:`~object.__getitem__` methods. They are also created by the built-in :func:`slice` function.
pt_br: Objetos slice são usados para representar fatias para métodos :meth:`~object.__getitem__`. Eles também são criados pela função embutida :func:`slice`.

source: Special read-only attributes: :attr:`~slice.start` is the lower bound; :attr:`~slice.stop` is the upper bound; :attr:`~slice.step` is the step value; each is ``None`` if omitted. These attributes can have any type.
pt_br: Atributos especiais de somente leitura: :attr:`~slice.start` é o limite inferior; :attr:`~slice.stop` é o limite superior; :attr:`~slice.step` é o valor da diferença entre elementos subjacentes; cada um desses atributos é ``None`` se omitido. Esses atributos podem ter qualquer tipo.

source: Slice objects support one method:
pt_br: Objetos slice têm suporte a um método:

source: This method takes a single integer argument *length* and computes information about the slice that the slice object would describe if applied to a sequence of *length* items. It returns a tuple of three integers; respectively these are the *start* and *stop* indices and the *step* or stride length of the slice. Missing or out-of-bounds indices are handled in a manner consistent with regular slices.
pt_br: Este método recebe um único argumento inteiro *length* e calcula informações sobre a fatia que o objeto slice descreveria se aplicado a uma sequência de itens de *length*. Ele retorna uma tupla de três inteiros; respectivamente, estes são os índices *start* e *stop* e o *step* ou comprimento de avanços da fatia. Índices ausentes ou fora dos limites são tratados de maneira consistente com fatias regulares.

source: Static method objects
pt_br: Objetos método estático

source: Static method objects provide a way of defeating the transformation of function objects to method objects described above. A static method object is a wrapper around any other object, usually a user-defined method object. When a static method object is retrieved from a class or a class instance, the object actually returned is the wrapped object, which is not subject to any further transformation. Static method objects are also callable. Static method objects are created by the built-in :func:`staticmethod` constructor.
pt_br: Objetos método estático fornecem uma forma de transformar objetos função em objetos métodos descritos acima. Um objeto método estático é um invólucro em torno de qualquer outro objeto, comumente um objeto método definido pelo usuário. Quando um objeto método estático é recuperado de uma classe ou de uma instância de classe, o objeto retornado é o objeto encapsulado, do qual não está sujeito a nenhuma transformação adicional. Objetos método estático também são chamáveis. Objetos método estático são criados pelo construtor embutido :func:`staticmethod`.

source: Class method objects
pt_br: Objetos método de classe

source: A class method object, like a static method object, is a wrapper around another object that alters the way in which that object is retrieved from classes and class instances. The behaviour of class method objects upon such retrieval is described above, under :ref:`"instance methods" <instance-methods>`. Class method objects are created by the built-in :func:`classmethod` constructor.
pt_br: Um objeto método de classe, como um objeto método estático, é um invólucro em torno de outro objeto que altera a maneira como esse objeto é recuperado de classes e instâncias de classe. O comportamento dos objetos método de classe após tal recuperação é descrito acima, sob :ref:`"métodos de instância" <instance-methods>`. Objetos método de classe são criados pelo construtor embutido :func:`classmethod`.

source: Special method names
pt_br: Nomes de métodos especiais

source: A class can implement certain operations that are invoked by special syntax (such as arithmetic operations or subscripting and slicing) by defining methods with special names. This is Python's approach to :dfn:`operator overloading`, allowing classes to define their own behavior with respect to language operators. For instance, if a class defines a method named :meth:`~object.__getitem__`, and ``x`` is an instance of this class, then ``x[i]`` is roughly equivalent to ``type(x).__getitem__(x, i)``. Except where mentioned, attempts to execute an operation raise an exception when no appropriate method is defined (typically :exc:`AttributeError` or :exc:`TypeError`).
pt_br: Uma classe pode implementar certas operações que são chamadas por sintaxe especial (como operações aritméticas ou indexação e fatiamento), definindo métodos com nomes especiais. Esta é a abordagem do Python para :dfn:`sobrecarga de operador`, permitindo que as classes definam seu próprio comportamento em relação aos operadores da linguagem. Por exemplo, se uma classe define um método chamado :meth:`~object.__getitem__`, e ``x`` é uma instância desta classe, então ``x[i]`` é aproximadamente equivalente a ``type(x).__getitem__(x, i)``. Exceto onde mencionado, as tentativas de executar uma operação levantam uma exceção quando nenhum método apropriado é definido (tipicamente :exc:`AttributeError` ou :exc:`TypeError`).

source: Setting a special method to ``None`` indicates that the corresponding operation is not available. For example, if a class sets :meth:`~object.__iter__` to ``None``, the class is not iterable, so calling :func:`iter` on its instances will raise a :exc:`TypeError` (without falling back to :meth:`~object.__getitem__`). [#]_
pt_br: Definir um método especial para ``None`` indica que a operação correspondente não está disponível. Por exemplo, se uma classe define :meth:`~object.__iter__` para ``None``, a classe não é iterável, então chamar :func:`iter` em suas instâncias irá levantar um :exc:`TypeError` (sem retroceder para :meth:`~object.__getitem__`). [#]_

source: When implementing a class that emulates any built-in type, it is important that the emulation only be implemented to the degree that it makes sense for the object being modelled. For example, some sequences may work well with retrieval of individual elements, but extracting a slice may not make sense. (One example of this is the :class:`~xml.dom.NodeList` interface in the W3C's Document Object Model.)
pt_br: Ao implementar uma classe que emula qualquer tipo embutido, é importante que a emulação seja implementada apenas na medida em que faça sentido para o objeto que está sendo modelado. Por exemplo, algumas sequências podem funcionar bem com a recuperação de elementos individuais, mas extrair uma fatia pode não fazer sentido. (Um exemplo disso é a interface :class:`~xml.dom.NodeList` no Document Object Model do W3C.)

source: Basic customization
pt_br: Personalização básica

source: Called to create a new instance of class *cls*. :meth:`__new__` is a static method (special-cased so you need not declare it as such) that takes the class of which an instance was requested as its first argument. The remaining arguments are those passed to the object constructor expression (the call to the class). The return value of :meth:`__new__` should be the new object instance (usually an instance of *cls*).
pt_br: Chamado para criar uma nova instância da classe *cls*. :meth:`__new__` é um método estático (é um caso especial, então você não precisa declará-lo como tal) que recebe a classe da qual uma instância foi solicitada como seu primeiro argumento. Os argumentos restantes são aqueles passados para a expressão do construtor do objeto (a chamada para a classe). O valor de retorno de :meth:`__new__` deve ser a nova instância do objeto (geralmente uma instância de *cls*).

source: Typical implementations create a new instance of the class by invoking the superclass's :meth:`__new__` method using ``super().__new__(cls[, ...])`` with appropriate arguments and then modifying the newly created instance as necessary before returning it.
pt_br: Implementações típicas criam uma nova instância da classe invocando o método :meth:`__new__` da superclasse usando ``super().__new__(cls[, ...])`` com os argumentos apropriados e, em seguida, modificando a instância recém-criada conforme necessário antes de retorná-la.

source: If :meth:`__new__` is invoked during object construction and it returns an instance of *cls*, then the new instance’s :meth:`__init__` method will be invoked like ``__init__(self[, ...])``, where *self* is the new instance and the remaining arguments are the same as were passed to the object constructor.
pt_br: Se :meth:`__new__` é chamado durante a construção do objeto e retorna uma instância de *cls*, então o método :meth:`__init__` da nova instância será chamado como ``__init__(self[, ...])``, onde *self* é a nova instância e os argumentos restantes são os mesmos que foram passados para o construtor do objeto.

source: If :meth:`__new__` does not return an instance of *cls*, then the new instance's :meth:`__init__` method will not be invoked.
pt_br: Se :meth:`__new__` não retornar uma instância de *cls*, então o método :meth:`__init__` da nova instância não será invocado.

source: :meth:`__new__` is intended mainly to allow subclasses of immutable types (like int, str, or tuple) to customize instance creation. It is also commonly overridden in custom metaclasses in order to customize class creation.
pt_br: :meth:`__new__` destina-se principalmente a permitir que subclasses de tipos imutáveis (como int, str ou tupla) personalizem a criação de instâncias. Também é comumente substituído em metaclasses personalizadas para personalizar a criação de classes.

source: Called after the instance has been created (by :meth:`__new__`), but before it is returned to the caller. The arguments are those passed to the class constructor expression. If a base class has an :meth:`__init__` method, the derived class's :meth:`__init__` method, if any, must explicitly call it to ensure proper initialization of the base class part of the instance; for example: ``super().__init__([args...])``.
pt_br: Chamado após a instância ter sido criada (por :meth:`__new__`), mas antes de ser retornada ao chamador. Os argumentos são aqueles passados para a expressão do construtor da classe. Se uma classe base tem um método :meth:`__init__`, o método :meth:`__init__` da classe derivada, se houver, deve chamá-lo explicitamente para garantir a inicialização apropriada da parte da classe base da instância; por exemplo: ``super().__init__([args...])``.

source: Because :meth:`__new__` and :meth:`__init__` work together in constructing objects (:meth:`__new__` to create it, and :meth:`__init__` to customize it), no non-``None`` value may be returned by :meth:`__init__`; doing so will cause a :exc:`TypeError` to be raised at runtime.
pt_br: Porque :meth:`__new__` e :meth:`__init__` trabalham juntos na construção de objetos (:meth:`__new__` para criá-lo e :meth:`__init__` para personalizá-lo), nenhum valor diferente de ``None`` pode ser retornado por :meth:`__init__`; fazer isso fará com que uma :exc:`TypeError` seja levantada em tempo de execução.
