Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: In addition to bypassing any instance attributes in the interest of correctness, implicit special method lookup generally also bypasses the :meth:`~object.__getattribute__` method even of the object's metaclass::
pt_br: Além de contornar quaisquer atributos de instância no interesse da correção, a pesquisa de método especial implícita geralmente também contorna o método :meth:`~object.__getattribute__` mesmo da metaclasse do objeto::

source: Bypassing the :meth:`~object.__getattribute__` machinery in this fashion provides significant scope for speed optimisations within the interpreter, at the cost of some flexibility in the handling of special methods (the special method *must* be set on the class object itself in order to be consistently invoked by the interpreter).
pt_br: Ignorar a maquinaria de :meth:`~object.__getattribute__` desta forma fornece um escopo significativo para otimizações de velocidade dentro do interpretador, ao custo de alguma flexibilidade no tratamento de métodos especiais (o método especial *deve* ser definido no próprio objeto classe em ordem ser invocado de forma consistente pelo interpretador).

source: Coroutines
pt_br: Corrotinas

source: Awaitable Objects
pt_br: Objetos aguardáveis

source: An :term:`awaitable` object generally implements an :meth:`~object.__await__` method. :term:`Coroutine objects <coroutine>` returned from :keyword:`async def` functions are awaitable.
pt_br: Um objeto :term:`aguardável` geralmente implementa um método :meth:`~object.__await__`. Os :term:`objetos corrotina <coroutine>` retornados das funções :keyword:`async def` são aguardáveis.

source: The :term:`generator iterator` objects returned from generators decorated with :func:`types.coroutine` are also awaitable, but they do not implement :meth:`~object.__await__`.
pt_br: Os objetos :term:`iteradores geradores <iterador gerador>` retornados de geradores decorados com :func:`types.coroutine` também são aguardáveis, mas eles não implementam :meth:`~object.__await__`.

source: Must return an :term:`iterator`. Should be used to implement :term:`awaitable` objects. For instance, :class:`asyncio.Future` implements this method to be compatible with the :keyword:`await` expression. The :class:`object` class itself is not awaitable and does not provide this method.
pt_br: Deve retornar um :term:`iterador`. Deve ser usado para implementar objetos :term:`aguardáveis <aguardável>`. Por exemplo, :class:`asyncio.Future` implementa este método para ser compatível com a expressão :keyword:`await`. A classe :class:`object` em si não é aguardável e não fornece este método.

source: The language doesn't place any restriction on the type or value of the objects yielded by the iterator returned by ``__await__``, as this is specific to the implementation of the asynchronous execution framework (e.g. :mod:`asyncio`) that will be managing the :term:`awaitable` object.
pt_br: A linguagem não impõe nenhuma restrição ao tipo ou valor dos objetos produzidos pelo iterador retornado por ``__await__``, pois isso é específico para a implementação da estrutura de execução assíncrona (por exemplo, :mod:`asyncio`) que gerenciará o objeto :term:`awaitable`.

source: :pep:`492` for additional information about awaitable objects.
pt_br: :pep:`492` para informações adicionais sobre objetos aguardáveis.

source: Coroutine Objects
pt_br: Objetos corrotina

source: :term:`Coroutine objects <coroutine>` are :term:`awaitable` objects. A coroutine's execution can be controlled by calling :meth:`~object.__await__` and iterating over the result. When the coroutine has finished executing and returns, the iterator raises :exc:`StopIteration`, and the exception's :attr:`~StopIteration.value` attribute holds the return value. If the coroutine raises an exception, it is propagated by the iterator. Coroutines should not directly raise unhandled :exc:`StopIteration` exceptions.
pt_br: :term:`Objetos corrotina <coroutine>` são objetos :term:`aguardáveis <aguardável>`. A execução de uma corrotina pode ser controlada chamando :meth:`~object.__await__` e iterando sobre o resultado. Quando a corrotina termina a execução e retorna, o iterador levanta :exc:`StopIteration`, e o atributo :attr:`~StopIteration.value` da exceção contém o valor de retorno. Se a corrotina levantar uma exceção, ela será propagada pelo iterador. As corrotinas não devem levantar exceções :exc:`StopIteration` diretamente não tratadas.

source: Coroutines also have the methods listed below, which are analogous to those of generators (see :ref:`generator-methods`). However, unlike generators, coroutines do not directly support iteration.
pt_br: As corrotinas também têm os métodos listados abaixo, que são análogos aos dos geradores (ver :ref:`generator-methods`). No entanto, ao contrário dos geradores, as corrotinas não suportam diretamente a iteração.

source: It is a :exc:`RuntimeError` to await on a coroutine more than once.
pt_br: É uma :exc:`RuntimeError` para aguardar uma corrotina mais de uma vez.

source: Starts or resumes execution of the coroutine. If *value* is ``None``, this is equivalent to advancing the iterator returned by :meth:`~object.__await__`. If *value* is not ``None``, this method delegates to the :meth:`~generator.send` method of the iterator that caused the coroutine to suspend. The result (return value, :exc:`StopIteration`, or other exception) is the same as when iterating over the :meth:`!__await__` return value, described above.
pt_br: Inicia ou retoma a execução da corrotina. Se *value* for ``None``, isso equivale a avançar o iterador retornado por :meth:`~object.__await__`. Se *value* não for ``None``, este método delega para o método :meth:`~generator.send` do iterador que causou a suspensão da corrotina. O resultado (valor de retorno, :exc:`StopIteration` ou outra exceção) é o mesmo de iterar sobre o valor de retorno :meth:`!__await__`, descrito acima.

source: Raises the specified exception in the coroutine. This method delegates to the :meth:`~generator.throw` method of the iterator that caused the coroutine to suspend, if it has such a method. Otherwise, the exception is raised at the suspension point. The result (return value, :exc:`StopIteration`, or other exception) is the same as when iterating over the :meth:`~object.__await__` return value, described above. If the exception is not caught in the coroutine, it propagates back to the caller.
pt_br: Levanta a exceção especificada na corrotina. Este método delega ao método :meth:`~generator.throw` do iterador que causou a suspensão da corrotina, se ela tiver tal método. Caso contrário, a exceção é levantada no ponto de suspensão. O resultado (valor de retorno, :exc:`StopIteration` ou outra exceção) é o mesmo de iterar sobre o valor de retorno :meth:`~object.__await__`, descrito acima. Se a exceção não for capturada na corrotina, ela se propagará de volta para o chamador.

source: The second signature \(type\[, value\[, traceback\]\]\) is deprecated and may be removed in a future version of Python.
pt_br: A segunda assinatura \(tipo\[, valor\[, traceback\]\]\]\) foi descontinuada e pode ser removida em uma versão futura do Python.

source: Causes the coroutine to clean itself up and exit. If the coroutine is suspended, this method first delegates to the :meth:`~generator.close` method of the iterator that caused the coroutine to suspend, if it has such a method. Then it raises :exc:`GeneratorExit` at the suspension point, causing the coroutine to immediately clean itself up. Finally, the coroutine is marked as having finished executing, even if it was never started.
pt_br: Faz com que a corrotina se limpe e saia. Se a corrotina for suspensa, este método primeiro delega para o método :meth:`~generator.close` do iterador que causou a suspensão da corrotina, se tiver tal método. Então ele levanta :exc:`GeneratorExit` no ponto de suspensão, fazendo com que a corrotina se limpe imediatamente. Por fim, a corrotina é marcada como tendo sua execução concluída, mesmo que nunca tenha sido iniciada.

source: Coroutine objects are automatically closed using the above process when they are about to be destroyed.
pt_br: Objetos corrotina são fechados automaticamente usando o processo acima quando estão prestes a ser destruídos.

source: Asynchronous Iterators
pt_br: Iteradores assíncronos

source: An *asynchronous iterator* can call asynchronous code in its ``__anext__`` method.
pt_br: Um *iterador assíncrono* pode chamar código assíncrono em seu método ``__anext__``.

source: Asynchronous iterators can be used in an :keyword:`async for` statement.
pt_br: Os iteradores assíncronos podem ser usados em uma instrução :keyword:`async for`.

source: The :class:`object` class itself does not provide these methods.
pt_br: A classe :class:`object` em si não fornece estes métodos.

source: Must return an *asynchronous iterator* object.
pt_br: Deve retornar um objeto *iterador assíncrono*.

source: Must return an *awaitable* resulting in a next value of the iterator. Should raise a :exc:`StopAsyncIteration` error when the iteration is over.
pt_br: Deve retornar um *aguardável* resultando em um próximo valor do iterador. Deve levantar um erro :exc:`StopAsyncIteration` quando a iteração terminar.

source: An example of an asynchronous iterable object::
pt_br: Um exemplo de objeto iterável assíncrono::

source: Prior to Python 3.7, :meth:`~object.__aiter__` could return an *awaitable* that would resolve to an :term:`asynchronous iterator <asynchronous iterator>`.
pt_br: Antes do Python 3.7, :meth:`~object.__aiter__` poderia retornar um *aguardável* que resolveria para um :term:`iterador assíncrono <asynchronous iterator>`.

source: Starting with Python 3.7, :meth:`~object.__aiter__` must return an asynchronous iterator object. Returning anything else will result in a :exc:`TypeError` error.
pt_br: A partir do Python 3.7, :meth:`~object.__aiter__` deve retornar um objeto iterador assíncrono. Retornar qualquer outra coisa resultará em um erro :exc:`TypeError`.

source: Asynchronous Context Managers
pt_br: Gerenciadores de contexto assíncronos

source: An *asynchronous context manager* is a *context manager* that is able to suspend execution in its ``__aenter__`` and ``__aexit__`` methods.
pt_br: Um *gerenciador de contexto assíncrono* é um *gerenciador de contexto* que é capaz de suspender a execução em seus métodos ``__aenter__`` e ``__aexit__``.

source: Asynchronous context managers can be used in an :keyword:`async with` statement.
pt_br: Os gerenciadores de contexto assíncronos podem ser usados em uma instrução :keyword:`async with`.

source: Semantically similar to :meth:`~object.__enter__`, the only difference being that it must return an *awaitable*.
pt_br: Semanticamente semelhante a :meth:`~object.__enter__`, a única diferença é que ele deve retornar um *aguardável*.

source: Semantically similar to :meth:`~object.__exit__`, the only difference being that it must return an *awaitable*.
pt_br: Semanticamente semelhante a :meth:`~object.__exit__`, a única diferença é que ele deve retornar um *aguardável*.

source: An example of an asynchronous context manager class::
pt_br: Um exemplo de uma classe gerenciadora de contexto assíncrona::

source: class AsyncContextManager: async def __aenter__(self): await log('entering context') async def __aexit__(self, exc_type, exc, tb): await log('exiting context')
pt_br: class AsyncContextManager: async def __aenter__(self): await log('entrando no contexto') async def __aexit__(self, exc_type, exc, tb): await log('saindo do contexto')

source: Footnotes
pt_br: Notas de rodapé

source: It *is* possible in some cases to change an object's type, under certain controlled conditions. It generally isn't a good idea though, since it can lead to some very strange behaviour if it is handled incorrectly.
pt_br: Em alguns casos, *é* possível alterar o tipo de um objeto, sob certas condições controladas. No entanto, geralmente não é uma boa ideia, pois pode levar a um comportamento muito estranho se for tratado incorretamente.

source: The :meth:`~object.__hash__`, :meth:`~object.__iter__`, :meth:`~object.__reversed__`, :meth:`~object.__contains__`, :meth:`~object.__class_getitem__` and :meth:`~os.PathLike.__fspath__` methods have special handling for this. Others will still raise a :exc:`TypeError`, but may do so by relying on the behavior that ``None`` is not callable.
pt_br: Os métodos :meth:`~object.__hash__`, :meth:`~object.__iter__`, :meth:`~object.__reversed__` e :meth:`~object.__contains__`, :meth:`~object.__class_getitem__` e :meth:`~os.PathLike.__fspath__` têm um tratamento especial para isso. Outros ainda irão levantar um :exc:`TypeError`, mas podem fazer isso contando com o comportamento de que ``None`` não é chamável.

source: "Does not support" here means that the class has no such method, or the method returns :data:`NotImplemented`. Do not set the method to ``None`` if you want to force fallback to the right operand's reflected method—that will instead have the opposite effect of explicitly *blocking* such fallback.
pt_br: "Não suportar" aqui significa que a classe não possui tal método, ou o método retorna :data:`NotImplemented`. Não defina o método como ``None`` se quiser forçar o fallback para o método refletido do operando correto -- isso terá o efeito oposto de *bloquear* explicitamente esse fallback.

source: For operands of the same type, it is assumed that if the non-reflected method -- such as :meth:`~object.__add__` -- fails then the overall operation is not supported, which is why the reflected method is not called.
pt_br: Para operandos do mesmo tipo, presume-se que se o método não refletido -- como :meth:`~object.__add__` -- falhar, a operação geral não será suportada, razão pela qual o método refletido não é chamado.

source: object
pt_br: objeto

source: data
pt_br: dados

source: built-in function
pt_br: função embutida

source: type
pt_br: tipo

source: identity of an object
pt_br: identidade de um objeto

source: value of an object
pt_br: valor de um objeto

source: type of an object
pt_br: tipo de um objeto

source: mutable object
pt_br: objeto mutável

source: immutable object
pt_br: objeto imutável

source: garbage collection
pt_br: coleta de lixo

source: reference counting
pt_br: contagem de referências

source: unreachable object
pt_br: objeto inalcançável

source: container
pt_br: contêiner

source: hierarchy
pt_br: hierarquia

source: extension
pt_br: extensão

source: module
pt_br: módulo

source: language
pt_br: linguagem

source: attribute
pt_br: atributo

source: special
pt_br: especial

source: generic
pt_br: genérico

source: ellipsis literal
pt_br: reticências literais

source: numeric
pt_br: numérico

source: integer
pt_br: inteiro

source: representation
pt_br: representação

source: Boolean
pt_br: Booleano

source: floating-point
pt_br: ponto flutuante

source: number
pt_br: número

source: complex
pt_br: complexo

source: sequence
pt_br: sequência

source: index operation
pt_br: operação com índice

source: item selection
pt_br: seleção item

source: subscription
pt_br: subscrição

source: slicing
pt_br: fatiamento

source: immutable sequence
pt_br: sequência imutável

source: immutable
pt_br: imutável

source: immutable sequences
pt_br: sequências imutáveis

source: character
pt_br: caractere

source: tuple
pt_br: tupla

source: empty
pt_br: vazio

source: mutable sequence
pt_br: sequência mutável

source: mutable
pt_br: mutável

source: assignment
pt_br: atribuição

source: statement
pt_br: instrução

source: array
pt_br: vetor

source: list
pt_br: lista

source: set type
pt_br: tipo conjunto

source: mapping
pt_br: mapeamento

source: dictionary
pt_br: dicionário

source: callable
pt_br: chamável

source: function
pt_br: função

source: call
pt_br: chamada

source: invocation
pt_br: invocação

source: argument
pt_br: argumento

source: user-defined
pt_br: definida por usuário

source: user-defined function
pt_br: função definida por usuário

source: __closure__ (function attribute)
pt_br: __closure__ (atributo de função)

source: __globals__ (function attribute)
pt_br: __globals__ (atributo de função)

source: namespace
pt_br: espaço de nomes

source: __doc__ (function attribute)
pt_br: __doc__ (atributo de função)

source: __name__ (function attribute)
pt_br: __name__ (atributo de função)

source: __module__ (function attribute)
pt_br: __module__ (atributo de função)

source: __dict__ (function attribute)
pt_br: __dict__ (atributo de função)

source: __defaults__ (function attribute)
pt_br: __defaults__ (atributo de função)

source: __code__ (function attribute)
pt_br: __code__ (atributo de função)

source: __annotations__ (function attribute)
pt_br: __annotations__ (atributo de função)

source: __kwdefaults__ (function attribute)
pt_br: __kwdefaults__ (atributo de função)

source: __type_params__ (function attribute)
pt_br: __type_params__ (atributo de função)

source: method
pt_br: método

source: user-defined method
pt_br: método definido por usuário

source: __func__ (method attribute)
pt_br: __func__ (atributo de método)

source: __self__ (method attribute)
pt_br: __self__ (atributo de método)

source: __doc__ (method attribute)
pt_br: __doc__ (atributo de método)

source: __name__ (method attribute)
pt_br: __name__ (atributo de método)

source: __module__ (method attribute)
pt_br: __module__ (atributo de método)

source: generator
pt_br: gerador

source: iterator
pt_br: iterador

source: coroutine
pt_br: corrotina

source: asynchronous generator
pt_br: gerador assíncrono

source: asynchronous iterator
pt_br: iterador assíncrono

source: built-in method
pt_br: método embutido

source: built-in
pt_br: embutido

source: import
pt_br: importação

source: __name__ (module attribute)
pt_br: __name__ (atributo de módulo)

source: __spec__ (module attribute)
pt_br: __spec__ (atributo de módulo)

source: __package__ (module attribute)
pt_br: __package__ (atributo de módulo)

source: __loader__ (module attribute)
pt_br: __loader__ (atributo de módulo)

source: __path__ (module attribute)
pt_br: __path__ (atributo de módulo)

source: __file__ (module attribute)
pt_br: __file__ (atributo de módulo)

source: __cached__ (module attribute)
pt_br: __cached__ (atributo de módulo)

source: __doc__ (module attribute)
pt_br: __doc__ (atributo de módulo)

source: __annotations__ (module attribute)
pt_br: __annotations__ (atributo de módulo)

source: __dict__ (module attribute)
pt_br: __dict__ (atributo de módulo)

source: class
pt_br: classe

source: class instance
pt_br: instância de classe

source: instance
pt_br: instância

source: class object
pt_br: objeto classe

source: __name__ (class attribute)
pt_br: __name__ (atributo de classe)

source: __module__ (class attribute)
pt_br: __module__ (atributo de classe)

source: __dict__ (class attribute)
pt_br: __dict__ (atributo de classe)

source: __bases__ (class attribute)
pt_br: __bases__ (atributo de classe)

source: __doc__ (class attribute)
pt_br: __doc__ (atributo de classe)

source: __annotations__ (class attribute)
pt_br: __annotations__ (atributo de classe)

source: __type_params__ (class attribute)
pt_br: __type_params__ (atributo de classe)

source: __static_attributes__ (class attribute)
pt_br: __static_attributes__ (atributo de classe)

source: __firstlineno__ (class attribute)
pt_br: __firstlineno__ (atributo de classe)

source: __dict__ (instance attribute)
pt_br: __dict__ (atributo de instância)

source: __class__ (instance attribute)
pt_br: __class__ (atributo de instância)

source: popen() (in module os)
pt_br: popen() (no módulo os)

source: makefile() (socket method)
pt_br: makefile() (método de socket)

source: stdin (in module sys)
pt_br: stdin (no módulo sys)

source: stdout (in module sys)
pt_br: stdout (no módulo sys)

source: stderr (in module sys)
pt_br: stderr (no módulo sys)

source: internal type
pt_br: tipo interno

source: types, internal
pt_br: tipos, internos

source: code
pt_br: código

source: code object
pt_br: objeto código

source: co_argcount (code object attribute)
pt_br: co_argcount (atributo de objeto código)

source: co_posonlyargcount (code object attribute)
pt_br: co_posonlyargcount (atributo de objeto código)

source: co_kwonlyargcount (code object attribute)
pt_br: co_kwonlyargcount (atributo de objeto código)

source: co_code (code object attribute)
pt_br: co_code (atributo de objeto código)

source: co_consts (code object attribute)
pt_br: co_consts (atributo de objeto código)

source: co_filename (code object attribute)
pt_br: co_filename (atributo de objeto código)

source: co_firstlineno (code object attribute)
pt_br: co_firstlineno (atributo de objeto código)

source: co_flags (code object attribute)
pt_br: co_flags (atributo de objeto código)

source: co_lnotab (code object attribute)
pt_br: co_lnotab (atributo de objeto código)

source: co_name (code object attribute)
pt_br: co_name (atributo de objeto código)

source: co_names (code object attribute)
pt_br: co_names (atributo de objeto código)

source: co_nlocals (code object attribute)
pt_br: co_nlocals (atributo de objeto código)

source: co_stacksize (code object attribute)
pt_br: co_stacksize (atributo de objeto código)

source: co_varnames (code object attribute)
pt_br: co_varnames (atributo de objeto código)

source: co_cellvars (code object attribute)
pt_br: co_cellvars (atributo de objeto código)

source: co_freevars (code object attribute)
pt_br: co_freevars (atributo de objeto código)

source: co_qualname (code object attribute)
pt_br: co_qualname (atributo de objeto código)

source: documentation string
pt_br: string de documentação

source: frame
pt_br: quadro

source: f_back (frame attribute)
pt_br: f_back (atributo de frame)

source: f_code (frame attribute)
pt_br: f_code (atributo de frame)

source: f_globals (frame attribute)
pt_br: f_globals (atributo de frame)

source: f_locals (frame attribute)
pt_br: f_locals (atributo de frame)

source: f_lasti (frame attribute)
pt_br: f_lasti (atributo de frame)

source: f_builtins (frame attribute)
pt_br: f_builtins (atributo de frame)

source: f_trace (frame attribute)
pt_br: f_trace (atributo de frame)

source: f_trace_lines (frame attribute)
pt_br: f_trace_lines (atributo de frame)

source: f_trace_opcodes (frame attribute)
pt_br: f_trace_opcodes (atributo de frame)

source: f_lineno (frame attribute)
pt_br: f_lineno (atributo de frame)

source: stack
pt_br: pilha (stack)

source: trace
pt_br: rastro (trace)

source: exception
pt_br: exceção

source: handler
pt_br: manipulador (handler)

source: execution
pt_br: execução

source: exc_info (in module sys)
pt_br: exc_info (no módulo sys)

source: last_traceback (in module sys)
pt_br: last_traceback (no módulo sys)

source: tb_frame (traceback attribute)
pt_br: tb_frame (atributo de traceback)

source: tb_lineno (traceback attribute)
pt_br: tb_lineno (atributo de traceback)

source: tb_lasti (traceback attribute)
pt_br: tb_lasti (atributo de traceback)

source: tb_next (traceback attribute)
pt_br: tb_next (atributo de traceback)

source: slice
pt_br: fatia

source: start (slice object attribute)
pt_br: início (atributo de objeto fatia)

source: stop (slice object attribute)
pt_br: stop (atributo de objeto fatia)

source: step (slice object attribute)
pt_br: step (atributo de objeto fatia)

source: operator
pt_br: operador

source: overloading
pt_br: sobrecarga

source: __getitem__() (mapping object method)
pt_br: __getitem__() (método de objeto mapeamento)

source: subclassing
pt_br: subclasse

source: immutable types
pt_br: tipos imutáveis

source: constructor
pt_br: construtor

source: destructor
pt_br: destrutor

source: finalizer
pt_br: finalizador

source: repr() (built-in function)
pt_br: repr() (função embutida)

source: __repr__() (object method)
pt_br: __repr__() (método de objeto)
