Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: A function or method which is defined using :keyword:`async def` is called a :dfn:`coroutine function`. Such a function, when called, returns a :term:`coroutine` object. It may contain :keyword:`await` expressions, as well as :keyword:`async with` and :keyword:`async for` statements. See also the :ref:`coroutine-objects` section.
pt_br: Uma função ou um método que é definida(o) usando :keyword:`async def` é chamado de :dfn:`função de corrotina`. Tal função, quando chamada, retorna um objeto de :term:`corrotina`. Ele pode conter expressões :keyword:`await`, bem como instruções :keyword:`async with` e :keyword:`async for`. Veja também a seção :ref:`coroutine-objects`.

source: Asynchronous generator functions
pt_br: Funções geradoras assíncronas

source: A function or method which is defined using :keyword:`async def` and which uses the :keyword:`yield` statement is called a :dfn:`asynchronous generator function`. Such a function, when called, returns an :term:`asynchronous iterator` object which can be used in an :keyword:`async for` statement to execute the body of the function.
pt_br: Uma função ou um método que é definida(o) usando :keyword:`async def` e que usa a instrução :keyword:`yield` é chamada de :dfn:`função geradora assíncrona`. Tal função, quando chamada, retorna um objeto :term:`iterador assíncrono` que pode ser usado em uma instrução :keyword:`async for` para executar o corpo da função.

source: Calling the asynchronous iterator's :meth:`aiterator.__anext__ <object.__anext__>` method will return an :term:`awaitable` which when awaited will execute until it provides a value using the :keyword:`yield` expression. When the function executes an empty :keyword:`return` statement or falls off the end, a :exc:`StopAsyncIteration` exception is raised and the asynchronous iterator will have reached the end of the set of values to be yielded.
pt_br: Chamar o método :meth:`aiterator.__anext__ <object.__anext__>` do iterador assíncrono retornará um :term:`aguardável` que, quando aguardado, será executado até fornecer um valor usando a expressão :keyword:`yield`. Quando a função executa uma instrução vazia :keyword:`return` ou chega ao final, uma exceção :exc:`StopAsyncIteration` é levantada e o iterador assíncrono terá alcançado o final do conjunto de valores a serem produzidos.

source: Built-in functions
pt_br: Funções embutidas

source: A built-in function object is a wrapper around a C function. Examples of built-in functions are :func:`len` and :func:`math.sin` (:mod:`math` is a standard built-in module). The number and type of the arguments are determined by the C function. Special read-only attributes:
pt_br: Um objeto função embutida é um wrapper em torno de uma função C. Exemplos de funções embutidas são :func:`len` e :func:`math.sin` (:mod:`math` é um módulo embutido padrão). O número e o tipo dos argumentos são determinados pela função C. Atributos especiais de somente leitura:

source: :attr:`!__doc__` is the function's documentation string, or ``None`` if unavailable. See :attr:`function.__doc__`.
pt_br: :attr:`!__doc__` é a string de documentação da função, ou ``None`` se não estiver disponível. Veja :attr:`function.__doc__`.

source: :attr:`!__name__` is the function's name. See :attr:`function.__name__`.
pt_br: :attr:`!__name__` é o nome da função. Veja :attr:`function.__name__`.

source: :attr:`!__self__` is set to ``None`` (but see the next item).
pt_br: :attr:`!__self__` é definido para ``None`` (mas veja o próximo item).

source: :attr:`!__module__` is the name of the module the function was defined in or ``None`` if unavailable. See :attr:`function.__module__`.
pt_br: :attr:`!__module__` é o nome do módulo no qual a função foi definida ou ``None`` se não estiver disponível. Veja :attr:`function.__module__`.

source: Built-in methods
pt_br: Métodos embutidos

source: This is really a different disguise of a built-in function, this time containing an object passed to the C function as an implicit extra argument. An example of a built-in method is ``alist.append()``, assuming *alist* is a list object. In this case, the special read-only attribute :attr:`!__self__` is set to the object denoted by *alist*. (The attribute has the same semantics as it does with :attr:`other instance methods <method.__self__>`.)
pt_br: Este é realmente um disfarce diferente de uma função embutida, desta vez contendo um objeto passado para a função C como um argumento extra implícito. Um exemplo de método embutido é ``alist.append()``, presumindo que *alist* é um objeto de lista. Nesse caso, o atributo especial de somente leitura :attr:`!__self__` é definido como o objeto denotado por *alist*. (O atributo tem a mesma semântica de :attr:`outros métodos de instância <method.__self__>`.)

source: Classes are callable. These objects normally act as factories for new instances of themselves, but variations are possible for class types that override :meth:`~object.__new__`. The arguments of the call are passed to :meth:`!__new__` and, in the typical case, to :meth:`~object.__init__` to initialize the new instance.
pt_br: Classes são chamáveis. Esses objetos normalmente agem como fábricas para novas instâncias de si mesmos, mas variações são possíveis para tipos de classe que substituem :meth:`~object.__new__`. Os argumentos da chamada são passados para :meth:`!__new__` e, no caso típico, para :meth:`~object.__init__` para inicializar a nova instância.

source: Class Instances
pt_br: Instâncias de classe

source: Instances of arbitrary classes can be made callable by defining a :meth:`~object.__call__` method in their class.
pt_br: Instâncias de classes arbitrárias podem ser tornados chamáveis definindo um método :meth:`~object.__call__` em sua classe.

source: Modules
pt_br: Módulos

source: Modules are a basic organizational unit of Python code, and are created by the :ref:`import system <importsystem>` as invoked either by the :keyword:`import` statement, or by calling functions such as :func:`importlib.import_module` and built-in :func:`__import__`. A module object has a namespace implemented by a :class:`dictionary <dict>` object (this is the dictionary referenced by the :attr:`~function.__globals__` attribute of functions defined in the module). Attribute references are translated to lookups in this dictionary, e.g., ``m.x`` is equivalent to ``m.__dict__["x"]``. A module object does not contain the code object used to initialize the module (since it isn't needed once the initialization is done).
pt_br: Módulos são uma unidade organizacional básica do código Python, e são criados pelo :ref:`sistema de importação <importsystem>` quando invocado pela instrução :keyword:`import`, ou chamando funções como :func:`importlib.import_module` e a embutida :func:`__import__`. Um objeto módulo tem um espaço de nomes implementado por um objeto :class:`dicionário <dict>` (este é o dicionário referenciado pelo atributo :attr:`~function.__globals__` das funções definidas no módulo). As referências de atributos são traduzidas para pesquisas neste dicionário, por exemplo, ``m.x`` é equivalente a ``m.__dict__["x"]``. Um objeto módulo não contém o objeto código usado para inicializar o módulo (uma vez que não é necessário depois que a inicialização é concluída).

source: Attribute assignment updates the module's namespace dictionary, e.g., ``m.x = 1`` is equivalent to ``m.__dict__["x"] = 1``.
pt_br: A atribuição de atributo atualiza o dicionário de espaço de nomes do módulo, por exemplo, ``m.x = 1`` é equivalente a ``m.__dict__["x"] = 1``.

source: Import-related attributes on module objects
pt_br: Atributos relacionados à importação em objetos de módulo

source: Module objects have the following attributes that relate to the :ref:`import system <importsystem>`. When a module is created using the machinery associated with the import system, these attributes are filled in based on the module's :term:`spec <module spec>`, before the :term:`loader` executes and loads the module.
pt_br: Objetos de módulo têm os seguintes atributos que se relacionam ao :ref:`sistema de importação <importsystem>`. Quando um módulo é criado usando o maquinário associado ao sistema de importação, esses atributos são preenchidos com base no :term:`spec <module spec>` do módulo, antes que o :term:`carregador` execute e carregue o módulo.

source: To create a module dynamically rather than using the import system, it's recommended to use :func:`importlib.util.module_from_spec`, which will set the various import-controlled attributes to appropriate values. It's also possible to use the :class:`types.ModuleType` constructor to create modules directly, but this technique is more error-prone, as most attributes must be manually set on the module object after it has been created when using this approach.
pt_br: Para criar um módulo dinamicamente em vez de usar o sistema de importação, é recomendado usar :func:`importlib.util.module_from_spec`, que definirá os vários atributos controlados pela importação para valores apropriados. Também é possível usar o construtor :class:`types.ModuleType` para criar módulos diretamente, mas essa técnica é mais propensa a erros, pois a maioria dos atributos deve ser definida manualmente no objeto do módulo após ele ter sido criado ao usar essa abordagem.

source: With the exception of :attr:`~module.__name__`, it is **strongly** recommended that you rely on :attr:`~module.__spec__` and its attributes instead of any of the other individual attributes listed in this subsection. Note that updating an attribute on :attr:`!__spec__` will not update the corresponding attribute on the module itself:
pt_br: Com exceção de :attr:`~module.__name__`, é **fortemente** recomendado que você confie no :attr:`~module.__spec__` e seus atributos em vez de qualquer um dos outros atributos individuais listados nesta subseção. Observe que atualizar um atributo em :attr:`!__spec__` não atualizará o atributo correspondente no próprio módulo:

source: The name used to uniquely identify the module in the import system. For a directly executed module, this will be set to ``"__main__"``.
pt_br: O nome usado para identificar exclusivamente o módulo no sistema de importação. Para um módulo executado diretamente, isso será definido como ``"__main__"``.

source: This attribute must be set to the fully qualified name of the module. It is expected to match the value of :attr:`module.__spec__.name <importlib.machinery.ModuleSpec.name>`.
pt_br: Este atributo deve ser definido como o nome totalmente qualificado do módulo. Espera-se que ele corresponda ao valor de :attr:`module.__spec__.name <importlib.machinery.ModuleSpec.name>`.

source: A record of the module's import-system-related state.
pt_br: Um registro do estado relacionado ao sistema de importação do módulo.

source: Set to the :class:`module spec <importlib.machinery.ModuleSpec>` that was used when importing the module. See :ref:`module-specs` for more details.
pt_br: Define com :class:`spec de módulo <importlib.machinery.ModuleSpec>` que foi usado ao importar o módulo. Veja :ref:`module-specs` para mais detalhes.

source: The :term:`package` a module belongs to.
pt_br: O :term:`pacote` ao qual um módulo pertence.

source: If the module is top-level (that is, not a part of any specific package) then the attribute should be set to ``''`` (the empty string). Otherwise, it should be set to the name of the module's package (which can be equal to :attr:`module.__name__` if the module itself is a package). See :pep:`366` for further details.
pt_br: Se o módulo for de nível superior (ou seja, não fizer parte de nenhum pacote específico), o atributo deve ser definido como ``''`` (a string vazia). Caso contrário, deve ser definido como o nome do pacote do módulo (que pode ser igual a :attr:`module.__name__` se o módulo em si for um pacote). Veja :pep:`366` para mais detalhes.

source: This attribute is used instead of :attr:`~module.__name__` to calculate explicit relative imports for main modules. It defaults to ``None`` for modules created dynamically using the :class:`types.ModuleType` constructor; use :func:`importlib.util.module_from_spec` instead to ensure the attribute is set to a :class:`str`.
pt_br: Este atributo é usado em vez de :attr:`~module.__name__` para calcular importações relativas explícitas para módulos principais. O padrão é ``None`` para módulos criados dinamicamente usando o construtor :class:`types.ModuleType`; use :func:`importlib.util.module_from_spec` em vez disso para garantir que o atributo seja definido como :class:`str`.

source: It is **strongly** recommended that you use :attr:`module.__spec__.parent <importlib.machinery.ModuleSpec.parent>` instead of :attr:`!module.__package__`. :attr:`__package__` is now only used as a fallback if :attr:`!__spec__.parent` is not set, and this fallback path is deprecated.
pt_br: É **fortemente** recomendado que você use :attr:`module.__spec__.parent <importlib.machinery.ModuleSpec.parent>` em vez de :attr:`!module.__package__`. :attr:`__package__` agora só é usado como fallback se :attr:`!__spec__.parent` não estiver definido, e esse caminho de fallback está descontinuado.

source: This attribute now defaults to ``None`` for modules created dynamically using the :class:`types.ModuleType` constructor. Previously the attribute was optional.
pt_br: Este atributo agora presume o padrão ``None`` para módulos criados dinamicamente usando o construtor :class:`types.ModuleType`. Anteriormente, o atributo era opcional.

source: The value of :attr:`!__package__` is expected to be the same as :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>`. :attr:`__package__` is now only used as a fallback during import resolution if :attr:`!__spec__.parent` is not defined.
pt_br: Espera-se que o valor de :attr:`!__package__` seja o mesmo que :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>`. :attr:`__package__` agora é usado apenas como fallback durante a resolução de importação se :attr:`!__spec__.parent` não estiver definido.

source: :exc:`ImportWarning` is raised if an import resolution falls back to :attr:`!__package__` instead of :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>`.
pt_br: :exc:`ImportWarning` é levantada se uma resolução de importação retorna para :attr:`!__package__` em vez de :attr:`__spec__.parent <importlib.machinery.ModuleSpec.parent>`.

source: Raise :exc:`DeprecationWarning` instead of :exc:`ImportWarning` when falling back to :attr:`!__package__` during import resolution.
pt_br: Levanta :exc:`DeprecationWarning` em vez de :exc:`ImportWarning` ao retornar para :attr:`!__package__` durante a resolução de importação.

source: :attr:`!__package__` will cease to be set or taken into consideration by the import system or standard library.
pt_br: :attr:`!__package__` deixará de ser definido ou levado em consideração pelo sistema de importação ou biblioteca padrão.

source: The :term:`loader` object that the import machinery used to load the module.
pt_br: O objeto :term:`carregador` que o maquinário de importação usou para carregar o módulo.

source: This attribute is mostly useful for introspection, but can be used for additional loader-specific functionality, for example getting data associated with a loader.
pt_br: Este atributo é útil principalmente para introspecção, mas pode ser usado para funcionalidades adicionais específicas do carregador, por exemplo, para obter dados associados a um carregador.

source: :attr:`!__loader__` defaults to ``None`` for modules created dynamically using the :class:`types.ModuleType` constructor; use :func:`importlib.util.module_from_spec` instead to ensure the attribute is set to a :term:`loader` object.
pt_br: :attr:`!__loader__` assume como padrão ``None`` para módulos criados dinamicamente usando o construtor :class:`types.ModuleType`; use :func:`importlib.util.module_from_spec` para garantir que o atributo seja definido como um objeto :term:`carregador`.

source: It is **strongly** recommended that you use :attr:`module.__spec__.loader <importlib.machinery.ModuleSpec.loader>` instead of :attr:`!module.__loader__`.
pt_br: É **fortemetne** recomendado que você use :attr:`module.__spec__.loader <importlib.machinery.ModuleSpec.loader>` em vez de :attr:`!module.__loader__`.

source: Setting :attr:`!__loader__` on a module while failing to set :attr:`!__spec__.loader` is deprecated. In Python 3.16, :attr:`!__loader__` will cease to be set or taken into consideration by the import system or the standard library.
pt_br: A definição :attr:`!__loader__` em um módulo enquanto falha na definição de :attr:`!__spec__.loader` está descontinuado. No Python 3.16, :attr:`!__loader__` deixará de ser definido ou levado em consideração pelo sistema de importação ou pela biblioteca padrão.

source: A (possibly empty) :term:`sequence` of strings enumerating the locations where the package's submodules will be found. Non-package modules should not have a :attr:`!__path__` attribute. See :ref:`package-path-rules` for more details.
pt_br: Uma :term:`sequência` (possivelmente vazia) de strings enumerando os locais onde os submódulos do pacote serão encontrados. Módulos que não sejam de pacote não devem ter um atributo :attr:`!__path__`. Veja :ref:`package-path-rules` para mais detalhes.

source: It is **strongly** recommended that you use :attr:`module.__spec__.submodule_search_locations <importlib.machinery.ModuleSpec.submodule_search_locations>` instead of :attr:`!module.__path__`.
pt_br: É **fortemente** recomendado que você use :attr:`module.__spec__.submodule_search_locations <importlib.machinery.ModuleSpec.submodule_search_locations>` em vez de :attr:`!module.__path__`.

source: :attr:`!__file__` and :attr:`!__cached__` are both optional attributes that may or may not be set. Both attributes should be a :class:`str` when they are available.
pt_br: :attr:`!__file__` e :attr:`!__cached__` são atributos opcionais que podem ou não ser definidos. Ambos os atributos devem ser um :class:`str` quando estiverem disponíveis.

source: :attr:`!__file__` indicates the pathname of the file from which the module was loaded (if loaded from a file), or the pathname of the shared library file for extension modules loaded dynamically from a shared library. It might be missing for certain types of modules, such as C modules that are statically linked into the interpreter, and the :ref:`import system <importsystem>` may opt to leave it unset if it has no semantic meaning (for example, a module loaded from a database).
pt_br: :attr:`!__file__` indica o nome do caminho do arquivo do qual o módulo foi carregado (se carregado de um arquivo) ou o nome do caminho do arquivo da biblioteca compartilhada para módulos de extensão carregados dinamicamente de uma biblioteca compartilhada. Pode estar faltando para certos tipos de módulos, como módulos C que estão estaticamente vinculados ao interpretador, e o :ref:`sistema de importação <importsystem>` pode optar por deixá-lo sem definição se não tiver significado semântico (por exemplo, um módulo carregado de um banco de dados).

source: If :attr:`!__file__` is set then the :attr:`!__cached__` attribute might also be set, which is the path to any compiled version of the code (for example, a byte-compiled file). The file does not need to exist to set this attribute; the path can simply point to where the compiled file *would* exist (see :pep:`3147`).
pt_br: Se :attr:`!__file__` estiver definido então o atributo :attr:`!__cached__` também pode ser definido, que é o caminho para qualquer versão compilada do código (por exemplo, um arquivo compilado por byte). O arquivo não precisa existir para configurar esse atributo; o caminho pode simplesmente apontar para onde o arquivo compilado existiria (veja :pep:`3147`).

source: Note that :attr:`!__cached__` may be set even if :attr:`!__file__` is not set. However, that scenario is quite atypical. Ultimately, the :term:`loader` is what makes use of the module spec provided by the :term:`finder` (from which :attr:`!__file__` and :attr:`!__cached__` are derived). So if a loader can load from a cached module but otherwise does not load from a file, that atypical scenario may be appropriate.
pt_br: Observe que :attr:`!__cached__` pode ser definido mesmo se :attr:`!__file__` não estiver definido. No entanto, esse cenário é bastante atípico. Em última análise, o :term:`carregador` é o que faz uso do spec de módulo fornecido pelo :term:`localizador` (do qual :attr:`!__file__` e :attr:`!__cached__` são derivados). Portanto, se um carregador puder carregar a partir de um módulo em cache, mas não carregar a partir de um arquivo, esse cenário atípico poderá ser apropriado.

source: It is **strongly** recommended that you use :attr:`module.__spec__.cached <importlib.machinery.ModuleSpec.cached>` instead of :attr:`!module.__cached__`.
pt_br: É **fortemente** recomendado que você use :attr:`module.__spec__.cached <importlib.machinery.ModuleSpec.cached>` em vez de :attr:`!module.__cached__`.

source: Setting :attr:`!__cached__` on a module while failing to set :attr:`!__spec__.cached` is deprecated. In Python 3.15, :attr:`!__cached__` will cease to be set or taken into consideration by the import system or standard library.
pt_br: A definição :attr:`!__cached__` em um módulo enquanto falha na definição de :attr:`!__spec__.cached` está descontinuado. No Python 3.15, :attr:`!__cached__` deixará de ser definido ou levado em consideração pelo sistema de importação ou pela biblioteca padrão.

source: Other writable attributes on module objects
pt_br: Outros atributos graváveis em objetos de módulo

source: As well as the import-related attributes listed above, module objects also have the following writable attributes:
pt_br: Além dos atributos relacionados à importação listados acima, os objetos de módulo também têm os seguintes atributos graváveis:

source: The module's documentation string, or ``None`` if unavailable. See also: :attr:`__doc__ attributes <definition.__doc__>`.
pt_br: A string de documentação do módulo, ou ``None`` se indisponível. Veja também: :attr:`atributos __doc__ <definition.__doc__>`.

source: A dictionary containing :term:`variable annotations <variable annotation>` collected during module body execution. For best practices on working with :attr:`__annotations__`, please see :ref:`annotations-howto`.
pt_br: Um dicionário contendo :term:`anotações de variável <variable annotation>` coletadas durante a execução do corpo do módulo. Para as melhores práticas sobre como trabalhar com :attr:`__annotations__`, por favor veja :ref:`annotations-howto`.

source: Module dictionaries
pt_br: Dicionários do módulo

source: Module objects also have the following special read-only attribute:
pt_br: Os objetos de módulo também têm o seguinte atributo especial somente leitura:

source: The module's namespace as a dictionary object. Uniquely among the attributes listed here, :attr:`!__dict__` cannot be accessed as a global variable from within a module; it can only be accessed as an attribute on module objects.
pt_br: O espaço de nomes do módulo como um objeto dicionário. Exclusivamente entre os atributos listados aqui, :attr:`!__dict__` não pode ser acessado como uma variável global de dentro de um módulo; ele só pode ser acessado como um atributo em objetos de módulo.
