Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: Called when the instance is about to be destroyed. This is also called a finalizer or (improperly) a destructor. If a base class has a :meth:`__del__` method, the derived class's :meth:`__del__` method, if any, must explicitly call it to ensure proper deletion of the base class part of the instance.
pt_br: Chamado quando a instância está prestes a ser destruída. Também é chamada de finalizador ou (incorretamente) de destruidor. Se uma classe base tem um método :meth:`__del__`, o método :meth:`__del__` da classe derivada, se houver, deve chamá-lo explicitamente para garantir a exclusão adequada da parte da classe base da instância.

source: It is possible (though not recommended!) for the :meth:`__del__` method to postpone destruction of the instance by creating a new reference to it. This is called object *resurrection*. It is implementation-dependent whether :meth:`__del__` is called a second time when a resurrected object is about to be destroyed; the current :term:`CPython` implementation only calls it once.
pt_br: É possível (embora não recomendado!) para o método :meth:`__del__` adiar a destruição da instância criando uma nova referência a ela. Isso é chamado de *ressurreição* de objeto. Depende se a implementação de :meth:`__del__` é chamado uma segunda vez quando um objeto ressuscitado está prestes a ser destruído; a implementação atual do :term:`CPython` chama-o apenas uma vez.

source: It is not guaranteed that :meth:`__del__` methods are called for objects that still exist when the interpreter exits. :class:`weakref.finalize` provides a straightforward way to register a cleanup function to be called when an object is garbage collected.
pt_br: Não há garantia de que os métodos :meth:`__del__` sejam chamados para objetos que ainda existem quando o interpretador sai. :class:`weakref.finalize` fornece uma maneira direta de registrar uma função de limpeza a ser chamada quando um objeto é coletado como lixo.

source: ``del x`` doesn't directly call ``x.__del__()`` --- the former decrements the reference count for ``x`` by one, and the latter is only called when ``x``'s reference count reaches zero.
pt_br: ``del x`` não chama diretamente ``x.__del__()`` -- o primeiro diminui a contagem de referências para ``x`` em um, e o segundo só é chamado quando a contagem de referências de ``x`` atinge zero.

source: It is possible for a reference cycle to prevent the reference count of an object from going to zero. In this case, the cycle will be later detected and deleted by the :term:`cyclic garbage collector <garbage collection>`. A common cause of reference cycles is when an exception has been caught in a local variable. The frame's locals then reference the exception, which references its own traceback, which references the locals of all frames caught in the traceback.
pt_br: É possível que um ciclo de referência impeça que a contagem de referência de um objeto chegue a zero. Neste caso, mais tarde, o ciclo será detectado e deletado pelo :term:`coletor de lixo cíclico <garbage collection>`. Uma causa comum de referências cíclicas é quando uma exceção foi capturada em uma variável local. O locals do quadro então referencia a exceção, que referencia seu próprio traceback, que referencia o locals de todos os quadros capturados no traceback.

source: Documentation for the :mod:`gc` module.
pt_br: Documentação do módulo :mod:`gc`.

source: Due to the precarious circumstances under which :meth:`__del__` methods are invoked, exceptions that occur during their execution are ignored, and a warning is printed to ``sys.stderr`` instead. In particular:
pt_br: Devido às circunstâncias precárias sob as quais os métodos :meth:`__del__` são invocados, as exceções que ocorrem durante sua execução são ignoradas e um aviso é impresso em ``sys.stderr`` em seu lugar. Em particular:

source: :meth:`__del__` can be invoked when arbitrary code is being executed, including from any arbitrary thread. If :meth:`__del__` needs to take a lock or invoke any other blocking resource, it may deadlock as the resource may already be taken by the code that gets interrupted to execute :meth:`__del__`.
pt_br: :meth:`__del__` pode ser chamado quando um código arbitrário está sendo executado, incluindo de qualquer thread arbitrária. Se :meth:`__del__` precisa bloquear ou invocar qualquer outro recurso de bloqueio, pode ocorrer um impasse, pois o recurso já pode ter sido levado pelo código que é interrompido para executar :meth:`__del__`.

source: :meth:`__del__` can be executed during interpreter shutdown. As a consequence, the global variables it needs to access (including other modules) may already have been deleted or set to ``None``. Python guarantees that globals whose name begins with a single underscore are deleted from their module before other globals are deleted; if no other references to such globals exist, this may help in assuring that imported modules are still available at the time when the :meth:`__del__` method is called.
pt_br: :meth:`__del__` pode ser executado durante o encerramento do interpretador. Como consequência, as variáveis globais que ele precisa acessar (incluindo outros módulos) podem já ter sido excluídas ou definidas como ``None``. Python garante que os globais cujo nome comece com um único sublinhado sejam excluídos de seu módulo antes que outros globais sejam excluídos; se nenhuma outra referência a tais globais existir, isso pode ajudar a garantir que os módulos importados ainda estejam disponíveis no momento em que o método :meth:`__del__` for chamado.

source: Called by the :func:`repr` built-in function to compute the "official" string representation of an object. If at all possible, this should look like a valid Python expression that could be used to recreate an object with the same value (given an appropriate environment). If this is not possible, a string of the form ``<...some useful description...>`` should be returned. The return value must be a string object. If a class defines :meth:`__repr__` but not :meth:`__str__`, then :meth:`__repr__` is also used when an "informal" string representation of instances of that class is required.
pt_br: Chamado pela função embutida :func:`repr` para calcular a representação da string "oficial" de um objeto. Se possível, isso deve parecer uma expressão Python válida que pode ser usada para recriar um objeto com o mesmo valor (dado um ambiente apropriado). Se isso não for possível, uma string no formato ``<...alguma descrição útil...>`` deve ser retornada. O valor de retorno deve ser um objeto string. Se uma classe define :meth:`__repr__`, mas não :meth:`__str__`, então :meth:`__repr__` também é usado quando uma representação de string "informal" de instâncias daquela classe é necessária.

source: This is typically used for debugging, so it is important that the representation is information-rich and unambiguous. A default implementation is provided by the :class:`object` class itself.
pt_br: Isso é normalmente usado para depuração, portanto, é importante que a representação seja rica em informações e inequívoca. Uma implementação padrão é fornecida pela própria classe :class:`object`.

source: Called by :func:`str(object) <str>`, the default :meth:`__format__` implementation, and the built-in function :func:`print`, to compute the "informal" or nicely printable string representation of an object. The return value must be a :ref:`str <textseq>` object.
pt_br: Chamado por :func:`str(object) <str>`, a implementação padrão de :meth:`__format__`, e as funções embutidas :func:`print`, para calcular a representação da string "informal" ou agradável para exibição de um objeto. O valor de retorno deve ser um objeto :ref:`str <textseq>`.

source: This method differs from :meth:`object.__repr__` in that there is no expectation that :meth:`__str__` return a valid Python expression: a more convenient or concise representation can be used.
pt_br: Este método difere de :meth:`object.__repr__` por não haver expectativa de que :meth:`__str__` retorne uma expressão Python válida: uma representação mais conveniente ou concisa pode ser usada.

source: The default implementation defined by the built-in type :class:`object` calls :meth:`object.__repr__`.
pt_br: A implementação padrão definida pelo tipo embutido :class:`object` chama :meth:`object.__repr__`.

source: Called by :ref:`bytes <func-bytes>` to compute a byte-string representation of an object. This should return a :class:`bytes` object. The :class:`object` class itself does not provide this method.
pt_br: Chamado por :ref:`bytes <func-bytes>` para calcular uma representação de string de bytes de um objeto. Isso deve retornar um objeto :class:`bytes`. A classe :class:`object` em si não fornece este método.

source: Called by the :func:`format` built-in function, and by extension, evaluation of :ref:`formatted string literals <f-strings>` and the :meth:`str.format` method, to produce a "formatted" string representation of an object. The *format_spec* argument is a string that contains a description of the formatting options desired. The interpretation of the *format_spec* argument is up to the type implementing :meth:`__format__`, however most classes will either delegate formatting to one of the built-in types, or use a similar formatting option syntax.
pt_br: Chamado pela função embutida :func:`format` e, por extensão, avaliação de :ref:`literais de string formatadas <f-strings>` e o método :meth:`str.format`, para produzir uma representação de string "formatada" de um objeto. O argumento *format_spec* é uma string que contém uma descrição das opções de formatação desejadas. A interpretação do argumento *format_spec* depende do tipo que implementa :meth:`__format__`, entretanto a maioria das classes delegará a formatação a um dos tipos embutidos ou usará uma sintaxe de opção de formatação semelhante.

source: See :ref:`formatspec` for a description of the standard formatting syntax.
pt_br: Consulte :ref:`formatspec` para uma descrição da sintaxe de formatação padrão.

source: The return value must be a string object.
pt_br: O valor de retorno deve ser um objeto string.

source: The default implementation by the :class:`object` class should be given an empty *format_spec* string. It delegates to :meth:`__str__`.
pt_br: A implementação padrão pela classe :class:`object` deve receber uma string *format_spec* vazia. Ela delega para :meth:`__str__`.

source: The __format__ method of ``object`` itself raises a :exc:`TypeError` if passed any non-empty string.
pt_br: O método __format__ do próprio ``object`` levanta uma :exc:`TypeError` se passada qualquer string não vazia.

source: ``object.__format__(x, '')`` is now equivalent to ``str(x)`` rather than ``format(str(x), '')``.
pt_br: ``object.__format__(x, '')`` é agora equivalente a ``str(x)`` em vez de ``format(str(x), '')``.

source: These are the so-called "rich comparison" methods. The correspondence between operator symbols and method names is as follows: ``x<y`` calls ``x.__lt__(y)``, ``x<=y`` calls ``x.__le__(y)``, ``x==y`` calls ``x.__eq__(y)``, ``x!=y`` calls ``x.__ne__(y)``, ``x>y`` calls ``x.__gt__(y)``, and ``x>=y`` calls ``x.__ge__(y)``.
pt_br: Esses são os chamados métodos de "comparação rica". A correspondência entre os símbolos do operador e os nomes dos métodos é a seguinte: ``x<y`` chama ``x.__lt__(y)``, ``x<=y`` chama ``x.__le__(y)``, ``x==y`` chama ``x.__eq__(y)``, ``x!=y`` chama ``x.__ne__(y)``, ``x>y`` chama ``x.__gt__(y)`` e ``x>=y`` chama ``x.__ge__(y)``.

source: A rich comparison method may return the singleton :data:`NotImplemented` if it does not implement the operation for a given pair of arguments. By convention, ``False`` and ``True`` are returned for a successful comparison. However, these methods can return any value, so if the comparison operator is used in a Boolean context (e.g., in the condition of an ``if`` statement), Python will call :func:`bool` on the value to determine if the result is true or false.
pt_br: Um método de comparação rica pode retornar o singleton :data:`NotImplemented` se não implementar a operação para um determinado par de argumentos. Por convenção, ``False`` e ``True`` são retornados para uma comparação bem-sucedida. No entanto, esses métodos podem retornar qualquer valor, portanto, se o operador de comparação for usado em um contexto booleano (por exemplo, na condição de uma instrução ``if``), Python irá chamar :func:`bool` no valor para determinar se o resultado for verdadeiro ou falso.

source: By default, ``object`` implements :meth:`__eq__` by using ``is``, returning :data:`NotImplemented` in the case of a false comparison: ``True if x is y else NotImplemented``. For :meth:`__ne__`, by default it delegates to :meth:`__eq__` and inverts the result unless it is :data:`!NotImplemented`. There are no other implied relationships among the comparison operators or default implementations; for example, the truth of ``(x<y or x==y)`` does not imply ``x<=y``. To automatically generate ordering operations from a single root operation, see :func:`functools.total_ordering`.
pt_br: Por padrão, ``object`` implementa :meth:`__eq__` usando ``is``, retornando :data:`NotImplemented` no caso de uma comparação falsa: ``True if x is y else NotImplemented``. Para :meth:`__ne__`, por padrão ele delega para :meth:`__eq__` e inverte o resultado a menos que seja :data:`!NotImplemented`. Não há outras relações implícitas entre os operadores de comparação ou implementações padrão; por exemplo, o valor verdadeiro de ``(x<y or x==y)`` não implica ``x<=y``. Para gerar operações de ordenação automaticamente a partir de uma única operação raiz, consulte :func:`functools.total_ordering`.

source: By default, the :class:`object` class provides implementations consistent with :ref:`expressions-value-comparisons`: equality compares according to object identity, and order comparisons raise :exc:`TypeError`. Each default method may generate these results directly, but may also return :data:`NotImplemented`.
pt_br: Por padrão, a classe :class:`object` fornece implementações consistentes com :ref:`expressions-value-comparisons`: igualdade compara de acordo com a identidade do objeto, e comparações de ordem levantam :exc:`TypeError`. Cada método padrão pode gerar esses resultados diretamente, mas também pode retornar :data:`NotImplemented`.

source: See the paragraph on :meth:`__hash__` for some important notes on creating :term:`hashable` objects which support custom comparison operations and are usable as dictionary keys.
pt_br: Veja o parágrafo sobre :meth:`__hash__` para algumas notas importantes sobre a criação de objetos :term:`hasheáveis <hashable>` que implementam operações de comparação personalizadas e são utilizáveis como chaves de dicionário.

source: There are no swapped-argument versions of these methods (to be used when the left argument does not support the operation but the right argument does); rather, :meth:`__lt__` and :meth:`__gt__` are each other's reflection, :meth:`__le__` and :meth:`__ge__` are each other's reflection, and :meth:`__eq__` and :meth:`__ne__` are their own reflection. If the operands are of different types, and the right operand's type is a direct or indirect subclass of the left operand's type, the reflected method of the right operand has priority, otherwise the left operand's method has priority. Virtual subclassing is not considered.
pt_br: Não há versões de argumentos trocados desses métodos (a serem usados quando o argumento esquerdo não tem suporte à operação, mas o argumento direito sim); em vez disso, :meth:`__lt__` e :meth:`__gt__` são o reflexo um do outro, :meth:`__le__` e :meth:`__ge__` são o reflexo um do outro, e :meth:`__eq__` e :meth:`__ne__` são seu próprio reflexo. Se os operandos são de tipos diferentes e o tipo do operando direito é uma subclasse direta ou indireta do tipo do operando esquerdo, o método refletido do operando direito tem prioridade, caso contrário, o método do operando esquerdo tem prioridade. Subclasse virtual não é considerada.

source: When no appropriate method returns any value other than :data:`NotImplemented`, the ``==`` and ``!=`` operators will fall back to ``is`` and ``is not``, respectively.
pt_br: Quando nenhum método apropriado retorna qualquer valor diferente de :data:`NotImplemented`, os operadores ``==`` e ``!=`` retornarão para ``is`` e ``is not``, respectivamente.

source: Called by built-in function :func:`hash` and for operations on members of hashed collections including :class:`set`, :class:`frozenset`, and :class:`dict`. The ``__hash__()`` method should return an integer. The only required property is that objects which compare equal have the same hash value; it is advised to mix together the hash values of the components of the object that also play a part in comparison of objects by packing them into a tuple and hashing the tuple. Example::
pt_br: Chamado pela função embutida :func:`hash` e para operações em membros de coleções com hash incluindo :class:`set`, :class:`frozenset` e :class:`dict`. O método ``__hash__()`` deve retornar um inteiro. A única propriedade necessária é que os objetos que são comparados iguais tenham o mesmo valor de hash; é aconselhável misturar os valores hash dos componentes do objeto que também desempenham um papel na comparação dos objetos, empacotando-os em uma tupla e fazendo o hash da tupla. Exemplo::

source: :func:`hash` truncates the value returned from an object's custom :meth:`__hash__` method to the size of a :c:type:`Py_ssize_t`. This is typically 8 bytes on 64-bit builds and 4 bytes on 32-bit builds. If an object's :meth:`__hash__` must interoperate on builds of different bit sizes, be sure to check the width on all supported builds. An easy way to do this is with ``python -c "import sys; print(sys.hash_info.width)"``.
pt_br: :func:`hash` trunca o valor retornado do método :meth:`__hash__` personalizado de um objeto para o tamanho de um :c:type:`Py_ssize_t`. Isso é normalmente 8 bytes em compilações de 64 bits e 4 bytes em compilações de 32 bits. Se o :meth:`__hash__` de um objeto deve interoperar em compilações de tamanhos de bits diferentes, certifique-se de verificar a largura em todas as compilações com suporte. Uma maneira fácil de fazer isso é com ``python -c "import sys; print(sys.hash_info.width)"``.

source: If a class does not define an :meth:`__eq__` method it should not define a :meth:`__hash__` operation either; if it defines :meth:`__eq__` but not :meth:`__hash__`, its instances will not be usable as items in hashable collections. If a class defines mutable objects and implements an :meth:`__eq__` method, it should not implement :meth:`__hash__`, since the implementation of :term:`hashable` collections requires that a key's hash value is immutable (if the object's hash value changes, it will be in the wrong hash bucket).
pt_br: Se uma classe não define um método :meth:`__eq__`, ela também não deve definir uma operação :meth:`__hash__`; se define :meth:`__eq__` mas não :meth:`__hash__`, suas instâncias não serão utilizáveis como itens em coleções hasheáveis. Se uma classe define objetos mutáveis e implementa um método :meth:`__eq__`, ela não deve implementar :meth:`__hash__`, uma vez que a implementação de coleções :term:`hasheáveis <hashable>` requer que o valor hash de uma chave seja imutável (se o valor hash do objeto mudar, estará no balde de hash errado).

source: User-defined classes have :meth:`__eq__` and :meth:`__hash__` methods by default (inherited from the :class:`object` class); with them, all objects compare unequal (except with themselves) and ``x.__hash__()`` returns an appropriate value such that ``x == y`` implies both that ``x is y`` and ``hash(x) == hash(y)``.
pt_br: As classes definidas pelo usuário têm os métodos :meth:`__eq__` e :meth:`__hash__` por padrão (herdados da classe :class:`object`); com eles, todos os objetos se comparam desiguais (exceto com eles mesmos) e ``x.__hash__()`` retorna um valor apropriado tal que ``x == y`` implica que ``x is y`` e ``hash(x) == hash(y)``.

source: A class that overrides :meth:`__eq__` and does not define :meth:`__hash__` will have its :meth:`__hash__` implicitly set to ``None``. When the :meth:`__hash__` method of a class is ``None``, instances of the class will raise an appropriate :exc:`TypeError` when a program attempts to retrieve their hash value, and will also be correctly identified as unhashable when checking ``isinstance(obj, collections.abc.Hashable)``.
pt_br: Uma classe que sobrescreve :meth:`__eq__` e não define :meth:`__hash__` terá seu :meth:`__hash__` implicitamente definido como ``None``. Quando o método :meth:`__hash__` de uma classe é ``None``, as instâncias da classe levantam uma :exc:`TypeError` apropriada quando um programa tenta recuperar seu valor hash, e também será identificado corretamente como não-hasheável ao verificar ``isinstance(obj, collections.abc.Hashable)``.

source: If a class that overrides :meth:`__eq__` needs to retain the implementation of :meth:`__hash__` from a parent class, the interpreter must be told this explicitly by setting ``__hash__ = <ParentClass>.__hash__``.
pt_br: Se uma classe que substitui :meth:`__eq__` precisa manter a implementação de :meth:`__hash__` de uma classe base, o interpretador deve ser informado disso explicitamente pela configuração ``__hash__ = <ClasseBase>.__hash__``.

source: If a class that does not override :meth:`__eq__` wishes to suppress hash support, it should include ``__hash__ = None`` in the class definition. A class which defines its own :meth:`__hash__` that explicitly raises a :exc:`TypeError` would be incorrectly identified as hashable by an ``isinstance(obj, collections.abc.Hashable)`` call.
pt_br: Se uma classe que não substitui :meth:`__eq__` deseja suprimir o suporte a hash, deve incluir ``__hash__ = None`` na definição de classe. Uma classe que define seu próprio :meth:`__hash__` que levanta explicitamente uma :exc:`TypeError` seria incorretamente identificada como hasheável por uma chamada ``isinstance(obj, collections.abc.Hashable)``.

source: By default, the :meth:`__hash__` values of str and bytes objects are "salted" with an unpredictable random value. Although they remain constant within an individual Python process, they are not predictable between repeated invocations of Python.
pt_br: Por padrão, os valores :meth:`__hash__` dos objetos str e bytes são "salgados" com um valor aleatório imprevisível. Embora permaneçam constantes em um processo individual do Python, eles não são previsíveis entre invocações repetidas do Python.

source: This is intended to provide protection against a denial-of-service caused by carefully chosen inputs that exploit the worst case performance of a dict insertion, *O*\ (*n*\ :sup:`2`) complexity. See http://ocert.org/advisories/ocert-2011-003.html for details.
pt_br: Isso se destina a fornecer proteção contra uma negação de serviço causada por entradas cuidadosamente escolhidas que exploram o pior caso de desempenho de uma inserção de dicionário, complexidade *O*\ (*n*\ :sup:`2`). Consulte http://ocert.org/advisories/ocert-2011-003.html para obter detalhes.

source: Changing hash values affects the iteration order of sets. Python has never made guarantees about this ordering (and it typically varies between 32-bit and 64-bit builds).
pt_br: Alterar os valores de hash afeta a ordem de iteração dos conjuntos. Python nunca deu garantias sobre essa ordem (e normalmente varia entre compilações de 32 e 64 bits).

source: See also :envvar:`PYTHONHASHSEED`.
pt_br: Consulte também :envvar:`PYTHONHASHSEED`.

source: Hash randomization is enabled by default.
pt_br: Aleatorização de hash está habilitada por padrão.
