Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: The following methods are used to override the default behavior of the :func:`isinstance` and :func:`issubclass` built-in functions.
pt_br: Os seguintes métodos são usados para substituir o comportamento padrão das funções embutidas :func:`isinstance` e :func:`issubclass`.

source: In particular, the metaclass :class:`abc.ABCMeta` implements these methods in order to allow the addition of Abstract Base Classes (ABCs) as "virtual base classes" to any class or type (including built-in types), including other ABCs.
pt_br: Em particular, a metaclasse :class:`abc.ABCMeta` implementa esses métodos a fim de permitir a adição de classes base abstratas (ABCs) como "classes base virtuais" para qualquer classe ou tipo (incluindo tipos embutidos), incluindo outras ABCs.

source: Return true if *instance* should be considered a (direct or indirect) instance of *class*. If defined, called to implement ``isinstance(instance, class)``.
pt_br: Retorna verdadeiro se *instance* deve ser considerada uma instância (direta ou indireta) da classe *class*. Se definido, chamado para implementar ``isinstance(instance, class)``.

source: Return true if *subclass* should be considered a (direct or indirect) subclass of *class*. If defined, called to implement ``issubclass(subclass, class)``.
pt_br: Retorna verdadeiro se *subclass* deve ser considerada uma subclasse (direta ou indireta) da classe *class*. Se definido, chamado para implementar ``issubclass(subclass, class)``.

source: Note that these methods are looked up on the type (metaclass) of a class. They cannot be defined as class methods in the actual class. This is consistent with the lookup of special methods that are called on instances, only in this case the instance is itself a class.
pt_br: Observe que esses métodos são pesquisados no tipo (metaclasse) de uma classe. Eles não podem ser definidos como métodos de classe na classe real. Isso é consistente com a pesquisa de métodos especiais que são chamados em instâncias, apenas neste caso a própria instância é uma classe.

source: :pep:`3119` - Introducing Abstract Base Classes
pt_br: :pep:`3119` - Introduzindo classes base abstratas

source: Includes the specification for customizing :func:`isinstance` and :func:`issubclass` behavior through :meth:`~type.__instancecheck__` and :meth:`~type.__subclasscheck__`, with motivation for this functionality in the context of adding Abstract Base Classes (see the :mod:`abc` module) to the language.
pt_br: Inclui a especificação para personalizar o comportamento de :func:`isinstance` e :func:`issubclass` através de :meth:`~type.__instancecheck__` e :meth:`~type.__subclasscheck__`, com motivação para esta funcionalidade no contexto da adição de classes base abstratas (veja o módulo :mod:`abc`) para a linguagem.

source: Emulating generic types
pt_br: Emulando tipos genéricos

source: When using :term:`type annotations<annotation>`, it is often useful to *parameterize* a :term:`generic type` using Python's square-brackets notation. For example, the annotation ``list[int]`` might be used to signify a :class:`list` in which all the elements are of type :class:`int`.
pt_br: Quando estiver usando :term:`anotações de tipo <annotation>`, é frequentemente útil *parametrizar* um :term:`tipo genérico` usando a notação de colchetes do Python. Por exemplo, a anotação ``list[int]`` pode ser usada para indicar uma :class:`list` em que todos os seus elementos são do tipo :class:`int`.

source: :pep:`484` - Type Hints
pt_br: :pep:`484` - Dicas de tipo

source: Introducing Python's framework for type annotations
pt_br: Apresenta a estrutura do Python para anotações de tipo

source: :ref:`Generic Alias Types<types-genericalias>`
pt_br: :ref:`Tipos Generic Alias <types-genericalias>`

source: Documentation for objects representing parameterized generic classes
pt_br: Documentação de objetos que representam classes genéricas parametrizadas

source: :ref:`Generics`, :ref:`user-defined generics<user-defined-generics>` and :class:`typing.Generic`
pt_br: :ref:`Generics`, :ref:`genéricos definidos pelo usuário<user-defined-generics>` e :class:`typing.Generic`

source: Documentation on how to implement generic classes that can be parameterized at runtime and understood by static type-checkers.
pt_br: Documentação sobre como implementar classes genéricas que podem ser parametrizadas em tempo de execução e compreendidas por verificadores de tipo estático.

source: A class can *generally* only be parameterized if it defines the special class method ``__class_getitem__()``.
pt_br: Uma classe pode *geralmente* ser parametrizada somente se ela define o método de classe especial ``__class_getitem__()``.

source: Return an object representing the specialization of a generic class by type arguments found in *key*.
pt_br: Retorna um objeto que representa a especialização de uma classe genérica por argumentos de tipo encontrados em *key*.

source: When defined on a class, ``__class_getitem__()`` is automatically a class method. As such, there is no need for it to be decorated with :func:`@classmethod<classmethod>` when it is defined.
pt_br: Quando definido em uma classe, ``__class_getitem__()`` é automaticamente um método de classe. Assim, não é necessário que seja decorado com :func:`@classmethod<classmethod>` quando de sua definição.

source: The purpose of *__class_getitem__*
pt_br: O propósito de *__class_getitem__*

source: The purpose of :meth:`~object.__class_getitem__` is to allow runtime parameterization of standard-library generic classes in order to more easily apply :term:`type hints<type hint>` to these classes.
pt_br: O propósito de :meth:`~object.__class_getitem__` é permitir a parametrização em tempo de execução de classes genéricas da biblioteca padrão, a fim de aplicar mais facilmente :term:`dicas de tipo<type hint>` a essas classes.

source: To implement custom generic classes that can be parameterized at runtime and understood by static type-checkers, users should either inherit from a standard library class that already implements :meth:`~object.__class_getitem__`, or inherit from :class:`typing.Generic`, which has its own implementation of ``__class_getitem__()``.
pt_br: Para implementar classes genéricas personalizadas que podem ser parametrizadas em tempo de execução e compreendidas por verificadores de tipo estáticos, os usuários devem herdar de uma classe da biblioteca padrão que já implementa :meth:`~object.__class_getitem__`, ou herdar de :class:`typing.Generic`, que possui sua própria implementação de ``__class_getitem__()``.

source: Custom implementations of :meth:`~object.__class_getitem__` on classes defined outside of the standard library may not be understood by third-party type-checkers such as mypy. Using ``__class_getitem__()`` on any class for purposes other than type hinting is discouraged.
pt_br: Implementações personalizadas de :meth:`~object.__class_getitem__` em classes definidas fora da biblioteca padrão podem não ser compreendidas por verificadores de tipo de terceiros, como o mypy. O uso de ``__class_getitem__()`` em qualquer classe para fins diferentes de dicas de tipo é desencorajado.

source: Usually, the :ref:`subscription<subscriptions>` of an object using square brackets will call the :meth:`~object.__getitem__` instance method defined on the object's class. However, if the object being subscribed is itself a class, the class method :meth:`~object.__class_getitem__` may be called instead. ``__class_getitem__()`` should return a :ref:`GenericAlias<types-genericalias>` object if it is properly defined.
pt_br: Normalmente, a :ref:`subscription<subscriptions>` de um objeto usando colchetes chamará o método de instância :meth:`~object.__getitem__` definido na classe do objeto. No entanto, se o objeto sendo subscrito for ele mesmo uma classe, o método de classe :meth:`~object.__class_getitem__` pode ser chamado em seu lugar. ``__class_getitem__()`` deve retornar um objeto :ref:`GenericAlias<types-genericalias>` se estiver devidamente definido.

source: Presented with the :term:`expression` ``obj[x]``, the Python interpreter follows something like the following process to decide whether :meth:`~object.__getitem__` or :meth:`~object.__class_getitem__` should be called::
pt_br: Apresentado com a :term:`expressão` ``obj[x]``, o interpretador de Python segue algo parecido com o seguinte processo para decidir se :meth:`~object.__getitem__` ou :meth:`~object.__class_getitem__` deve ser chamado:

source: from inspect import isclass def subscribe(obj, x): """Return the result of the expression 'obj[x]'""" class_of_obj = type(obj) # If the class of obj defines __getitem__, # call class_of_obj.__getitem__(obj, x) if hasattr(class_of_obj, '__getitem__'): return class_of_obj.__getitem__(obj, x) # Else, if obj is a class and defines __class_getitem__, # call obj.__class_getitem__(x) elif isclass(obj) and hasattr(obj, '__class_getitem__'): return obj.__class_getitem__(x) # Else, raise an exception else: raise TypeError( f"'{class_of_obj.__name__}' object is not subscriptable" )
pt_br: from inspect import isclass def subscribe(obj, x): """Return the result of the expression 'obj[x]'""" class_of_obj = type(obj) # Se a classe de obj define __getitem__, # chama class_of_obj.__getitem__(obj, x) if hasattr(class_of_obj, '__getitem__'): return class_of_obj.__getitem__(obj, x) # Do contrário, se obj for uma classe e define __class_getitem__, # chama obj.__class_getitem__(x) elif isclass(obj) and hasattr(obj, '__class_getitem__'): return obj.__class_getitem__(x) # Do contrário, levanta uma exceção else: raise TypeError( f"'{class_of_obj.__name__}' object is not subscriptable" )

source: In Python, all classes are themselves instances of other classes. The class of a class is known as that class's :term:`metaclass`, and most classes have the :class:`type` class as their metaclass. :class:`type` does not define :meth:`~object.__getitem__`, meaning that expressions such as ``list[int]``, ``dict[str, float]`` and ``tuple[str, bytes]`` all result in :meth:`~object.__class_getitem__` being called::
pt_br: Em Python, todas as classes são elas mesmas instâncias de outras classes. A classe de uma classe é conhecida como :term:`metaclasse` dessa classe, e a maioria das classes tem a classe :class:`type` como sua metaclasse. :class:`type` não define :meth:`~object.__getitem__`, o que significa que expressões como ``list[int]``, ``dict[str, float]`` e ``tuple[str, bytes]`` resultam em chamadas para :meth:`~object.__class_getitem__`::

source: >>> # list has class "type" as its metaclass, like most classes: >>> type(list) <class 'type'> >>> type(dict) == type(list) == type(tuple) == type(str) == type(bytes) True >>> # "list[int]" calls "list.__class_getitem__(int)" >>> list[int] list[int] >>> # list.__class_getitem__ returns a GenericAlias object: >>> type(list[int]) <class 'types.GenericAlias'>
pt_br: >>> # lista tem a classe "type" como sua metaclasse, como a maioria das classes: >>> type(list) <class 'type'> >>> type(dict) == type(list) == type(tuple) == type(str) == type(bytes) True >>> # "list[int]" chama "list.__class_getitem__(int)" >>> list[int] list[int] >>> # list.__class_getitem__ retorna um objeto GenericAlias: >>> type(list[int]) <class 'types.GenericAlias'>

source: However, if a class has a custom metaclass that defines :meth:`~object.__getitem__`, subscribing the class may result in different behaviour. An example of this can be found in the :mod:`enum` module::
pt_br: No entanto, se uma classe tiver uma metaclasse personalizada que define :meth:`~object.__getitem__`, subscrever a classe pode resultar em comportamento diferente. Um exemplo disso pode ser encontrado no módulo :mod:`enum`::

source: >>> from enum import Enum >>> class Menu(Enum): ... """A breakfast menu""" ... SPAM = 'spam' ... BACON = 'bacon' ... >>> # Enum classes have a custom metaclass: >>> type(Menu) <class 'enum.EnumMeta'> >>> # EnumMeta defines __getitem__, >>> # so __class_getitem__ is not called, >>> # and the result is not a GenericAlias object: >>> Menu['SPAM'] <Menu.SPAM: 'spam'> >>> type(Menu['SPAM']) <enum 'Menu'>
pt_br: >>> from enum import Enum >>> class Menu(Enum): ... """A breakfast menu""" ... SPAM = 'spam' ... BACON = 'bacon' ... >>> # Classes Enum têm uma metaclasses personalizada: >>> type(Menu) <class 'enum.EnumMeta'> >>> # EnumMeta define __getitem__, >>> # de forma que __class_getitem__ não é chamado, >>> # e o resultado não é um objeto GenericAlias: >>> Menu['SPAM'] <Menu.SPAM: 'spam'> >>> type(Menu['SPAM']) <enum 'Menu'>

source: :pep:`560` - Core Support for typing module and generic types
pt_br: :pep:`560` - Suporte básico para módulo typing e tipos genéricos

source: Introducing :meth:`~object.__class_getitem__`, and outlining when a :ref:`subscription<subscriptions>` results in ``__class_getitem__()`` being called instead of :meth:`~object.__getitem__`
pt_br: Introduz :meth:`~object.__class_getitem__`, e define quando uma :ref:`subscrição<subscriptions>` resulta na chamada de ``__class_getitem__()`` em vez de :meth:`~object.__getitem__`

source: Emulating callable objects
pt_br: Emulando objetos chamáveis

source: Called when the instance is "called" as a function; if this method is defined, ``x(arg1, arg2, ...)`` roughly translates to ``type(x).__call__(x, arg1, ...)``. The :class:`object` class itself does not provide this method.
pt_br: Chamado quando a instância é "chamada" como uma função; se este método for definido, ``x(arg1, arg2, ...)`` basicamente traduz para ``type(x).__call__(x, arg1, ...)``. A classe :class:`object` em si não fornece este método.

source: Emulating container types
pt_br: Emulando tipos contêineres

source: The following methods can be defined to implement container objects. None of them are provided by the :class:`object` class itself. Containers usually are :term:`sequences <sequence>` (such as :class:`lists <list>` or :class:`tuples <tuple>`) or :term:`mappings <mapping>` (like :term:`dictionaries <dictionary>`), but can represent other containers as well. The first set of methods is used either to emulate a sequence or to emulate a mapping; the difference is that for a sequence, the allowable keys should be the integers *k* for which ``0 <= k < N`` where *N* is the length of the sequence, or :class:`slice` objects, which define a range of items. It is also recommended that mappings provide the methods :meth:`!keys`, :meth:`!values`, :meth:`!items`, :meth:`!get`, :meth:`!clear`, :meth:`!setdefault`, :meth:`!pop`, :meth:`!popitem`, :meth:`!copy`, and :meth:`!update` behaving similar to those for Python's standard :class:`dictionary <dict>` objects. The :mod:`collections.abc` module provides a :class:`~collections.abc.MutableMapping` :term:`abstract base class` to help create those methods from a base set of :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__`, and :meth:`!keys`. Mutable sequences should provide methods :meth:`!append`, :meth:`!count`, :meth:`!index`, :meth:`!extend`, :meth:`!insert`, :meth:`!pop`, :meth:`!remove`, :meth:`!reverse` and :meth:`!sort`, like Python standard :class:`list` objects. Finally, sequence types should implement addition (meaning concatenation) and multiplication (meaning repetition) by defining the methods :meth:`~object.__add__`, :meth:`~object.__radd__`, :meth:`~object.__iadd__`, :meth:`~object.__mul__`, :meth:`~object.__rmul__` and :meth:`~object.__imul__` described below; they should not define other numerical operators. It is recommended that both mappings and sequences implement the :meth:`~object.__contains__` method to allow efficient use of the ``in`` operator; for mappings, ``in`` should search the mapping's keys; for sequences, it should search through the values. It is further recommended that both mappings and sequences implement the :meth:`~object.__iter__` method to allow efficient iteration through the container; for mappings, :meth:`!__iter__` should iterate through the object's keys; for sequences, it should iterate through the values.
pt_br: Os métodos a seguir podem ser definidos para implementar objetos contêineres. Nenhum deles são fornecidos pela classe :class:`object` em si. Os contêineres geralmente são :term:`sequências <sequence>` (tal como :class:`listas <list>` ou :class:`tuplas <tuple>`) ou :term:`mapeamentos <mapping>` (com :term:`dicionários <dictionary>`), mas também podem representar outros contêineres. O primeiro conjunto de métodos é usado para emular uma sequência ou para emular um mapeamento; a diferença é que, para uma sequência, as chaves permitidas devem ser os inteiros *k* para os quais ``0 <= k < N`` onde *N* é o comprimento da sequência, ou objetos :class:`slice`, que definem um intervalo de itens. Também é recomendado que os mapeamentos forneçam os métodos :meth:`!keys`, :meth:`!values`, :meth:`!items`, :meth:`!get`, :meth:`!clear`, :meth:`!setdefault`, :meth:`!pop`, :meth:`!popitem`, :meth:`!copy` e :meth:`!update` se comportando de forma semelhante aos objetos :class:`dicionário <dict>` padrão do Python. O módulo :mod:`collections.abc` fornece uma :term:`classe base abstrata` :class:`~collections.abc.MutableMapping` para ajudar a criar esses métodos a partir de um conjunto base de :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` e :meth:`!keys`. Sequências mutáveis devem fornecer métodos :meth:`!append`, :meth:`!count`, :meth:`!index`, :meth:`!extend`, :meth:`!insert`, :meth:`!pop`, :meth:`!remove`, :meth:`!reverse` e :meth:`!sort`, como objetos :class:`list` padrão do Python. Finalmente, os tipos sequência devem implementar adição (significando concatenação) e multiplicação (significando repetição) definindo os métodos :meth:`~object.__add__`, :meth:`~object.__radd__`, :meth:`~object.__iadd__`, :meth:`~object.__mul__`, :meth:`~object.__rmul__` e :meth:`~object.__imul__` descritos abaixo; eles não devem definir outros operadores numéricos. É recomendado que ambos os mapeamentos e sequências implementem o método :meth:`~object.__contains__` para permitir o uso eficiente do operador ``in``; para mapeamentos, ``in`` deve pesquisar as chaves do mapeamento; para sequências, ele deve pesquisar os valores. É ainda recomendado que ambos os mapeamentos e sequências implementem o método :meth:`~object.__iter__` para permitir a iteração eficiente através do contêiner; para mapeamentos, :meth:`!__iter__` deve iterar através das chaves do objeto; para sequências, ele deve iterar por meio dos valores.

source: Called to implement the built-in function :func:`len`. Should return the length of the object, an integer ``>=`` 0. Also, an object that doesn't define a :meth:`~object.__bool__` method and whose :meth:`!__len__` method returns zero is considered to be false in a Boolean context.
pt_br: Chamado para implementar a função embutida :func:`len`. Deve retornar o comprimento do objeto, um inteiro ``>=`` 0. Além disso, um objeto que não define um método :meth:`~object.__bool__` e cujo método :meth:`!__len__` retorna zero é considerado como falso em um contexto booleano.

source: In CPython, the length is required to be at most :data:`sys.maxsize`. If the length is larger than :data:`!sys.maxsize` some features (such as :func:`len`) may raise :exc:`OverflowError`. To prevent raising :exc:`!OverflowError` by truth value testing, an object must define a :meth:`~object.__bool__` method.
pt_br: No CPython, o comprimento deve ser no máximo :data:`sys.maxsize`. Se o comprimento for maior que :data:`!sys.maxsize`, alguns recursos (como :func:`len`) podem levantar :exc:`OverflowError`. Para evitar levantar :exc:`!OverflowError` pelo teste de valor de verdade, um objeto deve definir um método :meth:`~object.__bool__`.

source: Called to implement :func:`operator.length_hint`. Should return an estimated length for the object (which may be greater or less than the actual length). The length must be an integer ``>=`` 0. The return value may also be :data:`NotImplemented`, which is treated the same as if the ``__length_hint__`` method didn't exist at all. This method is purely an optimization and is never required for correctness.
pt_br: Chamado para implementar :func:`operator.length_hint`. Deve retornar um comprimento estimado para o objeto (que pode ser maior ou menor que o comprimento real). O comprimento deve ser um inteiro ``>=`` 0. O valor de retorno também pode ser :data:`NotImplemented`, que é tratado da mesma forma como se o método ``__length_hint__`` não existisse. Este método é puramente uma otimização e nunca é necessário para a correção.

source: Slicing is done exclusively with the following three methods. A call like ::
pt_br: O fatiamento é feito exclusivamente com os três métodos a seguir. Uma chamada como ::

source: is translated to ::
pt_br: é traduzida com ::

source: and so forth. Missing slice items are always filled in with ``None``.
pt_br: e assim por diante. Os itens de fatia ausentes são sempre preenchidos com ``None``.

source: Called to implement evaluation of ``self[key]``. For :term:`sequence` types, the accepted keys should be integers. Optionally, they may support :class:`slice` objects as well. Negative index support is also optional. If *key* is of an inappropriate type, :exc:`TypeError` may be raised; if *key* is a value outside the set of indexes for the sequence (after any special interpretation of negative values), :exc:`IndexError` should be raised. For :term:`mapping` types, if *key* is missing (not in the container), :exc:`KeyError` should be raised.
pt_br: Chamado para implementar a avaliação de ``self[key]``. Para tipos de :term:`sequência`, as chaves aceitas devem ser inteiros. Opcionalmente, eles também podem oferecer suporte a objetos :class:`slice`. Suporte a índice negativo também é opcional. Se *key* for de um tipo impróprio, :exc:`TypeError` pode ser levantada; se *key* for de um valor fora do conjunto de índices para a sequência (após qualquer interpretação especial de valores negativos), :exc:`IndexError` deve ser levantada. Para tipos :term:`mapeamento`, se *key* estiver faltando (não no contêiner), :exc:`KeyError` deve ser levantada.

source: :keyword:`for` loops expect that an :exc:`IndexError` will be raised for illegal indexes to allow proper detection of the end of the sequence.
pt_br: Os loops :keyword:`for` esperam que uma :exc:`IndexError` seja levantada para índices ilegais para permitir a detecção apropriada do fim da sequência.

source: When :ref:`subscripting<subscriptions>` a *class*, the special class method :meth:`~object.__class_getitem__` may be called instead of ``__getitem__()``. See :ref:`classgetitem-versus-getitem` for more details.
pt_br: Ao fazer :ref:`subscrição <subscriptions>` de uma *classe*, o método de classe especial :meth:`~object.__class_getitem__` pode ser chamado em vez de ``__getitem__()``. Veja :ref:`classgetitem-versus-getitem` para mais detalhes.

source: Called to implement assignment to ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support changes to the values for keys, or if new keys can be added, or for sequences if elements can be replaced. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
pt_br: Chamado para implementar a atribuição de ``self[key]``. Mesma nota que para :meth:`__getitem__`. Isso só deve ser implementado para mapeamentos se os objetos suportarem alterações nos valores das chaves, ou se novas chaves puderem ser adicionadas, ou para sequências se os elementos puderem ser substituídos. As mesmas exceções devem ser levantadas para valores *key* impróprios do método :meth:`__getitem__`.
