Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: Called to implement deletion of ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support removal of keys, or for sequences if elements can be removed from the sequence. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
pt_br: Chamado para implementar a exclusão de ``self[key]``. Mesma nota que para :meth:`__getitem__`. Isso só deve ser implementado para mapeamentos se os objetos suportarem remoções de chaves, ou para sequências se os elementos puderem ser removidos da sequência. As mesmas exceções devem ser levantadas para valores *key* impróprios do método :meth:`__getitem__`.

source: Called by :class:`dict`\ .\ :meth:`__getitem__` to implement ``self[key]`` for dict subclasses when key is not in the dictionary.
pt_br: Chamado por :class:`dict`\ .\ :meth:`__getitem__` para implementar ``self[key]`` para subclasses de dicionário quando a chave não estiver no dicionário.

source: This method is called when an :term:`iterator` is required for a container. This method should return a new iterator object that can iterate over all the objects in the container. For mappings, it should iterate over the keys of the container.
pt_br: Este método é chamado quando um :term:`iterador` é necessário para um contêiner. Este método deve retornar um novo objeto iterador que pode iterar sobre todos os objetos no contêiner. Para mapeamentos, ele deve iterar sobre as chaves do contêiner.

source: Called (if present) by the :func:`reversed` built-in to implement reverse iteration. It should return a new iterator object that iterates over all the objects in the container in reverse order.
pt_br: Chamado (se presente) pelo :func:`reversed` embutido para implementar a iteração reversa. Ele deve retornar um novo objeto iterador que itera sobre todos os objetos no contêiner na ordem reversa.

source: If the :meth:`__reversed__` method is not provided, the :func:`reversed` built-in will fall back to using the sequence protocol (:meth:`__len__` and :meth:`__getitem__`). Objects that support the sequence protocol should only provide :meth:`__reversed__` if they can provide an implementation that is more efficient than the one provided by :func:`reversed`.
pt_br: Se o método :meth:`__reversed__` não for fornecido, o :func:`reversed` embutido voltará a usar o protocolo de sequência (:meth:`__len__` e :meth:`__getitem__`). Objetos que suportam o protocolo de sequência só devem fornecer :meth:`__reversed__` se eles puderem fornecer uma implementação que seja mais eficiente do que aquela fornecida por :func:`reversed`.

source: The membership test operators (:keyword:`in` and :keyword:`not in`) are normally implemented as an iteration through a container. However, container objects can supply the following special method with a more efficient implementation, which also does not require the object be iterable.
pt_br: Os operadores de teste de associação (:keyword:`in` e :keyword:`not in`) são normalmente implementados como uma iteração através de um contêiner. No entanto, os objetos contêiner podem fornecer o seguinte método especial com uma implementação mais eficiente, que também não requer que o objeto seja iterável.

source: Called to implement membership test operators. Should return true if *item* is in *self*, false otherwise. For mapping objects, this should consider the keys of the mapping rather than the values or the key-item pairs.
pt_br: Chamado para implementar operadores de teste de associação. Deve retornar verdadeiro se *item* estiver em *self*, falso caso contrário. Para objetos de mapeamento, isso deve considerar as chaves do mapeamento em vez dos valores ou pares de itens-chave.

source: For objects that don't define :meth:`__contains__`, the membership test first tries iteration via :meth:`__iter__`, then the old sequence iteration protocol via :meth:`__getitem__`, see :ref:`this section in the language reference <membership-test-details>`.
pt_br: Para objetos que não definem :meth:`__contains__`, o teste de associação primeiro tenta a iteração via :meth:`__iter__`, depois o protocolo de iteração de sequência antigo via :meth:`__getitem__`, consulte :ref:`esta seção em a referência da linguagem <membership-test-details>`.

source: Emulating numeric types
pt_br: Emulando tipos numéricos

source: The following methods can be defined to emulate numeric objects. Methods corresponding to operations that are not supported by the particular kind of number implemented (e.g., bitwise operations for non-integral numbers) should be left undefined.
pt_br: Os métodos a seguir podem ser definidos para emular objetos numéricos. Métodos correspondentes a operações que não são suportadas pelo tipo particular de número implementado (por exemplo, operações bit a bit para números não inteiros) devem ser deixados indefinidos.

source: These methods are called to implement the binary arithmetic operations (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``). For instance, to evaluate the expression ``x + y``, where *x* is an instance of a class that has an :meth:`__add__` method, ``type(x).__add__(x, y)`` is called. The :meth:`__divmod__` method should be the equivalent to using :meth:`__floordiv__` and :meth:`__mod__`; it should not be related to :meth:`__truediv__`. Note that :meth:`__pow__` should be defined to accept an optional third argument if the ternary version of the built-in :func:`pow` function is to be supported.
pt_br: Esses métodos são chamados para implementar as operações aritméticas binárias (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``). Por exemplo, para avaliar a expressão ``x + y``, onde *x* é uma instância de uma classe que tem um método :meth:`__add__`, ``type(x).__add__(x, y)`` é chamado. O método :meth:`__divmod__` deve ser equivalente a usar :meth:`__floordiv__` e :meth:`__mod__`; não deve estar relacionado a :meth:`__truediv__`. Note que :meth:`__pow__` deve ser definido para aceitar um terceiro argumento opcional se a versão ternária da função embutida :func:`pow` for suportada.

source: If one of those methods does not support the operation with the supplied arguments, it should return :data:`NotImplemented`.
pt_br: Se um desses métodos não suporta a operação com os argumentos fornecidos, ele deve retornar :data:`NotImplemented`.

source: These methods are called to implement the binary arithmetic operations (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``) with reflected (swapped) operands. These functions are only called if the left operand does not support the corresponding operation [#]_ and the operands are of different types. [#]_ For instance, to evaluate the expression ``x - y``, where *y* is an instance of a class that has an :meth:`__rsub__` method, ``type(y).__rsub__(y, x)`` is called if ``type(x).__sub__(x, y)`` returns :data:`NotImplemented`.
pt_br: Esses métodos são chamados para implementar as operações aritméticas binárias (``+``, ``-``, ``*``, ``@``, ``/``, ``//``, ``%``, :func:`divmod`, :func:`pow`, ``**``, ``<<``, ``>>``, ``&``, ``^``, ``|``) com operandos refletidos (trocados). Essas funções são chamadas apenas se o operando esquerdo não suportar a operação correspondente [#]_ e os operandos forem de tipos diferentes. [#]_ Por exemplo, para avaliar a expressão ``x - y``, onde *y* é uma instância de uma classe que tem um método :meth:`__rsub__`, ``type(y).__rsub__(y, x)`` é chamado se ``type(x).__sub__(x, y)`` retorna :data:`NotImplemented`.

source: Note that ternary :func:`pow` will not try calling :meth:`__rpow__` (the coercion rules would become too complicated).
pt_br: Note que ternário :func:`pow` não tentará chamar :meth:`__rpow__` (as regras de coerção se tornariam muito complicadas).

source: If the right operand's type is a subclass of the left operand's type and that subclass provides a different implementation of the reflected method for the operation, this method will be called before the left operand's non-reflected method. This behavior allows subclasses to override their ancestors' operations.
pt_br: Se o tipo do operando direito for uma subclasse do tipo do operando esquerdo e essa subclasse fornecer uma implementação diferente do método refletido para a operação, este método será chamado antes do método não refletido do operando esquerdo. Esse comportamento permite que as subclasses substituam as operações de seus ancestrais.

source: These methods are called to implement the augmented arithmetic assignments (``+=``, ``-=``, ``*=``, ``@=``, ``/=``, ``//=``, ``%=``, ``**=``, ``<<=``, ``>>=``, ``&=``, ``^=``, ``|=``). These methods should attempt to do the operation in-place (modifying *self*) and return the result (which could be, but does not have to be, *self*). If a specific method is not defined, or if that method returns :data:`NotImplemented`, the augmented assignment falls back to the normal methods. For instance, if *x* is an instance of a class with an :meth:`__iadd__` method, ``x += y`` is equivalent to ``x = x.__iadd__(y)`` . If :meth:`__iadd__` does not exist, or if ``x.__iadd__(y)`` returns :data:`!NotImplemented`, ``x.__add__(y)`` and ``y.__radd__(x)`` are considered, as with the evaluation of ``x + y``. In certain situations, augmented assignment can result in unexpected errors (see :ref:`faq-augmented-assignment-tuple-error`), but this behavior is in fact part of the data model.
pt_br: Esses métodos são chamados para implementar as atribuições aritméticas aumentadas (``+=``, ``-=``, ``*=``, ``@=``, ``/=``, ``//=``, ``%=``, ``**=``, ``<<=``, ``>>=``, ``&=``, ``^=``, ``|=``). Esses métodos devem tentar fazer a operação no local (modificando *self*) e retornar o resultado (que poderia ser, mas não precisa ser, *self*). Se um método específico não for definido, ou se esse método retorna :data:`NotImplemented`, a atribuição aumentada volta aos métodos normais. Por exemplo, se *x* é uma instância de uma classe com um método :meth:`__iadd__`, ``x += y`` equivale a ``x = x.__iadd__(y)``. Se :meth:`__iadd__` não existe, ou se ``x.__iadd__(y)`` retorna :data:`!NotImplemented`, ``x.__add__(y)`` e ``y.__radd__(x)`` são considerados, como com a avaliação de ``x + y``. Em certas situações, a atribuição aumentada pode resultar em erros inesperados (veja :ref:`faq-augmented-assignment-tuple-error`), mas este comportamento é na verdade parte do modelo de dados.

source: Called to implement the unary arithmetic operations (``-``, ``+``, :func:`abs` and ``~``).
pt_br: Chamado para implementar as operações aritméticas unárias (``-``, ``+``, :func:`abs` e ``~``).

source: Called to implement the built-in functions :func:`complex`, :func:`int` and :func:`float`. Should return a value of the appropriate type.
pt_br: Chamado para implementar as funções embutidas :func:`complex`, :func:`int` e :func:`float`. Deve retornar um valor do tipo apropriado.

source: Called to implement :func:`operator.index`, and whenever Python needs to losslessly convert the numeric object to an integer object (such as in slicing, or in the built-in :func:`bin`, :func:`hex` and :func:`oct` functions). Presence of this method indicates that the numeric object is an integer type. Must return an integer.
pt_br: Chamado para implementar :func:`operator.index`, e sempre que o Python precisar converter sem perdas o objeto numérico em um objeto inteiro (como no fatiamento ou nas funções embutidas :func:`bin`, :func:`hex` e :func:`oct`). A presença deste método indica que o objeto numérico é do tipo inteiro. Deve retornar um número inteiro.

source: If :meth:`__int__`, :meth:`__float__` and :meth:`__complex__` are not defined then corresponding built-in functions :func:`int`, :func:`float` and :func:`complex` fall back to :meth:`__index__`.
pt_br: Se :meth:`__int__`, :meth:`__float__` e :meth:`__complex__` não estiverem definidos, funções embutidas correspondentes :func:`int`, :func:`float` e :func:`complex` recorre a :meth:`__index__`.

source: Called to implement the built-in function :func:`round` and :mod:`math` functions :func:`~math.trunc`, :func:`~math.floor` and :func:`~math.ceil`. Unless *ndigits* is passed to :meth:`!__round__` all these methods should return the value of the object truncated to an :class:`~numbers.Integral` (typically an :class:`int`).
pt_br: Chamado para implementar as funções embutidas :func:`round` e :func:`~math.trunc`, :func:`~math.floor` e :func:`~math.ceil` de :mod:`math`. A menos que *ndigits* sejam passados para :meth:`!__round__` todos estes métodos devem retornar o valor do objeto truncado para um :class:`~numbers.Integral` (tipicamente um :class:`int`).

source: The built-in function :func:`int` falls back to :meth:`__trunc__` if neither :meth:`__int__` nor :meth:`__index__` is defined.
pt_br: A função embutida :func:`int` retorna para :meth:`__trunc__` se nem :meth:`__int__` nem :meth:`__index__` estiverem definidos.

source: The delegation of :func:`int` to :meth:`__trunc__` is deprecated.
pt_br: A delegação de :func:`int` para :meth:`__trunc__` foi descontinuada.

source: With Statement Context Managers
pt_br: Gerenciadores de contexto da instrução with

source: A :dfn:`context manager` is an object that defines the runtime context to be established when executing a :keyword:`with` statement. The context manager handles the entry into, and the exit from, the desired runtime context for the execution of the block of code. Context managers are normally invoked using the :keyword:`!with` statement (described in section :ref:`with`), but can also be used by directly invoking their methods.
pt_br: Um :dfn:`gerenciador de contexto` é um objeto que define o contexto de tempo de execução a ser estabelecido ao executar uma instrução :keyword:`with`. O gerenciador de contexto lida com a entrada e a saída do contexto de tempo de execução desejado para a execução do bloco de código. Os gerenciadores de contexto são normalmente invocados usando a instrução :keyword:`!with` (descrita na seção :ref:`with`), mas também podem ser usados invocando diretamente seus métodos.

source: Typical uses of context managers include saving and restoring various kinds of global state, locking and unlocking resources, closing opened files, etc.
pt_br: Os usos típicos de gerenciadores de contexto incluem salvar e restaurar vários tipos de estado global, travar e destravar recursos, fechar arquivos abertos, etc.

source: For more information on context managers, see :ref:`typecontextmanager`. The :class:`object` class itself does not provide the context manager methods.
pt_br: Para mais informações sobre gerenciadores de contexto, veja :ref:`typecontextmanager`. A classe :class:`object` em si não fornece os métodos do gerenciador de contexto.

source: Enter the runtime context related to this object. The :keyword:`with` statement will bind this method's return value to the target(s) specified in the :keyword:`!as` clause of the statement, if any.
pt_br: Insere o contexto de tempo de execução relacionado a este objeto. A instrução :keyword:`with` vinculará o valor de retorno deste método ao(s) alvo(s) especificado(s) na cláusula :keyword:`!as` da instrução, se houver.

source: Exit the runtime context related to this object. The parameters describe the exception that caused the context to be exited. If the context was exited without an exception, all three arguments will be :const:`None`.
pt_br: Sai do contexto de tempo de execução relacionado a este objeto. Os parâmetros descrevem a exceção que fez com que o contexto fosse encerrado. Se o contexto foi encerrado sem exceção, todos os três argumentos serão :const:`None`.

source: If an exception is supplied, and the method wishes to suppress the exception (i.e., prevent it from being propagated), it should return a true value. Otherwise, the exception will be processed normally upon exit from this method.
pt_br: Se uma exceção for fornecida e o método desejar suprimir a exceção (ou seja, evitar que ela seja propagada), ele deve retornar um valor verdadeiro. Caso contrário, a exceção será processada normalmente ao sair deste método.

source: Note that :meth:`~object.__exit__` methods should not reraise the passed-in exception; this is the caller's responsibility.
pt_br: Observe que os métodos :meth:`~object.__exit__` não devem relançar a exceção passada; esta é a responsabilidade do chamador.

source: :pep:`343` - The "with" statement
pt_br: :pep:`343` - A instrução "with"

source: The specification, background, and examples for the Python :keyword:`with` statement.
pt_br: A especificação, o histórico e os exemplos para a instrução Python :keyword:`with`.

source: Customizing positional arguments in class pattern matching
pt_br: Customizando argumentos posicionais na classe correspondência de padrão

source: When using a class name in a pattern, positional arguments in the pattern are not allowed by default, i.e. ``case MyClass(x, y)`` is typically invalid without special support in ``MyClass``. To be able to use that kind of pattern, the class needs to define a *__match_args__* attribute.
pt_br: Ao usar um nome de classe em um padrão, argumentos posicionais não são permitidos por padrão, ou seja, ``case MyClass(x, y)`` é tipicamente inválida sem suporte especial em ``MyClass``. Para permitir a utilização desse tipo de padrão, a classe precisa definir um atributo *__match_args__*

source: This class variable can be assigned a tuple of strings. When this class is used in a class pattern with positional arguments, each positional argument will be converted into a keyword argument, using the corresponding value in *__match_args__* as the keyword. The absence of this attribute is equivalent to setting it to ``()``.
pt_br: Essa variável de classe pode ser atribuída a uma tupla de strings. Quando essa classe é usada em uma classe padrão com argumentos posicionais, cada argumento posicional será convertido para um argumento nomeado, usando correspondência de valor em *__match_args__* como palavra reservada. A ausência desse atributo é equivalente a defini-lo como ``()``

source: For example, if ``MyClass.__match_args__`` is ``("left", "center", "right")`` that means that ``case MyClass(x, y)`` is equivalent to ``case MyClass(left=x, center=y)``. Note that the number of arguments in the pattern must be smaller than or equal to the number of elements in *__match_args__*; if it is larger, the pattern match attempt will raise a :exc:`TypeError`.
pt_br: Por exemplo, se ``MyClass.__match_args__`` é ``("left", "center", "right")`` significa que ``case MyClass(x, y)`` é equivalente a ``case MyClass(left=x, center=y)``. Note que o número de argumentos no padrão deve ser menor ou igual ao número de elementos em *__match_args__*; caso seja maior, a tentativa de correspondência de padrão irá levantar uma :exc:`TypeError`.

source: :pep:`634` - Structural Pattern Matching
pt_br: :pep:`634` - Correspondência de Padrão Estrutural

source: The specification for the Python ``match`` statement.
pt_br: A especificação para a instrução Python ``match``

source: Emulating buffer types
pt_br: Emulando tipos buffer

source: The :ref:`buffer protocol <bufferobjects>` provides a way for Python objects to expose efficient access to a low-level memory array. This protocol is implemented by builtin types such as :class:`bytes` and :class:`memoryview`, and third-party libraries may define additional buffer types.
pt_br: O :ref:`protocolo buffer <bufferobjects>` fornece uma maneira para objetos Python exporem acesso eficiente a um vetor de memória de baixo nível. Este protocolo é implementado por tipos embutido como :class:`bytes` e :class:`memoryview`, e bibliotecas de terceiros podem definir tipos de buffer adicionais.

source: While buffer types are usually implemented in C, it is also possible to implement the protocol in Python.
pt_br: Embora os tipos buffer sejam geralmente implementados em C, também é possível implementar o protocolo em Python.

source: Called when a buffer is requested from *self* (for example, by the :class:`memoryview` constructor). The *flags* argument is an integer representing the kind of buffer requested, affecting for example whether the returned buffer is read-only or writable. :class:`inspect.BufferFlags` provides a convenient way to interpret the flags. The method must return a :class:`memoryview` object.
pt_br: Chamado quando um buffer é solicitado de *self* (por exemplo, pelo construtor de :class:`memoryview`). O argumento *flags* é um inteiro que representa o tipo de buffer solicitado, afetando, por exemplo, se o buffer retornado é somente leitura ou gravável. :class:`inspect.BufferFlags` fornece uma maneira conveniente de interpretar os sinalizadores. O método deve retornar um objeto :class:`memoryview`.

source: Called when a buffer is no longer needed. The *buffer* argument is a :class:`memoryview` object that was previously returned by :meth:`~object.__buffer__`. The method must release any resources associated with the buffer. This method should return ``None``. Buffer objects that do not need to perform any cleanup are not required to implement this method.
pt_br: Chamado quando um buffer não é mais necessário. O argumento *buffer* é um objeto :class:`memoryview` que foi retornado anteriormente por :meth:`~object.__buffer__`. O método deve liberar quaisquer recursos associados ao buffer. Este método deve retornar ``None``. Objetos buffer que não precisam executar nenhuma limpeza não são necessários para implementar este método.

source: :pep:`688` - Making the buffer protocol accessible in Python
pt_br: :pep:`688` - Tornando o protocolo de buffer acessível no Python

source: Introduces the Python ``__buffer__`` and ``__release_buffer__`` methods.
pt_br: Introduz os métodos ``__buffer__`` e ``__release_buffer__`` no Python

source: ABC for buffer types.
pt_br: ABC para tipos buffer.

source: Special method lookup
pt_br: Pesquisa de método especial

source: For custom classes, implicit invocations of special methods are only guaranteed to work correctly if defined on an object's type, not in the object's instance dictionary. That behaviour is the reason why the following code raises an exception::
pt_br: Para classes personalizadas, as invocações implícitas de métodos especiais só têm garantia de funcionar corretamente se definidas em um tipo de objeto, não no dicionário de instância do objeto. Esse comportamento é o motivo pelo qual o código a seguir levanta uma exceção::

source: The rationale behind this behaviour lies with a number of special methods such as :meth:`~object.__hash__` and :meth:`~object.__repr__` that are implemented by all objects, including type objects. If the implicit lookup of these methods used the conventional lookup process, they would fail when invoked on the type object itself::
pt_br: A justificativa por trás desse comportamento está em uma série de métodos especiais como :meth:`~object.__hash__` e :meth:`~object.__repr__` que são implementados por todos os objetos, incluindo objetos de tipo. Se a pesquisa implícita desses métodos usasse o processo de pesquisa convencional, eles falhariam quando invocados no próprio objeto do tipo::

source: Incorrectly attempting to invoke an unbound method of a class in this way is sometimes referred to as 'metaclass confusion', and is avoided by bypassing the instance when looking up special methods::
pt_br: A tentativa incorreta de invocar um método não vinculado de uma classe dessa maneira é às vezes referida como "confusão de metaclasse" e é evitada ignorando a instância ao pesquisar métodos especiais::
