Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: Because of the way CPython clears module dictionaries, the module dictionary will be cleared when the module falls out of scope even if the dictionary still has live references. To avoid this, copy the dictionary or keep the module around while using its dictionary directly.
pt_br: Por causa da maneira como CPython limpa dicionários de módulos, o dicionário do módulo será limpo quando o módulo sair do escopo, mesmo se o dicionário ainda tiver referências ativas. Para evitar isso, copie o dicionário ou mantenha o módulo por perto enquanto usa seu dicionário diretamente.

source: Custom classes
pt_br: Classes personalizadas

source: Custom class types are typically created by class definitions (see section :ref:`class`). A class has a namespace implemented by a dictionary object. Class attribute references are translated to lookups in this dictionary, e.g., ``C.x`` is translated to ``C.__dict__["x"]`` (although there are a number of hooks which allow for other means of locating attributes). When the attribute name is not found there, the attribute search continues in the base classes. This search of the base classes uses the C3 method resolution order which behaves correctly even in the presence of 'diamond' inheritance structures where there are multiple inheritance paths leading back to a common ancestor. Additional details on the C3 MRO used by Python can be found at :ref:`python_2.3_mro`.
pt_br: Tipos de classe personalizados são tipicamente criados por definições de classe (veja a seção :ref:`class`). Uma classe possui um espaço de nomes implementado por um objeto dicionário. As referências de atributos de classe são traduzidas para pesquisas neste dicionário, por exemplo, ``C.x`` é traduzido para ``C.__dict__["x"]`` (embora haja uma série de ganchos que permitem outros meios de localizar atributos). Quando o nome do atributo não é encontrado lá, a pesquisa do atributo continua nas classes base. Essa pesquisa das classes base usa a ordem de resolução de métodos C3, que se comporta corretamente mesmo na presença de estruturas de herança em losango, onde há vários caminhos de herança que levam de volta a um ancestral comum. Detalhes adicionais sobre a ordem de resolução de métodos (MRO) C3 usado pelo Python podem ser encontrados em :ref:`python_2.3_mro`.

source: When a class attribute reference (for class :class:`!C`, say) would yield a class method object, it is transformed into an instance method object whose :attr:`~method.__self__` attribute is :class:`!C`. When it would yield a :class:`staticmethod` object, it is transformed into the object wrapped by the static method object. See section :ref:`descriptors` for another way in which attributes retrieved from a class may differ from those actually contained in its :attr:`~object.__dict__`.
pt_br: Quando uma referência de atributo de classe (para uma classe :class:`!C`, digamos) produziria um objeto método de classe, ele é transformado em um objeto método de instância cujo atributo :attr:`~method.__self__` é :class:`!C`. Quando produziria um objeto :class:`staticmethod`, ele é transformado no objeto encapsulado pelo objeto método estático. Veja a seção :ref:`descriptors` para outra maneira em que os atributos recuperados de uma classe podem diferir daqueles realmente contidos em seu :attr:`~object.__dict__`.

source: Class attribute assignments update the class's dictionary, never the dictionary of a base class.
pt_br: As atribuições de atributos de classe atualizam o dicionário da classe, nunca o dicionário de uma classe base.

source: A class object can be called (see above) to yield a class instance (see below).
pt_br: Um objeto classe pode ser chamado (veja acima) para produzir uma instância de classe (veja abaixo).

source: Special attributes
pt_br: Atributos especiais

source: The class's name. See also: :attr:`__name__ attributes <definition.__name__>`.
pt_br: O nome da classe. Veja também: :attr:`atributos __name__ <definition.__name__>`.

source: The class's :term:`qualified name`. See also: :attr:`__qualname__ attributes <definition.__qualname__>`.
pt_br: O :term:`nome qualificado` da classe. Veja também: :attr:`atributos __qualname__ <definition.__qualname__>`.

source: The name of the module in which the class was defined.
pt_br: O nome do módulo no qual a classe foi definida.

source: A :class:`mapping proxy <types.MappingProxyType>` providing a read-only view of the class's namespace. See also: :attr:`__dict__ attributes <object.__dict__>`.
pt_br: Um :class:`proxy de mapeamento <types.MappingProxyType>` fornecendo uma visão somente leitura do espaço de nomes da classe. Veja também: :attr:`atributos __dict__ <object.__dict__>`.

source: A :class:`tuple` containing the class's bases. In most cases, for a class defined as ``class X(A, B, C)``, ``X.__bases__`` will be exactly equal to ``(A, B, C)``.
pt_br: Uma :class:`tuple` contendo as bases da classe. Na maioria dos casos, para uma classe definida como ``class X(A, B, C)``, ``X.__bases__`` será exatamente igual a ``(A, B, C)``.

source: The class's documentation string, or ``None`` if undefined. Not inherited by subclasses.
pt_br: A string de documentação da classe, ou ``None`` se não estiver definida. Não herdado por subclasses.

source: A dictionary containing :term:`variable annotations <variable annotation>` collected during class body execution. For best practices on working with :attr:`!__annotations__`, please see :ref:`annotations-howto`.
pt_br: Um dicionário contendo :term:`anotações de variável <variable annotation>` coletadas durante a execução do corpo da classe. Para melhores práticas sobre como trabalhar com :attr:`!__annotations__`, por favor veja :ref:`annotations-howto`.

source: Accessing the :attr:`!__annotations__` attribute of a class object directly may yield incorrect results in the presence of metaclasses. In addition, the attribute may not exist for some classes. Use :func:`inspect.get_annotations` to retrieve class annotations safely.
pt_br: Acessar o atributo :attr:`!__annotations__` de um objeto classe diretamente pode produzir resultados incorretos na presença de metaclasses. Além disso, o atributo pode não existir para algumas classes. Use :func:`inspect.get_annotations` para recuperar anotações de classe com segurança.

source: A :class:`tuple` containing the :ref:`type parameters <type-params>` of a :ref:`generic class <generic-classes>`.
pt_br: Uma :class:`tuple` contendo os :ref:`parâmetros de tipo <type-params>` de uma :ref:`classe genérica <generic-classes>`.

source: A :class:`tuple` containing names of attributes of this class which are assigned through ``self.X`` from any function in its body.
pt_br: Uma :class:`tuple` contendo nomes de atributos dessa classe que são atribuídos por meio de ``self.X`` de qualquer função em seu corpo.

source: The line number of the first line of the class definition, including decorators. Setting the :attr:`__module__` attribute removes the :attr:`!__firstlineno__` item from the type's dictionary.
pt_br: O número da linha da primeira linha da definição de classe, incluindo decoradores. Definir o atributo :attr:`__module__` remove o item :attr:`!__firstlineno__` do dicionário do tipo.

source: The :class:`tuple` of classes that are considered when looking for base classes during method resolution.
pt_br: A :class:`tuple` de classes que são consideradas ao procurar por classes bases durante resolução de métodos.

source: Special methods
pt_br: Métodos especiais

source: In addition to the special attributes described above, all Python classes also have the following two methods available:
pt_br: Além dos atributos especiais descritos acima, todas as classes Python também têm os dois métodos a seguir disponíveis:

source: This method can be overridden by a metaclass to customize the method resolution order for its instances. It is called at class instantiation, and its result is stored in :attr:`~type.__mro__`.
pt_br: Este método pode ser substituído por uma metaclasse para personalizar a ordem de resolução de métodos para suas instâncias. Ele é chamado na instanciação da classe, e o seu resultado é armazenado em :attr:`~type.__mro__`.

source: Each class keeps a list of weak references to its immediate subclasses. This method returns a list of all those references still alive. The list is in definition order. Example:
pt_br: Cada classe mantém uma lista de referências fracas para suas subclasses imediatas. Este método retorna uma lista de todas essas referências ainda vivas. A lista está na ordem que são definidas. Exemplo::

source: Class instances
pt_br: Instâncias de classe

source: A class instance is created by calling a class object (see above). A class instance has a namespace implemented as a dictionary which is the first place in which attribute references are searched. When an attribute is not found there, and the instance's class has an attribute by that name, the search continues with the class attributes. If a class attribute is found that is a user-defined function object, it is transformed into an instance method object whose :attr:`~method.__self__` attribute is the instance. Static method and class method objects are also transformed; see above under "Classes". See section :ref:`descriptors` for another way in which attributes of a class retrieved via its instances may differ from the objects actually stored in the class's :attr:`~object.__dict__`. If no class attribute is found, and the object's class has a :meth:`~object.__getattr__` method, that is called to satisfy the lookup.
pt_br: Uma instância de classe é criada chamando um objeto classe (veja acima). Uma instância de classe tem um espaço de nomes implementado como um dicionário que é o primeiro lugar no qual as referências de atributos são pesquisadas. Quando um atributo não é encontrado lá, e a classe da instância possui um atributo com esse nome, a pesquisa continua com os atributos da classe. Se for encontrado um atributo de classe que seja um objeto função definido pelo usuário, ele é transformado em um objeto método de instância cujo atributo :attr:`~method.__self__` é a instância. Métodos estáticos e métodos de classe também são transformados; veja acima em "Classes". Veja a seção :ref:`descriptors` para outra maneira em que os atributos de uma classe recuperados através de suas instâncias podem diferir dos objetos realmente armazenados no :attr:`~object.__dict__` da classe. Se nenhum atributo de classe for encontrado, e a classe do objeto tiver um método :meth:`~object.__getattr__`, este é chamado para satisfazer a pesquisa.

source: Attribute assignments and deletions update the instance's dictionary, never a class's dictionary. If the class has a :meth:`~object.__setattr__` or :meth:`~object.__delattr__` method, this is called instead of updating the instance dictionary directly.
pt_br: As atribuições e exclusões de atributos atualizam o dicionário da instância, nunca o dicionário de uma classe. Se a classe tem um método :meth:`~object.__setattr__` ou :meth:`~object.__delattr__`, ele é chamado ao invés de atualizar o dicionário da instância diretamente.

source: Class instances can pretend to be numbers, sequences, or mappings if they have methods with certain special names. See section :ref:`specialnames`.
pt_br: As instâncias de classe podem fingir ser números, sequências ou mapeamentos se tiverem métodos com certos nomes especiais. Veja a seção :ref:`specialnames`.

source: The class to which a class instance belongs.
pt_br: A classe à qual pertence uma instância de classe.

source: A dictionary or other mapping object used to store an object's (writable) attributes. Not all instances have a :attr:`!__dict__` attribute; see the section on :ref:`slots` for more details.
pt_br: Um dicionário ou outro objeto de mapeamento usado para armazenar atributos (graváveis) de um objeto. Nem todas as instâncias têm um atributo :attr:`!__dict__`; veja a seção sobre :ref:`slots` para mais detalhes.

source: I/O objects (also known as file objects)
pt_br: Objetos de E/S (também conhecidos como objetos arquivo)

source: A :term:`file object` represents an open file. Various shortcuts are available to create file objects: the :func:`open` built-in function, and also :func:`os.popen`, :func:`os.fdopen`, and the :meth:`~socket.socket.makefile` method of socket objects (and perhaps by other functions or methods provided by extension modules).
pt_br: O :term:`objeto arquivo <file object>` representa um arquivo aberto. Vários atalhos estão disponíveis para criar objetos arquivos: a função embutida :func:`open`, e também :func:`os.popen`, :func:`os.fdopen` e o método :meth:`~socket.socket.makefile` de objetos soquete (e talvez por outras funções ou métodos fornecidos por módulos de extensão).

source: The objects ``sys.stdin``, ``sys.stdout`` and ``sys.stderr`` are initialized to file objects corresponding to the interpreter's standard input, output and error streams; they are all open in text mode and therefore follow the interface defined by the :class:`io.TextIOBase` abstract class.
pt_br: Os objetos ``sys.stdin``, ``sys.stdout`` e ``sys.stderr`` são inicializados para objetos arquivo que correspondem aos fluxos de entrada, saída e erro padrão do interpretador; eles são todos abertos em modo texto e, portanto, seguem a interface definida pela classe abstrata :class:`io.TextIOBase`.

source: Internal types
pt_br: Tipos internos

source: A few types used internally by the interpreter are exposed to the user. Their definitions may change with future versions of the interpreter, but they are mentioned here for completeness.
pt_br: Alguns tipos usados internamente pelo interpretador são expostos ao usuário. Suas definições podem mudar com versões futuras do interpretador, mas são mencionadas aqui para fins de integridade.

source: Code objects
pt_br: Objetos código

source: Code objects represent *byte-compiled* executable Python code, or :term:`bytecode`. The difference between a code object and a function object is that the function object contains an explicit reference to the function's globals (the module in which it was defined), while a code object contains no context; also the default argument values are stored in the function object, not in the code object (because they represent values calculated at run-time). Unlike function objects, code objects are immutable and contain no references (directly or indirectly) to mutable objects.
pt_br: Objetos código representam código Python executável *compilados em bytes* ou :term:`bytecode`. A diferença entre um objeto código e um objeto função é que o objeto função contém uma referência explícita aos globais da função (o módulo no qual foi definida), enquanto um objeto código não contém nenhum contexto; também os valores de argumento padrão são armazenados no objeto função, não no objeto código (porque eles representam os valores calculados em tempo de execução). Ao contrário dos objetos função, os objetos código são imutáveis e não contêm referências (direta ou indiretamente) a objetos mutáveis.

source: The function name
pt_br: O nome da função

source: The fully qualified function name
pt_br: O nome completo da função

source: The total number of positional :term:`parameters <parameter>` (including positional-only parameters and parameters with default values) that the function has
pt_br: O número total de :term:`parâmetros <parameter>` posicionais (incluindo parâmetros somente-posicionais e parâmetros com valores padrão) que a função possui

source: The number of positional-only :term:`parameters <parameter>` (including arguments with default values) that the function has
pt_br: O número de :term:`parâmetros <parameter>` somente-posicionais (incluindo argumentos com valores padrão) que a função possui

source: The number of keyword-only :term:`parameters <parameter>` (including arguments with default values) that the function has
pt_br: O número de :term:`parâmetros <parameter>` somente-nomeados (incluindo argumentos com valores padrão) que a função possui

source: The number of :ref:`local variables <naming>` used by the function (including parameters)
pt_br: O número de :ref:`variáveis locais <naming>` usadas pela função (incluindo parâmetros)

source: A :class:`tuple` containing the names of the local variables in the function (starting with the parameter names)
pt_br: Uma :class:`tuple` contendo os nomes das variáveis locais na função (começando com os nomes dos parâmetros)

source: A :class:`tuple` containing the names of :ref:`local variables <naming>` that are referenced from at least one :term:`nested scope` inside the function
pt_br: Uma :class:`tuple` contendo os nomes de :ref:`variáveis locais <naming>` que são referenciadas a partir de pelo menos um :term:`escopo aninhado` de dentro da função

source: A :class:`tuple` containing the names of :term:`free (closure) variables <closure variable>` that a :term:`nested scope` references in an outer scope. See also :attr:`function.__closure__`.
pt_br: Uma :class:`tuple` contendo os nomes de :term:`variáveis livres (de clausura) <closure variable>` que um :term:`escopo aninhado` referencia em um escopo externo. Veja também :attr:`function.__closure__`.

source: Note: references to global and builtin names are *not* included.
pt_br: Observação: referências a nomes globais e embutidos *não* estão incluídas.

source: A string representing the sequence of :term:`bytecode` instructions in the function
pt_br: Uma string representando a sequência de instruções :term:`bytecode` na função

source: A :class:`tuple` containing the literals used by the :term:`bytecode` in the function
pt_br: Um :class:`tuple` contendo os literais usados pelo :term:`bytecode` na função

source: A :class:`tuple` containing the names used by the :term:`bytecode` in the function
pt_br: Um :class:`tuple` contendo os nomes usados pelo :term:`bytecode` na função

source: The name of the file from which the code was compiled
pt_br: O nome do arquivo do qual o código foi compilado

source: The line number of the first line of the function
pt_br: O número da linha da primeira linha da função

source: A string encoding the mapping from :term:`bytecode` offsets to line numbers. For details, see the source code of the interpreter.
pt_br: Uma string que codifica o mapeamento de :term:`bytecode` compensa para números de linha. Para obter detalhes, consulte o código-fonte do interpretador.

source: This attribute of code objects is deprecated, and may be removed in Python 3.15.
pt_br: Este atributo de objetos código está descontinuado e pode ser removido no Python 3.15.

source: The required stack size of the code object
pt_br: O tamanho de pilha necessário do objeto código

source: An :class:`integer <int>` encoding a number of flags for the interpreter.
pt_br: Um número :class:`inteiro <int>` codificando uma série de sinalizadores para o interpretador.

source: The following flag bits are defined for :attr:`~codeobject.co_flags`: bit ``0x04`` is set if the function uses the ``*arguments`` syntax to accept an arbitrary number of positional arguments; bit ``0x08`` is set if the function uses the ``**keywords`` syntax to accept arbitrary keyword arguments; bit ``0x20`` is set if the function is a generator. See :ref:`inspect-module-co-flags` for details on the semantics of each flags that might be present.
pt_br: Os seguintes bits sinalizadores são definidos para :attr:`~codeobject.co_flags`: o bit ``0x04`` é definido se a função usa a sintaxe ``*arguments`` para aceitar um número arbitrário de argumentos posicionais; o bit ``0x08`` é definido se a função usa a sintaxe ``**keywords`` para aceitar argumentos nomeados arbitrários; o bit ``0x20`` é definido se a função for um gerador. Veja :ref:`inspect-module-co-flags` para detalhes na semântica de cada sinalizadores que podem estar presentes.

source: Future feature declarations (for example, ``from __future__ import division``) also use bits in :attr:`~codeobject.co_flags` to indicate whether a code object was compiled with a particular feature enabled. See :attr:`~__future__._Feature.compiler_flag`.
pt_br: Declarações de recursos futuros (por exemplo, ``from __future__ import division``) também usam bits em :attr:`~codeobject.co_flags` para indicar se um objeto código foi compilado com um recurso específico habilitado. Veja :attr:`~__future__._Feature.compiler_flag`.

source: Other bits in :attr:`~codeobject.co_flags` are reserved for internal use.
pt_br: Outros bits em :attr:`~codeobject.co_flags` são reservados para uso interno.

source: If a code object represents a function, the first item in :attr:`~codeobject.co_consts` is the documentation string of the function, or ``None`` if undefined.
pt_br: Se um objeto código representa uma função, o primeiro item em :attr:`~codeobject.co_consts` é a string de documentação da função, ou ``None`` se indefinido.

source: Methods on code objects
pt_br: Métodos de objetos código

source: Returns an iterable over the source code positions of each :term:`bytecode` instruction in the code object.
pt_br: Retorna um iterável das posições no código-fonte de cada instrução :term:`bytecode` no objeto código.

source: The iterator returns :class:`tuple`\s containing the ``(start_line, end_line, start_column, end_column)``. The *i-th* tuple corresponds to the position of the source code that compiled to the *i-th* code unit. Column information is 0-indexed utf-8 byte offsets on the given source line.
pt_br: O iterador retorna :class:`tuple`\s contendo ``(start_line, end_line, start_column, end_column)``. A *i-nésima* tupla corresponde à posição do código-fonte que compilou para a *i-nésima* unidade de código. As informações da coluna são deslocamentos de bytes utf-8 indexados em 0 na linha de código fornecida.

source: This positional information can be missing. A non-exhaustive lists of cases where this may happen:
pt_br: A informação posicional pode estar ausente. Veja uma lista não-exaustiva de casos onde isso pode acontecer:

source: Running the interpreter with :option:`-X` ``no_debug_ranges``.
pt_br: Executando o interpretador com ``no_debug_ranges`` :option:`-X`.

source: Loading a pyc file compiled while using :option:`-X` ``no_debug_ranges``.
pt_br: Carregando um arquivo pyc compilado com ``no_debug_ranges`` :option:`-X`.

source: Position tuples corresponding to artificial instructions.
pt_br: Tuplas posicionais correspondendo a instruções artificiais.

source: Line and column numbers that can't be represented due to implementation specific limitations.
pt_br: Números de linha e coluna que não podem ser representados devido a limitações específicas de implementação.

source: When this occurs, some or all of the tuple elements can be :const:`None`.
pt_br: Quando isso ocorre, alguns ou todos elementos da tupla podem ser :const:`None`.

source: This feature requires storing column positions in code objects which may result in a small increase of disk usage of compiled Python files or interpreter memory usage. To avoid storing the extra information and/or deactivate printing the extra traceback information, the :option:`-X` ``no_debug_ranges`` command line flag or the :envvar:`PYTHONNODEBUGRANGES` environment variable can be used.
pt_br: Esse recurso requer o armazenamento de posições de coluna no objeto código, o que pode resultar em um pequeno aumento no uso de memória do interpretador e no uso de disco para arquivos Python compilados. Para evitar armazenar as informações extras e/ou desativar a exibição das informações extras de rastreamento, use a opção de linha de comando ``no_debug_ranges`` :option:`-X` ou a variável de ambiente :envvar:`PYTHONNODEBUGRANGES`.
