Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: A string is a sequence of values that represent Unicode code points. All the code points in the range ``U+0000 - U+10FFFF`` can be represented in a string. Python doesn't have a :c:expr:`char` type; instead, every code point in the string is represented as a string object with length ``1``. The built-in function :func:`ord` converts a code point from its string form to an integer in the range ``0 - 10FFFF``; :func:`chr` converts an integer in the range ``0 - 10FFFF`` to the corresponding length ``1`` string object. :meth:`str.encode` can be used to convert a :class:`str` to :class:`bytes` using the given text encoding, and :meth:`bytes.decode` can be used to achieve the opposite.
pt_br: Uma string é uma sequência de valores que representam pontos de código Unicode. Todos os pontos de código no intervalo ``U+0000 - U+10FFFF`` podem ser representados em uma string. Python não tem um tipo :c:expr:`char`; em vez disso, cada ponto de código na string é representado como um objeto string com comprimento ``1``. A função embutida :func:`ord` converte um ponto de código de sua forma de string para um inteiro no intervalo ``0 - 10FFFF``; :func:`chr` converte um inteiro no intervalo ``0 - 10FFFF`` para o objeto de string correspondente de comprimento ``1``. :meth:`str.encode` pode ser usado para converter uma :class:`str` para :class:`bytes` usando a codificação de texto fornecida, e :meth:`bytes.decode` pode ser usado para conseguir o oposto.

source: Tuples
pt_br: Tuplas

source: The items of a tuple are arbitrary Python objects. Tuples of two or more items are formed by comma-separated lists of expressions. A tuple of one item (a 'singleton') can be formed by affixing a comma to an expression (an expression by itself does not create a tuple, since parentheses must be usable for grouping of expressions). An empty tuple can be formed by an empty pair of parentheses.
pt_br: Os itens de uma tupla são objetos Python arbitrários. Tuplas de dois ou mais itens são formadas por listas de expressões separadas por vírgulas. Uma tupla de um item (um "singleton") pode ser formada afixando uma vírgula a uma expressão (uma expressão por si só não cria uma tupla, já que os parênteses devem ser usados para agrupamento de expressões). Uma tupla vazia pode ser formada por um par vazio de parênteses.

source: A bytes object is an immutable array. The items are 8-bit bytes, represented by integers in the range 0 <= x < 256. Bytes literals (like ``b'abc'``) and the built-in :func:`bytes` constructor can be used to create bytes objects. Also, bytes objects can be decoded to strings via the :meth:`~bytes.decode` method.
pt_br: Um objeto bytes é um vetor imutável. Os itens são bytes de 8 bits, representados por inteiros no intervalo 0 <= x < 256. Literais de bytes (como ``b'abc'``) e o construtor embutido :func:`bytes` podem ser usados para criar objetos bytes. Além disso, os objetos bytes podem ser decodificados em strings através do método :meth:`~bytes.decode`.

source: Mutable sequences
pt_br: Sequências mutáveis

source: Mutable sequences can be changed after they are created. The subscription and slicing notations can be used as the target of assignment and :keyword:`del` (delete) statements.
pt_br: As sequências mutáveis podem ser alteradas após serem criadas. As notações de subscrição e fatiamento podem ser usadas como o destino da atribuição e instruções :keyword:`del` (*delete*, exclusão).

source: The :mod:`collections` and :mod:`array` module provide additional examples of mutable sequence types.
pt_br: Os módulos :mod:`collections` e :mod:`array` fornecem exemplos adicionais de tipos de sequência mutáveis.

source: There are currently two intrinsic mutable sequence types:
pt_br: Atualmente, existem dois tipos de sequência mutável intrínseca:

source: Lists
pt_br: Listas

source: The items of a list are arbitrary Python objects. Lists are formed by placing a comma-separated list of expressions in square brackets. (Note that there are no special cases needed to form lists of length 0 or 1.)
pt_br: Os itens de uma lista são objetos Python arbitrários. As listas são formadas colocando uma lista de expressões separada por vírgulas entre colchetes. (Observe que não há casos especiais necessários para formar listas de comprimento 0 ou 1.)

source: Byte Arrays
pt_br: Vetores de bytes

source: A bytearray object is a mutable array. They are created by the built-in :func:`bytearray` constructor. Aside from being mutable (and hence unhashable), byte arrays otherwise provide the same interface and functionality as immutable :class:`bytes` objects.
pt_br: Um objeto bytearray é um vetor mutável. Eles são criados pelo construtor embutido :func:`bytearray`. Além de serem mutáveis (e, portanto, não-hasheável), os vetores de bytes fornecem a mesma interface e funcionalidade que os objetos imutáveis :class:`bytes`.

source: Set types
pt_br: Tipos de conjuntos

source: These represent unordered, finite sets of unique, immutable objects. As such, they cannot be indexed by any subscript. However, they can be iterated over, and the built-in function :func:`len` returns the number of items in a set. Common uses for sets are fast membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference.
pt_br: Estes representam conjuntos finitos e não ordenados de objetos únicos e imutáveis. Como tal, eles não podem ser indexados por nenhum subscrito. No entanto, eles podem ser iterados, e a função embutida :func:`len` retorna o número de itens em um conjunto. Os usos comuns para conjuntos são testes rápidos de associação, remoção de duplicatas de uma sequência e computação de operações matemáticas como interseção, união, diferença e diferença simétrica.

source: For set elements, the same immutability rules apply as for dictionary keys. Note that numeric types obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``), only one of them can be contained in a set.
pt_br: Para elementos de conjunto, as mesmas regras de imutabilidade se aplicam às chaves de dicionário. Observe que os tipos numéricos obedecem às regras normais para comparação numérica: se dois números forem iguais (por exemplo, ``1`` e ``1.0``), apenas um deles pode estar contido em um conjunto.

source: There are currently two intrinsic set types:
pt_br: Atualmente, existem dois tipos de conjuntos intrínsecos:

source: Sets
pt_br: Conjuntos

source: These represent a mutable set. They are created by the built-in :func:`set` constructor and can be modified afterwards by several methods, such as :meth:`~set.add`.
pt_br: Estes representam um conjunto mutável. Eles são criados pelo construtor embutido :func:`set` e podem ser modificados posteriormente por vários métodos, como :meth:`~set.add`.

source: Frozen sets
pt_br: Conjuntos congelados

source: These represent an immutable set. They are created by the built-in :func:`frozenset` constructor. As a frozenset is immutable and :term:`hashable`, it can be used again as an element of another set, or as a dictionary key.
pt_br: Estes representam um conjunto imutável. Eles são criados pelo construtor embutido :func:`frozenset`. Como um frozenset é imutável e :term:`hasheável <hashable>`, ele pode ser usado novamente como um elemento de outro conjunto, ou como uma chave de dicionário.

source: Mappings
pt_br: Mapeamentos

source: These represent finite sets of objects indexed by arbitrary index sets. The subscript notation ``a[k]`` selects the item indexed by ``k`` from the mapping ``a``; this can be used in expressions and as the target of assignments or :keyword:`del` statements. The built-in function :func:`len` returns the number of items in a mapping.
pt_br: Eles representam conjuntos finitos de objetos indexados por conjuntos de índices arbitrários. A notação subscrito ``a[k]`` seleciona o item indexado por ``k`` do mapeamento ``a``; isso pode ser usado em expressões e como alvo de atribuições ou instruções :keyword:`del`. A função embutida :func:`len` retorna o número de itens em um mapeamento.

source: There is currently a single intrinsic mapping type:
pt_br: Atualmente, há um único tipo de mapeamento intrínseco:

source: Dictionaries
pt_br: Dicionários

source: These represent finite sets of objects indexed by nearly arbitrary values. The only types of values not acceptable as keys are values containing lists or dictionaries or other mutable types that are compared by value rather than by object identity, the reason being that the efficient implementation of dictionaries requires a key's hash value to remain constant. Numeric types used for keys obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``) then they can be used interchangeably to index the same dictionary entry.
pt_br: Eles representam conjuntos finitos de objetos indexados por valores quase arbitrários. Os únicos tipos de valores não aceitáveis como chaves são os valores que contêm listas ou dicionários ou outros tipos mutáveis que são comparados por valor em vez de por identidade de objeto, o motivo é que a implementação eficiente de dicionários requer que o valor de hash de uma chave permaneça constante. Os tipos numéricos usados para chaves obedecem às regras normais para comparação numérica: se dois números forem iguais (por exemplo, ``1`` e ``1.0``), eles podem ser usados alternadamente para indexar a mesma entrada do dicionário.

source: Dictionaries preserve insertion order, meaning that keys will be produced in the same order they were added sequentially over the dictionary. Replacing an existing key does not change the order, however removing a key and re-inserting it will add it to the end instead of keeping its old place.
pt_br: Dicionários preservam a ordem de inserção, o que significa que as chaves serão produzidas na mesma ordem em que foram adicionadas sequencialmente no dicionário. Substituir uma chave existente não altera a ordem, no entanto, remover uma chave e inseri-la novamente irá adicioná-la ao final em vez de manter seu lugar anterior.

source: Dictionaries are mutable; they can be created by the ``{}`` notation (see section :ref:`dict`).
pt_br: Os dicionários são mutáveis; eles podem ser criados pela notação ``{}`` (veja a seção :ref:`dict`).

source: The extension modules :mod:`dbm.ndbm` and :mod:`dbm.gnu` provide additional examples of mapping types, as does the :mod:`collections` module.
pt_br: Os módulos de extensão :mod:`dbm.ndbm` e :mod:`dbm.gnu` fornecem exemplos adicionais de tipos de mapeamento, assim como o módulo :mod:`collections`.

source: Dictionaries did not preserve insertion order in versions of Python before 3.6. In CPython 3.6, insertion order was preserved, but it was considered an implementation detail at that time rather than a language guarantee.
pt_br: Dicionários não preservavam a ordem de inserção nas versões do Python anteriores à 3.6. No CPython 3.6, a ordem de inserção foi preservada, mas foi considerada um detalhe de implementação naquela época, em vez de uma garantia da linguagem.

source: Callable types
pt_br: Tipos chamáveis

source: These are the types to which the function call operation (see section :ref:`calls`) can be applied:
pt_br: Estes são os tipos aos quais a operação de chamada de função (veja a seção :ref:`calls`) pode ser aplicada:

source: User-defined functions
pt_br: Funções definidas pelo usuário

source: A user-defined function object is created by a function definition (see section :ref:`function`). It should be called with an argument list containing the same number of items as the function's formal parameter list.
pt_br: Um objeto função definido pelo usuário será criado pela definição de função (veja a seção :ref:`function`). A mesma deverá ser invocada com uma lista de argumentos contendo o mesmo número de itens que a lista de parâmetros formais da função.

source: Special read-only attributes
pt_br: Atributos especiais de somente leitura

source: Attribute
pt_br: Atributo

source: Meaning
pt_br: Significado

source: A reference to the :class:`dictionary <dict>` that holds the function's :ref:`global variables <naming>` -- the global namespace of the module in which the function was defined.
pt_br: Uma referência ao :class:`dicionário <dict>` que contém as :ref:`variáveis globais <naming>` da função -- o espaço de nomes global do módulo no qual a função foi definida.

source: ``None`` or a :class:`tuple` of cells that contain bindings for the names specified in the :attr:`~codeobject.co_freevars` attribute of the function's :attr:`code object <function.__code__>`.
pt_br: ``None`` ou uma :class:`tuple` de células que contêm ligação para os nomes especificados no atributo :attr:`~codeobject.co_freevars` do :attr:`objeto código <function.__code__>` da função.

source: A cell object has the attribute ``cell_contents``. This can be used to get the value of the cell, as well as set the value.
pt_br: Um objeto de célula tem o atributo ``cell_contents``. Isso pode ser usado para obter o valor da célula, bem como definir o valor.

source: Special writable attributes
pt_br: Atributos especiais graváveis

source: Most of these attributes check the type of the assigned value:
pt_br: A maioria desses atributos verifica o tipo do valor atribuído:

source: The function's documentation string, or ``None`` if unavailable.
pt_br: A string de documentação da função, ou ``None`` se indisponível.

source: The function's name. See also: :attr:`__name__ attributes <definition.__name__>`.
pt_br: O nome da função. Veja também: :attr:`atributos __name__ <definition.__name__>`.

source: The function's :term:`qualified name`. See also: :attr:`__qualname__ attributes <definition.__qualname__>`.
pt_br: O :term:`nome qualificado` da função. Veja também: :attr:`atributos __qualname__ <definition.__qualname__>`.

source: The name of the module the function was defined in, or ``None`` if unavailable.
pt_br: O nome do módulo em que a função foi definida ou ``None`` se indisponível.

source: A :class:`tuple` containing default :term:`parameter` values for those parameters that have defaults, or ``None`` if no parameters have a default value.
pt_br: Uma :class:`tuple` contendo valores de :term:`parâmetro` padrão para aqueles parâmetros que possuem padrões, ou ``None`` se nenhum parâmetro tiver um valor padrão.

source: The :ref:`code object <code-objects>` representing the compiled function body.
pt_br: O :ref:`objeto código <code-objects>` que representa o corpo da função compilada.

source: The namespace supporting arbitrary function attributes. See also: :attr:`__dict__ attributes <object.__dict__>`.
pt_br: O espaço de nomes que provvê atributos de função arbitrários. Veja também: :attr:`atributos __dict__ <object.__dict__>`.

source: A :class:`dictionary <dict>` containing annotations of :term:`parameters <parameter>`. The keys of the dictionary are the parameter names, and ``'return'`` for the return annotation, if provided. See also: :ref:`annotations-howto`.
pt_br: Um :class:`dicionário <dict>` contendo anotações de :term:`parâmetros <parâmetro>`. As chaves do dicionário são os nomes dos parâmetros e ``'return'`` para a anotação de retorno, se fornecida. Veja também: :ref:`annotations-howto`.

source: A :class:`dictionary <dict>` containing defaults for keyword-only :term:`parameters <parameter>`.
pt_br: Um :class:`dicionário <dict>` contendo padrões apenas para :term:`parâmetros <parâmetro>` somente-nomeados.

source: A :class:`tuple` containing the :ref:`type parameters <type-params>` of a :ref:`generic function <generic-functions>`.
pt_br: Uma :class:`tuple` contendo os :ref:`parâmetros de tipo <type-params>` de uma :ref:`função genérica <generic-functions>`.

source: Function objects also support getting and setting arbitrary attributes, which can be used, for example, to attach metadata to functions. Regular attribute dot-notation is used to get and set such attributes.
pt_br: Os objetos de função também dão suporte à obtenção e definição de atributos arbitrários, que podem ser usados, por exemplo, para anexar metadados a funções. A notação de ponto de atributo regular é usada para obter e definir tais atributos.

source: CPython's current implementation only supports function attributes on user-defined functions. Function attributes on :ref:`built-in functions <builtin-functions>` may be supported in the future.
pt_br: A implementação atual do CPython provê apenas atributos de função em funções definidas pelo usuário. Atributos de função em :ref:`funções embutido <builtin-functions>` podem ser suportados no futuro.

source: Additional information about a function's definition can be retrieved from its :ref:`code object <code-objects>` (accessible via the :attr:`~function.__code__` attribute).
pt_br: Informações adicionais sobre a definição de uma função podem ser obtidas de seu :ref:`objeto código <code-objects>` (acessível através do atributo :attr:`~function.__code__`).

source: Instance methods
pt_br: Métodos de instância

source: An instance method object combines a class, a class instance and any callable object (normally a user-defined function).
pt_br: Um objeto método de instância combina uma classe, uma instância de classe e qualquer objeto chamável (normalmente uma função definida pelo usuário).

source: Special read-only attributes:
pt_br: Atributos especiais de somente leitura:

source: Refers to the class instance object to which the method is :ref:`bound <method-binding>`
pt_br: Refere-se ao objeto instância da classe ao qual o método é :ref:`vinculado <method-binding>`

source: Refers to the original :ref:`function object <user-defined-funcs>`
pt_br: Refere-se ao :ref:`objeto função <user-defined-funcs>` original

source: The method's documentation (same as :attr:`method.__func__.__doc__ <function.__doc__>`). A :class:`string <str>` if the original function had a docstring, else ``None``.
pt_br: A documentação do método (igual a :attr:`method.__func__.__doc__ <function.__doc__>`). Um :class:`string <str>` se a função original tivesse uma docstring, caso contrário ``None``.

source: The name of the method (same as :attr:`method.__func__.__name__ <function.__name__>`)
pt_br: O nome do método (mesmo que :attr:`method.__func__.__name__ <function.__name__>`)

source: The name of the module the method was defined in, or ``None`` if unavailable.
pt_br: O nome do módulo em que o método foi definido ou ``None`` se indisponível.

source: Methods also support accessing (but not setting) the arbitrary function attributes on the underlying :ref:`function object <user-defined-funcs>`.
pt_br: Os métodos também implementam o acesso (mas não a configuração) dos atributos arbitrários da função no :ref:`objeto função <user-defined-funcs>` subjacente.

source: User-defined method objects may be created when getting an attribute of a class (perhaps via an instance of that class), if that attribute is a user-defined :ref:`function object <user-defined-funcs>` or a :class:`classmethod` object.
pt_br: Objetos método definidos pelo usuário podem ser criados ao obter um atributo de uma classe (talvez através de uma instância dessa classe), se esse atributo for um :ref:`objeto função <user-defined-funcs>` definido pelo usuário ou um objeto :class:`classmethod` .

source: When an instance method object is created by retrieving a user-defined :ref:`function object <user-defined-funcs>` from a class via one of its instances, its :attr:`~method.__self__` attribute is the instance, and the method object is said to be *bound*. The new method's :attr:`~method.__func__` attribute is the original function object.
pt_br: Quando um objeto método de instância é criado recuperando um :ref:`objeto função <user-defined-funcs>` definido pelo usuário de uma classe por meio de uma de suas instâncias, seu atributo :attr:`~method.__self__` é a instância, e o objeto método é considerado *vinculado*. O atributo :attr:`~method.__func__` do novo método é o objeto da função original.

source: When an instance method object is created by retrieving a :class:`classmethod` object from a class or instance, its :attr:`~method.__self__` attribute is the class itself, and its :attr:`~method.__func__` attribute is the function object underlying the class method.
pt_br: Quando um objeto método de instância é criado obtendo um objeto :class:`classmethod` de uma classe ou instância, seu atributo :attr:`~method.__self__` é a própria classe, e seu atributo :attr:`~method.__func__` é o objeto função subjacente ao método de classe.

source: When an instance method object is called, the underlying function (:attr:`~method.__func__`) is called, inserting the class instance (:attr:`~method.__self__`) in front of the argument list. For instance, when :class:`!C` is a class which contains a definition for a function :meth:`!f`, and ``x`` is an instance of :class:`!C`, calling ``x.f(1)`` is equivalent to calling ``C.f(x, 1)``.
pt_br: Quando um objeto método de instância é chamado, a função subjacente (:attr:`~method.__func__`) é chamada, inserindo a instância de classe (:attr:`~method.__self__`) na frente da lista de argumentos. Por exemplo, quando :class:`!C` é uma classe que contém uma definição para uma função :meth:`!f`, e ``x`` é uma instância de :class:`!C`, chamando ``x.f(1)`` é equivalente a chamar ``C.f(x, 1)``.

source: When an instance method object is derived from a :class:`classmethod` object, the "class instance" stored in :attr:`~method.__self__` will actually be the class itself, so that calling either ``x.f(1)`` or ``C.f(1)`` is equivalent to calling ``f(C,1)`` where ``f`` is the underlying function.
pt_br: Quando um objeto método de instância é derivado de um objeto :class:`classmethod`, a "instância de classe" armazenada em :attr:`~method.__self__` será, na verdade, a própria classe, de modo que chamar ``x.f(1)`` ou ``C.f(1)`` é equivalente a chamar ``f(C,1)`` sendo ``f`` a função subjacente.

source: It is important to note that user-defined functions which are attributes of a class instance are not converted to bound methods; this *only* happens when the function is an attribute of the class.
pt_br: É importante observar que funções definidas pelo usuário que são atributos de uma instância de classe não são convertidas em métodos vinculados; isso *somente* acontece quando a função é um atributo da classe.

source: Generator functions
pt_br: Funções geradoras

source: A function or method which uses the :keyword:`yield` statement (see section :ref:`yield`) is called a :dfn:`generator function`. Such a function, when called, always returns an :term:`iterator` object which can be used to execute the body of the function: calling the iterator's :meth:`iterator.__next__` method will cause the function to execute until it provides a value using the :keyword:`!yield` statement. When the function executes a :keyword:`return` statement or falls off the end, a :exc:`StopIteration` exception is raised and the iterator will have reached the end of the set of values to be returned.
pt_br: Uma função ou método que usa a instrução :keyword:`yield` (veja a seção :ref:`yield`) é chamada de :dfn:`função geradora`. Tal função, quando chamada, sempre retorna um objeto :term:`iterator` que pode ser usado para executar o corpo da função: chamar o método :meth:`iterator.__next__` do iterador fará com que a função seja executada até que forneça um valor usando a instrução :keyword:`!yield`. Quando a função executa uma instrução :keyword:`return` ou sai do fim, uma exceção :exc:`StopIteration` é levantada e o iterador terá alcançado o fim do conjunto de valores a serem retornados.

source: Coroutine functions
pt_br: Funções de corrotina
