Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: Called to implement truth value testing and the built-in operation ``bool()``; should return ``False`` or ``True``. When this method is not defined, :meth:`~object.__len__` is called, if it is defined, and the object is considered true if its result is nonzero. If a class defines neither :meth:`!__len__` nor :meth:`!__bool__` (which is true of the :class:`object` class itself), all its instances are considered true.
pt_br: Chamado para implementar o teste de valor verdade e a operação embutida ``bool()``; deve retornar ``False`` ou ``True``. Quando este método não é definido, :meth:`~object.__len__` é chamado, se estiver definido, e o objeto é considerado verdadeiro se seu resultado for diferente de zero. Se uma classe não define :meth:`!__len__` nem :meth:`!__bool__` (o que é verdadeiro da classe :class:`object` em si), todas as suas instâncias são consideradas verdadeiras.

source: Customizing attribute access
pt_br: Personalizando o acesso aos atributos

source: The following methods can be defined to customize the meaning of attribute access (use of, assignment to, or deletion of ``x.name``) for class instances.
pt_br: Os seguintes métodos podem ser definidos para personalizar o significado do acesso aos atributos (uso, atribuição ou exclusão de ``x.name``) para instâncias de classe.

source: Called when the default attribute access fails with an :exc:`AttributeError` (either :meth:`__getattribute__` raises an :exc:`AttributeError` because *name* is not an instance attribute or an attribute in the class tree for ``self``; or :meth:`__get__` of a *name* property raises :exc:`AttributeError`). This method should either return the (computed) attribute value or raise an :exc:`AttributeError` exception. The :class:`object` class itself does not provide this method.
pt_br: Chamado quando o acesso padrão ao atributo falha com um :exc:`AttributeError` (ou :meth:`__getattribute__` levanta uma :exc:`AttributeError` porque *name* não é um atributo de instância ou um atributo na árvore de classes para ``self``; ou :meth:`__get__` de uma propriedade *name* levanta :exc:`AttributeError`). Este método deve retornar o valor do atributo (calculado) ou levantar uma exceção :exc:`AttributeError`. A classe :class:`object` em si não fornece este método.

source: Note that if the attribute is found through the normal mechanism, :meth:`__getattr__` is not called. (This is an intentional asymmetry between :meth:`__getattr__` and :meth:`__setattr__`.) This is done both for efficiency reasons and because otherwise :meth:`__getattr__` would have no way to access other attributes of the instance. Note that at least for instance variables, you can take total control by not inserting any values in the instance attribute dictionary (but instead inserting them in another object). See the :meth:`__getattribute__` method below for a way to actually get total control over attribute access.
pt_br: Observe que se o atributo for encontrado através do mecanismo normal, :meth:`__getattr__` não é chamado. (Esta é uma assimetria intencional entre :meth:`__getattr__` e :meth:`__setattr__`.) Isso é feito tanto por razões de eficiência quanto porque :meth:`__getattr__` não teria como acessar outros atributos da instância. Observe que pelo menos para variáveis de instâncias, você pode obter controle total não inserindo nenhum valor no dicionário de atributos de instância (mas, em vez disso, inserindo-os em outro objeto). Veja o método :meth:`__getattribute__` abaixo para uma maneira de realmente obter controle total sobre o acesso ao atributo.

source: Called unconditionally to implement attribute accesses for instances of the class. If the class also defines :meth:`__getattr__`, the latter will not be called unless :meth:`__getattribute__` either calls it explicitly or raises an :exc:`AttributeError`. This method should return the (computed) attribute value or raise an :exc:`AttributeError` exception. In order to avoid infinite recursion in this method, its implementation should always call the base class method with the same name to access any attributes it needs, for example, ``object.__getattribute__(self, name)``.
pt_br: Chamado incondicionalmente para implementar acessos a atributo para instâncias da classe. Se a classe também define :meth:`__getattr__`, o último não será chamado a menos que :meth:`__getattribute__` o chame explicitamente ou levante um :exc:`AttributeError`. Este método deve retornar o valor do atributo (calculado) ou levantar uma exceção :exc:`AttributeError`. Para evitar recursão infinita neste método, sua implementação deve sempre chamar o método da classe base com o mesmo nome para acessar quaisquer atributos de que necessita, por exemplo, ``object.__getattribute__(self, name)``.

source: This method may still be bypassed when looking up special methods as the result of implicit invocation via language syntax or :ref:`built-in functions <builtin-functions>`. See :ref:`special-lookup`.
pt_br: Este método ainda pode ser ignorado ao procurar métodos especiais como resultado de invocação implícita por meio da sintaxe da linguagem ou :ref:`built-in functions <builtin-functions>`. Consulte :ref:`special-lookup`.

source: For certain sensitive attribute accesses, raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``name``.
pt_br: Para acessos a certos atributos sensíveis, levanta um :ref:`evento de auditoria <auditing>` ``object.__getattr__`` com os argumentos ``obj`` e ``name``.

source: Called when an attribute assignment is attempted. This is called instead of the normal mechanism (i.e. store the value in the instance dictionary). *name* is the attribute name, *value* is the value to be assigned to it.
pt_br: Chamado quando se tenta efetuar uma atribuição de atributos. Esse método é chamado em vez do mecanismo normal (ou seja, armazena o valor no dicionário da instância). *name* é o nome do atributo, *value* é o valor a ser atribuído a ele.

source: If :meth:`__setattr__` wants to assign to an instance attribute, it should call the base class method with the same name, for example, ``object.__setattr__(self, name, value)``.
pt_br: Se :meth:`__setattr__` deseja atribuir a um atributo de instância, ele deve chamar o método da classe base com o mesmo nome, por exemplo, ``object.__setattr__(self, name, value)``.

source: For certain sensitive attribute assignments, raises an :ref:`auditing event <auditing>` ``object.__setattr__`` with arguments ``obj``, ``name``, ``value``.
pt_br: Para atribuições de certos atributos sensíveis, levanta um :ref:`evento de auditoria <auditing>` ``object.__setattr__`` com os argumentos ``obj``, ``name`` e ``value``.

source: Like :meth:`__setattr__` but for attribute deletion instead of assignment. This should only be implemented if ``del obj.name`` is meaningful for the object.
pt_br: Como :meth:`__setattr__`, mas para exclusão de atributo em vez de atribuição. Este método só deve ser implementado se ``del obj.name`` for significativo para o objeto.

source: For certain sensitive attribute deletions, raises an :ref:`auditing event <auditing>` ``object.__delattr__`` with arguments ``obj`` and ``name``.
pt_br: Para exclusões a certos atributos sensíveis, levanta um :ref:`evento de auditoria <auditing>` ``object.__delattr__`` com os argumentos ``obj`` e ``name``.

source: Called when :func:`dir` is called on the object. An iterable must be returned. :func:`dir` converts the returned iterable to a list and sorts it.
pt_br: Chamado quando :func:`dir` é chamado com o objeto como argumento. Um iterável deve ser retornada. :func:`dir` converte o iterável retornado em uma lista e o ordena.

source: Customizing module attribute access
pt_br: Personalizando acesso a atributos de módulos

source: Special names ``__getattr__`` and ``__dir__`` can be also used to customize access to module attributes. The ``__getattr__`` function at the module level should accept one argument which is the name of an attribute and return the computed value or raise an :exc:`AttributeError`. If an attribute is not found on a module object through the normal lookup, i.e. :meth:`object.__getattribute__`, then ``__getattr__`` is searched in the module ``__dict__`` before raising an :exc:`AttributeError`. If found, it is called with the attribute name and the result is returned.
pt_br: Os nomes especiais ``__getattr__`` e ``__dir__`` também podem ser usados para personalizar o acesso aos atributos dos módulos. A função ``__getattr__`` no nível do módulo deve aceitar um argumento que é o nome de um atributo e retornar o valor calculado ou levantar uma exceção :exc:`AttributeError`. Se um atributo não for encontrado em um objeto de módulo por meio da pesquisa normal, por exemplo :meth:`object.__getattribute__`, então ``__getattr__`` é pesquisado no módulo ``__dict__`` antes de levantar :exc:`AttributeError`. Se encontrado, ele é chamado com o nome do atributo e o resultado é retornado.

source: The ``__dir__`` function should accept no arguments, and return an iterable of strings that represents the names accessible on module. If present, this function overrides the standard :func:`dir` search on a module.
pt_br: A função ``__dir__`` não deve aceitar nenhum argumento e retorna um iterável de strings que representa os nomes acessíveis no módulo. Se presente, esta função substitui a pesquisa padrão :func:`dir` em um módulo.

source: For a more fine grained customization of the module behavior (setting attributes, properties, etc.), one can set the ``__class__`` attribute of a module object to a subclass of :class:`types.ModuleType`. For example::
pt_br: Para uma personalização mais refinada do comportamento do módulo (definição de atributos, propriedades etc.), pode-se definir o atributo ``__class__`` de um objeto de módulo para uma subclasse de :class:`types.ModuleType`. Por exemplo::

source: Defining module ``__getattr__`` and setting module ``__class__`` only affect lookups made using the attribute access syntax -- directly accessing the module globals (whether by code within the module, or via a reference to the module's globals dictionary) is unaffected.
pt_br: Definir ``__getattr__`` no módulo e configurar o ``__class__`` do módulo só afeta as pesquisas feitas usando a sintaxe de acesso ao atributo -- acessar diretamente os globais do módulo (seja por código dentro do módulo, ou por meio de uma referência ao dicionário global do módulo) não tem efeito.

source: ``__class__`` module attribute is now writable.
pt_br: O atributo de módulo ``__class__`` pode agora ser escrito.

source: ``__getattr__`` and ``__dir__`` module attributes.
pt_br: Atributos de módulo ``__getattr__`` e ``__dir__``.

source: :pep:`562` - Module __getattr__ and __dir__
pt_br: :pep:`562` - __getattr__ e __dir__ de módulo

source: Describes the ``__getattr__`` and ``__dir__`` functions on modules.
pt_br: Descreve as funções ``__getattr__`` e ``__dir__`` nos módulos.

source: Implementing Descriptors
pt_br: Implementando descritores

source: The following methods only apply when an instance of the class containing the method (a so-called *descriptor* class) appears in an *owner* class (the descriptor must be in either the owner's class dictionary or in the class dictionary for one of its parents). In the examples below, "the attribute" refers to the attribute whose name is the key of the property in the owner class' :attr:`~object.__dict__`. The :class:`object` class itself does not implement any of these protocols.
pt_br: Os métodos a seguir se aplicam apenas quando uma instância da classe que contém o método (uma classe chamada *descritora*) aparece em uma classe proprietária *owner* (o descritor deve estar no dicionário de classe do proprietário ou no dicionário de classe para um dos seus pais). Nos exemplos abaixo, "o atributo" refere-se ao atributo cujo nome é a chave da propriedade no :attr:`~object.__dict__` da classe proprietária. A classe :class:`object` em si não implementa quaisquer desses protocolos.

source: Called to get the attribute of the owner class (class attribute access) or of an instance of that class (instance attribute access). The optional *owner* argument is the owner class, while *instance* is the instance that the attribute was accessed through, or ``None`` when the attribute is accessed through the *owner*.
pt_br: Chamado para obter o atributo da classe proprietária (acesso ao atributo da classe) ou de uma instância dessa classe (acesso ao atributo da instância). O argumento opcional *owner* é a classe proprietária, enquanto *instance* é a instância pela qual o atributo foi acessado, ou ``None`` quando o atributo é acessado por meio de *owner*.

source: This method should return the computed attribute value or raise an :exc:`AttributeError` exception.
pt_br: Este método deve retornar o valor do atributo calculado ou levantar uma exceção :exc:`AttributeError`.

source: :PEP:`252` specifies that :meth:`__get__` is callable with one or two arguments. Python's own built-in descriptors support this specification; however, it is likely that some third-party tools have descriptors that require both arguments. Python's own :meth:`__getattribute__` implementation always passes in both arguments whether they are required or not.
pt_br: :PEP:`252` especifica que :meth:`__get__` é um chamável com um ou dois argumentos. Os próprios descritores embutidos do Python implementam esta especificação; no entanto, é provável que algumas ferramentas de terceiros tenham descritores que requerem ambos os argumentos. A implementação de :meth:`__getattribute__` do próprio Python sempre passa em ambos os argumentos sejam eles requeridos ou não.

source: Called to set the attribute on an instance *instance* of the owner class to a new value, *value*.
pt_br: Chamado para definir o atributo em uma instância *instance* da classe proprietária para um novo valor, *value*.

source: Note, adding :meth:`__set__` or :meth:`__delete__` changes the kind of descriptor to a "data descriptor". See :ref:`descriptor-invocation` for more details.
pt_br: Observe que adicionar :meth:`__set__` ou :meth:`__delete__` altera o tipo de descritor para um "descritor de dados". Consulte :ref:`descriptor-invocation` para mais detalhes.

source: Called to delete the attribute on an instance *instance* of the owner class.
pt_br: Chamado para excluir o atributo em uma instância *instance* da classe proprietária.

source: Instances of descriptors may also have the :attr:`!__objclass__` attribute present:
pt_br: Instâncias de descritores também podem ter o atributo :attr:`!__objclass__` presente:

source: The attribute :attr:`!__objclass__` is interpreted by the :mod:`inspect` module as specifying the class where this object was defined (setting this appropriately can assist in runtime introspection of dynamic class attributes). For callables, it may indicate that an instance of the given type (or a subclass) is expected or required as the first positional argument (for example, CPython sets this attribute for unbound methods that are implemented in C).
pt_br: O atributo :attr:`!__objclass__` é interpretado pelo módulo :mod:`inspect` como sendo a classe onde este objeto foi definido (configurar isso apropriadamente pode ajudar na introspecção em tempo de execução dos atributos dinâmicos da classe). Para chamáveis, pode indicar que uma instância do tipo fornecido (ou uma subclasse) é esperada ou necessária como o primeiro argumento posicional (por exemplo, CPython define este atributo para métodos não acoplados que são implementados em C).

source: Invoking Descriptors
pt_br: Invocando descritores

source: In general, a descriptor is an object attribute with "binding behavior", one whose attribute access has been overridden by methods in the descriptor protocol: :meth:`~object.__get__`, :meth:`~object.__set__`, and :meth:`~object.__delete__`. If any of those methods are defined for an object, it is said to be a descriptor.
pt_br: Em geral, um descritor é um atributo de objeto com "comportamento de ligação", cujo acesso ao atributo foi substituído por métodos no protocolo do descritor: :meth:`~object.__get__`, :meth:`~object.__set__` e :meth:`~object.__delete__`. Se qualquer um desses métodos for definido para um objeto, é considerado um descritor.

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the base classes of ``type(a)`` excluding metaclasses.
pt_br: O comportamento padrão para acesso ao atributo é obter, definir ou excluir o atributo do dicionário de um objeto. Por exemplo, ``a.x`` tem uma cadeia de pesquisa começando com ``a.__dict__['x']``, depois ``type(a).__dict__['x']``, e continunando pelas classes bases de ``type(a)`` excluindo metaclasses.

source: However, if the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined and how they were called.
pt_br: No entanto, se o valor pesquisado for um objeto que define um dos métodos do descritor, Python pode substituir o comportamento padrão e invocar o método do descritor. Onde isso ocorre na cadeia de precedência depende de quais métodos descritores foram definidos e como eles foram chamados.

source: The starting point for descriptor invocation is a binding, ``a.x``. How the arguments are assembled depends on ``a``:
pt_br: O ponto de partida para a invocação do descritor é uma ligação, ``a.x``. Como os argumentos são montados depende de ``a``:

source: Direct Call
pt_br: Chamada direta

source: The simplest and least common call is when user code directly invokes a descriptor method: ``x.__get__(a)``.
pt_br: A chamada mais simples e menos comum é quando o código do usuário invoca diretamente um método descritor: ``x.__get__(a)``.

source: Instance Binding
pt_br: Ligação de instâncias

source: If binding to an object instance, ``a.x`` is transformed into the call: ``type(a).__dict__['x'].__get__(a, type(a))``.
pt_br: Se estiver ligando a uma instância de objeto, ``a.x`` é transformado na chamada: ``type(a).__dict__['x'].__get__(a, type(a))``.

source: Class Binding
pt_br: Ligação de classes

source: If binding to a class, ``A.x`` is transformed into the call: ``A.__dict__['x'].__get__(None, A)``.
pt_br: Se estiver ligando a uma classe, ``A.x`` é transformado na chamada: ``A.__dict__['x'].__get__(None, A)``.

source: Super Binding
pt_br: Ligação de super

source: A dotted lookup such as ``super(A, a).x`` searches ``a.__class__.__mro__`` for a base class ``B`` following ``A`` and then returns ``B.__dict__['x'].__get__(a, A)``. If not a descriptor, ``x`` is returned unchanged.
pt_br: Uma pesquisa pontilhada, ou *dotted lookup*, como ``super(A, a).x`` procura ``a.__class__.__mro__`` por uma classe base ``B`` seguindo ``A`` e então retorna ``B.__dict__['x'].__get__(a, A)``. Se não for um descritor, ``x`` é retornado inalterado.

source: For instance bindings, the precedence of descriptor invocation depends on which descriptor methods are defined. A descriptor can define any combination of :meth:`~object.__get__`, :meth:`~object.__set__` and :meth:`~object.__delete__`. If it does not define :meth:`!__get__`, then accessing the attribute will return the descriptor object itself unless there is a value in the object's instance dictionary. If the descriptor defines :meth:`!__set__` and/or :meth:`!__delete__`, it is a data descriptor; if it defines neither, it is a non-data descriptor. Normally, data descriptors define both :meth:`!__get__` and :meth:`!__set__`, while non-data descriptors have just the :meth:`!__get__` method. Data descriptors with :meth:`!__get__` and :meth:`!__set__` (and/or :meth:`!__delete__`) defined always override a redefinition in an instance dictionary. In contrast, non-data descriptors can be overridden by instances.
pt_br: Para ligações de instâncias, a precedência de invocação do descritor depende de quais métodos do descritor são definidos. Um descritor pode definir qualquer combinação de :meth:`~object.__get__`, :meth:`~object.__set__` e :meth:`~object.__delete__`. Se ele não definir :meth:`!__get__`, então acessar o atributo retornará o próprio objeto descritor, a menos que haja um valor no dicionário de instância do objeto. Se o descritor define :meth:`!__set__` e/ou :meth:`!__delete__`, é um descritor de dados; se não definir nenhum, é um descritor sem dados. Normalmente, os descritores de dados definem :meth:`!__get__` e :meth:`!__set__`, enquanto os descritores sem dados têm apenas o método :meth:`!__get__`. Descritores de dados com :meth:`!__get__` e :meth:`!__set__` (e/ou :meth:`!__delete__`) definidos sempre substituem uma redefinição em um dicionário de instância. Em contraste, descritores sem dados podem ser substituídos por instâncias.

source: Python methods (including those decorated with :func:`@staticmethod <staticmethod>` and :func:`@classmethod <classmethod>`) are implemented as non-data descriptors. Accordingly, instances can redefine and override methods. This allows individual instances to acquire behaviors that differ from other instances of the same class.
pt_br: Os métodos Python (incluindo aqueles decorados com :func:`@staticmethod <staticmethod>` and :func:`@classmethod <classmethod>`) são implementados como descritores sem dados. Assim, as instâncias podem redefinir e substituir métodos. Isso permite que instâncias individuais adquiram comportamentos que diferem de outras instâncias da mesma classe.

source: The :func:`property` function is implemented as a data descriptor. Accordingly, instances cannot override the behavior of a property.
pt_br: A função :func:`property` é implementada como um descritor de dados. Da mesma forma, as instâncias não podem substituir o comportamento de uma propriedade.

source: *__slots__* allow us to explicitly declare data members (like properties) and deny the creation of :attr:`~object.__dict__` and *__weakref__* (unless explicitly declared in *__slots__* or available in a parent.)
pt_br: *__slots__* permite-nos declarar explicitamente membros de dados (como propriedades) e negar a criação de :attr:`~object.__dict__` e *__weakref__* (a menos que explicitamente declarado em *__slots__* ou disponível em uma classe base.)

source: The space saved over using :attr:`~object.__dict__` can be significant. Attribute lookup speed can be significantly improved as well.
pt_br: O espaço economizado com o uso de :attr:`~object.__dict__` pode ser significativo. A velocidade de pesquisa de atributos também pode ser significativamente melhorada.

source: This class variable can be assigned a string, iterable, or sequence of strings with variable names used by instances. *__slots__* reserves space for the declared variables and prevents the automatic creation of :attr:`~object.__dict__` and *__weakref__* for each instance.
pt_br: Esta variável de classe pode ser atribuída a uma string, iterável ou sequência de strings com nomes de variáveis usados por instâncias. *__slots__* reserva espaço para as variáveis declaradas e evita a criação automática de :attr:`~object.__dict__` e *__weakref__* para cada instância.

source: Notes on using *__slots__*:
pt_br: Observações ao uso de *__slots__*:

source: When inheriting from a class without *__slots__*, the :attr:`~object.__dict__` and *__weakref__* attribute of the instances will always be accessible.
pt_br: Ao herdar de uma classe sem *__slots__*, os atributos :attr:`~object.__dict__` e *__weakref__* das instâncias sempre estarão acessíveis.
