Repository: python/python-docs-pt-br
Catalog: reference/datamodel.po
Languages: pt_br

source: Data model
pt_br: Modelo de dados

source: Objects, values and types
pt_br: Objetos, valores e tipos

source: :dfn:`Objects` are Python's abstraction for data. All data in a Python program is represented by objects or by relations between objects. (In a sense, and in conformance to Von Neumann's model of a "stored program computer", code is also represented by objects.)
pt_br: :dfn:`Objetos` são abstrações do Python para dados. Todos os dados em um programa Python são representados por objetos ou por relações entre objetos. (De certo modo, e em conformidade com o modelo de Von Neumann de um "computador com programa armazenado", código também é representado por objetos.)

source: Every object has an identity, a type and a value. An object's *identity* never changes once it has been created; you may think of it as the object's address in memory. The :keyword:`is` operator compares the identity of two objects; the :func:`id` function returns an integer representing its identity.
pt_br: Todo objeto tem uma identidade, um tipo e um valor. A *identidade* de um objeto nunca muda depois de criado; você pode pensar nisso como endereço de objetos em memória. O operador :keyword:`is` compara as identidades de dois objetos; a função :func:`id` retorna um inteiro representando sua identidade.

source: For CPython, ``id(x)`` is the memory address where ``x`` is stored.
pt_br: Para CPython, ``id(x)`` é o endereço de memória em que ``x`` está armazenado.

source: An object's type determines the operations that the object supports (e.g., "does it have a length?") and also defines the possible values for objects of that type. The :func:`type` function returns an object's type (which is an object itself). Like its identity, an object's :dfn:`type` is also unchangeable. [#]_
pt_br: O tipo de um objeto determina as operações que o objeto implementa (por exemplo, "ele tem um comprimento?") e também define os valores possíveis para objetos desse tipo. A função :func:`type` retorna o tipo de um objeto (que é também um objeto). Como sua identidade, o :dfn:`tipo` do objeto também é imutável. [#]_

source: The *value* of some objects can change. Objects whose value can change are said to be *mutable*; objects whose value is unchangeable once they are created are called *immutable*. (The value of an immutable container object that contains a reference to a mutable object can change when the latter's value is changed; however the container is still considered immutable, because the collection of objects it contains cannot be changed. So, immutability is not strictly the same as having an unchangeable value, it is more subtle.) An object's mutability is determined by its type; for instance, numbers, strings and tuples are immutable, while dictionaries and lists are mutable.
pt_br: O *valor* de alguns objetos pode mudar. Objetos cujos valores podem mudar são descritos como *mutáveis*, objetos cujo valor não pode ser mudado uma vez que foram criados são chamados *imutáveis*. (O valor de um objeto contêiner imutável que contém uma referência a um objeto mutável pode mudar quando o valor deste último for mudado; no entanto o contêiner é ainda assim considerada imutável, pois a coleção de objetos que contém não pode ser mudada. Então a imutabilidade não é estritamente o mesmo do que não haver mudanças de valor, é mais sutil.) A mutabilidade de um objeto é determinada pelo seu tipo; por exemplo, números, strings e tuplas são imutáveis, enquanto dicionários e listas são mutáveis.

source: Objects are never explicitly destroyed; however, when they become unreachable they may be garbage-collected. An implementation is allowed to postpone garbage collection or omit it altogether --- it is a matter of implementation quality how garbage collection is implemented, as long as no objects are collected that are still reachable.
pt_br: Os objetos nunca são destruídos explicitamente; no entanto, quando eles se tornam inacessíveis, eles podem ser coletados como lixo. Uma implementação tem permissão para adiar a coleta de lixo ou omiti-la completamente -- é uma questão de detalhe de implementação como a coleta de lixo é implementada, desde que nenhum objeto que ainda esteja acessível seja coletado.

source: CPython currently uses a reference-counting scheme with (optional) delayed detection of cyclically linked garbage, which collects most objects as soon as they become unreachable, but is not guaranteed to collect garbage containing circular references. See the documentation of the :mod:`gc` module for information on controlling the collection of cyclic garbage. Other implementations act differently and CPython may change. Do not depend on immediate finalization of objects when they become unreachable (so you should always close files explicitly).
pt_br: CPython atualmente usa um esquema de contagem de referências com detecção atrasada (opcional) de lixo ligado ciclicamente, que coleta a maioria dos objetos assim que eles se tornam inacessíveis, mas não é garantido que coletará lixo contendo referências circulares. Veja a documentação do módulo :mod:`gc` para informações sobre como controlar a coleta de lixo cíclico. Outras implementações agem de forma diferente e o CPython pode mudar. Não dependa da finalização imediata dos objetos quando eles se tornarem inacessíveis (isto é, você deve sempre fechar os arquivos explicitamente).

source: Note that the use of the implementation's tracing or debugging facilities may keep objects alive that would normally be collectable. Also note that catching an exception with a :keyword:`try`...\ :keyword:`except` statement may keep objects alive.
pt_br: Observe que o uso dos recursos de rastreamento ou depuração da implementação pode manter os objetos ativos que normalmente seriam coletáveis. Observe também que capturar uma exceção com uma instrução :keyword:`try`...\ :keyword:`except` pode manter os objetos vivos.

source: Some objects contain references to "external" resources such as open files or windows. It is understood that these resources are freed when the object is garbage-collected, but since garbage collection is not guaranteed to happen, such objects also provide an explicit way to release the external resource, usually a :meth:`!close` method. Programs are strongly recommended to explicitly close such objects. The :keyword:`try`...\ :keyword:`finally` statement and the :keyword:`with` statement provide convenient ways to do this.
pt_br: Alguns objetos contêm referências a recursos "externos", como arquivos abertos ou janelas. Entende-se que esses recursos são liberados quando o objeto é coletado como lixo, mas como a coleta de lixo não é garantida, tais objetos também fornecem uma maneira explícita de liberar o recurso externo, geralmente um método :meth:`!close`. Os programas são fortemente recomendados para fechar explicitamente esses objetos. A instrução :keyword:`try`...\ :keyword:`finally` e a instrução :keyword:`with` fornecem maneiras convenientes de fazer isso.

source: Some objects contain references to other objects; these are called *containers*. Examples of containers are tuples, lists and dictionaries. The references are part of a container's value. In most cases, when we talk about the value of a container, we imply the values, not the identities of the contained objects; however, when we talk about the mutability of a container, only the identities of the immediately contained objects are implied. So, if an immutable container (like a tuple) contains a reference to a mutable object, its value changes if that mutable object is changed.
pt_br: Alguns objetos contêm referências a outros objetos; eles são chamados de *contêineres*. Exemplos de contêineres são tuplas, listas e dicionários. As referências fazem parte do valor de um contêiner. Na maioria dos casos, quando falamos sobre o valor de um contêiner, nos referimos aos valores, não às identidades dos objetos contidos; entretanto, quando falamos sobre a mutabilidade de um contêiner, apenas as identidades dos objetos contidos imediatamente estão implícitas. Portanto, se um contêiner imutável (como uma tupla) contém uma referência a um objeto mutável, seu valor muda se esse objeto mutável for alterado.

source: Types affect almost all aspects of object behavior. Even the importance of object identity is affected in some sense: for immutable types, operations that compute new values may actually return a reference to any existing object with the same type and value, while for mutable objects this is not allowed. For example, after ``a = 1; b = 1``, *a* and *b* may or may not refer to the same object with the value one, depending on the implementation. This is because :class:`int` is an immutable type, so the reference to ``1`` can be reused. This behaviour depends on the implementation used, so should not be relied upon, but is something to be aware of when making use of object identity tests. However, after ``c = []; d = []``, *c* and *d* are guaranteed to refer to two different, unique, newly created empty lists. (Note that ``e = f = []`` assigns the *same* object to both *e* and *f*.)
pt_br: Os tipos afetam quase todos os aspectos do comportamento do objeto. Até mesmo a importância da identidade do objeto é afetada em algum sentido: para tipos imutáveis, as operações que calculam novos valores podem realmente retornar uma referência a qualquer objeto existente com o mesmo tipo e valor, enquanto para objetos mutáveis isso não é permitido. Por exemplo, após ``a = 1; b = 1``, *a* e *b* podem ou não se referir ao mesmo objeto com o valor um, dependendo da implementação. Isto ocorre porque :class:`int` é um tipo imutável, então a referência a ``1`` pode ser reutilizada. Este comportamento depende da implementação usada, então não deve ser considerada confiável, mas é algo para se estar ciente ao fazer uso de testes de identidade de objeto. No entanto, após ``c = []; d = []``, *c* e *d* têm a garantia de referir-se a duas listas vazias diferentes e únicas. (Observe que ``e = f = []`` atribui o *mesmo* objeto para *e* e *f*.)

source: The standard type hierarchy
pt_br: A hierarquia de tipos padrão

source: Below is a list of the types that are built into Python. Extension modules (written in C, Java, or other languages, depending on the implementation) can define additional types. Future versions of Python may add types to the type hierarchy (e.g., rational numbers, efficiently stored arrays of integers, etc.), although such additions will often be provided via the standard library instead.
pt_br: Abaixo está uma lista dos tipos que são embutidos no Python. Módulos de extensão (escritos em C, Java ou outras linguagens, dependendo da implementação) podem definir tipos adicionais. Versões futuras do Python podem adicionar tipos à hierarquia de tipo (por exemplo, números racionais, matrizes de inteiros armazenadas de forma eficiente, etc.), embora tais adições sejam frequentemente fornecidas por meio da biblioteca padrão.

source: Some of the type descriptions below contain a paragraph listing 'special attributes.' These are attributes that provide access to the implementation and are not intended for general use. Their definition may change in the future.
pt_br: Algumas das descrições de tipo abaixo contêm um parágrafo listando "atributos especiais". Esses são atributos que fornecem acesso à implementação e não se destinam ao uso geral. Sua definição pode mudar no futuro.

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``None``. It is used to signify the absence of a value in many situations, e.g., it is returned from functions that don't explicitly return anything. Its truth value is false.
pt_br: Este tipo possui um único valor. Existe um único objeto com este valor. Este objeto é acessado através do nome embutido ``None``. É usado para significar a ausência de um valor em muitas situações, por exemplo, ele é retornado de funções que não retornam nada explicitamente. Seu valor verdade é falso.

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name :data:`NotImplemented`. Numeric methods and rich comparison methods should return this value if they do not implement the operation for the operands provided. (The interpreter will then try the reflected operation, or some other fallback, depending on the operator.) It should not be evaluated in a boolean context.
pt_br: Este tipo possui um único valor. Existe um único objeto com este valor. Este objeto é acessado através do nome embutido :data:`NotImplemented`. Os métodos numéricos e métodos de comparação rica devem retornar esse valor se não implementarem a operação para os operandos fornecidos. (O interpretador tentará então a operação refletida ou alguma outra alternativa, dependendo do operador.) Não deve ser avaliado em um contexto booleano.

source: See :ref:`implementing-the-arithmetic-operations` for more details.
pt_br: Veja a documentação :ref:`implementing-the-arithmetic-operations` para mais detalhes.

source: Evaluating :data:`NotImplemented` in a boolean context is deprecated. While it currently evaluates as true, it will emit a :exc:`DeprecationWarning`. It will raise a :exc:`TypeError` in a future version of Python.
pt_br: A avaliação de :data:`NotImplemented` em um contexto booleano foi descontinuada. Embora atualmente seja avaliada como verdadeiro, é emitida uma exceção :exc:`DeprecationWarning`. Levantará uma :exc:`TypeError` em uma versão futura do Python.

source: This type has a single value. There is a single object with this value. This object is accessed through the literal ``...`` or the built-in name ``Ellipsis``. Its truth value is true.
pt_br: Este tipo possui um único valor. Existe um único objeto com este valor. Este objeto é acessado através do literal ``...`` ou do nome embutido ``Ellipsis`` (reticências). Seu valor verdade é verdadeiro.

source: These are created by numeric literals and returned as results by arithmetic operators and arithmetic built-in functions. Numeric objects are immutable; once created their value never changes. Python numbers are of course strongly related to mathematical numbers, but subject to the limitations of numerical representation in computers.
pt_br: Esses são criados por literais numéricos e retornados como resultados por operadores aritméticos e funções aritméticas embutidas. Os objetos numéricos são imutáveis; uma vez criado, seu valor nunca muda. Os números do Python são, obviamente, fortemente relacionados aos números matemáticos, mas sujeitos às limitações da representação numérica em computadores.

source: The string representations of the numeric classes, computed by :meth:`~object.__repr__` and :meth:`~object.__str__`, have the following properties:
pt_br: As representações de string das classes numéricas, calculadas por :meth:`~object.__repr__` e :meth:`~object.__str__`, têm as seguintes propriedades:

source: They are valid numeric literals which, when passed to their class constructor, produce an object having the value of the original numeric.
pt_br: Elas são literais numéricos válidos que, quando passados para seu construtor de classe, produzem um objeto com o valor do numérico original.

source: The representation is in base 10, when possible.
pt_br: A representação está na base 10, quando possível.

source: Leading zeros, possibly excepting a single zero before a decimal point, are not shown.
pt_br: Os zeros à esquerda, possivelmente com exceção de um único zero antes de um ponto decimal, não são mostrados.

source: Trailing zeros, possibly excepting a single zero after a decimal point, are not shown.
pt_br: Os zeros à direita, possivelmente com exceção de um único zero após um ponto decimal, não são mostrados.

source: A sign is shown only when the number is negative.
pt_br: Um sinal é mostrado apenas quando o número é negativo.

source: Python distinguishes between integers, floating-point numbers, and complex numbers:
pt_br: Python distingue entre inteiros, números de ponto flutuante e números complexos:

source: These represent elements from the mathematical set of integers (positive and negative).
pt_br: Estes representam elementos do conjunto matemático de inteiros (positivos e negativos).

source: The rules for integer representation are intended to give the most meaningful interpretation of shift and mask operations involving negative integers.
pt_br: As regras para representação de inteiros têm como objetivo fornecer a interpretação mais significativa das operações de deslocamento e máscara envolvendo inteiros negativos.

source: There are two types of integers:
pt_br: Existem dois tipos de inteiros:

source: Integers (:class:`int`)
pt_br: Inteiros (:class:`int`)

source: These represent numbers in an unlimited range, subject to available (virtual) memory only. For the purpose of shift and mask operations, a binary representation is assumed, and negative numbers are represented in a variant of 2's complement which gives the illusion of an infinite string of sign bits extending to the left.
pt_br: Estes representam números em um intervalo ilimitado, sujeito apenas à memória (virtual) disponível. Para o propósito de operações de deslocamento e máscara, uma representação binária é presumida e os números negativos são representados em uma variante do complemento de 2 que dá a ilusão de uma string infinita de bits de sinal estendendo-se para a esquerda.

source: Booleans (:class:`bool`)
pt_br: Booleanos (:class:`bool`)

source: These represent the truth values False and True. The two objects representing the values ``False`` and ``True`` are the only Boolean objects. The Boolean type is a subtype of the integer type, and Boolean values behave like the values 0 and 1, respectively, in almost all contexts, the exception being that when converted to a string, the strings ``"False"`` or ``"True"`` are returned, respectively.
pt_br: Estes representam os valores da verdade Falsos e Verdadeiros. Os dois objetos que representam os valores ``False`` e ``True`` são os únicos objetos booleanos. O tipo booleano é um subtipo do tipo inteiro, e os valores booleanos se comportam como os valores 0 e 1, respectivamente, em quase todos os contextos, com exceção de que, quando convertidos em uma string, as strings ``"False"`` ou ``"True"`` são retornados, respectivamente.

source: These represent machine-level double precision floating-point numbers. You are at the mercy of the underlying machine architecture (and C or Java implementation) for the accepted range and handling of overflow. Python does not support single-precision floating-point numbers; the savings in processor and memory usage that are usually the reason for using these are dwarfed by the overhead of using objects in Python, so there is no reason to complicate the language with two kinds of floating-point numbers.
pt_br: Estes representam números de ponto flutuante de precisão dupla no nível da máquina. Você está à mercê da arquitetura da máquina subjacente (e implementação C ou Java) para o intervalo aceito e tratamento de estouro. Python não oferece suporte a números de ponto flutuante de precisão única; a economia no uso do processador e da memória, que normalmente é o motivo de usá-los, é ofuscada pela sobrecarga do uso de objetos em Python, portanto, não há razão para complicar a linguagem com dois tipos de números de ponto flutuante.

source: These represent complex numbers as a pair of machine-level double precision floating-point numbers. The same caveats apply as for floating-point numbers. The real and imaginary parts of a complex number ``z`` can be retrieved through the read-only attributes ``z.real`` and ``z.imag``.
pt_br: Estes representam números complexos como um par de números de ponto flutuante de precisão dupla no nível da máquina. As mesmas advertências se aplicam aos números de ponto flutuante. As partes reais e imaginárias de um número complexo ``z`` podem ser obtidas através dos atributos somente leitura ``z.real`` e ``z.imag``.

source: Sequences
pt_br: Sequências

source: These represent finite ordered sets indexed by non-negative numbers. The built-in function :func:`len` returns the number of items of a sequence. When the length of a sequence is *n*, the index set contains the numbers 0, 1, ..., *n*-1. Item *i* of sequence *a* is selected by ``a[i]``. Some sequences, including built-in sequences, interpret negative subscripts by adding the sequence length. For example, ``a[-2]`` equals ``a[n-2]``, the second to last item of sequence a with length ``n``.
pt_br: Estes representam conjuntos ordenados finitos indexados por números não negativos. A função embutida :func:`len` retorna o número de itens de uma sequência. Quando o comprimento de uma sequência é *n*, o conjunto de índices contém os números 0, 1, ..., *n*-1. O item *i* da sequência *a* é selecionado por ``a[i]``. Algumas sequências, incluindo sequências embutidas, interpretam subscritos negativos adicionando o comprimento da sequência. Por exemplo, ``a[-2]`` é igual a ``a[n-2]``, o penúltimo item da sequência a com comprimento ``n``.

source: Sequences also support slicing: ``a[i:j]`` selects all items with index *k* such that *i* ``<=`` *k* ``<`` *j*. When used as an expression, a slice is a sequence of the same type. The comment above about negative indexes also applies to negative slice positions.
pt_br: Sequências também provê fatiamento: ``a[i:j]`` seleciona todos os itens com índice *k* de forma que *i* ``<=`` *k* ``<`` *j*. Quando usada como expressão, uma fatia é uma sequência do mesmo tipo. O comentário acima sobre índices negativos também se aplica a posições de fatias negativas.

source: Some sequences also support "extended slicing" with a third "step" parameter: ``a[i:j:k]`` selects all items of *a* with index *x* where ``x = i + n*k``, *n* ``>=`` ``0`` and *i* ``<=`` *x* ``<`` *j*.
pt_br: Algumas sequências também suportam "fatiamento estendido" com um terceiro parâmetro de "etapa": ``a[i:j:k]`` seleciona todos os itens de *a* com índice *x* onde ``x = i + n*k``, *n* ``>=`` ``0`` e *i* ``<=`` *x* ``<`` *j*.

source: Sequences are distinguished according to their mutability:
pt_br: As sequências são distinguidas de acordo com sua mutabilidade:

source: Immutable sequences
pt_br: Sequências imutáveis

source: An object of an immutable sequence type cannot change once it is created. (If the object contains references to other objects, these other objects may be mutable and may be changed; however, the collection of objects directly referenced by an immutable object cannot change.)
pt_br: Um objeto de um tipo de sequência imutável não pode ser alterado depois de criado. (Se o objeto contiver referências a outros objetos, esses outros objetos podem ser mutáveis e podem ser alterados; no entanto, a coleção de objetos diretamente referenciada por um objeto imutável não pode ser alterada.)

source: The following types are immutable sequences:
pt_br: Os tipos a seguir são sequências imutáveis:
