Repository: python/python-docs-pt-br
Catalog: reference/import.po
Languages: pt_br

source: ``__file__`` is optional (if set, value must be a string). It indicates the pathname of the file from which the module was loaded (if loaded from a file), or the pathname of the shared library file for extension modules loaded dynamically from a shared library. It might be missing for certain types of modules, such as C modules that are statically linked into the interpreter, and the import system may opt to leave it unset if it has no semantic meaning (e.g. a module loaded from a database).
pt_br: ``__file__`` é opcional (se definido, o valor deve ser uma string). Indica o nome do caminho do arquivo do qual o módulo foi carregado (se carregado de um arquivo) ou o nome do caminho do arquivo da biblioteca compartilhada para módulos de extensão carregados dinamicamente de uma biblioteca compartilhada. Pode estar faltando para certos tipos de módulos, como módulos C que estão estaticamente vinculados ao interpretador, e o sistema de importação pode optar por deixá-lo sem definição se não tiver significado semântico (por exemplo, um módulo carregado de um banco de dados).

source: If ``__file__`` is set then the ``__cached__`` attribute might also be set, which is the path to any compiled version of the code (e.g. byte-compiled file). The file does not need to exist to set this attribute; the path can simply point to where the compiled file would exist (see :pep:`3147`).
pt_br: Se ``__file__`` estiver definido então o atributo ``__cached__`` também pode ser definido, que é o caminho para qualquer versão compilada do código (por exemplo, arquivo compilado por byte). O arquivo não precisa existir para configurar esse atributo; o caminho pode simplesmente apontar para onde o arquivo compilado existiria (veja :pep:`3147`).

source: Note that ``__cached__`` may be set even if ``__file__`` is not set. However, that scenario is quite atypical. Ultimately, the loader is what makes use of the module spec provided by the finder (from which ``__file__`` and ``__cached__`` are derived). So if a loader can load from a cached module but otherwise does not load from a file, that atypical scenario may be appropriate.
pt_br: Observe que ``__cached__`` pode ser definido mesmo se ``__file__`` não estiver definido. No entanto, esse cenário é bastante atípico. Em última análise, o carregador é o que faz uso da especificação do módulo fornecida pelo localizador (do qual ``__file__`` e ``__cached__`` são derivados). Portanto, se um carregador puder carregar a partir de um módulo em cache, mas não carregar a partir de um arquivo, esse cenário atípico poderá ser apropriado.

source: By definition, if a module has a ``__path__`` attribute, it is a package.
pt_br: Por definição, se um módulo possui um atributo ``__path__``, ele é um pacote.

source: A package's ``__path__`` attribute is used during imports of its subpackages. Within the import machinery, it functions much the same as :data:`sys.path`, i.e. providing a list of locations to search for modules during import. However, ``__path__`` is typically much more constrained than :data:`sys.path`.
pt_br: O atributo ``__path__`` de um pacote é usado durante as importações de seus subpacotes. Dentro do mecanismo de importação, funciona da mesma forma que :data:`sys.path`, ou seja, fornecendo uma lista de locais para procurar módulos durante a importação. Entretanto, ``__path__`` normalmente é muito mais restrito que :data:`sys.path`.

source: ``__path__`` must be an iterable of strings, but it may be empty. The same rules used for :data:`sys.path` also apply to a package's ``__path__``, and :data:`sys.path_hooks` (described below) are consulted when traversing a package's ``__path__``.
pt_br: ``__path__`` deve ser um iterável de strings, mas pode estar vazio. As mesmas regras usadas para :data:`sys.path` também se aplicam ao ``__path__`` de um pacote, e :data:`sys.path_hooks` (descrito abaixo) são consultados ao percorrer o ``__path__`` de um pacote.

source: A package's ``__init__.py`` file may set or alter the package's ``__path__`` attribute, and this was typically the way namespace packages were implemented prior to :pep:`420`. With the adoption of :pep:`420`, namespace packages no longer need to supply ``__init__.py`` files containing only ``__path__`` manipulation code; the import machinery automatically sets ``__path__`` correctly for the namespace package.
pt_br: O arquivo ``__init__.py`` de um pacote pode definir ou alterar o atributo ``__path__`` do pacote, e esta era tipicamente a forma como os pacotes de espaço de nomes eram implementados antes de :pep:`420`. Com a adoção da :pep:`420`, os pacotes de espaço de nomes não precisam mais fornecer arquivos ``__init__.py`` contendo apenas código de manipulação de ``__path__``; o mecanismo de importação define automaticamente ``__path__`` corretamente para o pacote de espaço de nomes.

source: Module reprs
pt_br: Representações do módulo

source: By default, all modules have a usable repr, however depending on the attributes set above, and in the module's spec, you can more explicitly control the repr of module objects.
pt_br: Por padrão, todos os módulos têm uma representação (repr) utilizável, no entanto, dependendo dos atributos definidos acima e do spec do módulo, você pode controlar mais explicitamente a representação dos objetos módulo.

source: If the module has a spec (``__spec__``), the import machinery will try to generate a repr from it. If that fails or there is no spec, the import system will craft a default repr using whatever information is available on the module. It will try to use the ``module.__name__``, ``module.__file__``, and ``module.__loader__`` as input into the repr, with defaults for whatever information is missing.
pt_br: Se o módulo tiver um spec (``__spec__``), o mecanismo de importação tentará gerar uma representação a partir dele. Se isso falhar ou não houver nenhuma especificação, o sistema de importação criará uma representação padrão usando qualquer informação disponível no módulo. Ele tentará usar ``module.__name__``, ``module.__file__`` e ``module.__loader__`` como entrada para a representação, com padrões para qualquer informação que esteja faltando.

source: Here are the exact rules used:
pt_br: Arquivo estão as exatas regras usadas:

source: If the module has a ``__spec__`` attribute, the information in the spec is used to generate the repr. The "name", "loader", "origin", and "has_location" attributes are consulted.
pt_br: Se o módulo tiver um atributo ``__spec__``, a informação no spec é usada para gerar a representação. Os atributos "name", "loader", "origin" e "has_location" são consultados.

source: If the module has a ``__file__`` attribute, this is used as part of the module's repr.
pt_br: Se o módulo tiver um atributo ``__file__``, ele será usado como parte da representação do módulo.

source: If the module has no ``__file__`` but does have a ``__loader__`` that is not ``None``, then the loader's repr is used as part of the module's repr.
pt_br: Se o módulo não tem ``__file__`` mas tem um ``__loader__`` que não seja ``None``, então a representação do carregador é usado como parte da representação do módulo.

source: Otherwise, just use the module's ``__name__`` in the repr.
pt_br: Caso contrário, basta usar o ``__name__`` do módulo na representação.

source: Cached bytecode invalidation
pt_br: Invalidação de bytecode em cache

source: Before Python loads cached bytecode from a ``.pyc`` file, it checks whether the cache is up-to-date with the source ``.py`` file. By default, Python does this by storing the source's last-modified timestamp and size in the cache file when writing it. At runtime, the import system then validates the cache file by checking the stored metadata in the cache file against the source's metadata.
pt_br: Antes do Python carregar o bytecode armazenado em cache de um arquivo ``.pyc``, ele verifica se o cache está atualizado com o arquivo fonte ``.py``. Por padrão, o Python faz isso armazenando o registro de data e hora da última modificação da fonte e o tamanho no arquivo de cache ao escrevê-lo. No tempo de execução, o sistema de importação valida o arquivo de cache verificando os metadados armazenados no arquivo de cache em relação aos metadados do código-fonte.

source: Python also supports "hash-based" cache files, which store a hash of the source file's contents rather than its metadata. There are two variants of hash-based ``.pyc`` files: checked and unchecked. For checked hash-based ``.pyc`` files, Python validates the cache file by hashing the source file and comparing the resulting hash with the hash in the cache file. If a checked hash-based cache file is found to be invalid, Python regenerates it and writes a new checked hash-based cache file. For unchecked hash-based ``.pyc`` files, Python simply assumes the cache file is valid if it exists. Hash-based ``.pyc`` files validation behavior may be overridden with the :option:`--check-hash-based-pycs` flag.
pt_br: Python também oferece suporte a arquivos de cache "baseados em hash", que armazenam um hash do conteúdo do arquivo fonte em vez de seus metadados. Existem duas variantes de arquivos ``.pyc`` baseados em hash: verificados e não verificados. Para arquivos ``.pyc`` baseados em hash verificados, o Python valida o arquivo de cache fazendo hash do arquivo fonte e comparando o hash resultante com o hash no arquivo de cache. Se um arquivo de cache baseado em hash verificado for inválido, o Python o regenerará e gravará um novo arquivo de cache baseado em hash verificado. Para arquivos ``.pyc`` baseados em hash não verificados, o Python simplesmente presume que o arquivo de cache é válido, se existir. O comportamento de validação de arquivos ``.pyc`` baseados em hash pode ser substituído pelo sinalizador :option:`--check-hash-based-pycs`.

source: Added hash-based ``.pyc`` files. Previously, Python only supported timestamp-based invalidation of bytecode caches.
pt_br: Adicionados arquivos ``.pyc`` baseados em hash. Anteriormente, o Python oferecia suporte apenas à invalidação de caches de bytecode baseada em registro de data e hora.

source: The Path Based Finder
pt_br: O localizador baseado no caminho

source: As mentioned previously, Python comes with several default meta path finders. One of these, called the :term:`path based finder` (:class:`~importlib.machinery.PathFinder`), searches an :term:`import path`, which contains a list of :term:`path entries <path entry>`. Each path entry names a location to search for modules.
pt_br: Conforme mencionado anteriormente, Python vem com vários localizadores de metacaminho padrão. Um deles, chamado :term:`localizador baseado no caminho` (:class:`~importlib.machinery.PathFinder`), pesquisa um :term:`caminho de importação`, que contém uma lista de :term:`entradas de caminho <path entry>`. Cada entrada de caminho nomeia um local para procurar módulos.

source: The path based finder itself doesn't know how to import anything. Instead, it traverses the individual path entries, associating each of them with a path entry finder that knows how to handle that particular kind of path.
pt_br: O próprio localizador baseado no caminho não sabe como importar nada. Em vez disso, ele percorre as entradas de caminho individuais, associando cada uma delas a um localizador de entrada de caminho que sabe como lidar com esse tipo específico de caminho.

source: The default set of path entry finders implement all the semantics for finding modules on the file system, handling special file types such as Python source code (``.py`` files), Python byte code (``.pyc`` files) and shared libraries (e.g. ``.so`` files). When supported by the :mod:`zipimport` module in the standard library, the default path entry finders also handle loading all of these file types (other than shared libraries) from zipfiles.
pt_br: O conjunto padrão de localizadores de entrada de caminho implementa toda a semântica para localizar módulos no sistema de arquivos, manipulando tipos de arquivos especiais, como código-fonte Python (arquivos ``.py``), código de bytes Python (arquivos ``.pyc``) e bibliotecas compartilhadas (por exemplo, arquivos ``.so``). Quando suportado pelo módulo :mod:`zipimport` na biblioteca padrão, os localizadores de entrada de caminho padrão também lidam com o carregamento de todos esses tipos de arquivos (exceto bibliotecas compartilhadas) de arquivos zip.

source: Path entries need not be limited to file system locations. They can refer to URLs, database queries, or any other location that can be specified as a string.
pt_br: As entradas de caminho não precisam ser limitadas aos locais do sistema de arquivos. Eles podem referir-se a URLs, consultas de banco de dados ou qualquer outro local que possa ser especificado como uma string.

source: The path based finder provides additional hooks and protocols so that you can extend and customize the types of searchable path entries. For example, if you wanted to support path entries as network URLs, you could write a hook that implements HTTP semantics to find modules on the web. This hook (a callable) would return a :term:`path entry finder` supporting the protocol described below, which was then used to get a loader for the module from the web.
pt_br: O localizador baseado no caminho fornece ganchos e protocolos adicionais para que você possa estender e personalizar os tipos de entradas de caminho pesquisáveis. Por exemplo, se você quiser oferecer suporte a entradas de caminho como URLs de rede, poderá escrever um gancho que implemente a semântica HTTP para localizar módulos na web. Este gancho (um chamável) retornaria um :term:`localizador de entrada de caminho` suportando o protocolo descrito abaixo, que foi então usado para obter um carregador para o módulo da web.

source: A word of warning: this section and the previous both use the term *finder*, distinguishing between them by using the terms :term:`meta path finder` and :term:`path entry finder`. These two types of finders are very similar, support similar protocols, and function in similar ways during the import process, but it's important to keep in mind that they are subtly different. In particular, meta path finders operate at the beginning of the import process, as keyed off the :data:`sys.meta_path` traversal.
pt_br: Uma palavra de advertência: esta seção e a anterior usam o termo *localizador*, distinguindo-os usando os termos :term:`localizador de metacaminho` e :term:`localizador de entrada de caminho`. Esses dois tipos de localizadores são muito semelhantes, oferecem suporte a protocolos semelhantes e funcionam de maneira semelhante durante o processo de importação, mas é importante ter em mente que eles são sutilmente diferentes. Em particular, os localizadores de metacaminho operam no início do processo de importação, conforme a travessia de :data:`sys.meta_path`.

source: By contrast, path entry finders are in a sense an implementation detail of the path based finder, and in fact, if the path based finder were to be removed from :data:`sys.meta_path`, none of the path entry finder semantics would be invoked.
pt_br: Por outro lado, os localizadores de entrada de caminho são, em certo sentido, um detalhe de implementação do localizador baseado no caminho e, de fato, se o localizador baseado no caminho fosse removido de :data:`sys.meta_path`, nenhuma semântica do localizador de entrada de caminho seria ser invocado.

source: Path entry finders
pt_br: Localizadores de entrada de caminho

source: The :term:`path based finder` is responsible for finding and loading Python modules and packages whose location is specified with a string :term:`path entry`. Most path entries name locations in the file system, but they need not be limited to this.
pt_br: O :term:`localizador baseado no caminho` é responsável por encontrar e carregar módulos e pacotes Python cuja localização é especificada com uma string :term:`entrada de caminho`. A maioria das entradas de caminho nomeiam locais no sistema de arquivos, mas não precisam ser limitadas a isso.

source: As a meta path finder, the :term:`path based finder` implements the :meth:`~importlib.abc.MetaPathFinder.find_spec` protocol previously described, however it exposes additional hooks that can be used to customize how modules are found and loaded from the :term:`import path`.
pt_br: Como um localizador de metacaminho, o :term:`localizador baseado no caminho` implementa o protocolo :meth:`~importlib.abc.MetaPathFinder.find_spec` descrito anteriormente, no entanto, ele expõe ganchos adicionais que podem ser usados para personalizar como os módulos são encontrados e carregado do :term:`caminho de importação`.

source: Three variables are used by the :term:`path based finder`, :data:`sys.path`, :data:`sys.path_hooks` and :data:`sys.path_importer_cache`. The ``__path__`` attributes on package objects are also used. These provide additional ways that the import machinery can be customized.
pt_br: Três variáveis são usadas pelo :term:`localizador baseado no caminho`, :data:`sys.path`, :data:`sys.path_hooks` e :data:`sys.path_importer_cache`. Os atributos ``__path__`` em objetos de pacote também são usados. Eles fornecem maneiras adicionais de personalizar o mecanismo de importação.

source: :data:`sys.path` contains a list of strings providing search locations for modules and packages. It is initialized from the :envvar:`PYTHONPATH` environment variable and various other installation- and implementation-specific defaults. Entries in :data:`sys.path` can name directories on the file system, zip files, and potentially other "locations" (see the :mod:`site` module) that should be searched for modules, such as URLs, or database queries. Only strings should be present on :data:`sys.path`; all other data types are ignored.
pt_br: :data:`sys.path` contém uma lista de strings fornecendo locais de pesquisa para módulos e pacotes. Ele é inicializado a partir da variável de ambiente :envvar:`PYTHONPATH` e vários outros padrões específicos de instalação e implementação. Entradas em :data:`sys.path` podem nomear diretórios no sistema de arquivos, arquivos zip e potencialmente outros "locais" (veja o módulo :mod:`site`) que devem ser pesquisados por módulos, como URLs, ou consultas ao banco de dados. Apenas strings devem estar presentes em :data:`sys.path`; todos os outros tipos de dados são ignorados.

source: The :term:`path based finder` is a :term:`meta path finder`, so the import machinery begins the :term:`import path` search by calling the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method as described previously. When the ``path`` argument to :meth:`~importlib.machinery.PathFinder.find_spec` is given, it will be a list of string paths to traverse - typically a package's ``__path__`` attribute for an import within that package. If the ``path`` argument is ``None``, this indicates a top level import and :data:`sys.path` is used.
pt_br: O :term:`localizador baseado no caminho` é um :term:`localizador de metacaminho`, então o mecanismo de importação inicia a pesquisa no :term:`caminho de importação` chamando o método :meth:`~importlib.machinery.PathFinder.find_spec` do localizador baseado no caminho conforme descrito anteriormente. Quando o argumento ``path`` para :meth:`~importlib.machinery.PathFinder.find_spec` for fornecido, será uma lista de caminhos de string a serem percorridos -- normalmente o atributo ``__path__`` de um pacote para uma importação dentro desse pacote. Se o argumento ``path`` for ``None``, isso indica uma importação de nível superior e :data:`sys.path` é usado.

source: If the path entry is not present in the cache, the path based finder iterates over every callable in :data:`sys.path_hooks`. Each of the :term:`path entry hooks <path entry hook>` in this list is called with a single argument, the path entry to be searched. This callable may either return a :term:`path entry finder` that can handle the path entry, or it may raise :exc:`ImportError`. An :exc:`ImportError` is used by the path based finder to signal that the hook cannot find a :term:`path entry finder` for that :term:`path entry`. The exception is ignored and :term:`import path` iteration continues. The hook should expect either a string or bytes object; the encoding of bytes objects is up to the hook (e.g. it may be a file system encoding, UTF-8, or something else), and if the hook cannot decode the argument, it should raise :exc:`ImportError`.
pt_br: Se a entrada de caminho não estiver presente no cache, o localizador baseado no caminho itera sobre cada chamável em :data:`sys.path_hooks`. Cada um dos :term:`ganchos de entrada de caminho <path entry hook>` nesta lista é chamado com um único argumento, a entrada de caminho a ser pesquisada. Este chamável pode retornar um :term:`localizador de entrada de caminho` que pode manipular a entrada de caminho ou pode levantar :exc:`ImportError`. Um :exc:`ImportError` é usado pelo localizador baseado no caminho para sinalizar que o gancho não consegue encontrar um :term:`localizador de entrada de caminho` para aquela :term:`entrada de caminho`. A exceção é ignorada e a iteração com o :term:`caminho de importação` continua. O gancho deve esperar um objeto string ou bytes; a codificação de objetos bytes depende do gancho (por exemplo, pode ser uma codificação de sistema de arquivos, UTF-8 ou outra coisa) e, se o gancho não puder decodificar o argumento, ele deve levantar :exc:`ImportError`.

source: If :data:`sys.path_hooks` iteration ends with no :term:`path entry finder` being returned, then the path based finder's :meth:`~importlib.machinery.PathFinder.find_spec` method will store ``None`` in :data:`sys.path_importer_cache` (to indicate that there is no finder for this path entry) and return ``None``, indicating that this :term:`meta path finder` could not find the module.
pt_br: Se a iteração :data:`sys.path_hooks` terminar sem que nenhum :term:`localizador de entrada de caminho` seja retornado, o método :meth:`~importlib.machinery.PathFinder.find_spec` do localizador baseado no caminho armazenará ``None`` em :data:`sys.path_importer_cache` (para indicar que não há um localizador para esta entrada de caminho) e retornará ``None``, indicando que este :term:`localizador de metacaminho` não conseguiu encontrar o módulo.

source: If a :term:`path entry finder` *is* returned by one of the :term:`path entry hook` callables on :data:`sys.path_hooks`, then the following protocol is used to ask the finder for a module spec, which is then used when loading the module.
pt_br: Se um :term:`localizador de entrada de caminho` *for* retornado por um dos chamáveis de :term:`gancho de entrada de caminho` ​em :data:`sys.path_hooks`, então o seguinte protocolo é usado para solicitar ao localizador um spec de módulo, que é então usada ao carregar o módulo.
