Repository: python/python-docs-pt-br
Catalog: reference/import.po
Languages: pt_br

source: The current working directory -- denoted by an empty string -- is handled slightly differently from other entries on :data:`sys.path`. First, if the current working directory is found to not exist, no value is stored in :data:`sys.path_importer_cache`. Second, the value for the current working directory is looked up fresh for each module lookup. Third, the path used for :data:`sys.path_importer_cache` and returned by :meth:`importlib.machinery.PathFinder.find_spec` will be the actual current working directory and not the empty string.
pt_br: O diretório de trabalho atual -- denotado por uma string vazia -- é tratado de forma ligeiramente diferente de outras entradas em :data:`sys.path`. Primeiro, se o diretório de trabalho atual for considerado inexistente, nenhum valor será armazenado em :data:`sys.path_importer_cache`. Segundo, o valor para o diretório de trabalho atual é pesquisado novamente para cada pesquisa de módulo. Terceiro, o caminho usado para :data:`sys.path_importer_cache` e retornado por :meth:`importlib.machinery.PathFinder.find_spec` será o diretório de trabalho atual real e não a string vazia.

source: Path entry finder protocol
pt_br: Protocolo do localizador de entrada de caminho

source: In order to support imports of modules and initialized packages and also to contribute portions to namespace packages, path entry finders must implement the :meth:`~importlib.abc.PathEntryFinder.find_spec` method.
pt_br: Para dar suporte a importações de módulos e pacotes inicializados e também contribuir com partes para pacotes de espaço de nomes, os localizadores de entrada de caminho devem implementar o método :meth:`~importlib.abc.PathEntryFinder.find_spec`.

source: :meth:`~importlib.abc.PathEntryFinder.find_spec` takes two arguments: the fully qualified name of the module being imported, and the (optional) target module. ``find_spec()`` returns a fully populated spec for the module. This spec will always have "loader" set (with one exception).
pt_br: :meth:`~importlib.abc.PathEntryFinder.find_spec` recebe dois argumentos: o nome totalmente qualificado do módulo que está sendo importado e o módulo de destino (opcional). ``find_spec()`` retorna um spec totalmente preenchido para o módulo. Este spec sempre terá "loader" definido (com uma exceção).

source: Older path entry finders may implement one of these two deprecated methods instead of ``find_spec()``. The methods are still respected for the sake of backward compatibility. However, if ``find_spec()`` is implemented on the path entry finder, the legacy methods are ignored.
pt_br: Os localizadores de entrada de caminho mais antigos podem implementar um desses dois métodos descontinuados em vez de ``find_spec()``. Os métodos ainda são respeitados para fins de compatibilidade com versões anteriores. No entanto, se ``find_spec()`` for implementado no localizador de entrada de caminho, os métodos legados serão ignorados.

source: For backwards compatibility with other implementations of the import protocol, many path entry finders also support the same, traditional ``find_module()`` method that meta path finders support. However path entry finder ``find_module()`` methods are never called with a ``path`` argument (they are expected to record the appropriate path information from the initial call to the path hook).
pt_br: Para compatibilidade com versões anteriores de outras implementações do protocolo de importação, muitos localizadores de entrada de caminho também dão suporte ao mesmo método tradicional ``find_module()`` que os localizadores de metacaminho. No entanto, os métodos ``find_module()`` do localizador de entrada de caminho nunca são chamados com um argumento ``path`` (espera-se que eles registrem as informações de caminho apropriadas da chamada inicial para o gancho de caminho).

source: The ``find_module()`` method on path entry finders is deprecated, as it does not allow the path entry finder to contribute portions to namespace packages. If both ``find_loader()`` and ``find_module()`` exist on a path entry finder, the import system will always call ``find_loader()`` in preference to ``find_module()``.
pt_br: O método ``find_module()`` em localizadores de entrada de caminho foi descontinuado, pois não permite que o localizador de entrada de caminho contribua com porções para pacotes de espaço de nomes. Se ``find_loader()`` e ``find_module()`` existirem em um localizador de entrada de caminho, o sistema de importação sempre chamará ``find_loader()`` em preferência a ``find_module()``.

source: Replacing the standard import system
pt_br: Substituindo o sistema de importação padrão

source: The most reliable mechanism for replacing the entire import system is to delete the default contents of :data:`sys.meta_path`, replacing them entirely with a custom meta path hook.
pt_br: O mecanismo mais confiável para substituir todo o sistema de importação é excluir o conteúdo padrão de :data:`sys.meta_path`, substituindo-o inteiramente por um gancho de metacaminho personalizado.

source: If it is acceptable to only alter the behaviour of import statements without affecting other APIs that access the import system, then replacing the builtin :func:`__import__` function may be sufficient. This technique may also be employed at the module level to only alter the behaviour of import statements within that module.
pt_br: Se for aceitável alterar apenas o comportamento de instruções de importação sem afetar outras APIs que acessam o sistema de importação, então substituir a função embutida :func:`__import__` pode ser suficiente. Essa técnica também pode ser empregada no nível do módulo para alterar apenas o comportamento de instruções de importação dentro desse módulo.

source: To selectively prevent the import of some modules from a hook early on the meta path (rather than disabling the standard import system entirely), it is sufficient to raise :exc:`ModuleNotFoundError` directly from :meth:`~importlib.abc.MetaPathFinder.find_spec` instead of returning ``None``. The latter indicates that the meta path search should continue, while raising an exception terminates it immediately.
pt_br: Para impedir seletivamente a importação de alguns módulos de um gancho no início do metacaminho (em vez de desabilitar o sistema de importação padrão completamente), é suficiente levantar :exc:`ModuleNotFoundError` diretamente de :meth:`~importlib.abc.MetaPathFinder.find_spec` em vez de retornar ``None``. O último indica que a busca do metacaminho deve continuar, enquanto levantar uma exceção a encerra imediatamente.

source: Package Relative Imports
pt_br: Importações relativas ao pacote

source: Relative imports use leading dots. A single leading dot indicates a relative import, starting with the current package. Two or more leading dots indicate a relative import to the parent(s) of the current package, one level per dot after the first. For example, given the following package layout::
pt_br: Importações relativas usam caracteres de ponto no início. Um único ponto no início indica uma importação relativa, começando com o pacote atual. Dois ou mais pontos no início indicam uma importação relativa para o(s) pai(s) do pacote atual, um nível por ponto após o primeiro. Por exemplo, dado o seguinte layout de pacote::

source: In either ``subpackage1/moduleX.py`` or ``subpackage1/__init__.py``, the following are valid relative imports::
pt_br: Em ``subpackage1/moduleX.py`` ou ``subpackage1/__init__.py``, as seguintes são importações relativas válidas:

source: Absolute imports may use either the ``import <>`` or ``from <> import <>`` syntax, but relative imports may only use the second form; the reason for this is that::
pt_br: Importações absolutas podem usar a sintaxe ``import <>`` ou ``from <> import <>``, mas importações relativas podem usar apenas a segunda forma; o motivo para isso é que:

source: should expose ``XXX.YYY.ZZZ`` as a usable expression, but .moduleY is not a valid expression.
pt_br: deve expor ``XXX.YYY.ZZZ`` como uma expressão utilizável, mas .moduleY não é uma expressão válida.

source: Special considerations for __main__
pt_br: Considerações especiais para __main__

source: The :mod:`__main__` module is a special case relative to Python's import system. As noted :ref:`elsewhere <programs>`, the ``__main__`` module is directly initialized at interpreter startup, much like :mod:`sys` and :mod:`builtins`. However, unlike those two, it doesn't strictly qualify as a built-in module. This is because the manner in which ``__main__`` is initialized depends on the flags and other options with which the interpreter is invoked.
pt_br: O módulo :mod:`__main__` é um caso especial em relação ao sistema de importação do Python. Conforme observado em :ref:`em outro lugar <programs>`, o módulo ``__main__`` é inicializado diretamente na inicialização do interpretador, muito parecido com :mod:`sys` e :mod:`builtins`. No entanto, diferentemente desses dois, ele não se qualifica estritamente como um módulo integrado. Isso ocorre porque a maneira como ``__main__`` é inicializado depende dos sinalizadores e outras opções com as quais o interpretador é invocado.

source: Depending on how :mod:`__main__` is initialized, ``__main__.__spec__`` gets set appropriately or to ``None``.
pt_br: Dependendo de como :mod:`__main__` é inicializado, ``__main__.__spec__`` é definido apropriadamente ou como ``None``.

source: When Python is started with the :option:`-m` option, ``__spec__`` is set to the module spec of the corresponding module or package. ``__spec__`` is also populated when the ``__main__`` module is loaded as part of executing a directory, zipfile or other :data:`sys.path` entry.
pt_br: Quando o Python é iniciado com a opção :option:`-m`, ``__spec__`` é definido como o spec de módulo ou pacote correspondente. ``__spec__`` também é preenchido quando o módulo ``__main__`` é carregado como parte da execução de um diretório, arquivo zip ou outra entrada :data:`sys.path`.

source: In :ref:`the remaining cases <using-on-interface-options>` ``__main__.__spec__`` is set to ``None``, as the code used to populate the :mod:`__main__` does not correspond directly with an importable module:
pt_br: :ref:`Nos demais casos <using-on-interface-options>`, ``__main__.__spec__`` é definido como ``None``, pois o código usado para preencher o :mod:`__main__` não corresponde diretamente a um módulo importável:

source: interactive prompt
pt_br: prompt interativo

source: :option:`-c` option
pt_br: opção :option:`-c`

source: running from stdin
pt_br: executar a partir de stdin

source: running directly from a source or bytecode file
pt_br: executar diretamente de um arquivo de código-fonte ou bytecode

source: Note that ``__main__.__spec__`` is always ``None`` in the last case, *even if* the file could technically be imported directly as a module instead. Use the :option:`-m` switch if valid module metadata is desired in :mod:`__main__`.
pt_br: Note que ``__main__.__spec__`` é sempre ``None`` no último caso, *mesmo se* o arquivo pudesse ser importado diretamente como um módulo. Use a opção :option:`-m` se metadados de módulo válidos forem desejados em :mod:`__main__`.

source: Note also that even when ``__main__`` corresponds with an importable module and ``__main__.__spec__`` is set accordingly, they're still considered *distinct* modules. This is due to the fact that blocks guarded by ``if __name__ == "__main__":`` checks only execute when the module is used to populate the ``__main__`` namespace, and not during normal import.
pt_br: Note também que mesmo quando ``__main__`` corresponde a um módulo importável e ``__main__.__spec__`` é definido adequadamente, eles ainda são considerados módulos *distintos*. Isso se deve ao fato de que os blocos protegidos por verificações ``if __name__ == "__main__":`` são executados somente quando o módulo é usado para preencher o espaço de nomes ``__main__``, e não durante a importação normal.

source: References
pt_br: Referências

source: The import machinery has evolved considerably since Python's early days. The original `specification for packages <https://www.python.org/doc/essays/packages/>`_ is still available to read, although some details have changed since the writing of that document.
pt_br: O maquinário de importação evoluiu consideravelmente desde os primeiros dias do Python. A `especificação original para pacotes <https://www.python.org/doc/essays/packages/>`_ ainda está disponível para leitura, embora alguns detalhes tenham mudado desde a escrita desse documento.

source: The original specification for :data:`sys.meta_path` was :pep:`302`, with subsequent extension in :pep:`420`.
pt_br: A especificação original para :data:`sys.meta_path` era :pep:`302`, com extensão subsequente em :pep:`420`.

source: :pep:`366` describes the addition of the ``__package__`` attribute for explicit relative imports in main modules.
pt_br: :pep:`366` descreve a adição do atributo ``__package__`` para importações relativas explícitas em módulos principais.

source: :pep:`328` introduced absolute and explicit relative imports and initially proposed ``__name__`` for semantics :pep:`366` would eventually specify for ``__package__``.
pt_br: :pep:`328` introduziu importações relativas absolutas e explícitas e inicialmente propôs ``__name__`` para semântica. :pep:`366` eventualmente especificaria ``__package__``.

source: :pep:`338` defines executing modules as scripts.
pt_br: :pep:`338` define módulos de execução como scripts.

source: :pep:`451` adds the encapsulation of per-module import state in spec objects. It also off-loads most of the boilerplate responsibilities of loaders back onto the import machinery. These changes allow the deprecation of several APIs in the import system and also addition of new methods to finders and loaders.
pt_br: :pep:`451` adiciona o encapsulamento do estado de importação por módulo em objetos spec. Ele também descarrega a maioria das responsabilidades inerentes dos carregadores de volta para o maquinário de importação. Essas mudanças permitem a descontinuação de várias APIs no sistema de importação e também a adição de novos métodos para localizadores e carregadores.

source: Footnotes
pt_br: Notas de rodapé

source: See :class:`types.ModuleType`.
pt_br: Veja :class:`types.ModuleType`.

source: The importlib implementation avoids using the return value directly. Instead, it gets the module object by looking the module name up in :data:`sys.modules`. The indirect effect of this is that an imported module may replace itself in :data:`sys.modules`. This is implementation-specific behavior that is not guaranteed to work in other Python implementations.
pt_br: A implementação de importlib evita usar o valor de retorno diretamente. Em vez disso, ela obtém o objeto do módulo procurando o nome do módulo em :data:`sys.modules`. O efeito indireto disso é que um módulo importado pode substituir a si mesmo em :data:`sys.modules`. Esse é um comportamento específico da implementação que não tem garantia de funcionar em outras implementações do Python.

source: import machinery
pt_br: maquinário de importação

source: package
pt_br: pacote

source: namespace
pt_br: espaço de nomes

source: portion
pt_br: porção

source: finder
pt_br: localizador

source: loader
pt_br: carregador

source: module spec
pt_br: módulo spec

source: import hooks
pt_br: ganchos de importação

source: meta hooks
pt_br: metaganchos

source: path hooks
pt_br: ganchos de caminho

source: hooks
pt_br: ganchos

source: path
pt_br: caminho

source: path based finder
pt_br: localizador baseado no caminho
