Repository: python/python-docs-pt-br
Catalog: reference/import.po
Languages: pt_br

source: The import system
pt_br: O sistema de importação

source: Python code in one :term:`module` gains access to the code in another module by the process of :term:`importing` it. The :keyword:`import` statement is the most common way of invoking the import machinery, but it is not the only way. Functions such as :func:`importlib.import_module` and built-in :func:`__import__` can also be used to invoke the import machinery.
pt_br: O código Python em um :term:`módulo` obtém acesso ao código em outro módulo pelo processo de :term:`importação` dele. A instrução :keyword:`import` é a maneira mais comum de invocar o mecanismo de importação, mas não é a única maneira. Funções como :func:`importlib.import_module` e a função embutida :func:`__import__` também podem ser usadas para chamar o mecanismo de importação.

source: The :keyword:`import` statement combines two operations; it searches for the named module, then it binds the results of that search to a name in the local scope. The search operation of the :keyword:`!import` statement is defined as a call to the :func:`__import__` function, with the appropriate arguments. The return value of :func:`__import__` is used to perform the name binding operation of the :keyword:`!import` statement. See the :keyword:`!import` statement for the exact details of that name binding operation.
pt_br: A instrução :keyword:`import` combina duas operações; ela procura o módulo nomeado e vincula os resultados dessa pesquisa a um nome no escopo local. A operação de busca da instrução :keyword:`!import` é definida como uma chamada para a função :func:`__import__`, com os argumentos apropriados. O valor de retorno de :func:`__import__` é usado para executar a operação de ligação de nome da instrução :keyword:`!import`. Veja a instrução :keyword:`!import` para os detalhes exatos da operação de ligação desse nome.

source: A direct call to :func:`__import__` performs only the module search and, if found, the module creation operation. While certain side-effects may occur, such as the importing of parent packages, and the updating of various caches (including :data:`sys.modules`), only the :keyword:`import` statement performs a name binding operation.
pt_br: Uma chamada direta para :func:`__import__` realiza apenas a pesquisa do módulo e, se encontrada, a operação de criação do módulo. Embora certos efeitos colaterais possam ocorrer, como a importação de pacotes pai e a atualização de vários caches (incluindo :data:`sys.modules`), apenas a instrução :keyword:`import` realiza uma operação de ligação de nome.

source: When an :keyword:`import` statement is executed, the standard builtin :func:`__import__` function is called. Other mechanisms for invoking the import system (such as :func:`importlib.import_module`) may choose to bypass :func:`__import__` and use their own solutions to implement import semantics.
pt_br: Quando uma instrução :keyword:`import` é executada, a função embutida padrão :func:`__import__` é chamada. Outros mecanismos para chamar o sistema de importação (como :func:`importlib.import_module`) podem optar por ignorar :func:`__import__` e usar suas próprias soluções para implementar a semântica de importação.

source: When a module is first imported, Python searches for the module and if found, it creates a module object [#fnmo]_, initializing it. If the named module cannot be found, a :exc:`ModuleNotFoundError` is raised. Python implements various strategies to search for the named module when the import machinery is invoked. These strategies can be modified and extended by using various hooks described in the sections below.
pt_br: Quando um módulo é importado pela primeira vez, o Python procura pelo módulo e, se encontrado, cria um objeto de módulo [#fnmo]_, inicializando-o. Se o módulo nomeado não puder ser encontrado, uma :exc:`ModuleNotFoundError` será levantada. O Python implementa várias estratégias para procurar o módulo nomeado quando o mecanismo de importação é chamado. Essas estratégias podem ser modificadas e estendidas usando vários ganchos descritos nas seções abaixo.

source: The import system has been updated to fully implement the second phase of :pep:`302`. There is no longer any implicit import machinery - the full import system is exposed through :data:`sys.meta_path`. In addition, native namespace package support has been implemented (see :pep:`420`).
pt_br: O sistema de importação foi atualizado para implementar completamente a segunda fase da :pep:`302`. Não há mais um mecanismo de importação implícito -- o sistema completo de importação é exposto através de :data:`sys.meta_path`. Além disso, o suporte nativo a pacote de espaço de nomes foi implementado (consulte :pep:`420`).

source: The :mod:`importlib` module provides a rich API for interacting with the import system. For example :func:`importlib.import_module` provides a recommended, simpler API than built-in :func:`__import__` for invoking the import machinery. Refer to the :mod:`importlib` library documentation for additional detail.
pt_br: O módulo :mod:`importlib` fornece uma API rica para interagir com o sistema de importação. Por exemplo, :func:`importlib.import_module` fornece uma API mais simples e recomendada do que a função embutida :func:`__import__` para chamar o mecanismo de importação. Consulte a documentação da biblioteca :mod:`importlib` para obter detalhes adicionais.

source: Packages
pt_br: Pacotes

source: Python has only one type of module object, and all modules are of this type, regardless of whether the module is implemented in Python, C, or something else. To help organize modules and provide a naming hierarchy, Python has a concept of :term:`packages <package>`.
pt_br: O Python possui apenas um tipo de objeto de módulo e todos os módulos são desse tipo, independentemente de o módulo estar implementado em Python, C ou qualquer outra coisa. Para ajudar a organizar os módulos e fornecer uma hierarquia de nomes, o Python tem o conceito de :term:`pacotes <pacote>`.

source: You can think of packages as the directories on a file system and modules as files within directories, but don't take this analogy too literally since packages and modules need not originate from the file system. For the purposes of this documentation, we'll use this convenient analogy of directories and files. Like file system directories, packages are organized hierarchically, and packages may themselves contain subpackages, as well as regular modules.
pt_br: Você pode pensar em pacotes como os diretórios em um sistema de arquivos e os módulos como arquivos nos diretórios, mas não tome essa analogia muito literalmente, já que pacotes e módulos não precisam se originar do sistema de arquivos. Para os fins desta documentação, usaremos essa analogia conveniente de diretórios e arquivos. Como os diretórios do sistema de arquivos, os pacotes são organizados hierarquicamente e os próprios pacotes podem conter subpacotes e módulos regulares.

source: It's important to keep in mind that all packages are modules, but not all modules are packages. Or put another way, packages are just a special kind of module. Specifically, any module that contains a ``__path__`` attribute is considered a package.
pt_br: É importante ter em mente que todos os pacotes são módulos, mas nem todos os módulos são pacotes. Ou, dito de outra forma, os pacotes são apenas um tipo especial de módulo. Especificamente, qualquer módulo que contenha um atributo ``__path__`` é considerado um pacote.

source: All modules have a name. Subpackage names are separated from their parent package name by a dot, akin to Python's standard attribute access syntax. Thus you might have a package called :mod:`email`, which in turn has a subpackage called :mod:`email.mime` and a module within that subpackage called :mod:`email.mime.text`.
pt_br: Todo módulo tem um nome. Nomes de subpacotes são separados do nome do pacote por um ponto, semelhante à sintaxe de acesso aos atributos padrão do Python. Assim pode ter um pacote chamado :mod:`email`, que por sua vez tem um subpacote chamado :mod:`email.mime` e um módulo dentro dele chamado :mod:`email.mime.text`.

source: Regular packages
pt_br: Pacotes regulares

source: Python defines two types of packages, :term:`regular packages <regular package>` and :term:`namespace packages <namespace package>`. Regular packages are traditional packages as they existed in Python 3.2 and earlier. A regular package is typically implemented as a directory containing an ``__init__.py`` file. When a regular package is imported, this ``__init__.py`` file is implicitly executed, and the objects it defines are bound to names in the package's namespace. The ``__init__.py`` file can contain the same Python code that any other module can contain, and Python will add some additional attributes to the module when it is imported.
pt_br: O Python define dois tipos de pacotes, :term:`pacotes regulares <regular package>` e :term:`pacotes de espaço de nomes <namespace package>`. Pacotes regulares são pacotes tradicionais, como existiam no Python 3.2 e versões anteriores. Um pacote regular é normalmente implementado como um diretório que contém um arquivo ``__init__.py``. Quando um pacote regular é importado, esse arquivo ``__init__.py`` é executado implicitamente, e os objetos que ele define são vinculados aos nomes no espaço de nomes do pacote. O arquivo ``__init__.py`` pode conter o mesmo código Python que qualquer outro módulo pode conter, e o Python adicionará alguns atributos adicionais ao módulo quando ele for importado.

source: For example, the following file system layout defines a top level ``parent`` package with three subpackages::
pt_br: Por exemplo, o layout do sistema de arquivos a seguir define um pacote ``parent`` de nível superior com três subpacotes::

source: Importing ``parent.one`` will implicitly execute ``parent/__init__.py`` and ``parent/one/__init__.py``. Subsequent imports of ``parent.two`` or ``parent.three`` will execute ``parent/two/__init__.py`` and ``parent/three/__init__.py`` respectively.
pt_br: A importação de ``parent.one`` vai executar implicitamente ``parent/__init__.py`` e ``parent/one/__init__.py``. Importações subsequentes de ``parent.two`` ou ``parent.three`` vão executar ``parent/two/__init__.py`` e ``parent/three/__init__.py``, respectivamente.

source: Namespace packages
pt_br: Pacotes de espaço de nomes

source: A namespace package is a composite of various :term:`portions <portion>`, where each portion contributes a subpackage to the parent package. Portions may reside in different locations on the file system. Portions may also be found in zip files, on the network, or anywhere else that Python searches during import. Namespace packages may or may not correspond directly to objects on the file system; they may be virtual modules that have no concrete representation.
pt_br: Um pacote de espaço de nomes é um composto de várias :term:`porções <portion>`, em que cada parte contribui com um subpacote para o pacote pai. Partes podem residir em locais diferentes no sistema de arquivos. Partes também podem ser encontradas em arquivos zip, na rede ou em qualquer outro lugar que o Python pesquisar durante a importação. Os pacotes de espaço de nomes podem ou não corresponder diretamente aos objetos no sistema de arquivos; eles podem ser módulos virtuais que não têm representação concreta.

source: Namespace packages do not use an ordinary list for their ``__path__`` attribute. They instead use a custom iterable type which will automatically perform a new search for package portions on the next import attempt within that package if the path of their parent package (or :data:`sys.path` for a top level package) changes.
pt_br: Os pacotes de espaço de nomes não usam uma lista comum para o atributo ``__path__``. Em vez disso, eles usam um tipo iterável personalizado que executará automaticamente uma nova pesquisa por partes do pacote na próxima tentativa de importação dentro desse pacote, se o caminho do pacote pai (ou :data:`sys.path` para um pacote de nível superior) for alterado.

source: With namespace packages, there is no ``parent/__init__.py`` file. In fact, there may be multiple ``parent`` directories found during import search, where each one is provided by a different portion. Thus ``parent/one`` may not be physically located next to ``parent/two``. In this case, Python will create a namespace package for the top-level ``parent`` package whenever it or one of its subpackages is imported.
pt_br: Com pacotes de espaço de nomes, não há arquivo ``pai/__init__.py``. De fato, pode haver vários diretórios ``pai`` encontrados durante a pesquisa de importação, onde cada um é fornecido por uma parte diferente. Portanto, ``pai/um`` pode não estar fisicamente localizado próximo a ``pai/dois``. Nesse caso, o Python criará um pacote de espaço de nomes para o pacote ``pai`` de nível superior sempre que ele ou um de seus subpacotes for importado.

source: See also :pep:`420` for the namespace package specification.
pt_br: Veja também :pep:`420` para a especificação de pacotes de espaço de nomes.

source: Searching
pt_br: Caminho de busca

source: To begin the search, Python needs the :term:`fully qualified <qualified name>` name of the module (or package, but for the purposes of this discussion, the difference is immaterial) being imported. This name may come from various arguments to the :keyword:`import` statement, or from the parameters to the :func:`importlib.import_module` or :func:`__import__` functions.
pt_br: Para iniciar a busca, o Python precisa do nome :term:`completo <qualified name>` do módulo (ou pacote, mas para o propósito dessa exposição, não há diferença) que se quer importar. Esse nome vem de vários argumentos passados para a instrução :keyword:`import`, ou dos parâmetros das funções :func:`importlib.import_module` ou :func:`__import__`.

source: This name will be used in various phases of the import search, and it may be the dotted path to a submodule, e.g. ``foo.bar.baz``. In this case, Python first tries to import ``foo``, then ``foo.bar``, and finally ``foo.bar.baz``. If any of the intermediate imports fail, a :exc:`ModuleNotFoundError` is raised.
pt_br: Esse nome será usado em várias fases da busca da importação, e pode ser um nome com pontos para um submódulo como, por exemplo, ``foo.bar.baz``. Nesse caso, Python primeiro tenta importar ``foo``, depois ``foo.bar`` e, finalmente, ``foo.bar.baz``. Se alguma das importações intermediárias falharem, uma exceção :exc:`ModuleNotFoundError` é levantada.

source: The module cache
pt_br: O cache de módulos

source: The first place checked during import search is :data:`sys.modules`. This mapping serves as a cache of all modules that have been previously imported, including the intermediate paths. So if ``foo.bar.baz`` was previously imported, :data:`sys.modules` will contain entries for ``foo``, ``foo.bar``, and ``foo.bar.baz``. Each key will have as its value the corresponding module object.
pt_br: A primeira verificação durante a busca da importação é feita no :data:`sys.modules`. Esse mapeamento serve como um cache de todos os módulos que já foram importados previamente, incluindo os caminhos intermediários. Se ``foo.bar.baz`` foi previamente importado, :data:`sys.modules` conterá entradas para ``foo``, ``foo.bar`` e ``foo.bar.baz``. Cada chave terá como valor um objeto módulo correspondente.

source: During import, the module name is looked up in :data:`sys.modules` and if present, the associated value is the module satisfying the import, and the process completes. However, if the value is ``None``, then a :exc:`ModuleNotFoundError` is raised. If the module name is missing, Python will continue searching for the module.
pt_br: Durante a importação, o nome do módulo é procurado em :data:`sys.modules` e, se estiver presente, o valor associado é o módulo que satisfaz a importação, e o processo termina. Entretanto, se o valor é ``None``, uma exceção :exc:`ModuleNotFoundError` é levantada. Se o nome do módulo não foi encontrado, Python continuará a busca pelo módulo.

source: :data:`sys.modules` is writable. Deleting a key may not destroy the associated module (as other modules may hold references to it), but it will invalidate the cache entry for the named module, causing Python to search anew for the named module upon its next import. The key can also be assigned to ``None``, forcing the next import of the module to result in a :exc:`ModuleNotFoundError`.
pt_br: É possível alterar :data:`sys.modules`. Apagar uma chave pode não destruir o objeto módulo associado (outros módulos podem manter referências para ele), mas a entrada do cache será invalidada para o nome daquele módulo, fazendo Python executar nova busca na próxima importação. Pode ser atribuído ``None`` para a chave, forçando que a próxima importação do módulo resulte numa exceção :exc:`ModuleNotFoundError`.

source: Beware though, as if you keep a reference to the module object, invalidate its cache entry in :data:`sys.modules`, and then re-import the named module, the two module objects will *not* be the same. By contrast, :func:`importlib.reload` will reuse the *same* module object, and simply reinitialise the module contents by rerunning the module's code.
pt_br: No entanto, tenha cuidado, pois se você mantiver uma referência para o objeto módulo, invalidar sua entrada de cache em :data:`sys.modules` e, em seguida, reimportar do módulo nomeado, os dois módulo objetos *não* serão os mesmos. Por outro lado, o :func:`importlib.reload` reutilizará o *mesmo* objeto módulo e simplesmente reinicializará o conteúdo do módulo executando novamente o código do módulo.

source: Finders and loaders
pt_br: Localizadores e carregadores

source: If the named module is not found in :data:`sys.modules`, then Python's import protocol is invoked to find and load the module. This protocol consists of two conceptual objects, :term:`finders <finder>` and :term:`loaders <loader>`. A finder's job is to determine whether it can find the named module using whatever strategy it knows about. Objects that implement both of these interfaces are referred to as :term:`importers <importer>` - they return themselves when they find that they can load the requested module.
pt_br: Se o módulo nomeado não for encontrado em :data:`sys.modules`, então o protocolo de importação do Python é invocado para localizar e carregar o módulo. Este protocolo consiste em dois objetos conceituais, :term:`localizadores <finder>` e :term:`carregadores <loader>`. O trabalho de um localizador é determinar se ele pode localizar o módulo nomeado usando qualquer estratégia que ele conheça. Objetos que implementam ambas essas interfaces são referenciadas como :term:`importadores <importer>` -- eles retornam a si mesmos, quando eles descobrem que eles podem carregar o módulo requisitado.

source: Python includes a number of default finders and importers. The first one knows how to locate built-in modules, and the second knows how to locate frozen modules. A third default finder searches an :term:`import path` for modules. The :term:`import path` is a list of locations that may name file system paths or zip files. It can also be extended to search for any locatable resource, such as those identified by URLs.
pt_br: Python inclui um número de localizadores e carregadores padrões. O primeiro sabe como localizar módulos embutidos, e o segundo sabe como localizar módulos congelados. Um terceiro localizador padrão procura em um :term:`caminho de importação` por módulos. O :term:`caminho de importação` é uma lista de localizações que podem nomear caminhos de sistema de arquivo ou arquivos zip. Ele também pode ser estendido para buscar por qualquer recurso localizável, tais como aqueles identificados por URLs.

source: The import machinery is extensible, so new finders can be added to extend the range and scope of module searching.
pt_br: O mecanismo de importação é extensível, então novos localizadores podem ser adicionados para estender o alcance e o escopo de buscar módulos.

source: Finders do not actually load modules. If they can find the named module, they return a :dfn:`module spec`, an encapsulation of the module's import-related information, which the import machinery then uses when loading the module.
pt_br: Localizadores na verdade não carregam módulos. Se eles conseguirem encontrar o módulo nomeado, eles retornam um :dfn:`spec de módulo`, um encapsulamento da informação relacionada a importação do módulo, a qual o mecanismo de importação então usa quando o módulo é carregado.

source: The following sections describe the protocol for finders and loaders in more detail, including how you can create and register new ones to extend the import machinery.
pt_br: As seguintes seções descrevem o protocolo para localizadores e carregadores em mais detalhes, incluindo como você pode criar e registrar novos para estender o mecanismo de importação.

source: In previous versions of Python, finders returned :term:`loaders <loader>` directly, whereas now they return module specs which *contain* loaders. Loaders are still used during import but have fewer responsibilities.
pt_br: Em versões anteriores do Python, localizadores retornavam :term:`carregadores <loader>` diretamente, enquanto agora eles retornam especificações de módulo, as qual *contêm* carregadores. Carregadores ainda são usados durante a importação, mas possuem menos responsabilidades.

source: Import hooks
pt_br: Ganchos de importação

source: The import machinery is designed to be extensible; the primary mechanism for this are the *import hooks*. There are two types of import hooks: *meta hooks* and *import path hooks*.
pt_br: O mecanismo de importação é desenhado para ser extensível; o mecanismo primário para isso são os *ganchos de importação*. Existem dois tipos de ganchos de importação: *metaganchos* e *ganchos de importação de caminho*.

source: Meta hooks are called at the start of import processing, before any other import processing has occurred, other than :data:`sys.modules` cache look up. This allows meta hooks to override :data:`sys.path` processing, frozen modules, or even built-in modules. Meta hooks are registered by adding new finder objects to :data:`sys.meta_path`, as described below.
pt_br: Metaganchos são chamados no início do processo de importação, antes que qualquer outro processo de importação tenha ocorrido, que não seja busca de cache de :data:`sys.modules`. Isso permite aos metaganchos substituir processamento de :data:`sys.path`, módulos congelados ou mesmo módulos embutidos. Metaganchos são registrados adicionando novos objetos localizadores a :data:`sys.meta_path`, conforme descrito abaixo.

source: Import path hooks are called as part of :data:`sys.path` (or ``package.__path__``) processing, at the point where their associated path item is encountered. Import path hooks are registered by adding new callables to :data:`sys.path_hooks` as described below.
pt_br: Ganchos de caminho de importação são chamados como parte do processamento de :data:`sys.path` (ou ``package.__path__``), no ponto onde é encontrado o item do caminho associado. Ganchos de caminho de importação são registrados adicionando novos chamáveis para :data:`sys.path_hooks`, conforme descrito abaixo.

source: The meta path
pt_br: O metacaminho
