Repository: python/python-docs-pt-br
Catalog: reference/import.po
Languages: pt_br

source: When the named module is not found in :data:`sys.modules`, Python next searches :data:`sys.meta_path`, which contains a list of meta path finder objects. These finders are queried in order to see if they know how to handle the named module. Meta path finders must implement a method called :meth:`~importlib.abc.MetaPathFinder.find_spec()` which takes three arguments: a name, an import path, and (optionally) a target module. The meta path finder can use any strategy it wants to determine whether it can handle the named module or not.
pt_br: Quando o módulo nomeado não é encontrado em :data:`sys.modules`, Python em seguida busca :data:`sys.meta_path`, o qual contém uma lista de objetos localizador de metacaminho. Esses buscadores são consultados a fim de verificar se eles sabem como manipular o módulo nomeado. Os localizadores de metacaminho devem implementar um método chamado :meth:`~importlib.abc.MetaPathFinder.find_spec()`, o qual recebe três argumentos: um nome, um caminho de importação, e (opcionalmente) um módulo alvo. O localizador de metacaminho pode usar qualquer estratégia que ele quiser para determinar se ele pode manipular o módulo nomeado ou não.

source: If the meta path finder knows how to handle the named module, it returns a spec object. If it cannot handle the named module, it returns ``None``. If :data:`sys.meta_path` processing reaches the end of its list without returning a spec, then a :exc:`ModuleNotFoundError` is raised. Any other exceptions raised are simply propagated up, aborting the import process.
pt_br: Se o localizador de metacaminho souber como tratar o módulo nomeado, ele retorna um objeto spec. Se ele não puder tratar o módulo nomeado, ele retorna ``None``. Se o processamento de :data:`sys.meta_path` alcançar o fim da sua lista sem retornar um spec, então :exc:`ModuleNotFoundError` é levantada. Quaisquer outras exceções levantadas são simplesmente propagadas para cima, abortando o processo de importação.

source: The :meth:`~importlib.abc.MetaPathFinder.find_spec()` method of meta path finders is called with two or three arguments. The first is the fully qualified name of the module being imported, for example ``foo.bar.baz``. The second argument is the path entries to use for the module search. For top-level modules, the second argument is ``None``, but for submodules or subpackages, the second argument is the value of the parent package's ``__path__`` attribute. If the appropriate ``__path__`` attribute cannot be accessed, a :exc:`ModuleNotFoundError` is raised. The third argument is an existing module object that will be the target of loading later. The import system passes in a target module only during reload.
pt_br: O método :meth:`~importlib.abc.MetaPathFinder.find_spec()` dos localizadores de metacaminhos é chamado com dois ou três argumentos. O primeiro é o nome totalmente qualificado do módulo sendo importado, por exemplo ``foo.bar.baz``. O segundo argumento é o caminho de entradas para usar para a busca do módulo. Para módulos de alto nível, o segundo argumento é ``None``, mas para submódulos ou subpacotes, o segundo argumento é o valor do atributo ``__path__`` do pacote pai. Se o atributo ``__path__`` apropriado não puder ser acessado, uma exceção :exc:`ModuleNotFoundError` é levantada. O terceiro argumento é um objeto módulo existente que será o alvo do carregamento posteriormente. O sistema de importação passa um módulo alvo apenas durante o recarregamento.

source: The meta path may be traversed multiple times for a single import request. For example, assuming none of the modules involved has already been cached, importing ``foo.bar.baz`` will first perform a top level import, calling ``mpf.find_spec("foo", None, None)`` on each meta path finder (``mpf``). After ``foo`` has been imported, ``foo.bar`` will be imported by traversing the meta path a second time, calling ``mpf.find_spec("foo.bar", foo.__path__, None)``. Once ``foo.bar`` has been imported, the final traversal will call ``mpf.find_spec("foo.bar.baz", foo.bar.__path__, None)``.
pt_br: O metacaminho pode ser percorrido múltiplas vezes para uma requisição de importação individual. Por exemplo, presumindo que nenhum dos módulos envolvidos já tenha sido cacheado, importar ``foo.bar.baz`` irá primeiro executar uma importação de alto nível, chamando ``mpf.find_spec("foo", None, None)`` em cada localizador de metacaminho (``mpf``). Depois que ``foo`` foi importado, ``foo.bar`` será importado percorrendo o metacaminho uma segunda vez, chamando ``mpf.find_spec("foo.bar", foo.__path__, None)``. Uma vez que ``foo.bar`` tenha sido importado, a travessia final irá chamar ``mpf.find_spec("foo.bar.baz", foo.bar.__path__, None)``.

source: Some meta path finders only support top level imports. These importers will always return ``None`` when anything other than ``None`` is passed as the second argument.
pt_br: Alguns localizadores de metacaminho apenas dão suporte a importações de alto nível. Estes importadores vão sempre retornar ``None`` quando qualquer coisa diferente de ``None`` for passada como o segundo argumento.

source: Python's default :data:`sys.meta_path` has three meta path finders, one that knows how to import built-in modules, one that knows how to import frozen modules, and one that knows how to import modules from an :term:`import path` (i.e. the :term:`path based finder`).
pt_br: O :data:`sys.meta_path` padrão do Python possui três localizador de metacaminho, um que sabe como importar módulos embutidos, um que sabe como importar módulos congelados, e outro que sabe como importar módulos de um :term:`caminho de importação` (isto é, o :term:`localizador baseado no caminho`).

source: Loading
pt_br: Carregando

source: If and when a module spec is found, the import machinery will use it (and the loader it contains) when loading the module. Here is an approximation of what happens during the loading portion of import::
pt_br: Se e quando uma spec de módulo é encontrada, o mecanismo de importação vai usá-la (e o carregador que ela contém) durante o carregamento do módulo. Esta é uma aproximação do que acontece durante a etapa de carregamento de uma importação::

source: Note the following details:
pt_br: Perceba os seguintes detalhes:

source: If there is an existing module object with the given name in :data:`sys.modules`, import will have already returned it.
pt_br: Se houver um objeto módulo existente com o nome fornecido em :data:`sys.modules`, a importação já tera retornado ele.

source: The module will exist in :data:`sys.modules` before the loader executes the module code. This is crucial because the module code may (directly or indirectly) import itself; adding it to :data:`sys.modules` beforehand prevents unbounded recursion in the worst case and multiple loading in the best.
pt_br: O módulo irá existir em :data:`sys.modules` antes do carregador executar o código do módulo. Isso é crucial porque o código do módulo pode (direta ou indiretamente) importar a si mesmo; adicioná-lo a :data:`sys.modules` antecipadamente previne recursão infinita no pior caso e múltiplos carregamentos no melhor caso.

source: If loading fails, the failing module -- and only the failing module -- gets removed from :data:`sys.modules`. Any module already in the :data:`sys.modules` cache, and any module that was successfully loaded as a side-effect, must remain in the cache. This contrasts with reloading where even the failing module is left in :data:`sys.modules`.
pt_br: Se o carregamento falhar, o módulo com falha -- e apenas o módulo com falha -- é removido de :data:`sys.modules`. Qualquer módulo já presente no cache de :data:`sys.modules`, e qualquer módulo que tenha sido carregado com sucesso como um efeito colateral, deve permanecer no cache. Isso contrasta com recarregamento, onde mesmo o módulo com falha é mantido em :data:`sys.modules`.

source: After the module is created but before execution, the import machinery sets the import-related module attributes ("_init_module_attrs" in the pseudo-code example above), as summarized in a :ref:`later section <import-mod-attrs>`.
pt_br: Depois que o módulo é criado, mas antes da execução, o mecanismo de importação define os atributos de módulo relacionados a importação ("_init_module_attrs" no exemplo de pseudocódigo acima), assim como foi resumido em :ref:`uma seção posterior <import-mod-attrs>`.

source: Module execution is the key moment of loading in which the module's namespace gets populated. Execution is entirely delegated to the loader, which gets to decide what gets populated and how.
pt_br: Execução de módulo é o momento chave do carregamento, no qual o espaço de nomes do módulo é populado. Execução é inteiramente delegada para o carregador, o qual pode decidir o que será populado e como.

source: The module created during loading and passed to exec_module() may not be the one returned at the end of import [#fnlo]_.
pt_br: O módulo criado durante o carregamento e passado para exec_module() pode não ser aquele retornado ao final da importação [#fnlo]_.

source: The import system has taken over the boilerplate responsibilities of loaders. These were previously performed by the :meth:`importlib.abc.Loader.load_module` method.
pt_br: O sistema de importação tem tomado conta das responsabilidades inerentes dos carregadores. Essas responsabilidades eram anteriormente executadas pelo método :meth:`importlib.abc.Loader.load_module`.

source: Loaders
pt_br: Carregadores

source: Module loaders provide the critical function of loading: module execution. The import machinery calls the :meth:`importlib.abc.Loader.exec_module` method with a single argument, the module object to execute. Any value returned from :meth:`~importlib.abc.Loader.exec_module` is ignored.
pt_br: Os carregadores de módulo fornecem a função crítica de carregamento: execução do módulo. O mecanismo de importação chama o método :meth:`importlib.abc.Loader.exec_module` com um único argumento, o objeto do módulo a ser executado. Qualquer valor retornado de :meth:`~importlib.abc.Loader.exec_module` é ignorado.

source: Loaders must satisfy the following requirements:
pt_br: Os carregadores devem atender aos seguintes requisitos:

source: If the module is a Python module (as opposed to a built-in module or a dynamically loaded extension), the loader should execute the module's code in the module's global name space (``module.__dict__``).
pt_br: Se o módulo for um módulo Python (em oposição a um módulo embutido ou uma extensão carregada dinamicamente), o carregador deve executar o código do módulo no espaço de nomes global do módulo (``module.__dict__``).

source: If the loader cannot execute the module, it should raise an :exc:`ImportError`, although any other exception raised during :meth:`~importlib.abc.Loader.exec_module` will be propagated.
pt_br: Se o carregador não puder executar o módulo, ele deve levantar uma execção :exc:`ImportError`, embora qualquer outra exceção levantada durante :meth:`~importlib.abc.Loader.exec_module` será propagada.

source: In many cases, the finder and loader can be the same object; in such cases the :meth:`~importlib.abc.MetaPathFinder.find_spec` method would just return a spec with the loader set to ``self``.
pt_br: Em muitos casos, o localizador e o carregador podem ser o mesmo objeto; nesses casos o método :meth:`~importlib.abc.MetaPathFinder.find_spec` apenas retornaria um spec com o carregador definido como ``self``.

source: Module loaders may opt in to creating the module object during loading by implementing a :meth:`~importlib.abc.Loader.create_module` method. It takes one argument, the module spec, and returns the new module object to use during loading. ``create_module()`` does not need to set any attributes on the module object. If the method returns ``None``, the import machinery will create the new module itself.
pt_br: Os carregadores de módulo podem optar por criar o objeto do módulo durante o carregamento, implementando um método :meth:`~importlib.abc.Loader.create_module`. Leva um argumento, o spec de módulo e retorna o novo objeto do módulo para usar durante o carregamento. ``create_module()`` não precisa definir nenhum atributo no objeto do módulo. Se o método retornar ``None``, o mecanismo de importação criará ele mesmo o novo módulo.

source: The :meth:`~importlib.abc.Loader.create_module` method of loaders.
pt_br: O método :meth:`~importlib.abc.Loader.create_module` de carregadores.

source: The :meth:`~importlib.abc.Loader.load_module` method was replaced by :meth:`~importlib.abc.Loader.exec_module` and the import machinery assumed all the boilerplate responsibilities of loading.
pt_br: O método :meth:`~importlib.abc.Loader.load_module` foi substituído por :meth:`~importlib.abc.Loader.exec_module` e o mecanismo de importação assumiu todas as responsabilidades inerentes de carregamento.

source: For compatibility with existing loaders, the import machinery will use the ``load_module()`` method of loaders if it exists and the loader does not also implement ``exec_module()``. However, ``load_module()`` has been deprecated and loaders should implement ``exec_module()`` instead.
pt_br: Para compatibilidade com carregadores existentes, o mecanismo de importação usará o método ``load_module()`` de carregadores se ele existir e o carregador também não implementar ``exec_module()``. No entanto, ``load_module()`` foi descontinuado e os carregadores devem implementar ``exec_module()`` em seu lugar.

source: The ``load_module()`` method must implement all the boilerplate loading functionality described above in addition to executing the module. All the same constraints apply, with some additional clarification:
pt_br: O método ``load_module()`` deve implementar toda a funcionalidade inerente de carregamento descrita acima, além de executar o módulo. Todas as mesmas restrições se aplicam, com alguns esclarecimentos adicionais:

source: If there is an existing module object with the given name in :data:`sys.modules`, the loader must use that existing module. (Otherwise, :func:`importlib.reload` will not work correctly.) If the named module does not exist in :data:`sys.modules`, the loader must create a new module object and add it to :data:`sys.modules`.
pt_br: Se houver um objeto de módulo existente com o nome fornecido em :data:`sys.modules`, o carregador deverá usar esse módulo existente. (Caso contrário, :func:`importlib.reload` não funcionará corretamente.) Se o módulo nomeado não existir em :data:`sys.modules`, o carregador deverá criar um novo objeto de módulo e adicioná-lo a :data:`sys.modules`.

source: The module *must* exist in :data:`sys.modules` before the loader executes the module code, to prevent unbounded recursion or multiple loading.
pt_br: O módulo *deve* existir em :data:`sys.modules` antes que o carregador execute o código do módulo, para evitar recursão ilimitada ou carregamento múltiplo.

source: If loading fails, the loader must remove any modules it has inserted into :data:`sys.modules`, but it must remove **only** the failing module(s), and only if the loader itself has loaded the module(s) explicitly.
pt_br: Se o carregamento falhar, o carregador deverá remover quaisquer módulos inseridos em :data:`sys.modules`, mas deverá remover **apenas** o(s) módulo(s) com falha, e somente se o próprio carregador tiver carregado o(s) módulo(s) explicitamente.

source: A :exc:`DeprecationWarning` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
pt_br: Uma exceção :exc:`DeprecationWarning` é levantada quando ``exec_module()`` está definido, mas ``create_module()`` não.

source: An :exc:`ImportError` is raised when ``exec_module()`` is defined but ``create_module()`` is not.
pt_br: Uma exceção :exc:`ImportError` é levantada quando ``exec_module()`` está definido, mas ``create_module()`` não.

source: Use of ``load_module()`` will raise :exc:`ImportWarning`.
pt_br: O uso de ``load_module()`` vai levantar :exc:`ImportWarning`.

source: Submodules
pt_br: Submódulos

source: When a submodule is loaded using any mechanism (e.g. ``importlib`` APIs, the ``import`` or ``import-from`` statements, or built-in ``__import__()``) a binding is placed in the parent module's namespace to the submodule object. For example, if package ``spam`` has a submodule ``foo``, after importing ``spam.foo``, ``spam`` will have an attribute ``foo`` which is bound to the submodule. Let's say you have the following directory structure::
pt_br: Quando um submódulo é carregado usando qualquer mecanismo (por exemplo, APIs ``importlib``, as instruções ``import`` ou ``import-from``, ou a função ``__import__()`` embutida) uma ligação é colocada no espaço de nomes do módulo pai para o objeto submódulo. Por exemplo, se o pacote ``spam`` tiver um submódulo ``foo``, após importar ``spam.foo``, ``spam`` terá um atributo ``foo`` que está vinculado ao submódulo. Digamos que você tenha a seguinte estrutura de diretórios::

source: and ``spam/__init__.py`` has the following line in it::
pt_br: e ``spam/__init__.py`` tem a seguinte linha::

source: then executing the following puts name bindings for ``foo`` and ``Foo`` in the ``spam`` module::
pt_br: então executar o seguinte coloca ligações de nome para ``foo`` e ``Foo`` no módulo ``spam``::

source: Given Python's familiar name binding rules this might seem surprising, but it's actually a fundamental feature of the import system. The invariant holding is that if you have ``sys.modules['spam']`` and ``sys.modules['spam.foo']`` (as you would after the above import), the latter must appear as the ``foo`` attribute of the former.
pt_br: Dadas as conhecidas regras de ligação de nomes do Python, isso pode parecer surpreendente, mas na verdade é um recurso fundamental do sistema de importação. A propriedade invariante é que se você tiver ``sys.modules['spam']`` e ``sys.modules['spam.foo']`` (como faria após a importação acima), o último deve aparecer como o atributo ``foo`` do primeiro.

source: Module spec
pt_br: Especificação do módulo

source: The import machinery uses a variety of information about each module during import, especially before loading. Most of the information is common to all modules. The purpose of a module's spec is to encapsulate this import-related information on a per-module basis.
pt_br: O mecanismo de importação utiliza diversas informações sobre cada módulo durante a importação, principalmente antes do carregamento. A maior parte das informações é comum a todos os módulos. O propósito da spec do módulo é encapsular essas informações relacionadas à importação por módulo.

source: Using a spec during import allows state to be transferred between import system components, e.g. between the finder that creates the module spec and the loader that executes it. Most importantly, it allows the import machinery to perform the boilerplate operations of loading, whereas without a module spec the loader had that responsibility.
pt_br: Usar um spec durante a importação permite que o estado seja transferido entre componentes do sistema de importação, por exemplo entre o localizador que cria o spec de módulo e o carregador que o executa. Mais importante ainda, permite que o mecanismo de importação execute as operações inerentes de carregamento, enquanto que sem um spec de módulo o carregador tinha essa responsabilidade.

source: The module's spec is exposed as the ``__spec__`` attribute on a module object. See :class:`~importlib.machinery.ModuleSpec` for details on the contents of the module spec.
pt_br: A especificação do módulo é exposta como o atributo ``__spec__`` em um objeto módulo. Veja :class:`~importlib.machinery.ModuleSpec` para detalhes sobre o conteúdo da especificação do módulo.

source: Import-related module attributes
pt_br: Atributos de módulo relacionados à importação

source: The import machinery fills in these attributes on each module object during loading, based on the module's spec, before the loader executes the module.
pt_br: O mecanismo de importação preenche esses atributos em cada objeto do módulo durante o carregamento, com base na especificação do módulo, antes que o carregador execute o módulo.

source: The ``__name__`` attribute must be set to the fully qualified name of the module. This name is used to uniquely identify the module in the import system.
pt_br: O atributo ``__name__`` deve ser definido como o nome totalmente qualificado do módulo. Este nome é usado para identificar exclusivamente o módulo no sistema de importação.

source: The ``__loader__`` attribute must be set to the loader object that the import machinery used when loading the module. This is mostly for introspection, but can be used for additional loader-specific functionality, for example getting data associated with a loader.
pt_br: O atributo ``__loader__`` deve ser definido para o objeto carregador que o mecanismo de importação usou ao carregar o módulo. Isto é principalmente para introspecção, mas pode ser usado para funcionalidades adicionais específicas do carregador, por exemplo, obter dados associados a um carregador.

source: The value of ``__package__`` is expected to be the same as ``__spec__.parent``.
pt_br: Espera-se que o valor de ``__package__`` seja o mesmo que ``__spec__.parent``.

source: The ``__spec__`` attribute must be set to the module spec that was used when importing the module. Setting ``__spec__`` appropriately applies equally to :ref:`modules initialized during interpreter startup <programs>`. The one exception is ``__main__``, where ``__spec__`` is :ref:`set to None in some cases <main_spec>`.
pt_br: O atributo ``__spec__`` deve ser definido para a especificação do módulo que foi usada ao importar o módulo. Definir ``__spec__`` apropriadamente se aplica igualmente a :ref:`módulos inicializados durante a inicialização do interpretador <programs>`. A única exceção é ``__main__``, onde ``__spec__`` é :ref:`definido como None em alguns casos <main_spec>`.

source: ``__spec__.parent`` is used as a fallback when ``__package__`` is not defined.
pt_br: ``__spec__.parent`` é usado como uma alternativa quando ``__package__`` não está definido.

source: If the module is a package (either regular or namespace), the module object's ``__path__`` attribute must be set. The value must be iterable, but may be empty if ``__path__`` has no further significance. If ``__path__`` is not empty, it must produce strings when iterated over. More details on the semantics of ``__path__`` are given :ref:`below <package-path-rules>`.
pt_br: Se o módulo for um pacote (normal ou espaço de nomes), o atributo ``__path__`` do objeto do módulo deve ser definido. O valor deve ser iterável, mas pode estar vazio se ``__path__`` não tiver mais significado. Se ``__path__`` não estiver vazio, ele deverá produzir strings quando iterado. Mais detalhes sobre a semântica de ``__path__`` são fornecidos :ref:`abaixo <package-path-rules>`.

source: Non-package modules should not have a ``__path__`` attribute.
pt_br: Módulos que não são de pacote não devem ter um atributo ``__path__``.
