Repository: python/python-docs-pt-br
Catalog: reference/introduction.po
Languages: pt_br

source: Introduction
pt_br: Introdução

source: This reference manual describes the Python programming language. It is not intended as a tutorial.
pt_br: Este manual de referência descreve a linguagem de programação Python. O mesmo não tem como objetivo de ser um tutorial.

source: While I am trying to be as precise as possible, I chose to use English rather than formal specifications for everything except syntax and lexical analysis. This should make the document more understandable to the average reader, but will leave room for ambiguities. Consequently, if you were coming from Mars and tried to re-implement Python from this document alone, you might have to guess things and in fact you would probably end up implementing quite a different language. On the other hand, if you are using Python and wonder what the precise rules about a particular area of the language are, you should definitely be able to find them here. If you would like to see a more formal definition of the language, maybe you could volunteer your time --- or invent a cloning machine :-).
pt_br: Enquanto estou tentando ser o mais preciso possível, optei por usar especificações em inglês e não formal para tudo, exceto para a sintaxe e análise léxica. Isso deve tornar o documento mais compreensível para o leitor intermediário, mas deixará margem para ambiguidades. Consequentemente, caso estivesses vindo de Marte e tentasse reimplementar o Python a partir deste documento, sozinho, talvez precisarias adivinhar algumas coisas e, na verdade, provavelmente acabaria por implementar um linguagem bem diferente. Por outro lado, se estiveres usando o Python e se perguntando quais são as regras precisas sobre uma determinada área da linguagem, você definitivamente encontrá neste documento o que estás procurando. Caso queiras ver uma definição mais formal do linguagem, talvez possas oferecer seu tempo -- ou inventar uma máquina de clonagem :-).

source: It is dangerous to add too many implementation details to a language reference document --- the implementation may change, and other implementations of the same language may work differently. On the other hand, CPython is the one Python implementation in widespread use (although alternate implementations continue to gain support), and its particular quirks are sometimes worth being mentioned, especially where the implementation imposes additional limitations. Therefore, you'll find short "implementation notes" sprinkled throughout the text.
pt_br: É perigoso adicionar muitos detalhes de implementação num documento de referência de uma linguagem -- a implementação pode mudar e outras implementações da mesma linguagem podem funcionar de forma diferente. Por outro lado, o CPython é a única implementação de Python em uso de forma generalizada (embora as implementações alternativas continuem a ganhar suporte), e suas peculiaridades e particulares são por vezes dignas de serem mencionadas, especialmente quando a implementação impõe limitações adicionais. Portanto, encontrarás poucas "notas sobre a implementação" espalhadas neste documento.

source: Every Python implementation comes with a number of built-in and standard modules. These are documented in :ref:`library-index`. A few built-in modules are mentioned when they interact in a significant way with the language definition.
pt_br: Cada implementação do Python vem com vários módulos embutidos e por padrão. Estes estão documentados em :ref:`library-index`. Alguns módulos embutidos são mencionados ao interagirem de forma significativa com a definição da linguagem.

source: Alternate Implementations
pt_br: Implementações Alternativas

source: Though there is one Python implementation which is by far the most popular, there are some alternate implementations which are of particular interest to different audiences.
pt_br: Embora exista uma implementação do Python que seja, de longe, a mais popular, existem algumas implementações alternativas que são de de interesse particular e para públicos diferentes.

source: Known implementations include:
pt_br: As implementações conhecidas são:

source: This is the original and most-maintained implementation of Python, written in C. New language features generally appear here first.
pt_br: Esta é a implementação original e a é a versão do Python que mais vem sendo sendo desenvolvido e a mesma está escrita com a linguagem C. Novas funcionalidades ou recursos da linguagem aparecerão por aqui primeiro.

source: Python implemented in Java. This implementation can be used as a scripting language for Java applications, or can be used to create applications using the Java class libraries. It is also often used to create tests for Java libraries. More information can be found at `the Jython website <https://www.jython.org/>`_.
pt_br: Versão do Python implementado em Java. Esta implementação pode ser usada como linguagem de Script em aplicações Java, ou pode ser usada para criar aplicativos usando as bibliotecas das classes do Java. Também vem sendo bastante utilizado para criar testes unitários para as bibliotecas do Java. Mais informações podem ser encontradas no `the Jython website <https://www.jython.org/>`_.

source: This implementation actually uses the CPython implementation, but is a managed .NET application and makes .NET libraries available. It was created by Brian Lloyd. For more information, see the `Python for .NET home page <https://pythonnet.github.io/>`_.
pt_br: Essa implementação utiliza de fato a implementação CPython, mas é uma aplicação gerenciada .NET e disponibilizada como uma bibliotecas .NET. Foi desenvolvida por Brian Lloyd. Para obter mais informações, consulte o `site do Python for .NET <https://pythonnet.github.io/>`_.

source: An alternate Python for .NET. Unlike Python.NET, this is a complete Python implementation that generates IL, and compiles Python code directly to .NET assemblies. It was created by Jim Hugunin, the original creator of Jython. For more information, see `the IronPython website <https://ironpython.net/>`_.
pt_br: Um versão alternativa do Python para a plataforma .NET. Ao contrário do Python.NET, esta é uma implementação completa do Python que gera IL e compila o código Python diretamente para assemblies .NET. Foi desenvolvida por Jim Hugunin, o criador original do Jython. Para obter mais informações, consulte `o site do IronPython <https://ironpython.net/>`_.

source: An implementation of Python written completely in Python. It supports several advanced features not found in other implementations like stackless support and a Just in Time compiler. One of the goals of the project is to encourage experimentation with the language itself by making it easier to modify the interpreter (since it is written in Python). Additional information is available on `the PyPy project's home page <https://pypy.org/>`_.
pt_br: Uma implementação do Python escrita completamente em Python. A mesma suporta vários recursos avançados não encontrados em outras implementações, como suporte sem pilhas e um compilador Just in Time. Um dos objetivos do projeto é incentivar a construção de experimentos com a própria linguagem, facilitando a modificação do interpretador (uma vez que o mesmos está escrito em Python). Informações adicionais estão disponíveis no `site do projeto PyPy <https://pypy.org/>`_.

source: Each of these implementations varies in some way from the language as documented in this manual, or introduces specific information beyond what's covered in the standard Python documentation. Please refer to the implementation-specific documentation to determine what else you need to know about the specific implementation you're using.
pt_br: Cada uma dessas implementações varia em alguma forma a linguagem conforme documentado neste manual, ou introduz informações específicas além do que está coberto na documentação padrão do Python. Consulte a documentação específica da implementação para determinar o que é necessário sobre a implementação específica que você está usando.

source: Notation
pt_br: Notação

source: The descriptions of lexical analysis and syntax use a grammar notation that is a mixture of `EBNF <https://en.wikipedia.org/wiki/Extended_Backus%E2%80%93Naur_form>`_ and `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_. For example:
pt_br: As descrições de análise lexical e sintaxe utilizam uma notação gramatical que é uma mistura de `EBNF <https://pt.m.wikipedia.org/wiki/Formalismo_de_Backus-Naur_Estendido>`_ e `GASE <https://pt.m.wikipedia.org/wiki/Gramática_de_análise_sintática_de_expressão>`_ (em inglês, PEG). Por exemplo:

source: In this example, the first line says that a ``name`` is a ``letter`` followed by a sequence of zero or more ``letter``\ s, ``digit``\ s, and underscores. A ``letter`` in turn is any of the single characters ``'a'`` through ``'z'`` and ``A`` through ``Z``; a ``digit`` is a single character from ``0`` to ``9``.
pt_br: Neste exemplo, a primeira linha diz que um ``name`` é uma ``letter`` seguida por uma sequência de zero ou mais ``letter``\ s, ``digit``\ s e sublinhados. Uma ``letter``, por sua vez, é qualquer um dos caracteres simples de ``'a'`` a ``'z'`` e de ``A`` a ``Z``; um ``digit`` é um caractere simples de ``0`` a ``9``.

source: Each rule begins with a name (which identifies the rule that's being defined) followed by a colon, ``:``. The definition to the right of the colon uses the following syntax elements:
pt_br: Cada regra começa com um nome (que identifica a regra que está sendo definida) seguido por caractere de dois pontos, ``:``. A definição à direita dos dois pontos utiliza os seguintes elementos de sintaxe:

source: ``name``: A name refers to another rule. Where possible, it is a link to the rule's definition.
pt_br: ``name``: Um nome se refere a outra regra. Sempre que possível, é um link para a definição da regra.

source: ``TOKEN``: An uppercase name refers to a :term:`token`. For the purposes of grammar definitions, tokens are the same as rules.
pt_br: ``TOKEN``: Um nome em maiúsculas refere-se a um :term:`token`. Para fins de definições gramaticais, tokens são o mesmo que regras.

source: ``"text"``, ``'text'``: Text in single or double quotes must match literally (without the quotes). The type of quote is chosen according to the meaning of ``text``:
pt_br: ``"text"``, ``'text'``: O texto entre aspas simples ou duplas deve ser escrito literalmente (sem as aspas). O tipo de citação é escolhido de acordo com o significado de ``text``:

source: ``'if'``: A name in single quotes denotes a :ref:`keyword <keywords>`.
pt_br: ``'if'``: Um nome entre aspas simples denota uma :ref:`palavra reservada <keywords>`.

source: ``"case"``: A name in double quotes denotes a :ref:`soft-keyword <soft-keywords>`.
pt_br: ``"case"``: Um nome entre aspas duplas denota uma :ref:`palavra reservada contextual <soft-keywords>`.

source: ``'@'``: A non-letter symbol in single quotes denotes an :py:data:`~token.OP` token, that is, a :ref:`delimiter <delimiters>` or :ref:`operator <operators>`.
pt_br: ``'@'``: Um símbolo que não seja uma letra entre aspas simples denota um token :py:data:`~token.OP`, ou seja, um :ref:`delimitador <delimiters>` ou :ref:`operador <operators>`.

source: ``e1 e2``: Items separated only by whitespace denote a sequence. Here, ``e1`` must be followed by ``e2``.
pt_br: ``e1 e2``: Itens separados apenas por espaços em branco denotam uma sequência. Aqui, ``e1`` deve ser seguido por ``e2``.

source: ``e1 | e2``: A vertical bar is used to separate alternatives. It denotes PEG's "ordered choice": if ``e1`` matches, ``e2`` is not considered. In traditional PEG grammars, this is written as a slash, ``/``, rather than a vertical bar. See :pep:`617` for more background and details.
pt_br: ``e1 | e2``: Uma barra vertical é usada para separar alternativas. Ela denota a "escolha ordenada" do GASE: se ``e1`` corresponder, ``e2`` não é considerado. Nas gramáticas GASE tradicionais, isso é escrito como uma barra, ``/``, em vez de uma barra vertical. Veja :pep:`617` para mais informações e detalhes.

source: ``e*``: A star means zero or more repetitions of the preceding item.
pt_br: ``e*``: Uma estrela significa zero ou mais repetições do item anterior.

source: ``e+``: Likewise, a plus means one or more repetitions.
pt_br: ``e+``: Da mesma forma, um mais significa uma ou mais repetições.

source: ``[e]``: A phrase enclosed in square brackets means zero or one occurrences. In other words, the enclosed phrase is optional.
pt_br: ``[e]``: Uma frase entre colchetes significa zero ou uma ocorrência. Em outras palavras, a frase entre colchetes é opcional.

source: ``e?``: A question mark has exactly the same meaning as square brackets: the preceding item is optional.
pt_br: ``e?``: Um ponto de interrogação tem exatamente o mesmo significado que colchetes: o item anterior é opcional.

source: ``(e)``: Parentheses are used for grouping.
pt_br: ``(e)``: Parênteses são usados para agrupamento.

source: The following notation is only used in :ref:`lexical definitions <notation-lexical-vs-syntactic>`.
pt_br: A notação a seguir é usada somente em :ref:`definições lexicais <notation-lexical-vs-syntactic>`.

source: ``"a"..."z"``: Two literal characters separated by three dots mean a choice of any single character in the given (inclusive) range of ASCII characters.
pt_br: ``"a"..."z"``: Dois caracteres literais separados por três pontos significam uma escolha de qualquer caractere único no intervalo fornecido (inclusive) de caracteres ASCII.

source: ``<...>``: A phrase between angular brackets gives an informal description of the matched symbol (for example, ``<any ASCII character except "\">``), or an abbreviation that is defined in nearby text (for example, ``<Lu>``).
pt_br: ``<...>``: Uma frase entre parênteses angulares fornece uma descrição informal do símbolo correspondente (por exemplo, ``<qualquer caractere ASCII, exceto "\">``) ou uma abreviação definida no texto próximo (por exemplo, ``<Lu>``).

source: Some definitions also use *lookaheads*, which indicate that an element must (or must not) match at a given position, but without consuming any input:
pt_br: Algumas definições também usam *lookaheads*, que indicam que um elemento deve (ou não) corresponder a uma determinada posição, mas sem consumir nenhuma entrada:

source: ``&e``: a positive lookahead (that is, ``e`` is required to match)
pt_br: ``&e``: um lookahead positivo (ou seja, ``e`` é necessário para corresponder)

source: ``!e``: a negative lookahead (that is, ``e`` is required *not* to match)
pt_br: ``!e``: um lookahead negativo (ou seja, ``e`` *não* é necessário para corresponder)

source: The unary operators (``*``, ``+``, ``?``) bind as tightly as possible; the vertical bar (``|``) binds most loosely.
pt_br: Os operadores unários (``*``, ``+``, ``?``) vinculam-se o mais firmemente possível; a barra vertical (``|``) vincula-se de forma mais frouxa.

source: White space is only meaningful to separate tokens.
pt_br: O espaço em branco só tem significado para separar tokens.

source: Rules are normally contained on a single line, but rules that are too long may be wrapped:
pt_br: As regras normalmente ficam contidas em uma única linha, mas regras muito longas podem ser encapsuladas:

source: Alternatively, rules may be formatted with the first line ending at the colon, and each alternative beginning with a vertical bar on a new line. For example:
pt_br: Alternativamente, as regras podem ser formatadas com a primeira linha terminando com dois pontos e cada alternativa começando com uma barra vertical em uma nova linha. Por exemplo:

source: This does *not* mean that there is an empty first alternative.
pt_br: Isso *não* significa que exista uma primeira alternativa vazia.

source: Lexical and Syntactic definitions
pt_br: Definições lexicais e sintáticas

source: There is some difference between *lexical* and *syntactic* analysis: the :term:`lexical analyzer` operates on the individual characters of the input source, while the *parser* (syntactic analyzer) operates on the stream of :term:`tokens <token>` generated by the lexical analysis. However, in some cases the exact boundary between the two phases is a CPython implementation detail.
pt_br: Há algumas diferenças entre a análise *léxica* e a *sintática*: o :term:`analisador léxico` opera nos caracteres individuais da fonte de entrada, enquanto o *parser* (analisador sintático) opera no fluxo de :term:`tokens <token>` gerados pela análise léxica. No entanto, em alguns casos, o limite exato entre as duas fases é um detalhe da implementação do CPython.

source: The practical difference between the two is that in *lexical* definitions, all whitespace is significant. The lexical analyzer :ref:`discards <whitespace>` all whitespace that is not converted to tokens like :data:`token.INDENT` or :data:`~token.NEWLINE`. *Syntactic* definitions then use these tokens, rather than source characters.
pt_br: A diferença prática entre os dois é que, em definições *léxicas*, todos os espaços em branco são significativos. O analisador léxico :ref:`descarta <whitespace>` todos os espaços em branco que não são convertidos em tokens como :data:`token.INDENT` ou :data:`~token.NEWLINE`. Definições *sintáticas* então usam esses tokens, em vez dos caracteres de origem.

source: This documentation uses the same BNF grammar for both styles of definitions. All uses of BNF in the next chapter (:ref:`lexical`) are lexical definitions; uses in subsequent chapters are syntactic definitions.
pt_br: Esta documentação utiliza a mesma gramática BNF para ambos os estilos de definição. Todos os usos de BNF no próximo capítulo (:ref:`lexical`) são definições lexicais; os usos nos capítulos subsequentes são definições sintáticas.

source: grammar
pt_br: gramática

source: syntax
pt_br: sintaxe

source: notation
pt_br: notação

source: lexical definitions
pt_br: léxicas, definições
