Repository: python/python-docs-pt-br
Catalog: reference/simple_stmts.po
Languages: pt_br

source: The *public names* defined by a module are determined by checking the module's namespace for a variable named ``__all__``; if defined, it must be a sequence of strings which are names defined or imported by that module. The names given in ``__all__`` are all considered public and are required to exist. If ``__all__`` is not defined, the set of public names includes all names found in the module's namespace which do not begin with an underscore character (``'_'``). ``__all__`` should contain the entire public API. It is intended to avoid accidentally exporting items that are not part of the API (such as library modules which were imported and used within the module).
pt_br: Os *nomes públicos* definidos por um módulo são determinados verificando o espaço de nomes do módulo para uma variável chamada ``__all__``; se definido, deve ser uma sequência de strings que são nomes definidos ou importados por esse módulo. Os nomes dados em ``__all__`` são todos considerados públicos e devem existir. Se ``__all__`` não estiver definido, o conjunto de nomes públicos inclui todos os nomes encontrados no espaço de nomes do módulo que não começam com um caractere sublinhado (``'_'``). ``__all__`` deve conter toda a API pública. Destina-se a evitar a exportação acidental de itens que não fazem parte da API (como módulos de biblioteca que foram importados e usados no módulo).

source: The wild card form of import --- ``from module import *`` --- is only allowed at the module level. Attempting to use it in class or function definitions will raise a :exc:`SyntaxError`.
pt_br: A forma curinga de importação --- ``from module import *`` --- só é permitida no nível do módulo. Tentar usá-lo em definições de classe ou função irá levantar uma :exc:`SyntaxError`.

source: When specifying what module to import you do not have to specify the absolute name of the module. When a module or package is contained within another package it is possible to make a relative import within the same top package without having to mention the package name. By using leading dots in the specified module or package after :keyword:`from` you can specify how high to traverse up the current package hierarchy without specifying exact names. One leading dot means the current package where the module making the import exists. Two dots means up one package level. Three dots is up two levels, etc. So if you execute ``from . import mod`` from a module in the ``pkg`` package then you will end up importing ``pkg.mod``. If you execute ``from ..subpkg2 import mod`` from within ``pkg.subpkg1`` you will import ``pkg.subpkg2.mod``. The specification for relative imports is contained in the :ref:`relativeimports` section.
pt_br: Ao especificar qual módulo importar, você não precisa especificar o nome absoluto do módulo. Quando um módulo ou pacote está contido em outro pacote, é possível fazer uma importação relativa dentro do mesmo pacote superior sem precisar mencionar o nome do pacote. Usando pontos iniciais no módulo ou pacote especificado após :keyword:`from` você pode especificar quão alto percorrer a hierarquia de pacotes atual sem especificar nomes exatos. Um ponto inicial significa o pacote atual onde o módulo que faz a importação existe. Dois pontos significam um nível de pacote acima. Três pontos são dois níveis acima, etc. Então, se você executar ``from . import mod`` de um módulo no pacote ``pkg`` então você acabará importando o ``pkg.mod``. Se você executar ``from ..subpkg2 import mod`` de dentro de ``pkg.subpkg1`` você irá importar ``pkg.subpkg2.mod``. A especificação para importações relativas está contida na seção :ref:`relativeimports`.

source: :func:`importlib.import_module` is provided to support applications that determine dynamically the modules to be loaded.
pt_br: :func:`importlib.import_module` é fornecida para dar suporte a aplicações que determinam dinamicamente os módulos a serem carregados.

source: Raises an :ref:`auditing event <auditing>` ``import`` with arguments ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``import`` com os argumentos ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.

source: Future statements
pt_br: Instruções future

source: A :dfn:`future statement` is a directive to the compiler that a particular module should be compiled using syntax or semantics that will be available in a specified future release of Python where the feature becomes standard.
pt_br: Uma :dfn:`instrução future` é uma diretiva para o compilador de que um determinado módulo deve ser compilado usando sintaxe ou semântica que estará disponível em uma versão futura especificada do Python, onde o recurso se tornará padrão.

source: The future statement is intended to ease migration to future versions of Python that introduce incompatible changes to the language. It allows use of the new features on a per-module basis before the release in which the feature becomes standard.
pt_br: A instrução future destina-se a facilitar a migração para versões futuras do Python que introduzem alterações incompatíveis na linguagem. Ele permite o uso dos novos recursos por módulo antes do lançamento em que o recurso se torna padrão.

source: A future statement must appear near the top of the module. The only lines that can appear before a future statement are:
pt_br: Uma instrução future deve aparecer perto do topo do módulo. As únicas linhas que podem aparecer antes de uma instrução future são:

source: the module docstring (if any),
pt_br: o módulo docstring (se houver),

source: comments,
pt_br: omentários,

source: blank lines, and
pt_br: linhas vazias e

source: other future statements.
pt_br: outras instruções future.

source: The only feature that requires using the future statement is ``annotations`` (see :pep:`563`).
pt_br: O único recurso que requer o uso da instrução future é ``annotations`` (veja :pep:`563`).

source: All historical features enabled by the future statement are still recognized by Python 3. The list includes ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` and ``with_statement``. They are all redundant because they are always enabled, and only kept for backwards compatibility.
pt_br: Todos os recursos históricos habilitados pela instrução future ainda são reconhecidos pelo Python 3. A lista inclui ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` e ``with_statement``. Eles são todos redundantes porque estão sempre habilitados e mantidos apenas para compatibilidade com versões anteriores.

source: A future statement is recognized and treated specially at compile time: Changes to the semantics of core constructs are often implemented by generating different code. It may even be the case that a new feature introduces new incompatible syntax (such as a new reserved word), in which case the compiler may need to parse the module differently. Such decisions cannot be pushed off until runtime.
pt_br: Uma instrução future é reconhecida e tratada especialmente em tempo de compilação: as alterações na semântica das construções principais são frequentemente implementadas gerando código diferente. Pode até ser o caso de um novo recurso introduzir uma nova sintaxe incompatível (como uma nova palavra reservada), caso em que o compilador pode precisar analisar o módulo de maneira diferente. Tais decisões não podem ser adiadas até o tempo de execução.

source: For any given release, the compiler knows which feature names have been defined, and raises a compile-time error if a future statement contains a feature not known to it.
pt_br: Para qualquer versão, o compilador sabe quais nomes de recursos foram definidos e levanta um erro em tempo de compilação se uma instrução future contiver um recurso desconhecido.

source: The direct runtime semantics are the same as for any import statement: there is a standard module :mod:`__future__`, described later, and it will be imported in the usual way at the time the future statement is executed.
pt_br: A semântica do tempo de execução direto é a mesma de qualquer instrução de importação: existe um módulo padrão :mod:`__future__`, descrito posteriormente, e será importado da maneira usual no momento em que a instrução future for executada.

source: The interesting runtime semantics depend on the specific feature enabled by the future statement.
pt_br: A semântica interessante do tempo de execução depende do recurso específico ativado pela instrução future.

source: Note that there is nothing special about the statement::
pt_br: Observe que não há nada de especial sobre a instrução::

source: That is not a future statement; it's an ordinary import statement with no special semantics or syntax restrictions.
pt_br: Essa não é uma instrução future; é uma instrução de importação comum sem nenhuma semântica especial ou restrições de sintaxe.

source: Code compiled by calls to the built-in functions :func:`exec` and :func:`compile` that occur in a module :mod:`!M` containing a future statement will, by default, use the new syntax or semantics associated with the future statement. This can be controlled by optional arguments to :func:`compile` --- see the documentation of that function for details.
pt_br: O código compilado por chamadas para as funções embutidas :func:`exec` e :func:`compile` que ocorrem em um módulo :mod:`!M` contendo uma instrução future usará, por padrão, a nova sintaxe ou semântica associada com a instrução future. Isso pode ser controlado por argumentos opcionais para :func:`compile` -- veja a documentação dessa função para detalhes.

source: A future statement typed at an interactive interpreter prompt will take effect for the rest of the interpreter session. If an interpreter is started with the :option:`-i` option, is passed a script name to execute, and the script includes a future statement, it will be in effect in the interactive session started after the script is executed.
pt_br: Uma instrução future tipada digitada em um prompt do interpretador interativo terá efeito no restante da sessão do interpretador. Se um interpretador for iniciado com a opção :option:`-i`, for passado um nome de script para ser executado e o script incluir uma instrução future, ela entrará em vigor na sessão interativa iniciada após a execução do script.

source: :pep:`236` - Back to the __future__
pt_br: :pep:`236` - De volta ao __future__

source: The original proposal for the __future__ mechanism.
pt_br: A proposta original para o mecanismo do __future__.

source: The :keyword:`!global` statement
pt_br: A instrução :keyword:`!global`

source: The :keyword:`global` statement causes the listed identifiers to be interpreted as globals. It would be impossible to assign to a global variable without :keyword:`!global`, although free variables may refer to globals without being declared global.
pt_br: A instrução :keyword:`global` faz com que os identificadores listados a serem interpretados como globais. Seria impossível atribuir a uma variável global sem :keyword:`!global`, embora variáveis livres possam se referir a globais sem serem declaradas globais.

source: The :keyword:`global` statement applies to the entire scope of a function or class body. A :exc:`SyntaxError` is raised if a variable is used or assigned to prior to its global declaration in the scope.
pt_br: A instrução :keyword:`global` se aplica a todo o escopo de uma função ou corpo da classe. Uma exceção :exc:`SyntaxError` é levantada se uma variável for usada ou atribuída antes de sua declaração global no escopo.

source: **Programmer's note:** :keyword:`global` is a directive to the parser. It applies only to code parsed at the same time as the :keyword:`!global` statement. In particular, a :keyword:`!global` statement contained in a string or code object supplied to the built-in :func:`exec` function does not affect the code block *containing* the function call, and code contained in such a string is unaffected by :keyword:`!global` statements in the code containing the function call. The same applies to the :func:`eval` and :func:`compile` functions.
pt_br: **Nota do programador:** :keyword:`global` é uma diretiva para o analisador sintático. Aplica-se apenas ao código analisado ao mesmo tempo que a instrução :keyword:`!global`. Em particular, uma instrução :keyword:`!global` contida em uma string ou objeto código fornecido à função embutida :func:`exec` não afeta o bloco de código *contendo* a chamada da função e o código contido em tal uma string não é afetada por instruções :keyword:`!global` no código que contém a chamada da função. O mesmo se aplica às funções :func:`eval` e :func:`compile`.

source: The :keyword:`!nonlocal` statement
pt_br: A instrução :keyword:`!nonlocal`

source: When the definition of a function or class is nested (enclosed) within the definitions of other functions, its nonlocal scopes are the local scopes of the enclosing functions. The :keyword:`nonlocal` statement causes the listed identifiers to refer to names previously bound in nonlocal scopes. It allows encapsulated code to rebind such nonlocal identifiers. If a name is bound in more than one nonlocal scope, the nearest binding is used. If a name is not bound in any nonlocal scope, or if there is no nonlocal scope, a :exc:`SyntaxError` is raised.
pt_br: Quando a definição de uma função ou classe está aninhada (incluída) nas definições de outras funções, seus escopos não locais são os escopos locais das funções envolventes. A instrução :keyword:`nonlocal` faz com que os identificadores listados se refiram a nomes previamente vinculados a escopos não locais. Ele permite que o código encapsulado religue esses identificadores não locais. Se um nome estiver ligado a mais de um escopo não local, a ligação mais próxima será usada. Se um nome não estiver vinculado a nenhum escopo não local, ou se não houver escopo não local, uma exceção :exc:`SyntaxError` será levantada.

source: The :keyword:`nonlocal` statement applies to the entire scope of a function or class body. A :exc:`SyntaxError` is raised if a variable is used or assigned to prior to its nonlocal declaration in the scope.
pt_br: A instrução :keyword:`nonlocal` se aplica a todo o escopo de uma função ou corpo da classe. Uma exceção :exc:`SyntaxError` é levantada se uma variável for usada ou atribuída antes de sua declaração nonlocal no escopo.

source: :pep:`3104` - Access to Names in Outer Scopes
pt_br: :pep:`3104` - Acesso a nomes em escopos externos

source: The specification for the :keyword:`nonlocal` statement.
pt_br: A especificação para a instrução :keyword:`nonlocal`.

source: **Programmer's note:** :keyword:`nonlocal` is a directive to the parser and applies only to code parsed along with it. See the note for the :keyword:`global` statement.
pt_br: **Nota do programador:** :keyword:`nonlocal` é uma diretiva para o analisador sintático e se aplica apenas ao código analisado junto com ele. Veja a nota para a instrução :keyword:`global`.

source: The :keyword:`!type` statement
pt_br: A instrução :keyword:`!type`

source: The :keyword:`!type` statement declares a type alias, which is an instance of :class:`typing.TypeAliasType`.
pt_br: A instrução :keyword:`!type` declara um apelido de tipo, que é uma instância de :class:`typing.TypeAliasType`.

source: For example, the following statement creates a type alias::
pt_br: Por exemplo, a instrução a seguir cria um apelido de tipo::

source: This code is roughly equivalent to::
pt_br: Este código é aproximadamente equivalente a::

source: ``annotation-def`` indicates an :ref:`annotation scope <annotation-scopes>`, which behaves mostly like a function, but with several small differences.
pt_br: ``annotation-def`` indica um :ref:`escopo de anotação <annotation-scopes>`, que se comporta principalmente como uma função, mas com diversas pequenas diferenças.

source: The value of the type alias is evaluated in the annotation scope. It is not evaluated when the type alias is created, but only when the value is accessed through the type alias's :attr:`!__value__` attribute (see :ref:`lazy-evaluation`). This allows the type alias to refer to names that are not yet defined.
pt_br: O valor do apelido de tipo é avaliado no escopo de anotação. Ele não é avaliado quando o apelido de tipo é criado, mas somente quando o valor é acessado através do atributo :attr:`!__value__` do apelido de tipo (veja :ref:`lazy-evaluation`). Isso permite que o apelido de tipo se refira a nomes que ainda não estão definidos.

source: Type aliases may be made generic by adding a :ref:`type parameter list <type-params>` after the name. See :ref:`generic-type-aliases` for more.
pt_br: Apelidos de tipo podem se tornar genéricos adicionando uma :ref:`lista de parâmetros de tipo <type-params>` após o nome. Veja :ref:`generic-type-aliases` para mais.

source: :keyword:`!type` is a :ref:`soft keyword <soft-keywords>`.
pt_br: :keyword:`!type` é uma :ref:`palavra reservada contextual <soft-keywords>`.

source: :pep:`695` - Type Parameter Syntax
pt_br: :pep:`695` - Sintaxe de parâmetros de tipo

source: Introduced the :keyword:`!type` statement and syntax for generic classes and functions.
pt_br: Introduziu a instrução :keyword:`!type` e sintaxe para classes e funções genéricas.

source: simple
pt_br: simples

source: statement
pt_br: instrução

source: expression
pt_br: expressão

source: list
pt_br: lista

source: built-in function
pt_br: função embutida

source: object
pt_br: objeto

source: conversion
pt_br: conversão

source: output
pt_br: saída

source: standard
pt_br: padrão

source: writing
pt_br: escrita; gravação

source: values
pt_br: valores

source: procedure
pt_br: procedimento

source: call
pt_br: chamada

source: = (equals)
pt_br: = (igual)

source: assignment statement
pt_br: atribuição, instrução de

source: assignment
pt_br: atribuição

source: binding
pt_br: vinculação; ligação

source: name
pt_br: nome

source: rebinding
pt_br: nova vinculação; nova ligação

source: mutable
pt_br: mutável

source: attribute
pt_br: atributo

source: target
pt_br: alvo

source: , (comma)
pt_br: , (vírgula)

source: in target list
pt_br: na lista de alvos

source: * (asterisk)
pt_br: * (asterisco)

source: in assignment target list
pt_br: na lista de alvo de atribuição

source: [] (square brackets)
pt_br: [] (colchetes)

source: () (parentheses)
pt_br: () (parênteses)

source: destructor
pt_br: destrutor

source: subscription
pt_br: subscrição

source: sequence
pt_br: sequência

source: mapping
pt_br: mapeamento

source: dictionary
pt_br: dicionário

source: slicing
pt_br: fatiamento

source: augmented
pt_br: aumentada

source: assignment, augmented
pt_br: aumentada, atribuição

source: augmented assignment
pt_br: atribuição aumentada

source: annotated
pt_br: anotada

source: assignment, annotated
pt_br: atribuição, anotada

source: : (colon)
pt_br: : (dois pontos)

source: annotated variable
pt_br: anotada, variável

source: debugging
pt_br: depuração

source: assertions
pt_br: asserções

source: expression list
pt_br: expressão, lista de

source: exception
pt_br: exceção

source: operation
pt_br: operação

source: deletion
pt_br: exclusão

source: unbinding
pt_br: desvinculação

source: function
pt_br: função

source: definition
pt_br: definição

source: class
pt_br: classe

source: keyword
pt_br: palavra reservada

source: generator
pt_br: gerador

source: iterator
pt_br: iterador

source: raising
pt_br: levantamento

source: __traceback__ (exception attribute)
pt_br: __traceback__ (atributo de exceção)

source: chaining
pt_br: encadeamento

source: __cause__ (exception attribute)
pt_br: __cause__ (atributo de exceção)

source: __context__ (exception attribute)
pt_br: __context__ (atributo de exceção)

source: loop
pt_br: laço

source: loop control
pt_br: controle de laço

source: module
pt_br: módulo

source: importing
pt_br: importação

source: import statement
pt_br: instrução import

source: __all__ (optional module attribute)
pt_br: __all__ (atributo opcional de módulo)

source: relative
pt_br: relativa

source: future statement
pt_br: instrução future

source: identifier list
pt_br: identificadores, lista de

source: type
pt_br: tipo
