Repository: python/python-docs-pt-br
Catalog: reference/simple_stmts.po
Languages: pt_br

source: Assert statements are a convenient way to insert debugging assertions into a program:
pt_br: As instruções assert são uma maneira conveniente de inserir asserções de depuração em um programa:

source: The simple form, ``assert expression``, is equivalent to ::
pt_br: A forma simples, ``assert expression``, é equivalente a ::

source: The extended form, ``assert expression1, expression2``, is equivalent to ::
pt_br: A forma estendida, ``assert expression1, expression2``, é equivalente a ::

source: These equivalences assume that :const:`__debug__` and :exc:`AssertionError` refer to the built-in variables with those names. In the current implementation, the built-in variable ``__debug__`` is ``True`` under normal circumstances, ``False`` when optimization is requested (command line option :option:`-O`). The current code generator emits no code for an :keyword:`assert` statement when optimization is requested at compile time. Note that it is unnecessary to include the source code for the expression that failed in the error message; it will be displayed as part of the stack trace.
pt_br: Essas equivalências presumem que :const:`__debug__` e :exc:`AssertionError` referem-se às variáveis embutidas com esses nomes. Na implementação atual, a variável embutida ``__debug__`` é ``True`` em circunstâncias normais, ``False`` quando a otimização é solicitada (opção de linha de comando :option:`-O`). O gerador de código atual não emite código para uma instrução :keyword:`assert` quando a otimização é solicitada em tempo de compilação. Observe que não é necessário incluir o código-fonte da expressão que falhou na mensagem de erro; ele será exibido como parte do stack trace (situação da pilha de execução).

source: Assignments to :const:`__debug__` are illegal. The value for the built-in variable is determined when the interpreter starts.
pt_br: Atribuições a :const:`__debug__` são ilegais. O valor da variável embutida é determinado quando o interpretador é iniciado.

source: The :keyword:`!pass` statement
pt_br: A instrução :keyword:`!pass`

source: :keyword:`pass` is a null operation --- when it is executed, nothing happens. It is useful as a placeholder when a statement is required syntactically, but no code needs to be executed, for example::
pt_br: :keyword:`pass` é uma operação nula --- quando é executada, nada acontece. É útil como um espaço reservado quando uma instrução é necessária sintaticamente, mas nenhum código precisa ser executado, por exemplo::

source: def f(arg): pass # a function that does nothing (yet) class C: pass # a class with no methods (yet)
pt_br: def f(arg): pass # uma função que faz nada (ainda) class C: pass # uma classe com nenhum método (ainda)

source: The :keyword:`!del` statement
pt_br: A instrução :keyword:`!del`

source: Deletion is recursively defined very similar to the way assignment is defined. Rather than spelling it out in full details, here are some hints.
pt_br: A exclusão é definida recursivamente de maneira muito semelhante à maneira como a atribuição é definida. Em vez de explicar em detalhes, aqui estão algumas dicas.

source: Deletion of a target list recursively deletes each target, from left to right.
pt_br: A exclusão de uma lista alvo exclui recursivamente cada alvo, da esquerda para a direita.

source: Deletion of a name removes the binding of that name from the local or global namespace, depending on whether the name occurs in a :keyword:`global` statement in the same code block. If the name is unbound, a :exc:`NameError` exception will be raised.
pt_br: A exclusão de um nome remove a ligação desse nome do espaço de nomes global local ou global, dependendo se o nome ocorre em uma instrução :keyword:`global` no mesmo bloco de código. Se o nome for desvinculado, uma exceção :exc:`NameError` será levantada.

source: Deletion of attribute references, subscriptions and slicings is passed to the primary object involved; deletion of a slicing is in general equivalent to assignment of an empty slice of the right type (but even this is determined by the sliced object).
pt_br: A exclusão de referências de atributos, assinaturas e fatias é passada para o objeto principal envolvido; a exclusão de um fatiamento é em geral equivalente à atribuição de uma fatia vazia do tipo certo (mas mesmo isso é determinado pelo objeto fatiado).

source: Previously it was illegal to delete a name from the local namespace if it occurs as a free variable in a nested block.
pt_br: Anteriormente, era ilegal excluir um nome do espaço de nomes local se ele ocorresse como uma variável livre em um bloco aninhado.

source: The :keyword:`!return` statement
pt_br: A instrução :keyword:`!return`

source: :keyword:`return` may only occur syntactically nested in a function definition, not within a nested class definition.
pt_br: :keyword:`return` só pode ocorrer sintaticamente aninhado em uma definição de função, não em uma definição de classe aninhada.

source: If an expression list is present, it is evaluated, else ``None`` is substituted.
pt_br: Se uma lista de expressões estiver presente, ela será avaliada, caso contrário, ``None`` será substituído.

source: :keyword:`return` leaves the current function call with the expression list (or ``None``) as return value.
pt_br: :keyword:`return` deixa a chamada da função atual com a lista de expressões (ou ``None``) como valor de retorno.

source: When :keyword:`return` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the function.
pt_br: Quando :keyword:`return` passa o controle de uma instrução :keyword:`try` com uma cláusula :keyword:`finally`, essa cláusula :keyword:`!finally` é executada antes de realmente sair da função.

source: In a generator function, the :keyword:`return` statement indicates that the generator is done and will cause :exc:`StopIteration` to be raised. The returned value (if any) is used as an argument to construct :exc:`StopIteration` and becomes the :attr:`StopIteration.value` attribute.
pt_br: Em uma função geradora, a instrução :keyword:`return` indica que o gerador está pronto e fará com que :exc:`StopIteration` seja gerado. O valor retornado (se houver) é usado como argumento para construir :exc:`StopIteration` e se torna o atributo :attr:`StopIteration.value`.

source: In an asynchronous generator function, an empty :keyword:`return` statement indicates that the asynchronous generator is done and will cause :exc:`StopAsyncIteration` to be raised. A non-empty :keyword:`!return` statement is a syntax error in an asynchronous generator function.
pt_br: Em uma função de gerador assíncrono, uma instrução :keyword:`return` vazia indica que o gerador assíncrono está pronto e fará com que :exc:`StopAsyncIteration` seja gerado. Uma instrução :keyword:`!return` não vazia é um erro de sintaxe em uma função de gerador assíncrono.

source: The :keyword:`!yield` statement
pt_br: A instrução :keyword:`!yield`

source: A :keyword:`yield` statement is semantically equivalent to a :ref:`yield expression <yieldexpr>`. The ``yield`` statement can be used to omit the parentheses that would otherwise be required in the equivalent yield expression statement. For example, the yield statements ::
pt_br: Uma instrução :keyword:`yield` é semanticamente equivalente a uma :ref:`expressão yield <yieldexpr>`. A instrução ``yield`` pode ser usada para omitir os parênteses que, de outra forma, seriam necessários na instrução de expressão yield equivalente. Por exemplo, as instruções yield ::

source: are equivalent to the yield expression statements ::
pt_br: são equivalentes às instruções de expressão yield ::

source: Yield expressions and statements are only used when defining a :term:`generator` function, and are only used in the body of the generator function. Using :keyword:`yield` in a function definition is sufficient to cause that definition to create a generator function instead of a normal function.
pt_br: Expressões e instruções yield são usadas apenas ao definir uma função :term:`geradora <gerador>` e são usadas apenas no corpo da função geradora. Usar :keyword:`yield` em uma definição de função é suficiente para fazer com que essa definição crie uma função geradora em vez de uma função normal.

source: For full details of :keyword:`yield` semantics, refer to the :ref:`yieldexpr` section.
pt_br: Para detalhes completos da semântica :keyword:`yield`, consulte a seção :ref:`yieldexpr`.

source: The :keyword:`!raise` statement
pt_br: A instrução :keyword:`!raise`

source: If no expressions are present, :keyword:`raise` re-raises the exception that is currently being handled, which is also known as the *active exception*. If there isn't currently an active exception, a :exc:`RuntimeError` exception is raised indicating that this is an error.
pt_br: Se nenhuma expressão estiver presente, :keyword:`raise` reativa a exceção que está sendo tratada no momento, que também é conhecida como *exceção ativa*. Se não houver uma exceção ativa no momento, uma exceção :exc:`RuntimeError` é levantada indicando que isso é um erro.

source: Otherwise, :keyword:`raise` evaluates the first expression as the exception object. It must be either a subclass or an instance of :class:`BaseException`. If it is a class, the exception instance will be obtained when needed by instantiating the class with no arguments.
pt_br: Caso contrário, :keyword:`raise` avalia a primeira expressão como o objeto de exceção. Deve ser uma subclasse ou uma instância de :class:`BaseException`. Se for uma classe, a instância de exceção será obtida quando necessário instanciando a classe sem argumentos.

source: The :dfn:`type` of the exception is the exception instance's class, the :dfn:`value` is the instance itself.
pt_br: O :dfn:`tipo` da exceção é a classe da instância de exceção, o :dfn:`valor` é a própria instância.

source: A traceback object is normally created automatically when an exception is raised and attached to it as the :attr:`~BaseException.__traceback__` attribute. You can create an exception and set your own traceback in one step using the :meth:`~BaseException.with_traceback` exception method (which returns the same exception instance, with its traceback set to its argument), like so::
pt_br: Um objeto traceback (situação da pilha de execução) normalmente é criado automaticamente quando uma exceção é levantada e anexada a ele como o atributo :attr:`~BaseException.__traceback__`. Você pode criar uma exceção e definir seu próprio traceback em uma etapa usando o método de exceção :meth:`~BaseException.with_traceback` (que retorna a mesma instância de exceção, com seu traceback definido para seu argumento), assim::

source: raise Exception("foo occurred").with_traceback(tracebackobj)
pt_br: raise Exception("ocorreu foo").with_traceback(tracebackobj)

source: The ``from`` clause is used for exception chaining: if given, the second *expression* must be another exception class or instance. If the second expression is an exception instance, it will be attached to the raised exception as the :attr:`~BaseException.__cause__` attribute (which is writable). If the expression is an exception class, the class will be instantiated and the resulting exception instance will be attached to the raised exception as the :attr:`!__cause__` attribute. If the raised exception is not handled, both exceptions will be printed:
pt_br: A cláusula ``from`` é usada para encadeamento de exceções: se fornecida, a segunda expressão, *expression*, deve ser outra classe ou instância de exceção. Se a segunda expressão for uma instância de exceção, ela será anexada à exceção levantada como o atributo :attr:`~BaseException.__cause__` (que é gravável). Se a expressão for uma classe de exceção, a classe será instanciada e a instância de exceção resultante será anexada à exceção levantada como o atributo :attr:`!__cause__`. Se a exceção levantada não for tratada, ambas as exceções serão impressas::

source: A similar mechanism works implicitly if a new exception is raised when an exception is already being handled. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used. The previous exception is then attached as the new exception's :attr:`~BaseException.__context__` attribute:
pt_br: Um mecanismo semelhante funciona implicitamente se uma nova exceção for levantada quando uma exceção já estiver sendo tratada. Uma exceção pode ser tratada quando uma cláusula :keyword:`except` ou :keyword:`finally`, ou uma instrução :keyword:`with`, é usada. A exceção anterior é então anexada como o atributo :attr:`~BaseException.__context__` da nova exceção:

source: Exception chaining can be explicitly suppressed by specifying :const:`None` in the ``from`` clause:
pt_br: O encadeamento de exceção pode ser explicitamente suprimido especificando :const:`None` na cláusula ``from``:

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information about handling exceptions is in section :ref:`try`.
pt_br: Informações adicionais sobre exceções podem ser encontradas na seção :ref:`exceptions`, e informações sobre como lidar com exceções estão na seção :ref:`try`.

source: :const:`None` is now permitted as ``Y`` in ``raise X from Y``.
pt_br: :const:`None` agora é permitido como ``Y`` em ``raise X from Y``.

source: Added the :attr:`~BaseException.__suppress_context__` attribute to suppress automatic display of the exception context.
pt_br: Adicionado o atributo :attr:`~BaseException.__suppress_context__` para suprimir a exibição automática do contexto de exceção.

source: If the traceback of the active exception is modified in an :keyword:`except` clause, a subsequent ``raise`` statement re-raises the exception with the modified traceback. Previously, the exception was re-raised with the traceback it had when it was caught.
pt_br: Se o traceback da exceção ativa for modificado em uma cláusula :keyword:`except`, uma instrução ``raise`` subsequente levantará novamente a exceção com o traceback modificado. Anteriormente, a exceção era levantada novamente com o traceback que tinha quando foi capturada.

source: The :keyword:`!break` statement
pt_br: A instrução :keyword:`!break`

source: :keyword:`break` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop.
pt_br: :keyword:`break` só pode ocorrer sintaticamente aninhado em um laço :keyword:`for` ou :keyword:`while`, mas não aninhado em uma função ou definição de classe dentro desse laço.

source: It terminates the nearest enclosing loop, skipping the optional :keyword:`!else` clause if the loop has one.
pt_br: Ele termina o laço de fechamento mais próximo, pulando a cláusula opcional :keyword:`!else` se o laço tiver uma.

source: If a :keyword:`for` loop is terminated by :keyword:`break`, the loop control target keeps its current value.
pt_br: Se um laço :keyword:`for` é encerrado por :keyword:`break`, o alvo de controle do laço mantém seu valor atual.

source: When :keyword:`break` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the loop.
pt_br: Quando :keyword:`break` passa o controle de uma instrução :keyword:`try` com uma cláusula :keyword:`finally`, essa cláusula :keyword:`!finally` é executada antes de realmente sair do laço.

source: The :keyword:`!continue` statement
pt_br: A instrução :keyword:`!continue`

source: :keyword:`continue` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop. It continues with the next cycle of the nearest enclosing loop.
pt_br: :keyword:`continue` só pode ocorrer sintaticamente aninhado em um laço :keyword:`for` ou :keyword:`while`, mas não aninhado em uma função ou definição de classe dentro desse laço. Ele continua com o próximo ciclo do laço de fechamento mais próximo.

source: When :keyword:`continue` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really starting the next loop cycle.
pt_br: Quando :keyword:`continue` passa o controle de uma instrução :keyword:`try` com uma cláusula :keyword:`finally`, essa cláusula :keyword:`!finally` é executada antes realmente iniciar o próximo ciclo do laço.

source: The :keyword:`!import` statement
pt_br: A instrução :keyword:`!import`

source: The basic import statement (no :keyword:`from` clause) is executed in two steps:
pt_br: A instrução de importação básica (sem cláusula :keyword:`from`) é executada em duas etapas:

source: find a module, loading and initializing it if necessary
pt_br: encontra um módulo, carregando e inicializando-o se necessário

source: define a name or names in the local namespace for the scope where the :keyword:`import` statement occurs.
pt_br: define um nome ou nomes no espaço de nomes local para o escopo onde ocorre a instrução :keyword:`import`.

source: When the statement contains multiple clauses (separated by commas) the two steps are carried out separately for each clause, just as though the clauses had been separated out into individual import statements.
pt_br: Quando a instrução contém várias cláusulas (separadas por vírgulas), as duas etapas são executadas separadamente para cada cláusula, como se as cláusulas tivessem sido separadas em instruções de importação individuais.

source: The details of the first step, finding and loading modules, are described in greater detail in the section on the :ref:`import system <importsystem>`, which also describes the various types of packages and modules that can be imported, as well as all the hooks that can be used to customize the import system. Note that failures in this step may indicate either that the module could not be located, *or* that an error occurred while initializing the module, which includes execution of the module's code.
pt_br: Os detalhes da primeira etapa, encontrar e carregar módulos, estão descritos com mais detalhes na seção sobre o :ref:`sistema de importação <importsystem>`, que também descreve os vários tipos de pacotes e módulos que podem ser importados, bem como todos os os ganchos que podem ser usados para personalizar o sistema de importação. Observe que falhas nesta etapa podem indicar que o módulo não pôde ser localizado *ou* que ocorreu um erro durante a inicialização do módulo, o que inclui a execução do código do módulo.

source: If the requested module is retrieved successfully, it will be made available in the local namespace in one of three ways:
pt_br: Se o módulo solicitado for recuperado com sucesso, ele será disponibilizado no espaço de nomes local de três maneiras:

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
pt_br: Se o nome do módulo é seguido pela palavra reservada :keyword:`!as`, o nome a seguir é vinculado diretamente ao módulo importado.

source: If no other name is specified, and the module being imported is a top level module, the module's name is bound in the local namespace as a reference to the imported module
pt_br: Se nenhum outro nome for especificado e o módulo que está sendo importado for um módulo de nível superior, o nome do módulo será vinculado ao espaço de nomes local como uma referência ao módulo importado

source: If the module being imported is *not* a top level module, then the name of the top level package that contains the module is bound in the local namespace as a reference to the top level package. The imported module must be accessed using its full qualified name rather than directly
pt_br: Se o módulo que está sendo importado *não* for um módulo de nível superior, o nome do pacote de nível superior que contém o módulo será vinculado ao espaço de nomes local como uma referência ao pacote de nível superior. O módulo importado deve ser acessado usando seu nome completo e não diretamente

source: The :keyword:`from` form uses a slightly more complex process:
pt_br: O formulário :keyword:`from` usa um processo um pouco mais complexo:

source: find the module specified in the :keyword:`from` clause, loading and initializing it if necessary;
pt_br: encontra o módulo especificado na cláusula :keyword:`from`, carregando e inicializando-o se necessário;

source: for each of the identifiers specified in the :keyword:`import` clauses:
pt_br: para cada um dos identificadores especificados nas cláusulas :keyword:`import`:

source: check if the imported module has an attribute by that name
pt_br: verifica se o módulo importado tem um atributo com esse nome

source: if not, attempt to import a submodule with that name and then check the imported module again for that attribute
pt_br: caso contrário, tenta importar um submódulo com esse nome e verifica o módulo importado novamente para esse atributo

source: if the attribute is not found, :exc:`ImportError` is raised.
pt_br: se o atributo não for encontrado, a exceção :exc:`ImportError` é levantada.

source: otherwise, a reference to that value is stored in the local namespace, using the name in the :keyword:`!as` clause if it is present, otherwise using the attribute name
pt_br: caso contrário, uma referência a esse valor é armazenada no espaço de nomes local, usando o nome na cláusula :keyword:`!as` se estiver presente, caso contrário, usando o nome do atributo

source: Examples::
pt_br: Exemplos::

source: import foo # foo imported and bound locally import foo.bar.baz # foo, foo.bar, and foo.bar.baz imported, foo bound locally import foo.bar.baz as fbb # foo, foo.bar, and foo.bar.baz imported, foo.bar.baz bound as fbb from foo.bar import baz # foo, foo.bar, and foo.bar.baz imported, foo.bar.baz bound as baz from foo import attr # foo imported and foo.attr bound as attr
pt_br: import foo # foo importado e vinculado localmente import foo.bar.baz # foo, foo.bar e foo.bar.baz importados, foo vinculado localmente import foo.bar.baz as fbb # foo, foo.bar e foo.bar.baz importados, foo.bar.baz vinculado como fbb from foo.bar import baz # foo, foo.bar e foo.bar.baz importados, foo.bar.baz vinculado como baz from foo import attr # foo importado e foo.attr vinculado como attr

source: If the list of identifiers is replaced by a star (``'*'``), all public names defined in the module are bound in the local namespace for the scope where the :keyword:`import` statement occurs.
pt_br: Se a lista de identificadores for substituída por uma estrela (``'*'``), todos os nomes públicos definidos no módulo serão vinculados ao espaço de nomes local para o escopo onde ocorre a instrução :keyword:`import`.
