Repository: python/python-docs-pt-br
Catalog: reference/simple_stmts.po
Languages: pt_br

source: Simple statements
pt_br: Instruções simples

source: A simple statement is comprised within a single logical line. Several simple statements may occur on a single line separated by semicolons. The syntax for simple statements is:
pt_br: Uma instrução simples consiste uma única linha lógica. Várias instruções simples podem ocorrer em uma única linha separada por ponto e vírgula. A sintaxe para instruções simples é:

source: Expression statements
pt_br: Instruções de expressão

source: Expression statements are used (mostly interactively) to compute and write a value, or (usually) to call a procedure (a function that returns no meaningful result; in Python, procedures return the value ``None``). Other uses of expression statements are allowed and occasionally useful. The syntax for an expression statement is:
pt_br: As instruções de expressão são usadas (principalmente interativamente) para calcular e escrever um valor, ou (geralmente) para chamar um procedimento (uma função que não retorna nenhum resultado significativo; em Python, os procedimentos retornam o valor ``None``). Outros usos de instruções de expressão são permitidos e ocasionalmente úteis. A sintaxe para uma instrução de expressão é:

source: An expression statement evaluates the expression list (which may be a single expression).
pt_br: Uma instrução de expressão avalia a lista de expressões (que pode ser uma única expressão).

source: In interactive mode, if the value is not ``None``, it is converted to a string using the built-in :func:`repr` function and the resulting string is written to standard output on a line by itself (except if the result is ``None``, so that procedure calls do not cause any output.)
pt_br: No modo interativo, se o valor não for ``None``, ele será convertido em uma string usando a função embutida :func:`repr` e a string resultante será gravada na saída padrão em uma linha sozinha (exceto se o resultado é ``None``, de modo que as chamadas de procedimento não causam nenhuma saída.)

source: Assignment statements
pt_br: Instruções de atribuição

source: Assignment statements are used to (re)bind names to values and to modify attributes or items of mutable objects:
pt_br: As instruções de atribuição são usadas para (re)vincular nomes a valores e modificar atributos ou itens de objetos mutáveis:

source: (See section :ref:`primaries` for the syntax definitions for *attributeref*, *subscription*, and *slicing*.)
pt_br: (Veja a seção :ref:`primaries` para as definições de sintaxe de *attributeref*, *subscription* e *slicing*.)

source: An assignment statement evaluates the expression list (remember that this can be a single expression or a comma-separated list, the latter yielding a tuple) and assigns the single resulting object to each of the target lists, from left to right.
pt_br: Uma instrução de atribuição avalia a lista de expressões (lembre-se de que pode ser uma única expressão ou uma lista separada por vírgulas, a última produzindo uma tupla) e atribui o único objeto resultante a cada uma das listas alvos, da esquerda para a direita.

source: Assignment is defined recursively depending on the form of the target (list). When a target is part of a mutable object (an attribute reference, subscription or slicing), the mutable object must ultimately perform the assignment and decide about its validity, and may raise an exception if the assignment is unacceptable. The rules observed by various types and the exceptions raised are given with the definition of the object types (see section :ref:`types`).
pt_br: A atribuição é definida recursivamente dependendo da forma do alvo (lista). Quando um alvo faz parte de um objeto mutável (uma referência de atributo, assinatura ou divisão), o objeto mutável deve, em última análise, executar a atribuição e decidir sobre sua validade e pode levantar uma exceção se a atribuição for inaceitável. As regras observadas pelos vários tipos e as exceções levantadas são dadas com a definição dos tipos de objetos (ver seção :ref:`types`).

source: Assignment of an object to a target list, optionally enclosed in parentheses or square brackets, is recursively defined as follows.
pt_br: A atribuição de um objeto a uma lista alvo, opcionalmente entre parênteses ou colchetes, é definida recursivamente da maneira a seguir.

source: If the target list is a single target with no trailing comma, optionally in parentheses, the object is assigned to that target.
pt_br: Se a lista alvo contiver um único alvo sem vírgula à direita, opcionalmente entre parênteses, o objeto será atribuído a esse alvo.

source: Else:
pt_br: Senão:

source: If the target list contains one target prefixed with an asterisk, called a "starred" target: The object must be an iterable with at least as many items as there are targets in the target list, minus one. The first items of the iterable are assigned, from left to right, to the targets before the starred target. The final items of the iterable are assigned to the targets after the starred target. A list of the remaining items in the iterable is then assigned to the starred target (the list can be empty).
pt_br: Se a lista alvo contiver um alvo prefixado com um asterisco, chamado de alvo "com estrela" *(starred)*: o objeto deve ser um iterável com pelo menos tantos itens quantos os alvos na lista alvo, menos um. Os primeiros itens do iterável são atribuídos, da esquerda para a direita, aos alvos antes do alvo com estrela. Os itens finais do iterável são atribuídos aos alvos após o alvo com estrela. Uma lista dos itens restantes no iterável é então atribuída ao alvo com estrela (a lista pode estar vazia).

source: Else: The object must be an iterable with the same number of items as there are targets in the target list, and the items are assigned, from left to right, to the corresponding targets.
pt_br: Senão: o objeto deve ser um iterável com o mesmo número de itens que existem alvos na lista alvos, e os itens são atribuídos, da esquerda para a direita, aos alvos correspondentes.

source: Assignment of an object to a single target is recursively defined as follows.
pt_br: A atribuição de um objeto a um único alvo é definida recursivamente da maneira a seguir.

source: If the target is an identifier (name):
pt_br: Se o alvo for um identificador (nome):

source: If the name does not occur in a :keyword:`global` or :keyword:`nonlocal` statement in the current code block: the name is bound to the object in the current local namespace.
pt_br: Se o nome não ocorrer em uma instrução :keyword:`global` ou :keyword:`nonlocal` no bloco de código atual: o nome está vinculado ao objeto no espaço de nomes local atual.

source: Otherwise: the name is bound to the object in the global namespace or the outer namespace determined by :keyword:`nonlocal`, respectively.
pt_br: Caso contrário: o nome é vinculado ao objeto no espaço de nomes global global ou no espaço de nomes global externo determinado por :keyword:`nonlocal`, respectivamente.

source: The name is rebound if it was already bound. This may cause the reference count for the object previously bound to the name to reach zero, causing the object to be deallocated and its destructor (if it has one) to be called.
pt_br: O nome é vinculado novamente se já estiver vinculado. Isso pode fazer com que a contagem de referências para o objeto anteriormente vinculado ao nome chegue a zero, fazendo com que o objeto seja desalocado e seu destrutor (se houver) seja chamado.

source: If the target is an attribute reference: The primary expression in the reference is evaluated. It should yield an object with assignable attributes; if this is not the case, :exc:`TypeError` is raised. That object is then asked to assign the assigned object to the given attribute; if it cannot perform the assignment, it raises an exception (usually but not necessarily :exc:`AttributeError`).
pt_br: Se o alvo for uma referência de atributo: a expressão primária na referência é avaliada. Deve produzir um objeto com atributos atribuíveis; se este não for o caso, a exceção :exc:`TypeError` é levanta. Esse objeto é então solicitado a atribuir o objeto atribuído ao atributo fornecido; se não puder executar a atribuição, ele levanta uma exceção (geralmente, mas não necessariamente :exc:`AttributeError`).

source: Note: If the object is a class instance and the attribute reference occurs on both sides of the assignment operator, the right-hand side expression, ``a.x`` can access either an instance attribute or (if no instance attribute exists) a class attribute. The left-hand side target ``a.x`` is always set as an instance attribute, creating it if necessary. Thus, the two occurrences of ``a.x`` do not necessarily refer to the same attribute: if the right-hand side expression refers to a class attribute, the left-hand side creates a new instance attribute as the target of the assignment::
pt_br: Nota: Se o objeto for uma instância de classe e a referência de atributo ocorrer em ambos os lados do operador de atribuição, a expressão do lado direito, ``a.x`` pode acessar um atributo de instância ou (se não existir nenhum atributo de instância) uma classe atributo. O alvo do lado esquerdo ``a.x`` é sempre definido como um atributo de instância, criando-o se necessário. Assim, as duas ocorrências de ``a.x`` não necessariamente se referem ao mesmo atributo: se a expressão do lado direito se refere a um atributo de classe, o lado esquerdo cria um novo atributo de instância como alvo da atribuição::

source: class Cls: x = 3 # class variable inst = Cls() inst.x = inst.x + 1 # writes inst.x as 4 leaving Cls.x as 3
pt_br: class Cls: x = 3 # variável de classe inst = Cls() inst.x = inst.x + 1 # escreve inst.x como 4 deixando Cls.x como 3

source: This description does not necessarily apply to descriptor attributes, such as properties created with :func:`property`.
pt_br: Esta descrição não se aplica necessariamente aos atributos do descritor, como propriedades criadas com :func:`property`.

source: If the target is a subscription: The primary expression in the reference is evaluated. It should yield either a mutable sequence object (such as a list) or a mapping object (such as a dictionary). Next, the subscript expression is evaluated.
pt_br: Se o alvo for uma assinatura: a expressão primária na referência é avaliada. Deve produzir um objeto de sequência mutável (como uma lista) ou um objeto de mapeamento (como um dicionário). Em seguida, a expressão subscrito é avaliada.

source: If the primary is a mutable sequence object (such as a list), the subscript must yield an integer. If it is negative, the sequence's length is added to it. The resulting value must be a nonnegative integer less than the sequence's length, and the sequence is asked to assign the assigned object to its item with that index. If the index is out of range, :exc:`IndexError` is raised (assignment to a subscripted sequence cannot add new items to a list).
pt_br: Se o primário for um objeto de sequência mutável (como uma lista), o subscrito deverá produzir um inteiro. Se for negativo, o comprimento da sequência é adicionado a ela. O valor resultante deve ser um inteiro não negativo menor que o comprimento da sequência, e a sequência é solicitada a atribuir o objeto atribuído ao seu item com esse índice. Se o índice estiver fora do intervalo, a exceção :exc:`IndexError` será levantada (a atribuição a uma sequência subscrita não pode adicionar novos itens a uma lista).

source: If the primary is a mapping object (such as a dictionary), the subscript must have a type compatible with the mapping's key type, and the mapping is then asked to create a key/value pair which maps the subscript to the assigned object. This can either replace an existing key/value pair with the same key value, or insert a new key/value pair (if no key with the same value existed).
pt_br: Se o primário for um objeto de mapeamento (como um dicionário), o subscrito deve ter um tipo compatível com o tipo de chave do mapeamento, e o mapeamento é solicitado a criar um par chave/valore que mapeia o subscrito para o objeto atribuído. Isso pode substituir um par de chave/valor existente pelo mesmo valor de chave ou inserir um novo par de chave/valor (se não existir nenhuma chave com o mesmo valor).

source: For user-defined objects, the :meth:`~object.__setitem__` method is called with appropriate arguments.
pt_br: Para objetos definidos pelo usuário, o método :meth:`~object.__setitem__` é chamado com argumentos apropriados.

source: If the target is a slicing: The primary expression in the reference is evaluated. It should yield a mutable sequence object (such as a list). The assigned object should be a sequence object of the same type. Next, the lower and upper bound expressions are evaluated, insofar they are present; defaults are zero and the sequence's length. The bounds should evaluate to integers. If either bound is negative, the sequence's length is added to it. The resulting bounds are clipped to lie between zero and the sequence's length, inclusive. Finally, the sequence object is asked to replace the slice with the items of the assigned sequence. The length of the slice may be different from the length of the assigned sequence, thus changing the length of the target sequence, if the target sequence allows it.
pt_br: Se o alvo for um fatiamento: a expressão primária na referência é avaliada. Deve produzir um objeto de sequência mutável (como uma lista). O objeto atribuído deve ser um objeto de sequência do mesmo tipo. Em seguida, as expressões de limite inferior e superior são avaliadas, na medida em que estiverem presentes; os padrões são zero e o comprimento da sequência. Os limites devem ser avaliados como inteiros. Se um dos limites for negativo, o comprimento da sequência será adicionado a ele. Os limites resultantes são cortados para ficarem entre zero e o comprimento da sequência, inclusive. Finalmente, o objeto de sequência é solicitado a substituir a fatia pelos itens da sequência atribuída. O comprimento da fatia pode ser diferente do comprimento da sequência atribuída, alterando assim o comprimento da sequência alvo, se a sequência alvo permitir.

source: In the current implementation, the syntax for targets is taken to be the same as for expressions, and invalid syntax is rejected during the code generation phase, causing less detailed error messages.
pt_br: Na implementação atual, a sintaxe dos alvos é considerada a mesma das expressões e a sintaxe inválida é rejeitada durante a fase de geração do código, causando mensagens de erro menos detalhadas.

source: Although the definition of assignment implies that overlaps between the left-hand side and the right-hand side are 'simultaneous' (for example ``a, b = b, a`` swaps two variables), overlaps *within* the collection of assigned-to variables occur left-to-right, sometimes resulting in confusion. For instance, the following program prints ``[0, 2]``::
pt_br: Embora a definição de atribuição implique que as sobreposições entre o lado esquerdo e o lado direito sejam "simultâneas" (por exemplo, ``a, b = b, a`` troca duas variáveis), sobreposições *dentro* da coleção de variáveis atribuídas ocorrem da esquerda para a direita, às vezes resultando em confusão. Por exemplo, o programa a seguir imprime ``[0, 2]``::

source: x = [0, 1] i = 0 i, x[i] = 1, 2 # i is updated, then x[i] is updated print(x)
pt_br: x = [0, 1] i = 0 i, x[i] = 1, 2 # i é atualizado e, em seguida, x[i] é atualizado print(x)

source: :pep:`3132` - Extended Iterable Unpacking
pt_br: :pep:`3132` - Desempacotamento estendido de iterável

source: The specification for the ``*target`` feature.
pt_br: A especificação para o recurso ``*target``.

source: Augmented assignment statements
pt_br: Instruções de atribuição aumentada

source: Augmented assignment is the combination, in a single statement, of a binary operation and an assignment statement:
pt_br: A atribuição aumentada é a combinação, em uma única instrução, de uma operação binária e uma instrução de atribuição:

source: (See section :ref:`primaries` for the syntax definitions of the last three symbols.)
pt_br: (Veja a seção :ref:`primaries` para as definições de sintaxe dos últimos três símbolos.)

source: An augmented assignment evaluates the target (which, unlike normal assignment statements, cannot be an unpacking) and the expression list, performs the binary operation specific to the type of assignment on the two operands, and assigns the result to the original target. The target is only evaluated once.
pt_br: Uma atribuição aumentada avalia o alvo (que, diferentemente das instruções de atribuição normais, não pode ser um desempacotamento) e a lista de expressões, executa a operação binária específica para o tipo de atribuição nos dois operandos e atribui o resultado ao alvo original. O alvo é avaliado apenas uma vez.

source: An augmented assignment statement like ``x += 1`` can be rewritten as ``x = x + 1`` to achieve a similar, but not exactly equal effect. In the augmented version, ``x`` is only evaluated once. Also, when possible, the actual operation is performed *in-place*, meaning that rather than creating a new object and assigning that to the target, the old object is modified instead.
pt_br: Uma instrução de atribuição aumentada como ``x += 1`` pode ser reescrita como ``x = x + 1`` para obter um efeito semelhante, mas não exatamente igual. Na versão aumentada, ``x`` é avaliado apenas uma vez. Além disso, quando possível, a operação real é executada *no local*, o que significa que, em vez de criar um novo objeto e atribuí-lo ao alvo, o objeto antigo é modificado.

source: Unlike normal assignments, augmented assignments evaluate the left-hand side *before* evaluating the right-hand side. For example, ``a[i] += f(x)`` first looks-up ``a[i]``, then it evaluates ``f(x)`` and performs the addition, and lastly, it writes the result back to ``a[i]``.
pt_br: Ao contrário das atribuições normais, as atribuições aumentadas avaliam o lado esquerdo *antes* de avaliar o lado direito. Por exemplo, ``a[i] += f(x)`` primeiro procura ``a[i]``, então avalia ``f(x)`` e executa a adição e, por último, escreve o resultado de volta para ``a[i]``.

source: With the exception of assigning to tuples and multiple targets in a single statement, the assignment done by augmented assignment statements is handled the same way as normal assignments. Similarly, with the exception of the possible *in-place* behavior, the binary operation performed by augmented assignment is the same as the normal binary operations.
pt_br: Com exceção da atribuição a tuplas e vários alvos em uma única instrução, a atribuição feita por instruções de atribuição aumentada é tratada da mesma maneira que atribuições normais. Da mesma forma, com exceção do possível comportamento *in-place*, a operação binária executada por atribuição aumentada é a mesma que as operações binárias normais.

source: For targets which are attribute references, the same :ref:`caveat about class and instance attributes <attr-target-note>` applies as for regular assignments.
pt_br: Para alvos que são referências de atributos, a mesma :ref:`advertência sobre atributos de classe e instância <attr-target-note>` se aplica a atribuições regulares.

source: Annotated assignment statements
pt_br: instruções de atribuição anotado

source: :term:`Annotation <variable annotation>` assignment is the combination, in a single statement, of a variable or attribute annotation and an optional assignment statement:
pt_br: A atribuição de :term:`anotação <variable annotation>` é a combinação, em uma única instrução, de uma anotação de variável ou atributo e uma instrução de atribuição opcional:

source: The difference from normal :ref:`assignment` is that only a single target is allowed.
pt_br: A diferença para as :ref:`assignment` normal é que apenas um único alvo é permitido.

source: The assignment target is considered "simple" if it consists of a single name that is not enclosed in parentheses. For simple assignment targets, if in class or module scope, the annotations are gathered in a lazily evaluated :ref:`annotation scope <annotation-scopes>`. The annotations can be evaluated using the :attr:`~object.__annotations__` attribute of a class or module, or using the facilities in the :mod:`annotationlib` module.
pt_br: O alvo da atribuição é considerado "simples" se consistir em um único nome que não esteja entre parênteses. Para alvos de atribuição simples, se estiverem no escopo de classe ou módulo, as anotações são reunidas em um :ref:`escopo de anotação <annotation-scopes>` avaliado preguiçosamente. As anotações podem ser avaliadas usando o atributo :attr:`~object.__annotations__` de uma classe ou módulo, ou usando os recursos do módulo :mod:`annotationlib`.

source: If the assignment target is not simple (an attribute, subscript node, or parenthesized name), the annotation is never evaluated.
pt_br: Se o alvo da atribuição não for simples (um atributo, nó subscrito ou nome entre parênteses), a anotação nunca será avaliada.

source: If a name is annotated in a function scope, then this name is local for that scope. Annotations are never evaluated and stored in function scopes.
pt_br: Se um nome for anotado em um escopo de função, esse nome será local para esse escopo. As anotações nunca são avaliadas e armazenadas em escopos de função.

source: If the right hand side is present, an annotated assignment performs the actual assignment as if there was no annotation present. If the right hand side is not present for an expression target, then the interpreter evaluates the target except for the last :meth:`~object.__setitem__` or :meth:`~object.__setattr__` call.
pt_br: Se o lado direito estiver presente, uma atribuição anotada executa a atribuição real como se não houvesse uma anotação presente. Se o lado direito não estiver presente para um alvo de expressão, então o interpretador avalia o alvo, exceto para a última chamada :meth:`~object.__setitem__` ou :meth:`~object.__setattr__`.

source: :pep:`526` - Syntax for Variable Annotations
pt_br: :pep:`526` - Sintaxe para Anotações de Variáveis

source: The proposal that added syntax for annotating the types of variables (including class variables and instance variables), instead of expressing them through comments.
pt_br: A proposta que adicionou sintaxe para anotar os tipos de variáveis (incluindo variáveis de classe e variáveis de instância), em vez de expressá-las por meio de comentários.

source: :pep:`484` - Type hints
pt_br: :pep:`484` - Dicas de tipo

source: The proposal that added the :mod:`typing` module to provide a standard syntax for type annotations that can be used in static analysis tools and IDEs.
pt_br: A proposta que adicionou o módulo :mod:`typing` para fornecer uma sintaxe padrão para anotações de tipo que podem ser usadas em ferramentas de análise estática e IDEs.

source: Now annotated assignments allow the same expressions in the right hand side as regular assignments. Previously, some expressions (like un-parenthesized tuple expressions) caused a syntax error.
pt_br: Agora, as atribuições anotadas permitem as mesmas expressões no lado direito que as atribuições regulares. Anteriormente, algumas expressões (como expressões de tupla sem parênteses) causavam um erro de sintaxe.

source: Annotations are now lazily evaluated in a separate :ref:`annotation scope <annotation-scopes>`. If the assignment target is not simple, annotations are never evaluated.
pt_br: As anotações agora têm avaliação preguiçosa em um :ref:`escopo de anotação <annotation-scopes>` separado. Se o alvo da atribuição não for simples, as anotações nunca serão avaliadas.

source: The :keyword:`!assert` statement
pt_br: A instrução :keyword:`!assert`
