Repository: python/python-docs-pt-br
Catalog: library/*.po
Languages: ast

source: :mod:`!ast` --- Abstract Syntax Trees
ast: :mod:`!ast` --- Árvores de Sintaxe Abstrata

source: **Source code:** :source:`Lib/ast.py`
ast: **Código-fonte:** :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: O módulo :mod:`ast` ajuda as aplicações Python a processar árvores da gramática de sintaxe abstrata do Python. A sintaxe abstrata em si pode mudar em cada lançamento do Python; este módulo ajuda a descobrir programaticamente como é a gramática atual.

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: Uma árvore de sintaxe abstrata pode ser gerada passando :data:`ast.PyCF_ONLY_AST` como um sinalizador para a função embutida :func:`compile`, ou usando o auxiliar :func:`parse` fornecido neste módulo. O resultado será uma árvore de objetos cujas classes herdam de :class:`ast.AST`. Uma árvore de sintaxe abstrata pode ser compilada em um objeto código Python usando a função embutida :func:`compile`.

source: Abstract Grammar
ast: Gramática Abstrata

source: The abstract grammar is currently defined as follows:
ast: A gramática abstrata está atualmente definida da seguinte forma:

source: -- ASDL's 4 builtin types are: -- identifier, int, string, constant module Python { mod = Module(stmt* body, type_ignore* type_ignores) | Interactive(stmt* body) | Expression(expr body) | FunctionType(expr* argtypes, expr returns) stmt = FunctionDef(identifier name, arguments args, stmt* body, expr* decorator_list, expr? returns, string? type_comment, type_param* type_params) | AsyncFunctionDef(identifier name, arguments args, stmt* body, expr* decorator_list, expr? returns, string? type_comment, type_param* type_params) | ClassDef(identifier name, expr* bases, keyword* keywords, stmt* body, expr* decorator_list, type_param* type_params) | Return(expr? value) | Delete(expr* targets) | Assign(expr* targets, expr value, string? type_comment) | TypeAlias(expr name, type_param* type_params, expr value) | AugAssign(expr target, operator op, expr value) -- 'simple' indicates that we annotate simple name without parens | AnnAssign(expr target, expr annotation, expr? value, int simple) -- use 'orelse' because else is a keyword in target languages | For(expr target, expr iter, stmt* body, stmt* orelse, string? type_comment) | AsyncFor(expr target, expr iter, stmt* body, stmt* orelse, string? type_comment) | While(expr test, stmt* body, stmt* orelse) | If(expr test, stmt* body, stmt* orelse) | With(withitem* items, stmt* body, string? type_comment) | AsyncWith(withitem* items, stmt* body, string? type_comment) | Match(expr subject, match_case* cases) | Raise(expr? exc, expr? cause) | Try(stmt* body, excepthandler* handlers, stmt* orelse, stmt* finalbody) | TryStar(stmt* body, excepthandler* handlers, stmt* orelse, stmt* finalbody) | Assert(expr test, expr? msg) | Import(alias* names) | ImportFrom(identifier? module, alias* names, int? level) | Global(identifier* names) | Nonlocal(identifier* names) | Expr(expr value) | Pass | Break | Continue -- col_offset is the byte offset in the utf8 string the parser uses attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) -- BoolOp() can use left & right? expr = BoolOp(boolop op, expr* values) | NamedExpr(expr target, expr value) | BinOp(expr left, operator op, expr right) | UnaryOp(unaryop op, expr operand) | Lambda(arguments args, expr body) | IfExp(expr test, expr body, expr orelse) | Dict(expr* keys, expr* values) | Set(expr* elts) | ListComp(expr elt, comprehension* generators) | SetComp(expr elt, comprehension* generators) | DictComp(expr key, expr value, comprehension* generators) | GeneratorExp(expr elt, comprehension* generators) -- the grammar constrains where yield expressions can occur | Await(expr value) | Yield(expr? value) | YieldFrom(expr value) -- need sequences for compare to distinguish between -- x < 4 < 3 and (x < 4) < 3 | Compare(expr left, cmpop* ops, expr* comparators) | Call(expr func, expr* args, keyword* keywords) | FormattedValue(expr value, int conversion, expr? format_spec) | JoinedStr(expr* values) | Constant(constant value, string? kind) -- the following expression can appear in assignment context | Attribute(expr value, identifier attr, expr_context ctx) | Subscript(expr value, expr slice, expr_context ctx) | Starred(expr value, expr_context ctx) | Name(identifier id, expr_context ctx) | List(expr* elts, expr_context ctx) | Tuple(expr* elts, expr_context ctx) -- can appear only in Subscript | Slice(expr? lower, expr? upper, expr? step) -- col_offset is the byte offset in the utf8 string the parser uses attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) expr_context = Load | Store | Del boolop = And | Or operator = Add | Sub | Mult | MatMult | Div | Mod | Pow | LShift | RShift | BitOr | BitXor | BitAnd | FloorDiv unaryop = Invert | Not | UAdd | USub cmpop = Eq | NotEq | Lt | LtE | Gt | GtE | Is | IsNot | In | NotIn comprehension = (expr target, expr iter, expr* ifs, int is_async) excepthandler = ExceptHandler(expr? type, identifier? name, stmt* body) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) arguments = (arg* posonlyargs, arg* args, arg? vararg, arg* kwonlyargs, expr* kw_defaults, arg? kwarg, expr* defaults) arg = (identifier arg, expr? annotation, string? type_comment) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) -- keyword arguments supplied to call (NULL identifier for **kwargs) keyword = (identifier? arg, expr value) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) -- import name with optional 'as' alias. alias = (identifier name, identifier? asname) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) withitem = (expr context_expr, expr? optional_vars) match_case = (pattern pattern, expr? guard, stmt* body) pattern = MatchValue(expr value) | MatchSingleton(constant value) | MatchSequence(pattern* patterns) | MatchMapping(expr* keys, pattern* patterns, identifier? rest) | MatchClass(expr cls, pattern* patterns, identifier* kwd_attrs, pattern* kwd_patterns) | MatchStar(identifier? name) -- The optional "rest" MatchMapping parameter handles capturing extra mapping keys | MatchAs(pattern? pattern, identifier? name) | MatchOr(pattern* patterns) attributes (int lineno, int col_offset, int end_lineno, int end_col_offset) type_ignore = TypeIgnore(int lineno, string tag) type_param = TypeVar(identifier name, expr? bound, expr? default_value) | ParamSpec(identifier name, expr? default_value) | TypeVarTuple(identifier name, expr? default_value) attributes (int lineno, int col_offset, int end_lineno, int end_col_offset) }
ast: -- 4 tipos embutidos da ASDL são: -- identifier, int, string, constant module Python { mod = Module(stmt* body, type_ignore* type_ignores) | Interactive(stmt* body) | Expression(expr body) | FunctionType(expr* argtypes, expr returns) stmt = FunctionDef(identifier name, arguments args, stmt* body, expr* decorator_list, expr? returns, string? type_comment, type_param* type_params) | AsyncFunctionDef(identifier name, arguments args, stmt* body, expr* decorator_list, expr? returns, string? type_comment, type_param* type_params) | ClassDef(identifier name, expr* bases, keyword* keywords, stmt* body, expr* decorator_list, type_param* type_params) | Return(expr? value) | Delete(expr* targets) | Assign(expr* targets, expr value, string? type_comment) | TypeAlias(expr name, type_param* type_params, expr value) | AugAssign(expr target, operator op, expr value) -- 'simple' indica que anotamos nome simples sem parênteses | AnnAssign(expr target, expr annotation, expr? value, int simple) -- usa 'orelse' porque else é uma palavra reservada em idiomas alvos | For(expr target, expr iter, stmt* body, stmt* orelse, string? type_comment) | AsyncFor(expr target, expr iter, stmt* body, stmt* orelse, string? type_comment) | While(expr test, stmt* body, stmt* orelse) | If(expr test, stmt* body, stmt* orelse) | With(withitem* items, stmt* body, string? type_comment) | AsyncWith(withitem* items, stmt* body, string? type_comment) | Match(expr subject, match_case* cases) | Raise(expr? exc, expr? cause) | Try(stmt* body, excepthandler* handlers, stmt* orelse, stmt* finalbody) | TryStar(stmt* body, excepthandler* handlers, stmt* orelse, stmt* finalbody) | Assert(expr test, expr? msg) | Import(alias* names) | ImportFrom(identifier? module, alias* names, int? level) | Global(identifier* names) | Nonlocal(identifier* names) | Expr(expr value) | Pass | Break | Continue -- col_offset é o deslocamente do bytes na string utf8 que o analisador sintático usa attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) -- BoolOp() pode usar esquerda e direita? expr = BoolOp(boolop op, expr* values) | NamedExpr(expr target, expr value) | BinOp(expr left, operator op, expr right) | UnaryOp(unaryop op, expr operand) | Lambda(arguments args, expr body) | IfExp(expr test, expr body, expr orelse) | Dict(expr* keys, expr* values) | Set(expr* elts) | ListComp(expr elt, comprehension* generators) | SetComp(expr elt, comprehension* generators) | DictComp(expr key, expr value, comprehension* generators) | GeneratorExp(expr elt, comprehension* generators) -- as restrições gramaticais onde yield expressions pode ocorrer | Await(expr value) | Yield(expr? value) | YieldFrom(expr value) -- precisa de sequências para comparar para distringuir entre -- x < 4 < 3 and (x < 4) < 3 | Compare(expr left, cmpop* ops, expr* comparators) | Call(expr func, expr* args, keyword* keywords) | FormattedValue(expr value, int conversion, expr? format_spec) | JoinedStr(expr* values) | Constant(constant value, string? kind) -- a expressão a seguir pode aparecer no contexto da atribuição | Attribute(expr value, identifier attr, expr_context ctx) | Subscript(expr value, expr slice, expr_context ctx) | Starred(expr value, expr_context ctx) | Name(identifier id, expr_context ctx) | List(expr* elts, expr_context ctx) | Tuple(expr* elts, expr_context ctx) -- pode aparecer apenas em subscrição | Slice(expr? lower, expr? upper, expr? step) -- col_offset é o deslocamente do bytes na string utf8 que o analisador sintático usa attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) expr_context = Load | Store | Del boolop = And | Or operator = Add | Sub | Mult | MatMult | Div | Mod | Pow | LShift | RShift | BitOr | BitXor | BitAnd | FloorDiv unaryop = Invert | Not | UAdd | USub cmpop = Eq | NotEq | Lt | LtE | Gt | GtE | Is | IsNot | In | NotIn comprehension = (expr target, expr iter, expr* ifs, int is_async) excepthandler = ExceptHandler(expr? type, identifier? name, stmt* body) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) arguments = (arg* posonlyargs, arg* args, arg? vararg, arg* kwonlyargs, expr* kw_defaults, arg? kwarg, expr* defaults) arg = (identifier arg, expr? annotation, string? type_comment) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) -- argumentos nomeados fornecidos à chamada (identificador NULL para **kwargs) keyword = (identifier? arg, expr value) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) -- nomes de importação com o apelido opcional 'as'. alias = (identifier name, identifier? asname) attributes (int lineno, int col_offset, int? end_lineno, int? end_col_offset) withitem = (expr context_expr, expr? optional_vars) match_case = (pattern pattern, expr? guard, stmt* body) pattern = MatchValue(expr value) | MatchSingleton(constant value) | MatchSequence(pattern* patterns) | MatchMapping(expr* keys, pattern* patterns, identifier? rest) | MatchClass(expr cls, pattern* patterns, identifier* kwd_attrs, pattern* kwd_patterns) | MatchStar(identifier? name) -- O parâmetro opcional de MatchMapping "rest" lida com a captura de chaves extras de mapeamento | MatchAs(pattern? pattern, identifier? name) | MatchOr(pattern* patterns) attributes (int lineno, int col_offset, int end_lineno, int end_col_offset) type_ignore = TypeIgnore(int lineno, string tag) type_param = TypeVar(identifier name, expr? bound, expr? default_value) | ParamSpec(identifier name, expr? default_value) | TypeVarTuple(identifier name, expr? default_value) attributes (int lineno, int col_offset, int end_lineno, int end_col_offset) }

source: Node classes
ast: Classes de nós

source: This is the base of all AST node classes. The actual node classes are derived from the :file:`Parser/Python.asdl` file, which is reproduced :ref:`above <abstract-grammar>`. They are defined in the :mod:`!_ast` C module and re-exported in :mod:`ast`.
ast: Esta é a base de todas as classes de nós de AST. As classes de nós reais são derivadas do arquivo :file:`Parser/Python.asdl`, que é reproduzido :ref:`acima <abstract-grammar>`. Elas são definidas no módulo C :mod:`!_ast` e reexportadas no :mod:`ast`.

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: Há uma classe definida para cada símbolo do lado esquerdo na gramática abstrata (por exemplo, :class:`ast.stmt` ou :class:`ast.expr`). Além disso, existe uma classe definida para cada construtor no lado direito; essas classes herdam das classes para as árvores do lado esquerdo. Por exemplo, :class:`ast.BinOp` herda de :class:`ast.expr`. Para regras de produção com alternativas ("somas"), a classe do lado esquerdo é abstrata: apenas instâncias de nós construtores específicos são criadas.

source: Each concrete class has an attribute :attr:`!_fields` which gives the names of all child nodes.
ast: Cada classe concreta possui um atributo :attr:`!_fields` que fornece os nomes de todos os nós filhos.

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: Cada instância de uma classe concreta tem um atributo para cada nó filho, do tipo definido na gramática. Por exemplo, as instâncias :class:`ast.BinOp` possuem um atributo :attr:`left` do tipo :class:`ast.expr`.

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: Se estes atributos estiverem marcados como opcionais na gramática (usando um ponto de interrogação), o valor pode ser ``None``. Se os atributos puderem ter valor zero ou mais (marcados com um asterisco), os valores serão representados como listas do Python. Todos os atributos possíveis devem estar presentes e ter valores válidos ao compilar uma AST com :func:`compile`.

source: The :attr:`!_field_types` attribute on each concrete class is a dictionary mapping field names (as also listed in :attr:`_fields`) to their types.
ast: O atributo :attr:`!_field_types` em cada classe concreta é um dicionário que mapeia nomes de campos (como também listado em :attr:`_fields`) para seus tipos.

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset` attributes. The :attr:`lineno` and :attr:`end_lineno` are the first and last line numbers of source text span (1-indexed so the first line is line 1) and the :attr:`col_offset` and :attr:`end_col_offset` are the corresponding UTF-8 byte offsets of the first and last tokens that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
ast: As instâncias das subclasses :class:`ast.expr` e :class:`ast.stmt` possuem os atributos :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno` e :attr:`end_col_offset`. O :attr:`lineno` e :attr:`end_lineno` são o primeiro e o último número de linha do intervalo do texto de origem (indexado em 1, para que a primeira linha seja a linha 1) e o :attr:`col_offset` e :attr:`end_col_offset` são os deslocamentos de byte UTF-8 correspondentes do primeiro e do último tokens que geraram o nó. O deslocamento UTF-8 é registrado porque o analisador sintático usa UTF-8 internamente.

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: Observe que as posições finais não são exigidas pelo compilador e, portanto, são opcionais. O deslocamento final está *após* o último símbolo, por exemplo, é possível obter o segmento de origem de um nó de expressão de uma linha usando ``source_line[node.col_offset : node.end_col_offset]``.

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: O construtor de uma classe :class:`ast.T` analisa seus argumentos da seguinte forma:

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: Se houver argumentos posicionais, deve haver tantos quanto houver itens em :attr:`T._fields`; eles serão atribuídos como atributos desses nomes.

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: Se houver argumentos nomeados, eles definirão os atributos dos mesmos nomes para os valores fornecidos.

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: Por exemplo, para criar e popular um nó :class:`ast.UnaryOp`, você poderia usar ::

source: If a field that is optional in the grammar is omitted from the constructor, it defaults to ``None``. If a list field is omitted, it defaults to the empty list. If a field of type :class:`!ast.expr_context` is omitted, it defaults to :class:`Load() <ast.Load>`. If any other field is omitted, a :exc:`DeprecationWarning` is raised and the AST node will not have this field. In Python 3.15, this condition will raise an error.
ast: Se um campo que é opcional na gramática for omitido do construtor, o padrão é ``None``. Se um campo de lista for omitido, o padrão será a lista vazia. Se um campo do tipo :class:`!ast.expr_context` for omitido, o padrão é :class:`Load() <ast.Load>`. Se qualquer outro campo for omitido, uma :exc:`DeprecationWarning` será levantada e o nó AST não terá este campo. No Python 3.15, esta condição levantará um erro.

source: Class :class:`ast.Constant` is now used for all constants.
ast: A classe :class:`ast.Constant` é agora usada para todas as constantes.

source: Simple indices are represented by their value, extended slices are represented as tuples.
ast: Os índices simples são representados por seus valores, as fatias estendidas são representadas como tuplas.

source: Old classes :class:`!ast.Num`, :class:`!ast.Str`, :class:`!ast.Bytes`, :class:`!ast.NameConstant` and :class:`!ast.Ellipsis` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: Classes antigas :class:`!ast.Num`, :class:`!ast.Str`, :class:`!ast.Bytes`, :class:`!ast.NameConstant` e :class:`!ast.Ellipsis` ainda estão disponíveis, mas serão removidos em versões futuras do Python. Enquanto isso, instanciá-las retornará uma instância de uma classe diferente.

source: Old classes :class:`!ast.Index` and :class:`!ast.ExtSlice` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: Classes antigas :class:`!ast.Index` e :class:`!ast.ExtSlice` ainda estão disponíveis, mas serão removidos em versões futuras do Python. Enquanto isso, instanciá-las retornará uma instância de uma classe diferente.

source: Previous versions of Python allowed the creation of AST nodes that were missing required fields. Similarly, AST node constructors allowed arbitrary keyword arguments that were set as attributes of the AST node, even if they did not match any of the fields of the AST node. This behavior is deprecated and will be removed in Python 3.15.
ast: Versões anteriores do Python permitiam a criação de nós AST sem campos obrigatórios. Da mesma forma, os construtores do nó AST permitiam argumentos nomeados arbitrários que eram definidos como atributos do nó AST, mesmo que não correspondessem a nenhum dos campos do nó AST. Este comportamento foi descontinuado e será removido no Python 3.15.

source: The descriptions of the specific node classes displayed here were initially adapted from the fantastic `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ project and all its contributors.
ast: As descrições das classes de nós específicas exibidas aqui foram inicialmente adaptadas do fantástico projeto `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ e de todos os seus contribuidores.

source: Root nodes
ast: Nós raízes

source: A Python module, as with :ref:`file input <file-input>`. Node type generated by :func:`ast.parse` in the default ``"exec"`` *mode*.
ast: Um módulo Python, como :ref:`entrada de arquivo <file-input>`. Tipo de nó gerado por :func:`ast.parse` com *mode* no padrão ``"exec"``.

source: ``body`` is a :class:`list` of the module's :ref:`ast-statements`.
ast: ``body`` é uma :class:`list` das :ref:`ast-statements` do módulo.

source: ``type_ignores`` is a :class:`list` of the module's type ignore comments; see :func:`ast.parse` for more details.
ast: ``type_ignores`` é uma :class:`list` dos comentários de ignorar tipo do módulo; veja :func:`ast.parse` para mais detalhes.

source: A single Python :ref:`expression input <expression-input>`. Node type generated by :func:`ast.parse` when *mode* is ``"eval"``.
ast: Uma única :ref:`entrada de expressão <expression-input>` Python. Tipo de nó gerado por :func:`ast.parse` quando *mode* é ``"eval"``.

source: ``body`` is a single node, one of the :ref:`expression types <ast-expressions>`.
ast: ``body`` é um nó único, um dos :ref:`tipos de expressão <ast-expressions>`.

source: A single :ref:`interactive input <interactive>`, like in :ref:`tut-interac`. Node type generated by :func:`ast.parse` when *mode* is ``"single"``.
ast: Uma única :ref:`entrada interativa <interactive>`, como em :ref:`tut-interac`. Tipo de nó gerado por :func:`ast.parse` quando *mode* é ``"single"``.

source: ``body`` is a :class:`list` of :ref:`statement nodes <ast-statements>`.
ast: ``body`` é uma :class:`list` de :ref:`nós de instrução <ast-statements>`.
