Repository: python/python-docs-pt-br
Catalog: library/*.po
Languages: ast

source: A representation of an old-style type comments for functions, as Python versions prior to 3.5 didn't support :pep:`484` annotations. Node type generated by :func:`ast.parse` when *mode* is ``"func_type"``.
ast: Uma representação de comentários de tipo antigo para funções, já que as versões do Python anteriores a 3.5 não davam suporte às anotações da :pep:`484`. Tipo de nó gerado por :func:`ast.parse` quando *mode* é ``"func_type"``.

source: Such type comments would look like this::
ast: Esses comentários de tipo ficariam assim::

source: def sum_two_number(a, b): # type: (int, int) -> int return a + b
ast: def sum_two_number(a, b): # tipo: (int, int) -> int return a + b

source: ``argtypes`` is a :class:`list` of :ref:`expression nodes <ast-expressions>`.
ast: ``argtypes`` é uma :class:`list` de :ref:`nós de expressão <ast-expressions>`.

source: ``returns`` is a single :ref:`expression node <ast-expressions>`.
ast: ``returns`` é um único :ref:`nó de expressão <ast-expressions>`.

source: Literals
ast: Literais

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: Um valor constante. O atributo ``value`` do literal ``Constant`` contém o objeto Python que ele representa. Os valores representados podem ser tipos simples como um número, string ou ``None``, mas também tipos de contêineres imutáveis (tuplas e frozensets) se todos os seus elementos forem constantes.

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: Nó que representa um único campo de formatação em uma f-string. Se a string contiver um único campo de formatação e nada mais, o nó poderá ser isolado, caso contrário ele aparecerá em :class:`JoinedStr`.

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: ``value`` é qualquer nó de expressão (como um literal, uma variável ou uma chamada de função).

source: ``conversion`` is an integer:
ast: ``conversion`` é um inteiro:

source: -1: no formatting
ast: -1: sem formatação

source: 115: ``!s`` string formatting
ast: 115: ``!s`` formatação de string

source: 114: ``!r`` repr formatting
ast: 114: ``!r`` formatação de repr

source: 97: ``!a`` ascii formatting
ast: 97: ``!a`` formatação ascii

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: ``format_spec`` é um nó :class:`JoinedStr` que representa a formatação do valor, ou ``None`` se nenhum formato foi especificado. Tanto ``conversion`` quanto ``format_spec`` podem ser configurados ao mesmo tempo.

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: Uma f-string, compreendendo uma série de nós :class:`FormattedValue` e :class:`Constant`.

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: Uma lista ou tupla. ``elts`` contém uma lista de nós que representam os elementos. ``ctx`` é :class:`Store` se o contêiner for um alvo de atribuição (ou seja, ``(x,y)=algumacoisa``), e :class:`Load` caso contrário.

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: Um conjunto. ``elts`` contém uma lista de nós que representam os elementos do conjunto.

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: Um dicionário. ``keys`` e ``values`` contêm listas de nós que representam as chaves e os valores respectivamente, em ordem correspondente (o que seria retornado ao chamar :code:`dictionary.keys()` e :code:`dictionary.values()`).

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: Ao desempacotar o dicionário usando literais de dicionário, a expressão a ser expandida vai para a lista ``values``, com um ``None`` na posição correspondente em ``keys``.

source: Variables
ast: Variáveis

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: Um nome de variável. ``id`` contém o nome como uma string e ``ctx`` é um dos seguintes tipos.

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: As referências de variáveis podem ser usadas para carregar o valor de uma variável, para atribuir um novo valor a ela ou para excluí-la. As referências de variáveis recebem um contexto para distinguir esses casos.

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: Uma referência de variável ``*var``. ``value`` contém a variável, normalmente um nó :class:`Name`. Este tipo deve ser usado ao construir um nó :class:`Call` com ``*args``.

source: Expressions
ast: Expressões

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: Quando uma expressão, como uma chamada de função, aparece como uma instrução por si só com seu valor de retorno não usado ou armazenado, ela é encapsulada neste contêiner. ``value`` contém um dos outros nós nesta seção, um nó :class:`Constant`, um :class:`Name`, um :class:`Lambda`, um :class:`Yield` ou :class:`YieldFrom`.

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: Uma operação unária. ``op`` é o operador e ``operand`` qualquer nó de expressão.

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: Tokens de operador unário. :class:`Not` é a palavra reservada ``not``, :class:`Invert` é o operador ``~``.

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: Uma operação binária (como adição ou divisão). ``op`` é o operador, e ``left`` e ``right`` são quaisquer nós de expressão.

source: Binary operator tokens.
ast: Tokens de operador binário.

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: Uma operação booleana, 'or' ou 'and'. ``op`` é :class:`Or` ou :class:`And`. ``values`` são os valores envolvidos. Operações consecutivas com o mesmo operador, como ``a or b or c``, são recolhidas em um nó com vários valores.

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: Isso não inclui ``not``, que é um :class:`UnaryOp`.

source: Boolean operator tokens.
ast: Tokens de operador booleano.

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: Uma comparação de dois ou mais valores. ``left`` é o primeiro valor na comparação, ``ops`` a lista de operadores e ``comparators`` a lista de valores após o primeiro elemento na comparação.

source: Comparison operator tokens.
ast: Tokens de operador de comparação.

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: Uma chamada de função. ``func`` é a função, que geralmente será um objeto :class:`Name` ou :class:`Attribute`. Dos argumentos:

source: ``args`` holds a list of the arguments passed by position.
ast: ``args`` contém uma lista dos argumentos passados ​por posição.

source: ``keywords`` holds a list of :class:`.keyword` objects representing arguments passed by keyword.
ast: ``keywords`` contém uma lista de objetos :class:`.keyword` representando argumentos passados como nomeados.

source: The ``args`` and ``keywords`` arguments are optional and default to empty lists.
ast: Os argumentos ``args`` e ``keywords`` são opcionais e padrão para listas vazias.

source: A keyword argument to a function call or class definition. ``arg`` is a raw string of the parameter name, ``value`` is a node to pass in.
ast: Um argumento nomeado para uma chamada de função ou definição de classe. ``arg`` é uma string bruta do nome do parâmetro, ``value`` é um nó para passar.

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: Uma expressão como ``a if b else c``. Cada campo contém um único nó, portanto, no exemplo a seguir, todos os três são nós :class:`Name`.

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: Acesso a atributo como, por exemplo, ``d.keys``. ``value`` é um nó, normalmente um :class:`Name`. ``attr`` é uma string simples fornecendo o nome do atributo, e ``ctx`` é :class:`Load`, :class:`Store` ou :class:`Del` de acordo com como o atributo é acionado sobre.

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: Uma expressão nomeada. Este nó de AST é produzido pelo operador de expressões de atribuição (também conhecido como operador morsa). Ao contrário do nó :class:`Assign` no qual o primeiro argumento pode ser múltiplos nós, neste caso ambos ``target`` e ``value`` devem ser nós únicos.

source: Subscripting
ast: Subscrição

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: Um subscrito, como ``l[1]``. ``value`` é o objeto subscrito (geralmente sequência ou mapeamento). ``slice`` é um índice, fatia ou chave. Pode ser uma :class:`Tuple` e conter uma :class:`Slice`. ``ctx`` é :class:`Load`, :class:`Store` ou :class:`Del` de acordo com a ação realizada com o subscrito.

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: Fatiamento regular (no formato ``lower:upper`` ou ``lower:upper:step``). Pode ocorrer apenas dentro do campo *slice* de :class:`Subscript`, diretamente ou como um elemento de :class:`Tuple`.

source: Comprehensions
ast: Compreensões

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: Lista e define compreensões, expressões geradoras e compreensões de dicionário. ``elt`` (ou ``key`` e ``value``) é um único nó que representa a parte que será avaliada para cada item.

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: ``generators`` é uma lista de nós de :class:`comprehension`.

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: Uma cláusula ``for`` em uma compreensão. ``target`` é a referência a ser usada para cada elemento - normalmente um nó :class:`Name` ou :class:`Tuple`. ``iter`` é o objeto sobre o qual iterar. ``ifs`` é uma lista de expressões de teste: cada cláusula ``for`` pode ter múltiplos ``ifs``.

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: ``is_async`` indica que uma compreensão é assíncrona (usando um ``async for`` em vez de ``for``). O valor é um número inteiro (0 ou 1).

source: >>> print(ast.dump(ast.parse('[ord(c) for line in file for c in line]', mode='eval'), ... indent=4)) # Multiple comprehensions in one. Expression( body=ListComp( elt=Call( func=Name(id='ord', ctx=Load()), args=[ Name(id='c', ctx=Load())]), generators=[ comprehension( target=Name(id='line', ctx=Store()), iter=Name(id='file', ctx=Load()), is_async=0), comprehension( target=Name(id='c', ctx=Store()), iter=Name(id='line', ctx=Load()), is_async=0)])) >>> print(ast.dump(ast.parse('(n**2 for n in it if n>5 if n<10)', mode='eval'), ... indent=4)) # generator comprehension Expression( body=GeneratorExp( elt=BinOp( left=Name(id='n', ctx=Load()), op=Pow(), right=Constant(value=2)), generators=[ comprehension( target=Name(id='n', ctx=Store()), iter=Name(id='it', ctx=Load()), ifs=[ Compare( left=Name(id='n', ctx=Load()), ops=[ Gt()], comparators=[ Constant(value=5)]), Compare( left=Name(id='n', ctx=Load()), ops=[ Lt()], comparators=[ Constant(value=10)])], is_async=0)])) >>> print(ast.dump(ast.parse('[i async for i in soc]', mode='eval'), ... indent=4)) # Async comprehension Expression( body=ListComp( elt=Name(id='i', ctx=Load()), generators=[ comprehension( target=Name(id='i', ctx=Store()), iter=Name(id='soc', ctx=Load()), is_async=1)]))
ast: >>> print(ast.dump(ast.parse('[ord(c) for line in file for c in line]', mode='eval'), ... indent=4)) # Várias compreensões em uma. Expression( body=ListComp( elt=Call( func=Name(id='ord', ctx=Load()), args=[ Name(id='c', ctx=Load())]), generators=[ comprehension( target=Name(id='line', ctx=Store()), iter=Name(id='file', ctx=Load()), is_async=0), comprehension( target=Name(id='c', ctx=Store()), iter=Name(id='line', ctx=Load()), is_async=0)])) >>> print(ast.dump(ast.parse('(n**2 for n in it if n>5 if n<10)', mode='eval'), ... indent=4)) # compreensão de gerador Expression( body=GeneratorExp( elt=BinOp( left=Name(id='n', ctx=Load()), op=Pow(), right=Constant(value=2)), generators=[ comprehension( target=Name(id='n', ctx=Store()), iter=Name(id='it', ctx=Load()), ifs=[ Compare( left=Name(id='n', ctx=Load()), ops=[ Gt()], comparators=[ Constant(value=5)]), Compare( left=Name(id='n', ctx=Load()), ops=[ Lt()], comparators=[ Constant(value=10)])], is_async=0)])) >>> print(ast.dump(ast.parse('[i async for i in soc]', mode='eval'), ... indent=4)) # compreensão de async Expression( body=ListComp( elt=Name(id='i', ctx=Load()), generators=[ comprehension( target=Name(id='i', ctx=Store()), iter=Name(id='soc', ctx=Load()), is_async=1)]))

source: Statements
ast: Instruções

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: Uma atribuição. ``targets`` é uma lista de nós e ``value`` é um único nó.

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: Vários nós em ``targets`` representam a atribuição do mesmo valor a cada um. O desempacotamento é representada colocando uma :class:`Tuple` ou :class:`List` dentro de ``targets``.

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: ``type_comment`` é uma string opcional com a anotação de tipo como comentário.

source: An assignment with a type annotation. ``target`` is a single node and can be a :class:`Name`, an :class:`Attribute` or a :class:`Subscript`. ``annotation`` is the annotation, such as a :class:`Constant` or :class:`Name` node. ``value`` is a single optional node.
ast: Uma atribuição com uma anotação de tipo. ``target`` é um nó único e pode ser uma classe :class:`Name`, :class:`Attribute` ou :class:`Subscript`. ``annotation`` é a anotação, como um nó :class:`Constant` ou :class:`Name`. ``value`` é um único nó opcional.

source: ``simple`` is always either 0 (indicating a "complex" target) or 1 (indicating a "simple" target). A "simple" target consists solely of a :class:`Name` node that does not appear between parentheses; all other targets are considered complex. Only simple targets appear in the :attr:`~object.__annotations__` dictionary of modules and classes.
ast: ``simple`` é sempre 0 (indicando um alvo "complexo") ou 1 (indicando um alvo "simples"). Um alvo "simples" consiste apenas em um nó :class:`Name` que não aparece entre parênteses; todos os outros alvos são considerados complexos. Apenas alvos simples aparecem no dicionário :attr:`~object.__annotations__` de módulos e classes.

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: Atribuição aumentada, como ``a += 1``. No exemplo a seguir, ``target`` é um nó :class:`Name` para ``x`` (com o contexto :class:`Store`), ``op`` é :class:`Add`, e ``value`` é uma :class:`Constant` com valor para 1.

source: The ``target`` attribute cannot be of class :class:`Tuple` or :class:`List`, unlike the targets of :class:`Assign`.
ast: O atributo ``target`` não pode ser da classe :class:`Tuple` ou :class:`List`, diferentemente dos alvos de :class:`Assign`.

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: Uma instrução ``raise``. ``exc`` é o objeto de exceção a ser levantado, normalmente uma :class:`Call` ou :class:`Name`, ou ``None`` para um ``raise`` independente. ``cause`` é a parte opcional para ``y`` em ``raise x from y``.

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: Uma asserção. ``test`` contém a condição, como um nó :class:`Compare`. ``msg`` contém a mensagem de falha.

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: Representa uma instrução ``del``. ``targets`` é uma lista de nós, como nós :class:`Name`, :class:`Attribute` ou :class:`Subscript`.

source: A ``pass`` statement.
ast: Uma instrução ``pass``.

source: A :ref:`type alias <type-aliases>` created through the :keyword:`type` statement. ``name`` is the name of the alias, ``type_params`` is a list of :ref:`type parameters <ast-type-params>`, and ``value`` is the value of the type alias.
ast: Um :ref:`apelido de tipo <type-aliases>` criado através da instrução :keyword:`type`. ``name`` é o nome do apelido, ``type_params`` é uma lista de :ref:`parâmetros de tipo <ast-type-params>`, e ``value`` é o valor do apelido do tipo.

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: Outras instruções que são aplicáveis apenas dentro de funções ou laços são descritas em outras seções.

source: Imports
ast: Importações

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: Uma instrução de importação. ``names`` é uma lista de nós de :class:`alias`.

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: Representa ``from x import y``. ``module`` é uma string bruta do nome 'from', sem quaisquer pontos iniciais, ou ``None`` para instruções como ``from . import foo``. ``level`` é um número inteiro que contém o nível da importação relativa (0 significa importação absoluta).

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: Ambos os parâmetros são strings brutas dos nomes. ``asname`` pode ser ``None`` se o nome normal for usado.

source: Control flow
ast: Fluxo de controle

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: Cláusulas opcionais como ``else`` são armazenadas como uma lista vazia se não estiverem presentes.

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: Uma instrução ``if``. ``test`` contém um único nó, como um nó :class:`Compare`. ``body`` e ``orelse`` contêm, cada um, uma lista de nós.

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: As cláusulas ``elif`` não têm uma representação especial no AST, mas aparecem como nós extras de :class:`If` dentro da seção ``orelse`` da cláusula anterior.

source: A ``for`` loop. ``target`` holds the variable(s) the loop assigns to, as a single :class:`Name`, :class:`Tuple`, :class:`List`, :class:`Attribute` or :class:`Subscript` node. ``iter`` holds the item to be looped over, again as a single node. ``body`` and ``orelse`` contain lists of nodes to execute. Those in ``orelse`` are executed if the loop finishes normally, rather than via a ``break`` statement.
ast: Um laço ``for``. ``target`` contém as variáveis às quais o laço atribui, como um único nó de :class:`Name`, :class:`Tuple`, :class:`List`, :class:`Attribute` ou :class:`Subscript`. ``iter`` contém o item a ser repetido, novamente como um único nó. ``body`` e ``orelse`` contêm listas de nós para executar. Aqueles em ``orelse`` são executados se o laço terminar normalmente, ao invés de através de uma instrução ``break``.

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: Um laço ``while``. ``test`` contém a condição, como um nó de :class:`Compare`.

source: The ``break`` and ``continue`` statements.
ast: As instruções ``break`` e ``continue``.

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: Blocos ``try``. Todos os atributos são uma lista de nós a serem executados, exceto ``handlers``, que é uma lista de nós de :class:`ExceptHandler`.

source: ``try`` blocks which are followed by ``except*`` clauses. The attributes are the same as for :class:`Try` but the :class:`ExceptHandler` nodes in ``handlers`` are interpreted as ``except*`` blocks rather then ``except``.
ast: Blocos ``try`` que são seguidos por cláusulas ``except*``. Os atributos são os mesmos de :class:`Try`, mas os nós :class:`ExceptHandler` em ``handlers`` são interpretados como blocos ``except*`` em vez de ``except``.
