Repository: python/python-docs-pt-br
Catalog: library/*.po
Languages: ast

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: Uma única cláusula ``except``. ``type`` é o tipo de exceção que irá corresponder, normalmente um nó de :class:`Name` (ou ``None`` para uma cláusula abrangente ``except:``). ``name`` é uma string bruta para o nome conter a exceção, ou ``None`` se a cláusula não tiver ``as foo``. ``body`` é uma lista de nós.

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: Um bloco ``with``. ``items`` é uma lista de nós :class:`withitem` representando os gerenciadores de contexto, e ``body`` é o bloco indentado dentro do contexto.

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: Um único gerenciador de contexto em um bloco ``with``. ``context_expr`` é o gerenciador de contexto, geralmente um nó de :class:`Call`. ``optional_vars`` é um :class:`Name`, :class:`Tuple` ou :class:`List` para a parte ``as foo``, ou ``None`` se não for usado.

source: Pattern matching
ast: Correspondência de padrões

source: A ``match`` statement. ``subject`` holds the subject of the match (the object that is being matched against the cases) and ``cases`` contains an iterable of :class:`match_case` nodes with the different cases.
ast: Uma instrução ``match``. ``subject`` contém o assunto da correspondência (o objeto que está sendo comparado com os casos) e ``cases`` contém um iterável de nós de :class:`match_case` com os diferentes casos.

source: A single case pattern in a ``match`` statement. ``pattern`` contains the match pattern that the subject will be matched against. Note that the :class:`AST` nodes produced for patterns differ from those produced for expressions, even when they share the same syntax.
ast: Um padrão de caso único em uma instrução ``match``. ``pattern`` contém o padrão de correspondência com o qual o assunto será comparado. Observe que os nós :class:`AST` produzidos para padrões diferem daqueles produzidos para expressões, mesmo quando compartilham a mesma sintaxe.

source: The ``guard`` attribute contains an expression that will be evaluated if the pattern matches the subject.
ast: O atributo ``guard`` contém uma expressão que será avaliada se o padrão corresponder ao assunto.

source: ``body`` contains a list of nodes to execute if the pattern matches and the result of evaluating the guard expression is true.
ast: ``body`` contém uma lista de nós a serem executados se o padrão corresponder e o resultado da avaliação da expressão de guarda for verdadeiro.

source: A match literal or value pattern that compares by equality. ``value`` is an expression node. Permitted value nodes are restricted as described in the match statement documentation. This pattern succeeds if the match subject is equal to the evaluated value.
ast: Um literal de correspondência ou padrão de valor que é comparado por igualdade. ``value`` é um nó de expressão. Os nós de valor permitido são restritos conforme descrito na documentação da instrução de correspondência. Este padrão será bem-sucedido se o assunto da correspondência for igual ao valor avaliado.

source: A match literal pattern that compares by identity. ``value`` is the singleton to be compared against: ``None``, ``True``, or ``False``. This pattern succeeds if the match subject is the given constant.
ast: Um padrão literal de correspondência que compara por identidade. ``value`` é o singleton a ser comparado com: ``None``, ``True`` ou ``False``. Este padrão será bem-sucedido se o assunto da correspondência for a constante fornecida.

source: A match sequence pattern. ``patterns`` contains the patterns to be matched against the subject elements if the subject is a sequence. Matches a variable length sequence if one of the subpatterns is a ``MatchStar`` node, otherwise matches a fixed length sequence.
ast: Um padrão de sequência de correspondência. ``patterns`` contém os padrões a serem comparados aos elementos do assunto se o assunto for uma sequência. Corresponde a uma sequência de comprimento variável se um dos subpadrões for um nó ``MatchStar``, caso contrário corresponde a uma sequência de comprimento fixo.

source: Matches the rest of the sequence in a variable length match sequence pattern. If ``name`` is not ``None``, a list containing the remaining sequence elements is bound to that name if the overall sequence pattern is successful.
ast: Corresponde ao restante da sequência em um padrão de sequência de correspondência de comprimento variável. Se ``name`` não for ``None``, uma lista contendo os elementos restantes da sequência será vinculada a esse nome se o padrão de sequência geral for bem-sucedido.

source: A match mapping pattern. ``keys`` is a sequence of expression nodes. ``patterns`` is a corresponding sequence of pattern nodes. ``rest`` is an optional name that can be specified to capture the remaining mapping elements. Permitted key expressions are restricted as described in the match statement documentation.
ast: Um padrão de mapeamento de correspondência. ``keys`` é uma sequência de nós de expressão. ``patterns`` é uma sequência correspondente de nós padrão. ``rest`` é um nome opcional que pode ser especificado para capturar os elementos restantes do mapeamento. As expressões-chave permitidas são restritas conforme descrito na documentação da instrução match.

source: This pattern succeeds if the subject is a mapping, all evaluated key expressions are present in the mapping, and the value corresponding to each key matches the corresponding subpattern. If ``rest`` is not ``None``, a dict containing the remaining mapping elements is bound to that name if the overall mapping pattern is successful.
ast: Este padrão será bem-sucedido se o assunto for um mapeamento, todas as expressões-chave avaliadas estiverem presentes no mapeamento e o valor correspondente a cada chave corresponder ao subpadrão correspondente. Se ``rest`` não for ``None``, um dict contendo os elementos de mapeamento restantes será vinculado a esse nome se o padrão de mapeamento geral for bem-sucedido.

source: A match class pattern. ``cls`` is an expression giving the nominal class to be matched. ``patterns`` is a sequence of pattern nodes to be matched against the class defined sequence of pattern matching attributes. ``kwd_attrs`` is a sequence of additional attributes to be matched (specified as keyword arguments in the class pattern), ``kwd_patterns`` are the corresponding patterns (specified as keyword values in the class pattern).
ast: Um padrão de classe de correspondência. ``cls`` é uma expressão que fornece a classe nominal a ser correspondida. ``patterns`` é uma sequência de nós padrão a serem comparados com a sequência definida pela classe de atributos de correspondência de padrões. ``kwd_attrs`` é uma sequência de atributos adicionais a serem correspondidos (especificados como argumentos nomeados no padrão de classe), ``kwd_patterns`` são os padrões correspondentes (especificados como valores de argumentos nomeados no padrão de classe).

source: This pattern succeeds if the subject is an instance of the nominated class, all positional patterns match the corresponding class-defined attributes, and any specified keyword attributes match their corresponding pattern.
ast: Esse padrão será bem-sucedido se o assunto for uma instância da classe indicada, todos os padrões posicionais corresponderem aos atributos correspondentes definidos pela classe e quaisquer atributos, passados como argumentos nomeados, especificados corresponderem ao seu padrão correspondente.

source: Note: classes may define a property that returns self in order to match a pattern node against the instance being matched. Several builtin types are also matched that way, as described in the match statement documentation.
ast: Nota: as classes podem definir uma propriedade que retorna self para corresponder um nó padrão à instância que está sendo correspondida. Vários tipos internos também são combinados dessa forma, conforme descrito na documentação da instrução match.

source: A match "as-pattern", capture pattern or wildcard pattern. ``pattern`` contains the match pattern that the subject will be matched against. If the pattern is ``None``, the node represents a capture pattern (i.e a bare name) and will always succeed.
ast: Uma correspondência "como padrão", padrão de captura ou padrão curinga. ``pattern`` contém o padrão de correspondência com o qual o assunto será comparado. Se o padrão for ``None``, o nó representa um padrão de captura (ou seja, um nome simples) e sempre terá sucesso.

source: The ``name`` attribute contains the name that will be bound if the pattern is successful. If ``name`` is ``None``, ``pattern`` must also be ``None`` and the node represents the wildcard pattern.
ast: O atributo ``name`` contém o nome que será vinculado se o padrão for bem-sucedido. Se ``name`` for ``None``, ``pattern`` também deverá ser ``None`` e o nó representa o padrão curinga.

source: A match "or-pattern". An or-pattern matches each of its subpatterns in turn to the subject, until one succeeds. The or-pattern is then deemed to succeed. If none of the subpatterns succeed the or-pattern fails. The ``patterns`` attribute contains a list of match pattern nodes that will be matched against the subject.
ast: Uma correspondência de "padrão ou". Um "padrão ou" corresponde cada um de seus subpadrões com o assunto, até que um seja bem-sucedido. O "padrão ou" é então considerado bem-sucedido. Se nenhum dos subpadrões for bem-sucedido, o padrão or falhará. O atributo ``patterns`` contém uma lista de nós de padrões de correspondência que serão comparados com o assunto.

source: Type parameters
ast: Parâmetros de tipo

source: :ref:`Type parameters <type-params>` can exist on classes, functions, and type aliases.
ast: :ref:`Parâmetros de tipo <type-params>` podem existir em classes, funções e apelidos de tipo.

source: A :class:`typing.TypeVar`. ``name`` is the name of the type variable. ``bound`` is the bound or constraints, if any. If ``bound`` is a :class:`Tuple`, it represents constraints; otherwise it represents the bound. ``default_value`` is the default value; if the :class:`!TypeVar` has no default, this attribute will be set to ``None``.
ast: Uma :class:`typing.TypeVar`. ``name`` é o nome da variável de tipo. ``bound`` é o limite ou as restrições, se houver. Se ``bound`` for uma :class:`Tuple`, ele representa restrições; caso contrário, representa o limite. ``default_value`` é o valor padrão; se :class:`!TypeVar` não tiver padrão, este atributo será definido como ``None``.

source: Added the *default_value* parameter.
ast: Adicionado o parâmetro *default_value*.

source: A :class:`typing.ParamSpec`. ``name`` is the name of the parameter specification. ``default_value`` is the default value; if the :class:`!ParamSpec` has no default, this attribute will be set to ``None``.
ast: Uma :class:`typing.ParamSpec`. ``name`` é o nome da especificação do parâmetro. ``default_value`` é o valor padrão; se :class:`!ParamSpec` não tiver padrão, este atributo será definido como ``None``.

source: A :class:`typing.TypeVarTuple`. ``name`` is the name of the type variable tuple. ``default_value`` is the default value; if the :class:`!TypeVarTuple` has no default, this attribute will be set to ``None``.
ast: Uma :class:`typing.TypeVarTuple`. ``name`` é o nome da tupla da variável de tipo. ``default_value`` é o valor padrão; se :class:`!TypeVarTuple` não tiver padrão, este atributo será definido como ``None``.

source: Function and class definitions
ast: Definições de função e classe

source: A function definition.
ast: Uma definição de função

source: ``name`` is a raw string of the function name.
ast: ``name`` é uma string bruta do nome da função.

source: ``args`` is an :class:`arguments` node.
ast: ``args`` é um nó :class:`arguments`.

source: ``body`` is the list of nodes inside the function.
ast: ``body`` é a lista de nós dentro da função.

source: ``decorator_list`` is the list of decorators to be applied, stored outermost first (i.e. the first in the list will be applied last).
ast: ``decorator_list`` é a lista de decoradores a serem aplicados, armazenados primeiro na parte externa (ou seja, o primeiro da lista será aplicado por último).

source: ``returns`` is the return annotation.
ast: ``returns`` é a anotação de retorno.

source: ``type_params`` is a list of :ref:`type parameters <ast-type-params>`.
ast: ``type_params`` é uma lista de :ref:`parâmetros de tipo <ast-type-params>`.

source: Added ``type_params``.
ast: Adicionado ``type_params``.

source: ``lambda`` is a minimal function definition that can be used inside an expression. Unlike :class:`FunctionDef`, ``body`` holds a single node.
ast: ``lambda`` é uma definição mínima de função que pode ser usada dentro de uma expressão. Ao contrário de :class:`FunctionDef`, ``body`` contém um único nó.

source: The arguments for a function.
ast: Os argumentos para uma função.

source: ``posonlyargs``, ``args`` and ``kwonlyargs`` are lists of :class:`arg` nodes.
ast: ``posonlyargs``, ``args`` e ``kwonlyargs`` são listas de nós :class:`arg`.

source: ``vararg`` and ``kwarg`` are single :class:`arg` nodes, referring to the ``*args, **kwargs`` parameters.
ast: ``vararg`` e ``kwarg`` são nós :class:`arg` únicos, referindo-se aos parâmetros ``*args, **kwargs``.

source: ``kw_defaults`` is a list of default values for keyword-only arguments. If one is ``None``, the corresponding argument is required.
ast: ``kw_defaults`` é uma lista de valores padrão para argumentos somente-nomeados. Se um for ``None``, o argumento correspondente é necessário.

source: ``defaults`` is a list of default values for arguments that can be passed positionally. If there are fewer defaults, they correspond to the last n arguments.
ast: ``defaults`` é uma lista de valores padrão para argumentos que podem ser passados ​posicionalmente. Se houver menos padrões, eles corresponderão aos últimos n argumentos.

source: A single argument in a list. ``arg`` is a raw string of the argument name; ``annotation`` is its annotation, such as a :class:`Name` node.
ast: Um único argumento em uma lista. ``arg`` é uma string bruta do nome do argumento; ``annotation`` é sua anotação, como um nó :class:`Name`.

source: ``type_comment`` is an optional string with the type annotation as a comment
ast: ``type_comment`` é uma string opcional com a anotação de tipo como comentário

source: A ``return`` statement.
ast: Uma instrução ``return``.

source: A ``yield`` or ``yield from`` expression. Because these are expressions, they must be wrapped in an :class:`Expr` node if the value sent back is not used.
ast: Uma expressão ``yield`` ou ``yield from``. Por serem expressões, elas devem ser agrupadas em um nó :class:`Expr` se o valor enviado de volta não for usado.

source: ``global`` and ``nonlocal`` statements. ``names`` is a list of raw strings.
ast: Instruções ``global`` e ``nonlocal``. ``names`` é uma lista de strings brutas.

source: A class definition.
ast: Uma definição de classe

source: ``name`` is a raw string for the class name
ast: ``name`` é uma string bruta para o nome da classe

source: ``bases`` is a list of nodes for explicitly specified base classes.
ast: ``bases`` é uma lista de nós para classes base especificadas explicitamente.

source: ``keywords`` is a list of :class:`.keyword` nodes, principally for 'metaclass'. Other keywords will be passed to the metaclass, as per :pep:`3115`.
ast: ``keywords`` é uma lista de nós :class:`.keyword`, principalmente para 'metaclass'. Outras argumentos nomeados serão passadas para a metaclasse, conforme a :pep:`3115`.

source: ``body`` is a list of nodes representing the code within the class definition.
ast: ``body`` é uma lista de nós que representam o código dentro da definição de classe.

source: ``decorator_list`` is a list of nodes, as in :class:`FunctionDef`.
ast: ``decorator_list`` é uma lista de nós, como em :class:`FunctionDef`.

source: Async and await
ast: Async e await

source: An ``async def`` function definition. Has the same fields as :class:`FunctionDef`.
ast: Uma definição de função ``async def``. Possui os mesmos campos que :class:`FunctionDef`.

source: An ``await`` expression. ``value`` is what it waits for. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: Uma expressão ``await``. ``value`` é o que ela espera. Válido apenas no corpo de um :class:`AsyncFunctionDef`.

source: ``async for`` loops and ``async with`` context managers. They have the same fields as :class:`For` and :class:`With`, respectively. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: Laços ``async for`` e gerenciadores de contexto ``async with``. Eles têm os mesmos campos que :class:`For` e :class:`With`, respectivamente. Válido apenas no corpo de :class:`AsyncFunctionDef`.

source: When a string is parsed by :func:`ast.parse`, operator nodes (subclasses of :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` and :class:`ast.expr_context`) on the returned tree will be singletons. Changes to one will be reflected in all other occurrences of the same value (e.g. :class:`ast.Add`).
ast: Quando uma string é analisada por :func:`ast.parse`, os nós operadores (subclasses de :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` e :class:`ast.expr_context`) na árvore retornada serão singletons. As alterações em um serão refletidas em todas as outras ocorrências do mesmo valor (por exemplo, :class:`ast.Add`).

source: :mod:`ast` Helpers
ast: Auxiliares de :mod:`ast`

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: Além das classes de nós, o módulo :mod:`ast` define essas funções e classes utilitárias para percorrer árvores de sintaxe abstrata:

source: Parse the source into an AST node. Equivalent to ``compile(source, filename, mode, flags=FLAGS_VALUE, optimize=optimize)``, where ``FLAGS_VALUE`` is ``ast.PyCF_ONLY_AST`` if ``optimize <= 0`` and ``ast.PyCF_OPTIMIZED_AST`` otherwise.
ast: Analisa a fonte como um nó AST. Equivalente a ``compile(source, filename, mode, flags=FLAGS_VALUE, optimize=optimize)``, onde ``FLAGS_VALUE`` é ``ast.PyCF_ONLY_AST`` se ``optimize <= 0`` e ``ast.PyCF_OPTIMIZED_AST`` caso contrário.

source: If ``type_comments=True`` is given, the parser is modified to check and return type comments as specified by :pep:`484` and :pep:`526`. This is equivalent to adding :data:`ast.PyCF_TYPE_COMMENTS` to the flags passed to :func:`compile`. This will report syntax errors for misplaced type comments. Without this flag, type comments will be ignored, and the ``type_comment`` field on selected AST nodes will always be ``None``. In addition, the locations of ``# type: ignore`` comments will be returned as the ``type_ignores`` attribute of :class:`Module` (otherwise it is always an empty list).
ast: Se ``type_comments=True`` é fornecido, o analisador é modificado para verificar e retornar comentários do tipo, conforme especificado por :pep:`484` e :pep:`526`. Isso é equivalente a adicionar :data:`ast.PyCF_TYPE_COMMENTS` aos sinalizadores passados para :func:`compile`. Isso relatará erros de sintaxe para comentários do tipo extraviado. Sem esse sinalizador, os comentários do tipo serão ignorados e o campo ``type_comment`` nos nós AST selecionados sempre será ``None``. Além disso, os locais dos comentários ``# type: ignore`` serão retornados como o atributo ``type_ignores`` de :class:`Module` (caso contrário, é sempre uma lista vazia).

source: In addition, if ``mode`` is ``'func_type'``, the input syntax is modified to correspond to :pep:`484` "signature type comments", e.g. ``(str, int) -> List[str]``.
ast: Além disso, se ``mode`` for ``'func_type'``, a sintaxe de entrada é modificada para corresponder a "comentários de tipo de assinatura" de :pep:`484`, por exemplo, ``(str, int) -> List[str]``.

source: Setting ``feature_version`` to a tuple ``(major, minor)`` will result in a "best-effort" attempt to parse using that Python version's grammar. For example, setting ``feature_version=(3, 9)`` will attempt to disallow parsing of :keyword:`match` statements. Currently ``major`` must equal to ``3``. The lowest supported version is ``(3, 7)`` (and this may increase in future Python versions); the highest is ``sys.version_info[0:2]``. "Best-effort" attempt means there is no guarantee that the parse (or success of the parse) is the same as when run on the Python version corresponding to ``feature_version``.
ast: Definir ``feature_version`` como uma tupla ``(major, minor)`` resultará em uma tentativa de "melhor esforço" de análise usando a gramática daquela versão do Python. Por exemplo, definir ``feature_version=(3, 9)`` tentará proibir a análise de instruções :keyword:`match`. Atualmente ``major`` deve ser igual a ``3``. A versão mais baixa suportada é ``(3, 7)`` (e isso pode aumentar em versões futuras do Python); o mais alto é ``sys.version_info[0:2]``. A tentativa de "melhor esforço" significa que não há garantia de que a análise (ou sucesso da análise) seja a mesma que quando executada na versão Python correspondente a ``feature_version``.

source: If source contains a null character (``\0``), :exc:`ValueError` is raised.
ast: Se a fonte contém um caractere nulo (``\0``), :exc:`ValueError` é levantada.

source: Note that successfully parsing source code into an AST object doesn't guarantee that the source code provided is valid Python code that can be executed as the compilation step can raise further :exc:`SyntaxError` exceptions. For instance, the source ``return 42`` generates a valid AST node for a return statement, but it cannot be compiled alone (it needs to be inside a function node).
ast: Observe que a análise bem-sucedida do código-fonte em um objeto AST não garante que o código-fonte fornecido seja um código Python válido que pode ser executado, pois a etapa de compilação pode levantar mais exceções :exc:`SyntaxError`. Por exemplo, a fonte ``return 42`` gera um nó AST válido para uma instrução return, mas não pode ser compilado sozinho (precisa estar dentro de um nó de função).

source: In particular, :func:`ast.parse` won't do any scoping checks, which the compilation step does.
ast: Em particular, :func:`ast.parse` não fará nenhuma verificação de escopo, o que a etapa de compilação faz.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: É possível travar o interpretador Python com uma string suficientemente grande/complexa devido às limitações de profundidade da pilha no compilador de AST do Python.

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: Adicionado ``type_comments``, ``mode='func_type'`` e ``feature_version``.

source: The minimum supported version for ``feature_version`` is now ``(3, 7)``. The ``optimize`` argument was added.
ast: A versão mínima suportada para ``feature_version`` agora é ``(3, 7)``. O argumento ``optimize`` foi adicionado.
