Repository: python/python-docs-pt-br
Catalog: library/*.po
Languages: ast

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: Desfaz análise de um objeto :class:`ast.AST` e gera uma string com código que produziria um objeto :class:`ast.AST` equivalente se analisado novamente com :func:`ast.parse`.

source: The produced code string will not necessarily be equal to the original code that generated the :class:`ast.AST` object (without any compiler optimizations, such as constant tuples/frozensets).
ast: A string de código produzida não será necessariamente igual ao código original que gerou o objeto :class:`ast.AST` (sem quaisquer otimizações do compilador, como tuplas/frozensets constantes).

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: Tentar desfazer análise de uma expressão altamente complexa resultaria em :exc:`RecursionError`.

source: Evaluate an expression node or a string containing only a Python literal or container display. The string or node provided may only consist of the following Python literal structures: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, ``None`` and ``Ellipsis``.
ast: Avalia um nó de expressão ou uma string contendo apenas um literal Python ou uma exibição de contêiner. A string ou nó fornecido pode consistir apenas nas seguintes estruturas literais Python: strings, bytes, números, tuplas, listas, dicionários, conjuntos, booleanos, ``None`` e ``Ellipsis``.

source: This can be used for evaluating strings containing Python values without the need to parse the values oneself. It is not capable of evaluating arbitrarily complex expressions, for example involving operators or indexing.
ast: Isso pode ser usado para avaliar strings contendo valores Python sem a necessidade de analisar os valores por conta própria. Não é capaz de avaliar expressões arbitrariamente complexas, por exemplo, envolvendo operadores ou indexação.

source: This function had been documented as "safe" in the past without defining what that meant. That was misleading. This is specifically designed not to execute Python code, unlike the more general :func:`eval`. There is no namespace, no name lookups, or ability to call out. But it is not free from attack: A relatively small input can lead to memory exhaustion or to C stack exhaustion, crashing the process. There is also the possibility for excessive CPU consumption denial of service on some inputs. Calling it on untrusted data is thus not recommended.
ast: Esta função foi documentada como “segura” no passado sem definir o que isso significava. Isso foi enganoso. Isso foi projetado especificamente para não executar código Python, ao contrário do :func:`eval` mais geral. Não há espaço de nomes, pesquisas de nome ou capacidade de chamada. Mas não está livre de ataques: uma entrada relativamente pequena pode levar ao esgotamento da memória ou ao esgotamento da pilha C, travando o processo. Também existe a possibilidade de negação de serviço por consumo excessivo de CPU em algumas entradas. Portanto, não é recomendado chamá-la em dados não confiáveis.

source: It is possible to crash the Python interpreter due to stack depth limitations in Python's AST compiler.
ast: É possível travar o interpretador Python devido às limitações de profundidade da pilha no compilador AST do Python.

source: It can raise :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` and :exc:`RecursionError` depending on the malformed input.
ast: Pode levantar :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` e :exc:`RecursionError` dependendo da entrada malformada.

source: Now allows bytes and set literals.
ast: Agora permite bytes e literais de conjuntos.

source: Now supports creating empty sets with ``'set()'``.
ast: Agora oferece suporte à criação de conjuntos vazios com ``'set()'``.

source: For string inputs, leading spaces and tabs are now stripped.
ast: Para entradas de string, os espaços iniciais e tabulações agora são removidos.

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: Retorna a docstring do *node* dado (que deve ser um nó :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef` ou :class:`Module`) ou ``None`` se não tiver uma docstring. Se *clean* for verdadeiro, limpa o recuo da docstring com :func:`inspect.cleandoc`.

source: :class:`AsyncFunctionDef` is now supported.
ast: Não há suporte a :class:`AsyncFunctionDef`.

source: Get source code segment of the *source* that generated *node*. If some location information (:attr:`~ast.AST.lineno`, :attr:`~ast.AST.end_lineno`, :attr:`~ast.AST.col_offset`, or :attr:`~ast.AST.end_col_offset`) is missing, return ``None``.
ast: Obtém o segmento de código-fonte do *source* que gerou o *node*. Se alguma informação de localização (:attr:`~ast.AST.lineno`, :attr:`~ast.AST.end_lineno`, :attr:`~ast.AST.col_offset` ou :attr:`~ast.AST.end_col_offset`) está faltando, retorna ``None``.

source: If *padded* is ``True``, the first line of a multi-line statement will be padded with spaces to match its original position.
ast: Se *padded* for ``True``, a primeira linha de uma instrução multilinha será preenchida com espaços para corresponder à sua posição original.

source: When you compile a node tree with :func:`compile`, the compiler expects :attr:`~ast.AST.lineno` and :attr:`~ast.AST.col_offset` attributes for every node that supports them. This is rather tedious to fill in for generated nodes, so this helper adds these attributes recursively where not already set, by setting them to the values of the parent node. It works recursively starting at *node*.
ast: Quando você compila uma árvore de nós com :func:`compile`, o compilador espera atributos :attr:`~ast.AST.lineno` e :attr:`~ast.AST.col_offset` para cada nó que os suporta. Isso é tedioso para preencher nós gerados, portanto, esse auxiliar adiciona esses atributos recursivamente, onde ainda não estão definidos, definindo-os para os valores do nó pai. Ele funciona recursivamente a partir do *node*.

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: Incrementa o número da linhas e o número da linha final de cada nó na árvore começando em *node* em *n*. Isso é útil para "mover código" para um local diferente em um arquivo.

source: Copy source location (:attr:`~ast.AST.lineno`, :attr:`~ast.AST.col_offset`, :attr:`~ast.AST.end_lineno`, and :attr:`~ast.AST.end_col_offset`) from *old_node* to *new_node* if possible, and return *new_node*.
ast: Copia o local de origem (:attr:`~ast.AST.lineno`, :attr:`~ast.AST.col_offset`, :attr:`~ast.AST.end_lineno` e :attr:`~ast.AST.end_col_offset`) de *old_node* para *new_node* se possível e, então, retorna *new_node*.

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: Produz uma tupla de ``(fieldname, value)`` para cada campo em ``node._fields`` que esteja presente em *node*.

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: Produz todos os nós filhos diretos de *node*, ou seja, todos os campos que são nós e todos os itens de campos que são listas de nós.

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: Produz recursivamente todos os nós descendentes na árvore começando em *node* (incluindo o próprio *node*), em nenhuma ordem especificada. Isso é útil se você quiser apenas modificar nós no lugar e não se importar com o contexto.

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: Uma classe base de visitante de nó que percorre a árvore de sintaxe abstrata e chama uma função de visitante para cada nó encontrado. Esta função pode retornar um valor que é encaminhado pelo método :meth:`visit`.

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: Esta classe deve ser uma subclasse, com a subclasse adicionando métodos visitantes.

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: Visita um nó. A implementação padrão chama o método chamado :samp:`self.visit_{nomedaclasse}` sendo *nomedaclasse* o nome da classe do nó, ou :meth:`generic_visit` se aquele método não existir.

source: This visitor calls :meth:`visit` on all children of the node.
ast: Este visitante chama :meth:`visit` em todos os filhos do nó.

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: Observe que nós filhos de nós que possuem um método de visitante personalizado não serão visitados, a menos que o visitante chame :meth:`generic_visit` ou os visite por conta própria.

source: Handles all constant nodes.
ast: Manipula todos os nós constantes.

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: Não use o :class:`NodeVisitor` se você quiser aplicar mudanças nos nós durante a travessia. Para isso existe um visitante especial (:class:`NodeTransformer`) que permite modificações.

source: Methods :meth:`!visit_Num`, :meth:`!visit_Str`, :meth:`!visit_Bytes`, :meth:`!visit_NameConstant` and :meth:`!visit_Ellipsis` are deprecated now and will not be called in future Python versions. Add the :meth:`visit_Constant` method to handle all constant nodes.
ast: Os métodos :meth:`!visit_Num`, :meth:`!visit_Str`, :meth:`!visit_Bytes`, :meth:`!visit_NameConstant` e :meth:`!visit_Ellipsis` estão agora descontinuados e não serão chamados em futuras versões do Python. Adicione um método :meth:`visit_Constant` para lidar com nós de constantes.

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: A subclasse :class:`NodeVisitor` que percorre a árvore de sintaxe abstrata e permite a modificação de nós.

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: O :class:`NodeTransformer` percorrerá a AST e usará o valor de retorno dos métodos do visitante para substituir ou remover o nó antigo. Se o valor de retorno do método visitante for ``None``, o nó será removido de seu local, caso contrário, ele será substituído pelo valor de retorno. O valor de retorno pode ser o nó original, caso em que não há substituição.

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: Aqui está um exemplo de transformador que rescreve todas as ocorrências de procuras por nome (``foo``) para ``data['foo']``::

source: Keep in mind that if the node you're operating on has child nodes you must either transform the child nodes yourself or call the :meth:`~ast.NodeVisitor.generic_visit` method for the node first.
ast: Tenha em mente que, se o nó em que você está operando tiver nós filhos, você deve transformar os nós filhos por conta própria ou chamar o método :meth:`~ast.NodeVisitor.generic_visit` para o nó primeiro.

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: Para nós que faziam parte de uma coleção de instruções (que se aplica a todos os nós de instrução), o visitante também pode retornar uma lista de nós em vez de apenas um único nó.

source: If :class:`NodeTransformer` introduces new nodes (that weren't part of original tree) without giving them location information (such as :attr:`~ast.AST.lineno`), :func:`fix_missing_locations` should be called with the new sub-tree to recalculate the location information::
ast: Se :class:`NodeTransformer` introduz novos nós (que não faziam parte da árvore original) sem fornecer informações de localização (como :attr:`~ast.AST.lineno`), :func:`fix_missing_locations` deve ser chamado com o novo subárvore para recalcular as informações de localização::

source: Usually you use the transformer like this::
ast: Normalmente você usa o transformador assim::

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: Retorne um despejo formatado da árvore em *node*. Isso é útil principalmente para fins de depuração. Se *annotate_fields* for verdadeiro (por padrão), a sequência retornada mostrará os nomes e os valores para os campos. Se *annotate_fields* for falso, a sequência de resultados será mais compacta ao omitir nomes de campos não ambíguos. Atributos como números de linha e deslocamentos de coluna não são despejados por padrão. Se isso for desejado, *include_attributes* pode ser definido como verdadeiro.

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: Se *indent* for um inteiro não negativo ou uma string, então a árvore terá uma saída formatada com este nível de indentação. Um nível de indentação 0, negativo ou ``""`` apenas colocará novas linhas. ``None`` (o padrão) seleciona a representação de uma única linha. Usando um inteiro positivo a indentação terá alguns espaços por nível. Se *indent* for uma string (como ``"\t"``), essa string será usada para indentar cada nível.

source: If *show_empty* is ``False`` (the default), empty lists and fields that are ``None`` will be omitted from the output.
ast: Se *show_empty* for ``False`` (o padrão), listas vazias e campos que forem ``None`` serão omitidos da saída.

source: Added the *indent* option.
ast: Adicionada a opção *indent*.

source: Added the *show_empty* option.
ast: Adicionada a opção *show_empty*.

source: Compiler Flags
ast: Sinalizadores do compilador

source: The following flags may be passed to :func:`compile` in order to change effects on the compilation of a program:
ast: Os seguintes sinalizadores podem ser passados para :func:`compile` para alterar os efeitos na compilação de um programa:

source: Enables support for top-level ``await``, ``async for``, ``async with`` and async comprehensions.
ast: Habilita suporte para ``await``, ``async for``, ``async with`` e compreensões assíncronas de nível superior.

source: Generates and returns an abstract syntax tree instead of returning a compiled code object.
ast: Gera e retorna uma árvore de sintaxe abstrata em vez de retornar um objeto de código compilado.

source: The returned AST is optimized according to the *optimize* argument in :func:`compile` or :func:`ast.parse`.
ast: O AST retornado é otimizado de acordo com o argumento *optimize* em :func:`compile` ou :func:`ast.parse`.

source: Enables support for :pep:`484` and :pep:`526` style type comments (``# type: <type>``, ``# type: ignore <stuff>``).
ast: Habilita suporte para comentários do tipo :pep:`484` e :pep:`526` (``# type: <type>``, ``# type: ignore <stuff>``).

source: Command-Line Usage
ast: Uso na linha de comando

source: The :mod:`ast` module can be executed as a script from the command line. It is as simple as:
ast: O módulo :mod:`ast` pode ser executado como um script na linha de comando. É tão simples quanto:

source: The following options are accepted:
ast: As seguintes opções são aceitas:

source: Show the help message and exit.
ast: Mostra a mensagem de ajuda e sai.

source: Specify what kind of code must be compiled, like the *mode* argument in :func:`parse`.
ast: Especifica que tipo de código deve ser compilado, como o argumento *mode* em :func:`parse`.

source: Don't parse type comments.
ast: Não analisa comentários de tipo.

source: Include attributes such as line numbers and column offsets.
ast: Inclui atributos como números de linha e deslocamentos de colunas.

source: Indentation of nodes in AST (number of spaces).
ast: indentação de nós em AST (número de espaços).

source: If :file:`infile` is specified its contents are parsed to AST and dumped to stdout. Otherwise, the content is read from stdin.
ast: Se :file:`infile` for especificado, seu conteúdo será analisado no AST e despejado no stdout. Caso contrário, o conteúdo será lido em stdin.

source: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, an external documentation resource, has good details on working with Python ASTs.
ast: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, um recurso de documentação externo, possui bons detalhes sobre trabalhar com ASTs do Python.

source: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annotates Python ASTs with the positions of tokens and text in the source code that generated them. This is helpful for tools that make source code transformations.
ast: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ anota ASTs do Python com as posições de tokens e texto no código-fonte que as gerou. Isso é útil para ferramentas que fazem transformações de código-fonte.

source: `leoAst.py <https://leo-editor.github.io/leo-editor/appendices.html#leoast-py>`_ unifies the token-based and parse-tree-based views of python programs by inserting two-way links between tokens and ast nodes.
ast: `leoAst.py <https://leo-editor.github.io/leo-editor/appendices.html#leoast-py>`_ unifica as visualizações baseadas em token e em árvore de análise de programas python, inserindo links duas vias entre tokens e nós de ast.

source: `LibCST <https://libcst.readthedocs.io/>`_ parses code as a Concrete Syntax Tree that looks like an ast tree and keeps all formatting details. It's useful for building automated refactoring (codemod) applications and linters.
ast: `LibCST <https://libcst.readthedocs.io/>`_ analisa o código como uma árvore de sintaxe concreta que se parece com uma árvore ast e mantém todos os detalhes de formatação. É útil para construir linters e aplicações de refatoração automatizada (codemod).

source: `Parso <https://parso.readthedocs.io>`_ is a Python parser that supports error recovery and round-trip parsing for different Python versions (in multiple Python versions). Parso is also able to list multiple syntax errors in your Python file.
ast: `Parso <https://parso.readthedocs.io>`_ é um analisador Python que oferece suporte a recuperação de erros e análise de ida e volta para diferentes versões do Python (em várias versões do Python). Parso também é capaz de listar vários erros de sintaxe em seu arquivo Python.

source: ? (question mark)
ast: ? (interrogação)

source: in AST grammar
ast: em gramática de AST

source: * (asterisk)
ast: * (asterisco)
