Repository: python/python-docs-pt-br
Catalog: library/2to3.po
Languages: pt_br

source: Python 3.9 switched to a PEG parser (see :pep:`617`) while lib2to3 is using a less flexible LL(1) parser. Python 3.10 includes new language syntax that is not parsable by lib2to3's LL(1) parser (see :pep:`634`). The ``lib2to3`` module was marked pending for deprecation in Python 3.9 (raising :exc:`PendingDeprecationWarning` on import) and fully deprecated in Python 3.11 (raising :exc:`DeprecationWarning`). It will be removed from the standard library in Python 3.13. Consider third-party alternatives such as `LibCST`_ or `parso`_.
pt_br: Python 3.9 mudou para um analisador GASE (veja :pep:`617`) enquanto lib2to3 está usando um analisador LL(1) menos flexível. Python 3.10 inclui uma nova sintaxe de linguagem não analisável pelo analisador sintático LL(1) da lib2to3 (veja :pep:`634`). O módulo ``lib2to3`` foi marcado como pendente para descontinuação na versão Python 3.9 (levantando :exc:`PendingDeprecationWarning` na importação) e totalmente descontinuado na versão Python 3.11 (levantando :exc:`DeprecationWarning`). Ele será removido da biblioteca padrão na versão Python 3.13. Considere alternativas de terceiros como `LibCST`_ ou `parso`_.

source: The :mod:`lib2to3` API should be considered unstable and may change drastically in the future.
pt_br: A API do módulo :mod:`lib2to3` deve ser considerado instável e pode mudar drasticamente no futuro.
