Repository: python/python-docs-pt-br
Catalog: library/2to3.po
Languages: pt_br

source: 2to3 --- Automated Python 2 to 3 code translation
pt_br: 2to3 --- Tradução Automatizada de Código Python 2 para 3

source: 2to3 is a Python program that reads Python 2.x source code and applies a series of *fixers* to transform it into valid Python 3.x code. The standard library contains a rich set of fixers that will handle almost all code. 2to3 supporting library :mod:`lib2to3` is, however, a flexible and generic library, so it is possible to write your own fixers for 2to3.
pt_br: 2to3 é um programa Python que lê código-fonte Python 2.x e aplica uma série de *fixers* para transformá-lo em código válido para a versão do Python 3.x. A biblioteca padrão contém um conjunto rico de *fixers* que lidarão com quase todos os códigos. A biblioteca de suporte :mod:`lib2to3` é, no entanto, uma biblioteca genérica e flexível, por isso é possível escrever seus próprios fixadores para o 2to3.

source: The ``lib2to3`` module was marked pending for deprecation in Python 3.9 (raising :exc:`PendingDeprecationWarning` on import) and fully deprecated in Python 3.11 (raising :exc:`DeprecationWarning`). The ``2to3`` tool is part of that. It will be removed in Python 3.13.
pt_br: O módulo ``lib2to3`` foi marcado como pendente para descontinuação no Python 3.9 (levantando :exc:`PendingDeprecationWarning` na importação) e totalmente descontinuado no Python 3.11 (levantando :exc:`DeprecationWarning`). A ferramenta ``2to3`` faz parte disso. Ele será removido no Python 3.13.

source: Using 2to3
pt_br: Usando o 2to3

source: 2to3 will usually be installed with the Python interpreter as a script. It is also located in the :file:`Tools/scripts` directory of the Python root.
pt_br: O 2to3 geralmente será instalado junto com o interpretador Python como se fosse um script. Ele também está localizado no diretório :file:`Tools/scripts` na raiz da instalação do Python.

source: 2to3's basic arguments are a list of files or directories to transform. The directories are recursively traversed for Python sources.
pt_br: Os argumentos básicos de 2to3 são uma lista de arquivos ou diretórios a serem transformados. Os diretórios são recursivamente percorridos pelos fontes Python.

source: Here is a sample Python 2.x source file, :file:`example.py`::
pt_br: Aqui temos um exemplo de arquivo fonte Python 2.x, :file:`example.py`::

source: It can be converted to Python 3.x code via 2to3 on the command line:
pt_br: O mesmo pode ser convertido para código Python 3.x através de 2to3 através da linha de comando:

source: A diff against the original source file is printed. 2to3 can also write the needed modifications right back to the source file. (A backup of the original file is made unless :option:`!-n` is also given.) Writing the changes back is enabled with the :option:`!-w` flag:
pt_br: É impresso um diff contra o arquivo original. O 2to3 também pode escrever as modificações necessárias de volta ao arquivo de origem. (Um backup do arquivo original sempre será feito, salvo se a opção: :option:`!-n` for utilizada.) Escrever as alterações de volta está disponível com o uso do sinalizador :option:`!-w`:

source: After transformation, :file:`example.py` looks like this::
pt_br: Após a transformação, o arquivo :file:`example.py` se parecerá com isso::

source: Comments and exact indentation are preserved throughout the translation process.
pt_br: Os comentários e recuo exato são preservados ao longo do processo de tradução.

source: By default, 2to3 runs a set of :ref:`predefined fixers <2to3-fixers>`. The :option:`!-l` flag lists all available fixers. An explicit set of fixers to run can be given with :option:`!-f`. Likewise the :option:`!-x` explicitly disables a fixer. The following example runs only the ``imports`` and ``has_key`` fixers:
pt_br: Por padrão, 2to3 executa um conjunto de :ref:`fixadores predefinidos <2to3-fixers>`. O sinalizador :option:`!-l` lista todos os fixadores disponíveis. Um conjunto explícito de fixadores para execução pode ser fornecido com a opção: :option:`!-f`. Da mesma forma, a opção :option:`!-x` desabilita explicitamente um fixadores. O exemplo a seguir executa apenas os fixadores ``imports`` e ``has_key``:

source: This command runs every fixer except the ``apply`` fixer:
pt_br: Este comando executa todos os fixadores, exceto o fixadores ``apply``:

source: Some fixers are *explicit*, meaning they aren't run by default and must be listed on the command line to be run. Here, in addition to the default fixers, the ``idioms`` fixer is run:
pt_br: Alguns fixadores são *explícitos*, o que significa que eles não são executados por padrão e devem estar listados na linha de comando a para serem executados. Aqui, além dos fixadores padrão, o fixador ``idioms`` também será executado:

source: Notice how passing ``all`` enables all default fixers.
pt_br: Observe como a passagem de ``all`` permite todos os fixadores padrão.

source: Sometimes 2to3 will find a place in your source code that needs to be changed, but 2to3 cannot fix automatically. In this case, 2to3 will print a warning beneath the diff for a file. You should address the warning in order to have compliant 3.x code.
pt_br: Às vezes, 2to3 encontrará um lugar em seu código-fonte que precisa ser alterado, mas o 2to3 não pode corrigir automaticamente. Nesse caso, o 2to3 imprimirá um aviso abaixo do diff para um arquivo. Você deve endereçar o aviso para ter o código 3.x compatível.

source: 2to3 can also refactor doctests. To enable this mode, use the :option:`!-d` flag. Note that *only* doctests will be refactored. This also doesn't require the module to be valid Python. For example, doctest like examples in a reST document could also be refactored with this option.
pt_br: O 2to3 também pode refatorar o doctests. Para ativar este modo, use o sinalizador :option:`!-d`. Observe que os doctests *somente* serão refatorados. Isso também não exige que o módulo Python seja válido. Por exemplo, os exemplos doctest como em um documento reST também podem ser refatorados com esta opção.

source: The :option:`!-v` option enables output of more information on the translation process.
pt_br: A opção :option:`!-v` permite a saída de mais informações sobre o processo de tradução.

source: Since some print statements can be parsed as function calls or statements, 2to3 cannot always read files containing the print function. When 2to3 detects the presence of the ``from __future__ import print_function`` compiler directive, it modifies its internal grammar to interpret :func:`print` as a function. This change can also be enabled manually with the :option:`!-p` flag. Use :option:`!-p` to run fixers on code that already has had its print statements converted. Also :option:`!-e` can be used to make :func:`exec` a function.
pt_br: Uma vez que algumas instruções de impressão podem ser analisadas como chamadas de função ou instruções, 2to3 nem sempre pode ler arquivos que contêm a função de impressão. Quando 2to3 detecta a presença da diretiva de compilação ``from __future__ import print_function``, ele modifica sua gramática interna para interpretar funções :func:`print` como uma função. Esta alteração também pode ser ativada manualmente com o sinalizador :option:`!-p`. Use o sinalizador :option:`!-p` para executar fixadores no código que já tiveram suas instruções impressas convertidas. Além disso, :option:`!-e` pode ser usado para aplicar :func:`exec` em uma função.

source: The :option:`!-o` or :option:`!--output-dir` option allows specification of an alternate directory for processed output files to be written to. The :option:`!-n` flag is required when using this as backup files do not make sense when not overwriting the input files.
pt_br: A opção :option:`!-o` ou :option:`!--output-dir` permite especificar um diretório alternativo para a escrita dos arquivos de saída processados. O sinalizador :option:`!-n` é necessária ao usá-lo como arquivos de backup, não faz sentido quando não está sobrescrevendo os arquivos de entrada.

source: The :option:`!-o` option was added.
pt_br: A opção :option:`!-o` foi adicionada.

source: The :option:`!-W` or :option:`!--write-unchanged-files` flag tells 2to3 to always write output files even if no changes were required to the file. This is most useful with :option:`!-o` so that an entire Python source tree is copied with translation from one directory to another. This option implies the :option:`!-w` flag as it would not make sense otherwise.
pt_br: O sinalizador :option:`!-W` ou :option:`!--write-unchanged-files`diz ao 2to3 para sempre salvar arquivos de saída, mesmo que nenhuma alteração tenha sido necessária no arquivo. Isso é mais útil com: :option:`!-o`, de modo que uma árvore de código Python inteiro é copiada com a tradução de um diretório para outro. Esta opção implica o uso do sinalizador :option:`!-w`, pois não faria sentido de outro modo.

source: The :option:`!-W` flag was added.
pt_br: O sinalizador :option:`!-W` foi adicionado.

source: The :option:`!--add-suffix` option specifies a string to append to all output filenames. The :option:`!-n` flag is required when specifying this as backups are not necessary when writing to different filenames. Example:
pt_br: A opção :option:`!--add-suffix` determina a string que será adicionada a todos os nomes de arquivos. O sinalizador :option:`!-n` é necessário quando especificamos isso, pois os backups não são necessários quando escrevemos em nomes de arquivos diferentes. Por exemplo:

source: Will cause a converted file named ``example.py3`` to be written.
pt_br: Resultará num arquivo convertido de nome ``example.py3`` a ser escrito.

source: The :option:`!--add-suffix` option was added.
pt_br: A opção :option:`!--add-suffix` foi adicionada.

source: To translate an entire project from one directory tree to another use:
pt_br: Para traduzir um projeto inteiro de uma árvore de diretório para outra, use:

source: Fixers
pt_br: Fixadores

source: Each step of transforming code is encapsulated in a fixer. The command ``2to3 -l`` lists them. As :ref:`documented above <2to3-using>`, each can be turned on and off individually. They are described here in more detail.
pt_br: Cada passo de transformação do código é encapsulado em um fixador. O comando ``2to3 -l`` lista todos. Assim como :ref:`documentado acima<2to3-using>`, cada um pode ser ativado ou desativado individualmente. Eles são descritos aqui com mais detalhes.

source: Removes usage of :func:`apply`. For example ``apply(function, *args, **kwargs)`` is converted to ``function(*args, **kwargs)``.
pt_br: Remove o uso de :func:`apply`. Por exemplo ``apply(function, *args, **kwargs)`` é convertido para ``function(*args, **kwargs)``.

source: Replaces deprecated :mod:`unittest` method names with the correct ones.
pt_br: Substitui o nome de método descontinuado :mod:`unittest` pelo nome correto.

source: From
pt_br: De

source: To
pt_br: Para

source: Converts :class:`basestring` to :class:`str`.
pt_br: Converte a classe :class:`basestring` para a classe :class:`str`.

source: Converts :class:`buffer` to :class:`memoryview`. This fixer is optional because the :class:`memoryview` API is similar but not exactly the same as that of :class:`buffer`.
pt_br: Converte a classe :class:`buffer` para :class:`memoryview`. Este fixador é opcional porque a a API da classe :class:`memoryview` é semelhante, mas não exatamente a mesma que a da classe :class:`buffer`.

source: Fixes dictionary iteration methods. :meth:`dict.iteritems` is converted to :meth:`dict.items`, :meth:`dict.iterkeys` to :meth:`dict.keys`, and :meth:`dict.itervalues` to :meth:`dict.values`. Similarly, :meth:`dict.viewitems`, :meth:`dict.viewkeys` and :meth:`dict.viewvalues` are converted respectively to :meth:`dict.items`, :meth:`dict.keys` and :meth:`dict.values`. It also wraps existing usages of :meth:`dict.items`, :meth:`dict.keys`, and :meth:`dict.values` in a call to :class:`list`.
pt_br: Corrige os métodos de iteração de dicionário. :meth:`dict.iteritems` é convertido para :meth:`dict.items`, :meth:`dict.iterkeys` para :meth:`dict.keys`, e :meth:`dict.itervalues` para :meth:`dict.values`. Similarmente temos o método, :meth:`dict.viewitems`, :meth:`dict.viewkeys` e :meth:`dict.viewvalues` que são convertidos respectivamente para :meth:`dict.items`, :meth:`dict.keys` e :meth:`dict.values`. Também encapsula os usos existentes de :meth:`dict.items`, :meth:`dict.keys`, e :meth:`dict.values` em uma chamada para :class:`list`.

source: Converts ``except X, T`` to ``except X as T``.
pt_br: Converte ``except X, T`` para ``except X as T``.

source: Converts the ``exec`` statement to the :func:`exec` function.
pt_br: Converte a ``exec`` declaração para a função :func:`exec`.

source: Removes usage of :func:`execfile`. The argument to :func:`execfile` is wrapped in calls to :func:`open`, :func:`compile`, and :func:`exec`.
pt_br: Remove o uso da função :func:`execfile`. O argumento para :func:`execfile` é encapsulado pelas funções :func:`open`, :func:`compile`, e :func:`exec`.

source: Changes assignment of :attr:`sys.exitfunc` to use of the :mod:`atexit` module.
pt_br: Mudança de declaração de :attr:`sys.exitfunc` para usar o módulo :mod:`atexit`.

source: Wraps :func:`filter` usage in a :class:`list` call.
pt_br: Encapsula a função :func:`filter` usando uma chamada para a classe :class:`list`.

source: Fixes function attributes that have been renamed. For example, ``my_function.func_closure`` is converted to ``my_function.__closure__``.
pt_br: Corrige atributos de funções que foram renomeados. Por exemplo, ``my_function.func_closure`` é convertido para ``my_function.__closure__``.

source: Removes ``from __future__ import new_feature`` statements.
pt_br: Remove a declaração ``from __future__ import new_feature``.

source: Renames :func:`os.getcwdu` to :func:`os.getcwd`.
pt_br: Renomeia a função :func:`os.getcwdu` para :func:`os.getcwd`.

source: Changes ``dict.has_key(key)`` to ``key in dict``.
pt_br: Modifica ``dict.has_key(key)`` para ``key in dict``.

source: This optional fixer performs several transformations that make Python code more idiomatic. Type comparisons like ``type(x) is SomeClass`` and ``type(x) == SomeClass`` are converted to ``isinstance(x, SomeClass)``. ``while 1`` becomes ``while True``. This fixer also tries to make use of :func:`sorted` in appropriate places. For example, this block ::
pt_br: Este fixador opcional executa várias transformações que tornam o código Python mais idiomático. Comparações de tipo como ``type(x) is SomeClass`` e ``type(x) == SomeClass`` são convertidas para ``isinstance(x, SomeClass)``. ``while 1`` vira ``while True``. Este fixador também tenta usar :func:`sorted` nos lugares apropriados. Por exemplo, este bloco ::

source: is changed to ::
pt_br: é alterado para::

source: Detects sibling imports and converts them to relative imports.
pt_br: Detecta importações de irmãos e as converte em importações relativas.

source: Handles module renames in the standard library.
pt_br: Muda o nome do módulo na biblioteca padrão.

source: Handles other modules renames in the standard library. It is separate from the :2to3fixer:`imports` fixer only because of technical limitations.
pt_br: Lida com outras renomeações de módulos na biblioteca padrão. É separado do fixador :2to3fixer:`imports` apenas por causa de limitações técnicas.

source: Converts ``input(prompt)`` to ``eval(input(prompt))``.
pt_br: Converte ``input(prompt)`` para ``eval(input(prompt))``.

source: Converts :func:`intern` to :func:`sys.intern`.
pt_br: Converte a função :func:`intern` para :func:`sys.intern`.

source: Fixes duplicate types in the second argument of :func:`isinstance`. For example, ``isinstance(x, (int, int))`` is converted to ``isinstance(x, int)`` and ``isinstance(x, (int, float, int))`` is converted to ``isinstance(x, (int, float))``.
pt_br: Corrige tipos duplicados no segundo argumento de :func:`isinstance`. Por exemplo, ``isinstance(x, (int, int))`` é convertido para ``isinstance(x, int)`` e ``isinstance(x, (int, float, int))`` é convertido para ``isinstance(x, (int, float))``.

source: Removes imports of :func:`itertools.ifilter`, :func:`itertools.izip`, and :func:`itertools.imap`. Imports of :func:`itertools.ifilterfalse` are also changed to :func:`itertools.filterfalse`.
pt_br: Remove importações de :func:`itertools.ifilter`, :func:`itertools.izip`, e :func:`itertools.imap`. Importações de :func:`itertools.ifilterfalse` também são alteradas para :func:`itertools.filterfalse`.

source: Changes usage of :func:`itertools.ifilter`, :func:`itertools.izip`, and :func:`itertools.imap` to their built-in equivalents. :func:`itertools.ifilterfalse` is changed to :func:`itertools.filterfalse`.
pt_br: Altera o uso de :func:`itertools.ifilter`, :func:`itertools.izip`, e :func:`itertools.imap` para os seus equivalentes embutidos. :func:`itertools.ifilterfalse` é alterado para :func:`itertools.filterfalse`.

source: Renames :class:`long` to :class:`int`.
pt_br: Renomeia a classe :class:`long` para :class:`int`.

source: Wraps :func:`map` in a :class:`list` call. It also changes ``map(None, x)`` to ``list(x)``. Using ``from future_builtins import map`` disables this fixer.
pt_br: Encapsula a função :func:`map` numa chamada a classe :class:`list`. Isso também altera ``map(None, x)`` para ``list(x)``. Usando ``from future_builtins import map`` desabilitará esse fixador.

source: Converts the old metaclass syntax (``__metaclass__ = Meta`` in the class body) to the new (``class X(metaclass=Meta)``).
pt_br: Converte a sintaxe da metaclasse antiga (``__metaclass__ = Meta`` no corpo da classe) para o novo formato (``class X(metaclass=Meta)``).

source: Fixes old method attribute names. For example, ``meth.im_func`` is converted to ``meth.__func__``.
pt_br: Corrige nomes de atributos de métodos antigos. Por exemplo ``meth.im_func`` é convertido para ``meth.__func__``.

source: Converts the old not-equal syntax, ``<>``, to ``!=``.
pt_br: Converte a sintaxe antiga "diferente", ``<>``, para ``!=``.

source: Converts the use of iterator's :meth:`~iterator.next` methods to the :func:`next` function. It also renames :meth:`next` methods to :meth:`~iterator.__next__`.
pt_br: Converte o uso de métodos de iterador :meth:`~iterator.next` para a função :func:`next`. Também renomeia métodos :meth:`next` para :meth:`~iterator.__next__`.

source: Renames definitions of methods called :meth:`__nonzero__` to :meth:`~object.__bool__`.
pt_br: Renomeia as definições de métodos chamados :meth:`__nonzero__` para :meth:`~object.__bool__`.

source: Converts octal literals into the new syntax.
pt_br: Converte os literais octal para a nova sintaxe.

source: Converts calls to various functions in the :mod:`operator` module to other, but equivalent, function calls. When needed, the appropriate ``import`` statements are added, e.g. ``import collections.abc``. The following mapping are made:
pt_br: Converte chamadas para várias funções no módulo :mod:`operator` para chamadas de função diferentes, mas equivalentes. Quando necessário, são adicionadas as declarações ``import`` adequadas, por exemplo ``import collections.abc``. Os seguintes mapeamento são feitos:

source: Add extra parenthesis where they are required in list comprehensions. For example, ``[x for x in 1, 2]`` becomes ``[x for x in (1, 2)]``.
pt_br: Adiciona parênteses onde os mesmos não eram necessários em lista comprehensions. Por exemplo, ``[x for x in 1, 2]`` se torna ``[x for x in (1, 2)]``.

source: Converts the ``print`` statement to the :func:`print` function.
pt_br: Converte a declaração ``print`` para a função :func:`print`.

source: Converts ``raise E, V`` to ``raise E(V)``, and ``raise E, V, T`` to ``raise E(V).with_traceback(T)``. If ``E`` is a tuple, the translation will be incorrect because substituting tuples for exceptions has been removed in 3.0.
pt_br: Converte ``raise E, V`` para ``raise E(V)``, e ``raise E, V, T`` para ``raise E(V).with_traceback(T)``. Se ``E`` for uma tupla, a tradução ficará incorreta porque a substituição de tuplas por exceções foi removida no Python 3x.

source: Converts :func:`raw_input` to :func:`input`.
pt_br: Converte a função :func:`raw_input` para :func:`input`.

source: Handles the move of :func:`reduce` to :func:`functools.reduce`.
pt_br: Manipula o movimento de :func:`reduce` para :func:`functools.reduce`.

source: Converts :func:`reload` to :func:`importlib.reload`.
pt_br: Converte a função :func:`reload` para :func:`importlib:reload`.

source: Changes :data:`sys.maxint` to :data:`sys.maxsize`.
pt_br: Altera o :data:`sys.maxint` para :data:`sys.maxsize`.

source: Replaces backtick repr with the :func:`repr` function.
pt_br: Substitui o repr de backtick pela função :func:`repr`.

source: Replaces use of the :class:`set` constructor with set literals. This fixer is optional.
pt_br: Substitui o uso da classe :class:`set` construtor pelo seu literal. Este fixador é opcional.

source: Renames :exc:`StandardError` to :exc:`Exception`.
pt_br: Renomeia :exc:`StandardError` para :exc:`Exception`.

source: Changes the deprecated :data:`sys.exc_value`, :data:`sys.exc_type`, :data:`sys.exc_traceback` to use :func:`sys.exc_info`.
pt_br: Altera os descontinuados :data:`sys.exc_value`, :data:`sys.exc_type`, :data:`sys.exc_traceback` para utilizar agora a função :func:`sys.exc_info`.

source: Fixes the API change in generator's :meth:`throw` method.
pt_br: Corrige a mudança de API no método gerador :meth:`throw`.

source: Removes implicit tuple parameter unpacking. This fixer inserts temporary variables.
pt_br: Remove o desempacotamento implícito do parâmetro da tupla. Este fixador insere variáveis temporárias.

source: Fixes code broken from the removal of some members in the :mod:`types` module.
pt_br: Corrige o código quebrado pela remoção de alguns membros no módulo :mod:`types`.

source: Renames :class:`unicode` to :class:`str`.
pt_br: Renomeia a classe :class:`unicode` para :class:`str`.

source: Handles the rename of :mod:`urllib` and :mod:`urllib2` to the :mod:`urllib` package.
pt_br: Manipula a renomeação dos módulos :mod:`urllib` e :mod:`urllib2` para o pacote :mod:`urllib`.

source: Removes excess whitespace from comma separated items. This fixer is optional.
pt_br: Remove o espaço excessivo de itens separados por vírgulas. Este fixador é opcional.

source: Renames :func:`xrange` to :func:`range` and wraps existing :func:`range` calls with :class:`list`.
pt_br: Renomeia a função :func:`xrange` para :func:`range` e encapsula a chamada para função existente :func:`range` com :class:`list`.

source: Changes ``for x in file.xreadlines()`` to ``for x in file``.
pt_br: Altera de ``for x in file.xreadlines()`` para ``for x in file``.

source: Wraps :func:`zip` usage in a :class:`list` call. This is disabled when ``from future_builtins import zip`` appears.
pt_br: Encapsula o uso da função :func:`zip` na chamada a classe :class:`list`. Isso está desativado quando ``from future_builtins import zip`` aparecer.

source: :mod:`lib2to3` --- 2to3's library
pt_br: :mod:`lib2to3` --- biblioteca do 2to3

source: **Source code:** :source:`Lib/lib2to3/`
pt_br: **Código-fonte:** :source:`Lib/lib2to3/`
