Repository: python/python-docs-pt-br
Catalog: library/abc.po
Languages: pt_br

source: :mod:`!abc` --- Abstract Base Classes
pt_br: :mod:`!abc` --- Classes base abstratas

source: **Source code:** :source:`Lib/abc.py`
pt_br: **Código-fonte:** :source:`Lib/abc.py`

source: This module provides the infrastructure for defining :term:`abstract base classes <abstract base class>` (ABCs) in Python, as outlined in :pep:`3119`; see the PEP for why this was added to Python. (See also :pep:`3141` and the :mod:`numbers` module regarding a type hierarchy for numbers based on ABCs.)
pt_br: Este módulo fornece a infraestrutura para definir :term:`classes base abstratas <abstract base class>` (ABCs, do inglês *abstract base class*) em Python, como delineado em :pep:`3119`; veja o PEP para entender o porquê isto foi adicionado ao Python. (Veja também :pep:`3141` e o módulo :mod:`numbers` sobre uma hierarquia de tipo para números baseado nas ABCs.)

source: The :mod:`collections` module has some concrete classes that derive from ABCs; these can, of course, be further derived. In addition, the :mod:`collections.abc` submodule has some ABCs that can be used to test whether a class or instance provides a particular interface, for example, if it is :term:`hashable` or if it is a :term:`mapping`.
pt_br: O módulo :mod:`collections` tem algumas classes concretas que derivam de ABCs; essas podem, evidentemente, ser ainda mais derivadas. Além disso, o submódulo :mod:`collections.abc` tem algumas ABCs que podem ser usadas para testar se uma classe ou instância oferece uma interface particular, por exemplo, se é :term:`hasheável` ou se é um :term:`mapeamento`.

source: This module provides the metaclass :class:`ABCMeta` for defining ABCs and a helper class :class:`ABC` to alternatively define ABCs through inheritance:
pt_br: Este módulo fornece a metaclasse :class:`ABCMeta` para definir ABCs e uma classe auxiliar :class:`ABC` para alternativamente definir ABCs através de herança:

source: A helper class that has :class:`ABCMeta` as its metaclass. With this class, an abstract base class can be created by simply deriving from :class:`!ABC` avoiding sometimes confusing metaclass usage, for example::
pt_br: Uma classe auxiliar que tem :class:`ABCMeta` como sua metaclasse. Com essa classe, uma classe base abstrata pode ser criada simplesmente derivando da :class:`!ABC` evitando às vezes confundir o uso da metaclasse, por exemplo::

source: Note that the type of :class:`!ABC` is still :class:`ABCMeta`, therefore inheriting from :class:`!ABC` requires the usual precautions regarding metaclass usage, as multiple inheritance may lead to metaclass conflicts. One may also define an abstract base class by passing the metaclass keyword and using :class:`!ABCMeta` directly, for example::
pt_br: Note que o tipo da classe :class:`!ABC` ainda é :class:`ABCMeta`, portanto herdar da :class:`!ABC` requer as precauções usuais a respeito do uso da metaclasse, pois herança múltipla pode levar a conflitos de metaclasse. Pode-se também definir uma classe base abstrata ao passar a palavra reservada metaclasse e usar :class:`!ABCMeta` diretamente, por exemplo::

source: Metaclass for defining Abstract Base Classes (ABCs).
pt_br: Metaclasse para definir Classe Base Abstrata (ABCs).

source: Use this metaclass to create an ABC. An ABC can be subclassed directly, and then acts as a mix-in class. You can also register unrelated concrete classes (even built-in classes) and unrelated ABCs as "virtual subclasses" -- these and their descendants will be considered subclasses of the registering ABC by the built-in :func:`issubclass` function, but the registering ABC won't show up in their MRO (Method Resolution Order) nor will method implementations defined by the registering ABC be callable (not even via :func:`super`). [#]_
pt_br: Use esta metaclasse para criar uma ABC. Uma ABC pode ser diretamente estendida, e então agir como uma classe misturada. Você também pode registrar classes concretas não relacionadas (até mesmo classes embutidas) e ABCs não relacionadas como "subclasses virtuais" -- estas e suas descendentes serão consideradas subclasses da ABC de registro pela função embutida :func:`issubclass`, mas a ABC de registro não irá aparecer na MRO (Ordem de Resolução do Método) e nem as implementações do método definidas pela ABC de registro será chamável (nem mesmo via :func:`super`). [#]_

source: Classes created with a metaclass of :class:`!ABCMeta` have the following method:
pt_br: Classes criadas com a metaclasse de :class:`!ABCMeta` tem o seguinte método:

source: Register *subclass* as a "virtual subclass" of this ABC. For example::
pt_br: Registra *subclass* como uma "subclasse virtual" desta ABC. Por exemplo::

source: Returns the registered subclass, to allow usage as a class decorator.
pt_br: Retorna a subclasse registrada, para permitir o uso como um decorador de classe.

source: To detect calls to :meth:`!register`, you can use the :func:`get_cache_token` function.
pt_br: Para detectar chamadas para :meth:`!register`, você pode usar a função :func:`get_cache_token`.

source: You can also override this method in an abstract base class:
pt_br: Você também pode sobrepor este método em uma classe base abstrata:

source: (Must be defined as a class method.)
pt_br: (Deve obrigatoriamente ser definido como um método de classe.)

source: Check whether *subclass* is considered a subclass of this ABC. This means that you can customize the behavior of :func:`issubclass` further without the need to call :meth:`register` on every class you want to consider a subclass of the ABC. (This class method is called from the :meth:`~type.__subclasscheck__` method of the ABC.)
pt_br: Verifica se *subclass* é considerada uma subclasse desta ABC. Isto significa que você pode personalizar ainda mais o comportamento de :func:`issubclass` sem a necessidade de chamar :meth:`register` em toda classe que você queira considerar uma subclasse da ABC. (Este método de classe é chamado do método :meth:`~type.__subclasscheck__` da ABC.)

source: This method should return ``True``, ``False`` or :data:`NotImplemented`. If it returns ``True``, the *subclass* is considered a subclass of this ABC. If it returns ``False``, the *subclass* is not considered a subclass of this ABC, even if it would normally be one. If it returns :data:`!NotImplemented`, the subclass check is continued with the usual mechanism.
pt_br: Este método deve retornar ``True``, ``False`` ou :data:`NotImplemented`. Se retornar ``True``, *subclass* é considerada uma subclasse desta ABC. Se retornar ``False``, *subclass* não é considerada uma subclasse desta ABC, mesmo que normalmente seria uma. Se retornar :data:`!NotImplemented`, a verificação da subclasse é continuada com o mecanismo usual.

source: For a demonstration of these concepts, look at this example ABC definition::
pt_br: Para uma demonstração destes conceitos, veja este exemplo de definição ABC::

source: The ABC ``MyIterable`` defines the standard iterable method, :meth:`~iterator.__iter__`, as an abstract method. The implementation given here can still be called from subclasses. The :meth:`!get_iterator` method is also part of the ``MyIterable`` abstract base class, but it does not have to be overridden in non-abstract derived classes.
pt_br: A ``MyIterable`` da ABC define o método iterável padrão, :meth:`~iterator.__iter__`, como um método abstrato. A implementação dada aqui pode ainda ser chamada da subclasse. O método :meth:`!get_iterator` é também parte da classe base abstrata ``MyIterable`` , mas não precisa ser substituído nas classes derivadas não abstratas.

source: The :meth:`__subclasshook__` class method defined here says that any class that has an :meth:`~iterator.__iter__` method in its :attr:`~object.__dict__` (or in that of one of its base classes, accessed via the :attr:`~type.__mro__` list) is considered a ``MyIterable`` too.
pt_br: O método de classe :meth:`__subclasshook__` definido aqui diz que qualquer classe que tenha um método :meth:`~iterator.__iter__` em seu :attr:`~object.__dict__` (ou no de uma de suas classes base, acessados via lista :attr:`~type.__mro__`) é considerada uma ``MyIterable`` também.

source: Finally, the last line makes ``Foo`` a virtual subclass of ``MyIterable``, even though it does not define an :meth:`~iterator.__iter__` method (it uses the old-style iterable protocol, defined in terms of :meth:`~object.__len__` and :meth:`~object.__getitem__`). Note that this will not make ``get_iterator`` available as a method of ``Foo``, so it is provided separately.
pt_br: Finalmente, a última linha faz de ``Foo`` uma subclasse virtual da ``MyIterable``, apesar de não definir um método :meth:`~iterator.__iter__` (ela usa o protocolo iterável antigo, definido em termos de :meth:`~object.__len__` e :meth:`~object.__getitem__`). Note que isto não fará o ``get_iterator`` disponível como um método de ``Foo``, então ele é fornecido separadamente.

source: The :mod:`!abc` module also provides the following decorator:
pt_br: O módulo :mod:`!abc` também fornece o seguinte decorador:

source: A decorator indicating abstract methods.
pt_br: Um decorador indicando métodos abstratos.

source: Using this decorator requires that the class's metaclass is :class:`ABCMeta` or is derived from it. A class that has a metaclass derived from :class:`!ABCMeta` cannot be instantiated unless all of its abstract methods and properties are overridden. The abstract methods can be called using any of the normal 'super' call mechanisms. :func:`!abstractmethod` may be used to declare abstract methods for properties and descriptors.
pt_br: Usar este decorador requer que a metaclasse da classe seja :class:`ABCMeta` ou seja derivada desta. Uma classe que tem uma metaclasse derivada de :class:`!ABCMeta` não pode ser instanciada, a menos que todos os seus métodos abstratos e propriedades estejam substituídos. Os métodos abstratos podem ser chamados usando qualquer um dos mecanismos normais de chamadas a 'super'. :func:`!abstractmethod` pode ser usado para declarar métodos abstratos para propriedades e descritores.

source: Dynamically adding abstract methods to a class, or attempting to modify the abstraction status of a method or class once it is created, are only supported using the :func:`update_abstractmethods` function. The :func:`!abstractmethod` only affects subclasses derived using regular inheritance; "virtual subclasses" registered with the ABC's :meth:`~ABCMeta.register` method are not affected.
pt_br: Adicionar dinamicamente métodos abstratos a uma classe, ou tentar modificar o status de abstração de um método ou classe uma vez que estejam criados, só é suportado usando a função :func:`update_abstractmethods`. A :func:`!abstractmethod` afeta apenas subclasses derivadas usando herança regular; "subclasses virtuais" registradas com o método :meth:`~ABCMeta.register` da ABC não são afetadas.

source: When :func:`!abstractmethod` is applied in combination with other method descriptors, it should be applied as the innermost decorator, as shown in the following usage examples::
pt_br: Quando :func:`!abstractmethod` é aplicado em combinação com outros descritores de método, ele deve ser aplicado como o decorador mais interno, como mostrado nos seguintes exemplos de uso::

source: In order to correctly interoperate with the abstract base class machinery, the descriptor must identify itself as abstract using :attr:`!__isabstractmethod__`. In general, this attribute should be ``True`` if any of the methods used to compose the descriptor are abstract. For example, Python's built-in :class:`property` does the equivalent of::
pt_br: Para que interopere corretamente com o maquinário da classe base abstrata, o descritor precisa identificar-se como abstrato usando :attr:`!__isabstractmethod__`. No geral, este atributo deve ser ``True`` se algum dos métodos usados para compor o descritor for abstrato. Por exemplo, a :class:`property` embutida do Python faz o equivalente a::

source: Unlike Java abstract methods, these abstract methods may have an implementation. This implementation can be called via the :func:`super` mechanism from the class that overrides it. This could be useful as an end-point for a super-call in a framework that uses cooperative multiple-inheritance.
pt_br: Diferente de métodos abstratos Java, esses métodos abstratos podem ter uma implementação. Esta implementação pode ser chamada via mecanismo da :func:`super` da classe que a substitui. Isto pode ser útil como um ponto final para uma super chamada em um framework que usa herança múltipla cooperativa.

source: The :mod:`!abc` module also supports the following legacy decorators:
pt_br: O módulo :mod:`!abc` também suporta os seguintes decoradores herdados:

source: It is now possible to use :class:`classmethod` with :func:`abstractmethod`, making this decorator redundant.
pt_br: Agora é possível usar :class:`classmethod` com :func:`abstractmethod`, tornando redundante este decorador.

source: A subclass of the built-in :func:`classmethod`, indicating an abstract classmethod. Otherwise it is similar to :func:`abstractmethod`.
pt_br: Uma subclasse da :func:`classmethod` embutida, indicando um método de classe abstrato. Caso contrário, é similar à :func:`abstractmethod`.

source: This special case is deprecated, as the :func:`classmethod` decorator is now correctly identified as abstract when applied to an abstract method::
pt_br: Este caso especial está descontinuado, pois o decorador da :func:`classmethod` está agora corretamente identificado como abstrato quando aplicado a um método abstrato::

source: It is now possible to use :class:`staticmethod` with :func:`abstractmethod`, making this decorator redundant.
pt_br: Agora é possível usar :class:`staticmethod` com :func:`abstractmethod`, tornando redundante este decorador.

source: A subclass of the built-in :func:`staticmethod`, indicating an abstract staticmethod. Otherwise it is similar to :func:`abstractmethod`.
pt_br: Uma subclasse da :func:`staticmethod` embutida, indicando um método estático abstrato. Caso contrário, ela é similar à :func:`abstractmethod`.

source: This special case is deprecated, as the :func:`staticmethod` decorator is now correctly identified as abstract when applied to an abstract method::
pt_br: Este caso especial está descontinuado, pois o decorador da :func:`staticmethod` está agora corretamente identificado como abstrato quando aplicado a um método abstrato::

source: It is now possible to use :class:`property`, :meth:`property.getter`, :meth:`property.setter` and :meth:`property.deleter` with :func:`abstractmethod`, making this decorator redundant.
pt_br: Agora é possível usar :class:`property`, :meth:`property.getter`, :meth:`property.setter` e :meth:`property.deleter` com :func:`abstractmethod`, tornando redundante este decorador.

source: A subclass of the built-in :func:`property`, indicating an abstract property.
pt_br: Uma subclasse da :func:`property` embutida, indicando uma propriedade abstrata.

source: This special case is deprecated, as the :func:`property` decorator is now correctly identified as abstract when applied to an abstract method::
pt_br: Este caso especial está descontinuado, pois o decorador da :func:`property` está agora corretamente identificado como abstrato quando aplicado a um método abstrato::

source: The above example defines a read-only property; you can also define a read-write abstract property by appropriately marking one or more of the underlying methods as abstract::
pt_br: O exemplo acima define uma propriedade somente leitura; você também pode definir uma propriedade abstrata de leitura e escrita marcando apropriadamente um ou mais dos métodos subjacentes como abstratos::

source: If only some components are abstract, only those components need to be updated to create a concrete property in a subclass::
pt_br: Se apenas alguns componentes são abstratos, apenas estes componentes precisam ser atualizados para criar uma propriedade concreta em uma subclasse::

source: The :mod:`!abc` module also provides the following functions:
pt_br: O módulo :mod:`!abc` também fornece as seguintes funções:

source: Returns the current abstract base class cache token.
pt_br: Retorna o token de cache da classe base abstrata atual.

source: The token is an opaque object (that supports equality testing) identifying the current version of the abstract base class cache for virtual subclasses. The token changes with every call to :meth:`ABCMeta.register` on any ABC.
pt_br: O token é um objeto opaco (que suporta teste de igualdade) identificando a versão atual do cache da classe base abstrata para subclasses virtuais. O token muda a cada chamada ao :meth:`ABCMeta.register` em qualquer CBA.

source: A function to recalculate an abstract class's abstraction status. This function should be called if a class's abstract methods have been implemented or changed after it was created. Usually, this function should be called from within a class decorator.
pt_br: Uma função para recalcular o status de abstração de uma classe abstrata. Esta função deve ser chamada se os métodos abstratos de uma classe foram implementados ou alterados após sua criação. Normalmente, essa função deve ser chamada de dentro de um decorador de classe.

source: Returns *cls*, to allow usage as a class decorator.
pt_br: Retorna *cls*, para permitir o uso como decorador de classe.

source: If *cls* is not an instance of :class:`ABCMeta`, does nothing.
pt_br: Se *cls* não for uma instância de :class:`ABCMeta`, não faz nada.

source: This function assumes that *cls*'s superclasses are already updated. It does not update any subclasses.
pt_br: Esta função presume que as superclasses de *cls* já estão atualizadas. Ele não atualiza nenhuma subclasse.

source: Footnotes
pt_br: Notas de rodapé

source: C++ programmers should note that Python's virtual base class concept is not the same as C++'s.
pt_br: Programadores C++ devem notar que o conceito da classe base virtual do Python não é o mesmo que o de C++.
