Repository: python/python-docs-pt-br
Catalog: library/aifc.po
Languages: pt_br

source: :mod:`aifc` --- Read and write AIFF and AIFC files
pt_br: :mod:`aifc` --- Lê e escreve arquivos AIFF e AIFC

source: **Source code:** :source:`Lib/aifc.py`
pt_br: **Código-fonte:** :source:`Lib/aifc.py`

source: The :mod:`aifc` module is deprecated (see :pep:`PEP 594 <594#aifc>` for details).
pt_br: O módulo :mod:`aifc` foi descontinuado (veja :pep:`PEP 594 <594#aifc>` para mais detalhes).

source: This module provides support for reading and writing AIFF and AIFF-C files. AIFF is Audio Interchange File Format, a format for storing digital audio samples in a file. AIFF-C is a newer version of the format that includes the ability to compress the audio data.
pt_br: Este módulo fornece suporte para leitura e gravação de arquivos AIFF e AIFF-C. AIFF significa Audio Interchange File Format, um formato para armazenar amostras de áudio digital em um arquivo. AIFF-C é uma versão mais recente do formato que inclui a capacidade de compactar os dados de áudio.

source: Audio files have a number of parameters that describe the audio data. The sampling rate or frame rate is the number of times per second the sound is sampled. The number of channels indicate if the audio is mono, stereo, or quadro. Each frame consists of one sample per channel. The sample size is the size in bytes of each sample. Thus a frame consists of ``nchannels * samplesize`` bytes, and a second's worth of audio consists of ``nchannels * samplesize * framerate`` bytes.
pt_br: Arquivos de áudio têm vários parâmetros que descrevem os dados de áudio. A taxa de amostragem ou taxa de quadros é o número de vezes por segundo em que o som é amostrado. O número de canais indica se o áudio é mono, estéreo ou quadro. Cada quadro consiste em uma amostra por canal. O tamanho da amostra é o tamanho em bytes de cada amostra. Assim, um quadro consiste em ``nchannels * samplesize`` bytes e um segundo de áudio consiste em ``nchannels * samplesize * framerate`` bytes.

source: For example, CD quality audio has a sample size of two bytes (16 bits), uses two channels (stereo) and has a frame rate of 44,100 frames/second. This gives a frame size of 4 bytes (2\*2), and a second's worth occupies 2\*2\*44100 bytes (176,400 bytes).
pt_br: Por exemplo, o áudio com qualidade de CD tem um tamanho de amostra de dois bytes (16 bits), usa dois canais (estéreo) e tem uma taxa de quadros de 44.100 quadros/segundo. Isto dá um tamanho de quadro de 4 bytes (2\*2), e o valor de um segundo ocupa 2\*2\*44100 bytes (176.400 bytes).

source: Module :mod:`aifc` defines the following function:
pt_br: O módulo :mod:`aifc` define a seguinte função:

source: Open an AIFF or AIFF-C file and return an object instance with methods that are described below. The argument *file* is either a string naming a file or a :term:`file object`. *mode* must be ``'r'`` or ``'rb'`` when the file must be opened for reading, or ``'w'`` or ``'wb'`` when the file must be opened for writing. If omitted, ``file.mode`` is used if it exists, otherwise ``'rb'`` is used. When used for writing, the file object should be seekable, unless you know ahead of time how many samples you are going to write in total and use :meth:`writeframesraw` and :meth:`setnframes`. The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`~aifc.close` method is called.
pt_br: Abre um arquivo AIFF ou AIFF-C e retorna uma instância de objeto com os métodos descritos abaixo. O argumento *file* é uma string nomeando um arquivo ou um :term:`objeto arquivo <file object>`. *mode* deve ser ``'r'`` ou ``'rb'`` quando o arquivo deve ser aberto para leitura, ou ``'w'`` ou ``'wb'`` quando o arquivo deve ser aberto para escrita. Se omitido, ``file.mode`` é usado se existir, caso contrário ``'rb'`` é usado. Quando usado para escrita, o objeto arquivo deve ser pesquisável, a menos que você saiba com antecedência quantas amostras você irá escrever no total e usar :meth:`writeframesraw` e :meth:`setnframes`. A função :func:`.open` pode ser usada em um bloco de instrução :keyword:`with`. Quando o bloco :keyword:`!with` é concluído, o método :meth:`~aifc.close` é chamado.

source: Support for the :keyword:`with` statement was added.
pt_br: Suporte para a instrução :keyword:`with` foi adicionado.

source: Objects returned by :func:`.open` when a file is opened for reading have the following methods:
pt_br: Objetos retornados por :func:`.open` quando um arquivo é aberto para leitura têm os seguintes métodos:

source: Return the number of audio channels (1 for mono, 2 for stereo).
pt_br: Retorna o número de canais de áudio (1 para mono, 2 para estéreo).

source: Return the size in bytes of individual samples.
pt_br: Retorna o tamanho em bytes de amostras individuais.

source: Return the sampling rate (number of audio frames per second).
pt_br: Retorna a taxa de amostra (número de quadros de áudio por segundo).

source: Return the number of audio frames in the file.
pt_br: Retorna o número de quadros de áudio no arquivo.

source: Return a bytes array of length 4 describing the type of compression used in the audio file. For AIFF files, the returned value is ``b'NONE'``.
pt_br: Retorna um array de bytes de tamanho 4 descrevendo o tipo de compressão usada no arquivo de áudio. Para arquivos AIFF, o valor retornado é ``b'NONE'``.

source: Return a bytes array convertible to a human-readable description of the type of compression used in the audio file. For AIFF files, the returned value is ``b'not compressed'``.
pt_br: Retorna um array de bytes convertível para uma descrição legível por humanos do tipo de compactação usado no arquivo de áudio. Para arquivos AIFF, o valor retornado é ``b'not compressed'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
pt_br: Retorna uma :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalente à saída dos métodos :meth:`get\*`.

source: Return a list of markers in the audio file. A marker consists of a tuple of three elements. The first is the mark ID (an integer), the second is the mark position in frames from the beginning of the data (an integer), the third is the name of the mark (a string).
pt_br: Retorna uma lista de marcadores no arquivo de áudio. Um marcador consiste em uma tupla de três elementos. O primeiro é o ID da marca (um inteiro), o segundo é a posição da marca nos quadros desde o início dos dados (um inteiro), o terceiro é o nome da marca (uma string).

source: Return the tuple as described in :meth:`getmarkers` for the mark with the given *id*.
pt_br: Retorna a tupla como descrito em :meth:`getmarkers` para a marca com o *id* fornecido.

source: Read and return the next *nframes* frames from the audio file. The returned data is a string containing for each frame the uncompressed samples of all channels.
pt_br: Lê e retorna os próximos *nframes* quadros do arquivo de áudio. Os dados retornados são uma string contendo para cada quadro as amostras descompactadas de todos os canais.

source: Rewind the read pointer. The next :meth:`readframes` will start from the beginning.
pt_br: Reinicia o ponteiro de leitura. O próximo :meth:`readframes` começará do início.

source: Seek to the specified frame number.
pt_br: Procura o número do quadro especificado.

source: Return the current frame number.
pt_br: Retorna o número do quadro atual.

source: Close the AIFF file. After calling this method, the object can no longer be used.
pt_br: Fecha o arquivo AIFF. Depois de chamar esse método, o objeto não pode mais ser usado.

source: Objects returned by :func:`.open` when a file is opened for writing have all the above methods, except for :meth:`readframes` and :meth:`setpos`. In addition the following methods exist. The :meth:`get\*` methods can only be called after the corresponding :meth:`set\*` methods have been called. Before the first :meth:`writeframes` or :meth:`writeframesraw`, all parameters except for the number of frames must be filled in.
pt_br: Objetos retornados por :func:`.open` quando um arquivo é aberto para escrita possuem todos os métodos acima, exceto :meth:`readframes` e :meth:`setpos`. Além disso, os seguintes métodos existem. Os métodos :meth:`get\*` só podem ser chamados após os métodos :meth:`set\*` correspondentes terem sido chamados. Antes do primeiro :meth:`writeframes` ou :meth:`writeframesraw`, todos os parâmetros, exceto o número de quadros, devem ser preenchidos.

source: Create an AIFF file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
pt_br: Cria um arquivo AIFF. O padrão é que um arquivo AIFF-C seja criado, a menos que o nome do arquivo termine em ``'.aiff'``, caso em que o padrão é um arquivo AIFF.

source: Create an AIFF-C file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
pt_br: Cria um arquivo AIFF-C. O padrão é que um arquivo AIFF-C seja criado, a menos que o nome do arquivo termine em ``'.aiff'``, caso em que o padrão é um arquivo AIFF.

source: Specify the number of channels in the audio file.
pt_br: Especifica o número de canais no arquivo de áudio.

source: Specify the size in bytes of audio samples.
pt_br: Especifica o tamanho em bytes de amostras de áudio.

source: Specify the sampling frequency in frames per second.
pt_br: Especifica a frequência de amostragem em quadros por segundo.

source: Specify the number of frames that are to be written to the audio file. If this parameter is not set, or not set correctly, the file needs to support seeking.
pt_br: Especifica o número de quadros que devem ser escritos no arquivo de áudio. Se este parâmetro não estiver configurado ou estiver incorretamente configurado, o arquivo precisará ter suporte a procura.

source: Specify the compression type. If not specified, the audio data will not be compressed. In AIFF files, compression is not possible. The name parameter should be a human-readable description of the compression type as a bytes array, the type parameter should be a bytes array of length 4. Currently the following compression types are supported: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW'``, ``b'G722'``.
pt_br: Especifica o tipo de compactação. Se não for especificado, os dados de áudio não serão compactados. Em arquivos AIFF, a compactação não é possível. O parâmetro de nome deve ser uma descrição legível por humanos do tipo de compressão como uma array de bytes, o parâmetro de tipo deve ser uma array de bytes de tamanho 4. Atualmente, há suporte aos seguintes tipos de compactação: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW'``, ``b'G722'``.

source: Set all the above parameters at once. The argument is a tuple consisting of the various parameters. This means that it is possible to use the result of a :meth:`getparams` call as argument to :meth:`setparams`.
pt_br: Define todos os parâmetros acima de uma só vez. O argumento é uma tupla que consiste em vários parâmetros. Isto significa que é possível usar o resultado de uma chamada de :meth:`getparams` como argumento para :meth:`setparams`.

source: Add a mark with the given id (larger than 0), and the given name at the given position. This method can be called at any time before :meth:`close`.
pt_br: Adiciona uma marca com o ID fornecido (maior que 0) e o nome dado na posição determinada. Este método pode ser chamado a qualquer momento antes de :meth:`close`.

source: Return the current write position in the output file. Useful in combination with :meth:`setmark`.
pt_br: Retorna a posição atual de escrita no arquivo de saída. Útil em combinação com :meth:`setmark`.

source: Write data to the output file. This method can only be called after the audio file parameters have been set.
pt_br: Escreve dados no arquivo de saída. Este método só pode ser chamado após os parâmetros do arquivo de áudio terem sido definidos.

source: Any :term:`bytes-like object` is now accepted.
pt_br: Todo :term:`objeto bytes ou similar` agora é aceito.

source: Like :meth:`writeframes`, except that the header of the audio file is not updated.
pt_br: Semelhante a :meth:`writeframes`, exceto que o cabeçalho do arquivo de áudio não é atualizado.

source: Close the AIFF file. The header of the file is updated to reflect the actual size of the audio data. After calling this method, the object can no longer be used.
pt_br: Fecha o arquivo AIFF. O cabeçalho do arquivo é atualizado para refletir o tamanho real dos dados de áudio. Depois de chamar esse método, o objeto não pode mais ser usado.
