Repository: python/python-docs-pt-br
Catalog: library/annotationlib.po
Languages: pt_br

source: :meth:`typing.TypeVarTuple.evaluate_default`, the default value of type variable tuples
pt_br: :meth:`typing.TypeVarTuple.evaluate_default`, o valor padrão de tuplas de tipos variáveis

source: *owner* is the object that owns the evaluate function, such as the type alias or type variable object.
pt_br: *owner* é o objeto que possui a função de avaliação, como o apelido de tipo ou o objeto de tipo variável.

source: *format* can be used to control the format in which the value is returned:
pt_br: *format* pode ser usado para controlar o formato no qual o valor é retornado:

source: Retrieve the :term:`annotate function` from a class namespace dictionary *namespace*. Return :const:`!None` if the namespace does not contain an annotate function. This is primarily useful before the class has been fully created (e.g., in a metaclass); after the class exists, the annotate function can be retrieved with ``cls.__annotate__``. See :ref:`below <annotationlib-metaclass>` for an example using this function in a metaclass.
pt_br: Recupera a :term:`função de anotação` de um dicionário de espaço de nomes de classe *namespace*. Retorna :const:`!None` se o espaço de nomes não contiver uma função de anotação. Isso é útil principalmente antes da classe ser totalmente criada (por exemplo, em uma metaclasse); após a classe existir, a função de anotação pode ser recuperada com ``cls.__annotate__``. Veja :ref:`abaixo <annotationlib-metaclass>` para um exemplo usando esta função em uma metaclasse.

source: Compute the annotations dict for an object.
pt_br: Calcula o dicionário de anotações para um objeto.

source: *obj* may be a callable, class, module, or other object with :attr:`~object.__annotate__` or :attr:`~object.__annotations__` attributes. Passing any other object raises :exc:`TypeError`.
pt_br: *obj* pode ser um objeto chamável, classe, módulo ou outro objeto com os atributos :attr:`~object.__annotate__` ou :attr:`~object.__annotations__`. Passar qualquer outro objeto levanta :exc:`TypeError`.

source: The *format* parameter controls the format in which annotations are returned, and must be a member of the :class:`Format` enum or its integer equivalent. The different formats work as follows:
pt_br: O parâmetro *format* controla o formato em que as anotações são retornadas e deve ser um membro da enumeração :class:`Format` ou seu equivalente inteiro. Os diferentes formatos funcionam da seguinte forma:

source: VALUE: :attr:`!object.__annotations__` is tried first; if that does not exist, the :attr:`!object.__annotate__` function is called if it exists.
pt_br: VALUE: :attr:`!object.__annotations__` é tentado primeiro; se não existir, a função :attr:`!object.__annotate__` é chamada, se existir.

source: FORWARDREF: If :attr:`!object.__annotations__` exists and can be evaluated successfully, it is used; otherwise, the :attr:`!object.__annotate__` function is called. If it does not exist either, :attr:`!object.__annotations__` is tried again and any error from accessing it is re-raised.
pt_br: FORWARDREF: Se :attr:`!object.__annotations__` existir e puder ser avaliado com sucesso, ele será usado; caso contrário, a função :attr:`!object.__annotate__` será chamada. Se também não existir, :attr:`!object.__annotations__` será tentado novamente e qualquer erro ao acessá-lo será levantado novamente.

source: STRING: If :attr:`!object.__annotate__` exists, it is called first; otherwise, :attr:`!object.__annotations__` is used and stringified using :func:`annotations_to_string`.
pt_br: STRING: Se :attr:`!object.__annotate__` existir, ele será chamado primeiro; caso contrário, :attr:`!object.__annotations__` será usado e transformado em string usando :func:`annotations_to_string`.

source: Returns a dict. :func:`!get_annotations` returns a new dict every time it's called; calling it twice on the same object will return two different but equivalent dicts.
pt_br: Retorna um dict. :func:`!get_annotations` retorna um novo dict toda vez que é chamado; chamá-lo duas vezes no mesmo objeto retornará dois dicts diferentes, mas equivalentes.

source: This function handles several details for you:
pt_br: Esta função cuida de vários detalhes para você:

source: If *eval_str* is true, values of type :class:`!str` will be un-stringized using :func:`eval`. This is intended for use with stringized annotations (``from __future__ import annotations``). It is an error to set *eval_str* to true with formats other than :attr:`Format.VALUE`.
pt_br: Se *eval_str* for verdadeiro, valores do tipo :class:`!str` serão descodificados usando :func:`eval`. Isso se destina ao uso com anotações transformadas em string (``from __future__ import annotations``). É um erro definir *eval_str* como true com formatos diferentes de :attr:`Format.VALUE`.

source: If *obj* doesn't have an annotations dict, returns an empty dict. (Functions and methods always have an annotations dict; classes, modules, and other types of callables may not.)
pt_br: Se *obj* não tiver um dicionário de anotações, retorna um dicionário vazio. (Funções e métodos sempre têm um dicionário de anotações; classes, módulos e outros tipos de chamáveis podem não ter.)

source: Ignores inherited annotations on classes, as well as annotations on metaclasses. If a class doesn't have its own annotations dict, returns an empty dict.
pt_br: Ignora anotações herdadas em classes, bem como anotações em metaclasses. Se uma classe não tiver seu próprio dicionário de anotações, retorna um dicionário vazio.

source: All accesses to object members and dict values are done using ``getattr()`` and ``dict.get()`` for safety.
pt_br: Todos os acessos aos membros do objeto e valores do dicionário são feitos usando ``getattr()`` e ``dict.get()`` por segurança.

source: *eval_str* controls whether or not values of type :class:`!str` are replaced with the result of calling :func:`eval` on those values:
pt_br: *eval_str* controla se valores do tipo :class:`!str` são substituídos ou não pelo resultado da chamada de :func:`eval` nesses valores:

source: If eval_str is true, :func:`eval` is called on values of type :class:`!str`. (Note that :func:`!get_annotations` doesn't catch exceptions; if :func:`eval` raises an exception, it will unwind the stack past the :func:`!get_annotations` call.)
pt_br: Se eval_str for verdadeiro, :func:`eval` será chamado em valores do tipo :class:`!str`. (Observe que :func:`!get_annotations` não captura exceções; se :func:`eval` levanta uma exceção, ele desenrolará a pilha após a chamada de :func:`!get_annotations`.)

source: If *eval_str* is false (the default), values of type :class:`!str` are unchanged.
pt_br: Se *eval_str* for falso (o padrão), os valores do tipo :class:`!str` não serão alterados.

source: *globals* and *locals* are passed in to :func:`eval`; see the documentation for :func:`eval` for more information. If *globals* or *locals* is :const:`!None`, this function may replace that value with a context-specific default, contingent on ``type(obj)``:
pt_br: *globals* e *locals* são passados para :func:`eval`; consulte a documentação de :func:`eval` para mais informações. Se *globals* ou *locals* for :const:`!None`, esta função pode substituir esse valor por um padrão específico do contexto, dependendo de ``type(obj)``:

source: If *obj* is a module, *globals* defaults to ``obj.__dict__``.
pt_br: Se *obj* for um módulo, *globals* assume como padrão ``obj.__dict__``.

source: If *obj* is a class, *globals* defaults to ``sys.modules[obj.__module__].__dict__`` and *locals* defaults to the *obj* class namespace.
pt_br: Se *obj* for uma classe, *globals* assume como padrão ``sys.modules[obj.__module__].__dict__`` e *locals* assume como padrão o espaço de nomes da classe *obj*.

source: If *obj* is a callable, *globals* defaults to :attr:`obj.__globals__ <function.__globals__>`, although if *obj* is a wrapped function (using :func:`functools.update_wrapper`) or a :class:`functools.partial` object, it is unwrapped until a non-wrapped function is found.
pt_br: Se *obj* for um chamável, *globals* assume como padrão :attr:`obj.__globals__ <function.__globals__>`, embora se *obj* for uma função encapsulada (usando :func:`functools.update_wrapper`) ou um objeto :class:`functools.partial`, ela será desencapsulada até que uma função não encapsulada seja encontrada.

source: Calling :func:`!get_annotations` is best practice for accessing the annotations dict of any object. See :ref:`annotations-howto` for more information on annotations best practices.
pt_br: Chamar :func:`!get_annotations` é uma boa prática para acessar o dicionário de anotações de qualquer objeto. Consulte :ref:`annotations-howto` para obter mais informações sobre as práticas recomendadas para anotações.

source: Convert an arbitrary Python value to a format suitable for use by the :attr:`~Format.STRING` format. This calls :func:`repr` for most objects, but has special handling for some objects, such as type objects.
pt_br: Converte um valor Python arbitrário para um formato adequado para uso pelo formato :attr:`~Format.STRING`. Isso chama :func:`repr` para a maioria dos objetos, mas tem um tratamento especial para alguns objetos, como objetos tipo.

source: This is meant as a helper for user-provided annotate functions that support the :attr:`~Format.STRING` format but do not have access to the code creating the annotations. It can also be used to provide a user-friendly string representation for other objects that contain values that are commonly encountered in annotations.
pt_br: Isto serve como um auxiliar para funções de anotação fornecidas pelo usuário que oferecem suporte ao formato :attr:`~Format.STRING`, mas não têm acesso ao código que cria as anotações. Também pode ser usado para fornecer uma representação de string amigável para outros objetos que contêm valores comumente encontrados em anotações.

source: Recipes
pt_br: Receitas

source: Using annotations in a metaclass
pt_br: Usando anotações em uma metaclasse

source: A :ref:`metaclass <metaclasses>` may want to inspect or even modify the annotations in a class body during class creation. Doing so requires retrieving annotations from the class namespace dictionary. For classes created with ``from __future__ import annotations``, the annotations will be in the ``__annotations__`` key of the dictionary. For other classes with annotations, :func:`get_annotate_from_class_namespace` can be used to get the annotate function, and :func:`call_annotate_function` can be used to call it and retrieve the annotations. Using the :attr:`~Format.FORWARDREF` format will usually be best, because this allows the annotations to refer to names that cannot yet be resolved when the class is created.
pt_br: Uma :ref:`metaclasse <metaclasses>` pode querer inspecionar ou até mesmo modificar as anotações no corpo de uma classe durante a criação da classe. Isso requer a recuperação das anotações do dicionário de espaços de nomes da classe. Para classes criadas com ``from __future__ import annotations``, as anotações estarão na chave ``__annotations__`` do dicionário. Para outras classes com anotações, :func:`get_annotate_from_class_namespace` pode ser usado para obter a função annotate, e :func:`call_annotate_function` pode ser usado para chamá-la e recuperar as anotações. Usar o formato :attr:`~Format.FORWARDREF` geralmente é a melhor opção, pois permite que as anotações se refiram a nomes que ainda não podem ser resolvidos quando a classe é criada.

source: To modify the annotations, it is best to create a wrapper annotate function that calls the original annotate function, makes any necessary adjustments, and returns the result.
pt_br: Para modificar as anotações, é melhor criar uma função de anotação que chame a função de anotação original, faça os ajustes necessários e retorne o resultado.

source: Below is an example of a metaclass that filters out all :class:`typing.ClassVar` annotations from the class and puts them in a separate attribute:
pt_br: Abaixo está um exemplo de uma metaclasse que filtra todas as anotações :class:`typing.ClassVar` da classe e as coloca em um atributo separado:

source: import annotationlib import typing class ClassVarSeparator(type): def __new__(mcls, name, bases, ns): if "__annotations__" in ns: # from __future__ import annotations annotations = ns["__annotations__"] classvar_keys = { key for key, value in annotations.items() # Use string comparison for simplicity; a more robust solution # could use annotationlib.ForwardRef.evaluate if value.startswith("ClassVar") } classvars = {key: annotations[key] for key in classvar_keys} ns["__annotations__"] = { key: value for key, value in annotations.items() if key not in classvar_keys } wrapped_annotate = None elif annotate := annotationlib.get_annotate_from_class_namespace(ns): annotations = annotationlib.call_annotate_function( annotate, format=annotationlib.Format.FORWARDREF ) classvar_keys = { key for key, value in annotations.items() if typing.get_origin(value) is typing.ClassVar } classvars = {key: annotations[key] for key in classvar_keys} def wrapped_annotate(format): annos = annotationlib.call_annotate_function(annotate, format, owner=typ) return {key: value for key, value in annos.items() if key not in classvar_keys} else: # no annotations classvars = {} wrapped_annotate = None typ = super().__new__(mcls, name, bases, ns) if wrapped_annotate is not None: # Wrap the original __annotate__ with a wrapper that removes ClassVars typ.__annotate__ = wrapped_annotate typ.classvars = classvars # Store the ClassVars in a separate attribute return typ
pt_br: import annotationlib import typing class ClassVarSeparator(type): def __new__(mcls, name, bases, ns): if "__annotations__" in ns: # from __future__ import annotations annotations = ns["__annotations__"] classvar_keys = { key for key, value in annotations.items() # Use comparação de strings para simplificar; uma solução # mais robusta poderia usar annotationlib.ForwardRef.evaluate if value.startswith("ClassVar") } classvars = {key: annotations[key] for key in classvar_keys} ns["__annotations__"] = { key: value for key, value in annotations.items() if key not in classvar_keys } wrapped_annotate = None elif annotate := annotationlib.get_annotate_from_class_namespace(ns): annotations = annotationlib.call_annotate_function( annotate, format=annotationlib.Format.FORWARDREF ) classvar_keys = { key for key, value in annotations.items() if typing.get_origin(value) is typing.ClassVar } classvars = {key: annotations[key] for key in classvar_keys} def wrapped_annotate(format): annos = annotationlib.call_annotate_function(annotate, format, owner=typ) return {key: value for key, value in annos.items() if key not in classvar_keys} else: # nenhuma anotação classvars = {} wrapped_annotate = None typ = super().__new__(mcls, name, bases, ns) if wrapped_annotate is not None: # Encapsula o __annotate__ original com um invólucro que remove ClassVars typ.__annotate__ = wrapped_annotate typ.classvars = classvars # Armazena as ClassVars em um atributo separado return typ

source: Limitations of the ``STRING`` format
pt_br: Limitações do formato ``STRING``

source: The :attr:`~Format.STRING` format is meant to approximate the source code of the annotation, but the implementation strategy used means that it is not always possible to recover the exact source code.
pt_br: O formato :attr:`~Format.STRING` tem como objetivo aproximar o código-fonte da anotação, mas a estratégia de implementação usada significa que nem sempre é possível recuperar o código-fonte exato.

source: First, the stringifier of course cannot recover any information that is not present in the compiled code, including comments, whitespace, parenthesization, and operations that get simplified by the compiler.
pt_br: Primeiro, a transformação em string, é claro, não pode recuperar nenhuma informação que não esteja presente no código compilado, incluindo comentários, espaços em branco, parênteses e operações que são simplificadas pelo compilador.

source: Second, the stringifier can intercept almost all operations that involve names looked up in some scope, but it cannot intercept operations that operate fully on constants. As a corollary, this also means it is not safe to request the ``STRING`` format on untrusted code: Python is powerful enough that it is possible to achieve arbitrary code execution even with no access to any globals or builtins. For example:
pt_br: Em segundo lugar, a transformação em string pode interceptar quase todas as operações que envolvem nomes pesquisados em algum escopo, mas não pode interceptar operações que operem totalmente em constantes. Como corolário, isso também significa que não é seguro solicitar o formato ``STRING`` em código não confiável: Python é poderoso o suficiente para permitir a execução arbitrária de código mesmo sem acesso a nenhuma variável global ou embutida. Por exemplo:

source: This particular example works as of the time of writing, but it relies on implementation details and is not guaranteed to work in the future.
pt_br: Este exemplo específico funciona no momento em que este artigo foi escrito, mas depende de detalhes de implementação e não há garantia de que funcionará no futuro.

source: Among the different kinds of expressions that exist in Python, as represented by the :mod:`ast` module, some expressions are supported, meaning that the ``STRING`` format can generally recover the original source code; others are unsupported, meaning that they may result in incorrect output or an error.
pt_br: Entre os diferentes tipos de expressões que existem em Python, conforme representado pelo módulo :mod:`ast`, algumas expressões são suportadas, o que significa que o formato ``STRING`` geralmente pode recuperar o código-fonte original; outras não são suportadas, o que significa que podem resultar em saída incorreta ou erro.

source: The following are supported (sometimes with caveats):
pt_br: Os seguintes são aceitos (às vezes com ressalvas):

source: :class:`ast.Invert` (``~``), :class:`ast.UAdd` (``+``), and :class:`ast.USub` (``-``) are supported
pt_br: :class:`ast.Invert` (``~``), :class:`ast.UAdd` (``+``) e :class:`ast.USub` (``-``) são suportadas

source: :class:`ast.Not` (``not``) is not supported
pt_br: :class:`ast.Not` (``not``) não é suportada

source: :class:`ast.Dict` (except when using ``**`` unpacking)
pt_br: :class:`ast.Dict` (exceto ao usar desempacotamento ``**``)

source: :class:`ast.Eq` and :class:`ast.NotEq` are supported
pt_br: :class:`ast.Eq` e :class:`ast.NotEq` são suportadas

source: :class:`ast.Lt`, :class:`ast.LtE`, :class:`ast.Gt`, and :class:`ast.GtE` are supported, but the operand may be flipped
pt_br: :class:`ast.Lt`, :class:`ast.LtE`, :class:`ast.Gt` e :class:`ast.GtE` são suportadas, mas o operando pode ser invertido

source: :class:`ast.Is`, :class:`ast.IsNot`, :class:`ast.In`, and :class:`ast.NotIn` are not supported
pt_br: :class:`ast.Is`, :class:`ast.IsNot`, :class:`ast.In` e :class:`ast.NotIn` não são suportadas

source: :class:`ast.Call` (except when using ``**`` unpacking)
pt_br: :class:`ast.Call` (exceto ao usar desempacotamento ``**``)

source: :class:`ast.Constant` (though not the exact representation of the constant; for example, escape sequences in strings are lost; hexadecimal numbers are converted to decimal)
pt_br: :class:`ast.Constant` (embora não seja a representação exata da constante; por exemplo, sequências de escape em strings são perdidas; números hexadecimais são convertidos em decimais)

source: :class:`ast.Attribute` (assuming the value is not a constant)
pt_br: :class:`ast.Attribute` (presumindo que o valor não é uma constante)

source: :class:`ast.Subscript` (assuming the value is not a constant)
pt_br: :class:`ast.Subscript` (presumindo que o valor não é uma constante)

source: :class:`ast.Starred` (``*`` unpacking)
pt_br: :class:`ast.Starred` (desempacotamento ``*``)

source: The following are unsupported, but throw an informative error when encountered by the stringifier:
pt_br: Os seguintes não são suportados, mas geram um erro informativo quando encontrados pela transformação em string:

source: :class:`ast.FormattedValue` (f-strings; error is not detected if conversion specifiers like ``!r`` are used)
pt_br: :class:`ast.FormattedValue` (f-strings; o erro não é detectado se especificadores de conversões como ``!r`` forem usados)

source: The following are unsupported and result in incorrect output:
pt_br: Os seguintes itens não são suportados e resultam em saída incorreta:

source: :class:`ast.BoolOp` (``and`` and ``or``)
pt_br: :class:`ast.BoolOp` (``and`` e ``or``)

source: The following are disallowed in annotation scopes and therefore not relevant:
pt_br: Os seguintes itens não são permitidos em escopos de anotação e, portanto, não são relevantes:

source: Limitations of the ``FORWARDREF`` format
pt_br: Limitações do formato ``FORWARDREF``

source: The :attr:`~Format.FORWARDREF` format aims to produce real values as much as possible, with anything that cannot be resolved replaced with :class:`ForwardRef` objects. It is affected by broadly the same Limitations as the :attr:`~Format.STRING` format: annotations that perform operations on literals or that use unsupported expression types may raise exceptions when evaluated using the :attr:`~Format.FORWARDREF` format.
pt_br: O formato :attr:`~Format.FORWARDREF` visa produzir valores reais o máximo possível, com tudo o que não puder ser resolvido sendo substituído por objetos :class:`ForwardRef`. Ele é afetado, em linhas gerais, pelas mesmas limitações do formato :attr:`~Format.STRING`: anotações que realizam operações em literais ou que usam tipos de expressão não suportados podem levantar exceções quando avaliadas usando o formato :attr:`~Format.FORWARDREF`.

source: Below are a few examples of the behavior with unsupported expressions:
pt_br: Abaixo estão alguns exemplos do comportamento com expressões não suportadas:
