Repository: python/python-docs-pt-br
Catalog: library/annotationlib.po
Languages: pt_br

source: :mod:`!annotationlib` --- Functionality for introspecting annotations
pt_br: :mod:`!annotationlib` --- Funcionalidade para introspecção de anotações

source: **Source code:** :source:`Lib/annotationlib.py`
pt_br: **Código-fonte:** :source:`Lib/annotationlib.py`

source: The :mod:`!annotationlib` module provides tools for introspecting :term:`annotations <annotation>` on modules, classes, and functions.
pt_br: O módulo :mod:`!annotationlib` fornece ferramentas para introspecção de :term:`anotações <annotation>` em módulos, classes e funções.

source: Annotations are :ref:`lazily evaluated <lazy-evaluation>` and often contain forward references to objects that are not yet defined when the annotation is created. This module provides a set of low-level tools that can be used to retrieve annotations in a reliable way, even in the presence of forward references and other edge cases.
pt_br: As anotações são :ref:`avaliadas preguiçosamente <lazy-evaluation>` e frequentemente contêm referências futuras a objetos que ainda não foram definidos quando a anotação é criada. Este módulo fornece um conjunto de ferramentas de baixo nível que podem ser usadas para recuperar anotações de forma confiável, mesmo na presença de referências futuras e outros casos extremos.

source: This module supports retrieving annotations in three main formats (see :class:`Format`), each of which works best for different use cases:
pt_br: Este módulo oferece suporte a recuperação de anotações em três formatos principais (veja :class:`Format`), cada um dos quais funciona melhor para diferentes casos de uso:

source: :attr:`~Format.VALUE` evaluates the annotations and returns their value. This is most straightforward to work with, but it may raise errors, for example if the annotations contain references to undefined names.
pt_br: :attr:`~Format.VALUE` avalia as anotações e retorna seus valores. Isso é mais simples de usar, mas pode levantar erros, por exemplo, se as anotações contiverem referências a nomes indefinidos.

source: :attr:`~Format.FORWARDREF` returns :class:`ForwardRef` objects for annotations that cannot be resolved, allowing you to inspect the annotations without evaluating them. This is useful when you need to work with annotations that may contain unresolved forward references.
pt_br: :attr:`~Format.FORWARDREF` retorna objetos :class:`ForwardRef` para anotações que não podem ser resolvidas, permitindo que você inspecione as anotações sem avaliá-las. Isso é útil quando você precisa trabalhar com anotações que podem conter referências de encaminhamento não resolvidas.

source: :attr:`~Format.STRING` returns the annotations as a string, similar to how it would appear in the source file. This is useful for documentation generators that want to display annotations in a readable way.
pt_br: :attr:`~Format.STRING` retorna as anotações como uma string, semelhante a como apareceria no arquivo fonte. Isso é útil para geradores de documentação que desejam exibir anotações de forma legível.

source: The :func:`get_annotations` function is the main entry point for retrieving annotations. Given a function, class, or module, it returns an annotations dictionary in the requested format. This module also provides functionality for working directly with the :term:`annotate function` that is used to evaluate annotations, such as :func:`get_annotate_from_class_namespace` and :func:`call_annotate_function`, as well as the :func:`call_evaluate_function` function for working with :term:`evaluate functions <evaluate function>`.
pt_br: A função :func:`get_annotations` é o principal ponto de entrada para recuperar anotações. Dada uma função, classe ou módulo, ela retorna um dicionário de anotações no formato solicitado. Este módulo também fornece funcionalidade para trabalhar diretamente com a :term:`função de anotação`, usada para avaliar anotações, como :func:`get_annotate_from_class_namespace` e :func:`call_annotate_function`, bem como a função :func:`call_evaluate_function` para trabalhar com :term:`funções de avaliação <evaluate function>`.

source: :pep:`649` proposed the current model for how annotations work in Python.
pt_br: :pep:`649` propôs o modelo atual de como as anotações funcionam em Python.

source: :pep:`749` expanded on various aspects of :pep:`649` and introduced the :mod:`!annotationlib` module.
pt_br: :pep:`749` expandiu vários aspectos de :pep:`649` e introduziu o módulo :mod:`!annotationlib`.

source: :ref:`annotations-howto` provides best practices for working with annotations.
pt_br: :ref:`annotations-howto` fornece práticas recomendadas para trabalhar com anotações.

source: :pypi:`typing-extensions` provides a backport of :func:`get_annotations` that works on earlier versions of Python.
pt_br: :pypi:`typing-extensions` fornece um backport de :func:`get_annotations` que funciona em versões anteriores do Python.

source: Annotation semantics
pt_br: Semânticas de anotação

source: The way annotations are evaluated has changed over the history of Python 3, and currently still depends on a :ref:`future import <future>`. There have been execution models for annotations:
pt_br: A forma como as anotações são avaliadas mudou ao longo da história do Python 3 e atualmente ainda depende de uma :ref:`importação futura <future>`. Houve modelos de execução para anotações:

source: *Stock semantics* (default in Python 3.0 through 3.13; see :pep:`3107` and :pep:`526`): Annotations are evaluated eagerly, as they are encountered in the source code.
pt_br: *Semântica de estoque* (padrão no Python 3.0 a 3.13; veja :pep:`3107` e :pep:`526`): As anotações são avaliadas avidamente, à medida que são encontradas no código-fonte.

source: *Stringified annotations* (used with ``from __future__ import annotations`` in Python 3.7 and newer; see :pep:`563`): Annotations are stored as strings only.
pt_br: *Anotações em string* (usadas com ``from __future__ import annotations`` no Python 3.7 e versões mais recentes; veja :pep:`563`): As anotações são armazenadas apenas como strings.

source: *Deferred evaluation* (default in Python 3.14 and newer; see :pep:`649` and :pep:`749`): Annotations are evaluated lazily, only when they are accessed.
pt_br: *Avaliação adiada* (padrão no Python 3.14 e versões mais recentes; veja :pep:`649` e :pep:`749`): As anotações são avaliadas preguiçosamente, somente quando são acessadas.

source: As an example, consider the following program::
pt_br: Como exemplo, considere o seguinte programa::

source: This will behave as follows:
pt_br: Isso se comportará da seguinte maneira:

source: Under stock semantics (Python 3.13 and earlier), it will throw a :exc:`NameError` at the line where ``func`` is defined, because ``Cls`` is an undefined name at that point.
pt_br: De acordo com a semântica de estoque (Python 3.13 e versões anteriores), ele levantará uma :exc:`NameError` na linha onde ``func`` está definido, porque ``Cls`` é um nome indefinido naquele ponto.

source: Under stringified annotations (if ``from __future__ import annotations`` is used), it will print ``{'a': 'Cls', 'return': 'None'}``.
pt_br: Em anotações stringificadas (se ``from __future__ import annotations`` for usado), exibirá ``{'a': 'Cls', 'return': 'None'}``.

source: Under deferred evaluation (Python 3.14 and later), it will print ``{'a': <class 'Cls'>, 'return': None}``.
pt_br: Em avaliação adiada (Python 3.14 e posterior), exibiirá ``{'a': <class 'Cls'>, 'return': None}``.

source: Stock semantics were used when function annotations were first introduced in Python 3.0 (by :pep:`3107`) because this was the simplest, most obvious way to implement annotations. The same execution model was used when variable annotations were introduced in Python 3.6 (by :pep:`526`). However, stock semantics caused problems when using annotations as type hints, such as a need to refer to names that are not yet defined when the annotation is encountered. In addition, there were performance problems with executing annotations at module import time. Therefore, in Python 3.7, :pep:`563` introduced the ability to store annotations as strings using the ``from __future__ import annotations`` syntax. The plan at the time was to eventually make this behavior the default, but a problem appeared: stringified annotations are more difficult to process for those who introspect annotations at runtime. An alternative proposal, :pep:`649`, introduced the third execution model, deferred evaluation, and was implemented in Python 3.14. Stringified annotations are still used if ``from __future__ import annotations`` is present, but this behavior will eventually be removed.
pt_br: A semântica de estoque foi usada quando as anotações de função foram introduzidas pela primeira vez no Python 3.0 (por :pep:`3107`) porque esta era a maneira mais simples e óbvia de implementar anotações. O mesmo modelo de execução foi usado quando as anotações de variáveis foram introduzidas no Python 3.6 (por :pep:`526`). No entanto, a semântica de estoque causou problemas ao usar anotações como dicas de tipo, como a necessidade de se referir a nomes que ainda não estavam definidos quando a anotação era encontrada. Além disso, havia problemas de desempenho com a execução de anotações no momento da importação do módulo. Portanto, no Python 3.7, :pep:`563` introduziu a capacidade de armazenar anotações como strings usando a sintaxe ``from __future__ import annotations``. O plano na época era eventualmente tornar esse comportamento o padrão, mas um problema surgiu: anotações em string são mais difíceis de processar para aqueles que inspecionam anotações em tempo de execução. Uma proposta alternativa, :pep:`649`, introduziu o terceiro modelo de execução, avaliação adiada, e foi implementada no Python 3.14. Anotações em string ainda são usadas se ``from __future__ import annotations`` estiver presente, mas esse comportamento será eventualmente removido.

source: An :class:`~enum.IntEnum` describing the formats in which annotations can be returned. Members of the enum, or their equivalent integer values, can be passed to :func:`get_annotations` and other functions in this module, as well as to :attr:`~object.__annotate__` functions.
pt_br: Uma :class:`~enum.IntEnum` que descreve os formatos nos quais as anotações podem ser retornadas. Membros da enumeração, ou seus valores inteiros equivalentes, podem ser passados para :func:`get_annotations` e outras funções neste módulo, bem como para funções :attr:`~object.__annotate__`.

source: Values are the result of evaluating the annotation expressions.
pt_br: Os valores são o resultado da avaliação das expressões de anotação.

source: Special value used to signal that an annotate function is being evaluated in a special environment with fake globals. When passed this value, annotate functions should either return the same value as for the :attr:`Format.VALUE` format, or raise :exc:`NotImplementedError` to signal that they do not support execution in this environment. This format is only used internally and should not be passed to the functions in this module.
pt_br: Valor especial usado para sinalizar que uma função de anotação está sendo avaliada em um ambiente especial com variáveis globais falsas. Ao receber este valor, as funções de anotação devem retornar o mesmo valor do formato :attr:`Format.VALUE` ou levantar :exc:`NotImplementedError` para sinalizar que não suportam execução neste ambiente. Este formato é usado apenas internamente e não deve ser passado para as funções deste módulo.

source: Values are real annotation values (as per :attr:`Format.VALUE` format) for defined values, and :class:`ForwardRef` proxies for undefined values. Real objects may contain references to :class:`ForwardRef` proxy objects.
pt_br: Valores são valores de anotação reais (conforme o formato :attr:`Format.VALUE`) para valores definidos e proxies :class:`ForwardRef` para valores indefinidos. Objetos reais podem conter referências a objetos proxy :class:`ForwardRef`.

source: Values are the text string of the annotation as it appears in the source code, up to modifications including, but not restricted to, whitespace normalizations and constant values optimizations.
pt_br: Valores são a string de texto da anotação como ela aparece no código-fonte, até modificações, incluindo, mas não se limitando a, normalizações de espaços em branco e otimizações de valores constantes.

source: The exact values of these strings may change in future versions of Python.
pt_br: Os valores exatos dessas strings podem mudar em versões futuras do Python.

source: A proxy object for forward references in annotations.
pt_br: Um objeto proxy para referências futuras em anotações.

source: Instances of this class are returned when the :attr:`~Format.FORWARDREF` format is used and annotations contain a name that cannot be resolved. This can happen when a forward reference is used in an annotation, such as when a class is referenced before it is defined.
pt_br: Instâncias desta classe são retornadas quando o formato :attr:`~Format.FORWARDREF` é usado e as anotações contêm um nome que não pode ser resolvido. Isso pode acontecer quando uma referência de avanço é usada em uma anotação, como quando uma classe é referenciada antes de ser definida.

source: A string containing the code that was evaluated to produce the :class:`~ForwardRef`. The string may not be exactly equivalent to the original source.
pt_br: Uma string contendo o código que foi avaliado para produzir :class:`~ForwardRef`. A string pode não ser exatamente equivalente à fonte original.

source: Evaluate the forward reference, returning its value.
pt_br: Avalia a referência futura, retornando seu valor.

source: If the *format* argument is :attr:`~Format.VALUE` (the default), this method may throw an exception, such as :exc:`NameError`, if the forward reference refers to a name that cannot be resolved. The arguments to this method can be used to provide bindings for names that would otherwise be undefined. If the *format* argument is :attr:`~Format.FORWARDREF`, the method will never throw an exception, but may return a :class:`~ForwardRef` instance. For example, if the forward reference object contains the code ``list[undefined]``, where ``undefined`` is a name that is not defined, evaluating it with the :attr:`~Format.FORWARDREF` format will return ``list[ForwardRef('undefined')]``. If the *format* argument is :attr:`~Format.STRING`, the method will return :attr:`~ForwardRef.__forward_arg__`.
pt_br: Se o argumento *format* for :attr:`~Format.VALUE` (o padrão), este método poderá levantar uma exceção, como :exc:`NameError`, caso a referência futura se refira a um nome que não pode ser resolvido. Os argumentos deste método podem ser usados para fornecer ligações para nomes que, de outra forma, seriam indefinidos. Se o argumento *format* for :attr:`~Format.FORWARDREF`, o método nunca levantará uma exceção, mas poderá retornar uma instância de :class:`~ForwardRef`. Por exemplo, se o objeto de referência futura contiver o código ``list[undefined]``, onde ``undefined`` é um nome que não está definido, avaliá-lo com o formato :attr:`~Format.FORWARDREF` retornará ``list[ForwardRef('undefined')]``. Se o argumento *format* for :attr:`~Format.STRING`, o método retornará :attr:`~ForwardRef.__forward_arg__`.

source: The *owner* parameter provides the preferred mechanism for passing scope information to this method. The owner of a :class:`~ForwardRef` is the object that contains the annotation from which the :class:`~ForwardRef` derives, such as a module object, type object, or function object.
pt_br: O parâmetro *owner* fornece o mecanismo preferencial para passar informações de escopo para este método. O proprietário de uma :class:`~ForwardRef` é o objeto que contém a anotação da qual a :class:`~ForwardRef` deriva, como um objeto módulo, objeto tipo ou objeto função.

source: The *globals*, *locals*, and *type_params* parameters provide a more precise mechanism for influencing the names that are available when the :class:`~ForwardRef` is evaluated. *globals* and *locals* are passed to :func:`eval`, representing the global and local namespaces in which the name is evaluated. The *type_params* parameter is relevant for objects created using the native syntax for :ref:`generic classes <generic-classes>` and :ref:`functions <generic-functions>`. It is a tuple of :ref:`type parameters <type-params>` that are in scope while the forward reference is being evaluated. For example, if evaluating a :class:`~ForwardRef` retrieved from an annotation found in the class namespace of a generic class ``C``, *type_params* should be set to ``C.__type_params__``.
pt_br: Os parâmetros *globals*, *locals* e *type_params* fornecem um mecanismo mais preciso para influenciar os nomes disponíveis quando :class:`~ForwardRef` é avaliado. *globals* e *locals* são passados para :func:`eval`, representando os espaços de nomes global e local nos quais o nome é avaliado. O parâmetro *type_params* é relevante para objetos criados usando a sintaxe nativa para :ref:`classes genéricas <generic-classes>` e :ref:`funções <generic-functions>`. É uma tupla de :ref:`parâmetros de tipo <type-params>` que estão no escopo enquanto a referência futura está sendo avaliada. Por exemplo, ao avaliar um :class:`~ForwardRef` recuperado de uma anotação encontrada no espaço de nomes de classe de uma classe genérica ``C``, *type_params* deve ser definido como ``C.__type_params__``.

source: :class:`~ForwardRef` instances returned by :func:`get_annotations` retain references to information about the scope they originated from, so calling this method with no further arguments may be sufficient to evaluate such objects. :class:`~ForwardRef` instances created by other means may not have any information about their scope, so passing arguments to this method may be necessary to evaluate them successfully.
pt_br: Instâncias de :class:`~ForwardRef` retornadas por :func:`get_annotations` retêm referências a informações sobre o escopo de onde se originaram, portanto, chamar esse método sem argumentos adicionais pode ser suficiente para avaliar tais objetos. Instâncias de :class:`~ForwardRef` criadas por outros meios podem não ter nenhuma informação sobre seu escopo, portanto, passar argumentos para esse método pode ser necessário para avaliá-las com sucesso.

source: If no *owner*, *globals*, *locals*, or *type_params* are provided and the :class:`~ForwardRef` does not contain information about its origin, empty globals and locals dictionaries are used.
pt_br: Se nenhum entre *owner*, *globals*, *locals* ou *type_params* for fornecido e :class:`~ForwardRef` não contiver informações sobre sua origem, dicionários globals e locals vazios serão usados.

source: Functions
pt_br: Funções

source: Convert an annotations dict containing runtime values to a dict containing only strings. If the values are not already strings, they are converted using :func:`type_repr`. This is meant as a helper for user-provided annotate functions that support the :attr:`~Format.STRING` format but do not have access to the code creating the annotations.
pt_br: Converte um dicionário de anotações contendo valores de tempo de execução em um dicionário contendo apenas strings. Se os valores ainda não forem strings, eles serão convertidos usando :func:`type_repr`. Isso serve como um auxiliar para funções de anotação fornecidas pelo usuário que oferecem suporte ao formato :attr:`~Format.STRING`, mas não têm acesso ao código que cria as anotações.

source: For example, this is used to implement the :attr:`~Format.STRING` for :class:`typing.TypedDict` classes created through the functional syntax:
pt_br: Por exemplo, isso é usado para implementar o :attr:`~Format.STRING` para classes :class:`typing.TypedDict` criadas por meio da sintaxe funcional:

source: Call the :term:`annotate function` *annotate* with the given *format*, a member of the :class:`Format` enum, and return the annotations dictionary produced by the function.
pt_br: Chama a :term:`função de anotação` *annotate* com o *format* fornecido, um membro da enumeração :class:`Format` e retorne o dicionário de anotações produzido pela função.

source: This helper function is required because annotate functions generated by the compiler for functions, classes, and modules only support the :attr:`~Format.VALUE` format when called directly. To support other formats, this function calls the annotate function in a special environment that allows it to produce annotations in the other formats. This is a useful building block when implementing functionality that needs to partially evaluate annotations while a class is being constructed.
pt_br: Esta função auxiliar é necessária porque as funções de anotação geradas pelo compilador para funções, classes e módulos oferecem suporte a apenas o formato :attr:`~Format.VALUE` quando chamadas diretamente. Para oferecer suporte a outros formatos, esta função chama a função de anotação em um ambiente especial que permite a produção de anotações nos outros formatos. Este é um bloco de construção útil ao implementar funcionalidades que precisam avaliar anotações parcialmente enquanto uma classe está sendo construída.

source: *owner* is the object that owns the annotation function, usually a function, class, or module. If provided, it is used in the :attr:`~Format.FORWARDREF` format to produce a :class:`ForwardRef` object that carries more information.
pt_br: *owner* é o objeto que possui a função de anotação, geralmente uma função, classe ou módulo. Se fornecido, é usado no formato :attr:`~Format.FORWARDREF` para produzir um objeto :class:`ForwardRef` que contém mais informações.

source: :PEP:`PEP 649 <649#the-stringizer-and-the-fake-globals-environment>` contains an explanation of the implementation technique used by this function.
pt_br: :PEP:`PEP 649 <649#the-stringizer-and-the-fake-globals-environment>` contém uma explicação da técnica de implementação usada por esta função.

source: Call the :term:`evaluate function` *evaluate* with the given *format*, a member of the :class:`Format` enum, and return the value produced by the function. This is similar to :func:`call_annotate_function`, but the latter always returns a dictionary mapping strings to annotations, while this function returns a single value.
pt_br: Chama a :term:`função de avaliação` *evaluate* com o *format* fornecido, um membro da enumeração :class:`Format` e retorna o valor produzido pela função. Isso é semelhante a :func:`call_annotate_function`, mas esta última sempre retorna um dicionário que mapeia strings para anotações, enquanto esta função retorna um único valor.

source: This is intended for use with the evaluate functions generated for lazily evaluated elements related to type aliases and type parameters:
pt_br: Isso se destina ao uso com as funções de avaliação geradas para elementos avaliados preguiçosamente relacionados a apelidos de tipo e parâmetros de tipo:

source: :meth:`typing.TypeAliasType.evaluate_value`, the value of type aliases
pt_br: :meth:`typing.TypeAliasType.evaluate_value`, o valor dos apelidos de tipo

source: :meth:`typing.TypeVar.evaluate_bound`, the bound of type variables
pt_br: :meth:`typing.TypeVar.evaluate_bound`, a delimitação das variáveis de tipo

source: :meth:`typing.TypeVar.evaluate_constraints`, the constraints of type variables
pt_br: :meth:`typing.TypeVar.evaluate_constraints`, as restrições de tipos variáveis

source: :meth:`typing.TypeVar.evaluate_default`, the default value of type variables
pt_br: :meth:`typing.TypeVar.evaluate_default`, o valor padrão de tipos variáveis

source: :meth:`typing.ParamSpec.evaluate_default`, the default value of parameter specifications
pt_br: :meth:`typing.ParamSpec.evaluate_default`, o valor padrão de especificações de parâmetros
