Repository: python/python-docs-pt-br
Catalog: library/argparse.po
Languages: pt_br

source: This method takes a single argument *arg_line* which is a string read from the argument file. It returns a list of arguments parsed from this string. The method is called once per line read from the argument file, in order.
pt_br: Este método recebe um único argumento *arg_line* que é uma string lida do arquivo de argumentos. Ele retorna uma lista de argumentos analisados dessa string. O método é chamado uma vez por linha lida do arquivo de argumentos, em ordem.

source: A useful override of this method is one that treats each space-separated word as an argument. The following example demonstrates how to do this::
pt_br: Uma substituição útil desse método é aquela que trata cada palavra separada por espaços como um argumento. O exemplo a seguir demonstra como fazer isso::

source: Exiting methods
pt_br: Métodos de saída

source: This method terminates the program, exiting with the specified *status* and, if given, it prints a *message* to :data:`sys.stderr` before that. The user can override this method to handle these steps differently::
pt_br: Este método encerra o programa, saindo com o *status* especificado e, se fornecido, imprime uma *message* para :data:`sys.stderr` antes disso. O usuário pode sobrescrever este método para lidar com essas etapas de forma diferente::

source: This method prints a usage message, including the *message*, to :data:`sys.stderr` and terminates the program with a status code of 2.
pt_br: Este método imprime uma mensagem de uso, incluindo a *message*, em :data:`sys.stderr` e encerra o programa com um código de status 2.

source: Intermixed parsing
pt_br: Análise misturada

source: A number of Unix commands allow the user to intermix optional arguments with positional arguments. The :meth:`~ArgumentParser.parse_intermixed_args` and :meth:`~ArgumentParser.parse_known_intermixed_args` methods support this parsing style.
pt_br: Vários comandos Unix permitem que o usuário misture argumentos opcionais com argumentos posicionais. Os métodos :meth:`~ArgumentParser.parse_intermixed_args` e :meth:`~ArgumentParser.parse_known_intermixed_args` oferecem suporte a esse estilo de análise.

source: These parsers do not support all the :mod:`!argparse` features, and will raise exceptions if unsupported features are used. In particular, subparsers, and mutually exclusive groups that include both optionals and positionals are not supported.
pt_br: Esses analisadores não oferecem suporte a todos os recursos do :mod:`!argparse` e vão levantar exceções se recursos não suportados forem usados. Em particular, subanalisadores e grupos mutuamente exclusivos que incluem tanto opcionais quanto posicionais não são suportados.

source: The following example shows the difference between :meth:`~ArgumentParser.parse_known_args` and :meth:`~ArgumentParser.parse_intermixed_args`: the former returns ``['2', '3']`` as unparsed arguments, while the latter collects all the positionals into ``rest``. ::
pt_br: O exemplo a seguir mostra a diferença entre :meth:`~ArgumentParser.parse_known_args` e :meth:`~ArgumentParser.parse_intermixed_args`: o primeiro retorna ``['2', '3']`` como argumentos não analisados, enquanto o último coleta todos os posicionais em ``rest``. ::

source: :meth:`~ArgumentParser.parse_known_intermixed_args` returns a two item tuple containing the populated namespace and the list of remaining argument strings. :meth:`~ArgumentParser.parse_intermixed_args` raises an error if there are any remaining unparsed argument strings.
pt_br: :meth:`~ArgumentParser.parse_known_intermixed_args` retorna uma tupla de dois itens contendo o espaço de nomes preenchido e a lista de strings de argumentos restantes. :meth:`~ArgumentParser.parse_intermixed_args` levanta um erro se houver strings de argumentos não analisadas restantes.

source: Registering custom types or actions
pt_br: Registrando ações e tipos personalizados

source: Sometimes it's desirable to use a custom string in error messages to provide more user-friendly output. In these cases, :meth:`!register` can be used to register custom actions or types with a parser and allow you to reference the type by their registered name instead of their callable name.
pt_br: Às vezes, é desejável usar uma string personalizada em mensagens de erro para fornecer uma saída mais amigável ao usuário. Nesses casos, :meth:`!register` pode ser usado para registrar ações ou tipos personalizados com um analisador sintático e permitir que você faça referência ao tipo pelo nome registrado em vez do nome do chamável.

source: The :meth:`!register` method accepts three arguments - a *registry_name*, specifying the internal registry where the object will be stored (e.g., ``action``, ``type``), *value*, which is the key under which the object will be registered, and object, the callable to be registered.
pt_br: O método :meth:`!register` aceita três argumentos - um *registry_name*, especificando o registro interno onde o objeto será armazenado (por exemplo, ``action``, ``type``), *value*, que é a chave sob a qual o objeto será registrado, e object, o chamável a ser registrado.

source: The following example shows how to register a custom type with a parser::
pt_br: O exemplo a seguir mostra como registrar um tipo personalizado com um analisador:

source: Exceptions
pt_br: Exceções

source: An error from creating or using an argument (optional or positional).
pt_br: Um erro ao criar ou usar um argumento (opcional ou posicional).

source: The string value of this exception is the message, augmented with information about the argument that caused it.
pt_br: O valor da string dessa exceção é a mensagem, complementada com informações sobre o argumento que a causou.

source: Raised when something goes wrong converting a command line string to a type.
pt_br: Levantada quando algo dá errado ao converter uma string de linha de comando em um tipo.

source: Guides and Tutorials
pt_br: Guias e tutoriais

source: ? (question mark)
pt_br: ? (interrogação)

source: in argparse module
pt_br: no módulo argparse

source: * (asterisk)
pt_br: * (asterisco)

source: + (plus)
pt_br: + (mais)
