Repository: python/python-docs-pt-br
Catalog: library/argparse.po
Languages: pt_br

source: metavar_ - string presenting available subcommands in help; by default it is ``None`` and presents subcommands in form {cmd1, cmd2, ..}
pt_br: metavar_ - string que apresenta os subcomandos disponíveis na ajuda; por padrão é ``None`` e apresenta os subcomandos no formato {cmd1, cmd2, ..}

source: Some example usage::
pt_br: Alguns exemplos de uso::

source: >>> # create the top-level parser >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', action='store_true', help='foo help') >>> subparsers = parser.add_subparsers(help='subcommand help') >>> >>> # create the parser for the "a" command >>> parser_a = subparsers.add_parser('a', help='a help') >>> parser_a.add_argument('bar', type=int, help='bar help') >>> >>> # create the parser for the "b" command >>> parser_b = subparsers.add_parser('b', help='b help') >>> parser_b.add_argument('--baz', choices=('X', 'Y', 'Z'), help='baz help') >>> >>> # parse some argument lists >>> parser.parse_args(['a', '12']) Namespace(bar=12, foo=False) >>> parser.parse_args(['--foo', 'b', '--baz', 'Z']) Namespace(baz='Z', foo=True)
pt_br: >>> # cria o analisador de nível superior >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', action='store_true', help='foo help') >>> subparsers = parser.add_subparsers(help='subcommand help') >>> >>> # cria o analisador para o comando "a" >>> parser_a = subparsers.add_parser('a', help='a help') >>> parser_a.add_argument('bar', type=int, help='bar help') >>> >>> # cria o analisador para o comando "b" >>> parser_b = subparsers.add_parser('b', help='b help') >>> parser_b.add_argument('--baz', choices=('X', 'Y', 'Z'), help='baz help') >>> >>> # analisa algumas listas de argumentos >>> parser.parse_args(['a', '12']) Namespace(bar=12, foo=False) >>> parser.parse_args(['--foo', 'b', '--baz', 'Z']) Namespace(baz='Z', foo=True)

source: Note that the object returned by :meth:`parse_args` will only contain attributes for the main parser and the subparser that was selected by the command line (and not any other subparsers). So in the example above, when the ``a`` command is specified, only the ``foo`` and ``bar`` attributes are present, and when the ``b`` command is specified, only the ``foo`` and ``baz`` attributes are present.
pt_br: Note que o objeto retornado por :meth:`parse_args` conterá apenas atributos para o analisador principal e o subanalisador que foi selecionado pela linha de comando (e não quaisquer outros subanalisadores). Então, no exemplo acima, quando o comando ``a`` é especificado, apenas os atributos ``foo`` e ``bar`` estão presentes, e quando o comando ``b`` é especificado, apenas os atributos ``foo`` e ``baz`` estão presentes.

source: Similarly, when a help message is requested from a subparser, only the help for that particular parser will be printed. The help message will not include parent parser or sibling parser messages. (A help message for each subparser command, however, can be given by supplying the ``help=`` argument to :meth:`~_SubParsersAction.add_parser` as above.)
pt_br: Similarmente, quando uma mensagem de ajuda é solicitada de um subanalisador, somente a ajuda para aquele parser em particular será impressa. A mensagem de ajuda não incluirá mensagens do analisador sintático pai ou do analisador sintático irmão. (Uma mensagem de ajuda para cada comando do subanalisador, entretanto, pode ser dada fornecendo o argumento ``help=`` para :meth:`~_SubParsersAction.add_parser` como acima.)

source: The :meth:`add_subparsers` method also supports ``title`` and ``description`` keyword arguments. When either is present, the subparser's commands will appear in their own group in the help output. For example::
pt_br: O método :meth:`add_subparsers` também oferece suporte aos argumentos nomeados ``title`` e ``description``. Quando qualquer um deles estiver presente, os comandos do subanalisador aparecerão em seu próprio grupo na saída de ajuda. Por exemplo::

source: Furthermore, :meth:`~_SubParsersAction.add_parser` supports an additional *aliases* argument, which allows multiple strings to refer to the same subparser. This example, like ``svn``, aliases ``co`` as a shorthand for ``checkout``::
pt_br: Além disso, :meth:`~_SubParsersAction.add_parser` oferece suporte a um argumento *aliases* adicional, que permite que múltiplas strings se refiram ao mesmo subanalisador. Este exemplo, como ``svn``, alias ``co`` como uma abreviação para ``checkout``::

source: :meth:`~_SubParsersAction.add_parser` supports also an additional *deprecated* argument, which allows to deprecate the subparser.
pt_br: :meth:`~_SubParsersAction.add_parser` oferece suporte também um argumento adicional *deprecated*, que permite descontinuar o subanalisador.

source: One particularly effective way of handling subcommands is to combine the use of the :meth:`add_subparsers` method with calls to :meth:`set_defaults` so that each subparser knows which Python function it should execute. For example::
pt_br: Uma maneira particularmente eficaz de lidar com subcomandos é combinar o uso do método :meth:`add_subparsers` com chamadas para :meth:`set_defaults` para que cada subanalisador saiba qual função Python ele deve executar. Por exemplo::

source: >>> # subcommand functions >>> def foo(args): ... print(args.x * args.y) ... >>> def bar(args): ... print('((%s))' % args.z) ... >>> # create the top-level parser >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(required=True) >>> >>> # create the parser for the "foo" command >>> parser_foo = subparsers.add_parser('foo') >>> parser_foo.add_argument('-x', type=int, default=1) >>> parser_foo.add_argument('y', type=float) >>> parser_foo.set_defaults(func=foo) >>> >>> # create the parser for the "bar" command >>> parser_bar = subparsers.add_parser('bar') >>> parser_bar.add_argument('z') >>> parser_bar.set_defaults(func=bar) >>> >>> # parse the args and call whatever function was selected >>> args = parser.parse_args('foo 1 -x 2'.split()) >>> args.func(args) 2.0 >>> >>> # parse the args and call whatever function was selected >>> args = parser.parse_args('bar XYZYX'.split()) >>> args.func(args) ((XYZYX))
pt_br: >>> # funções do subanalisador functions >>> def foo(args): ... print(args.x * args.y) ... >>> def bar(args): ... print('((%s))' % args.z) ... >>> # cria o analisador de nível superior >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(required=True) >>> >>> # cria o analisador do comando "foo" >>> parser_foo = subparsers.add_parser('foo') >>> parser_foo.add_argument('-x', type=int, default=1) >>> parser_foo.add_argument('y', type=float) >>> parser_foo.set_defaults(func=foo) >>> >>> # cria o analisador do comando "foo" >>> parser_bar = subparsers.add_parser('bar') >>> parser_bar.add_argument('z') >>> parser_bar.set_defaults(func=bar) >>> >>> # analisa os argumentos e chama a função que for selecionada >>> args = parser.parse_args('foo 1 -x 2'.split()) >>> args.func(args) 2.0 >>> >>> # analisa os argumentos e chama a função que foi selecionada >>> args = parser.parse_args('bar XYZYX'.split()) >>> args.func(args) ((XYZYX))

source: This way, you can let :meth:`parse_args` do the job of calling the appropriate function after argument parsing is complete. Associating functions with actions like this is typically the easiest way to handle the different actions for each of your subparsers. However, if it is necessary to check the name of the subparser that was invoked, the ``dest`` keyword argument to the :meth:`add_subparsers` call will work::
pt_br: Dessa forma, você pode deixar :meth:`parse_args` fazer o trabalho de chamar a função apropriada após a análise sintática do argumento ser concluída. Associar funções com ações como essa é normalmente a maneira mais fácil de lidar com as diferentes ações para cada um dos seus subanalisadores. No entanto, se for necessário verificar o nome do subanalisador que foi invocado, o argumento nomeado ``dest`` para a chamada :meth:`add_subparsers` funcionará::

source: New *required* keyword-only parameter.
pt_br: Novo parâmetro somente-nomeado *required*.

source: Subparser's *prog* is no longer affected by a custom usage message in the main parser.
pt_br: O *prog* do subanalisador não é mais afetado por uma mensagem de uso personalizada no analisador principal.

source: FileType objects
pt_br: Objetos FileType

source: The :class:`FileType` factory creates objects that can be passed to the type argument of :meth:`ArgumentParser.add_argument`. Arguments that have :class:`FileType` objects as their type will open command-line arguments as files with the requested modes, buffer sizes, encodings and error handling (see the :func:`open` function for more details)::
pt_br: A fábrica :class:`FileType` cria objetos que podem ser passados para o argumento de tipo de :meth:`ArgumentParser.add_argument`. Argumentos que têm objetos :class:`FileType` como seu tipo abrirão argumentos de linha de comando como arquivos com os modos solicitados, tamanhos de buffer, codificações e tratamento de erros (veja a função :func:`open` para mais detalhes)::

source: FileType objects understand the pseudo-argument ``'-'`` and automatically convert this into :data:`sys.stdin` for readable :class:`FileType` objects and :data:`sys.stdout` for writable :class:`FileType` objects::
pt_br: Objetos FileType entendem o pseudoargumento ``'-'`` e o convertem automaticamente em :data:`sys.stdin` para objetos :class:`FileType` legíveis e :data:`sys.stdout` para objetos :class:`FileType` graváveis::

source: If one argument uses *FileType* and then a subsequent argument fails, an error is reported but the file is not automatically closed. This can also clobber the output files. In this case, it would be better to wait until after the parser has run and then use the :keyword:`with`-statement to manage the files.
pt_br: Se um argumento usar *FileType* e um argumento subsequente falhar, um erro será relatado, mas o arquivo não será fechado automaticamente. Isso também pode danificar os arquivos de saída. Neste caso, seria melhor esperar até que o analisador sintático tenha sido executado e então usar a instrução :keyword:`with` para gerenciar os arquivos.

source: Added the *encodings* and *errors* parameters.
pt_br: Adicionados os parâmetros *encodings* e *errors*.

source: Argument groups
pt_br: Grupos de argumentos

source: By default, :class:`ArgumentParser` groups command-line arguments into "positional arguments" and "options" when displaying help messages. When there is a better conceptual grouping of arguments than this default one, appropriate groups can be created using the :meth:`!add_argument_group` method::
pt_br: Por padrão, :class:`ArgumentParser` agrupa argumentos de linha de comando em "argumentos posicionais" e "opções" ao exibir mensagens de ajuda. Quando há um melhor agrupamento conceitual de argumentos do que este padrão, grupos apropriados podem ser criados usando o método :meth:`!add_argument_group`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group = parser.add_argument_group('group') >>> group.add_argument('--foo', help='foo help') >>> group.add_argument('bar', help='bar help') >>> parser.print_help() usage: PROG [--foo FOO] bar group: bar bar help --foo FOO foo help
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group = parser.add_argument_group('grupo') >>> group.add_argument('--foo', help='ajuda de foo') >>> group.add_argument('bar', help='ajuda de bar') >>> parser.print_help() usage: PROG [--foo FOO] bar grupo: bar ajuda de bar --foo FOO ajuda de foo

source: The :meth:`add_argument_group` method returns an argument group object which has an :meth:`~ArgumentParser.add_argument` method just like a regular :class:`ArgumentParser`. When an argument is added to the group, the parser treats it just like a normal argument, but displays the argument in a separate group for help messages. The :meth:`!add_argument_group` method accepts *title* and *description* arguments which can be used to customize this display::
pt_br: O método :meth:`add_argument_group` retorna um objeto de grupo de argumentos que tem um método :meth:`~ArgumentParser.add_argument` como um :class:`ArgumentParser` regular. Quando um argumento é adicionado ao grupo, o analisador o trata como um argumento normal, mas exibe o argumento em um grupo separado para mensagens de ajuda. O método :meth:`!add_argument_group` aceita argumentos *title* e *description* que podem ser usados para personalizar esta exibição::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group1 = parser.add_argument_group('group1', 'group1 description') >>> group1.add_argument('foo', help='foo help') >>> group2 = parser.add_argument_group('group2', 'group2 description') >>> group2.add_argument('--bar', help='bar help') >>> parser.print_help() usage: PROG [--bar BAR] foo group1: group1 description foo foo help group2: group2 description --bar BAR bar help
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group1 = parser.add_argument_group('grupo1', 'descrição do grupo1') >>> group1.add_argument('foo', help='ajuda de foo') >>> group2 = parser.add_argument_group('grupo2', 'descrição do grupo2') >>> group2.add_argument('--bar', help='ajuda de bar') >>> parser.print_help() usage: PROG [--bar BAR] foo grupo1: descrição de grupo1 foo ajuda de foo grupo2: descrição de grupo2 --bar BAR ajuda de bar

source: The optional, keyword-only parameters argument_default_ and conflict_handler_ allow for finer-grained control of the behavior of the argument group. These parameters have the same meaning as in the :class:`ArgumentParser` constructor, but apply specifically to the argument group rather than the entire parser.
pt_br: Os parâmetros opcionais somente-nomeados argument_default_ e conflict_handler_ permitem um controle mais refinado do comportamento do grupo de argumentos. Esses parâmetros têm o mesmo significado que no construtor :class:`ArgumentParser`, mas se aplicam especificamente ao grupo de argumentos em vez de ao analisador sintático inteiro.

source: Note that any arguments not in your user-defined groups will end up back in the usual "positional arguments" and "optional arguments" sections.
pt_br: Observe que quaisquer argumentos que não estejam nos grupos definidos pelo usuário retornarão às seções usuais de "argumentos posicionais" e "argumentos opcionais".

source: Calling :meth:`add_argument_group` on an argument group now raises an exception. This nesting was never supported, often failed to work correctly, and was unintentionally exposed through inheritance.
pt_br: Chamar :meth:`add_argument_group` em um grupo de argumentos agora levanta uma exceção. Esse aninhamento nunca foi suportado, frequentemente não funcionava corretamente e era exposto involuntariamente por meio de herança.

source: Passing prefix_chars_ to :meth:`add_argument_group` is now deprecated.
pt_br: Passar prefix_chars_ para :meth:`add_argument_group` agora está descontinuado.

source: Mutual exclusion
pt_br: Exclusão mútua

source: Create a mutually exclusive group. :mod:`!argparse` will make sure that only one of the arguments in the mutually exclusive group was present on the command line::
pt_br: Cria um grupo mutuamente exclusivo. :mod:`!argparse` garantirá que apenas um dos argumentos no grupo mutuamente exclusivo esteja presente na linha de comando::

source: The :meth:`add_mutually_exclusive_group` method also accepts a *required* argument, to indicate that at least one of the mutually exclusive arguments is required::
pt_br: O método :meth:`add_mutually_exclusive_group` também aceita um argumento *obrigatório*, para indicar que pelo menos um dos argumentos mutuamente exclusivos é necessário::

source: Note that currently mutually exclusive argument groups do not support the *title* and *description* arguments of :meth:`~ArgumentParser.add_argument_group`. However, a mutually exclusive group can be added to an argument group that has a title and description. For example::
pt_br: Observe que atualmente grupos de argumentos mutuamente exclusivos não oferecem suporte aos argumentos *title* e *description* de :meth:`~ArgumentParser.add_argument_group`. No entanto, um grupo mutuamente exclusivo pode ser adicionado a um grupo de argumentos que tenha um título e uma descrição. Por exemplo::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_argument_group('Group title', 'Group description') >>> exclusive_group = group.add_mutually_exclusive_group(required=True) >>> exclusive_group.add_argument('--foo', help='foo help') >>> exclusive_group.add_argument('--bar', help='bar help') >>> parser.print_help() usage: PROG [-h] (--foo FOO | --bar BAR) options: -h, --help show this help message and exit Group title: Group description --foo FOO foo help --bar BAR bar help
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_argument_group('Título do grupo', 'Descrição do grupo') >>> exclusive_group = group.add_mutually_exclusive_group(required=True) >>> exclusive_group.add_argument('--foo', help='ajuda de foo') >>> exclusive_group.add_argument('--bar', help='ajuda de bar') >>> parser.print_help() usage: PROG [-h] (--foo FOO | --bar BAR) options: -h, --help show this help message and exit Título do grupo: Descrição do grupo --foo FOO foo help --bar BAR bar help

source: Calling :meth:`add_argument_group` or :meth:`add_mutually_exclusive_group` on a mutually exclusive group now raises an exception. This nesting was never supported, often failed to work correctly, and was unintentionally exposed through inheritance.
pt_br: Chamar :meth:`add_argument_group` ou :meth:`add_mutually_exclusive_group` em um grupo mutuamente exclusivo agora levanta uma exceção. Esse aninhamento nunca foi suportado, frequentemente não funcionava corretamente e era exposto involuntariamente por meio de herança.

source: Parser defaults
pt_br: Padrões do analisador sintático

source: Most of the time, the attributes of the object returned by :meth:`parse_args` will be fully determined by inspecting the command-line arguments and the argument actions. :meth:`set_defaults` allows some additional attributes that are determined without any inspection of the command line to be added::
pt_br: Na maioria das vezes, os atributos do objeto retornado por :meth:`parse_args` serão totalmente determinados pela inspeção dos argumentos da linha de comando e das ações dos argumentos. :meth:`set_defaults` permite que alguns atributos adicionais que são determinados sem qualquer inspeção da linha de comando sejam adicionados::

source: Note that parser-level defaults always override argument-level defaults::
pt_br: Observe que os padrões no nível do analisador sempre substituem os padrões no nível do argumento:

source: Parser-level defaults can be particularly useful when working with multiple parsers. See the :meth:`~ArgumentParser.add_subparsers` method for an example of this type.
pt_br: Padrões de nível de analisador podem ser particularmente úteis ao trabalhar com vários analisadores. Veja o método :meth:`~ArgumentParser.add_subparsers` para um exemplo desse tipo.

source: Get the default value for a namespace attribute, as set by either :meth:`~ArgumentParser.add_argument` or by :meth:`~ArgumentParser.set_defaults`::
pt_br: Obtém o valor padrão para um atributo de espaço de nomes, conforme definido por :meth:`~ArgumentParser.add_argument` ou por :meth:`~ArgumentParser.set_defaults`::

source: Printing help
pt_br: Imprimindo a ajuda

source: In most typical applications, :meth:`~ArgumentParser.parse_args` will take care of formatting and printing any usage or error messages. However, several formatting methods are available:
pt_br: Na maioria das aplicações típicas, :meth:`~ArgumentParser.parse_args` cuidará da formatação e da impressão de quaisquer mensagens de uso ou erro. No entanto, vários métodos de formatação estão disponíveis:

source: Print a brief description of how the :class:`ArgumentParser` should be invoked on the command line. If *file* is ``None``, :data:`sys.stdout` is assumed.
pt_br: Imprime uma breve descrição de como o :class:`ArgumentParser` deve ser invocado na linha de comando. Se *file* for ``None``, :data:`sys.stdout` será presumido.

source: Print a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`. If *file* is ``None``, :data:`sys.stdout` is assumed.
pt_br: Imprime uma mensagem de ajuda, incluindo o uso do programa e informações sobre os argumentos registrados com o :class:`ArgumentParser`. Se *file* for ``None``, :data:`sys.stdout` será presumido.

source: There are also variants of these methods that simply return a string instead of printing it:
pt_br: Também há variantes desses métodos que simplesmente retornam uma string em vez de imprimi-la:

source: Return a string containing a brief description of how the :class:`ArgumentParser` should be invoked on the command line.
pt_br: Retorna uma string contendo uma breve descrição de como o :class:`ArgumentParser` deve ser invocado na linha de comando.

source: Return a string containing a help message, including the program usage and information about the arguments registered with the :class:`ArgumentParser`.
pt_br: Retorna uma string contendo uma mensagem de ajuda, incluindo o uso do programa e informações sobre os argumentos registrados com o :class:`ArgumentParser`.

source: Partial parsing
pt_br: Análise parcial

source: Sometimes a script only needs to handle a specific set of command-line arguments, leaving any unrecognized arguments for another script or program. In these cases, the :meth:`~ArgumentParser.parse_known_args` method can be useful.
pt_br: Às vezes, um script precisa manipular apenas um conjunto específico de argumentos de linha de comando, deixando quaisquer argumentos não reconhecidos para outro script ou programa. Nesses casos, o método :meth:`~ArgumentParser.parse_known_args` pode ser útil.

source: This method works similarly to :meth:`~ArgumentParser.parse_args`, but it does not raise an error for extra, unrecognized arguments. Instead, it parses the known arguments and returns a two item tuple that contains the populated namespace and the list of any unrecognized arguments.
pt_br: Este método funciona de forma semelhante a :meth:`~ArgumentParser.parse_args`, mas não levanta erro para argumentos extras não reconhecidos. Em vez disso, ele analisa os argumentos conhecidos e retorna uma tupla de dois itens que contém o espaço de nomes preenchido e a lista de quaisquer argumentos não reconhecidos.

source: :ref:`Prefix matching <prefix-matching>` rules apply to :meth:`~ArgumentParser.parse_known_args`. The parser may consume an option even if it's just a prefix of one of its known options, instead of leaving it in the remaining arguments list.
pt_br: As regras de :ref:`correspondência de prefixo <prefix-matching>` se aplicam a :meth:`~ArgumentParser.parse_known_args`. O analisador pode usar uma opção mesmo que seja apenas um prefixo de uma de suas opções conhecidas, em vez de deixá-la na lista de argumentos restantes.

source: Customizing file parsing
pt_br: Personalizando a análise de arquivos

source: Arguments that are read from a file (see the *fromfile_prefix_chars* keyword argument to the :class:`ArgumentParser` constructor) are read one argument per line. :meth:`convert_arg_line_to_args` can be overridden for fancier reading.
pt_br: Argumentos lidos de um arquivo (veja o argumento nomeado *fromfile_prefix_chars* para o construtor :class:`ArgumentParser`) são lidos com um argumento por linha. :meth:`convert_arg_line_to_args` pode ser substituído para uma leitura mais sofisticada.
