Repository: python/python-docs-pt-br
Catalog: library/argparse.po
Languages: pt_br

source: ``'version'`` - This expects a ``version=`` keyword argument in the :meth:`~ArgumentParser.add_argument` call, and prints version information and exits when invoked::
pt_br: ``'version'`` - Isso espera um argumento nomeado ``version=`` na chamada :meth:`~ArgumentParser.add_argument` e imprime informações de versão e sai quando invocado::

source: You may also specify an arbitrary action by passing an :class:`Action` subclass (e.g. :class:`BooleanOptionalAction`) or other object that implements the same interface. Only actions that consume command-line arguments (e.g. ``'store'``, ``'append'``, ``'extend'``, or custom actions with non-zero ``nargs``) can be used with positional arguments.
pt_br: Você também pode especificar uma ação arbitrária passando uma subclasse :class:`Action` (por exemplo, :class:`BooleanOptionalAction`) ou outro objeto que implemente a mesma interface. Somente ações que consomem argumentos de linha de comando (por exemplo, ``'store'``, ``'append'``, ``'extend'`` ou ações personalizadas com ``nargs`` diferentes de zero) podem ser usadas com argumentos posicionais.

source: The recommended way to create a custom action is to extend :class:`Action`, overriding the :meth:`!__call__` method and optionally the :meth:`!__init__` and :meth:`!format_usage` methods. You can also register custom actions using the :meth:`~ArgumentParser.register` method and reference them by their registered name.
pt_br: A maneira recomendada de criar uma ação personalizada é estender :class:`Action`, substituindo o método :meth:`!__call__` e opcionalmente os métodos :meth:`!__init__` e :meth:`!format_usage`. Você também pode registrar ações personalizadas usando o método :meth:`~ArgumentParser.register` e referenciá-las pelo nome registrado.

source: An example of a custom action::
pt_br: Um exemplo de uma ação personalizada::

source: For more details, see :class:`Action`.
pt_br: Para mais detalhes, veja :class:`Action`.

source: :class:`ArgumentParser` objects usually associate a single command-line argument with a single action to be taken. The ``nargs`` keyword argument associates a different number of command-line arguments with a single action. See also :ref:`specifying-ambiguous-arguments`. The supported values are:
pt_br: Os objetos :class:`ArgumentParser` geralmente associam um único argumento de linha de comando a uma única ação a ser executada. O argumento nomeado ``nargs`` associa um número diferente de argumentos de linha de comando com uma única ação. Veja também :ref:`specifying-ambiguous-arguments`. Os valores suportados são:

source: ``N`` (an integer). ``N`` arguments from the command line will be gathered together into a list. For example::
pt_br: ``N`` (um inteiro). Os argumentos ``N`` da linha de comando serão reunidos em uma lista. Por exemplo::

source: Note that ``nargs=1`` produces a list of one item. This is different from the default, in which the item is produced by itself.
pt_br: Observe que ``nargs=1`` produz uma lista de um item. Isso é diferente do padrão, em que o item é produzido sozinho.

source: ``'?'``. One argument will be consumed from the command line if possible, and produced as a single item. If no command-line argument is present, the value from default_ will be produced. Note that for optional arguments, there is an additional case - the option string is present but not followed by a command-line argument. In this case the value from const_ will be produced. Some examples to illustrate this::
pt_br: ``'?'``. Um argumento será consumido da linha de comando, se possível, e produzido como um único item. Se nenhum argumento de linha de comando estiver presente, o valor de default_ será produzido. Observe que, para argumentos opcionais, há um caso adicional - a string de opções está presente, mas não é seguida por um argumento de linha de comando. Neste caso o valor de const_ será produzido. Alguns exemplos para ilustrar isso::

source: One of the more common uses of ``nargs='?'`` is to allow optional input and output files::
pt_br: Um dos usos mais comuns de ``nargs='?'`` é permitir arquivos de entrada e saída opcionais::

source: ``'*'``. All command-line arguments present are gathered into a list. Note that it generally doesn't make much sense to have more than one positional argument with ``nargs='*'``, but multiple optional arguments with ``nargs='*'`` is possible. For example::
pt_br: ``'*'``. Todos os argumentos de linha de comando presentes são reunidos em uma lista. Note que geralmente não faz muito sentido ter mais de um argumento posicional com ``nargs='*'``, mas vários argumentos opcionais com ``nargs='*'`` são possíveis. Por exemplo::

source: ``'+'``. Just like ``'*'``, all command-line arguments present are gathered into a list. Additionally, an error message will be generated if there wasn't at least one command-line argument present. For example::
pt_br: ``'+'``. Assim como ``'*'``, todos os argumentos de linha de comando presentes são reunidos em uma lista. Além disso, uma mensagem de erro será gerada se não houver pelo menos um argumento de linha de comando presente. Por exemplo::

source: If the ``nargs`` keyword argument is not provided, the number of arguments consumed is determined by the action_. Generally this means a single command-line argument will be consumed and a single item (not a list) will be produced. Actions that do not consume command-line arguments (e.g. ``'store_const'``) set ``nargs=0``.
pt_br: Se o argumento nomeado ``nargs`` não for fornecido, o número de argumentos consumidos é determinado por action_. Geralmente, isso significa que um único argumento de linha de comando será usado e um único item (não uma lista) será produzido. Ações que não fazem uso de argumentos da linha de comando (por exemplo, ``'store_const'``) definem ``nargs=0``.

source: The ``const`` argument of :meth:`~ArgumentParser.add_argument` is used to hold constant values that are not read from the command line but are required for the various :class:`ArgumentParser` actions. The two most common uses of it are:
pt_br: O argumento ``const`` de :meth:`~ArgumentParser.add_argument` é usado para manter valores constantes que não são lidos da linha de comando, mas são necessários para as várias ações :class:`ArgumentParser`. Os dois usos mais comuns são:

source: When :meth:`~ArgumentParser.add_argument` is called with ``action='store_const'`` or ``action='append_const'``. These actions add the ``const`` value to one of the attributes of the object returned by :meth:`~ArgumentParser.parse_args`. See the action_ description for examples. If ``const`` is not provided to :meth:`~ArgumentParser.add_argument`, it will receive a default value of ``None``.
pt_br: Quando :meth:`~ArgumentParser.add_argument` é chamado com ``action='store_const'`` ou ``action='append_const'``. Essas ações adicionam o valor ``const`` a um dos atributos do objeto retornado por :meth:`~ArgumentParser.parse_args`. Consulte a descrição da action_ para obter exemplos. Se ``const`` não for fornecido :meth:`~ArgumentParser.add_argument`, será recebido um valor padrão de ``None``.

source: When :meth:`~ArgumentParser.add_argument` is called with option strings (like ``-f`` or ``--foo``) and ``nargs='?'``. This creates an optional argument that can be followed by zero or one command-line arguments. When parsing the command line, if the option string is encountered with no command-line argument following it, the value of ``const`` will be assumed to be ``None`` instead. See the nargs_ description for examples.
pt_br: Quando :meth:`~ArgumentParser.add_argument` é chamado com strings de opções (como ``-f`` ou ``--foo``) e ``nargs='?'``. Isso cria um argumento opcional que pode ser seguido por zero ou um argumento de linha de comando. Ao analisar a linha de comando, se a string de opções for encontrada sem nenhum argumento de linha de comando seguindo, o valor de ``const`` será presumido como sendo ``None``. Veja a descrição de nargs_ para exemplos.

source: ``const=None`` by default, including when ``action='append_const'`` or ``action='store_const'``.
pt_br: ``const=None`` por padrão, incluindo quando ``action='append_const'`` ou ``action='store_const'``.

source: All optional arguments and some positional arguments may be omitted at the command line. The ``default`` keyword argument of :meth:`~ArgumentParser.add_argument`, whose value defaults to ``None``, specifies what value should be used if the command-line argument is not present. For optional arguments, the ``default`` value is used when the option string was not present at the command line::
pt_br: Todos os argumentos opcionais e alguns argumentos posicionais podem ser omitidos na linha de comando. O argumento nomeado ``default`` de :meth:`~ArgumentParser.add_argument`, cujo valor padrão é ``None``, especifica qual valor deve ser usado se o argumento de linha de comando não estiver presente. Para argumentos opcionais, o valor ``default`` é usado quando a string de opção não estava presente na linha de comando::

source: If the target namespace already has an attribute set, the action *default* will not overwrite it::
pt_br: Se o espaço de nomes de destino já tiver um atributo definido, a ação *default* não o substituirá::

source: If the ``default`` value is a string, the parser parses the value as if it were a command-line argument. In particular, the parser applies any type_ conversion argument, if provided, before setting the attribute on the :class:`Namespace` return value. Otherwise, the parser uses the value as is::
pt_br: Se o valor ``default`` for uma string, o analisador analisa o valor como se fosse um argumento de linha de comando. Em particular, o analisador aplica qualquer argumento de conversão type_, se fornecido, antes de definir o atributo no valor de retorno :class:`Namespace`. Caso contrário, o analisador usa o valor como está::

source: For positional arguments with nargs_ equal to ``?`` or ``*``, the ``default`` value is used when no command-line argument was present::
pt_br: Para argumentos posicionais com nargs_ igual a ``?`` ou ``*``, o valor ``default`` é usado quando nenhum argumento de linha de comando estava presente::

source: For required_ arguments, the ``default`` value is ignored. For example, this applies to positional arguments with nargs_ values other than ``?`` or ``*``, or optional arguments marked as ``required=True``.
pt_br: Para argumentos obrigatórios, isto é, marcados com required_, o valor ``default`` é ignorado. Por exemplo, isso se aplica a argumentos posicionais com valores de nargs_ diferentes de ``?`` ou ``*``, ou argumentos opcionais marcados como ``required=True``.

source: Providing ``default=argparse.SUPPRESS`` causes no attribute to be added if the command-line argument was not present::
pt_br: Fornecer ``default=argparse.SUPPRESS`` faz com que nenhum atributo seja adicionado se o argumento da linha de comando não estiver presente::

source: By default, the parser reads command-line arguments in as simple strings. However, quite often the command-line string should instead be interpreted as another type, such as a :class:`float` or :class:`int`. The ``type`` keyword for :meth:`~ArgumentParser.add_argument` allows any necessary type-checking and type conversions to be performed.
pt_br: Por padrão, o analisador sintático lê argumentos de linha de comando como strings simples. No entanto, muitas vezes a string da linha de comando deve ser interpretada como outro tipo, como :class:`float` ou :class:`int`. O argumento nomeado ``type`` para :meth:`~ArgumentParser.add_argument` permite que qualquer verificação de tipo e conversões de tipo necessárias sejam realizadas.

source: If the type_ keyword is used with the default_ keyword, the type converter is only applied if the default is a string.
pt_br: Se o argumento nomeado type_ for usado com default_, o conversor de tipo só será aplicado se o padrão for uma string.

source: The argument to ``type`` can be a callable that accepts a single string or the name of a registered type (see :meth:`~ArgumentParser.register`) If the function raises :exc:`ArgumentTypeError`, :exc:`TypeError`, or :exc:`ValueError`, the exception is caught and a nicely formatted error message is displayed. Other exception types are not handled.
pt_br: O argumento para ``type`` pode ser um chamável que aceite uma única string ou o nome de um tipo registrado (veja :meth:`~ArgumentParser.register`). Se a função levantar :exc:`ArgumentTypeError`, :exc:`TypeError` ou :exc:`ValueError`, a exceção será capturada e uma mensagem de erro bem formatada será exibida. Nenhum outro tipo de exceção é tratado.

source: Common built-in types and functions can be used as type converters:
pt_br: Tipos e funções embutidas comuns podem ser usados como conversores de tipo:

source: User defined functions can be used as well:
pt_br: Funções definidas pelo usuário também podem ser usadas:

source: >>> def hyphenated(string): ... return '-'.join([word[:4] for word in string.casefold().split()]) ... >>> parser = argparse.ArgumentParser() >>> _ = parser.add_argument('short_title', type=hyphenated) >>> parser.parse_args(['"The Tale of Two Cities"']) Namespace(short_title='"the-tale-of-two-citi')
pt_br: >>> def hyphenated(string): ... return '-'.join([word[:4] for word in string.casefold().split()]) ... >>> parser = argparse.ArgumentParser() >>> _ = parser.add_argument('short_title', type=hyphenated) >>> parser.parse_args(['"Um conto de duas cidades"']) Namespace(short_title='"um-cont-de-duas-cida')

source: The :func:`bool` function is not recommended as a type converter. All it does is convert empty strings to ``False`` and non-empty strings to ``True``. This is usually not what is desired.
pt_br: A função :func:`bool` não é recomendada como conversor de tipo. Tudo o que ele faz é converter strings vazias em ``False`` e strings não vazias em ``True``. Geralmente não é isso que se deseja.

source: In general, the ``type`` keyword is a convenience that should only be used for simple conversions that can only raise one of the three supported exceptions. Anything with more interesting error-handling or resource management should be done downstream after the arguments are parsed.
pt_br: Em geral, o argumento nomeado ``type`` é uma conveniência que só deve ser usada para conversões simples que só podem gerar uma das três exceções suportadas. Qualquer coisa com tratamento de erros ou gerenciamento de recursos mais interessante deve ser feita posteriormente, após a análise dos argumentos.

source: For example, JSON or YAML conversions have complex error cases that require better reporting than can be given by the ``type`` keyword. A :exc:`~json.JSONDecodeError` would not be well formatted and a :exc:`FileNotFoundError` exception would not be handled at all.
pt_br: Por exemplo, conversões JSON ou YAML têm casos de erros complexos que exigem relatórios melhores do que os fornecidos pelo argumento nomeado ``type``. Um :exc:`~json.JSONDecodeError` não seria bem formatado e uma exceção :exc:`FileNotFoundError` não seria tratada.

source: Even :class:`~argparse.FileType` has its limitations for use with the ``type`` keyword. If one argument uses :class:`~argparse.FileType` and then a subsequent argument fails, an error is reported but the file is not automatically closed. In this case, it would be better to wait until after the parser has run and then use the :keyword:`with`-statement to manage the files.
pt_br: Mesmo :class:`~argparse.FileType` tem suas limitações para uso com o argumento nomeado ``type``. Se um argumento usar :class:`~argparse.FileType` e um argumento subsequente falhar, um erro será relatado, mas o arquivo não será fechado automaticamente. Neste caso, seria melhor esperar até que o analisador tenha sido executado e então usar a instrução :keyword:`with` para gerenciar os arquivos.

source: For type checkers that simply check against a fixed set of values, consider using the choices_ keyword instead.
pt_br: Para verificadores de tipo que simplesmente verificam um conjunto fixo de valores, considere usar o argumento nomeado choices_.

source: Some command-line arguments should be selected from a restricted set of values. These can be handled by passing a sequence object as the *choices* keyword argument to :meth:`~ArgumentParser.add_argument`. When the command line is parsed, argument values will be checked, and an error message will be displayed if the argument was not one of the acceptable values::
pt_br: Alguns argumentos de linha de comando devem ser selecionados em um conjunto restrito de valores. Eles podem ser tratados passando um objeto sequência como o argumento nomeado *choices* para :meth:`~ArgumentParser.add_argument`. Quando a linha de comando for analisada, os valores dos argumentos serão verificados e uma mensagem de erro será exibida se o argumento não for um dos valores aceitáveis::

source: >>> parser = argparse.ArgumentParser(prog='game.py') >>> parser.add_argument('move', choices=['rock', 'paper', 'scissors']) >>> parser.parse_args(['rock']) Namespace(move='rock') >>> parser.parse_args(['fire']) usage: game.py [-h] {rock,paper,scissors} game.py: error: argument move: invalid choice: 'fire' (choose from 'rock', 'paper', 'scissors')
pt_br: >>> parser = argparse.ArgumentParser(prog='game.py') >>> parser.add_argument('move', choices=['pedra', 'papel', 'tesoura']) >>> parser.parse_args(['padra']) Namespace(move='padr') >>> parser.parse_args(['fogo']) usage: game.py [-h] {pedra,papel,tesoura} game.py: error: argument move: invalid choice: 'fogo' (choose from 'pedra', 'papel', 'tesoura')

source: Note that inclusion in the *choices* sequence is checked after any type_ conversions have been performed, so the type of the objects in the *choices* sequence should match the type_ specified.
pt_br: Observe que a inclusão na sequência *choices* é verificada após qualquer conversão de type_ ter sido realizada, portanto o tipo dos objetos na sequência *choices* deve corresponder ao type_ especificado.

source: Any sequence can be passed as the *choices* value, so :class:`list` objects, :class:`tuple` objects, and custom sequences are all supported.
pt_br: Qualquer sequência pode ser passada como o valor *choices*, portanto objetos :class:`list`, objetos :class:`tuple` e sequências personalizadas são todos suportados.

source: Use of :class:`enum.Enum` is not recommended because it is difficult to control its appearance in usage, help, and error messages.
pt_br: O uso de :class:`enum.Enum` não é recomendado porque é difícil controlar sua aparência no uso, na ajuda e nas mensagens de erro.

source: Formatted choices override the default *metavar* which is normally derived from *dest*. This is usually what you want because the user never sees the *dest* parameter. If this display isn't desirable (perhaps because there are many choices), just specify an explicit metavar_.
pt_br: As opções formatadas substituem o *metavar* padrão que normalmente é derivado de *dest*. Geralmente é isso que você deseja porque o usuário nunca vê o parâmetro *dest*. Se esta exibição não for desejável (talvez porque haja muitas opções), basta especificar um metavar_ explícito.

source: In general, the :mod:`!argparse` module assumes that flags like ``-f`` and ``--bar`` indicate *optional* arguments, which can always be omitted at the command line. To make an option *required*, ``True`` can be specified for the ``required=`` keyword argument to :meth:`~ArgumentParser.add_argument`::
pt_br: Em geral, o módulo :mod:`!argparse` presume que sinalizadores como ``-f`` e ``--bar`` indicam argumentos *opcionais*, que sempre podem ser omitidos na linha de comando. Para tornar uma opção obrigatória, ``True`` pode ser especificado para o argumento nomeado ``required=`` para :meth:`~ArgumentParser.add_argument`::

source: As the example shows, if an option is marked as ``required``, :meth:`~ArgumentParser.parse_args` will report an error if that option is not present at the command line.
pt_br: Como mostra o exemplo, se uma opção estiver marcada como ``required``, :meth:`~ArgumentParser.parse_args` reportará um erro se essa opção não estiver presente na linha de comando.

source: Required options are generally considered bad form because users expect *options* to be *optional*, and thus they should be avoided when possible.
pt_br: As opções obrigatórias são geralmente consideradas inadequadas porque os usuários esperam que as *opções* sejam *opcionais* e, portanto, devem ser evitadas quando possível.

source: The ``help`` value is a string containing a brief description of the argument. When a user requests help (usually by using ``-h`` or ``--help`` at the command line), these ``help`` descriptions will be displayed with each argument.
pt_br: O valor ``help`` é uma string contendo uma breve descrição do argumento. Quando um usuário solicita ajuda (geralmente usando ``-h`` ou ``--help`` na linha de comando), estas descrições de ``help`` serão exibidas com cada argumento.

source: The ``help`` strings can include various format specifiers to avoid repetition of things like the program name or the argument default_. The available specifiers include the program name, ``%(prog)s`` and most keyword arguments to :meth:`~ArgumentParser.add_argument`, e.g. ``%(default)s``, ``%(type)s``, etc.::
pt_br: As strings ``help`` podem incluir vários especificadores de formato para evitar a repetição de coisas como o nome do programa ou o argumento default_. Os especificadores disponíveis incluem o nome do programa, ``%(prog)s`` e a maioria dos argumentos nomeados para :meth:`~ArgumentParser.add_argument`, por exemplo. ``%(default)s``, ``%(type)s``, etc.::

source: As the help string supports %-formatting, if you want a literal ``%`` to appear in the help string, you must escape it as ``%%``.
pt_br: Como a string de ajuda oferece suporte à formatação com %, se você quiser que um literal ``%`` apareça na string de ajuda, você deve escapá-lo como ``%%``.

source: :mod:`!argparse` supports silencing the help entry for certain options, by setting the ``help`` value to ``argparse.SUPPRESS``::
pt_br: :mod:`!argparse` oferece suporte a silenciar a entrada de ajuda para certas opções, definindo o valor ``help`` como ``argparse.SUPPRESS``::

source: When :class:`ArgumentParser` generates help messages, it needs some way to refer to each expected argument. By default, :class:`!ArgumentParser` objects use the dest_ value as the "name" of each object. By default, for positional argument actions, the dest_ value is used directly, and for optional argument actions, the dest_ value is uppercased. So, a single positional argument with ``dest='bar'`` will be referred to as ``bar``. A single optional argument ``--foo`` that should be followed by a single command-line argument will be referred to as ``FOO``. An example::
pt_br: Quando :class:`ArgumentParser` gera mensagens de ajuda, ele precisa de alguma forma de se referir a cada argumento esperado. Por padrão, os objetos :class:`!ArgumentParser` usam o valor dest_ como o "nome" de cada objeto. Por padrão, para ações de argumentos posicionais, o valor dest_ é usado diretamente, e para ações de argumentos opcionais, o valor dest_ é maiúsculo. Portanto, um único argumento posicional com ``dest='bar'`` será referido como ``bar``. Um único argumento opcional ``--foo`` que deve ser seguido por um único argumento de linha de comando será referido como ``FOO``. Um exemplo::

source: An alternative name can be specified with ``metavar``::
pt_br: Um nome alternativo pode ser especificado com ``metavar``::
