Repository: python/python-docs-pt-br
Catalog: library/argparse.po
Languages: pt_br

source: Note that ``metavar`` only changes the *displayed* name - the name of the attribute on the :meth:`~ArgumentParser.parse_args` object is still determined by the dest_ value.
pt_br: Observe que ``metavar`` apenas altera o nome *exibido* - o nome do atributo no objeto :meth:`~ArgumentParser.parse_args` ainda é determinado pelo valor dest_.

source: Different values of ``nargs`` may cause the metavar to be used multiple times. Providing a tuple to ``metavar`` specifies a different display for each of the arguments::
pt_br: Valores diferentes de ``nargs`` podem fazer com que o metavar seja usado múltiplas vezes. Fornecer uma tupla para ``metavar`` especifica uma exibição diferente para cada um dos argumentos::

source: Most :class:`ArgumentParser` actions add some value as an attribute of the object returned by :meth:`~ArgumentParser.parse_args`. The name of this attribute is determined by the ``dest`` keyword argument of :meth:`~ArgumentParser.add_argument`. For positional argument actions, ``dest`` is normally supplied as the first argument to :meth:`~ArgumentParser.add_argument`::
pt_br: A maioria das ações :class:`ArgumentParser` adiciona algum valor como um atributo do objeto retornado por :meth:`~ArgumentParser.parse_args`. O nome deste atributo é determinado pelo argumento nomeado ``dest`` de :meth:`~ArgumentParser.add_argument`. Para ações de argumento posicional, ``dest`` é normalmente fornecido como o primeiro argumento para :meth:`~ArgumentParser.add_argument`::

source: For optional argument actions, the value of ``dest`` is normally inferred from the option strings. :class:`ArgumentParser` generates the value of ``dest`` by taking the first long option string and stripping away the initial ``--`` string. If no long option strings were supplied, ``dest`` will be derived from the first short option string by stripping the initial ``-`` character. Any internal ``-`` characters will be converted to ``_`` characters to make sure the string is a valid attribute name. The examples below illustrate this behavior::
pt_br: Para ações de argumentos opcionais, o valor de ``dest`` é normalmente inferido das strings de opções. :class:`ArgumentParser` gera o valor de ``dest`` pegando a primeira string de opção longa e removendo a string inicial ``--``. Se nenhuma string de opção longa for fornecida, ``dest`` será derivado da primeira string de opção curta removendo o caractere ``-`` inicial. Quaisquer caracteres ``-`` internos serão convertidos em caracteres ``_`` para garantir que a string seja um nome de atributo válido. Os exemplos abaixo ilustram esse comportamento:

source: ``dest`` allows a custom attribute name to be provided::
pt_br: ``dest`` permite que um nome de atributo personalizado seja fornecido::

source: During a project's lifetime, some arguments may need to be removed from the command line. Before removing them, you should inform your users that the arguments are deprecated and will be removed. The ``deprecated`` keyword argument of :meth:`~ArgumentParser.add_argument`, which defaults to ``False``, specifies if the argument is deprecated and will be removed in the future. For arguments, if ``deprecated`` is ``True``, then a warning will be printed to :data:`sys.stderr` when the argument is used::
pt_br: Durante a vida de um projeto, alguns argumentos podem precisar ser removidos da linha de comando. Antes de removê-los, você deve informar aos seus usuários que os argumentos estão descontinuados e serão removidos. O argumento nomeado ``deprecated`` de :meth:`~ArgumentParser.add_argument`, cujo padrão é ``False``, especifica se o argumento está descontinuado e será removido no futuro. Para argumentos, se ``deprecated`` for ``True``, então um aviso será enviado para :data:`sys.stderr` (saída de erro) quando o argumento for usado::

source: Action classes
pt_br: Classes de ação

source: :class:`!Action` classes implement the Action API, a callable which returns a callable which processes arguments from the command-line. Any object which follows this API may be passed as the ``action`` parameter to :meth:`~ArgumentParser.add_argument`.
pt_br: As classes :class:`!Action` implementam a API de Action, um chamável que retorna um chamável que processa argumentos da linha de comando. Qualquer objeto que siga esta API pode ser passado como parâmetro ``action`` para :meth:`~ArgumentParser.add_argument`.

source: :class:`!Action` objects are used by an :class:`ArgumentParser` to represent the information needed to parse a single argument from one or more strings from the command line. The :class:`!Action` class must accept the two positional arguments plus any keyword arguments passed to :meth:`ArgumentParser.add_argument` except for the ``action`` itself.
pt_br: Objetos :class:`!Action` são usados por um :class:`ArgumentParser` para representar as informações necessárias para analisar um único argumento de uma ou mais strings da linha de comando. A classe :class:`!Action` deve aceitar os dois argumentos posicionais mais quaisquer argumentos nomeados passados para :meth:`ArgumentParser.add_argument`, exceto o próprio ``action``.

source: Instances of :class:`!Action` (or return value of any callable to the ``action`` parameter) should have attributes :attr:`!dest`, :attr:`!option_strings`, :attr:`!default`, :attr:`!type`, :attr:`!required`, :attr:`!help`, etc. defined. The easiest way to ensure these attributes are defined is to call :meth:`!Action.__init__`.
pt_br: Instâncias de :class:`!Action` (ou valor de retorno de qualquer chamável para o parâmetro ``action``) devem ter atributos :attr:`!dest`, :attr:`!option_strings`, :attr:`!default`, :attr:`!type`, :attr:`!required`, :attr:`!help`, etc. definidos. A maneira mais fácil de garantir que esses atributos sejam definidos é chamar :meth:`!Action.__init__`.

source: :class:`!Action` instances should be callable, so subclasses must override the :meth:`!__call__` method, which should accept four parameters:
pt_br: As instâncias de :class:`!Action` devem ser chamáveis, portanto, as subclasses devem substituir o método :meth:`!__call__`, que deve aceitar quatro parâmetros:

source: *parser* - The :class:`ArgumentParser` object which contains this action.
pt_br: *parser* - O objeto :class:`ArgumentParser` que contém esta ação.

source: *namespace* - The :class:`Namespace` object that will be returned by :meth:`~ArgumentParser.parse_args`. Most actions add an attribute to this object using :func:`setattr`.
pt_br: *namespace* - O objeto :class:`Namespace` que será retornado por :meth:`~ArgumentParser.parse_args`. A maioria das ações adicionam um atributo a este objeto usando :func:`setattr`.

source: *values* - The associated command-line arguments, with any type conversions applied. Type conversions are specified with the type_ keyword argument to :meth:`~ArgumentParser.add_argument`.
pt_br: *values* - Os argumentos de linha de comando associados, com qualquer conversões de tipo aplicadas. Conversões de tipo são especificadas com o argumento nomeado type_ para :meth:`~ArgumentParser.add_argument`.

source: *option_string* - The option string that was used to invoke this action. The ``option_string`` argument is optional, and will be absent if the action is associated with a positional argument.
pt_br: *option_string* - A string da opção que foi usada para invocar esta ação. O argumento ``option_string`` é opcional e estará ausente se a ação estiver associada a um argumento posicional.

source: The :meth:`!__call__` method may perform arbitrary actions, but will typically set attributes on the ``namespace`` based on ``dest`` and ``values``.
pt_br: O método :meth:`!__call__` pode executar ações arbitrárias, mas normalmente definirá atributos em ``namespace`` com base em ``dest`` e ``values``.

source: :class:`!Action` subclasses can define a :meth:`!format_usage` method that takes no argument and return a string which will be used when printing the usage of the program. If such method is not provided, a sensible default will be used.
pt_br: As subclasses de :class:`!Action` podem definir um método :meth:`!format_usage` que não recebe argumento e retorna uma string que será usada ao exibir a mensagem de uso do programa. Se tal método não for fornecido, um padrão sensato será usado.

source: A subclass of :class:`Action` for handling boolean flags with positive and negative options. Adding a single argument such as ``--foo`` automatically creates both ``--foo`` and ``--no-foo`` options, storing ``True`` and ``False`` respectively::
pt_br: Uma subclasse de :class:`Action` para manipular sinalizadores booleanos com opções positivas e negativas. Adicionar um único argumento, como ``--foo``, cria automaticamente as opções ``--foo`` e ``--no-foo``, armazenando ``True`` e ``False`` respectivamente::

source: The parse_args() method
pt_br: O método parse_args()

source: Convert argument strings to objects and assign them as attributes of the namespace. Return the populated namespace.
pt_br: Converte strings de argumento em objetos e os atribui como atributos do espaço de nomes. Retorna o espaço de nomes preenchido.

source: Previous calls to :meth:`add_argument` determine exactly what objects are created and how they are assigned. See the documentation for :meth:`!add_argument` for details.
pt_br: Chamadas anteriores para :meth:`add_argument` determinam exatamente quais objetos são criados e como eles são atribuídos. Veja a documentação de :meth:`!add_argument` para detalhes.

source: args_ - List of strings to parse. The default is taken from :data:`sys.argv`.
pt_br: args_ - Lista de strings para analisar. O padrão é obtido de :data:`sys.argv`.

source: namespace_ - An object to take the attributes. The default is a new empty :class:`Namespace` object.
pt_br: namespace_ - Um objeto para receber os atributos. O padrão é um novo objeto :class:`Namespace` vazio.

source: Option value syntax
pt_br: Sintaxe de valores da opção

source: The :meth:`~ArgumentParser.parse_args` method supports several ways of specifying the value of an option (if it takes one). In the simplest case, the option and its value are passed as two separate arguments::
pt_br: O método :meth:`~ArgumentParser.parse_args` provê várias maneiras de especificar o valor de uma opção (se ele pegar uma). No caso mais simples, a opção e seu valor são passados como dois argumentos separados::

source: For long options (options with names longer than a single character), the option and value can also be passed as a single command-line argument, using ``=`` to separate them::
pt_br: Para opções longas (opções com nomes maiores que um único caractere), a opção e o valor também podem ser passados como um único argumento de linha de comando, usando ``=`` para separá-los::

source: For short options (options only one character long), the option and its value can be concatenated::
pt_br: Para opções curtas (opções com apenas um caractere), a opção e seu valor podem ser concatenados:

source: Several short options can be joined together, using only a single ``-`` prefix, as long as only the last option (or none of them) requires a value::
pt_br: Várias opções curtas podem ser unidas, usando apenas um único prefixo ``-``, desde que apenas a última opção (ou nenhuma delas) exija um valor::

source: Invalid arguments
pt_br: Argumentos inválidos

source: While parsing the command line, :meth:`~ArgumentParser.parse_args` checks for a variety of errors, including ambiguous options, invalid types, invalid options, wrong number of positional arguments, etc. When it encounters such an error, it exits and prints the error along with a usage message::
pt_br: Ao analisar a linha de comando, :meth:`~ArgumentParser.parse_args` verifica uma variedade de erros, incluindo opções ambíguas, tipos inválidos, opções inválidas, número incorreto de argumentos posicionais, etc. Quando encontra tal erro, ele sai e imprime o erro junto com uma mensagem de uso::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', type=int) >>> parser.add_argument('bar', nargs='?') >>> # invalid type >>> parser.parse_args(['--foo', 'spam']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: argument --foo: invalid int value: 'spam' >>> # invalid option >>> parser.parse_args(['--bar']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: no such option: --bar >>> # wrong number of arguments >>> parser.parse_args(['spam', 'badger']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: extra arguments found: badger
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', type=int) >>> parser.add_argument('bar', nargs='?') >>> # tipo inválido >>> parser.parse_args(['--foo', 'spam']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: argument --foo: invalid int value: 'spam' >>> # opção inválida >>> parser.parse_args(['--bar']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: no such option: --bar >>> # número errado de argumentos >>> parser.parse_args(['spam', 'badger']) usage: PROG [-h] [--foo FOO] [bar] PROG: error: extra arguments found: badger

source: Arguments containing ``-``
pt_br: Argumentos contendo ``-``

source: The :meth:`~ArgumentParser.parse_args` method attempts to give errors whenever the user has clearly made a mistake, but some situations are inherently ambiguous. For example, the command-line argument ``-1`` could either be an attempt to specify an option or an attempt to provide a positional argument. The :meth:`~ArgumentParser.parse_args` method is cautious here: positional arguments may only begin with ``-`` if they look like negative numbers and there are no options in the parser that look like negative numbers::
pt_br: O método :meth:`~ArgumentParser.parse_args` tenta mostrar erros sempre que o usuário claramente cometeu um erro, mas algumas situações são inerentemente ambíguas. Por exemplo, o argumento de linha de comando ``-1`` pode ser uma tentativa de especificar uma opção ou uma tentativa de fornecer um argumento posicional. O método :meth:`~ArgumentParser.parse_args` é cauteloso aqui: argumentos posicionais só podem começar com ``-`` se eles se parecerem com números negativos e não houver opções no analisador sintático que se pareçam com números negativos::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x') >>> parser.add_argument('foo', nargs='?') >>> # no negative number options, so -1 is a positional argument >>> parser.parse_args(['-x', '-1']) Namespace(foo=None, x='-1') >>> # no negative number options, so -1 and -5 are positional arguments >>> parser.parse_args(['-x', '-1', '-5']) Namespace(foo='-5', x='-1') >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-1', dest='one') >>> parser.add_argument('foo', nargs='?') >>> # negative number options present, so -1 is an option >>> parser.parse_args(['-1', 'X']) Namespace(foo=None, one='X') >>> # negative number options present, so -2 is an option >>> parser.parse_args(['-2']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: no such option: -2 >>> # negative number options present, so both -1s are options >>> parser.parse_args(['-1', '-1']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: argument -1: expected one argument
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-x') >>> parser.add_argument('foo', nargs='?') >>> # nenhuma opção de número negativo, então -1 é um argumento posicional >>> parser.parse_args(['-x', '-1']) Namespace(foo=None, x='-1') >>> # nenhuma opção de número negativo, então -1 e -5 são argumentos posicionais >>> parser.parse_args(['-x', '-1', '-5']) Namespace(foo='-5', x='-1') >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-1', dest='one') >>> parser.add_argument('foo', nargs='?') >>> # opção de número negativo presente, então -1 é uma opção >>> parser.parse_args(['-1', 'X']) Namespace(foo=None, one='X') >>> # opção de número negativo presente, então -2 é uma opção >>> parser.parse_args(['-2']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: no such option: -2 >>> # opções de número negativo presentes, então ambos -1s são opções >>> parser.parse_args(['-1', '-1']) usage: PROG [-h] [-1 ONE] [foo] PROG: error: argument -1: expected one argument

source: If you have positional arguments that must begin with ``-`` and don't look like negative numbers, you can insert the pseudo-argument ``'--'`` which tells :meth:`~ArgumentParser.parse_args` that everything after that is a positional argument::
pt_br: Se você tiver argumentos posicionais que devem começar com ``-`` e não se parecem com números negativos, você pode inserir o pseudoargumento ``'--'`` que informa :meth:`~ArgumentParser.parse_args` que tudo depois disso é um argumento posicional::

source: See also :ref:`the argparse howto on ambiguous arguments <specifying-ambiguous-arguments>` for more details.
pt_br: Veja também :ref:`o tutorial do argparse sobre argumentos ambíguos <specifying-ambiguous-arguments>` para mais detalhes.

source: Argument abbreviations (prefix matching)
pt_br: Abreviações de argumento (correspondência de prefixo)

source: The :meth:`~ArgumentParser.parse_args` method :ref:`by default <allow_abbrev>` allows long options to be abbreviated to a prefix, if the abbreviation is unambiguous (the prefix matches a unique option)::
pt_br: O método :meth:`~ArgumentParser.parse_args` :ref:`por padrão <allow_abbrev>` permite que opções longas sejam abreviadas para um prefixo, se a abreviação não for ambígua (o prefixo corresponde a uma opção única)::

source: An error is produced for arguments that could produce more than one options. This feature can be disabled by setting :ref:`allow_abbrev` to ``False``.
pt_br: Um erro é produzido para argumentos que podem produzir mais de uma opção. Este recurso pode ser desabilitado definindo :ref:`allow_abbrev` como ``False``.

source: Beyond ``sys.argv``
pt_br: Além do ``sys.argv``

source: Sometimes it may be useful to have an :class:`ArgumentParser` parse arguments other than those of :data:`sys.argv`. This can be accomplished by passing a list of strings to :meth:`~ArgumentParser.parse_args`. This is useful for testing at the interactive prompt::
pt_br: Às vezes, pode ser útil ter uma instância de :class:`ArgumentParser` analisando argumentos diferentes daqueles de :data:`sys.argv`. Isso pode ser feito passando uma lista de strings para :meth:`~ArgumentParser.parse_args`. Isso é útil para testar no prompt interativo::

source: The Namespace object
pt_br: O objeto Namespace

source: Simple class used by default by :meth:`~ArgumentParser.parse_args` to create an object holding attributes and return it.
pt_br: Classe simples usada por padrão por :meth:`~ArgumentParser.parse_args` para criar um objeto contendo atributos e retorná-lo.

source: This class is deliberately simple, just an :class:`object` subclass with a readable string representation. If you prefer to have dict-like view of the attributes, you can use the standard Python idiom, :func:`vars`::
pt_br: Esta classe é deliberadamente simples, apenas uma subclasse :class:`object` com uma representação de string legível. Se você preferir ter uma visão dos atributos do tipo dict, você pode usar o idioma padrão do Python, :func:`vars`::

source: It may also be useful to have an :class:`ArgumentParser` assign attributes to an already existing object, rather than a new :class:`Namespace` object. This can be achieved by specifying the ``namespace=`` keyword argument::
pt_br: Também pode ser útil ter um :class:`ArgumentParser` atribuindo atributos a um objeto já existente, em vez de um novo objeto :class:`Namespace`. Isso pode ser obtido especificando o argumento nomeado ``namespace=``::

source: Other utilities
pt_br: Outros utilitários

source: Sub-commands
pt_br: Subcomandos

source: Many programs split up their functionality into a number of subcommands, for example, the ``svn`` program can invoke subcommands like ``svn checkout``, ``svn update``, and ``svn commit``. Splitting up functionality this way can be a particularly good idea when a program performs several different functions which require different kinds of command-line arguments. :class:`ArgumentParser` supports the creation of such subcommands with the :meth:`!add_subparsers` method. The :meth:`!add_subparsers` method is normally called with no arguments and returns a special action object. This object has a single method, :meth:`~_SubParsersAction.add_parser`, which takes a command name and any :class:`!ArgumentParser` constructor arguments, and returns an :class:`!ArgumentParser` object that can be modified as usual.
pt_br: Muitos programas dividem sua funcionalidade em vários subcomandos, por exemplo, o programa ``svn`` pode invocar subcomandos como ``svn checkout``, ``svn update`` e ``svn commit``. Dividir a funcionalidade dessa forma pode ser uma ideia particularmente boa quando um programa executa várias funções diferentes que exigem diferentes tipos de argumentos de linha de comando. :class:`ArgumentParser` oferece suporte à criação de tais subcomandos com o método :meth:`!add_subparsers`. O método :meth:`!add_subparsers` é normalmente chamado sem argumentos e retorna um objeto de ação especial. Este objeto tem um único método, :meth:`~_SubParsersAction.add_parser`, que recebe um nome de comando e quaisquer argumentos do construtor :class:`!ArgumentParser` e retorna um objeto :class:`!ArgumentParser` que pode ser modificado normalmente.

source: Description of parameters:
pt_br: Descrição de parâmetros:

source: *title* - title for the sub-parser group in help output; by default "subcommands" if description is provided, otherwise uses title for positional arguments
pt_br: *title* - título para o grupo de subanalisadores na saída de ajuda; por padrão "subcomandos" se a descrição for fornecida, caso contrário, usa o título para argumentos posicionais

source: *description* - description for the sub-parser group in help output, by default ``None``
pt_br: *description* - descrição para o grupo de subanalisadores na saída de ajuda, por padrão ``None``

source: *prog* - usage information that will be displayed with sub-command help, by default the name of the program and any positional arguments before the subparser argument
pt_br: *prog* - informações de uso que serão exibidas com a ajuda do subcomando, por padrão o nome do programa e quaisquer argumentos posicionais antes do argumento do subanalisador

source: *parser_class* - class which will be used to create sub-parser instances, by default the class of the current parser (e.g. :class:`ArgumentParser`)
pt_br: *parser_class* - classe que será usada para criar instâncias de subanalisadores, por padrão a classe do analisador atual (por exemplo, :class:`ArgumentParser`)

source: action_ - the basic type of action to be taken when this argument is encountered at the command line
pt_br: action_ - o tipo básico de ação a ser executada quando esse argumento é encontrado na linha de comando

source: dest_ - name of the attribute under which sub-command name will be stored; by default ``None`` and no value is stored
pt_br: dest_ - nome do atributo sob o qual o nome do subcomando será armazenado; por padrão ``None`` e nenhum valor é armazenado

source: required_ - Whether or not a subcommand must be provided, by default ``False`` (added in 3.7)
pt_br: required_ - Se um subcomando deve ou não ser fornecido, por padrão ``False`` (adicionado em 3.7)

source: help_ - help for sub-parser group in help output, by default ``None``
pt_br: help_ - ajuda para o grupo de subanalisadores na saída de ajuda, por padrão ``None``
