Repository: python/python-docs-pt-br
Catalog: library/argparse.po
Languages: pt_br

source: :mod:`!argparse` --- Parser for command-line options, arguments and subcommands
pt_br: :mod:`!argparse` --- Analisador sintático para opções de linha de comando, argumentos e subcomandos

source: **Source code:** :source:`Lib/argparse.py`
pt_br: **Código-fonte:** :source:`Lib/argparse.py`

source: While :mod:`argparse` is the default recommended standard library module for implementing basic command line applications, authors with more exacting requirements for exactly how their command line applications behave may find it doesn't provide the necessary level of control. Refer to :ref:`choosing-an-argument-parser` for alternatives to consider when ``argparse`` doesn't support behaviors that the application requires (such as entirely disabling support for interspersed options and positional arguments, or accepting option parameter values that start with ``-`` even when they correspond to another defined option).
pt_br: Embora :mod:`argparse` seja o módulo de biblioteca padrão recomendado para implementar aplicações básicas de linha de comando, autores com requisitos mais rigorosos sobre como exatamente seus aplicativos de linha de comando se comportam podem descobrir que ele não fornece o nível de controle necessário. Consulte :ref:`choosing-an-argument-parser` para alternativas a serem consideradas quando ``argparse`` não suporta comportamentos que a aplicação requer (como desabilitar completamente o suporte para opções intercaladas e argumentos posicionais, ou aceitar valores de parâmetros de opção que começam com ``-`` mesmo quando correspondem a outra opção definida).

source: This page contains the API reference information. For a more gentle introduction to Python command-line parsing, have a look at the :ref:`argparse tutorial <argparse-tutorial>`.
pt_br: Esta página contém informações da API de Referência. Para uma introdução mais prática para o parser de linha de comando Python, acesse o :ref:`tutorial do argparse <argparse-tutorial>`.

source: The :mod:`!argparse` module makes it easy to write user-friendly command-line interfaces. The program defines what arguments it requires, and :mod:`!argparse` will figure out how to parse those out of :data:`sys.argv`. The :mod:`!argparse` module also automatically generates help and usage messages. The module will also issue errors when users give the program invalid arguments.
pt_br: O módulo :mod:`!argparse` torna fácil a escrita de interfaces de linha de comando amigáveis. O programa define quais argumentos são necessários e :mod:`!argparse` descobrirá como analisá-lo e interpretá-los a partir do :data:`sys.argv`. O módulo :mod:`!argparse` também gera automaticamente o texto ajuda e mensagens de uso. O módulo também vai emitir erros quando o usuário prover argumentos inválidos para o programa.

source: The :mod:`!argparse` module's support for command-line interfaces is built around an instance of :class:`argparse.ArgumentParser`. It is a container for argument specifications and has options that apply to the parser as whole::
pt_br: O suporte do módulo :mod:`!argparse` para interfaces de linha de comando é construído em torno de uma instância de :class:`argparse.ArgumentParser`. É um contêiner para especificações de argumentos e possui opções que se aplicam ao analisador sintático como um todo::

source: parser = argparse.ArgumentParser( prog='ProgramName', description='What the program does', epilog='Text at the bottom of help')
pt_br: parser = argparse.ArgumentParser( prog='NomePrograma', description='O que o programa faz', epilog='Texto na parte inferior da memsagem de ajuda')

source: The :meth:`ArgumentParser.add_argument` method attaches individual argument specifications to the parser. It supports positional arguments, options that accept values, and on/off flags::
pt_br: O método :meth:`ArgumentParser.add_argument` anexa especificações de argumentos individuais ao analisador. Ele oferece suporte a argumentos posicionais, opções que aceitam valores e sinalizadores liga/desliga::

source: parser.add_argument('filename') # positional argument parser.add_argument('-c', '--count') # option that takes a value parser.add_argument('-v', '--verbose', action='store_true') # on/off flag
pt_br: parser.add_argument('filename') # argumento posicional parser.add_argument('-c', '--count') # a opção recebe um valor parser.add_argument('-v', '--verbose', action='store_true') # sinalizador de ligar/desligar

source: The :meth:`ArgumentParser.parse_args` method runs the parser and places the extracted data in a :class:`argparse.Namespace` object::
pt_br: O método :meth:`ArgumentParser.parse_args` executa o analisador e coloca os dados extraídos em um objeto :class:`argparse.Namespace`::

source: If you're looking for a guide about how to upgrade :mod:`optparse` code to :mod:`!argparse`, see :ref:`Upgrading Optparse Code <upgrading-optparse-code>`.
pt_br: Se você estiver procurando um guia sobre como atualizar um código :mod:`optparse` para :mod:`!argparse`, veja :ref:`Atualizando código optparse <upgrading-optparse-code>`.

source: ArgumentParser objects
pt_br: Objetos ArgumentParser

source: Create a new :class:`ArgumentParser` object. All parameters should be passed as keyword arguments. Each parameter has its own more detailed description below, but in short they are:
pt_br: Cria um novo objeto :class:`ArgumentParser`. Todos os parâmetros devem ser passados como argumentos nomeados. Cada parâmetro tem sua própria descrição mais detalhada abaixo, mas em resumo eles são:

source: prog_ - The name of the program (default: generated from the ``__main__`` module attributes and ``sys.argv[0]``)
pt_br: prog_ - O nome do programa (padrão: gerado a partir de atributos de módulo ``__main__`` e de ``sys.argv[0]``)

source: usage_ - The string describing the program usage (default: generated from arguments added to parser)
pt_br: usage_ - A string que descreve o uso do programa (padrão: gerado a partir de argumentos adicionados ao analisador sintático)

source: description_ - Text to display before the argument help (by default, no text)
pt_br: description_ - Texto para exibir antes da ajuda dos argumentos (por padrão, nenhum texto)

source: epilog_ - Text to display after the argument help (by default, no text)
pt_br: epilog_ - Texto para exibir após da ajuda dos argumentos (por padrão, nenhum texto)

source: parents_ - A list of :class:`ArgumentParser` objects whose arguments should also be included
pt_br: parents_ - Uma lista de objetos :class:`ArgumentParser` cujos argumentos também devem ser incluídos

source: formatter_class_ - A class for customizing the help output
pt_br: formatter_class_ - Uma classe para personalizar a saída de ajuda

source: prefix_chars_ - The set of characters that prefix optional arguments (default: '-')
pt_br: prefix_chars_ - O conjunto de caracteres que prefixam argumentos opcionais (padrão: "-")

source: fromfile_prefix_chars_ - The set of characters that prefix files from which additional arguments should be read (default: ``None``)
pt_br: fromfile_prefix_chars_ - O conjunto de caracteres que prefixam os arquivos dos quais os argumentos adicionais devem ser lidos (padrão: ``None``)

source: argument_default_ - The global default value for arguments (default: ``None``)
pt_br: argument_default_ - O valor padrão global para argumentos (padrão: ``None``)

source: conflict_handler_ - The strategy for resolving conflicting optionals (usually unnecessary)
pt_br: conflict_handler_ - A estratégia para resolver opcionais conflitantes (geralmente desnecessário)

source: add_help_ - Add a ``-h/--help`` option to the parser (default: ``True``)
pt_br: add_help_ - Adiciona uma opção ``-h/--help`` para o analisador sintático (padrão: ``True``)

source: allow_abbrev_ - Allows long options to be abbreviated if the abbreviation is unambiguous (default: ``True``)
pt_br: allow_abbrev_ - Permite que opções longas sejam abreviadas se a abreviação não for ambígua. (padrão: ``True``)

source: exit_on_error_ - Determines whether or not :class:`!ArgumentParser` exits with error info when an error occurs. (default: ``True``)
pt_br: exit_on_error_ - Determina se :class:`!ArgumentParser` sai ou não com informações de erro quando ocorre um erro. (padrão: ``True``)

source: suggest_on_error_ - Enables suggestions for mistyped argument choices and subparser names (default: ``False``)
pt_br: suggest_on_error_ - Habilita sugestões para escolhas de argumentos e nomes de subanalisadores digitados incorretamente (padrão: ``False``)

source: color_ - Allow color output (default: ``True``)
pt_br: color_ - Permite saída colorida (padrão: ``True``)

source: *allow_abbrev* parameter was added.
pt_br: O parâmetro *allow_abbrev* foi adicionado.

source: In previous versions, *allow_abbrev* also disabled grouping of short flags such as ``-vv`` to mean ``-v -v``.
pt_br: Em versões anteriores, *allow_abbrev* também desabilitava o agrupamento de sinalizadores curtos, como ``-vv`` para significar ``-v -v``.

source: *exit_on_error* parameter was added.
pt_br: O parâmetro *exit_on_error* foi adicionado.

source: *suggest_on_error* and *color* parameters were added.
pt_br: Os parâmetros *suggest_on_error* e *color* foram adicionados.

source: The following sections describe how each of these are used.
pt_br: As seções a seguir descrevem como cada um deles é usado.

source: By default, :class:`ArgumentParser` calculates the name of the program to display in help messages depending on the way the Python interpreter was run:
pt_br: Por padrão, :class:`ArgumentParser` calcula o nome do programa a ser exibido nas mensagens de ajuda dependendo da maneira como o interpretador Python foi executado:

source: The :func:`base name <os.path.basename>` of ``sys.argv[0]`` if a file was passed as argument.
pt_br: O :func:`nome base <os.path.basename>` de ``sys.argv[0]`` se um arquivo foi passado como argumento.

source: The Python interpreter name followed by ``sys.argv[0]`` if a directory or a zipfile was passed as argument.
pt_br: O nome do interpretador Python seguido por ``sys.argv[0]`` se um diretório ou um arquivo zip foi passado como argumento.

source: The Python interpreter name followed by ``-m`` followed by the module or package name if the :option:`-m` option was used.
pt_br: O nome do interpretador Python seguido por ``-m`` seguido pelo nome do módulo ou pacote se a opção :option:`-m` foi usada.

source: This default is almost always desirable because it will make the help messages match the string that was used to invoke the program on the command line. However, to change this default behavior, another value can be supplied using the ``prog=`` argument to :class:`ArgumentParser`::
pt_br: Este padrão é quase sempre desejável porque fará com que as mensagens de ajuda correspondam à string que foi usada para invocar o programa na linha de comando. No entanto, para alterar esse comportamento padrão, outro valor pode ser fornecido usando o argumento ``prog=`` para :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.print_help() usage: myprogram [-h] options: -h, --help show this help message and exit
pt_br: >>> parser = argparse.ArgumentParser(prog='meuprograma') >>> parser.print_help() usage: meuprograma [-h] options: -h, --help show this help message and exit

source: Note that the program name, whether determined from ``sys.argv[0]``, from the ``__main__`` module attributes or from the ``prog=`` argument, is available to help messages using the ``%(prog)s`` format specifier.
pt_br: Observe que o nome do programa, seja determinado a partir de ``sys.argv[0]``, a partir de atributos de módulo ``__main__`` ou do argumento ``prog=``, está disponível para mensagens de ajuda usando o especificador de formato ``%(prog)s``.

source: >>> parser = argparse.ArgumentParser(prog='myprogram') >>> parser.add_argument('--foo', help='foo of the %(prog)s program') >>> parser.print_help() usage: myprogram [-h] [--foo FOO] options: -h, --help show this help message and exit --foo FOO foo of the myprogram program
pt_br: >>> parser = argparse.ArgumentParser(prog='meuprograma') >>> parser.add_argument('--foo', help='foo do programa %(prog)s') >>> parser.print_help() usage: meuprograma [-h] [--foo FOO] options: -h, --help show this help message and exit --foo FOO foo do programa meuprograma

source: The default ``prog`` value now reflects how ``__main__`` was actually executed, rather than always being ``os.path.basename(sys.argv[0])``.
pt_br: O valor padrão ``prog`` agora reflete como ``__main__`` foi realmente executado, em vez de ser sempre ``os.path.basename(sys.argv[0])``.

source: By default, :class:`ArgumentParser` calculates the usage message from the arguments it contains. The default message can be overridden with the ``usage=`` keyword argument::
pt_br: Por padrão, :class:`ArgumentParser` calcula a mensagem de uso a partir dos argumentos que contém. A mensagem padrão pode ser substituída pelo argumento nomeado ``usage=``::

source: The ``%(prog)s`` format specifier is available to fill in the program name in your usage messages.
pt_br: O especificador de formato ``%(prog)s`` está disponível para preencher o nome do programa em suas mensagens de uso.

source: When a custom usage message is specified for the main parser, you may also want to consider passing the ``prog`` argument to :meth:`~ArgumentParser.add_subparsers` or the ``prog`` and the ``usage`` arguments to :meth:`~_SubParsersAction.add_parser`, to ensure consistent command prefixes and usage information across subparsers.
pt_br: Quando uma mensagem de uso personalizada é especificada para o analisador sintático principal, você também pode considerar passar o argumento ``prog`` para :meth:`~ArgumentParser.add_subparsers` ou os argumentos ``prog`` e ``usage`` para :meth:`~_SubParsersAction.add_parser`, para garantir prefixos de comando e informações de uso consistentes entre os subanalisadores.

source: Most calls to the :class:`ArgumentParser` constructor will use the ``description=`` keyword argument. This argument gives a brief description of what the program does and how it works. In help messages, the description is displayed between the command-line usage string and the help messages for the various arguments.
pt_br: A maioria das chamadas para o construtor :class:`ArgumentParser` usará o argumento nomeado ``description=``. Este argumento fornece uma breve descrição do que o programa faz e como funciona. Nas mensagens de ajuda, a descrição é exibida entre a string de uso da linha de comando e as mensagens de ajuda para os vários argumentos.

source: By default, the description will be line-wrapped so that it fits within the given space. To change this behavior, see the formatter_class_ argument.
pt_br: Por padrão, a descrição terá sua linha quebrada para que se encaixe no espaço fornecido. Para alterar esse comportamento, consulte o argumento formatter_class_.

source: Some programs like to display additional description of the program after the description of the arguments. Such text can be specified using the ``epilog=`` argument to :class:`ArgumentParser`::
pt_br: Alguns programas gostam de exibir uma descrição adicional do programa após a descrição dos argumentos. Esse texto pode ser especificado usando o argumento ``epilog=`` para :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser( ... description='A foo that bars', ... epilog="And that's how you'd foo a bar") >>> parser.print_help() usage: argparse.py [-h] A foo that bars options: -h, --help show this help message and exit And that's how you'd foo a bar
pt_br: >>> parser = argparse.ArgumentParser( ... description='Um foo que faz bars', ... epilog="E é assim que você faria foo de bar") >>> parser.print_help() usage: argparse.py [-h] Um foo que faz bars options: -h, --help show this help message and exit E é assim que você faria foo de bar

source: As with the description_ argument, the ``epilog=`` text is by default line-wrapped, but this behavior can be adjusted with the formatter_class_ argument to :class:`ArgumentParser`.
pt_br: Tal como acontece com o argumento description_, o texto de ``epilog=`` tem sua quebra de linha habilitada por padrão, mas este comportamento pode ser ajustado com o argumento formatter_class_ para :class:`ArgumentParser`.

source: Sometimes, several parsers share a common set of arguments. Rather than repeating the definitions of these arguments, a single parser with all the shared arguments and passed to ``parents=`` argument to :class:`ArgumentParser` can be used. The ``parents=`` argument takes a list of :class:`ArgumentParser` objects, collects all the positional and optional actions from them, and adds these actions to the :class:`ArgumentParser` object being constructed::
pt_br: Às vezes, vários analisadores sintáticos compartilham um conjunto comum de argumentos. Ao invés de repetir as definições desses argumentos, um único analisador com todos os argumentos compartilhados e passado para o argumento ``parents=`` para :class:`ArgumentParser` pode ser usado. O argumento ``parents=`` pega uma lista de objetos :class:`ArgumentParser`, coleta todas as ações posicionais e opcionais deles, e adiciona essas ações ao objeto :class:`ArgumentParser` sendo construído::

source: Note that most parent parsers will specify ``add_help=False``. Otherwise, the :class:`ArgumentParser` will see two ``-h/--help`` options (one in the parent and one in the child) and raise an error.
pt_br: Observe que a maioria dos analisadores sintáticos pais especificará ``add_help=False``. Caso contrário, o :class:`ArgumentParser` verá duas opções ``-h/--help`` (uma no pai e outra no filho) e levantará um erro.

source: You must fully initialize the parsers before passing them via ``parents=``. If you change the parent parsers after the child parser, those changes will not be reflected in the child.
pt_br: Você deve inicializar totalmente os analisadores sintáticos antes de passá-los via ``parents=``. Se você alterar os analisadores pais após o analisador filho, essas mudanças não serão refletidas no filho.

source: :class:`ArgumentParser` objects allow the help formatting to be customized by specifying an alternate formatting class. Currently, there are four such classes:
pt_br: Objetos :class:`ArgumentParser` permitem que a formação do texto de ajuda seja personalizada por meio da especificação de uma classe de formatação alternativa. Atualmente, há quatro dessas classes:

source: :class:`RawDescriptionHelpFormatter` and :class:`RawTextHelpFormatter` give more control over how textual descriptions are displayed. By default, :class:`ArgumentParser` objects line-wrap the description_ and epilog_ texts in command-line help messages::
pt_br: :class:`RawDescriptionHelpFormatter` e :class:`RawTextHelpFormatter` dão mais controle sobre como as descrições textuais são exibidas. Por padrão, objetos :class:`ArgumentParser` quebram em linha os textos description_ e epilog_ nas mensagens de ajuda da linha de comando::

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... description='''this description ... was indented weird ... but that is okay''', ... epilog=''' ... likewise for this epilog whose whitespace will ... be cleaned up and whose words will be wrapped ... across a couple lines''') >>> parser.print_help() usage: PROG [-h] this description was indented weird but that is okay options: -h, --help show this help message and exit likewise for this epilog whose whitespace will be cleaned up and whose words will be wrapped across a couple lines
pt_br: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... description='''esta descrição ... foi indentada de forma estranha, ... mas está tudo bem''', ... epilog=''' ... da mesma forma para este epílogo, cujos espaços vão ... ser apagados e cujas palavras serão quebradas ... em algumas linhas''') >>> parser.print_help() usage: PROG [-h] this description was indented weird but that is okay options: -h, --help show this help message and exit da mesma forma para este epílogo, cujos espaços vão ser apagados e cujas palavras serão quebradas em algumas linhas

source: Passing :class:`RawDescriptionHelpFormatter` as ``formatter_class=`` indicates that description_ and epilog_ are already correctly formatted and should not be line-wrapped::
pt_br: Passar :class:`RawDescriptionHelpFormatter` como ``formatter_class=`` indica que description_ e epilog_ já estão formatados corretamente e não devem ter suas linhas quebradas::

source: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.RawDescriptionHelpFormatter, ... description=textwrap.dedent('''\ ... Please do not mess up this text! ... -------------------------------- ... I have indented it ... exactly the way ... I want it ... ''')) >>> parser.print_help() usage: PROG [-h] Please do not mess up this text! -------------------------------- I have indented it exactly the way I want it options: -h, --help show this help message and exit
pt_br: >>> parser = argparse.ArgumentParser( ... prog='PROG', ... formatter_class=argparse.RawDescriptionHelpFormatter, ... description=textwrap.dedent('''\ ... Por favor, não bagunce este texto! ... -------------------------------- ... Eu indentei o texto ... exatamente na forma ... que quero que fique ... ''')) >>> parser.print_help() usage: PROG [-h] Por favor, não bagunce este texto! -------------------------------- Eu indentei o texto exatamente na forma que quero que fique options: -h, --help show this help message and exit

source: :class:`RawTextHelpFormatter` maintains whitespace for all sorts of help text, including argument descriptions. However, multiple newlines are replaced with one. If you wish to preserve multiple blank lines, add spaces between the newlines.
pt_br: :class:`RawTextHelpFormatter` mantém espaços em branco para todos os tipos de texto de ajuda, incluindo descrições de argumentos. No entanto, várias novas linhas são substituídas por uma. Se você deseja preservar várias linhas em branco, adicione espaços entre as novas linhas.

source: :class:`ArgumentDefaultsHelpFormatter` automatically adds information about default values to each of the argument help messages::
pt_br: :class:`ArgumentDefaultsHelpFormatter` adiciona automaticamente informações sobre os valores padrão para cada uma das mensagens de ajuda do argumento::

source: :class:`MetavarTypeHelpFormatter` uses the name of the type_ argument for each argument as the display name for its values (rather than using the dest_ as the regular formatter does)::
pt_br: :class:`MetavarTypeHelpFormatter` usa o nome de argumento type_ para cada argumento como o nome de exibição para seus valores (em vez de usar o dest_ como o formatador regular faz)::

source: Most command-line options will use ``-`` as the prefix, e.g. ``-f/--foo``. Parsers that need to support different or additional prefix characters, e.g. for options like ``+f`` or ``/foo``, may specify them using the ``prefix_chars=`` argument to the :class:`ArgumentParser` constructor::
pt_br: A maioria das opções de linha de comando usará ``-`` como prefixo, por exemplo, ``-f/--foo``. Analisadores sintáticos que precisam ter suporte a caracteres de prefixo diferentes ou adicionais, por exemplo, para opções como ``+f`` ou ``/foo``, podem especificá-las usando o argumento ``prefix_chars=`` para o construtor :class:`ArgumentParser`::

source: The ``prefix_chars=`` argument defaults to ``'-'``. Supplying a set of characters that does not include ``-`` will cause ``-f/--foo`` options to be disallowed.
pt_br: O argumento ``prefix_chars=`` é padronizado como ``'-'``. Fornecer um conjunto de caracteres que não inclua ``-`` fará com que as opções ``-f/--foo`` não sejam permitidas.
