Repository: python/python-docs-pt-br
Catalog: library/argparse.po
Languages: pt_br

source: Sometimes, when dealing with a particularly long argument list, it may make sense to keep the list of arguments in a file rather than typing it out at the command line. If the ``fromfile_prefix_chars=`` argument is given to the :class:`ArgumentParser` constructor, then arguments that start with any of the specified characters will be treated as files, and will be replaced by the arguments they contain. For example::
pt_br: Às vezes ao lidar com uma lista de argumentos particularmente longa, pode fazer sentido manter a lista de argumentos em um arquivo em vez de digitá-la na linha de comando. Se o argumento ``fromfile_prefix_chars=`` for dado ao construtor :class:`ArgumentParser`, então os argumentos que começam com qualquer um dos caracteres especificados serão tratados como arquivos e serão substituídos pelos argumentos que eles contêm. Por exemplo::

source: Arguments read from a file must be one per line by default (but see also :meth:`~ArgumentParser.convert_arg_line_to_args`) and are treated as if they were in the same place as the original file referencing argument on the command line. So in the example above, the expression ``['-f', 'foo', '@args.txt']`` is considered equivalent to the expression ``['-f', 'foo', '-f', 'bar']``.
pt_br: Por padrão, os argumentos lidos de um arquivo devem ser um por linha (mas veja também :meth:`~ArgumentParser.convert_arg_line_to_args`) e são tratados como se estivessem no mesmo lugar que o argumento original que faz referência ao arquivo na linha de comando. Portanto, no exemplo acima, a expressão ``['-f', 'foo', '@args.txt']`` é considerada equivalente à expressão ``['-f', 'foo', '-f', 'bar']``.

source: Empty lines are treated as empty strings (``''``), which are allowed as values but not as arguments. Empty lines that are read as arguments will result in an "unrecognized arguments" error.
pt_br: Linhas vazias são tratadas como strings vazias (``''``), que são permitidas como valores, mas não como argumentos. Linhas vazias lidas como argumentos resultarão em um erro de "unrecognized arguments" ("argumentos não reconhecidos").

source: :class:`ArgumentParser` uses :term:`filesystem encoding and error handler` to read the file containing arguments.
pt_br: :class:`ArgumentParser` usa :term:`tratador de erros e codificação do sistema de arquivos` para ler o arquivo que contém argumentos.

source: The ``fromfile_prefix_chars=`` argument defaults to ``None``, meaning that arguments will never be treated as file references.
pt_br: O argumento ``fromfile_prefix_chars=`` é padronizado como ``None``, significando que os argumentos nunca serão tratados como referências de arquivo.

source: :class:`ArgumentParser` changed encoding and errors to read arguments files from default (e.g. :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` and ``"strict"``) to the :term:`filesystem encoding and error handler`. Arguments file should be encoded in UTF-8 instead of ANSI Codepage on Windows.
pt_br: :class:`ArgumentParser` alterou a codificação e os erros para ler arquivos de argumentos do padrão (por exemplo, :func:`locale.getpreferredencoding(False) <locale.getpreferredencoding>` e ``"strict"``) para :term:`tratador de erros e codificação do sistema de arquivos`. O arquivo de argumentos deve ser codificado em UTF-8 em vez de página de código ANSI no Windows.

source: Generally, argument defaults are specified either by passing a default to :meth:`~ArgumentParser.add_argument` or by calling the :meth:`~ArgumentParser.set_defaults` methods with a specific set of name-value pairs. Sometimes however, it may be useful to specify a single parser-wide default for arguments. This can be accomplished by passing the ``argument_default=`` keyword argument to :class:`ArgumentParser`. For example, to globally suppress attribute creation on :meth:`~ArgumentParser.parse_args` calls, we supply ``argument_default=SUPPRESS``::
pt_br: Geralmente, os padrões dos argumentos são especificados passando um padrão para :meth:`~ArgumentParser.add_argument` ou chamando os métodos :meth:`~ArgumentParser.set_defaults` com um conjunto específico de pares nome-valor. Às vezes, no entanto, pode ser útil especificar um único padrão para todo o analisador para argumentos. Isso pode ser feito passando o argumento nomeado ``argument_default=`` para :class:`ArgumentParser`. Por exemplo, para suprimir globalmente a criação de atributos em chamadas :meth:`~ArgumentParser.parse_args`, fornecemos ``argument_default=SUPPRESS``::

source: Normally, when you pass an argument list to the :meth:`~ArgumentParser.parse_args` method of an :class:`ArgumentParser`, it :ref:`recognizes abbreviations <prefix-matching>` of long options.
pt_br: Normalmente, quando você passa uma lista de argumentos para o método :meth:`~ArgumentParser.parse_args` de um :class:`ArgumentParser`, ele :ref:`reconhece as abreviações <prefix-matching>` de opções longas.

source: This feature can be disabled by setting ``allow_abbrev`` to ``False``::
pt_br: Este recurso pode ser desabilitado configurando ``allow_abbrev`` para ``False``::

source: :class:`ArgumentParser` objects do not allow two actions with the same option string. By default, :class:`ArgumentParser` objects raise an exception if an attempt is made to create an argument with an option string that is already in use::
pt_br: Objetos :class:`ArgumentParser` não permitem duas ações com a mesma string de opções. Por padrão, objetos :class:`ArgumentParser` levantam uma exceção se for feita uma tentativa de criar um argumento com uma string de opção que já esteja em uso::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo', help='old foo help') >>> parser.add_argument('--foo', help='new foo help') Traceback (most recent call last): .. ArgumentError: argument --foo: conflicting option string(s): --foo
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-f', '--foo', help='ajuda antiga de foo') >>> parser.add_argument('--foo', help='nova ajuda de foo') Traceback (most recent call last): .. ArgumentError: argument --foo: conflicting option string(s): --foo

source: Sometimes (e.g. when using parents_) it may be useful to simply override any older arguments with the same option string. To get this behavior, the value ``'resolve'`` can be supplied to the ``conflict_handler=`` argument of :class:`ArgumentParser`::
pt_br: Às vezes (por exemplo, ao usar os parents_) pode ser útil simplesmente substituir quaisquer argumentos mais antigos com a mesma string de opções. Para obter este comportamento, o valor ``'resolve'`` pode ser fornecido ao argumento ``conflict_handler=`` de :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', conflict_handler='resolve') >>> parser.add_argument('-f', '--foo', help='old foo help') >>> parser.add_argument('--foo', help='new foo help') >>> parser.print_help() usage: PROG [-h] [-f FOO] [--foo FOO] options: -h, --help show this help message and exit -f FOO old foo help --foo FOO new foo help
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG', conflict_handler='resolve') >>> parser.add_argument('-f', '--foo', help='ajuda antiga de foo') >>> parser.add_argument('--foo', help='nova ajuda de foo') >>> parser.print_help() usage: PROG [-h] [-f FOO] [--foo FOO] options: -h, --help show this help message and exit -f FOO ajuda antiga de foo --foo FOO nova ajuda de foo

source: Note that :class:`ArgumentParser` objects only remove an action if all of its option strings are overridden. So, in the example above, the old ``-f/--foo`` action is retained as the ``-f`` action, because only the ``--foo`` option string was overridden.
pt_br: Observe que os objetos :class:`ArgumentParser` só removem uma ação se todas as suas strings de opção forem substituídas. Assim, no exemplo acima, a antiga ação ``-f/--foo`` é mantida como a ação ``-f``, porque apenas a string de opção ``--foo`` foi substituída.

source: By default, :class:`ArgumentParser` objects add an option which simply displays the parser's help message. If ``-h`` or ``--help`` is supplied at the command line, the :class:`!ArgumentParser` help will be printed.
pt_br: Por padrão, os objetos :class:`ArgumentParser` adicionam uma opção que simplesmente exibe a mensagem de ajuda do analisador sintático. Se ``-h`` ou ``--help`` for fornecido na linha de comando, a ajuda do :class:`!ArgumentParser` será exibida.

source: Occasionally, it may be useful to disable the addition of this help option. This can be achieved by passing ``False`` as the ``add_help=`` argument to :class:`ArgumentParser`::
pt_br: Às vezes, pode ser útil desabilitar o acréscimo desta opção de ajuda. Isto pode ser feito passando ``False`` como o argumento ``add_help=`` para a classe :class:`ArgumentParser`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> parser.add_argument('--foo', help='foo help') >>> parser.print_help() usage: PROG [--foo FOO] options: --foo FOO foo help
pt_br: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> parser.add_argument('--foo', help='ajuda de foo') >>> parser.print_help() usage: PROG [--foo FOO] options: --foo FOO ajuda de foo

source: The help option is typically ``-h/--help``. The exception to this is if the ``prefix_chars=`` is specified and does not include ``-``, in which case ``-h`` and ``--help`` are not valid options. In this case, the first character in ``prefix_chars`` is used to prefix the help options::
pt_br: A opção de ajuda é normalmente ``-h/--help``. A exceção a isso é se o ``prefix_chars=`` for especificado e não incluir ``-``, neste caso ``-h`` e ``--help`` não são opções válidas. Neste caso, o primeiro caractere em ``prefix_chars`` é usado para prefixar as opções de ajuda::

source: Normally, when you pass an invalid argument list to the :meth:`~ArgumentParser.parse_args` method of an :class:`ArgumentParser`, it will print a *message* to :data:`sys.stderr` and exit with a status code of 2.
pt_br: Normalmente, quando você passa uma lista de argumentos inválidos para o método :meth:`~ArgumentParser.parse_args` de uma instância de :class:`ArgumentParser`, ele vai exibir uma *message* para :data:`sys.stderr` e vai sair com o código de status de 2.

source: If the user would like to catch errors manually, the feature can be enabled by setting ``exit_on_error`` to ``False``::
pt_br: Se o usuário quiser detectar erros manualmente, o recurso pode ser habilitado configurando ``exit_on_error`` para ``False``::

source: >>> parser = argparse.ArgumentParser(exit_on_error=False) >>> parser.add_argument('--integers', type=int) _StoreAction(option_strings=['--integers'], dest='integers', nargs=None, const=None, default=None, type=<class 'int'>, choices=None, help=None, metavar=None) >>> try: ... parser.parse_args('--integers a'.split()) ... except argparse.ArgumentError: ... print('Catching an argumentError') ... Catching an argumentError
pt_br: >>> parser = argparse.ArgumentParser(exit_on_error=False) >>> parser.add_argument('--integers', type=int) _StoreAction(option_strings=['--integers'], dest='integers', nargs=None, const=None, default=None, type=<class 'int'>, choices=None, help=None, metavar=None) >>> try: ... parser.parse_args('--integers a'.split()) ... except argparse.ArgumentError: ... print('Capturando um argumentError') ... Capturando um argumentError

source: By default, when a user passes an invalid argument choice or subparser name, :class:`ArgumentParser` will exit with error info and list the permissible argument choices (if specified) or subparser names as part of the error message.
pt_br: Por padrão, quando um usuário passa uma escolha de argumento ou nome de subanalisador inválido, :class:`ArgumentParser` será encerrado com informações de erro e listará as escolhas de argumento permitidas (se especificado) ou nomes de subanalisadores como parte da mensagem de erro.

source: If the user would like to enable suggestions for mistyped argument choices and subparser names, the feature can be enabled by setting ``suggest_on_error`` to ``True``. Note that this only applies for arguments when the choices specified are strings::
pt_br: Se o usuário desejar habilitar sugestões para escolhas de argumentos e nomes de subanalisadores com erros de digitação, o recurso pode ser habilitado definindo ``suggest_on_error`` como ``True``. Observe que isso só se aplica a argumentos quando as opções especificadas são strings:

source: If you're writing code that needs to be compatible with older Python versions and want to opportunistically use ``suggest_on_error`` when it's available, you can set it as an attribute after initializing the parser instead of using the keyword argument::
pt_br: Se você estiver escrevendo um código que precisa ser compatível com versões mais antigas do Python e quiser usar oportunisticamente ``suggest_on_error`` quando estiver disponível, você pode defini-lo como um atributo após inicializar o analisador sintático em vez de usar o argumento nomeado::

source: color
pt_br: cor

source: By default, the help message is printed in color using `ANSI escape sequences <https://en.wikipedia.org/wiki/ANSI_escape_code>`__. If you want plain text help messages, you can disable this :ref:`in your local environment <using-on-controlling-color>`, or in the argument parser itself by setting ``color`` to ``False``::
pt_br: Por padrão, a mensagem de ajuda é impressa em cores usando `sequências de escape ANSI <https://en.wikipedia.org/wiki/ANSI_escape_code>`__. Se desejar mensagens de ajuda em texto simples, você pode desabilitar esta :ref:`no seu ambiente local <using-on-controlling-color>` ou no próprio analisador de argumentos, definindo ``color`` como ``False``::

source: The add_argument() method
pt_br: O método add_argument()

source: Define how a single command-line argument should be parsed. Each parameter has its own more detailed description below, but in short they are:
pt_br: Define como um único argumento de linha de comando deve ser analisado. Cada parâmetro tem sua própria descrição mais detalhada abaixo, mas resumidamente são eles:

source: `name or flags`_ - Either a name or a list of option strings, e.g. ``'foo'`` or ``'-f', '--foo'``.
pt_br: `name ou flags`_ - Um nome ou uma lista de strings de opções, por exemplo. ``'foo'`` ou ``'-f', '--foo'``.

source: action_ - The basic type of action to be taken when this argument is encountered at the command line.
pt_br: action_ - O tipo básico de ação a ser executada quando esse argumento é encontrado na linha de comando.

source: nargs_ - The number of command-line arguments that should be consumed.
pt_br: nargs_ - O número de argumentos de linha de comando que devem ser consumidos.

source: const_ - A constant value required by some action_ and nargs_ selections.
pt_br: const_ - Um valor constante exigido por algumas seleções action_ e nargs_.

source: default_ - The value produced if the argument is absent from the command line and if it is absent from the namespace object.
pt_br: default_ - O valor produzido se o argumento estiver ausente da linha de comando e se estiver ausente do objeto espaço de nomes.

source: type_ - The type to which the command-line argument should be converted.
pt_br: type_ - O tipo para o qual o argumento de linha de comando deve ser convertido.

source: choices_ - A sequence of the allowable values for the argument.
pt_br: choices_ - Uma sequência dos valores permitidos para o argumento.

source: required_ - Whether or not the command-line option may be omitted (optionals only).
pt_br: required_ - Se a opção de linha de comando pode ou não ser omitida (somente opcionais).

source: help_ - A brief description of what the argument does.
pt_br: help_ - Uma breve descrição do que o argumento faz.

source: metavar_ - A name for the argument in usage messages.
pt_br: metavar_ - Um nome para o argumento nas mensagens de uso.

source: dest_ - The name of the attribute to be added to the object returned by :meth:`parse_args`.
pt_br: dest_ - O nome do atributo a ser adicionado ao objeto retornado por :meth:`parse_args`.

source: deprecated_ - Whether or not use of the argument is deprecated.
pt_br: deprecated_ - Se o uso do argumento foi descontinuado ou não.

source: name or flags
pt_br: name ou flags

source: The :meth:`~ArgumentParser.add_argument` method must know whether an optional argument, like ``-f`` or ``--foo``, or a positional argument, like a list of filenames, is expected. The first arguments passed to :meth:`~ArgumentParser.add_argument` must therefore be either a series of flags, or a simple argument name.
pt_br: O método :meth:`~ArgumentParser.add_argument` deve saber se um argumento opcional, como ``-f`` ou ``--foo``, ou um argumento posicional, como uma lista de nomes de arquivos, é esperado. Os primeiros argumentos passados para :meth:`~ArgumentParser.add_argument` devem, portanto, ser uma série de sinalizadores ou um simples nome de argumento.

source: For example, an optional argument could be created like::
pt_br: Por exemplo, um argumento opcional poderia ser criado como::

source: while a positional argument could be created like::
pt_br: enquanto um argumento posicional pode ser criado como::

source: When :meth:`~ArgumentParser.parse_args` is called, optional arguments will be identified by the ``-`` prefix, and the remaining arguments will be assumed to be positional::
pt_br: Quando :meth:`~ArgumentParser.parse_args` é chamado, argumentos opcionais serão identificados pelo prefixo ``-``, e os argumentos restantes serão considerados posicionais::

source: By default, :mod:`!argparse` automatically handles the internal naming and display names of arguments, simplifying the process without requiring additional configuration. As such, you do not need to specify the dest_ and metavar_ parameters. The dest_ parameter defaults to the argument name with underscores ``_`` replacing hyphens ``-`` . The metavar_ parameter defaults to the upper-cased name. For example::
pt_br: Por padrão, :mod:`!argparse` lida automaticamente com a nomenclatura interna e os nomes de exibição dos argumentos, simplificando o processo sem exigir configuração adicional. Dessa forma, você não precisa especificar os parâmetros dest_ e metavar_. O parâmetro dest_ assume por padrão o nome do argumento com sublinhados ``_`` substituindo os hífens ``-``. O parâmetro metavar_ assume por padrão o nome em letras maiúsculas. Por exemplo:

source: :class:`ArgumentParser` objects associate command-line arguments with actions. These actions can do just about anything with the command-line arguments associated with them, though most actions simply add an attribute to the object returned by :meth:`~ArgumentParser.parse_args`. The ``action`` keyword argument specifies how the command-line arguments should be handled. The supplied actions are:
pt_br: Objetos :class:`ArgumentParser` associam argumentos de linha de comando com ações. Essas ações podem fazer praticamente qualquer coisa com os argumentos de linha de comando associados a elas, embora a maioria das ações simplesmente adicione um atributo ao objeto retornado por :meth:`~ArgumentParser.parse_args`. O argumento nomeado ``action`` especifica como os argumentos da linha de comando devem ser tratados. As ações fornecidas são:

source: ``'store'`` - This just stores the argument's value. This is the default action.
pt_br: ``'store'`` - Isso apenas armazena o valor do argumento. Esta é a ação padrão.

source: ``'store_const'`` - This stores the value specified by the const_ keyword argument; note that the const_ keyword argument defaults to ``None``. The ``'store_const'`` action is most commonly used with optional arguments that specify some sort of flag. For example::
pt_br: ``'store_const'`` - Isso armazena o valor especificado pelo argumento nomeado const_; observe que o argumento nomeado const_ tem como padrão ``None``. A ação ``'store_const'`` é mais comumente usada com argumentos opcionais que especificam algum tipo de sinalizador. Por exemplo::

source: ``'store_true'`` and ``'store_false'`` - These are special cases of ``'store_const'`` used for storing the values ``True`` and ``False`` respectively. In addition, they create default values of ``False`` and ``True`` respectively::
pt_br: ``'store_true'`` e ``'store_false'`` - Estes são casos especiais de ``'store_const'`` usados para armazenar os valores ``True`` e ``False`` respectivamente. Além disso, eles criam valores padrão de ``False`` e ``True`` respectivamente.

source: ``'append'`` - This stores a list, and appends each argument value to the list. It is useful to allow an option to be specified multiple times. If the default value is non-empty, the default elements will be present in the parsed value for the option, with any values from the command line appended after those default values. Example usage::
pt_br: ``'append'`` - Isso armazena uma lista e anexa cada valor de argumento à lista. É útil permitir que uma opção seja especificada várias vezes. Se o valor padrão não estiver vazio, os elementos padrão estarão presentes no valor analisado da opção, com quaisquer valores da linha de comando anexados após esses valores padrão. Exemplo de uso::

source: ``'append_const'`` - This stores a list, and appends the value specified by the const_ keyword argument to the list; note that the const_ keyword argument defaults to ``None``. The ``'append_const'`` action is typically useful when multiple arguments need to store constants to the same list. For example::
pt_br: ``'append_const'`` - Isso armazena uma lista e anexa o valor especificado pelo argumento nomeado const_ à lista; observe que o argumento nomeado const_ tem como padrão ``None``. A ação ``'append_const'`` é normalmente útil quando vários argumentos precisam armazenar constantes na mesma lista. Por exemplo::

source: ``'extend'`` - This stores a list and appends each item from the multi-value argument list to it. The ``'extend'`` action is typically used with the nargs_ keyword argument value ``'+'`` or ``'*'``. Note that when nargs_ is ``None`` (the default) or ``'?'``, each character of the argument string will be appended to the list. Example usage::
pt_br: ``'extend'`` - Isso armazena uma lista e anexa cada item da lista de argumentos multivalorada a ela. A ação ``'extend'`` é normalmente usada com o valor do argumento nomeado nargs_ ``'+'`` ou ``'*'``. Observe que quando nargs_ é ``None`` (o padrão) ou ``'?'``, cada caractere da string do argumento será anexado à lista. Exemplo de uso::

source: ``'count'`` - This counts the number of times a keyword argument occurs. For example, this is useful for increasing verbosity levels::
pt_br: ``'count'`` - Isso conta o número de vezes que um argumento nomeado ocorre. Por exemplo, isso é útil para aumentar os níveis de verbosidade::

source: Note, the *default* will be ``None`` unless explicitly set to *0*.
pt_br: Observe que o *padrão* será ``None``, a menos que seja explicitamente definido como *0*.

source: ``'help'`` - This prints a complete help message for all the options in the current parser and then exits. By default a help action is automatically added to the parser. See :class:`ArgumentParser` for details of how the output is created.
pt_br: ``'help'`` - Isso imprime uma mensagem de ajuda completa para todas as opções no analisador sintático atual e sai. Por padrão, uma ação de ajuda é adicionada automaticamente ao analisador sintático. Veja :class:`ArgumentParser` para detalhes de como a saída é criada.
