Repository: python/python-docs-pt-br
Catalog: library/array.po
Languages: pt_br

source: :mod:`array` --- Efficient arrays of numeric values
pt_br: :mod:`array`--- Vetores eficientes de valores numéricos

source: This module defines an object type which can compactly represent an array of basic values: characters, integers, floating point numbers. Arrays are sequence types and behave very much like lists, except that the type of objects stored in them is constrained. The type is specified at object creation time by using a :dfn:`type code`, which is a single character. The following type codes are defined:
pt_br: Esse módulo define um tipo de objeto que pode representar compactamente um vetor de valores básicos: caracteres, inteiros, números de ponto flutuante. Vetores são tipos de sequência e funcionam bem parecidamente com listas, porém o tipo dos objetos armazenados é restringido. O tipo é especificado na criação do objeto usando um :dfn:`código de tipo`, que é um único caractere. São definidos os seguintes códigos de tipo:

source: Type code
pt_br: Código de tipo

source: C Type
pt_br: Tipo em C

source: Python Type
pt_br: Tipo em Python

source: Minimum size in bytes
pt_br: Tamanho mínimo em bytes

source: Notes
pt_br: Notas

source: Unicode character
pt_br: Caractere unicode

source: float
pt_br: ponto flutuante

source: Notes:
pt_br: Notas:

source: The ``'u'`` type code corresponds to Python's obsolete unicode character (:c:type:`Py_UNICODE` which is :c:type:`wchar_t`). Depending on the platform, it can be 16 bits or 32 bits.
pt_br: O ``'u'`` corresponde ao obsoleto caractere unicode (:c:type:`Py_UNICODE` que é :c:type:`wchar_t`). Dependendo da plataforma, pode ser de 16 bits ou 32 bits.

source: ``'u'`` will be removed together with the rest of the :c:type:`Py_UNICODE` API.
pt_br: O ``'u'`` será removido junto com o resto da :c:type:`Py_UNICODE` API.

source: The actual representation of values is determined by the machine architecture (strictly speaking, by the C implementation). The actual size can be accessed through the :attr:`itemsize` attribute.
pt_br: A representação dos valores é definida pela arquitetura da máquina, mais especificamente da implementação do C. O tamanho real pode ser acessado pelo atributo :attr:`itemsize`.

source: The module defines the following type:
pt_br: O módulo define o seguinte tipo:

source: A new array whose items are restricted by *typecode*, and initialized from the optional *initializer* value, which must be a list, a :term:`bytes-like object`, or iterable over elements of the appropriate type.
pt_br: Um novo vetor cujos itens são restritos pelo *código de tipo* e inicializados pelo valor opcional *initializer*, que deve ser uma lista, um :term:`objeto byte ou similar <bytes-like object>`, ou outros elementos iteráveis do tipo apropriado.

source: If given a list or string, the initializer is passed to the new array's :meth:`fromlist`, :meth:`frombytes`, or :meth:`fromunicode` method (see below) to add initial items to the array. Otherwise, the iterable initializer is passed to the :meth:`extend` method.
pt_br: Se passado uma lista ou string, o inicializador é passado para os métodos :meth:`fromlist`, :meth:`frombytes`, ou :meth:`fromunicode` (ver abaixo) do novo vetor para adicionar itens iniciais ao vetor. Caso contrário, o inicializador iterável é passado para o método :meth:`extend`.

source: Raises an :ref:`auditing event <auditing>` ``array.__new__`` with arguments ``typecode``, ``initializer``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``array.__new__`` com os argumentos ``typecode``, ``initializer``.

source: A string with all available type codes.
pt_br: String com todos os códigos de tipo disponíveis.

source: Array objects support the ordinary sequence operations of indexing, slicing, concatenation, and multiplication. When using slice assignment, the assigned value must be an array object with the same type code; in all other cases, :exc:`TypeError` is raised. Array objects also implement the buffer interface, and may be used wherever :term:`bytes-like objects <bytes-like object>` are supported.
pt_br: Objetos array tem suporte para as operações de sequência comuns: indexação, fatiamento, concatenação, e multiplicação. Quando usando a atribuição de fatias, o valor associado deve ser um objeto array com o mesmo código de tipo; caso contrário, :exc:`TypeError` é levantada. Objetos array também implementam a interface buffer, e também podem ser usados em qualquer lugar onde :term:`objetos byte ou similar <bytes-like object>` é permitido.

source: The following data items and methods are also supported:
pt_br: Os seguintes itens e métodos também são suportados:

source: The typecode character used to create the array.
pt_br: O caractere typecode usado para criar o vetor.

source: The length in bytes of one array item in the internal representation.
pt_br: O tamanho em bytes de um item do vetor em representação interna.

source: Append a new item with value *x* to the end of the array.
pt_br: Adiciona um novo item com valor *x* ao final do vetor.

source: Return a tuple ``(address, length)`` giving the current memory address and the length in elements of the buffer used to hold array's contents. The size of the memory buffer in bytes can be computed as ``array.buffer_info()[1] * array.itemsize``. This is occasionally useful when working with low-level (and inherently unsafe) I/O interfaces that require memory addresses, such as certain :c:func:`ioctl` operations. The returned numbers are valid as long as the array exists and no length-changing operations are applied to it.
pt_br: Retorna uma tupla ``(address, length)`` com o endereço corrente da memória e o tamanho em elementos do buffer usado para armazenar conteúdos do vetor. O tamanho do buffer da memória em bytes pode ser computado como ``array.buffer_info()[1] * array.itemsize``. Isso é ocasionalmente útil quando se está trabalhando com interfaces I/O de baixo nível (inerentemente inseguras) que precisam de endereços de memória, como algumas operações :c:func:`ioctl`. Os números retornados são válidos enquanto o vetor existir e nenhuma operação de alteração de tamanho for aplicada a ele.

source: When using array objects from code written in C or C++ (the only way to effectively make use of this information), it makes more sense to use the buffer interface supported by array objects. This method is maintained for backward compatibility and should be avoided in new code. The buffer interface is documented in :ref:`bufferobjects`.
pt_br: Quando se está usando vetores de código escrito em C ou C++ (o único jeito efetivo de usar essa informação), faz mais sentido usar a interface do buffer suportada pelos vetores. Esse método é mantido para retrocompatibilidade e deve ser evitado em código novo. A interface de buffers está documentada em :ref:`bufferobjects`.

source: "Byteswap" all items of the array. This is only supported for values which are 1, 2, 4, or 8 bytes in size; for other types of values, :exc:`RuntimeError` is raised. It is useful when reading data from a file written on a machine with a different byte order.
pt_br: "Byteswap" todos os itens do vetor. Isso é somente suportado para valores de 1, 2, 4 ou 8 bytes de tamanho; para outros tipos de valores é levantada :exc:`RuntimeError` . Isso é útil quando estamos lendo dados de um arquivo para serem escritos em um arquivo de outra máquina de ordem de bytes diferente.

source: Return the number of occurrences of *x* in the array.
pt_br: Retorna a quantidade de ocorrências de *x* no vetor.

source: Append items from *iterable* to the end of the array. If *iterable* is another array, it must have *exactly* the same type code; if not, :exc:`TypeError` will be raised. If *iterable* is not an array, it must be iterable and its elements must be the right type to be appended to the array.
pt_br: Acrescenta os itens de *iterable* ao final do vetor. Se *iterable* for outro vetor, ele deve ter *exatamente* o mesmo código de tipo; senão, ocorrerá uma :exc:`TypeError`. Se *iterable* não for um vetor, ele deve ser iterável e seus elementos devem ser do tipo correto para ser acrescentado ao vetor.

source: Appends items from the string, interpreting the string as an array of machine values (as if it had been read from a file using the :meth:`fromfile` method).
pt_br: Adiciona itens da string, interpretando a string como um vetor (como se tivesse sido lido de um arquivo usando o método :meth:`fromfile`).

source: :meth:`fromstring` is renamed to :meth:`frombytes` for clarity.
pt_br: :meth:`fromstring` foi renomeado para :meth:`frombytes` para maior clareza.

source: Read *n* items (as machine values) from the :term:`file object` *f* and append them to the end of the array. If less than *n* items are available, :exc:`EOFError` is raised, but the items that were available are still inserted into the array.
pt_br: Lê *n* itens (como valores de máquinas) do :term:`objeto arquivo <file object>` *f* e adiciona-os ao fim do vetor. Se estão disponíveis menos de *n* itens, :exc:`EOFError` é levantada, mas os itens disponíveis ainda são inseridos ao final do vetor.

source: Append items from the list. This is equivalent to ``for x in list: a.append(x)`` except that if there is a type error, the array is unchanged.
pt_br: Adiciona itens de *list*. Isso é equivalente a ``for x in list: a.append(x)`` exceto que se ocorrer um errro de tipo, o vetor não é alterado.

source: Deprecated alias for :meth:`frombytes`.
pt_br: Alias deprecado para :meth:`frombytes`.

source: Extends this array with data from the given unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.frombytes(unicodestring.encode(enc))`` to append Unicode data to an array of some other type.
pt_br: Estende este vetor com os dados da strind unicode fornecida. O vetor deve ser do tipo ``'u'``; aso contrário uma :exc:`ValueError` será levantada. Use ``array.frombytes(unicodestring.encode(enc))`` para adicionar dados Unicode para um vetor de outros tipos de dados.

source: Return the smallest *i* such that *i* is the index of the first occurrence of *x* in the array.
pt_br: Retorna o menor *i* em que *i* é o índice da primeira ocorrência de *x* no vetor.

source: Insert a new item with value *x* in the array before position *i*. Negative values are treated as being relative to the end of the array.
pt_br: Insere um novo item com o *x* no vetor antes da posição *i*. Valores negativos são tratados como sendo em relação ao fim do vetor.

source: Removes the item with the index *i* from the array and returns it. The optional argument defaults to ``-1``, so that by default the last item is removed and returned.
pt_br: Remove o item com o índice *i* do vetor e retorna este item. O valor padrão do argumento é ``-1``, assim por padrão o último item é removido e retornado.

source: Remove the first occurrence of *x* from the array.
pt_br: Remove a primeira ocorrência de *x* do vetor.

source: Reverse the order of the items in the array.
pt_br: Inverte a ordem dos itens no vetor.

source: Convert the array to an array of machine values and return the bytes representation (the same sequence of bytes that would be written to a file by the :meth:`tofile` method.)
pt_br: Devolve os itens do vetor como um vetor de valores de máquina com a representação em bytes (a mesma sequência de bytes que seria escrita pelo método :meth:`tofile`.)

source: :meth:`tostring` is renamed to :meth:`tobytes` for clarity.
pt_br: :meth:`tostring` foi nomeada para :meth:`tobytes` para maior clareza.

source: Write all items (as machine values) to the :term:`file object` *f*.
pt_br: Escreve todos os itens (como valores de máquinas) para o :term:`objeto arquivo <file object>` *f*.

source: Convert the array to an ordinary list with the same items.
pt_br: Devolve os itens do vetor como uma lista comum.

source: Convert the array to a unicode string. The array must be a type ``'u'`` array; otherwise a :exc:`ValueError` is raised. Use ``array.tobytes().decode(enc)`` to obtain a unicode string from an array of some other type.
pt_br: Devolve os itens do vetor como uma string unicode. O vetor deve ser do tipo ``'u'``; caso contrário :exc:`ValueError` é levantada. Use ``array.tobytes().decode(enc)`` para obter uma string unicode de um vetor de outros tipos.

source: When an array object is printed or converted to a string, it is represented as ``array(typecode, initializer)``. The *initializer* is omitted if the array is empty, otherwise it is a string if the *typecode* is ``'u'``, otherwise it is a list of numbers. The string is guaranteed to be able to be converted back to an array with the same type and value using :func:`eval`, so long as the :class:`~array.array` class has been imported using ``from array import array``. Examples::
pt_br: Quando um vetor é exibido ou convertido para uma string, é representado como ``array(typecode, initializer)``. O *initializer* é omitido se o vetor estiver vazio, caso contrário será uma string se *typecode* for ``'u'``, se não será uma lista de números. É garantido que será possível uma conversão da string de volta para um vetor com o mesmo tipo e valor usando :func:`eval`, contanto que a classe :class:`~array.array` tenha sido importada usando ``from array import array``. Exemplos::

source: Module :mod:`struct`
pt_br: Módulo :mod:`struct`

source: Packing and unpacking of heterogeneous binary data.
pt_br: Empacotamento e desempacotamento de dados binários heterogêneos.

source: Module :mod:`xdrlib`
pt_br: Módulo :mod:`xdrlib`

source: Packing and unpacking of External Data Representation (XDR) data as used in some remote procedure call systems.
pt_br: Empacotamento e desempacotamento de dados External Data Representation (XDR) usados em alguns sistemas para chamada remota de procedimentos.

source: The Numeric Python extension (NumPy) defines another array type; see http://www.numpy.org/ for further information about Numerical Python.
pt_br: A extensão Numeric Python (NumPy) define outro tipo array; veja http://www.numpy.org/ para mais informações sobre Numerical Python.
