Repository: python/python-docs-pt-br
Catalog: library/asyncio-queue.po
Languages: pt_br

source: Queues
pt_br: Filas

source: **Source code:** :source:`Lib/asyncio/queues.py`
pt_br: **Código-fonte:** :source:`Lib/asyncio/queues.py`

source: asyncio queues are designed to be similar to classes of the :mod:`queue` module. Although asyncio queues are not thread-safe, they are designed to be used specifically in async/await code.
pt_br: Filas asyncio são projetadas para serem similar a classes do módulo :mod:`queue`. Apesar de filas asyncio não serem seguras para thread, elas são projetadas para serem usadas especificamente em código async/await.

source: Note that methods of asyncio queues don't have a *timeout* parameter; use :func:`asyncio.wait_for` function to do queue operations with a timeout.
pt_br: Perceba que métodos de filas asyncio não possuem um parâmetro *timeout*; use a função :func:`asyncio.wait_for` para realizar operações de fila com um tempo limite timeout.

source: See also the `Examples`_ section below.
pt_br: Veja também a seção `Exemplos`_ abaixo.

source: A first in, first out (FIFO) queue.
pt_br: Uma fila onde o primeiro a entrar, é o primeiro a sair (FIFO - First In First Out).

source: If *maxsize* is less than or equal to zero, the queue size is infinite. If it is an integer greater than ``0``, then ``await put()`` blocks when the queue reaches *maxsize* until an item is removed by :meth:`get`.
pt_br: Se *maxsize* for menor que ou igual a zero, o tamanho da fila é infinito. Se ele for um inteiro maior que ``0``, então ``await put()`` bloqueia quando a fila atingir *maxsize* até que um item seja removido por :meth:`get`.

source: Unlike the standard library threading :mod:`queue`, the size of the queue is always known and can be returned by calling the :meth:`qsize` method.
pt_br: Ao contrário da biblioteca padrão de threading :mod:`queue`, o tamanho da fila é sempre conhecido e pode ser obtido através da chamada do método :meth:`qsize`.

source: Removed the *loop* parameter.
pt_br: Removido o parâmetro *loop*.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
pt_br: Esta classe :ref:`não é segura para thread <asyncio-multithreading>`.

source: Number of items allowed in the queue.
pt_br: Número de itens permitidos na fila.

source: Return ``True`` if the queue is empty, ``False`` otherwise.
pt_br: Retorna ``True`` se a fila estiver vazia, ``False`` caso contrário.

source: Return ``True`` if there are :attr:`maxsize` items in the queue.
pt_br: Retorna ``True`` se existem :attr:`maxsize` itens na fila.

source: If the queue was initialized with ``maxsize=0`` (the default), then :meth:`full` never returns ``True``.
pt_br: Se a fila foi inicializada com ``maxsize=0`` (o padrão), então :meth:`full` nunca retorna ``True``.

source: Remove and return an item from the queue. If queue is empty, wait until an item is available.
pt_br: Remove e retorna um item da fila. Se a fila estiver vazia, aguarda até que um item esteja disponível.

source: Raises :exc:`QueueShutDown` if the queue has been shut down and is empty, or if the queue has been shut down immediately.
pt_br: Levanta :exc:`QueueShutDown` se a fila foi encerrada e está vazia, ou se a fila foi encerrada imediatamente.

source: Return an item if one is immediately available, else raise :exc:`QueueEmpty`.
pt_br: Retorna um item se houver um imediatamente disponível, caso contrário levanta :exc:`QueueEmpty`.

source: Block until all items in the queue have been received and processed.
pt_br: Bloqueia até que todos os itens na fila tenham sido recebidos e processados.

source: The count of unfinished tasks goes up whenever an item is added to the queue. The count goes down whenever a consumer coroutine calls :meth:`task_done` to indicate that the item was retrieved and all work on it is complete. When the count of unfinished tasks drops to zero, :meth:`join` unblocks.
pt_br: A contagem de tarefas inacabadas aumenta sempre que um item é adicionado à fila. A contagem diminui sempre que uma corrotina consumidora chama :meth:`task_done` para indicar que o item foi recuperado e todo o trabalho nele foi concluído. Quando a contagem de tarefas inacabadas chega a zero, :meth:`join` desbloqueia.

source: Put an item into the queue. If the queue is full, wait until a free slot is available before adding the item.
pt_br: Coloca um item na fila. Se a fila estiver cheia, aguarda até que uma posição livre esteja disponível antes de adicionar o item.

source: Raises :exc:`QueueShutDown` if the queue has been shut down.
pt_br: Levanta :exc:`QueueShutDown` se a fila foi encerrada.

source: Put an item into the queue without blocking.
pt_br: Coloca um item na fila sem bloqueá-la.

source: If no free slot is immediately available, raise :exc:`QueueFull`.
pt_br: Se nenhuma posição livre estiver imediatamente disponível, levanta :exc:`QueueFull`.

source: Return the number of items in the queue.
pt_br: Retorna o número de itens na fila.

source: Put a :class:`Queue` instance into a shutdown mode.
pt_br: Coloca uma instância de :class:`Queue` em modo de desligamento.

source: The queue can no longer grow. Future calls to :meth:`~Queue.put` raise :exc:`QueueShutDown`. Currently blocked callers of :meth:`~Queue.put` will be unblocked and will raise :exc:`QueueShutDown` in the formerly blocked thread.
pt_br: A fila não pode mais crescer. Chamadas futuras a :meth:`~Queue.put` levantarão :exc:`QueueShutDown`. Chamadores atualmente bloqueados de :meth:`~Queue.put` serão desbloqueados e levantarão :exc:`QueueShutDown` na thread anteriormente bloqueada.

source: If *immediate* is false (the default), the queue can be wound down normally with :meth:`~Queue.get` calls to extract tasks that have already been loaded.
pt_br: Se *immediate* for falso (o padrão), a fila pode ser encerrada normalmente com chamadas :meth:`~Queue.get` para extrair tarefas que já foram carregadas.

source: And if :meth:`~Queue.task_done` is called for each remaining task, a pending :meth:`~Queue.join` will be unblocked normally.
pt_br: E se :meth:`~Queue.task_done` for chamado para cada tarefa restante, um :meth:`~Queue.join` pendente será desbloqueado normalmente.

source: Once the queue is empty, future calls to :meth:`~Queue.get` will raise :exc:`QueueShutDown`.
pt_br: Assim que a fila estiver vazia, chamadas futuras para :meth:`~Queue.get` vão levantar :exc:`QueueShutDown`.

source: If *immediate* is true, the queue is terminated immediately. The queue is drained to be completely empty and the count of unfinished tasks is reduced by the number of tasks drained. If unfinished tasks is zero, callers of :meth:`~Queue.join` are unblocked. Also, blocked callers of :meth:`~Queue.get` are unblocked and will raise :exc:`QueueShutDown` because the queue is empty.
pt_br: Se *immediate* for verdadeiro, a fila é encerrada imediatamente. A fila é esvaziada completamente e a contagem de tarefas não concluídas é reduzida pelo número de tarefas concluídas. Se o número de tarefas não concluídas for zero, as chamadas de :meth:`~Queue.join` são desbloqueadas. Além disso, as chamadas bloqueadas de :meth:`~Queue.get` são desbloqueadas e levantarão uma exceção :exc:`QueueShutDown` porque a fila está vazia.

source: Use caution when using :meth:`~Queue.join` with *immediate* set to true. This unblocks the join even when no work has been done on the tasks, violating the usual invariant for joining a queue.
pt_br: Tenha cuidado ao usar :meth:`~Queue.join` com a opção *immediate* definida como verdadeiro. Isso desbloqueia a junção mesmo quando nenhuma tarefa foi executada, violando a invariante usual para a junção de uma fila.

source: Indicate that a formerly enqueued work item is complete.
pt_br: Indica que o item de trabalho anteriormente enfileirado está concluído.

source: Used by queue consumers. For each :meth:`~Queue.get` used to fetch a work item, a subsequent call to :meth:`task_done` tells the queue that the processing on the work item is complete.
pt_br: Usada por consumidores de fila. Para cada :meth:`~Queue.get` usado para buscar um item de trabalho, uma chamada subsequente para :meth:`task_done` avisa à fila, que o processamento no item de trabalho está concluído.

source: If a :meth:`join` is currently blocking, it will resume when all items have been processed (meaning that a :meth:`task_done` call was received for every item that had been :meth:`~Queue.put` into the queue).
pt_br: Se um :meth:`join` estiver sendo bloqueado no momento, ele irá continuar quando todos os itens tiverem sido processados (significando que uma chamada :meth:`task_done` foi recebida para cada item que foi chamado o método :meth:`~Queue.put` para colocar na fila).

source: Raises :exc:`ValueError` if called more times than there were items placed in the queue.
pt_br: Levanta :exc:`ValueError` se chamada mais vezes do que a quantidade de itens existentes na fila.

source: Priority Queue
pt_br: Fila de prioridade

source: A variant of :class:`Queue`; retrieves entries in priority order (lowest first).
pt_br: Uma variante de :class:`Queue`; recupera entradas em ordem de prioridade (mais baixas primeiro).

source: Entries are typically tuples of the form ``(priority_number, data)``.
pt_br: Entradas são tipicamente tuplas no formato ``(priority_number, data)``.

source: LIFO Queue
pt_br: Filas LIFO (último a entrar, primeiro a sair)

source: A variant of :class:`Queue` that retrieves most recently added entries first (last in, first out).
pt_br: Uma variante de :class:`Queue` que recupera as entradas adicionadas mais recentemente primeiro (último a entrar, primeiro a sair).

source: Exceptions
pt_br: Exceções

source: This exception is raised when the :meth:`~Queue.get_nowait` method is called on an empty queue.
pt_br: Esta exceção é levantada quando o método :meth:`~Queue.get_nowait` é chamado em uma fila vazia.

source: Exception raised when the :meth:`~Queue.put_nowait` method is called on a queue that has reached its *maxsize*.
pt_br: Exceção levantada quando o método :meth:`~Queue.put_nowait` é chamado em uma fila que atingiu seu *maxsize*.

source: Exception raised when :meth:`~Queue.put` or :meth:`~Queue.get` is called on a queue which has been shut down.
pt_br: Exceção levantada quando :meth:`~Queue.put` ou :meth:`~Queue.get` é chamado em uma fila que foi desligada.

source: Examples
pt_br: Exemplos

source: Queues can be used to distribute workload between several concurrent tasks::
pt_br: Filas podem ser usadas para distribuir cargas de trabalho entre diversas tarefas concorrentes::

source: import asyncio import random import time async def worker(name, queue): while True: # Get a "work item" out of the queue. sleep_for = await queue.get() # Sleep for the "sleep_for" seconds. await asyncio.sleep(sleep_for) # Notify the queue that the "work item" has been processed. queue.task_done() print(f'{name} has slept for {sleep_for:.2f} seconds') async def main(): # Create a queue that we will use to store our "workload". queue = asyncio.Queue() # Generate random timings and put them into the queue. total_sleep_time = 0 for _ in range(20): sleep_for = random.uniform(0.05, 1.0) total_sleep_time += sleep_for queue.put_nowait(sleep_for) # Create three worker tasks to process the queue concurrently. tasks = [] for i in range(3): task = asyncio.create_task(worker(f'worker-{i}', queue)) tasks.append(task) # Wait until the queue is fully processed. started_at = time.monotonic() await queue.join() total_slept_for = time.monotonic() - started_at # Cancel our worker tasks. for task in tasks: task.cancel() # Wait until all worker tasks are cancelled. await asyncio.gather(*tasks, return_exceptions=True) print('====') print(f'3 workers slept in parallel for {total_slept_for:.2f} seconds') print(f'total expected sleep time: {total_sleep_time:.2f} seconds') asyncio.run(main())
pt_br: import asyncio import random import time async def worker(nome, fila): while True: # Retira um "item de trabalho" da fila. dormir_por = await queue.get() # Dorme por "dormir_por" segundos. await asyncio.sleep(dormir_por) # Notifica a fila de que o "item de trabalho" foi processado. fila.task_done() print(f'{nome} dormiu por {dormir_por:.2f} segundos') async def main(): # Cria uma fila para armazenar nossa "carga de trabalho". fila = asyncio.Queue() # Gera tempos aleatórios e os insere na fila. tempo_total_de_sono = 0 for _ in range(20): dormir_por = random.uniform(0.05, 1.0) tempo_total_de_sono += dormir_por fila.put_nowait(dormir_por) # Cria três tarefas "worker" para processarem a fila concorrentemente. tarefas = [] for i in range(3): tarefa = asyncio.create_task(worker(f'worker-{i}', fila)) tarefas.append(tarefa) # Espera até a fila ser completamente processada. comecou_em = time.monotonic() await fila.join() tempo_dormido = time.monotonic() - comecou_em # Cancela nossas tarefas. for tarefa in tarefas: tarefa.cancel() # Espera até todas as tarefas serem canceladas. await asyncio.gather(*tarefas, return_exceptions=True) print('====') print(f'3 trabalhadoras dormiram em paralelo por {tempo_dormido:.2f} segundos') print(f'Tempo total de sono esperado: {tempo_total_de_sono:.2f} segundos') asyncio.run(main())
