Repository: python/python-docs-pt-br
Catalog: library/asyncio-api-index.po
Languages: pt_br

source: High-level API Index
pt_br: Índice da API de alto nível

source: This page lists all high-level async/await enabled asyncio APIs.
pt_br: Esta página lista todas as APIs asyncio de alto nível habilitadas por async/await.

source: Tasks
pt_br: Tarefas

source: Utilities to run asyncio programs, create Tasks, and await on multiple things with timeouts.
pt_br: Utilitários para rodar programas asyncio, criar Tasks, e esperar por múltiplas coisas com tempos limites.

source: Create event loop, run a coroutine, close the loop.
pt_br: Cria um loop de evento, roda uma corrotina, fecha o loop.

source: Start an asyncio Task.
pt_br: Inicia uma Task de asyncio.

source: Sleep for a number of seconds.
pt_br: Dorme for um número de segundos.

source: Schedule and wait for things concurrently.
pt_br: Agenda e espera pelas coisas concorrentemente.

source: Run with a timeout.
pt_br: Roda com um tempo limite.

source: Shield from cancellation.
pt_br: Proteger contra cancelamento.

source: Monitor for completion.
pt_br: Monitorar para for conclusão.

source: Return the current Task.
pt_br: Retorna para a Task atual.

source: Return all tasks for an event loop.
pt_br: Retorna todas as tasks para um loop de evento.

source: Task object.
pt_br: Objeto Task.

source: Schedule a coroutine from another OS thread.
pt_br: Agenda uma corrotina a partir de outra thread do sistema operacional.

source: Monitor for completion with a ``for`` loop.
pt_br: Monitora a conclusão com um loop ``for``.

source: Examples
pt_br: Exemplos

source: :ref:`Using asyncio.gather() to run things in parallel <asyncio_example_gather>`.
pt_br: :ref:`Usando asyncio.gather() para rodar coisas em paralelo <asyncio_example_gather>`.

source: :ref:`Using asyncio.wait_for() to enforce a timeout <asyncio_example_waitfor>`.
pt_br: :ref:`Usando asyncio.wait_for() para forçar um tempo limite de execução <asyncio_example_waitfor>`.

source: :ref:`Cancellation <asyncio_example_task_cancel>`.
pt_br: :ref:`Cancelamento <asyncio_example_task_cancel>`.

source: :ref:`Using asyncio.sleep() <asyncio_example_sleep>`.
pt_br: :ref:`Usando asyncio.sleep() <asyncio_example_sleep>`.

source: See also the main :ref:`Tasks documentation page <coroutine>`.
pt_br: Veja também a :ref:`página principal de documentação sobre Tasks <coroutine>`.

source: Queues
pt_br: Filas

source: Queues should be used to distribute work amongst multiple asyncio Tasks, implement connection pools, and pub/sub patterns.
pt_br: Filas devem ser usadas para distribuir trabalho entre múltiplos asyncio Tasks, implementar pools de conexão, e padrões pub/sub.

source: A FIFO queue.
pt_br: Uma fila FIFO - Primeiro que entra, é o primeiro que sai.

source: A priority queue.
pt_br: Uma fila de prioridade.

source: A LIFO queue.
pt_br: Uma fila LIFO - Último que entra, é o primeiro que sai.

source: :ref:`Using asyncio.Queue to distribute workload between several Tasks <asyncio_example_queue_dist>`.
pt_br: :ref:`Usando asyncio.Queue para distribuir cargas de trabalho entre diversas Tasks <asyncio_example_queue_dist>`.

source: See also the :ref:`Queues documentation page <asyncio-queues>`.
pt_br: Veja também a :ref:`Página de documentação da classe Queue <asyncio-queues>`.

source: Subprocesses
pt_br: Subprocesso

source: Utilities to spawn subprocesses and run shell commands.
pt_br: Utilitários para iniciar subprocessos e rodar commandos shell.

source: Create a subprocess.
pt_br: Cria um subprocesso.

source: Run a shell command.
pt_br: Executa um comando no console.

source: :ref:`Executing a shell command <asyncio_example_subprocess_shell>`.
pt_br: :ref:`Executando um comando no console <asyncio_example_subprocess_shell>`.

source: See also the :ref:`subprocess APIs <asyncio-subprocess>` documentation.
pt_br: Veja também a :ref:`documentação de subprocessos de APIs <asyncio-subprocess>`.

source: Streams
pt_br: Fluxos

source: High-level APIs to work with network IO.
pt_br: APIs de alto nível para trabalhar com entrada e saída de rede.

source: Establish a TCP connection.
pt_br: Estabelece uma conexão TCP.

source: Establish a Unix socket connection.
pt_br: Estabelece uma conexão com soquete Unix.

source: Start a TCP server.
pt_br: Inicia um servidor TCP.

source: Start a Unix socket server.
pt_br: Inicia um servidor com soquete Unix.

source: High-level async/await object to receive network data.
pt_br: Objeto async/await de alto nível para receber dados de rede.

source: High-level async/await object to send network data.
pt_br: Objeto async/await de alto nível para enviar dados pela rede.

source: :ref:`Example TCP client <asyncio_example_stream>`.
pt_br: :ref:`Exemplo de cliente TCP <asyncio_example_stream>`.

source: See also the :ref:`streams APIs <asyncio-streams>` documentation.
pt_br: Veja também a :ref:`documentação de fluxos APIs <asyncio-streams>`.

source: Synchronization
pt_br: Sincronização

source: Threading-like synchronization primitives that can be used in Tasks.
pt_br: Primitivas de sincronização similares a threads, que podem ser usadas em tarefas.

source: A mutex lock.
pt_br: Um bloqueio mutex.

source: An event object.
pt_br: Um objeto de evento.

source: A condition object.
pt_br: Um objeto de condição.

source: A semaphore.
pt_br: Um semáforo.

source: A bounded semaphore.
pt_br: Um semáforo limitado.

source: :ref:`Using asyncio.Event <asyncio_example_sync_event>`.
pt_br: :ref:`Usando asyncio.Event <asyncio_example_sync_event>`.

source: See also the documentation of asyncio :ref:`synchronization primitives <asyncio-sync>`.
pt_br: Veja também a documentação de ```asyncio :ref:`synchronization primitives <asyncio-sync>`.```

source: Exceptions
pt_br: Exceções

source: Raised on timeout by functions like :func:`wait_for`. Keep in mind that ``asyncio.TimeoutError`` is **unrelated** to the built-in :exc:`TimeoutError` exception.
pt_br: Levantado ao atingir o tempo limite de funções como :func:`wait_for`. Tenha em mente que ``asyncio.TimeoutError`` **não é relacionado** com a exceção :exc:`TimeoutError` embutida.

source: Raised when a Task is cancelled. See also :meth:`Task.cancel`.
pt_br: Levantado quanto a Task é cancelada. Veja também :meth:`Task.cancel`.

source: :ref:`Handling CancelledError to run code on cancellation request <asyncio_example_task_cancel>`.
pt_br: :ref:`Manipulando CancelledError para executar código no cancelamento de uma requisição <asyncio_example_task_cancel>`.

source: See also the full list of :ref:`asyncio-specific exceptions <asyncio-exceptions>`.
pt_br: Veja também a lista completa de :ref:`exceções específicas de asyncio <asyncio-exceptions>`.
