Repository: python/python-docs-pt-br
Catalog: library/asyncio.po
Languages: pt_br

source: High-level APIs
pt_br: APIs de alto nível

source: Low-level APIs
pt_br: APIs de baixo nível

source: Guides and Tutorials
pt_br: Guias e tutoriais

source: :mod:`!asyncio` --- Asynchronous I/O
pt_br: :mod:`!asyncio` --- E/S assíncrona

source: Hello World!
pt_br: Olá Mundo!

source: import asyncio async def main(): print('Hello ...') await asyncio.sleep(1) print('... World!') asyncio.run(main())
pt_br: import asyncio async def main(): print('Olá ...') await asyncio.sleep(1) print('... Mundo!') asyncio.run(main())

source: asyncio is a library to write **concurrent** code using the **async/await** syntax.
pt_br: asyncio é uma biblioteca para escrever código **simultâneo** usando a sintaxe **async/await**.

source: asyncio is used as a foundation for multiple Python asynchronous frameworks that provide high-performance network and web-servers, database connection libraries, distributed task queues, etc.
pt_br: O asyncio é usado como uma base para várias estruturas assíncronas do Python que fornecem rede e servidores web de alto desempenho, bibliotecas de conexão de banco de dados, filas de tarefas distribuídas etc.

source: asyncio is often a perfect fit for IO-bound and high-level **structured** network code.
pt_br: asyncio geralmente serve perfeitamente para código de rede **estruturado** de alto nível e vinculado a E/S.

source: Explanation of the fundamentals of asyncio.
pt_br: Explicação dos fundamentos do asyncio.

source: asyncio provides a set of **high-level** APIs to:
pt_br: asyncio fornece um conjunto de APIs de **alto nível** para:

source: :ref:`run Python coroutines <coroutine>` concurrently and have full control over their execution;
pt_br: :ref:`executar corrotinas do Python <coroutine>` simultaneamente e ter controle total sobre sua execução;

source: perform :ref:`network IO and IPC <asyncio-streams>`;
pt_br: realizar :ref:`IPC e E/S de rede <asyncio-streams>`;

source: control :ref:`subprocesses <asyncio-subprocess>`;
pt_br: controlar :ref:`subprocessos <asyncio-subprocess>`;

source: distribute tasks via :ref:`queues <asyncio-queues>`;
pt_br: distribuir tarefas por meio de :ref:`filas <asyncio-queues>`;

source: :ref:`synchronize <asyncio-sync>` concurrent code;
pt_br: :ref:`sincronizar <asyncio-sync>` código simultâneo;

source: Additionally, there are **low-level** APIs for *library and framework developers* to:
pt_br: Além disso, há APIs de **baixo nível** para *desenvolvedores de biblioteca e framework* para:

source: create and manage :ref:`event loops <asyncio-event-loop>`, which provide asynchronous APIs for :ref:`networking <loop_create_server>`, running :ref:`subprocesses <loop_subprocess_exec>`, handling :ref:`OS signals <loop_add_signal_handler>`, etc;
pt_br: criar e gerenciar :ref:`laços de eventos <asyncio-event-loop>`, que fornecem APIs assíncronas para :ref:`rede <loop_create_server>`, execução de :ref:`subprocessos <loop_subprocess_exec>`, tratamento de :ref:`sinais de sistemas operacionais <loop_add_signal_handler>` etc;

source: implement efficient protocols using :ref:`transports <asyncio-transports-protocols>`;
pt_br: implementar protocolos eficientes usando :ref:`transportes <asyncio-transports-protocols>`;

source: :ref:`bridge <asyncio-futures>` callback-based libraries and code with async/await syntax.
pt_br: :ref:`fazer uma ponte <asyncio-futures>` sobre bibliotecas baseadas em chamadas e codificar com a sintaxe de async/await.

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: asyncio REPL
pt_br: REPL de asyncio

source: You can experiment with an ``asyncio`` concurrent context in the :term:`REPL`:
pt_br: Você pode experimentar um contexto atual ``asyncio`` no :term:`REPL`:

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_stdin`` with no arguments.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``cpython.run_stdin`` sem argumentos.

source: (also 3.11.10, 3.10.15, 3.9.20, and 3.8.20) Emits audit events.
pt_br: (também 3.11.10, 3.10.15, 3.9.20 e 3.8.20) Emite eventos de auditoria.

source: Uses PyREPL if possible, in which case :envvar:`PYTHONSTARTUP` is also executed. Emits audit events.
pt_br: Usa PyrePL, se possível, nesse caso :envvar:`PYTHONSTARTUP` também é executado. Emite eventos de auditoria.

source: Reference
pt_br: Referência

source: The source code for asyncio can be found in :source:`Lib/asyncio/`.
pt_br: O código-fonte para o asyncio pode ser encontrado em :source:`Lib/asyncio/`.
