Repository: python/python-docs-pt-br
Catalog: library/asyncio-eventloop.po
Languages: pt_br

source: Event Loop
pt_br: Laço de Eventos

source: **Source code:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`
pt_br: **Código-fonte:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`

source: Preface
pt_br: Prefácio

source: The event loop is the core of every asyncio application. Event loops run asynchronous tasks and callbacks, perform network IO operations, and run subprocesses.
pt_br: O laço de eventos é o núcleo de toda aplicação asyncio. Laços de eventos executam tarefas e funções de retorno assíncronas, realizam operações de entrada e saída e executam subprocessos.

source: Application developers should typically use the high-level asyncio functions, such as :func:`asyncio.run`, and should rarely need to reference the loop object or call its methods. This section is intended mostly for authors of lower-level code, libraries, and frameworks, who need finer control over the event loop behavior.
pt_br: Os desenvolvedores de aplicação normalmente devem usar as funções asyncio de alto nível, como :func:`asyncio.run`, e devem raramente precisar fazer referência ao objeto de loop ou chamar seus métodos. Esta seção destina-se principalmente a autores de código de baixo nível, bibliotecas e frameworks, que precisam de um controle mais preciso sobre o comportamento do laço de evento.

source: Obtaining the Event Loop
pt_br: Obtendo o laço de eventos

source: The following low-level functions can be used to get, set, or create an event loop:
pt_br: As seguintes funções baixo nível podem ser usadas para obter, definir, ou criar um laço de eventos:

source: Return the running event loop in the current OS thread.
pt_br: Retorna o laço de eventos em execução na thread atual do sistema operacional.

source: Raise a :exc:`RuntimeError` if there is no running event loop.
pt_br: Levanta uma :exc:`RuntimeError` se não houver nenhum laço de eventos em execução.

source: This function can only be called from a coroutine or a callback.
pt_br: Esta função só pode ser chamada a partir de uma corrotina ou de um retorno de chamada.

source: Get the current event loop.
pt_br: Obtém o laço de eventos atual.

source: When called from a coroutine or a callback (e.g. scheduled with call_soon or similar API), this function will always return the running event loop.
pt_br: Quando chamada de uma corrotina ou função de retorno (por exemplo, agendada com call_soon ou API semelhante), esta função sempre retornará o laço de eventos em execução.

source: If there is no running event loop set, the function will return the result of the ``get_event_loop_policy().get_event_loop()`` call.
pt_br: Se não houver nenhum laço de eventos em execução definido, a função retornará o resultado da chamada ``get_event_loop_policy().get_event_loop()``.

source: Because this function has rather complex behavior (especially when custom event loop policies are in use), using the :func:`get_running_loop` function is preferred to :func:`get_event_loop` in coroutines and callbacks.
pt_br: Devido ao fato desta função ter um comportamento particularmente complexo (especialmente quando políticas de laço de eventos customizadas estão sendo usadas), usar a função :func:`get_running_loop` é preferido ao invés de :func:`get_event_loop` em corrotinas e funções de retorno.

source: As noted above, consider using the higher-level :func:`asyncio.run` function, instead of using these lower level functions to manually create and close an event loop.
pt_br: Como observado acima, considere usar também a função de alto nível :func:`asyncio.run` ao invés de usar funções de baixo nível para manualmente criar e fechar um laço de eventos.

source: Set *loop* as the current event loop for the current OS thread.
pt_br: Define *loop* como o laço de eventos atual para a thread atual do sistema operacional.

source: Create and return a new event loop object.
pt_br: Cria e retorna um novo objeto de laço de eventos.

source: Note that the behaviour of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop` functions can be altered by :ref:`setting a custom event loop policy <asyncio-policies>`.
pt_br: Perceba que o comportamento das funções :func:`get_event_loop`, :func:`set_event_loop`, e :func:`new_event_loop` podem ser alteradas :ref:`definindo uma política de laço de eventos customizada <asyncio-policies>`.

source: Contents
pt_br: Conteúdo

source: This documentation page contains the following sections:
pt_br: Esta página de documentação contém as seguintes seções:

source: The `Event Loop Methods`_ section is the reference documentation of the event loop APIs;
pt_br: A seção `Métodos do laço de eventos`_ é a documentação de referência das APIs de laço de eventos;

source: The `Callback Handles`_ section documents the :class:`Handle` and :class:`TimerHandle` instances which are returned from scheduling methods such as :meth:`loop.call_soon` and :meth:`loop.call_later`;
pt_br: A seção `Tratadores de função de retorno`_ documenta as instâncias das classes :class:`Handle` e :class:`TimerHandle`, que são retornadas por métodos de agendamento tais como :meth:`loop.call_soon` e :meth:`loop.call_later`;

source: The `Server Objects`_ section documents types returned from event loop methods like :meth:`loop.create_server`;
pt_br: A seção `Objetos Server`_ documenta tipos retornados a partir de métodos de laço de eventos, como :meth:`loop.create_server`;

source: The `Event Loop Implementations`_ section documents the :class:`SelectorEventLoop` and :class:`ProactorEventLoop` classes;
pt_br: A seção `Implementações do Laço de Eventos`_ documenta as classes :class:`SelectorEventLoop` e :class:`ProactorEventLoop`;

source: The `Examples`_ section showcases how to work with some event loop APIs.
pt_br: A seção `Exemplos`_ demonstra como trabalhar com algumas APIs do laço de eventos APIs.

source: Event Loop Methods
pt_br: Métodos do laço de eventos

source: Event loops have **low-level** APIs for the following:
pt_br: Laços de eventos possuem APIs de **baixo nível** para as seguintes situações:

source: Running and stopping the loop
pt_br: Executar e interromper o laço

source: Run until the *future* (an instance of :class:`Future`) has completed.
pt_br: Executar até que o *future* (uma instância da classe :class:`Future`) seja completada.

source: If the argument is a :ref:`coroutine object <coroutine>` it is implicitly scheduled to run as a :class:`asyncio.Task`.
pt_br: Se o argumento é um :ref:`objeto corrotina <coroutine>`, ele é implicitamente agendado para executar como uma :class:`asyncio.Task`.

source: Return the Future's result or raise its exception.
pt_br: Retorna o resultado do Future ou levanta sua exceção.

source: Run the event loop until :meth:`stop` is called.
pt_br: Executa o laço de eventos até que :meth:`stop` seja chamado.

source: If :meth:`stop` is called while :meth:`run_forever` is running, the loop will run the current batch of callbacks and then exit. Note that new callbacks scheduled by callbacks will not run in this case; instead, they will run the next time :meth:`run_forever` or :meth:`run_until_complete` is called.
pt_br: Se :meth:`stop` for chamado enquanto :meth:`run_forever` estiver executando, o laço irá executar o lote atual de funções de retorno e então sair. Perceba que novas funções de retorno agendadas por funções de retorno não serão executadas neste caso; ao invés disso, elas serão executadas na próxima vez que :meth:`run_forever` ou :meth:`run_until_complete` forem chamadas.

source: Stop the event loop.
pt_br: Para o laço de eventos.

source: Return ``True`` if the event loop is currently running.
pt_br: Retorna ``True`` se o laço de eventos estiver em execução.

source: Return ``True`` if the event loop was closed.
pt_br: Retorna ``True`` se o laço de eventos foi fechado.

source: Close the event loop.
pt_br: Fecha o laço de eventos.

source: The loop must not be running when this function is called. Any pending callbacks will be discarded.
pt_br: O laço não deve estar em execução quando esta função for chamada. Qualquer função de retorno pendente será descartada.

source: This method clears all queues and shuts down the executor, but does not wait for the executor to finish.
pt_br: Este método limpa todas as filas e desliga o executor, mas não aguarda pelo encerramento do executor.

source: This method is idempotent and irreversible. No other methods should be called after the event loop is closed.
pt_br: Este método é idempotente e irreversível. Nenhum outro método deve ser chamado depois que o laço de eventos esteja fechado.

source: Note that there is no need to call this function when :func:`asyncio.run` is used.
pt_br: Perceba que não é necessário chamar esta função quando :func:`asyncio.run` for usado.

source: Example::
pt_br: Exemplo::

source: Schedule the closure of the default executor and wait for it to join all of the threads in the :class:`~concurrent.futures.ThreadPoolExecutor`. Once this method has been called, using the default executor with :meth:`loop.run_in_executor` will raise a :exc:`RuntimeError`.
pt_br: Agenda o encerramento do executor padrão e aguarda ele se juntar a todas as threads no :class:`~concurrent.futures.ThreadPoolExecutor`. Uma vez que este método tenha sido chamado, usar o executor padrão com :meth:`loop.run_in_executor` levantará um :exc:`RuntimeError`.

source: The *timeout* parameter specifies the amount of time (in :class:`float` seconds) the executor will be given to finish joining. With the default, ``None``, the executor is allowed an unlimited amount of time.
pt_br: O parâmetro *timeout* especifica a quantidade de tempo (em :class:`float` segundos) que o executor terá para terminar a junção. Com o padrão ``None``, o executor tem permissão para um período de tempo ilimitado.

source: If the *timeout* is reached, a :exc:`RuntimeWarning` is emitted and the default executor is terminated without waiting for its threads to finish joining.
pt_br: Se o *timeout* for atingido, uma exceção :exc:`RuntimeWarning` será emitida e o executor padrão será finalizado sem esperar que suas threads terminem a junção.

source: Scheduling callbacks
pt_br: Agendando funções de retorno

source: Schedule the *callback* :term:`callback` to be called with *args* arguments at the next iteration of the event loop.
pt_br: Agenda a *função de retorno* :term:`callback` para ser chamada com argumentos *args* na próxima iteração do laço de eventos.

source: Callbacks are called in the order in which they are registered. Each callback will be called exactly once.
pt_br: Funções de retorno são chamadas na ordem em que elas foram registradas. Cada função de retorno será chamada exatamente uma vez.

source: Raises :exc:`RuntimeError` if called on a loop that's been closed. This can happen on a secondary thread when the main application is shutting down.
pt_br: Levanta :exc:`RuntimeError` se chamado em um laço que já foi fechado. Isto pode acontecer em uma thread secundária quando a aplicação principal estiver desligando.

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
pt_br: Veja a seção :ref:`concorrência e multithreading <asyncio-multithreading>` da documentação.

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
pt_br: O parâmetro somente-nomeado *context* foi adicionado. Veja :pep:`567` para mais detalhes.

source: Most :mod:`asyncio` scheduling functions don't allow passing keyword arguments. To do that, use :func:`functools.partial`::
pt_br: Maior parte das funções de agendamento :mod:`asyncio` não permite passar argumentos nomeados. Para fazer isso, use :func:`functools.partial`::

source: Using partial objects is usually more convenient than using lambdas, as asyncio can render partial objects better in debug and error messages.
pt_br: Usar objetos parciais é usualmente mais conveniente que usar lambdas, pois asyncio pode renderizar objetos parciais melhor durante debug e mensagens de erro.

source: Scheduling delayed callbacks
pt_br: Agendando funções de retorno atrasadas

source: Event loop provides mechanisms to schedule callback functions to be called at some point in the future. Event loop uses monotonic clocks to track time.
pt_br: Laço de eventos fornece mecanismos para agendar funções de retorno para serem chamadas em algum ponto no futuro. Laço de eventos usa relógios monotônico para acompanhar o tempo.

source: Schedule *callback* to be called after the given *delay* number of seconds (can be either an int or a float).
pt_br: Agenda *callback* para ser chamada após o *delay* número de segundos fornecido (pode ser um inteiro ou um ponto flutuante).

source: An instance of :class:`asyncio.TimerHandle` is returned which can be used to cancel the callback.
pt_br: Uma instância de :class:`asyncio.TimerHandle` é retornada, a qual pode ser usada para cancelar a função de retorno.

source: *callback* will be called exactly once. If two callbacks are scheduled for exactly the same time, the order in which they are called is undefined.
pt_br: *callback* será chamada exatamente uma vez. Se duas funções de retorno são agendadas para exatamente o mesmo tempo, a ordem na qual elas são chamadas é indefinida.

source: The optional positional *args* will be passed to the callback when it is called. If you want the callback to be called with keyword arguments use :func:`functools.partial`.
pt_br: O *args* posicional opcional será passado para a função de retorno quando ela for chamada. Se você quiser que a função de retorno seja chamada com argumentos nomeados, use :func:`functools.partial`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
pt_br: Um argumento opcional somente-nomeado *context* permite especificar um :class:`contextvars.Context` customizado para executar na *função de retorno*. O contexto atual é usado quando nenhum *context* é fornecido.

source: In Python 3.7 and earlier with the default event loop implementation, the *delay* could not exceed one day. This has been fixed in Python 3.8.
pt_br: No Python 3.7 e anterior, com a implementação padrão do laço de eventos, o *delay* não poderia exceder um dia. Isto foi ajustado no Python 3.8.

source: Schedule *callback* to be called at the given absolute timestamp *when* (an int or a float), using the same time reference as :meth:`loop.time`.
pt_br: Agenda *callback* para ser chamada no timestamp absoluto fornecido *when* (um inteiro ou um ponto flutuante), usando o mesmo horário de referência que :meth:`loop.time`.

source: This method's behavior is the same as :meth:`call_later`.
pt_br: O comportamento deste método é o mesmo que :meth:`call_later`.

source: In Python 3.7 and earlier with the default event loop implementation, the difference between *when* and the current time could not exceed one day. This has been fixed in Python 3.8.
pt_br: No Python 3.7 e anterior, com a implementação padrão do laço de eventos, a diferença entre *when* e o horário atual não poderia exceder um dia. Isto foi ajustado no Python 3.8.

source: Return the current time, as a :class:`float` value, according to the event loop's internal monotonic clock.
pt_br: Retorna o horário atual, como um valor :class:`float`, de acordo com o relógio monotônico interno do laço de eventos.

source: In Python 3.7 and earlier timeouts (relative *delay* or absolute *when*) should not exceed one day. This has been fixed in Python 3.8.
pt_br: No Python 3.7 e anterior, tempos limites (*delay* relativo ou *when* absoluto) não poderiam exceder um dia. Isto foi ajustado no Python 3.8.

source: The :func:`asyncio.sleep` function.
pt_br: A função :func:`asyncio.sleep`.

source: Creating Futures and Tasks
pt_br: Criando Futures e Tasks

source: Create an :class:`asyncio.Future` object attached to the event loop.
pt_br: Cria um objeto :class:`asyncio.Future` atachado ao laço de eventos.

source: This is the preferred way to create Futures in asyncio. This lets third-party event loops provide alternative implementations of the Future object (with better performance or instrumentation).
pt_br: Este é o modo preferido para criar Futures em asyncio. Isto permite que laços de eventos de terceiros forneçam implementações alternativas do objeto Future (com melhor desempenho ou instrumentação).

source: Third-party event loops can use their own subclass of :class:`Task` for interoperability. In this case, the result type is a subclass of :class:`Task`.
pt_br: Laços de eventos de terceiros podem usar suas próprias subclasses de :class:`Task` para interoperabilidade. Neste caso, o tipo do resultado é uma subclasse de :class:`Task`.

source: If the *name* argument is provided and not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
pt_br: Se o argumento *name* for fornecido e não é ``None``, ele é definido como o nome da tarefa, usando :meth:`Task.set_name`.

source: Added the *name* parameter.
pt_br: Adicionado o parâmetro *name*.

source: Added the *context* parameter.
pt_br: Adicionado o parâmetro *context*.

source: Set a task factory that will be used by :meth:`loop.create_task`.
pt_br: Define a factory da tarefa que será usada por :meth:`loop.create_task`.

source: Return a task factory or ``None`` if the default one is in use.
pt_br: Retorna uma factory de tarefa ou ``None`` se a factory padrão estiver em uso.

source: Opening network connections
pt_br: Abrindo conexões de rede

source: Open a streaming transport connection to a given address specified by *host* and *port*.
pt_br: Abre uma conexão de transporte para streaming, para um endereço fornecido, especificado por *host* e *port*.

source: *protocol_factory* must be a callable returning an :ref:`asyncio protocol <asyncio-protocol>` implementation.
pt_br: *protocol_factory* deve ser um chamável que retorne uma implementação do :ref:`protocolo asyncio <asyncio-protocol>`.

source: This method will try to establish the connection in the background. When successful, it returns a ``(transport, protocol)`` pair.
pt_br: Este método tentará estabelecer a conexão em segundo plano. Quando tiver sucesso, ele retorna um par ``(transport, protocol)``.

source: The chronological synopsis of the underlying operation is as follows:
pt_br: A sinopse cronológica da operação subjacente é conforme abaixo:

source: The connection is established and a :ref:`transport <asyncio-transport>` is created for it.
pt_br: A conexão é estabelecida e um :ref:`transporte <asyncio-transport>` é criado para ela.

source: *protocol_factory* is called without arguments and is expected to return a :ref:`protocol <asyncio-protocol>` instance.
pt_br: *protocol_factory* é chamada sem argumentos e é esperada que retorne uma instância de :ref:`protocolo <asyncio-protocol>`.

source: The protocol instance is coupled with the transport by calling its :meth:`~BaseProtocol.connection_made` method.
pt_br: A instância de protocolo é acoplada com o transporte, através da chamada do seu método :meth:`~BaseProtocol.connection_made`.

source: A ``(transport, protocol)`` tuple is returned on success.
pt_br: Uma tupla ``(transport, protocol)`` é retornada ao ter sucesso.

source: The created transport is an implementation-dependent bidirectional stream.
pt_br: O transporte criado é um stream bi-direcional dependente de implementação.

source: Other arguments:
pt_br: Outros argumentos:

source: *ssl*: if given and not false, a SSL/TLS transport is created (by default a plain TCP transport is created). If *ssl* is a :class:`ssl.SSLContext` object, this context is used to create the transport; if *ssl* is :const:`True`, a default context returned from :func:`ssl.create_default_context` is used.
pt_br: *ssl*: se fornecido e não for falso, um transporte SSL/TLS é criado (por padrão um transporte TCP simples é criado). Se *ssl* for um objeto :class:`ssl.SSLContext`, este contexto é usado para criar o transporte; se *ssl* for :const:`True`, um contexto padrão retornado de :func:`ssl.create_default_context` é usado.

source: :ref:`SSL/TLS security considerations <ssl-security>`
pt_br: :ref:`Considerações de segurança sobre SSL/TLS <ssl-security>`

source: *server_hostname* sets or overrides the hostname that the target server's certificate will be matched against. Should only be passed if *ssl* is not ``None``. By default the value of the *host* argument is used. If *host* is empty, there is no default and you must pass a value for *server_hostname*. If *server_hostname* is an empty string, hostname matching is disabled (which is a serious security risk, allowing for potential man-in-the-middle attacks).
pt_br: *server_hostname* define ou substitui o hostname que o certificado do servidor de destino será pareado contra. Deve ser passado apenas se *ssl* não for ``None``. Por padrão o valor do argumento *host* é usado. Se *host* for vazio, não existe valor padrão e você deve passar um valor para *server_hostname*. Se *server_hostname* for uma string vazia, o pareamento de hostname é desabilitado (o que é um risco de segurança sério, permitindo ataques potenciais man-in-the-middle).

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to getaddrinfo() for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
pt_br: *family*, *proto*, *flags* são os endereços familiares, protocolos e sinalizadores opcionais a serem passados por getaddrinfo() para resolução do *host*. Se fornecidos, eles devem ser todos inteiros e constantes correspondentes do módulo :mod:`socket`.

source: *happy_eyeballs_delay*, if given, enables Happy Eyeballs for this connection. It should be a floating-point number representing the amount of time in seconds to wait for a connection attempt to complete, before starting the next attempt in parallel. This is the "Connection Attempt Delay" as defined in :rfc:`8305`. A sensible default value recommended by the RFC is ``0.25`` (250 milliseconds).
pt_br: *happy_eyeballs_delay*, se fornecido, habilita Happy Eyeballs para esta conexão. Ele deve ser um número de ponto flutuante representando o tempo em segundos para aguardar uma tentativa de conexão encerrar, antes de começar a próxima tentativa em paralelo. Este é o "Atraso na tentativa de conexão" conforme definido na :rfc:`8305`. Um valor padrão sensível recomendado pela RFC é ``0.25`` (250 millisegundos).

source: *interleave* controls address reordering when a host name resolves to multiple IP addresses. If ``0`` or unspecified, no reordering is done, and addresses are tried in the order returned by :meth:`getaddrinfo`. If a positive integer is specified, the addresses are interleaved by address family, and the given integer is interpreted as "First Address Family Count" as defined in :rfc:`8305`. The default is ``0`` if *happy_eyeballs_delay* is not specified, and ``1`` if it is.
pt_br: *interleave* controla o reordenamento de endereços quando um nome de servidor resolve para múltiplos endereços IP. Se ``0`` ou não especificado, nenhum reordenamento é feito, e endereços são tentados na ordem retornada por :meth:`getaddrinfo`. Se um inteiro positivo for especificado, os endereços são intercalados por um endereço familiar, e o inteiro fornecido é interpretado como "Contagem da família do primeiro endereço" conforme definido na :rfc:`8305`. O padrão é ``0`` se *happy_eyeballs_delay* não for especificado, e ``1`` se ele for.
