Repository: python/python-docs-pt-br
Catalog: library/asyncio-task.po
Languages: pt_br

source: The coroutine then has a chance to clean up or even deny the request by suppressing the exception with a :keyword:`try` ... ... ``except CancelledError`` ... :keyword:`finally` block. Therefore, unlike :meth:`Future.cancel`, :meth:`Task.cancel` does not guarantee that the Task will be cancelled, although suppressing cancellation completely is not common and is actively discouraged. Should the coroutine nevertheless decide to suppress the cancellation, it needs to call :meth:`Task.uncancel` in addition to catching the exception.
pt_br: Затем сопрограмма имеет возможность очистить или даже отклонить запрос, подавив исключение с помощью блока :keyword:`try` ... ... ``кроме CancelledError`` ... :keyword:`finally`. Таким образом, в отличие от :meth:`Future.cancel`, :meth:`Task.cancel` не гарантирует, что Задача будет отменена, хотя полное подавление отмены не является распространенным явлением и активно не рекомендуется. Если сопрограмма все же решит подавить отмену, в дополнение к перехвату исключения ей необходимо вызвать :meth:`Task.uncancel`.

source: Added the *msg* parameter.
pt_br: Adicionado o parâmetro *msg*.

source: The ``msg`` parameter is propagated from cancelled task to its awaiter.
pt_br: Параметр ``msg`` передается от отмененной задачи к ее ожидающему.

source: The following example illustrates how coroutines can intercept the cancellation request::
pt_br: O seguinte exemplo ilustra como corrotinas podem interceptar o cancelamento de requisições::

source: Return ``True`` if the Task is *cancelled*.
pt_br: Retorna ``True`` se a Tarefa for *cancelada*.

source: The Task is *cancelled* when the cancellation was requested with :meth:`cancel` and the wrapped coroutine propagated the :exc:`CancelledError` exception thrown into it.
pt_br: A Tarefa é *cancelada* quando o cancelamento foi requisitado com :meth:`cancel` e a corrotina contida propagou a exceção :exc:`CancelledError` gerada nela.

source: Decrement the count of cancellation requests to this Task.
pt_br: Уменьшите количество запросов на отмену этой задачи.

source: Returns the remaining number of cancellation requests.
pt_br: Возвращает оставшееся количество запросов на отмену.

source: Note that once execution of a cancelled task completed, further calls to :meth:`uncancel` are ineffective.
pt_br: Обратите внимание, что после завершения выполнения отмененной задачи дальнейшие вызовы :meth:`uncancel` становятся неэффективными.

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. In particular, if a Task gets successfully uncancelled, this allows for elements of structured concurrency like :ref:`taskgroups` and :func:`asyncio.timeout` to continue running, isolating cancellation to the respective structured block. For example::
pt_br: Этот метод используется внутренними компонентами asyncio и не предполагается, что он будет использоваться кодом конечного пользователя. В частности, если Задача успешно отменена, это позволяет элементам структурированного параллелизма, таким как :ref:`taskgroups` и :func:`asyncio.timeout`, продолжать работу, изолируя отмену соответствующего структурированного блока. Например::

source: While the block with ``make_request()`` and ``make_another_request()`` might get cancelled due to the timeout, ``unrelated_code()`` should continue running even in case of the timeout. This is implemented with :meth:`uncancel`. :class:`TaskGroup` context managers use :func:`uncancel` in a similar fashion.
pt_br: Хотя блок с ``make_request()`` и ``make_another_request()`` может быть отменен из-за таймаута, ``unrelated_code()`` должен продолжать работу даже в случае таймаута. Это реализуется с помощью :meth:`uncancel`. Контекстные менеджеры :class:`TaskGroup` используют :func:`uncancel` аналогичным образом.

source: Return the number of pending cancellation requests to this Task, i.e., the number of calls to :meth:`cancel` less the number of :meth:`uncancel` calls.
pt_br: Возвращает количество ожидающих запросов на отмену для этой задачи, т. е. количество вызовов :meth:`cancel` за вычетом количества вызовов :meth:`uncancel`.

source: Note that if this number is greater than zero but the Task is still executing, :meth:`cancelled` will still return ``False``. This is because this number can be lowered by calling :meth:`uncancel`, which can lead to the task not being cancelled after all if the cancellation requests go down to zero.
pt_br: Обратите внимание: если это число больше нуля, но Задача все еще выполняется, :meth:`cancelled` всё равно вернет ``False``. Это связано с тем, что это число можно уменьшить, вызвав :meth:`uncancel`, что может привести к тому, что задача вообще не будет отменена, если запросы на отмену упадут до нуля.

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. See :meth:`uncancel` for more details.
pt_br: Этот метод используется внутренними компонентами asyncio и не предполагается, что он будет использоваться кодом конечного пользователя. См. :meth:`uncancel` для более подробной информации.
