Repository: python/python-docs-pt-br
Catalog: library/asyncio-task.po
Languages: pt_br

source: Coroutines and Tasks
pt_br: Corrotinas e Tarefas

source: This section outlines high-level asyncio APIs to work with coroutines and Tasks.
pt_br: Esta seção descreve APIs assíncronas de alto nível para trabalhar com corrotinas e tarefas.

source: Coroutines
pt_br: Corrotinas

source: **Source code:** :source:`Lib/asyncio/coroutines.py`
pt_br: **Kod źródłowy:** :source:`Lib/asyncio/coroutines.py`

source: :term:`Coroutines <coroutine>` declared with the async/await syntax is the preferred way of writing asyncio applications. For example, the following snippet of code prints "hello", waits 1 second, and then prints "world"::
pt_br: :term:`Corrotinas <coroutine>` declaradas com a sintaxe async/await é a forma preferida de escrever aplicações assíncronas. Por exemplo, o seguinte trecho de código imprime "hello", espera 1 segundo, e então imprime "world"::

source: Note that simply calling a coroutine will not schedule it to be executed::
pt_br: Perceba que simplesmente chamar uma corrotina não irá agendá-la para ser executada::

source: To actually run a coroutine, asyncio provides the following mechanisms:
pt_br: Для фактического запуска сопрограммы asyncio предоставляет следующие механизмы:

source: The :func:`asyncio.run` function to run the top-level entry point "main()" function (see the above example.)
pt_br: A função :func:`asyncio.run` para executar a função "main()" do ponto de entrada no nível mais alto (veja o exemplo acima.)

source: Awaiting on a coroutine. The following snippet of code will print "hello" after waiting for 1 second, and then print "world" after waiting for *another* 2 seconds::
pt_br: Aguardando uma corrotina. O seguinte trecho de código exibirá "hello" após esperar por 1 segundo e, em seguida, exibirá "world" após esperar por *outros* 2 segundos::

source: Expected output::
pt_br: Resultado esperado::

source: The :func:`asyncio.create_task` function to run coroutines concurrently as asyncio :class:`Tasks <Task>`.
pt_br: A função :func:`asyncio.create_task` para executar corrotinas concorrentemente como :class:`Tasks <Task>` asyncio.

source: Let's modify the above example and run two ``say_after`` coroutines *concurrently*::
pt_br: Vamos modificar o exemplo acima e executar duas corrotinas ``say_after`` *concorrentemente*::

source: Note that expected output now shows that the snippet runs 1 second faster than before::
pt_br: Perceba que a saída esperada agora mostra que o trecho de código é executado 1 segundo mais rápido do que antes::

source: The :class:`asyncio.TaskGroup` class provides a more modern alternative to :func:`create_task`. Using this API, the last example becomes::
pt_br: Класс :class:`asyncio.TaskGroup` предоставляет более современную альтернативу :func:`create_task`. Используя этот API, последний пример становится::

source: The timing and output should be the same as for the previous version.
pt_br: Время и результат должны быть такими же, как и в предыдущей версии.

source: Awaitables
pt_br: Aguardáveis

source: We say that an object is an **awaitable** object if it can be used in an :keyword:`await` expression. Many asyncio APIs are designed to accept awaitables.
pt_br: Dizemos que um objeto é um objeto **aguardável** se ele pode ser usado em uma expressão :keyword:`await`. Muitas APIs asyncio são projetadas para aceitar aguardáveis.

source: There are three main types of *awaitable* objects: **coroutines**, **Tasks**, and **Futures**.
pt_br: Existem três tipos principais de objetos *aguardáveis*: **corrotinas**, **Tarefas**, e **Futuros**.

source: Python coroutines are *awaitables* and therefore can be awaited from other coroutines::
pt_br: Corrotinas Python são *aguardáveis* e portanto podem ser aguardadas a partir de outras corrotinas::

source: In this documentation the term "coroutine" can be used for two closely related concepts:
pt_br: Nesta documentação, o termo "corrotina" pode ser usado para dois conceitos intimamente relacionados:

source: a *coroutine function*: an :keyword:`async def` function;
pt_br: uma *função de corrotina*: uma função :keyword:`async def`;

source: a *coroutine object*: an object returned by calling a *coroutine function*.
pt_br: um *objeto de corrotina*: um objeto retornado ao chamar uma *função de corrotina*.

source: Tasks
pt_br: Tarefas

source: *Tasks* are used to schedule coroutines *concurrently*.
pt_br: *Tarefas* são usadas para agendar corrotinas *concorrentemente*.

source: When a coroutine is wrapped into a *Task* with functions like :func:`asyncio.create_task` the coroutine is automatically scheduled to run soon::
pt_br: Quando uma corrotina é envolta em uma *tarefa* com funções como :func:`asyncio.create_task`, a corrotina é automaticamente agendada para executar em breve::

source: Futures
pt_br: Futuros

source: A :class:`Future` is a special **low-level** awaitable object that represents an **eventual result** of an asynchronous operation.
pt_br: Um :class:`Future` é um objeto aguardável especial de **baixo nível** que representa um **resultado eventual** de uma operação assíncrona.

source: When a Future object is *awaited* it means that the coroutine will wait until the Future is resolved in some other place.
pt_br: Quando um objeto Future é *aguardado* isso significa que a corrotina irá esperar até que o Future seja resolvido em algum outro local.

source: Future objects in asyncio are needed to allow callback-based code to be used with async/await.
pt_br: Objetos Future em asyncio são necessários para permitir que código baseado em função de retorno seja utilizado com async/await.

source: Normally **there is no need** to create Future objects at the application level code.
pt_br: Normalmente **não existe necessidade** em criar objetos Future no nível de código da aplicação.

source: Future objects, sometimes exposed by libraries and some asyncio APIs, can be awaited::
pt_br: Objetos Future, algumas vezes expostos por bibliotecas e algumas APIs asyncio, podem ser aguardados::

source: A good example of a low-level function that returns a Future object is :meth:`loop.run_in_executor`.
pt_br: Um bom exemplo de uma função de baixo nível que retorna um objeto Future é :meth:`loop.run_in_executor`.

source: Creating Tasks
pt_br: Criando Tarefas

source: **Source code:** :source:`Lib/asyncio/tasks.py`
pt_br: **Kod źródłowy:** :source:`Lib/asyncio/tasks.py`

source: Wrap the *coro* :ref:`coroutine <coroutine>` into a :class:`Task` and schedule its execution. Return the Task object.
pt_br: Envolva a :ref:`corrotina <coroutine>` *coro* em uma :class:`Task` e agende sua execução. Retorne o objeto Task.

source: If *name* is not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
pt_br: Se *name* não for ``None``, ele é setado como o nome da tarefa usando :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
pt_br: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для запуска *coro*. Текущая копия контекста создается, когда *context* не указан.

source: The task is executed in the loop returned by :func:`get_running_loop`, :exc:`RuntimeError` is raised if there is no running loop in current thread.
pt_br: A tarefa é executada no laço e retornada por :func:`get_running_loop`, :exc:`RuntimeError` é levantado se não existir nenhum loop na thread atual.

source: Save a reference to the result of this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done. For reliable "fire-and-forget" background tasks, gather them in a collection::
pt_br: Mantenha uma referência para o resultado dessa função, evitando assim que uma tarefa desapareça durante a execução. O laço de eventos mantém apenas referências fracas para as tarefas. Uma tarefa que não é referenciada por nada mais pode ser removida pelo coletor de lixo a qualquer momento, antes mesmo da função ser finalizada. Para tarefas de segundo plano "atire-e-esqueça", junte-as em uma coleção::

source: Added the *name* parameter.
pt_br: Adicionado o parâmetro *name*.

source: Added the *context* parameter.
pt_br: Adicionado o parâmetro *context*.

source: Task Cancellation
pt_br: Отмена задачи

source: Tasks can easily and safely be cancelled. When a task is cancelled, :exc:`asyncio.CancelledError` will be raised in the task at the next opportunity.
pt_br: Задачи можно легко и безопасно отменить. Когда задача отменяется, при следующей возможности в задаче будет вызвано :exc:`asyncio.CancelledError`.

source: It is recommended that coroutines use ``try/finally`` blocks to robustly perform clean-up logic. In case :exc:`asyncio.CancelledError` is explicitly caught, it should generally be propagated when clean-up is complete. :exc:`asyncio.CancelledError` directly subclasses :exc:`BaseException` so most code will not need to be aware of it.
pt_br: Рекомендуется, чтобы сопрограммы использовали блоки try/finally для надежного выполнения логики очистки. В случае явного обнаружения :exc:`asyncio.CancelledError`, его обычно следует распространять после завершения очистки. :exc:`asyncio.CancelledError` напрямую является подклассом :exc:`BaseException`, поэтому большинству кода не нужно будет об этом знать.

source: The asyncio components that enable structured concurrency, like :class:`asyncio.TaskGroup` and :func:`asyncio.timeout`, are implemented using cancellation internally and might misbehave if a coroutine swallows :exc:`asyncio.CancelledError`. Similarly, user code should not generally call :meth:`uncancel <asyncio.Task.uncancel>`. However, in cases when suppressing :exc:`asyncio.CancelledError` is truly desired, it is necessary to also call ``uncancel()`` to completely remove the cancellation state.
pt_br: Компоненты asyncio, обеспечивающие структурированный параллелизм, такие как :class:`asyncio.TaskGroup` и :func:`asyncio.timeout`, реализуются с использованием внутренней отмены и могут работать неправильно, если сопрограмма проглотит :exc:`asyncio.CancelledError`. Аналогично, пользовательский код обычно не должен вызывать :meth:`uncancel <asyncio.Task.uncancel>`. Однако в случаях, когда подавление :exc:`asyncio.CancelledError` действительно желательно, необходимо также вызвать ``uncancel()``, чтобы полностью удалить состояние отмены.

source: Task Groups
pt_br: Группы задач

source: Task groups combine a task creation API with a convenient and reliable way to wait for all tasks in the group to finish.
pt_br: Группы задач сочетают в себе API создания задач с удобным и надежным способом ожидания завершения всех задач в группе.

source: An :ref:`asynchronous context manager <async-context-managers>` holding a group of tasks. Tasks can be added to the group using :meth:`create_task`. All tasks are awaited when the context manager exits.
pt_br: :ref:`асинхронный контекстный менеджер <async-context-managers>`, содержащий группу задач. Задачи можно добавлять в группу с помощью :meth:`create_task`. Все задачи ожидаются после выхода из контекстного менеджера.

source: Create a task in this task group. The signature matches that of :func:`asyncio.create_task`.
pt_br: Создайте задачу в этой группе задач. Подпись соответствует подписи :func:`asyncio.create_task`.

source: Example::
pt_br: Exemplo::

source: The ``async with`` statement will wait for all tasks in the group to finish. While waiting, new tasks may still be added to the group (for example, by passing ``tg`` into one of the coroutines and calling ``tg.create_task()`` in that coroutine). Once the last task has finished and the ``async with`` block is exited, no new tasks may be added to the group.
pt_br: Оператор ``async with`` будет ждать завершения всех задач в группе. Во время ожидания в группу все равно можно добавлять новые задачи (например, передав ``tg`` в одну из сопрограмм и вызвав ``tg.create_task()`` в этой сопрограмме). После завершения последней задачи и выхода из блока async with в группу нельзя добавлять новые задачи.

source: The first time any of the tasks belonging to the group fails with an exception other than :exc:`asyncio.CancelledError`, the remaining tasks in the group are cancelled. No further tasks can then be added to the group. At this point, if the body of the ``async with`` statement is still active (i.e., :meth:`~object.__aexit__` hasn't been called yet), the task directly containing the ``async with`` statement is also cancelled. The resulting :exc:`asyncio.CancelledError` will interrupt an ``await``, but it will not bubble out of the containing ``async with`` statement.
pt_br: При первом сбое какой-либо задачи, принадлежащей группе, за исключением исключения :exc:`asyncio.CancelledError`, остальные задачи в группе отменяются. После этого в группу невозможно будет добавить никакие дальнейшие задачи. На этом этапе, если тело оператора ``async with`` все еще активно (т.е. :meth:`~object.__aexit__` еще не был вызван), задача, непосредственно содержащая ``async with`` заявление также аннулируется. Полученный :exc:`asyncio.CancelledError` прервет ``await``, но он не выйдет за пределы содержащегося ``async with`` оператора.

source: Once all tasks have finished, if any tasks have failed with an exception other than :exc:`asyncio.CancelledError`, those exceptions are combined in an :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup` (as appropriate; see their documentation) which is then raised.
pt_br: Если после завершения всех задач какие-либо задачи завершились сбоем с исключением, отличным от :exc:`asyncio.CancelledError`, эти исключения объединяются в :exc:`ExceptionGroup` или :exc:`BaseExceptionGroup` (в зависимости от ситуации; см. документации), которая затем поднимается.

source: Two base exceptions are treated specially: If any task fails with :exc:`KeyboardInterrupt` or :exc:`SystemExit`, the task group still cancels the remaining tasks and waits for them, but then the initial :exc:`KeyboardInterrupt` or :exc:`SystemExit` is re-raised instead of :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup`.
pt_br: Два базовых исключения обрабатываются особым образом: если какая-либо задача завершается с ошибкой :exc:`KeyboardInterrupt` или :exc:`SystemExit`, группа задач по-прежнему отменяет оставшиеся задачи и ожидает их, но затем начальный :exc:`KeyboardInterrupt` или :exc:`SystemExit` повторно вызывается вместо :exc:`ExceptionGroup` или :exc:`BaseExceptionGroup`.

source: If the body of the ``async with`` statement exits with an exception (so :meth:`~object.__aexit__` is called with an exception set), this is treated the same as if one of the tasks failed: the remaining tasks are cancelled and then waited for, and non-cancellation exceptions are grouped into an exception group and raised. The exception passed into :meth:`~object.__aexit__`, unless it is :exc:`asyncio.CancelledError`, is also included in the exception group. The same special case is made for :exc:`KeyboardInterrupt` and :exc:`SystemExit` as in the previous paragraph.
pt_br: Если тело оператора ``async with`` завершается с исключением (поэтому :meth:`~object.__aexit__` вызывается с набором исключений), это обрабатывается так же, как если бы одна из задач завершилась неудачно: оставшиеся задачи отменяются, а затем ожидаются, а исключения, не подлежащие отмене, группируются в группу исключений и вызываются. Исключение, переданное в :meth:`~object.__aexit__`, если оно не является :exc:`asyncio.CancelledError`, также включается в группу исключений. Для :exc:`KeyboardInterrupt` и :exc:`SystemExit` предусмотрен тот же особый случай, что и в предыдущем абзаце.

source: Sleeping
pt_br: Dormindo

source: Block for *delay* seconds.
pt_br: Bloqueia por *delay* segundos.

source: If *result* is provided, it is returned to the caller when the coroutine completes.
pt_br: Se *result* é fornecido, é retornado para o autor da chamada quando a corrotina termina.

source: ``sleep()`` always suspends the current task, allowing other tasks to run.
pt_br: ``sleep()`` sempre suspende a tarefa atual, permitindo que outras tarefas sejam executadas.

source: Setting the delay to 0 provides an optimized path to allow other tasks to run. This can be used by long-running functions to avoid blocking the event loop for the full duration of the function call.
pt_br: Configurando o delay para 0 fornece um caminho otimizado para permitir que outras tarefas executem. Isto pode ser usado por funções de longa execução para evitar que bloqueiem o laço de eventos por toda a duração da chamada da função.

source: Example of coroutine displaying the current date every second for 5 seconds::
pt_br: Exemplo de uma corrotina exibindo a data atual a cada segundo durante 5 segundos::

source: Removed the *loop* parameter.
pt_br: Removido o parâmetro *loop*.

source: Running Tasks Concurrently
pt_br: Executando tarefas concorrentemente

source: Run :ref:`awaitable objects <asyncio-awaitables>` in the *aws* sequence *concurrently*.
pt_br: Executa :ref:`objetos aguardáveis <asyncio-awaitables>` na sequência *aws* de forma *concorrente*.

source: If any awaitable in *aws* is a coroutine, it is automatically scheduled as a Task.
pt_br: Se qualquer aguardável em *aws* é uma corrotina, ele é automaticamente agendado como uma Tarefa.

source: If all awaitables are completed successfully, the result is an aggregate list of returned values. The order of result values corresponds to the order of awaitables in *aws*.
pt_br: Se todos os aguardáveis forem concluídos com sucesso, o resultado é uma lista agregada de valores retornados. A ordem dos valores resultantes corresponde a ordem dos aguardáveis em *aws*.

source: If *return_exceptions* is ``False`` (default), the first raised exception is immediately propagated to the task that awaits on ``gather()``. Other awaitables in the *aws* sequence **won't be cancelled** and will continue to run.
pt_br: Se *return_exceptions* for ``False`` (valor padrão), a primeira exceção levantada é imediatamente propagada para a tarefa que espera em ``gather()``. Outros aguardáveis na sequência *aws* **não serão cancelados** e irão continuar a executar.

source: If *return_exceptions* is ``True``, exceptions are treated the same as successful results, and aggregated in the result list.
pt_br: Se *return_exceptions* for ``True``, exceções são tratadas da mesma forma que resultados com sucesso, e agregadas na lista de resultados.

source: If ``gather()`` is *cancelled*, all submitted awaitables (that have not completed yet) are also *cancelled*.
pt_br: Se ``gather()`` for *cancelado*, todos os aguardáveis que foram submetidos (que não foram concluídos ainda) também são *cancelados*.

source: If any Task or Future from the *aws* sequence is *cancelled*, it is treated as if it raised :exc:`CancelledError` -- the ``gather()`` call is **not** cancelled in this case. This is to prevent the cancellation of one submitted Task/Future to cause other Tasks/Futures to be cancelled.
pt_br: Se qualquer Tarefa ou Futuro da sequência *aws* for *cancelado*, ele é tratado como se tivesse levantado :exc:`CancelledError` -- a chamada para ``gather()`` **não** é cancelada neste caso. Isso existe para prevenir que o cancelamento de uma Tarefa/Futuro submetida ocasione outras Tarefas/Futuros a serem cancelados.

source: If *return_exceptions* is False, cancelling gather() after it has been marked done won't cancel any submitted awaitables. For instance, gather can be marked done after propagating an exception to the caller, therefore, calling ``gather.cancel()`` after catching an exception (raised by one of the awaitables) from gather won't cancel any other awaitables.
pt_br: Se *return_exceptions* for False, cancelar gather() depois que ele foi marcado como concluído não irá cancelar quaisquer aguardáveis submetidos. Por exemplo, gather pode ser marcado como concluído após propagar uma exceção para o autor da chamada, portanto, chamar ``gather.cancel()`` após capturar uma exceção (levantada por um dos aguardáveis) a partir de gather não irá cancelar quaisquer outros aguardáveis.

source: If the *gather* itself is cancelled, the cancellation is propagated regardless of *return_exceptions*.
pt_br: Se *gather* por si mesmo for cancelado, o cancelamento é propagado independente de *return_exceptions*.

source: Deprecation warning is emitted if no positional arguments are provided or not all positional arguments are Future-like objects and there is no running event loop.
pt_br: Aviso de descontinuidade é emitido se nenhum argumento posicional for fornecido, ou nem todos os argumentos posicionais são objetos similar a Futuro, e não existe nenhum laço de eventos em execução.

source: Shielding From Cancellation
pt_br: Protegendo contra cancelamento

source: Protect an :ref:`awaitable object <asyncio-awaitables>` from being :meth:`cancelled <Task.cancel>`.
pt_br: Protege um :ref:`objeto aguardável <asyncio-awaitables>` de ser :meth:`cancelado <Task.cancel>`.

source: If *aw* is a coroutine it is automatically scheduled as a Task.
pt_br: Se *aw* é uma corrotina, ela é automaticamente agendada como uma Tarefa.

source: The statement::
pt_br: A instrução::

source: is equivalent to::
pt_br: é equivalente a::

source: *except* that if the coroutine containing it is cancelled, the Task running in ``something()`` is not cancelled. From the point of view of ``something()``, the cancellation did not happen. Although its caller is still cancelled, so the "await" expression still raises a :exc:`CancelledError`.
pt_br: *exceto* que se a corrotina contendo-a for cancelada, a Tarefa executando em ``something()`` não é cancelada. Do ponto de vista de ``something()``, o cancelamento não aconteceu. Apesar do autor da chamada ainda estar cancelado, então a expressão "await" ainda levanta um :exc:`CancelledError`.

source: If ``something()`` is cancelled by other means (i.e. from within itself) that would also cancel ``shield()``.
pt_br: Se ``something()`` é cancelada por outros meios (isto é, dentro ou a partir de si mesma) isso também iria cancelar ``shield()``.

source: If it is desired to completely ignore cancellation (not recommended) the ``shield()`` function should be combined with a try/except clause, as follows::
pt_br: Se for desejado ignorar completamente os cancelamentos (não recomendado) a função ``shield()`` deve ser combinada com uma cláusula try/except, conforme abaixo::

source: Save a reference to tasks passed to this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done.
pt_br: Mantenha uma referência para as tarefas passadas para essa função função, evitando assim que uma tarefa desapareça durante a execução. O laço de eventos mantém apenas referências fracas para as tarefas. Uma tarefa que não é referenciada por nada mais pode ser removida pelo coletor de lixo a qualquer momento, antes mesmo da função ser finalizada.

source: Deprecation warning is emitted if *aw* is not Future-like object and there is no running event loop.
pt_br: Aviso de descontinuidade é emitido se *aw* não é um objeto similar a Futuro, e não existe nenhum laço de eventos em execução.

source: Timeouts
pt_br: Tempo limite

source: Return an :ref:`asynchronous context manager <async-context-managers>` that can be used to limit the amount of time spent waiting on something.
pt_br: Возвращает :ref:`асинхронный контекстный менеджер <async-context-managers>`, который можно использовать для ограничения времени, затрачиваемого на ожидание чего-либо.
