Repository: python/python-docs-pt-br
Catalog: library/asyncio-eventloop.po
Languages: pt_br

source: *sock*, if given, should be an existing, already connected :class:`socket.socket` object to be used by the transport. If *sock* is given, none of *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* and *local_addr* should be specified.
pt_br: *sock*, se fornecido, deve ser um objeto :class:`socket.socket` já existente, já conectado, para ser usado por transporte. Se *sock* é fornecido, *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* e *local_addr* não devem ser especificados.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using ``getaddrinfo()``, similarly to *host* and *port*.
pt_br: *local_addr*, se fornecido, é uma tupla de ``(local_host, local_port)`` usada para se ligar ao soquete localmente. O *local_host* e a *local_port* são procurados usando ``getaddrinfo()``, de forma similar para *host* e *port*.

source: *ssl_handshake_timeout* is (for a TLS connection) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
pt_br: *ssl_handshake_timeout* é (para uma conexão TLS) o tempo em segundos para aguardar pelo encerramento do aperto de mão TLS, antes de abortar a conexão. ``60.0`` segundos se for ``None`` (valor padrão).

source: Added support for SSL/TLS in :class:`ProactorEventLoop`.
pt_br: Adicionado suporte para SSL/TLS na :class:`ProactorEventLoop`.

source: Added the *ssl_handshake_timeout* parameter.
pt_br: Adicionado o parâmetro *ssl_handshake_timeout*.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
pt_br: Adicionados os parâmetros *happy_eyeballs_delay* e *interleave*.

source: The :func:`open_connection` function is a high-level alternative API. It returns a pair of (:class:`StreamReader`, :class:`StreamWriter`) that can be used directly in async/await code.
pt_br: A função :func:`open_connection` é uma API alternativa de alto nível. Ela retorna um par de (:class:`StreamReader`, :class:`StreamWriter`) que pode ser usado diretamente em código async/await.

source: Create a datagram connection.
pt_br: Cria uma conexão de datagrama.

source: *protocol_factory* must be a callable returning a :ref:`protocol <asyncio-protocol>` implementation.
pt_br: *protocol_factory* deve ser algo chamável, retornando uma implementação de :ref:`protocolo <asyncio-protocol>`.

source: A tuple of ``(transport, protocol)`` is returned on success.
pt_br: Uma tupla de ``(transport, protocol)`` é retornada em caso de sucesso.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using :meth:`getaddrinfo`.
pt_br: *local_addr*, se fornecido, é uma tupla de ``(local_host, local_port)`` usada para ligar o soquete localmente. O *local_host* e a *local_port* são procurados usando :meth:`getaddrinfo`.

source: *remote_addr*, if given, is a ``(remote_host, remote_port)`` tuple used to connect the socket to a remote address. The *remote_host* and *remote_port* are looked up using :meth:`getaddrinfo`.
pt_br: *remote_addr*, se fornecido, é uma tupla de ``(remote_host, remote_port)`` usada para conectar o soquete a um endereço remoto. O *remote_host* e a *remote_port* são procurados usando :meth:`getaddrinfo`.

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to :meth:`getaddrinfo` for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
pt_br: *family*, *proto*, *flags* são os endereços familiares, protocolo e flags opcionais a serem passados para :meth:`getaddrinfo` para resolução do *host*. Se fornecido, esses devem ser todos inteiros do módulo de constantes :mod:`socket` correspondente.

source: *allow_broadcast* tells the kernel to allow this endpoint to send messages to the broadcast address.
pt_br: *allow_broadcast* avisa o kernel para permitir que este endpoint envie mensagens para o endereço de broadcast.

source: *sock* can optionally be specified in order to use a preexisting, already connected, :class:`socket.socket` object to be used by the transport. If specified, *local_addr* and *remote_addr* should be omitted (must be :const:`None`).
pt_br: *sock* pode opcionalmente ser especificado em ordem para usar um objeto :class:`socket.socket` pre-existente, já conectado, para ser usado pelo transporte. Se especificado, *local_addr* e *remote_addr* devem ser omitidos (devem ser :const:`None`).

source: See :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` and :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>` examples.
pt_br: Veja :ref:`protocolo UDP eco cliente <asyncio-udp-echo-client-protocol>` e :ref:`protocolo UDP eco servidor <asyncio-udp-echo-server-protocol>` para exemplos.

source: Added support for Windows.
pt_br: Adicionado suporte para Windows.

source: When multiple processes with differing UIDs assign sockets to an identical UDP socket address with ``SO_REUSEADDR``, incoming packets can become randomly distributed among the sockets.
pt_br: Quando múltiplos processos com diferentes UIDs atribuem soquetes para um endereço de soquete UDP idêntico com ``SO_REUSEADDR``, pacotes recebidos podem ser distribuídos aleatoriamente entre os soquetes.

source: Create a Unix connection.
pt_br: Cria uma conexão Unix.

source: *path* is the name of a Unix domain socket and is required, unless a *sock* parameter is specified. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
pt_br: *path* é o nome de um soquete de domínio Unix e é obrigatório, a não ser que um parâmetro *sock* seja esecificado. Soquetes Unix abstratos, :class:`str`, :class:`bytes`, e caminhos :class:`~pathlib.Path` são suportados.

source: See the documentation of the :meth:`loop.create_connection` method for information about arguments to this method.
pt_br: Veja a documentação do método :meth:`loop.create_connection` para informações a respeito de argumentos para este método.

source: Availability
pt_br: Disponibilidade

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`.
pt_br: Adicionado o parâmetro *ssl_handshake_timeout*. O parâmetro *path* agora pode ser um :term:`path-like object`.

source: Creating network servers
pt_br: Criando servidores de rede

source: Returns a :class:`Server` object.
pt_br: Retorna um objeto :class:`Server`.

source: Arguments:
pt_br: Argumentos:

source: The *host* parameter can be set to several types which determine where the server would be listening:
pt_br: O parâmetro *host* pode ser definido para diversos tipos, o qual determina onde o servidor deve escutar:

source: If *host* is a string, the TCP server is bound to a single network interface specified by *host*.
pt_br: Se *host* for uma string, o servidor TCP está vinculado a apenas uma interface de rede, especificada por *host*.

source: If *host* is a sequence of strings, the TCP server is bound to all network interfaces specified by the sequence.
pt_br: Se *host* é uma sequência de strings, o servidor TCP está vinculado a todas as interfaces de rede especificadas pela sequência.

source: If *host* is an empty string or ``None``, all interfaces are assumed and a list of multiple sockets will be returned (most likely one for IPv4 and another one for IPv6).
pt_br: Se *host* é uma string vazia ou ``None``, todas as interfaces são presumidas e uma lista de múltiplos soquetes será retornada (muito provavelmente um para IPv4 e outro para IPv6).

source: The *port* parameter can be set to specify which port the server should listen on. If ``0`` or ``None`` (the default), a random unused port will be selected (note that if *host* resolves to multiple network interfaces, a different random port will be selected for each interface).
pt_br: O parâmetro *port* pode ser definido para especificar qual porta o servidor deve escutar. Se ``0`` ou ``None`` (o padrão), uma porta aleatória disponível será selecionada (note que se *host* resolve para múltiplas interfaces de rede, uma porta aleatória diferente será selecionada para cada interface).

source: *flags* is a bitmask for :meth:`getaddrinfo`.
pt_br: *flags* é uma máscara de bits para :meth:`getaddrinfo`.

source: *sock* can optionally be specified in order to use a preexisting socket object. If specified, *host* and *port* must not be specified.
pt_br: *sock* pode opcionalmente ser especificado para usar um objeto soquete pré-existente. Se especificado, *host* e *port* não devem ser especificados.

source: *backlog* is the maximum number of queued connections passed to :meth:`~socket.socket.listen` (defaults to 100).
pt_br: *backlog* é o número máximo de conexões enfileiradas pasadas para :meth:`~socket.socket.listen` (padrão é 100).

source: *ssl* can be set to an :class:`~ssl.SSLContext` instance to enable TLS over the accepted connections.
pt_br: *ssl* pode ser definido para uma instância de :class:`~ssl.SSLContext` para habilitar TLS sobre as conexões aceitas.

source: *reuse_address* tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire. If not specified will automatically be set to ``True`` on Unix.
pt_br: *reuse_address* diz ao kernel para reusar um soquete local em estado ``TIME_WAIT``, serm aguardar pela expiração natural do seu tempo limite. Se não especificado, será automaticamente definida como ``True`` no Unix.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows.
pt_br: *reuse_port* diz ao kernel para permitir que este endpoint seja vinculado a mesma porta que outros endpoints existentes estão vinculados, contanto que todos eles definam este sinalizador quando forem criados. Esta opção não é suportada no Windows.

source: *ssl_handshake_timeout* is (for a TLS server) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
pt_br: *ssl_handshake_timeout* é (para um servidor TLS) o tempo em segundos para aguardar pelo aperto de mão TLS ser concluído, antes de abortar a conexão. ``60.0`` segundos se ``None`` (valor padrão).

source: *start_serving* set to ``True`` (the default) causes the created server to start accepting connections immediately. When set to ``False``, the user should await on :meth:`Server.start_serving` or :meth:`Server.serve_forever` to make the server to start accepting connections.
pt_br: Definir *start_serving* para ``True`` (o valor padrão) faz o servidor criado começar a aceitar conexões imediatamente. Quando definido para ``False``, o usuário deve aguardar com :meth:`Server.start_serving` ou :meth:`Server.serve_forever` para fazer o servidor começar a aceitar conexões.

source: The *host* parameter can be a sequence of strings.
pt_br: O parâmetro *host* pode ser uma sequência de strings.

source: The :func:`start_server` function is a higher-level alternative API that returns a pair of :class:`StreamReader` and :class:`StreamWriter` that can be used in an async/await code.
pt_br: A função :func:`start_server` é uma API alternativa de alto nível que retorna um par de :class:`StreamReader` e :class:`StreamWriter` que pode ser usado em um código async/await.

source: *path* is the name of a Unix domain socket, and is required, unless a *sock* argument is provided. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
pt_br: *path* é o nome de um soquete de domínio Unix, e é obrigatório, a não ser que um argumento *sock* seja fornecido. Soquetes Unix abstratos, :class:`str`, :class:`bytes`, e caminhos :class:`~pathlib.Path` são suportados.

source: See the documentation of the :meth:`loop.create_server` method for information about arguments to this method.
pt_br: Veja a documentação do método :meth:`loop.create_server` para informações sobre argumentos para este método.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :class:`~pathlib.Path` object.
pt_br: Adicionados os parâmetros *ssl_handshake_timeout* estart_serving*. O parâmetros *path* agora pode ser um objeto da classe :class:`~pathlib.Path`.

source: Wrap an already accepted connection into a transport/protocol pair.
pt_br: Envolve uma conexão já aceita em um par transporte/protocolo.

source: This method can be used by servers that accept connections outside of asyncio but that use asyncio to handle them.
pt_br: Este método pode ser usado por servidores que aceitam conexões fora do asyncio, mas que usam asyncio para manipulá-las.

source: Parameters:
pt_br: Parâmetros:

source: *sock* is a preexisting socket object returned from :meth:`socket.accept <socket.socket.accept>`.
pt_br: *sock* é um objeto soquete pré-existente retornado a partir de :meth:`socket.accept <socket.socket.accept>`.

source: *ssl* can be set to an :class:`~ssl.SSLContext` to enable SSL over the accepted connections.
pt_br: *ssl* pode ser definido para um :class:`~ssl.SSLContext` para habilitar SSL sobre as conexões aceitas.

source: *ssl_handshake_timeout* is (for an SSL connection) the time in seconds to wait for the SSL handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
pt_br: *ssl_handshake_timeout* é (para uma conexão SSL) o tempo em segundos para aguardar pelo aperto de mão SSL ser concluído, antes de abortar a conexão. ``60.0`` segundos se ``None`` (valor padrão).

source: Returns a ``(transport, protocol)`` pair.
pt_br: Retorna um par ``(transport, protocol)``.

source: Transferring files
pt_br: Transferindo arquivos

source: Send a *file* over a *transport*. Return the total number of bytes sent.
pt_br: Envia um *file* sobre um *transport*. Retorna o número total de bytes enviados.

source: The method uses high-performance :meth:`os.sendfile` if available.
pt_br: O método usa :meth:`os.sendfile` de alto desempenho, se disponível.

source: *file* must be a regular file object opened in binary mode.
pt_br: *file* deve ser um objeto arquivo regular aberto em modo binário.

source: *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is always updated, even when this method raises an error, and :meth:`file.tell() <io.IOBase.tell>` can be used to obtain the actual number of bytes sent.
pt_br: *offset* indica a partir de onde deve iniciar a leitura do arquivo. Se especificado, *count* é o número total de bytes para transmitir, ao contrário de transmitir o arquivo até que EOF seja atingido. A posição do arquivo é sempre atualizada, mesmo quando este método levanta um erro, e :meth:`file.tell() <io.IOBase.tell>` pode ser usado para obter o número atual de bytes enviados.

source: *fallback* set to ``True`` makes asyncio to manually read and send the file when the platform does not support the sendfile system call (e.g. Windows or SSL socket on Unix).
pt_br: *fallback* definido para ``True`` faz o asyncio manualmente ler e enviar o arquivo quando a plataforma não suporta a chamada de sistema sendfile (por exemplo Windows ou soquete SSL no Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support the *sendfile* syscall and *fallback* is ``False``.
pt_br: Levanta :exc:`SendfileNotAvailableError` se o sistema não suporta a chamada de sistema *sendfile* e *fallback* é ``False``.

source: TLS Upgrade
pt_br: Atualizando TLS

source: Upgrade an existing transport-based connection to TLS.
pt_br: Atualiza um conexão baseada em transporte existente para TLS.

source: *transport* and *protocol* instances that methods like :meth:`~loop.create_server` and :meth:`~loop.create_connection` return.
pt_br: instâncias de *transport* e *protocol*, que métodos como :meth:`~loop.create_server` e :meth:`~loop.create_connection` retornam.

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
pt_br: *sslcontext*: uma instância configurada de :class:`~ssl.SSLContext`.

source: *server_side* pass ``True`` when a server-side connection is being upgraded (like the one created by :meth:`~loop.create_server`).
pt_br: *server_side* informe ``True`` quando uma conexão no lado do servidor estiver sendo atualizada (como a que é criada por :meth:`~loop.create_server`).

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
pt_br: *server_hostname*: define ou substitui o nome do host no qual o servidor alvo do certificado será comparado.

source: Watching file descriptors
pt_br: Observando descritores de arquivo

source: Start monitoring the *fd* file descriptor for read availability and invoke *callback* with the specified arguments once *fd* is available for reading.
pt_br: Começa a monitorar o descritor de arquivo *fd* para disponibilidade de leitura e invoca a *callback* com os argumentos especificados assim que *fd* esteja disponível para leitura.

source: Start monitoring the *fd* file descriptor for write availability and invoke *callback* with the specified arguments once *fd* is available for writing.
pt_br: Começa a monitorar o descritor de arquivo *fd* para disponibilidade de escrita e invoca a *callback* com os argumentos especificados assim que *fd* esteja disponível para escrita.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *callback*.
pt_br: Use :func:`functools.partial` :ref:`para passar argumentos nomeados <asyncio-pass-keywords>` para a *callback*.

source: See also :ref:`Platform Support <asyncio-platform-support>` section for some limitations of these methods.
pt_br: Veja também a seção de :ref:`Suporte a Plataformas <asyncio-platform-support>` para algumas limitações desses métodos.

source: Working with socket objects directly
pt_br: Trabalhando com objetos soquete diretamente

source: In general, protocol implementations that use transport-based APIs such as :meth:`loop.create_connection` and :meth:`loop.create_server` are faster than implementations that work with sockets directly. However, there are some use cases when performance is not critical, and working with :class:`~socket.socket` objects directly is more convenient.
pt_br: Em geral, implementações de protocolo que usam APIs baseadas em transporte, tais como :meth:`loop.create_connection` e :meth:`loop.create_server` são mais rápidas que implementações que trabalham com soquetes diretamente. Entretanto, existem alguns casos de uso quando o desempenho não é crítica, e trabalhar com objetos :class:`~socket.socket` diretamente é mais conveniente.

source: Receive up to *nbytes* from *sock*. Asynchronous version of :meth:`socket.recv() <socket.socket.recv>`.
pt_br: Recebe até *nbytes* do *sock*. Versão assíncrona de :meth:`socket.recv() <socket.socket.recv>`.

source: Return the received data as a bytes object.
pt_br: Retorna os dados recebidos como um objeto de bytes.

source: *sock* must be a non-blocking socket.
pt_br: *sock* deve ser um soquete não bloqueante.

source: Even though this method was always documented as a coroutine method, releases before Python 3.7 returned a :class:`Future`. Since Python 3.7 this is an ``async def`` method.
pt_br: Apesar deste método sempre ter sido documentado como um método de corrotina, versões anteriores ao Python 3.7 retornavam um :class:`Future`. Desde o Python 3.7 este é um método ``async def``.

source: Receive data from *sock* into the *buf* buffer. Modeled after the blocking :meth:`socket.recv_into() <socket.socket.recv_into>` method.
pt_br: Dados recebidos do *sock* no buffer *buf*. Modelado baseado no método bloqueante :meth:`socket.recv_into() <socket.socket.recv_into>`.

source: Return the number of bytes written to the buffer.
pt_br: Retorna o número de bytes escritos no buffer.

source: Send *data* to the *sock* socket. Asynchronous version of :meth:`socket.sendall() <socket.socket.sendall>`.
pt_br: Envia *data* para o soquete *sock*. Versão assíncrona de :meth:`socket.sendall() <socket.socket.sendall>`.

source: This method continues to send to the socket until either all data in *data* has been sent or an error occurs. ``None`` is returned on success. On error, an exception is raised. Additionally, there is no way to determine how much data, if any, was successfully processed by the receiving end of the connection.
pt_br: Este método continua a enviar para o soquete até que todos os dados em *data* tenham sido enviados ou um erro ocorra. ``None`` é retornado em caso de sucesso. Ao ocorrer um erro, uma exceção é levantada. Adicionalmente, não existe nenhuma forma de determinar quantos dados, se algum, foram processados com sucesso pelo destinatário na conexão.

source: Even though the method was always documented as a coroutine method, before Python 3.7 it returned a :class:`Future`. Since Python 3.7, this is an ``async def`` method.
pt_br: Apesar deste método sempre ter sido documentado como um método de corrotina, antes do Python 3.7 ele retornava um :class:`Future`. Desde o Python 3.7, este é um método ``async def``.

source: Connect *sock* to a remote socket at *address*.
pt_br: Conecta o *sock* em um endereço *address* remoto.

source: Asynchronous version of :meth:`socket.connect() <socket.socket.connect>`.
pt_br: Versão assíncrona de :meth:`socket.connect() <socket.socket.connect>`.

source: ``address`` no longer needs to be resolved. ``sock_connect`` will try to check if the *address* is already resolved by calling :func:`socket.inet_pton`. If not, :meth:`loop.getaddrinfo` will be used to resolve the *address*.
pt_br: ``address`` não precisa mais ser resolvido. ``sock_connect`` irá tentar verificar se *address* já está resolvido chamando :func:`socket.inet_pton`. Se não estiver, :meth:`loop.getaddrinfo` será usado para resolver *address*.

source: :meth:`loop.create_connection` and :func:`asyncio.open_connection() <open_connection>`.
pt_br: :meth:`loop.create_connection` e :func:`asyncio.open_connection() <open_connection>`.

source: Accept a connection. Modeled after the blocking :meth:`socket.accept() <socket.socket.accept>` method.
pt_br: Aceita uma conexão. Modelado baseado no método bloqueante :meth:`socket.accept() <socket.socket.accept>`.

source: The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
pt_br: O soquete deve estar vinculado a um endereço e escutando por conexões. O valor de retorno é um par ``(conn, address)`` onde *conn* é um *novo* objeto de soquete usável para enviar e receber dados na conexão, e *address* é o endereço vinculado ao soquete no outro extremo da conexão.

source: :meth:`loop.create_server` and :func:`start_server`.
pt_br: :meth:`loop.create_server` e :func:`start_server`.

source: Send a file using high-performance :mod:`os.sendfile` if possible. Return the total number of bytes sent.
pt_br: Envia um arquivo usando :mod:`os.sendfile` de alto desempenho se possível. Retorna o número total de bytes enviados.

source: Asynchronous version of :meth:`socket.sendfile() <socket.socket.sendfile>`.
pt_br: Versão assíncrona de :meth:`socket.sendfile() <socket.socket.sendfile>`.
