Repository: python/python-docs-pt-br
Catalog: library/asyncio-stream.po
Languages: pt_br

source: **Source code:** :source:`Lib/asyncio/streams.py`
pt_br: **Código-fonte:** :source:`Lib/asyncio/streams.py`

source: Streams are high-level async/await-ready primitives to work with network connections. Streams allow sending and receiving data without using callbacks or low-level protocols and transports.
pt_br: Streams são conexões de rede de alto-nível assincronias/espera-pronta. Streams permitem envios e recebimentos de dados sem usar retornos de chamadas ou protocolos de baixo nível.

source: Here is an example of a TCP echo client written using asyncio streams::
pt_br: Aqui está um exemplo de um cliente TCP realizando eco, escrito usando streams asyncio::

source: See also the `Examples`_ section below.
pt_br: Veja também a seção `Exemplos`_ abaixo.

source: Stream Functions
pt_br: Funções Stream

source: The following top-level asyncio functions can be used to create and work with streams:
pt_br: As seguintes funções asyncio de alto nível podem ser usadas para criar e trabalhar com streams:

source: Establish a network connection and return a pair of ``(reader, writer)`` objects.
pt_br: Estabelece uma conexão de rede e retorna um par de objetos ``(reader, writer)``.

source: The returned *reader* and *writer* objects are instances of :class:`StreamReader` and :class:`StreamWriter` classes.
pt_br: Os objetos *reader* e *writer* retornados são instâncias das classes :class:`StreamReader` e :class:`StreamWriter`.

source: *limit* determines the buffer size limit used by the returned :class:`StreamReader` instance. By default the *limit* is set to 64 KiB.
pt_br: *limit* determina o tamanho limite do buffer usado pela instância :class:`StreamReader` retornada. Por padrão, *limit* é definido em 64 KiB.

source: The rest of the arguments are passed directly to :meth:`loop.create_connection`.
pt_br: O resto dos argumentos é passado diretamente para :meth:`loop.create_connection`.

source: Added the *ssl_handshake_timeout* parameter.
pt_br: Adicionado o parâmetro *ssl_handshake_timeout*.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
pt_br: Adicionados os parâmetros *happy_eyeballs_delay* e *interleave*.

source: Removed the *loop* parameter.
pt_br: Removido o parâmetro *loop*.

source: Start a socket server.
pt_br: Inicia um soquete no servidor.

source: The *client_connected_cb* callback is called whenever a new client connection is established. It receives a ``(reader, writer)`` pair as two arguments, instances of the :class:`StreamReader` and :class:`StreamWriter` classes.
pt_br: A função de retorno *client_connected_cb* é chamada sempre que uma nova conexão de um cliente é estabelecida. Ela recebe um par ``(reader, writer)`` como dois argumentos, instâncias das classes :class:`StreamReader` e :class:`StreamWriter`.

source: *client_connected_cb* can be a plain callable or a :ref:`coroutine function <coroutine>`; if it is a coroutine function, it will be automatically scheduled as a :class:`Task`.
pt_br: *client_connected_cb* pode ser simplesmente algo chamável ou uma :ref:`função de corrotina<coroutine>`; se ele for uma função de corrotina, ele será automaticamente agendado como uma :class:`Task`.

source: The rest of the arguments are passed directly to :meth:`loop.create_server`.
pt_br: O resto dos argumentos são passados diretamente para :meth:`loop.create_server`.

source: Unix Sockets
pt_br: Soquetes Unix

source: Establish a Unix socket connection and return a pair of ``(reader, writer)``.
pt_br: Estabelece uma conexão de soquete Unix e retorna um par com ``(reader, writer)``.

source: Similar to :func:`open_connection` but operates on Unix sockets.
pt_br: Similar a :func:`open_connection`, mas opera em soquetes Unix.

source: See also the documentation of :meth:`loop.create_unix_connection`.
pt_br: Veja também a documentação do método :meth:`loop.create_unix_connection`.

source: Availability
pt_br: Disponibilidade

source: Start a Unix socket server.
pt_br: Inicia um servidor com soquete Unix.

source: Similar to :func:`start_server` but works with Unix sockets.
pt_br: Similar a :func:`start_server`, mas funciona com soquetes Unix.

source: See also the documentation of :meth:`loop.create_unix_server`.
pt_br: Veja também a documentação do método :meth:`loop.create_unix_server`.

source: It is not recommended to instantiate *StreamReader* objects directly; use :func:`open_connection` and :func:`start_server` instead.
pt_br: Não é recomendado instanciar objetos *StreamReader* diretamente; use :func:`open_connection` e :func:`start_server` ao invés disso.

source: Read one line, where "line" is a sequence of bytes ending with ``\n``.
pt_br: Lê uma linha, onde "line" é uma sequência de bytes encerrando com ``\n``.

source: If EOF is received and ``\n`` was not found, the method returns partially read data.
pt_br: Se EOF é recebido e ``\n`` não foi encontrado, o método retorna os dados parcialmente lidos.

source: If EOF is received and the internal buffer is empty, return an empty ``bytes`` object.
pt_br: Se EOF for recebido e o buffer interno estiver vazio, retorna um objeto ``bytes`` vazio.

source: Read exactly *n* bytes.
pt_br: Lê exatamente *n* bytes.

source: Raise an :exc:`IncompleteReadError` if EOF is reached before *n* can be read. Use the :attr:`IncompleteReadError.partial` attribute to get the partially read data.
pt_br: Levanta um :exc:`IncompleteReadError` se EOF é atingido antes que *n* sejam lidos. Use o atributo :attr:`IncompleteReadError.partial` para obter os dados parcialmente lidos.

source: Read data from the stream until *separator* is found.
pt_br: Lê dados a partir do stream até que *separator* seja encontrado.

source: On success, the data and separator will be removed from the internal buffer (consumed). Returned data will include the separator at the end.
pt_br: Ao ter sucesso, os dados e o separador serão removidos do buffer interno (consumido). Dados retornados irão incluir o separador no final.

source: If the amount of data read exceeds the configured stream limit, a :exc:`LimitOverrunError` exception is raised, and the data is left in the internal buffer and can be read again.
pt_br: Se a quantidade de dados lidos excede o limite configurado para o stream, uma exceção :exc:`LimitOverrunError` é levantada, e os dados são deixados no buffer interno e podem ser lidos novamente.

source: If EOF is reached before the complete separator is found, an :exc:`IncompleteReadError` exception is raised, and the internal buffer is reset. The :attr:`IncompleteReadError.partial` attribute may contain a portion of the separator.
pt_br: Se EOF for atingido antes que o separador completo seja encontrado, uma exceção :exc:`IncompleteReadError` é levantada, e o buffer interno é redefinido. O atributo :attr:`IncompleteReadError.partial` pode conter uma parte do separador.

source: Return ``True`` if the buffer is empty and :meth:`feed_eof` was called.
pt_br: Retorna ``True`` se o buffer estiver vazio e :meth:`feed_eof` foi chamado.

source: Represents a writer object that provides APIs to write data to the IO stream.
pt_br: Representa um objeto de escrita que fornece APIs para escrever dados para o stream de IO.

source: It is not recommended to instantiate *StreamWriter* objects directly; use :func:`open_connection` and :func:`start_server` instead.
pt_br: Não é recomendado instanciar objetos *StreamWriter* diretamente; use :func:`open_connection` e :func:`start_server` ao invés.

source: The method attempts to write the *data* to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
pt_br: O método tenta escrever *data* para o soquete subjacente imediatamente. Se isso falhar, data é enfileirado em um buffer interno de escrita, até que possa ser enviado.

source: The method should be used along with the ``drain()`` method::
pt_br: O método deve ser usado juntamente com o método ``drain()``::

source: The method writes a list (or any iterable) of bytes to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
pt_br: O método escreve imediatamente a lista (ou qualquer iterável) de bytes para o soquete subjacente. Se isso falhar, os dados são enfileirados em um buffer de escrita interno até que possam ser enviados.

source: The method closes the stream and the underlying socket.
pt_br: O método fecha o stream e o soquete subjacente.

source: Return ``True`` if the underlying transport supports the :meth:`write_eof` method, ``False`` otherwise.
pt_br: Retorna ``True`` se o transporte subjacente suporta o método :meth:`write_eof`, ``False`` caso contrário.

source: Close the write end of the stream after the buffered write data is flushed.
pt_br: Fecha o extremo de escrita do stream após os dados no buffer de escrita terem sido descarregados.

source: Return the underlying asyncio transport.
pt_br: Retorna o transporte asyncio subjacente.

source: Access optional transport information; see :meth:`BaseTransport.get_extra_info` for details.
pt_br: Acessa informações de transporte opcionais; veja :meth:`BaseTransport.get_extra_info` para detalhes.

source: Wait until it is appropriate to resume writing to the stream. Example::
pt_br: Aguarda até que seja apropriado continuar escrevendo no stream. Exemplo::

source: This is a flow control method that interacts with the underlying IO write buffer. When the size of the buffer reaches the high watermark, *drain()* blocks until the size of the buffer is drained down to the low watermark and writing can be resumed. When there is nothing to wait for, the :meth:`drain` returns immediately.
pt_br: Este é um método de controle de fluxo que interage com o buffer de entrada e saída de escrita subjacente. Quando o tamanho do buffer atinge a marca d'água alta, *drain()* bloqueia até que o tamanho do buffer seja drenado para a marca d'água baixa, e a escrita possa continuar. Quando não existe nada que cause uma espera, o método :meth:`drain` retorna imediatamente.

source: Parameters:
pt_br: Parâmetros:

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
pt_br: *sslcontext*: uma instância configurada de :class:`~ssl.SSLContext`.

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
pt_br: *server_hostname*: define ou substitui o nome do host no qual o servidor alvo do certificado será comparado.

source: Return ``True`` if the stream is closed or in the process of being closed.
pt_br: Retorna ``True`` se o stream estiver fechado ou em processo de ser fechado.

source: Wait until the stream is closed.
pt_br: Aguarda até que o stream seja fechado.

source: Examples
pt_br: Exemplos

source: TCP echo client using streams
pt_br: Cliente para eco TCP usando streams

source: TCP echo client using the :func:`asyncio.open_connection` function::
pt_br: Cliente de eco TCP usando a função :func:`asyncio.open_connection`::

source: The :ref:`TCP echo client protocol <asyncio_example_tcp_echo_client_protocol>` example uses the low-level :meth:`loop.create_connection` method.
pt_br: O exemplo de :ref:`protocolo do cliente para eco TCP <asyncio_example_tcp_echo_client_protocol>` usa o método de baixo nível :meth:`loop.create_connection`.

source: TCP echo server using streams
pt_br: Servidor eco TCP usando streams

source: TCP echo server using the :func:`asyncio.start_server` function::
pt_br: Servidor eco TCP usando a função :func:`asyncio.start_server`::

source: The :ref:`TCP echo server protocol <asyncio_example_tcp_echo_server_protocol>` example uses the :meth:`loop.create_server` method.
pt_br: O exemplo de :ref:`protocolo eco de servidor TCP <asyncio_example_tcp_echo_server_protocol>` utiliza o método :meth:`loop.create_server`.

source: Get HTTP headers
pt_br: Obtém headers HTTP

source: Simple example querying HTTP headers of the URL passed on the command line::
pt_br: Exemplo simples consultando cabeçalhos HTTP da URL passada na linha de comando::

source: Usage::
pt_br: Uso::

source: or with HTTPS::
pt_br: ou com HTTPS::

source: Register an open socket to wait for data using streams
pt_br: Registra um soquete aberto para aguardar por dados usando streams

source: Coroutine waiting until a socket receives data using the :func:`open_connection` function::
pt_br: Corrotina aguardando até que um soquete receba dados usando a função :func:`open_connection`::

source: The :ref:`register an open socket to wait for data using a protocol <asyncio_example_create_connection>` example uses a low-level protocol and the :meth:`loop.create_connection` method.
pt_br: O exemplo de :ref:`registro de um soquete aberto para aguardar por dados usando um protocolo <asyncio_example_create_connection>` utiliza um protocolo de baixo nível e o método :meth:`loop.create_connection`.

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to watch a file descriptor.
pt_br: O exemplo para :ref:`monitorar um descritor de arquivo para leitura de eventos <asyncio_example_watch_fd>` utiliza o método de baixo nível :meth:`loop.add_reader` para monitorar um descritor de arquivo.
