Repository: python/python-docs-pt-br
Catalog: library/asyncio-task.po
Languages: pt_br

source: *delay* can either be ``None``, or a float/int number of seconds to wait. If *delay* is ``None``, no time limit will be applied; this can be useful if the delay is unknown when the context manager is created.
pt_br: *delay* может быть либо None, либо числом в секундах ожидания с плавающей запятой/int. Если *delay* имеет значение «None», ограничение по времени применяться не будет; это может быть полезно, если задержка неизвестна при создании диспетчера контекста.

source: In either case, the context manager can be rescheduled after creation using :meth:`Timeout.reschedule`.
pt_br: В любом случае диспетчер контекста может быть перепланирован после создания с помощью :meth:`Timeout.reschedule`.

source: If ``long_running_task`` takes more than 10 seconds to complete, the context manager will cancel the current task and handle the resulting :exc:`asyncio.CancelledError` internally, transforming it into a :exc:`TimeoutError` which can be caught and handled.
pt_br: Если выполнение ``long_running_task`` занимает более 10 секунд, контекстный менеджер отменит текущую задачу и обработает полученную :exc:`asyncio.CancelledError` внутри себя, преобразуя ее в :exc:`TimeoutError`, которую можно перехватить. и справился.

source: The :func:`asyncio.timeout` context manager is what transforms the :exc:`asyncio.CancelledError` into a :exc:`TimeoutError`, which means the :exc:`TimeoutError` can only be caught *outside* of the context manager.
pt_br: Контекстный менеджер :func:`asyncio.timeout` преобразует :exc:`asyncio.CancelledError` в :exc:`TimeoutError`, что означает, что :exc:`TimeoutError` может быть обнаружен только *вне* контекстный менеджер.

source: Example of catching :exc:`TimeoutError`::
pt_br: Пример перехвата :exc:`TimeoutError`::

source: The context manager produced by :func:`asyncio.timeout` can be rescheduled to a different deadline and inspected.
pt_br: Менеджер контекста, созданный :func:`asyncio.timeout`, может быть перенесен на другой крайний срок и проверен.

source: An :ref:`asynchronous context manager <async-context-managers>` for cancelling overdue coroutines.
pt_br: :ref:`асинхронный контекстный менеджер <async-context-managers>` для отмены просроченных сопрограмм.

source: ``when`` should be an absolute time at which the context should time out, as measured by the event loop's clock:
pt_br: ``when`` должно быть абсолютным временем, в которое контекст должен истечь, измеряемым часами цикла событий:

source: If ``when`` is ``None``, the timeout will never trigger.
pt_br: If ``when`` is ``None``, тайм-аут никогда не сработает.

source: If ``when < loop.time()``, the timeout will trigger on the next iteration of the event loop.
pt_br: If ``when < loop.time()``, тайм-аут сработает на следующей итерации цикла событий.

source: Return the current deadline, or ``None`` if the current deadline is not set.
pt_br: Возвращает текущий срок или «Нет», если текущий срок не установлен.

source: Reschedule the timeout.
pt_br: Перепланируйте тайм-аут.

source: Return whether the context manager has exceeded its deadline (expired).
pt_br: Перепланируйте тайм-аут.

source: Timeout context managers can be safely nested.
pt_br: Менеджеры контекста таймаута могут быть безопасно вложены.

source: Similar to :func:`asyncio.timeout`, except *when* is the absolute time to stop waiting, or ``None``.
pt_br: Аналогично :func:`asyncio.timeout`, за исключением того, что *when* — это абсолютное время прекращения ожидания или ``None``.

source: Wait for the *aw* :ref:`awaitable <asyncio-awaitables>` to complete with a timeout.
pt_br: Espera o :ref:`aguardável <asyncio-awaitables>` *aw* concluir sem ultrapassar o tempo limite "timeout".

source: *timeout* can either be ``None`` or a float or int number of seconds to wait for. If *timeout* is ``None``, block until the future completes.
pt_br: *timeout* pode ser ``None``, ou um ponto flutuante, ou um número inteiro de segundos para aguardar. Se *timeout* é ``None``, aguarda até o future encerrar.

source: If a timeout occurs, it cancels the task and raises :exc:`TimeoutError`.
pt_br: Если происходит таймаут, задача отменяется и выдается :exc:`TimeoutError`.

source: To avoid the task :meth:`cancellation <Task.cancel>`, wrap it in :func:`shield`.
pt_br: Para evitar o :meth:`cancelamento <Task.cancel>` da tarefa, envolva-a com :func:`shield`.

source: The function will wait until the future is actually cancelled, so the total wait time may exceed the *timeout*. If an exception happens during cancellation, it is propagated.
pt_br: A função irá aguardar até o future ser realmente cancelado, então o tempo total de espera pode exceder o tempo limite *timeout*. Se uma exceção ocorrer durante o cancelamento, ela será propagada.

source: If the wait is cancelled, the future *aw* is also cancelled.
pt_br: Se ele for cancelado, o future *aw* também é cancelado.

source: When *aw* is cancelled due to a timeout, ``wait_for`` waits for *aw* to be cancelled. Previously, it raised :exc:`TimeoutError` immediately.
pt_br: Когда *aw* отменяется из-за таймаута, ``wait_for`` ожидает отмены *aw*. Раньше он немедленно вызывал :exc:`TimeoutError`.

source: Raises :exc:`TimeoutError` instead of :exc:`asyncio.TimeoutError`.
pt_br: Вызывает :exc:`TimeoutError` вместо :exc:`asyncio.TimeoutError`.

source: Waiting Primitives
pt_br: Primitivas de Espera

source: Run :class:`~asyncio.Future` and :class:`~asyncio.Task` instances in the *aws* iterable concurrently and block until the condition specified by *return_when*.
pt_br: Запускайте экземпляры :class:`~asyncio.Future` и :class:`~asyncio.Task` в итерации *aws* одновременно и блокируйте их до тех пор, пока не будет выполнено условие, указанное в *return_when*.

source: Returns two sets of Tasks/Futures: ``(done, pending)``.
pt_br: Retorna dois conjuntos de Tarefas/Futuros: ``(done, pending)``.

source: Usage::
pt_br: Uso::

source: *timeout* (a float or int), if specified, can be used to control the maximum number of seconds to wait before returning.
pt_br: *timeout* (um ponto flutuante ou inteiro), se especificado, pode ser usado para controlar o número máximo de segundos para aguardar antes de retornar.

source: Note that this function does not raise :exc:`TimeoutError`. Futures or Tasks that aren't done when the timeout occurs are simply returned in the second set.
pt_br: Обратите внимание, что эта функция не вызывает :exc:`TimeoutError`. Фьючерсы или задачи, которые не выполнены по истечении тайм-аута, просто возвращаются во втором наборе.

source: *return_when* indicates when this function should return. It must be one of the following constants:
pt_br: *return_when* indica quando esta função deve retornar. Ele deve ser uma das seguintes constantes:

source: Constant
pt_br: Constante

source: Description
pt_br: Descrição

source: The function will return when any future finishes or is cancelled.
pt_br: A função irá retornar quando qualquer futuro terminar ou for cancelado.

source: The function will return when any future finishes by raising an exception. If no future raises an exception then it is equivalent to :const:`ALL_COMPLETED`.
pt_br: Функция вернется, когда любое будущее завершится вызовом исключения. Если никакое будущее не вызывает исключение, это эквивалентно :const:`ALL_COMPLETED`.

source: The function will return when all futures finish or are cancelled.
pt_br: A função irá retornar quando todos os futuros encerrarem ou forem cancelados.

source: Unlike :func:`~asyncio.wait_for`, ``wait()`` does not cancel the futures when a timeout occurs.
pt_br: Diferente de :func:`~asyncio.wait_for`, ``wait()`` não cancela os futuros quando um tempo limite é atingido.

source: Passing coroutine objects to ``wait()`` directly is forbidden.
pt_br: Передача объектов сопрограммы напрямую в wait() запрещена.

source: Raises :exc:`TimeoutError` if the timeout occurs before all Futures are done.
pt_br: Вызывает :exc:`TimeoutError`, если таймаут наступает до того, как все фьючерсы будут выполнены.

source: Deprecation warning is emitted if not all awaitable objects in the *aws* iterable are Future-like objects and there is no running event loop.
pt_br: Aviso de descontinuidade é emitido se nem todos os objetos aguardáveis no iterável *aws* forem objetos similar a Futuro, e não existe nenhum laço de eventos em execução.

source: Running in Threads
pt_br: Executando em Threads

source: Asynchronously run function *func* in a separate thread.
pt_br: Executa a função *func* assincronamente em uma thread separada.

source: Any \*args and \*\*kwargs supplied for this function are directly passed to *func*. Also, the current :class:`contextvars.Context` is propagated, allowing context variables from the event loop thread to be accessed in the separate thread.
pt_br: Quaisquer \*args e \*\*kwargs fornecidos para esta função são diretamente passados para *func*. Além disso, o :class:`contextvars.Context` atual é propagado, permitindo que variáveis de contexto da thread do laço de eventos sejam acessadas na thread separada.

source: Return a coroutine that can be awaited to get the eventual result of *func*.
pt_br: Retorna uma corrotina que pode ser aguardada para obter o resultado eventual de *func*.

source: This coroutine function is primarily intended to be used for executing IO-bound functions/methods that would otherwise block the event loop if they were run in the main thread. For example::
pt_br: Эта функция сопрограммы в первую очередь предназначена для выполнения функций/методов, связанных с вводом-выводом, которые в противном случае заблокировали бы цикл событий, если бы они были запущены в основном потоке. Например::

source: Directly calling ``blocking_io()`` in any coroutine would block the event loop for its duration, resulting in an additional 1 second of run time. Instead, by using ``asyncio.to_thread()``, we can run it in a separate thread without blocking the event loop.
pt_br: Chamar diretamente ``blocking_io()`` em qualquer corrotina iria bloquear o laço de eventos durante a sua duração, resultando em 1 segundo adicional no tempo de execução. Ao invés disso, ao utilizar ``asyncio.to_thread()``, nós podemos executá-la em uma thread separada sem bloquear o laço de eventos.

source: Due to the :term:`GIL`, ``asyncio.to_thread()`` can typically only be used to make IO-bound functions non-blocking. However, for extension modules that release the GIL or alternative Python implementations that don't have one, ``asyncio.to_thread()`` can also be used for CPU-bound functions.
pt_br: Devido à :term:`GIL`, ``asyncio.to_thread()`` pode tipicamente ser usado apenas para fazer funções vinculadas a IO não-bloqueantes. Entretanto, para módulos de extensão que liberam o GIL ou implementações alternativas do Python que não tem um, ``asyncio.to_thread()`` também pode ser usado para funções vinculadas à CPU.

source: Scheduling From Other Threads
pt_br: Agendando a partir de outras Threads

source: Submit a coroutine to the given event loop. Thread-safe.
pt_br: Envia uma corrotina para o laço de eventos fornecido. Seguro para thread.

source: Return a :class:`concurrent.futures.Future` to wait for the result from another OS thread.
pt_br: Retorna um :class:`concurrent.futures.Future` para aguardar pelo resultado de outra thread do sistema operacional.

source: This function is meant to be called from a different OS thread than the one where the event loop is running. Example::
pt_br: Esta função destina-se a ser chamada partir de uma thread diferente do sistema operacional, da qual o laço de eventos está executando. Exemplo::

source: If an exception is raised in the coroutine, the returned Future will be notified. It can also be used to cancel the task in the event loop::
pt_br: Se uma exceção for levantada na corrotina, o Futuro retornado será notificado. Isso também pode ser usado para cancelar a tarefa no laço de eventos::

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
pt_br: Veja a seção :ref:`concorrência e multithreading <asyncio-multithreading>` da documentação.

source: Unlike other asyncio functions this function requires the *loop* argument to be passed explicitly.
pt_br: Ao contrário de outras funções asyncio, esta função requer que o argumento *loop* seja passado explicitamente.

source: Introspection
pt_br: Introspecção

source: Return the currently running :class:`Task` instance, or ``None`` if no task is running.
pt_br: Retorna a instância :class:`Task` atualmente em execução, ou ``None`` se nenhuma tarefa estiver executando.

source: If *loop* is ``None`` :func:`get_running_loop` is used to get the current loop.
pt_br: Se *loop* for ``None``, então :func:`get_running_loop` é usado para obter o laço atual.

source: Return a set of not yet finished :class:`Task` objects run by the loop.
pt_br: Retorna um conjunto de objetos :class:`Task` ainda não concluídos a serem executados pelo laço.

source: If *loop* is ``None``, :func:`get_running_loop` is used for getting current loop.
pt_br: Se *loop* for ``None``, então :func:`get_running_loop` é usado para obter o laço atual.

source: Return ``True`` if *obj* is a coroutine object.
pt_br: Верните ``True``, если *obj* является объектом сопрограммы.

source: Task Object
pt_br: Objeto Task

source: A :class:`Future-like <Future>` object that runs a Python :ref:`coroutine <coroutine>`. Not thread-safe.
pt_br: Um objeto :class:`similar a Futuro <Future>` que executa uma :ref:`corrotina <coroutine>` Python. Não é seguro para thread.

source: Tasks are used to run coroutines in event loops. If a coroutine awaits on a Future, the Task suspends the execution of the coroutine and waits for the completion of the Future. When the Future is *done*, the execution of the wrapped coroutine resumes.
pt_br: Tarefas são usadas para executar corrotinas em laços de eventos. Se uma corrotina espera por um Futuro, a Tarefa suspende a execução da corrotina e aguarda a conclusão do Futuro. Quando o Futuro é *concluído*, a execução da corrotina contida é retomada.

source: Event loops use cooperative scheduling: an event loop runs one Task at a time. While a Task awaits for the completion of a Future, the event loop runs other Tasks, callbacks, or performs IO operations.
pt_br: Laço de eventos usam agendamento cooperativo: um ciclo de evento executa uma Tarefa de cada vez. Enquanto uma Tarefa aguarda a conclusão de um Futuro, o laço de eventos executa outras Tarefas, funções de retorno, ou executa operações de IO.

source: Use the high-level :func:`asyncio.create_task` function to create Tasks, or the low-level :meth:`loop.create_task` or :func:`ensure_future` functions. Manual instantiation of Tasks is discouraged.
pt_br: Use a função de alto nível :func:`asyncio.create_task` para criar Tarefas, ou as funções de baixo nível :meth:`loop.create_task` ou :func:`ensure_future`. Instanciação manual de Tarefas é desencorajado.

source: To cancel a running Task use the :meth:`cancel` method. Calling it will cause the Task to throw a :exc:`CancelledError` exception into the wrapped coroutine. If a coroutine is awaiting on a Future object during cancellation, the Future object will be cancelled.
pt_br: Para cancelar uma Tarefa em execução, use o método :meth:`cancel`. Chamar ele fará com que a Tarefa levante uma exceção :exc:`CancelledError` dentro da corrotina contida. Se a corrotina estiver esperando por um objeto Future durante o cancelamento, o objeto Future será cancelado.

source: :meth:`cancelled` can be used to check if the Task was cancelled. The method returns ``True`` if the wrapped coroutine did not suppress the :exc:`CancelledError` exception and was actually cancelled.
pt_br: :meth:`cancelled` pode ser usado para verificar se a Tarefa foi cancelada. O método retorna ``True`` se a corrotina envolta não suprimiu a exceção :exc:`CancelledError` e foi na verdade cancelada.

source: :class:`asyncio.Task` inherits from :class:`Future` all of its APIs except :meth:`Future.set_result` and :meth:`Future.set_exception`.
pt_br: :class:`asyncio.Task` herda de :class:`Future` todas as suas APIs exceto :meth:`Future.set_result` e :meth:`Future.set_exception`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. If no *context* is provided, the Task copies the current context and later runs its coroutine in the copied context.
pt_br: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для запуска *coro*. Если *context* не указан, Задача копирует текущий контекст и позже запускает свою сопрограмму в скопированный контекст.

source: Added support for the :mod:`contextvars` module.
pt_br: Adicionado suporte para o módulo :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
pt_br: Aviso de descontinuidade é emitido se *loop* não é especificado, e não existe nenhum laço de eventos em execução.

source: Return ``True`` if the Task is *done*.
pt_br: Retorna ``True`` se a Tarefa estiver *concluída*.

source: A Task is *done* when the wrapped coroutine either returned a value, raised an exception, or the Task was cancelled.
pt_br: Uma Tarefa está *concluída* quando a corrotina contida retornou um valor, ou levantou uma exceção, ou a Tarefa foi cancelada.

source: Return the result of the Task.
pt_br: Retorna o resultado da Tarefa.

source: If the Task is *done*, the result of the wrapped coroutine is returned (or if the coroutine raised an exception, that exception is re-raised.)
pt_br: Se a Tarefa estiver *concluída*, o resultado da corrotina contida é retornado (ou se a corrotina levantou uma exceção, essa exceção é re-levantada.)

source: If the Task has been *cancelled*, this method raises a :exc:`CancelledError` exception.
pt_br: Se a Tarefa foi *cancelada*, este método levanta uma exceção :exc:`CancelledError`.

source: If the Task's result isn't yet available, this method raises a :exc:`InvalidStateError` exception.
pt_br: Se o resultado da Tarefa não estiver disponível ainda, este método levanta uma exceção :exc:`InvalidStateError`.

source: Return the exception of the Task.
pt_br: Retorna a exceção de uma Tarefa.

source: If the wrapped coroutine raised an exception that exception is returned. If the wrapped coroutine returned normally this method returns ``None``.
pt_br: Se a corrotina contida levantou uma exceção, essa exceção é retornada. Se a corrotina contida retornou normalmente, este método retorna ``None``.

source: If the Task isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
pt_br: Se a Tarefa não estiver *concluída* ainda, este método levanta uma exceção :exc:`InvalidStateError`.

source: Add a callback to be run when the Task is *done*.
pt_br: Adiciona uma função de retorno para ser executada quando a Tarefa estiver *concluída*.

source: This method should only be used in low-level callback-based code.
pt_br: Este método deve ser usado apenas em código de baixo nível baseado em funções de retorno.

source: See the documentation of :meth:`Future.add_done_callback` for more details.
pt_br: Veja a documentação para :meth:`Future.add_done_callback` para mais detalhes.

source: Remove *callback* from the callbacks list.
pt_br: Remove *callback* da lista de funções de retorno.

source: See the documentation of :meth:`Future.remove_done_callback` for more details.
pt_br: Veja a documentação do método :meth:`Future.remove_done_callback` para mais detalhes.

source: Return the list of stack frames for this Task.
pt_br: Retorna a lista de frames da pilha para esta Tarefa.

source: If the wrapped coroutine is not done, this returns the stack where it is suspended. If the coroutine has completed successfully or was cancelled, this returns an empty list. If the coroutine was terminated by an exception, this returns the list of traceback frames.
pt_br: Se a corrotina contida não estiver concluída, isto retorna a pilha onde ela foi suspensa. Se a corrotina foi concluída com sucesso ou foi cancelada, isto retorna uma lista vazia. Se a corrotina foi terminada por uma exceção, isto retorna a lista de frames do traceback (situação da pilha de execução).

source: The frames are always ordered from oldest to newest.
pt_br: Os quadros são sempre ordenados dos mais antigos para os mais recentes.

source: Only one stack frame is returned for a suspended coroutine.
pt_br: Apenas um frame da pilha é retornado para uma corrotina suspensa.

source: The optional *limit* argument sets the maximum number of frames to return; by default all available frames are returned. The ordering of the returned list differs depending on whether a stack or a traceback is returned: the newest frames of a stack are returned, but the oldest frames of a traceback are returned. (This matches the behavior of the traceback module.)
pt_br: O argumento opcional *limit* define o o número de frames máximo para retornar; por padrão todos os frames disponíveis são retornados. O ordenamento da lista retornada é diferente dependendo se uma pilha ou um traceback (situação da pilha de execução) é retornado: os frames mais recentes de uma pilha são retornados, mas os frames mais antigos de um traceback são retornados. (Isso combina com o comportamento do módulo traceback.)

source: Print the stack or traceback for this Task.
pt_br: Exibe a pilha ou situação da pilha de execução para esta Tarefa.

source: This produces output similar to that of the traceback module for the frames retrieved by :meth:`get_stack`.
pt_br: Isto produz uma saída similar a do módulo traceback para frames recuperados por :meth:`get_stack`.

source: The *limit* argument is passed to :meth:`get_stack` directly.
pt_br: O argumento *limit* é passado para :meth:`get_stack` diretamente.

source: The *file* argument is an I/O stream to which the output is written; by default output is written to :data:`sys.stdout`.
pt_br: Аргумент *file* представляет собой поток ввода-вывода, в который записываются выходные данные; по умолчанию вывод записывается в :data:`sys.stdout`.

source: Return the coroutine object wrapped by the :class:`Task`.
pt_br: Retorna o objeto corrotina contido pela :class:`Task`.

source: Return the name of the Task.
pt_br: Retorna o nome da Tarefa.

source: If no name has been explicitly assigned to the Task, the default asyncio Task implementation generates a default name during instantiation.
pt_br: Se nenhum nome foi explicitamente designado para a Tarefa, a implementação padrão asyncio da classe Task gera um nome padrão durante a instanciação.

source: Set the name of the Task.
pt_br: Define o nome da Tarefa.

source: The *value* argument can be any object, which is then converted to a string.
pt_br: O argumento *value* pode ser qualquer objeto, o qual é então convertido para uma string.

source: In the default Task implementation, the name will be visible in the :func:`repr` output of a task object.
pt_br: Na implementação padrão da Tarefa, o nome será visível na :func:`repr` de saída de um objeto task.

source: Request the Task to be cancelled.
pt_br: Solicita o cancelamento da Tarefa.

source: This arranges for a :exc:`CancelledError` exception to be thrown into the wrapped coroutine on the next cycle of the event loop.
pt_br: Isto prepara para uma exceção :exc:`CancelledError` ser lançada na corrotina contida no próximo ciclo do laço de eventos.
