Repository: python/python-docs-pt-br
Catalog: library/asyncio-extending.po
Languages: pt_br

source: Extending
pt_br: Extensão

source: The main direction for :mod:`asyncio` extending is writing custom *event loop* classes. Asyncio has helpers that could be used to simplify this task.
pt_br: A direção principal para estender o módulo :mod:`asyncio` é escrever classes de *laços de eventos* personalizados. O Asyncio tem funções auxiliares que podem ser usadas para simplificar essa tarefa.

source: Third-parties should reuse existing asyncio code with caution, a new Python version is free to break backward compatibility in *internal* part of API.
pt_br: Terceiros devem reutilizar o código assíncrono existente com cuidado. Uma versão nova de Python pode quebrar a compatibilidade com versões anteriores da parte *interna* da API.

source: Writing a Custom Event Loop
pt_br: Escrevendo um laço de eventos personalizado

source: :class:`asyncio.AbstractEventLoop` declares very many methods. Implementing all them from scratch is a tedious job.
pt_br: :class:`asyncio.AbstractEventLoop` declara muitos métodos. Implementar todos eles do zero é um trabalho tedioso.

source: A loop can get many common methods implementation for free by inheriting from :class:`asyncio.BaseEventLoop`.
pt_br: Um laço de eventos pode herdar várias implementações de métodos da classe :class:`asyncio.BaseEventLoop`.

source: In turn, the successor should implement a bunch of *private* methods declared but not implemented in :class:`asyncio.BaseEventLoop`.
pt_br: Por sua vez, o sucessor deve implementar um conjunto de métodos *privados* declarados, porém não implementados, em :class:`asyncio.BaseEventLoop`.

source: For example, ``loop.create_connection()`` checks arguments, resolves DNS addresses, and calls ``loop._make_socket_transport()`` that should be implemented by inherited class. The ``_make_socket_transport()`` method is not documented and is considered as an *internal* API.
pt_br: Por exemplo, ``loop.create_connection()``verifica os argumentos, resolve endereços DNS, e chama a função ``loop._make_socket_transport()``, que deve ser implementada pela classe herdada. O método``_make_socket_transport()`` não está documentado, e é considerado parte de uma API *interna*.

source: Future and Task private constructors
pt_br: Construtores privados de Future e Task

source: :class:`asyncio.Future` and :class:`asyncio.Task` should be never created directly, please use corresponding :meth:`loop.create_future` and :meth:`loop.create_task`, or :func:`asyncio.create_task` factories instead.
pt_br: As classes :class:`asyncio.Future` e :class:`asyncio.Task` nunca deverão ser criadas diretamente. Por favor, as substitua pelas *factories* correspondentes: :meth:`loop.create_future` e :meth:`loop.create_task` ou :func:`asyncio.create_task`.

source: However, third-party *event loops* may *reuse* built-in future and task implementations for the sake of getting a complex and highly optimized code for free.
pt_br: Porém, *laços de eventos* de terceiros podem *reutilizar* as implementações embutidas de Future e Task, obtendo um código complexo e altamente otimizado.

source: For this purpose the following, *private* constructors are listed:
pt_br: Por isso, segue a listagem de construtores *privados*:

source: Create a built-in future instance.
pt_br: Cria uma instância de Future embutida.

source: *loop* is an optional event loop instance.
pt_br: *loop* é uma instância opcional do laço de eventos.

source: Create a built-in task instance.
pt_br: Cria uma instância embutida de Task.

source: *loop* is an optional event loop instance. The rest of arguments are described in :meth:`loop.create_task` description.
pt_br: *loop* é uma instância opcional do laço de eventos. Os outros argumentos estão descritos em :meth:`loop.create_task`.

source: *context* argument is added.
pt_br: o argumento *context* foi adicionado

source: Task lifetime support
pt_br: Suporte ao ciclo de vida de tarefas

source: A third party task implementation should call the following functions to keep a task visible by :func:`asyncio.all_tasks` and :func:`asyncio.current_task`:
pt_br: Implementações de Task de terceiros devem chamar as seguintes funções para manter uma tarefa visível para :func:`asyncio.all_tasks` e :func:`asyncio.current_task`:

source: Register a new *task* as managed by *asyncio*.
pt_br: Registra uma nova *task* como gerenciada pelo *asyncio*.

source: Call the function from a task constructor.
pt_br: Chame esta função no construtor de uma tarefa.

source: Unregister a *task* from *asyncio* internal structures.
pt_br: Cancela o registro de *task* nas estruturas internas do *asyncio*.

source: The function should be called when a task is about to finish.
pt_br: Chame esta função quando a tarefa estiver terminando.

source: Switch the current task to the *task* argument.
pt_br: Troca a tarefa atual para o argumento *task*.

source: Call the function just before executing a portion of embedded *coroutine* (:meth:`coroutine.send` or :meth:`coroutine.throw`).
pt_br: Chame esta função logo antes de executar uma porção da *corrotina* embutida (:meth:`coroutine.send` ou :meth:`coroutine.throw`).

source: Switch the current task back from *task* to ``None``.
pt_br: Troca a tarefa atual de *task* para ``None``.

source: Call the function just after :meth:`coroutine.send` or :meth:`coroutine.throw` execution.
pt_br: Chame esta função logo após executar :meth:`coroutine.send` ou :meth:`coroutine.throw`.
