Repository: python/python-docs-pt-br
Catalog: library/asyncio-exceptions.po
Languages: pt_br

source: Exceptions
pt_br: Exceções

source: The operation has exceeded the given deadline.
pt_br: A operação excedeu o prazo estabelecido.

source: This exception is different from the builtin :exc:`TimeoutError` exception.
pt_br: Esta exceção é diferente da exceção embutida :exc:`TimeoutError`.

source: The operation has been cancelled.
pt_br: A operação foi cancelada.

source: This exception can be caught to perform custom operations when asyncio Tasks are cancelled. In almost all situations the exception must be re-raised.
pt_br: Esta exceção pode ser capturada para executar operações personalizadas quando as tarefas assíncronas são canceladas. Em quase todas as situações, a exceção deve ser levantada novamente.

source: Invalid internal state of :class:`Task` or :class:`Future`.
pt_br: Estado interno inválido de :class:`Task` ou :class:`Future`.

source: Can be raised in situations like setting a result value for a *Future* object that already has a result value set.
pt_br: Pode ser levantada em situações como definir um valor de resultado para um objeto *Future* que já tem um valor de resultado definido.

source: The "sendfile" syscall is not available for the given socket or file type.
pt_br: A *syscall* "sendfile" não está disponível para o soquete ou tipo de arquivo fornecido.

source: A subclass of :exc:`RuntimeError`.
pt_br: Uma subclasse de :exc:`RuntimeError`.

source: The requested read operation did not complete fully.
pt_br: A operação de leitura solicitada não foi totalmente concluída.

source: Raised by the :ref:`asyncio stream APIs<asyncio-streams>`.
pt_br: Levantada pelas :ref:`APIs de fluxo de asyncio<asyncio-streams>`.

source: This exception is a subclass of :exc:`EOFError`.
pt_br: Esta exceção é uma subclasse de :exc:`EOFError`.

source: The total number (:class:`int`) of expected bytes.
pt_br: O número total (:class:`int`) de bytes esperados.

source: A string of :class:`bytes` read before the end of stream was reached.
pt_br: Uma string de :class:`bytes` lida antes do final do fluxo ser alcançado.

source: Reached the buffer size limit while looking for a separator.
pt_br: Atingiu o limite de tamanho do buffer ao procurar um separador.

source: Raised by the :ref:`asyncio stream APIs <asyncio-streams>`.
pt_br: Levantada pelas :ref:`APIs de fluxo de asyncio <asyncio-streams>`.

source: The total number of to be consumed bytes.
pt_br: O número total de bytes a serem consumidos.
