Repository: python/python-docs-pt-br
Catalog: library/asyncio-eventloop.po
Languages: pt_br

source: *sock* must be a non-blocking :const:`socket.SOCK_STREAM` :class:`~socket.socket`.
pt_br: *sock* deve ser um :class:`~socket.socket` :const:`socket.SOCK_STREAM` não bloqueante.

source: *file* must be a regular file object open in binary mode.
pt_br: *file* deve ser um objeto arquivo regular aberto em modo binário.

source: *fallback*, when set to ``True``, makes asyncio manually read and send the file when the platform does not support the sendfile syscall (e.g. Windows or SSL socket on Unix).
pt_br: *fallback*, quando definido para ``True``, faz asyncio ler e enviar manualmente o arquivo, quando a plataforma não suporta a chamada de sistema sendfile (por exemplo Windows ou soquete SSL no Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support *sendfile* syscall and *fallback* is ``False``.
pt_br: Levanta :exc:`SendfileNotAvailableError` se o sistema não suporta chamadas de sistema *sendfile* e *fallback* é ``False``.

source: Asynchronous version of :meth:`socket.getaddrinfo`.
pt_br: Versão assíncrona de :meth:`socket.getaddrinfo`.

source: Asynchronous version of :meth:`socket.getnameinfo`.
pt_br: Versão assíncrona de :meth:`socket.getnameinfo`.

source: Both *getaddrinfo* and *getnameinfo* methods were always documented to return a coroutine, but prior to Python 3.7 they were, in fact, returning :class:`asyncio.Future` objects. Starting with Python 3.7 both methods are coroutines.
pt_br: Ambos os métodos *getaddrinfo* e *getnameinfo* sempre foram documentados para retornar uma corrotina, mas antes do Python 3.7 eles estavam, na verdade, retornando objetos :class:`asyncio.Future`. A partir do Python 3.7, ambos os métodos são corrotinas.

source: Working with pipes
pt_br: Trabalhando com encadeamentos

source: Register the read end of *pipe* in the event loop.
pt_br: Registra o extremo da leitura de um *pipe* no laço de eventos.

source: *pipe* is a :term:`file-like object <file object>`.
pt_br: *pipe* é um :term:`objeto arquivo ou similar <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports the :class:`ReadTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
pt_br: Retorna um par ``(transport, protocol)``, onde *transport* suporta a interface :class:`ReadTransport` e *protocol* é um objeto instanciado pelo *protocol_factory*.

source: With :class:`SelectorEventLoop` event loop, the *pipe* is set to non-blocking mode.
pt_br: Com o :class:`SelectorEventLoop` do laço de eventos, o *pipe* é definido para modo não bloqueante.

source: Register the write end of *pipe* in the event loop.
pt_br: Registra o extremo de escrita do *pipe* no laço de eventos.

source: *pipe* is :term:`file-like object <file object>`.
pt_br: *pipe* é um :term:`objeto arquivo ou similar <file object>`.

source: Return pair ``(transport, protocol)``, where *transport* supports :class:`WriteTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
pt_br: Retorna um part ``(transport, protocol)``, onde *transport* suporta a interface :class:`WriteTransport` e *protocol* é um objeto instanciado pelo *protocol_factory*.

source: :class:`SelectorEventLoop` does not support the above methods on Windows. Use :class:`ProactorEventLoop` instead for Windows.
pt_br: :class:`SelectorEventLoop` não suporta os métodos acima no Windows. Use :class:`ProactorEventLoop` ao invés para Windows.

source: The :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
pt_br: Os métodos :meth:`loop.subprocess_exec` e :meth:`loop.subprocess_shell`.

source: Unix signals
pt_br: Sinais Unix

source: Set *callback* as the handler for the *signum* signal.
pt_br: Define *callback* como o tratador para o sinal *signum*.

source: The callback will be invoked by *loop*, along with other queued callbacks and runnable coroutines of that event loop. Unlike signal handlers registered using :func:`signal.signal`, a callback registered with this function is allowed to interact with the event loop.
pt_br: A função de retorno será invocada pelo *loop*, juntamente com outras funções de retorno enfileiradas e corrotinas executáveis daquele laço de eventos. Ao contrário de tratadores de sinal registrados usando :func:`signal.signal`, uma função de retorno registrada com esta função tem autorização para interagir com o laço de eventos.

source: Raise :exc:`ValueError` if the signal number is invalid or uncatchable. Raise :exc:`RuntimeError` if there is a problem setting up the handler.
pt_br: Levanta :exc:`ValueError` se o número do sinal é inválido ou impossível de capturar. Levanta :exc:`RuntimeError` se existe um problema definindo o tratador.

source: Like :func:`signal.signal`, this function must be invoked in the main thread.
pt_br: Assim como :func:`signal.signal`, esta função deve ser invocada na thread principal.

source: Remove the handler for the *sig* signal.
pt_br: Remove o tratador para o sinal *sig*.

source: Return ``True`` if the signal handler was removed, or ``False`` if no handler was set for the given signal.
pt_br: Retorna ``True`` se o tratador de sinal foi removido, ou ``False`` se nenhum tratador foi definido para o sinal fornecido.

source: The :mod:`signal` module.
pt_br: O módulo :mod:`signal`.

source: Executing code in thread or process pools
pt_br: Executando código em conjuntos de threads ou processos

source: Arrange for *func* to be called in the specified executor.
pt_br: Providencia para a *func* ser chamada no executor especificado.

source: This method returns a :class:`asyncio.Future` object.
pt_br: Este método retorna um objeto :class:`asyncio.Future`.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *func*.
pt_br: Use :func:`functools.partial` :ref:`para passar argumentos nomeados <asyncio-pass-keywords>` para *func*.

source: :meth:`loop.run_in_executor` no longer configures the ``max_workers`` of the thread pool executor it creates, instead leaving it up to the thread pool executor (:class:`~concurrent.futures.ThreadPoolExecutor`) to set the default.
pt_br: :meth:`loop.run_in_executor` não configura mais o atributo ``max_workers`` do executor do conjunto de thread que ele cria, ao invés disso ele deixa para o executor do conjunto de thread (:class:`~concurrent.futures.ThreadPoolExecutor`) para setar o valor padrão.

source: Error Handling API
pt_br: Tratando erros da API

source: Allows customizing how exceptions are handled in the event loop.
pt_br: Permite customizar como exceções são tratadas no laço de eventos.

source: Set *handler* as the new event loop exception handler.
pt_br: Define *handler* como o novo tratador de exceções do laço de eventos.

source: If *handler* is ``None``, the default exception handler will be set. Otherwise, *handler* must be a callable with the signature matching ``(loop, context)``, where ``loop`` is a reference to the active event loop, and ``context`` is a ``dict`` object containing the details of the exception (see :meth:`call_exception_handler` documentation for details about context).
pt_br: Se *handler* for ``None``, o tratador de exceções padrão será definido. Caso contrário, *handler* deve ser um chamável com a assinatura combinando ``(loop, context)``, onde ``loop`` é a referência para o laço de eventos ativo, e ``context`` é um objeto ``dict`` contendo os detalhes da exceção (veja a documentação :meth:`call_exception_handler` para detalhes a respeito do contexto).

source: Return the current exception handler, or ``None`` if no custom exception handler was set.
pt_br: Retorna o tratador de exceção atual, ou ``None`` se nenhum tratador de exceção customizado foi definido.

source: Default exception handler.
pt_br: Tratador de exceção padrão.

source: This is called when an exception occurs and no exception handler is set. This can be called by a custom exception handler that wants to defer to the default handler behavior.
pt_br: Isso é chamado quando uma exceção ocorre e nenhum tratador de exceção foi definido. Isso pode ser chamado por um tratador de exceção customizado que quer passar adiante para o comportamento do tratador padrão.

source: *context* parameter has the same meaning as in :meth:`call_exception_handler`.
pt_br: parâmetro *context* tem o mesmo significado que em :meth:`call_exception_handler`.

source: Call the current event loop exception handler.
pt_br: Chama o tratador de exceção do laço de eventos atual.

source: *context* is a ``dict`` object containing the following keys (new keys may be introduced in future Python versions):
pt_br: *context* é um objeto ``dict`` contendo as seguintes chaves (novas chaves podem ser introduzidas em versões futuras do Python):

source: 'message': Error message;
pt_br: 'message': Mensagem de erro;

source: 'exception' (optional): Exception object;
pt_br: 'exception' (opcional): Objeto Exception;

source: 'future' (optional): :class:`asyncio.Future` instance;
pt_br: 'future' (opcional): instância de :class:`asyncio.Future`;

source: 'task' (optional): :class:`asyncio.Task` instance;
pt_br: 'task' (opcional): instância de :class:`asyncio.Task`;

source: 'handle' (optional): :class:`asyncio.Handle` instance;
pt_br: 'handle' (opcional): instância de :class:`asyncio.Handle`;

source: 'protocol' (optional): :ref:`Protocol <asyncio-protocol>` instance;
pt_br: 'protocol' (opcional): instância de :ref:`Protocol <asyncio-protocol>`;

source: 'transport' (optional): :ref:`Transport <asyncio-transport>` instance;
pt_br: 'transport' (opcional): instância de :ref:`Transport <asyncio-transport>`;

source: 'socket' (optional): :class:`socket.socket` instance;
pt_br: 'socket' (opcional): instância de :class:`socket.socket`;

source: 'asyncgen' (optional): Asynchronous generator that caused
pt_br: 'asyncgen' (opcional): Gerador assíncrono que causou

source: the exception.
pt_br: a exceção.

source: Enabling debug mode
pt_br: Habilitando o modo de debug

source: Get the debug mode (:class:`bool`) of the event loop.
pt_br: Obtém o modo de debug (:class:`bool`) do laço de eventos.

source: The default value is ``True`` if the environment variable :envvar:`PYTHONASYNCIODEBUG` is set to a non-empty string, ``False`` otherwise.
pt_br: O valor padrão é ``True`` se a variável de ambiente :envvar:`PYTHONASYNCIODEBUG` estiver definida para uma string não vazia, ``False`` caso contrário.

source: Set the debug mode of the event loop.
pt_br: Define o modo de debug do laço de eventos.

source: The new :ref:`Python Development Mode <devmode>` can now also be used to enable the debug mode.
pt_br: O novo :ref:`Modo de Desenvolvimento do Python <devmode>` agora também pode ser usado para habilitar o modo de debug.

source: The :ref:`debug mode of asyncio <asyncio-debug-mode>`.
pt_br: O :ref:`modo de debug de asyncio <asyncio-debug-mode>`.

source: Running Subprocesses
pt_br: Executando Subprocessos

source: Methods described in this subsections are low-level. In regular async/await code consider using the high-level :func:`asyncio.create_subprocess_shell` and :func:`asyncio.create_subprocess_exec` convenience functions instead.
pt_br: Métodos descritos nestas sub-seções são de baixo nível. Em código async/await regular, considere usar as funções convenientes de alto nível :func:`asyncio.create_subprocess_shell` e :func:`asyncio.create_subprocess_exec` ao invés.

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
pt_br: No Windows, o laço de eventos padrão :class:`ProactorEventLoop` oferece suporte pra subprocessos, enquanto :class:`SelectorEventLoop`, não. Veja :ref:`Suporte para subprocessos no Windows <asyncio-windows-subprocess>` para detalhes.

source: Create a subprocess from one or more string arguments specified by *args*.
pt_br: Cria um subprocesso a partir de um ou mais argumentos de string especificados por *args*.

source: *args* must be a list of strings represented by:
pt_br: *args* deve ser uma lista de strings representada por:

source: or :class:`bytes`, encoded to the :ref:`filesystem encoding <filesystem-encoding>`.
pt_br: ou :class:`bytes`, encodados na :ref:`codificação do sistema de arquivos <filesystem-encoding>`.

source: The first string specifies the program executable, and the remaining strings specify the arguments. Together, string arguments form the ``argv`` of the program.
pt_br: A primeira string especifica o programa executável, e as strings remanescentes especificam os argumentos. Juntas, argumentos em string formam o ``argv`` do programa.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=False`` and the list of strings passed as the first argument; however, where :class:`~subprocess.Popen` takes a single argument which is list of strings, *subprocess_exec* takes multiple string arguments.
pt_br: Isto é similar a classe :class:`subprocess.Popen` da biblioteca padrão ser chamada com ``shell=False`` e a lista de strings ser passada como o primeiro argumento; entretanto, onde :class:`~subprocess.Popen` recebe apenas um argumento no qual é uma lista de strings, *subprocess_exec* recebe múltiplos argumentos string.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`asyncio.SubprocessProtocol` class.
pt_br: O *protocol_factory* deve ser um chamável que retorne uma subclasse da classe :class:`asyncio.SubprocessProtocol`.

source: Other parameters:
pt_br: Outros parâmetros:

source: *stdin* can be any of these:
pt_br: *stdin* pode ser qualquer um destes:

source: the :const:`subprocess.PIPE` constant (default) which will create a new pipe and connect it,
pt_br: a constante :const:`subprocess.PIPE` (padrão), a qual criará um novo encadeamento e conectar a ele,

source: the value ``None`` which will make the subprocess inherit the file descriptor from this process
pt_br: o valor ``None``, o qual fará o subprocesso herdar o descritor de arquivo deste processo

source: the :const:`subprocess.DEVNULL` constant which indicates that the special :data:`os.devnull` file will be used
pt_br: a constante :const:`subprocess.DEVNULL`, a qual indica que o arquivo especial :data:`os.devnull` será usado

source: *stdout* can be any of these:
pt_br: *stdout* pode ser qualquer um destes:

source: *stderr* can be any of these:
pt_br: *stderr* pode ser qualquer um destes:

source: the :const:`subprocess.STDOUT` constant which will connect the standard error stream to the process' standard output stream
pt_br: a constante :const:`subprocess.STDOUT`, a qual irá conectar o stream de erro padrão ao stream de saída padrão do processo

source: All other keyword arguments are passed to :class:`subprocess.Popen` without interpretation, except for *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* and *errors*, which should not be specified at all.
pt_br: Todos os outros argumentos nomeados são passados para :class:`subprocess.Popen` sem interpretação, exceto *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* e *errors*, os quais não devem ser especificados de forma alguma.

source: The ``asyncio`` subprocess API does not support decoding the streams as text. :func:`bytes.decode` can be used to convert the bytes returned from the stream to text.
pt_br: A API de subprocesso ``asyncio`` não suporta decodificar os streams como texto. :func:`bytes.decode` pode ser usado para converter os bytes retornados do stream para texto.

source: See the constructor of the :class:`subprocess.Popen` class for documentation on other arguments.
pt_br: Veja o construtor da classe :class:`subprocess.Popen` para documentação sobre outros argumentos.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`asyncio.SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
pt_br: Retorna um par ``(transport, protocol)``, onde *transport* conforma com a classe base :class:`asyncio.SubprocessTransport` e *protocol* é um objeto instanciado pelo *protocol_factory*.

source: Create a subprocess from *cmd*, which can be a :class:`str` or a :class:`bytes` string encoded to the :ref:`filesystem encoding <filesystem-encoding>`, using the platform's "shell" syntax.
pt_br: Cria um subprocesso a partir do *cmd*, o qual pode ser um :class:`str` ou uma string de :class:`bytes` codificada na :ref:`codificação do sistema de arquivos <filesystem-encoding>`, usando a sintaxe "shell" da plataforma.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=True``.
pt_br: Isto é similar a classe :class:`subprocess.Popen` da biblioteca padrão sendo chanada com ``shell=True``.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`SubprocessProtocol` class.
pt_br: O argumento *protocol_factory* deve ser um chamável que retorna uma subclasse da classe :class:`SubprocessProtocol`.

source: See :meth:`~loop.subprocess_exec` for more details about the remaining arguments.
pt_br: Veja :meth:`~loop.subprocess_exec` para mais detalhes sobre os argumentos remanescentes.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
pt_br: Retorna um par ``(transport, protocol)``, onde *transport* conforma com a classe base :class:`SubprocessTransport` e *protocol* é um objeto instanciado pelo *protocol_factory*.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special characters in strings that are going to be used to construct shell commands.
pt_br: É responsabilidade da aplicação garantir que todos os espaços em branco e caracteres especiais sejam tratados apropriadamente para evitar vulnerabilidades de `injeção shell <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ . A função :func:`shlex.quote` pode ser usada para escapar espaços em branco e caracteres especiais apropriadamente em strings que serão usadas para construir comandos shell.

source: Callback Handles
pt_br: Tratadores de função de retorno

source: A callback wrapper object returned by :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.
pt_br: Um objeto invólucro de função de retorno retornado por :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.

source: Cancel the callback. If the callback has already been canceled or executed, this method has no effect.
pt_br: Cancela a função de retorno. Se a função de retorno já tiver sido cancelada ou executada, este método não tem efeito.

source: Return ``True`` if the callback was cancelled.
pt_br: Retorna ``True`` se a função de retorno foi cancelada.

source: A callback wrapper object returned by :meth:`loop.call_later`, and :meth:`loop.call_at`.
pt_br: Um objeto invólucro de função de retorno retornado por :meth:`loop.call_later`, e :meth:`loop.call_at`.

source: This class is a subclass of :class:`Handle`.
pt_br: Esta classe é uma subclasse de :class:`Handle`.

source: Return a scheduled callback time as :class:`float` seconds.
pt_br: Retorna o tempo de uma função de retorno agendada como :class:`float` segundos.

source: The time is an absolute timestamp, using the same time reference as :meth:`loop.time`.
pt_br: O tempo é um timestamp absoluto, usando a mesma referência de tempo que :meth:`loop.time`.

source: Server Objects
pt_br: Objetos Server

source: Server objects are created by :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, and :func:`start_unix_server` functions.
pt_br: Objetos Server são criados pelas funções :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, e :func:`start_unix_server`.

source: *Server* objects are asynchronous context managers. When used in an ``async with`` statement, it's guaranteed that the Server object is closed and not accepting new connections when the ``async with`` statement is completed::
pt_br: Objetos *Server* são gerenciadores de contexto assíncronos. Quando usados em uma instrução ``async with``, é garantido que o objeto Server está fechado e não está aceitando novas conexões quando a instrução ``async with`` estiver completa::

source: srv = await loop.create_server(...) async with srv: # some code # At this point, srv is closed and no longer accepts new connections.
pt_br: srv = await loop.create_server(...) async with srv: # algum código # Neste ponto, srv é fechado e não mais aceita novas conexões.

source: Server object is an asynchronous context manager since Python 3.7.
pt_br: Objeto Server é um gerenciador de contexto assíncrono desde o Python 3.7.

source: Stop serving: close listening sockets and set the :attr:`sockets` attribute to ``None``.
pt_br: Para de servir: fecha soquetes que estavam ouvindo e define o atributo :attr:`sockets` para ``None``.

source: The sockets that represent existing incoming client connections are left open.
pt_br: Os soquetes que representam conexões de clientes existentes que estão chegando são deixados em aberto.

source: Return the event loop associated with the server object.
pt_br: Retorna o laço de eventos associado com o objeto server.

source: Start accepting connections.
pt_br: Começa a aceitar conexões.

source: The *start_serving* keyword-only parameter to :meth:`loop.create_server` and :meth:`asyncio.start_server` allows creating a Server object that is not accepting connections initially. In this case ``Server.start_serving()``, or :meth:`Server.serve_forever` can be used to make the Server start accepting connections.
pt_br: O parâmetro somente-nomeado *start_serving* para :meth:`loop.create_server` e :meth:`asyncio.start_server` permite criar um objeto Server que não está aceitando conexões inicialmente. Neste caso ``Server.start_serving()``, ou :meth:`Server.serve_forever` podem ser usados para fazer o Server começar a aceitar conexões.

source: Start accepting connections until the coroutine is cancelled. Cancellation of ``serve_forever`` task causes the server to be closed.
pt_br: Começa a aceitar conexões até que a corrotina seja cancelada. Cancelamento da task ``serve_forever`` causa o fechamento do servidor.

source: This method can be called if the server is already accepting connections. Only one ``serve_forever`` task can exist per one *Server* object.
pt_br: Este método pode ser chamado se o servidor já estiver aceitando conexões. Apenas uma task ``serve_forever`` pode existir para cada objeto *Server*.

source: Return ``True`` if the server is accepting new connections.
pt_br: Retorna ``True`` se o servidor estiver aceitando novas conexões.

source: Prior to Python 3.7 ``Server.sockets`` used to return an internal list of server sockets directly. In 3.7 a copy of that list is returned.
pt_br: Antes do Python 3.7 ``Server.sockets`` era usado para retornar uma lista interna de soquetes do server diretamente. No uma cópia dessa lista é retornada.

source: Event Loop Implementations
pt_br: Implementações do Laço de Eventos

source: asyncio ships with two different event loop implementations: :class:`SelectorEventLoop` and :class:`ProactorEventLoop`.
pt_br: asyncio vem com duas implementações de laço de eventos diferente: :class:`SelectorEventLoop` e :class:`ProactorEventLoop`.
