Repository: python/python-docs-pt-br
Catalog: library/asyncio-eventloop.po
Languages: pt_br

source: Uses the most efficient *selector* available for the given platform. It is also possible to manually configure the exact selector implementation to be used::
pt_br: Usa o *seletor* mais eficiente disponível para a plataforma fornecida. Também é possível configurar manualmente a implementação exata do seletor a ser utilizada::

source: Abstract base class for asyncio-compliant event loops.
pt_br: Classe base abstrata para laços de eventos compatíveis com asyncio.

source: Examples
pt_br: Exemplos

source: Note that all examples in this section **purposefully** show how to use the low-level event loop APIs, such as :meth:`loop.run_forever` and :meth:`loop.call_soon`. Modern asyncio applications rarely need to be written this way; consider using the high-level functions like :func:`asyncio.run`.
pt_br: Perceba que todos os exemplos nesta seção **propositalmente** mostram como usar as APIs de baixo nível do laço de eventos, tais como :meth:`loop.run_forever` e :meth:`loop.call_soon`. Aplicações asyncio modernas raramente precisam ser escritas desta forma; considere usar as funções de alto nível como :func:`asyncio.run`.

source: Hello World with call_soon()
pt_br: Hello World com call_soon()

source: An example using the :meth:`loop.call_soon` method to schedule a callback. The callback displays ``"Hello World"`` and then stops the event loop::
pt_br: Um exemplo usando o método :meth:`loop.call_soon` para agendar uma função de retorno. A função de retorno exibe ``"Hello World"`` e então para o laço de eventos::

source: A similar :ref:`Hello World <coroutine>` example created with a coroutine and the :func:`run` function.
pt_br: Um exemplo similar a :ref:`Hello World <coroutine>` criado com uma corrotina e a função :func:`run`.

source: Display the current date with call_later()
pt_br: Exibe a data atual com call_later()

source: An example of a callback displaying the current date every second. The callback uses the :meth:`loop.call_later` method to reschedule itself after 5 seconds, and then stops the event loop::
pt_br: Um exemplo de uma função de retorno mostrando a data atual a cada segundo. A função de retorno usa o método :meth:`loop.call_later` para reagendar a si mesma depois de 5 segundos, e então para o laço de eventos::

source: A similar :ref:`current date <asyncio_example_sleep>` example created with a coroutine and the :func:`run` function.
pt_br: Um exemplo similar a :ref:`data atual <asyncio_example_sleep>` criado com uma corrotina e a função :func:`run`.

source: Watch a file descriptor for read events
pt_br: Observa um descritor de arquivo por eventos de leitura

source: Wait until a file descriptor received some data using the :meth:`loop.add_reader` method and then close the event loop::
pt_br: Aguarda até que um descritor de arquivo tenha recebido alguns dados usando o método :meth:`loop.add_reader` e então fecha o laço de eventos::

source: A similar :ref:`example <asyncio_example_create_connection>` using transports, protocols, and the :meth:`loop.create_connection` method.
pt_br: Um :ref:`exemplo <asyncio_example_create_connection>` similar usando transportes, protocolos, e o método :meth:`loop.create_connection`.

source: Another similar :ref:`example <asyncio_example_create_connection-streams>` using the high-level :func:`asyncio.open_connection` function and streams.
pt_br: Outro :ref:`exemplo <asyncio_example_create_connection-streams>` similar usando a função de alto nível :func:`asyncio.open_connection` e streams.

source: Set signal handlers for SIGINT and SIGTERM
pt_br: Define tratadores de sinais para SIGINT e SIGTERM

source: (This ``signals`` example only works on Unix.)
pt_br: (Este exemplo de ``signals`` apenas funciona no Unix.)
