Repository: python/python-docs-pt-br
Catalog: library/atexit.po
Languages: pt_br

source: :mod:`!atexit` --- Exit handlers
pt_br: :mod:`!atexit` --- Manipuladores de saída

source: The :mod:`atexit` module defines functions to register and unregister cleanup functions. Functions thus registered are automatically executed upon normal interpreter termination. :mod:`atexit` runs these functions in the *reverse* order in which they were registered; if you register ``A``, ``B``, and ``C``, at interpreter termination time they will be run in the order ``C``, ``B``, ``A``.
pt_br: O módulo :mod:`atexit` define funções para registrar e cancelar o registro de funções de limpeza. As funções assim registradas são executadas automaticamente após a conclusão normal do interpretador. O módulo :mod:`atexit` executa essas funções na ordem *reversa* na qual foram registradas; se você inscrever ``A``, ``B`` e ``C``, no momento do término do interpretador, eles serão executados na ordem ``C``, ``B``, ``A`` .

source: **Note:** The functions registered via this module are not called when the program is killed by a signal not handled by Python, when a Python fatal internal error is detected, or when :func:`os._exit` is called.
pt_br: **Nota:** As funções registradas através deste módulo não são invocadas quando o programa é morto por um sinal não tratado pelo Python, quando um erro interno fatal do Python é detectado ou quando a função :func:`os._exit` é invocada.

source: **Note:** The effect of registering or unregistering functions from within a cleanup function is undefined.
pt_br: **Nota:** O efeito de registrar ou cancelar o registro de funções dentro de uma função de limpeza é indefinido.

source: When used with C-API subinterpreters, registered functions are local to the interpreter they were registered in.
pt_br: Quando usadas com os subinterpretadores de C-API, as funções registradas são locais para o interpretador em que foram registradas.

source: Register *func* as a function to be executed at termination. Any optional arguments that are to be passed to *func* must be passed as arguments to :func:`register`. It is possible to register the same function and arguments more than once.
pt_br: Registre *func* como uma função a ser executada no término. Qualquer o argumento opcional que deve ser passado para *func* for passado como argumento para :func:`register`. É possível registrar mais ou menos a mesma função e argumentos.

source: At normal program termination (for instance, if :func:`sys.exit` is called or the main module's execution completes), all functions registered are called in last in, first out order. The assumption is that lower level modules will normally be imported before higher level modules and thus must be cleaned up later.
pt_br: Na terminação normal do programa (por exemplo, se :func:`sys.exit` for chamado ou a execução do módulo principal for concluída), todas as funções registradas serão chamadas por último, pela primeira ordem. A suposição é que os módulos de nível inferior normalmente serão importados antes dos módulos de nível mais alto e, portanto, devem ser limpos posteriormente.

source: If an exception is raised during execution of the exit handlers, a traceback is printed (unless :exc:`SystemExit` is raised) and the exception information is saved. After all exit handlers have had a chance to run, the last exception to be raised is re-raised.
pt_br: Se uma exceção é levantada durante a execução dos manipuladores de saída, um traceback é impresso (a menos que :exc:`SystemExit` seja levantada) e as informações de exceção sejam salvas. Depois de todos os manipuladores de saída terem tido a chance de executar a última exceção a ser levantada, é levantada novamente.

source: This function returns *func*, which makes it possible to use it as a decorator.
pt_br: Esta função retorna *func*, o que torna possível usá-la como um decorador.

source: Starting new threads or calling :func:`os.fork` from a registered function can lead to race condition between the main Python runtime thread freeing thread states while internal :mod:`threading` routines or the new process try to use that state. This can lead to crashes rather than clean shutdown.
pt_br: Iniciar novas threads ou chamar :func:`os.fork` de uma função registrada pode levar a uma condição de corrida entre os estados de thread de liberação de thread principal do tempo de execução do Python enquanto as rotinas internas :mod:`threading` ou o novo processo tentam usar esse estado. Isso pode levar a travamentos em vez de desligamento normal.

source: Attempts to start a new thread or :func:`os.fork` a new process in a registered function now leads to :exc:`RuntimeError`.
pt_br: Tentativas de iniciar uma nova thread ou :func:`os.fork` um novo processo em uma função registrada agora leva a :exc:`RuntimeError`.

source: Remove *func* from the list of functions to be run at interpreter shutdown. :func:`unregister` silently does nothing if *func* was not previously registered. If *func* has been registered more than once, every occurrence of that function in the :mod:`atexit` call stack will be removed. Equality comparisons (``==``) are used internally during unregistration, so function references do not need to have matching identities.
pt_br: Remove *func* da lista de funções a serem executadas no desligamento do interpretador. :func:`unregister` silenciosamente não faz nada se *func* não foi registrado anteriormente. Se *func* foi registrado mais de uma vez, cada ocorrência dessa função na pilha de chamada :mod:`atexit` será removida. Comparações de igualdade (``==``) são usadas internamente durante o cancelamento do registro, portanto, as referências de função não precisam ter identidades correspondentes.

source: Module :mod:`readline`
pt_br: Módulo :mod:`readline`

source: Useful example of :mod:`atexit` to read and write :mod:`readline` history files.
pt_br: Exemplo útil de :mod:`atexit` para ler e escrever arquivos de histórico de :mod:`readline`.

source: :mod:`atexit` Example
pt_br: Exemplo do :mod:`atexit`

source: The following simple example demonstrates how a module can initialize a counter from a file when it is imported and save the counter's updated value automatically when the program terminates without relying on the application making an explicit call into this module at termination. ::
pt_br: O exemplo simples a seguir demonstra como um módulo pode inicializar um contador de um arquivo quando ele é importado e salvar automaticamente o valor atualizado do contador quando o programa termina, sem depender que a aplicação faça uma chamada explícita nesse módulo na finalização. ::

source: Positional and keyword arguments may also be passed to :func:`register` to be passed along to the registered function when it is called::
pt_br: Os argumentos posicional e de palavra reservada também podem ser passados para :func:`register` para ser passada para a função registrada quando é chamada ::

source: def goodbye(name, adjective): print('Goodbye %s, it was %s to meet you.' % (name, adjective)) import atexit atexit.register(goodbye, 'Donny', 'nice') # or: atexit.register(goodbye, adjective='nice', name='Donny')
pt_br: def goodbye(name, adjective): print('Goodbye %s, it was %s to meet you.' % (name, adjective)) import atexit atexit.register(goodbye, 'Donny', 'nice') # ou: atexit.register(goodbye, adjective='nice', name='Donny')

source: Usage as a :term:`decorator`::
pt_br: Utilizado como um :term:`decorador`::

source: This only works with functions that can be called without arguments.
pt_br: Isso só funciona com funções que podem ser invocadas sem argumentos.
