Repository: python/python-docs-pt-br
Catalog: library/bdb.po
Languages: pt_br

source: :mod:`!bdb` --- Debugger framework
pt_br: :mod:`!bdb` --- Framework do depurador

source: **Source code:** :source:`Lib/bdb.py`
pt_br: **Código-fonte:** :source:`Lib/bdb.py`

source: The :mod:`bdb` module handles basic debugger functions, like setting breakpoints or managing execution via the debugger.
pt_br: O módulo :mod:`bdb` lida com funções básicas do depurador, como definir pontos de interrupção ou gerenciar a execução por meio do depurador.

source: The following exception is defined:
pt_br: A seguinte exceção é definida:

source: Exception raised by the :class:`Bdb` class for quitting the debugger.
pt_br: Exceção levantada pela classe :class:`Bdb` para sair do depurador.

source: The :mod:`bdb` module also defines two classes:
pt_br: O módulo :mod:`bdb` também define duas classes:

source: This class implements temporary breakpoints, ignore counts, disabling and (re-)enabling, and conditionals.
pt_br: Esta classe implementa pontos de interrupção temporários, contagens de ignorar, desativação e (re)ativação, além de condicionais.

source: Breakpoints are indexed by number through a list called :attr:`bpbynumber` and by ``(file, line)`` pairs through :attr:`bplist`. The former points to a single instance of class :class:`Breakpoint`. The latter points to a list of such instances since there may be more than one breakpoint per line.
pt_br: Os pontos de interrupção são indexados por número por meio de uma lista chamada :attr:`bpbynumber` e por pares ``(file, line)`` por meio de :attr:`bplist`. O primeiro aponta para uma única instância da classe :class:`Breakpoint`. O segundo aponta para uma lista dessas instâncias, já que pode haver mais de um ponto de interrupção por linha.

source: When creating a breakpoint, its associated :attr:`file name <file>` should be in canonical form. If a :attr:`funcname` is defined, a breakpoint :attr:`hit <hits>` will be counted when the first line of that function is executed. A :attr:`conditional <cond>` breakpoint always counts a :attr:`hit <hits>`.
pt_br: Ao criar um ponto de interrupção, seu :attr:`nome do arquivo <file>` associado deve estar no formato canônico. Se um :attr:`funcname` for definido, um ponto de interrupção :attr:`atingido <hits>` será contado quando a primeira linha dessa função for executada. Um ponto de interrupção :attr:`condicional <cond>` sempre conta um :attr:`atingido <hits>`.

source: :class:`Breakpoint` instances have the following methods:
pt_br: As instâncias de :class:`Breakpoint` têm os seguintes métodos:

source: Delete the breakpoint from the list associated to a file/line. If it is the last breakpoint in that position, it also deletes the entry for the file/line.
pt_br: Exclui o ponto de interrupção da lista associada a um arquivo/linha. Se for o último ponto de interrupção nessa posição, ele também excluirá a entrada do arquivo/linha.

source: Mark the breakpoint as enabled.
pt_br: Marca o ponto de interrupção como ativado.

source: Mark the breakpoint as disabled.
pt_br: Marca o ponto de interrupção como desativado.

source: Return a string with all the information about the breakpoint, nicely formatted:
pt_br: Retorna uma string com todas as informações sobre o ponto de interrupção, formatadas de maneira clara:

source: Breakpoint number.
pt_br: Número do ponto de interrupção.

source: Temporary status (del or keep).
pt_br: Status temporário (del ou keep).

source: File/line position.
pt_br: Posição do arquivo/linha.

source: Break condition.
pt_br: Condição de interrupção.

source: Number of times to ignore.
pt_br: Número de vezes para ignorar.

source: Number of times hit.
pt_br: Número de vezes atingido.

source: Print the output of :meth:`bpformat` to the file *out*, or if it is ``None``, to standard output.
pt_br: Exibe a saída de :meth:`bpformat` no arquivo *out* ou, se for ``None``, na saída padrão.

source: :class:`Breakpoint` instances have the following attributes:
pt_br: Instâncias :class:`Breakpoint` possuem os seguintes atributos:

source: File name of the :class:`Breakpoint`.
pt_br: Nome do arquivo do :class:`Breakpoint`.

source: Line number of the :class:`Breakpoint` within :attr:`file`.
pt_br: Número da linha do :class:`Breakpoint` dentro de :attr:`file`.

source: ``True`` if a :class:`Breakpoint` at (file, line) is temporary.
pt_br: ``True`` se um :class:`Breakpoint` em (file, line) for temporário.

source: Condition for evaluating a :class:`Breakpoint` at (file, line).
pt_br: Condição para avaliar um :class:`Breakpoint` em (file, line).

source: Function name that defines whether a :class:`Breakpoint` is hit upon entering the function.
pt_br: Nome da função que define se um :class:`Breakpoint` é atingido ao entrar na função.

source: ``True`` if :class:`Breakpoint` is enabled.
pt_br: ``True`` se :class:`Breakpoint` estiver ativado.

source: Numeric index for a single instance of a :class:`Breakpoint`.
pt_br: Índice numérico de uma única instância de :class:`Breakpoint`.

source: Dictionary of :class:`Breakpoint` instances indexed by (:attr:`file`, :attr:`line`) tuples.
pt_br: Dicionário de instâncias de :class:`Breakpoint` indexadas por tuplas (:attr:`file`, :attr:`line`).

source: Number of times to ignore a :class:`Breakpoint`.
pt_br: Número de vezes para ignorar o :class:`Breakpoint`.

source: Count of the number of times a :class:`Breakpoint` has been hit.
pt_br: Contagem do número de vezes que um :class:`Breakpoint` foi atingido.

source: The :class:`Bdb` class acts as a generic Python debugger base class.
pt_br: A :class:`Bdb` atua como uma classe base genérica de depurador em Python.

source: This class takes care of the details of the trace facility; a derived class should implement user interaction. The standard debugger class (:class:`pdb.Pdb`) is an example.
pt_br: Esta classe cuida dos detalhes do mecanismo de rastreamento; uma classe derivada deve implementar a interação com o usuário. A classe de depuração padrão (:class:`pdb.Pdb`) é um exemplo.

source: The *skip* argument, if given, must be an iterable of glob-style module name patterns. The debugger will not step into frames that originate in a module that matches one of these patterns. Whether a frame is considered to originate in a certain module is determined by the ``__name__`` in the frame globals.
pt_br: O argumento *skip*, se fornecido, deve ser um iterável de padrões de nomes de módulos no estilo glob. O depurador não entrará em frames que se originam em um módulo que corresponda a um desses padrões. Se um frame é considerado como originado em determinado módulo é determinado pelo valor de ``__name__`` nos globals do frame.

source: The *backend* argument specifies the backend to use for :class:`Bdb`. It can be either ``'settrace'`` or ``'monitoring'``. ``'settrace'`` uses :func:`sys.settrace` which has the best backward compatibility. The ``'monitoring'`` backend uses the new :mod:`sys.monitoring` that was introduced in Python 3.12, which can be much more efficient because it can disable unused events. We are trying to keep the exact interfaces for both backends, but there are some differences. The debugger developers are encouraged to use the ``'monitoring'`` backend to achieve better performance.
pt_br: O argumento *backend* especifica o backend a ser usado pela :class:`Bdb`. Ele pode ser ``'settrace'`` ou ``'monitoring'``. ``'settrace'`` usa :func:`sys.settrace`, que oferece a melhor retrocompatibilidade. O backend ``'monitoring'`` usa o novo :mod:`sys.monitoring`, introduzido no Python 3.12, que pode ser muito mais eficiente porque pode desabilitar eventos não utilizados. Estamos tentando manter interfaces idênticas para ambos os backends, mas existem algumas diferenças. Os desenvolvedores de depuradores são incentivados a usar o backend ``'monitoring'`` para obter melhor desempenho.

source: Added the *skip* parameter.
pt_br: Adicionado o parâmetro *skip*.

source: Added the *backend* parameter.
pt_br: Adicionado o parâmetro *backend*.

source: The following methods of :class:`Bdb` normally don't need to be overridden.
pt_br: Os seguintes métodos de :class:`Bdb` normalmente não precisam ser substituídos.

source: Return canonical form of *filename*.
pt_br: Retorna a forma canônica de *filename*.

source: For real file names, the canonical form is an operating-system-dependent, :func:`case-normalized <os.path.normcase>` :func:`absolute path <os.path.abspath>`. A *filename* with angle brackets, such as ``"<stdin>"`` generated in interactive mode, is returned unchanged.
pt_br: Para nomes de arquivos reais, a forma canônica é um :func:`caminho absoluto <os.path.abspath>`, :func:`normalizado para distinguir maiúsculas e minúsculas <os.path.normcase>`, dependente do sistema operacional. Um *filename* com colchetes angulares, como ``"<stdin>"`` gerado no modo interativo, é retornado sem alterações.

source: Start tracing. For ``'settrace'`` backend, this method is equivalent to ``sys.settrace(self.trace_dispatch)``
pt_br: Inicia o rastreamento. Para o backend ``'settrace'``, este método equivale a ``sys.settrace(self.trace_dispatch)``

source: Stop tracing. For ``'settrace'`` backend, this method is equivalent to ``sys.settrace(None)``
pt_br: Para o rastreamento. Para o backend ``'settrace'``, este método equivale a ``sys.settrace(None)``

source: Set the :attr:`!botframe`, :attr:`!stopframe`, :attr:`!returnframe` and :attr:`quitting <Bdb.set_quit>` attributes with values ready to start debugging.
pt_br: Define os atributos :attr:`!botframe`, :attr:`!stopframe`, :attr:`!returnframe` e :attr:`quitting <Bdb.set_quit>` com valores prontos para iniciar a depuração.

source: This function is installed as the trace function of debugged frames. Its return value is the new trace function (in most cases, that is, itself).
pt_br: Esta função é instalada como a função de rastreamento dos frames depurados. Seu valor de retorno é a nova função de rastreamento (na maioria dos casos, ela própria).

source: The default implementation decides how to dispatch a frame, depending on the type of event (passed as a string) that is about to be executed. *event* can be one of the following:
pt_br: A implementação padrão decide como despachar um frame, dependendo do tipo de evento (passado como string) que está prestes a ser executado. *event* pode ser um dos seguintes:

source: ``"line"``: A new line of code is going to be executed.
pt_br: ``"line"``: Uma nova linha de código será executada.

source: ``"call"``: A function is about to be called, or another code block entered.
pt_br: ``"call"``: Um função está prestes a ser chamada, ou outro bloco de código foi inserido.

source: ``"return"``: A function or other code block is about to return.
pt_br: ``"retorno"``: Um função ou outro bloco de código está prestes a retornar.

source: ``"exception"``: An exception has occurred.
pt_br: ``"exception"``: Ocorreu uma exceção.

source: ``"c_call"``: A C function is about to be called.
pt_br: ``"c_call"``: Uma função C está prestes a ser chamada.

source: ``"c_return"``: A C function has returned.
pt_br: ``"c_return"``: Uma função C retornou.

source: ``"c_exception"``: A C function has raised an exception.
pt_br: ``"c_exception"``: Uma função C levantou uma exceção.

source: For the Python events, specialized functions (see below) are called. For the C events, no action is taken.
pt_br: Para os eventos Python, são chamadas função especializadas (consulte abaixo). Para os eventos de C, nenhuma ação é tomada.

source: The *arg* parameter depends on the previous event.
pt_br: O parâmetro *arg* depende do evento anterior.

source: See the documentation for :func:`sys.settrace` for more information on the trace function. For more information on code and frame objects, refer to :ref:`types`.
pt_br: Consulte a documentação de :func:`sys.settrace` para mais informações sobre a função de rastreamento. Para mais informações sobre objetos de código e de frame, consulte :ref:`types`.

source: If the debugger should stop on the current line, invoke the :meth:`user_line` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`quitting <Bdb.set_quit>` flag is set (which can be set from :meth:`user_line`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pt_br: Se o depurador deve parar na linha atual, invoca o método :meth:`user_line` (que deve ser substituído em subclasses). Levanta a exceção :exc:`BdbQuit` se o sinalizador :attr:`quitting <Bdb.set_quit>` estiver definido (ele pode ser definido a partir de :meth:`user_line`). Retorna uma referência ao método :meth:`trace_dispatch` para continuar o rastreamento nesse escopo.

source: If the debugger should stop on this function call, invoke the :meth:`user_call` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`quitting <Bdb.set_quit>` flag is set (which can be set from :meth:`user_call`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pt_br: Se o depurador deve parar nesta chamada de função, invoca o método :meth:`user_call` (que deve ser substituído em subclasses). Levanta a exceção :exc:`BdbQuit` se o sinalizador :attr:`quitting <Bdb.set_quit>` estiver definido (ele pode ser definido a partir de :meth:`user_call`). Retorna uma referência ao método :meth:`trace_dispatch` para continuar o rastreamento nesse escopo.

source: If the debugger should stop on this function return, invoke the :meth:`user_return` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`quitting <Bdb.set_quit>` flag is set (which can be set from :meth:`user_return`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pt_br: Se o depurador deve parar no retorno desta função, invoca o método :meth:`user_return` (que deve ser substituído em subclasses). Levanta a exceção :exc:`BdbQuit` se o sinalizador :attr:`quitting <Bdb.set_quit>` estiver definido (ele pode ser definido a partir de :meth:`user_return`). Retorna uma referência ao método :meth:`trace_dispatch` para continuar o rastreamento nesse escopo.

source: If the debugger should stop at this exception, invokes the :meth:`user_exception` method (which should be overridden in subclasses). Raise a :exc:`BdbQuit` exception if the :attr:`quitting <Bdb.set_quit>` flag is set (which can be set from :meth:`user_exception`). Return a reference to the :meth:`trace_dispatch` method for further tracing in that scope.
pt_br: Se o depurador deve parar nesta exceção, invoca o método :meth:`user_exception` (que deve ser substituído em subclasses). Levanta a exceção :exc:`BdbQuit` se o sinalizador :attr:`quitting <Bdb.set_quit>` estiver definido (ele pode ser definido a partir de :meth:`user_exception`). Retorna uma referência ao método :meth:`trace_dispatch` para continuar o rastreamento nesse escopo.

source: Normally derived classes don't override the following methods, but they may if they want to redefine the definition of stopping and breakpoints.
pt_br: Normalmente, as classes derivadas não substituem o seguinte métodos, mas podem fazê-lo se quiserem redefinir a definição de parada e de pontos de interrupção.

source: Return ``True`` if *module_name* matches any skip pattern.
pt_br: Retorna ``True`` se *module_name* corresponder a algum padrão de skip.

source: Return ``True`` if *frame* is below the starting frame in the stack.
pt_br: Retorna ``True`` se frame estiver abaixo do frame inicial na pilha.

source: Return ``True`` if there is an effective breakpoint for this line.
pt_br: Retorna ``True`` se houver um ponto de interrupção efetivo para essa linha.

source: Check whether a line or function breakpoint exists and is in effect. Delete temporary breakpoints based on information from :func:`effective`.
pt_br: Verificar se uma linha ou função ponto de interrupção existe e está em vigor. Exclua os pontos de interrupção temporários com base nas informações de :func:`effective`.

source: Return ``True`` if any breakpoint exists for *frame*'s filename.
pt_br: Retorna ``True`` se existir algum ponto de interrupção para o nome de arquivo de *frame*'s.

source: Derived classes should override these methods to gain control over debugger operation.
pt_br: As classes derivadas devem substituir esses métodos para obter controle sobre a operação da depurador.

source: Called from :meth:`dispatch_call` if a break might stop inside the called function.
pt_br: Chamado a partir de :meth:`dispatch_call` se um ponto de interrupção puder parar dentro da função chamada.

source: *argument_list* is not used anymore and will always be ``None``. The argument is kept for backwards compatibility.
pt_br: *argument_list* não é mais usado e sempre será ``None``. O argumento é mantido por retrocompatibilidade.

source: Called from :meth:`dispatch_line` when either :meth:`stop_here` or :meth:`break_here` returns ``True``.
pt_br: Chamado a partir de :meth:`dispatch_line` quando :meth:`stop_here` ou :meth:`break_here` retornam ``True``.

source: Called from :meth:`dispatch_return` when :meth:`stop_here` returns ``True``.
pt_br: Chamado a partir de :meth:`dispatch_return` quando :meth:`stop_here` retorna ``True``.

source: Called from :meth:`dispatch_exception` when :meth:`stop_here` returns ``True``.
pt_br: Chamado a partir de :meth:`dispatch_exception` quando :meth:`stop_here` retorna ``True``.

source: Handle how a breakpoint must be removed when it is a temporary one.
pt_br: Manipula como um ponto de interrupção deve ser removido quando for temporário.

source: This method must be implemented by derived classes.
pt_br: Esse método deve ser implementado por classes derivadas.

source: Derived classes and clients can call the following methods to affect the stepping state.
pt_br: As classes derivadas e os clientes podem chamar os métodos a seguir para afetar o estado de stepping.

source: Stop after one line of code.
pt_br: Pare após uma linha de código.

source: Stop on the next line in or below the given frame.
pt_br: Pare na próxima linha no frame fornecido ou abaixo dele.

source: Stop when returning from the given frame.
pt_br: Pare ao retornar do frame fornecido.

source: Stop when the line with the *lineno* greater than the current one is reached or when returning from current frame.
pt_br: Pare quando a linha com *lineno* maior que a atual for alcançada ou ao retornar do frame atual.

source: Start debugging from *frame*. If *frame* is not specified, debugging starts from caller's frame.
pt_br: Inicia a depuração a partir de *frame*. Se *frame* não for especificado, a depuração começa a partir do frame do chamador.

source: :func:`set_trace` will enter the debugger immediately, rather than on the next line of code to be executed.
pt_br: :func:`set_trace` entrará no depurador imediatamente, em vez de na próxima linha de código a ser executada.

source: Stop only at breakpoints or when finished. If there are no breakpoints, set the system trace function to ``None``.
pt_br: Pare somente nos pontos de interrupção ou quando terminar. Se não houver pontos de interrupção, defina o sistema função de rastreamento como ``None``.

source: Set the :attr:`!quitting` attribute to ``True``. This raises :exc:`BdbQuit` in the next call to one of the :meth:`!dispatch_\*` methods.
pt_br: Defina o atributo :attr:`!quitting` como ``True``. Isso levanta :exc:`BdbQuit` na próxima chamada de um dos métodos :meth:`!dispatch_\*`.

source: Derived classes and clients can call the following methods to manipulate breakpoints. These methods return a string containing an error message if something went wrong, or ``None`` if all is well.
pt_br: Classes derivadas e clientes podem chamar os métodos a seguir para manipular pontos de interrupção. Esses métodos retornam uma string contendo uma mensagem de erro se algo der errado, ou ``None`` se tudo estiver correto.

source: Set a new breakpoint. If the *lineno* line doesn't exist for the *filename* passed as argument, return an error message. The *filename* should be in canonical form, as described in the :meth:`canonic` method.
pt_br: Define um novo ponto de interrupção. Se a linha *lineno* não existir para o *filename* passado como argumento, retorna uma mensagem de erro. O *filename* deve estar na forma canônica, conforme descrito no método :meth:`canonic`.

source: Delete the breakpoints in *filename* and *lineno*. If none were set, return an error message.
pt_br: Exclui os pontos de interrupção em *filename* e *lineno*. Se nenhum tiver sido definido, retorna uma mensagem de erro.

source: Delete the breakpoint which has the index *arg* in the :attr:`Breakpoint.bpbynumber`. If *arg* is not numeric or out of range, return an error message.
pt_br: Exclui o ponto de interrupção cujo índice é *arg* em :attr:`Breakpoint.bpbynumber`. Se *arg* não for numérico ou estiver fora do intervalo, retorna uma mensagem de erro.

source: Delete all breakpoints in *filename*. If none were set, return an error message.
pt_br: Exclui todos os pontos de interrupção em *filename*. Se nenhum tiver sido definido, retorna uma mensagem de erro.

source: Delete all existing breakpoints. If none were set, return an error message.
pt_br: Exclui todos os pontos de interrupção existentes. Se nenhum tiver sido definido, retorna uma mensagem de erro.

source: Return a breakpoint specified by the given number. If *arg* is a string, it will be converted to a number. If *arg* is a non-numeric string, if the given breakpoint never existed or has been deleted, a :exc:`ValueError` is raised.
pt_br: Retorna o ponto de interrupção especificado pelo número fornecido. Se *arg* for uma string, ele será convertido para um número. Se *arg* for uma string não numérica, se o ponto de interrupção nunca tiver existido ou tiver sido excluído, uma :exc:`ValueError` será levantada.

source: The function name or ``"<lambda>"``.
pt_br: O nome da função ou ``"<lambda>"``.

source: The input arguments.
pt_br: O argumento de entrada.

source: The following two methods can be called by clients to use a debugger to debug a :term:`statement`, given as a string.
pt_br: Os dois métodos a seguir podem ser chamados pelos clientes para usar um depurador e depurar uma :term:`instrução <statement>`, fornecida como uma string.
