Repository: python/python-docs-pt-br
Catalog: library/binhex.po
Languages: pt_br

source: :mod:`binhex` --- Encode and decode binhex4 files
pt_br: :mod:`binhex` --- Codifica e decodifica arquivos binhex4

source: **Source code:** :source:`Lib/binhex.py`
pt_br: **Código-fonte:** :source:`Lib/binhex.py`

source: This module encodes and decodes files in binhex4 format, a format allowing representation of Macintosh files in ASCII. Only the data fork is handled.
pt_br: Este módulo codifica e decodifica arquivos no formato binhex4, um formato que permite a representação de arquivos Macintosh em ASCII. Apenas a bifurcação de dados é manipulada.

source: The :mod:`binhex` module defines the following functions:
pt_br: O módulo :mod:`binhex` define as seguintes funções:

source: Convert a binary file with filename *input* to binhex file *output*. The *output* parameter can either be a filename or a file-like object (any object supporting a :meth:`write` and :meth:`close` method).
pt_br: Converte um arquivo binário com o nome de arquivo *input* para o arquivo binhex *output*. O parâmetro *output* pode ser um nome de arquivo ou um objeto semelhante a um arquivo (qualquer objeto que suporte um método :meth:`write` e :meth:`close`).

source: Decode a binhex file *input*. *input* may be a filename or a file-like object supporting :meth:`read` and :meth:`close` methods. The resulting file is written to a file named *output*, unless the argument is ``None`` in which case the output filename is read from the binhex file.
pt_br: Decodifica um arquivo binhex *input*. *input* pode ser um nome de arquivo ou um objeto de arquivo com suporte aos métodos :meth:`read` e :meth:`close`. O arquivo resultante é gravado em um arquivo chamado *output*, a menos que o argumento seja ``None``, caso em que o nome do arquivo de saída é lido a partir do arquivo binhex.

source: The following exception is also defined:
pt_br: A seguinte exceção também está definida:

source: Exception raised when something can't be encoded using the binhex format (for example, a filename is too long to fit in the filename field), or when input is not properly encoded binhex data.
pt_br: Exceção levantada quando algo não pode ser codificado usando o formato binhex (por exemplo, um nome de arquivo é muito longo para caber no campo de nome de arquivo) ou quando a entrada não consiste em dados binhex corretamente codificados.

source: Module :mod:`binascii`
pt_br: Módulo :mod:`binascii`

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
pt_br: Módulo de suporte contendo conversões ASCII para binário e binário para ASCII.

source: Notes
pt_br: Notas

source: There is an alternative, more powerful interface to the coder and decoder, see the source for details.
pt_br: Existe uma interface alternativa, mais poderosa para o codificador e o decodificador, veja a fonte para obter detalhes.

source: If you code or decode textfiles on non-Macintosh platforms they will still use the old Macintosh newline convention (carriage-return as end of line).
pt_br: Se você codificar ou decodificar arquivos de texto em plataformas que não sejam Macintosh, elas ainda usarão a antiga convenção de linha do Macintosh (carriage-return como fim de linha).
