Repository: python/python-docs-pt-br
Catalog: library/bz2.po
Languages: pt_br

source: :mod:`!bz2` --- Support for :program:`bzip2` compression
pt_br: :mod:`!bz2` --- Suporte para compressão :program:`bzip2`

source: **Source code:** :source:`Lib/bz2.py`
pt_br: **Código-fonte:** :source:`Lib/bz2.py`

source: This module provides a comprehensive interface for compressing and decompressing data using the bzip2 compression algorithm.
pt_br: Este módulo fornece uma interface abrangente para compactar e descompactar dados usando o algoritmo de compactação bzip2.

source: The :mod:`bz2` module contains:
pt_br: O módulo :mod:`bz2` contém:

source: The :func:`.open` function and :class:`BZ2File` class for reading and writing compressed files.
pt_br: A função :func:`.open` e a classe :class:`BZ2File` para leitura e escrita de arquivos compactados.

source: The :class:`BZ2Compressor` and :class:`BZ2Decompressor` classes for incremental (de)compression.
pt_br: As classes :class:`BZ2Compressor` e :class:`BZ2Decompressor` para (des)compressão incremental.

source: The :func:`compress` and :func:`decompress` functions for one-shot (de)compression.
pt_br: As funções :func:`compress` e :func:`decompress` para (des)compressão de uma só vez.

source: (De)compression of files
pt_br: (Des)compressão de arquivos

source: Open a bzip2-compressed file in binary or text mode, returning a :term:`file object`.
pt_br: Abre um arquivo compactado com bzip2 no modo binário ou texto, retornando um :term:`objeto arquivo <file object>`.

source: As with the constructor for :class:`BZ2File`, the *filename* argument can be an actual filename (a :class:`str` or :class:`bytes` object), or an existing file object to read from or write to.
pt_br: Assim como no construtor para :class:`BZ2File`, o argumento *filename* pode ser um nome de arquivo real (um objeto :class:`str` ou :class:`bytes`), ou um objeto arquivo existente para ler ou gravar.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` or ``'ab'`` for binary mode, or ``'rt'``, ``'wt'``, ``'xt'``, or ``'at'`` for text mode. The default is ``'rb'``.
pt_br: O argumento *mode* pode ser qualquer um de ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` ou ``'ab'`` para modo binário, ou ``'rt'``, ``'wt'``, ``'xt'`` ou ``'at'`` para modo texto. O padrão é ``'rb'``.

source: The *compresslevel* argument is an integer from 1 to 9, as for the :class:`BZ2File` constructor.
pt_br: O argumento *compresslevel* é um inteiro de 1 a 9, como para o construtor :class:`BZ2File`.

source: For binary mode, this function is equivalent to the :class:`BZ2File` constructor: ``BZ2File(filename, mode, compresslevel=compresslevel)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
pt_br: Para o modo binário, esta função é equivalente ao construtor de :class:`BZ2File`: ``BZ2File(filename, mode, compresslevel=compresslevel)``. Neste caso, os argumentos *encoding*, *errors* e *newline* não devem ser fornecidos.

source: For text mode, a :class:`BZ2File` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
pt_br: Para o modo texto, um objeto :class:`BZ2File` é criado e envolto em uma instância :class:`io.TextIOWrapper` com a codificação especificada, comportamento de tratamento de erros e final(is) de linha.

source: The ``'x'`` (exclusive creation) mode was added.
pt_br: O modo ``'x'`` (criação exclusiva) foi adicionado.

source: Accepts a :term:`path-like object`.
pt_br: Aceita um :term:`objeto caminho ou similar`.

source: Open a bzip2-compressed file in binary mode.
pt_br: Abre um arquivo compactado com bzip2 no modo binário.

source: If *filename* is a :class:`str` or :class:`bytes` object, open the named file directly. Otherwise, *filename* should be a :term:`file object`, which will be used to read or write the compressed data.
pt_br: Se *filename* for um objeto :class:`str` ou :class:`bytes`, abra o arquivo nomeado diretamente. Caso contrário, *filename* deve ser um :term:`objeto arquivo <file object>`, que será usado para ler ou gravar os dados compactados.

source: The *mode* argument can be either ``'r'`` for reading (default), ``'w'`` for overwriting, ``'x'`` for exclusive creation, or ``'a'`` for appending. These can equivalently be given as ``'rb'``, ``'wb'``, ``'xb'`` and ``'ab'`` respectively.
pt_br: O argumento *mode* pode ser ``'r'`` para leitura (padrão), ``'w'`` para substituição, ``'x'`` para criação exclusiva ou ``'a'`` para anexar. Estes podem ser equivalentemente dados como ``'rb'``, ``'wb'``, ``'xb'`` e ``'ab'`` respectivamente.

source: If *filename* is a file object (rather than an actual file name), a mode of ``'w'`` does not truncate the file, and is instead equivalent to ``'a'``.
pt_br: Se *filename* for um objeto arquivo (ao invés de um nome de arquivo real), um modo de ``'w'`` não truncará o arquivo e será equivalente a ``'a'``.

source: If *mode* is ``'w'`` or ``'a'``, *compresslevel* can be an integer between ``1`` and ``9`` specifying the level of compression: ``1`` produces the least compression, and ``9`` (default) produces the most compression.
pt_br: Se *mode* for ``'w'`` ou ``'a'``, *compresslevel* pode ser um inteiro entre ``1`` e ``9`` especificando o nível de compressão: ``1`` produz a menor compressão e ``9`` (padrão) produz a maior compactação.

source: If *mode* is ``'r'``, the input file may be the concatenation of multiple compressed streams.
pt_br: Se *mode* for ``'r'``, o arquivo de entrada pode ser a concatenação de vários fluxos compactados.

source: :class:`BZ2File` provides all of the members specified by the :class:`io.BufferedIOBase`, except for :meth:`~io.BufferedIOBase.detach` and :meth:`~io.IOBase.truncate`. Iteration and the :keyword:`with` statement are supported.
pt_br: :class:`BZ2File` fornece todos os membros especificados pelo :class:`io.BufferedIOBase`, exceto :meth:`~io.BufferedIOBase.detach` e :meth:`~io.IOBase.truncate`. Iteração e a instrução :keyword:`with` são suportadas.

source: :class:`BZ2File` also provides the following methods and attributes:
pt_br: :class:`BZ2File` também fornece os seguintes métodos e atributos:

source: Return buffered data without advancing the file position. At least one byte of data will be returned (unless at EOF). The exact number of bytes returned is unspecified.
pt_br: Retorna dados armazenados em buffer sem avançar a posição do arquivo. Pelo menos um byte de dados será retornado (a menos que em EOF). O número exato de bytes retornados não é especificado.

source: While calling :meth:`peek` does not change the file position of the :class:`BZ2File`, it may change the position of the underlying file object (e.g. if the :class:`BZ2File` was constructed by passing a file object for *filename*).
pt_br: Enquanto chamar :meth:`peek` não altera a posição do arquivo de :class:`BZ2File`, pode alterar a posição do objeto de arquivo subjacente (por exemplo, se o :class:`BZ2File` foi construído passando um objeto de arquivo para *filename*).

source: Return the file descriptor for the underlying file.
pt_br: Retorna o endereço descritor de arquivo do arquivo subjacente.

source: Return whether the file was opened for reading.
pt_br: Retorna se o arquivo foi aberto para leitura.

source: Return whether the file supports seeking.
pt_br: Retorna se o arquivo suporta a busca.

source: Return whether the file was opened for writing.
pt_br: Retorna se o arquivo foi aberto para gravação.

source: Read up to *size* uncompressed bytes, while trying to avoid making multiple reads from the underlying stream. Reads up to a buffer's worth of data if size is negative.
pt_br: Lê até o tamanho *size* de bytes não compactados, tentando evitar várias leituras do fluxo subjacente. Lê até um valor buffer de dados se o tamanho for negativo.

source: Returns ``b''`` if the file is at EOF.
pt_br: Retorna ``b''`` se o arquivo tiver atingido EOF, ou seja, o fim do arquivo.

source: Read bytes into *b*.
pt_br: Lêr bytes para *b*.

source: Returns the number of bytes read (0 for EOF).
pt_br: Retorna o número de bytes lidos (0 para EOF).

source: ``'rb'`` for reading and ``'wb'`` for writing.
pt_br: ``'rb'`` para leitura e ``'wb'`` para escrita.

source: The bzip2 file name. Equivalent to the :attr:`~io.FileIO.name` attribute of the underlying :term:`file object`.
pt_br: O nome do arquivo bzip2. Equivalente ao atributo :attr:`~io.FileIO.name` do :term:`objeto arquivo` subjacente.

source: Support for the :keyword:`with` statement was added.
pt_br: Suporte para a instrução :keyword:`with` foi adicionado.

source: Support was added for *filename* being a :term:`file object` instead of an actual filename.
pt_br: Foi adicionado suporte para *filename* ser um :term:`objeto arquivo <file object>` em vez de um nome de arquivo real.

source: The ``'a'`` (append) mode was added, along with support for reading multi-stream files.
pt_br: O modo ``'a'`` (anexar) foi adicionado, juntamente com suporte para leitura de arquivos multifluxo.

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
pt_br: O método :meth:`~io.BufferedIOBase.read` agora aceita um argumento de ``None``.

source: The *buffering* parameter has been removed. It was ignored and deprecated since Python 3.0. Pass an open file object to control how the file is opened.
pt_br: O parâmetro *buffering* foi removido. Foi ignorado e descontinuado desde o Python 3.0. Passe um objeto arquivo aberto para controlar como o arquivo é aberto.

source: The *compresslevel* parameter became keyword-only.
pt_br: O parâmetro *compresslevel* tornou-se somente-nomeado.

source: This class is thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been.
pt_br: Esta classe não é segura para threads diante de vários leitores ou escritores simultâneos, assim como suas classes equivalentes em :mod:`gzip` e :mod:`lzma` sempre foram.

source: Incremental (de)compression
pt_br: (Des)compressão incremental

source: Create a new compressor object. This object may be used to compress data incrementally. For one-shot compression, use the :func:`compress` function instead.
pt_br: Cria um novo objeto compressor. Este objeto pode ser usado para compactar dados de forma incremental. Para compactação única, use a função :func:`compress`.

source: *compresslevel*, if given, must be an integer between ``1`` and ``9``. The default is ``9``.
pt_br: *compresslevel*, se fornecido, deve ser um inteiro entre ``1`` e ``9``. O padrão é ``9``.

source: Provide data to the compressor object. Returns a chunk of compressed data if possible, or an empty byte string otherwise.
pt_br: Fornece dados para o objeto compressor. Retorna um pedaço de dados compactados, se possível, ou uma string de bytes vazia, caso contrário.

source: When you have finished providing data to the compressor, call the :meth:`flush` method to finish the compression process.
pt_br: Quando você terminar de fornecer dados ao compactador, chame o método :meth:`flush` para finalizar o processo de compressão.

source: Finish the compression process. Returns the compressed data left in internal buffers.
pt_br: Finaliza o processo de compactação. Retorna os dados compactados deixados em buffers internos.

source: The compressor object may not be used after this method has been called.
pt_br: O objeto compactador não pode ser usado após a chamada deste método.

source: Create a new decompressor object. This object may be used to decompress data incrementally. For one-shot compression, use the :func:`decompress` function instead.
pt_br: Cria um novo objeto descompactador. Este objeto pode ser usado para descompactar dados de forma incremental. Para compactação única, use a função :func:`decompress`.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`BZ2File`. If you need to decompress a multi-stream input with :class:`BZ2Decompressor`, you must use a new decompressor for each stream.
pt_br: Esta classe não trata de forma transparente entradas contendo múltiplos fluxos compactados, ao contrário de :func:`decompress` e :class:`BZ2File`. Se você precisar descompactar uma entrada multifluxo com :class:`BZ2Decompressor`, você deve usar um novo descompactador para cada fluxo.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
pt_br: Descompacta dados *data* (um :term:`objeto bytes ou similar <bytes-like object>`), retornando dados não compactados como bytes. Alguns dos *data* podem ser armazenados em buffer internamente, para uso em chamadas posteriores para :meth:`decompress`. Os dados retornados devem ser concatenados com a saída de qualquer chamada anterior para :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
pt_br: Se *max_length* for não negativo, retornará no máximo *max_length* bytes de dados descompactados. Se este limite for atingido e mais saída puder ser produzida, o atributo :attr:`~.needs_input` será definido como ``False``. Neste caso, a próxima chamada para :meth:`~.decompress` pode fornecer *data* como ``b''`` para obter mais saída.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
pt_br: Se todos os dados de entrada foram descompactados e retornados (seja porque era menor que *max_length* bytes, ou porque *max_length* era negativo), o atributo :attr:`~.needs_input` será definido como ``True`` .

source: Attempting to decompress data after the end of stream is reached raises an :exc:`EOFError`. Any data found after the end of the stream is ignored and saved in the :attr:`~.unused_data` attribute.
pt_br: A tentativa de descompactar os dados após o final do fluxo ser atingido gera um :exc:`EOFError`. Quaisquer dados encontrados após o final do fluxo são ignorados e salvos no atributo :attr:`~.unused_data`.

source: Added the *max_length* parameter.
pt_br: Adicionado o parâmetro *max_length*.

source: ``True`` if the end-of-stream marker has been reached.
pt_br: ``True`` se o marcador de fim de fluxo foi atingido.

source: Data found after the end of the compressed stream.
pt_br: Dados encontrados após o término do fluxo compactado.

source: If this attribute is accessed before the end of the stream has been reached, its value will be ``b''``.
pt_br: Se este atributo for acessado antes do final do fluxo ser alcançado, seu valor será ``b''``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
pt_br: ``False`` se o método :meth:`.decompress` puder fornecer mais dados descompactados antes de exigir uma nova entrada descompactada.

source: One-shot (de)compression
pt_br: (De)compressão de uma só vez (one-shot)

source: Compress *data*, a :term:`bytes-like object <bytes-like object>`.
pt_br: Compacta *data*, um :term:`objeto bytes ou similar <bytes-like object>`.

source: For incremental compression, use a :class:`BZ2Compressor` instead.
pt_br: Para compressão incremental, use um :class:`BZ2Compressor`.

source: Decompress *data*, a :term:`bytes-like object <bytes-like object>`.
pt_br: Descompacta *data*, um :term:`objeto bytes ou similar <bytes-like object>`.

source: If *data* is the concatenation of multiple compressed streams, decompress all of the streams.
pt_br: Se *data* for a concatenação de vários fluxos compactados, descompacta todos os fluxos.

source: For incremental decompression, use a :class:`BZ2Decompressor` instead.
pt_br: Para descompressão incremental, use um :class:`BZ2Decompressor`.

source: Support for multi-stream inputs was added.
pt_br: Suporte para entradas multifluxo foi adicionado.

source: Examples of usage
pt_br: Exemplos de uso

source: Below are some examples of typical usage of the :mod:`bz2` module.
pt_br: Abaixo estão alguns exemplos de uso típico do módulo :mod:`bz2`.

source: Using :func:`compress` and :func:`decompress` to demonstrate round-trip compression:
pt_br: Usando :func:`compress` e :func:`decompress` para demonstrar a compactação de ida e volta:

source: Using :class:`BZ2Compressor` for incremental compression:
pt_br: Usando :class:`BZ2Compressor` para compressão incremental:

source: The example above uses a very "nonrandom" stream of data (a stream of ``b"z"`` chunks). Random data tends to compress poorly, while ordered, repetitive data usually yields a high compression ratio.
pt_br: O exemplo acima usa um fluxo de dados muito "não aleatório" (um fluxo de partes ``b"z"``). Dados aleatórios tendem a compactar mal, enquanto dados ordenados e repetitivos geralmente produzem uma alta taxa de compactação.

source: Writing and reading a bzip2-compressed file in binary mode:
pt_br: Escrevendo e lendo um arquivo compactado com bzip2 no modo binário:
