Repository: python/python-docs-pt-br
Catalog: library/calendar.po
Languages: pt_br

source: :mod:`!calendar` --- General calendar-related functions
pt_br: :mod:`!calendar` --- Funções gerais relacionadas ao calendário

source: **Source code:** :source:`Lib/calendar.py`
pt_br: **Código-fonte:** :source:`Lib/calendar.py`

source: This module allows you to output calendars like the Unix :program:`cal` program, and provides additional useful functions related to the calendar. By default, these calendars have Monday as the first day of the week, and Sunday as the last (the European convention). Use :func:`setfirstweekday` to set the first day of the week to Sunday (6) or to any other weekday. Parameters that specify dates are given as integers. For related functionality, see also the :mod:`datetime` and :mod:`time` modules.
pt_br: Este módulo permite que você exiba calendários como o programa Unix :program:`cal`, e fornece funções adicionais úteis relacionadas ao calendário. Por padrão, esses calendários têm a segunda-feira como o primeiro dia da semana, e domingo como o último (a convenção europeia). Use :func:`setfirstweekday` para colocar o primeiro dia da semana como domingo (6) ou para qualquer outro dia da semana. Parâmetros que especificam datas são dados como inteiros. Para funcionalidade relacionada, veja também os módulos :mod:`datetime` e :mod:`time`.

source: The functions and classes defined in this module use an idealized calendar, the current Gregorian calendar extended indefinitely in both directions. This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book "Calendrical Calculations", where it's the base calendar for all computations. Zero and negative years are interpreted as prescribed by the ISO 8601 standard. Year 0 is 1 BC, year -1 is 2 BC, and so on.
pt_br: As funções e classes definidas neste módulo usam um calendário idealizado, o calendário Gregoriano atual estendido indefinidamente nas duas direções. Isso corresponde à definição do calendário "proleptic Gregorian" (gregoriano proléptico) no livro "Calendrical Calculations" de Dershowitz e Reingold, onde está o calendário base para todas os cálculos. Anos com zero ou negativos são interpretados e prescritos pelo padrão ISO 8601. Ano 0 é 1 A.C., ano -1 é 2 A.C, e de assim em diante.

source: Creates a :class:`Calendar` object. *firstweekday* is an integer specifying the first day of the week. :const:`MONDAY` is ``0`` (the default), :const:`SUNDAY` is ``6``.
pt_br: Cria um objeto :class:`Calendar`. *firstweekday* é um inteiro que especifica o primeiro dia da semana. :const:`MONDAY` é ``0`` (o padrão), :const:`SUNDAY` é ``6``.

source: A :class:`Calendar` object provides several methods that can be used for preparing the calendar data for formatting. This class doesn't do any formatting itself. This is the job of subclasses.
pt_br: Um objeto :class:`Calendar` fornece vários métodos que podem ser usados para preparar os dados do calendário para formatação. Esta classe não realiza nenhuma formatação por si mesma. Esse é o trabalho das subclasses.

source: :class:`Calendar` instances have the following methods and attributes:
pt_br: Instâncias de :class:`Calendar` têm os seguintes métodos e atributos:

source: The first weekday as an integer (0--6).
pt_br: O primeiro dia da semana como um inteiro (0--6).

source: This property can also be set and read using :meth:`~Calendar.setfirstweekday` and :meth:`~Calendar.getfirstweekday` respectively.
pt_br: Esta propriedade também pode ser definida e lida usando :meth:`~Calendar.setfirstweekday` e :meth:`~Calendar.getfirstweekday` respectivamente.

source: Return an :class:`int` for the current first weekday (0--6).
pt_br: Retorna um :class:`int` para o primeiro dia da semana atual (0-6).

source: Identical to reading the :attr:`~Calendar.firstweekday` property.
pt_br: Idêntico à leitura da propriedade :attr:`~Calendar.firstweekday`.

source: Set the first weekday to *firstweekday*, passed as an :class:`int` (0--6)
pt_br: Define o primeiro dia da semana como *firstweekday*, passado como :class:`int` (0--6)

source: Identical to setting the :attr:`~Calendar.firstweekday` property.
pt_br: Idêntico à definição da propriedade :attr:`~Calendar.firstweekday`.

source: Return an iterator for the week day numbers that will be used for one week. The first value from the iterator will be the same as the value of the :attr:`~Calendar.firstweekday` property.
pt_br: Retorna um iterador para os números dos dias da semana que serão usados em uma semana. O primeiro valor do iterador será o mesmo que o valor da propriedade :attr:`~Calendar.firstweekday`.

source: Return an iterator for the month *month* (1--12) in the year *year*. This iterator will return all days (as :class:`datetime.date` objects) for the month and all days before the start of the month or after the end of the month that are required to get a complete week.
pt_br: Retorna um iterador para o mês *month* (1--12) no ano *year*. Este iterador retornará todos os dias (como objetos :class:`datetime.date`) para o mês e todos os dias antes do início do mês ou após o final do mês que são necessários para obter uma semana completa.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will simply be day of the month numbers. For the days outside of the specified month, the day number is ``0``.
pt_br: Retorna um iterador para o mês *month* no ano *year* semelhante a :meth:`itermonthdates`, mas não restrito pelo intervalo de :class:`datetime.date`. Os dias retornados serão simplesmente os números dos dias do mês. Para os dias fora do mês especificado, o número do dia será ``0``.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a day of the month number and a week day number.
pt_br: Retorna um iterador para o mês *month* no ano *year* semelhante a :meth:`itermonthdates`, mas não restrito pelo intervalo de :class:`datetime.date`. Os dias retornados serão tuplas consistindo de um número de dia do mês e um número de dia da semana.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month and a day of the month numbers.
pt_br: Retorna um iterador para o mês *month* no ano *year* semelhante a :meth:`itermonthdates`, mas não restrito pelo intervalo de :class:`datetime.date`. Os dias retornados serão tuplas consistindo de números de um ano, um mês e um dia do mês.

source: Return an iterator for the month *month* in the year *year* similar to :meth:`itermonthdates`, but not restricted by the :class:`datetime.date` range. Days returned will be tuples consisting of a year, a month, a day of the month, and a day of the week numbers.
pt_br: Retorna um iterador para o mês *month* no ano *year* semelhante a :meth:`itermonthdates`, mas não restrito pelo intervalo de :class:`datetime.date`. Os dias retornados serão tuplas consistindo de números de um ano, um mês, um dia do mês e um dia da semana.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven :class:`datetime.date` objects.
pt_br: Retorna uma lista das semanas do mês *month* do *year* como semanas completas. As semanas são listas de sete objetos :class:`datetime.date`.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven tuples of day numbers and weekday numbers.
pt_br: Retorna uma lista das semanas do mês *month* do ano *year* como semanas completas. As semanas são listas de sete tuplas de números dias e de dias de semanas.

source: Return a list of the weeks in the month *month* of the *year* as full weeks. Weeks are lists of seven day numbers.
pt_br: Retorna uma lista das semanas do mês *month* do ano *year* como semanas completas. As semanas são listas de números de sete dias.

source: Return the data for the specified year ready for formatting. The return value is a list of month rows. Each month row contains up to *width* months (defaulting to 3). Each month contains between 4 and 6 weeks and each week contains 1--7 days. Days are :class:`datetime.date` objects.
pt_br: Retorna os dados para o ano especificado prontos para formatação. O valor de retorno é uma lista de linhas de meses. Cada linha de mês contém até *width* meses (padrão é 3). Cada mês contém entre 4 e 6 semanas, e cada semana contém 1--7 dias. Os dias são objetos :class:`datetime.date`.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are tuples of day numbers and weekday numbers. Day numbers outside this month are zero.
pt_br: Retorna os dados para o ano especificado prontos para formatação (semelhante a :meth:`yeardatescalendar`). Entradas nas listas semanais são tuplas de números de dias e números de dias de semana. Números de dias fora deste mês são zero.

source: Return the data for the specified year ready for formatting (similar to :meth:`yeardatescalendar`). Entries in the week lists are day numbers. Day numbers outside this month are zero.
pt_br: Retorna a data para o ano especificado prontos para formatação (semelhante a :meth:`yeardatescalendar`). Entradas nas listas de semanas são números de dias. Números de dias fora deste mês são zero.

source: This class can be used to generate plain text calendars.
pt_br: Esta classe pode ser usada para gerar texto plano para calendários.

source: :class:`TextCalendar` instances have the following methods:
pt_br: Instâncias de :class:`TextCalendar` têm os seguintes métodos:

source: Return a string representing a single day formatted with the given *width*. If *theday* is ``0``, return a string of spaces of the specified width, representing an empty day. The *weekday* parameter is unused.
pt_br: Retorna uma string representando um único dia formatado com a largura fornecida em *width*. Se *theday* for ``0``, retorna uma string de espaços da largura especificada, representando um dia vazio. O parâmetro *weekday* não é usado.

source: Return a single week in a string with no newline. If *w* is provided, it specifies the width of the date columns, which are centered. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
pt_br: Retorna uma única semana em uma string sem nova linha. Se *w* for providenciado, isto especifica a largura das colunas de data, que são centrais. Dependendo do primeiro dia da semana conforme especificado no construtor ou configurado pelo método :meth:`setfirstweekday`.

source: Return a string representing the name of a single weekday formatted to the specified *width*. The *weekday* parameter is an integer representing the day of the week, where ``0`` is Monday and ``6`` is Sunday.
pt_br: Retorna uma string representando o nome de um único dia da semana formatado para a largura especificada em *width*. O parâmetro *weekday* é um inteiro representando o dia da semana, onde ``0`` é segunda-feira e ``6`` é domingo.

source: Return a string containing the header row of weekday names, formatted with the given *width* for each column. The names depend on the locale settings and are padded to the specified width.
pt_br: Retorna uma string contendo a linha de cabeçalho dos nomes dos dias da semana, formatada com a largura fornecida por *width* para cada coluna. Os nomes dependem das configurações de localidade e são preenchidos até a largura especificada.

source: Return a month's calendar in a multi-line string. If *w* is provided, it specifies the width of the date columns, which are centered. If *l* is given, it specifies the number of lines that each week will use. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method.
pt_br: Retorna o calendário do mês em uma string multilinha. Se *w* for providenciado, isto especifica a largura das colunas de data, que são centrais. Se *l* for dado, este especifica o número de linhas que cada semana vai usar. Dependendo do primeiro dia da semana conforme especificado no construtor ou configurado pelo método :meth:`setfirstweekday`.

source: Return a string representing the month's name centered within the specified *width*. If *withyear* is ``True``, include the year in the output. The *theyear* and *themonth* parameters specify the year and month for the name to be formatted respectively.
pt_br: Retorna uma string representando o nome do mês centralizado dentro da largura especificada em *width*. Se *withyear* for ``True``, inclui o ano na saída. Os parâmetros *theyear* e *themonth* especificam o ano e o mês para o nome a ser formatado, respectivamente.

source: Print a month's calendar as returned by :meth:`formatmonth`.
pt_br: Imprime um calendário do mês conforme retornado pelo :meth:`formatmonth`.

source: Return a *m*-column calendar for an entire year as a multi-line string. Optional parameters *w*, *l*, and *c* are for date column width, lines per week, and number of spaces between month columns, respectively. Depends on the first weekday as specified in the constructor or set by the :meth:`setfirstweekday` method. The earliest year for which a calendar can be generated is platform-dependent.
pt_br: Retorna um calendário com *m* colunas para um ano inteiro conforme uma string multilinha. Parâmetros opcionais *w*, *l* e *c* definem a largura da coluna data, linhas por semana e números de espaços entre as colunas dos meses, respectivamente. Depende do primeiro dia da semana conforme especificado no construtor ou definido pelo método :meth:`setfirstweekday`. O ano mais novo para o qual o calendário pode ser gerado depende da plataforma.

source: Print the calendar for an entire year as returned by :meth:`formatyear`.
pt_br: Imprime o calendário para um ano inteiro conforme retornado por :meth:`formatyear`.

source: This class can be used to generate HTML calendars.
pt_br: Esta classse pode ser usada para gerar calendários HTML.

source: :class:`!HTMLCalendar` instances have the following methods:
pt_br: Instâncias de :class:`!HTMLCalendar` têm os seguintes métodos:

source: Return a month's calendar as an HTML table. If *withyear* is true the year will be included in the header, otherwise just the month name will be used.
pt_br: Retorna um calendário do mês como uma tabela HTML. Se *withyear* for verdadeiro, o ano será incluído no cabeçalho, senão apenas o nome do mês será utilizado.

source: Return a year's calendar as an HTML table. *width* (defaulting to 3) specifies the number of months per row.
pt_br: Retorna um calendário do ano como uma tabela HTML. *width* (padronizada para 3) especifica o número de meses por linha.

source: Return a year's calendar as a complete HTML page. *width* (defaulting to 3) specifies the number of months per row. *css* is the name for the cascading style sheet to be used. :const:`None` can be passed if no style sheet should be used. *encoding* specifies the encoding to be used for the output (defaulting to the system default encoding).
pt_br: Retorna o calendário de um ano como uma página HTML completa. *width* (padrão 3) especifica o número de meses por linha. *css* é o nome da folha de estilo em cascata a ser usada. :const:`None` pode ser passado se nenhuma folha de estilo deve ser usada. *encoding* especifica a codificação a ser usada para a saída (padrão para a codificação padrão do sistema).

source: Return a month name as an HTML table row. If *withyear* is true the year will be included in the row, otherwise just the month name will be used.
pt_br: Retorna um nome de mês como uma linha de tabela HTML. Se *withyear* for verdadeiro, o ano será incluído na linha, senão apenas o nome do mês será utilizado.

source: :class:`!HTMLCalendar` has the following attributes you can override to customize the CSS classes used by the calendar:
pt_br: :class:`!HTMLCalendar` tem os seguintes atributos que você pode substituir para personalizar as classes CSS usadas pelo calendário:

source: A list of CSS classes used for each weekday. The default class list is::
pt_br: Uma lista de classes CSS usadas para cada dia da semana. A lista de classes padrão é::

source: more styles can be added for each day::
pt_br: mais estilos podem ser adicionados para cada dia::

source: Note that the length of this list must be seven items.
pt_br: Observe que o comprimento desta lista deve ser de sete itens.

source: The CSS class for a weekday occurring in the previous or coming month.
pt_br: A classe CSS para um dia da semana que ocorre no mês anterior ou seguinte.

source: A list of CSS classes used for weekday names in the header row. The default is the same as :attr:`cssclasses`.
pt_br: Uma lista de classes CSS usadas para nomes de dias da semana na linha de cabeçalho. O padrão é o mesmo que :attr:`cssclasses`.

source: The month's head CSS class (used by :meth:`formatmonthname`). The default value is ``"month"``.
pt_br: A classe CSS principal do mês (usada por :meth:`formatmonthname`). O valor padrão é ``"month"``.

source: The CSS class for the whole month's table (used by :meth:`formatmonth`). The default value is ``"month"``.
pt_br: A classe CSS para a tabela do mês inteiro (usada por :meth:`formatmonth`). O valor padrão é ``"month"``.

source: The CSS class for the whole year's table of tables (used by :meth:`formatyear`). The default value is ``"year"``.
pt_br: A classe CSS para a tabela de tabelas do ano inteiro (usada por :meth:`formatyear`). O valor padrão é ``"year"``.

source: The CSS class for the table head for the whole year (used by :meth:`formatyear`). The default value is ``"year"``.
pt_br: A classe CSS para o cabeçalho da tabela para o ano inteiro (usado por :meth:`formatyear`). O valor padrão é ``"year"``.

source: Note that although the naming for the above described class attributes is singular (e.g. ``cssclass_month`` ``cssclass_noday``), one can replace the single CSS class with a space separated list of CSS classes, for example::
pt_br: Observe que, embora a nomenclatura dos atributos de classe descritos acima seja singular (por exemplo, ``cssclass_month`` ``cssclass_noday``), é possível substituir a única classe CSS por uma lista de classes CSS separadas por espaços, por exemplo:

source: Here is an example how :class:`!HTMLCalendar` can be customized::
pt_br: Aqui está um exemplo de como :class:`!HTMLCalendar` pode ser personalizado::

source: This subclass of :class:`TextCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale.
pt_br: Esta subclasse de :class:`TextCalendar` pode receber um nome de localidade no construtor e retornará nomes de meses e dias da semana na localidade especificada.

source: This subclass of :class:`HTMLCalendar` can be passed a locale name in the constructor and will return month and weekday names in the specified locale.
pt_br: Esta subclasse de :class:`HTMLCalendar` pode receber um nome de localidade no construtor e retornará nomes de meses e dias da semana na localidade especificada.

source: The constructor, :meth:`!formatweekday` and :meth:`!formatmonthname` methods of these two classes temporarily change the ``LC_TIME`` locale to the given *locale*. Because the current locale is a process-wide setting, they are not thread-safe.
pt_br: Os métodos construtores :meth:`!formatweekday` e :meth:`!formatmonthname` dessas duas classes alteram temporariamente a localidade ``LC_TIME`` para o *locale* fornecido. Como a localidade atual é uma configuração de todo o processo, eles não são seguros para threads.

source: For simple text calendars this module provides the following functions.
pt_br: Para calendários de texto simples, este módulo fornece as seguintes funções.

source: Sets the weekday (``0`` is Monday, ``6`` is Sunday) to start each week. The values :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY`, and :const:`SUNDAY` are provided for convenience. For example, to set the first weekday to Sunday::
pt_br: Define o dia da semana (``0`` é segunda-feira, ``6`` é domingo) para começar cada semana. Os valores :const:`MONDAY`, :const:`TUESDAY`, :const:`WEDNESDAY`, :const:`THURSDAY`, :const:`FRIDAY`, :const:`SATURDAY` e :const:`SUNDAY` são fornecidos para conveniência. Por exemplo, para definir o primeiro dia da semana como domingo::

source: Returns the current setting for the weekday to start each week.
pt_br: Retorna a configuração atual para o dia da semana que inicia cada semana.

source: Returns :const:`True` if *year* is a leap year, otherwise :const:`False`.
pt_br: Retorna :const:`True` se *year* for um ano bissexto, caso contrário, :const:`False`.

source: Returns the number of leap years in the range from *y1* to *y2* (exclusive), where *y1* and *y2* are years.
pt_br: Retorna o número de anos bissextos no intervalo de *y1* a *y2* (exclusivo), onde *y1* e *y2* são anos.

source: This function works for ranges spanning a century change.
pt_br: Esta função funciona para intervalos que abrangem uma mudança de século.

source: Returns the day of the week (``0`` is Monday) for *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).
pt_br: Retorna o dia da semana (``0`` é segunda-feira) para *year* (``1970``--...), *month* (``1``--``12``), *day* (``1``--``31``).

source: Return a header containing abbreviated weekday names. *n* specifies the width in characters for one weekday.
pt_br: Retorna um cabeçalho contendo nomes abreviados de dias da semana. *n* especifica a largura em caracteres para um dia da semana.

source: Returns weekday of first day of the month and number of days in month, for the specified *year* and *month*.
pt_br: Retorna o dia da semana do primeiro dia do mês e o número de dias do mês, para o *year* e *month* especificados.

source: Returns a matrix representing a month's calendar. Each row represents a week; days outside of the month are represented by zeros. Each week begins with Monday unless set by :func:`setfirstweekday`.
pt_br: Retorna uma matriz representando o calendário de um mês. Cada linha representa uma semana; dias fora do mês são representados por zeros. Cada semana começa com segunda-feira, a menos que seja definida por :func:`setfirstweekday`.

source: Prints a month's calendar as returned by :func:`month`.
pt_br: Imprime um calendário do mês conforme retornado pelo :func:`month`.

source: Returns a month's calendar in a multi-line string using the :meth:`~TextCalendar.formatmonth` of the :class:`TextCalendar` class.
pt_br: Retorna o calendário de um mês em uma string de várias linhas usando :meth:`~TextCalendar.formatmonth` da classe :class:`TextCalendar`.

source: Prints the calendar for an entire year as returned by :func:`calendar`.
pt_br: Imprime o calendário para um ano inteiro conforme retornado por :func:`calendar`.

source: Returns a 3-column calendar for an entire year as a multi-line string using the :meth:`~TextCalendar.formatyear` of the :class:`TextCalendar` class.
pt_br: Retorna um calendário de 3 colunas para um ano inteiro como uma string de várias linhas usando :meth:`~TextCalendar.formatyear` da classe :class:`TextCalendar`.
