Repository: python/python-docs-pt-br
Catalog: library/calendar.po
Languages: pt_br

source: An unrelated but handy function that takes a time tuple such as returned by the :func:`~time.gmtime` function in the :mod:`time` module, and returns the corresponding Unix timestamp value, assuming an epoch of 1970, and the POSIX encoding. In fact, :func:`time.gmtime` and :func:`timegm` are each others' inverse.
pt_br: Uma função não relacionada, mas útil, que pega uma tupla de tempo, como a retornada pela função :func:`~time.gmtime` no módulo :mod:`time`, e retorna o valor de registro de data e hora Unix correspondente, persumindo uma época de 1970 e a codificação POSIX. Na verdade, :func:`time.gmtime` e :func:`timegm` são inversos um do outro.

source: The :mod:`calendar` module exports the following data attributes:
pt_br: O módulo :mod:`calendar` exporta os seguintes atributos de dados:

source: A sequence that represents the days of the week in the current locale, where Monday is day number 0.
pt_br: Uma sequência que representa os dias da semana no local atual, onde Monday é o dia número 0.

source: A sequence that represents the abbreviated days of the week in the current locale, where Mon is day number 0.
pt_br: Uma sequência que representa os dias abreviados da semana no local atual, onde Mon é o dia número 0.

source: Aliases for the days of the week, where ``MONDAY`` is ``0`` and ``SUNDAY`` is ``6``.
pt_br: Apelidos para os dias da semana, onde ``MONDAY`` é ``0`` e ``SUNDAY`` é ``6``.

source: Enumeration defining days of the week as integer constants. The members of this enumeration are exported to the module scope as :data:`MONDAY` through :data:`SUNDAY`.
pt_br: Enumeração que define os dias da semana como constantes inteiras. Os membros dessa enumeração são exportados para o escopo do módulo como :data:`MONDAY` até :data:`SUNDAY`.

source: A sequence that represents the months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_name[0]`` is the empty string.
pt_br: Uma sequência que representa os meses do ano na localidade atual. Isso segue a convenção normal de janeiro sendo o mês número 1, então tem um comprimento de 13 e ``month_name[0]`` é a string vazia.

source: A sequence that represents the abbreviated months of the year in the current locale. This follows normal convention of January being month number 1, so it has a length of 13 and ``month_abbr[0]`` is the empty string.
pt_br: Uma sequência que representa os meses abreviados do ano na localidade atual. Isso segue a convenção normal de janeiro sendo o mês número 1, então tem um comprimento de 13 e ``month_abbr[0]`` é a string vazia.

source: Aliases for the months of the year, where ``JANUARY`` is ``1`` and ``DECEMBER`` is ``12``.
pt_br: Apelidos para os meses do ano, onde ``JANUARY`` é ``1`` e ``DECEMBER`` é ``12``.

source: Enumeration defining months of the year as integer constants. The members of this enumeration are exported to the module scope as :data:`JANUARY` through :data:`DECEMBER`.
pt_br: Enumeração que define os meses do ano como constantes inteiras. Os membros dessa enumeração são exportados para o escopo do módulo como :data:`JANUARY` até :data:`DECEMBER`.

source: The :mod:`calendar` module defines the following exceptions:
pt_br: O módulo :mod:`calendar` define as seguintes exceções:

source: A subclass of :exc:`ValueError`, raised when the given month number is outside of the range 1-12 (inclusive).
pt_br: Uma subclasse de :exc:`ValueError`, levantada quando o número do mês fornecido está fora do intervalo de 1 a 12 (inclusive).

source: The invalid month number.
pt_br: O número de meses inválidos.

source: A subclass of :exc:`ValueError`, raised when the given weekday number is outside of the range 0-6 (inclusive).
pt_br: Uma subclasse de :exc:`ValueError`, levantada quando o número do dia da semana fornecido está fora do intervalo de 0 a 6 (inclusive).

source: The invalid weekday number.
pt_br: O número de dias da semana inválidos.

source: Module :mod:`datetime`
pt_br: Módulo :mod:`datetime`

source: Object-oriented interface to dates and times with similar functionality to the :mod:`time` module.
pt_br: Interface orientada a objetos para datas e horas com funcionalidade semelhante ao módulo :mod:`time`.

source: Module :mod:`time`
pt_br: Módulo :mod:`time`

source: Low-level time related functions.
pt_br: Funções de baixo nível relacionadas ao tempo.

source: Command-line usage
pt_br: Uso na linha de comando

source: The :mod:`calendar` module can be executed as a script from the command line to interactively print a calendar.
pt_br: O módulo :mod:`calendar` pode ser executado como um script na linha de comando para exibir interativamente um calendário.

source: For example, to print a calendar for the year 2000:
pt_br: Por exemplo, para exibir um calendário para o ano 2000:

source: The following options are accepted:
pt_br: As seguintes opções são aceitas:

source: Show the help message and exit.
pt_br: Mostra a mensagem de ajuda e sai.

source: The locale to use for month and weekday names. Defaults to English.
pt_br: A localidade a ser usada para nomes de meses e dias da semana. O padrão é inglês.

source: The encoding to use for output. :option:`--encoding` is required if :option:`--locale` is set.
pt_br: A codificação a ser usada para saída. :option:`--encoding` é necessário se :option:`--locale` estiver definido.

source: Print the calendar to the terminal as text, or as an HTML document.
pt_br: Exibe o calendário no terminal como texto ou como um documento HTML.

source: The weekday to start each week. Must be a number between 0 (Monday) and 6 (Sunday). Defaults to 0.
pt_br: O dia da semana para começar cada semana. Deve ser um número entre 0 (segunda-feira) e 6 (domingo). O padrão é 0.

source: The year to print the calendar for. Defaults to the current year.
pt_br: O ano para exibir o calendário. O padrão é o ano atual.

source: The month of the specified :option:`year` to print the calendar for. Must be a number between 1 and 12, and may only be used in text mode. Defaults to printing a calendar for the full year.
pt_br: O mês do :option:`year` especificado para exibir o calendário. Deve ser um número entre 1 e 12 e pode ser usado somente no modo texto. O padrão é exibir um calendário para o ano inteiro.

source: *Text-mode options:*
pt_br: *Opções de modo texto:*

source: The width of the date column in terminal columns. The date is printed centred in the column. Any value lower than 2 is ignored. Defaults to 2.
pt_br: A largura da coluna de data em colunas terminais. A data é exibida centralizada na coluna. Qualquer valor menor que 2 é ignorado. O padrão é 2.

source: The number of lines for each week in terminal rows. The date is printed top-aligned. Any value lower than 1 is ignored. Defaults to 1.
pt_br: O número de linhas para cada semana em linhas terminais. A data é exibida alinhada no topo. Qualquer valor menor que 1 é ignorado. O padrão é 1.

source: The space between months in columns. Any value lower than 2 is ignored. Defaults to 6.
pt_br: O espaço entre os meses em colunas. Qualquer valor menor que 2 é ignorado. O padrão é 6.

source: The number of months printed per row. Defaults to 3.
pt_br: O número de meses exibidos por linha. O padrão é 3.

source: By default, today's date is highlighted in color and can be :ref:`controlled using environment variables <using-on-controlling-color>`.
pt_br: Por padrão, a data de hoje é destacada em cor e pode ser :ref:`controlada usando variáveis de ambiente <using-on-controlling-color>`.

source: *HTML-mode options:*
pt_br: *Opções de modo HTML:*

source: The path of a CSS stylesheet to use for the calendar. This must either be relative to the generated HTML, or an absolute HTTP or ``file:///`` URL.
pt_br: O caminho de uma folha de estilo CSS a ser usada para o calendário. Isso deve ser relativo ao HTML gerado ou um HTTP absoluto ou URL ``file:///``.
