Repository: python/python-docs-pt-br
Catalog: library/cgi.po
Languages: pt_br

source: :mod:`cgi` --- Common Gateway Interface support
pt_br: :mod:`cgi` --- wsparcie dla wspólnego sprzęgu bramki - z ang. - Common Gateway Interface

source: **Source code:** :source:`Lib/cgi.py`
pt_br: **Вихідний код:** :source:`Lib/cgi.py`

source: The :mod:`cgi` module is deprecated (see :pep:`PEP 594 <594#cgi>` for details and alternatives).
pt_br: Модуль :mod:`cgi` є застарілим (перегляньте :pep:`PEP 594 <594#cgi>` для деталей та альтернатив).

source: Support module for Common Gateway Interface (CGI) scripts.
pt_br: Wspierający moduł dla skryptów sprzęgu wspólnej bramki (z ang. CGI).

source: This module defines a number of utilities for use by CGI scripts written in Python.
pt_br: Ten moduł definiuje pewną liczbę użyteczności dla użycia przez skrypty CGI napisane w języku pytonowskim.

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
pt_br: このモジュールは WebAssembly プラットフォーム ``wasm32-emscripten`` と ``wasm32-wasi`` では動作しないか、利用不可です。詳しくは、:ref:`wasm-availability` を見てください。

source: Introduction
pt_br: Introdução

source: A CGI script is invoked by an HTTP server, usually to process user input submitted through an HTML ``<FORM>`` or ``<ISINDEX>`` element.
pt_br: Skrypt CGI jest wywoływany przez serwer HTTP, zwykle aby przetworzyć wejście użytkownika dostarczone przez HTML ``<FORM>`` lub element ``<ISINDEX>``.

source: Most often, CGI scripts live in the server's special :file:`cgi-bin` directory. The HTTP server places all sorts of information about the request (such as the client's hostname, the requested URL, the query string, and lots of other goodies) in the script's shell environment, executes the script, and sends the script's output back to the client.
pt_br: Najczęściej, Skrypty CGI przebywają w katalogu specjalnym serwera :file:`cgi-bin`. Serwer HTTP umieszcza wszelkiego rodzaju informacje o zapytaniu (takie jak nazwa hosta klienta, oczekiwany adres URL, ciąg zapytania, i wiele innych dobrych rzeczy) w środowisku powłoki skryptu, wykonuje skrypt i wysyła wyjście skryptu z powrotem do klienta.

source: The script's input is connected to the client too, and sometimes the form data is read this way; at other times the form data is passed via the "query string" part of the URL. This module is intended to take care of the different cases and provide a simpler interface to the Python script. It also provides a number of utilities that help in debugging scripts, and the latest addition is support for file uploads from a form (if your browser supports it).
pt_br: Wejście skryptu jest połączone z klientem także, i czasami dane formularza są wczytywane tą drogą także; innym razem dane formularza są przekazywane przez "ciąg zapytania" jako część adresu URL. Ten moduł jest przeznaczony do zajmowania się różnymi przypadkami i dostarczenia prostszego sprzęgu dla skryptu języka pytonowskiego. To także dostarcza pewną liczbę użyteczności które pomagają w odpluskwianiu skryptów zaś najnowszym dodatkiem jest wsparcie dla załadowywania plików przez formularz (jeśli twoja przeglądarka to wspomaga).

source: The output of a CGI script should consist of two sections, separated by a blank line. The first section contains a number of headers, telling the client what kind of data is following. Python code to generate a minimal header section looks like this::
pt_br: Wyjście skryptu CGI powinno składać się z dwóch sekcji, oddzielonych pustą linią. Pierwszy rozdział zawiera liczbę nagłówków, mówiąc klientowi jakiego rodzaju dane nastąpią potem. Kod języka pytonowskiego aby wytworzyć minimalny rozdział nagłówkowy wygląda następująco::

source: The second section is usually HTML, which allows the client software to display nicely formatted text with header, in-line images, etc. Here's Python code that prints a simple piece of HTML::
pt_br: Drugi rozdziałem jest zwykle HTML, który pozwala oprogramowaniu klienta wyświetlić ładnie sformatowany tekst z nagłówkiem, obrazkami w-jednej-linii itp. Tu jest kod języka pytonowskiego który drukuje prosty kawałek HTML-a::

source: Using the cgi module
pt_br: Użycie modułu cgi

source: Begin by writing ``import cgi``.
pt_br: Zacznij przez napisanie ``import cgi``.

source: When you write a new script, consider adding these lines::
pt_br: Gdy piszesz nowy skrypt, rozważ dodanie tych linii::

source: This activates a special exception handler that will display detailed reports in the web browser if any errors occur. If you'd rather not show the guts of your program to users of your script, you can have the reports saved to files instead, with code like this::
pt_br: Це активує спеціальний обробник винятків, який відображатиме докладні звіти у веб-браузері, якщо виникнуть будь-які помилки. Якщо ви не бажаєте показувати нутрощі вашої програми користувачам вашого сценарію, ви можете натомість зберегти звіти у файлах із таким кодом::

source: It's very helpful to use this feature during script development. The reports produced by :mod:`cgitb` provide information that can save you a lot of time in tracking down bugs. You can always remove the ``cgitb`` line later when you have tested your script and are confident that it works correctly.
pt_br: Jest bardzo przydatnym użycie tej właściwości w czasie rozwijania skryptu. Raporty produkowane przez :mod:`cgitb` dostarczają informację która może oszczędzić Ci wiele czasu w śledzeniu błędów. Możesz zawsze usunąć ``cgitb`` linię później gdy przetestowałeś swój skrypt i jesteś pewien że działa on prawidłowo.

source: To get at submitted form data, use the :class:`FieldStorage` class. If the form contains non-ASCII characters, use the *encoding* keyword parameter set to the value of the encoding defined for the document. It is usually contained in the META tag in the HEAD section of the HTML document or by the :mailheader:`Content-Type` header. This reads the form contents from the standard input or the environment (depending on the value of various environment variables set according to the CGI standard). Since it may consume standard input, it should be instantiated only once.
pt_br: Щоб отримати надіслані дані форми, використовуйте клас :class:`FieldStorage`. Якщо форма містить символи, що не належать до ASCII, використовуйте параметр ключового слова *encoding* зі значенням кодування, визначеного для документа. Зазвичай він міститься в тегу META в розділі HEAD документа HTML або в заголовку :mailheader:`Content-Type`. Це зчитує вміст форми зі стандартного введення або середовища (залежно від значення різних змінних середовища, встановлених відповідно до стандарту CGI). Оскільки він може споживати стандартний ввід, його слід створити лише один раз.

source: The :class:`FieldStorage` instance can be indexed like a Python dictionary. It allows membership testing with the :keyword:`in` operator, and also supports the standard dictionary method :meth:`~dict.keys` and the built-in function :func:`len`. Form fields containing empty strings are ignored and do not appear in the dictionary; to keep such values, provide a true value for the optional *keep_blank_values* keyword parameter when creating the :class:`FieldStorage` instance.
pt_br: Екземпляр :class:`FieldStorage` можна індексувати як словник Python. Він дозволяє тестувати членство за допомогою оператора :keyword:`in`, а також підтримує стандартний метод словника :meth:`~dict.keys` і вбудовану функцію :func:`len`. Поля форми, що містять порожні рядки, ігноруються та не відображаються в словнику; щоб зберегти такі значення, укажіть справжнє значення для необов’язкового параметра ключового слова *keep_blank_values* під час створення екземпляра :class:`FieldStorage`.

source: For instance, the following code (which assumes that the :mailheader:`Content-Type` header and blank line have already been printed) checks that the fields ``name`` and ``addr`` are both set to a non-empty string::
pt_br: Dla przykładu, następujący kod (który zakłada, że nagłówek :mailheader:`Content-Type` i puste linie zostały już wydrukowane) sprawdza czy pola ``nazwa`` i ``addr`` zostały oba ustawione na nie-pusty ciąg znaków::

source: Here the fields, accessed through ``form[key]``, are themselves instances of :class:`FieldStorage` (or :class:`MiniFieldStorage`, depending on the form encoding). The :attr:`~FieldStorage.value` attribute of the instance yields the string value of the field. The :meth:`~FieldStorage.getvalue` method returns this string value directly; it also accepts an optional second argument as a default to return if the requested key is not present.
pt_br: Тут поля, доступ до яких здійснюється через ``form[key]``, самі є екземплярами :class:`FieldStorage` (або :class:`MiniFieldStorage`, залежно від кодування форми). Атрибут :attr:`~FieldStorage.value` екземпляра дає рядкове значення поля. Метод :meth:`~FieldStorage.getvalue` повертає це значення рядка безпосередньо; він також приймає необов'язковий другий аргумент як типовий для повернення, якщо запитуваний ключ відсутній.

source: If the submitted form data contains more than one field with the same name, the object retrieved by ``form[key]`` is not a :class:`FieldStorage` or :class:`MiniFieldStorage` instance but a list of such instances. Similarly, in this situation, ``form.getvalue(key)`` would return a list of strings. If you expect this possibility (when your HTML form contains multiple fields with the same name), use the :meth:`~FieldStorage.getlist` method, which always returns a list of values (so that you do not need to special-case the single item case). For example, this code concatenates any number of username fields, separated by commas::
pt_br: Якщо надіслані дані форми містять більше одного поля з однаковою назвою, об’єкт, отриманий ``form[key]``, не є екземпляром :class:`FieldStorage` або :class:`MiniFieldStorage`, а списком таких екземплярів . Подібним чином у цій ситуації ``form.getvalue(key)`` поверне список рядків. Якщо ви очікуєте такої можливості (якщо ваша HTML-форма містить кілька полів з однаковою назвою), використовуйте метод :meth:`~FieldStorage.getlist`, який завжди повертає список значень (тобто вам не потрібно вводити спеціальний регістр одиничний випадок). Наприклад, цей код об’єднує будь-яку кількість полів імені користувача, розділених комами:

source: If a field represents an uploaded file, accessing the value via the :attr:`~FieldStorage.value` attribute or the :meth:`~FieldStorage.getvalue` method reads the entire file in memory as bytes. This may not be what you want. You can test for an uploaded file by testing either the :attr:`~FieldStorage.filename` attribute or the :attr:`~FieldStorage.file` attribute. You can then read the data from the :attr:`!file` attribute before it is automatically closed as part of the garbage collection of the :class:`FieldStorage` instance (the :func:`~io.RawIOBase.read` and :func:`~io.IOBase.readline` methods will return bytes)::
pt_br: Якщо поле представляє завантажений файл, доступ до значення через атрибут :attr:`~FieldStorage.value` або метод :meth:`~FieldStorage.getvalue` зчитує весь файл у пам’яті як байти. Це може бути не те, що ви хочете. Ви можете перевірити наявність завантаженого файлу, протестувавши атрибут :attr:`~FieldStorage.filename` або :attr:`~FieldStorage.file`. Потім ви можете прочитати дані з атрибута :attr:`!file`, перш ніж він автоматично закриється як частина збірки сміття екземпляра :class:`FieldStorage` (:func:`~io.RawIOBase.read` і :func:`~io.IOBase.readline` методи повертатимуть байти)::

source: :class:`FieldStorage` objects also support being used in a :keyword:`with` statement, which will automatically close them when done.
pt_br: Об’єкти :class:`FieldStorage` також підтримують використання в операторі :keyword:`with`, який автоматично закриє їх після завершення.

source: If an error is encountered when obtaining the contents of an uploaded file (for example, when the user interrupts the form submission by clicking on a Back or Cancel button) the :attr:`~FieldStorage.done` attribute of the object for the field will be set to the value -1.
pt_br: Якщо під час отримання вмісту завантаженого файлу виникає помилка (наприклад, коли користувач перериває надсилання форми, натиснувши кнопку "Назад" або "Скасувати"), атрибут :attr:`~FieldStorage.done` об’єкта для поля буде встановлено значення -1.

source: The file upload draft standard entertains the possibility of uploading multiple files from one field (using a recursive :mimetype:`multipart/\*` encoding). When this occurs, the item will be a dictionary-like :class:`FieldStorage` item. This can be determined by testing its :attr:`!type` attribute, which should be :mimetype:`multipart/form-data` (or perhaps another MIME type matching :mimetype:`multipart/\*`). In this case, it can be iterated over recursively just like the top-level form object.
pt_br: Standard ładowania pliku przewiduje możliwość załadowania wielu plików z jednego pola (używając rekursywnego kodowania :mimetype:`multipart/\*`). Gdy to się zdarzy, element będzie słowniko-podobnym elementem :class:`FieldStorage`. To może być określone przez sprawdzenie właściwości :attr:`!type`, która powinna być :mimetype:`multipart/form-data` (lub byćmoże inny typ MIME pasujący do :mimetype:`multipart/\*`). W tym przypadku może być on iterowany rekursywnie tak, jak przedmiot formularza nadrzędnego poziomu.

source: When a form is submitted in the "old" format (as the query string or as a single data part of type :mimetype:`application/x-www-form-urlencoded`), the items will actually be instances of the class :class:`MiniFieldStorage`. In this case, the :attr:`!list`, :attr:`!file`, and :attr:`filename` attributes are always ``None``.
pt_br: Gdy formularz jest podawany w "starym" formacie (jako ciąg zapytania lub pojedyncza część danych typu :mimetype:`application/x-www-form-urlencoded`), wszystkie elementy właściwie będą przykładami uogólnienia :class:`MiniFieldStorage`. W tym przypadku, właściwości :attr:`!list`, :attr:`!file`, i :attr:`filename` są zawsze ``None``.

source: A form submitted via POST that also has a query string will contain both :class:`FieldStorage` and :class:`MiniFieldStorage` items.
pt_br: Formularz podany przez sposób postępowania POST który także zawiera ciąg zapytania będzie zawierał zarówno elementy :class:`FieldStorage` jak i :class:`MiniFieldStorage`.

source: The :attr:`~FieldStorage.file` attribute is automatically closed upon the garbage collection of the creating :class:`FieldStorage` instance.
pt_br: Атрибут :attr:`~FieldStorage.file` автоматично закривається після збирання сміття створюваного екземпляра :class:`FieldStorage`.

source: Added support for the context management protocol to the :class:`FieldStorage` class.
pt_br: Додано підтримку протоколу керування контекстом до класу :class:`FieldStorage`.

source: Higher Level Interface
pt_br: Sprzęg Wyższego Poziomu (Higher Level Interface)

source: The previous section explains how to read CGI form data using the :class:`FieldStorage` class. This section describes a higher level interface which was added to this class to allow one to do it in a more readable and intuitive way. The interface doesn't make the techniques described in previous sections obsolete --- they are still useful to process file uploads efficiently, for example.
pt_br: Poprzednia sekcja wyjaśnia jak czytać dane z formularza CGI używając uogólnienia :class:`FieldStorage`. Ten rozdział opisuje sprzęg wyższego rzędu, który został dodany do tego uogólnienia aby pozwolić robić to w bardziej czytelny i intuicyjny sposób. Sprzęg nie powoduje że techniki opisane w poprzednich rozdziałach stają się zbędne --- one są wciąż użyteczne aby wykonywać ładowanie plików efektywnie, dla przykładu.

source: The interface consists of two simple methods. Using the methods you can process form data in a generic way, without the need to worry whether only one or more values were posted under one name.
pt_br: Sprzęg składa się z dwóch prostych sposobów postępowania. Używając sposobów postępowania możesz przetwarzać dane w zastępczy sposób bez konieczności martwienia się czy tylko jedna czy więcej danych zostało opublikowanych pod daną nazwą.

source: In the previous section, you learned to write following code anytime you expected a user to post more than one value under one name::
pt_br: W poprzednim rozdziale, dowiedziałeś się jak pisać następujący kod za każdym razem gdy spodziewałeś się że użytkownik opublikuje więcej niż jedną wartość pod jedną nazwą::

source: This situation is common for example when a form contains a group of multiple checkboxes with the same name::
pt_br: Ta sytuacja jest obecna dla przykładu gdy formularz zawiera grupę wielu pól zaznaczania o tej samej nazwie::

source: In most situations, however, there's only one form control with a particular name in a form and then you expect and need only one value associated with this name. So you write a script containing for example this code::
pt_br: W większości przypadków, jednakże, istnieje tylko jedna urządzenie formularza o określonej nazwie w formularzu i wtedy oczekujesz i potrzebujesz tylko jednej wartości powiązanej z tą nazwą. Więc piszesz skrypt zawierający dla przykładu ten kod::

source: The problem with the code is that you should never expect that a client will provide valid input to your scripts. For example, if a curious user appends another ``user=foo`` pair to the query string, then the script would crash, because in this situation the ``getvalue("user")`` method call returns a list instead of a string. Calling the :meth:`~str.upper` method on a list is not valid (since lists do not have a method of this name) and results in an :exc:`AttributeError` exception.
pt_br: Problem z kodem polega na tym, że nigdy nie powinieneś oczekiwać, że klient dostarczy właściwe wpisy do twoich skryptów. Dla przykładu, jeśli ciekawy użytkownik dołoży jeszcze jedną parę ``user=foo`` do ciągu zapytania, wtedy skrypt ulegnie wypadkowi, ponieważ w tej sytuacji wywołanie sposobu postępowania ``getvalue("user")`` zwróci listę zamiast ciągu znaków. Wywołanie sposobu postępowania :meth:`~str.upper` na liście nie jest prawidłowe (gdyż listy nie mają sposobów postępowania o tej nazwie) i kończy się wyjątkiem :exc:`AttributeError`.

source: Therefore, the appropriate way to read form data values was to always use the code which checks whether the obtained value is a single value or a list of values. That's annoying and leads to less readable scripts.
pt_br: Zatem, właściwym sposobem aby wczytywać dane formularza było zawsze używanie kodu który sprawdza czy otrzymana wartość jest pojedynczą wartością czy listą wartości. To jest irytujące i prowadzi do mniej czytelnych skryptów.

source: A more convenient approach is to use the methods :meth:`~FieldStorage.getfirst` and :meth:`~FieldStorage.getlist` provided by this higher level interface.
pt_br: Зручнішим підходом є використання методів :meth:`~FieldStorage.getfirst` і :meth:`~FieldStorage.getlist`, які надаються цим інтерфейсом вищого рівня.

source: This method always returns only one value associated with form field *name*. The method returns only the first value in case that more values were posted under such name. Please note that the order in which the values are received may vary from browser to browser and should not be counted on. [#]_ If no such form field or value exists then the method returns the value specified by the optional parameter *default*. This parameter defaults to ``None`` if not specified.
pt_br: Ten sposób postępowania zawsze zwraca tylko jedną wartość związaną z polem formularza *name*. Sposób postępowania zwraca tylko pierwszą wartość w przypadku gdy więcej wartości zostało opublikowanych pod taką nazwą. Proszę zauważ że kolejność w jakiej wartości są otrzymywane może różnić się między przeglądarkami i nie powinien liczyć się. [#]_ Jeśli żadne takie pole formularza ani wartość nie istnieje wtedy sposób postępowania zwraca wartość określoną przez opcjonalny parametr *domyślny* - z ang - *default*. Ten parametr domyślnie równy jest ``None`` jeśli nie jest określony.

source: This method always returns a list of values associated with form field *name*. The method returns an empty list if no such form field or value exists for *name*. It returns a list consisting of one item if only one such value exists.
pt_br: Ten sposób postępowania zawsze zwraca listę wartości związaną z polem formularza *name*. Ten sposób postępowania zwraca pustą listę jeśli żadne pole ani wartość nie istnieje dla *nazwy* - z ang. - *name*. Zwraca listę składającą się z jednego elementu jeśli tylko jedna taka wartość istnieje.

source: Using these methods you can write nice compact code::
pt_br: Używając tych sposobów postępowania możesz napisać ładny zgrabny kod::

source: Functions
pt_br: Funções

source: These are useful if you want more control, or if you want to employ some of the algorithms implemented in this module in other circumstances.
pt_br: Te są użyteczne jeśli chcesz więcej kontrolować, lub jeśli chcesz zatrudnić niektóre z algorytmów wypełnionych w tym module w innych przypadkach.

source: Parse a query in the environment or from a file (the file defaults to ``sys.stdin``). The *keep_blank_values*, *strict_parsing* and *separator* parameters are passed to :func:`urllib.parse.parse_qs` unchanged.
pt_br: Проаналізуйте запит у середовищі або з файлу (за замовчуванням файл має ``sys.stdin``). Параметри *keep_blank_values*, *strict_parsing* і *separator* передаються до :func:`urllib.parse.parse_qs` без змін.

source: Parse input of type :mimetype:`multipart/form-data` (for file uploads). Arguments are *fp* for the input file, *pdict* for a dictionary containing other parameters in the :mailheader:`Content-Type` header, and *encoding*, the request encoding.
pt_br: Проаналізуйте вхід типу :mimetype:`multipart/form-data` (для завантаження файлів). Аргументами є *fp* для вхідного файлу, *pdict* для словника, що містить інші параметри в заголовку :mailheader:`Content-Type`, і *encoding*, кодування запиту.

source: Returns a dictionary just like :func:`urllib.parse.parse_qs`: keys are the field names, each value is a list of values for that field. For non-file fields, the value is a list of strings.
pt_br: Повертає словник так само, як :func:`urllib.parse.parse_qs`: ключі — це назви полів, кожне значення — це список значень для цього поля. Для нефайлових полів значенням є список рядків.

source: This is easy to use but not much good if you are expecting megabytes to be uploaded --- in that case, use the :class:`FieldStorage` class instead which is much more flexible.
pt_br: Це легко використовувати, але не дуже добре, якщо ви очікуєте, що буде завантажено мегабайти --- у такому випадку використовуйте натомість клас :class:`FieldStorage`, який є набагато гнучкішим.

source: Added the *encoding* and *errors* parameters. For non-file fields, the value is now a list of strings, not bytes.
pt_br: Додано параметри *encoding* і *errors*. Для нефайлових полів значення тепер є списком рядків, а не байтів.

source: Added the *separator* parameter.
pt_br: Додано параметр *роздільник*.

source: Parse a MIME header (such as :mailheader:`Content-Type`) into a main value and a dictionary of parameters.
pt_br: Wczytaj nagłówek MIME (taki, jak :mailheader:`Content-Type`) do głównej wartości i słownika parametrów.

source: Robust test CGI script, usable as main program. Writes minimal HTTP headers and formats all information provided to the script in HTML format.
pt_br: Надійний тестовий сценарій CGI, який можна використовувати як основну програму. Записує мінімум HTTP-заголовків і форматує всю інформацію, надану сценарію, у форматі HTML.

source: Format the shell environment in HTML.
pt_br: Formatuje środowisko powłoki w HTML-u
