Repository: python/python-docs-pt-br
Catalog: library/cgi.po
Languages: pt_br

source: Format a form in HTML.
pt_br: Formatuje formularz w HTML-u.

source: Format the current directory in HTML.
pt_br: Formatuje obecny katalog w HTML-u.

source: Print a list of useful (used by CGI) environment variables in HTML.
pt_br: Drukuje listę użytecznych (używanych przez CGI) zmiennych środowiskowych w HTML-u.

source: Caring about security
pt_br: Troska o bezpieczeństwo

source: There's one important rule: if you invoke an external program (via :func:`os.system`, :func:`os.popen` or other functions with similar functionality), make very sure you don't pass arbitrary strings received from the client to the shell. This is a well-known security hole whereby clever hackers anywhere on the web can exploit a gullible CGI script to invoke arbitrary shell commands. Even parts of the URL or field names cannot be trusted, since the request doesn't have to come from your form!
pt_br: Є одне важливе правило: якщо ви викликаєте зовнішню програму (через :func:`os.system`, :func:`os.popen` або інші функції з подібною функціональністю), переконайтеся, що ви не передаєте довільні рядки, отримані з клієнта до оболонки. Це добре відома діра в безпеці, через яку спритні хакери будь-де в Інтернеті можуть використовувати довірливий сценарій CGI для виклику довільних команд оболонки. Не можна довіряти навіть частинам URL-адреси чи імен полів, оскільки запит необов’язково надходить із вашої форми!

source: To be on the safe side, if you must pass a string gotten from a form to a shell command, you should make sure the string contains only alphanumeric characters, dashes, underscores, and periods.
pt_br: Aby trzymać się bezpiecznej strony, jeśli przekazujesz ciąg znaków otrzymany z formularza do polecenia powłoki, powinieneś upewnić się, że ciąg znaków zawiera tylko znaki alfanumeryczne, ukośniki, podkreślenia i kropki.

source: Installing your CGI script on a Unix system
pt_br: Instalowanie twojego skryptu CGI na systemie Unix-owym

source: Read the documentation for your HTTP server and check with your local system administrator to find the directory where CGI scripts should be installed; usually this is in a directory :file:`cgi-bin` in the server tree.
pt_br: Przeczytaj dokumentację dla twojego serwera HTTP i sprawdź u swojego administratora systemu aby dowiedzieć się który katalog powinien być użyty dla instalowania skryptów CGI; zwykle to jest katalog :file:`cgi-bin` w drzewie serwera.

source: Make sure that your script is readable and executable by "others"; the Unix file mode should be ``0o755`` octal (use ``chmod 0755 filename``). Make sure that the first line of the script contains ``#!`` starting in column 1 followed by the pathname of the Python interpreter, for instance::
pt_br: Upewnij się że twój skrypt jest czytelny i wykonywalny przez "innych"; tryb pliku Unix-a powinien być ``0o755`` ósemkowo (użyj ``chmod 0755 nazwa-pliku``). Upewnij się, że pierwsza linia skryptu zawiera ``#!`` zaczynając w kolumnie 1 po której następuje ścieżka dostępu do pliku programu interpretującego polecenia języka pytonowskiego, dla przykładu::

source: Make sure the Python interpreter exists and is executable by "others".
pt_br: Upewnij się że program interpretujący polecenia języka pytonowskiego istnieje i jest wykonywalny przez "innych".

source: Make sure that any files your script needs to read or write are readable or writable, respectively, by "others" --- their mode should be ``0o644`` for readable and ``0o666`` for writable. This is because, for security reasons, the HTTP server executes your script as user "nobody", without any special privileges. It can only read (write, execute) files that everybody can read (write, execute). The current directory at execution time is also different (it is usually the server's cgi-bin directory) and the set of environment variables is also different from what you get when you log in. In particular, don't count on the shell's search path for executables (:envvar:`PATH`) or the Python module search path (:envvar:`PYTHONPATH`) to be set to anything interesting.
pt_br: Upewnij się, że jakiekolwiek pliki które twój skrypt chce odczytać lub zapisać są czytelne i możliwe do zapisania odpowiednio, przez "innych" --- ich tryb powinien być ``0o644`` dla czytelnych i ``0o666`` dla możliwych do zapisania. To jest ponieważ z powodów bezpieczeństwa, serwer HTTP wykonuje twój skrypt jako użytkownik "nikt" - z ang. - "nobody" bez żadnych szczególnych przywilejów. Może tylko wczytywać (zapisywać, wykonywać) pliki które wszyscy mogą czytać (zapisać, wykonać). Bierzący katalog w czasie wykonania jest także inny (jest to zwykle katalog serwera cgi-bin) i ustawienie zmiennych środowiskowych jest także inne od tego które dostajesz gdy się zalogujesz. W szczególności, nie licz na ścieżkę przeszukiwania pod kątem plików wykonywalnych (:envvar:`PATH`) ani na ścieżkę przeszukiwania modułów języka pytonowskiego (:envvar:`PYTHONPATH`), że będą ustawione na cokolwiek interesującego.

source: If you need to load modules from a directory which is not on Python's default module search path, you can change the path in your script, before importing other modules. For example::
pt_br: Jeśli potrzebujesz załadować moduły z katalogu który nie jest domyślną ścieżką przeszukiwania modułów języka pytonowskiego, możesz zmienić ścieżkę w twoim skrypcie, przez importowaniem innych modułów. Dla przykładu::

source: (This way, the directory inserted last will be searched first!)
pt_br: (W ten sposób, katalog wstawiony jako ostatni będzie przeszukiwany jako pierwszy!)

source: Instructions for non-Unix systems will vary; check your HTTP server's documentation (it will usually have a section on CGI scripts).
pt_br: Instrukcje dla nie-Unixowych systemów będą różne; Sprawdź dokumentację serwera HTTP (będzie zwykle miała sekcję o skryptach CGI).

source: Testing your CGI script
pt_br: Sprawdzanie twoich skryptów CGI

source: Unfortunately, a CGI script will generally not run when you try it from the command line, and a script that works perfectly from the command line may fail mysteriously when run from the server. There's one reason why you should still test your script from the command line: if it contains a syntax error, the Python interpreter won't execute it at all, and the HTTP server will most likely send a cryptic error to the client.
pt_br: Niestety, skrypt CGI zwykle nie uruchomi się gdy spróbujesz go uruchomić z wiersza poleceń i skrypt który działa dobrze z wiersza polecenia może zawieźć nieoczekiwanie gdy uruchomiony z serwera. Jest jeden powód dla którego wciąż powinieneś testować swój skrypt z wiersza polecenia: jeśli zawiera błąd składniowy, program interpretujący polecenia języka pytonowskiego nie wykona go w ogóle, a serwer HTTP najprawdopodobniej wyśle tajemniczy komunikat o błędzie do klienta.

source: Assuming your script has no syntax errors, yet it does not work, you have no choice but to read the next section.
pt_br: Zakładając, że twój skrypt nie ma błędów składniowych, a jednak wciąż nie działa, nie masz wyboru, tylko musisz czytać dalej.

source: Debugging CGI scripts
pt_br: Odpluskwianie skryptów CGI

source: First of all, check for trivial installation errors --- reading the section above on installing your CGI script carefully can save you a lot of time. If you wonder whether you have understood the installation procedure correctly, try installing a copy of this module file (:file:`cgi.py`) as a CGI script. When invoked as a script, the file will dump its environment and the contents of the form in HTML format. Give it the right mode etc., and send it a request. If it's installed in the standard :file:`cgi-bin` directory, it should be possible to send it a request by entering a URL into your browser of the form:
pt_br: Перш за все, перевірте наявність тривіальних помилок інсталяції --- уважне читання розділу вище про інсталяцію сценарію CGI може заощадити вам багато часу. Якщо вам цікаво, чи правильно ви зрозуміли процедуру встановлення, спробуйте встановити копію цього файлу модуля (:file:`cgi.py`) як сценарій CGI. Коли файл викликається як сценарій, файл створить дамп свого середовища та вмісту форми у форматі HTML. Налаштуйте правильний режим тощо та надішліть запит. Якщо його встановлено в стандартному каталозі :file:`cgi-bin`, можна буде надіслати запит, ввівши URL-адресу у вашому браузері у формі:

source: If this gives an error of type 404, the server cannot find the script -- perhaps you need to install it in a different directory. If it gives another error, there's an installation problem that you should fix before trying to go any further. If you get a nicely formatted listing of the environment and form content (in this example, the fields should be listed as "addr" with value "At Home" and "name" with value "Joe Blow"), the :file:`cgi.py` script has been installed correctly. If you follow the same procedure for your own script, you should now be able to debug it.
pt_br: Jeśli zwróci błąd typu 404, wtedy serwer nie może znaleźć skryptu -- być może potrzebujesz zainstalować go w innych katalogu. Jeśli daje inny błąd, istnieje problem instalacji który powinieneś naprawić zanim spróbujesz iść dalej. Jeśli otrzymujesz ładnie sformatowany wypis środowiska i zawartości formularza (w tym przypadku, pola powinny być wypisane jako "addr" z wartością "At Home" i "name" z wartością "Joe Blow"), plik skryptu :file:`cgi.py` zostały zainstalowane poprawnie. Jeśli wykonasz tę samą procedurę dla twojego własnego skryptu, powinieneś móc go teraz odpluskwiać.

source: The next step could be to call the :mod:`cgi` module's :func:`test` function from your script: replace its main code with the single statement ::
pt_br: Następnym krokiem mogłoby być wezwanie zadania :func:`test` modułu :mod:`cgi` z twojego skryptu: zamiana jej głównego kodu na pojedyncze stwierdzenie::

source: This should produce the same results as those gotten from installing the :file:`cgi.py` file itself.
pt_br: To powinno dać te same wyniki jak te otrzymane z zainstalowania samego pliku :file:`cgi.py`.

source: When an ordinary Python script raises an unhandled exception (for whatever reason: of a typo in a module name, a file that can't be opened, etc.), the Python interpreter prints a nice traceback and exits. While the Python interpreter will still do this when your CGI script raises an exception, most likely the traceback will end up in one of the HTTP server's log files, or be discarded altogether.
pt_br: Gdy zwykły skrypt języka pytonowskiego zgłasza nieobsłużony wyjątek (dla jakiegokolwiek powodu: z powodu literówki w nazwie modułu, pliku który nie może być otwarty, itp.), program interpretujący polecenia języka pytonowskiego wypisuje ładny wypis i wychodzi. Podczas gdy program interpretujący polecenia języka pytonowskiego będzie wciąż to robił gdy twój skrypt CGI zgłosi wyjątek, najprawdopodobniej wypis skończy w jednym z plików logów serwera HTTP, lub zostanie odrzucony całkowicie.

source: Fortunately, once you have managed to get your script to execute *some* code, you can easily send tracebacks to the web browser using the :mod:`cgitb` module. If you haven't done so already, just add the lines::
pt_br: На щастя, коли вам вдалося змусити ваш сценарій виконати *деякий* код, ви можете легко надіслати відстеження до веб-браузера за допомогою модуля :mod:`cgitb`. Якщо ви ще цього не зробили, просто додайте рядки::

source: to the top of your script. Then try running it again; when a problem occurs, you should see a detailed report that will likely make apparent the cause of the crash.
pt_br: na górę twojego skryptu. Wtedy spróbuj uruchomić go jeszcze raz; gdy problem pojawi się znów, powinieneś zobaczyć szczegółowy raport, który prawdopodobnie uczyni jasnym powód wypadku.

source: If you suspect that there may be a problem in importing the :mod:`cgitb` module, you can use an even more robust approach (which only uses built-in modules)::
pt_br: Jeśli podejrzewasz, że może być problem w importowaniu modułu :mod:`cgitb`, możesz użyć nawet jeszcze bardziej wydajnego podejścia (które używa tylko modułów wbudowanych)::

source: This relies on the Python interpreter to print the traceback. The content type of the output is set to plain text, which disables all HTML processing. If your script works, the raw HTML will be displayed by your client. If it raises an exception, most likely after the first two lines have been printed, a traceback will be displayed. Because no HTML interpretation is going on, the traceback will be readable.
pt_br: To opiera się na programie interpretującym polecenia języka pytonowskiego, że wydrukuje swój wypis. Typ treści wyjścia jest ustawiony na zwykły tekst, co wyklucza całą obsługę HTML. Jeśli twój skrypt działa, surowy HTML zostanie pokazany przez twojego klienta. Jeśli zgłasza wyjątek, najprawdopodobniej po tym jak pierwsze linie zostaną wypisane, wypis wsteczny zostanie wyświetlony. Ponieważ żadna interpretacja HTML-a nie miejsca, wypis wsteczny będzie czytelny.

source: Common problems and solutions
pt_br: Typowe problemy i ich rozwiązania

source: Most HTTP servers buffer the output from CGI scripts until the script is completed. This means that it is not possible to display a progress report on the client's display while the script is running.
pt_br: Większość serwerów HTTP przechowuje w przestrzeni wymiany wyjście ze skryptów CGI dopóki skrypt się nie zakończy. To oznacza, że nie jest możliwe wyświetlenie raportu postępu na wyświetlaczu klienta kiedy skrypt działa.

source: Check the installation instructions above.
pt_br: Sprawdź instrukcje instalacyjne powyżej.

source: Check the HTTP server's log files. (``tail -f logfile`` in a separate window may be useful!)
pt_br: Sprawdź pliki logu serwera HTTP. (``tail -f logfile`` w oddzielnym oknie może być użyteczne!)

source: Always check a script for syntax errors first, by doing something like ``python script.py``.
pt_br: Zawsze sprawdzaj skrypt dla błędów składniowych najpierw, przez wykonanie czegoś podobnego do ``python script.py``.

source: If your script does not have any syntax errors, try adding ``import cgitb; cgitb.enable()`` to the top of the script.
pt_br: Jeśli twój skrypt nie ma żadnych błędów składniowych, spróbuj dodać ``import cgitb; cgitb.enable()`` na górze skryptu.

source: When invoking external programs, make sure they can be found. Usually, this means using absolute path names --- :envvar:`PATH` is usually not set to a very useful value in a CGI script.
pt_br: Gdy wywoływane są zewnętrzne programy upewnij się że mogą być znalezione. Zwykle to oznacza, że używanie nazw ścieżek absolutnych --- :envvar:`PATH` nie jest zwykle ustawiana na użyteczną wartość skryptu CGI.

source: When reading or writing external files, make sure they can be read or written by the userid under which your CGI script will be running: this is typically the userid under which the web server is running, or some explicitly specified userid for a web server's ``suexec`` feature.
pt_br: Gdy wczytujesz lub zapisujesz zewnętrzne pliki, upewnij się że mogą one być wczytane lub zapisane przez userid pod którym twój skrypt CGI będzie działał: to jest typowo userid pod którym serwer sieci działa, lub pewny jawnie określony userid dla właściwości sieciowego serwera ``suexec``.

source: Don't try to give a CGI script a set-uid mode. This doesn't work on most systems, and is a security liability as well.
pt_br: Nie próbuj nadawać skryptowi CGI trybu set-uid. To nie działa na większości systemów, i jest odpowiedzialnością za bezpieczeństwo także.

source: Footnotes
pt_br: Notas de rodapé

source: Note that some recent versions of the HTML specification do state what order the field values should be supplied in, but knowing whether a request was received from a conforming browser, or even from a browser at all, is tedious and error-prone.
pt_br: Zauważ że pewne niedawne wersje specyfikacji HTML-a określają w jakiej kolejności wartości pól powinny być dostarczone, ale wiedzieć czy zapytanie zostało otrzymane z odpowiadającej przeglądarki, czy też w ogóle z przeglądarki jest nużące i podatne na błędy.

source: server
pt_br: сервер

source: protocol
pt_br: protocolo

source: headers
pt_br: заголовки

source: security
pt_br: безопасность

source: debugging
pt_br: depuração
