Repository: python/python-docs-pt-br
Catalog: library/cgitb.po
Languages: pt_br

source: :mod:`cgitb` --- Traceback manager for CGI scripts
pt_br: :mod:`cgitb` --- Gerenciador de traceback (situação da pilha de execução) para roteiros de CGI

source: **Source code:** :source:`Lib/cgitb.py`
pt_br: **Código-fonte:** :source:`Lib/cgitb.py`

source: The :mod:`cgitb` module is deprecated (see :pep:`PEP 594 <594#cgitb>` for details).
pt_br: O módulo :mod:`cgitb` foi descontinuado (veja :pep:`PEP 594 <594#cgitb>` para mais detalhes).

source: The :mod:`cgitb` module provides a special exception handler for Python scripts. (Its name is a bit misleading. It was originally designed to display extensive traceback information in HTML for CGI scripts. It was later generalized to also display this information in plain text.) After this module is activated, if an uncaught exception occurs, a detailed, formatted report will be displayed. The report includes a traceback showing excerpts of the source code for each level, as well as the values of the arguments and local variables to currently running functions, to help you debug the problem. Optionally, you can save this information to a file instead of sending it to the browser.
pt_br: O módulo :mod:`cgitb` fornece um tratador de exceção especial para scripts Python. (Seu nome é um pouco enganador. Ele foi originalmente projetado para exibir informações abrangentes de rastreamento em HTML para scripts CGI. Posteriormente, foi generalizado também para exibir essas informações em texto sem formatação.) Após esse módulo ser ativado, se ocorrer uma exceção não detectada, um relatório detalhado e formatado será exibido. O relatório inclui um traceback mostrando trechos do código-fonte para cada nível, bem como os valores dos argumentos e variáveis locais das funções atualmente em execução, para ajudá-lo a depurar o problema. Opcionalmente, você pode salvar essas informações em um arquivo em vez de enviá-las para o navegador.

source: To enable this feature, simply add this to the top of your CGI script::
pt_br: Para habilitar esse recurso, basta adicioná-lo ao topo do seu script CGI::

source: The options to the :func:`enable` function control whether the report is displayed in the browser and whether the report is logged to a file for later analysis.
pt_br: As opções da função :func:`enable` controlam se o relatório é exibido no navegador e se o relatório é registrado em um arquivo para análise posterior.

source: This function causes the :mod:`cgitb` module to take over the interpreter's default handling for exceptions by setting the value of :attr:`sys.excepthook`.
pt_br: Esta função faz com que o módulo :mod:`cgitb` assumir o tratamento padrão do interpretador para exceções definindo o valor de :attr:`sys.excepthook`.

source: The optional argument *display* defaults to ``1`` and can be set to ``0`` to suppress sending the traceback to the browser. If the argument *logdir* is present, the traceback reports are written to files. The value of *logdir* should be a directory where these files will be placed. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``. If the optional argument *format* is ``"html"``, the output is formatted as HTML. Any other value forces plain text output. The default value is ``"html"``.
pt_br: O argumento opcional *display* é padronizado como ``1`` e pode ser definido como ``0`` para suprimir o envio do traceback ao navegador. Se o argumento *logdir* estiver presente, os relatórios de traceback serão gravados nos arquivos. O valor de *logdir* deve ser um diretório em que esses arquivos serão colocados. O argumento opcional *context* é o número de linhas de contexto a serem exibidas em torno da linha atual do código-fonte no traceback; o padrão é ``5``. Se o argumento opcional *format* for ``"html"``, a saída será formatada como HTML. Qualquer outro valor força a saída de texto sem formatação. O valor padrão é ``"html"``.

source: This function handles the exception described by *info* (a 3-tuple containing the result of :func:`sys.exc_info`), formatting its traceback as text and returning the result as a string. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``.
pt_br: Esta função lida com a exceção descrita por *info* (uma tupla com 3 tuplas contendo o resultado de :func:`sys.exc_info`), formatando seu retorno como texto e retornando o resultado como uma string. O argumento opcional *context* é o número de linhas de contexto a serem exibidas em torno da linha atual do código-fonte no traceback; o padrão é ``5``.

source: This function handles the exception described by *info* (a 3-tuple containing the result of :func:`sys.exc_info`), formatting its traceback as HTML and returning the result as a string. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``.
pt_br: Esta função lida com a exceção descrita por *info* (uma tupla com 3 tuplas contendo o resultado de :func:`sys.exc_info`), formatando seu retorno como HTML e retornando o resultado como uma string. O argumento opcional *context* é o número de linhas de contexto a serem exibidas em torno da linha atual do código-fonte no traceback; o padrão é ``5``.

source: This function handles an exception using the default settings (that is, show a report in the browser, but don't log to a file). This can be used when you've caught an exception and want to report it using :mod:`cgitb`. The optional *info* argument should be a 3-tuple containing an exception type, exception value, and traceback object, exactly like the tuple returned by :func:`sys.exc_info`. If the *info* argument is not supplied, the current exception is obtained from :func:`sys.exc_info`.
pt_br: Essa função trata uma exceção usando as configurações padrão (ou seja, mostra um relatório no navegador, mas não faz logon em um arquivo). Isso pode ser usado quando você capturou uma exceção e deseja denunciá-la usando :mod:`cgitb`. O argumento opcional *info* deve ser uma tupla de três, contendo um tipo de exceção, um valor de exceção e um objeto de traceback exatamente como a tupla retornada por :func:`sys.exc_info`. Se o argumento *info* não for fornecido, a exceção atual será obtida em :func:`sys.exc_info`.

source: exceptions
pt_br: exceções

source: in CGI scripts
pt_br: em scripts CGI

source: excepthook() (in module sys)
pt_br: excepthook() (no módulo sys)
