Repository: python/python-docs-pt-br
Catalog: library/chunk.po
Languages: pt_br

source: :mod:`chunk` --- Read IFF chunked data
pt_br: :mod:`chunk` --- Wczytaj pokawałkowane dane IFF

source: **Source code:** :source:`Lib/chunk.py`
pt_br: **Kod źródłowy:** :source:`Lib/chunk.py`

source: The :mod:`chunk` module is deprecated (see :pep:`PEP 594 <594#chunk>` for details).
pt_br: Модуль :mod:`chunk` є застарілим (див. :pep:`PEP 594 <594#chunk>` для деталей).

source: This module provides an interface for reading files that use EA IFF 85 chunks. [#]_ This format is used in at least the Audio Interchange File Format (AIFF/AIFF-C) and the Real Media File Format (RMFF). The WAVE audio file format is closely related and can also be read using this module.
pt_br: Ten moduł dostarcza sprzęg dla wczytania pliku który używa kawałków EA IFF 85. [#]_ Ten format jest używany co najmniej w AIFF - Formacie Pliku Wymiany Dźwięku (AIFF/AIFF-C) i Formacie Pliku Real Media (RMFF). Format pliku dźwiękowego WAVE jest blisko związany i może także być wczytany używając tego modułu.

source: A chunk has the following structure:
pt_br: Kawałek ma następującą strukturę:

source: Length
pt_br: Długość

source: Contents
pt_br: Conteúdo

source: Chunk ID
pt_br: ID kawałka

source: Size of chunk in big-endian byte order, not including the header
pt_br: Rozmiar kawałka w porządku bajtów dużego-endian-u , nie zawierając nagłówka.

source: Data bytes, where *n* is the size given in the preceding field
pt_br: Bajty danych, gdzie *n* jest rozmiarem danym w poprzednim polu

source: 0 or 1
pt_br: 0 lub 1

source: Pad byte needed if *n* is odd and chunk alignment is used
pt_br: Bajt wyrównania potrzebny jeśli *n* jest nieparzysty i wyrównanie kawałka jest używane.

source: The ID is a 4-byte string which identifies the type of chunk.
pt_br: Identyfikator ID jest 4-bajtowym ciągiem znaków który identyfikuje typ kawałka.

source: The size field (a 32-bit value, encoded using big-endian byte order) gives the size of the chunk data, not including the 8-byte header.
pt_br: Pole rozmiaru (32-bitowa wartość, zakodowana używając porządku bajtów dużego-endian-a) daje rozmiar danych kawałka, nie zawierając 8-bajtowego nagłówka.

source: Usually an IFF-type file consists of one or more chunks. The proposed usage of the :class:`Chunk` class defined here is to instantiate an instance at the start of each chunk and read from the instance until it reaches the end, after which a new instance can be instantiated. At the end of the file, creating a new instance will fail with an :exc:`EOFError` exception.
pt_br: Zwykle plik typu IFF składa się z jednego lub więcej fragmentów. Proponowane użycie zdefiniowanej tutaj klasy :class:`Chunk` polega na tworzeniu instancji na początku każdej porcji i odczytywaniu jej aż do końca, po czym można utworzyć nową instancję. Na końcu pliku, tworzenie nowej instancji zakończy się niepowodzeniem z wyjątkiem :exc:`EOFError`.

source: Class which represents a chunk. The *file* argument is expected to be a file-like object. An instance of this class is specifically allowed. The only method that is needed is :meth:`~io.IOBase.read`. If the methods :meth:`~io.IOBase.seek` and :meth:`~io.IOBase.tell` are present and don't raise an exception, they are also used. If these methods are present and raise an exception, they are expected to not have altered the object. If the optional argument *align* is true, chunks are assumed to be aligned on 2-byte boundaries. If *align* is false, no alignment is assumed. The default value is true. If the optional argument *bigendian* is false, the chunk size is assumed to be in little-endian order. This is needed for WAVE audio files. The default value is true. If the optional argument *inclheader* is true, the size given in the chunk header includes the size of the header. The default value is false.
pt_br: Клас, який представляє фрагмент. Очікується, що аргумент *file* буде файлоподібним об’єктом. Примірник цього класу спеціально дозволений. Єдиний потрібний метод це :meth:`~io.IOBase.read`. Якщо методи :meth:`~io.IOBase.seek` і :meth:`~io.IOBase.tell` присутні й не викликають виняткової ситуації, вони також використовуються. Якщо ці методи присутні та викликають виключення, очікується, що вони не змінили об’єкт. Якщо додатковий аргумент *align* має значення true, блоки вважаються вирівняними за 2-байтовими межами. Якщо *align* має значення false, вирівнювання не передбачається. Значення за замовчуванням - true. Якщо необов’язковий аргумент *bigendian* є хибним, розмір блоку вважається таким, що має порядок кінців від маленького. Це потрібно для аудіофайлів WAVE. Значення за замовчуванням - true. Якщо необов’язковий аргумент *inclheader* має значення true, розмір, указаний у заголовку блоку, включає розмір заголовка. Значення за замовчуванням - false.

source: A :class:`Chunk` object supports the following methods:
pt_br: przedmiot uogólnienia :class:`Chunk` wspiera następujące sposoby postępowania:

source: Returns the name (ID) of the chunk. This is the first 4 bytes of the chunk.
pt_br: Zwraca nazwę (IDentyfikator) kawałka. To jest pierwsze 4 bajty kawałka.

source: Returns the size of the chunk.
pt_br: Zwraca rozmiar kawałka.

source: Close and skip to the end of the chunk. This does not close the underlying file.
pt_br: Zamknij i przeskocz na koniec kawałka. To nie zamyka leżącego u podstaw pliku.

source: The remaining methods will raise :exc:`OSError` if called after the :meth:`close` method has been called. Before Python 3.3, they used to raise :exc:`IOError`, now an alias of :exc:`OSError`.
pt_br: Решта методів викличуть :exc:`OSError`, якщо їх викликати після виклику методу :meth:`close`. До Python 3.3 вони викликали :exc:`IOError`, тепер це псевдонім :exc:`OSError`.

source: Returns ``False``.
pt_br: Zwraca ``fałsz``.

source: Set the chunk's current position. The *whence* argument is optional and defaults to ``0`` (absolute file positioning); other values are ``1`` (seek relative to the current position) and ``2`` (seek relative to the file's end). There is no return value. If the underlying file does not allow seek, only forward seeks are allowed.
pt_br: Ustaw obecną pozycję kawałka. Parametr *whence* jest opcjonalny i domyślnie równy ``0`` (bezwzględna pozycja w pliku); inne wartości są ``1`` (wyszukaj w odniesieniu do obecnej pozycji w pliku) i ``2`` (wyszukaj w odniesieniu do końca pliku). Nie ma wartości zwracanej. Jeśli leżący u podstaw plik nie pozwala na wyszukiwanie, tylko wyszukiwanie w przód jest dozwolone.

source: Return the current position into the chunk.
pt_br: Zwróć obecną pozycję w kawałku.

source: Read at most *size* bytes from the chunk (less if the read hits the end of the chunk before obtaining *size* bytes). If the *size* argument is negative or omitted, read all data until the end of the chunk. An empty bytes object is returned when the end of the chunk is encountered immediately.
pt_br: Зчитувати щонайбільше *size* байтів із блоку (менше, якщо зчитування досягає кінця фрагмента до отримання *size* байтів). Якщо аргумент *size* від’ємний або пропущений, читайте всі дані до кінця блоку. Порожній байтовий об’єкт повертається, коли відразу зустрічається кінець блоку.

source: Skip to the end of the chunk. All further calls to :meth:`read` for the chunk will return ``b''``. If you are not interested in the contents of the chunk, this method should be called so that the file points to the start of the next chunk.
pt_br: Перейти до кінця шматка. Усі подальші виклики :meth:`read` для блоку повертатимуть ``b''``. Якщо вас не цікавить вміст фрагмента, цей метод слід викликати так, щоб файл вказував на початок наступного фрагменту.

source: Footnotes
pt_br: Notas de rodapé

source: "EA IFF 85" Standard for Interchange Format Files, Jerry Morrison, Electronic Arts, January 1985.
pt_br: "EA IFF 85" Standard dla formatu plików wzajemnej wymiany, Jerry Morrison, Electronic Arts, styczeń 1985.
