Repository: python/python-docs-pt-br
Catalog: library/cmath.po
Languages: pt_br

source: :mod:`!cmath` --- Mathematical functions for complex numbers
pt_br: :mod:`!cmath` --- Funções matemáticas para números complexos

source: This module provides access to mathematical functions for complex numbers. The functions in this module accept integers, floating-point numbers or complex numbers as arguments. They will also accept any Python object that has either a :meth:`~object.__complex__` or a :meth:`~object.__float__` method: these methods are used to convert the object to a complex or floating-point number, respectively, and the function is then applied to the result of the conversion.
pt_br: Este módulo fornece acesso a funções matemáticas para números complexos. As funções neste módulo aceitam inteiros, números de ponto flutuante ou números complexos como argumentos. Eles também aceitarão qualquer objeto Python que tenha um método :meth:`~object.__complex__` ou :meth:`~object.__float__`: esses métodos são usados para converter o objeto em um número complexo ou de ponto flutuante, respectivamente, e a função é então aplicada ao resultado da conversão.

source: For functions involving branch cuts, we have the problem of deciding how to define those functions on the cut itself. Following Kahan's "Branch cuts for complex elementary functions" paper, as well as Annex G of C99 and later C standards, we use the sign of zero to distinguish one side of the branch cut from the other: for a branch cut along (a portion of) the real axis we look at the sign of the imaginary part, while for a branch cut along the imaginary axis we look at the sign of the real part.
pt_br: Para funções que envolvem cortes de ramificação, temos o problema de decidir como definir essas funções no próprio corte. Seguindo o artigo de Kahan intitulado "Branch cuts for complex elementary functions" (em tradução livre, "Cortes de ramificação para funções complexas elementares"), bem como o Anexo G do C99 e padrões C posteriores, usamos o sinal de zero para distinguir um lado do outro no corte de ramificação: para um corte de ramificação ao longo (de uma porção) do eixo real olhamos para o sinal da parte imaginária, enquanto para um corte de ramificação ao longo do eixo imaginário olhamos para o sinal da parte real.

source: For example, the :func:`cmath.sqrt` function has a branch cut along the negative real axis. An argument of ``complex(-2.0, -0.0)`` is treated as though it lies *below* the branch cut, and so gives a result on the negative imaginary axis::
pt_br: Por exemplo, a função :func:`cmath.sqrt` tem um corte de ramificação ao longo do eixo real negativo. Um argumento de ``complex(-2.0, -0.0)`` é tratado como se estivesse *abaixo* do corte de ramificação, e assim dá um resultado no eixo imaginário negativo::

source: But an argument of ``complex(-2.0, 0.0)`` is treated as though it lies above the branch cut::
pt_br: Mas um argumento de ``complex(-2.0, 0.0)`` é tratado como se estivesse acima do corte de ramificação::

source: **Conversions to and from polar coordinates**
pt_br: **Conversões de e para coordenadas polares**

source: Return the phase of *z*
pt_br: Retorna a fase de *z*

source: Return the representation of *z* in polar coordinates
pt_br: Retorna a representação de *z* em coordenadas polares

source: Return the complex number *z* with polar coordinates *r* and *phi*
pt_br: Retorna o número complexo *z* com coordenadas polares *r* e *phi*

source: **Power and logarithmic functions**
pt_br: **Funções de potência e logarítmicas**

source: Return *e* raised to the power *z*
pt_br: Retorna *e* elevado à potência *z*

source: Return the logarithm of *z* to the given *base* (*e* by default)
pt_br: Retorna o logaritmo de *z* para a *base* fornecida (*e* por padrão)

source: Return the base-10 logarithm of *z*
pt_br: Retorna o logaritmo de base 10 de *z*

source: Return the square root of *z*
pt_br: Retorna a raiz quadrada de *z*

source: **Trigonometric functions**
pt_br: **Funções trigonométricas**

source: Return the arc cosine of *z*
pt_br: Retorna o arco cosseno de *z*

source: Return the arc sine of *z*
pt_br: Retorna o arco seno de *z*

source: Return the arc tangent of *z*
pt_br: Retorna o arco tangente de *z*

source: Return the cosine of *z*
pt_br: Retorna o cosseno de *z*

source: Return the sine of *z*
pt_br: Retorna o seno de *z*

source: Return the tangent of *z*
pt_br: Retorna a tangente de *z*

source: **Hyperbolic functions**
pt_br: **Funções hiperbólicas**

source: Return the inverse hyperbolic cosine of *z*
pt_br: Retorna o cosseno hiperbólico inverso de *z*

source: Return the inverse hyperbolic sine of *z*
pt_br: Retorna o seno hiperbólico inverso de *z*

source: Return the inverse hyperbolic tangent of *z*
pt_br: Retorna a tangente hiperbólica inversa de *z*

source: Return the hyperbolic cosine of *z*
pt_br: Retorna o cosseno hiperbólico de *z*

source: Return the hyperbolic sine of *z*
pt_br: Retorna o seno hiperbólico de *z*

source: Return the hyperbolic tangent of *z*
pt_br: Retorna a tangente hiperbólica de *z*

source: **Classification functions**
pt_br: **Funções de classificação**

source: Check if all components of *z* are finite
pt_br: Verifica se todos os componentes de *z* são finitos

source: Check if any component of *z* is infinite
pt_br: Verifica se algum componente de *z* é infinito

source: Check if any component of *z* is a NaN
pt_br: Verifica se algum componente de *z* é NaN

source: Check if the values *a* and *b* are close to each other
pt_br: Verifica se os valores *a* e *b* estão próximos um do outro

source: **Constants**
pt_br: **Constantes**

source: Positive infinity
pt_br: Infinito positivo

source: Pure imaginary infinity
pt_br: Infinito imaginário puro

source: Pure imaginary NaN
pt_br: NaN imaginário puro

source: Conversions to and from polar coordinates
pt_br: Conversões de e para coordenadas polares

source: A Python complex number ``z`` is stored internally using *rectangular* or *Cartesian* coordinates. It is completely determined by its *real part* ``z.real`` and its *imaginary part* ``z.imag``.
pt_br: Um número complexo Python ``z`` é armazenado internamente usando coordenadas *retangulares* ou *cartesianas*. É completamente determinado por sua *parte real* ``z.real`` e sua *parte imaginária* ``z.imag``.

source: *Polar coordinates* give an alternative way to represent a complex number. In polar coordinates, a complex number *z* is defined by the modulus *r* and the phase angle *phi*. The modulus *r* is the distance from *z* to the origin, while the phase *phi* is the counterclockwise angle, measured in radians, from the positive x-axis to the line segment that joins the origin to *z*.
pt_br: *Coordenadas polares* fornecem uma forma alternativa de representar um número complexo. Em coordenadas polares, um número complexo *z* é definido pelo módulo *r* e pelo ângulo de fase *phi*. O módulo *r* é a distância de *z* à origem, enquanto a fase *phi* é o ângulo anti-horário, medido em radianos, do eixo x positivo ao segmento de reta que une a origem a *z*.

source: The following functions can be used to convert from the native rectangular coordinates to polar coordinates and back.
pt_br: As funções a seguir podem ser usadas para converter coordenadas retangulares nativas em coordenadas polares e vice-versa.

source: Return the phase of *z* (also known as the *argument* of *z*), as a float. ``phase(z)`` is equivalent to ``math.atan2(z.imag, z.real)``. The result lies in the range [-\ *π*, *π*], and the branch cut for this operation lies along the negative real axis. The sign of the result is the same as the sign of ``z.imag``, even when ``z.imag`` is zero::
pt_br: Retorna a fase de *z* (também conhecido como *argumento* de *z*), como um ponto flutuante. ``phase(z)`` equivale a ``math.atan2(z.imag, z.real)``. O resultado está no intervalo [-\ *π*, *π*], e o corte de ramificação para esta operação está ao longo do eixo real negativo. O sinal do resultado é igual ao sinal de ``z.imag``, mesmo quando ``z.imag`` é zero::

source: The modulus (absolute value) of a complex number *z* can be computed using the built-in :func:`abs` function. There is no separate :mod:`cmath` module function for this operation.
pt_br: O módulo (valor absoluto) de um número complexo *z* pode ser calculado usando a função embutida :func:`abs`. Não há função do módulo :mod:`cmath` separada para esta operação.

source: Return the representation of *z* in polar coordinates. Returns a pair ``(r, phi)`` where *r* is the modulus of *z* and *phi* is the phase of *z*. ``polar(z)`` is equivalent to ``(abs(z), phase(z))``.
pt_br: Retorna a representação de *z* em coordenadas polares. Retorna um par ``(r, phi)`` onde *r* é o módulo de *z* e phi é a fase de *z*. ``polar(z)`` equivale a ``(abs(z), phase(z))``.

source: Return the complex number *z* with polar coordinates *r* and *phi*. Equivalent to ``complex(r * math.cos(phi), r * math.sin(phi))``.
pt_br: Retorna o número complexo *z* com coordenadas polares *r* e *phi*. Equivale a ``complex(r * math.cos(phi), r * math.sin(phi))``.

source: Power and logarithmic functions
pt_br: Funções de potência e logarítmicas

source: Return *e* raised to the power *z*, where *e* is the base of natural logarithms.
pt_br: Retorna *e* elevado à potência *z*, onde *e* é a base de logaritmos naturais.

source: Return the logarithm of *z* to the given *base*. If the *base* is not specified, returns the natural logarithm of *z*. There is one branch cut, from 0 along the negative real axis to -∞.
pt_br: Retorna o logaritmo de *z* para a *base* fornecida. Se a *base* não for especificada, retorna o logaritmo natural de *z*. Há um corte de ramificação, de 0 ao longo do eixo real negativo até -∞.

source: Return the base-10 logarithm of *z*. This has the same branch cut as :func:`log`.
pt_br: Retorna o logaritmo de *z* na base 10. Este tem o mesmo corte de ramificação que :func:`log`.

source: Return the square root of *z*. This has the same branch cut as :func:`log`.
pt_br: Retorna a raiz quadrada de *z*. Este tem o mesmo corte de ramificação que :func:`log`.

source: Trigonometric functions
pt_br: Funções trigonométricas

source: Return the arc cosine of *z*. There are two branch cuts: One extends right from 1 along the real axis to ∞. The other extends left from -1 along the real axis to -∞.
pt_br: Retorna o arco cosseno de *z*. Existem dois cortes de ramificação: um se estende desde 1 ao longo do eixo real até ∞. O outro se estende para a esquerda de -1 ao longo do eixo real até -∞.

source: Return the arc sine of *z*. This has the same branch cuts as :func:`acos`.
pt_br: Retorna o arco seno de *z*. Tem os mesmos cortes de ramificação que :func:`acos`.

source: Return the arc tangent of *z*. There are two branch cuts: One extends from ``1j`` along the imaginary axis to ``∞j``. The other extends from ``-1j`` along the imaginary axis to ``-∞j``.
pt_br: Retorna o arco tangente de *z*. Existem dois cortes de ramificação: Um se estende de ``1j`` ao longo do eixo imaginário até ``∞j``. O outro se estende de ``-1j`` ao longo do eixo imaginário até ``-∞j``.

source: Return the cosine of *z*.
pt_br: Retorna o cosseno de *z*.

source: Return the sine of *z*.
pt_br: Retorna o seno de *z*.

source: Return the tangent of *z*.
pt_br: Retorna a tangente de *z*.

source: Hyperbolic functions
pt_br: Funções hiperbólicas

source: Return the inverse hyperbolic cosine of *z*. There is one branch cut, extending left from 1 along the real axis to -∞.
pt_br: Retorna o cosseno hiperbólico inverso de *z*. Há um corte de ramificação, estendendo-se para a esquerda de 1 ao longo do eixo real até -∞.

source: Return the inverse hyperbolic sine of *z*. There are two branch cuts: One extends from ``1j`` along the imaginary axis to ``∞j``. The other extends from ``-1j`` along the imaginary axis to ``-∞j``.
pt_br: Retorna o seno hiperbólico inverso de *z*. Existem dois cortes de ramificação: Um se estende de ``1j`` ao longo do eixo imaginário até ``∞j``. O outro se estende de ``-1j`` ao longo do eixo imaginário até ``-∞j``.

source: Return the inverse hyperbolic tangent of *z*. There are two branch cuts: One extends from ``1`` along the real axis to ``∞``. The other extends from ``-1`` along the real axis to ``-∞``.
pt_br: Retorna a tangente hiperbólica inversa de *z*. Existem dois cortes de ramificação: Um se estende de ``1`` ao longo do eixo real até ``∞``. O outro se estende de ``-1`` ao longo do eixo real até ``-∞``.

source: Return the hyperbolic cosine of *z*.
pt_br: Retorna o cosseno hiperbólico de *z*.

source: Return the hyperbolic sine of *z*.
pt_br: Retorna o seno hiperbólico de *z*.

source: Return the hyperbolic tangent of *z*.
pt_br: Retorna a tangente hiperbólica de *z*.

source: Classification functions
pt_br: Funções de classificação

source: Return ``True`` if both the real and imaginary parts of *z* are finite, and ``False`` otherwise.
pt_br: Retorna ``True`` se ambas as partes real e imaginária de *z* forem finitas, e ``False`` caso contrário.

source: Return ``True`` if either the real or the imaginary part of *z* is an infinity, and ``False`` otherwise.
pt_br: Retorna ``True`` se ou a parte real ou a imaginária de *z* for infinita, e ``False`` caso contrário.

source: Return ``True`` if either the real or the imaginary part of *z* is a NaN, and ``False`` otherwise.
pt_br: Retorna ``True`` se ou a parte real ou a imaginária de *z* for NaN, e ``False`` caso contrário.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
pt_br: Retorna ``True`` se os valores *a* e *b* estiverem próximos e ``False`` caso contrário.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances. If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
pt_br: Se dois valores são considerados próximos ou não é determinado de acordo com tolerâncias absolutas e relativas fornecidas. Se nenhum erro ocorrer, o resultado será: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be nonnegative and less than ``1.0``.
pt_br: *rel_tol* é a tolerância relativa -- é a diferença máxima permitida entre *a* e *b*, em relação ao maior valor absoluto de *a* ou *b*. Por exemplo, para definir uma tolerância de 5%, passe ``rel_tol=0.05``. A tolerância padrão é ``1e-09``, o que garante que os dois valores sejam iguais em cerca de 9 dígitos decimais. *rel_tol* deve ser não negativo e menor que ``1.0``.

source: *abs_tol* is the absolute tolerance; it defaults to ``0.0`` and it must be nonnegative. When comparing ``x`` to ``0.0``, ``isclose(x, 0)`` is computed as ``abs(x) <= rel_tol * abs(x)``, which is ``False`` for any ``x`` and rel_tol less than ``1.0``. So add an appropriate positive abs_tol argument to the call.
pt_br: *abs_tol* é a tolerância absoluta; o padrão é ``0.0`` e deve ser não negativo. Ao comparar ``x`` com ``0.0``, ``isclose(x, 0)`` é computado como ``abs(x) <= rel_tol * abs(x)``, que é ``False`` para qualquer ``x`` e rel_tol menor que ``1.0``. Então adicione um argumento abs_tol positivo apropriado à chamada.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
pt_br: Os valores especiais do IEEE 754 de ``NaN``, ``inf`` e ``-inf`` serão tratados de acordo com as regras do IEEE. Especificamente, ``NaN`` não é considerado próximo a qualquer outro valor, incluindo ``NaN``. ``inf`` e ``-inf`` são considerados apenas próximos a si mesmos.

source: :pep:`485` -- A function for testing approximate equality
pt_br: :pep:`485` -- Uma função para testar igualdade aproximada

source: Constants
pt_br: Constantes

source: The mathematical constant *π*, as a float.
pt_br: A constante matemática *π*, como um ponto flutuante.

source: The mathematical constant *e*, as a float.
pt_br: A constante matemática *e*, como um ponto flutuante.

source: The mathematical constant *τ*, as a float.
pt_br: A constante matemática *τ*, como um ponto flutuante.

source: Floating-point positive infinity. Equivalent to ``float('inf')``.
pt_br: Infinito positivo de ponto flutuante. Equivale a ``float('inf')``.

source: Complex number with zero real part and positive infinity imaginary part. Equivalent to ``complex(0.0, float('inf'))``.
pt_br: Número complexo com parte real zero e parte imaginária infinita positiva. Equivale a ``complex(0.0, float('inf'))``.

source: A floating-point "not a number" (NaN) value. Equivalent to ``float('nan')``.
pt_br: Um valor de ponto flutuante "não um número" (NaN). Equivale a ``float('nan')``.

source: Complex number with zero real part and NaN imaginary part. Equivalent to ``complex(0.0, float('nan'))``.
pt_br: Número complexo com parte real zero e parte imaginária NaN. Equivale a ``complex(0.0, float('nan'))``.

source: Note that the selection of functions is similar, but not identical, to that in module :mod:`math`. The reason for having two modules is that some users aren't interested in complex numbers, and perhaps don't even know what they are. They would rather have ``math.sqrt(-1)`` raise an exception than return a complex number. Also note that the functions defined in :mod:`cmath` always return a complex number, even if the answer can be expressed as a real number (in which case the complex number has an imaginary part of zero).
pt_br: Observe que a seleção de funções é semelhante, mas não idêntica, àquela no módulo :mod:`math`. A razão para ter dois módulos é que alguns usuários não estão interessados em números complexos e talvez nem saibam o que são. Eles preferem que ``math.sqrt(-1)`` gere uma exceção do que retorne um número complexo. Observe também que as funções definidas em :mod:`cmath` sempre retornam um número complexo, mesmo que a resposta possa ser expressa como um número real (nesse caso o número complexo tem uma parte imaginária de zero).

source: A note on branch cuts: They are curves along which the given function fails to be continuous. They are a necessary feature of many complex functions. It is assumed that if you need to compute with complex functions, you will understand about branch cuts. Consult almost any (not too elementary) book on complex variables for enlightenment. For information of the proper choice of branch cuts for numerical purposes, a good reference should be the following:
pt_br: Uma nota sobre cortes de ramificação: são curvas ao longo das quais a função dada não é contínua. Eles são um recurso necessário de muitas funções complexas. Presume-se que se você precisar calcular com funções complexas, você entenderá sobre cortes de ramificação. Consulte quase qualquer livro (não muito elementar) sobre variáveis complexas para obter esclarecimento. Para informações sobre a escolha adequada dos cortes de ramificação para fins numéricos, uma boa referência deve ser a seguinte:

source: Kahan, W: Branch cuts for complex elementary functions; or, Much ado about nothing's sign bit. In Iserles, A., and Powell, M. (eds.), The state of the art in numerical analysis. Clarendon Press (1987) pp165--211.
pt_br: Kahan, W: Branch cuts for complex elementary functions; or, Much ado about nothing's sign bit. Em Iserles, A. e Powell, M. (eds.), The state of the art in numerical analysis. Clarendon Press (1987) pp165--211.

source: module
pt_br: módulo
