Repository: python/python-docs-pt-br
Catalog: library/collections.po
Languages: pt_br

source: >>> c = Counter(a=3, b=1) >>> d = Counter(a=1, b=2) >>> c + d # add two counters together: c[x] + d[x] Counter({'a': 4, 'b': 3}) >>> c - d # subtract (keeping only positive counts) Counter({'a': 2}) >>> c & d # intersection: min(c[x], d[x]) Counter({'a': 1, 'b': 1}) >>> c | d # union: max(c[x], d[x]) Counter({'a': 3, 'b': 2}) >>> c == d # equality: c[x] == d[x] False >>> c <= d # inclusion: c[x] <= d[x] False
pt_br: >>> c = Counter(a=3, b=1) >>> d = Counter(a=1, b=2) >>> c + d # adiciona dois contadores juntos: c[x] + d[x] Counter({'a': 4, 'b': 3}) >>> c - d # subtrai (mantendo apenas contagens positivas) Counter({'a': 2}) >>> c & d # interseção: min(c[x], d[x]) Counter({'a': 1, 'b': 1}) >>> c | d # união: max(c[x], d[x]) Counter({'a': 3, 'b': 2}) >>> c == d # igualdade: c[x] == d[x] False >>> c <= d # inclusão: c[x] <= d[x] False

source: Unary addition and subtraction are shortcuts for adding an empty counter or subtracting from an empty counter.
pt_br: A adição e subtração unárias são atalhos para adicionar um contador vazio ou subtrair de um contador vazio.

source: Added support for unary plus, unary minus, and in-place multiset operations.
pt_br: Adicionado suporte para operador unário mais, unário menos e operações *in-place* em multiconjuntos.

source: Counters were primarily designed to work with positive integers to represent running counts; however, care was taken to not unnecessarily preclude use cases needing other types or negative values. To help with those use cases, this section documents the minimum range and type restrictions.
pt_br: Os contadores foram projetados principalmente para funcionar com números inteiros positivos para representar contagens contínuas; no entanto, foi tomado cuidado para não impedir desnecessariamente os casos de uso que precisassem de outros tipos ou valores negativos. Para ajudar nesses casos de uso, esta seção documenta o intervalo mínimo e as restrições de tipo.

source: The :class:`Counter` class itself is a dictionary subclass with no restrictions on its keys and values. The values are intended to be numbers representing counts, but you *could* store anything in the value field.
pt_br: A própria classe :class:`Counter` é uma subclasse de dicionário sem restrições em suas chaves e valores. Os valores pretendem ser números que representam contagens, mas você *pode* armazenar qualquer coisa no campo de valor.

source: The :meth:`~Counter.most_common` method requires only that the values be orderable.
pt_br: O método :meth:`~Counter.most_common` requer apenas que os valores sejam ordenáveis.

source: For in-place operations such as ``c[key] += 1``, the value type need only support addition and subtraction. So fractions, floats, and decimals would work and negative values are supported. The same is also true for :meth:`~Counter.update` and :meth:`~Counter.subtract` which allow negative and zero values for both inputs and outputs.
pt_br: Para operações in-place, como ``c[key] += 1``, o tipo de valor precisa oferecer suporte a apenas adição e subtração. Portanto, frações, números de ponto flutuante e decimais funcionariam e os valores negativos são suportados. O mesmo também é verdadeiro para :meth:`~Counter.update` e :meth:`~Counter.subtract` que permitem valores negativos e zero para entradas e saídas.

source: The multiset methods are designed only for use cases with positive values. The inputs may be negative or zero, but only outputs with positive values are created. There are no type restrictions, but the value type needs to support addition, subtraction, and comparison.
pt_br: Os métodos de multiconjuntos são projetados apenas para casos de uso com valores positivos. As entradas podem ser negativas ou zero, mas apenas saídas com valores positivos são criadas. Não há restrições de tipo, mas o tipo de valor precisa suportar adição, subtração e comparação.

source: The :meth:`~Counter.elements` method requires integer counts. It ignores zero and negative counts.
pt_br: O método :meth:`~Counter.elements` requer contagens de inteiros. Ele ignora contagens zero e negativas.

source: `Bag class <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ in Smalltalk.
pt_br: `Classe Bag <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ do Smalltalk.

source: Wikipedia entry for `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.
pt_br: Entrada da Wikipédia para `Multiconjuntos <https://pt.wikipedia.org/wiki/Multiconjunto>`_.

source: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ tutorial with examples.
pt_br: Tutorial com exemplos de `multiconjuntos no C++ <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_.

source: For mathematical operations on multisets and their use cases, see *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*.
pt_br: Para operações matemáticas em multiconjuntos e seus casos de uso, consulte *Knuth, Donald. The Art of Computer Programming Volume II, Seção 4.6.3, Exercício 19*.

source: To enumerate all distinct multisets of a given size over a given set of elements, see :func:`itertools.combinations_with_replacement`::
pt_br: Para enumerar todos os multiconjuntos distintos de um determinado tamanho em um determinado conjunto de elementos, consulte :func:`itertools.combinations_with_replacement`::

source: :class:`deque` objects
pt_br: Objetos :class:`deque`

source: Returns a new deque object initialized left-to-right (using :meth:`append`) with data from *iterable*. If *iterable* is not specified, the new deque is empty.
pt_br: Retorna um novo objeto deque inicializado da esquerda para a direita (usando :meth:`append`) com dados do iterável *iterable*. Se *iterable* não for especificado, o novo deque estará vazio.

source: Deques are a generalization of stacks and queues (the name is pronounced "deck" and is short for "double-ended queue"). Deques support thread-safe, memory efficient appends and pops from either side of the deque with approximately the same *O*\ (1) performance in either direction.
pt_br: Deques são uma generalização de pilhas e filas (o nome é pronunciado "deck" e é abreviação de "double-ended queue", e conhecida como "fila duplamente terminada" em português). O Deques oferece suporte para acréscimos e retiradas seguros para thread e eficientes em uso memória de ambos os lados do deque com aproximadamente o mesmo desempenho *O*\ (1) em qualquer direção.

source: Though :class:`list` objects support similar operations, they are optimized for fast fixed-length operations and incur *O*\ (*n*) memory movement costs for ``pop(0)`` and ``insert(0, v)`` operations which change both the size and position of the underlying data representation.
pt_br: Embora os objetos :class:`list` ofereçam suporte a operações semelhantes, eles são otimizados para operações rápidas de comprimento fixo e sujeitam em custos de movimentação de memória *O*\ (*n*) para as operações ``pop(0)`` e ``insert(0, v)`` que alteram o tamanho e a posição da representação de dados subjacente.

source: If *maxlen* is not specified or is ``None``, deques may grow to an arbitrary length. Otherwise, the deque is bounded to the specified maximum length. Once a bounded length deque is full, when new items are added, a corresponding number of items are discarded from the opposite end. Bounded length deques provide functionality similar to the ``tail`` filter in Unix. They are also useful for tracking transactions and other pools of data where only the most recent activity is of interest.
pt_br: Se *maxlen* não for especificado ou for ``None``, deques podem crescer para um comprimento arbitrário. Caso contrário, o deque é limitado ao comprimento máximo especificado. Quando um deque de comprimento limitado está cheio, quando novos itens são adicionados, um número correspondente de itens é descartado da extremidade oposta. Deques de comprimento limitado fornecem funcionalidade semelhante ao filtro ``tail`` no Unix. Eles também são úteis para rastrear transações e outras pools de dados onde apenas a atividade mais recente é de interesse.

source: Deque objects support the following methods:
pt_br: Os objetos Deque oferecem suporte aos seguintes métodos:

source: Add *x* to the right side of the deque.
pt_br: Adiciona *x* ao lado direito do deque.

source: Add *x* to the left side of the deque.
pt_br: Adiciona *x* ao lado esquerdo do deque

source: Remove all elements from the deque leaving it with length 0.
pt_br: Remove todos os elementos do deque deixando-o com comprimento 0.

source: Create a shallow copy of the deque.
pt_br: Cria uma cópia rasa do deque.

source: Count the number of deque elements equal to *x*.
pt_br: Conta o número de elementos deque igual a *x*.

source: Extend the right side of the deque by appending elements from the iterable argument.
pt_br: Estende o lado direito do deque anexando elementos do argumento iterável.

source: Extend the left side of the deque by appending elements from *iterable*. Note, the series of left appends results in reversing the order of elements in the iterable argument.
pt_br: Estende o lado esquerdo do deque anexando elementos de *iterable*. Observe que a série de acréscimos à esquerda resulta na reversão da ordem dos elementos no argumento iterável.

source: Return the position of *x* in the deque (at or after index *start* and before index *stop*). Returns the first match or raises :exc:`ValueError` if not found.
pt_br: Retorna a posição de *x* no deque (no ou após o índice *start* e antes do índice *stop*). Retorna a primeira correspondência ou levanta :exc:`ValueError` se não for encontrado.

source: Insert *x* into the deque at position *i*.
pt_br: Insere *x* no deque na posição *i*.

source: If the insertion would cause a bounded deque to grow beyond *maxlen*, an :exc:`IndexError` is raised.
pt_br: Se a inserção fizer com que um deque limitado cresça além de *maxlen*, uma :exc:`IndexError` é levantada.

source: Remove and return an element from the right side of the deque. If no elements are present, raises an :exc:`IndexError`.
pt_br: Remove e devolve um elemento do lado direito do deque. Se nenhum elemento estiver presente, levanta um :exc:`IndexError`.

source: Remove and return an element from the left side of the deque. If no elements are present, raises an :exc:`IndexError`.
pt_br: Remove e devolve um elemento do lado esquerdo do deque. Se nenhum elemento estiver presente, levanta um :exc:`IndexError`.

source: Remove the first occurrence of *value*. If not found, raises a :exc:`ValueError`.
pt_br: Remove a primeira ocorrência de *value*. Se não for encontrado, levanta um :exc:`ValueError`.

source: Reverse the elements of the deque in-place and then return ``None``.
pt_br: Inverte os elementos do deque no local e, em seguida, retorna ``None``.

source: Rotate the deque *n* steps to the right. If *n* is negative, rotate to the left.
pt_br: Gira o deque *n* passos para a direita. Se *n* for negativo, gire para a esquerda.

source: When the deque is not empty, rotating one step to the right is equivalent to ``d.appendleft(d.pop())``, and rotating one step to the left is equivalent to ``d.append(d.popleft())``.
pt_br: Quando o deque não está vazio, girar um passo para a direita é equivalente a ``d.appendleft(d.pop())`` e girar um passo para a esquerda é equivalente a ``d.append(d.popleft())``.

source: Deque objects also provide one read-only attribute:
pt_br: Os objetos Deque também fornecem um atributo somente leitura:

source: Maximum size of a deque or ``None`` if unbounded.
pt_br: Tamanho máximo de um deque ou ``None`` se ilimitado.

source: In addition to the above, deques support iteration, pickling, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, membership testing with the :keyword:`in` operator, and subscript references such as ``d[0]`` to access the first element. Indexed access is *O*\ (1) at both ends but slows to *O*\ (*n*) in the middle. For fast random access, use lists instead.
pt_br: Além do acima, deques oferece suporte a iteração, serialização com pickle, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)`` e teste de associação com o operador :keyword:`in` e referências subscritas, como ``d[0]`` para acessar o primeiro elemento. O acesso indexado é *O*\ (1) em ambas as extremidades, mas diminui para *O*\ (*n*) no meio. Para acesso aleatório rápido, use listas.

source: Starting in version 3.5, deques support ``__add__()``, ``__mul__()``, and ``__imul__()``.
pt_br: A partir da versão 3.5, deques oferecem suporte a ``__add__()``,``__mul__()`` e ``__imul__()``.

source: Example:
pt_br: Exemplo:

source: >>> from collections import deque >>> d = deque('ghi') # make a new deque with three items >>> for elem in d: # iterate over the deque's elements ... print(elem.upper()) G H I >>> d.append('j') # add a new entry to the right side >>> d.appendleft('f') # add a new entry to the left side >>> d # show the representation of the deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # return and remove the rightmost item 'j' >>> d.popleft() # return and remove the leftmost item 'f' >>> list(d) # list the contents of the deque ['g', 'h', 'i'] >>> d[0] # peek at leftmost item 'g' >>> d[-1] # peek at rightmost item 'i' >>> list(reversed(d)) # list the contents of a deque in reverse ['i', 'h', 'g'] >>> 'h' in d # search the deque True >>> d.extend('jkl') # add multiple elements at once >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> d.rotate(1) # right rotation >>> d deque(['l', 'g', 'h', 'i', 'j', 'k']) >>> d.rotate(-1) # left rotation >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> deque(reversed(d)) # make a new deque in reverse order deque(['l', 'k', 'j', 'i', 'h', 'g']) >>> d.clear() # empty the deque >>> d.pop() # cannot pop from an empty deque Traceback (most recent call last): File "<pyshell#6>", line 1, in -toplevel- d.pop() IndexError: pop from an empty deque >>> d.extendleft('abc') # extendleft() reverses the input order >>> d deque(['c', 'b', 'a'])
pt_br: >>> from collections import deque >>> d = deque('ghi') # torna um novo deque com três itens >>> for elem in d: # itera os elementos do deque ... print(elem.upper()) G H I >>> d.append('j') # adiciona uma nova entrada ao lado direito >>> d.appendleft('f') # adiciona uma nova entrada ao lado esquerdo >>> d # mostra a representação do deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # retorna e remove o item mais à direita 'j' >>> d.popleft() # retorna e remove o item mais à esquerda 'f' >>> list(d) # lista o conteúdo do deque ['g', 'h', 'i'] >>> d[0] # exibe o item mais à esquerda 'g' >>> d[-1] # exibe o item mais à direita 'i' >>> list(reversed(d)) # lista o conteúdo de um deque ao inverso ['i', 'h', 'g'] >>> 'h' in d # pesquisa no deque True >>> d.extend('jkl') # adiciona vários elementos de uma só vez >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> d.rotate(1) # rotação para direita >>> d deque(['l', 'g', 'h', 'i', 'j', 'k']) >>> d.rotate(-1) # rotação para esquerda >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> deque(reversed(d)) # cria um novo deque na ordem inversa deque(['l', 'k', 'j', 'i', 'h', 'g']) >>> d.clear() # esvazia o deque >>> d.pop() # não é possível retirar um item de um deque vazio Traceback (most recent call last): File "<pyshell#6>", line 1, in -toplevel- d.pop() IndexError: pop from an empty deque >>> d.extendleft('abc') # extendleft() inverte a ordem da entrada >>> d deque(['c', 'b', 'a'])

source: :class:`deque` Recipes
pt_br: Receitas de :class:`deque`

source: This section shows various approaches to working with deques.
pt_br: Esta seção mostra várias abordagens para trabalhar com deques.

source: Bounded length deques provide functionality similar to the ``tail`` filter in Unix::
pt_br: Deques de comprimento limitado fornecem funcionalidade semelhante ao filtro ``tail`` em Unix::

source: Another approach to using deques is to maintain a sequence of recently added elements by appending to the right and popping to the left::
pt_br: Outra abordagem para usar deques é manter uma sequência de elementos adicionados recentemente, acrescentando à direita e clicando à esquerda::

source: A `round-robin scheduler <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ can be implemented with input iterators stored in a :class:`deque`. Values are yielded from the active iterator in position zero. If that iterator is exhausted, it can be removed with :meth:`~deque.popleft`; otherwise, it can be cycled back to the end with the :meth:`~deque.rotate` method::
pt_br: Um `escalonador round robin <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ pode ser implementado com iteradores de entrada armazenados em um :class:`deque`. Os valores são produzidos a partir do iterador ativo na posição zero. Se esse iterador estiver esgotado, ele pode ser removido com :meth:`~deque.popleft`; caso contrário, ele pode voltar ao fim com o método :meth:`~deque.rotate`::

source: def roundrobin(*iterables): "roundrobin('ABC', 'D', 'EF') --> A D E B F C" iterators = deque(map(iter, iterables)) while iterators: try: while True: yield next(iterators[0]) iterators.rotate(-1) except StopIteration: # Remove an exhausted iterator. iterators.popleft()
pt_br: def roundrobin(*iterables): "roundrobin('ABC', 'D', 'EF') --> A D E B F C" iterators = deque(map(iter, iterables)) while iterators: try: while True: yield next(iterators[0]) iterators.rotate(-1) except StopIteration: # Remove um iterador esgotado. iterators.popleft()

source: The :meth:`~deque.rotate` method provides a way to implement :class:`deque` slicing and deletion. For example, a pure Python implementation of ``del d[n]`` relies on the ``rotate()`` method to position elements to be popped::
pt_br: O método :meth:`~deque.rotate` fornece uma maneira de implementar o fatiamento e exclusão :class:`deque`. Por exemplo, uma implementação Python pura de ``del d[n]`` depende do método ``rotate()`` para posicionar os elementos a serem retirados::

source: To implement :class:`deque` slicing, use a similar approach applying :meth:`~deque.rotate` to bring a target element to the left side of the deque. Remove old entries with :meth:`~deque.popleft`, add new entries with :meth:`~deque.extend`, and then reverse the rotation. With minor variations on that approach, it is easy to implement Forth style stack manipulations such as ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot``, and ``roll``.
pt_br: Para implementar o fatiamento de :class:`deque`, use uma abordagem semelhante aplicando :meth:`~deque.rotate` para trazer um elemento alvo para o lado esquerdo do deque. Remova as entradas antigas com :meth:`~deque.popleft`, adicione novas entradas com :meth:`~deque.extend`, e, então, inverta a rotação. Com pequenas variações dessa abordagem, é fácil implementar manipulações de pilha de estilo Forth, como ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot`` e ``roll``.

source: :class:`defaultdict` objects
pt_br: Objetos :class:`defaultdict`

source: Return a new dictionary-like object. :class:`defaultdict` is a subclass of the built-in :class:`dict` class. It overrides one method and adds one writable instance variable. The remaining functionality is the same as for the :class:`dict` class and is not documented here.
pt_br: Retorna um novo objeto dicionário ou similar. :class:`defaultdict` é uma subclasse da classe embutida :class:`dict`. Ele substitui um método e adiciona uma variável de instância gravável. A funcionalidade restante é a mesma da classe :class:`dict` e não está documentada aqui.

source: The first argument provides the initial value for the :attr:`default_factory` attribute; it defaults to ``None``. All remaining arguments are treated the same as if they were passed to the :class:`dict` constructor, including keyword arguments.
pt_br: O primeiro argumento fornece o valor inicial para o atributo :attr:`default_factory`; o padrão é ``None``. Todos os argumentos restantes são tratados da mesma forma como se fossem passados para o construtor :class:`dict`, incluindo argumentos nomeados.

source: :class:`defaultdict` objects support the following method in addition to the standard :class:`dict` operations:
pt_br: Os objetos :class:`defaultdict` oferecem suporta ao seguinte método além das operações padrão :class:`dict`:

source: If the :attr:`default_factory` attribute is ``None``, this raises a :exc:`KeyError` exception with the *key* as argument.
pt_br: Se o atributo :attr:`default_factory` for ``None``, isso levanta uma exceção :exc:`KeyError` com *key* como argumento.

source: If :attr:`default_factory` is not ``None``, it is called without arguments to provide a default value for the given *key*, this value is inserted in the dictionary for the *key*, and returned.
pt_br: Se :attr:`default_factory` não for ``None``, ele é chamado sem argumentos para fornecer um valor padrão para a chave *key* fornecida, este valor é inserido no dicionário para *key* e retornado.

source: If calling :attr:`default_factory` raises an exception this exception is propagated unchanged.
pt_br: Se chamar :attr:`default_factory` levanta uma exceção, esta exceção é propagada inalterada.

source: This method is called by the :meth:`~object.__getitem__` method of the :class:`dict` class when the requested key is not found; whatever it returns or raises is then returned or raised by :meth:`~object.__getitem__`.
pt_br: Este método é chamado pelo método :meth:`~object.__getitem__` da classe :class:`dict` quando a chave solicitada não é encontrada; tudo o que ele retorna ou levanta é então retornado ou levantado por :meth:`~object.__getitem__`.

source: Note that :meth:`__missing__` is *not* called for any operations besides :meth:`~object.__getitem__`. This means that :meth:`~dict.get` will, like normal dictionaries, return ``None`` as a default rather than using :attr:`default_factory`.
pt_br: Observe que :meth:`__missing__` *não* é chamado para nenhuma operação além de :meth:`~object.__getitem__`. Isso significa que :meth:`~dict.get` irá, como dicionários normais, retornar ``None`` como padrão ao invés de usar :attr:`default_factory`.

source: :class:`defaultdict` objects support the following instance variable:
pt_br: Objetos :class:`defaultdict` permitem a seguinte variável de instância:

source: This attribute is used by the :meth:`~defaultdict.__missing__` method; it is initialized from the first argument to the constructor, if present, or to ``None``, if absent.
pt_br: Este atributo é usado pelo método :meth:`~defaultdict.__missing__`; ele é inicializado a partir do primeiro argumento para o construtor, se presente, ou para ``None``, se ausente.

source: Added merge (``|``) and update (``|=``) operators, specified in :pep:`584`.
pt_br: Adicionado operadores de mesclagem (``|``) e de atualização (``|=``), especificados na :pep:`584`.

source: :class:`defaultdict` Examples
pt_br: Exemplos de :class:`defaultdict`

source: Using :class:`list` as the :attr:`~defaultdict.default_factory`, it is easy to group a sequence of key-value pairs into a dictionary of lists:
pt_br: Usando :class:`list` como :attr:`~defaultdict.default_factory`, se for fácil agrupar a sequencia dos pares chave-valores num dicionário de listas
