Repository: python/python-docs-pt-br
Catalog: library/collections.po
Languages: pt_br

source: The class, :class:`UserDict` acts as a wrapper around dictionary objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`dict`; however, this class can be easier to work with because the underlying dictionary is accessible as an attribute.
pt_br: A classe :class:`UserDict` atua como um invólucro em torno de objetos dicionário. A necessidade desta classe foi parcialmente suplantada pela capacidade de criar subclasses diretamente de :class:`dict`; entretanto, essa classe pode ser mais fácil de trabalhar porque o dicionário subjacente é acessível como um atributo.

source: Class that simulates a dictionary. The instance's contents are kept in a regular dictionary, which is accessible via the :attr:`data` attribute of :class:`UserDict` instances. If *initialdata* is provided, :attr:`data` is initialized with its contents; note that a reference to *initialdata* will not be kept, allowing it to be used for other purposes.
pt_br: Classe que simula um dicionário. O conteúdo da instância é mantido em um dicionário regular, que é acessível através do atributo :attr:`data` das instâncias :class:`UserDict`. Se *initialdata* for fornecido, :attr:`data` é inicializado com seu conteúdo; observe que a referência a *initialdata* não será mantida, permitindo sua utilização para outros fins.

source: In addition to supporting the methods and operations of mappings, :class:`UserDict` instances provide the following attribute:
pt_br: Além de prover suporte aos métodos e operações de mapeamentos, as instâncias :class:`UserDict` fornecem o seguinte atributo:

source: A real dictionary used to store the contents of the :class:`UserDict` class.
pt_br: Um dicionário real usado para armazenar o conteúdo da classe :class:`UserDict`.

source: :class:`UserList` objects
pt_br: Objetos :class:`UserList`

source: This class acts as a wrapper around list objects. It is a useful base class for your own list-like classes which can inherit from them and override existing methods or add new ones. In this way, one can add new behaviors to lists.
pt_br: Esta classe atua como um invólucro em torno de objetos de lista. É uma classe base útil para suas próprias classes semelhantes a listas, que podem herdar delas e substituir métodos existentes ou adicionar novos. Desta forma, é possível adicionar novos comportamentos às listas.

source: The need for this class has been partially supplanted by the ability to subclass directly from :class:`list`; however, this class can be easier to work with because the underlying list is accessible as an attribute.
pt_br: A necessidade desta classe foi parcialmente suplantada pela capacidade de criar subclasses diretamente de :class:`list`; no entanto, pode ser mais fácil trabalhar com essa classe porque a lista subjacente pode ser acessada como um atributo.

source: Class that simulates a list. The instance's contents are kept in a regular list, which is accessible via the :attr:`data` attribute of :class:`UserList` instances. The instance's contents are initially set to a copy of *list*, defaulting to the empty list ``[]``. *list* can be any iterable, for example a real Python list or a :class:`UserList` object.
pt_br: Classe que simula uma lista. O conteúdo da instância é mantido em uma lista regular, que é acessível através do atributo :attr:`data` das instâncias :class:`UserList`. O conteúdo da instância é inicialmente definido como uma cópia de *list*, padronizando a lista vazia ``[]``. *list* pode ser qualquer iterável, por exemplo, uma lista Python real ou um objeto :class:`UserList`.

source: In addition to supporting the methods and operations of mutable sequences, :class:`UserList` instances provide the following attribute:
pt_br: Além de prover suporte aos métodos e operações de sequências mutáveis, as instâncias :class:`UserList` fornecem o seguinte atributo:

source: A real :class:`list` object used to store the contents of the :class:`UserList` class.
pt_br: Um objeto :class:`list` real usado para armazenar o conteúdo da classe :class:`UserList`.

source: **Subclassing requirements:** Subclasses of :class:`UserList` are expected to offer a constructor which can be called with either no arguments or one argument. List operations which return a new sequence attempt to create an instance of the actual implementation class. To do so, it assumes that the constructor can be called with a single parameter, which is a sequence object used as a data source.
pt_br: **Requisitos para criar subclasse:** Espera-se que as subclasses de :class:`UserList` ofereçam um construtor que pode ser chamado sem argumentos ou com um argumento. Listar operações que retornam uma nova sequência tenta criar uma instância da classe de implementação real. Para isso, presume que o construtor pode ser chamado com um único parâmetro, que é um objeto de sequência usado como fonte de dados.

source: If a derived class does not wish to comply with this requirement, all of the special methods supported by this class will need to be overridden; please consult the sources for information about the methods which need to be provided in that case.
pt_br: Se uma classe derivada não desejar atender a este requisito, todos os métodos especiais suportados por esta classe precisarão ser substituídos; consulte as fontes para obter informações sobre os métodos que precisam ser fornecidos nesse caso.

source: :class:`UserString` objects
pt_br: Objetos :class:`UserString`

source: The class, :class:`UserString` acts as a wrapper around string objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`str`; however, this class can be easier to work with because the underlying string is accessible as an attribute.
pt_br: A classe :class:`UserString` atua como um invólucro em torno de objetos string. A necessidade desta classe foi parcialmente suplantada pela capacidade de criar subclasses diretamente de :class:`str`; entretanto, essa classe pode ser mais fácil de trabalhar porque a string subjacente é acessível como um atributo.

source: Class that simulates a string object. The instance's content is kept in a regular string object, which is accessible via the :attr:`data` attribute of :class:`UserString` instances. The instance's contents are initially set to a copy of *seq*. The *seq* argument can be any object which can be converted into a string using the built-in :func:`str` function.
pt_br: Classe que simula um objeto string. O conteúdo da instância é mantido em um objeto string regular, que é acessível através do atributo :attr:`data` das instâncias :class:`UserString`. O conteúdo da instância é inicialmente definido como uma cópia de *seq*. O argumento *seq* pode ser qualquer objeto que possa ser convertido em uma string usando a função embutida :func:`str`.

source: In addition to supporting the methods and operations of strings, :class:`UserString` instances provide the following attribute:
pt_br: Além de prover suporte aos métodos e operações de strings, as instâncias :class:`UserString` fornecem o seguinte atributo:

source: A real :class:`str` object used to store the contents of the :class:`UserString` class.
pt_br: Um objeto :class:`str` real usado para armazenar o conteúdo da classe :class:`UserString`.

source: New methods ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable``, and ``maketrans``.
pt_br: Novos métodos ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable`` e ``maketrans``.
