Repository: python/python-docs-pt-br
Catalog: library/collections.po
Languages: pt_br

source: :mod:`!collections` --- Container datatypes
pt_br: :mod:`!collections` --- Tipos de dados de contêineres

source: **Source code:** :source:`Lib/collections/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/collections/__init__.py`

source: This module implements specialized container datatypes providing alternatives to Python's general purpose built-in containers, :class:`dict`, :class:`list`, :class:`set`, and :class:`tuple`.
pt_br: Este módulo implementa tipos de dados de contêineres especializados que fornecem alternativas aos contêineres embutidos do Python, :class:`dict`, :class:`list`, :class:`set` e :class:`tuple`.

source: factory function for creating tuple subclasses with named fields
pt_br: função fábrica (*factory function*) para criar subclasses de tuplas com campos nomeados

source: list-like container with fast appends and pops on either end
pt_br: contêiner lista ou similar com acréscimos e retiradas rápidas nas duas extremidades

source: dict-like class for creating a single view of multiple mappings
pt_br: classe dict ou similar para criar uma visão única de vários mapeamentos

source: dict subclass for counting :term:`hashable` objects
pt_br: subclasse de dict para contar objetos :term:`hasheáveis <hasheável>`

source: dict subclass that remembers the order entries were added
pt_br: subclasse de dict que lembra a ordem que as entradas foram adicionadas

source: dict subclass that calls a factory function to supply missing values
pt_br: subclasse de dict que chama uma função fábrica para fornecer valores não encontrados

source: wrapper around dictionary objects for easier dict subclassing
pt_br: invólucro em torno de objetos dicionário para facilitar fazer subclasse de dict

source: wrapper around list objects for easier list subclassing
pt_br: invólucro em torno de objetos lista para facilitar criação de subclasse de lista

source: wrapper around string objects for easier string subclassing
pt_br: invólucro em torno de objetos string para uma facilitar criação de subclasse de string

source: :class:`ChainMap` objects
pt_br: Objetos :class:`ChainMap`

source: A :class:`ChainMap` class is provided for quickly linking a number of mappings so they can be treated as a single unit. It is often much faster than creating a new dictionary and running multiple :meth:`~dict.update` calls.
pt_br: Uma classe :class:`ChainMap` é fornecida para ligar rapidamente uma série de mapeamentos de forma que possam ser tratados como um só. O que é frequentemente mais rápido do que criar um novo dicionário e executar múltiplas chamadas de :meth:`~dict.update`.

source: The class can be used to simulate nested scopes and is useful in templating.
pt_br: A classe pode ser usada para simular escopos aninhados e é útil em modelos.

source: A :class:`ChainMap` groups multiple dicts or other mappings together to create a single, updateable view. If no *maps* are specified, a single empty dictionary is provided so that a new chain always has at least one mapping.
pt_br: :class:`ChainMap` agrupa múltiplos dicts ou outros mapeamentos para criar uma única vista atualizável. Se nenhum *maps* for especificado, um dicionário vazio será fornecido para que uma nova cadeia tenha sempre pelo menos um mapeamento.

source: The underlying mappings are stored in a list. That list is public and can be accessed or updated using the *maps* attribute. There is no other state.
pt_br: Os mapeamentos subjacentes são armazenados em uma lista. Essa lista é pública e pode ser acessada ou atualizada usando o atributo *maps*. Não existe outro estado.

source: Lookups search the underlying mappings successively until a key is found. In contrast, writes, updates, and deletions only operate on the first mapping.
pt_br: Faz uma busca nos mapeamentos subjacentes sucessivamente até que uma chave seja encontrada. Em contraste, escrita, atualizações e remoções operam apenas no primeiro mapeamento.

source: A :class:`ChainMap` incorporates the underlying mappings by reference. So, if one of the underlying mappings gets updated, those changes will be reflected in :class:`ChainMap`.
pt_br: Uma :class:`ChainMap` incorpora os mapeamentos subjacentes por referência. Então, se um dos mapeamentos subjacentes for atualizado, essas alterações serão refletidas na :class:`ChainMap`.

source: All of the usual dictionary methods are supported. In addition, there is a *maps* attribute, a method for creating new subcontexts, and a property for accessing all but the first mapping:
pt_br: Todos os métodos usuais do dicionário são suportados. Além disso, existe um atributo *maps*, um método para criar novos subcontextos e uma propriedade para acessar todos, exceto o primeiro mapeamento:

source: A user updateable list of mappings. The list is ordered from first-searched to last-searched. It is the only stored state and can be modified to change which mappings are searched. The list should always contain at least one mapping.
pt_br: Uma lista de mapeamentos atualizáveis pelo usuário. A lista é ordenada desde o primeiro pesquisado até a última pesquisado. É o único estado armazenado e pode ser modificado para alterar quais mapeamentos são pesquisados. A lista deve sempre conter pelo menos um mapeamento.

source: Returns a new :class:`ChainMap` containing a new map followed by all of the maps in the current instance. If ``m`` is specified, it becomes the new map at the front of the list of mappings; if not specified, an empty dict is used, so that a call to ``d.new_child()`` is equivalent to: ``ChainMap({}, *d.maps)``. If any keyword arguments are specified, they update passed map or new empty dict. This method is used for creating subcontexts that can be updated without altering values in any of the parent mappings.
pt_br: Retorna uma nova :class:`ChainMap` contendo um novo mapa seguido de todos os mapas na instância atual. Se ``m`` for especificado, torna-se o novo mapa na frente da lista de mapeamentos; Se não especificado, é usado um dicionário vazio, de modo que chamar ``d.new_child()`` é equivalente a: ``ChainMap({}, *d.maps)``. Se algum argumento nomeado for especificado, ele atualizará o mapa passado ou o novo dicionário vazio. Esse método é usado para criar subcontextos que podem ser atualizados sem alterar valores em nenhum dos mapeamentos pai.

source: The optional ``m`` parameter was added.
pt_br: O parâmetro opcional ``m`` foi adicionado.

source: Keyword arguments support was added.
pt_br: Suporte a argumentos nomeados foi adicionado.

source: Property returning a new :class:`ChainMap` containing all of the maps in the current instance except the first one. This is useful for skipping the first map in the search. Use cases are similar to those for the :keyword:`nonlocal` keyword used in :term:`nested scopes <nested scope>`. The use cases also parallel those for the built-in :func:`super` function. A reference to ``d.parents`` is equivalent to: ``ChainMap(*d.maps[1:])``.
pt_br: Propriedade que retorna um novo :class:`ChainMap` contendo todos os mapas da instância atual, exceto o primeiro. Isso é útil para pular o primeiro mapa da pesquisa. Os casos de uso são semelhantes aos do argumento nomeado :keyword:`nonlocal` usada em :term:`escopos aninhados <nested scope>`. Os casos de uso também são paralelos aos da função embutida :func:`super`. Uma referência a ``d.parents`` é equivalente a: ``ChainMap(*d.maps[1:])``.

source: Note, the iteration order of a :class:`ChainMap` is determined by scanning the mappings last to first::
pt_br: Observe, a ordem de iteração de um :class:`ChainMap` é determinada pela varredura dos mapeamentos do último ao primeiro::

source: This gives the same ordering as a series of :meth:`dict.update` calls starting with the last mapping::
pt_br: Isso dá a mesma ordem de uma série de chamadas de :meth:`dict.update` começando com o último mapeamento::

source: Added support for ``|`` and ``|=`` operators, specified in :pep:`584`.
pt_br: Adicionado suporte para os operadores ``|`` e ``|=``, especificados na :pep:`584`.

source: The `MultiContext class <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ in the Enthought `CodeTools package <https://github.com/enthought/codetools>`_ has options to support writing to any mapping in the chain.
pt_br: A `classe MultiContext <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ no `pacote CodeTools <https://github.com/enthought/codetools>`_ de Enthought tem opções para oferecer suporte à escrita em qualquer mapeamento na cadeia.

source: Django's `Context class <https://github.com/django/django/blob/main/django/template/context.py>`_ for templating is a read-only chain of mappings. It also features pushing and popping of contexts similar to the :meth:`~collections.ChainMap.new_child` method and the :attr:`~collections.ChainMap.parents` property.
pt_br: A `classe Context <https://github.com/django/django/blob/main/django/template/context.py>`_ do Django para modelos é uma cadeia de mapeamentos somente leitura. Ela também oferece o recurso de push e pop (inserir e retirar) contextos semelhantes ao método :meth:`~Collections.ChainMap.new_child` e a propriedade :attr:`~Collections.ChainMap.parents`.

source: The `Nested Contexts recipe <https://code.activestate.com/recipes/577434-nested-contexts-a-chain-of-mapping-objects/>`_ has options to control whether writes and other mutations apply only to the first mapping or to any mapping in the chain.
pt_br: A `receita de Contextos Aninhados <https://code.activestate.com/recipes/577434-nested-contexts-a-chain-of-mapping-objects/>`_ possui opções para controlar se escritas e outras mutações se aplicam a apenas o primeiro mapeamento ou para qualquer mapeamento na cadeia.

source: A `greatly simplified read-only version of Chainmap <https://code.activestate.com/recipes/305268/>`_.
pt_br: Uma `versão muito simplificada somente leitura do Chainmap <https://code.activestate.com/recipes/305268/>`_.

source: :class:`ChainMap` Examples and Recipes
pt_br: Exemplos e Receitas de :class:`ChainMap`

source: This section shows various approaches to working with chained maps.
pt_br: Esta seção mostra várias abordagens para trabalhar com mapas encadeados.

source: Example of simulating Python's internal lookup chain::
pt_br: Exemplo de simulação da cadeia de busca interna do Python::

source: Example of letting user specified command-line arguments take precedence over environment variables which in turn take precedence over default values::
pt_br: Exemplo de como permitir que os argumentos de linha de comando especificados pelo usuário tenham precedência sobre as variáveis de ambiente que, por sua vez, têm precedência sobre os valores padrão::

source: Example patterns for using the :class:`ChainMap` class to simulate nested contexts::
pt_br: Padrões de exemplo para utilização da classe :class:`ChainMap` para simular contextos aninhados::

source: c = ChainMap() # Create root context d = c.new_child() # Create nested child context e = c.new_child() # Child of c, independent from d e.maps[0] # Current context dictionary -- like Python's locals() e.maps[-1] # Root context -- like Python's globals() e.parents # Enclosing context chain -- like Python's nonlocals d['x'] = 1 # Set value in current context d['x'] # Get first key in the chain of contexts del d['x'] # Delete from current context list(d) # All nested values k in d # Check all nested values len(d) # Number of nested values d.items() # All nested items dict(d) # Flatten into a regular dictionary
pt_br: c = ChainMap() # Cria o contexto raiz d = c.new_child() # Cria um contexto filho aninhado e = c.new_child() # Filho de c, independente de d e.maps[0] # Dicionário do contexto atual -- como locals() do Python e.maps[-1] # Contexto raiz -- como globals() do Python e.parents # Envolvendo cadeia de contexto -- como os nonlocals do Python d['x'] = 1 # Define valor no contexto atual d['x'] # Obtém a primeira chave na cadeia de contextos del d['x'] # Exclui do contexto atual list(d) # Todos os valores aninhados k in d # Verifica todos os valores aninhados len(d) # Número de valores aninhados d.items() # Todos os itens aninhados dict(d) # Achata em um dicionário comum

source: The :class:`ChainMap` class only makes updates (writes and deletions) to the first mapping in the chain while lookups will search the full chain. However, if deep writes and deletions are desired, it is easy to make a subclass that updates keys found deeper in the chain::
pt_br: A classe :class:`ChainMap` só faz atualizações (escritas e remoções) no primeiro mapeamento na cadeia, enquanto as pesquisas irão buscar em toda a cadeia. Contudo, se há o desejo de escritas e remoções profundas, é fácil fazer uma subclasse que atualiza chaves encontradas mais a fundo na cadeia::

source: class DeepChainMap(ChainMap): 'Variant of ChainMap that allows direct updates to inner scopes' def __setitem__(self, key, value): for mapping in self.maps: if key in mapping: mapping[key] = value return self.maps[0][key] = value def __delitem__(self, key): for mapping in self.maps: if key in mapping: del mapping[key] return raise KeyError(key) >>> d = DeepChainMap({'zebra': 'black'}, {'elephant': 'blue'}, {'lion': 'yellow'}) >>> d['lion'] = 'orange' # update an existing key two levels down >>> d['snake'] = 'red' # new keys get added to the topmost dict >>> del d['elephant'] # remove an existing key one level down >>> d # display result DeepChainMap({'zebra': 'black', 'snake': 'red'}, {}, {'lion': 'orange'})
pt_br: class DeepChainMap(ChainMap): 'Variant of ChainMap that allows direct updates to inner scopes' def __setitem__(self, key, value): for mapping in self.maps: if key in mapping: mapping[key] = value return self.maps[0][key] = value def __delitem__(self, key): for mapping in self.maps: if key in mapping: del mapping[key] return raise KeyError(key) >>> d = DeepChainMap({'zebra': 'black'}, {'elephant': 'blue'}, {'lion': 'yellow'}) >>> d['lion'] = 'orange' # atualiza uma chave existente dois níveis abaixo >>> d['snake'] = 'red' # novas chaves são adicionadas ao dict mais acima >>> del d['elephant'] # remove uma chave existente um nível abaixo >>> d # exibe o resultado DeepChainMap({'zebra': 'black', 'snake': 'red'}, {}, {'lion': 'orange'})

source: :class:`Counter` objects
pt_br: Objetos :class:`Counter`

source: A counter tool is provided to support convenient and rapid tallies. For example::
pt_br: Uma ferramenta de contagem é fornecida para apoiar contas rápidas e convenientes. Por exemplo::

source: >>> # Tally occurrences of words in a list >>> cnt = Counter() >>> for word in ['red', 'blue', 'red', 'green', 'blue', 'blue']: ... cnt[word] += 1 ... >>> cnt Counter({'blue': 3, 'red': 2, 'green': 1}) >>> # Find the ten most common words in Hamlet >>> import re >>> words = re.findall(r'\w+', open('hamlet.txt').read().lower()) >>> Counter(words).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('you', 554), ('a', 546), ('my', 514), ('hamlet', 471), ('in', 451)]
pt_br: >>> # Conta ocorrências de palavras em uma lista >>> cnt = Counter() >>> for word in ['red', 'blue', 'red', 'green', 'blue', 'blue']: ... cnt[word] += 1 ... >>> cnt Counter({'blue': 3, 'red': 2, 'green': 1}) >>> # Encontra as dez palavras mais comuns em Hamlet >>> import re >>> words = re.findall(r'\w+', open('hamlet.txt').read().lower()) >>> Counter(words).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('you', 554), ('a', 546), ('my', 514), ('hamlet', 471), ('in', 451)]

source: A :class:`Counter` is a :class:`dict` subclass for counting :term:`hashable` objects. It is a collection where elements are stored as dictionary keys and their counts are stored as dictionary values. Counts are allowed to be any integer value including zero or negative counts. The :class:`Counter` class is similar to bags or multisets in other languages.
pt_br: Um :class:`Counter` é uma subclasse de :class:`dict` subclass para contagem de objetos :term:`hasheáveis <hasheável>`. É uma coleção na qual elementos são armazenados como chaves de dicionário e suas contagens são armazenadas como valores de dicionário. Contagens podem ser qualquer valor inteiro incluindo zero e contagens negativas. A classe :class:`Counter` é similar a sacos ou multiconjuntos em outras linguagens.

source: Elements are counted from an *iterable* or initialized from another *mapping* (or counter):
pt_br: Os elementos são contados a partir de um iterável *iterable* ou inicializado a partir de um outro mapeamento *mapping* (ou contador):

source: Counter objects have a dictionary interface except that they return a zero count for missing items instead of raising a :exc:`KeyError`:
pt_br: Objetos Counter tem uma interface de dicionário, com a diferença que devolvem uma contagem zero para itens que não estão presentes em vez de levantar a exceção :exc:`KeyError`:

source: Setting a count to zero does not remove an element from a counter. Use ``del`` to remove it entirely:
pt_br: Definir uma contagem como zero não remove um elemento do contador. Use ``del`` para o remover completamente.

source: As a :class:`dict` subclass, :class:`Counter` inherited the capability to remember insertion order. Math operations on *Counter* objects also preserve order. Results are ordered according to when an element is first encountered in the left operand and then by the order encountered in the right operand.
pt_br: Como uma subclasse de :class:`dict`, :class:`Counter` herda a capacidade de lembrar a ordem de inserção. Operações matemáticas em objetos *Counter* também preservam ordem. Os resultados são ordenados de acordo com o momento que um elemento é encontrado pela primeira vez no operando da esquerda e, em seguida, pela ordem encontrada no operando da direita.

source: Counter objects support additional methods beyond those available for all dictionaries:
pt_br: Objetos Counter têm suporte a métodos adicionais além daqueles que já estão disponíveis para todos os dicionários:

source: Return an iterator over elements repeating each as many times as its count. Elements are returned in the order first encountered. If an element's count is less than one, :meth:`elements` will ignore it.
pt_br: Retorna um iterador sobre os elementos, repetindo cada um tantas vezes quanto sua contagem. Os elementos são retornados na ordem em que foram encontrados pela primeira vez. Se a contagem de um elemento é menor que um, ele será ignorado por :meth:`elements` .

source: Return a list of the *n* most common elements and their counts from the most common to the least. If *n* is omitted or ``None``, :meth:`most_common` returns *all* elements in the counter. Elements with equal counts are ordered in the order first encountered:
pt_br: Retorna uma lista dos *n* elementos mais comuns e suas contagens, do mais comum para o menos comum. Se *n* for omitido ou igual a ``None``, :meth:`most_common` retorna *todos* os elementos no contador. Elementos com contagens iguais são ordenados na ordem em que foram encontrados pela primeira vez:

source: Elements are subtracted from an *iterable* or from another *mapping* (or counter). Like :meth:`dict.update` but subtracts counts instead of replacing them. Both inputs and outputs may be zero or negative.
pt_br: Os elementos são subtraídos de um iterável *iterable* ou de outro mapeamento *mapping* (ou contador). Funciona como :meth:`dict.update`, mas subtraindo contagens ao invés de substituí-las. Tanto as entradas quanto as saídas podem ser zero ou negativas.

source: Compute the sum of the counts.
pt_br: Calcula a soma das contagens.

source: The usual dictionary methods are available for :class:`Counter` objects except for two which work differently for counters.
pt_br: Os métodos usuais de dicionário estão disponíveis para objetos :class:`Counter`, exceto por dois que funcionam de forma diferente para contadores.

source: This class method is not implemented for :class:`Counter` objects.
pt_br: Este método de classe não está implementado para objetos :class:`Counter`.

source: Elements are counted from an *iterable* or added-in from another *mapping* (or counter). Like :meth:`dict.update` but adds counts instead of replacing them. Also, the *iterable* is expected to be a sequence of elements, not a sequence of ``(key, value)`` pairs.
pt_br: Elementos são contados a partir de um iterável *iterable* ou adicionados de outro mapeamento *mapping* (ou contador). Funciona como :meth:`dict.update`, mas adiciona contagens em vez de substituí-las. Além disso, é esperado que o *iterable* seja uma sequência de elementos, e não uma sequência de pares ``(key, value)``.

source: Counters support rich comparison operators for equality, subset, and superset relationships: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``. All of those tests treat missing elements as having zero counts so that ``Counter(a=1) == Counter(a=1, b=0)`` returns true.
pt_br: Os contadores oferecem suporte a operadores de comparação rica para relacionamentos de igualdade, subconjunto e superconjunto: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``. Todos esses testes tratam os elementos ausentes como tendo contagens zero para que ``Counter(a=1) == Counter(a=1, b=0)`` retorne verdadeiro.

source: Rich comparison operations were added.
pt_br: Foram adicionadas operações de rica comparação.

source: In equality tests, missing elements are treated as having zero counts. Formerly, ``Counter(a=3)`` and ``Counter(a=3, b=0)`` were considered distinct.
pt_br: Em testes de igualdade, os elementos ausentes são tratados como tendo contagens zero. Anteriormente, ``Counter(a=3)`` e ``Counter(a=3, b=0)`` eram considerados distintos.

source: Common patterns for working with :class:`Counter` objects::
pt_br: Padrões comuns para trabalhar com objetos :class:`Counter`::

source: c.total() # total of all counts c.clear() # reset all counts list(c) # list unique elements set(c) # convert to a set dict(c) # convert to a regular dictionary c.items() # access the (elem, cnt) pairs Counter(dict(list_of_pairs)) # convert from a list of (elem, cnt) pairs c.most_common()[:-n-1:-1] # n least common elements +c # remove zero and negative counts
pt_br: c.total() # total de todas as contagens c.clear() # redefine todas as contagens list(c) # lista elementos únicos set(c) # converte para um conjunto dict(c) # converte para um dicionário comum c.items() # acessa os pares (elem, cnt) Counter(dict(list_of_pairs)) # converte de uma lista de pares (elem, cnt) c.most_common()[:-n-1:-1] # n últimos elementos comuns +c # remove zero e contagens negativas

source: Several mathematical operations are provided for combining :class:`Counter` objects to produce multisets (counters that have counts greater than zero). Addition and subtraction combine counters by adding or subtracting the counts of corresponding elements. Intersection and union return the minimum and maximum of corresponding counts. Equality and inclusion compare corresponding counts. Each operation can accept inputs with signed counts, but the output will exclude results with counts of zero or less.
pt_br: Diversas operações matemáticas são fornecidas combinando objetos do tipo :class:`Counter` afim de se produzir multiconjuntos (Counters que possuem contagens maiores que 0). Adição e subtração combinam contadores adicionando ou subtraindo o contagem do elemento correspondente. Intersecção ou união retorna o mínimo e máximo da contagem correspondente. Igualdade e inclusão compara as contagens correspondentes. Cada operação aceita entradas com contagens assinadas, mas a saída vai excluir resultados com contagens de zero ou menos.
