Repository: python/python-docs-pt-br
Catalog: library/collections.po
Languages: pt_br

source: When each key is encountered for the first time, it is not already in the mapping; so an entry is automatically created using the :attr:`~defaultdict.default_factory` function which returns an empty :class:`list`. The :meth:`list.append` operation then attaches the value to the new list. When keys are encountered again, the look-up proceeds normally (returning the list for that key) and the :meth:`list.append` operation adds another value to the list. This technique is simpler and faster than an equivalent technique using :meth:`dict.setdefault`:
pt_br: Quando cada chave é encontrada pela primeira vez, ela ainda não está no mapeamento; então uma entrada é criada automaticamente usando a função :attr:`~defaultdict.default_factory` que retorna uma :class:`list` vazia. A operação :meth:`!list.append` então anexa o valor à nova lista. Quando as chaves são encontradas novamente, a pesquisa prossegue normalmente (retornando a lista daquela chave) e a operação :meth:`list.append` adiciona outro valor à lista. Esta técnica é mais simples e rápida que uma técnica equivalente usando :meth:`dict.setdefault`:

source: Setting the :attr:`~defaultdict.default_factory` to :class:`int` makes the :class:`defaultdict` useful for counting (like a bag or multiset in other languages):
pt_br: Definir :attr:`~defaultdict.default_factory` como :class:`int` torna :class:`defaultdict` útil para contagem (como um multiconjunto em outras linguagens):

source: When a letter is first encountered, it is missing from the mapping, so the :attr:`~defaultdict.default_factory` function calls :func:`int` to supply a default count of zero. The increment operation then builds up the count for each letter.
pt_br: Quando uma letra é encontrada pela primeira vez, ela está ausente no mapeamento, então a função :attr:`~defaultdict.default_factory` chama :func:`int` para fornecer uma contagem padrão de zero. A operação de incremento então cria a contagem para cada letra.

source: The function :func:`int` which always returns zero is just a special case of constant functions. A faster and more flexible way to create constant functions is to use a lambda function which can supply any constant value (not just zero):
pt_br: A função :func:`int` que sempre retorna zero é apenas um caso especial de funções constantes. Uma maneira mais rápida e flexível de criar funções constantes é usar uma função lambda que pode fornecer qualquer valor constante (não apenas zero):

source: Setting the :attr:`~defaultdict.default_factory` to :class:`set` makes the :class:`defaultdict` useful for building a dictionary of sets:
pt_br: Definir :attr:`~defaultdict.default_factory` como :class:`set` torna :class:`defaultdict` útil para construir um dicionário de conjuntos:

source: :func:`namedtuple` Factory Function for Tuples with Named Fields
pt_br: Função de fábrica para tuplas com campos nomeados :func:`namedtuple`

source: Named tuples assign meaning to each position in a tuple and allow for more readable, self-documenting code. They can be used wherever regular tuples are used, and they add the ability to access fields by name instead of position index.
pt_br: Tuplas nomeadas determinam o significado de cada posição numa tupla e permitem um código mais legível e autodocumentado. Podem ser usadas sempre que tuplas regulares forem utilizadas, e adicionam a possibilidade de acessar campos pelo nome ao invés da posição do índice.

source: Returns a new tuple subclass named *typename*. The new subclass is used to create tuple-like objects that have fields accessible by attribute lookup as well as being indexable and iterable. Instances of the subclass also have a helpful docstring (with *typename* and *field_names*) and a helpful :meth:`~object.__repr__` method which lists the tuple contents in a ``name=value`` format.
pt_br: Retorna uma nova subclasse de tupla chamada *typename*. A nova subclasse é usada para criar objetos tupla ou similares que possuem campos acessíveis por pesquisa de atributos, além de serem indexáveis e iteráveis. As instâncias da subclasse também possuem uma docstring útil (com *typename* e *field_names*) e um método útil :meth:`~object.__repr__` que lista o conteúdo da tupla em um formato ``nome=valor``.

source: The *field_names* are a sequence of strings such as ``['x', 'y']``. Alternatively, *field_names* can be a single string with each fieldname separated by whitespace and/or commas, for example ``'x y'`` or ``'x, y'``.
pt_br: *field_names* são uma sequência de strings como ``['x', 'y']``. Alternativamente, *field_names* pode ser uma única string com cada nome de campo separado por espaços em branco e/ou vírgulas como, por exemplo, ``'x y'`` ou ``'x, y'``.

source: Any valid Python identifier may be used for a fieldname except for names starting with an underscore. Valid identifiers consist of letters, digits, and underscores but do not start with a digit or underscore and cannot be a :mod:`keyword` such as *class*, *for*, *return*, *global*, *pass*, or *raise*.
pt_br: Qualquer identificador Python válido pode ser usado para um nome de campo, exceto para nomes que começam com um sublinhado. Identificadores válidos consistem em letras, dígitos e sublinhados, mas não começam com um dígito ou sublinhado e não podem ser uma :mod:`keyword` como *class*, *for*, *return*, *global*, *pass* ou *raise*.

source: If *rename* is true, invalid fieldnames are automatically replaced with positional names. For example, ``['abc', 'def', 'ghi', 'abc']`` is converted to ``['abc', '_1', 'ghi', '_3']``, eliminating the keyword ``def`` and the duplicate fieldname ``abc``.
pt_br: Se *rename* for verdadeiro, nomes de campos inválidos serão automaticamente substituídos por nomes posicionais. Por exemplo, ``['abc', 'def', 'ghi', 'abc']`` é convertido para ``['abc', '_1', 'ghi', '_3']``, eliminando a palavra reservada ``def`` e o nome de campo duplicado ``abc``.

source: *defaults* can be ``None`` or an :term:`iterable` of default values. Since fields with a default value must come after any fields without a default, the *defaults* are applied to the rightmost parameters. For example, if the fieldnames are ``['x', 'y', 'z']`` and the defaults are ``(1, 2)``, then ``x`` will be a required argument, ``y`` will default to ``1``, and ``z`` will default to ``2``.
pt_br: *defaults* pode ser ``None`` ou um :term:`iterável` de valores padrão. Como os campos com valor padrão devem vir depois de qualquer campo sem padrão, os *padrões* são aplicados aos parâmetros mais à direita. Por exemplo, se os nomes dos campos forem ``['x', 'y', 'z']`` e os padrões forem ``(1, 2)``, então ``x`` será um argumento obrigatório, ``y`` será o padrão ``1``, e ``z`` será o padrão ``2``.

source: If *module* is defined, the :attr:`~type.__module__` attribute of the named tuple is set to that value.
pt_br: Se *module* for definido, o atributo :attr:`~type.__module__` da tupla nomeada será definido com esse valor.

source: Named tuple instances do not have per-instance dictionaries, so they are lightweight and require no more memory than regular tuples.
pt_br: As instâncias de tuplas nomeadas não possuem dicionários por instância, portanto são leves e não requerem mais memória do que as tuplas normais.

source: To support pickling, the named tuple class should be assigned to a variable that matches *typename*.
pt_br: Para prover suporte para a serialização com pickle, a classe de tupla nomeada deve ser atribuída a uma variável que corresponda a *typename*.

source: Added support for *rename*.
pt_br: Adicionado suporte a *rename*.

source: The *verbose* and *rename* parameters became :ref:`keyword-only arguments <keyword-only_parameter>`.
pt_br: Os parâmetros *verbose* e *rename* tornaram-se :ref:`argumentos somente-nomeados <keyword-only_parameter>`.

source: Added the *module* parameter.
pt_br: Adicionado o parâmetro *module*.

source: Removed the *verbose* parameter and the :attr:`!_source` attribute.
pt_br: Removido o parâmetro *verbose* e o atributo :attr:`!_source`.

source: Added the *defaults* parameter and the :attr:`~somenamedtuple._field_defaults` attribute.
pt_br: Adicionado o parâmetro *defaults* e o atributo :attr:`~somenamedtuple._field_defaults`.

source: >>> # Basic example >>> Point = namedtuple('Point', ['x', 'y']) >>> p = Point(11, y=22) # instantiate with positional or keyword arguments >>> p[0] + p[1] # indexable like the plain tuple (11, 22) 33 >>> x, y = p # unpack like a regular tuple >>> x, y (11, 22) >>> p.x + p.y # fields also accessible by name 33 >>> p # readable __repr__ with a name=value style Point(x=11, y=22)
pt_br: >>> # Exemplo básico >>> Point = namedtuple('Point', ['x', 'y']) >>> p = Point(11, y=22) # instancia com argumentos nomeados ou posicionais >>> p[0] + p[1] # indexável como a tupla plana (11, 22) 33 >>> x, y = p # desempacota como uma tupla normal >>> x, y (11, 22) >>> p.x + p.y # campos também acessíveis pelo nome 33 >>> p # __repr__ legível com o estilo nome=valor Point(x=11, y=22)

source: Named tuples are especially useful for assigning field names to result tuples returned by the :mod:`csv` or :mod:`sqlite3` modules::
pt_br: Tuplas nomeadas são especialmente úteis para atribuir nomes de campos a tuplas de resultados retornadas pelos módulos :mod:`csv` ou :mod:`sqlite3`::

source: In addition to the methods inherited from tuples, named tuples support three additional methods and two attributes. To prevent conflicts with field names, the method and attribute names start with an underscore.
pt_br: Além dos métodos herdados das tuplas, as tuplas nomeadas oferecem suporte a três métodos adicionais e dois atributos. Para evitar conflitos com nomes de campos, os nomes de métodos e atributos começam com um sublinhado.

source: Class method that makes a new instance from an existing sequence or iterable.
pt_br: Método de classe que cria uma nova instância a partir de uma sequência existente ou iterável.

source: Return a new :class:`dict` which maps field names to their corresponding values:
pt_br: Retorna um novo :class:`dict` que mapeia nomes de campo para seus respectivos valores:

source: Returns an :class:`OrderedDict` instead of a regular :class:`dict`.
pt_br: Retorna um :class:`OrderedDict` em vez de um :class:`dict` normal.

source: Returns a regular :class:`dict` instead of an :class:`OrderedDict`. As of Python 3.7, regular dicts are guaranteed to be ordered. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``.
pt_br: Retorna um :class:`dict` regular em vez de um :class:`OrderedDict`. A partir do Python 3.7, é garantido que os dicionários regulares sejam ordenados. Se os recursos extras de :class:`OrderedDict` forem necessários, a correção sugerida é converter o resultado para o tipo desejado: ``OrderedDict(nt._asdict())``.

source: Return a new instance of the named tuple replacing specified fields with new values::
pt_br: Retorna uma nova instância da tupla nomeada substituindo os campos especificados por novos valores::

source: Named tuples are also supported by generic function :func:`copy.replace`.
pt_br: Tuplas nomeadas também são suportados pela função genérica :func:`copy.replace`.

source: Raise :exc:`TypeError` instead of :exc:`ValueError` for invalid keyword arguments.
pt_br: Levanta :exc:`TypeError` em vez de :exc:`ValueError` para argumentos nomeados inválidos.

source: Tuple of strings listing the field names. Useful for introspection and for creating new named tuple types from existing named tuples.
pt_br: Tupla de strings listando os nomes dos campos. Útil para introspecção e para criar novos tipos de tuplas nomeadas a partir de tuplas nomeadas existentes.

source: >>> p._fields # view the field names ('x', 'y') >>> Color = namedtuple('Color', 'red green blue') >>> Pixel = namedtuple('Pixel', Point._fields + Color._fields) >>> Pixel(11, 22, 128, 255, 0) Pixel(x=11, y=22, red=128, green=255, blue=0)
pt_br: >>> p._fields # exibe os nomes de campos ('x', 'y') >>> Color = namedtuple('Color', 'red green blue') >>> Pixel = namedtuple('Pixel', Point._fields + Color._fields) >>> Pixel(11, 22, 128, 255, 0) Pixel(x=11, y=22, red=128, green=255, blue=0)

source: Dictionary mapping field names to default values.
pt_br: Dicionário mapeando nomes de campos para valores padrão.

source: To retrieve a field whose name is stored in a string, use the :func:`getattr` function:
pt_br: Para recuperar um campo cujo nome está armazenado em uma string, use a função :func:`getattr`:

source: To convert a dictionary to a named tuple, use the double-star-operator (as described in :ref:`tut-unpacking-arguments`):
pt_br: Para converter um dicionário em uma tupla nomeada, use o operador estrela dupla (conforme descrito em :ref:`tut-unpacking-arguments`):

source: Since a named tuple is a regular Python class, it is easy to add or change functionality with a subclass. Here is how to add a calculated field and a fixed-width print format:
pt_br: Como uma tupla nomeada é uma classe regular do Python, é fácil adicionar ou alterar funcionalidades com uma subclasse. Veja como adicionar um campo calculado e um formato de impressão de largura fixa:

source: The subclass shown above sets ``__slots__`` to an empty tuple. This helps keep memory requirements low by preventing the creation of instance dictionaries.
pt_br: A subclasse mostrada acima define ``__slots__`` como uma tupla vazia. Isso ajuda a manter baixos os requisitos de memória, evitando a criação de dicionários de instância.

source: Subclassing is not useful for adding new, stored fields. Instead, simply create a new named tuple type from the :attr:`~somenamedtuple._fields` attribute:
pt_br: A criação de subclasse não é útil para adicionar novos campos armazenados. Em vez disso, simplesmente crie um novo tipo de tupla nomeado a partir do atributo :attr:`~somenamedtuple._fields`:

source: Docstrings can be customized by making direct assignments to the ``__doc__`` fields:
pt_br: Docstrings podem ser personalizados fazendo atribuições diretas aos campos ``__doc__``:

source: Property docstrings became writeable.
pt_br: Os docstrings de propriedade tornaram-se graváveis.

source: See :class:`typing.NamedTuple` for a way to add type hints for named tuples. It also provides an elegant notation using the :keyword:`class` keyword::
pt_br: Veja :class:`typing.NamedTuple` para uma maneira de adicionar dicas de tipo para tuplas nomeadas. Ele também fornece uma notação elegante usando a palavra reservada :keyword:`class`::

source: See :meth:`types.SimpleNamespace` for a mutable namespace based on an underlying dictionary instead of a tuple.
pt_br: Veja :meth:`types.SimpleNamespace` para um espaço de nomes mutável baseado em um dicionário subjacente em vez de uma tupla.

source: The :mod:`dataclasses` module provides a decorator and functions for automatically adding generated special methods to user-defined classes.
pt_br: O módulo :mod:`dataclasses` fornece um decorador e funções para adicionar automaticamente métodos especiais gerados a classes definidas pelo usuário.

source: :class:`OrderedDict` objects
pt_br: Objetos :class:`OrderedDict`

source: Ordered dictionaries are just like regular dictionaries but have some extra capabilities relating to ordering operations. They have become less important now that the built-in :class:`dict` class gained the ability to remember insertion order (this new behavior became guaranteed in Python 3.7).
pt_br: Os dicionários ordenados são como os dicionários normais, mas possuem alguns recursos extras relacionados às operações de pedido. Eles se tornaram menos importantes agora que a classe embutida :class:`dict` ganhou a capacidade de lembrar a ordem de inserção (esse novo comportamento foi garantido no Python 3.7).

source: Some differences from :class:`dict` still remain:
pt_br: Algumas diferenças de :class:`dict` ainda permanecem:

source: The regular :class:`dict` was designed to be very good at mapping operations. Tracking insertion order was secondary.
pt_br: O :class:`dict` regular foi projetado para ser muito bom em operações de mapeamento. O rastreamento do pedido de inserção era secundário.

source: The :class:`OrderedDict` was designed to be good at reordering operations. Space efficiency, iteration speed, and the performance of update operations were secondary.
pt_br: O :class:`OrderedDict` foi projetado para ser bom em operações de reordenação. A eficiência de espaço, a velocidade de iteração e o desempenho das operações de atualização eram secundários.

source: The :class:`OrderedDict` algorithm can handle frequent reordering operations better than :class:`dict`. As shown in the recipes below, this makes it suitable for implementing various kinds of LRU caches.
pt_br: O algoritmo :class:`OrderedDict` pode lidar com operações de reordenação frequentes melhor do que :class:`dict`. Conforme mostrado nas receitas abaixo, isso o torna adequado para implementar vários tipos de caches LRU.

source: The equality operation for :class:`OrderedDict` checks for matching order.
pt_br: A operação de igualdade para :class:`OrderedDict` verifica a ordem correspondente.

source: A regular :class:`dict` can emulate the order sensitive equality test with ``p == q and all(k1 == k2 for k1, k2 in zip(p, q))``.
pt_br: Um :class:`dict` regular pode emular o teste de igualdade sensível à ordem com ``p == q and all(k1 == k2 for k1, k2 in zip(p, q))``.

source: The :meth:`~OrderedDict.popitem` method of :class:`OrderedDict` has a different signature. It accepts an optional argument to specify which item is popped.
pt_br: O método :meth:`~OrderedDict.popitem` de :class:`OrderedDict` tem uma assinatura diferente. Ele aceita um argumento opcional para especificar qual item será exibido.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=True)`` with ``d.popitem()`` which is guaranteed to pop the rightmost (last) item.
pt_br: Um :class:`dict` normal pode emular o ``od.popitem(last=True)`` do OrderedDict com ``d.popitem()`` que é garantido para exibir o (último) item mais à direita.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=False)`` with ``(k := next(iter(d)), d.pop(k))`` which will return and remove the leftmost (first) item if it exists.
pt_br: Um :class:`dict` normal pode emular o ``od.popitem(last=False)`` do OrderedDict com ``(k := next(iter(d)), d.pop(k))`` que retornará e remova o item mais à esquerda (primeiro), se existir.

source: :class:`OrderedDict` has a :meth:`~OrderedDict.move_to_end` method to efficiently reposition an element to an endpoint.
pt_br: :class:`OrderedDict` possui um método :meth:`~OrderedDict.move_to_end` para reposicionar eficientemente um elemento em um endpoint.

source: A regular :class:`dict` can emulate OrderedDict's ``od.move_to_end(k, last=True)`` with ``d[k] = d.pop(k)`` which will move the key and its associated value to the rightmost (last) position.
pt_br: Um :class:`dict` normal pode emular o ``od.move_to_end(k, last=True)`` do OrderedDict com ``d[k] = d.pop(k)`` que moverá a chave e seu valor associado para a posição mais à direita (última).

source: A regular :class:`dict` does not have an efficient equivalent for OrderedDict's ``od.move_to_end(k, last=False)`` which moves the key and its associated value to the leftmost (first) position.
pt_br: Um :class:`dict` regular não tem um equivalente eficiente para o ``od.move_to_end(k, last=False)`` do OrderedDict, que move a chave e seu valor associado para a posição mais à esquerda (primeira).

source: Until Python 3.8, :class:`dict` lacked a :meth:`~object.__reversed__` method.
pt_br: Até o Python 3.8, :class:`dict` não tinha um método :meth:`~object.__reversed__`.

source: Return an instance of a :class:`dict` subclass that has methods specialized for rearranging dictionary order.
pt_br: Retorna uma instância de uma subclasse :class:`dict` que possui métodos especializados para reorganizar a ordem do dicionário.

source: The :meth:`popitem` method for ordered dictionaries returns and removes a (key, value) pair. The pairs are returned in :abbr:`LIFO (last-in, first-out)` order if *last* is true or :abbr:`FIFO (first-in, first-out)` order if false.
pt_br: O método :meth:`popitem` para dicionários ordenados retorna e remove um par (chave, valor). Os pares são retornados na ordem :abbr:`LIFO (último a entrar, primeiro a sair)` se *last* for verdadeiro ou na ordem :abbr:`FIFO (primeiro a entrar, primeiro a sair)` se for falso.

source: Move an existing *key* to either end of an ordered dictionary. The item is moved to the right end if *last* is true (the default) or to the beginning if *last* is false. Raises :exc:`KeyError` if the *key* does not exist:
pt_br: Move uma chave *key* existente para qualquer extremidade de um dicionário ordenado. O item é movido para a extremidade direita se *last* for verdadeiro (o padrão) ou para o início se *último* for falso. Levanta :exc:`KeyError` se a *key* não existir:

source: In addition to the usual mapping methods, ordered dictionaries also support reverse iteration using :func:`reversed`.
pt_br: Além dos métodos usuais de mapeamento, dicionários ordenados também oferecem suporte a iteração reversa usando a função :func:`reversed`.

source: Equality tests between :class:`OrderedDict` objects are order-sensitive and are roughly equivalent to ``list(od1.items())==list(od2.items())``.
pt_br: Testes de igualdade entre objetos :class:`OrderedDict` são sensíveis à ordem e são aproximadamente equivalentes a ``list(od1.items())==list(od2.items())``.

source: Equality tests between :class:`OrderedDict` objects and other :class:`~collections.abc.Mapping` objects are order-insensitive like regular dictionaries. This allows :class:`OrderedDict` objects to be substituted anywhere a regular dictionary is used.
pt_br: Testes de igualdade entre objetos :class:`OrderedDict` e outros objetos :class:`~collections.abc.Mapping` não diferenciam a ordem como dicionários regulares. Isso permite que objetos :class:`OrderedDict` sejam substituídos em qualquer lugar que um dicionário regular seja usado.

source: The items, keys, and values :term:`views <dictionary view>` of :class:`OrderedDict` now support reverse iteration using :func:`reversed`.
pt_br: Os itens, chaves e valores de :term:`visões <dictionary view>` de :class:`OrderedDict` agora oferecem suporte a iteração reversa usando :func:`reversed`.

source: With the acceptance of :pep:`468`, order is retained for keyword arguments passed to the :class:`OrderedDict` constructor and its :meth:`~dict.update` method.
pt_br: Com a aceitação da :pep:`468`, a ordem é mantida para argumentos nomeados passados para o construtor :class:`OrderedDict` e seu método :meth:`~dict.update`.

source: :class:`OrderedDict` Examples and Recipes
pt_br: Exemplos e receitas de :class:`OrderedDict`

source: It is straightforward to create an ordered dictionary variant that remembers the order the keys were *last* inserted. If a new entry overwrites an existing entry, the original insertion position is changed and moved to the end::
pt_br: É simples criar uma variante de dicionário ordenado que lembre a ordem em que as chaves foram inseridas pela *última* vez. Se uma nova entrada substituir uma entrada existente, a posição de inserção original será alterada e movida para o final::

source: An :class:`OrderedDict` would also be useful for implementing variants of :func:`functools.lru_cache`:
pt_br: Um :class:`OrderedDict` também seria útil para implementar variantes de :func:`functools.lru_cache`:

source: :class:`UserDict` objects
pt_br: Objetos :class:`UserDict`
