Repository: python/python-docs-pt-br
Catalog: library/compileall.po
Languages: pt_br

source: :mod:`!compileall` --- Byte-compile Python libraries
pt_br: :mod:`!compileall` --- Compilar bibliotecas do Python para bytecode

source: **Source code:** :source:`Lib/compileall.py`
pt_br: **Código-fonte:** :source:`Lib/compileall.py`

source: This module provides some utility functions to support installing Python libraries. These functions compile Python source files in a directory tree. This module can be used to create the cached byte-code files at library installation time, which makes them available for use even by users who don't have write permission to the library directories.
pt_br: Este módulo fornece algumas funções utilitárias para dar suporte à instalação de bibliotecas Python. Essas funções compilam arquivos fonte Python em uma árvore de diretórios. Este módulo pode ser usado para criar os arquivos de bytecodes em cache no momento da instalação da biblioteca, o que os torna disponíveis para uso mesmo por usuários que não têm permissão de gravação nos diretórios da biblioteca.

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: Command-line use
pt_br: Uso na linha de comando

source: This module can work as a script (using :program:`python -m compileall`) to compile Python sources.
pt_br: Este módulo pode funcionar como um script (usando :program:`python -m compileall`) para compilar fontes do Python.

source: Positional arguments are files to compile or directories that contain source files, traversed recursively. If no argument is given, behave as if the command line was :samp:`-l {<directories from sys.path>}`.
pt_br: Argumentos posicionais são arquivos a serem compilados ou diretórios que contêm arquivos de origem, percorridos recursivamente. Se nenhum argumento for fornecido, comporta-se como se a linha de comando fosse :samp:`-l {<diretórios do sys.path>}`.

source: Do not recurse into subdirectories, only compile source code files directly contained in the named or implied directories.
pt_br: Não atua recursivamente em subdiretórios, apenas compila arquivos de código-fonte diretamente contidos nos diretórios nomeados ou implícitos.

source: Force rebuild even if timestamps are up-to-date.
pt_br: Força a recompilação, mesmo que os carimbos de data e hora estejam atualizados.

source: Do not print the list of files compiled. If passed once, error messages will still be printed. If passed twice (``-qq``), all output is suppressed.
pt_br: Não imprime a lista de arquivos compilados. Se passado uma vez, as mensagens de erro ainda serão impressas. Se passado duas vezes (``-qq``), toda a saída é suprimida.

source: Directory prepended to the path to each file being compiled. This will appear in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
pt_br: Diretório anexado ao caminho de cada arquivo que está sendo compilado. Isso aparecerá nos tracebacks em tempo de compilação e também será compilado no arquivo de bytecode, onde será usado em tracebacks e outras mensagens nos casos em que o arquivo de origem não exista no momento em que o arquivo de bytecode for executado.

source: Remove the given prefix from paths recorded in the ``.pyc`` files. Paths are made relative to the prefix.
pt_br: Remove o prefixo especificado dos caminhos gravados nos arquivos ``.pyc``. Caminhos são tornados relativos ao prefixo.

source: This option can be used with ``-p`` but not with ``-d``.
pt_br: Esta opção pode ser usada com ``-p``, mas não com ``-d``.

source: Prepend the given prefix to paths recorded in the ``.pyc`` files. Use ``-p /`` to make the paths absolute.
pt_br: Adiciona o prefixo fornecido aos caminhos registrados nos arquivos ``.pyc``. Use ``-p /`` para tornar os caminhos absolutos.

source: This option can be used with ``-s`` but not with ``-d``.
pt_br: Esta opção pode ser usada com ``-s``, mas não com ``-d``.

source: regex is used to search the full path to each file considered for compilation, and if the regex produces a match, the file is skipped.
pt_br: A expressão regular ``regex`` é usada para pesquisar o caminho completo para cada arquivo considerado para compilação e, se a ``regex`` produzir uma correspondência, o arquivo será ignorado.

source: Read the file ``list`` and add each line that it contains to the list of files and directories to compile. If ``list`` is ``-``, read lines from ``stdin``.
pt_br: Lê o arquivo ``list`` e adicione cada linha que ele contém à lista de arquivos e diretórios a serem compilados. Se ``list`` for ``-``, lê as linhas do ``stdin``.

source: Write the byte-code files to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
pt_br: Escreve os arquivos de bytecode em seus locais e nomes legados, que podem sobrescrever arquivos de bytecode criados por outra versão do Python. O padrão é gravar arquivos em seus locais e nomes do :pep:`3147`, o que permite que arquivos de bytecode de várias versões do Python coexistam.

source: Control the maximum recursion level for subdirectories. If this is given, then ``-l`` option will not be taken into account. :program:`python -m compileall <directory> -r 0` is equivalent to :program:`python -m compileall <directory> -l`.
pt_br: Controla o nível máximo de recursão para subdiretórios. Se isso for dado, a opção ``-l`` não será levada em consideração. :program:`python -m compileall <diretório> -r 0` é equivalente a :program:`python -m compileall <diretório> -l`.

source: Use *N* workers to compile the files within the given directory. If ``0`` is used, then the result of :func:`os.process_cpu_count` will be used.
pt_br: Usa *N* workers para compilar os arquivos dentro do diretório especificado. Se ``0`` for usado, o resultado de :func:`os.process_cpu_count` será usado.

source: Control how the generated byte-code files are invalidated at runtime. The ``timestamp`` value, means that ``.pyc`` files with the source timestamp and size embedded will be generated. The ``checked-hash`` and ``unchecked-hash`` values cause hash-based pycs to be generated. Hash-based pycs embed a hash of the source file contents rather than a timestamp. See :ref:`pyc-invalidation` for more information on how Python validates bytecode cache files at runtime. The default is ``timestamp`` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is not set, and ``checked-hash`` if the ``SOURCE_DATE_EPOCH`` environment variable is set.
pt_br: Controla como os arquivos de bytecode gerados são invalidados no tempo de execução. O valor ``timestamp`` significa que os arquivos ``.pyc`` com o carimbo de data/hora do fonte e o tamanho incorporado serão gerados. Os valores ``selected-hash`` e ``unchecked-hash`` fazem com que os pycs baseados em hash sejam gerados. Arquivos pycs baseados em hash incorporam um hash do conteúdo do arquivo fonte em vez de um carimbo de data/hora. Veja :ref:`pyc-invalidation` para obter mais informações sobre como o Python valida os arquivos de cache do bytecode em tempo de execução. O padrão é ``timestamp`` se a variável de ambiente :envvar:`SOURCE_DATE_EPOCH` não estiver configurada e ``selected-hash`` se a variável de ambiente ``SOURCE_DATE_EPOCH`` estiver configurada.

source: Compile with the given optimization level. May be used multiple times to compile for multiple levels at a time (for example, ``compileall -o 1 -o 2``).
pt_br: Compila com o nível de otimização fornecido. Pode ser usado várias vezes para compilar para vários níveis por vez (por exemplo, ``compileall -o 1 -o 2``).

source: Ignore symlinks pointing outside the given directory.
pt_br: Ignora links simbólicos que apontam para fora do diretório especificado.

source: If two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
pt_br: Se dois arquivos ``.pyc`` com nível de otimização diferente tiverem o mesmo conteúdo, usa links físicos para consolidar arquivos duplicados.

source: Added the ``-i``, ``-b`` and ``-h`` options.
pt_br: Adicionadas as opções ``-i``, ``-b`` e ``-h``.

source: Added the ``-j``, ``-r``, and ``-qq`` options. ``-q`` option was changed to a multilevel value. ``-b`` will always produce a byte-code file ending in ``.pyc``, never ``.pyo``.
pt_br: Adicionadas as opções ``-j``, ``-r`` e ``-qq``. A opção ``-q`` foi alterada para um valor multinível. ``-b`` sempre produzirá um arquivo de bytecodes que termina em ``.pyc``, nunca em ``.pyo``.

source: Added the ``--invalidation-mode`` option.
pt_br: Adicionada a opção ``--invalidation-mode``.

source: Added the ``-s``, ``-p``, ``-e`` and ``--hardlink-dupes`` options. Raised the default recursion limit from 10 to :py:func:`sys.getrecursionlimit()`. Added the possibility to specify the ``-o`` option multiple times.
pt_br: Adicionadas as opções ``-s``, ``-p``, ``-e`` e ``--hardlink-dupes``. Aumentado o limite de recursão padrão de 10 para :py:func:`sys.getrecursionlimit()`. Adicionada a possibilidade de especificar a opção ``-o`` várias vezes.

source: There is no command-line option to control the optimization level used by the :func:`compile` function, because the Python interpreter itself already provides the option: :program:`python -O -m compileall`.
pt_br: Não há opção na linha de comando para controlar o nível de otimização usado pela função :func:`compile` porque o próprio interpretador Python já fornece a opção: :program:`python -O -m compileall`.

source: Similarly, the :func:`compile` function respects the :data:`sys.pycache_prefix` setting. The generated bytecode cache will only be useful if :func:`compile` is run with the same :data:`sys.pycache_prefix` (if any) that will be used at runtime.
pt_br: Da mesma forma, a função :func:`compile` respeita a configuração :data:`sys.pycache_prefix`. O cache do bytecode gerado somente será útil se :func:`compile` for executado com o mesmo :data:`sys.pycache_prefix` (se houver) que será usado em tempo de execução.

source: Public functions
pt_br: Funções públicas

source: Recursively descend the directory tree named by *dir*, compiling all :file:`.py` files along the way. Return a true value if all the files compiled successfully, and a false value otherwise.
pt_br: Desce recursivamente a árvore de diretórios nomeada por *dir*, compilando todos os arquivos :file:`.py` ao longo do caminho. Retorna um valor verdadeiro se todos os arquivos forem compilados com êxito e um valor falso caso contrário.

source: The *maxlevels* parameter is used to limit the depth of the recursion; it defaults to ``sys.getrecursionlimit()``.
pt_br: O parâmetro *maxlevels* é usado para limitar a profundidade da recursão; o padrão é ``sys.getrecursionlimit()``.

source: If *ddir* is given, it is prepended to the path to each file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
pt_br: Se *ddir* for fornecido, ele será anexado ao caminho de cada arquivo que está sendo compilado para uso em tracebacks em tempo de compilação e também será compilado no arquivo de bytecode, onde será usado em tracebacks e outras mensagens nos casos em que o arquivo de origem não existe no momento em que o arquivo de bytecode é executado.

source: If *force* is true, modules are re-compiled even if the timestamps are up to date.
pt_br: Se *force* for verdadeiro, os módulos serão recompilados, mesmo que os carimbos de data e hora estejam atualizados.

source: If *rx* is given, its ``search`` method is called on the complete path to each file considered for compilation, and if it returns a true value, the file is skipped. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
pt_br: Se *rx* for fornecido, seu método ``search`` será chamado no caminho completo para cada arquivo considerado para compilação e, se retornar um valor verdadeiro, o arquivo será ignorado. Isso pode ser usado para excluir arquivos correspondendo a uma expressão regular, dado como um objeto :ref:`re.Pattern <re-objects>`.

source: If *quiet* is ``False`` or ``0`` (the default), the filenames and other information are printed to standard out. Set to ``1``, only errors are printed. Set to ``2``, all output is suppressed.
pt_br: Se *quiet* for ``False`` ou ``0`` (o padrão), os nomes dos arquivos e outras informações serão impressos com o padrão. Definido como ``1``, apenas os erros são impressos. Definido como ``2``, toda a saída é suprimida.

source: If *legacy* is true, byte-code files are written to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
pt_br: Se *legacy* for verdadeiro, os arquivos de bytecodes serão gravados em seus locais e nomes herdados, o que poderá sobrescrever arquivos de bytecodes criados por outra versão do Python. O padrão é gravar arquivos em seus locais e nomes do :pep:`3147`, o que permite que arquivos de bytecodes de várias versões do Python coexistam.

source: *optimize* specifies the optimization level for the compiler. It is passed to the built-in :func:`compile` function. Accepts also a sequence of optimization levels which lead to multiple compilations of one :file:`.py` file in one call.
pt_br: *optimize* especifica o nível de otimização para o compilador. Ele é passado para a função embutida :func:`compile`. Aceita também uma sequência de níveis de otimização que levam a várias compilações de um arquivo :file:`.py` em uma chamada.

source: The argument *workers* specifies how many workers are used to compile files in parallel. The default is to not use multiple workers. If the platform can't use multiple workers and *workers* argument is given, then sequential compilation will be used as a fallback. If *workers* is 0, the number of cores in the system is used. If *workers* is lower than ``0``, a :exc:`ValueError` will be raised.
pt_br: O argumento *workers* especifica quantos workers são usados para compilar arquivos em paralelo. O padrão é não usar vários workers. Se a plataforma não puder usar vários workers e o argumento *workers* for fornecido, a compilação sequencial será usada como reserva. Se *workers* for 0, o número de núcleos no sistema é usado. Se *workers* for menor que ``0``, a :exc:`ValueError` será levantada.

source: *invalidation_mode* should be a member of the :class:`py_compile.PycInvalidationMode` enum and controls how the generated pycs are invalidated at runtime.
pt_br: *invalidation_mode* deve ser um membro de enum :class:`py_compile.PycInvalidationMode` e controla como os pycs gerados são invalidados em tempo de execução.

source: The *stripdir*, *prependdir* and *limit_sl_dest* arguments correspond to the ``-s``, ``-p`` and ``-e`` options described above. They may be specified as ``str`` or :py:class:`os.PathLike`.
pt_br: Os argumentos *stripdir*, *prependdir* e *limit_sl_dest* correspondem às opções ``-s``, ``-p`` e ``-e`` descrita acima. eles podem ser especificados como ``str`` ou :py:class:`os.PathLike`.

source: If *hardlink_dupes* is true and two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
pt_br: Se *hardlink_dupes* for verdadeiro e dois arquivos ``.pyc`` com nível de otimização diferente tiverem o mesmo conteúdo, usa links físicos para consolidar arquivos duplicados.

source: Added the *legacy* and *optimize* parameter.
pt_br: Adicionado os parâmetros *legacy* e *optimize*.

source: Added the *workers* parameter.
pt_br: Adicionado o parâmetro *workers*.

source: *quiet* parameter was changed to a multilevel value.
pt_br: O parâmetro *quiet* foi alterado para um valor multinível.

source: The *legacy* parameter only writes out ``.pyc`` files, not ``.pyo`` files no matter what the value of *optimize* is.
pt_br: O parâmetro *legacy* grava apenas arquivos ``.pyc``, não os arquivos ``.pyo``, independentemente do valor de *optimize*.

source: Accepts a :term:`path-like object`.
pt_br: Aceita um :term:`objeto caminho ou similar`.

source: The *invalidation_mode* parameter was added.
pt_br: O parâmetro *invalidation_mode* foi adicionado.

source: The *invalidation_mode* parameter's default value is updated to ``None``.
pt_br: O valor padrão do parâmetro *invalidation_mode* é atualizado para ``None``.

source: Setting *workers* to 0 now chooses the optimal number of cores.
pt_br: A definição de *workers* como 0 agora escolhe o número ideal de núcleos.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments. Default value of *maxlevels* was changed from ``10`` to ``sys.getrecursionlimit()``
pt_br: Adicionados os argumentos *stripdir*, *prependdir*, *limit_sl_dest* e *hardlink_dupes*. O valor padrão de *maxlevels* foi alterado de ``10`` para ``sys.getrecursionlimit()``

source: Compile the file with path *fullname*. Return a true value if the file compiled successfully, and a false value otherwise.
pt_br: Compila o arquivo com o caminho *fullname*. Retorna um valor verdadeiro se o arquivo compilado com êxito e um valor falso caso contrário.

source: If *ddir* is given, it is prepended to the path to the file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
pt_br: Se *ddir* for fornecido, ele será anexado ao caminho do arquivo que está sendo compilado para uso em rastreamentos em tempo de compilação e também será compilado no arquivo de bytecode, onde será usado em tracebacks e outras mensagens nos casos em que o arquivo fonte não existe no momento em que o arquivo de bytecode é executado.

source: If *rx* is given, its ``search`` method is passed the full path name to the file being compiled, and if it returns a true value, the file is not compiled and ``True`` is returned. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
pt_br: Se *rx* for fornecido, seu método ``search`` passará o nome do caminho completo para o arquivo que está sendo compilado e, se retornar um valor verdadeiro, o arquivo não será compilado e ``True`` será retornado. Isso pode ser usado para excluir arquivos correspondendo a uma expressão regular, dado como um objeto :ref:`re.Pattern <re-objects>`.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments.
pt_br: Adicionados os argumentos *stripdir*, *prependdir*, *limit_sl_dest* e *hardlink_dupes*.

source: Byte-compile all the :file:`.py` files found along ``sys.path``. Return a true value if all the files compiled successfully, and a false value otherwise.
pt_br: Compila Byte para bytecodes todos os arquivos :file:`.py` encontrados ao longo de ``sys.path``. Retorna um valor verdadeiro se todos os arquivos forem compilados com êxito e um valor falso caso contrário.

source: If *skip_curdir* is true (the default), the current directory is not included in the search. All other parameters are passed to the :func:`compile_dir` function. Note that unlike the other compile functions, ``maxlevels`` defaults to ``0``.
pt_br: Se *skip_curdir* for verdadeiro (o padrão), o diretório atual não será incluído na pesquisa. Todos os outros parâmetros são passados para a função :func:`compile_dir`. Note que, ao contrário das outras funções de compilação, ``maxlevels`` é padronizado como ``0``.

source: To force a recompile of all the :file:`.py` files in the :file:`Lib/` subdirectory and all its subdirectories::
pt_br: Para forçar uma recompilação de todos os arquivos :file:`.py` no subdiretório :file:`Lib/` e todos os seus subdiretórios::

source: import compileall compileall.compile_dir('Lib/', force=True) # Perform same compilation, excluding files in .svn directories. import re compileall.compile_dir('Lib/', rx=re.compile(r'[/\\][.]svn'), force=True) # pathlib.Path objects can also be used. import pathlib compileall.compile_dir(pathlib.Path('Lib/'), force=True)
pt_br: import compileall compileall.compile_dir('Lib/', force=True) # Efetua a mesma compilação, excluindo arquivos em diretórios .svn. import re compileall.compile_dir('Lib/', rx=re.compile(r'[/\\][.]svn'), force=True) # Objetos pathlib.Path também podem ser usados. import pathlib compileall.compile_dir(pathlib.Path('Lib/'), force=True)

source: Module :mod:`py_compile`
pt_br: Módulo :mod:`py_compile`

source: Byte-compile a single source file.
pt_br: Compila para bytecode um único arquivo fonte.
