Repository: python/python-docs-pt-br
Catalog: library/concurrent.interpreters.po
Languages: pt_br

source: :mod:`!concurrent.interpreters` --- Multiple interpreters in the same process
pt_br: :mod:`!concurrent.interpreters` --- Múltiplos interpretadores no mesmo processo

source: **Source code:** :source:`Lib/concurrent/interpreters.py`
pt_br: **Código-fonte:** :source:`Lib/concurrent/interpreters.py`

source: Introduction
pt_br: Introdução

source: The :mod:`!concurrent.interpreters` module constructs higher-level interfaces on top of the lower level :mod:`!_interpreters` module.
pt_br: O módulo :mod:`!concurrent.interpreters` constrói interfaces de nível mais alto sobre o módulo de mais baixo nível :mod:`!_interpreters`.

source: how to update an extension module to support multiple interpreters
pt_br: como atualizar um módulo de extensão para oferecer suporte a vários interpretadores

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: Key details
pt_br: Detalhes-chave

source: Before we dive into examples, there are a small number of details to keep in mind about using multiple interpreters:
pt_br: Antes de mergulharmos nos exemplos, há alguns detalhes a serem lembrados sobre o uso de múltiplos interpretadores:

source: isolated, by default
pt_br: isolados, por padrão

source: no implicit threads
pt_br: nenhuma thread implícita

source: not all PyPI packages support use in multiple interpreters yet
pt_br: nem todos os pacotes PyPI oferecem suporte ao uso em múltiplos interpretadores ainda

source: In the context of multiple interpreters, "isolated" means that different interpreters do not share any state. In practice, there is some process-global data they all share, but that is managed by the runtime.
pt_br: No contexto de múltiplos interpretadores, "isolados" significa que diferentes interpretadores não compartilham nenhum estado. Na prática, há alguns dados globais do processo que todos eles compartilham, mas isso é gerenciado pelo tempo de execução.

source: Reference
pt_br: Referência

source: This module defines the following functions:
pt_br: Este módulo define as seguintes funções:

source: Return a :class:`list` of :class:`Interpreter` objects, one for each existing interpreter.
pt_br: Retorna :class:`list` de objetos :class:`Interpreter`, um para cada interpretador existente.

source: Return an :class:`Interpreter` object for the currently running interpreter.
pt_br: Retorna um objeto :class:`Interpreter` para o interpretador em execução no momento.

source: Return an :class:`Interpreter` object for the main interpreter.
pt_br: Retorna um objeto :class:`Interpreter` para o interpretador principal.

source: Initialize a new (idle) Python interpreter and return a :class:`Interpreter` object for it.
pt_br: Inicializa um novo interpretador Python (ocioso) e retorna um objeto :class:`Interpreter` para ele.

source: Interpreter objects
pt_br: Objetos interpretador

source: A single interpreter in the current process.
pt_br: Um único interpretador no processo atual.

source: Generally, :class:`Interpreter` shouldn't be called directly. Instead, use :func:`create` or one of the other module functions.
pt_br: Geralmente, :class:`Interpreter` não deve ser chamado diretamente. Em vez disso, use :func:`create` ou uma das outras funções do módulo.

source: (read-only)
pt_br: (somente leitura)

source: The interpreter's ID.
pt_br: O ID do interpretador.

source: A string describing where the interpreter came from.
pt_br: Uma string descrevendo de onde o interpretador veio.

source: Return ``True`` if the interpreter is currently executing code in its :mod:`!__main__` module and ``False`` otherwise.
pt_br: Retorna ``True`` se o interpretador estiver executando código em seu módulo :mod:`!__main__` e ``False`` caso contrário.

source: Finalize and destroy the interpreter.
pt_br: Finaliza e destrói o interpretador.

source: Bind "shareable" objects in the interpreter's :mod:`!__main__` module.
pt_br: Liga objetos "compartilháveis" no módulo :mod:`!__main__` do interpretador.

source: Run the given source code in the interpreter (in the current thread).
pt_br: Executa o código-fonte fornecido no interpretador (na thread atual).

source: Return the result of calling running the given function in the interpreter (in the current thread).
pt_br: Retorna o resultado da chamada da execução da função fornecida no interpretador (na thread atual).

source: Run the given function in the interpreter (in a new thread).
pt_br: Executa a função fornecida no interpretador (em uma nova thread).

source: Exceptions
pt_br: Exceções

source: This exception, a subclass of :exc:`Exception`, is raised when an interpreter-related error happens.
pt_br: Esta exceção, uma subclasse de :exc:`Exception`, é levantada quando ocorre um erro relacionado ao interpretador.

source: This exception, a subclass of :exc:`InterpreterError`, is raised when the targeted interpreter no longer exists.
pt_br: Esta exceção, uma subclasse de :exc:`InterpreterError`, é levantada quando o interpretador de destino não existe mais.

source: This exception, a subclass of :exc:`InterpreterError`, is raised when the running code raised an uncaught exception.
pt_br: Esta exceção, uma subclasse de :exc:`InterpreterError`, é levantada quando o código em execução levanta uma exceção não capturada.

source: A basic snapshot of the exception raised in the other interpreter.
pt_br: Um snapshot básico da exceção levantada no outro interpretador.

source: This exception, a subclass of :exc:`TypeError`, is raised when an object cannot be sent to another interpreter.
pt_br: Esta exceção, uma subclasse de :exc:`TypeError`, é levantada quando um objeto não pode ser enviado para outro interpretador.

source: Basic usage
pt_br: Uso básico

source: Creating an interpreter and running code in it::
pt_br: Criando um interpretador e executando código nele::

source: from concurrent import interpreters interp = interpreters.create() # Run in the current OS thread. interp.exec('print("spam!")') interp.exec("""if True: print('spam!') """) from textwrap import dedent interp.exec(dedent(""" print('spam!') """)) def run(): print('spam!') interp.call(run) # Run in new OS thread. t = interp.call_in_thread(run) t.join()
pt_br: from concurrent import interpreters interp = interpreters.create() # Executa na thread atual do sistema operacional. interp.exec('print("spam!")') interp.exec("""if True: print('spam!') """) from textwrap import dedent interp.exec(dedent(""" print('spam!') """)) def run(): print('spam!') interp.call(run) # Executa uma nova thread do sistema operacional. t = interp.call_in_thread(run) t.join()
