Repository: python/python-docs-pt-br
Catalog: library/configparser.po
Languages: pt_br

source: ``parser.items()`` is compatible with the mapping protocol (returns a list of *section_name*, *section_proxy* pairs including the DEFAULTSECT). However, this method can also be invoked with arguments: ``parser.items(section, raw, vars)``. The latter call returns a list of *option*, *value* pairs for a specified ``section``, with all interpolations expanded (unless ``raw=True`` is provided).
pt_br: ``parser.items()`` é compatível com o protocolo de mapeamento (retorna uma lista de pares *section_name*, *section_proxy* incluindo o DEFAULTSECT). Entretanto, este método também pode ser invocado com argumentos: ``parser.items(section, raw, vars)``. A última chamada retorna uma lista de pares *option*, *value* para uma ``section`` especificada, com todas as interpolações expandidas (a menos que ``raw=True`` seja fornecido).

source: The mapping protocol is implemented on top of the existing legacy API so that subclasses overriding the original interface still should have mappings working as expected.
pt_br: O protocolo de mapeamento é implementado sobre a API legada existente para que as subclasses que substituem a interface original ainda tenham mapeamentos funcionando conforme o esperado.

source: Customizing Parser Behaviour
pt_br: Personalizando o comportamento do analisador sintático

source: There are nearly as many INI format variants as there are applications using it. :mod:`configparser` goes a long way to provide support for the largest sensible set of INI styles available. The default functionality is mainly dictated by historical background and it's very likely that you will want to customize some of the features.
pt_br: Existem quase tantas variantes de formato INI quanto aplicações que o utilizam. :mod:`configparser` percorre um longo caminho para fornecer suporte para o maior conjunto sensato de estilos INI disponíveis. A funcionalidade padrão é determinada principalmente pelo histórico e é muito provável que você queira personalizar alguns dos recursos.

source: The most common way to change the way a specific config parser works is to use the :meth:`!__init__` options:
pt_br: A maneira mais comum de alterar a forma como um analisador sintático de configuração específico funciona é usar as opções :meth:`!__init__`:

source: *defaults*, default value: ``None``
pt_br: *defaults*, valor padrão: ``None``

source: This option accepts a dictionary of key-value pairs which will be initially put in the ``DEFAULT`` section. This makes for an elegant way to support concise configuration files that don't specify values which are the same as the documented default.
pt_br: Esta opção aceita um dicionário de pares chave-valor que será inicialmente colocado na seção ``DEFAULT``. Isso é uma maneira elegante de oferecer suporte a arquivos de configuração concisos que não especificam valores iguais ao padrão documentado.

source: Hint: if you want to specify default values for a specific section, use :meth:`~ConfigParser.read_dict` before you read the actual file.
pt_br: Dica: se você deseja especificar valores padrão para uma seção específica, use :meth:`~ConfigParser.read_dict` antes de ler o arquivo real.

source: *dict_type*, default value: :class:`dict`
pt_br: *dict_type*, valor padrão: :class:`dict`

source: This option has a major impact on how the mapping protocol will behave and how the written configuration files look. With the standard dictionary, every section is stored in the order they were added to the parser. Same goes for options within sections.
pt_br: Esta opção tem um grande impacto no comportamento do protocolo de mapeamento e na aparência dos arquivos de configuração gravados. Com o dicionário padrão, cada seção é armazenada na ordem em que foram adicionadas ao analisador sintático. O mesmo vale para opções dentro das seções.

source: An alternative dictionary type can be used for example to sort sections and options on write-back.
pt_br: Um tipo de dicionário alternativo pode ser usado, por exemplo, para ordenar as seções e opções ao fazer *write-back*.

source: Please note: there are ways to add a set of key-value pairs in a single operation. When you use a regular dictionary in those operations, the order of the keys will be ordered. For example:
pt_br: Observação: existem maneiras de adicionar um conjunto de pares de valores-chave em uma única operação. Quando você usa um dicionário regular nessas operações, a classificação das chaves será ordenada. Por exemplo:

source: >>> parser = configparser.ConfigParser() >>> parser.read_dict({'section1': {'key1': 'value1', ... 'key2': 'value2', ... 'key3': 'value3'}, ... 'section2': {'keyA': 'valueA', ... 'keyB': 'valueB', ... 'keyC': 'valueC'}, ... 'section3': {'foo': 'x', ... 'bar': 'y', ... 'baz': 'z'} ... }) >>> parser.sections() ['section1', 'section2', 'section3'] >>> [option for option in parser['section3']] ['foo', 'bar', 'baz']
pt_br: >>> parser = configparser.ConfigParser() >>> parser.read_dict({'seção1': {'chave1': 'valor1', ... 'chave2': 'valor2', ... 'chave3': 'valor3'}, ... 'seção2': {'chaveA': 'valorA', ... 'chaveB': 'valorB', ... 'chaveC': 'valorC'}, ... 'seção3': {'foo': 'x', ... 'bar': 'y', ... 'baz': 'z'} ... }) >>> parser.sections() ['seção1', 'seção2', 'seção3'] >>> [option for option in parser['seção3']] ['foo', 'bar', 'baz']

source: *allow_no_value*, default value: ``False``
pt_br: *allow_no_value*, valor padrão: ``False``

source: Some configuration files are known to include settings without values, but which otherwise conform to the syntax supported by :mod:`configparser`. The *allow_no_value* parameter to the constructor can be used to indicate that such values should be accepted:
pt_br: Alguns arquivos de configuração são conhecidos por incluir configurações sem valores, mas que de outra forma estão em conformidade com a sintaxe suportada por :mod:`configparser`. O parâmetro *allow_no_value* para o construtor pode ser usado para indicar que tais valores devem ser aceitos:

source: >>> import configparser >>> sample_config = """ ... [mysqld] ... user = mysql ... pid-file = /var/run/mysqld/mysqld.pid ... skip-external-locking ... old_passwords = 1 ... skip-bdb ... # we don't need ACID today ... skip-innodb ... """ >>> config = configparser.ConfigParser(allow_no_value=True) >>> config.read_string(sample_config) >>> # Settings with values are treated as before: >>> config["mysqld"]["user"] 'mysql' >>> # Settings without values provide None: >>> config["mysqld"]["skip-bdb"] >>> # Settings which aren't specified still raise an error: >>> config["mysqld"]["does-not-exist"] Traceback (most recent call last): ... KeyError: 'does-not-exist'
pt_br: >>> import configparser >>> sample_config = """ ... [mysqld] ... user = mysql ... pid-file = /var/run/mysqld/mysqld.pid ... skip-external-locking ... old_passwords = 1 ... skip-bdb ... # não precisamos de ACID hoje ... skip-innodb ... """ >>> config = configparser.ConfigParser(allow_no_value=True) >>> config.read_string(sample_config) >>> # Configurações com valores são tratados como antes: >>> config["mysqld"]["user"] 'mysql' >>> # Configurações sem valores fornecem None: >>> config["mysqld"]["skip-bdb"] >>> # Configurações que não são especificadas ainda levantam um erro: >>> config["mysqld"]["não-existe"] Traceback (most recent call last): ... KeyError: 'não-existe'

source: *delimiters*, default value: ``('=', ':')``
pt_br: *delimiters*, valor padrão: ``('=', ':')``

source: Delimiters are substrings that delimit keys from values within a section. The first occurrence of a delimiting substring on a line is considered a delimiter. This means values (but not keys) can contain the delimiters.
pt_br: Delimitadores são substrings que delimitam chaves de valores dentro de uma seção. A primeira ocorrência de uma substring delimitadora em uma linha é considerada um delimitador. Isso significa que os valores (mas não as chaves) podem conter os delimitadores.

source: See also the *space_around_delimiters* argument to :meth:`ConfigParser.write`.
pt_br: Veja também o argumento *space_around_delimiters* para :meth:`ConfigParser.write`.

source: *comment_prefixes*, default value: ``('#', ';')``
pt_br: *comment_prefixes*, valor padrão: ``('#', ';')``

source: *inline_comment_prefixes*, default value: ``None``
pt_br: *inline_comment_prefixes*, valor padrão: ``None``

source: Comment prefixes are strings that indicate the start of a valid comment within a config file. *comment_prefixes* are used only on otherwise empty lines (optionally indented) whereas *inline_comment_prefixes* can be used after every valid value (e.g. section names, options and empty lines as well). By default inline comments are disabled and ``'#'`` and ``';'`` are used as prefixes for whole line comments.
pt_br: Prefixos de comentários são strings que indicam o início de um comentário válido em um arquivo de configuração. *comment_prefixes* são usados apenas em linhas vazias (opcionalmente indentadas), enquanto *inline_comment_prefixes* pode ser usado após cada valor válido (por exemplo, nomes de seções, opções e linhas vazias também). Por padrão, os comentários embutidos estão desabilitados e ``'#'`` e ``';'`` são usados como prefixos para comentários de linha inteira.

source: In previous versions of :mod:`configparser` behaviour matched ``comment_prefixes=('#',';')`` and ``inline_comment_prefixes=(';',)``.
pt_br: Nas versões anteriores do :mod:`configparser`, o comportamento correspondia a ``comment_prefixes=('#',';')`` e ``inline_comment_prefixes=(';',)``.

source: Please note that config parsers don't support escaping of comment prefixes so using *inline_comment_prefixes* may prevent users from specifying option values with characters used as comment prefixes. When in doubt, avoid setting *inline_comment_prefixes*. In any circumstances, the only way of storing comment prefix characters at the beginning of a line in multiline values is to interpolate the prefix, for example::
pt_br: Observe que os analisadores sintáticos de configuração não oferecem suporte a escape de prefixos de comentários, portanto, usar *inline_comment_prefixes* pode impedir que os usuários especifiquem valores de opção com caracteres usados como prefixos de comentários. Em caso de dúvida, evite definir *inline_comment_prefixes*. Em qualquer circunstância, a única maneira de armazenar caracteres de prefixo de comentário no início de uma linha em valores multilinha é interpolar o prefixo, por exemplo::

source: >>> from configparser import ConfigParser, ExtendedInterpolation >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> # the default BasicInterpolation could be used as well >>> parser.read_string(""" ... [DEFAULT] ... hash = # ... ... [hashes] ... shebang = ... ${hash}!/usr/bin/env python ... ${hash} -*- coding: utf-8 -*- ... ... extensions = ... enabled_extension ... another_extension ... #disabled_by_comment ... yet_another_extension ... ... interpolation not necessary = if # is not at line start ... even in multiline values = line #1 ... line #2 ... line #3 ... """) >>> print(parser['hashes']['shebang']) #!/usr/bin/env python # -*- coding: utf-8 -*- >>> print(parser['hashes']['extensions']) enabled_extension another_extension yet_another_extension >>> print(parser['hashes']['interpolation not necessary']) if # is not at line start >>> print(parser['hashes']['even in multiline values']) line #1 line #2 line #3
pt_br: >>> from configparser import ConfigParser, ExtendedInterpolation >>> parser = ConfigParser(interpolation=ExtendedInterpolation()) >>> # a BasicInterpolation padrão poderia ser usada também >>> parser.read_string(""" ... [DEFAULT] ... hash = # ... ... [hashes] ... shebang = ... ${hash}!/usr/bin/env python ... ${hash} -*- coding: utf-8 -*- ... ... extensões = ... extensão_habilitada ... outra_extensão ... #desabilitada_por_comentário ... e_mais_uma_extensão ... ... interpolação não necessária = se # não estiver no início da linha ... mesmo em valores multilinha = linha #1 ... linha #2 ... linha #3 ... """) >>> print(parser['hashes']['shebang']) #!/usr/bin/env python # -*- coding: utf-8 -*- >>> print(parser['hashes']['extensões']) extensão_habilitada outra_extensão e_mais_uma_extensão >>> print(parser['hashes']['interpolação não necessária']) se # não estiver no início da linha >>> print(parser['hashes']['mesmo em valores multilinha']) linha #1 linha #2 linha #3

source: *strict*, default value: ``True``
pt_br: *strict*, valor padrão: ``True``

source: When set to ``True``, the parser will not allow for any section or option duplicates while reading from a single source (using :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` or :meth:`~ConfigParser.read_dict`). It is recommended to use strict parsers in new applications.
pt_br: Ao definir como ``True``, o analisador sintático não permitirá nenhuma seção ou opção duplicada durante a leitura de uma única fonte (usando :meth:`~ConfigParser.read_file`, :meth:`~ConfigParser.read_string` ou :meth:`~ConfigParser.read_dict`). Recomenda-se usar analisadores sintáticos estritos em novas aplicações.

source: In previous versions of :mod:`configparser` behaviour matched ``strict=False``.
pt_br: Nas versões anteriores do :mod:`configparser`, o comportamento correspondia a ``strict=False``.

source: *empty_lines_in_values*, default value: ``True``
pt_br: *empty_lines_in_values*, valor padrão: ``True``

source: In config parsers, values can span multiple lines as long as they are indented more than the key that holds them. By default parsers also let empty lines to be parts of values. At the same time, keys can be arbitrarily indented themselves to improve readability. In consequence, when configuration files get big and complex, it is easy for the user to lose track of the file structure. Take for instance:
pt_br: Em analisadores sintáticos de configuração, os valores podem abranger várias linhas, desde que sejam mais indentados do que a chave que os contém. Por padrão, os analisadores sintáticos também permitem que linhas vazias façam parte de valores. Ao mesmo tempo, as chaves podem ser indentados arbitrariamente para melhorar a legibilidade. Consequentemente, quando os arquivos de configuração ficam grandes e complexos, é fácil para o usuário perder o controle da estrutura do arquivo. Tomemos por exemplo:

source: [Section] key = multiline value with a gotcha this = is still a part of the multiline value of 'key'
pt_br: [Seção] chave = multilinha valor com uma pegadinha esta = ainda é parte do valor multilinha de 'chave'

source: This can be especially problematic for the user to see if she's using a proportional font to edit the file. That is why when your application does not need values with empty lines, you should consider disallowing them. This will make empty lines split keys every time. In the example above, it would produce two keys, ``key`` and ``this``.
pt_br: Isso pode ser especialmente problemático para o usuário ver se está usando uma fonte proporcional para editar o arquivo. É por isso que quando sua aplicação não precisa de valores com linhas vazias, você deve considerar proibi-los. Isso fará com que as linhas vazias dividam as chaves sempre. No exemplo acima, seriam produzidas duas chaves, ``key`` e ``this``.

source: *default_section*, default value: ``configparser.DEFAULTSECT`` (that is: ``"DEFAULT"``)
pt_br: *default_section*, valor padrão: ``configparser.DEFAULTSECT`` (isto é: ``"DEFAULT"``)

source: The convention of allowing a special section of default values for other sections or interpolation purposes is a powerful concept of this library, letting users create complex declarative configurations. This section is normally called ``"DEFAULT"`` but this can be customized to point to any other valid section name. Some typical values include: ``"general"`` or ``"common"``. The name provided is used for recognizing default sections when reading from any source and is used when writing configuration back to a file. Its current value can be retrieved using the ``parser_instance.default_section`` attribute and may be modified at runtime (i.e. to convert files from one format to another).
pt_br: A convenção de permitir uma seção especial de valores padrão para outras seções ou fins de interpolação é um conceito poderoso desta biblioteca, permitindo aos usuários criar configurações declarativas complexas. Esta seção normalmente é chamada de ``"DEFAULT"``, mas pode ser personalizada para apontar para qualquer outro nome de seção válido. Alguns valores típicos incluem: ``"general"`` ou ``"common"``. O nome fornecido é usado para reconhecer seções padrão ao ler de qualquer fonte e é usado ao gravar a configuração em um arquivo. Seu valor atual pode ser recuperado usando o atributo ``parser_instance.default_section`` e pode ser modificado em tempo de execução (ou seja, para converter arquivos de um formato para outro).

source: *interpolation*, default value: ``configparser.BasicInterpolation``
pt_br: *interpolation*, valor padrão: ``configparser.BasicInterpolation``

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_. :class:`RawConfigParser` has a default value of ``None``.
pt_br: O comportamento de interpolação pode ser personalizado fornecendo um manipulador personalizado por meio do argumento *interpolation*. ``None`` pode ser usado para desligar completamente a interpolação, ``ExtendedInterpolation()`` fornece uma variante mais avançada inspirada em ``zc.buildout``. Mais sobre o assunto na `seção de documentação dedicada <#interpolation-of-values>`_. :class:`RawConfigParser` tem um valor padrão de ``None``.

source: *converters*, default value: not set
pt_br: *converters*, valor padrão: não definido

source: Config parsers provide option value getters that perform type conversion. By default :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat`, and :meth:`~ConfigParser.getboolean` are implemented. Should other getters be desirable, users may define them in a subclass or pass a dictionary where each key is a name of the converter and each value is a callable implementing said conversion. For instance, passing ``{'decimal': decimal.Decimal}`` would add :meth:`!getdecimal` on both the parser object and all section proxies. In other words, it will be possible to write both ``parser_instance.getdecimal('section', 'key', fallback=0)`` and ``parser_instance['section'].getdecimal('key', 0)``.
pt_br: Os analisadores sintáticos de configuração fornecem getters de valor de opção que realizam conversão de tipo. Por padrão, :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` e :meth:`~ConfigParser.getboolean` são implementados. Caso outros getters sejam desejáveis, os usuários podem defini-los em uma subclasse ou passar um dicionário onde cada chave é um nome do conversor e cada valor é um chamável que implementa a referida conversão. Por exemplo, passar ``{'decimal': decimal.Decimal}`` adicionaria :meth:`!getdecimal` no objeto analisador sintático e em todos os proxies de seção. Em outras palavras, será possível escrever ``parser_instance.getdecimal('section', 'key', fallback=0)`` e ``parser_instance['section'].getdecimal('key', 0)``.

source: If the converter needs to access the state of the parser, it can be implemented as a method on a config parser subclass. If the name of this method starts with ``get``, it will be available on all section proxies, in the dict-compatible form (see the ``getdecimal()`` example above).
pt_br: Se o conversor precisar acessar o estado do analisador sintático, ele poderá ser implementado como um método em uma subclasse do analisador sintático de configuração. Se o nome deste método começar com ``get``, ele estará disponível em todos os intermediários de seção, na forma compatível com dict (veja o exemplo ``getdecimal()`` acima).

source: More advanced customization may be achieved by overriding default values of these parser attributes. The defaults are defined on the classes, so they may be overridden by subclasses or by attribute assignment.
pt_br: Uma personalização mais avançada pode ser obtida substituindo os valores padrão desses atributos do analisador sintático. Os padrões são definidos nas classes, portanto podem ser substituídos por subclasses ou por atribuição de atributos.

source: By default when using :meth:`~ConfigParser.getboolean`, config parsers consider the following values ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` and the following values ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. You can override this by specifying a custom dictionary of strings and their Boolean outcomes. For example:
pt_br: Por padrão, ao usar :meth:`~ConfigParser.getboolean`, os analisadores sintáticos de configuração consideram os seguintes valores ``True``: ``'1'``, ``'yes'``, ``'true'``, ``'on'`` e os seguintes valores ``False``: ``'0'``, ``'no'``, ``'false'``, ``'off'``. Você pode substituir isso especificando um dicionário personalizado de strings e seus resultados booleanos. Por exemplo:

source: >>> custom = configparser.ConfigParser() >>> custom['section1'] = {'funky': 'nope'} >>> custom['section1'].getboolean('funky') Traceback (most recent call last): ... ValueError: Not a boolean: nope >>> custom.BOOLEAN_STATES = {'sure': True, 'nope': False} >>> custom['section1'].getboolean('funky') False
pt_br: >>> custom = configparser.ConfigParser() >>> custom['seção1'] = {'funky': 'nope'} >>> custom['seção1'].getboolean('funky') Traceback (most recent call last): ... ValueError: Not a boolean: nope >>> custom.BOOLEAN_STATES = {'sure': True, 'nope': False} >>> custom['seção1'].getboolean('funky') False

source: Other typical Boolean pairs include ``accept``/``reject`` or ``enabled``/``disabled``.
pt_br: Outros pares booleanos típicos incluem ``accept``/``reject`` ou ``enabled``/``disabled``.

source: This method transforms option names on every read, get, or set operation. The default converts the name to lowercase. This also means that when a configuration file gets written, all keys will be lowercase. Override this method if that's unsuitable. For example:
pt_br: Este método transforma nomes de opções em cada operação de leitura, obtenção ou definição. O padrão converte o nome em letras minúsculas. Isso também significa que quando um arquivo de configuração for gravado, todas as chaves estarão em letras minúsculas. Substitua esse método se for inadequado. Por exemplo:

source: >>> config = """ ... [Section1] ... Key = Value ... ... [Section2] ... AnotherKey = Value ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> list(typical['Section1'].keys()) ['key'] >>> list(typical['Section2'].keys()) ['anotherkey'] >>> custom = configparser.RawConfigParser() >>> custom.optionxform = lambda option: option >>> custom.read_string(config) >>> list(custom['Section1'].keys()) ['Key'] >>> list(custom['Section2'].keys()) ['AnotherKey']
pt_br: >>> config = """ ... [Seção1] ... Chave = Valor ... ... [Seção2] ... OutraChave = Valor ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> list(typical['Seção1'].keys()) ['chave'] >>> list(typical['Seção2'].keys()) ['outrachave'] >>> custom = configparser.RawConfigParser() >>> custom.optionxform = lambda option: option >>> custom.read_string(config) >>> list(custom['Seção1'].keys()) ['Chave'] >>> list(custom['Seção2'].keys()) ['OutraChave']
