Repository: python/python-docs-pt-br
Catalog: library/configparser.po
Languages: pt_br

source: :mod:`!configparser` --- Configuration file parser
pt_br: :mod:`!configparser` --- Analisador sintático de arquivo de configuração

source: **Source code:** :source:`Lib/configparser.py`
pt_br: **Código-fonte:** :source:`Lib/configparser.py`

source: This module provides the :class:`ConfigParser` class which implements a basic configuration language which provides a structure similar to what's found in Microsoft Windows INI files. You can use this to write Python programs which can be customized by end users easily.
pt_br: Este módulo fornece a classe :class:`ConfigParser` que implementa uma linguagem de configuração básica que fornece uma estrutura semelhante à encontrada nos arquivos INI do Microsoft Windows. Você pode usar isso para escrever programas Python que podem ser facilmente personalizados pelos usuários finais.

source: This library does *not* interpret or write the value-type prefixes used in the Windows Registry extended version of INI syntax.
pt_br: Esta biblioteca *não* interpreta nem escreve os prefixos de tipo de valor usados na versão estendida do Registro do Windows da sintaxe INI.

source: Module :mod:`tomllib`
pt_br: Módulo :mod:`tomllib`

source: TOML is a well-specified format for application configuration files. It is specifically designed to be an improved version of INI.
pt_br: TOML é um formato bem especificado para arquivos de configuração de aplicações. Ele foi projetado especificamente para ser uma versão melhorada do INI.

source: Module :mod:`shlex`
pt_br: Módulo :mod:`shlex`

source: Support for creating Unix shell-like mini-languages which can also be used for application configuration files.
pt_br: Suporte para criação de minilinguagens semelhantes a shell Unix que também podem ser usadas para arquivos de configuração de aplicações.

source: Module :mod:`json`
pt_br: Módulo :mod:`json`

source: The ``json`` module implements a subset of JavaScript syntax which is sometimes used for configuration, but does not support comments.
pt_br: O módulo ``json`` implementa um subconjunto de sintaxe JavaScript que às vezes é usado para configuração, mas não suporta comentários.

source: Quick Start
pt_br: Início rápido

source: Let's take a very basic configuration file that looks like this:
pt_br: Vamos pegar um arquivo de configuração bem básico parecido com este:

source: The structure of INI files is described `in the following section <#supported-ini-file-structure>`_. Essentially, the file consists of sections, each of which contains keys with values. :mod:`configparser` classes can read and write such files. Let's start by creating the above configuration file programmatically.
pt_br: A estrutura dos arquivos INI é descrita `na seção seguinte <#supported-ini-file-structure>`_. Essencialmente, o arquivo consiste em seções, cada uma contendo chaves com valores. As classes :mod:`configparser` podem ler e escrever tais arquivos. Vamos começar criando o arquivo de configuração acima programaticamente.

source: As you can see, we can treat a config parser much like a dictionary. There are differences, `outlined later <#mapping-protocol-access>`_, but the behavior is very close to what you would expect from a dictionary.
pt_br: Como você pode ver, podemos tratar um analisador sintático de configuração como um dicionário. Existem diferenças, `descritas posteriormente <#mapping-protocol-access>`_, mas o comportamento é muito próximo do que você esperaria de um dicionário.

source: Now that we have created and saved a configuration file, let's read it back and explore the data it holds.
pt_br: Agora que criamos e salvamos um arquivo de configuração, vamos lê-lo e explorar os dados que ele contém.

source: As we can see above, the API is pretty straightforward. The only bit of magic involves the ``DEFAULT`` section which provides default values for all other sections [1]_. Note also that keys in sections are case-insensitive and stored in lowercase [1]_.
pt_br: Como podemos ver acima, a API é bastante simples. A única mágica envolve a seção ``DEFAULT`` que fornece valores padrão para todas as outras seções [1]_. Observe também que as chaves nas seções não diferenciam maiúsculas de minúsculas e são armazenadas em letras minúsculas [1]_.

source: It is possible to read several configurations into a single :class:`ConfigParser`, where the most recently added configuration has the highest priority. Any conflicting keys are taken from the more recent configuration while the previously existing keys are retained. The example below reads in an ``override.ini`` file, which will override any conflicting keys from the ``example.ini`` file.
pt_br: É possível ler diversas configurações para um único :class:`ConfigParser`, onde a configuração adicionada mais recentemente terá a maior prioridade. Para quaisquer chaves repetidas serão usados os valores da configuração mais recente, enquanto os valores das chaves anteriores serão ignorados. O exemplo a seguir lê um arquivo chamado ``override.ini``, que irá substituir chaves repetidas do arquivo ``example.ini``.

source: This behaviour is equivalent to a :meth:`ConfigParser.read` call with several files passed to the *filenames* parameter.
pt_br: Este comportamento é equivalente a uma chamada :meth:`ConfigParser.read` com vários arquivos passados para o parâmetro *filenames*.

source: Supported Datatypes
pt_br: Tipos de dados suportados

source: Config parsers do not guess datatypes of values in configuration files, always storing them internally as strings. This means that if you need other datatypes, you should convert on your own:
pt_br: Os analisadores sintáticos de configuração não adivinham os tipos de dados dos valores nos arquivos de configuração, sempre os armazenando internamente como strings. Isso significa que se você precisar de outros tipos de dados, deverá converter por conta própria:

source: Since this task is so common, config parsers provide a range of handy getter methods to handle integers, floats and booleans. The last one is the most interesting because simply passing the value to ``bool()`` would do no good since ``bool('False')`` is still ``True``. This is why config parsers also provide :meth:`~ConfigParser.getboolean`. This method is case-insensitive and recognizes Boolean values from ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'``/``'false'`` and ``'1'``/``'0'`` [1]_. For example:
pt_br: Como essa tarefa é tão comum, os analisadores sintáticos de configuração fornecem uma variedade de métodos getter úteis para manipular com números inteiros, pontos flutuantes e booleanos. O último é o mais interessante porque simplesmente passar o valor para ``bool()`` não adiantaria nada já que ``bool('False')`` ainda é ``True``. É por isso que os analisadores sintáticos de configuração também fornecem :meth:`~ConfigParser.getboolean`. Este método não diferencia maiúsculas de minúsculas e reconhece valores booleanos de ``'yes'``/``'no'``, ``'on'``/``'off'``, ``'true'`` /``'false'`` e ``'1'``/``'0'`` [1]_. Por exemplo:

source: Apart from :meth:`~ConfigParser.getboolean`, config parsers also provide equivalent :meth:`~ConfigParser.getint` and :meth:`~ConfigParser.getfloat` methods. You can register your own converters and customize the provided ones. [1]_
pt_br: Além de :meth:`~ConfigParser.getboolean`, os analisadores sintáticos de configuração também fornecem métodos :meth:`~ConfigParser.getint` e :meth:`~ConfigParser.getfloat` equivalentes. Você pode registrar seus próprios conversores e personalizar os fornecidos. [1]_

source: Fallback Values
pt_br: Valores reservas

source: As with a dictionary, you can use a section's :meth:`~ConfigParser.get` method to provide fallback values:
pt_br: Assim como acontece com um dicionário, você pode usar o método :meth:`~ConfigParser.get` de uma seção para fornecer valores reservas (fallback):

source: Please note that default values have precedence over fallback values. For instance, in our example the ``'CompressionLevel'`` key was specified only in the ``'DEFAULT'`` section. If we try to get it from the section ``'topsecret.server.example'``, we will always get the default, even if we specify a fallback:
pt_br: Observe que os valores padrão têm precedência sobre os valores substitutos. Por exemplo, em nosso exemplo a chave ``'CompressionLevel'`` foi especificada apenas na seção ``'DEFAULT'``. Se tentarmos obtê-lo na seção ``'topsecret.server.example'``, sempre obteremos o padrão, mesmo se especificarmos um substituto:

source: One more thing to be aware of is that the parser-level :meth:`~ConfigParser.get` method provides a custom, more complex interface, maintained for backwards compatibility. When using this method, a fallback value can be provided via the ``fallback`` keyword-only argument:
pt_br: Mais uma coisa a ter em conta é que o método :meth:`~ConfigParser.get` no nível do analisador fornece uma interface personalizada e mais complexa, mantida para compatibilidade com versões anteriores. Ao usar este método, um valor substituto pode ser fornecido através do argumento somente-nomeado ``fallback``:

source: The same ``fallback`` argument can be used with the :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` and :meth:`~ConfigParser.getboolean` methods, for example:
pt_br: O mesmo argumento ``fallback`` pode ser usado com os métodos :meth:`~ConfigParser.getint`, :meth:`~ConfigParser.getfloat` e :meth:`~ConfigParser.getboolean`, por exemplo:

source: Supported INI File Structure
pt_br: Estrutura dos arquivos INI

source: A configuration file consists of sections, each led by a ``[section]`` header, followed by key/value entries separated by a specific string (``=`` or ``:`` by default [1]_). By default, section names are case sensitive but keys are not [1]_. Leading and trailing whitespace is removed from keys and values. Values can be omitted if the parser is configured to allow it [1]_, in which case the key/value delimiter may also be left out. Values can also span multiple lines, as long as they are indented deeper than the first line of the value. Depending on the parser's mode, blank lines may be treated as parts of multiline values or ignored.
pt_br: Um arquivo de configuração consiste em seções, cada uma liderada por um cabeçalho ``[section]``, seguido por entradas de chave/valor separadas por uma string específica (``=`` ou ``:`` por padrão [1]_) . Por padrão, os nomes das seções diferenciam maiúsculas de minúsculas, mas as chaves não [1]_. Os espaços em branco à esquerda e à direita são removidos das chaves e dos valores. Os valores podem ser omitidos se o analisador sintático estiver configurado para permitir [1]_, caso em que o delimitador chave/valor também pode ser omitido. Os valores também podem abranger várias linhas, desde que sejam indentados de forma mais profunda que a primeira linha do valor. Dependendo do modo do analisador sintático, as linhas em branco podem ser tratadas como partes de valores multilinhas ou ignoradas.

source: By default, a valid section name can be any string that does not contain '\\n'. To change this, see :attr:`ConfigParser.SECTCRE`.
pt_br: Por padrão, um nome de seção válido pode ser qualquer string que não contenha '\\n'. Para alterar isso, consulte :attr:`ConfigParser.SECTCRE`.

source: The first section name may be omitted if the parser is configured to allow an unnamed top level section with ``allow_unnamed_section=True``. In this case, the keys/values may be retrieved by :const:`UNNAMED_SECTION` as in ``config[UNNAMED_SECTION]``.
pt_br: O nome da primeira seção pode ser omitido se o analisador sintático estiver configurado para permitir uma seção de nível superior sem nome com ``allow_unnamed_section=True``. Neste caso, as chaves/valores podem ser recuperadas por :const:`UNNAMED_SECTION` como em ``config[UNNAMED_SECTION]``.

source: Configuration files may include comments, prefixed by specific characters (``#`` and ``;`` by default [1]_). Comments may appear on their own on an otherwise empty line, possibly indented. [1]_
pt_br: Os arquivos de configuração podem incluir comentários, prefixados por caracteres específicos (``#`` e ``;`` por padrão [1]_). Os comentários podem aparecer sozinhos em uma linha vazia, possivelmente indentados. [1]_

source: For example:
pt_br: Por exemplo:

source: [Simple Values] key=value spaces in keys=allowed spaces in values=allowed as well spaces around the delimiter = obviously you can also use : to delimit keys from values [All Values Are Strings] values like this: 1000000 or this: 3.14159265359 are they treated as numbers? : no integers, floats and booleans are held as: strings can use the API to get converted values directly: true [Multiline Values] chorus: I'm a lumberjack, and I'm okay I sleep all night and I work all day [No Values] key_without_value empty string value here = [You can use comments] # like this ; or this # By default only in an empty line. # Inline comments can be harmful because they prevent users # from using the delimiting characters as parts of values. # That being said, this can be customized. [Sections Can Be Indented] can_values_be_as_well = True does_that_mean_anything_special = False purpose = formatting for readability multiline_values = are handled just fine as long as they are indented deeper than the first line of a value # Did I mention we can indent comments, too?
pt_br: [Valores Simples] chave=valor espaços nas chaves=permitidos espaços nos valores=permitidos também espaços em volta do delimitador = obviamente você também pode usar : para delimitar chaves de valores [Todos Valores São Strings] valores como este: 1000000 ou este: 3.14159265359 são tratados como números? : não inteiros, pontos flutuantes e booleanos são considerados: strings pode usar a API para obter valores convertidos diretamente: verdadeiro [Valores multilinha] chorus: Eu sou um lenhador e estou bem Durmo a noite toda e trabalho o dia inteiro [Sem valores] chave_sem_valor valor string vazia aqui = [Você pode usar comentários] # como este ; ou este # Por padrão, apenas em uma linha vazia. # Comentários em linha podem ser prejudiciais porque eles # impedem os usuários de usar os caracteres delimitadores # como partes dos valores. # Isto posto, isso pode ser personalizado. [Seções Podem Ser Indentadas] podem_ser_valores_também = True isso_significa_algo_especial = False propósito = formatação para legibilidade valores_multilinha = são tratados sem problemas desde que eles estejam indentados mais profundamente do que a primeira linha de um valor # Mencionamos que também podemos indentar comentários?

source: Unnamed Sections
pt_br: Seções não nomeadas

source: The name of the first section (or unique) may be omitted and values retrieved by the :const:`UNNAMED_SECTION` attribute.
pt_br: O nome da primeira seção (ou único) pode ser omitido e os valores recuperados pelo atributo :const:`UNNAMED_SECTION`.

source: Interpolation of values
pt_br: Interpolação de valores

source: On top of the core functionality, :class:`ConfigParser` supports interpolation. This means values can be preprocessed before returning them from ``get()`` calls.
pt_br: Além da funcionalidade principal, :class:`ConfigParser` oferece suporte a interpolação. Isso significa que os valores podem ser pré-processados antes de retorná-los das chamadas ``get()``.

source: The default implementation used by :class:`ConfigParser`. It enables values to contain format strings which refer to other values in the same section, or values in the special default section [1]_. Additional default values can be provided on initialization.
pt_br: A implementação padrão usada por :class:`ConfigParser`. Ele permite que os valores contenham strings de formato que se referem a outros valores na mesma seção ou valores na seção padrão especial [1]_. Valores padrão adicionais podem ser fornecidos na inicialização.

source: [Paths] home_dir: /Users my_dir: %(home_dir)s/lumberjack my_pictures: %(my_dir)s/Pictures [Escape] # use a %% to escape the % sign (% is the only character that needs to be escaped): gain: 80%%
pt_br: [Paths] home_dir: /Users my_dir: %(home_dir)s/lumberjack my_pictures: %(my_dir)s/Pictures [Escape] # use um %% para escapar o sinal de % (% é o único caractere que precisa ser escapado): gain: 80%%

source: In the example above, :class:`ConfigParser` with *interpolation* set to ``BasicInterpolation()`` would resolve ``%(home_dir)s`` to the value of ``home_dir`` (``/Users`` in this case). ``%(my_dir)s`` in effect would resolve to ``/Users/lumberjack``. All interpolations are done on demand so keys used in the chain of references do not have to be specified in any specific order in the configuration file.
pt_br: No exemplo acima, :class:`ConfigParser` com *interpolation* definido como ``BasicInterpolation()`` resolveria ``%(home_dir)s`` para o valor de ``home_dir`` (``/Users`` neste caso). ``%(my_dir)s`` na verdade resolveria para ``/Users/lumberjack``. Todas as interpolações são feitas sob demanda, portanto as chaves usadas na cadeia de referências não precisam ser especificadas em nenhuma ordem específica no arquivo de configuração.

source: With ``interpolation`` set to ``None``, the parser would simply return ``%(my_dir)s/Pictures`` as the value of ``my_pictures`` and ``%(home_dir)s/lumberjack`` as the value of ``my_dir``.
pt_br: Com ``interpolation`` definido como ``None``, o analisador sintático simplesmente retornaria ``%(my_dir)s/Pictures`` como o valor de ``my_pictures`` e ``%(home_dir)s/lumberjack`` como o valor de ``my_dir``.

source: An alternative handler for interpolation which implements a more advanced syntax, used for instance in ``zc.buildout``. Extended interpolation is using ``${section:option}`` to denote a value from a foreign section. Interpolation can span multiple levels. For convenience, if the ``section:`` part is omitted, interpolation defaults to the current section (and possibly the default values from the special section).
pt_br: Um manipulador alternativo para interpolação que implementa uma sintaxe mais avançada, usada, por exemplo, em ``zc.buildout``. A interpolação estendida usa ``${section:option}`` para denotar um valor de uma seção estrangeira. A interpolação pode abranger vários níveis. Por conveniência, se a parte ``section:`` for omitida, a interpolação será padronizada para a seção atual (e possivelmente para os valores padrão da seção especial).

source: For example, the configuration specified above with basic interpolation, would look like this with extended interpolation:
pt_br: Por exemplo, a configuração especificada acima com interpolação básica ficaria assim com interpolação estendida:

source: [Paths] home_dir: /Users my_dir: ${home_dir}/lumberjack my_pictures: ${my_dir}/Pictures [Escape] # use a $$ to escape the $ sign ($ is the only character that needs to be escaped): cost: $$80
pt_br: [Paths] home_dir: /Users my_dir: ${home_dir}/lumberjack my_pictures: ${my_dir}/Pictures [Escape] # use a $$ para escapar o sinal de $ ($ é o único caractere que precisa ser escapado): cost: $$80

source: Values from other sections can be fetched as well:
pt_br: Valores de outras seções também podem ser obtidos:

source: Mapping Protocol Access
pt_br: Acesso através do protocolo de mapeamento

source: Mapping protocol access is a generic name for functionality that enables using custom objects as if they were dictionaries. In case of :mod:`configparser`, the mapping interface implementation is using the ``parser['section']['option']`` notation.
pt_br: Acesso através do protocolo de mapeamento é um nome genérico para funcionalidade que permite usar objetos personalizados como se fossem dicionários. No caso de :mod:`configparser`, a implementação da interface de mapeamento está usando a notação ``parser['section']['option']``.

source: ``parser['section']`` in particular returns a proxy for the section's data in the parser. This means that the values are not copied but they are taken from the original parser on demand. What's even more important is that when values are changed on a section proxy, they are actually mutated in the original parser.
pt_br: ``parser['section']`` em particular retorna um intermediário para os dados da seção no analisador sintático. Isso significa que os valores não são copiados, mas obtidos do analisador sintático original sob demanda. O que é ainda mais importante é que quando os valores são alterados em um intermediário de seção, eles são, na verdade, modificados no analisador sintático original.

source: :mod:`configparser` objects behave as close to actual dictionaries as possible. The mapping interface is complete and adheres to the :class:`~collections.abc.MutableMapping` ABC. However, there are a few differences that should be taken into account:
pt_br: Os objetos :mod:`configparser` se comportam o mais próximo possível dos dicionários reais. A interface de mapeamento é completa e segue a ABC :class:`~collections.abc.MutableMapping`. No entanto, existem algumas diferenças que devem ser levadas em consideração:

source: By default, all keys in sections are accessible in a case-insensitive manner [1]_. E.g. ``for option in parser["section"]`` yields only ``optionxform``'ed option key names. This means lowercased keys by default. At the same time, for a section that holds the key ``'a'``, both expressions return ``True``::
pt_br: Por padrão, todas as chaves nas seções são acessíveis sem distinção entre maiúsculas e minúsculas [1]_. Por exemplo. ``for option in parser["section"]`` produz apenas nomes de chaves de opção ``optionxform``\ ada. Isso significa chaves em letras minúsculas por padrão. Ao mesmo tempo, para uma seção que contém a chave ``'a'``, ambas as expressões retornam ``True``::

source: All sections include ``DEFAULTSECT`` values as well which means that ``.clear()`` on a section may not leave the section visibly empty. This is because default values cannot be deleted from the section (because technically they are not there). If they are overridden in the section, deleting causes the default value to be visible again. Trying to delete a default value causes a :exc:`KeyError`.
pt_br: Todas as seções também incluem valores ``DEFAULTSECT``, o que significa que ``.clear()`` em uma seção não pode deixá-la visivelmente vazia. Isso ocorre porque os valores padrão não podem ser excluídos da seção (porque tecnicamente eles não estão lá). Se eles forem substituídos na seção, a exclusão fará com que o valor padrão fique visível novamente. Tentar excluir um valor padrão causa um :exc:`KeyError`.

source: ``DEFAULTSECT`` cannot be removed from the parser:
pt_br: ``DEFAULTSECT`` não pode ser removido do analisador sintático:

source: trying to delete it raises :exc:`ValueError`,
pt_br: tentar excluí-lo levanta :exc:`ValueError`,

source: ``parser.clear()`` leaves it intact,
pt_br: ``parser.clear()`` deixa-o intacto,

source: ``parser.popitem()`` never returns it.
pt_br: ``parser.popitem()`` nunca o retorna.

source: ``parser.get(section, option, **kwargs)`` - the second argument is **not** a fallback value. Note however that the section-level ``get()`` methods are compatible both with the mapping protocol and the classic configparser API.
pt_br: ``parser.get(section, option, **kwargs)`` - o segundo argumento **não** é um valor substituto. Observe, entretanto, que os métodos ``get()`` em nível de seção são compatíveis tanto com o protocolo de mapeamento quanto com a API clássica do configparser.
