Repository: python/python-docs-pt-br
Catalog: library/configparser.po
Languages: pt_br

source: Get an *option* value for the named *section*. If *vars* is provided, it must be a dictionary. The *option* is looked up in *vars* (if provided), *section*, and in *DEFAULTSECT* in that order. If the key is not found and *fallback* is provided, it is used as a fallback value. ``None`` can be provided as a *fallback* value.
pt_br: Obtém um valor de *option* para a *section* nomeada. Se *vars* for fornecido, deverá ser um dicionário. A *option* é pesquisada em *vars* (se fornecido), *section* e em *DEFAULTSECT* nesta ordem. Se a chave não for encontrada e *fallback* for fornecido, ele será usado como um valor alternativo. ``None`` pode ser fornecido como um valor *fallback*.

source: All the ``'%'`` interpolations are expanded in the return values, unless the *raw* argument is true. Values for interpolation keys are looked up in the same manner as the option.
pt_br: Todas as interpolações ``'%'`` são expandidas nos valores de retorno, a menos que o argumento *raw* seja verdadeiro. Os valores das chaves de interpolação são consultados da mesma maneira que a opção.

source: Arguments *raw*, *vars* and *fallback* are keyword only to protect users from trying to use the third argument as the *fallback* fallback (especially when using the mapping protocol).
pt_br: Os argumentos *raw*, *vars* e *fallback* são palavras somente-nomeadas para proteger os usuários de tentarem usar o terceiro argumento como substituto *fallback* (especialmente ao usar o protocolo de mapeamento).

source: A convenience method which coerces the *option* in the specified *section* to an integer. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
pt_br: Um método de conveniência que força a *option* na *section* especificada ser um número inteiro. Veja :meth:`get` para explicação de *raw*, *vars* e *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a floating-point number. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
pt_br: Um método de conveniência que força a *option* na *section* especificada ser um número de ponto flutuante. Veja :meth:`get` para explicação de *raw*, *vars* e *fallback*.

source: A convenience method which coerces the *option* in the specified *section* to a Boolean value. Note that the accepted values for the option are ``'1'``, ``'yes'``, ``'true'``, and ``'on'``, which cause this method to return ``True``, and ``'0'``, ``'no'``, ``'false'``, and ``'off'``, which cause it to return ``False``. These string values are checked in a case-insensitive manner. Any other value will cause it to raise :exc:`ValueError`. See :meth:`get` for explanation of *raw*, *vars* and *fallback*.
pt_br: Um método de conveniência que força a *option* na *section* especificada a um valor booleano. Observe que os valores aceitos para a opção são ``'1'``, ``'yes'``, ``'true'``, e ``'on'``, o que fazem com que este método retorne ``True``, e ``'0'``, ``'no'``, ``'false'``, e ``'off'``, o que fazem com que ele retorne ``False``. Esses valores de string são verificados sem distinção entre maiúsculas e minúsculas. Qualquer outro valor fará com que ele levante :exc:`ValueError`. Veja :meth:`get` para explicação de *raw*, *vars* e *fallback*.

source: When *section* is not given, return a list of *section_name*, *section_proxy* pairs, including DEFAULTSECT.
pt_br: Quando *section* não é fornecido, retorna uma lista de pares *section_name*, *section_proxy*, incluindo DEFAULTSECT.

source: Otherwise, return a list of *name*, *value* pairs for the options in the given *section*. Optional arguments have the same meaning as for the :meth:`get` method.
pt_br: Caso contrário, retorna uma lista de pares *name*, *value* para as opções na *section* fornecida. Argumentos opcionais têm o mesmo significado do método :meth:`get`.

source: Items present in *vars* no longer appear in the result. The previous behaviour mixed actual parser options with variables provided for interpolation.
pt_br: Os itens presentes em *vars* não aparecem mais no resultado. O comportamento anterior misturava opções reais do analisador sintático com variáveis fornecidas para interpolação.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. *option* and *value* must be strings; if not, :exc:`TypeError` is raised.
pt_br: Se a seção fornecida existir, defina a opção fornecida com o valor especificado; caso contrário, levanta :exc:`NoSectionError`. *option* e *value* devem ser strings; caso contrário, :exc:`TypeError` será levantada.

source: Write a representation of the configuration to the specified :term:`file object`, which must be opened in text mode (accepting strings). This representation can be parsed by a future :meth:`read` call. If *space_around_delimiters* is true, delimiters between keys and values are surrounded by spaces.
pt_br: Escreve uma representação da configuração no :term:`objeto arquivo` especificado, que deve ser aberto em modo texto (aceitando strings). Esta representação pode ser analisada por uma futura chamada :meth:`read`. Se *space_around_delimiters* for verdadeiro, os delimitadores entre chaves e valores serão envoltos por espaços.

source: Raises InvalidWriteError if this would write a representation which cannot be accurately parsed by a future :meth:`read` call from this parser.
pt_br: Levanta InvalidWriteError se isso gravar uma representação que não pode ser analisada com precisão por uma futura chamada :meth:`read` deste analisador sintático.

source: Comments in the original configuration file are not preserved when writing the configuration back. What is considered a comment, depends on the given values for *comment_prefix* and *inline_comment_prefix*.
pt_br: Os comentários no arquivo de configuração original não são preservados ao escrever a configuração. O que é considerado um comentário depende dos valores fornecidos para *comment_prefix* e *inline_comment_prefix*.

source: Remove the specified *option* from the specified *section*. If the section does not exist, raise :exc:`NoSectionError`. If the option existed to be removed, return :const:`True`; otherwise return :const:`False`.
pt_br: Remove a *option* especificada da *section* especificada. Se a seção não existir, levanta :exc:`NoSectionError`. Se existisse a opção de ser removida, retorna :const:`True`; caso contrário, retorna :const:`False`.

source: Remove the specified *section* from the configuration. If the section in fact existed, return ``True``. Otherwise return ``False``.
pt_br: Remove a *section* especificada da configuração. Se a seção de fato existiu, retorna ``True``. Caso contrário, retorna ``False``.

source: Transforms the option name *option* as found in an input file or as passed in by client code to the form that should be used in the internal structures. The default implementation returns a lower-case version of *option*; subclasses may override this or client code can set an attribute of this name on instances to affect this behavior.
pt_br: Transforma o nome da opção *option* conforme encontrado em um arquivo de entrada ou conforme passado pelo código do cliente no formato que deve ser usado nas estruturas internas. A implementação padrão retorna uma versão em minúsculas de *option*; subclasses podem substituir isso ou o código do cliente pode definir um atributo com esse nome nas instâncias para afetar esse comportamento.

source: You don't need to subclass the parser to use this method, you can also set it on an instance, to a function that takes a string argument and returns a string. Setting it to ``str``, for example, would make option names case sensitive::
pt_br: Você não precisa criar uma subclasse do analisador sintático para usar esse método; você também pode configurá-lo em uma instância, para uma função que recebe um argumento de string e retorna uma string. Definir como ``str``, por exemplo, faria com que sejam diferenciadas as letras maiúsculas das minúsculas nos nomes das opções::

source: Note that when reading configuration files, whitespace around the option names is stripped before :meth:`optionxform` is called.
pt_br: Observe que ao ler arquivos de configuração, os espaços em branco ao redor dos nomes das opções são removidos antes de :meth:`optionxform` ser chamado.

source: A special object representing a section name used to reference the unnamed section (see :ref:`unnamed-sections`).
pt_br: Um objeto especial que representa um nome de seção usado para referenciar a seção sem nome (veja :ref:`unnamed-sections`).

source: The maximum depth for recursive interpolation for :meth:`~configparser.ConfigParser.get` when the *raw* parameter is false. This is relevant only when the default *interpolation* is used.
pt_br: A profundidade máxima para interpolação recursiva para :meth:`~configparser.ConfigParser.get` quando o parâmetro *raw* é falso. Isso é relevante apenas quando a *interpolation* padrão é usada.

source: RawConfigParser Objects
pt_br: Objetos RawConfigParser

source: Legacy variant of the :class:`ConfigParser`. It has interpolation disabled by default and allows for non-string section names, option names, and values via its unsafe ``add_section`` and ``set`` methods, as well as the legacy ``defaults=`` keyword argument handling.
pt_br: Variante legada do :class:`ConfigParser`. Ela tem a interpolação desabilitada por padrão e permite nomes de seções não-string, nomes de opções e valores através de seus métodos inseguros ``add_section`` e ``set``, bem como o tratamento de argumentos nomeados legados ``defaults=`` .

source: Consider using :class:`ConfigParser` instead which checks types of the values to be stored internally. If you don't want interpolation, you can use ``ConfigParser(interpolation=None)``.
pt_br: Considere usar :class:`ConfigParser`, que verifica os tipos de valores a serem armazenados internamente. Se você não quiser interpolação, você pode usar ``ConfigParser(interpolation=None)``.

source: Add a section named *section* or :const:`UNNAMED_SECTION` to the instance.
pt_br: Adiciona uma seção chamada *section* ou :const:`UNNAMED_SECTION` à instância.

source: If the given section already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised. If :const:`UNNAMED_SECTION` is passed and support is disabled, :exc:`UnnamedSectionDisabledError` is raised.
pt_br: Se a seção com o nome fornecido já existir, :exc:`DuplicateSectionError` é levantada. Se o nome da *seção padrão* for passado, :exc:`ValueError` é levantada. Se :const:`UNNAMED_SECTION` for passado e o suporte for desabilitado :exc:`UnnamedSectionDisabledError` é levantada.

source: Type of *section* is not checked which lets users create non-string named sections. This behaviour is unsupported and may cause internal errors.
pt_br: O tipo da *section* não está marcado, o que permite aos usuários criar seções nomeadas sem string. Este comportamento não é compatível e pode causar erros internos.

source: Added support for :const:`UNNAMED_SECTION`.
pt_br: Adicionado suporte a :const:`UNNAMED_SECTION`.

source: If the given section exists, set the given option to the specified value; otherwise raise :exc:`NoSectionError`. While it is possible to use :class:`RawConfigParser` (or :class:`ConfigParser` with *raw* parameters set to true) for *internal* storage of non-string values, full functionality (including interpolation and output to files) can only be achieved using string values.
pt_br: Se a seção fornecida existir, defina a opção fornecida com o valor especificado; caso contrário, levanta :exc:`NoSectionError`. Embora seja possível usar :class:`RawConfigParser` (ou :class:`ConfigParser` com parâmetros *raw* definidos como verdadeiro) para armazenamento *interno* de valores não-string, funcionalidade completa (incluindo interpolação e saída para arquivos) só pode ser alcançado usando valores de string.

source: This method lets users assign non-string values to keys internally. This behaviour is unsupported and will cause errors when attempting to write to a file or get it in non-raw mode. **Use the mapping protocol API** which does not allow such assignments to take place.
pt_br: Este método permite que os usuários atribuam valores não-string às chaves internamente. Este comportamento não é suportado e causará erros ao tentar escrever em um arquivo ou obtê-lo no modo não bruto. **Use a API do protocolo de mapeamento** que não permite que tais atribuições ocorram.

source: Exceptions
pt_br: Exceções

source: Base class for all other :mod:`configparser` exceptions.
pt_br: Classe base para todas as outras exceções do :mod:`configparser`.

source: Exception raised when a specified section is not found.
pt_br: Exceção levantada quando uma seção especificada não é encontrada.

source: Exception raised if :meth:`~ConfigParser.add_section` is called with the name of a section that is already present or in strict parsers when a section if found more than once in a single input file, string or dictionary.
pt_br: Exceção levantada se :meth:`~ConfigParser.add_section` for chamado com o nome de uma seção que já está presente ou em analisadores sintáticos estritos quando uma seção for encontrada mais de uma vez em um único arquivo de entrada, string ou dicionário.

source: Added the optional *source* and *lineno* attributes and parameters to :meth:`!__init__`.
pt_br: Adicionados os atributos e parâmetros opcionais *source* e *lineno* a :meth:`!__init__`.

source: Exception raised by strict parsers if a single option appears twice during reading from a single file, string or dictionary. This catches misspellings and case sensitivity-related errors, e.g. a dictionary may have two keys representing the same case-insensitive configuration key.
pt_br: Exceção levantada por analisadores sintáticos estritos se uma única opção aparecer duas vezes durante a leitura de um único arquivo, string ou dicionário. Isso detecta erros ortográficos e erros relacionados a diferenciação de letras maiúsculas e minúsculas como, p. ex., um dicionário pode ter duas chaves representando a mesma chave de configuração que não diferencia maiúsculas de minúsculas.

source: Exception raised when a specified option is not found in the specified section.
pt_br: Exceção levantada quando uma opção especificada não é encontrada na seção especificada.

source: Base class for exceptions raised when problems occur performing string interpolation.
pt_br: Classe base para exceções levantadas quando ocorrem problemas ao executar a interpolação de strings.

source: Exception raised when string interpolation cannot be completed because the number of iterations exceeds :const:`MAX_INTERPOLATION_DEPTH`. Subclass of :exc:`InterpolationError`.
pt_br: Exceção levantada quando a interpolação de string não pode ser concluída porque o número de iterações excede :const:`MAX_INTERPOLATION_DEPTH`. Subclasse de :exc:`InterpolationError`.

source: Exception raised when an option referenced from a value does not exist. Subclass of :exc:`InterpolationError`.
pt_br: Exceção levantada quando uma opção referenciada a partir de um valor não existe. Subclasse de :exc:`InterpolationError`.

source: Exception raised when the source text into which substitutions are made does not conform to the required syntax. Subclass of :exc:`InterpolationError`.
pt_br: Exceção levantada quando o texto fonte no qual são feitas as substituições não está em conformidade com a sintaxe exigida. Subclasse de :exc:`InterpolationError`.

source: Exception raised when attempting to parse a file which has no section headers.
pt_br: Exceção levantada ao tentar analisar um arquivo que não possui cabeçalhos de seção.

source: Exception raised when errors occur attempting to parse a file.
pt_br: Exceção levantada quando ocorrem erros ao tentar analisar um arquivo.

source: The ``filename`` attribute and :meth:`!__init__` constructor argument were removed. They have been available using the name ``source`` since 3.2.
pt_br: O atributo ``filename`` e o argumento do construtor :meth:`!__init__` foram removidos. Eles estiveram disponíveis usando o nome ``source`` desde 3.2.

source: Exception raised when a key without a corresponding value is continued with an indented line.
pt_br: Exceção levantada quando uma chave sem valor correspondente continua com uma linha indentada.

source: Exception raised when attempting to use the :const:`UNNAMED_SECTION` without enabling it.
pt_br: Exceção levantada ao tentar usar :const:`UNNAMED_SECTION` sem habilitá-lo.

source: Exception raised when an attempted :meth:`ConfigParser.write` would not be parsed accurately with a future :meth:`ConfigParser.read` call.
pt_br: Exceção levantada quando uma tentativa de :meth:`ConfigParser.write` não seria analisada com precisão com uma futura chamada de :meth:`ConfigParser.read`.

source: Ex: Writing a key beginning with the :attr:`ConfigParser.SECTCRE` pattern would parse as a section header when read. Attempting to write this will raise this exception.
pt_br: Ex: Escrever uma chave que comece com o padrão :attr:`ConfigParser.SECTCRE` seria interpretado como um cabeçalho de seção ao ser lido. Tentar escrever isso levantará esta exceção.

source: Footnotes
pt_br: Notas de rodapé

source: Config parsers allow for heavy customization. If you are interested in changing the behaviour outlined by the footnote reference, consult the `Customizing Parser Behaviour`_ section.
pt_br: Os analisadores sintáticos de configuração permitem muita personalização. Caso você tenha interesse em alterar o comportamento descrito na referência da nota de rodapé, consulte a seção `Personalizando o comportamento do analisador sintático`_.

source: file
pt_br: arquivo

source: configuration
pt_br: configuração

source: ini file
pt_br: arquivo ini

source: Windows ini file
pt_br: arquivo ini do Windows

source: % (percent)
pt_br: % (porcentagem)

source: interpolation in configuration files
pt_br: interpolação em arquivos de configuração

source: $ (dollar)
pt_br: $ (dólar)
