Repository: python/python-docs-pt-br
Catalog: library/configparser.po
Languages: pt_br

source: The optionxform function transforms option names to a canonical form. This should be an idempotent function: if the name is already in canonical form, it should be returned unchanged.
pt_br: A função optionxform transforma nomes de opções em um formato canônico. Esta deve ser uma função idempotente: se o nome já estiver na forma canônica, deverá ser retornado inalterado.

source: A compiled regular expression used to parse section headers. The default matches ``[section]`` to the name ``"section"``. Whitespace is considered part of the section name, thus ``[ larch ]`` will be read as a section of name ``" larch "``. Override this attribute if that's unsuitable. For example:
pt_br: Uma expressão regular compilada usada para analisar cabeçalhos de seção. O padrão corresponde a ``[section]`` para o nome ``"section"``. O espaço em branco é considerado parte do nome da seção, portanto ``[ larch ]`` será lido como uma seção de nome ``" larch "``. Substitua esse atributo se for inadequado. Por exemplo:

source: >>> import re >>> config = """ ... [Section 1] ... option = value ... ... [ Section 2 ] ... another = val ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> typical.sections() ['Section 1', ' Section 2 '] >>> custom = configparser.ConfigParser() >>> custom.SECTCRE = re.compile(r"\[ *(?P<header>[^]]+?) *\]") >>> custom.read_string(config) >>> custom.sections() ['Section 1', 'Section 2']
pt_br: >>> import re >>> config = """ ... [Seção 1] ... opção = valor ... ... [ Seção 2 ] ... outro = valor ... """ >>> typical = configparser.ConfigParser() >>> typical.read_string(config) >>> typical.sections() ['Seção 1', ' Seção 2 '] >>> custom = configparser.ConfigParser() >>> custom.SECTCRE = re.compile(r"\[ *(?P<header>[^]]+?) *\]") >>> custom.read_string(config) >>> custom.sections() ['Seção 1', 'Seção 2']

source: While ConfigParser objects also use an ``OPTCRE`` attribute for recognizing option lines, it's not recommended to override it because that would interfere with constructor options *allow_no_value* and *delimiters*.
pt_br: Embora os objetos ConfigParser também usem um atributo ``OPTCRE`` para reconhecer linhas de opção, não é recomendado substituí-lo porque isso interferiria nas opções do construtor *allow_no_value* e *delimiters*.

source: Legacy API Examples
pt_br: Exemplos de APIs legadas

source: Mainly because of backwards compatibility concerns, :mod:`configparser` provides also a legacy API with explicit ``get``/``set`` methods. While there are valid use cases for the methods outlined below, mapping protocol access is preferred for new projects. The legacy API is at times more advanced, low-level and downright counterintuitive.
pt_br: Principalmente por questões de compatibilidade com versões anteriores, :mod:`configparser` fornece também uma API legada com métodos ``get``/``set`` explícitos. Embora existam casos de uso válidos para os métodos descritos abaixo, o acesso ao protocolo de mapeamento é preferido para novos projetos. A API legada é às vezes mais avançada, de baixo nível e totalmente contraintuitiva.

source: An example of writing to a configuration file::
pt_br: Um exemplo de escrita em um arquivo de configuração::

source: import configparser config = configparser.RawConfigParser() # Please note that using RawConfigParser's set functions, you can assign # non-string values to keys internally, but will receive an error when # attempting to write to a file or when you get it in non-raw mode. Setting # values using the mapping protocol or ConfigParser's set() does not allow # such assignments to take place. config.add_section('Section1') config.set('Section1', 'an_int', '15') config.set('Section1', 'a_bool', 'true') config.set('Section1', 'a_float', '3.1415') config.set('Section1', 'baz', 'fun') config.set('Section1', 'bar', 'Python') config.set('Section1', 'foo', '%(bar)s is %(baz)s!') # Writing our configuration file to 'example.cfg' with open('example.cfg', 'w') as configfile: config.write(configfile)
pt_br: import configparser config = configparser.RawConfigParser() # Observe que usando as funções set do RawConfigParser, você pode atribuir # valores não string a chaves internamente, mas receberá um erro ao tentar # gravar em um arquivo ou quando obtê-lo em modo não bruta. Definir valores # usando o protocolo de mapeamento ou set() do ConfigParser não permite que # tais atribuições ocorram. config.add_section('Seção1') config.set('Seção1', 'an_int', '15') config.set('Seção1', 'a_bool', 'true') config.set('Seção1', 'a_float', '3.1415') config.set('Seção1', 'baz', 'divertido') config.set('Seção1', 'bar', 'Python') config.set('Seção1', 'foo', '%(bar)s é %(baz)s!') # Escrevendo nosso arquivo de configuração em 'example.cfg' with open('example.cfg', 'w') as configfile: config.write(configfile)

source: An example of reading the configuration file again::
pt_br: Um exemplo de leitura do arquivo de configuração novamente::

source: import configparser config = configparser.RawConfigParser() config.read('example.cfg') # getfloat() raises an exception if the value is not a float # getint() and getboolean() also do this for their respective types a_float = config.getfloat('Section1', 'a_float') an_int = config.getint('Section1', 'an_int') print(a_float + an_int) # Notice that the next output does not interpolate '%(bar)s' or '%(baz)s'. # This is because we are using a RawConfigParser(). if config.getboolean('Section1', 'a_bool'): print(config.get('Section1', 'foo'))
pt_br: import configparser config = configparser.RawConfigParser() config.read('example.cfg') # getfloat() levanta uma exceção se o valor não for um ponto flutuante # getint() e getboolean() também fazem isso para seus respectivos tipos a_float = config.getfloat('Seção1', 'a_float') an_int = config.getint('Seção1', 'an_int') print(a_float + an_int) # Note que a próxima saída não interpola '%(bar)s' ou '%(baz)s'. # Isso ocorre porque estamos usando RawConfigParser(). if config.getboolean('Seção1', 'a_bool'): print(config.get('Seção1', 'foo'))

source: To get interpolation, use :class:`ConfigParser`::
pt_br: Para obter interpolação, use :class:`ConfigParser`::

source: import configparser cfg = configparser.ConfigParser() cfg.read('example.cfg') # Set the optional *raw* argument of get() to True if you wish to disable # interpolation in a single get operation. print(cfg.get('Section1', 'foo', raw=False)) # -> "Python is fun!" print(cfg.get('Section1', 'foo', raw=True)) # -> "%(bar)s is %(baz)s!" # The optional *vars* argument is a dict with members that will take # precedence in interpolation. print(cfg.get('Section1', 'foo', vars={'bar': 'Documentation', 'baz': 'evil'})) # The optional *fallback* argument can be used to provide a fallback value print(cfg.get('Section1', 'foo')) # -> "Python is fun!" print(cfg.get('Section1', 'foo', fallback='Monty is not.')) # -> "Python is fun!" print(cfg.get('Section1', 'monster', fallback='No such things as monsters.')) # -> "No such things as monsters." # A bare print(cfg.get('Section1', 'monster')) would raise NoOptionError # but we can also use: print(cfg.get('Section1', 'monster', fallback=None)) # -> None
pt_br: import configparser cfg = configparser.ConfigParser() cfg.read('example.cfg') # Defina o argumento *raw* opcional de get() para True se você quiser desabilitar # interpolação em uma única operação de get. print(cfg.get('Seção1', 'foo', raw=False)) # -> "Python é divertido!" print(cfg.get('Seção1', 'foo', raw=True)) # -> "%(bar)s é %(baz)s!" # O argumento opcional *vars* é um dicionário com membros que vão aceitar # precedência na interpolação. print(cfg.get('Seção1', 'foo', vars={'bar': 'Documentação', 'baz': 'maligna'})) # The optional *fallback* argument can be used to provide a fallback value print(cfg.get('Seção1', 'foo')) # -> "Python é divertido!" print(cfg.get('Seção1', 'foo', fallback='Monty não é.')) # -> "Python é divertido!" print(cfg.get('Seção1', 'monstro', fallback='Não existem monstros.')) # -> "Não existem monstros." # Um print(cfg.get('Seção1', 'monster')) levantaria NoOptionError, # mas nós também podemos usar: print(cfg.get('Seção1', 'mosntro', fallback=None)) # -> None

source: Default values are available in both types of ConfigParsers. They are used in interpolation if an option used is not defined elsewhere. ::
pt_br: Os valores padrão estão disponíveis em ambos os tipos de ConfigParsers. Eles são usados em interpolação se uma opção usada não estiver definida em outro lugar. ::

source: import configparser # New instance with 'bar' and 'baz' defaulting to 'Life' and 'hard' each config = configparser.ConfigParser({'bar': 'Life', 'baz': 'hard'}) config.read('example.cfg') print(config.get('Section1', 'foo')) # -> "Python is fun!" config.remove_option('Section1', 'bar') config.remove_option('Section1', 'baz') print(config.get('Section1', 'foo')) # -> "Life is hard!"
pt_br: import configparser # Nova instância com 'bar' e 'baz' padrão para 'A vida' e 'difícil' cada config = configparser.ConfigParser({'bar': 'A vida', 'baz': 'difícil'}) config.read('example.cfg') print(config.get('Seção1', 'foo')) # -> "Python é divertido!" config.remove_option('Seção1', 'bar') config.remove_option('Seção1', 'baz') print(config.get('Seção1', 'foo')) # -> "A vida é difícil!"

source: ConfigParser Objects
pt_br: Objetos ConfigParser

source: The main configuration parser. When *defaults* is given, it is initialized into the dictionary of intrinsic defaults. When *dict_type* is given, it will be used to create the dictionary objects for the list of sections, for the options within a section, and for the default values.
pt_br: O principal analisador sintático de configuração. Quando *defaults* é fornecido, ele é inicializado no dicionário de padrões intrínsecos. Quando *dict_type* for fornecido, ele será usado para criar os objetos dicionário para a lista de seções, para as opções dentro de uma seção e para os valores padrão.

source: When *delimiters* is given, it is used as the set of substrings that divide keys from values. When *comment_prefixes* is given, it will be used as the set of substrings that prefix comments in otherwise empty lines. Comments can be indented. When *inline_comment_prefixes* is given, it will be used as the set of substrings that prefix comments in non-empty lines.
pt_br: Quando *delimiters* são fornecidos, eles são usados como o conjunto de substrings que dividem chaves de valores. Quando *comment_prefixes* for fornecido, ele será usado como o conjunto de substrings que prefixam comentários em linhas vazias. Os comentários podem ser indentados. Quando *inline_comment_prefixes* for fornecido, ele será usado como o conjunto de substrings que prefixam comentários em linhas não vazias.

source: When *strict* is ``True`` (the default), the parser won't allow for any section or option duplicates while reading from a single source (file, string or dictionary), raising :exc:`DuplicateSectionError` or :exc:`DuplicateOptionError`. When *empty_lines_in_values* is ``False`` (default: ``True``), each empty line marks the end of an option. Otherwise, internal empty lines of a multiline option are kept as part of the value. When *allow_no_value* is ``True`` (default: ``False``), options without values are accepted; the value held for these is ``None`` and they are serialized without the trailing delimiter.
pt_br: Quando *strict* for ``True`` (o padrão), o analisador sintático não permitirá nenhuma seção ou opção duplicada durante a leitura de uma única fonte (arquivo, string ou dicionário), levantando :exc:`DuplicateSectionError` ou :exc:`DuplicateOptionError`. Quando *empty_lines_in_values* é ``False`` (padrão: ``True``), cada linha vazia marca o fim de uma opção. Caso contrário, as linhas vazias internas de uma opção multilinha serão mantidas como parte do valor. Quando *allow_no_value* for ``True`` (padrão: ``False``), opções sem valores serão aceitas; o valor mantido para estes é ``None`` e eles são serializados sem o delimitador final.

source: When *default_section* is given, it specifies the name for the special section holding default values for other sections and interpolation purposes (normally named ``"DEFAULT"``). This value can be retrieved and changed at runtime using the ``default_section`` instance attribute. This won't re-evaluate an already parsed config file, but will be used when writing parsed settings to a new config file.
pt_br: Quando *default_section* é fornecido, ele especifica o nome da seção especial que contém valores padrão para outras seções e propósitos de interpolação (normalmente chamada de ``"DEFAULT"``). Este valor pode ser recuperado e alterado em tempo de execução usando o atributo de instância ``default_section``. Isso não reavaliará um arquivo de configuração já analisado, mas será usado ao escrever configurações analisadas em um novo arquivo de configuração.

source: Interpolation behaviour may be customized by providing a custom handler through the *interpolation* argument. ``None`` can be used to turn off interpolation completely, ``ExtendedInterpolation()`` provides a more advanced variant inspired by ``zc.buildout``. More on the subject in the `dedicated documentation section <#interpolation-of-values>`_.
pt_br: O comportamento de interpolação pode ser personalizado fornecendo um manipulador personalizado por meio do argumento *interpolation*. ``None`` pode ser usado para desligar completamente a interpolação, ``ExtendedInterpolation()`` fornece uma variante mais avançada inspirada em ``zc.buildout``. Mais sobre o assunto na `seção de documentação dedicada <#interpolation-of-values>`_.

source: All option names used in interpolation will be passed through the :meth:`optionxform` method just like any other option name reference. For example, using the default implementation of :meth:`optionxform` (which converts option names to lower case), the values ``foo %(bar)s`` and ``foo %(BAR)s`` are equivalent.
pt_br: Todos os nomes de opções usados na interpolação serão passados através do método :meth:`optionxform` assim como qualquer outra referência de nome de opção. Por exemplo, usando a implementação padrão de :meth:`optionxform` (que converte nomes de opções para letras minúsculas), os valores ``foo %(bar)s`` e ``foo %(BAR)s`` são equivalentes.

source: When *converters* is given, it should be a dictionary where each key represents the name of a type converter and each value is a callable implementing the conversion from string to the desired datatype. Every converter gets its own corresponding :meth:`!get*` method on the parser object and section proxies.
pt_br: Quando *converters* é fornecido, deve ser um dicionário onde cada chave representa o nome de um conversor de tipo e cada valor é um chamável implementando a conversão de string para o tipo de dados desejado. Cada conversor obtém seu próprio método :meth:`!get*` correspondente no objeto analisador sintático e nos intermediários de seção.

source: When *allow_unnamed_section* is ``True`` (default: ``False``), the first section name can be omitted. See the `"Unnamed Sections" section <#unnamed-sections>`_.
pt_br: Quando *allow_unnamed_section* é ``True`` (padrão: ``False``), o primeiro nome da seção pode ser omitido. Veja a seção `"Seções não nomeadas" <#unnamed-sections>`_.

source: The default *dict_type* is :class:`collections.OrderedDict`.
pt_br: O padrão *dict_type* é :class:`collections.OrderedDict`.

source: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* and *interpolation* were added.
pt_br: *allow_no_value*, *delimiters*, *comment_prefixes*, *strict*, *empty_lines_in_values*, *default_section* e *interpolation* foram adicionados.

source: The *converters* argument was added.
pt_br: O argumento *converters* foi adicionado.

source: The *defaults* argument is read with :meth:`read_dict`, providing consistent behavior across the parser: non-string keys and values are implicitly converted to strings.
pt_br: O argumento *defaults* é lido com :meth:`read_dict`, fornecendo um comportamento consistente em todo o analisador: chaves e valores que não são de string são convertidos implicitamente em strings.

source: The default *dict_type* is :class:`dict`, since it now preserves insertion order.
pt_br: O *dict_type* padrão é :class:`dict`, pois agora preserva a ordem de inserção.

source: Raise a :exc:`MultilineContinuationError` when *allow_no_value* is ``True``, and a key without a value is continued with an indented line.
pt_br: Levanta :exc:`MultilineContinuationError` quando *allow_no_value* for ``True``, e uma chave sem valor continua com uma linha indentada.

source: The *allow_unnamed_section* argument was added.
pt_br: O argumento *allow_unnamed_section* foi adicionado.

source: Return a dictionary containing the instance-wide defaults.
pt_br: Retorna um dicionário contendo os padrões de toda a instância.

source: Return a list of the sections available; the *default section* is not included in the list.
pt_br: Retorna uma lista das seções disponíveis; a *seção padrão* não está incluída na lista.

source: Add a section named *section* to the instance. If a section by the given name already exists, :exc:`DuplicateSectionError` is raised. If the *default section* name is passed, :exc:`ValueError` is raised. The name of the section must be a string; if not, :exc:`TypeError` is raised.
pt_br: Adiciona uma seção de nome *section* à instância. Se já existir uma seção com o nome fornecido, :exc:`DuplicateSectionError` será levantada. Se o nome da *seção padrão* for passado, :exc:`ValueError` será levantada. O nome da seção deve ser uma string; caso contrário, :exc:`TypeError` será levantada.

source: Non-string section names raise :exc:`TypeError`.
pt_br: Nomes de seções sem string levantam :exc:`TypeError`.

source: Indicates whether the named *section* is present in the configuration. The *default section* is not acknowledged.
pt_br: Indica se a *section* nomeada está presente na configuração. A *seção padrão* não é reconhecida.

source: Return a list of options available in the specified *section*.
pt_br: Retorna uma lista de opções disponíveis na *section* especificada.

source: If the given *section* exists, and contains the given *option*, return :const:`True`; otherwise return :const:`False`. If the specified *section* is :const:`None` or an empty string, DEFAULT is assumed.
pt_br: Se a *section* fornecida existir e contiver a *option* fornecida, retorna :const:`True`; caso contrário, retorna :const:`False`. Se a *section* especificada for :const:`None` ou uma string vazia, DEFAULT será presumido.

source: Attempt to read and parse an iterable of filenames, returning a list of filenames which were successfully parsed.
pt_br: Tenta ler e analisar um iterável de nomes de arquivos, retornando uma lista de nomes de arquivos que foram analisados com sucesso.

source: If *filenames* is a string, a :class:`bytes` object or a :term:`path-like object`, it is treated as a single filename. If a file named in *filenames* cannot be opened, that file will be ignored. This is designed so that you can specify an iterable of potential configuration file locations (for example, the current directory, the user's home directory, and some system-wide directory), and all existing configuration files in the iterable will be read.
pt_br: Se *filenames* for uma string, um objeto :class:`bytes` ou um :term:`objeto caminho ou similar`, este parâmetro será tratado como um único nome de arquivo. Se um arquivo nomeado em *filenames* não puder ser aberto, esse arquivo será ignorado. Isso foi projetado para que você possa especificar um iterável de possíveis locais de arquivo de configuração (por exemplo, o diretório atual, o diretório inicial do usuário e algum diretório de todo o sistema) e todos os arquivos de configuração existentes no iterável serão lidos.

source: If none of the named files exist, the :class:`ConfigParser` instance will contain an empty dataset. An application which requires initial values to be loaded from a file should load the required file or files using :meth:`read_file` before calling :meth:`read` for any optional files::
pt_br: Se nenhum dos arquivos nomeados existir, a instância :class:`ConfigParser` conterá um conjunto de dados vazio. Uma aplicação que requer que valores iniciais sejam carregados de um arquivo deve carregar o arquivo ou arquivos necessários usando :meth:`read_file` antes de chamar :meth:`read` para quaisquer arquivos opcionais::

source: Added the *encoding* parameter. Previously, all files were read using the default encoding for :func:`open`.
pt_br: Adicionado o parâmetro *encoding*. Anteriormente, todos os arquivos eram lidos usando a codificação padrão para :func:`open`.

source: The *filenames* parameter accepts a :term:`path-like object`.
pt_br: O parâmetro *filenames* aceita um :term:`objeto caminho ou similar`.

source: The *filenames* parameter accepts a :class:`bytes` object.
pt_br: O parâmetro *filenames* aceita um objeto :class:`bytes`.

source: Read and parse configuration data from *f* which must be an iterable yielding Unicode strings (for example files opened in text mode).
pt_br: Lê e analisa dados de configuração de *f* que devem ser iteráveis, produzindo strings Unicode (por exemplo, arquivos abertos em modo texto).

source: Optional argument *source* specifies the name of the file being read. If not given and *f* has a :attr:`!name` attribute, that is used for *source*; the default is ``'<???>'``.
pt_br: O argumento opcional *source* especifica o nome do arquivo que está sendo lido. Se não for fornecido e *f* tiver um atributo :attr:`!name`, que é usado para *source*; o padrão é ``'<???>'``.

source: Replaces :meth:`!readfp`.
pt_br: Substitui :meth:`!readfp`.

source: Parse configuration data from a string.
pt_br: Analisa dados de configuração de uma string.

source: Optional argument *source* specifies a context-specific name of the string passed. If not given, ``'<string>'`` is used. This should commonly be a filesystem path or a URL.
pt_br: O argumento opcional *source* especifica um nome específico do contexto da string passada. Se não for fornecido, ``'<string>'`` será usado. Geralmente deve ser um caminho do sistema de arquivos ou uma URL.

source: Load configuration from any object that provides a dict-like ``items()`` method. Keys are section names, values are dictionaries with keys and values that should be present in the section. If the used dictionary type preserves order, sections and their keys will be added in order. Values are automatically converted to strings.
pt_br: Carrega a configuração de qualquer objeto que forneça um método ``items()`` dict ou similar. Chaves são nomes de seções, valores são dicionários com chaves e valores que devem estar presentes na seção. Se o tipo de dicionário usado preservar a ordem, as seções e suas chaves serão adicionadas em ordem. Os valores são convertidos automaticamente em strings.

source: Optional argument *source* specifies a context-specific name of the dictionary passed. If not given, ``<dict>`` is used.
pt_br: O argumento opcional *source* especifica um nome específico do contexto do dicionário passado. Se não for fornecido, ``<dict>`` será usado.

source: This method can be used to copy state between parsers.
pt_br: Este método pode ser usado para copiar o estado entre analisadores sintáticos.
