Repository: python/python-docs-pt-br
Catalog: library/constants.po
Languages: pt_br

source: Built-in Constants
pt_br: Constantes embutidas

source: A small number of constants live in the built-in namespace. They are:
pt_br: Um pequeno número de constantes são definidas no espaço de nomes embutido da linguagem. São elas:

source: The false value of the :class:`bool` type. Assignments to ``False`` are illegal and raise a :exc:`SyntaxError`.
pt_br: O valor falso do tipo :class:`bool`. As atribuições a ``False`` são ilegais e levantam :exc:`SyntaxError`.

source: The true value of the :class:`bool` type. Assignments to ``True`` are illegal and raise a :exc:`SyntaxError`.
pt_br: O valor verdadeiro do tipo :class:`bool`. As atribuições a ``True`` são ilegais e levantam :exc:`SyntaxError`.

source: An object frequently used to represent the absence of a value, as when default arguments are not passed to a function. Assignments to ``None`` are illegal and raise a :exc:`SyntaxError`. ``None`` is the sole instance of the :data:`~types.NoneType` type.
pt_br: Um objeto frequentemente usado para representar a ausência de um valor, como quando os argumentos padrões não são passados para uma função. As atribuições a ``None`` são ilegais e levantam :exc:`SyntaxError`. ``None`` é a única instância do tipo :data:`~types.NoneType`.

source: A special value which should be returned by the binary special methods (e.g. :meth:`~object.__eq__`, :meth:`~object.__lt__`, :meth:`~object.__add__`, :meth:`~object.__rsub__`, etc.) to indicate that the operation is not implemented with respect to the other type; may be returned by the in-place binary special methods (e.g. :meth:`~object.__imul__`, :meth:`~object.__iand__`, etc.) for the same purpose. It should not be evaluated in a boolean context. :data:`!NotImplemented` is the sole instance of the :data:`types.NotImplementedType` type.
pt_br: Um valor especial que deve ser retornado pelos métodos binários especiais (por exemplo: :meth:`~object.__eq__`, :meth:`~object.__lt__`, :meth:`~object.__add__`, :meth:`~object.__rsub__`, etc.) não é implementado em relação ao outro tipo; pode ser retornado pelos métodos especiais binários no local (por exemplo: :meth:`~object.__imul__`, :meth:`~object.__iand__`, etc.) para o mesmo propósito. Ele não deve ser avaliado em um contexto booleano. :data:`!NotImplemented` é a única instância do tipo :data:`types.NotImplementedType`.

source: When a binary (or in-place) method returns :data:`!NotImplemented` the interpreter will try the reflected operation on the other type (or some other fallback, depending on the operator). If all attempts return :data:`!NotImplemented`, the interpreter will raise an appropriate exception. Incorrectly returning :data:`!NotImplemented` will result in a misleading error message or the :data:`!NotImplemented` value being returned to Python code.
pt_br: Quando um método binário (ou local) retorna :data:`!NotImplemented`, o interpretador tentará a operação refletida no outro tipo (ou algum outro fallback, dependendo do operador). Se todas as tentativas retornarem :data:`!NotImplemented`, o interpretador levantará uma exceção apropriada. Retornar incorretamente :data:`!NotImplemented` resultará em uma mensagem de erro enganosa ou no valor :data:`!NotImplemented` sendo retornado ao código Python.

source: See :ref:`implementing-the-arithmetic-operations` for examples.
pt_br: Consulte :ref:`implementing-the-arithmetic-operations` para ver exemplos.

source: :data:`!NotImplemented` and :exc:`!NotImplementedError` are not interchangeable. This constant should only be used as described above; see :exc:`NotImplementedError` for details on correct usage of the exception.
pt_br: :data:`!NotImplemented` e :exc:`!NotImplementedError` não são intercambiáveis. Esta constante deve ser usada somente conforme descrito acima; veja :exc:`NotImplementedError` para detalhes sobre o uso correto da exceção.

source: Evaluating :data:`!NotImplemented` in a boolean context was deprecated.
pt_br: A avaliação de :data:`!NotImplemented` em um contexto booleano foi descontinuada.

source: Evaluating :data:`!NotImplemented` in a boolean context now raises a :exc:`TypeError`. It previously evaluated to :const:`True` and emitted a :exc:`DeprecationWarning` since Python 3.9.
pt_br: A avaliação de :data:`!NotImplemented` em um contexto booleano agora levanta um :exc:`TypeError`. Anteriormente, ele era avaliado como :const:`True` e emitia um :exc:`DeprecationWarning` desde o Python 3.9.

source: The same as the ellipsis literal "``...``". Special value used mostly in conjunction with extended slicing syntax for user-defined container data types. ``Ellipsis`` is the sole instance of the :data:`types.EllipsisType` type.
pt_br: O mesmo que as reticências literais "``...``". Valor especial usado principalmente em conjunto com a sintaxe de divisão estendida para tipos de dados de contêiner definidos pelo usuário. ``Ellipsis`` é a única instância do tipo :data:`types.EllipsisType`.

source: This constant is true if Python was not started with an :option:`-O` option. See also the :keyword:`assert` statement.
pt_br: Esta constante é verdadeira se o Python não foi iniciado com uma opção :option:`-O`. Veja também a instrução :keyword:`assert`.

source: The names :data:`None`, :data:`False`, :data:`True` and :data:`__debug__` cannot be reassigned (assignments to them, even as an attribute name, raise :exc:`SyntaxError`), so they can be considered "true" constants.
pt_br: Os nomes :data:`None`, :data:`False`, :data:`True` e :data:`__debug__` não podem ser reatribuídos (atribuições a eles, mesmo como um nome de atributo, levantam :exc:`SyntaxError` ), para que possam ser consideradas "verdadeiras" constantes.

source: Constants added by the :mod:`site` module
pt_br: Constantes adicionadas pelo módulo :mod:`site`

source: The :mod:`site` module (which is imported automatically during startup, except if the :option:`-S` command-line option is given) adds several constants to the built-in namespace. They are useful for the interactive interpreter shell and should not be used in programs.
pt_br: O módulo :mod:`site` (que é importado automaticamente durante a inicialização, exceto se a opção de linha de comando :option:`-S` for fornecida) adiciona várias constantes ao espaço de nomes embutido. Eles são úteis para o console do interpretador interativo e não devem ser usados em programas.

source: Objects that when printed or called, print the text of copyright or credits, respectively.
pt_br: Objetos que ao serem impressos ou chamados, imprimem o texto dos direitos autorais ou créditos, respectivamente.

source: Object that when printed, prints the message "Type license() to see the full license text", and when called, displays the full license text in a pager-like fashion (one screen at a time).
pt_br: Objeto que, quando impresso, imprime a mensagem "Type license() to see the full license text" e, quando chamado, exibe o texto completo da licença de maneira semelhante a um paginador (uma tela por vez).

source: ellipsis literal
pt_br: reticências literais
