Repository: python/python-docs-pt-br
Catalog: library/contextvars.po
Languages: pt_br

source: :mod:`!contextvars` --- Context Variables
pt_br: :mod:`!contextvars` --- Variáveis de contexto

source: This module provides APIs to manage, store, and access context-local state. The :class:`~contextvars.ContextVar` class is used to declare and work with *Context Variables*. The :func:`~contextvars.copy_context` function and the :class:`~contextvars.Context` class should be used to manage the current context in asynchronous frameworks.
pt_br: Este módulo fornece APIs para gerenciar, armazenar e acessar o estado local do contexto. A classe :class:`~contextvars.ContextVar` é usada para declarar e trabalhar com *Variáveis de Contexto*. A função :func:`~contextvars.copy_context` e a classe :class:`~contextvars.Context` devem ser usadas para gerenciar o contexto atual em frameworks assíncronos.

source: Context managers that have state should use Context Variables instead of :func:`threading.local` to prevent their state from bleeding to other code unexpectedly, when used in concurrent code.
pt_br: Os gerenciadores de contexto que possuem estado devem usar Variáveis de Contexto ao invés de :func:`threading.local` para evitar que seu estado vaze para outro código inesperadamente, quando usado em código concorrente.

source: See also :pep:`567` for additional details.
pt_br: Veja também a :pep:`567` para detalhes adicionais.

source: Context Variables
pt_br: Variáveis de contexto

source: This class is used to declare a new Context Variable, e.g.::
pt_br: Esta classe é usada para declarar uma nova variável de contexto, como, por exemplo::

source: The required *name* parameter is used for introspection and debug purposes.
pt_br: O parâmetro obrigatório *name* é usado para fins de introspecção e depuração.

source: The optional keyword-only *default* parameter is returned by :meth:`ContextVar.get` when no value for the variable is found in the current context.
pt_br: O parâmetro somente-nomeado opcional *default* é retornado por :meth:`ContextVar.get` quando nenhum valor para a variável é encontrado no contexto atual.

source: **Important:** Context Variables should be created at the top module level and never in closures. :class:`Context` objects hold strong references to context variables which prevents context variables from being properly garbage collected.
pt_br: **Importante:** Variáveis de Contexto devem ser criadas no nível do módulo superior e nunca em fechamentos. Os objetos :class:`Context` contêm referências fortes a variáveis de contexto que evitam que as variáveis de contexto sejam coletadas como lixo corretamente.

source: The name of the variable. This is a read-only property.
pt_br: O nome da variável. Esta é uma propriedade somente leitura.

source: Return a value for the context variable for the current context.
pt_br: Retorna um valor para a variável de contexto para o contexto atual.

source: If there is no value for the variable in the current context, the method will:
pt_br: Se não houver valor para a variável no contexto atual, o método vai:

source: return the value of the *default* argument of the method, if provided; or
pt_br: retornar o valor do argumento *default* do método, se fornecido; ou

source: return the default value for the context variable, if it was created with one; or
pt_br: retornar o valor padrão para a variável de contexto, se ela foi criada com uma; ou

source: raise a :exc:`LookupError`.
pt_br: levantar uma :exc:`LookupError`.

source: Call to set a new value for the context variable in the current context.
pt_br: Chame para definir um novo valor para a variável de contexto no contexto atual.

source: The required *value* argument is the new value for the context variable.
pt_br: O argumento *value* obrigatório é o novo valor para a variável de contexto.

source: Returns a :class:`~contextvars.Token` object that can be used to restore the variable to its previous value via the :meth:`ContextVar.reset` method.
pt_br: Retorna um objeto :class:`~contextvars.Token` que pode ser usado para restaurar a variável ao seu valor anterior através do método :meth:`ContextVar.reset`.

source: Reset the context variable to the value it had before the :meth:`ContextVar.set` that created the *token* was used.
pt_br: Redefine a variável de contexto para o valor que tinha antes de :meth:`ContextVar.set`. que criou o *token*, ser usado.

source: For example::
pt_br: Por exemplo::

source: var = ContextVar('var') token = var.set('new value') # code that uses 'var'; var.get() returns 'new value'. var.reset(token) # After the reset call the var has no value again, so # var.get() would raise a LookupError.
pt_br: var = ContextVar('var') token = var.set('novo valor') # código que usa 'var'; var.get() retorna 'novo valor'. var.reset(token) # Após uma chamada de redefinição, var não tem mais valor, # então var.get() levantaria uma exceção LookupError.

source: *Token* objects are returned by the :meth:`ContextVar.set` method. They can be passed to the :meth:`ContextVar.reset` method to revert the value of the variable to what it was before the corresponding *set*.
pt_br: Objetos *token* são retornados pelo método :meth:`ContextVar.set`. Eles podem ser passados para o método :meth:`ContextVar.reset` para reverter o valor da variável para o que era antes do *set* correspondente.

source: The token supports :ref:`context manager protocol <context-managers>` to restore the corresponding context variable value at the exit from :keyword:`with` block::
pt_br: O token oferece suporte a :ref:`protocolo do gerenciador de contexto <context-managers>` para restaurar o valor da variável de contexto correspondente na saída do bloco :keyword:`with`::

source: Added support for usage as a context manager.
pt_br: Adicionado suporte para uso como gerenciador de contexto.

source: A read-only property. Points to the :class:`ContextVar` object that created the token.
pt_br: Uma propriedade somente leitura. Aponta para o objeto :class:`ContextVar` que criou o token.

source: A read-only property. Set to the value the variable had before the :meth:`ContextVar.set` method call that created the token. It points to :attr:`Token.MISSING` if the variable was not set before the call.
pt_br: Uma propriedade somente leitura. Defina como o valor que a variável tinha antes da chamada do método :meth:`ContextVar.set` que criou o token. Aponta para :attr:`Token.MISSING` se a variável não foi definida antes da chamada.

source: A marker object used by :attr:`Token.old_value`.
pt_br: Um objeto marcador usado por :attr:`Token.old_value`.

source: Manual Context Management
pt_br: Gerenciamento de contexto manual

source: Returns a copy of the current :class:`~contextvars.Context` object.
pt_br: Retorna uma cópia do objeto :class:`~contextvars.Context` atual.

source: The following snippet gets a copy of the current context and prints all variables and their values that are set in it::
pt_br: O trecho a seguir obtém uma cópia do contexto atual e imprime todas as variáveis e seus valores que são definidos nele::

source: The function has an *O*\ (1) complexity, i.e. works equally fast for contexts with a few context variables and for contexts that have a lot of them.
pt_br: A função tem uma complexidade *O*\ (1) , ou seja, funciona igualmente rápida para contextos com algumas variáveis de contexto e para contextos que têm muitas delas.

source: A mapping of :class:`ContextVars <ContextVar>` to their values.
pt_br: Um mapeamento de :class:`ContextVars <ContextVar>` para seus valores.

source: ``Context()`` creates an empty context with no values in it. To get a copy of the current context use the :func:`~contextvars.copy_context` function.
pt_br: ``Context()`` cria um contexto vazio sem valores nele. Para obter uma cópia do contexto atual, use a função :func:`~contextvars.copy_context`.

source: Each thread has its own effective stack of :class:`!Context` objects. The :term:`current context` is the :class:`!Context` object at the top of the current thread's stack. All :class:`!Context` objects in the stacks are considered to be *entered*.
pt_br: Cada thread tem sua própria pilha efetiva de objetos :class:`!Context`. O :term:`contexto atual` é o objeto :class:`!Context` no topo da pilha da thread atual. Todos os objetos :class:`!Context` nas pilhas são considerados como *inseridos*.

source: *Entering* a context, which can be done by calling its :meth:`~Context.run` method, makes the context the current context by pushing it onto the top of the current thread's context stack.
pt_br: *Inserir* um contexto, o que pode ser feito chamando seu método :meth:`~Context.run`, torna o contexto o contexto atual, colocando-o no topo da pilha de contexto da thread atual.

source: *Exiting* from the current context, which can be done by returning from the callback passed to the :meth:`~Context.run` method, restores the current context to what it was before the context was entered by popping the context off the top of the context stack.
pt_br: *Sair* do contexto atual, o que pode ser feito retornando do retorno de chamada passado para o método :meth:`~Context.run`, restaura o contexto atual para o que era antes de o contexto ser inserido, retirando o contexto do topo da pilha de contextos.

source: Since each thread has its own context stack, :class:`ContextVar` objects behave in a similar fashion to :func:`threading.local` when values are assigned in different threads.
pt_br: Como cada thread tem sua própria pilha de contexto, os objetos :class:`ContextVar` se comportam de maneira semelhante a :func:`threading.local` quando valores são atribuídos em threads diferentes.

source: Attempting to enter an already entered context, including contexts entered in other threads, raises a :exc:`RuntimeError`.
pt_br: Tentar entrar em um contexto já inserido, incluindo contextos inseridos em outras threads, levanta uma exceção :exc:`RuntimeError`.

source: After exiting a context, it can later be re-entered (from any thread).
pt_br: Após sair de um contexto, ele pode ser acessado novamente (de qualquer thread).

source: Any changes to :class:`ContextVar` values via the :meth:`ContextVar.set` method are recorded in the current context. The :meth:`ContextVar.get` method returns the value associated with the current context. Exiting a context effectively reverts any changes made to context variables while the context was entered (if needed, the values can be restored by re-entering the context).
pt_br: Quaisquer alterações nos valores de :class:`ContextVar` por meio do método :meth:`ContextVar.set` são registradas no contexto atual. O método :meth:`ContextVar.get` retorna o valor associado ao contexto atual. Sair de um contexto efetivamente reverte quaisquer alterações feitas nas variáveis de contexto enquanto o contexto foi inserido (se necessário, os valores podem ser restaurados ao inserir novamente o contexto).

source: Context implements the :class:`collections.abc.Mapping` interface.
pt_br: Context implementa a interface :class:`collections.abc.Mapping`.

source: Enters the Context, executes ``callable(*args, **kwargs)``, then exits the Context. Returns *callable*'s return value, or propagates an exception if one occurred.
pt_br: Entra no Context, executa ``callable(*args, **kwargs)`` e sai do Context. Retorna o valor de retorno de *callable* ou propaga uma exceção, se ocorrer uma.

source: Example:
pt_br: Exemplo:

source: import contextvars var = contextvars.ContextVar('var') var.set('spam') print(var.get()) # 'spam' ctx = contextvars.copy_context() def main(): # 'var' was set to 'spam' before # calling 'copy_context()' and 'ctx.run(main)', so: print(var.get()) # 'spam' print(ctx[var]) # 'spam' var.set('ham') # Now, after setting 'var' to 'ham': print(var.get()) # 'ham' print(ctx[var]) # 'ham' # Any changes that the 'main' function makes to 'var' # will be contained in 'ctx'. ctx.run(main) # The 'main()' function was run in the 'ctx' context, # so changes to 'var' are contained in it: print(ctx[var]) # 'ham' # However, outside of 'ctx', 'var' is still set to 'spam': print(var.get()) # 'spam'
pt_br: import contextvars var = contextvars.ContextVar('var') var.set('spam') print(var.get()) # 'spam' ctx = contextvars.copy_context() def main(): # 'var' foi definida para 'spam' antes de # chamar 'copy_context()' e 'ctx.run(main)', então: print(var.get()) # 'spam' print(ctx[var]) # 'spam' var.set('ham') # Agora, após definir 'var' para 'ham': print(var.get()) # 'ham' print(ctx[var]) # 'ham' # Qualquer alteração que a função 'main' feitas a 'var' # serão contidos em 'ctx'. ctx.run(main) # A função 'main()' era executada no contexto 'ctx', # então alterações a 'var' são contidas nele: print(ctx[var]) # 'ham' # No entanto, fora de 'ctx', 'var' ainda está definida para 'spam': print(var.get()) # 'spam'

source: Return a shallow copy of the context object.
pt_br: Retorna uma cópia rasa do objeto contexto.

source: Return ``True`` if the *context* has a value for *var* set; return ``False`` otherwise.
pt_br: Retorna ``True`` se *context* tem uma variável para *var* definida; do contrário, retorna ``False``.

source: Return the value of the *var* :class:`ContextVar` variable. If the variable is not set in the context object, a :exc:`KeyError` is raised.
pt_br: Retorna o valor da variável :class:`ContextVar` *var*. Se a variável não for definida no objeto contexto, uma :exc:`KeyError` é levantada.

source: Return the value for *var* if *var* has the value in the context object. Return *default* otherwise. If *default* is not given, return ``None``.
pt_br: Retorna o valor para *var* se *var* tiver o valor no objeto contexto. Caso contrário, retorna *default*. Se *default* não for fornecido, retorna ``None``.

source: Return an iterator over the variables stored in the context object.
pt_br: Retorna um iterador sobre as variáveis armazenadas no objeto contexto.

source: Return the number of variables set in the context object.
pt_br: Retorna o número das variáveis definidas no objeto contexto.

source: Return a list of all variables in the context object.
pt_br: Retorna uma lista de todas as variáveis no objeto contexto.

source: Return a list of all variables' values in the context object.
pt_br: Retorna uma lista dos valores de todas as variáveis no objeto contexto.

source: Return a list of 2-tuples containing all variables and their values in the context object.
pt_br: Retorna uma lista de tuplas de 2 elementos contendo todas as variáveis e seus valores no objeto contexto.

source: asyncio support
pt_br: Suporte a asyncio

source: Context variables are natively supported in :mod:`asyncio` and are ready to be used without any extra configuration. For example, here is a simple echo server, that uses a context variable to make the address of a remote client available in the Task that handles that client::
pt_br: Variáveis de contexto encontram suporte nativo em :mod:`asyncio` e estão prontas para serem usadas sem qualquer configuração extra. Por exemplo, aqui está um servidor simples de eco, que usa uma variável de contexto para disponibilizar o endereço de um cliente remoto na Task que lida com esse cliente::

source: import asyncio import contextvars client_addr_var = contextvars.ContextVar('client_addr') def render_goodbye(): # The address of the currently handled client can be accessed # without passing it explicitly to this function. client_addr = client_addr_var.get() return f'Good bye, client @ {client_addr}\r\n'.encode() async def handle_request(reader, writer): addr = writer.transport.get_extra_info('socket').getpeername() client_addr_var.set(addr) # In any code that we call is now possible to get # client's address by calling 'client_addr_var.get()'. while True: line = await reader.readline() print(line) if not line.strip(): break writer.write(b'HTTP/1.1 200 OK\r\n') # status line writer.write(b'\r\n') # headers writer.write(render_goodbye()) # body writer.close() async def main(): srv = await asyncio.start_server( handle_request, '127.0.0.1', 8081) async with srv: await srv.serve_forever() asyncio.run(main()) # To test it you can use telnet or curl: # telnet 127.0.0.1 8081 # curl 127.0.0.1:8081
pt_br: import asyncio import contextvars client_addr_var = contextvars.ContextVar('client_addr') def render_goodbye(): # O endereço do cliente atualmente manipulado pode ser acessado # sem passá-lo explicitamente para esta função. client_addr = client_addr_var.get() return f'Good bye, client @ {client_addr}\r\n'.encode() async def handle_request(reader, writer): addr = writer.transport.get_extra_info('socket').getpeername() client_addr_var.set(addr) # Em qualquer código que chamamos agora é possível obter # o endereço do cliente chamando 'client_addr_var.get()'. while True: line = await reader.readline() print(line) if not line.strip(): break writer.write(b'HTTP/1.1 200 OK\r\n') # linha de status writer.write(b'\r\n') # cabeçalhos writer.write(render_goodbye()) # corpo writer.close() async def main(): srv = await asyncio.start_server( handle_request, '127.0.0.1', 8081) async with srv: await srv.serve_forever() asyncio.run(main()) # Para testá-lo, você pode usar telnet ou curl: # telnet 127.0.0.1 8081 # curl 127.0.0.1:8081
