Repository: python/python-docs-pt-br
Catalog: library/copy.po
Languages: pt_br

source: :mod:`!copy` --- Shallow and deep copy operations
pt_br: :mod:`!copy` --- Operações de cópia profunda e cópia rasa

source: **Source code:** :source:`Lib/copy.py`
pt_br: **Código-fonte:** :source:`Lib/copy.py`

source: Assignment statements in Python do not copy objects, they create bindings between a target and an object. For collections that are mutable or contain mutable items, a copy is sometimes needed so one can change one copy without changing the other. This module provides generic shallow and deep copy operations (explained below).
pt_br: As instruções de atribuição no Python não copiam objetos, elas criam ligações entre um destino e um objeto. Para coleções que são mutáveis ou contêm itens mutáveis, às vezes é necessária uma cópia para que seja possível alterar uma cópia sem alterar a outra. Este módulo fornece operações genéricas de cópia profunda e rasa (explicadas abaixo).

source: Interface summary:
pt_br: Resumo da interface:

source: Return a shallow copy of *obj*.
pt_br: Retorna uma cópia rasa de *obj*.

source: Return a deep copy of *obj*.
pt_br: Retorna uma cópia profunda de *obj*.

source: Creates a new object of the same type as *obj*, replacing fields with values from *changes*.
pt_br: Cria um novo objeto do mesmo tipo que *obj*, substituindo campos por valores de *changes*.

source: Raised for module specific errors.
pt_br: Levantada para erros específicos do módulo.

source: The difference between shallow and deep copying is only relevant for compound objects (objects that contain other objects, like lists or class instances):
pt_br: A diferença entre cópia profunda e rasa é relevante apenas para objetos compostos (objetos que contêm outros objetos, como listas ou instâncias de classe):

source: A *shallow copy* constructs a new compound object and then (to the extent possible) inserts *references* into it to the objects found in the original.
pt_br: Uma *cópia rasa* constrói um novo objeto composto e então (na medida do possível) insere nele *referências* aos objetos encontrados no original.

source: A *deep copy* constructs a new compound object and then, recursively, inserts *copies* into it of the objects found in the original.
pt_br: Uma *cópia profunda* constrói um novo objeto composto e então, recursivamente, insere nele *cópias* dos objetos encontrados no original.

source: Two problems often exist with deep copy operations that don't exist with shallow copy operations:
pt_br: Frequentemente, existem dois problemas com operações de cópia profunda que não existem com operações de cópia rasa:

source: Recursive objects (compound objects that, directly or indirectly, contain a reference to themselves) may cause a recursive loop.
pt_br: Objetos recursivos (objetos compostos que, direta ou indiretamente, contêm uma referência a si mesmos) podem causar um laço recursivo.

source: Because deep copy copies everything it may copy too much, such as data which is intended to be shared between copies.
pt_br: Como a cópia profunda copia tudo, ela pode copiar muito, como dados que devem ser compartilhados entre as cópias.

source: The :func:`deepcopy` function avoids these problems by:
pt_br: A função :func:`deepcopy` evita esses problemas:

source: keeping a ``memo`` dictionary of objects already copied during the current copying pass; and
pt_br: mantendo um dicionário ``memo`` de objetos já copiados durante a passagem de cópia atual; e

source: letting user-defined classes override the copying operation or the set of components copied.
pt_br: permitindo que as classes definidas pelo usuário substituam a operação de cópia ou o conjunto de componentes copiados.

source: This module does not copy types like module, method, stack trace, stack frame, file, socket, window, or any similar types. It does "copy" functions and classes (shallow and deeply), by returning the original object unchanged; this is compatible with the way these are treated by the :mod:`pickle` module.
pt_br: Este módulo não copia tipos como módulo, método, stack trace (situação da pilha de execução), quadro de empilhamento, arquivo, soquete, janela ou outros tipos semelhantes. Ele "copia" funções e classes (rasas e profundamente), devolvendo o objeto original inalterado; isso é compatível com a maneira que estes itens são tratados pelo módulo :mod:`pickle`.

source: Shallow copies of dictionaries can be made using :meth:`dict.copy`, and of lists by assigning a slice of the entire list, for example, ``copied_list = original_list[:]``.
pt_br: Cópias rasas de dicionários podem ser feitas usando :meth:`dict.copy`, e de listas atribuindo uma fatia de toda a lista, por exemplo, ``lista_copiada = lista_original[:]``.

source: Classes can use the same interfaces to control copying that they use to control pickling. See the description of module :mod:`pickle` for information on these methods. In fact, the :mod:`copy` module uses the registered pickle functions from the :mod:`copyreg` module.
pt_br: As classes podem usar as mesmas interfaces para controlar a cópia que usam para controlar a serialização com pickle. Veja a descrição do módulo :mod:`pickle` para informações sobre esses métodos. Na verdade, o módulo :mod:`copy` usa as funções pickle registradas do módulo :mod:`copyreg`.

source: In order for a class to define its own copy implementation, it can define special methods :meth:`~object.__copy__` and :meth:`~object.__deepcopy__`.
pt_br: Para que uma classe defina sua própria implementação de cópia, ela pode definir métodos especiais :meth:`~object.__copy__` e :meth:`~object.__deepcopy__`.

source: Called to implement the shallow copy operation; no additional arguments are passed.
pt_br: Chamado para implementar a operação de cópia rasa; nenhum argumento adicional é passado.

source: Called to implement the deep copy operation; it is passed one argument, the *memo* dictionary. If the ``__deepcopy__`` implementation needs to make a deep copy of a component, it should call the :func:`~copy.deepcopy` function with the component as first argument and the *memo* dictionary as second argument. The *memo* dictionary should be treated as an opaque object.
pt_br: Chamado para implementar a operação de cópia profunda; é passado um argumento, o dicionário *memo*. Se a implementação ``__deepcopy__`` precisar fazer uma cópia profunda de um componente, ela deve chamar a função :func:`~copy.deepcopy` com o componente como primeiro argumento e o dicionário *memo* como segundo argumento. O dicionário *memo* deve ser tratado como um objeto opaco.

source: Function :func:`!copy.replace` is more limited than :func:`~copy.copy` and :func:`~copy.deepcopy`, and only supports named tuples created by :func:`~collections.namedtuple`, :mod:`dataclasses`, and other classes which define method :meth:`~object.__replace__`.
pt_br: A função :func:`!copy.replace` é mais limitada que :func:`~copy.copy` e :func:`~copy.deepcopy`, e tem suporte a apenas tuplas nomeadas criadas por :func:`~collections.namedtuple`, :mod:`dataclasses` e outras classes que definem o método :meth:`~object.__replace__`.

source: This method should create a new object of the same type, replacing fields with values from *changes*.
pt_br: Este método deve criar um novo objeto do mesmo tipo, substituindo campos por valores de *changes*.

source: Module :mod:`pickle`
pt_br: Módulo :mod:`pickle`

source: Discussion of the special methods used to support object state retrieval and restoration.
pt_br: Discussão dos métodos especiais usados para dar suporte à recuperação e restauração do estado do objeto.

source: module
pt_br: módulo

source: __copy__() (copy protocol)
pt_br: __copy__() (protocolo de cópia)

source: __deepcopy__() (copy protocol)
pt_br: __deepcopy__() (protocolo de cópia)

source: __replace__() (replace protocol)
pt_br: __replace__() (protocolo de substituição)
