Repository: python/python-docs-pt-br
Catalog: library/copyreg.po
Languages: pt_br

source: :mod:`!copyreg` --- Register :mod:`!pickle` support functions
pt_br: :mod:`!copyreg` --- Registra funções de suporte :mod:`!pickle`

source: **Source code:** :source:`Lib/copyreg.py`
pt_br: **Código-fonte:** :source:`Lib/copyreg.py`

source: The :mod:`copyreg` module offers a way to define functions used while pickling specific objects. The :mod:`pickle` and :mod:`copy` modules use those functions when pickling/copying those objects. The module provides configuration information about object constructors which are not classes. Such constructors may be factory functions or class instances.
pt_br: O módulo :mod:`copyreg` oferece uma maneira de definir as funções usadas durante a remoção de objetos específicos. Os módulos :mod:`pickle` e :mod:`copy` usam essas funções ao selecionar/copiar esses objetos. O módulo fornece informações de configuração sobre construtores de objetos que não são classes. Esses construtores podem ser funções de fábrica ou instâncias de classes.

source: Declares *object* to be a valid constructor. If *object* is not callable (and hence not valid as a constructor), raises :exc:`TypeError`.
pt_br: Declara *object* para ser um construtor válido. Se *object* não for chamável (e, portanto, não for válido como um construtor), levanta :exc:`TypeError`.

source: Declares that *function* should be used as a "reduction" function for objects of type *type*. *function* must return either a string or a tuple containing between two and six elements. See the :attr:`~pickle.Pickler.dispatch_table` for more details on the interface of *function*.
pt_br: Declara que a *function* deve ser usada como uma função de "redução" para objetos do tipo *type*. *function* deve retornar uma string ou uma tupla contendo entre dois e seis elementos. Veja :attr:`~pickle.Pickler.dispatch_table` para mais detalhes sobre a interface da *function*.

source: The *constructor_ob* parameter is a legacy feature and is now ignored, but if passed it must be a callable.
pt_br: O parâmetro *constructor_ob* é um recurso herdado e agora é ignorado, mas se passado deve ser UM chamável.

source: Note that the :attr:`~pickle.Pickler.dispatch_table` attribute of a pickler object or subclass of :class:`pickle.Pickler` can also be used for declaring reduction functions.
pt_br: Note que o atributo :attr:`~pickle.Pickler.dispatch_table` de um objeto pickler ou subclasse de :class:`pickle.Pickler` também podem ser usados para declarar funções de redução.

source: Example
pt_br: Exemplo

source: The example below would like to show how to register a pickle function and how it will be used:
pt_br: O exemplo abaixo gostaria de mostrar como registrar uma função de pickle e como ela será usada:

source: module
pt_br: módulo
