Repository: python/python-docs-pt-br
Catalog: library/crypt.po
Languages: pt_br

source: :mod:`crypt` --- Function to check Unix passwords
pt_br: :mod:`crypt` --- Функція для перевірки паролів Unix

source: **Source code:** :source:`Lib/crypt.py`
pt_br: **Вихідний код:** :source:`Lib/crypt.py`

source: This module implements an interface to the :manpage:`crypt(3)` routine, which is a one-way hash function based upon a modified DES algorithm; see the Unix man page for further details. Possible uses include storing hashed passwords so you can check passwords without storing the actual password, or attempting to crack Unix passwords with a dictionary.
pt_br: Цей модуль реалізує інтерфейс до процедури :manpage:`crypt(3)`, яка є односторонньою хеш-функцією на основі модифікованого алгоритму DES; подробиці див. на сторінці довідки Unix. Можливе використання включає зберігання хешованих паролів, щоб ви могли перевіряти паролі, не зберігаючи справжній пароль, або спробу зламати паролі Unix за допомогою словника.

source: Notice that the behavior of this module depends on the actual implementation of the :manpage:`crypt(3)` routine in the running system. Therefore, any extensions available on the current implementation will also be available on this module.
pt_br: Зауважте, що поведінка цього модуля залежить від фактичної реалізації підпрограми :manpage:`crypt(3)` у запущеній системі. Тому будь-які розширення, доступні для поточної реалізації, також будуть доступні в цьому модулі.

source: :ref:`Availability <availability>`: Unix, not VxWorks.
pt_br: :ref:`Disponibilidade <availability>`: Unix, não VxWorks.

source: :ref:`Availability <availability>`: not Emscripten, not WASI.
pt_br: :ref:`利用可能性<availability>`: Emscripten でなく、WASI でもないこと。

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
pt_br: このモジュールは WebAssembly プラットフォーム ``wasm32-emscripten`` と ``wasm32-wasi`` では動作しないか、利用不可です。詳しくは、:ref:`wasm-availability` を見てください。

source: Hashing Methods
pt_br: Методи хешування

source: The :mod:`crypt` module defines the list of hashing methods (not all methods are available on all platforms):
pt_br: Модуль :mod:`crypt` визначає список методів хешування (не всі методи доступні на всіх платформах):

source: A Modular Crypt Format method with 16 character salt and 86 character hash based on the SHA-512 hash function. This is the strongest method.
pt_br: Метод Modular Crypt Format із 16-символьним кодом і 86-символьним хешем на основі хеш-функції SHA-512. Це найсильніший метод.

source: Another Modular Crypt Format method with 16 character salt and 43 character hash based on the SHA-256 hash function.
pt_br: Інший метод Modular Crypt Format із 16-символьною сольовою і 43-символьною хеш-функцією на основі хеш-функції SHA-256.

source: Another Modular Crypt Format method with 22 character salt and 31 character hash based on the Blowfish cipher.
pt_br: Ще один метод Modular Crypt Format із 22 символами і хеш-кодом із 31 символу на основі шифру Blowfish.

source: Another Modular Crypt Format method with 8 character salt and 22 character hash based on the MD5 hash function.
pt_br: Інший метод Modular Crypt Format із 8-символьною сольовою і 22-символьною хеш-функцією на основі хеш-функції MD5.

source: The traditional method with a 2 character salt and 13 characters of hash. This is the weakest method.
pt_br: Традиційний метод із 2 символами солі та 13 символами хешу. Це найслабший метод.

source: Module Attributes
pt_br: Атрибути модуля

source: A list of available password hashing algorithms, as ``crypt.METHOD_*`` objects. This list is sorted from strongest to weakest.
pt_br: Список доступних алгоритмів хешування паролів у вигляді об’єктів ``crypt.METHOD_*``. Цей список відсортовано від найсильнішого до найслабшого.

source: Module Functions
pt_br: Функції модуля

source: The :mod:`crypt` module defines the following functions:
pt_br: Модуль :mod:`crypt` визначає такі функції:

source: *word* will usually be a user's password as typed at a prompt or in a graphical interface. The optional *salt* is either a string as returned from :func:`mksalt`, one of the ``crypt.METHOD_*`` values (though not all may be available on all platforms), or a full encrypted password including salt, as returned by this function. If *salt* is not provided, the strongest method available in :attr:`methods` will be used.
pt_br: *word* зазвичай буде паролем користувача, який вводиться під час запиту або в графічному інтерфейсі. Необов’язковий *salt* — це або рядок, отриманий від :func:`mksalt`, одне зі значень ``crypt.METHOD_*`` (хоча не всі можуть бути доступні на всіх платформах), або повний зашифрований пароль, включаючи сіль , що повертається цією функцією. Якщо *salt* не вказано, буде використано найсильніший метод, доступний у :attr:`methods`.

source: Checking a password is usually done by passing the plain-text password as *word* and the full results of a previous :func:`crypt` call, which should be the same as the results of this call.
pt_br: Перевірка пароля зазвичай здійснюється шляхом передачі простого текстового пароля як *word* і повних результатів попереднього виклику :func:`crypt`, які мають бути такими ж, як і результати цього виклику.

source: *salt* (either a random 2 or 16 character string, possibly prefixed with ``$digit$`` to indicate the method) which will be used to perturb the encryption algorithm. The characters in *salt* must be in the set ``[./a-zA-Z0-9]``, with the exception of Modular Crypt Format which prefixes a ``$digit$``.
pt_br: *salt* (довільний рядок із 2 або 16 символів, можливо, із префіксом ``$digit$`` для вказівки методу), який використовуватиметься для порушення алгоритму шифрування. Символи в *salt* мають бути в наборі ``[./a-zA-Z0-9]``, за винятком Modular Crypt Format, який має префікс ``$digit$``.

source: Returns the hashed password as a string, which will be composed of characters from the same alphabet as the salt.
pt_br: Повертає хешований пароль у вигляді рядка, який буде складатися із символів того самого алфавіту, що й сіль.

source: Since a few :manpage:`crypt(3)` extensions allow different values, with different sizes in the *salt*, it is recommended to use the full crypted password as salt when checking for a password.
pt_br: Оскільки кілька розширень :manpage:`crypt(3)` допускають різні значення з різними розмірами *salt*, рекомендується використовувати повний зашифрований пароль як сіль під час перевірки пароля.

source: Accept ``crypt.METHOD_*`` values in addition to strings for *salt*.
pt_br: Приймайте значення ``crypt.METHOD_*`` на додаток до рядків для *salt*.

source: Return a randomly generated salt of the specified method. If no *method* is given, the strongest method available in :attr:`methods` is used.
pt_br: Повертає випадково згенеровану сіль вказаного методу. Якщо *method* не вказано, використовується найсильніший метод, доступний у :attr:`methods`.

source: The return value is a string suitable for passing as the *salt* argument to :func:`crypt`.
pt_br: Повернене значення — це рядок, який можна передати як аргумент *salt* до :func:`crypt`.

source: *rounds* specifies the number of rounds for ``METHOD_SHA256``, ``METHOD_SHA512`` and ``METHOD_BLOWFISH``. For ``METHOD_SHA256`` and ``METHOD_SHA512`` it must be an integer between ``1000`` and ``999_999_999``, the default is ``5000``. For ``METHOD_BLOWFISH`` it must be a power of two between ``16`` (2\ :sup:`4`) and ``2_147_483_648`` (2\ :sup:`31`), the default is ``4096`` (2\ :sup:`12`).
pt_br: *rounds* визначає кількість раундів для ``METHOD_SHA256``, ``METHOD_SHA512`` і ``METHOD_BLOWFISH``. Для ``METHOD_SHA256`` і ``METHOD_SHA512`` воно має бути цілим числом від ``1000`` до ``999_999_999``, за замовчуванням ``5000``. Для ``METHOD_BLOWFISH`` це має бути ступінь двох між ``16`` (2\ :sup:`4`) і ``2_147_483_648`` (2\ :sup:`31`), за замовчуванням ``4096`` (2\ :sup:`12`).

source: Added the *rounds* parameter.
pt_br: Додано параметр *rounds*.

source: Examples
pt_br: Exemplos

source: A simple example illustrating typical use (a constant-time comparison operation is needed to limit exposure to timing attacks. :func:`hmac.compare_digest` is suitable for this purpose)::
pt_br: Простий приклад, що ілюструє типове використання (операція порівняння в постійному часі необхідна для обмеження впливу часових атак. :func:`hmac.compare_digest` підходить для цієї мети)::

source: To generate a hash of a password using the strongest available method and check it against the original::
pt_br: Щоб згенерувати хеш пароля за допомогою найнадійнішого доступного методу та порівняти його з оригіналом:

source: cipher
pt_br: шифровать
