Repository: python/python-docs-pt-br
Catalog: library/csv.po
Languages: pt_br

source: To make it easier to specify the format of input and output records, specific formatting parameters are grouped together into dialects. A dialect is a subclass of the :class:`Dialect` class containing various attributes describing the format of the CSV file. When creating :class:`reader` or :class:`writer` objects, the programmer can specify a string or a subclass of the :class:`Dialect` class as the dialect parameter. In addition to, or instead of, the *dialect* parameter, the programmer can also specify individual formatting parameters, which have the same names as the attributes defined below for the :class:`Dialect` class.
pt_br: Para facilitar a especificação do formato dos registros de entrada e saída, parâmetros específicos de formatação são agrupados em dialetos. Um dialeto é uma subclasse da classe :class:`Dialect` contendo vários atributos descrevendo o formato do arquivo CSV. Ao criar objetos :class:`reader` ou :class:`writer`, o programador pode especificar uma string ou uma subclasse da classe :class:`Dialect` como parâmetro de dialeto. Além do parâmetro *dialect*, ou em vez do parâmetro *dialect*, o programador também pode especificar parâmetros de formatação individuais, com os mesmos nomes dos atributos definidos abaixo para a classe :class:`Dialect`.

source: Dialects support the following attributes:
pt_br: Os dialetos possuem suporte aos seguintes atributos:

source: A one-character string used to separate fields. It defaults to ``','``.
pt_br: Uma string de um caractere usada para separar campos. O padrão é ``','``.

source: Controls how instances of *quotechar* appearing inside a field should themselves be quoted. When :const:`True`, the character is doubled. When :const:`False`, the *escapechar* is used as a prefix to the *quotechar*. It defaults to :const:`True`.
pt_br: Controla como as instâncias de *quotechar* que aparecem dentro de um campo devem estar entre aspas. Quando :const:`True`, o caractere é dobrado. Quando :const:`False`, o *escapechar* é usado como um prefixo para o *quotechar*. O padrão é :const:`True`.

source: On output, if *doublequote* is :const:`False` and no *escapechar* is set, :exc:`Error` is raised if a *quotechar* is found in a field.
pt_br: Na saída, se *doublequote* for :const:`False` e não *escapeechar* for definido, :exc:`Error` é levantada se um *quotechar* é encontrado em um campo.

source: A one-character string used by the writer to escape characters that require escaping:
pt_br: Uma string de caracteres de um caractere usada pelo escritor para escapar caracteres que exigem escape:

source: the *delimiter*, the *quotechar*, ``'\r'``, ``'\n'`` and any of the characters in *lineterminator* are escaped if *quoting* is set to :const:`QUOTE_NONE`;
pt_br: o *delimiter*, o *quotechar*, ``'\r'``, ``'\n'`` e qualquer um dos caracteres em *lineterminator* são escapados se *quoting* estiver definido como :const:`QUOTE_NONE`;

source: the *quotechar* is escaped if *doublequote* is :const:`False`;
pt_br: o *quotechar* é escapado se *doublequote* for :const:`False`;

source: the *escapechar* itself.
pt_br: o *escapechar* em si.

source: On reading, the *escapechar* removes any special meaning from the following character. It defaults to :const:`None`, which disables escaping.
pt_br: Na leitura, o *escapechar* remove qualquer significado especial do caractere seguinte. O padrão é :const:`None`, o que desabilita o escape.

source: An empty *escapechar* is not allowed.
pt_br: Um *escapechar* vazio não é permitido.

source: The string used to terminate lines produced by the :class:`writer`. It defaults to ``'\r\n'``.
pt_br: A string usada para terminar as linhas produzidas pelo :class:`writer`. O padrão é ``'\r\n'``.

source: The :class:`reader` is hard-coded to recognise either ``'\r'`` or ``'\n'`` as end-of-line, and ignores *lineterminator*. This behavior may change in the future.
pt_br: A :class:`reader` é codificada para reconhecer ``'\r'`` ou ``'\n'`` como fim de linha e ignora *lineterminator*. Esse comportamento pode mudar no futuro.

source: A one-character string used to quote fields containing special characters, such as the *delimiter* or the *quotechar*, or which contain new-line characters (``'\r'``, ``'\n'`` or any of the characters in *lineterminator*). It defaults to ``'"'``. Can be set to ``None`` to prevent escaping ``'"'`` if *quoting* is set to :const:`QUOTE_NONE`.
pt_br: Uma string de um caractere usada para colocar entre aspas campos que contêm caracteres especiais, como o *delimiter* ou o *quotechar*, ou que contêm caracteres de nova linha (``'\r'``, ``'\n'`` ou qualquer um dos caracteres em *lineterminator*). O padrão é ``'"'``. Pode ser definido como ``None`` para evitar o escape de ``'"'`` se *aspas* estiver definido como :const:`QUOTE_NONE`.

source: An empty *quotechar* is not allowed.
pt_br: Um *quotechar* vazio não é permitido.

source: Controls when quotes should be generated by the writer and recognised by the reader. It can take on any of the :ref:`QUOTE_\* constants <csv-constants>` and defaults to :const:`QUOTE_MINIMAL` if *quotechar* is not ``None``, and :const:`QUOTE_NONE` otherwise.
pt_br: Controla quando as aspas devem ser geradas pelo escritor e reconhecidas pelo leitor. Ele pode assumir qualquer uma das constantes :ref:`QUOTE_\* constants <csv-constants>` e o padrão é :const:`QUOTE_MINIMAL`. se *quotechar* não for ``None`` e, do contrário, :const:`QUOTE_NONE`.

source: When :const:`True`, spaces immediately following the *delimiter* are ignored. The default is :const:`False`. When combining ``delimiter=' '`` with ``skipinitialspace=True``, unquoted empty fields are not allowed.
pt_br: Quando :const:`True`, os espaços imediatamente após o *delimitador* são ignorados. O padrão é :const:`False`. Ao combinar ``delimiter=' '`` com ``skipinitialspace=True``, campos vazios sem aspas não são permitidos.

source: When ``True``, raise exception :exc:`Error` on bad CSV input. The default is ``False``.
pt_br: Quando ``True``, levanta a exceção :exc:`Error` em uma entrada CSV ruim. O padrão é ``False``.

source: Reader Objects
pt_br: Objetos Reader

source: Reader objects (:class:`DictReader` instances and objects returned by the :func:`reader` function) have the following public methods:
pt_br: Os objetos Reader (instâncias :class:`DictReader` e objetos retornados pela função :func:`reader`) têm os seguintes métodos públicos:

source: Return the next row of the reader's iterable object as a list (if the object was returned from :func:`reader`) or a dict (if it is a :class:`DictReader` instance), parsed according to the current :class:`Dialect`. Usually you should call this as ``next(reader)``.
pt_br: Retorna a próxima linha do objeto iterável do leitor como uma lista (se o objeto foi retornado de :func:`leitor`) ou um dict (se for uma instância de :class:`DictReader`), analisado de acordo com a :class:`Dialect` atual. Normalmente, você deve chamar isso de ``next(reader)``.

source: Reader objects have the following public attributes:
pt_br: Os objetos Reader possuem os seguintes atributos públicos:

source: A read-only description of the dialect in use by the parser.
pt_br: Uma descrição somente leitura do dialeto em uso pelo analisador sintático.

source: The number of lines read from the source iterator. This is not the same as the number of records returned, as records can span multiple lines.
pt_br: O número de linhas lidas no iterador de origem. Não é o mesmo que o número de registros retornados, pois os registros podem abranger várias linhas.

source: DictReader objects have the following public attribute:
pt_br: Os objetos DictReader têm o seguinte atributo público:

source: If not passed as a parameter when creating the object, this attribute is initialized upon first access or when the first record is read from the file.
pt_br: Se não for passado como parâmetro ao criar o objeto, esse atributo será inicializado no primeiro acesso ou quando o primeiro registro for lido no arquivo.

source: Writer Objects
pt_br: Objetos Writer

source: :class:`writer` objects (:class:`DictWriter` instances and objects returned by the :func:`writer` function) have the following public methods. A *row* must be an iterable of strings or numbers for :class:`writer` objects and a dictionary mapping fieldnames to strings or numbers (by passing them through :func:`str` first) for :class:`DictWriter` objects. Note that complex numbers are written out surrounded by parens. This may cause some problems for other programs which read CSV files (assuming they support complex numbers at all).
pt_br: Objetos :class:`writer` (instâncias e objetos :class:`DictWriter` retornados pela função :func:`writer`) possuem os seguintes métodos públicos. Uma *row* deve ser iterável de strings ou números para objetos :class:`writer` e um dicionário mapeando nomes de campos para strings ou números (passando-os por :func:`str` primeiro) para :class:`DictWriter`. Observe que números complexos são escritos cercados por parênteses. Isso pode causar alguns problemas para outros programas que leem arquivos CSV (supondo que eles aceitem números complexos).

source: Write the *row* parameter to the writer's file object, formatted according to the current :class:`Dialect`. Return the return value of the call to the *write* method of the underlying file object.
pt_br: Escreve o parâmetro *row* no objeto arquivo do escritor, formatado de acordo com a :class:`Dialect` atual. Retorna o valor de retorno da chamada ao método *write* do objeto arquivo subjacente.

source: Added support of arbitrary iterables.
pt_br: Adicionado suporte a iteráveis arbitrários.

source: Write all elements in *rows* (an iterable of *row* objects as described above) to the writer's file object, formatted according to the current dialect.
pt_br: Escreve todos os elementos em *rows* (um iterável de objetos *row*, conforme descrito acima) no objeto arquivo do escritor, formatado de acordo com o dialeto atual.

source: Writer objects have the following public attribute:
pt_br: Os objetos Writer têm o seguinte atributo público:

source: A read-only description of the dialect in use by the writer.
pt_br: Uma descrição somente leitura do dialeto em uso pelo escritor.

source: DictWriter objects have the following public method:
pt_br: Os objetos DictWriter têm o seguinte método público:

source: Write a row with the field names (as specified in the constructor) to the writer's file object, formatted according to the current dialect. Return the return value of the :meth:`csvwriter.writerow` call used internally.
pt_br: Escreve uma linha com os nomes dos campos (conforme especificado no construtor) no objeto arquivo do escritor, formatado de acordo com o dialeto atual. Retorna o valor de retorno da chamada :meth:`csvwriter.writerow` usada internamente.

source: :meth:`writeheader` now also returns the value returned by the :meth:`csvwriter.writerow` method it uses internally.
pt_br: :meth:`writeheader` agora também retorna o valor retornado pelo método :meth:`csvwriter.writerow` que ele usa internamente.

source: Examples
pt_br: Exemplos

source: The simplest example of reading a CSV file::
pt_br: O exemplo mais simples de leitura de um arquivo CSV::

source: Reading a file with an alternate format::
pt_br: Lendo um arquivo com um formato alternativo::

source: The corresponding simplest possible writing example is::
pt_br: O exemplo de escrita possível mais simples possível é::

source: Since :func:`open` is used to open a CSV file for reading, the file will by default be decoded into unicode using the system default encoding (see :func:`locale.getencoding`). To decode a file using a different encoding, use the ``encoding`` argument of open::
pt_br: Como :func:`open` é usado para abrir um arquivo CSV para leitura, o arquivo será decodificado por padrão em unicode usando a codificação padrão do sistema (consulte :func:`locale.getencoding`). Para decodificar um arquivo usando uma codificação diferente, use o argumento ``encoding`` do open::

source: The same applies to writing in something other than the system default encoding: specify the encoding argument when opening the output file.
pt_br: O mesmo se aplica à escrita em algo diferente da codificação padrão do sistema: especifique o argumento de codificação ao abrir o arquivo de saída.

source: Registering a new dialect::
pt_br: Registrando um novo dialeto::

source: A slightly more advanced use of the reader --- catching and reporting errors::
pt_br: Um uso um pouco mais avançado do leitor --- capturando e relatando erros::

source: And while the module doesn't directly support parsing strings, it can easily be done::
pt_br: E embora o módulo não tenha suporte diretamente à análise sintática de strings, isso pode ser feito facilmente::

source: Footnotes
pt_br: Notas de rodapé

source: If ``newline=''`` is not specified, newlines embedded inside quoted fields will not be interpreted correctly, and on platforms that use ``\r\n`` line endings on write an extra ``\r`` will be added. It should always be safe to specify ``newline=''``, since the csv module does its own (:term:`universal <universal newlines>`) newline handling.
pt_br: Se ``newline=''`` não for especificado, quebras de linha inseridas em campos entre aspas não serão interpretadas corretamente e, em plataformas que usam terminações de linha ``\r\n`` na gravação, um ``\r`` extra será adicionado. É sempre seguro especificar ``newline=''``, já que o módulo csv faz seu próprio tratamento de quebra de linha (:term:`universal <universal newlines>`).

source: data
pt_br: dados

source: universal newlines
pt_br: novas linhas universais

source: csv.reader function
pt_br: função csv.reader
