Repository: python/python-docs-pt-br
Catalog: library/csv.po
Languages: pt_br

source: :mod:`!csv` --- CSV File Reading and Writing
pt_br: :mod:`!csv` --- Leitura e escrita de arquivos CSV

source: **Source code:** :source:`Lib/csv.py`
pt_br: **Código-fonte:** :source:`Lib/csv.py`

source: The so-called CSV (Comma Separated Values) format is the most common import and export format for spreadsheets and databases. CSV format was used for many years prior to attempts to describe the format in a standardized way in :rfc:`4180`. The lack of a well-defined standard means that subtle differences often exist in the data produced and consumed by different applications. These differences can make it annoying to process CSV files from multiple sources. Still, while the delimiters and quoting characters vary, the overall format is similar enough that it is possible to write a single module which can efficiently manipulate such data, hiding the details of reading and writing the data from the programmer.
pt_br: O chamado formato CSV (Comma Separated Values) é o formato mais comum de importação e exportação de planilhas e bancos de dados. O formato CSV foi usado por muitos anos antes das tentativas de descrever o formato de maneira padronizada em :rfc:`4180`. A falta de um padrão bem definido significa que existem diferenças sutis nos dados produzidos e consumidos por diferentes aplicativos. Essas diferenças podem tornar irritante o processamento de arquivos CSV de várias fontes. Ainda assim, enquanto os delimitadores e os caracteres de citação variam, o formato geral é semelhante o suficiente para que seja possível escrever um único módulo que possa manipular eficientemente esses dados, ocultando os detalhes da leitura e gravação dos dados do programador.

source: The :mod:`csv` module implements classes to read and write tabular data in CSV format. It allows programmers to say, "write this data in the format preferred by Excel," or "read data from this file which was generated by Excel," without knowing the precise details of the CSV format used by Excel. Programmers can also describe the CSV formats understood by other applications or define their own special-purpose CSV formats.
pt_br: O módulo :mod:`csv` implementa classes para ler e gravar dados tabulares no formato CSV. Ele permite que os programadores digam "escreva esses dados no formato preferido pelo Excel" ou "leia os dados desse arquivo gerado pelo Excel", sem conhecer os detalhes precisos do formato CSV usado pelo Excel. Os programadores também podem descrever os formatos CSV entendidos por outros aplicativos ou definir seus próprios formatos CSV para fins especiais.

source: The :mod:`csv` module's :class:`reader` and :class:`writer` objects read and write sequences. Programmers can also read and write data in dictionary form using the :class:`DictReader` and :class:`DictWriter` classes.
pt_br: Os objetos de :class:`reader` e :class:`writer` do módulo :mod:`csv` leem e escrevem sequências. Os programadores também podem ler e gravar dados no formato de dicionário usando as classes :class:`DictReader` e :class:`DictWriter`.

source: :pep:`305` - CSV File API
pt_br: :pep:`305` - API de arquivo CSV

source: The Python Enhancement Proposal which proposed this addition to Python.
pt_br: A proposta de melhoria do Python que propôs essa adição ao Python.

source: Module Contents
pt_br: Conteúdo do módulo

source: The :mod:`csv` module defines the following functions:
pt_br: O módulo :mod:`csv` define as seguintes funções:

source: Return a :ref:`reader object <reader-objects>` that will process lines from the given *csvfile*. A csvfile must be an iterable of strings, each in the reader's defined csv format. A csvfile is most commonly a file-like object or list. If *csvfile* is a file object, it should be opened with ``newline=''``. [1]_ An optional *dialect* parameter can be given which is used to define a set of parameters specific to a particular CSV dialect. It may be an instance of a subclass of the :class:`Dialect` class or one of the strings returned by the :func:`list_dialects` function. The other optional *fmtparams* keyword arguments can be given to override individual formatting parameters in the current dialect. For full details about the dialect and formatting parameters, see section :ref:`csv-fmt-params`.
pt_br: Retorna um :ref:`objeto leitor <reader-objects>` que irá iterar sobre as linhas no *csvfile* fornecido. Um csvfile deve ser um iterável de strings, cada uma no formato csv definido pelo leitor. Um csvfile é muito comumente um objeto similar a arquivo ou uma lista. Se *csvfile* for um objeto arquivo, ele deverá ser aberto com ``newline=''``. [1]_ Pode ser fornecido um parâmetro opcional *dialect*, usado para definir um conjunto de parâmetros específicos para um dialeto CSV específico. Pode ser uma instância de uma subclasse da classe :class:`Dialect` ou uma das strings retornadas pela função :func:`list_dialects`. Os outros argumentos nomeados opcionais *fmtparams* podem ser dados para substituir parâmetros de formatação individuais no dialeto atual. Para detalhes completos sobre os parâmetros de dialeto e formatação, consulte a seção :ref:`csv-fmt-params`.

source: Each row read from the csv file is returned as a list of strings. No automatic data type conversion is performed unless the :data:`QUOTE_NONNUMERIC` format option is specified (in which case unquoted fields are transformed into floats).
pt_br: Cada linha lida no arquivo csv é retornada como uma lista de strings. Nenhuma conversão automática de tipo de dados é executada, a menos que a opção de formato :data:`QUOTE_NONNUMERIC` seja especificada (nesse caso, os campos não citados são transformados em pontos flutuantes).

source: A short usage example::
pt_br: Um pequeno exemplo de uso::

source: Return a writer object responsible for converting the user's data into delimited strings on the given file-like object. *csvfile* can be any object with a :meth:`~io.TextIOBase.write` method. If *csvfile* is a file object, it should be opened with ``newline=''`` [1]_. An optional *dialect* parameter can be given which is used to define a set of parameters specific to a particular CSV dialect. It may be an instance of a subclass of the :class:`Dialect` class or one of the strings returned by the :func:`list_dialects` function. The other optional *fmtparams* keyword arguments can be given to override individual formatting parameters in the current dialect. For full details about dialects and formatting parameters, see the :ref:`csv-fmt-params` section. To make it as easy as possible to interface with modules which implement the DB API, the value :const:`None` is written as the empty string. While this isn't a reversible transformation, it makes it easier to dump SQL NULL data values to CSV files without preprocessing the data returned from a ``cursor.fetch*`` call. All other non-string data are stringified with :func:`str` before being written.
pt_br: Retorna um objeto de escrita responsável por converter os dados de usuário em strings delimitadas no objeto arquivo ou similar. *csvfile* pode ser qualquer objeto com um método :meth:`~io.TextIOBase.write`. Se *csvfile* for um objeto arquivo, ele deverá ser aberto com ``newline=''`` [1]_. Pode ser fornecido um parâmetro opcional *dialect*, usado para definir um conjunto de parâmetros específicos para um dialeto CSV específico. Pode ser uma instância de uma subclasse da classe :class:`Dialect` ou uma das strings retornadas pela função :func:`list_dialects`. Os outros argumentos nomeados opcionais *fmtparams* podem ser dados para substituir parâmetros de formatação individuais no dialeto atual. Para detalhes completos sobre os parâmetros de dialeto e formatação, consulte a seção :ref:`csv-fmt-params`. Para tornar o mais fácil possível a interface com os módulos que implementam a API do DB, o valor :const:`None` é escrito como uma string vazia. Embora isso não seja uma transformação reversível, torna mais fácil despejar valores de dados SQL NULL em arquivos CSV sem preprocessar os dados retornados de uma chamada ``cursor.fetch*``. Todos os outros dados que não são de strings são codificados com :func:`str` antes de serem escritos.

source: Associate *dialect* with *name*. *name* must be a string. The dialect can be specified either by passing a sub-class of :class:`Dialect`, or by *fmtparams* keyword arguments, or both, with keyword arguments overriding parameters of the dialect. For full details about dialects and formatting parameters, see section :ref:`csv-fmt-params`.
pt_br: Associa *dialect* a *name*. *name* deve ser uma string. O dialeto pode ser especificado passando uma subclasse de :class:`Dialect` ou por *fmtparams* argumentos nomeados, ou ambos, com argumentos nomeados substituindo os parâmetros do dialeto. Para detalhes completos sobre os parâmetros de dialeto e formatação, consulte a seção :ref:`csv-fmt-params`.

source: Delete the dialect associated with *name* from the dialect registry. An :exc:`Error` is raised if *name* is not a registered dialect name.
pt_br: Exclui o dialeto associado ao *name* do registro do dialeto. Um :exc:`Error` é levantado se *name* não for um nome de dialeto registrado.

source: Return the dialect associated with *name*. An :exc:`Error` is raised if *name* is not a registered dialect name. This function returns an immutable :class:`Dialect`.
pt_br: Retorna o dialeto associado a *name*. Um :exc:`Error` é levantado se *name* não for um nome de dialeto registrado. Esta função retorna uma classe :class:`Dialect` imutável.

source: Return the names of all registered dialects.
pt_br: Retorna os nomes de todos os dialetos registrados

source: Returns the current maximum field size allowed by the parser. If *new_limit* is given, this becomes the new limit.
pt_br: Retorna o tamanho máximo atual do campo permitido pelo analisador sintático. Se *new_limit* for fornecido, este se tornará o novo limite.

source: The :mod:`csv` module defines the following classes:
pt_br: O módulo :mod:`csv` define as seguintes classes:

source: Create an object that operates like a regular reader but maps the information in each row to a :class:`dict` whose keys are given by the optional *fieldnames* parameter.
pt_br: Cria um objeto que funcione como um leitor comum, mas mapeia as informações em cada linha para :class:`dict` cujas chaves são fornecidas pelo parâmetro opcional *fieldnames*.

source: The *fieldnames* parameter is a :term:`sequence`. If *fieldnames* is omitted, the values in the first row of file *f* will be used as the fieldnames and will be omitted from the results. If *fieldnames* is provided, they will be used and the first row will be included in the results. Regardless of how the fieldnames are determined, the dictionary preserves their original ordering.
pt_br: O parâmetro *fieldnames* é uma :term:`sequência`. Se *fieldnames* for omitido, os valores na primeira linha do arquivo *f* serão usados como nomes de campo e serão omitidos dos resultados. Se *fieldnames* for fornecido, eles serão usados e a primeira linha será incluída nos resultados. Independentemente de como os nomes de campo são determinados, o dicionário preserva sua ordem original.

source: If a row has more fields than fieldnames, the remaining data is put in a list and stored with the fieldname specified by *restkey* (which defaults to ``None``). If a non-blank row has fewer fields than fieldnames, the missing values are filled-in with the value of *restval* (which defaults to ``None``).
pt_br: Se uma linha tiver mais campos que nomes de campo, os dados restantes serão colocados em uma lista e armazenados com o nome do campo especificado por *restkey* (o padrão é ``None``). Se uma linha que não estiver em branco tiver menos campos que nomes de campo, os valores ausentes serão preenchidos com o valor *restval* (o padrão é ``None``).

source: All other optional or keyword arguments are passed to the underlying :class:`reader` instance.
pt_br: Todos os outros argumentos nomeados ou opcionais são passados para a instância subjacente de :class:`reader`.

source: If the argument passed to *fieldnames* is an iterator, it will be coerced to a :class:`list`.
pt_br: Se o argumento passado para *fieldnames* for um iterador, ele será convertido para uma :class:`list`.

source: Returned rows are now of type :class:`OrderedDict`.
pt_br: Linhas retornadas agora são do tipo :class:`OrderedDict`.

source: Returned rows are now of type :class:`dict`.
pt_br: As linhas retornadas agora são do tipo :class:`dict`.

source: Create an object which operates like a regular writer but maps dictionaries onto output rows. The *fieldnames* parameter is a :mod:`sequence <collections.abc>` of keys that identify the order in which values in the dictionary passed to the :meth:`~csvwriter.writerow` method are written to file *f*. The optional *restval* parameter specifies the value to be written if the dictionary is missing a key in *fieldnames*. If the dictionary passed to the :meth:`~csvwriter.writerow` method contains a key not found in *fieldnames*, the optional *extrasaction* parameter indicates what action to take. If it is set to ``'raise'``, the default value, a :exc:`ValueError` is raised. If it is set to ``'ignore'``, extra values in the dictionary are ignored. Any other optional or keyword arguments are passed to the underlying :class:`writer` instance.
pt_br: Cria um objeto que funcione como um de escrita comum, mas mapeia dicionários nas linhas de saída. O parâmetro *fieldnames* é uma :mod:`sequência <collections.abc>` de chaves que identificam a ordem na qual os valores no dicionário transmitidos para o método :meth:`~csvwriter.writerow` são escritos no arquivo *f*. O parâmetro opcional *restval* especifica o valor a ser escrito se o dicionário estiver com falta de uma chave em *fieldnames*. Se o dicionário transmitido para o método :meth:`~csvwriter.writerow` contiver uma chave não encontrada em *fieldnames*, o parâmetro opcional *extrasaction* indica qual ação executar. Se estiver definido como ``'raise'``, o valor padrão, a :exc:`ValueError` é levantada. Se estiver definido como ``'ignore'``, valores extras no dicionário serão ignorados. Quaisquer outros argumentos nomeados ou opcionais são passados para a instância subjacente de :class:`writer`.

source: Note that unlike the :class:`DictReader` class, the *fieldnames* parameter of the :class:`DictWriter` class is not optional.
pt_br: Observe que, diferentemente da classe :class:`DictReader`, o parâmetro *fieldnames* da classe :class:`DictWriter` não é opcional.

source: The :class:`Dialect` class is a container class whose attributes contain information for how to handle doublequotes, whitespace, delimiters, etc. Due to the lack of a strict CSV specification, different applications produce subtly different CSV data. :class:`Dialect` instances define how :class:`reader` and :class:`writer` instances behave.
pt_br: A classe :class:`Dialect` é uma classe de contêiner cujos atributos contêm informações sobre como lidar com aspas duplas, espaços em branco, delimitadores, etc. Devido à falta de uma especificação CSV estrita, diferentes aplicativos produzem dados CSV sutilmente diferentes. As instâncias de :class:`Dialect` definem como as instâncias :class:`reader` e :class:`writer` se comportam.

source: All available :class:`Dialect` names are returned by :func:`list_dialects`, and they can be registered with specific :class:`reader` and :class:`writer` classes through their initializer (``__init__``) functions like this::
pt_br: Todos os nomes de :class:`Dialect` disponíveis são retornados por :func:`list_dialects`, e eles podem ser registrados com classes :class:`reader` e :class:`writer` específicas através de suas funções inicializadoras (``__init__``) como esta::

source: The :class:`excel` class defines the usual properties of an Excel-generated CSV file. It is registered with the dialect name ``'excel'``.
pt_br: A classe :class:`excel` define as propriedades usuais de um arquivo CSV gerado pelo Excel. Ele é registrado com o nome do dialeto ``'excel'``.

source: The :class:`excel_tab` class defines the usual properties of an Excel-generated TAB-delimited file. It is registered with the dialect name ``'excel-tab'``.
pt_br: A classe :class:`excel_tab` define as propriedades usuais de um arquivo delimitado por TAB gerado pelo Excel. Ela é registrado com o nome do dialeto ``'excel-tab'``.

source: The :class:`unix_dialect` class defines the usual properties of a CSV file generated on UNIX systems, i.e. using ``'\n'`` as line terminator and quoting all fields. It is registered with the dialect name ``'unix'``.
pt_br: A classe :class:`unix_dialect` define as propriedades usuais de um arquivo CSV gerado em sistemas UNIX, ou seja, usando ``'\n'`` como terminador de linha e citando todos os campos. É registrado com o nome do dialeto ``'unix'``.

source: The :class:`Sniffer` class is used to deduce the format of a CSV file.
pt_br: A classe :class:`Sniffer` é usada para deduzir o formato de um arquivo CSV.

source: The :class:`Sniffer` class provides two methods:
pt_br: A classe :class:`Sniffer` fornece dois métodos:

source: Analyze the given *sample* and return a :class:`Dialect` subclass reflecting the parameters found. If the optional *delimiters* parameter is given, it is interpreted as a string containing possible valid delimiter characters.
pt_br: Analisa a *sample* fornecida e retorna uma subclasse :class:`Dialect`, refletindo os parâmetros encontrados. Se o parâmetro opcional *delimiters* for fornecido, ele será interpretado como uma string contendo possíveis caracteres válidos de delimitador.

source: Analyze the sample text (presumed to be in CSV format) and return :const:`True` if the first row appears to be a series of column headers. Inspecting each column, one of two key criteria will be considered to estimate if the sample contains a header:
pt_br: Analisa o texto de amostra (presume-se que esteja no formato CSV) e retorne :const:`True` se a primeira linha parecer uma série de cabeçalhos de coluna. Inspecionando cada coluna, um dos dois critérios principais será considerado para estimar se a amostra contém um cabeçalho:

source: the second through n-th rows contain numeric values
pt_br: da segunda até a enésima linha contém valores numéricos

source: the second through n-th rows contain strings where at least one value's length differs from that of the putative header of that column.
pt_br: da segunda até a enésima linha contém strings em que pelo menos o comprimento de um valor difere daquele do cabeçalho putativo dessa coluna.

source: This method is a rough heuristic and may produce both false positives and negatives.
pt_br: Este método é uma heurística aproximada e pode produzir falsos positivos e negativos.

source: An example for :class:`Sniffer` use::
pt_br: Um exemplo para uso de :class:`Sniffer`::

source: with open('example.csv', newline='') as csvfile: dialect = csv.Sniffer().sniff(csvfile.read(1024)) csvfile.seek(0) reader = csv.reader(csvfile, dialect) # ... process CSV file contents here ...
pt_br: with open('example.csv', newline='') as csvfile: dialect = csv.Sniffer().sniff(csvfile.read(1024)) csvfile.seek(0) reader = csv.reader(csvfile, dialect) # ... processa conteúdo do arquivo CSV aqui ...

source: The :mod:`csv` module defines the following constants:
pt_br: O módulo :mod:`csv` define as seguintes constantes:

source: Instructs :class:`writer` objects to quote all fields.
pt_br: Instrui objetos :class:`writer` a colocar aspas em todos os campos.

source: Instructs :class:`writer` objects to only quote those fields which contain special characters such as *delimiter*, *quotechar*, ``'\r'``, ``'\n'`` or any of the characters in *lineterminator*.
pt_br: Instrui objetos :class:`writer` a colocar aspas apenas nos campos que contêm caracteres especiais como *delimiters*, *quotechar*, ``'\r'``, ``'\n'`` ou qualquer um dos caracteres em *lineterminator*.

source: Instructs :class:`writer` objects to quote all non-numeric fields.
pt_br: Instrui objetos :class:`writer` a colocar aspas em todos os campos não numéricos.

source: Instructs :class:`reader` objects to convert all non-quoted fields to type :class:`float`.
pt_br: Instrui objetos :class:`reader` a converter todos os campos não envoltos por aspas no tipo :class:`float`.

source: Some numeric types, such as :class:`bool`, :class:`~fractions.Fraction`, or :class:`~enum.IntEnum`, have a string representation that cannot be converted to :class:`float`. They cannot be read in the :data:`QUOTE_NONNUMERIC` and :data:`QUOTE_STRINGS` modes.
pt_br: Alguns tipos numéricos, como :class:`bool`, :class:`~fractions.Fraction` ou :class:`~enum.IntEnum`, têm uma representação de string que não pode ser convertida para :class:`float`. Eles não podem ser lidos nos modos :data:`QUOTE_NONNUMERIC` e :data:`QUOTE_STRINGS`.

source: Instructs :class:`writer` objects to never quote fields. When the current *delimiter*, *quotechar*, *escapechar*, ``'\r'``, ``'\n'`` or any of the characters in *lineterminator* occurs in output data it is preceded by the current *escapechar* character. If *escapechar* is not set, the writer will raise :exc:`Error` if any characters that require escaping are encountered. Set *quotechar* to ``None`` to prevent its escaping.
pt_br: Instrui objetos :class:`writer` a nunca colocar aspas nos campos. Quando o *delimiter*, *quotechar*, *escapechar*, ``'\r'``, ``'\n'`` ou qualquer um dos caracteres em *lineterminator* ocorre nos dados de saída, é precedido pelo caractere *escapechar* atual. Se *escapeechar* não estiver definido, o escritor levantará :exc:`Error` se algum caractere que exija escape for encontrado. Defina *quotechar* para ``None`` para evitar seu escape.

source: Instructs :class:`reader` objects to perform no special processing of quote characters.
pt_br: Instrui objetos :class:`reader` a não executar nenhum processamento especial de caracteres de aspas.

source: Instructs :class:`writer` objects to quote all fields which are not ``None``. This is similar to :data:`QUOTE_ALL`, except that if a field value is ``None`` an empty (unquoted) string is written.
pt_br: Instrui objetos :class:`writer` a coloca entre aspas os campos que não são ``None``. Isso é semelhante a :data:`QUOTE_ALL`, exceto que se o valor de um campo for ``None``, uma string vazia (sem aspas) é escrita.

source: Instructs :class:`reader` objects to interpret an empty (unquoted) field as ``None`` and to otherwise behave as :data:`QUOTE_ALL`.
pt_br: Instrui objetos :class:`reader` a interpretar um campo vazio (sem aspas) como ``None`` e a se comportar de outra forma como :data:`QUOTE_ALL`.

source: Instructs :class:`writer` objects to always place quotes around fields which are strings. This is similar to :data:`QUOTE_NONNUMERIC`, except that if a field value is ``None`` an empty (unquoted) string is written.
pt_br: Instrui objetos :class:`writer` a sempre coloca aspas em volta dos campos que são strings. Isso é semelhante a :data:`QUOTE_NONNUMERIC`, exceto que se o valor de um campo for ``None``, uma string vazia (sem aspas) é escrita.

source: Instructs :class:`reader` objects to interpret an empty (unquoted) string as ``None`` and to otherwise behave as :data:`QUOTE_NONNUMERIC`.
pt_br: Instrui objetos :class:`reader` a interpretar uma string vazia (sem aspas) como ``None`` e a se comportar de outra forma como :data:`QUOTE_NONNUMERIC`.

source: The :mod:`csv` module defines the following exception:
pt_br: O módulo :mod:`csv` define a seguinte exceção:

source: Raised by any of the functions when an error is detected.
pt_br: Levantada por qualquer uma das funções quando um erro é detectado.

source: Dialects and Formatting Parameters
pt_br: Dialetos e parâmetros de formatação
