Repository: python/python-docs-pt-br
Catalog: library/curses.panel.po
Languages: pt_br

source: :mod:`!curses.panel` --- A panel stack extension for curses
pt_br: :mod:`!curses.panel` --- Uma extensão de pilha de painéis para o curses

source: Panels are windows with the added feature of depth, so they can be stacked on top of each other, and only the visible portions of each window will be displayed. Panels can be added, moved up or down in the stack, and removed.
pt_br: Painéis são janelas com o recurso adicional de profundidade, então eles podem ser empilhados uns sobre os outros, e somente as partes visíveis de cada janela serão exibidas. Painéis podem ser adicionados, movidos para cima ou para baixo na pilha, e removidos.

source: Functions
pt_br: Funções

source: The module :mod:`curses.panel` defines the following functions:
pt_br: O módulo :mod:`curses.panel` define as seguintes funções:

source: Returns the bottom panel in the panel stack.
pt_br: Retorna o painel inferior da pilha de painéis.

source: Returns a panel object, associating it with the given window *win*. Be aware that you need to keep the returned panel object referenced explicitly. If you don't, the panel object is garbage collected and removed from the panel stack.
pt_br: Retorna um objeto painel, associando-o à janela fornecida *win*. Esteja ciente de que você precisa manter o objeto painel retornado referenciado explicitamente. Se não fizer isso, o objeto painel será coletado como lixo e removido da pilha de painéis.

source: Returns the top panel in the panel stack.
pt_br: Retorna o painel superior da pilha de painéis.

source: Updates the virtual screen after changes in the panel stack. This does not call :func:`curses.doupdate`, so you'll have to do this yourself.
pt_br: Atualiza a tela virtual após alterações na pilha de painéis. Isso não chama :func:`curses.doupdate`, então você terá que fazer isso sozinho.

source: Panel Objects
pt_br: Objetos painel

source: Panel objects, as returned by :func:`new_panel` above, are windows with a stacking order. There's always a window associated with a panel which determines the content, while the panel methods are responsible for the window's depth in the panel stack.
pt_br: Objetos painel, como retornados por :func:`new_panel` acima, são janelas com uma ordem de empilhamento. Há sempre uma janela associada a um painel que determina o conteúdo, enquanto os métodos de painel são responsáveis pela profundidade da janela na pilha de painéis.

source: Panel objects have the following methods:
pt_br: Objetos painel possuem os seguintes métodos:

source: Returns the panel above the current panel.
pt_br: Retorna o painel acima do painel atual.

source: Returns the panel below the current panel.
pt_br: Retorna o painel abaixo do painel atual.

source: Push the panel to the bottom of the stack.
pt_br: Insere o painel para o fundo da pilha.

source: Returns ``True`` if the panel is hidden (not visible), ``False`` otherwise.
pt_br: Retorna ``True`` se o painel estiver oculto (não visível), ``False`` caso contrário.

source: Hide the panel. This does not delete the object, it just makes the window on screen invisible.
pt_br: Oculta o painel. Isso não exclui o objeto, apenas torna a janela invisível na tela.

source: Move the panel to the screen coordinates ``(y, x)``.
pt_br: Move o painel para as coordenadas ``(y, x)`` da tela.

source: Change the window associated with the panel to the window *win*.
pt_br: Altera a janela associada ao painel para a janela *win*.

source: Set the panel's user pointer to *obj*. This is used to associate an arbitrary piece of data with the panel, and can be any Python object.
pt_br: Define o ponteiro do usuário do painel para *obj*. Isso é usado para associar um pedaço arbitrário de dados ao painel, e pode ser qualquer objeto Python.

source: Display the panel (which might have been hidden).
pt_br: Exibe o painel (que pode estar oculto).

source: Push panel to the top of the stack.
pt_br: Insere o painel para o topo da pilha.

source: Returns the user pointer for the panel. This might be any Python object.
pt_br: Retorna o ponteiro do usuário para o painel. Pode ser qualquer objeto Python.

source: Returns the window object associated with the panel.
pt_br: Retorna o objeto de janela associado ao painel.
