Repository: python/python-docs-pt-br
Catalog: library/curses.ascii.po
Languages: pt_br

source: :mod:`!curses.ascii` --- Utilities for ASCII characters
pt_br: :mod:`!curses.ascii` --- Utilitários para caracteres ASCII

source: **Source code:** :source:`Lib/curses/ascii.py`
pt_br: **Código-fonte:** :source:`Lib/curses/ascii.py`

source: The :mod:`curses.ascii` module supplies name constants for ASCII characters and functions to test membership in various ASCII character classes. The constants supplied are names for control characters as follows:
pt_br: O módulo :mod:`curses.ascii` fornece constantes de nome para caracteres ASCII e funções para testar associação em várias classes de caracteres ASCII. As constantes fornecidas são nomes para caracteres de controle, como detalhado a seguir:

source: Name
pt_br: Nome

source: Meaning
pt_br: Significado

source: Start of heading, console interrupt
pt_br: Início do cabeçalho, interrupção do console

source: Start of text
pt_br: Início de texto

source: End of text
pt_br: Fim de texto

source: End of transmission
pt_br: Fim de transmissão

source: Enquiry, goes with :const:`ACK` flow control
pt_br: Consulta, segue com controle de fluxo :const:`ACK`

source: Acknowledgement
pt_br: Confirmação

source: Bell
pt_br: Campainha

source: Tab
pt_br: Tabulação

source: Alias for :const:`TAB`: "Horizontal tab"
pt_br: Apelido ​​para :const:`TAB`: "Tabulação horizontal"

source: Line feed
pt_br: Alimentação de linha ou *line feed*

source: Alias for :const:`LF`: "New line"
pt_br: Apelido para :const:`LF`: "Nova linha"

source: Vertical tab
pt_br: Tabulação vertical

source: Form feed
pt_br: Alimentação de formulário ou *form feed*

source: Carriage return
pt_br: Retorno de carro ou *carriage return*

source: Shift-out, begin alternate character set
pt_br: Deslocamento para fora ou *shift-out*, inicia um conjunto de caracteres alternativo

source: Shift-in, resume default character set
pt_br: Deslocamento para dentro ou *shift-in*, retoma o conjunto de caracteres padrão

source: Data-link escape
pt_br: Escape de conexão ou *data-link escape*

source: XON, for flow control
pt_br: XON, para controle de fluxo

source: Device control 2, block-mode flow control
pt_br: Controle de dispositivo 2, control de fluxo em modo bloco

source: XOFF, for flow control
pt_br: XOFF, para controle de fluxo

source: Device control 4
pt_br: Controle de dispositivo 4

source: Negative acknowledgement
pt_br: Confirmação negativa

source: Synchronous idle
pt_br: Estado ocioso síncrono

source: End transmission block
pt_br: Bloco de fim de transmissão

source: Cancel
pt_br: Cancelar

source: End of medium
pt_br: Fim de mídia

source: Substitute
pt_br: Substituir

source: Escape
pt_br: Escapar

source: File separator
pt_br: Separador de arquivos

source: Group separator
pt_br: Separador de grupos

source: Record separator, block-mode terminator
pt_br: Separador de registros, terminador de modo bloco

source: Unit separator
pt_br: Separador de unidades

source: Space
pt_br: Espaço

source: Delete
pt_br: Excluir

source: Note that many of these have little practical significance in modern usage. The mnemonics derive from teleprinter conventions that predate digital computers.
pt_br: Note que muitos deles têm pouca significância prática no uso moderno. Os mnemônicos derivam de convenções de teleimpressoras que antecedem os computadores digitais.

source: The module supplies the following functions, patterned on those in the standard C library:
pt_br: O módulo fornece as seguintes funções, baseadas nas da biblioteca C padrão:

source: Checks for an ASCII alphanumeric character; it is equivalent to ``isalpha(c) or isdigit(c)``.
pt_br: Verifica se há um caractere alfanumérico ASCII; equivale a ``isalpha(c) or isdigit(c)``.

source: Checks for an ASCII alphabetic character; it is equivalent to ``isupper(c) or islower(c)``.
pt_br: Verifica se há um caractere alfabético ASCII; equivale a ``isupper(c) or islower(c)``.

source: Checks for a character value that fits in the 7-bit ASCII set.
pt_br: Verifica se há um valor de caractere que se encaixa no conjunto ASCII de 7 bits.

source: Checks for an ASCII whitespace character; space or horizontal tab.
pt_br: Verifica se há um caractere de espaço em branco ASCII; espaço ou tabulação horizontal.

source: Checks for an ASCII control character (in the range 0x00 to 0x1f or 0x7f).
pt_br: Verifica se há um caractere de controle ASCII (no intervalo de 0x00 a 0x1f ou 0x7f).

source: Checks for an ASCII decimal digit, ``'0'`` through ``'9'``. This is equivalent to ``c in string.digits``.
pt_br: Verifica se há um dígito decimal ASCII, ``'0'`` a ``'9'``. Isso equivale a ``c in string.digits``.

source: Checks for ASCII any printable character except space.
pt_br: Verifica se há algum caractere ASCII imprimível, exceto espaço.

source: Checks for an ASCII lower-case character.
pt_br: Verifica se há um caractere ASCII minúsculo.

source: Checks for any ASCII printable character including space.
pt_br: Verifica se há algum caractere ASCII imprimível, incluindo espaço.

source: Checks for any printable ASCII character which is not a space or an alphanumeric character.
pt_br: Verifica se há algum caractere ASCII imprimível que não seja um espaço ou um caractere alfanumérico.

source: Checks for ASCII white-space characters; space, line feed, carriage return, form feed, horizontal tab, vertical tab.
pt_br: Verifica caracteres de espaço em branco ASCII; espaço, quebra de linha, retorno de carro, quebra de página, tabulação horizontal, tabulação vertical.

source: Checks for an ASCII uppercase letter.
pt_br: Verifica se há uma letra maiúscula ASCII.

source: Checks for an ASCII hexadecimal digit. This is equivalent to ``c in string.hexdigits``.
pt_br: Verifica se há um dígito hexadecimal ASCII. Isso equivale a ``c in string.hexdigits``.

source: Checks for an ASCII control character (ordinal values 0 to 31).
pt_br: Verifica se há um caractere de controle ASCII (valores ordinais de 0 a 31).

source: Checks for a non-ASCII character (ordinal values 0x80 and above).
pt_br: Verifica se há um caractere não ASCII (valores ordinais 0x80 e acima).

source: These functions accept either integers or single-character strings; when the argument is a string, it is first converted using the built-in function :func:`ord`.
pt_br: Essas funções aceitam números inteiros ou strings de caracteres únicos; quando o argumento é uma string, ele é primeiro convertido usando a função embutida :func:`ord`.

source: Note that all these functions check ordinal bit values derived from the character of the string you pass in; they do not actually know anything about the host machine's character encoding.
pt_br: Observe que todas essas funções verificam valores de bits ordinais derivados do caractere da string que você passa; elas não sabem nada sobre a codificação de caracteres da máquina host.

source: The following two functions take either a single-character string or integer byte value; they return a value of the same type.
pt_br: As duas funções a seguir aceitam uma string de caractere único ou um valor de byte inteiro; elas retornam um valor do mesmo tipo.

source: Return the ASCII value corresponding to the low 7 bits of *c*.
pt_br: Retorna o valor ASCII correspondente aos 7 bits mais baixos de *c*.

source: Return the control character corresponding to the given character (the character bit value is bitwise-anded with 0x1f).
pt_br: Retorna o caractere de controle correspondente ao caractere fornecido (é feito um E bit a bit com 0x1f sobre o valor do bit do caractere).

source: Return the 8-bit character corresponding to the given ASCII character (the character bit value is bitwise-ored with 0x80).
pt_br: Retorna o caractere de 8 vits correspondente ao caractere ASCII fornecido (é feito um OU bit a bit com 0x80 sobre o valor do bit do caractere).

source: The following function takes either a single-character string or integer value; it returns a string.
pt_br: A função a seguir aceita uma string de um único caractere ou um valor inteiro; ela retorna uma string.

source: Return a string representation of the ASCII character *c*. If *c* is printable, this string is the character itself. If the character is a control character (0x00--0x1f) the string consists of a caret (``'^'``) followed by the corresponding uppercase letter. If the character is an ASCII delete (0x7f) the string is ``'^?'``. If the character has its meta bit (0x80) set, the meta bit is stripped, the preceding rules applied, and ``'!'`` prepended to the result.
pt_br: Retorna uma representação de string do caractere ASCII *c*. Se *c* for imprimível, essa string é o próprio caractere. Se o caractere for um caractere de controle (0x00--0x1f), a string consiste em um acento circunflexo (``'^'``) seguido pela letra maiúscula correspondente. Se o caractere for de exclusão ASCII (0x7f), a string é ``'^?'``. Se o caractere tiver seu metabit (0x80) definido, o metabit é removido, as regras precedentes são aplicadas e ``'!'`` é adicionado ao resultado.

source: A 33-element string array that contains the ASCII mnemonics for the thirty-two ASCII control characters from 0 (NUL) to 0x1f (US), in order, plus the mnemonic ``SP`` for the space character.
pt_br: Um vetor de strings de 33 elementos que contém os mnemônicos ASCII para os trinta e dois caracteres de controle ASCII de 0 (NUL) a 0x1f (US), em ordem, mais o mnemônico ``SP`` para o caractere de espaço.

source: ^ (caret)
pt_br: ^ (circunflexo)

source: in curses module
pt_br: no módulo curses

source: ! (exclamation)
pt_br: ! (exclamação)
