Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: If *name* is not provided in the constructor, the name returned by ``tzname(dt)`` is generated from the value of the ``offset`` as follows. If *offset* is ``timedelta(0)``, the name is "UTC", otherwise it is a string in the format ``UTC±HH:MM``, where ± is the sign of ``offset``, HH and MM are two digits of ``offset.hours`` and ``offset.minutes`` respectively.
pt_br: Se *name* não é passado ao construtor, o nome retornado por ``tzname(dt)`` é gerado a partir do valor de ``offset`` do seguinte modo: Se *offset* é ``timedelta(0)``, o nome é "UTC", caso contrário é uma string no formato ``UTC±HH:MM``, na qual ± é o sinal do ``offset``, HH e MM são dois dígitos de ``offset.hours`` e ``offset.minutes`` respectivamente.

source: Name generated from ``offset=timedelta(0)`` is now plain ``'UTC'``, not ``'UTC+00:00'``.
pt_br: Nome gerado de ``offset=timedelta(0)`` é agora simplesmente ``'UTC'``, não ``'UTC+00:00'``.

source: Always returns ``None``.
pt_br: Sempre retorna ``None``.

source: Return ``dt + offset``. The *dt* argument must be an aware :class:`.datetime` instance, with ``tzinfo`` set to ``self``.
pt_br: Retorna ``dt + offset``. O argumento *dt* deve ser uma instância :class:`.datetime` consciente, com ``tzinfo`` definida para ``self``.

source: The UTC time zone, ``timezone(timedelta(0))``.
pt_br: O fuso horário UTC, ``timezone(timedelta(0))``.

source: :meth:`~.datetime.strftime` and :meth:`~.datetime.strptime` Behavior
pt_br: Comportamento de :meth:`~.datetime.strftime` e :meth:`~.datetime.strptime`

source: :class:`date`, :class:`.datetime`, and :class:`.time` objects all support a ``strftime(format)`` method, to create a string representing the time under the control of an explicit format string.
pt_br: Todos os objetos :class:`date`, :class:`.datetime` e :class:`.time` dão suporte ao método ``strftime(format)``, para criar uma string representando o tempo sob o controle de uma string de formatação explícita.

source: Conversely, the :meth:`date.strptime`, :meth:`datetime.strptime` and :meth:`time.strptime` class methods create an object from a string representing the time and a corresponding format string.
pt_br: Em recíproca, os métodos de classe :meth:`date.strptime`, :meth:`datetime.strptime` e :meth:`time.strptime` criam um objeto a partir de uma string representando o tempo e uma string de formatação correspondente.

source: The table below provides a high-level comparison of :meth:`~.datetime.strftime` versus :meth:`~.datetime.strptime`:
pt_br: A tabela abaixo fornece uma comparação de alto nível entre :meth:`~.datetime.strftime` e :meth:`~.datetime.strptime`:

source: Usage
pt_br: Uso

source: Convert object to a string according to a given format
pt_br: Converte objeto para uma string conforme um formato fornecido

source: Parse a string into an object given a corresponding format
pt_br: Interpreta uma string como um objeto dado um formato correspondente

source: Type of method
pt_br: Tipo de método

source: Instance method
pt_br: Método de instância

source: Class method
pt_br: Método de classe

source: Signature
pt_br: Assinatura

source: :meth:`~.datetime.strftime` and :meth:`~.datetime.strptime` Format Codes
pt_br: Códigos de formato :meth:`~.datetime.strftime` e :meth:`~.datetime.strptime`

source: These methods accept format codes that can be used to parse and format dates::
pt_br: Esses métodos aceitam códigos de formato que podem ser usados para analisar e formatar datas::

source: The following is a list of all the format codes that the 1989 C standard requires, and these work on all platforms with a standard C implementation.
pt_br: A seguir é exibida uma lista de todos os códigos de formatação que o padrão C de 1989 requer, e eles funcionam em todas as plataformas com implementação padrão C.

source: Directive
pt_br: Diretiva

source: Meaning
pt_br: Significado

source: Example
pt_br: Exemplo

source: Notes
pt_br: Notas

source: Weekday as locale's abbreviated name.
pt_br: Dias da semana como nomes abreviados da localidade.

source: Weekday as locale's full name.
pt_br: Dia da semana como nome completo da localidade.

source: Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
pt_br: Dia da semana como um número decimal, onde 0 é domingo e 6 é sábado.

source: Day of the month as a zero-padded decimal number.
pt_br: Dia do mês como um número decimal com zeros a esquerda.

source: Month as locale's abbreviated name.
pt_br: Mês como nome da localidade abreviado.

source: Month as locale's full name.
pt_br: Mês como nome completo da localidade.

source: Januar, Februar, ..., Dezember (de_DE)
pt_br: janeiro, fevereiro, ..., dezembro (pt_BR)

source: Month as a zero-padded decimal number.
pt_br: Mês como um número decimal com zeros a esquerda.

source: Year without century as a zero-padded decimal number.
pt_br: Ano sem século como um número decimal com zeros a esquerda.

source: Year with century as a decimal number.
pt_br: Ano com século como um número decimal.

source: Hour (24-hour clock) as a zero-padded decimal number.
pt_br: Hora (relógio de 24 horas) como um número decimal com zeros a esquerda.

source: Hour (12-hour clock) as a zero-padded decimal number.
pt_br: Hora (relógio de 12 horas) como um número decimal com zeros a esquerda.

source: Locale's equivalent of either AM or PM.
pt_br: Equivalente da localidade a AM ou PM.

source: Minute as a zero-padded decimal number.
pt_br: Minutos como um número decimal, com zeros a esquerda.

source: Second as a zero-padded decimal number.
pt_br: Segundos como um número decimal, com zeros a esquerda.

source: Microsecond as a decimal number, zero-padded to 6 digits.
pt_br: Microssegundos como um número decimal, com zeros à esquerda até completar 6 dígitos.

source: UTC offset in the form ``±HHMM[SS[.ffffff]]`` (empty string if the object is naive).
pt_br: Diferença UTC no formato ``±HHMM[SS[.ffffff]]`` (string vazia se o objeto é ingênuo).

source: (empty), +0000, -0400, +1030, +063415, -030712.345216
pt_br: (vazio), +0000, -0400, +1030, +063415, -030712.345216

source: Time zone name (empty string if the object is naive).
pt_br: Nome do fuso horário (string vazia se o objeto é ingênuo).

source: (empty), UTC, GMT
pt_br: (vazio), UTC, GMT

source: Day of the year as a zero-padded decimal number.
pt_br: Dia do ano como um número decimal, com zeros a esquerda.

source: Week number of the year (Sunday as the first day of the week) as a zero-padded decimal number. All days in a new year preceding the first Sunday are considered to be in week 0.
pt_br: Número da semana do ano (Domingo como o primeiro dia da semana) como um número decimal, com zeros a esquerda. Todos os dias em um ano novo precedendo o primeiro domingo são considerados como estando na semana 0.

source: Week number of the year (Monday as the first day of the week) as a zero-padded decimal number. All days in a new year preceding the first Monday are considered to be in week 0.
pt_br: Número da semana do ano (Segunda-feira como o primeiro dia da semana) como um número decimal, com zeros a esquerda. Todos os dias em um ano novo precedendo a primeira segunda-feira são considerados como estando na semana 0.

source: Locale's appropriate date and time representation.
pt_br: Representação de data e hora apropriada da localidade.

source: Locale's appropriate date representation.
pt_br: Representação de data apropriada de localidade.

source: Locale's appropriate time representation.
pt_br: Representação de hora apropriada da localidade.

source: A literal ``'%'`` character.
pt_br: Um caractere literal ``'%'``.

source: Several additional directives not required by the C89 standard are included for convenience. These parameters all correspond to ISO 8601 date values.
pt_br: Diversas diretivas adicionais não necessárias pelo padrão C89 são incluídas para conveniência. Estes parâmetros todos correspondem a valores de datas na ISO 8601.

source: ISO 8601 year with century representing the year that contains the greater part of the ISO week (``%V``).
pt_br: Ano ISO 8601 com o século representando o ano que a maior parte da semana ISO (``%V``).

source: ISO 8601 weekday as a decimal number where 1 is Monday.
pt_br: Dia de semana ISO 8601 como um número decimal onde 1 é segunda-feira.

source: ISO 8601 week as a decimal number with Monday as the first day of the week. Week 01 is the week containing Jan 4.
pt_br: Semana ISO 8601 como um número decimal, com segunda-feira como o primeiro dia da semana. A semana 01 é a semana contendo o dia 4 de Janeiro.

source: UTC offset in the form ``±HH:MM[:SS[.ffffff]]`` (empty string if the object is naive).
pt_br: Diferença UTC no formato ``±HH:MM[:SS[.ffffff]]`` (string vazia se o objeto é ingênuo).

source: (empty), +00:00, -04:00, +10:30, +06:34:15, -03:07:12.345216
pt_br: (vazio), +00:00, -04:00, +10:30, +06:34:15, -03:07:12.345216

source: These may not be available on all platforms when used with the :meth:`~.datetime.strftime` method. The ISO 8601 year and ISO 8601 week directives are not interchangeable with the year and week number directives above. Calling :meth:`~.datetime.strptime` with incomplete or ambiguous ISO 8601 directives will raise a :exc:`ValueError`.
pt_br: Eles podem não estar disponíveis em todas as plataformas quando usados com o método :meth:`~.datetime.strftime`. As diretivas de ano e semana da ISO 8601 e ISO 8601 não são intercambiáveis com as diretivas ano e número da semana acima. Chamar :meth:`~.datetime.strptime` com diretivas ISO 8601 incompletas ou ambíguas levantará um :exc:`ValueError`.

source: The full set of format codes supported varies across platforms, because Python calls the platform C library's :c:func:`strftime` function, and platform variations are common. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation. There are also differences between platforms in handling of unsupported format specifiers.
pt_br: O conjunto completo de códigos de formato suportados varia entre as plataformas, porque o Python chama a função :c:func:`strftime` da biblioteca C da plataforma, e variações de plataforma são comuns. Para ver o conjunto completo de códigos de formato suportados em sua plataforma, consulte a documentação :manpage:`strftime(3)`. Também existem diferenças entre plataformas no tratamento de especificadores de formato não suportados.

source: ``%G``, ``%u`` and ``%V`` were added.
pt_br: ``%G``, ``%u`` e ``%V`` foram adicionados.

source: ``%:z`` was added.
pt_br: ``%:z`` foi adicionado.

source: Technical Detail
pt_br: Detalhes técnicos

source: Broadly speaking, ``d.strftime(fmt)`` acts like the :mod:`time` module's ``time.strftime(fmt, d.timetuple())`` although not all objects support a :meth:`~date.timetuple` method.
pt_br: Em termos gerais, ``d.strftime(fmt)`` age como ``time.strftime(fmt, d.timetuple())`` do módulo :mod:`time`, embora nem todos os objetos suportem um método :meth:`~date.timetuple`.

source: For the :meth:`.datetime.strptime` class method, the default value is ``1900-01-01T00:00:00.000``: any components not specified in the format string will be pulled from the default value. [#]_
pt_br: Para o método de classe :meth:`.datetime.strptime`, o valor padrão é ``1900-01-01T00:00:00.000``: quaisquer componentes não especificados na string de formato serão extraídos do valor padrão. [#]_

source: Using ``datetime.strptime(date_string, format)`` is equivalent to::
pt_br: Usar ``datetime.strptime(date_string, format)`` é equivalente a::

source: except when the format includes sub-second components or time zone offset information, which are supported in ``datetime.strptime`` but are discarded by ``time.strptime``.
pt_br: exceto quando o formato inclui componentes de sub-segundos ou informações de deslocamento de fuso horário, que são suportados em ``datetime.strptime`` mas são descartados por ``time.strptime``.

source: For :class:`.time` objects, the format codes for year, month, and day should not be used, as :class:`!time` objects have no such values. If they're used anyway, 1900 is substituted for the year, and 1 for the month and day.
pt_br: Para objetos :class:`.time`, os códigos de formato para ano, mês e dia não devem ser usados, pois objetos :class:`!time` não têm tais valores. Se forem usados de qualquer forma, o ano é substituído por 1900, e o mês e dia por 1.

source: For :class:`date` objects, the format codes for hours, minutes, seconds, and microseconds should not be used, as :class:`date` objects have no such values. If they're used anyway, 0 is substituted for them.
pt_br: Para objetos :class:`date`, os códigos de formato para horas, minutos, segundos e microssegundos não devem ser usados, pois objetos :class:`date` não têm tais valores. Se forem usados de qualquer forma, são substituídos por 0.

source: For the same reason, handling of format strings containing Unicode code points that can't be represented in the charset of the current locale is also platform-dependent. On some platforms such code points are preserved intact in the output, while on others ``strftime`` may raise :exc:`UnicodeError` or return an empty string instead.
pt_br: Pela mesma razão, o tratamento de formato de strings contendo pontos de código Unicode que não podem ser representados no conjunto de caracteres da localidade atual também é dependente da plataforma. Em algumas plataformas, tais pontos de código são preservados intactos na saída, enquanto em outros ``strftime`` pode levantar :exc:`UnicodeError` ou retornar uma string vazia ao invés.

source: Because the format depends on the current locale, care should be taken when making assumptions about the output value. Field orderings will vary (for example, "month/day/year" versus "day/month/year"), and the output may contain non-ASCII characters.
pt_br: Como o formato depende da localidade atual, deve-se tomar cuidado ao fazer suposições sobre o valor de saída. A ordenação dos campos irá variar (por exemplo, "mês/dia/ano" versus "dia/mês/ano") e a saída pode conter caracteres não ASCII.

source: The :meth:`~.datetime.strptime` method can parse years in the full [1, 9999] range, but years < 1000 must be zero-filled to 4-digit width.
pt_br: O método :meth:`~.datetime.strptime` pode analisar anos no intervalo completo de [1, 9999], mas anos < 1000 devem ser preenchidos com zeros até uma largura de 4 dígitos.

source: In previous versions, :meth:`~.datetime.strftime` method was restricted to years >= 1900.
pt_br: Em versões anteriores, o método :meth:`~.datetime.strftime` era limitado a anos >= 1900.

source: In version 3.2, :meth:`~.datetime.strftime` method was restricted to years >= 1000.
pt_br: Na versão 3.2, o método :meth:`~.datetime.strftime` era limitado a anos >= 1000.

source: When used with the :meth:`~.datetime.strptime` method, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
pt_br: Quando usado com o método :meth:`~.datetime.strptime`, a diretiva ``%p`` afeta somente o campo de hora de saída se a diretiva ``%I`` for usada para analisar a hora.

source: Unlike the :mod:`time` module, the :mod:`!datetime` module does not support leap seconds.
pt_br: Ao contrário do módulo :mod:`time`, o módulo :mod:`!datetime` não oferece suporte para segundos intercalares.

source: When used with the :meth:`~.datetime.strptime` method, the ``%f`` directive accepts from one to six digits and zero pads on the right. ``%f`` is an extension to the set of format characters in the C standard (but implemented separately in datetime objects, and therefore always available).
pt_br: Quando usado com o método :meth:`~.datetime.strptime`, a diretiva ``%f`` aceita de um a seis dígitos e zeros à direita. ``%f`` é uma extensão do conjunto de caracteres de formato no padrão do C (mas implementado separadamente em objetos datetime e, portanto, sempre disponível).

source: For a naive object, the ``%z``, ``%:z`` and ``%Z`` format codes are replaced by empty strings.
pt_br: Para um objeto ingênuo, os códigos de formatação ``%z``, ``%:z`` e ``%Z`` são substituídos por strings vazias.

source: For an aware object:
pt_br: Para um objeto consciente:

source: :meth:`~.datetime.utcoffset` is transformed into a string of the form ``±HHMM[SS[.ffffff]]``, where ``HH`` is a 2-digit string giving the number of UTC offset hours, ``MM`` is a 2-digit string giving the number of UTC offset minutes, ``SS`` is a 2-digit string giving the number of UTC offset seconds and ``ffffff`` is a 6-digit string giving the number of UTC offset microseconds. The ``ffffff`` part is omitted when the offset is a whole number of seconds and both the ``ffffff`` and the ``SS`` part is omitted when the offset is a whole number of minutes. For example, if :meth:`~.datetime.utcoffset` returns ``timedelta(hours=-3, minutes=-30)``, ``%z`` is replaced with the string ``'-0330'``.
pt_br: :meth:`~.datetime.utcoffset` é transformado em uma string do formato ``±HHMM[SS[.ffffff]]``, onde ``HH`` é uma string de 2 dígitos que fornece o número de horas de deslocamento UTC, ``MM`` é uma string de 2 dígitos que fornece o número de minutos de deslocamento UTC, ``SS`` é uma string de 2 dígitos que fornece o número de segundos de deslocamento UTC e ``ffffff`` é uma string de 6 dígitos que fornece o número de microssegundos de deslocamento UTC. A parte ``ffffff`` é omitida quando o deslocamento é um número inteiro de segundos e tanto a parte ``ffffff`` quanto a parte ``SS`` são omitidas quando o deslocamento é um número inteiro de minutos. Por exemplo, se :meth:`~.datetime.utcoffset` retornar ``timedelta(hours=-3, minutes=-30)``, ``%z`` será substituído pela string ``'-0330'``.

source: When the ``%z`` directive is provided to the :meth:`~.datetime.strptime` method, the UTC offsets can have a colon as a separator between hours, minutes and seconds. For example, ``'+01:00:00'`` will be parsed as an offset of one hour. In addition, providing ``'Z'`` is identical to ``'+00:00'``.
pt_br: Quando a diretiva ``%z`` é fornecida ao método :meth:`~.datetime.strptime`, os deslocamentos UTC podem ter dois pontos como separador entre horas, minutos e segundos. Por exemplo, ``'+01:00:00'`` será analisado como um deslocamento de uma hora. Além disso, fornecer ``'Z'`` é idêntico a ``'+00:00'``.

source: Behaves exactly as ``%z``, but has a colon separator added between hours, minutes and seconds.
pt_br: Comporta-se exatamente como ``%z``, mas possui um separador de dois pontos adicionado entre horas, minutos e segundos.

source: In :meth:`~.datetime.strftime`, ``%Z`` is replaced by an empty string if :meth:`~.datetime.tzname` returns ``None``; otherwise ``%Z`` is replaced by the returned value, which must be a string.
pt_br: Em :meth:`~.datetime.strftime`, ``%Z`` é substituído por uma string vazia se :meth:`~.datetime.tzname` retornar ``None``; caso contrário, ``%Z`` é substituído pelo valor retornado, que deve ser uma string.

source: :meth:`~.datetime.strptime` only accepts certain values for ``%Z``:
pt_br: :meth:`~.datetime.strptime` aceita apenas certos valores para ``%Z``:

source: any value in ``time.tzname`` for your machine's locale
pt_br: qualquer valor em ``time.tzname`` para a localidade da sua máquina

source: the hard-coded values ``UTC`` and ``GMT``
pt_br: os valores codificados ``UTC`` e ``GMT``

source: So someone living in Japan may have ``JST``, ``UTC``, and ``GMT`` as valid values, but probably not ``EST``. It will raise ``ValueError`` for invalid values.
pt_br: Então alguém vivendo no Japão pode ter ``JST``, ``UTC``, e ``GMT`` como valores válidos, mas provavelmente não ``EST``. Isso levantará ``ValueError`` para valores inválidos.

source: When the ``%z`` directive is provided to the :meth:`~.datetime.strptime` method, an aware :class:`.datetime` object will be produced. The ``tzinfo`` of the result will be set to a :class:`timezone` instance.
pt_br: Quando a diretiva ``%z`` é fornecida ao método :meth:`~.datetime.strptime`, um objeto :class:`.datetime` consciente será produzido. O ``tzinfo`` do resultado será definido para uma instância :class:`timezone`.

source: When used with the :meth:`~.datetime.strptime` method, ``%U`` and ``%W`` are only used in calculations when the day of the week and the calendar year (``%Y``) are specified.
pt_br: Quando utilizados com o método :meth:`~.datetime.strptime`, ``%U`` e ``%W`` são usados somente em cálculos quando o dia da semana e o ano (``%Y``) são especificados.

source: Similar to ``%U`` and ``%W``, ``%V`` is only used in calculations when the day of the week and the ISO year (``%G``) are specified in a :meth:`~.datetime.strptime` format string. Also note that ``%G`` and ``%Y`` are not interchangeable.
pt_br: Semelhante a ``%U`` e ``%W``, ``%V`` é usado apenas em cálculos quando o dia da semana e o ano ISO (``%G``) são especificados em um formato de string :meth:`~.datetime.strptime`. Observe também que ``%G`` e ``%Y`` não são intercambiáveis.

source: When used with the :meth:`~.datetime.strptime` method, the leading zero is optional for formats ``%d``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%j``, ``%U``, ``%W``, and ``%V``. Format ``%y`` does require a leading zero.
pt_br: Quando usado com o método :meth:`~.datetime.strptime`, o zero à esquerda é opcional para os formatos ``%d``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%j``, ``%U``, ``%W`` e ``%V``. O formato ``%y`` requer um zero à esquerda.

source: When parsing a month and day using :meth:`~.datetime.strptime`, always include a year in the format. If the value you need to parse lacks a year, append an explicit dummy leap year. Otherwise your code will raise an exception when it encounters leap day because the default year used by the parser is not a leap year. Users run into this bug every four years...
pt_br: Ao analisar um mês e dia usando :meth:`~.datetime.strptime`, sempre inclua um ano no formato. Se o valor que você precisa analisar não possui um ano, adicione um ano bissexto fictício de forma explícita. Caso contrário, seu código levantará uma exceção ao encontrar o dia bissexto, porque o ano padrão usado pelo analisador sintático não é um ano bissexto. Os usuários encontram esse bug a cada quatro anos...

source: >>> month_day = "02/29" >>> datetime.strptime(f"{month_day};1984", "%m/%d;%Y") # No leap year bug. datetime.datetime(1984, 2, 29, 0, 0)
pt_br: >>> month_day = "02/29" >>> datetime.strptime(f"{month_day};1984", "%m/%d;%Y") # Sem bug de ano bissexto. datetime.datetime(1984, 2, 29, 0, 0)

source: :meth:`~.datetime.strptime` calls using a format string containing a day of month without a year now emit a :exc:`DeprecationWarning`. In 3.15 or later we may change this into an error or change the default year to a leap year. See :gh:`70647`.
pt_br: Chamadas ao método :meth:`~.datetime.strptime` usando uma string de formato contendo um dia do mês sem um ano agora emitem um :exc:`DeprecationWarning`. Na versão 3.15 ou posterior, podemos mudar isso para um erro ou mudar o ano padrão para um ano bissexto. Consulte :gh:`70647`.

source: Footnotes
pt_br: Notas de rodapé

source: If, that is, we ignore the effects of Relativity
pt_br: Se, isto é, nós ignoramos os efeitos da Relatividade

source: This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book *Calendrical Calculations*, where it's the base calendar for all computations. See the book for algorithms for converting between proleptic Gregorian ordinals and many other calendar systems.
pt_br: Isso combina com a definição do calendário "proléptico Gregoriano" no livro *Cálculos Calendáricos* de Dershowitz e Reingold, onde ele é o calendário base para todas as computações. Veja o livro para algoritmos para conversão entre ordinais proléptico Gregoriano e muitos outros sistemas de calendário.
