Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: If ``self.tzinfo`` is *tz*, ``self.astimezone(tz)`` is equal to *self*: no adjustment of date or time data is performed. Else the result is local time in the time zone *tz*, representing the same UTC time as *self*: after ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` will have the same date and time data as ``dt - dt.utcoffset()``.
pt_br: Se ``self.tzinfo`` for *tz*, ``self.astimezone(tz)`` é igual a *self*: nenhum ajuste nos dados de data ou hora é realizado. Caso contrário o resultado é a hora local no fuso horário *tz*, representando a mesma hora UTC que *self*: depois ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` terá os mesmos dados de data e hora que ``dt - dt.utcoffset()``.

source: If you merely want to attach a :class:`timezone` object *tz* to a datetime *dt* without adjustment of date and time data, use ``dt.replace(tzinfo=tz)``. If you merely want to remove the :class:`!timezone` object from an aware datetime *dt* without conversion of date and time data, use ``dt.replace(tzinfo=None)``.
pt_br: Se você quer meramente anexar um objeto :class:`timezone` *tz* a um datetime *dt* sem ajustes de dados de data e hora, use ``dt.replace(tzinfo=tz)``. Se você meramente quer remover o objeto :class:`!timezone` de um datetime consciente *dt* sem conversão de dados de data e hora, use ``dt.replace(tzinfo=None)``.

source: Note that the default :meth:`tzinfo.fromutc` method can be overridden in a :class:`tzinfo` subclass to affect the result returned by :meth:`astimezone`. Ignoring error cases, :meth:`astimezone` acts like::
pt_br: Perceba que o método padrão :meth:`tzinfo.fromutc` pode ser substituído em uma subclasse :class:`tzinfo` para afetar o resultado retornado por :meth:`astimezone`. Ignorando erros de letras maiúsculas/minúsculas, :meth:`astimezone` funciona como::

source: def astimezone(self, tz): if self.tzinfo is tz: return self # Convert self to UTC, and attach the new timezone object. utc = (self - self.utcoffset()).replace(tzinfo=tz) # Convert from UTC to tz's local time. return tz.fromutc(utc)
pt_br: def astimezone(self, tz): if self.tzinfo is tz: return self # Converte self para UTC e anexa o novo objeto timezone. utc = (self - self.utcoffset()).replace(tzinfo=tz) # Converte o horário local de UTC para tz. return tz.fromutc(utc)

source: *tz* now can be omitted.
pt_br: *tz* agora pode ser omitido.

source: The :meth:`astimezone` method can now be called on naive instances that are presumed to represent system local time.
pt_br: O método :meth:`astimezone` agora pode ser chamado em instâncias ingênuas que presumidamente representam a hora local do sistema.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
pt_br: Se :attr:`.tzinfo` for ``None``, retorna ``None``, caso contrário retorna ``self.tzinfo.utcoffset(self)``, e levanta uma exceção se o segundo não retornar ``None`` ou um objeto :class:`timedelta` com magnitude menor que um dia.

source: The UTC offset is not restricted to a whole number of minutes.
pt_br: A diferença UTC não é restrita a um número completo de minutos.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
pt_br: Se :attr:`.tzinfo` for ``None``, retorna ``None``, caso contrário retorna ``self.tzinfo.dst(self)``, e levanta uma exceção se o segundo não retornar ``None`` ou um objeto :class:`timedelta` com magnitude menor que um dia.

source: The DST offset is not restricted to a whole number of minutes.
pt_br: A diferença de horário de verão não é restrita a um número completo de minutos.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(self)``, raises an exception if the latter doesn't return ``None`` or a string object,
pt_br: Se :attr:`.tzinfo` for ``None``, retorna ``None``, caso contrário retorna ``self.tzinfo.tzname(self)``, levanta uma exceção se o segundo não retornar ``None`` ou um objeto string.

source: where ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` is the day number within the current year starting with 1 for January 1st. The :attr:`~time.struct_time.tm_isdst` flag of the result is set according to the :meth:`dst` method: :attr:`.tzinfo` is ``None`` or :meth:`dst` returns ``None``, :attr:`!tm_isdst` is set to ``-1``; else if :meth:`dst` returns a non-zero value, :attr:`!tm_isdst` is set to 1; else :attr:`!tm_isdst` is set to 0.
pt_br: onde ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` é o número de dias dentro do ano atual, começando com 1 para 1º de janeiro. O sinalizador :attr:`~time.struct_time.tm_isdst` do resultado é definido conforme o método :meth:`dst`: :attr:`.tzinfo` é ``None`` ou :meth:`dst` retorna ``None``, :attr:`!tm_isdst` é definido para ``-1``; caso contrário se :meth:`dst` retornar um valor diferente de zero, :attr:`!tm_isdst` é definido para 1; caso contrário :attr:`!tm_isdst` é definido para 0.

source: If :class:`.datetime` instance ``d`` is naive, this is the same as ``d.timetuple()`` except that :attr:`~.time.struct_time.tm_isdst` is forced to 0 regardless of what ``d.dst()`` returns. DST is never in effect for a UTC time.
pt_br: Se a instância :class:`.datetime` ``d`` é ingênua, isto é o mesmo que ``d.timetuple()``, exceto que :attr:`~.time.struct_time.tm_isdst` é forçado para 0, independentemente do que ``d.dst()`` retornar. O horário de verão nunca é afetado por um horário UTC.

source: If ``d`` is aware, ``d`` is normalized to UTC time, by subtracting ``d.utcoffset()``, and a :class:`time.struct_time` for the normalized time is returned. :attr:`!tm_isdst` is forced to 0. Note that an :exc:`OverflowError` may be raised if ``d.year`` was ``MINYEAR`` or ``MAXYEAR`` and UTC adjustment spills over a year boundary.
pt_br: Se ``d`` é consciente, ``d`` é normalizado para horário UTC, subtraindo ``d.utcoffset()``, e um :class:`time.struct_time` para o horário normalizado é retornado. :attr:`!tm_isdst` é forçado para 0. Observe que uma exceção :exc:`OverflowError` pode ser levantada se ``d.year`` for ``MINYEAR`` ou ``MAXYEAR`` e os ajustes UTC ultrapassar o limite de um ano.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC; as a result, using :meth:`datetime.utctimetuple` may give misleading results. If you have a naive ``datetime`` representing UTC, use ``datetime.replace(tzinfo=timezone.utc)`` to make it aware, at which point you can use :meth:`.datetime.timetuple`.
pt_br: Por causa que objetos ``datetime`` ingênuos são tratados por muitos métodos ``datetime`` como hora local, é preferido usar datetimes conscientes para representar horários em UTC; como resultado, usar :meth:`datetime.utctimetuple` pode dar resultados enganosos. Se você tem um ``datetime`` ingênuo representando UTC, use ``datetime.replace(tzinfo=timezone.utc)`` para torná-lo consciente, ponto no qual você pode usar :meth:`.datetime.timetuple`.

source: Return the proleptic Gregorian ordinal of the date. The same as ``self.date().toordinal()``.
pt_br: Retorna o ordinal proléptico gregoriano da data. o mesmo que ``self.date().toordinal()``.

source: Return POSIX timestamp corresponding to the :class:`.datetime` instance. The return value is a :class:`float` similar to that returned by :func:`time.time`.
pt_br: Retorna o registro de data e hora POSIX correspondente a instância :class:`.datetime`. O valor de retorno é um :class:`float` similar aquele retornado por :func:`time.time`.

source: Naive :class:`.datetime` instances are assumed to represent local time and this method relies on the platform C :c:func:`mktime` function to perform the conversion. Since :class:`.datetime` supports wider range of values than :c:func:`mktime` on many platforms, this method may raise :exc:`OverflowError` or :exc:`OSError` for times far in the past or far in the future.
pt_br: Presume-se que instâncias :class:`.datetime` ingênuas representam a hora local e este método depende da função C :c:func:`mktime` da plataforma para realizar a conversão. Como :class:`.datetime` suporta um intervalo maior de valores que :c:func:`mktime` em muitas plataformas, este método pode levantar :exc:`OverflowError` ou :exc:`OSError` para horários longe no passado ou longe no futuro.

source: For aware :class:`.datetime` instances, the return value is computed as::
pt_br: Para instâncias conscientes de :class:`.datetime`, o valor retornado é computado como::

source: The :meth:`timestamp` method uses the :attr:`.fold` attribute to disambiguate the times during a repeated interval.
pt_br: O método :meth:`timestamp` usa o atributo :attr:`.fold` para desambiguar os tempos durante um intervalo repetido.

source: There is no method to obtain the POSIX timestamp directly from a naive :class:`.datetime` instance representing UTC time. If your application uses this convention and your system time zone is not set to UTC, you can obtain the POSIX timestamp by supplying ``tzinfo=timezone.utc``::
pt_br: Não existe método para obter o timestamp POSIX diretamente de uma instância :class:`.datetime` ingênua representando tempo em UTC. Se a sua aplicação usa esta convenção e o fuso horário do seu sistema não está setado para UTC, você pode obter o registro de data e hora POSIX fornecendo ``tzinfo=timezone.utc``::

source: or by calculating the timestamp directly::
pt_br: ou calculando o registro de data e hora diretamente::

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. The same as ``self.date().weekday()``. See also :meth:`isoweekday`.
pt_br: Retorna o dia da semana como um inteiro, em que segunda-feira é 0 e domingo é 6. O mesmo que ``self.date().weekday()``. Veja também :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. The same as ``self.date().isoweekday()``. See also :meth:`weekday`, :meth:`isocalendar`.
pt_br: Retorna o dia da semana como um inteiro, em que segunda-feira é 1 e domingo é 7. O mesmo que ``self.date().isoweekday()``. Veja também :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` with three components: ``year``, ``week`` and ``weekday``. The same as ``self.date().isocalendar()``.
pt_br: Retorna uma :term:`tupla nomeada <named tuple>` com três componentes: ``year``, ``week`` e ``weekday``. O mesmo que ``self.date().isocalendar()``.

source: Return a string representing the date and time in ISO 8601 format:
pt_br: Retorna uma string representando a data e o tempo no formato ISO 8601:

source: ``YYYY-MM-DDTHH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
pt_br: ``YYYY-MM-DDTHH:MM:SS.ffffff``, se :attr:`microsecond` não é 0

source: ``YYYY-MM-DDTHH:MM:SS``, if :attr:`microsecond` is 0
pt_br: ``YYYY-MM-DDTHH:MM:SS``, se :attr:`microsecond` é 0

source: If :meth:`utcoffset` does not return ``None``, a string is appended, giving the UTC offset:
pt_br: Se :meth:`utcoffset` não retorna ``None``, uma string é adicionada com a diferença UTC:

source: ``YYYY-MM-DDTHH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is not 0
pt_br: ``YYYY-MM-DDTHH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, se :attr:`microsecond` não é 0

source: ``YYYY-MM-DDTHH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0
pt_br: ``YYYY-MM-DDTHH:MM:SS+HH:MM[:SS[.ffffff]]``, se :attr:`microsecond` é 0

source: The optional argument *sep* (default ``'T'``) is a one-character separator, placed between the date and time portions of the result. For example::
pt_br: O argumento opcional *sep* (por padrão, ``'T'``) é um separador de caractere único, colocado entre as porções de data e tempo do resultado. Por exemplo::

source: >>> from datetime import tzinfo, timedelta, datetime >>> class TZ(tzinfo): ... """A time zone with an arbitrary, constant -06:39 offset.""" ... def utcoffset(self, dt): ... return timedelta(hours=-6, minutes=-39) ... >>> datetime(2002, 12, 25, tzinfo=TZ()).isoformat(' ') '2002-12-25 00:00:00-06:39' >>> datetime(2009, 11, 27, microsecond=100, tzinfo=TZ()).isoformat() '2009-11-27T00:00:00.000100-06:39'
pt_br: >>> from datetime import tzinfo, timedelta, datetime >>> class TZ(tzinfo): ... """Um fuso horário com uma posição arbitrária constante de -06:39.""" ... def utcoffset(self, dt): ... return timedelta(hours=-6, minutes=-39) ... >>> datetime(2002, 12, 25, tzinfo=TZ()).isoformat(' ') '2002-12-25 00:00:00-06:39' >>> datetime(2009, 11, 27, microsecond=100, tzinfo=TZ()).isoformat() '2009-11-27T00:00:00.000100-06:39'

source: The optional argument *timespec* specifies the number of additional components of the time to include (the default is ``'auto'``). It can be one of the following:
pt_br: O argumento opcional *timespec* especifica o número de componentes adicionais do tempo a incluir (o padrão é ``'auto'``). Pode ser uma das seguintes strings:

source: ``'auto'``: Same as ``'seconds'`` if :attr:`microsecond` is 0, same as ``'microseconds'`` otherwise.
pt_br: ``'auto'``: O mesmo que ``'seconds'`` se :attr:`microsecond` é 0, o mesmo que ``'microseconds'`` caso contrário.

source: ``'hours'``: Include the :attr:`hour` in the two-digit ``HH`` format.
pt_br: ``'hours'``: Inclui o atributo :attr:`hour` no formato de dois dígitos ``HH``.

source: ``'minutes'``: Include :attr:`hour` and :attr:`minute` in ``HH:MM`` format.
pt_br: ``'minutes'``: Inclui os atributos :attr:`hour` e :attr:`minute` no formato ``HH:MM``.

source: ``'seconds'``: Include :attr:`hour`, :attr:`minute`, and :attr:`second` in ``HH:MM:SS`` format.
pt_br: ``'seconds'``: Inclui os atributos :attr:`hour`, :attr:`minute` e :attr:`second` no formato ``HH:MM:SS``.

source: ``'milliseconds'``: Include full time, but truncate fractional second part to milliseconds. ``HH:MM:SS.sss`` format.
pt_br: ``'milliseconds'``: Inclui o tempo completo, mas trunca a parte fracional dos segundos em milissegundos. Formato ``HH:MM:SS.sss``.

source: ``'microseconds'``: Include full time in ``HH:MM:SS.ffffff`` format.
pt_br: ``'microseconds'``: Inclui o tempo completo no formato ``HH:MM:SS.ffffff``.

source: Excluded time components are truncated, not rounded.
pt_br: Componentes do tempo excluídos são truncados, não arredondados.

source: :exc:`ValueError` will be raised on an invalid *timespec* argument::
pt_br: A exceção :exc:`ValueError` vai ser levantada no caso de um argumento *timespec* inválido::

source: Added the *timespec* parameter.
pt_br: Adicionado o parâmetro *timespec*.

source: For a :class:`.datetime` instance ``d``, ``str(d)`` is equivalent to ``d.isoformat(' ')``.
pt_br: Para uma instância :class:`.datetime` ``d``, ``str(d)`` é equivalente a ``d.isoformat(' ')``.

source: Return a string representing the date and time::
pt_br: Retorna uma string representando a data e hora::

source: The output string will *not* include time zone information, regardless of whether the input is aware or naive.
pt_br: A string de saída *não* irá incluir informações de fuso horário, independente de a entrada ser consciente ou ingênua.

source: on platforms where the native C :c:func:`ctime` function (which :func:`time.ctime` invokes, but which :meth:`datetime.ctime` does not invoke) conforms to the C standard.
pt_br: em plataformas onde a função nativa em C :c:func:`ctime` (a qual :func:`time.ctime` invoca, mas a qual :meth:`datetime.ctime` não invoca) conforma com o padrão C.

source: Return a string representing the date and time, controlled by an explicit format string. See also :ref:`strftime-strptime-behavior` and :meth:`datetime.isoformat`.
pt_br: Retorna uma string representando a data e hora, controladas por uma string com formato explícito. Veja também :ref:`strftime-strptime-behavior` e :meth:`datetime.isoformat`.

source: Same as :meth:`.datetime.strftime`. This makes it possible to specify a format string for a :class:`.datetime` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. See also :ref:`strftime-strptime-behavior` and :meth:`datetime.isoformat`.
pt_br: O mesmo que :meth:`.datetime.strftime`. Isso torna possível especificar uma string de formatação para o objeto :class:`.datetime` em :ref:`literais de string formatados <f-strings>` e ao usar :meth:`str.format`. Veja também :ref:`strftime-strptime-behavior` e :meth:`datetime.isoformat`.

source: Examples of Usage: :class:`.datetime`
pt_br: Exemplos de uso: :class:`.datetime`

source: Examples of working with :class:`.datetime` objects:
pt_br: Exemplos para trabalhar com objetos :class:`.datetime`:

source: >>> from datetime import datetime, date, time, timezone >>> # Using datetime.combine() >>> d = date(2005, 7, 14) >>> t = time(12, 30) >>> datetime.combine(d, t) datetime.datetime(2005, 7, 14, 12, 30) >>> # Using datetime.now() >>> datetime.now() datetime.datetime(2007, 12, 6, 16, 29, 43, 79043) # GMT +1 >>> datetime.now(timezone.utc) datetime.datetime(2007, 12, 6, 15, 29, 43, 79060, tzinfo=datetime.timezone.utc) >>> # Using datetime.strptime() >>> dt = datetime.strptime("21/11/06 16:30", "%d/%m/%y %H:%M") >>> dt datetime.datetime(2006, 11, 21, 16, 30) >>> # Using datetime.timetuple() to get tuple of all attributes >>> tt = dt.timetuple() >>> for it in tt: ... print(it) ... 2006 # year 11 # month 21 # day 16 # hour 30 # minute 0 # second 1 # weekday (0 = Monday) 325 # number of days since 1st January -1 # dst - method tzinfo.dst() returned None >>> # Date in ISO format >>> ic = dt.isocalendar() >>> for it in ic: ... print(it) ... 2006 # ISO year 47 # ISO week 2 # ISO weekday >>> # Formatting a datetime >>> dt.strftime("%A, %d. %B %Y %I:%M%p") 'Tuesday, 21. November 2006 04:30PM' >>> 'The {1} is {0:%d}, the {2} is {0:%B}, the {3} is {0:%I:%M%p}.'.format(dt, "day", "month", "time") 'The day is 21, the month is November, the time is 04:30PM.'
pt_br: >>> from datetime import datetime, date, time, timezone >>> # Usando datetime.combine() >>> d = date(2005, 7, 14) >>> t = time(12, 30) >>> datetime.combine(d, t) datetime.datetime(2005, 7, 14, 12, 30) >>> # Usando datetime.now() >>> datetime.now() datetime.datetime(2007, 12, 6, 16, 29, 43, 79043) # GMT +1 >>> datetime.now(timezone.utc) datetime.datetime(2007, 12, 6, 15, 29, 43, 79060, tzinfo=datetime.timezone.utc) >>> # Usando datetime.strptime() >>> dt = datetime.strptime("21/11/06 16:30", "%d/%m/%y %H:%M") >>> dt datetime.datetime(2006, 11, 21, 16, 30) >>> # Usando datetime.timetuple() para obter uma tupla de todos os atributos >>> tt = dt.timetuple() >>> for it in tt: ... print(it) ... 2006 # ano 11 # mês 21 # dia 16 # hora 30 # minuto 0 # segundo 1 # dia da semana (0 = Segunda-feira) 325 # número de dias desde 1º de janeiro -1 # dst - método tzinfo.dst() retornou None >>> # Data em formato ISO >>> ic = dt.isocalendar() >>> for it in ic: ... print(it) ... 2006 # ano ISO 47 # semana ISO 2 # dia da semana ISO >>> # Formatando um datetime >>> dt.strftime("%A, %d. %B %Y %I:%M%p") 'Tuesday, 21. November 2006 04:30PM' >>> 'O {1} é {0:%d}, o {2} é {0:%B}, a {3} é {0:%I:%M%p}.'.format(dt, "dia", "mês", "hora") 'O dia é 21, o mês é November, a hora é 04:30PM.'

source: The example below defines a :class:`tzinfo` subclass capturing time zone information for Kabul, Afghanistan, which used +4 UTC until 1945 and then +4:30 UTC thereafter::
pt_br: O exemplo abaixo define uma subclasse :class:`tzinfo` capturando informações de fuso horário para Kabul, Afeganistão, o qual usou +4 UTC até 1945 e depois +4:30 UTC após esse período::

source: from datetime import timedelta, datetime, tzinfo, timezone class KabulTz(tzinfo): # Kabul used +4 until 1945, when they moved to +4:30 UTC_MOVE_DATE = datetime(1944, 12, 31, 20, tzinfo=timezone.utc) def utcoffset(self, dt): if dt.year < 1945: return timedelta(hours=4) elif (1945, 1, 1, 0, 0) <= dt.timetuple()[:5] < (1945, 1, 1, 0, 30): # An ambiguous ("imaginary") half-hour range representing # a 'fold' in time due to the shift from +4 to +4:30. # If dt falls in the imaginary range, use fold to decide how # to resolve. See PEP495. return timedelta(hours=4, minutes=(30 if dt.fold else 0)) else: return timedelta(hours=4, minutes=30) def fromutc(self, dt): # Follow same validations as in datetime.tzinfo if not isinstance(dt, datetime): raise TypeError("fromutc() requires a datetime argument") if dt.tzinfo is not self: raise ValueError("dt.tzinfo is not self") # A custom implementation is required for fromutc as # the input to this function is a datetime with utc values # but with a tzinfo set to self. # See datetime.astimezone or fromtimestamp. if dt.replace(tzinfo=timezone.utc) >= self.UTC_MOVE_DATE: return dt + timedelta(hours=4, minutes=30) else: return dt + timedelta(hours=4) def dst(self, dt): # Kabul does not observe daylight saving time. return timedelta(0) def tzname(self, dt): if dt >= self.UTC_MOVE_DATE: return "+04:30" return "+04"
pt_br: from datetime import timedelta, datetime, tzinfo, timezone class KabulTz(tzinfo): # Kabul usou +4 até 1945, quando eles moveram para +4:30 UTC_MOVE_DATE = datetime(1944, 12, 31, 20, tzinfo=timezone.utc) def utcoffset(self, dt): if dt.year < 1945: return timedelta(hours=4) elif (1945, 1, 1, 0, 0) <= dt.timetuple()[:5] < (1945, 1, 1, 0, 30): # Um intervalo de meia hora ambíguo ("imaginário") representando # um 'fold' no tempo por causa da troca de +4 para +4:30. # Se dt cair no intervalo imaginário, usa a fold para decidir como # para resolver. Veja PEP495. return timedelta(hours=4, minutes=(30 if dt.fold else 0)) else: return timedelta(hours=4, minutes=30) def fromutc(self, dt): # Segue as mesmas validações como em datetime.tzinfo if not isinstance(dt, datetime): raise TypeError("fromutc() requer um argumento datetime") if dt.tzinfo is not self: raise ValueError("dt.tzinfo não é self") # Uma implementação personalizada é necessária para fromutc # como a entrada para esta função é um datetime com valores utc # mas com um tzinfo definido para self. # Veja datetime.astimezone ou fromtimestamp. if dt.replace(tzinfo=timezone.utc) >= self.UTC_MOVE_DATE: return dt + timedelta(hours=4, minutes=30) else: return dt + timedelta(hours=4) def dst(self, dt): # Kabul não tem horário de verão. return timedelta(0) def tzname(self, dt): if dt >= self.UTC_MOVE_DATE: return "+04:30" return "+04"

source: Usage of ``KabulTz`` from above::
pt_br: Uso de ``KabulTz`` mostrado acima::

source: >>> tz1 = KabulTz() >>> # Datetime before the change >>> dt1 = datetime(1900, 11, 21, 16, 30, tzinfo=tz1) >>> print(dt1.utcoffset()) 4:00:00 >>> # Datetime after the change >>> dt2 = datetime(2006, 6, 14, 13, 0, tzinfo=tz1) >>> print(dt2.utcoffset()) 4:30:00 >>> # Convert datetime to another time zone >>> dt3 = dt2.astimezone(timezone.utc) >>> dt3 datetime.datetime(2006, 6, 14, 8, 30, tzinfo=datetime.timezone.utc) >>> dt2 datetime.datetime(2006, 6, 14, 13, 0, tzinfo=KabulTz()) >>> dt2 == dt3 True
pt_br: >>> tz1 = KabulTz() >>> # Datetime antes da alteração >>> dt1 = datetime(1900, 11, 21, 16, 30, tzinfo=tz1) >>> print(dt1.utcoffset()) 4:00:00 >>> # Datetime após a alteração >>> dt2 = datetime(2006, 6, 14, 13, 0, tzinfo=tz1) >>> print(dt2.utcoffset()) 4:30:00 >>> # Converte datetime para outro fuso horário >>> dt3 = dt2.astimezone(timezone.utc) >>> dt3 datetime.datetime(2006, 6, 14, 8, 30, tzinfo=datetime.timezone.utc) >>> dt2 datetime.datetime(2006, 6, 14, 13, 0, tzinfo=KabulTz()) >>> dt2 == dt3 True

source: :class:`.time` Objects
pt_br: Objetos :class:`.time`
