Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: :mod:`!datetime` --- Basic date and time types
pt_br: :mod:`!datetime` --- Tipos básicos de data e hora

source: **Source code:** :source:`Lib/datetime.py`
pt_br: **Código-fonte:** :source:`Lib/datetime.py`

source: The :mod:`!datetime` module supplies classes for manipulating dates and times.
pt_br: O módulo :mod:`!datetime` fornece as classes para manipulação de datas e horas.

source: While date and time arithmetic is supported, the focus of the implementation is on efficient attribute extraction for output formatting and manipulation.
pt_br: Ainda que a aritmética de data e hora seja suportada, o foco da implementação é na extração eficiente do atributo para formatação da saída e manipulação.

source: Skip to :ref:`the format codes <format-codes>`.
pt_br: Pular para :ref:`os códigos de formatação <format-codes>`.

source: Module :mod:`calendar`
pt_br: Módulo :mod:`calendar`

source: General calendar related functions.
pt_br: Funções gerais relacionadas ao calendário.

source: Module :mod:`time`
pt_br: Módulo :mod:`time`

source: Time access and conversions.
pt_br: Acesso de hora e conversões.

source: Module :mod:`zoneinfo`
pt_br: Módulo :mod:`zoneinfo`

source: Concrete time zones representing the IANA time zone database.
pt_br: Fusos horários concretos representando o banco de dados de fusos horários IANA.

source: Package `dateutil <https://dateutil.readthedocs.io/en/stable/>`_
pt_br: Pacote `dateutil <https://dateutil.readthedocs.io/en/stable/>`_

source: Third-party library with expanded time zone and parsing support.
pt_br: Biblioteca de terceiros com fuso horário expandido e suporte à análise.

source: Package :pypi:`DateType`
pt_br: Pacote :pypi:`DateType`

source: Third-party library that introduces distinct static types to e.g. allow :term:`static type checkers <static type checker>` to differentiate between naive and aware datetimes.
pt_br: Biblioteca de terceiros que apresenta tipos estáticos distintos para, por exemplo, permitir que :term:`verificadores de tipo estático <static type checker>` diferenciem datas ingênuas e conscientes.

source: Aware and Naive Objects
pt_br: Objetos Conscientes e Ingênuos

source: Date and time objects may be categorized as "aware" or "naive" depending on whether or not they include time zone information.
pt_br: Objetos de data e hora podem ser categorizados como "consciente" ou "ingênuo" dependendo se eles incluem ou não informação sobre fuso horário.

source: With sufficient knowledge of applicable algorithmic and political time adjustments, such as time zone and daylight saving time information, an **aware** object can locate itself relative to other aware objects. An aware object represents a specific moment in time that is not open to interpretation. [#]_
pt_br: Com conhecimento suficiente dos ajustes de tempo algorítmicos e políticos aplicáveis, como informações de fuso horário e horário de verão, um objeto **consciente** pode se localizar em relação a outros objetos conscientes. Um objeto consciente representa um momento específico no tempo que não está aberto à interpretação. [#]_

source: A **naive** object does not contain enough information to unambiguously locate itself relative to other date/time objects. Whether a naive object represents Coordinated Universal Time (UTC), local time, or time in some other time zone is purely up to the program, just like it is up to the program whether a particular number represents metres, miles, or mass. Naive objects are easy to understand and to work with, at the cost of ignoring some aspects of reality.
pt_br: Um objeto **ingênuo** não contém informações suficientes para se localizar inequivocamente em relação a outros objetos de data/hora. Se um objeto ingênuo representa o Coordinated Universal Time (UTC), a hora local, ou a hora em algum outro fuso horário, isso depende exclusivamente do programa, assim como é tarefa do programa decidir se um número específico representa metros, milhas ou massa. Objetos ingênuos são fáceis de entender e trabalhar, com o custo de ignorar alguns aspectos da realidade.

source: For applications requiring aware objects, :class:`.datetime` and :class:`.time` objects have an optional time zone information attribute, :attr:`!tzinfo`, that can be set to an instance of a subclass of the abstract :class:`tzinfo` class. These :class:`tzinfo` objects capture information about the offset from UTC time, the time zone name, and whether daylight saving time is in effect.
pt_br: Para aplicativos que requerem objetos conscientes, os objetos :class:`.datetime` e :class:`.time` possuem um atributo opcional de informações do fuso horário, :attr:`!tzinfo`, que pode ser definido como uma instância de uma subclasse da classe abstrata :class:`tzinfo`. Esses objetos :class:`tzinfo` capturam informações sobre a diferença da hora UTC, o nome do fuso horário e se o horário de verão está em vigor.

source: Only one concrete :class:`tzinfo` class, the :class:`timezone` class, is supplied by the :mod:`!datetime` module. The :class:`!timezone` class can represent simple time zones with fixed offsets from UTC, such as UTC itself or North American EST and EDT time zones. Supporting time zones at deeper levels of detail is up to the application. The rules for time adjustment across the world are more political than rational, change frequently, and there is no standard suitable for every application aside from UTC.
pt_br: Somente uma classe concreta :class:`tzinfo`, a classe :class:`timezone`, é fornecida pelo módulo :mod:`!datetime`. A classe :class:`!timezone` pode representar fusos horários simples com diferenças fixas do UTC, como o próprio UTC, ou os fusos horários norte-americanos EST e EDT. O suporte a fusos horários em níveis mais detalhados depende da aplicação. As regras para ajuste de tempo em todo o mundo são mais políticas do que racionais, mudam com frequência e não há um padrão adequado para todas as aplicações além da UTC.

source: Constants
pt_br: Constantes

source: The :mod:`!datetime` module exports the following constants:
pt_br: O módulo :mod:`!datetime` exporta as seguintes constantes:

source: The smallest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MINYEAR` is 1.
pt_br: O menor número de ano permitido em um objeto :class:`date` ou :class:`.datetime`. :const:`MINYEAR` é 1.

source: The largest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MAXYEAR` is 9999.
pt_br: O maior número de ano permitido no objeto :class:`date` ou :class:`.datetime`. :const:`MAXYEAR` é 9999.

source: Alias for the UTC time zone singleton :attr:`datetime.timezone.utc`.
pt_br: Apelido para o singleton de fuso horário UTC :attr:`datetime.timezone.utc`.

source: Available Types
pt_br: Tipos disponíveis

source: An idealized naive date, assuming the current Gregorian calendar always was, and always will be, in effect. Attributes: :attr:`year`, :attr:`month`, and :attr:`day`.
pt_br: Uma data ingênua idealizada, presumindo que o atual calendário Gregoriano sempre foi, e sempre estará em vigor. Atributos: :attr:`year`, :attr:`month` e :attr:`day`.

source: An idealized time, independent of any particular day, assuming that every day has exactly 24\*60\*60 seconds. (There is no notion of "leap seconds" here.) Attributes: :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
pt_br: Um horário ideal, independente de qualquer dia em particular, presumindo que todos os dias tenham exatamente 24\*60\*60 segundos. (Não há noção de "segundos bissextos" aqui.) Atributos: :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond` e :attr:`.tzinfo`.

source: A combination of a date and a time. Attributes: :attr:`year`, :attr:`month`, :attr:`day`, :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
pt_br: Uma combinação de uma data e uma hora. Atributos: :attr:`year`, :attr:`month`, :attr:`day`, :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond` e :attr:`.tzinfo`.

source: A duration expressing the difference between two :class:`.datetime` or :class:`date` instances to microsecond resolution.
pt_br: Uma duração que expressa a diferença entre duas instâncias :class:`.datetime` ou :class:`date` para resolução de microssegundos.

source: An abstract base class for time zone information objects. These are used by the :class:`.datetime` and :class:`.time` classes to provide a customizable notion of time adjustment (for example, to account for time zone and/or daylight saving time).
pt_br: Uma classe base abstrata para objetos de informações de fuso horário. Eles são usados pelas classes :class:`.datetime` e :class:`.time` para fornecer uma noção personalizável de ajuste de horário (por exemplo, para considerar o fuso horário e/ou o horário de verão).

source: A class that implements the :class:`tzinfo` abstract base class as a fixed offset from the UTC.
pt_br: Uma classe que implementa a classe base abstrata :class:`tzinfo` como uma diferença fixa do UTC.

source: Objects of these types are immutable.
pt_br: Objetos desse tipo são imutáveis.

source: Subclass relationships::
pt_br: Relacionamentos de subclasse::

source: Common Properties
pt_br: Propriedades Comuns

source: The :class:`date`, :class:`.datetime`, :class:`.time`, and :class:`timezone` types share these common features:
pt_br: Os tipos :class:`date`, :class:`.datetime`, :class:`.time` e :class:`timezone` compartilham esses recursos comuns:

source: Objects of these types are :term:`hashable`, meaning that they can be used as dictionary keys.
pt_br: Objetos desses tipos são :term:`hasheáveis <hasheável>`, o que significa que podem ser usados como chaves de dicionário.

source: Objects of these types support efficient pickling via the :mod:`pickle` module.
pt_br: Objetos desse tipo suportam decapagem eficiente através do módulo :mod:`pickle`.

source: Determining if an Object is Aware or Naive
pt_br: Determinando se um Objeto é Consciente ou Ingênuo

source: Objects of the :class:`date` type are always naive.
pt_br: Objetos do tipo :class:`date` são sempre ingênuos.

source: An object of type :class:`.time` or :class:`.datetime` may be aware or naive.
pt_br: Um objeto do tipo :class:`.time` ou :class:`.datetime` pode ser consciente ou ingênuo.

source: A :class:`.datetime` object ``d`` is aware if both of the following hold:
pt_br: O objeto :class:`.datetime` ``d`` é consciente se ambos os seguintes itens forem verdadeiros:

source: ``d.tzinfo`` is not ``None``
pt_br: ``d.tzinfo`` não é ``None``

source: ``d.tzinfo.utcoffset(d)`` does not return ``None``
pt_br: ``d.tzinfo.utcoffset(d)`` não retorna ``None``

source: Otherwise, ``d`` is naive.
pt_br: Caso contrário, ``d`` é ingênuo.

source: A :class:`.time` object ``t`` is aware if both of the following hold:
pt_br: O objeto :class:`.time` ``t`` é consciente, se os seguintes itens são verdadeiros:

source: ``t.tzinfo`` is not ``None``
pt_br: ``t.tzinfo`` não é ``None``

source: ``t.tzinfo.utcoffset(None)`` does not return ``None``.
pt_br: ``t.tzinfo.utcoffset(None)`` não retorna ``None``.

source: Otherwise, ``t`` is naive.
pt_br: Caso contrário, ``t`` é ingênuo.

source: The distinction between aware and naive doesn't apply to :class:`timedelta` objects.
pt_br: A distinção entre consciente e ingênuo não se aplica a objetos :class:`timedelta`.

source: :class:`timedelta` Objects
pt_br: Objetos :class:`timedelta`

source: A :class:`timedelta` object represents a duration, the difference between two :class:`.datetime` or :class:`date` instances.
pt_br: O objeto :class:`timedelta` representa uma duração, a diferença entre duas instâncias :class:`.datetime` ou :class:`date`.

source: All arguments are optional and default to 0. Arguments may be integers or floats, and may be positive or negative.
pt_br: Todos os argumentos são opcionais e o padrão é 0. Os argumentos podem ser números inteiros ou ponto flutuantes, e podem ser positivos ou negativos.

source: Only *days*, *seconds* and *microseconds* are stored internally. Arguments are converted to those units:
pt_br: Apenas *days*, *seconds* e *microseconds* são armazenados internamente. Os argumentos são convertidos para essas unidades:

source: A millisecond is converted to 1000 microseconds.
pt_br: Um milissegundo é convertido em 1000 microssegundos.

source: A minute is converted to 60 seconds.
pt_br: Um minuto é convertido em 60 segundos.

source: An hour is converted to 3600 seconds.
pt_br: Uma hora é convertida em 3600 segundos.

source: A week is converted to 7 days.
pt_br: Uma semana é convertida para 7 dias.

source: and days, seconds and microseconds are then normalized so that the representation is unique, with
pt_br: e dias, segundos e microssegundos são normalizados para que a representação seja única, com

source: ``0 <= seconds < 3600*24`` (the number of seconds in one day)
pt_br: ``0 <= seconds < 3600*24`` (o número de segundos em um dia)

source: The following example illustrates how any arguments besides *days*, *seconds* and *microseconds* are "merged" and normalized into those three resulting attributes::
pt_br: O exemplo a seguir ilustra como quaisquer argumentos além de *days*, *seconds* e *microseconds* são "mesclados" e normalizados nos três atributos resultantes::

source: >>> from datetime import timedelta >>> delta = timedelta( ... days=50, ... seconds=27, ... microseconds=10, ... milliseconds=29000, ... minutes=5, ... hours=8, ... weeks=2 ... ) >>> # Only days, seconds, and microseconds remain >>> delta datetime.timedelta(days=64, seconds=29156, microseconds=10)
pt_br: >>> from datetime import timedelta >>> delta = timedelta( ... days=50, ... seconds=27, ... microseconds=10, ... milliseconds=29000, ... minutes=5, ... hours=8, ... weeks=2 ... ) >>> # sá restam dias, segundos e microssegundos >>> delta datetime.timedelta(days=64, seconds=29156, microseconds=10)

source: If any argument is a float and there are fractional microseconds, the fractional microseconds left over from all arguments are combined and their sum is rounded to the nearest microsecond using round-half-to-even tiebreaker. If no argument is a float, the conversion and normalization processes are exact (no information is lost).
pt_br: Se qualquer argumento for um ponto flutuante e houver microssegundos fracionários, os microssegundos fracionários restantes de todos os argumentos serão combinados e sua soma será arredondada para o microssegundo mais próximo usando o desempatador de metade da metade para o par. Se nenhum argumento é ponto flutuante, os processos de conversão e normalização são exatos (nenhuma informação é perdida).

source: If the normalized value of days lies outside the indicated range, :exc:`OverflowError` is raised.
pt_br: Se o valor normalizado de dias estiver fora do intervalo indicado, a exceção :exc:`OverflowError` é levantada.

source: Note that normalization of negative values may be surprising at first. For example::
pt_br: Observe que a normalização de valores negativos pode ser surpreendente a princípio. Por exemplo::

source: Since the string representation of :class:`!timedelta` objects can be confusing, use the following recipe to produce a more readable format:
pt_br: Como a representação de string dos objetos :class:`!timedelta` pode ser confusa, use a seguinte receita para produzir um formato mais legível:

source: Class attributes:
pt_br: Atributos de classe:

source: The most negative :class:`timedelta` object, ``timedelta(-999999999)``.
pt_br: O mais negativo objeto :class:`timedelta`, ``timedelta(-999999999)``.

source: The most positive :class:`timedelta` object, ``timedelta(days=999999999, hours=23, minutes=59, seconds=59, microseconds=999999)``.
pt_br: O mais positivo objeto :class:`timedelta`, ``timedelta(days=999999999, hours=23, minutes=59, seconds=59, microseconds=999999)``.

source: The smallest possible difference between non-equal :class:`timedelta` objects, ``timedelta(microseconds=1)``.
pt_br: A menor diferença possível entre objetos não iguais :class:`timedelta`, ``timedelta(microseconds=1)``.

source: Note that, because of normalization, ``timedelta.max`` is greater than ``-timedelta.min``. ``-timedelta.max`` is not representable as a :class:`timedelta` object.
pt_br: Observe que, devido à normalização, ``timedelta.max`` é maior que ``-timedelta.min``. ``-timedelta.max`` não é representável como um objeto :class:`timedelta`.

source: Instance attributes (read-only):
pt_br: Atributos de instância (somente leitura):

source: Between -999,999,999 and 999,999,999 inclusive.
pt_br: Entre -999.999.999 e 999.999.999 inclusive

source: Between 0 and 86,399 inclusive.
pt_br: Entre 0 e 86.399 inclusive.

source: It is a somewhat common bug for code to unintentionally use this attribute when it is actually intended to get a :meth:`~timedelta.total_seconds` value instead:
pt_br: É um bug relativamente comum utilizar este atributo de forma não intencional quando, na verdade, o objetivo é obter o valor de :meth:`~timedelta.total_seconds`:

source: Between 0 and 999,999 inclusive.
pt_br: Entre 0 e 999.999 inclusive.

source: Supported operations:
pt_br: Operações suportadas:

source: Operation
pt_br: Operação

source: Result
pt_br: Resultado

source: Sum of ``t2`` and ``t3``. Afterwards ``t1 - t2 == t3`` and ``t1 - t3 == t2`` are true. (1)
pt_br: Soma de ``t2`` e ``t3``. Depois ``t1 - t2 == t3`` e ``t1 - t3 == t2`` são verdadeiros. (1)

source: Difference of ``t2`` and ``t3``. Afterwards ``t1 == t2 - t3`` and ``t2 == t1 + t3`` are true. (1)(6)
pt_br: Diferença de ``t2`` e ``t3``. Depois ``t1 == t2 - t3`` e ``t2 == t1 + t3`` são verdadeiros (1)(6)

source: Delta multiplied by an integer. Afterwards ``t1 // i == t2`` is true, provided ``i != 0``.
pt_br: Delta multiplicado por um número inteiro. Depois ``t1 // i == t2`` é verdadeiro, desde que ``i != 0``.

source: In general, ``t1 * i == t1 * (i-1) + t1`` is true. (1)
pt_br: Em geral, ``t1 * i == t1 * (i-1) + t1`` é verdadeiro. (1)

source: Delta multiplied by a float. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
pt_br: Delta multiplicado por um float, ponto flutuante. O resultado é arredondado para o múltiplo mais próximo de timedelta.resolution usando a metade da metade para o par.

source: Division (3) of overall duration ``t2`` by interval unit ``t3``. Returns a :class:`float` object.
pt_br: Divisão (3) da duração total ``t2`` por unidade de intervalo ``t3``. Retorna um objeto :class:`float`.

source: Delta divided by a float or an int. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
pt_br: Delta dividido por um float ou um int. O resultado é arredondado para o múltiplo mais próximo de timedelta.resolution usando a metade da metade para o par.

source: ``t1 = t2 // i`` or ``t1 = t2 // t3``
pt_br: ``t1 = t2 // i`` ou ``t1 = t2 // t3``

source: The floor is computed and the remainder (if any) is thrown away. In the second case, an integer is returned. (3)
pt_br: O piso é calculado e o restante (se houver) é jogado fora. No segundo caso, um número inteiro é retornado. (3)

source: The remainder is computed as a :class:`timedelta` object. (3)
pt_br: O restante é calculado como um objeto :class:`timedelta`. (3)

source: Computes the quotient and the remainder: ``q = t1 // t2`` (3) and ``r = t1 % t2``. ``q`` is an integer and ``r`` is a :class:`timedelta` object.
pt_br: Calcula o quociente e o resto: ``q = t1 // t2`` (3) e ``r = t1 % t2``. ``q`` é um inteiro e ``r`` é um objeto :class:`timedelta`.

source: Returns a :class:`timedelta` object with the same value. (2)
pt_br: Retorna um objeto :class:`timedelta` com o mesmo valor. (2)

source: Equivalent to ``timedelta(-t1.days, -t1.seconds, -t1.microseconds)``, and to ``t1 * -1``. (1)(4)
pt_br: Equivalente a ``timedelta(-t1.days, -t1.seconds, -t1.microseconds)`` e a ``t1 * -1``. (1)(4)

source: Equivalent to ``+t`` when ``t.days >= 0``, and to ``-t`` when ``t.days < 0``. (2)
pt_br: Equivalente a ``+t`` quando ``t.days >= 0`` e a ``-t`` quando ``t.days < 0``. (2)

source: Returns a string in the form ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, where D is negative for negative ``t``. (5)
pt_br: Retorna uma string no formato ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, onde D é negativo para ``t`` negativo. (5)

source: Returns a string representation of the :class:`timedelta` object as a constructor call with canonical attribute values.
pt_br: Retorna uma representação em string do objeto :class:`timedelta` como uma chamada do construtor com valores de atributos canônicos.

source: Notes:
pt_br: Notas:

source: This is exact but may overflow.
pt_br: Isso é exato, mas pode transbordar.

source: This is exact and cannot overflow.
pt_br: Isso é exato e não pode transbordar.

source: Division by zero raises :exc:`ZeroDivisionError`.
pt_br: A divisão por zero levanta :exc:`ZeroDivisionError`.

source: ``-timedelta.max`` is not representable as a :class:`timedelta` object.
pt_br: ``-timedelta.max`` não é representável como um objeto :class:`timedelta`.

source: String representations of :class:`timedelta` objects are normalized similarly to their internal representation. This leads to somewhat unusual results for negative timedeltas. For example::
pt_br: As representações de string de objetos :class:`timedelta` são normalizadas de maneira semelhante à sua representação interna. Isso leva a resultados um tanto incomuns para timedeltas negativos. Por exemplo::

source: The expression ``t2 - t3`` will always be equal to the expression ``t2 + (-t3)`` except when t3 is equal to ``timedelta.max``; in that case the former will produce a result while the latter will overflow.
pt_br: A expressão ``t2 - t3`` sempre será igual à expressão ``t2 + (-t3)`` exceto quando t3 for igual a ``timedelta.max``; nesse caso, o primeiro produzirá um resultado enquanto o último transbordará.

source: In addition to the operations listed above, :class:`timedelta` objects support certain additions and subtractions with :class:`date` and :class:`.datetime` objects (see below).
pt_br: Além das operações listadas acima, os objetos :class:`timedelta` suportam certas adições e subtrações com os objetos :class:`date` e :class:`.datetime` (veja abaixo).

source: Floor division and true division of a :class:`timedelta` object by another :class:`timedelta` object are now supported, as are remainder operations and the :func:`divmod` function. True division and multiplication of a :class:`timedelta` object by a :class:`float` object are now supported.
pt_br: A divisão pelo piso e a divisão verdadeira de um objeto :class:`timedelta` por outro objeto :class:`timedelta` agora são suportadas, assim como as operações restantes e a função :func:`divmod`. A divisão verdadeira e multiplicação de um objeto :class:`timedelta` por um objeto :class:`float` agora são suportadas.

source: :class:`timedelta` objects support equality and order comparisons.
pt_br: Objetos :class:`timedelta` dão suporte a comparações de igualdade e ordem.

source: In Boolean contexts, a :class:`timedelta` object is considered to be true if and only if it isn't equal to ``timedelta(0)``.
pt_br: Em contexto booleano, um objeto :class:`timedelta` é considerado verdadeiro se, e somente se, não for igual a ``timedelta(0)``.

source: Instance methods:
pt_br: Métodos de instância:

source: Return the total number of seconds contained in the duration. Equivalent to ``td / timedelta(seconds=1)``. For interval units other than seconds, use the division form directly (e.g. ``td / timedelta(microseconds=1)``).
pt_br: Retorna o número total de segundos contidos na duração. Equivalente a ``td / timedelta(seconds=1)``. Para unidades de intervalo diferentes de segundos, use a forma de divisão diretamente (por exemplo ``td / timedelta(microseconds=1)``).
