Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: When ``None`` is passed, it's up to the class designer to decide the best response. For example, returning ``None`` is appropriate if the class wishes to say that time objects don't participate in the :class:`tzinfo` protocols. It may be more useful for ``utcoffset(None)`` to return the standard UTC offset, as there is no other convention for discovering the standard offset.
pt_br: Quando ``None`` é passado, cabe ao projetista da classe decidir a melhor resposta. Por exemplo, retornar ``None`` é apropriado se a classe deseja dizer que objetos time não participam nos protocolos da classe :class:`tzinfo`. Pode ser mais útil para ``utcoffset(None)`` retornar a diferença UTC padrão, como não existe outra convenção para descobrir a diferença padrão.

source: When a :class:`.datetime` object is passed in response to a :class:`.datetime` method, ``dt.tzinfo`` is the same object as *self*. :class:`tzinfo` methods can rely on this, unless user code calls :class:`tzinfo` methods directly. The intent is that the :class:`tzinfo` methods interpret *dt* as being in local time, and not need worry about objects in other time zones.
pt_br: Quando um objeto :class:`.datetime` é passado em resposta a um método :class:`.datetime`, ``dt.tzinfo`` é o mesmo objeto que *self*. Os métodos :class:`tzinfo` podem confiar nisso, a menos que o código do usuário chame métodos :class:`tzinfo` diretamente. A intenção é que os métodos :class:`tzinfo` interpretem *dt* como estando no horário local, e não precisem se preocupar com objetos em outros fusos horários.

source: There is one more :class:`tzinfo` method that a subclass may wish to override:
pt_br: Existe mais um método :class:`tzinfo` que uma subclasse pode desejar substituição:

source: This is called from the default :meth:`datetime.astimezone` implementation. When called from that, ``dt.tzinfo`` is *self*, and *dt*'s date and time data are to be viewed as expressing a UTC time. The purpose of :meth:`fromutc` is to adjust the date and time data, returning an equivalent datetime in *self*'s local time.
pt_br: Isto é chamado a partir do padrão implementação de :meth:`datetime.astimezone`. Quando chamado a partir dele, ``dt.tzinfo`` é *self*, e os dados de data e hora de *dt* devem ser vistos como expressando um Horário Universal Coordenado (UTC). O propósito de :meth:`fromutc` é ajustar os dados de data e hora, retornando um *datetime* equivalente na hora local de *self*.

source: Most :class:`tzinfo` subclasses should be able to inherit the default :meth:`fromutc` implementation without problems. It's strong enough to handle fixed-offset time zones, and time zones accounting for both standard and daylight time, and the latter even if the DST transition times differ in different years. An example of a time zone the default :meth:`fromutc` implementation may not handle correctly in all cases is one where the standard offset (from UTC) depends on the specific date and time passed, which can happen for political reasons. The default implementations of :meth:`~.datetime.astimezone` and :meth:`fromutc` may not produce the result you want if the result is one of the hours straddling the moment the standard offset changes.
pt_br: A maioria das subclasses de :class:`tzinfo` deve ser capaz de herdar a implementação padrão de :meth:`fromutc` sem problemas. Ela é robusta o suficiente para lidar com fusos horários de deslocamento fixo, e fusos horários que contabilizam tanto o horário padrão quanto o horário de verão, sendo que este último é tratado mesmo que os horários de transição do horário de verão sejam diferentes em anos distintos. Um exemplo de fuso horário que a implementação padrão de :meth:`fromutc` pode não lidar corretamente em todos os casos é aquele onde o deslocamento padrão (de UTC) depende da data e hora específicas passadas, o que pode acontecer por razões políticas. As implementações padrão de :meth:`~.datetime.astimezone` e :meth:`fromutc` podem não produzir o resultado desejado se o resultado estiver entre as horas que abrangem o momento em que o deslocamento padrão muda.

source: Skipping code for error cases, the default :meth:`fromutc` implementation acts like::
pt_br: Ignorando o código para casos de erros, a implementação padrão :meth:`fromutc` funciona como::

source: def fromutc(self, dt): # raise ValueError error if dt.tzinfo is not self dtoff = dt.utcoffset() dtdst = dt.dst() # raise ValueError if dtoff is None or dtdst is None delta = dtoff - dtdst # this is self's standard offset if delta: dt += delta # convert to standard local time dtdst = dt.dst() # raise ValueError if dtdst is None if dtdst: return dt + dtdst else: return dt
pt_br: def fromutc(self, dt): # levanta o erro ValueError se dt.tzinfo não é o self dtoff = dt.utcoffset() dtdst = dt.dst() # levanta ValueError se dtoff é None ou dtdst é None delta = dtoff - dtdst # este é o deslocamento padrão do self if delta: dt += delta # converter para hora local padrão dtdst = dt.dst() # levanta ValueError se dtdst é None if dtdst: return dt + dtdst else: return dt

source: In the following :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` file there are some examples of :class:`tzinfo` classes:
pt_br: No seguinte arquivo :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` existem alguns exemplos de classes :class:`tzinfo`:

source: from datetime import tzinfo, timedelta, datetime ZERO = timedelta(0) HOUR = timedelta(hours=1) SECOND = timedelta(seconds=1) # A class capturing the platform's idea of local time. # (May result in wrong values on historical times in # timezones where UTC offset and/or the DST rules had # changed in the past.) import time as _time STDOFFSET = timedelta(seconds = -_time.timezone) if _time.daylight: DSTOFFSET = timedelta(seconds = -_time.altzone) else: DSTOFFSET = STDOFFSET DSTDIFF = DSTOFFSET - STDOFFSET class LocalTimezone(tzinfo): def fromutc(self, dt): assert dt.tzinfo is self stamp = (dt - datetime(1970, 1, 1, tzinfo=self)) // SECOND args = _time.localtime(stamp)[:6] dst_diff = DSTDIFF // SECOND # Detect fold fold = (args == _time.localtime(stamp - dst_diff)) return datetime(*args, microsecond=dt.microsecond, tzinfo=self, fold=fold) def utcoffset(self, dt): if self._isdst(dt): return DSTOFFSET else: return STDOFFSET def dst(self, dt): if self._isdst(dt): return DSTDIFF else: return ZERO def tzname(self, dt): return _time.tzname[self._isdst(dt)] def _isdst(self, dt): tt = (dt.year, dt.month, dt.day, dt.hour, dt.minute, dt.second, dt.weekday(), 0, 0) stamp = _time.mktime(tt) tt = _time.localtime(stamp) return tt.tm_isdst > 0 Local = LocalTimezone() # A complete implementation of current DST rules for major US time zones. def first_sunday_on_or_after(dt): days_to_go = 6 - dt.weekday() if days_to_go: dt += timedelta(days_to_go) return dt # US DST Rules # # This is a simplified (i.e., wrong for a few cases) set of rules for US # DST start and end times. For a complete and up-to-date set of DST rules # and timezone definitions, visit the Olson Database (or try pytz): # http://www.twinsun.com/tz/tz-link.htm # https://sourceforge.net/projects/pytz/ (might not be up-to-date) # # In the US, since 2007, DST starts at 2am (standard time) on the second # Sunday in March, which is the first Sunday on or after Mar 8. DSTSTART_2007 = datetime(1, 3, 8, 2) # and ends at 2am (DST time) on the first Sunday of Nov. DSTEND_2007 = datetime(1, 11, 1, 2) # From 1987 to 2006, DST used to start at 2am (standard time) on the first # Sunday in April and to end at 2am (DST time) on the last # Sunday of October, which is the first Sunday on or after Oct 25. DSTSTART_1987_2006 = datetime(1, 4, 1, 2) DSTEND_1987_2006 = datetime(1, 10, 25, 2) # From 1967 to 1986, DST used to start at 2am (standard time) on the last # Sunday in April (the one on or after April 24) and to end at 2am (DST time) # on the last Sunday of October, which is the first Sunday # on or after Oct 25. DSTSTART_1967_1986 = datetime(1, 4, 24, 2) DSTEND_1967_1986 = DSTEND_1987_2006 def us_dst_range(year): # Find start and end times for US DST. For years before 1967, return # start = end for no DST. if 2006 < year: dststart, dstend = DSTSTART_2007, DSTEND_2007 elif 1986 < year < 2007: dststart, dstend = DSTSTART_1987_2006, DSTEND_1987_2006 elif 1966 < year < 1987: dststart, dstend = DSTSTART_1967_1986, DSTEND_1967_1986 else: return (datetime(year, 1, 1), ) * 2 start = first_sunday_on_or_after(dststart.replace(year=year)) end = first_sunday_on_or_after(dstend.replace(year=year)) return start, end class USTimeZone(tzinfo): def __init__(self, hours, reprname, stdname, dstname): self.stdoffset = timedelta(hours=hours) self.reprname = reprname self.stdname = stdname self.dstname = dstname def __repr__(self): return self.reprname def tzname(self, dt): if self.dst(dt): return self.dstname else: return self.stdname def utcoffset(self, dt): return self.stdoffset + self.dst(dt) def dst(self, dt): if dt is None or dt.tzinfo is None: # An exception may be sensible here, in one or both cases. # It depends on how you want to treat them. The default # fromutc() implementation (called by the default astimezone() # implementation) passes a datetime with dt.tzinfo is self. return ZERO assert dt.tzinfo is self start, end = us_dst_range(dt.year) # Can't compare naive to aware objects, so strip the timezone from # dt first. dt = dt.replace(tzinfo=None) if start + HOUR <= dt < end - HOUR: # DST is in effect. return HOUR if end - HOUR <= dt < end: # Fold (an ambiguous hour): use dt.fold to disambiguate. return ZERO if dt.fold else HOUR if start <= dt < start + HOUR: # Gap (a non-existent hour): reverse the fold rule. return HOUR if dt.fold else ZERO # DST is off. return ZERO def fromutc(self, dt): assert dt.tzinfo is self start, end = us_dst_range(dt.year) start = start.replace(tzinfo=self) end = end.replace(tzinfo=self) std_time = dt + self.stdoffset dst_time = std_time + HOUR if end <= dst_time < end + HOUR: # Repeated hour return std_time.replace(fold=1) if std_time < start or dst_time >= end: # Standard time return std_time if start <= std_time < end - HOUR: # Daylight saving time return dst_time Eastern = USTimeZone(-5, "Eastern", "EST", "EDT") Central = USTimeZone(-6, "Central", "CST", "CDT") Mountain = USTimeZone(-7, "Mountain", "MST", "MDT") Pacific = USTimeZone(-8, "Pacific", "PST", "PDT")
pt_br: from datetime import tzinfo, timedelta, datetime ZERO = timedelta(0) HOUR = timedelta(hours=1) SECOND = timedelta(seconds=1) # Uma classe que captura a ideia da plataforma sobre o horário local. # (Pode resultar em valores errados em horários históricos em fusos horários # onde o deslocamento UTC e/ou as regras de horário de verão # foram alteradas no passado.) import time as _time STDOFFSET = timedelta(seconds = -_time.timezone) if _time.daylight: DSTOFFSET = timedelta(seconds = -_time.altzone) else: DSTOFFSET = STDOFFSET DSTDIFF = DSTOFFSET - STDOFFSET class LocalTimezone(tzinfo): def fromutc(self, dt): assert dt.tzinfo is self stamp = (dt - datetime(1970, 1, 1, tzinfo=self)) // SECOND args = _time.localtime(stamp)[:6] dst_diff = DSTDIFF // SECOND # Detect fold fold = (args == _time.localtime(stamp - dst_diff)) return datetime(*args, microsecond=dt.microsecond, tzinfo=self, fold=fold) def utcoffset(self, dt): if self._isdst(dt): return DSTOFFSET else: return STDOFFSET def dst(self, dt): if self._isdst(dt): return DSTDIFF else: return ZERO def tzname(self, dt): return _time.tzname[self._isdst(dt)] def _isdst(self, dt): tt = (dt.year, dt.month, dt.day, dt.hour, dt.minute, dt.second, dt.weekday(), 0, 0) stamp = _time.mktime(tt) tt = _time.localtime(stamp) return tt.tm_isdst > 0 Local = LocalTimezone() # Uma implementação completa das regras atuais do horário de verão para os principais fusos horários dos EUA. def first_sunday_on_or_after(dt): days_to_go = 6 - dt.weekday() if days_to_go: dt += timedelta(days_to_go) return dt # Regras do horário de verão dos EUA # # Este é um conjunto simplificado (ou seja, incorreto em alguns casos) # de regras para os horários de início e término do horário de verão dos EUA. # Para um conjunto completo e atualizado de regras de horário de verão # e definições de fuso horário, visite o Olson Database (ou tente pytz): # http://www.twinsun.com/tz/tz-link.htm # https://sourceforge.net/projects/pytz/ (pode não estar atualizado) # # Nos EUA, desde 2007, o horário de verão começa às 2h (horário padrão) no # segundo domingo de março, que é o primeiro domingo em ou após 8 de março. DSTSTART_2007 = datetime(1, 3, 8, 2) # e termina às 2h (horário de verão) no primeiro domingo de novembro. DSTEND_2007 = datetime(1, 11, 1, 2) # De 1987 a 2006, o horário de verão costumava começar às 2h # (horário padrão) no primeiro domingo de abril e terminar às 2h # (horário de verão) no último Domingo de outubro, que é o primeiro # domingo em ou após 25 de outubro. DSTSTART_1987_2006 = datetime(1, 4, 1, 2) DSTEND_1987_2006 = datetime(1, 10, 25, 2) # De 1967 a 1986, o horário de verão costumava começar às 2h # (horário padrão) no último domingo de abril (aquele em ou após # 24 de abril) e terminar às 2h (horário de verão) no último domingo # de outubro, que é o primeiro domingo em ou após 25 de outubro. DSTSTART_1967_1986 = datetime(1, 4, 24, 2) DSTEND_1967_1986 = DSTEND_1987_2006 def us_dst_range(year): # Encontra os horários de início e fim do horário de verão dos EUA. # Para anos anteriores a 1967, retorne start = end para nenhum horário # de verão. if 2006 < year: dststart, dstend = DSTSTART_2007, DSTEND_2007 elif 1986 < year < 2007: dststart, dstend = DSTSTART_1987_2006, DSTEND_1987_2006 elif 1966 < year < 1987: dststart, dstend = DSTSTART_1967_1986, DSTEND_1967_1986 else: return (datetime(year, 1, 1), ) * 2 start = first_sunday_on_or_after(dststart.replace(year=year)) end = first_sunday_on_or_after(dstend.replace(year=year)) return start, end class USTimeZone(tzinfo): def __init__(self, hours, reprname, stdname, dstname): self.stdoffset = timedelta(hours=hours) self.reprname = reprname self.stdname = stdname self.dstname = dstname def __repr__(self): return self.reprname def tzname(self, dt): if self.dst(dt): return self.dstname else: return self.stdname def utcoffset(self, dt): return self.stdoffset + self.dst(dt) def dst(self, dt): if dt is None or dt.tzinfo is None: # Uma exceção pode ser sensata aqui, em um ou ambos os casos. # Depende de como você quer tratá-las. A implementação padrão # fromutc() (chamada pela implementação padrão astimezone()) passa # um datetime com dt.tzinfo é self. return ZERO assert dt.tzinfo is self start, end = us_dst_range(dt.year) # Não é possível comparar objetos ingênuos com objetos conscientes, # então retira o fuso horário de dt primeiro. dt = dt.replace(tzinfo=None) if start + HOUR <= dt < end - HOUR: # Horário de verão está em vigor. return HOUR if end - HOUR <= dt < end: # Fold (uma hora ambígua): usa dt.fold para desambiguar. return ZERO if dt.fold else HOUR if start <= dt < start + HOUR: # Intervalo (uma hora inexistente): inverta a regra da dobra. return HOUR if dt.fold else ZERO # DST is off. return ZERO def fromutc(self, dt): assert dt.tzinfo is self start, end = us_dst_range(dt.year) start = start.replace(tzinfo=self) end = end.replace(tzinfo=self) std_time = dt + self.stdoffset dst_time = std_time + HOUR if end <= dst_time < end + HOUR: # Hora repetida return std_time.replace(fold=1) if std_time < start or dst_time >= end: # Horário padrão return std_time if start <= std_time < end - HOUR: # Horário de verão return dst_time Eastern = USTimeZone(-5, "Eastern", "EST", "EDT") Central = USTimeZone(-6, "Central", "CST", "CDT") Mountain = USTimeZone(-7, "Mountain", "MST", "MDT") Pacific = USTimeZone(-8, "Pacific", "PST", "PDT")

source: Note that there are unavoidable subtleties twice per year in a :class:`tzinfo` subclass accounting for both standard and daylight time, at the DST transition points. For concreteness, consider US Eastern (UTC -0500), where EDT begins the minute after 1:59 (EST) on the second Sunday in March, and ends the minute after 1:59 (EDT) on the first Sunday in November::
pt_br: Perceba que existem sutilezas inevitáveis duas vezes por ano em uma subclasse :class:`tzinfo` contabilizando tanto hora normal e horário de verão, nos pontos de transição do horário de verão. Para concretude, considere a costa leste dos EUA (UTC -0500), onde o horário de verão EDT começa no minuto após 1:59 (EST, hora padrão) no segundo domingo de Março, e termina no minuto posterior a 1:59 (EDT, horário de verão) no primeiro domingo de Novembro::

source: When DST starts (the "start" line), the local wall clock leaps from 1:59 to 3:00. A wall time of the form 2:MM doesn't really make sense on that day, so ``astimezone(Eastern)`` won't deliver a result with ``hour == 2`` on the day DST begins. For example, at the Spring forward transition of 2016, we get::
pt_br: Quando o horário de verão inicia (a linha de "início"), o relógio de parede local salta de 1:59 para 3:00. Um horário de parede da forma 2:MM realmente não faz sentido nesse dia, então ``astimezone(Eastern)`` não irá entregar um resultado com ``hour == 2`` no dia que o horário de verão começar. Por exemplo, na primavera de transição para frente em 2016, nós tivemos::

source: When DST ends (the "end" line), there's a potentially worse problem: there's an hour that can't be spelled unambiguously in local wall time: the last hour of daylight time. In Eastern, that's times of the form 5:MM UTC on the day daylight time ends. The local wall clock leaps from 1:59 (daylight time) back to 1:00 (standard time) again. Local times of the form 1:MM are ambiguous. :meth:`~.datetime.astimezone` mimics the local clock's behavior by mapping two adjacent UTC hours into the same local hour then. In the Eastern example, UTC times of the form 5:MM and 6:MM both map to 1:MM when converted to Eastern, but earlier times have the :attr:`~.datetime.fold` attribute set to 0 and the later times have it set to 1. For example, at the Fall back transition of 2016, we get::
pt_br: Quando o horário de verão termina (a linha "end"), há um problema potencialmente pior: existe uma hora que não pode ser expressa de forma inequívoca no horário local: a última hora do horário de verão. No fuso Eastern, isso corresponde a horários no formato 5:MM UTC no dia em que o horário de verão termina. O relógio de parede local salta de 1:59 (horário de verão) para 1:00 (horário padrão) novamente. Horários locais no formato 1:MM são ambíguos. :meth:`~.datetime.astimezone` imita o comportamento do relógio local mapeando então duas horas UTC adjacentes para a mesma hora local. No exemplo do fuso Eastern, horários UTC no formato 5:MM e 6:MM ambos se transformam em 1:MM quando convertidos para o fuso Eastern, mas os horários anteriores têm o atributo :attr:`~.datetime.fold` definido como 0 e os horários posteriores têm o atributo definido como 1. Por exemplo, na transição de retorno de 2016, obtemos::

source: Note that the :class:`.datetime` instances that differ only by the value of the :attr:`~.datetime.fold` attribute are considered equal in comparisons.
pt_br: Observe que as instâncias de :class:`.datetime` que diferem apenas pelo valor do atributo :attr:`~.datetime.fold` são consideradas iguais nas comparações.

source: Applications that can't bear wall-time ambiguities should explicitly check the value of the :attr:`~.datetime.fold` attribute or avoid using hybrid :class:`tzinfo` subclasses; there are no ambiguities when using :class:`timezone`, or any other fixed-offset :class:`tzinfo` subclass (such as a class representing only EST (fixed offset -5 hours), or only EDT (fixed offset -4 hours)).
pt_br: Aplicações que não suportam ambiguidades de tempo devem verificar explicitamente o valor do atributo :attr:`~.datetime.fold` ou evitar utilizar subclasses híbridas :class:`tzinfo`; não há ambiguidades ao usar :class:`timezone` ou qualquer outra subclasse :class:`tzinfo` de deslocamento fixo (como uma classe que representa apenas EST (deslocamento fixo de -5 horas) ou apenas EDT (deslocamento fixo de -4 horas)).

source: The :mod:`!datetime` module has a basic :class:`timezone` class (for handling arbitrary fixed offsets from UTC) and its :attr:`timezone.utc` attribute (a UTC :class:`!timezone` instance).
pt_br: O módulo :mod:`!datetime` possui uma classe básica :class:`timezone` (para lidar com deslocamentos fixos arbitrários do UTC) e seu atributo :attr:`timezone.utc` (uma instância UTC :class:`!timezone` ).

source: ``zoneinfo`` brings the *IANA time zone database* (also known as the Olson database) to Python, and its usage is recommended.
pt_br: ``zoneinfo`` traz o *banco de dados de fuso horário IANA* (também conhecido como banco de dados Olson) para Python, e seu uso é recomendado.

source: `IANA time zone database <https://www.iana.org/time-zones>`_
pt_br: `Banco de dados de fuso horário da IANA <https://www.iana.org/time-zones>`_

source: The Time Zone Database (often called tz, tzdata or zoneinfo) contains code and data that represent the history of local time for many representative locations around the globe. It is updated periodically to reflect changes made by political bodies to time zone boundaries, UTC offsets, and daylight-saving rules.
pt_br: O banco de dados de fuso horário (comumente chamado de tz, tzdata ou zoneinfo) contém código e dados que representam o histórico de hora local para muitas localizações representativas ao redor do globo. Ele é atualizado periodicamente para refletir mudanças feitas por corpos políticos para limites de fuso horário, diferenças UTC, e regras de horário de verão.

source: :class:`timezone` Objects
pt_br: Objetos :class:`timezone`

source: The :class:`timezone` class is a subclass of :class:`tzinfo`, each instance of which represents a time zone defined by a fixed offset from UTC.
pt_br: A classe :class:`timezone` é uma subclasse de :class:`tzinfo`, cada instância da qual representa um fuso horário definido por um deslocamento fixo do UTC.

source: Objects of this class cannot be used to represent time zone information in the locations where different offsets are used in different days of the year or where historical changes have been made to civil time.
pt_br: Objetos desta classe não podem ser usados para representar informações de fuso horário em locais onde diferentes deslocamentos são usados em diferentes dias do ano ou onde mudanças históricas foram feitas no horário civil.

source: The *offset* argument must be specified as a :class:`timedelta` object representing the difference between the local time and UTC. It must be strictly between ``-timedelta(hours=24)`` and ``timedelta(hours=24)``, otherwise :exc:`ValueError` is raised.
pt_br: O argumento *offset* deve ser especificado como um objeto :class:`timedelta` representando a diferença entre o tempo local e o UTC. Ele deve estar estritamente entre ``-timedelta(hours=24)`` e ``timedelta(hous=24)``, caso contrário a exceção :exc:`ValueError` será provocada.

source: The *name* argument is optional. If specified it must be a string that will be used as the value returned by the :meth:`datetime.tzname` method.
pt_br: O argumento *name* é opcional. Se especificado, deve ser uma string que será usada como o valor retornado pelo método :meth:`datetime.tzname`.

source: Return the fixed value specified when the :class:`timezone` instance is constructed.
pt_br: Retorna o valor fixo especificado quando a instância :class:`timezone` é construída.

source: The *dt* argument is ignored. The return value is a :class:`timedelta` instance equal to the difference between the local time and UTC.
pt_br: O argumento *dt* é ignorado. O valor de retorno é uma instância :class:`timedelta` equivalente à diferença entre o tempo local e o UTC.
