Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: This is like :meth:`now`, but returns the current UTC date and time, as a naive :class:`.datetime` object. An aware current UTC datetime can be obtained by calling ``datetime.now(timezone.utc)``. See also :meth:`now`.
pt_br: Este é similar a :meth:`now`, mas retorna a data e hora atual em UTC, como um objeto :class:`.datetime` ingênuo. Um datetime UTC consciente pode ser obtido chamando ``datetime.now(timezone.utc)``. Veja também :meth:`now`.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing the current time in UTC is by calling ``datetime.now(timezone.utc)``.
pt_br: Devido ao fato de objetos ``datetime`` ingênuos serem tratados por muitos métodos ``datetime`` como hora local, é preferível usar datetimes conscientes para representar horas em UTC. De tal forma, a maneira recomendada para criar um objeto representando a hora local em UTC é chamando ``datetime.now(timezone.utc)``.

source: Use :meth:`datetime.now` with :const:`UTC` instead.
pt_br: Use :meth:`datetime.now` com :const:`UTC`.

source: Return the local date and time corresponding to the POSIX timestamp, such as is returned by :func:`time.time`. If optional argument *tz* is ``None`` or not specified, the timestamp is converted to the platform's local date and time, and the returned :class:`.datetime` object is naive.
pt_br: Retorna a data e hora local correspondente ao registro de data e hora POSIX, como é retornado por :func:`time.time`. Se o argumento opcional *tz* é ``None`` ou não especificado, o registro de data e hora é convertido para a data e hora local da plataforma, e o objeto :class:`.datetime` retornado é ingênuo.

source: If *tz* is not ``None``, it must be an instance of a :class:`tzinfo` subclass, and the timestamp is converted to *tz*’s time zone.
pt_br: Se *tz* não for ``None``, ela deve ser uma instância de uma subclasse de :class:`tzinfo`, e o registro de data e hora é convertido para o fuso horário de *tz*.

source: :meth:`fromtimestamp` may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years in 1970 through 2038. Note that on non-POSIX systems that include leap seconds in their notion of a timestamp, leap seconds are ignored by :meth:`fromtimestamp`, and then it's possible to have two timestamps differing by a second that yield identical :class:`.datetime` objects. This method is preferred over :meth:`utcfromtimestamp`.
pt_br: :meth:`fromtimestamp` pode levantar :exc:`OverflowError`, se o registro de data e hora estiver fora do intervalo de valores suportados pelas funções em C :c:func:`localtime` ou :c:func:`gmtime` da plataforma, e ocorrer uma falha de :exc:`OSError` em :c:func:`localtime` ou :c:func:`gmtime`. É comum para isso ser restrito aos anos 1970 até 2038. Perceba que em sistemas não-POSIX que incluem segundos bissextos na sua notação de registro de data e hora, segundos bissextos são ignorados por :meth:`fromtimestamp`, e então é possível ter dois registros de data e hora com diferença de um segundo que apresentam objetos :class:`.datetime` idênticos. Este método é preferido sobre :meth:`utcfromtimestamp`.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` or :c:func:`gmtime` failure.
pt_br: Levanta um :exc:`OverflowError` ao invés de :exc:`ValueError` se o registro de data e hora estiver fora do intervalo dos valores suportados pelas funções C :c:func:`localtime` ou :c:func:`gmtime` da plataforma. Levanta :exc:`OSError` ao invés de :exc:`ValueError` em falhas de :c:func:`localtime` ou :c:func:`gmtime`.

source: :meth:`fromtimestamp` may return instances with :attr:`.fold` set to 1.
pt_br: :meth:`fromtimestamp` pode retornar instâncias com :attr:`.fold` igual a 1.

source: Return the UTC :class:`.datetime` corresponding to the POSIX timestamp, with :attr:`.tzinfo` ``None``. (The resulting object is naive.)
pt_br: Retorna o :class:`.datetime` UTC correspondente ao registro de data e hora POSIX, com :attr:`.tzinfo` setado para ``None``. (O objeto resultante é ingênuo.)

source: This may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`gmtime` function, and :exc:`OSError` on :c:func:`gmtime` failure. It's common for this to be restricted to years in 1970 through 2038.
pt_br: Isso pode levantar :exc:`OverflowError`, se o registro de data e hora estiver fora do intervalo de valores suportados pela função C :c:func:`gmtime` da plataforma, e em caso de falha :exc:`OSError` em :c:func:`gmtime`. É comum que isso seja restrito a anos de 1970 a 2038.

source: To get an aware :class:`.datetime` object, call :meth:`fromtimestamp`::
pt_br: Para conseguir um objeto :class:`.datetime` consciente, chame :meth:`fromtimestamp`::

source: On the POSIX compliant platforms, it is equivalent to the following expression::
pt_br: Nas plataformas compatíveis com POSIX, é equivalente à seguinte expressão::

source: except the latter formula always supports the full years range: between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
pt_br: com a exceção de que a última fórmula sempre dá suporte ao intervalo completo de anos: entre :const:`MINYEAR` e :const:`MAXYEAR` inclusive.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing a specific timestamp in UTC is by calling ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.
pt_br: Devido ao fato de objetos ``datetime`` ingênuos serem tratados por muitos métodos ``datetime`` como hora local, é preferível usar datetimes conscientes para representar horas em UTC. De tal forma, a maneira recomendada para criar um objeto representando um registro de data e hora específico em UTC é chamando ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`gmtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`gmtime` failure.
pt_br: Levanta :exc:`OverflowError` ao invés de :exc:`ValueError` se o registro de data e hora estiver fora do intervalo de valores suportados pela função C :c:func:`gmtime` da plataforma. Levanta :exc:`OSError` ao invés de :exc:`ValueError` em caso de falha :c:func:`gmtime`.

source: Use :meth:`datetime.fromtimestamp` with :const:`UTC` instead.
pt_br: Use :meth:`datetime.fromtimestamp` com :const:`UTC`.

source: Return the :class:`.datetime` corresponding to the proleptic Gregorian ordinal, where January 1 of year 1 has ordinal 1. :exc:`ValueError` is raised unless ``1 <= ordinal <= datetime.max.toordinal()``. The hour, minute, second and microsecond of the result are all 0, and :attr:`.tzinfo` is ``None``.
pt_br: Retorna um :class:`.datetime` correspondente ao ordinal proléptico Gregoriano, onde 1º de janeiro do ano 1 tem ordinal 1. :exc:`ValueError` é levantado a não ser que ``1 <= ordinal <= datetime.max.toordinal()``. As horas, minutos, segundos e micro segundos do resultado são todos 0, e :attr:`.tzinfo` é ``None``.

source: Return a new :class:`.datetime` object whose date components are equal to the given :class:`date` object's, and whose time components are equal to the given :class:`.time` object's. If the *tzinfo* argument is provided, its value is used to set the :attr:`.tzinfo` attribute of the result, otherwise the :attr:`~.time.tzinfo` attribute of the *time* argument is used. If the *date* argument is a :class:`.datetime` object, its time components and :attr:`.tzinfo` attributes are ignored.
pt_br: Retorna um novo objeto :class:`.datetime` no qual os componentes de data são iguais ao objeto :class:`date` fornecido, e nos quais os componentes de hora são iguais ao do objeto :class:`.time` fornecido. Se o argumento *tzinfo* é fornecido, seu valor é usado para definir o atributo :attr:`.tzinfo` do resultado, caso contrário o atributo :attr:`~.time.tzinfo` do argumento *time* é usado. Se o argumento *date* é um objeto :class:`.datetime`, seus componentes de hora e atributos :attr:`.tzinfo` são ignorados.

source: For any :class:`.datetime` object ``d``, ``d == datetime.combine(d.date(), d.time(), d.tzinfo)``.
pt_br: Para qualquer objeto :class:`.datetime` ``d``, ``d == datetime.combine(d.date(), d.time(), d.tzinfo)``.

source: Added the *tzinfo* argument.
pt_br: Adicionado o argumento *tzinfo*.

source: Return a :class:`.datetime` corresponding to a *date_string* in any valid ISO 8601 format, with the following exceptions:
pt_br: Retorna um :class:`.datetime` correspondendo a *date_string* em qualquer formato válido de ISO 8601, com as seguintes exceções:

source: Time zone offsets may have fractional seconds.
pt_br: Os deslocamentos de fuso horário podem ter segundos fracionários.

source: The ``T`` separator may be replaced by any single unicode character.
pt_br: O separador ``T`` pode ser substituído por qualquer caractere unicode único.

source: Fractional hours and minutes are not supported.
pt_br: Horas e minutos fracionários não são suportados.

source: Previously, this method only supported formats that could be emitted by :meth:`date.isoformat` or :meth:`datetime.isoformat`.
pt_br: Anteriormente, este método suportava apenas formatos que podiam ser emitidos por :meth:`date.isoformat` ou :meth:`datetime.isoformat`.

source: Return a :class:`.datetime` corresponding to the ISO calendar date specified by year, week and day. The non-date components of the datetime are populated with their normal default values. This is the inverse of the function :meth:`datetime.isocalendar`.
pt_br: Retorna um :class:`.datetime` correspondente à data no calendário ISO especificada por *year*, *week* e *day*. Os componentes não-data do datetime são preenchidos normalmente com seus valores padrões. Isso é o inverso da função :meth:`datetime.isocalendar`.

source: Return a :class:`.datetime` corresponding to *date_string*, parsed according to *format*.
pt_br: Retorna um :class:`.datetime` correspondente ao *date_string*, analisado de acordo com *format*.

source: If *format* does not contain microseconds or time zone information, this is equivalent to::
pt_br: Se *format* não contiver microssegundos ou informações de fuso horário, isso é equivalente a::

source: :exc:`ValueError` is raised if the date_string and format can't be parsed by :func:`time.strptime` or if it returns a value which isn't a time tuple. See also :ref:`strftime-strptime-behavior` and :meth:`datetime.fromisoformat`.
pt_br: :exc:`ValueError` é levantado se o date_string e o format não puderem ser interpretados por :func:`time.strptime` ou se ele retorna um valor o qual não é uma tupla temporal. Veja também :ref:`strftime-strptime-behavior` e :meth:`datetime.fromisoformat`.

source: If *format* specifies a day of month without a year a :exc:`DeprecationWarning` is now emitted. This is to avoid a quadrennial leap year bug in code seeking to parse only a month and day as the default year used in absence of one in the format is not a leap year. Such *format* values may raise an error as of Python 3.15. The workaround is to always include a year in your *format*. If parsing *date_string* values that do not have a year, explicitly add a year that is a leap year before parsing:
pt_br: Se *format* especificar um dia do mês sem um ano, um :exc:`DeprecationWarning` agora é emitido. Isso é para evitar um bug de ano bissexto quadrienal no código que busca analisar apenas um mês e dia, pois o ano padrão usado na ausência de um no formato não é um ano bissexto. Esses valores de *format* podem gerar um erro a partir do Python 3.15. A solução alternativa é sempre incluir um ano em seu *format*. Se estiver analisando valores de *date_string* que não têm um ano, adicione explicitamente um ano que seja um ano bissexto antes da análise:

source: The earliest representable :class:`.datetime`, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.
pt_br: O primeiro :class:`.datetime` representável, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.

source: The latest representable :class:`.datetime`, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.
pt_br: O último :class:`.datetime` representável, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.

source: The smallest possible difference between non-equal :class:`.datetime` objects, ``timedelta(microseconds=1)``.
pt_br: A menor diferença possível entre objetos :class:`.datetime` diferentes, ``timedelta(microseconds=1)``.

source: In ``range(24)``.
pt_br: No intervalo ``range(24)``.

source: In ``range(60)``.
pt_br: No intervalo ``range(60)``.

source: In ``range(1000000)``.
pt_br: No intervalo ``range(1000000)``.

source: The object passed as the *tzinfo* argument to the :class:`.datetime` constructor, or ``None`` if none was passed.
pt_br: O objeto passado como o argumento *tzinfo* do construtor :class:`.datetime`, ou ``None`` se nada foi passado.

source: In ``[0, 1]``. Used to disambiguate wall times during a repeated interval. (A repeated interval occurs when clocks are rolled back at the end of daylight saving time or when the UTC offset for the current zone is decreased for political reasons.) The values 0 and 1 represent, respectively, the earlier and later of the two moments with the same wall time representation.
pt_br: Entre ``[0, 1]``. Usado para desambiguar tempos reais durante um intervalo repetido. (Um intervalo repetido ocorre quando relógios são atrasados ao final do horário de verão ou quando a diferença UTC para o fuso horário atual é reduzida por razões políticas.) Os valores 0 e 1 representam, respectivamente, o primeiro e o segundo dos dois momentos com a mesma representação de tempo real.

source: ``datetime2`` is a duration of ``timedelta`` removed from ``datetime1``, moving forward in time if ``timedelta.days > 0``, or backward if ``timedelta.days < 0``. The result has the same :attr:`~.datetime.tzinfo` attribute as the input datetime, and ``datetime2 - datetime1 == timedelta`` after. :exc:`OverflowError` is raised if ``datetime2.year`` would be smaller than :const:`MINYEAR` or larger than :const:`MAXYEAR`. Note that no time zone adjustments are done even if the input is an aware object.
pt_br: ``datetime2`` representa a duração de ``timedelta`` removido de ``datetime1``, movendo o tempo para frente se ``timedelta.days > 0``, ou para trás se ``timedelta.days < 0``. O resultado tem o mesmo atributo :attr:`~.datetime.tzinfo` que o datetime de entrada, e ``datetime2 - datetime1 == timedelta`` após. :exc:`OverflowError` é levantada se ``datetime2.year`` fosse menor que :const:`MINYEAR` ou maior que :const:`MAXYEAR`. Perceba que nenhum ajuste no fuso horário é feito mesmo se a entrada é um objeto consciente disso.

source: Computes the ``datetime2`` such that ``datetime2 + timedelta == datetime1``. As for addition, the result has the same :attr:`~.datetime.tzinfo` attribute as the input datetime, and no time zone adjustments are done even if the input is aware.
pt_br: Computa o ``datetime2`` tal que ``datetime2 + timedelta == datetime1``. Assim como para adição, o resultado tem o mesmo atributo :attr:`~.datetime.tzinfo` que datetime de entrada, e nenhum ajuste de fuso horário é feito mesmo que a entrada seja consciente disso.

source: Subtraction of a :class:`.datetime` from a :class:`.datetime` is defined only if both operands are naive, or if both are aware. If one is aware and the other is naive, :exc:`TypeError` is raised.
pt_br: Subtração de um :class:`.datetime` de outro :class:`.datetime` é definido apenas se ambos os operandos são ingênuos, ou se ambos são conscientes. Se um deles é consciente e o outro é ingênuo, :exc:`TypeError` é levantado.

source: If both are naive, or both are aware and have the same :attr:`~.datetime.tzinfo` attribute, the :attr:`~.datetime.tzinfo` attributes are ignored, and the result is a :class:`timedelta` object ``t`` such that ``datetime2 + t == datetime1``. No time zone adjustments are done in this case.
pt_br: Se ambos são ingênuos, ou ambos são conscientes e tiverem o mesmo atributo :attr:`~.datetime.tzinfo`, os atributos :attr:`~.datetime.tzinfo` são ignorados, e o resultado é um objeto ``t`` do tipo :class:`timedelta`, tal que ``datetime2 + t == datetime1``. Nenhum ajuste de fuso horário é feito neste caso.

source: If both are aware and have different :attr:`~.datetime.tzinfo` attributes, ``a-b`` acts as if ``a`` and ``b`` were first converted to naive UTC datetimes. The result is ``(a.replace(tzinfo=None) - a.utcoffset()) - (b.replace(tzinfo=None) - b.utcoffset())`` except that the implementation never overflows.
pt_br: Se ambas são conscientes e têm atributos :attr:`~.datetime.tzinfo` diferentes, ``a-b`` age como se ``a`` e ``b`` tivessem sido primeiro convertidos para datetimes ingênuas em UTC. O resultado é ``(a.replace(tzinfo=None) - a.utcoffset()) - (b.replace(tzinfo=None) - b.utcoffset())`` exceto que a implementação nunca estoura.

source: :class:`.datetime` objects are equal if they represent the same date and time, taking into account the time zone.
pt_br: Objetos :class:`.datetime` são iguais se representarem a mesma data e hora, levando em consideração o fuso horário.

source: Naive and aware :class:`!datetime` objects are never equal.
pt_br: Objetos :class:`!datetime` ingênuos e conscientes nunca são iguais.

source: If both comparands are aware, and have the same :attr:`!tzinfo` attribute, the :attr:`!tzinfo` and :attr:`~.datetime.fold` attributes are ignored and the base datetimes are compared. If both comparands are aware and have different :attr:`~.datetime.tzinfo` attributes, the comparison acts as comparands were first converted to UTC datetimes except that the implementation never overflows. :class:`!datetime` instances in a repeated interval are never equal to :class:`!datetime` instances in other time zone.
pt_br: Se ambos os comparandos forem conscientes e tiverem o mesmo atributo :attr:`!tzinfo`, os atributos :attr:`!tzinfo` e :attr:`~.datetime.fold` serão ignorados e os datetimes base serão comparados. Se ambos os comparandos forem conscientes e tiverem atributos :attr:`~.datetime.tzinfo` diferentes, a comparação atua como se os comparandos fossem primeiro convertidos para datetimes UTC, exceto que a implementação nunca estoura. Instâncias :class:`!datetime` em um intervalo repetido nunca são iguais a instâncias :class:`!datetime` em outro fuso horário.

source: *datetime1* is considered less than *datetime2* when *datetime1* precedes *datetime2* in time, taking into account the time zone.
pt_br: *datetime1* é considerado menor que *datetime2* quando *datetime1* precede *datetime2* no tempo. levando em consideração o fuso horário.

source: Order comparison between naive and aware :class:`.datetime` objects raises :exc:`TypeError`.
pt_br: A comparação de ordens entre objetos :class:`.datetime` ingênuos e conscientes levanta :exc:`TypeError`.

source: If both comparands are aware, and have the same :attr:`!tzinfo` attribute, the :attr:`!tzinfo` and :attr:`~.datetime.fold` attributes are ignored and the base datetimes are compared. If both comparands are aware and have different :attr:`~.datetime.tzinfo` attributes, the comparison acts as comparands were first converted to UTC datetimes except that the implementation never overflows.
pt_br: Se ambos os comparandos forem conscientes e tiverem o mesmo atributo :attr:`!tzinfo`, os atributos :attr:`!tzinfo` e :attr:`~.datetime.fold` serão ignorados e os datetimes base serão comparados. Se ambos os comparandos forem conscientes e tiverem atributos :attr:`~.datetime.tzinfo` diferentes, a comparação atua como se os comparandos fossem primeiro convertidos para datetimes UTC, exceto que a implementação nunca estoura.

source: Equality comparisons between aware and naive :class:`.datetime` instances don't raise :exc:`TypeError`.
pt_br: Comparações de igualdade entre instâncias de :class:`.datetime` conscientes e nativas não levantam :exc:`TypeError`.

source: Return :class:`date` object with same year, month and day.
pt_br: Retorna um objeto :class:`date` com o mesmo ano, mês e dia.

source: Return :class:`.time` object with same hour, minute, second, microsecond and fold. :attr:`.tzinfo` is ``None``. See also method :meth:`timetz`.
pt_br: Retorna um objeto :class:`.time` com a mesma hora, minuto, segundo, microssegundo e fold. O atributo :attr:`.tzinfo` é ``None``. Veja também o método :meth:`.timetz`.

source: The fold value is copied to the returned :class:`.time` object.
pt_br: O valor fold é copiado para o objeto :class:`.time` retornado.

source: Return :class:`.time` object with same hour, minute, second, microsecond, fold, and tzinfo attributes. See also method :meth:`time`.
pt_br: Retorna um objeto :class:`.time` com os mesmos atributos de hora, minuto, segundo, microssegundo, fold e tzinfo. Veja também o método :meth:`time`.

source: Return a new :class:`datetime` object with the same attributes, but with specified parameters updated. Note that ``tzinfo=None`` can be specified to create a naive datetime from an aware datetime with no conversion of date and time data.
pt_br: Retorna um novo objeto :class:`datetime` com os mesmos atributos, mas com os parâmetros especificados atualizados. Perceba que ``tzinfo=None`` pode ser especificado para criar um datetime ingênuo a partir de um datetime consciente, sem conversão de dados da data ou hora.

source: :class:`.datetime` objects are also supported by generic function :func:`copy.replace`.
pt_br: Objetos :class:`.datetime` também são suportados pela função genérica :func:`copy.replace`.

source: Return a :class:`.datetime` object with new :attr:`.tzinfo` attribute *tz*, adjusting the date and time data so the result is the same UTC time as *self*, but in *tz*'s local time.
pt_br: Retorna um objeto :class:`.datetime` com novo atributo :attr:`.tzinfo` definido por *tz*, ajustando a data e hora de forma que o resultado seja o mesmo horário UTC que *self*, mas na hora local de *tz*.

source: If provided, *tz* must be an instance of a :class:`tzinfo` subclass, and its :meth:`utcoffset` and :meth:`dst` methods must not return ``None``. If *self* is naive, it is presumed to represent time in the system time zone.
pt_br: Se fornecido, *tz* deve ser uma instância de uma subclasse :class:`tzinfo`, e seus métodos :meth:`utcoffset` e :meth:`dst` não devem retornar ``None``. Se *self* for ingênuo, é presumido que ele representa o tempo no fuso horário do sistema.

source: If called without arguments (or with ``tz=None``) the system local time zone is assumed for the target time zone. The ``.tzinfo`` attribute of the converted datetime instance will be set to an instance of :class:`timezone` with the zone name and offset obtained from the OS.
pt_br: Se for chamado sem argumentos (ou com ``tz=None``) o fuso horário do sistema local é presumido como o fuso horário desejado. O atributo ``.tzinfo`` da instância datetime convertida será definido para uma instância de :class:`timezone` com o nome da zona e um deslocamento obtido a partir do sistema operacional.
