Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: See R. H. van Gent's `guide to the mathematics of the ISO 8601 calendar <https://web.archive.org/web/20220531051136/https://webspace.science.uu.nl/~gent0113/calendar/isocalendar.htm>`_ for a good explanation.
pt_br: Veja `O guia para a matemática de calendário ISO 8601 <https://web.archive.org/web/20220531051136/https://webspace.science.uu.nl/~gent0113/calendar/isocalendar.htm>`_ de R. H. van Gent para uma boa explicação.

source: Passing ``datetime.strptime('Feb 29', '%b %d')`` will fail since 1900 is not a leap year.
pt_br: Passar ``datetime.strptime('Feb 29', '%b %d')`` irá falhar porque 1900 não é um ano bissexto.

source: % (percent)
pt_br: % (porcentagem)

source: datetime format
pt_br: datetime, formato
