Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: Note that for very large time intervals (greater than 270 years on most platforms) this method will lose microsecond accuracy.
pt_br: Observe que, em intervalos de tempo muito grandes (mais de 270 anos na maioria das plataformas), esse método perde a precisão de microssegundos.

source: Examples of usage: :class:`timedelta`
pt_br: Exemplos de uso: :class:`.timedelta`

source: An additional example of normalization::
pt_br: Um exemplo adicional de normalização::

source: >>> # Components of another_year add up to exactly 365 days >>> from datetime import timedelta >>> year = timedelta(days=365) >>> another_year = timedelta(weeks=40, days=84, hours=23, ... minutes=50, seconds=600) >>> year == another_year True >>> year.total_seconds() 31536000.0
pt_br: >>> # Os componentes de outro_ano somam exatamente 365 dias >>> from datetime import timedelta >>> year = timedelta(days=365) >>> outro_ano = timedelta(weeks=40, days=84, hours=23, ... minutes=50, seconds=600) >>> year == outro_ano True >>> year.total_seconds() 31536000.0

source: Examples of :class:`timedelta` arithmetic::
pt_br: Exemplos de aritmética com :class:`timedelta`::

source: >>> from datetime import timedelta >>> year = timedelta(days=365) >>> ten_years = 10 * year >>> ten_years datetime.timedelta(days=3650) >>> ten_years.days // 365 10 >>> nine_years = ten_years - year >>> nine_years datetime.timedelta(days=3285) >>> three_years = nine_years // 3 >>> three_years, three_years.days // 365 (datetime.timedelta(days=1095), 3)
pt_br: >>> from datetime import timedelta >>> ano = timedelta(days=365) >>> dez_anos = 10 * ano >>> dez_anos datetime.timedelta(days=3650) >>> dez_anos.days // 365 10 >>> nove_anos = dez_anos - ano >>> nove_anos datetime.timedelta(days=3285) >>> três_anos = nove_anos // 3 >>> três_anos, três_anos.days // 365 (datetime.timedelta(days=1095), 3)

source: :class:`date` Objects
pt_br: Objetos :class:`date`

source: A :class:`date` object represents a date (year, month and day) in an idealized calendar, the current Gregorian calendar indefinitely extended in both directions.
pt_br: O objeto :class:`date` representa uma data (ano, mês e dia) em um calendário idealizado, o atual calendário Gregoriano estendido indefinidamente em ambas as direções.

source: January 1 of year 1 is called day number 1, January 2 of year 1 is called day number 2, and so on. [#]_
pt_br: 1º de janeiro do ano 1 é chamado de dia número 1, 2º de janeiro do ano 1 é chamado de dia número 2, e assim por diante. [#]_

source: All arguments are required. Arguments must be integers, in the following ranges:
pt_br: Todos os argumentos são obrigatórios. Os argumentos devem ser números inteiros, nos seguintes intervalos:

source: ``1 <= day <= number of days in the given month and year``
pt_br: ``1 <= day <= número de dias no mês e ano fornecidos``

source: If an argument outside those ranges is given, :exc:`ValueError` is raised.
pt_br: Se um argumento fora desses intervalos for fornecido, a exceção :exc:`ValueError` é levantada.

source: Other constructors, all class methods:
pt_br: Outros construtores, todos os métodos de classe.

source: Return the current local date.
pt_br: Retorna a data local atual.

source: This is equivalent to ``date.fromtimestamp(time.time())``.
pt_br: Isso é equivalente a ``date.fromtimestamp(time.time())``.

source: Return the local date corresponding to the POSIX timestamp, such as is returned by :func:`time.time`.
pt_br: Retorna a data local correspondente ao registro de data e hora do POSIX, como é retornado por :func:`time.time`.

source: This may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function, and :exc:`OSError` on :c:func:`localtime` failure. It's common for this to be restricted to years from 1970 through 2038. Note that on non-POSIX systems that include leap seconds in their notion of a timestamp, leap seconds are ignored by :meth:`fromtimestamp`.
pt_br: Isso pode levantar :exc:`OverflowError`, se o registro de data e hora estiver fora do intervalo de valores suportados pela função C :c:func:`localtime` da plataforma, e em caso de falha :exc:`OSError` em :c:func:`localtime`. É comum que isso seja restrito a anos de 1970 a 2038. Observe que, em sistemas não POSIX que incluem segundos bissextos na sua notação de registro de data e hora, os segundos bissextos são ignorados por :meth:`fromtimestamp`.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` failure.
pt_br: Levanta :exc:`OverflowError` ao invés de :exc:`ValueError` se o registro de data e hora estiver fora do intervalo de valores suportados pela plataforma C :c:func:`localtime` função. Levanta :exc:`OSError` ao invés de :exc:`ValueError` em falha de :c:func:`localtime` .

source: Return the date corresponding to the proleptic Gregorian ordinal, where January 1 of year 1 has ordinal 1.
pt_br: Retorna a data correspondente ao ordinal proléptico gregoriano, considerando que 1º de janeiro do ano 1 tem o ordinal 1.

source: :exc:`ValueError` is raised unless ``1 <= ordinal <= date.max.toordinal()``. For any date ``d``, ``date.fromordinal(d.toordinal()) == d``.
pt_br: :exc:`ValueError` é levantado a menos que ``1 <= ordinal <= date.max.toordinal()``. Para qualquer data ``d``, ``date.fromordinal(d.toordinal()) == d``.

source: Return a :class:`date` corresponding to a *date_string* given in any valid ISO 8601 format, with the following exceptions:
pt_br: Retorna um :class:`date` correspondendo a *date_string* dada em qualquer formato válido de ISO 8601, com as seguintes exceções:

source: Reduced precision dates are not currently supported (``YYYY-MM``, ``YYYY``).
pt_br: Datas de precisão reduzida não são atualmente suportadas (``YYYY-MM``, ``YYYY``).

source: Extended date representations are not currently supported (``±YYYYYY-MM-DD``).
pt_br: Representações de data estendidas não são atualmente suportadas (``±YYYYYY-MM-DD``).

source: Ordinal dates are not currently supported (``YYYY-OOO``).
pt_br: Atualmente, as datas ordinais não são suportadas (``YYYY-OOO``).

source: Examples::
pt_br: Exemplos::

source: Previously, this method only supported the format ``YYYY-MM-DD``.
pt_br: Anteriormente, este método tinha suporte apenas ao formato ``YYYY-MM-DD``.

source: Return a :class:`date` corresponding to the ISO calendar date specified by year, week and day. This is the inverse of the function :meth:`date.isocalendar`.
pt_br: Retorna um objeto :class:`date` correspondendo a data em calendário ISO especificada por year, week e day. Esta é o inverso da função :meth:`date.isocalendar`.

source: Return a :class:`.date` corresponding to *date_string*, parsed according to *format*. This is equivalent to::
pt_br: Retorna um :class:`.date` correspondente ao *date_string*, analisado de acordo com *format*. Isso equivale a::

source: :exc:`ValueError` is raised if the date_string and format can't be parsed by :func:`time.strptime` or if it returns a value which isn't a time tuple. See also :ref:`strftime-strptime-behavior` and :meth:`date.fromisoformat`.
pt_br: :exc:`ValueError` é levantado se o date_string e o format não puderem ser interpretados por :func:`time.strptime` ou se ele retorna um valor o qual não é uma tupla temporal. Veja também :ref:`strftime-strptime-behavior` e :meth:`date.fromisoformat`.

source: If *format* specifies a day of month without a year a :exc:`DeprecationWarning` is emitted. This is to avoid a quadrennial leap year bug in code seeking to parse only a month and day as the default year used in absence of one in the format is not a leap year. Such *format* values may raise an error as of Python 3.15. The workaround is to always include a year in your *format*. If parsing *date_string* values that do not have a year, explicitly add a year that is a leap year before parsing:
pt_br: Se *format* especificar um dia do mês sem um ano, um :exc:`DeprecationWarning` é emitido. Isso é para evitar um bug de ano bissexto quadrienal no código que busca analisar apenas um mês e dia, pois o ano padrão usado na ausência de um no formato não é um ano bissexto. Esses valores de *format* podem gerar um erro a partir do Python 3.15. A solução alternativa é sempre incluir um ano em seu *format*. Se estiver analisando valores de *date_string* que não têm um ano, adicione explicitamente um ano que seja um ano bissexto antes da análise:

source: >>> from datetime import date >>> date_string = "02/29" >>> when = date.strptime(f"{date_string};1984", "%m/%d;%Y") # Avoids leap year bug. >>> when.strftime("%B %d") 'February 29'
pt_br: >>> from datetime import date >>> date_string = "02/29" >>> when = date.strptime(f"{date_string};1984", "%m/%d;%Y") # Evita bug do ano bissexto. >>> when.strftime("%B %d") 'February 29'

source: The earliest representable date, ``date(MINYEAR, 1, 1)``.
pt_br: A data representável mais antiga, ``date(MINYEAR, 1, 1)``.

source: The latest representable date, ``date(MAXYEAR, 12, 31)``.
pt_br: A data representável mais tardia, ``date(MAXYEAR, 12, 31)``.

source: The smallest possible difference between non-equal date objects, ``timedelta(days=1)``.
pt_br: A menor diferença possível entre objetos date não iguais, ``timedelta(days=1)``.

source: Between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
pt_br: Entre :const:`MINYEAR` e :const:`MAXYEAR` incluindo extremos.

source: Between 1 and 12 inclusive.
pt_br: Entre 1 e 12 incluindo extremos.

source: Between 1 and the number of days in the given month of the given year.
pt_br: Entre 1 e o número de dias no mês especificado do ano especificado.

source: ``date2`` will be ``timedelta.days`` days after ``date1``. (1)
pt_br: ``date2`` terá ``timedelta.days`` dias após ``date1``. (1)

source: Computes ``date2`` such that ``date2 + timedelta == date1``. (2)
pt_br: Calcula ``date2`` de modo que ``date2 + timedelta == date1``. (2)

source: Equality comparison. (4)
pt_br: Comparação de igualdade. (4)

source: Order comparison. (5)
pt_br: Comparação de ordem. (5)

source: *date2* is moved forward in time if ``timedelta.days > 0``, or backward if ``timedelta.days < 0``. Afterward ``date2 - date1 == timedelta.days``. ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored. :exc:`OverflowError` is raised if ``date2.year`` would be smaller than :const:`MINYEAR` or larger than :const:`MAXYEAR`.
pt_br: *date2* é movida para frente no tempo se ``timedelta.days > 0``, ou para trás se ``timedelta.days < 0``. Posteriormente ``date2 - date1 == timedelta.days``. ``timedelta.seconds`` e ``timedelta.microseconds`` são ignorados. A exceção :exc:`OverflowError` é levantada se ``date2.year`` for menor que :const:`MINYEAR` ou maior que :const:`MAXYEAR`.

source: ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored.
pt_br: ``timedelta.seconds`` e ``timedelta.microseconds`` são ignoradas.

source: This is exact, and cannot overflow. ``timedelta.seconds`` and ``timedelta.microseconds`` are 0, and ``date2 + timedelta == date1`` after.
pt_br: Isso é exato e não pode estourar. ``timedelta.seconds`` e ``timedelta.microseconds`` são 0, e ``date2 + timedelta == date1`` depois.

source: :class:`date` objects are equal if they represent the same date.
pt_br: Objetos :class:`date` são iguais se representam a mesma data.

source: :class:`!date` objects that are not also :class:`.datetime` instances are never equal to :class:`!datetime` objects, even if they represent the same date.
pt_br: Objetos :class:`!date` que não são também instâncias :class:`.datetime` nunca são iguais a objetos :class:`!datetime`, mesmo que representem a mesma data.

source: *date1* is considered less than *date2* when *date1* precedes *date2* in time. In other words, ``date1 < date2`` if and only if ``date1.toordinal() < date2.toordinal()``.
pt_br: *date1* é considerado menor que *date2* quando *date1* preceder *date2* no tempo. Em outras palavras, ``date1 < date2`` se e somente se ``date1.toordinal() < date2.toordinal()``.

source: Order comparison between a :class:`!date` object that is not also a :class:`.datetime` instance and a :class:`!datetime` object raises :exc:`TypeError`.
pt_br: A comparação de ordem entre um objeto :class:`!date` que não é também uma instância :class:`.datetime` e um objeto :class:`!datetime` levanta :exc:`TypeError`.

source: Comparison between :class:`.datetime` object and an instance of the :class:`date` subclass that is not a :class:`!datetime` subclass no longer converts the latter to :class:`!date`, ignoring the time part and the time zone. The default behavior can be changed by overriding the special comparison methods in subclasses.
pt_br: A comparação entre o objeto :class:`.datetime` e uma instância da subclasse :class:`date` que não é uma subclasse :class:`!datetime` não converte mais a última para :class:`!date`, ignorando o parte horária e o fuso horário. O comportamento padrão pode ser alterado substituindo os métodos especiais de comparação nas subclasses.

source: In Boolean contexts, all :class:`date` objects are considered to be true.
pt_br: Em contextos booleanos, todo objeto :class:`date` é considerado verdadeiro.

source: Return a new :class:`date` object with the same values, but with specified parameters updated.
pt_br: Retorna um novo objeto :class:`date` com os mesmos valores, mas com os parâmetros especificados atualizados.

source: Example::
pt_br: Exemplo::

source: The generic function :func:`copy.replace` also supports :class:`date` objects.
pt_br: A função genérica :func:`copy.replace` também oferece suporte a objetos :class:`date`.

source: Return a :class:`time.struct_time` such as returned by :func:`time.localtime`.
pt_br: Retorna uma :class:`time.struct_time` tal como retornado por :func:`time.localtime`.

source: The hours, minutes and seconds are 0, and the DST flag is -1.
pt_br: As horas, minutos e segundos são 0, e o sinalizador de horário de verão é -1.

source: ``d.timetuple()`` is equivalent to::
pt_br: ``d.timetuple()`` é equivalente a::

source: where ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` is the day number within the current year starting with 1 for January 1st.
pt_br: sendo ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` o número do dia no ano atual, começando com 1 para 1º de janeiro.

source: Return the proleptic Gregorian ordinal of the date, where January 1 of year 1 has ordinal 1. For any :class:`date` object ``d``, ``date.fromordinal(d.toordinal()) == d``.
pt_br: Retorna o ordinal proléptico gregoriano da data, considerando que 1º de janeiro do ano 1 tem o ordinal 1. Para qualquer objeto :class:`date` ``d``, ``date.fromordinal(d.toordinal()) == d``.

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. For example, ``date(2002, 12, 4).weekday() == 2``, a Wednesday. See also :meth:`isoweekday`.
pt_br: Retorna o dia da semana como um inteiro, onde Segunda é 0 e Domingo é 6. Por exemplo, ``date(2002, 12, 4).weekday() == 2``, uma Quarta-feira. Veja também :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. For example, ``date(2002, 12, 4).isoweekday() == 3``, a Wednesday. See also :meth:`weekday`, :meth:`isocalendar`.
pt_br: Retorna o dia da semana como um inteiro, onde Segunda é 1 e Domingo é 7. Por exemplo, ``date(2002, 12, 4).isoweekday() == 3``, uma Quarta-feira. Veja também :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` object with three components: ``year``, ``week`` and ``weekday``.
pt_br: Retorna um objeto :term:`tupla nomeada <named tuple>` com três componentes: ``year``, ``week`` e ``weekday``.

source: The ISO calendar is a widely used variant of the Gregorian calendar. [#]_
pt_br: O calendário ISO é uma variação amplamente usada do calendário gregoriano. [#]_

source: The ISO year consists of 52 or 53 full weeks, and where a week starts on a Monday and ends on a Sunday. The first week of an ISO year is the first (Gregorian) calendar week of a year containing a Thursday. This is called week number 1, and the ISO year of that Thursday is the same as its Gregorian year.
pt_br: O ano ISO consiste de 52 ou 53 semanas completas, e onde uma semana começa na segunda-feira e termina no domingo. A primeira semana de um ano ISO é a primeira semana no calendário (Gregoriano) de um ano contendo uma quinta-feira. Isso é chamado de semana número 1, e o ano ISO dessa quinta-feira é o mesmo que o seu ano Gregoriano.

source: For example, 2004 begins on a Thursday, so the first week of ISO year 2004 begins on Monday, 29 Dec 2003 and ends on Sunday, 4 Jan 2004::
pt_br: Por exemplo, 2004 começa em uma quinta-feira, então a primeira semana do ano ISO 2004 começa na segunda-feira, 29 de dezembro de 2003, e termina no domingo, 4 de janeiro de 2004::

source: Result changed from a tuple to a :term:`named tuple`.
pt_br: Resultado alterado de uma tupla para uma :term:`tupla nomeada <named tuple>`.

source: Return a string representing the date in ISO 8601 format, ``YYYY-MM-DD``::
pt_br: Retorna uma string representando a data no formato ISO 8601, ``YYYY-MM-DD``::

source: For a date ``d``, ``str(d)`` is equivalent to ``d.isoformat()``.
pt_br: Para um data ``d``, ``str(d)`` é equivalente a ``d.isoformat()``.

source: Return a string representing the date::
pt_br: Retorna uma string representando a data::

source: ``d.ctime()`` is equivalent to::
pt_br: ``d.ctime()`` é equivalente a::

source: on platforms where the native C :c:func:`ctime` function (which :func:`time.ctime` invokes, but which :meth:`date.ctime` does not invoke) conforms to the C standard.
pt_br: em plataformas em que a função C nativa :c:func:`ctime` (que é invocada pela função :func:`time.ctime`, mas não pelo método :meth:`.date.ctime`) se conforma com o padrão C.

source: Return a string representing the date, controlled by an explicit format string. Format codes referring to hours, minutes or seconds will see 0 values. See also :ref:`strftime-strptime-behavior` and :meth:`date.isoformat`.
pt_br: Retorna uma string representando a data, controlado por uma string explícita de formatação. Códigos de formatação referenciando horas, minutos ou segundos irão ver valores 0. Veja também :ref:`strftime-strptime-behavior` e :meth:`date.isoformat`.

source: Same as :meth:`.date.strftime`. This makes it possible to specify a format string for a :class:`.date` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. See also :ref:`strftime-strptime-behavior` and :meth:`date.isoformat`.
pt_br: O mesmo que :meth:`.date.strftime`. Isso torna possível especificar uma string de formatação para o objeto :class:`.date` em :ref:`literais de string formatados <f-strings>` e ao usar :meth:`str.format`. Veja também :ref:`strftime-strptime-behavior` e :meth:`date.isoformat`.

source: Examples of Usage: :class:`date`
pt_br: Exemplos de uso: :class:`.date`

source: Example of counting days to an event::
pt_br: Exemplo de contagem de dias para um evento::

source: >>> import time >>> from datetime import date >>> today = date.today() >>> today datetime.date(2007, 12, 5) >>> today == date.fromtimestamp(time.time()) True >>> my_birthday = date(today.year, 6, 24) >>> if my_birthday < today: ... my_birthday = my_birthday.replace(year=today.year + 1) ... >>> my_birthday datetime.date(2008, 6, 24) >>> time_to_birthday = abs(my_birthday - today) >>> time_to_birthday.days 202
pt_br: >>> import time >>> from datetime import date >>> hoje = date.today() >>> hoje datetime.date(2007, 12, 5) >>> hoje == date.fromtimestamp(time.time()) True >>> meu_aniversário = date(hoje.year, 6, 24) >>> if meu_aniversário < hoje: ... meu_aniversário = meu_aniversário.replace(year=hoje.year + 1) ... >>> meu_aniversário datetime.date(2008, 6, 24) >>> tempo_até_aniversário = abs(meu_aniversário - hoje) >>> tempo_até_aniversário.days 202

source: More examples of working with :class:`date`:
pt_br: Mais exemplos de uso da classe :class:`.date`:

source: :class:`.datetime` Objects
pt_br: Objetos :class:`.datetime`

source: A :class:`.datetime` object is a single object containing all the information from a :class:`date` object and a :class:`.time` object.
pt_br: Um objeto :class:`.datetime` é um único objeto contendo todas as informações de um objeto :class:`.date` e um objeto :class:`.time`.

source: Like a :class:`date` object, :class:`.datetime` assumes the current Gregorian calendar extended in both directions; like a :class:`.time` object, :class:`.datetime` assumes there are exactly 3600\*24 seconds in every day.
pt_br: Assim como um objeto :class:`date`, :class:`.datetime` presume o atual calendário Gregoriano estendido em ambas as direções; assim como um objeto :class:`.time`, :class:`.datetime` presume que existem exatamente 3600\*24 segundos em cada dia.

source: Constructor:
pt_br: Construtor:

source: The *year*, *month* and *day* arguments are required. *tzinfo* may be ``None``, or an instance of a :class:`tzinfo` subclass. The remaining arguments must be integers in the following ranges:
pt_br: Os argumentos *year*, *month* e *day* são obrigatórios. *tzinfo* pode ser ``None``, ou uma instância de subclasse de :class:`tzinfo`. Os argumentos remanescentes devem ser inteiros nos seguintes intervalos:

source: ``1 <= day <= number of days in the given month and year``,
pt_br: ``1 <= day <= número de dias no mês e ano fornecidos``,

source: Added the *fold* parameter.
pt_br: Adicionado o parâmetro *fold*.

source: Return the current local date and time, with :attr:`.tzinfo` ``None``.
pt_br: Retorna a data e hora local atual, com o atributo :attr:`.tzinfo` definido para ``None``.

source: Equivalent to::
pt_br: Equivalente a::

source: See also :meth:`now`, :meth:`fromtimestamp`.
pt_br: Veja também :meth:`now`, :meth:`fromtimestamp`.

source: This method is functionally equivalent to :meth:`now`, but without a ``tz`` parameter.
pt_br: Este método é funcionalmente equivalente a :meth:`now`, mas sem um parâmetro ``tz``.

source: Return the current local date and time.
pt_br: Retorna a data e hora local atual.

source: If optional argument *tz* is ``None`` or not specified, this is like :meth:`today`, but, if possible, supplies more precision than can be gotten from going through a :func:`time.time` timestamp (for example, this may be possible on platforms supplying the C :c:func:`gettimeofday` function).
pt_br: Se o argumento opcional *tz* é ``None`` ou não especificado, isto é o mesmo que :meth:`today`, mas, se possível, fornece mais precisão do que pode ser obtido indo por um registro de data e hora da função :func:`time.time` (por exemplo, isto pode ser possível em plataformas que fornecem a função C :c:func:`gettimeofday`).

source: If *tz* is not ``None``, it must be an instance of a :class:`tzinfo` subclass, and the current date and time are converted to *tz*’s time zone.
pt_br: Se *tz* não for ``None``, ele deve ser uma instância de uma subclasse de :class:`tzinfo`, e a data e hora local atual são convertidas para o fuso horário de *tz*.

source: This function is preferred over :meth:`today` and :meth:`utcnow`.
pt_br: Esta função é preferida ao invés de :meth:`today` e :meth:`utcnow`.

source: Subsequent calls to :meth:`!datetime.now` may return the same instant depending on the precision of the underlying clock.
pt_br: Chamadas subsequentes para :meth:`!datetime.now` podem retornar o mesmo instante, dependendo da precisão do relógio subjacente.

source: Return the current UTC date and time, with :attr:`.tzinfo` ``None``.
pt_br: Retorna a data e hora atual em UTC, com :attr:`.tzinfo` como ``None``.
