Repository: python/python-docs-pt-br
Catalog: library/datetime.po
Languages: pt_br

source: A :class:`.time` object represents a (local) time of day, independent of any particular day, and subject to adjustment via a :class:`tzinfo` object.
pt_br: Um objeto :class:`.time` representa a hora (local) do dia, independente de qualquer dia em particular, e sujeito a ajustes através de um objeto :class:`tzinfo`.

source: All arguments are optional. *tzinfo* may be ``None``, or an instance of a :class:`tzinfo` subclass. The remaining arguments must be integers in the following ranges:
pt_br: Todos os argumentos são opcionais. *tzinfo* pode ser ``None``, ou uma instância de uma subclasse de :class:`tzinfo`. Os argumentos remanescentes devem ser inteiros nos seguintes intervalos:

source: If an argument outside those ranges is given, :exc:`ValueError` is raised. All default to 0 except *tzinfo*, which defaults to ``None``.
pt_br: Se um argumento fora desses intervalos é fornecido, :exc:`ValueError` é levantada. Todos tem como padrão o valor 0 exceto *tzinfo*, o qual tem o valor padrão ``None``.

source: The earliest representable :class:`.time`, ``time(0, 0, 0, 0)``.
pt_br: O :class:`.time` mais cedo que pode ser representado, ``time(0, 0, 0, 0)``.

source: The latest representable :class:`.time`, ``time(23, 59, 59, 999999)``.
pt_br: O :class:`.time` mais tardio que pode ser representado, ``time(23, 59, 59, 999999)``.

source: The smallest possible difference between non-equal :class:`.time` objects, ``timedelta(microseconds=1)``, although note that arithmetic on :class:`.time` objects is not supported.
pt_br: A menor diferença possível entre objetos :class:`.time` diferentes, ``timedelta(microseconds=1)``, embora perceba que aritmética sobre objetos :class:`.time` não é suportada.

source: The object passed as the tzinfo argument to the :class:`.time` constructor, or ``None`` if none was passed.
pt_br: O objeto passado como argumento tzinfo para o construtor da classe :class:`.time`, ou ``None`` se nada foi passado.

source: :class:`.time` objects support equality and order comparisons, where ``a`` is considered less than ``b`` when ``a`` precedes ``b`` in time.
pt_br: Objetos :class:`.time` oferecem suporte para comparações de igualdade e ordem, onde ``a`` é considerado menor que ``b`` quando ``a`` precede ``b`` no tempo.

source: Naive and aware :class:`!time` objects are never equal. Order comparison between naive and aware :class:`!time` objects raises :exc:`TypeError`.
pt_br: Objetos :class:`!time` ingênuos e conscientes nunca são iguais. A comparação de ordem entre objetos :class:`!time` ingênuos e conscientes levanta :exc:`TypeError`.

source: If both comparands are aware, and have the same :attr:`~.time.tzinfo` attribute, the :attr:`!tzinfo` and :attr:`!fold` attributes are ignored and the base times are compared. If both comparands are aware and have different :attr:`!tzinfo` attributes, the comparands are first adjusted by subtracting their UTC offsets (obtained from ``self.utcoffset()``).
pt_br: Se ambos os comparandos são conscientes, e tem o mesmo atributo :attr:`~.time.tzinfo`, os atributos :attr:`!tzinfo` e :attr:`!fold` são ignorados e os tempos base são comparados. Se ambos os comparandos são conscientes e tem atributos :attr:`!tzinfo` diferentes, os comparandos são primeiro ajustados subtraindo sua diferença em UTC (obtida através de ``self.utcoffset()``).

source: Equality comparisons between aware and naive :class:`.time` instances don't raise :exc:`TypeError`.
pt_br: Comparações de igualdade entre instâncias de :class:`.time` conscientes e nativas não levantam :exc:`TypeError`.

source: In Boolean contexts, a :class:`.time` object is always considered to be true.
pt_br: Em contextos Booleanos, um objeto :class:`.time` é sempre considerado como verdadeiro.

source: Before Python 3.5, a :class:`.time` object was considered to be false if it represented midnight in UTC. This behavior was considered obscure and error-prone and has been removed in Python 3.5. See :issue:`13936` for full details.
pt_br: Antes do Python 3.5, um objeto :class:`.time` era considerado falso se ele representava meia-noite em UTC. Este comportamento era considerado obscuro e suscetível a erros, e foi removido no Python 3.5. Veja :issue:`13936` para todos os detalhes.

source: Other constructors:
pt_br: Outros construtores:

source: Return a :class:`.time` corresponding to a *time_string* in any valid ISO 8601 format, with the following exceptions:
pt_br: Retorna um :class:`.time` correspondendo a *time_string* em qualquer formato válido de ISO 8601, com as seguintes exceções:

source: The leading ``T``, normally required in cases where there may be ambiguity between a date and a time, is not required.
pt_br: O ``T`` inicial, normalmente exigido nos casos em que pode haver ambiguidade entre uma data e uma hora, não é necessário.

source: Fractional seconds may have any number of digits (anything beyond 6 will be truncated).
pt_br: Segundos fracionários podem ter qualquer número de dígitos (algo além de 6 será truncado).

source: Examples:
pt_br: Exemplos:

source: Previously, this method only supported formats that could be emitted by :meth:`time.isoformat`.
pt_br: Anteriormente, este método suportava apenas formatos que podiam ser emitidos por :meth:`time.isoformat`.

source: Return a :class:`.time` corresponding to *date_string*, parsed according to *format*.
pt_br: Retorna um :class:`.time` correspondente ao *date_string*, analisado de acordo com *format*.

source: If *format* does not contain microseconds or timezone information, this is equivalent to::
pt_br: Se *format* não contiver microssegundos ou informações de fuso horário, isso é equivalente a::

source: :exc:`ValueError` is raised if the *date_string* and *format* cannot be parsed by :func:`time.strptime` or if it returns a value which is not a time tuple. See also :ref:`strftime-strptime-behavior` and :meth:`time.fromisoformat`.
pt_br: :exc:`ValueError` é levantado se o *date_string* e o *format* não puderem ser interpretados por :func:`time.strptime` ou se ele retorna um valor o qual não é uma tupla temporal. Veja também :ref:`strftime-strptime-behavior` e :meth:`time.fromisoformat`.

source: Return a new :class:`.time` with the same values, but with specified parameters updated. Note that ``tzinfo=None`` can be specified to create a naive :class:`.time` from an aware :class:`.time`, without conversion of the time data.
pt_br: Retorna um novo :class:`.time` com os mesmos valores, mas com os parâmetros especificados atualizados. Perceba que ``tzinfo=None`` pode ser especificado para criar um :class:`.time` ingênuo a partir de um :class:`.time` consciente, sem conversão de dados do tempo.

source: :class:`.time` objects are also supported by generic function :func:`copy.replace`.
pt_br: Objetos :class:`.time` também são suportados pela função genérica :func:`copy.replace`.

source: Return a string representing the time in ISO 8601 format, one of:
pt_br: Retorna uma string representando a hora em formato ISO 8601, um destes:

source: ``HH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
pt_br: ``HH:MM:SS.ffffff``, se :attr:`microsecond` não é 0

source: ``HH:MM:SS``, if :attr:`microsecond` is 0
pt_br: ``HH:MM:SS``, se :attr:`microsecond` é 0

source: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :meth:`utcoffset` does not return ``None``
pt_br: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, se :meth:`utcoffset` não retorna ``None``

source: ``HH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0 and :meth:`utcoffset` does not return ``None``
pt_br: ``HH:MM:SS+HH:MM[:SS[.ffffff]]``, se :attr:`microsecond` é 0 e :meth:`utcoffset` não retorna ``None``

source: :exc:`ValueError` will be raised on an invalid *timespec* argument.
pt_br: :exc:`ValueError` será levantado com um argumento *timespec* inválido.

source: For a time ``t``, ``str(t)`` is equivalent to ``t.isoformat()``.
pt_br: Para um tempo ``t``, ``str(t)`` é equivalente a ``t.isoformat()``.

source: Return a string representing the time, controlled by an explicit format string. See also :ref:`strftime-strptime-behavior` and :meth:`time.isoformat`.
pt_br: Retorna uma string representando a hora, controladas por uma string com formato explícito. Veja também :ref:`strftime-strptime-behavior` e :meth:`time.isoformat`.

source: Same as :meth:`.time.strftime`. This makes it possible to specify a format string for a :class:`.time` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. See also :ref:`strftime-strptime-behavior` and :meth:`time.isoformat`.
pt_br: O mesmo que :meth:`.time.strftime`. Isso torna possível especificar uma string de formatação para o objeto :class:`.time` em :ref:`literais de string formatados <f-strings>` e ao usar :meth:`str.format`. Veja também :ref:`strftime-strptime-behavior` e :meth:`time.isoformat`.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(None)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
pt_br: Se :attr:`.tzinfo` for ``None``, retorna ``None``, caso contrário retorna ``self.tzinfo.utcoffset(None)``, e levanta uma exceção se o segundo não retornar ``None`` ou um objeto :class:`timedelta` com magnitude menor que um dia.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(None)``, and raises an exception if the latter doesn't return ``None``, or a :class:`timedelta` object with magnitude less than one day.
pt_br: Se :attr:`.tzinfo` for ``None``, retorna ``None``, caso contrário retorna ``self.tzinfo.dst(None)``, e levanta uma exceção se o segundo não retornar ``None``, ou um objeto :class:`timedelta` com magnitude menor que um dia.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(None)``, or raises an exception if the latter doesn't return ``None`` or a string object.
pt_br: Se :attr:`.tzinfo` for ``None``, retorna ``None``, caso contrário retorna ``self.tzinfo.tzname(None)``, ou levanta uma exceção se o último caso não retornar ``None`` ou um objeto string.

source: Examples of Usage: :class:`.time`
pt_br: Exemplos de uso: :class:`.time`

source: Examples of working with a :class:`.time` object::
pt_br: Exemplos para trabalhar com um objeto :class:`.time`::

source: >>> from datetime import time, tzinfo, timedelta >>> class TZ1(tzinfo): ... def utcoffset(self, dt): ... return timedelta(hours=1) ... def dst(self, dt): ... return timedelta(0) ... def tzname(self,dt): ... return "+01:00" ... def __repr__(self): ... return f"{self.__class__.__name__}()" ... >>> t = time(12, 10, 30, tzinfo=TZ1()) >>> t datetime.time(12, 10, 30, tzinfo=TZ1()) >>> t.isoformat() '12:10:30+01:00' >>> t.dst() datetime.timedelta(0) >>> t.tzname() '+01:00' >>> t.strftime("%H:%M:%S %Z") '12:10:30 +01:00' >>> 'The {} is {:%H:%M}.'.format("time", t) 'The time is 12:10.'
pt_br: >>> from datetime import time, tzinfo, timedelta >>> class TZ1(tzinfo): ... def utcoffset(self, dt): ... return timedelta(hours=1) ... def dst(self, dt): ... return timedelta(0) ... def tzname(self,dt): ... return "+01:00" ... def __repr__(self): ... return f"{self.__class__.__name__}()" ... >>> t = time(12, 10, 30, tzinfo=TZ1()) >>> t datetime.time(12, 10, 30, tzinfo=TZ1()) >>> t.isoformat() '12:10:30+01:00' >>> t.dst() datetime.timedelta(0) >>> t.tzname() '+01:00' >>> t.strftime("%H:%M:%S %Z") '12:10:30 +01:00' >>> 'A {} é {:%H:%M}.'.format("hora", t) 'A hora é 12:10.'

source: :class:`tzinfo` Objects
pt_br: Objetos :class:`tzinfo`

source: This is an abstract base class, meaning that this class should not be instantiated directly. Define a subclass of :class:`tzinfo` to capture information about a particular time zone.
pt_br: Esta é uma classe base abstrata, o que significa que esta classe não deve ser instanciada diretamente. Defina uma subclasse de :class:`tzinfo` para capturar informações sobre um fuso horário em particular.

source: An instance of (a concrete subclass of) :class:`tzinfo` can be passed to the constructors for :class:`.datetime` and :class:`.time` objects. The latter objects view their attributes as being in local time, and the :class:`tzinfo` object supports methods revealing offset of local time from UTC, the name of the time zone, and DST offset, all relative to a date or time object passed to them.
pt_br: Uma instância de (uma subclasse concreta de) :class:`tzinfo` pode ser passada para os construtores de objetos :class:`.datetime` e :class:`.time`. Os objetos time veem seus atributos como se estivessem em horário local, e o objeto :class:`tzinfo` suporta métodos revelando a diferença da hora local a partir de UTC, o nome do fuso horário, e diferença de horário em horário de verão, todos relativos ao objeto date ou time passado para eles.

source: You need to derive a concrete subclass, and (at least) supply implementations of the standard :class:`tzinfo` methods needed by the :class:`.datetime` methods you use. The :mod:`!datetime` module provides :class:`timezone`, a simple concrete subclass of :class:`tzinfo` which can represent time zones with fixed offset from UTC such as UTC itself or North American EST and EDT.
pt_br: Você precisa derivar uma subclasse concreta, e (pelo menos) fornecer implementações dos métodos padrões de :class:`tzinfo` necessários pelos métodos :class:`.datetime` que você usa. O módulo :mod:`!datetime` fornece :class:`timezone`, uma subclasse concreta simples de :class:`tzinfo`, que pode representar fusos horários com diferença fixa a partir de UTC, tais como o próprio UTC, ou EST (Eastern Standard Time ou Horário padrão oriental) e EDT (Eastern Daylight Time ou Horário de verão oriental) na América do Norte.

source: Special requirement for pickling: A :class:`tzinfo` subclass must have an :meth:`~object.__init__` method that can be called with no arguments, otherwise it can be pickled but possibly not unpickled again. This is a technical requirement that may be relaxed in the future.
pt_br: Requisito especial para preservação: uma subclasse :class:`tzinfo` deve ter um método :meth:`~object.__init__` que pode ser chamado sem nenhum argumento, caso contrário ele pode ser conservado, mas não alterado novamente. Isso é um requisito técnico que pode ser relaxado no futuro.

source: A concrete subclass of :class:`tzinfo` may need to implement the following methods. Exactly which methods are needed depends on the uses made of aware :mod:`!datetime` objects. If in doubt, simply implement all of them.
pt_br: Uma subclasse concreta de :class:`tzinfo` pode precisar implementar os seguintes métodos. Exatamente quais métodos são necessários depende do uso feito de objetos :mod:`!datetime` conscientes. Se estiver em dúvida, simplesmente implemente todos eles.

source: Return offset of local time from UTC, as a :class:`timedelta` object that is positive east of UTC. If local time is west of UTC, this should be negative.
pt_br: Retorna a diferença da hora local a partir do UTC, como um objeto :class:`timedelta`, que é positivo a leste do UTC. Se a hora local está a oeste do UTC, isto deve ser negativo.

source: This represents the *total* offset from UTC; for example, if a :class:`tzinfo` object represents both time zone and DST adjustments, :meth:`utcoffset` should return their sum. If the UTC offset isn't known, return ``None``. Else the value returned must be a :class:`timedelta` object strictly between ``-timedelta(hours=24)`` and ``timedelta(hours=24)`` (the magnitude of the offset must be less than one day). Most implementations of :meth:`utcoffset` will probably look like one of these two::
pt_br: Isto representa a diferença *total* a partir de UTC; por exemplo, se um objeto :class:`tzinfo` representa fuso horário e ajustes de horário de verão, :meth:`utcoffset` deve retornar a soma deles. Se a diferença UTC não é conhecida, retorna ``None``. Caso contrário o valor retornado deve ser um objeto :class:`timedelta` estritamente contido entre ``-timedelta(hours=24)`` e ``timedelta(hours=24)`` (a magnitude da diferença deve ser menor que um dia). A maior parte das implementações de :meth:`utcoffset` irá provavelmente parecer com um destes dois::

source: return CONSTANT # fixed-offset class return CONSTANT + self.dst(dt) # daylight-aware class
pt_br: return CONSTANT # classe de posição fixa return CONSTANT + self.dst(dt) # classe consciente de horário de verão

source: If :meth:`utcoffset` does not return ``None``, :meth:`dst` should not return ``None`` either.
pt_br: Se :meth:`utcoffset` não retorna ``None``, :meth:`dst` também não deve retornar ``None``.

source: The default implementation of :meth:`utcoffset` raises :exc:`NotImplementedError`.
pt_br: A implementação padrão de :meth:`utcoffset` levanta :exc:`NotImplementedError`.

source: Return the daylight saving time (DST) adjustment, as a :class:`timedelta` object or ``None`` if DST information isn't known.
pt_br: Retorna o ajuste para o horário de verão (DST - daylight saving time), como um objeto :class:`timedelta` ou ``None`` se informação para o horário de verão é desconhecida.

source: Return ``timedelta(0)`` if DST is not in effect. If DST is in effect, return the offset as a :class:`timedelta` object (see :meth:`utcoffset` for details). Note that DST offset, if applicable, has already been added to the UTC offset returned by :meth:`utcoffset`, so there's no need to consult :meth:`dst` unless you're interested in obtaining DST info separately. For example, :meth:`datetime.timetuple` calls its :attr:`~.datetime.tzinfo` attribute's :meth:`dst` method to determine how the :attr:`~time.struct_time.tm_isdst` flag should be set, and :meth:`tzinfo.fromutc` calls :meth:`dst` to account for DST changes when crossing time zones.
pt_br: Retorna ``timedelta(0)`` se o horário de verão não estiver ativo. Se o horário de verão estiver ativo, retorna a diferença como um objeto :class:`timedelta` (veja :meth:`utcoffset` para detalhes). Perceba que a diferença do horário de verão, se aplicável, já foi adicionada a diferença UTC retornada por :meth:`utcoffset`, então não existe necessidade de consultar :meth:`dst` a não ser que você esteja interessado em obter a informação de horário de verão separadamente. Por exemplo, :meth:`datetime.timetuple` chama o método :meth:`dst` do seu atributo :attr:`~.datetime.tzinfo` para determinar como o flag :attr:`~time.struct_time.tm_isdst` deve ser definido, e :meth:`tzinfo.fromutc` chama :meth:`dst` para contabilizar as mudanças de horário de verão quando ocorrem mudanças de fuso horário.

source: An instance *tz* of a :class:`tzinfo` subclass that models both standard and daylight times must be consistent in this sense:
pt_br: Uma instância *tz* de uma subclasse :class:`tzinfo` que modela tanto horário padrão quanto horário de verão deve ser consistente neste sentido:

source: must return the same result for every :class:`.datetime` *dt* with ``dt.tzinfo == tz``. For sane :class:`tzinfo` subclasses, this expression yields the time zone's "standard offset", which should not depend on the date or the time, but only on geographic location. The implementation of :meth:`datetime.astimezone` relies on this, but cannot detect violations; it's the programmer's responsibility to ensure it. If a :class:`tzinfo` subclass cannot guarantee this, it may be able to override the default implementation of :meth:`tzinfo.fromutc` to work correctly with :meth:`~.datetime.astimezone` regardless.
pt_br: deve retornar o mesmo resultado para cada :class:`.datetime` *dt* com ``dt.tzinfo == tz`` para subclasses :class:`tzinfo` sãs, esta expressão produz a "diferença padrão" do fuso horário, a qual não deve depender de data ou hora, mas apenas de localização geográfica. A implementação de :meth:`datetime.astimezone` depende disso, mas não pode detectar violações; é responsabilidade do programador garantir isso. Se uma subclasse :class:`tzinfo` não pode garantir isso, ele pode ser capaz de substituir a implementação padrão de :meth:`tzinfo.fromutc` para funcionar corretamente com :meth:`~.datetime.astimezone` independente disso.

source: Most implementations of :meth:`dst` will probably look like one of these two::
pt_br: Maior parte das implementações de :meth:`dst` provavelmente irá parecer com um destes dois::

source: def dst(self, dt): # a fixed-offset class: doesn't account for DST return timedelta(0)
pt_br: def dst(self, dt): # uma classe de posição fixa: não levam em conta DST return timedelta(0)

source: or::
pt_br: ou::

source: def dst(self, dt): # Code to set dston and dstoff to the time zone's DST # transition times based on the input dt.year, and expressed # in standard local time. if dston <= dt.replace(tzinfo=None) < dstoff: return timedelta(hours=1) else: return timedelta(0)
pt_br: def dst(self, dt): # Código para definir dston e dstoff para os horários # de transição do horário de versão com base # no dt.year de entrada e expresso no horário local padrão. if dston <= dt.replace(tzinfo=None) < dstoff: return timedelta(hours=1) else: return timedelta(0)

source: The default implementation of :meth:`dst` raises :exc:`NotImplementedError`.
pt_br: A implementação padrão de :meth:`dst` levanta :exc:`NotImplementedError`.

source: Return the time zone name corresponding to the :class:`.datetime` object *dt*, as a string. Nothing about string names is defined by the :mod:`!datetime` module, and there's no requirement that it mean anything in particular. For example, ``"GMT"``, ``"UTC"``, ``"-500"``, ``"-5:00"``, ``"EDT"``, ``"US/Eastern"``, ``"America/New York"`` are all valid replies. Return ``None`` if a string name isn't known. Note that this is a method rather than a fixed string primarily because some :class:`tzinfo` subclasses will wish to return different names depending on the specific value of *dt* passed, especially if the :class:`tzinfo` class is accounting for daylight time.
pt_br: Retorna o nome do fuso horário correspondente ao objeto :class:`.datetime` *dt*, como uma string. Nada sobre nomes de strings é definido pelo módulo :mod:`!datetime`, e não há nenhuma exigência de que signifique algo em particular. Por exemplo, ``"GMT"``, ``"UTC"``, ``"-500"``, ``"-5:00"``, ``"EDT"``, ``"US/Eastern"``, ``"America/New York"`` são todas respostas válidas. Retorna ``None`` se um nome de string não for conhecido. Observe que este é um método em vez de uma string fixa, principalmente porque algumas subclasses :class:`tzinfo` desejarão retornar nomes diferentes dependendo do valor específico de *dt* passado, especialmente se a classe :class:`tzinfo` estiver contabilizando o horário de verão.

source: The default implementation of :meth:`tzname` raises :exc:`NotImplementedError`.
pt_br: A implementação padrão de :meth:`tzname` levanta :exc:`NotImplementedError`.

source: These methods are called by a :class:`.datetime` or :class:`.time` object, in response to their methods of the same names. A :class:`.datetime` object passes itself as the argument, and a :class:`.time` object passes ``None`` as the argument. A :class:`tzinfo` subclass's methods should therefore be prepared to accept a *dt* argument of ``None``, or of class :class:`.datetime`.
pt_br: Estes métodos são chamados por um objeto :class:`.datetime` ou :class:`.time`, em resposta aos seus métodos de mesmo nome. Um objeto :class:`.datetime` passa a si mesmo como argumento, e um objeto :class:`.time` passa ``None`` como o argumento. Os métodos de uma subclasse :class:`tzinfo` devem portanto estar preparados para aceitar um argumento *dt* com valor ``None``, ou uma classe :class:`.datetime`.
