Repository: python/python-docs-pt-br
Catalog: library/dbm.po
Languages: pt_br

source: :mod:`!dbm` --- Interfaces to Unix "databases"
pt_br: :mod:`!dbm` --- Interfaces para "banco de dados" Unix

source: **Source code:** :source:`Lib/dbm/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/dbm/__init__.py`

source: :mod:`dbm` is a generic interface to variants of the DBM database:
pt_br: :mod:`dbm` é uma interface genérica para variantes do banco de dados DBM:

source: If none of these modules are installed, the slow-but-simple implementation in module :mod:`dbm.dumb` will be used. There is a `third party interface <https://www.jcea.es/programacion/pybsddb.htm>`_ to the Oracle Berkeley DB.
pt_br: Se nenhum desses módulos estiverem instalados, a implementação lenta, mas simples, no módulo :mod:`dbm.dumb` será usada. Há uma `interface de terceiros <https://www.jcea.es/programacion/pybsddb.htm>`_ para o Oracle Berkeley DB.

source: A tuple containing the exceptions that can be raised by each of the supported modules, with a unique exception also named :exc:`dbm.error` as the first item --- the latter is used when :exc:`dbm.error` is raised.
pt_br: Uma tupla contendo as exceções que podem ser levantadas por cada um dos módulos suportados, com a única exceção também chamada :exc:`dbm.error` como o primeiro item --- o último é usado quando :exc:`dbm.error` é levantada.

source: This function attempts to guess which of the several simple database modules available --- :mod:`dbm.sqlite3`, :mod:`dbm.gnu`, :mod:`dbm.ndbm`, or :mod:`dbm.dumb` --- should be used to open a given file.
pt_br: Esta função tenta adivinhar qual dos vários módulos de banco de dados simples disponíveis --- :mod:`dbm.sqlite3`, :mod:`dbm.gnu`, :mod:`dbm.ndbm` ou :mod:`dbm.dumb` --- deve ser usado para abrir o arquivo fornecido.

source: Return one of the following values:
pt_br: Retorna um dos seguintes valores:

source: ``None`` if the file can't be opened because it's unreadable or doesn't exist
pt_br: ``None`` se o arquivo não puder ser aberto porque está ilegível ou não existe

source: the empty string (``''``) if the file's format can't be guessed
pt_br: a string vazia (``''``) se o formato do arquivo não puder ser adivinhado

source: a string containing the required module name, such as ``'dbm.ndbm'`` or ``'dbm.gnu'``
pt_br: uma string contendo o nome do módulo necessário, tal como ``'dbm.ndbm'`` ou ``'dbm.gnu'``

source: *filename* accepts a :term:`path-like object`.
pt_br: *filename* aceita um :term:`objeto caminho ou similar`.

source: Open a database and return the corresponding database object.
pt_br: Abre um banco de dados e retorna o objeto banco de dados correspondendo.

source: Parameters
pt_br: Parâmetros

source: The database file to open. If the database file already exists, the :func:`whichdb` function is used to determine its type and the appropriate module is used; if it does not exist, the first submodule listed above that can be imported is used.
pt_br: O arquivo de banco de dados para abrir. Se o arquivo de banco de dados já existe, a função :func:`whichdb` é usada para determinar seu tipo e o módulo apropriado é usado; se ele não existir, o primeiro submódulo listado acima que pode ser importado é usado.

source: The database file to open.
pt_br: O arquivo de banco de dados para abrir.

source: If the database file already exists, the :func:`whichdb` function is used to determine its type and the appropriate module is used; if it does not exist, the first submodule listed above that can be imported is used.
pt_br: Se o arquivo de banco de dados já existe, a função :func:`whichdb` é usada para determinar seu tipo e o módulo apropriado é usado; se ele não existir, o primeiro submódulo listado acima que pode ser importado é usado.

source: * ``'r'`` (default): |flag_r| * ``'w'``: |flag_w| * ``'c'``: |flag_c| * ``'n'``: |flag_n|
pt_br: * ``'r'`` (padrão): |flag_r| * ``'w'``: |flag_w| * ``'c'``: |flag_c| * ``'n'``: |flag_n|

source: ``'r'`` (default): |flag_r|
pt_br: ``'r'`` (padrão): |flag_r|

source: *file* accepts a :term:`path-like object`.
pt_br: *file* aceita um :term:`objeto caminho ou similar`.

source: The object returned by :func:`~dbm.open` supports the same basic functionality as a :class:`dict`; keys and their corresponding values can be stored, retrieved, and deleted, and the :keyword:`in` operator and the :meth:`!keys` method are available, as well as :meth:`!get` and :meth:`!setdefault` methods.
pt_br: O objeto retornado por :func:`~dbm.open` oferece suporte à mesma funcionalidade básica que um :class:`dict`; chaves e seus valores correspondentes podem ser armazenados, obtidos e excluídos, e o operador :keyword:`in` e o método :meth:`!keys` estão disponíveis, bem como métodos :meth:`!get` e :meth:`!setdefault`.

source: Key and values are always stored as :class:`bytes`. This means that when strings are used they are implicitly converted to the default encoding before being stored.
pt_br: Chaves e valores são sempre armazenados como :class:`bytes`. Isso significa que quando strings são usadas, elas são implicitamente convertidas para a codificação padrão antes de serem armazenadas.

source: These objects also support being used in a :keyword:`with` statement, which will automatically close them when done.
pt_br: Estes objetos também oferecem suporte a serem usados em uma instrução :keyword:`with`, que vai fechá-los automaticamente quando estiver concluída.

source: :meth:`!get` and :meth:`!setdefault` methods are now available for all :mod:`dbm` backends.
pt_br: O métodos :meth:`!get` e :meth:`!setdefault` estão agora disponíveis para todos os backends do :mod:`dbm`.

source: Added native support for the context management protocol to the objects returned by :func:`~dbm.open`.
pt_br: Adicionado suporte nativo para o protocolo de gerenciamento de contexto para os objetos retornados por :func:`~dbm.open`.

source: Deleting a key from a read-only database raises a database module specific exception instead of :exc:`KeyError`.
pt_br: Excluir uma chave de um banco de dados somente leitura levanta uma exceção de banco de dados específica do módulo em vez de :exc:`KeyError`.

source: The following example records some hostnames and a corresponding title, and then prints out the contents of the database::
pt_br: Os seguintes exemplos registram alguns hostnames e um título correspondente, e então exibe o conteúdo do banco de dados::

source: import dbm # Open database, creating it if necessary. with dbm.open('cache', 'c') as db: # Record some values db[b'hello'] = b'there' db['www.python.org'] = 'Python Website' db['www.cnn.com'] = 'Cable News Network' # Note that the keys are considered bytes now. assert db[b'www.python.org'] == b'Python Website' # Notice how the value is now in bytes. assert db['www.cnn.com'] == b'Cable News Network' # Often-used methods of the dict interface work too. print(db.get('python.org', b'not present')) # Storing a non-string key or value will raise an exception (most # likely a TypeError). db['www.yahoo.com'] = 4 # db is automatically closed when leaving the with statement.
pt_br: import dbm # Abre o banco de dados, criando-o se necessário. with dbm.open('cache', 'c') as db: # Registra alguns valores db[b'hello'] = b'there' db['www.python.org'] = 'Python Website' db['www.cnn.com'] = 'Cable News Network' # Note que as chaves são consideradas bytes agora. assert db[b'www.python.org'] == b'Python Website' # Observe como o valor é agora em bytes. assert db['www.cnn.com'] == b'Cable News Network' # Métodos geralmente usados da interface dict funcionam também. print(db.get('python.org', b'not present')) # Armazenar uma chave não-string ou valor vai levantar uma exceção # (provavelmente uma TypeError). db['www.yahoo.com'] = 4 # db é automaticamente fechado a sair da instrução with.

source: Module :mod:`shelve`
pt_br: Módulo :mod:`shelve`

source: Persistence module which stores non-string data.
pt_br: Módulo persistente que armazena dados não-string.

source: The individual submodules are described in the following sections.
pt_br: Os submódulos individuais são descritos nas seções a seguir.

source: :mod:`dbm.sqlite3` --- SQLite backend for dbm
pt_br: :mod:`dbm.sqlite3` --- Backend de SQLite para dbm

source: **Source code:** :source:`Lib/dbm/sqlite3.py`
pt_br: **Código-fonte:** :source:`Lib/dbm/sqlite3.py`

source: This module uses the standard library :mod:`sqlite3` module to provide an SQLite backend for the :mod:`dbm` module. The files created by :mod:`dbm.sqlite3` can thus be opened by :mod:`sqlite3`, or any other SQLite browser, including the SQLite CLI.
pt_br: Este módulo usa o módulo da biblioteca padrão :mod:`sqlite3` para fornecer um backend de SQLite para o módulo :mod:`dbm`. Os arquivos criados por :mod:`dbm.sqlite3` podem então ser abertos por :mod:`sqlite3` ou quaisquer outros navegadores de SQLite, incluindo CLI do SQLite.

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: Open an SQLite database. The returned object behaves like a :term:`mapping`, implements a :meth:`!close` method, and supports a "closing" context manager via the :keyword:`with` keyword.
pt_br: Abre um banco de dados de SQLite. O objeto retornado se comporta como um :term:`mapeamento`, implementa um método :meth:`!close` e oferece suporte um gerenciador de contexto de "fechamento" via a palavra reservada :keyword:`with`.

source: The path to the database to be opened.
pt_br: O caminho para o banco de dados a ser aberta.

source: The Unix file access mode of the file (default: octal ``0o666``), used only when the database has to be created.
pt_br: O modo de acesso a arquivos do Unix do arquivo (padrão: octal ``0o666``), usado apenas quando o banco de dados tem que ser criado.

source: :mod:`dbm.gnu` --- GNU database manager
pt_br: :mod:`dbm.gnu` --- Gerenciador de banco de dados do GNU

source: **Source code:** :source:`Lib/dbm/gnu.py`
pt_br: **Código-fonte:** :source:`Lib/dbm/gnu.py`

source: The :mod:`dbm.gnu` module provides an interface to the :abbr:`GDBM (GNU dbm)` library, similar to the :mod:`dbm.ndbm` module, but with additional functionality like crash tolerance.
pt_br: O módulo :mod:`dbm.gnu` fornece uma interface para a biblioteca :abbr:`GDBM (GNU dbm)`, semelhante ao módulo :mod:`dbm.ndbm`, mas com funcionalidades adicionais, como tolerância a falhas.

source: The file formats created by :mod:`dbm.gnu` and :mod:`dbm.ndbm` are incompatible and can not be used interchangeably.
pt_br: Os formatos de arquivo criados por :mod:`dbm.gnu` e :mod:`dbm.ndbm` são incompatíveis e não podem ser usados de forma intercambiável.

source: This module is not supported on :ref:`mobile platforms <mobile-availability>` or :ref:`WebAssembly platforms <wasm-availability>`.
pt_br: Este módulo não tem suporte em :ref:`plataformas móveis <mobile-availability>` ou :ref:`plataformas WebAssembly <wasm-availability>`.

source: Raised on :mod:`dbm.gnu`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
pt_br: Levantada em erros específicos do :mod:`dbm.gnu`, como erros de E/S. :exc:`KeyError` é levantada para erros gerais de mapeamento, como especificar uma chave incorreta.

source: Open a GDBM database and return a :class:`!gdbm` object.
pt_br: Abre um banco de dados GDBM e retorna um objeto :class:`!gdbm`.

source: * ``'r'`` (default): |flag_r| * ``'w'``: |flag_w| * ``'c'``: |flag_c| * ``'n'``: |flag_n| The following additional characters may be appended to control how the database is opened: * ``'f'``: Open the database in fast mode. Writes to the database will not be synchronized. * ``'s'``: Synchronized mode. Changes to the database will be written immediately to the file. * ``'u'``: Do not lock database. Not all flags are valid for all versions of GDBM. See the :data:`open_flags` member for a list of supported flag characters.
pt_br: * ``'r'`` (padrão): |flag_r| * ``'w'``: |flag_w| * ``'c'``: |flag_c| * ``'n'``: |flag_n| Os seguintes caracteres adicionais podem ser anexados para controlar como o banco de dados é aberto: * ``'f'``: Abre o banco de dados no modo rápido. As gravações no banco de dados não serão sincronizadas. * ``'s'``: Modo sincronizado. As alterações no banco de dados serão gravadas imediatamente no arquivo. * ``'u'``: Não trava o banco de dados. Nem todos os sinalizadores são válidos para todas as versões do GDBM. Consulte o membro :data:`open_flags` para obter uma lista de caracteres de sinalizadores suportados.

source: The following additional characters may be appended to control how the database is opened:
pt_br: Os seguintes caracteres adicionais podem ser acrescentados para controlar como o banco de dados é aberto:

source: ``'f'``: Open the database in fast mode. Writes to the database will not be synchronized.
pt_br: ``'f'``: Abre o banco de dados em modo rápido. As gravações no banco de dados não serão sincronizadas.

source: ``'s'``: Synchronized mode. Changes to the database will be written immediately to the file.
pt_br: ``'s'``: Modo sincronizado. Alterações no banco de dados serão gravadas imediatamente no arquivo.

source: ``'u'``: Do not lock database.
pt_br: ``'u'``: Não trava o banco de dados.

source: Not all flags are valid for all versions of GDBM. See the :data:`open_flags` member for a list of supported flag characters.
pt_br: Nem todos os sinalizadores são válidos para todas as versões do GDBM. Veja o membro :data:`open_flags` para uma lista de caracteres de sinalizadores suportados.

source: Raises
pt_br: Levanta

source: If an invalid *flag* argument is passed.
pt_br: Se um argumento *flag* inválido for passado.

source: A string of characters the *flag* parameter of :meth:`~dbm.gnu.open` supports.
pt_br: Uma sequência de caracteres que o parâmetro *flag* de :meth:`~dbm.gnu.open` suporta.

source: :class:`!gdbm` objects behave similar to :term:`mappings <mapping>`, but :meth:`!items` and :meth:`!values` methods are not supported. The following methods are also provided:
pt_br: Os objetos :class:`!gdbm` se comportam de forma semelhante a :term:`mapeamentos <mapping>`, mas os métodos :meth:`!items` e :meth:`!values` não são suportados. Os seguintes métodos também são fornecidos:

source: It's possible to loop over every key in the database using this method and the :meth:`nextkey` method. The traversal is ordered by GDBM's internal hash values, and won't be sorted by the key values. This method returns the starting key.
pt_br: É possível fazer um laço em cada chave no banco de dados usando este método e o método :meth:`nextkey`. A travessia é ordenada pelos valores de hash internos do GDBM e não será classificada pelos valores de chave. Este método retorna a chave inicial.

source: Returns the key that follows *key* in the traversal. The following code prints every key in the database ``db``, without having to create a list in memory that contains them all::
pt_br: Retorna a chave que segue *key* na travessia. O código a seguir imprime cada chave no banco de dados ``db``, sem precisar criar uma lista na memória que contenha todas elas::

source: If you have carried out a lot of deletions and would like to shrink the space used by the GDBM file, this routine will reorganize the database. :class:`!gdbm` objects will not shorten the length of a database file except by using this reorganization; otherwise, deleted file space will be kept and reused as new (key, value) pairs are added.
pt_br: Se você realizou muitas exclusões e gostaria de reduzir o espaço usado pelo arquivo GDBM, esta rotina reorganizará o banco de dados. Objetos :class:`!gdbm` não reduzirão o tamanho de um arquivo de banco de dados, exceto usando esta reorganização; caso contrário, o espaço de arquivo excluído será mantido e reutilizado à medida que novos pares (chave, valor) forem adicionados.

source: When the database has been opened in fast mode, this method forces any unwritten data to be written to the disk.
pt_br: Quando o banco de dados é aberto no modo rápido, esse método força a gravação de todos os dados não gravados no disco.

source: Close the GDBM database.
pt_br: Fecha o banco de dados GDBM.

source: Remove all items from the GDBM database.
pt_br: Remove todos os itens do banco de dados GDBM.

source: **Source code:** :source:`Lib/dbm/ndbm.py`
pt_br: **Código-fonte:** :source:`Lib/dbm/ndbm.py`

source: The :mod:`dbm.ndbm` module provides an interface to the :abbr:`NDBM (New Database Manager)` library. This module can be used with the "classic" NDBM interface or the :abbr:`GDBM (GNU dbm)` compatibility interface.
pt_br: O módulo :mod:`dbm.ndbm` fornece uma interface para a biblioteca :abbr:`NDBM (New Database Manager)`. Este módulo pode ser usado com a interface NDBM "clássica" ou a interface de compatibilidade :abbr:`GDBM (GNU dbm)`.

source: The NDBM library shipped as part of macOS has an undocumented limitation on the size of values, which can result in corrupted database files when storing values larger than this limit. Reading such corrupted files can result in a hard crash (segmentation fault).
pt_br: A biblioteca NDBM enviada como parte do macOS tem uma limitação não documentada no tamanho dos valores, o que pode resultar em arquivos de banco de dados corrompidos ao armazenar valores maiores que esse limite. Ler esses arquivos corrompidos pode resultar em uma falha grave (falha de segmentação).

source: Raised on :mod:`dbm.ndbm`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
pt_br: Levantada em erros específicos de :mod:`dbm.ndbm`, como erros de E/S. :exc:`KeyError` é levantada para erros gerais de mapeamento, como especificar uma chave incorreta.

source: Name of the NDBM implementation library used.
pt_br: Nome da biblioteca de implementação NDBM usada.

source: Open an NDBM database and return an :class:`!ndbm` object.
pt_br: Abre um banco de dados NDBM e retorna um objeto :class:`!ndbm`.

source: The basename of the database file (without the :file:`.dir` or :file:`.pag` extensions).
pt_br: O nome base do arquivo de banco de dados (sem as extensões :file:`.dir` ou :file:`.pag`).

source: :class:`!ndbm` objects behave similar to :term:`mappings <mapping>`, but :meth:`!items` and :meth:`!values` methods are not supported. The following methods are also provided:
pt_br: Os objetos :class:`!ndbm` se comportam de forma semelhante a :term:`mapeamentos <mapping>`, mas os métodos :meth:`!items` e :meth:`!values` não são suportados. Os seguintes métodos também são fornecidos:

source: Accepts :term:`path-like object` for filename.
pt_br: Aceita um :term:`objeto caminho ou similar` como nome de arquivo.

source: Close the NDBM database.
pt_br: Fecha o banco de dados NDBM.

source: Remove all items from the NDBM database.
pt_br: Remove todos os itens do banco de dados NDBM.

source: :mod:`dbm.dumb` --- Portable DBM implementation
pt_br: :mod:`dbm.dumb` --- Implementação portátil do DBM

source: **Source code:** :source:`Lib/dbm/dumb.py`
pt_br: **Código-fonte:** :source:`Lib/dbm/dumb.py`

source: The :mod:`dbm.dumb` module is intended as a last resort fallback for the :mod:`dbm` module when a more robust module is not available. The :mod:`dbm.dumb` module is not written for speed and is not nearly as heavily used as the other database modules.
pt_br: O módulo :mod:`dbm.dumb` é pensado como um último recurso alternativo para o módulo :mod:`dbm` quando um módulo mais robusto não está disponível. O módulo :mod:`dbm.dumb` não é escrito para velocidade e não é tão usado quanto os outros módulos de banco de dados.

source: The :mod:`dbm.dumb` module provides a persistent :class:`dict`-like interface which is written entirely in Python. Unlike other :mod:`dbm` backends, such as :mod:`dbm.gnu`, no external library is required.
pt_br: O módulo :mod:`dbm.dumb` fornece uma interface persistente do tipo :class:`dict` que é escrita inteiramente em Python. Ao contrário de outros backends :mod:`dbm`, como :mod:`dbm.gnu`, nenhuma biblioteca externa é necessária.

source: The :mod:`!dbm.dumb` module defines the following:
pt_br: O módulo :mod:`!dbm.dumb` define o seguinte:

source: Raised on :mod:`dbm.dumb`-specific errors, such as I/O errors. :exc:`KeyError` is raised for general mapping errors like specifying an incorrect key.
pt_br: Levantada em erros específicos de :mod:`dbm.dumb`, como erros de E/S. :exc:`KeyError` é levantada para erros gerais de mapeamento, como especificar uma chave incorreta.

source: Open a :mod:`!dbm.dumb` database. The returned database object behaves similar to a :term:`mapping`, in addition to providing :meth:`~dumbdbm.sync` and :meth:`~dumbdbm.close` methods.
pt_br: Abre um banco de dados :mod:`!dbm.dumb`. O objeto banco de dados retornado se comporta de forma semelhante a um :term:`mapeamento`, além de fornecer os métodos :meth:`~dumbdbm.sync` e :meth:`~dumbdbm.close`.

source: The basename of the database file (without extensions). A new database creates the following files: - :file:`{filename}.dat` - :file:`{filename}.dir`
pt_br: O nome base do arquivo do banco de dados (sem extensões). Um novo banco de dados cria os seguintes arquivos: - :file:`{filename}.dat` - :file:`{filename}.dir`

source: The basename of the database file (without extensions). A new database creates the following files:
pt_br: O nome base do arquivo do banco de dados (sem extensões). Um novo banco de dados cria os seguintes arquivos:

source: * ``'r'``: |flag_r| * ``'w'``: |flag_w| * ``'c'`` (default): |flag_c| * ``'n'``: |flag_n|
pt_br: * ``'r'``: |flag_r| * ``'w'``: |flag_w| * ``'c'`` (padrão): |flag_c| * ``'n'``: |flag_n|

source: ``'c'`` (default): |flag_c|
pt_br: ``'c'`` (padrão): |flag_c|

source: It is possible to crash the Python interpreter when loading a database with a sufficiently large/complex entry due to stack depth limitations in Python's AST compiler.
pt_br: É possível travar o interpretador Python ao carregar um banco de dados com uma entrada suficientemente grande/complexa devido a limitações de profundidade de pilha no compilador AST do Python.

source: :func:`~dbm.dumb.open` always creates a new database when *flag* is ``'n'``.
pt_br: :func:`~dbm.dumb.open` sempre cria um novo banco de dados quando *flag* é ``'n'``.

source: A database opened read-only if *flag* is ``'r'``. A database is not created if it does not exist if *flag* is ``'r'`` or ``'w'``.
pt_br: Um banco de dados aberto somente leitura se *flag* for ``'r'``. Um banco de dados não é criado se não existir se *flag* for ``'r'`` ou ``'w'``.

source: In addition to the methods provided by the :class:`collections.abc.MutableMapping` class, the following methods are provided:
pt_br: Além dos métodos fornecidos pela classe :class:`collections.abc.MutableMapping`, os seguintes métodos são fornecidos:

source: Synchronize the on-disk directory and data files. This method is called by the :meth:`shelve.Shelf.sync` method.
pt_br: Sincroniza o diretório no disco e os arquivos de dados. Este método é chamado pelo método :meth:`shelve.Shelf.sync`.

source: Close the database.
pt_br: Fecha o banco de dados.

source: databases
pt_br: bancos de dados
