Repository: python/python-docs-pt-br
Catalog: library/decimal.po
Languages: pt_br

source: The usual approach to working with decimals is to create :class:`Decimal` instances and then apply arithmetic operations which take place within the current context for the active thread. An alternative approach is to use context methods for calculating within a specific context. The methods are similar to those for the :class:`Decimal` class and are only briefly recounted here.
pt_br: A abordagem usual para trabalhar com decimais é criar instâncias de :class:`Decimal` e depois aplicar operações aritméticas que ocorrem no contexto atual da thread ativa. Uma abordagem alternativa é usar métodos de contexto para calcular dentro de um contexto específico. Os métodos são semelhantes aos da classe :class:`Decimal` e são contados apenas brevemente aqui.

source: Returns the absolute value of *x*.
pt_br: Retorna o valor absoluto de *x*.

source: Return the sum of *x* and *y*.
pt_br: Retorna a soma de *x* e *y*.

source: Returns the same Decimal object *x*.
pt_br: Retorna o mesmo objeto de Decimal *x*.

source: Compares *x* and *y* numerically.
pt_br: Compara *x* e *y* numericamente.

source: Compares the values of the two operands numerically.
pt_br: Compara os valores dos dois operandos numericamente.

source: Compares two operands using their abstract representation.
pt_br: Compara dois operandos usando sua representação abstrata.

source: Compares two operands using their abstract representation, ignoring sign.
pt_br: Compara dois operandos usando sua representação abstrata, ignorando o sinal.

source: Returns a copy of *x* with the sign set to 0.
pt_br: Retorna uma cópia de *x* com o sinal definido para 0.

source: Returns a copy of *x* with the sign inverted.
pt_br: Retorna uma cópia de *x* com o sinal invertido.

source: Copies the sign from *y* to *x*.
pt_br: Copia o sinal de *y* para *x*.

source: Return *x* divided by *y*.
pt_br: Retorna *x* dividido por *y*.

source: Return *x* divided by *y*, truncated to an integer.
pt_br: Retorna *x* dividido por *y*, truncado para um inteiro.

source: Divides two numbers and returns the integer part of the result.
pt_br: Divide dois números e retorna a parte inteira do resultado.

source: Returns ``e ** x``.
pt_br: Retorna ``e ** x``.

source: Returns *x* multiplied by *y*, plus *z*.
pt_br: Retorna *x* multiplicado por *y*, mais *z*.

source: Returns ``True`` if *x* is canonical; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for canonical; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is finite; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for finito; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is infinite; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for infinito; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is a qNaN or sNaN; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for qNaN ou sNaN; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is a normal number; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for um número normal; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is a quiet NaN; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for um NaN silencioso; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is negative; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for negativo; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is a signaling NaN; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for um NaN sinalizador; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is subnormal; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for subnormal; caso contrário, retorna ``False``.

source: Returns ``True`` if *x* is a zero; otherwise returns ``False``.
pt_br: Retorna ``True`` se *x* for zero; caso contrário, retorna ``False``.

source: Returns the natural (base e) logarithm of *x*.
pt_br: Retorna o logaritmo natural (base e) de *x*.

source: Returns the base 10 logarithm of *x*.
pt_br: Retorna o logaritmo de base 10 de *x*.

source: Returns the exponent of the magnitude of the operand's MSD.
pt_br: Retorna o expoente da magnitude do MSD do operando.

source: Applies the logical operation *and* between each operand's digits.
pt_br: Aplica a operação lógica *e* entre cada dígito do operando.

source: Invert all the digits in *x*.
pt_br: Inverte todos os dígitos em *x*.

source: Applies the logical operation *or* between each operand's digits.
pt_br: Aplica a operação lógica *ou* entre cada dígito do operando.

source: Applies the logical operation *xor* between each operand's digits.
pt_br: Aplica a operação lógica *ou exclusivo* entre cada dígito do operando.

source: Compares two values numerically and returns the maximum.
pt_br: Compara dois valores numericamente e retorna o máximo.

source: Compares the values numerically with their sign ignored.
pt_br: Compara dois valores numericamente com seu sinal ignorado.

source: Compares two values numerically and returns the minimum.
pt_br: Compara dois valores numericamente e retorna o mínimo.

source: Minus corresponds to the unary prefix minus operator in Python.
pt_br: Minus corresponde ao operador de subtração de prefixo unário no Python.

source: Return the product of *x* and *y*.
pt_br: Retorna o produto de *x* e *y*.

source: Returns the largest representable number smaller than *x*.
pt_br: Retorna o maior número representável menor que *x*.

source: Returns the smallest representable number larger than *x*.
pt_br: Retorna o menor número representável maior que *x*.

source: Returns the number closest to *x*, in direction towards *y*.
pt_br: Retorna o número mais próximo a *x*, em direção a *y*.

source: Reduces *x* to its simplest form.
pt_br: Reduz *x* para sua forma mais simples.

source: Returns an indication of the class of *x*.
pt_br: Retorna uma indicação da classe de *x*.

source: Plus corresponds to the unary prefix plus operator in Python. This operation applies the context precision and rounding, so it is *not* an identity operation.
pt_br: Plus corresponde ao operador de soma de prefixo unário no Python. Esta operação aplica a precisão e o arredondamento do contexto, portanto *não* é uma operação de identidade.

source: Return ``x`` to the power of ``y``, reduced modulo ``modulo`` if given.
pt_br: Retorna ``x`` à potência de ``y``, com a redução de módulo ``modulo`` se fornecido.

source: With two arguments, compute ``x**y``. If ``x`` is negative then ``y`` must be integral. The result will be inexact unless ``y`` is integral and the result is finite and can be expressed exactly in 'precision' digits. The rounding mode of the context is used. Results are always correctly rounded in the Python version.
pt_br: Com dois argumentos, calcula ``x**y``. Se ``x`` for negativo, ``y`` deve ser inteiro. O resultado será inexato, a menos que ``y`` seja inteiro e o resultado seja finito e possa ser expresso exatamente em "precisão" dígitos. O modo de arredondamento do contexto é usado. Os resultados são sempre arredondados corretamente na versão Python.

source: ``Decimal(0) ** Decimal(0)`` results in ``InvalidOperation``, and if ``InvalidOperation`` is not trapped, then results in ``Decimal('NaN')``.
pt_br: ``Decimal(0) ** Decimal(0)`` resulta em ``InvalidOperation``, e se ``InvalidOperation`` não for capturado, resulta em ``Decimal('NaN')``.

source: The C module computes :meth:`power` in terms of the correctly rounded :meth:`exp` and :meth:`ln` functions. The result is well-defined but only "almost always correctly rounded".
pt_br: O módulo C calcula :meth:`power` em termos das funções corretamente arredondadas :meth:`exp` e :meth:`ln`. O resultado é bem definido, mas apenas "quase sempre corretamente arredondado".

source: With three arguments, compute ``(x**y) % modulo``. For the three argument form, the following restrictions on the arguments hold:
pt_br: Com três argumentos, calcula ``(x**y) % modulo``. Para o formulário de três argumentos, as seguintes restrições nos argumentos são válidas:

source: all three arguments must be integral
pt_br: todos os três argumentos devem ser inteiros

source: ``y`` must be nonnegative
pt_br: ``y`` não pode ser negativo

source: at least one of ``x`` or ``y`` must be nonzero
pt_br: pelo menos um de ``x`` ou ``y`` não pode ser negativo

source: ``modulo`` must be nonzero and have at most 'precision' digits
pt_br: ``modulo`` não pode ser zero e deve ter pelo menos "precisão" dígitos

source: The value resulting from ``Context.power(x, y, modulo)`` is equal to the value that would be obtained by computing ``(x**y) % modulo`` with unbounded precision, but is computed more efficiently. The exponent of the result is zero, regardless of the exponents of ``x``, ``y`` and ``modulo``. The result is always exact.
pt_br: O valor resultante de ``Context.power(x, y, modulo)`` é igual ao valor que seria obtido ao computar ``(x**y) % modulo`` com precisão ilimitada, mas é calculado com mais eficiência . O expoente do resultado é zero, independentemente dos expoentes de ``x``, ``y`` e ``modulo``. O resultado é sempre exato.

source: Returns a value equal to *x* (rounded), having the exponent of *y*.
pt_br: Retorna um valor igual a *x* (arredondado), com o expoente de *y*.

source: Just returns 10, as this is Decimal, :)
pt_br: Só retorna 10, já que isso é Decimal, :)

source: Returns the remainder from integer division.
pt_br: Retorna o resto da divisão inteira.

source: The sign of the result, if non-zero, is the same as that of the original dividend.
pt_br: O sinal do resultado, se diferente de zero, é o mesmo que o do dividendo original.

source: Returns ``x - y * n``, where *n* is the integer nearest the exact value of ``x / y`` (if the result is 0 then its sign will be the sign of *x*).
pt_br: Retorna ``x - y * n``, onde *n* é o número inteiro mais próximo do valor exato de ``x / y`` (se o resultado for 0, seu sinal será o sinal de *x*).

source: Returns a rotated copy of *x*, *y* times.
pt_br: Retorna uma cópia re de *x*, *y* vezes.

source: Returns ``True`` if the two operands have the same exponent.
pt_br: Retorna ``True`` se os dois operandos tiverem o mesmo expoente.

source: Returns the first operand after adding the second value its exp.
pt_br: Retorna o primeiro operando após adicionar o segundo valor seu exp.

source: Returns a shifted copy of *x*, *y* times.
pt_br: Retorna uma cópia deslocada de *x*, *y* vezes.

source: Square root of a non-negative number to context precision.
pt_br: Raiz quadrada de um número não negativo para precisão do contexto.

source: Return the difference between *x* and *y*.
pt_br: Retorna a diferença entre *x* e *y*.

source: Rounds to an integer.
pt_br: Arredonda para um número inteiro.

source: Converts a number to a string using scientific notation.
pt_br: Converte um número em uma string usando notação científica.

source: Constants
pt_br: Constantes

source: The constants in this section are only relevant for the C module. They are also included in the pure Python version for compatibility.
pt_br: As constantes nesta seção são relevantes apenas para o módulo C. Eles também estão incluídos na versão pura do Python para compatibilidade.

source: 32-bit
pt_br: 32 bits

source: 64-bit
pt_br: 64 bits

source: The value is ``True``. Deprecated, because Python now always has threads.
pt_br: O valor é ``True``. Descontinuado porque o Python agora sempre tem threads.

source: The default value is ``True``. If Python is :option:`configured using the --without-decimal-contextvar option <--without-decimal-contextvar>`, the C version uses a thread-local rather than a coroutine-local context and the value is ``False``. This is slightly faster in some nested context scenarios.
pt_br: O valor padrão é ``True``. Se o Python for :option:`configurado usando a opção --without-decimal-contextvar <--without-decimal-contextvar>`, a versão C usará um contexto local de thread em vez de local de corrotina e o valor será ``False``. Isso é um pouco mais rápido em alguns cenários de contexto aninhados.

source: Rounding modes
pt_br: Modos de arredondamento

source: Round towards ``Infinity``.
pt_br: Arredonda para ``Infinity``.

source: Round towards zero.
pt_br: Arredonda para zero.

source: Round towards ``-Infinity``.
pt_br: Arredonda para ``-Infinity``.

source: Round to nearest with ties going towards zero.
pt_br: Arrendonda para o mais próximo com empates tendendo a zero.

source: Round to nearest with ties going to nearest even integer.
pt_br: Arredonda para o mais próximo com empates indo para o mais próximo inteiro par.

source: Round to nearest with ties going away from zero.
pt_br: Arrendonda para o mais próximo com empates se afastando de zero.

source: Round away from zero.
pt_br: Arredonda se afastando de zero.

source: Round away from zero if last digit after rounding towards zero would have been 0 or 5; otherwise round towards zero.
pt_br: Arredonda se afastando de zero se o último dígito após o arredondamento para zero fosse 0 ou 5; caso contrário, arredonda para zero.

source: Signals
pt_br: Sinais

source: Signals represent conditions that arise during computation. Each corresponds to one context flag and one context trap enabler.
pt_br: Sinais representam condições que surgem durante o cálculo. Cada um corresponde a um sinalizador de contexto e um ativador de armadilha de contexto.

source: The context flag is set whenever the condition is encountered. After the computation, flags may be checked for informational purposes (for instance, to determine whether a computation was exact). After checking the flags, be sure to clear all flags before starting the next computation.
pt_br: O sinalizador de contexto é definido sempre que a condição é encontrada. Após o cálculo, os sinalizadores podem ser verificados para fins informativos (por exemplo, para determinar se um cálculo era exato). Depois de verificar os sinalizadores, certifique-se de limpar todos os sinalizadores antes de iniciar o próximo cálculo.

source: If the context's trap enabler is set for the signal, then the condition causes a Python exception to be raised. For example, if the :class:`DivisionByZero` trap is set, then a :exc:`DivisionByZero` exception is raised upon encountering the condition.
pt_br: Se o ativador de armadilha de contexto estiver definido para o sinal, a condição fará com que uma exceção Python seja levantada. Por exemplo, se a armadilha :class:`DivisionByZero` for configurada, uma exceção :exc:`DivisionByZero` será levantada ao encontrar a condição.

source: Altered an exponent to fit representation constraints.
pt_br: Altera um expoente para ajustar as restrições de representação.

source: Typically, clamping occurs when an exponent falls outside the context's :attr:`~Context.Emin` and :attr:`~Context.Emax` limits. If possible, the exponent is reduced to fit by adding zeros to the coefficient.
pt_br: Normalmente, *clamping* ocorre quando um expoente fica fora dos limites do contexto :attr:`~Context.Emin` e :attr:`~Context.Emax`. Se possível, o expoente é reduzido para caber adicionando zeros ao coeficiente.

source: Base class for other signals and a subclass of :exc:`ArithmeticError`.
pt_br: Classe base para outros sinais e uma subclasse de :exc:`ArithmeticError`.

source: Signals the division of a non-infinite number by zero.
pt_br: Sinaliza a divisão de um número não infinito por zero.

source: Can occur with division, modulo division, or when raising a number to a negative power. If this signal is not trapped, returns ``Infinity`` or ``-Infinity`` with the sign determined by the inputs to the calculation.
pt_br: Pode ocorrer com divisão, divisão de módulo ou ao elevar um número a uma potência negativa. Se este sinal não for capturado, retornará ``Infinity`` ou ``-Infinity`` com o sinal determinado pelas entradas do cálculo.

source: Indicates that rounding occurred and the result is not exact.
pt_br: Indica que o arredondamento ocorreu e o resultado não é exato.

source: Signals when non-zero digits were discarded during rounding. The rounded result is returned. The signal flag or trap is used to detect when results are inexact.
pt_br: Sinaliza quando dígitos diferentes de zero foram descartados durante o arredondamento. O resultado arredondado é retornado. O sinalizador ou armadilha de sinal é usado para detectar quando os resultados são inexatos.

source: An invalid operation was performed.
pt_br: Uma operação inválida foi realizada.

source: Indicates that an operation was requested that does not make sense. If not trapped, returns ``NaN``. Possible causes include::
pt_br: Indica que uma operação foi solicitada que não faz sentido. Se não for capturado, retorna ``NaN``. As possíveis causas incluem::

source: Numerical overflow.
pt_br: Estouro numérico.

source: Indicates the exponent is larger than :attr:`Context.Emax` after rounding has occurred. If not trapped, the result depends on the rounding mode, either pulling inward to the largest representable finite number or rounding outward to ``Infinity``. In either case, :class:`Inexact` and :class:`Rounded` are also signaled.
pt_br: Indica que o expoente é maior que :attr:`Context.Emax` após o arredondamento ocorrer. Se não for capturado, o resultado depende do modo de arredondamento, puxando para dentro para o maior número finito representável ou arredondando para fora para ``Infinity``. Nos dois casos, :class:`Inexact` e :class:`Rounded` também são sinalizados.

source: Rounding occurred though possibly no information was lost.
pt_br: O arredondamento ocorreu, embora possivelmente nenhuma informação tenha sido perdida.

source: Signaled whenever rounding discards digits; even if those digits are zero (such as rounding ``5.00`` to ``5.0``). If not trapped, returns the result unchanged. This signal is used to detect loss of significant digits.
pt_br: Sinalizado sempre que o arredondamento descarta dígitos; mesmo que esses dígitos sejam zero (como arredondamento ``5.00`` a ``5.0``). Se não for capturado, retorna o resultado inalterado. Este sinal é usado para detectar a perda de dígitos significativos.

source: Exponent was lower than :attr:`~Context.Emin` prior to rounding.
pt_br: O expoente foi menor que :attr:`~Context.Emin` antes do arredondamento.

source: Occurs when an operation result is subnormal (the exponent is too small). If not trapped, returns the result unchanged.
pt_br: Ocorre quando um resultado da operação é subnormal (o expoente é muito pequeno). Se não for capturado, retorna o resultado inalterado.

source: Numerical underflow with result rounded to zero.
pt_br: Estouro negativo numérico com resultado arredondado para zero.

source: Occurs when a subnormal result is pushed to zero by rounding. :class:`Inexact` and :class:`Subnormal` are also signaled.
pt_br: Ocorre quando um resultado subnormal é empurrado para zero arredondando. :class:`Inexact` e :class:`Subnormal` também são sinalizados.

source: Enable stricter semantics for mixing floats and Decimals.
pt_br: Ativa semânticas mais rigorosas para misturar objetos de float com de Decimal.

source: If the signal is not trapped (default), mixing floats and Decimals is permitted in the :class:`~decimal.Decimal` constructor, :meth:`~decimal.Context.create_decimal` and all comparison operators. Both conversion and comparisons are exact. Any occurrence of a mixed operation is silently recorded by setting :exc:`FloatOperation` in the context flags. Explicit conversions with :meth:`~decimal.Decimal.from_float` or :meth:`~decimal.Context.create_decimal_from_float` do not set the flag.
pt_br: Se o sinal não for capturado (padrão), a mistura de tipos float e Decimal será permitida no construtor :class:`~decimal.Decimal`, :meth:`~decimal.Context.create_decimal` e em todos os operadores de comparação. Tanto a conversão quanto as comparações são exatas. Qualquer ocorrência de uma operação mista é registrada silenciosamente pela configuração :exc:`FloatOperation` nos sinalizadores de contexto. Conversões explícitas com :meth:`~decimal.Decimal.from_float` ou :meth:`~decimal.Context.create_decimal_from_float` não definem o sinalizador.

source: Otherwise (the signal is trapped), only equality comparisons and explicit conversions are silent. All other mixed operations raise :exc:`FloatOperation`.
pt_br: Caso contrário (o sinal é capturado), apenas comparações de igualdade e conversões explícitas são silenciosas. Todas as outras operações mistas levantam :exc:`FloatOperation`.

source: The following table summarizes the hierarchy of signals::
pt_br: A tabela a seguir resume a hierarquia de sinais::

source: Floating-point notes
pt_br: Observações sobre ponto flutuante

source: Mitigating round-off error with increased precision
pt_br: Atenuando o erro de arredondamento com maior precisão

source: The use of decimal floating point eliminates decimal representation error (making it possible to represent ``0.1`` exactly); however, some operations can still incur round-off error when non-zero digits exceed the fixed precision.
pt_br: O uso do ponto flutuante decimal elimina o erro de representação decimal (possibilitando representar ``0.1`` de forma exata); no entanto, algumas operações ainda podem sofrer erros de arredondamento quando dígitos diferentes de zero excederem a precisão fixa.

source: The effects of round-off error can be amplified by the addition or subtraction of nearly offsetting quantities resulting in loss of significance. Knuth provides two instructive examples where rounded floating-point arithmetic with insufficient precision causes the breakdown of the associative and distributive properties of addition:
pt_br: Os efeitos do erro de arredondamento podem ser amplificados pela adição ou subtração de quantidades quase compensadoras, resultando em perda de significância. Knuth fornece dois exemplos instrutivos em que a aritmética de ponto flutuante arredondado com precisão insuficiente causa a quebra das propriedades associativas e distributivas da adição:

source: # Examples from Seminumerical Algorithms, Section 4.2.2. >>> from decimal import Decimal, getcontext >>> getcontext().prec = 8 >>> u, v, w = Decimal(11111113), Decimal(-11111111), Decimal('7.51111111') >>> (u + v) + w Decimal('9.5111111') >>> u + (v + w) Decimal('10') >>> u, v, w = Decimal(20000), Decimal(-6), Decimal('6.0000003') >>> (u*v) + (u*w) Decimal('0.01') >>> u * (v+w) Decimal('0.0060000')
pt_br: # exemplos de Seminumerical Algorithms, Section 4.2.2. >>> from decimal import Decimal, getcontext >>> getcontext().prec = 8 >>> u, v, w = Decimal(11111113), Decimal(-11111111), Decimal('7.51111111') >>> (u + v) + w Decimal('9.5111111') >>> u + (v + w) Decimal('10') >>> u, v, w = Decimal(20000), Decimal(-6), Decimal('6.0000003') >>> (u*v) + (u*w) Decimal('0.01') >>> u * (v+w) Decimal('0.0060000')

source: The :mod:`decimal` module makes it possible to restore the identities by expanding the precision sufficiently to avoid loss of significance:
pt_br: O módulo :mod:`decimal` permite restaurar as identidades expandindo a precisão o suficiente para evitar perda de significância:

source: Special values
pt_br: Valores especiais

source: The number system for the :mod:`decimal` module provides special values including ``NaN``, ``sNaN``, ``-Infinity``, ``Infinity``, and two zeros, ``+0`` and ``-0``.
pt_br: O sistema numérico para o módulo :mod:`decimal` fornece valores especiais, incluindo ``NaN``, ``sNaN``, ``-Infinity``, ``Infinity``, e dois zeros, ``+0`` e ``-0``.
