Repository: python/python-docs-pt-br
Catalog: library/decimal.po
Languages: pt_br

source: Return the first operand with exponent adjusted by the second. Equivalently, return the first operand multiplied by ``10**other``. The second operand must be an integer.
pt_br: Retorna o primeiro operando com o expoente ajustado pelo segundo. Da mesma forma, retorna o primeiro operando multiplicado por ``10**other``. O segundo operando deve ser um número inteiro.

source: Return the result of shifting the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to shift. If the second operand is positive then the shift is to the left; otherwise the shift is to the right. Digits shifted into the coefficient are zeros. The sign and exponent of the first operand are unchanged.
pt_br: Retorna o resultado da troca dos dígitos do primeiro operando em uma quantidade especificada pelo segundo operando. O segundo operando deve ser um número inteiro no intervalo - precisão através da precisão. O valor absoluto do segundo operando fornece o número de locais a serem deslocados. Se o segundo operando for positivo, o deslocamento será para a esquerda; caso contrário, a mudança é para a direita. Os dígitos deslocados para o coeficiente são zeros. O sinal e o expoente do primeiro operando não são alterados.

source: Return the square root of the argument to full precision.
pt_br: Retorna a raiz quadrada do argumento para a precisão total.

source: Convert to a string, using engineering notation if an exponent is needed.
pt_br: Converte em uma string, usando notação de engenharia, se for necessário um expoente.

source: Engineering notation has an exponent which is a multiple of 3. This can leave up to 3 digits to the left of the decimal place and may require the addition of either one or two trailing zeros.
pt_br: A notação de engenharia possui um expoente que é múltiplo de 3. Isso pode deixar até 3 dígitos à esquerda da casa decimal e pode exigir a adição de um ou dois zeros à direita.

source: For example, this converts ``Decimal('123E+1')`` to ``Decimal('1.23E+3')``.
pt_br: Por exemplo, isso converte ``Decimal('123E+1')`` para ``Decimal('1.23E+3')``.

source: Identical to the :meth:`to_integral_value` method. The ``to_integral`` name has been kept for compatibility with older versions.
pt_br: Idêntico ao método :meth:`to_integral_value`. O nome ``to_integral`` foi mantido para compatibilidade com versões mais antigas.

source: Round to the nearest integer, signaling :const:`Inexact` or :const:`Rounded` as appropriate if rounding occurs. The rounding mode is determined by the ``rounding`` parameter if given, else by the given ``context``. If neither parameter is given then the rounding mode of the current context is used.
pt_br: Arredonda para o número inteiro mais próximo, sinalizando :const:`Inexact` ou :const:`Rounded`, conforme apropriado, se o arredondamento ocorrer. O modo de arredondamento é determinado pelo parâmetro ``rounding``, se fornecido, ou pelo ``context`` especificado. Se nenhum parâmetro for fornecido, o modo de arredondamento do contexto atual será usado.

source: Round to the nearest integer without signaling :const:`Inexact` or :const:`Rounded`. If given, applies *rounding*; otherwise, uses the rounding method in either the supplied *context* or the current context.
pt_br: Arredonda para o número inteiro mais próximo sem sinalizar :const:`Inexact` ou :const:`Rounding`. Se fornecido, aplica *rounding*; caso contrário, usa o método de arredondamento no *context* especificado ou no contexto atual.

source: Decimal numbers can be rounded using the :func:`.round` function:
pt_br: Os números decimais podem ser arredondados usando a função :func:`.round`:

source: If *ndigits* is not given or ``None``, returns the nearest :class:`int` to *number*, rounding ties to even, and ignoring the rounding mode of the :class:`Decimal` context. Raises :exc:`OverflowError` if *number* is an infinity or :exc:`ValueError` if it is a (quiet or signaling) NaN.
pt_br: Se *ndigits* não for fornecido ou ``None``, retorna o :class:`int` de *number* mais próximo, arredondando até chegar em par, e ignorando o modo de arredondamento do contexto :class:`Decimal`. Levanta :exc:`OverflowError` se *number* for um infinito ou :exc:`ValueError` se for um NaN (silencioso ou de sinalização).

source: If *ndigits* is an :class:`int`, the context's rounding mode is respected and a :class:`Decimal` representing *number* rounded to the nearest multiple of ``Decimal('1E-ndigits')`` is returned; in this case, ``round(number, ndigits)`` is equivalent to ``self.quantize(Decimal('1E-ndigits'))``. Returns ``Decimal('NaN')`` if *number* is a quiet NaN. Raises :class:`InvalidOperation` if *number* is an infinity, a signaling NaN, or if the length of the coefficient after the quantize operation would be greater than the current context's precision. In other words, for the non-corner cases:
pt_br: Se *ndigits* for um :class:`int`, o modo de arredondamento do contexto é respeitado e um :class:`Decimal` representando *número* arredondado para o múltiplo mais próximo de ``Decimal('1E-ndigits')`` é retornado; neste caso, ``round(number, ndigits)`` é equivalente a ``self.quantize(Decimal('1E-ndigits'))``. Retorna ``Decimal('NaN')`` se *number* for um NaN silencioso. Levanta :class:`InvalidOperation` se *number* for um infinito, uma sinalização NaN, ou se o comprimento do coeficiente após a operação de quantização for maior que a precisão do contexto atual. Em outras palavras, para os situações comuns:

source: if *ndigits* is positive, return *number* rounded to *ndigits* decimal places;
pt_br: se *ndigits* for positivo, retorna *number* arredondado para *ndigits* casas decimais;

source: if *ndigits* is zero, return *number* rounded to the nearest integer;
pt_br: se *ndigits* for zero, retorna *number* arredondado para o número inteiro mais próximo;

source: if *ndigits* is negative, return *number* rounded to the nearest multiple of ``10**abs(ndigits)``.
pt_br: se *ndigits* for negativo, retorna *number* arredondado para o múltiplo mais próximo de ``10**abs(ndigits)``.

source: For example::
pt_br: Por exemplo::

source: >>> from decimal import Decimal, getcontext, ROUND_DOWN >>> getcontext().rounding = ROUND_DOWN >>> round(Decimal('3.75')) # context rounding ignored 4 >>> round(Decimal('3.5')) # round-ties-to-even 4 >>> round(Decimal('3.75'), 0) # uses the context rounding Decimal('3') >>> round(Decimal('3.75'), 1) Decimal('3.7') >>> round(Decimal('3.75'), -1) Decimal('0E+1')
pt_br: >>> from decimal import Decimal, getcontext, ROUND_DOWN >>> getcontext().rounding = ROUND_DOWN >>> round(Decimal('3.75')) # arredondamento de contexto ignorado 4 >>> round(Decimal('3.5')) # arredondamento para par mais próximo 4 >>> round(Decimal('3.75'), 0) # usa o arredondamento de contexto Decimal('3') >>> round(Decimal('3.75'), 1) Decimal('3.7') >>> round(Decimal('3.75'), -1) Decimal('0E+1')

source: Logical operands
pt_br: Operandos lógicos

source: The :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or`, and :meth:`~Decimal.logical_xor` methods expect their arguments to be *logical operands*. A *logical operand* is a :class:`Decimal` instance whose exponent and sign are both zero, and whose digits are all either ``0`` or ``1``.
pt_br: Os métodos :meth:`~Decimal.logical_and`, :meth:`~Decimal.logical_invert`, :meth:`~Decimal.logical_or` e :meth:`~Decimal.logical_xor` esperam que seus argumentos sejam *operandos lógicos*. Um *operando lógico* é uma instância de :class:`Decimal` cujo expoente e sinal são zero e cujos dígitos são todos ``0`` ou ``1``.

source: Context objects
pt_br: Objetos de contexto

source: Contexts are environments for arithmetic operations. They govern precision, set rules for rounding, determine which signals are treated as exceptions, and limit the range for exponents.
pt_br: Contextos são ambientes para operações aritméticas. Eles governam a precisão, estabelecem regras para arredondamento, determinam quais sinais são tratados como exceções e limitam o intervalo dos expoentes.

source: Each thread has its own current context which is accessed or changed using the :func:`getcontext` and :func:`setcontext` functions:
pt_br: Cada thread possui seu próprio contexto atual que é acessado ou alterado usando as funções :func:`getcontext` e :func:`setcontext`:

source: Return the current context for the active thread.
pt_br: Retorna o contexto atual para a thread ativa.

source: Set the current context for the active thread to *c*.
pt_br: Define o contexto atual para a thread ativa como *C*.

source: You can also use the :keyword:`with` statement and the :func:`localcontext` function to temporarily change the active context.
pt_br: Você também pode usar a instrução :keyword:`with` e a função :func:`localcontext` para alterar temporariamente o contexto ativo.

source: Return a context manager that will set the current context for the active thread to a copy of *ctx* on entry to the with-statement and restore the previous context when exiting the with-statement. If no context is specified, a copy of the current context is used. The *kwargs* argument is used to set the attributes of the new context.
pt_br: Retorna um gerenciador de contexto que vai definir o contexto atual da thread ativa para uma cópia de *ctx* na entrada da instrução "with" e restaurar o contexto anterior ao sair da instrução "with". Se nenhum contexto for especificado, uma cópia do contexto atual será usada. O argumento *kwargs* é usado para definir os atributos do novo contexto.

source: For example, the following code sets the current decimal precision to 42 places, performs a calculation, and then automatically restores the previous context::
pt_br: Por exemplo, o código a seguir define a precisão decimal atual para 42 casas, executa um cálculo e restaura automaticamente o contexto anterior::

source: from decimal import localcontext with localcontext() as ctx: ctx.prec = 42 # Perform a high precision calculation s = calculate_something() s = +s # Round the final result back to the default precision
pt_br: from decimal import localcontext with localcontext() as ctx: ctx.prec = 42 # Efetua um cálculo de alta precisão s = calculate_something() s = +s # Arredonda o resultado final de volta para a precisão padrão

source: Using keyword arguments, the code would be the following::
pt_br: Usando argumentos nomeados, o código seria o seguinte::

source: Raises :exc:`TypeError` if *kwargs* supplies an attribute that :class:`Context` doesn't support. Raises either :exc:`TypeError` or :exc:`ValueError` if *kwargs* supplies an invalid value for an attribute.
pt_br: Levanta :exc:`TypeError` se *kwargs* fornecer um atributo que :class:`Context` não oferecer suporte. Levanta :exc:`TypeError` ou :exc:`ValueError` se *kwargs* fornecer um valor inválido para um atributo.

source: :meth:`localcontext` now supports setting context attributes through the use of keyword arguments.
pt_br: :meth:`localcontext` agora tem suporte à configuração de atributos de contexto através do uso de argumentos nomeados.

source: Return a context object initialized to the proper values for one of the IEEE interchange formats. The argument must be a multiple of 32 and less than :const:`IEEE_CONTEXT_MAX_BITS`.
pt_br: Retorna um objeto de contexto inicializado com os valores apropriados para um dos formatos de intercâmbio IEEE. O argumento deve ser um múltiplo de 32 e menor que :const:`IEEE_CONTEXT_MAX_BITS`.

source: New contexts can also be created using the :class:`Context` constructor described below. In addition, the module provides three pre-made contexts:
pt_br: Novos contextos também podem ser criados usando o construtor :class:`Context` descrito abaixo. Além disso, o módulo fornece três contextos pré-criados::

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_UP`. All flags are cleared. All traps are enabled (treated as exceptions) except :const:`Inexact`, :const:`Rounded`, and :const:`Subnormal`.
pt_br: Este é um contexto padrão definido pela Especificação Aritmética Decimal Geral. A precisão está definida como nove. O arredondamento está definido como :const:`ROUND_HALF_UP`. Todos os sinalizadores estão limpos. Todos as armadilhas estão ativadas (tratadas como exceções), exceto por :const:`Inexact`, :const:`Rounded` e :const:`Subnormal`.

source: Because many of the traps are enabled, this context is useful for debugging.
pt_br: Como muitas das armadilhas estão ativadas, esse contexto é útil para depuração.

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_EVEN`. All flags are cleared. No traps are enabled (so that exceptions are not raised during computations).
pt_br: Este é um contexto padrão definido pela Especificação Aritmética Decimal Geral. A precisão está definida como nove. O arredondamento está definido como :const:`ROUND_HALF_EVEN`. Todos os sinalizadores estão limpos. Nenhuma armadilha está ativada (de forma que exceções não são levantadas durante os cálculos).

source: Because the traps are disabled, this context is useful for applications that prefer to have result value of ``NaN`` or ``Infinity`` instead of raising exceptions. This allows an application to complete a run in the presence of conditions that would otherwise halt the program.
pt_br: Como as armadilhas estão desativadas, esse contexto é útil para aplicativos que preferem ter o valor de resultado de ``NaN`` ou ``Infinity`` em vez de levantar exceções. Isso permite que uma aplicação conclua uma execução na presença de condições que interromperiam o programa.

source: This context is used by the :class:`Context` constructor as a prototype for new contexts. Changing a field (such a precision) has the effect of changing the default for new contexts created by the :class:`Context` constructor.
pt_br: Este contexto é usado pelo construtor :class:`Context` como um protótipo para novos contextos. Alterar um campo (tal como precisão) tem o efeito de alterar o padrão para novos contextos criados pelo construtor :class:`Context`.

source: This context is most useful in multi-threaded environments. Changing one of the fields before threads are started has the effect of setting system-wide defaults. Changing the fields after threads have started is not recommended as it would require thread synchronization to prevent race conditions.
pt_br: Esse contexto é mais útil em ambientes multithread. A alteração de um dos campos antes do início das threads tem o efeito de definir os padrões para todo o sistema. Não é recomendável alterar os campos após o início das threads, pois exigiria sincronização de threads para evitar condições de corrida.

source: In single threaded environments, it is preferable to not use this context at all. Instead, simply create contexts explicitly as described below.
pt_br: Em ambientes de thread única, é preferível não usar esse contexto. Em vez disso, basta criar contextos explicitamente, conforme descrito abaixo.

source: The default values are :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN`, and enabled traps for :class:`Overflow`, :class:`InvalidOperation`, and :class:`DivisionByZero`.
pt_br: Os valores padrão são :attr:`Context.prec`\ =\ ``28``, :attr:`Context.rounding`\ =\ :const:`ROUND_HALF_EVEN` e armadilhas ativadas para :class:`Overflow`, :class:`InvalidOperation` e :class:`DivisionByZero`.

source: In addition to the three supplied contexts, new contexts can be created with the :class:`Context` constructor.
pt_br: Além dos três contextos fornecidos, novos contextos podem ser criados com o construtor :class:`Context`.

source: Creates a new context. If a field is not specified or is :const:`None`, the default values are copied from the :const:`DefaultContext`. If the *flags* field is not specified or is :const:`None`, all flags are cleared.
pt_br: Cria um novo contexto. Se um campo não for especificado ou for :const:`None`, os valores padrão serão copiados de :const:`DefaultContext`. Se o campo *flags* não for especificado ou for :const:`None`, todos os sinalizadores serão limpados.

source: An integer in the range [``1``, :const:`MAX_PREC`] that sets the precision for arithmetic operations in the context.
pt_br: Um inteiro no intervalo [``1``, :const:`MAX_PREC`] que define a precisão para operações aritméticas no contexto.

source: One of the constants listed in the section `Rounding Modes`_.
pt_br: Uma das constantes listadas na seção `Modos de arredondamento`_.

source: Lists of any signals to be set. Generally, new contexts should only set traps and leave the flags clear.
pt_br: Listas de todos os sinais a serem configurados. Geralmente, novos contextos devem apenas definir armadilhas e deixar os sinalizadores limpos.

source: Integers specifying the outer limits allowable for exponents. *Emin* must be in the range [:const:`MIN_EMIN`, ``0``], *Emax* in the range [``0``, :const:`MAX_EMAX`].
pt_br: Números inteiros que especificam os limites externos permitidos para expoentes. *Emin* deve estar no intervalo [:const:`MIN_EMIN`, ``0``], *Emax* no intervalo [``0``, :const:`MAX_EMAX`].

source: Either ``0`` or ``1`` (the default). If set to ``1``, exponents are printed with a capital ``E``; otherwise, a lowercase ``e`` is used: ``Decimal('6.02e+23')``.
pt_br: Assume ``0`` ou ``1`` (o padrão). Se definido como ``1``, os expoentes serão impressos com um ``E`` maiúsculo; caso contrário, um ``e`` minúsculo é usado: ``Decimal('6.02e+23')``.

source: Either ``0`` (the default) or ``1``. If set to ``1``, the exponent ``e`` of a :class:`Decimal` instance representable in this context is strictly limited to the range ``Emin - prec + 1 <= e <= Emax - prec + 1``. If *clamp* is ``0`` then a weaker condition holds: the adjusted exponent of the :class:`Decimal` instance is at most :attr:`~Context.Emax`. When *clamp* is ``1``, a large normal number will, where possible, have its exponent reduced and a corresponding number of zeros added to its coefficient, in order to fit the exponent constraints; this preserves the value of the number but loses information about significant trailing zeros. For example::
pt_br: Assume ``0`` (o padrão) ou ``1``. Se definido como ``1``, o expoente ``e`` de uma instância de :class:`Decimal` representável nesse contexto é estritamente limitado ao intervalo ``Emin - prec + 1 <= e <= Emax - prec + 1``. Se *clamp* for ``0``, uma condição mais fraca será mantida: o expoente ajustado da instância de :class:`Decimal` é no máximo :attr:`~Context.Emax`. Quando *clamp* é ``1``, um grande número normal terá, sempre que possível, seu expoente reduzido e um número correspondente de zeros adicionado ao seu coeficiente, para ajustar as restrições do expoente; isso preserva o valor do número, mas perde informações sobre zeros à direita significativos. Por exemplo::

source: A *clamp* value of ``1`` allows compatibility with the fixed-width decimal interchange formats specified in IEEE 754.
pt_br: Um valor de *clamp* de ``1`` permite compatibilidade com os formatos de intercâmbio decimal de largura fixa especificados na IEEE 754.

source: The :class:`Context` class defines several general purpose methods as well as a large number of methods for doing arithmetic directly in a given context. In addition, for each of the :class:`Decimal` methods described above (with the exception of the :meth:`~Decimal.adjusted` and :meth:`~Decimal.as_tuple` methods) there is a corresponding :class:`Context` method. For example, for a :class:`Context` instance ``C`` and :class:`Decimal` instance ``x``, ``C.exp(x)`` is equivalent to ``x.exp(context=C)``. Each :class:`Context` method accepts a Python integer (an instance of :class:`int`) anywhere that a Decimal instance is accepted.
pt_br: A classe :class:`Context` define vários métodos de uso geral, bem como um grande número de métodos para fazer aritmética diretamente em um determinado contexto. Além disso, para cada um dos métodos de :class:`Decimal` descritos acima (com exceção dos métodos :meth:`~Decimal.adjusted` e :meth:`~Decimal.as_tuple`) existe um método correspondente em :class:`Context`. Por exemplo, para uma instância ``C`` de :class:`Context` e uma instância ``x`` de :class:`Decimal`, ``C.exp(x)`` é equivalente a ``x.exp(context=C)``. Cada método de :class:`Context` aceita um número inteiro do Python (uma instância de :class:`int`) em qualquer lugar em que uma instância de Decimal seja aceita.

source: Resets all of the flags to ``0``.
pt_br: Redefine todos os sinalizadores para ``0``.

source: Resets all of the traps to ``0``.
pt_br: Redefine todas as armadilhas para ``0``.

source: Return a duplicate of the context.
pt_br: Retorna uma duplicata do contexto.

source: Return a copy of the Decimal instance num.
pt_br: Retorna uma cópia da instância de Decimal *num*.

source: Creates a new Decimal instance from *num* but using *self* as context. Unlike the :class:`Decimal` constructor, the context precision, rounding method, flags, and traps are applied to the conversion.
pt_br: Cria uma nova instância decimal a partir de *num*, mas usando *self* como contexto. Diferentemente do construtor de :class:`Decimal`, a precisão do contexto, o método de arredondamento, os sinalizadores e as armadilhas são aplicadas à conversão.

source: This is useful because constants are often given to a greater precision than is needed by the application. Another benefit is that rounding immediately eliminates unintended effects from digits beyond the current precision. In the following example, using unrounded inputs means that adding zero to a sum can change the result:
pt_br: Isso é útil porque as constantes geralmente são fornecidas com uma precisão maior do que a necessária pela aplicação. Outro benefício é que o arredondamento elimina imediatamente os efeitos indesejados dos dígitos além da precisão atual. No exemplo a seguir, o uso de entradas não arredondadas significa que adicionar zero a uma soma pode alterar o resultado:

source: This method implements the to-number operation of the IBM specification. If the argument is a string, no leading or trailing whitespace or underscores are permitted.
pt_br: Este método implementa a operação "to-number" da especificação IBM. Se o argumento for uma string, nenhum espaço em branco à esquerda ou à direita ou sublinhado serão permitidos.

source: Creates a new Decimal instance from a float *f* but rounding using *self* as the context. Unlike the :meth:`Decimal.from_float` class method, the context precision, rounding method, flags, and traps are applied to the conversion.
pt_br: Cria uma nova instância de Decimal a partir de um ponto flutuante *f*, mas arredondando usando *self* como contexto. Diferentemente do método da classe :meth:`Decimal.from_float`, a precisão do contexto, o método de arredondamento, os sinalizadores e as armadilhas são aplicados à conversão.

source: Returns a value equal to ``Emin - prec + 1`` which is the minimum exponent value for subnormal results. When underflow occurs, the exponent is set to :const:`Etiny`.
pt_br: Retorna um valor igual a ``Emin - prec + 1``, que é o valor mínimo do expoente para resultados subnormais. Quando ocorre o estouro negativo, o expoente é definido como :const:`Etiny`.

source: Returns a value equal to ``Emax - prec + 1``.
pt_br: Retorna um valor igual a ``Emax - prec + 1``.
