Repository: python/python-docs-pt-br
Catalog: library/decimal.po
Languages: pt_br

source: Infinities can be constructed directly with: ``Decimal('Infinity')``. Also, they can arise from dividing by zero when the :exc:`DivisionByZero` signal is not trapped. Likewise, when the :exc:`Overflow` signal is not trapped, infinity can result from rounding beyond the limits of the largest representable number.
pt_br: Os infinitos podem ser construídos diretamente com: ``Decimal('Infinity')``. Além disso, eles podem resultar da divisão por zero quando o sinal :exc:`DivisionByZero` não é capturado. Da mesma forma, quando o sinal :exc:`Overflow` não é capturado, o infinito pode resultar do arredondamento além dos limites do maior número representável.

source: The infinities are signed (affine) and can be used in arithmetic operations where they get treated as very large, indeterminate numbers. For instance, adding a constant to infinity gives another infinite result.
pt_br: Os infinitos contêm sinais (afins) e podem ser usados em operações aritméticas, onde são tratados como números muito grandes e indeterminados. Por exemplo, adicionar uma constante ao infinito fornece outro resultado infinito.

source: Some operations are indeterminate and return ``NaN``, or if the :exc:`InvalidOperation` signal is trapped, raise an exception. For example, ``0/0`` returns ``NaN`` which means "not a number". This variety of ``NaN`` is quiet and, once created, will flow through other computations always resulting in another ``NaN``. This behavior can be useful for a series of computations that occasionally have missing inputs --- it allows the calculation to proceed while flagging specific results as invalid.
pt_br: Algumas operações são indeterminadas e retornam ``NaN`` ou, se o sinal :exc:`InvalidOperation` for capturado, levanta uma exceção. Por exemplo, ``0/0`` retorna ``NaN``, que significa "não é um número" em inglês. Esta variação de ``NaN`` é silenciosa e, uma vez criada, fluirá através de outros cálculos sempre resultando em outra ``NaN``. Esse comportamento pode ser útil para uma série de cálculos que ocasionalmente têm entradas ausentes --- ele permite que o cálculo continue enquanto sinaliza resultados específicos como inválidos.

source: A variant is ``sNaN`` which signals rather than remaining quiet after every operation. This is a useful return value when an invalid result needs to interrupt a calculation for special handling.
pt_br: Uma variante é ``sNaN``, que sinaliza em vez de permanecer em silêncio após cada operação. Esse é um valor de retorno útil quando um resultado inválido precisa interromper um cálculo para tratamento especial.

source: The behavior of Python's comparison operators can be a little surprising where a ``NaN`` is involved. A test for equality where one of the operands is a quiet or signaling ``NaN`` always returns :const:`False` (even when doing ``Decimal('NaN')==Decimal('NaN')``), while a test for inequality always returns :const:`True`. An attempt to compare two Decimals using any of the ``<``, ``<=``, ``>`` or ``>=`` operators will raise the :exc:`InvalidOperation` signal if either operand is a ``NaN``, and return :const:`False` if this signal is not trapped. Note that the General Decimal Arithmetic specification does not specify the behavior of direct comparisons; these rules for comparisons involving a ``NaN`` were taken from the IEEE 854 standard (see Table 3 in section 5.7). To ensure strict standards-compliance, use the :meth:`~Decimal.compare` and :meth:`~Decimal.compare_signal` methods instead.
pt_br: O comportamento dos operadores de comparação do Python pode ser um pouco surpreendente onde um ``NaN`` está envolvido. Um teste de igualdade em que um dos operandos é um ``NaN`` silencioso ou sinalizador sempre retorna :const:`False` (mesmo ao fazer ``Decimal('NaN')==Decimal('NaN')``), enquanto um teste de desigualdade sempre retorna :const:`True`. Uma tentativa de comparar dois decimais usando qualquer um dos operadores ``<``, ``<=``, ``>`` ou ``>=`` levantará o sinal :exc:`InvalidOperation` se um dos operandos for um ``NaN`` e retorna :const:`False` se esse sinal não for capturado. Observe que a especificação aritmética decimal geral não especifica o comportamento das comparações diretas; estas regras para comparações envolvendo a ``NaN`` foram retiradas do padrão IEEE 854 (consulte a Tabela 3 na seção 5.7). Para garantir uma rígida conformidade com os padrões, use os métodos :meth:`~Decimal.compare` e :meth:`~Decimal.compare_signal`.

source: The signed zeros can result from calculations that underflow. They keep the sign that would have resulted if the calculation had been carried out to greater precision. Since their magnitude is zero, both positive and negative zeros are treated as equal and their sign is informational.
pt_br: Os zeros com sinais podem resultar de cálculos insuficientes. Eles mantêm o sinal que teria resultado se o cálculo tivesse sido realizado com maior precisão. Como sua magnitude é zero, os zeros positivos e negativos são tratados como iguais e seu sinal é informacional.

source: In addition to the two signed zeros which are distinct yet equal, there are various representations of zero with differing precisions yet equivalent in value. This takes a bit of getting used to. For an eye accustomed to normalized floating-point representations, it is not immediately obvious that the following calculation returns a value equal to zero:
pt_br: Além dos dois zeros com sinais que são distintos e iguais, existem várias representações de zero com diferentes precisões e ainda com valor equivalente. Isso leva um pouco de tempo para se acostumar. Para um olho acostumado a representações de ponto flutuante normalizadas, não é imediatamente óbvio que o seguinte cálculo retorne um valor igual a zero:

source: Working with threads
pt_br: Trabalhando com threads

source: The :func:`getcontext` function accesses a different :class:`Context` object for each thread. Having separate thread contexts means that threads may make changes (such as ``getcontext().prec=10``) without interfering with other threads.
pt_br: A função :func:`getcontext` acessa um objeto :class:`Context` diferente para cada thread. Ter contextos de threads separadas significa que as threads podem fazer alterações (como ``getcontext().prec=10``) sem interferir em outras threads.

source: Likewise, the :func:`setcontext` function automatically assigns its target to the current thread.
pt_br: Da mesma forma, a função :func:`setcontext` atribui automaticamente seu alvo à thread atual.

source: If :func:`setcontext` has not been called before :func:`getcontext`, then :func:`getcontext` will automatically create a new context for use in the current thread. New context objects have default values set from the :data:`decimal.DefaultContext` object.
pt_br: Se :func:`setcontext` não tiver sido chamado antes de :func:`getcontext`, então :func:`getcontext` criará automaticamente um novo contexto para uso na thread atual. Novos objetos de contexto têm valores padrão definidos a partir do objeto :data:`decimal.DefaultContext`.

source: The :data:`sys.flags.thread_inherit_context` flag affects the context for new threads. If the flag is false, new threads will start with an empty context. In this case, :func:`getcontext` will create a new context object when called and use the default values from *DefaultContext*. If the flag is true, new threads will start with a copy of context from the caller of :meth:`threading.Thread.start`.
pt_br: O sinalizador :data:`sys.flags.thread_inherit_context` afeta o contexto de novas threads. Se o sinalizador for falso, as novas threads começarão com um contexto vazio. Nesse caso, :func:`getcontext` criará um novo objeto de contexto quando chamado e usará os valores padrão de *DefaultContext*. Se o sinalizador for verdadeiro, as novas threads começarão com uma cópia do contexto do chamador de :meth:`threading.Thread.start`.

source: To control the defaults so that each thread will use the same values throughout the application, directly modify the *DefaultContext* object. This should be done *before* any threads are started so that there won't be a race condition between threads calling :func:`getcontext`. For example::
pt_br: Para controlar os padrões para que cada thread, use os mesmos valores em toda a aplicação, modifique diretamente o objeto *DefaultContext*. Isso deve ser feito *antes* de qualquer thread ser iniciada, para que não haja uma condição de corrida entre as threads chamando :func:`getcontext`. Por exemplo::

source: # Set applicationwide defaults for all threads about to be launched DefaultContext.prec = 12 DefaultContext.rounding = ROUND_DOWN DefaultContext.traps = ExtendedContext.traps.copy() DefaultContext.traps[InvalidOperation] = 1 setcontext(DefaultContext) # Afterwards, the threads can be started t1.start() t2.start() t3.start() . . .
pt_br: # Define padrões para todo a aplicação para todas as threads prestes a serem iniciadas DefaultContext.prec = 12 DefaultContext.rounding = ROUND_DOWN DefaultContext.traps = ExtendedContext.traps.copy() DefaultContext.traps[InvalidOperation] = 1 setcontext(DefaultContext) # Depois, as threads podem ser iniciadas t1.start() t2.start() t3.start() . . .

source: Recipes
pt_br: Receitas

source: Here are a few recipes that serve as utility functions and that demonstrate ways to work with the :class:`Decimal` class::
pt_br: Aqui estão algumas receitas que servem como funções utilitárias e que demonstram maneiras de trabalhar com a classe :class:`Decimal`::

source: def moneyfmt(value, places=2, curr='', sep=',', dp='.', pos='', neg='-', trailneg=''): """Convert Decimal to a money formatted string. places: required number of places after the decimal point curr: optional currency symbol before the sign (may be blank) sep: optional grouping separator (comma, period, space, or blank) dp: decimal point indicator (comma or period) only specify as blank when places is zero pos: optional sign for positive numbers: '+', space or blank neg: optional sign for negative numbers: '-', '(', space or blank trailneg:optional trailing minus indicator: '-', ')', space or blank >>> d = Decimal('-1234567.8901') >>> moneyfmt(d, curr='$') '-$1,234,567.89' >>> moneyfmt(d, places=0, sep='.', dp='', neg='', trailneg='-') '1.234.568-' >>> moneyfmt(d, curr='$', neg='(', trailneg=')') '($1,234,567.89)' >>> moneyfmt(Decimal(123456789), sep=' ') '123 456 789.00' >>> moneyfmt(Decimal('-0.02'), neg='<', trailneg='>') '<0.02>' """ q = Decimal(10) ** -places # 2 places --> '0.01' sign, digits, exp = value.quantize(q).as_tuple() result = [] digits = list(map(str, digits)) build, next = result.append, digits.pop if sign: build(trailneg) for i in range(places): build(next() if digits else '0') if places: build(dp) if not digits: build('0') i = 0 while digits: build(next()) i += 1 if i == 3 and digits: i = 0 build(sep) build(curr) build(neg if sign else pos) return ''.join(reversed(result)) def pi(): """Compute Pi to the current precision. >>> print(pi()) 3.141592653589793238462643383 """ getcontext().prec += 2 # extra digits for intermediate steps three = Decimal(3) # substitute "three=3.0" for regular floats lasts, t, s, n, na, d, da = 0, three, 3, 1, 0, 0, 24 while s != lasts: lasts = s n, na = n+na, na+8 d, da = d+da, da+32 t = (t * n) / d s += t getcontext().prec -= 2 return +s # unary plus applies the new precision def exp(x): """Return e raised to the power of x. Result type matches input type. >>> print(exp(Decimal(1))) 2.718281828459045235360287471 >>> print(exp(Decimal(2))) 7.389056098930650227230427461 >>> print(exp(2.0)) 7.38905609893 >>> print(exp(2+0j)) (7.38905609893+0j) """ getcontext().prec += 2 i, lasts, s, fact, num = 0, 0, 1, 1, 1 while s != lasts: lasts = s i += 1 fact *= i num *= x s += num / fact getcontext().prec -= 2 return +s def cos(x): """Return the cosine of x as measured in radians. The Taylor series approximation works best for a small value of x. For larger values, first compute x = x % (2 * pi). >>> print(cos(Decimal('0.5'))) 0.8775825618903727161162815826 >>> print(cos(0.5)) 0.87758256189 >>> print(cos(0.5+0j)) (0.87758256189+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 0, 0, 1, 1, 1, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s def sin(x): """Return the sine of x as measured in radians. The Taylor series approximation works best for a small value of x. For larger values, first compute x = x % (2 * pi). >>> print(sin(Decimal('0.5'))) 0.4794255386042030002732879352 >>> print(sin(0.5)) 0.479425538604 >>> print(sin(0.5+0j)) (0.479425538604+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 1, 0, x, 1, x, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s
pt_br: def moneyfmt(value, places=2, curr='', sep=',', dp='.', pos='', neg='-', trailneg=''): """Converte Decimal para uma string formatada de moead. places: número obrigatório de casas após o ponto decimal curr: símbolo de moeda opcional antes do sinal (pode estar em branco) sep: separador de agrupamento opcional (vírgula, ponto, espaço ou espaço em branco) dp: indicador de ponto decimal (vírgula ou ponto) especificar como espaço em branco somente quando places for zero pos: sinal opcional para números positivos: '+', espaço ou espaço em branco neg: sinal opcional para números negativos: '-', '(', espaço ou espaço em branco trailneg:indicador de menos final opcional: '-', ')', espaço ou espaço em branco >>> d = Decimal('-1234567.8901') >>> moneyfmt(d, curr='$') '-$1,234,567.89' >>> moneyfmt(d, places=0, sep='.', dp='', neg='', trailneg='-') '1.234.568-' >>> moneyfmt(d, curr='$', neg='(', trailneg=')') '($1,234,567.89)' >>> moneyfmt(Decimal(123456789), sep=' ') '123 456 789.00' >>> moneyfmt(Decimal('-0.02'), neg='<', trailneg='>') '<0.02>' """ q = Decimal(10) ** -places # 2 casas --> '0.01' sign, digits, exp = value.quantize(q).as_tuple() result = [] digits = list(map(str, digits)) build, next = result.append, digits.pop if sign: build(trailneg) for i in range(places): build(next() if digits else '0') if places: build(dp) if not digits: build('0') i = 0 while digits: build(next()) i += 1 if i == 3 and digits: i = 0 build(sep) build(curr) build(neg if sign else pos) return ''.join(reversed(result)) def pi(): """Compute Pi to the current precision. >>> print(pi()) 3.141592653589793238462643383 """ getcontext().prec += 2 # dígitos extras para casas intermediárias three = Decimal(3) # substitui "three=3.0" para pontos flutuantes regulares lasts, t, s, n, na, d, da = 0, three, 3, 1, 0, 0, 24 while s != lasts: lasts = s n, na = n+na, na+8 d, da = d+da, da+32 t = (t * n) / d s += t getcontext().prec -= 2 return +s # unário com mais aplica a nova precisão def exp(x): """Retorna e elevado à potência de x. O tipo de resultado corresponde ao tipo de entrada. >>> print(exp(Decimal(1))) 2.718281828459045235360287471 >>> print(exp(Decimal(2))) 7.389056098930650227230427461 >>> print(exp(2.0)) 7.38905609893 >>> print(exp(2+0j)) (7.38905609893+0j) """ getcontext().prec += 2 i, lasts, s, fact, num = 0, 0, 1, 1, 1 while s != lasts: lasts = s i += 1 fact *= i num *= x s += num / fact getcontext().prec -= 2 return +s def cos(x): """Retorna o cosseno de x medido em radianos. A aproximação da série de Taylor funciona melhor para um valor pequeno de x. Para valores maiores, primeiro calcule x = x % (2 * pi). >>> print(cos(Decimal('0.5'))) 0.8775825618903727161162815826 >>> print(cos(0.5)) 0.87758256189 >>> print(cos(0.5+0j)) (0.87758256189+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 0, 0, 1, 1, 1, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s def sin(x): """Retorna o seno de x medido em radianos. A aproximação da série de Taylor funciona melhor para um valor pequeno de x. Para valores maiores, primeiro calcule x = x % (2 * pi). >>> print(sin(Decimal('0.5'))) 0.4794255386042030002732879352 >>> print(sin(0.5)) 0.479425538604 >>> print(sin(0.5+0j)) (0.479425538604+0j) """ getcontext().prec += 2 i, lasts, s, fact, num, sign = 1, 0, x, 1, x, 1 while s != lasts: lasts = s i += 2 fact *= i * (i-1) num *= x * x sign *= -1 s += num / fact * sign getcontext().prec -= 2 return +s

source: Decimal FAQ
pt_br: FAQ sobre Decimal

source: Q. It is cumbersome to type ``decimal.Decimal('1234.5')``. Is there a way to minimize typing when using the interactive interpreter?
pt_br: P. É complicado digitar ``decimal.Decimal('1234.5')``. Existe uma maneira de minimizar a digitação ao usar o interpretador interativo?

source: A. Some users abbreviate the constructor to just a single letter:
pt_br: R. Alguns usuários abreviam o construtor para apenas uma única letra:

source: Q. In a fixed-point application with two decimal places, some inputs have many places and need to be rounded. Others are not supposed to have excess digits and need to be validated. What methods should be used?
pt_br: P. Em uma aplicação de ponto fixo com duas casas decimais, algumas entradas têm muitas casas e precisam ser arredondadas. Outros não devem ter dígitos em excesso e precisam ser validados. Quais métodos devem ser usados?

source: A. The :meth:`~Decimal.quantize` method rounds to a fixed number of decimal places. If the :const:`Inexact` trap is set, it is also useful for validation:
pt_br: R. O método :meth:`~Decimal.quantize` arredonda para um número fixo de casas decimais. Se a armadilha :const:`Inexact` estiver configurada, também será útil para validação:

source: Q. Once I have valid two place inputs, how do I maintain that invariant throughout an application?
pt_br: P. Assim que eu tiver entradas de duas casas válidas, como mantenho essa invariante em uma aplicação?

source: A. Some operations like addition, subtraction, and multiplication by an integer will automatically preserve fixed point. Others operations, like division and non-integer multiplication, will change the number of decimal places and need to be followed-up with a :meth:`~Decimal.quantize` step:
pt_br: R. Algumas operações como adição, subtração e multiplicação por um número inteiro preservam automaticamente o ponto fixo. Outras operações, como divisão e multiplicação não inteira, alteram o número de casas decimais e precisam ser seguidas com uma etapa :meth:`~Decimal.quantize`:

source: In developing fixed-point applications, it is convenient to define functions to handle the :meth:`~Decimal.quantize` step:
pt_br: No desenvolvimento de aplicações de ponto fixo, é conveniente definir funções para manipular a etapa :meth:`~Decimal.quantize`:

source: Q. There are many ways to express the same value. The numbers ``200``, ``200.000``, ``2E2``, and ``.02E+4`` all have the same value at various precisions. Is there a way to transform them to a single recognizable canonical value?
pt_br: P. Existem várias maneiras de expressar o mesmo valor. Os números ``200``, ``200.000``, ``2E2`` e ``.02E+4`` têm todos o mesmo valor em várias precisões. Existe uma maneira de transformá-los em um único valor canônico reconhecível?

source: A. The :meth:`~Decimal.normalize` method maps all equivalent values to a single representative:
pt_br: R. O método :meth:`~Decimal.normalize` mapeia todos os valores equivalentes para um único representativo:

source: Q. When does rounding occur in a computation?
pt_br: P. Quando ocorre o arredondamento em um cálculo?

source: A. It occurs *after* the computation. The philosophy of the decimal specification is that numbers are considered exact and are created independent of the current context. They can even have greater precision than current context. Computations process with those exact inputs and then rounding (or other context operations) is applied to the *result* of the computation::
pt_br: R. Ocorre *após* o cálculo. A filosofia da especificação decimal é que os números são considerados exatos e criados independentemente do contexto atual. Eles podem até ter maior precisão do que o contexto atual. O processo de cálculo com essas entradas exatas e, em seguida, o arredondamento (ou outras operações de contexto) é aplicado ao *resultado* do cálculo::

source: >>> getcontext().prec = 5 >>> pi = Decimal('3.1415926535') # More than 5 digits >>> pi # All digits are retained Decimal('3.1415926535') >>> pi + 0 # Rounded after an addition Decimal('3.1416') >>> pi - Decimal('0.00005') # Subtract unrounded numbers, then round Decimal('3.1415') >>> pi + 0 - Decimal('0.00005'). # Intermediate values are rounded Decimal('3.1416')
pt_br: >>> getcontext().prec = 5 >>> pi = Decimal('3.1415926535') # Mais de 5 dígitos >>> pi # Todos os dígitos são retidos Decimal('3.1415926535') >>> pi + 0 # Arredondado após uma adição Decimal('3.1416') >>> pi - Decimal('0.00005') # Subtrai números não arredondados e depois arredonda Decimal('3.1415') >>> pi + 0 - Decimal('0.00005'). # Os valores intermediários são arredondados Decimal('3.1416')

source: Q. Some decimal values always print with exponential notation. Is there a way to get a non-exponential representation?
pt_br: P. Alguns valores decimais sempre são exibidas com notação exponencial. Existe uma maneira de obter uma representação não exponencial?

source: A. For some values, exponential notation is the only way to express the number of significant places in the coefficient. For example, expressing ``5.0E+3`` as ``5000`` keeps the value constant but cannot show the original's two-place significance.
pt_br: R. Para alguns valores, a notação exponencial é a única maneira de expressar o número de casas significativas no coeficiente. Por exemplo, expressar ``5.0E+3`` como ``5000`` mantém o valor constante, mas não pode mostrar a significância de duas casa do original.

source: If an application does not care about tracking significance, it is easy to remove the exponent and trailing zeroes, losing significance, but keeping the value unchanged:
pt_br: Se uma aplicação não se importa com o rastreamento da significância, é fácil remover o expoente e os zeros à direita, perdendo a significância, mas mantendo o valor inalterado:

source: Q. Is there a way to convert a regular float to a :class:`Decimal`?
pt_br: P. Existe uma maneira de converter um float comum em um :class:`Decimal`?

source: A. Yes, any binary floating-point number can be exactly expressed as a Decimal though an exact conversion may take more precision than intuition would suggest:
pt_br: R. Sim, qualquer número de ponto flutuante binário pode ser expresso exatamente como um Decimal, embora uma conversão exata possa exigir mais precisão do que a intuição sugere:

source: Q. Within a complex calculation, how can I make sure that I haven't gotten a spurious result because of insufficient precision or rounding anomalies.
pt_br: P. Em um cálculo complexo, como posso ter certeza de que não obtive um resultado falso devido à precisão insuficiente ou a anomalias de arredondamento.

source: A. The decimal module makes it easy to test results. A best practice is to re-run calculations using greater precision and with various rounding modes. Widely differing results indicate insufficient precision, rounding mode issues, ill-conditioned inputs, or a numerically unstable algorithm.
pt_br: R. O módulo decimal facilita o teste de resultados. Uma prática recomendada é executar novamente os cálculos usando maior precisão e com vários modos de arredondamento. Resultados amplamente diferentes indicam precisão insuficiente, problemas no modo de arredondamento, entradas mal condicionadas ou um algoritmo numericamente instável.
