Repository: python/python-docs-pt-br
Catalog: library/decimal.po
Languages: pt_br

source: Return the adjusted exponent after shifting out the coefficient's rightmost digits until only the lead digit remains: ``Decimal('321e+5').adjusted()`` returns seven. Used for determining the position of the most significant digit with respect to the decimal point.
pt_br: Retorna o expoente ajustado depois de deslocar os dígitos mais à direita do coeficiente até restar apenas o dígito principal: ``Decimal('321e+5').adjusted()`` retorna sete. Usado para determinar a posição do dígito mais significativo em relação ao ponto decimal.

source: Return a pair ``(n, d)`` of integers that represent the given :class:`Decimal` instance as a fraction, in lowest terms and with a positive denominator::
pt_br: Retorna um par ``(n, d)`` de números inteiros que representam a instância dada :class:`Decimal` como uma fração, nos termos mais baixos e com um denominador positivo::

source: The conversion is exact. Raise OverflowError on infinities and ValueError on NaNs.
pt_br: A conversão é exata. Levanta OverflowError em infinitos e ValueError em NaNs.

source: Return a :term:`named tuple` representation of the number: ``DecimalTuple(sign, digits, exponent)``.
pt_br: Retorna uma representação de :term:`tupla nomeada <named tuple>` do número: ``DecimalTuple(sign, digits, exponent)``.

source: Return the canonical encoding of the argument. Currently, the encoding of a :class:`Decimal` instance is always canonical, so this operation returns its argument unchanged.
pt_br: Retorna a codificação canônica do argumento. Atualmente, a codificação de uma instância de :class:`Decimal` é sempre canônica, portanto, esta operação retorna seu argumento inalterado.

source: Compare the values of two Decimal instances. :meth:`compare` returns a Decimal instance, and if either operand is a NaN then the result is a NaN::
pt_br: Compara os valores de duas instâncias decimais. :meth:`compare` retorna uma instância decimal, e se qualquer operando for um NaN, o resultado será um NaN::

source: This operation is identical to the :meth:`compare` method, except that all NaNs signal. That is, if neither operand is a signaling NaN then any quiet NaN operand is treated as though it were a signaling NaN.
pt_br: Esta operação é idêntica ao método :meth:`compare`, exceto que todos os NaNs sinalizam. Ou seja, se nenhum operando for um NaN sinalizador, qualquer operando NaN silencioso será tratado como se fosse um NaN sinalizador.

source: Compare two operands using their abstract representation rather than their numerical value. Similar to the :meth:`compare` method, but the result gives a total ordering on :class:`Decimal` instances. Two :class:`Decimal` instances with the same numeric value but different representations compare unequal in this ordering:
pt_br: Compara dois operandos usando sua representação abstrata em vez de seu valor numérico. Semelhante ao método :meth:`compare`, mas o resultado fornece uma ordem total nas instâncias de :class:`Decimal`. Duas instâncias de :class:`Decimal` com o mesmo valor numérico, mas diferentes representações, se comparam desiguais nesta ordem:

source: Quiet and signaling NaNs are also included in the total ordering. The result of this function is ``Decimal('0')`` if both operands have the same representation, ``Decimal('-1')`` if the first operand is lower in the total order than the second, and ``Decimal('1')`` if the first operand is higher in the total order than the second operand. See the specification for details of the total order.
pt_br: Os NaNs silenciosos e sinalizadores também estão incluídos no pedido total. O resultado dessa função é ``Decimal('0')`` se os dois operandos tiverem a mesma representação, ``Decimal('-1')`` se o primeiro operando for menor na ordem total que o segundo e ``Decimal('1')`` se o primeiro operando for maior na ordem total que o segundo operando. Veja a especificação para detalhes da ordem total.

source: This operation is unaffected by context and is quiet: no flags are changed and no rounding is performed. As an exception, the C version may raise InvalidOperation if the second operand cannot be converted exactly.
pt_br: Esta operação não é afetada pelo contexto e é silenciosa: nenhum sinalizador é alterado e nenhum arredondamento é executado. Como uma exceção, a versão C pode levantar InvalidOperation se o segundo operando não puder ser convertido exatamente.

source: Compare two operands using their abstract representation rather than their value as in :meth:`compare_total`, but ignoring the sign of each operand. ``x.compare_total_mag(y)`` is equivalent to ``x.copy_abs().compare_total(y.copy_abs())``.
pt_br: Compara dois operandos usando sua representação abstrata em vez de seu valor, como em :meth:`compare_total`, mas ignorando o sinal de cada operando. ``x.compare_total_mag(y)`` é equivalente a ``x.copy_abs().compare_total(y.copy_abs())``.

source: Just returns self, this method is only to comply with the Decimal Specification.
pt_br: Apenas retorna a si próprio, sendo esse método apenas para atender à Especificação de Decimal.

source: Return the absolute value of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
pt_br: Retorna o valor absoluto do argumento. Esta operação não é afetada pelo contexto e é silenciosa: nenhum sinalizador é alterado e nenhum arredondamento é executado.

source: Return the negation of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
pt_br: Retorna a negação do argumento. Esta operação não é afetada pelo contexto e é silenciosa: nenhum sinalizador é alterado e nenhum arredondamento é executado.

source: Return a copy of the first operand with the sign set to be the same as the sign of the second operand. For example:
pt_br: Retorna uma cópia do primeiro operando com o sinal definido para ser o mesmo que o sinal do segundo operando. Por exemplo:

source: Return the value of the (natural) exponential function ``e**x`` at the given number. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
pt_br: Retorna o valor da função exponencial (natural) ``e**x`` no número especificado. O resultado é arredondado corretamente usando o modo de arredondamento :const:`ROUND_HALF_EVEN`.

source: Alternative constructor that only accepts instances of :class:`float` or :class:`int`.
pt_br: Construtor alternativo que aceita apenas instâncias de :class:`float` ou :class:`int`.

source: Note ``Decimal.from_float(0.1)`` is not the same as ``Decimal('0.1')``. Since 0.1 is not exactly representable in binary floating point, the value is stored as the nearest representable value which is ``0x1.999999999999ap-4``. That equivalent value in decimal is ``0.1000000000000000055511151231257827021181583404541015625``.
pt_br: Observe que ``Decimal.from_float(0.1)`` não é o mesmo que ``Decimal('0.1')``. Como 0.1 não é exatamente representável no ponto flutuante binário, o valor é armazenado como o valor representável mais próximo que é ``0x1.999999999999ap-4``.; Esse valor equivalente em decimal é ``0.1000000000000000055511151231257827021181583404541015625``.

source: From Python 3.2 onwards, a :class:`Decimal` instance can also be constructed directly from a :class:`float`.
pt_br: A partir do Python 3.2 em diante, uma instância de :class:`Decimal` também pode ser construída diretamente a partir de um :class:`float`.

source: Alternative constructor that only accepts instances of :class:`float`, :class:`int` or :class:`Decimal`, but not strings or tuples.
pt_br: Construtor alternativo que aceita apenas instâncias de :class:`float`, :class:`int` ou :class:`Decimal`, mas não strings ou tuplas.

source: Fused multiply-add. Return self*other+third with no rounding of the intermediate product self*other.
pt_br: Multiplicação e adição fundidos. Retorna self*other+third sem arredondamento do produto intermediário self*other.

source: Return :const:`True` if the argument is canonical and :const:`False` otherwise. Currently, a :class:`Decimal` instance is always canonical, so this operation always returns :const:`True`.
pt_br: Retorna :const:`True` se o argumento for canônico e :const:`False` caso contrário. Atualmente, uma instância de :class:`Decimal` é sempre canônica, portanto, esta operação sempre retorna :const:`True`.

source: Return :const:`True` if the argument is a finite number, and :const:`False` if the argument is an infinity or a NaN.
pt_br: Retorna :const:`True` se o argumento for um número finito e :const:`False` se o argumento for um infinito ou um NaN.

source: Return :const:`True` if the argument is either positive or negative infinity and :const:`False` otherwise.
pt_br: Retorna :const:`True` se o argumento for infinito positivo ou negativo e :const:`False` caso contrário.

source: Return :const:`True` if the argument is a (quiet or signaling) NaN and :const:`False` otherwise.
pt_br: Retorna :const:`True` se o argumento for NaN (silencioso ou sinalizador) e :const:`False` caso contrário.

source: Return :const:`True` if the argument is a *normal* finite number. Return :const:`False` if the argument is zero, subnormal, infinite or a NaN.
pt_br: Retorna :const:`True` se o argumento for um número finito *normal*. Retorna :const:`False` se o argumento for zero, subnormal, infinito ou NaN.

source: Return :const:`True` if the argument is a quiet NaN, and :const:`False` otherwise.
pt_br: Retorna :const:`True` se o argumento for um NaN silencioso, e :const:`False` caso contrário.

source: Return :const:`True` if the argument has a negative sign and :const:`False` otherwise. Note that zeros and NaNs can both carry signs.
pt_br: Retorna :const:`True` se o argumento tiver um sinal negativo e :const:`False` caso contrário. Observe que zeros e NaNs podem carregar sinais.

source: Return :const:`True` if the argument is a signaling NaN and :const:`False` otherwise.
pt_br: Retorna :const:`True` se o argumento for um sinal NaN e :const:`False` caso contrário.

source: Return :const:`True` if the argument is subnormal, and :const:`False` otherwise.
pt_br: Retorna :const:`True` se o argumento for subnormal e :const:`False` caso contrário.

source: Return :const:`True` if the argument is a (positive or negative) zero and :const:`False` otherwise.
pt_br: Retorna :const:`True` se o argumento for um zero (positivo ou negativo) e :const:`False` caso contrário.

source: Return the natural (base e) logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
pt_br: Retorna o logaritmo (base e) natural do operando. O resultado é arredondado corretamente usando o modo de arredondamento :const:`ROUND_HALF_EVEN`.

source: Return the base ten logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
pt_br: Retorna o logaritmo da base dez do operando. O resultado é arredondado corretamente usando o modo de arredondamento :const:`ROUND_HALF_EVEN`.

source: For a nonzero number, return the adjusted exponent of its operand as a :class:`Decimal` instance. If the operand is a zero then ``Decimal('-Infinity')`` is returned and the :const:`DivisionByZero` flag is raised. If the operand is an infinity then ``Decimal('Infinity')`` is returned.
pt_br: Para um número diferente de zero, retorna o expoente ajustado de seu operando como uma instância de :class:`Decimal`. Se o operando é zero, ``Decimal('-Infinity')`` é retornado e o sinalizador :const:`DivisionByZero` é levantado. Se o operando for um infinito, ``Decimal('Infinity')`` será retornado.

source: :meth:`logical_and` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``and`` of the two operands.
pt_br: :meth:`logical_and` é uma operação lógica que leva dois *operandos lógicos* (consulte :ref:`logical_operands_label`). O resultado é o ``and`` dígito a dígito dos dois operandos.

source: :meth:`logical_invert` is a logical operation. The result is the digit-wise inversion of the operand.
pt_br: :meth:`logical_invert` é uma operação lógica. O resultado é a inversão dígito a dígito do operando.

source: :meth:`logical_or` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``or`` of the two operands.
pt_br: :meth:`logical_or` é uma operação lógica que leva dois *operandos lógicos* (consulte :ref:`logical_operands_label`). O resultado é o ``or`` dígito a dígito dos dois operandos.

source: :meth:`logical_xor` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise exclusive or of the two operands.
pt_br: :meth:`logical_xor` é uma operação lógica que leva dois *operandos lógicos* (consulte :ref:`logical_operands_label`). O resultado é o "ou exclusivo" dígito a dígito ou dos dois operandos.

source: Like ``max(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
pt_br: Como ``max(self, other)``, exceto que a regra de arredondamento de contexto é aplicada antes de retornar e que os valores ``NaN`` são sinalizados ou ignorados (dependendo do contexto e se estão sinalizando ou silenciosos).

source: Similar to the :meth:`.max` method, but the comparison is done using the absolute values of the operands.
pt_br: Semelhante ao método :meth:`.max`, mas a comparação é feita usando os valores absolutos dos operandos.

source: Like ``min(self, other)`` except that the context rounding rule is applied before returning and that ``NaN`` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
pt_br: Como ``min(self, other)``, exceto que a regra de arredondamento de contexto é aplicada antes de retornar e que os valores ``NaN`` são sinalizados ou ignorados (dependendo do contexto e se estão sinalizando ou silenciosos).

source: Similar to the :meth:`.min` method, but the comparison is done using the absolute values of the operands.
pt_br: Semelhante ao método :meth:`.min`, mas a comparação é feita usando os valores absolutos dos operandos.

source: Return the largest number representable in the given context (or in the current thread's context if no context is given) that is smaller than the given operand.
pt_br: Retorna o maior número representável no contexto fornecido (ou no contexto atual da thread, se nenhum contexto for fornecido) que seja menor que o operando especificado.

source: Return the smallest number representable in the given context (or in the current thread's context if no context is given) that is larger than the given operand.
pt_br: Retorna o menor número representável no contexto fornecido (ou no contexto atual da thread, se nenhum contexto for fornecido) que seja maior que o operando fornecido.

source: If the two operands are unequal, return the number closest to the first operand in the direction of the second operand. If both operands are numerically equal, return a copy of the first operand with the sign set to be the same as the sign of the second operand.
pt_br: Se os dois operandos forem desiguais, retorna o número mais próximo ao primeiro operando na direção do segundo operando. Se os dois operandos forem numericamente iguais, retorna uma cópia do primeiro operando com o sinal configurado para ser o mesmo que o sinal do segundo operando.

source: Used for producing canonical values of an equivalence class within either the current context or the specified context.
pt_br: Usado para produzir valores canônicos de uma classe de equivalência no contexto atual ou no contexto especificado.

source: This has the same semantics as the unary plus operation, except that if the final result is finite it is reduced to its simplest form, with all trailing zeros removed and its sign preserved. That is, while the coefficient is non-zero and a multiple of ten the coefficient is divided by ten and the exponent is incremented by 1. Otherwise (the coefficient is zero) the exponent is set to 0. In all cases the sign is unchanged.
pt_br: Esta tem a mesma semântica que a operação unária mais, exceto que se o resultado final for finito, ele será reduzido à sua forma mais simples, com todos os zeros à direita removidos e seu sinal preservado. Ou seja, enquanto o coeficiente for diferente de zero e múltiplo de dez, o coeficiente é dividido por dez e o expoente é incrementado em 1. Caso contrário (o coeficiente é zero), o expoente é definido como 0. Em todos os casos, o sinal permanece inalterado. .

source: For example, ``Decimal('32.100')`` and ``Decimal('0.321000e+2')`` both normalize to the equivalent value ``Decimal('32.1')``.
pt_br: Por exemplo, ``Decimal('32.100')`` e ``Decimal('0.321000e+2')`` ambos normalizam para o valor equivalente ``Decimal('32.1')``.

source: Note that rounding is applied *before* reducing to simplest form.
pt_br: Observe que o arredondamento é aplicado *antes* de reduzir para a forma mais simples.

source: In the latest versions of the specification, this operation is also known as ``reduce``.
pt_br: Nas versões mais recentes da especificação, esta operação também é conhecida como ``reduce``.

source: Return a string describing the *class* of the operand. The returned value is one of the following ten strings.
pt_br: Retorna uma string descrevendo a *classe* do operando. O valor retornado é uma das dez sequências a seguir.

source: ``"-Infinity"``, indicating that the operand is negative infinity.
pt_br: ``"-Infinity"``, indicando que o operando é infinito negativo.

source: ``"-Normal"``, indicating that the operand is a negative normal number.
pt_br: ``"-Normal"``, indicando que o operando é um número normal negativo.

source: ``"-Subnormal"``, indicating that the operand is negative and subnormal.
pt_br: ``"-Subnormal"``, indicando que o operando é negativo e subnormal.

source: ``"-Zero"``, indicating that the operand is a negative zero.
pt_br: ``"-Zero"``, indicando que o operando é um zero negativo.

source: ``"+Zero"``, indicating that the operand is a positive zero.
pt_br: ``"+Zero"``, indicando que o operando é um zero positivo.

source: ``"+Subnormal"``, indicating that the operand is positive and subnormal.
pt_br: ``"+Subnormal"``, indicando que o operando é positivo e subnormal.

source: ``"+Normal"``, indicating that the operand is a positive normal number.
pt_br: ``"+Normal"``, indicando que o operando é um número normal positivo.

source: ``"+Infinity"``, indicating that the operand is positive infinity.
pt_br: ``"+Infinity"``, indicando que o operando é infinito positivo.

source: ``"NaN"``, indicating that the operand is a quiet NaN (Not a Number).
pt_br: ``"NaN"``, indicando que o operando é um NaN ("Not a Number") silencioso.

source: ``"sNaN"``, indicating that the operand is a signaling NaN.
pt_br: ``"sNaN"``, indicando que o operando é um NaN sinalizador.

source: Return a value equal to the first operand after rounding and having the exponent of the second operand.
pt_br: Retorna um valor igual ao primeiro operando após o arredondamento e com o expoente do segundo operando.

source: Unlike other operations, if the length of the coefficient after the quantize operation would be greater than precision, then an :const:`InvalidOperation` is signaled. This guarantees that, unless there is an error condition, the quantized exponent is always equal to that of the right-hand operand.
pt_br: Diferentemente de outras operações, se o comprimento do coeficiente após a operação de quantização for maior que a precisão, então :const:`InvalidOperation` é sinalizado. Isso garante que, a menos que haja uma condição de erro, o expoente quantizado é sempre igual ao do operando do lado direito.

source: Also unlike other operations, quantize never signals Underflow, even if the result is subnormal and inexact.
pt_br: Também, diferentemente de outras operações, a quantização nunca sinaliza Underflow, mesmo que o resultado seja subnormal e inexato.

source: If the exponent of the second operand is larger than that of the first then rounding may be necessary. In this case, the rounding mode is determined by the ``rounding`` argument if given, else by the given ``context`` argument; if neither argument is given the rounding mode of the current thread's context is used.
pt_br: Se o expoente do segundo operando for maior que o do primeiro, o arredondamento poderá ser necessário. Nesse caso, o modo de arredondamento é determinado pelo argumento ``rounding``, se fornecido, ou pelo argumento ``context`` fornecido; se nenhum argumento for fornecido, o modo de arredondamento do contexto da thread atual será usado.

source: An error is returned whenever the resulting exponent is greater than :attr:`~Context.Emax` or less than :meth:`~Context.Etiny`.
pt_br: Um erro é retornado sempre que o expoente resultante for maior que :attr:`~Context.Emax` ou menor que :meth:`~Context.Etiny`.

source: Return ``Decimal(10)``, the radix (base) in which the :class:`Decimal` class does all its arithmetic. Included for compatibility with the specification.
pt_br: Retorna ``Decimal(10)``, a raiz (base) na qual a classe :class:`Decimal` faz toda a sua aritmética. Incluído para compatibilidade com a especificação.

source: Return the remainder from dividing *self* by *other*. This differs from ``self % other`` in that the sign of the remainder is chosen so as to minimize its absolute value. More precisely, the return value is ``self - n * other`` where ``n`` is the integer nearest to the exact value of ``self / other``, and if two integers are equally near then the even one is chosen.
pt_br: Retorna o resto da divisão de *self* por *other*. Isso é diferente de ``self % other``, pois o sinal do resto é escolhido para minimizar seu valor absoluto. Mais precisamente, o valor de retorno é ``self - n * other``, onde ``n`` é o número inteiro mais próximo do valor exato de ``self / other``, e se dois números inteiros estiverem igualmente próximos, o par será é escolhido.

source: If the result is zero then its sign will be the sign of *self*.
pt_br: Se o resultado for zero, seu sinal será o sinal de *self*.

source: Return the result of rotating the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to rotate. If the second operand is positive then rotation is to the left; otherwise rotation is to the right. The coefficient of the first operand is padded on the left with zeros to length precision if necessary. The sign and exponent of the first operand are unchanged.
pt_br: Retorna o resultado da rotação dos dígitos do primeiro operando em uma quantidade especificada pelo segundo operando. O segundo operando deve ser um número inteiro no intervalo - precisão através da precisão. O valor absoluto do segundo operando fornece o número de locais a serem rotacionados. Se o segundo operando for positivo, a rotação será para a esquerda; caso contrário, a rotação será para a direita. O coeficiente do primeiro operando é preenchido à esquerda com zeros na precisão do comprimento, se necessário. O sinal e o expoente do primeiro operando não são alterados.

source: Test whether self and other have the same exponent or whether both are ``NaN``.
pt_br: Testa se "self" e "other" têm o mesmo expoente ou se ambos são ``NaN``.
