Repository: python/python-docs-pt-br
Catalog: library/decimal.po
Languages: pt_br

source: Q. I noticed that context precision is applied to the results of operations but not to the inputs. Is there anything to watch out for when mixing values of different precisions?
pt_br: P. Notei que a precisão do contexto é aplicada aos resultados das operações, mas não às entradas. Há algo a observar ao misturar valores de diferentes precisões?

source: A. Yes. The principle is that all values are considered to be exact and so is the arithmetic on those values. Only the results are rounded. The advantage for inputs is that "what you type is what you get". A disadvantage is that the results can look odd if you forget that the inputs haven't been rounded:
pt_br: R. Sim. O princípio é que todos os valores são considerados exatos, assim como a aritmética desses valores. Somente os resultados são arredondados. A vantagem das entradas é que "o que você vê é o que você obtém". Uma desvantagem é que os resultados podem parecer estranhos se você esquecer que as entradas não foram arredondadas:

source: The solution is either to increase precision or to force rounding of inputs using the unary plus operation:
pt_br: A solução é aumentar a precisão ou forçar o arredondamento das entradas usando a operação unária de mais:

source: Alternatively, inputs can be rounded upon creation using the :meth:`Context.create_decimal` method:
pt_br: Como alternativa, as entradas podem ser arredondadas na criação usando o método :meth:`Context.create_decimal`:

source: Q. Is the CPython implementation fast for large numbers?
pt_br: P. A implementação do CPython é rápida para números grandes?

source: A. Yes. In the CPython and PyPy3 implementations, the C/CFFI versions of the decimal module integrate the high speed `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ library for arbitrary precision correctly rounded decimal floating-point arithmetic [#]_. ``libmpdec`` uses `Karatsuba multiplication <https://en.wikipedia.org/wiki/Karatsuba_algorithm>`_ for medium-sized numbers and the `Number Theoretic Transform <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ for very large numbers.
pt_br: A. Sim. Nas implementações CPython e PyPy3, as versões C/CFFI do módulo decimal integram a biblioteca de alta velocidade `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ para precisão arbitrária de aritmética de ponto flutuante decimal corretamente arredondado [#]_. ``libmpdec`` usa a `multiplicação de Karatsuba <https://pt.wikipedia.org/wiki/Algoritmo_de_Karatsuba>`_ para números com tamanho médio e a `Transformada Numérica de Fourier <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ para números muito grandes.

source: The context must be adapted for exact arbitrary precision arithmetic. :attr:`~Context.Emin` and :attr:`~Context.Emax` should always be set to the maximum values, :attr:`~Context.clamp` should always be 0 (the default). Setting :attr:`~Context.prec` requires some care.
pt_br: O contexto deve ser adaptado para uma aritmética exata de precisão arbitrária. :attr:`~Context.Emin` e :attr:`~Context.Emax` devem sempre ser configurados com os valores máximos, :attr:`~Context.clamp` deve sempre ser 0 (o padrão). A configuração de :attr:`~Context.prec` requer alguns cuidados.

source: The easiest approach for trying out bignum arithmetic is to use the maximum value for :attr:`~Context.prec` as well [#]_::
pt_br: A abordagem mais fácil para testar a aritmética do bignum é usar o valor máximo para :attr:`~Context.prec` também [#]_::

source: For inexact results, :const:`MAX_PREC` is far too large on 64-bit platforms and the available memory will be insufficient::
pt_br: Para resultados inexatos, :const:`MAX_PREC` é muito grande em plataformas de 64 bits e a memória disponível será insuficiente::

source: On systems with overallocation (e.g. Linux), a more sophisticated approach is to adjust :attr:`~Context.prec` to the amount of available RAM. Suppose that you have 8GB of RAM and expect 10 simultaneous operands using a maximum of 500MB each::
pt_br: Em sistemas com alocação excessiva (por exemplo, Linux), uma abordagem mais sofisticada é ajustar :attr:`~Context.prec` à quantidade de RAM disponível. Suponha que você tenha 8 GB de RAM e espere 10 operandos simultâneos usando no máximo 500 MB cada::

source: >>> import sys >>> >>> # Maximum number of digits for a single operand using 500MB in 8-byte words >>> # with 19 digits per word (4-byte and 9 digits for the 32-bit build): >>> maxdigits = 19 * ((500 * 1024**2) // 8) >>> >>> # Check that this works: >>> c = Context(prec=maxdigits, Emax=MAX_EMAX, Emin=MIN_EMIN) >>> c.traps[Inexact] = True >>> setcontext(c) >>> >>> # Fill the available precision with nines: >>> x = Decimal(0).logical_invert() * 9 >>> sys.getsizeof(x) 524288112 >>> x + 2 Traceback (most recent call last): File "<stdin>", line 1, in <module> decimal.Inexact: [<class 'decimal.Inexact'>]
pt_br: >>> import sys >>> >>> # Número máximo de dígitos para um único operando usando 500 MB >>> # em palavras de 8 bytes com 19 dígitos por palavra (4 bytes e 9 dígitos >>> # para a construção de 32 bits): >>> maxdigits = 19 * ((500 * 1024**2) // 8) >>> >>> # Confere que isso funciona: >>> c = Context(prec=maxdigits, Emax=MAX_EMAX, Emin=MIN_EMIN) >>> c.traps[Inexact] = True >>> setcontext(c) >>> >>> # Preenche a precisão disponível com noves: >>> x = Decimal(0).logical_invert() * 9 >>> sys.getsizeof(x) 524288112 >>> x + 2 Traceback (most recent call last): File "<stdin>", line 1, in <module> decimal.Inexact: [<class 'decimal.Inexact'>]

source: In general (and especially on systems without overallocation), it is recommended to estimate even tighter bounds and set the :attr:`Inexact` trap if all calculations are expected to be exact.
pt_br: Em geral (e especialmente em sistemas sem alocação excessiva), recomenda-se estimar limites ainda mais apertados e definir a armadilha :attr:`Inexact` se for esperado que todos os cálculos sejam mais precisos.

source: This approach now works for all exact results except for non-integer powers.
pt_br: Esta abordagem agora funciona para todos os resultados exatos, exceto para potências de números que não sejam inteiros.
