Repository: python/python-docs-pt-br
Catalog: library/decimal.po
Languages: pt_br

source: :mod:`!decimal` --- Decimal fixed-point and floating-point arithmetic
pt_br: :mod:`!decimal` --- Aritmética de ponto fixo decimal e ponto flutuante

source: **Source code:** :source:`Lib/decimal.py`
pt_br: **Código-fonte:** :source:`Lib/decimal.py`

source: The :mod:`decimal` module provides support for fast correctly rounded decimal floating-point arithmetic. It offers several advantages over the :class:`float` datatype:
pt_br: O módulo :mod:`decimal` fornece suporte a aritmética rápida de ponto flutuante decimal corretamente arredondado. Oferece várias vantagens sobre o tipo de dados :class:`float`:

source: Decimal "is based on a floating-point model which was designed with people in mind, and necessarily has a paramount guiding principle -- computers must provide an arithmetic that works in the same way as the arithmetic that people learn at school." -- excerpt from the decimal arithmetic specification.
pt_br: Decimal "é baseado em um modelo de ponto flutuante que foi projetado com as pessoas em mente e necessariamente tem um princípio orientador primordial -- os computadores devem fornecer uma aritmética que funcione da mesma maneira que a aritmética que as pessoas aprendem na escola". -- trecho da especificação aritmética decimal.

source: Decimal numbers can be represented exactly. In contrast, numbers like ``1.1`` and ``2.2`` do not have exact representations in binary floating point. End users typically would not expect ``1.1 + 2.2`` to display as ``3.3000000000000003`` as it does with binary floating point.
pt_br: Os números decimais podem ser representados exatamente. Por outro lado, números como ``1.1`` e ``2.2`` não possuem representações exatas em ponto flutuante binário. Os usuários finais normalmente não esperam que ``1.1 + 2.2`` sejam exibidos como ``3.3000000000000003``, como acontece com o ponto flutuante binário.

source: The exactness carries over into arithmetic. In decimal floating point, ``0.1 + 0.1 + 0.1 - 0.3`` is exactly equal to zero. In binary floating point, the result is ``5.5511151231257827e-017``. While near to zero, the differences prevent reliable equality testing and differences can accumulate. For this reason, decimal is preferred in accounting applications which have strict equality invariants.
pt_br: A exatidão transita para a aritmética. No ponto flutuante decimal, ``0.1 + 0.1 + 0.1 - 0.3`` é exatamente igual a zero. No ponto flutuante binário, o resultado é ``5.5511151231257827e-017``. Embora próximas de zero, as diferenças impedem o teste de igualdade confiável e as diferenças podem se acumular. Por esse motivo, o decimal é preferido em aplicações de contabilidade que possuem invariáveis estritos de igualdade.

source: The decimal module incorporates a notion of significant places so that ``1.30 + 1.20`` is ``2.50``. The trailing zero is kept to indicate significance. This is the customary presentation for monetary applications. For multiplication, the "schoolbook" approach uses all the figures in the multiplicands. For instance, ``1.3 * 1.2`` gives ``1.56`` while ``1.30 * 1.20`` gives ``1.5600``.
pt_br: O módulo decimal incorpora uma noção de casas significativas para que ``1.30 + 1.20`` seja ``2.50``. O zero à direita é mantido para indicar significância. Esta é a apresentação habitual para aplicações monetárias. Para multiplicação, a abordagem "livro escolar" usa todas as figuras nos multiplicandos. Por exemplo, ``1.3 * 1.2`` é igual a ``1.56`` enquanto ``1.30 * 1.20`` é igual a ``1.5600``.

source: Unlike hardware based binary floating point, the decimal module has a user alterable precision (defaulting to 28 places) which can be as large as needed for a given problem:
pt_br: Diferentemente do ponto flutuante binário baseado em hardware, o módulo decimal possui uma precisão alterável pelo usuário (padrão de 28 casas), que pode ser tão grande quanto necessário para um determinado problema:

source: Both binary and decimal floating point are implemented in terms of published standards. While the built-in float type exposes only a modest portion of its capabilities, the decimal module exposes all required parts of the standard. When needed, the programmer has full control over rounding and signal handling. This includes an option to enforce exact arithmetic by using exceptions to block any inexact operations.
pt_br: O ponto flutuante binário e decimal é implementado em termos de padrões publicados. Enquanto o tipo ponto flutuante embutido expõe apenas uma parte modesta de seus recursos, o módulo decimal expõe todas as partes necessárias do padrão. Quando necessário, o programador tem controle total sobre o arredondamento e o manuseio do sinal. Isso inclui uma opção para impor aritmética exata usando exceções para bloquear quaisquer operações inexatas.

source: The decimal module was designed to support "without prejudice, both exact unrounded decimal arithmetic (sometimes called fixed-point arithmetic) and rounded floating-point arithmetic." -- excerpt from the decimal arithmetic specification.
pt_br: O módulo decimal foi projetado para dar suporte, "sem prejuízo, a aritmética decimal não arredondada exata (às vezes chamada aritmética de ponto fixo) e aritmética arredondada de ponto flutuante". -- trecho da especificação aritmética decimal.

source: The module design is centered around three concepts: the decimal number, the context for arithmetic, and signals.
pt_br: O design do módulo é centrado em torno de três conceitos: o número decimal, o contexto da aritmética e os sinais.

source: A decimal number is immutable. It has a sign, coefficient digits, and an exponent. To preserve significance, the coefficient digits do not truncate trailing zeros. Decimals also include special values such as ``Infinity``, ``-Infinity``, and ``NaN``. The standard also differentiates ``-0`` from ``+0``.
pt_br: Um número decimal é imutável. Possui um sinal, dígitos de coeficiente e um expoente. Para preservar a significância, os dígitos do coeficiente não truncam zeros à direita. Os decimais também incluem valores especiais, tais como ``Infinity``, ``-Infinity`` e ``NaN``. O padrão também diferencia ``-0`` de ``+0``.

source: The context for arithmetic is an environment specifying precision, rounding rules, limits on exponents, flags indicating the results of operations, and trap enablers which determine whether signals are treated as exceptions. Rounding options include :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP`, and :const:`ROUND_05UP`.
pt_br: O contexto da aritmética é um ambiente que especifica precisão, regras de arredondamento, limites de expoentes, sinalizadores indicando os resultados das operações e ativadores de interceptação que determinam se os sinais são tratados como exceções. As opções de arredondamento incluem :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP` e :const:`ROUND_05UP`.

source: Signals are groups of exceptional conditions arising during the course of computation. Depending on the needs of the application, signals may be ignored, considered as informational, or treated as exceptions. The signals in the decimal module are: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` and :const:`FloatOperation`.
pt_br: Sinais são grupos de condições excepcionais que surgem durante o curso da computação. Dependendo das necessidades da aplicação, os sinais podem ser ignorados, considerados informativos ou tratados como exceções. Os sinais no módulo decimal são: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` e :const:`FloatOperation`.

source: For each signal there is a flag and a trap enabler. When a signal is encountered, its flag is set to one, then, if the trap enabler is set to one, an exception is raised. Flags are sticky, so the user needs to reset them before monitoring a calculation.
pt_br: Para cada sinal, há um sinalizador e um ativador de interceptação. Quando um sinal é encontrado, seu sinalizador é definido como um e, se o ativador de interceptação estiver definido como um, uma exceção será gerada. Os sinalizadores são fixos; portanto, o usuário precisa redefini-los antes de monitorar um cálculo.

source: IBM's General Decimal Arithmetic Specification, `The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_.
pt_br: A especificação geral aritmética decimal da IBM, `The General Decimal Arithmetic Specification <https://speleotrove.com/decimal/decarith.html>`_.

source: Quick-start tutorial
pt_br: Tutorial de início rápido

source: The usual start to using decimals is importing the module, viewing the current context with :func:`getcontext` and, if necessary, setting new values for precision, rounding, or enabled traps::
pt_br: O início usual do uso de decimais é importar o módulo, exibir o contexto atual com :func:`getcontext` e, se necessário, definir novos valores para precisão, arredondamento ou armadilhas ativados::

source: >>> from decimal import * >>> getcontext() Context(prec=28, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capitals=1, clamp=0, flags=[], traps=[Overflow, DivisionByZero, InvalidOperation]) >>> getcontext().prec = 7 # Set a new precision
pt_br: >>> from decimal import * >>> getcontext() Context(prec=28, rounding=ROUND_HALF_EVEN, Emin=-999999, Emax=999999, capitals=1, clamp=0, flags=[], traps=[Overflow, DivisionByZero, InvalidOperation]) >>> getcontext().prec = 7 # Define uma nova precisão

source: Decimal instances can be constructed from integers, strings, floats, or tuples. Construction from an integer or a float performs an exact conversion of the value of that integer or float. Decimal numbers include special values such as ``NaN`` which stands for "Not a number", positive and negative ``Infinity``, and ``-0``::
pt_br: Instâncias decimais podem ser construídas a partir de números inteiros, strings, pontos flutuantes ou tuplas. A construção de um número inteiro ou de um ponto flutuante realiza uma conversão exata do valor desse número inteiro ou ponto flutuante. Os números decimais incluem valores especiais como ``NaN``, que significa "Não é um número", ``Infinity`` positivo e negativo e ``-0``::

source: If the :exc:`FloatOperation` signal is trapped, accidental mixing of decimals and floats in constructors or ordering comparisons raises an exception::
pt_br: Se o sinal :exc:`FloatOperation` for capturado na armadilha, a mistura acidental de decimais e pontos flutuantes em construtores ou comparações de ordenação levanta uma exceção::

source: The significance of a new Decimal is determined solely by the number of digits input. Context precision and rounding only come into play during arithmetic operations.
pt_br: O significado de um novo decimal é determinado apenas pelo número de dígitos inseridos. A precisão e o arredondamento do contexto só entram em jogo durante operações aritméticas.

source: If the internal limits of the C version are exceeded, constructing a decimal raises :class:`InvalidOperation`::
pt_br: Se os limites internos da versão C forem excedidos, a construção de um decimal levanta :class:`InvalidOperation`::

source: Decimals interact well with much of the rest of Python. Here is a small decimal floating-point flying circus:
pt_br: Os decimais interagem bem com grande parte do resto do Python. Aqui está um pequeno circo voador de ponto flutuante decimal:

source: And some mathematical functions are also available to Decimal:
pt_br: E algumas funções matemáticas também estão disponíveis no Decimal:

source: The :meth:`~Decimal.quantize` method rounds a number to a fixed exponent. This method is useful for monetary applications that often round results to a fixed number of places:
pt_br: O método :meth:`~Decimal.quantize` arredonda um número para um expoente fixo. Esse método é útil para aplicações monetárias que geralmente arredondam os resultados para um número fixo de locais:

source: As shown above, the :func:`getcontext` function accesses the current context and allows the settings to be changed. This approach meets the needs of most applications.
pt_br: Como mostrado acima, a função :func:`getcontext` acessa o contexto atual e permite que as configurações sejam alteradas. Essa abordagem atende às necessidades da maioria das aplicações.

source: For more advanced work, it may be useful to create alternate contexts using the Context() constructor. To make an alternate active, use the :func:`setcontext` function.
pt_br: Para trabalhos mais avançados, pode ser útil criar contextos alternativos usando o construtor Context(). Para ativar uma alternativa, use a função :func:`setcontext`.

source: In accordance with the standard, the :mod:`decimal` module provides two ready to use standard contexts, :const:`BasicContext` and :const:`ExtendedContext`. The former is especially useful for debugging because many of the traps are enabled:
pt_br: De acordo com o padrão, o módulo :mod:`decimal` fornece dois contextos padrão prontos para uso, :const:`BasicContext` e :const:`ExtendedContext`. O primeiro é especialmente útil para depuração porque muitas das armadilhas estão ativadas:

source: Contexts also have signal flags for monitoring exceptional conditions encountered during computations. The flags remain set until explicitly cleared, so it is best to clear the flags before each set of monitored computations by using the :meth:`~Context.clear_flags` method. ::
pt_br: Os contextos também possuem sinalizadores para monitorar condições excepcionais encontradas durante os cálculos. Os sinalizadores permanecem definidos até que sejam explicitamente limpos, portanto, é melhor limpar os sinalizadores antes de cada conjunto de cálculos monitorados usando o método :meth:`~Context.clear_flags`. ::

source: The *flags* entry shows that the rational approximation to pi was rounded (digits beyond the context precision were thrown away) and that the result is inexact (some of the discarded digits were non-zero).
pt_br: A entrada *flags* mostra que a aproximação racional de pi foi arredondada (dígitos além da precisão do contexto foram descartados) e que o resultado é inexato (alguns dos dígitos descartados eram diferentes de zero).

source: Individual traps are set using the dictionary in the :attr:`~Context.traps` attribute of a context:
pt_br: As armadilhas individuais são definidas usando o dicionário no atributo :attr:`~Context.traps` de um contexto:

source: Most programs adjust the current context only once, at the beginning of the program. And, in many applications, data is converted to :class:`Decimal` with a single cast inside a loop. With context set and decimals created, the bulk of the program manipulates the data no differently than with other Python numeric types.
pt_br: A maioria dos programas ajusta o contexto atual apenas uma vez, no início do programa. E, em muitas aplicações, os dados são convertidos para :class:`Decimal` com uma única conversão dentro de um loop. Com o conjunto de contextos e decimais criados, a maior parte do programa manipula os dados de maneira diferente do que com outros tipos numéricos do Python.

source: Decimal objects
pt_br: Objetos de Decimal

source: Construct a new :class:`Decimal` object based from *value*.
pt_br: Constrói um novo objeto de :class:`Decimal` com base em *value*.

source: *value* can be an integer, string, tuple, :class:`float`, or another :class:`Decimal` object. If no *value* is given, returns ``Decimal('0')``. If *value* is a string, it should conform to the decimal numeric string syntax after leading and trailing whitespace characters, as well as underscores throughout, are removed::
pt_br: *value* pode ser um inteiro, string, tupla, :class:`float` ou outro objeto de :class:`Decimal`. Se nenhum *value* for fornecido, retornará ``Decimal('0')``. Se *value* for uma string, ele deverá estar em conformidade com a sintaxe da string numérica decimal após caracteres de espaço em branco à esquerda e à direita, bem como sublinhados em toda parte, serem removidos::

source: Other Unicode decimal digits are also permitted where ``digit`` appears above. These include decimal digits from various other alphabets (for example, Arabic-Indic and Devanāgarī digits) along with the fullwidth digits ``'\uff10'`` through ``'\uff19'``. Case is not significant, so, for example, ``inf``, ``Inf``, ``INFINITY``, and ``iNfINity`` are all acceptable spellings for positive infinity.
pt_br: Outros dígitos decimais Unicode também são permitidos onde ``digit`` aparece acima. Isso inclui dígitos decimais de vários outros alfabetos (por exemplo, dígitos em árabes-índicos e devanágaris), além dos dígitos de largura total ``'\uff10'`` a ``'\uff19'``. A capitalização não é significativa, então, por exemplo, ``inf``, ``Inf``, ``INFINITY`` e ``iNfINity`` são todas grafias aceitáveis para infinito positivo.

source: If *value* is a :class:`tuple`, it should have three components, a sign (``0`` for positive or ``1`` for negative), a :class:`tuple` of digits, and an integer exponent. For example, ``Decimal((0, (1, 4, 1, 4), -3))`` returns ``Decimal('1.414')``.
pt_br: Se *value* for um :class:`tuple`, ele deverá ter três componentes, um sinal (``0`` para positivo ou ``1`` para negativo), um :class:`tuple` de dígitos e um expoente inteiro. Por exemplo, ``Decimal((0, (1, 4, 1, 4), -3))`` returna ``Decimal('1.414')``.

source: If *value* is a :class:`float`, the binary floating-point value is losslessly converted to its exact decimal equivalent. This conversion can often require 53 or more digits of precision. For example, ``Decimal(float('1.1'))`` converts to ``Decimal('1.100000000000000088817841970012523233890533447265625')``.
pt_br: Se *value* é um :class:`float`, o valor do ponto flutuante binário é convertido sem perdas no seu equivalente decimal exato. Essa conversão geralmente requer 53 ou mais dígitos de precisão. Por exemplo, ``Decimal(float('1.1'))`` converte para ``Decimal('1.100000000000000088817841970012523233890533447265625')``.

source: The *context* precision does not affect how many digits are stored. That is determined exclusively by the number of digits in *value*. For example, ``Decimal('3.00000')`` records all five zeros even if the context precision is only three.
pt_br: A precisão *context* não afeta quantos dígitos estão armazenados. Isso é determinado exclusivamente pelo número de dígitos em *value*. Por exemplo, ``Decimal('3.00000')`` registra todos os cinco zeros, mesmo que a precisão do contexto seja apenas três.

source: The purpose of the *context* argument is determining what to do if *value* is a malformed string. If the context traps :const:`InvalidOperation`, an exception is raised; otherwise, the constructor returns a new Decimal with the value of ``NaN``.
pt_br: O objetivo do argumento *context* é determinar o que fazer se *value* for uma string malformada. Se o contexto capturar :const:`InvalidOperation`, uma exceção será levantada; caso contrário, o construtor retornará um novo decimal com o valor de ``NaN``.

source: Once constructed, :class:`Decimal` objects are immutable.
pt_br: Uma vez construídos, objetos de :class:`Decimal` são imutáveis.

source: The argument to the constructor is now permitted to be a :class:`float` instance.
pt_br: O argumento para o construtor agora pode ser uma instância de :class:`float`.

source: :class:`float` arguments raise an exception if the :exc:`FloatOperation` trap is set. By default the trap is off.
pt_br: Os argumentos de :class:`float` levantam uma exceção se a armadilha :exc:`FloatOperation` estiver definida. Por padrão, a armadilha está desativada.

source: Underscores are allowed for grouping, as with integral and floating-point literals in code.
pt_br: Sublinhados são permitidos para agrupamento, como nos literais de ponto flutuante e integral no código.

source: Decimal floating-point objects share many properties with the other built-in numeric types such as :class:`float` and :class:`int`. All of the usual math operations and special methods apply. Likewise, decimal objects can be copied, pickled, printed, used as dictionary keys, used as set elements, compared, sorted, and coerced to another type (such as :class:`float` or :class:`int`).
pt_br: Objetos decimais de ponto flutuante compartilham muitas propriedades com outros tipos numéricos embutidos, como :class:`float` e :class:`int`. Todas as operações matemáticas usuais e métodos especiais se aplicam. Da mesma forma, objetos decimais podem ser copiados, separados, impressos, usados como chaves de dicionário, usados como elementos de conjunto, comparados, classificados e convertidos a outro tipo (como :class:`float` ou :class:`int`).

source: There are some small differences between arithmetic on Decimal objects and arithmetic on integers and floats. When the remainder operator ``%`` is applied to Decimal objects, the sign of the result is the sign of the *dividend* rather than the sign of the divisor::
pt_br: Existem algumas pequenas diferenças entre aritmética em objetos decimais e aritmética em números inteiros e flutuantes. Quando o operador de resto ``%`` é aplicado a objetos decimais, o sinal do resultado é o sinal do *dividend* em vez do sinal do divisor::

source: The integer division operator ``//`` behaves analogously, returning the integer part of the true quotient (truncating towards zero) rather than its floor, so as to preserve the usual identity ``x == (x // y) * y + x % y``::
pt_br: O operador de divisão inteira ``//`` se comporta de maneira análoga, retornando a parte inteira do quociente verdadeiro (truncando em direção a zero) em vez de seu resto, de modo a preservar a identidade usual ``x == (x // y) * y + x % y``::

source: The ``%`` and ``//`` operators implement the ``remainder`` and ``divide-integer`` operations (respectively) as described in the specification.
pt_br: Os operadores ``%`` e ``//`` implementam as operações de ``remainder`` e ``divide-integer`` (respectivamente) como descrito na especificação.

source: Decimal objects cannot generally be combined with floats or instances of :class:`fractions.Fraction` in arithmetic operations: an attempt to add a :class:`Decimal` to a :class:`float`, for example, will raise a :exc:`TypeError`. However, it is possible to use Python's comparison operators to compare a :class:`Decimal` instance ``x`` with another number ``y``. This avoids confusing results when doing equality comparisons between numbers of different types.
pt_br: Objetos decimais geralmente não podem ser combinados com pontos flutuantes ou instâncias de :class:`fractions.Fraction` em operações aritméticas: uma tentativa de adicionar um :class:`Decimal` a um :class:`float`, por exemplo, vai levantar um :exc:`TypeError`. No entanto, é possível usar os operadores de comparação do Python para comparar uma instância de :class:`Decimal` ``x`` com outro número ``y``. Isso evita resultados confusos ao fazer comparações de igualdade entre números de tipos diferentes.

source: Mixed-type comparisons between :class:`Decimal` instances and other numeric types are now fully supported.
pt_br: As comparações de tipos mistos entre instâncias de :class:`Decimal` e outros tipos numéricos agora são totalmente suportadas.

source: In addition to the standard numeric properties, decimal floating-point objects also have a number of specialized methods:
pt_br: Além das propriedades numéricas padrões, os objetos de ponto flutuante decimal também possuem vários métodos especializados:
