Repository: python/python-docs-pt-br
Catalog: library/devmode.po
Languages: pt_br

source: Python Development Mode
pt_br: Modo de Desenvolvimento do Python

source: The Python Development Mode introduces additional runtime checks that are too expensive to be enabled by default. It should not be more verbose than the default if the code is correct; new warnings are only emitted when an issue is detected.
pt_br: O Modo de Desenvolvimento do Python introduz verificações de tempo de execução adicionais que são muito custosas para serem ativadas por padrão. Não deve ser mais detalhado que o padrão se o código estiver correto; novos avisos são emitidos somente quando um problema é detectado.

source: It can be enabled using the :option:`-X dev <-X>` command line option or by setting the :envvar:`PYTHONDEVMODE` environment variable to ``1``.
pt_br: Ele pode ser ativado usando a opção de linha de comando :option:`-X dev <-X>` ou configurando a variável de ambiente :envvar:`PYTHONDEVMODE` como ``1``.

source: See also :ref:`Python debug build <debug-build>`.
pt_br: Veja também a :ref:`compilação de depuração do Python <debug-build>`.

source: Effects of the Python Development Mode
pt_br: Efeitos do Modo de Desenvolvimento do Python

source: Enabling the Python Development Mode is similar to the following command, but with additional effects described below::
pt_br: A ativação do Modo de Desenvolvimento do Python é semelhante ao comando a seguir, mas com efeitos adicionais descritos abaixo::

source: Effects of the Python Development Mode:
pt_br: Efeitos do Modo de Desenvolvimento do Python:

source: Add ``default`` :ref:`warning filter <describing-warning-filters>`. The following warnings are shown:
pt_br: Adiciona o :ref:`filtro de avisos <describing-warning-filters>` ``default``. Os seguintes avisos são exibidos:

source: Normally, the above warnings are filtered by the default :ref:`warning filters <describing-warning-filters>`.
pt_br: Normalmente, os avisos acima são filtrados pelos :ref:`filtros de avisos <describing-warning-filters>` padrão.

source: It behaves as if the :option:`-W default <-W>` command line option is used.
pt_br: Ele se comporta como se a opção de linha de comando :option:`-W default <-W>` fosse usada.

source: Use the :option:`-W error <-W>` command line option or set the :envvar:`PYTHONWARNINGS` environment variable to ``error`` to treat warnings as errors.
pt_br: Use a opção de linha de comando :option:`-W error <-W>` ou defina a variável de ambiente :envvar:`PYTHONWARNINGS` com ``error`` para tratar avisos como erros.

source: Install debug hooks on memory allocators to check for:
pt_br: Instala ganchos de depuração nos alocadores de memória para verificar por:

source: Buffer underflow
pt_br: Estouro negativo de buffer

source: Buffer overflow
pt_br: Estouro de buffer

source: Memory allocator API violation
pt_br: Violação de API de alocador de memória

source: Unsafe usage of the GIL
pt_br: Uso inseguro da GIL

source: See the :c:func:`PyMem_SetupDebugHooks` C function.
pt_br: Consulte a função C :c:func:`PyMem_SetupDebugHooks`.

source: It behaves as if the :envvar:`PYTHONMALLOC` environment variable is set to ``debug``.
pt_br: Se comporta como se a variável de ambiente :envvar:`PYTHONMALLOC` estivesse definida com ``debug``.

source: To enable the Python Development Mode without installing debug hooks on memory allocators, set the :envvar:`PYTHONMALLOC` environment variable to ``default``.
pt_br: Para habilitar o Modo de Desenvolvimento do Python sem instalar ganchos de depuração nos alocadores de memória, defina a variável de ambiente :envvar:`PYTHONMALLOC` como ``default``.

source: Call :func:`faulthandler.enable` at Python startup to install handlers for the :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` and :const:`~signal.SIGILL` signals to dump the Python traceback on a crash.
pt_br: Chama :func:`faulthandler.enable` na inicialização do Python para instalar manipuladores para os sinais :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` e :const:`~signal.SIGILL` para despejar o traceback (situação da pilha de execução) do Python no caso de travamento.

source: It behaves as if the :option:`-X faulthandler <-X>` command line option is used or if the :envvar:`PYTHONFAULTHANDLER` environment variable is set to ``1``.
pt_br: Ele se comporta como se a opção de linha de comando :option:`-X faulthandler <-X>` fosse usada ou se a variável de ambiente :envvar:`PYTHONFAULTHANDLER` estivesse definida como ``1``.

source: Enable :ref:`asyncio debug mode <asyncio-debug-mode>`. For example, :mod:`asyncio` checks for coroutines that were not awaited and logs them.
pt_br: Ativa o :ref:`modo de depuração de asyncio <asyncio-debug-mode>`. Por exemplo, :mod:`asyncio` verifica as corrotinas que não foram aguardadas (*await*) e as registra.

source: It behaves as if the :envvar:`PYTHONASYNCIODEBUG` environment variable is set to ``1``.
pt_br: Ele se comporta como se a variável de ambiente :envvar:`PYTHONASYNCIODEBUG` estivesse definida como ``1``.

source: Check the *encoding* and *errors* arguments for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
pt_br: Verifica os argumentos *encoding* e *errors* para operações de codificação e decodificação de strings. Exemplos: :func:`open`, :meth:`str.encode` e :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings.
pt_br: Por padrão, para obter o melhor desempenho, o argumento *errors* é verificado apenas no primeiro erro de codificação/decodificação, e o argumento *encoding* às vezes é ignorado para strings vazias.

source: The :class:`io.IOBase` destructor logs ``close()`` exceptions.
pt_br: O destrutor de :class:`io.IOBase` registra exceções ``close()``.

source: Set the :attr:`~sys.flags.dev_mode` attribute of :data:`sys.flags` to ``True``.
pt_br: Define o atributo :attr:`~sys.flags.dev_mode` de :data:`sys.flags` como ``True``.

source: The Python Development Mode does not enable the :mod:`tracemalloc` module by default, because the overhead cost (to performance and memory) would be too large. Enabling the :mod:`tracemalloc` module provides additional information on the origin of some errors. For example, :exc:`ResourceWarning` logs the traceback where the resource was allocated, and a buffer overflow error logs the traceback where the memory block was allocated.
pt_br: O Modo de Desenvolvimento do Python não ativa o módulo :mod:`tracemalloc` por padrão porque o custo adicional (para desempenho e memória) seria muito grande. A ativação do módulo :mod:`tracemalloc` fornece informações adicionais sobre a origem de alguns erros. Por exemplo, :exc:`ResourceWarning` registra o retorno ao local onde o recurso foi alocado, e um erro de estouro de buffer registra o retorno ao local onde o bloco de memória foi alocado.

source: The Python Development Mode does not prevent the :option:`-O` command line option from removing :keyword:`assert` statements nor from setting :const:`__debug__` to ``False``.
pt_br: O Modo de Desenvolvimento do Python não impede que a opção de linha de comando :option:`-O` remova as instruções :keyword:`assert` nem configure :const:`__debug__` como ``False``.

source: The Python Development Mode can only be enabled at the Python startup. Its value can be read from :data:`sys.flags.dev_mode <sys.flags>`.
pt_br: O Modo de Desenvolvimento do Python só pode ser ativado na inicialização do Python. Seu valor pode ser lido de :data:`sys.flags.dev_mode <sys.flags>`.

source: The :class:`io.IOBase` destructor now logs ``close()`` exceptions.
pt_br: O destrutor de :class:`io.IOBase` agora registra exceções ``close()``.

source: The *encoding* and *errors* arguments are now checked for string encoding and decoding operations.
pt_br: Os argumentos *encoding* e *errors* agora são verificados para operações de codificação e decodificação de strings.

source: ResourceWarning Example
pt_br: Exemplo de ResourceWarning

source: Example of a script counting the number of lines of the text file specified in the command line::
pt_br: Exemplo de um script que conta o número de linhas do arquivo texto especificado na linha de comando::

source: import sys def main(): fp = open(sys.argv[1]) nlines = len(fp.readlines()) print(nlines) # The file is closed implicitly if __name__ == "__main__": main()
pt_br: import sys def main(): fp = open(sys.argv[1]) nlines = len(fp.readlines()) print(nlines) # O arquivo é fechado implicitamente if __name__ == "__main__": main()

source: The script does not close the file explicitly. By default, Python does not emit any warning. Example using README.txt, which has 269 lines:
pt_br: O script não fecha o arquivo explicitamente. Por padrão, o Python não emite nenhum aviso. Exemplo usando README.txt, que possui 269 linhas:

source: Enabling the Python Development Mode displays a :exc:`ResourceWarning` warning:
pt_br: A ativação do Modo de Desenvolvimento do Python exibe um aviso :exc:`ResourceWarning`:

source: In addition, enabling :mod:`tracemalloc` shows the line where the file was opened:
pt_br: Além disso, ativar :mod:`tracemalloc` mostra a linha em que o arquivo foi aberto:

source: The fix is to close explicitly the file. Example using a context manager::
pt_br: A correção é fechar explicitamente o arquivo. Exemplo usando um gerenciador de contexto::

source: def main(): # Close the file explicitly when exiting the with block with open(sys.argv[1]) as fp: nlines = len(fp.readlines()) print(nlines)
pt_br: def main(): # Fecha o arquivo explicitamente ao sair do bloco with with open(sys.argv[1]) as fp: nlines = len(fp.readlines()) print(nlines)

source: Not closing a resource explicitly can leave a resource open for way longer than expected; it can cause severe issues upon exiting Python. It is bad in CPython, but it is even worse in PyPy. Closing resources explicitly makes an application more deterministic and more reliable.
pt_br: Não fechar um recurso explicitamente pode deixá-lo aberto por muito mais tempo do que o esperado; isso pode causar problemas graves ao sair do Python. É ruim no CPython, mas é ainda pior no PyPy. Fechar recursos explicitamente torna uma aplicação mais determinística e mais confiável.

source: Bad file descriptor error example
pt_br: Exemplo de erro de descritor de arquivo inválido

source: Script displaying the first line of itself::
pt_br: Script exibindo sua própria primeira linha::

source: import os def main(): fp = open(__file__) firstline = fp.readline() print(firstline.rstrip()) os.close(fp.fileno()) # The file is closed implicitly main()
pt_br: import os def main(): fp = open(__file__) firstline = fp.readline() print(firstline.rstrip()) os.close(fp.fileno()) # O arquivo é fechado explicitamente main()

source: By default, Python does not emit any warning:
pt_br: Por padrão, o Python não emite qualquer aviso:

source: The Python Development Mode shows a :exc:`ResourceWarning` and logs a "Bad file descriptor" error when finalizing the file object:
pt_br: O Modo de Desenvolvimento do Python mostra uma :exc:`ResourceWarning` e registra um erro "Bad file descriptor" ao finalizar o objeto arquivo:

source: ``os.close(fp.fileno())`` closes the file descriptor. When the file object finalizer tries to close the file descriptor again, it fails with the ``Bad file descriptor`` error. A file descriptor must be closed only once. In the worst case scenario, closing it twice can lead to a crash (see :issue:`18748` for an example).
pt_br: ``os.close(fp.fileno())`` fecha o descritor de arquivo. Quando o finalizador de objeto arquivo tenta fechar o descritor de arquivo novamente, ele falha com o erro ``Bad file descriptor``. Um descritor de arquivo deve ser fechado apenas uma vez. Na pior das hipóteses, fechá-lo duas vezes pode causar um acidente (consulte :issue:`18748` para um exemplo).

source: The fix is to remove the ``os.close(fp.fileno())`` line, or open the file with ``closefd=False``.
pt_br: A correção é remover a linha ``os.close(fp.fileno())`` ou abrir o arquivo com ``closefd=False``.
