Repository: python/python-docs-pt-br
Catalog: library/dis.po
Languages: pt_br

source: Sequence of bytecodes that access a free variable (note that 'free' in this context refers to names in the current scope that are referenced by inner scopes or names in outer scopes that are referenced from this scope. It does *not* include references to global or builtin scopes).
pt_br: Послідовність байт-кодів, які мають доступ до вільної змінної (зауважте, що "вільний" у цьому контексті стосується імен у поточній області, на які посилаються внутрішні області, або імен у зовнішніх областях, на які посилається ця область. Він *не* включає посилання на глобальні або вбудовані області).

source: Sequence of bytecodes that access an attribute by name.
pt_br: Послідовність байт-кодів, які звертаються до атрибута за назвою.

source: Sequence of bytecodes that have a relative jump target.
pt_br: Послідовність байт-кодів, які мають відносну ціль переходу.

source: Sequence of bytecodes that have an absolute jump target.
pt_br: Послідовність байт-кодів, які мають абсолютну ціль переходу.

source: Sequence of bytecodes that access a local variable.
pt_br: Послідовність байт-кодів, які звертаються до локальної змінної.

source: Sequence of bytecodes of Boolean operations.
pt_br: Послідовність байт-кодів булевих операцій.
