Repository: python/python-docs-pt-br
Catalog: library/dis.po
Languages: pt_br

source: :mod:`dis` --- Disassembler for Python bytecode
pt_br: :mod:`dis` --- Python bytecode的反組譯器

source: **Source code:** :source:`Lib/dis.py`
pt_br: **Código-fonte:** :source:`Lib/dis.py`

source: The :mod:`dis` module supports the analysis of CPython :term:`bytecode` by disassembling it. The CPython bytecode which this module takes as an input is defined in the file :file:`Include/opcode.h` and used by the compiler and the interpreter.
pt_br: O módulo :mod:`dis` oferece suporte à análise de :term:`bytecode` do CPython, desmontando-o. O bytecode do CPython que o módulo leva como entrada é definido no arquivo :file:`Include/opcode.h` e usado pelo compilador e pelo interpretador.

source: Bytecode is an implementation detail of the CPython interpreter. No guarantees are made that bytecode will not be added, removed, or changed between versions of Python. Use of this module should not be considered to work across Python VMs or Python releases.
pt_br: O bytecode é um detalhe de implementação do interpretador CPython. Não há garantias de que bytecodes não serão adicionados, removidos ou alterados entre as versões do Python. O uso deste módulo não deve ser considerado que funcionará em todas as VMs do Python ou mesmo versões do Python.

source: Use 2 bytes for each instruction. Previously the number of bytes varied by instruction.
pt_br: Cada instrução ocupa 2 bytes. Anteriormente, o número de bytes variava de acordo com a instrução.

source: Example: Given the function :func:`myfunc`::
pt_br: Exemplo: Dada a função :func:`myfunc`::

source: the following command can be used to display the disassembly of :func:`myfunc`::
pt_br: o seguinte comando pode ser usado para exibir a desmontagem da função :func:`myfunc`::

source: (The "2" is a line number).
pt_br: (O "2" é o número da linha).

source: Bytecode analysis
pt_br: Análise de bytecode

source: The bytecode analysis API allows pieces of Python code to be wrapped in a :class:`Bytecode` object that provides easy access to details of the compiled code.
pt_br: A API de análise de bytecode permite que partes do código Python sejam encapsuladas em um objeto :class:`Bytecode` que facilite o acesso aos detalhes do código compilado.

source: Analyse the bytecode corresponding to a function, generator, asynchronous generator, coroutine, method, string of source code, or a code object (as returned by :func:`compile`).
pt_br: Analisa o bytecode correspondente a uma função, um gerador, um gerador assíncrono, uma corrotina, um método, uma string de código-fonte, ou um objeto de código (conforme retornado por :func:`compile`).

source: This is a convenience wrapper around many of the functions listed below, most notably :func:`get_instructions`, as iterating over a :class:`Bytecode` instance yields the bytecode operations as :class:`Instruction` instances.
pt_br: Esta é um invólucro de conveniência que encapsula muitas das funções listadas abaixo, principalmente a :func:`get_instructions`, já que iterar sobre sobre uma instância de :class:`Bytecode` produz operações bytecode como instâncias de :class:`Instruction`.

source: If *first_line* is not ``None``, it indicates the line number that should be reported for the first source line in the disassembled code. Otherwise, the source line information (if any) is taken directly from the disassembled code object.
pt_br: Se *first_line* não for ``None``, ele indica o número de linha que deve ser reportado para a primeira linha de código-fonte no código desmontado. Caso contrário, a informação de linha de código-fonte (se houver) é extraída diretamente da desconstrução do objeto de código.

source: If *current_offset* is not ``None``, it refers to an instruction offset in the disassembled code. Setting this means :meth:`.dis` will display a "current instruction" marker against the specified opcode.
pt_br: Se *current_offset* não for ``None``, ele é um deslocamento em instruções no código desconstruído. Definir este argumento significa que o :meth:`.dis` vai mostrar um marcador de "instrução atual" sobre o opcode especificado.

source: Construct a :class:`Bytecode` instance from the given traceback, setting *current_offset* to the instruction responsible for the exception.
pt_br: Constrói uma instância de :class:`Bytecode` a partir do traceback fornecido, definindo *current_offset* apontando para a instrução responsável pela exceção.

source: The compiled code object.
pt_br: O objeto de código compilado.

source: The first source line of the code object (if available)
pt_br: A primeira linha de código-fonte do objeto de código (caso disponível).

source: Return a formatted view of the bytecode operations (the same as printed by :func:`dis.dis`, but returned as a multi-line string).
pt_br: Retorna uma visualização formatada das operações em bytecode (as mesmas que seriam impressas pela :func:`dis.dis`, mas retornadas como uma string multilinha).

source: Return a formatted multi-line string with detailed information about the code object, like :func:`code_info`.
pt_br: Retorna uma string multilinha formatada com informação detalhada sobre o objeto de código, como :func:`code_info`.

source: This can now handle coroutine and asynchronous generator objects.
pt_br: Este método agora lida com objetos de corrotina e de gerador assíncrono.

source: Example::
pt_br: Exemplo::

source: Analysis functions
pt_br: Funções de análise

source: The :mod:`dis` module also defines the following analysis functions that convert the input directly to the desired output. They can be useful if only a single operation is being performed, so the intermediate analysis object isn't useful:
pt_br: O módulo :mod:`dis` também define as seguintes funções que convertem a entrada diretamente para a saída desejada. Elas podem ser úteis se somente uma única operação está sendo feita, de forma que o objeto de análise intermediário não é útil:

source: Return a formatted multi-line string with detailed code object information for the supplied function, generator, asynchronous generator, coroutine, method, source code string or code object.
pt_br: Retorna uma string multilinha formatada com informação detalhada sobre o objeto de código correspondente à função, gerador, gerador assíncrono, corrotina, método, string de código-fonte ou objeto de código fornecido.

source: Note that the exact contents of code info strings are highly implementation dependent and they may change arbitrarily across Python VMs or Python releases.
pt_br: Observe que o conteúdo exato de strings de informação de código são altamente dependentes da implementação e podem mudar de forma arbitrária através de VMs Python ou lançamentos do Python.

source: Print detailed code object information for the supplied function, method, source code string or code object to *file* (or ``sys.stdout`` if *file* is not specified).
pt_br: Imprime no arquivo *file* (ou ``sys.stdout`` caso *file* não seja especificado) informações detalhadas sobre o objeto de código correspondente à função, método, string de código-fonte fornecido.

source: This is a convenient shorthand for ``print(code_info(x), file=file)``, intended for interactive exploration at the interpreter prompt.
pt_br: Este é um atalho conveniente para ``print(code_info(x), file=file)``, destinado à exploração interativa no prompt do interpretador.

source: Added *file* parameter.
pt_br: Adicionado o parâmetro *file*.

source: Disassemble the *x* object. *x* can denote either a module, a class, a method, a function, a generator, an asynchronous generator, a coroutine, a code object, a string of source code or a byte sequence of raw bytecode. For a module, it disassembles all functions. For a class, it disassembles all methods (including class and static methods). For a code object or sequence of raw bytecode, it prints one line per bytecode instruction. It also recursively disassembles nested code objects (the code of comprehensions, generator expressions and nested functions, and the code used for building nested classes). Strings are first compiled to code objects with the :func:`compile` built-in function before being disassembled. If no object is provided, this function disassembles the last traceback.
pt_br: Розберіть об'єкт *x*. *x* може позначати модуль, клас, метод, функцію, генератор, асинхронний генератор, співпрограму, кодовий об’єкт, рядок вихідного коду або послідовність байтів необробленого байт-коду. Для модуля він розбирає всі функції. Для класу він розбирає всі методи (включаючи класові та статичні методи). Для кодового об’єкта або послідовності необробленого байт-коду він друкує один рядок для кожної інструкції байт-коду. Він також рекурсивно розбирає вкладені об’єкти коду (код розуміння, вирази генератора та вкладені функції, а також код, який використовується для створення вкладених класів). Рядки спочатку компілюються для кодування об’єктів за допомогою вбудованої функції :func:`compile` перед розбиранням. Якщо об’єкт не надано, ця функція розбирає останню трасування.

source: The disassembly is written as text to the supplied *file* argument if provided and to ``sys.stdout`` otherwise.
pt_br: O resultado é escrito como texto no arquivo *file* caso tenha sido fornecido como argumento, ou para ``sys.stdout`` caso contrário.

source: The maximal depth of recursion is limited by *depth* unless it is ``None``. ``depth=0`` means no recursion.
pt_br: A profundidade máxima de recursão é limitada por *depth* a menos que seja ``None``. ``depth=0`` significa não fazer recursão.

source: Implemented recursive disassembling and added *depth* parameter.
pt_br: Foi implementada a desmontagem recursiva, e adicionado o parâmetro *depth*.

source: Disassemble the top-of-stack function of a traceback, using the last traceback if none was passed. The instruction causing the exception is indicated.
pt_br: Desmonta a função no topo da pilha de um traceback, usando o último traceback caso nenhum tenha sido passado. A instrução que causou a exceção é indicada.

source: Disassemble a code object, indicating the last instruction if *lasti* was provided. The output is divided in the following columns:
pt_br: Desmonta um objeto de código, indicando a última instrução se *lasti* tiver sido fornecido. A saída é dividida em colunas da seguinte forma:

source: the line number, for the first instruction of each line
pt_br: o número da linha, para a primeira instrução de cada linha

source: the current instruction, indicated as ``-->``,
pt_br: a instrução atual, indicada por ``-->``,

source: a labelled instruction, indicated with ``>>``,
pt_br: um rótulo da instrução, indicado com ``>>``,

source: the address of the instruction,
pt_br: o endereço da instrução

source: the operation code name,
pt_br: o nome do código da operação,

source: operation parameters, and
pt_br: os parâmetros da operação, e

source: interpretation of the parameters in parentheses.
pt_br: a interpretação dos parâmetros, em parênteses.

source: The parameter interpretation recognizes local and global variable names, constant values, branch targets, and compare operators.
pt_br: A interpretação dos parâmetros reconhece nomes de variáveis locais e globais, valores de constantes, alvos de ramificações, e operadores de comparação.

source: Return an iterator over the instructions in the supplied function, method, source code string or code object.
pt_br: Retorna um iterador sobre as instruções na função, método, string de código-fonte ou objeto de código fornecido.

source: The iterator generates a series of :class:`Instruction` named tuples giving the details of each operation in the supplied code.
pt_br: O iterador gera uma série de tuplas nomeadas :class:`Instruction` contendo detalhes de cada operação no código fornecido.

source: Line numbers can be decreasing. Before, they were always increasing.
pt_br: Números de linhas podem ser decrescentes. Antes, eles eram sempre crescentes.

source: Detect all offsets in the raw compiled bytecode string *code* which are jump targets, and return a list of these offsets.
pt_br: Detecta todas as posições na string de bytecode compilado bruto *code* que são alvos de pulos, e as retorna em uma lista.

source: Compute the stack effect of *opcode* with argument *oparg*.
pt_br: Calcula o efeito que o *opcode* com argumento *oparg* tem na pilha.

source: If the code has a jump target and *jump* is ``True``, :func:`~stack_effect` will return the stack effect of jumping. If *jump* is ``False``, it will return the stack effect of not jumping. And if *jump* is ``None`` (default), it will return the maximal stack effect of both cases.
pt_br: Se a operação tiver um alvo de pulo e *jump* for ``True``, :func:`~stack_effect` vai retornar o efeito na pilha de realizar o pulo. Se *jump* for ``False``, ela vai retornar o efeito na pilha de não pular. E se *jump* for ``None`` (o padrão), vai retornar o efeito máximo na pilha dentre os dois casos.

source: Added *jump* parameter.
pt_br: Adicionado o parâmetro *jump*.

source: Python Bytecode Instructions
pt_br: Instruções em bytecode do Python

source: The :func:`get_instructions` function and :class:`Bytecode` class provide details of bytecode instructions as :class:`Instruction` instances:
pt_br: A função :func:`get_instructions` e a classe :class:`Bytecode` fornecem detalhes de instruções de bytecode como instâncias de :class:`Instruction`:

source: Details for a bytecode operation
pt_br: Detalhes de uma operação em bytecode

source: numeric code for operation, corresponding to the opcode values listed below and the bytecode values in the :ref:`opcode_collections`.
pt_br: código numérico da operação, correspondendo aos valores dos opcodes listados abaixo e aos valores dos bytecodes nas :ref:`opcode_collections`.

source: human readable name for operation
pt_br: nome legível por humanos para a operação

source: numeric argument to operation (if any), otherwise ``None``
pt_br: argumento numérico para a operação (se houver), caso contrário ``None``

source: resolved arg value (if known), otherwise same as arg
pt_br: (もし分かっていれば) 解決された引数の値、そうでない場合は arg と同じもの

source: human readable description of operation argument
pt_br: 人間が読むための命令引数の説明

source: start index of operation within bytecode sequence
pt_br: índice de início da operação dentro da sequência de bytecodes

source: line started by this opcode (if any), otherwise ``None``
pt_br: рядок починається цим кодом операції (якщо є), інакше ``None``

source: ``True`` if other code jumps to here, otherwise ``False``
pt_br: ``True`` se algum outro código pula para cá, senão ``False``

source: The Python compiler currently generates the following bytecode instructions.
pt_br: O compilador de Python atualmente gera as seguintes instruções de bytecode.

source: **General instructions**
pt_br: **Instruções gerais**

source: Do nothing code. Used as a placeholder by the bytecode optimizer.
pt_br: なにもしないコード。バイトコードオプティマイザでプレースホルダとして使われます。

source: Removes the top-of-stack (TOS) item.
pt_br: Видаляє елемент верхнього стека (TOS).

source: Swaps the two top-most stack items.
pt_br: スタックの先頭の 2 つの要素を入れ替えます。

source: Lifts second and third stack item one position up, moves top down to position three.
pt_br: スタックの二番目と三番目の要素の位置を 1 つ上げ、先頭を三番目へ下げます。

source: Lifts second, third and fourth stack items one position up, moves top down to position four.
pt_br: 将第二个、第三个和第四个堆栈项向上提升一个位置，将顶项移动到第四个位置。

source: Duplicates the reference on top of the stack.
pt_br: スタックの先頭にある参照の複製を作ります。

source: Duplicates the two references on top of the stack, leaving them in the same order.
pt_br: スタックの先頭の2つの参照を、そのままの順番で複製します。

source: **Unary operations**
pt_br: **Operações unárias**

source: Unary operations take the top of the stack, apply the operation, and push the result back on the stack.
pt_br: Operações unárias tiram o topo da pilha, aplicam a operação, e põem o resultado de volta na pilha.

source: Implements ``TOS = +TOS``.
pt_br: 实现 ``TOS = +TOS``。

source: Implements ``TOS = -TOS``.
pt_br: 实现 ``TOS = -TOS``。

source: Implements ``TOS = not TOS``.
pt_br: 实现 ``TOS = not TOS``。

source: Implements ``TOS = ~TOS``.
pt_br: Implementação ``TOS = ~TOS``.

source: Implements ``TOS = iter(TOS)``.
pt_br: Implementa ``TOS = iter(TOS)``.

source: If ``TOS`` is a :term:`generator iterator` or :term:`coroutine` object it is left as is. Otherwise, implements ``TOS = iter(TOS)``.
pt_br: Якщо ``TOS`` є об’єктом :term:`generator iterator` або :term:`coroutine`, він залишається таким, як є. В іншому випадку реалізує ``TOS = iter(TOS)``.

source: **Binary operations**
pt_br: **Operações Binárias**

source: Binary operations remove the top of the stack (TOS) and the second top-most stack item (TOS1) from the stack. They perform the operation, and put the result back on the stack.
pt_br: Двійкові операції видаляють верхню частину стека (TOS) і другий найвищий елемент стека (TOS1) зі стеку. Вони виконують операцію та повертають результат у стек.

source: Implements ``TOS = TOS1 ** TOS``.
pt_br: Implementa ``TOS = TOS1 ** TOS``.

source: Implements ``TOS = TOS1 * TOS``.
pt_br: ``TOS = TOS1 * TOS`` を実行します。

source: Implements ``TOS = TOS1 @ TOS``.
pt_br: Implementado ``TOS = TOS1 @ TOS``.

source: Implements ``TOS = TOS1 // TOS``.
pt_br: Implementa ``TOS = TOS1 // TOS``.

source: Implements ``TOS = TOS1 / TOS``.
pt_br: Implementa ``TOS = TOS1 / TOS``.

source: Implements ``TOS = TOS1 % TOS``.
pt_br: Implementa ``TOS = TOS1 % TOS``.

source: Implements ``TOS = TOS1 + TOS``.
pt_br: ``TOS = TOS1 + TOS`` を実行します。

source: Implements ``TOS = TOS1 - TOS``.
pt_br: ``TOS = TOS1 - TOS`` を実行します。

source: Implements ``TOS = TOS1[TOS]``.
pt_br: 实现 ``TOS = TOS1[TOS]``。

source: Implements ``TOS = TOS1 << TOS``.
pt_br: ``TOS = TOS1 << TOS`` を実行します。

source: Implements ``TOS = TOS1 >> TOS``.
pt_br: ``TOS = TOS1 >> TOS`` を実行します。

source: Implements ``TOS = TOS1 & TOS``.
pt_br: ``TOS = TOS1 & TOS`` を実行します。

source: Implements ``TOS = TOS1 ^ TOS``.
pt_br: ``TOS = TOS1 ^ TOS`` を実行します。

source: Implements ``TOS = TOS1 | TOS``.
pt_br: ``TOS = TOS1 | TOS`` を実行します。

source: **In-place operations**
pt_br: **インプレース (in-place) 命令**

source: In-place operations are like binary operations, in that they remove TOS and TOS1, and push the result back on the stack, but the operation is done in-place when TOS1 supports it, and the resulting TOS may be (but does not have to be) the original TOS1.
pt_br: Операції на місці схожі на двійкові операції, оскільки вони видаляють TOS і TOS1 і повертають результат назад у стек, але операція виконується на місці, коли TOS1 підтримує це, і результуючий TOS може бути (але не має бути) оригінальний TOS1.

source: Implements in-place ``TOS = TOS1 ** TOS``.
pt_br: インプレースの ``TOS = TOS1 ** TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 * TOS``.
pt_br: インプレースの ``TOS = TOS1 * TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 @ TOS``.
pt_br: インプレースの ``TOS = TOS1 @ TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 // TOS``.
pt_br: インプレースの ``TOS = TOS1 // TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 / TOS``.
pt_br: インプレースの ``TOS = TOS1 / TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 % TOS``.
pt_br: インプレースの ``TOS = TOS1 % TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 + TOS``.
pt_br: インプレースの ``TOS = TOS1 + TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 - TOS``.
pt_br: インプレースの ``TOS = TOS1 - TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 << TOS``.
pt_br: インプレースの ``TOS = TOS1 << TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 >> TOS``.
pt_br: インプレースの ``TOS = TOS1 >> TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 & TOS``.
pt_br: インプレースの ``TOS = TOS1 & TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 ^ TOS``.
pt_br: インプレースの ``TOS = TOS1 ^ TOS`` を実行します。

source: Implements in-place ``TOS = TOS1 | TOS``.
pt_br: インプレースの ``TOS = TOS1 | TOS`` を実行します。

source: Implements ``TOS1[TOS] = TOS2``.
pt_br: Реалізує ``TOS1[TOS] = TOS2``.

source: Implements ``del TOS1[TOS]``.
pt_br: Реалізує ``del TOS1[TOS]``.

source: **Coroutine opcodes**
pt_br: **Opcodes para corrotinas**

source: Implements ``TOS = get_awaitable(TOS)``, where ``get_awaitable(o)`` returns ``o`` if ``o`` is a coroutine object or a generator object with the CO_ITERABLE_COROUTINE flag, or resolves ``o.__await__``.
pt_br: Реалізує ``TOS = get_awaitable(TOS)``, де ``get_awaitable(o)`` повертає ``o``, якщо ``o`` є об'єктом співпрограми або об'єктом генератора з прапором CO_ITERABLE_COROUTINE, або вирішує ``o.__await__``.

source: Implements ``TOS = TOS.__aiter__()``.
pt_br: Реалізує ``TOS = TOS.__aiter__()``.

source: Returning awaitable objects from ``__aiter__`` is no longer supported.
pt_br: Não é mais aceitado que o ``__aiter__`` retorne objetos aguardáveis.

source: Terminates an :keyword:`async for` loop. Handles an exception raised when awaiting a next item. If TOS is :exc:`StopAsyncIteration` pop 7 values from the stack and restore the exception state using the second three of them. Otherwise re-raise the exception using the three values from the stack. An exception handler block is removed from the block stack.
pt_br: 终止一个 :keyword:`async for` 循环。处理等待下一个项目时引发的异常。如果 TOS 是 :exc:`StopAsyncIteration`， 从堆栈弹出7个值，并使用后三个恢复异常状态。否则，使用堆栈中的三个值重新引发异常。从块堆栈中删除异常处理程序块。

source: Resolves ``__aenter__`` and ``__aexit__`` from the object on top of the stack. Pushes ``__aexit__`` and result of ``__aenter__()`` to the stack.
pt_br: Вирішує ``__aenter__`` і ``__aexit__`` з об’єкта на вершині стека. Надсилає ``__aexit__`` і результат ``__aenter__()`` до стеку.

source: Creates a new frame object.
pt_br: 新たなフレームオブジェクトを作成します。

source: **Miscellaneous opcodes**
pt_br: **Opcodes genéricos**

source: Implements the expression statement for the interactive mode. TOS is removed from the stack and printed. In non-interactive mode, an expression statement is terminated with :opcode:`POP_TOP`.
pt_br: Реалізує оператор виразу для інтерактивного режиму. TOS видаляється зі стеку та друкується. У неінтерактивному режимі оператор виразу завершується :opcode:`POP_TOP`.

source: Calls ``set.add(TOS1[-i], TOS)``. Used to implement set comprehensions.
pt_br: Викликає ``set.add(TOS1[-i], TOS)``. Використовується для реалізації розуміння набору.

source: Calls ``list.append(TOS1[-i], TOS)``. Used to implement list comprehensions.
pt_br: Викликає ``list.append(TOS1[-i], TOS)``. Використовується для реалізації розуміння списку.

source: Calls ``dict.__setitem__(TOS1[-i], TOS1, TOS)``. Used to implement dict comprehensions.
pt_br: Викликає ``dict.__setitem__(TOS1[-i], TOS1, TOS)``. Використовується для реалізації диктового розуміння.

source: Map value is TOS and map key is TOS1. Before, those were reversed.
pt_br: Значення карти – TOS, а ключ карти – TOS1. Раніше вони були змінені.

source: For all of the :opcode:`SET_ADD`, :opcode:`LIST_APPEND` and :opcode:`MAP_ADD` instructions, while the added value or key/value pair is popped off, the container object remains on the stack so that it is available for further iterations of the loop.
pt_br: Para as instruções :opcode:`SET_ADD`, :opcode:`LIST_APPEND` e :opcode:`MAP_ADD`, o valor ou par chave/valor é removido da pilha, mas o objeto de contêiner continua na pilha para que ele esteja disponível para as iterações seguintes do laço.

source: Returns with TOS to the caller of the function.
pt_br: Повертається з TOS до абонента функції.

source: Pops TOS and yields it from a :term:`generator`.
pt_br: Витягує TOS і повертає його з :term:`generator`.

source: Pops TOS and delegates to it as a subiterator from a :term:`generator`.
pt_br: Видає TOS і делегує йому як субітератор із :term:`generator`.
