Repository: python/python-docs-pt-br
Catalog: library/dis.po
Languages: pt_br

source: Checks whether ``__annotations__`` is defined in ``locals()``, if not it is set up to an empty ``dict``. This opcode is only emitted if a class or module body contains :term:`variable annotations <variable annotation>` statically.
pt_br: Verifica se ``__annotations__`` está definido em ``locals()`` e, se não estiver, é inicializado como um ``dict`` vazio. Este opcode é emitido somente se o corpo de uma classe ou módulo contém :term:`anotações de variáveis <anotação de variável>` estaticamente.

source: Loads all symbols not starting with ``'_'`` directly from the module TOS to the local namespace. The module is popped after loading all names. This opcode implements ``from module import *``.
pt_br: Завантажує всі символи, які не починаються з ``'_'`` безпосередньо з TOS модуля в локальний простір імен. Модуль відкривається після завантаження всіх імен. Цей код операції реалізує ``from module import *``.

source: Removes one block from the block stack. Per frame, there is a stack of blocks, denoting :keyword:`try` statements, and such.
pt_br: 从块堆栈中删除一个块。有一块堆栈，每帧用于表示 :keyword:`try` 语句等。

source: Removes one block from the block stack. The popped block must be an exception handler block, as implicitly created when entering an except handler. In addition to popping extraneous values from the frame stack, the last three popped values are used to restore the exception state.
pt_br: ブロックスタックからブロックを1つ取り除きます。 ポップされたブロックは、例外ハンドラに入ったときに暗黙的に生成された例外ハンドラのブロックでなければなりません。 フレームスタックから本質的でない値をポップするのに加えて、直前にポップした3つの値が例外状態を回復するのに使われます。

source: Calls the function in position 7 on the stack with the top three items on the stack as arguments. Used to implement the call ``context_manager.__exit__(*exc_info())`` when an exception has occurred in a :keyword:`with` statement.
pt_br: 调用堆栈中 7 号位置上的函数并附带栈顶位置的三项作为参数。 用来在 :keyword:`with` 语句内发生异常时实现调用 ``context_manager.__exit__(*exc_info())``。

source: Pushes :exc:`AssertionError` onto the stack. Used by the :keyword:`assert` statement.
pt_br: Põe :exc:`AssertionError` no topo da pilha. Usado pela instrução :keyword:`assert`.

source: Pushes :func:`builtins.__build_class__` onto the stack. It is later called by :opcode:`CALL_FUNCTION` to construct a class.
pt_br: :func:`builtins.__build_class__` をスタックにプッシュします。 これはクラスを構築するために、後で :opcode:`CALL_FUNCTION` に呼ばれます。

source: This opcode performs several operations before a with block starts. First, it loads :meth:`~object.__exit__` from the context manager and pushes it onto the stack for later use by :opcode:`WITH_EXCEPT_START`. Then, :meth:`~object.__enter__` is called, and a finally block pointing to *delta* is pushed. Finally, the result of calling the ``__enter__()`` method is pushed onto the stack. The next opcode will either ignore it (:opcode:`POP_TOP`), or store it in (a) variable(s) (:opcode:`STORE_FAST`, :opcode:`STORE_NAME`, or :opcode:`UNPACK_SEQUENCE`).
pt_br: 此操作码会在 with 代码块开始之前执行多个操作。 首先，它从上下文管理器加载 :meth:`~object.__exit__` 并将其推入栈顶以供 :opcode:`WITH_EXCEPT_START` 后续使用。 然后，调用 :meth:`~object.__enter__`，并推入一个指向 *delta* 的 finally 代码块。 最后，将调用 ``__enter__()`` 方法的结果推入栈顶。 下一个操作码将忽略它 (:opcode:`POP_TOP`)，或将其存储在一个或多个变量 (:opcode:`STORE_FAST`, :opcode:`STORE_NAME` 或 :opcode:`UNPACK_SEQUENCE`) 中。

source: All of the following opcodes use their arguments.
pt_br: 以下所有操作码均使用其参数。

source: Implements ``name = TOS``. *namei* is the index of *name* in the attribute :attr:`co_names` of the code object. The compiler tries to use :opcode:`STORE_FAST` or :opcode:`STORE_GLOBAL` if possible.
pt_br: Реалізує ``name = TOS``. *namei* — це індекс *name* в атрибуті :attr:`co_names` об’єкта коду. Компілятор намагається використовувати :opcode:`STORE_FAST` або :opcode:`STORE_GLOBAL`, якщо це можливо.

source: Implements ``del name``, where *namei* is the index into :attr:`co_names` attribute of the code object.
pt_br: Реалізує ``del name``, де *namei* є індексом атрибута :attr:`co_names` об’єкта коду.

source: Unpacks TOS into *count* individual values, which are put onto the stack right-to-left.
pt_br: Розпаковує TOS у *count* окремі значення, які поміщаються в стек справа наліво.

source: Implements assignment with a starred target: Unpacks an iterable in TOS into individual values, where the total number of values can be smaller than the number of items in the iterable: one of the new values will be a list of all leftover items.
pt_br: Реалізує призначення з позначеною зірочкою метою: розпаковує ітерацію в TOS на окремі значення, де загальна кількість значень може бути меншою за кількість елементів у ітерації: одне з нових значень буде списком усіх залишкових елементів.

source: The low byte of *counts* is the number of values before the list value, the high byte of *counts* the number of values after it. The resulting values are put onto the stack right-to-left.
pt_br: Молодший байт *counts* — це кількість значень перед значенням списку, старший байт *counts* — кількість значень після нього. Отримані значення поміщаються в стек справа наліво.

source: Implements ``TOS.name = TOS1``, where *namei* is the index of name in :attr:`co_names`.
pt_br: Реалізує ``TOS.name = TOS1``, де *namei* є індексом імені в :attr:`co_names`.

source: Implements ``del TOS.name``, using *namei* as index into :attr:`co_names`.
pt_br: Реалізує ``del TOS.name``, використовуючи *namei* як індекс у :attr:`co_names`.

source: Works as :opcode:`STORE_NAME`, but stores the name as a global.
pt_br: Funciona como o :opcode:`STORE_NAME`, mas o nome é armazenado com um nome global.

source: Works as :opcode:`DELETE_NAME`, but deletes a global name.
pt_br: Funciona como o :opcode:`DELETE_NAME`, mas deleta um nome global.

source: Pushes ``co_consts[consti]`` onto the stack.
pt_br: Põe ``co_consts[consti]`` no topo da pilha.

source: Pushes the value associated with ``co_names[namei]`` onto the stack.
pt_br: Поміщає значення, пов’язане з ``co_names[namei]``, у стек.

source: Creates a tuple consuming *count* items from the stack, and pushes the resulting tuple onto the stack.
pt_br: Створює кортеж, який споживає *кількість* елементів зі стеку, і поміщає отриманий кортеж у стек.

source: Works as :opcode:`BUILD_TUPLE`, but creates a list.
pt_br: Працює як :opcode:`BUILD_TUPLE`, але створює список.

source: Works as :opcode:`BUILD_TUPLE`, but creates a set.
pt_br: Працює як :opcode:`BUILD_TUPLE`, але створює набір.

source: Pushes a new dictionary object onto the stack. Pops ``2 * count`` items so that the dictionary holds *count* entries: ``{..., TOS3: TOS2, TOS1: TOS}``.
pt_br: Поміщає новий об’єкт словника в стек. Показує ``2 * count`` елементи, щоб словник містив *count* записи: ``{..., TOS3: TOS2, TOS1: TOS}``.

source: The dictionary is created from stack items instead of creating an empty dictionary pre-sized to hold *count* items.
pt_br: Словник створюється з елементів стека замість створення порожнього словника попереднього розміру для *кількості* елементів.

source: The version of :opcode:`BUILD_MAP` specialized for constant keys. Pops the top element on the stack which contains a tuple of keys, then starting from ``TOS1``, pops *count* values to form values in the built dictionary.
pt_br: Версія :opcode:`BUILD_MAP` спеціалізована на постійних ключах. Висуває верхній елемент у стеку, який містить кортеж ключів, потім, починаючи з ``TOS1``, витягує значення *count* для формування значень у створеному словнику.

source: Concatenates *count* strings from the stack and pushes the resulting string onto the stack.
pt_br: З’єднує *count* рядки зі стеку та надихає отриманий рядок у стек.

source: Pops a list from the stack and pushes a tuple containing the same values.
pt_br: Витягує список зі стеку та надсилає кортеж, що містить однакові значення.

source: Calls ``list.extend(TOS1[-i], TOS)``. Used to build lists.
pt_br: Викликає ``list.extend(TOS1[-i], TOS)``. Використовується для створення списків.

source: Calls ``set.update(TOS1[-i], TOS)``. Used to build sets.
pt_br: Викликає ``set.update(TOS1[-i], TOS)``. Використовується для складання наборів.

source: Calls ``dict.update(TOS1[-i], TOS)``. Used to build dicts.
pt_br: Викликає ``dict.update(TOS1[-i], TOS)``. Використовується для побудови dicts.

source: Like :opcode:`DICT_UPDATE` but raises an exception for duplicate keys.
pt_br: Подібно до :opcode:`DICT_UPDATE`, але створює виняток для дублікатів ключів.

source: Replaces TOS with ``getattr(TOS, co_names[namei])``.
pt_br: Замінює TOS на ``getattr(TOS, co_names[namei])``.

source: Performs a Boolean operation. The operation name can be found in ``cmp_op[opname]``.
pt_br: Виконує логічні операції. Ім'я операції можна знайти в ``cmp_op[opname]``.

source: Performs ``is`` comparison, or ``is not`` if ``invert`` is 1.
pt_br: Виконує порівняння ``is`` або ``is not``, якщо ``invert`` дорівнює 1.

source: Performs ``in`` comparison, or ``not in`` if ``invert`` is 1.
pt_br: Виконує порівняння ``in`` або ``not in``, якщо ``invert`` дорівнює 1.

source: Imports the module ``co_names[namei]``. TOS and TOS1 are popped and provide the *fromlist* and *level* arguments of :func:`__import__`. The module object is pushed onto the stack. The current namespace is not affected: for a proper import statement, a subsequent :opcode:`STORE_FAST` instruction modifies the namespace.
pt_br: Імпортує модуль ``co_names[namei]``. TOS і TOS1 витягуються та надають аргументи *fromlist* і *level* :func:`__import__`. Об’єкт модуля поміщається в стек. Поточний простір імен не впливає: для правильного оператора імпорту наступна інструкція :opcode:`STORE_FAST` змінює простір імен.

source: Loads the attribute ``co_names[namei]`` from the module found in TOS. The resulting object is pushed onto the stack, to be subsequently stored by a :opcode:`STORE_FAST` instruction.
pt_br: Завантажує атрибут ``co_names[namei]`` з модуля, знайденого в TOS. Отриманий об’єкт поміщається в стек, щоб згодом зберігатися за допомогою інструкції :opcode:`STORE_FAST`.

source: Increments bytecode counter by *delta*.
pt_br: Збільшує лічильник байт-коду на *delta*.

source: If TOS is true, sets the bytecode counter to *target*. TOS is popped.
pt_br: TOS が真ならば、バイトコードカウンタを *target* に設定します。 TOS はポップされます。

source: If TOS is false, sets the bytecode counter to *target*. TOS is popped.
pt_br: TOS が偽ならば、バイトコードカウンタを *target* に設定します。 TOS はポップされます。

source: Tests whether the second value on the stack is an exception matching TOS, and jumps if it is not. Pops two values from the stack.
pt_br: 检测堆栈中的第二个值是否为匹配 TOS 的异常，如果不是则会跳转。 从堆栈中弹出两个值。

source: If TOS is true, sets the bytecode counter to *target* and leaves TOS on the stack. Otherwise (TOS is false), TOS is popped.
pt_br: TOS が真ならば、バイトコードカウンタを *target* に設定し、TOS は スタックに残されます。そうでない (TOS が偽) なら、TOS はポップされます。

source: If TOS is false, sets the bytecode counter to *target* and leaves TOS on the stack. Otherwise (TOS is true), TOS is popped.
pt_br: TOS が偽ならば、バイトコードカウンタを *target* に設定し、TOS は スタックに残されます。そうでない (TOS が真) なら、TOS はポップされます。

source: Set bytecode counter to *target*.
pt_br: バイトコードカウンタを *target* に設定します。

source: TOS is an :term:`iterator`. Call its :meth:`~iterator.__next__` method. If this yields a new value, push it on the stack (leaving the iterator below it). If the iterator indicates it is exhausted, TOS is popped, and the byte code counter is incremented by *delta*.
pt_br: TOS є :term:`iterator`. Викличте його метод :meth:`~iterator.__next__`. Якщо це дає нове значення, помістіть його в стек (залишаючи ітератор під ним). Якщо ітератор вказує, що його вичерпано, TOS виривається, а лічильник байт-коду збільшується на *delta*.

source: Loads the global named ``co_names[namei]`` onto the stack.
pt_br: ``co_names[namei]`` という名前のグローバルをスタック上にロードします。

source: Pushes a try block from a try-finally or try-except clause onto the block stack. *delta* points to the finally block or the first except block.
pt_br: 将一个来自 try-finally 或 try-except 子句的 try 代码块推入代码块栈顶。 相对 finally 代码块或第一个 except 代码块 *delta* 个点数。

source: Pushes a reference to the local ``co_varnames[var_num]`` onto the stack.
pt_br: Надсилає посилання на локальні ``co_var_names[var_num]`` у стек.

source: Stores TOS into the local ``co_varnames[var_num]``.
pt_br: Зберігає TOS у локальному ``co_varnames[var_num]``.

source: Deletes local ``co_varnames[var_num]``.
pt_br: Видаляє локальні ``co_var_names[var_num]``.

source: Pushes a reference to the cell contained in slot *i* of the cell and free variable storage. The name of the variable is ``co_cellvars[i]`` if *i* is less than the length of *co_cellvars*. Otherwise it is ``co_freevars[i - len(co_cellvars)]``.
pt_br: セルと自由変数の記憶領域のスロット *i* に含まれるセルへの参照をプッシュします。 *i* が *co_cellvars* の長さより小さければ、変数の名前は ``co_cellvars[i]`` です。 そうでなければ ``co_freevars[i - len(co_cellvars)]`` です。

source: Loads the cell contained in slot *i* of the cell and free variable storage. Pushes a reference to the object the cell contains on the stack.
pt_br: セルと自由変数の記憶領域のスロット *i* に含まれるセルをロードします。 セルが持つオブジェクトへの参照をスタックにプッシュします。

source: Much like :opcode:`LOAD_DEREF` but first checks the locals dictionary before consulting the cell. This is used for loading free variables in class bodies.
pt_br: Подібно до :opcode:`LOAD_DEREF`, але спочатку перевіряє локальний словник, перш ніж звертатися до клітинки. Це використовується для завантаження вільних змінних у тілах класів.

source: Stores TOS into the cell contained in slot *i* of the cell and free variable storage.
pt_br: セルと自由変数の記憶領域のスロット *i* に含まれるセルへTOSを保存します。

source: Empties the cell contained in slot *i* of the cell and free variable storage. Used by the :keyword:`del` statement.
pt_br: セルと自由変数の記憶領域のスロット *i* にあるセルを空にします。 :keyword:`del` 文で使われます。

source: Raises an exception using one of the 3 forms of the ``raise`` statement, depending on the value of *argc*:
pt_br: Створює виняток, використовуючи одну з 3 форм оператора ``raise``, залежно від значення *argc*:

source: 0: ``raise`` (re-raise previous exception)
pt_br: 0: ``raise`` (повторно підняти попередній виняток)

source: 1: ``raise TOS`` (raise exception instance or type at ``TOS``)
pt_br: 1: ``підняти TOS`` (підвищити екземпляр винятку або ввести в ``TOS``)

source: 2: ``raise TOS1 from TOS`` (raise exception instance or type at ``TOS1`` with ``__cause__`` set to ``TOS``)
pt_br: 2: ``підняти TOS1 з TOS`` (підняти екземпляр винятку або ввести в ``TOS1`` з ``__cause__``, встановленим на ``TOS``)

source: Calls a callable object with positional arguments. *argc* indicates the number of positional arguments. The top of the stack contains positional arguments, with the right-most argument on top. Below the arguments is a callable object to call. ``CALL_FUNCTION`` pops all arguments and the callable object off the stack, calls the callable object with those arguments, and pushes the return value returned by the callable object.
pt_br: 调用一个可调用对象并传入位置参数。 *argc* 指明位置参数的数量。 栈顶包含位置参数，其中最右边的参数在最顶端。 在参数之下是一个待调用的可调用对象。 ``CALL_FUNCTION`` 会从栈中弹出所有参数以及可调用对象，附带这些参数调用该可调用对象，并将可调用对象所返回的返回值推入栈顶。

source: This opcode is used only for calls with positional arguments.
pt_br: 此操作码仅用于附带位置参数的调用。

source: Calls a callable object with positional (if any) and keyword arguments. *argc* indicates the total number of positional and keyword arguments. The top element on the stack contains a tuple with the names of the keyword arguments, which must be strings. Below that are the values for the keyword arguments, in the order corresponding to the tuple. Below that are positional arguments, with the right-most parameter on top. Below the arguments is a callable object to call. ``CALL_FUNCTION_KW`` pops all arguments and the callable object off the stack, calls the callable object with those arguments, and pushes the return value returned by the callable object.
pt_br: 调用一个可调用对象并传入位置参数（如果有的话）和关键字参数。 *argc* 指明位置参数和关键字参数的总数量。 栈顶元素包含一个关键字参数名称的元组，名称必须为字符串。 在元组之下是与元组顺序相对应的关键字参数值。 在它之下则是位置参数，其中最右边的参数在最顶端。 在参数之下是要调用的可调用对象。 ``CALL_FUNCTION_KW`` 会从栈中弹出所有参数及可调用对象，附带这些参数调用该可调用对象，并将可调用对象所返回的返回值推入栈顶。

source: Keyword arguments are packed in a tuple instead of a dictionary, *argc* indicates the total number of arguments.
pt_br: 关键字参数会被打包为一个元组而非字典，*argc* 指明参数的总数量。

source: Calls a callable object with variable set of positional and keyword arguments. If the lowest bit of *flags* is set, the top of the stack contains a mapping object containing additional keyword arguments. Before the callable is called, the mapping object and iterable object are each "unpacked" and their contents passed in as keyword and positional arguments respectively. ``CALL_FUNCTION_EX`` pops all arguments and the callable object off the stack, calls the callable object with those arguments, and pushes the return value returned by the callable object.
pt_br: Викликає викликаний об’єкт зі змінним набором позиційних і ключових аргументів. Якщо встановлено найнижчий біт *flags*, верхня частина стека містить об’єкт відображення, що містить додаткові аргументи ключового слова. Перед викликом викликаного об’єкта відображення та ітерованого об’єкта кожен "розпаковується", а їхній вміст передається як ключове слово та позиційний аргумент відповідно. ``CALL_FUNCTION_EX`` видаляє зі стеку всі аргументи та об’єкт, який викликається, викликає об’єкт, який викликається, з цими аргументами та надсилає значення, яке повертає об’єкт, який викликається.

source: Loads a method named ``co_names[namei]`` from the TOS object. TOS is popped. This bytecode distinguishes two cases: if TOS has a method with the correct name, the bytecode pushes the unbound method and TOS. TOS will be used as the first argument (``self``) by :opcode:`CALL_METHOD` when calling the unbound method. Otherwise, ``NULL`` and the object return by the attribute lookup are pushed.
pt_br: 从 TOS 对象加载一个名为 ``co_names[namei]`` 的方法。 TOS 将被弹出。 此字节码可区分两种情况：如果 TOS 有一个名称正确的方法，字节码会将未绑定方法和 TOS 推入栈顶。 TOS 将在调用未绑定方法时被用作 :opcode:`CALL_METHOD` 的第一个参数 (``self``)。 否则会将 ``NULL`` 和属性查找所返回的对象推入栈顶。

source: Calls a method. *argc* is the number of positional arguments. Keyword arguments are not supported. This opcode is designed to be used with :opcode:`LOAD_METHOD`. Positional arguments are on top of the stack. Below them, the two items described in :opcode:`LOAD_METHOD` are on the stack (either ``self`` and an unbound method object or ``NULL`` and an arbitrary callable). All of them are popped and the return value is pushed.
pt_br: 调用一个方法。 *argc* 是位置参数的数量。 关键字参数不受支持。 此操作码被设计用于配合 :opcode:`LOAD_METHOD` 使用。 位置参数放在栈顶。 在它们之下放在栈中的是由 :opcode:`LOAD_METHOD` 所描述的两个条目（或者是 ``self`` 和一个未绑定方法对象，或者是 ``NULL`` 和一个任意可调用对象）。 它们会被全部弹出并将返回值推入栈顶。

source: Pushes a new function object on the stack. From bottom to top, the consumed stack must consist of values if the argument carries a specified flag value
pt_br: Поміщає новий функціональний об’єкт у стек. Знизу вгору споживаний стек повинен складатися зі значень, якщо аргумент містить вказане значення прапора

source: ``0x01`` a tuple of default values for positional-only and positional-or-keyword parameters in positional order
pt_br: ``0x01`` кортеж значень за замовчуванням для позиційних параметрів і параметрів позиційного або ключового слова в позиційному порядку

source: ``0x02`` a dictionary of keyword-only parameters' default values
pt_br: ``0x02`` словник значень за замовчуванням параметрів лише ключових слів

source: ``0x08`` a tuple containing cells for free variables, making a closure
pt_br: ``0x08`` кортеж, що містить комірки для вільних змінних, створюючи закриття

source: the code associated with the function (at TOS1)
pt_br: код, пов’язаний із функцією (в TOS1)

source: the :term:`qualified name` of the function (at TOS)
pt_br: :term:`qualified name` функції (у TOS)

source: Pushes a slice object on the stack. *argc* must be 2 or 3. If it is 2, ``slice(TOS1, TOS)`` is pushed; if it is 3, ``slice(TOS2, TOS1, TOS)`` is pushed. See the :func:`slice` built-in function for more information.
pt_br: Штовхає об’єкт-скибочку на стек. *argc* має бути 2 або 3. Якщо воно дорівнює 2, надсилається ``slice(TOS1, TOS)``; якщо він дорівнює 3, надсилається ``slice(TOS2, TOS1, TOS)``. Дивіться вбудовану функцію :func:`slice` для отримання додаткової інформації.

source: Prefixes any opcode which has an argument too big to fit into the default one byte. *ext* holds an additional byte which act as higher bits in the argument. For each opcode, at most three prefixal ``EXTENDED_ARG`` are allowed, forming an argument from two-byte to four-byte.
pt_br: Додає префікс до будь-якого коду операції, який має занадто великий аргумент, щоб поміститися в стандартний один байт. *ext* містить додатковий байт, який діє як старші біти в аргументі. Для кожного коду операції дозволено не більше трьох префіксів ``EXTENDED_ARG``, які утворюють аргумент розміром від двох до чотирьох байтів.

source: Used for implementing formatted literal strings (f-strings). Pops an optional *fmt_spec* from the stack, then a required *value*. *flags* is interpreted as follows:
pt_br: Використовується для реалізації форматованих літеральних рядків (f-рядків). Витягує необов’язковий *fmt_spec* зі стеку, а потім обов’язкове *значення*. *flags* інтерпретується таким чином:

source: ``(flags & 0x03) == 0x00``: *value* is formatted as-is.
pt_br: ``(flags & 0x03) == 0x00``: *значення* відформатовано як є.

source: ``(flags & 0x03) == 0x01``: call :func:`str` on *value* before formatting it.
pt_br: ``(flags & 0x03) == 0x01``: виклик :func:`str` для *значення* перед його форматуванням.

source: ``(flags & 0x03) == 0x02``: call :func:`repr` on *value* before formatting it.
pt_br: ``(flags & 0x03) == 0x02``: виклик :func:`repr` для *значення* перед його форматуванням.

source: ``(flags & 0x03) == 0x03``: call :func:`ascii` on *value* before formatting it.
pt_br: ``(flags & 0x03) == 0x03``: виклик :func:`ascii` для *значення* перед його форматуванням.

source: ``(flags & 0x04) == 0x04``: pop *fmt_spec* from the stack and use it, else use an empty *fmt_spec*.
pt_br: ``(flags & 0x04) == 0x04``: витягніть *fmt_spec* зі стеку та використовуйте його, інакше використовуйте порожній *fmt_spec*.

source: Formatting is performed using :c:func:`PyObject_Format`. The result is pushed on the stack.
pt_br: Форматування виконується за допомогою :c:func:`PyObject_Format`. Результат поміщається в стек.

source: This is not really an opcode. It identifies the dividing line between opcodes which don't use their argument and those that do (``< HAVE_ARGUMENT`` and ``>= HAVE_ARGUMENT``, respectively).
pt_br: 这不是一个真正的操作码。 它标明了不使用参数和使用参数的操作码 (分别是 ``< HAVE_ARGUMENT`` 和 ``>= HAVE_ARGUMENT``) 之间的分隔线。

source: Now every instruction has an argument, but opcodes ``< HAVE_ARGUMENT`` ignore it. Before, only opcodes ``>= HAVE_ARGUMENT`` had an argument.
pt_br: Тепер кожна інструкція має аргумент, але коди операцій ``< HAVE_ARGUMENT`` ignore it. Before, only opcodes ``> = HAVE_ARGUMENT`` мали аргумент.

source: Opcode collections
pt_br: Колекції кодів операцій

source: These collections are provided for automatic introspection of bytecode instructions:
pt_br: Ці колекції надаються для автоматичного аналізу інструкцій байт-коду:

source: Sequence of operation names, indexable using the bytecode.
pt_br: Послідовність імен операцій, індексованих за допомогою байт-коду.

source: Dictionary mapping operation names to bytecodes.
pt_br: Словник зіставляє назви операцій із байт-кодами.

source: Sequence of all compare operation names.
pt_br: Послідовність імен усіх операцій порівняння.

source: Sequence of bytecodes that access a constant.
pt_br: Послідовність байт-кодів, які звертаються до константи.
