Repository: python/python-docs-pt-br
Catalog: library/email.message.po
Languages: pt_br

source: :mod:`email.message`: Representing an email message
pt_br: :mod:`email.message`: представляє повідомлення електронної пошти

source: **Source code:** :source:`Lib/email/message.py`
pt_br: **Código-fonte:** :source:`Lib/email/message.py`

source: The central class in the :mod:`email` package is the :class:`EmailMessage` class, imported from the :mod:`email.message` module. It is the base class for the :mod:`email` object model. :class:`EmailMessage` provides the core functionality for setting and querying header fields, for accessing message bodies, and for creating or modifying structured messages.
pt_br: Центральним класом у пакеті :mod:`email` є клас :class:`EmailMessage`, імпортований із модуля :mod:`email.message`. Це базовий клас для об’єктної моделі :mod:`email`. :class:`EmailMessage` забезпечує основну функціональність для налаштування та запиту полів заголовків, для доступу до тіла повідомлень, а також для створення або зміни структурованих повідомлень.

source: An email message consists of *headers* and a *payload* (which is also referred to as the *content*). Headers are :rfc:`5322` or :rfc:`6532` style field names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
pt_br: Повідомлення електронної пошти складається з *заголовків* і *корисного навантаження* (яке також називають *контентом*). Заголовки — це імена та значення полів у стилі :rfc:`5322` або :rfc:`6532`, де назва поля та значення розділені двокрапкою. Двокрапка не є частиною ані імені поля, ані значення поля. Корисне навантаження може бути простим текстовим повідомленням, або двійковим об’єктом, або структурованою послідовністю підповідомлень, кожне з яких має власний набір заголовків і власне корисне навантаження. Останній тип корисного навантаження вказується повідомленням, що має тип MIME, наприклад :mimetype:`multipart/\*` або :mimetype:`message/rfc822`.

source: The conceptual model provided by an :class:`EmailMessage` object is that of an ordered dictionary of headers coupled with a *payload* that represents the :rfc:`5322` body of the message, which might be a list of sub-``EmailMessage`` objects. In addition to the normal dictionary methods for accessing the header names and values, there are methods for accessing specialized information from the headers (for example the MIME content type), for operating on the payload, for generating a serialized version of the message, and for recursively walking over the object tree.
pt_br: Концептуальна модель, надана об’єктом :class:`EmailMessage`, — це впорядкований словник заголовків у поєднанні з *корисним навантаженням*, який представляє тіло :rfc:`5322` повідомлення, яке може бути списком під-` Об’єкти ``EmailMessage``. На додаток до звичайних методів словника для доступу до імен і значень заголовків, існують методи для доступу до спеціальної інформації із заголовків (наприклад, типу вмісту MIME), для роботи з корисним навантаженням, для генерації серіалізованої версії повідомлення та для рекурсивного переходу по дереву об'єктів.

source: The :class:`EmailMessage` dictionary-like interface is indexed by the header names, which must be ASCII values. The values of the dictionary are strings with some extra methods. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. Unlike a real dict, there is an ordering to the keys, and there can be duplicate keys. Additional methods are provided for working with headers that have duplicate keys.
pt_br: Інтерфейс :class:`EmailMessage`, схожий на словник, індексується іменами заголовків, які мають бути значеннями ASCII. Значення словника є рядками з деякими додатковими методами. Заголовки зберігаються та повертаються у формі зі збереженням регістру, але імена полів зіставляються без урахування регістру. На відміну від справжнього dict, ключі впорядковані, і ключі можуть дублюватися. Для роботи із заголовками, які мають повторювані ключі, надаються додаткові методи.

source: The *payload* is either a string or bytes object, in the case of simple message objects, or a list of :class:`EmailMessage` objects, for MIME container documents such as :mimetype:`multipart/\*` and :mimetype:`message/rfc822` message objects.
pt_br: *Корисне навантаження* — це об’єкт рядка чи байтів у випадку простих об’єктів повідомлення, або список об’єктів :class:`EmailMessage` для документів-контейнерів MIME, таких як :mimetype:`multipart/\*` і :mimetype:`message/rfc822` об’єкти повідомлення.

source: If *policy* is specified use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`~email.policy.default` policy, which follows the rules of the email RFCs except for line endings (instead of the RFC mandated ``\r\n``, it uses the Python standard ``\n`` line endings). For more information see the :mod:`~email.policy` documentation.
pt_br: Якщо вказано *політику*, використовуйте правила, які вона визначає, щоб оновити та серіалізувати представлення повідомлення. Якщо *policy* не встановлено, використовуйте політику :class:`~email.policy.default`, яка відповідає правилам RFC електронної пошти, за винятком закінчення рядків (замість RFC, передбаченого ``\r\n``, він використовує стандартні закінчення рядків Python ``\n``). Для отримання додаткової інформації дивіться документацію :mod:`~email.policy`.

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility with the base :class:`~email.message.Message` class *maxheaderlen* is accepted, but defaults to ``None``, which means that by default the line length is controlled by the :attr:`~email.policy.EmailPolicy.max_line_length` of the policy. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.Generator`.
pt_br: Повернути все повідомлення зведеним у вигляді рядка. Якщо необов’язковий параметр *unixfrom* має значення true, заголовок конверта включається до поверненого рядка. *unixfrom* за умовчанням має значення ``False``. Для зворотної сумісності з базовим :class:`~email.message.Message` класом *maxheaderlen* прийнято, але за умовчанням встановлено ``None``, що означає, що за замовчуванням довжина рядка контролюється :attr:`~email.policy.EmailPolicy.max_line_length` політики. Аргумент *policy* можна використовувати для заміни політики за замовчуванням, отриманої з екземпляра повідомлення. Це можна використовувати для керування частиною форматування, створеного методом, оскільки вказану *політику* буде передано до :class:`~email.generator.Generator`.

source: Flattening the message may trigger changes to the :class:`EmailMessage` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
pt_br: Зведення повідомлення може викликати зміни в :class:`EmailMessage`, якщо для завершення перетворення в рядок необхідно вказати значення за умовчанням (наприклад, можуть бути згенеровані або змінені межі MIME).

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.Generator` for a more flexible API for serializing messages. Note also that this method is restricted to producing messages serialized as "7 bit clean" when :attr:`~email.policy.EmailPolicy.utf8` is ``False``, which is the default.
pt_br: Зауважте, що цей метод надається для зручності та може бути не найкориснішим способом серіалізації повідомлень у вашій програмі, особливо якщо ви маєте справу з кількома повідомленнями. Перегляньте :class:`email.generator.Generator` для більш гнучкого API для серіалізації повідомлень. Зауважте також, що цей метод обмежений створенням повідомлень, серіалізованих як "7 bit clean", якщо :attr:`~email.policy.EmailPolicy.utf8` має значення ``False``, що є типовим.

source: the default behavior when *maxheaderlen* is not specified was changed from defaulting to 0 to defaulting to the value of *max_line_length* from the policy.
pt_br: поведінку за замовчуванням, коли *maxheaderlen* не вказано, було змінено з 0 на значення *max_line_length* із політики.

source: Equivalent to ``as_string(policy=self.policy.clone(utf8=True))``. Allows ``str(msg)`` to produce a string containing the serialized message in a readable format.
pt_br: Еквівалент ``as_string(policy=self.policy.clone(utf8=True))``. Дозволяє ``str(msg)`` створювати рядок, що містить серіалізоване повідомлення в читабельному форматі.

source: the method was changed to use ``utf8=True``, thus producing an :rfc:`6531`-like message representation, instead of being a direct alias for :meth:`as_string`.
pt_br: метод було змінено на використання ``utf8=True``, таким чином створюючи представлення повідомлення, схоже на :rfc:`6531`, замість прямого псевдоніма для :meth:`as_string`.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.BytesGenerator`.
pt_br: Повертає все повідомлення зведене як об’єкт bytes. Якщо необов’язковий параметр *unixfrom* має значення true, заголовок конверта включається до поверненого рядка. *unixfrom* за умовчанням має значення ``False``. Аргумент *policy* можна використовувати для заміни політики за замовчуванням, отриманої з екземпляра повідомлення. Це можна використовувати для керування частиною форматування, створеного методом, оскільки вказану *політику* буде передано до :class:`~email.generator.BytesGenerator`.

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.BytesGenerator` for a more flexible API for serializing messages.
pt_br: Зауважте, що цей метод надається для зручності та може бути не найкориснішим способом серіалізації повідомлень у вашій програмі, особливо якщо ви маєте справу з кількома повідомленнями. Перегляньте :class:`email.generator.BytesGenerator` для більш гнучкого API для серіалізації повідомлень.

source: Equivalent to :meth:`.as_bytes()`. Allows ``bytes(msg)`` to produce a bytes object containing the serialized message.
pt_br: Еквівалент :meth:`.as_bytes()`. Дозволяє ``bytes(msg)`` створити об'єкт bytes, що містить серіалізоване повідомлення.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`EmailMessage` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`EmailMessage` is of type ``message/rfc822``.
pt_br: Повертає ``True``, якщо корисним навантаженням повідомлення є список sub-\ :class:`EmailMessage` об’єктів, інакше повертає ``False``. Коли :meth:`is_multipart` повертає ``False``, корисним навантаженням має бути рядковий об’єкт (який може бути двійковим навантаженням у кодуванні CTE). Зауважте, що :meth:`is_multipart`, що повертає ``True``, не обов’язково означає, що "msg.get_content_maintype() == 'multipart'" поверне ``True``. Наприклад, ``is_multipart`` поверне ``True``, якщо :class:`EmailMessage` має тип ``message/rfc822``.

source: Set the message's envelope header to *unixfrom*, which should be a string. (See :class:`~mailbox.mboxMessage` for a brief description of this header.)
pt_br: Встановіть заголовок конверта повідомлення на *unixfrom*, який має бути рядком. (Див. :class:`~mailbox.mboxMessage` для короткого опису цього заголовка.)

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
pt_br: Повернути заголовок конверта повідомлення. За замовчуванням ``None``, якщо заголовок конверта ніколи не встановлювався.

source: The following methods implement the mapping-like interface for accessing the message's headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in an :class:`EmailMessage` object, headers are always returned in the order they appeared in the original message, or in which they were added to the message later. Any header deleted and then re-added is always appended to the end of the header list.
pt_br: Наступні методи реалізують схожий на відображення інтерфейс для доступу до заголовків повідомлення. Зверніть увагу, що існують деякі семантичні відмінності між цими методами та інтерфейсом звичайного відображення (тобто словника). Наприклад, у словнику немає дублікатів ключів, але тут можуть бути дублікати заголовків повідомлень. Крім того, у словниках немає гарантованого порядку ключів, які повертає :meth:`keys`, але в об’єкті :class:`EmailMessage` заголовки завжди повертаються в тому порядку, в якому вони з’явилися в оригінальному повідомленні або в якому вони були додані до повідомлення пізніше. Будь-який заголовок, видалений і потім знову доданий, завжди додається в кінець списку заголовків.

source: These semantic differences are intentional and are biased toward convenience in the most common use cases.
pt_br: Ці семантичні відмінності є навмисними та спрямовані на зручність у найпоширеніших випадках використання.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
pt_br: Зауважте, що в усіх випадках будь-який заголовок конверта, присутній у повідомленні, не включається в інтерфейс зіставлення.

source: Return the total number of headers, including duplicates.
pt_br: Повертає загальну кількість заголовків, включаючи дублікати.

source: Return ``True`` if the message object has a field named *name*. Matching is done without regard to case and *name* does not include the trailing colon. Used for the ``in`` operator. For example::
pt_br: Повертає ``True``, якщо об’єкт повідомлення має поле з назвою *name*. Зіставлення виконується без урахування регістру, а *ім’я* не містить двокрапки в кінці. Використовується для оператора ``in``. Наприклад::

source: Return the value of the named header field. *name* does not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
pt_br: Повертає значення названого поля заголовка. *ім’я* не містить двокрапку-роздільник полів. Якщо заголовок відсутній, повертається ``None``; a :exc:`KeyError` ніколи не виникає.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant headers named *name*.
pt_br: Зауважте, що якщо назване поле з’являється більше одного разу в заголовках повідомлення, яке саме значення полів буде повернуто, не визначено. Використовуйте метод :meth:`get_all`, щоб отримати значення всіх існуючих заголовків з назвою *name*.

source: Using the standard (non-``compat32``) policies, the returned value is an instance of a subclass of :class:`email.headerregistry.BaseHeader`.
pt_br: Використовуючи стандартні політики (не ``compat32``), повернуте значення є екземпляром підкласу :class:`email.headerregistry.BaseHeader`.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing headers.
pt_br: Додайте до повідомлення заголовок із назвою поля *name* і значенням *val*. Поле додається в кінці існуючих заголовків повідомлення.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
pt_br: Зауважте, що це *не* перезаписує та не видаляє будь-який існуючий заголовок із такою ж назвою. Якщо ви хочете переконатися, що новий заголовок є єдиним у повідомленні з назвою поля *name*, спочатку видаліть це поле, наприклад::

source: If the :mod:`policy` defines certain headers to be unique (as the standard policies do), this method may raise a :exc:`ValueError` when an attempt is made to assign a value to such a header when one already exists. This behavior is intentional for consistency's sake, but do not depend on it as we may choose to make such assignments do an automatic deletion of the existing header in the future.
pt_br: Якщо :mod:`policy` визначає певні заголовки як унікальні (як стандартні політики), цей метод може викликати :exc:`ValueError`, коли робиться спроба призначити значення такому заголовку, коли він уже існує . Така поведінка є навмисною для забезпечення узгодженості, але не залежить від неї, оскільки ми можемо зробити такі призначення автоматичним видаленням існуючого заголовка в майбутньому.

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
pt_br: Видалити всі входження поля з назвою *ім’я* із заголовків повідомлення. Жодного винятку не створюється, якщо назване поле відсутнє в заголовках.

source: Return a list of all the message's header field names.
pt_br: Повертає список імен усіх полів заголовка повідомлення.

source: Return a list of all the message's field values.
pt_br: Повертає список усіх значень полів повідомлення.

source: Return a list of 2-tuples containing all the message's field headers and values.
pt_br: Повертає список із двох кортежів, що містить усі заголовки та значення полів повідомлення.

source: Return the value of the named header field. This is identical to :meth:`__getitem__` except that optional *failobj* is returned if the named header is missing (*failobj* defaults to ``None``).
pt_br: Повертає значення названого поля заголовка. Це ідентично :meth:`__getitem__`, за винятком того, що необов’язковий *failobj* повертається, якщо іменований заголовок відсутній (*failobj* за замовчуванням має значення ``None``).

source: Here are some additional useful header related methods:
pt_br: Ось кілька додаткових корисних методів, пов’язаних із заголовками:

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
pt_br: Повертає список усіх значень для поля з назвою *name*. Якщо в повідомленні немає таких іменованих заголовків, повертається *failobj* (за замовчуванням ``None``).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
pt_br: Розширене налаштування заголовка. Цей метод подібний до :meth:`__setitem__` за винятком того, що додаткові параметри заголовка можуть бути надані як аргументи ключового слова. *_name* — це поле заголовка, яке потрібно додати, а *_value* — це *основне* значення для заголовка.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added.
pt_br: Для кожного елемента в словнику аргументів ключових слів *_params* ключ береться як ім’я параметра, а символи підкреслення перетворюються на тире (оскільки тире заборонені в ідентифікаторах Python). Зазвичай параметр буде додано як ``key="value"``, якщо значення не буде ``None``, у цьому випадку буде додано лише ключ.

source: If the value contains non-ASCII characters, the charset and language may be explicitly controlled by specifying the value as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
pt_br: Якщо значення містить символи, відмінні від ASCII, кодуванням і мовою можна явно керувати, вказавши значення у вигляді трьох кортежів у форматі ``(НАБОР СИГНАЛІВ, МОВА, ЗНАЧЕННЯ)``, де ``НАБІР СИГНАЛІВ`` — це назва рядка набір символів, який буде використано для кодування значення, ``LANGUAGE`` зазвичай може бути встановлено на ``None`` або порожній рядок (перегляньте :rfc:`2231` для інших можливостей), а ``VALUE`` є значення рядка, що містить кодові точки, відмінні від ASCII. Якщо три кортежу не передано і значення містить символи, відмінні від ASCII, воно автоматично кодується у форматі :rfc:`2231` з використанням ``CHARSET`` ``utf-8`` і ``LANGUAGE`` з ``Жодного``.

source: Here is an example::
pt_br: Aqui está um exemplo::

source: This will add a header that looks like ::
pt_br: Це додасть заголовок, який виглядає так::

source: An example of the extended interface with non-ASCII characters::
pt_br: Приклад розширеного інтерфейсу з не-ASCII символами::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case of the original header. If no matching header is found, raise a :exc:`KeyError`.
pt_br: Замінити заголовок. Замініть перший знайдений у повідомленні заголовок, який відповідає *_name*, зберігаючи порядок заголовків і регістр імені поля вихідного заголовка. Якщо відповідного заголовка не знайдено, викликайте :exc:`KeyError`.

source: Return the message's content type, coerced to lower case of the form :mimetype:`maintype/subtype`. If there is no :mailheader:`Content-Type` header in the message return the value returned by :meth:`get_default_type`. If the :mailheader:`Content-Type` header is invalid, return ``text/plain``.
pt_br: Повертає тип вмісту повідомлення, переведений у нижній регістр у формі :mimetype:`maintype/subtype`. Якщо в повідомленні немає заголовка :mailheader:`Content-Type`, повертається значення, яке повертає :meth:`get_default_type`. Якщо заголовок :mailheader:`Content-Type` недійсний, поверніть ``text/plain``.
