Repository: python/python-docs-pt-br
Catalog: library/email.charset.po
Languages: pt_br

source: :mod:`!email.charset`: Representing character sets
pt_br: :mod:`!email.charset`: Representando conjuntos de caracteres

source: **Source code:** :source:`Lib/email/charset.py`
pt_br: **Código-fonte:** :source:`Lib/email/charset.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API only the aliases table is used.
pt_br: Este módulo faz parte da API de e-mail legada (``Compat32``). Na nova API, apenas a tabela de apelidos é usada.

source: The remaining text in this section is the original documentation of the module.
pt_br: O texto restante nesta seção é a documentação original do módulo.

source: This module provides a class :class:`Charset` for representing character sets and character set conversions in email messages, as well as a character set registry and several convenience methods for manipulating this registry. Instances of :class:`Charset` are used in several other modules within the :mod:`email` package.
pt_br: Este módulo fornece uma classe :class:`Charset` para representar conjuntos de caracteres e conversões de conjuntos de caracteres em mensagens de e-mail, bem como um registro de conjuntos de caracteres e vários métodos práticos para manipular esse registro. Instâncias de :class:`Charset` são usadas em vários outros módulos do pacote :mod:`email`.

source: Import this class from the :mod:`email.charset` module.
pt_br: Importa esta classe do módulo :mod:`email.charset`.

source: Map character sets to their email properties.
pt_br: Mapeia conjuntos de caracteres para suas propriedades de e-mail.

source: This class provides information about the requirements imposed on email for a specific character set. It also provides convenience routines for converting between character sets, given the availability of the applicable codecs. Given a character set, it will do its best to provide information on how to use that character set in an email message in an RFC-compliant way.
pt_br: Esta classe fornece informações sobre os requisitos impostos ao e-mail para um conjunto de caracteres específico. Também fornece rotinas práticas para conversão entre conjuntos de caracteres, considerando a disponibilidade dos codecs aplicáveis. Dado um conjunto de caracteres, ela fará o possível para fornecer informações sobre como usá-lo em uma mensagem de e-mail de forma compatível com RFC.

source: Certain character sets must be encoded with quoted-printable or base64 when used in email headers or bodies. Certain character sets must be converted outright, and are not allowed in email.
pt_br: Certos conjuntos de caracteres devem ser codificados com quoted-printable ou base64 quando usados em cabeçalhos ou corpos de e-mail. Certos conjuntos de caracteres devem ser convertidos diretamente e não são permitidos em e-mails.

source: Optional *input_charset* is as described below; it is always coerced to lower case. After being alias normalized it is also used as a lookup into the registry of character sets to find out the header encoding, body encoding, and output conversion codec to be used for the character set. For example, if *input_charset* is ``iso-8859-1``, then headers and bodies will be encoded using quoted-printable and no output conversion codec is necessary. If *input_charset* is ``euc-jp``, then headers will be encoded with base64, bodies will not be encoded, but output text will be converted from the ``euc-jp`` character set to the ``iso-2022-jp`` character set.
pt_br: O *input_charset* opcional é descrito abaixo; ele é sempre convertido para letras minúsculas. Após ser normalizado por apelido, ele também é usado como uma consulta no registro de conjuntos de caracteres para descobrir a codificação do cabeçalho, a codificação do corpo e o codec de conversão de saída a serem usados para o conjunto de caracteres. Por exemplo, se *input_charset* for ``iso-8859-1``, os cabeçalhos e corpos serão codificados usando quoted-printable e nenhum codec de conversão de saída será necessário. Se *input_charset* for ``euc-jp``, os cabeçalhos serão codificados em base64, os corpos não serão codificados, mas o texto de saída será convertido do conjunto de caracteres ``euc-jp`` para o conjunto de caracteres ``iso-2022-jp``.

source: :class:`Charset` instances have the following data attributes:
pt_br: Instâncias :class:`Charset` têm os seguintes atributos de dados:

source: The initial character set specified. Common aliases are converted to their *official* email names (e.g. ``latin_1`` is converted to ``iso-8859-1``). Defaults to 7-bit ``us-ascii``.
pt_br: O conjunto de caracteres inicial especificado. Apelidos comuns são convertidos em seus nomes de e-mail *oficiais* (por exemplo, ``latin_1`` é convertido para ``iso-8859-1``). O padrão é ``us-ascii`` de 7 bits.

source: If the character set must be encoded before it can be used in an email header, this attribute will be set to ``charset.QP`` (for quoted-printable), ``charset.BASE64`` (for base64 encoding), or ``charset.SHORTEST`` for the shortest of QP or BASE64 encoding. Otherwise, it will be ``None``.
pt_br: Se o conjunto de caracteres precisar ser codificado antes de ser usado em um cabeçalho de e-mail, este atributo será definido como ``charset.QP`` (para quoted-printable), ``charset.BASE64`` (para codificação base64) ou ``charset.SHORTEST`` para a codificação mais curta entre QP ou BASE64. Caso contrário, será ``None``.

source: Same as *header_encoding*, but describes the encoding for the mail message's body, which indeed may be different than the header encoding. ``charset.SHORTEST`` is not allowed for *body_encoding*.
pt_br: O mesmo que *header_encoding*, mas descreve a codificação do corpo da mensagem de e-mail, que pode ser diferente da codificação do cabeçalho. ``charset.SHORTEST`` não é permitido para *body_encoding*.

source: Some character sets must be converted before they can be used in email headers or bodies. If the *input_charset* is one of them, this attribute will contain the name of the character set output will be converted to. Otherwise, it will be ``None``.
pt_br: Alguns conjuntos de caracteres precisam ser convertidos antes de serem usados em cabeçalhos ou corpos de e-mail. Se *input_charset* for um deles, este atributo conterá o nome do conjunto de caracteres para o qual a saída será convertida. Caso contrário, será ``None``.

source: The name of the Python codec used to convert the *input_charset* to Unicode. If no conversion codec is necessary, this attribute will be ``None``.
pt_br: O nome do codec Python usado para converter o *input_charset* para Unicode. Se nenhum codec de conversão for necessário, este atributo será ``None``.

source: The name of the Python codec used to convert Unicode to the *output_charset*. If no conversion codec is necessary, this attribute will have the same value as the *input_codec*.
pt_br: O nome do codec Python usado para converter Unicode para o *output_charset*. Se nenhum codec de conversão for necessário, este atributo terá o mesmo valor que o *input_codec*.

source: :class:`Charset` instances also have the following methods:
pt_br: Instâncias :class:`Charset` também têm os seguintes métodos:

source: Return the content transfer encoding used for body encoding.
pt_br: Retorna a codificação de transferência de conteúdo usada para codificação do corpo.

source: This is either the string ``quoted-printable`` or ``base64`` depending on the encoding used, or it is a function, in which case you should call the function with a single argument, the Message object being encoded. The function should then set the :mailheader:`Content-Transfer-Encoding` header itself to whatever is appropriate.
pt_br: Esta é a string ``quoted-printable`` ou ``base64``, dependendo da codificação usada, ou é uma função, caso em que você deve chamar a função com um único argumento, sendo o objeto Message codificado. A função deve então definir o próprio cabeçalho :mailheader:`Content-Transfer-Encoding` com o valor apropriado.

source: Returns the string ``quoted-printable`` if *body_encoding* is ``QP``, returns the string ``base64`` if *body_encoding* is ``BASE64``, and returns the string ``7bit`` otherwise.
pt_br: Retorna a string ``quoted-printable`` se *body_encoding* for ``QP``, retorna a string ``base64`` se *body_encoding* for ``BASE64`` e retorna a string ``7bit`` caso contrário.

source: Return the output character set.
pt_br: Retorna o conjunto de caracteres de saída.

source: This is the *output_charset* attribute if that is not ``None``, otherwise it is *input_charset*.
pt_br: Este é o atributo *output_charset* se não for ``None``, caso contrário, é *input_charset*.

source: Header-encode the string *string*.
pt_br: Codifica o cabeçalho com a string *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *header_encoding* attribute.
pt_br: O tipo de codificação (base64 ou quoted-printable) será baseado no atributo *header_encoding*.

source: Header-encode a *string* by converting it first to bytes.
pt_br: Codifica um cabeçalho de uma *string* convertendo-a primeiro em bytes.

source: This is similar to :meth:`header_encode` except that the string is fit into maximum line lengths as given by the argument *maxlengths*, which must be an iterator: each element returned from this iterator will provide the next maximum line length.
pt_br: Isso é semelhante a :meth:`header_encode`, exceto que a string é ajustada aos comprimentos máximos de linha, conforme fornecido pelo argumento *maxlengths*, que deve ser um iterador: cada elemento retornado deste iterador fornecerá o próximo comprimento máximo de linha.

source: Body-encode the string *string*.
pt_br: Codifica o corpo com a string *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *body_encoding* attribute.
pt_br: O tipo de codificação (base64 ou quoted-printable) será baseado no atributo *body_encoding*.

source: The :class:`Charset` class also provides a number of methods to support standard operations and built-in functions.
pt_br: A classe :class:`Charset` também fornece vários métodos para dar suporte a operações padrão e funções embutidas.

source: Returns *input_charset* as a string coerced to lower case. :meth:`!__repr__` is an alias for :meth:`!__str__`.
pt_br: Retorna *input_charset* como uma string convertida para minúsculas. :meth:`!__repr__` é um apelido para :meth:`!__str__`.

source: This method allows you to compare two :class:`Charset` instances for equality.
pt_br: Este método permite que você compare duas instâncias :class:`Charset` para verificar a igualdade.

source: This method allows you to compare two :class:`Charset` instances for inequality.
pt_br: Este método permite que você compare duas instâncias :class:`Charset` para verificar a desigualdade.

source: The :mod:`email.charset` module also provides the following functions for adding new entries to the global character set, alias, and codec registries:
pt_br: O módulo :mod:`email.charset` também fornece as seguintes funções para adicionar novas entradas ao conjunto global de caracteres, apelidos e registros de codec:

source: Add character properties to the global registry.
pt_br: Adiciona propriedades de caracteres ao registro global.

source: *charset* is the input character set, and must be the canonical name of a character set.
pt_br: *charset* é o conjunto de caracteres de entrada e deve ser o nome canônico de um conjunto de caracteres.

source: Optional *header_enc* and *body_enc* is either ``charset.QP`` for quoted-printable, ``charset.BASE64`` for base64 encoding, ``charset.SHORTEST`` for the shortest of quoted-printable or base64 encoding, or ``None`` for no encoding. ``SHORTEST`` is only valid for *header_enc*. The default is ``None`` for no encoding.
pt_br: *header_enc* e *body_enc* opcionais são ``charset.QP`` para quoted-printable, ``charset.BASE64`` para codificação base64, ``charset.SHORTEST`` para a codificação mais curta entre quoted-printable ou base64, ou ``None`` para nenhuma codificação. ``SHORTEST`` é válido apenas para *header_enc*. O padrão é ``None`` para nenhuma codificação.

source: Optional *output_charset* is the character set that the output should be in. Conversions will proceed from input charset, to Unicode, to the output charset when the method :meth:`Charset.convert` is called. The default is to output in the same character set as the input.
pt_br: *output_charset* opcional é o conjunto de caracteres que a saída deve conter. As conversões prosseguirão do conjunto de caracteres de entrada para Unicode e para o conjunto de caracteres de saída quando o método :meth:`Charset.convert` for chamado. O padrão é gerar a saída no mesmo conjunto de caracteres da entrada.

source: Both *input_charset* and *output_charset* must have Unicode codec entries in the module's character set-to-codec mapping; use :func:`add_codec` to add codecs the module does not know about. See the :mod:`codecs` module's documentation for more information.
pt_br: Tanto *input_charset* quanto *output_charset* devem ter entradas de codec Unicode no mapeamento de conjunto de caracteres para codec do módulo; use :func:`add_codec` para adicionar codecs que o módulo não conhece. Consulte a documentação do módulo :mod:`codecs` para obter mais informações.

source: The global character set registry is kept in the module global dictionary ``CHARSETS``.
pt_br: O registro do conjunto de caracteres global é mantido no dicionário global do módulo ``CHARSETS``.

source: Add a character set alias. *alias* is the alias name, e.g. ``latin-1``. *canonical* is the character set's canonical name, e.g. ``iso-8859-1``.
pt_br: Adicione um apelido para o conjunto de caracteres. *alias* é o nome do alias, por exemplo, ``latin-1``. *canonical* é o nome canônico do conjunto de caracteres, por exemplo, ``iso-8859-1``.

source: The global charset alias registry is kept in the module global dictionary ``ALIASES``.
pt_br: O registro global de apelido de conjunto de caracteres é mantido no dicionário global do módulo ``ALIASES``.

source: Add a codec that map characters in the given character set to and from Unicode.
pt_br: Adiciona um codec que mapeia caracteres no conjunto de caracteres fornecido para e a partir do Unicode.

source: *charset* is the canonical name of a character set. *codecname* is the name of a Python codec, as appropriate for the second argument to the :class:`str`'s :meth:`~str.encode` method.
pt_br: *charset* é o nome canônico de um conjunto de caracteres. *codecname* é o nome de um codec Python, conforme apropriado para o segundo argumento do método :meth:`~str.encode` do :class:`str`.
