Repository: python/python-docs-pt-br
Catalog: library/email.compat32-message.po
Languages: pt_br

source: :mod:`email.message.Message`: Representing an email message using the :data:`~email.policy.compat32` API
pt_br: :mod:`email.message.Message`: Представлення повідомлення електронної пошти за допомогою API :data:`~email.policy.compat32`

source: The :class:`Message` class is very similar to the :class:`~email.message.EmailMessage` class, without the methods added by that class, and with the default behavior of certain other methods being slightly different. We also document here some methods that, while supported by the :class:`~email.message.EmailMessage` class, are not recommended unless you are dealing with legacy code.
pt_br: Клас :class:`Message` дуже схожий на клас :class:`~email.message.EmailMessage`, але без методів, доданих цим класом, і з поведінкою за замовчуванням деяких інших методів дещо іншою. Ми також документуємо тут деякі методи, які, хоча й підтримуються класом :class:`~email.message.EmailMessage`, не рекомендуються, якщо ви не маєте справу зі застарілим кодом.

source: The philosophy and structure of the two classes is otherwise the same.
pt_br: Філософія та структура двох класів є однаковими.

source: This document describes the behavior under the default (for :class:`Message`) policy :attr:`~email.policy.Compat32`. If you are going to use another policy, you should be using the :class:`~email.message.EmailMessage` class instead.
pt_br: Цей документ описує поведінку за умовчанням (для :class:`Message`) політики :attr:`~email.policy.Compat32`. Якщо ви збираєтеся використовувати іншу політику, замість неї слід використовувати клас :class:`~email.message.EmailMessage`.

source: An email message consists of *headers* and a *payload*. Headers must be :rfc:`5322` style names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
pt_br: Повідомлення електронної пошти складається з *заголовків* і *корисного навантаження*. Заголовки мають бути в стилі :rfc:`5322` імен і значень, де назва поля та значення розділені двокрапкою. Двокрапка не є частиною ані імені поля, ані значення поля. Корисне навантаження може бути простим текстовим повідомленням, або двійковим об’єктом, або структурованою послідовністю підповідомлень, кожне з яких має власний набір заголовків і власне корисне навантаження. Останній тип корисного навантаження вказується повідомленням, що має тип MIME, наприклад :mimetype:`multipart/\*` або :mimetype:`message/rfc822`.

source: The conceptual model provided by a :class:`Message` object is that of an ordered dictionary of headers with additional methods for accessing both specialized information from the headers, for accessing the payload, for generating a serialized version of the message, and for recursively walking over the object tree. Note that duplicate headers are supported but special methods must be used to access them.
pt_br: Концептуальна модель, яку забезпечує об’єкт :class:`Message`, — це впорядкований словник заголовків із додатковими методами для доступу до спеціалізованої інформації із заголовків, для доступу до корисного навантаження, для генерації серіалізованої версії повідомлення та для рекурсивного проходячи по дереву предметів. Зауважте, що дублікати заголовків підтримуються, але для доступу до них потрібно використовувати спеціальні методи.

source: The :class:`Message` pseudo-dictionary is indexed by the header names, which must be ASCII values. The values of the dictionary are strings that are supposed to contain only ASCII characters; there is some special handling for non-ASCII input, but it doesn't always produce the correct results. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. There may also be a single envelope header, also known as the *Unix-From* header or the ``From_`` header. The *payload* is either a string or bytes, in the case of simple message objects, or a list of :class:`Message` objects, for MIME container documents (e.g. :mimetype:`multipart/\*` and :mimetype:`message/rfc822`).
pt_br: Псевдословник :class:`Message` індексується іменами заголовків, які мають бути значеннями ASCII. Значення словника - це рядки, які мають містити лише символи ASCII; існує певна особлива обробка для вводу не-ASCII, але вона не завжди дає правильні результати. Заголовки зберігаються та повертаються у формі зі збереженням регістру, але імена полів зіставляються без урахування регістру. Також може бути єдиний заголовок конверта, також відомий як заголовок *Unix-From* або заголовок ``From_``. *Корисне навантаження* — це або рядок, або байти, у випадку простих об’єктів повідомлення, або список об’єктів :class:`Message` для документів-контейнерів MIME (наприклад, :mimetype:`multipart/\*` і :mimetype:`повідомлення/rfc822`).

source: Here are the methods of the :class:`Message` class:
pt_br: Ось методи класу :class:`Message`:

source: If *policy* is specified (it must be an instance of a :mod:`~email.policy` class) use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`compat32 <email.policy.Compat32>` policy, which maintains backward compatibility with the Python 3.2 version of the email package. For more information see the :mod:`~email.policy` documentation.
pt_br: Якщо вказано *policy* (вона має бути екземпляром класу :mod:`~email.policy`), використовуйте вказані в ньому правила для оновлення та серіалізації представлення повідомлення. Якщо *policy* не встановлено, використовуйте політику :class:`compat32 <email.policy.Compat32>`, яка підтримує зворотну сумісність із версією пакета електронної пошти Python 3.2. Для отримання додаткової інформації дивіться документацію :mod:`~email.policy`.

source: The *policy* keyword argument was added.
pt_br: Додано аргумент ключового слова *policy*.

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility reasons, *maxheaderlen* defaults to ``0``, so if you want a different value you must override it explicitly (the value specified for *max_line_length* in the policy will be ignored by this method). The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``Generator``.
pt_br: Повернути все повідомлення зведеним у вигляді рядка. Якщо необов’язковий параметр *unixfrom* має значення true, заголовок конверта включається до поверненого рядка. *unixfrom* за умовчанням має значення ``False``. З міркувань зворотної сумісності *maxheaderlen* за замовчуванням має значення ``0``, тому, якщо ви бажаєте інше значення, ви повинні його явно змінити (значення, указане для *max_line_length* у політиці, ігноруватиметься цим методом). Аргумент *policy* можна використовувати для заміни політики за замовчуванням, отриманої з екземпляра повідомлення. Це можна використовувати для керування частиною форматування, створеного методом, оскільки вказану *політику* буде передано ``генератору``.

source: Flattening the message may trigger changes to the :class:`Message` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
pt_br: Зведення повідомлення може викликати зміни в :class:`Message`, якщо для завершення перетворення в рядок необхідно вказати значення за замовчуванням (наприклад, можуть бути створені або змінені межі MIME).

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.Generator` instance and use its :meth:`~email.generator.Generator.flatten` method directly. For example::
pt_br: Обратите внимание, что этот метод предоставляется для удобства и не всегда может форматировать сообщение так, как вы хотите. Например, по умолчанию он не выполняет искажение строк, начинающихся с ``From``, как того требует формат Unix mbox. Для большей гибкости создайте экземпляр :class:`~email.generator.Generator` и используйте его метод :meth:`~email.generator.Generator.flatten` напрямую. Например::

source: If the message object contains binary data that is not encoded according to RFC standards, the non-compliant data will be replaced by unicode "unknown character" code points. (See also :meth:`.as_bytes` and :class:`~email.generator.BytesGenerator`.)
pt_br: Якщо об’єкт повідомлення містить двійкові дані, які не закодовані відповідно до стандартів RFC, невідповідні дані буде замінено кодовими точками Unicode "невідомий символ". (Див. також :meth:`.as_bytes` і :class:`~email.generator.BytesGenerator`.)

source: the *policy* keyword argument was added.
pt_br: було додано аргумент ключового слова *policy*.

source: Equivalent to :meth:`.as_string`. Allows ``str(msg)`` to produce a string containing the formatted message.
pt_br: Эквивалент :meth:`.as_string`. Позволяет ``str(msg)`` создавать строку, содержащую форматированное сообщение.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``BytesGenerator``.
pt_br: Повертає все повідомлення зведене як об’єкт bytes. Якщо необов’язковий параметр *unixfrom* має значення true, заголовок конверта включається до поверненого рядка. *unixfrom* за умовчанням має значення ``False``. Аргумент *policy* можна використовувати для заміни політики за замовчуванням, отриманої з екземпляра повідомлення. Це можна використовувати для керування частиною форматування, створеного методом, оскільки вказану *політику* буде передано до ``BytesGenerator``.

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.BytesGenerator` instance and use its :meth:`~email.generator.BytesGenerator.flatten` method directly. For example::
pt_br: Обратите внимание, что этот метод предоставляется для удобства и не всегда может форматировать сообщение так, как вы хотите. Например, по умолчанию он не выполняет искажение строк, начинающихся с ``From``, как того требует формат Unix mbox. Для большей гибкости создайте экземпляр :class:`~email.generator.BytesGenerator` и используйте его метод :meth:`~email.generator.BytesGenerator.flatten` напрямую. Например::

source: Equivalent to :meth:`.as_bytes`. Allows ``bytes(msg)`` to produce a bytes object containing the formatted message.
pt_br: Эквивалент :meth:`.as_bytes`. Позволяет ``bytes(msg)`` создавать объект bytes, содержащий форматированное сообщение.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`Message` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). (Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`Message` is of type ``message/rfc822``.)
pt_br: Повертає ``True``, якщо корисним навантаженням повідомлення є список sub-\ :class:`Message` об’єктів, інакше повертає ``False``. Коли :meth:`is_multipart` повертає ``False``, корисним навантаженням має бути рядковий об’єкт (який може бути двійковим навантаженням у кодуванні CTE). (Зауважте, що :meth:`is_multipart`, що повертає ``True``, не обов’язково означає, що "msg.get_content_maintype() == 'multipart'" поверне ``True``. Наприклад, ``is_multipart`` буде повертає ``True``, якщо :class:`Message` має тип ``message/rfc822``.)

source: Set the message's envelope header to *unixfrom*, which should be a string.
pt_br: Встановіть заголовок конверта повідомлення на *unixfrom*, який має бути рядком.

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
pt_br: Повернути заголовок конверта повідомлення. За замовчуванням ``None``, якщо заголовок конверта ніколи не встановлювався.

source: Add the given *payload* to the current payload, which must be ``None`` or a list of :class:`Message` objects before the call. After the call, the payload will always be a list of :class:`Message` objects. If you want to set the payload to a scalar object (e.g. a string), use :meth:`set_payload` instead.
pt_br: Додайте вказане *корисне навантаження* до поточного корисного навантаження, яке має бути ``None`` або список об’єктів :class:`Message` перед викликом. Після виклику корисним навантаженням завжди буде список об’єктів :class:`Message`. Якщо ви хочете встановити корисне навантаження на скалярний об’єкт (наприклад, рядок), замість цього використовуйте :meth:`set_payload`.

source: Return the current payload, which will be a list of :class:`Message` objects when :meth:`is_multipart` is ``True``, or a string when :meth:`is_multipart` is ``False``. If the payload is a list and you mutate the list object, you modify the message's payload in place.
pt_br: Повертає поточне корисне навантаження, яке буде списком об’єктів :class:`Message`, якщо :meth:`is_multipart` має значення ``True``, або рядок, коли :meth:`is_multipart` має значення ``False``. Якщо корисним навантаженням є список, і ви змінюєте об’єкт списку, ви змінюєте корисне навантаження повідомлення на місці.

source: With optional argument *i*, :meth:`get_payload` will return the *i*-th element of the payload, counting from zero, if :meth:`is_multipart` is ``True``. An :exc:`IndexError` will be raised if *i* is less than 0 or greater than or equal to the number of items in the payload. If the payload is a string (i.e. :meth:`is_multipart` is ``False``) and *i* is given, a :exc:`TypeError` is raised.
pt_br: З необов’язковим аргументом *i* :meth:`get_payload` поверне *i*-й елемент корисного навантаження, починаючи з нуля, якщо :meth:`is_multipart` має значення ``True``. Помилка :exc:`IndexError` буде викликана, якщо *i* менше за 0 або більше або дорівнює кількості елементів у корисному навантаженні. Якщо корисне навантаження є рядком (тобто :meth:`is_multipart` має значення ``False``) і задано *i*, виникає :exc:`TypeError`.

source: Optional *decode* is a flag indicating whether the payload should be decoded or not, according to the :mailheader:`Content-Transfer-Encoding` header. When ``True`` and the message is not a multipart, the payload will be decoded if this header's value is ``quoted-printable`` or ``base64``. If some other encoding is used, or :mailheader:`Content-Transfer-Encoding` header is missing, the payload is returned as-is (undecoded). In all cases the returned value is binary data. If the message is a multipart and the *decode* flag is ``True``, then ``None`` is returned. If the payload is base64 and it was not perfectly formed (missing padding, characters outside the base64 alphabet), then an appropriate defect will be added to the message's defect property (:class:`~email.errors.InvalidBase64PaddingDefect` or :class:`~email.errors.InvalidBase64CharactersDefect`, respectively).
pt_br: Необов’язковий *decode* — це прапорець, який вказує, чи слід декодувати корисне навантаження чи ні, відповідно до заголовка :mailheader:`Content-Transfer-Encoding`. Якщо значення ``True`` і повідомлення не складається з кількох частин, корисне навантаження буде декодовано, якщо значенням цього заголовка є ``quoted-printable`` або ``base64``. Якщо використовується інше кодування або відсутній заголовок :mailheader:`Content-Transfer-Encoding`, корисне навантаження повертається як є (недекодоване). У всіх випадках повертається двійкове значення. Якщо повідомлення складається з кількох частин і прапорець *decode* має значення ``True``, тоді повертається ``None``. Якщо корисне навантаження є base64 і воно не було ідеально сформоване (відсутнє заповнення, символи поза алфавітом base64), тоді до властивості дефекту повідомлення буде додано відповідний дефект (:class:`~email.errors.InvalidBase64PaddingDefect` або :class:`~email.errors.InvalidBase64CharactersDefect` відповідно).

source: When *decode* is ``False`` (the default) the body is returned as a string without decoding the :mailheader:`Content-Transfer-Encoding`. However, for a :mailheader:`Content-Transfer-Encoding` of 8bit, an attempt is made to decode the original bytes using the ``charset`` specified by the :mailheader:`Content-Type` header, using the ``replace`` error handler. If no ``charset`` is specified, or if the ``charset`` given is not recognized by the email package, the body is decoded using the default ASCII charset.
pt_br: Якщо *decode* має значення ``False`` (за замовчуванням), тіло повертається як рядок без декодування :mailheader:`Content-Transfer-Encoding`. Однак для :mailheader:`Content-Transfer-Encoding` 8 біт робиться спроба декодувати оригінальні байти за допомогою ``charset``, визначеного заголовком :mailheader:`Content-Type`, використовуючи обробник помилок ``replace``. Якщо ``charset`` не вказано, або якщо наданий ``набір символів`` не розпізнається пакетом електронної пошти, тіло декодується за допомогою набору символів ASCII за замовчуванням.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.get_content` and :meth:`~email.message.EmailMessage.iter_parts`.
pt_br: Esse é um método legado. Na classe :class:`~email.emailmessage.EmailMessage` sua funcionalidade é substituída por :meth:`~email.message.EmailMessage.get_content` e :meth:`~email.message.EmailMessage.iter_parts`.

source: Set the entire message object's payload to *payload*. It is the client's responsibility to ensure the payload invariants. Optional *charset* sets the message's default character set; see :meth:`set_charset` for details.
pt_br: Встановіть корисне навантаження всього об’єкта повідомлення на *корисне навантаження*. Клієнт відповідає за забезпечення інваріантів корисного навантаження. Додатковий *charset* встановлює стандартний набір символів повідомлення; подробиці див. :meth:`set_charset`.

source: Set the character set of the payload to *charset*, which can either be a :class:`~email.charset.Charset` instance (see :mod:`email.charset`), a string naming a character set, or ``None``. If it is a string, it will be converted to a :class:`~email.charset.Charset` instance. If *charset* is ``None``, the ``charset`` parameter will be removed from the :mailheader:`Content-Type` header (the message will not be otherwise modified). Anything else will generate a :exc:`TypeError`.
pt_br: Встановіть набір символів корисного навантаження на *charset*, який може бути екземпляром :class:`~email.charset.Charset` (див. :mod:`email.charset`), рядком із назвою набору символів або ``Жодного``. Якщо це рядок, його буде перетворено на екземпляр :class:`~email.charset.Charset`. Якщо *charset* має значення ``None``, параметр ``charset`` буде видалено із заголовка :mailheader:`Content-Type` (повідомлення не буде іншим чином змінено). Усе інше створить :exc:`TypeError`.

source: If there is no existing :mailheader:`MIME-Version` header one will be added. If there is no existing :mailheader:`Content-Type` header, one will be added with a value of :mimetype:`text/plain`. Whether the :mailheader:`Content-Type` header already exists or not, its ``charset`` parameter will be set to *charset.output_charset*. If *charset.input_charset* and *charset.output_charset* differ, the payload will be re-encoded to the *output_charset*. If there is no existing :mailheader:`Content-Transfer-Encoding` header, then the payload will be transfer-encoded, if needed, using the specified :class:`~email.charset.Charset`, and a header with the appropriate value will be added. If a :mailheader:`Content-Transfer-Encoding` header already exists, the payload is assumed to already be correctly encoded using that :mailheader:`Content-Transfer-Encoding` and is not modified.
pt_br: Якщо немає існуючого заголовка :mailheader:`MIME-Version`, буде додано один. Якщо немає заголовка :mailheader:`Content-Type`, його буде додано зі значенням :mimetype:`text/plain`. Незалежно від того, чи існує заголовок :mailheader:`Content-Type`, його параметр ``charset`` буде встановлено на *charset.output_charset*. Якщо *charset.input_charset* і *charset.output_charset* відрізняються, корисне навантаження буде перекодовано в *output_charset*. Якщо немає існуючого заголовка :mailheader:`Content-Transfer-Encoding`, то корисне навантаження буде закодовано за потреби за допомогою вказаного :class:`~email.charset.Charset` і заголовка з відповідним буде додано значення. Якщо заголовок :mailheader:`Content-Transfer-Encoding` вже існує, вважається, що корисне навантаження вже правильно закодовано за допомогою цього :mailheader:`Content-Transfer-Encoding` і не змінюється.

source: Return the :class:`~email.charset.Charset` instance associated with the message's payload.
pt_br: Повертає екземпляр :class:`~email.charset.Charset`, пов’язаний із корисним навантаженням повідомлення.

source: The following methods implement a mapping-like interface for accessing the message's :rfc:`2822` headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in a :class:`Message` object, headers are always returned in the order they appeared in the original message, or were added to the message later. Any header deleted and then re-added are always appended to the end of the header list.
pt_br: Наступні методи реалізують схожий на відображення інтерфейс для доступу до заголовків повідомлення :rfc:`2822`. Зверніть увагу, що існують деякі семантичні відмінності між цими методами та інтерфейсом звичайного відображення (тобто словника). Наприклад, у словнику немає дублікатів ключів, але тут можуть бути дублікати заголовків повідомлень. Крім того, у словниках немає гарантованого порядку ключів, які повертає :meth:`keys`, але в об’єкті :class:`Message` заголовки завжди повертаються в тому порядку, в якому вони з’являлися у вихідному повідомленні або були додані до повідомлення пізніше. Будь-який видалений і потім знову доданий заголовок завжди додається в кінець списку заголовків.

source: These semantic differences are intentional and are biased toward maximal convenience.
pt_br: Ці семантичні відмінності є навмисними та спрямовані на максимальну зручність.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
pt_br: Зауважте, що в усіх випадках будь-який заголовок конверта, присутній у повідомленні, не включається в інтерфейс зіставлення.
