Repository: python/python-docs-pt-br
Catalog: library/email.compat32-message.po
Languages: pt_br

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
pt_br: Метод :meth:`walk` — це універсальний генератор, який можна використовувати для перебору всіх частин і підчастин дерева об’єктів повідомлення в порядку проходження спочатку в глибину. Ви зазвичай використовуєте :meth:`walk` як ітератор у циклі ``for``; кожна ітерація повертає наступну підчастину.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
pt_br: Ось приклад, який друкує тип MIME кожної частини структури повідомлення, що складається з кількох частин:

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
pt_br: ``walk`` повторює підчастини будь-якої частини, де :meth:`is_multipart` повертає ``True``, навіть якщо ``msg.get_content_maintype() == 'multipart'`` може повернути ``False``. Ми можемо побачити це в нашому прикладі, використовуючи допоміжну функцію налагодження ``_structure``:

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
pt_br: Тут частини ``message`` не є ``multiparts``, але вони містять підчастини. ``is_multipart()`` повертає ``True`` і ``walk`` спускається до підчастин.

source: :class:`Message` objects can also optionally contain two instance attributes, which can be used when generating the plain text of a MIME message.
pt_br: Об’єкти :class:`Message` також можуть додатково містити два атрибути екземпляра, які можна використовувати під час генерації простого тексту повідомлення MIME.

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
pt_br: Формат документа MIME допускає деякий текст між порожнім рядком після заголовків і першим обмежувальним рядком із складених частин. Зазвичай цей текст ніколи не відображається в програмі читання пошти з підтримкою MIME, оскільки він виходить за межі стандартної броні MIME. Однак під час перегляду необробленого тексту повідомлення або під час перегляду повідомлення в програмі читання, яка не підтримує MIME, цей текст може стати видимим.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
pt_br: Атрибут *преамбула* містить цей провідний додатковий текст для документів MIME. Коли :class:`~email.parser.Parser` виявляє текст після заголовків, але перед першим обмежувальним рядком, він призначає цей текст атрибуту *преамбула* повідомлення. Коли :class:`~email.generator.Generator` записує звичайне текстове представлення повідомлення MIME і виявляє, що повідомлення має атрибут *преамбула*, він записує цей текст у область між заголовками та перша межа. Перегляньте :mod:`email.parser` і :mod:`email.generator` для деталей.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
pt_br: Зауважте, що якщо об’єкт повідомлення не має преамбули, атрибут *preamble* матиме значення ``None``.

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message.
pt_br: Атрибут *epilogue* діє так само, як і атрибут *preamble*, за винятком того, що він містить текст, який з’являється між останньою межею та кінцем повідомлення.

source: You do not need to set the epilogue to the empty string in order for the :class:`~email.generator.Generator` to print a newline at the end of the file.
pt_br: Вам не потрібно встановлювати епілог порожнім рядком, щоб :class:`~email.generator.Generator` друкував новий рядок у кінці файлу.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
pt_br: Атрибут *defects* містить список усіх проблем, виявлених під час аналізу цього повідомлення. Перегляньте :mod:`email.errors` для детального опису можливих дефектів аналізу.
