Repository: python/python-docs-pt-br
Catalog: library/email.message.po
Languages: pt_br

source: (According to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value. :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.)
pt_br: (Відповідно до :rfc:`2045`, повідомлення завжди мають тип за замовчуванням, :meth:`get_content_type` завжди повертатиме значення. :rfc:`2045` визначає тип повідомлення за замовчуванням як :mimetype:`text/plain` якщо він не з’являється всередині контейнера :mimetype:`multipart/digest`, у такому випадку це буде :mimetype:`message/rfc822`. Якщо заголовок :mailheader:`Content-Type` має недійсну специфікацію типу, :rfc:`2045` вимагає, щоб тип за замовчуванням був :mimetype:`text/plain`.)

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
pt_br: Повернути основний тип вмісту повідомлення. Це :mimetype:`maintype` частина рядка, яку повертає :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
pt_br: Повернути тип підвмісту повідомлення. Це :mimetype:`subtype` частина рядка, яку повертає :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
pt_br: Повернути типовий тип вмісту. Більшість повідомлень мають стандартний тип вмісту :mimetype:`text/plain`, за винятком повідомлень, які є підчастинами контейнерів :mimetype:`multipart/digest`. Такі підчастини мають типовий тип вмісту :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header, so it only affects the return value of the ``get_content_type`` methods when no :mailheader:`Content-Type` header is present in the message.
pt_br: Встановіть тип вмісту за замовчуванням. *ctype* має бути :mimetype:`text/plain` або :mimetype:`message/rfc822`, хоча це не обов’язково. Тип вмісту за замовчуванням не зберігається в заголовку :mailheader:`Content-Type`, тому він впливає лише на значення, що повертається методами ``get_content_type``, якщо в повідомленні немає заголовка :mailheader:`Content-Type` .

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, replace its value with *value*. When *header* is ``Content-Type`` (the default) and the header does not yet exist in the message, add it, set its value to :mimetype:`text/plain`, and append the new parameter value. Optional *header* specifies an alternative header to :mailheader:`Content-Type`.
pt_br: Установіть параметр у заголовку :mailheader:`Content-Type`. Якщо параметр уже існує в заголовку, замініть його значення на *value*. Якщо *header* має значення ``Content-Type`` (за замовчуванням), а заголовок ще не існує в повідомленні, додайте його, установіть для нього значення :mimetype:`text/plain` і додайте нове значення параметра. Необов’язковий *header* визначає альтернативний заголовок :mailheader:`Content-Type`.

source: If the value contains non-ASCII characters, the charset and language may be explicitly specified using the optional *charset* and *language* parameters. Optional *language* specifies the :rfc:`2231` language, defaulting to the empty string. Both *charset* and *language* should be strings. The default is to use the ``utf8`` *charset* and ``None`` for the *language*.
pt_br: Якщо значення містить символи, відмінні від ASCII, кодування та мову можна вказати явно за допомогою додаткових параметрів *charset* і *language*. Необов’язковий *мова* вказує мову :rfc:`2231`, за умовчанням порожній рядок. І *charset*, і *language* мають бути рядками. За замовчуванням для *мови* використовується ``utf8`` *charset* і ``None``.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
pt_br: Якщо *replace* має значення ``False`` (за замовчуванням), заголовок переміщується в кінець списку заголовків. Якщо *replace* має значення ``True``, заголовок буде оновлено на місці.

source: Use of the *requote* parameter with :class:`EmailMessage` objects is deprecated.
pt_br: Uso do parâmetro *requote* com objetos :class:`EmailMessage` está descontinuado.

source: Note that existing parameter values of headers may be accessed through the :attr:`~email.headerregistry.BaseHeader.params` attribute of the header value (for example, ``msg['Content-Type'].params['charset']``).
pt_br: Зауважте, що наявні значення параметрів заголовків можна отримати через атрибут :attr:`~email.headerregistry.BaseHeader.params` значення заголовка (наприклад, ``msg['Content-Type'].params['charset' ]``).

source: ``replace`` keyword was added.
pt_br: Palavra-chave ``replace`` foi adicionada.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. Optional *header* specifies an alternative to :mailheader:`Content-Type`.
pt_br: Повністю вилучіть вказаний параметр із заголовка :mailheader:`Content-Type`. Заголовок буде перезаписано на місці без параметра чи його значення. Необов’язковий *заголовок* визначає альтернативу :mailheader:`Content-Type`.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
pt_br: Повертає значення параметра ``filename`` заголовка :mailheader:`Content-Disposition` повідомлення. Якщо заголовок не має параметра ``filename``, цей метод повертається до пошуку параметра ``name`` у заголовку :mailheader:`Content-Type`. Якщо нічого не знайдено або відсутній заголовок, повертається *failobj*. Повернений рядок завжди буде без лапок відповідно до :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
pt_br: Повертає значення параметра ``boundary`` заголовка :mailheader:`Content-Type` повідомлення або *failobj*, якщо заголовок відсутній або не має параметра ``boundary``. Повернений рядок завжди буде без лапок відповідно до :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
pt_br: Установіть для параметра ``boundary`` заголовка :mailheader:`Content-Type` значення *boundary*. :meth:`set_boundary` завжди братиме *boundary* у лапки, якщо необхідно. Помилка :exc:`~email.errors.HeaderParseError` виникає, якщо об’єкт повідомлення не має заголовка :mailheader:`Content-Type`.

source: Note that using this method is subtly different from deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers.
pt_br: Зауважте, що використання цього методу дещо відрізняється від видалення старого заголовка :mailheader:`Content-Type` і додавання нового з новою межею за допомогою :meth:`add_header`, оскільки :meth:`set_boundary` зберігає порядок заголовок :mailheader:`Content-Type` у списку заголовків.

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
pt_br: Повертає параметр ``charset`` заголовка :mailheader:`Content-Type` у нижньому регістрі. Якщо немає заголовка :mailheader:`Content-Type` або цей заголовок не має параметра ``charset``, повертається *failobj*.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
pt_br: Повернути список із назвами наборів символів у повідомленні. Якщо повідомлення є :mimetype:`multipart`, тоді список міститиме один елемент для кожної підчастини в корисному навантаженні, інакше це буде список довжиною 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. If the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
pt_br: Кожен елемент у списку буде рядком, який є значенням параметра ``charset`` у заголовку :mailheader:`Content-Type` для представленої підчастини. Якщо підчастина не має заголовка :mailheader:`Content-Type`, параметра ``charset`` або не належить до основного типу MIME :mimetype:`text`, тоді цей елемент у списку буде *failobj* .

source: Return ``True`` if there is a :mailheader:`Content-Disposition` header and its (case insensitive) value is ``attachment``, ``False`` otherwise.
pt_br: Повертає ``True``, якщо є заголовок :mailheader:`Content-Disposition` і його (незалежне від регістру) значення є ``attachment``, ``False`` інакше.

source: is_attachment is now a method instead of a property, for consistency with :meth:`~email.message.Message.is_multipart`.
pt_br: is_attachment тепер є методом замість властивості, для узгодженості з :meth:`~email.message.Message.is_multipart`.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
pt_br: Повертає значення в нижньому регістрі (без параметрів) заголовка повідомлення :mailheader:`Content-Disposition`, якщо воно є, або ``None``. Можливі значення для цього методу: *inline*, *attachment* або ``None``, якщо повідомлення слідує за :rfc:`2183`.

source: The following methods relate to interrogating and manipulating the content (payload) of the message.
pt_br: Наступні методи стосуються опитування та маніпулювання вмістом (корисним навантаженням) повідомлення.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
pt_br: Метод :meth:`walk` — це універсальний генератор, який можна використовувати для перебору всіх частин і підчастин дерева об’єктів повідомлення в порядку проходження спочатку в глибину. Ви зазвичай використовуєте :meth:`walk` як ітератор у циклі ``for``; кожна ітерація повертає наступну підчастину.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
pt_br: Ось приклад, який друкує тип MIME кожної частини структури повідомлення, що складається з кількох частин:

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
pt_br: ``walk`` повторює підчастини будь-якої частини, де :meth:`is_multipart` повертає ``True``, навіть якщо ``msg.get_content_maintype() == 'multipart'`` може повернути ``False``. Ми можемо побачити це в нашому прикладі, використовуючи допоміжну функцію налагодження ``_structure``:

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
pt_br: Тут частини ``message`` не є ``multiparts``, але вони містять підчастини. ``is_multipart()`` повертає ``True`` і ``walk`` спускається до підчастин.

source: Return the MIME part that is the best candidate to be the "body" of the message.
pt_br: Повертає частину MIME, яка є найкращим кандидатом на роль "тіла" повідомлення.

source: *preferencelist* must be a sequence of strings from the set ``related``, ``html``, and ``plain``, and indicates the order of preference for the content type of the part returned.
pt_br: *preferencelist* має бути послідовністю рядків із набору ``related``, ``html`` і ``plain`` і вказує на порядок пріоритету для типу вмісту повернутої частини.

source: Start looking for candidate matches with the object on which the ``get_body`` method is called.
pt_br: Почніть шукати збіги кандидатів з об’єктом, для якого викликається метод get_body.

source: If ``related`` is not included in *preferencelist*, consider the root part (or subpart of the root part) of any related encountered as a candidate if the (sub-)part matches a preference.
pt_br: Якщо ``related`` не включено до *preferencelist*, розгляньте кореневу частину (або підчастину кореневої частини) будь-якої пов’язаної частини як кандидата, якщо (під)частина відповідає налаштуванню.

source: When encountering a ``multipart/related``, check the ``start`` parameter and if a part with a matching :mailheader:`Content-ID` is found, consider only it when looking for candidate matches. Otherwise consider only the first (default root) part of the ``multipart/related``.
pt_br: Коли ви зустрічаєте ``multipart/related``, перевірте параметр ``start``, і якщо знайдено частину з відповідним :mailheader:`Content-ID`, враховуйте лише його під час пошуку збігів кандидатів. В іншому випадку враховуйте лише першу (за замовчуванням кореневу) частину ``multipart/related``.

source: If a part has a :mailheader:`Content-Disposition` header, only consider the part a candidate match if the value of the header is ``inline``.
pt_br: Якщо частина має заголовок :mailheader:`Content-Disposition`, розглядайте цю частину як кандидат-збіг, лише якщо значення заголовка є ``inline``.

source: If none of the candidates matches any of the preferences in *preferencelist*, return ``None``.
pt_br: Якщо жоден із кандидатів не відповідає жодному з параметрів у *preferencelist*, поверніть ``None``.

source: Notes: (1) For most applications the only *preferencelist* combinations that really make sense are ``('plain',)``, ``('html', 'plain')``, and the default ``('related', 'html', 'plain')``. (2) Because matching starts with the object on which ``get_body`` is called, calling ``get_body`` on a ``multipart/related`` will return the object itself unless *preferencelist* has a non-default value. (3) Messages (or message parts) that do not specify a :mailheader:`Content-Type` or whose :mailheader:`Content-Type` header is invalid will be treated as if they are of type ``text/plain``, which may occasionally cause ``get_body`` to return unexpected results.
pt_br: Примітки: (1) Для більшості програм єдиними комбінаціями *preferencelist*, які справді мають сенс, є ``('plain',)``, ``('html', 'plain')`` і типове ``( 'related', 'html', 'plain')``. (2) Оскільки зіставлення починається з об’єкта, для якого викликається ``get_body``, виклик ``get_body`` для ``multipart/related`` поверне сам об’єкт, якщо *preferencelist* не має значення за замовчуванням. (3) Повідомлення (або частини повідомлення), у яких не вказано :mailheader:`Content-Type` або чий :mailheader:`Content-Type` заголовок недійсний, розглядатимуться так, ніби вони мають тип ``text/plain``, через що іноді get_body може повертати несподівані результати.

source: Return an iterator over all of the immediate sub-parts of the message that are not candidate "body" parts. That is, skip the first occurrence of each of ``text/plain``, ``text/html``, ``multipart/related``, or ``multipart/alternative`` (unless they are explicitly marked as attachments via :mailheader:`Content-Disposition: attachment`), and return all remaining parts. When applied directly to a ``multipart/related``, return an iterator over the all the related parts except the root part (ie: the part pointed to by the ``start`` parameter, or the first part if there is no ``start`` parameter or the ``start`` parameter doesn't match the :mailheader:`Content-ID` of any of the parts). When applied directly to a ``multipart/alternative`` or a non-``multipart``, return an empty iterator.
pt_br: Повертає ітератор над усіма безпосередніми підчастинами повідомлення, які не є кандидатами на "тіло". Тобто пропустіть перше входження кожного з ``text/plain``, ``text/html``, ``multipart/related`` або ``multipart/alternative`` (якщо вони явно не позначені як вкладення через :mailheader:`Content-Disposition: attachment`), і повернути всі інші частини. При безпосередньому застосуванні до ``multipart/related`` повертає ітератор для всіх пов’язаних частин, крім кореневої частини (тобто: частини, на яку вказує параметр ``start``, або першої частини, якщо її немає Параметр ``start`` або параметр ``start`` не відповідає :mailheader:`Content-ID` жодної з частин). При застосуванні безпосередньо до ``multipart/alternative`` або не-``multipart`` повертає порожній ітератор.

source: Return an iterator over all of the immediate sub-parts of the message, which will be empty for a non-``multipart``. (See also :meth:`~email.message.EmailMessage.walk`.)
pt_br: Повертає ітератор для всіх безпосередніх підчастин повідомлення, який буде порожнім для не-``multipart``. (Див. також :meth:`~email.message.EmailMessage.walk`.)

source: Call the :meth:`~email.contentmanager.ContentManager.get_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
pt_br: Викличте метод :meth:`~email.contentmanager.ContentManager.get_content` *content_manager*, передаючи self як об’єкт повідомлення та передаючи будь-які інші аргументи чи ключові слова як додаткові аргументи. Якщо *content_manager* не вказано, використовуйте ``content_manager``, визначений поточною :mod:`~email.policy`.

source: Call the :meth:`~email.contentmanager.ContentManager.set_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
pt_br: Викличте метод :meth:`~email.contentmanager.ContentManager.set_content` *content_manager*, передаючи self як об’єкт повідомлення та передаючи будь-які інші аргументи чи ключові слова як додаткові аргументи. Якщо *content_manager* не вказано, використовуйте ``content_manager``, визначений поточною :mod:`~email.policy`.

source: Convert a non-``multipart`` message into a ``multipart/related`` message, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
pt_br: Перетворіть повідомлення, яке не є ``складним``, на ``багаточастинне/пов’язане`` повідомлення, перемістивши будь-які існуючі заголовки :mailheader:`Content-` і корисне навантаження в (нову) першу частину ``багаточастинного``. Якщо вказано *межу*, використовуйте її як обмежувальний рядок у складеній частині, інакше залиште межу автоматично створеною, коли це необхідно (наприклад, коли повідомлення серіалізовано).

source: Convert a non-``multipart`` or a ``multipart/related`` into a ``multipart/alternative``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
pt_br: Перетворіть не ``multipart`` або ``multipart/related`` на ``multipart/alternative``, перемістивши всі наявні заголовки :mailheader:`Content-` і корисне навантаження в (нову) першу частину ``багаточастинний``. Якщо вказано *межу*, використовуйте її як обмежувальний рядок у складеній частині, інакше залиште межу автоматично створеною, коли це необхідно (наприклад, коли повідомлення серіалізовано).

source: Convert a non-``multipart``, a ``multipart/related``, or a ``multipart-alternative`` into a ``multipart/mixed``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
pt_br: Перетворіть не ``multipart``, ``multipart/related`` або ``multipart-alternative`` на ``multipart/mixed``, перемістивши будь-які існуючі заголовки :mailheader:`Content-` та корисне навантаження в (нову) першу частину ``multipart``. Якщо вказано *межу*, використовуйте її як обмежувальний рядок у складеній частині, інакше залиште межу автоматично створеною, коли це необхідно (наприклад, коли повідомлення серіалізовано).

source: If the message is a ``multipart/related``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, call :meth:`make_related` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``inline``.
pt_br: Якщо повідомлення є ``multipart/related``, створіть новий об’єкт повідомлення, передайте всі аргументи його методу :meth:`set_content` і :meth:`~email.message.Message.attach` його до ``багаточастинний``. Якщо повідомлення не є ``складним``, викличте :meth:`make_related`, а потім виконайте описані вище дії. Якщо повідомлення має будь-який інший тип ``multipart``, викликайте :exc:`TypeError`. Якщо *content_manager* не вказано, використовуйте ``content_manager``, визначений поточною :mod:`~email.policy`. Якщо додана частина не має заголовка :mailheader:`Content-Disposition`, додайте його зі значенням ``inline``.
