Repository: python/python-docs-pt-br
Catalog: library/email.message.po
Languages: pt_br

source: If the message is a ``multipart/alternative``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart`` or ``multipart/related``, call :meth:`make_alternative` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
pt_br: Якщо повідомлення є ``multipart/alternative``, створіть новий об’єкт повідомлення, передайте всі аргументи його методу :meth:`set_content` і :meth:`~email.message.Message.attach` його до ``багаточастинний``. Якщо повідомлення не є ``multipart`` або ``multipart/related``, викличте :meth:`make_alternative`, а потім виконайте описані вище дії. Якщо повідомлення має будь-який інший тип ``multipart``, викликайте :exc:`TypeError`. Якщо *content_manager* не вказано, використовуйте ``content_manager``, визначений поточною :mod:`~email.policy`.

source: If the message is a ``multipart/mixed``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, ``multipart/related``, or ``multipart/alternative``, call :meth:`make_mixed` and then proceed as above. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``attachment``. This method can be used both for explicit attachments (:mailheader:`Content-Disposition: attachment`) and ``inline`` attachments (:mailheader:`Content-Disposition: inline`), by passing appropriate options to the ``content_manager``.
pt_br: Якщо повідомлення є ``multipart/mixed``, створіть новий об’єкт повідомлення, передайте всі аргументи його методу :meth:`set_content` і :meth:`~email.message.Message.attach` його до ``багаточастинний``. Якщо повідомлення не є ``multipart``, ``multipart/related`` або ``multipart/alternative``, викличте :meth:`make_mixed`, а потім виконайте описані вище дії. Якщо *content_manager* не вказано, використовуйте ``content_manager``, визначений поточною :mod:`~email.policy`. Якщо додана частина не має заголовка :mailheader:`Content-Disposition`, додайте його зі значенням ``attachment``. Цей метод можна використовувати як для явних вкладень (:mailheader:`Content-Disposition: attachment`), так і для вкладень ``inline`` (:mailheader:`Content-Disposition: inline`), передавши відповідні параметри ``content_manager``.

source: Remove the payload and all of the headers.
pt_br: Видаліть корисне навантаження та всі заголовки.

source: Remove the payload and all of the :exc:`Content-` headers, leaving all other headers intact and in their original order.
pt_br: Видаліть корисне навантаження та всі заголовки :exc:`Content-`, залишивши всі інші заголовки недоторканими та в їх початковому порядку.

source: :class:`EmailMessage` objects have the following instance attributes:
pt_br: Об’єкти :class:`EmailMessage` мають такі атрибути екземпляра:

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
pt_br: Формат документа MIME допускає деякий текст між порожнім рядком після заголовків і першим обмежувальним рядком із складених частин. Зазвичай цей текст ніколи не відображається в програмі читання пошти з підтримкою MIME, оскільки він виходить за межі стандартної броні MIME. Однак під час перегляду необробленого тексту повідомлення або під час перегляду повідомлення в програмі читання, яка не підтримує MIME, цей текст може стати видимим.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
pt_br: Атрибут *преамбула* містить цей провідний додатковий текст для документів MIME. Коли :class:`~email.parser.Parser` виявляє текст після заголовків, але перед першим обмежувальним рядком, він призначає цей текст атрибуту *преамбула* повідомлення. Коли :class:`~email.generator.Generator` записує звичайне текстове представлення повідомлення MIME і виявляє, що повідомлення має атрибут *преамбула*, він записує цей текст у область між заголовками та перша межа. Перегляньте :mod:`email.parser` і :mod:`email.generator` для деталей.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
pt_br: Зауважте, що якщо об’єкт повідомлення не має преамбули, атрибут *preamble* матиме значення ``None``.

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message. As with the :attr:`~EmailMessage.preamble`, if there is no epilog text this attribute will be ``None``.
pt_br: Атрибут *epilogue* діє так само, як і атрибут *preamble*, за винятком того, що він містить текст, який з’являється між останньою межею та кінцем повідомлення. Як і у випадку з :attr:`~EmailMessage.preamble`, якщо немає тексту епілога, цей атрибут буде ``None``.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
pt_br: Атрибут *defects* містить список усіх проблем, виявлених під час аналізу цього повідомлення. Перегляньте :mod:`email.errors` для детального опису можливих дефектів аналізу.

source: This class represents a subpart of a MIME message. It is identical to :class:`EmailMessage`, except that no :mailheader:`MIME-Version` headers are added when :meth:`~EmailMessage.set_content` is called, since sub-parts do not need their own :mailheader:`MIME-Version` headers.
pt_br: Цей клас представляє підчастину повідомлення MIME. Він ідентичний :class:`EmailMessage`, за винятком того, що під час виклику :meth:`~EmailMessage.set_content` не додаються заголовки :mailheader:`MIME-Version`, оскільки підчастини не потребують власного Заголовки :mailheader:`MIME-Version`.

source: Footnotes
pt_br: Notas de rodapé

source: Originally added in 3.4 as a :term:`provisional module <provisional package>`. Docs for legacy message class moved to :ref:`compat32_message`.
pt_br: Спочатку додано в 3.4 як :term:`проміжний модуль <provisional package>`. Документи для застарілого класу повідомлень переміщено до :ref:`compat32_message`.
