Repository: python/python-docs-pt-br
Catalog: library/email.iterators.po
Languages: pt_br

source: :mod:`!email.iterators`: Iterators
pt_br: :mod:`!email.iterators`: Iteradores

source: **Source code:** :source:`Lib/email/iterators.py`
pt_br: **Código-fonte:** :source:`Lib/email/iterators.py`

source: Iterating over a message object tree is fairly easy with the :meth:`Message.walk <email.message.Message.walk>` method. The :mod:`email.iterators` module provides some useful higher level iterations over message object trees.
pt_br: A iteração sobre uma árvore de objetos de mensagem é bastante fácil com o método :meth:`Message.walk <email.message.Message.walk>`. O módulo :mod:`email.iterators` fornece algumas iterações úteis de nível mais alto sobre as árvores de objetos de mensagens.

source: This iterates over all the payloads in all the subparts of *msg*, returning the string payloads line-by-line. It skips over all the subpart headers, and it skips over any subpart with a payload that isn't a Python string. This is somewhat equivalent to reading the flat text representation of the message from a file using :meth:`~io.TextIOBase.readline`, skipping over all the intervening headers.
pt_br: Isso itera sobre todas as cargas úteis em todas as subpartes de *msg*, retornando as cargas úteis das strings de linhas por linha. Ele pula todos os cabeçalhos da subparte e pula qualquer subparte com uma carga útil que não seja uma string Python. Isso é um pouco equivalente à leitura da representação de texto simples da mensagem de um arquivo usando :meth:`~io.TextIOBase.readline`, pulando todos os cabeçalhos intermediários.

source: Optional *decode* is passed through to :meth:`Message.get_payload <email.message.Message.get_payload>`.
pt_br: *decode* opcional é passado por meio do :meth:`Message.get_payload <email.message.Message.get_payload>`.

source: This iterates over all the subparts of *msg*, returning only those subparts that match the MIME type specified by *maintype* and *subtype*.
pt_br: Isso itera sobre todas as subpartes de *msg*, retornando apenas as subpartes que correspondem ao tipo MIME especificado por *maintype* e *subtype*.

source: Note that *subtype* is optional; if omitted, then subpart MIME type matching is done only with the main type. *maintype* is optional too; it defaults to :mimetype:`text`.
pt_br: Observe que *subtipo* é opcional; se omitido, a correspondência de tipo MIME da subparte é feita apenas com o tipo principal. *maintype* também é opcional; o padrão é :mimetype:`text`.

source: Thus, by default :func:`typed_subpart_iterator` returns each subpart that has a MIME type of :mimetype:`text/\*`.
pt_br: Assim, por padrão :func:`typed_subpart_iterator` retorna cada subparte que possui um tipo MIME de :mimetype:`text/\*`.

source: The following function has been added as a useful debugging tool. It should *not* be considered part of the supported public interface for the package.
pt_br: A seguinte função foi adicionada como uma ferramenta de depuração útil. *Não* deve ser considerado parte da interface pública suportada para o pacote.

source: Prints an indented representation of the content types of the message object structure. For example:
pt_br: Imprime uma representação recuada dos tipos de conteúdo da estrutura do objeto de mensagem. Por exemplo:

source: >>> msg = email.message_from_file(somefile) >>> _structure(msg) multipart/mixed text/plain text/plain multipart/digest message/rfc822 text/plain message/rfc822 text/plain message/rfc822 text/plain message/rfc822 text/plain message/rfc822 text/plain text/plain
pt_br: >>> msg = email.message_from_file(algum_arquivo) >>> _structure(msg) multipart/mixed text/plain text/plain multipart/digest message/rfc822 text/plain message/rfc822 text/plain message/rfc822 text/plain message/rfc822 text/plain message/rfc822 text/plain text/plain

source: Optional *fp* is a file-like object to print the output to. It must be suitable for Python's :func:`print` function. *level* is used internally. *include_default*, if true, prints the default type as well.
pt_br: O *fp* opcional é um objeto arquivo ou similar para o qual deve-se imprimir a saída. Deve ser adequado para a função Python :func:`print`. *level* usado internamente. *include_default*, se verdadeiro, também imprime o tipo padrão.
