Repository: python/python-docs-pt-br
Catalog: library/email.examples.po
Languages: pt_br

source: :mod:`email`: Examples
pt_br: :mod:`email`: Exemplos

source: Here are a few examples of how to use the :mod:`email` package to read, write, and send simple email messages, as well as more complex MIME messages.
pt_br: Aqui estão alguns exemplos de como usar o pacote :mod:`email` para ler, escrever e enviar mensagens de e-mail simples, bem como mensagens MIME mais complexas.

source: First, let's see how to create and send a simple text message (both the text content and the addresses may contain unicode characters):
pt_br: Primeiro, vamos ver como criar e enviar uma mensagem de texto simples (tanto o conteúdo do texto quanto os endereços podem conter caracteres Unicode):

source: Parsing :rfc:`822` headers can easily be done by the using the classes from the :mod:`~email.parser` module:
pt_br: A análise dos cabeçalhos :rfc:`822` pode ser feita facilmente usando as classes do módulo :mod:`~email.parser`:

source: Here's an example of how to send a MIME message containing a bunch of family pictures that may be residing in a directory:
pt_br: Aqui está um exemplo de como enviar uma mensagem MIME contendo várias fotos de família que podem estar em um diretório:

source: Here's an example of how to send the entire contents of a directory as an email message: [1]_
pt_br: Aqui está um exemplo de como enviar todo o conteúdo de um diretório como uma mensagem de e-mail: [1]_

source: Here's an example of how to unpack a MIME message like the one above, into a directory of files:
pt_br: Aqui está um exemplo de como desempacotar uma mensagem MIME, como a acima, para um diretório de arquivos:

source: Here's an example of how to create an HTML message with an alternative plain text version. To make things a bit more interesting, we include a related image in the html part, and we save a copy of what we are going to send to disk, as well as sending it.
pt_br: Aqui está um exemplo de como criar uma mensagem HTML com uma versão alternativa em texto simples. Para tornar as coisas um pouco mais interessantes, incluímos uma imagem relacionada na parte html e salvamos uma cópia do que vamos enviar para o disco, assim como enviamos.

source: If we were sent the message from the last example, here is one way we could process it:
pt_br: Se nos fosse enviada a mensagem do último exemplo, aqui está uma maneira de processá-la:

source: Up to the prompt, the output from the above is:
pt_br: Até o prompt, a saída do comando acima é:

source: Footnotes
pt_br: Notas de rodapé

source: Thanks to Matthew Dixon Cowles for the original inspiration and examples.
pt_br: Obrigado a Matthew Dixon Cowles pela inspiração original e pelos exemplos.
