Repository: python/python-docs-pt-br
Catalog: library/email.headerregistry.po
Languages: pt_br

source: As a convenience *addr_spec* can be specified instead of *username* and *domain*, in which case *username* and *domain* will be parsed from the *addr_spec*. An *addr_spec* must be a properly RFC quoted string; if it is not ``Address`` will raise an error. Unicode characters are allowed and will be property encoded when serialized. However, per the RFCs, unicode is *not* allowed in the username portion of the address.
pt_br: Для зручності можна вказати *addr_spec* замість *username* і *domain*, у цьому випадку *username* і *domain* будуть аналізуватися з *addr_spec*. *addr_spec* має бути належним чином цитованим рядком RFC; якщо це не ``Address``, викличе помилку. Дозволяються символи Юнікоду, які будуть закодовані властивостями під час серіалізації. Однак, згідно з RFC, Юнікод *не* дозволений у частині імені користувача адреси.

source: The display name portion of the address, if any, with all quoting removed. If the address does not have a display name, this attribute will be an empty string.
pt_br: Частина відображуваної назви адреси, якщо така є, без лапок. Якщо адреса не має відображуваного імені, цей атрибут буде порожнім рядком.

source: The ``username`` portion of the address, with all quoting removed.
pt_br: Частина ``ім’я користувача`` адреси з видаленням лапок.

source: The ``domain`` portion of the address.
pt_br: Частина ``domain`` адреси.

source: The ``username@domain`` portion of the address, correctly quoted for use as a bare address (the second form shown above). This attribute is not mutable.
pt_br: Частина адреси ``username@domain``, правильно взята в лапки для використання як чистої адреси (друга форма, показана вище). Цей атрибут не змінний.

source: The ``str`` value of the object is the address quoted according to :rfc:`5322` rules, but with no Content Transfer Encoding of any non-ASCII characters.
pt_br: Значення ``str`` об'єкта є адресою в цитатах відповідно до правил :rfc:`5322`, але без кодування передачі вмісту будь-яких символів, відмінних від ASCII.

source: To support SMTP (:rfc:`5321`), ``Address`` handles one special case: if ``username`` and ``domain`` are both the empty string (or ``None``), then the string value of the ``Address`` is ``<>``.
pt_br: Щоб підтримувати SMTP (:rfc:`5321`), ``Address`` обробляє один особливий випадок: якщо ``username`` і ``domain`` є порожнім рядком (або ``None``), тоді рядкове значення ``Address`` - ``<>``.

source: The class used to represent an address group. The general form of an address group is::
pt_br: Клас, який використовується для представлення групи адрес. Загальна форма групи адрес:

source: As a convenience for processing lists of addresses that consist of a mixture of groups and single addresses, a ``Group`` may also be used to represent single addresses that are not part of a group by setting *display_name* to ``None`` and providing a list of the single address as *addresses*.
pt_br: Для зручності обробки списків адрес, які складаються з суміші груп і окремих адрес, ``Група`` також може використовуватися для представлення окремих адрес, які не є частиною групи, встановивши *display_name* на ``None`` і надання списку однієї адреси як *адрес*.

source: The ``display_name`` of the group. If it is ``None`` and there is exactly one ``Address`` in ``addresses``, then the ``Group`` represents a single address that is not in a group.
pt_br: ``display_name`` групи. Якщо значення ``None`` і в ``адресах`` є точно одна ``Адреса``, тоді ``Група`` представляє одну адресу, яка не входить до групи.

source: A possibly empty tuple of :class:`.Address` objects representing the addresses in the group.
pt_br: Можливо, порожній кортеж об’єктів :class:`.Address`, що представляє адреси в групі.

source: The ``str`` value of a ``Group`` is formatted according to :rfc:`5322`, but with no Content Transfer Encoding of any non-ASCII characters. If ``display_name`` is none and there is a single ``Address`` in the ``addresses`` list, the ``str`` value will be the same as the ``str`` of that single ``Address``.
pt_br: Значення ``str`` ``Group`` відформатовано відповідно до :rfc:`5322`, але без кодування передачі вмісту будь-яких символів, відмінних від ASCII. Якщо ``display_name`` не має значення, а в списку ``addresses`` є одна ``Address``, значення ``str`` буде таким самим, як ``str`` цього одного ``Address``.

source: Footnotes
pt_br: Notas de rodapé

source: Originally added in 3.3 as a :term:`provisional module <provisional package>`
pt_br: Спочатку додано в 3.3 як :term:`проміжний модуль <provisional package>`
