Repository: python/python-docs-pt-br
Catalog: library/email.encoders.po
Languages: pt_br

source: :mod:`!email.encoders`: Encoders
pt_br: :mod:`!email.encoders`: Codificadores

source: **Source code:** :source:`Lib/email/encoders.py`
pt_br: **Código-fonte:** :source:`Lib/email/encoders.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API the functionality is provided by the *cte* parameter of the :meth:`~email.message.EmailMessage.set_content` method.
pt_br: Este módulo faz parte da API legada de e-mail (``Compat32``). Na nova API, a funcionalidade é fornecida pelo parâmetro *cte* do método :meth:`~email.message.EmailMessage.set_content`.

source: This module is deprecated in Python 3. The functions provided here should not be called explicitly since the :class:`~email.mime.text.MIMEText` class sets the content type and CTE header using the *_subtype* and *_charset* values passed during the instantiation of that class.
pt_br: Este módulo está descontinuado no Python 3. As funções fornecidas aqui não devem ser chamadas explicitamente, pois a classe :class:`~email.mime.text.MIMEText` define o tipo de conteúdo e o cabeçalho CTE usando os valores *_subtype* e *_charset* passados durante a instanciação dessa classe.

source: The remaining text in this section is the original documentation of the module.
pt_br: O texto restante nesta seção é a documentação original do módulo.

source: When creating :class:`~email.message.Message` objects from scratch, you often need to encode the payloads for transport through compliant mail servers. This is especially true for :mimetype:`image/\*` and :mimetype:`text/\*` type messages containing binary data.
pt_br: Ao criar objetos :class:`~email.message.Message` do zero, você frequentemente precisa codificar as cargas úteis para transporte por meio de servidores de e-mail compatíveis. Isso é especialmente verdadeiro para mensagens do tipo :mimetype:`image/\*` e :mimetype:`text/\*` contendo dados binários.

source: The :mod:`email` package provides some convenient encoders in its :mod:`~email.encoders` module. These encoders are actually used by the :class:`~email.mime.audio.MIMEAudio` and :class:`~email.mime.image.MIMEImage` class constructors to provide default encodings. All encoder functions take exactly one argument, the message object to encode. They usually extract the payload, encode it, and reset the payload to this newly encoded value. They should also set the :mailheader:`Content-Transfer-Encoding` header as appropriate.
pt_br: O pacote :mod:`email` fornece alguns codificadores convenientes em seu módulo :mod:`~email.encoders`. Esses codificadores são realmente usados pelos construtores de classe :class:`~email.mime.audio.MIMEAudio` e :class:`~email.mime.image.MIMEImage` para fornecer codificações padrão. Todas as funções de codificador recebem exatamente um argumento, o objeto de mensagem a ser codificado. Eles geralmente extraem a carga útil, codificam-na e redefinem a carga útil para esse valor recém-codificado. Eles também devem definir o cabeçalho :mailheader:`Content-Transfer-Encoding` conforme apropriado.

source: Note that these functions are not meaningful for a multipart message. They must be applied to individual subparts instead, and will raise a :exc:`TypeError` if passed a message whose type is multipart.
pt_br: Observe que essas funções não são significativas para uma mensagem multiparte. Elas devem ser aplicadas a subpartes individuais, e levantarão um :exc:`TypeError` se for passada uma mensagem cujo tipo seja multiparte.

source: Here are the encoding functions provided:
pt_br: Aqui estão as funções de codificação fornecidas:

source: Encodes the payload into quoted-printable form and sets the :mailheader:`Content-Transfer-Encoding` header to ``quoted-printable`` [#]_. This is a good encoding to use when most of your payload is normal printable data, but contains a few unprintable characters.
pt_br: Codifica a carga útil em formato quoted-printable e define o cabeçalho :mailheader:`Content-Transfer-Encoding` como ``quoted-printable`` [#]_. Esta é uma boa codificação para usar quando a maior parte da sua carga útil é de dados imprimíveis normais, mas contém alguns caracteres não imprimíveis.

source: Encodes the payload into base64 form and sets the :mailheader:`Content-Transfer-Encoding` header to ``base64``. This is a good encoding to use when most of your payload is unprintable data since it is a more compact form than quoted-printable. The drawback of base64 encoding is that it renders the text non-human readable.
pt_br: Codifica a carga útil em formato base64 e define o cabeçalho :mailheader:`Content-Transfer-Encoding` para ``base64``. Esta é uma boa codificação para usar quando a maior parte da sua carga útil é de dados não imprimíveis, pois é um formato mais compacto do que quoted-printable. A desvantagem da codificação base64 é que ela torna o texto não legível por humanos.

source: This doesn't actually modify the message's payload, but it does set the :mailheader:`Content-Transfer-Encoding` header to either ``7bit`` or ``8bit`` as appropriate, based on the payload data.
pt_br: Na verdade, isso não modifica a carga útil da mensagem, mas define o cabeçalho :mailheader:`Content-Transfer-Encoding` para ``7bit`` ou ``8bit``, conforme apropriado, com base nos dados da carga útil.

source: This does nothing; it doesn't even set the :mailheader:`Content-Transfer-Encoding` header.
pt_br: Isso não faz nada; nem mesmo define o cabeçalho :mailheader:`Content-Transfer-Encoding`.

source: Footnotes
pt_br: Notas de rodapé

source: Note that encoding with :meth:`encode_quopri` also encodes all tabs and space characters in the data.
pt_br: Observe que a codificação com :meth:`encode_quopri` também codifica todos os caracteres de tabulação e espaço nos dados.
