Repository: python/python-docs-pt-br
Catalog: library/email.utils.po
Languages: pt_br

source: :mod:`!email.utils`: Miscellaneous utilities
pt_br: :mod:`!email.utils`: Utilitários diversos

source: **Source code:** :source:`Lib/email/utils.py`
pt_br: **Código-fonte:** :source:`Lib/email/utils.py`

source: There are a couple of useful utilities provided in the :mod:`email.utils` module:
pt_br: Existem alguns utilitários úteis fornecidos no :mod:`email.utils` module:

source: Return local time as an aware datetime object. If called without arguments, return current time. Otherwise *dt* argument should be a :class:`~datetime.datetime` instance, and it is converted to the local time zone according to the system time zone database. If *dt* is naive (that is, ``dt.tzinfo`` is ``None``), it is assumed to be in local time.
pt_br: Retorna a hora local como um objeto datetime consciente. Se chamado sem argumentos, retorna a hora atual. Caso contrário, o argumento *dt* deve ser uma instância :class:`~datetime.datetime` e é convertido para o fuso horário local de acordo com o banco de dados de fuso horário do sistema. Se *dt* for ingênuo (ou seja, ``dt.tzinfo`` for ``None``), será presumido como estando no horário local.

source: The *isdst* parameter.
pt_br: O parâmetro *isdst*.

source: Returns a string suitable for an :rfc:`2822`\ -compliant :mailheader:`Message-ID` header. Optional *idstring* if given, is a string used to strengthen the uniqueness of the message id. Optional *domain* if given provides the portion of the msgid after the '@'. The default is the local hostname. It is not normally necessary to override this default, but may be useful certain cases, such as a constructing distributed system that uses a consistent domain name across multiple hosts.
pt_br: Retorna uma string adequada para um cabeçalho :mailheader:`Message-ID` compatível com :rfc:`2822`. O *idstring* opcional, se fornecido, é uma string usada para fortalecer a exclusividade do ID da mensagem. O *domain* Opcional, se dado, fornece a porção do msgid após o '@'. O padrão é o nome do host local. Normalmente, não é necessário substituir esse padrão, mas pode ser útil em alguns casos, como um sistema distribuído de construção que usa um nome de domínio consistente em vários hosts.

source: Added the *domain* keyword.
pt_br: Adicionada a palavra-chave *domain*.

source: The remaining functions are part of the legacy (``Compat32``) email API. There is no need to directly use these with the new API, since the parsing and formatting they provide is done automatically by the header parsing machinery of the new API.
pt_br: As funções restantes fazem parte da API de e-mail herdada (``Compat32``). Não há necessidade de usá-las diretamente com a nova API, pois a análise e a formatação fornecidas são feitas automaticamente pelo mecanismo de análise de cabeçalhos da nova API.

source: Return a new string with backslashes in *str* replaced by two backslashes, and double quotes replaced by backslash-double quote.
pt_br: Devolve uma nova string com barras invertidas em *str* substituídas por duas barras invertidas e aspas duplas substituídas por aspas duplas invertidas.

source: Return a new string which is an *unquoted* version of *str*. If *str* ends and begins with double quotes, they are stripped off. Likewise if *str* ends and begins with angle brackets, they are stripped off.
pt_br: Retorna uma nova string que é uma versão sem aspas de *str*. Se *str* terminar e começar com aspas duplas, elas serão removidas. Da mesma forma, se *str* termina e começa com colchetes angulares, eles são removidos.

source: Parse address -- which should be the value of some address-containing field such as :mailheader:`To` or :mailheader:`Cc` -- into its constituent *realname* and *email address* parts. Returns a tuple of that information, unless the parse fails, in which case a 2-tuple of ``('', '')`` is returned.
pt_br: Analisa o endereço -- que deve ser o valor de algum campo contendo endereço, como :mailheader:`To` ou :mailheader:`Cc` -- em suas partes constituinte *realname* e *email address*. Retorna uma tupla daquela informação, a menos que a análise falhe, caso em que uma tupla de 2 de ``('', '')`` é retornada.

source: If *strict* is true, use a strict parser which rejects malformed inputs.
pt_br: Se *strict* for verdadeiro, usa um analisador sintático estrito que rejeite entradas malformadas.

source: Add *strict* optional parameter and reject malformed inputs by default.
pt_br: Adiciona o parâmetro opcional *strict* e rejeita entradas malformadas por padrão.

source: The inverse of :meth:`parseaddr`, this takes a 2-tuple of the form ``(realname, email_address)`` and returns the string value suitable for a :mailheader:`To` or :mailheader:`Cc` header. If the first element of *pair* is false, then the second element is returned unmodified.
pt_br: O inverso de :meth:`parseaddr`, isto leva uma tupla de 2 do forma ``(realname, email_address)`` e retorna o valor de string adequado para um cabeçalho :mailheader:`To` ou :mailheader:`Cc` . Se o primeiro elemento de *pair* for falso, o segundo elemento será retornado sem modificações.

source: Optional *charset* is the character set that will be used in the :rfc:`2047` encoding of the ``realname`` if the ``realname`` contains non-ASCII characters. Can be an instance of :class:`str` or a :class:`~email.charset.Charset`. Defaults to ``utf-8``.
pt_br: O *charset* opcional é o conjunto de caracteres que será usado na codificação :rfc:`2047` do ``realname`` se o ``realname`` contiver caracteres não-ASCII. Pode ser uma instância de :class:`str` ou a :class:`~email.charset.Charset`. O padrão é ``utf-8``.

source: Added the *charset* option.
pt_br: Adicionada a opção *charset*.

source: This method returns a list of 2-tuples of the form returned by ``parseaddr()``. *fieldvalues* is a sequence of header field values as might be returned by :meth:`Message.get_all <email.message.Message.get_all>`.
pt_br: Este método retorna uma lista de tuplas 2 do formulário retornado por ``parseaddr()``. *fieldvalues* é uma sequência de valores do campo de cabeçalho que pode ser retornada por :meth:`Message.get_all <email.message.Message.get_all>`.

source: Here's a simple example that gets all the recipients of a message::
pt_br: Aqui está um exemplo simples que recebe todos os destinatários de uma mensagem::

source: Attempts to parse a date according to the rules in :rfc:`2822`. however, some mailers don't follow that format as specified, so :func:`parsedate` tries to guess correctly in such cases. *date* is a string containing an :rfc:`2822` date, such as ``"Mon, 20 Nov 1995 19:12:08 -0500"``. If it succeeds in parsing the date, :func:`parsedate` returns a 9-tuple that can be passed directly to :func:`time.mktime`; otherwise ``None`` will be returned. Note that indexes 6, 7, and 8 of the result tuple are not usable.
pt_br: Tenta analisar uma data de acordo com as regras em :rfc:`2822`. no entanto, alguns mailers não seguem esse formato conforme especificado, portanto :func:`parsedate` tenta adivinhar corretamente em tais casos. *date* é uma string contendo uma data :rfc:`2822`, como ``"Mon, 20 Nov 1995 19:12:08 -0500"``. Se conseguir analisar a data, :func:`parsedate` retorna uma 9-tupla que pode ser passada diretamente para :func:`time.mktime`; caso contrário, ``None`` será retornado. Observe que os índices 6, 7 e 8 da tupla de resultados não são utilizáveis.

source: Performs the same function as :func:`parsedate`, but returns either ``None`` or a 10-tuple; the first 9 elements make up a tuple that can be passed directly to :func:`time.mktime`, and the tenth is the offset of the date's timezone from UTC (which is the official term for Greenwich Mean Time) [#]_. If the input string has no timezone, the last element of the tuple returned is ``0``, which represents UTC. Note that indexes 6, 7, and 8 of the result tuple are not usable.
pt_br: Executa a mesma função que :func:`parsedate`, mas retorna ``None`` ou uma tupla de 10; os primeiros 9 elementos formam uma tupla que pode ser passada diretamente para :func:`time.mktime`, e o décimo é o deslocamento do fuso horário da data do UTC (que é o termo oficial para o horário de Greenwich) [#]_. Se a string de entrada não tem fuso horário, o último elemento da tupla retornado é ``0``, que representa UTC. Observe que os índices 6, 7 e 8 da tupla de resultado não podem ser usados.

source: The inverse of :func:`format_datetime`. Performs the same function as :func:`parsedate`, but on success returns a :mod:`~datetime.datetime`; otherwise ``ValueError`` is raised if *date* contains an invalid value such as an hour greater than 23 or a timezone offset not between -24 and 24 hours. If the input date has a timezone of ``-0000``, the ``datetime`` will be a naive ``datetime``, and if the date is conforming to the RFCs it will represent a time in UTC but with no indication of the actual source timezone of the message the date comes from. If the input date has any other valid timezone offset, the ``datetime`` will be an aware ``datetime`` with the corresponding a :class:`~datetime.timezone` :class:`~datetime.tzinfo`.
pt_br: O inverso de :func:`format_datetime`. Desempenha a mesma função que :func:`parsedate`, mas em caso de sucesso retorna um :mod:`~datetime.datetime`; caso contrário, ``ValueError`` é levantada se *date* contiver um valor inválido, como uma hora maior que 23 ou uma diferença de fuso horário não entre -24 e 24 horas. Se a data de entrada tem um fuso horário de ``-0000``, o ``datetime`` será um ``datetime`` ingênuo, e se a data estiver em conformidade com os RFCs representará um horário em UTC, mas sem indicação do fuso horário de origem real da mensagem de onde vem a data. Se a data de entrada tiver qualquer outro deslocamento de fuso horário válido, o ``datetime`` será um ``datetime`` consciente com o correspondente a :class:`~datetime.timezone` :class:`~datetime.tzinfo`.

source: Turn a 10-tuple as returned by :func:`parsedate_tz` into a UTC timestamp (seconds since the Epoch). If the timezone item in the tuple is ``None``, assume local time.
pt_br: Transforma uma tupla de 10 conforme retornado por :func:`parsedate_tz` em um timestamp UTC (segundos desde a Era Unix). Se o item de fuso horário na tupla for ``None``, considera a hora local.

source: Returns a date string as per :rfc:`2822`, e.g.::
pt_br: Retorna uma string de data conforme :rfc:`2822`. Por exemplo::

source: Optional *timeval* if given is a floating-point time value as accepted by :func:`time.gmtime` and :func:`time.localtime`, otherwise the current time is used.
pt_br: O *timeval* opcional, se fornecido, é um valor de tempo de ponto flutuante, conforme aceito por :func:`time.gmtime` e :func:`time.localtime`, caso contrário, o tempo atual é usado.

source: Optional *localtime* is a flag that when ``True``, interprets *timeval*, and returns a date relative to the local timezone instead of UTC, properly taking daylight savings time into account. The default is ``False`` meaning UTC is used.
pt_br: Há um sinalizador opcional *localtime*, que, quando é ``True``, interpreta *timeval* e retorna uma data relativa ao fuso horário local em vez do UTC, levando em consideração o horário de verão. O padrão é ``False``, o que significa que o UTC é usado.

source: Optional *usegmt* is a flag that when ``True``, outputs a date string with the timezone as an ascii string ``GMT``, rather than a numeric ``-0000``. This is needed for some protocols (such as HTTP). This only applies when *localtime* is ``False``. The default is ``False``.
pt_br: O *usegmt* opcional é um sinalizador que quando ``True``, produz uma string de data com o fuso horário como uma string ascii ``GMT``, ao invés de um numérico ``-0000``. Isso é necessário para alguns protocolos (como HTTP). Isso se aplica apenas quando *localtime* for ``False``. O padrão é ``False``.

source: Like ``formatdate``, but the input is a :mod:`datetime` instance. If it is a naive datetime, it is assumed to be "UTC with no information about the source timezone", and the conventional ``-0000`` is used for the timezone. If it is an aware ``datetime``, then the numeric timezone offset is used. If it is an aware timezone with offset zero, then *usegmt* may be set to ``True``, in which case the string ``GMT`` is used instead of the numeric timezone offset. This provides a way to generate standards conformant HTTP date headers.
pt_br: Como ``formatdate``, mas a entrada é uma instância de :mod:`datetime`. Se for uma data e hora ingênua, será considerado "UTC sem informações sobre o fuso horário de origem" e o convencional ``-0000`` será usado para o fuso horário. Se for um ``datetime`` ciente, então o deslocamento de fuso horário numérico é usado. Se for um fuso horário ciente com deslocamento zero, então *usegmt* pode ser definido como ``True``, caso em que a string ``GMT`` é usada em vez do deslocamento numérico do fuso horário. Isso fornece uma maneira de gerar cabeçalhos de data HTTP em conformidade com os padrões.

source: Decode the string *s* according to :rfc:`2231`.
pt_br: Decodifica a string *s* de acordo com :rfc:`2231`.

source: Encode the string *s* according to :rfc:`2231`. Optional *charset* and *language*, if given is the character set name and language name to use. If neither is given, *s* is returned as-is. If *charset* is given but *language* is not, the string is encoded using the empty string for *language*.
pt_br: Codifica a string *s* de acordo com :rfc:`2231`. *charset* e *language* opcionais, se fornecido, são o nome do conjunto de caracteres e o nome do idioma a ser usado. Se nenhum deles for fornecido, *s* é retornado como está. Se *charset* for fornecido, mas *language* não, a string será codificada usando a string vazia para *language*.

source: When a header parameter is encoded in :rfc:`2231` format, :meth:`Message.get_param <email.message.Message.get_param>` may return a 3-tuple containing the character set, language, and value. :func:`collapse_rfc2231_value` turns this into a unicode string. Optional *errors* is passed to the *errors* argument of :class:`str`'s :func:`~str.encode` method; it defaults to ``'replace'``. Optional *fallback_charset* specifies the character set to use if the one in the :rfc:`2231` header is not known by Python; it defaults to ``'us-ascii'``.
pt_br: Quando um parâmetro de cabeçalho é codificado no formato :rfc:`2231`, :meth:`Message.get_param <email.message.Message.get_param>` pode retornar uma tupla de 3 contendo o conjunto de caracteres, idioma e valor. :func:`collapse_rfc2231_value` transforma isso em uma string Unicode. *errors* opcionais são passados para o argumento *errors* do método :func:`~str.encode` de :class:`str`; o padrão é ``'replace'``. *fallback_charset* opcional especifica o conjunto de caracteres a ser usado se aquele no cabeçalho :rfc:`2231` não for conhecido pelo Python; o padrão é ``'us-ascii'``.

source: For convenience, if the *value* passed to :func:`collapse_rfc2231_value` is not a tuple, it should be a string and it is returned unquoted.
pt_br: Por conveniência, se *value* passado para :func:`collapse_rfc2231_value` não for uma tupla, deve ser uma string e é retornado sem aspas.

source: Decode parameters list according to :rfc:`2231`. *params* is a sequence of 2-tuples containing elements of the form ``(content-type, string-value)``.
pt_br: Decodifica a lista de parâmetros de acordo com :rfc:`2231`. *params* é uma sequência de 2 tuplas contendo elementos do formulário ``(content-type, string-value)``.

source: Footnotes
pt_br: Notas de rodapé

source: Note that the sign of the timezone offset is the opposite of the sign of the ``time.timezone`` variable for the same timezone; the latter variable follows the POSIX standard while this module follows :rfc:`2822`.
pt_br: Observa que o sinal do deslocamento de fuso horário é o oposto do sinal da variável ``time.timezone`` para o mesmo fuso horário; a última variável segue o padrão POSIX enquanto este módulo segue :rfc:`2822`.
