Repository: python/python-docs-pt-br
Catalog: library/email.headerregistry.po
Languages: pt_br

source: :mod:`email.headerregistry`: Custom Header Objects
pt_br: :mod:`email.headerregistry`: Objetos de cabeçalho personalizados

source: **Source code:** :source:`Lib/email/headerregistry.py`
pt_br: **Código-fonte:** :source:`Lib/email/headerregistry.py`

source: Headers are represented by customized subclasses of :class:`str`. The particular class used to represent a given header is determined by the :attr:`~email.policy.EmailPolicy.header_factory` of the :mod:`~email.policy` in effect when the headers are created. This section documents the particular ``header_factory`` implemented by the email package for handling :RFC:`5322` compliant email messages, which not only provides customized header objects for various header types, but also provides an extension mechanism for applications to add their own custom header types.
pt_br: Заголовки представлені налаштованими підкласами :class:`str`. Конкретний клас, який використовується для представлення даного заголовка, визначається :attr:`~email.policy.EmailPolicy.header_factory` :mod:`~email.policy`, що діє під час створення заголовків. У цьому розділі описано конкретну ``header_factory``, реалізовану пакетом електронної пошти для обробки :RFC:`5322` сумісних повідомлень електронної пошти, яка не тільки надає налаштовані об’єкти заголовків для різних типів заголовків, але також забезпечує механізм розширення для додатків для додавання своїх власні типи заголовків.

source: When using any of the policy objects derived from :data:`~email.policy.EmailPolicy`, all headers are produced by :class:`.HeaderRegistry` and have :class:`.BaseHeader` as their last base class. Each header class has an additional base class that is determined by the type of the header. For example, many headers have the class :class:`.UnstructuredHeader` as their other base class. The specialized second class for a header is determined by the name of the header, using a lookup table stored in the :class:`.HeaderRegistry`. All of this is managed transparently for the typical application program, but interfaces are provided for modifying the default behavior for use by more complex applications.
pt_br: При використанні будь-якого з об’єктів політики, отриманих від :data:`~email.policy.EmailPolicy`, усі заголовки створюються :class:`.HeaderRegistry` і мають :class:`.BaseHeader` як останній базовий клас. Кожен клас заголовка має додатковий базовий клас, який визначається типом заголовка. Наприклад, багато заголовків мають клас :class:`.UnstructuredHeader` як інший базовий клас. Спеціалізований другий клас для заголовка визначається назвою заголовка за допомогою таблиці пошуку, що зберігається в :class:`.HeaderRegistry`. Усім цим керується прозоро для типової прикладної програми, але надаються інтерфейси для зміни типової поведінки для використання більш складними програмами.

source: The sections below first document the header base classes and their attributes, followed by the API for modifying the behavior of :class:`.HeaderRegistry`, and finally the support classes used to represent the data parsed from structured headers.
pt_br: У розділах нижче спочатку описані базові класи заголовків та їх атрибути, потім API для зміни поведінки :class:`.HeaderRegistry` і, нарешті, класи підтримки, які використовуються для представлення даних, проаналізованих із структурованих заголовків.

source: *name* and *value* are passed to ``BaseHeader`` from the :attr:`~email.policy.EmailPolicy.header_factory` call. The string value of any header object is the *value* fully decoded to unicode.
pt_br: *name* і *value* передаються в ``BaseHeader`` з виклику :attr:`~email.policy.EmailPolicy.header_factory`. Рядкове значення будь-якого об’єкта заголовка є *значенням*, повністю декодованим у Юнікод.

source: This base class defines the following read-only properties:
pt_br: Цей базовий клас визначає наступні властивості лише для читання:

source: The name of the header (the portion of the field before the ':'). This is exactly the value passed in the :attr:`~email.policy.EmailPolicy.header_factory` call for *name*; that is, case is preserved.
pt_br: Назва заголовка (частина поля перед ":"). Це саме значення, передане у виклику :attr:`~email.policy.EmailPolicy.header_factory` для *name*; тобто регістр зберігається.

source: A tuple of :exc:`~email.errors.HeaderDefect` instances reporting any RFC compliance problems found during parsing. The email package tries to be complete about detecting compliance issues. See the :mod:`~email.errors` module for a discussion of the types of defects that may be reported.
pt_br: Кортеж екземплярів :exc:`~email.errors.HeaderDefect`, які повідомляють про будь-які проблеми відповідності RFC, виявлені під час аналізу. Пакет електронної пошти намагається бути повним щодо виявлення проблем відповідності. Перегляньте модуль :mod:`~email.errors` для обговорення типів дефектів, про які можна повідомити.

source: The maximum number of headers of this type that can have the same ``name``. A value of ``None`` means unlimited. The ``BaseHeader`` value for this attribute is ``None``; it is expected that specialized header classes will override this value as needed.
pt_br: Максимальна кількість заголовків цього типу, які можуть мати однакову назву. Значення ``None`` означає необмежений. Значення ``BaseHeader`` для цього атрибута є ``None``; очікується, що спеціалізовані класи заголовків замінять це значення за потреби.

source: ``BaseHeader`` also provides the following method, which is called by the email library code and should not in general be called by application programs:
pt_br: ``BaseHeader`` також надає наступний метод, який викликається кодом бібліотеки електронної пошти і, як правило, не повинен викликатися прикладними програмами:

source: Return a string containing :attr:`~email.policy.Policy.linesep` characters as required to correctly fold the header according to *policy*. A :attr:`~email.policy.Policy.cte_type` of ``8bit`` will be treated as if it were ``7bit``, since headers may not contain arbitrary binary data. If :attr:`~email.policy.EmailPolicy.utf8` is ``False``, non-ASCII data will be :rfc:`2047` encoded.
pt_br: Повертає рядок, що містить символи :attr:`~email.policy.Policy.linesep`, необхідні для правильного згортання заголовка відповідно до *policy*. :attr:`~email.policy.Policy.cte_type` ``8bit`` буде розглядатися як ``7bit``, оскільки заголовки не можуть містити довільних двійкових даних. Якщо :attr:`~email.policy.EmailPolicy.utf8` має значення ``False``, дані, відмінні від ASCII, будуть закодовані :rfc:`2047`.

source: ``BaseHeader`` by itself cannot be used to create a header object. It defines a protocol that each specialized header cooperates with in order to produce the header object. Specifically, ``BaseHeader`` requires that the specialized class provide a :func:`classmethod` named ``parse``. This method is called as follows::
pt_br: ``BaseHeader`` сам по собі не може використовуватися для створення об’єкта заголовка. Він визначає протокол, з яким співпрацює кожен спеціалізований заголовок, щоб створити об’єкт заголовка. Зокрема, ``BaseHeader`` вимагає, щоб спеціалізований клас надавав :func:`classmethod` під назвою ``parse``. Цей метод називається наступним чином:

source: ``kwds`` is a dictionary containing one pre-initialized key, ``defects``. ``defects`` is an empty list. The parse method should append any detected defects to this list. On return, the ``kwds`` dictionary *must* contain values for at least the keys ``decoded`` and ``defects``. ``decoded`` should be the string value for the header (that is, the header value fully decoded to unicode). The parse method should assume that *string* may contain content-transfer-encoded parts, but should correctly handle all valid unicode characters as well so that it can parse un-encoded header values.
pt_br: ``kwds`` — це словник, що містить один попередньо ініціалізований ключ, ``defects``. ``дефекти`` – порожній список. Метод аналізу має додати всі виявлені дефекти до цього списку. Після повернення словник ``kwds`` *має* містити значення принаймні для ключів ``decoded`` і ``defects``. ``decoded`` має бути значенням рядка для заголовка (тобто, значення заголовка, повністю декодоване в Юнікод). Метод синтаксичного аналізу має припускати, що *рядок* може містити частини, закодовані перенесенням вмісту, але також має правильно обробляти всі дійсні символи Unicode, щоб він міг аналізувати незакодовані значення заголовка.

source: ``BaseHeader``'s ``__new__`` then creates the header instance, and calls its ``init`` method. The specialized class only needs to provide an ``init`` method if it wishes to set additional attributes beyond those provided by ``BaseHeader`` itself. Such an ``init`` method should look like this::
pt_br: Потім ``__new__`` ``BaseHeader`` створює екземпляр заголовка та викликає його метод ``init``. Спеціалізованому класу потрібно лише надати метод ``init``, якщо він бажає встановити додаткові атрибути крім тих, що надаються самим ``BaseHeader``. Такий метод ``init`` має виглядати так:

source: That is, anything extra that the specialized class puts in to the ``kwds`` dictionary should be removed and handled, and the remaining contents of ``kw`` (and ``args``) passed to the ``BaseHeader`` ``init`` method.
pt_br: Тобто все зайве, що спеціалізований клас поміщає до словника ``kwds``, має бути видалено та оброблено, а решта вмісту ``kw`` (та ``args``) передано до ``BaseHeader`` Метод ``init``.

source: An "unstructured" header is the default type of header in :rfc:`5322`. Any header that does not have a specified syntax is treated as unstructured. The classic example of an unstructured header is the :mailheader:`Subject` header.
pt_br: "Неструктурований" заголовок є типовим типом заголовка в :rfc:`5322`. Будь-який заголовок, який не має визначеного синтаксису, вважається неструктурованим. Класичним прикладом неструктурованого заголовка є заголовок :mailheader:`Subject`.

source: In :rfc:`5322`, an unstructured header is a run of arbitrary text in the ASCII character set. :rfc:`2047`, however, has an :rfc:`5322` compatible mechanism for encoding non-ASCII text as ASCII characters within a header value. When a *value* containing encoded words is passed to the constructor, the ``UnstructuredHeader`` parser converts such encoded words into unicode, following the :rfc:`2047` rules for unstructured text. The parser uses heuristics to attempt to decode certain non-compliant encoded words. Defects are registered in such cases, as well as defects for issues such as invalid characters within the encoded words or the non-encoded text.
pt_br: У :rfc:`5322` неструктурований заголовок — це довільний текст у наборі символів ASCII. :rfc:`2047`, однак, має :rfc:`5322` сумісний механізм для кодування не-ASCII тексту як символів ASCII у значенні заголовка. Коли *значення*, що містить закодовані слова, передається конструктору, аналізатор ``UnstructuredHeader`` перетворює такі закодовані слова в юнікод, дотримуючись правил :rfc:`2047` для неструктурованого тексту. Синтаксичний аналізатор використовує евристику, щоб спробувати декодувати певні невідповідні закодовані слова. У таких випадках реєструються дефекти, а також такі дефекти, як недійсні символи в закодованих словах або незакодований текст.

source: This header type provides no additional attributes.
pt_br: Цей тип заголовка не містить додаткових атрибутів.

source: :rfc:`5322` specifies a very specific format for dates within email headers. The ``DateHeader`` parser recognizes that date format, as well as recognizing a number of variant forms that are sometimes found "in the wild".
pt_br: :rfc:`5322` визначає дуже специфічний формат для дат у заголовках електронних листів. Синтаксичний аналізатор ``DateHeader`` розпізнає цей формат дати, а також розпізнає низку варіантних форм, які іноді зустрічаються "в дикій природі".

source: This header type provides the following additional attributes:
pt_br: Цей тип заголовка надає такі додаткові атрибути:

source: The ``decoded`` value of the header is determined by formatting the ``datetime`` according to the :rfc:`5322` rules; that is, it is set to::
pt_br: Значення ``decoded`` заголовка визначається форматуванням ``datetime`` відповідно до правил :rfc:`5322`; тобто встановлено::

source: When creating a ``DateHeader``, *value* may be :class:`~datetime.datetime` instance. This means, for example, that the following code is valid and does what one would expect::
pt_br: Під час створення ``DateHeader`` *значення* може бути екземпляром :class:`~datetime.datetime`. Це означає, наприклад, що наступний код дійсний і виконує те, що можна очікувати:

source: Because this is a naive ``datetime`` it will be interpreted as a UTC timestamp, and the resulting value will have a timezone of ``-0000``. Much more useful is to use the :func:`~email.utils.localtime` function from the :mod:`~email.utils` module::
pt_br: Оскільки це проста ``datetime``, вона буде інтерпретована як мітка часу UTC, а результуюче значення матиме часовий пояс ``-0000``. Набагато кориснішим є використання функції :func:`~email.utils.localtime` з модуля :mod:`~email.utils`::

source: This example sets the date header to the current time and date using the current timezone offset.
pt_br: У цьому прикладі в заголовку дати встановлюється поточний час і дата з використанням поточного зміщення часового поясу.

source: Address headers are one of the most complex structured header types. The ``AddressHeader`` class provides a generic interface to any address header.
pt_br: Заголовки адрес є одним із найскладніших структурованих типів заголовків. Клас ``AddressHeader`` забезпечує загальний інтерфейс для будь-якого заголовка адреси.

source: A tuple of :class:`.Group` objects encoding the addresses and groups found in the header value. Addresses that are not part of a group are represented in this list as single-address ``Groups`` whose :attr:`~.Group.display_name` is ``None``.
pt_br: Кортеж об’єктів :class:`.Group`, що кодує адреси та групи, знайдені у значенні заголовка. Адреси, які не є частиною групи, представлені в цьому списку як одноадресні ``Групи``, у яких :attr:`~.Group.display_name` має значення ``None``.

source: A tuple of :class:`.Address` objects encoding all of the individual addresses from the header value. If the header value contains any groups, the individual addresses from the group are included in the list at the point where the group occurs in the value (that is, the list of addresses is "flattened" into a one dimensional list).
pt_br: Кортеж об’єктів :class:`.Address`, що кодує всі окремі адреси зі значення заголовка. Якщо значення заголовка містить будь-які групи, окремі адреси з групи включаються до списку в тому місці, де група зустрічається у значенні (тобто список адрес "зрівнюється" в одновимірний список).

source: A list of :class:`.Address` and :class:`.Group` objects in any combination may be used to set the value of an address header. ``Group`` objects whose ``display_name`` is ``None`` will be interpreted as single addresses, which allows an address list to be copied with groups intact by using the list obtained from the ``groups`` attribute of the source header.
pt_br: Для встановлення значення заголовка адреси можна використовувати список об’єктів :class:`.Address` і :class:`.Group` у будь-якій комбінації. Об’єкти ``Групи``, у яких ``display_name`` є ``None``, інтерпретуватимуться як окремі адреси, що дозволяє скопіювати список адрес із недоторканими групами за допомогою списку, отриманого з атрибута ``groups`` вихідний заголовок.

source: A subclass of :class:`.AddressHeader` that adds one additional attribute:
pt_br: Uma subclasse de :class:`.AddressHeader` que adiciona um atributo adicional:

source: The single address encoded by the header value. If the header value actually contains more than one address (which would be a violation of the RFC under the default :mod:`~email.policy`), accessing this attribute will result in a :exc:`ValueError`.
pt_br: Єдина адреса, закодована значенням заголовка. Якщо значення заголовка насправді містить більше однієї адреси (що було б порушенням RFC за умовчанням :mod:`~email.policy`), доступ до цього атрибута призведе до :exc:`ValueError`.

source: Many of the above classes also have a ``Unique`` variant (for example, ``UniqueUnstructuredHeader``). The only difference is that in the ``Unique`` variant, :attr:`~.BaseHeader.max_count` is set to 1.
pt_br: Багато з наведених вище класів також мають варіант ``Unique`` (наприклад, ``UniqueUnstructuredHeader``). Єдина відмінність полягає в тому, що у варіанті ``Unique`` :attr:`~.BaseHeader.max_count` має значення 1.

source: There is really only one valid value for the :mailheader:`MIME-Version` header, and that is ``1.0``. For future proofing, this header class supports other valid version numbers. If a version number has a valid value per :rfc:`2045`, then the header object will have non-``None`` values for the following attributes:
pt_br: Насправді існує лише одне дійсне значення для заголовка :mailheader:`MIME-Version`, і це ``1.0``. Для майбутньої перевірки цей клас заголовка підтримує інші дійсні номери версій. Якщо номер версії має дійсне значення для :rfc:`2045`, тоді об’єкт заголовка матиме значення, відмінні від ``None`` для таких атрибутів:

source: The version number as a string, with any whitespace and/or comments removed.
pt_br: Номер версії у вигляді рядка з видаленими пробілами та/або коментарями.

source: The major version number as an integer
pt_br: Основний номер версії як ціле число

source: The minor version number as an integer
pt_br: Номер другорядної версії як ціле число

source: MIME headers all start with the prefix 'Content-'. Each specific header has a certain value, described under the class for that header. Some can also take a list of supplemental parameters, which have a common format. This class serves as a base for all the MIME headers that take parameters.
pt_br: Усі заголовки MIME починаються з префікса "Content-". Кожен конкретний заголовок має певне значення, описане в класі для цього заголовка. Деякі також можуть приймати список додаткових параметрів, які мають загальний формат. Цей клас служить основою для всіх заголовків MIME, які приймають параметри.

source: A dictionary mapping parameter names to parameter values.
pt_br: Словник, що зіставляє назви параметрів зі значеннями параметрів.

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Type` header.
pt_br: Клас :class:`ParameterizedMIMEHeader`, який обробляє заголовок :mailheader:`Content-Type`.

source: The content type string, in the form ``maintype/subtype``.
pt_br: Рядок типу вмісту у формі ``maintype/subtype``.

source: A :class:`ParameterizedMIMEHeader` class that handles the :mailheader:`Content-Disposition` header.
pt_br: Uma classe :class:`ParameterizedMIMEHeader` que lida com o cabeçalho :mailheader:`Content-Disposition`.

source: ``inline`` and ``attachment`` are the only valid values in common use.
pt_br: ``inline`` і ``attachment`` є єдиними допустимими значеннями, які широко використовуються.

source: Handles the :mailheader:`Content-Transfer-Encoding` header.
pt_br: Обробляє заголовок :mailheader:`Content-Transfer-Encoding`.

source: Valid values are ``7bit``, ``8bit``, ``base64``, and ``quoted-printable``. See :rfc:`2045` for more information.
pt_br: Дійсні значення: ``7bit``, ``8bit``, ``base64`` і ``quoted-printable``. Перегляньте :rfc:`2045` для отримання додаткової інформації.

source: This is the factory used by :class:`~email.policy.EmailPolicy` by default. ``HeaderRegistry`` builds the class used to create a header instance dynamically, using *base_class* and a specialized class retrieved from a registry that it holds. When a given header name does not appear in the registry, the class specified by *default_class* is used as the specialized class. When *use_default_map* is ``True`` (the default), the standard mapping of header names to classes is copied in to the registry during initialization. *base_class* is always the last class in the generated class's ``__bases__`` list.
pt_br: Це фабрика, яку використовує :class:`~email.policy.EmailPolicy` за замовчуванням. ``HeaderRegistry`` створює клас, який використовується для динамічного створення екземпляра заголовка, використовуючи *base_class* і спеціалізований клас, отриманий із реєстру, який він містить. Якщо дане ім’я заголовка не відображається в реєстрі, клас, визначений *default_class*, використовується як спеціалізований клас. Якщо *use_default_map* має значення ``True`` (за замовчуванням), стандартне зіставлення імен заголовків із класами копіюється до реєстру під час ініціалізації. *base_class* завжди є останнім класом у списку ``__bases__`` згенерованого класу.

source: The default mappings are:
pt_br: Відображення за замовчуванням:

source: subject
pt_br: тема

source: date
pt_br: дата

source: resent-date
pt_br: дата повторного відправлення

source: orig-date
pt_br: дата виходу

source: sender
pt_br: відправник

source: resent-to
pt_br: обурюватися

source: resent-from
pt_br: обурюватися-від

source: reply-to
pt_br: відповідати на

source: mime-version
pt_br: мім-версія

source: content-type
pt_br: тип вмісту

source: content-transfer-encoding
pt_br: кодування передачі вмісту

source: ``HeaderRegistry`` has the following methods:
pt_br: ``HeaderRegistry`` має такі методи:

source: *name* is the name of the header to be mapped. It will be converted to lower case in the registry. *cls* is the specialized class to be used, along with *base_class*, to create the class used to instantiate headers that match *name*.
pt_br: *ім’я* — це ім’я заголовка, який буде зіставлено. У реєстрі його буде перетворено на нижній регістр. *cls* — це спеціалізований клас, який використовується разом із *base_class* для створення класу, що використовується для створення екземплярів заголовків, які відповідають *name*.

source: Construct and return a class to handle creating a *name* header.
pt_br: Створіть і поверніть клас для створення заголовка *name*.

source: Retrieves the specialized header associated with *name* from the registry (using *default_class* if *name* does not appear in the registry) and composes it with *base_class* to produce a class, calls the constructed class's constructor, passing it the same argument list, and finally returns the class instance created thereby.
pt_br: Отримує спеціальний заголовок, пов’язаний з *name*, із реєстру (використовуючи *default_class*, якщо *name* не відображається в реєстрі) і створює його з *base_class* для створення класу, викликає конструктор створеного класу, передаючи йому те саме список аргументів і, нарешті, повертає екземпляр класу, створений таким чином.

source: The following classes are the classes used to represent data parsed from structured headers and can, in general, be used by an application program to construct structured values to assign to specific headers.
pt_br: Наступні класи є класами, які використовуються для представлення даних, розібраних із структурованих заголовків, і можуть, загалом, використовуватися прикладною програмою для створення структурованих значень для призначення певним заголовкам.

source: The class used to represent an email address. The general form of an address is::
pt_br: Клас, який використовується для представлення електронної адреси. Загальна форма адреси:

source: or::
pt_br: ou::

source: where each part must conform to specific syntax rules spelled out in :rfc:`5322`.
pt_br: де кожна частина має відповідати певним правилам синтаксису, викладеним у :rfc:`5322`.
