Repository: python/python-docs-pt-br
Catalog: library/email.compat32-message.po
Languages: pt_br

source: In a model generated from bytes, any header values that (in contravention of the RFCs) contain non-ASCII bytes will, when retrieved through this interface, be represented as :class:`~email.header.Header` objects with a charset of ``unknown-8bit``.
pt_br: В модели, сгенерированной из байтов, любые значения заголовков, которые (в нарушение RFC) содержат байты, отличные от ASCII, при получении через этот интерфейс будут представлены как объекты :class:`~email.header.Header` с кодировкой ``неизвестный-8бит``.

source: Return the total number of headers, including duplicates.
pt_br: Повертає загальну кількість заголовків, включаючи дублікати.

source: Return ``True`` if the message object has a field named *name*. Matching is done case-insensitively and *name* should not include the trailing colon. Used for the ``in`` operator, e.g.::
pt_br: Повертає ``True``, якщо об’єкт повідомлення має поле з назвою *name*. Зіставлення виконується без урахування регістру, і *ім’я* не повинно містити двокрапку в кінці. Використовується для оператора ``in``, наприклад::

source: Return the value of the named header field. *name* should not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
pt_br: Повертає значення названого поля заголовка. *ім’я* не повинно включати двокрапку-роздільник полів. Якщо заголовок відсутній, повертається ``None``; a :exc:`KeyError` ніколи не виникає.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant named headers.
pt_br: Зауважте, що якщо назване поле з’являється більше одного разу в заголовках повідомлення, яке саме значення полів буде повернуто, не визначено. Використовуйте метод :meth:`get_all`, щоб отримати значення всіх наявних іменованих заголовків.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing fields.
pt_br: Додайте до повідомлення заголовок із назвою поля *name* і значенням *val*. Поле додається в кінці існуючих полів повідомлення.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
pt_br: Зауважте, що це *не* перезаписує та не видаляє будь-який існуючий заголовок із такою ж назвою. Якщо ви хочете переконатися, що новий заголовок є єдиним у повідомленні з назвою поля *name*, спочатку видаліть це поле, наприклад::

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
pt_br: Видалити всі входження поля з назвою *ім’я* із заголовків повідомлення. Жодного винятку не створюється, якщо назване поле відсутнє в заголовках.

source: Return a list of all the message's header field names.
pt_br: Повертає список імен усіх полів заголовка повідомлення.

source: Return a list of all the message's field values.
pt_br: Повертає список усіх значень полів повідомлення.

source: Return a list of 2-tuples containing all the message's field headers and values.
pt_br: Повертає список із двох кортежів, що містить усі заголовки та значення полів повідомлення.

source: Return the value of the named header field. This is identical to :meth:`~object.__getitem__` except that optional *failobj* is returned if the named header is missing (defaults to ``None``).
pt_br: Верните значение именованного поля заголовка. Это идентично :meth:`~object.__getitem__`, за исключением того, что необязательный *failobj* возвращается, если именованный заголовок отсутствует (по умолчанию ``None``).

source: Here are some additional useful methods:
pt_br: Ось кілька додаткових корисних методів:

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
pt_br: Повертає список усіх значень для поля з назвою *name*. Якщо в повідомленні немає таких іменованих заголовків, повертається *failobj* (за замовчуванням ``None``).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
pt_br: Розширене налаштування заголовка. Цей метод подібний до :meth:`__setitem__` за винятком того, що додаткові параметри заголовка можуть бути надані як аргументи ключового слова. *_name* — це поле заголовка, яке потрібно додати, а *_value* — це *основне* значення для заголовка.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added. If the value contains non-ASCII characters, it can be specified as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
pt_br: Для кожного елемента в словнику аргументів ключових слів *_params* ключ береться як ім’я параметра, а символи підкреслення перетворюються на тире (оскільки тире заборонені в ідентифікаторах Python). Зазвичай параметр буде додано як ``key="value"``, якщо значення не буде ``None``, у цьому випадку буде додано лише ключ. Якщо значення містить символи, відмінні від ASCII, його можна вказати як трикортеж у форматі ``(НАБІР СИМВОЛІВ, МОВА, ЗНАЧЕННЯ)``, де ``НАБІР СИГНАЛОВ`` – це рядок із назвою набору символів, який буде використано для кодування значення ``LANGUAGE`` зазвичай можна встановити на ``None`` або порожній рядок (перегляньте :rfc:`2231` для інших можливостей), а ``VALUE`` є значенням рядка, що містить кодові точки не-ASCII . Якщо три кортежу не передано і значення містить символи, відмінні від ASCII, воно автоматично кодується у форматі :rfc:`2231` з використанням ``CHARSET`` ``utf-8`` і ``LANGUAGE`` з ``Жодного``.

source: Here's an example::
pt_br: Aqui está um exemplo::

source: This will add a header that looks like ::
pt_br: Це додасть заголовок, який виглядає так::

source: An example with non-ASCII characters::
pt_br: Um exemplo com caracteres não-ASCII::

source: Which produces ::
pt_br: Que produz ::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case. If no matching header was found, a :exc:`KeyError` is raised.
pt_br: Замінити заголовок. Замініть перший знайдений у повідомленні заголовок, який відповідає *_name*, зберігаючи порядок заголовків і регістр імені поля. Якщо відповідного заголовка не знайдено, виникає :exc:`KeyError`.

source: Return the message's content type. The returned string is coerced to lower case of the form :mimetype:`maintype/subtype`. If there was no :mailheader:`Content-Type` header in the message the default type as given by :meth:`get_default_type` will be returned. Since according to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value.
pt_br: Повернути тип вмісту повідомлення. Повернений рядок приводиться до нижнього регістру у формі :mimetype:`maintype/subtype`. Якщо в повідомленні не було заголовка :mailheader:`Content-Type`, буде повернено тип за замовчуванням, заданий :meth:`get_default_type`. Оскільки відповідно до :rfc:`2045` повідомлення завжди мають тип за замовчуванням, :meth:`get_content_type` завжди повертатиме значення.

source: :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.
pt_br: :rfc:`2045` визначає тип повідомлення за замовчуванням як :mimetype:`text/plain`, якщо воно не з’являється всередині контейнера :mimetype:`multipart/digest`, у такому випадку це буде :mimetype:`message/rfc822` . Якщо заголовок :mailheader:`Content-Type` має недійсну специфікацію типу, :rfc:`2045` вимагає, щоб типовим типом був :mimetype:`text/plain`.

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
pt_br: Повернути основний тип вмісту повідомлення. Це :mimetype:`maintype` частина рядка, яку повертає :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
pt_br: Повернути тип підвмісту повідомлення. Це :mimetype:`subtype` частина рядка, яку повертає :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
pt_br: Повернути типовий тип вмісту. Більшість повідомлень мають стандартний тип вмісту :mimetype:`text/plain`, за винятком повідомлень, які є підчастинами контейнерів :mimetype:`multipart/digest`. Такі підчастини мають типовий тип вмісту :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header.
pt_br: Встановіть тип вмісту за замовчуванням. *ctype* має бути :mimetype:`text/plain` або :mimetype:`message/rfc822`, хоча це не обов’язково. Стандартний тип вмісту не зберігається в заголовку :mailheader:`Content-Type`.

source: Return the message's :mailheader:`Content-Type` parameters, as a list. The elements of the returned list are 2-tuples of key/value pairs, as split on the ``'='`` sign. The left hand side of the ``'='`` is the key, while the right hand side is the value. If there is no ``'='`` sign in the parameter the value is the empty string, otherwise the value is as described in :meth:`get_param` and is unquoted if optional *unquote* is ``True`` (the default).
pt_br: Повернути параметри :mailheader:`Content-Type` повідомлення у вигляді списку. Елементи повернутого списку — це 2-кортежі пар ключ/значення, розділені знаком ``'='``. Ліва сторона ``'='`` є ключем, а права частина - значенням. Якщо в параметрі немає знака ``'='``, значенням є порожній рядок, інакше значення відповідає опису в :meth:`get_param` і не береться в лапки, якщо необов’язковий *unquote* має значення ``True`` ( за замовчуванням).

source: Optional *failobj* is the object to return if there is no :mailheader:`Content-Type` header. Optional *header* is the header to search instead of :mailheader:`Content-Type`.
pt_br: Необов’язковий *failobj* — це об’єкт, який повертається, якщо немає заголовка :mailheader:`Content-Type`. Додатковий *header* – це заголовок для пошуку замість :mailheader:`Content-Type`.

source: Return the value of the :mailheader:`Content-Type` header's parameter *param* as a string. If the message has no :mailheader:`Content-Type` header or if there is no such parameter, then *failobj* is returned (defaults to ``None``).
pt_br: Повертає значення параметра *param* заголовка :mailheader:`Content-Type` у вигляді рядка. Якщо повідомлення не має заголовка :mailheader:`Content-Type` або немає такого параметра, повертається *failobj* (за замовчуванням ``None``).

source: Optional *header* if given, specifies the message header to use instead of :mailheader:`Content-Type`.
pt_br: Необов’язковий *заголовок*, якщо задано, визначає заголовок повідомлення, який слід використовувати замість :mailheader:`Content-Type`.

source: Parameter keys are always compared case insensitively. The return value can either be a string, or a 3-tuple if the parameter was :rfc:`2231` encoded. When it's a 3-tuple, the elements of the value are of the form ``(CHARSET, LANGUAGE, VALUE)``. Note that both ``CHARSET`` and ``LANGUAGE`` can be ``None``, in which case you should consider ``VALUE`` to be encoded in the ``us-ascii`` charset. You can usually ignore ``LANGUAGE``.
pt_br: Ключі параметрів завжди порівнюються без урахування регістру. Значення, що повертається, може бути рядком або кортежем із трьох, якщо параметр було закодовано :rfc:`2231`. Якщо це 3-кортеж, елементи значення мають форму ``(НАБІР СИМВОЛІВ, МОВА, ЗНАЧЕННЯ)``. Зауважте, що як для ``CHARSET``, так і для ``LANGUAGE`` може бути ``None``, у цьому випадку вам слід вважати, що ``VALUE`` закодовано в ``us-ascii``. Зазвичай ви можете ігнорувати ``LANGUAGE``.

source: If your application doesn't care whether the parameter was encoded as in :rfc:`2231`, you can collapse the parameter value by calling :func:`email.utils.collapse_rfc2231_value`, passing in the return value from :meth:`get_param`. This will return a suitably decoded Unicode string when the value is a tuple, or the original string unquoted if it isn't. For example::
pt_br: Якщо вашій програмі байдуже, чи був параметр закодований як у :rfc:`2231`, ви можете згорнути значення параметра, викликавши :func:`email.utils.collapse_rfc2231_value`, передавши значення, що повертається з :meth:`get_param`. Це поверне відповідним чином декодований рядок Unicode, якщо значення є кортежем, або оригінальний рядок без лапок, якщо це не так. Наприклад::

source: In any case, the parameter value (either the returned string, or the ``VALUE`` item in the 3-tuple) is always unquoted, unless *unquote* is set to ``False``.
pt_br: У будь-якому випадку значення параметра (або повернений рядок, або елемент ``VALUE`` у 3-кортежі) завжди не береться в лапки, якщо для *unquote* не встановлено значення ``False``.

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, its value will be replaced with *value*. If the :mailheader:`Content-Type` header as not yet been defined for this message, it will be set to :mimetype:`text/plain` and the new parameter value will be appended as per :rfc:`2045`.
pt_br: Установіть параметр у заголовку :mailheader:`Content-Type`. Якщо параметр уже існує в заголовку, його значення буде замінено на *value*. Якщо заголовок :mailheader:`Content-Type` ще не визначено для цього повідомлення, для нього буде встановлено значення :mimetype:`text/plain`, а нове значення параметра буде додано відповідно до :rfc:`2045`.

source: Optional *header* specifies an alternative header to :mailheader:`Content-Type`, and all parameters will be quoted as necessary unless optional *requote* is ``False`` (the default is ``True``).
pt_br: Необов’язковий *header* визначає альтернативний заголовок :mailheader:`Content-Type`, і всі параметри будуть взяті в лапки, якщо необов’язковий *requote* не має значення ``False`` (за замовчуванням це ``True``).

source: If optional *charset* is specified, the parameter will be encoded according to :rfc:`2231`. Optional *language* specifies the RFC 2231 language, defaulting to the empty string. Both *charset* and *language* should be strings.
pt_br: Якщо вказано необов’язковий *charset*, параметр буде закодовано відповідно до :rfc:`2231`. Необов’язкова *мова* вказує мову RFC 2231, за умовчанням порожній рядок. І *charset*, і *language* мають бути рядками.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
pt_br: Якщо *replace* має значення ``False`` (за замовчуванням), заголовок переміщується в кінець списку заголовків. Якщо *replace* має значення ``True``, заголовок буде оновлено на місці.

source: ``replace`` keyword was added.
pt_br: Palavra-chave ``replace`` foi adicionada.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. All values will be quoted as necessary unless *requote* is ``False`` (the default is ``True``). Optional *header* specifies an alternative to :mailheader:`Content-Type`.
pt_br: Повністю вилучіть вказаний параметр із заголовка :mailheader:`Content-Type`. Заголовок буде перезаписано на місці без параметра чи його значення. Усі значення будуть взяті в лапки за необхідності, якщо *requote* не має значення ``False`` (за замовчуванням ``True``). Необов’язковий *заголовок* визначає альтернативу :mailheader:`Content-Type`.

source: Set the main type and subtype for the :mailheader:`Content-Type` header. *type* must be a string in the form :mimetype:`maintype/subtype`, otherwise a :exc:`ValueError` is raised.
pt_br: Встановіть основний тип і підтип для заголовка :mailheader:`Content-Type`. *type* має бути рядком у формі :mimetype:`maintype/subtype`, інакше виникає :exc:`ValueError`.

source: This method replaces the :mailheader:`Content-Type` header, keeping all the parameters in place. If *requote* is ``False``, this leaves the existing header's quoting as is, otherwise the parameters will be quoted (the default).
pt_br: Цей метод замінює заголовок :mailheader:`Content-Type`, зберігаючи всі параметри на місці. Якщо *requote* має значення ``False``, це залишає існуючі лапки заголовка як є, інакше параметри будуть взяті в лапки (за замовчуванням).

source: An alternative header can be specified in the *header* argument. When the :mailheader:`Content-Type` header is set a :mailheader:`MIME-Version` header is also added.
pt_br: Альтернативний заголовок можна вказати в аргументі *header*. Коли встановлено заголовок :mailheader:`Content-Type`, також додається заголовок :mailheader:`MIME-Version`.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
pt_br: Повертає значення параметра ``filename`` заголовка :mailheader:`Content-Disposition` повідомлення. Якщо заголовок не має параметра ``filename``, цей метод повертається до пошуку параметра ``name`` у заголовку :mailheader:`Content-Type`. Якщо нічого не знайдено або відсутній заголовок, повертається *failobj*. Повернений рядок завжди буде без лапок відповідно до :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
pt_br: Повертає значення параметра ``boundary`` заголовка :mailheader:`Content-Type` повідомлення або *failobj*, якщо заголовок відсутній або не має параметра ``boundary``. Повернений рядок завжди буде без лапок відповідно до :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
pt_br: Установіть для параметра ``boundary`` заголовка :mailheader:`Content-Type` значення *boundary*. :meth:`set_boundary` завжди братиме *boundary* у лапки, якщо необхідно. Помилка :exc:`~email.errors.HeaderParseError` виникає, якщо об’єкт повідомлення не має заголовка :mailheader:`Content-Type`.

source: Note that using this method is subtly different than deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers. However, it does *not* preserve any continuation lines which may have been present in the original :mailheader:`Content-Type` header.
pt_br: Зауважте, що використання цього методу дещо відрізняється від видалення старого заголовка :mailheader:`Content-Type` і додавання нового з новою межею за допомогою :meth:`add_header`, оскільки :meth:`set_boundary` зберігає порядок заголовок :mailheader:`Content-Type` у списку заголовків. Однак він *не* зберігає будь-які рядки продовження, які могли бути присутніми в оригінальному заголовку :mailheader:`Content-Type`.

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
pt_br: Повертає параметр ``charset`` заголовка :mailheader:`Content-Type` у нижньому регістрі. Якщо немає заголовка :mailheader:`Content-Type` або цей заголовок не має параметра ``charset``, повертається *failobj*.

source: Note that this method differs from :meth:`get_charset` which returns the :class:`~email.charset.Charset` instance for the default encoding of the message body.
pt_br: Зауважте, що цей метод відрізняється від :meth:`get_charset`, який повертає екземпляр :class:`~email.charset.Charset` для стандартного кодування тіла повідомлення.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
pt_br: Повернути список із назвами наборів символів у повідомленні. Якщо повідомлення є :mimetype:`multipart`, тоді список міститиме один елемент для кожної підчастини в корисному навантаженні, інакше це буде список довжиною 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. However, if the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
pt_br: Кожен елемент у списку буде рядком, який є значенням параметра ``charset`` у заголовку :mailheader:`Content-Type` для представленої підчастини. Однак, якщо підчастина не має заголовка :mailheader:`Content-Type`, параметра ``charset`` або не належить до основного типу MIME :mimetype:`text`, тоді цей елемент у списку, що повертається, буде *failobj*.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
pt_br: Повертає значення в нижньому регістрі (без параметрів) заголовка повідомлення :mailheader:`Content-Disposition`, якщо воно є, або ``None``. Можливі значення для цього методу: *inline*, *attachment* або ``None``, якщо повідомлення слідує за :rfc:`2183`.
