Repository: python/python-docs-pt-br
Catalog: library/ensurepip.po
Languages: pt_br

source: :mod:`!ensurepip` --- Bootstrapping the ``pip`` installer
pt_br: :mod:`!ensurepip` --- Inicialização do instalador do ``pip``

source: **Source code:** :source:`Lib/ensurepip`
pt_br: **Código-fonte:** :source:`Lib/ensurepip`

source: The :mod:`ensurepip` package provides support for bootstrapping the ``pip`` installer into an existing Python installation or virtual environment. This bootstrapping approach reflects the fact that ``pip`` is an independent project with its own release cycle, and the latest available stable version is bundled with maintenance and feature releases of the CPython reference interpreter.
pt_br: O pacote :mod:`ensurepip` fornece suporte a fazer bootstrapping, ou seja, inicializar o instalador do ``pip`` em uma instalação existente do Python ou em um ambiente virtual. Essa abordagem de bootstrapping reflete o fato de que ``pip`` é um projeto independente com seu próprio ciclo de lançamento, e a última versão estável disponível é fornecida com manutenção e lançamentos de recursos do interpretador de referência CPython.

source: In most cases, end users of Python shouldn't need to invoke this module directly (as ``pip`` should be bootstrapped by default), but it may be needed if installing ``pip`` was skipped when installing Python (or when creating a virtual environment) or after explicitly uninstalling ``pip``.
pt_br: Na maioria dos casos, os usuários finais do Python não precisam invocar esse módulo diretamente (como ``pip`` deve ser inicializado por padrão), mas pode ser necessário se a instalação do ``pip`` foi ignorada ao instalar o Python (ou ao criar um ambiente virtual) ou após desinstalar explicitamente ``pip``.

source: This module *does not* access the internet. All of the components needed to bootstrap ``pip`` are included as internal parts of the package.
pt_br: Este módulo *não* acessa a Internet. Todos os componentes necessários para iniciar o ``pip`` estão incluídos como partes internas do pacote.

source: The end user guide for installing Python packages
pt_br: O guia do usuário final para instalar pacotes Python

source: :pep:`453`: Explicit bootstrapping of pip in Python installations
pt_br: :pep:`453`: Inicialização explícita de pip em instalações Python

source: The original rationale and specification for this module.
pt_br: A justificativa e especificação originais para este módulo.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em plataformas WebAssembly ``wasm32-emscripten`` e ``wasm32-wasi``. Veja :ref:`wasm-availability` para mais informações.

source: Command line interface
pt_br: Interface de linha de comando

source: The command line interface is invoked using the interpreter's ``-m`` switch.
pt_br: A interface da linha de comando é chamada usando a opção ``-m`` do interpretador.

source: The simplest possible invocation is::
pt_br: A invocação mais simples possível é::

source: This invocation will install ``pip`` if it is not already installed, but otherwise does nothing. To ensure the installed version of ``pip`` is at least as recent as the one available in ``ensurepip``, pass the ``--upgrade`` option::
pt_br: Essa invocação instalará ``pip`` se ainda não estiver instalada, mas, caso contrário, não fará nada. Para garantir que a versão instalada do ``pip`` seja pelo menos tão recente quanto a disponível do ``ensurepip``, passe a opção ``--upgrade``::

source: By default, ``pip`` is installed into the current virtual environment (if one is active) or into the system site packages (if there is no active virtual environment). The installation location can be controlled through two additional command line options:
pt_br: Por padrão, ``pip`` é instalado no ambiente virtual atual (se houver um ativo) ou nos pacotes de sites do sistema (se não houver um ambiente virtual ativo). O local da instalação pode ser controlado através de duas opções adicionais de linha de comando:

source: :samp:`--root {dir}`: Installs ``pip`` relative to the given root directory rather than the root of the currently active virtual environment (if any) or the default root for the current Python installation.
pt_br: :samp:`--root {dir}`: Instala ``pip`` em relação ao diretório raiz fornecido, em vez da raiz do ambiente virtual atualmente ativo (se houver) ou a raiz padrão da instalação atual do Python.

source: ``--user``: Installs ``pip`` into the user site packages directory rather than globally for the current Python installation (this option is not permitted inside an active virtual environment).
pt_br: ``--user``: Instala ``pip`` no diretório de pacotes do site do usuário em vez de globalmente para a instalação atual do Python (essa opção não é permitida dentro de um ambiente virtual ativo).

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the version of Python used to invoke ``ensurepip``). The scripts installed can be controlled through two additional command line options:
pt_br: Por padrão, os scripts ``pipX`` e ``pipX.Y`` serão instalados (onde X.Y representa a versão do Python usada para invocar ``ensurepip``). Os scripts instalados podem ser controlados através de duas opções adicionais de linha de comando:

source: ``--altinstall``: if an alternate installation is requested, the ``pipX`` script will *not* be installed.
pt_br: ``--altinstall``: se uma instalação alternativa for solicitada, o script ``pipX`` *não* será instalado.

source: ``--default-pip``: if a "default pip" installation is requested, the ``pip`` script will be installed in addition to the two regular scripts.
pt_br: ``--default-pip``: se uma instalação "pip padrão" for solicitada, o script ``pip`` será instalado junto com os dois scripts comuns.

source: Providing both of the script selection options will trigger an exception.
pt_br: Fornecer as duas opções de seleção de script acionará uma exceção.

source: Module API
pt_br: API do módulo

source: :mod:`ensurepip` exposes two functions for programmatic use:
pt_br: O :mod:`ensurepip` expõe duas funções para uso programático:

source: Returns a string specifying the available version of pip that will be installed when bootstrapping an environment.
pt_br: Retorna uma string que especifica a versão disponível do pip que será instalado ao inicializar um ambiente.

source: Bootstraps ``pip`` into the current or designated environment.
pt_br: Inicializa ``pip`` no ambiente atual ou designado.

source: *root* specifies an alternative root directory to install relative to. If *root* is ``None``, then installation uses the default install location for the current environment.
pt_br: *root* especifica um diretório raiz alternativo para instalar em relação a. Se *root* for ``None``, a instalação utilizará o local de instalação padrão para o ambiente atual.

source: *upgrade* indicates whether or not to upgrade an existing installation of an earlier version of ``pip`` to the available version.
pt_br: *upgrade* indica se deve ou não atualizar uma instalação existente de uma versão anterior do ``pip`` para a versão disponível.

source: *user* indicates whether to use the user scheme rather than installing globally.
pt_br: *user* indica se é necessário usar o esquema do usuário em vez de instalar globalmente.

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the current version of Python).
pt_br: Por padrão, os scripts ``pipX`` e ``pipX.Y`` serão instalados (onde X.Y significa a versão atual do Python).

source: If *altinstall* is set, then ``pipX`` will *not* be installed.
pt_br: Se *altinstall* estiver definido, o ``pipX`` *não* será instalado.

source: If *default_pip* is set, then ``pip`` will be installed in addition to the two regular scripts.
pt_br: Se *default_pip* estiver definido, o ``pip`` será instalado além dos dois scripts comuns.

source: Setting both *altinstall* and *default_pip* will trigger :exc:`ValueError`.
pt_br: Definir *altinstall* e *default_pip* acionará :exc:`ValueError`.

source: *verbosity* controls the level of output to :data:`sys.stdout` from the bootstrapping operation.
pt_br: *verbosity* controla o nível de saída para :data:`sys.stdout` da operação de inicialização.

source: Raises an :ref:`auditing event <auditing>` ``ensurepip.bootstrap`` with argument ``root``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``ensurepip.bootstrap`` com o argumento ``root``.

source: The bootstrapping process has side effects on both ``sys.path`` and ``os.environ``. Invoking the command line interface in a subprocess instead allows these side effects to be avoided.
pt_br: O processo de inicialização tem efeitos colaterais em ``sys.path`` e ``os.environ``. Invocar a interface da linha de comando em um subprocesso permite que esses efeitos colaterais sejam evitados.

source: The bootstrapping process may install additional modules required by ``pip``, but other software should not assume those dependencies will always be present by default (as the dependencies may be removed in a future version of ``pip``).
pt_br: O processo de inicialização pode instalar módulos adicionais exigidos pelo ``pip``, mas outro software não deve presumir que essas dependências sempre estarão presentes por padrão (como as dependências podem ser removidas em uma versão futura do ``pip``).
