Repository: python/python-docs-pt-br
Catalog: library/enum.po
Languages: pt_br

source: :mod:`!enum` --- Support for enumerations
pt_br: :mod:`!enum` --- Suporte a enumerações

source: **Source code:** :source:`Lib/enum.py`
pt_br: **Código-fonte:** :source:`Lib/enum.py`

source: This page contains the API reference information. For tutorial information and discussion of more advanced topics, see
pt_br: Esta página contêm informação de referência da API. Para tutorial e discussão de tópicos mais avançados, consulte

source: :ref:`Basic Tutorial <enum-basic-tutorial>`
pt_br: :ref:`Tutorial básico <enum-basic-tutorial>`

source: :ref:`Advanced Tutorial <enum-advanced-tutorial>`
pt_br: :ref:`Tutorial avançado <enum-advanced-tutorial>`

source: :ref:`Enum Cookbook <enum-cookbook>`
pt_br: :ref:`Livro de receitas de enum <enum-cookbook>`

source: An enumeration:
pt_br: Uma enumeração:

source: is a set of symbolic names (members) bound to unique values
pt_br: é um conjunto de nomes simbólicos (membros) vinculados a valores únicos

source: can be iterated over to return its canonical (i.e. non-alias) members in definition order
pt_br: pode ser iterado para retornar seus membros canônicos (ou seja, não incluindo apelidos) na ordem de definição

source: uses *call* syntax to return members by value
pt_br: usa a sintaxe *call* para retornar membros por valor

source: uses *index* syntax to return members by name
pt_br: usa a sintaxe *index* para retornar membros por nome

source: Enumerations are created either by using :keyword:`class` syntax, or by using function-call syntax::
pt_br: As enumerações são criadas usando a sintaxe de :keyword:`class` ou usando a sintaxe de chamada de função::

source: >>> from enum import Enum >>> # class syntax >>> class Color(Enum): ... RED = 1 ... GREEN = 2 ... BLUE = 3 >>> # functional syntax >>> Color = Enum('Color', [('RED', 1), ('GREEN', 2), ('BLUE', 3)])
pt_br: >>> from enum import Enum >>> # sintaxe de classe >>> class Color(Enum): ... RED = 1 ... GREEN = 2 ... BLUE = 3 >>> # sintaxe funcional >>> Color = Enum('Color', [('RED', 1), ('GREEN', 2), ('BLUE', 3)])

source: Even though we can use :keyword:`class` syntax to create Enums, Enums are not normal Python classes. See :ref:`How are Enums different? <enum-class-differences>` for more details.
pt_br: Embora possamos usar a sintaxe :keyword:`class` para criar Enums, Enums não são classes Python normais. Veja :ref:`Como Enums são diferentes? <enum-class-differences>` para mais detalhes.

source: Nomenclature
pt_br: Nomenclatura

source: The class :class:`!Color` is an *enumeration* (or *enum*)
pt_br: A classe :class:`!Color` é uma *enumeração* (ou *enum*)

source: The attributes :attr:`!Color.RED`, :attr:`!Color.GREEN`, etc., are *enumeration members* (or *members*) and are functionally constants.
pt_br: Os atributos :attr:`!Color.RED`, :attr:`!Color.GREEN`, etc., são *membros de enumeração* (ou *membros*) e são constantes funcionalmente.

source: The enum members have *names* and *values* (the name of :attr:`!Color.RED` is ``RED``, the value of :attr:`!Color.BLUE` is ``3``, etc.)
pt_br: Os membros enum têm *nomes* e *valores* (o nome de :attr:`!Color.RED` é ``RED``, o valor de :attr:`!Color.BLUE` é ``3``, etc.)

source: Module Contents
pt_br: Conteúdo do módulo

source: The ``type`` for Enum and its subclasses.
pt_br: O ``type`` para Enum e suas subclasses.

source: Base class for creating enumerated constants.
pt_br: Classe base para criação de constantes enumeradas.

source: Base class for creating enumerated constants that are also subclasses of :class:`int`. (`Notes`_)
pt_br: Classe base para criar constantes enumeradas que também são subclasses de :class:`int`. (`Notas`_)

source: Base class for creating enumerated constants that are also subclasses of :class:`str`. (`Notes`_)
pt_br: Classe base para criar constantes enumeradas que também são subclasses de :class:`str`. (`Notas`_)

source: Base class for creating enumerated constants that can be combined using the bitwise operations without losing their :class:`Flag` membership.
pt_br: Classe base para criar constantes enumeradas que podem ser combinadas usando operações bit a bit sem perder sua associação :class:`Flag`.

source: Base class for creating enumerated constants that can be combined using the bitwise operators without losing their :class:`IntFlag` membership. :class:`IntFlag` members are also subclasses of :class:`int`. (`Notes`_)
pt_br: Classe base para criar constantes enumeradas que podem ser combinadas usando operadores bit a bit sem perder sua associação :class:`IntFlag`. Membros de :class:`IntFlag` também são subclasses de :class:`int`. (`Notas`_)

source: Used by :class:`IntEnum`, :class:`StrEnum`, and :class:`IntFlag` to keep the :class:`str() <str>` of the mixed-in type.
pt_br: Usado por :class:`IntEnum`, :class:`StrEnum` e :class:`IntFlag` para manter o :class:`str() <str>` do tipo misto.

source: An enumeration with the values ``CONTINUOUS``, ``NAMED_FLAGS``, and ``UNIQUE``, for use with :func:`verify` to ensure various constraints are met by a given enumeration.
pt_br: Uma enumeração com os valores ``CONTINUOUS``, ``NAMED_FLAGS`` e ``UNIQUE``, para uso com :func:`verify` para garantir que várias restrições sejam atendidas por uma determinada enumeração.

source: An enumeration with the values ``STRICT``, ``CONFORM``, ``EJECT``, and ``KEEP`` which allows for more fine-grained control over how invalid values are dealt with in an enumeration.
pt_br: Uma enumeração com os valores ``STRICT``, ``CONFORM``, ``EJECT`` e ``KEEP`` que permite um controle mais refinado sobre como valores inválidos são tratados em uma enumeração.

source: Instances are replaced with an appropriate value for Enum members. :class:`StrEnum` defaults to the lower-cased version of the member name, while other Enums default to 1 and increase from there.
pt_br: As instâncias são substituídas por um valor apropriado para membros Enum. :class:`StrEnum` assume como padrão a versão em minúsculas do nome do membro, enquanto outros Enums assumem como padrão 1 e aumentam a partir daí.

source: Allows :class:`Enum` members to have attributes without conflicting with member names. The ``value`` and ``name`` attributes are implemented this way.
pt_br: Permite que membros :class:`Enum` tenham atributos sem conflitar com nomes de membros. Os atributos ``value`` e ``name`` são implementados dessa forma.

source: Enum class decorator that ensures only one name is bound to any one value.
pt_br: Decorador de classe Enum que garante que apenas um nome seja vinculado a cada valor.

source: Enum class decorator that checks user-selectable constraints on an enumeration.
pt_br: Decorador de classe Enum que verifica restrições selecionáveis pelo usuário em uma enumeração.

source: Make ``obj`` a member. Can be used as a decorator.
pt_br: Torna ``obj`` um membro. Pode ser usado como um decorador.

source: Do not make ``obj`` a member. Can be used as a decorator.
pt_br: Não torna ``obj`` um membro. Pode ser usado como um decorador.

source: Modify the :class:`str() <str>` and :func:`repr` of an enum to show its members as belonging to the module instead of its class, and export the enum members to the global namespace.
pt_br: Modifica :class:`str() <str>` e :func:`repr` de uma enumeração para mostrar seus membros como pertencentes ao módulo em vez de sua classe, e exporta os membros da enumeração para o espaço de nomes global.

source: Return a list of all power-of-two integers contained in a flag.
pt_br: Retorna uma lista de todos os inteiros de potência de dois contidos em um sinalizador.

source: Data Types
pt_br: Tipos de Dados

source: *EnumType* is the :term:`metaclass` for *enum* enumerations. It is possible to subclass *EnumType* -- see :ref:`Subclassing EnumType <enumtype-examples>` for details.
pt_br: *EnumType* é a :term:`metaclasse` para enumerações *enum*. É possível criar subclasse de *EnumType* -- veja :ref:`Criando subclasses de EnumType <enumtype-examples>` para detalhes.

source: This method is called in two different ways:
pt_br: Этот метод вызывается двумя разными способами:

source: to look up an existing member:
pt_br: чтобы найти существующего участника:

source: The enum class being called.
pt_br: Вызываемый класс перечисления.

source: value
pt_br: valor

source: The value to lookup.
pt_br: Значение для поиска.

source: to use the ``cls`` enum to create a new enum (only if the existing enum does not have any members):
pt_br: чтобы использовать перечисление cls для создания нового перечисления (только если существующее перечисление не имеет членов):

source: The name of the new Enum to create.
pt_br: Имя нового создаваемого Enum.

source: names
pt_br: nomes

source: The names/values of the members for the new Enum.
pt_br: Имена/значения членов нового Enum.

source: module
pt_br: módulo

source: The name of the module the new Enum is created in.
pt_br: Имя модуля, в котором создается новый Enum.

source: The actual location in the module where this Enum can be found.
pt_br: Фактическое местоположение в модуле, где можно найти этот Enum.

source: type
pt_br: tipo

source: A mix-in type for the new Enum.
pt_br: Тип примеси для нового Enum.

source: The first integer value for the Enum (used by :class:`auto`).
pt_br: Первое целочисленное значение Enum (используется :class:`auto`).

source: boundary
pt_br: граница

source: How to handle out-of-range values from bit operations (:class:`Flag` only).
pt_br: Как обрабатывать значения, выходящие за пределы диапазона, в результате битовых операций (только:class:`Flag`).

source: Returns ``True`` if member belongs to the ``cls``::
pt_br: Возвращает ``True``, если член принадлежит ``cls``::

source: Before Python 3.12, a ``TypeError`` is raised if a non-Enum-member is used in a containment check.
pt_br: До Python 3.12 ошибка TypeError выдавалась, если при проверке содержания используется член, не являющийся членом Enum.

source: Returns ``['__class__', '__doc__', '__members__', '__module__']`` and the names of the members in *cls*::
pt_br: Возвращает ``['__class__', '__doc__', '__members__', '__module__']`` и имена членов в *cls*::

source: Returns the Enum member in *cls* matching *name*, or raises a :exc:`KeyError`::
pt_br: Возвращает член Enum в *cls*, соответствующий *name*, или вызывает :exc:`KeyError`::

source: Returns each member in *cls* in definition order::
pt_br: Возвращает каждого члена в *cls* в порядке определения::

source: Returns the number of member in *cls*::
pt_br: Возвращает количество членов в *cls*::

source: Returns a mapping of every enum name to its member, including aliases
pt_br: Возвращает сопоставление каждого имени перечисления с его членом, включая псевдонимы.

source: Returns each member in *cls* in reverse definition order::
pt_br: Возвращает каждого члена в *cls* в обратном порядке определения::

source: *Enum* is the base class for all *enum* enumerations.
pt_br: *Enum* — это базовый класс для всех перечислений *enum*.

source: The name used to define the ``Enum`` member::
pt_br: Имя, используемое для определения члена ``Enum``::

source: The value given to the ``Enum`` member::
pt_br: Значение, присвоенное члену ``Enum``::

source: Value of the member, can be set in :meth:`~Enum.__new__`.
pt_br: Значение члена может быть установлено в :meth:`~Enum.__new__`.

source: Enum member values
pt_br: Значення члена Enum

source: Member values can be anything: :class:`int`, :class:`str`, etc. If the exact value is unimportant you may use :class:`auto` instances and an appropriate value will be chosen for you. See :class:`auto` for the details.
pt_br: Значения членов могут быть любыми: :class:`int`, :class:`str` и т. д. Если точное значение не имеет значения, вы можете использовать экземпляры :class:`auto`, и подходящее значение будет выбрано за вас. Подробности смотрите в :class:`auto`.

source: While mutable/unhashable values, such as :class:`dict`, :class:`list` or a mutable :class:`~dataclasses.dataclass`, can be used, they will have a quadratic performance impact during creation relative to the total number of mutable/unhashable values in the enum.
pt_br: Хотя можно использовать изменяемые/нехэшируемые значения, такие как :class:`dict`, :class:`list` или изменяемый :class:`~dataclasses.dataclass`, они будут иметь квадратичное влияние на производительность во время создания относительно общее количество изменяемых/нехэшируемых значений в перечислении.

source: Name of the member.
pt_br: Имя участника.

source: No longer used, kept for backward compatibility. (class attribute, removed during class creation).
pt_br: Больше не используется, сохранено для обратной совместимости. (атрибут класса, удаленный при создании класса).

source: ``_ignore_`` is only used during creation and is removed from the enumeration once creation is complete.
pt_br: ``_ignore_`` используется только во время создания и удаляется из перечисления после завершения создания.

source: ``_ignore_`` is a list of names that will not become members, and whose names will also be removed from the completed enumeration. See :ref:`TimePeriod <enum-time-period>` for an example.
pt_br: ``_ignore_`` — это список имен, которые не станут членами и чьи имена также будут удалены из завершенного перечисления. Пример см. в :ref:`TimePeriod <enum-time- period>`.

source: Returns ``['__class__', '__doc__', '__module__', 'name', 'value']`` and any public methods defined on *self.__class__*::
pt_br: Возвращает ``['__class__', '__doc__', '__module__', 'name', 'value']`` и любые общедоступные методы, определенные в *self.__class__*::

source: name
pt_br: nome

source: The name of the member being defined (e.g. 'RED').
pt_br: Имя определяемого члена (например, «RED»).

source: The start value for the Enum; the default is 1.
pt_br: Начальное значение Enum; значение по умолчанию — 1.

source: The number of members currently defined, not including this one.
pt_br: Количество членов, определенное на данный момент, не считая этого.

source: A list of the previous values.
pt_br: Список предыдущих значений.

source: A *staticmethod* that is used to determine the next value returned by :class:`auto`::
pt_br: *статический метод*, который используется для определения следующего значения, возвращаемого :class:`auto`::

source: By default, does nothing. If multiple values are given in the member assignment, those values become separate arguments to ``__init__``; e.g.
pt_br: По умолчанию ничего не делает. Если в назначении члена задано несколько значений, эти значения становятся отдельными аргументами ``__init__``; например

source: ``Weekday.__init__()`` would be called as ``Weekday.__init__(self, 1, 'Mon')``
pt_br: ``Weekday.__init__()`` будет называться ``Weekday.__init__(self, 1, 'Mon')``

source: A *classmethod* that is used to further configure subsequent subclasses. By default, does nothing.
pt_br: *метод класса*, который используется для дальнейшей настройки последующих подклассов. По умолчанию ничего не делает.

source: A *classmethod* for looking up values not found in *cls*. By default it does nothing, but can be overridden to implement custom search behavior::
pt_br: *метод класса* для поиска значений, не найденных в *cls*. По умолчанию он ничего не делает, но его можно переопределить для реализации пользовательского поведения поиска::

source: By default, doesn't exist. If specified, either in the enum class definition or in a mixin class (such as ``int``), all values given in the member assignment will be passed; e.g.
pt_br: По умолчанию не существует. Если указано, либо в определении класса перечисления, либо в классе примеси (например, int), будут переданы все значения, указанные в назначении члена; например

source: results in the call ``int('1a', 16)`` and a value of ``26`` for the member.
pt_br: приводит к вызову ``int('1a', 16)`` и значению ``26`` для члена.

source: When writing a custom ``__new__``, do not use ``super().__new__`` -- call the appropriate ``__new__`` instead.
pt_br: При написании собственного ``__new__`` не используйте ``super().__new__`` - вместо этого вызовите соответствующий ``__new__``.

source: Returns the string used for *repr()* calls. By default, returns the *Enum* name, member name, and value, but can be overridden::
pt_br: Возвращает строку, используемую для вызовов *repr()*. По умолчанию возвращает имя *Enum*, имя элемента и значение, но их можно переопределить::

source: Returns the string used for *str()* calls. By default, returns the *Enum* name and member name, but can be overridden::
pt_br: Возвращает строку, используемую для вызовов *str()*. По умолчанию возвращает имя *Enum* и имя члена, но их можно переопределить::

source: Returns the string used for *format()* and *f-string* calls. By default, returns :meth:`__str__` return value, but can be overridden::
pt_br: Возвращает строку, используемую для вызовов *format()* и *f-string*. По умолчанию возвращает возвращаемое значение :meth:`__str__`, но его можно переопределить::

source: Using :class:`auto` with :class:`Enum` results in integers of increasing value, starting with ``1``.
pt_br: Использование :class:`auto` с :class:`Enum` приводит к увеличению целых чисел, начиная с ``1``.

source: Added :ref:`enum-dataclass-support`
pt_br: Добавлена ​​поддержка enum-dataclass-support.

source: Using :class:`auto` with :class:`IntEnum` results in integers of increasing value, starting with ``1``.
pt_br: Использование :class:`auto` с :class:`IntEnum` приводит к увеличению целых чисел, начиная с ``1``.

source: :meth:`~object.__str__` is now :meth:`!int.__str__` to better support the *replacement of existing constants* use-case. :meth:`~object.__format__` was already :meth:`!int.__format__` for that same reason.
pt_br: :meth:`~object.__str__` теперь называется :meth:`!int.__str__` для лучшей поддержки варианта использования *замены существующих констант*. :meth:`~object.__format__` уже был :meth:`!int.__format__` по той же причине.

source: There are places in the stdlib that check for an exact :class:`str` instead of a :class:`str` subclass (i.e. ``type(unknown) == str`` instead of ``isinstance(unknown, str)``), and in those locations you will need to use ``str(StrEnum.member)``.
pt_br: В stdlib есть места, которые проверяют точный :class:`str` вместо подкласса :class:`str` (т.е. ``type(unknown) == str`` вместо ``isinstance(unknown, str) ``), и в этих местах вам нужно будет использовать ``str(StrEnum.member)``.

source: Using :class:`auto` with :class:`StrEnum` results in the lower-cased member name as the value.
pt_br: Использование :class:`auto` с :class:`StrEnum` приводит к тому, что имя элемента в нижнем регистре становится значением.

source: :meth:`~object.__str__` is :meth:`!str.__str__` to better support the *replacement of existing constants* use-case. :meth:`~object.__format__` is likewise :meth:`!str.__format__` for that same reason.
pt_br: :meth:`~object.__str__` — это :meth:`!str.__str__` для лучшей поддержки варианта использования *замены существующих констант*. :meth:`~object.__format__` аналогично :meth:`!str.__format__` по той же причине.

source: ``Flag`` is the same as :class:`Enum`, but its members support the bitwise operators ``&`` (*AND*), ``|`` (*OR*), ``^`` (*XOR*), and ``~`` (*INVERT*); the results of those operations are (aliases of) members of the enumeration.
pt_br: ``Flag`` аналогичен :class:`Enum`, но его члены поддерживают побитовые операторы ``&`` (*AND*), ``|`` (*OR*), ``^`` (*XOR*) и ``~`` (*INVERT*); результатами этих операций являются (псевдонимы) членов перечисления.

source: Returns *True* if value is in self::
pt_br: Возвращает *True*, если значение находится в self::

source: Returns all contained non-alias members::
pt_br: Возвращает все содержащиеся члены без псевдонимов::

source: Returns number of members in flag::
pt_br: Возвращает количество членов в флаге::

source: Returns *True* if any members in flag, *False* otherwise::
pt_br: Возвращает *True*, если есть элементы в флаге, *False* в противном случае::

source: Returns current flag binary or'ed with other::
pt_br: Возвращает текущий флаг в двоичном виде или с другим::

source: Returns current flag binary and'ed with other::
pt_br: Возвращает текущий двоичный флаг и объединяет его с другим::

source: Returns current flag binary xor'ed with other::
pt_br: Возвращает текущий флаг, подвергнутый xor с другим::

source: Function used to format any remaining unnamed numeric values. Default is the value's repr; common choices are :func:`hex` and :func:`oct`.
pt_br: Функция, используемая для форматирования любых оставшихся безымянных числовых значений. По умолчанию — это представление значения; распространенный выбор: :func:`hex` и :func:`oct`.

source: Using :class:`auto` with :class:`Flag` results in integers that are powers of two, starting with ``1``.
pt_br: Использование :class:`auto` с :class:`Flag` приводит к получению целых чисел, которые являются степенями двойки, начиная с ``1``.

source: The *repr()* of zero-valued flags has changed. It is now::
pt_br: Функция *repr()* флагов с нулевым значением изменилась. Это сейчас::

source: If any integer operation is performed with an *IntFlag* member, the result is not an *IntFlag*::
pt_br: Если с элементом *IntFlag* выполняется какая-либо целочисленная операция, результатом не будет *IntFlag*::

source: the result is a valid *IntFlag*: an *IntFlag* is returned
pt_br: результатом является действительный *IntFlag*: возвращается *IntFlag*

source: Using :class:`auto` with :class:`IntFlag` results in integers that are powers of two, starting with ``1``.
pt_br: Использование :class:`auto` с :class:`IntFlag` приводит к получению целых чисел, которые являются степенями двойки, начиная с ``1``.

source: :meth:`~object.__str__` is now :meth:`!int.__str__` to better support the *replacement of existing constants* use-case. :meth:`~object.__format__` was already :meth:`!int.__format__` for that same reason.
pt_br: :meth:`~object.__str__` теперь называется :meth:`!int.__str__` для лучшей поддержки варианта использования *замены существующих констант*. :meth:`~object.__format__` уже был :meth:`!int.__format__` по той же причине.

source: Inversion of an :class:`!IntFlag` now returns a positive value that is the union of all flags not in the given flag, rather than a negative value. This matches the existing :class:`Flag` behavior.
pt_br: Инверсия :class:`!IntFlag` теперь возвращает положительное значение, которое представляет собой объединение всех флагов, не входящих в данный флаг, а не отрицательное значение. Это соответствует существующему поведению :class:`Flag`.

source: :class:`!ReprEnum` uses the :meth:`repr() <Enum.__repr__>` of :class:`Enum`, but the :class:`str() <str>` of the mixed-in data type:
pt_br: :class:`!ReprEnum` использует :meth:`repr() <Enum.__repr__>` из :class:`Enum`, но :class:`str() <str>` смешанного типа данных :

source: :meth:`!int.__str__` for :class:`IntEnum` and :class:`IntFlag`
pt_br: :meth:`!int.__str__` для :class:`IntEnum` и :class:`IntFlag`

source: :meth:`!str.__str__` for :class:`StrEnum`
pt_br: :meth:`!str.__str__` для :class:`StrEnum`

source: Inherit from :class:`!ReprEnum` to keep the :class:`str() <str>` / :func:`format` of the mixed-in data type instead of using the :class:`Enum`-default :meth:`str() <Enum.__str__>`.
pt_br: Наследуйте от :class:`!ReprEnum`, чтобы сохранить :class:`str() <str>` / :func:`format` смешанного типа данных вместо использования :class:`Enum`-default: meth:`str() <Enum.__str__>`.

source: *EnumCheck* contains the options used by the :func:`verify` decorator to ensure various constraints; failed constraints result in a :exc:`ValueError`.
pt_br: *EnumCheck* содержит параметры, используемые декоратором :func:`verify` для обеспечения различных ограничений; неудачные ограничения приводят к ошибке :exc:`ValueError`.
