Repository: python/python-docs-pt-br
Catalog: library/enum.po
Languages: pt_br

source: Ensure that each value has only one name::
pt_br: Убедитесь, что каждое значение имеет только одно имя::

source: Ensure that there are no missing values between the lowest-valued member and the highest-valued member::
pt_br: Убедитесь, что между элементом с наименьшим значением и элементом с самым высоким значением нет пропущенных значений::

source: Ensure that any flag groups/masks contain only named flags -- useful when values are specified instead of being generated by :func:`auto`::
pt_br: Убедитесь, что все группы/маски флагов содержат только именованные флаги — полезно, когда значения указаны, а не генерируются :func:`auto`::

source: CONTINUOUS and NAMED_FLAGS are designed to work with integer-valued members.
pt_br: CONTINUOUS и NAMED_FLAGS предназначены для работы с членами с целочисленными значениями.

source: Out-of-range values cause a :exc:`ValueError` to be raised. This is the default for :class:`Flag`::
pt_br: Значения, выходящие за пределы диапазона, приводят к возникновению ошибки :exc:`ValueError`. Это значение по умолчанию для :class:`Flag`::

source: Supported ``__dunder__`` names
pt_br: Nomes ``__dunder__`` suportados

source: :attr:`~EnumType.__members__` is a read-only ordered mapping of ``member_name``:``member`` items. It is only available on the class.
pt_br: :attr:`~EnumType.__members__` — это упорядоченное сопоставление элементов ``member_name``:``member``, доступное только для чтения. Это доступно только в классе.

source: Supported ``_sunder_`` names
pt_br: Nomes ``_sunder_`` suportados

source: :attr:`~Enum._name_` -- name of the member
pt_br: :attr:`~Enum._name_` -- имя члена

source: :attr:`~Enum._value_` -- value of the member; can be set in ``__new__``
pt_br: :attr:`~Enum._value_` -- значение члена; можно установить в ``__new__``

source: :meth:`~Enum._missing_` -- a lookup function used when a value is not found; may be overridden
pt_br: :meth:`~Enum._missing_` -- функция поиска, используемая, когда значение не найдено; может быть переопределено

source: :attr:`~Enum._ignore_` -- a list of names, either as a :class:`list` or a :class:`str`, that will not be transformed into members, and will be removed from the final class
pt_br: :attr:`~Enum._ignore_` -- список имен в виде :class:`list` или :class:`str`, который не будет преобразован в члены и будет удален из конечного класса.

source: :attr:`~Enum._order_` -- no longer used, kept for backward compatibility (class attribute, removed during class creation)
pt_br: :attr:`~Enum._order_` -- больше не используется, сохранено для обратной совместимости (атрибут класса удален во время создания класса)

source: :meth:`~Enum._generate_next_value_` -- used to get an appropriate value for an enum member; may be overridden
pt_br: :meth:`~Enum._generate_next_value_` -- используется для получения соответствующего значения для члена перечисления; может быть переопределено

source: For standard :class:`Enum` classes the next value chosen is the last value seen incremented by one.
pt_br: Para classes :class:`Enum` padrão, o próximo valor escolhido é o último valor visto incrementado em um.

source: For :class:`Flag` classes the next value chosen will be the next highest power-of-two, regardless of the last value seen.
pt_br: Para as classes :class:`Flag` o próximo valor escolhido será a próxima potência de dois mais alta, independentemente do último valor visto.

source: Utilities and Decorators
pt_br: Утилиты и декораторы

source: *auto* instances are only resolved when at the top level of an assignment:
pt_br: Экземпляры *auto* разрешаются только на верхнем уровне задания:

source: ``FIRST = auto()`` will work (auto() is replaced with ``1``);
pt_br: ``FIRST = auto()`` будет работать (auto() заменяется на ``1``);

source: ``SECOND = auto(), -2`` will work (auto is replaced with ``2``, so ``2, -2`` is used to create the ``SECOND`` enum member;
pt_br: ``SECOND = auto(), -2`` будет работать (auto заменяется на ``2``, поэтому ``2, -2`` используется для создания члена перечисления ``SECOND``;

source: ``THREE = [auto(), -3]`` will *not* work (``<auto instance>, -3`` is used to create the ``THREE`` enum member)
pt_br: ``THREE = [auto(), -3]`` *не* будет работать (``<auto экземпляр>, -3`` используется для создания члена перечисления ``THREE``)

source: In prior versions, ``auto()`` had to be the only thing on the assignment line to work properly.
pt_br: В предыдущих версиях ``auto()`` должен был быть единственным элементом в строке назначения, чтобы работать правильно.

source: ``_generate_next_value_`` can be overridden to customize the values used by *auto*.
pt_br: ``_generate_next_value_`` можно переопределить, чтобы настроить значения, используемые *auto*.

source: in 3.13 the default ``_generate_next_value_`` will always return the highest member value incremented by 1, and will fail if any member is an incompatible type.
pt_br: в версии 3.13 ``_generate_next_value_`` по умолчанию всегда будет возвращать наибольшее значение члена, увеличенное на 1, и завершится ошибкой, если какой-либо член имеет несовместимый тип.

source: A decorator similar to the built-in *property*, but specifically for enumerations. It allows member attributes to have the same names as members themselves.
pt_br: Декоратор, аналогичный встроенному *свойству*, но специально для перечислений. Это позволяет атрибутам членов иметь те же имена, что и сами члены.

source: the *property* and the member must be defined in separate classes; for example, the *value* and *name* attributes are defined in the *Enum* class, and *Enum* subclasses can define members with the names ``value`` and ``name``.
pt_br: *свойство* и член должны быть определены в отдельных классах; например, атрибуты *value* и *name* определены в классе *Enum*, а подклассы *Enum* могут определять элементы с именами ``value`` и ``name``.

source: A :keyword:`class` decorator specifically for enumerations. It searches an enumeration's :attr:`~EnumType.__members__`, gathering any aliases it finds; if any are found :exc:`ValueError` is raised with the details::
pt_br: Декоратор :keyword:`class` специально для перечислений. Он ищет :attr:`~EnumType.__members__` перечисления, собирая все найденные псевдонимы; если таковые имеются, выдается :exc:`ValueError` с подробной информацией::

source: >>> from enum import Enum, unique >>> @unique ... class Mistake(Enum): ... ONE = 1 ... TWO = 2 ... THREE = 3 ... FOUR = 3 ... Traceback (most recent call last): ... ValueError: duplicate values found in <enum 'Mistake'>: FOUR -> THREE
pt_br: >>> from enum import Enum, unique >>> @unique ... class Errado(Enum): ... UM = 1 ... DOIS = 2 ... TRES = 3 ... QUATRO = 3 ... Traceback (most recent call last): ... ValueError: duplicate values found in <enum 'Errado'>: QUATRO -> TRES

source: A :keyword:`class` decorator specifically for enumerations. Members from :class:`EnumCheck` are used to specify which constraints should be checked on the decorated enumeration.
pt_br: Декоратор :keyword:`class` специально для перечислений. Члены :class:`EnumCheck` используются для указания того, какие ограничения следует проверять в декорированном перечислении.

source: A decorator for use in enums: its target will become a member.
pt_br: Декоратор для использования в перечислениях: его целью станет член.

source: A decorator for use in enums: its target will not become a member.
pt_br: Декоратор для использования в перечислениях: его цель не станет членом.

source: A decorator to change the :class:`str() <str>` and :func:`repr` of an enum to show its members as belonging to the module instead of its class. Should only be used when the enum members are exported to the module global namespace (see :class:`re.RegexFlag` for an example).
pt_br: Декоратор для изменения :class:`str() <str>` и :func:`repr` перечисления, чтобы показать его члены как принадлежащие модулю, а не его классу. Следует использовать только тогда, когда члены перечисления экспортируются в глобальное пространство имен модуля (пример см. в :class:`re.RegexFlag`).

source: Return a list of all power-of-two integers contained in a flag *value*.
pt_br: Возвращает список всех целых чисел степени двойки, содержащихся в флаге *value*.

source: Notes
pt_br: Notas

source: :class:`IntEnum`, :class:`StrEnum`, and :class:`IntFlag`
pt_br: :class:`IntEnum`, :class:`StrEnum` и :class:`IntFlag`

source: These three enum types are designed to be drop-in replacements for existing integer- and string-based values; as such, they have extra limitations:
pt_br: Эти три типа перечислений предназначены для замены существующих целочисленных и строковых значений; как таковые, они имеют дополнительные ограничения:

source: ``__str__`` uses the value and not the name of the enum member
pt_br: ``__str__`` использует значение, а не имя члена перечисления.

source: ``__format__``, because it uses ``__str__``, will also use the value of the enum member instead of its name
pt_br: ``__format__``, поскольку он использует ``__str__``, также будет использовать значение члена перечисления вместо его имени.

source: If you do not need/want those limitations, you can either create your own base class by mixing in the ``int`` or ``str`` type yourself::
pt_br: Если вам не нужны/не нужны эти ограничения, вы можете создать свой собственный базовый класс, смешав тип ``int`` или ``str`` самостоятельно::

source: or you can reassign the appropriate :meth:`str`, etc., in your enum::
pt_br: или вы можете переназначить соответствующий :meth:`str` и т. д. в вашем перечислении::
