Repository: python/python-docs-pt-br
Catalog: library/exceptions.po
Languages: pt_br

source: A subclass of :exc:`ConnectionError`, raised when trying to write on a pipe while the other end has been closed, or trying to write on a socket which has been shutdown for writing. Corresponds to :c:data:`errno` :py:const:`~errno.EPIPE` and :py:const:`~errno.ESHUTDOWN`.
pt_br: Uma subclasse de :exc:`ConnectionError`, levantada ao tentar escrever em um encadeamento, enquanto a outra extremidade foi fechada, ou ao tentar escrever em um soquete que foi desligado para escrita. Corresponde a :c:data:`errno` :py:const:`~errno.EPIPE` e :py:const:`~errno.ESHUTDOWN`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is aborted by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNABORTED`.
pt_br: Uma subclasse de :exc:`ConnectionError`, levantada quando uma tentativa de conexão é cancelada pelo par. Corresponde a :c:data:`errno` :py:const:`~errno.ECONNABORTED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection attempt is refused by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.
pt_br: Uma subclasse de :exc:`ConnectionError`, levantada quando uma tentativa de conexão é recusada pelo par. Corresponde a :c:data:`errno` :py:const:`~errno.ECONNREFUSED`.

source: A subclass of :exc:`ConnectionError`, raised when a connection is reset by the peer. Corresponds to :c:data:`errno` :py:const:`~errno.ECONNRESET`.
pt_br: Uma subclasse de :exc:`ConnectionError`, levantada quando uma conexão é redefinida pelo par. Corresponde a :c:data:`errno` :py:const:`~errno.ECONNRESET`.

source: Raised when trying to create a file or directory which already exists. Corresponds to :c:data:`errno` :py:const:`~errno.EEXIST`.
pt_br: Levantada ao tentar criar um arquivo ou diretório que já existe. Corresponde a :c:data:`errno` :py:const:`~errno.EEXIST`.

source: Raised when a file or directory is requested but doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ENOENT`.
pt_br: Levantada quando um arquivo ou diretório é solicitado, mas não existe. Corresponde a :c:data:`errno` :py:const:`~errno.ENOENT`.

source: Raised when a system call is interrupted by an incoming signal. Corresponds to :c:data:`errno` :py:const:`~errno.EINTR`.
pt_br: Levantada quando uma chamada do sistema é interrompida por um sinal de entrada. Corresponde a :c:data:`errno` :py:const:`~errno.EINTR`.

source: Python now retries system calls when a syscall is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale), instead of raising :exc:`InterruptedError`.
pt_br: Python agora tenta novamente chamadas de sistema quando uma *syscall* é interrompida por um sinal, exceto se o tratador de sinal levanta uma exceção (veja :pep:`475` para a justificativa), em vez de levantar :exc:`InterruptedError`.

source: Raised when a file operation (such as :func:`os.remove`) is requested on a directory. Corresponds to :c:data:`errno` :py:const:`~errno.EISDIR`.
pt_br: Levantada quando uma operação de arquivo (como :func:`os.remove`) é solicitada em um diretório. Corresponde a :c:data:`errno` :py:const:`~errno.EISDIR`.

source: Raised when a directory operation (such as :func:`os.listdir`) is requested on something which is not a directory. On most POSIX platforms, it may also be raised if an operation attempts to open or traverse a non-directory file as if it were a directory. Corresponds to :c:data:`errno` :py:const:`~errno.ENOTDIR`.
pt_br: Levantada quando uma operação de diretório (como :func:`os.listdir`) é solicitada em algo que não é um diretório. Na maioria das plataformas POSIX, ela também pode ser levantada se uma operação tentar abrir ou percorrer um arquivo não pertencente ao diretório como se fosse um diretório. Corresponde a :c:data:`errno` :py:const:`~errno.ENOTDIR`.

source: Raised when trying to run an operation without the adequate access rights - for example filesystem permissions. Corresponds to :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM`, and :py:const:`~errno.ENOTCAPABLE`.
pt_br: Levantada ao tentar executar uma operação sem os direitos de acesso adequados - por exemplo, permissões do sistema de arquivos. Corresponde a :c:data:`errno` :py:const:`~errno.EACCES`, :py:const:`~errno.EPERM`, e :py:const:`~errno.ENOTCAPABLE`.

source: WASI's :py:const:`~errno.ENOTCAPABLE` is now mapped to :exc:`PermissionError`.
pt_br: :py:const:`~errno.ENOTCAPABLE` do WASI agora é mapeado para :exc:`PermissionError`.

source: Raised when a given process doesn't exist. Corresponds to :c:data:`errno` :py:const:`~errno.ESRCH`.
pt_br: Levantada quando um determinado processo não existe. Corresponde a :c:data:`errno` :py:const:`~errno.ESRCH`.

source: Raised when a system function timed out at the system level. Corresponds to :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.
pt_br: Levantada quando uma função do sistema expirou no nível do sistema. Corresponde a :c:data:`errno` :py:const:`~errno.ETIMEDOUT`.

source: All the above :exc:`OSError` subclasses were added.
pt_br: Todas as subclasses de :exc:`OSError` acima foram adicionadas.

source: Warnings
pt_br: Avisos

source: The following exceptions are used as warning categories; see the :ref:`warning-categories` documentation for more details.
pt_br: As seguintes exceções são usadas como categorias de aviso; veja a documentação de :ref:`warning-categories` para mais detalhes.

source: Base class for warning categories.
pt_br: Classe base para categorias de aviso.

source: Base class for warnings generated by user code.
pt_br: Classe base para avisos gerados pelo código do usuário.

source: Base class for warnings about deprecated features when those warnings are intended for other Python developers.
pt_br: Classe base para avisos sobre recursos descontinuados quando esses avisos se destinam a outros desenvolvedores Python.

source: Ignored by the default warning filters, except in the ``__main__`` module (:pep:`565`). Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
pt_br: Ignorado pelos filtros de aviso padrão, exceto no módulo ``__main__`` (:pep:`565`). Habilitar o :ref:`Modo de Desenvolvimento do Python <devmode>` mostra este aviso.

source: The deprecation policy is described in :pep:`387`.
pt_br: A política de descontinuação está descrita na :pep:`387`.

source: Base class for warnings about features which are obsolete and expected to be deprecated in the future, but are not deprecated at the moment.
pt_br: Classe base para avisos sobre recursos que foram descontinuados e devem ser descontinuados no futuro, mas não foram descontinuados ainda.

source: This class is rarely used as emitting a warning about a possible upcoming deprecation is unusual, and :exc:`DeprecationWarning` is preferred for already active deprecations.
pt_br: Esta classe raramente é usada para emitir um aviso sobre uma possível descontinuação futura, é incomum, e :exc:`DeprecationWarning` é preferível para descontinuações já ativas.

source: Ignored by the default warning filters. Enabling the :ref:`Python Development Mode <devmode>` shows this warning.
pt_br: Ignorado pelos filtros de aviso padrão. Habilitar o :ref:`Modo de Desenvolvimento do Python <devmode>` mostra este aviso.

source: Base class for warnings about dubious syntax.
pt_br: Classe base para avisos sobre sintaxe duvidosa.

source: Base class for warnings about dubious runtime behavior.
pt_br: Classe base para avisos sobre comportamento duvidoso de tempo de execução.

source: Base class for warnings about deprecated features when those warnings are intended for end users of applications that are written in Python.
pt_br: Classe base para avisos sobre recursos descontinuados quando esses avisos se destinam a usuários finais de aplicações escritas em Python.

source: Base class for warnings about probable mistakes in module imports.
pt_br: Classe base para avisos sobre prováveis erros na importação de módulos.

source: Base class for warnings related to Unicode.
pt_br: Classe base para avisos relacionados a Unicode.

source: Base class for warnings related to encodings.
pt_br: Classe base para avisos relacionados a codificações.

source: See :ref:`io-encoding-warning` for details.
pt_br: Veja :ref:`io-encoding-warning` para detalhes.

source: Base class for warnings related to :class:`bytes` and :class:`bytearray`.
pt_br: Classe base para avisos relacionados a :class:`bytes` e :class:`bytearray`.

source: Base class for warnings related to resource usage.
pt_br: Classe base para avisos relacionados a uso de recursos.

source: Exception groups
pt_br: Grupos de exceções

source: The following are used when it is necessary to raise multiple unrelated exceptions. They are part of the exception hierarchy so they can be handled with :keyword:`except` like all other exceptions. In addition, they are recognised by :keyword:`except*<except_star>`, which matches their subgroups based on the types of the contained exceptions.
pt_br: Os itens a seguir são usados quando é necessário levantar várias exceções não relacionadas. Eles fazem parte da hierarquia de exceção, portanto, podem ser tratados com :keyword:`except` como todas as outras exceções. Além disso, eles são reconhecidos por :keyword:`except*<except_star>`, que corresponde a seus subgrupos com base nos tipos de exceções contidas.

source: Both of these exception types wrap the exceptions in the sequence ``excs``. The ``msg`` parameter must be a string. The difference between the two classes is that :exc:`BaseExceptionGroup` extends :exc:`BaseException` and it can wrap any exception, while :exc:`ExceptionGroup` extends :exc:`Exception` and it can only wrap subclasses of :exc:`Exception`. This design is so that ``except Exception`` catches an :exc:`ExceptionGroup` but not :exc:`BaseExceptionGroup`.
pt_br: Ambos os tipos de exceção agrupam as exceções na sequência ``excs``. O parâmetro ``msg`` deve ser uma string. A diferença entre as duas classes é que :exc:`BaseExceptionGroup` estende :exc:`BaseException` e pode envolver qualquer exceção, enquanto :exc:`ExceptionGroup` estende :exc:`Exception` e só pode agrupar subclasses de :exc:`Exception`. Este design é para que ``except Exception`` capture um :exc:`ExceptionGroup` mas não :exc:`BaseExceptionGroup`.

source: The :exc:`BaseExceptionGroup` constructor returns an :exc:`ExceptionGroup` rather than a :exc:`BaseExceptionGroup` if all contained exceptions are :exc:`Exception` instances, so it can be used to make the selection automatic. The :exc:`ExceptionGroup` constructor, on the other hand, raises a :exc:`TypeError` if any contained exception is not an :exc:`Exception` subclass.
pt_br: O construtor de :exc:`BaseExceptionGroup` retorna uma :exc:`ExceptionGroup` ao invés de uma :exc:`BaseExceptionGroup` se todas as exceções contidas forem instâncias :exc:`Exception`, então ela pode ser usada para tornar a seleção automática. O construtor de :exc:`ExceptionGroup`, por outro lado, levanta :exc:`TypeError` se qualquer exceção contida não for uma subclasse de :exc:`Exception`.

source: The ``msg`` argument to the constructor. This is a read-only attribute.
pt_br: O argumento ``msg`` para o construtor. Este é um atributo somente leitura.

source: A tuple of the exceptions in the ``excs`` sequence given to the constructor. This is a read-only attribute.
pt_br: Uma tupla de exceções na sequência ``excs`` dada ao construtor. Este é um atributo somente leitura.

source: Returns an exception group that contains only the exceptions from the current group that match *condition*, or ``None`` if the result is empty.
pt_br: Retorna um grupo de exceções que contém apenas as exceções do grupo atual que correspondem à condição *condition* ou ``None`` se o resultado estiver vazio.

source: The condition can be an exception type or tuple of exception types, in which case each exception is checked for a match using the same check that is used in an ``except`` clause. The condition can also be a callable (other than a type object) that accepts an exception as its single argument and returns true for the exceptions that should be in the subgroup.
pt_br: A condição pode ser um tipo exceção ou tupla de tipos de exceção. Nesse caso, cada exceção é verificada quanto a um match usando a mesma verificação que é usada em uma cláusula de ``except``. A condição também pode ser um chamável (diferente de um objeto de tipo) que aceita uma exceção como seu único argumento e retorna verdadeiro para a exceção que deve estar no subgrupo.

source: The nesting structure of the current exception is preserved in the result, as are the values of its :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields. Empty nested groups are omitted from the result.
pt_br: A estrutura de aninhamento da exceção atual é preservada no resultado, assim como os valores de seus campos :attr:`message`, :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` e :attr:`~BaseException.__notes__`. Grupos aninhados vazios são omitidos do resultado.

source: The condition is checked for all exceptions in the nested exception group, including the top-level and any nested exception groups. If the condition is true for such an exception group, it is included in the result in full.
pt_br: A condição é verificada para todas as exceções no grupo de exceções aninhadas, incluindo o nível superior e quaisquer grupos de exceções aninhadas. Se a condição for verdadeira para tal grupo de exceções, ela será incluída no resultado por completo.

source: ``condition`` can be any callable which is not a type object.
pt_br: ``condition`` pode ser qualquer chamável que não seja um objeto de tipo.

source: Like :meth:`subgroup`, but returns the pair ``(match, rest)`` where ``match`` is ``subgroup(condition)`` and ``rest`` is the remaining non-matching part.
pt_br: Como :meth:`subgroup`, mas retorna o par ``(match, rest)`` onde ``match`` é ``subgroup(condition)`` e ``rest`` é a parte restante não correspondente.

source: Returns an exception group with the same :attr:`message`, but which wraps the exceptions in ``excs``.
pt_br: Retorna um grupo de exceções com o mesmo :attr:`message`, mas que agrupa as exceções em ``excs``.

source: This method is used by :meth:`subgroup` and :meth:`split`, which are used in various contexts to break up an exception group. A subclass needs to override it in order to make :meth:`subgroup` and :meth:`split` return instances of the subclass rather than :exc:`ExceptionGroup`.
pt_br: Este método é usado por :meth:`subgroup` e :meth:`split`, que são usados em vários contextos para dividir um grupo de exceções. Uma subclasse precisa substituí-la para fazer com que :meth:`subgroup` e :meth:`split` retorne instâncias da subclasse em vez de :exc:`ExceptionGroup`.

source: :meth:`subgroup` and :meth:`split` copy the :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` and :attr:`~BaseException.__notes__` fields from the original exception group to the one returned by :meth:`derive`, so these fields do not need to be updated by :meth:`derive`.
pt_br: :meth:`subgroup` e :meth:`split` copiam os campos :attr:`~BaseException.__traceback__`, :attr:`~BaseException.__cause__`, :attr:`~BaseException.__context__` e :attr:`~BaseException.__notes__` do grupo de exceções original para o retornado por :meth:`derive`, então esses campos não precisam ser atualizados por :meth:`derive`. ::

source: Note that :exc:`BaseExceptionGroup` defines :meth:`~object.__new__`, so subclasses that need a different constructor signature need to override that rather than :meth:`~object.__init__`. For example, the following defines an exception group subclass which accepts an exit_code and constructs the group's message from it. ::
pt_br: Observe que :exc:`BaseExceptionGroup` define :meth:`~object.__new__`, então subclasses que precisam de uma assinatura de construtor diferente precisam substituir isso ao invés de :meth:`~object.__init__`. Por exemplo, o seguinte define uma subclasse de grupo de exceções que aceita um exit_code e constrói a mensagem do grupo a partir dele. ::

source: Like :exc:`ExceptionGroup`, any subclass of :exc:`BaseExceptionGroup` which is also a subclass of :exc:`Exception` can only wrap instances of :exc:`Exception`.
pt_br: Como :exc:`ExceptionGroup`, qualquer subclasse de :exc:`BaseExceptionGroup` que também é uma subclasse de :exc:`Exception` só pode agrupar instâncias de :exc:`Exception`.

source: Exception hierarchy
pt_br: Hierarquia das exceções

source: The class hierarchy for built-in exceptions is:
pt_br: A hierarquia de classes para exceções embutidas é:

source: statement
pt_br: instrução

source: exception
pt_br: exceção

source: chaining
pt_br: encadeamento

source: __cause__ (exception attribute)
pt_br: __cause__ (atributo de exceção)

source: __context__ (exception attribute)
pt_br: __context__ (atributo de exceção)

source: __suppress_context__ (exception attribute)
pt_br: __suppress_context__ (atributo de exceção)

source: module
pt_br: módulo
