Repository: python/python-docs-pt-br
Catalog: library/exceptions.po
Languages: pt_br

source: Built-in Exceptions
pt_br: Exceções embutidas

source: In Python, all exceptions must be instances of a class that derives from :class:`BaseException`. In a :keyword:`try` statement with an :keyword:`except` clause that mentions a particular class, that clause also handles any exception classes derived from that class (but not exception classes from which *it* is derived). Two exception classes that are not related via subclassing are never equivalent, even if they have the same name.
pt_br: No Python, todas as exceções devem ser instâncias de uma classe derivada de :class:`BaseException`. Em uma instrução :keyword:`try` com uma cláusula :keyword:`except` que menciona uma classe específica, essa cláusula também lida com qualquer classe de exceção derivada dessa classe (mas não com as classes de exceção a partir das quais *ela* é derivada). Duas classes de exceção que não são relacionadas por subclasse nunca são equivalentes, mesmo que tenham o mesmo nome.

source: The built-in exceptions listed in this chapter can be generated by the interpreter or built-in functions. Except where mentioned, they have an "associated value" indicating the detailed cause of the error. This may be a string or a tuple of several items of information (e.g., an error code and a string explaining the code). The associated value is usually passed as arguments to the exception class's constructor.
pt_br: As exceções embutidas listadas neste capítulo podem ser geradas pelo interpretador ou pelas funções embutidas. Exceto onde mencionado, eles têm um "valor associado" indicando a causa detalhada do erro. Pode ser uma string ou uma tupla de vários itens de informação (por exemplo, um código de erro e uma string que explica o código). O valor associado geralmente é passado como argumentos para o construtor da classe de exceção.

source: User code can raise built-in exceptions. This can be used to test an exception handler or to report an error condition "just like" the situation in which the interpreter raises the same exception; but beware that there is nothing to prevent user code from raising an inappropriate error.
pt_br: O código do usuário pode gerar exceções embutidas. Isso pode ser usado para testar um manipulador de exceções ou para relatar uma condição de erro "exatamente como" a situação na qual o interpretador gera a mesma exceção; mas lembre-se de que nada impede o código do usuário de gerar um erro inadequado.

source: The built-in exception classes can be subclassed to define new exceptions; programmers are encouraged to derive new exceptions from the :exc:`Exception` class or one of its subclasses, and not from :exc:`BaseException`. More information on defining exceptions is available in the Python Tutorial under :ref:`tut-userexceptions`.
pt_br: As classes de exceções embutidas podem ser usadas como subclasses para definir novas exceções; Os programadores são incentivados a derivar novas exceções da classe :exc:`Exception` ou de uma de suas subclasses, e não de :exc:`BaseException`. Mais informações sobre a definição de exceções estão disponíveis no Tutorial do Python em :ref:`tut-userexceptions`.

source: Exception context
pt_br: Contexto da exceção

source: Three attributes on exception objects provide information about the context in which the exception was raised:
pt_br: Três atributos em objetos exceções fornecem informações sobre o contexto em que a exceção foi levantada.

source: When raising a new exception while another exception is already being handled, the new exception's :attr:`!__context__` attribute is automatically set to the handled exception. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used.
pt_br: Ao levantar uma nova exceção enquanto outra exceção já está sendo tratada, o atributo :attr:`!__context__` da nova exceção é automaticamente definido para a exceção tratada. Uma exceção pode ser tratada quando uma cláusula :keyword:`except` ou :keyword:`finally`, ou uma instrução :keyword:`with`, é usada.

source: This implicit exception context can be supplemented with an explicit cause by using :keyword:`!from` with :keyword:`raise`::
pt_br: Esse contexto implícito da exceção pode ser complementado com uma causa explícita usando :keyword:`!from` com :keyword:`raise`::

source: The expression following :keyword:`from<raise>` must be an exception or ``None``. It will be set as :attr:`!__cause__` on the raised exception. Setting :attr:`!__cause__` also implicitly sets the :attr:`!__suppress_context__` attribute to ``True``, so that using ``raise new_exc from None`` effectively replaces the old exception with the new one for display purposes (e.g. converting :exc:`KeyError` to :exc:`AttributeError`), while leaving the old exception available in :attr:`!__context__` for introspection when debugging.
pt_br: A expressão a seguir :keyword:`from<raise>` deve ser uma exceção ou ``None``. Ela será definida como :attr:`!__cause__` na exceção levantada. A definição de :attr:`!__cause__` também define implicitamente o atributo :attr:`!__suppress_context__` como ``True``, de modo que o uso de ``raise new_exc from None`` substitui efetivamente a exceção antiga pela nova para fins de exibição (por exemplo, convertendo :exc:`KeyError` para :exc:`AttributeError`), deixando a exceção antiga disponível em :attr:`!__context__` para introspecção durante a depuração.

source: The default traceback display code shows these chained exceptions in addition to the traceback for the exception itself. An explicitly chained exception in :attr:`!__cause__` is always shown when present. An implicitly chained exception in :attr:`!__context__` is shown only if :attr:`!__cause__` is :const:`None` and :attr:`!__suppress_context__` is false.
pt_br: O código de exibição padrão do traceback mostra essas exceções encadeadas, além do traceback da própria exceção. Uma exceção explicitamente encadeada em :attr:`!__cause__` sempre é mostrada quando presente. Uma exceção implicitamente encadeada em :attr:`!__context__` é mostrada apenas se :attr:`!__cause__` for :const:`None` e :attr:`!__suppress_context__` for falso.

source: In either case, the exception itself is always shown after any chained exceptions so that the final line of the traceback always shows the last exception that was raised.
pt_br: Em qualquer um dos casos, a exceção em si sempre é mostrada após todas as exceções encadeadas, de modo que a linha final do traceback sempre mostre a última exceção que foi levantada.

source: Inheriting from built-in exceptions
pt_br: Herdando de exceções embutidas

source: User code can create subclasses that inherit from an exception type. It's recommended to only subclass one exception type at a time to avoid any possible conflicts between how the bases handle the ``args`` attribute, as well as due to possible memory layout incompatibilities.
pt_br: O código do usuário pode criar subclasses que herdam de um tipo de exceção. É recomendado criar subclasse de apenas um tipo de exceção por vez para evitar possíveis conflitos entre como as bases tratam o atributo ``args``, bem como devido a possíveis incompatibilidades de layout de memória.

source: Most built-in exceptions are implemented in C for efficiency, see: :source:`Objects/exceptions.c`. Some have custom memory layouts which makes it impossible to create a subclass that inherits from multiple exception types. The memory layout of a type is an implementation detail and might change between Python versions, leading to new conflicts in the future. Therefore, it's recommended to avoid subclassing multiple exception types altogether.
pt_br: A maioria das exceções embutidas são implementadas em C para eficiência, veja: :source:`Objects/exceptions.c`. Algumas têm layouts de memória personalizados, o que impossibilita a criação de uma subclasse que herda de vários tipos de exceção. O layout de memória de um tipo é um detalhe de implementação e pode mudar entre as versões do Python, levando a novos conflitos no futuro. Portanto, é recomendável evitar criar subclasses de vários tipos de exceção.

source: Base classes
pt_br: Classes base

source: The following exceptions are used mostly as base classes for other exceptions.
pt_br: As seguintes exceções são usadas principalmente como classes base para outras exceções.

source: The base class for all built-in exceptions. It is not meant to be directly inherited by user-defined classes (for that, use :exc:`Exception`). If :func:`str` is called on an instance of this class, the representation of the argument(s) to the instance are returned, or the empty string when there were no arguments.
pt_br: A classe base para todas as exceções embutidas. Não é para ser herdada diretamente por classes definidas pelo usuário (para isso, use :exc:`Exception`). Se :func:`str` for chamado em uma instância desta classe, a representação do(s) argumento(s) para a instância será retornada ou a string vazia quando não houver argumentos.

source: The tuple of arguments given to the exception constructor. Some built-in exceptions (like :exc:`OSError`) expect a certain number of arguments and assign a special meaning to the elements of this tuple, while others are usually called only with a single string giving an error message.
pt_br: A tupla de argumentos fornecidos ao construtor de exceções. Algumas exceções embutidas (como :exc:`OSError`) esperam um certo número de argumentos e atribuem um significado especial aos elementos dessa tupla, enquanto outras são normalmente chamadas apenas com uma única string que fornece uma mensagem de erro.

source: This method sets *tb* as the new traceback for the exception and returns the exception object. It was more commonly used before the exception chaining features of :pep:`3134` became available. The following example shows how we can convert an instance of ``SomeException`` into an instance of ``OtherException`` while preserving the traceback. Once raised, the current frame is pushed onto the traceback of the ``OtherException``, as would have happened to the traceback of the original ``SomeException`` had we allowed it to propagate to the caller. ::
pt_br: Este método define *tb* como o novo traceback (situação da pilha de execução) para a exceção e retorna o objeto exceção. Era mais comumente usado antes que os recursos de encadeamento de exceções de :pep:`3134` se tornassem disponíveis. O exemplo a seguir mostra como podemos converter uma instância de ``SomeException`` em uma instância de ``OtherException`` enquanto preservamos o traceback. Uma vez gerado, o quadro atual é empurrado para o traceback de ``OtherException``, como teria acontecido com o traceback de ``SomeException`` original se tivéssemos permitido que ele se propagasse para o chamador. ::

source: A writable field that holds the :ref:`traceback object <traceback-objects>` associated with this exception. See also: :ref:`raise`.
pt_br: Um campo gravável que contém o :ref:`objeto traceback <traceback-objects>` associado a esta exceção. Veja também: :ref:`raise`.

source: Add the string ``note`` to the exception's notes which appear in the standard traceback after the exception string. A :exc:`TypeError` is raised if ``note`` is not a string.
pt_br: Adiciona a string ``note`` às notas da exceção que aparecem no traceback padrão após a string de exceção. Uma exceção :exc:`TypeError` é levantada se ``note`` não for uma string.

source: A list of the notes of this exception, which were added with :meth:`add_note`. This attribute is created when :meth:`add_note` is called.
pt_br: Uma lista das notas desta exceção, que foram adicionadas com :meth:`add_note`. Este atributo é criado quando :meth:`add_note` é chamado.

source: All built-in, non-system-exiting exceptions are derived from this class. All user-defined exceptions should also be derived from this class.
pt_br: Todas as exceções embutidas que não saem para o sistema são derivadas dessa classe. Todas as exceções definidas pelo usuário também devem ser derivadas dessa classe.

source: The base class for those built-in exceptions that are raised for various arithmetic errors: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.
pt_br: A classe base para as exceções embutidas levantadas para vários erros aritméticos: :exc:`OverflowError`, :exc:`ZeroDivisionError`, :exc:`FloatingPointError`.

source: Raised when a :ref:`buffer <bufferobjects>` related operation cannot be performed.
pt_br: Levantado quando uma operação relacionada a :ref:`buffer <bufferobjects>` não puder ser realizada.

source: The base class for the exceptions that are raised when a key or index used on a mapping or sequence is invalid: :exc:`IndexError`, :exc:`KeyError`. This can be raised directly by :func:`codecs.lookup`.
pt_br: A classe base para as exceções levantadas quando uma chave ou índice usado em um mapeamento ou sequência é inválido: :exc:`IndexError`, :exc:`KeyError`. Isso pode ser levantado diretamente por :func:`codecs.lookup`.

source: Concrete exceptions
pt_br: Exceções concretas

source: The following exceptions are the exceptions that are usually raised.
pt_br: As seguintes exceções são as que geralmente são levantados.

source: Raised when an :keyword:`assert` statement fails.
pt_br: Levantado quando uma instrução :keyword:`assert` falha.

source: Raised when an attribute reference (see :ref:`attribute-references`) or assignment fails. (When an object does not support attribute references or attribute assignments at all, :exc:`TypeError` is raised.)
pt_br: Levantado quando uma referência de atributo (consulte :ref:`attribute-references`) ou atribuição falha. (Quando um objeto não oferece suporte a referências ou atribuições de atributos, :exc:`TypeError` é levantado.)

source: The optional *name* and *obj* keyword-only arguments set the corresponding attributes:
pt_br: O argumentos somente-nomeados opcionais *name* e o *obj* definem o atributos correspondente:

source: The name of the attribute that was attempted to be accessed.
pt_br: O nome do atributo que tentou-se fazer o acesso.

source: The object that was accessed for the named attribute.
pt_br: O objeto que foi acessado para o atributo nomeado.

source: Added the :attr:`name` and :attr:`obj` attributes.
pt_br: Adicionado os atributos :attr:`name` e :attr:`obj`.

source: Raised when the :func:`input` function hits an end-of-file condition (EOF) without reading any data. (Note: the :meth:`!io.IOBase.read` and :meth:`io.IOBase.readline` methods return an empty string when they hit EOF.)
pt_br: Levantado quando a função :func:`input` atinge uma condição de fim de arquivo (EOF) sem ler nenhum dado. (Note: os métodos :meth:`!io.IOBase.read` e :meth:`io.IOBase.readline` retornam uma string vazia quando pressionam o EOF.)

source: Not currently used.
pt_br: Não usado atualmente.

source: Raised when a :term:`generator` or :term:`coroutine` is closed; see :meth:`generator.close` and :meth:`coroutine.close`. It directly inherits from :exc:`BaseException` instead of :exc:`Exception` since it is technically not an error.
pt_br: Levantado quando um :term:`gerador` ou uma :term:`corrotina` está fechado(a); veja :meth:`generator.close` e :meth:`coroutine.close`. Herda diretamente de :exc:`BaseException` em vez de :exc:`Exception`, já que tecnicamente não é um erro.

source: Raised when the :keyword:`import` statement has troubles trying to load a module. Also raised when the "from list" in ``from ... import`` has a name that cannot be found.
pt_br: Levantada quando a instrução :keyword:`import` tem problemas ao tentar carregar um módulo. Também é gerado quando o "from list" em ``from ... import`` tem um nome que não pode ser encontrado.

source: The optional *name* and *path* keyword-only arguments set the corresponding attributes:
pt_br: O argumentos somente-nomeados opcionais *name* e o *path* definem o atributos correspondente:

source: The name of the module that was attempted to be imported.
pt_br: O nome do módulo que tentou-se fazer a importação.

source: The path to any file which triggered the exception.
pt_br: O caminho para qualquer arquivo que acionou a exceção.

source: Added the :attr:`name` and :attr:`path` attributes.
pt_br: Adicionados os atributos :attr:`name` e :attr:`path`.

source: A subclass of :exc:`ImportError` which is raised by :keyword:`import` when a module could not be located. It is also raised when ``None`` is found in :data:`sys.modules`.
pt_br: Uma subclasse de :exc:`ImportError` que é levantada por :keyword:`import` quando um módulo não pôde ser localizado. Também é levantada quando ``None`` é encontrado em :data:`sys.modules`.

source: Raised when a sequence subscript is out of range. (Slice indices are silently truncated to fall in the allowed range; if an index is not an integer, :exc:`TypeError` is raised.)
pt_br: Levantada quando um índice de alguma sequência está fora do intervalo. (Índices de fatia são truncados silenciosamente para cair num intervalo permitido; se um índice não for um inteiro, :exc:`TypeError` é levantada.)

source: Raised when a mapping (dictionary) key is not found in the set of existing keys.
pt_br: Levantada quando uma chave de mapeamento (dicionário) não é encontrada no conjunto de chaves existentes.

source: Raised when the user hits the interrupt key (normally :kbd:`Control-C` or :kbd:`Delete`). During execution, a check for interrupts is made regularly. The exception inherits from :exc:`BaseException` so as to not be accidentally caught by code that catches :exc:`Exception` and thus prevent the interpreter from exiting.
pt_br: Levantada quando um usuário aperta a tecla de interrupção (normalmente :kbd:`Control-C` ou :kbd:`Delete`). Durante a execução, uma checagem de interrupção é feita regularmente. A exceção herda de :exc:`BaseException` para que não seja capturada acidentalmente por códigos que tratam :exc:`Exception` e assim evita que o interpretador saia.

source: Catching a :exc:`KeyboardInterrupt` requires special consideration. Because it can be raised at unpredictable points, it may, in some circumstances, leave the running program in an inconsistent state. It is generally best to allow :exc:`KeyboardInterrupt` to end the program as quickly as possible or avoid raising it entirely. (See :ref:`handlers-and-exceptions`.)
pt_br: Capturar uma :exc:`KeyboardInterrupt` requer consideração especial. Como pode ser levantada em pontos imprevisíveis, pode, em algumas circunstâncias, deixar o programa em execução em um estado inconsistente. Geralmente é melhor permitir que :exc:`KeyboardInterrupt` termine o programa o mais rápido possível ou evitar levantá-la de todo. (Veja :ref:`handlers-and-exceptions`.)

source: Raised when an operation runs out of memory but the situation may still be rescued (by deleting some objects). The associated value is a string indicating what kind of (internal) operation ran out of memory. Note that because of the underlying memory management architecture (C's :c:func:`malloc` function), the interpreter may not always be able to completely recover from this situation; it nevertheless raises an exception so that a stack traceback can be printed, in case a run-away program was the cause.
pt_br: Levantada quando uma operação fica sem memória mas a situação ainda pode ser recuperada (excluindo alguns objetos). O valor associado é uma string que indica o tipo de operação (interna) que ficou sem memória. Observe que, por causa da arquitetura de gerenciamento de memória subjacente (função :c:func:`malloc` do C), o interpretador pode não ser capaz de se recuperar completamente da situação; no entanto, levanta uma exceção para que um traceback possa ser impresso, no caso de um outro programa ser a causa.

source: Raised when a local or global name is not found. This applies only to unqualified names. The associated value is an error message that includes the name that could not be found.
pt_br: Levantada quando um nome local ou global não é encontrado. Isso se aplica apenas a nomes não qualificados. O valor associado é uma mensagem de erro que inclui o nome que não pode ser encontrado.

source: The optional *name* keyword-only argument sets the attribute:
pt_br: O argumento somente-nomeado opcional *name* define o atributo:

source: The name of the variable that was attempted to be accessed.
pt_br: O nome do variável que tentou-se fazer o acesso.

source: Added the :attr:`name` attribute.
pt_br: Adicionado o atributo :attr:`name`.

source: This exception is derived from :exc:`RuntimeError`. In user defined base classes, abstract methods should raise this exception when they require derived classes to override the method, or while the class is being developed to indicate that the real implementation still needs to be added.
pt_br: Essa exceção é derivada da :exc:`RuntimeError`. Em classes base, definidas pelo usuário, os métodos abstratos devem gerar essa exceção quando requerem que classes derivadas substituam o método, ou enquanto a classe está sendo desenvolvida, para indicar que a implementação real ainda precisa ser adicionada.

source: It should not be used to indicate that an operator or method is not meant to be supported at all -- in that case either leave the operator / method undefined or, if a subclass, set it to :data:`None`.
pt_br: Não deve ser usada para indicar que um operador ou método não será mais suportado -- nesse caso deixe o operador / método indefinido ou, se é uma subclasse, defina-o como :data:`None`.

source: :exc:`!NotImplementedError` and :data:`!NotImplemented` are not interchangeable. This exception should only be used as described above; see :data:`NotImplemented` for details on correct usage of the built-in constant.
pt_br: :exc:`!NotImplementedError` e :data:`!NotImplemented` não são intercambiáveis. Esta exceção deve ser usada somente conforme descrito acima; veja :data:`NotImplemented` para detalhes sobre o uso correto da constante embutida.

source: This exception is raised when a system function returns a system-related error, including I/O failures such as "file not found" or "disk full" (not for illegal argument types or other incidental errors).
pt_br: Esta exceção é levantada quando uma função do sistema retorna um erro relacionado ao sistema, incluindo falhas do tipo E/S como "file not found" ou "disk full" (não para tipos de argumentos não permitidos ou outro erro acessório).

source: The second form of the constructor sets the corresponding attributes, described below. The attributes default to :const:`None` if not specified. For backwards compatibility, if three arguments are passed, the :attr:`~BaseException.args` attribute contains only a 2-tuple of the first two constructor arguments.
pt_br: A segunda forma do construtor definir os atributos correspondentes, descritos abaixo. Os atributos usarão o valor padrão :const:`None` se não forem especificados. Por compatibilidade com versões anteriores, se três argumentos são passados, o atributo :attr:`~BaseException.args` contêm somente uma tupla de 2 elementos, os dois primeiros argumentos do construtor.

source: The constructor often actually returns a subclass of :exc:`OSError`, as described in `OS exceptions`_ below. The particular subclass depends on the final :attr:`.errno` value. This behaviour only occurs when constructing :exc:`OSError` directly or via an alias, and is not inherited when subclassing.
pt_br: O construtor geralmente retorna uma subclasse de :exc:`OSError`, como descrito abaixo em `OS exceptions`_ . A subclasse particular depende do valor final de :attr:`.errno`. Este comportamento ocorre apenas durante a construção direta ou por meio de um apelido de :exc:`OSError`, e não é herdado na criação de subclasses.

source: A numeric error code from the C variable :c:data:`errno`.
pt_br: Um código de erro numérico da variável C :c:data:`errno`.
