Repository: python/python-docs-pt-br
Catalog: library/exceptions.po
Languages: pt_br

source: Under Windows, this gives you the native Windows error code. The :attr:`.errno` attribute is then an approximate translation, in POSIX terms, of that native error code.
pt_br: No Windows, isso fornece o código de erro nativo do Windows. O atributo :attr:`.errno` é então uma tradução aproximada, em termos POSIX, desse código de erro nativo.

source: Under Windows, if the *winerror* constructor argument is an integer, the :attr:`.errno` attribute is determined from the Windows error code, and the *errno* argument is ignored. On other platforms, the *winerror* argument is ignored, and the :attr:`winerror` attribute does not exist.
pt_br: No Windows, se o argumento de construtor *winerror* for um inteiro, o atributo :attr:`.errno` é determinado a partir do código de erro do Windows e o argumento *errno* é ignorado. Em outras plataformas, o argumento *winerror* é ignorado e o atributo :attr:`winerror` não existe.

source: The corresponding error message, as provided by the operating system. It is formatted by the C functions :c:func:`!perror` under POSIX, and :c:func:`!FormatMessage` under Windows.
pt_br: A mensagem de erro correspondente, conforme fornecida pelo sistema operacional. É formatada pelas funções C :c:func:`!perror` no POSIX e :c:func:`!FormatMessage` no Windows.

source: For exceptions that involve a file system path (such as :func:`open` or :func:`os.unlink`), :attr:`filename` is the file name passed to the function. For functions that involve two file system paths (such as :func:`os.rename`), :attr:`filename2` corresponds to the second file name passed to the function.
pt_br: Para exceções que envolvem um caminho do sistema de arquivos (como :func:`open` ou :func:`os.unlink`), :attr:`filename` é o nome do arquivo passado para a função. Para funções que envolvem dois caminhos de sistema de arquivos (como :func:`os.rename`), :attr:`filename2` corresponde ao segundo nome de arquivo passado para a função.

source: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` and :exc:`!mmap.error` have been merged into :exc:`OSError`, and the constructor may return a subclass.
pt_br: :exc:`EnvironmentError`, :exc:`IOError`, :exc:`WindowsError`, :exc:`socket.error`, :exc:`select.error` e :exc:`!mmap.error` foram fundidos em :exc:`OSError`, e o construtor pode retornar uma subclasse.

source: The :attr:`filename` attribute is now the original file name passed to the function, instead of the name encoded to or decoded from the :term:`filesystem encoding and error handler`. Also, the *filename2* constructor argument and attribute was added.
pt_br: O atributo :attr:`filename` agora é o nome do arquivo original passado para a função, ao invés do nome codificado ou decodificado da :term:`tratador de erros e codificação do sistema de arquivos`. Além disso, o argumento e o atributo de construtor *filename2* foi adicionado.

source: Raised when the result of an arithmetic operation is too large to be represented. This cannot occur for integers (which would rather raise :exc:`MemoryError` than give up). However, for historical reasons, OverflowError is sometimes raised for integers that are outside a required range. Because of the lack of standardization of floating-point exception handling in C, most floating-point operations are not checked.
pt_br: Levantada quando o resultado de uma operação aritmética é muito grande para ser representada. Isso não pode ocorrer para inteiros (que prefere levantar :exc:`MemoryError` a desistir). No entanto, por motivos históricos, OverflowError às vezes é levantada para inteiros que estão fora de um intervalo obrigatório. Devido à falta de padronização do tratamento de exceção de ponto flutuante em C, a maioria das operações de ponto flutuante não são verificadas.

source: This exception is derived from :exc:`RuntimeError`. It is raised when an operation is blocked during interpreter shutdown also known as :term:`Python finalization <interpreter shutdown>`.
pt_br: Este exceção é derivada de :exc:`RuntimeError`. É levantada quando uma operação é bloqueada durante o encerramento do interpretador e também conhecido como :term:`finalização do Python <interpreter shutdown>`.

source: Examples of operations which can be blocked with a :exc:`PythonFinalizationError` during the Python finalization:
pt_br: Exemplos de operações que podem ser bloqueadas com um :exc:`PythonFinalizationError` durante a finalização do Python:

source: Creating a new Python thread.
pt_br: Criação de uma nova thread no Python.

source: :meth:`Joining <threading.Thread.join>` a running daemon thread.
pt_br: :meth:`União <threading.Thread.join>` de uma thread de daemon em execução.

source: See also the :func:`sys.is_finalizing` function.
pt_br: Veja também a função :func:`sys.is_finalizing`.

source: Previously, a plain :exc:`RuntimeError` was raised.
pt_br: Anteriormente, uma :exc:`RuntimeError` simples era levantada.

source: :meth:`threading.Thread.join` can now raise this exception.
pt_br: :meth:`threading.Thread.join` pode agora levantar essa exceção.

source: This exception is derived from :exc:`RuntimeError`. It is raised when the interpreter detects that the maximum recursion depth (see :func:`sys.getrecursionlimit`) is exceeded.
pt_br: Esta exceção é derivada de :exc:`RuntimeError`. É levantada quando o interpretador detecta que a profundidade máxima de recursão (veja :func:`sys.getrecursionlimit`) foi excedida.

source: This exception is raised when a weak reference proxy, created by the :func:`weakref.proxy` function, is used to access an attribute of the referent after it has been garbage collected. For more information on weak references, see the :mod:`weakref` module.
pt_br: Esta exceção é levantada quando um intermediário de referência fraca, criado pela função :func:`weakref.proxy`, é usado para acessar um atributo do referente após ter sido coletado como lixo. Para mais informações sobre referências fracas, veja o módulo :mod:`weakref`.

source: Raised when an error is detected that doesn't fall in any of the other categories. The associated value is a string indicating what precisely went wrong.
pt_br: Levantada quando um erro é detectado e não se encaixa em nenhuma das outras categorias. O valor associado é uma string indicando o que precisamente deu errado.

source: Raised by built-in function :func:`next` and an :term:`iterator`\'s :meth:`~iterator.__next__` method to signal that there are no further items produced by the iterator.
pt_br: Levantada pela função embutida :func:`next` e o método :meth:`~iterator.__next__` de um :term:`iterador` para sinalizar que não há mais itens produzidos pelo iterador.

source: The exception object has a single attribute :attr:`!value`, which is given as an argument when constructing the exception, and defaults to :const:`None`.
pt_br: O objeto exceção tem um único atributo :attr:`!value`, que é fornecido como um argumento ao construir a exceção, e o padrão é :const:`None`.

source: When a :term:`generator` or :term:`coroutine` function returns, a new :exc:`StopIteration` instance is raised, and the value returned by the function is used as the :attr:`value` parameter to the constructor of the exception.
pt_br: Quando uma função :term:`geradora <gerador>` ou :term:`corrotina` retorna, uma nova instância :exc:`StopIteration` é levantada, e o valor retornado pela função é usado como o parâmetro :attr:`value` para o construtor da exceção.

source: If a generator code directly or indirectly raises :exc:`StopIteration`, it is converted into a :exc:`RuntimeError` (retaining the :exc:`StopIteration` as the new exception's cause).
pt_br: Se um código gerador direta ou indiretamente levantar :exc:`StopIteration`, ele é convertido em uma :exc:`RuntimeError` (mantendo o :exc:`StopIteration` como a nova causa da exceção).

source: Added ``value`` attribute and the ability for generator functions to use it to return a value.
pt_br: Adicionado o atributo ``value`` e a capacidade das funções geradoras de usá-lo para retornar um valor.

source: Introduced the RuntimeError transformation via ``from __future__ import generator_stop``, see :pep:`479`.
pt_br: Introduzida a transformação RuntimeError via ``from __future__ import generator_stop``, consulte :pep:`479`.

source: Enable :pep:`479` for all code by default: a :exc:`StopIteration` error raised in a generator is transformed into a :exc:`RuntimeError`.
pt_br: Habilita :pep:`479` para todo o código por padrão: um erro :exc:`StopIteration` levantado em um gerador é transformado em uma :exc:`RuntimeError`.

source: Must be raised by :meth:`~object.__anext__` method of an :term:`asynchronous iterator` object to stop the iteration.
pt_br: Deve ser levantada pelo método :meth:`~object.__anext__` de um objeto :term:`iterador assíncrono` para parar a iteração.

source: Raised when the parser encounters a syntax error. This may occur in an :keyword:`import` statement, in a call to the built-in functions :func:`compile`, :func:`exec`, or :func:`eval`, or when reading the initial script or standard input (also interactively).
pt_br: Levantada quando o analisador encontra um erro de sintaxe. Isso pode ocorrer em uma instrução :keyword:`import`, em uma chamada às funções embutidas :func:`compile`, :func:`exec` ou :func:`eval`, ou ao ler o script inicial ou entrada padrão (também interativamente).

source: The :func:`str` of the exception instance returns only the error message. Details is a tuple whose members are also available as separate attributes.
pt_br: A função :func:`str` da instância de exceção retorna apenas a mensagem de erro. Detalhes é uma tupla cujos membros também estão disponíveis como atributos separados.

source: The name of the file the syntax error occurred in.
pt_br: O nome do arquivo em que ocorreu o erro de sintaxe.

source: Which line number in the file the error occurred in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
pt_br: Em qual número de linha no arquivo o erro ocorreu. Este é indexado em 1: a primeira linha no arquivo tem um ``lineno`` de 1.

source: The column in the line where the error occurred. This is 1-indexed: the first character in the line has an ``offset`` of 1.
pt_br: A coluna da linha em que ocorreu o erro. Este é indexado em 1: o primeiro caractere na linha tem um ``offset`` de 1.

source: The source code text involved in the error.
pt_br: O texto do código-fonte envolvido no erro.

source: Which line number in the file the error occurred ends in. This is 1-indexed: the first line in the file has a ``lineno`` of 1.
pt_br: Em qual número de linha no arquivo o erro ocorrido termina. Este é indexado em 1: a primeira linha no arquivo tem um ``lineno`` de 1.

source: The column in the end line where the error occurred finishes. This is 1-indexed: the first character in the line has an ``offset`` of 1.
pt_br: A coluna da linha final em que erro ocorrido finaliza Este é indexado em 1: o primeiro caractere na linha tem um ``offset`` de 1.

source: For errors in f-string fields, the message is prefixed by "f-string: " and the offsets are offsets in a text constructed from the replacement expression. For example, compiling f'Bad {a b} field' results in this args attribute: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).
pt_br: Para erros em campos de f-string, a mensagem é prefixada por "f-string: " e os "offsets" são deslocamentos em um texto construído a partir da expressão de substituição. Por exemplo, compilar o campo f'Bad {a b}' resulta neste atributo de argumentos: ('f-string: ...', ('', 1, 2, '(a b)\n', 1, 5)).

source: Added the :attr:`end_lineno` and :attr:`end_offset` attributes.
pt_br: Adicionado os atributos :attr:`end_lineno` e :attr:`end_offset`.

source: Base class for syntax errors related to incorrect indentation. This is a subclass of :exc:`SyntaxError`.
pt_br: Classe base para erros de sintaxe relacionados a indentação incorreta. Esta é uma subclasse de :exc:`SyntaxError`.

source: Raised when indentation contains an inconsistent use of tabs and spaces. This is a subclass of :exc:`IndentationError`.
pt_br: Levantada quando o indentação contém um uso inconsistente de tabulações e espaços. Esta é uma subclasse de :exc:`IndentationError`.

source: Raised when the interpreter finds an internal error, but the situation does not look so serious to cause it to abandon all hope. The associated value is a string indicating what went wrong (in low-level terms). In :term:`CPython`, this could be raised by incorrectly using Python's C API, such as returning a ``NULL`` value without an exception set.
pt_br: Levantada quando o interpretador encontra um erro interno, mas a situação não parece tão grave para fazer com que perca todas as esperanças. O valor associado é uma string que indica o que deu errado (em termos de baixo nível). Em :term:`CPython`, isso pode ser causado pelo uso incorreto da API C do Python, como retornar um valor ``NULL`` sem um conjunto de exceções.

source: If you're confident that this exception wasn't your fault, or the fault of a package you're using, you should report this to the author or maintainer of your Python interpreter. Be sure to report the version of the Python interpreter (``sys.version``; it is also printed at the start of an interactive Python session), the exact error message (the exception's associated value) and if possible the source of the program that triggered the error.
pt_br: Se você tem certeza de que essa exceção não foi culpa sua ou de um pacote que você está usando, você deve relatar isso ao autor ou mantenedor do seu interpretador Python. Certifique-se de relatar a versão do interpretador Python (``sys.version``; também é impresso no início de uma sessão Python interativa), a mensagem de erro exata (o valor associado da exceção) e se possível a fonte do programa que acionou o erro.

source: This exception is raised by the :func:`sys.exit` function. It inherits from :exc:`BaseException` instead of :exc:`Exception` so that it is not accidentally caught by code that catches :exc:`Exception`. This allows the exception to properly propagate up and cause the interpreter to exit. When it is not handled, the Python interpreter exits; no stack traceback is printed. The constructor accepts the same optional argument passed to :func:`sys.exit`. If the value is an integer, it specifies the system exit status (passed to C's :c:func:`!exit` function); if it is ``None``, the exit status is zero; if it has another type (such as a string), the object's value is printed and the exit status is one.
pt_br: Esta exceção é levantada pela função :func:`sys.exit`. Ele herda de :exc:`BaseException` em vez de :exc:`Exception` para que não seja acidentalmente capturado pelo código que captura :exc:`Exception`. Isso permite que a exceção se propague corretamente e faça com que o interpretador saia. Quando não é tratado, o interpretador Python sai; nenhum traceback (situação da pilha de execução) é impresso. O construtor aceita o mesmo argumento opcional passado para :func:`sys.exit`. Se o valor for um inteiro, ele especifica o status de saída do sistema (passado para a função C :c:func:`!exit`); se for ``None``, o status de saída é zero; se tiver outro tipo (como uma string), o valor do objeto é exibido e o status de saída é um.

source: A call to :func:`sys.exit` is translated into an exception so that clean-up handlers (:keyword:`finally` clauses of :keyword:`try` statements) can be executed, and so that a debugger can execute a script without running the risk of losing control. The :func:`os._exit` function can be used if it is absolutely positively necessary to exit immediately (for example, in the child process after a call to :func:`os.fork`).
pt_br: Uma chamada para :func:`sys.exit` é traduzida em uma exceção para que os tratadores de limpeza (cláusulas :keyword:`finally` das instruções :keyword:`try`) possam ser executados, e para que um depurador possa executar um script sem correr o risco de perder o controle. A função :func:`os._exit` pode ser usada se for absolutamente necessário sair imediatamente (por exemplo, no processo filho após uma chamada para :func:`os.fork`).

source: The exit status or error message that is passed to the constructor. (Defaults to ``None``.)
pt_br: O status de saída ou mensagem de erro transmitida ao construtor. (O padrão é ``None``.)

source: Raised when an operation or function is applied to an object of inappropriate type. The associated value is a string giving details about the type mismatch.
pt_br: Levantada quando uma operação ou função é aplicada a um objeto de tipo inadequado. O valor associado é uma string que fornece detalhes sobre a incompatibilidade de tipo.

source: This exception may be raised by user code to indicate that an attempted operation on an object is not supported, and is not meant to be. If an object is meant to support a given operation but has not yet provided an implementation, :exc:`NotImplementedError` is the proper exception to raise.
pt_br: Essa exceção pode ser levantada pelo código do usuário para indicar que uma tentativa de operação em um objeto não é suportada e não deveria ser. Se um objeto deve ter suporte a uma dada operação, mas ainda não forneceu uma implementação, :exc:`NotImplementedError` é a exceção apropriada a ser levantada.

source: Passing arguments of the wrong type (e.g. passing a :class:`list` when an :class:`int` is expected) should result in a :exc:`TypeError`, but passing arguments with the wrong value (e.g. a number outside expected boundaries) should result in a :exc:`ValueError`.
pt_br: Passar argumentos do tipo errado (por exemplo, passar uma :class:`list` quando um :class:`int` é esperado) deve resultar em uma :exc:`TypeError`, mas passar argumentos com o valor errado (por exemplo, um número fora limites esperados) deve resultar em uma :exc:`ValueError`.

source: Raised when a reference is made to a local variable in a function or method, but no value has been bound to that variable. This is a subclass of :exc:`NameError`.
pt_br: Levantada quando uma referência é feita a uma variável local em uma função ou método, mas nenhum valor foi vinculado a essa variável. Esta é uma subclasse de :exc:`NameError`.

source: Raised when a Unicode-related encoding or decoding error occurs. It is a subclass of :exc:`ValueError`.
pt_br: Levantada quando ocorre um erro de codificação ou decodificação relacionado ao Unicode. É uma subclasse de :exc:`ValueError`.

source: :exc:`UnicodeError` has attributes that describe the encoding or decoding error. For example, ``err.object[err.start:err.end]`` gives the particular invalid input that the codec failed on.
pt_br: :exc:`UnicodeError` possui atributos que descrevem o erro de codificação ou decodificação. Por exemplo, ``err.object[err.start:err.end]`` fornece a entrada inválida específica na qual o codec falhou.

source: The name of the encoding that raised the error.
pt_br: O nome da codificação que levantou o erro.

source: A string describing the specific codec error.
pt_br: Uma string que descreve o erro de codec específico.

source: The object the codec was attempting to encode or decode.
pt_br: O objeto que o codec estava tentando codificar ou decodificar.

source: The first index of invalid data in :attr:`object`.
pt_br: O primeiro índice de dados inválidos em :attr:`object`.

source: This value should not be negative as it is interpreted as an absolute offset but this constraint is not enforced at runtime.
pt_br: Este valor não deve ser negativo, pois é interpretado como um deslocamento absoluto, mas essa restrição não é aplicada em tempo de execução.

source: The index after the last invalid data in :attr:`object`.
pt_br: O índice após os últimos dados inválidos em :attr:`object`.

source: Raised when a Unicode-related error occurs during encoding. It is a subclass of :exc:`UnicodeError`.
pt_br: Levantada quando ocorre um erro relacionado ao Unicode durante a codificação. É uma subclasse de :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during decoding. It is a subclass of :exc:`UnicodeError`.
pt_br: Levantada quando ocorre um erro relacionado ao Unicode durante a decodificação. É uma subclasse de :exc:`UnicodeError`.

source: Raised when a Unicode-related error occurs during translating. It is a subclass of :exc:`UnicodeError`.
pt_br: Levantada quando ocorre um erro relacionado ao Unicode durante a tradução. É uma subclasse de :exc:`UnicodeError`.

source: Raised when an operation or function receives an argument that has the right type but an inappropriate value, and the situation is not described by a more precise exception such as :exc:`IndexError`.
pt_br: Levantada quando uma operação ou função recebe um argumento que tem o tipo certo, mas um valor inadequado, e a situação não é descrita por uma exceção mais precisa, como :exc:`IndexError`.

source: Raised when the second argument of a division or modulo operation is zero. The associated value is a string indicating the type of the operands and the operation.
pt_br: Levantada quando o segundo argumento de uma divisão ou operação de módulo é zero. O valor associado é uma string que indica o tipo dos operandos e a operação.

source: The following exceptions are kept for compatibility with previous versions; starting from Python 3.3, they are aliases of :exc:`OSError`.
pt_br: As seguintes exceções são mantidas para compatibilidade com versões anteriores; a partir do Python 3.3, eles são apelidos de :exc:`OSError`.

source: Only available on Windows.
pt_br: Disponível apenas no Windows.

source: OS exceptions
pt_br: Exceções de sistema operacional

source: The following exceptions are subclasses of :exc:`OSError`, they get raised depending on the system error code.
pt_br: As seguintes exceções são subclasses de :exc:`OSError`, elas são levantadas dependendo do código de erro do sistema.

source: Raised when an operation would block on an object (e.g. socket) set for non-blocking operation. Corresponds to :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` and :py:const:`~errno.EINPROGRESS`.
pt_br: Levantada quando uma operação bloquearia em um objeto (por exemplo, soquete) definido para operação sem bloqueio. Corresponde a :c:data:`errno` :py:const:`~errno.EAGAIN`, :py:const:`~errno.EALREADY`, :py:const:`~errno.EWOULDBLOCK` e :py:const:`~errno.EINPROGRESS`.

source: In addition to those of :exc:`OSError`, :exc:`BlockingIOError` can have one more attribute:
pt_br: Além daquelas de :exc:`OSError`, :exc:`BlockingIOError` pode ter mais um atributo:

source: An integer containing the number of characters written to the stream before it blocked. This attribute is available when using the buffered I/O classes from the :mod:`io` module.
pt_br: Um inteiro contendo o número de caracteres gravados no fluxo antes de ser bloqueado. Este atributo está disponível ao usar as classes de E/S em buffer do módulo :mod:`io`.

source: Raised when an operation on a child process failed. Corresponds to :c:data:`errno` :py:const:`~errno.ECHILD`.
pt_br: Levantada quando uma operação em um processo filho falha. Corresponde a :c:data:`errno` :py:const:`~errno.ECHILD`.

source: A base class for connection-related issues.
pt_br: Uma classe base para problemas relacionados à conexão.

source: Subclasses are :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` and :exc:`ConnectionResetError`.
pt_br: Suas subclasses são :exc:`BrokenPipeError`, :exc:`ConnectionAbortedError`, :exc:`ConnectionRefusedError` e :exc:`ConnectionResetError`.
