Repository: python/python-docs-pt-br
Catalog: library/filecmp.po
Languages: pt_br

source: :mod:`!filecmp` --- File and Directory Comparisons
pt_br: :mod:`!filecmp` --- Comparações de arquivos e diretórios

source: **Source code:** :source:`Lib/filecmp.py`
pt_br: **Código-fonte:** :source:`Lib/filecmp.py`

source: The :mod:`filecmp` module defines functions to compare files and directories, with various optional time/correctness trade-offs. For comparing files, see also the :mod:`difflib` module.
pt_br: O módulo :mod:`filecmp` define funções para comparar arquivos e diretórios, com várias compensações opcionais de tempo/correção. Para comparar arquivos, veja também o módulo :mod:`difflib`.

source: The :mod:`filecmp` module defines the following functions:
pt_br: O módulo :mod:`filecmp` define as seguintes funções:

source: Compare the files named *f1* and *f2*, returning ``True`` if they seem equal, ``False`` otherwise.
pt_br: Compara os arquivos chamados *f1* e *f2*, retornando ``True`` se eles parecerem iguais, ``False`` caso contrário.

source: If *shallow* is true and the :func:`os.stat` signatures (file type, size, and modification time) of both files are identical, the files are taken to be equal.
pt_br: Se *shallow* for verdadeiro e as assinaturas de :func:`os.stat` (tipo de arquivo, tamanho e hora de modificação) de ambos os arquivos forem idênticas, os arquivos serão considerados iguais.

source: Otherwise, the files are treated as different if their sizes or contents differ.
pt_br: Caso contrário, os arquivos serão tratados como diferentes se seus tamanhos ou conteúdos forem diferentes.

source: Note that no external programs are called from this function, giving it portability and efficiency.
pt_br: Observe que nenhum programa externo é chamado a partir desta função, o que lhe confere portabilidade e eficiência.

source: This function uses a cache for past comparisons and the results, with cache entries invalidated if the :func:`os.stat` information for the file changes. The entire cache may be cleared using :func:`clear_cache`.
pt_br: Esta função usa um cache para comparações passadas e os resultados, com entradas de cache invalidadas se as informações de :func:`os.stat` para o arquivo mudarem. O cache inteiro pode ser limpo usando :func:`clear_cache`.

source: Compare the files in the two directories *dir1* and *dir2* whose names are given by *common*.
pt_br: Compara os arquivos nos dois diretórios *dir1* e *dir2* cujos nomes são dados por *common*.

source: Returns three lists of file names: *match*, *mismatch*, *errors*. *match* contains the list of files that match, *mismatch* contains the names of those that don't, and *errors* lists the names of files which could not be compared. Files are listed in *errors* if they don't exist in one of the directories, the user lacks permission to read them or if the comparison could not be done for some other reason.
pt_br: Retorna três listas de nomes de arquivos: *match*, *mismatch*, *errors*. *match* contém a lista de arquivos que correspondem, *mismatch* contém os nomes daqueles que não correspondem e *errors* lista os nomes dos arquivos que não puderam ser comparados. Os arquivos são listados em *errors* se não existirem em um dos diretórios, o usuário não tiver permissão para lê-los ou se a comparação não puder ser feita por algum outro motivo.

source: The *shallow* parameter has the same meaning and default value as for :func:`filecmp.cmp`.
pt_br: O parâmetro *shallow* tem o mesmo significado e valor padrão que :func:`filecmp.cmp`.

source: For example, ``cmpfiles('a', 'b', ['c', 'd/e'])`` will compare ``a/c`` with ``b/c`` and ``a/d/e`` with ``b/d/e``. ``'c'`` and ``'d/e'`` will each be in one of the three returned lists.
pt_br: Por exemplo, ``cmpfiles('a', 'b', ['c', 'd/e'])`` comparará ``a/c`` com ``b/c`` e ``a/d/e`` com ``b/d/e``. ``'c'`` e ``'d/e'`` estarão cada um em uma das três listas retornadas.

source: Clear the filecmp cache. This may be useful if a file is compared so quickly after it is modified that it is within the mtime resolution of the underlying filesystem.
pt_br: Limpa o cache do filecmp. Isso pode ser útil se um arquivo for comparado tão rapidamente após ser modificado que ele esteja dentro da resolução de mtime do sistema de arquivos subjacente.

source: The :class:`dircmp` class
pt_br: A classe :class:`dircmp`

source: Construct a new directory comparison object, to compare the directories *a* and *b*. *ignore* is a list of names to ignore, and defaults to :const:`filecmp.DEFAULT_IGNORES`. *hide* is a list of names to hide, and defaults to ``[os.curdir, os.pardir]``.
pt_br: Constrói um novo objeto de comparação de diretórios para comparar os diretórios *a* e *b*. *ignore* é uma lista de nomes a serem ignorados e o padrão é :const:`filecmp.DEFAULT_IGNORES`. *hide* é uma lista de nomes a serem ocultados e o padrão é ``[os.curdir, os.pardir]``.

source: The :class:`dircmp` class compares files by doing *shallow* comparisons as described for :func:`filecmp.cmp` by default using the *shallow* parameter.
pt_br: A classe :class:`dircmp` compara arquivos fazendo comparações rasas, isto é, *shallow* conforme descrito para :func:`filecmp.cmp` por padrão usando o parâmetro *shallow*.

source: Added the *shallow* parameter.
pt_br: Adicionado o parâmetro *shallow*.

source: The :class:`dircmp` class provides the following methods:
pt_br: A classe :class:`dircmp` fornece os seguintes métodos:

source: Print (to :data:`sys.stdout`) a comparison between *a* and *b*.
pt_br: Exibe (para :data:`sys.stdout`) uma comparação entre *a* e *b*.

source: Print a comparison between *a* and *b* and common immediate subdirectories.
pt_br: Exibe uma comparação entre *a* e *b* e subdiretórios imediatos comuns.

source: Print a comparison between *a* and *b* and common subdirectories (recursively).
pt_br: Exibe uma comparação entre *a* e *b* e subdiretórios comuns (recursivamente).

source: The :class:`dircmp` class offers a number of interesting attributes that may be used to get various bits of information about the directory trees being compared.
pt_br: A classe :class:`dircmp` oferece uma série de atributos interessantes que podem ser usados para obter várias informações sobre as árvores de diretórios que estão sendo comparadas.

source: Note that via :meth:`~object.__getattr__` hooks, all attributes are computed lazily, so there is no speed penalty if only those attributes which are lightweight to compute are used.
pt_br: Observe que, por meio dos ganchos :meth:`~object.__getattr__`, todos os atributos são computados preguiçosamente, portanto, não há perda de velocidade se apenas os atributos que são leves para computar forem usados.

source: The directory *a*.
pt_br: O diretório *a*.

source: The directory *b*.
pt_br: O diretório *b*.

source: Files and subdirectories in *a*, filtered by *hide* and *ignore*.
pt_br: Arquivos e subdiretórios em *a*, filtrados por *hide* e *ignore*.

source: Files and subdirectories in *b*, filtered by *hide* and *ignore*.
pt_br: Arquivos e subdiretórios em *b*, filtrados por *hide* e *ignore*.

source: Files and subdirectories in both *a* and *b*.
pt_br: Arquivos e subdiretórios em *a* e *b*.

source: Files and subdirectories only in *a*.
pt_br: Arquivos e subdiretórios em apenas *a*.

source: Files and subdirectories only in *b*.
pt_br: Arquivos e subdiretórios em apenas *b*.

source: Subdirectories in both *a* and *b*.
pt_br: Subdiretórios em *a* e *b*.

source: Files in both *a* and *b*.
pt_br: Arquivos em *a* e *b*.

source: Names in both *a* and *b*, such that the type differs between the directories, or names for which :func:`os.stat` reports an error.
pt_br: Nomes em *a* e *b*, de modo que o tipo difere entre os diretórios, ou nomes para os quais :func:`os.stat` relata um erro.

source: Files which are identical in both *a* and *b*, using the class's file comparison operator.
pt_br: Arquivos que são idênticos em *a* e *b*, usando o operador de comparação de arquivos da classe.

source: Files which are in both *a* and *b*, whose contents differ according to the class's file comparison operator.
pt_br: Arquivos que estão em *a* e *b*, cujos conteúdos diferem de acordo com o operador de comparação de arquivos da classe.

source: Files which are in both *a* and *b*, but could not be compared.
pt_br: Arquivos que estão em *a* e *b*, mas não puderam ser comparados.

source: A dictionary mapping names in :attr:`common_dirs` to :class:`dircmp` instances (or MyDirCmp instances if this instance is of type MyDirCmp, a subclass of :class:`dircmp`).
pt_br: Um dicionário que mapeia nomes em :attr:`common_dirs` para instâncias :class:`dircmp` (ou instâncias MyDirCmp se esta instância for do tipo MyDirCmp, uma subclasse de :class:`dircmp`).

source: Previously entries were always :class:`dircmp` instances. Now entries are the same type as *self*, if *self* is a subclass of :class:`dircmp`.
pt_br: Anteriormente, as entradas eram sempre instâncias de :class:`dircmp`. Agora, as entradas são do mesmo tipo que *self*, se *self* for uma subclasse de :class:`dircmp`.

source: List of directories ignored by :class:`dircmp` by default.
pt_br: Lista de diretórios ignorados por :class:`dircmp` por padrão.

source: Here is a simplified example of using the ``subdirs`` attribute to search recursively through two directories to show common different files::
pt_br: Aqui está um exemplo simplificado do uso do atributo ``subdirs`` para pesquisar recursivamente em dois diretórios para mostrar arquivos diferentes em comum:
