Repository: python/python-docs-pt-br
Catalog: library/fileinput.po
Languages: pt_br

source: :mod:`!fileinput` --- Iterate over lines from multiple input streams
pt_br: :mod:`!fileinput` --- Itera sobre linhas de múltiplos fluxos de entrada

source: **Source code:** :source:`Lib/fileinput.py`
pt_br: **Código-fonte:** :source:`Lib/fileinput.py`

source: This module implements a helper class and functions to quickly write a loop over standard input or a list of files. If you just want to read or write one file see :func:`open`.
pt_br: Este módulo implementa uma classe auxiliar e funções para escrever rapidamente um laço sobre uma entrada padrão ou uma lista de arquivos. Se você quiser apenas ler ou escrever um arquivo veja :func:`open`.

source: The typical use is::
pt_br: O uso típico é::

source: This iterates over the lines of all files listed in ``sys.argv[1:]``, defaulting to ``sys.stdin`` if the list is empty. If a filename is ``'-'``, it is also replaced by ``sys.stdin`` and the optional arguments *mode* and *openhook* are ignored. To specify an alternative list of filenames, pass it as the first argument to :func:`.input`. A single file name is also allowed.
pt_br: Isto itera sobre as linhas de todos os arquivos listados em ``sys.argv[1:]``, padronizando ``sys.stdin`` se a lista estiver vazia. Se o nome de um arquivo for ``'-'``, ele também será substituído por ``sys.stdin`` e os argumentos opcionais *mode* e *openhook* serão ignorados. Para especificar uma lista alternativa de nomes de arquivos, passe-a como primeiro argumento para :func:`.input`. Um único nome de arquivo também é permitido.

source: All files are opened in text mode by default, but you can override this by specifying the *mode* parameter in the call to :func:`.input` or :class:`FileInput`. If an I/O error occurs during opening or reading a file, :exc:`OSError` is raised.
pt_br: Todos os arquivos são abertos em modo texto por padrão, mas você pode substituir isso especificando o parâmetro *mode* na chamada para :func:`.input` ou :class:`FileInput`. Se ocorrer um erro de E/S durante a abertura ou leitura de um arquivo, :exc:`OSError` será levantada.

source: :exc:`IOError` used to be raised; it is now an alias of :exc:`OSError`.
pt_br: :exc:`IOError` costumava ser levantada; agora é um apelido de :exc:`OSError`.

source: If ``sys.stdin`` is used more than once, the second and further use will return no lines, except perhaps for interactive use, or if it has been explicitly reset (e.g. using ``sys.stdin.seek(0)``).
pt_br: Se ``sys.stdin`` for usado mais de uma vez, o segundo e posterior uso não retornará nenhuma linha, exceto talvez para uso interativo, ou se tiver sido explicitamente redefinido (por exemplo, usando ``sys.stdin.seek(0)``).

source: Empty files are opened and immediately closed; the only time their presence in the list of filenames is noticeable at all is when the last file opened is empty.
pt_br: Arquivos vazios são abertos e fechados imediatamente; a única vez que sua presença na lista de nomes de arquivos é perceptível é quando o último arquivo aberto está vazio.

source: Lines are returned with any newlines intact, which means that the last line in a file may not have one.
pt_br: As linhas são retornadas com novas linhas intactas, o que significa que a última linha de um arquivo pode não ter nenhuma.

source: You can control how files are opened by providing an opening hook via the *openhook* parameter to :func:`fileinput.input` or :func:`FileInput`. The hook must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. If *encoding* and/or *errors* are specified, they will be passed to the hook as additional keyword arguments. This module provides a :func:`hook_compressed` to support compressed files.
pt_br: Você pode controlar como os arquivos são abertos fornecendo um gancho de abertura através do parâmetro *openhook* para :func:`fileinput.input` ou :func:`FileInput`. O gancho deve ser uma função que recebe dois argumentos, *filename* e *mode*, e retorna um objeto arquivo ou similar aberto de acordo. Se *encoding* e/ou *errors* forem especificados, eles serão passados para o gancho como argumentos nomeados adicionais. Este módulo fornece um :func:`hook_compressed` para oferece suporte a arquivos compactados.

source: The following function is the primary interface of this module:
pt_br: A seguinte função é a interface principal deste módulo:

source: Create an instance of the :class:`FileInput` class. The instance will be used as global state for the functions of this module, and is also returned to use during iteration. The parameters to this function will be passed along to the constructor of the :class:`FileInput` class.
pt_br: Cria uma instância da classe :class:`FileInput`. A instância será usada como estado global para as funções deste módulo e também será retornada para uso durante a iteração. Os parâmetros desta função serão passados para o construtor da classe :class:`FileInput`.

source: The :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
pt_br: A instância :class:`FileInput` pode ser usada como um gerenciador de contexto na instrução :keyword:`with`. Neste exemplo, *input* é fechado após a saída da instrução :keyword:`!with`, mesmo se ocorrer uma exceção::

source: Can be used as a context manager.
pt_br: Pode ser usado como gerenciador de contexto.

source: The keyword parameters *mode* and *openhook* are now keyword-only.
pt_br: Os parâmetros nomeados *mode* e *openhook* agora são somente-nomeados.

source: The keyword-only parameter *encoding* and *errors* are added.
pt_br: Os parâmetros somente-nomeados *encoding* e *errors* foram adicionados.

source: The following functions use the global state created by :func:`fileinput.input`; if there is no active state, :exc:`RuntimeError` is raised.
pt_br: As funções a seguir usam o estado global criado por :func:`fileinput.input`; se não houver estado ativo, :exc:`RuntimeError` será levantada.

source: Return the name of the file currently being read. Before the first line has been read, returns ``None``.
pt_br: Retorna o nome do arquivo que está sendo lido no momento. Antes da primeira linha ser lida, retorna ``None``.

source: Return the integer "file descriptor" for the current file. When no file is opened (before the first line and between files), returns ``-1``.
pt_br: Retorna o número inteiro de "descritor de arquivo" para o arquivo atual. Quando nenhum arquivo é aberto (antes da primeira linha e entre arquivos), retorna ``-1``.

source: Return the cumulative line number of the line that has just been read. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line.
pt_br: Retorna o número cumulativo da linha que acabou de ser lida. Antes da primeira linha ser lida, retorna ``0``. Após a leitura da última linha do último arquivo, retorna o número da linha dessa linha.

source: Return the line number in the current file. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line within the file.
pt_br: Retorna o número da linha no arquivo atual. Antes da primeira linha ser lida, retorna ``0``. Após a leitura da última linha do último arquivo, retorna o número da linha dessa linha no arquivo.

source: Return ``True`` if the line just read is the first line of its file, otherwise return ``False``.
pt_br: Retorna ``True`` se a linha que acabou de ler for a primeira linha do seu arquivo, caso contrário retorna ``False``.

source: Return ``True`` if the last line was read from ``sys.stdin``, otherwise return ``False``.
pt_br: Retorna ``True`` se a última linha foi lida em ``sys.stdin``, caso contrário retorna ``False``.

source: Close the current file so that the next iteration will read the first line from the next file (if any); lines not read from the file will not count towards the cumulative line count. The filename is not changed until after the first line of the next file has been read. Before the first line has been read, this function has no effect; it cannot be used to skip the first file. After the last line of the last file has been read, this function has no effect.
pt_br: Fecha o arquivo atual para que a próxima iteração leia a primeira linha do próximo arquivo (se houver); as linhas não lidas do arquivo não contarão para a contagem cumulativa de linhas. O nome do arquivo não é alterado até que a primeira linha do próximo arquivo seja lida. Antes da leitura da primeira linha, esta função não tem efeito; ele não pode ser usado para pular o primeiro arquivo. Após a leitura da última linha do último arquivo, esta função não terá efeito.

source: Close the sequence.
pt_br: Fecha a sequência.

source: The class which implements the sequence behavior provided by the module is available for subclassing as well:
pt_br: A classe que implementa o comportamento de sequência fornecido pelo módulo também está disponível para subclasses:

source: Class :class:`FileInput` is the implementation; its methods :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` and :meth:`close` correspond to the functions of the same name in the module. In addition it is :term:`iterable` and has a :meth:`~io.TextIOBase.readline` method which returns the next input line. The sequence must be accessed in strictly sequential order; random access and :meth:`~io.TextIOBase.readline` cannot be mixed.
pt_br: A classe :class:`FileInput` é a implementação; seus métodos :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` e :meth:`close` correspondem às funções de mesmo nome no módulo. Além disso, é :term:`iterável` e possui um método :meth:`~io.TextIOBase.readline` que retorna a próxima linha de entrada. A sequência deve ser acessada em ordem estritamente sequencial; acesso aleatório e :meth:`~io.TextIOBase.readline` não podem ser misturados.

source: With *mode* you can specify which file mode will be passed to :func:`open`. It must be one of ``'r'`` and ``'rb'``.
pt_br: Com *mode* você pode especificar qual modo de arquivo será passado para :func:`open`. Deve ser um entre ``'r'`` e ``'rb'``.

source: The *openhook*, when given, must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. You cannot use *inplace* and *openhook* together.
pt_br: O *openhook*, quando fornecido, deve ser uma função que recebe dois argumentos, *filename* e *mode*, e retorna um objeto arquivo ou similar aberto de acordo. Você não pode usar *inplace* e *openhook* juntos.

source: You can specify *encoding* and *errors* that is passed to :func:`open` or *openhook*.
pt_br: Você pode especificar *encoding* e *errors* que são passados para :func:`open` ou *openhook*.

source: A :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
pt_br: Uma instância :class:`FileInput` pode ser usada como um gerenciador de contexto na instrução :keyword:`with`. Neste exemplo, *input* é fechado após a saída da instrução :keyword:`!with`, mesmo se ocorrer uma exceção::

source: The keyword parameter *mode* and *openhook* are now keyword-only.
pt_br: Os parâmetros nomeados *mode* e *openhook* agora são somente-nomeados.

source: The ``'rU'`` and ``'U'`` modes and the :meth:`!__getitem__` method have been removed.
pt_br: Os modos ``'rU'`` e ``'U'`` e o método :meth:`!__getitem__` foram removidos.

source: **Optional in-place filtering:** if the keyword argument ``inplace=True`` is passed to :func:`fileinput.input` or to the :class:`FileInput` constructor, the file is moved to a backup file and standard output is directed to the input file (if a file of the same name as the backup file already exists, it will be replaced silently). This makes it possible to write a filter that rewrites its input file in place. If the *backup* parameter is given (typically as ``backup='.<some extension>'``), it specifies the extension for the backup file, and the backup file remains around; by default, the extension is ``'.bak'`` and it is deleted when the output file is closed. In-place filtering is disabled when standard input is read.
pt_br: **Filtragem local opcional:** se o argumento nomeado ``inplace=True`` for passado para :func:`fileinput.input` ou para o construtor :class:`FileInput`, o arquivo é movido para um arquivo de backup e a saída padrão é direcionada para o arquivo de entrada (se já existir um arquivo com o mesmo nome do arquivo de backup, ele será substituído silenciosamente). Isso torna possível escrever um filtro que reescreva seu arquivo de entrada internamente. Se o parâmetro *backup* for fornecido (normalmente como ``backup='.<some extension>'``), ele especifica a extensão do arquivo de backup, e o arquivo de backup permanece disponível; por padrão, a extensão é ``'.bak'`` e é excluída quando o arquivo de saída é fechado. A filtragem local é desativada quando a entrada padrão é lida.

source: The two following opening hooks are provided by this module:
pt_br: Os dois ganchos de abertura a seguir são fornecidos por este módulo:

source: Transparently opens files compressed with gzip and bzip2 (recognized by the extensions ``'.gz'`` and ``'.bz2'``) using the :mod:`gzip` and :mod:`bz2` modules. If the filename extension is not ``'.gz'`` or ``'.bz2'``, the file is opened normally (ie, using :func:`open` without any decompression).
pt_br: Abre de forma transparente arquivos compactados com gzip e bzip2 (reconhecidos pelas extensões ``'.gz'`` e ``'.bz2'``) usando os módulos :mod:`gzip` e :mod:`bz2`. Se a extensão do nome do arquivo não for ``'.gz'`` ou ``'.bz2'``, o arquivo é aberto normalmente (ou seja, usando :func:`open` sem qualquer descompactação).

source: The *encoding* and *errors* values are passed to :class:`io.TextIOWrapper` for compressed files and open for normal files.
pt_br: Os valores *encoding* e *errors* são passados para :class:`io.TextIOWrapper` para arquivos compactados e abertos para arquivos normais.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``
pt_br: Exemplo de uso: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``

source: Returns a hook which opens each file with :func:`open`, using the given *encoding* and *errors* to read the file.
pt_br: Retorna um gancho que abre cada arquivo com :func:`open`, usando a *encoding* e *errors* fornecidas para ler o arquivo.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``
pt_br: Exemplo de uso: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``

source: Added the optional *errors* parameter.
pt_br: Adicionado o parâmetro opcional *errors*.

source: This function is deprecated since :func:`fileinput.input` and :class:`FileInput` now have *encoding* and *errors* parameters.
pt_br: Esta função foi descontinuado já que :func:`fileinput.input` e :class:`FileInput` agora possuem parâmetros *encoding* e *errors*.
