Repository: python/python-docs-pt-br
Catalog: library/fnmatch.po
Languages: pt_br

source: :mod:`!fnmatch` --- Unix filename pattern matching
pt_br: :mod:`!fnmatch` --- Correspondência de padrões de nome de arquivo Unix

source: **Source code:** :source:`Lib/fnmatch.py`
pt_br: **Código-fonte:** :source:`Lib/fnmatch.py`

source: This module provides support for Unix shell-style wildcards, which are *not* the same as regular expressions (which are documented in the :mod:`re` module). The special characters used in shell-style wildcards are:
pt_br: Este módulo fornece suporte para curingas no estilo shell do Unix, que *não* são iguais às expressões regulares (documentadas no módulo :mod:`re`). Os caracteres especiais usados nos curingas no estilo de shell são:

source: Pattern
pt_br: Padrão

source: Meaning
pt_br: Significado

source: matches everything
pt_br: corresponde a tudo

source: matches any single character
pt_br: Corresponde a qualquer caractere único

source: matches any character in *seq*
pt_br: corresponde a qualquer caractere em *seq*

source: matches any character not in *seq*
pt_br: corresponde a qualquer caractere ausente em *seq*

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
pt_br: Para uma correspondência literal, coloque os metacaracteres entre colchetes. Por exemplo, ``'[?]'`` corresponde ao caractere ``'?'``.

source: Note that the filename separator (``'/'`` on Unix) is *not* special to this module. See module :mod:`glob` for pathname expansion (:mod:`glob` uses :func:`.filter` to match pathname segments). Similarly, filenames starting with a period are not special for this module, and are matched by the ``*`` and ``?`` patterns.
pt_br: Note que o separador de nome de arquivo (``'/'`` no Unix) *não* é especial para este módulo. Veja o módulo :mod:`glob` para expansão do nome do caminho (:mod:`glob` usa :func:`.filter` para corresponder aos segmentos do nome do caminho). Da mesma forma, os nomes de arquivos que começam com um ponto final não são especiais para este módulo e são correspondidos pelos padrões ``*`` e ``?``.

source: Unless stated otherwise, "filename string" and "pattern string" either refer to :class:`str` or ``ISO-8859-1`` encoded :class:`bytes` objects. Note that the functions documented below do not allow to mix a :class:`!bytes` pattern with a :class:`!str` filename, and vice-versa.
pt_br: A menos que indicado de outra forma, "string de nome de arquivo" e "string de padrão" referem-se a objetos :class:`str` ou :class:`bytes` codificados em ``ISO-8859-1``. Observe que as funções documentadas abaixo não permitem misturar um padrão :class:`!bytes` com um nome de arquivo :class:`!str` e vice-versa.

source: Test whether the filename string *name* matches the pattern string *pat*, returning ``True`` or ``False``. Both parameters are case-normalized using :func:`os.path.normcase`. :func:`fnmatchcase` can be used to perform a case-sensitive comparison, regardless of whether that's standard for the operating system.
pt_br: Testa se a string do nome de arquivo *name* corresponde à string de padrão *pat*, retornando ``True`` ou ``False``. Ambos os parâmetros são normalizados em maiúsculas e minúsculas usando :func:`os.path.normcase`. :func:`fnmatchcase` pode ser usado para realizar uma comparação com distinção entre maiúsculas e minúsculas, independentemente de ser padrão para o sistema operacional.

source: This example will print all file names in the current directory with the extension ``.txt``::
pt_br: Este exemplo vai exibir todos os nomes de arquivos no diretório atual com a extensão ``.txt``::

source: import fnmatch import os for file in os.listdir('.'): if fnmatch.fnmatch(file, '*.txt'): print(file)
pt_br: import fnmatch import os for arquivo in os.listdir('.'): if fnmatch.fnmatch(arquivo, '*.txt'): print(arquivo)

source: Test whether the filename string *name* matches the pattern string *pat*, returning ``True`` or ``False``; the comparison is case-sensitive and does not apply :func:`os.path.normcase`.
pt_br: Testa se a string do nome de arquivo *name* corresponde à string de padrão *pat*, retornando ``True`` ou ``False``; a comparação diferencia maiúsculas de minúsculas e não se aplica a :func:`os.path.normcase`.

source: Construct a list from those elements of the :term:`iterable` of filename strings *names* that match the pattern string *pat*. It is the same as ``[n for n in names if fnmatch(n, pat)]``, but implemented more efficiently.
pt_br: Constrói uma lista a partir daqueles elementos do :term:`iterável` de strings de nome de arquivo *names* que correspondem à string de padrão *pat*. É o mesmo que ``[n for n in names if fnmatch(n, pat)]``, mas implementado com mais eficiência.

source: Construct a list from those elements of the :term:`iterable` of filename strings *names* that do not match the pattern string *pat*. It is the same as ``[n for n in names if not fnmatch(n, pat)]``, but implemented more efficiently.
pt_br: Constrói uma lista a partir daqueles elementos do :term:`iterável` de strings de nome de arquivo *names* que não correspondem à string de padrão *pat*. É o mesmo que ``[n for n in names if not fnmatch(n, pat)]``, mas implementado com mais eficiência.

source: Return the shell-style pattern *pat* converted to a regular expression for using with :func:`re.match`. The pattern is expected to be a :class:`str`.
pt_br: Retorna o padrão *pat* no estilo shell convertido em uma expressão regular para usar com :func:`re.match`. O padrão é esperado ser um :class:`str`.

source: Example:
pt_br: Exemplo:

source: Module :mod:`glob`
pt_br: Módulo :mod:`glob`

source: Unix shell-style path expansion.
pt_br: Expansão de caminho no estilo shell do Unix.

source: filenames
pt_br: nomes de arquivos

source: wildcard expansion
pt_br: expansão de curingas

source: module
pt_br: módulo

source: * (asterisk)
pt_br: * (asterisco)

source: in glob-style wildcards
pt_br: caracteres curingas no estilo blog

source: ? (question mark)
pt_br: ? (interrogação)

source: [] (square brackets)
pt_br: [] (colchetes)

source: ! (exclamation)
pt_br: ! (exclamação)

source: - (minus)
pt_br: - (menos)
