Repository: python/python-docs-pt-br
Catalog: library/functions.po
Languages: pt_br

source: Built-in Functions
pt_br: Funções embutidas

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
pt_br: O interpretador do Python possui várias funções e tipos embutidos que sempre estão disponíveis. A seguir listamos todas as funções em ordem alfabética.

source: Return the absolute value of a number. The argument may be an integer, a floating-point number, or an object implementing :meth:`~object.__abs__`. If the argument is a complex number, its magnitude is returned.
pt_br: Retorna o valor absoluto de um número. O argumento pode ser um inteiro, um número de ponto flutuante ou um objeto implementando :meth:`~object.__abs__`. Se o argumento é um número complexo, sua magnitude é retornada.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
pt_br: Retorna um :term:`iterador assíncrono <asynchronous iterator>` para um :term:`iterável assíncrono <asynchronous iterable>`. Equivalente a chamar ``x.__aiter__()``.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
pt_br: Nota: Ao contrário de :func:`iter`, :func:`aiter` não tem uma variante de 2 argumentos.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
pt_br: Retorna ``True`` se todos os elementos de *iterable* são verdadeiros (ou se *iterable* estiver vazio). Equivalente a::

source: def all(iterable): for element in iterable: if not element: return False return True
pt_br: def all(iterable): for elemento in iterable: if not elemento: return False return True

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
pt_br: Quando aguardado, retorna o próximo item do :term:`iterador assíncrono` fornecido, ou *default* se fornecido e o iterador for esgotado.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
pt_br: Esta é a variante assíncrona do :func:`next` embutido, e se comporta de forma semelhante.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
pt_br: Isso chama o método :meth:`~object.__anext__` de *async_iterator*, retornando um :term:`aguardável`. Ao aguardar isso, retorna o próximo valor do iterador. Se *default* for fornecido, ele será retornado se o iterador for esgotado, caso contrário, a exceção :exc:`StopAsyncIteration` será levantada.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
pt_br: Retorna ``True`` se algum elemento de *iterable* for verdadeiro. Se *iterable* estiver vazio, retorna ``False``. Equivalente a::

source: def any(iterable): for element in iterable: if element: return True return False
pt_br: def any(iterable): for elemento in iterable: if elemento: return True return False

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u``, or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
pt_br: Como :func:`repr`, retorna uma string contendo uma representação imprimível de um objeto, mas faz escape de caracteres não-ASCII na string retornada por :func:`repr` usando sequências de escapes ``\x``, ``\u`` ou ``\U``. Isto gera uma string similar ao que é retornado por :func:`repr` no Python 2.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
pt_br: Converte um número inteiro para uma string de binários prefixada com "0b". O resultado é uma expressão Python válida. Se *x* não é um objeto Python :class:`int`, ele tem que definir um método :meth:`~object.__index__` que devolve um inteiro. Alguns exemplos:

source: If the prefix "0b" is desired or not, you can use either of the following ways.
pt_br: Se o prefixo "0b" é desejado ou não, você pode usar uma das seguintes maneiras.

source: See also :func:`format` for more information.
pt_br: Veja também :func:`format` para mais informações.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. The argument is converted using the standard :ref:`truth testing procedure <truth>`. If the argument is false or omitted, this returns ``False``; otherwise, it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`typebool`).
pt_br: Retorna um valor Booleano, isto é, ``True`` ou ``False``. O argumento é convertido usando o :ref:`procedimento de teste de verdade <truth>` padrão. Se o argumento for falso ou foi omitido, isso retorna ``False``; senão ``True``. A classe :class:`bool` é uma subclasse de :class:`int` (veja :ref:`typesnumeric`). Ela não pode ser usada para criar outra subclasse. Suas únicas instâncias são ``False`` e ``True`` (veja :ref:`typebool`).

source: The parameter is now positional-only.
pt_br: O parâmetro agora é somente-posicional

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice. If :func:`sys.breakpointhook` is not accessible, this function will raise :exc:`RuntimeError`.
pt_br: Esta função coloca você no depurador no local da chamada. Especificamente, ela chama :func:`sys.breakpointhook`, passando ``args`` e ``kws`` diretamente. Por padrão, ``sys.breakpointhook()`` chama :func:`pdb.set_trace` não esperando nenhum argumento. Neste caso, isso é puramente uma função de conveniência para você não precisar importar :mod:`pdb` explicitamente ou digitar mais código para entrar no depurador. Contudo, :func:`sys.breakpointhook` pode ser configurado para alguma outra função e :func:`breakpoint` irá automaticamente chamá-la, permitindo você ir para o depurador de sua escolha. Se :func:`sys.breakpointhook` não estiver acessível, esta função vai levantar :exc:`RuntimeError`.

source: By default, the behavior of :func:`breakpoint` can be changed with the :envvar:`PYTHONBREAKPOINT` environment variable. See :func:`sys.breakpointhook` for usage details.
pt_br: Por padrão, o comportamento de :func:`breakpoint` pode ser alterado com a variável de ambiente :envvar:`PYTHONBREAKPOINT`. Veja :func:`sys.breakpointhook` para detalhes de uso.

source: Note that this is not guaranteed if :func:`sys.breakpointhook` has been replaced.
pt_br: Observe que isso não é garantido se :func:`sys.breakpointhook` tiver sido substituído.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``builtins.breakpoint`` com o argumento ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
pt_br: Retorna um novo vetor de bytes. A classe :class:`bytearray` é uma sequência mutável de inteiros no intervalo 0 <= x < 256. Ela tem a maior parte dos métodos mais comuns de sequências mutáveis, descritas em :ref:`typesseq-mutable`, assim como a maior parte dos métodos que o tipo :class:`bytes` tem, veja :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
pt_br: O parâmetro opcional *source* pode ser usado para inicializar o vetor de algumas maneiras diferentes:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
pt_br: Se é uma *string*, você deve informar o parâmetro *encoding* (e opcionalmente, *errors*); :func:`bytearray` então converte a string para bytes usando :meth:`str.encode`.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
pt_br: Se é um *inteiro*, o vetor terá esse tamanho e será inicializado com bytes nulos.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
pt_br: Se é um objeto em conformidade com a :ref:`interface de buffer <bufferobjects>`, um buffer somente leitura do objeto será usado para inicializar o vetor de bytes.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
pt_br: Se é um *iterável*, deve ser um iterável de inteiros no intervalo ``0 <= x < 256``, que serão usados como o conteúdo inicial do vetor.

source: Without an argument, an array of size 0 is created.
pt_br: Sem nenhum argumento, um vetor de tamanho 0 é criado.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
pt_br: Veja também :ref:`binaryseq` e :ref:`typebytearray`.

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
pt_br: Retorna um novo objeto "bytes" que é uma sequência imutável de inteiros no intervalo ``0 <= x < 256``. :class:`bytes` é uma versão imutável de :class:`bytearray` -- tem os mesmos métodos de objetos imutáveis e o mesmo comportamento de índices e fatiamento.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
pt_br: Consequentemente, argumentos do construtor são interpretados como os de :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
pt_br: Objetos bytes também podem ser criados com literais, veja :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
pt_br: Veja também :ref:`binaryseq`, :ref:`typebytes`, e :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`~object.__call__` method.
pt_br: Retorna :const:`True` se o argumento *object* parece ser chamável, :const:`False` caso contrário. Se retorna ``True``, ainda é possível que a chamada falhe, mas se é ``False``, chamar *object* nunca será bem sucedido. Note que classes são chamáveis (chamar uma classe devolve uma nova instância); instâncias são chamáveis se suas classes possuem um método :meth:`~object.__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
pt_br: Esta função foi removida na versão 3.0, mas retornou no Python 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
pt_br: Retorna o caractere que é apontado pelo inteiro *i* no código Unicode. Por exemplo, ``chr(97)`` retorna a string ``'a'``, enquanto ``chr(8364)`` retorna a string ``'€'``. É o inverso de :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
pt_br: O intervalo válido para o argumento vai de 0 até 1.114.111 (0x10FFFF na base 16). Será lançada uma exceção :exc:`ValueError` se *i* estiver fora desse intervalo.

source: Transform a method into a class method.
pt_br: Transforma um método em um método de classe.

source: A class method receives the class as an implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
pt_br: Um método de classe recebe a classe como um primeiro argumento implícito, exatamente como um método de instância recebe a instância. Para declarar um método de classe, faça dessa forma::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
pt_br: O termo ``@classmethod`` é uma função :term:`decoradora <decorator>` -- veja :ref:`function` para detalhes.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
pt_br: Um método de classe pode ser chamado tanto da classe (como em ``C.f()``) quanto da instância (como em ``C().f()``). A instância é ignorada, exceto por sua classe. Se um método de classe é chamado por uma classe derivada, o objeto da classe derivada é passado como primeiro argumento implícito.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
pt_br: Métodos de classe são diferentes de métodos estáticos em C++ ou Java. Se você quer saber desses, veja :func:`staticmethod` nesta seção. Para mais informações sobre métodos de classe, consulte :ref:`types`.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
pt_br: Métodos de classe agora podem envolver outros :term:`descritores <descriptor>` tal como :func:`property`.

source: Class methods now inherit the method attributes (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` and :attr:`~function.__annotations__`) and have a new ``__wrapped__`` attribute.
pt_br: Métodos de classe agora herdam os atributos do método (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` e :attr:`~function.__annotations__`) e têm um novo atributo ``__wrapped__``.

source: Class methods can no longer wrap other :term:`descriptors <descriptor>` such as :func:`property`.
pt_br: Métodos de classe não podem mais envolver outros :term:`descritores <descriptor>` tal como :func:`property`.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
pt_br: Compila o argumento *source* em código ou objeto AST. Objetos código podem ser executados por :func:`exec` ou :func:`eval`. *source* pode ser uma string normal, uma string byte, ou um objeto AST. Consulte a documentação do módulo :mod:`ast` para saber como trabalhar com objetos AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
pt_br: O argumento *filename* deve ser o arquivo de onde o código será lido; passe algum valor reconhecível se isso não foi lido de um arquivo (``'<string>'`` é comumente usado).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
pt_br: O argumento *mode* especifica qual o tipo de código deve ser compilado; pode ser ``'exec'`` se *source* consiste em uma sequência de instruções, ``'eval'`` se consiste de uma única expressão, ou ``'single'`` se consiste de uma única instrução interativa (neste último caso, instruções que são avaliadas para alguma coisa diferente de ``None`` serão exibidas).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
pt_br: Os argumentos opcionais *flags* e *dont_inherit* controlam quais :ref:`opções do compilador <ast-compiler-flags>` devem ser ativadas e quais :ref:`recursos futuros <future>` devem ser permitidos. Se nenhum estiver presente (ou ambos forem zero), o código é compilado com os mesmos sinalizadores que afetam o código que está chamando :func:`compile`. Se o argumento *flags* for fornecido e *dont_inherit* não for (ou for zero), as opções do compilador e as instruções futuras especificadas pelo argumento *flags* são usadas além daquelas que seriam usadas de qualquer maneira. Se *dont_inherit* for um inteiro diferente de zero, então o argumento *flags* é -- os sinalizadores (recursos futuros e opções do compilador) no código circundante são ignorados.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
pt_br: Opções de compilador e instruções futuras são especificadas por bits, assim pode ocorrer uma operação *OU* bit a bit para especificar múltiplas instruções. O sinalizador necessário para especificar um dado recurso futuro pode ser encontrado no atributo :attr:`~__future__._Feature.compiler_flag` na instância :class:`~__future__._Feature` do módulo :mod:`__future__`. :ref:`Sinalizadores de compilador <ast-compiler-flags>` podem ser encontrados no módulo :mod:`ast`, com o prefixo ``PyCF_``.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
pt_br: O argumento *optimize* especifica o nível de otimização do compilador; o valor padrão de ``-1`` seleciona o nível de otimização do interpretador dado pela opção :option:`-O`. Níveis explícitos são ``0`` (nenhuma otimização; ``__debug__`` é verdadeiro), ``1`` (instruções ``assert`` são removidas, ``__debug__`` é falso) ou ``2`` (strings de documentação também são removidas).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
pt_br: Essa função levanta :exc:`SyntaxError` se o código para compilar é inválido, e :exc:`ValueError` se o código contém bytes nulos.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
pt_br: Se você quer analisar código Python em sua representação AST, veja :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``compile`` com os argumentos ``source``, ``filename``. Esse evento pode também ser levantando por uma compilação implícita.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
pt_br: Quando compilando uma string com código multi-linhas em modo ``'single'`` ou ``'eval'``, entrada deve ser terminada por ao menos um caractere de nova linhas. Isso é para facilitar a detecção de instruções completas e incompletas no módulo :mod:`code`.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
pt_br: É possível quebrar o interpretador Python com uma string suficientemente grande/complexa ao compilar para um objeto AST, devido limitações do tamanho da pilha no compilador AST do Python.

source: Allowed use of Windows and Mac newlines. Also, input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
pt_br: Permitido o uso de marcadores de novas linhas no estilo Windows e Mac. Além disso, em modo ``'exec'`` a entrada não precisa mais terminar com uma nova linha. Também foi adicionado o parâmetro *optimize*.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
pt_br: Anteriormente, :exc:`TypeError` era levantada quando havia bytes nulos em *source*.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
pt_br: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` agora pode ser passado em *flags* para habilitar o suporte em nível superior a ``await``, ``async for``, e ``async with``.

source: Convert a single string or number to a complex number, or create a complex number from real and imaginary parts.
pt_br: Converte uma única string ou número para um número complexo, ou cria um número complexo a partir de partes real e imaginária.

source: Examples:
pt_br: Exemplos:
