Repository: python/python-docs-pt-br
Catalog: library/functions.po
Languages: pt_br

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
pt_br: ``'namereplace'`` (também é suportado somente quando estiver escrevendo) substitui caractere não suportados com sequências de escape ``\N{...}``.

source: *newline* determines how to parse newline characters from the stream. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
pt_br: *newline* determina como analisar caracteres de nova linha do fluxo. Ele pode ser ``None``, ``''``, ``'\n'``, ``'\r'`` e ``'\r\n'``. Ele funciona da seguinte forma:

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
pt_br: Ao ler a entrada do fluxo, se *newline* for ``None``, o modo universal de novas linhas será ativado. As linhas na entrada podem terminar em ``'\n'``, ``'\r'`` ou ``'\r\n'``, e são traduzidas para ``'\n'`` antes de retornar ao chamador. Se for ``''``, o modo de novas linhas universais será ativado, mas as terminações de linha serão retornadas ao chamador sem tradução. Se houver algum dos outros valores legais, as linhas de entrada são finalizadas apenas pela string especificada e a finalização da linha é retornada ao chamador sem tradução.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
pt_br: Ao gravar a saída no fluxo, se *newline* for ``None``, quaisquer caracteres ``'\n'`` gravados serão traduzidos para o separador de linhas padrão do sistema, :data:`os.linesep`. Se *newline* for ``''`` ou ``'\n'``, nenhuma tradução ocorrerá. Se *newline* for um dos outros valores legais, qualquer caractere ``'\n'`` escrito será traduzido para a string especificada.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default); otherwise, an error will be raised.
pt_br: Se *closefd* for ``False`` e um descritor de arquivo em vez de um nome de arquivo for fornecido, o descritor de arquivo subjacente será mantido aberto quando o arquivo for fechado. Se um nome de arquivo for fornecido *closefd* deve ser ``True`` (o padrão), caso contrário, um erro será levantado.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
pt_br: Um abridor personalizado pode ser usado passando um chamável como *opener*. O descritor de arquivo subjacente para o objeto arquivo é obtido chamando *opener* com (*file*, *flags*). *opener* deve retornar um descritor de arquivo aberto (passando :mod:`os.open` como *opener* resulta em funcionalidade semelhante à passagem de ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
pt_br: O arquivo recém-criado é :ref:`não-herdável <fd_inheritance>`.

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
pt_br: O exemplo a seguir usa o parâmetro :ref:`dir_fd <dir_fd>` da função :func:`os.open` para abrir um arquivo relativo a um determinado diretório::

source: >>> import os >>> dir_fd = os.open('somedir', os.O_RDONLY) >>> def opener(path, flags): ... return os.open(path, flags, dir_fd=dir_fd) ... >>> with open('spamspam.txt', 'w', opener=opener) as f: ... print('This will be written to somedir/spamspam.txt', file=f) ... >>> os.close(dir_fd) # don't leak a file descriptor
pt_br: >>> import os >>> dir_fd = os.open('algum_dir', os.O_RDONLY) >>> def opener(path, flags): ... return os.open(path, flags, dir_fd=dir_fd) ... >>> with open('spamspam.txt', 'w', opener=opener) as f: ... print('Isso será escrito para algum_dir/spamspam.txt', file=f) ... >>> os.close(dir_fd) # não deixe vazar um descritor de arquivo

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
pt_br: O tipo de :term:`objeto arquivo <file object>` retornado pela função :func:`open` depende do modo. Quando :func:`open` é usado para abrir um arquivo no modo texto (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), retorna uma subclasse de :class:`io.TextIOBase` (especificamente :class:`io.TextIOWrapper`). Quando usada para abrir um arquivo em modo binário com buffer, a classe retornada é uma subclasse de :class:`io.BufferedIOBase`. A classe exata varia: no modo binário de leitura, ele retorna uma :class:`io.BufferedReader`; nos modos binário de gravação e binário anexado, ele retorna um :class:`io.BufferedWriter` e, no modo leitura/gravação, retorna um :class:`io.BufferedRandom`. Quando o buffer está desativado, o fluxo bruto, uma subclasse de :class:`io.RawIOBase`, :class:`io.FileIO`, é retornado.

source: See also the file handling modules, such as :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
pt_br: Veja também os módulos de para lidar com arquivos, tais como :mod:`fileinput`, :mod:`io` (onde :func:`open` é declarado), :mod:`os`, :mod:`os.path`, :mod:`tempfile` e :mod:`shutil`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``open`` com os argumentos ``path``, ``mode``, ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
pt_br: Os argumentos ``mode`` e ``flags`` podem ter sido modificados ou inferidos a partir da chamada original.

source: The *opener* parameter was added.
pt_br: O parâmetro *opener* foi adicionado.

source: The ``'x'`` mode was added.
pt_br: O modo ``'x'`` foi adicionado.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
pt_br: :exc:`IOError` costumava ser levantado, agora ele é um codinome para :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
pt_br: :exc:`FileExistsError` agora é levantado se o arquivo aberto no modo de criação exclusivo (``'x'``) já existir.

source: The file is now non-inheritable.
pt_br: O arquivo agora é não herdável.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
pt_br: Se a chamada de sistema é interrompida e o tratador de sinal não levanta uma exceção, a função agora tenta novamente a chamada de sistema em vez de levantar uma exceção :exc:`InterruptedError` (consulte :pep:`475` para entender a justificativa).

source: The ``'namereplace'`` error handler was added.
pt_br: O tratador de erros ``'namereplace'`` foi adicionado.

source: Support added to accept objects implementing :class:`os.PathLike`.
pt_br: Suporte adicionado para aceitar objetos implementados :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
pt_br: No Windows, a abertura de um buffer do console pode retornar uma subclasse de :class:`io.RawIOBase` que não seja :class:`io.FileIO`.

source: The ``'U'`` mode has been removed.
pt_br: O modo ``'U'`` foi removido.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
pt_br: Dada uma string que representa um caractere Unicode, retorna um número inteiro representando o ponto de código Unicode desse caractere. Por exemplo, ``ord('a')`` retorna o número inteiro ``97`` e ``ord('€')`` (sinal do Euro) retorna ``8364``. Este é o inverso de :func:`chr`.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
pt_br: Retorna *base* à potência de *exp*; se *mod* estiver presente, retorna *base* à potência *exp*, módulo *mod* (calculado com mais eficiência do que ``pow(base, exp) % mod``). A forma de dois argumentos ``pow(base, exp)`` é equivalente a usar o operador de potência: ``base**exp``.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``pow(10, 2)`` returns ``100``, but ``pow(10, -2)`` returns ``0.01``. For a negative base of type :class:`int` or :class:`float` and a non-integral exponent, a complex result is delivered. For example, ``pow(-9, 0.5)`` returns a value close to ``3j``. Whereas, for a negative base of type :class:`int` or :class:`float` with an integral exponent, a float result is delivered. For example, ``pow(-9, 2.0)`` returns ``81.0``.
pt_br: Os argumentos devem ter tipos numéricos. Com tipos de operandos mistos, aplicam-se as regras de coerção para operadores aritméticos binários. Para operandos :class:`int`, o resultado tem o mesmo tipo que os operandos (após coerção), a menos que o segundo argumento seja negativo; nesse caso, todos os argumentos são convertidos em ponto flutuante e um resultado ponto flutuante é entregue. Por exemplo, ``pow(10, 2)`` retorna ``100``, mas ``pow(10, -2)`` retorna ``0.01``. Para uma base negativa do tipo :class:`int` ou :class:`float` e um expoente não integral, um resultado complexo é entregue. Por exemplo, ``pow(-9, 0.5)`` retorna um valor próximo a ``3j``. Enquanto isso, para uma base negativa do tipo :class:`int` ou :class:`float` com um expoente integral, um resultado de ponto flutuante é retornado. Por exemplo, ``pow(-9, 2.0)`` retorna ``81.0``.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
pt_br: Para operandos :class:`int` *base* e *exp*, se *mod* estiver presente, *mod* também deve ser do tipo inteiro e *mod* deve ser diferente de zero. Se *mod* estiver presente e *exp* for negativo, *base* deve ser relativamente primo para *mod*. Nesse caso, ``pow(inv_base, -exp, mod)`` é retornado, onde *inv_base* é um inverso ao *base* módulo *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
pt_br: Aqui está um exemplo de computação de um inverso para ``38`` módulo ``97``::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
pt_br: Para operandos :class:`int`, a forma de três argumentos de ``pow`` agora permite que o segundo argumento seja negativo, permitindo o cálculo de inversos modulares.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
pt_br: Permite argumentos de palavra reservada. Anteriormente, apenas argumentos posicionais eram suportados.

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file*, and *flush*, if present, must be given as keyword arguments.
pt_br: Exibe *objects* no fluxo de texto *arquivo*, separado por *sep* e seguido por *end*. *sep*, *end*, *file* e *flush*, se houver, devem ser fornecidos como argumentos nomeados.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
pt_br: Todos os argumentos que não são nomeados são convertidos em strings como :func:`str` faz e gravados no fluxo, separados por *sep* e seguidos por *end*. *sep* e *end* devem ser strings; eles também podem ser ``None``, o que significa usar os valores padrão. Se nenhum *object* for fornecido, :func:`print` escreverá apenas *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
pt_br: O argumento *file* deve ser um objeto com um método ``write(string)``; se ele não estiver presente ou ``None``, então :data:`sys.stdout` será usado. Como argumentos exibidos no console são convertidos para strings de texto, :func:`print` não pode ser usado com objetos de arquivo em modo binário. Para esses casos, use ``file.write(...)`` ao invés.

source: Output buffering is usually determined by *file*. However, if *flush* is true, the stream is forcibly flushed.
pt_br: O buffer de saída geralmente é determinado por *arquivo*. No entanto, se *flush* for verdadeiro, o fluxo será descarregado à força.

source: Added the *flush* keyword argument.
pt_br: Adicionado o argumento nomeado *flush*.

source: Return a property attribute.
pt_br: Retorna um atributo de propriedade.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
pt_br: *fget* é uma função para obter o valor de um atributo. *fset* é uma função para definir um valor para um atributo. *fdel* é uma função para deletar um valor de um atributo. E *doc* cria um docstring para um atributo.

source: A typical use is to define a managed attribute ``x``::
pt_br: Um uso comum é para definir um atributo gerenciável ``x``::

source: class C: def __init__(self): self._x = None def getx(self): return self._x def setx(self, value): self._x = value def delx(self): del self._x x = property(getx, setx, delx, "I'm the 'x' property.")
pt_br: class C: def __init__(self): self._x = None def getx(self): return self._x def setx(self, valor): self._x = valor def delx(self): del self._x x = property(getx, setx, delx, "Eu sou a propriedade de 'x'.")

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter, and ``del c.x`` the deleter.
pt_br: Se *c* é uma instância de *C*, ``c.x`` irá invocar o método getter, ``c.x = valor`` irá invocar o método setter, e ``del c.x`` o método deleter.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
pt_br: Se fornecido, *doc* será a docstring do atributo definido por property. Caso contrário, a property copiará a docstring de *fget* (se ela existir). Isso torna possível criar facilmente propriedades apenas para leitura usando :func:`property` como um :term:`decorador`::

source: class Parrot: def __init__(self): self._voltage = 100000 @property def voltage(self): """Get the current voltage.""" return self._voltage
pt_br: class Parrot: def __init__(self): self._voltagem = 100000 @property def voltagem(self): """Obtém a voltagem atual.""" return self._voltagem

source: The ``@property`` decorator turns the :meth:`!voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
pt_br: O decorador ``@property`` transforma o método :meth:`!voltage` em um "getter" para um atributo somente leitura com o mesmo nome, e define a docstring de *voltage* para "Get the current voltage."

source: A property object has ``getter``, ``setter``, and ``deleter`` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example:
pt_br: Um objeto property possui métodos ``getter``, ``setter`` e ``deleter`` usáveis como decoradores, que criam uma cópia da property com o assessor correspondente a função definida para a função com decorador. Isso é explicado melhor com um exemplo::

source: class C: def __init__(self): self._x = None @property def x(self): """I'm the 'x' property.""" return self._x @x.setter def x(self, value): self._x = value @x.deleter def x(self): del self._x
pt_br: class C: def __init__(self): self._x = None @property def x(self): """Sou a propriedade de 'x'.""" return self._x @x.setter def x(self, value): self._x = value @x.deleter def x(self): del self._x

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
pt_br: Esse código é exatamente equivalente ao primeiro exemplo. Tenha certeza de nas funções adicionais usar o mesmo nome que a property original (``x`` neste caso).

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
pt_br: O objeto property retornado também tem os atributos ``fget``, ``fset``, e ``fdel`` correspondendo aos argumentos do construtor.

source: The docstrings of property objects are now writeable.
pt_br: Agora é possível escrever nas docstrings de objetos property.

source: Attribute holding the name of the property. The name of the property can be changed at runtime.
pt_br: Atributo que contém o nome da propriedade. O nome da propriedade pode ser alterado em tempo de execução.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
pt_br: Em vez de ser uma função, :class:`range` é realmente um tipo de sequência imutável, conforme documentado em :ref:`typesseq-range` e :ref:`typesseq`.

source: Return a string containing a printable representation of an object. For many types, this function makes an attempt to return a string that would yield an object with the same value when passed to :func:`eval`; otherwise, the representation is a string enclosed in angle brackets that contains the name of the type of the object together with additional information often including the name and address of the object. A class can control what this function returns for its instances by defining a :meth:`~object.__repr__` method. If :func:`sys.displayhook` is not accessible, this function will raise :exc:`RuntimeError`.
pt_br: Retorna uma string contendo uma representação imprimível de um objeto. Para muitos tipos, essa função tenta retornar uma string que produziria um objeto com o mesmo valor quando passado para :func:`eval`, caso contrário, a representação é uma string entre colchetes angulares que contém o nome do tipo do objeto juntamente com informações adicionais, geralmente incluindo o nome e o endereço do objeto. Uma classe pode controlar o que essa função retorna para suas instâncias, definindo um método :meth:`~object.__repr__`. Se :func:`sys.displayhook` não estiver acessível, esta função vai levantar :exc:`RuntimeError`.

source: This class has a custom representation that can be evaluated::
pt_br: Esta classe possui uma representação personalizada que pode ser executada::

source: class Person: def __init__(self, name, age): self.name = name self.age = age def __repr__(self): return f"Person('{self.name}', {self.age})"
pt_br: class Pessoa: def __init__(self, nome, idade): self.name = nome self.age = idade def __repr__(self): return f"Pessoa('{self.nome}', {self.idade})"

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`~object.__reversed__` method or supports the sequence protocol (the :meth:`~object.__len__` method and the :meth:`~object.__getitem__` method with integer arguments starting at ``0``).
pt_br: Retorna um :term:`iterador <iterator>` reverso. *seq* deve ser um objeto que possui o método :meth:`~object.__reversed__` ou suporta o protocolo de sequência (o método :meth:`~object.__len__` e o método :meth:`~object.__getitem__` com argumentos inteiros começando em ``0``).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
pt_br: Retorna *number* arredondado para *ndigits* precisão após o ponto decimal. Se *ndigits* for omitido ou for ``None``, ele retornará o número inteiro mais próximo de sua entrada.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise, the return value has the same type as *number*.
pt_br: Para os tipos embutidos com suporte a :func:`round`, os valores são arredondados para o múltiplo mais próximo de 10 para a potência de menos *ndigit*; se dois múltiplos são igualmente próximos, o arredondamento é feito para a opção par (por exemplo, ``round(0.5)`` e ``round(-0.5)`` são ``0`` e ``round(1.5)`` é ``2``). Qualquer valor inteiro é válido para *ndigits* (positivo, zero ou negativo). O valor de retorno é um número inteiro se *ndigits* for omitido ou ``None``. Caso contrário, o valor de retorno tem o mesmo tipo que *number*.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
pt_br: Para um objeto Python geral ``number``, ``round`` delega para ``number.__round__``.
