Repository: python/python-docs-pt-br
Catalog: library/functions.po
Languages: pt_br

source: Subclasses of :class:`!type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
pt_br: Subclasses de :class:`!type` que não substituem ``type.__new__`` não podem mais usar a forma com apenas um argumento para obter o tipo de um objeto.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`!__dict__` attribute.
pt_br: Retorna o atributo :attr:`~object.__dict__` para um módulo, classe, instância, or qualquer outro objeto com um atributo :attr:`!__dict__`.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`!__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
pt_br: Objetos como modelos e instâncias têm um atributo atualizável :attr:`~object.__dict__`; porém, outros projetos podem ter restrições de escrita em seus atributos :attr:`!__dict__` (por exemplo, classes usam um :class:`types.MappingProxyType` para prevenir atualizações diretas a dicionário).

source: Without an argument, :func:`vars` acts like :func:`locals`.
pt_br: Sem nenhum argumento, :func:`vars` age como :func:`locals`.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
pt_br: Uma exceção :exc:`TypeError` é levantada se um objeto é especificado, mas ela não tem um atributo :attr:`~object.__dict__` (por exemplo, se sua classe define o atributo :attr:`~object.__slots__`).

source: The result of calling this function without an argument has been updated as described for the :func:`locals` builtin.
pt_br: O resultado de chamar esta função sem um argumento foi atualizado conforme descrito na embutida :func:`locals`.

source: Iterate over several iterables in parallel, producing tuples with an item from each one.
pt_br: Itera sobre vários iteráveis em paralelo, produzindo tuplas com um item de cada um.

source: Example::
pt_br: Exemplo::

source: >>> for item in zip([1, 2, 3], ['sugar', 'spice', 'everything nice']): ... print(item) ... (1, 'sugar') (2, 'spice') (3, 'everything nice')
pt_br: >>> for item in zip([1, 2, 3], ['açúcar', 'tempero', 'tudo que há de bom']): ... print(item) ... (1, 'açúcar') (2, 'tempero') (3, 'tudo que há de bom')

source: More formally: :func:`zip` returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument iterables.
pt_br: Mais formalmente: :func:`zip` retorna um iterador de tuplas, onde a *i*-ésima tupla contém o *i*-ésimo elemento de cada um dos iteráveis do argumento.

source: Another way to think of :func:`zip` is that it turns rows into columns, and columns into rows. This is similar to `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_.
pt_br: Outra maneira de pensar em :func:`zip` é que ela transforma linhas em colunas e colunas em linhas. Isso é semelhante a `transpor uma matriz <https://en.wikipedia.org/wiki/Transpose>`_.

source: :func:`zip` is lazy: The elements won't be processed until the iterable is iterated on, e.g. by a :keyword:`!for` loop or by wrapping in a :class:`list`.
pt_br: :func:`zip` é preguiçoso: Os elementos não serão processados até que o iterável seja iterado. Por exemplo, por um loop :keyword:`!for` ou por um :class:`list`.

source: One thing to consider is that the iterables passed to :func:`zip` could have different lengths; sometimes by design, and sometimes because of a bug in the code that prepared these iterables. Python offers three different approaches to dealing with this issue:
pt_br: Uma coisa a considerar é que os iteráveis passados para :func:`zip` podem ter comprimentos diferentes; às vezes por design e às vezes por causa de um bug no código que preparou esses iteráveis. Python oferece três abordagens diferentes para lidar com esse problema:

source: By default, :func:`zip` stops when the shortest iterable is exhausted. It will ignore the remaining items in the longer iterables, cutting off the result to the length of the shortest iterable::
pt_br: Por padrão, :func:`zip` para quando o iterável mais curto se esgota. Ele irá ignorar os itens restantes nos iteráveis mais longos, cortando o resultado para o comprimento do iterável mais curto::

source: >>> list(zip(range(3), ['fee', 'fi', 'fo', 'fum'])) [(0, 'fee'), (1, 'fi'), (2, 'fo')]
pt_br: >>> list(zip(range(3), ['fi', 'fa', 'fo', 'fum'])) [(0, 'fi'), (1, 'fa'), (2, 'fo')]

source: :func:`zip` is often used in cases where the iterables are assumed to be of equal length. In such cases, it's recommended to use the ``strict=True`` option. Its output is the same as regular :func:`zip`::
pt_br: :func:`zip` é frequentemente usado em casos onde os iteráveis são considerados de tamanho igual. Nesses casos, é recomendado usar a opção ``strict=True``. Sua saída é a mesma do :func:`zip`:: normal

source: Unlike the default behavior, it raises a :exc:`ValueError` if one iterable is exhausted before the others:
pt_br: Ao contrário do comportamento padrão, ele levanta uma exceção :exc:`ValueError` se um iterável for esgotado antes dos outros:

source: Without the ``strict=True`` argument, any bug that results in iterables of different lengths will be silenced, possibly manifesting as a hard-to-find bug in another part of the program.
pt_br: Sem o argumento ``strict=True``, qualquer bug que resulte em iteráveis de diferentes comprimentos será silenciado, possivelmente se manifestando como um bug difícil de encontrar em outra parte do programa.

source: Shorter iterables can be padded with a constant value to make all the iterables have the same length. This is done by :func:`itertools.zip_longest`.
pt_br: Iteráveis mais curtos podem ser preenchidos com um valor constante para fazer com que todos os iteráveis tenham o mesmo comprimento. Isso é feito por :func:`itertools.zip_longest`.

source: Edge cases: With a single iterable argument, :func:`zip` returns an iterator of 1-tuples. With no arguments, it returns an empty iterator.
pt_br: Casos extremos: Com um único argumento iterável, :func:`zip` retorna um iterador de tuplas de um elemento. Sem argumentos, retorna um iterador vazio.

source: Tips and tricks:
pt_br: Dicas e truques:

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n, strict=True)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
pt_br: A ordem de avaliação da esquerda para a direita dos iteráveis é garantida. Isso torna possível um idioma para agrupar uma série de dados em grupos de comprimento n usando ``zip(*[iter(s)]*n, strict=True)``. Isso repete o *mesmo* iterador ``n`` vezes para que cada tupla de saída tenha o resultado de chamadas ``n`` para o iterador. Isso tem o efeito de dividir a entrada em pedaços de n comprimentos.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
pt_br: :func:`zip` em conjunto com o operador ``*`` pode ser usado para descompactar uma lista::

source: Added the ``strict`` argument.
pt_br: Adicionado o argumento ``strict``.

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
pt_br: Esta é uma função avançada que não é necessária na programação diária do Python, ao contrário de :func:`importlib.import_module`.

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
pt_br: Esta função é chamada pela instrução :keyword:`import`. Ela pode ser substituída (importando o módulo :mod:`builtins` e atribuindo a ``builtins.__import__``) para alterar a semântica da instrução :keyword:`!import`, mas isso é **fortemente** desencorajado, pois geralmente é mais simples usar ganchos de importação (consulte :pep:`302`) para atingir os mesmos objetivos e não causa problemas com o código que pressupõe que a implementação de importação padrão esteja em uso. O uso direto de :func:`__import__` também é desencorajado em favor de :func:`importlib.import_module`.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all and uses its *globals* only to determine the package context of the :keyword:`import` statement.
pt_br: A função importa o módulo *name*, potencialmente usando os dados *globals* e *locals* para determinar como interpretar o nome em um contexto de pacote. O *fromlist* fornece os nomes de objetos ou submódulos que devem ser importados do módulo, fornecidos por *name*. A implementação padrão não usa seu argumento *locals* e usa seus *globals* apenas para determinar o contexto do pacote da instrução :keyword:`import`.

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
pt_br: *level* especifica se é necessário usar importações absolutas ou relativas. ``0`` (o padrão) significa apenas realizar importações absolutas. Valores positivos para *level* indicam o número de diretórios pai a serem pesquisados em relação ao diretório do módulo que chama :func:`__import__` (consulte :pep:`328` para obter detalhes).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
pt_br: Quando a variável *name* está no formato ``pacote.módulo``, normalmente, o pacote de nível superior (o nome até o primeiro ponto) é retornado, *não* o módulo nomeado por *name*. No entanto, quando um argumento *fromlist* não vazio é fornecido, o módulo nomeado por *name* é retornado.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
pt_br: Por exemplo, a instrução ``import spam`` resulta em bytecode semelhante ao seguinte código::

source: The statement ``import spam.ham`` results in this call::
pt_br: A instrução ``import spam.presunto`` resulta nesta chamada::

source: spam = __import__('spam.ham', globals(), locals(), [], 0)
pt_br: spam = __import__('spam.presunto', globals(), locals(), [], 0)

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
pt_br: Observe como :func:`__import__` retorna o módulo de nível superior aqui, porque este é o objeto vinculado a um nome pela instrução :keyword:`import`.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
pt_br: Por outro lado, a instrução ``from spam.presunto import ovos, salsicha as sals`` resulta em ::

source: _temp = __import__('spam.ham', globals(), locals(), ['eggs', 'sausage'], 0) eggs = _temp.eggs saus = _temp.sausage
pt_br: _temp = __import__('spam.presunto', globals(), locals(), ['ovos', 'salsicha'], 0) ovos = _temp.ovos sals = _temp.salsicha

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
pt_br: Aqui, o módulo ``spam.ham`` é retornado de :func:`__import__`. A partir desse objeto, os nomes a serem importados são recuperados e atribuídos aos seus respectivos nomes.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
pt_br: Se você simplesmente deseja importar um módulo (potencialmente dentro de um pacote) pelo nome, use :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
pt_br: Valores negativos para *level* não são mais suportados (o que também altera o valor padrão para 0).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
pt_br: Quando as opções de linha de comando :option:`-E` ou :option:`-I` estão sendo usadas, a variável de ambiente :envvar:`PYTHONCASEOK` é agora ignorada.

source: Footnotes
pt_br: Notas de rodapé

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
pt_br: Observe que o analisador sintático aceita apenas a convenção de fim de linha no estilo Unix. Se você estiver lendo o código de um arquivo, use o modo de conversão de nova linha para converter novas linhas no estilo Windows ou Mac.

source: Boolean
pt_br: Booleano

source: type
pt_br: tipo

source: built-in function
pt_br: função embutida

source: format() (built-in function)
pt_br: format() (função embutida)

source: file object
pt_br: objeto arquivo

source: open() built-in function
pt_br: função embutida open()

source: file
pt_br: arquivo

source: modes
pt_br: modos

source: universal newlines
pt_br: novas linhas universais

source: line-buffered I/O
pt_br: E/S com buffer de linha

source: unbuffered I/O
pt_br: E/S sem buffer

source: buffer size, I/O
pt_br: buffer, tamanho, E/S

source: I/O control
pt_br: controle de E/S

source: text mode
pt_br: texto, modo

source: module
pt_br: módulo

source: str() (built-in function)
pt_br: str() (função embutida)

source: object
pt_br: objeto

source: statement
pt_br: instrução

source: import
pt_br: importação
