Repository: python/python-docs-pt-br
Catalog: library/functions.po
Languages: pt_br

source: If the argument is a string, it must contain either a real part (in the same format as for :func:`float`) or an imaginary part (in the same format but with a ``'j'`` or ``'J'`` suffix), or both real and imaginary parts (the sign of the imaginary part is mandatory in this case). The string can optionally be surrounded by whitespaces and the round parentheses ``'('`` and ``')'``, which are ignored. The string must not contain whitespace between ``'+'``, ``'-'``, the ``'j'`` or ``'J'`` suffix, and the decimal number. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`. More precisely, the input must conform to the :token:`~float:complexvalue` production rule in the following grammar, after parentheses and leading and trailing whitespace characters are removed:
pt_br: Se o argumento for uma string, ele deve conter ou a parte real (com o mesmo formato usado em :func:`float`) ou uma parte imaginária (com o mesmo formato, mas com um sufixo ``'j'`` ou ``'J'``), ou então ambas as partes real e imaginária (caso no qual o sinal da parte imaginária é obrigatório). A string pode opcionalmente ser cercada por espaços em branco e parênteses ``'('`` e ``')'``, que são ignorados. A string não deve conter espaços em branco entre os símbolos ``'+'``, ``'-'``, o sufixo ``'j'`` ou ``'J'``, e o número decimal. Por examplo, ``complex('1+2j')`` é ok, mas ``complex('1 + 2j')`` levanta :exc:`ValueError`. Mais precisamente, após descartar os parênteses e os espaços em branco do início e do final, a entrada deve ser conforme a regra de produção :token:`~float:complexvalue` da gramática a seguir:

source: If the argument is a number, the constructor serves as a numeric conversion like :class:`int` and :class:`float`. For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If :meth:`~object.__complex__` is not defined then it falls back to :meth:`~object.__float__`. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`.
pt_br: Se o argumento for um número, o construtor serve como uma conversão numérica tal qual :class:`int` e :class:`float`. Para um objeto Python ``x`` qualquer, ``complex(x)`` delega para ``x.__complex__()``. Se :meth:`~object.__complex__` não está definido então a chamada é repassada para :meth:`~object.__float__`. Se :meth:`!__float__` não está definido então a chamada é, novamente, repassada para :meth:`~object.__index__`.

source: If two arguments are provided or keyword arguments are used, each argument may be any numeric type (including complex). If both arguments are real numbers, return a complex number with the real component *real* and the imaginary component *imag*. If both arguments are complex numbers, return a complex number with the real component ``real.real-imag.imag`` and the imaginary component ``real.imag+imag.real``. If one of arguments is a real number, only its real component is used in the above expressions.
pt_br: Se dois argumentos forem passados ou argumentos nomeados forem usados, cada argumento pode ser de qualquer tipo numérico (incluindo complexo). Se ambos argumentos forem números reais, é retornado um número complexo com *real* como parte real e *imag* como parte imaginária. Se ambos os argumentos forem números complexos, é retornado um número complexo com parte real ``real.real-imag.imag`` e parte imaginária ``real.imag+imag.real``. Se um dos argumentos for um número real, somente a sua parte real é usada nas expressões anteriores.

source: If all arguments are omitted, returns ``0j``.
pt_br: Se todos os argumentos forem omitidos, retorna ``0j``.

source: The complex type is described in :ref:`typesnumeric`.
pt_br: O tipo complexo está descrito em :ref:`typesnumeric`.

source: Grouping digits with underscores as in code literals is allowed.
pt_br: Agrupar dígitos com sublinhados como em literais de código é permitido.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__complex__` and :meth:`~object.__float__` are not defined.
pt_br: Chamadas para :meth:`~object.__index__` se :meth:`~object.__complex__` e :meth:`~object.__float__` não estão definidas.

source: This is a relative of :func:`setattr`. The arguments are an object and a string. The string must be the name of one of the object's attributes. The function deletes the named attribute, provided the object allows it. For example, ``delattr(x, 'foobar')`` is equivalent to ``del x.foobar``. *name* need not be a Python identifier (see :func:`setattr`).
pt_br: Essa função está relacionada com :func:`setattr`. Os argumentos são um objeto e uma string. A string deve ser o nome de um dos atributos do objeto. A função remove o atributo indicado, desde que o objeto permita. Por exemplo, ``delattr(x, 'foobar')`` é equivalente a ``del x.foobar``. *name* não precisa ser um identificador Python (veja :func:`setattr`).

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
pt_br: Cria um novo dicionário. O objeto :class:`dict` é a classe do dicionário. Veja :class:`dict` e :ref:`typesmapping` para documentação sobre esta classe.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
pt_br: Para outros contêineres, consulte as classes embutidas :class:`list`, :class:`set` e :class:`tuple`, bem como o módulo :mod:`collections`.

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
pt_br: Sem argumentos, devolve a lista de nomes no escopo local atual. Com um argumento, tentará devolver uma lista de atributos válidos para esse objeto.

source: If the object has a method named :meth:`~object.__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`~object.__getattr__` or :func:`~object.__getattribute__` function to customize the way :func:`dir` reports their attributes.
pt_br: Se o objeto tiver um método chamado :meth:`~object.__dir__`, esse método será chamado e deve devolver a lista de atributos. Isso permite que objetos que implementam uma função personalizada :func:`~object.__getattr__` ou :func:`~object.__getattribute__` personalizem a maneira como :func:`dir` relata seus atributos.

source: If the object does not provide :meth:`~object.__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete and may be inaccurate when the object has a custom :func:`~object.__getattr__`.
pt_br: Se o objeto não fornecer :meth:`__dir__`, a função tentará o melhor possível para coletar informações do atributo :attr:`~object.__dict__` do objeto, se definido, e do seu objeto de tipo. A lista resultante não está necessariamente completa e pode ser imprecisa quando o objeto possui um :func:`~object.__getattr__` personalizado.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
pt_br: O mecanismo padrão :func:`dir` se comporta de maneira diferente com diferentes tipos de objetos, pois tenta produzir as informações mais relevantes e não completas:

source: If the object is a module object, the list contains the names of the module's attributes.
pt_br: Se o objeto for um objeto de módulo, a lista conterá os nomes dos atributos do módulo.

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
pt_br: Se o objeto for um objeto de tipo ou classe, a lista conterá os nomes de seus atributos e recursivamente os atributos de suas bases.

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
pt_br: Caso contrário, a lista conterá os nomes dos atributos do objeto, os nomes dos atributos da classe e recursivamente os atributos das classes base da classe.

source: The resulting list is sorted alphabetically. For example:
pt_br: A lista resultante é alfabeticamente ordenada. Por exemplo:

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
pt_br: Como :func:`dir` é fornecido principalmente como uma conveniência para uso em um prompt interativo, ele tenta fornecer um conjunto interessante de nomes mais do que tenta fornecer um conjunto de nomes definido de forma rigorosa ou consistente, e seu comportamento detalhado pode mudar nos lançamentos. Por exemplo, os atributos de metaclasse não estão na lista de resultados quando o argumento é uma classe.

source: Take two (non-complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating-point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
pt_br: Recebe dois números (não complexos) como argumentos e retorna um par de números que consiste em seu quociente e resto ao usar a divisão inteira. Com tipos de operandos mistos, as regras para operadores aritméticos binários se aplicam. Para números inteiros, o resultado é o mesmo que ``(a // b, a % b)``. Para números de ponto flutuante, o resultado é ``(q, a % b)``, onde *q* geralmente é ``math.floor(a / b)``, mas pode ser 1 a menos que isso. Em qualquer caso, ``q * b + a % b`` está muito próximo de *a*, se ``a % b`` é diferente de zero, tem o mesmo sinal que *b* e ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
pt_br: Devolve um objeto enumerado. *iterable* deve ser uma sequência, um :term:`iterador` ou algum outro objeto que suporte a iteração. O método :meth:`~iterator.__next__` do iterador retornado por :func:`enumerate` devolve uma tupla contendo uma contagem (a partir de *start*, cujo padrão é 0) e os valores obtidos na iteração sobre *iterable*.

source: Equivalent to::
pt_br: Equivalente a::

source: Parameters
pt_br: Parâmetros

source: A Python expression.
pt_br: Uma expressão Python.

source: The global namespace (default: ``None``).
pt_br: O espaço de nomes global (por padrão, ``None``).

source: The local namespace (default: ``None``).
pt_br: O espaço de nomes local (por padrão, ``None``).

source: Returns
pt_br: Retorna

source: The result of the evaluated expression.
pt_br: O resultado da expressão avaliada.

source: raises
pt_br: levanta

source: Syntax errors are reported as exceptions.
pt_br: Erros de sintaxe são reportados como exceções.

source: This function executes arbitrary code. Calling it with user-supplied input may lead to security vulnerabilities.
pt_br: Esta função executa código arbitrário. Chamá-la com entrada fornecida pelo usuário pode levar a vulnerabilidades de segurança.

source: The *expression* argument is parsed and evaluated as a Python expression (technically speaking, a condition list) using the *globals* and *locals* mappings as global and local namespace. If the *globals* dictionary is present and does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key before *expression* is parsed. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`eval`. If the *locals* mapping is omitted it defaults to the *globals* dictionary. If both mappings are omitted, the expression is executed with the *globals* and *locals* in the environment where :func:`eval` is called. Note, *eval()* will only have access to the :term:`nested scopes <nested scope>` (non-locals) in the enclosing environment if they are already referenced in the scope that is calling :func:`eval` (e.g. via a :keyword:`nonlocal` statement).
pt_br: O argumento *expression* é analisado e avaliado como uma expressão Python (tecnicamente falando, uma lista de condições) usando os mapeamentos *globals* e *locals* como espaços de nomes globais e locais. Se o dicionário *globals* estiver presente e não contiver um valor para a chave ``__builtins__``, uma referência ao dicionário do módulo embutido :mod:`builtins` será inserida sob essa chave antes de *expression* ser analisado. Dessa forma, você pode controlar quais funções embutidas estão disponíveis para o código executado inserindo seu próprio dicionário ``__builtins__`` em *globals* antes de passá-lo para :func:`eval`. Se o mapeamento *locals* for omitido, o padrão será o dicionário *globals*. Se os dois mapeamentos forem omitidos, a expressão será executada com os *globals* e *locals* no ambiente em que :func:`eval` é chamado. Observe que *eval()* terá acesso a :term:`escopos aninhados <nested scope>` (não locais) no ambiente anexo somente se eles já forem referenciados pelo escopo que está chamando :func:`eval` (por exemplo, via uma instrução :keyword:`nonlocal`).

source: Example:
pt_br: Exemplo:

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case, pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
pt_br: Esta função também pode ser usada para executar objetos código arbitrários (como os criados por :func:`compile`). Nesse caso, passe um objeto código em vez de uma string. Se o objeto código foi compilado com ``'exec'`` como o argumento *mode*, o valor de retorno de :func:`eval` será ``None``.

source: Hints: dynamic execution of statements is supported by the :func:`exec` function. The :func:`globals` and :func:`locals` functions return the current global and local dictionary, respectively, which may be useful to pass around for use by :func:`eval` or :func:`exec`.
pt_br: Dicas: a execução dinâmica de instruções é suportada pela função :func:`exec`. As funções :func:`globals` e :func:`locals` retornam o dicionário global e local atual, respectivamente, o que pode ser útil para ser usado por :func:`eval` ou :func:`exec`.

source: If the given source is a string, then leading and trailing spaces and tabs are stripped.
pt_br: Se a fonte fornecida for uma string, os espaços e tabulações à esquerda ou à direita serão removidos.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
pt_br: Veja :func:`ast.literal_eval` para uma função que pode avaliar com segurança strings com expressões contendo apenas literais.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``exec`` com o código objeto como argumento. Eventos de compilação de código também podem ser levantados.

source: The *globals* and *locals* arguments can now be passed as keywords.
pt_br: Os argumentos *globals* e *locals* podem agora ser passados como argumentos nomeados.

source: The semantics of the default *locals* namespace have been adjusted as described for the :func:`locals` builtin.
pt_br: A forma de uso do espaço de nomes *locals* padrão foi ajustado conforme descrito na função embutida :func:`locals`.

source: This function supports dynamic execution of Python code. *source* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section :ref:`file-input` in the Reference Manual). Be aware that the :keyword:`nonlocal`, :keyword:`yield`, and :keyword:`return` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
pt_br: Esta função suporta a execução dinâmica de código Python. O parâmetro *source* deve ser ou uma string ou um objeto código. Se for uma string, a mesma é analisada como um conjunto de instruções Python, o qual é então executado (exceto caso um erro de sintaxe ocorra). [#]_ Se for um objeto código, ele é simplesmente executado. Em todos os casos, espera-se que o código a ser executado seja válido como um arquivo de entrada (veja a seção :ref:`file-input` no Manual de Referência). Tenha cuidado, pois as instruções :keyword:`nonlocal`, :keyword:`yield` e :keyword:`return` não podem ser usadas fora das definições de funções mesmo dentro do contexto do código passado para a função :func:`exec` . O valor de retorno é sempre ``None``.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at the module level, globals and locals are the same dictionary.
pt_br: Em todos os casos, se os parâmetros opcionais são omitidos, o código é executado no escopo atual. Se somente *globals* é fornecido, deve ser um dicionário (e não uma subclasse de dicionário), que será usado tanto para as variáveis globais quanto para locais. Se *globals* e *locals* são fornecidos, eles são usados para as variáveis globais e locais, respectivamente. Se fornecido, *locals* pode ser qualquer objeto de mapeamento. Lembre que no nível de módulo, globais e locais são o mesmo dicionário.

source: When ``exec`` gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition. This means functions and classes defined in the executed code will not be able to access variables assigned at the top level (as the "top level" variables are treated as class variables in a class definition).
pt_br: Quando or ``exec`` recebe dois objetos separados como *globals* and *locals*, o código será executado como se estivesse embutido em uma definição de classe. Isso significa que funções e classes definidas no código executado não poderão acessar variáveis que sofreram atribuições no escopo mais externo (pois, em uma definição de classe, tais variáveis seriam tratadas como variáveis de classe).

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
pt_br: Se o dicionário *globals* não contém um valor para a chave ``__builtins__``, a referência para o dicionário do módulo embutido :mod:`builtins` é inserido com essa chave. A maneira que você pode controlar quais embutidos estão disponíveis para o código executado é inserindo seu próprio ``__builtins__`` dicionário em *globals* antes de passar para :func:`exec`.

source: The *closure* argument specifies a closure--a tuple of cellvars. It's only valid when the *object* is a code object containing :term:`free (closure) variables <closure variable>`. The length of the tuple must exactly match the length of the code object's :attr:`~codeobject.co_freevars` attribute.
pt_br: O argumento *closure* especifica uma clausura -- uma tupla de cellvars. Só é válido quando o *objeto* é um objeto código contendo :term:`variáveis livres (de clausura) <closure variable>`. O comprimento da tupla deve corresponder exatamente ao comprimento do atributo :attr:`~codeobject.co_freevars` do objeto código.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local namespace, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
pt_br: As funções embutidas :func:`globals` e :func:`locals` devolvem o espaço de nomes global e local, respectivamente, o que pode ser útil para passar adiante e usar como segundo ou terceiro argumento para :func:`exec`.

source: The default *locals* act as described for function :func:`locals` below. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
pt_br: *locals* padrão atua como descrito pela função :func:`locals` abaixo. Se você precisa ver efeitos do código em *locals* depois da função :func:`exec` retornar passe um dicionário *locals* explícito.

source: Added the *closure* parameter.
pt_br: Adicionado o parâmetro *closure*.

source: Construct an iterator from those elements of *iterable* for which *function* is true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
pt_br: Constrói um iterador a partir dos elementos de *iterable* para os quais *function* é verdadeiro. *iterable* pode ser uma sequência, um contêiner que com suporte a iteração, ou um iterador. Se *function* for ``None``, a função identidade será usada, isto é, todos os elementos de *iterable* que são falsos são removidos.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
pt_br: Note que ``filter(function, iterable)`` é equivalente a expressão geradora ``(item for item in iterable if function(item))`` se *function* não for ``None`` e ``(item for item in iterable if item)`` se *function* for ``None``.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* is false.
pt_br: Veja :func:`itertools.filterfalse` para a função complementar que devolve elementos de *iterable* para os quais *function* é falso.

source: Return a floating-point number constructed from a number or a string.
pt_br: Retorna um número de ponto flutuante construído a partir de um número ou string.
