Repository: python/python-docs-pt-br
Catalog: library/functions.po
Languages: pt_br

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
pt_br: O comportamento de :func:`round` para pontos flutuantes pode ser surpreendente: por exemplo, ``round(2.675, 2)`` fornece ``2.67`` em vez do esperado ``2.68``. Isso não é um bug: é resultado do fato de que a maioria das frações decimais não pode ser representada exatamente como um ponto flutuante. Veja :ref:`tut-fp-issues` para mais informações.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
pt_br: Retorna um novo objeto :class:`set`, opcionalmente com elementos retirados de *iterable*. ``set`` é uma classe embutida. Veja :class:`set` e :ref:`types-set` para documentação sobre esta classe.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
pt_br: Para outros contêineres, consulte as classes embutidas :class:`frozenset`, :class:`list`, :class:`tuple` e :class:`dict`, bem como o módulo :mod:`collections`.

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string, and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
pt_br: Esta é a contrapartida de :func:`getattr`. Os argumentos são um objeto, uma string e um valor arbitrário. A string pode nomear um atributo existente ou um novo atributo. A função atribui o valor ao atributo, desde que o objeto permita. Por exemplo, ``setattr(x, 'foobar', 123)`` é equivalente a ``x.foobar = 123``.

source: *name* need not be a Python identifier as defined in :ref:`identifiers` unless the object chooses to enforce that, for example in a custom :meth:`~object.__getattribute__` or via :attr:`~object.__slots__`. An attribute whose name is not an identifier will not be accessible using the dot notation, but is accessible through :func:`getattr` etc..
pt_br: *name* não precisa ser um identificador do Python conforme definido em :ref:`identifiers` a menos que o objeto opte por impor isso, por exemplo, em um :meth:`~object.__getattribute__` personalizado ou via :attr:`~object.__slots__`. Um atributo cujo nome não é um identificador não será acessível usando a notação de ponto, mas pode ser acessado através de :func:`getattr` etc.

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to set it with :func:`setattr`.
pt_br: Uma vez que :ref:`desfiguração de nome privado <private-name-mangling>` acontece em tempo de compilação, deve-se manualmente mutilar o nome de um atributo privado (atributos com dois sublinhados à esquerda) para defini-lo com :func:`setattr`.

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``.
pt_br: Retorna um objeto :term:`fatia` representando o conjunto de índices especificados por ``range(start, stop, step)``. Os argumentos *start* e *step* têm o padrão ``None``.

source: Slice objects have read-only data attributes :attr:`!start`, :attr:`!stop`, and :attr:`!step` which merely return the argument values (or their default). They have no other explicit functionality; however, they are used by NumPy and other third-party packages.
pt_br: Objetos fatia têm atributos de dados somente leitura :attr:`!start`, :attr:`!stop` e :attr:`!step` que simplesmente retornam os valores dos argumentos (ou seus padrões). Eles não possuem outra funcionalidade explícita; no entanto, eles são usados pelo NumPy e outros pacotes de terceiros.

source: Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an :term:`iterator`.
pt_br: Objetos fatia também são gerados quando a sintaxe de indexação estendida é usada. Por exemplo: ``a[start:stop:step]`` ou ``a[start:stop, i]``. Veja :func:`itertools.islice` para uma versão alternativa que retorna um :term:`iterador`.

source: Slice objects are now :term:`hashable` (provided :attr:`~slice.start`, :attr:`~slice.stop`, and :attr:`~slice.step` are hashable).
pt_br: Os objetos slice agora são :term:`hasheáveis <hasheável>` (desde que :attr:`~slice.start`, :attr:`~slice.stop` e :attr:`~slice.step` sejam hasheáveis).

source: Return a new sorted list from the items in *iterable*.
pt_br: Retorna uma nova lista classificada dos itens em *iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
pt_br: Possui dois argumentos opcionais que devem ser especificados como argumentos nomeados.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
pt_br: *key* especifica a função de um argumento usado para extrair uma chave de comparação de cada elemento em *iterable* (por exemplo, ``key=str.lower``). O valor padrão é ``None`` (compara os elementos diretamente).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
pt_br: *reverse* é um valor booleano. Se definido igual a ``True``, então os elementos da lista são classificados como se cada comparação estivesse invertida.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
pt_br: Usa :func:`functools.cmp_to_key` para converter a função das antigas *cmp* para uma função *key*.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
pt_br: A função embutida :func:`sorted` é garantida como estável. Uma ordenação é estável se garantir não alterar a ordem relativa dos elementos que se comparam da mesma forma --- isso é útil para ordenar em várias passagens (por exemplo, ordenar por departamento e depois por nível de salário).

source: The sort algorithm uses only ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>` be implemented. This will help avoid bugs when using the same data with other ordering tools such as :func:`max` that rely on a different underlying method. Implementing all six comparisons also helps avoid confusion for mixed type comparisons which can call reflected the :meth:`~object.__gt__` method.
pt_br: O algoritmo de classificação usa apenas comparações ``<`` entre itens. Embora definir um método :meth:`~object.__lt__` seja suficiente para ordenação, :PEP:`8` recomenda que todas as seis :ref:`comparações ricas <comparisons>` sejam implementadas. Isso ajudará a evitar erros ao usar os mesmos dados com outras ferramentas de ordenação, como :func:`max`, que dependem de um método subjacente diferente. Implementar todas as seis comparações também ajuda a evitar confusão para comparações de tipo misto que podem chamar refletido o método :meth:`~object.__gt__`.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
pt_br: Para exemplos de classificação e um breve tutorial de classificação, veja :ref:`sortinghowto`.

source: Transform a method into a static method.
pt_br: Transforma um método em método estático.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
pt_br: Um método estático não recebe um primeiro argumento implícito. Para declarar um método estático, use este idioma::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
pt_br: A forma ``@staticmethod`` é uma função de :term:`decorador` -- veja :ref:`function` para detalhes.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). Moreover, the static method :term:`descriptor` is also callable, so it can be used in the class definition (such as ``f()``).
pt_br: Um método estático pode ser chamado na classe (tal como ``C.f()``) ou em uma instância (tal como ``C().f()``). Além disso, o :term:`descritor` de método estático também é um chamável, então ele pode ser usado na definição de classe (como ``f()``).

source: Static methods in Python are similar to those found in Java or C++. Also, see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
pt_br: Métodos estáticos em Python são similares àqueles encontrados em Java ou C++. Veja também :func:`classmethod` para uma variante útil na criação de construtores de classe alternativos.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
pt_br: Como todos os decoradores, também é possível chamar ``staticmethod`` como uma função regular e fazer algo com seu resultado. Isso é necessário em alguns casos em que você precisa de uma referência para uma função de um corpo de classe e deseja evitar a transformação automática em método de instância. Para esses casos, use este idioma::

source: def regular_function(): ... class C: method = staticmethod(regular_function)
pt_br: def função_comum(): ... class C: método = staticmethod(função_comum)

source: For more information on static methods, see :ref:`types`.
pt_br: Para mais informações sobre métodos estáticos, consulte :ref:`types`.

source: Static methods now inherit the method attributes (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` and :attr:`~function.__annotations__`), have a new ``__wrapped__`` attribute, and are now callable as regular functions.
pt_br: Métodos estáticos agora herdam os atributos do método (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` e :attr:`~function.__annotations__`), têm um novo atributo ``__wrapped__`` e são agora chamáveis como funções regulares.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
pt_br: Retorna uma versão :class:`str` de *object*. Consulte :func:`str` para detalhes.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
pt_br: ``str`` é uma :term:`classe` de string embutida. Para informações gerais sobre strings, consulte :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
pt_br: Soma *start* e os itens de um *iterable* da esquerda para a direita e retornam o total. Os itens do *iterable* são normalmente números e o valor inicial não pode ser uma string.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating-point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
pt_br: Para alguns casos de uso, existem boas alternativas para :func:`sum`. A maneira rápida e preferida de concatenar uma sequência de strings é chamando ``''.join(sequence)``. Para adicionar valores de ponto flutuante com precisão estendida, consulte :func:`math.fsum`. Para concatenar uma série de iteráveis, considere usar :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
pt_br: O parâmetro *start* pode ser especificado como um argumento nomeado.

source: Summation of floats switched to an algorithm that gives higher accuracy and better commutativity on most builds.
pt_br: A soma dos pontos flutuantes foi alterada para um algoritmo que oferece maior precisão e melhor comutatividade na maioria das compilações.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
pt_br: Retorna um objeto proxy que delega chamadas de método a uma classe pai ou irmão do *type*. Isso é útil para acessar métodos herdados que foram substituídos em uma classe.

source: The *object_or_type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
pt_br: O *object_or_type* determina a :term:`ordem de resolução de métodos` a ser pesquisada. A pesquisa inicia a partir da classe logo após o *type*.

source: For example, if :attr:`~type.__mro__` of *object_or_type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
pt_br: Por exemplo, se :attr:`~type.__mro__` de *object_or_type* é ``D -> B -> C -> A -> object`` e o valor de *type* é ``B``, então :func:`super` procura por ``C -> A -> object``.

source: The :attr:`~type.__mro__` attribute of the class corresponding to *object_or_type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
pt_br: O atributo :attr:`~type.__mro__` da classe correspondente ao *object_or_type* lista a ordem de pesquisa de resolução de método usada por :func:`getattr` e :func:`super`. O atributo é dinâmico e pode mudar sempre que a hierarquia da herança é atualizada.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
pt_br: Se o segundo argumento for omitido, o objeto super retornado é desacoplado. Se o segundo argumento é um objeto, ``isinstance(obj, type)`` deve ser verdadeiro. Se o segundo argumento é um tipo, ``issubclass(type2, type)`` deve ser verdadeiro (isto é útil para classmethods).

source: When called directly within an ordinary method of a class, both arguments may be omitted ("zero-argument :func:`!super`"). In this case, *type* will be the enclosing class, and *obj* will be the first argument of the immediately enclosing function (typically ``self``). (This means that zero-argument :func:`!super` will not work as expected within nested functions, including generator expressions, which implicitly create nested functions.)
pt_br: Quando chamado diretamente de dentro de um método comum de uma classe, pode-se omitir ambos os argumentos (":func:`!super` de zero argumentos"). Neste caso, *type* será a classe em questão, e *obj* será o primeiro argumento da função que imediatamente chamou ``super()`` (geralmente o ``self``). (Isso significa que o :func:`!super` de zero argumentos não vai funcionar como esperado em funções aninhadas, incluindo expressões geradoras, que criam funções aninhadas implicitamente.)

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
pt_br: Existem dois casos de uso típicos para *super*. Em uma hierarquia de classes com herança única, *super* pode ser usado para se referir a classes base sem nomeá-las explicitamente, tornando o código mais sustentável. Esse uso é paralelo ao uso de *super* em outras linguagens de programação.

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that such implementations have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
pt_br: O segundo caso de uso é oferecer suporte à herança múltipla cooperativa em um ambiente de execução dinâmica. Esse caso de uso é exclusivo do Python e não é encontrado em idiomas ou linguagens compiladas estaticamente que suportam apenas herança única. Isso torna possível implementar "diagramas em losango", onde várias classes base implementam o mesmo método. Um bom design exige que tais implementações tenham a mesma assinatura de chamada em todos os casos (porque a ordem das chamadas é determinada em tempo de execução, porque essa ordem se adapta às alterações na hierarquia de classes e porque essa ordem pode incluir classes de irmãos desconhecidas antes do tempo de execução).

source: For both use cases, a typical superclass call looks like this::
pt_br: Nos dois casos de uso, uma chamada típica de superclasse se parece com isso::

source: class C(B): def method(self, arg): super().method(arg) # This does the same thing as: # super(C, self).method(arg)
pt_br: class C(B): def método(self, arg): super().método(arg) # Isso faz o mesmo que: # super(C, self).método(arg)

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
pt_br: Além das pesquisas de método, :func:`super` também funciona para pesquisas de atributo. Um possível caso de uso para isso é chamar :term:`descritores <descriptor>` em uma classe pai ou irmã.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`~object.__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
pt_br: Observe que :func:`super` é implementada como parte do processo de vinculação para procura explícita de atributos com ponto, tal como ``super().__getitem__(nome)``. Ela faz isso implementando seu próprio método :meth:`~object.__getattribute__` para pesquisar classes em uma ordem predizível que possui suporte a herança múltipla cooperativa. Logo, :func:`super` não é definida para procuras implícitas usando instruções ou operadores como ``super()[name]``.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
pt_br: Observe também que, além da forma de argumento zero, :func:`super` não se limita ao uso de métodos internos. O formulário de dois argumentos especifica exatamente os argumentos e faz as referências apropriadas. O formulário de argumento zero funciona apenas dentro de uma definição de classe, pois o compilador preenche os detalhes necessários para recuperar corretamente a classe que está sendo definida, além de acessar a instância atual para métodos comuns.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
pt_br: Para sugestões práticas sobre como projetar classes cooperativas usando :func:`super`, consulte o `guia para uso de super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
pt_br: Ao invés de ser uma função, :class:`tuple` é na verdade um tipo de sequência imutável, conforme documentado em :ref:`typesseq-tuple` e :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__`.
pt_br: Com um argumento, retorna o tipo de um *object*. O valor de retorno é um tipo de objeto e geralmente o mesmo objeto retornado por :attr:`object.__class__`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
pt_br: A função embutida :func:`isinstance` é recomendada para testar o tipo de um objeto, porque ela leva sub-classes em consideração.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~type.__name__` attribute. The *bases* tuple contains the base classes and becomes the :attr:`~type.__bases__` attribute; if empty, :class:`object`, the ultimate base of all classes, is added. The *dict* dictionary contains attribute and method definitions for the class body; it may be copied or wrapped before becoming the :attr:`~type.__dict__` attribute. The following two statements create identical :class:`!type` objects:
pt_br: Com três argumentos, retorna um novo objeto type. Esta é essencialmente a forma dinâmica da instrução :keyword:`class`. A string *name* é o nome da classe e se torna o atributo :attr:`~type.__name__`. A tupla *bases* contém as classes bases e se torna o atributo :attr:`~type.__bases__`; se vazio, :class:`object`, a base final de todas as classes é adicionada. O dicionário *dict* contém definições de atributo e método para o corpo da classe; ele pode ser copiado ou envolto antes de se tornar o atributo :attr:`~type.__dict__`. As duas instruções a seguir criam objetos :class:`!type` idênticos:

source: See also:
pt_br: Veja também:

source: :ref:`Documentation on attributes and methods on classes <class-attrs-and-methods>`.
pt_br: :ref:`Documentação sobre atributos e métodos em classes <class-attrs-and-methods>`.

source: Keyword arguments provided to the three argument form are passed to the appropriate metaclass machinery (usually :meth:`~object.__init_subclass__`) in the same way that keywords in a class definition (besides *metaclass*) would.
pt_br: Argumentos nomeados fornecidos para a forma de três argumentos são passados para a máquina metaclasse apropriada (geralmente :meth:`~object.__init_subclass__`) da mesma forma que palavras-chave em uma definição de classe (além de *metaclasse*) fariam.

source: See also :ref:`class-customization`.
pt_br: Veja também :ref:`class-customization`.
