Repository: python/python-docs-pt-br
Catalog: library/functions.po
Languages: pt_br

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or positive or negative infinity. More precisely, the input must conform to the :token:`~float:floatvalue` production rule in the following grammar, after leading and trailing whitespace characters are removed:
pt_br: Se o argumento for uma string, ele deve conter um número decimal, opcionalmente precedido por um sinal e opcionalmente embutido em um espaço em branco. O sinal opcional pode ser ``'+'`` ou ``'-'``; um sinal ``'+'`` não tem efeito no valor produzido. O argumento também pode ser uma string representando um NaN (não um número) ou infinito positivo ou negativo. Mais precisamente, a entrada deve estar de acordo com a regra de produção :token:`~float:floatvalue` na seguinte gramática, depois que os espaços em branco iniciais e finais forem removidos:

source: Case is not significant, so, for example, "inf", "Inf", "INFINITY", and "iNfINity" are all acceptable spellings for positive infinity.
pt_br: O caso não é significativo, então, por exemplo, "inf", "Inf", "INFINITY" e "iNfINity" são todas grafias aceitáveis para o infinito positivo.

source: Otherwise, if the argument is an integer or a floating-point number, a floating-point number with the same value (within Python's floating-point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
pt_br: Caso contrário, se o argumento é um inteiro ou um número de ponto flutuante, um número de ponto flutuante com o mesmo valor (com a precisão de ponto flutuante de Python) é retornado. Se o argumento está fora do intervalo de um ponto flutuante Python, uma exceção :exc:`OverflowError` será lançada.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If :meth:`~object.__float__` is not defined then it falls back to :meth:`~object.__index__`.
pt_br: Para um objeto Python genérico ``x``, ``float(x)`` delega para o método ``x.__float__()``. Se :meth:`~object.__float__` não estiver definido, então ele delega para o método :meth:`~object.__index__`.

source: If no argument is given, ``0.0`` is returned.
pt_br: Se nenhum argumento for fornecido, será retornado ``0.0``.

source: The float type is described in :ref:`typesnumeric`.
pt_br: O tipo float é descrito em :ref:`typesnumeric`.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__float__` is not defined.
pt_br: Chamada para :meth:`~object.__index__` se :meth:`~object.__float__` não está definido.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
pt_br: Converte um valor *value* em uma representação "formatada", controlado por *format_spec*. A interpretação de *format_spec* dependerá do tipo do argumento *value*; no entanto há uma sintaxe de formatação padrão usada pela maioria dos tipos embutidos: :ref:`formatspec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
pt_br: O *format_spec* padrão é uma string vazia que geralmente produz o mesmo efeito que chamar :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`~object.__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
pt_br: Uma chamada de ``format(value, format_spec)`` é convertida em ``type(value).__format__(value, format_spec)``, que ignora o dicionário da instância ao pesquisar o método :meth:`~object.__format__` de ``value``. Uma exceção :exc:`TypeError` é levantada se a pesquisa do método atingir :mod:`object` e o *format_spec* não estiver vazio, ou se o *format_spec* ou o valor de retorno não forem strings.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
pt_br: ``object().__format__(format_spec)`` levanta um :exc:`TypeError` se *format_spec* não for uma string vazia.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
pt_br: Devolve um novo objeto :class:`frozenset`, opcionalmente com elementos obtidos de *iterable*. ``frozenset`` é uma classe embutida. Veja :class:`frozenset` e :ref:`types-set` para documentação sobre essas classes.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
pt_br: Para outros contêineres veja as classes embutidas :class:`set`, :class:`list`, :class:`tuple`, e :class:`dict`, assim como o módulo :mod:`collections`.

source: Return the value of the named attribute of *object*. *name* must be a string. If the string is the name of one of the object's attributes, the result is the value of that attribute. For example, ``getattr(x, 'foobar')`` is equivalent to ``x.foobar``. If the named attribute does not exist, *default* is returned if provided, otherwise :exc:`AttributeError` is raised. *name* need not be a Python identifier (see :func:`setattr`).
pt_br: Devolve o valor do atributo *name* de *object*. *name* deve ser uma string. Se a string é o nome de um dos atributos do objeto, o resultado é o valor de tal atributo. Por exemplo, ``getattr(x, 'foobar')`` é equivalente a ``x.foobar``. Se o atributo não existir, *default* é devolvido se tiver sido fornecido, caso contrário a exceção :exc:`AttributeError` é levantada. *name* não precisa ser um identificador Python (veja :func:`setattr`).

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to retrieve it with :func:`getattr`.
pt_br: Uma vez que :ref:`desfiguração de nome privado <private-name-mangling>` acontece em tempo de compilação, deve-se manualmente mutilar o nome de um atributo privado (atributos com dois sublinhados à esquerda) para recuperá-lo com :func:`getattr`.

source: Return the dictionary implementing the current module namespace. For code within functions, this is set when the function is defined and remains the same regardless of where the function is called.
pt_br: Retorna o dicionário implementando o espaço de nomes do módulo atual. Para código dentro de funções, isso é definido quando a função é definida e permanece o mesmo, independentemente de onde a função é chamada.

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
pt_br: Os argumentos são um objeto e uma string. O resultado é ``True`` se a string é o nome de um dos atributos do objeto, e ``False`` se ela não for. (Isto é implementado chamando ``getattr(object, name)`` e vendo se levanta um :exc:`AttributeError` ou não.)

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
pt_br: Retorna o valor hash de um objeto (se houver um). Valores hash são números inteiros. Eles são usados para rapidamente comparar chaves de dicionários durante uma pesquisa em um dicionário. Valores numéricos que ao serem comparados são iguais, possuem o mesmo valor hash (mesmo que eles sejam de tipos diferentes, como é o caso de 1 e 1.0).

source: For objects with custom :meth:`~object.__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine.
pt_br: Para objetos com métodos :meth:`~object.__hash__` personalizados, fique atento que :func:`hash` trunca o valor devolvido baseado no comprimento de bits da máquina hospedeira.

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
pt_br: Invoca o sistema de ajuda embutido. (Esta função é destinada para uso interativo.) Se nenhum argumento é passado, o sistema interativo de ajuda inicia no interpretador do console. Se o argumento é uma string, então a string é pesquisada como o nome de um módulo, função, classe, método, palavra-chave, ou tópico de documentação, e a página de ajuda é exibida no console. Se o argumento é qualquer outro tipo de objeto, uma página de ajuda para o objeto é gerada.

source: Note that if a slash(/) appears in the parameter list of a function when invoking :func:`help`, it means that the parameters prior to the slash are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
pt_br: Note que se uma barra(/) aparecer na lista de parâmetros de uma função, quando invocando :func:`help`, significa que os parâmetros anteriores a barra são apenas posicionais. Para mais informações, veja :ref:`a entrada no FAQ sobre parâmetros somente-posicionais <faq-positional-only-arguments>`.

source: This function is added to the built-in namespace by the :mod:`site` module.
pt_br: Esta função é adicionada ao espaço de nomes embutido pelo módulo :mod:`site`.

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
pt_br: Mudanças em :mod:`pydoc` e :mod:`inspect` significam que as assinaturas reportadas para chamáveis agora são mais compreensíveis e consistentes.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
pt_br: Converte um número inteiro para uma string hexadecimal em letras minúsculas pré-fixada com "0x". Se *x* não é um objeto :class:`int` do Python, ele tem que definir um método :meth:`~object.__index__` que retorne um inteiro. Alguns exemplos:

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
pt_br: Se você quer converter um número inteiro para uma string hexadecimal em letras maiúsculas ou minúsculas, com prefixo ou sem, você pode usar qualquer uma das seguintes maneiras:

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
pt_br: Veja também :func:`int` para converter uma string hexadecimal para um inteiro usando a base 16.

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
pt_br: Para obter uma string hexadecimal de um ponto flutuante, use o método :meth:`float.hex`.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
pt_br: Devolve a "identidade" de um objeto. Ele é um inteiro, o qual é garantido que será único e constante para este objeto durante todo o seu ciclo de vida. Dois objetos com ciclos de vida não sobrepostos podem ter o mesmo valor para :func:`id`.

source: This is the address of the object in memory.
pt_br: Este é o endereço do objeto na memória.

source: Raises an :ref:`auditing event <auditing>` ``builtins.id`` with argument ``id``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``builtins.id`` com o argumento ``id``.

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
pt_br: Se o argumento *prompt* estiver presente, escreve na saída padrão sem uma nova linha ao final. A função então lê uma linha da fonte de entrada, converte a mesma para uma string (removendo o caractere de nova linha ao final), e devolve isso. Quando o final do arquivo (EOF / end-of-file) é encontrado, um erro :exc:`EOFError` é levantado. Exemplo::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
pt_br: Se o módulo :mod:`readline` foi carregado, então :func:`input` usará ele para prover edição de linhas elaboradas e funcionalidades de histórico.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``builtins.input`` com argumento ``prompt`` antes de ler a entrada.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with the result after successfully reading input.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``builtins.input/result`` com o resultado depois de ler a entrada com sucesso.

source: Return an integer object constructed from a number or a string, or return ``0`` if no arguments are given.
pt_br: Retorna um objeto do tipo inteiro construído a partir de um número ou string, ou retorna ``0`` caso nenhum argumento seja passado.

source: If the argument defines :meth:`~object.__int__`, ``int(x)`` returns ``x.__int__()``. If the argument defines :meth:`~object.__index__`, it returns ``x.__index__()``. If the argument defines :meth:`~object.__trunc__`, it returns ``x.__trunc__()``. For floating-point numbers, this truncates towards zero.
pt_br: Se o argumento definir um método :meth:`~object.__int__`, então ``int(x)`` retorna ``x.__int__()``. Se *x* definir um método :meth:`~object.__index__`, então ele retorna ``x.__index__()``. Se o argumento definir um método :meth:`~object.__trunc__`, então ele retorna ``x.__trunc__()``. Para números de ponto flutuante, isto trunca o número na direção do zero.

source: If the argument is not a number or if *base* is given, then it must be a string, :class:`bytes`, or :class:`bytearray` instance representing an integer in radix *base*. Optionally, the string can be preceded by ``+`` or ``-`` (with no space in between), have leading zeros, be surrounded by whitespace, and have single underscores interspersed between digits.
pt_br: Se o argumento não for um número ou se *base* for fornecido, então o argumento deve ser uma instância de string, :class:`bytes` ou :class:`bytearray` representando um inteiro na base *base*. Opcionalmente, a string pode ser precedida por ``+`` ou ``-`` (sem espaço entre eles), ter zeros à esquerda, estar entre espaços em branco e ter sublinhados simples intercalados entre os dígitos.

source: A base-n integer string contains digits, each representing a value from 0 to n-1. The values 0--9 can be represented by any Unicode decimal digit. The values 10--35 can be represented by ``a`` to ``z`` (or ``A`` to ``Z``). The default *base* is 10. The allowed bases are 0 and 2--36. Base-2, -8, and -16 strings can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. For base 0, the string is interpreted in a similar way to an :ref:`integer literal in code <integers>`, in that the actual base is 2, 8, 10, or 16 as determined by the prefix. Base 0 also disallows leading zeros: ``int('010', 0)`` is not legal, while ``int('010')`` and ``int('010', 8)`` are.
pt_br: Uma string de inteiro de base n contém dígitos, cada um representando um valor de 0 a n-1. Os valores 0--9 podem ser representados por qualquer dígito decimal Unicode. Os valores 10--35 podem ser representados por ``a`` a ``z`` (ou ``A`` a ``Z``). A *base* padrão é 10. As bases permitidas são 0 e 2--36. As strings base-2, -8 e -16 podem ser opcionalmente prefixadas com ``0b``/``0B``, ``0o``/``0O`` ou ``0x``/``0X``, como acontece com literais inteiros no código. Para a base 0, a string é interpretada de maneira semelhante a um :ref:`literal inteiro no código <integers>`, em que a base real é 2, 8, 10 ou 16 conforme determinado pelo prefixo. A base 0 também não permite zeros à esquerda: ``int('010', 0)`` não é válido, enquanto ``int('010')`` e ``int('010', 8)`` são.

source: The integer type is described in :ref:`typesnumeric`.
pt_br: O tipo inteiro está descrito em :ref:`typesnumeric`.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
pt_br: Se *base* não é uma instância de :class:`int` e o objeto *base* tem um método :meth:`base.__index__ <object.__index__>`, então esse método é chamado para obter um inteiro para a base. Versões anteriores usavam :meth:`base.__int__ <object.__int__>` ao invés de :meth:`base.__index__ <object.__index__>`.

source: The first parameter is now positional-only.
pt_br: O primeiro parâmetro agora é somente-posicional.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__int__` is not defined.
pt_br: Chamada para :meth:`~object.__index__` se :meth:`~object.__int__` não está definido.

source: The delegation to :meth:`~object.__trunc__` is deprecated.
pt_br: A delegação de :meth:`~object.__trunc__` foi descontinuada.

source: :class:`int` string inputs and string representations can be limited to help avoid denial of service attacks. A :exc:`ValueError` is raised when the limit is exceeded while converting a string to an :class:`int` or when converting an :class:`int` into a string would exceed the limit. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation.
pt_br: Entradas de strings para :class:`int` e representações em strings podem ser limitadas para ajudar a evitar ataques de negação de serviço. Uma exceção :exc:`ValueError` é levantada quando o limite é excedido durante a conversão de uma string em um :class:`int` ou quando a conversão de um :class:`int` em uma string excede o limite. Consulte a documentação sobre :ref:`limitação de comprimento de conversão de string em inteiro <int_max_str_digits>`.

source: Return ``True`` if the *object* argument is an instance of the *classinfo* argument, or of a (direct, indirect, or :term:`virtual <abstract base class>`) subclass thereof. If *object* is not an object of the given type, the function always returns ``False``. If *classinfo* is a tuple of type objects (or recursively, other such tuples) or a :ref:`types-union` of multiple types, return ``True`` if *object* is an instance of any of the types. If *classinfo* is not a type or tuple of types and such tuples, a :exc:`TypeError` exception is raised. :exc:`TypeError` may not be raised for an invalid type if an earlier check succeeds.
pt_br: Retorna ``True`` se o argumento *object* é uma instância do argumento *classinfo*, ou de uma subclasse dele (direta, indireta ou :term:`virtual <abstract base class>`). Se *object* não é um objeto do tipo dado, a função sempre devolve ``False``. Se *classinfo* é uma tupla de tipos de objetos (ou recursivamente, como outras tuplas) ou um :ref:`types-union` de vários tipos, retorna ``True`` se *object* é uma instância de qualquer um dos tipos. Se *classinfo* não é um tipo ou tupla de tipos ou outras tuplas, é levantada uma exceção :exc:`TypeError`. :exc:`TypeError` pode não ser levantada por um tipo inválido se uma verificação anterior for bem-sucedida.

source: *classinfo* can be a :ref:`types-union`.
pt_br: *classinfo* pode ser um :ref:`types-union`.

source: Return ``True`` if *class* is a subclass (direct, indirect, or :term:`virtual <abstract base class>`) of *classinfo*. A class is considered a subclass of itself. *classinfo* may be a tuple of class objects (or recursively, other such tuples) or a :ref:`types-union`, in which case return ``True`` if *class* is a subclass of any entry in *classinfo*. In any other case, a :exc:`TypeError` exception is raised.
pt_br: Retorna ``True`` se *class* for uma subclasse (direta, indireta ou :term:`virtual <abstract base class>`) de *classinfo*. Uma classe é considerada uma subclasse de si mesma. *classinfo* pode ser uma tupla de objetos de classe (ou recursivamente, outras tuplas) ou um :ref:`types-union`, caso em que retorna ``True`` se *class* for uma subclasse de qualquer entrada em *classinfo*. Em qualquer outro caso, é levantada uma exceção :exc:`TypeError`.

source: Return an :term:`iterator` object. The first argument is interpreted very differently depending on the presence of the second argument. Without a second argument, *object* must be a collection object which supports the :term:`iterable` protocol (the :meth:`~object.__iter__` method), or it must support the sequence protocol (the :meth:`~object.__getitem__` method with integer arguments starting at ``0``). If it does not support either of those protocols, :exc:`TypeError` is raised. If the second argument, *sentinel*, is given, then *object* must be a callable object. The iterator created in this case will call *object* with no arguments for each call to its :meth:`~iterator.__next__` method; if the value returned is equal to *sentinel*, :exc:`StopIteration` will be raised, otherwise the value will be returned.
pt_br: Retorna um objeto :term:`iterador`. O primeiro argumento é interpretado muito diferentemente dependendo da presença do segundo argumento. Sem um segundo argumento, *object* deve ser uma coleção de objetos com suporte ao protocolo :term:`iterável` (o método :meth:`~object.__iter__`), ou ele deve ter suporte ao protocolo de sequência (o método :meth:`~object.__getitem__` com argumentos inteiros começando em ``0``). Se ele não tem suporte nenhum desses protocolos, uma :exc:`TypeError` é levantada. Se o segundo argumento, *sentinel*, é fornecido, então *object* deve ser um objeto chamável. O iterador criado neste caso irá chamar *object* sem nenhum argumento para cada chamada para o seu método :meth:`~iterator.__next__`; se o valor devolvido é igual a *sentinel*, então :exc:`StopIteration` será levantado, caso contrário o valor será devolvido.

source: See also :ref:`typeiter`.
pt_br: Veja também :ref:`typeiter`.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
pt_br: Uma aplicação útil da segunda forma de :func:`iter` é para construir um bloco de leitura. Por exemplo, ler blocos de comprimento fixo de um arquivo binário de banco de dados até que o final do arquivo seja atingido::
