Repository: python/python-docs-pt-br
Catalog: library/functions.po
Languages: pt_br

source: from functools import partial with open('mydata.db', 'rb') as f: for block in iter(partial(f.read, 64), b''): process_block(block)
pt_br: from functools import partial with open('meusdados.db', 'rb') as f: for bloco in iter(partial(f.read, 64), b''): process_block(bloco)

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
pt_br: Devolve o comprimento (o número de itens) de um objeto. O argumento pode ser uma sequência (tal como uma string, bytes, tupla, lista, ou um intervalo) ou uma coleção (tal como um dicionário, conjunto, ou conjunto imutável).

source: ``len`` raises :exc:`OverflowError` on lengths larger than :data:`sys.maxsize`, such as :class:`range(2 ** 100) <range>`.
pt_br: ``len`` levanta :exc:`OverflowError` em tamanhos maiores que :data:`sys.maxsize`, tal como :class:`range(2 ** 100) <range>`.

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
pt_br: Ao invés de ser uma função, :class:`list` é na verdade um tipo de sequência mutável, conforme documentado em :ref:`typesseq-list` e :ref:`typesseq`.

source: Return a mapping object representing the current local symbol table, with variable names as the keys, and their currently bound references as the values.
pt_br: Retorna um objeto de mapeamento representando a tabela de símbolos atual, com nomes de variáveis como as chaves, e as referências às quais cada variável está atrelada no momento como os valores.

source: At module scope, as well as when using :func:`exec` or :func:`eval` with a single namespace, this function returns the same namespace as :func:`globals`.
pt_br: Em um escopo de módulo, assim como quando usando :func:`exec` ou :func:`eval` com um único espaço de nomes, esta função retorna o mesmo espaço de nomes que :func:`globals`.

source: At class scope, it returns the namespace that will be passed to the metaclass constructor.
pt_br: Em um escopo de classe, ela retorna o espaço de nomes que será passado para o construtor da metaclasse.

source: When using ``exec()`` or ``eval()`` with separate local and global arguments, it returns the local namespace passed in to the function call.
pt_br: Quando usando ``exec()`` ou ``eval()`` com argumentos de espaço local e global distintos, ela retorna o espaço de nomes local passado na chamada.

source: In all of the above cases, each call to ``locals()`` in a given frame of execution will return the *same* mapping object. Changes made through the mapping object returned from ``locals()`` will be visible as assigned, reassigned, or deleted local variables, and assigning, reassigning, or deleting local variables will immediately affect the contents of the returned mapping object.
pt_br: Em todos os casos acima, cada chamada a ``locals()`` em um dado quadro de execução vai retornar o *mesmo* objeto de mapeamento. Mudanças feitas através do objeto de mapeamento retornado por ``locals()`` serão visíveis tal qual variáveis locais atribuídas, reatribuídas ou deletadas, e atribuir, reatribuir ou deletar variáveis locais afetará imediatamente o conteúdo do objeto de mapeamento retornado.

source: In an :term:`optimized scope` (including functions, generators, and coroutines), each call to ``locals()`` instead returns a fresh dictionary containing the current bindings of the function's local variables and any nonlocal cell references. In this case, name binding changes made via the returned dict are *not* written back to the corresponding local variables or nonlocal cell references, and assigning, reassigning, or deleting local variables and nonlocal cell references does *not* affect the contents of previously returned dictionaries.
pt_br: Em contraste aos casos acima, em um :term:`escopo otimizado` (incluindo funções, geradores e corrotinas), cada chamada a ``locals()`` retorna um dicionário novo contendo as ligações atuais das variáveis locais da função e de quaisquer células com referências não-locais. Nesse caso, mudanças em ligações de nomes feitas através do dicionário retornado *não* são escritas de volta nas variáveis locais correspondentes nem nas células com referências não-locais, e atribuir, reatribuir ou deletar variáveis locais e células com referências não-locais *não* afeta o conteúdo dos dicionários que já foram retornados.

source: Calling ``locals()`` as part of a comprehension in a function, generator, or coroutine is equivalent to calling it in the containing scope, except that the comprehension's initialised iteration variables will be included. In other scopes, it behaves as if the comprehension were running as a nested function.
pt_br: Chamar a função ``locals()`` como parte de uma compreensão em uma função, gerador ou corrotina é equivalente a chamá-la no escopo que contém a compreensão, exceto que as variáveis de iteração inicializadas da compreensão serão incluídas. Em outros escopos, essa função se comporta como se a compreensão estivesse executando como uma função aninhada.

source: Calling ``locals()`` as part of a generator expression is equivalent to calling it in a nested generator function.
pt_br: Chamar a função ``locals()`` como parte de uma expressão geradora é equivalente a chamá-la em uma função geradora aninhada.

source: The behaviour of ``locals()`` in a comprehension has been updated as described in :pep:`709`.
pt_br: O comportamento de ``locals()`` em uma compreensão foi atualizado conforme descrito na :pep:`709`.

source: As part of :pep:`667`, the semantics of mutating the mapping objects returned from this function are now defined. The behavior in :term:`optimized scopes <optimized scope>` is now as described above. Aside from being defined, the behaviour in other scopes remains unchanged from previous versions.
pt_br: Como parte da :pep:`667`, o que acontece após a mutação de objetos de mapeamento retornados desta função está agora definido. O comportamento em :term:`escopos otimizados <escopo otimizado>` agora é o descrito acima. Além de estar definido, o comportamento em outros escopos não foi modificado em relação aos comportamentos em versões passadas.

source: Return an iterator that applies *function* to every item of *iterable*, yielding the results. If additional *iterables* arguments are passed, *function* must take that many arguments and is applied to the items from all iterables in parallel. With multiple iterables, the iterator stops when the shortest iterable is exhausted. For cases where the function inputs are already arranged into argument tuples, see :func:`itertools.starmap`\.
pt_br: Devolve um iterador que aplica *function* para cada item de *iterable*, gerando os resultados. Se argumentos *iterables* adicionais são passados, *function* deve ter a mesma quantidade de argumentos e ela é aplicada aos itens de todos os iteráveis em paralelo. Com múltiplos iteráveis, o iterador para quando o iterador mais curto é encontrado. Para casos onde os parâmetros de entrada da função já estão organizados em tuplas, veja :func:`itertools.starmap`\.

source: Return the largest item in an iterable or the largest of two or more arguments.
pt_br: Devolve o maior item em um iterável ou o maior de dois ou mais argumentos.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
pt_br: Se um argumento posicional é fornecido, ele deve ser um :term:`iterável`. O maior item no iterável é retornado. Se dois ou mais argumentos posicionais são fornecidos, o maior dos argumentos posicionais é devolvido.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
pt_br: Existem dois parâmetros somente-nomeados opcionais. O parâmetro *key* especifica uma função de ordenamento de um argumento, como aquelas usadas por :meth:`list.sort`. O parâmetro *default* especifica um objeto a ser devolvido se o iterável fornecido estiver vazio. Se o iterável estiver vazio, e *default* não foi fornecido, uma exceção :exc:`ValueError` é levantada.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
pt_br: Se múltiplos itens são máximos, a função devolve o primeiro encontrado. Isto é consistente com outras ferramentas de ordenamento que preservam a estabilidade, tais como ``sorted(iterable, key=keyfunc, reverse=True)[0]`` e ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: Added the *default* keyword-only parameter.
pt_br: Adicionado o parâmetro *default* somente-nomeado.

source: The *key* can be ``None``.
pt_br: O valor de *key* pode ser ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
pt_br: Devolve um objeto de "visão da memória" criado a partir do argumento fornecido. Veja :ref:`typememoryview` para mais informações.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
pt_br: Devolve o menor item de um iterável ou o menor de dois ou mais argumentos.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
pt_br: Se um argumento posicional é fornecido, ele deve ser um :term:`iterável`. O menor item no iterável é devolvido. Se dois ou mais argumentos posicionais são fornecidos, o menor dos argumentos posicionais é devolvido.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
pt_br: Se múltiplos itens são mínimos, a função devolve o primeiro encontrado. Isto é consistente com outras ferramentas de ordenamento que preservam a estabilidade, tais como ``sorted(iterable, key=keyfunc)[0]`` e ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: Retrieve the next item from the :term:`iterator` by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
pt_br: Recupera o próximo item do :term:`iterador` chamando o seu método :meth:`~iterator.__next__`. Se *default* foi fornecido, ele é devolvido caso o iterável tenha sido percorrido por completo, caso contrário :exc:`StopIteration` é levantada.

source: This is the ultimate base class of all other classes. It has methods that are common to all instances of Python classes. When the constructor is called, it returns a new featureless object. The constructor does not accept any arguments.
pt_br: Esta é a classe base definitiva de todas as outras classes. Ela tem métodos que são comuns a todas as instâncias de classes Python. Quando o construtor é chamado, ele retorna um novo objeto sem características. O construtor não aceita nenhum argumento.

source: :class:`object` instances do *not* have :attr:`~object.__dict__` attributes, so you can't assign arbitrary attributes to an instance of :class:`object`.
pt_br: Instâncias de :class:`object` *não* têm atributos :attr:`~object.__dict__`, então você não pode atribuir atributos arbitrários a uma instância de :class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. For example:
pt_br: Converte um número inteiro para uma string em base octal, pré-fixada com "0o". O resultado é uma expressão Python válida. Se *x* não for um objeto :class:`int` Python, ele tem que definir um método :meth:`~object.__index__` que devolve um inteiro. Por exemplo:

source: If you want to convert an integer number to an octal string either with the prefix "0o" or not, you can use either of the following ways.
pt_br: Se você quiser converter um número inteiro para uma string octal, com o prefixo "0o" ou não, você pode usar qualquer uma das formas a seguir.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
pt_br: Abre *file* e retorna um :term:`objeto arquivo` correspondente. Se o arquivo não puder ser aberto, uma :exc:`OSError` é levantada. Veja :ref:`tut-files` para mais exemplos de como usar esta função.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed unless *closefd* is set to ``False``.)
pt_br: *file* é um :term:`objeto caminho ou similar` fornecendo o caminho (absoluto ou relativo ao diretório de trabalho atual) do arquivo que será aberto, ou de um inteiro descritor de arquivo a ser manipulado (Se um descritor de arquivo é fornecido, ele é fechado quando o objeto de I/O retornado é fechado, a não ser que *closefd* esteja marcado como ``False``).

source: *mode* is an optional string that specifies the mode in which the file is opened. It defaults to ``'r'`` which means open for reading in text mode. Other common values are ``'w'`` for writing (truncating the file if it already exists), ``'x'`` for exclusive creation, and ``'a'`` for appending (which on *some* Unix systems, means that *all* writes append to the end of the file regardless of the current seek position). In text mode, if *encoding* is not specified the encoding used is platform-dependent: :func:`locale.getencoding` is called to get the current locale encoding. (For reading and writing raw bytes use binary mode and leave *encoding* unspecified.) The available modes are:
pt_br: *mode* é uma string opcional que especifica o modo no qual o arquivo é aberto. O valor padrão é ``'r'``, o qual significa abrir para leitura em modo texto. Outros valores comuns são ``'w'`` para escrever (truncando o arquivo se ele já existe), ``'x'`` para criação exclusiva e ``'a'`` para anexar (o qual em *alguns* sistemas Unix, significa que *todas* as escritas anexam ao final do arquivo independentemente da posição de busca atual). No modo texto, se *encoding* não for especificada, a codificação usada depende da plataforma: :func:`locale.getencoding` é chamada para obter a codificação da localidade atual (Para ler e escrever bytes diretamente, use o modo binário e não especifique *encoding*). Os modos disponíveis são:

source: Character
pt_br: Caractere

source: Meaning
pt_br: Significado

source: open for reading (default)
pt_br: abre para leitura (padrão)

source: open for writing, truncating the file first
pt_br: abre para escrita, truncando o arquivo primeiro (removendo tudo o que estiver contido no mesmo)

source: open for exclusive creation, failing if the file already exists
pt_br: abre para criação exclusiva, falhando caso o arquivo exista

source: open for writing, appending to the end of file if it exists
pt_br: abre para escrita, anexando ao final do arquivo caso o mesmo exista

source: binary mode
pt_br: modo binário

source: text mode (default)
pt_br: modo texto (padrão)

source: open for updating (reading and writing)
pt_br: aberto para atualização (leitura e escrita)

source: The default mode is ``'r'`` (open for reading text, a synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
pt_br: O modo padrão é ``'r'`` (abre para leitura de texto, um sinônimo de ``'rt'``). Modos ``'w+'`` e ``'w+b'`` abrem e truncam o arquivo. Modos ``'r+'`` e ``'r+b'`` abrem o arquivo sem truncar o mesmo.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
pt_br: Conforme mencionado em :ref:`io-overview`, Python diferencia entre entrada/saída binária e de texto. Arquivos abertos em modo binário (incluindo ``'b'`` no parâmetro *mode*) retornam o conteúdo como objetos :class:`bytes` sem usar nenhuma decodificação. No modo texto (o padrão, ou quando ``'t'`` é incluído no parâmetro *mode*), o conteúdo do arquivo é retornado como :class:`str`, sendo os bytes primeiramente decodificados usando uma codificação dependente da plataforma, ou usando a codificação definida em *encoding* se fornecida.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
pt_br: Python não depende da noção básica do sistema operacional sobre arquivos de texto; todo processamento é feito pelo próprio Python, e é então independente de plataforma.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable when writing in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. Note that specifying a buffer size this way applies for binary buffered I/O, but ``TextIOWrapper`` (i.e., files opened with ``mode='r+'``) would have another buffering. To disable buffering in ``TextIOWrapper``, consider using the ``write_through`` flag for :func:`io.TextIOWrapper.reconfigure`. When no *buffering* argument is given, the default buffering policy works as follows:
pt_br: *buffering* é um número inteiro opcional usado para definir a política de buffering. Passe 0 para desativar o buffer (permitido apenas no modo binário), 1 para selecionar o buffer de linha (usável apenas ao gravar no modo de texto) e um inteiro > 1 para indicar o tamanho em bytes de um buffer de bloco de tamanho fixo. Observe que especificar um tamanho de buffer dessa maneira se aplica a E/S com buffer binário, mas ``TextIOWrapper`` (ou seja, arquivos abertos com ``mode='r+'``) teriam outro buffer. Para desabilitar o buffer em ``TextIOWrapper``, considere usar o sinalizador ``write_through`` para :func:`io.TextIOWrapper.reconfigure`. Quando nenhum argumento *buffering* é fornecido, a política de buffering padrão funciona da seguinte forma:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :const:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
pt_br: Arquivos binários são armazenados em pedaços de tamanho fixo; o tamanho do buffer é escolhido usando uma heurística que tenta determinar o "tamanho de bloco" subjacente do dispositivo, e usa :const:`io.DEFAULT_BUFFER_SIZE` caso não consiga. Em muitos sistemas, o buffer possuirá tipicamente 4096 ou 8192 bytes de comprimento.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
pt_br: Arquivos de texto "interativos" (arquivos para os quais :meth:`~io.IOBase.isatty` retornam ``True``) usam buffering de linha. Outros arquivos de texto usam a política descrita acima para arquivos binários.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
pt_br: *encoding* é o nome da codificação usada para codificar ou decodificar o arquivo. Isto deve ser usado apenas no modo texto. A codificação padrão depende da plataforma (seja qual valor :func:`locale.getencoding` retornar), mas qualquer :term:`codificador de texto` suportado pelo Python pode ser usada. Veja o módulo :mod:`codecs` para a lista de codificações suportadas.

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
pt_br: *errors* é uma string opcional que especifica como erros de codificação e de decodificação devem ser tratados — isso não pode ser utilizado no modo binário. Uma variedade de tratadores de erro padrão estão disponíveis (listados em :ref:`error-handlers`), apesar que qualquer nome para tratamento de erro registrado com :func:`codecs.register_error` também é válido. Os nomes padrões incluem:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
pt_br: ``'strict'`` para levantar uma exceção :exc:`ValueError` se existir um erro de codificação. O valor padrão ``None`` tem o mesmo efeito.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
pt_br: ``'ignore'`` ignora erros. Note que ignorar erros de código pode levar à perda de dados.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
pt_br: ``'replace'`` faz um marcador de substituição (tal como ``'?'``) ser inserido onde existem dados malformados.

source: ``'surrogateescape'`` will represent any incorrect bytes as low surrogate code units ranging from U+DC80 to U+DCFF. These surrogate code units will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
pt_br: representará quaisquer bytes incorretos como unidades de código substituto baixo variando de U + DC80 a U + DCFF. Essas unidades de código substituto serão então transformadas de volta nos mesmos bytes quando o manipulador de erros for usado ao gravar dados. Isso é útil para processar arquivos em uma codificação desconhecida.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference :samp:`&#{nnn};`.
pt_br: ``'xmlcharrefreplace'`` é suportado apenas ao gravar em um arquivo. Os caracteres não suportados pela codificação são substituídos pela referência de caracteres XML apropriada :samp:`&#{nnn};`.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
pt_br: ``'backslashreplace'`` substitui dados malformados pela sequência de escape utilizando contrabarra do Python.
