Repository: python/python-docs-pt-br
Catalog: library/gc.po
Languages: pt_br

source: :mod:`!gc` --- Garbage Collector interface
pt_br: :mod:`!gc` --- Interface para o coletor de lixo

source: This module provides an interface to the optional garbage collector. It provides the ability to disable the collector, tune the collection frequency, and set debugging options. It also provides access to unreachable objects that the collector found but cannot free. Since the collector supplements the reference counting already used in Python, you can disable the collector if you are sure your program does not create reference cycles. Automatic collection can be disabled by calling ``gc.disable()``. To debug a leaking program call ``gc.set_debug(gc.DEBUG_LEAK)``. Notice that this includes ``gc.DEBUG_SAVEALL``, causing garbage-collected objects to be saved in gc.garbage for inspection.
pt_br: Este módulo fornece uma interface para o coletor de lixo opcional. Ele disponibiliza a habilidade de desabilitar o coletor, ajustar a frequência da coleção, e configurar as opções de depuração. Ele também fornece acesso para objetos inacessíveis que o coletor encontra mas não pode "limpar". Como o coletor complementa a contagem de referência já usada em Python, você pode desabilitar o coletor se você tem certeza que o seu programa não cria ciclos de referência. A coleta automática pode ser desabilitada pela chamada ``gc.disable()``. Para depurar um programa vazando, chame ``gc.set_debug(gc.DEBUG_LEAK)``. Perceba que isto inclui ``gc.DEBUG_SAVEALL``, fazendo com que objetos coletados pelo coletor de lixo sejam salvos para inspeção em gc.garbage.

source: The :mod:`gc` module provides the following functions:
pt_br: O módulo :mod:`gc` fornece as seguintes funções:

source: Enable automatic garbage collection.
pt_br: Habilita a coleta de lixo automática.

source: Disable automatic garbage collection.
pt_br: Desabilita a coleta de lixo automática.

source: Return ``True`` if automatic collection is enabled.
pt_br: Retorna ``True`` se a coleta automática estiver habilitada.

source: Perform a collection. The optional argument *generation* may be an integer specifying which generation to collect (from 0 to 2). A :exc:`ValueError` is raised if the generation number is invalid. The sum of collected objects and uncollectable objects is returned.
pt_br: Realiza uma coleta. O argumento opcional *generation* pode ser um inteiro especificando qual geração coletar (de 0 a 2). Uma exceção :exc:`ValueError` é levantada se o número de geração for inválido. A soma dos objetos coletados e dos objetos incoletáveis é retornada.

source: Calling ``gc.collect(0)`` will perform a GC collection on the young generation.
pt_br: Chamar ``gc.collect(0)`` executará uma coleta de GC na geração mais jovem.

source: Calling ``gc.collect(1)`` will perform a GC collection on the young generation and an increment of the old generation.
pt_br: Chamar ``gc.collect(1)`` executará uma coleta de GC na geração mais jovem e um incremento na geração antiga.

source: Calling ``gc.collect(2)`` or ``gc.collect()`` performs a full collection
pt_br: Chamar ``gc.collect(2)`` ou ``gc.collect()`` executa uma coleta completa

source: The free lists maintained for a number of built-in types are cleared whenever a full collection or collection of the highest generation (2) is run. Not all items in some free lists may be freed due to the particular implementation, in particular :class:`float`.
pt_br: As listas livres mantidas para vários tipos embutidos são limpas sempre que uma coleta completa ou coleta da geração mais alta (2) é executada. Nem todos os itens em algumas listas livres podem ser liberados devido à implementação particular, em particular :class:`float`.

source: The effect of calling ``gc.collect()`` while the interpreter is already performing a collection is undefined.
pt_br: O efeito de chamar ``gc.collect()`` enquanto o interpretador já está realizando uma coleta é indefinido.

source: ``generation=1`` performs an increment of collection.
pt_br: ``generation=1`` executa um incremento de coleta.

source: Set the garbage collection debugging flags. Debugging information will be written to ``sys.stderr``. See below for a list of debugging flags which can be combined using bit operations to control debugging.
pt_br: Define os sinalizadores de depuração da coleta de lixo. As informações de depuração serão gravadas em ``sys.stderr``. Veja abaixo uma lista de sinalizadores de depuração que podem ser combinados usando operações de bit para controlar a depuração.

source: Return the debugging flags currently set.
pt_br: Retorna os sinalizadores de depuração atualmente definidos.

source: Returns a list of all objects tracked by the collector, excluding the list returned. If *generation* is not ``None``, return only the objects as follows:
pt_br: Retorna uma lista de todos os objetos rastreados pelo coletor, excluindo a lista retornada. Se *generation* não for ``None``, retorna apenas os objetos da seguinte forma:

source: 0: All objects in the young generation
pt_br: 0: Todos os objetos da geração jovem

source: 2: All objects in the old generation
pt_br: 2: Todos os objetos da geração antiga

source: New *generation* parameter.
pt_br: Novo parâmetro *generation*.

source: Generation 1 is removed
pt_br: A geração 1 foi removida

source: Raises an :ref:`auditing event <auditing>` ``gc.get_objects`` with argument ``generation``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``gc.get_objects`` com o argumento ``generation``.

source: Return a list of three per-generation dictionaries containing collection statistics since interpreter start. The number of keys may change in the future, but currently each dictionary will contain the following items:
pt_br: Retorna uma lista de três dicionários por geração contendo estatísticas de coleta desde o início do interpretador. O número de chaves pode mudar no futuro, mas atualmente cada dicionário conterá os seguintes itens:

source: ``collections`` is the number of times this generation was collected;
pt_br: ``collections`` é o número de vezes que esta geração foi coletada;

source: ``collected`` is the total number of objects collected inside this generation;
pt_br: ``collected`` é o número total de objetos coletados nesta geração;

source: ``uncollectable`` is the total number of objects which were found to be uncollectable (and were therefore moved to the :data:`garbage` list) inside this generation.
pt_br: ``uncollectable`` é o número total de objetos que foram considerados incobráveis (e, portanto, movidos para a lista :data:`garbage`) dentro desta geração.

source: Set the garbage collection thresholds (the collection frequency). Setting *threshold0* to zero disables collection.
pt_br: Define os limites de coleta de lixo (a frequência de coleta). Definir *threshold0* como zero desativa a coleta.

source: The GC classifies objects into two generations depending on whether they have survived a collection. New objects are placed in the young generation. If an object survives a collection it is moved into the old generation.
pt_br: O GC classifica os objetos em duas gerações, dependendo se sobreviveram ou não a uma coleção. Os novos objetos são colocados na geração jovem. Se um objeto sobreviver a uma coleção, ele é movido para a geração antiga.

source: In order to decide when to run, the collector keeps track of the number of object allocations and deallocations since the last collection. When the number of allocations minus the number of deallocations exceeds *threshold0*, collection starts. For each collection, all the objects in the young generation and some fraction of the old generation is collected.
pt_br: Para decidir quando executar, o coletor registra o número de alocações e desalocações de objetos desde a última coleta. Quando o número de alocações menos o número de desalocações excede *threshold0*, a coleta é iniciada. Para cada coleta, todos os objetos da geração jovem e uma fração da geração antiga são coletados.

source: In the free-threaded build, the increase in process memory usage is also checked before running the collector. If the memory usage has not increased by 10% since the last collection and the net number of object allocations has not exceeded 40 times *threshold0*, the collection is not run.
pt_br: Na construção com threads livres, o aumento no uso de memória do processo também é verificado antes da execução do coletor. Se o uso de memória não tiver aumentado 10% desde a última coleta e o número líquido de alocações de objetos não tiver excedido 40 vezes o limite 0, a coleta não será executada.

source: The fraction of the old generation that is collected is **inversely** proportional to *threshold1*. The larger *threshold1* is, the slower objects in the old generation are collected. For the default value of 10, 1% of the old generation is scanned during each collection.
pt_br: A fração da geração antiga coletada é **inversamente** proporcional a *threshold1*. Quanto maior o *threshold1*, mais lentos os objetos da geração antiga são coletados. Para o valor padrão de 10, 1% da geração antiga é escaneado durante cada coleta.

source: *threshold2* is ignored.
pt_br: *threshold2* é ignorado.

source: See `Garbage collector design <https://devguide.python.org/garbage_collector>`_ for more information.
pt_br: Consulte o `design do coletor de lixo <https://devguide.python.org/garbage_collector>`_ para mais informações.

source: *threshold2* is ignored
pt_br: *threshold2* é ignorado

source: Return the current collection counts as a tuple of ``(count0, count1, count2)``.
pt_br: Retorna as contagens da coleta atual como uma tupla de ``(count0, count1, count2)``.

source: Return the current collection thresholds as a tuple of ``(threshold0, threshold1, threshold2)``.
pt_br: Retorna os limites da coleta atual como uma tupla de ``(threshold0, threshold1, threshold2)``.

source: Return the list of objects that directly refer to any of objs. This function will only locate those containers which support garbage collection; extension types which do refer to other objects but do not support garbage collection will not be found.
pt_br: Retorna a lista de objetos que se referem diretamente a qualquer um dos objs. Esta função localizará apenas os contêineres que suportam coleta de lixo; tipos de extensão que se referem a outros objetos, mas não suportam coleta de lixo, não serão encontrados.

source: Note that objects which have already been dereferenced, but which live in cycles and have not yet been collected by the garbage collector can be listed among the resulting referrers. To get only currently live objects, call :func:`collect` before calling :func:`get_referrers`.
pt_br: Observe que os objetos que já foram desreferenciados, mas que vivem em ciclos e ainda não foram coletados pelo coletor de lixo podem ser listados entre os referenciadores resultantes. Para obter apenas os objetos atualmente ativos, chame :func:`collect` antes de chamar :func:`get_referrers`.

source: Care must be taken when using objects returned by :func:`get_referrers` because some of them could still be under construction and hence in a temporarily invalid state. Avoid using :func:`get_referrers` for any purpose other than debugging.
pt_br: Deve-se tomar cuidado ao usar objetos retornados por :func:`get_referrers` porque alguns deles ainda podem estar em construção e, portanto, em um estado temporariamente inválido. Evite usar :func:`get_referrers` para qualquer finalidade que não seja depuração.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referrers`` with argument ``objs``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``gc.get_referrers`` com o argumento ``objs``.

source: Return a list of objects directly referred to by any of the arguments. The referents returned are those objects visited by the arguments' C-level :c:member:`~PyTypeObject.tp_traverse` methods (if any), and may not be all objects actually directly reachable. :c:member:`~PyTypeObject.tp_traverse` methods are supported only by objects that support garbage collection, and are only required to visit objects that may be involved in a cycle. So, for example, if an integer is directly reachable from an argument, that integer object may or may not appear in the result list.
pt_br: Retorna uma lista de objetos diretamente referenciados por qualquer um dos argumentos. Os referentes retornados são aqueles objetos visitados pelos métodos a nível do C :c:member:`~PyTypeObject.tp_traverse` dos argumentos (se houver), e podem não ser todos os objetos diretamente alcançáveis. Os métodos :c:member:`~PyTypeObject.tp_traverse` são suportados apenas por objetos que suportam coleta de lixo e são necessários apenas para visitar objetos que possam estar envolvidos em um ciclo. Assim, por exemplo, se um número inteiro pode ser acessado diretamente de um argumento, esse objeto inteiro pode ou não aparecer na lista de resultados.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referents`` with argument ``objs``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``gc.get_referents`` com o argumento ``objs``.

source: Returns ``True`` if the object is currently tracked by the garbage collector, ``False`` otherwise. As a general rule, instances of atomic types aren't tracked and instances of non-atomic types (containers, user-defined objects...) are. However, some type-specific optimizations can be present in order to suppress the garbage collector footprint of simple instances (e.g. dicts containing only atomic keys and values)::
pt_br: Retorna ``True`` se o objeto está atualmente rastreado pelo coletor de lixo, ``False`` caso contrário. Como regra geral, as instâncias de tipos atômicos não são rastreadas e as instâncias de tipos não atômicos (contêineres, objetos definidos pelo usuário...) são. No entanto, algumas otimizações específicas do tipo podem estar presentes para suprimir a pegada do coletor de lixo de instâncias simples (por exemplo, dicts contendo apenas chaves e valores atômicos)::

source: Returns ``True`` if the given object has been finalized by the garbage collector, ``False`` otherwise. ::
pt_br: Retorna ``True`` se o objeto fornecido foi finalizado pelo coletor de lixo, ``False`` caso contrário. ::

source: Freeze all the objects tracked by the garbage collector; move them to a permanent generation and ignore them in all the future collections.
pt_br: Congela todos os objetos rastreados pelo coletor de lixo; move-os para uma geração permanente e ignora-os em todas as coleções futuras.

source: If a process will ``fork()`` without ``exec()``, avoiding unnecessary copy-on-write in child processes will maximize memory sharing and reduce overall memory usage. This requires both avoiding creation of freed "holes" in memory pages in the parent process and ensuring that GC collections in child processes won't touch the ``gc_refs`` counter of long-lived objects originating in the parent process. To accomplish both, call ``gc.disable()`` early in the parent process, ``gc.freeze()`` right before ``fork()``, and ``gc.enable()`` early in child processes.
pt_br: Se um processo for ``fork()`` sem ``exec()``, evitar cópia em gravação (copy-on-write) desnecessário em processos filho maximizará o compartilhamento de memória e reduzirá o uso geral de memória. Isso requer evitar a criação de "buracos" liberados nas páginas de memória no processo pai e garantir que as coleções GC nos processos filho não toquem no contador ``gc_refs`` de objetos de vida longa originados no processo pai. Para realizar ambos, chame ``gc.disable()`` no início do processo pai, ``gc.freeze()`` logo antes de ``fork()`` e ``gc.enable()`` no início em processos filhos.

source: Unfreeze the objects in the permanent generation, put them back into the oldest generation.
pt_br: Descongela os objetos na geração permanente, coloca-os de volta na geração mais antiga.

source: Return the number of objects in the permanent generation.
pt_br: Retorna o número de objetos na geração permanente.

source: The following variables are provided for read-only access (you can mutate the values but should not rebind them):
pt_br: As seguintes variáveis são fornecidas para acesso somente leitura (você pode alterar os valores, mas não deve revinculá-los):

source: A list of objects which the collector found to be unreachable but could not be freed (uncollectable objects). Starting with Python 3.4, this list should be empty most of the time, except when using instances of C extension types with a non-``NULL`` ``tp_del`` slot.
pt_br: Uma lista de objetos que o coletor considerou inacessíveis, mas não puderam ser liberados (objetos não coletáveis). A partir do Python 3.4, esta lista deve estar vazia na maioria das vezes, exceto ao usar instâncias de tipos de extensão C com um slot ``tp_del`` não-``NULL``.

source: If :const:`DEBUG_SAVEALL` is set, then all unreachable objects will be added to this list rather than freed.
pt_br: Se :const:`DEBUG_SAVEALL` for definido, todos os objetos inacessíveis serão adicionados a esta lista ao invés de liberados.

source: If this list is non-empty at :term:`interpreter shutdown`, a :exc:`ResourceWarning` is emitted, which is silent by default. If :const:`DEBUG_UNCOLLECTABLE` is set, in addition all uncollectable objects are printed.
pt_br: Se esta lista não estiver vazia no :term:`desligamento do interpretador`, um :exc:`ResourceWarning` é emitido, que é silencioso por padrão. Se :const:`DEBUG_UNCOLLECTABLE` for definido, além disso, todos os objetos não coletáveis serão impressos.

source: Following :pep:`442`, objects with a :meth:`~object.__del__` method don't end up in :data:`gc.garbage` anymore.
pt_br: Seguindo a :pep:`442`, objetos com um método :meth:`~object.__del__` não vão mais para :data:`gc.garbage`.

source: A list of callbacks that will be invoked by the garbage collector before and after collection. The callbacks will be called with two arguments, *phase* and *info*.
pt_br: Uma lista de retornos de chamada que serão invocados pelo coletor de lixo antes e depois da coleta. As funções de retorno serão chamadas com dois argumentos, *phase* e *info*.

source: *phase* can be one of two values:
pt_br: *phase* pode ser um dos dois valores:

source: "start": The garbage collection is about to start.
pt_br: "start": A coleta de lixo está prestes a começar.

source: "stop": The garbage collection has finished.
pt_br: "stop": A coleta de lixo terminou.

source: *info* is a dict providing more information for the callback. The following keys are currently defined:
pt_br: *info* é um ditado que fornece mais informações para a função de retorno. As seguintes chaves estão atualmente definidas:

source: "generation": The oldest generation being collected.
pt_br: "generation": A geração mais antiga sendo coletada.

source: "collected": When *phase* is "stop", the number of objects successfully collected.
pt_br: "collected": Quando *phase* é "stop", o número de objetos coletados com sucesso.

source: "uncollectable": When *phase* is "stop", the number of objects that could not be collected and were put in :data:`garbage`.
pt_br: "uncollectable": Quando *phase* é "stop", o número de objetos que não puderam ser coletados e foram colocados em :data:`garbage`.

source: Applications can add their own callbacks to this list. The primary use cases are:
pt_br: As aplicações podem adicionar suas próprias funções de retorno a essa lista. Os principais casos de uso são:

source: Gathering statistics about garbage collection, such as how often various generations are collected, and how long the collection takes.
pt_br: Reunir estatísticas sobre coleta de lixo, como com que frequência várias gerações são coletadas e quanto tempo leva a coleta.

source: Allowing applications to identify and clear their own uncollectable types when they appear in :data:`garbage`.
pt_br: Permitindo que os aplicativos identifiquem e limpem seus próprios tipos não colecionáveis quando eles aparecem em :data:`garbage`.

source: The following constants are provided for use with :func:`set_debug`:
pt_br: As seguintes constantes são fornecidas para uso com :func:`set_debug`:

source: Print statistics during collection. This information can be useful when tuning the collection frequency.
pt_br: Imprimir estatísticas durante a coleta. Esta informação pode ser útil ao sintonizar a frequência de coleta.

source: Print information on collectable objects found.
pt_br: Imprimir informações sobre objetos colecionáveis encontrados.

source: Print information of uncollectable objects found (objects which are not reachable but cannot be freed by the collector). These objects will be added to the ``garbage`` list.
pt_br: Imprime informações de objetos não colecionáveis encontrados (objetos que não são alcançáveis, mas não podem ser liberados pelo coletor). Esses objetos serão adicionados à lista ``garbage``.

source: Also print the contents of the :data:`garbage` list at :term:`interpreter shutdown`, if it isn't empty.
pt_br: Imprime também o conteúdo da lista :data:`garbage` em :term:`desligamento do interpretador`, se não estiver vazia.

source: When set, all unreachable objects found will be appended to *garbage* rather than being freed. This can be useful for debugging a leaking program.
pt_br: Quando definido, todos os objetos inacessíveis encontrados serão anexados ao *lixo* em vez de serem liberados. Isso pode ser útil para depurar um programa com vazamento.

source: The debugging flags necessary for the collector to print information about a leaking program (equal to ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
pt_br: Os sinalizadores de depuração necessários para o coletor imprimir informações sobre um programa com vazamento (igual a ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
