Repository: python/python-docs-pt-br
Catalog: library/getopt.po
Languages: pt_br

source: :mod:`!getopt` --- C-style parser for command line options
pt_br: :mod:`!getopt` --- Analisador sintático no estilo C para opções de linha de comando

source: **Source code:** :source:`Lib/getopt.py`
pt_br: **Código-fonte:** :source:`Lib/getopt.py`

source: This module is considered feature complete. A more declarative and extensible alternative to this API is provided in the :mod:`optparse` module. Further functional enhancements for command line parameter processing are provided either as third party modules on PyPI, or else as features in the :mod:`argparse` module.
pt_br: Este módulo é considerado completo em recursos. Uma alternativa mais declarativa e extensível para esta API é fornecida no módulo :mod:`optparse`. Outros aprimoramentos funcionais para processamento de parâmetros de linha de comando são fornecidos como módulos de terceiros no PyPI ou como recursos no módulo :mod:`argparse`.

source: This module helps scripts to parse the command line arguments in ``sys.argv``. It supports the same conventions as the Unix :c:func:`!getopt` function (including the special meanings of arguments of the form '``-``' and '``--``'). Long options similar to those supported by GNU software may be used as well via an optional third argument.
pt_br: Este módulo ajuda os scripts a analisar os argumentos da linha de comando em ``sys.argv``. Ele suporta as mesmas convenções da função Unix :c:func:`!getopt` (incluindo os significados especiais de argumentos da forma '``-``' e '``--``'). Longas opções semelhantes às suportadas pelo software GNU também podem ser usadas por meio de um terceiro argumento opcional.

source: Users who are unfamiliar with the Unix :c:func:`!getopt` function should consider using the :mod:`argparse` module instead. Users who are familiar with the Unix :c:func:`!getopt` function, but would like to get equivalent behavior while writing less code and getting better help and error messages should consider using the :mod:`optparse` module. See :ref:`choosing-an-argument-parser` for additional details.
pt_br: Usuários que não estão familiarizados com a função Unix :c:func:`!getopt` devem considerar usar o módulo :mod:`argparse` em vez disso. Usuários que estão familiarizados com a função Unix :c:func:`!getopt`, mas gostariam de obter um comportamento equivalente enquanto escrevem menos código e obtêm melhor ajuda e mensagens de erro devem considerar usar o módulo :mod:`optparse`. Veja :ref:`choosing-an-argument-parser` para detalhes adicionais.

source: This module provides two functions and an exception:
pt_br: Este módulo fornece duas funções e uma exceção:

source: Parses command line options and parameter list. *args* is the argument list to be parsed, without the leading reference to the running program. Typically, this means ``sys.argv[1:]``. *shortopts* is the string of option letters that the script wants to recognize, with options that require an argument followed by a colon (``':'``) and options that accept an optional argument followed by two colons (``'::'``); i.e., the same format that Unix :c:func:`!getopt` uses.
pt_br: Analisa opções de linha de comando e lista de parâmetros. *args* é a lista de argumentos a ser analisada, sem a referência inicial para o programa em execução. Normalmente, isso significa ``sys.argv[1:]``. *shortopts* é a string de letras de opção que o script deseja reconhecer, com opções que requerem um argumento seguido por dois pontos (``':'``) e opções que aceitam o argumento opcional seguido por dois caracteres de dois pontos (``'::'``); ou seja, o mesmo formato que Unix :c:func:`!getopt` usa.

source: Unlike GNU :c:func:`!getopt`, after a non-option argument, all further arguments are considered also non-options. This is similar to the way non-GNU Unix systems work.
pt_br: Ao contrário do GNU :c:func:`!getopt`, após um argumento sem opção, todos os argumentos adicionais são considerados também sem opção. Isso é semelhante à maneira como os sistemas Unix não GNU funcionam.

source: *longopts*, if specified, must be a list of strings with the names of the long options which should be supported. The leading ``'--'`` characters should not be included in the option name. Long options which require an argument should be followed by an equal sign (``'='``). Long options which accept an optional argument should be followed by an equal sign and question mark (``'=?'``). To accept only long options, *shortopts* should be an empty string. Long options on the command line can be recognized so long as they provide a prefix of the option name that matches exactly one of the accepted options. For example, if *longopts* is ``['foo', 'frob']``, the option ``--fo`` will match as ``--foo``, but ``--f`` will not match uniquely, so :exc:`GetoptError` will be raised.
pt_br: *longopts*, se especificado, deve ser uma lista de strings com os nomes das opções longas que devem ser suportadas. Os caracteres ``'--'`` no início não devem ser incluídos no nome da opção. Opções longas que requerem um argumento devem ser seguidas por um sinal de igual (``'='``). Opções longas que aceitam um argumento opcional devem ser seguidas por um sinal de igualdade e ponto de interrogação (``'=?'``). Para aceitar apenas opções longas, *shortopts* deve ser uma string vazia. Opções longas na linha de comando podem ser reconhecidas, desde que forneçam um prefixo do nome da opção que corresponda exatamente a uma das opções aceitas. Por exemplo, se *longopts* for ``['foo', 'frob']``, a opção ``--fo`` irá corresponder a ``--foo``, mas ``--f`` não corresponderá exclusivamente, então :exc:`GetoptError` será levantada.

source: The return value consists of two elements: the first is a list of ``(option, value)`` pairs; the second is the list of program arguments left after the option list was stripped (this is a trailing slice of *args*). Each option-and-value pair returned has the option as its first element, prefixed with a hyphen for short options (e.g., ``'-x'``) or two hyphens for long options (e.g., ``'--long-option'``), and the option argument as its second element, or an empty string if the option has no argument. The options occur in the list in the same order in which they were found, thus allowing multiple occurrences. Long and short options may be mixed.
pt_br: O valor de retorno consiste em dois elementos: o primeiro é uma lista de pares ``(option, value)``; a segunda é a lista de argumentos de programa restantes depois que a lista de opções foi removida (esta é uma fatia ao final de *args*). Cada par de opção e valor retornado tem a opção como seu primeiro elemento, prefixado com um hífen para opções curtas (por exemplo, ``'-x'``) ou dois hifenes para opções longas (por exemplo, ``'--long-option'``), e o argumento da opção como seu segundo elemento, ou uma string vazia se a opção não tiver argumento. As opções ocorrem na lista na mesma ordem em que foram encontradas, permitindo assim múltiplas ocorrências. Opções longas e curtas podem ser misturadas.

source: Optional arguments are supported.
pt_br: Argumentos opcionais são suportados.

source: This function works like :func:`getopt`, except that GNU style scanning mode is used by default. This means that option and non-option arguments may be intermixed. The :func:`getopt` function stops processing options as soon as a non-option argument is encountered.
pt_br: Esta função funciona como :func:`getopt`, exceto que o modo de digitalização do estilo GNU é usado por padrão. Isso significa que os argumentos de opção e não opção podem ser misturados. A função :func:`getopt` interrompe o processamento das opções assim que um argumento não opcional é encontrado.

source: If the first character of the option string is ``'+'``, or if the environment variable :envvar:`!POSIXLY_CORRECT` is set, then option processing stops as soon as a non-option argument is encountered.
pt_br: Se o primeiro caractere da string de opção for ``'+'``, ou se a variável de ambiente :envvar:`!POSIXLY_CORRECT` estiver definida, então o processamento da opção para assim que um argumento não opcional for encontrado.

source: If the first character of the option string is ``'-'``, non-option arguments that are followed by options are added to the list of option-and-value pairs as a pair that has ``None`` as its first element and the list of non-option arguments as its second element. The second element of the :func:`!gnu_getopt` result is a list of program arguments after the last option.
pt_br: Se o primeiro caractere da string de opção for ``'-'``, argumentos não opcionais seguidos por opções serão adicionados à lista de pares opção-valor como um par que tem ``None`` como primeiro elemento e a lista de argumentos não opcionais como segundo elemento. O segundo elemento do resultado :func:`!gnu_getopt` é uma lista de argumentos do programa após a última opção.

source: Support for returning intermixed options and non-option arguments in order.
pt_br: Suporte para retornar opções misturadas e argumentos não opcionais em ordem.

source: This is raised when an unrecognized option is found in the argument list or when an option requiring an argument is given none. The argument to the exception is a string indicating the cause of the error. For long options, an argument given to an option which does not require one will also cause this exception to be raised. The attributes :attr:`!msg` and :attr:`!opt` give the error message and related option; if there is no specific option to which the exception relates, :attr:`!opt` is an empty string.
pt_br: Isso é levantado quando uma opção não reconhecida é encontrada na lista de argumentos ou quando uma opção que requer um argumento não é fornecida. O argumento para a exceção é uma string que indica a causa do erro. Para opções longas, um argumento dado a uma opção que não requer uma também fará com que essa exceção seja levantada. Os atributos :attr:`!msg` e :attr:`!opt` fornecem a mensagem de erro e a opção relacionada; se não houver uma opção específica à qual a exceção se relaciona, :attr:`!opt` é uma string vazia.

source: Alias for :exc:`GetoptError`; for backward compatibility.
pt_br: Apelido para :exc:`GetoptError`; para compatibilidade reversa.

source: An example using only Unix style options:
pt_br: Um exemplo usando apenas opções de estilo Unix:

source: Using long option names is equally easy:
pt_br: Usar nomes de opções longos é igualmente fácil:

source: Optional arguments should be specified explicitly:
pt_br: Argumentos opcionais devem ser especificados explicitamente:

source: The order of options and non-option arguments can be preserved:
pt_br: A ordem dos argumentos opcionais e não opcionais pode ser preservada:

source: In a script, typical usage is something like this:
pt_br: Em um script, o uso típico é algo assim:

source: Note that an equivalent command line interface could be produced with less code and more informative help and error messages by using the :mod:`optparse` module:
pt_br: Observe que uma interface de linha de comando equivalente pode ser produzida com menos código e mais mensagens de erro de ajuda e erro informativas usando o módulo :mod:`optparse`:

source: A roughly equivalent command line interface for this case can also be produced by using the :mod:`argparse` module:
pt_br: Uma interface de linha de comando aproximadamente equivalente para este caso também pode ser produzida usando o módulo :mod:`argparse`:

source: See :ref:`choosing-an-argument-parser` for details on how the ``argparse`` version of this code differs in behaviour from the ``optparse`` (and ``getopt``) version.
pt_br: Veja :ref:`choosing-an-argument-parser` para detalhes sobre como a versão ``argparse`` deste código difere em comportamento da versão ``optparse`` (e ``getopt``).

source: Module :mod:`optparse`
pt_br: Módulo :mod:`optparse`

source: Declarative command line option parsing.
pt_br: Análise de opções de linha de comando declarativa.

source: Module :mod:`argparse`
pt_br: Módulo :mod:`argparse`

source: More opinionated command line option and argument parsing library.
pt_br: Opção de linha de comando e biblioteca de análise de argumentos mais opinativa.
