Repository: python/python-docs-pt-br
Catalog: library/getpass.po
Languages: pt_br

source: :mod:`!getpass` --- Portable password input
pt_br: :mod:`!getpass` --- Entrada de senha portátil

source: **Source code:** :source:`Lib/getpass.py`
pt_br: **Código-fonte:** :source:`Lib/getpass.py`

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: The :mod:`getpass` module provides two functions:
pt_br: O módulo :mod:`getpass` fornece duas funções:

source: Prompt the user for a password without echoing. The user is prompted using the string *prompt*, which defaults to ``'Password: '``. On Unix, the prompt is written to the file-like object *stream* using the replace error handler if needed. *stream* defaults to the controlling terminal (:file:`/dev/tty`) or if that is unavailable to ``sys.stderr`` (this argument is ignored on Windows).
pt_br: Solicita uma senha do usuário sem emiti-la. O usuário é solicitado usando a string *prompt*, cujo padrão é ``'Password: '``. No Unix, o prompt é escrito no objeto arquivo ou similar *stream* usando o tratador de erros de substituição, se necessário. O *stream* padrão para o terminal de controle (:file:`/dev/tty`) ou se não estiver disponível para ``sys.stderr`` (este argumento é ignorado no Windows).

source: The *echo_char* argument controls how user input is displayed while typing. If *echo_char* is ``None`` (default), input remains hidden. Otherwise, *echo_char* must be a printable ASCII string and each typed character is replaced by it. For example, ``echo_char='*'`` will display asterisks instead of the actual input.
pt_br: O argumento *echo_char* controla como a entrada do usuário é exibida durante a digitação. Se *echo_char* for ``None`` (padrão), a entrada permanece oculta. Caso contrário, *echo_char* deve ser uma string ASCII imprimível e cada caractere digitado será substituído por ela. Por exemplo, ``echo_char='*'`` exibirá asteriscos em vez da entrada real.

source: If echo free input is unavailable getpass() falls back to printing a warning message to *stream* and reading from ``sys.stdin`` and issuing a :exc:`GetPassWarning`.
pt_br: Se uma entrada sem exibição em tela não estiver disponível, getpass() recorre a exibir uma mensagem de aviso para *stream* e lê de ``sys.stdin`` e levantar de um :exc:`GetPassWarning`.

source: If you call getpass from within IDLE, the input may be done in the terminal you launched IDLE from rather than the idle window itself.
pt_br: Se você chamar getpass de dentro do IDLE, a entrada pode ser feita no terminal de onde você iniciou o IDLE, e não na própria janela ociosa.

source: Added the *echo_char* parameter for keyboard feedback.
pt_br: Adicionado o parâmetro *echo_char* para feedback do teclado.

source: A :exc:`UserWarning` subclass issued when password input may be echoed.
pt_br: A subclasse :exc:`UserWarning` é levantada quando a entrada de senha pode acabar sendo exibida na tela.

source: Return the "login name" of the user.
pt_br: Retorna o "nome de login" do usuário.

source: This function checks the environment variables :envvar:`LOGNAME`, :envvar:`USER`, :envvar:`!LNAME` and :envvar:`USERNAME`, in order, and returns the value of the first one which is set to a non-empty string. If none are set, the login name from the password database is returned on systems which support the :mod:`pwd` module, otherwise, an :exc:`OSError` is raised.
pt_br: Esta função verifica as variáveis de ambiente :envvar:`LOGNAME`, :envvar:`USER`, :envvar:`!LNAME` e :envvar:`USERNAME`, nesta ordem, e retorna o valor da primeiro que estiver definida como uma string não vazia. Se nenhuma estiver definida, o nome de login do banco de dados de senhas é retornado em sistemas que oferecem suporte ao módulo :mod:`pwd`, caso contrário, uma exceção :exc:`OSError` é levantada.

source: In general, this function should be preferred over :func:`os.getlogin`.
pt_br: Em geral, esta função deve ter preferência sobre :func:`os.getlogin`.

source: Previously, various exceptions beyond just :exc:`OSError` were raised.
pt_br: Anteriormente, várias exceções além de apenas :exc:`OSError` eram levantadas.
