Repository: python/python-docs-pt-br
Catalog: library/glob.po
Languages: pt_br

source: :mod:`!glob` --- Unix style pathname pattern expansion
pt_br: :mod:`!glob` --- Expansão de padrão de nome de arquivo no estilo Unix

source: **Source code:** :source:`Lib/glob.py`
pt_br: **Código-fonte:** :source:`Lib/glob.py`

source: The :mod:`glob` module finds all the pathnames matching a specified pattern according to the rules used by the Unix shell, although results are returned in arbitrary order. No tilde expansion is done, but ``*``, ``?``, and character ranges expressed with ``[]`` will be correctly matched. This is done by using the :func:`os.scandir` and :func:`fnmatch.fnmatch` functions in concert, and not by actually invoking a subshell.
pt_br: O módulo :mod:`glob` encontra todos os nomes de caminho que correspondem a um padrão especificado de acordo com as regras usadas pelo shell Unix, embora os resultados sejam retornados em ordem arbitrária. Nenhuma expansão de til é feita, mas ``*``, ``?`` e os intervalos de caracteres expressos com ``[]`` serão correspondidos corretamente. Isso é feito usando as funções :func:`os.scandir` e :func:`fnmatch.fnmatch` em conjunto, e não invocando realmente um subshell.

source: Note that files beginning with a dot (``.``) can only be matched by patterns that also start with a dot, unlike :func:`fnmatch.fnmatch` or :func:`pathlib.Path.glob`. (For tilde and shell variable expansion, use :func:`os.path.expanduser` and :func:`os.path.expandvars`.)
pt_br: Observe que arquivos iniciados com um ponto (``.``) só podem ser correspondidos com padrões que também iniciam com um ponto, ao contrário de :func:`fnmatch.fnmatch` ou :func:`pathlib.Path.glob`. (Para expansão de til e variável de shell, use :func:`os.path.expanduser` e :func:`os.path.expandvars`.)

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
pt_br: Para uma correspondência literal, coloque os metacaracteres entre colchetes. Por exemplo, ``'[?]'`` corresponde ao caractere ``'?'``.

source: The :mod:`glob` module defines the following functions:
pt_br: O módulo :mod:`glob` define as seguintes funções:

source: Return a possibly empty list of path names that match *pathname*, which must be a string containing a path specification. *pathname* can be either absolute (like :file:`/usr/src/Python-1.5/Makefile`) or relative (like :file:`../../Tools/\*/\*.gif`), and can contain shell-style wildcards. Broken symlinks are included in the results (as in the shell). Whether or not the results are sorted depends on the file system. If a file that satisfies conditions is removed or added during the call of this function, whether a path name for that file will be included is unspecified.
pt_br: Retorna uma lista possivelmente vazia de nomes de caminho que correspondem a *pathname*, que deve ser uma string contendo uma especificação de caminho. *pathname* pode ser absoluto (como :file:`/usr/src/Python-1.5/Makefile`) ou relativo (como :file:`../../Tools/\*/\*.gif`) e pode conter curingas no estilo shell. Links simbólicos quebrados são incluídos nos resultados (como no shell). Se os resultados são classificados ou não depende do sistema de arquivos. Se um arquivo que satisfaz as condições for removido ou adicionado durante a chamada desta função, não é especificado se um nome de caminho para esse arquivo será incluído.

source: If *root_dir* is not ``None``, it should be a :term:`path-like object` specifying the root directory for searching. It has the same effect on :func:`glob` as changing the current directory before calling it. If *pathname* is relative, the result will contain paths relative to *root_dir*.
pt_br: Se *root_dir* não for ``None``, deve ser um :term:`objeto caminho ou similar` especificando o diretório raiz para pesquisa. Tem o mesmo efeito em :func:`glob` que alterar o diretório atual antes de chamá-lo. Se *pathname* for relativo, o resultado conterá caminhos relativos a *root_dir*.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
pt_br: Esta função oferece suporte para :ref:`caminhos relativos aos descritores de diretório <dir_fd>` com o parâmetro *dir_fd*.

source: If *recursive* is true, the pattern "``**``" will match any files and zero or more directories, subdirectories and symbolic links to directories. If the pattern is followed by an :data:`os.sep` or :data:`os.altsep` then files will not match.
pt_br: Se *recursive* for verdadeiro, o padrão "``**``" corresponderá a qualquer arquivo e zero ou mais diretórios, subdiretórios e links simbólicos para diretórios. Se o padrão for seguido por um :data:`os.sep` ou :data:`os.altsep`, então os arquivos não irão corresponder.

source: If *include_hidden* is true, "``**``" pattern will match hidden directories.
pt_br: Se *include_hidden* for verdadeiro, o padrão "``**``" corresponderá aos diretórios ocultos.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob`` with arguments ``pathname``, ``recursive``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``glob.glob`` com os argumentos ``pathname``, ``recursive``.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob/2`` with arguments ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``glob.glob/2`` com os argumentos ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
pt_br: Usar o padrão "``**``" em grandes árvores de diretório pode consumir uma quantidade excessiva de tempo.

source: This function may return duplicate path names if *pathname* contains multiple "``**``" patterns and *recursive* is true.
pt_br: Esta função pode retornar nomes de caminhos duplicados se *pathname* contiver vários padrões "``**``" e *recursive* for verdadeiro.

source: Support for recursive globs using "``**``".
pt_br: Suporte a globs recursivos usando "``**``".

source: Added the *root_dir* and *dir_fd* parameters.
pt_br: Adicionados os parâmetros *root_dir* e *dir_fd*.

source: Added the *include_hidden* parameter.
pt_br: Adicionado o parâmetro *include_hidden*.

source: Return an :term:`iterator` which yields the same values as :func:`glob` without actually storing them all simultaneously.
pt_br: Retorna um :term:`iterador <iterator>` que produz os mesmos valores que :func:`glob` sem realmente armazená-los todos simultaneamente.

source: Escape all special characters (``'?'``, ``'*'`` and ``'['``). This is useful if you want to match an arbitrary literal string that may have special characters in it. Special characters in drive/UNC sharepoints are not escaped, e.g. on Windows ``escape('//?/c:/Quo vadis?.txt')`` returns ``'//?/c:/Quo vadis[?].txt'``.
pt_br: Escapa todos os caracteres especiais (``'?'``, ``'*'`` e ``'['``). Isso é útil se você deseja corresponder a uma string literal arbitrária que pode conter caracteres especiais. Os caracteres especiais nos pontos de compartilhamento de unidade/UNC não têm escape, por exemplo, no Windows ``escape('//?/c:/Quo vadis?.txt')`` retorna ``'//?/c:/Quo vadis[?].txt'``.

source: Convert the given path specification to a regular expression for use with :func:`re.match`. The path specification can contain shell-style wildcards.
pt_br: Converte a especificação de caminho dada para uma expressão regular para uso com :func:`re.match`. A especificação de caminho pode conter curingas no estilo shell.

source: For example:
pt_br: Por exemplo:

source: Path separators and segments are meaningful to this function, unlike :func:`fnmatch.translate`. By default wildcards do not match path separators, and ``*`` pattern segments match precisely one path segment.
pt_br: Separadores de caminho e segmentos são significativos para esta função, diferentemente de :func:`fnmatch.translate`. Por padrão, curingas não correspondem a separadores de caminho, e segmentos de padrão ``*`` correspondem precisamente a um segmento de caminho.

source: If *recursive* is true, the pattern segment "``**``" will match any number of path segments.
pt_br: Se *recursive* for verdadeiro, o segmento de padrão "``**``" corresponderá a qualquer número de segmentos de caminho.

source: If *include_hidden* is true, wildcards can match path segments that start with a dot (``.``).
pt_br: Se *include_hidden* for verdadeiro, os curingas poderão corresponder a segmentos de caminho que começam com um ponto (``.``).

source: A sequence of path separators may be supplied to the *seps* argument. If not given, :data:`os.sep` and :data:`~os.altsep` (if available) are used.
pt_br: Uma sequência de separadores de caminho pode ser fornecida ao argumento *seps*. Se não for fornecido, :data:`os.sep` e :data:`~os.altsep` (se disponível) são usados.

source: :meth:`pathlib.PurePath.full_match` and :meth:`pathlib.Path.glob` methods, which call this function to implement pattern matching and globbing.
pt_br: Os métodos :meth:`pathlib.PurePath.full_match` e :meth:`pathlib.Path.glob`, que chamam esta função para implementar correspondência de padrões e globbing.

source: Examples
pt_br: Exemplos

source: Consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
pt_br: Considere um diretório contendo os seguintes arquivos: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` e um subdiretório :file:`sub` que contém apenas o arquivo :file:`3.txt`. :func:`glob` produzirá os seguintes resultados. Observe como todos os componentes principais do caminho são preservados. ::

source: If the directory contains files starting with ``.`` they won't be matched by default. For example, consider a directory containing :file:`card.gif` and :file:`.card.gif`::
pt_br: Se o diretório contém arquivos começando com ``.`` eles não serão correspondidos por padrão. Por exemplo, considere um diretório contendo :file:`card.gif` e :file:`.card.gif` ::

source: The :mod:`fnmatch` module offers shell-style filename (not path) expansion.
pt_br: O módulo :mod:`fnmatch` oferece expansão de nome de arquivo (não caminho) no estilo shell.

source: The :mod:`pathlib` module offers high-level path objects.
pt_br: O módulo :mod:`pathlib` oferece objetos de caminho de alto nível.

source: filenames
pt_br: nomes de arquivos

source: pathname expansion
pt_br: expansão de nome de arquivo

source: * (asterisk)
pt_br: * (asterisco)

source: in glob-style wildcards
pt_br: caracteres curingas no estilo blog

source: ? (question mark)
pt_br: ? (interrogação)

source: [] (square brackets)
pt_br: [] (colchetes)

source: ! (exclamation)
pt_br: ! (exclamação)

source: - (minus)
pt_br: - (menos)

source: . (dot)
pt_br: . (ponto)
