Repository: python/python-docs-pt-br
Catalog: library/graphlib.po
Languages: pt_br

source: :mod:`!graphlib` --- Functionality to operate with graph-like structures
pt_br: :mod:`!graphlib` --- Funcionalidade para operar com estruturas do tipo grafo

source: **Source code:** :source:`Lib/graphlib.py`
pt_br: **Código-fonte:** :source:`Lib/graphlib.py`

source: Provides functionality to topologically sort a graph of :term:`hashable` nodes.
pt_br: Fornece funcionalidade para classificar topologicamente um grafo de nós :term:`hasheáveis <hasheável>`.

source: A topological order is a linear ordering of the vertices in a graph such that for every directed edge u -> v from vertex u to vertex v, vertex u comes before vertex v in the ordering. For instance, the vertices of the graph may represent tasks to be performed, and the edges may represent constraints that one task must be performed before another; in this example, a topological ordering is just a valid sequence for the tasks. A complete topological ordering is possible if and only if the graph has no directed cycles, that is, if it is a directed acyclic graph.
pt_br: Uma ordem topológica é uma ordenação linear dos vértices em um grafo, de modo que para cada aresta direcionada u -> v do vértice u ao vértice v, o vértice u vem antes do vértice v na ordenação. Por exemplo, os vértices do grafo podem representar tarefas a serem executadas e as arestas podem representar restrições de que uma tarefa deve ser executada antes de outra; neste exemplo, uma ordem topológica é apenas uma sequência válida para as tarefas. Uma ordenação topológica completa é possível se e somente se o grafo não tiver ciclos direcionados, ou seja, se for um grafo acíclico direcionado.

source: If the optional *graph* argument is provided it must be a dictionary representing a directed acyclic graph where the keys are nodes and the values are iterables of all predecessors of that node in the graph (the nodes that have edges that point to the value in the key). Additional nodes can be added to the graph using the :meth:`~TopologicalSorter.add` method.
pt_br: Se o argumento opcional *graph* for fornecido, ele deverá ser um dicionário que represente um grafo acíclico direcionado no qual as chaves sejam nós e os valores sejam iteráveis de todos os predecessores desse nó no grafo (os nós que possuem bordas que apontam para o valor na chave). Nós adicionais podem ser adicionados ao grafo usando o método :meth:`~TopologicalSorter.add`.

source: In the general case, the steps required to perform the sorting of a given graph are as follows:
pt_br: No caso geral, as etapas necessárias para executar a classificação de um determinado grafo são as seguintes:

source: Create an instance of the :class:`TopologicalSorter` with an optional initial graph.
pt_br: Cria uma instância da classe :class:`TopologicalSorter` com um grafo inicial opcional.

source: Add additional nodes to the graph.
pt_br: Adiciona nós adicionais ao grafo.

source: Call :meth:`~TopologicalSorter.prepare` on the graph.
pt_br: Chama o método :meth:`~TopologicalSorter.prepare` no grafo.

source: While :meth:`~TopologicalSorter.is_active` is ``True``, iterate over the nodes returned by :meth:`~TopologicalSorter.get_ready` and process them. Call :meth:`~TopologicalSorter.done` on each node as it finishes processing.
pt_br: Enquanto :meth:`~TopologicalSorter.is_active` é ``True``, itera pelos nós retornados por :meth:`~TopologicalSorter.get_ready` e os processa. Chama :meth:`~TopologicalSorter.done` em cada nó na medida em que finaliza o processamento.

source: In case just an immediate sorting of the nodes in the graph is required and no parallelism is involved, the convenience method :meth:`TopologicalSorter.static_order` can be used directly:
pt_br: Caso apenas uma classificação imediata dos nós no grafo seja necessária e nenhum paralelismo esteja envolvido, o método de conveniência :meth:`TopologicalSorter.static_order` pode ser usado diretamente:

source: The class is designed to easily support parallel processing of the nodes as they become ready. For instance::
pt_br: A classe foi projetada para suportar facilmente o processamento paralelo dos nós à medida que eles se tornam prontos. Por exemplo::

source: topological_sorter = TopologicalSorter() # Add nodes to 'topological_sorter'... topological_sorter.prepare() while topological_sorter.is_active(): for node in topological_sorter.get_ready(): # Worker threads or processes take nodes to work on off the # 'task_queue' queue. task_queue.put(node) # When the work for a node is done, workers put the node in # 'finalized_tasks_queue' so we can get more nodes to work on. # The definition of 'is_active()' guarantees that, at this point, at # least one node has been placed on 'task_queue' that hasn't yet # been passed to 'done()', so this blocking 'get()' must (eventually) # succeed. After calling 'done()', we loop back to call 'get_ready()' # again, so put newly freed nodes on 'task_queue' as soon as # logically possible. node = finalized_tasks_queue.get() topological_sorter.done(node)
pt_br: topological_sorter = TopologicalSorter() # Adiciona nodos para 'topological_sorter'... topological_sorter.prepare() while topological_sorter.is_active(): for node in topological_sorter.get_ready(): # Processos ou threads de workers obtém nós para # trabalhar na fila 'task_queue'. task_queue.put(node) # Quando o trabalho para um nó é feito, os workers colocam o # nó em 'finalized_tasks_queue' para que possamos obter mais # nós para trabalhar. A definição de 'is_active()' garante que, # neste ponto, pelo menos um nó foi colocado em 'task_queue' # que ainda não foi passado para 'done()', então este 'get()' de # bloqueio deve (eventualmente) ter sucesso. Depois de chamar # 'done()', fazemos um laço de volta para chamar 'get_ready()' # novamente, então colocamos nós recém-liberados em # 'task_queue' o mais rápido possível. node = finalized_tasks_queue.get() topological_sorter.done(node)

source: Add a new node and its predecessors to the graph. Both the *node* and all elements in *predecessors* must be :term:`hashable`.
pt_br: Adiciona um novo nó e seus predecessores ao grafo. O *node* e todos os elementos em *predecessors* devem ser :term:`hasheáveis <hasheável>`.

source: If called multiple times with the same node argument, the set of dependencies will be the union of all dependencies passed in.
pt_br: Se chamado várias vezes com o mesmo argumento do nó, o conjunto de dependências será a união de todas as dependências transmitidas.

source: It is possible to add a node with no dependencies (*predecessors* is not provided) or to provide a dependency twice. If a node that has not been provided before is included among *predecessors* it will be automatically added to the graph with no predecessors of its own.
pt_br: É possível adicionar um nó sem dependências (*predecessors* não são fornecidos) ou fornecer uma dependência duas vezes. Se um nó que não foi fornecido anteriormente for incluído entre os *predecessors*, ele será automaticamente adicionado ao grafo sem predecessores próprios.

source: Raises :exc:`ValueError` if called after :meth:`~TopologicalSorter.prepare`.
pt_br: Levanta :exc:`ValueError` se chamado após :meth:`~TopologicalSorter.prepare`.

source: Mark the graph as finished and check for cycles in the graph. If any cycle is detected, :exc:`CycleError` will be raised, but :meth:`~TopologicalSorter.get_ready` can still be used to obtain as many nodes as possible until cycles block more progress. After a call to this function, the graph cannot be modified, and therefore no more nodes can be added using :meth:`~TopologicalSorter.add`.
pt_br: Marca o grafo como concluído e verifica os ciclos no grafo. Se qualquer ciclo for detectado, :exc:`CycleError` será gerado, mas :meth:`~TopologicalSorter.get_ready` ainda poderá ser usado para obter o maior número possível de nós até que os ciclos bloqueiem mais progressos. Após uma chamada para esta função, o grafo não pode ser modificado e, portanto, nenhum nó pode ser adicionado usando :meth:`~TopologicalSorter.add`.

source: A :exc:`ValueError` will be raised if the sort has been started by :meth:`~.static_order` or :meth:`~.get_ready`.
pt_br: Uma :exc:`ValueError` será levantada se a classificação tiver sido iniciada por :meth:`~.static_order` ou :meth:`~.get_ready`.

source: ``prepare()`` can now be called more than once as long as the sort has not started. Previously this raised :exc:`ValueError`.
pt_br: ``prepare()`` agora pode ser chamado mais de uma vez, desde que a classificação não tenha sido iniciada. Anteriormente, isso levantava :exc:`ValueError`.

source: Returns ``True`` if more progress can be made and ``False`` otherwise. Progress can be made if cycles do not block the resolution and either there are still nodes ready that haven't yet been returned by :meth:`TopologicalSorter.get_ready` or the number of nodes marked :meth:`TopologicalSorter.done` is less than the number that have been returned by :meth:`TopologicalSorter.get_ready`.
pt_br: Retorna ``True`` se mais progresso puder ser feito e ``False`` caso contrário. É possível progredir se os ciclos não bloquearem a resolução e ainda houver nós prontos que ainda não foram retornados por :meth:`TopologicalSorter.get_ready` ou o número de nós marcados :meth:`TopologicalSorter.done` é menor que o número retornado por :meth:`TopologicalSorter.get_ready`.

source: The :meth:`~object.__bool__` method of this class defers to this function, so instead of::
pt_br: O método :meth:`~object.__bool__` desta classe adia para essa função, então, em vez de::

source: it is possible to simply do::
pt_br: é possível simplesmente fazer::

source: Raises :exc:`ValueError` if called without calling :meth:`~TopologicalSorter.prepare` previously.
pt_br: Levanta :exc:`ValueError` se chamado sem chamar :meth:`~TopologicalSorter.prepare` anteriormente.

source: Marks a set of nodes returned by :meth:`TopologicalSorter.get_ready` as processed, unblocking any successor of each node in *nodes* for being returned in the future by a call to :meth:`TopologicalSorter.get_ready`.
pt_br: Marca um conjunto de nós retornados por :meth:`TopologicalSorter.get_ready` como processado, desbloqueando qualquer sucessor de cada nó em *nodes* para ser retornado no futuro por uma chamada para :meth:`TopologicalSorter.get_ready`.

source: Raises :exc:`ValueError` if any node in *nodes* has already been marked as processed by a previous call to this method or if a node was not added to the graph by using :meth:`TopologicalSorter.add`, if called without calling :meth:`~TopologicalSorter.prepare` or if node has not yet been returned by :meth:`~TopologicalSorter.get_ready`.
pt_br: Levanta :exc:`ValueError` se algum nó em *nodes* já foi marcado como processado por uma chamada anterior a este método ou se um nó não foi adicionado ao grafo usando :meth:`TopologicalSorter.add`, se chamado sem chamar :meth:`~ TopologicalSorter.prepare` ou se o nó ainda não foi retornado por :meth:`~TopologicalSorter.get_ready`.

source: Returns a ``tuple`` with all the nodes that are ready. Initially it returns all nodes with no predecessors, and once those are marked as processed by calling :meth:`TopologicalSorter.done`, further calls will return all new nodes that have all their predecessors already processed. Once no more progress can be made, empty tuples are returned.
pt_br: Retorna uma ``tupla`` com todos os nós que estão prontos. Inicialmente, ele retorna todos os nós sem predecessores e, uma vez marcados como processados, chamando :meth:`TopologicalSorter.done`, novas chamadas retornarão todos os novos nós que já tenham seus antecessores já processados. Quando não for possível fazer mais progresso, as tuplas vazias serão retornadas.

source: Returns an iterator object which will iterate over nodes in a topological order. When using this method, :meth:`~TopologicalSorter.prepare` and :meth:`~TopologicalSorter.done` should not be called. This method is equivalent to::
pt_br: Retorna um objeto iterador que irá iterar sobre os nós em uma ordem topológica. Ao usar este método, :meth:`~TopologicalSorter.prepare` e :meth:`~TopologicalSorter.done` não devem ser chamados. Este método é equivalente a::

source: The particular order that is returned may depend on the specific order in which the items were inserted in the graph. For example:
pt_br: A ordem específica retornada pode depender da ordem específica em que os itens foram inseridos no grafo. Por exemplo:

source: This is due to the fact that "0" and "2" are in the same level in the graph (they would have been returned in the same call to :meth:`~TopologicalSorter.get_ready`) and the order between them is determined by the order of insertion.
pt_br: Isso se deve ao fato de que "0" e "2" estão no mesmo nível no grafo (eles teriam sido retornados na mesma chamada para :meth:`~TopologicalSorter.get_ready`) e a ordem entre eles é determinada pela ordem de inserção.

source: If any cycle is detected, :exc:`CycleError` will be raised.
pt_br: Se qualquer ciclo for detectado, :exc:`CycleError` será levantada.

source: Exceptions
pt_br: Exceções

source: The :mod:`graphlib` module defines the following exception classes:
pt_br: O módulo :mod:`graphlib` define as seguintes classes de exceção:

source: Subclass of :exc:`ValueError` raised by :meth:`TopologicalSorter.prepare` if cycles exist in the working graph. If multiple cycles exist, only one undefined choice among them will be reported and included in the exception.
pt_br: Subclasse de :exc:`ValueError` levantada por :meth:`TopologicalSorter.prepare` se houver ciclos no grafo de trabalho. Se existirem vários ciclos, apenas uma opção indefinida entre eles será relatada e incluída na exceção.

source: The detected cycle can be accessed via the second element in the :attr:`~BaseException.args` attribute of the exception instance and consists in a list of nodes, such that each node is, in the graph, an immediate predecessor of the next node in the list. In the reported list, the first and the last node will be the same, to make it clear that it is cyclic.
pt_br: O ciclo detectado pode ser acessado através do segundo elemento no atributo :attr:`~BaseException.args` da instância de exceção e consiste em uma lista de nós, de modo que cada nó seja, no grafo, um predecessor imediato do próximo nó na lista. Na lista relatada, o primeiro e o último nó serão os mesmos, para deixar claro que é cíclico.
