Repository: python/python-docs-pt-br
Catalog: library/grp.po
Languages: pt_br

source: :mod:`!grp` --- The group database
pt_br: :mod:`!grp` --- O banco de dados de grupos

source: This module provides access to the Unix group database. It is available on all Unix versions.
pt_br: Este módulo fornece acesso ao banco de dados de grupos Unix. Ele está disponível em todas as versões do Unix.

source: Availability
pt_br: Disponibilidade

source: Group database entries are reported as a tuple-like object, whose attributes correspond to the members of the ``group`` structure (Attribute field below, see ``<grp.h>``):
pt_br: As entradas do banco de dados de grupos são relatadas como um objeto tupla ou similar, cujos atributos correspondem aos membros da estrutura ``group`` (campo Atributo abaixo, consulte ``<grp.h>``):

source: Index
pt_br: Índice

source: Attribute
pt_br: Atributo

source: Meaning
pt_br: Significado

source: the name of the group
pt_br: o nome do grupo

source: the (encrypted) group password; often empty
pt_br: a senha do grupo (criptografada); geralmente vazia

source: the numerical group ID
pt_br: O ID numérico do grupo

source: all the group member's user names
pt_br: todos os nomes de usuários dos membros do grupo

source: The gid is an integer, name and password are strings, and the member list is a list of strings. (Note that most users are not explicitly listed as members of the group they are in according to the password database. Check both databases to get complete membership information. Also note that a ``gr_name`` that starts with a ``+`` or ``-`` is likely to be a YP/NIS reference and may not be accessible via :func:`getgrnam` or :func:`getgrgid`.)
pt_br: O gid é um inteiro, nome e senha são strings, e a lista de membros é uma lista de strings. (Observe que a maioria dos usuários não são listados explicitamente como membros do grupo em que estão, de acordo com o banco de dados de senhas. Verifique ambos os bancos de dados para obter informações completas sobre associação. Observe também que um ``gr_name`` que começa com ``+`` ou ``-`` provavelmente é uma referência YP/NIS e pode não ser acessível via :func:`getgrnam` ou :func:`getgrgid`.)

source: It defines the following items:
pt_br: Isto define os seguintes itens

source: Return the group database entry for the given numeric group ID. :exc:`KeyError` is raised if the entry asked for cannot be found.
pt_br: Retorna a entrada do banco de dados de grupos para o ID do grupo numérico fornecido. :exc:`KeyError` é levantada se a entrada solicitada não puder ser encontrada.

source: :exc:`TypeError` is raised for non-integer arguments like floats or strings.
pt_br: :exc:`TypeError` é levantada para argumentos não inteiros, como pontos flutuantes ou strings.

source: Return the group database entry for the given group name. :exc:`KeyError` is raised if the entry asked for cannot be found.
pt_br: Retorna a entrada do banco de dados de grupos para o nome do grupo fornecido. :exc:`KeyError` é levantada se a entrada solicitada não puder ser encontrada.

source: Return a list of all available group entries, in arbitrary order.
pt_br: Retorna uma lista de todas as entradas de grupo disponíveis, em ordem arbitrária.

source: Module :mod:`pwd`
pt_br: Módulo :mod:`pwd`

source: An interface to the user database, similar to this.
pt_br: Uma interface para o banco de dados de usuários, semelhante a esta.
