Repository: python/python-docs-pt-br
Catalog: library/heapq.po
Languages: pt_br

source: :mod:`!heapq` --- Heap queue algorithm
pt_br: :mod:`!heapq` --- Algoritmo de fila heap

source: **Source code:** :source:`Lib/heapq.py`
pt_br: **Código-fonte:** :source:`Lib/heapq.py`

source: This module provides an implementation of the heap queue algorithm, also known as the priority queue algorithm.
pt_br: Este módulo fornece uma implementação do algoritmo de fila heap, também conhecido como algoritmo de fila de prioridade.

source: Push *item* on the heap, then pop and return the smallest item from the *heap*. The combined action runs more efficiently than :func:`heappush` followed by a separate call to :func:`heappop`.
pt_br: Coloca *item* no heap, depois retira e retorna o menor item do *heap*. A ação combinada é executada com mais eficiência do que :func:`heappush` seguida por uma chamada separada para :func:`heappop`.

source: Pop and return the smallest item from the *heap*, and also push the new *item*. The heap size doesn't change. If the heap is empty, :exc:`IndexError` is raised.
pt_br: Abre e retorna o menor item da *heap* e também coloca o novo *item*. O tamanho do heap não muda. Se o heap estiver vazio, a exceção :exc:`IndexError` será levantada.

source: This one step operation is more efficient than a :func:`heappop` followed by :func:`heappush` and can be more appropriate when using a fixed-size heap. The pop/push combination always returns an element from the heap and replaces it with *item*.
pt_br: Esta operação de uma etapa é mais eficiente que :func:`heappop` seguida por :func:`heappush` e pode ser mais apropriada ao usar um heap de tamanho fixo. A combinação de retirar/colocar sempre retorna um elemento do heap e o substitui por *item*.

source: The value returned may be larger than the *item* added. If that isn't desired, consider using :func:`heappushpop` instead. Its push/pop combination returns the smaller of the two values, leaving the larger value on the heap.
pt_br: O valor retornado pode ser maior que o *item* adicionado. Se isso não for desejado, considere usar :func:`heappushpop`. Sua combinação de retirar/colocar retorna o menor dos dois valores, deixando o valor maior no heap.

source: The module also offers three general purpose functions based on heaps.
pt_br: O módulo também oferece três funções de propósito geral baseadas em heaps.

source: Merge multiple sorted inputs into a single sorted output (for example, merge timestamped entries from multiple log files). Returns an :term:`iterator` over the sorted values.
pt_br: Mescla diversas entradas classificadas em uma única saída classificada (por exemplo, mescla entradas com registro de data e hora de vários arquivos de log). Retorna um :term:`iterador` sobre os valores classificados.

source: Similar to ``sorted(itertools.chain(*iterables))`` but returns an iterable, does not pull the data into memory all at once, and assumes that each of the input streams is already sorted (smallest to largest).
pt_br: Semelhante a ``sorted(itertools.chain(*iterables))`` mas retorna um iterável, não puxa os dados para a memória todos de uma vez e presume que cada um dos fluxos de entrada já está classificado (do menor para o maior).

source: Has two optional arguments which must be specified as keyword arguments.
pt_br: Possui dois argumentos opcionais que devem ser especificados como argumentos nomeados.

source: *key* specifies a :term:`key function` of one argument that is used to extract a comparison key from each input element. The default value is ``None`` (compare the elements directly).
pt_br: *key* especifica uma :term:`função chave` de um argumento que é usado para extrair uma chave de comparação de cada elemento de entrada. O valor padrão é ``None`` (compare os elementos diretamente).

source: *reverse* is a boolean value. If set to ``True``, then the input elements are merged as if each comparison were reversed. To achieve behavior similar to ``sorted(itertools.chain(*iterables), reverse=True)``, all iterables must be sorted from largest to smallest.
pt_br: *reverse* é um valor booleano. Se definido como ``True``, então os elementos de entrada serão mesclados como se cada comparação fosse invertida. Para obter um comportamento semelhante a ``sorted(itertools.chain(*iterables), reverse=True)``, todos os iteráveis devem ser classificados do maior para o menor.

source: Added the optional *key* and *reverse* parameters.
pt_br: Adicionados os parâmetros opcionais *key* e *reverse*.

source: Return a list with the *n* largest elements from the dataset defined by *iterable*. *key*, if provided, specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). Equivalent to: ``sorted(iterable, key=key, reverse=True)[:n]``.
pt_br: Retorna uma lista com os *n* maiores elementos do conjunto de dados definido por *iterable*. *key*, se fornecido, especifica uma função de um argumento que é usado para extrair uma chave de comparação de cada elemento em *iterable* (por exemplo, ``key=str.lower``). Equivalente a: ``sorted(iterable, key=key, reverse=True)[:n]``.

source: Return a list with the *n* smallest elements from the dataset defined by *iterable*. *key*, if provided, specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). Equivalent to: ``sorted(iterable, key=key)[:n]``.
pt_br: Retorna uma lista com os *n* menores elementos do conjunto de dados definido por *iterable*. *key*, se fornecido, especifica uma função de um argumento que é usado para extrair uma chave de comparação de cada elemento em *iterable* (por exemplo, ``key=str.lower``). Equivalente a: ``sorted(iterable, key=key)[:n]``.

source: The latter two functions perform best for smaller values of *n*. For larger values, it is more efficient to use the :func:`sorted` function. Also, when ``n==1``, it is more efficient to use the built-in :func:`min` and :func:`max` functions. If repeated usage of these functions is required, consider turning the iterable into an actual heap.
pt_br: As duas últimas funções têm melhor desempenho para valores menores de *n*. Para valores maiores, é mais eficiente usar a função :func:`sorted`. Além disso, quando ``n==1``, é mais eficiente usar as funções embutidas :func:`min` e :func:`max`. Se for necessário o uso repetido dessas funções, considere transformar o iterável em um heap real.

source: Basic Examples
pt_br: Exemplos básicos

source: A `heapsort <https://en.wikipedia.org/wiki/Heapsort>`_ can be implemented by pushing all values onto a heap and then popping off the smallest values one at a time::
pt_br: Um `heapsort <https://en.wikipedia.org/wiki/Heapsort>`_ pode ser implementado colocando todos os valores em um heap e, em seguida, retirando os menores valores, um de cada vez::

source: This is similar to ``sorted(iterable)``, but unlike :func:`sorted`, this implementation is not stable.
pt_br: Isto é semelhante a ``sorted(iterable)``, mas diferente de :func:`sorted`, esta implementação não é estável.

source: Heap elements can be tuples. This is useful for assigning comparison values (such as task priorities) alongside the main record being tracked::
pt_br: Os elementos de heap podem ser tuplas. Isto é útil para atribuir valores de comparação (como prioridades de tarefas) juntamente com o registro principal que está sendo rastreado::

source: Priority Queue Implementation Notes
pt_br: Notas de implementação da fila de prioridade

source: A `priority queue <https://en.wikipedia.org/wiki/Priority_queue>`_ is common use for a heap, and it presents several implementation challenges:
pt_br: Uma `fila de prioridade <https://en.wikipedia.org/wiki/Priority_queue>`_ é de uso comum para um heap e apresenta vários desafios de implementação:

source: Sort stability: how do you get two tasks with equal priorities to be returned in the order they were originally added?
pt_br: Estabilidade de classificação: como fazer com que duas tarefas com prioridades iguais sejam retornadas na ordem em que foram adicionadas originalmente?

source: Tuple comparison breaks for (priority, task) pairs if the priorities are equal and the tasks do not have a default comparison order.
pt_br: A comparação de tuplas quebra para pares (prioridade, tarefa) se as prioridades forem iguais e as tarefas não tiverem uma ordem de comparação padrão.

source: If the priority of a task changes, how do you move it to a new position in the heap?
pt_br: Se a prioridade de uma tarefa mudar, como movê-la para uma nova posição no heap?

source: Or if a pending task needs to be deleted, how do you find it and remove it from the queue?
pt_br: Ou se uma tarefa pendente precisar ser excluída, como encontrá-la e removê-la da fila?

source: A solution to the first two challenges is to store entries as 3-element list including the priority, an entry count, and the task. The entry count serves as a tie-breaker so that two tasks with the same priority are returned in the order they were added. And since no two entry counts are the same, the tuple comparison will never attempt to directly compare two tasks.
pt_br: Uma solução para os dois primeiros desafios é armazenar as entradas como uma lista de 3 elementos, incluindo a prioridade, uma contagem de entradas e a tarefa. A contagem de entradas serve de desempate para que duas tarefas com a mesma prioridade sejam retornadas na ordem em que foram adicionadas. E como não há duas contagens de entradas iguais, a comparação de tuplas nunca tentará comparar diretamente duas tarefas.

source: Another solution to the problem of non-comparable tasks is to create a wrapper class that ignores the task item and only compares the priority field::
pt_br: Outra solução para o problema de tarefas não comparáveis é criar uma classe wrapper que ignore o item da tarefa e compare apenas o campo de prioridade:

source: The remaining challenges revolve around finding a pending task and making changes to its priority or removing it entirely. Finding a task can be done with a dictionary pointing to an entry in the queue.
pt_br: Os desafios restantes giram em torno de encontrar uma tarefa pendente e fazer alterações em sua prioridade ou removê-la totalmente. Encontrar uma tarefa pode ser feito com um dicionário apontando para uma entrada na fila.

source: Removing the entry or changing its priority is more difficult because it would break the heap structure invariants. So, a possible solution is to mark the entry as removed and add a new entry with the revised priority::
pt_br: Remover a entrada ou alterar sua prioridade é mais difícil porque quebraria os invariantes da estrutura de heap. Assim, uma possível solução é marcar a entrada como removida e adicionar uma nova entrada com a prioridade revisada::

source: pq = [] # list of entries arranged in a heap entry_finder = {} # mapping of tasks to entries REMOVED = '<removed-task>' # placeholder for a removed task counter = itertools.count() # unique sequence count def add_task(task, priority=0): 'Add a new task or update the priority of an existing task' if task in entry_finder: remove_task(task) count = next(counter) entry = [priority, count, task] entry_finder[task] = entry heappush(pq, entry) def remove_task(task): 'Mark an existing task as REMOVED. Raise KeyError if not found.' entry = entry_finder.pop(task) entry[-1] = REMOVED def pop_task(): 'Remove and return the lowest priority task. Raise KeyError if empty.' while pq: priority, count, task = heappop(pq) if task is not REMOVED: del entry_finder[task] return task raise KeyError('pop from an empty priority queue')
pt_br: pq = [] # lista de entradas organizadas em uma heap entry_finder = {} # mapeamentos de tarefas para entradas REMOVED = '<removed-task>' # espaço reservado para uma tarefa removida counter = itertools.count() # contagem de sequência única def add_task(task, priority=0): 'Adiciona uma nova tarefa ou atualiza a prioridade de uma tarefa existente' if task in entry_finder: remove_task(task) count = next(counter) entry = [priority, count, task] entry_finder[task] = entry heappush(pq, entry) def remove_task(task): 'Marca uma tarefa existente com REMOVED (removida). Levanta KeyError se não encontrada.' entry = entry_finder.pop(task) entry[-1] = REMOVED def pop_task(): 'Remove e retorna a tarefa de mais baixa prioridade. Levanta KeyError se vazio.' while pq: priority, count, task = heappop(pq) if task is not REMOVED: del entry_finder[task] return task raise KeyError('pop from an empty priority queue')

source: Theory
pt_br: Teoria

source: Heaps are arrays for which ``a[k] <= a[2*k+1]`` and ``a[k] <= a[2*k+2]`` for all *k*, counting elements from 0. For the sake of comparison, non-existing elements are considered to be infinite. The interesting property of a heap is that ``a[0]`` is always its smallest element.
pt_br: Heaps são arrays para os quais ``a[k] <= a[2*k+1]`` e ``a[k] <= a[2*k+2]`` para todos *k*, contando elementos de 0. Para fins de comparação, os elementos inexistentes são considerados infinitos. A propriedade interessante de um heap é que ``a[0]`` é sempre seu menor elemento.

source: The strange invariant above is meant to be an efficient memory representation for a tournament. The numbers below are *k*, not ``a[k]``::
pt_br: O estranho invariante acima pretende ser uma representação de memória eficiente para um torneio. Os números abaixo são *k*, não ``a[k]``::

source: In the tree above, each cell *k* is topping ``2*k+1`` and ``2*k+2``. In a usual binary tournament we see in sports, each cell is the winner over the two cells it tops, and we can trace the winner down the tree to see all opponents s/he had. However, in many computer applications of such tournaments, we do not need to trace the history of a winner. To be more memory efficient, when a winner is promoted, we try to replace it by something else at a lower level, and the rule becomes that a cell and the two cells it tops contain three different items, but the top cell "wins" over the two topped cells.
pt_br: Na árvore acima, cada célula *k* está no topo de ``2*k+1`` e ``2*k+2``. Num torneio binário normal que vemos nos desportos, cada célula é a vencedora das duas células que está no topo, e podemos rastrear o vencedor na árvore para ver todos os adversários que teve. Contudo, em muitas aplicações informáticas de tais torneios, não precisamos de traçar a história de um vencedor. Para sermos mais eficientes em termos de memória, quando um vencedor é promovido, tentamos substituí-lo por algo de nível inferior, e a regra passa a ser que uma célula e as duas células que ela cobre contêm três itens diferentes, mas a célula de cima "ganha" sobre as duas células superiores.

source: If this heap invariant is protected at all time, index 0 is clearly the overall winner. The simplest algorithmic way to remove it and find the "next" winner is to move some loser (let's say cell 30 in the diagram above) into the 0 position, and then percolate this new 0 down the tree, exchanging values, until the invariant is re-established. This is clearly logarithmic on the total number of items in the tree. By iterating over all items, you get an *O*\ (*n* log *n*) sort.
pt_br: Se esse invariante de heap estiver protegido o tempo todo, o índice 0 é claramente o vencedor geral. A maneira algorítmica mais simples de removê-lo e encontrar o "próximo" vencedor é mover algum perdedor (digamos a célula 30 no diagrama acima) para a posição 0 e, em seguida, filtrar esse novo 0 pela árvore, trocando valores, até que o invariante é restabelecido. Isto é claramente logarítmico do número total de itens na árvore. Ao iterar todos os itens, você obtém uma classificação *O*\ (*n* log *n*).

source: A nice feature of this sort is that you can efficiently insert new items while the sort is going on, provided that the inserted items are not "better" than the last 0'th element you extracted. This is especially useful in simulation contexts, where the tree holds all incoming events, and the "win" condition means the smallest scheduled time. When an event schedules other events for execution, they are scheduled into the future, so they can easily go into the heap. So, a heap is a good structure for implementing schedulers (this is what I used for my MIDI sequencer :-).
pt_br: Um recurso interessante desse tipo é que você pode inserir novos itens com eficiência enquanto a classificação está em andamento, desde que os itens inseridos não sejam "melhores" que o último 0º elemento extraído. Isto é especialmente útil em contextos de simulação, onde a árvore contém todos os eventos recebidos e a condição "vitória" significa o menor tempo programado. Quando um evento agenda outros eventos para execução, eles são agendados para o futuro, para que possam entrar facilmente no heap. Portanto, um heap é uma boa estrutura para implementar escalonadores (foi isso que usei no meu sequenciador MIDI :-).

source: Various structures for implementing schedulers have been extensively studied, and heaps are good for this, as they are reasonably speedy, the speed is almost constant, and the worst case is not much different than the average case. However, there are other representations which are more efficient overall, yet the worst cases might be terrible.
pt_br: Várias estruturas para implementação de escalonadores foram extensivamente estudadas, e os heaps são bons para isso, pois são razoavelmente rápidos, a velocidade é quase constante e o pior caso não é muito diferente do caso médio. No entanto, existem outras representações que são globalmente mais eficientes, embora os piores casos possam ser terríveis.

source: Heaps are also very useful in big disk sorts. You most probably all know that a big sort implies producing "runs" (which are pre-sorted sequences, whose size is usually related to the amount of CPU memory), followed by a merging passes for these runs, which merging is often very cleverly organised [#]_. It is very important that the initial sort produces the longest runs possible. Tournaments are a good way to achieve that. If, using all the memory available to hold a tournament, you replace and percolate items that happen to fit the current run, you'll produce runs which are twice the size of the memory for random input, and much better for input fuzzily ordered.
pt_br: Heaps também são muito úteis em classificações de discos grandes. Provavelmente todos vocês sabem que uma classificação grande implica a produção de "execuções" (que são sequências pré-classificadas, cujo tamanho geralmente está relacionado à quantidade de memória da CPU), seguidas de passagens de fusão para essas execuções, cuja fusão geralmente é muito inteligente. organizado [#]_. É muito importante que a classificação inicial produza as execuções mais longas possíveis. Os torneios são uma boa maneira de conseguir isso. Se, usando toda a memória disponível para realizar um torneio, você substituir e filtrar itens que se encaixem na corrida atual, você produzirá corridas que têm o dobro do tamanho da memória para entradas aleatórias e muito melhores para entradas ordenadas de maneira imprecisa.

source: Moreover, if you output the 0'th item on disk and get an input which may not fit in the current tournament (because the value "wins" over the last output value), it cannot fit in the heap, so the size of the heap decreases. The freed memory could be cleverly reused immediately for progressively building a second heap, which grows at exactly the same rate the first heap is melting. When the first heap completely vanishes, you switch heaps and start a new run. Clever and quite effective!
pt_br: Além disso, se você gerar o 0º item no disco e obter uma entrada que pode não caber no torneio atual (porque o valor "ganha" sobre o último valor de saída), ele não poderá caber no heap, então o tamanho do heap diminui. A memória liberada poderia ser reutilizada de maneira inteligente e imediata para a construção progressiva de um segundo heap, que cresce exatamente na mesma proporção que o primeiro heap está derretendo. Quando o primeiro heap desaparece completamente, você troca os heaps e inicia uma nova execução. Inteligente e bastante eficaz!

source: In a word, heaps are useful memory structures to know. I use them in a few applications, and I think it is good to keep a 'heap' module around. :-)
pt_br: Em uma palavra, heaps são estruturas de memória úteis para conhecer. Eu os uso em alguns aplicativos e acho bom manter um módulo "heap" por perto. :-)

source: Footnotes
pt_br: Notas de rodapé

source: The disk balancing algorithms which are current, nowadays, are more annoying than clever, and this is a consequence of the seeking capabilities of the disks. On devices which cannot seek, like big tape drives, the story was quite different, and one had to be very clever to ensure (far in advance) that each tape movement will be the most effective possible (that is, will best participate at "progressing" the merge). Some tapes were even able to read backwards, and this was also used to avoid the rewinding time. Believe me, real good tape sorts were quite spectacular to watch! From all times, sorting has always been a Great Art! :-)
pt_br: Os algoritmos de balanceamento de disco atuais, hoje em dia, são mais incômodos do que inteligentes, e isso é consequência da capacidade de busca dos discos. Em dispositivos que não são capazes de buscar, como grandes drives de fita, a história era bem diferente, e era preciso ser muito inteligente para garantir (com muita antecedência) que cada movimento da fita seria o mais eficaz possível (isto é, participaria melhor na "progressão" da fusão). Algumas fitas podiam até ser lidas de trás para frente, o que também era usado para evitar o tempo de rebobinar. Acredite em mim, fitas realmente boas eram espetaculares de assistir! Desde sempre, ordenar sempre foi uma Grande Arte! :-)
