Repository: python/python-docs-pt-br
Catalog: library/hmac.po
Languages: pt_br

source: :mod:`!hmac` --- Keyed-Hashing for Message Authentication
pt_br: :mod:`!hmac` --- Código de autenticação de mensagem com chave hash

source: **Source code:** :source:`Lib/hmac.py`
pt_br: **Código-fonte:** :source:`Lib/hmac.py`

source: This module implements the HMAC algorithm as described by :rfc:`2104`.
pt_br: Este módulo implementa o algoritmo HMAC, abreviação de *hash-based message authentication code*, conforme descrito por :rfc:`2104`.

source: Return a new hmac object. *key* is a bytes or bytearray object giving the secret key. If *msg* is present, the method call ``update(msg)`` is made. *digestmod* is the digest name, digest constructor or module for the HMAC object to use. It may be any name suitable to :func:`hashlib.new`. Despite its argument position, it is required.
pt_br: Retorna um novo objeto hmac. *key* é um objeto bytes ou bytearray que fornece a chave secreta. Se *msg* estiver presente, a chamada de método ``update(msg)`` é feita. *digestmod* é o nome do resumo, construtor do resumo ou módulo para o objeto HMAC usar. Pode ser qualquer nome adequado para :func:`hashlib.new`. Apesar da posição do argumento, é obrigatório.

source: Parameter *key* can be a bytes or bytearray object. Parameter *msg* can be of any type supported by :mod:`hashlib`. Parameter *digestmod* can be the name of a hash algorithm.
pt_br: O parâmetro *key* pode ser um objeto bytes ou bytearray. O parâmetro *msg* pode ser de qualquer tipo suportado por :mod:`hashlib`. O parâmetro *digestmod* pode ser o nome de um algoritmo hash.

source: The *digestmod* argument is now required. Pass it as a keyword argument to avoid awkwardness when you do not have an initial *msg*.
pt_br: O argumento *digestmod* agora é obrigatório. Passe-o como um argumento nomeado para evitar constrangimentos quando você não tiver uma *msg* inicial.

source: Return digest of *msg* for given secret *key* and *digest*. The function is equivalent to ``HMAC(key, msg, digest).digest()``, but uses an optimized C or inline implementation, which is faster for messages that fit into memory. The parameters *key*, *msg*, and *digest* have the same meaning as in :func:`~hmac.new`.
pt_br: Retorna o resumo de *msg* para o segredo *key* e *digest* fornecidos. A função equivale a ``HMAC(key, msg, digest).digest()``, mas usa uma implementação C otimizada ou inline, que é mais rápida para mensagens que cabem na memória. Os parâmetros *key*, *msg* e *digest* têm o mesmo significado que em :func:`~hmac.new`.

source: CPython implementation detail, the optimized C implementation is only used when *digest* is a string and name of a digest algorithm, which is supported by OpenSSL.
pt_br: Detalhe da implementação do CPython: a implementação otimizada do C é usada somente quando *digest* é uma string e o nome de um algoritmo de resumo, que é suportado pelo OpenSSL.

source: An HMAC object has the following methods:
pt_br: Um objeto HMAC tem os seguintes métodos:

source: Update the hmac object with *msg*. Repeated calls are equivalent to a single call with the concatenation of all the arguments: ``m.update(a); m.update(b)`` is equivalent to ``m.update(a + b)``.
pt_br: Atualiza o objeto hmac com *msg*. Chamadas repetidas são equivalentes a uma única chamada com a concatenação de todos os argumentos: ``m.update(a); m.update(b)`` equivale a ``m.update(a + b)``.

source: Parameter *msg* can be of any type supported by :mod:`hashlib`.
pt_br: O parâmetro *msg* pode ser de qualquer tipo suportado por :mod:`hashlib`.

source: Return the digest of the bytes passed to the :meth:`update` method so far. This bytes object will be the same length as the *digest_size* of the digest given to the constructor. It may contain non-ASCII bytes, including NUL bytes.
pt_br: Retorna o resumo dos bytes passados para o método :meth:`update` até o momento. Este objeto bytes terá o mesmo comprimento que o *digest_size* do resumo dado ao construtor. Ele pode conter bytes não-ASCII, incluindo bytes NUL.

source: When comparing the output of :meth:`digest` to an externally supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
pt_br: Ao comparar a saída de :meth:`digest` com um resumo fornecido externamente durante uma rotina de verificação, é recomendável usar a função :func:`compare_digest` em vez do operador ``==`` para reduzir a vulnerabilidade a ataques de temporização.

source: Like :meth:`digest` except the digest is returned as a string twice the length containing only hexadecimal digits. This may be used to exchange the value safely in email or other non-binary environments.
pt_br: Como :meth:`digest` exceto que o resumo é retornado como uma string com o dobro do comprimento contendo apenas dígitos hexadecimais. Isso pode ser usado para trocar o valor com segurança em e-mail ou outros ambientes não binários.

source: When comparing the output of :meth:`hexdigest` to an externally supplied digest during a verification routine, it is recommended to use the :func:`compare_digest` function instead of the ``==`` operator to reduce the vulnerability to timing attacks.
pt_br: Ao comparar a saída de :meth:`hexdigest` com um resumo fornecido externamente durante uma rotina de verificação, é recomendável usar a função :func:`compare_digest` em vez do operador ``==`` para reduzir a vulnerabilidade a ataques de temporização.

source: Return a copy ("clone") of the hmac object. This can be used to efficiently compute the digests of strings that share a common initial substring.
pt_br: Retorna uma cópia ("clone") do objeto hmac. Isso pode ser usado para calcular eficientemente os resumos de strings que compartilham uma substring inicial comum.

source: A hash object has the following attributes:
pt_br: Um objeto hash tem os seguintes atributos:

source: The size of the resulting HMAC digest in bytes.
pt_br: O tamanho do resumo HMAC resultante em bytes.

source: The internal block size of the hash algorithm in bytes.
pt_br: O tamanho do bloco interna do algoritmo de hash em bytes.

source: The canonical name of this HMAC, always lowercase, e.g. ``hmac-md5``.
pt_br: O nome canônico deste HMAC, sempre em letras minúsculas, por exemplo, ``hmac-md5``.

source: Removed the undocumented attributes ``HMAC.digest_cons``, ``HMAC.inner``, and ``HMAC.outer``.
pt_br: Foram removidos os atributos não documentados ``HMAC.digest_cons``, ``HMAC.inner`` e ``HMAC.outer``.

source: This module also provides the following helper function:
pt_br: Este módulo também fornece a seguinte função auxiliar:

source: Return ``a == b``. This function uses an approach designed to prevent timing analysis by avoiding content-based short circuiting behaviour, making it appropriate for cryptography. *a* and *b* must both be of the same type: either :class:`str` (ASCII only, as e.g. returned by :meth:`HMAC.hexdigest`), or a :term:`bytes-like object`.
pt_br: Retorna ``a == b``. Esta função usa uma abordagem projetada para evitar análise de tempo evitando comportamento de curto-circuito baseado em conteúdo, tornando-a apropriada para criptografia. *a* e *b* devem ser ambos do mesmo tipo: :class:`str` (somente ASCII, como, por exemplo, retornado por :meth:`HMAC.hexdigest`), ou um :term:`objeto byte ou similar`.

source: If *a* and *b* are of different lengths, or if an error occurs, a timing attack could theoretically reveal information about the types and lengths of *a* and *b*—but not their values.
pt_br: Se *a* e *b* tiverem comprimentos diferentes, ou se ocorrer um erro, um ataque de temporização poderia teoricamente revelar informações sobre os tipos e comprimentos de *a* e *b*, mas não seus valores.

source: The function uses OpenSSL's ``CRYPTO_memcmp()`` internally when available.
pt_br: A função usa ``CRYPTO_memcmp()`` do OpenSSL internamente quando disponível.

source: Module :mod:`hashlib`
pt_br: Módulo :mod:`hashlib`

source: The Python module providing secure hash functions.
pt_br: O módulo Python que fornece funções hash seguras.
