Repository: python/python-docs-pt-br
Catalog: library/html.parser.po
Languages: pt_br

source: :mod:`!html.parser` --- Simple HTML and XHTML parser
pt_br: :mod:`!html.parser` --- Analisador simples de HTML e XHTML

source: **Source code:** :source:`Lib/html/parser.py`
pt_br: **Código-fonte:** :source:`Lib/html/parser.py`

source: This module defines a class :class:`HTMLParser` which serves as the basis for parsing text files formatted in HTML (HyperText Mark-up Language) and XHTML.
pt_br: Este módulo define uma classe :class:`HTMLParser` que serve como base para analisar arquivos de texto formatados em HTML (HyperText Markup Language) e XHTML.

source: Create a parser instance able to parse invalid markup.
pt_br: Cria uma instância de analisador sintático capaz de analisar marcação inválida.

source: If *convert_charrefs* is true (the default), all character references (except the ones in elements like ``script`` and ``style``) are automatically converted to the corresponding Unicode characters.
pt_br: Se *convert_charrefs* for verdadeiro (o padrão), todas as referências de caracteres (exceto as de elementos como ``script`` e ``style``) serão convertidas automaticamente para os caracteres Unicode correspondentes.

source: If *scripting* is false (the default), the content of the ``noscript`` element is parsed normally; if it's true, it's returned as is without being parsed.
pt_br: Se *scripting* for falso (o padrão), o conteúdo do elemento ``noscript`` será analisado normalmente; se for verdadeiro, será retornado como está, sem ser analisado.

source: An :class:`.HTMLParser` instance is fed HTML data and calls handler methods when start tags, end tags, text, comments, and other markup elements are encountered. The user should subclass :class:`.HTMLParser` and override its methods to implement the desired behavior.
pt_br: Uma instância de :class:`.HTMLParser` recebe dados HTML e chama métodos de tratamento quando encontra tags de abertura, tags de fechamento, texto, comentários e outros elementos de marcação. O usuário deve criar uma subclasse de :class:`.HTMLParser` e substituir seus métodos para implementar o comportamento desejado.

source: This parser does not check that end tags match start tags or call the end-tag handler for elements which are closed implicitly by closing an outer element.
pt_br: Este analisador sintático não verifica se as tags de fechamento correspondem às tags de abertura nem chama o manipulador de tags de fechamento para elementos que são fechados implicitamente pelo fechamento de um elemento externo.

source: *convert_charrefs* keyword argument added.
pt_br: Adicionado o argumento nomeado *convert_charrefs*.

source: The default value for argument *convert_charrefs* is now ``True``.
pt_br: O valor padrão para o argumento *convert_charrefs* agora é ``True``.

source: Added the *scripting* parameter.
pt_br: Adicionado o parâmetro *scripting*.

source: Example HTML Parser Application
pt_br: Exemplo de aplicação para análise de HTML

source: As a basic example, below is a simple HTML parser that uses the :class:`HTMLParser` class to print out start tags, end tags, and data as they are encountered:
pt_br: Como exemplo básico, abaixo está um analisador HTML simples que usa a classe :class:`HTMLParser` para exibir as tags de abertura, tags de fechamento e dados à medida que são encontrados:

source: from html.parser import HTMLParser class MyHTMLParser(HTMLParser): def handle_starttag(self, tag, attrs): print("Encountered a start tag:", tag) def handle_endtag(self, tag): print("Encountered an end tag :", tag) def handle_data(self, data): print("Encountered some data :", data) parser = MyHTMLParser() parser.feed('<html><head><title>Test</title></head>' '<body><h1>Parse me!</h1></body></html>')
pt_br: from html.parser import HTMLParser class MyHTMLParser(HTMLParser): def handle_starttag(self, tag, attrs): print("Encontrada a tag de abertura :", tag) def handle_endtag(self, tag): print("Encontrada a tag de fechamento:", tag) def handle_data(self, data): print("Encontrados alguns dados :", data) parser = MyHTMLParser() parser.feed('<html><head><title>Teste</title></head>' '<body><h1>Me analise!</h1></body></html>')

source: The output will then be:
pt_br: A saída então será:

source: Encountered a start tag: html Encountered a start tag: head Encountered a start tag: title Encountered some data : Test Encountered an end tag : title Encountered an end tag : head Encountered a start tag: body Encountered a start tag: h1 Encountered some data : Parse me! Encountered an end tag : h1 Encountered an end tag : body Encountered an end tag : html
pt_br: Encontrada a tag de abertura : html Encontrada a tag de abertura : head Encontrada a tag de abertura : title Encontrados alguns dados : Teste Encontrada a tag de fechamento: title Encontrada a tag de fechamento: head Encontrada a tag de abertura : body Encontrada a tag de abertura : h1 Encontrados alguns dados : Me analise! Encontrada a tag de fechamento: h1 Encontrada a tag de fechamento: body Encontrada a tag de fechamento: html

source: :class:`.HTMLParser` Methods
pt_br: Métodos :class:`.HTMLParser`

source: :class:`HTMLParser` instances have the following methods:
pt_br: Instâncias de :class:`HTMLParser` têm os seguintes métodos:

source: Feed some text to the parser. It is processed insofar as it consists of complete elements; incomplete data is buffered until more data is fed or :meth:`close` is called. *data* must be :class:`str`.
pt_br: Fornece algum texto ao analisador. Ele será processado na medida em que consistir em elementos completos; dados incompletos serão armazenados em buffer até que mais dados sejam fornecidos ou que o método :meth:`close` seja chamado. Os dados devem ser do tipo :class:`str`.

source: Force processing of all buffered data as if it were followed by an end-of-file mark. This method may be redefined by a derived class to define additional processing at the end of the input, but the redefined version should always call the :class:`HTMLParser` base class method :meth:`close`.
pt_br: Força o processamento de todos os dados em buffer como se fossem seguidos por uma marca de fim de arquivo. Este método pode ser redefinido por uma classe derivada para definir processamento adicional no final da entrada, mas a versão redefinida deve sempre chamar o método :meth:`close` da classe base :class:`HTMLParser`.

source: Reset the instance. Loses all unprocessed data. This is called implicitly at instantiation time.
pt_br: Reinicializa a instância. Perde todos os dados não processados. Este método é chamado implicitamente no momento da instanciação.

source: Return current line number and offset.
pt_br: Retorna o número da linha atual e o deslocamento.

source: Return the text of the most recently opened start tag. This should not normally be needed for structured processing, but may be useful in dealing with HTML "as deployed" or for re-generating input with minimal changes (whitespace between attributes can be preserved, etc.).
pt_br: Retorna o texto da tag de abertura aberta mais recentemente. Normalmente, isso não é necessário para processamento estruturado, mas pode ser útil ao lidar com HTML "como implantado" ou para regenerar a entrada com alterações mínimas (o espaço em branco entre os atributos pode ser preservado, etc.).

source: The following methods are called when data or markup elements are encountered and they are meant to be overridden in a subclass. The base class implementations do nothing (except for :meth:`~HTMLParser.handle_startendtag`):
pt_br: Os seguintes métodos são chamados quando elementos de dados ou de marcação são encontrados e devem ser sobrescritos em uma subclasse. As implementações da classe base não fazem nada (exceto por :meth:`~HTMLParser.handle_startendtag`):

source: This method is called to handle the start tag of an element (e.g. ``<div id="main">``).
pt_br: Este método é chamado para manipular a tag de abertura de um elemento (por exemplo, ``<div id="main">``).

source: The *tag* argument is the name of the tag converted to lower case. The *attrs* argument is a list of ``(name, value)`` pairs containing the attributes found inside the tag's ``<>`` brackets. The *name* will be translated to lower case, and quotes in the *value* have been removed, and character and entity references have been replaced.
pt_br: O argumento *tag* é o nome da tag convertido para minúsculas. O argumento *attrs* é uma lista de pares ``(nome, valor)`` contendo os atributos encontrados dentro dos colchetes ``<>`` da tag. O *nome* será traduzido para minúsculas, as aspas no *valor* foram removidas e as referências a caracteres e entidades foram substituídas.

source: For instance, for the tag ``<A HREF="https://www.cwi.nl/">``, this method would be called as ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.
pt_br: Por exemplo, para a tag ``<A HREF="https://www.cwi.nl/">``, este método seria chamado como ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.

source: All entity references from :mod:`html.entities` are replaced in the attribute values.
pt_br: Todas as referências de entidade de :mod:`html.entities` são substituídas nos valores dos atributos.

source: This method is called to handle the end tag of an element (e.g. ``</div>``).
pt_br: Este método é chamado para manipular a tag de fechamento de um elemento (por exemplo, ``</div>``).

source: The *tag* argument is the name of the tag converted to lower case.
pt_br: O argumento *tag* é o nome da etiqueta convertido para letras minúsculas.

source: Similar to :meth:`handle_starttag`, but called when the parser encounters an XHTML-style empty tag (``<img ... />``). This method may be overridden by subclasses which require this particular lexical information; the default implementation simply calls :meth:`handle_starttag` and :meth:`handle_endtag`.
pt_br: Similar a :meth:`handle_starttag`, mas chamado quando o analisador sintático encontra uma tag vazia no estilo XHTML (``<img ... />``). Este método pode ser substituído por subclasses que requerem essa informação lexical específica; a implementação padrão simplesmente chama :meth:`handle_starttag` e :meth:`handle_endtag`.

source: This method is called to process arbitrary data (e.g. text nodes and the content of elements like ``script`` and ``style``).
pt_br: Este método é chamado para processar dados arbitrários (por exemplo, nós de texto e o conteúdo de elementos como ``script`` e ``style``).

source: This method is called to process a named character reference of the form ``&name;`` (e.g. ``&gt;``), where *name* is a general entity reference (e.g. ``'gt'``). This method is only called if *convert_charrefs* is false.
pt_br: Este método é chamado para processar uma referência de caractere nomeada no formato ``&name;`` (por exemplo, ``&gt;``), onde *name* é uma referência de entidade genérica (por exemplo, ``'gt'``). Este método só é chamado se *convert_charrefs* for falso.

source: This method is called to process decimal and hexadecimal numeric character references of the form :samp:`&#{NNN};` and :samp:`&#x{NNN};`. For example, the decimal equivalent for ``&gt;`` is ``&#62;``, whereas the hexadecimal is ``&#x3E;``; in this case the method will receive ``'62'`` or ``'x3E'``. This method is only called if *convert_charrefs* is false.
pt_br: Este método é chamado para processar referências de caracteres numéricos decimais e hexadecimais no formato :samp:`&#{NNN};` e :samp:`&#x{NNN};`. Por exemplo, o equivalente decimal para ``&gt;`` é ``&#62;``, enquanto o hexadecimal é ``&#x3E;``; neste caso, o método receberá ``'62'`` ou ``'x3E'``. Este método só é chamado se *convert_charrefs* for falso.

source: This method is called when a comment is encountered (e.g. ``<!--comment-->``).
pt_br: Este método é chamado quando um comentário é encontrado (por exemplo, ``<!--comentário-->``).

source: For example, the comment ``<!-- comment -->`` will cause this method to be called with the argument ``' comment '``.
pt_br: Por exemplo, o comentário ``<!-- comentário -->`` fará com que este método seja chamado com o argumento ``' comentário '``.

source: The content of Internet Explorer conditional comments (condcoms) will also be sent to this method, so, for ``<!--[if IE 9]>IE9-specific content<![endif]-->``, this method will receive ``'[if IE 9]>IE9-specific content<![endif]'``.
pt_br: O conteúdo dos comentários condicionais do Internet Explorer (condcoms) também será enviado para este método, portanto, para ``<!--[if IE 9]>conteúdo específico do IE9<![endif]-->``, este método receberá ``'[if IE 9]>conteúdo específico do IE9<![endif]'``.

source: This method is called to handle an HTML doctype declaration (e.g. ``<!DOCTYPE html>``).
pt_br: Este método é chamado para lidar com uma declaração de doctype HTML (por exemplo, ``<!DOCTYPE html>``).

source: The *decl* parameter will be the entire contents of the declaration inside the ``<!...>`` markup (e.g. ``'DOCTYPE html'``).
pt_br: O parâmetro *decl* será todo o conteúdo da declaração dentro da marcação ``<!...>`` (por exemplo, ``'DOCTYPE html'``).

source: Method called when a processing instruction is encountered. The *data* parameter will contain the entire processing instruction. For example, for the processing instruction ``<?proc color='red'>``, this method would be called as ``handle_pi("proc color='red'")``. It is intended to be overridden by a derived class; the base class implementation does nothing.
pt_br: Método chamado quando uma instrução de processamento é encontrada. O parâmetro *data* conterá a instrução de processamento completa. Por exemplo, para a instrução de processamento ``<?proc color='red'>``, este método seria chamado como ``handle_pi("proc color='red'")``. Ele foi projetado para ser substituído por uma classe derivada; a implementação da classe base não faz nada.

source: The :class:`HTMLParser` class uses the SGML syntactic rules for processing instructions. An XHTML processing instruction using the trailing ``'?'`` will cause the ``'?'`` to be included in *data*.
pt_br: A classe :class:`HTMLParser` usa as regras sintáticas SGML para processar instruções. Uma instrução de processamento XHTML que usa o caractere ``'?'`` no final fará com que o ``'?'`` seja incluído em *data*.

source: This method is called when an unrecognized declaration is read by the parser.
pt_br: Este método é chamado quando uma declaração não reconhecida é lida pelo analisador sintático.

source: The *data* parameter will be the entire contents of the declaration inside the ``<![...]>`` markup. It is sometimes useful to be overridden by a derived class. The base class implementation does nothing.
pt_br: O parâmetro *data* será todo o conteúdo da declaração dentro da marcação ``<![...]>``. Às vezes, é útil que ele seja sobrescrito por uma classe derivada. A implementação da classe base não faz nada.

source: Examples
pt_br: Exemplos

source: The following class implements a parser that will be used to illustrate more examples:
pt_br: A classe a seguir implementa um analisador sintático que será usado para ilustrar mais exemplos:
