Repository: python/python-docs-pt-br
Catalog: library/http.cookiejar.po
Languages: pt_br

source: Return boolean value indicating whether cookie should be accepted from server.
pt_br: Повертає логічне значення, яке вказує, чи слід прийняти cookie від сервера.

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.extract_cookies`.
pt_br: *cookie* є екземпляром :class:`Cookie`. *request* — це об’єкт, що реалізує інтерфейс, визначений документацією для :meth:`CookieJar.extract_cookies`.

source: Return boolean value indicating whether cookie should be returned to server.
pt_br: Повернути логічне значення, яке вказує, чи потрібно повертати файл cookie на сервер.

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.add_cookie_header`.
pt_br: *cookie* є екземпляром :class:`Cookie`. *request* — це об’єкт, що реалізує інтерфейс, визначений документацією для :meth:`CookieJar.add_cookie_header`.

source: Return ``False`` if cookies should not be returned, given cookie domain.
pt_br: Повертає ``False``, якщо файли cookie не повинні повертатися, враховуючи домен файлів cookie.

source: This method is an optimization. It removes the need for checking every cookie with a particular domain (which might involve reading many files). Returning true from :meth:`domain_return_ok` and :meth:`path_return_ok` leaves all the work to :meth:`return_ok`.
pt_br: Цей метод є оптимізаційним. Це позбавляє від необхідності перевіряти кожен файл cookie з певним доменом (що може передбачати читання багатьох файлів). Повернення true з :meth:`domain_return_ok` і :meth:`path_return_ok` залишає всю роботу :meth:`return_ok`.

source: If :meth:`domain_return_ok` returns true for the cookie domain, :meth:`path_return_ok` is called for the cookie path. Otherwise, :meth:`path_return_ok` and :meth:`return_ok` are never called for that cookie domain. If :meth:`path_return_ok` returns true, :meth:`return_ok` is called with the :class:`Cookie` object itself for a full check. Otherwise, :meth:`return_ok` is never called for that cookie path.
pt_br: Якщо :meth:`domain_return_ok` повертає true для домену cookie, :meth:`path_return_ok` викликається для шляху до cookie. В іншому випадку :meth:`path_return_ok` і :meth:`return_ok` ніколи не викликаються для цього домену cookie. Якщо :meth:`path_return_ok` повертає true, :meth:`return_ok` викликається з самим об’єктом :class:`Cookie` для повної перевірки. Інакше :meth:`return_ok` ніколи не викликається для цього шляху cookie.

source: Note that :meth:`domain_return_ok` is called for every *cookie* domain, not just for the *request* domain. For example, the function might be called with both ``".example.com"`` and ``"www.example.com"`` if the request domain is ``"www.example.com"``. The same goes for :meth:`path_return_ok`.
pt_br: Зауважте, що :meth:`domain_return_ok` викликається для кожного домену *cookie*, а не лише для домену *request*. Наприклад, функція може бути викликана як з ``".example.com"``, так і з ``"www.example.com"``, якщо домен запиту ``"www.example.com"``. Те саме стосується :meth:`path_return_ok`.

source: The *request* argument is as documented for :meth:`return_ok`.
pt_br: Аргумент *request* відповідає документації для :meth:`return_ok`.

source: Return ``False`` if cookies should not be returned, given cookie path.
pt_br: Повертає ``False``, якщо файли cookie не повинні повертатися, враховуючи шлях до файлів cookie.

source: See the documentation for :meth:`domain_return_ok`.
pt_br: Перегляньте документацію для :meth:`domain_return_ok`.

source: In addition to implementing the methods above, implementations of the :class:`CookiePolicy` interface must also supply the following attributes, indicating which protocols should be used, and how. All of these attributes may be assigned to.
pt_br: На додаток до реалізації наведених вище методів, реалізації інтерфейсу :class:`CookiePolicy` також повинні надавати такі атрибути, що вказують, які протоколи слід використовувати та як. Усі ці атрибути можна призначити.

source: Implement Netscape protocol.
pt_br: Впровадити протокол Netscape.

source: Implement :rfc:`2965` protocol.
pt_br: Впровадити протокол :rfc:`2965`.

source: Don't add :mailheader:`Cookie2` header to requests (the presence of this header indicates to the server that we understand :rfc:`2965` cookies).
pt_br: Не додавайте заголовок :mailheader:`Cookie2` до запитів (наявність цього заголовка вказує серверу, що ми розуміємо файли cookie :rfc:`2965`).

source: The most useful way to define a :class:`CookiePolicy` class is by subclassing from :class:`DefaultCookiePolicy` and overriding some or all of the methods above. :class:`CookiePolicy` itself may be used as a 'null policy' to allow setting and receiving any and all cookies (this is unlikely to be useful).
pt_br: Найкориснішим способом визначення класу :class:`CookiePolicy` є створення підкласу з :class:`DefaultCookiePolicy` і перевизначення деяких або всіх методів вище. Сама :class:`CookiePolicy` може використовуватися як "нульова політика", щоб дозволити встановлення та отримання будь-яких і всіх файлів cookie (це навряд чи буде корисним).

source: DefaultCookiePolicy Objects
pt_br: Об’єкти DefaultCookiePolicy

source: Implements the standard rules for accepting and returning cookies.
pt_br: Реалізує стандартні правила прийому та повернення файлів cookie.

source: Both :rfc:`2965` and Netscape cookies are covered. RFC 2965 handling is switched off by default.
pt_br: Охоплено файли cookie :rfc:`2965` і Netscape. Обробку RFC 2965 вимкнено за замовчуванням.

source: The easiest way to provide your own policy is to override this class and call its methods in your overridden implementations before adding your own additional checks::
pt_br: Найпростіший спосіб надати власну політику — перевизначити цей клас і викликати його методи у своїх перевизначених реалізаціях перед додаванням власних додаткових перевірок:

source: In addition to the features required to implement the :class:`CookiePolicy` interface, this class allows you to block and allow domains from setting and receiving cookies. There are also some strictness switches that allow you to tighten up the rather loose Netscape protocol rules a little bit (at the cost of blocking some benign cookies).
pt_br: На додаток до функцій, необхідних для реалізації інтерфейсу :class:`CookiePolicy`, цей клас дозволяє блокувати та дозволяти доменам установлювати та отримувати файли cookie. Є також деякі перемикачі суворості, які дозволяють трохи посилити досить вільні правила протоколу Netscape (ціною блокування деяких безпечних файлів cookie).

source: A domain blocklist and allowlist is provided (both off by default). Only domains not in the blocklist and present in the allowlist (if the allowlist is active) participate in cookie setting and returning. Use the *blocked_domains* constructor argument, and :meth:`blocked_domains` and :meth:`set_blocked_domains` methods (and the corresponding argument and methods for *allowed_domains*). If you set an allowlist, you can turn it off again by setting it to :const:`None`.
pt_br: Надається список заблокованих і білих доменів (обидва вимкнено за умовчанням). У налаштуваннях і поверненні файлів cookie беруть участь лише домени, яких немає в списку блокувань, але присутні в списку дозволених (якщо список дозволених активний). Використовуйте аргумент конструктора *blocked_domains* і методи :meth:`blocked_domains` і :meth:`set_blocked_domains` (а також відповідний аргумент і методи для *allowed_domains*). Якщо ви встановили білий список, ви можете вимкнути його знову, встановивши для нього значення :const:`None`.

source: Domains in block or allow lists that do not start with a dot must equal the cookie domain to be matched. For example, ``"example.com"`` matches a blocklist entry of ``"example.com"``, but ``"www.example.com"`` does not. Domains that do start with a dot are matched by more specific domains too. For example, both ``"www.example.com"`` and ``"www.coyote.example.com"`` match ``".example.com"`` (but ``"example.com"`` itself does not). IP addresses are an exception, and must match exactly. For example, if blocked_domains contains ``"192.168.1.2"`` and ``".168.1.2"``, 192.168.1.2 is blocked, but 193.168.1.2 is not.
pt_br: Домени в списках блокування або дозволу, які не починаються з крапки, мають збігатися з доменом файлів cookie, який потрібно знайти. Наприклад, ``"example.com"`` відповідає запису списку блокувань ``"example.com"``, але ``"www.example.com"`` ні. Домени, які починаються з крапки, також відповідають більш конкретним доменам. Наприклад, і ``"www.example.com"``, і ``"www.coyote.example.com"`` відповідають ``".example.com"`` (але ``"example.com"`` сам по собі не робить). IP-адреси є винятком і мають точно збігатися. Наприклад, якщо blocked_domains містить ``"192.168.1.2"`` і ``".168.1.2"``, 192.168.1.2 заблоковано, а 193.168.1.2 – ні.

source: :class:`DefaultCookiePolicy` implements the following additional methods:
pt_br: :class:`DefaultCookiePolicy` реалізує такі додаткові методи:

source: Return the sequence of blocked domains (as a tuple).
pt_br: Повертає послідовність заблокованих доменів (у вигляді кортежу).

source: Set the sequence of blocked domains.
pt_br: Встановіть послідовність заблокованих доменів.

source: Return ``True`` if *domain* is on the blocklist for setting or receiving cookies.
pt_br: Возвращайте ``True``, если *домен* находится в черном списке для установки или получения файлов cookie.

source: Return :const:`None`, or the sequence of allowed domains (as a tuple).
pt_br: Повернути :const:`None` або послідовність дозволених доменів (як кортеж).

source: Set the sequence of allowed domains, or :const:`None`.
pt_br: Встановіть послідовність дозволених доменів або :const:`None`.

source: Return ``True`` if *domain* is not on the allowlist for setting or receiving cookies.
pt_br: Верните ``True``, если *домен* не находится в списке разрешенных для установки или получения файлов cookie.

source: :class:`DefaultCookiePolicy` instances have the following attributes, which are all initialised from the constructor arguments of the same name, and which may all be assigned to.
pt_br: :class:`DefaultCookiePolicy` екземпляри мають наведені нижче атрибути, які всі ініціалізуються однойменними аргументами конструктора, і які всі можуть бути призначені.

source: If true, request that the :class:`CookieJar` instance downgrade :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) to Netscape cookies by setting the version attribute of the :class:`Cookie` instance to 0. The default value is :const:`None`, in which case RFC 2109 cookies are downgraded if and only if :rfc:`2965` handling is turned off. Therefore, RFC 2109 cookies are downgraded by default.
pt_br: Якщо істина, вимагайте, щоб екземпляр :class:`CookieJar` повернув файли cookie :rfc:`2109` (тобто файли cookie, отримані в заголовку :mailheader:`Set-Cookie` з атрибутом cookie-версії 1) до файлів cookie Netscape встановлення атрибута версії екземпляра :class:`Cookie` на 0. Значенням за замовчуванням є :const:`None`, у цьому випадку файли cookie RFC 2109 повертаються до попередньої версії тоді і тільки якщо обробку :rfc:`2965` вимкнено. Тому за замовчуванням файли cookie RFC 2109 знижуються.

source: General strictness switches:
pt_br: Перемикачі загальної жорсткості:

source: Don't allow sites to set two-component domains with country-code top-level domains like ``.co.uk``, ``.gov.uk``, ``.co.nz``.etc. This is far from perfect and isn't guaranteed to work!
pt_br: Не дозволяйте сайтам встановлювати двокомпонентні домени з доменами верхнього рівня з кодом країни, наприклад ``.co.uk``, ``.gov.uk``, ``.co.nz``.etc. Це далеко не ідеально і не гарантовано спрацює!

source: :rfc:`2965` protocol strictness switches:
pt_br: :rfc:`2965` перемикачі суворості протоколу:

source: Follow :rfc:`2965` rules on unverifiable transactions (usually, an unverifiable transaction is one resulting from a redirect or a request for an image hosted on another site). If this is false, cookies are *never* blocked on the basis of verifiability
pt_br: Дотримуйтеся правил :rfc:`2965` щодо транзакцій, які не підлягають перевірці (зазвичай транзакція, яка не підлягає перевірці, є транзакцією, яка є результатом перенаправлення або запиту зображення, розміщеного на іншому сайті). Якщо це невірно, файли cookie *ніколи* не блокуються на основі можливості перевірки

source: Netscape protocol strictness switches:
pt_br: Перемикачі суворості протоколу Netscape:

source: Apply :rfc:`2965` rules on unverifiable transactions even to Netscape cookies.
pt_br: Застосовуйте правила :rfc:`2965` до транзакцій, які неможливо перевірити, навіть до файлів cookie Netscape.

source: Flags indicating how strict to be with domain-matching rules for Netscape cookies. See below for acceptable values.
pt_br: Прапорці, які вказують на те, наскільки суворими є правила відповідності домену для файлів cookie Netscape. Допустимі значення див. нижче.

source: Ignore cookies in Set-Cookie: headers that have names starting with ``'$'``.
pt_br: Ігноруйте файли cookie в Set-Cookie: заголовки, імена яких починаються з ``'$'``.

source: Don't allow setting cookies whose path doesn't path-match request URI.
pt_br: Заборонити встановлення файлів cookie, шлях яких не відповідає URI запиту.

source: When setting cookies, the 'host prefix' must not contain a dot (eg. ``www.foo.bar.com`` can't set a cookie for ``.bar.com``, because ``www.foo`` contains a dot).
pt_br: Під час встановлення файлів cookie "префікс хосту" не повинен містити крапку (наприклад, ``www.foo.bar.com`` не може встановити файл cookie для ``.bar.com``, оскільки ``www.foo`` містить крапку).

source: Cookies that did not explicitly specify a ``domain`` cookie-attribute can only be returned to a domain equal to the domain that set the cookie (eg. ``spam.example.com`` won't be returned cookies from ``example.com`` that had no ``domain`` cookie-attribute).
pt_br: Файли cookie, у яких явно не вказано атрибут cookie домену, можна повернути лише в домен, який відповідає домену, який встановив файл cookie (наприклад, spam.example.com не повертатиме файли cookie з ``example.com``, який не мав атрибута cookie ``domain``).

source: When setting cookies, require a full :rfc:`2965` domain-match.
pt_br: Під час встановлення файлів cookie вимагайте повного збігу домену :rfc:`2965`.

source: The following attributes are provided for convenience, and are the most useful combinations of the above flags:
pt_br: Наступні атрибути надано для зручності та є найкориснішими комбінаціями наведених вище позначок:

source: Equivalent to 0 (ie. all of the above Netscape domain strictness flags switched off).
pt_br: Еквівалент 0 (тобто всі наведені вище позначки суворості домену Netscape вимкнено).

source: Equivalent to ``DomainStrictNoDots|DomainStrictNonDomain``.
pt_br: Equivalente a ``DomainStrictNoDots|DomainStrictNonDomain``.

source: Cookie Objects
pt_br: Objetos Cookie

source: :class:`Cookie` instances have Python attributes roughly corresponding to the standard cookie-attributes specified in the various cookie standards. The correspondence is not one-to-one, because there are complicated rules for assigning default values, because the ``max-age`` and ``expires`` cookie-attributes contain equivalent information, and because :rfc:`2109` cookies may be 'downgraded' by :mod:`http.cookiejar` from version 1 to version 0 (Netscape) cookies.
pt_br: Екземпляри :class:`Cookie` мають атрибути Python, які приблизно відповідають стандартним атрибутам cookie, визначеним у різних стандартах cookie. Відповідність не є однозначною, оскільки існують складні правила для призначення значень за замовчуванням, тому що атрибути cookie ``max-age`` і ``expires`` містять еквівалентну інформацію, і тому, що :rfc:`2109` :mod:`http.cookiejar` може "понизити" файли cookie з версії 1 до версії 0 (Netscape).

source: Assignment to these attributes should not be necessary other than in rare circumstances in a :class:`CookiePolicy` method. The class does not enforce internal consistency, so you should know what you're doing if you do that.
pt_br: Призначення цих атрибутів не повинно бути необхідним, крім рідкісних випадків у методі :class:`CookiePolicy`. Клас не забезпечує внутрішньої узгодженості, тому ви повинні знати, що ви робите, якщо це робите.

source: Integer or :const:`None`. Netscape cookies have :attr:`version` 0. :rfc:`2965` and :rfc:`2109` cookies have a ``version`` cookie-attribute of 1. However, note that :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
pt_br: Ціле чи :const:`None`. Файли cookie Netscape мають :attr:`version` 0. Файли cookie :rfc:`2965` і :rfc:`2109` мають атрибут cookie ``version`` 1. Однак зауважте, що :mod:`http.cookiejar` може "понизити" файли cookie RFC 2109 до файлів cookie Netscape, у цьому випадку :attr:`version` дорівнює 0.

source: Cookie name (a string).
pt_br: Назва файлу cookie (рядок).

source: Cookie value (a string), or :const:`None`.
pt_br: Значення файлу cookie (рядок) або :const:`None`.

source: String representing a port or a set of ports (eg. '80', or '80,8080'), or :const:`None`.
pt_br: Рядок, що представляє порт або набір портів (наприклад, '80', або '80,8080'), або :const:`None`.

source: Cookie path (a string, eg. ``'/acme/rocket_launchers'``).
pt_br: Шлях файлу cookie (рядок, наприклад, ``'/acme/rocket_launchers'``).

source: ``True`` if cookie should only be returned over a secure connection.
pt_br: ``True``, якщо cookie має повертатися лише через безпечне з’єднання.

source: Integer expiry date in seconds since epoch, or :const:`None`. See also the :meth:`is_expired` method.
pt_br: Ціла дата закінчення терміну дії в секундах з епохи або :const:`None`. Дивіться також метод :meth:`is_expired`.

source: ``True`` if this is a session cookie.
pt_br: ``True``, якщо це сеансовий файл cookie.

source: String comment from the server explaining the function of this cookie, or :const:`None`.
pt_br: Рядковий коментар від сервера, що пояснює функцію цього файлу cookie, або :const:`None`.

source: URL linking to a comment from the server explaining the function of this cookie, or :const:`None`.
pt_br: URL-адреса з посиланням на коментар із сервера, що пояснює функцію цього файлу cookie, або :const:`None`.

source: ``True`` if this cookie was received as an :rfc:`2109` cookie (ie. the cookie arrived in a :mailheader:`Set-Cookie` header, and the value of the Version cookie-attribute in that header was 1). This attribute is provided because :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
pt_br: ``True``, якщо цей файл cookie було отримано як файл cookie :rfc:`2109` (тобто файл cookie надійшов у заголовок :mailheader:`Set-Cookie`, а значення атрибута cookie Version у цьому заголовку було 1). Цей атрибут надається тому, що :mod:`http.cookiejar` може "понизити" файли cookie RFC 2109 до файлів cookie Netscape, у такому випадку :attr:`version` дорівнює 0.

source: ``True`` if a port or set of ports was explicitly specified by the server (in the :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2` header).
pt_br: ``True``, якщо порт або набір портів було явно вказано сервером (у заголовку :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2`).

source: ``True`` if a domain was explicitly specified by the server.
pt_br: ``True``, якщо домен явно вказано сервером.

source: ``True`` if the domain explicitly specified by the server began with a dot (``'.'``).
pt_br: ``True``, якщо домен, явно вказаний сервером, починається з крапки (``'.''``).

source: Cookies may have additional non-standard cookie-attributes. These may be accessed using the following methods:
pt_br: Файли cookie можуть мати додаткові нестандартні атрибути файлів cookie. До них можна отримати доступ за допомогою таких методів:

source: Return ``True`` if cookie has the named cookie-attribute.
pt_br: Повертає ``True``, якщо cookie має названий атрибут cookie.

source: If cookie has the named cookie-attribute, return its value. Otherwise, return *default*.
pt_br: Якщо cookie має названий атрибут cookie, повертає його значення. В іншому випадку поверніть *default*.

source: Set the value of the named cookie-attribute.
pt_br: Установіть значення іменованого атрибута cookie.

source: The :class:`Cookie` class also defines the following method:
pt_br: Клас :class:`Cookie` також визначає такий метод:

source: ``True`` if cookie has passed the time at which the server requested it should expire. If *now* is given (in seconds since the epoch), return whether the cookie has expired at the specified time.
pt_br: ``True``, якщо термін дії файлу cookie минув, коли його запитував сервер. Якщо вказано *now* (у секундах з епохи), повертається, чи закінчився термін дії файлу cookie у вказаний час.

source: Examples
pt_br: Exemplos

source: The first example shows the most common usage of :mod:`http.cookiejar`::
pt_br: Перший приклад показує найпоширеніше використання :mod:`http.cookiejar`::

source: This example illustrates how to open a URL using your Netscape, Mozilla, or Lynx cookies (assumes Unix/Netscape convention for location of the cookies file)::
pt_br: У цьому прикладі показано, як відкрити URL-адресу за допомогою файлів cookie Netscape, Mozilla або Lynx (припускається, що для розташування файлу cookie використовується угода Unix/Netscape):

source: The next example illustrates the use of :class:`DefaultCookiePolicy`. Turn on :rfc:`2965` cookies, be more strict about domains when setting and returning Netscape cookies, and block some domains from setting cookies or having them returned::
pt_br: Наступний приклад ілюструє використання :class:`DefaultCookiePolicy`. Увімкніть файли cookie :rfc:`2965`, будьте суворішими щодо доменів під час встановлення та повернення файлів cookie Netscape і забороніть деяким доменам установлювати або повертати файли cookie::
