Repository: python/python-docs-pt-br
Catalog: library/http.cookies.po
Languages: pt_br

source: :mod:`!http.cookies` --- HTTP state management
pt_br: :mod:`!http.cookies` --- Управление состоянием HTTP

source: **Source code:** :source:`Lib/http/cookies.py`
pt_br: **Código-fonte:** :source:`Lib/http/cookies.py`

source: The :mod:`http.cookies` module defines classes for abstracting the concept of cookies, an HTTP state management mechanism. It supports both simple string-only cookies, and provides an abstraction for having any serializable data-type as cookie value.
pt_br: Модуль :mod:`http.cookies` визначає класи для абстрагування концепції файлів cookie, механізму керування станом HTTP. Він підтримує як прості файли cookie лише з рядками, так і надає абстракцію для будь-якого серіалізованого типу даних як значення cookie.

source: The module formerly strictly applied the parsing rules described in the :rfc:`2109` and :rfc:`2068` specifications. It has since been discovered that MSIE 3.0x didn't follow the character rules outlined in those specs; many current-day browsers and servers have also relaxed parsing rules when it comes to cookie handling. As a result, this module now uses parsing rules that are a bit less strict than they once were.
pt_br: Раньше модуль строго применял правила синтаксического анализа, описанные в спецификациях :rfc:`2109` и :rfc:`2068`. С тех пор было обнаружено, что MSIE 3.0x не соответствует правилам символов, изложенным в этих спецификациях; многие современные браузеры и серверы также смягчили правила синтаксического анализа, когда дело доходит до обработки файлов cookie. В результате этот модуль теперь использует несколько менее строгие правила синтаксического анализа, чем раньше.

source: The character set, :data:`string.ascii_letters`, :data:`string.digits` and ``!#$%&'*+-.^_`|~:`` denote the set of valid characters allowed by this module in a cookie name (as :attr:`~Morsel.key`).
pt_br: Набор символов :data:`string.ascii_letters`, :data:`string.digits` и ``!# $ %&'*+-.^_`|~:`` обозначают набор допустимых символов, разрешенных этот модуль в имени файла cookie (например, :attr:`~Morsel.key`).

source: Allowed ':' as a valid cookie name character.
pt_br: Разрешен символ «:» в качестве допустимого символа имени файла cookie.

source: On encountering an invalid cookie, :exc:`CookieError` is raised, so if your cookie data comes from a browser you should always prepare for invalid data and catch :exc:`CookieError` on parsing.
pt_br: У разі виявлення недійсних файлів cookie виникає помилка :exc:`CookieError`, тому, якщо ваші дані файлів cookie надходять із браузера, ви повинні завжди бути готовими до недійсних даних і виявляти помилку :exc:`CookieError` під час синтаксичного аналізу.

source: Exception failing because of :rfc:`2109` invalidity: incorrect attributes, incorrect :mailheader:`Set-Cookie` header, etc.
pt_br: Помилка виключення через недійсність :rfc:`2109`: неправильні атрибути, неправильний заголовок :mailheader:`Set-Cookie` тощо.

source: This class is a dictionary-like object whose keys are strings and whose values are :class:`Morsel` instances. Note that upon setting a key to a value, the value is first converted to a :class:`Morsel` containing the key and the value.
pt_br: Цей клас є словниковим об’єктом, ключі якого є рядками, а значення – екземплярами :class:`Morsel`. Зауважте, що після встановлення ключа значення, значення спочатку перетворюється на :class:`Morsel`, що містить ключ і значення.

source: If *input* is given, it is passed to the :meth:`load` method.
pt_br: Якщо задано *input*, воно передається в метод :meth:`load`.

source: This class derives from :class:`BaseCookie` and overrides :meth:`~BaseCookie.value_decode` and :meth:`~BaseCookie.value_encode`. :class:`!SimpleCookie` supports strings as cookie values. When setting the value, :class:`!SimpleCookie` calls the builtin :func:`str` to convert the value to a string. Values received from HTTP are kept as strings.
pt_br: Этот класс является производным от :class:`BaseCookie` и переопределяет :meth:`~BaseCookie.value_decode` и :meth:`~BaseCookie.value_encode`. :class:`!SimpleCookie` поддерживает строки в качестве значений cookie. При установке значения :class:`!SimpleCookie` вызывает встроенную функцию :func:`str` для преобразования значения в строку. Значения, полученные по HTTP, сохраняются в виде строк.

source: Module :mod:`http.cookiejar`
pt_br: Módulo :mod:`http.cookiejar`

source: HTTP cookie handling for web *clients*. The :mod:`http.cookiejar` and :mod:`http.cookies` modules do not depend on each other.
pt_br: Обробка файлів cookie HTTP для веб-*клієнтів*. Модулі :mod:`http.cookiejar` і :mod:`http.cookies` не залежать один від одного.

source: :rfc:`2109` - HTTP State Management Mechanism
pt_br: :rfc:`2109` - механізм керування станом HTTP

source: This is the state management specification implemented by this module.
pt_br: Це специфікація управління станом, реалізована цим модулем.

source: Cookie Objects
pt_br: Objetos Cookie

source: Return a tuple ``(real_value, coded_value)`` from a string representation. ``real_value`` can be any type. This method does no decoding in :class:`BaseCookie` --- it exists so it can be overridden.
pt_br: Повертає кортеж ``(real_value, coded_value)`` із представлення рядка. ``real_value`` може мати будь-який тип. Цей метод не виконує декодування в :class:`BaseCookie` --- він існує, тому його можна замінити.

source: Return a tuple ``(real_value, coded_value)``. *val* can be any type, but ``coded_value`` will always be converted to a string. This method does no encoding in :class:`BaseCookie` --- it exists so it can be overridden.
pt_br: Повертає кортеж ``(real_value, coded_value)``. *val* може мати будь-який тип, але ``coded_value`` завжди буде перетворено на рядок. Цей метод не кодує в :class:`BaseCookie` --- він існує, тому його можна замінити.

source: In general, it should be the case that :meth:`value_encode` and :meth:`value_decode` are inverses on the range of *value_decode*.
pt_br: Загалом має бути так, що :meth:`value_encode` і :meth:`value_decode` є зворотними в діапазоні *value_decode*.

source: Return a string representation suitable to be sent as HTTP headers. *attrs* and *header* are sent to each :class:`Morsel`'s :meth:`~Morsel.output` method. *sep* is used to join the headers together, and is by default the combination ``'\r\n'`` (CRLF).
pt_br: Возвращает строковое представление, подходящее для отправки в виде заголовков HTTP. *attrs* и *header* отправляются в каждый метод :meth:`~Morsel.output` :class:`Morsel`. *sep* используется для объединения заголовков и по умолчанию представляет собой комбинацию ``'\r\n'`` (CRLF).

source: Return an embeddable JavaScript snippet, which, if run on a browser which supports JavaScript, will act the same as if the HTTP headers was sent.
pt_br: Повертає вбудований фрагмент JavaScript, який, якщо його запустити у браузері, який підтримує JavaScript, діятиме так само, як якщо б було надіслано заголовки HTTP.

source: The meaning for *attrs* is the same as in :meth:`output`.
pt_br: Значення *attrs* таке ж, як і в :meth:`output`.

source: If *rawdata* is a string, parse it as an ``HTTP_COOKIE`` and add the values found there as :class:`Morsel`\ s. If it is a dictionary, it is equivalent to::
pt_br: Якщо *rawdata* є рядком, проаналізуйте його як ``HTTP_COOKIE`` і додайте знайдені значення як :class:`Morsel`\ s. Якщо це словник, він еквівалентний::

source: for k, v in rawdata.items(): cookie[k] = v
pt_br: для k, v в rawdata.items(): cookie[k] = v

source: Morsel Objects
pt_br: Objetos Morsel

source: Abstract a key/value pair, which has some :rfc:`2109` attributes.
pt_br: Абстрагуйте пару ключ/значення, яка має деякі атрибути :rfc:`2109`.

source: Morsels are dictionary-like objects, whose set of keys is constant --- the valid :rfc:`2109` attributes, which are:
pt_br: Морсели — это объекты, подобные словарю, набор ключей которых является постоянным — допустимые атрибуты :rfc:`2109`, а именно:

source: The attribute :attr:`httponly` specifies that the cookie is only transferred in HTTP requests, and is not accessible through JavaScript. This is intended to mitigate some forms of cross-site scripting.
pt_br: Атрибут :attr:`httponly` вказує, що файл cookie передається лише в HTTP-запитах і не доступний через JavaScript. Це призначено для пом’якшення деяких форм міжсайтових сценаріїв.

source: The attribute :attr:`samesite` specifies that the browser is not allowed to send the cookie along with cross-site requests. This helps to mitigate CSRF attacks. Valid values for this attribute are "Strict" and "Lax".
pt_br: Атрибут :attr:`samesite` вказує, що браузеру заборонено надсилати файли cookie разом із міжсайтовими запитами. Це допомагає пом’якшити атаки CSRF. Дійсні значення для цього атрибута: "Strict" і "Lax".

source: The keys are case-insensitive and their default value is ``''``.
pt_br: Ключі нечутливі до регістру, а їхнє значення за замовчуванням – ``''``.

source: :meth:`!__eq__` now takes :attr:`~Morsel.key` and :attr:`~Morsel.value` into account.
pt_br: :meth:`!__eq__` теперь учитывает :attr:`~Morsel.key` и :attr:`~Morsel.value`.

source: Attributes :attr:`~Morsel.key`, :attr:`~Morsel.value` and :attr:`~Morsel.coded_value` are read-only. Use :meth:`~Morsel.set` for setting them.
pt_br: Атрибути :attr:`~Morsel.key`, :attr:`~Morsel.value` і :attr:`~Morsel.coded_value` доступні лише для читання. Використовуйте :meth:`~Morsel.set` для їх налаштування.

source: Added support for the :attr:`samesite` attribute.
pt_br: Додано підтримку атрибута :attr:`samesite`.

source: The value of the cookie.
pt_br: O valor do cookie.

source: The encoded value of the cookie --- this is what should be sent.
pt_br: Закодоване значення файлу cookie --- це те, що потрібно надіслати.

source: The name of the cookie.
pt_br: O nome do cookie.

source: Set the *key*, *value* and *coded_value* attributes.
pt_br: Установіть атрибути *key*, *value* і *coded_value*.

source: Whether *K* is a member of the set of keys of a :class:`Morsel`.
pt_br: Чи є *K* членом набору ключів :class:`Morsel`.

source: Return a string representation of the Morsel, suitable to be sent as an HTTP header. By default, all the attributes are included, unless *attrs* is given, in which case it should be a list of attributes to use. *header* is by default ``"Set-Cookie:"``.
pt_br: Повертає рядкове представлення Morsel, придатне для надсилання як заголовок HTTP. За замовчуванням включено всі атрибути, якщо не вказано *attrs*, у цьому випадку це має бути список атрибутів для використання. *заголовок* за замовчуванням ``"Set-Cookie:"``.

source: Return an embeddable JavaScript snippet, which, if run on a browser which supports JavaScript, will act the same as if the HTTP header was sent.
pt_br: Повертає вбудований фрагмент JavaScript, який, якщо запустити в браузері, який підтримує JavaScript, діятиме так само, як якщо б було надіслано заголовок HTTP.

source: Return a string representing the Morsel, without any surrounding HTTP or JavaScript.
pt_br: Повертає рядок, що представляє Morsel, без будь-якого оточуючого HTTP або JavaScript.

source: Update the values in the Morsel dictionary with the values in the dictionary *values*. Raise an error if any of the keys in the *values* dict is not a valid :rfc:`2109` attribute.
pt_br: Оновіть значення в словнику Morsel значеннями в словнику *values*. Викликає помилку, якщо будь-який із ключів у *values* dict не є дійсним атрибутом :rfc:`2109`.

source: an error is raised for invalid keys.
pt_br: виникає помилка для недійсних ключів.

source: Return a shallow copy of the Morsel object.
pt_br: Поверніть дрібну копію об’єкта Morsel.

source: return a Morsel object instead of a dict.
pt_br: повертає об’єкт Morsel замість dict.

source: Raise an error if key is not a valid :rfc:`2109` attribute, otherwise behave the same as :meth:`dict.setdefault`.
pt_br: Викликає помилку, якщо ключ не є дійсним атрибутом :rfc:`2109`, інакше веде себе так само, як :meth:`dict.setdefault`.

source: Example
pt_br: Exemplo

source: The following example demonstrates how to use the :mod:`http.cookies` module.
pt_br: У наступному прикладі показано, як використовувати модуль :mod:`http.cookies`.
