Repository: python/python-docs-pt-br
Catalog: library/http.cookiejar.po
Languages: pt_br

source: :mod:`!http.cookiejar` --- Cookie handling for HTTP clients
pt_br: :mod:`!http.cookiejar` --- Обработка файлов cookie для HTTP-клиентов

source: **Source code:** :source:`Lib/http/cookiejar.py`
pt_br: **Código-fonte:** :source:`Lib/http/cookiejar.py`

source: The :mod:`http.cookiejar` module defines classes for automatic handling of HTTP cookies. It is useful for accessing web sites that require small pieces of data -- :dfn:`cookies` -- to be set on the client machine by an HTTP response from a web server, and then returned to the server in later HTTP requests.
pt_br: Модуль :mod:`http.cookiejar` визначає класи для автоматичної обробки файлів cookie HTTP. Це корисно для доступу до веб-сайтів, яким потрібні невеликі фрагменти даних — :dfn:`cookies` — які встановлюються на клієнтській машині за допомогою відповіді HTTP від веб-сервера, а потім повертаються на сервер у наступних запитах HTTP.

source: Both the regular Netscape cookie protocol and the protocol defined by :rfc:`2965` are handled. RFC 2965 handling is switched off by default. :rfc:`2109` cookies are parsed as Netscape cookies and subsequently treated either as Netscape or RFC 2965 cookies according to the 'policy' in effect. Note that the great majority of cookies on the internet are Netscape cookies. :mod:`http.cookiejar` attempts to follow the de-facto Netscape cookie protocol (which differs substantially from that set out in the original Netscape specification), including taking note of the ``max-age`` and ``port`` cookie-attributes introduced with RFC 2965.
pt_br: Обробляються як звичайний протокол cookie Netscape, так і протокол, визначений :rfc:`2965`. Обробку RFC 2965 вимкнено за замовчуванням. :rfc:`2109` файли cookie аналізуються як файли cookie Netscape і згодом розглядаються як файли cookie Netscape або RFC 2965 відповідно до чинної "політики". Зверніть увагу, що більшість файлів cookie в Інтернеті є файлами cookie Netscape. :mod:`http.cookiejar` намагається слідувати фактичному протоколу файлів cookie Netscape (який суттєво відрізняється від викладеного в оригінальній специфікації Netscape), включно з врахуванням ``max-age`` і ``port`` атрибути cookie, введені з RFC 2965.

source: The various named parameters found in :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers (eg. ``domain`` and ``expires``) are conventionally referred to as :dfn:`attributes`. To distinguish them from Python attributes, the documentation for this module uses the term :dfn:`cookie-attribute` instead.
pt_br: Різноманітні іменовані параметри, які містяться в заголовках :mailheader:`Set-Cookie` і :mailheader:`Set-Cookie2` (наприклад, ``domain`` і ``expires``), зазвичай називаються :dfn:`attributes` . Щоб відрізнити їх від атрибутів Python, у документації для цього модуля замість цього використовується термін :dfn:`cookie-attribute`.

source: The module defines the following exception:
pt_br: Модуль визначає такий виняток:

source: Instances of :class:`FileCookieJar` raise this exception on failure to load cookies from a file. :exc:`LoadError` is a subclass of :exc:`OSError`.
pt_br: Екземпляри :class:`FileCookieJar` викликають цей виняток, якщо неможливо завантажити файли cookie з файлу. :exc:`LoadError` є підкласом :exc:`OSError`.

source: :exc:`LoadError` used to be a subtype of :exc:`IOError`, which is now an alias of :exc:`OSError`.
pt_br: :exc:`LoadError` раньше был подтипом :exc:`IOError`, который теперь является псевдонимом :exc:`OSError`.

source: The following classes are provided:
pt_br: As sequintes classes são disponibilizadas:

source: *policy* is an object implementing the :class:`CookiePolicy` interface.
pt_br: *policy* — це об’єкт, що реалізує інтерфейс :class:`CookiePolicy`.

source: The :class:`CookieJar` class stores HTTP cookies. It extracts cookies from HTTP requests, and returns them in HTTP responses. :class:`CookieJar` instances automatically expire contained cookies when necessary. Subclasses are also responsible for storing and retrieving cookies from a file or database.
pt_br: Клас :class:`CookieJar` зберігає файли cookie HTTP. Він витягує файли cookie із HTTP-запитів і повертає їх у HTTP-відповідях. Примірники :class:`CookieJar` автоматично припиняють дію файлів cookie, коли це необхідно. Підкласи також відповідають за зберігання та отримання файлів cookie з файлу або бази даних.

source: *policy* is an object implementing the :class:`CookiePolicy` interface. For the other arguments, see the documentation for the corresponding attributes.
pt_br: *policy* — це об’єкт, що реалізує інтерфейс :class:`CookiePolicy`. Інші аргументи дивіться в документації для відповідних атрибутів.

source: A :class:`CookieJar` which can load cookies from, and perhaps save cookies to, a file on disk. Cookies are **NOT** loaded from the named file until either the :meth:`load` or :meth:`revert` method is called. Subclasses of this class are documented in section :ref:`file-cookie-jar-classes`.
pt_br: :class:`CookieJar`, який може завантажувати файли cookie з файлу на диску та, можливо, зберігати файли cookie. Файли cookie **НЕ** завантажуються з названого файлу, доки не буде викликано метод :meth:`load` або :meth:`revert`. Підкласи цього класу задокументовані в розділі :ref:`file-cookie-jar-classes`.

source: This should not be initialized directly – use its subclasses below instead.
pt_br: Его не следует инициализировать напрямую — вместо этого используйте его подклассы ниже.

source: The filename parameter supports a :term:`path-like object`.
pt_br: Параметр імені файлу підтримує :term:`path-like object`.

source: This class is responsible for deciding whether each cookie should be accepted from / returned to the server.
pt_br: Цей клас відповідає за прийняття рішення про прийняття кожного файлу cookie від сервера або повернення на нього.

source: Constructor arguments should be passed as keyword arguments only. *blocked_domains* is a sequence of domain names that we never accept cookies from, nor return cookies to. *allowed_domains* if not :const:`None`, this is a sequence of the only domains for which we accept and return cookies. *secure_protocols* is a sequence of protocols for which secure cookies can be added to. By default *https* and *wss* (secure websocket) are considered secure protocols. For all other arguments, see the documentation for :class:`CookiePolicy` and :class:`DefaultCookiePolicy` objects.
pt_br: Аргументи конструктора слід передавати лише як аргументи ключових слів. *blocked_domains* – це послідовність доменних імен, з яких ми ніколи не приймаємо файли cookie та не повертаємо файли cookie. *allowed_domains* якщо не :const:`None`, це послідовність єдиних доменів, для яких ми приймаємо та повертаємо файли cookie. *secure_protocols* — це послідовність протоколів, до яких можна додати захищені файли cookie. За умовчанням *https* і *wss* (безпечний веб-сокет) вважаються безпечними протоколами. Усі інші аргументи дивіться в документації для об’єктів :class:`CookiePolicy` і :class:`DefaultCookiePolicy`.

source: :class:`DefaultCookiePolicy` implements the standard accept / reject rules for Netscape and :rfc:`2965` cookies. By default, :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) are treated according to the RFC 2965 rules. However, if RFC 2965 handling is turned off or :attr:`rfc2109_as_netscape` is ``True``, RFC 2109 cookies are 'downgraded' by the :class:`CookieJar` instance to Netscape cookies, by setting the :attr:`version` attribute of the :class:`Cookie` instance to 0. :class:`DefaultCookiePolicy` also provides some parameters to allow some fine-tuning of policy.
pt_br: :class:`DefaultCookiePolicy` реалізує стандартні правила прийняття/відхилення файлів cookie Netscape і :rfc:`2965`. За замовчуванням файли cookie :rfc:`2109` (тобто файли cookie, отримані в заголовку :mailheader:`Set-Cookie` з атрибутом cookie версії 1) обробляються відповідно до правил RFC 2965. Проте, якщо обробку RFC 2965 вимкнено або :attr:`rfc2109_as_netscape` має значення ``True``, файли cookie RFC 2109 "понижуються" екземпляром :class:`CookieJar` до файлів cookie Netscape, встановлюючи :attr:`version` екземпляра :class:`Cookie` дорівнює 0. :class:`DefaultCookiePolicy` також надає деякі параметри, щоб дозволити деяке тонке налаштування політики.

source: This class represents Netscape, :rfc:`2109` and :rfc:`2965` cookies. It is not expected that users of :mod:`http.cookiejar` construct their own :class:`Cookie` instances. Instead, if necessary, call :meth:`make_cookies` on a :class:`CookieJar` instance.
pt_br: Цей клас представляє файли cookie Netscape, :rfc:`2109` і :rfc:`2965`. Не очікується, що користувачі :mod:`http.cookiejar` створюватимуть власні екземпляри :class:`Cookie`. Замість цього, якщо необхідно, викличте :meth:`make_cookies` на екземплярі :class:`CookieJar`.

source: Module :mod:`urllib.request`
pt_br: Módulo :mod:`urllib.request`

source: URL opening with automatic cookie handling.
pt_br: Відкриття URL-адреси з автоматичною обробкою файлів cookie.

source: Module :mod:`http.cookies`
pt_br: Модуль :mod:`http.cookies`

source: HTTP cookie classes, principally useful for server-side code. The :mod:`http.cookiejar` and :mod:`http.cookies` modules do not depend on each other.
pt_br: Класи cookie HTTP, які в основному корисні для коду на стороні сервера. Модулі :mod:`http.cookiejar` і :mod:`http.cookies` не залежать один від одного.

source: The specification of the original Netscape cookie protocol. Though this is still the dominant protocol, the 'Netscape cookie protocol' implemented by all the major browsers (and :mod:`http.cookiejar`) only bears a passing resemblance to the one sketched out in ``cookie_spec.html``.
pt_br: Специфікація оригінального протоколу cookie Netscape. Хоча це все ще домінуючий протокол, "протокол файлів cookie Netscape", реалізований усіма основними браузерами (і :mod:`http.cookiejar`), лише побіжно схожий на той, який накреслено в ``cookie_spec.html``.

source: :rfc:`2109` - HTTP State Management Mechanism
pt_br: :rfc:`2109` - механізм керування станом HTTP

source: Obsoleted by :rfc:`2965`. Uses :mailheader:`Set-Cookie` with version=1.
pt_br: Застаріло :rfc:`2965`. Використовує :mailheader:`Set-Cookie` з версією=1.

source: :rfc:`2965` - HTTP State Management Mechanism
pt_br: :rfc:`2965` - механізм керування станом HTTP

source: The Netscape protocol with the bugs fixed. Uses :mailheader:`Set-Cookie2` in place of :mailheader:`Set-Cookie`. Not widely used.
pt_br: Протокол Netscape з виправленими помилками. Використовує :mailheader:`Set-Cookie2` замість :mailheader:`Set-Cookie`. Широко не використовується.

source: Unfinished errata to :rfc:`2965`.
pt_br: Незавершені помилки до :rfc:`2965`.

source: :rfc:`2964` - Use of HTTP State Management
pt_br: :rfc:`2964` - Використання керування станом HTTP

source: CookieJar and FileCookieJar Objects
pt_br: Об’єкти CookieJar і FileCookieJar

source: :class:`CookieJar` objects support the :term:`iterator` protocol for iterating over contained :class:`Cookie` objects.
pt_br: Об’єкти :class:`CookieJar` підтримують протокол :term:`iterator` для ітерації об’єктів :class:`Cookie`.

source: :class:`CookieJar` has the following methods:
pt_br: :class:`CookieJar` має такі методи:

source: Add correct :mailheader:`Cookie` header to *request*.
pt_br: Додайте правильний заголовок :mailheader:`Cookie` до *запиту*.

source: If policy allows (ie. the :attr:`rfc2965` and :attr:`hide_cookie2` attributes of the :class:`CookieJar`'s :class:`CookiePolicy` instance are true and false respectively), the :mailheader:`Cookie2` header is also added when appropriate.
pt_br: Якщо політика дозволяє (тобто атрибути :attr:`rfc2965` і :attr:`hide_cookie2` екземпляра :class:`CookieJar` :class:`CookiePolicy` мають значення true і false відповідно), :mailheader:`Заголовок Cookie2` також додається, коли це необхідно.

source: The *request* object (usually a :class:`urllib.request.Request` instance) must support the methods :meth:`get_full_url`, :meth:`has_header`, :meth:`get_header`, :meth:`header_items`, :meth:`add_unredirected_header` and the attributes :attr:`host`, :attr:`!type`, :attr:`unverifiable` and :attr:`origin_req_host` as documented by :mod:`urllib.request`.
pt_br: Объект *request* (обычно экземпляр :class:`urllib.request.Request`) должен поддерживать методы :meth:`get_full_url`, :meth:`has_header`, :meth:`get_header`, :meth:`header_items `, :meth:`add_unredirected_header` и атрибуты :attr:`host`, :attr:`!type`, :attr:`unverifying` и :attr:`origin_req_host`, как описано в :mod:`urllib.request` .

source: *request* object needs :attr:`origin_req_host` attribute. Dependency on a deprecated method :meth:`get_origin_req_host` has been removed.
pt_br: Об’єкту *request* потрібен атрибут :attr:`origin_req_host`. Залежність від застарілого методу :meth:`get_origin_req_host` видалено.

source: Extract cookies from HTTP *response* and store them in the :class:`CookieJar`, where allowed by policy.
pt_br: Отримайте файли cookie з *відповіді* HTTP та зберігайте їх у :class:`CookieJar`, де це дозволено політикою.

source: The :class:`CookieJar` will look for allowable :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers in the *response* argument, and store cookies as appropriate (subject to the :meth:`CookiePolicy.set_ok` method's approval).
pt_br: :class:`CookieJar` шукатиме допустимі заголовки :mailheader:`Set-Cookie` і :mailheader:`Set-Cookie2` в аргументі *response* і зберігатиме файли cookie відповідно (згідно з :meth:`CookiePolicy .set_ok` підтвердження методу).

source: The *response* object (usually the result of a call to :meth:`urllib.request.urlopen`, or similar) should support an :meth:`info` method, which returns an :class:`email.message.Message` instance.
pt_br: Об’єкт *response* (зазвичай це результат виклику :meth:`urllib.request.urlopen` або подібного) має підтримувати метод :meth:`info`, який повертає :class:`email.message.Message.` екземпляр.

source: The *request* object (usually a :class:`urllib.request.Request` instance) must support the method :meth:`get_full_url` and the attributes :attr:`host`, :attr:`unverifiable` and :attr:`origin_req_host`, as documented by :mod:`urllib.request`. The request is used to set default values for cookie-attributes as well as for checking that the cookie is allowed to be set.
pt_br: Объект *request* (обычно экземпляр :class:`urllib.request.Request`) должен поддерживать метод :meth:`get_full_url` и атрибуты :attr:`host`, :attr:`unverifying` и :attr: `origin_req_host`, как описано в :mod:`urllib.request`. Запрос используется для установки значений по умолчанию для атрибутов cookie, а также для проверки того, разрешена ли установка cookie.

source: Set the :class:`CookiePolicy` instance to be used.
pt_br: Встановіть екземпляр :class:`CookiePolicy` для використання.

source: Return sequence of :class:`Cookie` objects extracted from *response* object.
pt_br: Послідовність повернення об’єктів :class:`Cookie`, отриманих з об’єкта *response*.

source: See the documentation for :meth:`extract_cookies` for the interfaces required of the *response* and *request* arguments.
pt_br: Перегляньте документацію для :meth:`extract_cookies` для інтерфейсів, необхідних для аргументів *response* і *request*.

source: Set a :class:`Cookie` if policy says it's OK to do so.
pt_br: Встановіть :class:`Cookie`, якщо політика стверджує, що це допустимо.

source: Set a :class:`Cookie`, without checking with policy to see whether or not it should be set.
pt_br: Встановіть :class:`Cookie`, не перевіряючи політику, чи потрібно його встановлювати.

source: Clear some cookies.
pt_br: Очистити деякі файли cookie.

source: If invoked without arguments, clear all cookies. If given a single argument, only cookies belonging to that *domain* will be removed. If given two arguments, cookies belonging to the specified *domain* and URL *path* are removed. If given three arguments, then the cookie with the specified *domain*, *path* and *name* is removed.
pt_br: Якщо виклик викликаний без аргументів, видалити всі файли cookie. Якщо надати один аргумент, буде видалено лише файли cookie, що належать цьому *домену*. Якщо задано два аргументи, файли cookie, що належать до вказаного *домену* та *шляху* URL-адреси, видаляються. Якщо задано три аргументи, файл cookie з указаним *доменом*, *шляхом* і *ім’ям* видаляється.

source: Raises :exc:`KeyError` if no matching cookie exists.
pt_br: Викликає :exc:`KeyError`, якщо не існує відповідного файлу cookie.

source: Discard all session cookies.
pt_br: Descarta os cookies de sessão.

source: Discards all contained cookies that have a true :attr:`discard` attribute (usually because they had either no ``max-age`` or ``expires`` cookie-attribute, or an explicit ``discard`` cookie-attribute). For interactive browsers, the end of a session usually corresponds to closing the browser window.
pt_br: Відкидає всі файли cookie, які мають справжній атрибут :attr:`discard` (зазвичай тому, що вони не мали атрибута cookie ``max-age`` або ``expires``, або явного атрибута ``discard`` cookie-attribute ). Для інтерактивних браузерів кінець сеансу зазвичай відповідає закриттю вікна браузера.

source: Note that the :meth:`save` method won't save session cookies anyway, unless you ask otherwise by passing a true *ignore_discard* argument.
pt_br: Зауважте, що метод :meth:`save` все одно не зберігатиме файли cookie сеансу, якщо ви не запитаєте інше, передавши справжній аргумент *ignore_discard*.

source: :class:`FileCookieJar` implements the following additional methods:
pt_br: :class:`FileCookieJar` реалізує такі додаткові методи:

source: Save cookies to a file.
pt_br: Збережіть файли cookie у файл.

source: This base class raises :exc:`NotImplementedError`. Subclasses may leave this method unimplemented.
pt_br: Цей базовий клас викликає :exc:`NotImplementedError`. Підкласи можуть залишати цей метод нереалізованим.

source: *filename* is the name of file in which to save cookies. If *filename* is not specified, :attr:`self.filename` is used (whose default is the value passed to the constructor, if any); if :attr:`self.filename` is :const:`None`, :exc:`ValueError` is raised.
pt_br: *ім’я файлу* — це ім’я файлу, у якому зберігатимуться файли cookie. Якщо *filename* не вказано, :attr:`self.filename` використовується (яке за умовчанням є значенням, переданим конструктору, якщо такий є); якщо :attr:`self.filename` має значення :const:`None`, виникає :exc:`ValueError`.

source: *ignore_discard*: save even cookies set to be discarded. *ignore_expires*: save even cookies that have expired
pt_br: *ignore_discard*: зберегти навіть файли cookie, налаштовані на видалення. *ignore_expires*: зберігати навіть файли cookie, термін дії яких закінчився

source: The file is overwritten if it already exists, thus wiping all the cookies it contains. Saved cookies can be restored later using the :meth:`load` or :meth:`revert` methods.
pt_br: Файл перезаписується, якщо він уже існує, таким чином знищуючи всі файли cookie, які він містить. Збережені файли cookie можна відновити пізніше за допомогою методів :meth:`load` або :meth:`revert`.

source: Load cookies from a file.
pt_br: Завантажити файли cookie з файлу.

source: Old cookies are kept unless overwritten by newly loaded ones.
pt_br: Старі файли cookie зберігаються, якщо вони не перезаписані новозавантаженими.

source: Arguments are as for :meth:`save`.
pt_br: Аргументи такі ж, як для :meth:`save`.

source: The named file must be in the format understood by the class, or :exc:`LoadError` will be raised. Also, :exc:`OSError` may be raised, for example if the file does not exist.
pt_br: Названий файл має бути у форматі, зрозумілому класу, інакше виникне :exc:`LoadError`. Крім того, може виникати :exc:`OSError`, наприклад, якщо файл не існує.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
pt_br: :exc:`IOError` costumava ser levantada, agora ela é um apelido para :exc:`OSError`.

source: Clear all cookies and reload cookies from a saved file.
pt_br: Очистіть усі файли cookie та перезавантажте файли cookie зі збереженого файлу.

source: :meth:`revert` can raise the same exceptions as :meth:`load`. If there is a failure, the object's state will not be altered.
pt_br: :meth:`revert` може викликати ті самі винятки, що і :meth:`load`. Якщо станеться збій, стан об’єкта не зміниться.

source: :class:`FileCookieJar` instances have the following public attributes:
pt_br: Екземпляри :class:`FileCookieJar` мають такі публічні атрибути:

source: Filename of default file in which to keep cookies. This attribute may be assigned to.
pt_br: Назва файлу за замовчуванням, у якому зберігатимуться файли cookie. Цей атрибут можна призначити.

source: If true, load cookies lazily from disk. This attribute should not be assigned to. This is only a hint, since this only affects performance, not behaviour (unless the cookies on disk are changing). A :class:`CookieJar` object may ignore it. None of the :class:`FileCookieJar` classes included in the standard library lazily loads cookies.
pt_br: Якщо істина, ліниво завантажувати файли cookie з диска. Цей атрибут не слід призначати. Це лише підказка, оскільки це впливає лише на продуктивність, а не на поведінку (якщо файли cookie на диску не змінюються). Об’єкт :class:`CookieJar` може його ігнорувати. Жоден із класів :class:`FileCookieJar`, включених до стандартної бібліотеки, не завантажує файли cookie ліниво.

source: FileCookieJar subclasses and co-operation with web browsers
pt_br: Підкласи FileCookieJar і співпраця з веб-браузерами

source: The following :class:`CookieJar` subclasses are provided for reading and writing.
pt_br: Наступні підкласи :class:`CookieJar` надаються для читання та запису.

source: A :class:`FileCookieJar` that can load from and save cookies to disk in the Mozilla ``cookies.txt`` file format (which is also used by curl and the Lynx and Netscape browsers).
pt_br: :class:`FileCookieJar`, который может загружать и сохранять файлы cookie на диск в формате файла Mozilla ``cookies.txt`` (который также используется в браузерах Curl и Lynx и Netscape).

source: This loses information about :rfc:`2965` cookies, and also about newer or non-standard cookie-attributes such as ``port``.
pt_br: Це втрачає інформацію про :rfc:`2965` файли cookie, а також про нові або нестандартні атрибути файлів cookie, такі як ``порт``.

source: Back up your cookies before saving if you have cookies whose loss / corruption would be inconvenient (there are some subtleties which may lead to slight changes in the file over a load / save round-trip).
pt_br: Зробіть резервну копію файлів cookie перед збереженням, якщо у вас є файли cookie, втрата/пошкодження яких було б незручним (є деякі тонкощі, які можуть призвести до незначних змін у файлі під час завантаження/збереження в обидві сторони).

source: Also note that cookies saved while Mozilla is running will get clobbered by Mozilla.
pt_br: Також зауважте, що файли cookie, збережені під час роботи Mozilla, будуть видалені Mozilla.

source: A :class:`FileCookieJar` that can load from and save cookies to disk in format compatible with the libwww-perl library's ``Set-Cookie3`` file format. This is convenient if you want to store cookies in a human-readable file.
pt_br: :class:`FileCookieJar`, який може завантажувати та зберігати файли cookie на диск у форматі, сумісному з форматом файлу ``Set-Cookie3`` бібліотеки libwww-perl. Це зручно, якщо ви хочете зберігати файли cookie у файлі, який читає людина.

source: CookiePolicy Objects
pt_br: Objeto CookiePolicy

source: Objects implementing the :class:`CookiePolicy` interface have the following methods:
pt_br: Об’єкти, що реалізують інтерфейс :class:`CookiePolicy`, мають такі методи:
