Repository: python/python-docs-pt-br
Catalog: library/imaplib.po
Languages: pt_br

source: Select a mailbox. Returned data is the count of messages in *mailbox* (``EXISTS`` response). The default *mailbox* is ``'INBOX'``. If the *readonly* flag is set, modifications to the mailbox are not allowed.
pt_br: Виберіть поштову скриньку. Повернені дані – це кількість повідомлень у *поштовій скриньці* (відповідь "ІСНУЄ"). Типовою *поштовою скринькою* є ``'INBOX'``. Якщо встановлено прапорець *readonly*, зміни поштової скриньки заборонені.

source: Sends ``data`` to the remote server. You may override this method.
pt_br: Надсилає ``дані`` на віддалений сервер. Ви можете змінити цей метод.

source: Raises an :ref:`auditing event <auditing>` ``imaplib.send`` with arguments ``self``, ``data``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``imaplib.send`` com os argumentos ``self``, ``data``.

source: Set an ``ACL`` for *mailbox*. The method is non-standard, but is supported by the ``Cyrus`` server.
pt_br: Установіть ``ACL`` для *поштової скриньки*. Метод нестандартний, але підтримується сервером ``Cyrus``.

source: Set ``ANNOTATION``\ s for *mailbox*. The method is non-standard, but is supported by the ``Cyrus`` server.
pt_br: Установіть ``АННОТАЦІЮ`` для *поштової скриньки*. Метод нестандартний, але підтримується сервером ``Cyrus``.

source: Set the ``quota`` *root*'s resource *limits*. This method is part of the IMAP4 QUOTA extension defined in rfc2087.
pt_br: Встановіть *ліміти* ресурсів ``квоти`` *root*. Цей метод є частиною розширення IMAP4 QUOTA, визначеного в rfc2087.

source: Close connection established in ``open``. This method is implicitly called by :meth:`IMAP4.logout`. You may override this method.
pt_br: Закрити з’єднання встановлено в ``відкритому``. Цей метод неявно викликається :meth:`IMAP4.logout`. Ви можете змінити цей метод.

source: Returns socket instance used to connect to server.
pt_br: Повертає екземпляр сокета, який використовується для підключення до сервера.

source: The ``sort`` command is a variant of ``search`` with sorting semantics for the results. Returned data contains a space separated list of matching message numbers.
pt_br: Команда ``sort`` є варіантом ``search`` із семантикою сортування для результатів. Повернуті дані містять розділений пробілами список відповідних номерів повідомлень.

source: Sort has two arguments before the *search_criterion* argument(s); a parenthesized list of *sort_criteria*, and the searching *charset*. Note that unlike ``search``, the searching *charset* argument is mandatory. There is also a ``uid sort`` command which corresponds to ``sort`` the way that ``uid search`` corresponds to ``search``. The ``sort`` command first searches the mailbox for messages that match the given searching criteria using the charset argument for the interpretation of strings in the searching criteria. It then returns the numbers of matching messages.
pt_br: Сортування має два аргументи перед аргументом(ами) *критерій_пошуку*; список *критеріїв_сортування* в дужках і пошуковий *набір символів*. Зауважте, що на відміну від ``search``, пошуковий аргумент *charset* є обов’язковим. Існує також команда ``uid sort``, яка відповідає ``sort`` так, як ``uid search`` відповідає ``search``. Команда ``sort`` спочатку шукає в поштовій скриньці повідомлення, які відповідають заданим критеріям пошуку, використовуючи аргумент набору символів для інтерпретації рядків у критеріях пошуку. Потім він повертає номери відповідних повідомлень.

source: This is an ``IMAP4rev1`` extension command.
pt_br: Це команда розширення ``IMAP4rev1``.

source: Send a ``STARTTLS`` command. The *ssl_context* argument is optional and should be a :class:`ssl.SSLContext` object. This will enable encryption on the IMAP connection. Please read :ref:`ssl-security` for best practices.
pt_br: Надішліть команду ``STARTTLS``. Аргумент *ssl_context* є необов’язковим і має бути об’єктом :class:`ssl.SSLContext`. Це дозволить шифрувати підключення IMAP. Будь ласка, прочитайте :ref:`ssl-security`, щоб дізнатися про найкращі практики.

source: The method now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
pt_br: Этот метод теперь поддерживает проверку имени хоста с помощью :attr:`ssl.SSLContext.check_hostname` и *Индикации имени сервера* (см. :const:`ssl.HAS_SNI`).

source: Request named status conditions for *mailbox*.
pt_br: Запит умов іменованого статусу для *поштової скриньки*.

source: Alters flag dispositions for messages in mailbox. *command* is specified by section 6.4.6 of :rfc:`2060` as being one of "FLAGS", "+FLAGS", or "-FLAGS", optionally with a suffix of ".SILENT".
pt_br: Змінює розміщення прапорців для повідомлень у поштовій скриньці. *команда* визначена розділом 6.4.6 :rfc:`2060` як одна з "FLAGS", "+FLAGS" або "-FLAGS", необов’язково з суфіксом ".SILENT".

source: For example, to set the delete flag on all messages::
pt_br: Наприклад, щоб встановити позначку видалення для всіх повідомлень:

source: Subscribe to new mailbox.
pt_br: Підписатися на нову скриньку.

source: The ``thread`` command is a variant of ``search`` with threading semantics for the results. Returned data contains a space separated list of thread members.
pt_br: Команда ``thread`` є варіантом ``search`` із семантикою потоків для результатів. Повернуті дані містять розділений пробілами список учасників потоку.

source: Thread members consist of zero or more messages numbers, delimited by spaces, indicating successive parent and child.
pt_br: Члени ланцюжка складаються з нуля або більше номерів повідомлень, розділених пробілами, що вказує на послідовне батьківське та дочірнє повідомлення.

source: Thread has two arguments before the *search_criterion* argument(s); a *threading_algorithm*, and the searching *charset*. Note that unlike ``search``, the searching *charset* argument is mandatory. There is also a ``uid thread`` command which corresponds to ``thread`` the way that ``uid search`` corresponds to ``search``. The ``thread`` command first searches the mailbox for messages that match the given searching criteria using the *charset* argument for the interpretation of strings in the searching criteria. It then returns the matching messages threaded according to the specified threading algorithm.
pt_br: У потока есть два аргумента перед аргументом(ами) *search_criterion*; *threading_algorithm* и *charset* поиска. Обратите внимание, что в отличие от ``search`` аргумент поиска *charset* является обязательным. Существует также команда ``uid thread``, которая соответствует ``thread`` так же, как ``uid search`` соответствует``search``. Команда ``thread`` сначала ищет в почтовом ящике сообщения, соответствующие заданным критериям поиска, используя аргумент *charset* для интерпретации строк в критериях поиска. Затем он возвращает соответствующие сообщения, объединенные в потоки в соответствии с указанным алгоритмом потоков.

source: Execute command args with messages identified by UID, rather than message number. Returns response appropriate to command. At least one argument must be supplied; if none are provided, the server will return an error and an exception will be raised.
pt_br: Виконайте аргументи команди з повідомленнями, ідентифікованими UID, а не номером повідомлення. Повертає відповідь, що відповідає команді. Необхідно надати принаймні один аргумент; якщо їх не надано, сервер поверне повідомлення про помилку та виникне виняток.

source: Unsubscribe from old mailbox.
pt_br: Відписатися від старої поштової скриньки.

source: :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox.
pt_br: :meth:`imaplib.IMAP4.unselect` звільняє ресурси сервера, пов’язані з вибраною поштовою скринькою, і повертає сервер до автентифікованого стану. Ця команда виконує ті самі дії, що й :meth:`imaplib.IMAP4.close`, за винятком того, що повідомлення не видаляються назавжди з поточної вибраної поштової скриньки.

source: Allow simple extension commands notified by server in ``CAPABILITY`` response.
pt_br: Дозволити прості команди розширення, сповіщені сервером у відповіді ``CAPABILITY``.

source: The following attributes are defined on instances of :class:`IMAP4`:
pt_br: Наступні атрибути визначені для екземплярів :class:`IMAP4`:

source: The most recent supported protocol in the ``CAPABILITY`` response from the server.
pt_br: Останній підтримуваний протокол у відповіді ``CAPABILITY`` від сервера.

source: Integer value to control debugging output. The initialize value is taken from the module variable ``Debug``. Values greater than three trace each command.
pt_br: Ціле значення для керування виведенням налагодження. Значення ініціалізації береться зі змінної модуля ``Debug``. Значення більше трьох відстежують кожну команду.

source: Boolean value that is normally ``False``, but is set to ``True`` if an :meth:`enable` command is successfully issued for the ``UTF8=ACCEPT`` capability.
pt_br: Логічне значення, яке зазвичай має значення ``False``, але встановлюється на ``True``, якщо команда :meth:`enable` успішно виконана для можливості ``UTF8=ACCEPT``.

source: IMAP4 Example
pt_br: Exemplo IMAP4

source: Here is a minimal example (without error checking) that opens a mailbox and retrieves and prints all messages::
pt_br: Ось мінімальний приклад (без перевірки помилок), який відкриває поштову скриньку, отримує та друкує всі повідомлення:

source: protocol
pt_br: protocolo
