Repository: python/python-docs-pt-br
Catalog: library/importlib.resources.po
Languages: pt_br

source: :mod:`!importlib.resources` -- Package resource reading, opening and access
pt_br: :mod:`!importlib.resources` -- Leitura, abertura e acesso a recursos de pacotes

source: **Source code:** :source:`Lib/importlib/resources/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/importlib/resources/__init__.py`

source: This module leverages Python's import system to provide access to *resources* within *packages*.
pt_br: Esse módulo aproveita o sistema de importação do Python para fornecer acesso a *recursos* dentro de *pacotes*.

source: "Resources" are file-like resources associated with a module or package in Python. The resources may be contained directly in a package, within a subdirectory contained in that package, or adjacent to modules outside a package. Resources may be text or binary. As a result, a package's Python module sources (.py), compilation artifacts (pycache), and installation artifacts (like :func:`reserved filenames <os.path.isreserved>` in directories) are technically de-facto resources of that package. In practice, however, resources are primarily those non-Python artifacts exposed specifically by the package author.
pt_br: "Recursos" são recursos arquivo ou similares associados a um módulo ou pacote em Python. Os recursos podem estar contidos diretamente em um pacote, em um subdiretório contido nesse pacote ou adjacentes a módulos fora de um pacote. Os recursos podem ser de texto ou binários. Como resultado, as fontes de módulos Python de um pacote (.py), artefatos de compilação (pycache) e artefatos de instalação (como :func:`nomes de arquivos reservados <os.path.isreserved>` em diretórios) são tecnicamente recursos de fato desse pacote. Na prática, entretanto, os recursos são principalmente os artefatos não-Python expostos especificamente pelo autor do pacote.

source: Resources can be opened or read in either binary or text mode.
pt_br: Os recursos podem ser abertos ou lidos no modo binário ou de texto.

source: Resources are roughly akin to files inside directories, though it's important to keep in mind that this is just a metaphor. Resources and packages **do not** have to exist as physical files and directories on the file system: for example, a package and its resources can be imported from a zip file using :py:mod:`zipimport`.
pt_br: Os recursos são mais ou menos semelhantes a arquivos dentro de diretórios, embora seja importante ter em mente que isso é apenas uma metáfora. Recursos e pacotes **não** precisam existir como arquivos e diretórios físicos no sistema de arquivos: por exemplo, um pacote e seus recursos podem ser importados de um arquivo zip usando :py:mod:`zipimport`.

source: This module provides functionality similar to `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_ without the performance overhead of that package. This makes reading resources included in packages easier, with more stable and consistent semantics.
pt_br: Esse módulo fornece funcionalidade semelhante ao `Basic Resource Access <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_ do `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ sem a sobrecarga de desempenho desse pacote. Isso facilita a leitura de recursos incluídos em pacotes, com uma semântica mais estável e consistente.

source: The standalone backport of this module provides more information on `using importlib.resources <https://importlib-resources.readthedocs.io/en/latest/using.html>`_ and `migrating from pkg_resources to importlib.resources <https://importlib-resources.readthedocs.io/en/latest/migration.html>`_.
pt_br: O backport autônomo desse módulo fornece mais informações sobre `uso do importlib.resources <https://importlib-resources.readthedocs.io/en/latest/using.html>`_ e `migração do pkg_resources para o importlib.resources <https://importlib-resources.readthedocs.io/en/latest/migration.html>`_.

source: :class:`Loaders <importlib.abc.Loader>` that wish to support resource reading should implement a ``get_resource_reader(fullname)`` method as specified by :class:`importlib.resources.abc.ResourceReader`.
pt_br: :class:`Loaders <importlib.abc.Loader>` que desejam oferecer suporte à leitura de recursos devem implementar um método ``get_resource_reader(fullname)`` conforme especificado por :class:`importlib.resources.abc.ResourceReader`.

source: Represents an anchor for resources, either a :class:`module object <types.ModuleType>` or a module name as a string. Defined as ``Union[str, ModuleType]``.
pt_br: Representa uma âncora para recursos, seja um :class:`objeto módulo <types.ModuleType>` ou um nome de módulo como uma string. Definido como ``Union[str, ModuleType]``.

source: Returns a :class:`~importlib.resources.abc.Traversable` object representing the resource container (think directory) and its resources (think files). A Traversable may contain other containers (think subdirectories).
pt_br: Retorna um objeto :class:`~importlib.resources.abc.Traversable` que representa o contêiner de recursos (pense em diretório) e seus recursos (pense em arquivos). Um Traversable pode conter outros contêineres (pense em subdiretórios).

source: *anchor* is an optional :class:`Anchor`. If the anchor is a package, resources are resolved from that package. If a module, resources are resolved adjacent to that module (in the same package or the package root). If the anchor is omitted, the caller's module is used.
pt_br: *anchor* é um :class:`Anchor` opcional. Se a âncora for um pacote, os recursos são resolvidos a partir desse pacote. Se for um módulo, os recursos são resolvidos ao lado desse módulo (no mesmo pacote ou na raiz do pacote). Se a âncora for omitida, o módulo do chamador é usado.

source: *package* parameter was renamed to *anchor*. *anchor* can now be a non-package module and if omitted will default to the caller's module. *package* is still accepted for compatibility but will raise a :exc:`DeprecationWarning`. Consider passing the anchor positionally or using ``importlib_resources >= 5.10`` for a compatible interface on older Pythons.
pt_br: O parâmetro *package* foi renomeado para *anchor*. *anchor* agora pode ser um módulo sem ser pacote e, se omitido, será o módulo do chamador por padrão. *package* ainda é aceito por compatibilidade, mas irá levantar um :exc:`DeprecationWarning`. Considere passar a posição da âncora de forma posicional ou usar ``importlib_resources >= 5.10`` para uma interface compatível em versões mais antigas do Python.

source: Given a :class:`~importlib.resources.abc.Traversable` object representing a file or directory, typically from :func:`importlib.resources.files`, return a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
pt_br: Dado um objeto :class:`~importlib.resources.abc.Traversable` que representa um arquivo ou diretório, normalmente de :func:`importlib.resources.files`, retorna um gerenciador de contexto para uso em uma instrução :keyword:`with`. O gerenciador de contexto fornece um objeto :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file or directory created when the resource was extracted from e.g. a zip file.
pt_br: Sair do gerenciador de contexto limpa qualquer arquivo ou diretório temporário criado quando o recurso foi extraído, por exemplo, de um arquivo zip.

source: Use ``as_file`` when the Traversable methods (``read_text``, etc) are insufficient and an actual file or directory on the file system is required.
pt_br: Use ``as_file`` quando os métodos de Traversable (``read_text``, etc.) forem insuficientes e for necessário um arquivo ou diretório real no sistema de arquivos.

source: Added support for *traversable* representing a directory.
pt_br: Adicionado suporte para *traversable* representando um diretório.

source: Functional API
pt_br: API funcional

source: A set of simplified, backwards-compatible helpers is available. These allow common operations in a single function call.
pt_br: Um conjunto de auxiliares simplificados e compatíveis com versões anteriores está disponível. Estes permitem operações comuns em uma única chamada de função.

source: For all the following functions:
pt_br: Para todas as funções a seguir:

source: *anchor* is an :class:`~importlib.resources.Anchor`, as in :func:`~importlib.resources.files`. Unlike in ``files``, it may not be omitted.
pt_br: *anchor* é um :class:`~importlib.resources.Anchor`, assim como em :func:`~importlib.resources.files`. Ao contrário do comportamento em ``files``, *anchor* aqui não pode ser omitido.

source: *path_names* are components of a resource's path name, relative to the anchor. For example, to get the text of resource named ``info.txt``, use::
pt_br: *path_names* são componentes do nome do caminho de um recurso, relativo à âncora. Por exemplo, para obter o texto de um recurso chamado ``info.txt``, use::

source: Like :meth:`Traversable.joinpath <importlib.resources.abc.Traversable>`, The individual components should use forward slashes (``/``) as path separators. For example, the following are equivalent::
pt_br: Assim como em :meth:`Traversable.joinpath <importlib.resources.abc.Traversable>`, os componentes individuais devem usar barras ordinárias (``/``) como separadores do caminho. Por exemplo, as seguintes chamadas são equivalentes::

source: For backward compatibility reasons, functions that read text require an explicit *encoding* argument if multiple *path_names* are given. For example, to get the text of ``info/chapter1.txt``, use::
pt_br: Por motivos de compatibilidade com versões anteriores, funções que leem texto requerem um argumento *encoding* explícito se múltiplos *path_names* forem fornecidos. Por exemplo, para obter o texto de ``info/chapter1.txt``, use::

source: Open the named resource for binary reading.
pt_br: Abre o recurso nomeado para leitura binária.

source: See :ref:`the introduction <importlib_resources_functional>` for details on *anchor* and *path_names*.
pt_br: Veja :ref:`a introdução <importlib_resources_functional>` para detalhes sobre *anchor* e *path_names*.

source: This function returns a :class:`~typing.BinaryIO` object, that is, a binary stream open for reading.
pt_br: Esta função retorna um objeto :class:`~typing.BinaryIO`, isto é, um fluxo binário aberto para leitura.

source: This function is roughly equivalent to::
pt_br: Esta função é mais ou menos equivalente a::

source: Multiple *path_names* are accepted.
pt_br: Múltiplos *path_names* são aceitos.

source: Open the named resource for text reading. By default, the contents are read as strict UTF-8.
pt_br: Abre o recurso nomeado para leitura de texto. Por padrão, o conteúdo é lido como UTF-8 estrito.

source: See :ref:`the introduction <importlib_resources_functional>` for details on *anchor* and *path_names*. *encoding* and *errors* have the same meaning as in built-in :func:`open`.
pt_br: Veja :ref:`a introdução <importlib_resources_functional>` para detalhes sobre *anchor* e *path_names*. *encoding* e *errors* têm o mesmo significado que na embutida :func:`open`.

source: For backward compatibility reasons, the *encoding* argument must be given explicitly if there are multiple *path_names*. This limitation is scheduled to be removed in Python 3.15.
pt_br: Por motivos de compatibilidade com versões anteriores, o argumento *encoding* precisa ser passado explicitamente se houver múltiplos *path_names*. Essa limitação está agendada para ser removida no Python 3.15.

source: This function returns a :class:`~typing.TextIO` object, that is, a text stream open for reading.
pt_br: Esta função retorna um objeto :class:`~typing.TextIO`, isto é, um fluxo de texto aberto para leitura.

source: Multiple *path_names* are accepted. *encoding* and *errors* must be given as keyword arguments.
pt_br: Múltiplos *path_names* são aceitos. *encoding* e *errors* precisam ser fornecidos como argumentos nomeados.

source: Read and return the contents of the named resource as :class:`bytes`.
pt_br: Lê e retorna o conteúdo do recurso nomeado como :class:`bytes`.

source: Read and return the contents of the named resource as :class:`str`. By default, the contents are read as strict UTF-8.
pt_br: Lê e retorna o conteúdo do recurso nomeado como :class:`str`. Por padrão, o conteúdo é lido como UTF-8 estrito.

source: Provides the path to the *resource* as an actual file system path. This function returns a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
pt_br: Fornece o caminho para o *resource* como um caminho real do sistema de arquivos. Essa função retorna um gerenciador de contexto para uso em uma instrução :keyword:`with`. O gerenciador de contexto fornece um objeto :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary files created, e.g. when the resource needs to be extracted from a zip file.
pt_br: Sair do gerenciador de contexto limpa qualquer arquivo temporário criado, por exemplo quando o recurso precisa ser extraído de um arquivo zip.

source: For example, the :meth:`~pathlib.Path.stat` method requires an actual file system path; it can be used like this::
pt_br: Por exemplo, o método :meth:`~pathlib.Path.stat` requer um caminho real em um sistema de arquivos; ele pode ser usado assim::

source: Return ``True`` if the named resource exists, otherwise ``False``. This function does not consider directories to be resources.
pt_br: Retorna ``True`` se o recurso nomeado existe, senão ``False``. Esta função não considera diretórios como sendo recursos.

source: Return an iterable over the named items within the package or path. The iterable returns names of resources (e.g. files) and non-resources (e.g. directories) as :class:`str`. The iterable does not recurse into subdirectories.
pt_br: Retorna um iterável sobre os itens nomeados no pacote ou caminho. O iterável retorna nomes de recursos (por exemplo, arquivos) e outros itens que não recursos (por exemplo, diretórios) como :class:`str`. O iterável não recorre em subdiretórios.

source: Prefer ``iterdir()`` as above, which offers more control over the results and richer functionality.
pt_br: Prefira ``iterdir()`` como acima, que oferece mais controle sobre os resultados e funcionalidade mais rica.
