Repository: python/python-docs-pt-br
Catalog: library/importlib.po
Languages: pt_br

source: Returns a combined list of strings representing all file suffixes for modules recognized by the standard import machinery. This is a helper for code which simply needs to know if a filesystem path potentially refers to a module without needing any details on the kind of module (for example, :func:`inspect.getmodulename`).
pt_br: Retorna uma lista combinada de strings representando todos os sufixos de arquivo para módulos reconhecidos pelo maquinário de importação padrão. Este é um auxiliar para código que simplesmente precisa saber se um caminho de sistema de arquivos potencialmente se refere a um módulo sem precisar de detalhes sobre o tipo de módulo (por exemplo, :func:`inspect.getmodulename`).

source: An :term:`importer` for built-in modules. All known built-in modules are listed in :data:`sys.builtin_module_names`. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
pt_br: Um :term:`importador` para módulos embutidos. Todos os módulos embutidos conhecidos estão listados em :data:`sys.builtin_module_names`. Esta classe implementa os ABCs :class:`importlib.abc.MetaPathFinder` e :class:`importlib.abc.InspectLoader`.

source: Only class methods are defined by this class to alleviate the need for instantiation.
pt_br: Somente métodos de classe são definidos por esta classe para aliviar a necessidade de instanciação.

source: As part of :pep:`489`, the builtin importer now implements :meth:`Loader.create_module` and :meth:`Loader.exec_module`
pt_br: Como parte da :pep:`489`, o importador embutido agora implementa :meth:`Loader.create_module` e :meth:`Loader.exec_module`

source: An :term:`importer` for frozen modules. This class implements the :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.InspectLoader` ABCs.
pt_br: Um :term:`importador` para módulos congelados. Esta classe implementa os ABCs :class:`importlib.abc.MetaPathFinder` e :class:`importlib.abc.InspectLoader`.

source: Gained :meth:`~Loader.create_module` and :meth:`~Loader.exec_module` methods.
pt_br: Ganhou os métodos :meth:`~Loader.create_module` e :meth:`~Loader.exec_module`.

source: :term:`Finder <finder>` for modules declared in the Windows registry. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
pt_br: :term:`Localizador <finder>` para módulos declarados no registro do Windows. Esta classe implementa a ABC :class:`importlib.abc.MetaPathFinder`.

source: Use :mod:`site` configuration instead. Future versions of Python may not enable this finder by default.
pt_br: Use a configuração de :mod:`site` em vez disso. Versões futuras do Python podem não habilitar esse localizador por padrão.

source: A :term:`Finder <finder>` for :data:`sys.path` and package ``__path__`` attributes. This class implements the :class:`importlib.abc.MetaPathFinder` ABC.
pt_br: Um :term:`Localizador <finder>` para atributos :data:`sys.path` e pacote ``__path__``. Esta classe implementa a ABC :class:`importlib.abc.MetaPathFinder`.

source: Class method that attempts to find a :term:`spec <module spec>` for the module specified by *fullname* on :data:`sys.path` or, if defined, on *path*. For each path entry that is searched, :data:`sys.path_importer_cache` is checked. If a non-false object is found then it is used as the :term:`path entry finder` to look for the module being searched for. If no entry is found in :data:`sys.path_importer_cache`, then :data:`sys.path_hooks` is searched for a finder for the path entry and, if found, is stored in :data:`sys.path_importer_cache` along with being queried about the module. If no finder is ever found then ``None`` is both stored in the cache and returned.
pt_br: Método de classe que tenta encontrar um :term:`spec <module spec>` para o módulo especificado por *fullname* em :data:`sys.path` ou, se definido, em *path*. Para cada entrada de caminho pesquisada, :data:`sys.path_importer_cache` é verificado. Se um objeto não falso for encontrado, ele será usado como o :term:`localizador de entrada de caminho` para procurar o módulo que está sendo pesquisado. Se nenhuma entrada for encontrada em :data:`sys.path_importer_cache`, então :data:`sys.path_hooks` será pesquisado para um localizador para a entrada de caminho e, se encontrado, será armazenado em :data:`sys.path_importer_cache` junto com a consulta sobre o módulo. Se nenhum localizador for encontrado, então ``None`` será armazenado no cache e retornado.

source: If the current working directory -- represented by an empty string -- is no longer valid then ``None`` is returned but no value is cached in :data:`sys.path_importer_cache`.
pt_br: Se o diretório de trabalho atual — representado por uma string vazia — não for mais válido, ``None`` será retornado, mas nenhum valor será armazenado em cache em :data:`sys.path_importer_cache`.

source: Calls :meth:`importlib.abc.PathEntryFinder.invalidate_caches` on all finders stored in :data:`sys.path_importer_cache` that define the method. Otherwise entries in :data:`sys.path_importer_cache` set to ``None`` are deleted.
pt_br: Chama :meth:`importlib.abc.PathEntryFinder.invalidate_caches` em todos os localizadores armazenados em :data:`sys.path_importer_cache` que definem o método. Caso contrário, as entradas em :data:`sys.path_importer_cache` definidas como ``None`` são excluídas.

source: Entries of ``None`` in :data:`sys.path_importer_cache` are deleted.
pt_br: Entradas de ``None`` em :data:`sys.path_importer_cache` são excluídas.

source: Calls objects in :data:`sys.path_hooks` with the current working directory for ``''`` (i.e. the empty string).
pt_br: Chama objetos em :data:`sys.path_hooks` com o diretório de trabalho atual para ``''`` (ou seja, a string vazia).

source: A concrete implementation of :class:`importlib.abc.PathEntryFinder` which caches results from the file system.
pt_br: Uma implementação concreta de :class:`importlib.abc.PathEntryFinder` que armazena em cache os resultados do sistema de arquivos.

source: The *path* argument is the directory for which the finder is in charge of searching.
pt_br: O argumento *path* é o diretório que o localizador é responsável por pesquisar.

source: The *loader_details* argument is a variable number of 2-item tuples each containing a loader and a sequence of file suffixes the loader recognizes. The loaders are expected to be callables which accept two arguments of the module's name and the path to the file found.
pt_br: O argumento *loader_details* é um número variável de tuplas de 2 itens, cada uma contendo um carregador e uma sequência de sufixos de arquivo que o carregador reconhece. Espera-se que os carregadores sejam chamáveis que aceitam dois argumentos do nome do módulo e o caminho para o arquivo encontrado.

source: The finder will cache the directory contents as necessary, making stat calls for each module search to verify the cache is not outdated. Because cache staleness relies upon the granularity of the operating system's state information of the file system, there is a potential race condition of searching for a module, creating a new file, and then searching for the module the new file represents. If the operations happen fast enough to fit within the granularity of stat calls, then the module search will fail. To prevent this from happening, when you create a module dynamically, make sure to call :func:`importlib.invalidate_caches`.
pt_br: O localizador armazenará em cache o conteúdo do diretório conforme necessário, fazendo chamadas de "stat" para cada pesquisa de módulo para verificar se o cache não está desatualizado. Como a obsolescência do cache depende da granularidade das informações de estado do sistema operacional do sistema de arquivos, há uma condição de corrida potencial de busca por um módulo, criação de um novo arquivo e, em seguida, busca pelo módulo que o novo arquivo representa. Se as operações ocorrerem rápido o suficiente para caber na granularidade das chamadas de "stat", a pesquisa do módulo falhará. Para evitar que isso aconteça, ao criar um módulo dinamicamente, certifique-se de chamar :func:`importlib.invalidate_caches`.

source: The path the finder will search in.
pt_br: O caminho que o localizador irá procurar.

source: Attempt to find the spec to handle *fullname* within :attr:`path`.
pt_br: Tenta encontrar o spec para manipular *fullname* dentro de :attr:`path`.

source: Clear out the internal cache.
pt_br: Limpa o cache interno.

source: A class method which returns a closure for use on :data:`sys.path_hooks`. An instance of :class:`FileFinder` is returned by the closure using the path argument given to the closure directly and *loader_details* indirectly.
pt_br: Um método de classe que retorna uma clausura para uso em :data:`sys.path_hooks`. Uma instância de :class:`FileFinder` é retornada pela clausura usando o argumento de caminho dado à clausura diretamente e *loader_details* indiretamente.

source: If the argument to the closure is not an existing directory, :exc:`ImportError` is raised.
pt_br: Se o argumento para a clausura não for um diretório existente, :exc:`ImportError` será levantada.

source: A concrete implementation of :class:`importlib.abc.SourceLoader` by subclassing :class:`importlib.abc.FileLoader` and providing some concrete implementations of other methods.
pt_br: Uma implementação concreta de :class:`importlib.abc.SourceLoader` subclassificando :class:`importlib.abc.FileLoader` e fornecendo algumas implementações concretas de outros métodos.

source: The name of the module that this loader will handle.
pt_br: O nome do módulo que este carregador irá manipular.

source: The path to the source file.
pt_br: O caminho para o arquivo fonte.

source: Return ``True`` if :attr:`path` appears to be for a package.
pt_br: Retorna ``True`` se :attr:`path` parecer ser para um pacote.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.path_stats`.
pt_br: Implementação concreta de :meth:`importlib.abc.SourceLoader.path_stats`.

source: Concrete implementation of :meth:`importlib.abc.SourceLoader.set_data`.
pt_br: Implementação concreta de :meth:`importlib.abc.SourceLoader.set_data`.

source: Concrete implementation of :meth:`importlib.abc.Loader.load_module` where specifying the name of the module to load is optional.
pt_br: Implementação concreta de :meth:`importlib.abc.Loader.load_module` onde a especificação do nome do módulo para carregar é opcional

source: Use :meth:`importlib.abc.Loader.exec_module` instead.
pt_br: Use :meth:`importlib.abc.Loader.exec_module`.

source: A concrete implementation of :class:`importlib.abc.FileLoader` which can import bytecode files (i.e. no source code files exist).
pt_br: Uma implementação concreta de :class:`importlib.abc.FileLoader` que pode importar arquivos de bytecode (ou seja, não existem arquivos de código-fonte).

source: Please note that direct use of bytecode files (and thus not source code files) inhibits your modules from being usable by all Python implementations or new versions of Python which change the bytecode format.
pt_br: Observe que o uso direto de arquivos de bytecode (e, portanto, não de arquivos de código-fonte) impede que seus módulos sejam utilizáveis por todas as implementações do Python ou novas versões do Python que alteram o formato do bytecode.

source: The name of the module the loader will handle.
pt_br: O nome do módulo que o carregador vai manipular.

source: The path to the bytecode file.
pt_br: O caminho para o arquivo de bytecode.

source: Determines if the module is a package based on :attr:`path`.
pt_br: Determina se o módulo é um pacote baseado em :attr:`path`.

source: Returns the code object for :attr:`name` created from :attr:`path`.
pt_br: Retorna o objeto código para :attr:`name` criado a partir de :attr:`path`.

source: Returns ``None`` as bytecode files have no source when this loader is used.
pt_br: Retorna ``None``, pois os arquivos de bytecode não têm código-fonte quando este carregador é usado.

source: A concrete implementation of :class:`importlib.abc.ExecutionLoader` for extension modules.
pt_br: Uma implementação concreta de :class:`importlib.abc.ExecutionLoader` para módulos de extensão.

source: The *fullname* argument specifies the name of the module the loader is to support. The *path* argument is the path to the extension module's file.
pt_br: O argumento *fullname* especifica o nome do módulo ao qual o carregador deve dar suporte. O argumento *path* é o caminho para o arquivo do módulo de extensão.

source: Note that, by default, importing an extension module will fail in subinterpreters if it doesn't implement multi-phase init (see :pep:`489`), even if it would otherwise import successfully.
pt_br: Observe que, por padrão, a importação de um módulo de extensão falhará em subinterpretadores se ele não implementar inicialização multifásica (consulte a :pep:`489`), mesmo que ele seja importado com sucesso.

source: Multi-phase init is now required for use in subinterpreters.
pt_br: A inicialização multifásica agora é necessária para uso em subinterpretadores.

source: Name of the module the loader supports.
pt_br: Nome do módulo ao qual o carregador dá suporte.

source: Path to the extension module.
pt_br: Caminho para o módulo de extensão.

source: Creates the module object from the given specification in accordance with :pep:`489`.
pt_br: Cria o objeto do módulo a partir da especificação fornecida de acordo com a :pep:`489`.

source: Initializes the given module object in accordance with :pep:`489`.
pt_br: Inicializa o objeto do módulo fornecido de acordo com a :pep:`489`.

source: Returns ``None`` as extension modules lack a code object.
pt_br: Retorna ``None``, pois os módulos de extensão não possuem um objeto código.

source: Returns ``None`` as extension modules do not have source code.
pt_br: Retorna ``None`` pois os módulos de extensão não possuem código-fonte.

source: A concrete implementation of :class:`importlib.abc.InspectLoader` for namespace packages. This is an alias for a private class and is only made public for introspecting the ``__loader__`` attribute on namespace packages::
pt_br: Uma implementação concreta de :class:`importlib.abc.InspectLoader` para pacotes de espaço de nomes. Este é um apelido para uma classe privada e só é tornado público para introspecção do atributo ``__loader__`` em pacotes de espaço de nomes::

source: For example, consider the case of an import ``from foo.bar import _whiz``, where ``_whiz`` is implemented with the binary module ``sources/foo/bar/_whiz.abi3.so``, with ``sources`` being the location registered on ``sys.path``, relative to the application bundle. This module *must* be distributed as ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (creating the framework name from the full import path of the module), with an ``Info.plist`` file in the ``.framework`` directory identifying the binary as a framework. The ``foo.bar._whiz`` module would be represented in the original location with a ``sources/foo/bar/_whiz.abi3.fwork`` marker file, containing the path ``Frameworks/foo.bar._whiz/foo.bar._whiz``. The framework would also contain ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, containing the path to the ``.fwork`` file.
pt_br: Por exemplo, considere o caso de uma importação ``from foo.bar import _whiz``, onde ``_whiz`` é implementado com o módulo binário ``sources/foo/bar/_whiz.abi3.so``, com ``sources`` sendo o local registrado em ``sys.path``, relativo ao pacote da aplicação. Este módulo *deve* ser distribuído como ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (criando o nome do framework a partir do caminho completo de importação do módulo), com um arquivo ``Info.plist`` no diretório ``.framework`` identificando o binário como um framework. O módulo ``foo.bar._whiz`` seria representado no local original com um arquivo marcador ``sources/foo/bar/_whiz.abi3.fwork``, contendo o caminho ``Frameworks/foo.bar._whiz/foo.bar._whiz``. O framework também conteria ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, contendo o caminho para o arquivo ``.fwork``.

source: When a module is loaded with this loader, the ``__file__`` for the module will report as the location of the ``.fwork`` file. This allows code to use the ``__file__`` of a module as an anchor for file system traveral. However, the spec origin will reference the location of the *actual* binary in the ``.framework`` folder.
pt_br: Quando um módulo é carregado com este carregador, o ``__file__`` para o módulo será reportado como o local do arquivo ``.fwork``. Isso permite que o código use o ``__file__`` de um módulo como uma âncora para travessia do sistema de arquivos. No entanto, a origem do spec fará referência ao local do binário *real* na pasta ``.framework``.

source: Availability
pt_br: Disponibilidade

source: Accepts a :term:`path-like object`.
pt_br: Aceita um :term:`objeto caminho ou similar`.

source: Find the :term:`spec <module spec>` for a module, optionally relative to the specified **package** name. If the module is in :data:`sys.modules`, then ``sys.modules[name].__spec__`` is returned (unless the spec would be ``None`` or is not set, in which case :exc:`ValueError` is raised). Otherwise a search using :data:`sys.meta_path` is done. ``None`` is returned if no spec is found.
pt_br: Localiza o :term:`spec <module spec>` para um módulo, opcionalmente relativo ao nome do **package** especificado. Se o módulo estiver em :data:`sys.modules`, então ``sys.modules[name].__spec__`` será retornado (a menos que o spec seja ``None`` ou não esteja definido, nesse caso :exc:`ValueError` é levantada). Caso contrário, uma pesquisa usando :data:`sys.meta_path` é feita. ``None`` é retornado se nenhum spec for encontrada.

source: Examples
pt_br: Exemplos

source: Checking if a module can be imported
pt_br: Checando se o módulo pode ser importado

source: Importing a source file directly
pt_br: Importa o arquivo de origem diretamente

source: universal newlines
pt_br: novas linhas universais

source: importlib.abc.InspectLoader.get_source method
pt_br: Método importlib.abc.InspectLoader.get_source
