Repository: python/python-docs-pt-br
Catalog: library/importlib.po
Languages: pt_br

source: :mod:`!importlib` --- The implementation of :keyword:`!import`
pt_br: :mod:`!importlib` --- A implementação de :keyword:`!import`

source: **Source code:** :source:`Lib/importlib/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/importlib/__init__.py`

source: Introduction
pt_br: Introdução

source: The purpose of the :mod:`importlib` package is three-fold.
pt_br: O pacote :mod:`importlib` tem três propósitos.

source: One is to provide the implementation of the :keyword:`import` statement (and thus, by extension, the :func:`__import__` function) in Python source code. This provides an implementation of :keyword:`!import` which is portable to any Python interpreter. This also provides an implementation which is easier to comprehend than one implemented in a programming language other than Python.
pt_br: Uma é fornecer a implementação da instrução :keyword:`import` (e, portanto, por extensão, a função :func:`__import__`) no código-fonte Python. Isso fornece uma implementação de :keyword:`!import` que é portável para qualquer interpretador Python. Isso também fornece uma implementação que é mais fácil de compreender do que aquela implementada em uma linguagem de programação diferente do Python.

source: Two, the components to implement :keyword:`import` are exposed in this package, making it easier for users to create their own custom objects (known generically as an :term:`importer`) to participate in the import process.
pt_br: Dois, os componentes para implementar :keyword:`import` são expostos neste pacote, tornando mais fácil para os usuários criarem seus próprios objetos personalizados (conhecidos genericamente como :term:`importador`) para participar do processo de importação.

source: Three, the package contains modules exposing additional functionality for managing aspects of Python packages:
pt_br: Terceiro, o pacote contém módulos que expõem funcionalidades adicionais para gerenciar aspectos de pacotes Python:

source: :mod:`importlib.metadata` presents access to metadata from third-party distributions.
pt_br: :mod:`importlib.metadata` apresenta acesso a metadados de distribuições de terceiros.

source: :mod:`importlib.resources` provides routines for accessing non-code "resources" from Python packages.
pt_br: :mod:`importlib.resources` fornece rotinas para acessar "recursos" não codificados de pacotes Python.

source: The language reference for the :keyword:`import` statement.
pt_br: A referência da linguagem para a instrução :keyword:`import`.

source: `Packages specification <https://www.python.org/doc/essays/packages/>`__
pt_br: `Especificação dos pacotes <https://www.python.org/doc/essays/packages/>`__

source: Original specification of packages. Some semantics have changed since the writing of this document (e.g. redirecting based on ``None`` in :data:`sys.modules`).
pt_br: Especificação original dos pacotes. Algumas semânticas mudaram desde a redação deste documento (por exemplo, redirecionamento baseado em ``None`` em :data:`sys.modules`).

source: The :func:`.__import__` function
pt_br: A função :func:`.__import__`

source: The :keyword:`import` statement is syntactic sugar for this function.
pt_br: A instrução :keyword:`import` é um açúcar sintático para esta função.

source: The initialization of :data:`sys.path`.
pt_br: A inicialização de :data:`sys.path`.

source: Import on Case-Insensitive Platforms
pt_br: Importação em plataformas que diferenciam maiúsculo de minúsculo

source: Defining Python Source Code Encodings
pt_br: Definindo codificações do código-fonte do Python

source: New Import Hooks
pt_br: Novos ganchos de importação

source: Imports: Multi-Line and Absolute/Relative
pt_br: Importações: Multilinha e Absoluto/Relativo

source: Main module explicit relative imports
pt_br: Importações relativas explícitas do módulo principal

source: Implicit namespace packages
pt_br: Pacotes de espaço de nomes implícitos

source: A ModuleSpec Type for the Import System
pt_br: Um tipo de ModuleSpec para o sistema de importação

source: Elimination of PYO files
pt_br: Eliminação de arquivos PYO

source: Multi-phase extension module initialization
pt_br: Inicialização de módulo extensão multifase

source: Deterministic pycs
pt_br: pycs determinísticos

source: Using UTF-8 as the Default Source Encoding
pt_br: Usando UFT-8 como fonte padrão de codificação

source: PYC Repository Directories
pt_br: Diretórios de repositório de PYC

source: Functions
pt_br: Funções

source: An implementation of the built-in :func:`__import__` function.
pt_br: Uma implementação da função embutida :func:`__import__`.

source: Programmatic importing of modules should use :func:`import_module` instead of this function.
pt_br: A importação programática de módulos deve usar :func:`import_module` em vez desta função.

source: Import a module. The *name* argument specifies what module to import in absolute or relative terms (e.g. either ``pkg.mod`` or ``..mod``). If the name is specified in relative terms, then the *package* argument must be set to the name of the package which is to act as the anchor for resolving the package name (e.g. ``import_module('..mod', 'pkg.subpkg')`` will import ``pkg.mod``).
pt_br: Importa um módulo. O argumento *name* especifica qual módulo importar em termos absolutos ou relativos (por exemplo, ``pkg.mod`` ou ``..mod``). Se o nome for especificado em termos relativos, então o argumento *package* deve ser definido como o nome do pacote que atuará como âncora para resolver o nome do pacote (por exemplo, ``import_module('..mod', 'pkg.subpkg')`` importará ``pkg.mod``).

source: The :func:`import_module` function acts as a simplifying wrapper around :func:`importlib.__import__`. This means all semantics of the function are derived from :func:`importlib.__import__`. The most important difference between these two functions is that :func:`import_module` returns the specified package or module (e.g. ``pkg.mod``), while :func:`__import__` returns the top-level package or module (e.g. ``pkg``).
pt_br: A função :func:`import_module` atua como um wrapper simplificador em torno de :func:`importlib.__import__`. Isso significa que toda a semântica da função é derivada de :func:`importlib.__import__`. A diferença mais importante entre essas duas funções é que :func:`import_module` retorna o pacote ou módulo especificado (por exemplo, ``pkg.mod``), enquanto :func:`__import__` retorna o pacote ou módulo de nível superior (por exemplo, ``pkg``).

source: If you are dynamically importing a module that was created since the interpreter began execution (e.g., created a Python source file), you may need to call :func:`invalidate_caches` in order for the new module to be noticed by the import system.
pt_br: Se você estiver importando dinamicamente um módulo que foi criado desde que o interpretador iniciou a execução (por exemplo, criou um arquivo fonte Python), você pode precisar chamar :func:`invalidate_caches` para que o novo módulo seja notado pelo sistema de importação.

source: Parent packages are automatically imported.
pt_br: Os pacotes pai são importados automaticamente.

source: Invalidate the internal caches of finders stored at :data:`sys.meta_path`. If a finder implements ``invalidate_caches()`` then it will be called to perform the invalidation. This function should be called if any modules are created/installed while your program is running to guarantee all finders will notice the new module's existence.
pt_br: Invalida os caches internos dos localizadores armazenados em :data:`sys.meta_path`. Se um localizador implementar ``invalidate_caches()`` então ele será chamado para realizar a invalidação. Esta função deve ser chamada se algum módulo for criado/instalado enquanto seu programa estiver em execução para garantir que todos os localizadores notarão a existência do novo módulo.

source: Namespace packages created/installed in a different :data:`sys.path` location after the same namespace was already imported are noticed.
pt_br: Pacotes de espaço de nomes criados/instalados em um local :data:`sys.path` diferente após o mesmo espaço de nomes já ter sido importado são notados.

source: Reload a previously imported *module*. The argument must be a module object, so it must have been successfully imported before. This is useful if you have edited the module source file using an external editor and want to try out the new version without leaving the Python interpreter. The return value is the module object (which can be different if re-importing causes a different object to be placed in :data:`sys.modules`).
pt_br: Recarrega um *module* importado anteriormente. O argumento deve ser um objeto módulo, portanto deve ter sido importado com êxito antes. Isso é útil se você editou o arquivo fonte do módulo usando um editor externo e deseja experimentar a nova versão sem sair do interpretador Python. O valor de retorno é o objeto módulo (que pode ser diferente se a reimportação fizer com que um objeto diferente seja colocado em :data:`sys.modules`).

source: When :func:`reload` is executed:
pt_br: Quando :func:`reload` é executado:

source: Python module's code is recompiled and the module-level code re-executed, defining a new set of objects which are bound to names in the module's dictionary by reusing the :term:`loader` which originally loaded the module. The ``init`` function of extension modules is not called a second time.
pt_br: O código do módulo Python é recompilado e o código em nível de módulo é reexecutado, definindo um novo conjunto de objetos que são vinculados a nomes no dicionário do módulo reutilizando o :term:`carregador` que originalmente carregou o módulo. A função ``init`` dos módulos de extensão não é chamada uma segunda vez.

source: As with all other objects in Python the old objects are only reclaimed after their reference counts drop to zero.
pt_br: Tal como acontece com todos os outros objetos em Python, os objetos antigos só são recuperados depois que suas contagens de referências caem para zero.

source: The names in the module namespace are updated to point to any new or changed objects.
pt_br: Os nomes no espaço de nomes do módulo são atualizados para apontar para quaisquer objetos novos ou alterados.

source: Other references to the old objects (such as names external to the module) are not rebound to refer to the new objects and must be updated in each namespace where they occur if that is desired.
pt_br: Outras referências aos objetos antigos (como nomes externos ao módulo) não são religadas para se referir aos novos objetos e devem ser atualizadas em cada espaço de nomes onde ocorrem, se isso for desejado.

source: There are a number of other caveats:
pt_br: Existem várias outras ressalvas:

source: When a module is reloaded, its dictionary (containing the module's global variables) is retained. Redefinitions of names will override the old definitions, so this is generally not a problem. If the new version of a module does not define a name that was defined by the old version, the old definition remains. This feature can be used to the module's advantage if it maintains a global table or cache of objects --- with a :keyword:`try` statement it can test for the table's presence and skip its initialization if desired::
pt_br: Quando um módulo é recarregado, seu dicionário (contendo as variáveis globais do módulo) é retido. As redefinições de nomes vão substituir as definições antigas, portanto isso geralmente não é um problema. Se a nova versão de um módulo não definir um nome definido pela versão antiga, a definição antiga permanecerá. Este recurso pode ser usado para vantagem do módulo se ele mantiver uma tabela global ou cache de objetos -- com uma instrução :keyword:`try` ele pode testar a presença da tabela e pular sua inicialização se desejar::

source: It is generally not very useful to reload built-in or dynamically loaded modules. Reloading :mod:`sys`, :mod:`__main__`, :mod:`builtins` and other key modules is not recommended. In many cases extension modules are not designed to be initialized more than once, and may fail in arbitrary ways when reloaded.
pt_br: Geralmente não é muito útil recarregar módulos embutidos ou carregados dinamicamente. Recarregar :mod:`sys`, :mod:`__main__`, :mod:`builtins` e outros módulos principais não é recomendado. Em muitos casos, os módulos de extensão não são projetados para serem inicializados mais de uma vez e podem falhar de maneiras arbitrárias quando recarregados.

source: If a module imports objects from another module using :keyword:`from` ... :keyword:`import` ..., calling :func:`reload` for the other module does not redefine the objects imported from it --- one way around this is to re-execute the :keyword:`!from` statement, another is to use :keyword:`!import` and qualified names (*module.name*) instead.
pt_br: Se um módulo importa objetos de outro módulo usando :keyword:`from` ... :keyword:`import` ..., chamar :func:`reload` para o outro módulo não redefine os objetos importados dele -- uma maneira de contornar isso é executar novamente a instrução :keyword:`!from`, outra é usar :keyword:`!import` e nomes qualificados (*module.name*).

source: If a module instantiates instances of a class, reloading the module that defines the class does not affect the method definitions of the instances --- they continue to use the old class definition. The same is true for derived classes.
pt_br: Se um módulo instancia instâncias de uma classe, recarregar o módulo que define a classe não afeta as definições de método das instâncias -- elas continuam a usar a definição de classe antiga. O mesmo se aplica às classes derivadas.

source: :exc:`ModuleNotFoundError` is raised when the module being reloaded lacks a :class:`~importlib.machinery.ModuleSpec`.
pt_br: :exc:`ModuleNotFoundError` é levantada quando o módulo que está sendo recarregado não possui um :class:`~importlib.machinery.ModuleSpec`.

source: :mod:`importlib.abc` -- Abstract base classes related to import
pt_br: :mod:`importlib.abc` -- classes base abstratas relacionadas a importação

source: **Source code:** :source:`Lib/importlib/abc.py`
pt_br: **Código-fonte:** :source:`Lib/importlib/abc.py`

source: The :mod:`importlib.abc` module contains all of the core abstract base classes used by :keyword:`import`. Some subclasses of the core abstract base classes are also provided to help in implementing the core ABCs.
pt_br: O módulo :mod:`importlib.abc` contém todas as principais classes base abstratas usadas por :keyword:`import`. Algumas subclasses das classes base abstratas principais também são fornecidas para ajudar na implementação dss ABCs principais.

source: ABC hierarchy::
pt_br: Hierarquia de ABC::

source: An abstract base class representing a :term:`meta path finder`.
pt_br: Uma classe base abstrata que representa um :term:`localizador de metacaminho`.

source: No longer a subclass of :class:`!Finder`.
pt_br: Não é mais uma subclasse de :class:`!Finder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. If this is a top-level import, *path* will be ``None``. Otherwise, this is a search for a subpackage or module and *path* will be the value of :attr:`~module.__path__` from the parent package. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``MetaPathFinders``.
pt_br: Um método abstrato para encontrar um :term:`spec <module spec>` para o módulo especificado. Se esta for uma importação de nível superior, *path* será ``None``. Caso contrário, esta é uma busca por um subpacote ou módulo e *path* será o valor de :attr:`~module.__path__` do pacote pai. Se um spec não puder ser encontrado, ``None`` será retornado. Quando passado, ``target`` é um objeto de módulo que o localizador pode usar para fazer uma estimativa mais informada sobre qual spec retornar. :func:`importlib.util.spec_from_loader` pode ser útil para implementar ``MetaPathFinders`` concretos.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :func:`importlib.invalidate_caches` when invalidating the caches of all finders on :data:`sys.meta_path`.
pt_br: Um método opcional que, quando chamado, deve invalidar qualquer cache interno usado pelo localizador. Usado por :func:`importlib.invalidate_caches` ao invalidar os caches de todos os localizadores em :data:`sys.meta_path`.

source: Returns ``None`` when called instead of :data:`NotImplemented`.
pt_br: Retorna ``None`` quando chamado em vez de :data:`NotImplemented`.

source: An abstract base class representing a :term:`path entry finder`. Though it bears some similarities to :class:`MetaPathFinder`, ``PathEntryFinder`` is meant for use only within the path-based import subsystem provided by :class:`importlib.machinery.PathFinder`.
pt_br: Uma classe base abstrata que representa um :term:`localizador de entrada de caminho`. Embora tenha algumas semelhanças com :class:`MetaPathFinder`, ``PathEntryFinder`` deve ser usado apenas dentro do subsistema de importação baseado em caminho fornecido por :class:`importlib.machinery.PathFinder`.

source: An abstract method for finding a :term:`spec <module spec>` for the specified module. The finder will search for the module only within the :term:`path entry` to which it is assigned. If a spec cannot be found, ``None`` is returned. When passed in, ``target`` is a module object that the finder may use to make a more educated guess about what spec to return. :func:`importlib.util.spec_from_loader` may be useful for implementing concrete ``PathEntryFinders``.
pt_br: Um método abstrato para encontrar um :term:`spec <module spec>` para o módulo especificado. O localizador irá procurar pelo módulo apenas dentro do :term:`entrada de caminho` ao qual ele está atribuído. Se um spec não puder ser encontrado, ``None`` será retornado. Quando passado, ``target`` é um objeto de módulo que o localizador pode usar para fazer uma estimativa mais informada sobre qual spec retornar. :func:`importlib.util.spec_from_loader` pode ser útil para implementar ``PathEntryFinders`` concretos.

source: An optional method which, when called, should invalidate any internal cache used by the finder. Used by :meth:`importlib.machinery.PathFinder.invalidate_caches` when invalidating the caches of all cached finders.
pt_br: Um método opcional que, quando chamado, deve invalidar qualquer cache interno usado pelo localizador. Usado por :meth:`importlib.machinery.PathFinder.invalidate_caches` ao invalidar os caches de todos os localizadores em cache.

source: An abstract base class for a :term:`loader`. See :pep:`302` for the exact definition for a loader.
pt_br: Uma classe base abstrata para um :term:`carregador`. Veja :pep:`302` para a definição exata de um carregador.

source: Loaders that wish to support resource reading should implement a :meth:`get_resource_reader` method as specified by :class:`importlib.resources.abc.ResourceReader`.
pt_br: Carregadores que desejam oferecer suporte a leitura de recursos devem implementar um método :meth:`get_resource_reader` conforme especificado por :class:`importlib.resources.abc.ResourceReader`.

source: Introduced the optional :meth:`get_resource_reader` method.
pt_br: Introduzido o método opcional :meth:`get_resource_reader`.

source: A method that returns the module object to use when importing a module. This method may return ``None``, indicating that default module creation semantics should take place.
pt_br: Um método que retorna o objeto do módulo a ser usado ao importar um módulo. Este método pode retornar ``None``, indicando que a semântica padrão de criação do módulo deve ocorrer.

source: This method is no longer optional when :meth:`exec_module` is defined.
pt_br: Este método não é mais opcional quando :meth:`exec_module` é definido.

source: An abstract method that executes the module in its own namespace when a module is imported or reloaded. The module should already be initialized when :meth:`exec_module` is called. When this method exists, :meth:`create_module` must be defined.
pt_br: Um método abstrato que executa o módulo em seu próprio espaço de nomes quando um módulo é importado ou recarregado. O módulo já deve estar inicializado quando :meth:`exec_module` for chamado. Quando este método existir, :meth:`create_module` deve ser definido.

source: :meth:`create_module` must also be defined.
pt_br: :meth:`create_module` deve ser definido.

source: A legacy method for loading a module. If the module cannot be loaded, :exc:`ImportError` is raised, otherwise the loaded module is returned.
pt_br: Um método legado para carregar um módulo. Se o módulo não puder ser carregado, :exc:`ImportError` será levantada, caso contrário, o módulo carregado será retornado.

source: If the requested module already exists in :data:`sys.modules`, that module should be used and reloaded. Otherwise the loader should create a new module and insert it into :data:`sys.modules` before any loading begins, to prevent recursion from the import. If the loader inserted a module and the load fails, it must be removed by the loader from :data:`sys.modules`; modules already in :data:`sys.modules` before the loader began execution should be left alone.
pt_br: Se o módulo solicitado já existir em :data:`sys.modules`, esse módulo deverá ser usado e recarregado. Caso contrário, o carregador deve criar um novo módulo e inseri-lo em :data:`sys.modules` antes de qualquer carregamento começar, para evitar a recursão da importação. Se o carregador inseriu um módulo e o carregamento falhar, ele deverá ser removido pelo carregador de :data:`sys.modules`; módulos já em :data:`sys.modules` antes do carregador iniciar a execução devem ser deixados sozinhos.

source: The loader should set several attributes on the module (note that some of these attributes can change when a module is reloaded):
pt_br: O carregador deve definir vários atributos no módulo (observe que alguns desses atributos podem mudar quando um módulo é recarregado):

source: :attr:`module.__cached__` *(deprecated)*
pt_br: :attr:`module.__cached__` *(descontinuado)*

source: :attr:`module.__package__` *(deprecated)*
pt_br: :attr:`module.__package__` *(descontinuado)*

source: :attr:`module.__loader__` *(deprecated)*
pt_br: :attr:`module.__loader__` *(descontinuado)*

source: When :meth:`exec_module` is available then backwards-compatible functionality is provided.
pt_br: Quando :meth:`exec_module` está disponível, então a funcionalidade compatível com versões anteriores é fornecida.

source: Raise :exc:`ImportError` when called instead of :exc:`NotImplementedError`. Functionality provided when :meth:`exec_module` is available.
pt_br: Levanta :exc:`ImportError` quando chamado em vez de :exc:`NotImplementedError`. Funcionalidade fornecida quando :meth:`exec_module` está disponível.

source: The recommended API for loading a module is :meth:`exec_module` (and :meth:`create_module`). Loaders should implement it instead of :meth:`load_module`. The import machinery takes care of all the other responsibilities of :meth:`load_module` when :meth:`exec_module` is implemented.
pt_br: A API recomendada para carregar um módulo é :meth:`exec_module` (e :meth:`create_module`). Os carregadores devem implementá-lo em vez de :meth:`load_module`. O mecanismo de importação cuida de todas as outras responsabilidades de :meth:`load_module` quando :meth:`exec_module` é implementado.

source: *Superseded by TraversableResources*
pt_br: *Substituída por TraversableResources*
