Repository: python/python-docs-pt-br
Catalog: library/importlib.po
Languages: pt_br

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loading arbitrary resources from the storage back-end.
pt_br: Uma classe base abstrata para um :term:`carregador` que implementa o protocolo opcional :pep:`302` para carregar recursos arbitrários do back-end de armazenamento.

source: This ABC is deprecated in favour of supporting resource loading through :class:`importlib.resources.abc.TraversableResources`.
pt_br: Este ABC foi descontinuado em favor do suporte ao carregamento de recursos por meio de :class:`importlib.resources.abc.TraversableResources`.

source: An abstract method to return the bytes for the data located at *path*. Loaders that have a file-like storage back-end that allows storing arbitrary data can implement this abstract method to give direct access to the data stored. :exc:`OSError` is to be raised if the *path* cannot be found. The *path* is expected to be constructed using a module's :attr:`~module.__file__` attribute or an item from a package's :attr:`~module.__path__`.
pt_br: Um método abstrato para retornar os bytes dos dados localizados em *path*. Carregadores que possuem um backend de armazenamento arquivo ou similar que permite o armazenamento de dados arbitrários podem implementar esse método abstrato para fornecer acesso direto aos dados armazenados. :exc:`OSError` deve ser levantada se o *path* não puder ser encontrado. Espera-se que o *path* seja construído usando o atributo :attr:`~module.__file__` de um módulo ou um item de :attr:`~module.__path__` de um pacote.

source: Raises :exc:`OSError` instead of :exc:`NotImplementedError`.
pt_br: Levanta :exc:`OSError` em vez de :exc:`NotImplementedError`.

source: An abstract base class for a :term:`loader` which implements the optional :pep:`302` protocol for loaders that inspect modules.
pt_br: Uma classe base abstrata para um :term:`carregador` que implementa o protocolo opcional da :pep:`302` para carregadores que inspecionam módulos.

source: Return the code object for a module, or ``None`` if the module does not have a code object (as would be the case, for example, for a built-in module). Raise an :exc:`ImportError` if loader cannot find the requested module.
pt_br: Retorna o objeto de código para um módulo, ou ``None`` se o módulo não tiver um objeto código (como seria o caso, por exemplo, para um módulo embutido). Levanta um :exc:`ImportError` se o carregador não conseguir encontrar o módulo solicitado.

source: While the method has a default implementation, it is suggested that it be overridden if possible for performance.
pt_br: Embora o método tenha uma implementação padrão, sugere-se que ele seja substituído, se possível, para desempenho.

source: No longer abstract and a concrete implementation is provided.
pt_br: Não é mais abstrato e uma implementação concreta é fornecida.

source: An abstract method to return the source of a module. It is returned as a text string using :term:`universal newlines`, translating all recognized line separators into ``'\n'`` characters. Returns ``None`` if no source is available (e.g. a built-in module). Raises :exc:`ImportError` if the loader cannot find the module specified.
pt_br: Um método abstrato para retornar a fonte de um módulo. Ele é retornado como uma string de texto usando :term:`novas linhas universais`, traduzindo todos os separadores de linha reconhecidos em caracteres ``'\n'``. Retorna ``None`` se nenhuma fonte estiver disponível (por exemplo, um módulo embutido). Levanta :exc:`ImportError` se o carregador não puder encontrar o módulo especificado.

source: Raises :exc:`ImportError` instead of :exc:`NotImplementedError`.
pt_br: Levanta :exc:`ImportError` em vez de :exc:`NotImplementedError`.

source: An optional method to return a true value if the module is a package, a false value otherwise. :exc:`ImportError` is raised if the :term:`loader` cannot find the module.
pt_br: Um método opcional para retornar um valor verdadeiro se o módulo for um pacote, um valor falso caso contrário. :exc:`ImportError` é levantada se o :term:`carregador` não puder encontrar o módulo.

source: Create a code object from Python source.
pt_br: Cria um objeto código a partir de código-fonte Python

source: The *data* argument can be whatever the :func:`compile` function supports (i.e. string or bytes). The *path* argument should be the "path" to where the source code originated from, which can be an abstract concept (e.g. location in a zip file).
pt_br: O argumento *data* pode ser qualquer coisa a qual a função :func:`compile` tenha suporte (por exemplo, string ou bytes). O argumento *path* deve ser o "caminho" de onde o código-fonte se originou, o que pode ser um conceito abstrato (por exemplo, local em um arquivo zip).

source: With the subsequent code object one can execute it in a module by running ``exec(code, module.__dict__)``.
pt_br: Com o objeto de código subsequente, é possível executá-lo em um módulo executando ``exec(code, module.__dict__)``.

source: Made the method static.
pt_br: O método foi tornado estático.

source: Implementation of :meth:`Loader.exec_module`.
pt_br: Implementação de :meth:`Loader.exec_module`.

source: Implementation of :meth:`Loader.load_module`.
pt_br: Implementação de :meth:`Loader.load_module`.

source: use :meth:`exec_module` instead.
pt_br: use :meth:`exec_module`.

source: An abstract base class which inherits from :class:`InspectLoader` that, when implemented, helps a module to be executed as a script. The ABC represents an optional :pep:`302` protocol.
pt_br: Uma classe base abstrata que herda de :class:`InspectLoader` que, quando implementada, ajuda um módulo a ser executado como um script. A ABC representa um protocolo opcional da :pep:`302`.

source: An abstract method that is to return the value of :attr:`~module.__file__` for the specified module. If no path is available, :exc:`ImportError` is raised.
pt_br: Um método abstrato que deve retornar o valor de :attr:`~module.__file__` para o módulo especificado. Se nenhum caminho estiver disponível, :exc:`ImportError` é levantada.

source: If source code is available, then the method should return the path to the source file, regardless of whether a bytecode was used to load the module.
pt_br: Se o código-fonte estiver disponível, o método deverá retornar o caminho para o arquivo fonte, independentemente de um bytecode ter sido usado para carregar o módulo.

source: An abstract base class which inherits from :class:`ResourceLoader` and :class:`ExecutionLoader`, providing concrete implementations of :meth:`ResourceLoader.get_data` and :meth:`ExecutionLoader.get_filename`.
pt_br: Uma classe base abstrata que herda de :class:`ResourceLoader` e :class:`ExecutionLoader`, fornecendo implementações concretas de :meth:`ResourceLoader.get_data` e :meth:`ExecutionLoader.get_filename`.

source: The *fullname* argument is a fully resolved name of the module the loader is to handle. The *path* argument is the path to the file for the module.
pt_br: O argumento *fullname* é um nome totalmente resolvido do módulo que o carregador deve manipular. O argumento *path* é o caminho para o arquivo do módulo.

source: The name of the module the loader can handle.
pt_br: O nome do módulo que o carregador pode manipular.

source: Path to the file of the module.
pt_br: Caminho para o arquivo do módulo

source: Calls super's ``load_module()``.
pt_br: Chama ``load_module()`` do super.

source: Use :meth:`Loader.exec_module` instead.
pt_br: Use :meth:`Loader.exec_module`

source: Returns :attr:`path`.
pt_br: Retorna :attr:`path`.

source: Reads *path* as a binary file and returns the bytes from it.
pt_br: Lê *caminho* como um arquivo binário e retorna os bytes dele.

source: An abstract base class for implementing source (and optionally bytecode) file loading. The class inherits from both :class:`ResourceLoader` and :class:`ExecutionLoader`, requiring the implementation of:
pt_br: Uma classe base abstrata para implementar o carregamento de arquivo fonte (e opcionalmente bytecode). A classe herda de :class:`ResourceLoader` e :class:`ExecutionLoader`, exigindo a implementação de:

source: Should only return the path to the source file; sourceless loading is not supported.
pt_br: Deve retornar apenas o caminho para o arquivo fonte; o carregamento sem fonte não é suportado.

source: The abstract methods defined by this class are to add optional bytecode file support. Not implementing these optional methods (or causing them to raise :exc:`NotImplementedError`) causes the loader to only work with source code. Implementing the methods allows the loader to work with source *and* bytecode files; it does not allow for *sourceless* loading where only bytecode is provided. Bytecode files are an optimization to speed up loading by removing the parsing step of Python's compiler, and so no bytecode-specific API is exposed.
pt_br: Os métodos abstratos definidos por esta classe são para adicionar suporte opcional ao arquivo bytecode. Não implementar esses métodos opcionais (ou fazer com que eles levantem :exc:`NotImplementedError`) faz com que o carregador funcione apenas com código-fonte. Implementar os métodos permite que o carregador funcione com arquivos de código-fonte *e* bytecode; ele não permite carregamento *sem fonte* onde apenas o bytecode é fornecido. Arquivos de bytecode são uma otimização para acelerar o carregamento removendo a etapa de análise do compilador do Python e, portanto, nenhuma API específica de bytecode é exposta.

source: Optional abstract method which returns a :class:`dict` containing metadata about the specified path. Supported dictionary keys are:
pt_br: Método abstrato opcional que retorna um :class:`dict` contendo metadados sobre o caminho especificado. As chaves de dicionário suportadas são:

source: ``'mtime'`` (mandatory): an integer or floating-point number representing the modification time of the source code;
pt_br: ``'mtime'`` (obrigatório): um número inteiro ou de ponto flutuante que representa o tempo de modificação do código-fonte;

source: ``'size'`` (optional): the size in bytes of the source code.
pt_br: ``'size'`` (opcional): o tamanho em bytes do código-fonte.

source: Any other keys in the dictionary are ignored, to allow for future extensions. If the path cannot be handled, :exc:`OSError` is raised.
pt_br: Quaisquer outras chaves no dicionário são ignoradas, para permitir extensões futuras. Se o caminho não puder ser manipulado, :exc:`OSError` é levantada.

source: Raise :exc:`OSError` instead of :exc:`NotImplementedError`.
pt_br: Levanta :exc:`OSError` em vez de :exc:`NotImplementedError`.

source: Optional abstract method which returns the modification time for the specified path.
pt_br: Método abstrato opcional que retorna o horário de modificação do caminho especificado.

source: This method is deprecated in favour of :meth:`path_stats`. You don't have to implement it, but it is still available for compatibility purposes. Raise :exc:`OSError` if the path cannot be handled.
pt_br: Este método foi descontinuado em favor de :meth:`path_stats`. Você não precisa implementá-lo, mas ele ainda está disponível para fins de compatibilidade. Levanta :exc:`OSError` se o caminho não puder ser manipulado.

source: Optional abstract method which writes the specified bytes to a file path. Any intermediate directories which do not exist are to be created automatically.
pt_br: Método abstrato opcional que grava os bytes especificados em um caminho de arquivo. Quaisquer diretórios intermediários que não existam devem ser criados automaticamente.

source: When writing to the path fails because the path is read-only (:const:`errno.EACCES`/:exc:`PermissionError`), do not propagate the exception.
pt_br: Quando a gravação no caminho falhar porque o caminho é somente leitura (:const:`errno.EACCES`/:exc:`PermissionError`), não propaga a exceção.

source: No longer raises :exc:`NotImplementedError` when called.
pt_br: Não mais levanta :exc:`NotImplementedError` quando chamado.

source: Concrete implementation of :meth:`InspectLoader.get_code`.
pt_br: Implementação concreta de :meth:`InspectLoader.get_code`.

source: Concrete implementation of :meth:`Loader.exec_module`.
pt_br: Implementação concreta de :meth:`Loader.exec_module`.

source: Concrete implementation of :meth:`Loader.load_module`.
pt_br: Implementação concreta de :meth:`Loader.load_module`.

source: Use :meth:`exec_module` instead.
pt_br: Use :meth:`exec_module`.

source: Concrete implementation of :meth:`InspectLoader.get_source`.
pt_br: Implementação concreta de :meth:`InspectLoader.get_source`.

source: Concrete implementation of :meth:`InspectLoader.is_package`. A module is determined to be a package if its file path (as provided by :meth:`ExecutionLoader.get_filename`) is a file named ``__init__`` when the file extension is removed **and** the module name itself does not end in ``__init__``.
pt_br: Implementação concreta de :meth:`InspectLoader.is_package`. Um módulo é determinado como um pacote se seu caminho de arquivo (conforme fornecido por :meth:`ExecutionLoader.get_filename`) for um arquivo chamado ``__init__`` quando a extensão do arquivo for removida **e** o nome do módulo em si não terminar em ``__init__``.

source: An :term:`abstract base class` to provide the ability to read *resources*.
pt_br: Uma :term:`classe base abstrata` para fornecer a capacidade de ler *recursos*.

source: From the perspective of this ABC, a *resource* is a binary artifact that is shipped within a package. Typically this is something like a data file that lives next to the ``__init__.py`` file of the package. The purpose of this class is to help abstract out the accessing of such data files so that it does not matter if the package and its data file(s) are stored e.g. in a zip file versus on the file system.
pt_br: Da perspectiva deste ABC, um *recurso* é um artefato binário que é enviado dentro de um pacote. Normalmente isso é algo como um arquivo de dados que fica próximo ao arquivo ``__init__.py`` do pacote. O objetivo desta classe é ajudar a abstrair o acesso a tais arquivos de dados para que não importe se o pacote e seu(s) arquivo(s) de dados estão armazenados, por exemplo, em um arquivo zip versus no sistema de arquivos.

source: For any of methods of this class, a *resource* argument is expected to be a :term:`path-like object` which represents conceptually just a file name. This means that no subdirectory paths should be included in the *resource* argument. This is because the location of the package the reader is for, acts as the "directory". Hence the metaphor for directories and file names is packages and resources, respectively. This is also why instances of this class are expected to directly correlate to a specific package (instead of potentially representing multiple packages or a module).
pt_br: Para qualquer um dos métodos desta classe, espera-se que o argumento *resource* seja um :term:`objeto caminho ou similar` que representa conceitualmente apenas um nome de arquivo. Isso significa que nenhum caminho de subdiretório deve ser incluído no argumento *resource*. Isso ocorre porque a localização do pacote para o qual o leitor se destina, atua como o "diretório". Portanto, a metáfora para diretórios e nomes de arquivos são pacotes e recursos, respectivamente. É também por isso que se espera que as instâncias dessa classe se correlacionem diretamente a um pacote específico (em vez de representar potencialmente vários pacotes ou um módulo).

source: Loaders that wish to support resource reading are expected to provide a method called ``get_resource_reader(fullname)`` which returns an object implementing this ABC's interface. If the module specified by fullname is not a package, this method should return :const:`None`. An object compatible with this ABC should only be returned when the specified module is a package.
pt_br: Carregadores que desejam oferecer suporte à leitura de recursos devem fornecer um método chamado ``get_resource_reader(nomecompleto)`` que retorna um objeto implementando esta interface ABC. Se o módulo especificado por nomecompleto não for um pacote, este método deve retornar :const:`None`. Um objeto compatível com este ABC só deve ser retornado quando o módulo especificado for um pacote.

source: Use :class:`importlib.resources.abc.TraversableResources` instead.
pt_br: Use :class:`importlib.resources.abc.TraversableResources`.

source: Returns an opened, :term:`file-like object` for binary reading of the *resource*.
pt_br: Retorna um :term:`objeto arquivo ou similar` aberto para leitura binária de *resource*.

source: If the resource cannot be found, :exc:`FileNotFoundError` is raised.
pt_br: Se o recurso não puder ser encontrado, :exc:`FileNotFoundError` é levantada.

source: Returns the file system path to the *resource*.
pt_br: Retorna o caminho do sistema de arquivos para *resource*.

source: If the resource does not concretely exist on the file system, raise :exc:`FileNotFoundError`.
pt_br: Se o recurso não existir concretamente no sistema de arquivos, levanta :exc:`FileNotFoundError`.

source: Returns ``True`` if the named *name* is considered a resource. :exc:`FileNotFoundError` is raised if *name* does not exist.
pt_br: Retorna ``True`` se o *name* nomeado for considerado um recurso. :exc:`FileNotFoundError` é levantada se *name* não existir.

source: Returns an :term:`iterable` of strings over the contents of the package. Do note that it is not required that all names returned by the iterator be actual resources, e.g. it is acceptable to return names for which :meth:`is_resource` would be false.
pt_br: Retorna um :term:`iterável` de strings sobre o conteúdo do pacote. Observe que não é necessário que todos os nomes retornados pelo iterador sejam recursos reais, por exemplo, é aceitável retornar nomes para os quais :meth:`is_resource` seria falso.

source: Allowing non-resource names to be returned is to allow for situations where how a package and its resources are stored are known a priori and the non-resource names would be useful. For instance, returning subdirectory names is allowed so that when it is known that the package and resources are stored on the file system then those subdirectory names can be used directly.
pt_br: Permitir que nomes que não são recursos sejam retornados é permitir situações em que a forma como um pacote e seus recursos são armazenados é conhecida a priori e os nomes que não são recursos seriam úteis. Por exemplo, o retorno de nomes de subdiretórios é permitido para que, quando se souber que o pacote e os recursos estão armazenados no sistema de arquivos, esses nomes de subdiretórios possam ser usados diretamente.

source: The abstract method returns an iterable of no items.
pt_br: O método abstrato retorna um iterável sem itens.

source: An object with a subset of :class:`pathlib.Path` methods suitable for traversing directories and opening files.
pt_br: Um objeto com um subconjunto de métodos de :class:`pathlib.Path` adequados para percorrer diretórios e abrir arquivos.

source: For a representation of the object on the file-system, use :meth:`importlib.resources.as_file`.
pt_br: Para uma representação do objeto no sistema de arquivos, use :meth:`importlib.resources.as_file`.

source: Use :class:`importlib.resources.abc.Traversable` instead.
pt_br: Use :class:`importlib.resources.abc.Traversable`.

source: Abstract. The base name of this object without any parent references.
pt_br: Abstrato. O nome base deste objeto sem nenhuma referência pai.

source: Yield ``Traversable`` objects in ``self``.
pt_br: Produz objetos ``Traversable`` em ``self``.

source: Return ``True`` if ``self`` is a directory.
pt_br: Retorna ``True`` se ``self`` for um diretório.

source: Return ``True`` if ``self`` is a file.
pt_br: Retorna ``True`` se ``self`` for um arquivo.

source: Return Traversable child in ``self``.
pt_br: Retorna o filho Traversable em ``self``.

source: Return ``Traversable`` child in ``self``.
pt_br: Retorna o filho ``Traversable`` em ``self``.

source: *mode* may be 'r' or 'rb' to open as text or binary. Return a handle suitable for reading (same as :attr:`pathlib.Path.open`).
pt_br: *mode* pode ser 'r' ou 'rb' para abrir como texto ou binário. Retorna um manipulador adequado para leitura (o mesmo que :attr:`pathlib.Path.open`).

source: When opening as text, accepts encoding parameters such as those accepted by :class:`io.TextIOWrapper`.
pt_br: Ao abrir como texto, aceita parâmetros de codificação como os aceitos por :class:`io.TextIOWrapper`.

source: Read contents of ``self`` as bytes.
pt_br: Lê o conteúdo de ``self`` como bytes.

source: Read contents of ``self`` as text.
pt_br: Lê o conteúdo de ``self`` como texto.

source: An abstract base class for resource readers capable of serving the :meth:`importlib.resources.files` interface. Subclasses :class:`importlib.resources.abc.ResourceReader` and provides concrete implementations of the :class:`importlib.resources.abc.ResourceReader`'s abstract methods. Therefore, any loader supplying :class:`importlib.abc.TraversableResources` also supplies ResourceReader.
pt_br: Uma classe base abstrata para leitores de recursos capaz de servir a interface :meth:`importlib.resources.files`. Subclasse :class:`importlib.resources.abc.ResourceReader` e fornece implementações concretas dos métodos abstratos de :class:`importlib.resources.abc.ResourceReader`. Portanto, qualquer carregador que forneça :class:`importlib.abc.TraversableResources` também fornece ResourceReader.

source: Loaders that wish to support resource reading are expected to implement this interface.
pt_br: Espera-se que os carregadores que desejam oferecer suporte à leitura de recursos implementem essa interface.

source: Returns a :class:`importlib.resources.abc.Traversable` object for the loaded package.
pt_br: Retorna um objeto :class:`importlib.resources.abc.Traversable` para o pacote carregado.

source: :mod:`importlib.machinery` -- Importers and path hooks
pt_br: :mod:`importlib.machinery` -- Importadores e ganchos de caminho

source: **Source code:** :source:`Lib/importlib/machinery.py`
pt_br: **Código-fonte:** :source:`Lib/importlib/machinery.py`

source: This module contains the various objects that help :keyword:`import` find and load modules.
pt_br: Este módulo contém vários objetos que ajudam o :keyword:`import` a localizar e carregar módulos.

source: A list of strings representing the recognized file suffixes for source modules.
pt_br: Uma lista de strings representando os sufixos de arquivo reconhecidos para módulos em código-fonte.

source: A list of strings representing the file suffixes for non-optimized bytecode modules.
pt_br: Uma lista de strings representando os sufixos de arquivo para módulos em bytecode não otimizado.

source: A list of strings representing the file suffixes for optimized bytecode modules.
pt_br: Uma lista de strings representando os sufixos de arquivo para módulos em bytecode otimizado.

source: A list of strings representing the recognized file suffixes for bytecode modules (including the leading dot).
pt_br: Uma lista de strings representando os sufixos de arquivo reconhecidos para módulos em bytecode (incluindo com ponto no início).

source: The value is no longer dependent on ``__debug__``.
pt_br: O valor não mais depende de ``__debug__``.

source: A list of strings representing the recognized file suffixes for extension modules.
pt_br: Uma lista de strings representando os sufixos de arquivo reconhecidos para módulos de extensão.
