Repository: python/python-docs-pt-br
Catalog: library/importlib.metadata.po
Languages: pt_br

source: :mod:`!importlib.metadata` -- Accessing package metadata
pt_br: :mod:`!importlib.metadata` -- Acessando metadados do pacote

source: ``importlib.metadata`` is no longer provisional.
pt_br: ``importlib.metadata`` não é mais provisório.

source: **Source code:** :source:`Lib/importlib/metadata/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/importlib/metadata/__init__.py`

source: ``importlib.metadata`` is a library that provides access to the metadata of an installed `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, such as its entry points or its top-level names (`Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_\s, modules, if any). Built in part on Python's import system, this library intends to replace similar functionality in the `entry point API`_ and `metadata API`_ of ``pkg_resources``. Along with :mod:`importlib.resources`, this package can eliminate the need to use the older and less efficient ``pkg_resources`` package.
pt_br: ``importlib.metadata`` é uma biblioteca que fornece acesso aos metadados de um `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Import-Package>`_ instalado, como seus pontos de entrada ou seus nomes de nível superior (`Pacotes de Importação <https://packaging.python.org/pt_BR/latest/glossary/#term-Import-Package>`_, módulos, se houver). Construída em parte no sistema de importação do Python, esta biblioteca pretende substituir funcionalidades semelhantes na `API de ponto de entrada`_ e `API de metadados`_ de ``pkg_resources``. Junto com :mod:`importlib.resources`, este pacote pode eliminar a necessidade de usar o pacote ``pkg_resources`` mais antigo e menos eficiente.

source: ``importlib.metadata`` operates on third-party *distribution packages* installed into Python's ``site-packages`` directory via tools such as :pypi:`pip`. Specifically, it works with distributions with discoverable ``dist-info`` or ``egg-info`` directories, and metadata defined by the `Core metadata specifications <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_.
pt_br: ``importlib.metadata`` opera em *pacotes de distribuição* de terceiros instalados no diretório ``site-packages`` do Python através de ferramentas como :pypi:`pip`. Especificamente, ele funciona com distribuições com diretórios ``dist-info`` ou ``egg-info`` detectáveis, e metadados definidos pelas `Especificações de metadados principais <https://packaging.python.org/pt_BR/latest/specifications/core-metadata/#core-metadata>`_.

source: These are *not* necessarily equivalent to or correspond 1:1 with the top-level *import package* names that can be imported inside Python code. One *distribution package* can contain multiple *import packages* (and single modules), and one top-level *import package* may map to multiple *distribution packages* if it is a namespace package. You can use :ref:`packages_distributions() <package-distributions>` to get a mapping between them.
pt_br: Eles *não* são necessariamente equivalentes ou correspondem 1:1 aos nomes de *pacotes de importação* de nível superior que podem ser importados dentro do código Python. Um *pacote de distribuição* pode conter vários *pacotes de importação* (e módulos únicos), e um *pacote de importação* de nível superior pode ser mapeado para vários *pacotes de distribuição* se for um pacote de espaço de nomes. Você pode usar :ref:`packages_distributions() <package-distributions>` para obter um mapeamento entre eles.

source: By default, distribution metadata can live on the file system or in zip archives on :data:`sys.path`. Through an extension mechanism, the metadata can live almost anywhere.
pt_br: Por padrão, os metadados de distribuição podem residir no sistema de arquivos ou em arquivos zip em :data:`sys.path`. Através de um mecanismo de extensão, os metadados podem residir em praticamente qualquer lugar.

source: The documentation for ``importlib_metadata``, which supplies a backport of ``importlib.metadata``. This includes an `API reference <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ for this module's classes and functions, as well as a `migration guide <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ for existing users of ``pkg_resources``.
pt_br: A documentação para ``importlib_metadata``, que fornece um backport de ``importlib.metadata``. Isso inclui uma `referência de API <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ para as classes e funções deste módulo, bem como um `guia de migração <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ para usuários existentes de ``pkg_resources``.

source: Overview
pt_br: Visão Geral

source: Let's say you wanted to get the version string for a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ you've installed using ``pip``. We start by creating a virtual environment and installing something into it:
pt_br: Digamos que você queira obter a string da versão de um `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_ que você instalou usando ``pip``. Começamos criando um ambiente virtual e instalando algo nele:

source: $ python -m venv example $ source example/bin/activate (example) $ python -m pip install wheel
pt_br: $ python -m venv exemplo $ source exemplo/bin/activate (exemplo) $ python -m pip install wheel

source: You can get the version string for ``wheel`` by running the following:
pt_br: Você pode obter a string de versão para ``wheel`` executando o seguinte:

source: You can also get a collection of entry points selectable by properties of the EntryPoint (typically 'group' or 'name'), such as ``console_scripts``, ``distutils.commands`` and others. Each group contains a collection of :ref:`EntryPoint <entry-points>` objects.
pt_br: Você também pode obter uma coleção de pontos de entrada selecionáveis pelas propriedades do EntryPoint (normalmente 'group' ou 'name'), como ``console_scripts``, ``distutils.commands`` e outros. Cada grupo contém uma coleção de objetos :ref:`EntryPoint <entry-points>`.

source: You can get the :ref:`metadata for a distribution <metadata>`::
pt_br: Você pode obter os :ref:`metadados para uma distribuição <metadata>`::

source: You can also get a :ref:`distribution's version number <version>`, list its :ref:`constituent files <files>`, and get a list of the distribution's :ref:`requirements`.
pt_br: Você também pode obter uma :ref:`número da versão da distribuição <version>`, listar seus :ref:`arquivos constituintes <files>` e obter uma lista dos :ref:`requirements` da distribuição.

source: Subclass of :class:`ModuleNotFoundError` raised by several functions in this module when queried for a distribution package which is not installed in the current Python environment.
pt_br: Subclasse de :class:`ModuleNotFoundError` levantada por diversas funções neste módulo quando consultada sobre um pacote de distribuição que não está instalado no ambiente Python atual.

source: Functional API
pt_br: API funcional

source: This package provides the following functionality via its public API.
pt_br: Este pacote fornece a seguinte funcionalidade por meio de sua API pública.

source: Entry points
pt_br: Pontos de entrada

source: Returns a :class:`EntryPoints` instance describing entry points for the current environment. Any given keyword parameters are passed to the :meth:`!select` method for comparison to the attributes of the individual entry point definitions.
pt_br: Retorna uma instância de :class:`EntryPoints` descrevendo pontos de entrada para o ambiente atual. Quaisquer parâmetros nomeados fornecidos são passados para o método :meth:`!select` para comparação com os atributos das definições de pontos de entrada individuais.

source: Note: it is not currently possible to query for entry points based on their :attr:`!EntryPoint.dist` attribute (as different :class:`!Distribution` instances do not currently compare equal, even if they have the same attributes)
pt_br: Observação: atualmente não é possível consultar pontos de entrada com base no atributo :attr:`!EntryPoint.dist` (já que instâncias diferentes de :class:`!Distribution` não são comparadas como iguais, mesmo que tenham os mesmos atributos)

source: Details of a collection of installed entry points.
pt_br: Detalhes de uma coleção de pontos de entrada instalados.

source: Also provides a ``.groups`` attribute that reports all identified entry point groups, and a ``.names`` attribute that reports all identified entry point names.
pt_br: Também fornece um atributo ``.groups`` que relata todos os grupos de pontos de entrada identificados e um atributo ``.names`` que relata todos os nomes de pontos de entrada identificados.

source: Details of an installed entry point.
pt_br: Detalhes de um ponto de entrada instalado.

source: Each :class:`!EntryPoint` instance has ``.name``, ``.group``, and ``.value`` attributes and a ``.load()`` method to resolve the value. There are also ``.module``, ``.attr``, and ``.extras`` attributes for getting the components of the ``.value`` attribute, and ``.dist`` for obtaining information regarding the distribution package that provides the entry point.
pt_br: Cada instância de :class:`!EntryPoint` tem os atributos ``.name``, ``.group`` e ``.value`` e um método ``.load()`` para resolver o valor. Há também os atributos ``.module``, ``.attr`` e ``.extras`` para obter os componentes do atributo ``.value`` e ``.dist`` para obter informações sobre o pacote de distribuição que fornece o ponto de entrada.

source: Query all entry points::
pt_br: Consultar todos os pontos de entrada::

source: The :func:`!entry_points` function returns a :class:`!EntryPoints` object, a collection of all :class:`!EntryPoint` objects with ``names`` and ``groups`` attributes for convenience::
pt_br: A função :func:`!entry_points` retorna um objeto :class:`!EntryPoints`, uma coleção de todos os objetos :class:`!EntryPoint` com atributos ``names`` e ``groups`` por conveniência::

source: :class:`!EntryPoints` has a :meth:`!select` method to select entry points matching specific properties. Select entry points in the ``console_scripts`` group::
pt_br: :class:`!EntryPoints` possui um método :meth:`!select` para selecionar pontos de entrada correspondendo a propriedades específicas. Selecione pontos de entrada no grupo ``console_scripts``::

source: Equivalently, since :func:`!entry_points` passes keyword arguments through to select::
pt_br: Equivalentemente, já que :func:`!entry_points` passa argumentos nomeados para a seleção::

source: Pick out a specific script named "wheel" (found in the wheel project)::
pt_br: Escolha um script específico chamado "wheel" (encontrado no projeto wheel)::

source: Equivalently, query for that entry point during selection::
pt_br: De forma equivalente, consulte esse ponto de entrada durante a seleção::

source: Inspect the resolved entry point::
pt_br: Inspecione o ponto de entrada resolvido::

source: The ``group`` and ``name`` are arbitrary values defined by the package author and usually a client will wish to resolve all entry points for a particular group. Read `the setuptools docs <https://setuptools.pypa.io/en/latest/userguide/entry_point.html>`_ for more information on entry points, their definition, and usage.
pt_br: O ``group`` e ``name`` são valores arbitrários definidos pelo autor do pacote e normalmente um cliente desejará resolver todos os pontos de entrada para um grupo específico. Leia `a documentação do setuptools <https://setuptools.pypa.io/en/latest/userguide/entry_point.html>`_ para obter mais informações sobre pontos de entrada, sua definição e uso.

source: The "selectable" entry points were introduced in ``importlib_metadata`` 3.6 and Python 3.10. Prior to those changes, ``entry_points`` accepted no parameters and always returned a dictionary of entry points, keyed by group. With ``importlib_metadata`` 5.0 and Python 3.12, ``entry_points`` always returns an ``EntryPoints`` object. See :pypi:`backports.entry_points_selectable` for compatibility options.
pt_br: Os pontos de entrada "selecionáveis" foram introduzidos em ``importlib_metadata`` 3.6 e Python 3.10. Antes dessas mudanças, ``entry_points`` não aceitava parâmetros e sempre retornava um dicionário de pontos de entrada, chaveado por grupo. Com ``importlib_metadata`` 5.0 e Python 3.12, ``entry_points`` sempre retorna um objeto ``EntryPoints``. Veja :pypi:`backports.entry_points_selectable` para opções de compatibilidade.

source: ``EntryPoint`` objects no longer present a tuple-like interface (:meth:`~object.__getitem__`).
pt_br: Objetos ``EntryPoint`` não apresentam mais uma interface tupla ou similar (:meth:`~object.__getitem__`).

source: Distribution metadata
pt_br: Metadados de distribuição

source: Return the distribution metadata corresponding to the named distribution package as a :class:`PackageMetadata` instance.
pt_br: Retorna os metadados de distribuição correspondentes ao pacote de distribuição nomeado como uma instância de :class:`PackageMetadata`.

source: Raises :exc:`PackageNotFoundError` if the named distribution package is not installed in the current Python environment.
pt_br: Levanta :exc:`PackageNotFoundError` se o pacote de distribuição nomeado não estiver instalado no ambiente Python atual.

source: A concrete implementation of the `PackageMetadata protocol <https://importlib-metadata.readthedocs.io/en/latest/api.html#importlib_metadata.PackageMetadata>`_.
pt_br: Uma implementação concreta do `protocolo PackageMetadata <https://importlib-metadata.readthedocs.io/en/latest/api.html#importlib_metadata.PackageMetadata>`_.

source: In addition to providing the defined protocol methods and attributes, subscripting the instance is equivalent to calling the :meth:`!get` method.
pt_br: Além de fornecer os métodos e atributos de protocolo definidos, subscrever a instância é equivalente a chamar o método :meth:`!get`.

source: Every `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ includes some metadata, which you can extract using the :func:`!metadata` function::
pt_br: Cada `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_ inclui alguns metadados, que você pode extrair usando a função :func:`!metadata`::

source: The keys of the returned data structure name the metadata keywords, and the values are returned unparsed from the distribution metadata::
pt_br: As chaves da estrutura de dados retornada nomeiam as palavras reservadas dos metadados, e os valores são retornados sem análise dos metadados de distribuição::

source: :class:`PackageMetadata` also presents a :attr:`!json` attribute that returns all the metadata in a JSON-compatible form per :PEP:`566`::
pt_br: :class:`PackageMetadata` também apresenta um atributo :attr:`!json` que retorna todos os metadados em um formato compatível com JSON pela :PEP:`566`::

source: The full set of available metadata is not described here. See the PyPA `Core metadata specification <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_ for additional details.
pt_br: O conjunto completo de metadados disponíveis não é descrito aqui. Consulte a `especificação de metadados principais do PyPA <https://packaging.python.org/pt_BR/latest/specifications/core-metadata/#core-metadata>`_ para obter detalhes adicionais.

source: The ``Description`` is now included in the metadata when presented through the payload. Line continuation characters have been removed.
pt_br: A ``Description`` agora é incluída nos metadados quando apresentada através do payload. Os caracteres de continuação de linha foram removidos.

source: The ``json`` attribute was added.
pt_br: O atributo ``json`` foi adicionado.

source: Distribution versions
pt_br: Versões de distribuição

source: Return the installed distribution package `version <https://packaging.python.org/en/latest/specifications/core-metadata/#version>`__ for the named distribution package.
pt_br: Retorna a `versão <https://packaging.python.org/pt-br/latest/specifications/core-metadata/#version>`__ do pacote de distribuição instalado para o pacote de distribuição nomeado.

source: The :func:`!version` function is the quickest way to get a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_'s version number, as a string::
pt_br: A função :func:`!version` é a maneira mais rápida de obter o número de versão de um `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_, como uma string::

source: Distribution files
pt_br: Arquivos de distribuição

source: Return the full set of files contained within the named distribution package.
pt_br: Retorna o conjunto completo de arquivos contidos no pacote de distribuição nomeado.

source: Returns :const:`None` if the distribution is found but the installation database records reporting the files associated with the distribution package are missing.
pt_br: Retorna :const:`None` se a distribuição for encontrada, mas os registros do banco de dados de instalação que relatam os arquivos associados ao pacote de distribuição estiverem ausentes.

source: A :class:`pathlib.PurePath` derived object with additional ``dist``, ``size``, and ``hash`` properties corresponding to the distribution package's installation metadata for that file.
pt_br: Um objeto derivado de :class:`pathlib.PurePath` com propriedades adicionais ``dist``, ``size`` e ``hash`` correspondentes aos metadados de instalação do pacote de distribuição para esse arquivo.

source: The :func:`!files` function takes a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ name and returns all of the files installed by this distribution. Each file is reported as a :class:`PackagePath` instance. For example::
pt_br: A função :func:`!files` pega um nome `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_ e retorna todos os arquivos instalados por este distribuição. Cada arquivo é é relatado como uma instância de :class:`PackagePath`. Por exemplo::

source: Once you have the file, you can also read its contents::
pt_br: Uma vez que tenha o arquivo, você também pode ler seu conteúdo::

source: You can also use the :meth:`!locate` method to get the absolute path to the file::
pt_br: Você também pode usar o método :meth:`!locate` para obter o caminho absoluto para o arquivo::

source: In the case where the metadata file listing files (``RECORD`` or ``SOURCES.txt``) is missing, :func:`!files` will return :const:`None`. The caller may wish to wrap calls to :func:`!files` in `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ or otherwise guard against this condition if the target distribution is not known to have the metadata present.
pt_br: No caso em que o arquivo de metadados que lista os arquivos (``RECORD`` ou ``SOURCES.txt``) estiver faltando, :func:`!files` retornará :const:`None`. O chamador pode querer agrupar chamadas para :func:`!files` em `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ ou de outra forma se proteger contra isso condição se a distribuição de destino não for conhecida por ter os metadados presentes.

source: Distribution requirements
pt_br: Requisitos de distribuição

source: Return the declared dependency specifiers for the named distribution package.
pt_br: Retorna os especificadores de dependência declarados para o pacote de distribuição nomeado.

source: To get the full set of requirements for a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, use the :func:`!requires` function::
pt_br: Para obter o conjunto completo de requisitos para um `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_, use a função :func:`!requires`::

source: Mapping import to distribution packages
pt_br: Mapeando importação pra pacotes de distribuição

source: Return a mapping from the top level module and import package names found via :data:`sys.meta_path` to the names of the distribution packages (if any) that provide the corresponding files.
pt_br: Retorna um mapeamento do módulo de nível superior e importa os nomes dos pacotes encontrados via :data:`sys.meta_path` para os nomes dos pacotes de distribuição (se houver) que fornecem os arquivos correspondentes.

source: To allow for namespace packages (which may have members provided by multiple distribution packages), each top level import name maps to a list of distribution names rather than mapping directly to a single name.
pt_br: Para permitir pacotes de espaço de nomes (que podem ter membros fornecidos por vários pacotes de distribuição), cada nome de importação de nível superior é mapeado para uma lista de nomes de distribuição em vez de mapear diretamente para um único nome.

source: A convenience method to resolve the `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ name (or names, in the case of a namespace package) that provide each importable top-level Python module or `Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::
pt_br: Um método conveniente para resolver o nome do `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_ (ou nomes, no caso de um pacote de espaço de nomes) que fornece cada módulo Python de nível superior importável ou `Pacote de Importação <https://packaging.python.org/pt_BR/latest/glossary/#term-Import-Package>`_::

source: Some editable installs, `do not supply top-level names <https://github.com/pypa/packaging-problems/issues/609>`_, and thus this function is not reliable with such installs.
pt_br: Algumas instalações editáveis `não fornecem nomes de nível superior <https://github.com/pypa/packaging-problems/issues/609>`_ e, portanto, esta função não é confiável com tais instalações.

source: Distributions
pt_br: Distribuições

source: Return a :class:`Distribution` instance describing the named distribution package.
pt_br: Retorna uma instância de :class:`Distribution` descrevendo o pacote de distribuição nomeado.

source: Details of an installed distribution package.
pt_br: Detalhes de um pacote de distribuição instalado.

source: Note: different :class:`!Distribution` instances do not currently compare equal, even if they relate to the same installed distribution and accordingly have the same attributes.
pt_br: Observação: instâncias diferentes de :class:`!Distribution` não são atualmente consideradas iguais em uma comparação, mesmo que estejam relacionadas à mesma distribuição instalada e, portanto, tenham os mesmos atributos.
