Repository: python/python-docs-pt-br
Catalog: library/importlib.metadata.po
Languages: pt_br

source: While the module level API described above is the most common and convenient usage, you can get all of that information from the :class:`!Distribution` class. :class:`!Distribution` is an abstract object that represents the metadata for a Python `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_. You can get the concrete :class:`!Distribution` subclass instance for an installed distribution package by calling the :func:`distribution` function::
pt_br: Embora a API de nível de módulo descrita acima seja o uso mais comum e conveniente, você pode obter todas essas informações da classe :class:`!Distribution`. :class:`!Distribution` é um objeto abstrato que representa os metadados para um `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_ Python. Você pode obter a instância concreta de subclasse de :class:`!Distribution` para um pacote de distribuição instalado chamando a função :func:`distribution`::

source: Thus, an alternative way to get the version number is through the :class:`!Distribution` instance::
pt_br: Assim, uma forma alternativa de obter o número da versão é através da instância :class:`!Distribution`::

source: There are all kinds of additional metadata available on :class:`!Distribution` instances::
pt_br: Existem todos os tipos de metadados adicionais disponíveis em instâncias de :class:`!Distribution`::

source: For editable packages, an ``origin`` property may present :pep:`610` metadata::
pt_br: Para pacotes editáveis, uma propriedade ``origin`` pode apresentar metadados conforme a :pep:`610`::

source: >>> dist.origin.url 'file:///path/to/wheel-0.32.3.editable-py3-none-any.whl'
pt_br: >>> dist.origin.url 'file:///caminho/para/wheel-0.32.3.editable-py3-none-any.whl'

source: The ``.origin`` property was added.
pt_br: A propriedade ``.origin`` foi adicionada.

source: Distribution Discovery
pt_br: Descoberta de distribuição

source: By default, this package provides built-in support for discovery of metadata for file system and zip file `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_\s. This metadata finder search defaults to ``sys.path``, but varies slightly in how it interprets those values from how other import machinery does. In particular:
pt_br: Por padrão, este pacote fornece suporte embutido para descoberta de metadados para sistema de arquivos e arquivo zip `Pacotes de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_. Esta pesquisa do localizador de metadados tem como padrão ``sys.path``, mas varia um pouco na maneira como ela interpreta esses valores em relação a outras mecanismo de importação. Em particular:

source: ``importlib.metadata`` does not honor :class:`bytes` objects on ``sys.path``.
pt_br: ``importlib.metadata`` não honra objetos :class:`bytes` em ``sys.path``.

source: ``importlib.metadata`` will incidentally honor :py:class:`pathlib.Path` objects on ``sys.path`` even though such values will be ignored for imports.
pt_br: ``importlib.metadata`` irá incidentalmente honrar objetos :py:class:`pathlib.Path` em ``sys.path`` mesmo que tais valores sejam ignorados para importações.

source: Implementing Custom Providers
pt_br: Implementando provedores personalizados

source: ``importlib.metadata`` address two API surfaces, one for *consumers* and another for *providers*. Most users are consumers, consuming metadata provided by the packages. There are other use-cases, however, where users wish to expose metadata through some other mechanism, such as alongside a custom importer. Such a use case calls for a *custom provider*.
pt_br: ``importlib.metadata`` aborda duas superfícies de API, uma para *consumidores* e outra para *provedores*. A maioria dos usuários são consumidores, consumindo metadados fornecidos pelos pacotes. Existem outros casos de uso, no entanto, em que os usuários desejam expor metadados por meio de algum outro mecanismo, como junto com um importador personalizado. Esse caso de uso exige um *provedor personalizado*.

source: Because `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ metadata is not available through :data:`sys.path` searches, or package loaders directly, the metadata for a distribution is found through import system :ref:`finders <finders-and-loaders>`. To find a distribution package's metadata, ``importlib.metadata`` queries the list of :term:`meta path finders <meta path finder>` on :data:`sys.meta_path`.
pt_br: Como os metadados de `Pacote de Distribuição <https://packaging.python.org/pt_BR/latest/glossary/#term-Distribution-Package>`_ não estão disponíveis por meio de pesquisas a :data:`sys.path` ou carregadores de pacotes diretamente, os metadados de uma distribuição são encontrados através de :ref:`localizadores <finders-and-loaders>` do sistema de importação. Para encontrar os metadados de um pacote de distribuição, ``importlib.metadata`` consulta a lista de :term:`localizadores de metacaminho <meta path finder>` em :data:`sys.meta_path`.

source: The implementation has hooks integrated into the ``PathFinder``, serving metadata for distribution packages found on the file system.
pt_br: A implementação possui ganchos integrados ao ``PathFinder``, servindo metadados para pacotes de distribuição encontrados no sistema de arquivos.

source: The abstract class :py:class:`importlib.abc.MetaPathFinder` defines the interface expected of finders by Python's import system. ``importlib.metadata`` extends this protocol by looking for an optional ``find_distributions`` callable on the finders from :data:`sys.meta_path` and presents this extended interface as the ``DistributionFinder`` abstract base class, which defines this abstract method::
pt_br: A classe abstrata :py:class:`importlib.abc.MetaPathFinder` define a interface esperada dos localizadores pelo sistema de importação do Python. ``importlib.metadata`` estende este protocolo procurando por um chamável ``find_distributions`` opcional nos localizadores de :data:`sys.meta_path` e apresenta esta interface estendida como a classe base abstrata ``DistributionFinder``, que define este método abstrato::

source: The ``DistributionFinder.Context`` object provides ``.path`` and ``.name`` properties indicating the path to search and name to match and may supply other relevant context sought by the consumer.
pt_br: O objeto ``DistributionFinder.Context`` fornece propriedades ``.path`` e ``.name`` indicando o caminho para pesquisar e o nome a ser correspondido e pode fornecer outro contexto relevante buscado pelo consumidor.

source: In practice, to support finding distribution package metadata in locations other than the file system, subclass ``Distribution`` and implement the abstract methods. Then from a custom finder, return instances of this derived ``Distribution`` in the ``find_distributions()`` method.
pt_br: Na prática, para prover suporte à localização de metadados de pacotes de distribuição em outros locais fora do sistema de arquivos, crie uma subclasse ``Distribution`` e implemente os métodos abstratos. Então, a partir de um localizador personalizado, retorne instâncias deste derivado de ``Distribution`` no método ``find_distributions()``.

source: Example
pt_br: Exemplo

source: Imagine a custom finder that loads Python modules from a database::
pt_br: Imagine um localizador personalizado que carrega módulos Python de um banco de dados:

source: That importer now presumably provides importable modules from a database, but it provides no metadata or entry points. For this custom importer to provide metadata, it would also need to implement ``DistributionFinder``::
pt_br: Esse importador agora provavelmente fornece módulos importáveis de um banco de dados, mas não fornece metadados ou pontos de entrada. Para que este importador personalizado forneça metadados, ele também precisaria implementar ``DistributionFinder``::

source: In this way, ``query_distributions`` would return records for each distribution served by the database matching the query. For example, if ``requests-1.0`` is in the database, ``find_distributions`` would yield a ``DatabaseDistribution`` for ``Context(name='requests')`` or ``Context(name=None)``.
pt_br: Desta forma, ``query_distributions`` retornaria registros para cada distribuição servida pelo banco de dados correspondente à consulta. Por exemplo, se ``requests-1.0`` estiver no banco de dados, ``find_distributions`` produziria um ``DatabaseDistribution`` para ``Context(name='requests')`` ou ``Context(name=None)``.

source: For the sake of simplicity, this example ignores ``context.path``\. The ``path`` attribute defaults to ``sys.path`` and is the set of import paths to be considered in the search. A ``DatabaseImporter`` could potentially function without any concern for a search path. Assuming the importer does no partitioning, the "path" would be irrelevant. In order to illustrate the purpose of ``path``, the example would need to illustrate a more complex ``DatabaseImporter`` whose behavior varied depending on ``sys.path``/``PYTHONPATH``. In that case, the ``find_distributions`` should honor the ``context.path`` and only yield ``Distribution``\ s pertinent to that path.
pt_br: Por uma questão de simplicidade, este exemplo ignora ``context.path``\. O atributo ``path`` tem como padrão ``sys.path`` e é o conjunto de caminhos de importação a serem considerados na pesquisa. Um ``DatabaseImporter`` poderia funcionar potencialmente sem qualquer preocupação com um caminho de pesquisa. Supondo que o importador não faça particionamento, o caminho “path” seria irrelevante. Para ilustrar o propósito de ``path``, o exemplo precisaria ilustrar um ``DatabaseImporter`` mais complexo cujo comportamento variasse dependendo de ``sys.path``/``PYTHONPATH``. Nesse caso, ``find_distributions`` deve respeitar o ``context.path`` e produzir apenas ``Distribution``\s pertinentes a esse caminho.

source: ``DatabaseDistribution``, then, would look something like::
pt_br: ``DatabaseDistribution``, então, se pareceria com algo como:

source: class DatabaseDistribution(importlib.metadata.Distribution): def __init__(self, record): self.record = record def read_text(self, filename): """ Read a file like "METADATA" for the current distribution. """ if filename == "METADATA": return f"""Name: {self.record.name} Version: {self.record.version} """ if filename == "entry_points.txt": return "\n".join( f"""[{ep.group}]\n{ep.name}={ep.value}""" for ep in self.record.entry_points) def locate_file(self, path): raise RuntimeError("This distribution has no file system")
pt_br: class DatabaseDistribution(importlib.metadata.Distribution): def __init__(self, record): self.record = record def read_text(self, filename): """ Lê um arquivo como "METADATA" para a atual distribuição. """ if filename == "METADATA": return f"""Name: {self.record.name} Version: {self.record.version} """ if filename == "entry_points.txt": return "\n".join( f"""[{ep.group}]\n{ep.name}={ep.value}""" for ep in self.record.entry_points) def locate_file(self, path): raise RuntimeError("This distribution has no file system")

source: This basic implementation should provide metadata and entry points for packages served by the ``DatabaseImporter``, assuming that the ``record`` supplies suitable ``.name``, ``.version``, and ``.entry_points`` attributes.
pt_br: Esta implementação básica deve fornecer metadados e pontos de entrada para pacotes servidos pelo ``DatabaseImporter``, presumindo que o ``record`` forneça os atributos ``.name``, ``.version`` e ``.entry_points`` adequados.

source: The ``DatabaseDistribution`` may also provide other metadata files, like ``RECORD`` (required for ``Distribution.files``) or override the implementation of ``Distribution.files``. See the source for more inspiration.
pt_br: O ``DatabaseDistribution`` também pode fornecer outros arquivos de metadados, como ``RECORD`` (necessário para ``Distribution.files``) ou substituir a implementação de ``Distribution.files``. Veja o código-fonte para mais inspiração.
