Repository: python/python-docs-pt-br
Catalog: library/inspect.po
Languages: pt_br

source: Note that :func:`signature` and :ref:`Signature Object <inspect-signature-object>` provide the recommended API for callable introspection, and support additional behaviours (like positional-only arguments) that are sometimes encountered in extension module APIs. This function is retained primarily for use in code that needs to maintain compatibility with the Python 2 ``inspect`` module API.
pt_br: Зауважте, що :func:`signature` і :ref:`Signature Object <inspect-signature-object>` надають рекомендований API для інтроспекції з можливістю виклику та підтримують додаткові режими (наприклад, лише позиційні аргументи), які іноді зустрічаються в API модуля розширення. Ця функція зберігається головним чином для використання в коді, який потребує підтримки сумісності з API модуля ``inspect`` Python 2.

source: This function is now based on :func:`signature`, but still ignores ``__wrapped__`` attributes and includes the already bound first parameter in the signature output for bound methods.
pt_br: Ця функція тепер базується на :func:`signature`, але все ще ігнорує атрибути ``__wrapped__`` і включає вже зв’язаний перший параметр у вихідні дані підпису для зв’язаних методів.

source: This method was previously documented as deprecated in favour of :func:`signature` in Python 3.5, but that decision has been reversed in order to restore a clearly supported standard interface for single-source Python 2/3 code migrating away from the legacy :func:`getargspec` API.
pt_br: Раніше цей метод був задокументований як застарілий на користь :func:`signature` у Python 3.5, але це рішення було скасовано, щоб відновити чітко підтримуваний стандартний інтерфейс для єдиного вихідного коду Python 2/3, що переходить із застарілої версії :func:`getargspec` API.

source: Get information about arguments passed into a particular frame. A :term:`named tuple` ``ArgInfo(args, varargs, keywords, locals)`` is returned. *args* is a list of the argument names. *varargs* and *keywords* are the names of the ``*`` and ``**`` arguments or ``None``. *locals* is the locals dictionary of the given frame.
pt_br: Отримати інформацію про аргументи, передані в певний кадр. Повертається :term:`named tuple` ``ArgInfo(args, varargs, keywords, locals)``. *args* — це список імен аргументів. *varargs* і *keywords* — це імена аргументів ``*`` і ``**`` або ``None``. *locals* — це словник місцевих значень даного кадру.

source: This function was inadvertently marked as deprecated in Python 3.5.
pt_br: Ця функція була випадково позначена як застаріла в Python 3.5.

source: Format a pretty argument spec from the four values returned by :func:`getargvalues`. The format\* arguments are the corresponding optional formatting functions that are called to turn names and values into strings.
pt_br: Відформатуйте гарну специфікацію аргументу з чотирьох значень, які повертає :func:`getargvalues`. Аргументи format\* — це відповідні додаткові функції форматування, які викликаються для перетворення імен і значень у рядки.

source: Return a tuple of class cls's base classes, including cls, in method resolution order. No class appears more than once in this tuple. Note that the method resolution order depends on cls's type. Unless a very peculiar user-defined metatype is in use, cls will be the first element of the tuple.
pt_br: Повертає кортеж базових класів класу cls, включаючи cls, у порядку вирішення методів. Жоден клас не з’являється більше одного разу в цьому кортежі. Зауважте, що порядок вирішення методів залежить від типу cls. Якщо не використовується дуже специфічний метатип, визначений користувачем, cls буде першим елементом кортежу.

source: Bind the *args* and *kwds* to the argument names of the Python function or method *func*, as if it was called with them. For bound methods, bind also the first argument (typically named ``self``) to the associated instance. A dict is returned, mapping the argument names (including the names of the ``*`` and ``**`` arguments, if any) to their values from *args* and *kwds*. In case of invoking *func* incorrectly, i.e. whenever ``func(*args, **kwds)`` would raise an exception because of incompatible signature, an exception of the same type and the same or similar message is raised. For example:
pt_br: Привяжите *args* и *kwds* к именам аргументов функции или метода Python *func*, как если бы они были вызваны вместе с ними. Для связанных методов привяжите также первый аргумент (обычно называемый «self») к связанному экземпляру. Возвращается словарь, сопоставляющий имена аргументов (включая имена аргументов ``*`` и ``**``, если таковые имеются) с их значениями из *args* и *kwds*. В случае неправильного вызова *func*, т.е. всякий раз, когда ``func(*args, **kwds)`` вызывает исключение из-за несовместимой сигнатуры, возникает исключение того же типа и того же или похожего сообщения. Например:

source: Use :meth:`Signature.bind` and :meth:`Signature.bind_partial` instead.
pt_br: Замість цього використовуйте :meth:`Signature.bind` і :meth:`Signature.bind_partial`.

source: Get the mapping of external name references in a Python function or method *func* to their current values. A :term:`named tuple` ``ClosureVars(nonlocals, globals, builtins, unbound)`` is returned. *nonlocals* maps referenced names to lexical closure variables, *globals* to the function's module globals and *builtins* to the builtins visible from the function body. *unbound* is the set of names referenced in the function that could not be resolved at all given the current module globals and builtins.
pt_br: Отримайте зіставлення зовнішніх посилань на імена у функції або методі Python *func* на їхні поточні значення. Повертається :term:`named tuple` ``ClosureVars(nonlocals, globals, builtins, unbound)``. *nonlocals* відображає назви посилань на лексичні змінні закриття, *globals* на глобальні модулі функції та *builtins* на вбудовані елементи, видимі з тіла функції. *unbound* — це набір імен, на які посилається функція, які взагалі не можуть бути розпізнані з урахуванням поточних глобальних і вбудованих модулів.

source: :exc:`TypeError` is raised if *func* is not a Python function or method.
pt_br: :exc:`TypeError` виникає, якщо *func* не є функцією або методом Python.

source: Get the object wrapped by *func*. It follows the chain of :attr:`__wrapped__` attributes returning the last object in the chain.
pt_br: Оберніть об’єкт за допомогою *func*. Він слідує за ланцюжком атрибутів :attr:`__wrapped__`, повертаючи останній об’єкт у ланцюжку.

source: *stop* is an optional callback accepting an object in the wrapper chain as its sole argument that allows the unwrapping to be terminated early if the callback returns a true value. If the callback never returns a true value, the last object in the chain is returned as usual. For example, :func:`signature` uses this to stop unwrapping if any object in the chain has a ``__signature__`` attribute defined.
pt_br: *stop* — необов’язковий зворотний виклик, який приймає об’єкт у ланцюжку оболонки як єдиний аргумент, який дозволяє розгортання завершувати достроково, якщо зворотний виклик повертає справжнє значення. Якщо зворотний виклик ніколи не повертає справжнє значення, останній об’єкт у ланцюжку повертається, як зазвичай. Наприклад, :func:`signature` використовує це, щоб зупинити розгортання, якщо будь-який об’єкт у ланцюжку має визначений атрибут ``__signature__``.

source: :exc:`ValueError` is raised if a cycle is encountered.
pt_br: :exc:`ValueError` виникає, якщо зустрічається цикл.

source: Compute the annotations dict for an object.
pt_br: Calcula o dicionário de anotações para um objeto.

source: ``obj`` may be a callable, class, or module. Passing in an object of any other type raises :exc:`TypeError`.
pt_br: ``obj`` може бути викликаним, класом або модулем. Передача об’єкта будь-якого іншого типу викликає :exc:`TypeError`.

source: Returns a dict. ``get_annotations()`` returns a new dict every time it's called; calling it twice on the same object will return two different but equivalent dicts.
pt_br: Повертає dict. ``get_annotations()`` повертає новий dict під час кожного виклику; виклик його двічі для того самого об’єкта поверне два різні, але еквівалентні слова.

source: This function handles several details for you:
pt_br: Esta função cuida de vários detalhes para você:

source: If ``eval_str`` is true, values of type ``str`` will be un-stringized using :func:`eval`. This is intended for use with stringized annotations (``from __future__ import annotations``).
pt_br: Если ``eval_str`` имеет значение true, значения типа ``str`` будут преобразованы в строки с использованием :func:`eval`. Это предназначено для использования со строковыми аннотациями («из __future__ import annotations»).

source: If ``obj`` doesn't have an annotations dict, returns an empty dict. (Functions and methods always have an annotations dict; classes, modules, and other types of callables may not.)
pt_br: Якщо ``obj`` не має dict анотацій, повертає порожній dict. (Функції та методи завжди мають анотації dict; класи, модулі та інші типи викликів можуть не мати.)

source: Ignores inherited annotations on classes. If a class doesn't have its own annotations dict, returns an empty dict.
pt_br: Ігнорує успадковані анотації до класів. Якщо клас не має власного dict анотацій, повертає порожній dict.

source: All accesses to object members and dict values are done using ``getattr()`` and ``dict.get()`` for safety.
pt_br: Todos os acessos aos membros do objeto e valores do dicionário são feitos usando ``getattr()`` e ``dict.get()`` por segurança.

source: Always, always, always returns a freshly created dict.
pt_br: Всегда, всегда, всегда возвращает только что созданный словарь.

source: ``eval_str`` controls whether or not values of type ``str`` are replaced with the result of calling :func:`eval` on those values:
pt_br: ``eval_str`` контролирует, заменяются ли значения типа ``str`` результатом вызова :func:`eval` для этих значений:

source: If eval_str is true, :func:`eval` is called on values of type ``str``. (Note that ``get_annotations`` doesn't catch exceptions; if :func:`eval` raises an exception, it will unwind the stack past the ``get_annotations`` call.)
pt_br: Если eval_str имеет значение true, :func:`eval` вызывается для значений типа ``str``. (Обратите внимание, что ``get_annotations`` не перехватывает исключения; если :func:`eval` вызывает исключение, он раскручивает стек после вызова ``get_annotations``.)

source: If eval_str is false (the default), values of type ``str`` are unchanged.
pt_br: Якщо eval_str має значення false (за замовчуванням), значення типу ``str`` не змінюються.

source: ``globals`` and ``locals`` are passed in to :func:`eval`; see the documentation for :func:`eval` for more information. If ``globals`` or ``locals`` is ``None``, this function may replace that value with a context-specific default, contingent on ``type(obj)``:
pt_br: ``globals`` и ``locals`` передаются в :func:`eval`; дополнительную информацию смотрите в документации по :func:`eval`. Если ``globals`` или ``locals`` имеют значение ``None``, эта функция может заменить это значение контекстно-зависимым значением по умолчанию, зависящим от ``type(obj)``:

source: If ``obj`` is a module, ``globals`` defaults to ``obj.__dict__``.
pt_br: Якщо ``obj`` є модулем, ``globals`` за замовчуванням ``obj.__dict__``.

source: If ``obj`` is a class, ``globals`` defaults to ``sys.modules[obj.__module__].__dict__`` and ``locals`` defaults to the ``obj`` class namespace.
pt_br: Якщо ``obj`` є класом, ``globals`` за замовчуванням ``sys.modules[obj.__module__].__dict__``, а ``locals`` за замовчуванням має простір імен класу ``obj``.

source: If ``obj`` is a callable, ``globals`` defaults to :attr:`obj.__globals__ <function.__globals__>`, although if ``obj`` is a wrapped function (using :func:`functools.update_wrapper`) it is first unwrapped.
pt_br: Если obj`` является вызываемой функцией, ``globals`` по умолчанию имеет значение :attr:`obj.__globals__ <function.__globals__>`, хотя если ``obj`` является обернутой функцией (с использованием :func:`functools. update_wrapper`) сначала разворачивается.

source: Calling ``get_annotations`` is best practice for accessing the annotations dict of any object. See :ref:`annotations-howto` for more information on annotations best practices.
pt_br: Виклик ``get_annotations`` є найкращою практикою для доступу до dict анотацій будь-якого об’єкта. Дивіться :ref:`annotations-howto` для отримання додаткової інформації про найкращі практики анотацій.

source: The interpreter stack
pt_br: A pilha to interpretador

source: Some of the following functions return :class:`FrameInfo` objects. For backwards compatibility these objects allow tuple-like operations on all attributes except ``positions``. This behavior is considered deprecated and may be removed in the future.
pt_br: Некоторые из следующих функций возвращают объекты :class:`FrameInfo`. В целях обратной совместимости эти объекты допускают операции, подобные кортежам, со всеми атрибутами, кроме позиций. Такое поведение считается устаревшим и может быть удалено в будущем.

source: The :ref:`frame object <frame-objects>` that the record corresponds to.
pt_br: Объект :ref:`frame <frame-objects>`, которому соответствует запись.

source: The file name associated with the code being executed by the frame this record corresponds to.
pt_br: Имя файла, связанное с кодом, выполняемым кадром, которому соответствует эта запись.

source: The line number of the current line associated with the code being executed by the frame this record corresponds to.
pt_br: Номер текущей строки, связанной с кодом, исполняемым кадром, которому соответствует эта запись.

source: The function name that is being executed by the frame this record corresponds to.
pt_br: Имя функции, которая выполняется кадром, которому соответствует эта запись.

source: A list of lines of context from the source code that's being executed by the frame this record corresponds to.
pt_br: Список строк контекста из исходного кода, который выполняется кадром, которому соответствует эта запись.

source: The index of the current line being executed in the :attr:`code_context` list.
pt_br: Индекс текущей исполняемой строки в списке :attr:`code_context`.

source: A :class:`dis.Positions` object containing the start line number, end line number, start column offset, and end column offset associated with the instruction being executed by the frame this record corresponds to.
pt_br: Объект :class:`dis.Positions`, содержащий номер начальной строки, номер конечной строки, смещение начального столбца и смещение конечного столбца, связанное с инструкцией, выполняемой кадром, которому соответствует эта запись.

source: Return a :term:`named tuple` instead of a :class:`tuple`.
pt_br: Верните :term:`named tuple` вместо :class:`tuple`.

source: :class:`!FrameInfo` is now a class instance (that is backwards compatible with the previous :term:`named tuple`).
pt_br: :class:`!FrameInfo` теперь является экземпляром класса (который обратно совместим с предыдущим :term:`named tuple`).

source: The file name associated with the code being executed by the frame this traceback corresponds to.
pt_br: Имя файла, связанное с кодом, выполняемым кадром, которому соответствует эта обратная трассировка.

source: The line number of the current line associated with the code being executed by the frame this traceback corresponds to.
pt_br: Номер текущей строки, связанной с кодом, выполняемым кадром, которому соответствует эта обратная трассировка.

source: The function name that is being executed by the frame this traceback corresponds to.
pt_br: Имя функции, которая выполняется кадром, которому соответствует эта обратная трассировка.

source: A list of lines of context from the source code that's being executed by the frame this traceback corresponds to.
pt_br: Список строк контекста из исходного кода, который выполняется кадром, которому соответствует эта обратная трассировка.

source: A :class:`dis.Positions` object containing the start line number, end line number, start column offset, and end column offset associated with the instruction being executed by the frame this traceback corresponds to.
pt_br: Объект :class:`dis.Positions`, содержащий номер начальной строки, номер конечной строки, смещение начального столбца и смещение конечного столбца, связанное с инструкцией, выполняемой кадром, которому соответствует эта обратная трассировка.

source: :class:`!Traceback` is now a class instance (that is backwards compatible with the previous :term:`named tuple`).
pt_br: :class:`!Traceback` теперь является экземпляром класса (который обратно совместим с предыдущим :term:`named tuple`).

source: Keeping references to frame objects, as found in the first element of the frame records these functions return, can cause your program to create reference cycles. Once a reference cycle has been created, the lifespan of all objects which can be accessed from the objects which form the cycle can become much longer even if Python's optional cycle detector is enabled. If such cycles must be created, it is important to ensure they are explicitly broken to avoid the delayed destruction of objects and increased memory consumption which occurs.
pt_br: Зберігання посилань на об’єкти фрейму, які знаходяться в першому елементі фреймових записів, які повертаються цими функціями, може призвести до того, що ваша програма створить цикли посилань. Після створення еталонного циклу тривалість життя всіх об’єктів, до яких можна отримати доступ з об’єктів, що утворюють цикл, може стати набагато довшим, навіть якщо ввімкнено додатковий детектор циклу Python. Якщо такі цикли необхідно створити, важливо переконатися, що вони явно розірвані, щоб уникнути затримки руйнування об’єктів і збільшення споживання пам’яті, яке відбувається.

source: Though the cycle detector will catch these, destruction of the frames (and local variables) can be made deterministic by removing the cycle in a :keyword:`finally` clause. This is also important if the cycle detector was disabled when Python was compiled or using :func:`gc.disable`. For example::
pt_br: Хоча детектор циклу вловить їх, знищення кадрів (та локальних змінних) можна зробити детермінованим, видаливши цикл у реченні :keyword:`finally`. Це також важливо, якщо детектор циклу було вимкнено під час компіляції Python або використання :func:`gc.disable`. Наприклад::

source: If you want to keep the frame around (for example to print a traceback later), you can also break reference cycles by using the :meth:`frame.clear` method.
pt_br: Якщо ви хочете зберегти фрейм (наприклад, щоб пізніше надрукувати трасування), ви також можете розірвати цикли посилань за допомогою методу :meth:`frame.clear`.

source: The optional *context* argument supported by most of these functions specifies the number of lines of context to return, which are centered around the current line.
pt_br: Необов’язковий аргумент *context*, який підтримується більшістю цих функцій, визначає кількість рядків контексту для повернення, які розташовані навколо поточного рядка.

source: Get information about a frame or traceback object. A :class:`Traceback` object is returned.
pt_br: Получите информацию о кадре или объекте трассировки. Возвращается объект :class:`Traceback`.

source: A :class:`Traceback` object is returned instead of a named tuple.
pt_br: Вместо именованного кортежа возвращается объект :class:`Traceback`.

source: Get a list of :class:`FrameInfo` objects for a frame and all outer frames. These frames represent the calls that lead to the creation of *frame*. The first entry in the returned list represents *frame*; the last entry represents the outermost call on *frame*'s stack.
pt_br: Получите список объектов :class:`FrameInfo` для фрейма и всех внешних фреймов. Эти кадры представляют собой вызовы, которые приводят к созданию *frame*. Первая запись в возвращаемом списке представляет *frame*; последняя запись представляет собой самый внешний вызов в стеке *frame*.

source: A list of :term:`named tuples <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)`` is returned.
pt_br: Повертається список :term:`іменованих кортежів <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)`` повертається.

source: A list of :class:`FrameInfo` objects is returned.
pt_br: Возвращается список объектов :class:`FrameInfo`.

source: Get a list of :class:`FrameInfo` objects for a traceback's frame and all inner frames. These frames represent calls made as a consequence of *frame*. The first entry in the list represents *traceback*; the last entry represents where the exception was raised.
pt_br: Получите список объектов :class:`FrameInfo` для фрейма трассировки и всех внутренних фреймов. Эти кадры представляют собой вызовы, сделанные вследствие *frame*. Первая запись в списке представляет *traceback*; последняя запись указывает место возникновения исключения.

source: Return the frame object for the caller's stack frame.
pt_br: Повертає об’єкт кадру для кадру стека абонента.

source: This function relies on Python stack frame support in the interpreter, which isn't guaranteed to exist in all implementations of Python. If running in an implementation without Python stack frame support this function returns ``None``.
pt_br: Ця функція покладається на підтримку фрейму стека Python в інтерпретаторі, який не гарантовано існує в усіх реалізаціях Python. Якщо ця функція працює в реалізації без підтримки фрейму стека Python, ця функція повертає ``None``.

source: Return a list of :class:`FrameInfo` objects for the caller's stack. The first entry in the returned list represents the caller; the last entry represents the outermost call on the stack.
pt_br: Возвращает список объектов :class:`FrameInfo` для стека вызывающего объекта. Первая запись в возвращаемом списке представляет вызывающего абонента; последняя запись представляет собой самый внешний вызов в стеке.

source: Return a list of :class:`FrameInfo` objects for the stack between the current frame and the frame in which an exception currently being handled was raised in. The first entry in the list represents the caller; the last entry represents where the exception was raised.
pt_br: Возвращает список объектов :class:`FrameInfo` для стека между текущим кадром и кадром, в котором возникло обрабатываемое в данный момент исключение. Первая запись в списке представляет вызывающую сторону; последняя запись указывает место возникновения исключения.

source: Fetching attributes statically
pt_br: Отримання атрибутів статично

source: Both :func:`getattr` and :func:`hasattr` can trigger code execution when fetching or checking for the existence of attributes. Descriptors, like properties, will be invoked and :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` may be called.
pt_br: И :func:`getattr`, и :func:`hasattr` могут инициировать выполнение кода при получении или проверке существования атрибутов. Дескрипторы, как и свойства, будут вызываться и могут вызываться :meth:`~object.__getattr__` и :meth:`~object.__getattribute__`.

source: For cases where you want passive introspection, like documentation tools, this can be inconvenient. :func:`getattr_static` has the same signature as :func:`getattr` but avoids executing code when it fetches attributes.
pt_br: У випадках, коли вам потрібен пасивний самоаналіз, наприклад інструменти документування, це може бути незручно. :func:`getattr_static` має такий самий підпис, як і :func:`getattr`, але уникає виконання коду, коли він отримує атрибути.
