Repository: python/python-docs-pt-br
Catalog: library/inspect.po
Languages: pt_br

source: :mod:`!inspect` --- Inspect live objects
pt_br: :mod:`!inspect` --- Осмотр живых объектов

source: **Source code:** :source:`Lib/inspect.py`
pt_br: **Código-fonte:** :source:`Lib/inspect.py`

source: The :mod:`inspect` module provides several useful functions to help get information about live objects such as modules, classes, methods, functions, tracebacks, frame objects, and code objects. For example, it can help you examine the contents of a class, retrieve the source code of a method, extract and format the argument list for a function, or get all the information you need to display a detailed traceback.
pt_br: Модуль :mod:`inspect` надає кілька корисних функцій, які допомагають отримати інформацію про живі об’єкти, такі як модулі, класи, методи, функції, відстеження, об’єкти фрейму та об’єкти коду. Наприклад, це може допомогти вам вивчити вміст класу, отримати вихідний код методу, витягти та відформатувати список аргументів для функції або отримати всю інформацію, необхідну для відображення детального відстеження.

source: There are four main kinds of services provided by this module: type checking, getting source code, inspecting classes and functions, and examining the interpreter stack.
pt_br: Цей модуль надає чотири основні види послуг: перевірка типу, отримання вихідного коду, перевірка класів і функцій і перевірка стека інтерпретатора.

source: Types and members
pt_br: Tipos e membros

source: The :func:`getmembers` function retrieves the members of an object such as a class or module. The functions whose names begin with "is" are mainly provided as convenient choices for the second argument to :func:`getmembers`. They also help you determine when you can expect to find the following special attributes (see :ref:`import-mod-attrs` for module attributes):
pt_br: Функция :func:`getmembers` извлекает члены объекта, такого как класс или модуль. Функции, имена которых начинаются с «is», в основном предоставляются в качестве удобного выбора для второго аргумента :func:`getmembers`. Они также помогут вам определить, когда вы можете ожидать появления следующих специальных атрибутов (см. :ref:`import-mod-attrs` для атрибутов модуля):

source: Type
pt_br: Tipo

source: Attribute
pt_br: Atributo

source: Description
pt_br: Descrição

source: class
pt_br: classe

source: documentation string
pt_br: string de documentação

source: name with which this class was defined
pt_br: nome com o qual esta classe foi definida

source: qualified name
pt_br: nome qualificado

source: name of module in which this class was defined
pt_br: nome do módulo no qual esta classe foi definida

source: A tuple containing the :ref:`type parameters <type-params>` of a generic class
pt_br: Кортеж, содержащий параметры типа <type-params>` универсального класса.

source: method
pt_br: método

source: name with which this method was defined
pt_br: nome com o qual este método foi definido

source: function object containing implementation of method
pt_br: objeto função contendo implementação de método

source: instance to which this method is bound, or ``None``
pt_br: instância para o qual este método está vinculado, ou ``None``.

source: name of module in which this method was defined
pt_br: nome do módulo no qual este método foi definido

source: function
pt_br: função

source: name with which this function was defined
pt_br: nome com o qual esta função foi definida

source: code object containing compiled function :term:`bytecode`
pt_br: об'єкт коду, що містить скомпільовану функцію :term:`bytecode`

source: tuple of any default values for positional or keyword parameters
pt_br: кортеж із будь-якими значеннями за замовчуванням для позиційних або ключових параметрів

source: mapping of any default values for keyword-only parameters
pt_br: відображення будь-яких значень за замовчуванням для параметрів, які містять лише ключові слова

source: global namespace in which this function was defined
pt_br: глобальний простір імен, у якому була визначена ця функція

source: builtins namespace
pt_br: вбудований простір імен

source: mapping of parameters names to annotations; ``"return"`` key is reserved for return annotations.
pt_br: зіставлення назв параметрів з анотаціями; Ключ ``"return"`` зарезервовано для анотацій повернення.

source: A tuple containing the :ref:`type parameters <type-params>` of a generic function
pt_br: Кортеж, содержащий параметры типа <type-params>` универсальной функции.

source: name of module in which this function was defined
pt_br: ім'я модуля, в якому була визначена ця функція

source: frame object at this level
pt_br: кадрувати об’єкт на цьому рівні

source: index of last attempted instruction in bytecode
pt_br: індекс останньої спроби вказівки в байт-коді

source: current line number in Python source code
pt_br: номер поточного рядка у вихідному коді Python

source: next inner traceback object (called by this level)
pt_br: наступний внутрішній об'єкт трасування (викликається цим рівнем)

source: frame
pt_br: quadro

source: next outer frame object (this frame's caller)
pt_br: наступний зовнішній об'єкт фрейму (виклик цього фрейму)

source: builtins namespace seen by this frame
pt_br: вбудований простір імен, видимий цим фреймом

source: code object being executed in this frame
pt_br: об'єкт коду, який виконується в цьому кадрі

source: global namespace seen by this frame
pt_br: глобальний простір імен, видимий цим кадром

source: local namespace seen by this frame
pt_br: локальний простір імен, видимий цим кадром

source: tracing function for this frame, or ``None``
pt_br: функція трасування для цього кадру або ``None``

source: code
pt_br: código

source: number of arguments (not including keyword only arguments, \* or \*\* args)
pt_br: кількість аргументів (не враховуючи лише аргументи ключового слова, \* або \*\* аргументи)

source: string of raw compiled bytecode
pt_br: рядок необробленого скомпільованого байт-коду

source: tuple of names of cell variables (referenced by containing scopes)
pt_br: кортеж імен змінних комірки (на які посилаються області, що містять)

source: tuple of constants used in the bytecode
pt_br: кортеж констант, що використовуються в байт-коді

source: name of file in which this code object was created
pt_br: ім'я файлу, в якому створено цей об'єкт коду

source: number of first line in Python source code
pt_br: номер першого рядка у вихідному коді Python

source: bitmap of ``CO_*`` flags, read more :ref:`here <inspect-module-co-flags>`
pt_br: растрова карта прапорів ``CO_*``, читайте більше :ref:`тут <inspect-module-co-flags>`

source: encoded mapping of line numbers to bytecode indices
pt_br: кодоване відображення номерів рядків в індекси байт-коду

source: tuple of names of free variables (referenced via a function's closure)
pt_br: кортеж імен вільних змінних (на які посилаються через закриття функції)

source: number of positional only arguments
pt_br: кількість лише позиційних аргументів

source: number of keyword only arguments (not including \*\* arg)
pt_br: кількість аргументів лише для ключових слів (не враховуючи аргумент \*\*)

source: name with which this code object was defined
pt_br: ім'я, з яким було визначено цей об'єкт коду

source: fully qualified name with which this code object was defined
pt_br: полное имя, с которым был определен этот объект кода

source: tuple of names other than arguments and function locals
pt_br: кортеж імен, відмінних від аргументів і локальних параметрів функції

source: number of local variables
pt_br: кількість локальних змінних

source: virtual machine stack space required
pt_br: необхідний простір у стеку віртуальної машини

source: tuple of names of arguments and local variables
pt_br: кортеж імен аргументів і локальних змінних

source: generator
pt_br: gerador

source: name
pt_br: nome

source: is the generator running?
pt_br: чи працює генератор?

source: object being iterated by ``yield from``, or ``None``
pt_br: об’єкт повторюється за допомогою ``yield from`` або ``None``

source: async generator
pt_br: асинхронный генератор

source: object being awaited on, or ``None``
pt_br: об'єкт, який очікується, або ``None``

source: coroutine
pt_br: corrotina

source: is the coroutine running?
pt_br: чи виконується співпрограма?

source: where coroutine was created, or ``None``. See |coroutine-origin-link|
pt_br: де була створена співпрограма, або ``None``. Див. |coroutine-origin-link|

source: original name of this function or method
pt_br: оригінальна назва цієї функції або методу

source: instance to which a method is bound, or ``None``
pt_br: екземпляр, до якого прив’язаний метод, або ``None``

source: Add ``__qualname__`` and ``gi_yieldfrom`` attributes to generators.
pt_br: Додайте атрибути ``__qualname__`` і ``gi_yieldfrom`` до генераторів.

source: The ``__name__`` attribute of generators is now set from the function name, instead of the code name, and it can now be modified.
pt_br: Атрибут ``__name__`` генераторів тепер встановлюється з імені функції, а не з кодового імені, і тепер його можна змінювати.

source: Add ``cr_origin`` attribute to coroutines.
pt_br: Додайте атрибут ``cr_origin`` до співпрограм.

source: Add ``__builtins__`` attribute to functions.
pt_br: Додайте атрибут ``__builtins__`` до функцій.

source: Return all the members of an object in a list of ``(name, value)`` pairs sorted by name. If the optional *predicate* argument—which will be called with the ``value`` object of each member—is supplied, only members for which the predicate returns a true value are included.
pt_br: Повертає всі члени об’єкта в списку пар ``(ім’я, значення)``, відсортованих за назвою. Якщо вказано необов’язковий аргумент *предикат*, який буде викликано з об’єктом ``значення`` кожного члена, будуть включені лише ті члени, для яких предикат повертає справжнє значення.

source: :func:`getmembers` will only return class attributes defined in the metaclass when the argument is a class and those attributes have been listed in the metaclass' custom :meth:`~object.__dir__`.
pt_br: :func:`getmembers` будет возвращать атрибуты класса, определенные в метаклассе, только если аргументом является класс и эти атрибуты перечислены в пользовательском :meth:`~object.__dir__` метакласса.

source: Return all the members of an object in a list of ``(name, value)`` pairs sorted by name without triggering dynamic lookup via the descriptor protocol, __getattr__ or __getattribute__. Optionally, only return members that satisfy a given predicate.
pt_br: Возвращает все члены объекта в списке пар ``(имя, значение)``, отсортированных по имени, без запуска динамического поиска через протокол дескриптора __getattr__ или __getattribute__. При необходимости возвращайте только те члены, которые удовлетворяют заданному предикату.

source: :func:`getmembers_static` may not be able to retrieve all members that getmembers can fetch (like dynamically created attributes) and may find members that getmembers can't (like descriptors that raise AttributeError). It can also return descriptor objects instead of instance members in some cases.
pt_br: :func:`getmembers_static` может быть не в состоянии получить все члены, которые getmembers может получить (например, динамически созданные атрибуты), и может найти элементы, которые getmembers не может (например, дескрипторы, которые вызывают AttributeError). В некоторых случаях он также может возвращать объекты дескриптора вместо членов экземпляра.

source: Return the name of the module named by the file *path*, without including the names of enclosing packages. The file extension is checked against all of the entries in :func:`importlib.machinery.all_suffixes`. If it matches, the final path component is returned with the extension removed. Otherwise, ``None`` is returned.
pt_br: Повертає ім’я модуля, названого *шляхом* до файлу, без назв пакетів, що входять до нього. Розширення файлу перевіряється на всі записи в :func:`importlib.machinery.all_suffixes`. Якщо він збігається, остаточний компонент шляху повертається з видаленим розширенням. В іншому випадку повертається ``None``.

source: Note that this function *only* returns a meaningful name for actual Python modules - paths that potentially refer to Python packages will still return ``None``.
pt_br: Зауважте, що ця функція *тільки* повертає значущу назву для фактичних модулів Python - шляхи, які потенційно посилаються на пакети Python, все одно повертатимуть ``None``.

source: The function is based directly on :mod:`importlib`.
pt_br: Функція базується безпосередньо на :mod:`importlib`.

source: Return ``True`` if the object is a module.
pt_br: Повертає ``True``, якщо об’єкт є модулем.

source: Return ``True`` if the object is a class, whether built-in or created in Python code.
pt_br: Повертає ``True``, якщо об’єкт є класом, вбудованим чи створеним у коді Python.

source: Return ``True`` if the object is a bound method written in Python.
pt_br: Повертає ``True``, якщо об’єкт є зв’язаним методом, написаним на Python.

source: Return ``True`` if the object is a Python function, which includes functions created by a :term:`lambda` expression.
pt_br: Повертає ``True``, якщо об’єкт є функцією Python, яка включає функції, створені виразом :term:`lambda`.

source: Return ``True`` if the object is a Python generator function.
pt_br: Повертає ``True``, якщо об’єкт є функцією генератора Python.

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a Python generator function.
pt_br: Функції, загорнуті в :func:`functools.partial`, тепер повертають ``True``, якщо загорнута функція є функцією генератора Python.

source: Return ``True`` if the object is a generator.
pt_br: Повертає ``True``, якщо об’єкт є генератором.

source: Return ``True`` if the object is a :term:`coroutine function` (a function defined with an :keyword:`async def` syntax), a :func:`functools.partial` wrapping a :term:`coroutine function`, or a sync function marked with :func:`markcoroutinefunction`.
pt_br: Возвращает ``True``, если объект представляет собой :term:`coroutine function` (функция, определенная с помощью :keyword:`async def` синтаксиса), :func:`functools.partial`, обертывающий :term:`coroutine function` или функцию синхронизации, отмеченную :func:`markcoroutinefunction`.

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is a :term:`coroutine function`.
pt_br: Функції, загорнуті в :func:`functools.partial`, тепер повертають ``True``, якщо загорнута функція є :term:`coroutine function`.

source: Sync functions marked with :func:`markcoroutinefunction` now return ``True``.
pt_br: Функции синхронизации, отмеченные :func:`markcoroutinefunction`, теперь возвращают ``True``.

source: Decorator to mark a callable as a :term:`coroutine function` if it would not otherwise be detected by :func:`iscoroutinefunction`.
pt_br: Декоратор, чтобы пометить вызываемый объект как :term:`coroutine function`, если иначе он не был бы обнаружен :func:`iscoroutinefunction`.

source: This may be of use for sync functions that return a :term:`coroutine`, if the function is passed to an API that requires :func:`iscoroutinefunction`.
pt_br: Это может быть полезно для функций синхронизации, которые возвращают :term:`coroutine`, если функция передается в API, которому требуется :func:`iscoroutinefunction`.

source: When possible, using an :keyword:`async def` function is preferred. Also acceptable is calling the function and testing the return with :func:`iscoroutine`.
pt_br: Когда это возможно, предпочтительнее использовать функцию :keyword:`async def`. Также приемлемым является вызов функции и проверка возврата с помощью :func:`iscoroutine`.

source: Return ``True`` if the object is a :term:`coroutine` created by an :keyword:`async def` function.
pt_br: Повертає ``True``, якщо об’єкт є :term:`coroutine`, створеною функцією :keyword:`async def`.

source: Return ``True`` if the object can be used in :keyword:`await` expression.
pt_br: Повертає ``True``, якщо об’єкт можна використовувати у виразі :keyword:`await`.

source: Can also be used to distinguish generator-based coroutines from regular generators:
pt_br: Также может использоваться для отличия сопрограмм на основе генератора от обычных генераторов:

source: Return ``True`` if the object is an :term:`asynchronous generator` function, for example:
pt_br: Верните True, если объект является функцией асинхронного генератора, например:

source: Functions wrapped in :func:`functools.partial` now return ``True`` if the wrapped function is an :term:`asynchronous generator` function.
pt_br: Функции, заключенные в :func:`functools.partial`, теперь возвращают ``True``, если обернутая функция является функцией :term:`асинхронного генератора`.

source: Return ``True`` if the object is an :term:`asynchronous generator iterator` created by an :term:`asynchronous generator` function.
pt_br: Повертає ``True``, якщо об’єкт є :term:`asynchronous generator iterator`, створеним функцією :term:`asynchronous generator`.

source: Return ``True`` if the object is a traceback.
pt_br: Повертає ``True``, якщо об’єкт є трасуванням.

source: Return ``True`` if the object is a frame.
pt_br: Повертає ``True``, якщо об’єкт є фреймом.

source: Return ``True`` if the object is a code.
pt_br: Повертає ``True``, якщо об’єкт є кодом.

source: Return ``True`` if the object is a built-in function or a bound built-in method.
pt_br: Повертає ``True``, якщо об’єкт є вбудованою функцією або зв’язаним вбудованим методом.

source: Return ``True`` if the type of object is a :class:`~types.MethodWrapperType`.
pt_br: Возвращает ``True``, если тип объекта — :class:`~types.MethodWrapperType`.

source: These are instances of :class:`~types.MethodWrapperType`, such as :meth:`~object.__str__`, :meth:`~object.__eq__` and :meth:`~object.__repr__`.
pt_br: Это экземпляры :class:`~types.MethodWrapperType`, такие как :meth:`~object.__str__`, :meth:`~object.__eq__` и :meth:`~object.__repr__`.

source: Return ``True`` if the object is a user-defined or built-in function or method.
pt_br: Повертає ``True``, якщо об’єкт є визначеною користувачем або вбудованою функцією чи методом.

source: Return ``True`` if the object is an abstract base class.
pt_br: Повертає ``True``, якщо об’єкт є абстрактним базовим класом.

source: Return ``True`` if the object is a method descriptor, but not if :func:`ismethod`, :func:`isclass`, :func:`isfunction` or :func:`isbuiltin` are true.
pt_br: Повертає ``True``, якщо об’єкт є дескриптором методу, але не якщо :func:`ismethod`, :func:`isclass`, :func:`isfunction` або :func:`isbuiltin` є істинними.

source: Methods implemented via descriptors that also pass one of the other tests return ``False`` from the :func:`ismethoddescriptor` test, simply because the other tests promise more -- you can, e.g., count on having the :attr:`~method.__func__` attribute (etc) when an object passes :func:`ismethod`.
pt_br: Методы, реализованные через дескрипторы, которые также проходят один из других тестов, возвращают значение False из теста :func:`ismethoddescriptor` просто потому, что другие тесты обещают больше - вы можете, например, рассчитывать на наличие :attr:` Атрибут ~method.__func__` (и т. д.), когда объект передает :func:`ismethod`.

source: Return ``True`` if the object is a data descriptor.
pt_br: Повертає ``True``, якщо об’єкт є дескриптором даних.

source: Data descriptors have a :attr:`~object.__set__` or a :attr:`~object.__delete__` method. Examples are properties (defined in Python), getsets, and members. The latter two are defined in C and there are more specific tests available for those types, which is robust across Python implementations. Typically, data descriptors will also have :attr:`~definition.__name__` and :attr:`!__doc__` attributes (properties, getsets, and members have both of these attributes), but this is not guaranteed.
pt_br: Дескрипторы данных имеют метод :attr:`~object.__set__` или :attr:`~object.__delete__`. Примерами являются свойства (определенные в Python), наборы данных и члены. Последние два определены в C, и для этих типов доступны более конкретные тесты, которые устойчивы во всех реализациях Python. Обычно дескрипторы данных также имеют атрибуты :attr:`~definition.__name__` и :attr:`!__doc__` (свойства, getsets и члены имеют оба этих атрибута), но это не гарантируется.

source: Return ``True`` if the object is a getset descriptor.
pt_br: Повертає ``True``, якщо об’єкт є дескриптором getset.

source: getsets are attributes defined in extension modules via :c:type:`PyGetSetDef` structures. For Python implementations without such types, this method will always return ``False``.
pt_br: getsets — це атрибути, визначені в модулях розширення за допомогою структур :c:type:`PyGetSetDef`. Для реалізацій Python без таких типів цей метод завжди повертатиме ``False``.

source: Return ``True`` if the object is a member descriptor.
pt_br: Повертає ``True``, якщо об’єкт є дескриптором-членом.

source: Member descriptors are attributes defined in extension modules via :c:type:`PyMemberDef` structures. For Python implementations without such types, this method will always return ``False``.
pt_br: Дескриптори членів — це атрибути, визначені в модулях розширення за допомогою структур :c:type:`PyMemberDef`. Для реалізацій Python без таких типів цей метод завжди повертатиме ``False``.

source: Retrieving source code
pt_br: Отримання вихідного коду

source: Get the documentation string for an object, cleaned up with :func:`cleandoc`. If the documentation string for an object is not provided and the object is a class, a method, a property or a descriptor, retrieve the documentation string from the inheritance hierarchy. Return ``None`` if the documentation string is invalid or missing.
pt_br: Отримайте рядок документації для об’єкта, очищений за допомогою :func:`cleandoc`. Якщо рядок документації для об’єкта не надано, а об’єкт є класом, методом, властивістю або дескриптором, отримайте рядок документації з ієрархії успадкування. Повертає ``None``, якщо рядок документації недійсний або відсутній.

source: Documentation strings are now inherited if not overridden.
pt_br: Strings de documentação agora são herdadas, se não forem sobrescritas.

source: Return in a single string any lines of comments immediately preceding the object's source code (for a class, function, or method), or at the top of the Python source file (if the object is a module). If the object's source code is unavailable, return ``None``. This could happen if the object has been defined in C or the interactive shell.
pt_br: Повертайте в одному рядку будь-які рядки коментарів безпосередньо перед вихідним кодом об’єкта (для класу, функції чи методу) або у верхній частині вихідного файлу Python (якщо об’єкт є модулем). Якщо вихідний код об’єкта недоступний, поверніть ``None``. Це може статися, якщо об’єкт було визначено в C або інтерактивній оболонці.

source: Return the name of the (text or binary) file in which an object was defined. This will fail with a :exc:`TypeError` if the object is a built-in module, class, or function.
pt_br: Retorna o nome do arquivo (texto ou binário) no qual um objeto foi definido. Isso falhará com um :exc:`TypeError` se o objeto for um módulo, classe ou função embutidos.

source: Try to guess which module an object was defined in. Return ``None`` if the module cannot be determined.
pt_br: Спробуйте вгадати, у якому модулі було визначено об’єкт. Поверніть ``None``, якщо модуль не можна визначити.
