Repository: python/python-docs-pt-br
Catalog: library/json.po
Languages: pt_br

source: :mod:`!json` --- JSON encoder and decoder
pt_br: :mod:`!json` --- Codificador e decodificador JSON

source: **Source code:** :source:`Lib/json/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/json/__init__.py`

source: `JSON (JavaScript Object Notation) <https://json.org>`_, specified by :rfc:`7159` (which obsoletes :rfc:`4627`) and by `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_, is a lightweight data interchange format inspired by `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ object literal syntax (although it is not a strict subset of JavaScript [#rfc-errata]_ ).
pt_br: `JSON (JavaScript Object Notation) <https://json.org>`_, especificado pelo :rfc:`7159` (que tornou o :rfc:`4627` obsoleta) e pelo `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_, é um formato leve de troca de dados inspirado pela sintaxe de objeto `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ (embora não seja um subconjunto estrito de JavaScript [#rfc-errata]_).

source: The term "object" in the context of JSON processing in Python can be ambiguous. All values in Python are objects. In JSON, an object refers to any data wrapped in curly braces, similar to a Python dictionary.
pt_br: O termo "objeto" no contexto do processamento JSON em Python pode ser ambíguo. Todos os valores em Python são objetos. Em JSON, um objeto se refere a qualquer dado entre chaves, semelhante a um dicionário Python.

source: Be cautious when parsing JSON data from untrusted sources. A malicious JSON string may cause the decoder to consume considerable CPU and memory resources. Limiting the size of data to be parsed is recommended.
pt_br: Tenha cuidado quando estiver analisando dados JSON de fontes não-confiáveis. Uma string JSON maliciosa pode fazer o decodificador consumir recursos consideráveis de CPU e memória. É recomendado limitar o tamanho do dado a ser analisado.

source: This module exposes an API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
pt_br: Este módulo expõe uma API familiar para pessoas usuárias dos módulos :mod:`marshal` e :mod:`pickle` da biblioteca padrão.

source: Encoding basic Python object hierarchies::
pt_br: Codificação de hierarquias básicas de objetos Python::

source: Compact encoding::
pt_br: Codificação compacta::

source: Pretty printing::
pt_br: Saída bonita::

source: Customizing JSON object encoding::
pt_br: Personalizando em codificação de objeto JSON::

source: Decoding JSON::
pt_br: Decodificando JSON::

source: Customizing JSON object decoding::
pt_br: Personalizando em decodificação de objeto JSON::

source: Extending :class:`JSONEncoder`::
pt_br: Estendendo :class:`JSONEncoder`::

source: Using :mod:`json` from the shell to validate and pretty-print:
pt_br: Usando :mod:`json` para validar a partir do console e exibir formatado:

source: See :ref:`json-commandline` for detailed documentation.
pt_br: Veja :ref:`json-commandline` para a documentação detalhada.

source: JSON is a subset of `YAML <https://yaml.org/>`_ 1.2. The JSON produced by this module's default settings (in particular, the default *separators* value) is also a subset of YAML 1.0 and 1.1. This module can thus also be used as a YAML serializer.
pt_br: JSON é um subconjunto do `YAML <https://yaml.org/>`_ 1.2. O JSON gerado pelas definições padrões desse módulo (particularmente, o valor padrão dos *separadores*) é também um subconjunto do YAML 1.0 e 1.1. Esse módulo pode, portanto, também ser usado como serializador YAML.

source: This module's encoders and decoders preserve input and output order by default. Order is only lost if the underlying containers are unordered.
pt_br: O codificador e o decodificador do módulo preservam a ordem de entrada e saída por padrão. A ordem só é perdida se os contêineres subjacentes estão desordenados.

source: Basic Usage
pt_br: Uso básico

source: Serialize *obj* as a JSON formatted stream to *fp* (a ``.write()``-supporting :term:`file-like object`) using this :ref:`Python-to-JSON conversion table <py-to-json-table>`.
pt_br: Serializa um *obj* como um stream JSON formatado para *fp* (um :term:`objeto arquivo ou similar` com suporte a ``.write()``) usando essa :ref:`tabela de conversão de Python para JSON <py-to-json-table>`.

source: Unlike :mod:`pickle` and :mod:`marshal`, JSON is not a framed protocol, so trying to serialize multiple objects with repeated calls to :func:`dump` using the same *fp* will result in an invalid JSON file.
pt_br: Diferente de :mod:`pickle` e :mod:`marshal`, JSON não é um protocolo com datagrama, assim tentar serializar múltiplos objetos com chamadas repetidas para :func:`dump` usando o mesmo *fp* resultará em um arquivo JSON inválido.

source: Parameters
pt_br: Parâmetros

source: The Python object to be serialized.
pt_br: O objeto Python a ser serializado.

source: The file-like object *obj* will be serialized to. The :mod:`!json` module always produces :class:`str` objects, not :class:`bytes` objects, therefore ``fp.write()`` must support :class:`str` input.
pt_br: O objeto arquivo ou similar *obj* para o qual será serializado. O módulo :mod:`!json` sempre produz objetos :class:`str`, e não objetos :class:`bytes`. Dessa forma, ``fp.write()`` precisa ter suporte para entradas :class:`str`.

source: If ``True``, keys that are not of a basic type (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) will be skipped instead of raising a :exc:`TypeError`. Default ``False``.
pt_br: Se ``True``, as chaves que não forem de um tipo básico (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) serão ignoradas ao invés de levantar uma exceção :exc:`TypeError`. Padrão ``False``.

source: If ``False``, the circular reference check for container types is skipped and a circular reference will result in a :exc:`RecursionError` (or worse). Default ``True``.
pt_br: Se ``False``, a verificação de referência circular for de tipos contêineres é ignorada e uma referência circular resultará em uma exceção :exc:`RecursionError` (ou pior). Padrão ``True``.

source: If ``False``, serialization of out-of-range :class:`float` values (``nan``, ``inf``, ``-inf``) will result in a :exc:`ValueError`, in strict compliance with the JSON specification. If ``True`` (the default), their JavaScript equivalents (``NaN``, ``Infinity``, ``-Infinity``) are used.
pt_br: Se ``False``, serialização de valores :class:`float` fora de intervalo (``nan``, ``inf``, ``-inf``) vai resultar em um :exc:`ValueError` em estrita conformidade com a especificação. Se ``True`` (o padrão), seus equivalentes JavaScript (``NaN``, ``Infinity``, ``-Infinity``) serão usados.

source: If set, a custom JSON encoder with the :meth:`~JSONEncoder.default` method overridden, for serializing into custom datatypes. If ``None`` (the default), :class:`!JSONEncoder` is used.
pt_br: Se definido, um codificador JSON personalizado com o método :meth:`~JSONEncoder.default` substituído, para serializar em tipos de dados personalizados. Se ``None`` (o padrão), :class:`!JSONEncoder` é usado.

source: If a positive integer or string, JSON array elements and object members will be pretty-printed with that indent level. A positive integer indents that many spaces per level; a string (such as ``"\t"``) is used to indent each level. If zero, negative, or ``""`` (the empty string), only newlines are inserted. If ``None`` (the default), the most compact representation is used.
pt_br: Se for um inteiro positivo ou uma string, os elementos da vetores JSON e os membros do objeto serão impressos de forma bonita com esse nível de indentação. Um inteiro positivo recua essa quantidade de espaços por nível; uma string (como ``"\t"``) é usada para indentar cada nível. Se for zero, negativo ou ``""`` (a string vazia), somente novas linhas serão inseridas. Se for ``None`` (o padrão), a representação mais compacta será usada.

source: A two-tuple: ``(item_separator, key_separator)``. If ``None`` (the default), *separators* defaults to ``(', ', ': ')`` if *indent* is ``None``, and ``(',', ': ')`` otherwise. For the most compact JSON, specify ``(',', ':')`` to eliminate whitespace.
pt_br: Uma tupla dupla: ``(item_separator, key_separator)``. Se ``None`` (o padrão), *separators* assume como padrão ``(', ', ': ')`` se *indent* for ``None``, e ``(',', ': ')`` caso contrário. Para o JSON mais compacto, especifique ``(',', ':')`` para eliminar espaços em branco.

source: A function that is called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If ``None`` (the default), :exc:`!TypeError` is raised.
pt_br: Uma função que é chamada para objetos que não podem ser serializados de outra forma. Ela deve retornar uma versão JSON codificável do objeto ou gerar um :exc:`TypeError`. Se ``None`` (o padrão), :exc:`!TypeError` é levantada.

source: If ``True``, dictionaries will be outputted sorted by key. Default ``False``.
pt_br: Se ``True``, os dicionários serão emitidos classificados por chave. Padrão ``False``.

source: Allow strings for *indent* in addition to integers.
pt_br: Permite strings para *indent*, além de inteiros.

source: Use ``(',', ': ')`` as default if *indent* is not ``None``.
pt_br: Usa ``(',', ': ')`` como padrão se *indent* não for ``None``.

source: All optional parameters are now :ref:`keyword-only <keyword-only_parameter>`.
pt_br: Todos os parâmetros opcionais agora são :ref:`somente-nomeados <keyword-only_parameter>`.

source: Serialize *obj* to a JSON formatted :class:`str` using this :ref:`conversion table <py-to-json-table>`. The arguments have the same meaning as in :func:`dump`.
pt_br: Serializa *obj* para uma :class:`str` com formato JSON usando essa :ref:`tabela de conversão <py-to-json-table>`. Os argumentos têm o mesmo significado que na função :func:`dump`.

source: Keys in key/value pairs of JSON are always of the type :class:`str`. When a dictionary is converted into JSON, all the keys of the dictionary are coerced to strings. As a result of this, if a dictionary is converted into JSON and then back into a dictionary, the dictionary may not equal the original one. That is, ``loads(dumps(x)) != x`` if x has non-string keys.
pt_br: Chaves nos pares chave/valor de JSON são sempre do tipo :class:`str`. Quando um dicionário é convertido para JSON, todas as chaves são convertidas para strings. Como resultado disso, se um dicionário é convertido para JSON e depois de volta para um dicionário, o dicionário pode não ser igual ao original. Isto é, ``loads(dumps(x)) != x`` se x tem chaves não strings.

source: Deserialize *fp* to a Python object using the :ref:`JSON-to-Python conversion table <json-to-py-table>`.
pt_br: Desserializa *fp* para um objeto Python usando a :ref:`tabela de conversão JSON para Python <json-to-py-table>`.

source: A ``.read()``-supporting :term:`text file` or :term:`binary file` containing the JSON document to be deserialized.
pt_br: Um :term:`arquivo texto` ou :term:`arquivo binário` com suporte a ``.read()`` contendo o documento JSON a ser desserializado.

source: If set, a custom JSON decoder. Additional keyword arguments to :func:`!load` will be passed to the constructor of *cls*. If ``None`` (the default), :class:`!JSONDecoder` is used.
pt_br: Se definido, um decodificador JSON personalizado. Argumentos nomeados adicionais para :func:`!load` serão passados para o construtor de *cls*. Se ``None`` (o padrão), :class:`!JSONDecoder` é usado.

source: If set, a function that is called with the result of any JSON object literal decoded (a :class:`dict`). The return value of this function will be used instead of the :class:`dict`. This feature can be used to implement custom decoders, for example `JSON-RPC <https://www.jsonrpc.org>`_ class hinting. Default ``None``.
pt_br: Se definido, uma função que é chamada com o resultado de qualquer literal de objeto JSON decodificado (um :class:`dict`). O valor de retorno desta função será usado em vez do :class:`dict`. Este recurso pode ser usado para implementar decodificadores personalizados, por exemplo dica de classes `JSON-RPC <https://www.jsonrpc.org>`_. O padrão é ``None``.

source: If set, a function that is called with the result of any JSON object literal decoded with an ordered list of pairs. The return value of this function will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also set, *object_pairs_hook* takes priority. Default ``None``.
pt_br: Se definido, uma função que é chamada com o resultado de qualquer literal de objeto JSON decodificado com uma lista ordenada de pares. O valor de retorno desta função será usado em vez de :class:`dict`. Este recurso pode ser usado para implementar decodificadores personalizados. Se *object_hook* também for definido, *object_pairs_hook* terá prioridade. O padrão é ``None``.

source: If set, a function that is called with the string of every JSON float to be decoded. If ``None`` (the default), it is equivalent to ``float(num_str)``. This can be used to parse JSON floats into custom datatypes, for example :class:`decimal.Decimal`.
pt_br: Se definido, uma função que é chamada com a string de cada ponto flutuante JSON a ser decodificada. Se ``None`` (o padrão), é equivalente a ``float(num_str)``. Isso pode ser usado para analisar pontos flutuantes JSON em tipos de dados personalizados, por exemplo :class:`decimal.Decimal`.

source: If set, a function that is called with the string of every JSON int to be decoded. If ``None`` (the default), it is equivalent to ``int(num_str)``. This can be used to parse JSON integers into custom datatypes, for example :class:`float`.
pt_br: Se definido, uma função que é chamada com a string de cada int JSON a ser decodificado. Se ``None`` (o padrão), é equivalente a ``int(num_str)``. Isso pode ser usado para analisar inteiros JSON em tipos de dados personalizados, por exemplo :class:`float`.

source: If set, a function that is called with one of the following strings: ``'-Infinity'``, ``'Infinity'``, or ``'NaN'``. This can be used to raise an exception if invalid JSON numbers are encountered. Default ``None``.
pt_br: Se definido, uma função que é chamada com uma das seguintes strings: ``'-Infinity'``, ``'Infinity'`` ou ``'NaN'``. Isso pode ser usado para levantar uma exceção se números JSON inválidos forem encontrados. Padrão ``None``.

source: Raises
pt_br: Levanta

source: When the data being deserialized is not a valid JSON document.
pt_br: Quando os dados a serem desserializados não forem um documento JSON válido.

source: When the data being deserialized does not contain UTF-8, UTF-16 or UTF-32 encoded data.
pt_br: Quando os dados que estão sendo desserializados não contêm dados codificados em UTF-8, UTF-16 ou UTF-32.

source: Added the optional *object_pairs_hook* parameter.
pt_br: Adicionado o parâmetro opcional *object_pairs_hook*.

source: *parse_constant* doesn't get called on 'null', 'true', 'false' anymore.
pt_br: *parse_constant* não é mais chamada para 'null', 'true', 'false'.

source: *fp* can now be a :term:`binary file`. The input encoding should be UTF-8, UTF-16 or UTF-32.
pt_br: *fp* agora pode ser um :term:`arquivo binário <binary file>`. A entrada deve estar codificada como UTF-8, UTF-16 ou UTF-32.

source: The default *parse_int* of :func:`int` now limits the maximum length of the integer string via the interpreter's :ref:`integer string conversion length limitation <int_max_str_digits>` to help avoid denial of service attacks.
pt_br: O *parse_int* padrão para :func:`int` agora limita o tamanho máximo da string de inteiro via :ref:`limitação de comprimento de string na conversão para inteiro <int_max_str_digits>` do interpretador para ajudar a evitar ataques por negação de serviço.

source: Identical to :func:`load`, but instead of a file-like object, deserialize *s* (a :class:`str`, :class:`bytes` or :class:`bytearray` instance containing a JSON document) to a Python object using this :ref:`conversion table <json-to-py-table>`.
pt_br: Idêntico a :func:`load`, mas em vez de um objeto arquivo ou similar, desserializa *s* (uma instância de :class:`str`, :class:`bytes` ou :class:`bytearray` contendo um documento JSON) para um objeto Python usando essa :ref:`tabela de conversão <json-to-py-table>`.

source: *s* can now be of type :class:`bytes` or :class:`bytearray`. The input encoding should be UTF-8, UTF-16 or UTF-32.
pt_br: *s* agora pode ser um do tipo :class:`bytes` ou :class:`bytearray`. A entrada deve estar codificado como UTF-8, UTF-16 ou UTF-32.

source: The keyword argument *encoding* has been removed.
pt_br: O argumento nomeado *encoding* foi removido.

source: Encoders and Decoders
pt_br: Codificadores e decodificadores

source: Simple JSON decoder.
pt_br: Decodificador JSON simples.

source: Performs the following translations in decoding by default:
pt_br: Executa as seguintes traduções na decodificação por padrão:

source: object
pt_br: objeto

source: dict
pt_br: dicionário

source: list
pt_br: lista

source: number (int)
pt_br: número (inteiro)

source: number (real)
pt_br: número (real)

source: true
pt_br: verdadeiro

source: false
pt_br: falso

source: null
pt_br: nulo

source: It also understands ``NaN``, ``Infinity``, and ``-Infinity`` as their corresponding ``float`` values, which is outside the JSON spec.
pt_br: Ele também entende ``NaN``, ``Infinity`` e ``-Infinity`` como seus valores ``float`` correspondentes, que estão fora da especificação JSON.

source: *object_hook* is an optional function that will be called with the result of every JSON object decoded and its return value will be used in place of the given :class:`dict`. This can be used to provide custom deserializations (e.g. to support `JSON-RPC <https://www.jsonrpc.org>`_ class hinting).
pt_br: *object_hook* é uma função opcional que será chamada com o resultado de cada objeto JSON decodificado e seu valor de retorno será usado no lugar do dado :class:`dict`. Isso pode ser usado para fornecer desserializações personalizadas (por exemplo, para oferecer suporte a dicas de classe `JSON-RPC <https://www.jsonrpc.org>`_)

source: *object_pairs_hook* is an optional function that will be called with the result of every JSON object decoded with an ordered list of pairs. The return value of *object_pairs_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also defined, the *object_pairs_hook* takes priority.
pt_br: *object_pairs_hook* é uma função opcional que será chamada com o resultado de todo objeto JSON decodificado com uma lista ordenada de pares. O valor de retorno de *object_pairs_hook* será usado no lugar do :class:`dict`. Este recurso pode ser usado para implementar decodificadores personalizados. Se *object_pairs_hook* também for definido, o *object_pairs_hook* terá prioridade.

source: Added support for *object_pairs_hook*.
pt_br: Adicionado suporte para *object_pairs_hook*.

source: *parse_float* is an optional function that will be called with the string of every JSON float to be decoded. By default, this is equivalent to ``float(num_str)``. This can be used to use another datatype or parser for JSON floats (e.g. :class:`decimal.Decimal`).
pt_br: *parse_float* é uma função opcional que será chamada com a string de cada ponto flutuante JSON para ser decodificado. Por padrão, equivale a ``float(num_str)``. Pode ser usado para qualquer outro tipo de dado ou analisador de pontos flutuante JSON (por exemplo, :class:`decimal.Decimal`).

source: *parse_int* is an optional function that will be called with the string of every JSON int to be decoded. By default, this is equivalent to ``int(num_str)``. This can be used to use another datatype or parser for JSON integers (e.g. :class:`float`).
pt_br: *parse_int* é uma função opcional que será chamada com a string de cada inteiro JSON para ser decodificado. Por padrão, equivale a ``int(num_str)``. Pode ser usado para qualquer outro tipo de dado ou analisador de inteiros JSON (por exemplo, :class:`float`).

source: *parse_constant* is an optional function that will be called with one of the following strings: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. This can be used to raise an exception if invalid JSON numbers are encountered.
pt_br: *parse_constant* é uma função opcional que será chamada para cada um das seguintes strings: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. Isso pode ser usado para levantar uma exceção se forem encontrados números JSON inválidos.

source: If *strict* is false (``True`` is the default), then control characters will be allowed inside strings. Control characters in this context are those with character codes in the 0--31 range, including ``'\t'`` (tab), ``'\n'``, ``'\r'`` and ``'\0'``.
pt_br: Se *strict* for falso (``True`` é o padrão), os caracteres de controle serão permitidos dentro das strings. Os caracteres de controle neste contexto são aqueles com códigos de caracteres no intervalo 0--31, incluindo ``'\t'`` (tab), ``'\n'``, ``'\r'`` e ``'\0'``.

source: If the data being deserialized is not a valid JSON document, a :exc:`JSONDecodeError` will be raised.
pt_br: Se os dados a serem desserializados não forem um documento JSON válido, será levantada uma exceção :exc:`JSONDecodeError`.

source: All parameters are now :ref:`keyword-only <keyword-only_parameter>`.
pt_br: Todos os parâmetros agora são :ref:`somente-nomeado <keyword-only_parameter>`.

source: Return the Python representation of *s* (a :class:`str` instance containing a JSON document).
pt_br: Retorna a representação Python de *s* (uma instância :class:`str` contendo um documento JSON).

source: :exc:`JSONDecodeError` will be raised if the given JSON document is not valid.
pt_br: Uma exceção :exc:`JSONDecodeError` será levantada se o documento JSON fornecido não for válido.

source: Decode a JSON document from *s* (a :class:`str` beginning with a JSON document) and return a 2-tuple of the Python representation and the index in *s* where the document ended.
pt_br: Decodifica um documento JSON a partir de *s* (uma :class:`str` iniciando com um documento JSON) e retornando uma tupla de 2 elementos, a representação Python e o índice em *s* onde o documento finaliza.

source: This can be used to decode a JSON document from a string that may have extraneous data at the end.
pt_br: Isso pode ser usado para decodificar um documento JSON a partir de uma string que possa ter dados extras ao final.

source: Extensible JSON encoder for Python data structures.
pt_br: Codificador JSON extensível para estruturas de dados Python.

source: Supports the following objects and types by default:
pt_br: Por padrão, possui suporte para os seguintes objetos e tipos:

source: int, float, int- & float-derived Enums
pt_br: int, float e Enums derivados de int e float

source: Added support for int- and float-derived Enum classes.
pt_br: Adicionado suporte para classes Enum derivadas de int e float.

source: To extend this to recognize other objects, subclass and implement a :meth:`~JSONEncoder.default` method with another method that returns a serializable object for ``o`` if possible, otherwise it should call the superclass implementation (to raise :exc:`TypeError`).
pt_br: Para estender isso para reconhecer outros objetos, crie uma subclasse e implemente o método :meth:`~JSONEncoder.default` com outro método que retorne um objeto serializável para ``o`` se possível, caso contrário deveria chamar a implementação da superclasse (para levantar :exc:`TypeError`).
