Repository: python/python-docs-pt-br
Catalog: library/json.po
Languages: pt_br

source: If *skipkeys* is false (the default), a :exc:`TypeError` will be raised when trying to encode keys that are not :class:`str`, :class:`int`, :class:`float`, :class:`bool` or ``None``. If *skipkeys* is true, such items are simply skipped.
pt_br: Se *skipkeys* é falso (o padrão), então sluma :exc:`TypeError` será levantada ao tentar codificar as chaves que não são :class:`str`, :class:`int`, :class:`float`, :class:`bool` ou ``None``. Se *skipkeys* é verdadeiro, esses itens são simplesmente pulados.

source: If *check_circular* is true (the default), then lists, dicts, and custom encoded objects will be checked for circular references during encoding to prevent an infinite recursion (which would cause a :exc:`RecursionError`). Otherwise, no such check takes place.
pt_br: Se *check_circular* é verdadeiro (o padrão), então listas, dicionários e objetos codificados personalizados serão verificados por referências circulares durante a codificação para prevenir uma recursão infinita (que iria causar uma :exc:`RecursionError`). Caso contrário, nenhuma verificação será feita.

source: If *allow_nan* is true (the default), then ``NaN``, ``Infinity``, and ``-Infinity`` will be encoded as such. This behavior is not JSON specification compliant, but is consistent with most JavaScript based encoders and decoders. Otherwise, it will be a :exc:`ValueError` to encode such floats.
pt_br: Se *allow_nan* for verdadeiro (o padrão), então ``NaN``, ``Infinity``, e ``-Infinity`` serão codificados como tal. Esse comportamento não é compatível com a especificação do JSON, mas é consistente com a maioria dos codificadores e decodificadores baseados em JavaScript. Caso contrário, será levantada uma :exc:`ValueError` para tais pontos flutuantes.

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key; this is useful for regression tests to ensure that JSON serializations can be compared on a day-to-day basis.
pt_br: Se *sort_keys* for verdadeiro (padrão: ``False``), então a saída dos dicionários serão ordenados pela chave; isto é útil para testes de regressão para certificar-se que as serializações de JSON possam ser comparadas com uma base no dia a dia.

source: If *indent* is a non-negative integer or string, then JSON array elements and object members will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the most compact representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
pt_br: Se *indent* for um inteiro não negativo ou uma string, então elementos de um vetor JSON e membros de objetos terão uma saída formatada com este nível de indentação. Um nível de indentação 0, negativo ou ``""`` apenas colocará novas linhas. ``None`` (o padrão) seleciona a representação mais compacta. Usando um inteiro positivo a indentação terá alguns espaços por nível. Se *indent* for uma string (como ``"\t"``), essa string será usada para indentar cada nível.

source: If specified, *separators* should be an ``(item_separator, key_separator)`` tuple. The default is ``(', ', ': ')`` if *indent* is ``None`` and ``(',', ': ')`` otherwise. To get the most compact JSON representation, you should specify ``(',', ':')`` to eliminate whitespace.
pt_br: Se especificado, *separators* deve ser uma tupla ``(item_separator, key_separator)``. O padrão é ``(', ', ': ')`` se *indent* for ``None`` e ``(',', ': ')`` caso contrário. Para pegar representação JSON mais compacta, você deve especificar ``(',', ':')`` para eliminar espaços em branco.

source: If specified, *default* should be a function that gets called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If not specified, :exc:`TypeError` is raised.
pt_br: Se especificado, *default* deve ser uma função para ser chamada para objetos que não podem ser serializados de outra forma. Deve retornar uma versão codificável JSON do objeto ou levantar uma exceção :exc:`TypeError`. Se não for especificada, :exc:`TypeError` é levantada.

source: Implement this method in a subclass such that it returns a serializable object for *o*, or calls the base implementation (to raise a :exc:`TypeError`).
pt_br: Implemente este método em uma subclasse que retorna um objeto serializável para *o* ou que chame a implementação base (para levantar uma :exc:`TypeError`).

source: For example, to support arbitrary iterators, you could implement :meth:`~JSONEncoder.default` like this::
pt_br: Por exemplo, para suporte a iteradores arbitrários, você poderia implementar :meth:`~JSONEncoder.default` dessa forma::

source: def default(self, o): try: iterable = iter(o) except TypeError: pass else: return list(iterable) # Let the base class default method raise the TypeError return super().default(o)
pt_br: def default(self, o): try: iterable = iter(o) except TypeError: pass else: return list(iterable) # Faz o método padrão de classe base levantar a TypeError return super().default(o)

source: Return a JSON string representation of a Python data structure, *o*. For example::
pt_br: Retorna uma string representando um JSON a partir da estrutura de dados Python, *o*. Por exemplo::

source: Encode the given object, *o*, and yield each string representation as available. For example::
pt_br: Codifica o objeto dado, *o*, e produz cada representação em string assim que disponível. Por exemplo::

source: Exceptions
pt_br: Exceções

source: Subclass of :exc:`ValueError` with the following additional attributes:
pt_br: Subclasse de :exc:`ValueError` com os seguintes atributos adicionais:

source: The unformatted error message.
pt_br: A mensagem de erro não formatada.

source: The JSON document being parsed.
pt_br: O documento JSON sendo analisado.

source: The start index of *doc* where parsing failed.
pt_br: O índice inicial de *doc* em que a análise falhou.

source: The line corresponding to *pos*.
pt_br: A linha correspondente a *pos*.

source: The column corresponding to *pos*.
pt_br: A coluna correspondente a *pos*.

source: Standard Compliance and Interoperability
pt_br: Conformidade e interoperabilidade entre padrões

source: The JSON format is specified by :rfc:`7159` and by `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_. This section details this module's level of compliance with the RFC. For simplicity, :class:`JSONEncoder` and :class:`JSONDecoder` subclasses, and parameters other than those explicitly mentioned, are not considered.
pt_br: O formato JSON é especificado pela :rfc:`7159` e por `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_. Esta seção detalha o nível de conformidade deste módulo com a RFC. Para simplificar, as subclasses :class:`JSONEncoder` e :class:`JSONDecoder`, e outros parâmetros além daqueles explicitamente mencionados, não são considerados.

source: This module does not comply with the RFC in a strict fashion, implementing some extensions that are valid JavaScript but not valid JSON. In particular:
pt_br: Este módulo não está em conformidade com a RFC de forma estrita, implementando algumas extensões que são JavaScript válidas, mas não JSON válido. Em particular:

source: Infinite and NaN number values are accepted and output;
pt_br: Os valores de números infinitos e NaN são aceitos e produzidos;

source: Repeated names within an object are accepted, and only the value of the last name-value pair is used.
pt_br: Nomes repetidos em um objeto são aceitos e apenas o valor do último par nome-valor é usado.

source: Since the RFC permits RFC-compliant parsers to accept input texts that are not RFC-compliant, this module's deserializer is technically RFC-compliant under default settings.
pt_br: Uma vez que a RFC permite que os analisadores compatíveis com a RFC aceitem textos de entrada que não sejam compatíveis com a RFC, o desserializador deste módulo é tecnicamente compatível com a RFC nas configurações padrão.

source: Character Encodings
pt_br: Codificações de caracteres

source: The RFC requires that JSON be represented using either UTF-8, UTF-16, or UTF-32, with UTF-8 being the recommended default for maximum interoperability.
pt_br: A RFC requer que JSON seja representado usando UTF-8, UTF-16 ou UTF-32, com UTF-8 sendo o padrão recomendado para interoperabilidade máxima.

source: Other than the *ensure_ascii* parameter, this module is defined strictly in terms of conversion between Python objects and :class:`Unicode strings <str>`, and thus does not otherwise directly address the issue of character encodings.
pt_br: Além do parâmetro *ensure_ascii*, este módulo é definido estritamente em termos de conversão entre objetos Python e :class:`strings Unicode <str>` e, portanto, não aborda diretamente o problema de codificação de caracteres.

source: The RFC prohibits adding a byte order mark (BOM) to the start of a JSON text, and this module's serializer does not add a BOM to its output. The RFC permits, but does not require, JSON deserializers to ignore an initial BOM in their input. This module's deserializer raises a :exc:`ValueError` when an initial BOM is present.
pt_br: A RFC proíbe adicionar uma marca de ordem de byte (do inglês *byte order mark* - BOM) ao início de um texto JSON, e o serializador deste módulo não adiciona um BOM à sua saída. A RFC permite, mas não exige, que os desserializadores JSON ignorem um BOM inicial em sua entrada. O desserializador deste módulo levanta uma :exc:`ValueError` quando um BOM inicial está presente.

source: The RFC does not explicitly forbid JSON strings which contain byte sequences that don't correspond to valid Unicode characters (e.g. unpaired UTF-16 surrogates), but it does note that they may cause interoperability problems. By default, this module accepts and outputs (when present in the original :class:`str`) code points for such sequences.
pt_br: A RFC não proíbe explicitamente as strings JSON que contêm sequências de bytes que não correspondem a caracteres Unicode válidos (por exemplo, substitutos UTF-16 não emparelhados), mas observa que podem causar problemas de interoperabilidade. Por padrão, este módulo aceita e produz (quando presente no original :class:`str`) pontos de código para tais sequências.

source: Infinite and NaN Number Values
pt_br: Valores numéricos infinitos e NaN

source: The RFC does not permit the representation of infinite or NaN number values. Despite that, by default, this module accepts and outputs ``Infinity``, ``-Infinity``, and ``NaN`` as if they were valid JSON number literal values::
pt_br: A RFC não permite a representação de valores infinitos ou numéricos NaN. Apesar disso, por padrão, este módulo aceita e produz ``Infinity``, ``-Infinity`` e ``NaN`` como se fossem valores literais de número JSON válidos::

source: >>> # Neither of these calls raises an exception, but the results are not valid JSON >>> json.dumps(float('-inf')) '-Infinity' >>> json.dumps(float('nan')) 'NaN' >>> # Same when deserializing >>> json.loads('-Infinity') -inf >>> json.loads('NaN') nan
pt_br: >>> # Nenhuma dessas chamadas levanta uma exceção, mas os resultados não são JSON válidos >>> json.dumps(float('-inf')) '-Infinity' >>> json.dumps(float('nan')) 'NaN' >>> # Same when deserializing >>> json.loads('-Infinity') -inf >>> json.loads('NaN') nan

source: In the serializer, the *allow_nan* parameter can be used to alter this behavior. In the deserializer, the *parse_constant* parameter can be used to alter this behavior.
pt_br: No serializador, o parâmetro *allow_nan* pode ser usado para alterar esse comportamento. No desserializador, o parâmetro *parse_constant* pode ser usado para alterar esse comportamento.

source: Repeated Names Within an Object
pt_br: Nomes repetidos dentro de um objeto

source: The RFC specifies that the names within a JSON object should be unique, but does not mandate how repeated names in JSON objects should be handled. By default, this module does not raise an exception; instead, it ignores all but the last name-value pair for a given name::
pt_br: A RFC especifica que os nomes em um objeto JSON devem ser exclusivos, mas não determina como os nomes repetidos em objetos JSON devem ser tratados. Por padrão, este módulo não levanta uma exceção; em vez disso, ele ignora tudo, exceto o último par nome-valor para um determinado nome::

source: The *object_pairs_hook* parameter can be used to alter this behavior.
pt_br: O parâmetro *object_pairs_hook* pode ser usado para alterar este comportamento.

source: Top-level Non-Object, Non-Array Values
pt_br: Valores não objeto e não vetor de nível superior

source: The old version of JSON specified by the obsolete :rfc:`4627` required that the top-level value of a JSON text must be either a JSON object or array (Python :class:`dict` or :class:`list`), and could not be a JSON null, boolean, number, or string value. :rfc:`7159` removed that restriction, and this module does not and has never implemented that restriction in either its serializer or its deserializer.
pt_br: A versão antiga de JSON especificada pela obsoleta :rfc:`4627` exige que o valor de nível superior do texto JSON deve ser do tipo object ou array (:class:`dict` ou :class:`list` Python), e não poderia ser dos tipos null, boolean, number ou string. :rfc:`7159` removeu essa restrição, e esse módulo não tem nenhuma implementação que faça essa restrição, seja em seus serializadores, sejam nos desserializadores.

source: Regardless, for maximum interoperability, you may wish to voluntarily adhere to the restriction yourself.
pt_br: Independentemente, para máxima interoperabilidade, você pode querer aderir voluntariamente à restrição.

source: Implementation Limitations
pt_br: Limitações de implementação

source: Some JSON deserializer implementations may set limits on:
pt_br: Algumas implementações de desserializadores JSON podem definir limites em:

source: the size of accepted JSON texts
pt_br: o tamanho de textos JSON aceitos

source: the maximum level of nesting of JSON objects and arrays
pt_br: o nível máximo de aninhamento de objetos e vetores JSON

source: the range and precision of JSON numbers
pt_br: o intervalo e a precisão de números JSON

source: the content and maximum length of JSON strings
pt_br: o conteúdo e o tamanho máximo de strings JSON

source: This module does not impose any such limits beyond those of the relevant Python datatypes themselves or the Python interpreter itself.
pt_br: Esse módulo não impõe nenhum limite além daqueles já colocados pelas estruturas de dados Python ou pelo interpretador Python em si.

source: When serializing to JSON, beware any such limitations in applications that may consume your JSON. In particular, it is common for JSON numbers to be deserialized into IEEE 754 double precision numbers and thus subject to that representation's range and precision limitations. This is especially relevant when serializing Python :class:`int` values of extremely large magnitude, or when serializing instances of "exotic" numerical types such as :class:`decimal.Decimal`.
pt_br: Quando serializando para JSON, tenha cuidado com qualquer limitação nas aplicações que irão consumir seu JSON. Em particular, é comum para números JSON serem desserializados com números de precisão dupla definida em IEEE 754 e, portanto, sujeito a limitações de precisão e de intervalo da representação. Isso é especialmente relevante quando serializando valores Python :class:`int` de magnitude extremamente grande, ou quando serializando instâncias de tipos numéricos "exóticos" como :class:`decimal.Decimal`.

source: Command-line interface
pt_br: Interface de linha de comando

source: **Source code:** :source:`Lib/json/tool.py`
pt_br: **Código-fonte:** :source:`Lib/json/tool.py`

source: The :mod:`json` module can be invoked as a script via ``python -m json`` to validate and pretty-print JSON objects. The :mod:`json.tool` submodule implements this interface.
pt_br: O módulo :mod:`json` pode ser invocado como um script via ``python -m json`` para validar e fazer uma impressão bem formatada de objetos JSON. O submódulo :mod:`json.tool` implementa essa interface.

source: If the optional ``infile`` and ``outfile`` arguments are not specified, :data:`sys.stdin` and :data:`sys.stdout` will be used respectively:
pt_br: Se os argumentos opcionais ``infile`` e ``outfile`` não forem especificados, :data:`sys.stdin` e :data:`sys.stdout` serão usados respectivamente:

source: The output is now in the same order as the input. Use the :option:`--sort-keys` option to sort the output of dictionaries alphabetically by key.
pt_br: A saída agora está na mesma ordem da entrada. Use a opção :option:`--sort-keys` para ordenar a saída de dicionários alfabeticamente pela chave.

source: The :mod:`json` module may now be directly executed as ``python -m json``. For backwards compatibility, invoking the CLI as ``python -m json.tool`` remains supported.
pt_br: O módulo :mod:`json` agora pode ser executado diretamente como ``python -m json``. Para retrocompatibilidade, a invocação da CLI como ``python -m json.tool`` continua sendo aceita.

source: Command-line options
pt_br: Opções de linha de comando

source: The JSON file to be validated or pretty-printed:
pt_br: O arquivo JSON para ser validado ou saída embelezada:

source: If *infile* is not specified, read from :data:`sys.stdin`.
pt_br: Se *infile* não é especificado, lê de :data:`sys.stdin`.

source: Write the output of the *infile* to the given *outfile*. Otherwise, write it to :data:`sys.stdout`.
pt_br: Escreve a saída de *infile* para o *outfile* dado. Caso contrário, escreve em :data:`sys.stdout`.

source: Sort the output of dictionaries alphabetically by key.
pt_br: Ordena a saída de dicionários alfabeticamente pela chave.

source: Disable escaping of non-ascii characters, see :func:`json.dumps` for more information.
pt_br: Desabilita escape de caracteres não-ascii, veja :func:`json.dumps` para mais informações.

source: Parse every input line as separate JSON object.
pt_br: Analisa cada linha da entrada como um objeto JSON separado.

source: Mutually exclusive options for whitespace control.
pt_br: Opções mutualmente exclusivas para controle de espaços em branco.

source: Show the help message.
pt_br: Exibe a mensagem de ajuda.

source: Footnotes
pt_br: Notas de rodapé

source: As noted in `the errata for RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON permits literal U+2028 (LINE SEPARATOR) and U+2029 (PARAGRAPH SEPARATOR) characters in strings, whereas JavaScript (as of ECMAScript Edition 5.1) does not.
pt_br: Como apresentado `na errata para RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON permite os caracteres literais U+2028 (SEPARADOR DE LINHA) e U+2029 (SEPARADOR DE PARÁGRAFO) em strings, enquanto que JavaScript (ECMAScript Edition 5.1) não.
