Repository: python/python-docs-pt-br
Catalog: library/linecache.po
Languages: pt_br

source: :mod:`!linecache` --- Random access to text lines
pt_br: :mod:`!linecache` --- Acesso aleatório a linhas de texto

source: **Source code:** :source:`Lib/linecache.py`
pt_br: **Código-fonte:** :source:`Lib/linecache.py`

source: The :mod:`linecache` module allows one to get any line from a Python source file, while attempting to optimize internally, using a cache, the common case where many lines are read from a single file. This is used by the :mod:`traceback` module to retrieve source lines for inclusion in the formatted traceback.
pt_br: O módulo :mod:`linecache` permite obter qualquer linha de um arquivo fonte Python, enquanto tenta otimizar internamente, usando um cache, o caso comum em que muitas linhas são lidas em um único arquivo. Isso é usado pelo módulo :mod:`traceback` para recuperar as linhas de origem para inclusão no traceback (situação da pilha de execução) formatado.

source: The :func:`tokenize.open` function is used to open files. This function uses :func:`tokenize.detect_encoding` to get the encoding of the file; in the absence of an encoding token, the file encoding defaults to UTF-8.
pt_br: A função :func:`tokenize.open` é usada para abrir arquivos. Esta função usa :func:`tokenize.detect_encoding` para obter a codificação do arquivo; na ausência de um token de codificação, o padrão de codificação do arquivo é UTF-8.

source: The :mod:`linecache` module defines the following functions:
pt_br: O módulo :mod:`linecache` define as seguintes funções:

source: Get line *lineno* from file named *filename*. This function will never raise an exception --- it will return ``''`` on errors (the terminating newline character will be included for lines that are found).
pt_br: Obtém a linha *lineno* do arquivo chamado *filename*. Essa função nunca levanta uma exceção --- ela retornará ``''`` em erros (o caractere de nova linha final será incluído para as linhas encontradas).

source: If *filename* indicates a frozen module (starting with ``'<frozen '``), the function will attepmt to get the real file name from ``module_globals['__file__']`` if *module_globals* is not ``None``.
pt_br: Se *filename* indicar um módulo congelado (começando com ``'<frozen '``), a função tentará obter o nome real do arquivo de ``module_globals['__file__']`` se *module_globals* não for ``None``.

source: If a file named *filename* is not found, the function first checks for a :pep:`302` ``__loader__`` in *module_globals*. If there is such a loader and it defines a ``get_source`` method, then that determines the source lines (if ``get_source()`` returns ``None``, then ``''`` is returned). Finally, if *filename* is a relative filename, it is looked up relative to the entries in the module search path, ``sys.path``.
pt_br: Se um arquivo chamado *filename* não for encontrado, a função primeiro verifica por um ``__loader__`` da :pep:`302` em *module_globals*. Se existe um carregador e ele define um método ``get_source``, isso determina as linhas fonte (se ``get_source()`` retornar ``None``, então ``''`` será retornado). Por fim, se *filename* for um nome de arquivo relativo, ele será procurado em relação às entradas no caminho de pesquisa do módulo, ``sys.path``.

source: Support *filename* of frozen modules.
pt_br: Suporte a *filename* de módulos congelados.

source: Clear the cache. Use this function if you no longer need lines from files previously read using :func:`getline`.
pt_br: Limpa o cache. Use esta função se você não precisar mais de linhas de arquivos lidos anteriormente usando :func:`getline`.

source: Check the cache for validity. Use this function if files in the cache may have changed on disk, and you require the updated version. If *filename* is omitted, it will check all the entries in the cache.
pt_br: Verifica a validade do cache. Use esta função se os arquivos no cache tiverem sido alterados no disco e você precisar da versão atualizada. Se *filename* for omitido, ele verificará todas as entradas no cache.

source: Capture enough detail about a non-file-based module to permit getting its lines later via :func:`getline` even if *module_globals* is ``None`` in the later call. This avoids doing I/O until a line is actually needed, without having to carry the module globals around indefinitely.
pt_br: Captura detalhes suficientes sobre um módulo não baseado em arquivo para permitir obter suas linhas posteriormente via :func:`getline` mesmo se *module_globals* for ``None`` na chamada posterior. Isso evita a execução de E/S até que uma linha seja realmente necessária, sem ter que carregar o módulo global indefinidamente.

source: Example::
pt_br: Exemplo::

source: module
pt_br: módulo

source: search
pt_br: pesquisa

source: path
pt_br: caminho
