Repository: python/python-docs-pt-br
Catalog: library/locale.po
Languages: pt_br

source: Transforms a string to one that can be used in locale-aware comparisons. For example, ``strxfrm(s1) < strxfrm(s2)`` is equivalent to ``strcoll(s1, s2) < 0``. This function can be used when the same string is compared repeatedly, e.g. when collating a sequence of strings.
pt_br: Transforma uma string em uma que pode ser usada em comparações com reconhecimento de localidade. Por exemplo, ``strxfrm(s1) < strxfrm(s2)`` é equivalente a ``strcoll(s1, s2) < 0``. Esta função pode ser usada quando a mesma string é comparada repetidamente, por exemplo, ao agrupar uma sequência de strings.

source: Formats a number *val* according to the current :const:`LC_NUMERIC` setting. The format follows the conventions of the ``%`` operator. For floating-point values, the decimal point is modified if appropriate. If *grouping* is ``True``, also takes the grouping into account.
pt_br: Formata um número *val* de acordo com a configuração atual do :const:`LC_NUMERIC`. O formato segue as convenções do operador ``%``. Para valores de ponto flutuante, o ponto decimal é modificado, se apropriado. Se *grouping* for ``True``, também levará em conta o agrupamento.

source: If *monetary* is true, the conversion uses monetary thousands separator and grouping strings.
pt_br: Se *monetary* for verdadeiro, a conversão usa o separador de milhares monetários e strings de agrupamento.

source: Processes formatting specifiers as in ``format % val``, but takes the current locale settings into account.
pt_br: Processa especificadores de formatação como em ``format % val``, mas leva as configurações de localidade atuais em consideração.

source: The *monetary* keyword parameter was added.
pt_br: O parâmetro nomeado *monetary* foi adicionado.

source: Formats a number *val* according to the current :const:`LC_MONETARY` settings.
pt_br: Formata um número *val* de acordo com as configurações atuais de :const:`LC_MONETARY`.

source: The returned string includes the currency symbol if *symbol* is true, which is the default. If *grouping* is ``True`` (which is not the default), grouping is done with the value. If *international* is ``True`` (which is not the default), the international currency symbol is used.
pt_br: A string retornada inclui o símbolo da moeda se *symbol* for verdadeiro, que é o padrão. Se *grouping* for ``True`` (o que não é o padrão), o agrupamento é feito com o valor. Se *international* for ``True`` (o que não é o padrão), o símbolo da moeda internacional será usado.

source: This function will not work with the 'C' locale, so you have to set a locale via :func:`setlocale` first.
pt_br: Esta função não funcionará com a localidade 'C', então você deve definir uma localidade via :func:`setlocale` primeiro.

source: Formats a floating-point number using the same format as the built-in function ``str(float)``, but takes the decimal point into account.
pt_br: Formata um número de ponto flutuante usando o mesmo formato da função embutida ``str(float)``, mas leva o ponto decimal em consideração.

source: Converts a string into a normalized number string, following the :const:`LC_NUMERIC` settings.
pt_br: Converte uma string em uma string numérica normalizada, seguindo as configurações de :const:`LC_NUMERIC`.

source: Converts a normalized number string into a formatted string following the :const:`LC_NUMERIC` settings.
pt_br: Converte uma string numérica normalizada em uma string formatada, seguindo as configurações de :const:`LC_NUMERIC`.

source: Converts a string to a number, following the :const:`LC_NUMERIC` settings, by calling *func* on the result of calling :func:`delocalize` on *string*.
pt_br: Converte uma string para um número, de acordo com o valor da constante :const:`LC_NUMERIC`, chamando *func* com o resultado da chamada à :func:`delocalize` em *string*.

source: Converts a string to an integer, following the :const:`LC_NUMERIC` conventions.
pt_br: Converte uma string em um número inteiro, seguindo as convenções de :const:`LC_NUMERIC`.

source: Locale category for the character type functions. Most importantly, this category defines the text encoding, i.e. how bytes are interpreted as Unicode codepoints. See :pep:`538` and :pep:`540` for how this variable might be automatically coerced to ``C.UTF-8`` to avoid issues created by invalid settings in containers or incompatible settings passed over remote SSH connections.
pt_br: Categoria da localidade para as funções de tipo de caracteres. Mais importante ainda, essa categoria define a codificação do texto, ou seja, como os bytes são interpretado como pontos de código Unicode. Consulte :pep:`538` e :pep:`540` para saber como essa variável pode ser automaticamente coagida para ``C.UTF-8`` para evitar problemas criados por configurações inválidas em contêineres ou configurações incompatíveis passadas por conexões remotas com SSH.

source: Python doesn't internally use locale-dependent character transformation functions from ``ctype.h``. Instead, ``pyctype.h`` provides locale-independent equivalents like :c:macro:`Py_TOLOWER`.
pt_br: O Python não usa internamente funções de transformação de caracteres dependente de localidade do ``ctype.h``. Em vez disso, ``pyctype.h`` fornece equivalentes independentes de localidade como :c:macro:`Py_TOLOWER`.

source: Locale category for sorting strings. The functions :func:`strcoll` and :func:`strxfrm` of the :mod:`locale` module are affected.
pt_br: Categoria da localidade para classificação de strings. As funções :func:`strcoll` e :func:`strxfrm` do módulo :mod:`locale` são afetadas.

source: Locale category for the formatting of time. The function :func:`time.strftime` follows these conventions.
pt_br: Categoria da localidade para a formatação de hora. A função :func:`time.strftime` segue essas convenções.

source: Locale category for formatting of monetary values. The available options are available from the :func:`localeconv` function.
pt_br: Categoria da localidade para formatação de valores monetários. As opções disponíveis estão disponíveis na função :func:`localeconv`.

source: Locale category for message display. Python currently does not support application specific locale-aware messages. Messages displayed by the operating system, like those returned by :func:`os.strerror` might be affected by this category.
pt_br: Categoria da localidade para exibição de mensagens. Python atualmente não oferece suporte a mensagens com reconhecimento de localidade específicas da aplicação. Mensagens exibidas pelo sistema operacional, como aquelas retornadas por :func:`os.strerror` podem ser afetadas por esta categoria.

source: This value may not be available on operating systems not conforming to the POSIX standard, most notably Windows.
pt_br: Esse valor pode não estar disponível em sistemas operacionais que não estejam em conformidade com o padrão POSIX, principalmente o Windows.

source: Locale category for formatting numbers. The functions :func:`format_string`, :func:`atoi`, :func:`atof` and :func:`.str` of the :mod:`locale` module are affected by that category. All other numeric formatting operations are not affected.
pt_br: Categoria da localidade para formatação de números. As funções :func:`format_string`, :func:`atoi`, :func:`atof` e :func:`.str` do módulo :mod:`locale` são afetadas por essa categoria. Todas as outras operações de formatação numérica não são afetadas.

source: Combination of all locale settings. If this flag is used when the locale is changed, setting the locale for all categories is attempted. If that fails for any category, no category is changed at all. When the locale is retrieved using this flag, a string indicating the setting for all categories is returned. This string can be later used to restore the settings.
pt_br: Combinação de todas as configurações da localidade. Se este sinalizador for usado quando a localidade for alterada, a configuração da localidade para todas as categorias será tentada. Se isso falhar para qualquer categoria, nenhuma categoria é alterada. Quando a localidade é recuperada usando este sinalizador, uma string indicando a configuração para todas as categorias é retornada. Esta string pode ser usada posteriormente para restaurar as configurações.

source: This is a symbolic constant used for different values returned by :func:`localeconv`.
pt_br: Esta é uma constante simbólica usada para diferentes valores retornados por :func:`localeconv`.

source: Example::
pt_br: Exemplo::

source: >>> import locale >>> loc = locale.getlocale() # get current locale # use German locale; name might vary with platform >>> locale.setlocale(locale.LC_ALL, 'de_DE') >>> locale.strcoll('f\xe4n', 'foo') # compare a string containing an umlaut >>> locale.setlocale(locale.LC_ALL, '') # use user's preferred locale >>> locale.setlocale(locale.LC_ALL, 'C') # use default (C) locale >>> locale.setlocale(locale.LC_ALL, loc) # restore saved locale
pt_br: >>> import locale >>> loc = locale.getlocale() # obtém localidade atual # usa localidade de alemão; o nome pode variar conforme plataforma >>> locale.setlocale(locale.LC_ALL, 'de_DE') >>> locale.strcoll('f\xe4n', 'foo') # compara uma string contendo um umlaut >>> locale.setlocale(locale.LC_ALL, '') # usa a localidade preferida do usuário >>> locale.setlocale(locale.LC_ALL, 'C') # usa a localidade padrão (C) >>> locale.setlocale(locale.LC_ALL, loc) # restaura localidade salva

source: Background, details, hints, tips and caveats
pt_br: Histórico, detalhes, dicas, dicas e advertências

source: The C standard defines the locale as a program-wide property that may be relatively expensive to change. On top of that, some implementations are broken in such a way that frequent locale changes may cause core dumps. This makes the locale somewhat painful to use correctly.
pt_br: O padrão C define a localidade como uma propriedade de todo o programa que pode ser relativamente cara para alterar. Além disso, algumas implementações são interrompidas de forma que mudanças frequentes de localidade podem causar despejos de memória. Isso torna a localidade um tanto dolorosa de usar corretamente.

source: Initially, when a program is started, the locale is the ``C`` locale, no matter what the user's preferred locale is. There is one exception: the :data:`LC_CTYPE` category is changed at startup to set the current locale encoding to the user's preferred locale encoding. The program must explicitly say that it wants the user's preferred locale settings for other categories by calling ``setlocale(LC_ALL, '')``.
pt_br: Inicialmente, quando um programa é iniciado, a localidade é a localidade ``C``, não importa qual a localidade preferida do usuário. Há uma exceção: a categoria :data:`LC_CTYPE` é alterada na inicialização para definir a codificação de localidade atual para a codificação de localidade preferida do usuário. O programa deve dizer explicitamente que deseja as configurações de localidade preferidas do usuário para outras categorias chamando ``setlocale(LC_ALL, '')``.

source: It is generally a bad idea to call :func:`setlocale` in some library routine, since as a side effect it affects the entire program. Saving and restoring it is almost as bad: it is expensive and affects other threads that happen to run before the settings have been restored.
pt_br: Geralmente é uma má ideia chamar :func:`setlocale` em alguma rotina de biblioteca, já que como efeito colateral afeta todo o programa. Salvar e restaurar é quase tão ruim: é caro e afeta outras threads que são executadas antes de as configurações serem restauradas.

source: If, when coding a module for general use, you need a locale independent version of an operation that is affected by the locale (such as certain formats used with :func:`time.strftime`), you will have to find a way to do it without using the standard library routine. Even better is convincing yourself that using locale settings is okay. Only as a last resort should you document that your module is not compatible with non-\ ``C`` locale settings.
pt_br: Se, ao codificar um módulo para uso geral, você precisa de uma versão independente da localidade de uma operação que é afetada pela localidade (como certos formatos usados com :func:`time.strftime`), você terá que encontrar uma maneira de faça isso sem usar a rotina de biblioteca padrão. Melhor ainda é se convencer de que não há problema em usar as configurações da localidade. Apenas como último recurso, você deve documentar que seu módulo não é compatível com configurações de localidade não-\ ``C``.

source: The only way to perform numeric operations according to the locale is to use the special functions defined by this module: :func:`atof`, :func:`atoi`, :func:`format_string`, :func:`.str`.
pt_br: A única maneira de realizar operações numéricas de acordo com a localidade é usar as funções especiais definidas por este módulo: :func:`atof`, :func:`atoi`, :func:`format_string`, :func:`.str`.

source: There is no way to perform case conversions and character classifications according to the locale. For (Unicode) text strings these are done according to the character value only, while for byte strings, the conversions and classifications are done according to the ASCII value of the byte, and bytes whose high bit is set (i.e., non-ASCII bytes) are never converted or considered part of a character class such as letter or whitespace.
pt_br: Não há como realizar conversões de maiúsculas e minúsculas e classificações de caracteres de acordo com a localidade. Para strings de texto (Unicode), isso é feito de acordo com o valor do caractere apenas, enquanto para strings de byte, as conversões e classificações são feitas de acordo com o valor ASCII do byte e bytes cujo bit alto está definido (ou seja, bytes não ASCII ) nunca são convertidos ou considerados parte de uma classe de caracteres, como letras ou espaços em branco.

source: Locale names
pt_br: Nomes de localidades

source: The format of the locale name is platform dependent, and the set of supported locales can depend on the system configuration.
pt_br: O formato do nome de localidade depende da plataforma, e o conjunto de locais suportados pode depender da configuração do sistema.

source: On Posix platforms, it usually has the format [1]_:
pt_br: Em plataformas Posix, isso geralmente tem o formato [1]_:

source: where *language* is a two- or three-letter language code from `ISO 639`_, *territory* is a two-letter country or region code from `ISO 3166`_, *charset* is a locale encoding, and *modifier* is a script name, a language subtag, a sort order identifier, or other locale modifier (for example, "latin", "valencia", "stroke" and "euro").
pt_br: onde *language* é um código de idioma de duas ou três letras da `ISO 639`_, *territory* é um código de país ou região de duas letras da `ISO 3166`_, *charset* é uma codificação de localidade e *modifier* é um nome de script, uma subtag de idioma, um identificador de ordem de classificação ou outro modificador de localidade (por exemplo, "latin", "valencia", "stroke" e "euro").

source: On Windows, several formats are supported. [2]_ [3]_ A subset of `IETF BCP 47`_ tags:
pt_br: No Windows, vários formatos são suportados. [2]_ [3]_ Um subconjunto de tags `IETF BCP 47`_:

source: where *language* and *territory* have the same meaning as in Posix, *script* is a four-letter script code from `ISO 15924`_, and *modifier* is a language subtag, a sort order identifier or custom modifier (for example, "valencia", "stroke" or "x-python"). Both hyphen (``'-'``) and underscore (``'_'``) separators are supported. Only UTF-8 encoding is allowed for BCP 47 tags.
pt_br: onde *language* e *territory* têm o mesmo significado que em Posix, *script* é um código de script de quatro letras da `ISO 15924`_ e *modifier* é uma subtag de idioma, um identificador de ordem de classificação ou modificador personalizado (por exemplo, "valencia", "stroke" ou "x-python"). São aceitos os separadores hífen (``'-'``) e sublinhado (``'_'``). Somente a codificação UTF-8 é permitida para tags BCP 47.

source: Windows also supports locale names in the format:
pt_br: O Windows também oferece suporte a nomes de localidade no formato:

source: where *language* and *territory* are full names, such as "English" and "United States", and *charset* is either a code page number (for example, "1252") or UTF-8. Only the underscore separator is supported in this format.
pt_br: onde *language* e *territory* são nomes completos, como "English" e "United States", e *charset* é um número de página de código (por exemplo, "1252") ou UTF-8. Só é aceito o separador sublinhado neste formato.

source: The "C" locale is supported on all platforms.
pt_br: A localidade "C" é aceita em todas as plataformas.

source: `UCRT Locale names, Languages, and Country/Region strings <https://learn.microsoft.com/en-us/cpp/c-runtime-library/locale-names-languages-and-country-region-strings>`_
pt_br: `Nomes de localidade, idiomas e strings de país/região do UCRT <https://learn.microsoft.com/pt-br/cpp/c-runtime-library/locale-names-languages-and-country-region-strings>`_

source: `Locale Names <https://learn.microsoft.com/en-us/windows/win32/intl/locale-names>`_
pt_br: `Nomes de localidade <https://learn.microsoft.com/pt-br/windows/win32/intl/locale-names>`_

source: For extension writers and programs that embed Python
pt_br: Para escritores de extensão e programas que incorporam Python

source: Extension modules should never call :func:`setlocale`, except to find out what the current locale is. But since the return value can only be used portably to restore it, that is not very useful (except perhaps to find out whether or not the locale is ``C``).
pt_br: Módulos de extensão nunca devem chamar :func:`setlocale`, exceto para descobrir qual é a localidade atual. Mas uma vez que o valor de retorno só pode ser usado portavelmente para restaurá-lo, isso não é muito útil (exceto talvez para descobrir se a localidade é ou não ``C``).

source: When Python code uses the :mod:`locale` module to change the locale, this also affects the embedding application. If the embedding application doesn't want this to happen, it should remove the :mod:`!_locale` extension module (which does all the work) from the table of built-in modules in the :file:`config.c` file, and make sure that the :mod:`!_locale` module is not accessible as a shared library.
pt_br: Quando o código Python usa o módulo :mod:`locale` para alterar a localidade, isso também afeta a aplicação de incorporação. Se a aplicação de incorporação não quiser que isso aconteça, ele deve remover o módulo de extensão :mod:`!_locale` (que faz todo o trabalho) da tabela de módulos embutidos no arquivo :file:`config.c` e certificar-se de que o módulo :mod:`!_locale` não está acessível como uma biblioteca compartilhada.

source: Access to message catalogs
pt_br: Acesso a catálogos de mensagens

source: The locale module exposes the C library's gettext interface on systems that provide this interface. It consists of the functions :func:`gettext`, :func:`dgettext`, :func:`dcgettext`, :func:`textdomain`, :func:`bindtextdomain`, and :func:`bind_textdomain_codeset`. These are similar to the same functions in the :mod:`gettext` module, but use the C library's binary format for message catalogs, and the C library's search algorithms for locating message catalogs.
pt_br: O módulo locale expõe a interface gettext da biblioteca C em sistemas que fornecem essa interface. Consiste nas funções :func:`gettext`, :func:`dgettext`, :func:`dcgettext`, :func:`textdomain`, :func:`bindtextdomain` e :func:`bind_textdomain_codeset`. Elas são semelhantes às mesmas funções no módulo :mod:`gettext`, mas usam o formato binário da biblioteca C para catálogos de mensagens e os algoritmos de pesquisa da biblioteca C para localizar catálogos de mensagens.

source: Python applications should normally find no need to invoke these functions, and should use :mod:`gettext` instead. A known exception to this rule are applications that link with additional C libraries which internally invoke C functions ``gettext`` or ``dcgettext``. For these applications, it may be necessary to bind the text domain, so that the libraries can properly locate their message catalogs.
pt_br: As aplicações Python normalmente não precisam invocar essas funções e devem usar :mod:`gettext` em seu lugar. Uma exceção conhecida a esta regra são os aplicativos que se vinculam a bibliotecas C adicionais que invocam internamente ``gettext`` ou ``dcgettext``. Para essas aplicações, pode ser necessário vincular o domínio de texto, para que as bibliotecas possam localizar adequadamente seus catálogos de mensagens.

source: module
pt_br: módulo
