Repository: python/python-docs-pt-br
Catalog: library/locale.po
Languages: pt_br

source: :mod:`!locale` --- Internationalization services
pt_br: :mod:`!locale` --- Serviços de internacionalização

source: **Source code:** :source:`Lib/locale.py`
pt_br: **Código-fonte:** :source:`Lib/locale.py`

source: The :mod:`locale` module opens access to the POSIX locale database and functionality. The POSIX locale mechanism allows programmers to deal with certain cultural issues in an application, without requiring the programmer to know all the specifics of each country where the software is executed.
pt_br: O módulo :mod:`locale` abre o acesso ao banco de dados de localidade POSIX e funcionalidade. O mecanismo de localidade POSIX permite que os programadores lidem com certas questões culturais em uma aplicação, sem exigir que o programador conheça todas as especificidades de cada país onde o software é executado.

source: The :mod:`locale` module is implemented on top of the :mod:`!_locale` module, which in turn uses an ANSI C locale implementation if available.
pt_br: O módulo :mod:`locale` é implementado em cima do módulo :mod:`!_locale`, que por sua vez usa uma implementação a localidade ANSI C se disponível.

source: The :mod:`locale` module defines the following exception and functions:
pt_br: O módulo :mod:`locale` define a seguinte exceção e funções:

source: Exception raised when the locale passed to :func:`setlocale` is not recognized.
pt_br: Exceção levantada quando a localidade passada para :func:`setlocale` não é reconhecida.

source: If *locale* is given and not ``None``, :func:`setlocale` modifies the locale setting for the *category*. The available categories are listed in the data description below. *locale* may be a :ref:`string <locale_name>`, or a pair, language code and encoding. An empty string specifies the user's default settings. If the modification of the locale fails, the exception :exc:`Error` is raised. If successful, the new locale setting is returned.
pt_br: Se *locale* for fornecido e não ``None``, :func:`setlocale` modifica a configuração de locale para a *category*. As categorias disponíveis estão listadas na descrição dos dados abaixo. *locale* pode ser uma :ref:`string <locale_name>` ou um par, código de idioma e codificação. Uma string vazia especifica as configurações padrão do usuário. Se a modificação da localidade falhar, a exceção :exc:`Error` é levantada. Se for bem-sucedido, a nova configuração de localidade será retornada.

source: If *locale* is a pair, it is converted to a locale name using the locale aliasing engine. The language code has the same format as a :ref:`locale name <locale_name>`, but without encoding and ``@``-modifier. The language code and encoding can be ``None``.
pt_br: Se *locale* for um par, ele será convertido em um nome de localidade usando o mecanismo de apelidamento de localidade. O código de idioma tem o mesmo formato de :ref:`nome da localidade <locale_name>`, mas sem codificação e modificador ``@``. O código de idioma e a codificação podem ser ``None``.

source: If *locale* is omitted or ``None``, the current setting for *category* is returned.
pt_br: Se *locale* for omitido ou ``None``, a configuração atual para *category* é retornada.

source: :func:`setlocale` is not thread-safe on most systems. Applications typically start with a call of ::
pt_br: :func:`setlocale` não é seguro para thread na maioria dos sistemas. As aplicações normalmente começam com uma chamada de ::

source: This sets the locale for all categories to the user's default setting (typically specified in the :envvar:`LANG` environment variable). If the locale is not changed thereafter, using multithreading should not cause problems.
pt_br: Isso define a localidade de todas as categorias para a configuração padrão do usuário (normalmente especificada na variável de ambiente :envvar:`LANG`). Se a localidade não for alterada depois disso, o uso de multithreading não deve causar problemas.

source: Returns the database of the local conventions as a dictionary. This dictionary has the following strings as keys:
pt_br: Retorna o banco de dados das convenções locais como um dicionário. Este dicionário possui as seguintes strings como chaves:

source: Category
pt_br: Categoria

source: Key
pt_br: Chave

source: Meaning
pt_br: Significado

source: Decimal point character.
pt_br: Caractere de ponto decimal.

source: Sequence of numbers specifying which relative positions the ``'thousands_sep'`` is expected. If the sequence is terminated with :const:`CHAR_MAX`, no further grouping is performed. If the sequence terminates with a ``0``, the last group size is repeatedly used.
pt_br: Sequência de números especificando quais posições relativas os ``'thousands_sep'`` são esperados. Se a sequência for terminada com :const:`CHAR_MAX`, nenhum agrupamento adicional é realizado. Se a sequência termina com um ``0``, o tamanho do último grupo é usado repetidamente.

source: Character used between groups.
pt_br: Caractere usado entre grupos.

source: International currency symbol.
pt_br: Símbolo internacional de moeda.

source: Local currency symbol.
pt_br: Símbolo local de moeda.

source: Whether the currency symbol precedes the value (for positive resp. negative values).
pt_br: Se o símbolo da moeda precede o valor (para valores positivos ou negativos).

source: Whether the currency symbol is separated from the value by a space (for positive resp. negative values).
pt_br: Se o símbolo monetário está separado do valor por um espaço (para valores positivos ou negativos).

source: Decimal point used for monetary values.
pt_br: Ponto decimal usado para valores monetários.

source: Number of fractional digits used in local formatting of monetary values.
pt_br: Número de dígitos fracionários usados na formatação local de valores monetários.

source: Number of fractional digits used in international formatting of monetary values.
pt_br: Número de dígitos fracionários usados na formatação internacional de valores monetários.

source: Group separator used for monetary values.
pt_br: Separador de grupo usado para valores monetários.

source: Equivalent to ``'grouping'``, used for monetary values.
pt_br: Equivalente a ``'grouping'``, usado para valores monetários.

source: Symbol used to annotate a positive monetary value.
pt_br: Símbolo usado para anotar um valor monetário positivo.

source: Symbol used to annotate a negative monetary value.
pt_br: Símbolo usado para anotar um valor monetário negativo.

source: The position of the sign (for positive resp. negative values), see below.
pt_br: A posição do sinal (para valores positivos resp. negativos), veja abaixo.

source: All numeric values can be set to :const:`CHAR_MAX` to indicate that there is no value specified in this locale.
pt_br: Todos os valores numéricos podem ser definidos como :const:`CHAR_MAX` para indicar que não há valor especificado nesta localidade.

source: The possible values for ``'p_sign_posn'`` and ``'n_sign_posn'`` are given below.
pt_br: Os valores possíveis para ``'p_sign_posn'`` e ``'n_sign_posn'`` são dados abaixo.

source: Value
pt_br: Valor

source: Explanation
pt_br: Explicação

source: Currency and value are surrounded by parentheses.
pt_br: A moeda e o valor estão entre parênteses.

source: The sign should precede the value and currency symbol.
pt_br: O sinal deve preceder o valor e o símbolo da moeda.

source: The sign should follow the value and currency symbol.
pt_br: O sinal deve seguir o valor e o símbolo da moeda.

source: The sign should immediately precede the value.
pt_br: O sinal deve preceder imediatamente o valor.

source: The sign should immediately follow the value.
pt_br: O sinal deve seguir imediatamente o valor.

source: Nothing is specified in this locale.
pt_br: Nada é especificado nesta localidade.

source: The function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale or the ``LC_MONETARY`` locale if locales are different and numeric or monetary strings are non-ASCII. This temporary change affects other threads.
pt_br: A função define temporariamente a localidade de ``LC_CTYPE`` para a localidade de ``LC_NUMERIC`` ou a localidade de ``LC_MONETARY`` se as localidades forem diferentes e as strings numéricas ou monetárias não forem ASCII. Esta mudança temporária afeta outras threads.

source: The function now temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
pt_br: A função agora define temporariamente a localidade de ``LC_CTYPE`` para a localidade de ``LC_NUMERIC`` em alguns casos.

source: Return some locale-specific information as a string. This function is not available on all systems, and the set of possible options might also vary across platforms. The possible argument values are numbers, for which symbolic constants are available in the locale module.
pt_br: Retorna algumas informações específicas da localidade em uma string. Esta função não está disponível em todos os sistemas e o conjunto de opções possíveis também pode variar entre as plataformas. Os valores de argumento possíveis são números, para os quais constantes simbólicas estão disponíveis no módulo da localidade.

source: The :func:`nl_langinfo` function accepts one of the following keys. Most descriptions are taken from the corresponding description in the GNU C library.
pt_br: A função :func:`nl_langinfo` aceita uma das seguintes chaves. A maioria das descrições são tiradas da descrição correspondente na biblioteca GNU C.

source: Get a string with the name of the character encoding used in the selected locale.
pt_br: Obtém uma string com o nome da codificação de caracteres usada na localidade selecionado.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent date and time in a locale-specific way.
pt_br: Obtém uma string que pode ser usada como uma string de formato para :func:`time.strftime` para representar a data e a hora de uma maneira específica da localidade.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a date in a locale-specific way.
pt_br: Obtém uma string que pode ser usada como uma string de formato para :func:`time.strftime` para representar uma data de uma maneira específica da localidade.

source: Get a string that can be used as a format string for :func:`time.strftime` to represent a time in a locale-specific way.
pt_br: Obtém uma string que pode ser usada como uma string de formato para :func:`time.strftime` para representar uma hora de uma maneira específica da localidade.

source: Get a format string for :func:`time.strftime` to represent time in the am/pm format.
pt_br: Obtém uma string de formato para :func:`time.strftime` para representar a hora no formato am/pm.

source: Get the name of the n-th day of the week.
pt_br: Obtém o nome do enésimo dia da semana.

source: This follows the US convention of :const:`DAY_1` being Sunday, not the international convention (ISO 8601) that Monday is the first day of the week.
pt_br: Isso segue a convenção dos EUA de :const:`DAY_1` ser no domingo, não a convenção internacional (ISO 8601) que segunda-feira é o primeiro dia da semana.

source: Get the abbreviated name of the n-th day of the week.
pt_br: Obtém o nome abreviado do enésimo dia da semana.

source: Get the name of the n-th month.
pt_br: Obtém o nome do enésimo dia do mês.

source: Get the abbreviated name of the n-th month.
pt_br: Obtém o nome abreviado do enésimo dia do mês.

source: Get the radix character (decimal dot, decimal comma, etc.).
pt_br: Obtém o caractere separador decimal (ponto decimal, vírgula decimal etc.).

source: Get the separator character for thousands (groups of three digits).
pt_br: Obtém o caractere separador para milhares (grupos de três dígitos).

source: Get a regular expression that can be used with the regex function to recognize a positive response to a yes/no question.
pt_br: Obtém uma expressão regular que pode ser usada com a função regex para reconhecer uma resposta positiva a uma pergunta sim/não.

source: Get a regular expression that can be used with the ``regex(3)`` function to recognize a negative response to a yes/no question.
pt_br: Obtém uma expressão regular que pode ser usada com a função ``regex(3)`` para reconhecer uma resposta negativa a uma pergunta sim/não.

source: The regular expressions for :const:`YESEXPR` and :const:`NOEXPR` use syntax suitable for the ``regex`` function from the C library, which might differ from the syntax used in :mod:`re`.
pt_br: As expressões regulares para :const:`YESEXPR` e :const:`NOEXPR` usam uma sintaxe adequada para a função ``regex`` da biblioteca C, que pode ser diferente da sintaxe usada em :mod:`re`.

source: Get the currency symbol, preceded by "-" if the symbol should appear before the value, "+" if the symbol should appear after the value, or "." if the symbol should replace the radix character.
pt_br: Obtém o símbolo da moeda, precedido por "-" se o símbolo deve aparecer antes do valor, "+" se o símbolo deve aparecer após o valor ou "." se o símbolo deve substituir o caractere separador decimal.

source: Get a string which describes how years are counted and displayed for each era in a locale.
pt_br: Obtém uma string que descreva como os anos são contados e exibidos para cada era em um localidade.

source: Most locales do not define this value. An example of a locale which does define this value is the Japanese one. In Japan, the traditional representation of dates includes the name of the era corresponding to the then-emperor's reign.
pt_br: A maioria das localidades não define esse valor. Um exemplo de localidade que define esse valor é o japonês. No Japão, a representação tradicional de datas inclui o nome da época correspondente ao reinado do então imperador.

source: Normally it should not be necessary to use this value directly. Specifying the ``E`` modifier in their format strings causes the :func:`time.strftime` function to use this information. The format of the returned string is specified in *The Open Group Base Specifications Issue 8*, paragraph `7.3.5.2 LC_TIME C-Language Access <https://pubs.opengroup.org/onlinepubs/9799919799/basedefs/V1_chap07.html#tag_07_03_05_02>`_.
pt_br: Normalmente, não deve ser necessário usar esse valor diretamente. Especificar o modificador ``E`` em suas strings de formato faz com que a função :func:`time.strftime` use essas informações. O formato da string retornada é especificado em *The Open Group Base Specifications Issue 8*, parágrafo `7.3.5.2 LC_TIME C-Language Access <https://pubs.opengroup.org/onlinepubs/9799919799/basedefs/V1_chap07.html#tag_07_03_05_02>`_.

source: Get a format string for :func:`time.strftime` to represent date and time in a locale-specific era-based way.
pt_br: Obtém uma string de formato para :func:`time.strftime` para representar a data e a hora de uma forma baseada na era específica da localidade.

source: Get a format string for :func:`time.strftime` to represent a date in a locale-specific era-based way.
pt_br: Obtém uma string de formato para :func:`time.strftime` para representar uma data em uma forma baseada em era específica da localidade.

source: Get a format string for :func:`time.strftime` to represent a time in a locale-specific era-based way.
pt_br: Obtém uma string de formato para :func:`time.strftime` para representar uma hora em uma forma baseada em era específica da localidade.

source: Get a string consisting of up to 100 semicolon-separated symbols used to represent the values 0 to 99 in a locale-specific way. In most locales this is an empty string.
pt_br: Obtém uma string consistindo de até 100 símbolos separados por ponto e vírgula usados para representar os valores de 0 a 99 de uma forma específica de localidade. Na maioria das localidades, esta é uma string vazia.

source: The function temporarily sets the ``LC_CTYPE`` locale to the locale of the category that determines the requested value (``LC_TIME``, ``LC_NUMERIC``, ``LC_MONETARY`` or ``LC_MESSAGES``) if locales are different and the resulting string is non-ASCII. This temporary change affects other threads.
pt_br: A função define temporariamente a localidade ``LC_CTYPE`` para a localidade da categoria que determina o valor solicitado (``LC_TIME``, ``LC_NUMERIC``, ``LC_MONETARY`` ou ``LC_MESSAGES``) se as localidades forem diferentes e a string resultante não for ASCII. Essa alteração temporária afeta outras threads.

source: The function now temporarily sets the ``LC_CTYPE`` locale in some cases.
pt_br: A função agora define temporariamente a localidade de ``LC_CTYPE`` em alguns casos.

source: Tries to determine the default locale settings and returns them as a tuple of the form ``(language code, encoding)``.
pt_br: Tenta determinar as configurações de localidade padrão e as retorna como uma tupla na forma ``(language code, encoding)``.

source: According to POSIX, a program which has not called ``setlocale(LC_ALL, '')`` runs using the portable ``'C'`` locale. Calling ``setlocale(LC_ALL, '')`` lets it use the default locale as defined by the :envvar:`LANG` variable. Since we do not want to interfere with the current locale setting we thus emulate the behavior in the way described above.
pt_br: De acordo com POSIX, um programa que não chamou ``setlocale(LC_ALL, '')`` executa usando a localidade portátil ``'C'``. Chamar ``setlocale(LC_ALL, '')`` permite que ele use a localidade padrão conforme definido pela variável :envvar:`LANG`. Como não queremos interferir com a configuração de localidade atual, emulamos o comportamento da maneira descrita acima.

source: To maintain compatibility with other platforms, not only the :envvar:`LANG` variable is tested, but a list of variables given as envvars parameter. The first found to be defined will be used. *envvars* defaults to the search path used in GNU gettext; it must always contain the variable name ``'LANG'``. The GNU gettext search path contains ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` and ``'LANGUAGE'``, in that order.
pt_br: Para manter a compatibilidade com outras plataformas, não apenas a variável :envvar:`LANG` é testada, mas uma lista de variáveis fornecida como parâmetro envvars. Será utilizado o primeiro encontrado a ser definido. *envvars* padroniza para o caminho de pesquisa usado no GNU gettext; deve sempre conter o nome da variável ``'LANG'``. O caminho de pesquisa do GNU gettext contém ``'LC_ALL'``, ``'LC_CTYPE'``, ``'LANG'`` e ``'LANGUAGE'``, nesta ordem.

source: The language code has the same format as a :ref:`locale name <locale_name>`, but without encoding and ``@``-modifier. The language code and encoding may be ``None`` if their values cannot be determined. The "C" locale is represented as ``(None, None)``.
pt_br: O código de idioma tem o mesmo formato de :ref:`nome de localidade <locale_name>`, mas sem codificação e modificador ``@``. O código de idioma e a codificação podem ser ``None`` se seus valores não puderem ser determinados. O locale "C" é representado como ``(None, None)``.

source: Returns the current setting for the given locale category as a tuple containing the language code and encoding. *category* may be one of the :const:`!LC_\*` values except :const:`LC_ALL`. It defaults to :const:`LC_CTYPE`.
pt_br: Retorna a configuração atual para a categoria de localidade fornecida como uma tupla contendo o código de idioma e a codificação. *category* pode ser um dos valores :const:`!LC_\*`, exceto :const:`LC_ALL`. O padrão é :const:`LC_CTYPE`.

source: Return the :term:`locale encoding` used for text data, according to user preferences. User preferences are expressed differently on different systems, and might not be available programmatically on some systems, so this function only returns a guess.
pt_br: Retorna a :term:`codificação da localidade` usada para dados de texto, de acordo com as preferências do usuário. As preferências do usuário são expressas de maneira diferente em sistemas diferentes e podem não estar disponíveis programaticamente em alguns sistemas, portanto, essa função retorna apenas uma estimativa.

source: On some systems, it is necessary to invoke :func:`setlocale` to obtain the user preferences, so this function is not thread-safe. If invoking setlocale is not necessary or desired, *do_setlocale* should be set to ``False``.
pt_br: Em alguns sistemas, é necessário invocar :func:`setlocale` para obter as preferências do usuário, portanto, esta função não é segura para thread. Se invocar setlocale não for necessário ou desejado, *do_setlocale* deve ser definido como ``False``.

source: On Android or if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, always return ``'utf-8'``, the :term:`locale encoding` and the *do_setlocale* argument are ignored.
pt_br: No Android ou se o :ref:`Modo UTF-8 do Python <utf8-mode>` é retornado, sempre retorna ``'utf-8'``, a :term:`codificação da localidade` e o argumento *do_setlocale* são ignorados.

source: The :ref:`Python preinitialization <c-preinit>` configures the LC_CTYPE locale. See also the :term:`filesystem encoding and error handler`.
pt_br: A :ref:`pré-inicialização do Python <c-preinit>` configura a localidade LC_CTYPE. Veja também :term:`tratador de erros e codificação do sistema de arquivos`.

source: The function now always returns ``"utf-8"`` on Android or if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled.
pt_br: A função agora sempre retorna ``"utf-8"`` no Android ou se o :ref:`Modo UTF-8 do Python <utf8-mode>` estiver habilitado.

source: Get the current :term:`locale encoding`:
pt_br: Obtém a atual :term:`codificação da localidade`:

source: On Android and VxWorks, return ``"utf-8"``.
pt_br: No Android e no VxWorks, retorna ``"utf-8"``.

source: On Unix, return the encoding of the current :data:`LC_CTYPE` locale. Return ``"utf-8"`` if ``nl_langinfo(CODESET)`` returns an empty string: for example, if the current LC_CTYPE locale is not supported.
pt_br: No Unix, retorna a codificação da localidade :data:`LC_CTYPE` atual. Retorna ``"utf-8"`` se ``nl_langinfo(CODESET)`` retornar uma string vazia: por exemplo, se a localidade LC_CTYPE atual não for compatível.

source: On Windows, return the ANSI code page.
pt_br: No Windows, retorna a página de código ANSI.

source: This function is similar to :func:`getpreferredencoding(False) <getpreferredencoding>` except this function ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_br: Este função é semelhante a :func:`getpreferredencoding(False) <getpreferredencoding>`, exceto pelo fato de que esta função ignora o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: Returns a normalized locale code for the given locale name. The returned locale code is formatted for use with :func:`setlocale`. If normalization fails, the original name is returned unchanged.
pt_br: Retorna um código de localidade normalizado para o nome de localidade fornecido. O código de localidade retornado é formatado para uso com :func:`setlocale`. Se a normalização falhar, o nome original será retornado inalterado.

source: If the given encoding is not known, the function defaults to the default encoding for the locale code just like :func:`setlocale`.
pt_br: Se a codificação fornecida não for conhecida, o padrão da função é a codificação padrão para o código da localidade, assim como :func:`setlocale`.

source: Compares two strings according to the current :const:`LC_COLLATE` setting. As any other compare function, returns a negative, or a positive value, or ``0``, depending on whether *string1* collates before or after *string2* or is equal to it.
pt_br: Compara duas strings de acordo com a configuração atual :const:`LC_COLLATE`. Como qualquer outra função de comparação, retorna um valor negativo ou positivo, ou ``0``, dependendo se *string1* agrupa antes ou depois de *string2* ou é igual a ele.
