Repository: python/python-docs-pt-br
Catalog: library/logging.handlers.po
Languages: pt_br

source: The system will save old log files by appending extensions to the filename. The extensions are date-and-time based, using the strftime format ``%Y-%m-%d_%H-%M-%S`` or a leading portion thereof, depending on the rollover interval.
pt_br: Система збереже старі файли журналу, додавши розширення до імені файлу. Розширення базуються на даті й часі з використанням формату strftime ``%Y-%m-%d_%H-%M-%S`` або його початкової частини, залежно від інтервалу переходу.

source: When computing the next rollover time for the first time (when the handler is created), the last modification time of an existing log file, or else the current time, is used to compute when the next rotation will occur.
pt_br: Під час першого обчислення часу наступного переходу (під час створення обробника) для обчислення часу наступного повороту використовується час останньої зміни наявного файлу журналу або поточний час.

source: If the *utc* argument is true, times in UTC will be used; otherwise local time is used.
pt_br: Якщо аргумент *utc* має значення true, буде використано час у UTC; інакше використовується місцевий час.

source: If *backupCount* is nonzero, at most *backupCount* files will be kept, and if more would be created when rollover occurs, the oldest one is deleted. The deletion logic uses the interval to determine which files to delete, so changing the interval may leave old files lying around.
pt_br: Якщо *backupCount* не дорівнює нулю, буде збережено щонайбільше *backupCount* файлів, а якщо буде створено більше під час перенесення файлів, видаляється найстаріший. Логіка видалення використовує інтервал, щоб визначити, які файли видаляти, тому зміна інтервалу може залишити старі файли без місця.

source: If *delay* is true, then file opening is deferred until the first call to :meth:`emit`.
pt_br: Якщо *delay* має значення true, то відкриття файлу відкладено до першого виклику :meth:`emit`.

source: If *atTime* is not ``None``, it must be a ``datetime.time`` instance which specifies the time of day when rollover occurs, for the cases where rollover is set to happen "at midnight" or "on a particular weekday". Note that in these cases, the *atTime* value is effectively used to compute the *initial* rollover, and subsequent rollovers would be calculated via the normal interval calculation.
pt_br: Якщо *atTime* не є ``None``, це має бути екземпляр ``datetime.time``, який визначає час доби, коли відбувається перекидання, для випадків, коли перекидання встановлено на "опівночі" або "на певний день тижня". Зауважте, що в цих випадках значення *atTime* ефективно використовується для обчислення *початкового* ролловера, а наступні ролловери обчислюватимуться за допомогою звичайного обчислення інтервалу.

source: If *errors* is specified, it's used to determine how encoding errors are handled.
pt_br: Якщо вказано *errors*, воно використовується для визначення способу обробки помилок кодування.

source: Calculation of the initial rollover time is done when the handler is initialised. Calculation of subsequent rollover times is done only when rollover occurs, and rollover occurs only when emitting output. If this is not kept in mind, it might lead to some confusion. For example, if an interval of "every minute" is set, that does not mean you will always see log files with times (in the filename) separated by a minute; if, during application execution, logging output is generated more frequently than once a minute, *then* you can expect to see log files with times separated by a minute. If, on the other hand, logging messages are only output once every five minutes (say), then there will be gaps in the file times corresponding to the minutes where no output (and hence no rollover) occurred.
pt_br: Розрахунок початкового часу перекидання виконується під час ініціалізації обробника. Розрахунок наступного часу ролловеру виконується лише тоді, коли відбувається ролловер, а ролловер відбувається лише під час випромінювання вихідних даних. Якщо цього не враховувати, це може призвести до певної плутанини. Наприклад, якщо встановлено інтервал "кожної хвилини", це не означає, що ви завжди бачитимете файли журналів із часом (у назві файлу), розділеними хвилиною; якщо під час виконання програми вихідні дані журналу генеруються частіше, ніж один раз на хвилину, *тоді* ви можете очікувати, що побачите файли журналу з часом, розділеним хвилиною. З іншого боку, якщо повідомлення журналу виводяться лише один раз кожні п’ять хвилин (скажімо), тоді будуть проміжки у часі файлу, що відповідає хвилинам, коли не було виведено (і, отже, не відбулося перекидання).

source: *atTime* parameter was added.
pt_br: Додано параметр *atTime*.

source: Outputs the record to the file, catering for rollover as described above.
pt_br: Виводить запис у файл, обслуговуючи ролловер, як описано вище.

source: Returns a list of filenames which should be deleted as part of rollover. These are the absolute paths of the oldest backup log files written by the handler.
pt_br: Повертає список імен файлів, які слід видалити під час переміщення. Це абсолютні шляхи до найстаріших резервних файлів журналу, записаних обробником.

source: The :class:`SocketHandler` class, located in the :mod:`logging.handlers` module, sends logging output to a network socket. The base class uses a TCP socket.
pt_br: Клас :class:`SocketHandler`, розташований у модулі :mod:`logging.handlers`, надсилає вихідні дані журналу в мережевий сокет. Базовий клас використовує сокет TCP.

source: Returns a new instance of the :class:`SocketHandler` class intended to communicate with a remote machine whose address is given by *host* and *port*.
pt_br: Повертає новий екземпляр класу :class:`SocketHandler`, призначений для зв’язку з віддаленою машиною, адресу якої вказують *host* і *port*.

source: If ``port`` is specified as ``None``, a Unix domain socket is created using the value in ``host`` - otherwise, a TCP socket is created.
pt_br: Якщо ``port`` вказано як ``None``, сокет домену Unix створюється за допомогою значення в ``host`` - інакше створюється сокет TCP.

source: Closes the socket.
pt_br: Закриває розетку.

source: Pickles the record's attribute dictionary and writes it to the socket in binary format. If there is an error with the socket, silently drops the packet. If the connection was previously lost, re-establishes the connection. To unpickle the record at the receiving end into a :class:`~logging.LogRecord`, use the :func:`~logging.makeLogRecord` function.
pt_br: Вибирає словник атрибутів запису та записує його в сокет у двійковому форматі. Якщо є помилка з сокетом, мовчки скидає пакет. Якщо з’єднання було втрачено, відновлює з’єднання. Щоб видалити запис на приймальному кінці в :class:`~logging.LogRecord`, скористайтеся :func:`~logging.makeLogRecord` функцією.

source: Handles an error which has occurred during :meth:`emit`. The most likely cause is a lost connection. Closes the socket so that we can retry on the next event.
pt_br: Обробляє помилку, яка сталася під час :meth:`emit`. Найімовірніша причина – втрата зв’язку. Закриває сокет, щоб ми могли повторити наступну подію.

source: This is a factory method which allows subclasses to define the precise type of socket they want. The default implementation creates a TCP socket (:const:`socket.SOCK_STREAM`).
pt_br: Це фабричний метод, який дозволяє підкласам визначати точний тип сокета, який вони хочуть. Стандартна реалізація створює сокет TCP (:const:`socket.SOCK_STREAM`).

source: Pickles the record's attribute dictionary in binary format with a length prefix, and returns it ready for transmission across the socket. The details of this operation are equivalent to::
pt_br: Вибирає словник атрибутів запису в двійковому форматі з префіксом довжини та повертає його готовим для передачі через сокет. Подробиці цієї операції еквівалентні:

source: Note that pickles aren't completely secure. If you are concerned about security, you may want to override this method to implement a more secure mechanism. For example, you can sign pickles using HMAC and then verify them on the receiving end, or alternatively you can disable unpickling of global objects on the receiving end.
pt_br: Зауважте, що мариновані огірки не є повністю безпечними. Якщо вас турбує безпека, ви можете замінити цей метод, щоб застосувати більш безпечний механізм. Наприклад, ви можете підписати соління за допомогою HMAC, а потім перевірити їх на приймальній стороні, або, як альтернатива, ви можете вимкнути розбирання глобальних об’єктів на приймальній стороні.

source: Send a pickled byte-string *packet* to the socket. The format of the sent byte-string is as described in the documentation for :meth:`~SocketHandler.makePickle`.
pt_br: Надішліть маринований байтовий рядок *пакет* до сокета. Формат надісланого байтового рядка відповідає документації для :meth:`~SocketHandler.makePickle`.

source: This function allows for partial sends, which can happen when the network is busy.
pt_br: Ця функція дозволяє частково надсилати, що може статися, коли мережа зайнята.

source: Tries to create a socket; on failure, uses an exponential back-off algorithm. On initial failure, the handler will drop the message it was trying to send. When subsequent messages are handled by the same instance, it will not try connecting until some time has passed. The default parameters are such that the initial delay is one second, and if after that delay the connection still can't be made, the handler will double the delay each time up to a maximum of 30 seconds.
pt_br: Намагається створити сокет; у разі відмови використовує експоненціальний алгоритм відстрочки. У разі початкової помилки обробник скине повідомлення, яке намагався надіслати. Коли наступні повідомлення обробляються тим самим екземпляром, він не намагатиметься підключитися, доки не мине деякий час. Параметри за замовчуванням такі, що початкова затримка становить одну секунду, і якщо після цієї затримки з’єднання все одно не вдається встановити, обробник кожного разу подвоює затримку до максимум 30 секунд.

source: This behaviour is controlled by the following handler attributes:
pt_br: Ця поведінка контролюється такими атрибутами обробника:

source: ``retryStart`` (initial delay, defaulting to 1.0 seconds).
pt_br: ``retryStart`` (початкова затримка, за замовчуванням 1,0 секунди).

source: ``retryFactor`` (multiplier, defaulting to 2.0).
pt_br: ``retryFactor`` (множник, за умовчанням 2,0).

source: ``retryMax`` (maximum delay, defaulting to 30.0 seconds).
pt_br: ``retryMax`` (максимальна затримка, за замовчуванням 30,0 секунд).

source: This means that if the remote listener starts up *after* the handler has been used, you could lose messages (since the handler won't even attempt a connection until the delay has elapsed, but just silently drop messages during the delay period).
pt_br: Це означає, що якщо віддалений слухач запускається *після* використання обробника, ви можете втратити повідомлення (оскільки обробник навіть не намагатиметься встановити з’єднання, доки не мине затримка, а лише мовчки видалятиме повідомлення протягом періоду затримки).

source: The :class:`DatagramHandler` class, located in the :mod:`logging.handlers` module, inherits from :class:`SocketHandler` to support sending logging messages over UDP sockets.
pt_br: Клас :class:`DatagramHandler`, розташований у модулі :mod:`logging.handlers`, успадковує :class:`SocketHandler` для підтримки надсилання повідомлень журналу через сокети UDP.

source: Returns a new instance of the :class:`DatagramHandler` class intended to communicate with a remote machine whose address is given by *host* and *port*.
pt_br: Повертає новий екземпляр класу :class:`DatagramHandler`, призначений для зв’язку з віддаленою машиною, адресу якої вказують *host* і *port*.

source: As UDP is not a streaming protocol, there is no persistent connection between an instance of this handler and *host*. For this reason, when using a network socket, a DNS lookup might have to be made each time an event is logged, which can introduce some latency into the system. If this affects you, you can do a lookup yourself and initialize this handler using the looked-up IP address rather than the hostname.
pt_br: Поскольку UDP не является протоколом потоковой передачи, между экземпляром этого обработчика и *хостом* не существует постоянного соединения. По этой причине при использовании сетевого сокета может потребоваться выполнять поиск DNS каждый раз при регистрации события, что может привести к некоторой задержке в системе. Если это вас затрагивает, вы можете выполнить поиск самостоятельно и инициализировать этот обработчик, используя найденный IP-адрес, а не имя хоста.

source: If ``port`` is specified as ``None``, a Unix domain socket is created using the value in ``host`` - otherwise, a UDP socket is created.
pt_br: Якщо ``port`` вказано як ``None``, сокет домену Unix створюється за допомогою значення в ``host``; інакше створюється сокет UDP.

source: Pickles the record's attribute dictionary and writes it to the socket in binary format. If there is an error with the socket, silently drops the packet. To unpickle the record at the receiving end into a :class:`~logging.LogRecord`, use the :func:`~logging.makeLogRecord` function.
pt_br: Вибирає словник атрибутів запису та записує його в сокет у двійковому форматі. Якщо є помилка з сокетом, мовчки скидає пакет. Щоб видалити запис на приймальному кінці в :class:`~logging.LogRecord`, скористайтеся :func:`~logging.makeLogRecord` функцією.

source: The factory method of :class:`SocketHandler` is here overridden to create a UDP socket (:const:`socket.SOCK_DGRAM`).
pt_br: Фабричний метод :class:`SocketHandler` тут перевизначено для створення сокета UDP (:const:`socket.SOCK_DGRAM`).

source: Send a pickled byte-string to a socket. The format of the sent byte-string is as described in the documentation for :meth:`SocketHandler.makePickle`.
pt_br: Надіслати маринований рядок байтів до сокета. Формат надісланого байтового рядка відповідає документації для :meth:`SocketHandler.makePickle`.

source: The :class:`SysLogHandler` class, located in the :mod:`logging.handlers` module, supports sending logging messages to a remote or local Unix syslog.
pt_br: Клас :class:`SysLogHandler`, розташований у модулі :mod:`logging.handlers`, підтримує надсилання повідомлень журналу до віддаленого чи локального системного журналу Unix.

source: Returns a new instance of the :class:`SysLogHandler` class intended to communicate with a remote Unix machine whose address is given by *address* in the form of a ``(host, port)`` tuple. If *address* is not specified, ``('localhost', 514)`` is used. The address is used to open a socket. An alternative to providing a ``(host, port)`` tuple is providing an address as a string, for example '/dev/log'. In this case, a Unix domain socket is used to send the message to the syslog. If *facility* is not specified, :const:`LOG_USER` is used. The type of socket opened depends on the *socktype* argument, which defaults to :const:`socket.SOCK_DGRAM` and thus opens a UDP socket. To open a TCP socket (for use with the newer syslog daemons such as rsyslog), specify a value of :const:`socket.SOCK_STREAM`.
pt_br: Повертає новий екземпляр класу :class:`SysLogHandler`, призначений для зв’язку з віддаленою машиною Unix, адреса якої задана *адресою* у формі кортежу ``(хост, порт)``. Якщо *адреса* не вказана, використовується ``('localhost', 514)``. Адреса використовується для відкриття сокета. Альтернативою наданню кортежу ``(хост, порт)`` є надання адреси у вигляді рядка, наприклад '/dev/log'. У цьому випадку для надсилання повідомлення до системного журналу використовується сокет домену Unix. Якщо *facility* не вказано, :const:`LOG_USER` використовується. Тип відкритого сокета залежить від аргументу *socktype*, який за замовчуванням має значення :const:`socket.SOCK_DGRAM` і таким чином відкриває сокет UDP. Щоб відкрити сокет TCP (для використання з новими демонами syslog, наприклад rsyslog), вкажіть значення :const:`socket.SOCK_STREAM`.

source: Note that if your server is not listening on UDP port 514, :class:`SysLogHandler` may appear not to work. In that case, check what address you should be using for a domain socket - it's system dependent. For example, on Linux it's usually '/dev/log' but on OS/X it's '/var/run/syslog'. You'll need to check your platform and use the appropriate address (you may need to do this check at runtime if your application needs to run on several platforms). On Windows, you pretty much have to use the UDP option.
pt_br: Зауважте, що якщо ваш сервер не прослуховує UDP-порт 514, :class:`SysLogHandler` може здатися непрацюючим. У такому випадку перевірте, яку адресу ви повинні використовувати для доменного сокета - це залежить від системи. Наприклад, у Linux це зазвичай '/dev/log', а в OS/X це '/var/run/syslog'. Вам потрібно буде перевірити свою платформу та використати відповідну адресу (може знадобитися виконати цю перевірку під час виконання, якщо ваша програма має працювати на кількох платформах). У Windows ви майже повинні використовувати параметр UDP.

source: On macOS 12.x (Monterey), Apple has changed the behaviour of their syslog daemon - it no longer listens on a domain socket. Therefore, you cannot expect :class:`SysLogHandler` to work on this system.
pt_br: В macOS 12.x (Монтерей) Apple изменила поведение своего демона системного журнала — он больше не прослушивает сокет домена. Следовательно, вы не можете ожидать, что :class:`SysLogHandler` будет работать в этой системе.

source: See :gh:`91070` for more information.
pt_br: См. :gh:`91070` для получения дополнительной информации.

source: *socktype* was added.
pt_br: Додано *socktype*.

source: Closes the socket to the remote host.
pt_br: Закриває сокет для віддаленого хоста.

source: Tries to create a socket and, if it's not a datagram socket, connect it to the other end. This method is called during handler initialization, but it's not regarded as an error if the other end isn't listening at this point - the method will be called again when emitting an event, if there is no socket at that point.
pt_br: Пытается создать сокет и, если это не дейтаграммный сокет, подключить его к другому концу. Этот метод вызывается во время инициализации обработчика, но он не считается ошибкой, если другой конец в этот момент не прослушивает — метод будет вызываться снова при отправке события, если в этот момент нет сокета.

source: The record is formatted, and then sent to the syslog server. If exception information is present, it is *not* sent to the server.
pt_br: Запис форматується, а потім надсилається на сервер syslog. Якщо присутня інформація про винятки, вона *не* надсилається на сервер.

source: (See: :issue:`12168`.) In earlier versions, the message sent to the syslog daemons was always terminated with a NUL byte, because early versions of these daemons expected a NUL terminated message - even though it's not in the relevant specification (:rfc:`5424`). More recent versions of these daemons don't expect the NUL byte but strip it off if it's there, and even more recent daemons (which adhere more closely to RFC 5424) pass the NUL byte on as part of the message.
pt_br: (Див.: :issue:`12168`.) У попередніх версіях повідомлення, надіслане до демонов системного журналу, завжди завершувалося нульовим байтом, оскільки ранні версії цих демонів очікували повідомлення, що завершується нульовим значенням, навіть якщо цього немає у відповідній специфікації (:rfc:`5424`). Новіші версії цих демонов не очікують байт NUL, але видаляють його, якщо він там є, і навіть новіші демони (які більше дотримуються RFC 5424) передають байт NUL як частину повідомлення.

source: To enable easier handling of syslog messages in the face of all these differing daemon behaviours, the appending of the NUL byte has been made configurable, through the use of a class-level attribute, ``append_nul``. This defaults to ``True`` (preserving the existing behaviour) but can be set to ``False`` on a ``SysLogHandler`` instance in order for that instance to *not* append the NUL terminator.
pt_br: Щоб полегшити обробку повідомлень системного журналу, незважаючи на всі ці відмінності в поведінці демона, додавання байта NUL було зроблено конфігурованим за допомогою атрибута рівня класу, ``append_nul``. За умовчанням це значення ``True`` (зберігаючи існуючу поведінку), але можна встановити ``False`` для екземпляра ``SysLogHandler``, щоб цей екземпляр *не* додавав термінатор NUL.

source: (See: :issue:`12419`.) In earlier versions, there was no facility for an "ident" or "tag" prefix to identify the source of the message. This can now be specified using a class-level attribute, defaulting to ``""`` to preserve existing behaviour, but which can be overridden on a ``SysLogHandler`` instance in order for that instance to prepend the ident to every message handled. Note that the provided ident must be text, not bytes, and is prepended to the message exactly as is.
pt_br: (Див.: :issue:`12419`.) У попередніх версіях не було можливості для префікса "ident" або "tag" для визначення джерела повідомлення. Тепер це можна вказати за допомогою атрибута рівня класу, який за замовчуванням має значення ``""``, щоб зберегти існуючу поведінку, але який можна перевизначити в екземплярі ``SysLogHandler``, щоб цей екземпляр додавав ідентифікатор перед кожним повідомленням обробляється. Зауважте, що наданий ідентифікатор має бути текстом, а не байтами, і додається до повідомлення точно так, як є.

source: Encodes the facility and priority into an integer. You can pass in strings or integers - if strings are passed, internal mapping dictionaries are used to convert them to integers.
pt_br: Кодує засіб і пріоритет у ціле число. Ви можете передавати рядки або цілі числа - якщо рядки передаються, внутрішні словники відображення використовуються для їх перетворення на цілі числа.

source: The symbolic ``LOG_`` values are defined in :class:`SysLogHandler` and mirror the values defined in the ``sys/syslog.h`` header file.
pt_br: Символічні значення ``LOG_`` визначені в :class:`SysLogHandler` і відображають значення, визначені у файлі заголовка ``sys/syslog.h``.

source: **Priorities**
pt_br: **Пріоритети**

source: Name (string)
pt_br: Nama (string)

source: Symbolic value
pt_br: Символічне значення

source: ``err`` or ``error``
pt_br: ``err`` ou ``error``

source: **Facilities**
pt_br: **Інфраструктура**

source: Maps a logging level name to a syslog priority name. You may need to override this if you are using custom levels, or if the default algorithm is not suitable for your needs. The default algorithm maps ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR`` and ``CRITICAL`` to the equivalent syslog names, and all other level names to 'warning'.
pt_br: Зіставляє назву рівня журналювання на назву пріоритету системного журналу. Можливо, вам знадобиться перевизначити це, якщо ви використовуєте спеціальні рівні або якщо алгоритм за замовчуванням не підходить для ваших потреб. Алгоритм за замовчуванням відображає ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR`` і ``CRITICAL`` на еквівалентні назви системного журналу, а всі інші назви рівнів на "попередження".

source: The :class:`NTEventLogHandler` class, located in the :mod:`logging.handlers` module, supports sending logging messages to a local Windows NT, Windows 2000 or Windows XP event log. Before you can use it, you need Mark Hammond's Win32 extensions for Python installed.
pt_br: Клас :class:`NTEventLogHandler`, розташований у модулі :mod:`logging.handlers`, підтримує надсилання повідомлень журналу до локального журналу подій Windows NT, Windows 2000 або Windows XP. Перш ніж використовувати його, вам потрібно встановити розширення Win32 Марка Хаммонда для Python.
