Repository: python/python-docs-pt-br
Catalog: library/logging.handlers.po
Languages: pt_br

source: Returns a new instance of the :class:`NTEventLogHandler` class. The *appname* is used to define the application name as it appears in the event log. An appropriate registry entry is created using this name. The *dllname* should give the fully qualified pathname of a .dll or .exe which contains message definitions to hold in the log (if not specified, ``'win32service.pyd'`` is used - this is installed with the Win32 extensions and contains some basic placeholder message definitions. Note that use of these placeholders will make your event logs big, as the entire message source is held in the log. If you want slimmer logs, you have to pass in the name of your own .dll or .exe which contains the message definitions you want to use in the event log). The *logtype* is one of ``'Application'``, ``'System'`` or ``'Security'``, and defaults to ``'Application'``.
pt_br: Повертає новий екземпляр класу :class:`NTEventLogHandler`. *Appname* використовується для визначення назви програми, яка відображається в журналі подій. За допомогою цього імені створюється відповідний запис реєстру. *dllname* має давати повне ім’я шляху до .dll або .exe, який містить визначення повідомлень для зберігання в журналі (якщо не вказано, використовується ``'win32service.pyd'`` — він інсталюється з розширеннями Win32 і містить деякі основні визначення повідомлень-заповнювачів. Зауважте, що використання цих заповнювачів збільшить ваші журнали подій, оскільки все джерело повідомлень зберігається в журналі. Якщо ви хочете мати менші журнали, вам потрібно передати ім’я власної .dll або .exe, який містить визначення повідомлень, які ви хочете використовувати в журналі подій). *logtype* є одним із ``'Application'``, ``'System'`` або ``'Security'``, і за замовчуванням ``'Application'``.

source: At this point, you can remove the application name from the registry as a source of event log entries. However, if you do this, you will not be able to see the events as you intended in the Event Log Viewer - it needs to be able to access the registry to get the .dll name. The current version does not do this.
pt_br: На цьому етапі ви можете видалити назву програми з реєстру як джерело записів журналу подій. Однак, якщо ви зробите це, ви не зможете побачити події, як ви планували, у засобі перегляду журналу подій - йому потрібен доступ до реєстру, щоб отримати назву .dll. Поточна версія цього не робить.

source: Determines the message ID, event category and event type, and then logs the message in the NT event log.
pt_br: Визначає ідентифікатор повідомлення, категорію події та тип події, а потім записує повідомлення в журнал подій NT.

source: Returns the event category for the record. Override this if you want to specify your own categories. This version returns 0.
pt_br: Повертає категорію події для запису. Перевизначте це, якщо хочете вказати власні категорії. Ця версія повертає 0.

source: Returns the event type for the record. Override this if you want to specify your own types. This version does a mapping using the handler's typemap attribute, which is set up in :meth:`__init__` to a dictionary which contains mappings for :const:`DEBUG`, :const:`INFO`, :const:`WARNING`, :const:`ERROR` and :const:`CRITICAL`. If you are using your own levels, you will either need to override this method or place a suitable dictionary in the handler's *typemap* attribute.
pt_br: Повертає тип події для запису. Перевизначте це, якщо хочете вказати власні типи. Ця версія виконує зіставлення за допомогою атрибута typemap обробника, який встановлено в :meth:`__init__`, на словник, який містить зіставлення для :const:`DEBUG`, :const:`INFO`, :const:`WARNING`, :const:`ERROR` і :const:`CRITICAL`. Якщо ви використовуєте власні рівні, вам потрібно буде перевизначити цей метод або розмістити відповідний словник в атрибуті *typemap* обробника.

source: Returns the message ID for the record. If you are using your own messages, you could do this by having the *msg* passed to the logger being an ID rather than a format string. Then, in here, you could use a dictionary lookup to get the message ID. This version returns 1, which is the base message ID in :file:`win32service.pyd`.
pt_br: Повертає ідентифікатор повідомлення для запису. Якщо ви використовуєте власні повідомлення, ви можете зробити це, передавши *повідомлення* до реєстратора як ідентифікатор, а не рядок формату. Тоді тут ви можете скористатися пошуком у словнику, щоб отримати ідентифікатор повідомлення. Ця версія повертає 1, який є основним ідентифікатором повідомлення в :file:`win32service.pyd`.

source: The :class:`SMTPHandler` class, located in the :mod:`logging.handlers` module, supports sending logging messages to an email address via SMTP.
pt_br: Клас :class:`SMTPHandler`, розташований у модулі :mod:`logging.handlers`, підтримує надсилання повідомлень журналу на адресу електронної пошти через SMTP.

source: Returns a new instance of the :class:`SMTPHandler` class. The instance is initialized with the from and to addresses and subject line of the email. The *toaddrs* should be a list of strings. To specify a non-standard SMTP port, use the (host, port) tuple format for the *mailhost* argument. If you use a string, the standard SMTP port is used. If your SMTP server requires authentication, you can specify a (username, password) tuple for the *credentials* argument.
pt_br: Повертає новий екземпляр класу :class:`SMTPHandler`. Екземпляр ініціалізується адресами відправника та одержувача та рядком теми електронного листа. *toaddrs* має бути списком рядків. Щоб указати нестандартний порт SMTP, використовуйте формат кортежу (хост, порт) для аргументу *mailhost*. Якщо ви використовуєте рядок, використовується стандартний порт SMTP. Якщо ваш сервер SMTP вимагає автентифікації, ви можете вказати кортеж (ім’я користувача, пароль) для аргументу *облікові дані*.

source: To specify the use of a secure protocol (TLS), pass in a tuple to the *secure* argument. This will only be used when authentication credentials are supplied. The tuple should be either an empty tuple, or a single-value tuple with the name of a keyfile, or a 2-value tuple with the names of the keyfile and certificate file. (This tuple is passed to the :meth:`smtplib.SMTP.starttls` method.)
pt_br: Щоб указати використання безпечного протоколу (TLS), передайте кортеж аргументу *secure*. Це використовуватиметься, лише якщо надано облікові дані для автентифікації. Кортеж має бути або порожнім кортежем, або кортежем з одним значенням з іменем файлу ключів, або кортежем із двома значеннями з іменами файлу ключів і файлу сертифіката. (Цей кортеж передається в метод :meth:`smtplib.SMTP.starttls`.)

source: A timeout can be specified for communication with the SMTP server using the *timeout* argument.
pt_br: Тайм-аут можна вказати для зв’язку з сервером SMTP за допомогою аргументу *timeout*.

source: Added the *timeout* parameter.
pt_br: Добавлен параметр *timeout*.

source: Formats the record and sends it to the specified addressees.
pt_br: Форматує запис і надсилає його вказаним адресатам.

source: If you want to specify a subject line which is record-dependent, override this method.
pt_br: Якщо ви хочете вказати рядок теми, який залежить від запису, замініть цей метод.

source: The :class:`MemoryHandler` class, located in the :mod:`logging.handlers` module, supports buffering of logging records in memory, periodically flushing them to a :dfn:`target` handler. Flushing occurs whenever the buffer is full, or when an event of a certain severity or greater is seen.
pt_br: Клас :class:`MemoryHandler`, розташований у модулі :mod:`logging.handlers`, підтримує буферизацію записів журналу в пам’яті, періодично скидаючи їх до обробника :dfn:`target`. Очищення відбувається кожного разу, коли буфер заповнений або коли спостерігається подія певної або більшої серйозності.

source: :class:`MemoryHandler` is a subclass of the more general :class:`BufferingHandler`, which is an abstract class. This buffers logging records in memory. Whenever each record is added to the buffer, a check is made by calling :meth:`shouldFlush` to see if the buffer should be flushed. If it should, then :meth:`flush` is expected to do the flushing.
pt_br: :class:`MemoryHandler` є підкласом більш загального :class:`BufferingHandler`, який є абстрактним класом. Це буферизує записи журналу в пам'яті. Кожного разу, коли кожен запис додається до буфера, виконується перевірка шляхом виклику :meth:`shouldFlush`, щоб побачити, чи потрібно скидати буфер. Якщо має бути, то очікується, що :meth:`flush` виконає змивання.

source: Initializes the handler with a buffer of the specified capacity. Here, *capacity* means the number of logging records buffered.
pt_br: Ініціалізує обробник буфером зазначеної ємності. Тут *ємність* означає кількість буферизованих записів журналу.

source: Append the record to the buffer. If :meth:`shouldFlush` returns true, call :meth:`flush` to process the buffer.
pt_br: Додайте запис до буфера. Якщо :meth:`shouldFlush` повертає true, викликайте :meth:`flush` для обробки буфера.

source: For a :class:`BufferingHandler` instance, flushing means that it sets the buffer to an empty list. This method can be overwritten to implement more useful flushing behavior.
pt_br: Для экземпляра :class:`BufferingHandler` очистка означает, что буфер устанавливается в пустой список. Этот метод можно перезаписать, чтобы реализовать более полезное поведение очистки.

source: Return ``True`` if the buffer is up to capacity. This method can be overridden to implement custom flushing strategies.
pt_br: Повертає ``True``, якщо буфер вичерпано. Цей метод можна замінити, щоб реалізувати власні стратегії очищення.

source: Returns a new instance of the :class:`MemoryHandler` class. The instance is initialized with a buffer size of *capacity* (number of records buffered). If *flushLevel* is not specified, :const:`ERROR` is used. If no *target* is specified, the target will need to be set using :meth:`setTarget` before this handler does anything useful. If *flushOnClose* is specified as ``False``, then the buffer is *not* flushed when the handler is closed. If not specified or specified as ``True``, the previous behaviour of flushing the buffer will occur when the handler is closed.
pt_br: Повертає новий екземпляр класу :class:`MemoryHandler`. Екземпляр ініціалізується з розміром буфера *ємність* (кількість буферизованих записів). Якщо *flushLevel* не вказано, використовується :const:`ERROR`. Якщо *ціль* не вказана, ціль потрібно буде встановити за допомогою :meth:`setTarget`, перш ніж цей обробник зробить щось корисне. Якщо *flushOnClose* вказано як ``False``, тоді буфер *не* очищається, коли обробник закрито. Якщо не вказано або вказано як ``True``, попередня поведінка очищення буфера відбуватиметься, коли обробник буде закрито.

source: The *flushOnClose* parameter was added.
pt_br: Додано параметр *flushOnClose*.

source: Calls :meth:`flush`, sets the target to ``None`` and clears the buffer.
pt_br: Викликає :meth:`flush`, встановлює ціль на ``None`` і очищає буфер.

source: For a :class:`MemoryHandler` instance, flushing means just sending the buffered records to the target, if there is one. The buffer is also cleared when buffered records are sent to the target. Override if you want different behavior.
pt_br: Для экземпляра :class:`MemoryHandler` очистка означает просто отправку буферизованных записей в цель, если таковая имеется. Буфер также очищается, когда буферизованные записи отправляются в цель. Переопределите, если хотите другое поведение.

source: Sets the target handler for this handler.
pt_br: Встановлює цільовий обробник для цього обробника.

source: Checks for buffer full or a record at the *flushLevel* or higher.
pt_br: Перевіряє заповненість буфера або запис на *flushLevel* або вище.

source: The :class:`HTTPHandler` class, located in the :mod:`logging.handlers` module, supports sending logging messages to a web server, using either ``GET`` or ``POST`` semantics.
pt_br: Клас :class:`HTTPHandler`, розташований у модулі :mod:`logging.handlers`, підтримує надсилання повідомлень журналу на веб-сервер, використовуючи семантику ``GET`` або ``POST``.

source: Returns a new instance of the :class:`HTTPHandler` class. The *host* can be of the form ``host:port``, should you need to use a specific port number. If no *method* is specified, ``GET`` is used. If *secure* is true, a HTTPS connection will be used. The *context* parameter may be set to a :class:`ssl.SSLContext` instance to configure the SSL settings used for the HTTPS connection. If *credentials* is specified, it should be a 2-tuple consisting of userid and password, which will be placed in a HTTP 'Authorization' header using Basic authentication. If you specify credentials, you should also specify secure=True so that your userid and password are not passed in cleartext across the wire.
pt_br: Повертає новий екземпляр класу :class:`HTTPHandler`. *Host* може мати форму ``host:port``, якщо вам потрібно використовувати певний номер порту. Якщо *метод* не вказано, використовується ``GET``. Якщо *secure* має значення true, використовуватиметься з’єднання HTTPS. Параметр *context* може бути встановлений на екземпляр :class:`ssl.SSLContext`, щоб налаштувати параметри SSL, які використовуються для з’єднання HTTPS. Якщо вказано *облікові дані*, це має бути 2-кортеж, що складається з ідентифікатора користувача та пароля, який буде розміщено в заголовку HTTP "Авторизація" за допомогою базової автентифікації. Якщо ви вказуєте облікові дані, ви також повинні вказати secure=True, щоб ваш ідентифікатор користувача та пароль не передавалися у вигляді відкритого тексту по мережі.

source: The *context* parameter was added.
pt_br: Додано параметр *context*.

source: Provides a dictionary, based on ``record``, which is to be URL-encoded and sent to the web server. The default implementation just returns ``record.__dict__``. This method can be overridden if e.g. only a subset of :class:`~logging.LogRecord` is to be sent to the web server, or if more specific customization of what's sent to the server is required.
pt_br: Надає словник на основі ``запису``, який має бути закодований URL-адресою та надісланий на веб-сервер. Стандартна реалізація просто повертає ``record.__dict__``. Цей метод можна перевизначити, якщо, наприклад, лише підмножина :class:`~logging.LogRecord` має бути надіслана на веб-сервер, або якщо потрібна більш точна настройка того, що надсилається на сервер.

source: Sends the record to the web server as a URL-encoded dictionary. The :meth:`mapLogRecord` method is used to convert the record to the dictionary to be sent.
pt_br: Надсилає запис на веб-сервер як словник із кодуванням URL-адреси. Метод :meth:`mapLogRecord` використовується для перетворення запису в словник для надсилання.

source: Since preparing a record for sending it to a web server is not the same as a generic formatting operation, using :meth:`~logging.Handler.setFormatter` to specify a :class:`~logging.Formatter` for a :class:`HTTPHandler` has no effect. Instead of calling :meth:`~logging.Handler.format`, this handler calls :meth:`mapLogRecord` and then :func:`urllib.parse.urlencode` to encode the dictionary in a form suitable for sending to a web server.
pt_br: Оскільки підготовка запису для надсилання його на веб-сервер – це не те саме, що загальна операція форматування, використання :meth:`~logging.Handler.setFormatter` для визначення :class:`~logging.Formatter` для :class:`HTTPHandler` не має ефекту. Замість виклику :meth:`~logging.Handler.format`, цей обробник викликає :meth:`mapLogRecord`, а потім :func:`urllib.parse.urlencode`, щоб закодувати словник у формі, придатній для надсилання на веб-сервер .

source: The :class:`QueueHandler` class, located in the :mod:`logging.handlers` module, supports sending logging messages to a queue, such as those implemented in the :mod:`queue` or :mod:`multiprocessing` modules.
pt_br: Клас :class:`QueueHandler`, розташований у модулі :mod:`logging.handlers`, підтримує надсилання повідомлень журналу до черги, таких як реалізовані в модулях :mod:`queue` або :mod:`multiprocessing` .

source: Along with the :class:`QueueListener` class, :class:`QueueHandler` can be used to let handlers do their work on a separate thread from the one which does the logging. This is important in web applications and also other service applications where threads servicing clients need to respond as quickly as possible, while any potentially slow operations (such as sending an email via :class:`SMTPHandler`) are done on a separate thread.
pt_br: Разом із класом :class:`QueueListener`, :class:`QueueHandler` можна використовувати, щоб дозволити обробникам виконувати свою роботу в окремому потоці від того, який веде журнал. Це важливо у веб-додатках, а також в інших додатках-службах, де потоки, що обслуговують клієнтів, мають відповідати якомога швидше, тоді як будь-які потенційно повільні операції (такі як надсилання електронного листа через :class:`SMTPHandler`) виконуються в окремому потоці.

source: Returns a new instance of the :class:`QueueHandler` class. The instance is initialized with the queue to send messages to. The *queue* can be any queue-like object; it's used as-is by the :meth:`enqueue` method, which needs to know how to send messages to it. The queue is not *required* to have the task tracking API, which means that you can use :class:`~queue.SimpleQueue` instances for *queue*.
pt_br: Повертає новий екземпляр класу :class:`QueueHandler`. Примірник ініціалізується чергою для надсилання повідомлень. *Чергою* може бути будь-який об’єкт, подібний до черги; він використовується як є методом :meth:`enqueue`, якому потрібно знати, як йому надсилати повідомлення. Для черги не *обов’язково* бути API відстеження завдань, що означає, що ви можете використовувати екземпляри :class:`~queue.SimpleQueue` для *черги*.

source: If you are using :mod:`multiprocessing`, you should avoid using :class:`~queue.SimpleQueue` and instead use :class:`multiprocessing.Queue`.
pt_br: Если вы используете :mod:`multiprocessing`, вам следует избегать использования :class:`~queue.SimpleQueue` и вместо этого использовать :class:`multiprocessing.Queue`.

source: Enqueues the result of preparing the LogRecord. Should an exception occur (e.g. because a bounded queue has filled up), the :meth:`~logging.Handler.handleError` method is called to handle the error. This can result in the record silently being dropped (if :data:`logging.raiseExceptions` is ``False``) or a message printed to ``sys.stderr`` (if :data:`logging.raiseExceptions` is ``True``).
pt_br: Ставит в очередь результат подготовки LogRecord. В случае возникновения исключения (например, из-за заполнения ограниченной очереди) для обработки ошибки вызывается метод :meth:`~logging.Handler.handleError`. Это может привести к молчаливому удалению записи (если :data:`logging.raiseExceptions` имеет значение ``False``) или к выводу сообщения в ``sys.stderr`` (если :data:`logging.raiseExceptions`` имеет значение `` «Правда»).

source: Prepares a record for queuing. The object returned by this method is enqueued.
pt_br: Готує запис для постановки в чергу. Об’єкт, повернутий цим методом, ставиться в чергу.

source: The base implementation formats the record to merge the message, arguments, exception and stack information, if present. It also removes unpickleable items from the record in-place. Specifically, it overwrites the record's :attr:`msg` and :attr:`message` attributes with the merged message (obtained by calling the handler's :meth:`format` method), and sets the :attr:`args`, :attr:`exc_info` and :attr:`exc_text` attributes to ``None``.
pt_br: Базовая реализация форматирует запись для объединения сообщения, аргументов, исключений и информации стека, если они есть. Он также удаляет неподдающиеся редактированию элементы из записи на месте. В частности, он перезаписывает атрибуты записи :attr:`msg` и :attr:`message` объединенным сообщением (полученным путем вызова метода :meth:`format` обработчика) и устанавливает :attr:`args`, : Для атрибутов attr:`exc_info` и :attr:`exc_text` установлено значение ``None``.

source: You might want to override this method if you want to convert the record to a dict or JSON string, or send a modified copy of the record while leaving the original intact.
pt_br: Ви можете замінити цей метод, якщо хочете перетворити запис на рядок dict або JSON або надіслати змінену копію запису, залишивши оригінал недоторканим.

source: The base implementation formats the message with arguments, sets the ``message`` and ``msg`` attributes to the formatted message and sets the ``args`` and ``exc_text`` attributes to ``None`` to allow pickling and to prevent further attempts at formatting. This means that a handler on the :class:`QueueListener` side won't have the information to do custom formatting, e.g. of exceptions. You may wish to subclass ``QueueHandler`` and override this method to e.g. avoid setting ``exc_text`` to ``None``. Note that the ``message`` / ``msg`` / ``args`` changes are related to ensuring the record is pickleable, and you might or might not be able to avoid doing that depending on whether your ``args`` are pickleable. (Note that you may have to consider not only your own code but also code in any libraries that you use.)
pt_br: Базовая реализация форматирует сообщение с аргументами, устанавливает атрибуты ``message`` и ``msg`` для отформатированного сообщения и устанавливает атрибуты ``args`` и ``exc_text`` в ``None``, чтобы разрешить травление и предотвращение дальнейших попыток форматирования. Это означает, что обработчик на стороне :class:`QueueListener` не будет иметь информации для выполнения пользовательского форматирования, например, исключений. Вы можете создать подкласс QueueHandler и переопределить этот метод, чтобы, например, не устанавливать для exc_text значение None. Обратите внимание, что изменения ``message``/``msg``/``args`` связаны с обеспечением возможности выбора записи, и вы можете или не можете избежать этого в зависимости от того, есть ли у вас ``args` ` можно мариновать. (Обратите внимание, что вам, возможно, придется учитывать не только свой собственный код, но и код любых библиотек, которые вы используете.)

source: Enqueues the record on the queue using ``put_nowait()``; you may want to override this if you want to use blocking behaviour, or a timeout, or a customized queue implementation.
pt_br: Ставить запис у чергу за допомогою put_nowait(); ви можете змінити це, якщо ви хочете використовувати поведінку блокування, або тайм-аут, або налаштовану реалізацію черги.

source: The :class:`QueueListener` class, located in the :mod:`logging.handlers` module, supports receiving logging messages from a queue, such as those implemented in the :mod:`queue` or :mod:`multiprocessing` modules. The messages are received from a queue in an internal thread and passed, on the same thread, to one or more handlers for processing. While :class:`QueueListener` is not itself a handler, it is documented here because it works hand-in-hand with :class:`QueueHandler`.
pt_br: Клас :class:`QueueListener`, розташований у модулі :mod:`logging.handlers`, підтримує отримання повідомлень журналу з черги, таких як ті, що реалізовані в модулях :mod:`queue` або :mod:`multiprocessing` . Повідомлення отримуються з черги у внутрішньому потоці та передаються в тому самому потоці одному або кільком обробникам для обробки. Хоча :class:`QueueListener` сам по собі не є обробником, він задокументований тут, оскільки він працює рука об руку з :class:`QueueHandler`.
