Repository: python/python-docs-pt-br
Catalog: library/logging.handlers.po
Languages: pt_br

source: Along with the :class:`QueueHandler` class, :class:`QueueListener` can be used to let handlers do their work on a separate thread from the one which does the logging. This is important in web applications and also other service applications where threads servicing clients need to respond as quickly as possible, while any potentially slow operations (such as sending an email via :class:`SMTPHandler`) are done on a separate thread.
pt_br: Разом із класом :class:`QueueHandler`, :class:`QueueListener` можна використовувати, щоб дозволити обробникам виконувати свою роботу в окремому потоці від того, який веде журнал. Це важливо у веб-додатках, а також в інших додатках-службах, де потоки, що обслуговують клієнтів, мають відповідати якомога швидше, тоді як будь-які потенційно повільні операції (такі як надсилання електронного листа через :class:`SMTPHandler`) виконуються в окремому потоці.

source: Returns a new instance of the :class:`QueueListener` class. The instance is initialized with the queue to send messages to and a list of handlers which will handle entries placed on the queue. The queue can be any queue-like object; it's passed as-is to the :meth:`dequeue` method, which needs to know how to get messages from it. The queue is not *required* to have the task tracking API (though it's used if available), which means that you can use :class:`~queue.SimpleQueue` instances for *queue*.
pt_br: Повертає новий екземпляр класу :class:`QueueListener`. Екземпляр ініціалізується чергою для надсилання повідомлень і списком обробників, які оброблятимуть записи, розміщені в черзі. Чергою може бути будь-який чергоподібний об'єкт; він передається як є до методу :meth:`dequeue`, якому потрібно знати, як отримати від нього повідомлення. Для черги не *обов’язково* бути API відстеження завдань (хоча він використовується, якщо доступний), що означає, що ви можете використовувати екземпляри :class:`~queue.SimpleQueue` для *черги*.

source: If ``respect_handler_level`` is ``True``, a handler's level is respected (compared with the level for the message) when deciding whether to pass messages to that handler; otherwise, the behaviour is as in previous Python versions - to always pass each message to each handler.
pt_br: Якщо ``respect_handler_level`` має значення ``True``, рівень обробника враховується (порівняно з рівнем для повідомлення), коли вирішується, чи передавати повідомлення цьому обробнику; інакше, поведінка така ж, як і в попередніх версіях Python - завжди передавати кожне повідомлення кожному обробнику.

source: The ``respect_handler_level`` argument was added.
pt_br: Додано аргумент ``respect_handler_level``.

source: Dequeues a record and return it, optionally blocking.
pt_br: Вилучає запис із черги та повертає його, за бажанням блокуючи.

source: The base implementation uses ``get()``. You may want to override this method if you want to use timeouts or work with custom queue implementations.
pt_br: У базовій реалізації використовується ``get()``. Ви можете перевизначити цей метод, якщо ви хочете використовувати тайм-аути або працювати з власними реалізаціями черги.

source: Prepare a record for handling.
pt_br: Підготуйте протокол для обробки.

source: This implementation just returns the passed-in record. You may want to override this method if you need to do any custom marshalling or manipulation of the record before passing it to the handlers.
pt_br: Ця реалізація лише повертає переданий запис. Ви можете замінити цей метод, якщо вам потрібно виконати будь-яку спеціальну сортування або маніпуляції із записом перед передачею його обробникам.

source: Handle a record.
pt_br: Обробка запису.

source: This just loops through the handlers offering them the record to handle. The actual object passed to the handlers is that which is returned from :meth:`prepare`.
pt_br: Це просто проходить через обробники, пропонуючи їм запис для обробки. Фактичний об’єкт, який передається обробникам, — це той, який повертається з :meth:`prepare`.

source: Starts the listener.
pt_br: Memulai *listener*.

source: This starts up a background thread to monitor the queue for LogRecords to process.
pt_br: Це запускає фоновий потік для моніторингу черги для обробки LogRecords.

source: Stops the listener.
pt_br: Menghentikan *listener*.

source: This asks the thread to terminate, and then waits for it to do so. Note that if you don't call this before your application exits, there may be some records still left on the queue, which won't be processed.
pt_br: Це просить потік завершити, а потім чекає, поки він це зробить. Зауважте, що якщо ви не викличете це перед виходом програми, у черзі можуть залишитися деякі записи, які не будуть оброблені.

source: Writes a sentinel to the queue to tell the listener to quit. This implementation uses ``put_nowait()``. You may want to override this method if you want to use timeouts or work with custom queue implementations.
pt_br: Записує до черги дозорний, щоб сказати слухачеві вийти. Ця реалізація використовує ``put_nowait()``. Ви можете перевизначити цей метод, якщо хочете використовувати тайм-аути або працювати з власними реалізаціями черги.

source: Module :mod:`logging`
pt_br: Módulo :mod:`logging`

source: API reference for the logging module.
pt_br: Referência da API para o módulo de logging.

source: Module :mod:`logging.config`
pt_br: Módulo :mod:`logging.config`

source: Configuration API for the logging module.
pt_br: API de configuração para o módulo logging.
