Repository: python/python-docs-pt-br
Catalog: library/logging.handlers.po
Languages: pt_br

source: :mod:`logging.handlers` --- Logging handlers
pt_br: :mod:`logging.handlers` --- Tratadores de registro

source: **Source code:** :source:`Lib/logging/handlers.py`
pt_br: **Código-fonte:** :source:`Lib/logging/handlers.py`

source: This page contains only reference information. For tutorials, please see
pt_br: Esta página contém apenas informações de referência. Para tutoriais, por favor consulte

source: :ref:`Basic Tutorial <logging-basic-tutorial>`
pt_br: :ref:`Tutorial básico <logging-basic-tutorial>`

source: :ref:`Advanced Tutorial <logging-advanced-tutorial>`
pt_br: :ref:`Tutorial avançado <logging-advanced-tutorial>`

source: :ref:`Logging Cookbook <logging-cookbook>`
pt_br: :ref:`Livro de receitas de logging <logging-cookbook>`

source: The following useful handlers are provided in the package. Note that three of the handlers (:class:`StreamHandler`, :class:`FileHandler` and :class:`NullHandler`) are actually defined in the :mod:`logging` module itself, but have been documented here along with the other handlers.
pt_br: Os seguintes tratadores úteis são fornecidos neste pacote. Observe que três dos tratadores (:class:`StreamHandler`, :class:`FileHandler` e :class:`NullHandler`) são, na verdade, definidos no próprio módulo :mod:`logging`, mas foram documentados aqui junto com os outros tratadores.

source: The :class:`StreamHandler` class, located in the core :mod:`logging` package, sends logging output to streams such as *sys.stdout*, *sys.stderr* or any file-like object (or, more precisely, any object which supports :meth:`write` and :meth:`flush` methods).
pt_br: Клас :class:`StreamHandler`, розташований у базовому пакеті :mod:`logging`, надсилає вихідні дані журналу до таких потоків, як *sys.stdout*, *sys.stderr* або будь-якого файлоподібного об’єкта (або, точніше, , будь-який об’єкт, який підтримує методи :meth:`write` і :meth:`flush`).

source: Returns a new instance of the :class:`StreamHandler` class. If *stream* is specified, the instance will use it for logging output; otherwise, *sys.stderr* will be used.
pt_br: Повертає новий екземпляр класу :class:`StreamHandler`. Якщо вказано *потік*, примірник використовуватиме його для журналювання виводу; інакше буде використано *sys.stderr*.

source: If a formatter is specified, it is used to format the record. The record is then written to the stream followed by :attr:`terminator`. If exception information is present, it is formatted using :func:`traceback.print_exception` and appended to the stream.
pt_br: Якщо вказано засіб форматування, він використовується для форматування запису. Потім запис записується в потік, а потім :attr:`terminator`. Якщо присутня інформація про винятки, вона форматується за допомогою :func:`traceback.print_exception` і додається до потоку.

source: Flushes the stream by calling its :meth:`flush` method. Note that the :meth:`close` method is inherited from :class:`~logging.Handler` and so does no output, so an explicit :meth:`flush` call may be needed at times.
pt_br: Очищає потік, викликаючи його метод :meth:`flush`. Зауважте, що метод :meth:`close` успадковано від :class:`~logging.Handler` і тому не виводить, тому іноді може знадобитися явний виклик :meth:`flush`.

source: Sets the instance's stream to the specified value, if it is different. The old stream is flushed before the new stream is set.
pt_br: Встановлює для потоку екземпляра вказане значення, якщо воно відрізняється. Старий потік очищається перед встановленням нового.

source: Parameters
pt_br: Parâmetros

source: The stream that the handler should use.
pt_br: Потік, який повинен використовувати обробник.

source: Returns
pt_br: Retorna

source: String used as the terminator when writing a formatted record to a stream. Default value is ``'\n'``.
pt_br: Рядок, який використовується як термінатор під час запису форматованого запису в потік. Значення за замовчуванням - ``'\n'``.

source: If you don't want a newline termination, you can set the handler instance's ``terminator`` attribute to the empty string.
pt_br: Якщо ви не бажаєте закінчення нового рядка, ви можете встановити атрибут ``термінатор`` екземпляра обробника як порожній рядок.

source: In earlier versions, the terminator was hardcoded as ``'\n'``.
pt_br: У попередніх версіях термінатор був жорстко закодований як ``'\n'``.

source: The :class:`FileHandler` class, located in the core :mod:`logging` package, sends logging output to a disk file. It inherits the output functionality from :class:`StreamHandler`.
pt_br: Клас :class:`FileHandler`, розташований у базовому пакеті :mod:`logging`, надсилає вихідні дані журналу у файл диска. Він успадковує функцію виведення від :class:`StreamHandler`.

source: Returns a new instance of the :class:`FileHandler` class. The specified file is opened and used as the stream for logging. If *mode* is not specified, ``'a'`` is used. If *encoding* is not ``None``, it is used to open the file with that encoding. If *delay* is true, then file opening is deferred until the first call to :meth:`emit`. By default, the file grows indefinitely. If *errors* is specified, it's used to determine how encoding errors are handled.
pt_br: Возвращает новый экземпляр класса :class:`FileHandler`. Указанный файл открывается и используется в качестве потока для протоколирования. Если *mode* не указан, используется ``'a'``. Если *кодировка* не равна «Нет», она используется для открытия файла с этой кодировкой. Если *delay* имеет значение true, то открытие файла откладывается до первого вызова :meth:`emit`. По умолчанию файл растет бесконечно. Если указано *errors*, оно используется для определения способа обработки ошибок кодирования.

source: As well as string values, :class:`~pathlib.Path` objects are also accepted for the *filename* argument.
pt_br: Окрім рядкових значень, об’єкти :class:`~pathlib.Path` також приймаються для аргументу *filename*.

source: The *errors* parameter was added.
pt_br: Додано параметр *errors*.

source: Closes the file.
pt_br: Menutup berkas.

source: Outputs the record to the file.
pt_br: Виводить запис у файл.

source: Note that if the file was closed due to logging shutdown at exit and the file mode is 'w', the record will not be emitted (see :issue:`42378`).
pt_br: Зауважте, що якщо файл було закрито через завершення журналювання під час виходу та режим файлу "w", запис не буде видано (див. :issue:`42378`).

source: The :class:`NullHandler` class, located in the core :mod:`logging` package, does not do any formatting or output. It is essentially a 'no-op' handler for use by library developers.
pt_br: Клас :class:`NullHandler`, розташований у базовому пакеті :mod:`logging`, не виконує жодного форматування чи виведення. По суті, це обробник "no-op" для використання розробниками бібліотек.

source: Returns a new instance of the :class:`NullHandler` class.
pt_br: Повертає новий екземпляр класу :class:`NullHandler`.

source: This method does nothing.
pt_br: Metode ini tidak melakukan apa pun.

source: This method returns ``None`` for the lock, since there is no underlying I/O to which access needs to be serialized.
pt_br: Цей метод повертає ``None`` для блокування, оскільки немає основного вводу-виводу, доступ до якого потрібно серіалізувати.

source: See :ref:`library-config` for more information on how to use :class:`NullHandler`.
pt_br: Перегляньте :ref:`library-config`, щоб дізнатися більше про використання :class:`NullHandler`.

source: The :class:`WatchedFileHandler` class, located in the :mod:`logging.handlers` module, is a :class:`FileHandler` which watches the file it is logging to. If the file changes, it is closed and reopened using the file name.
pt_br: Клас :class:`WatchedFileHandler`, розташований у модулі :mod:`logging.handlers`, є :class:`FileHandler`, який стежить за файлом, до якого він реєструється. Якщо файл змінюється, він закривається та знову відкривається з використанням імені файлу.

source: A file change can happen because of usage of programs such as *newsyslog* and *logrotate* which perform log file rotation. This handler, intended for use under Unix/Linux, watches the file to see if it has changed since the last emit. (A file is deemed to have changed if its device or inode have changed.) If the file has changed, the old file stream is closed, and the file opened to get a new stream.
pt_br: Зміна файлу може статися через використання таких програм, як *newsyslog* і *logrotate*, які виконують ротацію файлів журналу. Цей обробник, призначений для використання в Unix/Linux, спостерігає за файлом, щоб побачити, чи він змінився з часу останнього випуску. (Файл вважається зміненим, якщо його пристрій або inode змінилися.) Якщо файл змінився, старий файловий потік закривається, а файл відкривається, щоб отримати новий потік.

source: This handler is not appropriate for use under Windows, because under Windows open log files cannot be moved or renamed - logging opens the files with exclusive locks - and so there is no need for such a handler. Furthermore, *ST_INO* is not supported under Windows; :func:`~os.stat` always returns zero for this value.
pt_br: Цей обробник не підходить для використання під Windows, оскільки під Windows відкриті файли журналу не можна переміщувати або перейменовувати - журналювання відкриває файли з ексклюзивними блокуваннями - і тому немає потреби в такому обробнику. Крім того, *ST_INO* не підтримується в Windows; :func:`~os.stat` завжди повертає нуль для цього значення.

source: Returns a new instance of the :class:`WatchedFileHandler` class. The specified file is opened and used as the stream for logging. If *mode* is not specified, ``'a'`` is used. If *encoding* is not ``None``, it is used to open the file with that encoding. If *delay* is true, then file opening is deferred until the first call to :meth:`emit`. By default, the file grows indefinitely. If *errors* is provided, it determines how encoding errors are handled.
pt_br: Возвращает новый экземпляр класса :class:`WatchedFileHandler`. Указанный файл открывается и используется в качестве потока для протоколирования. Если *mode* не указан, используется ``'a'``. Если *кодировка* не равна «Нет», она используется для открытия файла с этой кодировкой. Если *delay* имеет значение true, то открытие файла откладывается до первого вызова :meth:`emit`. По умолчанию файл растет бесконечно. Если указано *errors*, оно определяет, как обрабатываются ошибки кодирования.

source: Checks to see if the file has changed. If it has, the existing stream is flushed and closed and the file opened again, typically as a precursor to outputting the record to the file.
pt_br: Перевіряє, чи не змінився файл. Якщо так, наявний потік очищається та закривається, а файл відкривається знову, як правило, перед виведенням запису у файл.

source: Outputs the record to the file, but first calls :meth:`reopenIfNeeded` to reopen the file if it has changed.
pt_br: Виводить запис у файл, але спочатку викликає :meth:`reopenIfNeeded`, щоб повторно відкрити файл, якщо він змінився.

source: The :class:`BaseRotatingHandler` class, located in the :mod:`logging.handlers` module, is the base class for the rotating file handlers, :class:`RotatingFileHandler` and :class:`TimedRotatingFileHandler`. You should not need to instantiate this class, but it has attributes and methods you may need to override.
pt_br: Клас :class:`BaseRotatingHandler`, розташований у модулі :mod:`logging.handlers`, є базовим класом для обертових обробників файлів, :class:`RotatingFileHandler` і :class:`TimedRotatingFileHandler`. Вам не потрібно створювати екземпляр цього класу, але він має атрибути та методи, які вам, можливо, доведеться змінити.

source: The parameters are as for :class:`FileHandler`. The attributes are:
pt_br: Параметри такі ж, як і для :class:`FileHandler`. Атрибути:

source: If this attribute is set to a callable, the :meth:`rotation_filename` method delegates to this callable. The parameters passed to the callable are those passed to :meth:`rotation_filename`.
pt_br: Якщо для цього атрибута встановлено значення callable, метод :meth:`rotation_filename` делегує цей виклик. Параметри, що передаються викликаному, є тими, що передаються до :meth:`rotation_filename`.

source: The namer function is called quite a few times during rollover, so it should be as simple and as fast as possible. It should also return the same output every time for a given input, otherwise the rollover behaviour may not work as expected.
pt_br: Функція namer викликається досить багато разів під час переміщення, тому вона має бути максимально простою та швидкою. Він також повинен повертати той самий вихід кожного разу для даного введення, інакше поведінка перекидання може працювати не так, як очікувалося.

source: It's also worth noting that care should be taken when using a namer to preserve certain attributes in the filename which are used during rotation. For example, :class:`RotatingFileHandler` expects to have a set of log files whose names contain successive integers, so that rotation works as expected, and :class:`TimedRotatingFileHandler` deletes old log files (based on the ``backupCount`` parameter passed to the handler's initializer) by determining the oldest files to delete. For this to happen, the filenames should be sortable using the date/time portion of the filename, and a namer needs to respect this. (If a namer is wanted that doesn't respect this scheme, it will need to be used in a subclass of :class:`TimedRotatingFileHandler` which overrides the :meth:`~TimedRotatingFileHandler.getFilesToDelete` method to fit in with the custom naming scheme.)
pt_br: Варто також зазначити, що під час використання іменника слід бути обережним, щоб зберегти певні атрибути в імені файлу, які використовуються під час ротації. Наприклад, :class:`RotatingFileHandler` очікує мати набір файлів журналу, імена яких містять послідовні цілі числа, щоб ротація працювала належним чином, а :class:`TimedRotatingFileHandler` видаляє старі файли журналу (на основі ``backupCount`` параметр, переданий ініціалізатору обробника), визначаючи найстаріші файли для видалення. Щоб це сталося, назви файлів мають бути сортованими за датою/часом у назві файлу, і іменувальник має поважати це. (Якщо потрібен іменник, який не відповідає цій схемі, його потрібно буде використовувати в підкласі :class:`TimedRotatingFileHandler`, який замінює метод :meth:`~TimedRotatingFileHandler.getFilesToDelete`, щоб відповідати спеціальному іменуванню схема.)

source: If this attribute is set to a callable, the :meth:`rotate` method delegates to this callable. The parameters passed to the callable are those passed to :meth:`rotate`.
pt_br: Якщо цей атрибут встановлено на callable, метод :meth:`rotate` делегує цей callable. Параметри, що передаються викликаному, є тими, що передаються в :meth:`rotate`.

source: Modify the filename of a log file when rotating.
pt_br: Змінити назву файлу журналу під час ротації.

source: This is provided so that a custom filename can be provided.
pt_br: Це надається для того, щоб можна було надати власне ім’я файлу.

source: The default implementation calls the 'namer' attribute of the handler, if it's callable, passing the default name to it. If the attribute isn't callable (the default is ``None``), the name is returned unchanged.
pt_br: Реалізація за замовчуванням викликає атрибут 'namer' обробника, якщо його можна викликати, передаючи йому ім'я за замовчуванням. Якщо атрибут не можна викликати (за замовчуванням ``None``), ім'я повертається без змін.

source: The default name for the log file.
pt_br: Назва за замовчуванням для файлу журналу.

source: When rotating, rotate the current log.
pt_br: Під час обертання обертати поточний журнал.

source: The default implementation calls the 'rotator' attribute of the handler, if it's callable, passing the source and dest arguments to it. If the attribute isn't callable (the default is ``None``), the source is simply renamed to the destination.
pt_br: Реалізація за замовчуванням викликає атрибут 'rotator' обробника, якщо його можна викликати, передаючи йому аргументи джерела та призначення. Якщо атрибут не можна викликати (за замовчуванням ``None``), джерело просто перейменовується на призначення.

source: The source filename. This is normally the base filename, e.g. 'test.log'.
pt_br: Ім'я вихідного файлу. Зазвичай це базова назва файлу, напр. 'test.log'.

source: The destination filename. This is normally what the source is rotated to, e.g. 'test.log.1'.
pt_br: Ім'я цільового файлу. Зазвичай це те, до чого обертається джерело, напр. 'test.log.1'.

source: The reason the attributes exist is to save you having to subclass - you can use the same callables for instances of :class:`RotatingFileHandler` and :class:`TimedRotatingFileHandler`. If either the namer or rotator callable raises an exception, this will be handled in the same way as any other exception during an :meth:`emit` call, i.e. via the :meth:`handleError` method of the handler.
pt_br: Причина, чому ці атрибути існують, полягає в тому, щоб позбавити вас необхідності створювати підкласи – ви можете використовувати ті самі виклики для екземплярів :class:`RotatingFileHandler` і :class:`TimedRotatingFileHandler`. Якщо виклик іменника або ротатора викликає виняток, це буде оброблено так само, як і будь-який інший виняток під час виклику :meth:`emit`, тобто через метод :meth:`handleError` обробника.

source: If you need to make more significant changes to rotation processing, you can override the methods.
pt_br: Якщо вам потрібно внести більш значні зміни в обробку обертання, ви можете змінити методи.

source: For an example, see :ref:`cookbook-rotator-namer`.
pt_br: Для прикладу перегляньте :ref:`cookbook-rotator-namer`.

source: The :class:`RotatingFileHandler` class, located in the :mod:`logging.handlers` module, supports rotation of disk log files.
pt_br: Клас :class:`RotatingFileHandler`, розташований у модулі :mod:`logging.handlers`, підтримує ротацію файлів журналу диска.

source: Returns a new instance of the :class:`RotatingFileHandler` class. The specified file is opened and used as the stream for logging. If *mode* is not specified, ``'a'`` is used. If *encoding* is not ``None``, it is used to open the file with that encoding. If *delay* is true, then file opening is deferred until the first call to :meth:`emit`. By default, the file grows indefinitely. If *errors* is provided, it determines how encoding errors are handled.
pt_br: Повертає новий екземпляр класу :class:`RotatingFileHandler`. Зазначений файл відкривається та використовується як потік для реєстрації. Якщо *mode* не вказано, використовується ``'a'``. Якщо *кодування* не ``None``, воно використовується для відкриття файлу з таким кодуванням. Якщо *delay* має значення true, то відкриття файлу відкладено до першого виклику :meth:`emit`. За замовчуванням файл збільшується необмежено довго. Якщо вказано *errors*, це визначає спосіб обробки помилок кодування.

source: You can use the *maxBytes* and *backupCount* values to allow the file to :dfn:`rollover` at a predetermined size. When the size is about to be exceeded, the file is closed and a new file is silently opened for output. Rollover occurs whenever the current log file is nearly *maxBytes* in length; but if either of *maxBytes* or *backupCount* is zero, rollover never occurs, so you generally want to set *backupCount* to at least 1, and have a non-zero *maxBytes*. When *backupCount* is non-zero, the system will save old log files by appending the extensions '.1', '.2' etc., to the filename. For example, with a *backupCount* of 5 and a base file name of :file:`app.log`, you would get :file:`app.log`, :file:`app.log.1`, :file:`app.log.2`, up to :file:`app.log.5`. The file being written to is always :file:`app.log`. When this file is filled, it is closed and renamed to :file:`app.log.1`, and if files :file:`app.log.1`, :file:`app.log.2`, etc. exist, then they are renamed to :file:`app.log.2`, :file:`app.log.3` etc. respectively.
pt_br: Ви можете використовувати значення *maxBytes* і *backupCount*, щоб дозволити файлу :dfn:`rollover` попередньо визначеного розміру. Коли розмір майже буде перевищено, файл закривається, а новий файл мовчки відкривається для виведення. Перехід відбувається щоразу, коли довжина поточного файлу журналу становить майже *maxBytes*; але якщо будь-яке з *maxBytes* або *backupCount* дорівнює нулю, перехід ніколи не відбувається, тому зазвичай потрібно встановити *backupCount* принаймні на 1 і мати ненульовий *maxBytes*. Якщо *backupCount* не дорівнює нулю, система збереже старі файли журналу, додавши до назви файлу розширення ".1", ".2" тощо. Наприклад, з *backupCount* 5 і базовою назвою файлу :file:`app.log`, ви отримаєте :file:`app.log`, :file:`app.log.1`, :file:`app.log.2`, до :file:`app.log.5`. Файл, у який записується, завжди :file:`app.log`. Коли цей файл заповнюється, він закривається та перейменовується на :file:`app.log.1`, а якщо файли :file:`app.log.1`, :file:`app.log.2` тощо. існують, тоді вони перейменовуються відповідно на :file:`app.log.2`, :file:`app.log.3` тощо.

source: Does a rollover, as described above.
pt_br: Робить перекидання, як описано вище.

source: Outputs the record to the file, catering for rollover as described previously.
pt_br: Виводить запис у файл, обслуговуючи ролловер, як описано раніше.

source: The :class:`TimedRotatingFileHandler` class, located in the :mod:`logging.handlers` module, supports rotation of disk log files at certain timed intervals.
pt_br: Клас :class:`TimedRotatingFileHandler`, розташований у модулі :mod:`logging.handlers`, підтримує ротацію файлів журналу диска через певні часові інтервали.

source: Returns a new instance of the :class:`TimedRotatingFileHandler` class. The specified file is opened and used as the stream for logging. On rotating it also sets the filename suffix. Rotating happens based on the product of *when* and *interval*.
pt_br: Повертає новий екземпляр класу :class:`TimedRotatingFileHandler`. Зазначений файл відкривається та використовується як потік для реєстрації. При обертанні він також встановлює суфікс імені файлу. Обертання відбувається на основі добутку *when* та *інтервалу*.

source: You can use the *when* to specify the type of *interval*. The list of possible values is below. Note that they are not case sensitive.
pt_br: Ви можете використовувати *when*, щоб вказати тип *інтервалу*. Нижче наведено список можливих значень. Зауважте, що вони не чутливі до регістру.

source: Value
pt_br: Valor

source: Type of interval
pt_br: Тип інтервалу

source: If/how *atTime* is used
pt_br: Якщо/як використовується *atTime*

source: Seconds
pt_br: Detik

source: Ignored
pt_br: Ігнорується

source: Minutes
pt_br: Menit

source: Hours
pt_br: Horas

source: Days
pt_br: Dias

source: Weekday (0=Monday)
pt_br: День тижня (0=понеділок)

source: Used to compute initial rollover time
pt_br: Використовується для обчислення початкового часу перекидання

source: Roll over at midnight, if *atTime* not specified, else at time *atTime*
pt_br: Перехід опівночі, якщо *atTime* не вказано, інакше в час *atTime*

source: When using weekday-based rotation, specify 'W0' for Monday, 'W1' for Tuesday, and so on up to 'W6' for Sunday. In this case, the value passed for *interval* isn't used.
pt_br: У разі використання ротації на основі днів тижня вкажіть "W0" для понеділка, "W1" для вівторка і так далі до "W6" для неділі. У цьому випадку значення, передане для *інтервалу*, не використовується.
