Repository: python/python-docs-pt-br
Catalog: library/lzma.po
Languages: pt_br

source: :mod:`!lzma` --- Compression using the LZMA algorithm
pt_br: :mod:`!lzma` --- Compressão usando o algoritmo LZMA

source: **Source code:** :source:`Lib/lzma.py`
pt_br: **Código-fonte:** :source:`Lib/lzma.py`

source: This module provides classes and convenience functions for compressing and decompressing data using the LZMA compression algorithm. Also included is a file interface supporting the ``.xz`` and legacy ``.lzma`` file formats used by the :program:`xz` utility, as well as raw compressed streams.
pt_br: Este módulo fornece classes e funções de conveniência para comprimir e descomprimir dados usando o algoritmo de compressão LZMA. Também está incluída uma interface de arquivo que oferece suporte aos formatos de arquivo ``.xz`` e legado ``.lzma`` usados pelo utilitário :program:`xz`, bem como fluxos brutos comprimidos.

source: The interface provided by this module is very similar to that of the :mod:`bz2` module. Note that :class:`LZMAFile` and :class:`bz2.BZ2File` are *not* thread-safe, so if you need to use a single :class:`LZMAFile` instance from multiple threads, it is necessary to protect it with a lock.
pt_br: A interface fornecida por este módulo é muito semelhante à do módulo :mod:`bz2`. Observe que :class:`LZMAFile` e :class:`bz2.BZ2File` *não* são seguro para thread, portanto, se você precisar usar uma única instância :class:`LZMAFile` de vários threads, é necessário protegê-la com uma trava.

source: This exception is raised when an error occurs during compression or decompression, or while initializing the compressor/decompressor state.
pt_br: Essa exceção é levantada quando ocorre um erro durante a compressão ou descompressão ou durante a inicialização do estado compressor/descompressor.

source: Reading and writing compressed files
pt_br: Lendo e escrevendo arquivos comprimidos

source: Open an LZMA-compressed file in binary or text mode, returning a :term:`file object`.
pt_br: Abre um arquivo comprimido com LZMA no modo binário ou texto, retornando um :term:`objeto arquivo <file object>`.

source: The *filename* argument can be either an actual file name (given as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object), in which case the named file is opened, or it can be an existing file object to read from or write to.
pt_br: O argumento *filename* pode ser um nome de arquivo real (dado como um objeto :class:`str`, :class:`bytes` ou :term:`caminho ou similar <path-like object>`), neste caso o arquivo nomeado é aberto , ou pode ser um objeto arquivo existente para leitura ou escrita.

source: The *mode* argument can be any of ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` or ``"ab"`` for binary mode, or ``"rt"``, ``"wt"``, ``"xt"``, or ``"at"`` for text mode. The default is ``"rb"``.
pt_br: O argumento *mode* pode ser qualquer um de ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` ou ``"ab"`` para modo binário, ou ``"rt"``, ``"wt"``, ``"xt"`` , ou ``"at"`` para o modo de texto. O padrão é ``"rb"``.

source: When opening a file for reading, the *format* and *filters* arguments have the same meanings as for :class:`LZMADecompressor`. In this case, the *check* and *preset* arguments should not be used.
pt_br: Ao abrir um arquivo para leitura, os argumentos *format* e *filters* têm os mesmos significados que em :class:`LZMADecompressor`. Neste caso, os argumentos *check* e *preset* não devem ser usados.

source: When opening a file for writing, the *format*, *check*, *preset* and *filters* arguments have the same meanings as for :class:`LZMACompressor`.
pt_br: Ao abrir um arquivo para escrita, os argumentos *format*, *check*, *preset* e *filters* têm os mesmos significados que em :class:`LZMACompressor`.

source: For binary mode, this function is equivalent to the :class:`LZMAFile` constructor: ``LZMAFile(filename, mode, ...)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
pt_br: Para o modo binário, esta função é equivalente ao construtor :class:`LZMAFile`: ``LZMAFile(filename, mode, ...)``. Nesse caso, os argumentos *encoding*, *errors* e *newline* não devem ser fornecidos.

source: For text mode, a :class:`LZMAFile` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
pt_br: Para o modo texto, um objeto :class:`LZMAFile` é criado e encapsulado em uma instância :class:`io.TextIOWrapper` com a codificação especificada, comportamento de tratamento de erros e final(is) de linha.

source: Added support for the ``"x"``, ``"xb"`` and ``"xt"`` modes.
pt_br: Adicionado suporte para os modos ``"x"``, ``"xb"`` e ``"xt"``.

source: Accepts a :term:`path-like object`.
pt_br: Aceita um :term:`objeto caminho ou similar`.

source: Open an LZMA-compressed file in binary mode.
pt_br: Abre um arquivo comprimido com LZMA no modo binário.

source: An :class:`LZMAFile` can wrap an already-open :term:`file object`, or operate directly on a named file. The *filename* argument specifies either the file object to wrap, or the name of the file to open (as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object). When wrapping an existing file object, the wrapped file will not be closed when the :class:`LZMAFile` is closed.
pt_br: Um :class:`LZMAFile` pode envolver um :term:`objeto arquivo <file object>` já aberto, ou operar diretamente em um arquivo nomeado. O argumento *filename* especifica o objeto arquivo a ser encapsulado ou o nome do arquivo a ser aberto (como um objeto :class:`str`, :class:`bytes` ou :term:`caminho ou similar <path-like object>`). Ao agrupar um objeto de arquivo existente, o arquivo agrupado não será fechado quando o :class:`LZMAFile` for fechado.

source: The *mode* argument can be either ``"r"`` for reading (default), ``"w"`` for overwriting, ``"x"`` for exclusive creation, or ``"a"`` for appending. These can equivalently be given as ``"rb"``, ``"wb"``, ``"xb"`` and ``"ab"`` respectively.
pt_br: O argumento *mode* pode ser ``"r"`` para leitura (padrão), ``"w"`` para substituição, ``"x"`` para criação exclusiva ou ``"a"`` para anexar. Estes podem ser equivalentemente dados como ``"rb"``, ``"wb"``, ``"xb"`` e ``"ab"`` respectivamente.

source: If *filename* is a file object (rather than an actual file name), a mode of ``"w"`` does not truncate the file, and is instead equivalent to ``"a"``.
pt_br: Se *filename* for um objeto arquivo (em vez de um nome de arquivo real), um modo de ``"w"`` não truncará o arquivo e será equivalente a ``"a"``.

source: When opening a file for reading, the input file may be the concatenation of multiple separate compressed streams. These are transparently decoded as a single logical stream.
pt_br: Ao abrir um arquivo para leitura, o arquivo de entrada pode ser a concatenação de vários fluxos comprimidos separados. Estes são decodificados de forma transparente como um único fluxo lógico.

source: :class:`LZMAFile` supports all the members specified by :class:`io.BufferedIOBase`, except for :meth:`~io.BufferedIOBase.detach` and :meth:`~io.IOBase.truncate`. Iteration and the :keyword:`with` statement are supported.
pt_br: :class:`LZMAFile` suporta todos os membros especificados por :class:`io.BufferedIOBase`, exceto :meth:`~io.BufferedIOBase.detach` e :meth:`~io.IOBase.truncate`. Iteração e a instrução :keyword:`with` são suportadas.

source: The following method and attributes are also provided:
pt_br: O método e os atributos a seguir também são fornecidos:

source: Return buffered data without advancing the file position. At least one byte of data will be returned, unless EOF has been reached. The exact number of bytes returned is unspecified (the *size* argument is ignored).
pt_br: Retorna dados armazenados em buffer sem avançar a posição do arquivo. Pelo menos um byte de dados será retornado, a menos que o EOF tenha sido atingido. O número exato de bytes retornados não é especificado (o argumento *size* é ignorado).

source: While calling :meth:`peek` does not change the file position of the :class:`LZMAFile`, it may change the position of the underlying file object (e.g. if the :class:`LZMAFile` was constructed by passing a file object for *filename*).
pt_br: Enquanto chamar :meth:`peek` não altera a posição do arquivo de :class:`LZMAFile`, pode alterar a posição do objeto arquivo subjacente (por exemplo, se o :class:`LZMAFile` foi construído passando um objeto arquivo para *nome do arquivo*).

source: ``'rb'`` for reading and ``'wb'`` for writing.
pt_br: ``'rb'`` para leitura e ``'wb'`` para escrita.

source: The lzma file name. Equivalent to the :attr:`~io.FileIO.name` attribute of the underlying :term:`file object`.
pt_br: O nome do arquivo lzma. Equivalente ao atributo :attr:`~io.FileIO.name` do :term:`objeto arquivo` subjacente.

source: Added support for the ``"x"`` and ``"xb"`` modes.
pt_br: Adicionado suporte para os modos ``"x"`` e ``"xb"``.

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
pt_br: O método :meth:`~io.BufferedIOBase.read` agora aceita um argumento de ``None``.

source: Compressing and decompressing data in memory
pt_br: Comprimindo e descomprimindo dados na memória

source: Create a compressor object, which can be used to compress data incrementally.
pt_br: Cria um objeto compressão, que pode ser usado para comprimir dados de forma incremental.

source: For a more convenient way of compressing a single chunk of data, see :func:`compress`.
pt_br: Para uma maneira mais conveniente de comprimir um único bloco de dados, consulte :func:`compress`.

source: The *format* argument specifies what container format should be used. Possible values are:
pt_br: O argumento *format* especifica qual formato de contêiner deve ser usado. Os valores possíveis são:

source: :const:`FORMAT_XZ`: The ``.xz`` container format.
pt_br: :const:`FORMAT_XZ`: O formato de contêiner ``.xz``.

source: This is the default format.
pt_br: Este é o formato padrão.

source: :const:`FORMAT_ALONE`: The legacy ``.lzma`` container format.
pt_br: :const:`FORMAT_ALONE`: O formato de contêiner legado ``.lzma``.

source: This format is more limited than ``.xz`` -- it does not support integrity checks or multiple filters.
pt_br: Este formato é mais limitado que ``.xz`` -- ele não oferece suporte a verificações de integridade ou filtros múltiplos.

source: :const:`FORMAT_RAW`: A raw data stream, not using any container format.
pt_br: :const:`FORMAT_RAW`: Um fluxo de dados brutos, que não usa nenhum formato de contêiner.

source: This format specifier does not support integrity checks, and requires that you always specify a custom filter chain (for both compression and decompression). Additionally, data compressed in this manner cannot be decompressed using :const:`FORMAT_AUTO` (see :class:`LZMADecompressor`).
pt_br: Esse especificador de formato não oferece suporte a verificações de integridade e exige que você sempre especifique uma cadeia de filtros personalizada (para compressão e descompressão). Além disso, dados comprimidos dessa maneira não podem ser descomprimidos usando :const:`FORMAT_AUTO` (veja :class:`LZMADecompressor`).

source: The *check* argument specifies the type of integrity check to include in the compressed data. This check is used when decompressing, to ensure that the data has not been corrupted. Possible values are:
pt_br: O argumento *check* especifica o tipo de verificação de integridade a ser incluída nos dados comprimidos. Essa verificação é usada ao descomprimir, para garantir que os dados não foram corrompidos. Os valores possíveis são:

source: :const:`CHECK_NONE`: No integrity check. This is the default (and the only acceptable value) for :const:`FORMAT_ALONE` and :const:`FORMAT_RAW`.
pt_br: :const:`CHECK_NONE`: Sem verificação de integridade. Este é o padrão (e o único valor aceitável) para :const:`FORMAT_ALONE` e :const:`FORMAT_RAW`.

source: :const:`CHECK_CRC32`: 32-bit Cyclic Redundancy Check.
pt_br: :const:`CHECK_CRC32`: Verificação de redundância cíclica de 32 bits.

source: :const:`CHECK_CRC64`: 64-bit Cyclic Redundancy Check. This is the default for :const:`FORMAT_XZ`.
pt_br: :const:`CHECK_CRC64`: Verificação de redundância cíclica de 64 bits. Este é o padrão para :const:`FORMAT_XZ`.

source: :const:`CHECK_SHA256`: 256-bit Secure Hash Algorithm.
pt_br: :const:`CHECK_SHA256`: Algoritmo de hash seguro de 256 bits.

source: If the specified check is not supported, an :class:`LZMAError` is raised.
pt_br: Se a verificação especificada não for suportada, uma exceção :class:`LZMAError` será levantada.

source: The compression settings can be specified either as a preset compression level (with the *preset* argument), or in detail as a custom filter chain (with the *filters* argument).
pt_br: As configurações de compressão podem ser especificadas como um nível de compressão predefinido (com o argumento *preset*) ou em detalhes como uma cadeia de filtros personalizada (com o argumento *filters*).

source: The *preset* argument (if provided) should be an integer between ``0`` and ``9`` (inclusive), optionally OR-ed with the constant :const:`PRESET_EXTREME`. If neither *preset* nor *filters* are given, the default behavior is to use :const:`PRESET_DEFAULT` (preset level ``6``). Higher presets produce smaller output, but make the compression process slower.
pt_br: O argumento *preset* (se fornecido) deve ser um inteiro entre ``0`` e ``9`` (inclusive), opcionalmente com OR com a constante :const:`PRESET_EXTREME`. Se nem *preset* nem *filters* forem fornecidos, o comportamento padrão é usar :const:`PRESET_DEFAULT` (nível predefinido ``6``). Predefinições mais altas produzem uma saída menor, mas tornam o processo de compressão mais lento.

source: In addition to being more CPU-intensive, compression with higher presets also requires much more memory (and produces output that needs more memory to decompress). With preset ``9`` for example, the overhead for an :class:`LZMACompressor` object can be as high as 800 MiB. For this reason, it is generally best to stick with the default preset.
pt_br: Além de consumir mais CPU, a compressão com predefinições mais altas também requer muito mais memória (e produz uma saída que precisa de mais memória para descompressão). Com a predefinição ``9`` por exemplo, a sobrecarga para um objeto :class:`LZMACompressor` pode chegar a 800 MiB. Por esse motivo, geralmente é melhor ficar com a predefinição padrão.

source: The *filters* argument (if provided) should be a filter chain specifier. See :ref:`filter-chain-specs` for details.
pt_br: O argumento *filters* (se fornecido) deve ser um especificador de cadeia de filtros. Veja :ref:`filter-chain-specs` para detalhes.

source: Compress *data* (a :class:`bytes` object), returning a :class:`bytes` object containing compressed data for at least part of the input. Some of *data* may be buffered internally, for use in later calls to :meth:`compress` and :meth:`flush`. The returned data should be concatenated with the output of any previous calls to :meth:`compress`.
pt_br: Comprime *data* (um objeto :class:`bytes`), retornando um objeto :class:`bytes` contendo dados comprimidos para pelo menos parte da entrada. Alguns dos *data* podem ser armazenados internamente, para uso em chamadas posteriores para :meth:`compress` e :meth:`flush`. Os dados retornados devem ser concatenados com a saída de quaisquer chamadas anteriores para :meth:`compress`.

source: Finish the compression process, returning a :class:`bytes` object containing any data stored in the compressor's internal buffers.
pt_br: Conclui o processo de compressão, retornando um objeto :class:`bytes` contendo todos os dados armazenados nos buffers internos do compressor.

source: The compressor cannot be used after this method has been called.
pt_br: O compressor não pode ser usado após a chamada deste método.

source: Create a decompressor object, which can be used to decompress data incrementally.
pt_br: Cria um objeto descompressor, que pode ser usado para descomprimir dados de forma incremental.

source: For a more convenient way of decompressing an entire compressed stream at once, see :func:`decompress`.
pt_br: Para uma maneira mais conveniente de descomprimir um fluxo comprimido inteiro de uma só vez, consulte :func:`decompress`.

source: The *format* argument specifies the container format that should be used. The default is :const:`FORMAT_AUTO`, which can decompress both ``.xz`` and ``.lzma`` files. Other possible values are :const:`FORMAT_XZ`, :const:`FORMAT_ALONE`, and :const:`FORMAT_RAW`.
pt_br: O argumento *format* especifica o formato do contêiner que deve ser usado. O padrão é :const:`FORMAT_AUTO`, que pode descomprimir os arquivos ``.xz`` e ``.lzma``. Outros valores possíveis são :const:`FORMAT_XZ`, :const:`FORMAT_ALONE` e :const:`FORMAT_RAW`.

source: The *memlimit* argument specifies a limit (in bytes) on the amount of memory that the decompressor can use. When this argument is used, decompression will fail with an :class:`LZMAError` if it is not possible to decompress the input within the given memory limit.
pt_br: O argumento *memlimit* especifica um limite (em bytes) na quantidade de memória que o descompressor pode usar. Quando esse argumento é usado, a descompressão falhará com um :class:`LZMAError` se não for possível descomprimir a entrada dentro do limite de memória fornecido.

source: The *filters* argument specifies the filter chain that was used to create the stream being decompressed. This argument is required if *format* is :const:`FORMAT_RAW`, but should not be used for other formats. See :ref:`filter-chain-specs` for more information about filter chains.
pt_br: O argumento *filters* especifica a cadeia de filtros que foi usada para criar o fluxo que está sendo descomprimido. Este argumento é necessário se *format* for :const:`FORMAT_RAW`, mas não deve ser usado para outros formatos. Veja :ref:`filter-chain-specs` para mais informações sobre cadeias de filtros.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`LZMAFile`. To decompress a multi-stream input with :class:`LZMADecompressor`, you must create a new decompressor for each stream.
pt_br: Esta classe não manipula de forma transparente entradas contendo múltiplos fluxos comprimidos, diferentemente de :func:`decompress` e :class:`LZMAFile`. Para descomprimir uma entrada multi-fluxo com :class:`LZMADecompressor`, você deve criar um novo descompactador para cada fluxo.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
pt_br: Descomprime dados *data* (um :term:`objeto bytes ou similar <bytes-like object>`), retornando dados não comprimidos como bytes. Alguns dos *data* podem ser armazenados em buffer internamente, para uso em chamadas posteriores para :meth:`decompress`. Os dados retornados devem ser concatenados com a saída de qualquer chamada anterior para :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
pt_br: Se *max_length* for não negativo, retornará no máximo *max_length* bytes de dados descomprimidos. Se este limite for atingido e mais saída puder ser produzida, o atributo :attr:`~.needs_input` será definido como ``False``. Neste caso, a próxima chamada para :meth:`~.decompress` pode fornecer *data* como ``b''`` para obter mais saída.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
pt_br: Se todos os dados de entrada foram descomprimidos e retornados (seja porque era menor que *max_length* bytes, ou porque *max_length* era negativo), o atributo :attr:`~.needs_input` será definido como ``True`` .

source: Attempting to decompress data after the end of stream is reached raises an :exc:`EOFError`. Any data found after the end of the stream is ignored and saved in the :attr:`~.unused_data` attribute.
pt_br: A tentativa de descomprimir os dados após o final do fluxo ser atingido gera um :exc:`EOFError`. Quaisquer dados encontrados após o final do fluxo são ignorados e salvos no atributo :attr:`~.unused_data`.

source: Added the *max_length* parameter.
pt_br: Adicionado o parâmetro *max_length*.

source: The ID of the integrity check used by the input stream. This may be :const:`CHECK_UNKNOWN` until enough of the input has been decoded to determine what integrity check it uses.
pt_br: O ID da verificação de integridade usada pelo fluxo de entrada. Pode ser :const:`CHECK_UNKNOWN` até que o suficiente da entrada tenha sido decodificado para determinar qual verificação de integridade ela usa.

source: ``True`` if the end-of-stream marker has been reached.
pt_br: ``True`` se o marcador de fim de fluxo foi atingido.

source: Data found after the end of the compressed stream.
pt_br: Dados encontrados após o término do fluxo comprimido.

source: Before the end of the stream is reached, this will be ``b""``.
pt_br: Antes do final do fluxo ser alcançado, isso será ``b""``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
pt_br: ``False`` se o método :meth:`.decompress` puder fornecer mais dados descomprimidos antes de exigir uma nova entrada não comprimida.

source: Compress *data* (a :class:`bytes` object), returning the compressed data as a :class:`bytes` object.
pt_br: Comprime *data* (um objeto :class:`bytes`), retornando os dados comprimidos como um objeto :class:`bytes`.

source: See :class:`LZMACompressor` above for a description of the *format*, *check*, *preset* and *filters* arguments.
pt_br: Veja :class:`LZMACompressor` acima para uma descrição dos argumentos *format*, *check*, *preset* e *filters*.

source: Decompress *data* (a :class:`bytes` object), returning the uncompressed data as a :class:`bytes` object.
pt_br: Descomprime *data* (um objeto :class:`bytes`), retornando os dados não comprimidos como um objeto :class:`bytes`.

source: If *data* is the concatenation of multiple distinct compressed streams, decompress all of these streams, and return the concatenation of the results.
pt_br: Se *data* forem a concatenação de vários fluxos comprimidos distintos, descomprime todos esses fluxos e retorna a concatenação dos resultados.

source: See :class:`LZMADecompressor` above for a description of the *format*, *memlimit* and *filters* arguments.
pt_br: Veja :class:`LZMADecompressor` acima para uma descrição dos argumentos *format*, *memlimit* e *filters*.

source: Miscellaneous
pt_br: Diversos

source: Return ``True`` if the given integrity check is supported on this system.
pt_br: Retorna ``True`` se a verificação de integridade fornecida for suportada neste sistema.

source: :const:`CHECK_NONE` and :const:`CHECK_CRC32` are always supported. :const:`CHECK_CRC64` and :const:`CHECK_SHA256` may be unavailable if you are using a version of :program:`liblzma` that was compiled with a limited feature set.
pt_br: :const:`CHECK_NONE` e :const:`CHECK_CRC32` são sempre suportados. :const:`CHECK_CRC64` e :const:`CHECK_SHA256` podem não estar disponíveis se você estiver usando uma versão do :program:`liblzma` que foi compilada com um conjunto de recursos limitado.
