Repository: python/python-docs-pt-br
Catalog: library/lzma.po
Languages: pt_br

source: Specifying custom filter chains
pt_br: Especificando cadeias de filtros personalizadas

source: A filter chain specifier is a sequence of dictionaries, where each dictionary contains the ID and options for a single filter. Each dictionary must contain the key ``"id"``, and may contain additional keys to specify filter-dependent options. Valid filter IDs are as follows:
pt_br: Um especificador de cadeia de filtros é uma sequência de dicionários, onde cada dicionário contém o ID e as opções para um único filtro. Cada dicionário deve conter a chave ``"id"`` e pode conter chaves adicionais para especificar opções dependentes do filtro. Os IDs de filtro válidos são os seguintes:

source: Compression filters:
pt_br: Filtro Compression:

source: :const:`FILTER_LZMA1` (for use with :const:`FORMAT_ALONE`)
pt_br: :const:`FILTER_LZMA1` (para ser usado com :const:`FORMAT_ALONE`)

source: :const:`FILTER_LZMA2` (for use with :const:`FORMAT_XZ` and :const:`FORMAT_RAW`)
pt_br: :const:`FILTER_LZMA2` (para ser utilizado com :const:`FORMAT_XZ` and :const:`FORMAT_RAW`)

source: Delta filter:
pt_br: Filtro delta:

source: Branch-Call-Jump (BCJ) filters:
pt_br: Filtros Branch-Call-Jump (BCJ):

source: A filter chain can consist of up to 4 filters, and cannot be empty. The last filter in the chain must be a compression filter, and any other filters must be delta or BCJ filters.
pt_br: Uma cadeia de filtros pode consistir em até 4 filtros e não pode estar vazia. O último filtro na cadeia deve ser um filtro de compressão e quaisquer outros filtros devem ser filtros delta ou BCJ.

source: Compression filters support the following options (specified as additional entries in the dictionary representing the filter):
pt_br: Os filtros de compressão suportam as seguintes opções (especificadas como entradas adicionais no dicionário que representa o filtro):

source: ``preset``: A compression preset to use as a source of default values for options that are not specified explicitly.
pt_br: ``preset``: Uma predefinição de compressão para usar como fonte de valores padrão para opções que não são especificadas explicitamente.

source: ``dict_size``: Dictionary size in bytes. This should be between 4 KiB and 1.5 GiB (inclusive).
pt_br: ``dict_size``: Tamanho do dicionário em bytes. Deve estar entre 4 KiB e 1,5 GiB (inclusive).

source: ``lc``: Number of literal context bits.
pt_br: ``lc``: Número de bits de contexto literal.

source: ``lp``: Number of literal position bits. The sum ``lc + lp`` must be at most 4.
pt_br: ``lp``: Número de bits de posição literal. A soma ``lc + lp`` deve ser no máximo 4.

source: ``pb``: Number of position bits; must be at most 4.
pt_br: ``pb``: Número de bits de posição; deve ser no máximo 4.

source: ``mode``: :const:`MODE_FAST` or :const:`MODE_NORMAL`.
pt_br: ``mode``: :const:`MODE_FAST` ou :const:`MODE_NORMAL`.

source: ``nice_len``: What should be considered a "nice length" for a match. This should be 273 or less.
pt_br: ``nice_len``: O que deve ser considerado um "tamanho agradável" para uma correspondência. Deve ser 273 ou menos.

source: ``mf``: What match finder to use -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3`, or :const:`MF_BT4`.
pt_br: ``mf``: Qual localizador de correspondências usar -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3` ou :const:`MF_BT4`.

source: ``depth``: Maximum search depth used by match finder. 0 (default) means to select automatically based on other filter options.
pt_br: ``depth``: Profundidade máxima de pesquisa usada pelo localizador de correspondências. 0 (padrão) significa selecionar automaticamente com base em outras opções de filtro.

source: The delta filter stores the differences between bytes, producing more repetitive input for the compressor in certain circumstances. It supports one option, ``dist``. This indicates the distance between bytes to be subtracted. The default is 1, i.e. take the differences between adjacent bytes.
pt_br: O filtro delta armazena as diferenças entre bytes, produzindo uma entrada mais repetitiva para o compressor em certas circunstâncias. Ele suporta uma opção, ``dist``. Isso indica a distância entre bytes a ser subtraída. O padrão é 1, ou seja, pega as diferenças entre bytes adjacentes.

source: The BCJ filters are intended to be applied to machine code. They convert relative branches, calls and jumps in the code to use absolute addressing, with the aim of increasing the redundancy that can be exploited by the compressor. These filters support one option, ``start_offset``. This specifies the address that should be mapped to the beginning of the input data. The default is 0.
pt_br: Os filtros BCJ são destinados a serem aplicados ao código de máquina. Eles convertem ramificações relativas, chamadas e saltos no código para usar endereçamento absoluto, com o objetivo de aumentar a redundância que pode ser explorada pelo compressor. Esses filtros suportam uma opção, ``start_offset``. Isso especifica o endereço que deve ser mapeado para o início dos dados de entrada. O padrão é 0.

source: Examples
pt_br: Exemplos

source: Reading in a compressed file::
pt_br: Lendo em um arquivo comprimido::

source: Creating a compressed file::
pt_br: Criando um arquivo comprimido::

source: import lzma data = b"Insert Data Here" with lzma.open("file.xz", "w") as f: f.write(data)
pt_br: import lzma data = b"Insira dados aqui" with lzma.open("file.xz", "w") as f: f.write(data)

source: Compressing data in memory::
pt_br: Comprimindo dados na memória::

source: Incremental compression::
pt_br: Compressão incremental::

source: import lzma lzc = lzma.LZMACompressor() out1 = lzc.compress(b"Some data\n") out2 = lzc.compress(b"Another piece of data\n") out3 = lzc.compress(b"Even more data\n") out4 = lzc.flush() # Concatenate all the partial results: result = b"".join([out1, out2, out3, out4])
pt_br: import lzma lzc = lzma.LZMACompressor() out1 = lzc.compress(b"Alguns dados\n") out2 = lzc.compress(b"Outro pedaço de dados\n") out3 = lzc.compress(b"Ainda mais dados\n") out4 = lzc.flush() # Concatena todos os resultados parciais: result = b"".join([out1, out2, out3, out4])

source: Writing compressed data to an already-open file::
pt_br: Escrevendo dados comprimidos em um arquivo já aberto::

source: import lzma with open("file.xz", "wb") as f: f.write(b"This data will not be compressed\n") with lzma.open(f, "w") as lzf: lzf.write(b"This *will* be compressed\n") f.write(b"Not compressed\n")
pt_br: import lzma with open("file.xz", "wb") as f: f.write(b"Este dados serão comprimidos\n") with lzma.open(f, "w") as lzf: lzf.write(b"Isso *vai* ser comprimidos\n") f.write(b"Não comprimidos\n")

source: Creating a compressed file using a custom filter chain::
pt_br: Criando um arquivo comprimido usando uma cadeia de filtros personalizada::

source: import lzma my_filters = [ {"id": lzma.FILTER_DELTA, "dist": 5}, {"id": lzma.FILTER_LZMA2, "preset": 7 | lzma.PRESET_EXTREME}, ] with lzma.open("file.xz", "w", filters=my_filters) as f: f.write(b"blah blah blah")
pt_br: import lzma my_filters = [ {"id": lzma.FILTER_DELTA, "dist": 5}, {"id": lzma.FILTER_LZMA2, "preset": 7 | lzma.PRESET_EXTREME}, ] with lzma.open("file.xz", "w", filters=my_filters) as f: f.write(b"blá blá blá")
