Repository: python/python-docs-pt-br
Catalog: library/marshal.po
Languages: pt_br

source: :mod:`!marshal` --- Internal Python object serialization
pt_br: :mod:`!marshal` --- Serialização interna de objetos Python

source: This module contains functions that can read and write Python values in a binary format. The format is specific to Python, but independent of machine architecture issues (e.g., you can write a Python value to a file on a PC, transport the file to a Mac, and read it back there). Details of the format are undocumented on purpose; it may change between Python versions (although it rarely does). [#]_
pt_br: Este módulo contém funções que podem ler e gravar valores Python em formato binário. O formato é específico para Python, mas independente dos problemas de arquitetura da máquina (por exemplo, você pode gravar um valor Python em um arquivo em um PC, transportar o arquivo para um Mac e lê-lo de volta lá). Os detalhes do formato não são documentados propositalmente; ele pode mudar entre as versões do Python (embora raramente mude). [#]_

source: This is not a general "persistence" module. For general persistence and transfer of Python objects through RPC calls, see the modules :mod:`pickle` and :mod:`shelve`. The :mod:`marshal` module exists mainly to support reading and writing the "pseudo-compiled" code for Python modules of :file:`.pyc` files. Therefore, the Python maintainers reserve the right to modify the marshal format in backward incompatible ways should the need arise. The format of code objects is not compatible between Python versions, even if the version of the format is the same. De-serializing a code object in the incorrect Python version has undefined behavior. If you're serializing and de-serializing Python objects, use the :mod:`pickle` module instead -- the performance is comparable, version independence is guaranteed, and pickle supports a substantially wider range of objects than marshal.
pt_br: Este não é um módulo de "persistência" geral. Para persistência geral e transferência de objetos Python através de chamadas RPC, veja os módulos :mod:`pickle` e :mod:`shelve`. O módulo :mod:`marshal` existe principalmente para ter suporte à leitura e escrita do código "pseudocompilado" para módulos Python de arquivos :file:`.pyc`. Portanto, os mantenedores do Python se reservam o direito de modificar o formato do marshal de maneiras incompatíveis com versões anteriores, caso seja necessário. O formato dos objetos código não é compatível entre as versões do Python, mesmo que a versão do formato seja a mesma. Desserializar um objeto código na versão incorreta do Python tem um comportamento indefinido. Se você estiver serializando e desserializando objetos Python, use o módulo :mod:`pickle` -- o desempenho é comparável, a independência de versão é garantida e pickle tem suporte a uma gama substancialmente maior de objetos do que marshal.

source: The :mod:`marshal` module is not intended to be secure against erroneous or maliciously constructed data. Never unmarshal data received from an untrusted or unauthenticated source.
pt_br: O módulo :mod:`marshal` não se destina a ser seguro contra dados errôneos ou construídos de forma maliciosa. Nunca faça o unmarshalling de dados recebidos de uma fonte não confiável ou não autenticada.

source: Not all Python object types are supported; in general, only objects whose value is independent from a particular invocation of Python can be written and read by this module. The following types are supported: booleans, integers, floating-point numbers, complex numbers, strings, bytes, bytearrays, tuples, lists, sets, frozensets, dictionaries, and code objects (if *allow_code* is true), where it should be understood that tuples, lists, sets, frozensets and dictionaries are only supported as long as the values contained therein are themselves supported. The singletons :const:`None`, :const:`Ellipsis` and :exc:`StopIteration` can also be marshalled and unmarshalled. For format *version* lower than 3, recursive lists, sets and dictionaries cannot be written (see below).
pt_br: Nem todos os tipos de objetos Python são manipuláveis com marshal; em geral, apenas objetos cujo valor é independente de uma invocação particular de Python podem ser escritos e lidos por este módulo. Os seguintes tipos são suportados: booleanos, inteiros, números de ponto flutuante, números complexos, strings, bytes, bytearrays, tuplas, listas, conjuntos, conjuntos congelados, dicionários e objetos código (se *allow_code* for verdadeiro), onde deve ser entendido que tuplas, listas, conjuntos, conjuntos congelados e os dicionários são suportados apenas enquanto os próprios valores contidos neles forem suportados. Os valores únicos :const:`None`, :const:`Ellipsis` e :exc:`StopIteration` também podem ser serializados e dessarializados com marshal. Para formato *version* inferior a 3, listas recursivas, conjuntos e dicionários não podem ser escritos (veja abaixo).

source: There are functions that read/write files as well as functions operating on bytes-like objects.
pt_br: Existem funções que leem/gravam arquivos, bem como funções que operam em objetos byte ou similares.

source: The module defines these functions:
pt_br: O módulo define estas funções:

source: Write the value on the open file. The value must be a supported type. The file must be a writeable :term:`binary file`.
pt_br: Grava o valor no arquivo aberto. O valor deve ser um tipo compatível. O arquivo deve ser :term:`arquivo binário` gravável.

source: If the value has (or contains an object that has) an unsupported type, a :exc:`ValueError` exception is raised --- but garbage data will also be written to the file. The object will not be properly read back by :func:`load`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true.
pt_br: Se o valor tem (ou contém um objeto que tem) um tipo não suportado, uma exceção :exc:`ValueError` é levantada -- mas dados de lixo também serão gravados no arquivo. O objeto não será lido corretamente por :func:`load`. Há suporte a :ref:`objetos código <code-objects>` somente se *allow_code* for verdadeiro.

source: The *version* argument indicates the data format that ``dump`` should use (see below).
pt_br: O argumento *version* indica o formato de dados que o ``dump`` deve usar (veja abaixo).

source: Raises an :ref:`auditing event <auditing>` ``marshal.dumps`` with arguments ``value``, ``version``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``marshal.dumps`` com os argumentos ``value``, ``version``.

source: Added the *allow_code* parameter.
pt_br: Adicionado o parâmetro *allow_code*.

source: Read one value from the open file and return it. If no valid value is read (e.g. because the data has a different Python version's incompatible marshal format), raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true. The file must be a readable :term:`binary file`.
pt_br: Lê um valor do arquivo aberto e retorna-o. Se nenhum valor válido for lido (por exemplo, porque os dados têm um formato de empacotamento incompatível com uma versão diferente do Python), levanta :exc:`EOFError`, :exc:`ValueError` ou :exc:`TypeError`. Há suporte a :ref:`objetos código <code-objects>` somente se *allow_code* for verdadeiro. O arquivo deve ser um :term:`arquivo binário` legível.

source: Raises an :ref:`auditing event <auditing>` ``marshal.load`` with no arguments.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``marshal.load`` sem argumentos.

source: If an object containing an unsupported type was marshalled with :func:`dump`, :func:`load` will substitute ``None`` for the unmarshallable type.
pt_br: Se um objeto contendo um tipo não suportado foi empacotado com :func:`dump`, :func:`load` irá substituir ``None`` pelo tipo não empacotável.

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.load`` event for the entire load operation.
pt_br: Esta chamada costumava levantar um evento de auditoria ``code.__new__`` para cada objeto código. Agora, ele levanta um único evento ``marshal.load`` para toda a operação de carregamento.

source: Return the bytes object that would be written to a file by ``dump(value, file)``. The value must be a supported type. Raise a :exc:`ValueError` exception if value has (or contains an object that has) an unsupported type. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true.
pt_br: Retorna o objeto bytes que seria escrito em um arquivo por ``dump(value, file)``. O valor deve ser um tipo compatível. Levanta uma exceção :exc:`ValueError` se o valor tem (ou contém um objeto que tem) um tipo não suportado. Há suporte a :ref:`objetos código <code-objects>` somente se *allow_code* for verdadeiro.

source: The *version* argument indicates the data format that ``dumps`` should use (see below).
pt_br: O argumento *version* indica o formato de dados que ``dumps`` deve usar (veja abaixo).

source: Convert the :term:`bytes-like object` to a value. If no valid value is found, raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true. Extra bytes in the input are ignored.
pt_br: Converte o :term:`objeto byte ou similar` em um valor. Se nenhum valor válido for encontrado, levanta :exc:`EOFError`, :exc:`ValueError` ou :exc:`TypeError`. Há suporte a :ref:`objetos código <code-objects>` somente se *allow_code* for verdadeiro. Bytes extras na entrada são ignorados.

source: Raises an :ref:`auditing event <auditing>` ``marshal.loads`` with argument ``bytes``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``marshal.loads`` com o argumento ``bytes``.

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.loads`` event for the entire load operation.
pt_br: Esta chamada costumava levantar um evento de auditoria ``code.__new__`` para cada objeto código. Agora, ele levanta um único evento ``marshal.loads`` para toda a operação de carregamento.

source: In addition, the following constants are defined:
pt_br: Além disso, as seguintes constantes são definidas:

source: Indicates the format that the module uses. Version 0 is the historical format, version 1 shares interned strings and version 2 uses a binary format for floating-point numbers. Version 3 adds support for object instancing and recursion. The current version is 4.
pt_br: Indica o formato que o módulo usa. A versão 0 é o formato histórico, a versão 1 compartilha strings internas e a versão 2 usa um formato binário para números de ponto flutuante. A versão 3 adiciona suporte para instanciação e recursão de objetos. A versão atual é a 4.

source: Footnotes
pt_br: Notas de rodapé

source: The name of this module stems from a bit of terminology used by the designers of Modula-3 (amongst others), who use the term "marshalling" for shipping of data around in a self-contained form. Strictly speaking, "to marshal" means to convert some data from internal to external form (in an RPC buffer for instance) and "unmarshalling" for the reverse process.
pt_br: O nome deste módulo deriva de um pouco da terminologia usada pelos designers do Modula-3 (entre outros), que usam o termo "marshalling" para enviar dados em um formato independente. Estritamente falando, "to marshal" significa converter alguns dados da forma interna para a externa (em um buffer RPC, por exemplo) e "unmarshalling" para o processo reverso.

source: module
pt_br: módulo

source: object
pt_br: objeto

source: code
pt_br: código

source: code object
pt_br: objeto código
