Repository: python/python-docs-pt-br
Catalog: library/math.po
Languages: pt_br

source: :mod:`!math` --- Mathematical functions
pt_br: :mod:`!math` --- Funções matemáticas

source: This module provides access to common mathematical functions and constants, including those defined by the C standard.
pt_br: Este módulo fornece acesso à constantes e funções matemáticas comuns, incluindo aquelas definidas pelo padrão C.

source: These functions cannot be used with complex numbers; use the functions of the same name from the :mod:`cmath` module if you require support for complex numbers. The distinction between functions which support complex numbers and those which don't is made since most users do not want to learn quite as much mathematics as required to understand complex numbers. Receiving an exception instead of a complex result allows earlier detection of the unexpected complex number used as a parameter, so that the programmer can determine how and why it was generated in the first place.
pt_br: Essas funções não podem ser usadas com números complexos; use as funções de mesmo nome do módulo :mod:`cmath` se você precisar de suporte para números complexos. A distinção entre funções que suportam números complexos e aquelas que não suportam é feita uma vez que a maioria dos usuários não quer aprender a matemática necessária para entender números complexos. Receber uma exceção em vez de um resultado complexo permite a detecção antecipada do número complexo inesperado usado como parâmetro, para que o programador possa determinar como e por que ele foi gerado em primeiro lugar.

source: The following functions are provided by this module. Except when explicitly noted otherwise, all return values are floats.
pt_br: As funções a seguir são fornecidas por este módulo. Exceto quando explicitamente indicado de outra forma, todos os valores de retorno são pontos flutuantes.

source: **Number-theoretic functions**
pt_br: **Funções de teoria dos números**

source: Number of ways to choose *k* items from *n* items without repetition and without order
pt_br: Número de maneiras de escolher *k* itens a partir de *n* itens sem repetição e sem ordem

source: *n* factorial
pt_br: Fatorial de *n*

source: Greatest common divisor of the integer arguments
pt_br: Máximo divisor comum dos argumentos inteiros

source: Integer square root of a nonnegative integer *n*
pt_br: Raiz quadrada inteira de um inteiro não negativo *n*

source: Least common multiple of the integer arguments
pt_br: Mínimo múltiplo comum dos argumentos inteiros

source: Number of ways to choose *k* items from *n* items without repetition and with order
pt_br: Número de maneiras de escolher *k* itens de *n* itens sem repetição e com ordem

source: **Floating point arithmetic**
pt_br: **Arimética de ponto flutuante**

source: Ceiling of *x*, the smallest integer greater than or equal to *x*
pt_br: Teto de *x*, o menor número inteiro maior ou igual a *x*

source: Absolute value of *x*
pt_br: Valor absoluto de *x*

source: Floor of *x*, the largest integer less than or equal to *x*
pt_br: Piso de *x*, o maior inteiro menor ou igual a *x*

source: Fused multiply-add operation: ``(x * y) + z``
pt_br: Operação de multiplicação e adição combinadas: ``(x * y) + z``

source: Remainder of division ``x / y``
pt_br: Resto da divisão ``x / y``

source: Fractional and integer parts of *x*
pt_br: Partes fracionárias e inteiras de *x*

source: Remainder of *x* with respect to *y*
pt_br: Resto de *x* em relação a *y*

source: Integer part of *x*
pt_br: Parte inteira de *x*

source: **Floating point manipulation functions**
pt_br: **Funções de manipulação de ponto flutuante**

source: Magnitude (absolute value) of *x* with the sign of *y*
pt_br: Magnitude (valor absoluto) de *x* com o sinal de *y*

source: Mantissa and exponent of *x*
pt_br: Mantissa e expoente de *x*

source: Check if the values *a* and *b* are close to each other
pt_br: Verifica se os valores *a* e *b* estão próximos um do outro

source: Check if *x* is neither an infinity nor a NaN
pt_br: Verifica se *x* não é infinito e nem um NaN

source: Check if *x* is a positive or negative infinity
pt_br: Verifica se *x* é um infinito positivo ou negativo

source: Check if *x* is a NaN (not a number)
pt_br: Verifica se *x* é um NaN (não um número)

source: ``x * (2**i)``, inverse of function :func:`frexp`
pt_br: ``x * (2**i)``, inverso da função :func:`frexp`

source: Floating-point value *steps* steps after *x* towards *y*
pt_br: Valor de ponto flutuante de *steps* passos depois de *x* em direção a *y*

source: Value of the least significant bit of *x*
pt_br: Valor do bit menos significativo de *x*

source: **Power, exponential and logarithmic functions**
pt_br: **Funções de potências, exponenciais e logarítmicas**

source: Cube root of *x*
pt_br: Raiz cúbica de *x*

source: *e* raised to the power *x*
pt_br: *e* elevado à potência *x*

source: *2* raised to the power *x*
pt_br: *2* elevado a potência de *x*

source: *e* raised to the power *x*, minus 1
pt_br: *e* elevado a potência de *x*, menos 1

source: Logarithm of *x* to the given base (*e* by default)
pt_br: Logaritmo de *x* para a base fornecida (*e* por padrão)

source: Natural logarithm of *1+x* (base *e*)
pt_br: Logaritmo natural de *1+x* (base *e*)

source: Base-2 logarithm of *x*
pt_br: Logaritmo de base 2 de *x*

source: Base-10 logarithm of *x*
pt_br: Logaritmo de base 10 de *x*

source: *x* raised to the power *y*
pt_br: *x* elevado à potência *y*

source: Square root of *x*
pt_br: Raiz quadrada de *x*

source: **Summation and product functions**
pt_br: **Funções de soma e produto**

source: Euclidean distance between two points *p* and *q* given as an iterable of coordinates
pt_br: Distância euclidiana entre dois pontos *p* e *q* dada como um iterável de coordenadas

source: Sum of values in the input *iterable*
pt_br: Soma dos valores na entrada *iterable*

source: Euclidean norm of an iterable of coordinates
pt_br: Norma euclidiana de um iterável de coordenadas

source: Product of elements in the input *iterable* with a *start* value
pt_br: Produto de elementos da entrada *iterable* com um valor *start*

source: Sum of products from two iterables *p* and *q*
pt_br: Soma dos produtos de dois iteráveis *p* e *q*

source: **Angular conversion**
pt_br: **Conversão angular**

source: Convert angle *x* from radians to degrees
pt_br: Converte o ângulo *x* de radianos para graus

source: Convert angle *x* from degrees to radians
pt_br: Converte o ângulo *x* de graus para radianos

source: **Trigonometric functions**
pt_br: **Funções trigonométricas**

source: Arc cosine of *x*
pt_br: Arco cosseno de *x*

source: Arc sine of *x*
pt_br: Arco seno de *x*/

source: Arc tangent of *x*
pt_br: Arco tangente de *x*

source: Cosine of *x*
pt_br: Cosseno de *x*

source: Sine of *x*
pt_br: Seno de *x*

source: Tangent of *x*
pt_br: Tangente de *x*

source: **Hyperbolic functions**
pt_br: **Funções hiperbólicas**

source: Inverse hyperbolic cosine of *x*
pt_br: Cosseno hiperbólico inverso de *x*

source: Inverse hyperbolic sine of *x*
pt_br: Seno hiperbólico inverso de *x*

source: Inverse hyperbolic tangent of *x*
pt_br: Tangente hiperbólico inverso de *x*

source: Hyperbolic cosine of *x*
pt_br: Cosseno hiperbólico de *x*

source: Hyperbolic sine of *x*
pt_br: Seno hiperbólico de *x*

source: Hyperbolic tangent of *x*
pt_br: Tangente hiperbólico de *x*

source: **Special functions**
pt_br: **Funções especiais**

source: `Error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*
pt_br: `Função erro <https://pt.wikipedia.org/wiki/Função_erro>`_ em *x*

source: `Complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*
pt_br: `Função erro complementar <https://pt.wikipedia.org/wiki/Função_erro>`_ em *x*

source: `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*
pt_br: `Função gama <https://pt.wikipedia.org/wiki/Função_gama>`_ em *x*

source: Natural logarithm of the absolute value of the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*
pt_br: Logaritmo natural do valor absoluto da `função gama <https://pt.wikipedia.org/wiki/Função_gama>`_ em *x*

source: **Constants**
pt_br: **Constantes**

source: Positive infinity
pt_br: Infinito positivo

source: Number-theoretic functions
pt_br: Funções de teoria dos números

source: Return the number of ways to choose *k* items from *n* items without repetition and without order.
pt_br: Retorna o número de maneiras de escolher *k* itens de *n* itens sem repetição e sem ordem.

source: Evaluates to ``n! / (k! * (n - k)!)`` when ``k <= n`` and evaluates to zero when ``k > n``.
pt_br: Avalia para ``n! / (k! * (n - k)!)`` quando ``k <= n`` e avalia para zero quando ``k > n``.

source: Also called the binomial coefficient because it is equivalent to the coefficient of k-th term in polynomial expansion of ``(1 + x)ⁿ``.
pt_br: Também conhecido como coeficiente binomial pois equivale ao coeficiente do k-ésimo termo na expansão polinomial ``(1 + x)ⁿ``

source: Raises :exc:`TypeError` if either of the arguments are not integers. Raises :exc:`ValueError` if either of the arguments are negative.
pt_br: Levanta :exc:`TypeError` se algum dos argumentos não for inteiro. Levanta :exc:`ValueError` se algum dos argumentos for negativo.

source: Return factorial of the nonnegative integer *n*.
pt_br: Retorna fatorial do inteiro não negativo *n*.

source: Floats with integral values (like ``5.0``) are no longer accepted.
pt_br: Números de ponto flutuate com valor integral (como ``5.0``) não são mais aceitos.

source: Return the greatest common divisor of the specified integer arguments. If any of the arguments is nonzero, then the returned value is the largest positive integer that is a divisor of all arguments. If all arguments are zero, then the returned value is ``0``. ``gcd()`` without arguments returns ``0``.
pt_br: Retorna o maior divisor comum dos argumentos inteiros especificados. Se algum dos argumentos for diferente de zero, o valor retornado será o maior inteiro positivo que é um divisor de todos os argumentos. Se todos os argumentos forem zero, o valor retornado será ``0``. ``gcd()`` sem argumentos retorna ``0``.

source: Added support for an arbitrary number of arguments. Formerly, only two arguments were supported.
pt_br: Adicionado suporte para um número arbitrário de argumentos. Anteriormente, apenas dois argumentos eram suportados.

source: Return the integer square root of the nonnegative integer *n*. This is the floor of the exact square root of *n*, or equivalently the greatest integer *a* such that *a*\ ² |nbsp| ≤ |nbsp| *n*.
pt_br: Retorna a raiz quadrada inteira do inteiro não negativo *n*. Este é o piso da raiz quadrada exata de *n*, ou equivalentemente o maior inteiro *a* tal que *a*\ ² |nbsp| ≤ |nbsp| *n*.

source: For some applications, it may be more convenient to have the least integer *a* such that *n* |nbsp| ≤ |nbsp| *a*\ ², or in other words the ceiling of the exact square root of *n*. For positive *n*, this can be computed using ``a = 1 + isqrt(n - 1)``.
pt_br: Para algumas aplicações, pode ser mais conveniente ter o menor número inteiro *a* tal que *n* |nbsp| ≤ |nbsp| *a*\ ² ou, em outras palavras, o teto da raiz quadrada exata de *n*. Para *n* positivo, isso pode ser calculado usando ``a = 1 + isqrt(n - 1)``.

source: Return the least common multiple of the specified integer arguments. If all arguments are nonzero, then the returned value is the smallest positive integer that is a multiple of all arguments. If any of the arguments is zero, then the returned value is ``0``. ``lcm()`` without arguments returns ``1``.
pt_br: Retorna o mínimo múltiplo comum dos argumentos inteiros especificados. Se todos os argumentos forem diferentes de zero, o valor retornado será o menor inteiro positivo que é um múltiplo de todos os argumentos. Se algum dos argumentos for zero, o valor retornado será ``0``. ``lcm()`` sem argumentos retorna ``1``.

source: Return the number of ways to choose *k* items from *n* items without repetition and with order.
pt_br: Retorna o número de maneiras de escolher *k* itens de *n* itens sem repetição e com ordem.

source: Evaluates to ``n! / (n - k)!`` when ``k <= n`` and evaluates to zero when ``k > n``.
pt_br: Avalia para ``n! / (n - k)!`` quando ``k <= n`` e avalia para zero quando ``k > n``.

source: If *k* is not specified or is ``None``, then *k* defaults to *n* and the function returns ``n!``.
pt_br: Se *k* não for especificado ou for ``None``, *k* usará o padrão *n* e a função retornará ``n!``.

source: Floating point arithmetic
pt_br: Arimética de ponto flutuante

source: Return the ceiling of *x*, the smallest integer greater than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__ceil__ <object.__ceil__>`, which should return an :class:`~numbers.Integral` value.
pt_br: Retorna o teto de *x*, o menor inteiro maior ou igual que *x*. Se *x* não é um float, delega para :meth:`x.__ceil__ <object.__ceil__>`, que deve retornar um valor do tipo :class:`~numbers.Integral`.

source: Return the absolute value of *x*.
pt_br: Retorna o valor absoluto de *x*.

source: Return the floor of *x*, the largest integer less than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__floor__ <object.__floor__>`, which should return an :class:`~numbers.Integral` value.
pt_br: Retorna o chão de *x*, o maior inteiro menor ou igual a *x*. Se *x* não é um ponto flutuante, delega para :meth:`x.__floor__ <object.__floor__>`, que deve retornar um valor do tipo :class:`~numbers.Integral`

source: Fused multiply-add operation. Return ``(x * y) + z``, computed as though with infinite precision and range followed by a single round to the ``float`` format. This operation often provides better accuracy than the direct expression ``(x * y) + z``.
pt_br: Operação de multiplicação-adição combinada. Retorna ``(x * y) + z``, calculado de forma a obter o mesmo resultado que seria obtido se o cálculo desfrutasse de precisão e limites infinitos, seguido de um único arredondamento para o formato ``float``. Esta operação frequentemente oferece acurácia melhor do que a expressão direta ``(x * y) + z`` ofereceria.

source: This function follows the specification of the fusedMultiplyAdd operation described in the IEEE 754 standard. The standard leaves one case implementation-defined, namely the result of ``fma(0, inf, nan)`` and ``fma(inf, 0, nan)``. In these cases, ``math.fma`` returns a NaN, and does not raise any exception.
pt_br: Esta função segue a especificação da operação fusedMultiplyAdd descrita no padrão IEEE 754. O padrão deixa um caso a ser definido pela implementação, que são os resultados de ``fma(0, inf, nan)`` e ``fma(inf, 0, nan)``. Nestes casos, ``math.fma`` retorna NaN, e não levanta nenhuma exceção.

source: Return the floating-point remainder of ``x / y``, as defined by the platform C library function ``fmod(x, y)``. Note that the Python expression ``x % y`` may not return the same result. The intent of the C standard is that ``fmod(x, y)`` be exactly (mathematically; to infinite precision) equal to ``x - n*y`` for some integer *n* such that the result has the same sign as *x* and magnitude less than ``abs(y)``. Python's ``x % y`` returns a result with the sign of *y* instead, and may not be exactly computable for float arguments. For example, ``fmod(-1e-100, 1e100)`` is ``-1e-100``, but the result of Python's ``-1e-100 % 1e100`` is ``1e100-1e-100``, which cannot be represented exactly as a float, and rounds to the surprising ``1e100``. For this reason, function :func:`fmod` is generally preferred when working with floats, while Python's ``x % y`` is preferred when working with integers.
pt_br: Retorna o resto ponto flutuante de ``x / y``, conforme definido pela função ``fmod(x, y)`` da biblioteca C da plataforma. Observe que a expressão Python ``x % y`` pode não retornar o mesmo resultado. A intenção do padrão C é que ``fmod(x, y)`` seja exatamente (matematicamente; com precisão infinita) igual a ``x - n*y`` para algum inteiro *n* de modo que o resultado tenha o mesmo sinal que *x* e magnitude menor que ``abs(y)``. O ``x % y`` do Python retorna um resultado com o sinal de *y*, e pode não ser exatamente computável para argumentos de ponto flutuante. Por exemplo, ``fmod(-1e-100, 1e100)`` é ``-1e-100``, mas o resultado de ``-1e-100 % 1e100`` do Python é ``1e100-1e-100``, que não pode ser representado exatamente como um ponto flutuante, e é arredondado para o surpreendente ``1e100``. Por esta razão, a função :func:`fmod` é geralmente preferida ao trabalhar com pontos flutuantes, enquanto o ``x % y`` do Python é preferido ao trabalhar com inteiros.

source: Return the fractional and integer parts of *x*. Both results carry the sign of *x* and are floats.
pt_br: Retorna as partes fracionárias e inteiras de *x*. Ambos os resultados carregam o sinal de *x* e são pontos flutuantes.

source: Note that :func:`modf` has a different call/return pattern than its C equivalents: it takes a single argument and return a pair of values, rather than returning its second return value through an 'output parameter' (there is no such thing in Python).
pt_br: Observe que :func:`modf` tem um padrão de chamada/retorno diferente de seu equivalente C: elas pegam um único argumento e retornam um par de valores, ao invés de retornar seu segundo valor de retorno por meio de um "parâmetro de saída" (não existe tal coisa em Python).

source: Return the IEEE 754-style remainder of *x* with respect to *y*. For finite *x* and finite nonzero *y*, this is the difference ``x - n*y``, where ``n`` is the closest integer to the exact value of the quotient ``x / y``. If ``x / y`` is exactly halfway between two consecutive integers, the nearest *even* integer is used for ``n``. The remainder ``r = remainder(x, y)`` thus always satisfies ``abs(r) <= 0.5 * abs(y)``.
pt_br: Retorna o resto no estilo IEEE 754 de *x* em relação a *y*. Para o finito *x* e o finito diferente de zero *y*, esta é a diferença ``x - n*y``, onde ``n`` é o número inteiro mais próximo do valor exato do quociente ``x / y`` . Se ``x / y`` está exatamente no meio do caminho entre dois inteiros consecutivos, o inteiro *par* mais próximo é usado para ``n``. O resto ``r = remainder(x, y)`` assim sempre satisfaz ``abs(r) <= 0.5 * abs(y)``.

source: Special cases follow IEEE 754: in particular, ``remainder(x, math.inf)`` is *x* for any finite *x*, and ``remainder(x, 0)`` and ``remainder(math.inf, x)`` raise :exc:`ValueError` for any non-NaN *x*. If the result of the remainder operation is zero, that zero will have the same sign as *x*.
pt_br: Casos especiais seguem IEEE 754: em particular, ``remainder(x, math.inf)`` é *x* para qualquer *x* finito, e ``remainder(x, 0)`` e ``remainder(math.inf, x)`` levantam :exc:`ValueError` para qualquer *x* não NaN. Se o resultado da operação ``remainder`` for zero, esse zero terá o mesmo sinal de *x*.

source: On platforms using IEEE 754 binary floating point, the result of this operation is always exactly representable: no rounding error is introduced.
pt_br: Em plataformas que usam ponto flutuante binário do IEEE 754, o resultado dessa operação é sempre exatamente representável: nenhum erro de arredondamento é introduzido.

source: Return *x* with the fractional part removed, leaving the integer part. This rounds toward 0: ``trunc()`` is equivalent to :func:`floor` for positive *x*, and equivalent to :func:`ceil` for negative *x*. If *x* is not a float, delegates to :meth:`x.__trunc__ <object.__trunc__>`, which should return an :class:`~numbers.Integral` value.
pt_br: Retorna *x* com a parte fracionária removida, deixando a parte inteira. Isso arredonda para 0: ``trunc()`` é equivalente a :func:`floor` para *x* positivos, e equivalentes a :func:`ceil` para *x* negativos. Se *x* não é um ponto flutuante, então delega para :meth:`x.__trunc__ <object.__trunc__>`, cujo qual deve retornar um valor do tipo :class:`~numbers.Integral`.

source: For the :func:`ceil`, :func:`floor`, and :func:`modf` functions, note that *all* floating-point numbers of sufficiently large magnitude are exact integers. Python floats typically carry no more than 53 bits of precision (the same as the platform C double type), in which case any float *x* with ``abs(x) >= 2**52`` necessarily has no fractional bits.
pt_br: Para as funções :func:`ceil`, :func:`floor` e :func:`modf`, observe que *todos* os números de ponto flutuante de magnitude suficientemente grande são inteiros exatos. Os pontos flutuantes do Python normalmente não carregam mais do que 53 bits de precisão (o mesmo que o tipo duplo da plataforma C), caso em que qualquer ponto flutuante *x* com ``abs(x) >= 2**52`` necessariamente não tem bits fracionários.

source: Floating point manipulation functions
pt_br: Funções de manipulação de ponto flutuante

source: Return a float with the magnitude (absolute value) of *x* but the sign of *y*. On platforms that support signed zeros, ``copysign(1.0, -0.0)`` returns *-1.0*.
pt_br: Retorna um ponto flutuante com a magnitude (valor absoluto) de *x*, mas o sinal de *y*. Em plataformas que suportam zeros com sinal, ``copysign(1.0, -0.0)`` retorna *-1.0*.

source: Return the mantissa and exponent of *x* as the pair ``(m, e)``. *m* is a float and *e* is an integer such that ``x == m * 2**e`` exactly. If *x* is zero, returns ``(0.0, 0)``, otherwise ``0.5 <= abs(m) < 1``. This is used to "pick apart" the internal representation of a float in a portable way.
pt_br: Retorna a mantissa e o expoente de *x* como o par ``(m, e)``. *m* é um ponto flutuante e *e* é um inteiro tal que ``x == m * 2**e`` exatamente. Se *x* for zero, retorna ``(0.0, 0)``, caso contrário, ``0.5 <= abs(m) < 1``. Isso é usado para "separar" a representação interna de um ponto flutuante de forma portátil.

source: Note that :func:`frexp` has a different call/return pattern than its C equivalents: it takes a single argument and return a pair of values, rather than returning its second return value through an 'output parameter' (there is no such thing in Python).
pt_br: Observe que :func:`frexp` tem um padrão de chamada/retorno diferente de seu equivalente C: elas pegam um único argumento e retornam um par de valores, ao invés de retornar seu segundo valor de retorno por meio de um "parâmetro de saída" (não existe tal coisa em Python).

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
pt_br: Retorna ``True`` se os valores *a* e *b* estiverem próximos e ``False`` caso contrário.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances. If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
pt_br: Se dois valores são considerados próximos ou não é determinado de acordo com tolerâncias absolutas e relativas fornecidas. Se nenhum erro ocorrer, o resultado será: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be nonnegative and less than ``1.0``.
pt_br: *rel_tol* é a tolerância relativa -- é a diferença máxima permitida entre *a* e *b*, em relação ao maior valor absoluto de *a* ou *b*. Por exemplo, para definir uma tolerância de 5%, passe ``rel_tol=0.05``. A tolerância padrão é ``1e-09``, o que garante que os dois valores sejam iguais em cerca de 9 dígitos decimais. *rel_tol* deve ser não negativo e menor que ``1.0``.
