Repository: python/python-docs-pt-br
Catalog: library/math.po
Languages: pt_br

source: *abs_tol* is the absolute tolerance; it defaults to ``0.0`` and it must be nonnegative. When comparing ``x`` to ``0.0``, ``isclose(x, 0)`` is computed as ``abs(x) <= rel_tol * abs(x)``, which is ``False`` for any nonzero ``x`` and *rel_tol* less than ``1.0``. So add an appropriate positive *abs_tol* argument to the call.
pt_br: *abs_tol* é a tolerância absoluta; o padrão é ``0.0`` e deve ser não negativo. Ao comparar ``x`` com ``0.0``, ``isclose(x, 0)`` é computado como ``abs(x) <= rel_tol * abs(x)``, que é ``False`` para qualquer ``x`` não zero e *rel_tol* menor que ``1.0``. Então adicione um argumento *abs_tol* positivo apropriado à chamada.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
pt_br: Os valores especiais do IEEE 754 de ``NaN``, ``inf`` e ``-inf`` serão tratados de acordo com as regras do IEEE. Especificamente, ``NaN`` não é considerado próximo a qualquer outro valor, incluindo ``NaN``. ``inf`` e ``-inf`` são considerados apenas próximos a si mesmos.

source: :pep:`485` -- A function for testing approximate equality
pt_br: :pep:`485` -- Uma função para testar igualdade aproximada

source: Return ``True`` if *x* is neither an infinity nor a NaN, and ``False`` otherwise. (Note that ``0.0`` *is* considered finite.)
pt_br: Retorna ``True`` se *x* não for um infinito nem um NaN, e ``False`` caso contrário. (Observe que ``0.0`` *é* considerado finito.)

source: Return ``True`` if *x* is a positive or negative infinity, and ``False`` otherwise.
pt_br: Retorna ``True`` se *x* for um infinito positivo ou negativo, e ``False`` caso contrário.

source: Return ``True`` if *x* is a NaN (not a number), and ``False`` otherwise.
pt_br: Retorna ``True`` se *x* for um NaN (não um número), e ``False`` caso contrário.

source: Return ``x * (2**i)``. This is essentially the inverse of function :func:`frexp`.
pt_br: Retorna ``x * (2**i)``. Este é essencialmente o inverso da função :func:`frexp`.

source: Return the floating-point value *steps* steps after *x* towards *y*.
pt_br: Retorna o valor de ponto flutuante com *steps* passos após *x* em direção a *y*.

source: If *x* is equal to *y*, return *y*, unless *steps* is zero.
pt_br: Se *x* for igual a *y*, retorna *y*, a menos que *steps* seja zero.

source: Examples:
pt_br: Exemplos:

source: ``math.nextafter(x, math.inf)`` goes up: towards positive infinity.
pt_br: ``math.nextafter(x, math.inf)`` sobe: em direção ao infinito positivo.

source: ``math.nextafter(x, -math.inf)`` goes down: towards minus infinity.
pt_br: ``math.nextafter(x, -math.inf)`` desce: em direção ao menos infinito.

source: ``math.nextafter(x, 0.0)`` goes towards zero.
pt_br: ``math.nextafter(x, 0.0)`` vai em direção a zero.

source: ``math.nextafter(x, math.copysign(math.inf, x))`` goes away from zero.
pt_br: ``math.nextafter(x, math.copysign(math.inf, x))`` se afasta do zero.

source: See also :func:`math.ulp`.
pt_br: Veja também :func:`math.ulp.`

source: Added the *steps* argument.
pt_br: Adicionado o argumento *steps*.

source: Return the value of the least significant bit of the float *x*:
pt_br: Retorna o valor do bit menos significativo do ponto flutuante *x*:

source: If *x* is a NaN (not a number), return *x*.
pt_br: Se *x* for um NaN (não um número), retorna *x*.

source: If *x* is negative, return ``ulp(-x)``.
pt_br: Se *x* for negativo, retorna ``ulp(-x)``.

source: If *x* is a positive infinity, return *x*.
pt_br: Se *x* for um infinito positivo, retorna *x*.

source: If *x* is equal to zero, return the smallest positive *denormalized* representable float (smaller than the minimum positive *normalized* float, :data:`sys.float_info.min <sys.float_info>`).
pt_br: Se *x* for igual a zero, retorna o menor valor flutuante positivo *desnormalizado* representável (menor que o ponto flutuante de valor mínimo positivo *normalizado*, :data:`sys.float_info.min <sys.float_info>`).

source: If *x* is equal to the largest positive representable float, return the value of the least significant bit of *x*, such that the first float smaller than *x* is ``x - ulp(x)``.
pt_br: Se *x* for igual ao maior ponto flutuante positivo representável, retorna o valor do bit menos significativo de *x*, tal que o primeiro ponto flutuante menor que *x* seja ``x - ulp(x)``.

source: Otherwise (*x* is a positive finite number), return the value of the least significant bit of *x*, such that the first float bigger than *x* is ``x + ulp(x)``.
pt_br: Caso contrário (*x* é um número finito positivo), retorna o valor do bit menos significativo de *x*, de modo que o primeiro ponto flutuante maior que *x* seja ``x + ulp(x)``.

source: ULP stands for "Unit in the Last Place".
pt_br: ULP significa "Unit in the Last Place" ou, em português, unidade na última posição.

source: See also :func:`math.nextafter` and :data:`sys.float_info.epsilon <sys.float_info>`.
pt_br: Veja também :func:`math.nextafter` e :data:`sys.float_info.epsilon <sys.float_info>`.

source: Power, exponential and logarithmic functions
pt_br: Funções de potências, exponenciais e logarítmicas

source: Return the cube root of *x*.
pt_br: Retorna a raiz cúbica de *x*.

source: Return *e* raised to the power *x*, where *e* = 2.718281... is the base of natural logarithms. This is usually more accurate than ``math.e ** x`` or ``pow(math.e, x)``.
pt_br: Retorna *e* elevado à potência *x*, onde *e* = 2.718281... é a base dos logaritmos naturais. Isso geralmente é mais preciso do que ``math.e ** x`` ou ``pow(math.e, x)``.

source: Return *2* raised to the power *x*.
pt_br: Retorna *2* elevado a *x*

source: Return *e* raised to the power *x*, minus 1. Here *e* is the base of natural logarithms. For small floats *x*, the subtraction in ``exp(x) - 1`` can result in a `significant loss of precision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; the :func:`expm1` function provides a way to compute this quantity to full precision:
pt_br: Retorna *e* elevado à potência *x*, menos 1. Aqui *e* é a base dos logaritmos naturais. Para pequenos pontos flutuantes *x*, a subtração em ``exp(x) - 1`` pode resultar em uma `perda significativa de precisão <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; a função :func:`expm1` fornece uma maneira de calcular essa quantidade com precisão total:

source: With one argument, return the natural logarithm of *x* (to base *e*).
pt_br: Com um argumento, retorna o logaritmo natural de *x* (para base *e*).

source: With two arguments, return the logarithm of *x* to the given *base*, calculated as ``log(x)/log(base)``.
pt_br: Com dois argumentos, retorna o logaritmo de *x* para a *base* fornecida, calculada como ``log(x)/log(base)``.

source: Return the natural logarithm of *1+x* (base *e*). The result is calculated in a way which is accurate for *x* near zero.
pt_br: Retorna o logaritmo natural de *1+x* (base *e*). O resultado é calculado de forma precisa para *x* próximo a zero.

source: Return the base-2 logarithm of *x*. This is usually more accurate than ``log(x, 2)``.
pt_br: Retorna o logaritmo de base 2 de *x*. Isso geralmente é mais preciso do que ``log(x, 2)``.

source: :meth:`int.bit_length` returns the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros.
pt_br: :meth:`int.bit_length` retorna o número de bits necessários para representar um inteiro em binário, excluindo o sinal e os zeros à esquerda.

source: Return the base-10 logarithm of *x*. This is usually more accurate than ``log(x, 10)``.
pt_br: Retorna o logaritmo de base 10 de *x*. Isso geralmente é mais preciso do que ``log(x, 10)``.

source: Return *x* raised to the power *y*. Exceptional cases follow the IEEE 754 standard as far as possible. In particular, ``pow(1.0, x)`` and ``pow(x, 0.0)`` always return ``1.0``, even when *x* is a zero or a NaN. If both *x* and *y* are finite, *x* is negative, and *y* is not an integer then ``pow(x, y)`` is undefined, and raises :exc:`ValueError`.
pt_br: Retorna *x* elevado a potência de *y*. Exceções seguem o padrão IEEE 754 o máximo possível. ``pow(1.0, x)`` e ``pow(x, 0.0)`` em particular sempre retornam ``1.0``, mesmo quando *x* é ZERO ou NaN. Se ambos *x* e *y* são números finitos, *x* é negativo, e *y* não é um inteiro então ``pow(x, y)`` é indefinido e levanta :exc:`ValueError`.

source: Unlike the built-in ``**`` operator, :func:`math.pow` converts both its arguments to type :class:`float`. Use ``**`` or the built-in :func:`pow` function for computing exact integer powers.
pt_br: Ao contrário do operador embutido ``**``, :func:`math.pow` converte ambos os seus argumentos para o tipo :class:`float`. Use ``**`` ou a função embutida :func:`pow` para calcular potências inteiras exatas.

source: The special cases ``pow(0.0, -inf)`` and ``pow(-0.0, -inf)`` were changed to return ``inf`` instead of raising :exc:`ValueError`, for consistency with IEEE 754.
pt_br: Os casos especiais ``pow(0.0, -inf)`` e ``pow(-0.0, -inf)`` foram alterados para retornar ``inf`` ao invés de levantar :exc:`ValueError`, para ter consistência com a IEEE 754.

source: Return the square root of *x*.
pt_br: Retorna a raiz quadrada de *x*.

source: Summation and product functions
pt_br: Funções de soma e produto

source: Return the Euclidean distance between two points *p* and *q*, each given as a sequence (or iterable) of coordinates. The two points must have the same dimension.
pt_br: Retorna a distância euclidiana entre dois pontos *p* e *q*, cada um dado como uma sequência (ou iterável) de coordenadas. Os dois pontos devem ter a mesma dimensão.

source: Roughly equivalent to::
pt_br: Aproximadamente equivalente a::

source: Return an accurate floating-point sum of values in the iterable. Avoids loss of precision by tracking multiple intermediate partial sums.
pt_br: Retorna uma soma precisa dos valores de ponto flutuante no iterável. Evita perda de precisão rastreando várias somas parciais intermediárias.

source: The algorithm's accuracy depends on IEEE-754 arithmetic guarantees and the typical case where the rounding mode is half-even. On some non-Windows builds, the underlying C library uses extended precision addition and may occasionally double-round an intermediate sum causing it to be off in its least significant bit.
pt_br: A precisão do algoritmo depende das garantias aritméticas do IEEE-754 e do caso típico em que o modo de arredondamento é meio par. Em algumas compilações que não são do Windows, a biblioteca C subjacente usa adição de precisão estendida e pode ocasionalmente arredondar uma soma intermediária fazendo com que ela introduza um erro no bit menos significativo.

source: For further discussion and two alternative approaches, see the `ASPN cookbook recipes for accurate floating-point summation <https://code.activestate.com/recipes/393090-binary-floating-point-summation-accurate-to-full-p/>`_\.
pt_br: Para uma discussão mais aprofundada e duas abordagens alternativas, consulte o `ASPN cookbook recipes for accurate floating point summation <https://code.activestate.com/recipes/393090-binary-floating-point-summation-accurate-to-full-p/>`_\.

source: Return the Euclidean norm, ``sqrt(sum(x**2 for x in coordinates))``. This is the length of the vector from the origin to the point given by the coordinates.
pt_br: Retorna a norma euclidiana, ``sqrt(sum(x**2 for x in coordinates))``. Este é o comprimento do vetor da origem até o ponto dado pelas coordenadas.

source: For a two dimensional point ``(x, y)``, this is equivalent to computing the hypotenuse of a right triangle using the Pythagorean theorem, ``sqrt(x*x + y*y)``.
pt_br: Para um ponto bidimensional ``(x, y)``, isso é equivalente a calcular a hipotenusa de um triângulo retângulo usando o teorema de Pitágoras, ``sqrt(x*x + y*y)``.

source: Added support for n-dimensional points. Formerly, only the two dimensional case was supported.
pt_br: Adicionado suporte para pontos n-dimensionais. Anteriormente, apenas o caso bidimensional era suportado.

source: Improved the algorithm's accuracy so that the maximum error is under 1 ulp (unit in the last place). More typically, the result is almost always correctly rounded to within 1/2 ulp.
pt_br: Melhorou a precisão do algoritmo para que o erro máximo seja inferior a 1 ulp (unidade no último lugar). Mais tipicamente, o resultado é quase sempre arredondado corretamente para 1/2 ulp.

source: Calculate the product of all the elements in the input *iterable*. The default *start* value for the product is ``1``.
pt_br: Calcula o produto de todos os elementos na entrada *iterable*. O valor *start* padrão para o produto é ``1``.

source: When the iterable is empty, return the start value. This function is intended specifically for use with numeric values and may reject non-numeric types.
pt_br: Quando o iterável estiver vazio, retorna o valor de start. Esta função deve ser usada especificamente com valores numéricos e pode rejeitar tipos não numéricos.

source: Return the sum of products of values from two iterables *p* and *q*.
pt_br: Retorna a soma dos produtos dos valores de dois iteráveis *p* e *q*.

source: Raises :exc:`ValueError` if the inputs do not have the same length.
pt_br: Levanta :exc:`ValueError` se as entradas não tiverem o mesmo comprimento.

source: For float and mixed int/float inputs, the intermediate products and sums are computed with extended precision.
pt_br: Para entradas float e mistas int/float, os produtos intermediários e as somas são calculados com precisão estendida.

source: Angular conversion
pt_br: Conversão angular

source: Convert angle *x* from radians to degrees.
pt_br: Converte o ângulo *x* de radianos para graus.

source: Convert angle *x* from degrees to radians.
pt_br: Converte o ângulo *x* de graus para radianos.

source: Trigonometric functions
pt_br: Funções trigonométricas

source: Return the arc cosine of *x*, in radians. The result is between ``0`` and ``pi``.
pt_br: Retorna o arco cosseno de *x*, em radianos. O resultado está entre ``0`` e ``pi``.

source: Return the arc sine of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
pt_br: Retorna o arco seno de *x*, em radianos. O resultado está entre ``-pi/2`` e ``pi/2``.

source: Return the arc tangent of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
pt_br: Retorna o arco tangente de *x*, em radianos. O resultado está entre ``-pi/2`` e ``pi/2``.

source: Return ``atan(y / x)``, in radians. The result is between ``-pi`` and ``pi``. The vector in the plane from the origin to point ``(x, y)`` makes this angle with the positive X axis. The point of :func:`atan2` is that the signs of both inputs are known to it, so it can compute the correct quadrant for the angle. For example, ``atan(1)`` and ``atan2(1, 1)`` are both ``pi/4``, but ``atan2(-1, -1)`` is ``-3*pi/4``.
pt_br: Retorna ``atan(y / x)``, em radianos. O resultado está entre ``-pi`` e ``pi``. O vetor no plano da origem ao ponto ``(x, y)`` faz este ângulo com o eixo X positivo. O ponto de :func:`atan2` é que os sinais de ambas as entradas são conhecidos por ele, então ele pode calcular o quadrante correto para o ângulo. Por exemplo, ``atan(1)`` e ``atan2(1, 1)`` são ambos ``pi/4``, mas ``atan2(-1, -1)`` é ``-3*pi/4``.

source: Return the cosine of *x* radians.
pt_br: Retorna o cosseno de *x* radianos.

source: Return the sine of *x* radians.
pt_br: Retorna o seno de *x* radianos.

source: Return the tangent of *x* radians.
pt_br: Retorna o tangente de *x* radianos.

source: Hyperbolic functions
pt_br: Funções hiperbólicas

source: `Hyperbolic functions <https://en.wikipedia.org/wiki/Hyperbolic_functions>`_ are analogs of trigonometric functions that are based on hyperbolas instead of circles.
pt_br: `Funções hiperbólicas <https://en.wikipedia.org/wiki/Hyperbolic_functions>`_ são análogas às funções trigonométricas baseadas em hipérboles em vez de círculos.

source: Return the inverse hyperbolic cosine of *x*.
pt_br: Retorna o cosseno hiperbólico inverso de *x*.

source: Return the inverse hyperbolic sine of *x*.
pt_br: Retorna o seno hiperbólico inverso de *x*.

source: Return the inverse hyperbolic tangent of *x*.
pt_br: Retorna a tangente hiperbólica inversa de *x*.

source: Return the hyperbolic cosine of *x*.
pt_br: Retorna o cosseno hiperbólico de *x*.

source: Return the hyperbolic sine of *x*.
pt_br: Retorna o seno hiperbólico de *x*.

source: Return the hyperbolic tangent of *x*.
pt_br: Retorna a tangente hiperbólica de *x*.

source: Special functions
pt_br: Funções especiais

source: Return the `error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*.
pt_br: Retorna a `função erro <https://pt.wikipedia.org/wiki/Função_erro>`_ em *x*.

source: The :func:`erf` function can be used to compute traditional statistical functions such as the `cumulative standard normal distribution <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_::
pt_br: A função :func:`erf` pode ser usada para calcular funções estatísticas tradicionais, como a `distribuição normal padrão cumulativa <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_::

source: def phi(x): 'Cumulative distribution function for the standard normal distribution' return (1.0 + erf(x / sqrt(2.0))) / 2.0
pt_br: def phi(x): 'Função de distribuição cumulativa para a distribuição normal padrão.' return (1.0 + erf(x / sqrt(2.0))) / 2.0

source: Return the complementary error function at *x*. The `complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ is defined as ``1.0 - erf(x)``. It is used for large values of *x* where a subtraction from one would cause a `loss of significance <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.
pt_br: Retorna a função erro complementar em *x*. A `função erro complementar <https://en.wikipedia.org/wiki/Error_function>`_ é definida como ``1.0 - erf(x)``. É usado para grandes valores de *x* onde uma subtração de um causaria uma `perda de significância <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.

source: Return the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*.
pt_br: Retorna a `função gama <https://pt.wikipedia.org/wiki/Função_gama>`_ em *x*.

source: Return the natural logarithm of the absolute value of the Gamma function at *x*.
pt_br: Retorna o logaritmo natural do valor absoluto da função gama em *x*.

source: Constants
pt_br: Constantes

source: The mathematical constant *π* = 3.141592..., to available precision.
pt_br: A constante matemática *π* = 3.141592..., para a precisão disponível.

source: The mathematical constant *e* = 2.718281..., to available precision.
pt_br: A constante matemática *e* = 2.718281..., para a precisão disponível.

source: The mathematical constant *τ* = 6.283185..., to available precision. Tau is a circle constant equal to 2\ *π*, the ratio of a circle's circumference to its radius. To learn more about Tau, check out Vi Hart's video `Pi is (still) Wrong <https://vimeo.com/147792667>`_, and start celebrating `Tau day <https://tauday.com/>`_ by eating twice as much pie!
pt_br: A constante matemática *τ* = 6.283185..., para a precisão disponível. Tau é uma constante de círculo igual a 2\ *π*, a razão entre a circunferência de um círculo e seu raio. Para saber mais sobre Tau, confira o vídeo `Pi is (still) Wrong <https://vimeo.com/147792667>`_ de Vi Hart, e comece a comemorar o `dia do Tau <https://tauday.com/>`_ comendo duas vezes mais torta!

source: A floating-point positive infinity. (For negative infinity, use ``-math.inf``.) Equivalent to the output of ``float('inf')``.
pt_br: Um infinito positivo de ponto flutuante. (Para infinito negativo, use ``-math.inf``.) Equivalente à saída de ``float('inf')``.

source: A floating-point "not a number" (NaN) value. Equivalent to the output of ``float('nan')``. Due to the requirements of the `IEEE-754 standard <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` and ``float('nan')`` are not considered to equal to any other numeric value, including themselves. To check whether a number is a NaN, use the :func:`isnan` function to test for NaNs instead of ``is`` or ``==``. Example:
pt_br: Um valor de ponto flutuante "não é um número" (NaN). Equivalente à saída de ``float('nan')``. Devido aos requisitos do `padrão IEEE-754 <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` e ``float('nan')`` não são considerados para ser igual a qualquer outro valor numérico, incluindo eles próprios. Para verificar se um número é NaN, use a função :func:`isnan` para testar NaNs em vez de ``is`` ou ``==``. Exemplo:

source: It is now always available.
pt_br: Agora está sempre disponível

source: The :mod:`math` module consists mostly of thin wrappers around the platform C math library functions. Behavior in exceptional cases follows Annex F of the C99 standard where appropriate. The current implementation will raise :exc:`ValueError` for invalid operations like ``sqrt(-1.0)`` or ``log(0.0)`` (where C99 Annex F recommends signaling invalid operation or divide-by-zero), and :exc:`OverflowError` for results that overflow (for example, ``exp(1000.0)``). A NaN will not be returned from any of the functions above unless one or more of the input arguments was a NaN; in that case, most functions will return a NaN, but (again following C99 Annex F) there are some exceptions to this rule, for example ``pow(float('nan'), 0.0)`` or ``hypot(float('nan'), float('inf'))``.
pt_br: O módulo :mod:`math` consiste principalmente em invólucros finos em torno das funções da biblioteca matemática C da plataforma. O comportamento em casos excepcionais segue o Anexo F da norma C99 quando apropriado. A implementação atual levantará :exc:`ValueError` para operações inválidas como ``sqrt(-1.0)`` ou ``log(0.0)`` (onde C99 Anexo F recomenda sinalizar operação inválida ou divisão por zero), e :exc:`OverflowError` para resultados que estouram (por exemplo, ``exp(1000.0)``). Um NaN não será retornado de nenhuma das funções acima, a menos que um ou mais dos argumentos de entrada sejam um NaN; nesse caso, a maioria das funções retornará um NaN, mas (novamente seguindo C99 Anexo F) há algumas exceções a esta regra, por exemplo, ``pow(float('nan'), 0.0)`` ou ``hypot(float('nan'), float('inf'))``.

source: Note that Python makes no effort to distinguish signaling NaNs from quiet NaNs, and behavior for signaling NaNs remains unspecified. Typical behavior is to treat all NaNs as though they were quiet.
pt_br: Observe que o Python não faz nenhum esforço para distinguir NaNs de sinalização de NaNs silenciosos, e o comportamento para NaNs de sinalização permanece não especificado. O comportamento típico é tratar todos os NaNs como se estivessem quietos.

source: Module :mod:`cmath`
pt_br: Módulo :mod:`cmath`

source: Complex number versions of many of these functions.
pt_br: Versões de números complexos de muitas dessas funções.
