Repository: python/python-docs-pt-br
Catalog: library/mimetypes.po
Languages: pt_br

source: :mod:`!mimetypes` --- Map filenames to MIME types
pt_br: :mod:`!mimetypes` --- Mapeia nomes de arquivos para tipos MIME

source: **Source code:** :source:`Lib/mimetypes.py`
pt_br: **Código-fonte:** :source:`Lib/mimetypes.py`

source: The :mod:`mimetypes` module converts between a filename or URL and the MIME type associated with the filename extension. Conversions are provided from filename to MIME type and from MIME type to filename extension; encodings are not supported for the latter conversion.
pt_br: O módulo :mod:`mimetypes` converte entre um nome de arquivo ou URL e o tipo MIME associado à extensão do arquivo. As conversões são fornecidas do nome do arquivo para o tipo MIME e da extensão do tipo MIME para o nome do arquivo; codificações não são suportadas para a última conversão.

source: The module provides one class and a number of convenience functions. The functions are the normal interface to this module, but some applications may be interested in the class as well.
pt_br: O módulo fornece uma classe e várias funções convenientes. As funções são a interface normal para este módulo, mas algumas aplicações também podem estar interessadas na classe.

source: The functions described below provide the primary interface for this module. If the module has not been initialized, they will call :func:`init` if they rely on the information :func:`init` sets up.
pt_br: As funções descritas abaixo fornecem a interface principal para este módulo. Se o módulo não foi inicializado, eles chamarão :func:`init` se confiarem nas informações configuradas por :func:`init`.

source: Guess the type of a file based on its filename, path or URL, given by *url*. URL can be a string or a :term:`path-like object`.
pt_br: Adivinha o tipo de arquivo com base em seu nome de arquivo, caminho ou URL, fornecido por *url*. A URL pode ser uma string ou um :term:`objeto caminho ou similar`.

source: The return value is a tuple ``(type, encoding)`` where *type* is ``None`` if the type can't be guessed (missing or unknown suffix) or a string of the form ``'type/subtype'``, usable for a MIME :mailheader:`content-type` header.
pt_br: O valor de retorno é uma tupla ``(type, encoding)`` onde o *tipo* é ``None`` se o tipo não puder ser ser adivinhado (sufixo ausente ou desconhecido) ou uma string no formato ``'type/subtype'``, utilizável para um cabeçalho MIME :mailheader:`content-type`.

source: *encoding* is ``None`` for no encoding or the name of the program used to encode (e.g. :program:`compress` or :program:`gzip`). The encoding is suitable for use as a :mailheader:`Content-Encoding` header, **not** as a :mailheader:`Content-Transfer-Encoding` header. The mappings are table driven. Encoding suffixes are case sensitive; type suffixes are first tried case sensitively, then case insensitively.
pt_br: *encoding* é ``None`` para nenhuma codificação ou o nome do programa usado para codificar (por exemplo :program:`compress` ou :program:`gzip`). A codificação é adequada para uso como cabeçalho :mailheader:`Content-Encoding` , **não** como cabeçalho :mailheader:`Content-Transfer-Encoding`. Os mapeamentos são orientados por tabela. Os sufixos de codificação diferenciam maiúsculas de minúsculas; os sufixos de tipo são testados primeiro considerando maiúsculas e minúsculas e depois sem considerar.

source: The optional *strict* argument is a flag specifying whether the list of known MIME types is limited to only the official types `registered with IANA <https://www.iana.org/assignments/media-types/media-types.xhtml>`_. However, the behavior of this module also depends on the underlying operating system. Only file types recognized by the OS or explicitly registered with Python's internal database can be identified. When *strict* is ``True`` (the default), only the IANA types are supported; when *strict* is ``False``, some additional non-standard but commonly used MIME types are also recognized.
pt_br: O argumento opcional *strict* é um sinalizador que especifica se a lista de tipos MIME conhecidos é limitada apenas aos tipos oficiais `registrados na IANA <https://www.iana.org/assignments/media-types/media-types.xhtml>`_. No entanto, o comportamento deste módulo também depende do sistema operacional subjacente. Somente tipos de arquivo reconhecidos pelo sistema operacional ou registrados explicitamente no banco de dados interno do Python podem ser identificados. Quando *strict* é ``True`` (o padrão), apenas os tipos IANA são suportados; quando *strict* é ``False``, alguns tipos MIME adicionais não padronizados, mas geralmente usados, também são reconhecidos.

source: Added support for *url* being a :term:`path-like object`.
pt_br: Adicionado suporte para que a *url* seja um :term:`objeto caminho ou similar`.

source: Passing a file path instead of URL is :term:`soft deprecated`. Use :func:`guess_file_type` for this.
pt_br: Passar um caminho de arquivo em vez de URL está :term:`suavemente descontinuado`. Use :func:`guess_file_type` para isso.

source: Guess the type of a file based on its path, given by *path*. Similar to the :func:`guess_type` function, but accepts a path instead of URL. Path can be a string, a bytes object or a :term:`path-like object`.
pt_br: Adivinha o tipo de um arquivo com base em seu caminho, dado por *path*. Semelhante à função :func:`guess_type`, mas aceita um caminho em vez de URL. O caminho pode ser uma string, um objeto bytes ou um :term:`objeto caminho ou similar`.

source: Guess the extensions for a file based on its MIME type, given by *type*. The return value is a list of strings giving all possible filename extensions, including the leading dot (``'.'``). The extensions are not guaranteed to have been associated with any particular data stream, but would be mapped to the MIME type *type* by :func:`guess_type` and :func:`guess_file_type`.
pt_br: Adivinha as extensões para um arquivo com base em seu tipo MIME, fornecido por *type*. O valor de retorno é uma lista de strings que fornecem todas as extensões possíveis de nome de arquivo, incluindo o ponto (``'.'``). Não é garantido que as extensões tenham sido associadas a qualquer fluxo de dados específico, mas seriam mapeadas para o tipo MIME *type* por :func:`guess_type` e :func:`guess_file_type`.

source: The optional *strict* argument has the same meaning as with the :func:`guess_type` function.
pt_br: O argumento opcional *strict* tem o mesmo significado que usado com a função :func:`guess_type`.

source: Guess the extension for a file based on its MIME type, given by *type*. The return value is a string giving a filename extension, including the leading dot (``'.'``). The extension is not guaranteed to have been associated with any particular data stream, but would be mapped to the MIME type *type* by :func:`guess_type` and :func:`guess_file_type`. If no extension can be guessed for *type*, ``None`` is returned.
pt_br: Adivinha a extensão para um arquivo com base em seu tipo MIME, fornecido por *type*. O valor de retorno é uma string que fornece uma extensão de nome de arquivo, incluindo o ponto (``'.'``). Não é garantido que a extensão tenha sido associada a qualquer fluxo de dados específico, mas seria mapeada para o tipo MIME *type* por :func:`guess_type` e :func:`guess_file_type`. Se nenhuma extensão puder ser adivinhada para *type*, ``None`` é retornado.

source: Some additional functions and data items are available for controlling the behavior of the module.
pt_br: Algumas funções e dados adicionais estão disponíveis para controlar o comportamento do módulo.

source: Initialize the internal data structures. If given, *files* must be a sequence of file names which should be used to augment the default type map. If omitted, the file names to use are taken from :const:`knownfiles`; on Windows, the current registry settings are loaded. Each file named in *files* or :const:`knownfiles` takes precedence over those named before it. Calling :func:`init` repeatedly is allowed.
pt_br: Inicializa as estruturas de dados internas. Se fornecido, *files* deverá ser uma sequência de nomes de arquivos que devem ser usados para aumentar o mapa de tipos padrão. Se for omitido, os nomes de arquivos a serem usados serão retirados de :const:`knownfiles`; no Windows, as configurações atuais do registro são carregadas. Cada arquivo nomeado em *files* ou :const:`knownfiles` tem precedência sobre os definidos anteriormente. É permitido chamar :func:`init` repetidamente.

source: Specifying an empty list for *files* will prevent the system defaults from being applied: only the well-known values will be present from a built-in list.
pt_br: Especificar uma lista vazia para *files* impedirá que os padrões do sistema sejam carregados: apenas os valores bem conhecidos estarão presentes em uma lista interna.

source: If *files* is ``None`` the internal data structure is completely rebuilt to its initial default value. This is a stable operation and will produce the same results when called multiple times.
pt_br: Se *files* for ``None``, a estrutura de dados interna será completamente reconstruída com seu valor inicial padrão. Essa é uma operação estável e produzirá os mesmos resultados quando chamada várias vezes.

source: Previously, Windows registry settings were ignored.
pt_br: Anteriormente, as configurações do registro do Windows eram ignoradas.

source: Load the type map given in the file *filename*, if it exists. The type map is returned as a dictionary mapping filename extensions, including the leading dot (``'.'``), to strings of the form ``'type/subtype'``. If the file *filename* does not exist or cannot be read, ``None`` is returned.
pt_br: Carrega o mapa de tipos fornecido no arquivo *filename*, se existir. O mapa de tipos é retornado como um dicionário que faz o mapeamento de extensões de nome de arquivo, incluindo o ponto inicial (``'.'``), para strings no formato ``'tipo/subtipo'``. Se o arquivo *filename* não existir ou não puder ser lido, ``None`` é retornado.

source: Add a mapping from the MIME type *type* to the extension *ext*. When the extension is already known, the new type will replace the old one. When the type is already known the extension will be added to the list of known extensions.
pt_br: Adiciona um mapeamento do tipo MIME *type* para a extensão *ext*. Quando a extensão já for conhecida, o novo tipo substituirá o antigo. Quando o tipo já for conhecido, a extensão será adicionada à lista de extensões conhecidas.

source: When *strict* is ``True`` (the default), the mapping will be added to the official MIME types, otherwise to the non-standard ones.
pt_br: Quando *strict* for ``True`` (o padrão), o mapeamento será adicionado aos tipos MIME oficiais, caso contrário, aos não-padrão.

source: Flag indicating whether or not the global data structures have been initialized. This is set to ``True`` by :func:`init`.
pt_br: Sinalizador indicando se as estruturas de dados globais foram inicializadas ou não. Isso é definido para ``True`` por :func:`init`.

source: List of type map file names commonly installed. These files are typically named :file:`mime.types` and are installed in different locations by different packages.
pt_br: Lista de nomes de arquivos de mapas de tipos comumente instalados. Esses arquivos são normalmente nomeado como :file:`mime.types` e são instalados em diferentes locais por diferentes pacote.

source: Dictionary mapping suffixes to suffixes. This is used to allow recognition of encoded files for which the encoding and the type are indicated by the same extension. For example, the :file:`.tgz` extension is mapped to :file:`.tar.gz` to allow the encoding and type to be recognized separately.
pt_br: Dicionário mapeando sufixos para sufixos. Isso é usado para permitir o reconhecimento de arquivos codificados para os quais a codificação e o tipo são indicados pela mesma extensão. Por exemplo, em um arquivo codificado, a extensão :file:`.tgz` é mapeada para :file:`.tar.gz` para permitir que a codificação e o tipo sejam reconhecidos separadamente.

source: Dictionary mapping filename extensions to encoding types.
pt_br: Dicionário mapeando extensões de nome de arquivo para os tipos de codificação.

source: Dictionary mapping filename extensions to MIME types.
pt_br: Dicionário mapeando extensões de nome do arquivo para tipos MIME.

source: Dictionary mapping filename extensions to non-standard, but commonly found MIME types.
pt_br: Dicionário mapeando extensões de nome de arquivo para tipos MIME não padronizados, mas comumente encontrados.

source: An example usage of the module::
pt_br: Um exemplo de uso do módulo:

source: MimeTypes objects
pt_br: Objetos MimeTypes

source: The :class:`MimeTypes` class may be useful for applications which may want more than one MIME-type database; it provides an interface similar to the one of the :mod:`mimetypes` module.
pt_br: A classe :class:`MimeTypes` pode ser útil para aplicações que possam querer mais de um banco de dados de tipos MIME; ela fornece uma interface semelhante à do módulo :mod:`mimetypes`.

source: This class represents a MIME-types database. By default, it provides access to the same database as the rest of this module. The initial database is a copy of that provided by the module, and may be extended by loading additional :file:`mime.types`\ -style files into the database using the :meth:`read` or :meth:`readfp` methods. The mapping dictionaries may also be cleared before loading additional data if the default data is not desired.
pt_br: Esta classe representa um banco de dados de tipos MIME. Por padrão, ela fornece acesso ao mesmo banco de dados do restante deste módulo. O banco de dados inicial é uma cópia daquele fornecido pelo módulo e pode ser estendido ao carregar arquivos adicionais no formato :file:`mime.types` no banco de dados, usando os métodos :meth:`read` ou :meth:`readfp`. Os dicionários de mapeamento também podem ser limpos antes de carregar dados adicionais, caso os dados padrões não sejam desejados.

source: The optional *filenames* parameter can be used to cause additional files to be loaded "on top" of the default database.
pt_br: O parâmetro opcional *filenames* pode ser usado para carregar arquivos adicionais "em cima" do banco de dados padrão.

source: Dictionary mapping suffixes to suffixes. This is used to allow recognition of encoded files for which the encoding and the type are indicated by the same extension. For example, the :file:`.tgz` extension is mapped to :file:`.tar.gz` to allow the encoding and type to be recognized separately. This is initially a copy of the global :data:`suffix_map` defined in the module.
pt_br: Dicionário mapeando sufixo para sufixo. Isso é usado para permitir o reconhecimento de arquivos codificados para os quais a codificação e o tipo são indicados pela mesma extensão. Por exemplo, a extensão :file:`.tgz` é mapeada para :file:`.tar.gz` para permitir que a codificação e o tipo sejam reconhecidos separadamente. Inicialmente, isso é uma cópia do :data:`suffix_map` global definido no módulo.

source: Dictionary mapping filename extensions to encoding types. This is initially a copy of the global :data:`encodings_map` defined in the module.
pt_br: Dicionário que mapeia extensões de nomes de arquivo para tipos de codificação. Inicialmente, é uma cópia do :data:`encodings_map` global definido no módulo.

source: Load MIME information from a file named *filename*. This uses :meth:`readfp` to parse the file.
pt_br: Carrega informações do tipo MIME de um arquivo chamado *filename*. Usa :meth:`readfp` para analisar o arquivo.

source: If *strict* is ``True``, information will be added to list of standard types, else to the list of non-standard types.
pt_br: Se *strict* for ``True``, as informações serão adicionadas à lista de tipos padrão, caso contrário, à lista de tipos não padrão.

source: Load MIME type information from an open file *fp*. The file must have the format of the standard :file:`mime.types` files.
pt_br: Carrega informações do tipo MIME de um arquivo aberto *fp*. O arquivo precisa estar no formato padrão dos arquivos :file:`mime.types`.

source: If *strict* is ``True``, information will be added to the list of standard types, else to the list of non-standard types.
pt_br: Se *strict* for ``True``, as informações serão adicionadas à lista de tipos padrão, caso contrário, à lista de tipos não padrão.

source: Load MIME type information from the Windows registry.
pt_br: Carrega informações do tipo MIME a partir do registro do Windows.

source: Availability
pt_br: Disponibilidade

source: Command-line usage
pt_br: Uso na linha de comando

source: The following options are accepted:
pt_br: As seguintes opções são aceitas:

source: Show the help message and exit.
pt_br: Mostra a mensagem de ajuda e sai.

source: Command-line example
pt_br: Exemplos na linha de comando

source: file
pt_br: arquivo
