Repository: python/python-docs-pt-br
Catalog: library/mmap.po
Languages: pt_br

source: :mod:`!mmap` --- Memory-mapped file support
pt_br: :mod:`!mmap` --- Suporte a arquivos mapeados na memória

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
pt_br: このモジュールは WebAssembly プラットフォーム ``wasm32-emscripten`` と ``wasm32-wasi`` では動作しないか、利用不可です。詳しくは、:ref:`wasm-availability` を見てください。

source: Memory-mapped file objects behave like both :class:`bytearray` and like :term:`file objects <file object>`. You can use mmap objects in most places where :class:`bytearray` are expected; for example, you can use the :mod:`re` module to search through a memory-mapped file. You can also change a single byte by doing ``obj[index] = 97``, or change a subsequence by assigning to a slice: ``obj[i1:i2] = b'...'``. You can also read and write data starting at the current file position, and :meth:`seek` through the file to different positions.
pt_br: Objetos arquivo mapeados na memória se comportam como :class:`bytearray` e como :term:`objetos arquivo <file object>`. Você pode usar objetos mmap na maioria dos lugares onde :class:`bytearray` é esperado; por exemplo, você pode usar o módulo :mod:`re` para pesquisar um arquivo mapeado na memória. Você também pode alterar um único byte executando ``obj[index] = 97`` ou alterar uma subsequência atribuindo a uma fatia: ``obj[i1:i2] = b'...'``. Você também pode ler e gravar dados começando na posição atual do arquivo e :meth:`seek` através do arquivo para diferentes posições.

source: A memory-mapped file is created by the :class:`~mmap.mmap` constructor, which is different on Unix and on Windows. In either case you must provide a file descriptor for a file opened for update. If you wish to map an existing Python file object, use its :meth:`~io.IOBase.fileno` method to obtain the correct value for the *fileno* parameter. Otherwise, you can open the file using the :func:`os.open` function, which returns a file descriptor directly (the file still needs to be closed when done).
pt_br: Um arquivo mapeado na memória é criado pelo construtor :class:`~mmap.mmap`, que é diferente no Unix e no Windows. Nos dois casos, você deve fornecer um descritor de arquivo para um arquivo aberto para atualização. Se você deseja mapear um objeto arquivo Python existente, use o método :meth:`~io.IOBase.fileno` para obter o valor correto para o parâmetro *fileno*. Caso contrário, você pode abrir o arquivo usando a função :func:`os.open`, que retorna um descritor de arquivo diretamente (o arquivo ainda precisa ser fechado quando terminar).

source: If you want to create a memory-mapping for a writable, buffered file, you should :func:`~io.IOBase.flush` the file first. This is necessary to ensure that local modifications to the buffers are actually available to the mapping.
pt_br: Se você deseja criar um mapeamento de memória para um arquivo gravável e armazenado em buffer, deve usar :func:`~io.IOBase.flush` no arquivo primeiro. Isso é necessário para garantir que as modificações locais nos buffers estejam realmente disponíveis para o mapeamento.

source: For both the Unix and Windows versions of the constructor, *access* may be specified as an optional keyword parameter. *access* accepts one of four values: :const:`ACCESS_READ`, :const:`ACCESS_WRITE`, or :const:`ACCESS_COPY` to specify read-only, write-through or copy-on-write memory respectively, or :const:`ACCESS_DEFAULT` to defer to *prot*. *access* can be used on both Unix and Windows. If *access* is not specified, Windows mmap returns a write-through mapping. The initial memory values for all three access types are taken from the specified file. Assignment to an :const:`ACCESS_READ` memory map raises a :exc:`TypeError` exception. Assignment to an :const:`ACCESS_WRITE` memory map affects both memory and the underlying file. Assignment to an :const:`ACCESS_COPY` memory map affects memory but does not update the underlying file.
pt_br: Para as versões Unix e Windows do construtor, *access* pode ser especificado como um parâmetro opcional de palavra-chave. *access* aceita um dos quatro valores: :const:`ACCESS_READ`, :const:`ACCESS_WRITE` ou :const:`ACCESS_COPY` para especificar memória somente leitura, gravação ou cópia na gravação, respectivamente :const:`ACCESS_DEFAULT` para adiar para *prot*. *access* pode ser usado no Unix e no Windows. Se *access* não for especificado, o mmap do Windows retornará um mapeamento de gravação. Os valores iniciais da memória para todos os três tipos de acesso são obtidos do arquivo especificado. A atribuição a um mapa de memória :const:`ACCESS_READ` gera uma exceção :exc:`TypeError`. A atribuição a um mapa de memória :const:`ACCESS_WRITE` afeta a memória e o arquivo subjacente. A atribuição a um mapa de memória :const:`ACCESS_COPY` afeta a memória, mas não atualiza o arquivo subjacente.

source: Added :const:`ACCESS_DEFAULT` constant.
pt_br: Adicionada a constante :const:`ACCESS_DEFAULT`.

source: To map anonymous memory, -1 should be passed as the fileno along with the length.
pt_br: Para mapear a memória anônima, -1 deve ser passado como o fileno junto com o comprimento.

source: **(Windows version)** Maps *length* bytes from the file specified by the file handle *fileno*, and creates a mmap object. If *length* is larger than the current size of the file, the file is extended to contain *length* bytes. If *length* is ``0``, the maximum length of the map is the current size of the file, except that if the file is empty Windows raises an exception (you cannot create an empty mapping on Windows).
pt_br: **(Versão Windows)** Mapeia *length* bytes do arquivo especificado pelo identificador de arquivo *fileno* e cria um objeto mmap. Se *length* for maior que o tamanho atual do arquivo, o arquivo será estendido para conter *length* bytes. Se *length* for ``0``, o tamanho máximo do mapa será o tamanho atual do arquivo, exceto que, se o arquivo estiver vazio, o Windows levantará uma exceção (você não poderá criar um mapeamento vazio no Windows).

source: *tagname*, if specified and not ``None``, is a string giving a tag name for the mapping. Windows allows you to have many different mappings against the same file. If you specify the name of an existing tag, that tag is opened, otherwise a new tag of this name is created. If this parameter is omitted or ``None``, the mapping is created without a name. Avoiding the use of the *tagname* parameter will assist in keeping your code portable between Unix and Windows.
pt_br: *tagname*, se especificado e não ``None``, é uma string que fornece um nome de tag para o mapeamento. O Windows permite que você tenha muitos mapeamentos diferentes no mesmo arquivo. Se você especificar o nome de uma marca existente, essa marca será aberta; caso contrário, uma nova marca com esse nome será criada. Se este parâmetro for omitido ou ``None``, o mapeamento será criado sem um nome. Evitar o uso do parâmetro *tagname* ajudará a manter seu código portátil entre o Unix e o Windows.

source: *offset* may be specified as a non-negative integer offset. mmap references will be relative to the offset from the beginning of the file. *offset* defaults to 0. *offset* must be a multiple of the :const:`ALLOCATIONGRANULARITY`.
pt_br: *offset* pode ser especificado como um deslocamento inteiro não negativo. As referências mmap serão relativas ao deslocamento do início do arquivo. *offset* tem como padrão 0. *offset* deve ser um múltiplo de :const:`ALLOCATIONGRANULARITY`.

source: Raises an :ref:`auditing event <auditing>` ``mmap.__new__`` with arguments ``fileno``, ``length``, ``access``, ``offset``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``mmap.__new__`` com os argumentos ``fileno``, ``length``, ``access``, ``offset``.

source: **(Unix version)** Maps *length* bytes from the file specified by the file descriptor *fileno*, and returns a mmap object. If *length* is ``0``, the maximum length of the map will be the current size of the file when :class:`~mmap.mmap` is called.
pt_br: **(Versão Unix)** Mapeia *length* bytes do arquivo especificado pelo descritor de arquivo *fileno* e retorna um objeto mmap. Se *length* for ``0``, o comprimento máximo do mapa será o tamanho atual do arquivo quando :class:`~mmap.mmap` for chamado.

source: *flags* specifies the nature of the mapping. :const:`MAP_PRIVATE` creates a private copy-on-write mapping, so changes to the contents of the mmap object will be private to this process, and :const:`MAP_SHARED` creates a mapping that's shared with all other processes mapping the same areas of the file. The default value is :const:`MAP_SHARED`. Some systems have additional possible flags with the full list specified in :ref:`MAP_* constants <map-constants>`.
pt_br: *flags* especifica a natureza do mapeamento. :const:`MAP_PRIVATE` cria um mapeamento privado de cópia na gravação, de modo que alterações no conteúdo do objeto mmap serão privadas para este processo, e :const:`MAP_SHARED` cria um mapeamento compartilhado com todos os outros processos que mapeiam as mesmas áreas do arquivo. O valor padrão é :const:`MAP_SHARED`. Alguns sistemas têm sinalizadores adicionais possíveis, com a lista completa especificada em :ref:`constantes MAP_* <map-constants>`.

source: *prot*, if specified, gives the desired memory protection; the two most useful values are :const:`PROT_READ` and :const:`PROT_WRITE`, to specify that the pages may be read or written. *prot* defaults to :const:`PROT_READ \| PROT_WRITE`.
pt_br: *prot*, se especificado, fornece a proteção de memória desejada; os dois valores mais úteis são :const:`PROT_READ` e :const:`PROT_WRITE`, para especificar que as páginas podem ser lidas ou gravadas. *prot* tem como padrão :const:`PROT_READ \| PROT_WRITE`.

source: *access* may be specified in lieu of *flags* and *prot* as an optional keyword parameter. It is an error to specify both *flags*, *prot* and *access*. See the description of *access* above for information on how to use this parameter.
pt_br: *access* pode ser especificado em vez de *flags* e *prot* como um parâmetro nomeado opcional. É um erro especificar *flags*, *prot* e *access*. Consulte a descrição de *access* acima para obter informações sobre como usar este parâmetro.

source: *offset* may be specified as a non-negative integer offset. mmap references will be relative to the offset from the beginning of the file. *offset* defaults to 0. *offset* must be a multiple of :const:`ALLOCATIONGRANULARITY` which is equal to :const:`PAGESIZE` on Unix systems.
pt_br: *offset* pode ser especificado como um deslocamento inteiro não negativo. As referências mmap serão relativas ao deslocamento do início do arquivo. *offset* tem como padrão 0. *offset* deve ser um múltiplo de :const:`ALLOCATIONGRANULARITY`, que é igual a :const:`PAGESIZE` em sistemas Unix.

source: To ensure validity of the created memory mapping the file specified by the descriptor *fileno* is internally automatically synchronized with the physical backing store on macOS.
pt_br: Para garantir a validade do mapeamento de memória criado, o arquivo especificado pelo descritor *fileno* é sincronizado internamente de forma automática com o armazenamento de suporte físico no macOS.

source: This example shows a simple way of using :class:`~mmap.mmap`::
pt_br: У цьому прикладі показано простий спосіб використання :class:`~mmap.mmap`::

source: :class:`~mmap.mmap` can also be used as a context manager in a :keyword:`with` statement::
pt_br: :class:`~mmap.mmap` також можна використовувати як менеджер контексту в операторі :keyword:`with`::

source: Context manager support.
pt_br: Suporte a gerenciador de contexto.

source: The next example demonstrates how to create an anonymous map and exchange data between the parent and child processes::
pt_br: Наступний приклад демонструє, як створити анонімне відображення(мапінг) та обмінюватися даними між батьківським і дочірнім процесами:

source: Memory-mapped file objects support the following methods:
pt_br: Файлові об’єкти, відображені в пам’яті, підтримують такі методи:

source: Closes the mmap. Subsequent calls to other methods of the object will result in a ValueError exception being raised. This will not close the open file.
pt_br: Закриває mmap. Подальші виклики інших методів об’єкта призведуть до виникнення винятку ValueError. Це не закриє відкритий файл.

source: ``True`` if the file is closed.
pt_br: ``True``, якщо файл закрито.

source: Returns the lowest index in the object where the subsequence *sub* is found, such that *sub* is contained in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation. Returns ``-1`` on failure.
pt_br: Повертає найменший індекс в об’єкті, де знайдено підпослідовність *sub*, так що *sub* міститься в діапазоні [*start*, *end*]. Необов’язкові аргументи *start* і *end* інтерпретуються як у slice нотації (нотації зрізів). Повертає ``-1`` у разі помилки.

source: Writable :term:`bytes-like object` is now accepted.
pt_br: Записуваний :term:`bytes-like object` тепер приймається.

source: Flushes changes made to the in-memory copy of a file back to disk. Without use of this call there is no guarantee that changes are written back before the object is destroyed. If *offset* and *size* are specified, only changes to the given range of bytes will be flushed to disk; otherwise, the whole extent of the mapping is flushed. *offset* must be a multiple of the :const:`PAGESIZE` or :const:`ALLOCATIONGRANULARITY`.
pt_br: Скидає зміни, внесені до копії файлу в пам’яті, назад на диск. Без використання цього виклику немає гарантії, що зміни будуть записані назад до того, як об’єкт буде знищено. Якщо вказано *offset* і *size*, на диск буде скинуто лише зміни в заданому діапазоні байтів; інакше весь контент відображення скидається. *offset* має бути кратним :const:`PAGESIZE` або :const:`ALLOCATIONGRANULARITY`.

source: ``None`` is returned to indicate success. An exception is raised when the call failed.
pt_br: ``None`` повертається, щоб вказати успішний результат. У разі невдачі виклику виникає виняток.

source: Previously, a nonzero value was returned on success; zero was returned on error under Windows. A zero value was returned on success; an exception was raised on error under Unix.
pt_br: Раніше в разі успіху поверталося ненульове значення; нуль повертався на помилку у Windows. У разі успіху поверталось нульове значення; виняток викликався на помилку під Unix.

source: Send advice *option* to the kernel about the memory region beginning at *start* and extending *length* bytes. *option* must be one of the :ref:`MADV_* constants <madvise-constants>` available on the system. If *start* and *length* are omitted, the entire mapping is spanned. On some systems (including Linux), *start* must be a multiple of the :const:`PAGESIZE`.
pt_br: Надіслати пораду *option* ядру щодо області пам’яті, яка починається з *start* і має довжину *length*. *option* має бути однією з констант :ref:`MADV_* <madvise-constants>`, доступних у системі. Якщо *start* і *end* опущені, охоплюється все відображення. У деяких системах (включаючи Linux) *start* має бути кратним :const:`PAGESIZE`.

source: Availability: Systems with the ``madvise()`` system call.
pt_br: Доступність: системи з системним викликом ``madvise()``.

source: Copy the *count* bytes starting at offset *src* to the destination index *dest*. If the mmap was created with :const:`ACCESS_READ`, then calls to move will raise a :exc:`TypeError` exception.
pt_br: Копіювання *count* байтів, починаючи із зміщення *src*, до індексу призначення *dest*. Якщо mmap було створено за допомогою :const:`ACCESS_READ`, тоді виклик переміщення призведе до винятку :exc:`TypeError`.

source: Return a :class:`bytes` containing up to *n* bytes starting from the current file position. If the argument is omitted, ``None`` or negative, return all bytes from the current file position to the end of the mapping. The file position is updated to point after the bytes that were returned.
pt_br: Повертає :class:`bytes`, що містить до *n* байтів, починаючи з поточної позиції файлу. Якщо аргумент пропущений, ``None`` або негативний, повертаються всі байти від поточної позиції файлу до кінця відображення. Позиція файлу оновлюється, щоб вказувати одразу після байтів, які були повернуті.

source: Argument can be omitted or ``None``.
pt_br: Аргумент можна опустити або бути ``None``.

source: Returns a byte at the current file position as an integer, and advances the file position by 1.
pt_br: Повертає байт у поточній позиції файлу як ціле число integer та переміщує позицію у файлі на 1.

source: Returns a single line, starting at the current file position and up to the next newline. The file position is updated to point after the bytes that were returned.
pt_br: Повертає один рядок, починаючи з поточної позиції файлу й до наступного нового рядка. Позиція файлу оновлюється, щоб вказувати після байтів, які були повернуті.

source: **On Windows**: Resizing the map will raise an :exc:`OSError` if there are other maps against the same named file. Resizing an anonymous map (ie against the pagefile) will silently create a new map with the original data copied over up to the length of the new size.
pt_br: **В Windows**: изменение размера карты вызовет ошибку :exc:`OSError`, если существуют другие карты для файла с тем же именем. Изменение размера анонимной карты (т. е. относительно файла подкачки) автоматически создаст новую карту с скопированными исходными данными до длины нового размера.

source: Correctly fails if attempting to resize when another map is held Allows resize against an anonymous map on Windows
pt_br: Исправлена ​​ошибка при попытке изменить размер, когда удерживается другая карта. Позволяет изменять размер анонимной карты в Windows.

source: Returns the highest index in the object where the subsequence *sub* is found, such that *sub* is contained in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation. Returns ``-1`` on failure.
pt_br: Повертає останній індекс в об’єкті, де знайдено підпослідовність *sub*, так що *sub* міститься в діапазоні [*start*, *end*]. Необов’язкові аргументи *start* та *end* інтерпретуються як у нотації зрізів (slice нотація). Повертає ``-1`` у разі помилки.

source: Set the file's current position. *whence* argument is optional and defaults to ``os.SEEK_SET`` or ``0`` (absolute file positioning); other values are ``os.SEEK_CUR`` or ``1`` (seek relative to the current position) and ``os.SEEK_END`` or ``2`` (seek relative to the file's end).
pt_br: Встановлює поточну позицію в файлі. Аргумент *whence* є необов’язковим і за замовчуванням має значення ``os.SEEK_SET`` або ``0`` (абсолютне розташування файлу); іншими значеннями є ``os.SEEK_CUR`` або ``1`` (пошук відносно поточної позиції) і ``os.SEEK_END`` або ``2`` (пошук відносно кінця файлу).

source: Return the length of the file, which can be larger than the size of the memory-mapped area.
pt_br: Повертає довжину файлу, яка може перевищувати розмір відображеної області пам’яті.

source: Returns the current position of the file pointer.
pt_br: Повертає поточну позицію покажчика файлу.

source: Write the bytes in *bytes* into memory at the current position of the file pointer and return the number of bytes written (never less than ``len(bytes)``, since if the write fails, a :exc:`ValueError` will be raised). The file position is updated to point after the bytes that were written. If the mmap was created with :const:`ACCESS_READ`, then writing to it will raise a :exc:`TypeError` exception.
pt_br: Записує байти в *bytes* у пам’ять у поточній позиції вказівника файлу та повертає кількість записаних байтів (ніколи не менше ніж ``len(bytes)``, але якщо запис не вдається то це призведе до винятку :exc:`ValueError` ). Позиція файлу оновлюється, щоб вказувати після записаних байтів. Якщо mmap було створено за допомогою :const:`ACCESS_READ`, то запис у нього призведе до виключення :exc:`TypeError`.

source: The number of bytes written is now returned.
pt_br: Додано повернення кількості записаних байтів.

source: Write the integer *byte* into memory at the current position of the file pointer; the file position is advanced by ``1``. If the mmap was created with :const:`ACCESS_READ`, then writing to it will raise a :exc:`TypeError` exception.
pt_br: Записує ціле *byte* у пам'ять у поточній позиції покажчика файлу; позиція файлу просувається вперед на ``1``. Якщо mmap було створено за допомогою :const:`ACCESS_READ`, то запис у нього призведе до виключення :exc:`TypeError`.

source: MADV_* Constants
pt_br: Constantes MADV_*

source: These options can be passed to :meth:`mmap.madvise`. Not every option will be present on every system.
pt_br: Ці параметри можна передати в :meth:`mmap.madvise`. Не кожен параметр буде присутній у кожній системі.

source: Availability: Systems with the madvise() system call.
pt_br: Доступність: системи з системним викликом madvise().

source: MAP_* Constants
pt_br: Constantes MAP_*

source: These are the various flags that can be passed to :meth:`mmap.mmap`. :data:`MAP_ALIGNED_SUPER` is only available at FreeBSD and :data:`MAP_CONCEAL` is only available at OpenBSD. Note that some options might not be present on some systems.
pt_br: Это различные флаги, которые можно передать в :meth:`mmap.mmap`. :data:`MAP_ALIGNED_SUPER` доступен только во FreeBSD, а :data:`MAP_CONCEAL` доступен только в OpenBSD. Обратите внимание, что некоторые параметры могут отсутствовать в некоторых системах.

source: Added :data:`MAP_POPULATE` constant.
pt_br: Добавлена ​​константа :data:`MAP_POPULATE`.

source: Added :data:`MAP_STACK` constant.
pt_br: Добавлена ​​константа :data:`MAP_STACK`.
