Repository: python/python-docs-pt-br
Catalog: library/modulefinder.po
Languages: pt_br

source: :mod:`!modulefinder` --- Find modules used by a script
pt_br: :mod:`!modulefinder` --- Procura módulos usados por um script

source: **Source code:** :source:`Lib/modulefinder.py`
pt_br: **Código-fonte:** :source:`Lib/modulefinder.py`

source: This module provides a :class:`ModuleFinder` class that can be used to determine the set of modules imported by a script. ``modulefinder.py`` can also be run as a script, giving the filename of a Python script as its argument, after which a report of the imported modules will be printed.
pt_br: Este módulo fornece uma classe :class:`ModuleFinder` que pode ser usada para determinar o conjunto de módulos importados por um script. O ``modulefinder.py`` também pode ser executado como um script, fornecendo o nome do arquivo de um script Python como seu argumento, após o qual um relatório dos módulos importados será impresso.

source: Record that the package named *pkg_name* can be found in the specified *path*.
pt_br: Registra que o pacote chamado *pkg_name* pode ser encontrado no caminho especificado em *path*

source: Allows specifying that the module named *oldname* is in fact the package named *newname*.
pt_br: Permite especificar que o módulo chamado *oldname* é de fato o pacote chamado *newname*.

source: This class provides :meth:`run_script` and :meth:`report` methods to determine the set of modules imported by a script. *path* can be a list of directories to search for modules; if not specified, ``sys.path`` is used. *debug* sets the debugging level; higher values make the class print debugging messages about what it's doing. *excludes* is a list of module names to exclude from the analysis. *replace_paths* is a list of ``(oldpath, newpath)`` tuples that will be replaced in module paths.
pt_br: Esta classe fornece os métodos :meth:`run_script` e :meth:`report` para determinar o conjunto de módulos importados por um script. *path* pode ser uma lista de diretórios para procurar por módulos; se não especificado, ``sys.path`` é usado. *debug* define o nível de depuração; valores mais altos fazem a classe imprimir mensagens de depuração sobre o que está fazendo. *excludes* é uma lista de nomes de módulos a serem excluídos da análise. *replace_paths* é uma lista de tuplas ``(oldpath, newpath)`` que serão substituídas nos caminhos dos módulos.

source: Print a report to standard output that lists the modules imported by the script and their paths, as well as modules that are missing or seem to be missing.
pt_br: Imprime um relatório na saída padrão que lista os módulos importados pelo script e seus caminhos, bem como os módulos que estão faltando ou parecem estar ausentes.

source: Analyze the contents of the *pathname* file, which must contain Python code.
pt_br: Analisa o conteúdo do arquivo *pathname*, que deve conter o código Python.

source: A dictionary mapping module names to modules. See :ref:`modulefinder-example`.
pt_br: Um nome de módulo de mapeamento de dicionário para módulos. Veja :ref:`modulefinder-example`.

source: Example usage of :class:`ModuleFinder`
pt_br: Exemplo de uso de :class:`ModuleFinder`

source: The script that is going to get analyzed later on (bacon.py)::
pt_br: O script que será analisado posteriormente (bacon.py)::

source: The script that will output the report of bacon.py::
pt_br: O script que irá gerar o relatório de bacon.py::

source: Sample output (may vary depending on the architecture)::
pt_br: Exemplo de saída (pode variar dependendo da arquitetura)::
