Repository: python/python-docs-pt-br
Catalog: library/msvcrt.po
Languages: pt_br

source: :mod:`!msvcrt` --- Useful routines from the MS VC++ runtime
pt_br: :mod:`!msvcrt` --- Rotinas úteis do runtime MS VC++

source: These functions provide access to some useful capabilities on Windows platforms. Some higher-level modules use these functions to build the Windows implementations of their services. For example, the :mod:`getpass` module uses this in the implementation of the :func:`getpass` function.
pt_br: Essas funções fornecem acesso a alguns recursos úteis em plataformas Windows. Alguns módulos de nível superior usam essas funções para construir as implementações de seus serviços no Windows. Por exemplo, o módulo :mod:`getpass` usa isso na implementação da função :func:`getpass`.

source: Further documentation on these functions can be found in the Platform API documentation.
pt_br: Mais documentação sobre essas funções pode ser encontrada na documentação da API da plataforma.

source: The module implements both the normal and wide char variants of the console I/O api. The normal API deals only with ASCII characters and is of limited use for internationalized applications. The wide char API should be used where ever possible.
pt_br: O módulo implementa as variantes normal e ampla de caracteres da API de E/S do console. A API normal lida apenas com caracteres ASCII e é de uso limitado para aplicativos internacionalizados. A API ampla de caracteres deve ser usada sempre que possível.

source: Availability
pt_br: Disponibilidade

source: Operations in this module now raise :exc:`OSError` where :exc:`IOError` was raised.
pt_br: As operações neste módulo agora levantam :exc:`OSError` onde :exc:`IOError` foi levantado.

source: File Operations
pt_br: Operações com arquivos

source: Lock part of a file based on file descriptor *fd* from the C runtime. Raises :exc:`OSError` on failure. The locked region of the file extends from the current file position for *nbytes* bytes, and may continue beyond the end of the file. *mode* must be one of the :const:`!LK_\*` constants listed below. Multiple regions in a file may be locked at the same time, but may not overlap. Adjacent regions are not merged; they must be unlocked individually.
pt_br: Trava parte de um arquivo com base no descritor de arquivo *fd* do runtime do C. Levanta :exc:`OSError` em caso de falha. A região travada do arquivo se estende da posição atual do arquivo por *nbytes* bytes e pode continuar além do final do arquivo. *mode* deve ser uma das constantes :const:`!LK_\*` listadas abaixo. Várias regiões em um arquivo podem ser travadas ao mesmo tempo, mas não podem se sobrepor. Regiões adjacentes não são mescladas; elas devem ser destravadas individualmente.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.locking`` with arguments ``fd``, ``mode``, ``nbytes``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``msvcrt.locking`` com os argumentos ``fd``, ``mode``, ``nbytes``.

source: Locks the specified bytes. If the bytes cannot be locked, the program immediately tries again after 1 second. If, after 10 attempts, the bytes cannot be locked, :exc:`OSError` is raised.
pt_br: Trava os bytes especificados. Se os bytes não puderem ser travados, o programa tenta novamente imediatamente após 1 segundo. Se, após 10 tentativas, os bytes não puderem ser travados, :exc:`OSError` é levantada.

source: Locks the specified bytes. If the bytes cannot be locked, :exc:`OSError` is raised.
pt_br: Trava os bytes especificados. Se os bytes não puderem ser travados, uma exceção :exc:`OSError` é levantada.

source: Unlocks the specified bytes, which must have been previously locked.
pt_br: Destrava os bytes especificados, que devem ter sido travados anteriormente.

source: Set the line-end translation mode for the file descriptor *fd*. To set it to text mode, *flags* should be :const:`os.O_TEXT`; for binary, it should be :const:`os.O_BINARY`.
pt_br: Defina o modo de conversão de final de linha para o descritor de arquivo *fd*. Para configurá-lo no modo de texto, *flags* deve ser :const:`os.O_TEXT`; para binário, deve ser :const:`os.O_BINARY`.

source: Create a C runtime file descriptor from the file handle *handle*. The *flags* parameter should be a bitwise OR of :const:`os.O_APPEND`, :const:`os.O_RDONLY`, :const:`os.O_TEXT` and :const:`os.O_NOINHERIT`. The returned file descriptor may be used as a parameter to :func:`os.fdopen` to create a file object.
pt_br: Crie um descritor de arquivo de tempo de execução do C a partir do identificador de arquivo *handle*. O parâmetro *flags* deve ser um OU bit a bit de :const:`os.O_APPEND`, :const:`os.O_RDONLY`, :const:`os.O_TEXT` e :const:`os.O_NOINHERIT`. O descritor de arquivo retornado pode ser usado como parâmetro para :func:`os.fdopen` para criar um objeto de arquivo.

source: The file descriptor is inheritable by default. Pass :const:`os.O_NOINHERIT` flag to make it non inheritable.
pt_br: O descritor de arquivo é herdável por padrão. Passe o sinalizador :const:`os.O_NOINHERIT` para torná-lo não herdável.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.open_osfhandle`` with arguments ``handle``, ``flags``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``msvcrt.open_osfhandle`` com os argumentos ``handle``, ``flags``.

source: Return the file handle for the file descriptor *fd*. Raises :exc:`OSError` if *fd* is not recognized.
pt_br: Retorna o identificador de arquivo para o descritor de arquivo *fd*. Levanta :exc:`OSError` se *fd* não for reconhecido.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.get_osfhandle`` with argument ``fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``msvcrt.get_osfhandle`` com o argumento ``fd``.

source: Console I/O
pt_br: E/S de console

source: Wide char variant of :func:`getch`, returning a Unicode value.
pt_br: Variante com caractere largo de :func:`getch`, retornando um valor Unicode.

source: Wide char variant of :func:`getche`, returning a Unicode value.
pt_br: Variante com caractere largo de :func:`getche`, retornando um valor Unicode.

source: Print the byte string *char* to the console without buffering.
pt_br: Imprime a string de bytes *char* no console sem armazenar em buffer.

source: Wide char variant of :func:`putch`, accepting a Unicode value.
pt_br: Variante com caractere largo de :func:`putch`, retornando um valor Unicode.

source: Cause the byte string *char* to be "pushed back" into the console buffer; it will be the next character read by :func:`getch` or :func:`getche`.
pt_br: Faz com que a string de bytes *char* seja "empurrada" para o buffer do console; será o próximo caractere lido por :func:`getch` ou :func:`getche`.

source: Wide char variant of :func:`ungetch`, accepting a Unicode value.
pt_br: Variante com caractere largo de :func:`ungetch`, retornando um valor Unicode.

source: Other Functions
pt_br: Outras funções

source: Force the :c:func:`malloc` heap to clean itself up and return unused blocks to the operating system. On failure, this raises :exc:`OSError`.
pt_br: Força o heap :c:func:`malloc` a ser limpado e retorna os blocos não utilizados ao sistema operacional. Em caso de falha, isso levanta :exc:`OSError`.

source: The CRT Assembly version, from the :file:`crtassem.h` header file.
pt_br: A versão do CRT Assembly, do arquivo de cabeçalho :file:`crtassem.h`.

source: The VC Assembly public key token, from the :file:`crtassem.h` header file.
pt_br: O token da chave pública do VC Assembly, do arquivo de cabeçalho :file:`crtassem.h`.

source: The Libraries Assembly name prefix, from the :file:`crtassem.h` header file.
pt_br: O prefixo do nome de Libraries Assembly, do arquivo de cabeçalho :file:`crtassem.h`.
