Repository: python/python-docs-pt-br
Catalog: library/multiprocessing.shared_memory.po
Languages: pt_br

source: :mod:`!multiprocessing.shared_memory` --- Shared memory for direct access across processes
pt_br: :mod:`!multiprocessing.shared_memory` --- Memória compartilhada para acesso direto entre processos

source: **Source code:** :source:`Lib/multiprocessing/shared_memory.py`
pt_br: **Código-fonte:** :source:`Lib/multiprocessing/shared_memory.py`

source: This module provides a class, :class:`SharedMemory`, for the allocation and management of shared memory to be accessed by one or more processes on a multicore or symmetric multiprocessor (SMP) machine. To assist with the life-cycle management of shared memory especially across distinct processes, a :class:`~multiprocessing.managers.BaseManager` subclass, :class:`~multiprocessing.managers.SharedMemoryManager`, is also provided in the :mod:`multiprocessing.managers` module.
pt_br: Este módulo fornece uma classe, :class:`SharedMemory`, para a alocação e gerenciamento da memória compartilhada a ser acessada por um ou mais processos em uma máquina multicore ou de multiprocessamento simétrico (SMP). Para ajudar com o gerenciamento do ciclo de vida da memória compartilhada especialmente entre processos distintos, uma subclasse de :class:`~multiprocessing.managers.BaseManager`, :class:`~multiprocessing.managers.SharedMemoryManager`, também é fornecida no módulo :mod:`multiprocessing.managers`.

source: In this module, shared memory refers to "POSIX style" shared memory blocks (though is not necessarily implemented explicitly as such) and does not refer to "distributed shared memory". This style of shared memory permits distinct processes to potentially read and write to a common (or shared) region of volatile memory. Processes are conventionally limited to only have access to their own process memory space but shared memory permits the sharing of data between processes, avoiding the need to instead send messages between processes containing that data. Sharing data directly via memory can provide significant performance benefits compared to sharing data via disk or socket or other communications requiring the serialization/deserialization and copying of data.
pt_br: Neste módulo, memória compartilhada refere-se a blocos de memória compartilhada no "estilo POSIX" (embora não seja necessariamente implementado explicitamente como tal) e não se refere a "memória compartilhada distribuída". Este estilo de memória compartilhada permite que processos distintos potencialmente leiam e escrevam em uma região comum (ou compartilhada) de memória volátil. Os processos são convencionalmente limitados a ter acesso somente ao próprio espaço de memória de processo mas a memória compartilhada permite o compartilhamento de dados entre processos, evitando a necessidade de enviar mensagens entre processos contendo estes dados. Compartilhar dados diretamente via memória pode fornecer ganhos de desempenho significativos comparado ao compartilhamento de dados via disco ou soquete ou outras comunicações que requerem a serialização/desserialização e cópia dos dados.

source: Create an instance of the :class:`!SharedMemory` class for either creating a new shared memory block or attaching to an existing shared memory block. Each shared memory block is assigned a unique name. In this way, one process can create a shared memory block with a particular name and a different process can attach to that same shared memory block using that same name.
pt_br: Cria uma instância da classe :class:`!SharedMemory` para criar um novo bloco de memória compartilhada ou anexar a um bloco de memória compartilhada existente. A cada bloco de memória compartilhada é atribuído um nome único. Desta forma, um processo pode criar um bloco de memória compartilhada com um nome particular e um processo diferente pode ser anexado a esse mesmo bloco de memória compartilhada usando este mesmo nome.

source: As a resource for sharing data across processes, shared memory blocks may outlive the original process that created them. When one process no longer needs access to a shared memory block that might still be needed by other processes, the :meth:`close` method should be called. When a shared memory block is no longer needed by any process, the :meth:`unlink` method should be called to ensure proper cleanup.
pt_br: Como um recurso para compartilhar dados entre processos, os blocos de memória compartilhada podem sobreviver ao processo original que os criou. Quando um processo não precisa mais acessar um bloco de memória compartilhada que ainda pode ser necessário para outros processos, o método :meth:`close` deve ser chamado. Quando um bloco de memória compartilhada não é mais necessário para nenhum processo, o método :meth:`unlink` deve ser chamado para garantir a limpeza apropriada.

source: Parameters
pt_br: Parâmetros

source: The unique name for the requested shared memory, specified as a string. When creating a new shared memory block, if ``None`` (the default) is supplied for the name, a novel name will be generated.
pt_br: O nome único para a memória compartilhada requisitada, especificado como uma string. Ao criar um novo bloco de memória compartilhada, se ``None`` (o padrão) é fornecido para o nome, um novo nome será gerado.

source: Control whether a new shared memory block is created (``True``) or an existing shared memory block is attached (``False``).
pt_br: Controla quando um novo bloco de memória compartilhada é criado (``True``) ou um bloco de memória compartilhada existente é anexado (``False``).

source: The requested number of bytes when creating a new shared memory block. Because some platforms choose to allocate chunks of memory based upon that platform's memory page size, the exact size of the shared memory block may be larger or equal to the size requested. When attaching to an existing shared memory block, the *size* parameter is ignored.
pt_br: O número de bytes requeridos ao criar um novo bloco de memória compartilhada. Como algumas plataformas optam por alocar pedaços de memória com base no tamanho da página de memória da própria plataforma, o tamanho exato do bloco de memória compartilhada pode ser maior ou igual ao tamanho requerido. Ao anexar a um bloco de memória compartilhada existente, o parâmetro *size* é ignorado.

source: When ``True``, register the shared memory block with a resource tracker process on platforms where the OS does not do this automatically. The resource tracker ensures proper cleanup of the shared memory even if all other processes with access to the memory exit without doing so. Python processes created from a common ancestor using :mod:`multiprocessing` facilities share a single resource tracker process, and the lifetime of shared memory segments is handled automatically among these processes. Python processes created in any other way will receive their own resource tracker when accessing shared memory with *track* enabled. This will cause the shared memory to be deleted by the resource tracker of the first process that terminates. To avoid this issue, users of :mod:`subprocess` or standalone Python processes should set *track* to ``False`` when there is already another process in place that does the bookkeeping. *track* is ignored on Windows, which has its own tracking and automatically deletes shared memory when all handles to it have been closed.
pt_br: Quando ``True``, registra o bloco de memória compartilhada com um processo de rastreador de recursos em plataformas onde o sistema operacional não faz isso automaticamente. O rastreador de recursos garante a limpeza adequada da memória compartilhada, mesmo se todos os outros processos com acesso à memória saírem sem fazer isso. Os processos Python criados a partir de um ancestral comum usando os recursos de :mod:`multiprocessing` compartilham um único processo de rastreador de recursos, e o tempo de vida dos segmentos de memória compartilhada é manipulado automaticamente entre esses processos. Os processos Python criados de qualquer outra forma receberão seu próprio rastreador de recursos ao acessar a memória compartilhada com *track* habilitado. Isso fará com que a memória compartilhada seja excluída pelo rastreador de recursos do primeiro processo que terminar. Para evitar esse problema, os usuários de :mod:`subprocess` ou processos Python autônomos devem definir *track* como ``False`` quando já houver outro processo em vigor que faça a contabilidade. *track* é ignorado no Windows, que tem seu próprio rastreamento e exclui automaticamente a memória compartilhada quando todos os identificadores para ele foram fechados.

source: Added the *track* parameter.
pt_br: Adicionado o parâmetro *track*.

source: Close the file descriptor/handle to the shared memory from this instance. :meth:`close` should be called once access to the shared memory block from this instance is no longer needed. Depending on operating system, the underlying memory may or may not be freed even if all handles to it have been closed. To ensure proper cleanup, use the :meth:`unlink` method.
pt_br: Fecha o identificador/descritor de arquivo para a memória compartilhada desta instância. :meth:`close` deve ser chamado quando o acesso ao bloco de memória compartilhada desta instância não for mais necessário. Dependendo do sistema operacional, a memória subjacente pode ou não ser liberada, mesmo que todos os identificadores para ela tenham sido fechados. Para garantir uma limpeza adequada, use o método :meth:`unlink`.

source: Delete the underlying shared memory block. This should be called only once per shared memory block regardless of the number of handles to it, even in other processes. :meth:`unlink` and :meth:`close` can be called in any order, but trying to access data inside a shared memory block after :meth:`unlink` may result in memory access errors, depending on platform.
pt_br: Exclui o bloco de memória compartilhada subjacente. Isso deve ser chamado apenas uma vez por bloco de memória compartilhada, independentemente do número de handles para ele, mesmo em outros processos. :meth:`unlink` e :meth:`close` podem ser chamados em qualquer ordem, mas tentar acessar dados dentro de um bloco de memória compartilhada após :meth:`unlink` pode resultar em erros de acesso à memória, dependendo da plataforma.

source: This method has no effect on Windows, where the only way to delete a shared memory block is to close all handles.
pt_br: Este método não tem efeito no Windows, onde a única maneira de excluir um bloco de memória compartilhada é fechar todos os identificadores.

source: A memoryview of contents of the shared memory block.
pt_br: Uma visualização de memória do conteúdo do bloco de memória compartilhada.

source: Read-only access to the unique name of the shared memory block.
pt_br: Acesso somente leitura ao nome único do bloco de memória compartilhada.

source: Read-only access to size in bytes of the shared memory block.
pt_br: Acesso somente leitura ao tamanho em bytes do bloco de memória compartilhada.

source: The following example demonstrates low-level use of :class:`SharedMemory` instances::
pt_br: O exemplo a seguir demonstra um uso baixo nível de instâncias de :class:`SharedMemory`::

source: >>> from multiprocessing import shared_memory >>> shm_a = shared_memory.SharedMemory(create=True, size=10) >>> type(shm_a.buf) <class 'memoryview'> >>> buffer = shm_a.buf >>> len(buffer) 10 >>> buffer[:4] = bytearray([22, 33, 44, 55]) # Modify multiple at once >>> buffer[4] = 100 # Modify single byte at a time >>> # Attach to an existing shared memory block >>> shm_b = shared_memory.SharedMemory(shm_a.name) >>> import array >>> array.array('b', shm_b.buf[:5]) # Copy the data into a new array.array array('b', [22, 33, 44, 55, 100]) >>> shm_b.buf[:5] = b'howdy' # Modify via shm_b using bytes >>> bytes(shm_a.buf[:5]) # Access via shm_a b'howdy' >>> shm_b.close() # Close each SharedMemory instance >>> shm_a.close() >>> shm_a.unlink() # Call unlink only once to release the shared memory
pt_br: >>> from multiprocessing import shared_memory >>> shm_a = shared_memory.SharedMemory(create=True, size=10) >>> type(shm_a.buf) <class 'memoryview'> >>> buffer = shm_a.buf >>> len(buffer) 10 >>> buffer[:4] = bytearray([22, 33, 44, 55]) # Modifica vários de uma só vez >>> buffer[4] = 100 # Modifica um único byte de cada vez >>> # Anexa a um bloco de memória compartilhada existente >>> shm_b = shared_memory.SharedMemory(shm_a.name) >>> import array >>> array.array('b', shm_b.buf[:5]) # Copia os dados para um novo array.array array('b', [22, 33, 44, 55, 100]) >>> shm_b.buf[:5] = b'howdy' # Modifica via shm_b usando bytes >>> bytes(shm_a.buf[:5]) # Acessa via shm_a b'howdy' >>> shm_b.close() # Fecha cada instância de SharedMemory >>> shm_a.close() >>> shm_a.unlink() # Chama unlink uma vez para liberar a memória Compartilhada

source: The following example demonstrates a practical use of the :class:`SharedMemory` class with `NumPy arrays <https://numpy.org/>`_, accessing the same :class:`!numpy.ndarray` from two distinct Python shells:
pt_br: O exemplo a seguir demonstra um uso prático da classe :class:`SharedMemory` com `arrays do NumPy <https://numpy.org/>`_, acessando o mesmo :class:`!numpy.ndarray` de dois consoles Python distintos.

source: >>> # In the first Python interactive shell >>> import numpy as np >>> a = np.array([1, 1, 2, 3, 5, 8]) # Start with an existing NumPy array >>> from multiprocessing import shared_memory >>> shm = shared_memory.SharedMemory(create=True, size=a.nbytes) >>> # Now create a NumPy array backed by shared memory >>> b = np.ndarray(a.shape, dtype=a.dtype, buffer=shm.buf) >>> b[:] = a[:] # Copy the original data into shared memory >>> b array([1, 1, 2, 3, 5, 8]) >>> type(b) <class 'numpy.ndarray'> >>> type(a) <class 'numpy.ndarray'> >>> shm.name # We did not specify a name so one was chosen for us 'psm_21467_46075' >>> # In either the same shell or a new Python shell on the same machine >>> import numpy as np >>> from multiprocessing import shared_memory >>> # Attach to the existing shared memory block >>> existing_shm = shared_memory.SharedMemory(name='psm_21467_46075') >>> # Note that a.shape is (6,) and a.dtype is np.int64 in this example >>> c = np.ndarray((6,), dtype=np.int64, buffer=existing_shm.buf) >>> c array([1, 1, 2, 3, 5, 8]) >>> c[-1] = 888 >>> c array([ 1, 1, 2, 3, 5, 888]) >>> # Back in the first Python interactive shell, b reflects this change >>> b array([ 1, 1, 2, 3, 5, 888]) >>> # Clean up from within the second Python shell >>> del c # Unnecessary; merely emphasizing the array is no longer used >>> existing_shm.close() >>> # Clean up from within the first Python shell >>> del b # Unnecessary; merely emphasizing the array is no longer used >>> shm.close() >>> shm.unlink() # Free and release the shared memory block at the very end
pt_br: >>> # No primeiro console interativo do Python >>> import numpy as np >>> a = np.array([1, 1, 2, 3, 5, 8]) # Inicia com um array de NumPy existente >>> from multiprocessing import shared_memory >>> shm = shared_memory.SharedMemory(create=True, size=a.nbytes) >>> # Agora cria um array de NumPy suportado por memória compartilhada >>> b = np.ndarray(a.shape, dtype=a.dtype, buffer=shm.buf) >>> b[:] = a[:] # Copia os dados originais para memória compartilhada >>> b array([1, 1, 2, 3, 5, 8]) >>> type(b) <class 'numpy.ndarray'> >>> type(a) <class 'numpy.ndarray'> >>> shm.name # Não especificamos um nome, então um foi escolhido por nós 'psm_21467_46075' >>> # No mesmo shell ou em um novo console do Python na mesma máquina >>> import numpy as np >>> from multiprocessing import shared_memory >>> # Anexa ao bloco de memória compartilhada existente >>> existing_shm = shared_memory.SharedMemory(name='psm_21467_46075') >>> # Observe que a.shape é (6,) e a.dtype é np.int64 neste exemplo >>> c = np.ndarray((6,), dtype=np.int64, buffer=existing_shm.buf) >>> c array([1, 1, 2, 3, 5, 8]) >>> c[-1] = 888 >>> c array([ 1, 1, 2, 3, 5, 888]) >>> # De volta ao primeiro console interativo do Python, b reflete essa mudança >>> b array([ 1, 1, 2, 3, 5, 888]) >>> # Limpeza de dentro do segundo console Python >>> del c # Desnecessário; apenas enfatizar a array não é mais usado >>> existing_shm.close() >>> # Limpeza de dentro do primeiro console Python >>> del b # Desnecessário; apenas enfatizar a array não é mais usado >>> shm.close() >>> shm.unlink() # Libera o bloco de memória compartilhada no final

source: A subclass of :class:`multiprocessing.managers.BaseManager` which can be used for the management of shared memory blocks across processes.
pt_br: Uma subclasse de :class:`multiprocessing.managers.BaseManager` que pode ser usada para o gerenciamento dos blocos de memória compartilhada entre processos.

source: A call to :meth:`~multiprocessing.managers.BaseManager.start` on a :class:`!SharedMemoryManager` instance causes a new process to be started. This new process's sole purpose is to manage the life cycle of all shared memory blocks created through it. To trigger the release of all shared memory blocks managed by that process, call :meth:`~multiprocessing.managers.BaseManager.shutdown` on the instance. This triggers a :meth:`~multiprocessing.shared_memory.SharedMemory.unlink` call on all of the :class:`SharedMemory` objects managed by that process and then stops the process itself. By creating :class:`!SharedMemory` instances through a :class:`!SharedMemoryManager`, we avoid the need to manually track and trigger the freeing of shared memory resources.
pt_br: Uma chamada ao método :meth:`~multiprocessing.managers.BaseManager.start` em uma instância de :class:`!SharedMemoryManager` faz com que um novo processo seja iniciado. A única finalidade desse novo processo é gerenciar o ciclo de vida de todos os blocos de memória criados através dele. Para acionar a liberação de todos os blocos de memória gerenciados por este processo, invoque o método :meth:`~multiprocessing.managers.BaseManager.shutdown` na instância. Isso aciona uma chamada de :meth:`~multiprocessing.shared_memory.SharedMemory.unlink` em todos os objetos :class:`SharedMemory` gerenciados por esse processo e então para o processo em si. Ao criar instâncias de :class:`!SharedMemory` através de um :class:`!SharedMemoryManager`, evitamos a necessidade de rastrear e acionar manualmente a liberação dos recursos de memória compartilhada.

source: This class provides methods for creating and returning :class:`SharedMemory` instances and for creating a list-like object (:class:`ShareableList`) backed by shared memory.
pt_br: Esta classe fornece métodos para criar e retornar instâncias de :class:`SharedMemory` e para criar um objeto lista ou similar (:class:`ShareableList`) apoiado por memória compartilhada.

source: Refer to :class:`~multiprocessing.managers.BaseManager` for a description of the inherited *address* and *authkey* optional input arguments and how they may be used to connect to an existing :class:`!SharedMemoryManager` service from other processes.
pt_br: Consulte :class:`~multiprocessing.managers.BaseManager` para obter uma descrição dos argumentos de entrada opcionais herdados *address* e *authkey* e como eles podem ser usados para conectar-se a um serviço :class:`!SharedMemoryManager` existente de outros processos.

source: Create and return a new :class:`SharedMemory` object with the specified *size* in bytes.
pt_br: Cria e retorna um novo objeto :class:`SharedMemory` com o *size* especificado em bytes.

source: Create and return a new :class:`ShareableList` object, initialized by the values from the input *sequence*.
pt_br: Cria e retorna um novo objeto :class:`ShareableList`, inicializado pelos valores da entrada *sequence*.

source: The following example demonstrates the basic mechanisms of a :class:`~multiprocessing.managers.SharedMemoryManager`:
pt_br: O exemplo a seguir demonstra os mecanismos básicos de um :class:`~multiprocessing.managers.SharedMemoryManager`:

source: >>> from multiprocessing.managers import SharedMemoryManager >>> smm = SharedMemoryManager() >>> smm.start() # Start the process that manages the shared memory blocks >>> sl = smm.ShareableList(range(4)) >>> sl ShareableList([0, 1, 2, 3], name='psm_6572_7512') >>> raw_shm = smm.SharedMemory(size=128) >>> another_sl = smm.ShareableList('alpha') >>> another_sl ShareableList(['a', 'l', 'p', 'h', 'a'], name='psm_6572_12221') >>> smm.shutdown() # Calls unlink() on sl, raw_shm, and another_sl
pt_br: >>> from multiprocessing.managers import SharedMemoryManager >>> smm = SharedMemoryManager() >>> smm.start() # Inicia o procsso que gerencia os blocos de memória compartilhada >>> sl = smm.ShareableList(range(4)) >>> sl ShareableList([0, 1, 2, 3], name='psm_6572_7512') >>> raw_shm = smm.SharedMemory(size=128) >>> another_sl = smm.ShareableList('alpha') >>> another_sl ShareableList(['a', 'l', 'p', 'h', 'a'], name='psm_6572_12221') >>> smm.shutdown() # Chama unlink() em sl, raw_shm, e another_sl

source: The following example depicts a potentially more convenient pattern for using :class:`~multiprocessing.managers.SharedMemoryManager` objects via the :keyword:`with` statement to ensure that all shared memory blocks are released after they are no longer needed:
pt_br: O exemplo a seguir retrata um padrão potencialmente mais conveniente para usar objetos :class:`~multiprocessing.managers.SharedMemoryManager` através da instrução :keyword:`with` para garantir que todos os blocos de memória compartilhada são liberados depois que não são mais necessários.

source: >>> with SharedMemoryManager() as smm: ... sl = smm.ShareableList(range(2000)) ... # Divide the work among two processes, storing partial results in sl ... p1 = Process(target=do_work, args=(sl, 0, 1000)) ... p2 = Process(target=do_work, args=(sl, 1000, 2000)) ... p1.start() ... p2.start() # A multiprocessing.Pool might be more efficient ... p1.join() ... p2.join() # Wait for all work to complete in both processes ... total_result = sum(sl) # Consolidate the partial results now in sl
pt_br: >>> with SharedMemoryManager() as smm: ... sl = smm.ShareableList(range(2000)) ... # Divide o trabalho entre dois processos, armazenando resultados parciais em sl ... p1 = Process(target=do_work, args=(sl, 0, 1000)) ... p2 = Process(target=do_work, args=(sl, 1000, 2000)) ... p1.start() ... p2.start() # Um multiprocessing.Pool pode ser mais eficiente ... p1.join() ... p2.join() # Espera todo trabalho ser concluído nos dois procssos ... total_result = sum(sl) # Consolida os resutlados parciais agora em sl

source: When using a :class:`~multiprocessing.managers.SharedMemoryManager` in a :keyword:`with` statement, the shared memory blocks created using that manager are all released when the :keyword:`!with` statement's code block finishes execution.
pt_br: Ao usar um :class:`~multiprocessing.managers.SharedMemoryManager` em uma instrução :keyword:`with`, os blocos de memória compartilhada criados utilizando este gerenciador são todos liberados quando o bloco de código com a instrução :keyword:`!with` termina sua execução.

source: Provide a mutable list-like object where all values stored within are stored in a shared memory block. This constrains storable values to the following built-in data types:
pt_br: Fornece um objeto mutável do tipo lista onde todos os valores armazenados dentro são armazenados em um bloco de memória compartilhada. Isso restringe valores armazenáveis ​aos seguintes tipos de dados embutidos:

source: :class:`int` (signed 64-bit)
pt_br: :class:`int` (com sinal, 64-bit)

source: :class:`str` (less than 10M bytes each when encoded as UTF-8)
pt_br: :class:`str` (menos de 10M bytes cada quando codificado como UTF-8)

source: :class:`bytes` (less than 10M bytes each)
pt_br: :class:`bytes` (menos de 10M bytes cada)
