Repository: python/python-docs-pt-br
Catalog: library/multiprocessing.shared_memory.po
Languages: pt_br

source: It also notably differs from the built-in :class:`list` type in that these lists can not change their overall length (i.e. no :meth:`!append`, :meth:`!insert`, etc.) and do not support the dynamic creation of new :class:`!ShareableList` instances via slicing.
pt_br: Ele também difere notavelmente do tipo embutido :class:`list`, pois essas listas não podem alterar seu comprimento geral (ou seja, sem :meth:`!append`, :meth:`!insert`, etc.) e não oferecem suporte à criação dinâmica de novas instâncias :class:`!ShareableList` por meio de fatiamento.

source: *sequence* is used in populating a new :class:`!ShareableList` full of values. Set to ``None`` to instead attach to an already existing :class:`!ShareableList` by its unique shared memory name.
pt_br: *sequence* é usado para preencher um :class:`!ShareableList` com valores. Defina como ``None`` para anexar a uma :class:`!ShareableList` já existente pelo seu nome único de memória compartilhada.

source: *name* is the unique name for the requested shared memory, as described in the definition for :class:`SharedMemory`. When attaching to an existing :class:`!ShareableList`, specify its shared memory block's unique name while leaving *sequence* set to ``None``.
pt_br: *name* é um nome único para a memória compartilhada requerida, como descrito na definição de :class:`SharedMemory`. Ao anexar a uma :class:`!ShareableList` já existente, deve-se especificar o nome único do bloco de memória compartilhada e definir *sequence* como ``None``.

source: A known issue exists for :class:`bytes` and :class:`str` values. If they end with ``\x00`` nul bytes or characters, those may be *silently stripped* when fetching them by index from the :class:`!ShareableList`. This ``.rstrip(b'\x00')`` behavior is considered a bug and may go away in the future. See :gh:`106939`.
pt_br: Existe um problema conhecido para os valores :class:`bytes` e :class:`str`. Se eles terminarem com bytes ou caracteres nulos ``\x00``, eles podem ser *silenciosamente removidos* ao buscá-los pelo índice da :class:`!ShareableList`. Esse comportamento ``.rstrip(b'\x00')`` é considerado um bug e pode desaparecer no futuro. Veja :gh:`106939`.

source: For applications where rstripping of trailing nulls is a problem, work around it by always unconditionally appending an extra non-0 byte to the end of such values when storing and unconditionally removing it when fetching:
pt_br: Para aplicações onde a remoção de nulos finais é um problema, contorne-o sempre anexando incondicionalmente um byte extra diferente de 0 ao final de tais valores ao armazená-los e removendo-os incondicionalmente ao buscá-los:

source: Return the number of occurrences of *value*.
pt_br: Retorna o número de ocorrências de *value*.

source: Return first index position of *value*. Raise :exc:`ValueError` if *value* is not present.
pt_br: Retorna a primeira posição do índice de *value*. Levanta :exc:`ValueError` se *value* não estiver presente.

source: Read-only attribute containing the :mod:`struct` packing format used by all currently stored values.
pt_br: Atributo somente leitura contendo o formato de empacotamento :mod:`struct` usado por todos os valores armazenados atualmente.

source: The :class:`SharedMemory` instance where the values are stored.
pt_br: A instância de :class:`SharedMemory` onde os valores são armazenados.

source: The following example demonstrates basic use of a :class:`ShareableList` instance:
pt_br: O exemplo a seguir demonstra o uso básico de uma instância de :class:`ShareableList`:

source: The following example depicts how one, two, or many processes may access the same :class:`ShareableList` by supplying the name of the shared memory block behind it:
pt_br: O exemplo a seguir retrata como um, dois ou mais processos podem acessar a mesma :class:`ShareableList` fornecendo o nome do bloco de memória compartilhada por trás dela:

source: The following examples demonstrates that :class:`ShareableList` (and underlying :class:`SharedMemory`) objects can be pickled and unpickled if needed. Note, that it will still be the same shared object. This happens, because the deserialized object has the same unique name and is just attached to an existing object with the same name (if the object is still alive):
pt_br: Os exemplos a seguir demonstram que os objetos :class:`ShareableList` (e o subjacente :class:`SharedMemory`) podem ser serializados e desserializados com pickle, se preciso. Note, ainda será o mesmo objeto compartilhado. Isto acontece pois o objeto desserializado tem o mesmo nome único e é somente anexado ao objeto existente com o mesmo nome (se o objeto ainda existe):

source: Shared Memory
pt_br: Memória compartilhada

source: POSIX Shared Memory
pt_br: POSIX, memória compartilhada

source: Named Shared Memory
pt_br: Nomeada, memória compartilhada
