Repository: python/python-docs-pt-br
Catalog: library/netrc.po
Languages: pt_br

source: :mod:`!netrc` --- netrc file processing
pt_br: :mod:`!netrc` --- Arquivo de processamento netrc

source: **Source code:** :source:`Lib/netrc.py`
pt_br: **Código-fonte:** :source:`Lib/netrc.py`

source: The :class:`~netrc.netrc` class parses and encapsulates the netrc file format used by the Unix :program:`ftp` program and other FTP clients.
pt_br: A classe :class:`~netrc.netrc` analisa e encapsula o formato do arquivo netrc usado pelo programa Unix :program:`ftp` e outros clientes FTP.

source: A :class:`~netrc.netrc` instance or subclass instance encapsulates data from a netrc file. The initialization argument, if present, specifies the file to parse. If no argument is given, the file :file:`.netrc` in the user's home directory -- as determined by :func:`os.path.expanduser` -- will be read. Otherwise, a :exc:`FileNotFoundError` exception will be raised. Parse errors will raise :exc:`NetrcParseError` with diagnostic information including the file name, line number, and terminating token.
pt_br: Uma instância ou instância de subclasse de :class:`~netrc.netrc` encapsula dados de um arquivo netrc. O argumento de inicialização, se presente, especifica o arquivo a ser analisado. Se nenhum argumento for fornecido, o arquivo :file:`.netrc` no diretório inicial do usuário -- conforme determinado por :func:`os.path.expanduser` -- será lido. Caso contrário, uma exceção :exc:`FileNotFoundError` será levantada. Os erros de análise levantam :exc:`NetrcParseError` com informações de diagnóstico, incluindo o nome do arquivo, o número da linha e o token final.

source: If no argument is specified on a POSIX system, the presence of passwords in the :file:`.netrc` file will raise a :exc:`NetrcParseError` if the file ownership or permissions are insecure (owned by a user other than the user running the process, or accessible for read or write by any other user). This implements security behavior equivalent to that of ftp and other programs that use :file:`.netrc`. Such security checks are not available on platforms that do not support :func:`os.getuid`.
pt_br: Se nenhum argumento for especificado em um sistema POSIX, a presença de senhas no arquivo :file:`.netrc` levantará um :exc:`NetrcParseError` se a propriedade ou as permissões do arquivo forem inseguras (pertencentes a um usuário que não seja o usuário executando o processo ou acessível para leitura ou gravação por qualquer outro usuário). Isso implementa um comportamento de segurança equivalente ao do ftp e de outros programas que usam :file:`.netrc`. Essas verificações de segurança não estão disponíveis em plataformas que não oferecem suporte a :func:`os.getuid`.

source: Added the POSIX permission check.
pt_br: Adicionada a verificação de permissão POSIX.

source: :func:`os.path.expanduser` is used to find the location of the :file:`.netrc` file when *file* is not passed as argument.
pt_br: :func:`os.path.expanduser` é usado para encontrar a localização do arquivo :file:`.netrc` quando *file* não é passado como argumento.

source: :class:`netrc` try UTF-8 encoding before using locale specific encoding. The entry in the netrc file no longer needs to contain all tokens. The missing tokens' value default to an empty string. All the tokens and their values now can contain arbitrary characters, like whitespace and non-ASCII characters. If the login name is anonymous, it won't trigger the security check.
pt_br: :class:`netrc` tenta a codificação UTF-8 antes de usar a codificação específica da localidade. A entrada no arquivo netrc não precisa mais conter todos os tokens. O valor padrão dos tokens ausentes é uma string vazia. Todos os tokens e seus valores agora podem conter caracteres arbitrários, como espaços em branco e caracteres não ASCII. Se o nome de login for anônimo, ele não acionará a verificação de segurança.

source: Exception raised by the :class:`~netrc.netrc` class when syntactical errors are encountered in source text. Instances of this exception provide three interesting attributes:
pt_br: Exceção levantada pela classe :class:`~netrc.netrc` quando erros sintáticos são encontrados no texto fonte. As instâncias desta exceção fornecem três atributos interessantes:

source: Textual explanation of the error.
pt_br: Explicação textual do erro.

source: The name of the source file.
pt_br: O nome do arquivo de origem.

source: The line number on which the error was found.
pt_br: O número da linha em que o erro foi encontrado.

source: netrc Objects
pt_br: Objetos netrc

source: A :class:`~netrc.netrc` instance has the following methods:
pt_br: Uma instância da classe :class:`~netrc.netrc` tem os seguintes métodos:

source: Return a 3-tuple ``(login, account, password)`` of authenticators for *host*. If the netrc file did not contain an entry for the given host, return the tuple associated with the 'default' entry. If neither matching host nor default entry is available, return ``None``.
pt_br: Retorna uma tupla de 3 elementos ``(login, conta, senha)`` dos autenticadores do *host*. Se o arquivo netrc não contém uma entrada para o host dado, retorna a tupla associada com a entrada padrão. Se não houver nenhum host correspondente nem uma entrada padrão estiver disponível, retorna ``None``.

source: Dump the class data as a string in the format of a netrc file. (This discards comments and may reorder the entries.)
pt_br: Despeja os dados da classe como uma string no formato de um arquivo netrc. (Isso descarta os comentários e pode reordenar as entradas.)

source: Instances of :class:`~netrc.netrc` have public instance variables:
pt_br: Instâncias de :class:`~netrc.netrc` possuem variáveis de instância públicas:

source: Dictionary mapping host names to ``(login, account, password)`` tuples. The 'default' entry, if any, is represented as a pseudo-host by that name.
pt_br: Dicionário mapeando nomes de host para tuplas ``(login, conta, senha)``. A entrada *default*, se houver, é representada como um pseudo-host por esse nome.

source: Dictionary mapping macro names to string lists.
pt_br: Dicionário mapeando nomes de macros para listas de strings.
