Repository: python/python-docs-pt-br
Catalog: library/nis.po
Languages: pt_br

source: :mod:`nis` --- Interface to Sun's NIS (Yellow Pages)
pt_br: :mod:`nis` --- Interface para NIS da Sun (Yellow Pages)

source: The :mod:`nis` module is deprecated (see :pep:`PEP 594 <594#nis>` for details).
pt_br: O módulo :mod:`nis` foi descontinuado (veja :pep:`PEP 594 <594#nis>` para mais detalhes).

source: The :mod:`nis` module gives a thin wrapper around the NIS library, useful for central administration of several hosts.
pt_br: O módulo :mod:`nis` fornece um invólucro fino em torno da biblioteca NIS, útil para administração central de vários hosts.

source: Because NIS exists only on Unix systems, this module is only available for Unix.
pt_br: Como o NIS existe apenas em sistemas Unix, este módulo está disponível apenas para Unix.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em plataformas WebAssembly ``wasm32-emscripten`` e ``wasm32-wasi``. Veja :ref:`wasm-availability` para mais informações.

source: The :mod:`nis` module defines the following functions:
pt_br: O módulo :mod:`nis` define as seguintes funções:

source: Return the match for *key* in map *mapname*, or raise an error (:exc:`nis.error`) if there is none. Both should be strings, *key* is 8-bit clean. Return value is an arbitrary array of bytes (may contain ``NULL`` and other joys).
pt_br: Retorna a correspondência para *key* no mapa *mapname* ou levanta um erro (:exc:`nis.error`) se não houver nenhum. Ambos devem ser strings, *key* está limpo em 8 bits. O valor de retorno é uma matriz arbitrária de bytes (pode conter ``NULL`` e outras diversões).

source: Note that *mapname* is first checked if it is an alias to another name.
pt_br: Observe que *mapname* é verificado primeiro se for um alias para outro nome.

source: The *domain* argument allows overriding the NIS domain used for the lookup. If unspecified, lookup is in the default NIS domain.
pt_br: O argumento *domain* permite substituir o domínio NIS usado para a pesquisa. Se não especificado, a pesquisa está no domínio NIS padrão.

source: Return a dictionary mapping *key* to *value* such that ``match(key, mapname)==value``. Note that both keys and values of the dictionary are arbitrary arrays of bytes.
pt_br: Retorna um mapeamento de dicionário de *key* para *value* de modo que ``match(key, mapname)==value``. Observe que as chaves e os valores do dicionário são matrizes arbitrárias de bytes.

source: Return a list of all valid maps.
pt_br: Retorna uma lista de todos os mapas válidos.

source: Return the system default NIS domain.
pt_br: Retorna o domínio NIS padrão do sistema.

source: The :mod:`nis` module defines the following exception:
pt_br: O módulo :mod:`nis` define a exceção padrão:

source: An error raised when a NIS function returns an error code.
pt_br: Um erro levantado quando uma função NIS retorna um códio de erro.
