Repository: python/python-docs-pt-br
Catalog: library/numbers.po
Languages: pt_br

source: :mod:`!numbers` --- Numeric abstract base classes
pt_br: :mod:`!numbers` --- Classes base abstratas numéricas

source: **Source code:** :source:`Lib/numbers.py`
pt_br: **Código-fonte:** :source:`Lib/numbers.py`

source: The :mod:`!numbers` module (:pep:`3141`) defines a hierarchy of numeric :term:`abstract base classes <abstract base class>` which progressively define more operations. None of the types defined in this module are intended to be instantiated.
pt_br: O módulo :mod:`!numbers` (:pep:`3141`) define uma hierarquia de :term:`classes base abstratas <abstract base class>` que progressivamente definem mais operações. Nenhum dos tipos definidos neste módulo se destina a ser instanciado.

source: The root of the numeric hierarchy. If you just want to check if an argument *x* is a number, without caring what kind, use ``isinstance(x, Number)``.
pt_br: A raiz da hierarquia numérica. Se você quiser apenas verificar se um argumento *x* é um número, sem se importar com o tipo, use ``isinstance(x, Number)``.

source: The numeric tower
pt_br: A torre numérica

source: Subclasses of this type describe complex numbers and include the operations that work on the built-in :class:`complex` type. These are: conversions to :class:`complex` and :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``*``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==``, and ``!=``. All except ``-`` and ``!=`` are abstract.
pt_br: As subclasses deste tipo descrevem números complexos e incluem as operações que funcionam no tipo embutido :class:`complex`. Elas são: conversões para :class:`complex` e :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``*``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==`` e ``!=``. Todos exceto ``-`` e ``!=`` são abstratos.

source: Abstract. Retrieves the real component of this number.
pt_br: Abstrata. Obtém o componente real deste número.

source: Abstract. Retrieves the imaginary component of this number.
pt_br: Abstrata. Obtém o componente imaginário deste número.

source: Abstract. Returns the complex conjugate. For example, ``(1+3j).conjugate() == (1-3j)``.
pt_br: Abstrata. Retorna o conjugado complexo. Por exemplo, ``(1+3j).conjugate() == (1-3j)``.

source: To :class:`Complex`, :class:`!Real` adds the operations that work on real numbers.
pt_br: Para :class:`Complex`, :class:`!Real` adiciona as operações que funcionam em números reais.

source: In short, those are: a conversion to :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>``, and ``>=``.
pt_br: Em suma, são: uma conversão para :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>`` e ``>=``.

source: Real also provides defaults for :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag`, and :meth:`~Complex.conjugate`.
pt_br: Real também fornece padrão para :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag` e :meth:`~Complex.conjugate`.

source: Subtypes :class:`Real` and adds :attr:`~Rational.numerator` and :attr:`~Rational.denominator` properties. It also provides a default for :func:`float`.
pt_br: Estende :class:`Real` e adiciona as propriedades :attr:`~Rational.numerator` e :attr:`~Rational.denominator`. Ele fornece um padrão para :func:`float`.

source: The :attr:`~Rational.numerator` and :attr:`~Rational.denominator` values should be instances of :class:`Integral` and should be in lowest terms with :attr:`~Rational.denominator` positive.
pt_br: Os valores :attr:`~Rational.numerator` e :attr:`~Rational.denominator` devem ser instâncias de :class:`Integral` e devem estar nos termos mais baixos com :attr:`~Rational.denominator` positivo.

source: Abstract.
pt_br: Abstrata.

source: Subtypes :class:`Rational` and adds a conversion to :class:`int`. Provides defaults for :func:`float`, :attr:`~Rational.numerator`, and :attr:`~Rational.denominator`. Adds abstract methods for :func:`pow` with modulus and bit-string operations: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.
pt_br: Estende :class:`Rational` e adiciona uma conversão para :class:`int`. Fornece padrões para :func:`float`, :attr:`~Rational.numerator` e :attr:`~Rational.denominator`. Adiciona métodos abstratos para :func:`pow` com operações de módulo e de string de bits: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.

source: Notes for type implementers
pt_br: Notas para implementadores de tipos

source: Implementers should be careful to make equal numbers equal and hash them to the same values. This may be subtle if there are two different extensions of the real numbers. For example, :class:`fractions.Fraction` implements :func:`hash` as follows::
pt_br: Os implementadores devem ter o cuidado de tornar iguais números iguais e fazer hash deles com os mesmos valores. Isso pode ser sutil se houver duas extensões diferentes dos números reais. Por exemplo, :class:`fractions.Fraction` implementa :func:`hash` desta forma::

source: def __hash__(self): if self.denominator == 1: # Get integers right. return hash(self.numerator) # Expensive check, but definitely correct. if self == float(self): return hash(float(self)) else: # Use tuple's hash to avoid a high collision rate on # simple fractions. return hash((self.numerator, self.denominator))
pt_br: def __hash__(self): if self.denominator == 1: # Obtém inteiros corretamente. return hash(self.numerator) # Verificação custosa, mas certamente correta. if self == float(self): return hash(float(self)) else: # Use o hash da tupla para evitar uma alta taxa de colisão # em frações simples. return hash((self.numerator, self.denominator))

source: Adding More Numeric ABCs
pt_br: Adicionando mais ABCs numéricas

source: There are, of course, more possible ABCs for numbers, and this would be a poor hierarchy if it precluded the possibility of adding those. You can add ``MyFoo`` between :class:`Complex` and :class:`Real` with::
pt_br: Existem, é claro, mais ABCs possíveis para números, e isso seria uma hierarquia pobre se excluísse a possibilidade de adicioná-los. Você pode adicionar ``MyFoo`` entre :class:`Complex` e :class:`Real` com::

source: Implementing the arithmetic operations
pt_br: Implementando as operações aritméticas

source: We want to implement the arithmetic operations so that mixed-mode operations either call an implementation whose author knew about the types of both arguments, or convert both to the nearest built in type and do the operation there. For subtypes of :class:`Integral`, this means that :meth:`~object.__add__` and :meth:`~object.__radd__` should be defined as::
pt_br: Queremos implementar as operações aritméticas de forma que as operações de modo misto chamem uma implementação cujo autor conhecia os tipos de ambos os argumentos ou convertam ambos para o tipo embutido mais próximo e façam a operação lá. Para subtipos de :class:`Integral`, isso significa que :meth:`~object.__add__` e :meth:`~object.__radd__` devem ser definidos com::

source: There are 5 different cases for a mixed-type operation on subclasses of :class:`Complex`. I'll refer to all of the above code that doesn't refer to ``MyIntegral`` and ``OtherTypeIKnowAbout`` as "boilerplate". ``a`` will be an instance of ``A``, which is a subtype of :class:`Complex` (``a : A <: Complex``), and ``b : B <: Complex``. I'll consider ``a + b``:
pt_br: Existem 5 casos diferentes para uma operação de tipo misto em subclasses de :class:`Complex`. Vou me referir a todo o código acima que não se refere a ``MyIntegral`` e ``OtherTypeIKnowAbout`` com um "modelo". ``a`` será uma instância de ``A``, que é um subtipo de :class:`Complex` (``a : A <: Complex``) e ``b : B <: Complex``. Vou considerar ``a + b``:

source: If ``A`` defines an :meth:`~object.__add__` which accepts ``b``, all is well.
pt_br: Se ``A`` define um :meth:`~object.__add__`, que aceita ``b``, está tudo bem.

source: If ``A`` falls back to the boilerplate code, and it were to return a value from :meth:`~object.__add__`, we'd miss the possibility that ``B`` defines a more intelligent :meth:`~object.__radd__`, so the boilerplate should return :data:`NotImplemented` from :meth:`!__add__`. (Or ``A`` may not implement :meth:`!__add__` at all.)
pt_br: Se ``A`` voltar ao código padrão e tivesse que retornar um valor de :meth:`~object.__add__`, perderíamos a possibilidade de que ``B`` definisse um :meth:`~object.__radd__` mais inteligente, então o código padrão deve retornar :data:`NotImplemented` de :meth:`!__add__`. (Ou ``A`` pode não implementar :meth:`!__add__`.)

source: Then ``B``'s :meth:`~object.__radd__` gets a chance. If it accepts ``a``, all is well.
pt_br: Então, :meth:`~object.__radd__` do ``B`` consegue uma chance. Se ele aceitar ``a``, está tudo bem.

source: If it falls back to the boilerplate, there are no more possible methods to try, so this is where the default implementation should live.
pt_br: Se ele recorrer ao padrão, não há mais métodos possíveis para tentar, então é aqui que a implementação padrão deve residir.

source: If ``B <: A``, Python tries ``B.__radd__`` before ``A.__add__``. This is ok, because it was implemented with knowledge of ``A``, so it can handle those instances before delegating to :class:`Complex`.
pt_br: Se ``B <: A``, Python tenta ``B.__radd__`` antes de ``A.__add__``. Isso está ok, porque foi implementado com conhecimento de ``A``, então ele pode lidar com essas instâncias antes de delegar para :class:`Complex`.

source: If ``A <: Complex`` and ``B <: Real`` without sharing any other knowledge, then the appropriate shared operation is the one involving the built in :class:`complex`, and both :meth:`~object.__radd__` s land there, so ``a+b == b+a``.
pt_br: Se ``A <: Complex`` e ``B <: Real`` sem compartilhar nenhum outro conhecimento, então a operação compartilhada apropriada é aquela envolvendo a :class:`complex` embutida, e :meth:`~object.__radd__` de ambos chegam lá, de forma que ``a+b == b+a``.

source: Because most of the operations on any given type will be very similar, it can be useful to define a helper function which generates the forward and reverse instances of any given operator. For example, :class:`fractions.Fraction` uses::
pt_br: Como a maioria das operações em qualquer tipo será muito semelhante, pode ser útil definir uma função auxiliar que gera as instâncias de avanço e reversão de qualquer operador. Por exemplo, :class:`fractions.Fraction` usa::

source: def _operator_fallbacks(monomorphic_operator, fallback_operator): def forward(a, b): if isinstance(b, (int, Fraction)): return monomorphic_operator(a, b) elif isinstance(b, float): return fallback_operator(float(a), b) elif isinstance(b, complex): return fallback_operator(complex(a), b) else: return NotImplemented forward.__name__ = '__' + fallback_operator.__name__ + '__' forward.__doc__ = monomorphic_operator.__doc__ def reverse(b, a): if isinstance(a, Rational): # Includes ints. return monomorphic_operator(a, b) elif isinstance(a, Real): return fallback_operator(float(a), float(b)) elif isinstance(a, Complex): return fallback_operator(complex(a), complex(b)) else: return NotImplemented reverse.__name__ = '__r' + fallback_operator.__name__ + '__' reverse.__doc__ = monomorphic_operator.__doc__ return forward, reverse def _add(a, b): """a + b""" return Fraction(a.numerator * b.denominator + b.numerator * a.denominator, a.denominator * b.denominator) __add__, __radd__ = _operator_fallbacks(_add, operator.add) # ...
pt_br: def _operator_fallbacks(monomorphic_operator, fallback_operator): def forward(a, b): if isinstance(b, (int, Fraction)): return monomorphic_operator(a, b) elif isinstance(b, float): return fallback_operator(float(a), b) elif isinstance(b, complex): return fallback_operator(complex(a), b) else: return NotImplemented forward.__name__ = '__' + fallback_operator.__name__ + '__' forward.__doc__ = monomorphic_operator.__doc__ def reverse(b, a): if isinstance(a, Rational): # Inclui ints. return monomorphic_operator(a, b) elif isinstance(a, Real): return fallback_operator(float(a), float(b)) elif isinstance(a, Complex): return fallback_operator(complex(a), complex(b)) else: return NotImplemented reverse.__name__ = '__r' + fallback_operator.__name__ + '__' reverse.__doc__ = monomorphic_operator.__doc__ return forward, reverse def _add(a, b): """a + b""" return Fraction(a.numerator * b.denominator + b.numerator * a.denominator, a.denominator * b.denominator) __add__, __radd__ = _operator_fallbacks(_add, operator.add) # ...
