Repository: python/python-docs-pt-br
Catalog: library/os.path.po
Languages: pt_br

source: :mod:`!os.path` --- Common pathname manipulations
pt_br: :mod:`!os.path` --- Manipulações comuns de nomes de caminhos

source: **Source code:** :source:`Lib/genericpath.py`, :source:`Lib/posixpath.py` (for POSIX) and :source:`Lib/ntpath.py` (for Windows).
pt_br: **Código-fonte:** :source:`Lib/genericpath.py`, :source:`Lib/posixpath.py` (para POSIX) e :source:`Lib/ntpath.py` (para Windows).

source: This module implements some useful functions on pathnames. To read or write files see :func:`open`, and for accessing the filesystem see the :mod:`os` module. The path parameters can be passed as strings, or bytes, or any object implementing the :class:`os.PathLike` protocol.
pt_br: Este módulo implementa algumas funções úteis em nomes de caminho. Para ler ou escrever arquivos veja :func:`open`, e para acessar o sistema de arquivos veja o módulo :mod:`os`. Os parâmetros de caminho podem ser passados como strings, ou bytes, ou qualquer objeto que implemente o protocolo :class:`os.PathLike`.

source: Unlike a Unix shell, Python does not do any *automatic* path expansions. Functions such as :func:`expanduser` and :func:`expandvars` can be invoked explicitly when an application desires shell-like path expansion. (See also the :mod:`glob` module.)
pt_br: Ao contrário de um shell Unix, Python não faz nenhuma expansão *automática* de caminho. Funções como :func:`expanduser` e :func:`expandvars` podem ser invocadas explicitamente quando uma aplicação deseja uma expansão de caminho no estilo do shell. (Veja também o módulo :mod:`glob`.)

source: The :mod:`pathlib` module offers high-level path objects.
pt_br: O módulo :mod:`pathlib` oferece objetos de caminho de alto nível.

source: All of these functions accept either only bytes or only string objects as their parameters. The result is an object of the same type, if a path or file name is returned.
pt_br: Todas essas funções aceitam apenas bytes ou apenas objetos de string como seus parâmetros. O resultado é um objeto do mesmo tipo, se um caminho ou nome de arquivo for retornado.

source: Since different operating systems have different path name conventions, there are several versions of this module in the standard library. The :mod:`os.path` module is always the path module suitable for the operating system Python is running on, and therefore usable for local paths. However, you can also import and use the individual modules if you want to manipulate a path that is *always* in one of the different formats. They all have the same interface:
pt_br: Uma vez que diferentes sistemas operacionais têm diferentes convenções de nome de caminho, existem várias versões deste módulo na biblioteca padrão. O módulo :mod:`os.path` é sempre o módulo de caminho adequado para o sistema operacional em que o Python está sendo executado e, portanto, pode ser usado para caminhos locais. No entanto, você também pode importar e usar os módulos individuais se quiser manipular um caminho que esteja *sempre* em um dos diferentes formatos. Todos eles têm a mesma interface:

source: :mod:`posixpath` for UNIX-style paths
pt_br: :mod:`posixpath` para caminhos no estilo UNIX

source: :mod:`ntpath` for Windows paths
pt_br: :mod:`ntpath` para caminhos do Windows

source: :func:`exists`, :func:`lexists`, :func:`isdir`, :func:`isfile`, :func:`islink`, and :func:`ismount` now return ``False`` instead of raising an exception for paths that contain characters or bytes unrepresentable at the OS level.
pt_br: :func:`exists`, :func:`lexists`, :func:`isdir`, :func:`isfile`, :func:`islink` e :func:`ismount` agora retornam ``False`` em vez de levantar uma exceção para caminhos que contêm caracteres ou bytes não representáveis no nível de sistema de operacional.

source: Return a normalized absolutized version of the pathname *path*. On most platforms, this is equivalent to calling the function :func:`normpath` as follows: ``normpath(join(os.getcwd(), path))``.
pt_br: Retorna uma versão normalizada e absolutizada do nome de caminho *path*. Na maioria das plataformas, isso é equivalente a chamar a função :func:`normpath` da seguinte forma: ``normpath(join(os.getcwd(), path))``.

source: Accepts a :term:`path-like object`.
pt_br: Aceita um :term:`objeto caminho ou similar`.

source: Return the base name of pathname *path*. This is the second element of the pair returned by passing *path* to the function :func:`split`. Note that the result of this function is different from the Unix :program:`basename` program; where :program:`basename` for ``'/foo/bar/'`` returns ``'bar'``, the :func:`basename` function returns an empty string (``''``).
pt_br: Retorna o nome base do caminho *path*. Este é o segundo elemento do par retornado pela passagem de *path* para a função :func:`split`. Observe que o resultado desta função é diferente do programa Unix :program:`basename`; onde :program:`basename` para ``'/foo/bar/'`` retorna ``'bar'``, a função :func:`basename` retorna uma string vazia (``''``).

source: Return the longest common sub-path of each pathname in the iterable *paths*. Raise :exc:`ValueError` if *paths* contain both absolute and relative pathnames, if *paths* are on different drives, or if *paths* is empty. Unlike :func:`commonprefix`, this returns a valid path.
pt_br: Retorna o subcaminho comum mais longo de cada nome de caminho no iterável *paths*. Levanta :exc:`ValueError` se *paths* contiverem nomes de caminho absolutos e relativos, os *paths* estiverem em unidades diferentes ou se *paths* estiverem vazios. Ao contrário de :func:`commonprefix`, retorna um caminho válido.

source: Accepts a sequence of :term:`path-like objects <path-like object>`.
pt_br: Aceita uma sequência de :term:`objetos caminho ou similares <path-like object>`.

source: Any iterable can now be passed, rather than just sequences.
pt_br: Qualquer iterável agora pode ser passado, em vez de apenas sequências.

source: Return the longest path prefix (taken character-by-character) that is a prefix of all paths in *list*. If *list* is empty, return the empty string (``''``).
pt_br: Retorna o prefixo de caminho mais longo (obtido caractere por caractere) que é um prefixo de todos os caminhos em *list*. Se *list* estiver vazia, retorna a string vazia (``''``).

source: This function may return invalid paths because it works a character at a time. To obtain a valid path, see :func:`commonpath`.
pt_br: Esta função pode retornar caminhos inválidos porque funciona um caractere por vez. Para obter um caminho válido, consulte :func:`commonpath`.

source: Return the directory name of pathname *path*. This is the first element of the pair returned by passing *path* to the function :func:`split`.
pt_br: Retorna o nome do diretório do nome de caminho *path*. Este é o primeiro elemento do par retornado passando *path* para a função :func:`split`.

source: Return ``True`` if *path* refers to an existing path or an open file descriptor. Returns ``False`` for broken symbolic links. On some platforms, this function may return ``False`` if permission is not granted to execute :func:`os.stat` on the requested file, even if the *path* physically exists.
pt_br: Retorna ``True`` se *path* se referir a um caminho existente ou um descritor de arquivo aberto. Retorna ``False`` para links simbólicos quebrados. Em algumas plataformas, esta função pode retornar ``False`` se a permissão não for concedida para executar :func:`os.stat` no arquivo solicitado, mesmo se o *path* existir fisicamente.

source: *path* can now be an integer: ``True`` is returned if it is an open file descriptor, ``False`` otherwise.
pt_br: *path* agora pode ser um inteiro: ``True`` é retornado se for um descritor de arquivo aberto, ``False`` caso contrário.

source: Return ``True`` if *path* refers to an existing path, including broken symbolic links. Equivalent to :func:`exists` on platforms lacking :func:`os.lstat`.
pt_br: Retorna ``True`` se *path* se referir a um caminho existente, incluindo links simbólicos quebrados. Equivalente a :func:`exists` em plataformas sem :func:`os.lstat`.

source: On Unix and Windows, return the argument with an initial component of ``~`` or ``~user`` replaced by that *user*'s home directory.
pt_br: No Unix e no Windows, retorna o argumento com um componente inicial de ``~`` ou ``~user`` substituído pelo diretório inicial daquele usuário *user*.

source: On Unix, an initial ``~`` is replaced by the environment variable :envvar:`HOME` if it is set; otherwise the current user's home directory is looked up in the password directory through the built-in module :mod:`pwd`. An initial ``~user`` is looked up directly in the password directory.
pt_br: No Unix, um ``~`` no início é substituído pela variável de ambiente :envvar:`HOME` se estiver definida; caso contrário, o diretório pessoal do usuário atual é procurado no diretório de senha através do módulo embutido :mod:`pwd`. Um ``~user`` no início é procurado diretamente no diretório de senhas.

source: On Windows, :envvar:`USERPROFILE` will be used if set, otherwise a combination of :envvar:`HOMEPATH` and :envvar:`HOMEDRIVE` will be used. An initial ``~user`` is handled by checking that the last directory component of the current user's home directory matches :envvar:`USERNAME`, and replacing it if so.
pt_br: No Windows, :envvar:`USERPROFILE` será usada se definida; caso contrário, uma combinação de :envvar:`HOMEPATH` e :envvar:`HOMEDRIVE` será usada. Um ``~user`` inicial é tratado verificando se o último componente do diretório home do usuário atual corresponde a :envvar:`USERNAME`, e substituindo-o se for o caso.

source: If the expansion fails or if the path does not begin with a tilde, the path is returned unchanged.
pt_br: Se a expansão falhar ou se o caminho não começar com um til, o caminho será retornado inalterado.

source: No longer uses :envvar:`HOME` on Windows.
pt_br: Não usa mais :envvar:`HOME` no Windows.

source: Return the argument with environment variables expanded. Substrings of the form ``$name`` or ``${name}`` are replaced by the value of environment variable *name*. Malformed variable names and references to non-existing variables are left unchanged.
pt_br: Retorna o argumento com as variáveis de ambiente expandidas. Substrings da forma ``$name`` ou ``${name}`` são substituídas pelo valor da variável de ambiente *name*. Nomes de variáveis malformados e referências a variáveis não existentes permanecem inalterados.

source: On Windows, ``%name%`` expansions are supported in addition to ``$name`` and ``${name}``.
pt_br: No Windows, expansões ``%name%`` são suportadas juntamente a ``$name`` e ``${name}``.

source: Return the time of last access of *path*. The return value is a floating-point number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_br: Retorna a hora do último acesso de *path*. O valor de retorno é um número de ponto flutuante dando o número de segundos desde a Era Unix (veja o módulo :mod:`time`). Levanta :exc:`OSError` se o arquivo não existe ou está inacessível.

source: Return the time of last modification of *path*. The return value is a floating-point number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_br: Retorna a hora da última modificação de *path*. O valor de retorno é um número de ponto flutuante dando o número de segundos desde a Era Unix (veja o módulo :mod:`time`). Levanta :exc:`OSError` se o arquivo não existe ou está inacessível.

source: Return the system's ctime which, on some systems (like Unix) is the time of the last metadata change, and, on others (like Windows), is the creation time for *path*. The return value is a number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_br: Retorna o ctime do sistema que, em alguns sistemas (como Unix) é a hora da última alteração de metadados, e, em outros (como Windows), é a hora de criação de *path*. O valor de retorno é um número que fornece o número de segundos desde a Era Unix (veja o módulo :mod:`time`). Levanta :exc:`OSError` se o arquivo não existe ou está inacessível.

source: Return the size, in bytes, of *path*. Raise :exc:`OSError` if the file does not exist or is inaccessible.
pt_br: Retorna o tamanho, em bytes, de *path*. Levanta :exc:`OSError` se o arquivo não existe ou está inacessível.

source: Return ``True`` if *path* is an absolute pathname. On Unix, that means it begins with a slash, on Windows that it begins with two (back)slashes, or a drive letter, colon, and (back)slash together.
pt_br: Retorna ``True`` se *path* for um nome de caminho absoluto. No Unix, isso significa que começa com uma barra, no Windows começa com duas (contra)barras ou uma letra de unidade, caractere de dois pontos e (contra)barra juntos.

source: On Windows, returns ``False`` if the given path starts with exactly one (back)slash.
pt_br: No Windows, retorna ``False`` se o caminho fornecido começar com exatamente uma (contra)barra.

source: Return ``True`` if *path* is an :func:`existing <exists>` regular file. This follows symbolic links, so both :func:`islink` and :func:`isfile` can be true for the same path.
pt_br: Retorna ``True`` se *path* for um arquivo regular :func:`existente <exists>`. Isso segue links simbólicos, então :func:`islink` e :func:`isfile` podem ser verdadeiros para o mesmo caminho.

source: Return ``True`` if *path* is an :func:`existing <exists>` directory. This follows symbolic links, so both :func:`islink` and :func:`isdir` can be true for the same path.
pt_br: Retorna ``True`` se *path* for um diretório :func:`existente <exists>`. Isso segue links simbólicos, então :func:`islink` e :func:`isdir` podem ser verdadeiros para o mesmo caminho.

source: Return ``True`` if *path* refers to an :func:`existing <lexists>` directory entry that is a junction. Always return ``False`` if junctions are not supported on the current platform.
pt_br: Retorna ``True`` se *path* se referir a uma entrada de diretório :func:`existente <lexists>` que é uma junção. Sempre retorna ``False`` se junções não forem suportados na plataforma atual.

source: Return ``True`` if *path* refers to an :func:`existing <exists>` directory entry that is a symbolic link. Always ``False`` if symbolic links are not supported by the Python runtime.
pt_br: Retorna ``True`` se *path* se referir a uma entrada de diretório :func:`existente <exists>` que é um link simbólico. Sempre ``False`` se links simbólicos não forem suportados pelo tempo de execução Python.

source: Return ``True`` if pathname *path* is a :dfn:`mount point`: a point in a file system where a different file system has been mounted. On POSIX, the function checks whether *path*'s parent, :file:`{path}/..`, is on a different device than *path*, or whether :file:`{path}/..` and *path* point to the same i-node on the same device --- this should detect mount points for all Unix and POSIX variants. It is not able to reliably detect bind mounts on the same filesystem. On Windows, a drive letter root and a share UNC are always mount points, and for any other path ``GetVolumePathName`` is called to see if it is different from the input path.
pt_br: Retorna ``True`` se o nome de caminho *path* for um :dfn:`ponto de montagem`: um ponto em um sistema de arquivos onde um sistema de arquivos diferente foi montado. No POSIX, a função verifica se o pai de *path*, :file:`{path}/..`, está em um dispositivo diferente de *path*, ou se :file:`{path}/..` e *path* apontam para o mesmo nó-i no mesmo dispositivo -- isso deve detectar pontos de montagem para todas as variantes Unix e POSIX. Não é capaz de detectar confiavelmente montagens bind no mesmo sistema de arquivos. No Windows, uma raiz de letra de unidade e um UNC de compartilhamento são sempre pontos de montagem e, para qualquer outro caminho, ``GetVolumePathName`` é chamado para ver se é diferente do caminho de entrada.

source: Added support for detecting non-root mount points on Windows.
pt_br: Adicionado suporte para detecção de pontos de montagem não raiz no Windows.

source: Return ``True`` if pathname *path* is located on a Windows Dev Drive. A Dev Drive is optimized for developer scenarios, and offers faster performance for reading and writing files. It is recommended for use for source code, temporary build directories, package caches, and other IO-intensive operations.
pt_br: Retorna ``True`` se o nome do caminho *path* estiver localizado em um Windows Dev Drive. Um Dev Drive é otimizado para cenários de desenvolvedor e oferece desempenho mais rápido para leitura e gravação de arquivos. É recomendado para uso em código-fonte, diretórios de construção temporários, caches de pacotes e outras operações com uso intensivo de ES.

source: May raise an error for an invalid path, for example, one without a recognizable drive, but returns ``False`` on platforms that do not support Dev Drives. See `the Windows documentation <https://learn.microsoft.com/windows/dev-drive/>`_ for information on enabling and creating Dev Drives.
pt_br: Pode levantar um erro para um caminho inválido, por exemplo, um sem uma unidade reconhecível, mas retorna ``False`` em plataformas que não provêm suporte a Dev Drives. Consulte `a documentação do Windows <https://learn.microsoft.com/windows/dev-drive/>`_ para obter informações sobre como habilitar e criar Dev Drives.

source: The function is now available on all platforms, and will always return ``False`` on those that have no support for Dev Drives
pt_br: A função já está disponível em todas as plataformas, e sempre retornará ``False`` naquelas que não possuem suporte para Dev Drives

source: Return ``True`` if *path* is a reserved pathname on the current system.
pt_br: Retorna ``True`` se *path* for um caminho reservado no sistema atual.

source: On Windows, reserved filenames include those that end with a space or dot; those that contain colons (i.e. file streams such as "name:stream"), wildcard characters (i.e. ``'*?"<>'``), pipe, or ASCII control characters; as well as DOS device names such as "NUL", "CON", "CONIN$", "CONOUT$", "AUX", "PRN", "COM1", and "LPT1".
pt_br: No Windows, os nomes de arquivos reservados incluem aqueles que terminam com espaço ou ponto; aqueles que contêm dois pontos (ou seja, fluxos de arquivos como "nome:fluxo"), caracteres curinga (ou seja, ``'*?"<>'``), encadeamento (pipe) ou caracteres de controle ASCII; bem como nomes de dispositivos DOS, como "NUL", "CON", "CONIN$", "CONOUT$", "AUX", "PRN", "COM1" e "LPT1".

source: This function approximates rules for reserved paths on most Windows systems. These rules change over time in various Windows releases. This function may be updated in future Python releases as changes to the rules become broadly available.
pt_br: Esta função aproxima regras para caminhos reservados na maioria dos sistemas Windows. Essas regras mudam com o tempo em diversas versões do Windows. Esta função pode ser atualizada em versões futuras do Python à medida que as alterações nas regras se tornarem amplamente disponíveis.

source: Availability
pt_br: Disponibilidade

source: Join one or more path segments intelligently. The return value is the concatenation of *path* and all members of *\*paths*, with exactly one directory separator following each non-empty part, except the last. That is, the result will only end in a separator if the last part is either empty or ends in a separator. If a segment is an absolute path (which on Windows requires both a drive and a root), then all previous segments are ignored and joining continues from the absolute path segment.
pt_br: Junta um ou mais segmentos do caminho de forma inteligente. O valor de retorno é a concatenação de *path* e todos os membros de *\*paths* com exatamente um separador de diretório seguindo cada parte não vazia exceto a última. Significa que o resultado só terminará em um separador se a última parte estiver vazia ou terminar em um separador. Se um segmento for um caminho absoluto (que no Windows requer a unidade/drive e uma raiz), todos os segmentos anteriores serão ignorados e a união continuará a partir do segmento do caminho absoluto.

source: On Windows, the drive is not reset when a rooted path segment (e.g., ``r'\foo'``) is encountered. If a segment is on a different drive or is an absolute path, all previous segments are ignored and the drive is reset. Note that since there is a current directory for each drive, ``os.path.join("c:", "foo")`` represents a path relative to the current directory on drive :file:`C:` (:file:`c:foo`), not :file:`c:\\foo`.
pt_br: No Windows, a unidade não é redefinida quando um segmento de caminho raiz (por exemplo, ``r'\foo'``) é encontrado. Se um segmento contiver uma unidade diferente ou um caminho absoluto, todos os segmentos anteriores serão ignorados e a unidade será redefinida. Observe que, como há um diretório atual para cada unidade, ``os.path.join("c:", "foo")`` representa um caminho relativo ao diretório atual na unidade :file:`C:` (:file:`c:foo`), e não :file:`c:\\foo`.

source: Accepts a :term:`path-like object` for *path* and *paths*.
pt_br: Aceita um :term:`objeto caminho ou similar` para *path* e *paths*.

source: Normalize the case of a pathname. On Windows, convert all characters in the pathname to lowercase, and also convert forward slashes to backward slashes. On other operating systems, return the path unchanged.
pt_br: Normaliza o estado de letras maiúsculas/minúsculas de um nome de caminho. No Windows, converte todos os caracteres do nome do caminho em minúsculas e também converte barras normais em barras invertidas. Em outros sistemas operacionais, retorna o caminho inalterado.

source: Normalize a pathname by collapsing redundant separators and up-level references so that ``A//B``, ``A/B/``, ``A/./B`` and ``A/foo/../B`` all become ``A/B``. This string manipulation may change the meaning of a path that contains symbolic links. On Windows, it converts forward slashes to backward slashes. To normalize case, use :func:`normcase`.
pt_br: Normaliza um nome de caminho retirando separadores redundantes e referências de nível superior para que ``A//B``, ``A/B/``, ``A/./B`` e ``A/foo/../B`` todos se tornem ``A/B``. Essa manipulação de string pode mudar o significado de um caminho que contém links simbólicos. No Windows, ele converte barras normais em barras invertidas. Para normalizar o estado de letras maiúsculas/minúsculas, use :func:`normcase`.

source: On POSIX systems, in accordance with `IEEE Std 1003.1 2013 Edition; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_, if a pathname begins with exactly two slashes, the first component following the leading characters may be interpreted in an implementation-defined manner, although more than two leading characters shall be treated as a single character.
pt_br: Em sistemas POSIX, de acordo com `IEEE Std 1003.1 2013 Edition; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_, se um nome de caminho começa com exatamente duas barras, o primeiro componente após os caracteres iniciais pode ser interpretado em um forma definida pela implementação, embora mais de dois caracteres iniciais devam ser tratados como um único caractere.
