Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: Open a pipe to or from command *cmd*. The return value is an open file object connected to the pipe, which can be read or written depending on whether *mode* is ``'r'`` (default) or ``'w'``. The *buffering* argument have the same meaning as the corresponding argument to the built-in :func:`open` function. The returned file object reads or writes text strings rather than bytes.
pt_br: Abre um encadeamento, também conhecido como "pipe", de ou para o comando *cmd*. O valor de retorno é um objeto arquivo aberto conectado ao encadeamento, que pode ser lido ou escrito dependendo se *mode* é ``'r'`` (padrão) ou ``'w'``. O argumento *buffering* tem o mesmo significado que o argumento correspondente para a função embutida :func:`open`. O objeto arquivo retornado lê ou escreve strings de texto em vez de bytes.

source: The ``close`` method returns :const:`None` if the subprocess exited successfully, or the subprocess's return code if there was an error. On POSIX systems, if the return code is positive it represents the return value of the process left-shifted by one byte. If the return code is negative, the process was terminated by the signal given by the negated value of the return code. (For example, the return value might be ``- signal.SIGKILL`` if the subprocess was killed.) On Windows systems, the return value contains the signed integer return code from the child process.
pt_br: O método ``close`` retorna :const:`None` se o subprocesso foi encerrado com sucesso, ou o código de retorno do subprocesso se houve um erro. Em sistemas POSIX, se o código de retorno for positivo, ele representa o valor de retorno do processo deslocado para a esquerda em um byte. Se o código de retorno for negativo, o processo foi encerrado pelo sinal dado pelo valor negado do código de retorno. (Por exemplo, o valor de retorno pode ser ``- signal.SIGKILL`` se o subprocesso foi eliminado.) Em sistemas Windows, o valor de retorno contém o código de retorno inteiro com sinal do processo filho.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the ``close`` method result (exit status) into an exit code if it is not ``None``. On Windows, the ``close`` method result is directly the exit code (or ``None``).
pt_br: No Unix, :func:`waitstatus_to_exitcode` pode ser usado para converter o resultado do método ``close`` (status de saída) em um código de saída se não for ``None``. No Windows, o resultado do método ``close`` é diretamente o código de saída (ou ``None``).

source: This is implemented using :class:`subprocess.Popen`; see that class's documentation for more powerful ways to manage and communicate with subprocesses.
pt_br: Isso é implementado usando :class:`subprocess.Popen`; consulte a documentação desta classe para maneiras mais poderosas de gerenciar e se comunicar com subprocessos.

source: The :ref:`Python UTF-8 Mode <utf8-mode>` affects encodings used for *cmd* and pipe contents.
pt_br: O :ref:`Modo UTF-8 do Python <utf8-mode>` afeta as codificações usadas para *cmd* e conteúdo de encadeamento.

source: :func:`popen` is a simple wrapper around :class:`subprocess.Popen`. Use :class:`subprocess.Popen` or :func:`subprocess.run` to control options like encodings.
pt_br: :func:`popen` é um wrapper simples em torno de :class:`subprocess.Popen`. Use :class:`subprocess.Popen` ou :func:`subprocess.run` para controlar opções como codificações.

source: The function is :term:`soft deprecated` and should no longer be used to write new code. The :mod:`subprocess` module is recommended instead.
pt_br: A função está :term:`suavemente descontinuada <suavemente descontinuado>` e não deve mais ser usada para escrever novos códigos. O módulo :mod:`subprocess` é recomendado em vez disso.

source: Wraps the :c:func:`!posix_spawn` C library API for use from Python.
pt_br: Envolve a API da biblioteca C :c:func:`!posix_spawn` para uso em Python.

source: Most users should use :func:`subprocess.run` instead of :func:`posix_spawn`.
pt_br: A maioria dos usuários deveria usar :func:`subprocess.run` em vez de :func:`posix_spawn`.

source: The positional-only arguments *path*, *args*, and *env* are similar to :func:`execve`. *env* is allowed to be ``None``, in which case current process' environment is used.
pt_br: Os argumentos somente-posicional *path*, *args*, e *env* são similares a :func:`execve`. *env* pode ser ``None``, caso em que o ambiente do processo atual é usado.

source: The *path* parameter is the path to the executable file. The *path* should contain a directory. Use :func:`posix_spawnp` to pass an executable file without directory.
pt_br: O parâmetro *path* é o caminho para o arquivo executável. O *path* deve conter um diretório. Use :func:`posix_spawnp` para passar um arquivo executável sem diretório.

source: The *file_actions* argument may be a sequence of tuples describing actions to take on specific file descriptors in the child process between the C library implementation's :c:func:`fork` and :c:func:`exec` steps. The first item in each tuple must be one of the three type indicator listed below describing the remaining tuple elements:
pt_br: O argumento *file_actions* pode ser uma sequência de tuplas descrevendo ações a serem tomadas em descritores de arquivo específicos no processo filho entre as etapas :c:func:`fork` e :c:func:`exec` de implementação da biblioteca C. O primeiro item em cada tupla deve ser um dos três indicadores de tipo listados abaixo, descrevendo os elementos restantes da tupla:

source: Performs ``os.dup2(os.open(path, flags, mode), fd)``.
pt_br: Efetua ``os.dup2(os.open(path, flags, mode), fd)``.

source: Performs ``os.close(fd)``.
pt_br: Efetua ``os.close(fd)``.

source: Performs ``os.dup2(fd, new_fd)``.
pt_br: Efetua ``os.dup2(fd, new_fd)``.

source: Performs ``os.closerange(fd, INF)``.
pt_br: Efetua ``os.closerange(fd, INF)``.

source: These tuples correspond to the C library :c:func:`!posix_spawn_file_actions_addopen`, :c:func:`!posix_spawn_file_actions_addclose`, :c:func:`!posix_spawn_file_actions_adddup2`, and :c:func:`!posix_spawn_file_actions_addclosefrom_np` API calls used to prepare for the :c:func:`!posix_spawn` call itself.
pt_br: Estas tuplas correspondem a chamadas de API da biblioteca C de :c:func:`!posix_spawn_file_actions_addopen`, :c:func:`!posix_spawn_file_actions_addclose`, :c:func:`!posix_spawn_file_actions_adddup2` e :c:func:`!posix_spawn_file_actions_addclosefrom_np` usadas para preparar para a chamada de :c:func:`!posix_spawn` em si.

source: The *setpgroup* argument will set the process group of the child to the value specified. If the value specified is 0, the child's process group ID will be made the same as its process ID. If the value of *setpgroup* is not set, the child will inherit the parent's process group ID. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_SETPGROUP` flag.
pt_br: O argumento *setpgroup* definirá o grupo de processos do filho para o valor especificado. Se o valor especificado for 0, o ID do grupo de processo filho será igual ao ID do processo. Se o valor de *setpgroup* não for definido, o filho herdará o ID do grupo de processos do pai. Este argumento corresponde ao sinalizador :c:macro:`!POSIX_SPAWN_SETPGROUP` da biblioteca C.

source: If the *resetids* argument is ``True`` it will reset the effective UID and GID of the child to the real UID and GID of the parent process. If the argument is ``False``, then the child retains the effective UID and GID of the parent. In either case, if the set-user-ID and set-group-ID permission bits are enabled on the executable file, their effect will override the setting of the effective UID and GID. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_RESETIDS` flag.
pt_br: Se o argumento *resetids* for ``True``, ele irá reconfigurar o UID e GID efetivos do filho para o UID e GID reais do processo pai. Se o argumento for ``False``, então o filho retém o UID e GID efetivos do pai. Em ambos os casos, se os bits de permissão set-user-ID e set-group-ID estiverem habilitados no arquivo executável, seu efeito vai substituir a configuração do UID e GID efetivos. Este argumento corresponde ao sinalizador :c:macro:`!POSIX_SPAWN_RESETIDS` da biblioteca C.

source: If the *setsid* argument is ``True``, it will create a new session ID for ``posix_spawn``. *setsid* requires :c:macro:`!POSIX_SPAWN_SETSID` or :c:macro:`!POSIX_SPAWN_SETSID_NP` flag. Otherwise, :exc:`NotImplementedError` is raised.
pt_br: Se o argumento *setsid* for ``True``, ele criará um novo ID de sessão para ``posix_spawn``. *setsid* requer :c:macro:`!POSIX_SPAWN_SETSID` ou :c:macro:`!POSIX_SPAWN_SETSID_NP`. Caso contrário, :exc:`NotImplementedError` é levantada.

source: The *setsigmask* argument will set the signal mask to the signal set specified. If the parameter is not used, then the child inherits the parent's signal mask. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_SETSIGMASK` flag.
pt_br: O argumento *setsigmask* definirá a máscara de sinal para o conjunto de sinais especificado. Se o parâmetro não for usado, o filho herda a máscara de sinal do pai. Este argumento corresponde ao sinalizador :c:macro:`!POSIX_SPAWN_SETSIGMASK` da biblioteca C.

source: The *sigdef* argument will reset the disposition of all signals in the set specified. This argument corresponds to the C library :c:macro:`!POSIX_SPAWN_SETSIGDEF` flag.
pt_br: O argumento *sigdef* redefinirá a disposição de todos os sinais no conjunto especificado. Este argumento corresponde ao sinalizador :c:macro:`!POSIX_SPAWN_SETSIGDEF` da biblioteca C.

source: The *scheduler* argument must be a tuple containing the (optional) scheduler policy and an instance of :class:`sched_param` with the scheduler parameters. A value of ``None`` in the place of the scheduler policy indicates that is not being provided. This argument is a combination of the C library :c:macro:`!POSIX_SPAWN_SETSCHEDPARAM` and :c:macro:`!POSIX_SPAWN_SETSCHEDULER` flags.
pt_br: O argumento *scheduler* deve ser uma tupla contendo a política do agendador (opcional) e uma instância de :class:`sched_param` com os parâmetros do agendador. Um valor ``None`` no lugar da política do agendador indica que a política não está sendo fornecido. Este argumento é uma combinação dos sinalizadores :c:macro:`!POSIX_SPAWN_SETSCHEDPARAM` e :c:macro:`!POSIX_SPAWN_SETSCHEDULER` da biblioteca C.

source: Raises an :ref:`auditing event <auditing>` ``os.posix_spawn`` with arguments ``path``, ``argv``, ``env``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.posix_spawn`` com os argumentos ``path``, ``argv`` e ``env``.

source: *env* parameter accepts ``None``. ``os.POSIX_SPAWN_CLOSEFROM`` is available on platforms where :c:func:`!posix_spawn_file_actions_addclosefrom_np` exists.
pt_br: o parâmetro *env* pode ser ``None``. ``os.POSIX_SPAWN_CLOSEFROM`` está disponível nas plataformas onde :c:func:`!posix_spawn_file_actions_addclosefrom_np` existe.

source: Wraps the :c:func:`!posix_spawnp` C library API for use from Python.
pt_br: Envolve a API da biblioteca C :c:func:`!posix_spawnp` para uso em Python.

source: Similar to :func:`posix_spawn` except that the system searches for the *executable* file in the list of directories specified by the :envvar:`PATH` environment variable (in the same way as for ``execvp(3)``).
pt_br: Semelhante a :func:`posix_spawn` exceto que o sistema procura o arquivo *executable* na lista de diretórios especificados pela variável de ambiente :envvar:`PATH` (da mesma forma que para ``execvp(3)``).

source: See :func:`posix_spawn` documentation.
pt_br: Veja a documentação de :func:`posix_spawn`.

source: Register callables to be executed when a new child process is forked using :func:`os.fork` or similar process cloning APIs. The parameters are optional and keyword-only. Each specifies a different call point.
pt_br: Registra chamáveis a serem executados quando um novo processo filho é criado usando :func:`os.fork` ou APIs de clonagem de processos semelhantes. Os parâmetros são opcionais e somente-nomeados. Cada um especifica um ponto de chamada diferente.

source: *before* is a function called before forking a child process.
pt_br: *before* é uma função chamada antes de criar um processo filho.

source: *after_in_parent* is a function called from the parent process after forking a child process.
pt_br: *after_in_parent* é uma função chamada a partir do processo pai após criar um processo filho.

source: *after_in_child* is a function called from the child process.
pt_br: *after_in_child* é uma função chamada a partir do processo filho.

source: These calls are only made if control is expected to return to the Python interpreter. A typical :mod:`subprocess` launch will not trigger them as the child is not going to re-enter the interpreter.
pt_br: Essas chamadas são feitas apenas se o controle deve retornar ao interpretador Python. Um lançamento típico de :mod:`subprocess` não irá acioná-los, pois o filho não entrará novamente no interpretador.

source: Functions registered for execution before forking are called in reverse registration order. Functions registered for execution after forking (either in the parent or in the child) are called in registration order.
pt_br: As funções registradas para execução antes de criar um processo filho são chamadas na ordem de registro reversa. As funções registradas para execução após o processo filho ser criado (no pai ou no filho) são chamadas na ordem de registro.

source: Note that :c:func:`fork` calls made by third-party C code may not call those functions, unless it explicitly calls :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
pt_br: Note que chamadas a :c:func:`fork` feitas por código C de terceiros podem não chamar estas funções, a menos que ele explicitamente chamem :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` e :c:func:`PyOS_AfterFork_Child`.

source: There is no way to unregister a function.
pt_br: Não há uma forma de desfazer o registro de uma função.

source: Execute the program *path* in a new process.
pt_br: Executa o programa *path* em um novo processo.

source: (Note that the :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using these functions. Check especially the :ref:`subprocess-replacements` section.)
pt_br: (Observe que o módulo :mod:`subprocess` fornece recursos mais poderosos para gerar novos processos e recuperar seus resultados; usar esse módulo é preferível a usar essas funções. Verifique especialmente a seção :ref:`subprocess-replacements`.)

source: If *mode* is :const:`P_NOWAIT`, this function returns the process id of the new process; if *mode* is :const:`P_WAIT`, returns the process's exit code if it exits normally, or ``-signal``, where *signal* is the signal that killed the process. On Windows, the process id will actually be the process handle, so can be used with the :func:`waitpid` function.
pt_br: Se *mode* for :const:`P_NOWAIT`, esta função retorna o id do processo do novo processo; se *mode* for :const:`P_WAIT`, retorna o código de saída do processo se ele sair normalmente, ou ``-signal``, onde *signal* é o sinal que matou o processo. No Windows, o id do processo será na verdade o manipulador do processo, portanto, pode ser usado com a função :func:`waitpid`.

source: Note on VxWorks, this function doesn't return ``-signal`` when the new process is killed. Instead it raises OSError exception.
pt_br: Nota sobre VxWorks: esta função não retorna ``-signal`` se o novo processo é interrompido. Em vez disso, ele levanta a exceção OSError.

source: The "l" and "v" variants of the :func:`spawn\* <spawnl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`!spawnl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process must start with the name of the command being run.
pt_br: As variantes "l" e "v" das funções :func:`spawn\* <spawnl>` diferem em como os argumentos de linha de comando são passados. As variantes "l" são talvez as mais fáceis de trabalhar se o número de parâmetros for fixo quando o código for escrito; os parâmetros individuais simplesmente se tornam parâmetros adicionais para as funções :func:`!spawnl\*`. As variantes "v" são boas quando o número de parâmetros é variável, com os argumentos sendo passados em uma lista ou tupla como o parâmetro *args*. Em ambos os casos, os argumentos para o processo filho devem começar com o nome do comando que está sendo executado.

source: The variants which include a second "p" near the end (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, and :func:`spawnvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`spawn\*e <spawnl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`spawnl`, :func:`spawnle`, :func:`spawnv`, and :func:`spawnve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path.
pt_br: As variantes que incluem um segundo "p" próximo ao final (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` e :func:`spawnvpe`) usarão a variável de ambiente :envvar:`PATH` para localizar o programa *file*. Quando o ambiente está sendo substituído (usando uma das variantes :func:`spawn\*e <spawnl>`, discutidas no próximo parágrafo), o novo ambiente é usado como fonte da variável :envvar:`PATH`. As outras variantes, :func:`spawnl`, :func:`spawnle`, :func:`spawnv` e :func:`spawnve`, não usarão a variável :envvar:`PATH` para localizar o executável; *path* deve conter um caminho absoluto ou relativo apropriado.

source: For :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve`, and :func:`spawnvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (they are used instead of the current process' environment); the functions :func:`spawnl`, :func:`spawnlp`, :func:`spawnv`, and :func:`spawnvp` all cause the new process to inherit the environment of the current process. Note that keys and values in the *env* dictionary must be strings; invalid keys or values will cause the function to fail, with a return value of ``127``.
pt_br: Para :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve` e :func:`spawnvpe` (observe que todos eles terminam em "e"), o parâmetro *env* deve ser um mapeamento que é usado para definir as variáveis de ambiente para o novo processo (elas são usadas no lugar do ambiente do processo atual); as funções :func:`spawnl`, :func:`spawnlp`, :func:`spawnv` e :func:`spawnvp` fazem com que o novo processo herde o ambiente do processo atual. Note que as chaves e os valores no dicionário *env* devem ser strings; chaves ou valores inválidos farão com que a função falhe, com um valor de retorno de ``127``.

source: As an example, the following calls to :func:`spawnlp` and :func:`spawnvpe` are equivalent::
pt_br: Como exemplo, as seguintes chamadas a :func:`spawnlp` e :func:`spawnvpe` são equivalentes::

source: Raises an :ref:`auditing event <auditing>` ``os.spawn`` with arguments ``mode``, ``path``, ``args``, ``env``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.spawn`` com os argumentos ``mode``, ``path``, ``args`` e ``env``.

source: :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` and :func:`spawnvpe` are not available on Windows. :func:`spawnle` and :func:`spawnve` are not thread-safe on Windows; we advise you to use the :mod:`subprocess` module instead.
pt_br: :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` e :func:`spawnvpe` não estão disponíveis no Windows. :func:`spawnle` e :func:`spawnve` não são seguros para thread no Windows; recomendamos que você use o módulo :mod:`subprocess`.

source: These functions are :term:`soft deprecated` and should no longer be used to write new code. The :mod:`subprocess` module is recommended instead.
pt_br: Estas funções estão :term:`suavemente descontinuadas <suavemente descontinuado>` e não devem mais ser usadas para escrever novos códigos. O módulo :mod:`subprocess` é recomendado em vez disso.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If either of these values is given, the :func:`spawn\* <spawnl>` functions will return as soon as the new process has been created, with the process id as the return value.
pt_br: Valores possíveis para o parâmetro *mode* para a família de funções :func:`spawn\* <spawnl>`. Se qualquer um desses valores for fornecido, as funções :func:`spawn\* <spawnl>` retornarão assim que o novo processo for criado, com o id do processo como o valor de retorno.

source: Possible value for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If this is given as *mode*, the :func:`spawn\* <spawnl>` functions will not return until the new process has run to completion and will return the exit code of the process the run is successful, or ``-signal`` if a signal kills the process.
pt_br: Valor possível para o parâmetro *mode* para a família de funções :func:`spawn\* <spawnl>`. Se for fornecido como *mode*, as funções :func:`spawn\* <spawnl>` não retornarão até que o novo processo seja executado até a conclusão e retornará o código de saída do processo em que a execução foi bem-sucedida, ou ``-signal`` se um sinal interromper o processo.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. These are less portable than those listed above. :const:`P_DETACH` is similar to :const:`P_NOWAIT`, but the new process is detached from the console of the calling process. If :const:`P_OVERLAY` is used, the current process will be replaced; the :func:`spawn\* <spawnl>` function will not return.
pt_br: Valores possíveis para o parâmetro *mode* para a família de funções :func:`spawn\* <spawnl>`. Eles são menos portáveis do que os listados acima. :const:`P_DETACH` é semelhante a :const:`P_NOWAIT`, mas o novo processo é separado do console do processo de chamada. Se :const:`P_OVERLAY` for usado, o processo atual será substituído; a função :func:`spawn\* <spawnl>` não retornará.

source: Start a file with its associated application.
pt_br: Inicia um arquivo com sua aplicação associada.

source: When *operation* is not specified, this acts like double-clicking the file in Windows Explorer, or giving the file name as an argument to the :program:`start` command from the interactive command shell: the file is opened with whatever application (if any) its extension is associated.
pt_br: Quando *operation* não é especificado, isso atua como um clique duplo no arquivo no Windows Explorer, ou como fornecer o nome do arquivo como um argumento para o comando :program:`start` do console interativo de comandos: o arquivo é aberto com qualquer aplicação (se houver) com a extensão associada.
