Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: :mod:`!os` --- Miscellaneous operating system interfaces
pt_br: :mod:`!os` --- Diversas interfaces de sistema operacional

source: **Source code:** :source:`Lib/os.py`
pt_br: **Código-fonte:** :source:`Lib/os.py`

source: This module provides a portable way of using operating system dependent functionality. If you just want to read or write a file see :func:`open`, if you want to manipulate paths, see the :mod:`os.path` module, and if you want to read all the lines in all the files on the command line see the :mod:`fileinput` module. For creating temporary files and directories see the :mod:`tempfile` module, and for high-level file and directory handling see the :mod:`shutil` module.
pt_br: Este módulo fornece uma maneira simples de usar funcionalidades que são dependentes de sistema operacional. Se você quiser ler ou escrever um arquivo, veja :func:`open`; se o que quer é manipular estruturas de diretórios, veja o módulo :mod:`os.path`; e se quiser ler todas as linhas, de todos os arquivos na linha de comando, veja o módulo :mod:`fileinput`. Para criar arquivos e diretórios temporários, veja o módulo :mod:`tempfile`; e, para manipulação em alto nível de arquivos e diretórios, veja o módulo :mod:`shutil`.

source: Notes on the availability of these functions:
pt_br: Notas sobre a disponibilidade dessas funções:

source: The design of all built-in operating system dependent modules of Python is such that as long as the same functionality is available, it uses the same interface; for example, the function ``os.stat(path)`` returns stat information about *path* in the same format (which happens to have originated with the POSIX interface).
pt_br: O modelo dos módulos embutidos dependentes do sistema operacional no Python é tal que, desde que a mesma funcionalidade esteja disponível, a mesma interface é usada; por exemplo, a função ``os.stat(path)`` retorna informações estatísticas sobre *path* no mesmo formato (que é originado com a interface POSIX).

source: Extensions peculiar to a particular operating system are also available through the :mod:`os` module, but using them is of course a threat to portability.
pt_br: Extensões específicas a um sistema operacional também estão disponíveis através do módulo :mod:`os`, mas usá-las é, naturalmente, uma ameaça à portabilidade.

source: All functions accepting path or file names accept both bytes and string objects, and result in an object of the same type, if a path or file name is returned.
pt_br: Todas as funções que aceitam nomes de caminhos ou arquivos, aceitam objetos bytes e string, e resultam em um objeto do mesmo tipo, se um caminho ou nome de arquivo for retornado.

source: On VxWorks, os.popen, os.fork, os.execv and os.spawn*p* are not supported.
pt_br: Em VxWorks, os.popen, os.fork, os.execv e os.spawn*p* não são suportados.

source: On WebAssembly platforms, Android and iOS, large parts of the :mod:`os` module are not available or behave differently. APIs related to processes (e.g. :func:`~os.fork`, :func:`~os.execve`) and resources (e.g. :func:`~os.nice`) are not available. Others like :func:`~os.getuid` and :func:`~os.getpid` are emulated or stubs. WebAssembly platforms also lack support for signals (e.g. :func:`~os.kill`, :func:`~os.wait`).
pt_br: Nas plataformas WebAssembly, Android e iOS, grandes partes do módulo :mod:`os` não estão disponíveis ou se comportam de maneira diferente. APIs relacionadas a processos (por exemplo, :func:`~os.fork`, :func:`~os.execve`) e recursos (por exemplo, :func:`~os.nice`) não estão disponíveis. Outros como :func:`~os.getuid` e :func:`~os.getpid` são emulados ou stubs. As plataformas WebAssembly também não possuem suporte para sinais (por exemplo, :func:`~os.kill`, :func:`~os.wait`).

source: All functions in this module raise :exc:`OSError` (or subclasses thereof) in the case of invalid or inaccessible file names and paths, or other arguments that have the correct type, but are not accepted by the operating system.
pt_br: Todas as funções neste módulo levantam :exc:`OSError` (ou suas subclasses) no caso de nomes e caminhos de arquivos inválidos ou inacessíveis, ou outros argumentos que possuem o tipo correto, mas não são aceitos pelo sistema operacional.

source: An alias for the built-in :exc:`OSError` exception.
pt_br: Um apelido para a exceção embutida :exc:`OSError`.

source: The name of the operating system dependent module imported. The following names have currently been registered: ``'posix'``, ``'nt'``, ``'java'``.
pt_br: O nome do módulo importado, dependente do sistema operacional. Atualmente, os seguintes nomes foram registrados: ``'posix'``, ``'nt'``, ``'java'``.

source: :data:`sys.platform` has a finer granularity. :func:`os.uname` gives system-dependent version information.
pt_br: :data:`sys.platform` tem uma granularidade mais fina. :func:`os.uname` fornece informações de versão específicas do sistema.

source: The :mod:`platform` module provides detailed checks for the system's identity.
pt_br: O módulo :mod:`platform` fornece verificações detalhadas sobre a identificação do sistema.

source: File Names, Command Line Arguments, and Environment Variables
pt_br: Nomes de arquivos, argumentos de linha de comando e variáveis de ambiente

source: In Python, file names, command line arguments, and environment variables are represented using the string type. On some systems, decoding these strings to and from bytes is necessary before passing them to the operating system. Python uses the :term:`filesystem encoding and error handler` to perform this conversion (see :func:`sys.getfilesystemencoding`).
pt_br: No Python, nomes de arquivos, argumentos da linha de comando, e variáveis de ambiente são representadas usando o tipo string. Em alguns sistemas, decodificar essas strings de e para bytes é necessário antes de passá-las para o sistema operacional. Python usa o :term:`tratador de erros e codificação do sistema de arquivos` para realizar essa conversão (veja :func:`sys.getfilesystemencoding`).

source: The :term:`filesystem encoding and error handler` are configured at Python startup by the :c:func:`PyConfig_Read` function: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
pt_br: O :term:`tratador de erros e codificação do sistema de arquivos` são configurados na inicialização do Python pela função :c:func:`PyConfig_Read`: veja os membros :c:member:`~PyConfig.filesystem_encoding` e :c:member:`~PyConfig.filesystem_errors` do :c:type:`PyConfig`.

source: On some systems, conversion using the file system encoding may fail. In this case, Python uses the :ref:`surrogateescape encoding error handler <surrogateescape>`, which means that undecodable bytes are replaced by a Unicode character U+DC\ *xx* on decoding, and these are again translated to the original byte on encoding.
pt_br: Em alguns sistemas a conversão, usando a codificação do sistema de arquivos, pode falhar. Neste caso, Python usa o :ref:`manipulador de erro de codificação surrogateescape <surrogateescape>`, o que significa que bytes não decodificados são substituídos por um caractere Unicode U+DC\ *xx* na decodificação, e estes são novamente traduzidos para o byte original na codificação.

source: The :term:`file system encoding <filesystem encoding and error handler>` must guarantee to successfully decode all bytes below 128. If the file system encoding fails to provide this guarantee, API functions can raise :exc:`UnicodeError`.
pt_br: A :term:`codificação de sistema de arquivos <filesystem encoding and error handler>` precisa garantir que todos os bytes abaixo de 128 serão decodificados com sucesso. Se a codificação do sistemas de arquivos falhar em garantir isso, funções de API podem levantar :exc:`UnicodeError`.

source: See also the :term:`locale encoding`.
pt_br: Veja também a :term:`codificação da localidade`.

source: Python UTF-8 Mode
pt_br: Modo UTF-8 do Python

source: See :pep:`540` for more details.
pt_br: Veja :pep:`540` para mais detalhes.

source: The Python UTF-8 Mode ignores the :term:`locale encoding` and forces the usage of the UTF-8 encoding:
pt_br: O Modo UTF-8 do Python ignora a :term:`codificação da localidade` e força o uso da codificação UTF-8:

source: Use UTF-8 as the :term:`filesystem encoding <filesystem encoding and error handler>`.
pt_br: Usa UTF-8 como a :term:`codificação do sistema de arquivos <filesystem encoding and error handler>`.

source: :func:`sys.getfilesystemencoding` returns ``'utf-8'``.
pt_br: :func:`sys.getfilesystemencoding` retorna ``'utf-8'``.

source: :func:`locale.getpreferredencoding` returns ``'utf-8'`` (the *do_setlocale* argument has no effect).
pt_br: :func:`locale.getpreferredencoding` retorna ``'utf-8'`` (o argumento *do_setlocale* não causa efeito).

source: :data:`sys.stdin`, :data:`sys.stdout`, and :data:`sys.stderr` all use UTF-8 as their text encoding, with the ``surrogateescape`` :ref:`error handler <error-handlers>` being enabled for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in the default locale-aware mode)
pt_br: :data:`sys.stdin`, :data:`sys.stdout` e :data:`sys.stderr` usam UTF-8 como codificação de texto, com o :ref:`tratador de erros <error-handlers>` ``surrogateescape`` sendo habilitado para :data:`sys.stdin` e :data:`sys.stdout` (:data:`sys.stderr` continua a usar ``backslashreplace`` como faz no modo padrão com reconhecimento de localidade)

source: On Unix, :func:`os.device_encoding` returns ``'utf-8'`` rather than the device encoding.
pt_br: No Unix, :func:`os.device_encoding` retorna ``'utf-8'`` invés da codificação do dispositivo.

source: Note that the standard stream settings in UTF-8 mode can be overridden by :envvar:`PYTHONIOENCODING` (just as they can be in the default locale-aware mode).
pt_br: Observe que as configurações de fluxo padrão no modo UTF-8 podem ser substituídas por :envvar:`PYTHONIOENCODING` (assim como podem estar no modo com reconhecimento de localidade padrão).

source: As a consequence of the changes in those lower level APIs, other higher level APIs also exhibit different default behaviours:
pt_br: Como consequência das mudanças nessas APIs de baixo nível, outras APIs de alto nível também exibem comportamentos padrões diferentes:

source: Command line arguments, environment variables and filenames are decoded to text using the UTF-8 encoding.
pt_br: Argumentos de linha de comando, variáveis de ambiente e nomes de arquivos são decodificados em texto usando a codificação UTF-8.

source: :func:`os.fsdecode` and :func:`os.fsencode` use the UTF-8 encoding.
pt_br: :func:`os.fsdecode` e :func:`os.fsencode` usam a codificação UTF-8.

source: :func:`open`, :func:`io.open`, and :func:`codecs.open` use the UTF-8 encoding by default. However, they still use the strict error handler by default so that attempting to open a binary file in text mode is likely to raise an exception rather than producing nonsense data.
pt_br: :func:`open`, :func:`io.open` e :func:`codecs.open` usam a codificação UTF-8 por padrão. No entanto, elas ainda usam o tratador de erros estrito por padrão, de modo que a tentativa de abrir um arquivo binário no modo de texto provavelmente levantará uma exceção em vez de produzir dados sem sentido.

source: The :ref:`Python UTF-8 Mode <utf8-mode>` is enabled if the LC_CTYPE locale is ``C`` or ``POSIX`` at Python startup (see the :c:func:`PyConfig_Read` function).
pt_br: O :ref:`Modo UTF-8 do Python <utf8-mode>` está habilitado se a localidade LC_CTYPE for ``C`` ou ``POSIX`` na inicialização do Python (veja a função :c:func:`PyConfig_Read`).

source: It can be enabled or disabled using the :option:`-X utf8 <-X>` command line option and the :envvar:`PYTHONUTF8` environment variable.
pt_br: Ele pode ser habilitado ou desabilitado utilizando a opção :option:`-X utf8 <-X>` da linha de comando e a variável de ambiente :envvar:`PYTHONUTF8`.

source: If the :envvar:`PYTHONUTF8` environment variable is not set at all, then the interpreter defaults to using the current locale settings, *unless* the current locale is identified as a legacy ASCII-based locale (as described for :envvar:`PYTHONCOERCECLOCALE`), and locale coercion is either disabled or fails. In such legacy locales, the interpreter will default to enabling UTF-8 mode unless explicitly instructed not to do so.
pt_br: Se a variável de ambiente :envvar:`PYTHONUTF8` não está com valor definido, então o interpretador usa por padrão a configuração de localidade atual, *a menos que* a localidade atual esteja identificada como uma localidade legada baseada em ASCII (como descrita para :envvar:`PYTHONCOERCECLOCALE`), e a coerção de localidade estiver desabilitada ou falhar. Nessas localidades legadas, o interpretador irá habilitar por padrão o modo UTF-8 a menos que seja explicitamente instruído para não fazer isso.

source: The Python UTF-8 Mode can only be enabled at the Python startup. Its value can be read from :data:`sys.flags.utf8_mode <sys.flags>`.
pt_br: O Modo UTF-8 do Python só pode ser ativado na inicialização do Python. Seu valor pode ser lido de :data:`sys.flags.utf8_mode <sys.flags>`.

source: See also the :ref:`UTF-8 mode on Windows <win-utf8-mode>` and the :term:`filesystem encoding and error handler`.
pt_br: Veja também o :ref:`modo UTF-8 no Windows <win-utf8-mode>` e o :term:`tratador de erros e codificação do sistema de arquivos`.

source: Python 3.15 will make :ref:`utf8-mode` default.
pt_br: Python 3.15 utilizará :ref:`utf8-mode` por padrão.

source: Process Parameters
pt_br: Parâmetros de processo

source: These functions and data items provide information and operate on the current process and user.
pt_br: Essas funções e itens de dados fornecem informações e operam no processo e usuário atuais.

source: Return the filename corresponding to the controlling terminal of the process.
pt_br: Retorna o nome do arquivo correspondente ao terminal de controle do processo.

source: Availability
pt_br: Disponibilidade

source: A :term:`mapping` object where keys and values are strings that represent the process environment. For example, ``environ['HOME']`` is the pathname of your home directory (on some platforms), and is equivalent to ``getenv("HOME")`` in C.
pt_br: Um objeto :term:`mapeamento` onde as chaves e valores são strings que representam o ambiente do processo. Por exemplo, ``environ['HOME']`` é o nome do caminho do seu diretório pessoal (em algumas plataformas), e é equivalente a ``getenv("HOME")`` em C.

source: This mapping is captured the first time the :mod:`os` module is imported, typically during Python startup as part of processing :file:`site.py`. Changes to the environment made after this time are not reflected in :data:`os.environ`, except for changes made by modifying :data:`os.environ` directly.
pt_br: Este mapeamento é capturado na primeira vez que o módulo :mod:`os` é importado, normalmente durante a inicialização do Python, como parte do processamento do arquivo :file:`site.py`. Mudanças no ambiente feitas após esse momento não são refletidas em :data:`os.environ`, exceto pelas mudanças feitas modificando :data:`os.environ` diretamente.

source: This mapping may be used to modify the environment as well as query the environment. :func:`putenv` will be called automatically when the mapping is modified.
pt_br: Este mapeamento pode ser usado para modificar o ambiente, além de consultá-lo. :func:`putenv` será chamado automaticamente quando o mapeamento for modificado.

source: On Unix, keys and values use :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :data:`environb` if you would like to use a different encoding.
pt_br: No Unix, chaves e valores usam :func:`sys.getfilesystemencoding` e o tratador de erros ``'surrogateescape'``. Use :data:`environb` se quiser usar uma codificação diferente.

source: On Windows, the keys are converted to uppercase. This also applies when getting, setting, or deleting an item. For example, ``environ['monty'] = 'python'`` maps the key ``'MONTY'`` to the value ``'python'``.
pt_br: No Windows, as chaves são convertidas em maiúsculas. Isso também se aplica ao obter, definir ou excluir um item. Por exemplo, ``environ['monty'] = 'python'`` mapeia a chave ``'MONTY'`` para o valor ``'python'``.

source: Calling :func:`putenv` directly does not change :data:`os.environ`, so it's better to modify :data:`os.environ`.
pt_br: Chamar a função :func:`putenv` diretamente não muda :data:`os.environ`, por isso é melhor modificar :data:`os.environ`.

source: On some platforms, including FreeBSD and macOS, setting ``environ`` may cause memory leaks. Refer to the system documentation for :c:func:`!putenv`.
pt_br: Em algumas plataformas, incluindo FreeBSD e Mac OS X, a modificação de ``environ`` pode causar vazamentos de memória. Consulte a documentação do sistema para :c:func:`!putenv`.

source: You can delete items in this mapping to unset environment variables. :func:`unsetenv` will be called automatically when an item is deleted from :data:`os.environ`, and when one of the :meth:`pop` or :meth:`clear` methods is called.
pt_br: Você pode excluir itens neste mapeamento para remover definição de variáveis de ambiente. :func:`unsetenv` será chamado automaticamente quando um item é excluído de :data:`os.environ`, e quando um dos métodos :meth:`pop` ou :meth:`clear` é chamado.

source: The :func:`os.reload_environ` function.
pt_br: A função :func:`os.reload_environ`.

source: Updated to support :pep:`584`'s merge (``|``) and update (``|=``) operators.
pt_br: Atualizado para ter suporte os operadores de mesclagem (``|``) e de atualização (``|=``) da :pep:`584`.

source: Bytes version of :data:`environ`: a :term:`mapping` object where both keys and values are :class:`bytes` objects representing the process environment. :data:`environ` and :data:`environb` are synchronized (modifying :data:`environb` updates :data:`environ`, and vice versa).
pt_br: Versão bytes de :data:`environ`: um objeto de :term:`mapeamento <mapping>` onde as chaves e valores são objetos :class:`bytes` representando o ambiente do processo. :data:`environ` e :data:`environb` são sincronizados (modificar :data:`environb` atualiza :data:`environ`, e vice versa).

source: :data:`environb` is only available if :const:`supports_bytes_environ` is ``True``.
pt_br: :data:`environb` está disponível somente se :const:`supports_bytes_environ` for ``True``.

source: The :data:`os.environ` and :data:`os.environb` mappings are a cache of environment variables at the time that Python started. As such, changes to the current process environment are not reflected if made outside Python, or by :func:`os.putenv` or :func:`os.unsetenv`. Use :func:`!os.reload_environ` to update :data:`os.environ` and :data:`os.environb` with any such changes to the current process environment.
pt_br: Os mapeamentos :data:`os.environ` e :data:`os.environb` são um cache de variáveis de ambiente no momento em que o Python foi iniciado. Dessa forma, alterações no ambiente do processo atual não são refletidas se feitas fora do Python, ou por :func:`os.putenv` ou :func:`os.unsetenv`. Use :func:`!os.reload_environ` para atualizar :data:`os.environ` e :data:`os.environb` com quaisquer alterações no ambiente do processo atual.

source: This function is not thread-safe. Calling it while the environment is being modified in an other thread is an undefined behavior. Reading from :data:`os.environ` or :data:`os.environb`, or calling :func:`os.getenv` while reloading, may return an empty result.
pt_br: Esta função não é segura para thread. Chamá-la enquanto o ambiente está sendo modificado em outra thread é um comportamento indefinido. Ler de :data:`os.environ` ou :data:`os.environb`, ou chamar :func:`os.getenv` durante o recarregamento, pode retornar um resultado vazio.

source: These functions are described in :ref:`os-file-dir`.
pt_br: Essas funções são descritas em: :ref:`os-file-dir`.

source: Encode :term:`path-like <path-like object>` *filename* to the :term:`filesystem encoding and error handler`; return :class:`bytes` unchanged.
pt_br: Codifica o *filename* :term:`caminho ou similar <path-like object>` para :term:`tratador de erros e codificação do sistema de arquivos`; retorna :class:`bytes` inalterados.

source: :func:`fsdecode` is the reverse function.
pt_br: :func:`fsdecode` é a função inversa.

source: Support added to accept objects implementing the :class:`os.PathLike` interface.
pt_br: Adicionado suporte para aceitar objetos que implementam a interface :class:`os.PathLike`.

source: Decode the :term:`path-like <path-like object>` *filename* from the :term:`filesystem encoding and error handler`; return :class:`str` unchanged.
pt_br: Decodifica o :term:`objeto caminho ou similar <path-like object>` *filename* do :term:`tratador de erros e codificação do sistema de arquivos`; retorna :class:`str` inalterada.

source: :func:`fsencode` is the reverse function.
pt_br: :func:`fsencode` é a função inversa.

source: Return the file system representation of the path.
pt_br: Retorna a representação do sistema de arquivos do caminho (argumento *path*).

source: If :class:`str` or :class:`bytes` is passed in, it is returned unchanged. Otherwise :meth:`~os.PathLike.__fspath__` is called and its value is returned as long as it is a :class:`str` or :class:`bytes` object. In all other cases, :exc:`TypeError` is raised.
pt_br: Se um objeto :class:`str` ou :class:`bytes` é passado, é retornado inalterado. Caso contrário, o método :meth:`~os.PathLike.__fspath__` é chamado, e seu valor é retornado, desde que seja um objeto :class:`str` ou :class:`bytes`. Em todos os outros casos, :exc:`TypeError` é levantada.

source: An :term:`abstract base class` for objects representing a file system path, e.g. :class:`pathlib.PurePath`.
pt_br: Uma :term:`classe base abstrata` para objetos representando um caminho do sistema de arquivos, como, por exemplo, :class:`pathlib.PurePath`.

source: Return the file system path representation of the object.
pt_br: Retorna a representação do caminho do sistema de arquivos do objeto.

source: The method should only return a :class:`str` or :class:`bytes` object, with the preference being for :class:`str`.
pt_br: O método deverá retornar somente objetos :class:`str` ou :class:`bytes`, preferencialmente :class:`str`.

source: Return the value of the environment variable *key* as a string if it exists, or *default* if it doesn't. *key* is a string. Note that since :func:`getenv` uses :data:`os.environ`, the mapping of :func:`getenv` is similarly also captured on import, and the function may not reflect future environment changes.
pt_br: Retorna o valor da variável de ambiente *key* como uma string se existir, ou *default* se não existir. *key* é uma string. Note que uma vez que :func:`getenv` utiliza :data:`os.environ`, o mapeamento de :func:`getenv` é também similarmente capturado na importação, e a função pode não refletir futuras mudanças no ambiente.

source: On Unix, keys and values are decoded with :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :func:`os.getenvb` if you would like to use a different encoding.
pt_br: No Unix, chaves e valores são decodificados com a função :func:`sys.getfilesystemencoding` e o o manipulador de erros ``'surrogateescape'``. Use :func:`os.getenvb` se quiser usar uma codificação diferente.
