Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: The ``st_ctime`` attribute of a stat result is deprecated on Windows. The file creation time is properly available as ``st_birthtime``, and in the future ``st_ctime`` may be changed to return zero or the metadata change time, if available.
pt_br: O atributo ``st_ctime`` do resultado de stat foi descontinuado no Windows. A hora de criação do arquivo está devidamente disponível como ``st_birthtime``, e no futuro ``st_ctime`` pode ser alterada para retornar zero ou a hora de alteração dos metadados, se disponível.

source: Get the status of a file or a file descriptor. Perform the equivalent of a :c:func:`stat` system call on the given path. *path* may be specified as either a string or bytes -- directly or indirectly through the :class:`PathLike` interface -- or as an open file descriptor. Return a :class:`stat_result` object.
pt_br: Obtém o status de um arquivo ou um descritor de arquivo. Executa o equivalente a uma chamada de sistema :c:func:`stat` no caminho fornecido. *path* pode ser especificado como uma string ou bytes -- direta ou indiretamente através da interface :class:`PathLike` -- ou como um descritor de arquivo aberto. Retorna um objeto :class:`stat_result`.

source: This function normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :func:`lstat`.
pt_br: Esta função normalmente segue links simbólicos; para obter o status do link simbólico, adicione o argumento ``follow_symlinks=False``, ou use :func:`lstat`.

source: This function can support :ref:`specifying a file descriptor <path_fd>` and :ref:`not following symlinks <follow_symlinks>`.
pt_br: Esta função tem suporte a :ref:`especificar um descritor de arquivo <path_fd>` e :ref:`não seguir links simbólicos <follow_symlinks>`.

source: On Windows, passing ``follow_symlinks=False`` will disable following all name-surrogate reparse points, which includes symlinks and directory junctions. Other types of reparse points that do not resemble links or that the operating system is unable to follow will be opened directly. When following a chain of multiple links, this may result in the original link being returned instead of the non-link that prevented full traversal. To obtain stat results for the final path in this case, use the :func:`os.path.realpath` function to resolve the path name as far as possible and call :func:`lstat` on the result. This does not apply to dangling symlinks or junction points, which will raise the usual exceptions.
pt_br: No Windows, ao definir ``follow_symlinks=False`` é desativado o recurso de seguir todos os pontos de nova análise, que incluem links simbólicos e junções de diretório. Outros tipos de pontos de nova análise que não se parecem com links ou que o sistema operacional não pode seguir serão abertos diretamente. Ao seguir uma cadeia de vários links, isso pode resultar no retorno do link original em vez do não-link que impediu o percurso completo. Para obter resultados de *stat* para o caminho final neste caso, use a função :func:`os.path.realpath` para resolver o nome do caminho tanto quanto possível e chame :func:`lstat` no resultado. Isso não se aplica a links simbólicos pendentes ou pontos de junção, que levantam as exceções usuais.

source: Example::
pt_br: Exemplo::

source: >>> import os >>> statinfo = os.stat('somefile.txt') >>> statinfo os.stat_result(st_mode=33188, st_ino=7876932, st_dev=234881026, st_nlink=1, st_uid=501, st_gid=501, st_size=264, st_atime=1297230295, st_mtime=1297230027, st_ctime=1297230027) >>> statinfo.st_size 264
pt_br: >>> import os >>> statinfo = os.stat('algumarquivo.txt') >>> statinfo os.stat_result(st_mode=33188, st_ino=7876932, st_dev=234881026, st_nlink=1, st_uid=501, st_gid=501, st_size=264, st_atime=1297230295, st_mtime=1297230027, st_ctime=1297230027) >>> statinfo.st_size 264

source: :func:`fstat` and :func:`lstat` functions.
pt_br: As funções :func:`fstat` e :func:`lstat`.

source: Added the *dir_fd* and *follow_symlinks* parameters, specifying a file descriptor instead of a path.
pt_br: Adicionados os parâmetros *dir_fd* e *follow_symlinks*, especificando um descritor de arquivo em vez de um caminho.

source: On Windows, all reparse points that can be resolved by the operating system are now followed, and passing ``follow_symlinks=False`` disables following all name surrogate reparse points. If the operating system reaches a reparse point that it is not able to follow, *stat* now returns the information for the original path as if ``follow_symlinks=False`` had been specified instead of raising an error.
pt_br: No Windows, todos os pontos de nova análise que podem ser resolvidos pelo sistema operacional agora são seguidos, e passar ``follow_symlinks=False`` desativa seguir todos os pontos de nova análise substitutos de nome. Se o sistema operacional atingir um ponto de nova análise que não é capaz de seguir, *stat* agora retorna as informações do caminho original como se ``follow_symlinks=False`` tivesse sido especificado em vez de levantar um erro.

source: Object whose attributes correspond roughly to the members of the :c:struct:`stat` structure. It is used for the result of :func:`os.stat`, :func:`os.fstat` and :func:`os.lstat`.
pt_br: Objeto cujos atributos correspondem aproximadamente aos membros da estrutura :c:struct:`stat`. É usado para o resultado de :func:`os.stat`, :func:`os.fstat` e :func:`os.lstat`.

source: Attributes:
pt_br: Atributos:

source: File mode: file type and file mode bits (permissions).
pt_br: Modo de arquivo: tipo de arquivo e bits de modo de arquivo (permissões).

source: Platform dependent, but if non-zero, uniquely identifies the file for a given value of ``st_dev``. Typically:
pt_br: Dependente da plataforma, mas se diferente de zero, identifica exclusivamente o arquivo para um determinado valor de ``st_dev``. Tipicamente:

source: the inode number on Unix,
pt_br: o número do nó-i no Unix,

source: the `file index <https://msdn.microsoft.com/en-us/library/aa363788>`_ on Windows
pt_br: o `índice de arquivo <https://msdn.microsoft.com/en-us/library/aa363788>`_ no Windows

source: Identifier of the device on which this file resides.
pt_br: Identificador do dispositivo no qual este arquivo reside.

source: Number of hard links.
pt_br: Número de links físicos.

source: User identifier of the file owner.
pt_br: Identificador de usuário do proprietário do arquivo.

source: Group identifier of the file owner.
pt_br: Identificador de grupo do proprietário do arquivo.

source: Size of the file in bytes, if it is a regular file or a symbolic link. The size of a symbolic link is the length of the pathname it contains, without a terminating null byte.
pt_br: Tamanho do arquivo em bytes, se for um arquivo normal ou um link simbólico. O tamanho de um link simbólico é o comprimento do nome do caminho que ele contém, sem um byte nulo final.

source: Timestamps:
pt_br: Registros de data e hora:

source: Time of most recent access expressed in seconds.
pt_br: Hora do acesso mais recente expressa em segundos.

source: Time of most recent content modification expressed in seconds.
pt_br: Hora da modificação de conteúdo mais recente expressa em segundos.

source: Time of most recent metadata change expressed in seconds.
pt_br: Hora da alteração de metadados mais recente expressa em segundos.

source: ``st_ctime`` is deprecated on Windows. Use ``st_birthtime`` for the file creation time. In the future, ``st_ctime`` will contain the time of the most recent metadata change, as for other platforms.
pt_br: ``st_ctime`` foi descontinuado no Windows. Use ``st_birthtime`` para o tempo de criação do arquivo. No futuro, ``st_ctime`` conterá a hora da alteração de metadados mais recente, como em outras plataformas.

source: Time of most recent access expressed in nanoseconds as an integer.
pt_br: Hora do acesso mais recente expresso em nanossegundos como um número inteiro.

source: Time of most recent content modification expressed in nanoseconds as an integer.
pt_br: Hora da modificação de conteúdo mais recente expressa em nanossegundos como um número inteiro.

source: Time of most recent metadata change expressed in nanoseconds as an integer.
pt_br: Hora do alteração de metadados mais recente expresso em nanossegundos como um número inteiro.

source: ``st_ctime_ns`` is deprecated on Windows. Use ``st_birthtime_ns`` for the file creation time. In the future, ``st_ctime`` will contain the time of the most recent metadata change, as for other platforms.
pt_br: ``st_ctime_ns`` foi descontinuado no Windows. Use ``st_birthtime_ns`` para o tempo de criação do arquivo. No futuro, ``st_ctime`` conterá a hora da alteração de metadados mais recente, como em outras plataformas.

source: Time of file creation expressed in seconds. This attribute is not always available, and may raise :exc:`AttributeError`.
pt_br: Hora de criação do arquivo expressa em segundos. Este atributo nem sempre está disponível e pode levantar :exc:`AttributeError`.

source: ``st_birthtime`` is now available on Windows.
pt_br: ``st_birthtime`` está agora disponível no Windows.

source: Time of file creation expressed in nanoseconds as an integer. This attribute is not always available, and may raise :exc:`AttributeError`.
pt_br: Hora de criação do arquivo expressa em nanossegundos em um inteiro. Este atributo nem sempre está disponível e pode levantar :exc:`AttributeError`.

source: The exact meaning and resolution of the :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` and :attr:`st_birthtime` attributes depend on the operating system and the file system. For example, on Windows systems using the FAT32 file systems, :attr:`st_mtime` has 2-second resolution, and :attr:`st_atime` has only 1-day resolution. See your operating system documentation for details.
pt_br: O significado e resolução exatos dos atributos :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` e :attr:`st_birthtime` dependem do sistema operacional e do sistema de arquivos. Por exemplo, em sistemas Windows que usam os sistemas de arquivos FAT32, :attr:`st_mtime` tem resolução de 2 segundos, e :attr:`st_atime` tem resolução de apenas 1 dia. Consulte a documentação do sistema operacional para obter detalhes.

source: Similarly, although :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` and :attr:`st_birthtime_ns` are always expressed in nanoseconds, many systems do not provide nanosecond precision. On systems that do provide nanosecond precision, the floating-point object used to store :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` and :attr:`st_birthtime` cannot preserve all of it, and as such will be slightly inexact. If you need the exact timestamps you should always use :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` and :attr:`st_birthtime_ns`.
pt_br: Da mesma forma, embora :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` e :attr:`st_birthtime_ns` sejam sempre expressos em nanossegundos, muitos sistemas não fornecem precisão de nanossegundos. Em sistemas que fornecem precisão de nanossegundos, o objeto de ponto flutuante usado para armazenar :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime` e :attr:`st_birthtime` não pode preservar tudo, e como tal será ligeiramente inexato. Se você precisa dos carimbos de data/hora exatos, sempre deve usar :attr:`st_atime_ns`, :attr:`st_mtime_ns`, :attr:`st_ctime_ns` e :attr:`st_birthtime_ns`.

source: On some Unix systems (such as Linux), the following attributes may also be available:
pt_br: Em alguns sistemas Unix (como Linux), os seguintes atributos também podem estar disponíveis:

source: Number of 512-byte blocks allocated for file. This may be smaller than :attr:`st_size`/512 when the file has holes.
pt_br: Número de blocos de 512 bytes alocados para o arquivo. Isso pode ser menor que :attr:`st_size`/512 quando o arquivo possuir lacunas.

source: "Preferred" blocksize for efficient file system I/O. Writing to a file in smaller chunks may cause an inefficient read-modify-rewrite.
pt_br: Tamanho de bloco "preferido" para E/S eficiente do sistema de arquivos. Gravar em um arquivo em partes menores pode causar uma leitura-modificação-reescrita ineficiente.

source: Type of device if an inode device.
pt_br: Tipo de dispositivo, se for um dispositivo nó-i.

source: User defined flags for file.
pt_br: Sinalizadores definidos pelo usuário para o arquivo.

source: On other Unix systems (such as FreeBSD), the following attributes may be available (but may be only filled out if root tries to use them):
pt_br: Em outros sistemas Unix (como o FreeBSD), os seguintes atributos podem estar disponíveis (mas só podem ser preenchidos se o root tentar usá-los):

source: File generation number.
pt_br: Número de geração do arquivo.

source: On Solaris and derivatives, the following attributes may also be available:
pt_br: No Solaris e derivados, os seguintes atributos também podem estar disponíveis:

source: String that uniquely identifies the type of the filesystem that contains the file.
pt_br: String que identifica exclusivamente o tipo de sistema de arquivos que contém o arquivo.

source: On macOS systems, the following attributes may also be available:
pt_br: Em sistemas macOS, os seguintes atributos também podem estar disponíveis:

source: Real size of the file.
pt_br: Tamanho real do arquivo.

source: Creator of the file.
pt_br: Criador do arquivo.

source: File type.
pt_br: Tipo de arquivo.

source: On Windows systems, the following attributes are also available:
pt_br: Em sistemas Windows, os seguintes atributos também estão disponíveis:

source: Windows file attributes: ``dwFileAttributes`` member of the ``BY_HANDLE_FILE_INFORMATION`` structure returned by :c:func:`!GetFileInformationByHandle`. See the :const:`!FILE_ATTRIBUTE_* <stat.FILE_ATTRIBUTE_ARCHIVE>` constants in the :mod:`stat` module.
pt_br: Atributos de arquivos no Windows: membro ``dwFileAttributes`` da estrutura ``BY_HANDLE_FILE_INFORMATION`` retornada por :c:func:`!GetFileInformationByHandle`. Veja as constantes :const:`!FILE_ATTRIBUTE_* <stat.FILE_ATTRIBUTE_ARCHIVE>` no módulo :mod:`stat`.

source: When :attr:`st_file_attributes` has the :const:`~stat.FILE_ATTRIBUTE_REPARSE_POINT` set, this field contains the tag identifying the type of reparse point. See the :const:`IO_REPARSE_TAG_* <stat.IO_REPARSE_TAG_SYMLINK>` constants in the :mod:`stat` module.
pt_br: Quando :attr:`st_file_attributes` tem :const:`~stat.FILE_ATTRIBUTE_REPARSE_POINT` definido, este campo contém uma tag identificando o tipo do ponto de nova análise. Veja as constantes :const:`IO_REPARSE_TAG_* <stat.IO_REPARSE_TAG_SYMLINK>` no módulo :mod:`stat`.

source: The standard module :mod:`stat` defines functions and constants that are useful for extracting information from a :c:struct:`stat` structure. (On Windows, some items are filled with dummy values.)
pt_br: O módulo padrão :mod:`stat` define funções e constantes que são úteis para extrair informações de uma estrutura :c:struct:`stat`. (No Windows, alguns itens são preenchidos com valores fictícios.)

source: For backward compatibility, a :class:`stat_result` instance is also accessible as a tuple of at least 10 integers giving the most important (and portable) members of the :c:struct:`stat` structure, in the order :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. More items may be added at the end by some implementations. For compatibility with older Python versions, accessing :class:`stat_result` as a tuple always returns integers.
pt_br: Para compatibilidade com versões anteriores, uma instância de :class:`stat_result` também é acessível como uma tupla de pelo menos 10 inteiros, fornecendo os membros mais importantes (e portáveis) da estrutura :c:struct:`stat`, na ordem :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. Mais itens podem ser adicionados no final por algumas implementações. Para compatibilidade com versões mais antigas do Python, acessar :class:`stat_result` como uma tupla sempre retorna inteiros.

source: Windows now returns the file index as :attr:`st_ino` when available.
pt_br: Windows agora retorna o arquivo de índice como :attr:`st_ino` quando disponível.

source: Added the :attr:`st_fstype` member to Solaris/derivatives.
pt_br: Adicionado o membro :attr:`st_fstype` ao Solaris/derivados.

source: Added the :attr:`st_reparse_tag` member on Windows.
pt_br: Adicionado o membro :attr:`st_reparse_tag` no Windows.

source: On Windows, the :attr:`st_mode` member now identifies special files as :const:`S_IFCHR`, :const:`S_IFIFO` or :const:`S_IFBLK` as appropriate.
pt_br: No Windows, o membro :attr:`st_mode` agora identifica arquivos especiais como :const:`S_IFCHR`, :const:`S_IFIFO` ou :const:`S_IFBLK` conforme apropriado.

source: On Windows, :attr:`st_ctime` is deprecated. Eventually, it will contain the last metadata change time, for consistency with other platforms, but for now still contains creation time. Use :attr:`st_birthtime` for the creation time.
pt_br: No Windows, :attr:`st_ctime` foi descontinuado. Eventualmente, ele conterá a hora da última alteração de metadados, para fins de consistência com outras plataformas, mas por enquanto ainda contém a hora de criação. Use :attr:`st_birthtime` para a hora de criação.

source: On Windows, :attr:`st_ino` may now be up to 128 bits, depending on the file system. Previously it would not be above 64 bits, and larger file identifiers would be arbitrarily packed.
pt_br: No Windows, o :attr:`st_ino` agora pode ter até 128 bits, dependendo do sistema de arquivos. Anteriormente, não era possível ter mais de 64 bits, e identificadores de arquivo maiores seriam compactados arbitrariamente.

source: On Windows, :attr:`st_rdev` no longer returns a value. Previously it would contain the same as :attr:`st_dev`, which was incorrect.
pt_br: No Windows, :attr:`st_rdev` não retorna mais um valor. Anteriormente, ele continha o mesmo que :attr:`st_dev`, o que era incorreto.

source: Added the :attr:`st_birthtime` member on Windows.
pt_br: Adicionado o membro :attr:`st_birthtime` no Windows.

source: Perform a :c:func:`!statvfs` system call on the given path. The return value is an object whose attributes describe the filesystem on the given path, and correspond to the members of the :c:struct:`statvfs` structure, namely: :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.
pt_br: Executa uma chamada de sistema :c:func:`!statvfs` no caminho fornecido. O valor de retorno é um objeto cujos atributos descrevem o sistema de arquivos no caminho fornecido e correspondem aos membros da estrutura :c:struct:`statvfs`, a saber: :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.

source: Two module-level constants are defined for the :attr:`f_flag` attribute's bit-flags: if :const:`ST_RDONLY` is set, the filesystem is mounted read-only, and if :const:`ST_NOSUID` is set, the semantics of setuid/setgid bits are disabled or not supported.
pt_br: Duas constantes em nível de módulo são definidas para os sinalizadores de bit do atributo :attr:`f_flag`: se :const:`ST_RDONLY` estiver definido, o sistema de arquivos é montado somente leitura, e se :const:`ST_NOSUID` estiver definido, a semântica dos bits setuid/setgid é desabilitada ou não é implementada.

source: Additional module-level constants are defined for GNU/glibc based systems. These are :const:`ST_NODEV` (disallow access to device special files), :const:`ST_NOEXEC` (disallow program execution), :const:`ST_SYNCHRONOUS` (writes are synced at once), :const:`ST_MANDLOCK` (allow mandatory locks on an FS), :const:`ST_WRITE` (write on file/directory/symlink), :const:`ST_APPEND` (append-only file), :const:`ST_IMMUTABLE` (immutable file), :const:`ST_NOATIME` (do not update access times), :const:`ST_NODIRATIME` (do not update directory access times), :const:`ST_RELATIME` (update atime relative to mtime/ctime).
pt_br: Constantes de nível de módulo adicionais são definidas para sistemas baseados em GNU/glibc. São elas :const:`ST_NODEV` (impede o acesso aos arquivos especiais do dispositivo), :const:`ST_NOEXEC` (não permite a execução do programa), :const:`ST_SYNCHRONOUS` (as escritas são sincronizadas de uma vez), :const:`ST_MANDLOCK` (permitir travas obrigatórias em um sistema de arquivos), :const:`ST_WRITE` (escrever no arquivo/diretório/link simbólico), :const:`ST_APPEND` (arquivo somente anexado), :const:`ST_IMMUTABLE` (arquivo imutável), :const:`ST_NOATIME` (não atualiza os tempos de acesso), :const:`ST_NODIRATIME` (não atualiza os tempos de acesso ao diretório), :const:`ST_RELATIME` (atualiza o atime relativo ao mtime/ctime).

source: The :const:`ST_RDONLY` and :const:`ST_NOSUID` constants were added.
pt_br: As constantes :const:`ST_RDONLY` e :const:`ST_NOSUID` foram adicionadas.

source: The :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, and :const:`ST_RELATIME` constants were added.
pt_br: As constantes :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME` e :const:`ST_RELATIME` foram adicionadas.

source: Added the :attr:`f_fsid` attribute.
pt_br: Adicionado o atributo :attr:`f_fsid`.

source: A :class:`set` object indicating which functions in the :mod:`os` module accept an open file descriptor for their *dir_fd* parameter. Different platforms provide different features, and the underlying functionality Python uses to implement the *dir_fd* parameter is not available on all platforms Python supports. For consistency's sake, functions that may support *dir_fd* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``None`` for *dir_fd* is always supported on all platforms.)
pt_br: Um objeto :class:`set` indicando quais funções no módulo :mod:`os` aceitam um descritor de arquivo aberto para seu parâmetro *dir_fd*. Plataformas diferentes fornecem recursos diferentes, e a funcionalidade subjacente que o Python usa para implementar o parâmetro *dir_fd* não está disponível em todas as plataformas que o Python provê suporte. Para fins de consistência, as funções que podem implementar *dir_fd* sempre permitem especificar o parâmetro, mas lançarão uma exceção se a funcionalidade for usada quando não estiver disponível localmente. (Especificar ``None`` para *dir_fd* é sempre válido em todas as plataformas.)

source: To check whether a particular function accepts an open file descriptor for its *dir_fd* parameter, use the ``in`` operator on ``supports_dir_fd``. As an example, this expression evaluates to ``True`` if :func:`os.stat` accepts open file descriptors for *dir_fd* on the local platform::
pt_br: Para verificar se uma função particular aceita um descritor de arquivo aberto para seu parâmetro *dir_fd*, use o operador ``in`` em ``supports_dir_fd``. Como exemplo, esta expressão é avaliada como ``True`` se :func:`os.stat` aceita descritores de arquivo abertos para *dir_fd* na plataforma local::

source: Currently *dir_fd* parameters only work on Unix platforms; none of them work on Windows.
pt_br: Atualmente os parâmetros *dir_fd* funcionam apenas em plataformas Unix; nenhum deles funciona no Windows.
