Repository: python/python-docs-pt-br
Catalog: library/os.path.po
Languages: pt_br

source: Return the canonical path of the specified filename, eliminating any symbolic links encountered in the path (if they are supported by the operating system). On Windows, this function will also resolve MS-DOS (also called 8.3) style names such as ``C:\\PROGRA~1`` to ``C:\\Program Files``.
pt_br: Retorna o caminho canônico do nome de arquivo especificado, eliminando quaisquer links simbólicos encontrados no caminho (se forem suportados pelo sistema operacional). No Windows, esta função também resolverá nomes de estilo do MS-DOS (também chamado de 8.3), como ``C:\\PROGRA~1`` para ``C:\\Program Files``.

source: By default, the path is evaluated up to the first component that does not exist, is a symlink loop, or whose evaluation raises :exc:`OSError`. All such components are appended unchanged to the existing part of the path.
pt_br: Por padrão, o caminho é avaliado até o primeiro componente que não existe, é um laço de link simbólico ou cuja avaliação levanta :exc:`OSError`. Todos esses componentes são anexados inalterados à parte existente do caminho.

source: Some errors that are handled this way include "access denied", "not a directory", or "bad argument to internal function". Thus, the resulting path may be missing or inaccessible, may still contain links or loops, and may traverse non-directories.
pt_br: Alguns erros tratados dessa forma incluem "acesso negado", "não é um diretório" ou "argumento inválido para função interna". Assim, o caminho resultante pode estar ausente ou inacessível, ainda pode conter links ou laços e pode passar por diretórios não especificados.

source: This behavior can be modified by keyword arguments:
pt_br: Esse comportamento pode ser modificado por argumentos nomeados:

source: If *strict* is ``True``, the first error encountered when evaluating the path is re-raised. In particular, :exc:`FileNotFoundError` is raised if *path* does not exist, or another :exc:`OSError` if it is otherwise inaccessible.
pt_br: Se *strict* for ``True``, o primeiro erro encontrado ao avaliar o caminho será levantado novamente. Em particular, :exc:`FileNotFoundError` é levantada se *path* não existir, ou outro :exc:`OSError` se ele estiver inacessível.

source: If *strict* is :py:data:`os.path.ALLOW_MISSING`, errors other than :exc:`FileNotFoundError` are re-raised (as with ``strict=True``). Thus, the returned path will not contain any symbolic links, but the named file and some of its parent directories may be missing.
pt_br: Se *strict* for :py:data:`os.path.ALLOW_MISSING`, erros diferentes de :exc:`FileNotFoundError` serão levantados novamente (como em ``strict=True``). Portanto, o caminho retornado não conterá nenhum link simbólico, mas o arquivo nomeado e alguns de seus diretórios pais podem estar ausentes.

source: This function emulates the operating system's procedure for making a path canonical, which differs slightly between Windows and UNIX with respect to how links and subsequent path components interact.
pt_br: Esta função emula o procedimento do sistema operacional para tornar um caminho canônico, que difere ligeiramente entre o Windows e o UNIX no que diz respeito à interação dos links e dos componentes do caminho subsequentes.

source: Operating system APIs make paths canonical as needed, so it's not normally necessary to call this function.
pt_br: As APIs do sistema operacional tornam os caminhos canônicos conforme necessário, portanto, normalmente não é necessário chamar esta função.

source: Symbolic links and junctions are now resolved on Windows.
pt_br: Links simbólicos e junções agora são resolvidos no Windows.

source: The *strict* parameter was added.
pt_br: O parâmetro *script* foi adicionado.

source: The :py:data:`~os.path.ALLOW_MISSING` value for the *strict* parameter was added.
pt_br: O valor :py:data:`~os.path.ALLOW_MISSING` para o parâmetro *strict* foi adicionado.

source: Special value used for the *strict* argument in :func:`realpath`.
pt_br: Valor especial usado para o argumento *strict* em :func:`realpath`.

source: Return a relative filepath to *path* either from the current directory or from an optional *start* directory. This is a path computation: the filesystem is not accessed to confirm the existence or nature of *path* or *start*. On Windows, :exc:`ValueError` is raised when *path* and *start* are on different drives.
pt_br: Retorna um caminho de arquivo relativo a *caminho* do diretório atual ou de um diretório *start* opcional. Este é um cálculo de caminho: o sistema de arquivos não é acessado para confirmar a existência ou natureza de *path* ou *start*. No Windows, :exc:`ValueError` é levantada quando *path* e *start* estão em unidades diferentes.

source: *start* defaults to :data:`os.curdir`.
pt_br: *start* tem como padrão :data:`os.curdir`.

source: Return ``True`` if both pathname arguments refer to the same file or directory. This is determined by the device number and i-node number and raises an exception if an :func:`os.stat` call on either pathname fails.
pt_br: Retorna ``True`` se ambos os argumentos de nome de caminho se referem ao mesmo arquivo ou diretório. Isso é determinado pelo número do dispositivo e número do nó-i e levanta uma exceção se uma chamada :func:`os.stat` em qualquer um dos caminhos falhar.

source: Added Windows support.
pt_br: Adicionado suporte ao Windows.

source: Windows now uses the same implementation as all other platforms.
pt_br: O Windows agora usa a mesma implementação que todas as outras plataformas.

source: Return ``True`` if the file descriptors *fp1* and *fp2* refer to the same file.
pt_br: Retorna ``True`` se os descritores de arquivo *fp1* e *fp2* fazem referência ao mesmo arquivo.

source: Return ``True`` if the stat tuples *stat1* and *stat2* refer to the same file. These structures may have been returned by :func:`os.fstat`, :func:`os.lstat`, or :func:`os.stat`. This function implements the underlying comparison used by :func:`samefile` and :func:`sameopenfile`.
pt_br: Retorna ``True`` se as tuplas de estatísticas *stat1* e *stat2* fazem referência ao mesmo arquivo. Essas estruturas podem ter sido retornadas por :func:`os.fstat`, :func:`os.lstat` ou :func:`os.stat`. Esta função implementa a comparação subjacente usada por :func:`samefile` e :func:`sameopenfile`.

source: Split the pathname *path* into a pair, ``(head, tail)`` where *tail* is the last pathname component and *head* is everything leading up to that. The *tail* part will never contain a slash; if *path* ends in a slash, *tail* will be empty. If there is no slash in *path*, *head* will be empty. If *path* is empty, both *head* and *tail* are empty. Trailing slashes are stripped from *head* unless it is the root (one or more slashes only). In all cases, ``join(head, tail)`` returns a path to the same location as *path* (but the strings may differ). Also see the functions :func:`dirname` and :func:`basename`.
pt_br: Divide o caminho *path* em um par, ``(cabeça, rabo)`` onde *rabo* é o último componente do nome do caminho e *cabeça* é tudo o que leva a isso. A parte *rabo* nunca conterá uma barra; se *path* terminar com uma barra, *tail* ficará vazio. Se não houver uma barra no *path*, o *head* ficará vazio. Se *path* estiver vazio, *cabeça* e *rabo* estarão vazios. As barras finais são retiradas da *cabeça*, a menos que seja a raiz (uma ou mais barras apenas). Em todos os casos, ``join(cabeça, rabo)`` retorna um caminho para o mesmo local que *path* (mas as strings podem ser diferentes). Veja também as funções :func:`dirname` e :func:`basename`.

source: Split the pathname *path* into a pair ``(drive, tail)`` where *drive* is either a mount point or the empty string. On systems which do not use drive specifications, *drive* will always be the empty string. In all cases, ``drive + tail`` will be the same as *path*.
pt_br: Divide o nome do caminho *path* em um par ``(unidade, rabo)`` onde *unidade* é um ponto de montagem ou uma string vazia. Em sistemas que não usam especificações de unidade, *unidade* sempre será a string vazia. Em todos os casos, ``unidade + rabo`` será o mesmo que *path*.

source: On Windows, splits a pathname into drive/UNC sharepoint and relative path.
pt_br: No Windows, divide um nome de caminho em unidade/ponto de compartilhamento UNC e caminho relativo.

source: If the path contains a drive letter, drive will contain everything up to and including the colon::
pt_br: Se o caminho contiver uma letra de unidade, a unidade conterá tudo, incluindo os dois pontos::

source: If the path contains a UNC path, drive will contain the host name and share::
pt_br: Se o caminho contiver um caminho UNC, a unidade conterá o nome do host e o compartilhamento::

source: >>> splitdrive("//host/computer/dir") ("//host/computer", "/dir")
pt_br: >>> splitdrive("//host/computador/diretório") ("//host/computador", "/diretório")

source: Split the pathname *path* into a 3-item tuple ``(drive, root, tail)`` where *drive* is a device name or mount point, *root* is a string of separators after the drive, and *tail* is everything after the root. Any of these items may be the empty string. In all cases, ``drive + root + tail`` will be the same as *path*.
pt_br: Divide o nome de caminho *path* em uma tupla de 3 itens ``(drive, root, tail)`` onde *drive* é um nome de dispositivo ou ponto de montagem, *root* é uma string de separadores após a unidade e *tail* é tudo depois da raiz. Qualquer um desses itens pode ser uma string vazia. Em todos os casos, ``drive + root + tail`` será igual a *path*.

source: On POSIX systems, *drive* is always empty. The *root* may be empty (if *path* is relative), a single forward slash (if *path* is absolute), or two forward slashes (implementation-defined per `IEEE Std 1003.1-2017; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_.) For example::
pt_br: Em sistemas POSIX, *drive* está sempre vazio. A *root* pode estar vazia (se *path* for relativo), uma única barra (se *path* for absoluto) ou duas barras (definidas pela implementação de acordo com `IEEE Std 1003.1-2017; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_.) Por exemplo::

source: On Windows, *drive* may be empty, a drive-letter name, a UNC share, or a device name. The *root* may be empty, a forward slash, or a backward slash. For example::
pt_br: No Windows, *drive* pode estar vazio, ser um nome de letra de unidade, um compartilhamento UNC ou um nome de dispositivo. *root* pode estar vazio, ser uma barra ou uma barra invertida. Por exemplo::

source: Split the pathname *path* into a pair ``(root, ext)`` such that ``root + ext == path``, and the extension, *ext*, is empty or begins with a period and contains at most one period.
pt_br: Divida o nome do caminho *path* em um par ``(root, ext)`` de modo que ``root + ext == path``, e a extensão, *ext*, esteja vazia ou comece com um ponto e contenha no máximo um período.

source: If the path contains no extension, *ext* will be ``''``::
pt_br: Se o caminho não contiver extensão, *ext* será ``''``::

source: If the path contains an extension, then *ext* will be set to this extension, including the leading period. Note that previous periods will be ignored::
pt_br: Se o caminho contiver uma extensão, *ext* será definido para esta extensão, incluindo o ponto inicial. Observe que os períodos anteriores serão ignorados::

source: Leading periods of the last component of the path are considered to be part of the root::
pt_br: Os períodos iniciais do último componente do caminho são considerados parte da raiz::

source: ``True`` if arbitrary Unicode strings can be used as file names (within limitations imposed by the file system).
pt_br: ``True`` se strings Unicode arbitrárias podem ser usadas como nomes de arquivo (dentro das limitações impostas pelo sistema de arquivos).

source: path
pt_br: caminho

source: operations
pt_br: operações

source: ~ (tilde)
pt_br: ~ (til)

source: home directory expansion
pt_br: expansão de diretório home

source: module
pt_br: módulo

source: $ (dollar)
pt_br: $ (dólar)

source: environment variables expansion
pt_br: expansão de variáveis de ambiente

source: % (percent)
pt_br: % (porcentagem)

source: environment variables expansion (Windows)
pt_br: expansão de variáveis de ambiente (Windows)
