Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: On a Unix-like system, random bytes are read from the ``/dev/urandom`` device. If the ``/dev/urandom`` device is not available or not readable, the :exc:`NotImplementedError` exception is raised.
pt_br: Em um sistema semelhante ao Unix, bytes aleatórios são lidos do dispositivo ``/dev/urandom``. Se o dispositivo ``/dev/urandom`` não estiver disponível ou não for legível, a exceção :exc:`NotImplementedError` é levantada.

source: On Windows, it will use ``BCryptGenRandom()``.
pt_br: No Windows, ainda vai usar ``BCryptGenRandom()``.

source: The :mod:`secrets` module provides higher level functions. For an easy-to-use interface to the random number generator provided by your platform, please see :class:`random.SystemRandom`.
pt_br: O módulo :mod:`secrets` fornece funções de nível mais alto. Para uma interface fácil de usar para o gerador de números aleatórios fornecido por sua plataforma, consulte :class:`random.SystemRandom`.

source: On Linux 3.17 and newer, the ``getrandom()`` syscall is now used when available. On OpenBSD 5.6 and newer, the C ``getentropy()`` function is now used. These functions avoid the usage of an internal file descriptor.
pt_br: No Linux 3.17 e mais recente, a chamada de sistema ``getrandom()`` agora é usada quando disponível. No OpenBSD 5.6 e mais recentes, a função C ``getentropy()`` agora é usada. Essas funções evitam o uso de um descritor de arquivo interno.

source: On Linux, if the ``getrandom()`` syscall blocks (the urandom entropy pool is not initialized yet), fall back on reading ``/dev/urandom``.
pt_br: No Linux, se a chamada de sistema ``getrandom()`` bloqueia (o pool de entropia urandom ainda não foi inicializado), recorre à leitura ``/dev/urandom``.

source: On Linux, ``getrandom()`` is now used in blocking mode to increase the security.
pt_br: No Linux, ``getrandom()`` é usado agora no modo de bloqueio para aumentar a segurança.

source: On Windows, ``BCryptGenRandom()`` is used instead of ``CryptGenRandom()`` which is deprecated.
pt_br: No Windows, ``BCryptGenRandom()`` é usado em vez de ``CryptGenRandom()``, o qual foi descontinuado.

source: By default, when reading from ``/dev/random``, :func:`getrandom` blocks if no random bytes are available, and when reading from ``/dev/urandom``, it blocks if the entropy pool has not yet been initialized.
pt_br: Por padrão, ao ler de ``/dev/random``, :func:`getrandom` bloqueia se nenhum byte aleatório estiver disponível, e ao ler de ``/dev/urandom``, ele bloqueia se o pool de entropia ainda não foi inicializado.

source: If the :py:data:`GRND_NONBLOCK` flag is set, then :func:`getrandom` does not block in these cases, but instead immediately raises :exc:`BlockingIOError`.
pt_br: Se o sinalizador :py:data:`GRND_NONBLOCK` estiver definido, então :func:`getrandom` não bloqueia nesses casos, mas, em vez disso, levanta :exc:`BlockingIOError` imediatamente.

source: If this bit is set, then random bytes are drawn from the ``/dev/random`` pool instead of the ``/dev/urandom`` pool.
pt_br: Se este bit é definido os bytes aleatórios são sorteados a partir de ``/dev/random`` ao invés de ``/dev/urandom``.

source: user
pt_br: usuário

source: effective id
pt_br: id efetivo

source: process
pt_br: processo

source: group
pt_br: grupo

source: id of parent
pt_br: id do pai

source: scheduling priority
pt_br: prioridade de agendamento

source: environment variables
pt_br: variáveis de ambiente

source: setting
pt_br: definição

source: id, setting
pt_br: definição de id

source: gethostname() (in module socket)
pt_br: gethostname() (no módulo socket)

source: gethostbyaddr() (in module socket)
pt_br: gethostbyaddr() (no módulo socket)

source: deleting
pt_br: exclusão

source: module
pt_br: módulo

source: directory
pt_br: diretório

source: changing
pt_br: alteração

source: creating
pt_br: criação

source: UNC paths
pt_br: caminhos UNC

source: and os.makedirs()
pt_br: e os.makedirs()

source: walking
pt_br: percorrer

source: killing
pt_br: interrupção

source: signalling
pt_br: sinalização

source: . (dot)
pt_br: . (ponto)

source: in pathnames
pt_br: em nomes de caminhos

source: / (slash)
pt_br: / (barra)

source: \ (backslash)
pt_br: \ (contrabarra)

source: in pathnames (Windows)
pt_br: em nomes de caminhos (Windows)

source: : (colon)
pt_br: : (dois pontos)

source: path separator (POSIX)
pt_br: separador de caminho (POSIX)

source: ; (semicolon)
pt_br: ; (ponto e vírgula)
