Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: Return an open file object connected to the file descriptor *fd*. This is an alias of the :func:`open` built-in function and accepts the same arguments. The only difference is that the first argument of :func:`fdopen` must always be an integer.
pt_br: Retorna um objeto arquivo aberto conectado ao descritor de arquivo *fd*. Este é um apelido para a função embutida :func:`open` e aceita os mesmos argumentos. A única diferença é que o primeiro argumento de :func:`fdopen` deve ser sempre um inteiro.

source: File Descriptor Operations
pt_br: Operações dos descritores de arquivos

source: These functions operate on I/O streams referenced using file descriptors.
pt_br: Estas funções operam em fluxos de E/S referenciados usando descritores de arquivos.

source: File descriptors are small integers corresponding to a file that has been opened by the current process. For example, standard input is usually file descriptor 0, standard output is 1, and standard error is 2. Further files opened by a process will then be assigned 3, 4, 5, and so forth. The name "file descriptor" is slightly deceptive; on Unix platforms, sockets and pipes are also referenced by file descriptors.
pt_br: Descritores de arquivos são pequenos números inteiros correspondentes a um arquivo que foi aberto pelo processo atual. Por exemplo, a entrada padrão geralmente é o descritor de arquivo 0, a saída padrão 1 e erro padrão 2. Outros arquivos abertos por um processo serão então atribuídos 3, 4, 5, e assim por diante. O nome "descritor de arquivo" é um pouco enganoso; em plataformas UNIX, sockets e pipes também são referenciados como descritores de arquivos.

source: The :meth:`~io.IOBase.fileno` method can be used to obtain the file descriptor associated with a :term:`file object` when required. Note that using the file descriptor directly will bypass the file object methods, ignoring aspects such as internal buffering of data.
pt_br: O método :meth:`~io.IOBase.fileno` pode ser usado para obter o descritor de arquivo associado a um :term:`objeto arquivo <file object>` quando solicitado. Note-se que usar o descritor de arquivo diretamente ignorará os métodos do objeto arquivo, ignorando aspectos como buffer interno de dados.

source: Close file descriptor *fd*.
pt_br: Fecha o descritor de arquivo *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To close a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, use its :meth:`~io.IOBase.close` method.
pt_br: Esta função destina-se a E/S de baixo nível e deve ser aplicada a um descritor de arquivo retornado por :func:`os.open` ou :func:`pipe`. Para fechar um "objeto arquivo" retornado pela função embutida :func:`open` ou por :func:`popen` ou :func:`fdopen`, use seu método :meth:`~io.IOBase.close`.

source: Close all file descriptors from *fd_low* (inclusive) to *fd_high* (exclusive), ignoring errors. Equivalent to (but much faster than)::
pt_br: Fecha todos os descritores de arquivos de *fd_low* (inclusivo) a *fd_high* (exclusivo), ignorando erros. Equivalente a (mas muito mais rápido do que)::

source: Copy *count* bytes from file descriptor *src*, starting from offset *offset_src*, to file descriptor *dst*, starting from offset *offset_dst*. If *offset_src* is ``None``, then *src* is read from the current position; respectively for *offset_dst*.
pt_br: Copia *count* bytes do descritor de arquivo *src*, começando no deslocamento *offset_src*, para o descritor de arquivo *dst*, começando no deslocamento *offset_dst*. Se *offset_src* for ``None``, *src* será lido a partir da posição atual; respectivamente para *offset_dst*.

source: In Linux kernel older than 5.3, the files pointed to by *src* and *dst* must reside in the same filesystem, otherwise an :exc:`OSError` is raised with :attr:`~OSError.errno` set to :const:`errno.EXDEV`.
pt_br: No kernel Linux anterior a 5.3, os arquivos apontados por *src* e *dst* devem residir no mesmo sistema de arquivos, caso contrário, uma exceção :exc:`OSError` é levantada com :attr:`~OSError.errno` definido como :const:`errno.EXDEV`.

source: This copy is done without the additional cost of transferring data from the kernel to user space and then back into the kernel. Additionally, some filesystems could implement extra optimizations, such as the use of reflinks (i.e., two or more inodes that share pointers to the same copy-on-write disk blocks; supported file systems include btrfs and XFS) and server-side copy (in the case of NFS).
pt_br: Essa cópia é feita sem o custo adicional de transferência de dados do kernel para o espaço do usuário e depois de volta para o kernel. Além disso, alguns sistemas de arquivos podem implementar otimizações extras, como o uso de reflinks (ou seja, dois ou mais nós-i que compartilham ponteiros para os mesmos blocos de disco copy-on-write; os sistemas de arquivos suportados incluem btrfs e XFS) e cópia do lado do servidor (no caso de NFS).

source: The function copies bytes between two file descriptors. Text options, like the encoding and the line ending, are ignored.
pt_br: A função copia bytes entre dois descritores de arquivo. As opções de texto, como a codificação e o final da linha, são ignoradas.

source: The return value is the amount of bytes copied. This could be less than the amount requested.
pt_br: O valor de retorno é a quantidade de bytes copiados. Ele pode ser inferior à quantidade solicitada.

source: On Linux, :func:`os.copy_file_range` should not be used for copying a range of a pseudo file from a special filesystem like procfs and sysfs. It will always copy no bytes and return 0 as if the file was empty because of a known Linux kernel issue.
pt_br: No Linux, :func:`os.copy_file_range` não deve ser usada para copiar um intervalo de um pseudo arquivo de um sistema de arquivos especial como procfs e sysfs. Ele nunca copiará byte algum e retornará 0 como se o arquivo estivesse vazio devido a um problema conhecido do kernel do Linux.

source: Return a string describing the encoding of the device associated with *fd* if it is connected to a terminal; else return :const:`None`.
pt_br: Retorna uma string descrevendo a codificação do dispositivo associado a *fd* se estiver conectado a um terminal; senão retorna :const:`None`.

source: On Unix, if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, return ``'UTF-8'`` rather than the device encoding.
pt_br: No Unix, se o :ref:`Modo UTF-8 do Python <utf8-mode>` estiver habilitado, retorna ``'UTF-8'`` ao invés da codificação do dispositivo.

source: On Unix, the function now implements the Python UTF-8 Mode.
pt_br: No Unix, a função agora implementa o Modo UTF-8 do Python.

source: Return a duplicate of file descriptor *fd*. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
pt_br: Retorna uma cópia do descritor de arquivo *fd*. O novo descritor de arquivo é :ref:`não-herdável <fd_inheritance>`.

source: On Windows, when duplicating a standard stream (0: stdin, 1: stdout, 2: stderr), the new file descriptor is :ref:`inheritable <fd_inheritance>`.
pt_br: No Windows, ao duplicar um fluxo padrão (0: stdin, 1: stdout, 2: stderr), o novo descritor de arquivo é :ref:`herdável <fd_inheritance>`.

source: The new file descriptor is now non-inheritable.
pt_br: O novo descritor de arquivo agora é não-herdável.

source: Duplicate file descriptor *fd* to *fd2*, closing the latter first if necessary. Return *fd2*. The new file descriptor is :ref:`inheritable <fd_inheritance>` by default or non-inheritable if *inheritable* is ``False``.
pt_br: Duplica o descritor de arquivo *fd* como *fd2*, fechando o último antes disso, se necessário. Retorna *fd2*. O novo descritor de arquivo é :ref:`herdável <fd_inheritance>` por padrão ou não-herdável se *inheritable* for ``False``.

source: Add the optional *inheritable* parameter.
pt_br: Adicionado o parâmetro opcional *inheritable*.

source: Return *fd2* on success. Previously, ``None`` was always returned.
pt_br: Retorna *fd2* em caso de sucesso. Anteriormente, retornava sempre ``None``.

source: Change the mode of the file given by *fd* to the numeric *mode*. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(fd, mode)``.
pt_br: Altera o modo do arquivo dado por *fd* ao *mode* numérico. Veja a documentação de :func:`chmod` para valores possíveis de *mode*. A partir do Python 3.3, isto é equivalente a ``os.chmod(fd, mode)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chmod`` with arguments ``path``, ``mode``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.chmod`` com os argumentos ``path``, ``mode``, ``dir_fd``.

source: The function is limited on WASI, see :ref:`wasm-availability` for more information.
pt_br: A função é limitada em WASI, veja :ref:`wasm-availability` para mais informações.

source: Added support on Windows.
pt_br: Adicionado suporte no Windows.

source: Change the owner and group id of the file given by *fd* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1. See :func:`chown`. As of Python 3.3, this is equivalent to ``os.chown(fd, uid, gid)``.
pt_br: Altera o ID do proprietário e do grupo do arquivo dado por *fd* para o *uid* e *gid* numérico. Para deixar um dos IDs inalteradas, defina-o como -1. Veja :func:`chown`. A partir do Python 3.3, isto é equivalente a ``os.chown(fd, uid, gid)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chown`` with arguments ``path``, ``uid``, ``gid``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.chown`` com os argumentos ``path``, ``uid``, ``gid``, ``dir_fd``.

source: Force write of file with filedescriptor *fd* to disk. Does not force update of metadata.
pt_br: Força a gravação do arquivo com descritor de arquivo *fd* no disco. Não força a atualização de metadados.

source: This function is not available on MacOS.
pt_br: Esta função não está disponível no MacOS.

source: Return system configuration information relevant to an open file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
pt_br: Retorna informações de configuração de sistema relevantes para um arquivo aberto. *name* especifica o valor de configuração para recuperar; pode ser uma string que é o nome de um valor do sistema definido; estes nomes são especificados em uma série de padrões (POSIX.1, Unix 95, Unix 98 e outros). Algumas plataformas definem nomes adicionais também. Os nomes conhecidos do sistema operacional hospedeiro são dadas no dicionário ``pathconf_names``. Para variáveis de configuração não incluídas neste mapeamento, também é aceito passar um número inteiro para *name*.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``pathconf_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
pt_br: Se *name* for uma string e não for conhecida, uma exceção :exc:`ValueError` é levantada. Se um valor específico para *name* não for compatível com o sistema hospedeiro, mesmo que seja incluído no ``pathconf_names``, uma exceção :exc:`OSError` é levantada com :const:`errno.EINVAL` como número do erro.

source: As of Python 3.3, this is equivalent to ``os.pathconf(fd, name)``.
pt_br: A partir do Python 3.3, é equivalente a ``os.pathconf(fd, name)``.

source: Get the status of the file descriptor *fd*. Return a :class:`stat_result` object.
pt_br: Captura o estado do descritor de arquivo *fd*. Retorna um objeto :class:`stat_result`.

source: As of Python 3.3, this is equivalent to ``os.stat(fd)``.
pt_br: A partir do Python 3.3, é equivalente a ``os.stat(fd)``.

source: The :func:`.stat` function.
pt_br: A função :func:`.stat`.

source: Return information about the filesystem containing the file associated with file descriptor *fd*, like :func:`statvfs`. As of Python 3.3, this is equivalent to ``os.statvfs(fd)``.
pt_br: Retorna informações sobre o sistema de arquivos que contém o arquivo associado com descritor de arquivo *fd*, como :func:`statvfs`. A partir do Python 3.3, isso equivale a ``os.statvfs(fd)``.

source: Force write of file with filedescriptor *fd* to disk. On Unix, this calls the native :c:func:`!fsync` function; on Windows, the MS :c:func:`!_commit` function.
pt_br: Força a gravação no disco de arquivo com descritor de arquivo *fd*. No Unix, isto chama a função nativa :c:func:`!fsync`; no Windows, a função de MS :c:func:`!_commit`.

source: If you're starting with a buffered Python :term:`file object` *f*, first do ``f.flush()``, and then do ``os.fsync(f.fileno())``, to ensure that all internal buffers associated with *f* are written to disk.
pt_br: Se você estiver começando com um :term:`objeto arquivo <file object>` *f* em buffer do Python, primeiro use ``f.flush()``, e depois use ``os.fsync(f.fileno())``, para garantir que todos os buffers internos associados com *f* sejam gravados no disco.

source: Truncate the file corresponding to file descriptor *fd*, so that it is at most *length* bytes in size. As of Python 3.3, this is equivalent to ``os.truncate(fd, length)``.
pt_br: Trunca o arquivo correspondente ao descritor de arquivo *fd*, de modo que tenha no máximo *length* bytes de tamanho. A partir do Python 3.3, isto é equivalente a ``os.truncate(fd, length)``.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``fd``, ``length``.
pt_br: Levanta :ref:`evento de auditoria <auditing>` ``os.truncate`` com os argumentos ``fd``, ``length``.

source: Added support for Windows
pt_br: Adicionado suporte para o Windows.

source: Get the blocking mode of the file descriptor: ``False`` if the :data:`O_NONBLOCK` flag is set, ``True`` if the flag is cleared.
pt_br: Obtém o modo de bloqueio do descritor de arquivo: ``False`` se o sinalizador :data:`O_NONBLOCK` estiver marcado, ``True`` se o sinalizador estiver desmarcado.

source: See also :func:`set_blocking` and :meth:`socket.socket.setblocking`.
pt_br: Veja também :func:`set_blocking` e :meth:`socket.socket.setblocking`.

source: On Windows, this function is limited to pipes.
pt_br: No Windows, esta função é limitada a encadeamentos.

source: Added support for pipes on Windows.
pt_br: Adicionado suporte a encadeamentos no Windows.

source: Grant access to the slave pseudo-terminal device associated with the master pseudo-terminal device to which the file descriptor *fd* refers. The file descriptor *fd* is not closed upon failure.
pt_br: Concede acesso ao dispositivo pseudoterminal secundário associado ao dispositivo pseudoterminal principal ao qual o descritor de arquivo *fd* se refere. O descritor de arquivo *fd* não é fechado em caso de falha.

source: Calls the C standard library function :c:func:`grantpt`.
pt_br: Chama a função :c:func:`grantpt` da biblioteca padrão C.

source: Return ``True`` if the file descriptor *fd* is open and connected to a tty(-like) device, else ``False``.
pt_br: Retorna ``True`` se o descritor de arquivo *fd* estiver aberto e conectado a um dispositivo do tipo tty, senão ``False``.

source: Apply, test or remove a POSIX lock on an open file descriptor. *fd* is an open file descriptor. *cmd* specifies the command to use - one of :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` or :data:`F_TEST`. *len* specifies the section of the file to lock.
pt_br: Aplica, testa ou remove uma trava POSIX em um descritor de arquivo aberto. *fd* é um descritor de arquivo aberto. *cmd* especifica o comando a ser usado - um dentre :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` ou :data:`F_TEST`. *len* especifica a seção do arquivo para travar.

source: Raises an :ref:`auditing event <auditing>` ``os.lockf`` with arguments ``fd``, ``cmd``, ``len``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.lockf`` com os argumentos ``fd``, ``cmd``, ``len``.

source: Flags that specify what action :func:`lockf` will take.
pt_br: Sinalizadores que especificam qual ação :func:`lockf` vai executar.

source: Prepare the tty of which fd is a file descriptor for a new login session. Make the calling process a session leader; make the tty the controlling tty, the stdin, the stdout, and the stderr of the calling process; close fd.
pt_br: Prepara o tty do qual fd é um descritor de arquivo para uma nova sessão de login. Faz do processo de chamada um líder de sessão; torna o tty o tty de controle, o stdin, o stdout e o stderr do processo de chamada; fecha o fd.

source: Set the current position of file descriptor *fd* to position *pos*, modified by *whence*, and return the new position in bytes relative to the start of the file. Valid values for *whence* are:
pt_br: Define a posição atual do descritor de arquivo *fd* para a posição *pos*, modificada por *whence*, e retorna a nova posição em bytes relativa ao início do arquivo. Os valores válidos de *whence* são:

source: :const:`SEEK_SET` or ``0`` -- set *pos* relative to the beginning of the file
pt_br: :const:`SEEK_SET` ou ``0`` -- define *pos* em relação ao início do arquivo

source: :const:`SEEK_CUR` or ``1`` -- set *pos* relative to the current file position
pt_br: :const:`SEEK_CUR` ou ``1`` -- define *pos* em relação à posição atual do arquivo

source: :const:`SEEK_END` or ``2`` -- set *pos* relative to the end of the file
pt_br: :const:`SEEK_END` ou ``2`` -- define *pos* em relação ao final do arquivo

source: :const:`SEEK_HOLE` -- set *pos* to the next data location, relative to *pos*
pt_br: :const:`SEEK_HOLE` -- define *pos* para o próximo local de dados, em relação a *pos*

source: :const:`SEEK_DATA` -- set *pos* to the next data hole, relative to *pos*
pt_br: :const:`SEEK_DATA` -- define *pos* para o próximo buraco de dados, em relação a *pos*

source: Add support for :const:`!SEEK_HOLE` and :const:`!SEEK_DATA`.
pt_br: Adicionado suporte para :const:`!SEEK_HOLE` e :const:`!SEEK_DATA`.

source: Parameters to the :func:`lseek` function and the :meth:`~io.IOBase.seek` method on :term:`file-like objects <file object>`, for whence to adjust the file position indicator.
pt_br: Parâmetros para a função :func:`lseek` e o método :meth:`~io.IOBase.seek` em :term:`objetos arquivo ou similares <file object>`, para onde ajustar o indicador de posição do arquivo.

source: Adjust the file position relative to the beginning of the file.
pt_br: Ajusta a posição do arquivo em relação ao início do arquivo.

source: Adjust the file position relative to the current file position.
pt_br: Ajusta a posição do arquivo em relação a sua posição atual.

source: Adjust the file position relative to the end of the file.
pt_br: Ajusta a posição do arquivo em relação ao fim do arquivo.

source: Their values are 0, 1, and 2, respectively.
pt_br: Seus valores são 0, 1 e 2, respectivamente.

source: Parameters to the :func:`lseek` function and the :meth:`~io.IOBase.seek` method on :term:`file-like objects <file object>`, for seeking file data and holes on sparsely allocated files.
pt_br: Parâmetros para a função :func:`lseek` e o método :meth:`~io.IOBase.seek` em :term:`objetos arquivo ou similares <file object>`, para para buscar dados de arquivos e buracos em arquivos alocados de forma esparsa.

source: Adjust the file offset to the next location containing data, relative to the seek position.
pt_br: Ajusta o deslocamento do arquivo para o próximo local contendo dados, em relação à posição de busca.

source: Adjust the file offset to the next location containing a hole, relative to the seek position. A hole is defined as a sequence of zeros.
pt_br: Ajusta o deslocamento do arquivo para o próximo local contendo um buraco, em relação à posição de busca. Um buraco é definido como uma sequência de zeros.

source: These operations only make sense for filesystems that support them.
pt_br: Essas operações só fazem sentido para sistemas de arquivos que as suportam.

source: Open the file *path* and set various flags according to *flags* and possibly its mode according to *mode*. When computing *mode*, the current umask value is first masked out. Return the file descriptor for the newly opened file. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
pt_br: Abre o arquivo *path* e define vários sinalizadores de acordo com *flags* e, possivelmente, seu modo, de acordo com *mode*. Ao computar *mode*, o valor atual de umask é primeiro mascarado. Retorna o descritor de arquivo para o arquivo recém-aberto. O novo descritor de arquivo é :ref:`não-herdável <fd_inheritance>`.

source: For a description of the flag and mode values, see the C run-time documentation; flag constants (like :const:`O_RDONLY` and :const:`O_WRONLY`) are defined in the :mod:`os` module. In particular, on Windows adding :const:`O_BINARY` is needed to open files in binary mode.
pt_br: Para ler uma descrição dos valores de sinalizadores e modos, veja a documentação de C; constantes de sinalizador (como :const:`O_RDONLY` e :const:`O_WRONLY`) são definidas no módulo :mod:`os`. Em particular, no Windows é necessário adicionar :const:`O_BINARY` para abrir arquivos em modo binário.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
pt_br: Esta função oferece suporte para :ref:`caminhos relativos aos descritores de diretório <dir_fd>` com o parâmetro *dir_fd*.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``open`` com os argumentos ``path``, ``mode``, ``flags``.

source: This function is intended for low-level I/O. For normal usage, use the built-in function :func:`open`, which returns a :term:`file object` with :meth:`~file.read` and :meth:`~file.write` methods (and many more). To wrap a file descriptor in a file object, use :func:`fdopen`.
pt_br: Esta função é destinada a E/S de baixo nível. Para uso normal, use a função embutida :func:`open`, que retorna um :term:`objeto arquivo <file object>` com os métodos :meth:`~file.read` e :meth:`~file.write` (e muitos mais). Para envolver um descritor de arquivo em um objeto arquivo, use :func:`fdopen`.

source: Added the *dir_fd* parameter.
pt_br: Adicionado o parâmetro *dir_fd*.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
pt_br: Se a chamada de sistema é interrompida e o tratador de sinal não levanta uma exceção, a função agora tenta novamente a chamada de sistema em vez de levantar uma exceção :exc:`InterruptedError` (consulte :pep:`475` para entender a justificativa).

source: Accepts a :term:`path-like object`.
pt_br: Aceita um :term:`objeto caminho ou similar`.
