Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: Create a hard link pointing to *src* named *dst*.
pt_br: Cria um link físico apontando para *src* chamado *dst*.

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`, and :ref:`not following symlinks <follow_symlinks>`. The default value of *follow_symlinks* is ``False`` on Windows.
pt_br: Esta função oferece suporte à especificação de *src_dir_fd* e/ou *dst_dir_fd* para fornecer :ref:`caminhos relativos aos descritores de diretório <dir_fd>` e :ref:`não seguir links simbólicos <follow_symlinks>`. O valor padrão de *follow_symlinks* é ``False`` no Windows.

source: Raises an :ref:`auditing event <auditing>` ``os.link`` with arguments ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.link`` com os argumentos ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.

source: Added Windows support.
pt_br: Adicionado suporte ao Windows.

source: Added the *src_dir_fd*, *dst_dir_fd*, and *follow_symlinks* parameters.
pt_br: Adicionados os parâmetros *src_dir_fd*, *dst_dir_fd* e *follow_symlinks*.

source: Accepts a :term:`path-like object` for *src* and *dst*.
pt_br: Aceita um :term:`objeto caminho ou similar` para *src* e *dst*.

source: Return a list containing the names of the entries in the directory given by *path*. The list is in arbitrary order, and does not include the special entries ``'.'`` and ``'..'`` even if they are present in the directory. If a file is removed from or added to the directory during the call of this function, whether a name for that file be included is unspecified.
pt_br: Retorna uma lista contendo os nomes das entradas no diretório fornecido por *path*. A lista está em ordem arbitrária e não inclui as entradas especiais ``'.'`` e ``'..'`` mesmo se estiverem presentes no diretório. Se um arquivo for removido ou adicionado ao diretório durante a chamada desta função, não é especificado se um nome para esse arquivo deve ser incluído.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the filenames returned will also be of type ``bytes``; in all other circumstances, they will be of type ``str``.
pt_br: *path* pode ser um :term:`objeto caminho ou similar`. Se *path* for do tipo ``bytes`` (direta ou indiretamente por meio da interface :class:`PathLike`), os nomes de arquivo retornados também serão do tipo ``bytes``; em todas as outras circunstâncias, eles serão do tipo ``str``.

source: This function can also support :ref:`specifying a file descriptor <path_fd>`; the file descriptor must refer to a directory.
pt_br: Esta função também pode ter suporte a :ref:`especificar um descritor de arquivo <path_fd>`; o descritor de arquivo deve fazer referência a um diretório.

source: Raises an :ref:`auditing event <auditing>` ``os.listdir`` with argument ``path``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.listdir`` com o argumento ``path``.

source: To encode ``str`` filenames to ``bytes``, use :func:`~os.fsencode`.
pt_br: Para codificar nomes de arquivos ``str`` para ``bytes``, use :func:`~os.fsencode`.

source: The :func:`scandir` function returns directory entries along with file attribute information, giving better performance for many common use cases.
pt_br: A função :func:`scandir` retorna entradas de diretório junto com informações de atributo de arquivo, dando melhor desempenho para muitos casos de uso comuns.

source: The *path* parameter became optional.
pt_br: O parâmetro *path* tornou-se opcional.

source: Added support for specifying *path* as an open file descriptor.
pt_br: Adicionado suporte para especificar *path* como um descritor de arquivo aberto.

source: Return a list containing the names of drives on a Windows system.
pt_br: Retorna uma lista contendo os nomes das unidades em um sistema Windows.

source: A drive name typically looks like ``'C:\\'``. Not every drive name will be associated with a volume, and some may be inaccessible for a variety of reasons, including permissions, network connectivity or missing media. This function does not test for access.
pt_br: Um nome de unidade geralmente se parece com ``'C:\\'``. Nem todo nome de unidade estará associado a um volume e alguns podem estar inacessíveis por vários motivos, incluindo permissões, conectividade de rede ou mídia ausente. Esta função não testa o acesso.

source: May raise :exc:`OSError` if an error occurs collecting the drive names.
pt_br: Pode levantar :exc:`OSError` se ocorrer um erro ao coletar os nomes das unidades.

source: Raises an :ref:`auditing event <auditing>` ``os.listdrives`` with no arguments.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.listdrives`` sem argumentos.

source: Return a list containing the mount points for a volume on a Windows system.
pt_br: Retorna uma lista contendo os pontos de montagem para um volume em um sistema Windows.

source: *volume* must be represented as a GUID path, like those returned by :func:`os.listvolumes`. Volumes may be mounted in multiple locations or not at all. In the latter case, the list will be empty. Mount points that are not associated with a volume will not be returned by this function.
pt_br: *volume* deve ser representado como um caminho GUID, como aqueles retornados por :func:`os.listvolumes`. Os volumes podem ser montados em vários locais ou não. No último caso, a lista estará vazia. Os pontos de montagem que não estão associados a um volume não serão retornados por esta função.

source: The mount points return by this function will be absolute paths, and may be longer than the drive name.
pt_br: Os pontos de montagem retornados por esta função serão caminhos absolutos e podem ser mais longos que o nome da unidade.

source: Raises :exc:`OSError` if the volume is not recognized or if an error occurs collecting the paths.
pt_br: Levanta :exc:`OSError` se o volume não for reconhecido ou se ocorrer um erro ao coletar os caminhos.

source: Raises an :ref:`auditing event <auditing>` ``os.listmounts`` with argument ``volume``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.listmounts`` com o argumento ``volume``.

source: Return a list containing the volumes in the system.
pt_br: Retorna uma lista contendo os volumes no sistema.

source: Volumes are typically represented as a GUID path that looks like ``\\?\Volume{xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}\``. Files can usually be accessed through a GUID path, permissions allowing. However, users are generally not familiar with them, and so the recommended use of this function is to retrieve mount points using :func:`os.listmounts`.
pt_br: Volumes são normalmente representados como um caminho GUID que se parece com ``\\?\Volume{xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx}\``. Os arquivos geralmente podem ser acessados por meio de um caminho GUID, permitindo permissões. No entanto, os usuários geralmente não estão familiarizados com eles e, portanto, o uso recomendado desta função é recuperar pontos de montagem usando :func:`os.listmounts`.

source: May raise :exc:`OSError` if an error occurs collecting the volumes.
pt_br: Pode levantar :exc:`OSError` se ocorrer um erro ao coletar os volumes.

source: Raises an :ref:`auditing event <auditing>` ``os.listvolumes`` with no arguments.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.listvolumes`` sem argumentos.

source: Perform the equivalent of an :c:func:`!lstat` system call on the given path. Similar to :func:`~os.stat`, but does not follow symbolic links. Return a :class:`stat_result` object.
pt_br: Executa o equivalente a uma chamada de sistema :c:func:`!lstat` no caminho fornecido. Semelhante a :func:`~os.stat`, mas não segue links simbólicos. Retorna um objeto :class:`stat_result`.

source: On platforms that do not support symbolic links, this is an alias for :func:`~os.stat`.
pt_br: Em plataformas que não têm suporte a links simbólicos, este é um apelido para :func:`~os.stat`.

source: As of Python 3.3, this is equivalent to ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.
pt_br: No Python 3.3, isso é equivalente a ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.

source: This function can also support :ref:`paths relative to directory descriptors <dir_fd>`.
pt_br: Esta função também pode ter suporte a :ref:`caminhos relativos a descritores de diretório <dir_fd>`.

source: Added support for Windows 6.0 (Vista) symbolic links.
pt_br: Adicionado suporte para links simbólicos do Windows 6.0 (Vista).

source: On Windows, now opens reparse points that represent another path (name surrogates), including symbolic links and directory junctions. Other kinds of reparse points are resolved by the operating system as for :func:`~os.stat`.
pt_br: No Windows, agora abre pontos de nova análise que representam outro caminho (substitutos de nome), incluindo links simbólicos e junções de diretório. Outros tipos de pontos de nova análise são resolvidos pelo sistema operacional como para :func:`~os.stat`.

source: Create a directory named *path* with numeric mode *mode*.
pt_br: Cria um diretório chamado *path* com o modo numérico *mode*.

source: If the directory already exists, :exc:`FileExistsError` is raised. If a parent directory in the path does not exist, :exc:`FileNotFoundError` is raised.
pt_br: Se o diretório já existe, uma exceção :exc:`FileExistsError` é levantada. Se um diretório pai no caminho não existir, uma exceção :exc:`FileNotFoundError` será levantada.

source: On some systems, *mode* is ignored. Where it is used, the current umask value is first masked out. If bits other than the last 9 (i.e. the last 3 digits of the octal representation of the *mode*) are set, their meaning is platform-dependent. On some platforms, they are ignored and you should call :func:`chmod` explicitly to set them.
pt_br: Em alguns sistemas, *mode* é ignorado. Onde ele é usado, o valor atual do umask é primeiro mascarado. Se bits diferentes dos últimos 9 (ou seja, os últimos 3 dígitos da representação octal do *mode*) são definidos, seu significado depende da plataforma. Em algumas plataformas, eles são ignorados e você deve chamar :func:`chmod` explicitamente para defini-los.

source: On Windows, a *mode* of ``0o700`` is specifically handled to apply access control to the new directory such that only the current user and administrators have access. Other values of *mode* are ignored.
pt_br: No Windows, um modo *mode* de ``0o700`` é tratado especificamente para aplicar controle de acesso ao novo diretório de forma que apenas o usuário atual e os administradores tenham acesso. Outros valores de *mode* são ignorados.

source: It is also possible to create temporary directories; see the :mod:`tempfile` module's :func:`tempfile.mkdtemp` function.
pt_br: Também é possível criar diretórios temporários; veja a função :func:`tempfile.mkdtemp` do módulo :mod:`tempfile`.

source: Raises an :ref:`auditing event <auditing>` ``os.mkdir`` with arguments ``path``, ``mode``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.mkdir`` com os argumentos ``path``, ``mode``, ``dir_fd``.

source: Windows now handles a *mode* of ``0o700``.
pt_br: O Windows agora lida com um *mode* de ``0o700``.

source: Recursive directory creation function. Like :func:`mkdir`, but makes all intermediate-level directories needed to contain the leaf directory.
pt_br: Função de criação recursiva de diretório. Como :func:`mkdir`, mas cria todos os diretórios de nível intermediário necessários para conter o diretório folha.

source: The *mode* parameter is passed to :func:`mkdir` for creating the leaf directory; see :ref:`the mkdir() description <mkdir_modebits>` for how it is interpreted. To set the file permission bits of any newly created parent directories you can set the umask before invoking :func:`makedirs`. The file permission bits of existing parent directories are not changed.
pt_br: O parâmetro *mode* é passado para :func:`mkdir` para criar o diretório folha; veja :ref:`a descrição do mkdir() <mkdir_modebits>` para como é interpretado. Para definir os bits de permissão de arquivo de qualquer diretório pai recém-criado, você pode definir o umask antes de invocar :func:`makedirs`. Os bits de permissão de arquivo dos diretórios pais existentes não são alterados.

source: If *exist_ok* is ``False`` (the default), a :exc:`FileExistsError` is raised if the target directory already exists.
pt_br: Se *exist_ok* for ``False`` (o padrão), uma :exc:`FileExistsError` é levantada se o diretório alvo já existir.

source: :func:`makedirs` will become confused if the path elements to create include :data:`pardir` (eg. ".." on UNIX systems).
pt_br: :func:`makedirs` ficará confuso se os elementos do caminho a serem criados incluírem :data:`pardir` (por exemplo, ".." em sistemas UNIX).

source: This function handles UNC paths correctly.
pt_br: Esta função trata os caminhos UNC corretamente.

source: Added the *exist_ok* parameter.
pt_br: Adicionado o parâmetro *exist_ok*.

source: Before Python 3.4.1, if *exist_ok* was ``True`` and the directory existed, :func:`makedirs` would still raise an error if *mode* did not match the mode of the existing directory. Since this behavior was impossible to implement safely, it was removed in Python 3.4.1. See :issue:`21082`.
pt_br: Antes do Python 3.4.1, se *exist_ok* fosse ``True`` e o diretório existisse, :func:`makedirs` ainda levantaria um erro se *mode* não correspondesse ao modo do diretório existente. Como esse comportamento era impossível de implementar com segurança, ele foi removido no Python 3.4.1. Consulte :issue:`21082`.

source: The *mode* argument no longer affects the file permission bits of newly created intermediate-level directories.
pt_br: O argumento *mode* não afeta mais os bits de permissão de arquivo de diretórios de nível intermediário recém-criados.

source: Create a FIFO (a named pipe) named *path* with numeric mode *mode*. The current umask value is first masked out from the mode.
pt_br: Cria um FIFO (um encadeamento nomeado) chamado *path* com o modo numérico *mode*. O valor atual de umask é primeiro mascarado do modo.

source: FIFOs are pipes that can be accessed like regular files. FIFOs exist until they are deleted (for example with :func:`os.unlink`). Generally, FIFOs are used as rendezvous between "client" and "server" type processes: the server opens the FIFO for reading, and the client opens it for writing. Note that :func:`mkfifo` doesn't open the FIFO --- it just creates the rendezvous point.
pt_br: FIFOs são canais que podem ser acessados como arquivos regulares. FIFOs existem até que sejam excluídos (por exemplo, com :func:`os.unlink`). Geralmente, os FIFOs são usados como ponto de encontro entre os processos do tipo "cliente" e "servidor": o servidor abre o FIFO para leitura e o cliente para escrita. Observe que :func:`mkfifo` não abre o FIFO -- apenas cria o ponto de encontro.

source: Create a filesystem node (file, device special file or named pipe) named *path*. *mode* specifies both the permissions to use and the type of node to be created, being combined (bitwise OR) with one of ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK``, and ``stat.S_IFIFO`` (those constants are available in :mod:`stat`). For ``stat.S_IFCHR`` and ``stat.S_IFBLK``, *device* defines the newly created device special file (probably using :func:`os.makedev`), otherwise it is ignored.
pt_br: Cria um nó de sistema de arquivos (arquivo, arquivo especial de dispositivo ou canal nomeado) chamado *path*. *mode* especifica as permissões de uso e o tipo de nó a ser criado, sendo combinado (OU bit a bit) com um de ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK`` , e ``stat.S_IFIFO`` (essas constantes estão disponíveis em :mod:`stat`). Para ``stat.S_IFCHR`` e ``stat.S_IFBLK``, *device* define o arquivo especial do dispositivo recém-criado (provavelmente usando :func:`os.makedev`), caso contrário, ele será ignorado.

source: Extract the device major number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:struct:`stat`).
pt_br: Extrai o número principal de dispositivo de um número bruto de dispositivo (normalmente o campo :attr:`st_dev` ou :attr:`st_rdev` de :c:struct:`stat`).

source: Extract the device minor number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:struct:`stat`).
pt_br: Extrai o número menor de dispositivo de um número bruto de dispositivo (normalmente o campo :attr:`st_dev` ou :attr:`st_rdev` de :c:struct:`stat`).

source: Compose a raw device number from the major and minor device numbers.
pt_br: Compõe um número de dispositivo bruto a partir dos números de dispositivo principais e secundários.

source: Return system configuration information relevant to a named file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
pt_br: Retorna informações de configuração do sistema relevantes para um arquivo nomeado. *name* especifica o valor de configuração a ser recuperado; pode ser uma string que é o nome de um valor de sistema definido; esses nomes são especificados em vários padrões (POSIX.1, Unix 95, Unix 98 e outros). Algumas plataformas também definem nomes adicionais. Os nomes conhecidos do sistema operacional do host são fornecidos no dicionário ``pathconf_names``. Para variáveis de configuração não incluídas nesse mapeamento, passar um número inteiro para *name* também é aceito.

source: This function can support :ref:`specifying a file descriptor <path_fd>`.
pt_br: Esta função tem suporte a :ref:`especificar um descritor de arquivo <path_fd>`.

source: Dictionary mapping names accepted by :func:`pathconf` and :func:`fpathconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
pt_br: Nomes de mapeamento de dicionário aceitos por :func:`pathconf` e :func:`fpathconf` para os valores inteiros definidos para esses nomes pelo sistema operacional do host. Isso pode ser usado para determinar o conjunto de nomes conhecidos pelo sistema.

source: Return a string representing the path to which the symbolic link points. The result may be either an absolute or relative pathname; if it is relative, it may be converted to an absolute pathname using ``os.path.join(os.path.dirname(path), result)``.
pt_br: Retorna uma string representando o caminho para o qual o link simbólico aponta. O resultado pode ser um nome de caminho absoluto ou relativo; se for relativo, pode ser convertido para um caminho absoluto usando ``os.path.join(os.path.dirname(path), result)``.

source: If the *path* is a string object (directly or indirectly through a :class:`PathLike` interface), the result will also be a string object, and the call may raise a UnicodeDecodeError. If the *path* is a bytes object (direct or indirectly), the result will be a bytes object.
pt_br: Se o *path* for um objeto string (direta ou indiretamente por meio de uma interface :class:`PathLike`), o resultado também será um objeto string e a chamada pode levantar um UnicodeDecodeError. Se o *path* for um objeto de bytes (direto ou indireto), o resultado será um objeto de bytes.

source: When trying to resolve a path that may contain links, use :func:`~os.path.realpath` to properly handle recursion and platform differences.
pt_br: Ao tentar resolver um caminho que pode conter links, use :func:`~os.path.realpath` para lidar corretamente com a recursão e as diferenças de plataforma.

source: Accepts a :term:`path-like object` on Unix.
pt_br: Aceita um :term:`objeto caminho ou similar` no Unix.

source: Accepts a :term:`path-like object` and a bytes object on Windows.
pt_br: Aceita um :term:`objeto caminho ou similar` e um objeto bytes no Windows.

source: Added support for directory junctions, and changed to return the substitution path (which typically includes ``\\?\`` prefix) rather than the optional "print name" field that was previously returned.
pt_br: Adicionado suporte para junções de diretório e alterado para retornar o caminho de substituição (que normalmente inclui o prefixo ``\\?\``) ao invés do campo opcional "print name" que era retornado anteriormente.

source: Remove (delete) the file *path*. If *path* is a directory, an :exc:`OSError` is raised. Use :func:`rmdir` to remove directories. If the file does not exist, a :exc:`FileNotFoundError` is raised.
pt_br: Remove (exclui) o arquivo *path*. Se *path* for um diretório, uma :exc:`OSError` é levantada. Use :func:`rmdir` para remover diretórios. Se o arquivo não existir, uma :exc:`FileNotFoundError` é levantada.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>`.
pt_br: Esta função tem suporte a :ref:`caminhos relativos para descritores de diretório <dir_fd>`.

source: On Windows, attempting to remove a file that is in use causes an exception to be raised; on Unix, the directory entry is removed but the storage allocated to the file is not made available until the original file is no longer in use.
pt_br: No Windows, a tentativa de remover um arquivo que está em uso causa o surgimento de uma exceção; no Unix, a entrada do diretório é removida, mas o armazenamento alocado para o arquivo não é disponibilizado até que o arquivo original não esteja mais em uso.

source: This function is semantically identical to :func:`unlink`.
pt_br: Esta função é semanticamente idêntica a :func:`unlink`.

source: Raises an :ref:`auditing event <auditing>` ``os.remove`` with arguments ``path``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.remove`` com os argumentos ``path``, ``dir_fd``.

source: Remove directories recursively. Works like :func:`rmdir` except that, if the leaf directory is successfully removed, :func:`removedirs` tries to successively remove every parent directory mentioned in *path* until an error is raised (which is ignored, because it generally means that a parent directory is not empty). For example, ``os.removedirs('foo/bar/baz')`` will first remove the directory ``'foo/bar/baz'``, and then remove ``'foo/bar'`` and ``'foo'`` if they are empty. Raises :exc:`OSError` if the leaf directory could not be successfully removed.
pt_br: Remove os diretórios recursivamente. Funciona como :func:`rmdir`, exceto que, se o diretório folha for removido com sucesso, :func:`removedirs` tenta remover sucessivamente todos os diretórios pai mencionados em *path* até que um erro seja levantado (que é ignorado, porque geralmente significa que um diretório pai não está vazio). Por exemplo, ``os.removedirs('foo/bar/baz')`` primeiro removerá o diretório ``'foo/bar/baz'``, e então removerá ``'foo/bar'`` e ``'foo'`` se estiverem vazios. Levanta :exc:`OSError` se o diretório folha não pôde ser removido com sucesso.

source: Rename the file or directory *src* to *dst*. If *dst* exists, the operation will fail with an :exc:`OSError` subclass in a number of cases:
pt_br: Renomeia o arquivo ou diretório *src* para *dst*. Se *dst* existir, a operação falhará com uma subclasse de :exc:`OSError` em vários casos:
