Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: When another *operation* is given, it must be a "command verb" that specifies what should be done with the file. Common verbs documented by Microsoft are ``'open'``, ``'print'`` and ``'edit'`` (to be used on files) as well as ``'explore'`` and ``'find'`` (to be used on directories).
pt_br: Quando outra *operation* é fornecida, ela deve ser um "verbo de comando" que especifica o que deve ser feito com o arquivo. Verbos comuns documentados pela Microsoft são ``'open'``, ``'print'`` e ``'edit'`` (para serem usados em arquivos), bem como ``'explore'`` e ``'find'`` (para serem usados em diretórios).

source: When launching an application, specify *arguments* to be passed as a single string. This argument may have no effect when using this function to launch a document.
pt_br: Ao iniciar uma aplicação, especifique *arguments* a serem passados como uma única string. Este argumento pode não ter efeito quando esta função é usada para iniciar um documento.

source: The default working directory is inherited, but may be overridden by the *cwd* argument. This should be an absolute path. A relative *path* will be resolved against this argument.
pt_br: O diretório de trabalho padrão é herdado, mas pode ser substituído pelo argumento *cwd*. Este deve ser um caminho absoluto. Um *path* relativo será resolvido levando em consideração este argumento.

source: Use *show_cmd* to override the default window style. Whether this has any effect will depend on the application being launched. Values are integers as supported by the Win32 :c:func:`!ShellExecute` function.
pt_br: Use *show_cmd* para substituir o estilo de janela padrão. Se isso terá algum efeito irá depender da aplicação sendo iniciada. Os valores são inteiros conforme implementado pela função Win32 :c:func:`!ShellExecute`.

source: :func:`startfile` returns as soon as the associated application is launched. There is no option to wait for the application to close, and no way to retrieve the application's exit status. The *path* parameter is relative to the current directory or *cwd*. If you want to use an absolute path, make sure the first character is not a slash (``'/'``) Use :mod:`pathlib` or the :func:`os.path.normpath` function to ensure that paths are properly encoded for Win32.
pt_br: :func:`startfile` retorna assim que a aplicação associada é iniciada. Não há opção de aguardar o fechamento da aplicação, e nenhuma maneira de recuperar o status de saída da aplicação. O parâmetro *path* é relativo ao diretório atual ou ao *cwd*. Se você quiser usar um caminho absoluto, certifique-se que o primeiro caractere não seja uma barra (``'/'``). Use :mod:`pathlib` ou a função :func:`os.path.normpath` para garantir que os caminhos sejam codificados corretamente para Win32.

source: To reduce interpreter startup overhead, the Win32 :c:func:`!ShellExecute` function is not resolved until this function is first called. If the function cannot be resolved, :exc:`NotImplementedError` will be raised.
pt_br: Para reduzir a sobrecarga de inicialização do interpretador, a função Win32 :c:func:`!ShellExecute` não é resolvida até que esta função seja chamada pela primeira vez. Se a função não puder ser resolvida, uma exceção :exc:`NotImplementedError` será levantada.

source: Raises an :ref:`auditing event <auditing>` ``os.startfile`` with arguments ``path``, ``operation``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.startfile`` com os argumentos ``path`` e ``operation``.

source: Raises an :ref:`auditing event <auditing>` ``os.startfile/2`` with arguments ``path``, ``operation``, ``arguments``, ``cwd``, ``show_cmd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.startfile/2`` com os argumentos ``path``, ``operation``, ``arguments``, ``cwd`` e ``show_cmd``.

source: Added the *arguments*, *cwd* and *show_cmd* arguments, and the ``os.startfile/2`` audit event.
pt_br: Adicionados os argumentos *arguments*, *cwd* e *show_cmd*, e o evento de auditoria ``os.startfile/2``.

source: Execute the command (a string) in a subshell. This is implemented by calling the Standard C function :c:func:`system`, and has the same limitations. Changes to :data:`sys.stdin`, etc. are not reflected in the environment of the executed command. If *command* generates any output, it will be sent to the interpreter standard output stream. The C standard does not specify the meaning of the return value of the C function, so the return value of the Python function is system-dependent.
pt_br: Executa o comando (uma string) em um subshell. Isso é implementado chamando a função C padrão :c:func:`system`, e tem as mesmas limitações. Alterações em :data:`sys.stdin` etc. não são refletidas no ambiente do comando executado. Se *command* gerar qualquer saída, ela será enviada ao fluxo de saída padrão do interpretador. O padrão C não especifica o significado do valor de retorno da função C, então o valor de retorno da função Python depende do sistema.

source: On Unix, the return value is the exit status of the process encoded in the format specified for :func:`wait`.
pt_br: No Unix, o valor de retorno é o status de saída do processo codificado no formato especificado para :func:`wait`.

source: On Windows, the return value is that returned by the system shell after running *command*. The shell is given by the Windows environment variable :envvar:`COMSPEC`: it is usually :program:`cmd.exe`, which returns the exit status of the command run; on systems using a non-native shell, consult your shell documentation.
pt_br: No Windows, o valor de retorno é aquele retornado pelo shell do sistema após a execução de *command*. O shell é fornecido pela variável de ambiente Windows :envvar:`COMSPEC`: normalmente é :program:`cmd.exe`, que retorna o status de saída da execução do comando; em sistemas que usam um shell não nativo, consulte a documentação do shell.

source: The :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is recommended to using this function. See the :ref:`subprocess-replacements` section in the :mod:`subprocess` documentation for some helpful recipes.
pt_br: O módulo :mod:`subprocess` fornece recursos mais poderosos para gerar novos processos e recuperar seus resultados; usar esse módulo é recomendado a usar esta função. Veja a seção :ref:`subprocess-replacements` na documentação do :mod:`subprocess` para algumas receitas úteis.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the result (exit status) into an exit code. On Windows, the result is directly the exit code.
pt_br: No Unix, :func:`waitstatus_to_exitcode` pode ser usada para converter o resultado (status de saída) em um código de saída. No Windows, o resultado é diretamente o código de saída.

source: Raises an :ref:`auditing event <auditing>` ``os.system`` with argument ``command``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.system`` com o argumento ``command``.

source: Returns the current global process times. The return value is an object with five attributes:
pt_br: Retorna os tempos do processo global atual. O valor de retorno é um objeto com cinco atributos:

source: :attr:`!user` - user time
pt_br: :attr:`!user` - tempo do usuário

source: :attr:`!system` - system time
pt_br: :attr:`!system` - tempo do sistema

source: :attr:`!children_user` - user time of all child processes
pt_br: :attr:`!children_user` - tempo do usuário de todos os processos filhos

source: :attr:`!children_system` - system time of all child processes
pt_br: :attr:`!children_system` - tempo do sistema de todos os processos filhos

source: :attr:`!elapsed` - elapsed real time since a fixed point in the past
pt_br: :attr:`!elapsed` - tempo real decorrido desde um ponto fixo no passado

source: For backwards compatibility, this object also behaves like a five-tuple containing :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system`, and :attr:`!elapsed` in that order.
pt_br: Para compatibilidade com versões anteriores, esse objeto também se comporta como uma tupla de 5 elementos contendo :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system` e :attr:`!elapsed` nessa ordem.

source: See the Unix manual page :manpage:`times(2)` and `times(3) <https://man.freebsd.org/cgi/man.cgi?time(3)>`_ manual page on Unix or `the GetProcessTimes MSDN <https://docs.microsoft.com/windows/win32/api/processthreadsapi/nf-processthreadsapi-getprocesstimes>`_ on Windows. On Windows, only :attr:`!user` and :attr:`!system` are known; the other attributes are zero.
pt_br: Consulte as páginas de manual :manpage:`times(2)` e `times(3) <https://man.freebsd.org/cgi/man.cgi?time(3)>`_ no Unix ou `o GetProcessTimes MSDN <https://docs.microsoft.com/windows/win32/api/processthreadsapi/nf-processthreadsapi-getprocesstimes>`_ no Windows. No Windows, apenas :attr:`!user` e :attr:`!system` são conhecidos; os outros atributos são zero.

source: Wait for completion of a child process, and return a tuple containing its pid and exit status indication: a 16-bit number, whose low byte is the signal number that killed the process, and whose high byte is the exit status (if the signal number is zero); the high bit of the low byte is set if a core file was produced.
pt_br: Aguarda a conclusão de um processo filho e retorna uma tupla contendo seu pid e indicação de status de saída: um número de 16 bits, cujo byte baixo é o número do sinal que interrompeu o processo e cujo byte alto é o status de saída (se o número do sinal é zero); o bit alto do byte baixo é definido se um arquivo principal foi produzido.

source: If there are no children that could be waited for, :exc:`ChildProcessError` is raised.
pt_br: Se não houver filhos que possam ser aguardados, uma exceção :exc:`ChildProcessError` é levantada.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
pt_br: :func:`waitstatus_to_exitcode` pode ser usado para converter o status de saída em um código de saída.

source: The other :func:`!wait*` functions documented below can be used to wait for the completion of a specific child process and have more options. :func:`waitpid` is the only one also available on Windows.
pt_br: As outras funções :func:`!wait*` documentadas abaixo podem ser usadas para aguardar a conclusão de um processo filho específico e ter mais opções. :func:`waitpid` é o único também disponível no Windows.

source: Wait for the completion of a child process.
pt_br: Aguarda a conclusão de um processo filho.

source: *idtype* can be :data:`P_PID`, :data:`P_PGID`, :data:`P_ALL`, or (on Linux) :data:`P_PIDFD`. The interpretation of *id* depends on it; see their individual descriptions.
pt_br: *idtype* pode ser :data:`P_PID`, :data:`P_PGID`, :data:`P_ALL` ou (no Linux) :data:`P_PIDFD`. A interpretação de *id* depende disso; veja suas descrições individuais.

source: *options* is an OR combination of flags. At least one of :data:`WEXITED`, :data:`WSTOPPED` or :data:`WCONTINUED` is required; :data:`WNOHANG` and :data:`WNOWAIT` are additional optional flags.
pt_br: *options* é uma combinação OU de sinalizadores. Pelo menos um entre :data:`WEXITED`, :data:`WSTOPPED` ou :data:`WCONTINUED` é obrigatório; :data:`WNOHANG` e :data:`WNOWAIT` são sinalizadores opcionais adicionais.

source: The return value is an object representing the data contained in the :c:type:`siginfo_t` structure with the following attributes:
pt_br: O valor de retorno é um objeto que representa os dados contidos na estrutura :c:type:`siginfo_t` com os seguintes atributos:

source: :attr:`!si_pid` (process ID)
pt_br: :attr:`!si_pid` (ID do processo)

source: :attr:`!si_uid` (real user ID of the child)
pt_br: :attr:`!si_uid` (ID de usuário real do filho)

source: :attr:`!si_signo` (always :const:`~signal.SIGCHLD`)
pt_br: :attr:`!si_signo` (sempre :const:`~signal.SIGCHLD`)

source: :attr:`!si_status` (the exit status or signal number, depending on :attr:`!si_code`)
pt_br: :attr:`!si_status` (o status de saída ou número do sinal, dependendo de :attr:`!si_code`)

source: :attr:`!si_code` (see :data:`CLD_EXITED` for possible values)
pt_br: :attr:`!si_code` (veja :data:`CLD_EXITED` para possíveis valores)

source: If :data:`WNOHANG` is specified and there are no matching children in the requested state, ``None`` is returned. Otherwise, if there are no matching children that could be waited for, :exc:`ChildProcessError` is raised.
pt_br: Se :data:`WNOHANG` for especificado e não houver filhos correspondentes no estado solicitado, ``None`` será retornado. Caso contrário, se não houver filhos correspondentes que possam ser esperados, :exc:`ChildProcessError` será levantada.

source: This function is now available on macOS as well.
pt_br: Esta função agora também está disponível no MacOS.

source: The details of this function differ on Unix and Windows.
pt_br: Os detalhes desta função diferem no Unix e no Windows.

source: On Unix: Wait for completion of a child process given by process id *pid*, and return a tuple containing its process id and exit status indication (encoded as for :func:`wait`). The semantics of the call are affected by the value of the integer *options*, which should be ``0`` for normal operation.
pt_br: No Unix: aguarda a conclusão de um processo filho dado pelo id de processo *pid* e retorna uma tupla contendo seu id de processo e indicação de status de saída (codificado como para :func:`wait`). A semântica da chamada é afetada pelo valor do inteiro *options*, que deve ser ``0`` para operação normal.

source: If *pid* is greater than ``0``, :func:`waitpid` requests status information for that specific process. If *pid* is ``0``, the request is for the status of any child in the process group of the current process. If *pid* is ``-1``, the request pertains to any child of the current process. If *pid* is less than ``-1``, status is requested for any process in the process group ``-pid`` (the absolute value of *pid*).
pt_br: Se *pid* for maior que ``0``, :func:`waitpid` solicita informações de status para aquele processo específico. Se *pid* for ``0``, a solicitação é para o status de qualquer filho no grupo de processos do processo atual. Se *pid* for ``-1``, a solicitação pertence a qualquer filho do processo atual. Se *pid* for menor que ``-1``, o status é solicitado para qualquer processo no grupo de processos ``-pid`` (o valor absoluto de *pid*).

source: *options* is an OR combination of flags. If it contains :data:`WNOHANG` and there are no matching children in the requested state, ``(0, 0)`` is returned. Otherwise, if there are no matching children that could be waited for, :exc:`ChildProcessError` is raised. Other options that can be used are :data:`WUNTRACED` and :data:`WCONTINUED`.
pt_br: *options* é uma combinação OU de sinalizadores. Se contiver :data:`WNOHANG` e não houver filhos correspondentes no estado solicitado, ``(0, 0)`` será retornado. Caso contrário, se não houver filhos correspondentes que possam ser esperados, :exc:`ChildProcessError` será levantada. Outras opções que podem ser usadas são :data:`WUNTRACED` e :data:`WCONTINUED`.

source: On Windows: Wait for completion of a process given by process handle *pid*, and return a tuple containing *pid*, and its exit status shifted left by 8 bits (shifting makes cross-platform use of the function easier). A *pid* less than or equal to ``0`` has no special meaning on Windows, and raises an exception. The value of integer *options* has no effect. *pid* can refer to any process whose id is known, not necessarily a child process. The :func:`spawn\* <spawnl>` functions called with :const:`P_NOWAIT` return suitable process handles.
pt_br: No Windows: aguarda a conclusão de um processo fornecido pelo identificador de processo *pid* e retorna uma tupla contendo *pid*, e seu status de saída deslocado 8 bits para a esquerda (o deslocamento torna o uso da função em várias plataformas mais fácil). Um *pid* menor ou igual a ``0`` não tem nenhum significado especial no Windows e levanta uma exceção. O valor de inteiros *options* não tem efeito. *pid* pode se referir a qualquer processo cujo id é conhecido, não necessariamente um processo filho. As funções :func:`spawn\* <spawnl>` chamadas com :const:`P_NOWAIT` retornam manipuladores de processo adequados.

source: Similar to :func:`waitpid`, except no process id argument is given and a 3-element tuple containing the child's process id, exit status indication, and resource usage information is returned. Refer to :func:`resource.getrusage` for details on resource usage information. The *options* argument is the same as that provided to :func:`waitpid` and :func:`wait4`.
pt_br: Semelhante a :func:`waitpid`, exceto que nenhum argumento de id de processo é fornecido e uma tupla de 3 elementos contendo o id do processo filho, indicação de status de saída e informações de uso de recursos é retornada. Consulte :func:`resource.getrusage` para obter detalhes sobre as informações de uso de recursos. O argumento *option* é o mesmo fornecido para :func:`waitpid` e :func:`wait4`.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exitcode.
pt_br: :func:`waitstatus_to_exitcode` pode ser usado para converter o status de saída em um código de saída.

source: Similar to :func:`waitpid`, except a 3-element tuple, containing the child's process id, exit status indication, and resource usage information is returned. Refer to :func:`resource.getrusage` for details on resource usage information. The arguments to :func:`wait4` are the same as those provided to :func:`waitpid`.
pt_br: Semelhante a :func:`waitpid`, exceto uma tupla de 3 elementos, contendo o id do processo filho, indicação de status de saída e informações de uso de recursos é retornada. Consulte :func:`resource.getrusage` para obter detalhes sobre as informações de uso de recursos. Os argumentos para :func:`wait4` são os mesmos que aqueles fornecidos a :func:`waitpid`.

source: These are the possible values for *idtype* in :func:`waitid`. They affect how *id* is interpreted:
pt_br: Estes são os valores possíveis para *idtype* em :func:`waitid`. Eles afetam como *id* é interpretado:

source: :data:`!P_PID` - wait for the child whose PID is *id*.
pt_br: :data:`!P_PID` - espera pelo filho cujo PID é *id*.

source: :data:`!P_PGID` - wait for any child whose progress group ID is *id*.
pt_br: :data:`!P_PGID` - espera por qualquer filho cujo ID do grupo de progresso seja *id*.

source: :data:`!P_ALL` - wait for any child; *id* is ignored.
pt_br: :data:`!P_ALL` - espera por qualquer filho; *id* é ignorado.

source: :data:`!P_PIDFD` - wait for the child identified by the file descriptor *id* (a process file descriptor created with :func:`pidfd_open`).
pt_br: :data:`!P_PIDFD` - espera pelo filho identificado pelo descritor de arquivo *id* (um descritor de arquivo de processo criado com :func:`pidfd_open`).

source: :data:`!P_PIDFD` is only available on Linux >= 5.4.
pt_br: :data:`!P_PIDFD` só está disponível no Linux >= 5.4.

source: The :data:`!P_PIDFD` constant.
pt_br: A constante :data:`!P_PIDFD`.

source: This *options* flag for :func:`waitpid`, :func:`wait3`, :func:`wait4`, and :func:`waitid` causes child processes to be reported if they have been continued from a job control stop since they were last reported.
pt_br: Este sinalizador *options* para :func:`waitpid`, :func:`wait3`, :func:`wait4` e :func:`waitid` faz com que os processos filhos sejam reportados se eles tiverem continuado de uma parada de controle de trabalho desde que foram reportados pela última vez.

source: This *options* flag for :func:`waitid` causes child processes that have terminated to be reported.
pt_br: Este sinalizador *options* para :func:`waitid` faz com que os processos filhos que terminaram sejam reportados.

source: The other ``wait*`` functions always report children that have terminated, so this option is not available for them.
pt_br: As outras funções ``wait*`` sempre reportam filhos que terminaram, então esta opção não está disponível para eles.

source: This *options* flag for :func:`waitid` causes child processes that have been stopped by the delivery of a signal to be reported.
pt_br: Este sinalizador *options* para :func:`waitid` faz com que os processos filhos que foram parados pela entrega de um sinal sejam reportados.

source: This option is not available for the other ``wait*`` functions.
pt_br: Esta opção não está disponível para as outras funções ``wait*``.

source: This *options* flag for :func:`waitpid`, :func:`wait3`, and :func:`wait4` causes child processes to also be reported if they have been stopped but their current state has not been reported since they were stopped.
pt_br: Este sinalizador de *options* para :func:`waitpid`, :func:`wait3` e :func:`wait4` faz com que os processos filho também sejam reportados se eles foram interrompidos, mas seu estado atual não foi reportado desde que foram parados.

source: This option is not available for :func:`waitid`.
pt_br: Esta opção não está disponível para :func:`waitid`.

source: This *options* flag causes :func:`waitpid`, :func:`wait3`, :func:`wait4`, and :func:`waitid` to return right away if no child process status is available immediately.
pt_br: Este sinalizador *options* faz com que :func:`waitpid`, :func:`wait3`, :func:`wait4` e :func:`waitid` retornem imediatamente se nenhum status de processo filho estiver disponível imediatamente.

source: This *options* flag causes :func:`waitid` to leave the child in a waitable state, so that a later :func:`!wait*` call can be used to retrieve the child status information again.
pt_br: Este sinalizador *options* faz com que :func:`waitid` deixe o filho em um estado de espera, para que uma chamada :func:`!wait*` posterior possa ser usada para recuperar as informações de status do filho novamente.

source: These are the possible values for :attr:`!si_code` in the result returned by :func:`waitid`.
pt_br: Estes são os valores possíveis para :attr:`!si_code` no resultado retornado por :func:`waitid`.

source: Added :data:`CLD_KILLED` and :data:`CLD_STOPPED` values.
pt_br: Adicionados os valores :data:`CLD_KILLED` e :data:`CLD_STOPPED`.

source: Convert a wait status to an exit code.
pt_br: Converte um status de espera em um código de saída.

source: On Unix:
pt_br: No Unix:

source: If the process exited normally (if ``WIFEXITED(status)`` is true), return the process exit status (return ``WEXITSTATUS(status)``): result greater than or equal to 0.
pt_br: Se o processo saiu normalmente (se ``WIFEXITED(status)`` for verdadeiro), retorna o status de saída do processo (retorna ``WEXITSTATUS(status)``): resultado maior ou igual a 0.

source: If the process was terminated by a signal (if ``WIFSIGNALED(status)`` is true), return ``-signum`` where *signum* is the number of the signal that caused the process to terminate (return ``-WTERMSIG(status)``): result less than 0.
pt_br: Se o processo foi encerrado por um sinal (se ``WIFSIGNALED(status)`` for verdadeiro), retorna ``-signum`` onde *signum* é o número do sinal que causou o encerramento do processo (retorna ``-WTERMSIG(status)``): resultado menor que 0.

source: Otherwise, raise a :exc:`ValueError`.
pt_br: Do contrário, levanta uma exceção :exc:`ValueError`.

source: On Windows, return *status* shifted right by 8 bits.
pt_br: No Windows, retorna *status* deslocado para a direita em 8 bits.
