Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: Create an anonymous file and return a file descriptor that refers to it. *flags* must be one of the ``os.MFD_*`` constants available on the system (or a bitwise ORed combination of them). By default, the new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
pt_br: Cria um arquivo anônimo e retorna um descritor de arquivo que faça referência a ele. *flags* deve ser uma das constantes ``os.MFD_*`` disponíveis no sistema (ou uma combinação de OU bit a bit delas). Por padrão, o novo descritor de arquivo é :ref:`não herdável <fd_inheritance>`.

source: The name supplied in *name* is used as a filename and will be displayed as the target of the corresponding symbolic link in the directory ``/proc/self/fd/``. The displayed name is always prefixed with ``memfd:`` and serves only for debugging purposes. Names do not affect the behavior of the file descriptor, and as such multiple files can have the same name without any side effects.
pt_br: O nome fornecido em *name* é usado como um nome de arquivo e será exibido como o destino do link simbólico correspondente no diretório ``/proc/self/fd/``. O nome exibido é sempre prefixado com ``memfd:`` e serve apenas para fins de depuração. Os nomes não afetam o comportamento do descritor de arquivo e, como tal, vários arquivos podem ter o mesmo nome sem quaisquer efeitos colaterais.

source: These flags can be passed to :func:`memfd_create`.
pt_br: Esses sinalizadores podem ser passados para :func:`memfd_create`.

source: The ``MFD_HUGE*`` flags are only available since Linux 4.14.
pt_br: Os sinalizadores ``MFD_HUGE*`` estão disponíveis somente a partir do Linux 4.14.

source: Create and return an event file descriptor. The file descriptors supports raw :func:`read` and :func:`write` with a buffer size of 8, :func:`~select.select`, :func:`~select.poll` and similar. See man page :manpage:`eventfd(2)` for more information. By default, the new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
pt_br: Cria e retorna um descritor de arquivo de evento. Os descritores de arquivo implementam :func:`read` e :func:`write` brutos com um tamanho de buffer de 8, :func:`~select.select`, :func:`~select.poll` e similares. Veja a página man :manpage:`eventfd(2)` para mais informações. Por padrão, o novo descritor de arquivo é :ref:`não herdável <fd_inheritance>`.

source: *initval* is the initial value of the event counter. The initial value must be a 32 bit unsigned integer. Please note that the initial value is limited to a 32 bit unsigned int although the event counter is an unsigned 64 bit integer with a maximum value of 2\ :sup:`64`\ -\ 2.
pt_br: *initval* é o valor inicial do contador de evento. O valor inicial deve ser um inteiro sem sinal de 32 bits. Observe que o valor inicial é limitado a um inteiro sem sinal de 32 bits ainda que o contador de evento seja um inteiro de 64 bits com um valor máximo de 2\ :sup:`64`\ -\ 2.

source: *flags* can be constructed from :const:`EFD_CLOEXEC`, :const:`EFD_NONBLOCK`, and :const:`EFD_SEMAPHORE`.
pt_br: *flags* podem ser construídas a partir de :const:`EFD_CLOEXEC`, :const:`EFD_NONBLOCK` e :const:`EFD_SEMAPHORE`.

source: If :const:`EFD_SEMAPHORE` is specified and the event counter is non-zero, :func:`eventfd_read` returns 1 and decrements the counter by one.
pt_br: Se :const:`EFD_SEMAPHORE` for especificado e o contador de evento for diferente de zero, :func:`eventfd_read` retorna 1 e decrementa o contador em um.

source: If :const:`EFD_SEMAPHORE` is not specified and the event counter is non-zero, :func:`eventfd_read` returns the current event counter value and resets the counter to zero.
pt_br: Se :const:`EFD_SEMAPHORE` não for especificado e o contador de evento for diferente de zero, :func:`eventfd_read` retorna o valor atual do contador de evento e zera o contador.

source: If the event counter is zero and :const:`EFD_NONBLOCK` is not specified, :func:`eventfd_read` blocks.
pt_br: Se o contador de evento for zero e :const:`EFD_NONBLOCK` não for especificado, :func:`eventfd_read` bloqueia.

source: :func:`eventfd_write` increments the event counter. Write blocks if the write operation would increment the counter to a value larger than 2\ :sup:`64`\ -\ 2.
pt_br: :func:`eventfd_write` incrementa o contador de evento. A escrita bloqueia se a operação de escrita incrementar o contador para um valor maior que 2\ :sup:`64`\ -\ 2.

source: import os # semaphore with start value '1' fd = os.eventfd(1, os.EFD_SEMAPHORE | os.EFC_CLOEXEC) try: # acquire semaphore v = os.eventfd_read(fd) try: do_work() finally: # release semaphore os.eventfd_write(fd, v) finally: os.close(fd)
pt_br: import os # semáforo com valor inicial '1' fd = os.eventfd(1, os.EFD_SEMAPHORE | os.EFC_CLOEXEC) try: # adquire o semário v = os.eventfd_read(fd) try: faz_o_trabalho() finally: # libera o semáforo os.eventfd_write(fd, v) finally: os.close(fd)

source: Read value from an :func:`eventfd` file descriptor and return a 64 bit unsigned int. The function does not verify that *fd* is an :func:`eventfd`.
pt_br: Lê um valor de um descritor de arquivo :func:`eventfd` e retorna um inteiro sem sinal de 64 bits. A função não verifica se *fd* é um :func:`eventfd`.

source: Add value to an :func:`eventfd` file descriptor. *value* must be a 64 bit unsigned int. The function does not verify that *fd* is an :func:`eventfd`.
pt_br: Adiciona *value* a um descritor de arquivo :func:`eventfd`. *value* deve ser um inteiro sem sinal de 64 bits. A função não verifica se *fd* é um :func:`eventfd`.

source: Set close-on-exec flag for new :func:`eventfd` file descriptor.
pt_br: Define sinalizador close-on-exec para o novo descritor de arquivo :func:`eventfd`.

source: Set :const:`O_NONBLOCK` status flag for new :func:`eventfd` file descriptor.
pt_br: Define sinalizador de status :const:`O_NONBLOCK` para um novo descritor de arquivo :func:`eventfd`.

source: Provide semaphore-like semantics for reads from an :func:`eventfd` file descriptor. On read the internal counter is decremented by one.
pt_br: Fornece semântica de semáforo ou similar para leitura de um descritor de arquivo :func:`eventfd`. Na leitura o contador interno é decrementado em um.

source: Timer File Descriptors
pt_br: Descritores de arquivo de temporizador

source: These functions provide support for Linux's *timer file descriptor* API. Naturally, they are all only available on Linux.
pt_br: Essas funções fornecem suporte para a API de *descritores de arquivo de temporizador*.

source: Create and return a timer file descriptor (*timerfd*).
pt_br: Cria e retorna um descritor de arquivo de temporizador (*timerfd*).

source: The file descriptor returned by :func:`timerfd_create` supports:
pt_br: O descritor de arquivo retornado por :func:`timerfd_create` implementa:

source: The file descriptor's :func:`read` method can be called with a buffer size of 8. If the timer has already expired one or more times, :func:`read` returns the number of expirations with the host's endianness, which may be converted to an :class:`int` by ``int.from_bytes(x, byteorder=sys.byteorder)``.
pt_br: O método :func:`read` do descritor de arquivo pode ser chamado com um buffer de tamanho 8. Se o temporizador já expirou uma ou mais vezes, :func:`read` retorna o número de vezes que o descritor expirou com a ordem dos bytes no formato do hospedeiro, que pode ser convertido para um :class:`int` com ``int.from_bytes(x, byteorder=sys.byteorder)``.

source: :func:`~select.select` and :func:`~select.poll` can be used to wait until timer expires and the file descriptor is readable.
pt_br: :func:`~select.select` e :func:`~select.poll` pode ser usado para esperar até que o temporizador expire e o descritor de arquivo possa ser lido.

source: *clockid* must be a valid :ref:`clock ID <time-clock-id-constants>`, as defined in the :py:mod:`time` module:
pt_br: *clockid* deve ser um :ref:`ID de relógio <time-clock-id-constants>` válido, conforme definido no módulo :py:mod:`time`:

source: :const:`time.CLOCK_BOOTTIME` (Since Linux 3.15 for timerfd_create)
pt_br: :const:`time.CLOCK_BOOTTIME` (A partir de Linux 3.15 para timerfd_create)

source: If *clockid* is :const:`time.CLOCK_REALTIME`, a settable system-wide real-time clock is used. If system clock is changed, timer setting need to be updated. To cancel timer when system clock is changed, see :const:`TFD_TIMER_CANCEL_ON_SET`.
pt_br: Se *clockid* é :const:`time.CLOCK_REALTIME`, é usado um relógio em tempo real definido em todo o sistema. Se o relógio do sistema muda, a configuração do temporizador precisa ser atualizado. Para cancelar o temporizador quando o relógio do sistema é alterado, veja :const:`TFD_TIMER_CANCEL_ON_SET`.

source: If *clockid* is :const:`time.CLOCK_MONOTONIC`, a non-settable monotonically increasing clock is used. Even if the system clock is changed, the timer setting will not be affected.
pt_br: Se *clockid* é :const:`time.CLOCK_MONOTONIC`, é usado um relógio monotonicamente não estável. Mesmo se o relógio do sistema é alterado, a configuração do temporizador não será afetada.

source: If *clockid* is :const:`time.CLOCK_BOOTTIME`, same as :const:`time.CLOCK_MONOTONIC` except it includes any time that the system is suspended.
pt_br: Se *clockid* é :const:`time.CLOCK_BOOTTIME`, é idêntica a :const:`time.CLOCK_MONOTONIC` exceto por incluir qualquer tempo que o sistema está suspenso.

source: The file descriptor's behaviour can be modified by specifying a *flags* value. Any of the following variables may used, combined using bitwise OR (the ``|`` operator):
pt_br: O comportamento do descritor de arquivo pode ser modificado especificando um valor para *flags*. Qualquer um dos seguintes valores pode ser usado, combinadas usando OU (OR) bit a bit (o operador ``|``):

source: If :const:`TFD_NONBLOCK` is not set as a flag, :func:`read` blocks until the timer expires. If it is set as a flag, :func:`read` doesn't block, but If there hasn't been an expiration since the last call to read, :func:`read` raises :class:`OSError` with ``errno`` is set to :const:`errno.EAGAIN`.
pt_br: Se :const:`TFD_NONBLOCK` não está definido como um sinalizador, :func:`read` bloqueia até o temporizador expirar. Se está definido como um sinalizador, :func:`read` não bloqueia, mas se não expirou desde a última chamada, :func:`read` levanta :class:`OSError` com ``errno`` definido como :const:`errno.EAGAIN`.

source: :const:`TFD_CLOEXEC` is always set by Python automatically.
pt_br: :const:`TFD_CLOEXEC` é sempre definido pelo Python automaticamente.

source: The file descriptor must be closed with :func:`os.close` when it is no longer needed, or else the file descriptor will be leaked.
pt_br: O descritor de arquivo deve ser fechado com :func:`os.close` quando não é mais necessário, caso contrário o descritor de arquivo será vazado.

source: The :manpage:`timerfd_create(2)` man page.
pt_br: A página man :manpage:`timerfd_create(2)`.

source: Alter a timer file descriptor's internal timer. This function operates the same interval timer as :func:`timerfd_settime_ns`.
pt_br: Altera um temporizador interno do descritor de arquivo de temporizador. Essa função opera no mesmo intervalo do temporizador definido com :func:`timerfd_settime_ns`.

source: *fd* must be a valid timer file descriptor.
pt_br: *fd* deve ser um descritor de arquivo de temporizador válido.

source: The timer's behaviour can be modified by specifying a *flags* value. Any of the following variables may used, combined using bitwise OR (the ``|`` operator):
pt_br: O comportamento do temporizador pode ser modificado especificando um valor para *flags*. Qualquer um dos seguintes valores pode ser usado, combinados usando OU (OR) bit a bit (o operador ``|``):

source: The timer is disabled by setting *initial* to zero (``0``). If *initial* is equal to or greater than zero, the timer is enabled. If *initial* is less than zero, it raises an :class:`OSError` exception with ``errno`` set to :const:`errno.EINVAL`
pt_br: O temporizador é desabilitado definindo *initial* para zero (``0``). Se *initial* é igual ou maior que zero, o temporizador é habilitado. Se *initial* é menor que zero, uma exceção :class:`OSError` é levantada com ``errno`` definido como :const:`errno.EINVAL`.

source: By default the timer will fire when *initial* seconds have elapsed. (If *initial* is zero, timer will fire immediately.)
pt_br: Por padrão, o temporizador vai disparar quando passarem *initial* segundos. (Se *initial* é zero, o temporizador dispara imediatamente.)

source: However, if the :const:`TFD_TIMER_ABSTIME` flag is set, the timer will fire when the timer's clock (set by *clockid* in :func:`timerfd_create`) reaches *initial* seconds.
pt_br: Contudo, se o sinalizador :const:`TFD_TIMER_ABSTIME` está definido, o temporizador dispara quando o relógio do temporizador (definido por *clockid* em :func:`timerfd_create`) atingir *initial* segundos.

source: The timer's interval is set by the *interval* :py:class:`float`. If *interval* is zero, the timer only fires once, on the initial expiration. If *interval* is greater than zero, the timer fires every time *interval* seconds have elapsed since the previous expiration. If *interval* is less than zero, it raises :class:`OSError` with ``errno`` set to :const:`errno.EINVAL`
pt_br: O intervalor do temporizador é definido pelo :py:class:`float` *interval*. Se *interval* é zero, o temporizador irá disparar apenas uma vez, no disparo inicial. Se *interval* é maior que zero, o temporizador vai disparar a cada *interval* segundos a partir do disparo anterior. Se *interval* é menor que zero, uma exceção :class:`OSError` será levantada com ``errno`` definido como :const:`errno.EINVAL`.

source: If the :const:`TFD_TIMER_CANCEL_ON_SET` flag is set along with :const:`TFD_TIMER_ABSTIME` and the clock for this timer is :const:`time.CLOCK_REALTIME`, the timer is marked as cancelable if the real-time clock is changed discontinuously. Reading the descriptor is aborted with the error ECANCELED.
pt_br: Se o sinalizador :const:`TFD_TIMER_CANCEL_ON_SET` é definido com :const:`TFD_TIMER_ABSTIME` e o relógio para o temporizador é :const:`time.CLOCK_REALTIME`, o temporizador é marcado como cancelável se o relógio em tempo real é alterado descontinuadamente. Leitura do descritor é abortada com o erro ECANCELED.

source: Linux manages system clock as UTC. A daylight-savings time transition is done by changing time offset only and doesn't cause discontinuous system clock change.
pt_br: Linux gerencia relógio do sistema como UTC. A transição do horário de verão é feita apenas pela alteração da compensação de horário e não causa alteração descontínua do relógio do sistema.

source: Discontinuous system clock change will be caused by the following events:
pt_br: A alteração descontínua do relógio do sistema será causada pelos seguintes eventos:

source: set the system date and time by ``date`` command
pt_br: definir hora e data do sistema com o comando ``date``

source: Return a two-item tuple of (``next_expiration``, ``interval``) from the previous timer state, before this function executed.
pt_br: Retorna uma tupla com dois elementos (``next_expiration``, ``interval``) do estado anterior do temporizador, antes da execução dessa função.

source: :manpage:`timerfd_create(2)`, :manpage:`timerfd_settime(2)`, :manpage:`settimeofday(2)`, :manpage:`clock_settime(2)`, and :manpage:`date(1)`.
pt_br: :manpage:`timerfd_create(2)`, :manpage:`timerfd_settime(2)`, :manpage:`settimeofday(2)`, :manpage:`clock_settime(2)`, e :manpage:`date(1)`.

source: Similar to :func:`timerfd_settime`, but use time as nanoseconds. This function operates the same interval timer as :func:`timerfd_settime`.
pt_br: Similar a :func:`timerfd_settime`, mas usa nanossegundos. Essa função opera no mesmo intervalo do temporizador definido com :func:`timerfd_settime`.

source: Return a two-item tuple of floats (``next_expiration``, ``interval``).
pt_br: Retorna uma tupla de ponto flutuante com dois elementos (``next_expiration``, ``interval``).

source: ``next_expiration`` denotes the relative time until next the timer next fires, regardless of if the :const:`TFD_TIMER_ABSTIME` flag is set.
pt_br: ``next_expiration`` indica o tempo relativo até o próximo disparo do cronômetro, independentemente do sinalizador :const:`TFD_TIMER_ABSTIME` estar definido.

source: ``interval`` denotes the timer's interval. If zero, the timer will only fire once, after ``next_expiration`` seconds have elapsed.
pt_br: ``interval`` indica o intervalo do cronômetro. Se for zero, o cronômetro será acionado apenas uma vez, após terem passados ``next_expiration`` segundos.

source: Similar to :func:`timerfd_gettime`, but return time as nanoseconds.
pt_br: Similar a :func:`timerfd_gettime`, mas retorna o tempo em nanossegundos.

source: A flag for the :func:`timerfd_create` function, which sets the :const:`O_NONBLOCK` status flag for the new timer file descriptor. If :const:`TFD_NONBLOCK` is not set as a flag, :func:`read` blocks.
pt_br: Um sinalizador para a função :func:`timerfd_create`, que define o estado do sinalizador :const:`O_NONBLOCK` para o novo descritor de arquivo de temporizador. Se :const:`TFD_NONBLOCK` não for definido como sinalizador, :func:`read` bloqueia.

source: A flag for the :func:`timerfd_create` function, If :const:`TFD_CLOEXEC` is set as a flag, set close-on-exec flag for new file descriptor.
pt_br: Um sinalizador para a função :func:`timerfd_create`. Se :const:`TFD_CLOEXEC` for definido como um sinalizador, define o sinalizador close-on-exec para o novo descritor de arquivo.

source: A flag for the :func:`timerfd_settime` and :func:`timerfd_settime_ns` functions. If this flag is set, *initial* is interpreted as an absolute value on the timer's clock (in UTC seconds or nanoseconds since the Unix Epoch).
pt_br: Um sinalizador para as funções :func:`timerfd_settime` e :func:`timerfd_settime_ns`. Se esse sinalizador for definido, *initial* será intepretador como um valor absoluto no relógio do temporizador (em segundos UTC ou nanossegundos da Era Unix).

source: A flag for the :func:`timerfd_settime` and :func:`timerfd_settime_ns` functions along with :const:`TFD_TIMER_ABSTIME`. The timer is cancelled when the time of the underlying clock changes discontinuously.
pt_br: Um sinalizador para as funções :func:`timerfd_settime` e :func:`timerfd_settime_ns` juntamente com :const:`TFD_TIMER_ABSTIME`. O cronômetro é cancelado quando a hora do relógio subjacente muda de forma descontínua.

source: Linux extended attributes
pt_br: Atributos estendidos do Linux

source: These functions are all available on Linux only.
pt_br: Estas funções estão todas disponíveis apenas no Linux.

source: Return the value of the extended filesystem attribute *attribute* for *path*. *attribute* can be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is str, it is encoded with the filesystem encoding.
pt_br: Retorna o valor do atributo estendido do sistema de arquivos *attribute* para *path*. *attribute* pode ser bytes ou str (direta ou indiretamente por meio da interface :class:`PathLike`). Se for str, ele é codificado com a codificação do sistema de arquivos.

source: Raises an :ref:`auditing event <auditing>` ``os.getxattr`` with arguments ``path``, ``attribute``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.getxattr`` com os argumentos ``path`` e ``attribute``.

source: Accepts a :term:`path-like object` for *path* and *attribute*.
pt_br: Aceita um :term:`objeto caminho ou similar` para *path* e *attribute*.

source: Return a list of the extended filesystem attributes on *path*. The attributes in the list are represented as strings decoded with the filesystem encoding. If *path* is ``None``, :func:`listxattr` will examine the current directory.
pt_br: Retorna uma lista dos atributos estendidos do sistema de arquivos em *path*. Os atributos na lista são representados como strings decodificadas com a codificação do sistema de arquivos. Se *path* for ``None``, :func:`listxattr` irá examinar o diretório atual.

source: Raises an :ref:`auditing event <auditing>` ``os.listxattr`` with argument ``path``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.listxattr`` com o argumento ``path``.

source: Removes the extended filesystem attribute *attribute* from *path*. *attribute* should be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is a string, it is encoded with the :term:`filesystem encoding and error handler`.
pt_br: Remove o atributo *attribute* do sistema de arquivos estendido do *path*. *attribute* deve ser bytes ou str (direta ou indiretamente através da interface :class:`PathLike`). Se for uma string, é codificada com o :term:`tratador de erros e codificação do sistema de arquivos`

source: Raises an :ref:`auditing event <auditing>` ``os.removexattr`` with arguments ``path``, ``attribute``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.removexattr`` com os argumentos ``path`` e ``attribute``.

source: Set the extended filesystem attribute *attribute* on *path* to *value*. *attribute* must be a bytes or str with no embedded NULs (directly or indirectly through the :class:`PathLike` interface). If it is a str, it is encoded with the :term:`filesystem encoding and error handler`. *flags* may be :data:`XATTR_REPLACE` or :data:`XATTR_CREATE`. If :data:`XATTR_REPLACE` is given and the attribute does not exist, ``ENODATA`` will be raised. If :data:`XATTR_CREATE` is given and the attribute already exists, the attribute will not be created and ``EEXISTS`` will be raised.
pt_br: Define o atributo de sistema de arquivos estendido *attribute* em *path* como *value*. *attribute* deve ser um bytes ou str sem NULs embutidos (direta ou indiretamente por meio da interface :class:`PathLike`). Se for um str, ele é codificado com :term:`tratador de erros e codificação do sistema de arquivos`. *flags* podem ser :data:`XATTR_REPLACE` ou :data:`XATTR_CREATE`. Se :data:`XATTR_REPLACE` for fornecido e o atributo não existe, ``ENODATA`` será levantada. Se :data:`XATTR_CREATE` for fornecido e o atributo já existir, o atributo não será criado e ``EEXISTS`` será levantada.

source: A bug in Linux kernel versions less than 2.6.39 caused the flags argument to be ignored on some filesystems.
pt_br: Um bug nas versões do kernel Linux inferiores a 2.6.39 fez com que o argumento *flags* fosse ignorado em alguns sistemas de arquivos.

source: Raises an :ref:`auditing event <auditing>` ``os.setxattr`` with arguments ``path``, ``attribute``, ``value``, ``flags``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.setxattr`` com os argumentos ``path``, ``attribute``, ``value`` e ``flags``.

source: The maximum size the value of an extended attribute can be. Currently, this is 64 KiB on Linux.
pt_br: O tamanho máximo que o valor de um atributo estendido pode ter. Atualmente, são 64 KiB no Linux.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must create an attribute.
pt_br: Este é um valor possível para o argumento *flags* em :func:`setxattr`. Indica que a operação deve criar um atributo.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must replace an existing attribute.
pt_br: Este é um valor possível para o argumento *flags* em :func:`setxattr`. Indica que a operação deve substituir um atributo existente.

source: Process Management
pt_br: Gerenciamento de processo

source: These functions may be used to create and manage processes.
pt_br: Estas funções podem ser usadas para criar e gerenciar processos.
