Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: On Unix, if the process is being traced or if :func:`waitpid` was called with :data:`WUNTRACED` option, the caller must first check if ``WIFSTOPPED(status)`` is true. This function must not be called if ``WIFSTOPPED(status)`` is true.
pt_br: No Unix, se o processo está sendo rastreado ou se :func:`waitpid` foi chamado com a opção :data:`WUNTRACED`, o chamador deve primeiro verificar se ``WIFSTOPPED(status)`` é verdadeiro. Esta função não deve ser chamada se ``WIFSTOPPED(status)`` for verdadeiro.

source: :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG` functions.
pt_br: As funções :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG`.

source: The following functions take a process status code as returned by :func:`system`, :func:`wait`, or :func:`waitpid` as a parameter. They may be used to determine the disposition of a process.
pt_br: As funções a seguir recebem um código de status do processo conforme retornado por :func:`system`, :func:`wait` ou :func:`waitpid` como parâmetro. Eles podem ser usados para determinar a disposição de um processo.

source: Return ``True`` if a core dump was generated for the process, otherwise return ``False``.
pt_br: Retorna ``True`` se um despejo de memória *(core dump)* foi gerado para o processo; caso contrário, retorna ``False``.

source: This function should be employed only if :func:`WIFSIGNALED` is true.
pt_br: Esta função deve ser empregada apenas se :func:`WIFSIGNALED` for verdadeira.

source: Return ``True`` if a stopped child has been resumed by delivery of :const:`~signal.SIGCONT` (if the process has been continued from a job control stop), otherwise return ``False``.
pt_br: Retorna ``True`` se um filho interrompido foi retomado pela entrega de :const:`~signal.SIGCONT` (se o processo foi continuado de uma parada de controle de trabalho); caso contrário, retorna ``False``.

source: See :data:`WCONTINUED` option.
pt_br: Veja a opção :data:`WCONTINUED`.

source: Return ``True`` if the process was stopped by delivery of a signal, otherwise return ``False``.
pt_br: Retorna ``True`` se o processo foi interrompido pela entrega de um sinal; caso contrário, retorna ``False``.

source: :func:`WIFSTOPPED` only returns ``True`` if the :func:`waitpid` call was done using :data:`WUNTRACED` option or when the process is being traced (see :manpage:`ptrace(2)`).
pt_br: :func:`WIFSTOPPED` só retorna ``True`` se a chamada de :func:`waitpid` foi feita usando a opção :data:`WUNTRACED` ou quando o processo está sendo rastreado (veja :manpage:`ptrace(2)`).

source: Return ``True`` if the process was terminated by a signal, otherwise return ``False``.
pt_br: Retorna ``True`` se o processo foi encerrado por um sinal; caso contrário, retorna ``False``.

source: Return ``True`` if the process exited terminated normally, that is, by calling ``exit()`` or ``_exit()``, or by returning from ``main()``; otherwise return ``False``.
pt_br: Retorna ``True`` se o processo foi encerrado normalmente, isto é, chamando ``exit()`` ou ``_exit()``, ou retornando de ``main()``; caso contrário, retorna ``False``.

source: Return the process exit status.
pt_br: Retorna o status de saída do processo.

source: This function should be employed only if :func:`WIFEXITED` is true.
pt_br: Esta função deve ser empregada apenas se :func:`WIFEXITED` for verdadeira.

source: Return the signal which caused the process to stop.
pt_br: Retorna o sinal que causou a interrupção do processo.

source: This function should be employed only if :func:`WIFSTOPPED` is true.
pt_br: Esta função deve ser empregada apenas se :func:`WIFSTOPPED` for verdadeira.

source: Return the number of the signal that caused the process to terminate.
pt_br: Retorna o número do sinal que causou o encerramento do processo.

source: Interface to the scheduler
pt_br: Interface do agendador

source: These functions control how a process is allocated CPU time by the operating system. They are only available on some Unix platforms. For more detailed information, consult your Unix manpages.
pt_br: Essas funções controlam como o tempo de CPU de um processo é alocado pelo sistema operacional. Eles estão disponíveis apenas em algumas plataformas Unix. Para informações mais detalhadas, consulte suas páginas man do Unix.

source: The following scheduling policies are exposed if they are supported by the operating system.
pt_br: As políticas de agendamento a seguir serão expostas se houver suporte pelo sistema operacional.

source: The default scheduling policy.
pt_br: A política de agendamento padrão.

source: Scheduling policy for CPU-intensive processes that tries to preserve interactivity on the rest of the computer.
pt_br: Política de agendamento para processos com uso intensivo de CPU que tenta preservar a interatividade no resto do computador.

source: Scheduling policy for tasks with deadline constraints.
pt_br: Política de agendamento para tarefas com restrições de prazo.

source: Scheduling policy for extremely low priority background tasks.
pt_br: Política de agendamento para tarefas em segundo plano de prioridade extremamente baixa.

source: Alias for :data:`SCHED_OTHER`.
pt_br: Apelido para :data:`SCHED_OTHER`.

source: Scheduling policy for sporadic server programs.
pt_br: Política de agendamento para programas de servidor esporádicos.

source: A First In First Out scheduling policy.
pt_br: Uma política de agendamento Primeiro a Entrar, Primeiro a Sair (First In First Out - FIFO).

source: A round-robin scheduling policy.
pt_br: Uma política de agendamento round-robin.

source: This flag can be OR'ed with any other scheduling policy. When a process with this flag set forks, its child's scheduling policy and priority are reset to the default.
pt_br: Este sinalizador pode ser operado em OU com qualquer outra política de agendamento. Quando um processo com este sinalizador definido bifurca, a política de agendamento e a prioridade de seu filho são redefinidas para o padrão.

source: This class represents tunable scheduling parameters used in :func:`sched_setparam`, :func:`sched_setscheduler`, and :func:`sched_getparam`. It is immutable.
pt_br: Esta classe representa parâmetros de agendamento ajustáveis usados em :func:`sched_setparam`, :func:`sched_setscheduler` e :func:`sched_getparam`. É imutável.

source: At the moment, there is only one possible parameter:
pt_br: Neste momento, há somente um único parâmetro possível:

source: The scheduling priority for a scheduling policy.
pt_br: A prioridade de agendamento para uma política de agendamento.

source: Get the minimum priority value for *policy*. *policy* is one of the scheduling policy constants above.
pt_br: Obtém o valor mínimo de prioridade para *policy*. *policy* é uma das constantes de política de agendamento acima.

source: Get the maximum priority value for *policy*. *policy* is one of the scheduling policy constants above.
pt_br: Obtém o valor máximo de prioridade para *policy*. *policy* é uma das constantes de política de agendamento acima.

source: Set the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. *policy* is one of the scheduling policy constants above. *param* is a :class:`sched_param` instance.
pt_br: Define a política de agendamento para o processo com PID *pid*. Um *pid* de 0 significa o processo de chamada. *policy* é uma das constantes de política de agendamento acima. *param* é uma instância de :class:`sched_param`.

source: Return the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. The result is one of the scheduling policy constants above.
pt_br: Retorna a política de agendamento para o processo com PID *pid*. Um *pid* de 0 significa o processo de chamada. O resultado é uma das constantes de política de agendamento acima.

source: Set the scheduling parameters for the process with PID *pid*. A *pid* of 0 means the calling process. *param* is a :class:`sched_param` instance.
pt_br: Define os parâmetros de agendamento para o processo com PID *pid*. Um *pid* de 0 significa o processo de chamada. *param* é uma instância de :class:`sched_param`.

source: Return the scheduling parameters as a :class:`sched_param` instance for the process with PID *pid*. A *pid* of 0 means the calling process.
pt_br: Retorna os parâmetros de agendamento como uma instância de :class:`sched_param` para o processo com PID *pid*. Um *pid* de 0 significa o processo de chamada.

source: Return the round-robin quantum in seconds for the process with PID *pid*. A *pid* of 0 means the calling process.
pt_br: Retorna o quantum round-robin em segundos para o processo com PID *pid*. Um *pid* de 0 significa o processo de chamada.

source: Voluntarily relinquish the CPU. See :manpage:`sched_yield(2)` for details.
pt_br: Abandona voluntariamente a CPU. Veja :manpage:`sched_yield(2)` para detalhes.

source: Restrict the process with PID *pid* (or the current process if zero) to a set of CPUs. *mask* is an iterable of integers representing the set of CPUs to which the process should be restricted.
pt_br: Restringe o processo com PID *pid* (ou o processo atual se zero) para um conjunto de CPUs. *mask* é um iterável de inteiros que representam o conjunto de CPUs às quais o processo deve ser restrito.

source: Return the set of CPUs the process with PID *pid* is restricted to.
pt_br: Retorna o conjunto de CPUs ao qual o processo com PID *pid* está restrito.

source: If *pid* is zero, return the set of CPUs the calling thread of the current process is restricted to.
pt_br: Se *pid* for zero, retorna o conjunto de CPUs às quais a thread chamadora do processo atual está restrita.

source: See also the :func:`process_cpu_count` function.
pt_br: Veja também a função :func:`process_cpu_count`.

source: Miscellaneous System Information
pt_br: Diversas informações de sistema

source: Return string-valued system configuration values. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given as the keys of the ``confstr_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
pt_br: Retorna valores de configuração do sistema com valor de string. *name* especifica o valor de configuração a ser recuperado; pode ser uma string que é o nome de um valor de sistema definido; esses nomes são especificados em vários padrões (POSIX, Unix 95, Unix 98 e outros). Algumas plataformas também definem nomes adicionais. Os nomes conhecidos pelo sistema operacional são fornecidos como as chaves do dicionário ``confstr_names``. Para variáveis de configuração não incluídas nesse mapeamento, passar um número inteiro para *name* também é aceito.

source: If the configuration value specified by *name* isn't defined, ``None`` is returned.
pt_br: Se o valor de configuração especificado por *name* não for definido, retorna ``None``.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``confstr_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
pt_br: Se *name* for uma string e não for conhecida, :exc:`ValueError` é levantada. Se um valor específico para *name* não for compatível com o sistema operacional do computador, mesmo que seja incluído em ``confstr_names``, uma :exc:`OSError` é levantada com :const:`errno.EINVAL` como número do erro.

source: Dictionary mapping names accepted by :func:`confstr` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
pt_br: Nomes de mapeamento de dicionário aceitos por :func:`confstr` para os valores inteiros definidos para esses nomes pelo sistema operacional do computador. Isso pode ser usado para determinar o conjunto de nomes conhecidos pelo sistema.

source: Return the number of logical CPUs in the **system**. Returns ``None`` if undetermined.
pt_br: Retorna o número de CPUs lógicas do **sistema**. Retorna ``None`` se não determinado.

source: The :func:`process_cpu_count` function can be used to get the number of logical CPUs usable by the calling thread of the **current process**.
pt_br: A função :func:`process_cpu_count` pode ser usada para obter o número de CPUs lógicas utilizáveis pela thread de chamada do **processo atual**.

source: If :option:`-X cpu_count <-X>` is given or :envvar:`PYTHON_CPU_COUNT` is set, :func:`cpu_count` returns the overridden value *n*.
pt_br: Se :option:`-X cpu_count <-X>` for fornecido ou :envvar:`PYTHON_CPU_COUNT` for definido, :func:`cpu_count` retornará o valor substituído *n*.

source: Return the number of processes in the system run queue averaged over the last 1, 5, and 15 minutes or raises :exc:`OSError` if the load average was unobtainable.
pt_br: Retorna o número de processos na fila de execução do sistema em média nos últimos 1, 5 e 15 minutos ou levanta :exc:`OSError` se a média de carga não foi obtida.

source: Get the number of logical CPUs usable by the calling thread of the **current process**. Returns ``None`` if undetermined. It can be less than :func:`cpu_count` depending on the CPU affinity.
pt_br: Obtém o número de CPUs lógicas utilizáveis pelo thread de chamada do **processo atual**. Retorna ``None`` se indeterminado. Pode ser menor que :func:`cpu_count` dependendo da afinidade da CPU.

source: The :func:`cpu_count` function can be used to get the number of logical CPUs in the **system**.
pt_br: A função :func:`cpu_count` pode ser usada para obter o número de CPUs lógicas no **sistema**.

source: If :option:`-X cpu_count <-X>` is given or :envvar:`PYTHON_CPU_COUNT` is set, :func:`process_cpu_count` returns the overridden value *n*.
pt_br: Se :option:`-X cpu_count <-X>` for fornecido ou :envvar:`PYTHON_CPU_COUNT` for definido, :func:`process_cpu_count` retornará o valor substituído *n*.

source: See also the :func:`sched_getaffinity` function.
pt_br: Veja também a função :func:`sched_getaffinity`.

source: Return integer-valued system configuration values. If the configuration value specified by *name* isn't defined, ``-1`` is returned. The comments regarding the *name* parameter for :func:`confstr` apply here as well; the dictionary that provides information on the known names is given by ``sysconf_names``.
pt_br: Retorna valores de configuração do sistema com valor inteiro. Se o valor de configuração especificado por *name* não estiver definido, ``-1`` é retornado. Os comentários sobre o parâmetro *name* para :func:`confstr` se aplicam aqui também; o dicionário que fornece informações sobre os nomes conhecidos é fornecido por ``sysconf_names``.

source: Dictionary mapping names accepted by :func:`sysconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
pt_br: Nomes de mapeamento de dicionário aceitos por :func:`sysconf` para os valores inteiros definidos para esses nomes pelo sistema operacional. Isso pode ser usado para determinar o conjunto de nomes conhecidos pelo sistema.

source: Add ``'SC_MINSIGSTKSZ'`` name.
pt_br: Adiciona o nome ``'SC_MINSIGSTKSZ'``.

source: The following data values are used to support path manipulation operations. These are defined for all platforms.
pt_br: Os dados a seguir são usados para operações de manipulação de caminhos de arquivos e diretórios. Estão definidos e disponíveis para todas as plataformas.

source: Higher-level operations on pathnames are defined in the :mod:`os.path` module.
pt_br: Operações de nível mais alto em nomes de caminho são definidos no módulo :mod:`os.path`.

source: The constant string used by the operating system to refer to the current directory. This is ``'.'`` for Windows and POSIX. Also available via :mod:`os.path`.
pt_br: A string constante usada pelo sistema operacional para se referir ao diretório atual. Isso é ``'.'`` para Windows e POSIX. Também disponível via :mod:`os.path`.

source: The constant string used by the operating system to refer to the parent directory. This is ``'..'`` for Windows and POSIX. Also available via :mod:`os.path`.
pt_br: A string constante usada pelo sistema operacional para se referir ao diretório pai. Isso é ``'..'`` para Windows e POSIX. Também disponível via :mod:`os.path`.

source: The character used by the operating system to separate pathname components. This is ``'/'`` for POSIX and ``'\\'`` for Windows. Note that knowing this is not sufficient to be able to parse or concatenate pathnames --- use :func:`os.path.split` and :func:`os.path.join` --- but it is occasionally useful. Also available via :mod:`os.path`.
pt_br: O caractere usado pelo sistema operacional para separar os componentes do nome do caminho. Este é ``'/'`` para POSIX e ``'\\'`` para Windows. Observe que saber disso não é suficiente para ser capaz de analisar ou concatenar nomes de caminho -- use :func:`os.path.split` e :func:`os.path.join` -- mas ocasionalmente é útil. Também disponível via :mod:`os.path`.

source: An alternative character used by the operating system to separate pathname components, or ``None`` if only one separator character exists. This is set to ``'/'`` on Windows systems where ``sep`` is a backslash. Also available via :mod:`os.path`.
pt_br: Um caractere alternativo usado pelo sistema operacional para separar os componentes do nome de caminho, ou ``None`` se apenas um caractere separador existir. Isso é definido como ``'/'`` em sistemas Windows onde ``sep`` é uma contrabarra. Também disponível via :mod:`os.path`.

source: The character which separates the base filename from the extension; for example, the ``'.'`` in :file:`os.py`. Also available via :mod:`os.path`.
pt_br: O caractere que separa o nome do arquivo base da extensão; por exemplo, o ``'.'`` em :file:`os.py`. Também disponível via :mod:`os.path`.

source: The character conventionally used by the operating system to separate search path components (as in :envvar:`PATH`), such as ``':'`` for POSIX or ``';'`` for Windows. Also available via :mod:`os.path`.
pt_br: O caractere convencionalmente usado pelo sistema operacional para separar os componentes do caminho de pesquisa (como em :envvar:`PATH`), como ``':'`` para POSIX ou ``';'`` para Windows. Também disponível via :mod:`os.path`.

source: The default search path used by :func:`exec\*p\* <execl>` and :func:`spawn\*p\* <spawnl>` if the environment doesn't have a ``'PATH'`` key. Also available via :mod:`os.path`.
pt_br: O caminho de pesquisa padrão usado por :func:`exec\*p\* <execl>` e :func:`spawn\*p\* <spawnl>` se o ambiente não tiver uma chave ``'PATH'``. Também disponível via :mod:`os.path`.

source: The string used to separate (or, rather, terminate) lines on the current platform. This may be a single character, such as ``'\n'`` for POSIX, or multiple characters, for example, ``'\r\n'`` for Windows. Do not use *os.linesep* as a line terminator when writing files opened in text mode (the default); use a single ``'\n'`` instead, on all platforms.
pt_br: A string usada para separar (ou melhor, encerrar) linhas na plataforma atual. Pode ser um único caractere, como ``'\n'`` para POSIX, ou múltiplos caracteres, por exemplo, ``'\r\n'`` para Windows. Não use *os.linesep* como terminador de linha ao escrever arquivos abertos em modo de texto (o padrão); use um único ``'\n'`` ao invés, em todas as plataformas.

source: The file path of the null device. For example: ``'/dev/null'`` for POSIX, ``'nul'`` for Windows. Also available via :mod:`os.path`.
pt_br: O caminho do arquivo do dispositivo nulo. Por exemplo: ``'/dev/null'`` para POSIX, ``'nul'`` para Windows. Também disponível via :mod:`os.path`.

source: Flags for use with the :func:`~sys.setdlopenflags` and :func:`~sys.getdlopenflags` functions. See the Unix manual page :manpage:`dlopen(3)` for what the different flags mean.
pt_br: Sinalizadores para uso com as funções :func:`~sys.setdlopenflags` e :func:`~sys.getdlopenflags`. Veja a página man do Unix :manpage:`dlopen(3)` para saber o que significam os diferentes sinalizadores.

source: Random numbers
pt_br: Números aleatórios

source: Get up to *size* random bytes. The function can return less bytes than requested.
pt_br: Obtém até *size* bytes aleatórios. Esta função pode retornar menos bytes que a quantia requisitada.

source: These bytes can be used to seed user-space random number generators or for cryptographic purposes.
pt_br: Esses bytes podem ser usados para propagar geradores de número aleatório no espaço do usuário ou para fins criptográficos.

source: ``getrandom()`` relies on entropy gathered from device drivers and other sources of environmental noise. Unnecessarily reading large quantities of data will have a negative impact on other users of the ``/dev/random`` and ``/dev/urandom`` devices.
pt_br: ``getrandom()`` depende da entropia obtida de drivers de dispositivos e outras fontes de ruído ambiental. A leitura desnecessária de grandes quantidades de dados terá um impacto negativo sobre outros usuários dos dispositivos ``/dev/random`` e ``/dev/urandom``.

source: The flags argument is a bit mask that can contain zero or more of the following values ORed together: :py:const:`os.GRND_RANDOM` and :py:data:`GRND_NONBLOCK`.
pt_br: O argumento *flags* é uma máscara de bits que pode conter zero ou mais dos seguintes valores operados com OU: :const:`os.GRND_RANDOM` e :py:data:`GRND_NONBLOCK`.

source: See also the `Linux getrandom() manual page <https://man7.org/linux/man-pages/man2/getrandom.2.html>`_.
pt_br: Veja também a `página de manual do getrandom() <https://man7.org/linux/man-pages/man2/getrandom.2.html>`_ do Linux.

source: Return a bytestring of *size* random bytes suitable for cryptographic use.
pt_br: Retorna uma sequência de bytes de tamanho *size* aleatórios próprios para uso criptográfico.

source: This function returns random bytes from an OS-specific randomness source. The returned data should be unpredictable enough for cryptographic applications, though its exact quality depends on the OS implementation.
pt_br: Esta função retorna bytes aleatórios de uma fonte de aleatoriedade específica do sistema operacional. Os dados retornados devem ser imprevisíveis o suficiente para aplicações criptográficos, embora sua qualidade exata dependa da implementação do sistema operacional.

source: On Linux, if the ``getrandom()`` syscall is available, it is used in blocking mode: block until the system urandom entropy pool is initialized (128 bits of entropy are collected by the kernel). See the :pep:`524` for the rationale. On Linux, the :func:`getrandom` function can be used to get random bytes in non-blocking mode (using the :data:`GRND_NONBLOCK` flag) or to poll until the system urandom entropy pool is initialized.
pt_br: No Linux, se a chamada de sistema ``getrandom()`` estiver disponível, ela é usada no modo bloqueante: bloqueia até que o pool de entropia urandom do sistema seja inicializado (128 bits de entropia são coletados pelo kernel). Veja a :pep:`524` para a justificativa. No Linux, a função :func:`getrandom` pode ser usada para obter bytes aleatórios no modo não bloqueante (usando a sinalização :data:`GRND_NONBLOCK`) ou para pesquisar até que o pool de entropia urandom do sistema seja inicializado.
