Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: Read from a file descriptor *fd* into a number of mutable :term:`bytes-like objects <bytes-like object>` *buffers*. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
pt_br: Lê de um descritor de arquivo *fd* em um número de *buffers* :term:`objetos bytes ou similares <bytes-like object>` mutáveis. Transfere os dados para cada buffer até que esteja cheio e, a seguir, vai para o próximo buffer na sequência para armazenar o restante dos dados.

source: Return the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`).
pt_br: Retorna o grupo de processos associado ao terminal fornecido por *fd* (um descritor de arquivo aberto retornado por :func:`os.open`).

source: Set the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`) to *pg*.
pt_br: Define o grupo de processos associado ao terminal fornecido por *fd* (um descritor de arquivo aberto retornado por :func:`os.open`) para *pg*.

source: Return a string which specifies the terminal device associated with file descriptor *fd*. If *fd* is not associated with a terminal device, an exception is raised.
pt_br: Retorna uma string que especifica o dispositivo de terminal associado ao descritor de arquivo *fd*. Se *fd* não estiver associado a um dispositivo de terminal, uma exceção é levantada.

source: Unlock the slave pseudo-terminal device associated with the master pseudo-terminal device to which the file descriptor *fd* refers. The file descriptor *fd* is not closed upon failure.
pt_br: Destrava o dispositivo pseudoterminal secundário associado ao dispositivo pseudoterminal principal ao qual o descritor de arquivo *fd* se refere. O descritor de arquivo *fd* não é fechado em caso de falha.

source: Calls the C standard library function :c:func:`unlockpt`.
pt_br: Chama a função :c:func:`unlockpt` da biblioteca padrão C.

source: Write the bytestring in *str* to file descriptor *fd*.
pt_br: Escreve a string de bytes em *str* no descritor de arquivo *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To write a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdout` or :data:`sys.stderr`, use its :meth:`~file.write` method.
pt_br: Esta função destina-se a E/S de baixo nível e deve ser aplicada a um descritor de arquivo retornado por :func:`os.open` ou :func:`pipe`. Para escrever um "objeto arquivo" retornado pela função embutida :func:`open` ou por :func:`popen` ou :func:`fdopen`, ou :data:`sys.stdout` ou :data:`sys.stderr`, use seu método :meth:`~file.write`.

source: Write the contents of *buffers* to file descriptor *fd*. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
pt_br: Escreve o conteúdo de *buffers* no descritor de arquivo *fd*. *buffers* deve ser uma sequência de :term:`objetos bytes ou similares <bytes-like object>`. Os buffers são processados na ordem em que estão. Todo o conteúdo do primeiro buffer é gravado antes de prosseguir para o segundo, e assim por diante.

source: Returns the total number of bytes actually written.
pt_br: Retorna o número total de bytes realmente escritos.

source: Querying the size of a terminal
pt_br: Consultando o tamanho de um terminal

source: Return the size of the terminal window as ``(columns, lines)``, tuple of type :class:`terminal_size`.
pt_br: Retorna o tamanho da janela do terminal como ``(columns, lines)``, tupla do tipo :class:`terminal_size`.

source: The optional argument ``fd`` (default ``STDOUT_FILENO``, or standard output) specifies which file descriptor should be queried.
pt_br: O argumento opcional ``fd`` (padrão ``STDOUT_FILENO``, ou saída padrão) especifica qual descritor de arquivo deve ser consultado.

source: If the file descriptor is not connected to a terminal, an :exc:`OSError` is raised.
pt_br: Se o descritor de arquivo não estiver conectado a um terminal, uma exceção :exc:`OSError` é levantada.

source: :func:`shutil.get_terminal_size` is the high-level function which should normally be used, ``os.get_terminal_size`` is the low-level implementation.
pt_br: :func:`shutil.get_terminal_size` é a função de alto nível que normalmente deve ser usada, ``os.get_terminal_size`` é a implementação de baixo nível.

source: A subclass of tuple, holding ``(columns, lines)`` of the terminal window size.
pt_br: Uma subclasse de tupla, contendo ``(columns, lines)`` do tamanho da janela do terminal.

source: Width of the terminal window in characters.
pt_br: Largura da janela do terminal em caracteres.

source: Height of the terminal window in characters.
pt_br: Altura da janela do terminal em caracteres.

source: Inheritance of File Descriptors
pt_br: Herança de descritores de arquivos

source: A file descriptor has an "inheritable" flag which indicates if the file descriptor can be inherited by child processes. Since Python 3.4, file descriptors created by Python are non-inheritable by default.
pt_br: Um descritor de arquivo tem um sinalizador "herdável" que indica se o descritor de arquivo pode ser herdado por processos filho. A partir do Python 3.4, os descritores de arquivo criados pelo Python não são herdáveis por padrão.

source: On UNIX, non-inheritable file descriptors are closed in child processes at the execution of a new program, other file descriptors are inherited.
pt_br: No UNIX, os descritores de arquivo não herdáveis são fechados em processos filho na execução de um novo programa, outros descritores de arquivo são herdados.

source: On Windows, non-inheritable handles and file descriptors are closed in child processes, except for standard streams (file descriptors 0, 1 and 2: stdin, stdout and stderr), which are always inherited. Using :func:`spawn\* <spawnl>` functions, all inheritable handles and all inheritable file descriptors are inherited. Using the :mod:`subprocess` module, all file descriptors except standard streams are closed, and inheritable handles are only inherited if the *close_fds* parameter is ``False``.
pt_br: No Windows, identificadores não herdáveis e descritores de arquivo são fechados em processos filho, exceto para fluxos padrão (descritores de arquivo 0, 1 e 2: stdin, stdout e stderr), que são sempre herdados. Usando as funções :func:`spawn\* <spawnl>`, todos os identificadores herdáveis e todos os descritores de arquivo herdáveis são herdados. Usando o módulo :mod:`subprocess`, todos os descritores de arquivo, exceto fluxos padrão, são fechados, e os manipuladores herdáveis são herdados apenas se o parâmetro *close_fds* for ``False``.

source: On WebAssembly platforms, the file descriptor cannot be modified.
pt_br: Nas plataformas WebAssembly, o descritor de arquivo não pode ser modificado.

source: Get the "inheritable" flag of the specified file descriptor (a boolean).
pt_br: Obtém o sinalizador "herdável" do descritor de arquivo especificado (um booleano).

source: Set the "inheritable" flag of the specified file descriptor.
pt_br: Define o sinalizador "herdável" do descritor de arquivo especificado.

source: Get the "inheritable" flag of the specified handle (a boolean).
pt_br: Obtém o sinalizador "herdável" do manipulador especificado (um booleano).

source: Set the "inheritable" flag of the specified handle.
pt_br: Define o sinalizador "herdável" do manipulador especificado.

source: Files and Directories
pt_br: Arquivos e diretórios

source: On some Unix platforms, many of these functions support one or more of these features:
pt_br: Em algumas plataformas Unix, muitas dessas funções oferecem suporte para um ou mais destes recursos:

source: **specifying a file descriptor:** Normally the *path* argument provided to functions in the :mod:`os` module must be a string specifying a file path. However, some functions now alternatively accept an open file descriptor for their *path* argument. The function will then operate on the file referred to by the descriptor. (For POSIX systems, Python will call the variant of the function prefixed with ``f`` (e.g. call ``fchdir`` instead of ``chdir``).)
pt_br: **especificar um descritor de arquivo:** normalmente o argumento *path* fornecido para funções no módulo :mod:`os` deve ser uma string especificando um caminho de arquivo. No entanto, algumas funções agora aceitam alternativamente um descritor de arquivo aberto para seu argumento *path*. A função então operará no arquivo referido pelo descritor. (Para sistemas POSIX, Python irá chamar a variante da função prefixada com ``f`` (por exemplo, chamar ``fchdir`` em vez de ``chdir``).)

source: You can check whether or not *path* can be specified as a file descriptor for a particular function on your platform using :data:`os.supports_fd`. If this functionality is unavailable, using it will raise a :exc:`NotImplementedError`.
pt_br: Você pode verificar se *path* pode ser especificado ou não como um descritor de arquivo para uma função particular em sua plataforma usando :data:`os.supports_fd`. Se esta funcionalidade não estiver disponível, usá-la levantará uma :exc:`NotImplementedError`.

source: If the function also supports *dir_fd* or *follow_symlinks* arguments, it's an error to specify one of those when supplying *path* as a file descriptor.
pt_br: Se a função também oferecer suporte para os argumentos *dir_fd* ou *follow_symlinks*, é um erro especificar um deles ao fornecer *path* como um descritor de arquivo.

source: **paths relative to directory descriptors:** If *dir_fd* is not ``None``, it should be a file descriptor referring to a directory, and the path to operate on should be relative; path will then be relative to that directory. If the path is absolute, *dir_fd* is ignored. (For POSIX systems, Python will call the variant of the function with an ``at`` suffix and possibly prefixed with ``f`` (e.g. call ``faccessat`` instead of ``access``).
pt_br: **caminhos relativos aos descritores de diretório:** se *dir_fd* não for ``None``, deve ser um descritor de arquivo referindo-se a um diretório, e o caminho para operar deve ser relativo; o caminho será relativo a esse diretório. Se o caminho for absoluto, *dir_fd* será ignorado. (Para sistemas POSIX, Python irá chamar a variante da função com um sufixo ``at`` e possivelmente prefixado com ``f`` (por exemplo, chamar ``faccessat`` ao invés de ``access``).

source: You can check whether or not *dir_fd* is supported for a particular function on your platform using :data:`os.supports_dir_fd`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
pt_br: Você pode verificar se há ou não suporte para *dir_fd* em uma função particular em sua plataforma usando :data:`os.supports_dir_fd`. Se não estiver disponível, usá-lo levantará uma :exc:`NotImplementedError`.

source: **not following symlinks:** If *follow_symlinks* is ``False``, and the last element of the path to operate on is a symbolic link, the function will operate on the symbolic link itself rather than the file pointed to by the link. (For POSIX systems, Python will call the ``l...`` variant of the function.)
pt_br: **não seguir links simbólicos:** se *follow_symlinks* for ``False``, e o último elemento do caminho para operar for um link simbólico, a função irá operar no próprio link simbólico ao invés do arquivo apontado pelo link. (Para sistemas POSIX, Python irá chamar a variante ``l...`` da função.)

source: You can check whether or not *follow_symlinks* is supported for a particular function on your platform using :data:`os.supports_follow_symlinks`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
pt_br: Você pode verificar se há ou não suporte para *follow_symlinks* em uma função particular em sua plataforma usando :data:`os.supports_follow_symlinks`. Se não estiver disponível, usá-lo levantará uma :exc:`NotImplementedError`.

source: Use the real uid/gid to test for access to *path*. Note that most operations will use the effective uid/gid, therefore this routine can be used in a suid/sgid environment to test if the invoking user has the specified access to *path*. *mode* should be :const:`F_OK` to test the existence of *path*, or it can be the inclusive OR of one or more of :const:`R_OK`, :const:`W_OK`, and :const:`X_OK` to test permissions. Return :const:`True` if access is allowed, :const:`False` if not. See the Unix man page :manpage:`access(2)` for more information.
pt_br: Usa o uid/gid real para testar o acesso ao *path*. Observe que a maioria das operações usará o uid/gid efetivo, portanto, essa rotina pode ser usada em um ambiente suid/sgid para testar se o usuário da chamada tem o acesso especificado ao *path*. *mode* deve ser :const:`F_OK` para testar a existência de *path*, ou pode ser o OU inclusivo de um ou mais dos :const:`R_OK`, :const:`W_OK`, e :const:`X_OK` para testar as permissões. Retorna :const:`True` se o acesso for permitido, :const:`False` se não for. Veja a página man do Unix :manpage:`access(2)` para mais informações.

source: This function can support specifying :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
pt_br: Esta função pode oferecer suporte a especificação de :ref:`caminhos relativos aos descritores de diretório <dir_fd>` e :ref:`não seguir os links simbólicos <follow_symlinks>`.

source: If *effective_ids* is ``True``, :func:`access` will perform its access checks using the effective uid/gid instead of the real uid/gid. *effective_ids* may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_effective_ids`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
pt_br: Se *effective_ids* for ``True``, :func:`access` irá realizar suas verificações de acesso usando o uid/gid efetivo ao invés do uid/gid real. *effective_ids* pode não ser compatível com sua plataforma; você pode verificar se está ou não disponível usando :data:`os.supports_effective_ids`. Se não estiver disponível, usá-lo levantará uma :exc:`NotImplementedError`.

source: Using :func:`access` to check if a user is authorized to e.g. open a file before actually doing so using :func:`open` creates a security hole, because the user might exploit the short time interval between checking and opening the file to manipulate it. It's preferable to use :term:`EAFP` techniques. For example::
pt_br: Usar :func:`access` para verificar se um usuário está autorizado a, por exemplo, abrir um arquivo antes de realmente fazer isso usando :func:`open` cria uma brecha de segurança, porque o usuário pode explorar o curto intervalo de tempo entre a verificação e a abertura do arquivo para manipulá-lo. É preferível usar as técnicas :term:`EAFP`. Por exemplo::

source: if os.access("myfile", os.R_OK): with open("myfile") as fp: return fp.read() return "some default data"
pt_br: if os.access("meuarquivo", os.R_OK): with open("meuarquivo") as fp: return fp.read() return "algum dado padrão"

source: is better written as::
pt_br: é melhor escrito como::

source: try: fp = open("myfile") except PermissionError: return "some default data" else: with fp: return fp.read()
pt_br: try: fp = open("meuarquivo") except PermissionError: return "algum dado padrão" else: with fp: return fp.read()

source: I/O operations may fail even when :func:`access` indicates that they would succeed, particularly for operations on network filesystems which may have permissions semantics beyond the usual POSIX permission-bit model.
pt_br: As operações de E/S podem falhar mesmo quando :func:`access` indica que elas teriam sucesso, particularmente para operações em sistemas de arquivos de rede que podem ter semântica de permissões além do modelo de bits de permissão POSIX usual.

source: Added the *dir_fd*, *effective_ids*, and *follow_symlinks* parameters.
pt_br: Adicionados os parâmetros *dir_fd*, *effective_ids* e *follow_symlinks*.

source: Values to pass as the *mode* parameter of :func:`access` to test the existence, readability, writability and executability of *path*, respectively.
pt_br: Valores a serem passados como o parâmetro *mode* de :func:`access` para testar a existência, legibilidade, capacidade de escrita e executabilidade de *path*, respectivamente.

source: Change the current working directory to *path*.
pt_br: Altera o diretório de trabalho atual para *path*.

source: This function can support :ref:`specifying a file descriptor <path_fd>`. The descriptor must refer to an opened directory, not an open file.
pt_br: Esta função pode oferecer suporte a :ref:`especificar um descritor de arquivo <path_fd>`. O descritor deve fazer referência a um diretório aberto, não a um arquivo aberto.

source: This function can raise :exc:`OSError` and subclasses such as :exc:`FileNotFoundError`, :exc:`PermissionError`, and :exc:`NotADirectoryError`.
pt_br: Esta função pode levantar :exc:`OSError` e subclasses como :exc:`FileNotFoundError`, :exc:`PermissionError` e :exc:`NotADirectoryError`.

source: Raises an :ref:`auditing event <auditing>` ``os.chdir`` with argument ``path``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.chdir`` com o argumento ``path``.

source: Added support for specifying *path* as a file descriptor on some platforms.
pt_br: Adicionado suporte para especificar *path* como um descritor de arquivo em algumas plataformas.

source: Set the flags of *path* to the numeric *flags*. *flags* may take a combination (bitwise OR) of the following values (as defined in the :mod:`stat` module):
pt_br: Define os sinalizadores de *path* para os *flags* numéricos. *flags* podem assumir uma combinação (OU bit a bit) dos seguintes valores (conforme definido no módulo :mod:`stat`):

source: This function can support :ref:`not following symlinks <follow_symlinks>`.
pt_br: Esta função pode oferecer suporte a :ref:`não seguir links simbólicos <follow_symlinks>`.

source: Raises an :ref:`auditing event <auditing>` ``os.chflags`` with arguments ``path``, ``flags``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.chflags`` com os argumentos ``path``, ``flags``.

source: Added the *follow_symlinks* parameter.
pt_br: Adicionado o parâmetro *follow_symlinks*.

source: Change the mode of *path* to the numeric *mode*. *mode* may take one of the following values (as defined in the :mod:`stat` module) or bitwise ORed combinations of them:
pt_br: Altera o modo de *path* para o *mode* numérico. *mode* pode assumir um dos seguintes valores (conforme definido no módulo :mod:`stat`) ou combinações de OU bit a bit deles:

source: This function can support :ref:`specifying a file descriptor <path_fd>`, :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
pt_br: Esta função pode oferecer suporte a :ref:`especificar um descritor de arquivo <path_fd>`, :ref:`caminhos relativos aos descritores de diretório <dir_fd>` e :ref:`não seguir os links simbólicos <follow_symlinks>`.

source: Although Windows supports :func:`chmod`, you can only set the file's read-only flag with it (via the ``stat.S_IWRITE`` and ``stat.S_IREAD`` constants or a corresponding integer value). All other bits are ignored. The default value of *follow_symlinks* is ``False`` on Windows.
pt_br: Embora o Windows ofereça suporte ao :func:`chmod`, você só pode definir o sinalizador de somente leitura do arquivo (através das constantes ``stat.S_IWRITE`` e ``stat.S_IREAD`` ou um valor inteiro correspondente). Todos os outros bits são ignorados. O valor padrão de *follow_symlinks* é ``False`` no Windows.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd* and *follow_symlinks* arguments.
pt_br: Adicionado suporte para especificar *path* como um descritor de arquivo aberto e os argumentos *dir_fd* e *follow_symlinks*.

source: Added support for a file descriptor and the *follow_symlinks* argument on Windows.
pt_br: Adicionado suporte para um descritor de arquivo e o argumento *follow_symlinks* no Windows.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1.
pt_br: Altera o proprietário e o id de grupo de *path* para *uid* e *gid* numéricos. Para deixar um dos ids inalterado, defina-o como -1.

source: See :func:`shutil.chown` for a higher-level function that accepts names in addition to numeric ids.
pt_br: Consulte :func:`shutil.chown` para uma função de alto nível que aceita nomes além de ids numéricos.

source: Supports a :term:`path-like object`.
pt_br: Oferece suporte para um :term:`objeto caminho ou similar`.

source: Change the root directory of the current process to *path*.
pt_br: Altera o diretório raiz do processo atual para *path*

source: Change the current working directory to the directory represented by the file descriptor *fd*. The descriptor must refer to an opened directory, not an open file. As of Python 3.3, this is equivalent to ``os.chdir(fd)``.
pt_br: Altera o diretório de trabalho atual para o diretório representado pelo descritor de arquivo *fd*. O descritor deve se referir a um diretório aberto, não a um arquivo aberto. No Python 3.3, isso é equivalente a ``os.chdir(fd)``.

source: Return a string representing the current working directory.
pt_br: Retorna uma string representando o diretório de trabalho atual.

source: Return a bytestring representing the current working directory.
pt_br: Retorna uma bytestring representando o diretório de trabalho atual.

source: The function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows.
pt_br: A função agora usa a codificação UTF-8 no Windows, em vez da página de código ANSI: consulte a :pep:`529` para a justificativa. A função não está mais descontinuada no Windows.

source: Set the flags of *path* to the numeric *flags*, like :func:`chflags`, but do not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chflags(path, flags, follow_symlinks=False)``.
pt_br: Define os sinalizadores de *path* para os *flags* numéricos, como :func:`chflags`, mas não segue links simbólicos. No Python 3.3, isso é equivalente a ``os.chflags(path, flags, follow_symlinks=False)``.

source: Change the mode of *path* to the numeric *mode*. If path is a symlink, this affects the symlink rather than the target. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(path, mode, follow_symlinks=False)``.
pt_br: Altera o modo de *path* para o *mode* numérico. Se o caminho for um link simbólico, isso afetará o link simbólico em vez do destino. Veja a documentação de :func:`chmod` para valores possíveis de *mode*. No Python 3.3, isso é equivalente a ``os.chmod(path, mode, follow_symlinks=False)``.

source: ``lchmod()`` is not part of POSIX, but Unix implementations may have it if changing the mode of symbolic links is supported.
pt_br: ``lchmod()`` não faz parte do POSIX, mas as implementações Unix podem tê-lo se houver suporte para alterar o modo de links simbólicos.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. This function will not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chown(path, uid, gid, follow_symlinks=False)``.
pt_br: Altera o proprietário e o id de grupo de *path* para *uid* e *gid* numéricos. Esta função não seguirá links simbólicos. No Python 3.3, isso é equivalente a ``os.chown(path, uid, gid, follow_symlinks=False)``.
