Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: A :class:`set` object indicating whether :func:`os.access` permits specifying ``True`` for its *effective_ids* parameter on the local platform. (Specifying ``False`` for *effective_ids* is always supported on all platforms.) If the local platform supports it, the collection will contain :func:`os.access`; otherwise it will be empty.
pt_br: Um objeto :class:`set` que indica se :func:`os.access` permite especificar ``True`` para seu parâmetro *effective_ids* na plataforma local. (Especificar ``False`` para *effective_ids* é sempre válido em todas as plataformas.) Se a plataforma local oferecer suporte, a coleção conterá :func:`os.access`; caso contrário, ficará vazio.

source: This expression evaluates to ``True`` if :func:`os.access` supports ``effective_ids=True`` on the local platform::
pt_br: Esta expressão é avaliada como ``True`` se :func:`os.access` oferecer suporte a ``effective_ids=True`` na plataforma local::

source: Currently *effective_ids* is only supported on Unix platforms; it does not work on Windows.
pt_br: Atualmente, *effective_ids* funciona apenas em plataformas Unix; não funciona no Windows.

source: A :class:`set` object indicating which functions in the :mod:`os` module permit specifying their *path* parameter as an open file descriptor on the local platform. Different platforms provide different features, and the underlying functionality Python uses to accept open file descriptors as *path* arguments is not available on all platforms Python supports.
pt_br: Um objeto :class:`set` que indica quais funções no módulo :mod:`os` permitem especificar seu parâmetro *path* como um descritor de arquivo aberto na plataforma local. Plataformas diferentes fornecem recursos diferentes, e a funcionalidade subjacente que o Python usa para aceitar descritores de arquivos abertos como argumentos *path* não está disponível em todas as plataformas que o Python provê suporte.

source: To determine whether a particular function permits specifying an open file descriptor for its *path* parameter, use the ``in`` operator on ``supports_fd``. As an example, this expression evaluates to ``True`` if :func:`os.chdir` accepts open file descriptors for *path* on your local platform::
pt_br: Para determinar se uma função particular permite especificar um descritor de arquivo aberto para seu parâmetro *path*, use o operador ``in`` em ``supports_fd``. Como exemplo, esta expressão é avaliada como ``True`` se :func:`os.chdir` aceita descritores de arquivo abertos para *path* em sua plataforma local::

source: A :class:`set` object indicating which functions in the :mod:`os` module accept ``False`` for their *follow_symlinks* parameter on the local platform. Different platforms provide different features, and the underlying functionality Python uses to implement *follow_symlinks* is not available on all platforms Python supports. For consistency's sake, functions that may support *follow_symlinks* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``True`` for *follow_symlinks* is always supported on all platforms.)
pt_br: Um objeto :class:`set` que indica quais funções no módulo :mod:`os` aceitam ``False`` para seu parâmetro *follow_symlinks* na plataforma local. Plataformas diferentes fornecem recursos diferentes, e a funcionalidade subjacente que o Python usa para implementar *follow_symlinks* não está disponível em todas as plataformas às quais o Python tem suporte. Para fins de consistência, as funções que podem ter suporte a *follow_symlinks* sempre permitem especificar o parâmetro, mas irão lançar uma exceção se a funcionalidade for usada quando não estiver disponível localmente. (Especificar ``True`` para *follow_symlinks* é sempre aceito em todas as plataformas.)

source: To check whether a particular function accepts ``False`` for its *follow_symlinks* parameter, use the ``in`` operator on ``supports_follow_symlinks``. As an example, this expression evaluates to ``True`` if you may specify ``follow_symlinks=False`` when calling :func:`os.stat` on the local platform::
pt_br: Para verificar se uma função em particular aceita ``False`` para seu parâmetro *follow_symlinks*, use o operador ``in`` em ``supports_follow_symlinks``. Como exemplo, esta expressão é avaliada como ``True`` se você pode especificar ``follow_symlinks=False`` ao chamar :func:`os.stat` na plataforma local::

source: Create a symbolic link pointing to *src* named *dst*.
pt_br: Cria um link simbólico apontando para *src* chamado *dst*.

source: On Windows, a symlink represents either a file or a directory, and does not morph to the target dynamically. If the target is present, the type of the symlink will be created to match. Otherwise, the symlink will be created as a directory if *target_is_directory* is ``True`` or a file symlink (the default) otherwise. On non-Windows platforms, *target_is_directory* is ignored.
pt_br: No Windows, um link simbólico representa um arquivo ou um diretório e não se transforma no destino dinamicamente. Se o alvo estiver presente, será criado um link simbólico de mesmo tipo. Caso contrário, o link simbólico será criado como um diretório se *target_is_directory* for ``True`` ou um link simbólico de arquivo (o padrão) caso contrário. Em plataformas não Windows, *target_is_directory* é ignorado.

source: On newer versions of Windows 10, unprivileged accounts can create symlinks if Developer Mode is enabled. When Developer Mode is not available/enabled, the *SeCreateSymbolicLinkPrivilege* privilege is required, or the process must be run as an administrator.
pt_br: Em versões mais recentes do Windows 10, contas sem privilégios podem criar links simbólicos se o Modo de Desenvolvedor estiver habilitado. Quando o modo de desenvolvedor não está disponível/ativado, o privilégio *SeCreateSymbolicLinkPrivilege* é necessário ou o processo deve ser executado como um administrador.

source: :exc:`OSError` is raised when the function is called by an unprivileged user.
pt_br: A exceção :exc:`OSError` é levantada quando a função é chamada por um usuário sem privilégios.

source: Raises an :ref:`auditing event <auditing>` ``os.symlink`` with arguments ``src``, ``dst``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.symlink`` com os argumentos ``src``, ``dst`` e ``dir_fd``.

source: Added the *dir_fd* parameter, and now allow *target_is_directory* on non-Windows platforms.
pt_br: Adicionado o parâmetro *dir_fd*, e agora permite *target_is_directory* em plataformas não Windows.

source: Added support for unelevated symlinks on Windows with Developer Mode.
pt_br: Adicionado suporte para links simbólicos não elevados no Windows com Modo de Desenvolvedor.

source: Force write of everything to disk.
pt_br: Força a escrita de tudo para o disco.

source: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
pt_br: Trunca o arquivo correspondente ao *path*, de modo que tenha no máximo *length* bytes.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``path``, ``length``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.truncate`` com os argumentos ``path`` e ``length``.

source: Remove (delete) the file *path*. This function is semantically identical to :func:`remove`; the ``unlink`` name is its traditional Unix name. Please see the documentation for :func:`remove` for further information.
pt_br: Remove (exclui) o arquivo *path*. Esta função é semanticamente idêntica à :func:`remove`; o nome ``unlink`` é seu nome Unix tradicional. Por favor, veja a documentação de :func:`remove` para mais informações.

source: Set the access and modified times of the file specified by *path*.
pt_br: Define os tempos de acesso e modificação do arquivo especificado por *path*.

source: :func:`utime` takes two optional parameters, *times* and *ns*. These specify the times set on *path* and are used as follows:
pt_br: :func:`utime` aceita dois parâmetros opcionais, *times* e *ns*. Eles especificam os horários definidos no *path* e são usados da seguinte forma:

source: If *ns* is specified, it must be a 2-tuple of the form ``(atime_ns, mtime_ns)`` where each member is an int expressing nanoseconds.
pt_br: Se *ns* for especificado, deve ser uma tupla de 2 elementos na forma ``(atime_ns, mtime_ns)`` onde cada membro é um inteiro expressando nanossegundos.

source: If *times* is not ``None``, it must be a 2-tuple of the form ``(atime, mtime)`` where each member is an int or float expressing seconds.
pt_br: Se *times* não for ``None``, deve ser uma tupla de 2 elementos na forma ``(atime, mtime)`` onde cada membro é um inteiro ou ponto flutuante expressando segundos.

source: If *times* is ``None`` and *ns* is unspecified, this is equivalent to specifying ``ns=(atime_ns, mtime_ns)`` where both times are the current time.
pt_br: Se *times* for ``None`` e *ns* não for especificado, isso é equivalente a especificar ``ns=(atime_ns, mtime_ns)`` onde ambos os tempos são a hora atual.

source: It is an error to specify tuples for both *times* and *ns*.
pt_br: É um erro especificar tuplas para ambos *times* e *ns*.

source: Note that the exact times you set here may not be returned by a subsequent :func:`~os.stat` call, depending on the resolution with which your operating system records access and modification times; see :func:`~os.stat`. The best way to preserve exact times is to use the *st_atime_ns* and *st_mtime_ns* fields from the :func:`os.stat` result object with the *ns* parameter to :func:`utime`.
pt_br: Observe que os tempos exatos que você definiu aqui podem não ser retornados por uma chamada subsequente de :func:`~os.stat`, dependendo da resolução com a qual seu sistema operacional registra os tempos de acesso e modificação; veja :func:`~os.stat`. A melhor maneira de preservar os tempos exatos é usar os campos *st_atime_ns* e *st_mtime_ns* do objeto de resultado :func:`os.stat` com o parâmetro *ns* para :func:`utime`.

source: Raises an :ref:`auditing event <auditing>` ``os.utime`` with arguments ``path``, ``times``, ``ns``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.utime`` com os argumentos ``path``, ``times``, ``ns`` e ``dir_fd``.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd*, *follow_symlinks*, and *ns* parameters.
pt_br: Adicionado suporte para especificar *path* como um descritor de arquivo aberto e os parâmetros *dir_fd*, *follow_symlinks* e *ns*.

source: Generate the file names in a directory tree by walking the tree either top-down or bottom-up. For each directory in the tree rooted at directory *top* (including *top* itself), it yields a 3-tuple ``(dirpath, dirnames, filenames)``.
pt_br: Gera os nomes dos arquivos em uma árvore de diretório percorrendo a árvore de cima para baixo ou de baixo para cima. Para cada diretório na árvore com raiz no diretório *top* (incluindo o próprio *top*), ele produz uma tupla de 3 elementos ``(dirpath, dirnames, filenames)``.

source: *dirpath* is a string, the path to the directory. *dirnames* is a list of the names of the subdirectories in *dirpath* (including symlinks to directories, and excluding ``'.'`` and ``'..'``). *filenames* is a list of the names of the non-directory files in *dirpath*. Note that the names in the lists contain no path components. To get a full path (which begins with *top*) to a file or directory in *dirpath*, do ``os.path.join(dirpath, name)``. Whether or not the lists are sorted depends on the file system. If a file is removed from or added to the *dirpath* directory during generating the lists, whether a name for that file be included is unspecified.
pt_br: *dirpath* é uma string, o caminho para o diretório. *dirnames* é uma lista dos nomes dos subdiretórios em *dirpath* (incluindo links simbólicos para diretórios e excluindo ``'.'`` e ``'..'``). *filenames* é uma lista dos nomes dos arquivos não pertencentes ao diretório em *dirpath*. Observe que os nomes nas listas não contêm componentes de caminho. Para obter um caminho completo (que começa com *top*) para um arquivo ou diretório em *dirpath*, execute ``os.path.join(dirpath, name)``. Se as listas são ou não ordenadas depende do sistema de arquivos. Se um arquivo for removido ou adicionado ao diretório *dirpath* durante a geração das listas, não é especificado se um nome para esse arquivo deve ser incluído.

source: If optional argument *topdown* is ``True`` or not specified, the triple for a directory is generated before the triples for any of its subdirectories (directories are generated top-down). If *topdown* is ``False``, the triple for a directory is generated after the triples for all of its subdirectories (directories are generated bottom-up). No matter the value of *topdown*, the list of subdirectories is retrieved before the tuples for the directory and its subdirectories are generated.
pt_br: Se o argumento opcional *topdown* for ``True`` ou não especificado, o triplo para um diretório é gerado antes dos triplos para qualquer um de seus subdiretórios (os diretórios são gerados de cima para baixo). Se *topdown* for ``False``, o triplo para um diretório é gerado após os triplos para todos os seus subdiretórios (os diretórios são gerados de baixo para cima). Não importa o valor de *topdown*, a lista de subdiretórios é recuperada antes que as tuplas para o diretório e seus subdiretórios sejam geradas.

source: When *topdown* is ``True``, the caller can modify the *dirnames* list in-place (perhaps using :keyword:`del` or slice assignment), and :func:`walk` will only recurse into the subdirectories whose names remain in *dirnames*; this can be used to prune the search, impose a specific order of visiting, or even to inform :func:`walk` about directories the caller creates or renames before it resumes :func:`walk` again. Modifying *dirnames* when *topdown* is ``False`` has no effect on the behavior of the walk, because in bottom-up mode the directories in *dirnames* are generated before *dirpath* itself is generated.
pt_br: Quando *topdown* é ``True``, o chamador pode modificar a lista de *dirnames* internamente (talvez usando :keyword:`del` ou atribuição de fatia), e :func:`walk` só recursará nos subdiretórios cujos nomes permanecem em *dirnames*; isso pode ser usado para podar a busca, impor uma ordem específica de visita, ou mesmo informar à função :func:`walk` sobre os diretórios que o chamador cria ou renomeia antes de retomar :func:`walk` novamente. Modificar *dirnames* quando *topdown* for ``False`` não tem efeito no comportamento da caminhada, porque no modo de baixo para cima os diretórios em *dirnames* são gerados antes do próprio *dirpath* ser gerado.

source: By default, errors from the :func:`scandir` call are ignored. If optional argument *onerror* is specified, it should be a function; it will be called with one argument, an :exc:`OSError` instance. It can report the error to continue with the walk, or raise the exception to abort the walk. Note that the filename is available as the ``filename`` attribute of the exception object.
pt_br: Por padrão, os erros da chamada de :func:`scandir` são ignorados. Se o argumento opcional *onerror* for especificado, deve ser uma função; ela será chamado com um argumento, uma instância da exceção :exc:`OSError`. Ele pode relatar o erro para continuar com a caminhada ou levantar a exceção para abortar a caminhada. Observe que o nome do arquivo está disponível como o atributo ``filename`` do objeto de exceção.

source: By default, :func:`walk` will not walk down into symbolic links that resolve to directories. Set *followlinks* to ``True`` to visit directories pointed to by symlinks, on systems that support them.
pt_br: Por padrão, a função :func:`walk` não vai seguir links simbólicos que resolvem para diretórios. Defina *followlinks* como ``True`` para visitar diretórios apontados por links simbólicos, em sistemas que oferecem suporte a eles.

source: Be aware that setting *followlinks* to ``True`` can lead to infinite recursion if a link points to a parent directory of itself. :func:`walk` does not keep track of the directories it visited already.
pt_br: Esteja ciente de que definir *followlinks* para ``True`` pode levar a recursão infinita se um link apontar para um diretório pai de si mesmo. :func:`walk` não mantém registro dos diretórios que já visitou.

source: If you pass a relative pathname, don't change the current working directory between resumptions of :func:`walk`. :func:`walk` never changes the current directory, and assumes that its caller doesn't either.
pt_br: Se você passar um nome de caminho relativo, não mude o diretório de trabalho atual entre as continuações de :func:`walk`. :func:`walk` nunca muda o diretório atual, e presume que seu chamador também não.

source: This example displays the number of bytes taken by non-directory files in each directory under the starting directory, except that it doesn't look under any ``__pycache__`` subdirectory::
pt_br: Este exemplo exibe o número total de bytes dos arquivos não-diretório em cada diretório no diretório inicial, exceto que ele não olha em nenhum subdiretório chamado ``__pycache__``::

source: import os from os.path import join, getsize for root, dirs, files in os.walk('python/Lib/xml'): print(root, "consumes", end=" ") print(sum(getsize(join(root, name)) for name in files), end=" ") print("bytes in", len(files), "non-directory files") if '__pycache__' in dirs: dirs.remove('__pycache__') # don't visit __pycache__ directories
pt_br: import os from os.path import join, getsize for root, dirs, files in os.walk('python/Lib/xml'): print(root, "consome", end=" ") print(sum(getsize(join(root, name)) for name in files), end=" ") print("bytes em", len(files), "arquivos que não são diretórios") if '__pycache__' in dirs: dirs.remove('__pycache__') # não visita diretórios de __pycache__

source: In the next example (simple implementation of :func:`shutil.rmtree`), walking the tree bottom-up is essential, :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
pt_br: No próximo exemplo (implementação simples de :func:`shutil.rmtree`), andar na árvore de baixo para cima é essencial, :func:`rmdir` não permite excluir um diretório antes que o diretório esteja vazio::

source: # Delete everything reachable from the directory named in "top", # assuming there are no symbolic links. # CAUTION: This is dangerous! For example, if top == '/', it # could delete all your disk files. import os for root, dirs, files in os.walk(top, topdown=False): for name in files: os.remove(os.path.join(root, name)) for name in dirs: os.rmdir(os.path.join(root, name)) os.rmdir(top)
pt_br: # Exclui tudo que for acessível do diretório nomeado em "top", # presumindo que não há links simbólicos. # CUIDADO: Isso é perigoso! Por exemplo, se top == '/', # ele pode excluir todos os seus arquivos de disco. import os for root, dirs, files in os.walk(top, topdown=False): for name in files: os.remove(os.path.join(root, name)) for name in dirs: os.rmdir(os.path.join(root, name)) os.rmdir(top)

source: Raises an :ref:`auditing event <auditing>` ``os.walk`` with arguments ``top``, ``topdown``, ``onerror``, ``followlinks``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.walk`` com os argumentos ``top``, ``topdown``, ``onerror`` e ``followlinks``.

source: This function now calls :func:`os.scandir` instead of :func:`os.listdir`, making it faster by reducing the number of calls to :func:`os.stat`.
pt_br: Esta função agora chama :func:`os.scandir` em vez de :func:`os.listdir`, tornando-a mais rápida reduzindo o número de chamadas a :func:`os.stat`.

source: This behaves exactly like :func:`walk`, except that it yields a 4-tuple ``(dirpath, dirnames, filenames, dirfd)``, and it supports ``dir_fd``.
pt_br: Se comporta exatamente como :func:`walk`, exceto que produz um tupla de 4 elementos ``(dirpath, dirnames, filenames, dirfd)``, e tem suporte a ``dir_fd``.

source: *dirpath*, *dirnames* and *filenames* are identical to :func:`walk` output, and *dirfd* is a file descriptor referring to the directory *dirpath*.
pt_br: *dirpath*, *dirnames* e *filenames* são idênticos à saída de :func:`walk` e *dirfd* é um descritor de arquivo que faz referência ao diretório *dirpath*.

source: This function always supports :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`. Note however that, unlike other functions, the :func:`fwalk` default value for *follow_symlinks* is ``False``.
pt_br: Esta função sempre tem suporte a :ref:`caminhos relativos aos descritores de diretório <dir_fd>` e :ref:`não seguir links simbólicos <follow_symlinks>`. Observe, entretanto, que, ao contrário de outras funções, o valor padrão :func:`fwalk` para *follow_symlinks* é ``False``.

source: Since :func:`fwalk` yields file descriptors, those are only valid until the next iteration step, so you should duplicate them (e.g. with :func:`dup`) if you want to keep them longer.
pt_br: Uma vez que :func:`fwalk` produz descritores de arquivo, eles só são válidos até a próxima etapa de iteração, então você deve duplicá-los (por exemplo, com :func:`dup`) se quiser mantê-los por mais tempo.

source: import os for root, dirs, files, rootfd in os.fwalk('python/Lib/xml'): print(root, "consumes", end="") print(sum([os.stat(name, dir_fd=rootfd).st_size for name in files]), end="") print("bytes in", len(files), "non-directory files") if '__pycache__' in dirs: dirs.remove('__pycache__') # don't visit __pycache__ directories
pt_br: import os for root, dirs, files, rootfd in os.fwalk('python/Lib/xml'): print(root, "consome", end="") print(sum([os.stat(name, dir_fd=rootfd).st_size for name in files]), end="") print("bytes em", len(files), "arquivos que não são diretórios") if '__pycache__' in dirs: dirs.remove('__pycache__') # não visita diretórios de __pycache__

source: In the next example, walking the tree bottom-up is essential: :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
pt_br: No próximo exemplo, percorrer a árvore de baixo para cima é essencial: :func:`rmdir` não permite excluir um diretório antes que o diretório esteja vazio::

source: # Delete everything reachable from the directory named in "top", # assuming there are no symbolic links. # CAUTION: This is dangerous! For example, if top == '/', it # could delete all your disk files. import os for root, dirs, files, rootfd in os.fwalk(top, topdown=False): for name in files: os.unlink(name, dir_fd=rootfd) for name in dirs: os.rmdir(name, dir_fd=rootfd)
pt_br: # Exclui tudo que for acessível do diretório nomeado em "top", # presumindo que não há links simbólicos. # CUIDADO: Isso é perigoso! Por exemplo, se top == '/', # ele pode excluir todos os seus arquivos de disco. import os for root, dirs, files, rootfd in os.fwalk(top, topdown=False): for name in files: os.unlink(name, dir_fd=rootfd) for name in dirs: os.rmdir(name, dir_fd=rootfd)

source: Raises an :ref:`auditing event <auditing>` ``os.fwalk`` with arguments ``top``, ``topdown``, ``onerror``, ``follow_symlinks``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.fwalk`` com os argumentos ``top``, ``topdown``, ``onerror``, ``follow_symlinks`` e ``dir_fd``.

source: Added support for :class:`bytes` paths.
pt_br: Adicionado suporte para caminhos em :class:`bytes`.
