Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: On Windows, if *dst* exists a :exc:`FileExistsError` is always raised. The operation may fail if *src* and *dst* are on different filesystems. Use :func:`shutil.move` to support moves to a different filesystem.
pt_br: No Windows, se *dst* existe então uma exceção :exc:`FileExistsError` será levantada. A operação pode falar se *src* e *dst* são de sistemas de arquivos diferentes. Use :func:`shutil.move` para mover arquivos entre sistemas de arquivos diferentes.

source: On Unix, if *src* is a file and *dst* is a directory or vice-versa, an :exc:`IsADirectoryError` or a :exc:`NotADirectoryError` will be raised respectively. If both are directories and *dst* is empty, *dst* will be silently replaced. If *dst* is a non-empty directory, an :exc:`OSError` is raised. If both are files, *dst* will be replaced silently if the user has permission. The operation may fail on some Unix flavors if *src* and *dst* are on different filesystems. If successful, the renaming will be an atomic operation (this is a POSIX requirement).
pt_br: No Unix, se *src* é um arquivo e *dst* é um diretório ou vice-versa, uma :exc:`IsADirectoryError` ou uma :exc:`NotADirectoryError` será levantada respectivamente. Se ambos forem diretórios e *dst* estiver vazio, *dst* será substituído silenciosamente. Se *dst* for um diretório não vazio, uma :exc:`OSError` é levantada. Se ambos forem arquivos, *dst* será substituído silenciosamente se o usuário tiver permissão. A operação pode falhar em alguns tipos de Unix se *src* e *dst* estiverem em sistemas de arquivos diferentes. Se for bem-sucedido, a renomeação será uma operação atômica (este é um requisito POSIX).

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`.
pt_br: Esta função permite especificar *src_dir_fd* e/ou *dst_dir_fd* para fornecer :ref:`caminhos relativos a descritores de diretório <dir_fd>`.

source: If you want cross-platform overwriting of the destination, use :func:`replace`.
pt_br: Se você quiser sobrescrita multiplataforma do destino, use :func:`replace`.

source: Raises an :ref:`auditing event <auditing>` ``os.rename`` with arguments ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.rename`` com os argumentos ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.

source: Added the *src_dir_fd* and *dst_dir_fd* parameters.
pt_br: Adicionados os parâmetros *src_dir_fd* e *dst_dir_fd*.

source: Recursive directory or file renaming function. Works like :func:`rename`, except creation of any intermediate directories needed to make the new pathname good is attempted first. After the rename, directories corresponding to rightmost path segments of the old name will be pruned away using :func:`removedirs`.
pt_br: Função de renomeação de arquivo ou diretório recursiva. Funciona como :func:`rename`, exceto que a criação de qualquer diretório intermediário necessário para tornar o novo nome de caminho possível é tentada primeiro. Após a renomeação, os diretórios correspondentes aos segmentos de caminho mais à direita do nome antigo serão removidos usando :func:`removedirs`.

source: This function can fail with the new directory structure made if you lack permissions needed to remove the leaf directory or file.
pt_br: Esta função pode falhar com a nova estrutura de diretório criada se você não tiver as permissões necessárias para remover o arquivo ou diretório folha.

source: Accepts a :term:`path-like object` for *old* and *new*.
pt_br: Aceita um :term:`objeto caminho ou similar` para *old* e *new*.

source: Rename the file or directory *src* to *dst*. If *dst* is a non-empty directory, :exc:`OSError` will be raised. If *dst* exists and is a file, it will be replaced silently if the user has permission. The operation may fail if *src* and *dst* are on different filesystems. If successful, the renaming will be an atomic operation (this is a POSIX requirement).
pt_br: Renomeia o arquivo ou diretório *src* para *dst*. Se *dst* for um diretório não vazio, :exc:`OSError` será levantada. Se *dst* existir e for um arquivo, ele será substituído silenciosamente se o usuário tiver permissão. A operação pode falhar se *src* e *dst* estiverem em sistemas de arquivos diferentes. Se for bem-sucedido, a renomeação será uma operação atômica (este é um requisito POSIX).

source: Remove (delete) the directory *path*. If the directory does not exist or is not empty, a :exc:`FileNotFoundError` or an :exc:`OSError` is raised respectively. In order to remove whole directory trees, :func:`shutil.rmtree` can be used.
pt_br: Remove (exclui) o diretório *path*. Se o diretório não existe ou não está vazio, uma :exc:`FileNotFoundError` ou uma :exc:`OSError` é levantada respectivamente. Para remover árvores de diretório inteiras, pode ser usada :func:`shutil.rmtree`.

source: Raises an :ref:`auditing event <auditing>` ``os.rmdir`` with arguments ``path``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.rmdir`` com os argumentos ``path``, ``dir_fd``.

source: Return an iterator of :class:`os.DirEntry` objects corresponding to the entries in the directory given by *path*. The entries are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included. If a file is removed from or added to the directory after creating the iterator, whether an entry for that file be included is unspecified.
pt_br: Retorna um iterador de objetos :class:`os.DirEntry` correspondentes às entradas no diretório fornecido por *path*. As entradas são produzidas em ordem arbitrária, e as entradas especiais ``'.'`` e ``'..'`` não são incluídas. Se um arquivo for removido ou adicionado ao diretório após a criação do iterador, não é especificado se uma entrada para esse arquivo deve ser incluída.

source: Using :func:`scandir` instead of :func:`listdir` can significantly increase the performance of code that also needs file type or file attribute information, because :class:`os.DirEntry` objects expose this information if the operating system provides it when scanning a directory. All :class:`os.DirEntry` methods may perform a system call, but :func:`~os.DirEntry.is_dir` and :func:`~os.DirEntry.is_file` usually only require a system call for symbolic links; :func:`os.DirEntry.stat` always requires a system call on Unix but only requires one for symbolic links on Windows.
pt_br: Usar :func:`scandir` em vez de :func:`listdir` pode aumentar significativamente o desempenho do código que também precisa de tipo de arquivo ou informações de atributo de arquivo, porque os objetos :class:`os.DirEntry` expõem essas informações se o sistema operacional fornecer ao percorrer um diretório. Todos os métodos de :class:`os.DirEntry` podem realizar uma chamada de sistema, mas :func:`~os.DirEntry.is_dir` e :func:`~os.DirEntry.is_file` normalmente requerem apenas uma chamada de sistema para links simbólicos; :func:`os.DirEntry.stat` sempre requer uma chamada de sistema no Unix, mas requer uma apenas para links simbólicos no Windows.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the type of the :attr:`~os.DirEntry.name` and :attr:`~os.DirEntry.path` attributes of each :class:`os.DirEntry` will be ``bytes``; in all other circumstances, they will be of type ``str``.
pt_br: *path* pode ser um :term:`objeto caminho ou similar`. Se *path* for do tipo ``bytes`` (direta ou indiretamente por meio da interface :class:`PathLike`), o tipo dos atributos :attr:`~os.DirEntry.name` e :attr:`~os.DirEntry.path` de cada :class:`os.DirEntry` serão ``bytes``; em todas as outras circunstâncias, eles serão do tipo ``str``.

source: Raises an :ref:`auditing event <auditing>` ``os.scandir`` with argument ``path``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.scandir`` com o argumento ``path``.

source: The :func:`scandir` iterator supports the :term:`context manager` protocol and has the following method:
pt_br: O iterador :func:`scandir` implementa o protocolo :term:`gerenciador de contexto` e tem o seguinte método:

source: Close the iterator and free acquired resources.
pt_br: Fecha o iterador e libera os recursos alocados.

source: This is called automatically when the iterator is exhausted or garbage collected, or when an error happens during iterating. However it is advisable to call it explicitly or use the :keyword:`with` statement.
pt_br: Isso é chamado automaticamente quando o iterador se esgota ou é coletado como lixo, ou quando ocorre um erro durante a iteração. No entanto, é aconselhável chamá-lo explicitamente ou usar a instrução :keyword:`with`.

source: The following example shows a simple use of :func:`scandir` to display all the files (excluding directories) in the given *path* that don't start with ``'.'``. The ``entry.is_file()`` call will generally not make an additional system call::
pt_br: O exemplo a seguir mostra um uso simples de :func:`scandir` para exibir todos os arquivos (excluindo diretórios) no *path* fornecido que não começa com ``'.'``. A chamada ``entrada.is_file()`` geralmente não fará uma chamada de sistema adicional::

source: with os.scandir(path) as it: for entry in it: if not entry.name.startswith('.') and entry.is_file(): print(entry.name)
pt_br: with os.scandir(caminho) as coisa: for entrada in coisa: if not entrada.name.startswith('.') and entrada.is_file(): print(entrada.name)

source: On Unix-based systems, :func:`scandir` uses the system's `opendir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ and `readdir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_ functions. On Windows, it uses the Win32 `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ and `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_ functions.
pt_br: Em sistemas baseados no Unix, :func:`scandir` usa o sistema `opendir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ e as funções `readdir() <https://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_. No Windows, ela usa os funções `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ e `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_ do Win32.

source: Added support for the :term:`context manager` protocol and the :func:`~scandir.close` method. If a :func:`scandir` iterator is neither exhausted nor explicitly closed a :exc:`ResourceWarning` will be emitted in its destructor.
pt_br: Adicionado suporte para o protocolo de :term:`gerenciador de contexto` e o método :func:`~scandir.close`. Se um iterador :func:`scandir` não estiver esgotado nem explicitamente fechado, uma :exc:`ResourceWarning` será emitida em seu destrutor.

source: The function accepts a :term:`path-like object`.
pt_br: A função aceita um :term:`objeto caminho ou similar`.

source: Added support for :ref:`file descriptors <path_fd>` on Unix.
pt_br: Adicionado suporte para :ref:`descritores de arquivo <path_fd>` no Unix.

source: Object yielded by :func:`scandir` to expose the file path and other file attributes of a directory entry.
pt_br: Objeto produzido por :func:`scandir` para expor o caminho do arquivo e outros atributos de arquivo de uma entrada de diretório.

source: :func:`scandir` will provide as much of this information as possible without making additional system calls. When a ``stat()`` or ``lstat()`` system call is made, the ``os.DirEntry`` object will cache the result.
pt_br: :func:`scandir` fornecerá o máximo possível dessas informações sem fazer chamadas de sistema adicionais. Quando uma chamada de sistema ``stat()`` ou ``lstat()`` é feita, o objeto ``os.DirEntry`` irá armazenar o resultado em cache.

source: ``os.DirEntry`` instances are not intended to be stored in long-lived data structures; if you know the file metadata has changed or if a long time has elapsed since calling :func:`scandir`, call ``os.stat(entry.path)`` to fetch up-to-date information.
pt_br: As instâncias de ``os.DirEntry`` não devem ser armazenadas em estruturas de dados de longa duração; se você sabe que os metadados do arquivo foram alterados ou se passou muito tempo desde a chamada de :func:`scandir`, chame ``os.stat(entry.path)`` para obter informações atualizadas.

source: Because the ``os.DirEntry`` methods can make operating system calls, they may also raise :exc:`OSError`. If you need very fine-grained control over errors, you can catch :exc:`OSError` when calling one of the ``os.DirEntry`` methods and handle as appropriate.
pt_br: Como os métodos ``os.DirEntry`` podem fazer chamadas ao sistema operacional, eles também podem levantar :exc:`OSError`. Se você precisa de um controle muito refinado sobre os erros, você pode pegar :exc:`OSError` ao chamar um dos métodos ``os.DirEntry`` e manipular conforme apropriado.

source: To be directly usable as a :term:`path-like object`, ``os.DirEntry`` implements the :class:`PathLike` interface.
pt_br: Para ser diretamente utilizável como um :term:`objeto caminho ou similar`, ``os.DirEntry`` implementa a interface :class:`PathLike`.

source: Attributes and methods on a ``os.DirEntry`` instance are as follows:
pt_br: Atributos e métodos em uma instância de ``os.DirEntry`` são os seguintes:

source: The entry's base filename, relative to the :func:`scandir` *path* argument.
pt_br: O nome do arquivo base da entrada, relativo ao argumento *path* de :func:`scandir`.

source: The :attr:`name` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
pt_br: O atributo :attr:`name` será ``bytes`` se o argumento *path* de :func:`scandir` for do tipo ``bytes`` e, caso contrário, ``str``. Usa :func:`~os.fsdecode` para decodificar nomes de arquivos de bytes.

source: The entry's full path name: equivalent to ``os.path.join(scandir_path, entry.name)`` where *scandir_path* is the :func:`scandir` *path* argument. The path is only absolute if the :func:`scandir` *path* argument was absolute. If the :func:`scandir` *path* argument was a :ref:`file descriptor <path_fd>`, the :attr:`path` attribute is the same as the :attr:`name` attribute.
pt_br: O nome do caminho completo da entrada: equivalente a ``os.path.join(scandir_path, entry.name)`` onde *scandir_path* é o argumento *path* de :func:`scandir`. O caminho só é absoluto se o argumento *path* de :func:`scandir` for absoluto. Se o argumento *path* de :func:`scandir` era um :ref:`descritor de arquivo <path_fd>`, o atributo :attr:`path` é o mesmo que o atributo :attr:`name`.

source: The :attr:`path` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
pt_br: O atributo :attr:`path` será ``bytes`` se o argumento *path* de :func:`scandir` for do tipo ``bytes`` e, caso contrário, ``str``. Usa :func:`~os.fsdecode` para decodificar nomes de arquivos de bytes.

source: Return the inode number of the entry.
pt_br: Retorna o número de nó-i da entrada.

source: The result is cached on the ``os.DirEntry`` object. Use ``os.stat(entry.path, follow_symlinks=False).st_ino`` to fetch up-to-date information.
pt_br: O resultado é armazenado em cache no objeto ``os.DirEntry``. Use ``os.stat(entry.path, follow_symlinks=False).st_ino`` para obter informações atualizadas.

source: On the first, uncached call, a system call is required on Windows but not on Unix.
pt_br: Na primeira chamada sem cache, uma chamada de sistema é necessária no Windows, mas não no Unix.

source: Return ``True`` if this entry is a directory or a symbolic link pointing to a directory; return ``False`` if the entry is or points to any other kind of file, or if it doesn't exist anymore.
pt_br: Retorna ``True`` se esta entrada for um diretório ou um link simbólico apontando para um diretório; retorna ``False`` se a entrada é ou aponta para qualquer outro tipo de arquivo, ou se ele não existe mais.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a directory (without following symlinks); return ``False`` if the entry is any other kind of file or if it doesn't exist anymore.
pt_br: Se *follow_symlinks* for ``False``, retorna ``True`` apenas se esta entrada for um diretório (sem seguir os links simbólicos); retorna ``False`` se a entrada for qualquer outro tipo de arquivo ou se ele não existe mais.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` along with :func:`stat.S_ISDIR` to fetch up-to-date information.
pt_br: O resultado é armazenado em cache no objeto ``os.DirEntry``, com um cache separado para *follow_symlinks* ``True`` e ``False``. Chama :func:`os.stat` junto com :func:`stat.S_ISDIR` para buscar informações atualizadas.

source: On the first, uncached call, no system call is required in most cases. Specifically, for non-symlinks, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``. If the entry is a symlink, a system call will be required to follow the symlink unless *follow_symlinks* is ``False``.
pt_br: Na primeira chamada sem cache, nenhuma chamada do sistema é necessária na maioria dos casos. Especificamente, para links não simbólicos, nem o Windows nem o Unix requerem uma chamada de sistema, exceto em certos sistemas de arquivos Unix, como sistemas de arquivos de rede, que retornam ``dirent.d_type == DT_UNKNOWN``. Se a entrada for um link simbólico, uma chamada de sistema será necessária para seguir o link simbólico, a menos que *follow_symlinks* seja ``False``.

source: This method can raise :exc:`OSError`, such as :exc:`PermissionError`, but :exc:`FileNotFoundError` is caught and not raised.
pt_br: Este método pode levantar :exc:`OSError`, tal como :exc:`PermissionError`, mas :exc:`FileNotFoundError` é capturada e não levantada.

source: Return ``True`` if this entry is a file or a symbolic link pointing to a file; return ``False`` if the entry is or points to a directory or other non-file entry, or if it doesn't exist anymore.
pt_br: Retorna ``True`` se esta entrada for um arquivo ou um link simbólico apontando para um arquivo; retorna ``False`` se a entrada é ou aponta para um diretório ou outra entrada que não seja de arquivo, ou se ela não existe mais.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a file (without following symlinks); return ``False`` if the entry is a directory or other non-file entry, or if it doesn't exist anymore.
pt_br: Se *follow_symlinks* for ``False``, retorna ``True`` apenas se esta entrada for um arquivo (sem seguir os links simbólicos); retorna ``False`` se a entrada for um diretório ou outra entrada que não seja um arquivo, ou se ela não existir mais.

source: The result is cached on the ``os.DirEntry`` object. Caching, system calls made, and exceptions raised are as per :func:`~os.DirEntry.is_dir`.
pt_br: O resultado é armazenado em cache no objeto ``os.DirEntry``. Chamadas de sistema em cache feitas e exceções levantadas são conforme :func:`~os.DirEntry.is_dir`.

source: Return ``True`` if this entry is a symbolic link (even if broken); return ``False`` if the entry points to a directory or any kind of file, or if it doesn't exist anymore.
pt_br: Retorna ``True`` se esta entrada for um link simbólico (mesmo se quebrado); retorna ``False`` se a entrada apontar para um diretório ou qualquer tipo de arquivo, ou se ele não existir mais.

source: The result is cached on the ``os.DirEntry`` object. Call :func:`os.path.islink` to fetch up-to-date information.
pt_br: O resultado é armazenado em cache no objeto ``os.DirEntry``. Chama :func:`os.path.islink` para buscar informações atualizadas.

source: On the first, uncached call, no system call is required in most cases. Specifically, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``.
pt_br: Na primeira chamada sem cache, nenhuma chamada do sistema é necessária na maioria dos casos. Especificamente, nem o Windows nem o Unix exigem uma chamada de sistema, exceto em certos sistemas de arquivos Unix, como sistemas de arquivos de rede, que retornam ``dirent.d_type == DT_UNKNOWN``.

source: Return ``True`` if this entry is a junction (even if broken); return ``False`` if the entry points to a regular directory, any kind of file, a symlink, or if it doesn't exist anymore.
pt_br: Retorna ``True`` se esta entrada for uma junção (mesmo se quebrado); retorna ``False`` se a entrada apontar para um diretório regular, ou qualquer tipo de arquivo, um link simbólico ou se ele não existir mais.

source: The result is cached on the ``os.DirEntry`` object. Call :func:`os.path.isjunction` to fetch up-to-date information.
pt_br: O resultado é armazenado em cache no objeto ``os.DirEntry``. Chama :func:`os.path.isjunction` para buscar informações atualizadas.

source: Return a :class:`stat_result` object for this entry. This method follows symbolic links by default; to stat a symbolic link add the ``follow_symlinks=False`` argument.
pt_br: Retorna um objeto :class:`stat_result` para esta entrada. Este método segue links simbólicos por padrão; para estabelecer um link simbólico, adicione o argumento ``follow_symlinks=False``.

source: On Unix, this method always requires a system call. On Windows, it only requires a system call if *follow_symlinks* is ``True`` and the entry is a reparse point (for example, a symbolic link or directory junction).
pt_br: No Unix, esse método sempre requer uma chamada de sistema. No Windows, ele só requer uma chamada de sistema se *follow_symlinks* for ``True`` e a entrada for um ponto de nova análise (por exemplo, um link simbólico ou junção de diretório).

source: On Windows, the ``st_ino``, ``st_dev`` and ``st_nlink`` attributes of the :class:`stat_result` are always set to zero. Call :func:`os.stat` to get these attributes.
pt_br: No Windows, os atributos ``st_ino``, ``st_dev`` e ``st_nlink`` da :class:`stat_result` são sempre definidos como zero. Chame :func:`os.stat` para obter esses atributos.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` to fetch up-to-date information.
pt_br: O resultado é armazenado em cache no objeto ``os.DirEntry``, com um cache separado para *follow_symlinks* ``True`` e ``False``. Chame :func:`os.stat` para buscar informações atualizadas.

source: Note that there is a nice correspondence between several attributes and methods of ``os.DirEntry`` and of :class:`pathlib.Path`. In particular, the ``name`` attribute has the same meaning, as do the ``is_dir()``, ``is_file()``, ``is_symlink()``, ``is_junction()``, and ``stat()`` methods.
pt_br: Note que há uma boa correspondência entre vários atributos e métodos de ``os.DirEntry`` e de :class:`pathlib.Path`. Em particular, o atributo ``name`` tem o mesmo significado, assim como os métodos ``is_dir()``, ``is_file()``, ``is_symlink()``, ``is_junction()`` e ``stat()``.

source: Added support for the :class:`~os.PathLike` interface. Added support for :class:`bytes` paths on Windows.
pt_br: Adicionado suporte para a interface :class:`~os.PathLike`. Adicionado suporte para caminhos :class:`bytes` no Windows.
