Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: Return the value of the environment variable *key* as bytes if it exists, or *default* if it doesn't. *key* must be bytes. Note that since :func:`getenvb` uses :data:`os.environb`, the mapping of :func:`getenvb` is similarly also captured on import, and the function may not reflect future environment changes.
pt_br: Retorna o valor da variável de ambiente *key* como bytes se existir, ou *default* se não existir. *key* deve ser bytes. Note que uma vez que :func:`getenvb` utiliza :data:`os.environb`, o mapeamento de :func:`getenvb` é também similarmente capturado na importação, e a função pode não refletir futuras mudanças no ambiente.

source: :func:`getenvb` is only available if :const:`supports_bytes_environ` is ``True``.
pt_br: :func:`getenvb` está disponível somente se :const:`supports_bytes_environ` for ``True``.

source: Returns the list of directories that will be searched for a named executable, similar to a shell, when launching a process. *env*, when specified, should be an environment variable dictionary to lookup the PATH in. By default, when *env* is ``None``, :data:`environ` is used.
pt_br: Retorna a lista de diretórios que serão buscados por um executável nomeado, semelhante a um shell, ao iniciar um processo. *env*, quando especificado, deve ser um dicionário de variáveis de ambiente para procurar o PATH. Por padrão, quando *env* é ``None``, :data:`environ` é usado.

source: Return the effective group id of the current process. This corresponds to the "set id" bit on the file being executed in the current process.
pt_br: Retorna o ID do grupo efetivo do processo atual. Isso corresponde ao bit "set id" no arquivo que está sendo executado no processo atual.

source: Return the current process's effective user id.
pt_br: Retorna o ID de usuário efetivo do processo atual.

source: Return the real group id of the current process.
pt_br: Retorna o ID do grupo real do processo atual.

source: The function is a stub on WASI, see :ref:`wasm-availability` for more information.
pt_br: A função é uma simulação em WASI, veja :ref:`wasm-availability` para mais informações.

source: Return list of group ids that *user* belongs to. If *group* is not in the list, it is included; typically, *group* is specified as the group ID field from the password record for *user*, because that group ID will otherwise be potentially omitted.
pt_br: Retorna a lista de IDs de grupo aos quais *user* pertence. Se *group* não estiver na lista, ele será incluído; normalmente, *group* é especificado como o campo de ID de grupo do registro de senha para *user*, porque esse ID de grupo será potencialmente omitido.

source: Return list of supplemental group ids associated with the current process.
pt_br: Retorna a lista de IDs de grupos suplementares associados ao processo atual.

source: On macOS, :func:`getgroups` behavior differs somewhat from other Unix platforms. If the Python interpreter was built with a deployment target of ``10.5`` or earlier, :func:`getgroups` returns the list of effective group ids associated with the current user process; this list is limited to a system-defined number of entries, typically 16, and may be modified by calls to :func:`setgroups` if suitably privileged. If built with a deployment target greater than ``10.5``, :func:`getgroups` returns the current group access list for the user associated with the effective user id of the process; the group access list may change over the lifetime of the process, it is not affected by calls to :func:`setgroups`, and its length is not limited to 16. The deployment target value, :const:`MACOSX_DEPLOYMENT_TARGET`, can be obtained with :func:`sysconfig.get_config_var`.
pt_br: No Mac OS, o comportamento da função :func:`getgroups` difere um pouco de outras plataformas Unix. Se o interpretador Python foi compilado para distribuição na versão ``10.5``, ou anterior, :func:`getgroups` retorna a lista de IDs de grupos efetivos, associados ao processo do usuário atual; esta lista é limitada a um número de entradas definido pelo sistema, tipicamente 16, e pode ser modificada por chamadas para :func:`setgroups` se tiver o privilégio adequado. Se foi compilado para distribuição na versão maior que ``10.5``, :func:`getgroups` retorna a lista de acesso de grupo atual para o usuário associado ao ID de usuário efetivo do processo; a lista de acesso de grupo pode mudar durante a vida útil do processo, e ela não é afetada por chamadas para :func:`setgroups`, e seu comprimento não é limitado a 16. O valor da constante :const:`MACOSX_DEPLOYMENT_TARGET`, pode ser obtido com :func:`sysconfig.get_config_var`.

source: Return the name of the user logged in on the controlling terminal of the process. For most purposes, it is more useful to use :func:`getpass.getuser` since the latter checks the environment variables :envvar:`LOGNAME` or :envvar:`USERNAME` to find out who the user is, and falls back to ``pwd.getpwuid(os.getuid())[0]`` to get the login name of the current real user id.
pt_br: Retorna o nome do usuário conectado no terminal de controle do processo. Para a maioria dos propósitos, é mais útil usar :func:`getpass.getuser`, já que esse último verifica as variáveis de ambiente :envvar:`LOGNAME` ou :envvar:`USERNAME` para descobrir quem é o usuário, e retorna para ``pwd.getpwuid(os.getuid())[0]`` para obter o nome de login do ID do usuário real atual.

source: Return the process group id of the process with process id *pid*. If *pid* is 0, the process group id of the current process is returned.
pt_br: Retorna o ID do grupo de processo com *pid*. Se *pid* for 0, o ID do grupo do processos do processo atual é retornado.

source: Return the id of the current process group.
pt_br: Retorna o ID do grupo do processo atual.

source: Return the current process id.
pt_br: Retorna o ID do processo atual.

source: Return the parent's process id. When the parent process has exited, on Unix the id returned is the one of the init process (1), on Windows it is still the same id, which may be already reused by another process.
pt_br: Retorna o ID do processo pai. Quando o processo pai é encerrado, no Unix, o ID retornado é o do processo init (1); no Windows, ainda é o mesmo ID, que pode já estar sendo reutilizado por outro processo.

source: Added support for Windows.
pt_br: Adicionado suporte para Windows.

source: Get program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process.
pt_br: Obtém prioridade de agendamento de programa. O valor *which* é um entre :const:`PRIO_PROCESS`, :const:`PRIO_PGRP` ou :const:`PRIO_USER`, e *who* é interpretado em relação a *which* (um identificador de processo para :const:`PRIO_PROCESS`, identificador do grupo de processos para :const:`PRIO_PGRP` e um ID de usuário para :const:`PRIO_USER`). Um valor zero para *who* indica (respectivamente) o processo de chamada, o grupo de processos do processo de chamada ou o ID do usuário real do processo de chamada.

source: Parameters for the :func:`getpriority` and :func:`setpriority` functions.
pt_br: Parâmetros para as funções :func:`getpriority` e :func:`setpriority`.

source: Return a tuple (ruid, euid, suid) denoting the current process's real, effective, and saved user ids.
pt_br: Retorna uma tupla (ruid, euid, suid) indicando os IDs de usuário real, efetivo e salvo do processo atual.

source: Return a tuple (rgid, egid, sgid) denoting the current process's real, effective, and saved group ids.
pt_br: Retorna uma tupla (rgid, egid, sgid) indicando os IDs de grupos real, efetivo e salvo do processo atual.

source: Return the current process's real user id.
pt_br: Retorna o ID de usuário real do processo atual.

source: Call the system initgroups() to initialize the group access list with all of the groups of which the specified username is a member, plus the specified group id.
pt_br: Chama o initgroups() do sistema para inicializar a lista de acesso ao grupo com todos os grupos dos quais o nome de usuário especificado é membro, mais o ID do grupo especificado.

source: Set the environment variable named *key* to the string *value*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
pt_br: Define a variável de ambiente denominada *key* como a string *value*. Tais mudanças no ambiente afetam os subprocessos iniciados com :func:`os.system`, :func:`popen` ou :func:`fork` e :func:`execv`.

source: Assignments to items in :data:`os.environ` are automatically translated into corresponding calls to :func:`putenv`; however, calls to :func:`putenv` don't update :data:`os.environ`, so it is actually preferable to assign to items of :data:`os.environ`. This also applies to :func:`getenv` and :func:`getenvb`, which respectively use :data:`os.environ` and :data:`os.environb` in their implementations.
pt_br: Atribuições a itens em :data:`os.environ` são automaticamente traduzidas em chamadas correspondentes para :func:`putenv`; entretanto, chamadas para :func:`putenv` não atualizam :data:`os.environ`, então é preferível atribuir itens de :data:`os.environ`. Isso também se aplica a :func:`getenv` e :func:`getenvb`, que usam respectivamente :data:`os.environ` e :data:`os.environb` em suas implementações.

source: See also the :func:`os.reload_environ` function.
pt_br: Veja também a função :func:`os.reload_environ`.

source: On some platforms, including FreeBSD and macOS, setting ``environ`` may cause memory leaks. Refer to the system documentation for :c:func:`!putenv`.
pt_br: Em algumas plataformas, incluindo FreeBSD e Mac OS X, a modificação de ``environ`` pode causar vazamentos de memória. Consulte a documentação do sistema para :c:func:`!putenv`.

source: Raises an :ref:`auditing event <auditing>` ``os.putenv`` with arguments ``key``, ``value``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.putenv`` com os argumentos ``key``, ``value``.

source: The function is now always available.
pt_br: A função está agora sempre disponível.

source: Set the current process's effective group id.
pt_br: Define o ID do grupo efetivo do processo atual.

source: Set the current process's effective user id.
pt_br: Define o ID do usuário efetivo do processo atual.

source: Set the current process' group id.
pt_br: Define o ID do grupo do processo atual.

source: Set the list of supplemental group ids associated with the current process to *groups*. *groups* must be a sequence, and each element must be an integer identifying a group. This operation is typically available only to the superuser.
pt_br: Define a lista de IDs de grupo suplementares associados ao processo atual como *groups*. *groups* deve ser uma sequência e cada elemento deve ser um número inteiro identificando um grupo. Esta operação normalmente está disponível apenas para o superusuário.

source: On macOS, the length of *groups* may not exceed the system-defined maximum number of effective group ids, typically 16. See the documentation for :func:`getgroups` for cases where it may not return the same group list set by calling setgroups().
pt_br: No Mac OS X, o comprimento de *groups* não pode exceder o número máximo definido pelo sistema de IDs de grupo efetivos, normalmente 16. Consulte a documentação de :func:`getgroups` para casos em que ele pode não retornar o mesmo grupo de listas definido chamando setgroups().

source: Reassociate the current thread with a Linux namespace. See the :manpage:`setns(2)` and :manpage:`namespaces(7)` man pages for more details.
pt_br: Reassocia a thread atual com um espaço de nomes do Linux. Veja as páginas man :manpage:`setns(2)` e :manpage:`namespaces(7)` para mais detalhes.

source: If *fd* refers to a :file:`/proc/{pid}/ns/` link, ``setns()`` reassociates the calling thread with the namespace associated with that link, and *nstype* may be set to one of the :ref:`CLONE_NEW* constants <os-unshare-clone-flags>` to impose constraints on the operation (``0`` means no constraints).
pt_br: Se *fd* se refere a um link :file:`/proc/{pid}/ns/`, ``setns()`` reassocia a thread de chamada com o espaço de nomes associado a esse link, e *nstype* pode ser definido como uma das :ref:`constantes CLONE_NEW* <os-unshare-clone-flags>` para impor restrições na operação (``0`` significa sem restrições).

source: Since Linux 5.8, *fd* may refer to a PID file descriptor obtained from :func:`~os.pidfd_open`. In this case, ``setns()`` reassociates the calling thread into one or more of the same namespaces as the thread referred to by *fd*. This is subject to any constraints imposed by *nstype*, which is a bit mask combining one or more of the :ref:`CLONE_NEW* constants <os-unshare-clone-flags>`, e.g. ``setns(fd, os.CLONE_NEWUTS | os.CLONE_NEWPID)``. The caller's memberships in unspecified namespaces are left unchanged.
pt_br: Desde o Linux 5.8, *fd* pode se referir a um descritor de arquivo PID obtido de :func:`~os.pidfd_open`. Neste caso, ``setns()`` reassocia a thread chamadora em um ou mais dos mesmos espaços de nomes que o thread referenciado por *fd*. Isso está sujeito a quaisquer restrições impostas por *nstype*, que é uma máscara de bits que combina uma ou mais das :ref:`constantes CLONE_NEW* <os-unshare-clone-flags>`, por exemplo ``setns(fd, os.CLONE_NEWUTS | os.CLONE_NEWPID)``. As associações do chamador em espaços de nomes não especificados permanecem inalteradas.

source: *fd* can be any object with a :meth:`~io.IOBase.fileno` method, or a raw file descriptor.
pt_br: *fd* pode ser qualquer objeto com um método :meth:`~io.IOBase.fileno` ou um descritor de arquivo bruto.

source: This example reassociates the thread with the ``init`` process's network namespace::
pt_br: Este exemplo reassocia a thread com o espaço de nomes de rede do processo ``init``::

source: The :func:`~os.unshare` function.
pt_br: A função :func:`~os.unshare`.

source: Call the system call :c:func:`!setpgrp` or ``setpgrp(0, 0)`` depending on which version is implemented (if any). See the Unix manual for the semantics.
pt_br: Executa a chamada de sistema :c:func:`!setpgrp` ou ``setpgrp(0, 0)`` dependendo da versão implementada (se houver). Veja o manual do Unix para a semântica.

source: Call the system call :c:func:`!setpgid` to set the process group id of the process with id *pid* to the process group with id *pgrp*. See the Unix manual for the semantics.
pt_br: Executa a chamada de sistema :c:func:`!setpgid` para definir o ID do grupo do processo com *pid* para o grupo de processos com o id *pgrp*. Veja o manual do Unix para a semântica.

source: Set program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process. *priority* is a value in the range -20 to 19. The default priority is 0; lower priorities cause more favorable scheduling.
pt_br: Define a prioridade de agendamento de programa. O valor *which* é um entre :const:`PRIO_PROCESS`, :const:`PRIO_PGRP` ou :const:`PRIO_USER`, e *who* é interpretado em relação a *which* (um identificador de processo para :const:`PRIO_PROCESS`, identificador do grupo de processos para :const:`PRIO_PGRP` e um ID de usuário para :const:`PRIO_USER`). Um valor zero para *who* indica (respectivamente) o processo de chamada, o grupo de processos do processo de chamada ou o ID do usuário real do processo de chamada. *priority* é um valor na faixa de -20 a 19. A prioridade padrão é 0; prioridades menores resultam em um agendamento mais favorável.

source: Set the current process's real and effective group ids.
pt_br: Define os IDs de grupo real e efetivo do processo atual.

source: Set the current process's real, effective, and saved group ids.
pt_br: Define os IDs de grupo real, efetivo e salvo do processo atual.

source: Set the current process's real, effective, and saved user ids.
pt_br: Define os IDs de usuário real, efetivo e salvo do processo atual.

source: Set the current process's real and effective user ids.
pt_br: Define os IDs de usuário real e efetivo do processo atual.

source: Call the system call :c:func:`!getsid`. See the Unix manual for the semantics.
pt_br: Executa a chamada de sistema :c:func:`!getsid`. Veja o manual do Unix para semântica.

source: Call the system call :c:func:`!setsid`. See the Unix manual for the semantics.
pt_br: Executa a chamada de sistema :c:func:`!setsid`. Veja o manual do Unix para semântica.

source: Set the current process's user id.
pt_br: Define o ID de usuário do processo atual.

source: Return the error message corresponding to the error code in *code*. On platforms where :c:func:`!strerror` returns ``NULL`` when given an unknown error number, :exc:`ValueError` is raised.
pt_br: Retorna a mensagem de erro correspondente ao código de erro em *code*. Nas plataformas em que :c:func:`!strerror` retorna ``NULL`` quando recebe um número de erro desconhecido, :exc:`ValueError` é levantada.

source: ``True`` if the native OS type of the environment is bytes (eg. ``False`` on Windows).
pt_br: ``True`` se o tipo de sistema operacional nativo do ambiente estiver em bytes (por exemplo, ``False`` no Windows).

source: Set the current numeric umask and return the previous umask.
pt_br: Define o umask numérico atual e retorna o umask anterior.

source: Returns information identifying the current operating system. The return value is an object with five attributes:
pt_br: Retorna informações identificando o sistema operacional atual. O valor retornado é um objeto com cinco atributos:

source: :attr:`sysname` - operating system name
pt_br: :attr:`sysname` - nome do sistema operacional

source: :attr:`nodename` - name of machine on network (implementation-defined)
pt_br: :attr:`nodename` - nome da máquina na rede (definido pela implementação)

source: :attr:`release` - operating system release
pt_br: :attr:`release` - lançamento do sistema operacional

source: :attr:`version` - operating system version
pt_br: :attr:`version` - versão do sistema operacional

source: :attr:`machine` - hardware identifier
pt_br: :attr:`machine` - identificador de hardware

source: For backwards compatibility, this object is also iterable, behaving like a five-tuple containing :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version`, and :attr:`machine` in that order.
pt_br: Para compatibilidade com versões anteriores, esse objeto também é iterável, comportando-se como uma tupla de 5 elementos contendo :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version` e :attr:`machine` nessa ordem.

source: Some systems truncate :attr:`nodename` to 8 characters or to the leading component; a better way to get the hostname is :func:`socket.gethostname` or even ``socket.gethostbyaddr(socket.gethostname())``.
pt_br: Alguns sistemas truncam :attr:`nodename` para 8 caracteres ou para o componente principal; uma maneira melhor de obter o nome do host é :func:`socket.gethostname` ou até mesmo ``socket.gethostbyaddr(socket.gethostname())``.

source: On macOS, iOS and Android, this returns the *kernel* name and version (i.e., ``'Darwin'`` on macOS and iOS; ``'Linux'`` on Android). :func:`platform.uname` can be used to get the user-facing operating system name and version on iOS and Android.
pt_br: No macOS, iOS e Android, retorna o nome e a versão do *kernel* (ou seja, ``'Darwin'`` no macOS e iOS; ``'Linux'`` no Android). :func:`platform.uname` pode ser usada para obter o nome e a versão do sistema operacional voltado para o usuário no iOS e Android.

source: Return type changed from a tuple to a tuple-like object with named attributes.
pt_br: Tipo de retorno foi alterado de uma tupla para um objeto tupla ou similar com atributos nomeados.

source: Unset (delete) the environment variable named *key*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
pt_br: Cancela (exclui) a variável de ambiente denominada *key*. Tais mudanças no ambiente afetam subprocessos iniciados com :func:`os.system`, :func:`popen` ou :func:`fork` e :func:`execv`.

source: Deletion of items in :data:`os.environ` is automatically translated into a corresponding call to :func:`unsetenv`; however, calls to :func:`unsetenv` don't update :data:`os.environ`, so it is actually preferable to delete items of :data:`os.environ`.
pt_br: A exclusão de itens em :data:`os.environ` é automaticamente traduzida para uma chamada correspondente a :func:`unsetenv`; no entanto, chamadas a :func:`unsetenv` não atualizam :data:`os.environ`, por isso, na verdade é preferível excluir itens de :data:`os.environ`.

source: Raises an :ref:`auditing event <auditing>` ``os.unsetenv`` with argument ``key``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.unsetenv`` com o argumento ``key``.

source: The function is now always available and is also available on Windows.
pt_br: A função está agora sempre disponível e também está disponível no Windows.

source: Disassociate parts of the process execution context, and move them into a newly created namespace. See the :manpage:`unshare(2)` man page for more details. The *flags* argument is a bit mask, combining zero or more of the :ref:`CLONE_* constants <os-unshare-clone-flags>`, that specifies which parts of the execution context should be unshared from their existing associations and moved to a new namespace. If the *flags* argument is ``0``, no changes are made to the calling process's execution context.
pt_br: Desassocia partes do contexto de execução do processo e move-as para um espaço de nomes recém-criado. Veja a página man :manpage:`unshare(2)` para mais detalhes. O argumento *flags* é uma máscara de bits, combinando zero ou mais :ref:`constantes CLONE_* <os-unshare-clone-flags>`, que especifica quais partes do contexto de execução devem ser descompartilhadas de suas associações existentes e movidas para um novo espaço de nomes. Se o argumento *flags* for ``0``, nenhuma alteração será feita no contexto de execução do processo de chamada.

source: The :func:`~os.setns` function.
pt_br: A função :func:`~os.setns`.

source: Flags to the :func:`unshare` function, if the implementation supports them. See :manpage:`unshare(2)` in the Linux manual for their exact effect and availability.
pt_br: Sinalizações para a função :func:`unshare`, se a implementação oferecer suporte. Veja :manpage:`unshare(2)` no manual do Linux para seu exato efeito e disponibilidade.

source: File Object Creation
pt_br: Criação de objetos arquivos

source: These functions create new :term:`file objects <file object>`. (See also :func:`~os.open` for opening file descriptors.)
pt_br: Estas funções criam novos :term:`objetos arquivos <file object>`. (Veja também :func:`~os.open` para abrir os descritores de arquivos.)
