Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: The various :func:`exec\* <execl>` functions take a list of arguments for the new program loaded into the process. In each case, the first of these arguments is passed to the new program as its own name rather than as an argument a user may have typed on a command line. For the C programmer, this is the ``argv[0]`` passed to a program's :c:func:`main`. For example, ``os.execv('/bin/echo', ['foo', 'bar'])`` will only print ``bar`` on standard output; ``foo`` will seem to be ignored.
pt_br: As várias funções :func:`exec\* <execl>` recebem uma lista de argumentos para o novo programa carregado no processo. Em cada caso, o primeiro desses argumentos é passado para o novo programa como seu próprio nome, e não como um argumento que um usuário pode ter digitado em uma linha de comando. Para o programador C, este é o ``argv[0]`` passado para um programa :c:func:`main`. Por exemplo, ``os.execv('/bin/echo', ['foo', 'bar'])`` exibirá apenas ``bar`` na saída padrão; ``foo`` parecerá ser ignorado.

source: Generate a :const:`SIGABRT` signal to the current process. On Unix, the default behavior is to produce a core dump; on Windows, the process immediately returns an exit code of ``3``. Be aware that calling this function will not call the Python signal handler registered for :const:`SIGABRT` with :func:`signal.signal`.
pt_br: Gera um sinal :const:`SIGABRT` para o processo atual. No Unix, o comportamento padrão é produzir um despejo de memória; no Windows, o processo retorna imediatamente um código de saída ``3``. Esteja ciente de que chamar esta função não chamará o manipulador de sinal Python registrado para :const:`SIGABRT` com :func:`signal.signal`.

source: Add a path to the DLL search path.
pt_br: Adiciona um caminho ao caminho de pesquisa de DLL.

source: This search path is used when resolving dependencies for imported extension modules (the module itself is resolved through :data:`sys.path`), and also by :mod:`ctypes`.
pt_br: Este caminho de pesquisa é usado ao resolver dependências para módulos de extensão importados (o próprio módulo é resolvido por meio de :data:`sys.path`), e também por :mod:`ctypes`.

source: Remove the directory by calling **close()** on the returned object or using it in a :keyword:`with` statement.
pt_br: Remove o diretório chamando **close()** no objeto retornado ou usando-o em uma instrução :keyword:`with`.

source: See the `Microsoft documentation <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ for more information about how DLLs are loaded.
pt_br: Consulte a `documentação da Microsoft <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ para obter mais informações sobre como as DLLs são carregadas.

source: Raises an :ref:`auditing event <auditing>` ``os.add_dll_directory`` with argument ``path``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.add_dll_directory`` com o argumento ``path``.

source: Previous versions of CPython would resolve DLLs using the default behavior for the current process. This led to inconsistencies, such as only sometimes searching :envvar:`PATH` or the current working directory, and OS functions such as ``AddDllDirectory`` having no effect.
pt_br: As versões anteriores do CPython resolveriam DLLs usando o comportamento padrão para o processo atual. Isso levou a inconsistências, como apenas às vezes pesquisar :envvar:`PATH` ou o diretório de trabalho atual, e funções do sistema operacional como ``AddDllDirectory`` sem efeito.

source: In 3.8, the two primary ways DLLs are loaded now explicitly override the process-wide behavior to ensure consistency. See the :ref:`porting notes <bpo-36085-whatsnew>` for information on updating libraries.
pt_br: No 3.8, as duas maneiras principais de carregar as DLLs agora substituem explicitamente o comportamento de todo o processo para garantir a consistência. Veja as :ref:`notas de portabilidade <bpo-36085-whatsnew>` para informações sobre atualização de bibliotecas.

source: These functions all execute a new program, replacing the current process; they do not return. On Unix, the new executable is loaded into the current process, and will have the same process id as the caller. Errors will be reported as :exc:`OSError` exceptions.
pt_br: Todas essas funções executam um novo programa, substituindo o processo atual; elas não retornam. No Unix, o novo executável é carregado no processo atual e terá a mesma identificação de processo do chamador. Os erros serão relatados como exceções de :exc:`OSError`.

source: The current process is replaced immediately. Open file objects and descriptors are not flushed, so if there may be data buffered on these open files, you should flush them using :func:`sys.stdout.flush` or :func:`os.fsync` before calling an :func:`exec\* <execl>` function.
pt_br: O processo atual é substituído imediatamente. Objetos arquivo abertos e descritores não são descarregados, então se houver dados em buffer nesses arquivos abertos, você deve descarregá-los usando :func:`sys.stdout.flush` ou :func:`os.fsync` antes de chamar uma função :func:`exec\* <execl>`.

source: The "l" and "v" variants of the :func:`exec\* <execl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`!execl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process should start with the name of the command being run, but this is not enforced.
pt_br: As variantes "l" e "v" das funções :func:`exec\* <execl>` diferem em como os argumentos da linha de comando são passados. As variantes "l" são talvez as mais fáceis de trabalhar se o número de parâmetros for fixo quando o código for escrito; os parâmetros individuais simplesmente se tornam parâmetros adicionais para as funções :func:`!execl\*`. As variantes "v" são boas quando o número de parâmetros é variável, com os argumentos sendo passados em uma lista ou tupla como o parâmetro *args*. Em qualquer caso, os argumentos para o processo filho devem começar com o nome do comando que está sendo executado, mas isso não é obrigatório.

source: The variants which include a "p" near the end (:func:`execlp`, :func:`execlpe`, :func:`execvp`, and :func:`execvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`exec\*e <execl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`execl`, :func:`execle`, :func:`execv`, and :func:`execve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path. Relative paths must include at least one slash, even on Windows, as plain names will not be resolved.
pt_br: As variantes que incluem um "p" próximo ao final (:func:`execlp`, :func:`execlpe`, :func:`execvp` e :func:`execvpe`) usarão a variável de ambiente :envvar:`PATH` para localizar o programa *file*. Quando o ambiente está sendo substituído (usando uma das variantes :func:`exec\*e <execl>`, discutidas no próximo parágrafo), o novo ambiente é usado como fonte da variável :envvar:`PATH`. As outras variantes, :func:`execl`, :func:`execle`, :func:`execv` e :func:`execve`, não usarão a variável :envvar:`PATH` para localizar o executável; *path* deve conter um caminho absoluto ou relativo apropriado. Caminhos relativos devem incluir pelo menos uma barra, mesmo no Windows, pois nomes simples não serão resolvidos.

source: For :func:`execle`, :func:`execlpe`, :func:`execve`, and :func:`execvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (these are used instead of the current process' environment); the functions :func:`execl`, :func:`execlp`, :func:`execv`, and :func:`execvp` all cause the new process to inherit the environment of the current process.
pt_br: Para :func:`execle`, :func:`execlpe`, :func:`execve` e :func:`execvpe` (observe que todos eles terminam em "e"), o parâmetro *env* deve ser um mapeamento que é usado para definir as variáveis de ambiente para o novo processo (elas são usadas no lugar do ambiente do processo atual); as funções :func:`execl`, :func:`execlp`, :func:`execv` e :func:`execvp` fazem com que o novo processo herde o ambiente do processo atual.

source: For :func:`execve` on some platforms, *path* may also be specified as an open file descriptor. This functionality may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_fd`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
pt_br: Para :func:`execve` em algumas plataformas, *path* também pode ser especificado como um descritor de arquivo aberto. Esta funcionalidade pode não ser compatível com sua plataforma; você pode verificar se está ou não disponível usando :data:`os.supports_fd`. Se não estiver disponível, usá-lo vai levantar uma :exc:`NotImplementedError`.

source: Raises an :ref:`auditing event <auditing>` ``os.exec`` with arguments ``path``, ``args``, ``env``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.exec`` com os argumentos ``path``, ``args`` e ``env``.

source: Added support for specifying *path* as an open file descriptor for :func:`execve`.
pt_br: Adicionado suporte para especificar *path* como um descritor de arquivo aberto para :func:`execve`.

source: Exit the process with status *n*, without calling cleanup handlers, flushing stdio buffers, etc.
pt_br: Sai do processo com status *n*, sem chamar manipuladores de limpeza, liberando buffers de entrada e saída padrões etc.

source: The standard way to exit is :func:`sys.exit(n) <sys.exit>`. :func:`!_exit` should normally only be used in the child process after a :func:`fork`.
pt_br: A forma padrão de sair é :func:`sys.exit(n) <sys.exit>`. :func:`!_exit` normalmente só deve ser usado no processo filho após uma função :func:`fork`.

source: The following exit codes are defined and can be used with :func:`_exit`, although they are not required. These are typically used for system programs written in Python, such as a mail server's external command delivery program.
pt_br: Os seguintes códigos de saída são definidos e podem ser usados com :func:`_exit`, embora não sejam obrigatórios. Eles são normalmente usados para programas de sistema escritos em Python, como um programa de entrega de comando externo de servidor de e-mail.

source: Some of these may not be available on all Unix platforms, since there is some variation. These constants are defined where they are defined by the underlying platform.
pt_br: Alguns deles podem não estar disponíveis em todas as plataformas Unix, pois há algumas variações. Essas constantes estão definidas onde elas são definidas pela plataforma subjacente.

source: Exit code that means no error occurred. May be taken from the defined value of ``EXIT_SUCCESS`` on some platforms. Generally has a value of zero.
pt_br: Código de saída que significa que não ocorreu nenhum erro. Pode ser obtido do valor definido de ``EXIT_SUCCESS`` em algumas plataformas. Geralmente tem um valor de zero.

source: Exit code that means the command was used incorrectly, such as when the wrong number of arguments are given.
pt_br: Código de saída que significa que o comando foi usado incorretamente, como quando o número errado de argumentos é fornecido.

source: Exit code that means the input data was incorrect.
pt_br: Código de saída que significa que os dados inseridos estavam incorretos.

source: Exit code that means an input file did not exist or was not readable.
pt_br: Código de saída que significa que um arquivo de entrada não existe ou não pôde ser lido.

source: Exit code that means a specified user did not exist.
pt_br: Código de saída que significa que um usuário especificado não existe.

source: Exit code that means a specified host did not exist.
pt_br: Código de saída que significa que um host especificado não existe.

source: Exit code that means that a required service is unavailable.
pt_br: Código de saída que significa que um serviço necessário está indisponível.

source: Exit code that means an internal software error was detected.
pt_br: Código de saída que significa que um erro interno do software foi detectado.

source: Exit code that means an operating system error was detected, such as the inability to fork or create a pipe.
pt_br: Código de saída que significa que um erro do sistema operacional foi detectado, como a incapacidade de criar um fork ou um encadeamento.

source: Exit code that means some system file did not exist, could not be opened, or had some other kind of error.
pt_br: Código de saída que significa que algum arquivo do sistema não existia, não pôde ser aberto ou teve algum outro tipo de erro.

source: Exit code that means a user specified output file could not be created.
pt_br: Código de saída que significa que um arquivo de saída especificado pelo usuário não pôde ser criado.

source: Exit code that means that an error occurred while doing I/O on some file.
pt_br: Código de saída que significa que ocorreu um erro ao fazer E/S em algum arquivo.

source: Exit code that means a temporary failure occurred. This indicates something that may not really be an error, such as a network connection that couldn't be made during a retryable operation.
pt_br: Código de saída que significa que ocorreu uma falha temporária. Isso indica algo que pode não ser realmente um erro, como uma conexão de rede que não pôde ser feita durante uma operação de nova tentativa.

source: Exit code that means that a protocol exchange was illegal, invalid, or not understood.
pt_br: Código de saída que significa que uma troca de protocolo foi ilegal, inválida ou não compreendida.

source: Exit code that means that there were insufficient permissions to perform the operation (but not intended for file system problems).
pt_br: Código de saída que significa que não havia permissões suficientes para executar a operação (mas sem intenção de causar problemas do sistema de arquivos).

source: Exit code that means that some kind of configuration error occurred.
pt_br: Código de saída que significa que ocorreu algum tipo de erro de configuração.

source: Exit code that means something like "an entry was not found".
pt_br: Código de saída que significa algo como "uma entrada não foi encontrada".

source: Fork a child process. Return ``0`` in the child and the child's process id in the parent. If an error occurs :exc:`OSError` is raised.
pt_br: Cria um processo filho. Retorna ``0`` no filho e o ID de processo do filho no pai. Se ocorrer um erro, uma exceção :exc:`OSError` é levantada.

source: Note that some platforms including FreeBSD <= 6.3 and Cygwin have known issues when using ``fork()`` from a thread.
pt_br: Note que algumas plataformas incluindo FreeBSD <= 6.3 e Cygwin têm problemas conhecidos ao usar ``fork()`` a partir de um thread.

source: Raises an :ref:`auditing event <auditing>` ``os.fork`` with no arguments.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.fork`` sem argumentos.

source: If you use TLS sockets in an application calling ``fork()``, see the warning in the :mod:`ssl` documentation.
pt_br: Se você usa soquetes TLS em um aplicação chamando ``fork()``, consulte alerta na documentação do módulo :mod:`ssl`.

source: On macOS the use of this function is unsafe when mixed with using higher-level system APIs, and that includes using :mod:`urllib.request`.
pt_br: No macOS, o uso desta função é inseguro quando combinado com o uso de APIs de sistema de nível mais alto, e isso inclui o uso de :mod:`urllib.request`.

source: Calling ``fork()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
pt_br: Chamar ``fork()`` em um subinterpretador não é mais possível (:exc:`RuntimeError` é levantada).

source: If Python is able to detect that your process has multiple threads, :func:`os.fork` now raises a :exc:`DeprecationWarning`.
pt_br: Se o Python for capaz de detectar que o seu processar tem várias threads, o :func:`os.fork` agora levanta uma exceção :exc:`DeprecationWarning`.

source: We chose to surface this as a warning, when detectable, to better inform developers of a design problem that the POSIX platform specifically notes as not supported. Even in code that *appears* to work, it has never been safe to mix threading with :func:`os.fork` on POSIX platforms. The CPython runtime itself has always made API calls that are not safe for use in the child process when threads existed in the parent (such as ``malloc`` and ``free``).
pt_br: Optamos por apresentar isso como um alerta, quando detectável, para informar melhor aos desenvolvedores sobre um problema de design que a plataforma POSIX indica especificamente como sem suporte. Mesmo em códigos que *aparentem* funcionar, nunca foi seguro misturar threading com :func:`os.fork` em plataformas POSIX. O próprio ambiente de execução do CPython sempre fez chamadas à API que não são seguras para uso no processo filho quando existiam threads no pai (como ``malloc`` e ``free``).

source: Users of macOS or users of libc or malloc implementations other than those typically found in glibc to date are among those already more likely to experience deadlocks running such code.
pt_br: Os usuários do macOS ou usuários de implementações de libc ou malloc diferentes daquelas normalmente encontradas no glibc até o momento estão entre os que já têm maior probabilidade de sofrer com impasses (*deadlocks*) ao executar esse código.

source: See `this discussion on fork being incompatible with threads <https://discuss.python.org/t/33555>`_ for technical details of why we're surfacing this longstanding platform compatibility problem to developers.
pt_br: Consulte `esta discussão sobre fork ser incompatível com threads <https://discuss.python.org/t/33555>`_ para obter detalhes técnicos sobre o motivo pelo qual estamos revelando aos desenvolvedores esse problema de longa data de compatibilidade da plataforma.

source: Fork a child process, using a new pseudo-terminal as the child's controlling terminal. Return a pair of ``(pid, fd)``, where *pid* is ``0`` in the child, the new child's process id in the parent, and *fd* is the file descriptor of the master end of the pseudo-terminal. For a more portable approach, use the :mod:`pty` module. If an error occurs :exc:`OSError` is raised.
pt_br: Cria um processo filho, usando um novo pseudoterminal como o terminal de controle do filho. Retorna um par de ``(pid, fd)``, onde *pid* é ``0`` no filho, o novo ID de processo do filho no pai e *fd* é o descritor de arquivo do lado mestre do pseudoterminal. Para uma abordagem mais portátil, use o módulo :mod:`pty`. Se ocorrer um erro, :exc:`OSError` é levantada.

source: Raises an :ref:`auditing event <auditing>` ``os.forkpty`` with no arguments.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.forkpty`` sem argumentos.

source: Calling ``forkpty()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
pt_br: Chamar ``forkpty()`` em um subinterpretador não é mais permitido (:exc:`RuntimeError` é levantada).

source: If Python is able to detect that your process has multiple threads, this now raises a :exc:`DeprecationWarning`. See the longer explanation on :func:`os.fork`.
pt_br: Se o Python for capaz de detectar que o seu processo tem vários threads, isso agora levanta uma exceção :exc:`DeprecationWarning`. Veja a explicação mais longa em :func:`os.fork`.

source: Send signal *sig* to the process *pid*. Constants for the specific signals available on the host platform are defined in the :mod:`signal` module.
pt_br: Envia o sinal *sig* para o processo *pid*. Constantes dos sinais específicos disponíveis na plataforma host são definidas no módulo :mod:`signal`.

source: Windows: The :const:`signal.CTRL_C_EVENT` and :const:`signal.CTRL_BREAK_EVENT` signals are special signals which can only be sent to console processes which share a common console window, e.g., some subprocesses. Any other value for *sig* will cause the process to be unconditionally killed by the TerminateProcess API, and the exit code will be set to *sig*.
pt_br: Windows: os sinais :const:`signal.CTRL_C_EVENT` e :const:`signal.CTRL_BREAK_EVENT` são sinais especiais que só podem ser enviados para processos de console que compartilham uma janela de console comum, por exemplo, alguns subprocessos. Qualquer outro valor para *sig* fará com que o processo seja encerrado incondicionalmente pela API TerminateProcess e o código de saída será definido como *sig*.

source: See also :func:`signal.pthread_kill`.
pt_br: Veja também :func:`signal.pthread_kill`.

source: Raises an :ref:`auditing event <auditing>` ``os.kill`` with arguments ``pid``, ``sig``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.kill`` com os argumentos ``pid`` e ``sig``.

source: Send the signal *sig* to the process group *pgid*.
pt_br: Envia o sinal *sig* para o grupo de processos *pgid*.

source: Raises an :ref:`auditing event <auditing>` ``os.killpg`` with arguments ``pgid``, ``sig``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``os.killpg`` com os argumentos ``pgid`` e ``sig``.

source: Add *increment* to the process's "niceness". Return the new niceness.
pt_br: Adiciona *increment* ao nível de "nice" do processo. Retorna um novo nível de "nice".

source: Return a file descriptor referring to the process *pid* with *flags* set. This descriptor can be used to perform process management without races and signals.
pt_br: Retorna um descritor de arquivo referente ao processo *pid* com as *flags* definidas. Este descritor pode ser usado para gerenciar o processo sem corridas e sinais.

source: See the :manpage:`pidfd_open(2)` man page for more details.
pt_br: Veja a página man :manpage:`pidfd_open(2)` para mais detalhes.

source: This flag indicates that the file descriptor will be non-blocking. If the process referred to by the file descriptor has not yet terminated, then an attempt to wait on the file descriptor using :manpage:`waitid(2)` will immediately return the error :const:`~errno.EAGAIN` rather than blocking.
pt_br: Este sinalizador indica que o descritor de arquivo será não-bloqueante. Se o processo referenciado pelo descritor de arquivo ainda não tiver terminado, então uma tentativa de aguardar no descritor de arquivo usando :manpage:`waitid(2)` retornará imediatamente o erro :const:`~errno.EAGAIN` em vez de bloquear.

source: Lock program segments into memory. The value of *op* (defined in ``<sys/lock.h>``) determines which segments are locked.
pt_br: Trava os segmentos do programa na memória. O valor de *op* (definido em ``<sys/lock.h>``) determina quais segmentos são travados.
