Repository: python/python-docs-pt-br
Catalog: library/os.po
Languages: pt_br

source: The following constants are options for the *flags* parameter to the :func:`~os.open` function. They can be combined using the bitwise OR operator ``|``. Some of them are not available on all platforms. For descriptions of their availability and use, consult the :manpage:`open(2)` manual page on Unix or `the MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ on Windows.
pt_br: As seguintes constantes são opções para o parâmetro *flags* da função :func:`~os.open`. Elas podem ser combinadas usando o operador bit a bit OU ``|``. Algumas delas não estão disponíveis em todas as plataformas. Para obter descrições de sua disponibilidade e uso, consulte a página de manual :manpage:`open(2)` para Unix ou `o MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ para Windows.

source: The above constants are available on Unix and Windows.
pt_br: As constantes acima estão disponíveis no Unix e Windows.

source: The above constants are only available on Unix.
pt_br: As constantes acima estão disponíveis apenas no Unix.

source: Add :data:`O_CLOEXEC` constant.
pt_br: Adicionada a constante :data:`O_CLOEXEC`.

source: The above constants are only available on Windows.
pt_br: As constantes acima estão disponíveis apenas no Windows.

source: The above constants are only available on macOS.
pt_br: As constantes acima estão disponíveis apenas no macOS.

source: Add :data:`O_EVTONLY`, :data:`O_FSYNC`, :data:`O_SYMLINK` and :data:`O_NOFOLLOW_ANY` constants.
pt_br: Adicionadas as constantes :data:`O_EVTONLY`, :data:`O_FSYNC`, :data:`O_SYMLINK` e :data:`O_NOFOLLOW_ANY`.

source: The above constants are extensions and not present if they are not defined by the C library.
pt_br: As constantes acima são extensões e não estarão presentes, se não forem definidos pela biblioteca C.

source: Add :data:`O_PATH` on systems that support it. Add :data:`O_TMPFILE`, only available on Linux Kernel 3.11 or newer.
pt_br: Adicionada :data:`O_PATH` em sistemas que oferecem suporte. Adicionada :data:`O_TMPFILE`, somente disponível no kernel Linux 3.11 ou mais recente.

source: Open a new pseudo-terminal pair. Return a pair of file descriptors ``(master, slave)`` for the pty and the tty, respectively. The new file descriptors are :ref:`non-inheritable <fd_inheritance>`. For a (slightly) more portable approach, use the :mod:`pty` module.
pt_br: Abre um novo par de pseudo-terminal. Retorna um par de descritores de arquivos ``(master, slave)`` para o pty e o tty, respectivamente. Os novos descritores de arquivos são :ref:`não-herdáveis <fd_inheritance>`. Para uma abordagem (ligeiramente) mais portável, use o módulo :mod:`pty`.

source: The new file descriptors are now non-inheritable.
pt_br: Os novos descritores de arquivos agora são não-herdáveis.

source: Create a pipe. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
pt_br: Cria um encadeamento (pipe). Retorna um par de descritores de arquivos ``(r, w)`` usáveis para leitura e escrita, respectivamente. O novo descritor de arquivo é :ref:`não-herdável <fd_inheritance>`.

source: Create a pipe with *flags* set atomically. *flags* can be constructed by ORing together one or more of these values: :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively.
pt_br: Cria um encadeamento (pipe) com *flags* definidos atomicamente. *flags* podem ser construídos por aplicação de OU junto a um ou mais destes valores: :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Retorna um par de descritores de arquivos ``(r, w)`` utilizáveis para leitura e gravação, respectivamente.

source: Ensures that enough disk space is allocated for the file specified by *fd* starting from *offset* and continuing for *len* bytes.
pt_br: Garante que um espaço em disco suficiente seja alocado para o arquivo especificado por *fd* iniciando em *offset* e continuando por *len* bytes.

source: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations. The advice applies to the region of the file specified by *fd* starting at *offset* and continuing for *len* bytes. *advice* is one of :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` or :data:`POSIX_FADV_DONTNEED`.
pt_br: Anuncia a intenção de acessar dados em um padrão específico, permitindo assim que o kernel faça otimizações. O conteúdo em *advice* se aplica à região do arquivo especificado por *fd*, iniciando em *offset* e continuando por *len* bytes. *advice* é um entre :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` ou :data:`POSIX_FADV_DONTNEED`.

source: Flags that can be used in *advice* in :func:`posix_fadvise` that specify the access pattern that is likely to be used.
pt_br: Sinalizadores que podem ser usados em *advice* em :func:`posix_fadvise` que especificam o padrão de acesso que provavelmente será usado.

source: Read at most *n* bytes from file descriptor *fd* at a position of *offset*, leaving the file offset unchanged.
pt_br: Lê no máximo *n* bytes do descritor de arquivo *fd* na posição *offset*, mantendo o deslocamento do arquivo inalterado.

source: Return a bytestring containing the bytes read. If the end of the file referred to by *fd* has been reached, an empty bytes object is returned.
pt_br: Retorna uma bytestring contendo os bytes lidos. Se o final do arquivo referido por *fd* for atingido, um objeto de bytes vazio será retornado.

source: Open and return a file descriptor for a master pseudo-terminal device.
pt_br: Abre e retorna um descritor de arquivo para um dispositivo pseudoterminal mestre.

source: Calls the C standard library function :c:func:`posix_openpt`. The *oflag* argument is used to set file status flags and file access modes as specified in the manual page of :c:func:`posix_openpt` of your system.
pt_br: Chama a função :c:func:`posix_openpt` da biblioteca padrão C. O argumento *oflag* é usado para definir sinalizadores de status de arquivo e modos de acesso a arquivos conforme especificado na página de manual da :c:func:`posix_openpt` do seu sistema.

source: The returned file descriptor is :ref:`non-inheritable <fd_inheritance>`. If the value :data:`O_CLOEXEC` is available on the system, it is added to *oflag*.
pt_br: O descritor de arquivo retornado é :ref:`não herdável <fd_inheritance>`. Se o valor :data:`O_CLOEXEC` estiver disponível no sistema, ele é adicionado a *oflag*.

source: Read from a file descriptor *fd* at a position of *offset* into mutable :term:`bytes-like objects <bytes-like object>` *buffers*, leaving the file offset unchanged. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
pt_br: Lê de um descritor de arquivo *fd* na posição de *offset* em *buffers* mutáveis de :term:`objetos bytes ou similares <bytes-like object>`, deixando o deslocamento do arquivo inalterado. Transfere os dados para cada buffer até ficar cheio e depois passa para o próximo buffer na sequência para armazenar o restante dos dados.

source: The flags argument contains a bitwise OR of zero or more of the following flags:
pt_br: O argumento *flags* contém um OR bit a bit de zero ou mais dos seguintes sinalizadores:

source: Return the total number of bytes actually read which can be less than the total capacity of all the objects.
pt_br: Retorna o número total de bytes realmente lidos, que pode ser menor que a capacidade total de todos os objetos.

source: The operating system may set a limit (:func:`sysconf` value ``'SC_IOV_MAX'``) on the number of buffers that can be used.
pt_br: O sistema operacional pode definir um limite (:func:`sysconf` valor ``'SC_IOV_MAX'``) no número de buffers que podem ser usados.

source: Combine the functionality of :func:`os.readv` and :func:`os.pread`.
pt_br: Combina a funcionalidade de :func:`os.readv` e :func:`os.pread`.

source: Using flags requires Linux >= 4.6.
pt_br: O uso de sinalizadores requer Linux >= 4.6.

source: Do not wait for data which is not immediately available. If this flag is specified, the system call will return instantly if it would have to read data from the backing storage or wait for a lock.
pt_br: Não aguarda por dados que não estão disponíveis imediatamente. Se esse sinalizador for especificado, a chamada do sistema retorna instantaneamente se for necessário ler dados do armazenamento de backup ou aguardar uma trava.

source: If some data was successfully read, it will return the number of bytes read. If no bytes were read, it will return ``-1`` and set errno to :const:`errno.EAGAIN`.
pt_br: Se alguns dados foram lidos com sucesso, ele retorna o número de bytes lidos. Se nenhum bytes foi lido, ele retornará ``-1`` e definirá errno como :const:`errno.EAGAIN`.

source: High priority read/write. Allows block-based filesystems to use polling of the device, which provides lower latency, but may use additional resources.
pt_br: Alta prioridade de leitura/gravação. Permite sistemas de arquivos baseados em blocos para usar a consulta do dispositivo, que fornece latência inferior, mas pode usar recursos adicionais.

source: Currently, on Linux, this feature is usable only on a file descriptor opened using the :data:`O_DIRECT` flag.
pt_br: Atualmente, no Linux, esse recurso é usável apenas em um descritor de arquivo aberto usando o sinalizador :data:`O_DIRECT`.

source: Return the name of the slave pseudo-terminal device associated with the master pseudo-terminal device to which the file descriptor *fd* refers. The file descriptor *fd* is not closed upon failure.
pt_br: Retorna o nome do dispositivo pseudoterminal secundário associado ao dispositivo pseudoterminal principal ao qual o descritor de arquivo *fd* se refere. O descritor de arquivo *fd* não é fechado em caso de falha.

source: Calls the reentrant C standard library function :c:func:`ptsname_r` if it is available; otherwise, the C standard library function :c:func:`ptsname`, which is not guaranteed to be thread-safe, is called.
pt_br: Chama a função reentrante :c:func:`ptsname_r` da biblioteca padrão C se estiver disponível; caso contrário, a função :c:func:`ptsname` da biblioteca padrão C, que não é garantida como sendo segura para thread, é chamada.

source: Write the bytestring in *str* to file descriptor *fd* at position of *offset*, leaving the file offset unchanged.
pt_br: Escreve a bytestring in *str* no descritor de arquivo *fd* na posição *offset*, mantendo o deslocamento do arquivo inalterado.

source: Return the number of bytes actually written.
pt_br: Retorna o número de bytes realmente escritos.

source: Write the *buffers* contents to file descriptor *fd* at an offset *offset*, leaving the file offset unchanged. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
pt_br: Escreve o conteúdo de *buffers* no descritor de arquivo *fd* com um deslocamento *offset*, deixando o deslocamento do arquivo inalterado. *buffers* deve ser uma sequência de :term:`objetos bytes ou similares <bytes-like object>`. Os buffers são processados em ordem de vetor. Todo o conteúdo do primeiro buffer é gravado antes de prosseguir para o segundo, e assim por diante.

source: Return the total number of bytes actually written.
pt_br: Retorna o número total de bytes realmente escritos.

source: Combine the functionality of :func:`os.writev` and :func:`os.pwrite`.
pt_br: Combina a funcionalidade de :func:`os.writev` e :func:`os.pwrite`.

source: Provide a per-write equivalent of the :data:`O_DSYNC` :func:`os.open` flag. This flag effect applies only to the data range written by the system call.
pt_br: Fornece um equivalente para gravação do sinalizador :data:`O_DSYNC` da função :func:`os.open`. Este efeito de sinalizador se aplica apenas ao intervalo de dados escrito pela chamada de sistema.

source: Provide a per-write equivalent of the :data:`O_SYNC` :func:`os.open` flag. This flag effect applies only to the data range written by the system call.
pt_br: Fornece um equivalente para gravação do sinalizador :data:`O_SYNC` da função :func:`os.open`. Este efeito de sinalizador se aplica apenas ao intervalo de dados escrito pela chamada de sistema.

source: Provide a per-write equivalent of the :data:`O_APPEND` :func:`os.open` flag. This flag is meaningful only for :func:`os.pwritev`, and its effect applies only to the data range written by the system call. The *offset* argument does not affect the write operation; the data is always appended to the end of the file. However, if the *offset* argument is ``-1``, the current file *offset* is updated.
pt_br: Fornece um equivalente para gravação do sinalizador :data:`O_APPEND` da função :func:`os.open`. Esse sinalizador é significante apenas para :func:`os.pwritev`, e seu efeito se aplica apenas ao intervalo de dados escrito pela chamada de sistema. O argumento *offset* não afeta a operação de escrita; o dado é sempre adicionado ao fim do arquivo. Contudo, se o argumento *offset* for ``-1``, o *offset* do arquivo atual é atualizado.

source: Read at most *n* bytes from file descriptor *fd*.
pt_br: Lê no máximo *n* bytes do descritor de arquivos *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To read a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdin`, use its :meth:`~file.read` or :meth:`~file.readline` methods.
pt_br: Esta função destina-se a E/S de baixo nível e deve ser aplicada a um descritor de arquivo retornado por :func:`os.open` ou :func:`pipe`. Para ler um "objeto arquivo" retornado pela função embutida :func:`open` ou por :func:`popen` ou :func:`fdopen`, ou :data:`sys.stdin`, use seus métodos :meth:`~file.read` ou :meth:`~file.readline`.

source: Read from a file descriptor *fd* into a mutable :ref:`buffer object <bufferobjects>` *buffer*.
pt_br: Lê de um descritor de arquivo *fd* em um :ref:`objeto buffer <bufferobjects>` *buffer* mutável.

source: The *buffer* should be mutable and :term:`bytes-like <bytes-like object>`. On success, returns the number of bytes read. Less bytes may be read than the size of the buffer. The underlying system call will be retried when interrupted by a signal, unless the signal handler raises an exception. Other errors will not be retried and an error will be raised.
pt_br: O *buffer* deve ser mutável e :term:`bytes ou similar <bytes-like object>`. Em caso de sucesso, retorna o número de bytes lidos. Menos bytes podem ser lidos do que o tamanho do buffer. A chamada de sistema subjacente será repetida quando interrompida por um sinal, a menos que o manipulador de sinais levante uma exceção. Outros erros não serão repetidos e um erro será levantado.

source: Returns 0 if *fd* is at end of file or if the provided *buffer* has length 0 (which can be used to check for errors without reading data). Never returns negative.
pt_br: Retorna 0 se *fd* estiver no final do arquivo ou se o *buffer* fornecido tiver comprimento 0 (o que pode ser usado para verificar erros sem ler dados). Nunca retorna negativo.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`os.pipe`. To read a "file object" returned by the built-in function :func:`open`, or :data:`sys.stdin`, use its member functions, for example :meth:`io.BufferedIOBase.readinto`, :meth:`io.BufferedIOBase.read`, or :meth:`io.TextIOBase.read`
pt_br: Esta função destina-se a E/S de baixo nível e deve ser aplicada a um descritor de arquivo retornado por :func:`os.open` ou :func:`os.pipe`. Para ler um "objeto arquivo" retornado pela função embutida :func:`open` ou :data:`sys.stdin`, use suas funções-membro, por exemplo :meth:`io.BufferedIOBase.readinto`, :meth:`io.BufferedIOBase.read` ou :meth:`io.TextIOBase.read`.

source: Copy *count* bytes from file descriptor *in_fd* to file descriptor *out_fd* starting at *offset*. Return the number of bytes sent. When EOF is reached return ``0``.
pt_br: Copia *count* bytes do descritor de arquivo *in_fd* para o descritor de arquivo *out_fd* começando em *offset*. Retorna o número de bytes enviados. Quando o EOF é alcançado, retorna ``0``.

source: The first function notation is supported by all platforms that define :func:`sendfile`.
pt_br: A primeira notação da função está disponível por todas as plataformas que definem :func:`sendfile`.

source: On Linux, if *offset* is given as ``None``, the bytes are read from the current position of *in_fd* and the position of *in_fd* is updated.
pt_br: No Linux, se *offset* for fornecido como ``None``, os bytes são lidos da posição atual de *in_fd* e a posição de *in_fd* é atualizada.

source: The second case may be used on macOS and FreeBSD where *headers* and *trailers* are arbitrary sequences of buffers that are written before and after the data from *in_fd* is written. It returns the same as the first case.
pt_br: O segundo caso pode ser usado no macOS e FreeBSD onde *headers* e *trailers* são sequências arbitrárias de buffers que são escritos antes e depois dos dados de *in_fd* ser escrito. Retorna o mesmo que no primeiro caso.

source: On macOS and FreeBSD, a value of ``0`` for *count* specifies to send until the end of *in_fd* is reached.
pt_br: No macOS e FreeBSD, um valor de ``0`` para *count* especifica enviar até o fim de *in_fd* ser alcançado.

source: All platforms support sockets as *out_fd* file descriptor, and some platforms allow other types (e.g. regular file, pipe) as well.
pt_br: Todas as plataformas tem suporte a soquetes como descritor de arquivo *out_fd*, e algumas plataformas permitem outros tipos (por exemplo, arquivo regular, encadeamento) também.

source: Cross-platform applications should not use *headers*, *trailers* and *flags* arguments.
pt_br: Aplicativos de plataforma cruzada não devem usar os argumentos *headers*, *trailers* e *flags*.

source: For a higher-level wrapper of :func:`sendfile`, see :meth:`socket.socket.sendfile`.
pt_br: Para um invólucro de nível mais alto de :func:`sendfile`, consulte :meth:`socket.socket.sendfile`.

source: Parameters *out* and *in* was renamed to *out_fd* and *in_fd*.
pt_br: Os parâmetros *out* e *in* foram renomeados para *out_fd* e *in_fd*.

source: Parameters to the :func:`sendfile` function, if the implementation supports them.
pt_br: Parâmetros para a função :func:`sendfile`, se a implementação tiver suporte a eles.

source: Parameter to the :func:`sendfile` function, if the implementation supports it. The data won't be cached in the virtual memory and will be freed afterwards.
pt_br: Parâmetro para a função :func:`sendfile`, se a implementação tiver suporte a isso. Os dados não serão armazenados em cache na memória virtual e serão liberados posteriormente.

source: Set the blocking mode of the specified file descriptor. Set the :data:`O_NONBLOCK` flag if blocking is ``False``, clear the flag otherwise.
pt_br: Define o modo de bloqueio do descritor de arquivo especificado. Define o sinalizador :data:`O_NONBLOCK` se blocking for ``False``; do contrário, limpa o sinalizador.

source: See also :func:`get_blocking` and :meth:`socket.socket.setblocking`.
pt_br: Veja também :func:`get_blocking` e :meth:`socket.socket.setblocking`.

source: Transfer *count* bytes from file descriptor *src*, starting from offset *offset_src*, to file descriptor *dst*, starting from offset *offset_dst*.
pt_br: Transfere *count* bytes do descritor de arquivo *src*, começando no deslocamento *offset_src*, para o descritor de arquivo *dst*, começando no deslocamento *offset_dst*.

source: The splicing behaviour can be modified by specifying a *flags* value. Any of the following variables may used, combined using bitwise OR (the ``|`` operator):
pt_br: O comportamento da união via splice pode ser modificado especificando um valor para *flags*. Qualquer um dos seguintes valores pode ser usado, combinados usando OU (OR) bit a bit (o operador ``|``):

source: If :const:`SPLICE_F_MOVE` is specified, the kernel is asked to move pages instead of copying, but pages may still be copied if the kernel cannot move the pages from the pipe.
pt_br: Se :const:`SPLICE_F_MOVE` for especificado, o kernel será solicitado a mover páginas em vez de copiá-las, mas as páginas ainda poderão ser copiadas se o kernel não puder movê-las do encadeamento.

source: If :const:`SPLICE_F_NONBLOCK` is specified, the kernel is asked to not block on I/O. This makes the splice pipe operations nonblocking, but splice may nevertheless block because the spliced file descriptors may block.
pt_br: Se :const:`SPLICE_F_NONBLOCK` for especificado, o kernel será solicitado a não bloquear em E/S. Isso torna as operações de encadeamento de emenda não bloqueantes, mas a emenda pode, ainda assim, bloquear, pois os descritores de arquivo emendados podem bloquear.

source: If :const:`SPLICE_F_MORE` is specified, it hints to the kernel that more data will be coming in a subsequent splice.
pt_br: Se :const:`SPLICE_F_MORE` for especificado, ele indica ao kernel que mais dados chegarão em uma emenda subsequente.

source: At least one of the file descriptors must refer to a pipe. If *offset_src* is ``None``, then *src* is read from the current position; respectively for *offset_dst*. The offset associated to the file descriptor that refers to a pipe must be ``None``. The files pointed to by *src* and *dst* must reside in the same filesystem, otherwise an :exc:`OSError` is raised with :attr:`~OSError.errno` set to :const:`errno.EXDEV`.
pt_br: Pelo menos um dos descritores de arquivo deve se referir a um encadeamento. Se *offset_src* é ``None``, então *src* é lido a partir da posição atual; o mesmo para *offset_dst*. O deslocamento associado a um descritor de arquivo que se refere a um encadeamento deve ser ``None``. Os arquivos apontados por *src* e *dst* devem residir no mesmo sistema de arquivos, de outra forma uma :exc:`OSError` é levantada com :attr:`~OSError.errno` definido para :const:`errno.EXDEV`.

source: This copy is done without the additional cost of transferring data from the kernel to user space and then back into the kernel. Additionally, some filesystems could implement extra optimizations. The copy is done as if both files are opened as binary.
pt_br: Essa cópia é feita sem o custo adicional de transferência de dados do kernel para o espaço do usuário e, em seguida, volta para o kernel. Além disso, alguns sistemas de arquivos poderiam implementar otimizações extras. A cópia é feita como se ambos os arquivos estivessem abertos como binários.

source: Upon successful completion, returns the number of bytes spliced to or from the pipe. A return value of 0 means end of input. If *src* refers to a pipe, then this means that there was no data to transfer, and it would not make sense to block because there are no writers connected to the write end of the pipe.
pt_br: Após a conclusão bem-sucedida, retorna o número de bytes unidos ao encadeamento ou a partir dele. Um valor de retorno de 0 significa o fim da entrada. Se *src* se refere a um encadeamento, isso significa que não havia dados para transferir, e não faria sentido bloquear porque não há escritores conectados ao fim da escrita do encadeamento.

source: The :manpage:`splice(2)` man page.
pt_br: A página man :manpage:`splice(2)`.
