Repository: python/python-docs-pt-br
Catalog: library/ossaudiodev.po
Languages: pt_br

source: :mod:`ossaudiodev` --- Access to OSS-compatible audio devices
pt_br: :mod:`ossaudiodev` --- Доступ до OSS-сумісних аудіопристроїв

source: The :mod:`ossaudiodev` module is deprecated (see :pep:`PEP 594 <594#ossaudiodev>` for details).
pt_br: Модуль :mod:`ossaudiodev` застарів (докладніше див. :pep:`PEP 594 <594#ossaudiodev>`).

source: This module allows you to access the OSS (Open Sound System) audio interface. OSS is available for a wide range of open-source and commercial Unices, and is the standard audio interface for Linux and recent versions of FreeBSD.
pt_br: Цей модуль дозволяє отримати доступ до аудіоінтерфейсу OSS (Open Sound System). OSS доступний для широкого діапазону відкритих і комерційних Unices і є стандартним аудіоінтерфейсом для Linux і останніх версій FreeBSD.

source: Operations in this module now raise :exc:`OSError` where :exc:`IOError` was raised.
pt_br: As operações neste módulo agora levantam :exc:`OSError` onde :exc:`IOError` foi levantado.

source: `Open Sound System Programmer's Guide <http://www.opensound.com/pguide/oss.pdf>`_
pt_br: `Відкрити Посібник програміста звукової системи <http://www.opensound.com/pguide/oss.pdf>`_

source: the official documentation for the OSS C API
pt_br: офіційна документація для OSS C API

source: The module defines a large number of constants supplied by the OSS device driver; see ``<sys/soundcard.h>`` on either Linux or FreeBSD for a listing.
pt_br: Модуль визначає велику кількість констант, що надаються драйвером пристрою OSS; перегляньте ``<sys/soundcard.h>`` для Linux або FreeBSD для списку.

source: :mod:`ossaudiodev` defines the following variables and functions:
pt_br: :mod:`ossaudiodev` визначає наступні змінні та функції:

source: This exception is raised on certain errors. The argument is a string describing what went wrong.
pt_br: Цей виняток виникає при певних помилках. Аргумент — це рядок, що описує, що пішло не так.

source: (If :mod:`ossaudiodev` receives an error from a system call such as :c:func:`open`, :c:func:`write`, or :c:func:`ioctl`, it raises :exc:`OSError`. Errors detected directly by :mod:`ossaudiodev` result in :exc:`OSSAudioError`.)
pt_br: (Якщо :mod:`ossaudiodev` отримує помилку від системного виклику, наприклад :c:func:`open`, :c:func:`write` або :c:func:`ioctl`, він викликає :exc:`OSError`. Помилки, виявлені безпосередньо :mod:`ossaudiodev`, призводять до :exc:`OSSAudioError`.)

source: (For backwards compatibility, the exception class is also available as ``ossaudiodev.error``.)
pt_br: (Для зворотної сумісності клас винятків також доступний як ``ossaudiodev.error``.)

source: Open an audio device and return an OSS audio device object. This object supports many file-like methods, such as :meth:`read`, :meth:`write`, and :meth:`fileno` (although there are subtle differences between conventional Unix read/write semantics and those of OSS audio devices). It also supports a number of audio-specific methods; see below for the complete list of methods.
pt_br: Відкрийте аудіопристрій і поверніть об’єкт аудіопристрою OSS. Цей об’єкт підтримує багато файлових методів, таких як :meth:`read`, :meth:`write` і :meth:`fileno` (хоча існують тонкі відмінності між звичайною семантикою читання/запису Unix і аудіо OSS). пристрої). Він також підтримує ряд специфічних аудіо методів; повний список методів див. нижче.

source: *device* is the audio device filename to use. If it is not specified, this module first looks in the environment variable :envvar:`AUDIODEV` for a device to use. If not found, it falls back to :file:`/dev/dsp`.
pt_br: *device* — це назва файлу аудіопристрою для використання. Якщо його не вказано, цей модуль спочатку шукає в змінній середовища :envvar:`AUDIODEV` пристрій для використання. Якщо не знайдено, він повертається до :file:`/dev/dsp`.

source: *mode* is one of ``'r'`` for read-only (record) access, ``'w'`` for write-only (playback) access and ``'rw'`` for both. Since many sound cards only allow one process to have the recorder or player open at a time, it is a good idea to open the device only for the activity needed. Further, some sound cards are half-duplex: they can be opened for reading or writing, but not both at once.
pt_br: *mode* є одним із ``'r'`` для доступу лише для читання (запис), ``'w''`` для доступу лише для запису (відтворення) та ``'rw'`` для обох. Оскільки багато звукових карт дозволяють лише одному процесу одночасно відкривати рекордер або програвач, доцільно відкривати пристрій лише для необхідної діяльності. Крім того, деякі звукові карти є напівдуплексними: їх можна відкрити для читання або запису, але не для обох одночасно.

source: Note the unusual calling syntax: the *first* argument is optional, and the second is required. This is a historical artifact for compatibility with the older :mod:`linuxaudiodev` module which :mod:`ossaudiodev` supersedes.
pt_br: Зверніть увагу на незвичний синтаксис виклику: *перший* аргумент необов’язковий, а другий обов’язковий. Це історичний артефакт для сумісності зі старішим модулем :mod:`linuxaudiodev`, який :mod:`ossaudiodev` замінює.

source: Open a mixer device and return an OSS mixer device object. *device* is the mixer device filename to use. If it is not specified, this module first looks in the environment variable :envvar:`MIXERDEV` for a device to use. If not found, it falls back to :file:`/dev/mixer`.
pt_br: Відкрийте мікшерний пристрій і поверніть об’єкт мікшерного пристрою OSS. *device* — це ім’я файлу пристрою мікшера для використання. Якщо його не вказано, цей модуль спочатку шукає в змінній середовища :envvar:`MIXERDEV` пристрій для використання. Якщо не знайдено, він повертається до :file:`/dev/mixer`.

source: Audio Device Objects
pt_br: Об’єкти звукових пристроїв

source: Before you can write to or read from an audio device, you must call three methods in the correct order:
pt_br: Перш ніж ви зможете записувати або читати з аудіопристрою, ви повинні викликати три методи в правильному порядку:

source: :meth:`setfmt` to set the output format
pt_br: :meth:`setfmt`, щоб встановити вихідний формат

source: :meth:`channels` to set the number of channels
pt_br: :meth:`channels`, щоб встановити кількість каналів

source: :meth:`speed` to set the sample rate
pt_br: :meth:`speed`, щоб встановити частоту дискретизації

source: Alternately, you can use the :meth:`setparameters` method to set all three audio parameters at once. This is more convenient, but may not be as flexible in all cases.
pt_br: Крім того, ви можете використовувати метод :meth:`setparameters`, щоб установити всі три параметри звуку одночасно. Це зручніше, але може бути не таким гнучким у всіх випадках.

source: The audio device objects returned by :func:`.open` define the following methods and (read-only) attributes:
pt_br: Об’єкти аудіопристроїв, які повертає :func:`.open`, визначають наступні методи та атрибути (лише для читання):

source: Explicitly close the audio device. When you are done writing to or reading from an audio device, you should explicitly close it. A closed device cannot be used again.
pt_br: Явно закрийте аудіопристрій. Коли ви закінчите писати або читати з аудіопристрою, вам слід явно закрити його. Закритий пристрій не можна використовувати повторно.

source: Return the file descriptor associated with the device.
pt_br: Повертає дескриптор файлу, пов’язаний із пристроєм.

source: Read *size* bytes from the audio input and return them as a Python string. Unlike most Unix device drivers, OSS audio devices in blocking mode (the default) will block :func:`read` until the entire requested amount of data is available.
pt_br: Зчитувати *size* байти з аудіовходу та повертати їх як рядок Python. На відміну від більшості драйверів пристроїв Unix, аудіопристрої OSS у режимі блокування (за замовчуванням) блокуватимуть :func:`read`, доки не буде доступним весь запитаний обсяг даних.

source: Write a :term:`bytes-like object` *data* to the audio device and return the number of bytes written. If the audio device is in blocking mode (the default), the entire data is always written (again, this is different from usual Unix device semantics). If the device is in non-blocking mode, some data may not be written---see :meth:`writeall`.
pt_br: Записати :term:`bytes-like object` *data* на аудіопристрій і повернути кількість записаних байтів. Якщо аудіопристрій знаходиться в режимі блокування (за замовчуванням), усі дані завжди записуються (знову ж таки, це відрізняється від звичайної семантики пристрою Unix). Якщо пристрій у неблокуючому режимі, деякі дані можуть не записуватися --- див. :meth:`writeall`.

source: Writable :term:`bytes-like object` is now accepted.
pt_br: Записуваний :term:`bytes-like object` тепер приймається.

source: Write a :term:`bytes-like object` *data* to the audio device: waits until the audio device is able to accept data, writes as much data as it will accept, and repeats until *data* has been completely written. If the device is in blocking mode (the default), this has the same effect as :meth:`write`; :meth:`writeall` is only useful in non-blocking mode. Has no return value, since the amount of data written is always equal to the amount of data supplied.
pt_br: Записати :term:`bytes-like object` *data* в аудіопристрій: чекає, доки аудіопристрій зможе прийняти дані, записує стільки даних, скільки прийме, і повторює, доки *data* не буде повністю записано. Якщо пристрій перебуває в режимі блокування (за замовчуванням), це має той самий ефект, що й :meth:`write`; :meth:`writeall` корисний лише в неблокуючому режимі. Не має значення, що повертається, оскільки кількість записаних даних завжди дорівнює кількості наданих даних.

source: Audio device objects also support the context management protocol, i.e. they can be used in a :keyword:`with` statement.
pt_br: Об’єкти аудіопристроїв також підтримують протокол керування контекстом, тобто їх можна використовувати в операторі :keyword:`with`.

source: The following methods each map to exactly one :c:func:`ioctl` system call. The correspondence is obvious: for example, :meth:`setfmt` corresponds to the ``SNDCTL_DSP_SETFMT`` ioctl, and :meth:`sync` to ``SNDCTL_DSP_SYNC`` (this can be useful when consulting the OSS documentation). If the underlying :c:func:`ioctl` fails, they all raise :exc:`OSError`.
pt_br: Кожен із наведених нижче методів відображає точно один системний виклик :c:func:`ioctl`. Відповідність очевидна: наприклад, :meth:`setfmt` відповідає ioctl ``SNDCTL_DSP_SETFMT``, а :meth:`sync` — ``SNDCTL_DSP_SYNC`` (це може бути корисно під час перегляду документації OSS). Якщо основний :c:func:`ioctl` виходить з ладу, усі вони викликають :exc:`OSError`.

source: Put the device into non-blocking mode. Once in non-blocking mode, there is no way to return it to blocking mode.
pt_br: Переведіть пристрій у режим без блокування. Перейшовши в режим без блокування, неможливо повернутися до режиму блокування.

source: Return a bitmask of the audio output formats supported by the soundcard. Some of the formats supported by OSS are:
pt_br: Повертає бітову маску форматів аудіовиводу, які підтримує звукова карта. Деякі з форматів, які підтримує OSS:

source: Format
pt_br: Formatação

source: Description
pt_br: Descrição

source: a logarithmic encoding (used by Sun ``.au`` files and :file:`/dev/audio`)
pt_br: логарифмічне кодування (використовується файлами Sun ``.au`` і :file:`/dev/audio`)

source: a logarithmic encoding
pt_br: логарифмічне кодування

source: a 4:1 compressed format defined by the Interactive Multimedia Association
pt_br: стислий формат 4:1, визначений Interactive Multimedia Association

source: Unsigned, 8-bit audio
pt_br: Беззнаковий, 8-бітовий звук

source: Signed, 16-bit audio, little-endian byte order (as used by Intel processors)
pt_br: 16-бітовий звук зі знаком, порядок байтів у порядку байтів (як використовується процесорами Intel)

source: Signed, 16-bit audio, big-endian byte order (as used by 68k, PowerPC, Sparc)
pt_br: Знакове, 16-бітне аудіо, порядок байтів у порядку байтів (як використовується 68k, PowerPC, Sparc)

source: Signed, 8 bit audio
pt_br: Підписаний, 8-бітний звук

source: Unsigned, 16-bit little-endian audio
pt_br: Беззнакове 16-бітове аудіо з порядковим порядком байтів

source: Unsigned, 16-bit big-endian audio
pt_br: Беззнакове 16-бітове аудіо в порядку старшого порядку

source: Consult the OSS documentation for a full list of audio formats, and note that most devices support only a subset of these formats. Some older devices only support :const:`AFMT_U8`; the most common format used today is :const:`AFMT_S16_LE`.
pt_br: Зверніться до документації OSS, щоб отримати повний список аудіоформатів, і зауважте, що більшість пристроїв підтримують лише частину цих форматів. Деякі старі пристрої підтримують лише :const:`AFMT_U8`; найпоширенішим форматом, який сьогодні використовується, є :const:`AFMT_S16_LE`.

source: Try to set the current audio format to *format*---see :meth:`getfmts` for a list. Returns the audio format that the device was set to, which may not be the requested format. May also be used to return the current audio format---do this by passing an "audio format" of :const:`AFMT_QUERY`.
pt_br: Спробуйте встановити поточний аудіоформат на *format*---перегляньте список :meth:`getfmts`. Повертає аудіоформат, налаштований на пристрої, який може не відповідати запитуваному формату. Може також використовуватися для повернення поточного аудіоформату ---зробіть це, передавши "аудіоформат" :const:`AFMT_QUERY`.

source: Set the number of output channels to *nchannels*. A value of 1 indicates monophonic sound, 2 stereophonic. Some devices may have more than 2 channels, and some high-end devices may not support mono. Returns the number of channels the device was set to.
pt_br: Встановіть кількість вихідних каналів на *nchannels*. Значення 1 означає монофонічний звук, 2 — стереофонічний. Деякі пристрої можуть мати більше 2 каналів, а деякі пристрої високого класу можуть не підтримувати моно. Повертає кількість каналів, налаштованих на пристрої.

source: Try to set the audio sampling rate to *samplerate* samples per second. Returns the rate actually set. Most sound devices don't support arbitrary sampling rates. Common rates are:
pt_br: Спробуйте встановити частоту дискретизації аудіо на *samplerate* вибірок за секунду. Повертає фактично встановлену ставку. Більшість звукових пристроїв не підтримують довільну частоту дискретизації. Загальні ставки:

source: default rate for :file:`/dev/audio`
pt_br: швидкість за замовчуванням для :file:`/dev/audio`

source: speech recording
pt_br: запис мовлення

source: CD quality audio (at 16 bits/sample and 2 channels)
pt_br: Аудіо якості CD (16 біт/вибірка та 2 канали)

source: DVD quality audio (at 24 bits/sample)
pt_br: Аудіо якості DVD (24 біти/вибірка)

source: Wait until the sound device has played every byte in its buffer. (This happens implicitly when the device is closed.) The OSS documentation recommends closing and re-opening the device rather than using :meth:`sync`.
pt_br: Зачекайте, доки звуковий пристрій відтворить кожен байт у своєму буфері. (Це відбувається неявно, коли пристрій закрито.) Документація OSS рекомендує закрити та знову відкрити пристрій замість використання :meth:`sync`.

source: Immediately stop playing or recording and return the device to a state where it can accept commands. The OSS documentation recommends closing and re-opening the device after calling :meth:`reset`.
pt_br: Негайно припиніть відтворення або запис і поверніть пристрій у стан, коли він може приймати команди. Документація OSS рекомендує закрити та знову відкрити пристрій після виклику :meth:`reset`.

source: Tell the driver that there is likely to be a pause in the output, making it possible for the device to handle the pause more intelligently. You might use this after playing a spot sound effect, before waiting for user input, or before doing disk I/O.
pt_br: Повідомте водієві, що, ймовірно, буде пауза у виводі, щоб пристрій міг більш розумно обробляти паузу. Ви можете використовувати це після відтворення точкового звукового ефекту, перед очікуванням введення користувача або перед виконанням дискового вводу-виводу.

source: The following convenience methods combine several ioctls, or one ioctl and some simple calculations.
pt_br: Наступні зручні методи поєднують кілька ioctl або один ioctl і деякі прості обчислення.

source: Set the key audio sampling parameters---sample format, number of channels, and sampling rate---in one method call. *format*, *nchannels*, and *samplerate* should be as specified in the :meth:`setfmt`, :meth:`channels`, and :meth:`speed` methods. If *strict* is true, :meth:`setparameters` checks to see if each parameter was actually set to the requested value, and raises :exc:`OSSAudioError` if not. Returns a tuple (*format*, *nchannels*, *samplerate*) indicating the parameter values that were actually set by the device driver (i.e., the same as the return values of :meth:`setfmt`, :meth:`channels`, and :meth:`speed`).
pt_br: Встановіть ключові параметри дискретизації звуку --- формат дискретизації, кількість каналів і частоту дискретизації --- одним викликом методу. *format*, *nchannels* і *samplerate* мають бути такими, як указано в методах :meth:`setfmt`, :meth:`channels` і :meth:`speed`. Якщо *strict* має значення true, :meth:`setparameters` перевіряє, чи дійсно для кожного параметра встановлено запитане значення, і викликає :exc:`OSSAudioError`, якщо ні. Повертає кортеж (*format*, *nchannels*, *samplerate*), що вказує на значення параметрів, фактично встановлені драйвером пристрою (тобто такі самі, як значення, що повертаються :meth:`setfmt`, :meth:`channels` і :meth:`speed`).

source: For example, ::
pt_br: Наприклад, ::

source: is equivalent to ::
pt_br: еквівалентно ::

source: Returns the size of the hardware buffer, in samples.
pt_br: Повертає розмір апаратного буфера у зразках.

source: Returns the number of samples that are in the hardware buffer yet to be played.
pt_br: Повертає кількість семплів, які ще не відтворені в апаратному буфері.

source: Returns the number of samples that could be queued into the hardware buffer to be played without blocking.
pt_br: Повертає кількість семплів, які можна поставити в чергу в апаратний буфер для відтворення без блокування.

source: Audio device objects also support several read-only attributes:
pt_br: Об’єкти аудіопристроїв також підтримують кілька атрибутів лише для читання:

source: Boolean indicating whether the device has been closed.
pt_br: Логічне значення, яке вказує, чи було закрито пристрій.

source: String containing the name of the device file.
pt_br: Рядок, що містить назву файлу пристрою.

source: The I/O mode for the file, either ``"r"``, ``"rw"``, or ``"w"``.
pt_br: Режим вводу/виводу для файлу: ``"r"``, ``"rw"`` або ``"w"``.

source: Mixer Device Objects
pt_br: Об'єкти мікшерного пристрою

source: The mixer object provides two file-like methods:
pt_br: Об’єкт mixer надає два файлоподібні методи:

source: This method closes the open mixer device file. Any further attempts to use the mixer after this file is closed will raise an :exc:`OSError`.
pt_br: Цей метод закриває відкритий файл пристрою мікшера. Будь-які подальші спроби використання мікшера після закриття цього файлу викличуть :exc:`OSError`.

source: Returns the file handle number of the open mixer device file.
pt_br: Повертає номер дескриптора файлу відкритого файлу мікшерного пристрою.

source: Mixer objects also support the context management protocol.
pt_br: Об'єкти Mixer також підтримують протокол керування контекстом.

source: The remaining methods are specific to audio mixing:
pt_br: Решта методів є специфічними для мікшування звуку:

source: This method returns a bitmask specifying the available mixer controls ("Control" being a specific mixable "channel", such as :const:`SOUND_MIXER_PCM` or :const:`SOUND_MIXER_SYNTH`). This bitmask indicates a subset of all available mixer controls---the :const:`SOUND_MIXER_\*` constants defined at module level. To determine if, for example, the current mixer object supports a PCM mixer, use the following Python code::
pt_br: Цей метод повертає бітову маску, що визначає доступні елементи керування мікшером ("Контроль" — це певний "канал", який можна змішувати, наприклад :const:`SOUND_MIXER_PCM` або :const:`SOUND_MIXER_SYNTH`). Ця бітова маска вказує на підмножину всіх доступних елементів керування мікшером ---константи :const:`SOUND_MIXER_\*`, визначені на рівні модуля. Щоб визначити, наприклад, чи підтримує поточний об’єкт мікшера мікшер PCM, використовуйте такий код Python::

source: For most purposes, the :const:`SOUND_MIXER_VOLUME` (master volume) and :const:`SOUND_MIXER_PCM` controls should suffice---but code that uses the mixer should be flexible when it comes to choosing mixer controls. On the Gravis Ultrasound, for example, :const:`SOUND_MIXER_VOLUME` does not exist.
pt_br: Для більшості цілей має бути достатньо елементів керування :const:`SOUND_MIXER_VOLUME` (основна гучність) і :const:`SOUND_MIXER_PCM` --- але код, який використовує мікшер, має бути гнучким, коли справа доходить до вибору елементів керування мікшером. На Gravis Ultrasound, наприклад, :const:`SOUND_MIXER_VOLUME` не існує.

source: Returns a bitmask indicating stereo mixer controls. If a bit is set, the corresponding control is stereo; if it is unset, the control is either monophonic or not supported by the mixer (use in combination with :meth:`controls` to determine which).
pt_br: Повертає бітову маску, яка вказує на елементи керування стереомікшером. Якщо встановлено біт, відповідний елемент керування є стерео; якщо його не встановлено, елемент керування або монофонічний, або не підтримується мікшером (використовуйте в поєднанні з :meth:`controls`, щоб визначити, який).

source: See the code example for the :meth:`controls` function for an example of getting data from a bitmask.
pt_br: Перегляньте приклад коду для функції :meth:`controls` для прикладу отримання даних із бітової маски.

source: Returns a bitmask specifying the mixer controls that may be used to record. See the code example for :meth:`controls` for an example of reading from a bitmask.
pt_br: Повертає бітову маску, що визначає елементи керування мікшером, які можна використовувати для запису. Перегляньте приклад коду для :meth:`controls` для прикладу читання з бітової маски.

source: Returns the volume of a given mixer control. The returned volume is a 2-tuple ``(left_volume,right_volume)``. Volumes are specified as numbers from 0 (silent) to 100 (full volume). If the control is monophonic, a 2-tuple is still returned, but both volumes are the same.
pt_br: Повертає гучність даного регулятора мікшера. Повернутий том – це 2-кортеж ``(left_volume,right_volume)``. Обсяги вказуються числами від 0 (тиха) до 100 (повна гучність). Якщо елемент керування монофонічний, 2-кортеж все одно повертається, але обидва об’єми однакові.

source: Raises :exc:`OSSAudioError` if an invalid control is specified, or :exc:`OSError` if an unsupported control is specified.
pt_br: Викликає :exc:`OSSAudioError`, якщо вказано недійсний елемент керування, або :exc:`OSError`, якщо вказано непідтримуваний елемент керування.
