Repository: python/python-docs-pt-br
Catalog: library/ossaudiodev.po
Languages: pt_br

source: Sets the volume for a given mixer control to ``(left,right)``. ``left`` and ``right`` must be ints and between 0 (silent) and 100 (full volume). On success, the new volume is returned as a 2-tuple. Note that this may not be exactly the same as the volume specified, because of the limited resolution of some soundcard's mixers.
pt_br: Встановлює гучність для даного регулятора мікшера на ``(ліворуч,праворуч)``. ``left`` і ``right`` мають мати цілі значення та бути в межах від 0 (без звуку) до 100 (повна гучність). У разі успіху новий том повертається як 2-кортеж. Зауважте, що це може не збігатися з указаною гучністю через обмежену роздільну здатність деяких мікшерів звукової карти.

source: Raises :exc:`OSSAudioError` if an invalid mixer control was specified, or if the specified volumes were out-of-range.
pt_br: Викликає :exc:`OSSAudioError`, якщо було вказано недійсний елемент керування мікшером або якщо вказані гучності вийшли за межі діапазону.

source: This method returns a bitmask indicating which control(s) are currently being used as a recording source.
pt_br: Цей метод повертає бітову маску, яка вказує на те, який(-і) елемент(и) наразі використовується як джерело запису.

source: Call this function to specify a recording source. Returns a bitmask indicating the new recording source (or sources) if successful; raises :exc:`OSError` if an invalid source was specified. To set the current recording source to the microphone input::
pt_br: Викличте цю функцію, щоб вказати джерело запису. Повертає бітову маску, що вказує на нове джерело (або джерела) запису в разі успіху; викликає :exc:`OSError`, якщо вказано недійсне джерело. Щоб встановити поточне джерело запису на вхід мікрофона:
