Repository: python/python-docs-pt-br
Catalog: library/pickle.po
Languages: pt_br

source: Here's an example that shows how to modify pickling behavior for a class. The :class:`!TextReader` class below opens a text file, and returns the line number and line contents each time its :meth:`!readline` method is called. If a :class:`!TextReader` instance is pickled, all attributes *except* the file object member are saved. When the instance is unpickled, the file is reopened, and reading resumes from the last location. The :meth:`!__setstate__` and :meth:`!__getstate__` methods are used to implement this behavior. ::
pt_br: Aqui está um exemplo que mostra como modificar o comportamento de serialização com pickle de uma classe. A classe :class:`!TextReader` abaixo abre um arquivo texto e retorna o número da linha e o conteúdo da linha cada vez que seu método :meth:`!readline` é chamado. Se uma instância de :class:`!TextReader` for selecionada, todos os atributos *exceto* o membro do objeto arquivo são salvos. Quando a instância é removida, o arquivo é reaberto e a leitura continua a partir do último local. Os métodos :meth:`!__setstate__` e :meth:`!__getstate__` são usados para implementar este comportamento. ::

source: class TextReader: """Print and number lines in a text file.""" def __init__(self, filename): self.filename = filename self.file = open(filename) self.lineno = 0 def readline(self): self.lineno += 1 line = self.file.readline() if not line: return None if line.endswith('\n'): line = line[:-1] return "%i: %s" % (self.lineno, line) def __getstate__(self): # Copy the object's state from self.__dict__ which contains # all our instance attributes. Always use the dict.copy() # method to avoid modifying the original state. state = self.__dict__.copy() # Remove the unpicklable entries. del state['file'] return state def __setstate__(self, state): # Restore instance attributes (i.e., filename and lineno). self.__dict__.update(state) # Restore the previously opened file's state. To do so, we need to # reopen it and read from it until the line count is restored. file = open(self.filename) for _ in range(self.lineno): file.readline() # Finally, save the file. self.file = file
pt_br: class TextReader: """Exibe e numera linhas em um arquivo texto.""" def __init__(self, filename): self.filename = filename self.file = open(filename) self.lineno = 0 def readline(self): self.lineno += 1 line = self.file.readline() if not line: return None if line.endswith('\n'): line = line[:-1] return "%i: %s" % (self.lineno, line) def __getstate__(self): # Copia o estado do objeto de self.__dict__, que # contém todos os nossos atributos de instância. # Sempre use o método dict.copy() para evitar # modificar o estado original. state = self.__dict__.copy() # Remove as entradas não serializáveis com pickle. del state['file'] return state def __setstate__(self, state): # Restaura os atributos da instância (isto é, filename e lineno). self.__dict__.update(state) # Restaura o estado do arquivo aberto anteriormente. # Para fazer isso, precisamos reabri-lo e ler dele até # a contagem de linha ser restaurada. file = open(self.filename) for _ in range(self.lineno): file.readline() # Ao final, salva o arquivo. self.file = file

source: A sample usage might be something like this::
pt_br: Um exemplo de uso pode ser algo assim::

source: Custom Reduction for Types, Functions, and Other Objects
pt_br: Redução personalizada para tipos, funções e outros objetos

source: Sometimes, :attr:`~Pickler.dispatch_table` may not be flexible enough. In particular we may want to customize pickling based on another criterion than the object's type, or we may want to customize the pickling of functions and classes.
pt_br: Às vezes, :attr:`~Pickler.dispatch_table` pode não ser flexível o suficiente. Em particular, podemos querer personalizar a serialização com pickle com base em outro critério que não o tipo do objeto, ou podemos personalizar a serialização com pickle de funções e classes.

source: For those cases, it is possible to subclass from the :class:`Pickler` class and implement a :meth:`~Pickler.reducer_override` method. This method can return an arbitrary reduction tuple (see :meth:`~object.__reduce__`). It can alternatively return :data:`NotImplemented` to fallback to the traditional behavior.
pt_br: Para esses casos, é possível criar uma subclasse da classe :class:`Pickler` e implementar um método :meth:`~Pickler.reducer_override`. Este método pode retornar uma tupla de redução arbitrária (veja :meth:`~object.__reduce__`). Ele pode, alternativamente, retornar :data:`NotImplemented` para retornar ao comportamento tradicional.

source: If both the :attr:`~Pickler.dispatch_table` and :meth:`~Pickler.reducer_override` are defined, then :meth:`~Pickler.reducer_override` method takes priority.
pt_br: Se :attr:`~Pickler.dispatch_table` e :meth:`~Pickler.reducer_override` forem definidos, o método :meth:`~Pickler.reducer_override` tem prioridade.

source: For performance reasons, :meth:`~Pickler.reducer_override` may not be called for the following objects: ``None``, ``True``, ``False``, and exact instances of :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` and :class:`tuple`.
pt_br: Por motivos de desempenho, :meth:`~Pickler.reducer_override` não pode ser chamado para os seguintes objetos: ``None``, ``True``, ``False``, e as instâncias exatas de :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` e :class:`tuple`.

source: Here is a simple example where we allow pickling and reconstructing a given class::
pt_br: Aqui está um exemplo simples onde permitimos serialização com pickle e reconstrução de uma determinada classe:

source: import io import pickle class MyClass: my_attribute = 1 class MyPickler(pickle.Pickler): def reducer_override(self, obj): """Custom reducer for MyClass.""" if getattr(obj, "__name__", None) == "MyClass": return type, (obj.__name__, obj.__bases__, {'my_attribute': obj.my_attribute}) else: # For any other object, fallback to usual reduction return NotImplemented f = io.BytesIO() p = MyPickler(f) p.dump(MyClass) del MyClass unpickled_class = pickle.loads(f.getvalue()) assert isinstance(unpickled_class, type) assert unpickled_class.__name__ == "MyClass" assert unpickled_class.my_attribute == 1
pt_br: import io import pickle class MyClass: my_attribute = 1 class MyPickler(pickle.Pickler): def reducer_override(self, obj): """Redutor personalizado para MyClass.""" if getattr(obj, "__name__", None) == "MyClass": return type, (obj.__name__, obj.__bases__, {'my_attribute': obj.my_attribute}) else: # Para qualquer outro objeto, recorre à redução de costume return NotImplemented f = io.BytesIO() p = MyPickler(f) p.dump(MyClass) del MyClass unpickled_class = pickle.loads(f.getvalue()) assert isinstance(unpickled_class, type) assert unpickled_class.__name__ == "MyClass" assert unpickled_class.my_attribute == 1

source: Out-of-band Buffers
pt_br: Buffers fora da banda

source: In some contexts, the :mod:`pickle` module is used to transfer massive amounts of data. Therefore, it can be important to minimize the number of memory copies, to preserve performance and resource consumption. However, normal operation of the :mod:`pickle` module, as it transforms a graph-like structure of objects into a sequential stream of bytes, intrinsically involves copying data to and from the pickle stream.
pt_br: Em alguns contextos, o módulo :mod:`pickle` é usado para transferir grandes quantidades de dados. Portanto, pode ser importante minimizar o número de cópias de memória para preservar o desempenho e o consumo de recursos. No entanto, a operação normal do módulo :mod:`pickle`, à medida que transforma uma estrutura semelhante a um gráfico de objetos em um fluxo sequencial de bytes, envolve intrinsecamente a cópia de dados de e para o fluxo pickle.

source: This constraint can be eschewed if both the *provider* (the implementation of the object types to be transferred) and the *consumer* (the implementation of the communications system) support the out-of-band transfer facilities provided by pickle protocol 5 and higher.
pt_br: Esta restrição pode ser evitada se tanto o *fornecedor* (a implementação dos tipos de objetos a serem transferidos) e o *consumidor* (a implementação do sistema de comunicações) tiverem suporte aos recursos de transferência fora de banda fornecidos pelo protocolo pickle 5 e superior.

source: Provider API
pt_br: API de provedor

source: The large data objects to be pickled must implement a :meth:`~object.__reduce_ex__` method specialized for protocol 5 and higher, which returns a :class:`PickleBuffer` instance (instead of e.g. a :class:`bytes` object) for any large data.
pt_br: Os grandes objetos de dados a serem serializados com pickle devem implementar um método :meth:`~object.__reduce_ex__` especializado para o protocolo 5 e superior, que retorna uma instância :class:`PickleBuffer` (em vez de, por exemplo, um objeto :class:`bytes`) para quaisquer dados grandes.

source: A :class:`PickleBuffer` object *signals* that the underlying buffer is eligible for out-of-band data transfer. Those objects remain compatible with normal usage of the :mod:`pickle` module. However, consumers can also opt-in to tell :mod:`pickle` that they will handle those buffers by themselves.
pt_br: Um objeto :class:`PickleBuffer` *sinaliza* que o buffer subjacente é elegível para transferência de dados fora de banda. Esses objetos permanecem compatíveis com o uso normal do módulo :mod:`pickle`. No entanto, os consumidores também podem optar por dizer ao :mod:`pickle` que eles irão lidar com esses buffers por conta própria.

source: Consumer API
pt_br: API de consumidor

source: A communications system can enable custom handling of the :class:`PickleBuffer` objects generated when serializing an object graph.
pt_br: Um sistema de comunicação pode permitir o manuseio personalizado dos objetos :class:`PickleBuffer` gerados ao serializar um grafo de objeto.

source: On the sending side, it needs to pass a *buffer_callback* argument to :class:`Pickler` (or to the :func:`dump` or :func:`dumps` function), which will be called with each :class:`PickleBuffer` generated while pickling the object graph. Buffers accumulated by the *buffer_callback* will not see their data copied into the pickle stream, only a cheap marker will be inserted.
pt_br: No lado emissor, é necessário passar um argumento *buffer_callback* para :class:`Pickler` (ou para a função :func:`dump` ou :func:`dumps`), que será chamada com cada :class:`PickleBuffer` gerado durante a serialização com pickle do grafo do objeto. Os buffers acumulados pelo *buffer_callback* não verão seus dados copiados no fluxo pickle, apenas um marcador barato será inserido.

source: On the receiving side, it needs to pass a *buffers* argument to :class:`Unpickler` (or to the :func:`load` or :func:`loads` function), which is an iterable of the buffers which were passed to *buffer_callback*. That iterable should produce buffers in the same order as they were passed to *buffer_callback*. Those buffers will provide the data expected by the reconstructors of the objects whose pickling produced the original :class:`PickleBuffer` objects.
pt_br: No lado receptor, é necessário passar um argumento *buffers* para :class:`Unpickler` (ou para a função :func:`load` ou :func:`load`), que é um iterável dos buffers que foram passado para *buffer_callback*. Esse iterável deve produzir buffers na mesma ordem em que foram passados para *buffer_callback*. Esses buffers fornecerão os dados esperados pelos reconstrutores dos objetos cuja serialização com pickle produziu os objetos :class:`PickleBuffer` originais.

source: Between the sending side and the receiving side, the communications system is free to implement its own transfer mechanism for out-of-band buffers. Potential optimizations include the use of shared memory or datatype-dependent compression.
pt_br: Entre o lado emissor e o lado receptor, o sistema de comunicações está livre para implementar seu próprio mecanismo de transferência para buffers fora de banda. As otimizações potenciais incluem o uso de memória compartilhada ou compactação dependente do tipo de dados.

source: Example
pt_br: Exemplo

source: Here is a trivial example where we implement a :class:`bytearray` subclass able to participate in out-of-band buffer pickling::
pt_br: Aqui está um exemplo trivial onde implementamos uma subclasse de :class:`bytearray` capaz de participar de serialização com pickle de buffer fora de banda::

source: class ZeroCopyByteArray(bytearray): def __reduce_ex__(self, protocol): if protocol >= 5: return type(self)._reconstruct, (PickleBuffer(self),), None else: # PickleBuffer is forbidden with pickle protocols <= 4. return type(self)._reconstruct, (bytearray(self),) @classmethod def _reconstruct(cls, obj): with memoryview(obj) as m: # Get a handle over the original buffer object obj = m.obj if type(obj) is cls: # Original buffer object is a ZeroCopyByteArray, return it # as-is. return obj else: return cls(obj)
pt_br: class ZeroCopyByteArray(bytearray): def __reduce_ex__(self, protocol): if protocol >= 5: return type(self)._reconstruct, (PickleBuffer(self),), None else: # PickleBuffer é proibido no pickle nos protocolos <= 4. return type(self)._reconstruct, (bytearray(self),) @classmethod def _reconstruct(cls, obj): with memoryview(obj) as m: # Obtém um controle sobre o objeto buffer original obj = m.obj if type(obj) is cls: # O objeto do buffer original é um ZeroCopyByteArray, # retorna-o como está. return obj else: return cls(obj)

source: The reconstructor (the ``_reconstruct`` class method) returns the buffer's providing object if it has the right type. This is an easy way to simulate zero-copy behaviour on this toy example.
pt_br: O reconstrutor (o método de classe ``_reconstruct``) retorna o objeto de fornecimento do buffer se ele tiver o tipo correto. Esta é uma maneira fácil de simular o comportamento de cópia zero neste exemplo de brinquedo.

source: On the consumer side, we can pickle those objects the usual way, which when unserialized will give us a copy of the original object::
pt_br: Do lado consumidor, podemos serializar com pickle esses objetos da maneira usual, que quando não serializados nos dará uma cópia do objeto original::

source: b = ZeroCopyByteArray(b"abc") data = pickle.dumps(b, protocol=5) new_b = pickle.loads(data) print(b == new_b) # True print(b is new_b) # False: a copy was made
pt_br: b = ZeroCopyByteArray(b"abc") data = pickle.dumps(b, protocol=5) new_b = pickle.loads(data) print(b == new_b) # True print(b is new_b) # False: uma cópia foi feita

source: But if we pass a *buffer_callback* and then give back the accumulated buffers when unserializing, we are able to get back the original object::
pt_br: Mas se passarmos um *buffer_callback* e, em seguida, retornarmos os buffers acumulados ao desserializar, seremos capazes de recuperar o objeto original::

source: b = ZeroCopyByteArray(b"abc") buffers = [] data = pickle.dumps(b, protocol=5, buffer_callback=buffers.append) new_b = pickle.loads(data, buffers=buffers) print(b == new_b) # True print(b is new_b) # True: no copy was made
pt_br: b = ZeroCopyByteArray(b"abc") buffers = [] data = pickle.dumps(b, protocol=5, buffer_callback=buffers.append) new_b = pickle.loads(data, buffers=buffers) print(b == new_b) # True print(b is new_b) # True: nenhuma cópia foi feita

source: This example is limited by the fact that :class:`bytearray` allocates its own memory: you cannot create a :class:`bytearray` instance that is backed by another object's memory. However, third-party datatypes such as NumPy arrays do not have this limitation, and allow use of zero-copy pickling (or making as few copies as possible) when transferring between distinct processes or systems.
pt_br: Este exemplo é limitado pelo fato de que :class:`bytearray` aloca sua própria memória: você não pode criar uma instância de :class:`bytearray` que é apoiada pela memória de outro objeto. No entanto, tipos de dados de terceiros, como arrays de NumPy, não têm essa limitação e permitem o uso de serialização com pickle de cópia zero (ou fazer o mínimo de cópias possível) ao transferir entre processos ou sistemas distintos.

source: :pep:`574` -- Pickle protocol 5 with out-of-band data
pt_br: :pep:`574` -- Protocolo de Pickle 5 com buffers de dados fora da banda

source: Restricting Globals
pt_br: Restringindo globais

source: By default, unpickling will import any class or function that it finds in the pickle data. For many applications, this behaviour is unacceptable as it permits the unpickler to import and invoke arbitrary code. Just consider what this hand-crafted pickle data stream does when loaded::
pt_br: Por padrão, a desserialização com pickle importará qualquer classe ou função que encontrar nos dados pickle. Para muitos aplicativos, esse comportamento é inaceitável, pois permite que o unpickler importe e invoque código arbitrário. Basta considerar o que este fluxo de dados pickle feito à mão faz quando carregado::

source: In this example, the unpickler imports the :func:`os.system` function and then apply the string argument "echo hello world". Although this example is inoffensive, it is not difficult to imagine one that could damage your system.
pt_br: Neste exemplo, o unpickler importa a função :func:`os.system` e então aplica o argumento string "echo hello world". Embora este exemplo seja inofensivo, não é difícil imaginar um que possa danificar seu sistema.

source: For this reason, you may want to control what gets unpickled by customizing :meth:`Unpickler.find_class`. Unlike its name suggests, :meth:`Unpickler.find_class` is called whenever a global (i.e., a class or a function) is requested. Thus it is possible to either completely forbid globals or restrict them to a safe subset.
pt_br: Por esta razão, você pode querer controlar o que é desserializado com pickle personalizando :meth:`Unpickler.find_class`. Ao contrário do que seu nome sugere, :meth:`Unpickler.find_class` é chamado sempre que um global (ou seja, uma classe ou uma função) é solicitado. Assim, é possível proibir completamente os globais ou restringi-los a um subconjunto seguro.

source: Here is an example of an unpickler allowing only few safe classes from the :mod:`builtins` module to be loaded::
pt_br: Aqui está um exemplo de um unpickler que permite que apenas algumas classes seguras do módulo :mod:`builtins` sejam carregadas::

source: import builtins import io import pickle safe_builtins = { 'range', 'complex', 'set', 'frozenset', 'slice', } class RestrictedUnpickler(pickle.Unpickler): def find_class(self, module, name): # Only allow safe classes from builtins. if module == "builtins" and name in safe_builtins: return getattr(builtins, name) # Forbid everything else. raise pickle.UnpicklingError("global '%s.%s' is forbidden" % (module, name)) def restricted_loads(s): """Helper function analogous to pickle.loads().""" return RestrictedUnpickler(io.BytesIO(s)).load()
pt_br: import builtins import io import pickle safe_builtins = { 'range', 'complex', 'set', 'frozenset', 'slice', } class RestrictedUnpickler(pickle.Unpickler): def find_class(self, module, name): # Só permite classes seguras de bultins. if module == "builtins" and name in safe_builtins: return getattr(builtins, name) # Proíbe todo o resto. raise pickle.UnpicklingError("global '%s.%s' is forbidden" % (module, name)) def restricted_loads(s): """Função auxiliar análoga a pickle.loads().""" return RestrictedUnpickler(io.BytesIO(s)).load()

source: A sample usage of our unpickler working as intended::
pt_br: Um exemplo de uso do nosso unpickler funcionando como esperado::

source: As our examples shows, you have to be careful with what you allow to be unpickled. Therefore if security is a concern, you may want to consider alternatives such as the marshalling API in :mod:`xmlrpc.client` or third-party solutions.
pt_br: Como nossos exemplos mostram, você deve ter cuidado com o que permite que seja desserializado com pickle. Portanto, se a segurança é uma preocupação, você pode querer considerar alternativas como a API de marshalling em :mod:`xmlrpc.client` ou soluções de terceiros.

source: Performance
pt_br: Desempenho

source: Recent versions of the pickle protocol (from protocol 2 and upwards) feature efficient binary encodings for several common features and built-in types. Also, the :mod:`pickle` module has a transparent optimizer written in C.
pt_br: Versões recentes do protocolo pickle (do protocolo 2 em diante) apresentam codificações binárias eficientes para vários recursos comuns e tipos embutidos. Além disso, o módulo :mod:`pickle` tem um otimizador transparente escrito em C.

source: Examples
pt_br: Exemplos

source: For the simplest code, use the :func:`dump` and :func:`load` functions. ::
pt_br: Para código mais simples, use as funções :func:`dump` e :func:`load`. ::

source: import pickle # An arbitrary collection of objects supported by pickle. data = { 'a': [1, 2.0, 3+4j], 'b': ("character string", b"byte string"), 'c': {None, True, False} } with open('data.pickle', 'wb') as f: # Pickle the 'data' dictionary using the highest protocol available. pickle.dump(data, f, pickle.HIGHEST_PROTOCOL)
pt_br: import pickle # Uma coleção arbitrária de objetos aceitos por pickle. data = { 'a': [1, 2.0, 3+4j], 'b': ("character string", b"byte string"), 'c': {None, True, False} } with open('data.pickle', 'wb') as f: # Serializa com pickle o dicionário 'data' usando # o protocolo mais alto disponível. pickle.dump(data, f, pickle.HIGHEST_PROTOCOL)

source: The following example reads the resulting pickled data. ::
pt_br: O exemplo a seguir lê os dados resultantes em serializados com pickle. ::

source: import pickle with open('data.pickle', 'rb') as f: # The protocol version used is detected automatically, so we do not # have to specify it. data = pickle.load(f)
pt_br: import pickle with open('data.pickle', 'rb') as f: # A versão do protocolo utilizada é detectada automaticamente, # portanto não precisamos especificá-la. data = pickle.load(f)

source: Command-line interface
pt_br: Interface de linha de comando

source: The :mod:`pickle` module can be invoked as a script from the command line, it will display contents of the pickle files. However, when the pickle file that you want to examine comes from an untrusted source, ``-m pickletools`` is a safer option because it does not execute pickle bytecode, see :ref:`pickletools CLI usage <pickletools-cli>`.
pt_br: O módulo :mod:`pickle` pode ser invocado como um script a partir da linha de comando e exibirá o conteúdo dos arquivos de pickle. No entanto, quando o arquivo de pickle que você deseja examinar vem de uma fonte não confiável, ``-m pickletools`` é uma opção mais segura, pois não executa o bytecode do pickle. Consulte o :ref:`uso da CLI do pickletools <pickletools-cli>`.

source: python -m pickle pickle_file [pickle_file ...]
pt_br: python -m pickle aquivo_pickle [aquivo_pickle ...]

source: The following option is accepted:
pt_br: A seguinte opção é aceita:

source: A pickle file to read, or ``-`` to indicate reading from standard input.
pt_br: Um arquivo pickle para ler, ou ``-`` para indicar leitura da entrada padrão.

source: Module :mod:`copyreg`
pt_br: Módulo :mod:`copyreg`

source: Pickle interface constructor registration for extension types.
pt_br: Registro de construtor de interface Pickle para tipos de extensão.

source: Module :mod:`pickletools`
pt_br: Módulo :mod:`pickletools`

source: Tools for working with and analyzing pickled data.
pt_br: Ferramentas para trabalhar e analisar dados serializados com pickle.

source: Module :mod:`shelve`
pt_br: Módulo :mod:`shelve`
