Repository: python/python-docs-pt-br
Catalog: library/pickle.po
Languages: pt_br

source: The *file* argument must have a write() method that accepts a single bytes argument. It can thus be an on-disk file opened for binary writing, an :class:`io.BytesIO` instance, or any other custom object that meets this interface.
pt_br: O argumento *file* deve ter um método write() que aceite um argumento de um único byte. Portanto, pode ser um arquivo em disco aberto para escrita binária, uma instância :class:`io.BytesIO` ou qualquer outro objeto personalizado que atenda a esta interface.

source: If *fix_imports* is true and *protocol* is less than 3, pickle will try to map the new Python 3 names to the old module names used in Python 2, so that the pickle data stream is readable with Python 2.
pt_br: Se *fix_imports* for verdadeiro e *protocolo* for menor que 3, pickle tentará mapear os novos nomes do Python 3 para os nomes dos módulos antigos usados no Python 2, de modo que o fluxo de dados pickle seja legível com o Python 2.

source: If *buffer_callback* is ``None`` (the default), buffer views are serialized into *file* as part of the pickle stream.
pt_br: Se *buffer_callback* for ``None`` (o padrão), as visualizações de buffer são serializadas em *file* como parte do fluxo pickle.

source: If *buffer_callback* is not ``None``, then it can be called any number of times with a buffer view. If the callback returns a false value (such as ``None``), the given buffer is :ref:`out-of-band <pickle-oob>`; otherwise the buffer is serialized in-band, i.e. inside the pickle stream.
pt_br: Se *buffer_callback* não for ``None``, ele pode ser chamado qualquer número de vezes com uma visualização de buffer. Se essa chamada retornar um valor falso (tal como ``None``), o buffer fornecido é :ref:`fora da banda <pickle-oob>`; caso contrário, o buffer é serializado dentro da banda, ou seja, dentro do fluxo pickle.

source: It is an error if *buffer_callback* is not ``None`` and *protocol* is ``None`` or smaller than 5.
pt_br: É um erro se *buffer_callback* não for ``None`` e *protocol* for ``None`` ou menor que 5.

source: Write the pickled representation of *obj* to the open file object given in the constructor.
pt_br: Escreve a representação serializada em pickle de *obj* no objeto arquivo aberto fornecido no construtor.

source: Do nothing by default. This exists so a subclass can override it.
pt_br: Não faz nada por padrão. Isso existe para que uma subclasse possa substituí-lo.

source: If :meth:`persistent_id` returns ``None``, *obj* is pickled as usual. Any other value causes :class:`Pickler` to emit the returned value as a persistent ID for *obj*. The meaning of this persistent ID should be defined by :meth:`Unpickler.persistent_load`. Note that the value returned by :meth:`persistent_id` cannot itself have a persistent ID.
pt_br: Se :meth:`persistent_id` retornar ``None``, *obj* é serializado com pickle como de costume. Qualquer outro valor faz com que :class:`Pickler` emita o valor retornado como um ID persistente para *obj*. O significado deste ID persistente deve ser definido por :meth:`Unpickler.persistent_load`. Observe que o valor retornado por :meth:`persistent_id` não pode ter um ID persistente.

source: See :ref:`pickle-persistent` for details and examples of uses.
pt_br: Consulte :ref:`pickle-persistent` para detalhes e exemplos de usos.

source: Add the default implementation of this method in the C implementation of :class:`!Pickler`.
pt_br: Foi adicionada a implementação padrão desse método na implementação em C da :class:`!Pickler`.

source: A pickler object's dispatch table is a registry of *reduction functions* of the kind which can be declared using :func:`copyreg.pickle`. It is a mapping whose keys are classes and whose values are reduction functions. A reduction function takes a single argument of the associated class and should conform to the same interface as a :meth:`~object.__reduce__` method.
pt_br: A tabela de despacho de um objeto pickler é um registro de *funções de redução* do tipo que pode ser declarado usando :func:`copyreg.pickle`. É um mapeamento cujas chaves são classes e cujos valores são funções de redução. Uma função de redução leva um único argumento da classe associada e deve estar de acordo com a mesma interface de um método :meth:`~object.__reduce__`.

source: By default, a pickler object will not have a :attr:`dispatch_table` attribute, and it will instead use the global dispatch table managed by the :mod:`copyreg` module. However, to customize the pickling for a specific pickler object one can set the :attr:`dispatch_table` attribute to a dict-like object. Alternatively, if a subclass of :class:`Pickler` has a :attr:`dispatch_table` attribute then this will be used as the default dispatch table for instances of that class.
pt_br: Por padrão, um objeto pickler não terá um atributo :attr:`dispatch_table`, e em vez disso usará a tabela de despacho global gerenciada pelo módulo :mod:`copyreg`. No entanto, para personalizar a serialização com pickle de um objeto pickler específico, pode-se definir o atributo :attr:`dispatch_table` para um objeto do tipo dict. Alternativamente, se uma subclasse de :class:`Pickler` tem um atributo :attr:`dispatch_table` então ele será usado como a tabela de despacho padrão para instâncias daquela classe.

source: See :ref:`pickle-dispatch` for usage examples.
pt_br: Consulte :ref:`pickle-dispatch` para exemplos de uso.

source: Special reducer that can be defined in :class:`Pickler` subclasses. This method has priority over any reducer in the :attr:`dispatch_table`. It should conform to the same interface as a :meth:`~object.__reduce__` method, and can optionally return :data:`NotImplemented` to fallback on :attr:`dispatch_table`-registered reducers to pickle ``obj``.
pt_br: Redutor especial que pode ser definido em subclasses de :class:`Pickler`. Este método tem prioridade sobre qualquer redutor em :attr:`dispatch_table`. Ele deve estar de acordo com a mesma interface que um método :meth:`~object.__reduce__` e pode opcionalmente retornar :data:`NotImplemented` como alternativa em redutores registrados em :attr:`dispatch_table` para serializar com pickle ``obj``.

source: For a detailed example, see :ref:`reducer_override`.
pt_br: Para exemplo detalhado, consulte :ref:`reducer_override`.

source: Deprecated. Enable fast mode if set to a true value. The fast mode disables the usage of memo, therefore speeding the pickling process by not generating superfluous PUT opcodes. It should not be used with self-referential objects, doing otherwise will cause :class:`Pickler` to recurse infinitely.
pt_br: Descontinuado. Ative o modo rápido se definido como um valor verdadeiro. O modo rápido desabilita o uso de memo, portanto, agilizando o processo de serialização com pickle por não gerar códigos de operação PUT supérfluos. Ele não deve ser usado com objetos autorreferenciais, fazer o contrário fará com que :class:`Pickler` recorra infinitamente.

source: Use :func:`pickletools.optimize` if you need more compact pickles.
pt_br: Use :func:`pickletools.optimize` se você precisar de serializações com pickle mais compactas.

source: Clears the pickler's "memo".
pt_br: Limpa o "memo" do pickler

source: The memo is the data structure that remembers which objects the pickler has already seen, so that shared or recursive objects are pickled by reference and not by value. This method is useful when re-using picklers.
pt_br: O memo é a estrutura de dados que lembra quais objetos o pickler já viu, de modo que objetos compartilhados ou recursivos sejam serializados por pickle por referência e não por valor. Este método é útil ao reutilizar picklers.

source: This takes a binary file for reading a pickle data stream.
pt_br: Recebe um arquivo binário para ler um fluxo de dados pickle.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed.
pt_br: A versão do protocolo do pickle é detectada automaticamente, portanto, nenhum argumento de protocolo é necessário.

source: The argument *file* must have three methods, a read() method that takes an integer argument, a readinto() method that takes a buffer argument and a readline() method that requires no arguments, as in the :class:`io.BufferedIOBase` interface. Thus *file* can be an on-disk file opened for binary reading, an :class:`io.BytesIO` object, or any other custom object that meets this interface.
pt_br: O argumento *file* deve ter três métodos: um método read() que recebe um argumento inteiro, um método readinto() que recebe um argumento buffer e um método readline() que não requer argumentos, como na interface :class:`io.BufferedIOBase`. Assim, *file* pode ser um arquivo em disco aberto para leitura binária, um objeto :class:`io.BytesIO` ou qualquer outro objeto personalizado que atenda a esta interface.

source: The optional arguments *fix_imports*, *encoding* and *errors* are used to control compatibility support for pickle stream generated by Python 2. If *fix_imports* is true, pickle will try to map the old Python 2 names to the new names used in Python 3. The *encoding* and *errors* tell pickle how to decode 8-bit string instances pickled by Python 2; these default to 'ASCII' and 'strict', respectively. The *encoding* can be 'bytes' to read these 8-bit string instances as bytes objects. Using ``encoding='latin1'`` is required for unpickling NumPy arrays and instances of :class:`~datetime.datetime`, :class:`~datetime.date` and :class:`~datetime.time` pickled by Python 2.
pt_br: Os argumentos opcionais *fix_imports*, *encoding* e *errors* são usados para controlar o suporte de compatibilidade ao fluxo pickle gerado pelo Python 2. Se *fix_imports* for verdadeiro, pickle tentará mapear os nomes antigos do Python 2 para os novos nomes usados no Python 3. Os *encoding* e *erros* dizem ao pickle como decodificar instâncias de string de 8 bits capturadas pelo Python 2; o padrão é 'ASCII' e 'strict', respectivamente. O argumento *encoding* pode ser 'bytes' para ler essas instâncias de string de 8 bits como objetos de bytes. Usar ``encoding='latin1'`` é necessário para a desserialização com pickle de vetores NumPy e instâncias de :class:`~datetime.datetime`, :class:`~datetime.date` e :class:`~datetime.time` serializadas com pickle pelo Python 2.

source: If *buffers* is ``None`` (the default), then all data necessary for deserialization must be contained in the pickle stream. This means that the *buffer_callback* argument was ``None`` when a :class:`Pickler` was instantiated (or when :func:`dump` or :func:`dumps` was called).
pt_br: Se *buffers* for ``None`` (o padrão), todos os dados necessários para desserialização devem estar contidos no fluxo pickle. Isso significa que o argumento *buffer_callback* era ``None`` quando um :class:`Pickler` foi instanciado (ou quando :func:`dump` ou :func:`dumps` foi chamado).

source: If *buffers* is not ``None``, it should be an iterable of buffer-enabled objects that is consumed each time the pickle stream references an :ref:`out-of-band <pickle-oob>` buffer view. Such buffers have been given in order to the *buffer_callback* of a Pickler object.
pt_br: Se *buffers* for ``None``, deve ser um iterável de objetos habilitados para buffer que é consumido cada vez que o fluxo de serialização com pickle faz referência a uma visualização de buffer :ref:`fora da banda <pickle-oob>`. Esses buffers foram fornecidos em ordem para o *buffer_callback* de um objeto Pickler.

source: Read the pickled representation of an object from the open file object given in the constructor, and return the reconstituted object hierarchy specified therein. Bytes past the pickled representation of the object are ignored.
pt_br: Lê a representação serializada com pickle de um objeto a partir do objeto arquivo aberto fornecido no construtor e retorna a hierarquia de objeto reconstituído especificada nele. Os bytes após a representação serializada com pickle do objeto são ignorados.

source: Raise an :exc:`UnpicklingError` by default.
pt_br: Levanta um :exc:`UnpicklingError` por padrão.

source: If defined, :meth:`persistent_load` should return the object specified by the persistent ID *pid*. If an invalid persistent ID is encountered, an :exc:`UnpicklingError` should be raised.
pt_br: Se definido, :meth:`persistent_load` deve retornar o objeto especificado pelo ID persistente *pid*. Se um ID persistente inválido for encontrado, uma :exc:`UnpicklingError` deve ser levantada.

source: Add the default implementation of this method in the C implementation of :class:`!Unpickler`.
pt_br: Foi adicionada a implementação padrão desse método na implementação em C da :class:`!Unpickler`.

source: Import *module* if necessary and return the object called *name* from it, where the *module* and *name* arguments are :class:`str` objects. Note, unlike its name suggests, :meth:`find_class` is also used for finding functions.
pt_br: Importa *module* se necessário e retorna o objeto chamado *name* dele, onde os argumentos *module* e *name* são objetos :class:`str`. Observe, ao contrário do que seu nome sugere, :meth:`find_class` também é usado para encontrar funções.

source: Subclasses may override this to gain control over what type of objects and how they can be loaded, potentially reducing security risks. Refer to :ref:`pickle-restrict` for details.
pt_br: As subclasses podem substituir isso para obter controle sobre quais tipos de objetos e como eles podem ser carregados, reduzindo potencialmente os riscos de segurança. Confira :ref:`pickle-restrict` para detalhes.

source: Raises an :ref:`auditing event <auditing>` ``pickle.find_class`` with arguments ``module``, ``name``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``pickle.find_class`` com os argumentos ``module``, ``name``.

source: A wrapper for a buffer representing picklable data. *buffer* must be a :ref:`buffer-providing <bufferobjects>` object, such as a :term:`bytes-like object` or a N-dimensional array.
pt_br: Um invólucro para um buffer que representa dados serializáveis com pickle. *buffer* deve ser um objeto :ref:`provedor de buffer <bufferobjects>`, como um :term:`objeto bytes ou similar` ou um vetor N-dimensional.

source: :class:`PickleBuffer` is itself a buffer provider, therefore it is possible to pass it to other APIs expecting a buffer-providing object, such as :class:`memoryview`.
pt_br: :class:`PickleBuffer` é ele próprio um provedor de buffer, de forma que é possível passá-lo para outras APIs que esperam um objeto provedor de buffer, como :class:`memoryview`.

source: :class:`PickleBuffer` objects can only be serialized using pickle protocol 5 or higher. They are eligible for :ref:`out-of-band serialization <pickle-oob>`.
pt_br: Objetos :class:`PickleBuffer` só podem ser serializados usando o protocolo pickle 5 ou superior. Eles são elegíveis para :ref:`serialização fora de banda <pickle-oob>`.

source: Return a :class:`memoryview` of the memory area underlying this buffer. The returned object is a one-dimensional, C-contiguous memoryview with format ``B`` (unsigned bytes). :exc:`BufferError` is raised if the buffer is neither C- nor Fortran-contiguous.
pt_br: Retorna um :class:`memoryview` da área de memória subjacente a este buffer. O objeto retornado é um memoryview unidimensional, contíguo C com formato ``B`` (bytes não assinados). :exc:`BufferError` é levantada se o buffer não for contíguo C nem Fortran.

source: Release the underlying buffer exposed by the PickleBuffer object.
pt_br: Libera o buffer subjacente exposto pelo objeto PickleBuffer.

source: What can be pickled and unpickled?
pt_br: O que pode ser serializado e desserializado com pickle?

source: The following types can be pickled:
pt_br: Os seguintes tipos podem ser serializados com pickle:

source: built-in constants (``None``, ``True``, ``False``, ``Ellipsis``, and :data:`NotImplemented`);
pt_br: constantes embutidas (``None``, ``True``, ``False``, ``Ellipsis`` e :data:`NotImplemented`);

source: integers, floating-point numbers, complex numbers;
pt_br: inteiros, números de ponto flutuante, números complexos;

source: tuples, lists, sets, and dictionaries containing only picklable objects;
pt_br: tuplas, listas, conjuntos e dicionários contendo apenas objetos serializáveis com pickle;

source: functions (built-in and user-defined) accessible from the top level of a module (using :keyword:`def`, not :keyword:`lambda`);
pt_br: funções (embutidas ou definidas pelo usuário) acessíveis no nível superior de um módulo (usando :keyword:`def`, não :keyword:`lambda`);

source: classes accessible from the top level of a module;
pt_br: classes acessíveis no nível superior de um módulo;

source: instances of such classes whose the result of calling :meth:`~object.__getstate__` is picklable (see section :ref:`pickle-inst` for details).
pt_br: instâncias de classes cujo o resultado da chamada de :meth:`~object.__getstate__` seja serializável com pickle (veja a seção :ref:`pickle-inst` para detalhes).

source: Attempts to pickle unpicklable objects will raise the :exc:`PicklingError` exception; when this happens, an unspecified number of bytes may have already been written to the underlying file. Trying to pickle a highly recursive data structure may exceed the maximum recursion depth, a :exc:`RecursionError` will be raised in this case. You can carefully raise this limit with :func:`sys.setrecursionlimit`.
pt_br: As tentativas de serializar objetos não serializáveis com pickle vão levantar a exceção :exc:`PicklingError`; quando isso acontece, um número não especificado de bytes pode já ter sido escrito no arquivo subjacente. Tentar serializar com pickle uma estrutura de dados altamente recursiva pode exceder a profundidade máxima de recursão, a :exc:`RecursionError` será levantada neste caso. Você pode aumentar este limite cuidadosamente com :func:`sys.setrecursionlimit`.

source: Note that functions (built-in and user-defined) are pickled by fully :term:`qualified name`, not by value. [#]_ This means that only the function name is pickled, along with the name of the containing module and classes. Neither the function's code, nor any of its function attributes are pickled. Thus the defining module must be importable in the unpickling environment, and the module must contain the named object, otherwise an exception will be raised. [#]_
pt_br: Observe que as funções (embutidas e definidas pelo usuário) são serializadas com pickle pelo :term:`nome qualificado`, não pelo valor. [#]_ Isso significa que apenas o nome da função é serializado com pickle, junto com o nome do módulo e das classes contidos. Nem o código da função, nem qualquer um de seus atributos de função são serializados com pickle. Assim, o módulo de definição deve ser importável no ambiente de desserialização com pickle, e o módulo deve conter o objeto nomeado, caso contrário, uma exceção será levantada. [#]_

source: Similarly, classes are pickled by fully qualified name, so the same restrictions in the unpickling environment apply. Note that none of the class's code or data is pickled, so in the following example the class attribute ``attr`` is not restored in the unpickling environment::
pt_br: Da mesma forma, as classes são serializadas com pickle pelo nome qualificado, portanto, aplicam-se as mesmas restrições no ambiente de desserialização com pickle. Observe que nenhum código ou dado da classe é coletado, portanto, no exemplo a seguir, o atributo de classe ``attr`` não é restaurado no ambiente de desserialização com pickle::

source: These restrictions are why picklable functions and classes must be defined at the top level of a module.
pt_br: Essas restrições são a razão pela qual as funções e classes serializáveis com pickle devem ser definidas no nível superior de um módulo.

source: Similarly, when class instances are pickled, their class's code and data are not pickled along with them. Only the instance data are pickled. This is done on purpose, so you can fix bugs in a class or add methods to the class and still load objects that were created with an earlier version of the class. If you plan to have long-lived objects that will see many versions of a class, it may be worthwhile to put a version number in the objects so that suitable conversions can be made by the class's :meth:`~object.__setstate__` method.
pt_br: Da mesma forma, quando as instâncias da classe são serializadas com pickle, o código e os dados de sua classe não são serializados junto com elas. Apenas os dados da instância são serializados com pickle. Isso é feito de propósito para que você possa corrigir bugs em uma classe ou adicionar métodos à classe e ainda carregar objetos que foram criados com uma versão anterior da classe. Se você planeja ter objetos de longa duração que verão muitas versões de uma classe, pode valer a pena colocar um número de versão nos objetos para que as conversões adequadas possam ser feitas pelo método :meth:`~object.__setstate__` da classe.

source: Pickling Class Instances
pt_br: Serializando com pickle instâncias de classes

source: In this section, we describe the general mechanisms available to you to define, customize, and control how class instances are pickled and unpickled.
pt_br: Nesta seção, descrevemos os mecanismos gerais disponíveis para você definir, personalizar e controlar como as instâncias de classe são serializadas e desserializadas com pickle.

source: In most cases, no additional code is needed to make instances picklable. By default, pickle will retrieve the class and the attributes of an instance via introspection. When a class instance is unpickled, its :meth:`~object.__init__` method is usually *not* invoked. The default behaviour first creates an uninitialized instance and then restores the saved attributes. The following code shows an implementation of this behaviour::
pt_br: Na maioria dos casos, nenhum código adicional é necessário para tornar as instâncias serializáveis com pickle. Por padrão, o pickle recuperará a classe e os atributos de uma instância por meio de introspecção. Quando uma instância de classe não está serializada com pickle, seu método :meth:`~object.__init__` geralmente *não* é invocado. O comportamento padrão primeiro cria uma instância não inicializada e, em seguida, restaura os atributos salvos. O código a seguir mostra uma implementação desse comportamento::

source: Classes can alter the default behaviour by providing one or several special methods:
pt_br: As classes podem alterar o comportamento padrão, fornecendo um ou vários métodos especiais:

source: In protocols 2 and newer, classes that implements the :meth:`__getnewargs_ex__` method can dictate the values passed to the :meth:`__new__` method upon unpickling. The method must return a pair ``(args, kwargs)`` where *args* is a tuple of positional arguments and *kwargs* a dictionary of named arguments for constructing the object. Those will be passed to the :meth:`__new__` method upon unpickling.
pt_br: Nos protocolos 2 e mais recentes, as classes que implementam o método :meth:`__getnewargs_ex__` podem ditar os valores passados para o método :meth:`__new__` após a desserialização com pickle. O método deve retornar um par ``(args, kwargs)`` onde *args* é uma tupla de argumentos posicionais e *kwargs* um dicionário de argumentos nomeados para construir o objeto. Esses serão passados para o método :meth:`__new__` após a desserialização com pickle.

source: You should implement this method if the :meth:`__new__` method of your class requires keyword-only arguments. Otherwise, it is recommended for compatibility to implement :meth:`__getnewargs__`.
pt_br: Você deve implementar este método se o método :meth:`__new__` de sua classe requer argumentos somente-nomeados. Caso contrário, é recomendado para compatibilidade implementar :meth:`__getnewargs__`.
