Repository: python/python-docs-pt-br
Catalog: library/pickle.po
Languages: pt_br

source: :mod:`!pickle` --- Python object serialization
pt_br: :mod:`!pickle` --- Serialização de objetos Python

source: **Source code:** :source:`Lib/pickle.py`
pt_br: **Código-fonte:** :source:`Lib/pickle.py`

source: The :mod:`pickle` module implements binary protocols for serializing and de-serializing a Python object structure. *"Pickling"* is the process whereby a Python object hierarchy is converted into a byte stream, and *"unpickling"* is the inverse operation, whereby a byte stream (from a :term:`binary file` or :term:`bytes-like object`) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as "serialization", "marshalling," [#]_ or "flattening"; however, to avoid confusion, the terms used here are "pickling" and "unpickling".
pt_br: O módulo :mod:`pickle` implementa protocolos binários para serializar e desserializar uma estrutura de objeto Python. *"Pickling"* é o processo pelo qual uma hierarquia de objetos Python é convertida em um fluxo de bytes, e *"unpickling"* é a operação inversa, em que um fluxo de bytes (de um :term:`arquivo binário` ou :term:`objeto bytes ou similar`) é convertido de volta em uma hierarquia de objetos. Pickling (e unpickling) com pickle é alternativamente conhecido como "serialização", "marshalling" [#]_ ou "flattening"; no entanto, para evitar confusão, usa-se is termos "pickling" e "unpickling". Nesta documentação traduzida, usaremos "serialização com pickle" e "desserialização com pickle", respectivamente.

source: The ``pickle`` module **is not secure**. Only unpickle data you trust.
pt_br: O módulo ``pickle`` **não é seguro**. Desserialize com pickle apenas os dados em que você confia.

source: It is possible to construct malicious pickle data which will **execute arbitrary code during unpickling**. Never unpickle data that could have come from an untrusted source, or that could have been tampered with.
pt_br: É possível construir dados maliciosos em pickle que irão **executar código arbitrário durante o processo de desserialização com pickle**. Nunca desserialize com pickle os dados que possam vir de uma fonte não confiável ou que possam ter sido adulterados.

source: Consider signing data with :mod:`hmac` if you need to ensure that it has not been tampered with.
pt_br: Considere assinar dados com :mod:`hmac` se você precisar garantir que eles não foram adulterados.

source: Safer serialization formats such as :mod:`json` may be more appropriate if you are processing untrusted data. See :ref:`comparison-with-json`.
pt_br: Formatos de serialização mais seguros como :mod:`json` podem ser mais apropriados se você estiver processando dados não confiáveis. Vejo :ref:`comparison-with-json`.

source: Relationship to other Python modules
pt_br: Relacionamento com outros módulos Python

source: Comparison with ``marshal``
pt_br: Comparação com ``marshal``

source: Python has a more primitive serialization module called :mod:`marshal`, but in general :mod:`pickle` should always be the preferred way to serialize Python objects. :mod:`marshal` exists primarily to support Python's :file:`.pyc` files.
pt_br: Python tem um módulo de serialização mais primitivo chamado :mod:`marshal`, mas em geral :mod:`pickle` deve ser sempre a forma preferida de serializar objetos Python. :mod:`marshal` existe principalmente para oferecer suporte a arquivos :file:`.pyc` do Python.

source: The :mod:`pickle` module differs from :mod:`marshal` in several significant ways:
pt_br: O módulo :mod:`pickle` difere do :mod:`marshal` de várias maneiras significativas:

source: The :mod:`pickle` module keeps track of the objects it has already serialized, so that later references to the same object won't be serialized again. :mod:`marshal` doesn't do this.
pt_br: O módulo :mod:`pickle` mantém o controle dos objetos que já serializou, para que referências posteriores ao mesmo objeto não sejam serializadas novamente. :mod:`marshal` não faz isso.

source: This has implications both for recursive objects and object sharing. Recursive objects are objects that contain references to themselves. These are not handled by marshal, and in fact, attempting to marshal recursive objects will crash your Python interpreter. Object sharing happens when there are multiple references to the same object in different places in the object hierarchy being serialized. :mod:`pickle` stores such objects only once, and ensures that all other references point to the master copy. Shared objects remain shared, which can be very important for mutable objects.
pt_br: Isso tem implicações tanto para objetos recursivos quanto para compartilhamento de objetos. Objetos recursivos são objetos que contêm referências a si mesmos. Eles não são tratados pelo marshal e, de fato, tentar usar marshal em objetos recursivos irá travar seu interpretador Python. O compartilhamento de objetos ocorre quando há várias referências ao mesmo objeto em locais diferentes na hierarquia de objetos sendo serializados. :mod:`pickle` armazena tais objetos apenas uma vez, e garante que todas as outras referências apontem para a cópia mestre. Os objetos compartilhados permanecem compartilhados, o que pode ser muito importante para objetos mutáveis.

source: :mod:`marshal` cannot be used to serialize user-defined classes and their instances. :mod:`pickle` can save and restore class instances transparently, however the class definition must be importable and live in the same module as when the object was stored.
pt_br: :mod:`marshal` não pode ser usado para serializar classes definidas pelo usuário e suas instâncias. :mod:`pickle` pode salvar e restaurar instâncias de classe de forma transparente, no entanto, a definição de classe deve ser importável e viver no mesmo módulo de quando o objeto foi armazenado.

source: The :mod:`marshal` serialization format is not guaranteed to be portable across Python versions. Because its primary job in life is to support :file:`.pyc` files, the Python implementers reserve the right to change the serialization format in non-backwards compatible ways should the need arise. The :mod:`pickle` serialization format is guaranteed to be backwards compatible across Python releases provided a compatible pickle protocol is chosen and pickling and unpickling code deals with Python 2 to Python 3 type differences if your data is crossing that unique breaking change language boundary.
pt_br: O formato de serialização do :mod:`marshal` não tem garantia de portabilidade entre as versões do Python. Como sua principal tarefa em vida é oferecer suporte a arquivos :file:`.pyc`, os implementadores do Python se reservam o direito de alterar o formato de serialização de maneiras não compatíveis com versões anteriores, caso haja necessidade. O formato de serialização do :mod:`pickle` tem a garantia de ser compatível com versões anteriores em todas as versões do Python, desde que um protocolo pickle compatível seja escolhido e o código de serialização e desserialização com pickle lide com diferenças de tipo Python 2 a Python 3 se seus dados estiverem cruzando aquele limite de mudança de linguagem exclusivo.

source: Comparison with ``json``
pt_br: Comparação com ``json``

source: There are fundamental differences between the pickle protocols and `JSON (JavaScript Object Notation) <https://json.org>`_:
pt_br: Existem diferenças fundamentais entre os protocolos pickle e `JSON (JavaScript Object Notation) <https://json.org>`_:

source: JSON is a text serialization format (it outputs unicode text, although most of the time it is then encoded to ``utf-8``), while pickle is a binary serialization format;
pt_br: JSON é um formato de serialização de texto (ele produz texto unicode, embora na maioria das vezes seja codificado para ``utf-8``), enquanto pickle é um formato de serialização binário;

source: JSON is human-readable, while pickle is not;
pt_br: JSON é legível por humanos, enquanto pickle não é;

source: JSON is interoperable and widely used outside of the Python ecosystem, while pickle is Python-specific;
pt_br: JSON é interoperável e amplamente usado fora do ecossistema Python, enquanto pickle é específico para Python;

source: JSON, by default, can only represent a subset of the Python built-in types, and no custom classes; pickle can represent an extremely large number of Python types (many of them automatically, by clever usage of Python's introspection facilities; complex cases can be tackled by implementing :ref:`specific object APIs <pickle-inst>`);
pt_br: JSON, por padrão, só pode representar um subconjunto dos tipos embutidos do Python, e nenhuma classe personalizada; pickle pode representar um número extremamente grande de tipos Python (muitos deles automaticamente, pelo uso inteligente dos recursos de introspecção do Python; casos complexos podem ser resolvidos implementando :ref:`APIs de objetos específicos <pickle-inst>`);

source: Unlike pickle, deserializing untrusted JSON does not in itself create an arbitrary code execution vulnerability.
pt_br: Ao contrário do pickle, a desserialização não confiável do JSON não cria, por si só, uma vulnerabilidade de execução de código arbitrário.

source: The :mod:`json` module: a standard library module allowing JSON serialization and deserialization.
pt_br: O módulo :mod:`json`: um módulo de biblioteca padrão que permite a serialização e desserialização JSON.

source: Data stream format
pt_br: Formato de fluxo de dados

source: The data format used by :mod:`pickle` is Python-specific. This has the advantage that there are no restrictions imposed by external standards such as JSON (which can't represent pointer sharing); however it means that non-Python programs may not be able to reconstruct pickled Python objects.
pt_br: O formato de dados usado pelo :mod:`pickle` é específico do Python. Isso tem a vantagem de não haver restrições impostas por padrões externos, como JSON (que não pode representar o compartilhamento de ponteiros); no entanto, isso significa que programas não Python podem não ser capazes de reconstruir objetos Python serializados com pickle.

source: By default, the :mod:`pickle` data format uses a relatively compact binary representation. If you need optimal size characteristics, you can efficiently :doc:`compress <archiving>` pickled data.
pt_br: Por padrão, o formato de dados do :mod:`pickle` usa uma representação binária relativamente compacta. Se você precisa de características de tamanho ideal, pode com eficiência :doc:`comprimir <archiving>` dados processados com pickle.

source: The module :mod:`pickletools` contains tools for analyzing data streams generated by :mod:`pickle`. :mod:`pickletools` source code has extensive comments about opcodes used by pickle protocols.
pt_br: O módulo :mod:`pickletools` contém ferramentas para analisar fluxos de dados gerados por :mod:`pickle`. O código-fonte do :mod:`pickletools` tem extensos comentários sobre códigos de operações usados por protocolos de pickle.

source: There are currently 6 different protocols which can be used for pickling. The higher the protocol used, the more recent the version of Python needed to read the pickle produced.
pt_br: Existem atualmente 6 protocolos diferentes que podem ser usados para a serialização com pickle. Quanto mais alto o protocolo usado, mais recente é a versão do Python necessária para ler o pickle produzido.

source: Protocol version 0 is the original "human-readable" protocol and is backwards compatible with earlier versions of Python.
pt_br: A versão 0 do protocolo é o protocolo original "legível por humanos" e é compatível com versões anteriores do Python.

source: Protocol version 1 is an old binary format which is also compatible with earlier versions of Python.
pt_br: A versão 1 do protocolo é um formato binário antigo que também é compatível com versões anteriores do Python.

source: Protocol version 2 was introduced in Python 2.3. It provides much more efficient pickling of :term:`new-style classes <new-style class>`. Refer to :pep:`307` for information about improvements brought by protocol 2.
pt_br: A versão 2 do protocolo foi introduzida no Python 2.3. Ela fornece uma serialização com pickle muito mais eficiente de :term:`classes estilo novo <new-style class>`. Consulte :pep:`307` para obter informações sobre as melhorias trazidas pelo protocolo 2.

source: Protocol version 3 was added in Python 3.0. It has explicit support for :class:`bytes` objects and cannot be unpickled by Python 2.x. This was the default protocol in Python 3.0--3.7.
pt_br: A versão 3 do protocolo foi adicionada ao Python 3.0. Ela tem suporte explícito a objetos :class:`bytes` e não é possível desserializar com pickle a partir do Python 2.x. Este era o protocolo padrão no Python 3.0--3.7.

source: Protocol version 4 was added in Python 3.4. It adds support for very large objects, pickling more kinds of objects, and some data format optimizations. This was the default protocol in Python 3.8--3.13. Refer to :pep:`3154` for information about improvements brought by protocol 4.
pt_br: A versão 4 do protocolo foi adicionada ao Python 3.4. Ela adiciona suporte para objetos muito grandes, serialização com pickle de mais tipos de objetos e algumas otimizações de formato de dados. Isso é o protocolo padrão no Python 3.8--3.13. Consulte :pep:`3154` para obter informações sobre as melhorias trazidas pelo protocolo 4.

source: Protocol version 5 was added in Python 3.8. It adds support for out-of-band data and speedup for in-band data. It is the default protocol starting with Python 3.14. Refer to :pep:`574` for information about improvements brought by protocol 5.
pt_br: A versão 5 do protocolo foi adicionada ao Python 3.8. Ela adiciona suporte a dados fora da banda e aumento de velocidade para dados dentro da banda. É o protocolo padrão a partir do Python 3.14. Consulte :pep:`574` para obter informações sobre as melhorias trazidas pelo protocolo 5.

source: Serialization is a more primitive notion than persistence; although :mod:`pickle` reads and writes file objects, it does not handle the issue of naming persistent objects, nor the (even more complicated) issue of concurrent access to persistent objects. The :mod:`pickle` module can transform a complex object into a byte stream and it can transform the byte stream into an object with the same internal structure. Perhaps the most obvious thing to do with these byte streams is to write them onto a file, but it is also conceivable to send them across a network or store them in a database. The :mod:`shelve` module provides a simple interface to pickle and unpickle objects on DBM-style database files.
pt_br: A serialização é uma noção mais primitiva do que a persistência; embora o :mod:`pickle` leia e escreva objetos arquivo, ele não lida com a questão de nomear objetos persistentes, nem a questão (ainda mais complicada) de acesso simultâneo a objetos persistentes. O módulo :mod:`pickle` pode transformar um objeto complexo em um fluxo de bytes e pode transformar o fluxo de bytes em um objeto com a mesma estrutura interna. Talvez a coisa mais óbvia a fazer com esses fluxos de bytes seja escrevê-los em um arquivo, mas também é concebível enviá-los através de uma rede ou armazená-los em um banco de dados. O módulo :mod:`shelve` fornece uma interface simples para serializar e desserializar com pickle os objetos em arquivos de banco de dados no estilo DBM.

source: Module Interface
pt_br: Interface do módulo

source: To serialize an object hierarchy, you simply call the :func:`dumps` function. Similarly, to de-serialize a data stream, you call the :func:`loads` function. However, if you want more control over serialization and de-serialization, you can create a :class:`Pickler` or an :class:`Unpickler` object, respectively.
pt_br: Para serializar uma hierarquia de objeto, você simplesmente chama a função :func:`dumps`. Da mesma forma, para desserializar um fluxo de dados, você chama a função :func:`loads`. No entanto, se você quiser mais controle sobre a serialização e desserialização, pode criar um objeto :class:`Pickler` ou :class:`Unpickler`, respectivamente.

source: The :mod:`pickle` module provides the following constants:
pt_br: O módulo :mod:`pickle` fornece as seguintes constantes:

source: An integer, the highest :ref:`protocol version <pickle-protocols>` available. This value can be passed as a *protocol* value to functions :func:`dump` and :func:`dumps` as well as the :class:`Pickler` constructor.
pt_br: Um inteiro, a mais alta :ref:`versão de protocolo <pickle-protocols>` disponível. Este valor pode ser passado como um valor de *protocol* para as funções :func:`dump` e :func:`dumps`, bem como o construtor de :class:`Pickler`.

source: An integer, the default :ref:`protocol version <pickle-protocols>` used for pickling. May be less than :data:`HIGHEST_PROTOCOL`. Currently the default protocol is 5, introduced in Python 3.8 and incompatible with previous versions. This version introduces support for out-of-band buffers, where :pep:`3118`-compatible data can be transmitted separately from the main pickle stream.
pt_br: Um inteiro, a :ref:`versão de protocolo <pickle-protocols>` padrão usada para a serialização com pickle. Pode ser menor que :data:`HIGHEST_PROTOCOL`. Atualmente, o protocolo padrão é 5, introduzido pela primeira vez no Python 3.8 e incompatível com as versões anteriores. Esta versão introduz suporte para buffers fora da banda, nos quais dados compatíveis com :pep:`3118` podem ser transmitidos separadamente do fluxo principal do pickle.

source: The default protocol is 3.
pt_br: O protocolo padrão é 3.

source: The default protocol is 4.
pt_br: O protocolo padrão é 4.

source: The default protocol is 5.
pt_br: O protocolo padrão é o 5.

source: The :mod:`pickle` module provides the following functions to make the pickling process more convenient:
pt_br: O módulo :mod:`pickle` fornece as seguintes funções para tornar o processo de serialização com pickle mais conveniente:

source: Write the pickled representation of the object *obj* to the open :term:`file object` *file*. This is equivalent to ``Pickler(file, protocol).dump(obj)``.
pt_br: Escreve a representação após a serialização com pickle do objeto *obj* no :term:`objeto arquivo` aberto *file*. Isso é equivalente a ``Pickler(file, protocol).dump(obj)``.

source: Arguments *file*, *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
pt_br: Os argumentos *file*, *protocol*, *fix_imports* e *buffer_callback* têm o mesmo sentido que no construtor de :class:`Pickler`.

source: The *buffer_callback* argument was added.
pt_br: O argumento *buffer_callback* foi adicionado.

source: Return the pickled representation of the object *obj* as a :class:`bytes` object, instead of writing it to a file.
pt_br: Retorna a representação em após a serialização com pickle do objeto *obj* como um objeto :class:`bytes`, ao invés de escrevê-lo em um arquivo.

source: Arguments *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
pt_br: Os argumentos *protocol*, *fix_imports* e *buffer_callback* têm o mesmo sentido que no construtor de :class:`Pickler`.

source: Read the pickled representation of an object from the open :term:`file object` *file* and return the reconstituted object hierarchy specified therein. This is equivalent to ``Unpickler(file).load()``.
pt_br: Lê a representação serializada com pickle de um objeto a partir de :term:`objeto arquivo` aberto *file* e retorna a hierarquia de objeto reconstituído especificada nele. Isso é equivalente a ``Unpickler(file).load()``.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed. Bytes past the pickled representation of the object are ignored.
pt_br: A versão do protocolo pickle é detectada automaticamente, portanto, nenhum argumento de protocolo é necessário. Bytes após a representação serializada com pickle do objeto são ignorados.

source: Arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
pt_br: Os argumentos *file*, *fix_imports*, *encoding*, *errors*, *strict* e *buffers* têm o mesmo significado que no construtor construtor :class:`Unpickler`.

source: The *buffers* argument was added.
pt_br: O argumento *buffers* foi adicionado.

source: Return the reconstituted object hierarchy of the pickled representation *data* of an object. *data* must be a :term:`bytes-like object`.
pt_br: Retorna a hierarquia de objeto reconstituído da representação serializada com pickle *data* de um objeto. *data* deve ser um :term:`objeto bytes ou similar`.

source: Arguments *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
pt_br: Os argumentos *fix_imports*, *encoding*, *errors*, *strict* e *buffers* têm o mesmo significado que no construtor construtor :class:`Unpickler`.

source: The :mod:`pickle` module defines three exceptions:
pt_br: O módulo :mod:`pickle` define três exceções:

source: Common base class for the other pickling exceptions. It inherits from :exc:`Exception`.
pt_br: Classe base comum para as outras exceções de serialização com pickle. Herda de :exc:`Exception`.

source: Error raised when an unpicklable object is encountered by :class:`Pickler`. It inherits from :exc:`PickleError`.
pt_br: Erro levantado quando um objeto não serializável com pickle é encontrado por :class:`Pickler`. Herda de :exc:`PickleError`.

source: Refer to :ref:`pickle-picklable` to learn what kinds of objects can be pickled.
pt_br: Consulte :ref:`pickle-picklable` para saber quais tipos de objetos podem ser serializados com pickle.

source: Error raised when there is a problem unpickling an object, such as a data corruption or a security violation. It inherits from :exc:`PickleError`.
pt_br: Erro levantado quando há um problema ao desserializar com pickle um objeto, como dados corrompidos ou violação de segurança. Herda de :exc:`PickleError`.

source: Note that other exceptions may also be raised during unpickling, including (but not necessarily limited to) AttributeError, EOFError, ImportError, and IndexError.
pt_br: Observe que outras exceções também podem ser levantadas durante a desserialização com pickle, incluindo (mas não necessariamente limitado a) AttributeError, EOFError, ImportError e IndexError.

source: The :mod:`pickle` module exports three classes, :class:`Pickler`, :class:`Unpickler` and :class:`PickleBuffer`:
pt_br: O módulo :mod:`pickle` exporta três classes, :class:`Pickler`, :class:`Unpickler` e :class:`PickleBuffer`:

source: This takes a binary file for writing a pickle data stream.
pt_br: Isso leva um arquivo binário a escrever um fluxo de dados pickle.

source: The optional *protocol* argument, an integer, tells the pickler to use the given protocol; supported protocols are 0 to :data:`HIGHEST_PROTOCOL`. If not specified, the default is :data:`DEFAULT_PROTOCOL`. If a negative number is specified, :data:`HIGHEST_PROTOCOL` is selected.
pt_br: O argumento opcional *protocol*, um inteiro, diz ao pickler para usar o protocolo fornecido; os protocolos suportados são de 0 a :data:`HIGHEST_PROTOCOL`. Se não for especificado, o padrão é :data:`DEFAULT_PROTOCOL`. Se um número negativo for especificado, :data:`HIGHEST_PROTOCOL` é selecionado.
