Repository: python/python-docs-pt-br
Catalog: library/pickle.po
Languages: pt_br

source: :meth:`__getnewargs_ex__` is now used in protocols 2 and 3.
pt_br: :meth:`__getnewargs_ex__` é agora usado em protocolos 2 e 3.

source: This method serves a similar purpose as :meth:`__getnewargs_ex__`, but supports only positional arguments. It must return a tuple of arguments ``args`` which will be passed to the :meth:`__new__` method upon unpickling.
pt_br: Este método serve a um propósito semelhante ao de :meth:`__getnewargs_ex__`, mas tem suporte apenas a argumentos posicionais. Ele deve retornar uma tupla de argumentos ``args`` que serão passados para o método :meth:`__new__` após a desserialização com pickle.

source: :meth:`__getnewargs__` will not be called if :meth:`__getnewargs_ex__` is defined.
pt_br: :meth:`__getnewargs__` não será chamado se :meth:`__getnewargs_ex__` estiver definido.

source: Before Python 3.6, :meth:`__getnewargs__` was called instead of :meth:`__getnewargs_ex__` in protocols 2 and 3.
pt_br: Antes do Python 3.6, :meth:`__getnewargs__` era chamado em vez de :meth:`__getnewargs_ex__` nos protocolos 2 e 3.

source: Classes can further influence how their instances are pickled by overriding the method :meth:`__getstate__`. It is called and the returned object is pickled as the contents for the instance, instead of a default state. There are several cases:
pt_br: Classes podem influenciar ainda mais como suas instâncias são serializadas com pickle, substituindo o método :meth:`__getstate__`. Ele é chamado e o objeto retornado é serializado com pickle como o conteúdo da instância, em vez de um estado padrão. Existem vários casos:

source: For a class that has no instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``None``.
pt_br: Para uma classe que não possui instância :attr:`~object.__dict__` e não possui :attr:`~object.__slots__`, o estado padrão é ``None``.

source: For a class that has an instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``self.__dict__``.
pt_br: Para uma classe que não uma possui instância :attr:`~object.__dict__` nem :attr:`~object.__slots__`, o estado padrão é ``self.__dict__``.

source: For a class that has an instance :attr:`~object.__dict__` and :attr:`~object.__slots__`, the default state is a tuple consisting of two dictionaries: ``self.__dict__``, and a dictionary mapping slot names to slot values. Only slots that have a value are included in the latter.
pt_br: Para uma classe que possui uma instância :attr:`~object.__dict__` e :attr:`~object.__slots__`, o estado padrão é uma tupla consistindo de dois dicionários: ``self.__dict__``, e um dicionário de mapeamento de nomes de slot para valores de slot. Apenas os slots que possuem um valor são incluídos neste último.

source: For a class that has :attr:`~object.__slots__` and no instance :attr:`~object.__dict__`, the default state is a tuple whose first item is ``None`` and whose second item is a dictionary mapping slot names to slot values described in the previous bullet.
pt_br: Para uma classe que possui :attr:`~object.__slots__` e nenhuma :attr:`~object.__dict__` de instância, o estado padrão é uma tupla cujo primeiro item é ``None`` e cujo segundo item é um dicionário mapeando os nomes dos slots para os valores dos slots descritos no tópico anterior.

source: Added the default implementation of the ``__getstate__()`` method in the :class:`object` class.
pt_br: Adicionada a implementação padrão do método ``__getstate__()`` na classe :class:`objeto`.

source: Upon unpickling, if the class defines :meth:`__setstate__`, it is called with the unpickled state. In that case, there is no requirement for the state object to be a dictionary. Otherwise, the pickled state must be a dictionary and its items are assigned to the new instance's dictionary.
pt_br: Ao desserializar com pickle, se a classe define :meth:`__setstate__`, ela é chamada com o estado não desserializado. Nesse caso, não há nenhum requisito para que o objeto de estado seja um dicionário. Caso contrário, o estado serializado com pickle deve ser um dicionário e seus itens são atribuídos ao dicionário da nova instância.

source: If :meth:`__reduce__` returns a state with value ``None`` at pickling, the :meth:`__setstate__` method will not be called upon unpickling.
pt_br: Se :meth:`__reduce__` retorna um estado com valor ``None`` na serialização com pickle, o método :meth:`__setstate__` não será chamado quando da desserialização com pickle.

source: Refer to the section :ref:`pickle-state` for more information about how to use the methods :meth:`~object.__getstate__` and :meth:`~object.__setstate__`.
pt_br: Confira a seção :ref:`pickle-state` para mais informações sobre como usar os métodos :meth:`~object.__getstate__` e :meth:`~object.__setstate__`.

source: At unpickling time, some methods like :meth:`~object.__getattr__`, :meth:`~object.__getattribute__`, or :meth:`~object.__setattr__` may be called upon the instance. In case those methods rely on some internal invariant being true, the type should implement :meth:`~object.__new__` to establish such an invariant, as :meth:`~object.__init__` is not called when unpickling an instance.
pt_br: Quando da desserialização com pickle, alguns métodos, como :meth:`~object.__getattr__`, :meth:`~object.__getattribute__` ou :meth:`~object.__setattr__`, podem ser chamados na instância. No caso desses métodos dependerem de alguma invariante interna ser verdadeira, o tipo deve ser implementado :meth:`~object.__new__` para estabelecer tal invariante, pois :meth:`~object.__init__` não é chamada quando da desserialização com pickle em uma instância.

source: As we shall see, pickle does not use directly the methods described above. In fact, these methods are part of the copy protocol which implements the :meth:`~object.__reduce__` special method. The copy protocol provides a unified interface for retrieving the data necessary for pickling and copying objects. [#]_
pt_br: Como veremos, o pickle não usa diretamente os métodos descritos acima. Na verdade, esses métodos são parte do protocolo de cópia que implementa o método especial :meth:`~object.__reduce__`. O protocolo de cópia fornece uma interface unificada para recuperar os dados necessários para serialização com pickle e cópia de objetos. [#]_

source: Although powerful, implementing :meth:`~object.__reduce__` directly in your classes is error prone. For this reason, class designers should use the high-level interface (i.e., :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` and :meth:`~object.__setstate__`) whenever possible. We will show, however, cases where using :meth:`!__reduce__` is the only option or leads to more efficient pickling or both.
pt_br: Apesar de poderoso, implementar :meth:`~object.__reduce__` diretamente em sua classe é algo propenso a erro. Por este motivo, designers de classe devem usar a interface de alto nível (ou seja, :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` e :meth:`~object.__setstate__`) sempre que possível. Vamos mostrar, porém, casos em que o uso de :meth:`!__reduce__` é a única opção ou leva a uma serialização com pickle mais eficiente, ou as ambas.

source: The interface is currently defined as follows. The :meth:`__reduce__` method takes no argument and shall return either a string or preferably a tuple (the returned object is often referred to as the "reduce value").
pt_br: A interface está atualmente definida da seguinte maneira. O método :meth:`__reduce__` não aceita nenhum argumento e deve retornar uma string ou preferencialmente uma tupla (o objeto retornado é frequentemente referido como o "valor de redução").

source: If a string is returned, the string should be interpreted as the name of a global variable. It should be the object's local name relative to its module; the pickle module searches the module namespace to determine the object's module. This behaviour is typically useful for singletons.
pt_br: Se uma string é retornada, ela deve ser interpretada como o nome de uma variável global. Deve ser o nome local do objeto relativo ao seu módulo; o módulo pickle pesquisa o espaço de nomes do módulo para determinar o módulo do objeto. Esse comportamento é normalmente útil para singletons.

source: When a tuple is returned, it must be between two and six items long. Optional items can either be omitted, or ``None`` can be provided as their value. The semantics of each item are in order:
pt_br: Quando uma tupla é retornada, ela deve ter entre dois e seis itens. Os itens opcionais podem ser omitidos ou ``None`` pode ser fornecido como seu valor. A semântica de cada item está em ordem:

source: A callable object that will be called to create the initial version of the object.
pt_br: Um objeto chamável que será chamado para criar a versão inicial do objeto.

source: A tuple of arguments for the callable object. An empty tuple must be given if the callable does not accept any argument.
pt_br: Uma tupla de argumentos para o objeto chamável. Uma tupla vazia deve ser fornecida se o chamável não aceitar nenhum argumento.

source: Optionally, the object's state, which will be passed to the object's :meth:`__setstate__` method as previously described. If the object has no such method then, the value must be a dictionary and it will be added to the object's :attr:`~object.__dict__` attribute.
pt_br: Opcionalmente, o estado do objeto, que será passado para o método :meth:`__setstate__` do objeto conforme descrito anteriormente. Se o objeto não tiver tal método, o valor deve ser um dicionário e será adicionado ao atributo :attr:`~object.__dict__` do objeto.

source: Optionally, an iterator (and not a sequence) yielding successive items. These items will be appended to the object either using ``obj.append(item)`` or, in batch, using ``obj.extend(list_of_items)``. This is primarily used for list subclasses, but may be used by other classes as long as they have :ref:`append and extend methods <typesseq-common>` with the appropriate signature. (Whether :meth:`!append` or :meth:`!extend` is used depends on which pickle protocol version is used as well as the number of items to append, so both must be supported.)
pt_br: Opcionalmente, um iterador (e não uma sequência) produzindo itens sucessivos. Esses itens serão anexados ao objeto usando ``obj.append(item)`` ou, em lote, usando ``obj.extend(list_of_items)``. Isso é usado principalmente para subclasses de lista, mas pode ser usado por outras classes, desde que tenham os :ref:`métodos append e extend <typesseq-common>` com a assinatura apropriada. (Se :meth:`!append` ou :meth:`!extend` é usado depende de qual versão do protocolo pickle é usada, bem como o número de itens a anexar, então ambos devem ser suportados.)

source: Optionally, an iterator (not a sequence) yielding successive key-value pairs. These items will be stored to the object using ``obj[key] = value``. This is primarily used for dictionary subclasses, but may be used by other classes as long as they implement :meth:`__setitem__`.
pt_br: Opcionalmente, um iterador (não uma sequência) produzindo pares de valor-chave sucessivos. Esses itens serão armazenados no objeto usando ``obj[chave]=valor``. Isso é usado principalmente para subclasses de dicionário, mas pode ser usado por outras classes, desde que implementem :meth:`__setitem__`.

source: Optionally, a callable with a ``(obj, state)`` signature. This callable allows the user to programmatically control the state-updating behavior of a specific object, instead of using ``obj``'s static :meth:`__setstate__` method. If not ``None``, this callable will have priority over ``obj``'s :meth:`__setstate__`.
pt_br: Opcionalmente, um chamável com uma assinatura ``(obj, estado)``. Este chamável permite ao usuário controlar programaticamente o comportamento de atualização de estado de um objeto específico, ao invés de usar o método estático :meth:`__setstate__` de ``obj``. Se não for ``None``, este chamável terá prioridade sobre o :meth:`__setstate__` de ``obj``.

source: The optional sixth tuple item, ``(obj, state)``, was added.
pt_br: O sexto item opcional de tupla, ``(obj, estado)``, foi adicionado.

source: Alternatively, a :meth:`__reduce_ex__` method may be defined. The only difference is this method should take a single integer argument, the protocol version. When defined, pickle will prefer it over the :meth:`__reduce__` method. In addition, :meth:`__reduce__` automatically becomes a synonym for the extended version. The main use for this method is to provide backwards-compatible reduce values for older Python releases.
pt_br: Alternativamente, um método :meth:`__reduce_ex__` pode ser definido. A única diferença é que este método deve ter um único argumento inteiro, a versão do protocolo. Quando definido, pickle irá preferir isso ao método :meth:`__reduce__`. Além disso, :meth:`__reduce__` automaticamente se torna um sinônimo para a versão estendida. O principal uso desse método é fornecer valores de redução com compatibilidade reversa para versões mais antigas do Python.

source: Persistence of External Objects
pt_br: Persistência de objetos externos

source: For the benefit of object persistence, the :mod:`pickle` module supports the notion of a reference to an object outside the pickled data stream. Such objects are referenced by a persistent ID, which should be either a string of alphanumeric characters (for protocol 0) [#]_ or just an arbitrary object (for any newer protocol).
pt_br: Para o benefício da persistência do objeto, o módulo :mod:`pickle` tem suporte à noção de uma referência a um objeto fora do fluxo de dados serializados com pickle. Esses objetos são referenciados por um ID persistente, que deve ser uma string de caracteres alfanuméricos (para o protocolo 0) [#]_ ou apenas um objeto arbitrário (para qualquer protocolo mais recente).

source: The resolution of such persistent IDs is not defined by the :mod:`pickle` module; it will delegate this resolution to the user-defined methods on the pickler and unpickler, :meth:`~Pickler.persistent_id` and :meth:`~Unpickler.persistent_load` respectively.
pt_br: A resolução de tais IDs persistentes não é definida pelo módulo :mod:`pickle`; ele vai delegar esta resolução aos métodos definidos pelo usuário no selecionador e no separador, :meth:`~Pickler.persistent_id` e :meth:`~Unpickler.persistent_load` respectivamente.

source: To pickle objects that have an external persistent ID, the pickler must have a custom :meth:`~Pickler.persistent_id` method that takes an object as an argument and returns either ``None`` or the persistent ID for that object. When ``None`` is returned, the pickler simply pickles the object as normal. When a persistent ID string is returned, the pickler will pickle that object, along with a marker so that the unpickler will recognize it as a persistent ID.
pt_br: Para serializar com pickle objetos que têm um ID externo persistente, o pickler deve ter um método :meth:`~Pickler.persistent_id` personalizado que recebe um objeto como um argumento e retorna ``None`` ou o ID persistente para esse objeto. Quando ``None`` é retornado, o pickler simplesmente serializa o objeto normalmente. Quando uma string de ID persistente é retornada, o pickler serializa aquele objeto, junto com um marcador para que o unpickler o reconheça como um ID persistente.

source: To unpickle external objects, the unpickler must have a custom :meth:`~Unpickler.persistent_load` method that takes a persistent ID object and returns the referenced object.
pt_br: Para desserializar com pickle objetos externos, o unpickler deve ter um método :meth:`~Unpickler.persistent_load` personalizado que recebe um objeto de ID persistente e retorna o objeto referenciado.

source: Here is a comprehensive example presenting how persistent ID can be used to pickle external objects by reference.
pt_br: Aqui está um exemplo abrangente que apresenta como o ID persistente pode ser usado para serializar com pickle objetos externos por referência.

source: # Simple example presenting how persistent ID can be used to pickle # external objects by reference. import pickle import sqlite3 from collections import namedtuple # Simple class representing a record in our database. MemoRecord = namedtuple("MemoRecord", "key, task") class DBPickler(pickle.Pickler): def persistent_id(self, obj): # Instead of pickling MemoRecord as a regular class instance, we emit a # persistent ID. if isinstance(obj, MemoRecord): # Here, our persistent ID is simply a tuple, containing a tag and a # key, which refers to a specific record in the database. return ("MemoRecord", obj.key) else: # If obj does not have a persistent ID, return None. This means obj # needs to be pickled as usual. return None class DBUnpickler(pickle.Unpickler): def __init__(self, file, connection): super().__init__(file) self.connection = connection def persistent_load(self, pid): # This method is invoked whenever a persistent ID is encountered. # Here, pid is the tuple returned by DBPickler. cursor = self.connection.cursor() type_tag, key_id = pid if type_tag == "MemoRecord": # Fetch the referenced record from the database and return it. cursor.execute("SELECT * FROM memos WHERE key=?", (str(key_id),)) key, task = cursor.fetchone() return MemoRecord(key, task) else: # Always raises an error if you cannot return the correct object. # Otherwise, the unpickler will think None is the object referenced # by the persistent ID. raise pickle.UnpicklingError("unsupported persistent object") def main(): import io import pprint # Initialize and populate our database. conn = sqlite3.connect(":memory:") cursor = conn.cursor() cursor.execute("CREATE TABLE memos(key INTEGER PRIMARY KEY, task TEXT)") tasks = ( 'give food to fish', 'prepare group meeting', 'fight with a zebra', ) for task in tasks: cursor.execute("INSERT INTO memos VALUES(NULL, ?)", (task,)) # Fetch the records to be pickled. cursor.execute("SELECT * FROM memos") memos = [MemoRecord(key, task) for key, task in cursor] # Save the records using our custom DBPickler. file = io.BytesIO() DBPickler(file).dump(memos) print("Pickled records:") pprint.pprint(memos) # Update a record, just for good measure. cursor.execute("UPDATE memos SET task='learn italian' WHERE key=1") # Load the records from the pickle data stream. file.seek(0) memos = DBUnpickler(file, conn).load() print("Unpickled records:") pprint.pprint(memos) if __name__ == '__main__': main()
pt_br: # Exemplo simples que mostra como o ID persistente pode ser usado # serializar com pickle objetos externos por referência. import pickle import sqlite3 from collections import namedtuple # Classe simples que representa um registro em nosso banco de dados. MemoRecord = namedtuple("MemoRecord", "key, task") class DBPickler(pickle.Pickler): def persistent_id(self, obj): # Em vez de conservar MemoRecord como uma instância de classe regular, # emitimos um ID persistente. if isinstance(obj, MemoRecord): # Aqui, nosso ID persistente é simplesmente uma tupla, contendo # uma tag e uma chave, que se refere a um registro específico # no banco de dados. return ("MemoRecord", obj.key) else: # Se obj não tiver um ID persistente, retorna None. Significa que # obj precisa ser conservado como de costume. return None class DBUnpickler(pickle.Unpickler): def __init__(self, file, connection): super().__init__(file) self.connection = connection def persistent_load(self, pid): # Este método é invocado sempre que um ID persistente é encontrado. # Aqui, pid é a tupla retornada por DBPickler. cursor = self.connection.cursor() type_tag, key_id = pid if type_tag == "MemoRecord": # Busca o registro referenciado no banco de dados e retorna-o. cursor.execute("SELECT * FROM memos WHERE key=?", (str(key_id),)) key, task = cursor.fetchone() return MemoRecord(key, task) else: # Sempre levanta um erro se você puder retornar o objeto correto. # Caso contrário, a desserialização com pickle considerará que # None é o objeto referenciado pelo ID persistente. raise pickle.UnpicklingError("unsupported persistent object") def main(): import io import pprint # Inicializa e popula nosso banco de dados. conn = sqlite3.connect(":memory:") cursor = conn.cursor() cursor.execute("CREATE TABLE memos(key INTEGER PRIMARY KEY, task TEXT)") tasks = ( 'give food to fish', 'prepare group meeting', 'fight with a zebra', ) for task in tasks: cursor.execute("INSERT INTO memos VALUES(NULL, ?)", (task,)) # Busca os registros a serem serializados com pickle. cursor.execute("SELECT * FROM memos") memos = [MemoRecord(key, task) for key, task in cursor] # Salva os registros usando nosso DBPickler personalizado. file = io.BytesIO() DBPickler(file).dump(memos) print("Pickled records:") pprint.pprint(memos) # Atualiza um registro, só por precaução. cursor.execute("UPDATE memos SET task='learn italian' WHERE key=1") # Carrega os registros do fluxo de dados pickle. file.seek(0) memos = DBUnpickler(file, conn).load() print("Unpickled records:") pprint.pprint(memos) if __name__ == '__main__': main()

source: Dispatch Tables
pt_br: Tabelas de despacho

source: If one wants to customize pickling of some classes without disturbing any other code which depends on pickling, then one can create a pickler with a private dispatch table.
pt_br: Se alguém quiser personalizar a serialização com pickle de algumas classes sem perturbar nenhum outro código que dependa da serialização, pode-se criar um pickler com uma tabela de despacho privada.

source: The global dispatch table managed by the :mod:`copyreg` module is available as :data:`!copyreg.dispatch_table`. Therefore, one may choose to use a modified copy of :data:`!copyreg.dispatch_table` as a private dispatch table.
pt_br: A tabela de despacho global gerenciada pelo módulo :mod:`copyreg` está disponível como :data:`!copyreg.dispatch_table`. Portanto, pode-se escolher usar uma cópia modificada de :data:`!copyreg.dispatch_table` como uma tabela de despacho privada.

source: For example ::
pt_br: Por exemplo ::

source: creates an instance of :class:`pickle.Pickler` with a private dispatch table which handles the ``SomeClass`` class specially. Alternatively, the code ::
pt_br: cria uma instância de :class:`pickle.Pickler` com uma tabela de despacho privada que trata a classe ``SomeClass`` especialmente. Alternativamente, o código ::

source: does the same but all instances of ``MyPickler`` will by default share the private dispatch table. On the other hand, the code ::
pt_br: faz o mesmo, mas todas as instâncias de ``MyPickler`` compartilharão por padrão a tabela de despacho privada. Por outro lado, o código ::

source: modifies the global dispatch table shared by all users of the :mod:`copyreg` module.
pt_br: modifica a tabela de despacho global compartilhada por todos os usuários do módulo :mod:`copyreg`.

source: Handling Stateful Objects
pt_br: Manipulação de objetos com estado
