Repository: python/python-docs-pt-br
Catalog: library/pickle.po
Languages: pt_br

source: Indexed databases of objects; uses :mod:`pickle`.
pt_br: Banco de dados indexado de objetos; usa :mod:`pickle`.

source: Module :mod:`copy`
pt_br: Módulo :mod:`copy`

source: Shallow and deep object copying.
pt_br: Cópia rasa e cópia profunda de objeto.

source: Module :mod:`marshal`
pt_br: Módulo :mod:`marshal`

source: High-performance serialization of built-in types.
pt_br: Serialização de alto desempenho de tipos embutidos.

source: Footnotes
pt_br: Notas de rodapé

source: Don't confuse this with the :mod:`marshal` module
pt_br: Não confunda isso com o módulo :mod:`marshal`

source: This is why :keyword:`lambda` functions cannot be pickled: all :keyword:`!lambda` functions share the same name: ``<lambda>``.
pt_br: É por isso que funções :keyword:`lambda` não podem ser serializadas com pickle: todas as funções :keyword:`!lambda` compartilham o mesmo nome: ``<lambda>``.

source: The exception raised will likely be an :exc:`ImportError` or an :exc:`AttributeError` but it could be something else.
pt_br: A exceção levantada provavelmente será uma :exc:`ImportError` ou uma :exc:`AttributeError`, mas poderia ser outra coisa.

source: The :mod:`copy` module uses this protocol for shallow and deep copying operations.
pt_br: O módulo :mod:`copy` usa este protocolo para operações de cópia rasa e cópia profunda.

source: The limitation on alphanumeric characters is due to the fact that persistent IDs in protocol 0 are delimited by the newline character. Therefore if any kind of newline characters occurs in persistent IDs, the resulting pickled data will become unreadable.
pt_br: A limitação de caracteres alfanuméricos se deve ao fato de que os IDs persistentes, no protocolo 0, serem delimitados pelo caractere de nova linha. Portanto, se qualquer tipo de caractere de nova linha ocorrer em IDs persistentes, os dados resultantes da serialização com pickle se tornarão ilegíveis.

source: persistence
pt_br: persistência

source: persistent
pt_br: persistente

source: objects
pt_br: objetos

source: serializing
pt_br: serialização

source: protocol
pt_br: protocolo

source: persistent_id (pickle protocol)
pt_br: persistent_id (protocolo pickle)

source: persistent_load (pickle protocol)
pt_br: persistent_load (protocolo pickle)

source: __getstate__() (copy protocol)
pt_br: __getstate__() (protocolo de cópia)

source: __setstate__() (copy protocol)
pt_br: __setstate__() (protocolo de cópia)

source: find_class() (pickle protocol)
pt_br: find_class() (protocolo pickle)
