Repository: python/python-docs-pt-br
Catalog: library/platform.po
Languages: pt_br

source: :mod:`!platform` --- Access to underlying platform's identifying data
pt_br: :mod:`!platform` --- Acesso aos dados de identificação da plataforma subjacente

source: **Source code:** :source:`Lib/platform.py`
pt_br: **Código-fonte:** :source:`Lib/platform.py`

source: Specific platforms listed alphabetically, with Linux included in the Unix section.
pt_br: Plataformas específicas listadas em ordem alfabética, com Linux incluído na seção Unix.

source: Cross platform
pt_br: Multiplataforma

source: Queries the given executable (defaults to the Python interpreter binary) for various architecture information.
pt_br: Consulta o executável fornecido (o padrão é o binário do interpretador Python) para obter várias informações de arquitetura.

source: Returns a tuple ``(bits, linkage)`` which contain information about the bit architecture and the linkage format used for the executable. Both values are returned as strings.
pt_br: Retorna uma tupla ``(bits, linkage)`` que contém informações sobre a arquitetura de bits e o formato de linkage usado para o executável. Ambos os valores são retornados como strings.

source: Values that cannot be determined are returned as given by the parameter presets. If bits is given as ``''``, the ``sizeof(pointer)`` (or ``sizeof(long)`` on Python version < 1.5.2) is used as indicator for the supported pointer size.
pt_br: Valores que não podem ser determinados são retornados como fornecidos pelas predefinições de parâmetros. Se bits for fornecido como ``''``, o ``sizeof(pointer)`` (ou ``sizeof(long)`` na versão Python < 1.5.2) é usado como indicador para o tamanho de ponteiro suportado.

source: The function relies on the system's :file:`file` command to do the actual work. This is available on most if not all Unix platforms and some non-Unix platforms and then only if the executable points to the Python interpreter. Reasonable defaults are used when the above needs are not met.
pt_br: A função depende do comando :file:`file` do sistema para fazer o trabalho real. Isso está disponível na maioria, se não em todas as plataformas Unix e algumas plataformas não Unix e somente se o executável apontar para o interpretador Python. Padrões razoáveis são usados quando as necessidades acima não são atendidas.

source: On macOS (and perhaps other platforms), executable files may be universal files containing multiple architectures.
pt_br: No macOS (e talvez em outras plataformas), arquivos executáveis podem ser arquivos universais contendo diversas arquiteturas.

source: To get at the "64-bitness" of the current interpreter, it is more reliable to query the :data:`sys.maxsize` attribute::
pt_br: Para obter a "característica de 64 bits" do interpretador atual, é mais confiável consultar o atributo :data:`sys.maxsize`::

source: Returns the machine type, e.g. ``'AMD64'``. An empty string is returned if the value cannot be determined.
pt_br: Retorna o tipo de máquina, por exemplo, ``'AMD64'``. Uma string vazia é retornada se o valor não puder ser determinado.

source: Returns the computer's network name (may not be fully qualified!). An empty string is returned if the value cannot be determined.
pt_br: Retorna o nome de rede do computador (pode não ser totalmente qualificado!). Uma string vazia é retornada se o valor não puder ser determinado.

source: Returns a single string identifying the underlying platform with as much useful information as possible.
pt_br: Retorna uma única string identificando a plataforma subjacente com o máximo de informações úteis possível.

source: The output is intended to be *human readable* rather than machine parseable. It may look different on different platforms and this is intended.
pt_br: A saída é pretendida para ser *legível por humanos* em vez de analisável por máquinas. Pode parecer diferente em diferentes plataformas e isso é intencional.

source: If *aliased* is true, the function will use aliases for various platforms that report system names which differ from their common names, for example SunOS will be reported as Solaris. The :func:`system_alias` function is used to implement this.
pt_br: Se *aliased* for true, a função usará apelidos para várias plataformas que relatam nomes de sistemas que diferem de seus nomes comuns, por exemplo, SunOS será relatado como Solaris. A função :func:`system_alias` é usada para implementar isso.

source: Setting *terse* to true causes the function to return only the absolute minimum information needed to identify the platform.
pt_br: Definir *terse* como true faz com que a função retorne apenas o mínimo absoluto de informações necessárias para identificar a plataforma.

source: On macOS, the function now uses :func:`mac_ver`, if it returns a non-empty release string, to get the macOS version rather than the darwin version.
pt_br: No macOS, a função agora usa :func:`mac_ver`, se retornar uma string de versão não vazia, para obter a versão do macOS em vez da versão do darwin.

source: Returns the (real) processor name, e.g. ``'amdk6'``.
pt_br: Retorna o nome (real) do processador, por exemplo ``'amdk6'``.

source: An empty string is returned if the value cannot be determined. Note that many platforms do not provide this information or simply return the same value as for :func:`machine`. NetBSD does this.
pt_br: Uma string vazia é retornada se o valor não puder ser determinado. Note que muitas plataformas não fornecem essas informações ou simplesmente retornam o mesmo valor que para :func:`machine`. O NetBSD faz isso.

source: Returns a tuple ``(buildno, builddate)`` stating the Python build number and date as strings.
pt_br: Retorna uma tupla ``(buildno, builddate)`` informando o número e a data da construção do Python como strings.

source: Returns a string identifying the compiler used for compiling Python.
pt_br: Retorna uma string identificando o compilador usado para compilar Python.

source: Returns a string identifying the Python implementation SCM branch.
pt_br: Retorna uma string identificando a branch SCM da implementação do Python.

source: Returns a string identifying the Python implementation. Possible return values are: 'CPython', 'IronPython', 'Jython', 'PyPy'.
pt_br: Retorna uma string identificando a implementação do Python. Os valores de retorno possíveis são: 'CPython', 'IronPython', 'Jython', 'PyPy'.

source: Returns a string identifying the Python implementation SCM revision.
pt_br: Retorna uma string que identifica a revisão do SCM da implementação Python.

source: Returns the Python version as string ``'major.minor.patchlevel'``.
pt_br: Retorna a versão do Python como string ``'major.minor.patchlevel'``.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to 0).
pt_br: Observe que, diferentemente do ``sys.version`` do Python, o valor retornado sempre incluirá o patchlevel (o padrão é 0).

source: Returns the Python version as tuple ``(major, minor, patchlevel)`` of strings.
pt_br: Retorna a versão do Python como tupla ``(major, minor, patchlevel)`` de strings.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to ``'0'``).
pt_br: Observe que, diferentemente do ``sys.version`` do Python, o valor retornado sempre incluirá o patchlevel (o padrão é ``'0'``).

source: Returns the system's release, e.g. ``'2.2.0'`` or ``'NT'``. An empty string is returned if the value cannot be determined.
pt_br: Retorna a versão do sistema, por exemplo, ``'2.2.0'`` ou ``'NT'``. Uma string vazia é retornada se o valor não puder ser determinado.

source: Returns the system/OS name, such as ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. An empty string is returned if the value cannot be determined.
pt_br: Retorna o nome do sistema/SO, como ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. Uma string vazia é retornada se o valor não puder ser determinado.

source: On iOS and Android, this returns the user-facing OS name (i.e, ``'iOS``, ``'iPadOS'`` or ``'Android'``). To obtain the kernel name (``'Darwin'`` or ``'Linux'``), use :func:`os.uname`.
pt_br: No iOS e Android, isso retorna o nome do SO voltado para o usuário (por exemplo, ``'iOS``, ``'iPadOS'`` ou ``'Android'``). Para obter o nome do kernel (``'Darwin'`` ou ``'Linux'``), use :func:`os.uname`.

source: Returns ``(system, release, version)`` aliased to common marketing names used for some systems. It also does some reordering of the information in some cases where it would otherwise cause confusion.
pt_br: Retorna ``(sistema, release, versão)`` com apelido para nomes comuns de marketing usados para alguns sistemas. Ele também faz alguma reordenação das informações em alguns casos em que, de outra forma, causaria confusão.

source: Returns the system's release version, e.g. ``'#3 on degas'``. An empty string is returned if the value cannot be determined.
pt_br: Retorna a versão de lançamento do sistema, por exemplo, ``'#3 on degas'``. Uma string vazia é retornada se o valor não puder ser determinado.

source: On iOS and Android, this is the user-facing OS version. To obtain the Darwin or Linux kernel version, use :func:`os.uname`.
pt_br: No iOS e Android, esta é a versão do SO voltada para o usuário. Para obter a versão do kernel Darwin ou Linux, use :func:`os.uname`.

source: Fairly portable uname interface. Returns a :func:`~collections.namedtuple` containing six attributes: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine`, and :attr:`processor`.
pt_br: Interface para uname razoavelmente portátil. Retorna um :func:`~collections.namedtuple` contendo seis atributos: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine` e :attr:`processor`.

source: :attr:`processor` is resolved late, on demand.
pt_br: :attr:`processor` é resolvido tardiamente, sob demanda.

source: Entries which cannot be determined are set to ``''``.
pt_br: As entradas que não podem ser determinadas são definidas como ``''``.

source: Result changed from a tuple to a :func:`~collections.namedtuple`.
pt_br: O resultado mudou de uma tupla para :func:`~collections.namedtuple`.

source: :attr:`processor` is resolved late instead of immediately.
pt_br: :attr:`processor` é resolvido tarde em vez de imediatamente.

source: Java platform
pt_br: Plataforma Java

source: Version interface for Jython.
pt_br: Interface de versão para Jython.

source: Returns a tuple ``(release, vendor, vminfo, osinfo)`` with *vminfo* being a tuple ``(vm_name, vm_release, vm_vendor)`` and *osinfo* being a tuple ``(os_name, os_version, os_arch)``. Values which cannot be determined are set to the defaults given as parameters (which all default to ``''``).
pt_br: Retorna uma tupla ``(release, vendor, vminfo, osinfo)`` com *vminfo* sendo uma tupla ``(vm_name, vm_release, vm_vendor)`` e *osinfo* sendo uma tupla ``(os_name, os_version, os_arch)``. Valores que não podem ser determinados são definidos para os padrões fornecidos como parâmetros (que são todos padrão para ``''``).

source: It was largely untested, had a confusing API, and was only useful for Jython support.
pt_br: Ele não foi testado em grande parte, tinha uma API confusa e só era útil para suporte ao Jython.

source: Windows platform
pt_br: Plataforma Windows

source: Get additional version information from the Windows Registry and return a tuple ``(release, version, csd, ptype)`` referring to OS release, version number, CSD level (service pack) and OS type (multi/single processor). Values which cannot be determined are set to the defaults given as parameters (which all default to an empty string).
pt_br: Obtém informações adicionais sobre a versão do Registro do Windows e retorna uma tupla ``(release, version, csd, ptype)`` referente à versão do SO, número da versão, nível do CSD (service pack) e tipo de sistema operacional (processador múltiplo/único). Os valores que não podem ser determinados são definidos para os padrões fornecidos como parâmetros (que são todos padrão para uma string vazia).

source: As a hint: *ptype* is ``'Uniprocessor Free'`` on single processor NT machines and ``'Multiprocessor Free'`` on multi processor machines. The ``'Free'`` refers to the OS version being free of debugging code. It could also state ``'Checked'`` which means the OS version uses debugging code, i.e. code that checks arguments, ranges, etc.
pt_br: Como dica: *ptype* é ``'Uniprocessor Free'`` em máquinas NT de processador único e ``'Multiprocessor Free'`` em máquinas de multiprocessador. O ``'Free'`` se refere à versão do sistema operacional que está livre de código de depuração. Ele também pode declarar ``'Checked'``, o que significa que a versão do sistema operacional usa código de depuração, ou seja, código que verifica argumentos, intervalos, etc.

source: Returns a string representing the current Windows edition, or ``None`` if the value cannot be determined. Possible values include but are not limited to ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'``, and ``'nanoserver'``.
pt_br: Retorna uma string representando a edição atual do Windows, ou ``None`` se o valor não puder ser determinado. Os valores possíveis incluem, mas não estão limitados a ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'`` e ``'nanoserver'``.

source: Return ``True`` if the Windows edition returned by :func:`win32_edition` is recognized as an IoT edition.
pt_br: Retorna ``True`` se a edição do Windows retornada por :func:`win32_edition` for reconhecida como uma edição IoT.

source: macOS platform
pt_br: Plataforma macOS

source: Get macOS version information and return it as tuple ``(release, versioninfo, machine)`` with *versioninfo* being a tuple ``(version, dev_stage, non_release_version)``.
pt_br: Obtém informações sobre a versão do macOS e retorna-as como tupla ``(release, versioninfo, machine)``, sendo *versioninfo* uma tupla ``(version, dev_stage, non_release_version)``.

source: Entries which cannot be determined are set to ``''``. All tuple entries are strings.
pt_br: Entradas que não podem ser determinadas são definidas como ``''``. Todas as entradas de tupla são strings.

source: iOS platform
pt_br: Plataforma iOS

source: Get iOS version information and return it as a :func:`~collections.namedtuple` with the following attributes:
pt_br: Obtém informações sobre a versão do iOS e retorna-as como :func:`~collections.namedtuple` com os seguintes atributos:

source: ``system`` is the OS name; either ``'iOS'`` or ``'iPadOS'``.
pt_br: ``system`` é o nome do sistema operacional; ``'iOS'`` ou ``'iPadOS'``.

source: ``release`` is the iOS version number as a string (e.g., ``'17.2'``).
pt_br: ``release`` é o número da versão do iOS como uma string (por exemplo, ``'17.2'``).

source: ``model`` is the device model identifier; this will be a string like ``'iPhone13,2'`` for a physical device, or ``'iPhone'`` on a simulator.
pt_br: ``model`` é o identificador do modelo do dispositivo; será uma string como ``'iPhone13,2'`` para um dispositivo físico ou ``'iPhone'`` em um simulador.

source: ``is_simulator`` is a boolean describing if the app is running on a simulator or a physical device.
pt_br: ``is_simulator`` é um booleano que descreve se o aplicativo está sendo executado em um simulador ou em um dispositivo físico.

source: Entries which cannot be determined are set to the defaults given as parameters.
pt_br: As entradas que não podem ser determinadas são definidas para os padrões fornecidos como parâmetros.

source: Unix platforms
pt_br: Plataformas Unix

source: Tries to determine the libc version against which the file executable (defaults to the Python interpreter) is linked. Returns a tuple of strings ``(lib, version)`` which default to the given parameters in case the lookup fails.
pt_br: Tenta determinar a versão libc contra a qual o executável do arquivo (padrão para o interpretador Python) está vinculado. Retorna uma tupla de strings ``(lib, version)`` que tem como padrão os parâmetros fornecidos caso a pesquisa falhe.

source: Note that this function has intimate knowledge of how different libc versions add symbols to the executable is probably only usable for executables compiled using :program:`gcc`.
pt_br: Observe que esta função tem conhecimento profundo de como diferentes versões da libc adicionam símbolos ao executável e provavelmente só pode ser usada para executáveis compilados usando :program:`gcc`.

source: The file is read and scanned in chunks of *chunksize* bytes.
pt_br: O arquivo é lido e escaneado em blocos de *chunksize* bytes.

source: Linux platforms
pt_br: Plataformas Linux

source: Get operating system identification from ``os-release`` file and return it as a dict. The ``os-release`` file is a `freedesktop.org standard <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ and is available in most Linux distributions. A noticeable exception is Android and Android-based distributions.
pt_br: Obtém a identificação do sistema operacional do arquivo ``os-release`` e retorna-a como um dict. O arquivo ``os-release`` é um `padrão freedesktop.org <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ e está disponível na maioria das distribuições Linux. Uma exceção notável é o Android e as distribuições baseadas em Android.

source: Raises :exc:`OSError` or subclass when neither ``/etc/os-release`` nor ``/usr/lib/os-release`` can be read.
pt_br: Levanta :exc:`OSError` ou subclasse quando nem ``/etc/os-release`` nem ``/usr/lib/os-release`` podem ser lidos.

source: On success, the function returns a dictionary where keys and values are strings. Values have their special characters like ``"`` and ``$`` unquoted. The fields ``NAME``, ``ID``, and ``PRETTY_NAME`` are always defined according to the standard. All other fields are optional. Vendors may include additional fields.
pt_br: Em caso de sucesso, a função retorna um dicionário onde chaves e valores são strings. Valores têm seus caracteres especiais como ``"`` e ``$`` sem aspas. Os campos ``NAME``, ``ID`` e ``PRETTY_NAME`` são sempre definidos de acordo com o padrão. Todos os outros campos são opcionais. Os fornecedores podem incluir campos adicionais.

source: Note that fields like ``NAME``, ``VERSION``, and ``VARIANT`` are strings suitable for presentation to users. Programs should use fields like ``ID``, ``ID_LIKE``, ``VERSION_ID``, or ``VARIANT_ID`` to identify Linux distributions.
pt_br: Note que campos como ``NAME``, ``VERSION`` e ``VARIANT`` são strings adequadas para apresentação aos usuários. Os programas devem usar campos como ``ID``, ``ID_LIKE``, ``VERSION_ID`` ou ``VARIANT_ID`` para identificar distribuições Linux.

source: Example::
pt_br: Exemplo::

source: def get_like_distro(): info = platform.freedesktop_os_release() ids = [info["ID"]] if "ID_LIKE" in info: # ids are space separated and ordered by precedence ids.extend(info["ID_LIKE"].split()) return ids
pt_br: def get_like_distro(): info = platform.freedesktop_os_release() ids = [info["ID"]] if "ID_LIKE" in info: # ids são separados por espaço e ordenado por precedência ids.extend(info["ID_LIKE"].split()) return ids

source: Android platform
pt_br: Plataforma Android

source: Get Android device information. Returns a :func:`~collections.namedtuple` with the following attributes. Values which cannot be determined are set to the defaults given as parameters.
pt_br: Obtém informações do dispositivo Android. Retorna um :func:`~collections.namedtuple` com os seguintes atributos. Valores que não podem ser determinados são definidos para os padrões fornecidos como parâmetros.

source: ``release`` - Android version, as a string (e.g. ``"14"``).
pt_br: ``release`` - Versão do Android, como uma string (por exemplo, ``"14"``).

source: ``api_level`` - API level of the running device, as an integer (e.g. ``34`` for Android 14). To get the API level which Python was built against, see :func:`sys.getandroidapilevel`.
pt_br: ``api_level`` - Nível de API do dispositivo em execução, como um inteiro (por exemplo, ``34`` para Android 14). Para obter o nível de API contra o qual o Python foi criado, consulte :func:`sys.getandroidapilevel`.

source: ``manufacturer`` - `Manufacturer name <https://developer.android.com/reference/android/os/Build#MANUFACTURER>`__.
pt_br: ``manufacturer`` - `Nome do fabricante <https://developer.android.com/reference/android/os/Build#MANUFACTURER>`__.

source: ``model`` - `Model name <https://developer.android.com/reference/android/os/Build#MODEL>`__ – typically the marketing name or model number.
pt_br: ``model`` - `Nome do modelo <https://developer.android.com/reference/android/os/Build#MODEL>`__ – normalmente o nome de marketing ou o número do modelo.

source: ``device`` - `Device name <https://developer.android.com/reference/android/os/Build#DEVICE>`__ – typically the model number or a codename.
pt_br: ``device`` - `Nome do dispositivo <https://developer.android.com/reference/android/os/Build#DEVICE>`__ – normalmente o número do modelo ou um codinome.

source: ``is_emulator`` - ``True`` if the device is an emulator; ``False`` if it's a physical device.
pt_br: ``is_emulator`` - ``True`` se o dispositivo for um emulador; ``False`` se for um dispositivo físico.

source: Google maintains a `list of known model and device names <https://storage.googleapis.com/play_public/supported_devices.html>`__.
pt_br: O Google mantém uma `lista de nomes de modelos e dispositivos conhecidos <https://storage.googleapis.com/play_public/supported_devices.html>`__.

source: Command-line usage
pt_br: Uso na linha de comando

source: :mod:`platform` can also be invoked directly using the :option:`-m` switch of the interpreter::
pt_br: :mod:`platform` também pode ser invocado diretamente usando a opção :option:`-m` do interpretador::

source: The following options are accepted:
pt_br: As seguintes opções são aceitas:

source: Print terse information about the platform. This is equivalent to calling :func:`platform.platform` with the *terse* argument set to ``True``.
pt_br: Exibe informações concisas sobre a plataforma. Isso equivale a chamar :func:`platform.platform` com o argumento *terse* definido como ``True``.

source: Print platform information without system/OS name aliasing. This is equivalent to calling :func:`platform.platform` with the *aliased* argument set to ``True``.
pt_br: Exibe informações da plataforma sem alias de nome do sistema/SO. Isso equivale a chamar :func:`platform.platform` com o argumento *aliased* definido como ``True``.

source: You can also pass one or more positional arguments (``terse``, ``nonaliased``) to explicitly control the output format. These behave similarly to their corresponding options.
pt_br: Você também pode passar um ou mais argumentos posicionais (``terse``, ``nonaliased``) para controlar explicitamente o formato de saída. Eles se comportam de forma semelhante às suas opções correspondentes.

source: Miscellaneous
pt_br: Diversos

source: Clear out the internal cache of information, such as the :func:`uname`. This is typically useful when the platform's :func:`node` is changed by an external process and one needs to retrieve the updated value.
pt_br: Limpa o cache interno de informações, como :func:`uname`. Isso normalmente é útil quando o :func:`node` da plataforma é alterado por um processo externo e é necessário recuperar o valor atualizado.
