Repository: python/python-docs-pt-br
Catalog: library/plistlib.po
Languages: pt_br

source: **Source code:** :source:`Lib/plistlib.py`
pt_br: **Código-fonte:** :source:`Lib/plistlib.py`

source: The property list (``.plist``) file format is a simple serialization supporting basic object types, like dictionaries, lists, numbers and strings. Usually the top level object is a dictionary.
pt_br: O formato de arquivo de lista de propriedades (``.plist``) é uma serialização simples que oferece suporte a tipos básicos de objetos, como dicionários, listas, números e strings. Normalmente, o objeto de nível superior é um dicionário.

source: To write out and to parse a plist file, use the :func:`dump` and :func:`load` functions.
pt_br: Para escrever e analisar um arquivo plist, use as funções :func:`dump` e :func:`load`.

source: To work with plist data in bytes objects, use :func:`dumps` and :func:`loads`.
pt_br: Para trabalhar com dados plist em objetos bytes, use :func:`dumps` e :func:`loads`.

source: New API, old API deprecated. Support for binary format plists added.
pt_br: Nova API, API antiga descontinuada. Suporte para plists de formato binário adicionado.

source: Support added for reading and writing :class:`UID` tokens in binary plists as used by NSKeyedArchiver and NSKeyedUnarchiver.
pt_br: Adicionado suporte para leitura e escrita de tokens :class:`UID` em plists binários, conforme usado por NSKeyedArchiver e NSKeyedUnarchiver.

source: Apple's documentation of the file format.
pt_br: Documentação da Apple sobre o formato de arquivo.

source: This module defines the following functions:
pt_br: Este módulo define as seguintes funções:

source: Read a plist file. *fp* should be a readable and binary file object. Return the unpacked root object (which usually is a dictionary).
pt_br: Lê um arquivo plist. *fp* deve ser um objeto arquivo binário e legível. Retorna o objeto raiz desempacotado (que geralmente é um dicionário).

source: The *fmt* is the format of the file and the following values are valid:
pt_br: *fmt* é o formato do arquivo e os seguintes valores são válidos:

source: :data:`None`: Autodetect the file format
pt_br: :data:`None`: Detecta automaticamente o formato do arquivo

source: :data:`FMT_XML`: XML file format
pt_br: :data:`FMT_XML`: Formato de arquivo XML

source: :data:`FMT_BINARY`: Binary plist format
pt_br: :data:`FMT_BINARY`: Formato binário plist

source: The *dict_type* is the type used for dictionaries that are read from the plist file.
pt_br: O *dict_type* é o tipo usado para dicionários que são lidos do arquivo plist.

source: XML data for the :data:`FMT_XML` format is parsed using the Expat parser from :mod:`xml.parsers.expat` -- see its documentation for possible exceptions on ill-formed XML. Unknown elements will simply be ignored by the plist parser.
pt_br: Dados XML para o formato :data:`FMT_XML` são analisados ​​usando o analisador sintático Expat de :mod:`xml.parsers.expat` -- veja sua documentação para possíveis exceções em XML malformado. Elementos desconhecidos serão simplesmente ignorados pelo analisador de plist.

source: The parser for the binary format raises :exc:`InvalidFileException` when the file cannot be parsed.
pt_br: O analisador sintático para o formato binário levanta :exc:`InvalidFileException` quando o arquivo não pode ser analisado.

source: Load a plist from a bytes object. See :func:`load` for an explanation of the keyword arguments.
pt_br: Carrega um plist de um objeto bytes. Veja :func:`load` para uma explicação dos argumentos nomeados.

source: Write *value* to a plist file. *Fp* should be a writable, binary file object.
pt_br: Escreve *value* em um arquivo plist. *Fp* deve ser um objeto arquivo binário gravável.

source: The *fmt* argument specifies the format of the plist file and can be one of the following values:
pt_br: O argumento *fmt* especifica o formato do arquivo plist e pode ser um dos seguintes valores:

source: :data:`FMT_XML`: XML formatted plist file
pt_br: :data:`FMT_XML`: Arquivo plist formatado em XML

source: :data:`FMT_BINARY`: Binary formatted plist file
pt_br: :data:`FMT_BINARY`: Arquivo plist formatado em binário

source: When *sort_keys* is true (the default) the keys for dictionaries will be written to the plist in sorted order, otherwise they will be written in the iteration order of the dictionary.
pt_br: Quando *sort_keys* é verdadeiro (o padrão), as chaves dos dicionários serão escritas ordenadas no plist, caso contrário, elas serão escritas na ordem de iteração do dicionário.

source: When *skipkeys* is false (the default) the function raises :exc:`TypeError` when a key of a dictionary is not a string, otherwise such keys are skipped.
pt_br: Quando *skipkeys* é falso (o padrão), a função levanta :exc:`TypeError` quando uma chave de um dicionário não é uma string, caso contrário, tais chaves são ignoradas.

source: A :exc:`TypeError` will be raised if the object is of an unsupported type or a container that contains objects of unsupported types.
pt_br: Uma :exc:`TypeError` será levantada se o objeto for de um tipo não suportado ou um contêiner que contém objetos de tipos não suportados.

source: An :exc:`OverflowError` will be raised for integer values that cannot be represented in (binary) plist files.
pt_br: Uma :exc:`OverflowError` será levantada para valores inteiros que não podem ser representados em arquivos plist (binários).

source: Return *value* as a plist-formatted bytes object. See the documentation for :func:`dump` for an explanation of the keyword arguments of this function.
pt_br: Retorna *value* como um objeto bytes formatado em plist. Veja a documentação para :func:`dump` para uma explicação dos argumentos nomeados desta função.

source: Use :func:`load` instead.
pt_br: Use :func:`load`.

source: The following classes are available:
pt_br: As seguintes classes estão disponíveis:

source: Wraps an :class:`int`. This is used when reading or writing NSKeyedArchiver encoded data, which contains UID (see PList manual).
pt_br: Envolve um :class:`int`. Isso é usado ao ler ou escrever dados codificados NSKeyedArchiver, que contém UID (veja o manual de PList).

source: The following constants are available:
pt_br: As seguintes constantes estão disponíveis:

source: The XML format for plist files.
pt_br: O formato XML para arquivos plist.

source: The binary format for plist files
pt_br: O formato binário para arquivos plist

source: Examples
pt_br: Exemplos

source: Generating a plist::
pt_br: Gerando um plist::

source: Parsing a plist::
pt_br: Analisando um plist::
