Repository: python/python-docs-pt-br
Catalog: library/posix.po
Languages: pt_br

source: :mod:`!posix` --- The most common POSIX system calls
pt_br: :mod:`!posix` --- As chamadas de sistema mais comuns do POSIX

source: This module provides access to operating system functionality that is standardized by the C Standard and the POSIX standard (a thinly disguised Unix interface).
pt_br: Este módulo fornece acesso à funcionalidade do sistema operacional padronizada pelo padrão C e pelo padrão POSIX (uma interface Unix levemente disfarçada).

source: Availability
pt_br: Disponibilidade

source: **Do not import this module directly.** Instead, import the module :mod:`os`, which provides a *portable* version of this interface. On Unix, the :mod:`os` module provides a superset of the :mod:`posix` interface. On non-Unix operating systems the :mod:`posix` module is not available, but a subset is always available through the :mod:`os` interface. Once :mod:`os` is imported, there is *no* performance penalty in using it instead of :mod:`posix`. In addition, :mod:`os` provides some additional functionality, such as automatically calling :func:`~os.putenv` when an entry in ``os.environ`` is changed.
pt_br: **Não importe este módulo diretamente.** Em vez disso, importe o módulo :mod:`os`, que fornece uma versão *portátil* dessa interface. No Unix, o módulo :mod:`os` fornece um superconjunto da interface :mod:`posix`. Em sistemas operacionais não Unix, o módulo :mod:`posix` não está disponível, mas um subconjunto está sempre disponível na interface :mod:`os`. Uma vez que :mod:`os` é importado, seu uso *não* causa penalidade de desempenho em comparação com :mod:`posix`. Além disso, :mod:`os` fornece algumas funcionalidades adicionais, como chamar automaticamente :func:`~os.putenv` quando uma entrada em ``os.environ`` é alterada.

source: Errors are reported as exceptions; the usual exceptions are given for type errors, while errors reported by the system calls raise :exc:`OSError`.
pt_br: Erros são relatados como exceções. As exceções usuais são dadas para erros de tipo, enquanto os erros relatados pelas chamadas do sistema levantam :exc:`OSError`.

source: Large File Support
pt_br: Suporte a arquivos grandes

source: Several operating systems (including AIX and Solaris) provide support for files that are larger than 2 GiB from a C programming model where :c:expr:`int` and :c:expr:`long` are 32-bit values. This is typically accomplished by defining the relevant size and offset types as 64-bit values. Such files are sometimes referred to as :dfn:`large files`.
pt_br: Vários sistemas operacionais (incluindo AIX e Solaris) fornecem suporte a arquivos maiores que 2 GiB a partir de um modelo de programação C em que :c:expr:`int` e :c:expr:`long` são valores de 32 bits. Isso geralmente é realizado definindo o tamanho relevante e os tipos de deslocamento como valores de 64 bits. Esses arquivos às vezes são chamados de :dfn:`arquivos grandes`.

source: Large file support is enabled in Python when the size of an :c:type:`off_t` is larger than a :c:expr:`long` and the :c:expr:`long long` is at least as large as an :c:type:`off_t`. It may be necessary to configure and compile Python with certain compiler flags to enable this mode. For example, with Solaris 2.6 and 2.7 you need to do something like::
pt_br: O suporte a arquivos grandes é ativado no Python quando o tamanho de um :c:type:`off_t` é maior que a :c:expr:`long` e :c:expr:`long long` é pelo menos tão grande quanto um :c:type:`off_t`. Pode ser necessário configurar e compilar o Python com certos sinalizadores do compilador para ativar esse modo. Por exemplo, com o Solaris 2.6 e 2.7, você precisa fazer algo como::

source: On large-file-capable Linux systems, this might work::
pt_br: Em sistemas Linux com capacidade para arquivos grandes, isso pode funcionar::

source: Notable Module Contents
pt_br: Conteúdo notável do módulo

source: In addition to many functions described in the :mod:`os` module documentation, :mod:`posix` defines the following data item:
pt_br: Além de muitas funções descritas na documentação do módulo :mod:`os`, :mod:`posix` define o seguinte item de dados:

source: A dictionary representing the string environment at the time the interpreter was started. Keys and values are bytes on Unix and str on Windows. For example, ``environ[b'HOME']`` (``environ['HOME']`` on Windows) is the pathname of your home directory, equivalent to ``getenv("HOME")`` in C.
pt_br: Um dicionário que representa o ambiente de strings no momento em que o interpretador foi iniciado. Chaves e valores são bytes no Unix e str no Windows. Por exemplo, ``environ[b'HOME']`` (``environ['HOME']`` no Windows) é o nome do caminho do diretório inicial, equivalente a ``getenv("HOME")`` em C .

source: Modifying this dictionary does not affect the string environment passed on by :func:`~os.execv`, :func:`~os.popen` or :func:`~os.system`; if you need to change the environment, pass ``environ`` to :func:`~os.execve` or add variable assignments and export statements to the command string for :func:`~os.system` or :func:`~os.popen`.
pt_br: A modificação deste dicionário não afeta o ambiente de strings passado por :func:`~os.execv`, :func:`~os.popen` ou :func:`~os.system`. Se você precisar alterar o ambiente, passe ``environ`` para :func:`~os.execve` ou adicione atribuições de variável e instruções de exportação para a string de comando para :func:`~os.system` ou :func:`~os.popen`.

source: On Unix, keys and values are bytes.
pt_br: No Unix, chaves e valores são bytes.

source: The :mod:`os` module provides an alternate implementation of ``environ`` which updates the environment on modification. Note also that updating :data:`os.environ` will render this dictionary obsolete. Use of the :mod:`os` module version of this is recommended over direct access to the :mod:`posix` module.
pt_br: O módulo :mod:`os` fornece uma implementação alternativa de ``environ`` que atualiza o ambiente ao ocorrerem modificações. Observe também que a atualização de :data:`os.environ` tornará este dicionário obsoleto. O uso do módulo :mod:`os` é recomendado sobre o acesso direto ao módulo :mod:`posix`.

source: module
pt_br: módulo

source: large files
pt_br: arquivos grandes

source: file
pt_br: arquivo
