Repository: python/python-docs-pt-br
Catalog: library/pprint.po
Languages: pt_br

source: :mod:`!pprint` --- Data pretty printer
pt_br: :mod:`!pprint` --- Impressão bonita de dados

source: **Source code:** :source:`Lib/pprint.py`
pt_br: **Código-fonte:** :source:`Lib/pprint.py`

source: The :mod:`pprint` module provides a capability to "pretty-print" arbitrary Python data structures in a form which can be used as input to the interpreter. If the formatted structures include objects which are not fundamental Python types, the representation may not be loadable. This may be the case if objects such as files, sockets or classes are included, as well as many other objects which are not representable as Python literals.
pt_br: O módulo :mod:`pprint` fornece a capacidade de "imprimir de forma bonita" estruturas de dados Python arbitrárias em um formato que pode ser usado como entrada para o interpretador. Se as estruturas formatadas incluírem objetos que não sejam tipos fundamentais do Python, a representação poderá não ser carregável. Este pode ser o caso se objetos como arquivos, soquetes ou classes forem incluídos, bem como muitos outros objetos que não são representáveis como literais do Python.

source: The formatted representation keeps objects on a single line if it can, and breaks them onto multiple lines if they don't fit within the allowed width, adjustable by the *width* parameter defaulting to 80 characters.
pt_br: A representação formatada mantém os objetos em uma única linha, se possível, e os divide em múltiplas linhas se eles não couberem na largura permitida, ajustável pelo parâmetro *width* padrão para 80 caracteres.

source: Dictionaries are sorted by key before the display is computed.
pt_br: Os dicionários são classificados por chave antes que a exibição seja calculada.

source: Added support for pretty-printing :class:`types.SimpleNamespace`.
pt_br: Adicionado suporte para impressão bonita de :class:`types.SimpleNamespace`.

source: Added support for pretty-printing :class:`dataclasses.dataclass`.
pt_br: Adicionado suporte para impressão bonita de :class:`dataclasses.dataclass`.

source: Functions
pt_br: Funções

source: Prints the formatted representation of *object*, followed by a newline. This function may be used in the interactive interpreter instead of the :func:`print` function for inspecting values. Tip: you can reassign ``print = pprint.pp`` for use within a scope.
pt_br: Imprime a representação formatada de *object*, seguida por uma nova linha. Esta função pode ser usado no interpretador interativo em vez da função :func:`print` para inspecionar valores. Dica: você pode reatribuir ``print = pprint.pp`` para uso dentro de um escopo.

source: Parameters
pt_br: Parâmetros

source: The object to be printed.
pt_br: O objeto a ser impresso.

source: A file-like object to which the output will be written by calling its :meth:`!write` method. If ``None`` (the default), :data:`sys.stdout` is used.
pt_br: Um objeto arquivo ou similar no qual a saída será gravada chamando seu método :meth:`!write`. Se ``None`` (o padrão), :data:`sys.stdout` será usado.

source: The amount of indentation added for each nesting level.
pt_br: A quantidade de indentação adicionado para cada nível de aninhamento.

source: The desired maximum number of characters per line in the output. If a structure cannot be formatted within the width constraint, a best effort will be made.
pt_br: O número máximo desejado de caracteres por linha na saída. Se uma estrutura não puder ser formatada dentro da restrição de largura, será feito o melhor esforço.

source: The number of nesting levels which may be printed. If the data structure being printed is too deep, the next contained level is replaced by ``...``. If ``None`` (the default), there is no constraint on the depth of the objects being formatted.
pt_br: O número de níveis de aninhamento que podem ser impressos. Se a estrutura de dados que está sendo impressa for muito profunda, o próximo nível contido será substituído por ``...``. Se ``None`` (o padrão), não há restrição na profundidade dos objetos que estão sendo formatados.

source: Control the way long :term:`sequences <sequence>` are formatted. If ``False`` (the default), each item of a sequence will be formatted on a separate line, otherwise as many items as will fit within the *width* will be formatted on each output line.
pt_br: Controla a forma como :term:`sequências <sequence>` são formatadas. Se ``False`` (o padrão), cada item de uma sequência será formatado em uma linha separada, caso contrário, tantos itens quantos couberem na *largura* serão formatados em cada linha de saída.

source: If ``True``, dictionaries will be formatted with their keys sorted, otherwise they will be displayed in insertion order (the default).
pt_br: Se ``True``, os dicionários serão formatados com suas chaves classificadas, caso contrário, serão exibidos na ordem de inserção (o padrão).

source: If ``True``, integers will be formatted with the ``_`` character for a thousands separator, otherwise underscores are not displayed (the default).
pt_br: Se ``True``, os números inteiros serão formatados com o caractere ``_`` para um separador de milhares, caso contrário, os sublinhados não serão exibidos (o padrão).

source: Alias for :func:`~pprint.pp` with *sort_dicts* set to ``True`` by default, which would automatically sort the dictionaries' keys, you might want to use :func:`~pprint.pp` instead where it is ``False`` by default.
pt_br: Apelido para :func:`~pprint.pp` com *sort_dicts* definido como ``True`` por padrão, o que classificaria automaticamente as chaves dos dicionários, você pode querer usar :func:`~pprint.pp` em vez disso, onde é ``False`` por padrão.

source: Return the formatted representation of *object* as a string. *indent*, *width*, *depth*, *compact*, *sort_dicts* and *underscore_numbers* are passed to the :class:`PrettyPrinter` constructor as formatting parameters and their meanings are as described in the documentation above.
pt_br: Retorna a representação formatada de *object* como uma string. *indent*, *width*, *depth*, *compact*, *sort_dicts* e *underscore_numbers* são passados para o construtor de :class:`PrettyPrinter` como parâmetros de formatação e seus significados são descritos na documentação acima.

source: Determine if the formatted representation of *object* is "readable", or can be used to reconstruct the value using :func:`eval`. This always returns ``False`` for recursive objects.
pt_br: Determina se a representação formatada de *object* é "legível" ou pode ser usada para reconstruir o valor usando :func:`eval`. Isso sempre retorna ``False`` para objetos recursivos.

source: Determine if *object* requires a recursive representation. This function is subject to the same limitations as noted in :func:`saferepr` below and may raise an :exc:`RecursionError` if it fails to detect a recursive object.
pt_br: Determina se *object* requer uma representação recursiva. Esta função está sujeita às mesmas limitações mencionadas em :func:`saferepr` abaixo e pode levantar uma exceção :exc:`RecursionError` se falhar em detectar um objeto recursivo.

source: Return a string representation of *object*, protected against recursion in some common data structures, namely instances of :class:`dict`, :class:`list` and :class:`tuple` or subclasses whose ``__repr__`` has not been overridden. If the representation of object exposes a recursive entry, the recursive reference will be represented as ``<Recursion on typename with id=number>``. The representation is not otherwise formatted.
pt_br: Retorna uma representação de string de *object*, protegida contra recursão em algumas estruturas de dados comuns, nomeadamente instâncias de :class:`dict`, :class:`list` e :class:`tuple` ou subclasses cujo ``__repr__`` não foi substituído. Se a representação do objeto expõe uma entrada recursiva, a referência recursiva será representada como ``<Recursion on typename with id=number>``. A representação não é formatada de outra forma.

source: PrettyPrinter Objects
pt_br: Objetos PrettyPrinter

source: Construct a :class:`PrettyPrinter` instance.
pt_br: Constrói uma instância :class:`PrettyPrinter`.

source: Arguments have the same meaning as for :func:`~pprint.pp`. Note that they are in a different order, and that *sort_dicts* defaults to ``True``.
pt_br: Os argumentos têm o mesmo significado que para :func:`~pprint.pp`. Observe que eles estão em uma ordem diferente e que o padrão *sort_dicts* é ``True``.

source: Added the *compact* parameter.
pt_br: Adicionado o parâmetro *compact*.

source: Added the *sort_dicts* parameter.
pt_br: Adicionado o parâmetro *sort_dicts*.

source: Added the *underscore_numbers* parameter.
pt_br: Adicionado o parâmetro *underscore_numbers*.

source: No longer attempts to write to :data:`!sys.stdout` if it is ``None``.
pt_br: Não tenta mais escrever em :data:`!sys.stdout` se for ``None``.

source: :class:`PrettyPrinter` instances have the following methods:
pt_br: Instâncias :class:`PrettyPrinter` contêm os seguintes métodos:

source: Return the formatted representation of *object*. This takes into account the options passed to the :class:`PrettyPrinter` constructor.
pt_br: Retorna a representação formatada de *object*. Isso leva em consideração as opções passadas para o construtor :class:`PrettyPrinter`.

source: Print the formatted representation of *object* on the configured stream, followed by a newline.
pt_br: Exibe a representação formatada de *object* no fluxo configurado, seguida por uma nova linha.

source: The following methods provide the implementations for the corresponding functions of the same names. Using these methods on an instance is slightly more efficient since new :class:`PrettyPrinter` objects don't need to be created.
pt_br: Os métodos a seguir fornecem as implementações para as funções correspondentes com os mesmos nomes. Usar esses métodos em uma instância é um pouco mais eficiente já que novos objetos :class:`PrettyPrinter` não precisam ser criados.

source: Determine if the formatted representation of the object is "readable," or can be used to reconstruct the value using :func:`eval`. Note that this returns ``False`` for recursive objects. If the *depth* parameter of the :class:`PrettyPrinter` is set and the object is deeper than allowed, this returns ``False``.
pt_br: Determina se a representação formatada do objeto é "legível" ou pode ser usada para reconstruir o valor usando :func:`eval`. Observe que isso retorna ``False`` para objetos recursivos. Se o parâmetro *depth* de :class:`PrettyPrinter` estiver definido e o objeto for mais profundo que o permitido, isso retornará ``False``.

source: Determine if the object requires a recursive representation.
pt_br: Determina se o objeto requer uma representação recursiva.

source: This method is provided as a hook to allow subclasses to modify the way objects are converted to strings. The default implementation uses the internals of the :func:`saferepr` implementation.
pt_br: Este método é fornecido como um gancho para permitir que as subclasses modifiquem a maneira como os objetos são convertidos em strings. A implementação padrão usa os componentes internos da implementação de :func:`saferepr`.

source: Returns three values: the formatted version of *object* as a string, a flag indicating whether the result is readable, and a flag indicating whether recursion was detected. The first argument is the object to be presented. The second is a dictionary which contains the :func:`id` of objects that are part of the current presentation context (direct and indirect containers for *object* that are affecting the presentation) as the keys; if an object needs to be presented which is already represented in *context*, the third return value should be ``True``. Recursive calls to the :meth:`.format` method should add additional entries for containers to this dictionary. The third argument, *maxlevels*, gives the requested limit to recursion; this will be ``0`` if there is no requested limit. This argument should be passed unmodified to recursive calls. The fourth argument, *level*, gives the current level; recursive calls should be passed a value less than that of the current call.
pt_br: Retorna três valores: a versão formatada de *object* como uma string, um sinalizador indicando se o resultado é legível e um sinalizador indicando se a recursão foi detectada. O primeiro argumento é o objeto a ser apresentado. O segundo é um dicionário que contém o :func:`id` de objetos que fazem parte do contexto de apresentação atual (contêineres diretos e indiretos para *objects* que estão afetando a apresentação) como chaves; se for necessário apresentar um objeto que já esteja representado em *context*, o terceiro valor de retorno deverá ser ``True``. Chamadas recursivas ao método :meth:`.format` devem adicionar entradas adicionais para contêineres neste dicionário. O terceiro argumento, *maxlevels*, fornece o limite solicitado para recursão; será ``0`` se não houver limite solicitado. Este argumento deve ser passado sem modificações para chamadas recursivas. O quarto argumento, *level*, fornece o nível atual; chamadas recursivas devem receber um valor menor que o da chamada atual.

source: Example
pt_br: Exemplo

source: To demonstrate several uses of the :func:`~pprint.pp` function and its parameters, let's fetch information about a project from `PyPI <https://pypi.org>`_::
pt_br: Para demonstrar vários usos da função :func:`~pprint.pp` e seus parâmetros, vamos buscar informações sobre um projeto no `PyPI <https://pypi.org>`_::

source: In its basic form, :func:`~pprint.pp` shows the whole object::
pt_br: Em sua forma básica, :func:`~pprint.pp` mostra o objeto inteiro::

source: The result can be limited to a certain *depth* (ellipsis is used for deeper contents)::
pt_br: O resultado pode ser limitado a uma certa *depth* (reticências são usadas para conteúdos mais profundos)::

source: Additionally, maximum character *width* can be suggested. If a long object cannot be split, the specified width will be exceeded::
pt_br: Além disso, a largura *width* máxima do caractere pode ser sugerida. Se um objeto longo não puder ser dividido, a largura especificada será excedida::

source: built-in function
pt_br: função embutida

source: placeholder
pt_br: espaço reservado
