Repository: python/python-docs-pt-br
Catalog: library/profile.po
Languages: pt_br

source: The Python Profilers
pt_br: Os Profilers do Python

source: **Source code:** :source:`Lib/profile.py` and :source:`Lib/pstats.py`
pt_br: **Código-fonte:** :source:`Lib/profile.py` and :source:`Lib/pstats.py`

source: Introduction to the profilers
pt_br: Introdução aos profilers

source: :mod:`cProfile` and :mod:`profile` provide :dfn:`deterministic profiling` of Python programs. A :dfn:`profile` is a set of statistics that describes how often and for how long various parts of the program executed. These statistics can be formatted into reports via the :mod:`pstats` module.
pt_br: :mod:`cProfile` і :mod:`profile` забезпечують :dfn:`детермінізоване профілювання` програм Python. :dfn:`profile` — це набір статистичних даних, який описує, як часто та як довго виконуються різні частини програми. Цю статистику можна форматувати у звіти за допомогою модуля :mod:`pstats`.

source: The Python standard library provides two different implementations of the same profiling interface:
pt_br: A biblioteca padrão do Python tem duas implementações diferentes para a mesma interface de profiling:

source: :mod:`cProfile` is recommended for most users; it's a C extension with reasonable overhead that makes it suitable for profiling long-running programs. Based on :mod:`lsprof`, contributed by Brett Rosen and Ted Czotter.
pt_br: :mod:`cProfile` рекомендується для більшості користувачів; це розширення C із розумними накладними витратами, що робить його придатним для профілювання довгострокових програм. На основі :mod:`lsprof`, внесли Бретт Розен і Тед Чоттер.

source: :mod:`profile`, a pure Python module whose interface is imitated by :mod:`cProfile`, but which adds significant overhead to profiled programs. If you're trying to extend the profiler in some way, the task might be easier with this module. Originally designed and written by Jim Roskind.
pt_br: :mod:`profile`, чистий модуль Python, інтерфейс якого імітується :mod:`cProfile`, але який додає значні накладні витрати на профільовані програми. Якщо ви намагаєтеся якимось чином розширити профайлер, завдання може бути легшим із цим модулем. Спочатку розроблений і написаний Джимом Роскіндом.

source: The profiler modules are designed to provide an execution profile for a given program, not for benchmarking purposes (for that, there is :mod:`timeit` for reasonably accurate results). This particularly applies to benchmarking Python code against C code: the profilers introduce overhead for Python code, but not for C-level functions, and so the C code would seem faster than any Python one.
pt_br: Модулі профайлера призначені для надання профілю виконання для даної програми, а не для порівняльного аналізу (для цього існує :mod:`timeit` для достатньо точних результатів). Це особливо стосується порівняння коду Python із кодом C: профайлери вводять додаткові витрати для коду Python, але не для функцій рівня C, тому код C здається швидшим за будь-який Python.

source: Instant User's Manual
pt_br: Посібник користувача Instant

source: This section is provided for users that "don't want to read the manual." It provides a very brief overview, and allows a user to rapidly perform profiling on an existing application.
pt_br: Цей розділ призначений для користувачів, які "не хочуть читати посібник". Він надає дуже короткий огляд і дозволяє користувачеві швидко виконувати профілювання існуючої програми.

source: To profile a function that takes a single argument, you can do::
pt_br: Para realizar profile de uma função que recebe apenas um argumento, você pode fazer::

source: (Use :mod:`profile` instead of :mod:`cProfile` if the latter is not available on your system.)
pt_br: (Використовуйте :mod:`profile` замість :mod:`cProfile`, якщо останній недоступний у вашій системі.)

source: The above action would run :func:`re.compile` and print profile results like the following::
pt_br: Наведена вище дія запустить :func:`re.compile` і надрукує результати профілю, як показано нижче:

source: ncalls
pt_br: виклики

source: for the number of calls.
pt_br: за кількість дзвінків.

source: for the total time spent in the given function (and excluding time made in calls to sub-functions)
pt_br: для загального часу, витраченого на дану функцію (за винятком часу, витраченого на виклики підфункцій)

source: is the quotient of ``tottime`` divided by ``ncalls``
pt_br: це частка ``tottime``, поділена на ``ncalls``

source: is the cumulative time spent in this and all subfunctions (from invocation till exit). This figure is accurate *even* for recursive functions.
pt_br: це сукупний час, витрачений на цю та всі підфункції (від виклику до виходу). Ця цифра точна *навіть* для рекурсивних функцій.

source: is the quotient of ``cumtime`` divided by primitive calls
pt_br: це частка ``cumtime``, поділена на примітивні виклики

source: provides the respective data of each function
pt_br: надає відповідні дані кожної функції

source: When there are two numbers in the first column (for example ``3/1``), it means that the function recursed. The second value is the number of primitive calls and the former is the total number of calls. Note that when the function does not recurse, these two values are the same, and only the single figure is printed.
pt_br: Якщо в першому стовпці є два числа (наприклад, ``3/1``), це означає, що функція рекурсувала. Друге значення — це кількість первинних викликів, а перше — загальна кількість викликів. Зауважте, що коли функція не рекурсує, ці два значення однакові, і друкується лише одна цифра.

source: Instead of printing the output at the end of the profile run, you can save the results to a file by specifying a filename to the :func:`run` function::
pt_br: Замість того, щоб друкувати вихідні дані в кінці запуску профілю, ви можете зберегти результати у файлі, вказавши ім’я файлу у функції :func:`run`::

source: The :class:`pstats.Stats` class reads profile results from a file and formats them in various ways.
pt_br: Клас :class:`pstats.Stats` читає результати профілю з файлу та форматує їх різними способами.

source: The files :mod:`cProfile` and :mod:`profile` can also be invoked as a script to profile another script. For example::
pt_br: Файли :mod:`cProfile` і :mod:`profile` також можна викликати як сценарій для профілювання іншого сценарію. Наприклад::

source: ``-o`` writes the profile results to a file instead of to stdout
pt_br: ``-o`` записує результати профілю у файл замість stdout

source: ``-s`` specifies one of the :func:`~pstats.Stats.sort_stats` sort values to sort the output by. This only applies when ``-o`` is not supplied.
pt_br: ``-s`` вказує одне зі значень сортування :func:`~pstats.Stats.sort_stats` для сортування виводу. Це стосується лише випадків, коли ``-o`` не вказано.

source: ``-m`` specifies that a module is being profiled instead of a script.
pt_br: ``-m`` вказує, що профільується модуль замість сценарію.

source: Added the ``-m`` option to :mod:`cProfile`.
pt_br: Додано опцію ``-m`` до :mod:`cProfile`.

source: Added the ``-m`` option to :mod:`profile`.
pt_br: Додано опцію ``-m`` до :mod:`profile`.

source: The :mod:`pstats` module's :class:`~pstats.Stats` class has a variety of methods for manipulating and printing the data saved into a profile results file::
pt_br: Клас :class:`~pstats.Stats` модуля :mod:`pstats` має різноманітні методи для обробки та друку даних, збережених у файлі результатів профілю:

source: The :meth:`~pstats.Stats.strip_dirs` method removed the extraneous path from all the module names. The :meth:`~pstats.Stats.sort_stats` method sorted all the entries according to the standard module/line/name string that is printed. The :meth:`~pstats.Stats.print_stats` method printed out all the statistics. You might try the following sort calls::
pt_br: Метод :meth:`~pstats.Stats.strip_dirs` видалив зайвий шлях з усіх імен модулів. Метод :meth:`~pstats.Stats.sort_stats` відсортував усі записи відповідно до стандартного рядка модуля/рядка/назви, який друкується. Метод :meth:`~pstats.Stats.print_stats` виводить всю статистику. Ви можете спробувати такі виклики сортування:

source: The first call will actually sort the list by function name, and the second call will print out the statistics. The following are some interesting calls to experiment with::
pt_br: Перший виклик фактично відсортує список за назвою функції, а другий виклик роздрукує статистику. Нижче наведено кілька цікавих викликів для експериментів:

source: This sorts the profile by cumulative time in a function, and then only prints the ten most significant lines. If you want to understand what algorithms are taking time, the above line is what you would use.
pt_br: Це сортує профіль за сукупним часом у функції, а потім друкує лише десять найважливіших рядків. Якщо ви хочете зрозуміти, які алгоритми потребують часу, ви б використали рядок вище.

source: If you were looking to see what functions were looping a lot, and taking a lot of time, you would do::
pt_br: Якби ви хотіли побачити, які функції часто зациклюються та займають багато часу, ви б зробили:

source: to sort according to time spent within each function, and then print the statistics for the top ten functions.
pt_br: щоб відсортувати відповідно до часу, витраченого на виконання кожної функції, а потім надрукувати статистику для перших десяти функцій.

source: You might also try::
pt_br: Você pode tentar também::

source: This will sort all the statistics by file name, and then print out statistics for only the class init methods (since they are spelled with ``__init__`` in them). As one final example, you could try::
pt_br: Це відсортує всю статистику за назвою файлу, а потім роздрукує статистику лише для методів ініціалізації класу (оскільки в них пишеться ``__init__``). Як останній приклад, ви можете спробувати:

source: This line sorts statistics with a primary key of time, and a secondary key of cumulative time, and then prints out some of the statistics. To be specific, the list is first culled down to 50% (re: ``.5``) of its original size, then only lines containing ``init`` are maintained, and that sub-sub-list is printed.
pt_br: Цей рядок сортує статистичні дані за первинним ключем часу та вторинним ключем сукупного часу, а потім роздруковує деякі статистичні дані. Щоб бути конкретним, список спочатку відбирається до 50% (re: ``.5``) від його початкового розміру, потім зберігаються лише рядки, що містять ``init``, і цей підпідсписок друкується.

source: If you wondered what functions called the above functions, you could now (``p`` is still sorted according to the last criteria) do::
pt_br: Якщо вам було цікаво, які функції називають наведені вище функції, ви можете тепер (``p`` все ще сортується за останнім критерієм) зробити::

source: and you would get a list of callers for each of the listed functions.
pt_br: і ви отримаєте список абонентів для кожної з перелічених функцій.

source: If you want more functionality, you're going to have to read the manual, or guess what the following functions do::
pt_br: Якщо ви хочете отримати більше функціональних можливостей, вам доведеться прочитати посібник або здогадатися, що роблять такі функції:

source: Invoked as a script, the :mod:`pstats` module is a statistics browser for reading and examining profile dumps. It has a simple line-oriented interface (implemented using :mod:`cmd`) and interactive help.
pt_br: Викликаний як скрипт, модуль :mod:`pstats` є браузером статистики для читання та вивчення дампів профілю. Він має простий рядково-орієнтований інтерфейс (реалізований за допомогою :mod:`cmd`) та інтерактивну довідку.

source: :mod:`profile` and :mod:`cProfile` Module Reference
pt_br: Довідка про модуль :mod:`profile` і :mod:`cProfile`

source: Both the :mod:`profile` and :mod:`cProfile` modules provide the following functions:
pt_br: Обидва модулі :mod:`profile` і :mod:`cProfile` забезпечують такі функції:

source: This function takes a single argument that can be passed to the :func:`exec` function, and an optional file name. In all cases this routine executes::
pt_br: Ця функція приймає один аргумент, який можна передати функції :func:`exec`, і необов’язкове ім’я файлу. У всіх випадках ця процедура виконує:

source: and gathers profiling statistics from the execution. If no file name is present, then this function automatically creates a :class:`~pstats.Stats` instance and prints a simple profiling report. If the sort value is specified, it is passed to this :class:`~pstats.Stats` instance to control how the results are sorted.
pt_br: і збирає статистику профілювання від виконання. Якщо ім’я файлу відсутнє, ця функція автоматично створює екземпляр :class:`~pstats.Stats` і друкує простий звіт профілювання. Якщо вказано значення сортування, воно передається цьому екземпляру :class:`~pstats.Stats` для керування сортуванням результатів.

source: This function is similar to :func:`run`, with added arguments to supply the globals and locals dictionaries for the *command* string. This routine executes::
pt_br: Ця функція схожа на :func:`run`, з доданими аргументами для надання глобальних і локальних словників для *командного* рядка. Ця процедура виконує:

source: and gathers profiling statistics as in the :func:`run` function above.
pt_br: і збирає статистику профілювання, як у функції :func:`run` вище.

source: This class is normally only used if more precise control over profiling is needed than what the :func:`cProfile.run` function provides.
pt_br: Зазвичай цей клас використовується, лише якщо потрібен більш точний контроль над профілюванням, ніж той, який забезпечує функція :func:`cProfile.run`.

source: A custom timer can be supplied for measuring how long code takes to run via the *timer* argument. This must be a function that returns a single number representing the current time. If the number is an integer, the *timeunit* specifies a multiplier that specifies the duration of each unit of time. For example, if the timer returns times measured in thousands of seconds, the time unit would be ``.001``.
pt_br: Можна надати власний таймер для вимірювання тривалості виконання коду за допомогою аргументу *timer*. Це має бути функція, яка повертає одне число, що відповідає поточному часу. Якщо число є цілим числом, *timeunit* визначає множник, який визначає тривалість кожної одиниці часу. Наприклад, якщо таймер повертає час, виміряний у тисячах секунд, одиницею часу буде ``.001``.

source: Directly using the :class:`Profile` class allows formatting profile results without writing the profile data to a file::
pt_br: Безпосереднє використання класу :class:`Profile` дозволяє форматувати результати профілю без запису даних профілю у файл::

source: The :class:`Profile` class can also be used as a context manager (supported only in :mod:`cProfile` module. see :ref:`typecontextmanager`)::
pt_br: Клас :class:`Profile` також можна використовувати як менеджер контексту (підтримується лише в модулі :mod:`cProfile`. Див. :ref:`typecontextmanager`)::

source: Added context manager support.
pt_br: Adicionado suporte a gerenciador de contexto.

source: Start collecting profiling data. Only in :mod:`cProfile`.
pt_br: Inicia a coleta de dados de profilling. Apenas em :mod:`cProfile`.

source: Stop collecting profiling data. Only in :mod:`cProfile`.
pt_br: Para de coletar dados de profilling. Apenas em :mod:`cProfile`.

source: Stop collecting profiling data and record the results internally as the current profile.
pt_br: Припиніть збір даних профілювання та запишіть результати внутрішньо як поточний профіль.

source: Create a :class:`~pstats.Stats` object based on the current profile and print the results to stdout.
pt_br: Cria um objeto :class:`~pstats.Stats` com base no perfil atual e imprime os resultados para stdout.

source: Write the results of the current profile to *filename*.
pt_br: Escreve os resultados do profile atual para *filename*.

source: Profile the cmd via :func:`exec`.
pt_br: Профілюйте cmd через :func:`exec`.

source: Profile the cmd via :func:`exec` with the specified global and local environment.
pt_br: Профілюйте cmd через :func:`exec` із зазначеним глобальним і локальним середовищем.

source: Profile ``func(*args, **kwargs)``
pt_br: Профіль ``func(*args, **kwargs)``

source: Note that profiling will only work if the called command/function actually returns. If the interpreter is terminated (e.g. via a :func:`sys.exit` call during the called command/function execution) no profiling results will be printed.
pt_br: Зауважте, що профілювання працюватиме, лише якщо викликана команда/функція дійсно повернеться. Якщо інтерпретатор завершується (наприклад, через виклик :func:`sys.exit` під час виконання викликаної команди/функції), результати профілювання не друкуються.

source: The :class:`Stats` Class
pt_br: A classe :class:`Stats`

source: Analysis of the profiler data is done using the :class:`~pstats.Stats` class.
pt_br: Аналіз даних профайлера виконується за допомогою класу :class:`~pstats.Stats`.

source: This class constructor creates an instance of a "statistics object" from a *filename* (or list of filenames) or from a :class:`Profile` instance. Output will be printed to the stream specified by *stream*.
pt_br: Цей конструктор класу створює екземпляр "статистичного об’єкта" з *імені файлу* (або списку імен файлів) або з екземпляра :class:`Profile`. Вихід буде надруковано в потік, указаний *stream*.

source: The file selected by the above constructor must have been created by the corresponding version of :mod:`profile` or :mod:`cProfile`. To be specific, there is *no* file compatibility guaranteed with future versions of this profiler, and there is no compatibility with files produced by other profilers, or the same profiler run on a different operating system. If several files are provided, all the statistics for identical functions will be coalesced, so that an overall view of several processes can be considered in a single report. If additional files need to be combined with data in an existing :class:`~pstats.Stats` object, the :meth:`~pstats.Stats.add` method can be used.
pt_br: Файл, вибраний конструктором вище, має бути створений відповідною версією :mod:`profile` або :mod:`cProfile`. Якщо бути конкретнішим, *немає* гарантії сумісності файлів із майбутніми версіями цього профайлера, а також немає сумісності з файлами, створеними іншими профайлерами, або тим самим профайлером, що працює в іншій операційній системі. Якщо надано кілька файлів, усі статистичні дані для ідентичних функцій будуть об’єднані, щоб загальний огляд кількох процесів можна було розглянути в одному звіті. Якщо додаткові файли потрібно об’єднати з даними в існуючому об’єкті :class:`~pstats.Stats`, можна використати метод :meth:`~pstats.Stats.add`.

source: Instead of reading the profile data from a file, a :class:`cProfile.Profile` or :class:`profile.Profile` object can be used as the profile data source.
pt_br: Замість читання даних профілю з файлу, об’єкт :class:`cProfile.Profile` або :class:`profile.Profile` можна використовувати як джерело даних профілю.

source: :class:`Stats` objects have the following methods:
pt_br: Os objetos de :class:`Stats` tem os seguintes métodos:

source: This method for the :class:`Stats` class removes all leading path information from file names. It is very useful in reducing the size of the printout to fit within (close to) 80 columns. This method modifies the object, and the stripped information is lost. After performing a strip operation, the object is considered to have its entries in a "random" order, as it was just after object initialization and loading. If :meth:`~pstats.Stats.strip_dirs` causes two function names to be indistinguishable (they are on the same line of the same filename, and have the same function name), then the statistics for these two entries are accumulated into a single entry.
pt_br: Цей метод для класу :class:`Stats` видаляє всю інформацію про початковий шлях із імен файлів. Це дуже корисно для зменшення розміру роздруківки до (близько) 80 стовпців. Цей метод змінює об’єкт, і видалена інформація втрачається. Після виконання операції видалення вважається, що об’єкт має свої записи у "випадковому" порядку, як це було одразу після ініціалізації та завантаження об’єкта. Якщо :meth:`~pstats.Stats.strip_dirs` спричиняє нерозрізнення двох імен функцій (вони знаходяться в одному рядку того самого імені файлу та мають однакову назву функції), тоді статистика для цих двох записів накопичується в єдиний вхід.

source: This method of the :class:`Stats` class accumulates additional profiling information into the current profiling object. Its arguments should refer to filenames created by the corresponding version of :func:`profile.run` or :func:`cProfile.run`. Statistics for identically named (re: file, line, name) functions are automatically accumulated into single function statistics.
pt_br: Цей метод класу :class:`Stats` накопичує додаткову інформацію профілювання в поточному об’єкті профілювання. Його аргументи мають посилатися на імена файлів, створені відповідною версією :func:`profile.run` або :func:`cProfile.run`. Статистика для функцій з ідентичними назвами (re: файл, рядок, ім’я) автоматично накопичується в одній статистиці функції.

source: Save the data loaded into the :class:`Stats` object to a file named *filename*. The file is created if it does not exist, and is overwritten if it already exists. This is equivalent to the method of the same name on the :class:`profile.Profile` and :class:`cProfile.Profile` classes.
pt_br: Збережіть дані, завантажені в об’єкт :class:`Stats`, у файл з назвою *filename*. Файл створюється, якщо він не існує, і перезаписується, якщо він уже існує. Це еквівалентно однойменному методу в класах :class:`profile.Profile` і :class:`cProfile.Profile`.

source: This method modifies the :class:`Stats` object by sorting it according to the supplied criteria. The argument can be either a string or a SortKey enum identifying the basis of a sort (example: ``'time'``, ``'name'``, ``SortKey.TIME`` or ``SortKey.NAME``). The SortKey enums argument have advantage over the string argument in that it is more robust and less error prone.
pt_br: Цей метод змінює об’єкт :class:`Stats`, сортуючи його відповідно до наданих критеріїв. Аргументом може бути рядок або перелік SortKey, що визначає основу сортування (приклад: ``'time'``, ``'name'``, ``SortKey.TIME`` або ``SortKey.NAME``). Аргумент переліку SortKey має перевагу над рядковим аргументом у тому, що він більш надійний і менш схильний до помилок.

source: When more than one key is provided, then additional keys are used as secondary criteria when there is equality in all keys selected before them. For example, ``sort_stats(SortKey.NAME, SortKey.FILE)`` will sort all the entries according to their function name, and resolve all ties (identical function names) by sorting by file name.
pt_br: Якщо надається більше одного ключа, то додаткові ключі використовуються як вторинні критерії, якщо є рівність у всіх ключах, вибраних перед ними. Наприклад, ``sort_stats(SortKey.NAME, SortKey.FILE)`` відсортує всі записи відповідно до їхньої назви функції та розв’яже всі зв’язки (ідентичні назви функції) шляхом сортування за назвою файлу.

source: For the string argument, abbreviations can be used for any key names, as long as the abbreviation is unambiguous.
pt_br: Для рядкового аргументу можна використовувати абревіатури для будь-яких імен ключів, за умови, що скорочення є однозначним.

source: The following are the valid string and SortKey:
pt_br: Нижче наведено дійсний рядок і SortKey:

source: Valid String Arg
pt_br: Дійсний рядковий аргумент

source: Valid enum Arg
pt_br: Дійсний перелік Arg

source: Meaning
pt_br: Significado

source: N/A
pt_br: N/D

source: file name
pt_br: ім'я файлу

source: primitive call count
pt_br: примітивний підрахунок викликів

source: line number
pt_br: номер рядка
