Repository: python/python-docs-pt-br
Catalog: library/profile.po
Languages: pt_br

source: function name
pt_br: назва функції

source: name/file/line
pt_br: ім'я/файл/рядок

source: standard name
pt_br: стандартна назва

source: internal time
pt_br: внутрішній час

source: Note that all sorts on statistics are in descending order (placing most time consuming items first), where as name, file, and line number searches are in ascending order (alphabetical). The subtle distinction between ``SortKey.NFL`` and ``SortKey.STDNAME`` is that the standard name is a sort of the name as printed, which means that the embedded line numbers get compared in an odd way. For example, lines 3, 20, and 40 would (if the file names were the same) appear in the string order 20, 3 and 40. In contrast, ``SortKey.NFL`` does a numeric compare of the line numbers. In fact, ``sort_stats(SortKey.NFL)`` is the same as ``sort_stats(SortKey.NAME, SortKey.FILENAME, SortKey.LINE)``.
pt_br: Зауважте, що всі сортування в статистиці виконуються в порядку спадання (першими розміщуються елементи, що вимагають більше часу), а пошук імені, файлу та номера рядка здійснюється в порядку зростання (за алфавітом). Тонка різниця між ``SortKey.NFL`` і ``SortKey.STDNAME`` полягає в тому, що стандартна назва є різновидом назви, як надруковано, що означає, що вбудовані номери рядків порівнюються дивним чином. Наприклад, рядки 3, 20 і 40 (якби імена файлів були однаковими) відображалися б у порядку рядків 20, 3 і 40. На відміну від цього, ``SortKey.NFL`` виконує числове порівняння номерів рядків. Фактично, ``sort_stats(SortKey.NFL)`` те саме, що ``sort_stats(SortKey.NAME, SortKey.FILENAME, SortKey.LINE)``.

source: For backward-compatibility reasons, the numeric arguments ``-1``, ``0``, ``1``, and ``2`` are permitted. They are interpreted as ``'stdname'``, ``'calls'``, ``'time'``, and ``'cumulative'`` respectively. If this old style format (numeric) is used, only one sort key (the numeric key) will be used, and additional arguments will be silently ignored.
pt_br: З міркувань зворотної сумісності дозволені числові аргументи ``-1``, ``0``, ``1`` і ``2``. Вони інтерпретуються як ``'stdname'``, ``'calls'``, ``'time'`` і ``'cumulative'`` відповідно. Якщо використовується цей формат старого стилю (числовий), використовуватиметься лише один ключ сортування (числовий ключ), а додаткові аргументи мовчки ігноруватимуться.

source: Added the SortKey enum.
pt_br: Додано перелік SortKey.

source: This method for the :class:`Stats` class reverses the ordering of the basic list within the object. Note that by default ascending vs descending order is properly selected based on the sort key of choice.
pt_br: Цей метод для класу :class:`Stats` змінює порядок базового списку в об’єкті на протилежний. Зверніть увагу, що за замовчуванням порядок зростання чи спадання вибрано належним чином на основі вибраного ключа сортування.

source: This method for the :class:`Stats` class prints out a report as described in the :func:`profile.run` definition.
pt_br: Цей метод для класу :class:`Stats` друкує звіт, як описано у визначенні :func:`profile.run`.

source: The order of the printing is based on the last :meth:`~pstats.Stats.sort_stats` operation done on the object (subject to caveats in :meth:`~pstats.Stats.add` and :meth:`~pstats.Stats.strip_dirs`).
pt_br: Порядок друку базується на останній операції :meth:`~pstats.Stats.sort_stats`, виконаній над об’єктом (з урахуванням застережень у :meth:`~pstats.Stats.add` і :meth:`~pstats. Stats.strip_dirs`).

source: The arguments provided (if any) can be used to limit the list down to the significant entries. Initially, the list is taken to be the complete set of profiled functions. Each restriction is either an integer (to select a count of lines), or a decimal fraction between 0.0 and 1.0 inclusive (to select a percentage of lines), or a string that will interpreted as a regular expression (to pattern match the standard name that is printed). If several restrictions are provided, then they are applied sequentially. For example::
pt_br: Надані аргументи (якщо такі є) можна використовувати, щоб обмежити список до значущих записів. Спочатку список розглядається як повний набір профільованих функцій. Кожне обмеження є або цілим числом (щоб вибрати кількість рядків), або десятковим дробом від 0,0 до 1,0 включно (щоб вибрати відсоток рядків), або рядком, який інтерпретуватиметься як регулярний вираз (щоб шаблон відповідав стандартній назві що друкується). Якщо передбачено кілька обмежень, то вони застосовуються послідовно. Наприклад::

source: would first limit the printing to first 10% of list, and then only print functions that were part of filename :file:`.\*foo:`. In contrast, the command::
pt_br: спочатку обмежує друк до перших 10% списку, а потім друкує лише функції, які є частиною імені файлу :file:`.\*foo:`. Навпаки, команда::

source: would limit the list to all functions having file names :file:`.\*foo:`, and then proceed to only print the first 10% of them.
pt_br: обмежить список усіма функціями, що мають імена файлів :file:`.\*foo:`, а потім перейде до друку лише перших 10% із них.

source: This method for the :class:`Stats` class prints a list of all functions that called each function in the profiled database. The ordering is identical to that provided by :meth:`~pstats.Stats.print_stats`, and the definition of the restricting argument is also identical. Each caller is reported on its own line. The format differs slightly depending on the profiler that produced the stats:
pt_br: Цей метод для класу :class:`Stats` друкує список усіх функцій, які викликали кожну функцію в профільованій базі даних. Порядок ідентичний тому, який надає :meth:`~pstats.Stats.print_stats`, і визначення обмежувального аргументу також ідентичне. Кожен абонент повідомляється на своїй лінії. Формат дещо відрізняється залежно від профайлера, який створив статистику:

source: With :mod:`profile`, a number is shown in parentheses after each caller to show how many times this specific call was made. For convenience, a second non-parenthesized number repeats the cumulative time spent in the function at the right.
pt_br: За допомогою :mod:`profile` число відображається в дужках після кожного абонента, щоб показати, скільки разів було зроблено цей конкретний виклик. Для зручності друге число без дужок повторює сукупний час, витрачений на функцію праворуч.

source: With :mod:`cProfile`, each caller is preceded by three numbers: the number of times this specific call was made, and the total and cumulative times spent in the current function while it was invoked by this specific caller.
pt_br: За допомогою :mod:`cProfile` перед кожним викликом стоять три числа: кількість разів, коли цей конкретний виклик було здійснено, а також загальний і сукупний час, витрачений на поточну функцію під час її виклику цим конкретним викликом.

source: This method for the :class:`Stats` class prints a list of all function that were called by the indicated function. Aside from this reversal of direction of calls (re: called vs was called by), the arguments and ordering are identical to the :meth:`~pstats.Stats.print_callers` method.
pt_br: Цей метод для класу :class:`Stats` друкує список усіх функцій, викликаних зазначеною функцією. Окрім зміни напрямку викликів (re: called проти was called by), аргументи та порядок ідентичні методу :meth:`~pstats.Stats.print_callers`.

source: This method returns an instance of StatsProfile, which contains a mapping of function names to instances of FunctionProfile. Each FunctionProfile instance holds information related to the function's profile such as how long the function took to run, how many times it was called, etc...
pt_br: Цей метод повертає екземпляр StatsProfile, який містить зіставлення імен функцій з екземплярами FunctionProfile. Кожен екземпляр FunctionProfile містить інформацію, пов’язану з профілем функції, наприклад, скільки часу знадобилося для виконання функції, скільки разів її викликали тощо...

source: Added the following dataclasses: StatsProfile, FunctionProfile. Added the following function: get_stats_profile.
pt_br: Додано такі класи даних: StatsProfile, FunctionProfile. Додано таку функцію: get_stats_profile.

source: What Is Deterministic Profiling?
pt_br: Що таке детерміноване профілювання?

source: :dfn:`Deterministic profiling` is meant to reflect the fact that all *function call*, *function return*, and *exception* events are monitored, and precise timings are made for the intervals between these events (during which time the user's code is executing). In contrast, :dfn:`statistical profiling` (which is not done by this module) randomly samples the effective instruction pointer, and deduces where time is being spent. The latter technique traditionally involves less overhead (as the code does not need to be instrumented), but provides only relative indications of where time is being spent.
pt_br: :dfn:`Deterministic profiling` призначене для відображення того факту, що всі події *виклику функції*, *повернення функції* та *виключення* відстежуються, а також точні часові інтервали між цими подіями (протягом часу, протягом якого користувач код виконується). На відміну від цього, :dfn:`statistical profiling` (яке не виконується цим модулем) випадково відбирає ефективний вказівник інструкції та визначає, де витрачається час. Останній метод традиційно передбачає менше накладних витрат (оскільки код не потребує інструментарію), але забезпечує лише відносні показники того, де витрачається час.

source: In Python, since there is an interpreter active during execution, the presence of instrumented code is not required in order to do deterministic profiling. Python automatically provides a :dfn:`hook` (optional callback) for each event. In addition, the interpreted nature of Python tends to add so much overhead to execution, that deterministic profiling tends to only add small processing overhead in typical applications. The result is that deterministic profiling is not that expensive, yet provides extensive run time statistics about the execution of a Python program.
pt_br: У Python, оскільки під час виконання активний інтерпретатор, наявність інструментального коду не потрібна для виконання детермінованого профілювання. Python автоматично надає :dfn:`hook` (додатковий зворотний виклик) для кожної події. Крім того, інтерпретована природа Python має тенденцію додавати стільки накладних витрат на виконання, що детерміноване профілювання має тенденцію лише додавати невеликі накладні витрати на обробку в типових програмах. Результатом є те, що детерміноване профілювання не таке вже й дороге, але забезпечує розширену статистику часу виконання про виконання програми Python.

source: Call count statistics can be used to identify bugs in code (surprising counts), and to identify possible inline-expansion points (high call counts). Internal time statistics can be used to identify "hot loops" that should be carefully optimized. Cumulative time statistics should be used to identify high level errors in the selection of algorithms. Note that the unusual handling of cumulative times in this profiler allows statistics for recursive implementations of algorithms to be directly compared to iterative implementations.
pt_br: Статистику кількості викликів можна використовувати для виявлення помилок у коді (несподівана кількість) і для визначення можливих точок вбудованого розширення (висока кількість викликів). Внутрішню статистику часу можна використовувати для виявлення "гарячих циклів", які слід ретельно оптимізувати. Кумулятивну статистику часу слід використовувати для виявлення помилок високого рівня у виборі алгоритмів. Зауважте, що незвичайна обробка сукупного часу в цьому профайлері дозволяє прямо порівнювати статистику для рекурсивних реалізацій алгоритмів з ітеративними реалізаціями.

source: Limitations
pt_br: Limitações

source: One limitation has to do with accuracy of timing information. There is a fundamental problem with deterministic profilers involving accuracy. The most obvious restriction is that the underlying "clock" is only ticking at a rate (typically) of about .001 seconds. Hence no measurements will be more accurate than the underlying clock. If enough measurements are taken, then the "error" will tend to average out. Unfortunately, removing this first error induces a second source of error.
pt_br: Одне обмеження пов’язане з точністю інформації про час. Існує фундаментальна проблема з детермінованим профайлером, пов’язана з точністю. Найбільш очевидним обмеженням є те, що основний "годинник" цокає лише зі швидкістю (зазвичай) приблизно 0,001 секунди. Тому жодні вимірювання не будуть точнішими, ніж базовий годинник. Якщо проведено достатньо вимірювань, "похибка" матиме тенденцію до усереднення. На жаль, видалення цієї першої помилки спричиняє друге джерело помилки.

source: The second problem is that it "takes a while" from when an event is dispatched until the profiler's call to get the time actually *gets* the state of the clock. Similarly, there is a certain lag when exiting the profiler event handler from the time that the clock's value was obtained (and then squirreled away), until the user's code is once again executing. As a result, functions that are called many times, or call many functions, will typically accumulate this error. The error that accumulates in this fashion is typically less than the accuracy of the clock (less than one clock tick), but it *can* accumulate and become very significant.
pt_br: Друга проблема полягає в тому, що "потрібен деякий час" від моменту надсилання події до моменту, коли виклик профайлера для отримання часу фактично *отримує* стан годинника. Подібним чином існує певна затримка під час виходу з обробника подій профайлера з моменту, коли було отримано значення годинника (і потім вилучено), до моменту, коли код користувача знову виконується. У результаті функції, які викликаються багато разів або викликають багато функцій, зазвичай накопичуватимуть цю помилку. Похибка, яка накопичується таким чином, зазвичай менша, ніж точність годинника (менше одного такту), але вона *може* накопичуватися і стати дуже значною.

source: The problem is more important with :mod:`profile` than with the lower-overhead :mod:`cProfile`. For this reason, :mod:`profile` provides a means of calibrating itself for a given platform so that this error can be probabilistically (on the average) removed. After the profiler is calibrated, it will be more accurate (in a least square sense), but it will sometimes produce negative numbers (when call counts are exceptionally low, and the gods of probability work against you :-). ) Do *not* be alarmed by negative numbers in the profile. They should *only* appear if you have calibrated your profiler, and the results are actually better than without calibration.
pt_br: Проблема важливіша з :mod:`profile`, ніж з нижчими накладними :mod:`cProfile`. З цієї причини :mod:`profile` забезпечує засіб самокалібрування для певної платформи, щоб цю помилку можна було ймовірно (в середньому) усунути. Після калібрування профайлера він буде більш точним (у сенсі найменших квадратів), але іноді він видаватиме від’ємні числа (коли кількість викликів надзвичайно низька, і боги ймовірності працюють проти вас :-). ) *Не* лякайтеся негативних цифр в профілі. Вони мають з’являтися *тільки*, якщо ви відкалібрували свій профайлер, і результати насправді кращі, ніж без калібрування.

source: Calibration
pt_br: Калібрування

source: The profiler of the :mod:`profile` module subtracts a constant from each event handling time to compensate for the overhead of calling the time function, and socking away the results. By default, the constant is 0. The following procedure can be used to obtain a better constant for a given platform (see :ref:`profile-limitations`). ::
pt_br: Профайлер модуля :mod:`profile` віднімає константу від часу обробки кожної події, щоб компенсувати накладні витрати на виклик функції часу та накопичення результатів. За замовчуванням константа дорівнює 0. Наступну процедуру можна використати, щоб отримати кращу константу для даної платформи (див. :ref:`profile-limitations`). ::

source: The method executes the number of Python calls given by the argument, directly and again under the profiler, measuring the time for both. It then computes the hidden overhead per profiler event, and returns that as a float. For example, on a 1.8Ghz Intel Core i5 running macOS, and using Python's time.process_time() as the timer, the magical number is about 4.04e-6.
pt_br: Метод виконує кількість викликів Python, заданих аргументом, безпосередньо та знову під профайлером, вимірюючи час для обох. Потім він обчислює приховані накладні витрати на кожну подію профілювача та повертає їх як число з плаваючою точкою. Наприклад, на процесорі Intel Core i5 з тактовою частотою 1,8 ГГц, який працює під керуванням macOS і використовує Python time.process_time() як таймер, магічне число становить приблизно 4,04e-6.

source: The object of this exercise is to get a fairly consistent result. If your computer is *very* fast, or your timer function has poor resolution, you might have to pass 100000, or even 1000000, to get consistent results.
pt_br: Мета цієї вправи — отримати досить послідовний результат. Якщо ваш комп’ютер *дуже* швидкий або ваша функція таймера має низьку роздільну здатність, вам, можливо, доведеться передати 100 000 або навіть 1000 000, щоб отримати стабільні результати.

source: When you have a consistent answer, there are three ways you can use it::
pt_br: Якщо у вас є послідовна відповідь, ви можете використовувати її трьома способами:

source: If you have a choice, you are better off choosing a smaller constant, and then your results will "less often" show up as negative in profile statistics.
pt_br: Якщо у вас є вибір, краще вибрати меншу константу, і тоді ваші результати будуть "рідше" відображатися в статистиці профілю як негативні.

source: Using a custom timer
pt_br: Використання спеціального таймера

source: If you want to change how current time is determined (for example, to force use of wall-clock time or elapsed process time), pass the timing function you want to the :class:`Profile` class constructor::
pt_br: Якщо ви хочете змінити спосіб визначення поточного часу (наприклад, щоб примусово використовувати час настінного годинника або час, що минув), передайте потрібну функцію синхронізації в конструктор класу :class:`Profile`::

source: The resulting profiler will then call ``your_time_func``. Depending on whether you are using :class:`profile.Profile` or :class:`cProfile.Profile`, ``your_time_func``'s return value will be interpreted differently:
pt_br: Потім отриманий профайлер викличе ``your_time_func``. Залежно від того, чи використовуєте ви :class:`profile.Profile` чи :class:`cProfile.Profile`, значення, що повертається ``your_time_func``, буде інтерпретуватися по-різному:

source: ``your_time_func`` should return a single number, or a list of numbers whose sum is the current time (like what :func:`os.times` returns). If the function returns a single time number, or the list of returned numbers has length 2, then you will get an especially fast version of the dispatch routine.
pt_br: ``your_time_func`` має повертати одне число або список чисел, сума яких є поточним часом (як те, що повертає :func:`os.times`). Якщо функція повертає єдине число часу або список повернутих чисел має довжину 2, тоді ви отримаєте особливо швидку версію процедури відправки.

source: Be warned that you should calibrate the profiler class for the timer function that you choose (see :ref:`profile-calibration`). For most machines, a timer that returns a lone integer value will provide the best results in terms of low overhead during profiling. (:func:`os.times` is *pretty* bad, as it returns a tuple of floating point values). If you want to substitute a better timer in the cleanest fashion, derive a class and hardwire a replacement dispatch method that best handles your timer call, along with the appropriate calibration constant.
pt_br: Майте на увазі, що вам слід відкалібрувати клас профайлера для обраної вами функції таймера (див. :ref:`profile-calibration`). Для більшості машин таймер, який повертає одне ціле значення, забезпечить найкращі результати з точки зору низьких витрат під час профілювання. (:func:`os.times` *досить* погано, оскільки повертає кортеж значень з плаваючою комою). Якщо ви хочете замінити таймер на кращий найчистіший спосіб, створіть клас і підключіть метод диспетчеризації заміни, який найкраще обробляє ваш виклик таймера, разом із відповідною константою калібрування.

source: ``your_time_func`` should return a single number. If it returns integers, you can also invoke the class constructor with a second argument specifying the real duration of one unit of time. For example, if ``your_integer_time_func`` returns times measured in thousands of seconds, you would construct the :class:`Profile` instance as follows::
pt_br: ``your_time_func`` має повертати одне число. Якщо він повертає цілі числа, ви також можете викликати конструктор класу з другим аргументом, який визначає реальну тривалість однієї одиниці часу. Наприклад, якщо ``your_integer_time_func`` повертає час, виміряний у тисячах секунд, ви повинні створити екземпляр :class:`Profile` наступним чином::

source: As the :class:`cProfile.Profile` class cannot be calibrated, custom timer functions should be used with care and should be as fast as possible. For the best results with a custom timer, it might be necessary to hard-code it in the C source of the internal :mod:`_lsprof` module.
pt_br: Оскільки клас :class:`cProfile.Profile` не можна відкалібрувати, користувацькі функції таймера слід використовувати обережно та бути якомога швидшими. Для отримання найкращих результатів із спеціальним таймером може знадобитися жорстко закодувати його у вихідному коді C внутрішнього модуля :mod:`_lsprof`.

source: Python 3.3 adds several new functions in :mod:`time` that can be used to make precise measurements of process or wall-clock time. For example, see :func:`time.perf_counter`.
pt_br: Python 3.3 додає кілька нових функцій у :mod:`time`, які можна використовувати для точного вимірювання часу процесу або настінного годинника. Наприклад, перегляньте :func:`time.perf_counter`.
