Repository: python/python-docs-pt-br
Catalog: library/pty.po
Languages: pt_br

source: :mod:`!pty` --- Pseudo-terminal utilities
pt_br: :mod:`!pty` --- Utilitários de pseudoterminal

source: **Source code:** :source:`Lib/pty.py`
pt_br: **Código-fonte:** :source:`Lib/pty.py`

source: The :mod:`pty` module defines operations for handling the pseudo-terminal concept: starting another process and being able to write to and read from its controlling terminal programmatically.
pt_br: O módulo :mod:`pty` define operações para lidar com o conceito de pseudoterminal: iniciar outro processo e poder gravar e ler de seu terminal de controle programaticamente.

source: Availability
pt_br: Disponibilidade

source: Pseudo-terminal handling is highly platform dependent. This code is mainly tested on Linux, FreeBSD, and macOS (it is supposed to work on other POSIX platforms but it's not been thoroughly tested).
pt_br: O tratamento do pseudoterminal é altamente dependente da plataforma. Esse código foi testado principalmente no Linux, no FreeBSD e no macOS (supõe-se que funcione em outras plataformas POSIX, mas não foi testado exaustivamente).

source: The :mod:`pty` module defines the following functions:
pt_br: O módulo :mod:`pty` define as seguintes funções:

source: Fork. Connect the child's controlling terminal to a pseudo-terminal. Return value is ``(pid, fd)``. Note that the child gets *pid* 0, and the *fd* is *invalid*. The parent's return value is the *pid* of the child, and *fd* is a file descriptor connected to the child's controlling terminal (and also to the child's standard input and output).
pt_br: Faz um fork. Conecta o terminal de controle do filho a um pseudoterminal. O valor de retorno é ``(pid, fd)``. Observe que a criança recebe *pid* 0 e o *fd* é *inválido*. O valor de retorno do pai é o *pid* do filho, e o *fd* é um descritor de arquivo conectado ao terminal de controle do filho (e também à entrada e à saída padrão do filho).

source: On macOS the use of this function is unsafe when mixed with using higher-level system APIs, and that includes using :mod:`urllib.request`.
pt_br: No macOS, o uso desta função é inseguro quando combinado com o uso de APIs de sistema de nível mais alto, e isso inclui o uso de :mod:`urllib.request`.

source: Open a new pseudo-terminal pair, using :func:`os.openpty` if possible, or emulation code for generic Unix systems. Return a pair of file descriptors ``(master, slave)``, for the master and the slave end, respectively.
pt_br: Abre um novo par de pseudoterminais, usando :func:`os.openpty`, se possível, ou código de emulação para sistemas genérico Unix . Retorna um par de descritores de arquivo ``(master, slave)``, para a extremidade mestre e escrava, respectivamente.

source: Spawn a process, and connect its controlling terminal with the current process's standard io. This is often used to baffle programs which insist on reading from the controlling terminal. It is expected that the process spawned behind the pty will eventually terminate, and when it does *spawn* will return.
pt_br: Gera um processo e conecta seu terminal de controle com o E/S padrão do processo atual. Isso é frequentemente usado para confundir programas que insistem em ler no terminal de controle. Espera-se que o processo gerado por trás do pty acabe sendo encerrado e, quando isso acontecer, o *spawn* é retornado.

source: A loop copies STDIN of the current process to the child and data received from the child to STDOUT of the current process. It is not signaled to the child if STDIN of the current process closes down.
pt_br: Um laço copia o STDIN do processo atual para o filho e os dados recebidos do filho para o STDOUT do site processar atual. Não é sinalizado para o filho se o STDIN do processar atual fechar.

source: The functions *master_read* and *stdin_read* are passed a file descriptor which they should read from, and they should always return a byte string. In order to force spawn to return before the child process exits an empty byte array should be returned to signal end of file.
pt_br: As funções *master_read* e o *stdin_read* recebem um descritor de arquivo do qual devem ler e devem sempre retorna uma string de bytes. Para forçar *spawn* retornar antes que o processo filho saia, um byte vazio vetor deve ser retornado para sinalizar o fim do arquivo.

source: The default implementation for both functions will read and return up to 1024 bytes each time the function is called. The *master_read* callback is passed the pseudoterminal’s master file descriptor to read output from the child process, and *stdin_read* is passed file descriptor 0, to read from the parent process's standard input.
pt_br: A implementação padrão para ambos os funções vai ler e retornar até 1024 bytes cada vez que a função for chamada. A função de retorno *master_read* é passada para o descritor de arquivo mestre do pseudoterminal para ler a saída do processo filho, e ao *stdin_read* é passado o descritor de arquivo 0, para ler a entrada padrão do processo pai.

source: Returning an empty byte string from either callback is interpreted as an end-of-file (EOF) condition, and that callback will not be called after that. If *stdin_read* signals EOF the controlling terminal can no longer communicate with the parent process OR the child process. Unless the child process will quit without any input, *spawn* will then loop forever. If *master_read* signals EOF the same behavior results (on linux at least).
pt_br: Retornar uma string de bytes vazia de qualquer uma das funções de retorno é interpretado como uma condição de fim de vida (EOF), e que a função de retorno não será chamada depois disso. Se *stdin_read* sinalizar EOF, o terminal de controle não poderá mais se comunicar com o processo pai OU o processo filho. A menos que o filho processar seja encerrado sem nenhuma entrada, *spawn* vai então fazer o laço para sempre. Se *master_read* sinalizar EOF, os mesmos comportamento resultados (pelo menos no Linux).

source: Return the exit status value from :func:`os.waitpid` on the child process.
pt_br: Retorna o valor de status de saída de :func:`os.waitpid` no processo filho.

source: :func:`os.waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
pt_br: :func:`os.waitstatus_to_exitcode` pode ser usado para converter o status de saída em um código de saída.

source: Raises an :ref:`auditing event <auditing>` ``pty.spawn`` with argument ``argv``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``pty.spawn`` com o argumento ``argv``.

source: :func:`spawn` now returns the status value from :func:`os.waitpid` on the child process.
pt_br: :func:`spawn` agora retorna o valor de status de :func:`os.waitpid` no processo filho.

source: Example
pt_br: Exemplo

source: The following program acts like the Unix command :manpage:`script(1)`, using a pseudo-terminal to record all input and output of a terminal session in a "typescript". ::
pt_br: O programa a seguir funciona como o comando Unix :manpage:`script(1)` , usando um pseudoterminal para registrar todas as entradas e saídas de uma sessão de terminal em um "script". ::
