Repository: python/python-docs-pt-br
Catalog: library/pwd.po
Languages: pt_br

source: :mod:`pwd` --- The password database
pt_br: :mod:`pwd` --- A senha do banco de dados

source: This module provides access to the Unix user account and password database. It is available on all Unix versions.
pt_br: Este módulo provê acesso ao banco de dados das contas de usuário do sistema e suas respectivas senhas. Isto está disponível para todas as versões do Unix.

source: Password database entries are reported as a tuple-like object, whose attributes correspond to the members of the ``passwd`` structure (Attribute field below, see ``<pwd.h>``):
pt_br: As entradas do banco de dados de senhas são reportadas como um objeto do tipo tupla, cujos atributos correspondem aos membros da estrutura ``passwd`` (Campos dos atributos abaixo, veja ``<pwd.h>``):

source: Index
pt_br: Índice

source: Attribute
pt_br: Atributo

source: Meaning
pt_br: Significado

source: Login name
pt_br: Nome de login

source: Optional encrypted password
pt_br: Senha encriptada opcional

source: Numerical user ID
pt_br: ID numérico do usuário

source: Numerical group ID
pt_br: ID numérico do grupo

source: User name or comment field
pt_br: Nome do usuário ou campor de comentário

source: User home directory
pt_br: Diretório home do usuário

source: User command interpreter
pt_br: Interpretador de comandos do usuário

source: The uid and gid items are integers, all others are strings. :exc:`KeyError` is raised if the entry asked for cannot be found.
pt_br: O uid e o gid são números inteiros, e os outros são strings. :exc:`KeyError` é levando se o campo requerido não puder ser encontrado.

source: In traditional Unix the field ``pw_passwd`` usually contains a password encrypted with a DES derived algorithm (see module :mod:`crypt`). However most modern unices use a so-called *shadow password* system. On those unices the *pw_passwd* field only contains an asterisk (``'*'``) or the letter ``'x'`` where the encrypted password is stored in a file :file:`/etc/shadow` which is not world readable. Whether the *pw_passwd* field contains anything useful is system-dependent. If available, the :mod:`spwd` module should be used where access to the encrypted password is required.
pt_br: No Unix tradicional, o campo ``pw_passwd`` geralmente contém uma senha criptografada com um algoritmo derivado do DES (veja o módulo :mod:`crypt`). No entanto, a maioria dos unices modernos usa um sistema chamado de *senha shadow*. Nesses unices, o campo *pw_passwd* contém apenas um asterisco (``'*'``) ou a letra ``'x'`` onde a senha criptografada é armazenada em um arquivo :file:`/etc/shadow` que não é legível para o mundo. Se o campo *pw_passwd* contém algo útil depende do sistema. Se disponível, o módulo :mod:`spwd` deve ser usado onde o acesso à senha criptografada é necessário.

source: It defines the following items:
pt_br: Isto define os seguintes itens

source: Return the password database entry for the given numeric user ID.
pt_br: Retorna a entrada do banco de dados de senhas para um dado ID de usuário

source: Return the password database entry for the given user name.
pt_br: Retorna a entrada do banco de dados de senhas para um dado nome de usuário

source: Return a list of all available password database entries, in arbitrary order.
pt_br: Retorna uma lista de todos as entradas disponíveis no banco de dados de senhas, em uma ordem arbitrária.

source: Module :mod:`grp`
pt_br: Módulo :mod:`grp`

source: An interface to the group database, similar to this.
pt_br: Uma interface para o banco de dados do grupo, similar a esta.

source: Module :mod:`spwd`
pt_br: Módulo :mod:`spwd`

source: An interface to the shadow password database, similar to this.
pt_br: Uma interface para o banco de dados de senhas shadow, similar a esta.
