Repository: python/python-docs-pt-br
Catalog: library/pyclbr.po
Languages: pt_br

source: :mod:`pyclbr` --- Python class browser support
pt_br: :mod:`pyclbr` --- Suporte a navegador de classes do Python

source: **Source code:** :source:`Lib/pyclbr.py`
pt_br: **Código-fonte:** :source:`Lib/pyclbr.py`

source: The :mod:`pyclbr` module provides limited information about the functions, classes, and methods defined in a Python-coded module. The information is sufficient to implement a module browser. The information is extracted from the Python source code rather than by importing the module, so this module is safe to use with untrusted code. This restriction makes it impossible to use this module with modules not implemented in Python, including all standard and optional extension modules.
pt_br: O módulo :mod:`pyclbr` fornece informações limitadas sobre as funções, classes e métodos definidos em um módulo codificado em Python. As informações são suficientes para implementar um navegador de módulos. As informações são extraídas do código-fonte do Python em vez de importar o módulo, portanto, este módulo é seguro para uso com código não confiável. Essa restrição torna impossível o uso deste módulo com módulos não implementados no Python, incluindo todos os módulos de extensão padrão e opcionais.

source: Return a dictionary mapping module-level class names to class descriptors. If possible, descriptors for imported base classes are included. Parameter *module* is a string with the name of the module to read; it may be the name of a module within a package. If given, *path* is a sequence of directory paths prepended to ``sys.path``, which is used to locate the module source code.
pt_br: Retorna um dicionário que mapeia os nomes de classe no nível do módulo aos descritores de classe. Se possível, descritores para classes base importadas estão incluídos. O parâmetro *module* é uma string com o nome do módulo a ser lido; pode ser o nome de um módulo dentro de um pacote. Se fornecido, *path* é uma sequência de caminhos de diretório anexada a ``sys.path``, que é usada para localizar o código-fonte do módulo.

source: Return a dictionary-based tree containing a function or class descriptors for each function and class defined in the module with a ``def`` or ``class`` statement. The returned dictionary maps module-level function and class names to their descriptors. Nested objects are entered into the children dictionary of their parent. As with readmodule, *module* names the module to be read and *path* is prepended to sys.path. If the module being read is a package, the returned dictionary has a key ``'__path__'`` whose value is a list containing the package search path.
pt_br: Retorna uma árvore baseada em dicionário que contém uma função ou descritores de classe para cada função e classe definida no módulo com uma instrução ``def`` ou ``class``. O dicionário retornado mapeia os nomes das funções e das classes no nível do módulo para seus descritores. Objetos aninhados são inseridos no dicionário filho de seus pais. Como em readmodule, *module* nomeia o módulo a ser lido e *path* é anexado ao sys.path. Se o módulo que está sendo lido for um pacote, o dicionário retornado terá uma chave ``'__path__'`` cujo valor é uma lista que contém o caminho de pesquisa do pacote.

source: Descriptors for nested definitions. They are accessed through the new children attribute. Each has a new parent attribute.
pt_br: Descritores para definições aninhadas. Eles são acessados através do novo atributo filho. Cada um tem um novo atributo pai.

source: The descriptors returned by these functions are instances of Function and Class classes. Users are not expected to create instances of these classes.
pt_br: Os descritores retornados por essas funções são instâncias das classes Function e Class. Não se espera que os usuários criem instâncias dessas classes.

source: Function Objects
pt_br: Objetos de Function

source: Class :class:`Function` instances describe functions defined by def statements. They have the following attributes:
pt_br: Instâncias da classe :class:`Function` descrevem funções definidas por instruções def. Elas têm os seguintes atributos:

source: Name of the file in which the function is defined.
pt_br: Nome do arquivo no qual a função está definida.

source: The name of the module defining the function described.
pt_br: O nome do módulo que define a função descrita.

source: The name of the function.
pt_br: O nome da função.

source: The line number in the file where the definition starts.
pt_br: O número da linha no arquivo em que a definição é iniciada.

source: For top-level functions, None. For nested functions, the parent.
pt_br: Para funções de nível superior, None. Para funções aninhadas, o pai.

source: A dictionary mapping names to descriptors for nested functions and classes.
pt_br: Um dicionário que mapeia nomes para descritores para funções e classes aninhadas.

source: Class Objects
pt_br: Objetos de Class

source: Class :class:`Class` instances describe classes defined by class statements. They have the same attributes as Functions and two more.
pt_br: Instâncias da classe :class:`Class` descrevem classes definidas por instruções class. Elas têm os mesmos atributos que Functions e mais dois.

source: Name of the file in which the class is defined.
pt_br: Nome do arquivo no qual a classe está definida.

source: The name of the module defining the class described.
pt_br: O nome do módulo que define a classe descrita.

source: The name of the class.
pt_br: O nome da classe.

source: For top-level classes, None. For nested classes, the parent.
pt_br: Para classes de nível superior, None. Para classes aninhadas, o pai.

source: A list of :class:`Class` objects which describe the immediate base classes of the class being described. Classes which are named as superclasses but which are not discoverable by :func:`readmodule_ex` are listed as a string with the class name instead of as :class:`Class` objects.
pt_br: Uma lista de objetos :class:`Class` que descreve as classes base imediatas da classe que está sendo descrita. Classes nomeadas como superclasses, mas que não podem ser descobertas por :func:`readmodule_ex` são listadas como uma string com o nome da classe em vez de como objetos de :class:`Class`.

source: A dictionary mapping method names to line numbers. This can be derived from the newer children dictionary, but remains for back-compatibility.
pt_br: Um dicionário que mapeia nomes de métodos para números de linha. Isso pode ser derivado do dicionário filho mais novo, mas permanece para compatibilidade retroativa.
