Repository: python/python-docs-pt-br
Catalog: library/pydoc.po
Languages: pt_br

source: :mod:`!pydoc` --- Documentation generator and online help system
pt_br: :mod:`!pydoc` --- Gerador de documentação e sistema de ajuda online

source: **Source code:** :source:`Lib/pydoc.py`
pt_br: **Código-fonte:** :source:`Lib/pydoc.py`

source: The :mod:`!pydoc` module automatically generates documentation from Python modules. The documentation can be presented as pages of text on the console, served to a web browser, or saved to HTML files.
pt_br: O módulo :mod:`!pydoc` gera automaticamente a documentação dos módulos Python. A documentação pode ser apresentada como páginas de texto no console, servida em um navegador web ou salva em arquivos HTML.

source: For modules, classes, functions and methods, the displayed documentation is derived from the docstring (i.e. the :attr:`~definition.__doc__` attribute) of the object, and recursively of its documentable members. If there is no docstring, :mod:`!pydoc` tries to obtain a description from the block of comment lines just above the definition of the class, function or method in the source file, or at the top of the module (see :func:`inspect.getcomments`).
pt_br: Para módulos, classes, funções e métodos, a documentação exibida é derivada da docstring (ou seja, o atributo :attr:`~definition.__doc__`) do objeto, e recursivamente de seus membros documentáveis. Se não houver docstring, :mod:`!pydoc` tenta obter uma descrição do bloco de linhas de comentário logo acima da definição da classe, função ou método no arquivo fonte, ou no topo do módulo (consulte :func:`inspect.getcomments`).

source: The built-in function :func:`help` invokes the online help system in the interactive interpreter, which uses :mod:`!pydoc` to generate its documentation as text on the console. The same text documentation can also be viewed from outside the Python interpreter by running :program:`pydoc` as a script at the operating system's command prompt. For example, running ::
pt_br: A função embutida :func:`help` invoca o sistema de ajuda online no interpretador interativo, que usa :mod:`!pydoc` para gerar sua documentação como texto no console. A mesma documentação de texto também pode ser vista de fora do interpretador Python executando :program:`pydoc` como um script no prompt de comando do sistema operacional. Por exemplo, executar ::

source: at a shell prompt will display documentation on the :mod:`sys` module, in a style similar to the manual pages shown by the Unix :program:`man` command. The argument to :program:`pydoc` can be the name of a function, module, or package, or a dotted reference to a class, method, or function within a module or module in a package. If the argument to :program:`pydoc` looks like a path (that is, it contains the path separator for your operating system, such as a slash in Unix), and refers to an existing Python source file, then documentation is produced for that file.
pt_br: em um prompt de console exibirá a documentação do módulo :mod:`sys`, em um estilo semelhante às páginas de manual mostradas pelo comando Unix :program:`man`. O argumento para :program:`pydoc` pode ser o nome de uma função, módulo ou pacote, ou uma referência pontilhada a uma classe, método ou função dentro de um módulo ou módulo em um pacote. Se o argumento para :program:`pydoc` parecer um caminho (ou seja, ele contém o separador de caminho para o seu sistema operacional, como uma barra no Unix) e se refere a um arquivo fonte Python existente, então a documentação é produzida para esse arquivo.

source: In order to find objects and their documentation, :mod:`!pydoc` imports the module(s) to be documented. Therefore, any code on module level will be executed on that occasion. Use an ``if __name__ == '__main__':`` guard to only execute code when a file is invoked as a script and not just imported.
pt_br: Para encontrar objetos e sua documentação, :mod:`!pydoc` importa os módulos a serem documentados. Portanto, qualquer código no nível do módulo será executado nessa ocasião. Use uma proteção ``if __name__ == '__main__':`` para executar código apenas quando um arquivo é chamado como um script e não apenas importado.

source: When printing output to the console, :program:`pydoc` attempts to paginate the output for easier reading. If either the :envvar:`MANPAGER` or the :envvar:`PAGER` environment variable is set, :program:`pydoc` will use its value as a pagination program. When both are set, :envvar:`MANPAGER` is used.
pt_br: Ao imprimir a saída para o console, :program:`pydoc` tenta paginar a saída para facilitar a leitura. Se a variável de ambiente :envvar:`MANPAGER` ou a :envvar:`PAGER` estiver definida, :program:`pydoc` usará seu valor como um programa de paginação. Quando ambas estiverem definidas, :envvar:`MANPAGER` é usada.

source: Specifying a ``-w`` flag before the argument will cause HTML documentation to be written out to a file in the current directory, instead of displaying text on the console.
pt_br: Especificar um sinalizador ``-w`` antes do argumento fará com que a documentação HTML seja escrita em um arquivo no diretório atual, ao invés de exibir texto no console.

source: Specifying a ``-k`` flag before the argument will search the synopsis lines of all available modules for the keyword given as the argument, again in a manner similar to the Unix :program:`man` command. The synopsis line of a module is the first line of its documentation string.
pt_br: Especificar um sinalizador ``-k`` antes do argumento irá pesquisar as linhas de sinopse de todos os módulos disponíveis para a palavra reservada fornecida como o argumento, novamente de uma maneira semelhante ao comando Unix :program:`man`. A linha de sinopse de um módulo é a primeira linha de sua string de documentação.

source: You can also use :program:`pydoc` to start an HTTP server on the local machine that will serve documentation to visiting web browsers. :program:`python -m pydoc -p 1234` will start a HTTP server on port 1234, allowing you to browse the documentation at ``http://localhost:1234/`` in your preferred web browser. Specifying ``0`` as the port number will select an arbitrary unused port.
pt_br: Você também pode usar :program:`pydoc` para iniciar um servidor HTTP na máquina local que servirá a documentação para os navegadores web visitantes. :program:`python -m pydoc -p 1234` irá iniciar um servidor HTTP na porta 1234, permitindo que você navegue pela documentação em ``http://localhost:1234/`` em seu navegador preferido. Especificar ``0`` como o número da porta irá selecionar uma porta não utilizada arbitrária.

source: :program:`python -m pydoc -n <hostname>` will start the server listening at the given hostname. By default the hostname is 'localhost' but if you want the server to be reached from other machines, you may want to change the host name that the server responds to. During development this is especially useful if you want to run pydoc from within a container.
pt_br: :program:`python -m pydoc -n <hostname>` irá iniciar o servidor ouvindo no nome de host fornecido. Por padrão, o nome de host é "localhost", mas se você deseja que o servidor seja acessado por outras máquinas, você pode alterar o nome de host ao qual o servidor responde. Durante o desenvolvimento, isso é especialmente útil se você deseja executar o pydoc de dentro de um contêiner.

source: :program:`python -m pydoc -b` will start the server and additionally open a web browser to a module index page. Each served page has a navigation bar at the top where you can *Get* help on an individual item, *Search* all modules with a keyword in their synopsis line, and go to the *Module index*, *Topics* and *Keywords* pages.
pt_br: :program:`python -m pydoc -b` irá iniciar o servidor e, adicionalmente, abrir um navegador da web para uma página de índice do módulo. Cada página exibida tem uma barra de navegação na parte superior onde você pode escolher *Get* para obter ajuda em um item individual, *Search* para pesquisar todos os módulos com uma palavra reservada em sua linha de sinopse e ir para as páginas de índice do módulo em *Module index*, tópicos em *Topics* e palavras reservadas em *Keywords*.

source: When :program:`pydoc` generates documentation, it uses the current environment and path to locate modules. Thus, invoking :program:`pydoc spam` documents precisely the version of the module you would get if you started the Python interpreter and typed ``import spam``.
pt_br: Quando :program:`pydoc` gera documentação, ele usa o ambiente atual e o caminho para localizar os módulos. Assim, invocar :program:`pydoc spam` documenta precisamente a versão do módulo que você obteria se iniciasse o interpretador Python e digitasse ``import spam``.

source: Module docs for core modules are assumed to reside in ``https://docs.python.org/X.Y/library/`` where ``X`` and ``Y`` are the major and minor version numbers of the Python interpreter. This can be overridden by setting the :envvar:`!PYTHONDOCS` environment variable to a different URL or to a local directory containing the Library Reference Manual pages.
pt_br: Os documentos do módulo para os módulos principais são presumidos como residindo em ``https://docs.python.org/X.Y/library/``, sendo ``X`` e ``Y`` os números de versão principal e secundária do interpretador Python. Isso pode ser substituído definindo a variável de ambiente :envvar:`!PYTHONDOCS` para uma URL diferente ou para um diretório local contendo as páginas do Manual de Referência da Biblioteca.

source: Added the ``-b`` option.
pt_br: Adicionada a opção ``-b``.

source: The ``-g`` command line option was removed.
pt_br: A opção de linha de comando ``-g`` foi removida.

source: :mod:`!pydoc` now uses :func:`inspect.signature` rather than :func:`inspect.getfullargspec` to extract signature information from callables.
pt_br: :mod:`!pydoc` agora usa :func:`inspect.signature` em vez de :func:`inspect.getfullargspec` para extrair informações de assinatura de chamáveis.

source: Added the ``-n`` option.
pt_br: Adicionada a opção ``-n``.

source: documentation
pt_br: documentação

source: generation
pt_br: geração
