Repository: python/python-docs-pt-br
Catalog: library/random.po
Languages: pt_br

source: :mod:`!random` --- Generate pseudo-random numbers
pt_br: :mod:`!random` --- Gera números pseudoaleatórios

source: **Source code:** :source:`Lib/random.py`
pt_br: **Código-fonte:** :source:`Lib/random.py`

source: This module implements pseudo-random number generators for various distributions.
pt_br: Este módulo implementa geradores de números pseudoaleatórios para várias distribuições.

source: For integers, there is uniform selection from a range. For sequences, there is uniform selection of a random element, a function to generate a random permutation of a list in-place, and a function for random sampling without replacement.
pt_br: Para números inteiros, há uma seleção uniforme de um intervalo. Para sequências, há uma seleção uniforme de um elemento aleatório, uma função para gerar uma permutação aleatória de uma lista internamanete e uma função para amostragem aleatória sem substituição.

source: On the real line, there are functions to compute uniform, normal (Gaussian), lognormal, negative exponential, gamma, and beta distributions. For generating distributions of angles, the von Mises distribution is available.
pt_br: Na linha real, existem funções para calcular distribuições uniforme, normal (gaussiana), log-normal, exponencial negativa, gama e beta. Para gerar distribuições de ângulos, a distribuição de von Mises está disponível.

source: Almost all module functions depend on the basic function :func:`.random`, which generates a random float uniformly in the half-open range ``0.0 <= X < 1.0``. Python uses the Mersenne Twister as the core generator. It produces 53-bit precision floats and has a period of 2\*\*19937-1. The underlying implementation in C is both fast and threadsafe. The Mersenne Twister is one of the most extensively tested random number generators in existence. However, being completely deterministic, it is not suitable for all purposes, and is completely unsuitable for cryptographic purposes.
pt_br: Quase todas as funções do módulo dependem da função básica :func:`.random`, que gera um ponto flutuante aleatório uniformemente no intervalo semiaberto ``0.0 <= X < 1.0``. Python usa o Mersenne Twister como gerador de núcleo. Produz pontos flutuantes de precisão de 53 bits e possui um período de 2\*\*19937-1. A implementação subjacente em C é rápida e segura para threads. O Mersenne Twister é um dos geradores de números aleatórios mais amplamente testados existentes. No entanto, sendo completamente determinístico, não é adequado para todos os fins e é totalmente inadequado para fins criptográficos.

source: The functions supplied by this module are actually bound methods of a hidden instance of the :class:`random.Random` class. You can instantiate your own instances of :class:`Random` to get generators that don't share state.
pt_br: As funções fornecidas por este módulo são, na verdade, métodos vinculados de uma instância oculta da classe :class:`random.Random`. Você pode instanciar suas próprias instâncias de :class:`Random` para obter geradores que não compartilham estado.

source: Class :class:`Random` can also be subclassed if you want to use a different basic generator of your own devising: see the documentation on that class for more details.
pt_br: A classe :class:`Random` também pode ser subclassificada se você quiser usar um gerador básico diferente de sua própria criação: veja a documentação dessa classe para mais detalhes.

source: The :mod:`random` module also provides the :class:`SystemRandom` class which uses the system function :func:`os.urandom` to generate random numbers from sources provided by the operating system.
pt_br: O módulo :mod:`random` também fornece a classe :class:`SystemRandom` que usa a função do sistema :func:`os.urandom` para gerar números aleatórios a partir de fontes fornecidas pelo sistema operacional.

source: The pseudo-random generators of this module should not be used for security purposes. For security or cryptographic uses, see the :mod:`secrets` module.
pt_br: Os geradores pseudoaleatórios deste módulo não devem ser usados para fins de segurança. Para segurança ou uso criptográfico, veja o módulo :mod:`secrets`.

source: `Complementary-Multiply-with-Carry recipe <https://code.activestate.com/recipes/576707-long-period-random-number-generator/>`_ for a compatible alternative random number generator with a long period and comparatively simple update operations.
pt_br: `Receita de Complementary-Multiply-with-Carry <https://code.activestate.com/recipes/576707-long-period-random-number-generator/>`_ para um gerador de números aleatórios alternativo compatível com um longo período e operações de atualização comparativamente simples.

source: The global random number generator and instances of :class:`Random` are thread-safe. However, in the free-threaded build, concurrent calls to the global generator or to the same instance of :class:`Random` may encounter contention and poor performance. Consider using separate instances of :class:`Random` per thread instead.
pt_br: O gerador global de números aleatórios e as instâncias de :class:`Random` são seguros para thread. No entanto, na construção com threads livres, chamadas simultâneas ao gerador global ou à mesma instância de :class:`Random` podem encontrar contenção e baixo desempenho. Considere usar instâncias separadas de :class:`Random` por thread.

source: Bookkeeping functions
pt_br: Funções de contabilidade

source: Initialize the random number generator.
pt_br: Inicializa o gerador de números aleatórios.

source: If *a* is omitted or ``None``, the current system time is used. If randomness sources are provided by the operating system, they are used instead of the system time (see the :func:`os.urandom` function for details on availability).
pt_br: Se *a* for omitido ou ``None``, a hora atual do sistema será usada. Se fontes de aleatoriedade são fornecidas pelo sistema operacional, elas são usadas no lugar da hora do sistema (consulte a função :func:`os.urandom` para detalhes sobre disponibilidade).

source: If *a* is an int, it is used directly.
pt_br: Se *a* é um int, ele é usado diretamente.

source: With version 2 (the default), a :class:`str`, :class:`bytes`, or :class:`bytearray` object gets converted to an :class:`int` and all of its bits are used.
pt_br: Com a versão 2 (o padrão), o objeto a :class:`str`, :class:`bytes` ou :class:`bytearray` é convertido em um objeto :class:`int` e todos os seus bits são usados.

source: With version 1 (provided for reproducing random sequences from older versions of Python), the algorithm for :class:`str` and :class:`bytes` generates a narrower range of seeds.
pt_br: Com a versão 1 (fornecida para reproduzir sequências aleatórias de versões mais antigas do Python), o algoritmo para :class:`str` e :class:`bytes` gera um intervalo mais restrito de sementes.

source: Moved to the version 2 scheme which uses all of the bits in a string seed.
pt_br: Movido para o esquema da versão 2, que usa todos os bits em uma semente de strings.

source: The *seed* must be one of the following types: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
pt_br: *seed* deve ser um dos seguintes tipos: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` ou :class:`bytearray`.

source: Return an object capturing the current internal state of the generator. This object can be passed to :func:`setstate` to restore the state.
pt_br: Retorna um objeto capturando o estado interno atual do gerador. Este objeto pode ser passado para :func:`setstate` para restaurar o estado.

source: *state* should have been obtained from a previous call to :func:`getstate`, and :func:`setstate` restores the internal state of the generator to what it was at the time :func:`getstate` was called.
pt_br: *state* deveria ter sido obtido de uma chamada anterior para :func:`getstate`, e :func:`setstate` restaura o estado interno do gerador para o que era no momento que :func:`getstate` foi chamado.

source: Functions for bytes
pt_br: Funções para bytes

source: Generate *n* random bytes.
pt_br: Gera *n* bytes aleatórios.

source: This method should not be used for generating security tokens. Use :func:`secrets.token_bytes` instead.
pt_br: Este método não deve ser usado para gerar tokens de segurança. Use :func:`secrets.token_bytes`.

source: Functions for integers
pt_br: Funções para inteiros

source: Return a randomly selected element from ``range(start, stop, step)``.
pt_br: Retorna um elemento selecionado aleatoriamente de ``range(start, stop, step)``.

source: This is roughly equivalent to ``choice(range(start, stop, step))`` but supports arbitrarily large ranges and is optimized for common cases.
pt_br: Isso é aproximadamente equivalente a ``choice(range(start, stop, step))`` mas provê suporte a intervalos arbitrariamente grandes e é otimizado para casos comuns.

source: The positional argument pattern matches the :func:`range` function.
pt_br: O padrão de argumento posicional corresponde à função :func:`range`.

source: Keyword arguments should not be used because they can be interpreted in unexpected ways. For example ``randrange(start=100)`` is interpreted as ``randrange(0, 100, 1)``.
pt_br: Argumentos nomeados não devem ser usados porque podem ser interpretados de maneiras inesperadas. Por exemplo ``randrange(start=100)`` é interpretado como ``randrange(0, 100, 1)``.

source: :meth:`randrange` is more sophisticated about producing equally distributed values. Formerly it used a style like ``int(random()*n)`` which could produce slightly uneven distributions.
pt_br: :meth:`randrange` é mais sofisticado em produzir valores igualmente distribuídos. Anteriormente, usava um estilo como ``int(random()*n)``, que poderia produzir distribuições ligeiramente desiguais.

source: Automatic conversion of non-integer types is no longer supported. Calls such as ``randrange(10.0)`` and ``randrange(Fraction(10, 1))`` now raise a :exc:`TypeError`.
pt_br: A conversão automática de tipos não inteiros não é mais suportada. Chamadas como ``randrange(10.0)`` e ``randrange(Fraction(10, 1))`` agora levantam uma :exc:`TypeError`.

source: Return a random integer *N* such that ``a <= N <= b``. Alias for ``randrange(a, b+1)``.
pt_br: Retorna um inteiro aleatório *N* de forma que ``a <= N <= b``. Apelido para ``randrange(a, b+1)``.

source: Returns a non-negative Python integer with *k* random bits. This method is supplied with the Mersenne Twister generator and some other generators may also provide it as an optional part of the API. When available, :meth:`getrandbits` enables :meth:`randrange` to handle arbitrarily large ranges.
pt_br: Retorna um número inteiro Python não-negativo com bits aleatórios *k*. Este método é fornecido com o gerador Mersenne Twister e alguns outros geradores também podem fornecê-lo como uma parte opcional da API. Quando disponível, :meth:`getrandbits` permite que :meth:`randrange` manipule intervalos arbitrariamente grandes.

source: This method now accepts zero for *k*.
pt_br: Este método agora aceita zero em *k*.

source: Functions for sequences
pt_br: Funções para sequências

source: Return a random element from the non-empty sequence *seq*. If *seq* is empty, raises :exc:`IndexError`.
pt_br: Retorna um elemento aleatório da sequência não vazia *seq*. Se *seq* estiver vazio, levanta :exc:`IndexError`.

source: Return a *k* sized list of elements chosen from the *population* with replacement. If the *population* is empty, raises :exc:`IndexError`.
pt_br: Retorna uma lista do tamanho de *k* de elementos escolhidos da *population* com substituição. Se a *population* estiver vazio, levanta :exc:`IndexError`.

source: If a *weights* sequence is specified, selections are made according to the relative weights. Alternatively, if a *cum_weights* sequence is given, the selections are made according to the cumulative weights (perhaps computed using :func:`itertools.accumulate`). For example, the relative weights ``[10, 5, 30, 5]`` are equivalent to the cumulative weights ``[10, 15, 45, 50]``. Internally, the relative weights are converted to cumulative weights before making selections, so supplying the cumulative weights saves work.
pt_br: Se uma sequência *weights* for especificada, as seleções serão feitas de acordo com os pesos relativos. Alternativamente, se uma sequência *cum_weights* for fornecida, as seleções serão feitas de acordo com os pesos cumulativos (talvez calculados usando :func:`itertools.accumulate`). Por exemplo, os pesos relativos ``[10, 5, 30, 5]`` são equivalentes aos pesos cumulativos ``[10, 15, 45, 50]``. Internamente, os pesos relativos são convertidos em pesos acumulados antes de fazer seleções, portanto, fornecer pesos cumulativos economiza trabalho.

source: If neither *weights* nor *cum_weights* are specified, selections are made with equal probability. If a weights sequence is supplied, it must be the same length as the *population* sequence. It is a :exc:`TypeError` to specify both *weights* and *cum_weights*.
pt_br: Se nem *weights* nem *cum_weights* forem especificados, as seleções serão feitas com igual probabilidade. Se uma sequência de pesos for fornecida, ela deverá ter o mesmo comprimento que a sequência *population*. É um :exc:`TypeError` para especificar ambos os *weights* e *cum_weights*.

source: The *weights* or *cum_weights* can use any numeric type that interoperates with the :class:`float` values returned by :func:`random` (that includes integers, floats, and fractions but excludes decimals). Weights are assumed to be non-negative and finite. A :exc:`ValueError` is raised if all weights are zero.
pt_br: *weights* ou *cum_weights* pode usar qualquer tipo numérico que interopera com os valores :class:`float` retornados por :func:`random` (que inclui inteiros, pontos flutuantes, e frações mas exclui decimais). Presume-se que pesos serão não-negativos e finitos. Uma :exc:`ValueError` é levantada se todos os pesos forem zero.

source: For a given seed, the :func:`choices` function with equal weighting typically produces a different sequence than repeated calls to :func:`choice`. The algorithm used by :func:`choices` uses floating-point arithmetic for internal consistency and speed. The algorithm used by :func:`choice` defaults to integer arithmetic with repeated selections to avoid small biases from round-off error.
pt_br: Para uma dada semente, a função :func:`choices` com igual peso normalmente produz uma sequência diferente das chamadas repetidas para :func:`choice`. O algoritmo usado por :func:`choice` usa aritmética de ponto flutuante para consistência e velocidade internas. O algoritmo usado por :func:`choice` assume como padrão aritmética inteira com seleções repetidas para evitar pequenos vieses de erro de arredondamento.

source: Raises a :exc:`ValueError` if all weights are zero.
pt_br: Levanta uma :exc:`ValueError` se todos os pesos forem zero.

source: Shuffle the sequence *x* in place.
pt_br: Embaralha a sequência *x* internamente.

source: To shuffle an immutable sequence and return a new shuffled list, use ``sample(x, k=len(x))`` instead.
pt_br: Para embaralhar uma sequência imutável e retornar uma nova lista embaralhada, use ``sample(x, k=len(x))``.

source: Note that even for small ``len(x)``, the total number of permutations of *x* can quickly grow larger than the period of most random number generators. This implies that most permutations of a long sequence can never be generated. For example, a sequence of length 2080 is the largest that can fit within the period of the Mersenne Twister random number generator.
pt_br: Observe que, mesmo para pequenos ``len(x)``, o número total de permutações de *x* pode crescer rapidamente maior que o período da maioria dos geradores de números aleatórios. Isso implica que a maioria das permutações de uma longa sequência nunca pode ser gerada. Por exemplo, uma sequência de comprimento 2080 é a maior que pode caber no período do gerador de números aleatórios Mersenne Twister.

source: Removed the optional parameter *random*.
pt_br: Removido o parâmetro opcional *random*.

source: Return a *k* length list of unique elements chosen from the population sequence. Used for random sampling without replacement.
pt_br: Retorna uma lista de comprimento *k* de elementos únicos escolhidos na sequência populacional. Usado para amostragem aleatória sem reposição.

source: Returns a new list containing elements from the population while leaving the original population unchanged. The resulting list is in selection order so that all sub-slices will also be valid random samples. This allows raffle winners (the sample) to be partitioned into grand prize and second place winners (the subslices).
pt_br: Retorna uma nova lista contendo elementos da população, mantendo a população original inalterada. A lista resultante está na ordem de seleção, para que todas as subfatias também sejam amostras aleatórias válidas. Isso permite que os vencedores do sorteio (a amostra) sejam divididos em grandes prêmios e vencedores de segundo lugar (as subfatias).

source: Members of the population need not be :term:`hashable` or unique. If the population contains repeats, then each occurrence is a possible selection in the sample.
pt_br: Os membros da população não precisam ser :term:`hasheáveis <hasheável>` ou únicos. Se a população contiver repetições, cada ocorrência é uma seleção possível na amostra.

source: Repeated elements can be specified one at a time or with the optional keyword-only *counts* parameter. For example, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` is equivalent to ``sample(['red', 'red', 'red', 'red', 'blue', 'blue'], k=5)``.
pt_br: Elementos repetidos podem ser especificados um de cada vez ou com o parâmetro somente-nomeado opcional *count*. Por exemplo, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` é equivalente a ``sample(['red', 'red', 'red', 'red', 'blue', 'blue'], k=5)``.

source: To choose a sample from a range of integers, use a :func:`range` object as an argument. This is especially fast and space efficient for sampling from a large population: ``sample(range(10000000), k=60)``.
pt_br: Para escolher uma amostra de um intervalo de números inteiros, use um objeto :func:`range` como argumento. Isso é especialmente rápido e com eficiência de espaço para amostragem de uma grande população: ``sample(range(10000000), k=60)``.

source: If the sample size is larger than the population size, a :exc:`ValueError` is raised.
pt_br: Se o tamanho da amostra for maior que o tamanho da população, uma :exc:`ValueError` é levantada.

source: Added the *counts* parameter.
pt_br: Adicionado o parâmetro *counts*.

source: The *population* must be a sequence. Automatic conversion of sets to lists is no longer supported.
pt_br: *population* deve ser uma sequência. A conversão automática de conjuntos em listas não é mais suportada.

source: Discrete distributions
pt_br: Distribuições discretas

source: The following function generates a discrete distribution.
pt_br: A função a seguir gera uma distribuição discreta.

source: `Binomial distribution <https://mathworld.wolfram.com/BinomialDistribution.html>`_. Return the number of successes for *n* independent trials with the probability of success in each trial being *p*:
pt_br: `Distribuição binomial <https://mathworld.wolfram.com/BinomialDistribution.html>`_. Retorna o número de sucessos para *n* tentativas independentes com a probabilidade de sucesso em cada tentativa sendo *p*:

source: Mathematically equivalent to::
pt_br: Matematicamente equivalente a::

source: The number of trials *n* should be a non-negative integer. The probability of success *p* should be between ``0.0 <= p <= 1.0``. The result is an integer in the range ``0 <= X <= n``.
pt_br: O número de tentativas *n* deve ser um número inteiro não negativo. A probabilidade de sucesso *p* deve estar entre ``0.0 <= p <= 1.0``. O resultado é um número inteiro no intervalo ``0 <= X <= n``.

source: Real-valued distributions
pt_br: Distribuições com valor real

source: The following functions generate specific real-valued distributions. Function parameters are named after the corresponding variables in the distribution's equation, as used in common mathematical practice; most of these equations can be found in any statistics text.
pt_br: As funções a seguir geram distribuições específicas com valor real. Os parâmetros de função são nomeados após as variáveis correspondentes na equação da distribuição, conforme usadas na prática matemática comum; a maioria dessas equações pode ser encontrada em qualquer texto estatístico.

source: Return the next random floating-point number in the range ``0.0 <= X < 1.0``
pt_br: Retorna o próximo número aleatório de ponto flutuante no intervalo ``0.0 <= X < 1.0``.

source: Return a random floating-point number *N* such that ``a <= N <= b`` for ``a <= b`` and ``b <= N <= a`` for ``b < a``.
pt_br: Retorna um número de ponto flutuante aleatório *N* de forma que ``a <= N <= b`` para ``a <= b`` e ``b <= N <= a`` para ``b < a``.

source: The end-point value ``b`` may or may not be included in the range depending on floating-point rounding in the expression ``a + (b-a) * random()``.
pt_br: O valor final ``b`` pode ou não ser incluído no intervalo dependendo do arredondamento de ponto flutuante na expressão ``a + (b-a) * random()``.

source: Return a random floating-point number *N* such that ``low <= N <= high`` and with the specified *mode* between those bounds. The *low* and *high* bounds default to zero and one. The *mode* argument defaults to the midpoint between the bounds, giving a symmetric distribution.
pt_br: Retorna um número de ponto flutuante aleatório *N* de forma que ``low <= N <= high`` e com o *mode* especificado entre esses limites. Os limites *low* e *high* são padronizados como zero e um. O argumento *mode* assume como padrão o ponto médio entre os limites, fornecendo uma distribuição simétrica.

source: Beta distribution. Conditions on the parameters are ``alpha > 0`` and ``beta > 0``. Returned values range between 0 and 1.
pt_br: Distribuição beta. As condições nos parâmetros são ``alpha > 0`` e ``beta > 0``. Os valores retornados variam entre 0 e 1.

source: Exponential distribution. *lambd* is 1.0 divided by the desired mean. It should be nonzero. (The parameter would be called "lambda", but that is a reserved word in Python.) Returned values range from 0 to positive infinity if *lambd* is positive, and from negative infinity to 0 if *lambd* is negative.
pt_br: Distribuição exponencial. *lambd* é 1.0 dividido pela média desejada. Deve ser diferente de zero. (O parâmetro seria chamado "lambda", mas é uma palavra reservada em Python.) Os valores retornados variam de 0 a infinito positivo se *lambd* for positivo e de infinito negativo a 0 se *lambd* for negativo.

source: Added the default value for ``lambd``.
pt_br: Adicionado o valor padrão para ``lambd``.

source: Gamma distribution. (*Not* the gamma function!) The shape and scale parameters, *alpha* and *beta*, must have positive values. (Calling conventions vary and some sources define 'beta' as the inverse of the scale).
pt_br: Distribuição gama. (*Não* a função gama!) Os parâmetros de forma e escala, *alfa* e *beta*, devem ter valores positivos. (As convenções de chamada variam e algumas fontes definem 'beta' como o inverso da escala).

source: The probability distribution function is::
pt_br: A função de distribuição de probabilidade é::
