Repository: python/python-docs-pt-br
Catalog: library/random.po
Languages: pt_br

source: Normal distribution, also called the Gaussian distribution. *mu* is the mean, and *sigma* is the standard deviation. This is slightly faster than the :func:`normalvariate` function defined below.
pt_br: Distribuição normal, também chamada de distribuição gaussiana. *mu* é a média e *sigma* é o desvio padrão. Isto é um pouco mais rápido que a função :func:`normalvariate` definida abaixo.

source: Multithreading note: When two threads call this function simultaneously, it is possible that they will receive the same return value. This can be avoided in three ways. 1) Have each thread use a different instance of the random number generator. 2) Put locks around all calls. 3) Use the slower, but thread-safe :func:`normalvariate` function instead.
pt_br: Nota sobre multithreading: quando duas threads chamam esta função simultaneamente, é possível que recebam o mesmo valor de retorno. Isso pode ser evitado de três maneiras. 1) Fazer com que cada thread use uma instância diferente do gerador de números aleatórios. 2) Colocar travas em todas as chamadas. 3) Usar a função mais lenta, mas segura para thread :func:`normalvariate`.

source: *mu* and *sigma* now have default arguments.
pt_br: *mu* e *sigma* agora têm argumentos padrão.

source: Log normal distribution. If you take the natural logarithm of this distribution, you'll get a normal distribution with mean *mu* and standard deviation *sigma*. *mu* can have any value, and *sigma* must be greater than zero.
pt_br: Distribuição log normal. Se você usar o logaritmo natural dessa distribuição, obterá uma distribuição normal com média *mu* e desvio padrão *sigma*. *mu* pode ter qualquer valor e *sigma* deve ser maior que zero.

source: Normal distribution. *mu* is the mean, and *sigma* is the standard deviation.
pt_br: Distribuição normal. *mu* é a média e *sigma* é o desvio padrão.

source: *mu* is the mean angle, expressed in radians between 0 and 2\*\ *pi*, and *kappa* is the concentration parameter, which must be greater than or equal to zero. If *kappa* is equal to zero, this distribution reduces to a uniform random angle over the range 0 to 2\*\ *pi*.
pt_br: *mu* é o ângulo médio, expresso em radianos entre 0 e 2\*\ *pi*, e *kappa* é o parâmetro de concentração, que deve ser maior ou igual a zero. Se *kappa* for igual a zero, essa distribuição será reduzida para um ângulo aleatório uniforme no intervalo de 0 a 2\*\ *pi*.

source: Pareto distribution. *alpha* is the shape parameter.
pt_br: Distribuição de Pareto. *alpha* é o parâmetro de forma.

source: Weibull distribution. *alpha* is the scale parameter and *beta* is the shape parameter.
pt_br: Distribuição Weibull. *alpha* é o parâmetro de escala e *beta* é o parâmetro de forma.

source: Alternative Generator
pt_br: Gerador alternativo

source: Class that implements the default pseudo-random number generator used by the :mod:`random` module.
pt_br: Classe que implementa o gerador de números pseudoaleatórios padrão usado pelo módulo :mod:`random`.

source: Formerly the *seed* could be any hashable object. Now it is limited to: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
pt_br: Anteriormente, o *seed* poderia ser qualquer objeto hasheável. Agora está limitado a: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` ou :class:`bytearray`.

source: Subclasses of :class:`!Random` should override the following methods if they wish to make use of a different basic generator:
pt_br: Subclasses de :class:`!Random` devem substituir os seguintes métodos se desejarem fazer uso de um gerador básico diferente:

source: Override this method in subclasses to customise the :meth:`~random.seed` behaviour of :class:`!Random` instances.
pt_br: Substitua este método nas subclasses para personalizar o comportamento de :meth:`~random.seed` das instâncias de :class:`!Random`.

source: Override this method in subclasses to customise the :meth:`~random.getstate` behaviour of :class:`!Random` instances.
pt_br: Substitua este método nas subclasses para personalizar o comportamento de :meth:`~random.getstate` das instâncias de :class:`!Random`.

source: Override this method in subclasses to customise the :meth:`~random.setstate` behaviour of :class:`!Random` instances.
pt_br: Substitua este método nas subclasses para personalizar o comportamento de :meth:`~random.setstate` das instâncias de :class:`!Random`.

source: Override this method in subclasses to customise the :meth:`~random.random` behaviour of :class:`!Random` instances.
pt_br: Substitua este método nas subclasses para personalizar o comportamento de :meth:`~random.random` das instâncias de :class:`!Random`.

source: Optionally, a custom generator subclass can also supply the following method:
pt_br: Opcionalmente, uma subclasse geradora personalizada também pode fornecer o seguinte método:

source: Override this method in subclasses to customise the :meth:`~random.getrandbits` behaviour of :class:`!Random` instances.
pt_br: Substitua este método nas subclasses para personalizar o comportamento de :meth:`~random.getrandbits` das instâncias de :class:`!Random`.

source: Override this method in subclasses to customise the :meth:`~random.randbytes` behaviour of :class:`!Random` instances.
pt_br: Substitua este método nas subclasses para personalizar o comportamento de :meth:`~random.randbytes` das instâncias de :class:`!Random`.

source: Class that uses the :func:`os.urandom` function for generating random numbers from sources provided by the operating system. Not available on all systems. Does not rely on software state, and sequences are not reproducible. Accordingly, the :meth:`seed` method has no effect and is ignored. The :meth:`getstate` and :meth:`setstate` methods raise :exc:`NotImplementedError` if called.
pt_br: Classe que usa a função :func:`os.urandom` para gerar números aleatórios a partir de fontes fornecidas pelo sistema operacional. Não disponível em todos os sistemas. Não depende do estado do software e as sequências não são reproduzíveis. Assim, o método :meth:`seed` não tem efeito e é ignorado. Os métodos :meth:`getstate` e :meth:`setstate` levantam :exc:`NotImplementedError` se chamados.

source: Notes on Reproducibility
pt_br: Notas sobre reprodutibilidade

source: Sometimes it is useful to be able to reproduce the sequences given by a pseudo-random number generator. By reusing a seed value, the same sequence should be reproducible from run to run as long as multiple threads are not running.
pt_br: Às vezes, é útil poder reproduzir as sequências fornecidas por um gerador de números pseudoaleatórios. Reutilizando um valor inicial, a mesma sequência deve ser reproduzível de execução para execução, desde que mais de uma thread não estejam em execução.

source: Most of the random module's algorithms and seeding functions are subject to change across Python versions, but two aspects are guaranteed not to change:
pt_br: A maioria dos algoritmos e funções de propagação do módulo aleatório está sujeita a alterações nas versões de Python, mas dois aspectos são garantidos para não serem alterados:

source: If a new seeding method is added, then a backward compatible seeder will be offered.
pt_br: Se um novo método de semeadura for adicionado, será oferecida um semeador compatível com versões anteriores.

source: The generator's :meth:`~Random.random` method will continue to produce the same sequence when the compatible seeder is given the same seed.
pt_br: O método :meth:`~Random.random` do gerador continuará produzindo a mesma sequência quando o semeador compatível receber a mesma semente.

source: Examples
pt_br: Exemplos

source: Basic examples::
pt_br: Exemplos básicos::

source: >>> random() # Random float: 0.0 <= x < 1.0 0.37444887175646646 >>> uniform(2.5, 10.0) # Random float: 2.5 <= x <= 10.0 3.1800146073117523 >>> expovariate(1 / 5) # Interval between arrivals averaging 5 seconds 5.148957571865031 >>> randrange(10) # Integer from 0 to 9 inclusive 7 >>> randrange(0, 101, 2) # Even integer from 0 to 100 inclusive 26 >>> choice(['win', 'lose', 'draw']) # Single random element from a sequence 'draw' >>> deck = 'ace two three four'.split() >>> shuffle(deck) # Shuffle a list >>> deck ['four', 'two', 'ace', 'three'] >>> sample([10, 20, 30, 40, 50], k=4) # Four samples without replacement [40, 10, 50, 30]
pt_br: >>> random() # Ponto flutuante aleatório: 0.0 <= x < 1.0 0.37444887175646646 >>> uniform(2.5, 10.0) # Ponto flutuante aleatório: 2.5 <= x <= 10.0 3.1800146073117523 >>> expovariate(1 / 5) # Intervalo entre chegadas com médias de 5 segundos 5.148957571865031 >>> randrange(10) # Inteiro de 0 até 9 inclusivo 7 >>> randrange(0, 101, 2) # Inteiro par entre 0 até 100 inclusivo 26 >>> choice(['win', 'lose', 'draw']) # Um único elemento aleatório de uma sequência 'draw' >>> deck = 'ace two three four'.split() >>> shuffle(deck) # Embaralha uma lista >>> deck ['four', 'two', 'ace', 'three'] >>> sample([10, 20, 30, 40, 50], k=4) # Quatro amostras sem substitutos [40, 10, 50, 30]

source: Simulations::
pt_br: Simulações::

source: >>> # Six roulette wheel spins (weighted sampling with replacement) >>> choices(['red', 'black', 'green'], [18, 18, 2], k=6) ['red', 'green', 'black', 'black', 'red', 'black'] >>> # Deal 20 cards without replacement from a deck >>> # of 52 playing cards, and determine the proportion of cards >>> # with a ten-value: ten, jack, queen, or king. >>> deal = sample(['tens', 'low cards'], counts=[16, 36], k=20) >>> deal.count('tens') / 20 0.15 >>> # Estimate the probability of getting 5 or more heads from 7 spins >>> # of a biased coin that settles on heads 60% of the time. >>> sum(binomialvariate(n=7, p=0.6) >= 5 for i in range(10_000)) / 10_000 0.4169 >>> # Probability of the median of 5 samples being in middle two quartiles >>> def trial(): ... return 2_500 <= sorted(choices(range(10_000), k=5))[2] < 7_500 ... >>> sum(trial() for i in range(10_000)) / 10_000 0.7958
pt_br: >>> # Seis giros da roleta (amostragem ponderada com substituição) >>> choices(['red', 'black', 'green'], [18, 18, 2], k=6) ['red', 'green', 'black', 'black', 'red', 'black'] >>> # Distribui 20 cartas sem reposição de um baralho de >>> # 52 cartas e determine a proporção de cartas com >>> # valor dez: dez, valete, rainha ou rei. >>> deal = sample(['tens', 'low cards'], counts=[16, 36], k=20) >>> deal.count('tens') / 20 0.15 >>> # Estima a probabilidade de obter 5 ou mais caras em 7 giros >>> # de uma moeda viciada que cai em cara 60% das vezes. >>> sum(binomialvariate(n=7, p=0.6) >= 5 for i in range(10_000)) / 10_000 0.4169 >>> # Probabilidade da mediana de 5 amostras estar nos dois quartis do meio >>> def trial(): ... return 2_500 <= sorted(choices(range(10_000), k=5))[2] < 7_500 ... >>> sum(trial() for i in range(10_000)) / 10_000 0.7958

source: Example of `statistical bootstrapping <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ using resampling with replacement to estimate a confidence interval for the mean of a sample::
pt_br: Exemplo de `bootstrapping estatístico <https://pt.wikipedia.org/wiki/Bootstrapping_(estatística)>`_ usando reamostragem com substituição para estimar um intervalo de confiança para a média de uma amostra::

source: Example of a `resampling permutation test <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ to determine the statistical significance or `p-value <https://en.wikipedia.org/wiki/P-value>`_ of an observed difference between the effects of a drug versus a placebo::
pt_br: Exemplo de um `teste de permutação de reamostragem <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ para determinar a significância estatística ou `valor-p <https://pt.wikipedia.org/wiki/Valor-p>`_ de uma diferença observada entre os efeitos de uma droga em comparação com um placebo::

source: # Example from "Statistics is Easy" by Dennis Shasha and Manda Wilson from statistics import fmean as mean from random import shuffle drug = [54, 73, 53, 70, 73, 68, 52, 65, 65] placebo = [54, 51, 58, 44, 55, 52, 42, 47, 58, 46] observed_diff = mean(drug) - mean(placebo) n = 10_000 count = 0 combined = drug + placebo for i in range(n): shuffle(combined) new_diff = mean(combined[:len(drug)]) - mean(combined[len(drug):]) count += (new_diff >= observed_diff) print(f'{n} label reshufflings produced only {count} instances with a difference') print(f'at least as extreme as the observed difference of {observed_diff:.1f}.') print(f'The one-sided p-value of {count / n:.4f} leads us to reject the null') print(f'hypothesis that there is no difference between the drug and the placebo.')
pt_br: # Exemplo de "Statistics is Easy" de Dennis Shasha e Manda Wilson from statistics import fmean as mean from random import shuffle drug = [54, 73, 53, 70, 73, 68, 52, 65, 65] placebo = [54, 51, 58, 44, 55, 52, 42, 47, 58, 46] observed_diff = mean(drug) - mean(placebo) n = 10_000 count = 0 combined = drug + placebo for i in range(n): shuffle(combined) new_diff = mean(combined[:len(drug)]) - mean(combined[len(drug):]) count += (new_diff >= observed_diff) print(f'{n} label reshufflings produced only {count} instances with a difference') print(f'at least as extreme as the observed difference of {observed_diff:.1f}.') print(f'The one-sided p-value of {count / n:.4f} leads us to reject the null') print(f'hypothesis that there is no difference between the drug and the placebo.')

source: Simulation of arrival times and service deliveries for a multiserver queue::
pt_br: Simulação de tempos de chegada e entregas de serviços para uma fila multisservidor::

source: from heapq import heapify, heapreplace from random import expovariate, gauss from statistics import mean, quantiles average_arrival_interval = 5.6 average_service_time = 15.0 stdev_service_time = 3.5 num_servers = 3 waits = [] arrival_time = 0.0 servers = [0.0] * num_servers # time when each server becomes available heapify(servers) for i in range(1_000_000): arrival_time += expovariate(1.0 / average_arrival_interval) next_server_available = servers[0] wait = max(0.0, next_server_available - arrival_time) waits.append(wait) service_duration = max(0.0, gauss(average_service_time, stdev_service_time)) service_completed = arrival_time + wait + service_duration heapreplace(servers, service_completed) print(f'Mean wait: {mean(waits):.1f} Max wait: {max(waits):.1f}') print('Quartiles:', [round(q, 1) for q in quantiles(waits)])
pt_br: from heapq import heapify, heapreplace from random import expovariate, gauss from statistics import mean, quantiles average_arrival_interval = 5.6 average_service_time = 15.0 stdev_service_time = 3.5 num_servers = 3 waits = [] arrival_time = 0.0 servers = [0.0] * num_servers # hora em que cada servidor fica disponível heapify(servers) for i in range(1_000_000): arrival_time += expovariate(1.0 / average_arrival_interval) next_server_available = servers[0] wait = max(0.0, next_server_available - arrival_time) waits.append(wait) service_duration = max(0.0, gauss(average_service_time, stdev_service_time)) service_completed = arrival_time + wait + service_duration heapreplace(servers, service_completed) print(f'Mean wait: {mean(waits):.1f} Max wait: {max(waits):.1f}') print('Quartiles:', [round(q, 1) for q in quantiles(waits)])

source: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ a video tutorial by `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ on statistical analysis using just a few fundamental concepts including simulation, sampling, shuffling, and cross-validation.
pt_br: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ um tutorial em vídeo por `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ sobre análise estatística usando apenas alguns conceitos fundamentais, incluindo simulação, amostragem, embaralhamento e validação cruzada.

source: `Economics Simulation <https://nbviewer.org/url/norvig.com/ipython/Economics.ipynb>`_ a simulation of a marketplace by `Peter Norvig <https://norvig.com/bio.html>`_ that shows effective use of many of the tools and distributions provided by this module (gauss, uniform, sample, betavariate, choice, triangular, and randrange).
pt_br: `Economics Simulation <https://nbviewer.org/url/norvig.com/ipython/Economics.ipynb>`_ uma simulação de um mercado por `Peter Norvig <https://norvig.com/bio.html>`_ que mostra o uso eficaz de muitas das ferramentas e distribuições fornecidas por este módulo (gauss, uniform, sample, betavariate, choice, triangular e randrange).

source: `A Concrete Introduction to Probability (using Python) <https://nbviewer.org/url/norvig.com/ipython/Probability.ipynb>`_ a tutorial by `Peter Norvig <https://norvig.com/bio.html>`_ covering the basics of probability theory, how to write simulations, and how to perform data analysis using Python.
pt_br: `A Concrete Introduction to Probability (using Python) <https://nbviewer.org/url/norvig.com/ipython/Probability.ipynb>`_ um tutorial de `Peter Norvig <https://norvig.com/bio.html>`_ cobrindo os fundamentos da teoria das probabilidades, como escrever simulações e como realizar análises de dados usando Python.

source: Recipes
pt_br: Receitas

source: These recipes show how to efficiently make random selections from the combinatoric iterators in the :mod:`itertools` module:
pt_br: Estas receitas mostram como fazer seleções aleatórias de forma eficiente a partir dos iteradores combinatórios no módulo :mod:`itertools`:

source: The default :func:`.random` returns multiples of 2⁻⁵³ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced and are exactly representable as Python floats. However, many other representable floats in that interval are not possible selections. For example, ``0.05954861408025609`` isn't an integer multiple of 2⁻⁵³.
pt_br: O padrão de :func:`.random` é retornar múltiplos de 2⁻⁵³ no intervalo *0.0 ≤ x < 1.0*. Todos esses números são espaçados uniformemente e são representáveis exatamente como pontos flutuantes Python. No entanto, muitos outros pontos flutuantes representados nesse intervalo não são seleções possíveis. Por exemplo, ``0.05954861408025609`` não é um múltiplo inteiro de 2⁻⁵³.

source: The following recipe takes a different approach. All floats in the interval are possible selections. The mantissa comes from a uniform distribution of integers in the range *2⁵² ≤ mantissa < 2⁵³*. The exponent comes from a geometric distribution where exponents smaller than *-53* occur half as often as the next larger exponent.
pt_br: A receita a seguir tem uma abordagem diferente. Todos os pontos flutuantes no intervalo são seleções possíveis. A mantissa vem de uma distribuição uniforme de inteiros no intervalo *2⁵² ≤ mantissa < 2⁵³*. O expoente vem de uma distribuição geométrica onde expoentes menores que *-53* ocorrem com metade da frequência do próximo expoente maior.

source: All :ref:`real valued distributions <real-valued-distributions>` in the class will use the new method::
pt_br: Todas as :ref:`distribuições reais valoradas <real-valued-distributions>` na classe usarão o novo método::

source: The recipe is conceptually equivalent to an algorithm that chooses from all the multiples of 2⁻¹⁰⁷⁴ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced, but most have to be rounded down to the nearest representable Python float. (The value 2⁻¹⁰⁷⁴ is the smallest positive unnormalized float and is equal to ``math.ulp(0.0)``.)
pt_br: A receita é conceitualmente equivalente a um algoritmo que escolhe entre todos os múltiplos de 2⁻¹⁰⁷⁴ no intervalo *0.0 ≤ x < 1.0*. Todos esses números são espaçados uniformemente, mas a maioria deve ser arredondada para o ponto flutuante Python representável mais próximo. (O valor 2⁻¹⁰⁷⁴ é o menor ponto flutuante positivo não normalizado e é igual a ``math.ulp(0.0)``.)

source: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ a paper by Allen B. Downey describing ways to generate more fine-grained floats than normally generated by :func:`.random`.
pt_br: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ um artigo de Allen B. Downey descrevendo formas de gerar pontos flutuantes mais refinados do que normalmente gerados por :func:`.random`.

source: Command-line usage
pt_br: Uso na linha de comando

source: The :mod:`!random` module can be executed from the command line.
pt_br: O módulo :mod:`!random` pode ser invocado como um script na linha de comando:

source: python -m random [-h] [-c CHOICE [CHOICE ...] | -i N | -f N] [input ...]
pt_br: python -m random [-h] [-c ESCOLHA [ESCOLHA ...] | -i N | -f N] [entrada ...]

source: The following options are accepted:
pt_br: As seguintes opções são aceitas:

source: Show the help message and exit.
pt_br: Mostra a mensagem de ajuda e sai.

source: Print a random choice, using :meth:`choice`.
pt_br: Imprime uma escolha aleatória, usando :meth:`choice`.

source: Print a random integer between 1 and N inclusive, using :meth:`randint`.
pt_br: Imprime um inteiro aleatório entre 1 e N inclusive, usando :meth:`randint`.

source: Print a random floating-point number between 0 and N inclusive, using :meth:`uniform`.
pt_br: Imprime um número de ponto flutuante aleatório entre 0 e N inclusive, usando :meth:`uniform`.

source: If no options are given, the output depends on the input:
pt_br: Se nenhuma opção for fornecida, a saída dependerá da entrada:

source: String or multiple: same as :option:`--choice`.
pt_br: String ou vários: mesmo que :option:`--choice`.

source: Integer: same as :option:`--integer`.
pt_br: Inteiro mesmo que :option:`--integer`.

source: Float: same as :option:`--float`.
pt_br: Ponto flutuante: mesmo que :option:`--float`.

source: Command-line example
pt_br: Exemplos na linha de comando

source: Here are some examples of the :mod:`!random` command-line interface:
pt_br: Aqui estão alguns exemplos da interface de linha de comando :mod:`!random`:

source: $ # Choose one at random $ python -m random egg bacon sausage spam "Lobster Thermidor aux crevettes with a Mornay sauce" Lobster Thermidor aux crevettes with a Mornay sauce $ # Random integer $ python -m random 6 6 $ # Random floating-point number $ python -m random 1.8 1.7080016272295635 $ # With explicit arguments $ python -m random --choice egg bacon sausage spam "Lobster Thermidor aux crevettes with a Mornay sauce" egg $ python -m random --integer 6 3 $ python -m random --float 1.8 1.5666339105010318 $ python -m random --integer 6 5 $ python -m random --float 6 3.1942323316565915
pt_br: $ # Escolhe um aleatório $ python -m random egg bacon sausage spam "Lobster Thermidor aux crevettes with a Mornay sauce" Lobster Thermidor aux crevettes with a Mornay sauce $ # Inteiro aleatório $ python -m random 6 6 $ # Número de ponto flutuante aleatório $ python -m random 1.8 1.7080016272295635 $ # Com argumentos explícitos $ python -m random --choice egg bacon sausage spam "Lobster Thermidor aux crevettes with a Mornay sauce" egg $ python -m random --integer 6 3 $ python -m random --float 1.8 1.5666339105010318 $ python -m random --integer 6 5 $ python -m random --float 6 3.1942323316565915
