Repository: python/python-docs-pt-br
Catalog: library/resource.po
Languages: pt_br

source: :mod:`!resource` --- Resource usage information
pt_br: :mod:`!resource` --- Informação de uso de recursos

source: This module provides basic mechanisms for measuring and controlling system resources utilized by a program.
pt_br: Este módulo fornece mecanismos básicos para medir e controlar os recursos do sistema usados por um programa.

source: Availability
pt_br: Disponibilidade

source: Symbolic constants are used to specify particular system resources and to request usage information about either the current process or its children.
pt_br: Constantes simbólicas são usadas para especificar recursos específicos do sistema e para solicitar informações de uso sobre o processo atual ou seus filhos.

source: An :exc:`OSError` is raised on syscall failure.
pt_br: Uma exceção :exc:`OSError` é levantada em caso de falha de chamada de sistema.

source: A deprecated alias of :exc:`OSError`.
pt_br: Um apelido descontinuado de :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
pt_br: Seguindo a :pep:`3151`, esta classe foi transformada em um apelido de :exc:`OSError`.

source: Resource Limits
pt_br: Limites de recursos

source: Resources usage can be limited using the :func:`setrlimit` function described below. Each resource is controlled by a pair of limits: a soft limit and a hard limit. The soft limit is the current limit, and may be lowered or raised by a process over time. The soft limit can never exceed the hard limit. The hard limit can be lowered to any value greater than the soft limit, but not raised. (Only processes with the effective UID of the super-user can raise a hard limit.)
pt_br: O uso de recursos pode ser limitado usando a função :func:`setrlimit` descrita abaixo. Cada recurso é controlado por um par de limites: um limite suave e um limite rígido. O limite suave é o limite atual e pode ser reduzido ou aumentado por um processo ao longo do tempo. O limite suave nunca pode exceder o limite rígido. O limite rígido pode ser reduzido para qualquer valor maior que o limite suave, mas não aumentado. (Somente processos com o UID efetivo do superusuário podem aumentar um limite rígido.)

source: The specific resources that can be limited are system dependent. They are described in the :manpage:`getrlimit(2)` man page. The resources listed below are supported when the underlying operating system supports them; resources which cannot be checked or controlled by the operating system are not defined in this module for those platforms.
pt_br: Os recursos específicos que podem ser limitados dependem do sistema. Eles são descritos na página man :manpage:`getrlimit(2)`. Os recursos listados abaixo são suportados quando o sistema operacional subjacente os suporta; recursos que não podem ser verificados ou controlados pelo sistema operacional não são definidos neste módulo para essas plataformas.

source: Constant used to represent the limit for an unlimited resource.
pt_br: Constante usada para representar o limite de um recurso ilimitado.

source: Returns a tuple ``(soft, hard)`` with the current soft and hard limits of *resource*. Raises :exc:`ValueError` if an invalid resource is specified, or :exc:`error` if the underlying system call fails unexpectedly.
pt_br: Retorna uma tupla ``(suave, rígido)`` com os limites soft e hard atuais de *resource*. Levanta :exc:`ValueError` se um recurso inválido for especificado, ou :exc:`error` se a chamada do sistema subjacente falhar inesperadamente.

source: Sets new limits of consumption of *resource*. The *limits* argument must be a tuple ``(soft, hard)`` of two integers describing the new limits. A value of :const:`~resource.RLIM_INFINITY` can be used to request a limit that is unlimited.
pt_br: Define novos limites de consumo de *resource*. O argumento *limits* deve ser uma tupla ``(suave, rígido)`` de dois inteiros descrevendo os novos limites. Um valor de :const:`~resource.RLIM_INFINITY` pode ser usado para solicitar um limite ilimitado.

source: Raises :exc:`ValueError` if an invalid resource is specified, if the new soft limit exceeds the hard limit, or if a process tries to raise its hard limit. Specifying a limit of :const:`~resource.RLIM_INFINITY` when the hard or system limit for that resource is not unlimited will result in a :exc:`ValueError`. A process with the effective UID of super-user can request any valid limit value, including unlimited, but :exc:`ValueError` will still be raised if the requested limit exceeds the system imposed limit.
pt_br: Levanta :exc:`ValueError` se um recurso inválido for especificado, se o novo limite suave exceder o limite rígido ou se um processo tentar aumentar seu limite rígido. Especificar um limite de :const:`~resource.RLIM_INFINITY` quando o limite rígido ou do sistema para esse recurso não for ilimitado resultará em uma exceção :exc:`ValueError`. Um processo com o UID efetivo de superusuário pode solicitar qualquer valor limite válido, incluindo ilimitado, mas :exc:`ValueError` ainda será levantada se o limite solicitado exceder o limite imposto pelo sistema.

source: ``setrlimit`` may also raise :exc:`error` if the underlying system call fails.
pt_br: ``setrlimit`` também pode levantar :exc:`error` se a chamada do sistema subjacente falhar.

source: VxWorks only supports setting :const:`RLIMIT_NOFILE`.
pt_br: VxWorks só oferece suporte a definir :const:`RLIMIT_NOFILE`.

source: Raises an :ref:`auditing event <auditing>` ``resource.setrlimit`` with arguments ``resource``, ``limits``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``resource.setrlimit`` com os argumentos ``resource``, ``limits``.

source: Combines :func:`setrlimit` and :func:`getrlimit` in one function and supports to get and set the resources limits of an arbitrary process. If *pid* is 0, then the call applies to the current process. *resource* and *limits* have the same meaning as in :func:`setrlimit`, except that *limits* is optional.
pt_br: Combina :func:`setrlimit` e :func:`getrlimit` em uma única função e permite obter e definir os limites de recursos de um processo arbitrário. Se *pid* for 0, a chamada se aplica ao processo atual. *resource* e *limits* têm o mesmo significado que em :func:`setrlimit`, exceto que *limits* é opcional.

source: When *limits* is not given the function returns the *resource* limit of the process *pid*. When *limits* is given the *resource* limit of the process is set and the former resource limit is returned.
pt_br: Quando *limits* não é fornecido, a função retorna o limite de *resource* do processo *pid*. Quando *limits* é fornecido, o limite de *resource* do processo é definido e o limite de recurso anterior é retornado.

source: Raises :exc:`ProcessLookupError` when *pid* can't be found and :exc:`PermissionError` when the user doesn't have ``CAP_SYS_RESOURCE`` for the process.
pt_br: Levanta :exc:`ProcessLookupError` quando *pid* não pode ser encontrado e :exc:`PermissionError` quando o usuário não tem ``CAP_SYS_RESOURCE`` para o processo.

source: Raises an :ref:`auditing event <auditing>` ``resource.prlimit`` with arguments ``pid``, ``resource``, ``limits``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``resource.prlimit`` com os argumentos ``pid``, ``resource``, ``limits``.

source: These symbols define resources whose consumption can be controlled using the :func:`setrlimit` and :func:`getrlimit` functions described below. The values of these symbols are exactly the constants used by C programs.
pt_br: Esses símbolos definem recursos cujo consumo pode ser controlado usando as funções :func:`setrlimit` e :func:`getrlimit` descritas abaixo. Os valores desses símbolos são exatamente as constantes usadas por programas em C.

source: The Unix man page for :manpage:`getrlimit(2)` lists the available resources. Note that not all systems use the same symbol or same value to denote the same resource. This module does not attempt to mask platform differences --- symbols not defined for a platform will not be available from this module on that platform.
pt_br: A página man do Unix para :manpage:`getrlimit(2)` lista os recursos disponíveis. Observe que nem todos os sistemas usam o mesmo símbolo ou o mesmo valor para denotar o mesmo recurso. Este módulo não tenta mascarar diferenças de plataforma --- símbolos não definidos para uma plataforma não estarão disponíveis neste módulo para essa plataforma.

source: The maximum size (in bytes) of a core file that the current process can create. This may result in the creation of a partial core file if a larger core would be required to contain the entire process image.
pt_br: O tamanho máximo (em bytes) de um arquivo de núcleo (core file) que o processo atual pode criar. Isso pode resultar na criação de um arquivo de núcleo parcial se um núcleo maior for necessário para conter a imagem completa do processo.

source: The maximum amount of processor time (in seconds) that a process can use. If this limit is exceeded, a :const:`~signal.SIGXCPU` signal is sent to the process. (See the :mod:`signal` module documentation for information about how to catch this signal and do something useful, e.g. flush open files to disk.)
pt_br: O tempo máximo de processador (em segundos) que um processo pode usar. Se esse limite for excedido, um sinal :const:`~signal.SIGXCPU` é enviado ao processo. (Consulte a documentação do módulo :mod:`signal` para obter informações sobre como capturar esse sinal e fazer algo útil, por exemplo, liberar arquivos abertos no disco.)

source: The maximum size of a file which the process may create.
pt_br: O tamanho máximo de um arquivo que o processo pode criar.

source: The maximum size (in bytes) of the process's heap.
pt_br: O tamanho máximo (em bytes) da heap do processo.

source: The maximum size (in bytes) of the call stack for the current process. This only affects the stack of the main thread in a multi-threaded process.
pt_br: O tamanho máximo (em bytes) da pilha de chamadas para o processo atual. Isso afeta apenas a pilha da thread principal em um processo multithread.

source: The maximum resident set size that should be made available to the process.
pt_br: O tamanho máximo do conjunto de residentes que deve ser disponibilizado para o processo.

source: The maximum number of processes the current process may create.
pt_br: O número máximo de processos que o processo atual pode criar.

source: The maximum number of open file descriptors for the current process.
pt_br: O número máximo de descritores de arquivo abertos para o processo atual.

source: The BSD name for :const:`RLIMIT_NOFILE`.
pt_br: O nome BSD para :const:`RLIMIT_NOFILE`.

source: The maximum address space which may be locked in memory.
pt_br: O espaço máximo de endereço que pode ser travado na memória.

source: The largest area of mapped memory which the process may occupy. Usually an alias of :const:`RLIMIT_AS`.
pt_br: A maior área de memória mapeada que o processo pode ocupar. Geralmente um apelido de :const:`RLIMIT_AS`.

source: The maximum area (in bytes) of address space which may be taken by the process.
pt_br: A área máxima (em bytes) de espaço de endereço que pode ser ocupada pelo processo.

source: The number of bytes that can be allocated for POSIX message queues.
pt_br: O número de bytes que podem ser alocados para filas de mensagens POSIX.

source: The ceiling for the process's nice level (calculated as 20 - rlim_cur).
pt_br: O teto para o nível agradável do processo (calculado como 20 - rlim_cur).

source: The ceiling of the real-time priority.
pt_br: O teto da prioridade em tempo real.

source: The time limit (in microseconds) on CPU time that a process can spend under real-time scheduling without making a blocking syscall.
pt_br: O limite de tempo (em microssegundos) no tempo de CPU que um processo pode gastar sob agendamento em tempo real sem fazer uma chamada de sistema de bloqueio.

source: The number of signals which the process may queue.
pt_br: O número de sinais que o processo pode enfileirar.

source: The maximum size (in bytes) of socket buffer usage for this user. This limits the amount of network memory, and hence the amount of mbufs, that this user may hold at any time.
pt_br: O tamanho máximo (em bytes) de uso do buffer de soquete para este usuário. Isso limita a quantidade de memória de rede e, portanto, a quantidade de mbufs que este usuário pode armazenar a qualquer momento.

source: The maximum size (in bytes) of the swap space that may be reserved or used by all of this user id's processes. This limit is enforced only if bit 1 of the vm.overcommit sysctl is set. Please see `tuning(7) <https://man.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ for a complete description of this sysctl.
pt_br: O tamanho máximo (em bytes) do espaço de swap que pode ser reservado ou utilizado por todos os processos deste ID de usuário. Este limite é aplicado somente se o bit 1 do sysctl vm.overcommit estiver definido. Consulte `tuning(7) <https://man.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ para uma descrição completa deste sysctl.

source: The maximum number of pseudo-terminals created by this user id.
pt_br: O número máximo de pseudoterminais criados por este ID de usuário.

source: The maximum number of kqueues this user id is allowed to create.
pt_br: O número máximo de kqueues que esse ID de usuário tem permissão para criar.

source: Resource Usage
pt_br: Uso de recursos

source: These functions are used to retrieve resource usage information:
pt_br: Essas funções são usadas para recuperar informações de uso de recursos:

source: This function returns an object that describes the resources consumed by either the current process or its children, as specified by the *who* parameter. The *who* parameter should be specified using one of the :const:`!RUSAGE_\*` constants described below.
pt_br: Esta função retorna um objeto que descreve os recursos consumidos pelo processo atual ou seus filhos, conforme especificado pelo parâmetro *who*. O parâmetro *who* deve ser especificado usando uma das constantes :const:`!RUSAGE_\*` descritas abaixo.

source: A simple example::
pt_br: Um exemplo simples::

source: from resource import * import time # a non CPU-bound task time.sleep(3) print(getrusage(RUSAGE_SELF)) # a CPU-bound task for i in range(10 ** 8): _ = 1 + 1 print(getrusage(RUSAGE_SELF))
pt_br: from resource import * import time # uma tarefa não vinculada à CPU time.sleep(3) print(getrusage(RUSAGE_SELF)) # uma tarefa vinculada à CPU for i in range(10 ** 8): _ = 1 + 1 print(getrusage(RUSAGE_SELF))

source: The fields of the return value each describe how a particular system resource has been used, e.g. amount of time spent running is user mode or number of times the process was swapped out of main memory. Some values are dependent on the clock tick internal, e.g. the amount of memory the process is using.
pt_br: Os campos do valor de retorno descrevem como um recurso específico do sistema foi utilizado, por exemplo, a quantidade de tempo gasto em execução no modo de usuário ou o número de vezes que o processo foi trocado da memória principal. Alguns valores dependem do tique do relógio interno, por exemplo, a quantidade de memória que o processo está usando.

source: For backward compatibility, the return value is also accessible as a tuple of 16 elements.
pt_br: Para retrocompatibilidade, o valor de retorno também pode ser acessado como uma tupla de 16 elementos.

source: The fields :attr:`!ru_utime` and :attr:`!ru_stime` of the return value are floating-point values representing the amount of time spent executing in user mode and the amount of time spent executing in system mode, respectively. The remaining values are integers. Consult the :manpage:`getrusage(2)` man page for detailed information about these values. A brief summary is presented here:
pt_br: Os campos :attr:`!ru_utime` e :attr:`!ru_stime` do valor de retorno são valores de ponto flutuante que representam o tempo gasto na execução no modo usuário e o tempo gasto na execução no modo sistema, respectivamente. Os valores restantes são inteiros. Consulte a página man :manpage:`getrusage(2)` para obter informações detalhadas sobre esses valores. Um breve resumo é apresentado aqui:

source: Index
pt_br: Índice

source: Field
pt_br: Campo

source: Resource
pt_br: Recurso

source: time in user mode (float seconds)
pt_br: tempo no modo de usuário (segundos em pontos flutuantes)

source: time in system mode (float seconds)
pt_br: tempo no modo de sistema (segundos em pontos flutuantes)

source: maximum resident set size
pt_br: tamanho máximo do conjunto residente

source: shared memory size
pt_br: tamanho da memória compartilhada

source: unshared memory size
pt_br: tamanho da memória não compartilhada

source: unshared stack size
pt_br: tamanho da pilha não compartilhada

source: page faults not requiring I/O
pt_br: falhas de página que não requerem E/S

source: page faults requiring I/O
pt_br: falhas de página que requerem E/S

source: number of swap outs
pt_br: número de trocas para a memórias de swap

source: block input operations
pt_br: operações de entrada de bloco

source: block output operations
pt_br: operações de saída de bloco

source: messages sent
pt_br: mensagens enviadas

source: messages received
pt_br: mensagens recebidas

source: signals received
pt_br: sinais recebidos

source: voluntary context switches
pt_br: trocas voluntárias de contexto

source: involuntary context switches
pt_br: trocas involuntárias de contexto

source: This function will raise a :exc:`ValueError` if an invalid *who* parameter is specified. It may also raise :exc:`error` exception in unusual circumstances.
pt_br: Esta função levantará uma :exc:`ValueError` se um parâmetro *who* inválido for especificado. Também pode levantar uma exceção :exc:`error` em circunstâncias incomuns.

source: Returns the number of bytes in a system page. (This need not be the same as the hardware page size.)
pt_br: Retorna o número de bytes em uma página do sistema. (Não precisa ser o mesmo que o tamanho da página de hardware.)

source: The following :const:`!RUSAGE_\*` symbols are passed to the :func:`getrusage` function to specify which processes information should be provided for.
pt_br: Os seguintes símbolos :const:`!RUSAGE_\*` são passados para a função :func:`getrusage` para especificar quais informações de processos devem ser fornecidas.

source: Pass to :func:`getrusage` to request resources consumed by the calling process, which is the sum of resources used by all threads in the process.
pt_br: Passeapara :func:`getrusage` para solicitar recursos consumidos pelo processo de chamada, que é a soma dos recursos usados por todas as threads no processo.

source: Pass to :func:`getrusage` to request resources consumed by child processes of the calling process which have been terminated and waited for.
pt_br: Passa para :func:`getrusage` para solicitar recursos consumidos por processos filhos do processo de chamada que foram encerrados e aguardados.

source: Pass to :func:`getrusage` to request resources consumed by both the current process and child processes. May not be available on all systems.
pt_br: Passa para :func:`getrusage` para solicitar recursos consumidos pelo processo atual e pelos processos filhos. Pode não estar disponível em todos os sistemas.

source: Pass to :func:`getrusage` to request resources consumed by the current thread. May not be available on all systems.
pt_br: Passa para :func:`getrusage` para solicitar recursos consumidos pela thread atual. Pode não estar disponível em todos os sistemas.
