Repository: python/python-docs-pt-br
Catalog: library/rlcompleter.po
Languages: pt_br

source: :mod:`!rlcompleter` --- Completion function for GNU readline
pt_br: :mod:`!rlcompleter` --- Função de autocomplemento para GNU readline

source: **Source code:** :source:`Lib/rlcompleter.py`
pt_br: **Código-fonte:** :source:`Lib/rlcompleter.py`

source: The :mod:`!rlcompleter` module defines a completion function suitable to be passed to :func:`~readline.set_completer` in the :mod:`readline` module.
pt_br: O módulo :mod:`!rlcompleter` define uma função de autocompletamento adequada para ser passada para :func:`~readline.set_completer` no módulo :mod:`readline`.

source: When this module is imported on a Unix platform with the :mod:`readline` module available, an instance of the :class:`Completer` class is automatically created and its :meth:`~Completer.complete` method is set as the :ref:`readline completer <readline-completion>`. The method provides completion of valid Python :ref:`identifiers and keywords <identifiers>`.
pt_br: Quando este módulo é importado em uma plataforma Unix com o módulo :mod:`readline` disponível, uma instância da classe :class:`Completer` é criada automaticamente e seu método :meth:`~Completer.complete` é definido como o :ref:`autocompletamento do readline <readline-completion>`. O método fornece o autocompletamento de :ref:`identificadores e palavras-chaves <identifiers>` válidas do Python.

source: Example::
pt_br: Exemplo::

source: The :mod:`!rlcompleter` module is designed for use with Python's :ref:`interactive mode <tut-interactive>`. Unless Python is run with the :option:`-S` option, the module is automatically imported and configured (see :ref:`rlcompleter-config`).
pt_br: O módulo :mod:`!rlcompleter` é projetado para uso com o :ref:`modo interativo <tut-interactive>` do Python. A menos que Python seja executado com a opção :option:`-S`, o módulo é automaticamente importado e configurado (veja :ref:`rlcompleter-config`).

source: On platforms without :mod:`readline`, the :class:`Completer` class defined by this module can still be used for custom purposes.
pt_br: Em plataformas sem :mod:`readline`, a classe :class:`Completer` definida por este módulo ainda pode ser usada para propósitos personalizados.

source: Completer objects have the following method:
pt_br: Os objetos Completer têm o seguinte método:

source: Return the next possible completion for *text*.
pt_br: Retorna o próximo completamento possível para *text*.

source: When called by the :mod:`readline` module, this method is called successively with ``state == 0, 1, 2, ...`` until the method returns ``None``.
pt_br: Quando chamado pelo módulo :mod:`readline`, este método é chamado sucessivamente com ``state == 0, 1, 2, ...`` até que o método retorne ``None``.

source: If called for *text* that doesn't include a period character (``'.'``), it will complete from names currently defined in :mod:`__main__`, :mod:`builtins` and keywords (as defined by the :mod:`keyword` module).
pt_br: Se chamado para *text* que não inclui um caractere de ponto (``'.'``), ele será completado a partir dos nomes atualmente definidos em :mod:`__main__`, :mod:`builtins` e palavras reservadas (conforme definido pelo módulo :mod:`keyword`).

source: If called for a dotted name, it will try to evaluate anything without obvious side-effects (functions will not be evaluated, but it can generate calls to :meth:`~object.__getattr__`) up to the last part, and find matches for the rest via the :func:`dir` function. Any exception raised during the evaluation of the expression is caught, silenced and :const:`None` is returned.
pt_br: Se chamado por um nome pontilhado, vai tentar avaliar qualquer coisa sem efeitos colaterais óbvios (as funções não serão avaliadas, mas pode levantar chamadas para :meth:`~object.__getattr__`) até a última parte e encontrar correspondências para o resto por meio da função :func:`dir`. Qualquer exceção levantada durante a avaliação da expressão é capturada, silenciada e :const:`None` é retornado.
