Repository: python/python-docs-pt-br
Catalog: library/runpy.po
Languages: pt_br

source: :mod:`!runpy` --- Locating and executing Python modules
pt_br: :mod:`!runpy` --- Localizando e executando módulos Python

source: **Source code:** :source:`Lib/runpy.py`
pt_br: **Código-fonte:** :source:`Lib/runpy.py`

source: The :mod:`runpy` module is used to locate and run Python modules without importing them first. Its main use is to implement the :option:`-m` command line switch that allows scripts to be located using the Python module namespace rather than the filesystem.
pt_br: O módulo :mod:`runpy` é usado para localizar e executar módulos Python sem importá-los primeiro. Seu principal uso é implementar a opção de linha de comando :option:`-m` que permite que os scripts sejam localizados usando o espaço de nomes do módulo Python em vez do sistema de arquivos.

source: Note that this is *not* a sandbox module - all code is executed in the current process, and any side effects (such as cached imports of other modules) will remain in place after the functions have returned.
pt_br: Observe que este *não* é um módulo isolado - todo o código é executado no processo atual, e quaisquer efeitos colaterais (como importações em cache de outros módulos) irão permanecer em vigor após o retorno da função.

source: Furthermore, any functions and classes defined by the executed code are not guaranteed to work correctly after a :mod:`runpy` function has returned. If that limitation is not acceptable for a given use case, :mod:`importlib` is likely to be a more suitable choice than this module.
pt_br: Além disso, quaisquer funções e classes definidas pelo código executado não têm garantia de funcionar corretamente após o retorno de uma função :mod:`runpy`. Se essa limitação não for aceitável para um determinado caso de uso, :mod:`importlib` provavelmente será uma escolha mais adequada do que este módulo.

source: The :mod:`runpy` module provides two functions:
pt_br: O módulo :mod:`runpy` fornece duas funções:

source: Execute the code of the specified module and return the resulting module's globals dictionary. The module's code is first located using the standard import mechanism (refer to :pep:`302` for details) and then executed in a fresh module namespace.
pt_br: Executa o código do módulo especificado e retorna o dicionário de globals do módulo resultante. O código do módulo é localizado primeiro usando o mecanismo de importação padrão (consulte :pep:`302` para detalhes) e então executado em um novo espaço de nomes de módulo.

source: The *mod_name* argument should be an absolute module name. If the module name refers to a package rather than a normal module, then that package is imported and the :mod:`__main__` submodule within that package is then executed and the resulting module globals dictionary returned.
pt_br: O argumento *mod_name* deve ser um nome de módulo absoluto. Se o nome do módulo se referir a um pacote ao invés de um módulo normal, então esse pacote é importado e o submódulo :mod:`__main__` dentro desse pacote é então executado e o dicionário global do módulo resultante retornado.

source: The optional dictionary argument *init_globals* may be used to pre-populate the module's globals dictionary before the code is executed. *init_globals* will not be modified. If any of the special global variables below are defined in *init_globals*, those definitions are overridden by :func:`run_module`.
pt_br: O argumento opcional de dicionário *init_globals* pode ser usado para preencher previamente o dicionário global do módulo antes do código ser executado. *init_globals* não será modificado. Se qualquer uma das variáveis globais especiais abaixo for definida em *init_globals*, estas definições serão substituídas por :func:`run_module`.

source: The special global variables ``__name__``, ``__spec__``, ``__file__``, ``__cached__``, ``__loader__`` and ``__package__`` are set in the globals dictionary before the module code is executed. (Note that this is a minimal set of variables - other variables may be set implicitly as an interpreter implementation detail.)
pt_br: As variáveis globais especiais ``__name__``, ``__spec__``, ``__file__``, ``__cached__``, ``__loader__`` e ``__package__`` são definidas no dicionário global antes que o código do módulo seja executado (Observe que este é um conjunto mínimo de variáveis - outras variáveis podem ser definidas implicitamente como um detalhe de implementação do interpretador).

source: ``__name__`` is set to *run_name* if this optional argument is not :const:`None`, to ``mod_name + '.__main__'`` if the named module is a package and to the *mod_name* argument otherwise.
pt_br: ``__name__`` é definido como *run_name* se este argumento opcional não for :const:`None`, para ``mod_name + '.__main__'`` se o módulo nomeado for um pacote e para o argumento *mod_name* caso contrário .

source: ``__spec__`` will be set appropriately for the *actually* imported module (that is, ``__spec__.name`` will always be *mod_name* or ``mod_name + '.__main__'``, never *run_name*).
pt_br: ``__spec__`` será definido adequadamente para o módulo *efetivamente* importado (isto é, ``__spec__.name`` vai sempre ser *mod_name* ou ``mod_name + '.__main__'``, nunca *run_name*).

source: ``__file__``, ``__cached__``, ``__loader__`` and ``__package__`` are :ref:`set as normal <import-mod-attrs>` based on the module spec.
pt_br: ``__file__``, ``__cached__``, ``__loader__`` e ``__package__`` são :ref:`definidos como normal <import-mod-attrs>` com base no spec de módulo.

source: If the argument *alter_sys* is supplied and evaluates to :const:`True`, then ``sys.argv[0]`` is updated with the value of ``__file__`` and ``sys.modules[__name__]`` is updated with a temporary module object for the module being executed. Both ``sys.argv[0]`` and ``sys.modules[__name__]`` are restored to their original values before the function returns.
pt_br: Se o argumento *alter_sys* for fornecido e for avaliado como :const:`True`, então ``sys.argv[0]`` será atualizado com o valor de ``__file__`` e ``sys.modules[__name__]`` é atualizado com um objeto de módulo temporário para o módulo que está sendo executado. Ambos ``sys.argv[0]`` e ``sys.modules[__name__]`` são restaurados para seus valores originais antes que a função retorne.

source: Note that this manipulation of :mod:`sys` is not thread-safe. Other threads may see the partially initialised module, as well as the altered list of arguments. It is recommended that the ``sys`` module be left alone when invoking this function from threaded code.
pt_br: Note que esta manipulação de :mod:`sys` não é segura para thread. Outras threads podem ver o módulo parcialmente inicializado, bem como a lista alterada de argumentos. É recomendado que o módulo ``sys`` seja deixado sozinho ao invocar esta função a partir do código encadeado.

source: The :option:`-m` option offering equivalent functionality from the command line.
pt_br: A opção :option:`-m` oferece funcionalidade equivalente na linha de comando.

source: Added ability to execute packages by looking for a :mod:`__main__` submodule.
pt_br: Adicionada capacidade de executar pacotes procurando por um submódulo :mod:`__main__`.

source: Added ``__cached__`` global variable (see :pep:`3147`).
pt_br: Adicionada a variável global ``__cached__`` (veja :pep:`3147`).

source: Updated to take advantage of the module spec feature added by :pep:`451`. This allows ``__cached__`` to be set correctly for modules run this way, as well as ensuring the real module name is always accessible as ``__spec__.name``.
pt_br: Atualizado para aproveitar o recurso de spec de módulo adicionado por :pep:`451`. Isso permite que ``__cached__`` seja configurado corretamente para módulos executados desta forma, assim como garante que o nome real do módulo esteja sempre acessível como ``__spec__.name``.

source: The setting of ``__cached__``, ``__loader__``, and ``__package__`` are deprecated. See :class:`~importlib.machinery.ModuleSpec` for alternatives.
pt_br: A definição de ``__cached__``, ``__loader__`` e ``__package__`` foi descontinuada. Veja :class:`~importlib.machinery.ModuleSpec` para alternativas.

source: Execute the code at the named filesystem location and return the resulting module's globals dictionary. As with a script name supplied to the CPython command line, *file_path* may refer to a Python source file, a compiled bytecode file or a valid :data:`sys.path` entry containing a :mod:`__main__` module (e.g. a zipfile containing a top-level :file:`__main__.py` file).
pt_br: Executa o código no local do sistema de arquivos nomeado e retorna o dicionário de globals do módulo resultante. Assim como um nome de script fornecido à linha de comando CPython, *file_path* pode se referir a um arquivo fonte Python, um arquivo compilado em bytecode ou uma entrada válida de :data:`sys.path` contendo um módulo :mod:`__main__` (por exemplo, um arquivo zip contendo um arquivo de nível superior :file:`__main__.py`).

source: For a simple script, the specified code is simply executed in a fresh module namespace. For a valid :data:`sys.path` entry (typically a zipfile or directory), the entry is first added to the beginning of ``sys.path``. The function then looks for and executes a :mod:`__main__` module using the updated path. Note that there is no special protection against invoking an existing ``__main__`` entry located elsewhere on ``sys.path`` if there is no such module at the specified location.
pt_br: Para um script simples, o código especificado é simplesmente executado em um novo espaço de nomes de módulo. Para uma entrada válida :data:`sys.path` (normalmente um arquivo zip ou diretório), a entrada é primeiro adicionada ao início de ``sys.path``. A função então procura e executa um módulo :mod:`__main__` usando o caminho atualizado. Observe que não há proteção especial contra invocar uma entrada ``__main__`` existente localizada em outro lugar em ``sys.path`` se não houver tal módulo no local especificado.

source: The optional dictionary argument *init_globals* may be used to pre-populate the module's globals dictionary before the code is executed. *init_globals* will not be modified. If any of the special global variables below are defined in *init_globals*, those definitions are overridden by :func:`run_path`.
pt_br: O argumento opcional de dicionário *init_globals* pode ser usado para preencher previamente o dicionário de globals do módulo antes do código ser executado. *init_globals* não será modificado. Se qualquer uma das variáveis globais especiais abaixo for definida em *init_globals*, estas definições serão substituídas por :func:`run_path`.

source: ``__name__`` is set to *run_name* if this optional argument is not :const:`None` and to ``'<run_path>'`` otherwise.
pt_br: ``__name__`` é definido como *run_name* se este argumento opcional não for :const:`None` e como ``'<run_path>'`` caso contrário.

source: If *file_path* directly references a script file (whether as source or as precompiled byte code), then ``__file__`` will be set to *file_path*, and ``__spec__``, ``__cached__``, ``__loader__`` and ``__package__`` will all be set to :const:`None`.
pt_br: Se *file_path* fizer referência diretamente a um arquivo de script (seja como fonte ou como bytecode pré-compilado), então ``__file__`` será definido para *file_path* e ``__spec__``, ``__cached__``, ``__loader__`` e ``__package__`` serão todos definidos como :const:`None`.

source: If *file_path* is a reference to a valid :data:`sys.path` entry, then ``__spec__`` will be set appropriately for the imported :mod:`__main__` module (that is, ``__spec__.name`` will always be ``__main__``). ``__file__``, ``__cached__``, ``__loader__`` and ``__package__`` will be :ref:`set as normal <import-mod-attrs>` based on the module spec.
pt_br: Se *file_path* for uma referência a uma entrada válida de :data:`sys.path`, então ``__spec__`` será definido apropriadamente para o módulo :mod:`__main__` importado (ou seja, ``__spec__.name`` sempre será ``__main__``). ``__file__``, ``__cached__``, ``__loader__`` e ``__package__`` serão :ref:`definidos como normal <import-mod-attrs>` com base no spec de módulo.

source: A number of alterations are also made to the :mod:`sys` module. Firstly, :data:`sys.path` may be altered as described above. ``sys.argv[0]`` is updated with the value of *file_path* and ``sys.modules[__name__]`` is updated with a temporary module object for the module being executed. All modifications to items in :mod:`sys` are reverted before the function returns.
pt_br: Várias alterações também são feitas no módulo :mod:`sys`. Primeiramente, :data:`sys.path` pode ser alterado conforme descrito acima. ``sys.argv[0]`` é atualizado com o valor de *file_path* e ``sys.modules[__name__]`` é atualizado com um objeto de módulo temporário para o módulo que está sendo executado. Todas as modificações em itens em :mod:`sys` são revertidas antes que a função retorne.

source: Note that, unlike :func:`run_module`, the alterations made to :mod:`sys` are not optional in this function as these adjustments are essential to allowing the execution of :data:`sys.path` entries. As the thread-safety limitations still apply, use of this function in threaded code should be either serialised with the import lock or delegated to a separate process.
pt_br: Note que, diferentemente de :func:`run_module`, as alterações feitas em :mod:`sys` não são opcionais nesta função, pois esses ajustes são essenciais para permitir a execução das entradas do :data:`sys.path`. Como as limitações de segurança de threads ainda se aplicam, o uso dessa função no código encadeado deve ser serializado com a trava de importação ou delegado a um processo separado.

source: :ref:`using-on-interface-options` for equivalent functionality on the command line (``python path/to/script``).
pt_br: :ref:`using-on-interface-options` para funcionalidade equivalente na linha de comando (``python path/to/script``).

source: Updated to take advantage of the module spec feature added by :pep:`451`. This allows ``__cached__`` to be set correctly in the case where ``__main__`` is imported from a valid :data:`sys.path` entry rather than being executed directly.
pt_br: Atualizado para aproveitar o recurso de spec de módulo adicionado por :pep:`451`. Isso permite que ``__cached__`` seja definido corretamente no caso em que ``__main__`` é importado de uma entrada :data:`sys.path` válida em vez de ser executado diretamente.

source: The setting of ``__cached__``, ``__loader__``, and ``__package__`` are deprecated.
pt_br: A definição de ``__cached__``, ``__loader__`` e ``__package__`` foi descontinuada.

source: :pep:`338` -- Executing modules as scripts
pt_br: :pep:`338` -- Executando módulos como scripts

source: PEP written and implemented by Nick Coghlan.
pt_br: PEP escrita e implementada por Nick Coghlan.

source: :pep:`366` -- Main module explicit relative imports
pt_br: :pep:`366` -- Importações relativas explícitas do módulo principal

source: :pep:`451` -- A ModuleSpec Type for the Import System
pt_br: :pep:`451` -- Um tipo ModuleSpec para o sistema de importação

source: PEP written and implemented by Eric Snow
pt_br: PEP escrita e implementada por Eric Snow

source: :ref:`using-on-general` - CPython command line details
pt_br: :ref:`using-on-general` - Detalhes da linha de comando do CPython

source: The :func:`importlib.import_module` function
pt_br: A função :func:`importlib.import_module`

source: module
pt_br: módulo
