Repository: python/python-docs-pt-br
Catalog: library/secrets.po
Languages: pt_br

source: :mod:`!secrets` --- Generate secure random numbers for managing secrets
pt_br: :mod:`!secrets` --- Gera números aleatórios seguros para gerenciar segredos

source: **Source code:** :source:`Lib/secrets.py`
pt_br: **Código-fonte:** :source:`Lib/secrets.py`

source: The :mod:`secrets` module is used for generating cryptographically strong random numbers suitable for managing data such as passwords, account authentication, security tokens, and related secrets.
pt_br: O módulo :mod:`secrets` é usado para gerar números aleatórios criptograficamente fortes, adequados para o gerenciamento de dados, como senhas, autenticação de conta, tokens de segurança e segredos relacionados.

source: In particular, :mod:`secrets` should be used in preference to the default pseudo-random number generator in the :mod:`random` module, which is designed for modelling and simulation, not security or cryptography.
pt_br: Em particular, :mod:`secrets` deve ser usado em preferência ao gerador de números pseudoaleatórios padrão no módulo :mod:`random`, que é projetado para modelagem e simulação, não segurança ou criptografia.

source: Random numbers
pt_br: Números aleatórios

source: The :mod:`secrets` module provides access to the most secure source of randomness that your operating system provides.
pt_br: O módulo :mod:`secrets` fornece acesso à fonte mais segura de aleatoriedade que seu sistema operacional fornece.

source: A class for generating random numbers using the highest-quality sources provided by the operating system. See :class:`random.SystemRandom` for additional details.
pt_br: Uma classe para gerar números aleatórios usando as fontes da mais alta qualidade fornecidas pelo sistema operacional. Veja :class:`random.SystemRandom` para detalhes adicionais.

source: Return a randomly chosen element from a non-empty sequence.
pt_br: Retorna um elemento escolhido aleatoriamente de uma sequência não vazia.

source: Return a random int in the range [0, *exclusive_upper_bound*).
pt_br: Retorna um int aleatório no intervalo [0, *exclusive_upper_bound*).

source: Return a non-negative int with *k* random bits.
pt_br: Retorna um int não negativo com *k* bits aleatórios.

source: Generating tokens
pt_br: Gerando tokens

source: The :mod:`secrets` module provides functions for generating secure tokens, suitable for applications such as password resets, hard-to-guess URLs, and similar.
pt_br: O módulo :mod:`secrets` fornece funções para gerar tokens seguros, adequados para aplicativos como redefinições de senha, URLs difíceis de adivinhar e semelhantes.

source: Return a random byte string containing *nbytes* number of bytes. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
pt_br: Retorna uma string de byte aleatória contendo *nbytes* número de bytes. Se *nbytes* for ``None`` ou não fornecido, um padrão razoável é usado.

source: Return a random text string, in hexadecimal. The string has *nbytes* random bytes, each byte converted to two hex digits. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
pt_br: Retorna uma string de texto aleatória, em hexadecimal. A string tem *nbytes* bytes aleatórios, cada byte convertido em dois dígitos hexadecimais. Se *nbytes* for ``None`` ou não fornecido, um padrão razoável é usado.

source: Return a random URL-safe text string, containing *nbytes* random bytes. The text is Base64 encoded, so on average each byte results in approximately 1.3 characters. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
pt_br: Retorna uma string de texto segura para URL aleatória, contendo *nbytes* bytes aleatórios. O texto é codificado em Base64, portanto, em média, cada byte resulta em aproximadamente 1,3 caracteres. Se *nbytes* for ``None`` ou não fornecido, um padrão razoável é usado.

source: How many bytes should tokens use?
pt_br: Quantos bytes os tokens devem usar?

source: To be secure against `brute-force attacks <https://en.wikipedia.org/wiki/Brute-force_attack>`_, tokens need to have sufficient randomness. Unfortunately, what is considered sufficient will necessarily increase as computers get more powerful and able to make more guesses in a shorter period. As of 2015, it is believed that 32 bytes (256 bits) of randomness is sufficient for the typical use-case expected for the :mod:`secrets` module.
pt_br: Para estar seguro contra `ataques de força bruta <https://pt.wikipedia.org/wiki/Ataque_de_força_bruta>`_, os tokens precisam ter aleatoriedade suficiente. Infelizmente, o que é considerado suficiente necessariamente aumentará à medida que os computadores ficarem mais poderosos e capazes de fazer mais suposições em um período mais curto. A partir de 2015, acredita-se que 32 bytes (256 bits) de aleatoriedade são suficientes para o caso de uso típico esperado para o módulo :mod:`secrets`.

source: For those who want to manage their own token length, you can explicitly specify how much randomness is used for tokens by giving an :class:`int` argument to the various ``token_*`` functions. That argument is taken as the number of bytes of randomness to use.
pt_br: Para aqueles que desejam gerenciar seu próprio comprimento de token, você pode especificar explicitamente quanta aleatoriedade é usada para tokens, fornecendo um argumento :class:`int` para as várias funções ``token_*``. Esse argumento é considerado o número de bytes de aleatoriedade a serem usados.

source: Otherwise, if no argument is provided, or if the argument is ``None``, the ``token_*`` functions will use a reasonable default instead.
pt_br: Caso contrário, se nenhum argumento for fornecido, ou se o argumento for ``None``, as funções ``token_*`` usarão um padrão razoável.

source: That default is subject to change at any time, including during maintenance releases.
pt_br: Esse padrão está sujeito a alterações a qualquer momento, inclusive durante as versões de manutenção.

source: Other functions
pt_br: Outras funções

source: Return ``True`` if strings or :term:`bytes-like objects <bytes-like object>` *a* and *b* are equal, otherwise ``False``, using a "constant-time compare" to reduce the risk of `timing attacks <https://codahale.com/a-lesson-in-timing-attacks/>`_. See :func:`hmac.compare_digest` for additional details.
pt_br: Retorna ``True`` se as strings ou :term:`objetos tipo arquivo <bytes-like object>` *a* e *b* forem iguais, caso contrário, ``False``, usando uma "comparação de tempo constante" para reduzir o risco de `ataques de temporização <https://codahale.com/a-lesson-in-timing-attacks/>`_. Veja :func:`hmac.compare_digest` para detalhes adicionais.

source: Recipes and best practices
pt_br: Receitas e melhores práticas

source: This section shows recipes and best practices for using :mod:`secrets` to manage a basic level of security.
pt_br: Esta seção mostra as receitas e melhores práticas para usar :mod:`secrets` para gerenciar um nível básico de segurança.

source: Generate an eight-character alphanumeric password:
pt_br: Gerar uma senha alfanumérica de oito caracteres:

source: Applications should not :cwe:`store passwords in a recoverable format <257>`, whether plain text or encrypted. They should be salted and hashed using a cryptographically strong one-way (irreversible) hash function.
pt_br: As aplicações não devem :cwe:`armazenar senhas em um formato recuperável <257>`, seja em texto simples ou criptografado. Elas devem ser salgadas e transformadas em hash usando uma função hash de sentido único criptograficamente forte (irreversível).

source: Generate a ten-character alphanumeric password with at least one lowercase character, at least one uppercase character, and at least three digits:
pt_br: Gerar uma senha alfanumérica de dez caracteres com pelo menos um caractere minúsculo, pelo menos um caractere maiúsculo e pelo menos três dígitos:

source: Generate an `XKCD-style passphrase <https://xkcd.com/936/>`_:
pt_br: Gerar uma senha longa do estilo `XKCD <https://xkcd.com/936/>`_:

source: import secrets # On standard Linux systems, use a convenient dictionary file. # Other platforms may need to provide their own word-list. with open('/usr/share/dict/words') as f: words = [word.strip() for word in f] password = ' '.join(secrets.choice(words) for i in range(4))
pt_br: import secrets # Em sistemas Linux padrão, use um arquivo de dicionário conveniente. # Outras plataformas podem precisar fornecer sua própria lista de palavras. with open('/usr/share/dict/words') as f: words = [word.strip() for word in f] password = ' '.join(secrets.choice(words) for i in range(4))

source: Generate a hard-to-guess temporary URL containing a security token suitable for password recovery applications:
pt_br: Gerar uma URL temporária difícil de adivinhação contendo um token de segurança adequado para aplicativos de recuperação de senha:
