Repository: python/python-docs-pt-br
Catalog: library/security_warnings.po
Languages: pt_br

source: Security Considerations
pt_br: Considerações de segurança

source: The following modules have specific security considerations:
pt_br: Os módulos a seguir têm considerações de segurança específicas:

source: :mod:`base64`: :ref:`base64 security considerations <base64-security>` in :rfc:`4648`
pt_br: :mod:`base64`: :ref:`considerações de segurança do base64 <base64-security>` na :rfc:`4648`

source: :mod:`hashlib`: :ref:`all constructors take a "usedforsecurity" keyword-only argument disabling known insecure and blocked algorithms <hashlib-usedforsecurity>`
pt_br: :mod:`hashlib`: :ref:`todos os construtores usam um argumento somente-nomeado "usedforsecurity", desativando algoritmos conhecidos não seguros e bloqueados <hashlib-usedforsecurity>`

source: :mod:`http.server` is not suitable for production use, only implementing basic security checks. See the :ref:`security considerations <http.server-security>`.
pt_br: :mod:`http.server` não é adequado para uso em produção, implementando apenas verificações básicas de segurança. Veja as :ref:`considerações de segurança <http.server-security>`.

source: :mod:`logging`: :ref:`Logging configuration uses eval() <logging-eval-security>`
pt_br: :mod:`logging`: :ref:`configuração do Logging usa eval() <logging-eval-security>`

source: :mod:`multiprocessing`: :ref:`Connection.recv() uses pickle <multiprocessing-recv-pickle-security>`
pt_br: :mod:`multiprocessing`: :ref:`Connection.recv() usa pickle <multiprocessing-recv-pickle-security>`

source: :mod:`pickle`: :ref:`Restricting globals in pickle <pickle-restrict>`
pt_br: :mod:`pickle`: :ref:`Restringindo globais no pickle <pickle-restrict>`

source: :mod:`random` shouldn't be used for security purposes, use :mod:`secrets` instead
pt_br: :mod:`random` não deve ser usado para o propósito de segurança. Em vez disso, use :mod:`secrets`

source: :mod:`shelve`: :ref:`shelve is based on pickle and thus unsuitable for dealing with untrusted sources <shelve-security>`
pt_br: :mod:`shelve`: :ref:`shelve é baseado no pickle e, portanto, inadequado para lidar com fontes não confiáveis <shelve-security>`

source: :mod:`ssl`: :ref:`SSL/TLS security considerations <ssl-security>`
pt_br: :mod:`ssl`: :ref:`Considerações de segurança de SSL/TLS <ssl-security>`

source: :mod:`subprocess`: :ref:`Subprocess security considerations <subprocess-security>`
pt_br: :mod:`subprocess`: :ref:`Considerações de segurança de Subprocess <subprocess-security>`

source: :mod:`tempfile`: :ref:`mktemp is deprecated due to vulnerability to race conditions <tempfile-mktemp-deprecated>`
pt_br: :mod:`tempfile`: :ref:`mktemp foi descontinuado em razão de vulnerabilidade de condições de corrida <tempfile-mktemp-deprecated>`

source: :mod:`xml`: :ref:`XML vulnerabilities <xml-vulnerabilities>`
pt_br: :mod:`xml`: :ref:`Vulnerabilidades no XML <xml-vulnerabilities>`

source: :mod:`zipfile`: :ref:`maliciously prepared .zip files can cause disk volume exhaustion <zipfile-resources-limitations>`
pt_br: :mod:`zipfile`: :ref:`Arquivos .zip preparados de forma maliciosa podem causar esgotamento do volume do disco <zipfile-resources-limitations>`

source: The :option:`-I` command line option can be used to run Python in isolated mode. When it cannot be used, the :option:`-P` option or the :envvar:`PYTHONSAFEPATH` environment variable can be used to not prepend a potentially unsafe path to :data:`sys.path` such as the current directory, the script's directory or an empty string.
pt_br: A opção de linha de comando :option:`-I` pode ser usada para executar o Python no modo isolado. Quando não pode ser usado, a opção :option:`-P` ou a variável de ambiente :envvar:`PYTHONSAFEPATH` pode ser usada para não preceder um caminho potencialmente inseguro para :data:`sys.path` como o diretório atual, o diretório do script ou uma string vazia.

source: security considerations
pt_br: considerações de segurança
