Repository: python/python-docs-pt-br
Catalog: library/selectors.po
Languages: pt_br

source: :mod:`!selectors` --- High-level I/O multiplexing
pt_br: :mod:`!selectors` --- Мультиплексирование ввода-вывода высокого уровня

source: **Source code:** :source:`Lib/selectors.py`
pt_br: **Código-fonte:** :source:`Lib/selectors.py`

source: Introduction
pt_br: Introdução

source: This module allows high-level and efficient I/O multiplexing, built upon the :mod:`select` module primitives. Users are encouraged to use this module instead, unless they want precise control over the OS-level primitives used.
pt_br: Цей модуль забезпечує високорівневе й ефективне мультиплексування введення/виведення, побудоване на примітивах модуля :mod:`select`. Користувачам рекомендується використовувати замість цього модуль, якщо вони не бажають точного контролю над використовуваними примітивами рівня ОС.

source: It defines a :class:`BaseSelector` abstract base class, along with several concrete implementations (:class:`KqueueSelector`, :class:`EpollSelector`...), that can be used to wait for I/O readiness notification on multiple file objects. In the following, "file object" refers to any object with a :meth:`~io.IOBase.fileno` method, or a raw file descriptor. See :term:`file object`.
pt_br: Он определяет абстрактный базовый класс :class:`BaseSelector`, а также несколько конкретных реализаций (:class:`KqueueSelector`, :class:`EpollSelector`...), которые можно использовать для ожидания уведомления о готовности ввода-вывода. несколько файловых объектов. Далее «файловый объект» относится к любому объекту с методом :meth:`~io.IOBase.fileno` или к необработанному файловому дескриптору. См. :term:`файловый объект`.

source: :class:`DefaultSelector` is an alias to the most efficient implementation available on the current platform: this should be the default choice for most users.
pt_br: :class:`DefaultSelector` — це псевдонім найефективнішої реалізації, доступної на поточній платформі: це має бути вибір за умовчанням для більшості користувачів.

source: The type of file objects supported depends on the platform: on Windows, sockets are supported, but not pipes, whereas on Unix, both are supported (some other types may be supported as well, such as fifos or special file devices).
pt_br: Тип підтримуваних файлових об’єктів залежить від платформи: у Windows підтримуються сокети, але не канали, тоді як в Unix підтримуються обидва (можуть підтримуватися й деякі інші типи, наприклад fifos або спеціальні файлові пристрої).

source: Low-level I/O multiplexing module.
pt_br: Модуль мультиплексування вводу/виводу низького рівня.

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: Classes hierarchy::
pt_br: Ієрархія класів::

source: In the following, *events* is a bitwise mask indicating which I/O events should be waited for on a given file object. It can be a combination of the modules constants below:
pt_br: Нижче *події* — це порозрядна маска, що вказує, на які події вводу/виводу слід чекати для певного файлового об’єкта. Це може бути комбінація наведених нижче констант модулів:

source: Constant
pt_br: Constante

source: Meaning
pt_br: Significado

source: Available for read
pt_br: Disponível para leitura

source: Available for write
pt_br: Disponível para escrita

source: A :class:`SelectorKey` is a :class:`~collections.namedtuple` used to associate a file object to its underlying file descriptor, selected event mask and attached data. It is returned by several :class:`BaseSelector` methods.
pt_br: :class:`SelectorKey` — це :class:`~collections.namedtuple`, який використовується для зв’язування об’єкта файлу з його основним дескриптором файлу, вибраною маскою події та вкладеними даними. Його повертають кілька методів :class:`BaseSelector`.

source: File object registered.
pt_br: Файловий об'єкт зареєстровано.

source: Underlying file descriptor.
pt_br: O descritor de arquivo subjacente.

source: Events that must be waited for on this file object.
pt_br: Події, які потрібно очікувати для цього файлового об’єкта.

source: Optional opaque data associated to this file object: for example, this could be used to store a per-client session ID.
pt_br: Додаткові непрозорі дані, пов’язані з цим файловим об’єктом: наприклад, це можна використовувати для зберігання ідентифікатора сеансу кожного клієнта.

source: A :class:`BaseSelector` is used to wait for I/O event readiness on multiple file objects. It supports file stream registration, unregistration, and a method to wait for I/O events on those streams, with an optional timeout. It's an abstract base class, so cannot be instantiated. Use :class:`DefaultSelector` instead, or one of :class:`SelectSelector`, :class:`KqueueSelector` etc. if you want to specifically use an implementation, and your platform supports it. :class:`BaseSelector` and its concrete implementations support the :term:`context manager` protocol.
pt_br: :class:`BaseSelector` використовується для очікування готовності події вводу/виводу для кількох файлових об’єктів. Він підтримує реєстрацію потоку файлів, скасування реєстрації та метод очікування подій введення/виведення в цих потоках із додатковим тайм-аутом. Це абстрактний базовий клас, тому його не можна створити. Замість цього використовуйте :class:`DefaultSelector` або один із :class:`SelectSelector`, :class:`KqueueSelector` тощо, якщо ви хочете використовувати певну реалізацію, і ваша платформа це підтримує. :class:`BaseSelector` і його конкретні реалізації підтримують протокол :term:`context manager`.

source: Register a file object for selection, monitoring it for I/O events.
pt_br: Registra um objeto arquivo para seleção, monitorando-o para eventos de I/O

source: *fileobj* is the file object to monitor. It may either be an integer file descriptor or an object with a ``fileno()`` method. *events* is a bitwise mask of events to monitor. *data* is an opaque object.
pt_br: *fileobj* — файловий об’єкт для моніторингу. Це може бути цілочисельний файловий дескриптор або об’єкт із методом fileno(). *події* — це побітова маска подій для моніторингу. *data* є непрозорим об’єктом.

source: This returns a new :class:`SelectorKey` instance, or raises a :exc:`ValueError` in case of invalid event mask or file descriptor, or :exc:`KeyError` if the file object is already registered.
pt_br: Це повертає новий екземпляр :class:`SelectorKey` або викликає :exc:`ValueError` у разі недійсної маски події чи дескриптора файлу, або :exc:`KeyError`, якщо об’єкт файлу вже зареєстровано.

source: Unregister a file object from selection, removing it from monitoring. A file object shall be unregistered prior to being closed.
pt_br: Скасувати реєстрацію файлового об’єкта з вибору, видаливши його з моніторингу. Перед закриттям файлового об’єкта необхідно скасувати реєстрацію.

source: *fileobj* must be a file object previously registered.
pt_br: *fileobj* має бути попередньо зареєстрованим файловим об’єктом.

source: This returns the associated :class:`SelectorKey` instance, or raises a :exc:`KeyError` if *fileobj* is not registered. It will raise :exc:`ValueError` if *fileobj* is invalid (e.g. it has no ``fileno()`` method or its ``fileno()`` method has an invalid return value).
pt_br: Це повертає пов’язаний екземпляр :class:`SelectorKey` або викликає :exc:`KeyError`, якщо *fileobj* не зареєстровано. Він викличе :exc:`ValueError`, якщо *fileobj* недійсний (наприклад, він не має методу ``fileno()`` або його ``fileno()`` метод має недійсне повернуте значення).

source: Change a registered file object's monitored events or attached data.
pt_br: Змінити події або вкладені дані зареєстрованого файлового об’єкта.

source: This is equivalent to ``BaseSelector.unregister(fileobj)`` followed by ``BaseSelector.register(fileobj, events, data)``, except that it can be implemented more efficiently.
pt_br: Это эквивалентно ``BaseSelector.unregister(fileobj)``, за которым следует ``BaseSelector.register(fileobj, event, data)``, за исключением того, что его можно реализовать более эффективно.

source: This returns a new :class:`SelectorKey` instance, or raises a :exc:`ValueError` in case of invalid event mask or file descriptor, or :exc:`KeyError` if the file object is not registered.
pt_br: Це повертає новий екземпляр :class:`SelectorKey` або викликає :exc:`ValueError` у разі недійсної маски події чи дескриптора файлу, або :exc:`KeyError`, якщо об’єкт файлу не зареєстровано.

source: Wait until some registered file objects become ready, or the timeout expires.
pt_br: Зачекайте, поки деякі зареєстровані файлові об’єкти стануть готовими, або закінчиться час очікування.

source: If ``timeout > 0``, this specifies the maximum wait time, in seconds. If ``timeout <= 0``, the call won't block, and will report the currently ready file objects. If *timeout* is ``None``, the call will block until a monitored file object becomes ready.
pt_br: Якщо ``timeout > 0``, це визначає максимальний час очікування в секундах. Якщо ``timeout <= 0``, виклик не блокуватиметься, а повідомлятиметься про наразі готові файлові об’єкти. Якщо *timeout* має значення ``None``, виклик блокуватиметься, доки контрольований файловий об’єкт не стане готовим.

source: This returns a list of ``(key, events)`` tuples, one for each ready file object.
pt_br: Це повертає список кортежів ``(ключ, події)``, по одному для кожного готового файлового об’єкта.

source: *key* is the :class:`SelectorKey` instance corresponding to a ready file object. *events* is a bitmask of events ready on this file object.
pt_br: *key* — це екземпляр :class:`SelectorKey`, що відповідає готовому файловому об’єкту. *events* — це бітова маска подій, готових для цього файлового об’єкта.

source: This method can return before any file object becomes ready or the timeout has elapsed if the current process receives a signal: in this case, an empty list will be returned.
pt_br: Цей метод може повернутися до того, як будь-який файловий об’єкт стане готовим або мине час очікування, якщо поточний процес отримає сигнал: у цьому випадку буде повернено порожній список.

source: The selector is now retried with a recomputed timeout when interrupted by a signal if the signal handler did not raise an exception (see :pep:`475` for the rationale), instead of returning an empty list of events before the timeout.
pt_br: Тепер селектор виконується повторно з переобчисленим тайм-аутом, коли його перериває сигнал, якщо обробник сигналу не викликав виняткову ситуацію (див. :pep:`475` для обґрунтування), замість повернення порожнього списку подій до тайм-ауту.

source: Close the selector.
pt_br: Закрийте селектор.

source: This must be called to make sure that any underlying resource is freed. The selector shall not be used once it has been closed.
pt_br: Це потрібно викликати, щоб переконатися, що будь-який основний ресурс звільнено. Перемикач не можна використовувати після того, як він закритий.

source: Return the key associated with a registered file object.
pt_br: Повертає ключ, пов’язаний із зареєстрованим файловим об’єктом.

source: This returns the :class:`SelectorKey` instance associated to this file object, or raises :exc:`KeyError` if the file object is not registered.
pt_br: Це повертає екземпляр :class:`SelectorKey`, пов’язаний із цим об’єктом файлу, або викликає :exc:`KeyError`, якщо об’єкт файлу не зареєстровано.

source: Return a mapping of file objects to selector keys.
pt_br: Повернути відображення файлових об’єктів на клавіші вибору.

source: This returns a :class:`~collections.abc.Mapping` instance mapping registered file objects to their associated :class:`SelectorKey` instance.
pt_br: Це повертає екземпляр :class:`~collections.abc.Mapping`, який зіставляє зареєстровані файлові об’єкти з їхнім пов’язаним екземпляром :class:`SelectorKey`.

source: The default selector class, using the most efficient implementation available on the current platform. This should be the default choice for most users.
pt_br: Клас селектора за замовчуванням із використанням найефективнішої реалізації, доступної на поточній платформі. Це має бути вибір за умовчанням для більшості користувачів.

source: :func:`select.select`-based selector.
pt_br: Селектор на основі :func:`select.select`.

source: :func:`select.poll`-based selector.
pt_br: Селектор на основі :func:`select.poll`.

source: :func:`select.epoll`-based selector.
pt_br: Селектор на основі :func:`select.epoll`.

source: This returns the file descriptor used by the underlying :func:`select.epoll` object.
pt_br: Це повертає дескриптор файлу, який використовується базовим об’єктом :func:`select.epoll`.

source: :func:`select.devpoll`-based selector.
pt_br: Селектор на основі :func:`select.devpoll`.

source: This returns the file descriptor used by the underlying :func:`select.devpoll` object.
pt_br: Це повертає дескриптор файлу, який використовується базовим об’єктом :func:`select.devpoll`.

source: :func:`select.kqueue`-based selector.
pt_br: :func:`select.kqueue` селектор.

source: This returns the file descriptor used by the underlying :func:`select.kqueue` object.
pt_br: Це повертає дескриптор файлу, який використовується базовим об’єктом :func:`select.kqueue`.

source: Examples
pt_br: Exemplos

source: Here is a simple echo server implementation::
pt_br: Ось проста реалізація ехо-сервера:
