Repository: python/python-docs-pt-br
Catalog: library/shlex.po
Languages: pt_br

source: Enclosing characters in quotes which are not part of :attr:`~shlex.escapedquotes` (e.g. ``"'"``) preserve the literal value of all characters within the quotes;
pt_br: Взяття символів у лапки, які не є частиною :attr:`~shlex.escapedquotes` (наприклад, ``"'"``), зберігає буквальне значення всіх символів у лапках;

source: Enclosing characters in quotes which are part of :attr:`~shlex.escapedquotes` (e.g. ``'"'``) preserves the literal value of all characters within the quotes, with the exception of the characters mentioned in :attr:`~shlex.escape`. The escape characters retain its special meaning only when followed by the quote in use, or the escape character itself. Otherwise the escape character will be considered a normal character.
pt_br: Взяття в лапки символів, які є частиною :attr:`~shlex.escapedquotes` (наприклад, ``'"'``), зберігає буквальне значення всіх символів у лапках, за винятком символів, згаданих у :attr:`~shlex.escape`. Екран-символи зберігають своє особливе значення лише тоді, коли за ними йде використовувана лапка або сам керуючий символ. Інакше керуючий символ вважатиметься звичайним символом.

source: EOF is signaled with a :const:`None` value;
pt_br: EOF сигналізується значенням :const:`None`;

source: Quoted empty strings (``''``) are allowed.
pt_br: Допускаються порожні рядки в лапках (``''``).

source: Improved Compatibility with Shells
pt_br: Покращена сумісність із оболонками

source: The :class:`shlex` class provides compatibility with the parsing performed by common Unix shells like ``bash``, ``dash``, and ``sh``. To take advantage of this compatibility, specify the ``punctuation_chars`` argument in the constructor. This defaults to ``False``, which preserves pre-3.6 behaviour. However, if it is set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters is returned as a single token. While this is short of a full parser for shells (which would be out of scope for the standard library, given the multiplicity of shells out there), it does allow you to perform processing of command lines more easily than you could otherwise. To illustrate, you can see the difference in the following snippet:
pt_br: Клас :class:`shlex` забезпечує сумісність із синтаксичним аналізом, який виконується звичайними оболонками Unix, такими як ``bash``, ``dash`` і ``sh``. Щоб скористатися перевагами цієї сумісності, вкажіть аргумент ``punctuation_chars`` у конструкторі. За замовчуванням встановлено ``False``, що зберігає поведінку до 3.6. Однак, якщо встановлено значення ``True``, тоді розбір символів ``(); <> |&`` змінено: будь-яке виконання цих символів повертається як один маркер. Хоча це недостатньо повноцінного синтаксичного аналізатора для оболонок (який був би поза межами стандартної бібліотеки, враховуючи безліч оболонок), він дозволяє вам виконувати обробку командних рядків легше, ніж ви могли б інакше. Для ілюстрації ви можете побачити різницю в наступному фрагменті:

source: Of course, tokens will be returned which are not valid for shells, and you'll need to implement your own error checks on the returned tokens.
pt_br: Звичайно, буде повернуто маркери, які не є дійсними для оболонок, і вам потрібно буде реалізувати власні перевірки помилок на повернутих маркерах.

source: Instead of passing ``True`` as the value for the punctuation_chars parameter, you can pass a string with specific characters, which will be used to determine which characters constitute punctuation. For example::
pt_br: Замість передачі ``True`` як значення для параметра punctuation_chars, ви можете передати рядок із певними символами, які використовуватимуться для визначення того, які символи становлять пунктуацію. Наприклад::

source: When ``punctuation_chars`` is specified, the :attr:`~shlex.wordchars` attribute is augmented with the characters ``~-./*?=``. That is because these characters can appear in file names (including wildcards) and command-line arguments (e.g. ``--color=auto``). Hence::
pt_br: Якщо вказано ``punctuation_chars``, атрибут :attr:`~shlex.wordchars` доповнюється символами ``~-./*?=``. Це пов’язано з тим, що ці символи можуть з’являтися в назвах файлів (включаючи символи підстановки) та аргументах командного рядка (наприклад, ``--color=auto``). Отже::

source: However, to match the shell as closely as possible, it is recommended to always use ``posix`` and :attr:`~shlex.whitespace_split` when using :attr:`~shlex.punctuation_chars`, which will negate :attr:`~shlex.wordchars` entirely.
pt_br: Однак, щоб якомога точніше відповідати оболонці, рекомендується завжди використовувати ``posix`` і :attr:`~shlex.whitespace_split` під час використання :attr:`~shlex.punctuation_chars`, що скасовує :attr:`~shlex.wordchars` повністю.

source: For best effect, ``punctuation_chars`` should be set in conjunction with ``posix=True``. (Note that ``posix=False`` is the default for :class:`~shlex.shlex`.)
pt_br: Для найкращого ефекту ``punctuation_chars`` має бути встановлено в поєднанні з ``posix=True``. (Зверніть увагу, що ``posix=False`` є типовим для :class:`~shlex.shlex`.)
