Repository: python/python-docs-pt-br
Catalog: library/shlex.po
Languages: pt_br

source: :mod:`shlex` --- Simple lexical analysis
pt_br: :mod:`shlex` --- Análise léxica simples

source: **Source code:** :source:`Lib/shlex.py`
pt_br: **Código-fonte:** :source:`Lib/shlex.py`

source: The :class:`~shlex.shlex` class makes it easy to write lexical analyzers for simple syntaxes resembling that of the Unix shell. This will often be useful for writing minilanguages, (for example, in run control files for Python applications) or for parsing quoted strings.
pt_br: Клас :class:`~shlex.shlex` дозволяє легко писати лексичні аналізатори для простого синтаксису, схожого на синтаксис оболонки Unix. Це часто буде корисно для написання міні-мов (наприклад, у файлах керування виконанням програм Python) або для аналізу рядків у лапках.

source: The :mod:`shlex` module defines the following functions:
pt_br: Модуль :mod:`shlex` визначає такі функції:

source: Split the string *s* using shell-like syntax. If *comments* is :const:`False` (the default), the parsing of comments in the given string will be disabled (setting the :attr:`~shlex.commenters` attribute of the :class:`~shlex.shlex` instance to the empty string). This function operates in POSIX mode by default, but uses non-POSIX mode if the *posix* argument is false.
pt_br: Розділіть рядок *s* за допомогою синтаксису, подібного до оболонки. Якщо *comments* має значення :const:`False` (за замовчуванням), розбір коментарів у вказаному рядку буде вимкнено (встановлюється атрибут :attr:`~shlex.commenters` :class:`~shlex.shlex` до порожнього рядка). Ця функція за замовчуванням працює в режимі POSIX, але використовує режим, відмінний від POSIX, якщо аргумент *posix* має значення false.

source: Since the :func:`split` function instantiates a :class:`~shlex.shlex` instance, passing ``None`` for *s* will read the string to split from standard input.
pt_br: Оскільки функція :func:`split` створює екземпляр :class:`~shlex.shlex`, передаючи ``None`` для *s*, буде прочитано рядок для розділення зі стандартного введення.

source: Concatenate the tokens of the list *split_command* and return a string. This function is the inverse of :func:`split`.
pt_br: Об’єднайте маркери списку *split_command* і поверніть рядок. Ця функція є зворотною до :func:`split`.

source: The returned value is shell-escaped to protect against injection vulnerabilities (see :func:`quote`).
pt_br: Повернене значення екранується оболонкою, щоб захистити від уразливості ін’єкції (див. :func:`quote`).

source: Return a shell-escaped version of the string *s*. The returned value is a string that can safely be used as one token in a shell command line, for cases where you cannot use a list.
pt_br: Повертає екрановану версію рядка *s*. Повернене значення — це рядок, який можна безпечно використовувати як один маркер у командному рядку оболонки у випадках, коли ви не можете використовувати список.

source: The ``shlex`` module is **only designed for Unix shells**.
pt_br: Модуль ``shlex`` призначений **лише для оболонок Unix**.

source: The :func:`quote` function is not guaranteed to be correct on non-POSIX compliant shells or shells from other operating systems such as Windows. Executing commands quoted by this module on such shells can open up the possibility of a command injection vulnerability.
pt_br: Не гарантується, що функція :func:`quote` буде коректною для несумісних з POSIX оболонок або оболонок інших операційних систем, таких як Windows. Виконання команд, цитованих цим модулем, у таких оболонках може відкрити ймовірність уразливості впровадження команд.

source: Consider using functions that pass command arguments with lists such as :func:`subprocess.run` with ``shell=False``.
pt_br: Розгляньте можливість використання функцій, які передають аргументи команд зі списками, наприклад :func:`subprocess.run` з ``shell=False``.

source: This idiom would be unsafe:
pt_br: Este idioma seria inseguro:

source: :func:`quote` lets you plug the security hole:
pt_br: :func:`quote` дозволяє закрити дірку в безпеці:

source: The quoting is compatible with UNIX shells and with :func:`split`:
pt_br: Цитування сумісно з оболонками UNIX і з :func:`split`:

source: The :mod:`shlex` module defines the following class:
pt_br: Модуль :mod:`shlex` визначає такий клас:

source: A :class:`~shlex.shlex` instance or subclass instance is a lexical analyzer object. The initialization argument, if present, specifies where to read characters from. It must be a file-/stream-like object with :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` methods, or a string. If no argument is given, input will be taken from ``sys.stdin``. The second optional argument is a filename string, which sets the initial value of the :attr:`~shlex.infile` attribute. If the *instream* argument is omitted or equal to ``sys.stdin``, this second argument defaults to "stdin". The *posix* argument defines the operational mode: when *posix* is not true (default), the :class:`~shlex.shlex` instance will operate in compatibility mode. When operating in POSIX mode, :class:`~shlex.shlex` will try to be as close as possible to the POSIX shell parsing rules. The *punctuation_chars* argument provides a way to make the behaviour even closer to how real shells parse. This can take a number of values: the default value, ``False``, preserves the behaviour seen under Python 3.5 and earlier. If set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters (considered punctuation characters) is returned as a single token. If set to a non-empty string of characters, those characters will be used as the punctuation characters. Any characters in the :attr:`wordchars` attribute that appear in *punctuation_chars* will be removed from :attr:`wordchars`. See :ref:`improved-shell-compatibility` for more information. *punctuation_chars* can be set only upon :class:`~shlex.shlex` instance creation and can't be modified later.
pt_br: Екземпляр :class:`~shlex.shlex` або екземпляр підкласу є об’єктом лексичного аналізатора. Аргумент ініціалізації, якщо він присутній, визначає, звідки читати символи. Це має бути файлоподібний/потоковий об’єкт із методами :meth:`~io.TextIOBase.read` і :meth:`~io.TextIOBase.readline` або рядок. Якщо аргумент не вказано, вхідні дані братимуться з ``sys.stdin``. Другим необов’язковим аргументом є рядок імені файлу, який встановлює початкове значення атрибута :attr:`~shlex.infile`. Якщо аргумент *instream* опущено або дорівнює ``sys.stdin``, цей другий аргумент за умовчанням має значення stdin. Аргумент *posix* визначає робочий режим: якщо *posix* не є істинним (за замовчуванням), примірник :class:`~shlex.shlex` працюватиме в режимі сумісності. Під час роботи в режимі POSIX :class:`~shlex.shlex` намагатиметься бути якомога ближчим до правил розбору оболонки POSIX. Аргумент *punctuation_chars* забезпечує спосіб зробити поведінку ще ближчою до того, як розбирають справжні оболонки. Це може приймати кілька значень: значення за замовчуванням, ``False``, зберігає поведінку, яку можна побачити в Python 3.5 і раніше. Якщо встановлено значення ``True``, то розбір символів ``(); <> |&`` змінено: будь-яке виконання цих символів (вважаються знаками пунктуації) повертається як один маркер. Якщо встановлено непорожній рядок символів, ці символи використовуватимуться як знаки пунктуації. Будь-які символи в атрибуті :attr:`wordchars`, які з’являються в *punctuation_chars*, будуть видалені з :attr:`wordchars`. Перегляньте :ref:`improved-shell-compatibility` для отримання додаткової інформації. *punctuation_chars* можна встановити лише під час створення екземпляра :class:`~shlex.shlex` і не можна змінити пізніше.

source: The *punctuation_chars* parameter was added.
pt_br: Додано параметр *punctuation_chars*.

source: Module :mod:`configparser`
pt_br: Модуль :mod:`configparser`

source: Parser for configuration files similar to the Windows :file:`.ini` files.
pt_br: Синтаксичний аналізатор файлів конфігурації, подібних до файлів Windows :file:`.ini`.

source: shlex Objects
pt_br: Об'єкти shlex

source: A :class:`~shlex.shlex` instance has the following methods:
pt_br: Екземпляр :class:`~shlex.shlex` має такі методи:

source: Return a token. If tokens have been stacked using :meth:`push_token`, pop a token off the stack. Otherwise, read one from the input stream. If reading encounters an immediate end-of-file, :attr:`eof` is returned (the empty string (``''``) in non-POSIX mode, and ``None`` in POSIX mode).
pt_br: Повернути жетон. Якщо маркери були складені за допомогою :meth:`push_token`, витягніть маркер зі стеку. В іншому випадку прочитайте один із вхідного потоку. Якщо під час читання виникає негайний кінець файлу, повертається :attr:`eof` (порожній рядок (``''``) у режимі, відмінному від POSIX, і ``None`` у режимі POSIX).

source: Push the argument onto the token stack.
pt_br: Помістіть аргумент у стек маркерів.

source: Read a raw token. Ignore the pushback stack, and do not interpret source requests. (This is not ordinarily a useful entry point, and is documented here only for the sake of completeness.)
pt_br: Прочитайте необроблений токен. Ігноруйте зворотний стек і не інтерпретуйте запити джерела. (Це зазвичай не є корисною точкою входу, і задокументовано тут лише для повноти.)

source: When :class:`~shlex.shlex` detects a source request (see :attr:`source` below) this method is given the following token as argument, and expected to return a tuple consisting of a filename and an open file-like object.
pt_br: Коли :class:`~shlex.shlex` виявляє вихідний запит (див. :attr:`source` нижче), цьому методу надається наступний маркер як аргумент і очікується, що він поверне кортеж, що складається з імені файлу та відкритого файлу, подібного об'єкт.

source: Normally, this method first strips any quotes off the argument. If the result is an absolute pathname, or there was no previous source request in effect, or the previous source was a stream (such as ``sys.stdin``), the result is left alone. Otherwise, if the result is a relative pathname, the directory part of the name of the file immediately before it on the source inclusion stack is prepended (this behavior is like the way the C preprocessor handles ``#include "file.h"``).
pt_br: Зазвичай цей метод спочатку видаляє будь-які лапки з аргументу. Якщо результатом є абсолютний шлях, або не було попереднього запиту джерела, або попереднім джерелом був потік (наприклад, ``sys.stdin``), результат залишається одним. В іншому випадку, якщо результатом є відносний шлях, частина каталогу імені файлу безпосередньо перед ним у вихідному стеку включення додається (така поведінка подібна до того, як препроцесор C обробляє ``#include "file.h"``).

source: The result of the manipulations is treated as a filename, and returned as the first component of the tuple, with :func:`open` called on it to yield the second component. (Note: this is the reverse of the order of arguments in instance initialization!)
pt_br: Результат маніпуляцій розглядається як ім’я файлу та повертається як перший компонент кортежу з викликом :func:`open`, щоб отримати другий компонент. (Примітка: це зворотний порядок аргументів під час ініціалізації екземпляра!)

source: This hook is exposed so that you can use it to implement directory search paths, addition of file extensions, and other namespace hacks. There is no corresponding 'close' hook, but a shlex instance will call the :meth:`~io.IOBase.close` method of the sourced input stream when it returns EOF.
pt_br: Цей хук відкритий, щоб ви могли використовувати його для реалізації шляхів пошуку в каталогах, додавання розширень файлів та інших хаків простору імен. Немає відповідного хука 'close', але екземпляр shlex викличе метод :meth:`~io.IOBase.close` вихідного вхідного потоку, коли він повертає EOF.

source: For more explicit control of source stacking, use the :meth:`push_source` and :meth:`pop_source` methods.
pt_br: Для більш чіткого керування стеком джерела використовуйте методи :meth:`push_source` і :meth:`pop_source`.

source: Push an input source stream onto the input stack. If the filename argument is specified it will later be available for use in error messages. This is the same method used internally by the :meth:`sourcehook` method.
pt_br: Надішліть потік джерела вхідних даних у стек вхідних даних. Якщо вказати аргумент імені файлу, він пізніше буде доступний для використання в повідомленнях про помилки. Це той самий метод, який внутрішньо використовується методом :meth:`sourcehook`.

source: Pop the last-pushed input source from the input stack. This is the same method used internally when the lexer reaches EOF on a stacked input stream.
pt_br: Витягніть джерело вхідного сигналу, надіслане востаннє, зі стеку вхідних даних. Це той самий метод, який використовується внутрішньо, коли лексер досягає EOF у складеному вхідному потоці.

source: This method generates an error message leader in the format of a Unix C compiler error label; the format is ``'"%s", line %d: '``, where the ``%s`` is replaced with the name of the current source file and the ``%d`` with the current input line number (the optional arguments can be used to override these).
pt_br: Цей метод генерує лідер повідомлення про помилку у форматі мітки помилки компілятора Unix C; формат ``'"%s", line %d: '``, де ``%s`` замінюється назвою поточного вихідного файлу, а ``%d`` поточним номером рядка введення (додатковий аргументи можуть бути використані для перевизначення цих).

source: This convenience is provided to encourage :mod:`shlex` users to generate error messages in the standard, parseable format understood by Emacs and other Unix tools.
pt_br: Ця зручність створена для заохочення користувачів :mod:`shlex` генерувати повідомлення про помилки у стандартному форматі, який можна аналізувати, зрозумілому Emacs та іншим інструментам Unix.

source: Instances of :class:`~shlex.shlex` subclasses have some public instance variables which either control lexical analysis or can be used for debugging:
pt_br: Екземпляри підкласів :class:`~shlex.shlex` мають деякі загальнодоступні змінні екземпляра, які або контролюють лексичний аналіз, або можуть бути використані для налагодження:

source: The string of characters that are recognized as comment beginners. All characters from the comment beginner to end of line are ignored. Includes just ``'#'`` by default.
pt_br: Рядок символів, які розпізнаються як початкові коментарі. Усі символи від початку коментаря до кінця рядка ігноруються. За замовчуванням містить лише ``''#'``.

source: The string of characters that will accumulate into multi-character tokens. By default, includes all ASCII alphanumerics and underscore. In POSIX mode, the accented characters in the Latin-1 set are also included. If :attr:`punctuation_chars` is not empty, the characters ``~-./*?=``, which can appear in filename specifications and command line parameters, will also be included in this attribute, and any characters which appear in ``punctuation_chars`` will be removed from ``wordchars`` if they are present there. If :attr:`whitespace_split` is set to ``True``, this will have no effect.
pt_br: Рядок символів, який накопичуватиметься в багатосимвольні маркери. За замовчуванням включає всі буквено-цифрові символи ASCII і підкреслення. У режимі POSIX також включені символи з наголосами в наборі Latin-1. Якщо :attr:`punctuation_chars` не порожній, символи ``~-./*?=``, які можуть з’являтися в специфікаціях імен файлів і параметрах командного рядка, також будуть включені в цей атрибут, а також будь-які символи, які з’являються в ``punctuation_chars`` буде видалено з ``wordchars``, якщо вони там присутні. Якщо :attr:`whitespace_split` має значення ``True``, це не матиме ефекту.

source: Characters that will be considered whitespace and skipped. Whitespace bounds tokens. By default, includes space, tab, linefeed and carriage-return.
pt_br: Символи, які вважатимуться пробілами та пропускатимуться. Пробіли обмежують маркери. За замовчуванням включає пробіл, табуляцію, переведення рядка та повернення каретки.

source: Characters that will be considered as escape. This will be only used in POSIX mode, and includes just ``'\'`` by default.
pt_br: Символи, які будуть вважатися втечею. Він використовуватиметься лише в режимі POSIX і за замовчуванням включає лише ``'\'``.

source: Characters that will be considered string quotes. The token accumulates until the same quote is encountered again (thus, different quote types protect each other as in the shell.) By default, includes ASCII single and double quotes.
pt_br: Символи, які будуть вважатися лапками. Маркер накопичується, доки ті самі лапки не зустрічаються знову (таким чином, різні типи лапок захищають один одного, як і в оболонці). За замовчуванням включає одинарні та подвійні лапки ASCII.

source: Characters in :attr:`quotes` that will interpret escape characters defined in :attr:`escape`. This is only used in POSIX mode, and includes just ``'"'`` by default.
pt_br: Символи в :attr:`quotes`, які інтерпретуватимуть escape-символи, визначені в :attr:`escape`. Це використовується лише в режимі POSIX і включає лише ``'"'`` за замовчуванням.

source: If ``True``, tokens will only be split in whitespaces. This is useful, for example, for parsing command lines with :class:`~shlex.shlex`, getting tokens in a similar way to shell arguments. When used in combination with :attr:`punctuation_chars`, tokens will be split on whitespace in addition to those characters.
pt_br: Якщо ``True``, маркери будуть розділені лише пробілами. Це корисно, наприклад, для аналізу командних рядків за допомогою :class:`~shlex.shlex`, отримання токенів подібним чином до аргументів оболонки. При використанні в поєднанні з :attr:`punctuation_chars`, маркери будуть розділені на пробіли на додаток до цих символів.

source: The :attr:`punctuation_chars` attribute was made compatible with the :attr:`whitespace_split` attribute.
pt_br: Атрибут :attr:`punctuation_chars` було зроблено сумісним з атрибутом :attr:`whitespace_split`.

source: The name of the current input file, as initially set at class instantiation time or stacked by later source requests. It may be useful to examine this when constructing error messages.
pt_br: Ім’я поточного вхідного файлу, початково встановлене під час створення екземпляра класу або складене пізнішими запитами джерела. Це може бути корисно вивчити під час створення повідомлень про помилки.

source: The input stream from which this :class:`~shlex.shlex` instance is reading characters.
pt_br: Вхідний потік, з якого цей екземпляр :class:`~shlex.shlex` читає символи.

source: This attribute is ``None`` by default. If you assign a string to it, that string will be recognized as a lexical-level inclusion request similar to the ``source`` keyword in various shells. That is, the immediately following token will be opened as a filename and input will be taken from that stream until EOF, at which point the :meth:`~io.IOBase.close` method of that stream will be called and the input source will again become the original input stream. Source requests may be stacked any number of levels deep.
pt_br: Цей атрибут за замовчуванням має значення ``None``. Якщо ви призначите йому рядок, цей рядок буде розпізнано як запит на включення на лексичному рівні, подібний до ключового слова ``source`` у різних оболонках. Тобто наступний токен відкриватиметься як ім’я файлу, а вхідні дані братимуться з цього потоку до закінчення EOF, після чого буде викликано метод :meth:`~io.IOBase.close` цього потоку та джерело вхідних даних. знову стане вихідним вхідним потоком. Запити джерела можуть бути складені на будь-яку кількість рівнів.

source: If this attribute is numeric and ``1`` or more, a :class:`~shlex.shlex` instance will print verbose progress output on its behavior. If you need to use this, you can read the module source code to learn the details.
pt_br: Якщо цей атрибут є числовим і має ``1`` або більше, екземпляр :class:`~shlex.shlex` друкуватиме докладні дані про свою поведінку. Якщо вам потрібно скористатися цим, ви можете прочитати вихідний код модуля, щоб дізнатися подробиці.

source: Source line number (count of newlines seen so far plus one).
pt_br: Номер вихідного рядка (кількість нових рядків, побачених на даний момент плюс один).

source: The token buffer. It may be useful to examine this when catching exceptions.
pt_br: Буфер маркера. Може бути корисно перевірити це під час перехоплення винятків.

source: Token used to determine end of file. This will be set to the empty string (``''``), in non-POSIX mode, and to ``None`` in POSIX mode.
pt_br: Маркер, який використовується для визначення кінця файлу. Буде встановлено порожній рядок (``''``) у режимі, відмінному від POSIX, і значення ``None`` в режимі POSIX.

source: A read-only property. Characters that will be considered punctuation. Runs of punctuation characters will be returned as a single token. However, note that no semantic validity checking will be performed: for example, '>>>' could be returned as a token, even though it may not be recognised as such by shells.
pt_br: Властивість лише для читання. Символи, які вважатимуться розділовими. Серії знаків пунктуації повертатимуться як один маркер. Однак зауважте, що перевірка семантичної достовірності не виконуватиметься: наприклад, ">>>" може бути повернуто як маркер, навіть якщо він може бути не розпізнаний як такий оболонками.

source: Parsing Rules
pt_br: Regras de análise

source: When operating in non-POSIX mode, :class:`~shlex.shlex` will try to obey to the following rules.
pt_br: Під час роботи в режимі, відмінному від POSIX, :class:`~shlex.shlex` намагатиметься дотримуватися наступних правил.

source: Quote characters are not recognized within words (``Do"Not"Separate`` is parsed as the single word ``Do"Not"Separate``);
pt_br: Символи лапок не розпізнаються всередині слів (``Do"Not"Separate`` аналізується як одне слово ``Do"Not"Separate``);

source: Escape characters are not recognized;
pt_br: Екран-символи не розпізнаються;

source: Enclosing characters in quotes preserve the literal value of all characters within the quotes;
pt_br: Укладання символів у лапки зберігає буквальне значення всіх символів у лапках;

source: Closing quotes separate words (``"Do"Separate`` is parsed as ``"Do"`` and ``Separate``);
pt_br: Закриваючі лапки відокремлюють слова (``"Do"Separate`` розбирається як ``"Do"`` і ``Separate``);

source: If :attr:`~shlex.whitespace_split` is ``False``, any character not declared to be a word character, whitespace, or a quote will be returned as a single-character token. If it is ``True``, :class:`~shlex.shlex` will only split words in whitespaces;
pt_br: Якщо :attr:`~shlex.whitespace_split` має значення ``False``, будь-який символ, не оголошений як символ слова, пробіл або лапка, буде повернуто як односимвольний маркер. Якщо значення ``True``, :class:`~shlex.shlex` розділятиме слова лише пробілами;

source: EOF is signaled with an empty string (``''``);
pt_br: EOF сигналізується порожнім рядком (``''``);

source: It's not possible to parse empty strings, even if quoted.
pt_br: Неможливо проаналізувати порожні рядки, навіть якщо вони взяті в лапки.

source: When operating in POSIX mode, :class:`~shlex.shlex` will try to obey to the following parsing rules.
pt_br: Під час роботи в режимі POSIX :class:`~shlex.shlex` намагатиметься підкорятися наступним правилам аналізу.

source: Quotes are stripped out, and do not separate words (``"Do"Not"Separate"`` is parsed as the single word ``DoNotSeparate``);
pt_br: Лапки видаляються й не розділяють слова (``"Do"Not"Separate`` розбирається як одне слово ``DoNotSeparate``);

source: Non-quoted escape characters (e.g. ``'\'``) preserve the literal value of the next character that follows;
pt_br: Екран-символи без лапок (наприклад, ``'\'`` зберігають літеральне значення наступного наступного символу;
