Repository: python/python-docs-pt-br
Catalog: library/shutil.po
Languages: pt_br

source: *function* is the callable that will be used to unpack archives. The callable will receive the *base_name* of the file to create, followed by the *base_dir* (which defaults to :data:`os.curdir`) to start archiving from. Further arguments are passed as keyword arguments: *owner*, *group*, *dry_run* and *logger* (as passed in :func:`make_archive`).
pt_br: *function* é o chamável que será usado para desempacotar arquivos. O chamável receberá o *base_name* do arquivo a ser criado, seguido pelo *base_dir* (cujo padrão é :data:`os.curdir`) para iniciar o arquivamento. Outros argumentos são passados como argumentos nomeados *owner*, *group*, *dry_run* e *logger* (como passado em :func:`make_archive`).

source: If *function* has the custom attribute ``function.supports_root_dir`` set to ``True``, the *root_dir* argument is passed as a keyword argument. Otherwise the current working directory of the process is temporarily changed to *root_dir* before calling *function*. In this case :func:`make_archive` is not thread-safe.
pt_br: Se *function* tiver o atributo personalizado ``function.supports_root_dir`` definido como ``True``, o argumento *root_dir* será passado como um argumento nomeado. Caso contrário, o diretório de trabalho atual do processo será temporariamente alterado para *root_dir* antes de chamar *function*. Nesse caso, :func:`make_archive` não é segura para thread.

source: If given, *extra_args* is a sequence of ``(name, value)`` pairs that will be used as extra keywords arguments when the archiver callable is used.
pt_br: Se fornecido, *extra_args* é uma sequência de pares ``(nome, valor)`` que serão usados como argumentos nomeados extras quando o arquivador chamável for usado.

source: *description* is used by :func:`get_archive_formats` which returns the list of archivers. Defaults to an empty string.
pt_br: *description* é usado por :func:`get_archive_formats` que retorna a lista de arquivadores. O padrão é uma string vazia.

source: Added support for functions supporting the *root_dir* argument.
pt_br: Adicionado suporte para funções que suportam o argumento *root_dir*.

source: Remove the archive format *name* from the list of supported formats.
pt_br: Remove o formato de arquivo *name* da lista de formatos suportados.

source: Unpack an archive. *filename* is the full path of the archive.
pt_br: Desempacota um arquivo. *filename* é o caminho completo do arquivo.

source: *extract_dir* is the name of the target directory where the archive is unpacked. If not provided, the current working directory is used.
pt_br: *extract_dir* é o nome do diretório de destino onde o arquivo é desempacotado. Se não for fornecido, o diretório de trabalho atual será usado.

source: *format* is the archive format: one of "zip", "tar", "gztar", "bztar", or "xztar". Or any other format registered with :func:`register_unpack_format`. If not provided, :func:`unpack_archive` will use the archive file name extension and see if an unpacker was registered for that extension. In case none is found, a :exc:`ValueError` is raised.
pt_br: *format* é o formato do arquivo: um de "zip", "tar", "gztar", "bztar" ou "xztar". Ou qualquer outro formato registrado com :func:`register_unpack_format`. Se não for fornecido, :func:`unpack_archive` irá usar a extensão do nome do arquivo e ver se um desempacotador foi registrado para essa extensão. Caso nenhum seja encontrado, uma :exc:`ValueError` é levantada.

source: The keyword-only *filter* argument is passed to the underlying unpacking function. For zip files, *filter* is not accepted. For tar files, it is recommended to use ``'data'`` (default since Python 3.14), unless using features specific to tar and UNIX-like filesystems. (See :ref:`tarfile-extraction-filter` for details.)
pt_br: O argumento somente-nomeado *filter* é passado para a função de desempacotamento subjacente. Para arquivos zip, *filter* não é aceito. Para arquivos tar, é recomendado usar ``'data'`` (padrão desde o Python 3.14), a menos que esteja usando recursos específicos para tar e sistemas de arquivos do tipo UNIX. (Veja :ref:`tarfile-extraction-filter` para detalhes.)

source: Raises an :ref:`auditing event <auditing>` ``shutil.unpack_archive`` with arguments ``filename``, ``extract_dir``, ``format``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.unpack_archive`` com os argumentos ``filename``, ``extract_dir``, ``format``.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of the path specified in the *extract_dir* argument, e.g. members that have absolute filenames starting with "/" or filenames with two dots "..".
pt_br: Nunca extrai arquivos de fontes não confiáveis sem inspeção prévia. É possível que arquivos sejam criados fora do caminho especificado no argumento *extract_dir*, por exemplo, membros que têm nomes de arquivo absolutos começando com "/" ou nomes de arquivo com dois pontos "..".

source: Since Python 3.14, the defaults for both built-in formats (zip and tar files) will prevent the most dangerous of such security issues, but will not prevent *all* unintended behavior. Read the :ref:`tarfile-further-verification` section for tar-specific details.
pt_br: Desde o Python 3.14, os padrões para ambos os formatos embutidos (arquivos zip e tar) evitarão os problemas de segurança mais perigosos, mas não impedirão *todos* os comportamentos indesejados. Leia a seção :ref:`tarfile-further-verification` para detalhes específicos do tar.

source: Accepts a :term:`path-like object` for *filename* and *extract_dir*.
pt_br: Aceita um :term:`objeto caminho ou similar <path-like object>` para *filename* e *extract_dir*.

source: Added the *filter* argument.
pt_br: Adicionado o argumento *filter*.

source: Registers an unpack format. *name* is the name of the format and *extensions* is a list of extensions corresponding to the format, like ``.zip`` for Zip files.
pt_br: Registra um formato de desempacotamento. *name* é o nome do formato e *extensions* é uma lista de extensões correspondentes ao formato, como ``.zip`` para arquivos Zip.

source: *function* is the callable that will be used to unpack archives. The callable will receive:
pt_br: *function* é o chamável que será usado para desempacotar arquivos. O chamável receberá:

source: the path of the archive, as a positional argument;
pt_br: o caminho do arquivo, como argumento posicional;

source: the directory the archive must be extracted to, as a positional argument;
pt_br: o diretório para o qual o arquivo deve ser extraído, como um argumento posicional;

source: possibly a *filter* keyword argument, if it was given to :func:`unpack_archive`;
pt_br: possivelmente um argumento nomeado *filter*, se foi dado a :func:`unpack_archive`;

source: additional keyword arguments, specified by *extra_args* as a sequence of ``(name, value)`` tuples.
pt_br: argumentos nomeados adicionais, especificados por *extra_args* como uma sequência de tuplas ``(nome, valor)``.

source: *description* can be provided to describe the format, and will be returned by the :func:`get_unpack_formats` function.
pt_br: *description* pode ser fornecido para descrever o formato e será devolvido pela função :func:`get_unpack_formats`.

source: Unregister an unpack format. *name* is the name of the format.
pt_br: Cancela o registro de um formato de desempacotamento. *name* é o nome do formato.

source: Return a list of all registered formats for unpacking. Each element of the returned sequence is a tuple ``(name, extensions, description)``.
pt_br: Retorna uma lista de todos os formatos registrados para desempacotamento. Cada elemento da sequência retornada é uma tupla ``(name, extensions, description)``.

source: *zip*: ZIP file (unpacking compressed files works only if the corresponding module is available).
pt_br: *zip*: arquivo ZIP (desempacotar arquivos compactados funciona apenas se o módulo correspondente estiver disponível).

source: *tar*: uncompressed tar file.
pt_br: *tar*: arquivo tar não comprimido.

source: You can register new formats or provide your own unpacker for any existing formats, by using :func:`register_unpack_format`.
pt_br: Você pode registrar novos formatos ou fornecer seu próprio desempacotador para quaisquer formatos existentes, usando :func:`register_unpack_format`.

source: Archiving example
pt_br: Exemplo de arquivo

source: In this example, we create a gzip'ed tar-file archive containing all files found in the :file:`.ssh` directory of the user::
pt_br: Neste exemplo, criamos um arquivo tar compactado com gzip contendo todos os arquivos encontrados no diretório :file:`.ssh` do usuário::

source: >>> from shutil import make_archive >>> import os >>> archive_name = os.path.expanduser(os.path.join('~', 'myarchive')) >>> root_dir = os.path.expanduser(os.path.join('~', '.ssh')) >>> make_archive(archive_name, 'gztar', root_dir) '/Users/tarek/myarchive.tar.gz'
pt_br: >>> from shutil import make_archive >>> import os >>> archive_name = os.path.expanduser(os.path.join('~', 'meuarquivo')) >>> root_dir = os.path.expanduser(os.path.join('~', '.ssh')) >>> make_archive(archive_name, 'gztar', root_dir) '/Users/tarek/meuarquivo.tar.gz'

source: The resulting archive contains:
pt_br: O arquivo resultante contém:

source: $ tar -tzvf /Users/tarek/myarchive.tar.gz drwx------ tarek/staff 0 2010-02-01 16:23:40 ./ -rw-r--r-- tarek/staff 609 2008-06-09 13:26:54 ./authorized_keys -rwxr-xr-x tarek/staff 65 2008-06-09 13:26:54 ./config -rwx------ tarek/staff 668 2008-06-09 13:26:54 ./id_dsa -rwxr-xr-x tarek/staff 609 2008-06-09 13:26:54 ./id_dsa.pub -rw------- tarek/staff 1675 2008-06-09 13:26:54 ./id_rsa -rw-r--r-- tarek/staff 397 2008-06-09 13:26:54 ./id_rsa.pub -rw-r--r-- tarek/staff 37192 2010-02-06 18:23:10 ./known_hosts
pt_br: $ tar -tzvf /Users/tarek/meuarquivo.tar.gz drwx------ tarek/staff 0 2010-02-01 16:23:40 ./ -rw-r--r-- tarek/staff 609 2008-06-09 13:26:54 ./authorized_keys -rwxr-xr-x tarek/staff 65 2008-06-09 13:26:54 ./config -rwx------ tarek/staff 668 2008-06-09 13:26:54 ./id_dsa -rwxr-xr-x tarek/staff 609 2008-06-09 13:26:54 ./id_dsa.pub -rw------- tarek/staff 1675 2008-06-09 13:26:54 ./id_rsa -rw-r--r-- tarek/staff 397 2008-06-09 13:26:54 ./id_rsa.pub -rw-r--r-- tarek/staff 37192 2010-02-06 18:23:10 ./known_hosts

source: Archiving example with *base_dir*
pt_br: Exemplo de arquivamento com *base_dir*

source: In this example, similar to the `one above <shutil-archiving-example_>`_, we show how to use :func:`make_archive`, but this time with the usage of *base_dir*. We now have the following directory structure:
pt_br: Neste exemplo, semelhante ao `acima <shutil-archiving-example_>`_, mostramos como usar :func:`make_archive`, mas desta vez com o uso de *base_dir*. Agora temos a seguinte estrutura de diretório:

source: $ tree tmp tmp └── root └── structure ├── content └── please_add.txt └── do_not_add.txt
pt_br: $ tree tmp tmp └── root └── estrutura ├── conteudo └── por_favor_adicionar.txt └── nao_adicionar.txt

source: In the final archive, :file:`please_add.txt` should be included, but :file:`do_not_add.txt` should not. Therefore we use the following::
pt_br: No arquivo final, :file:`please_add.txt` deve ser incluído, mas :file:`do_not_add.txt` não deve. Portanto, usamos o seguinte::

source: >>> from shutil import make_archive >>> import os >>> archive_name = os.path.expanduser(os.path.join('~', 'myarchive')) >>> make_archive( ... archive_name, ... 'tar', ... root_dir='tmp/root', ... base_dir='structure/content', ... ) '/Users/tarek/my_archive.tar'
pt_br: >>> from shutil import make_archive >>> import os >>> archive_name = os.path.expanduser(os.path.join('~', 'meuarquivo')) >>> make_archive( ... archive_name, ... 'tar', ... root_dir='tmp/root', ... base_dir='estrutura/conteudo', ... ) '/Users/tarek/meuarquivo.tar'

source: Listing the files in the resulting archive gives us:
pt_br: Listar os arquivos no arquivo resultante nos dá:

source: $ python -m tarfile -l /Users/tarek/myarchive.tar structure/content/ structure/content/please_add.txt
pt_br: $ python -m tarfile -l /Users/tarek/meuarquivo.tar estrutura/conteudo/ estrutura/conteudo/por_favor_adicionar.txt

source: Querying the size of the output terminal
pt_br: Consultando o tamanho do terminal de saída

source: Get the size of the terminal window.
pt_br: Obtém o tamanho da janela do terminal.

source: For each of the two dimensions, the environment variable, ``COLUMNS`` and ``LINES`` respectively, is checked. If the variable is defined and the value is a positive integer, it is used.
pt_br: Para cada uma das duas dimensões, a variável de ambiente, ``COLUMNS`` e ``LINES`` respectivamente, é verificada. Se a variável estiver definida e o valor for um número inteiro positivo, ela será usada.

source: When ``COLUMNS`` or ``LINES`` is not defined, which is the common case, the terminal connected to :data:`sys.__stdout__` is queried by invoking :func:`os.get_terminal_size`.
pt_br: Quando ``COLUMNS`` ou ``LINES`` não está definida, que é o caso comum, o terminal conectado a :data:`sys.__stdout__` é consultado invocando :func:`os.get_terminal_size`.

source: If the terminal size cannot be successfully queried, either because the system doesn't support querying, or because we are not connected to a terminal, the value given in ``fallback`` parameter is used. ``fallback`` defaults to ``(80, 24)`` which is the default size used by many terminal emulators.
pt_br: Se o tamanho do terminal não pode ser consultado com sucesso, ou porque o sistema não tem suporte a consultas, ou porque não estamos conectados a um terminal, o valor dado no parâmetro ``fallback`` é usado. O padrão de ``fallback`` é ``(80, 24)``, que é o tamanho padrão usado por muitos emuladores de terminal.

source: The value returned is a named tuple of type :class:`os.terminal_size`.
pt_br: O valor retornado é uma tupla nomeada do tipo :class:`os.terminal_size`.

source: See also: The Single UNIX Specification, Version 2, `Other Environment Variables`_.
pt_br: Veja também: The Single UNIX Specification, Versão 2, `Other Environment Variables`_.

source: The ``fallback`` values are also used if :func:`os.get_terminal_size` returns zeroes.
pt_br: Os valores ``fallback`` também são usados se :func:`os.get_terminal_size` retornar zeros.

source: file
pt_br: arquivo

source: copying
pt_br: cópia

source: copying files
pt_br: cópia de arquivos

source: directory
pt_br: diretório

source: deleting
pt_br: exclusão
