Repository: python/python-docs-pt-br
Catalog: library/shutil.po
Languages: pt_br

source: The first parameter, *function*, is the function which raised the exception; it depends on the platform and implementation. The second parameter, *path*, will be the path name passed to *function*. The third parameter, *excinfo*, is the exception that was raised. Exceptions raised by *onexc* will not be caught.
pt_br: O primeiro parâmetro, *function*, é a função que levantou a exceção; depende da plataforma e da implementação. O segundo parâmetro, *path*, será o nome do caminho passado para a *função*. O terceiro parâmetro, *excinfo*, é a exceção que foi levantada. Exceções levantadas por *onexc* não serão capturadas.

source: The deprecated *onerror* is similar to *onexc*, except that the third parameter it receives is the tuple returned from :func:`sys.exc_info`.
pt_br: O descontinuado *onerror* é semelhante ao *onexc*, exceto que o terceiro parâmetro que ele recebe é a tupla retornada de :func:`sys.exc_info`.

source: :ref:`shutil-rmtree-example` for an example of handling the removal of a directory tree that contains read-only files.
pt_br: :ref:`shutil-rmtree-example` para um exemplo de tratamento da remoção de uma árvore de diretórios que contém arquivos somente leitura.

source: Raises an :ref:`auditing event <auditing>` ``shutil.rmtree`` with arguments ``path``, ``dir_fd``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.rmtree`` com os argumentos ``path``, ``dir_fd``.

source: Added a symlink attack resistant version that is used automatically if platform supports fd-based functions.
pt_br: Adicionada uma versão resistente a ataques de link simbólico que é usada automaticamente se a plataforma suportar funções baseadas em descritor de arquivo.

source: On Windows, will no longer delete the contents of a directory junction before removing the junction.
pt_br: No Windows, não excluirá mais o conteúdo de uma junção de diretório antes de remover a junção.

source: Added the *dir_fd* parameter.
pt_br: Adicionado o parâmetro *dir_fd*.

source: Added the *onexc* parameter, deprecated *onerror*.
pt_br: Adicionado o parâmetro *onexc*, descontinuado *onerror*.

source: :func:`!rmtree` now ignores :exc:`FileNotFoundError` exceptions for all but the top-level path. Exceptions other than :exc:`OSError` and subclasses of :exc:`!OSError` are now always propagated to the caller.
pt_br: :func:`!rmtree` agora ignora exceções :exc:`FileNotFoundError` para todos, exceto o caminho de nível superior. Exceções diferentes de :exc:`OSError` e subclasses de :exc:`!OSError` agora são sempre propagadas para o chamador.

source: Indicates whether the current platform and implementation provides a symlink attack resistant version of :func:`rmtree`. Currently this is only true for platforms supporting fd-based directory access functions.
pt_br: Indica se a plataforma e implementação atuais fornecem uma versão resistente a ataques de link simbólico de :func:`rmtree`. Atualmente, isso só é verdade para plataformas que suportam funções de acesso ao diretório baseadas em descritor de arquivo.

source: Recursively move a file or directory (*src*) to another location and return the destination.
pt_br: Move recursivamente um arquivo ou diretório (*src*) para outro local e retorna ao destino.

source: If *dst* is an existing directory or a symlink to a directory, then *src* is moved inside that directory. The destination path in that directory must not already exist.
pt_br: Se *dst* for um diretório existente ou um symlink para um diretório, então *src* é movido para dentro desse diretório. O caminho de destino nesse diretório não deve existir ainda.

source: If *dst* already exists but is not a directory, it may be overwritten depending on :func:`os.rename` semantics.
pt_br: Se *dst* já existir, mas não for um diretório, ele poderá ser substituído dependendo da semântica de :func:`os.rename`.

source: If the destination is on the current filesystem, then :func:`os.rename` is used. Otherwise, *src* is copied to the destination using *copy_function* and then removed. In case of symlinks, a new symlink pointing to the target of *src* will be created as the destination and *src* will be removed.
pt_br: Se o destino está no sistema de arquivos atual, então :func:`os.rename` é usado. Caso contrário, *src* é copiado para o destino usando *copy_function* e depois removido. No caso de links simbólicos, um novo link simbólico apontando para o destino de *src* será criado como o destino e *src* serão removidos.

source: If *copy_function* is given, it must be a callable that takes two arguments, *src* and the destination, and will be used to copy *src* to the destination if :func:`os.rename` cannot be used. If the source is a directory, :func:`copytree` is called, passing it the *copy_function*. The default *copy_function* is :func:`copy2`. Using :func:`~shutil.copy` as the *copy_function* allows the move to succeed when it is not possible to also copy the metadata, at the expense of not copying any of the metadata.
pt_br: Se *copy_function* for fornecido, deve ser um chamável que leva dois argumentos *src* e a destinação, e será usado para copiar *src* para a destinação se :func:`os.rename` não puder ser usado. Se a fonte for um diretório, :func:`copytree` é chamado, passando *copy_function*. A *copy_function* padrão é :func:`copy2`. Usar :func:`~shutil.copy` como *copy_function* permite que a movimentação seja bem-sucedida quando não é possível copiar também os metadados, às custas de não copiar nenhum dos metadados.

source: Raises an :ref:`auditing event <auditing>` ``shutil.move`` with arguments ``src``, ``dst``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.move`` com os argumentos ``src``, ``dst``.

source: Added explicit symlink handling for foreign filesystems, thus adapting it to the behavior of GNU's :program:`mv`. Now returns *dst*.
pt_br: Adicionada manipulação de links simbólicos explícitos para sistemas de arquivos externos, adaptando-os ao comportamento do GNU :program:`mv`. Agora retorna *dst*.

source: Added the *copy_function* keyword argument.
pt_br: Adicionado o argumento nomeado *copy_function*.

source: Accepts a :term:`path-like object` for both *src* and *dst*.
pt_br: Aceita um :term:`objeto caminho ou similar` para *src* e *dst*.

source: Return disk usage statistics about the given path as a :term:`named tuple` with the attributes *total*, *used* and *free*, which are the amount of total, used and free space, in bytes. *path* may be a file or a directory.
pt_br: Retorna estatísticas de uso de disco sobre o caminho fornecido como :term:`tupla nomeada` com os atributos *total*, *used* e *free*, que são a quantidade de espaço total, usado e livre, em bytes. *path* pode ser um arquivo ou diretório.

source: On Unix filesystems, *path* must point to a path within a **mounted** filesystem partition. On those platforms, CPython doesn't attempt to retrieve disk usage information from non-mounted filesystems.
pt_br: Em sistemas de arquivos Unix, *path* deve apontar para um caminho dentro de uma partição de sistema de arquivos **montada**. Nessas plataformas, o CPython não tenta recuperar informações de uso de disco de sistemas de arquivos não montados.

source: On Windows, *path* can now be a file or directory.
pt_br: No Windows, *path* pode agora ser um arquivo ou diretório.

source: Availability
pt_br: Disponibilidade

source: Change owner *user* and/or *group* of the given *path*.
pt_br: Altera o proprietário *usuário* e/ou *group* do *path* fornecido.

source: *user* can be a system user name or a uid; the same applies to *group*. At least one argument is required.
pt_br: *user* pode ser um nome de usuário do sistema ou um uid; o mesmo se aplica ao *group*. É necessário pelo menos um argumento.

source: See also :func:`os.chown`, the underlying function.
pt_br: Veja também :func:`os.chown`, a função subjacente.

source: Raises an :ref:`auditing event <auditing>` ``shutil.chown`` with arguments ``path``, ``user``, ``group``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.chown`` com os argumentos ``path``, ``user``, ``group``.

source: Added *dir_fd* and *follow_symlinks* parameters.
pt_br: Adicionados os parâmetros *dir_fd* e *follow_symlinks*.

source: Return the path to an executable which would be run if the given *cmd* was called. If no *cmd* would be called, return ``None``.
pt_br: Retorna o caminho para um executável que seria executado se o *cmd* fornecido fosse chamado. Se nenhum *cmd* for chamado, retorna ``None``.

source: *mode* is a permission mask passed to :func:`os.access`, by default determining if the file exists and is executable.
pt_br: *mode* é uma máscara de permissão passada para :func:`os.access`, por padrão determinando se o arquivo existe e é executável.

source: *path* is a "``PATH`` string" specifying the directories to look in, delimited by :data:`os.pathsep`. When no *path* is specified, the :envvar:`PATH` environment variable is read from :data:`os.environ`, falling back to :data:`os.defpath` if it is not set.
pt_br: *path* é uma "string ``PATH``" que especifica os diretórios a serem procurados, delimitados por :data:`os.pathsep`. Quando nenhum *path* é especificado, a variável de ambiente :envvar:`PATH` é lida de :data:`os.environ`, retornando para :data:`os.defpath` se não estiver definida.

source: If *cmd* contains a directory component, :func:`!which` only checks the specified path directly and does not search the directories listed in *path* or in the system's :envvar:`PATH` environment variable.
pt_br: Se *cmd* contiver um componente de diretório, :func:`!which` verificará apenas o caminho especificado diretamente e não pesquisará os diretórios listados em *path* ou na variável de ambiente :envvar:`PATH` do sistema.

source: On Windows, the current directory is prepended to the *path* if *mode* does not include ``os.X_OK``. When the *mode* does include ``os.X_OK``, the Windows API ``NeedCurrentDirectoryForExePathW`` will be consulted to determine if the current directory should be prepended to *path*. To avoid consulting the current working directory for executables: set the environment variable ``NoDefaultCurrentDirectoryInExePath``.
pt_br: No Windows, o diretório atual é prefixado ao *path* se o *mode* não incluir ``os.X_OK``. Quando o *mode* inclui ``os.X_OK``, a API do Windows ``NeedCurrentDirectoryForExePathW`` será consultada para determinar se o diretório atual deve ser prefixado ao *path*. Para evitar consultar o diretório de trabalho atual para executáveis: defina a variável de ambiente ``NoDefaultCurrentDirectoryInExePath``.

source: Also on Windows, the :envvar:`PATHEXT` environment variable is used to resolve commands that may not already include an extension. For example, if you call ``shutil.which("python")``, :func:`which` will search ``PATHEXT`` to know that it should look for ``python.exe`` within the *path* directories. For example, on Windows::
pt_br: Também no Windows, a variável de ambiente :envvar:`PATHEXT` é usada para resolver comandos que podem não incluir uma extensão. Por exemplo, se você chamar ``shutil.which("python")``, :func:`which` pesquisará ``PATHEXT`` para saber que deve procurar por ``python.exe`` dentro dos diretórios *path*. Por exemplo, no Windows::

source: This is also applied when *cmd* is a path that contains a directory component::
pt_br: Isso também se aplica quando *cmd* é um caminho que contém um componente de diretório::

source: The :class:`bytes` type is now accepted. If *cmd* type is :class:`bytes`, the result type is also :class:`bytes`.
pt_br: O tipo :class:`bytes` é agora aceitado. Se o tipo de *cmd* é :class:`bytes`, o tipo resultante também é :class:`bytes`.

source: On Windows, the current directory is no longer prepended to the search path if *mode* includes ``os.X_OK`` and WinAPI ``NeedCurrentDirectoryForExePathW(cmd)`` is false, else the current directory is prepended even if it is already in the search path; ``PATHEXT`` is used now even when *cmd* includes a directory component or ends with an extension that is in ``PATHEXT``; and filenames that have no extension can now be found.
pt_br: No Windows, o diretório atual não é mais adicionado ao caminho de pesquisa se *mode* incluir ``os.X_OK`` e WinAPI ``NeedCurrentDirectoryForExePathW(cmd)`` for falso, caso contrário, o diretório atual será adicionado mesmo se já estiver no caminho de pesquisa; ``PATHEXT`` agora é usado mesmo quando *cmd* inclui um componente de diretório ou termina com uma extensão que está em ``PATHEXT``; e nomes de arquivos que não têm extensão agora podem ser encontrados.

source: This exception collects exceptions that are raised during a multi-file operation. For :func:`copytree`, the exception argument is a list of 3-tuples (*srcname*, *dstname*, *exception*).
pt_br: Esta exceção coleta exceções que são levantadas durante uma operação de vários arquivos. Para :func:`copytree`, o argumento de exceção é uma lista de tuplas de 3 elementos (*srcname*, *dstname*, *exception*).

source: Platform-dependent efficient copy operations
pt_br: Operações de cópia eficientes dependentes da plataforma

source: Starting from Python 3.8, all functions involving a file copy (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree`, and :func:`move`) may use platform-specific "fast-copy" syscalls in order to copy the file more efficiently (see :issue:`33671`). "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``".
pt_br: A partir do Python 3.8, todas as funções envolvendo uma cópia de arquivo (:func:`copyfile`, :func:`~shutil.copy`, :func:`copy2`, :func:`copytree` e :func:`move` ) podem usar chamadas do sistema de "cópia rápida" específicas da plataforma para copiar o arquivo de forma mais eficiente (veja :issue:`33671`). "cópia rápida" significa que a operação de cópia ocorre dentro do kernel, evitando o uso de buffers de espaço de usuário em Python como em "``outfd.write(infd.read())``".

source: On macOS `fcopyfile`_ is used to copy the file content (not metadata).
pt_br: No macOS, `fcopyfile`_ é usado para copiar o conteúdo do arquivo (não metadados).

source: On Linux :func:`os.copy_file_range` or :func:`os.sendfile` is used.
pt_br: No Linux, :func:`os.copy_file_range` ou :func:`os.sendfile` é usado.

source: On Solaris :func:`os.sendfile` is used.
pt_br: No Solaris, :func:`os.sendfile` é usado.

source: On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 64 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used.
pt_br: No Windows, :func:`shutil.copyfile` usa um tamanho de buffer padrão maior (1 MiB ao invés de 64 KiB) e uma variante de :func:`shutil.copyfileobj` baseada em :func:`memoryview` é usada.

source: If the fast-copy operation fails and no data was written in the destination file then shutil will silently fallback on using less efficient :func:`copyfileobj` function internally.
pt_br: Se a operação de cópia rápida falhar e nenhum dado foi escrito no arquivo de destino, o shutil irá silenciosamente voltar a usar a função menos eficiente :func:`copyfileobj` internamente.

source: Solaris now uses :func:`os.sendfile`.
pt_br: Solaris agora usa :func:`os.sendfile`.

source: Copy-on-write or server-side copy may be used internally via :func:`os.copy_file_range` on supported Linux filesystems.
pt_br: A cópia na gravação (copy-on-write) ou cópia do lado do servidor podem ser usadas internamente via :func:`os.copy_file_range` em sistemas de arquivos Linux suportados.

source: copytree example
pt_br: Exemplo de copytree

source: An example that uses the :func:`ignore_patterns` helper::
pt_br: Um exemplo que usa o auxiliar :func:`ignore_patterns`::

source: This will copy everything except ``.pyc`` files and files or directories whose name starts with ``tmp``.
pt_br: Isso irá copiar tudo, exceto os arquivos ``.pyc`` e arquivos ou diretórios cujo nome começa com ``tmp``.

source: Another example that uses the *ignore* argument to add a logging call::
pt_br: Outro exemplo que usa o argumento *ignore* para adicionar uma chamada de registro::

source: from shutil import copytree import logging def _logpath(path, names): logging.info('Working in %s', path) return [] # nothing will be ignored copytree(source, destination, ignore=_logpath)
pt_br: from shutil import copytree import logging def _logpath(path, names): logging.info('Working in %s', path) return [] # nada será ignorado copytree(source, destination, ignore=_logpath)

source: rmtree example
pt_br: exemplo rmtree

source: This example shows how to remove a directory tree on Windows where some of the files have their read-only bit set. It uses the onexc callback to clear the readonly bit and reattempt the remove. Any subsequent failure will propagate. ::
pt_br: Este exemplo mostra como remover uma árvore de diretório no Windows onde alguns dos arquivos têm seu conjunto de bits somente leitura. Ele usa a função de retorno onexc para limpar o bit somente leitura e tentar remover novamente. Qualquer falha subsequente se propagará. ::

source: Archiving operations
pt_br: Operações de arquivamento

source: Added support for the *xztar* format.
pt_br: Adicionado suporte ao formato *xztar*.

source: High-level utilities to create and read compressed and archived files are also provided. They rely on the :mod:`zipfile` and :mod:`tarfile` modules.
pt_br: Utilitários de alto nível para criar e ler arquivos compactados e arquivados também são fornecidos. Eles contam com os módulos :mod:`zipfile` e :mod:`tarfile`.

source: Create an archive file (such as zip or tar) and return its name.
pt_br: Cria um arquivo compactado (como zip ou tar) e retorna seu nome.

source: *base_name* is the name of the file to create, including the path, minus any format-specific extension.
pt_br: *base_name* é o nome do arquivo a ser criado, incluindo o caminho, menos qualquer extensão específica do formato.

source: *format* is the archive format: one of "zip" (if the :mod:`zlib` module is available), "tar", "gztar" (if the :mod:`zlib` module is available), "bztar" (if the :mod:`bz2` module is available), or "xztar" (if the :mod:`lzma` module is available).
pt_br: *format* é o formato do arquivo: um de "zip" (se o módulo :mod:`zlib` estiver disponível), "tar", "gztar" (se o módulo :mod:`zlib` estiver disponível), "bztar" (se o módulo :mod:`bz2` estiver disponível) ou "xztar" (se o módulo :mod:`lzma` estiver disponível).

source: *root_dir* is a directory that will be the root directory of the archive, all paths in the archive will be relative to it; for example, we typically chdir into *root_dir* before creating the archive.
pt_br: *root_dir* é um diretório que será o diretório raiz do arquivo, todos os caminhos no arquivo serão relativos a ele; por exemplo, normalmente chdir em *root_dir* antes de criar o arquivo.

source: *base_dir* is the directory where we start archiving from; i.e. *base_dir* will be the common prefix of all files and directories in the archive. *base_dir* must be given relative to *root_dir*. See :ref:`shutil-archiving-example-with-basedir` for how to use *base_dir* and *root_dir* together.
pt_br: *base_dir* é o diretório de onde iniciamos o arquivamento; ou seja, *base_dir* será o prefixo comum de todos os arquivos e diretórios no arquivo. *base_dir* deve ser fornecido em relação a *root_dir*. Veja :ref:`shutil-archiving-example-with-basedir` para como usar *base_dir* e *root_dir* juntos.

source: *root_dir* and *base_dir* both default to the current directory.
pt_br: *root_dir* e *base_dir* têm com padrão o diretório atual.

source: If *dry_run* is true, no archive is created, but the operations that would be executed are logged to *logger*.
pt_br: Se *dry_run* for verdadeiro, nenhum arquivo é criado, mas as operações que seriam executadas são registradas no *logger*.

source: *owner* and *group* are used when creating a tar archive. By default, uses the current owner and group.
pt_br: *owner* e *group* são usados ao criar um arquivo tar. Por padrão, usa o proprietário e grupo atuais.

source: *logger* must be an object compatible with :pep:`282`, usually an instance of :class:`logging.Logger`.
pt_br: *logger* deve ser um objeto compatível com a :pep:`282`, geralmente uma instância de :class:`logging.Logger`.

source: The *verbose* argument is unused and deprecated.
pt_br: O argumento *verbose* não é usado e foi descontinuado.

source: Raises an :ref:`auditing event <auditing>` ``shutil.make_archive`` with arguments ``base_name``, ``format``, ``root_dir``, ``base_dir``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.make_archive`` com os argumentos ``base_name``, ``format``, ``root_dir``, ``base_dir``.

source: This function is not thread-safe when custom archivers registered with :func:`register_archive_format` do not support the *root_dir* argument. In this case it temporarily changes the current working directory of the process to *root_dir* to perform archiving.
pt_br: Esta função não é segura para thread quando arquivadores personalizados registrados com :func:`register_archive_format` não suportam o argumento *root_dir*. Neste caso, ele altera temporariamente o diretório de trabalho atual do processo para *root_dir* para executar o arquivamento.

source: The modern pax (POSIX.1-2001) format is now used instead of the legacy GNU format for archives created with ``format="tar"``.
pt_br: O formato pax moderno (POSIX.1-2001) agora é usado em vez do formato GNU legado para arquivos criados com ``format="tar"``.

source: This function is now made thread-safe during creation of standard ``.zip`` and tar archives.
pt_br: Esta função agora é segura para thread durante a criação de arquivos ``.zip`` e tar padrão.

source: Return a list of supported formats for archiving. Each element of the returned sequence is a tuple ``(name, description)``.
pt_br: Retorna uma lista de formatos suportados para arquivamento. Cada elemento da sequência retornada é uma tupla ``(nome, descrição)``.

source: By default :mod:`shutil` provides these formats:
pt_br: Por padrão, :mod:`shutil` fornece estes formatos:

source: *zip*: ZIP file (if the :mod:`zlib` module is available).
pt_br: *zip*: arquivo ZIP (se o módulo :mod:`zlib` estiver disponível).

source: *tar*: Uncompressed tar file. Uses POSIX.1-2001 pax format for new archives.
pt_br: *tar*: Arquivo tar não compactado. Usa o formato POSIX.1-2001 pax para novos arquivos.

source: *gztar*: gzip'ed tar-file (if the :mod:`zlib` module is available).
pt_br: *gztar*: arquivo tar compactado com gzip (se o módulo :mod:`zlib` estiver disponível).

source: *bztar*: bzip2'ed tar-file (if the :mod:`bz2` module is available).
pt_br: *bztar*: arquivo tar compactado com bzip2 (se o módulo :mod:`bz2` estiver disponível).

source: *xztar*: xz'ed tar-file (if the :mod:`lzma` module is available).
pt_br: *xztar*: Arquivo tar compactado com xz (se o módulo :mod:`lzma` estiver disponível).

source: You can register new formats or provide your own archiver for any existing formats, by using :func:`register_archive_format`.
pt_br: Você pode registrar novos formatos ou fornecer seu próprio arquivador para quaisquer formatos existentes, usando :func:`register_archive_format`.

source: Register an archiver for the format *name*.
pt_br: Registra um arquivador para o formato *name*.
