Repository: python/python-docs-pt-br
Catalog: library/shutil.po
Languages: pt_br

source: :mod:`!shutil` --- High-level file operations
pt_br: :mod:`!shutil` --- Operações de arquivo de alto nível

source: **Source code:** :source:`Lib/shutil.py`
pt_br: **Código-fonte:** :source:`Lib/shutil.py`

source: The :mod:`shutil` module offers a number of high-level operations on files and collections of files. In particular, functions are provided which support file copying and removal. For operations on individual files, see also the :mod:`os` module.
pt_br: O módulo :mod:`shutil` oferece várias operações de alto nível em arquivos e coleções de arquivos. Em particular, são fornecidas funções que possuem suporte a cópia e remoção de arquivos. Para operações em arquivos individuais, veja também o módulo :mod:`os`.

source: Even the higher-level file copying functions (:func:`shutil.copy`, :func:`shutil.copy2`) cannot copy all file metadata.
pt_br: Mesmo as funções de cópia de arquivos de nível mais alto (:func:`shutil.copy`, :func:`shutil.copy2`) não podem copiar todos os metadados do arquivo.

source: On POSIX platforms, this means that file owner and group are lost as well as ACLs. On Mac OS, the resource fork and other metadata are not used. This means that resources will be lost and file type and creator codes will not be correct. On Windows, file owners, ACLs and alternate data streams are not copied.
pt_br: Nas plataformas POSIX, isso significa que o proprietário e o grupo do arquivo são perdidos, bem como as ACLs. No Mac OS, a bifurcação de recursos e outros metadados não são usados. Isso significa que os recursos serão perdidos e o tipo de arquivo e os códigos do criador não estarão corretos. No Windows, os proprietários de arquivos, ACLs e fluxos de dados alternativos não são copiados.

source: Directory and files operations
pt_br: Operações de diretório e arquivos

source: Copy the contents of the :term:`file-like object <file object>` *fsrc* to the file-like object *fdst*. The integer *length*, if given, is the buffer size. In particular, a negative *length* value means to copy the data without looping over the source data in chunks; by default the data is read in chunks to avoid uncontrolled memory consumption. Note that if the current file position of the *fsrc* object is not 0, only the contents from the current file position to the end of the file will be copied.
pt_br: Copia o conteúdo do :term:`objeto arquivo ou similar <file object>` *fsrc* para o objeto arquivo ou similar *fdst*. O número inteiro *length*, se fornecido, é o tamanho do buffer. Em particular, um valor negativo *length* significa copiar os dados sem repetir os dados de origem em pedaços; por padrão, os dados são lidos em pedaços para evitar o consumo descontrolado de memória. Observe que, se a posição atual do arquivo do objeto *fsrc* não for 0, apenas o conteúdo da posição atual do arquivo até o final do arquivo será copiado.

source: Copy the contents (no metadata) of the file named *src* to a file named *dst* and return *dst* in the most efficient way possible. *src* and *dst* are :term:`path-like objects <path-like object>` or path names given as strings.
pt_br: Copia o conteúdo (sem metadados) do arquivo chamado *src* para um arquivo chamado *dst* e retorna *dst* da maneira mais eficiente possível. *src* e *dst* são :term:`objetos caminho ou similares <path-like object>` ou nomes de caminhos dados como strings.

source: *dst* must be the complete target file name; look at :func:`~shutil.copy` for a copy that accepts a target directory path. If *src* and *dst* specify the same file, :exc:`SameFileError` is raised.
pt_br: *dst* deve ser o nome completo do arquivo de destino; veja :func:`~shutil.copy` para uma cópia que aceita um caminho de diretório de destino. Se *src* e *dst* especificarem o mesmo arquivo, :exc:`SameFileError` será levantada.

source: The destination location must be writable; otherwise, an :exc:`OSError` exception will be raised. If *dst* already exists, it will be replaced. Special files such as character or block devices and pipes cannot be copied with this function.
pt_br: O local de destino deve ser gravável; caso contrário, uma exceção :exc:`OSError` será levantada. Se o *dst* já existir, ele será substituído. Arquivos especiais como dispositivos de caractere ou bloco e encadeamentos (pipe) não podem ser copiados com esta função.

source: If *follow_symlinks* is false and *src* is a symbolic link, a new symbolic link will be created instead of copying the file *src* points to.
pt_br: Se *follow_symlinks* for falso e *src* for um link simbólico, um novo link simbólico será criado em vez de copiar o arquivo *src* para o qual o arquivo aponta.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copyfile`` with arguments ``src``, ``dst``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copyfile`` com os argumentos ``src``, ``dst``.

source: :exc:`IOError` used to be raised instead of :exc:`OSError`. Added *follow_symlinks* argument. Now returns *dst*.
pt_br: :exc:`IOError` costumava ser levantada em vez de :exc:`OSError`. Adicionado argumento *follow_symlinks*. Agora retorna *dst*.

source: Raise :exc:`SameFileError` instead of :exc:`Error`. Since the former is a subclass of the latter, this change is backward compatible.
pt_br: Levanta :exc:`SameFileError` em vez de :exc:`Error`. Como a primeira é uma subclasse da última, essa alteração é compatível com versões anteriores.

source: Platform-specific fast-copy syscalls may be used internally in order to copy the file more efficiently. See :ref:`shutil-platform-dependent-efficient-copy-operations` section.
pt_br: As chamadas de sistema de cópia rápida específicas da plataforma podem ser usadas internamente para copiar o arquivo com mais eficiência. Veja a seção :ref:`shutil-platform-dependent-efficient-copy-operations`.

source: This exception is raised if source and destination in :func:`copyfile` are the same file.
pt_br: Essa exceção é levantada se a origem e o destino em :func:`copyfile` forem o mesmo arquivo.

source: Copy the permission bits from *src* to *dst*. The file contents, owner, and group are unaffected. *src* and *dst* are :term:`path-like objects <path-like object>` or path names given as strings. If *follow_symlinks* is false, and both *src* and *dst* are symbolic links, :func:`copymode` will attempt to modify the mode of *dst* itself (rather than the file it points to). This functionality is not available on every platform; please see :func:`copystat` for more information. If :func:`copymode` cannot modify symbolic links on the local platform, and it is asked to do so, it will do nothing and return.
pt_br: Copia os bits de permissão de *src* para *dst*. O conteúdo do arquivo, o proprietário e o grupo não são afetados. *src* e *dst* são :term:`objetos caminho ou similares <path-like object>` ou nomes de caminhos dados como strings. Se *follow_symlinks* for falso e *src* e *dst* forem links simbólicos, :func:`copymode` tentará modificar o modo do *dst* (e não o arquivo para o qual ele aponta). Essa funcionalidade não está disponível em todas as plataformas; veja :func:`copystat` para mais informações. Se :func:`copymode` não puder modificar links simbólicos na plataforma local, e for solicitado a fazê-lo, não fará nada e retornará.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copymode`` with arguments ``src``, ``dst``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copymode`` com os argumentos ``src``, ``dst``.

source: Added *follow_symlinks* argument.
pt_br: Adicionado argumento *follow_symlinks*.

source: Copy the permission bits, last access time, last modification time, and flags from *src* to *dst*. On Linux, :func:`copystat` also copies the "extended attributes" where possible. The file contents, owner, and group are unaffected. *src* and *dst* are :term:`path-like objects <path-like object>` or path names given as strings.
pt_br: Copia os bits de permissão, hora do último acesso, hora da última modificação e sinalizadores de *src* para *dst*. No Linux, :func:`copystat` também copia os "atributos estendidos" sempre que possível. O conteúdo do arquivo, o proprietário e o grupo não são afetados. *src* e *dst* são :term:`objetos caminho ou similares <path-like object>` ou nomes de caminhos dados como strings.

source: If *follow_symlinks* is false, and *src* and *dst* both refer to symbolic links, :func:`copystat` will operate on the symbolic links themselves rather than the files the symbolic links refer to—reading the information from the *src* symbolic link, and writing the information to the *dst* symbolic link.
pt_br: Se *follow_symlinks* for falso e *src* e *dst* se referirem a links simbólicos, :func:`copystat` operará nos próprios links simbólicos, e não nos arquivos aos quais os links simbólicos se referem - lendo as informações do link simbólico *src* e gravando as informações no link simbólico *dst*.

source: Not all platforms provide the ability to examine and modify symbolic links. Python itself can tell you what functionality is locally available.
pt_br: Nem todas as plataformas oferecem a capacidade de examinar e modificar links simbólicos. O próprio Python pode dizer qual funcionalidade está disponível localmente.

source: If ``os.chmod in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the permission bits of a symbolic link.
pt_br: Se ``os.chmod in os.supports_follow_symlinks`` for ``True``, :func:`copystat` pode modificar os bits de permissão de um link simbólico.

source: If ``os.utime in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the last access and modification times of a symbolic link.
pt_br: Se ``os.utime in os.supports_follow_symlinks`` for ``True``, :func:`copystat` pode modificar as horas da última modificação e do último acesso de um link simbólico.

source: If ``os.chflags in os.supports_follow_symlinks`` is ``True``, :func:`copystat` can modify the flags of a symbolic link. (``os.chflags`` is not available on all platforms.)
pt_br: Se ``os.chflags in os.supports_follow_symlinks`` for ``True``, :func:`copystat` pode modificar os sinalizadores de um link simbólico. (``os.chflags`` não está disponível em todas as plataformas.)

source: On platforms where some or all of this functionality is unavailable, when asked to modify a symbolic link, :func:`copystat` will copy everything it can. :func:`copystat` never returns failure.
pt_br: Nas plataformas em que algumas ou todas essas funcionalidades não estão disponíveis, quando solicitado a modificar um link simbólico, :func:`copystat` copiará tudo o que puder. :func:`copystat` nunca retorna falha.

source: Please see :data:`os.supports_follow_symlinks` for more information.
pt_br: Por favor, veja :data:`os.supports_follow_symlinks` para mais informações.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copystat`` with arguments ``src``, ``dst``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copystat`` com os argumentos ``src``, ``dst``.

source: Added *follow_symlinks* argument and support for Linux extended attributes.
pt_br: Adicionado argumento *follow_symlinks* e suporte a atributos estendidos do Linux.

source: Copies the file *src* to the file or directory *dst*. *src* and *dst* should be :term:`path-like objects <path-like object>` or strings. If *dst* specifies a directory, the file will be copied into *dst* using the base filename from *src*. If *dst* specifies a file that already exists, it will be replaced. Returns the path to the newly created file.
pt_br: Copia o arquivo *src* para o arquivo ou diretório *dst*. *src* e *dst* devem ser :term:`objetos arquivo ou similares <path-like object>` ou strings. Se *dst* especificar um diretório, o arquivo será copiado para *dst* usando o nome de arquivo base de *src*. Se *dst* especifica um arquivo que já existe, ele será substituído. Retorna o caminho para o arquivo recém-criado.

source: If *follow_symlinks* is false, and *src* is a symbolic link, *dst* will be created as a symbolic link. If *follow_symlinks* is true and *src* is a symbolic link, *dst* will be a copy of the file *src* refers to.
pt_br: Se *follow_symlinks* for falso e *src* for um link simbólico, *dst* será criado como um link simbólico. Se *follow_symlinks* for verdadeiro e *src* for um link simbólico, *dst* será uma cópia do arquivo ao qual *src* se refere.

source: :func:`~shutil.copy` copies the file data and the file's permission mode (see :func:`os.chmod`). Other metadata, like the file's creation and modification times, is not preserved. To preserve all file metadata from the original, use :func:`~shutil.copy2` instead.
pt_br: :func:`~shutil.copy` copia os dados do arquivo e o modo de permissão do arquivo (consulte :func:`os.chmod`). Outros metadados, como os tempos de criação e modificação do arquivo, não são preservados. Para preservar todos os metadados do arquivo do original, use :func:`~shutil.copy2`.

source: Added *follow_symlinks* argument. Now returns path to the newly created file.
pt_br: Adicionado argumento *follow_symlinks*. Agora retorna o caminho para o arquivo recém-criado.

source: Identical to :func:`~shutil.copy` except that :func:`copy2` also attempts to preserve file metadata.
pt_br: Idêntico a :func:`~shutil.copy`, exceto que :func:`copy2` também tenta preservar os metadados do arquivo.

source: When *follow_symlinks* is false, and *src* is a symbolic link, :func:`copy2` attempts to copy all metadata from the *src* symbolic link to the newly created *dst* symbolic link. However, this functionality is not available on all platforms. On platforms where some or all of this functionality is unavailable, :func:`copy2` will preserve all the metadata it can; :func:`copy2` never raises an exception because it cannot preserve file metadata.
pt_br: Quando *follow_symlinks* for falso e *src* for um link simbólico, :func:`copy2` tenta copiar todos os metadados do link simbólico *src* para o link simbólico *dst* recém-criado. No entanto, essa funcionalidade não está disponível em todas as plataformas. Nas plataformas em que algumas ou todas essas funcionalidades não estão disponíveis, :func:`copy2` preservará todos os metadados que puder; :func:`copy2` nunca levanta uma exceção porque não pode preservar os metadados do arquivo.

source: :func:`copy2` uses :func:`copystat` to copy the file metadata. Please see :func:`copystat` for more information about platform support for modifying symbolic link metadata.
pt_br: :func:`copy2` usa :func:`copystat` para copiar os metadados do arquivo. Por favor, veja :func:`copystat` para obter mais informações sobre o suporte da plataforma para modificar os metadados do link simbólico.

source: Added *follow_symlinks* argument, try to copy extended file system attributes too (currently Linux only). Now returns path to the newly created file.
pt_br: Adicionado argumento *follow_symlinks*, tenta copiar também atributos estendidos do sistema de arquivos (atualmente apenas no Linux). Agora retorna o caminho para o arquivo recém-criado.

source: This factory function creates a function that can be used as a callable for :func:`copytree`\'s *ignore* argument, ignoring files and directories that match one of the glob-style *patterns* provided. See the example below.
pt_br: Esta função de fábrica cria uma função que pode ser usada como um chamável para o argumento *ignore* de :func:`copytree`, ignorando arquivos e diretórios que correspondem a um dos padrões *patterns* de estilo glob fornecidos. Veja o exemplo abaixo.

source: Recursively copy an entire directory tree rooted at *src* to a directory named *dst* and return the destination directory. All intermediate directories needed to contain *dst* will also be created by default.
pt_br: Copia recursivamente uma árvore de diretórios inteira com raiz em *src* para um diretório chamado *dst* e retorna o diretório de destino. Todos os diretórios intermediários necessários para conter *dst* também serão criados por padrão.

source: Permissions and times of directories are copied with :func:`copystat`, individual files are copied using :func:`~shutil.copy2`.
pt_br: Permissões e horas dos diretórios são copiados com :func:`copystat`, arquivos individuais são copiados usando :func:`~shutil.copy2`.

source: If *symlinks* is true, symbolic links in the source tree are represented as symbolic links in the new tree and the metadata of the original links will be copied as far as the platform allows; if false or omitted, the contents and metadata of the linked files are copied to the new tree.
pt_br: Se *symlinks* for verdadeiro, os links simbólicos na árvore de origem são representados como links simbólicos na nova árvore e os metadados dos links originais serão copiados na medida do permitido pela plataforma; se falso ou omitido, o conteúdo e os metadados dos arquivos vinculados são copiados para a nova árvore.

source: When *symlinks* is false, if the file pointed to by the symlink doesn't exist, an exception will be added in the list of errors raised in an :exc:`Error` exception at the end of the copy process. You can set the optional *ignore_dangling_symlinks* flag to true if you want to silence this exception. Notice that this option has no effect on platforms that don't support :func:`os.symlink`.
pt_br: Quando *symlinks* for falso, se o arquivo apontado pelo link simbólico não existir, uma exceção será adicionada na lista de erros levantada em uma exceção :exc:`Error` no final do processo de cópia. Você pode definir o sinalizador opcional *ignore_dangling_symlinks* como true se desejar silenciar esta exceção. Observe que esta opção não tem efeito em plataformas que não possuem suporte a :func:`os.symlink`.

source: If *ignore* is given, it must be a callable that will receive as its arguments the directory being visited by :func:`copytree`, and a list of its contents, as returned by :func:`os.listdir`. Since :func:`copytree` is called recursively, the *ignore* callable will be called once for each directory that is copied. The callable must return a sequence of directory and file names relative to the current directory (i.e. a subset of the items in its second argument); these names will then be ignored in the copy process. :func:`ignore_patterns` can be used to create such a callable that ignores names based on glob-style patterns.
pt_br: Se *ignore* for fornecido, deve ser um chamável que receberá como argumento o diretório que está sendo visitado por :func:`copytree`, e uma lista de seu conteúdo, retornada por :func:`os.listdir`. Como :func:`copytree` é chamada recursivamente, o chamável *ignore* será chamado uma vez para cada diretório que é copiado. O chamável deve retornar uma sequência de nomes de diretório e arquivo em relação ao diretório atual (ou seja, um subconjunto dos itens em seu segundo argumento); esses nomes serão ignorados no processo de cópia. :func:`ignore_patterns` pode ser usado para criar um chamável que ignore nomes com base em padrões de estilo glob.

source: If exception(s) occur, an :exc:`Error` is raised with a list of reasons.
pt_br: Se uma ou mais exceções ocorrerem, uma :exc:`Error` é levantada com uma lista dos motivos.

source: If *copy_function* is given, it must be a callable that will be used to copy each file. It will be called with the source path and the destination path as arguments. By default, :func:`~shutil.copy2` is used, but any function that supports the same signature (like :func:`~shutil.copy`) can be used.
pt_br: Se *copy_function* for fornecida, deverá ser um chamável que será usado para copiar cada arquivo. Ele será chamado com o caminho de origem e o caminho de destino como argumentos. Por padrão, :func:`~shutil.copy2` é usada, mas qualquer função que possua suporte à mesma assinatura (como :func:`~shutil.copy`) pode ser usada.

source: If *dirs_exist_ok* is false (the default) and *dst* already exists, a :exc:`FileExistsError` is raised. If *dirs_exist_ok* is true, the copying operation will continue if it encounters existing directories, and files within the *dst* tree will be overwritten by corresponding files from the *src* tree.
pt_br: Se *dirs_exist_ok* for false (o padrão) e *dst* já existir, uma :exc:`FileExistsError` será levantada. Se *dirs_exist_ok* for true, a operação de cópia continuará se encontrar diretórios existentes, e os arquivos dentro da árvore *dst* serão sobrescritos pelos arquivos correspondentes da árvore *src*.

source: Raises an :ref:`auditing event <auditing>` ``shutil.copytree`` with arguments ``src``, ``dst``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``shutil.copytree`` com os argumentos ``src``, ``dst``.

source: Added the *copy_function* argument to be able to provide a custom copy function. Added the *ignore_dangling_symlinks* argument to silence dangling symlinks errors when *symlinks* is false.
pt_br: Adicionado o argumento *copy_function* para poder fornecer uma função de cópia personalizada. Adicionado o argumento *ignore_dangling_symlinks* para silenciar erros de links simbólicos quando *symlinks* for falso.

source: Copy metadata when *symlinks* is false. Now returns *dst*.
pt_br: Copia metadados quando *symlinks* for falso. Agora, retorna *dst*.

source: Added the *dirs_exist_ok* parameter.
pt_br: Adicionado o parâmetro *dirs_exist_ok*.

source: Delete an entire directory tree; *path* must point to a directory (but not a symbolic link to a directory). If *ignore_errors* is true, errors resulting from failed removals will be ignored; if false or omitted, such errors are handled by calling a handler specified by *onexc* or *onerror* or, if both are omitted, exceptions are propagated to the caller.
pt_br: Exclui uma árvore de diretório inteira; *path* deve apontar para um diretório (mas não um link simbólico para um diretório). Se *ignore_errors* for verdadeiro, os erros resultantes de remoções com falha serão ignorados; se falso ou omitido, tais erros são tratados chamando um manipulador especificado por *onexc* ou *onerror* ou, se ambos forem omitidos, exceções são propagadas para o chamador.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>`.
pt_br: Esta função tem suporte a :ref:`caminhos relativos para descritores de diretório <dir_fd>`.

source: On platforms that support the necessary fd-based functions a symlink attack resistant version of :func:`rmtree` is used by default. On other platforms, the :func:`rmtree` implementation is susceptible to a symlink attack: given proper timing and circumstances, attackers can manipulate symlinks on the filesystem to delete files they wouldn't be able to access otherwise. Applications can use the :data:`rmtree.avoids_symlink_attacks` function attribute to determine which case applies.
pt_br: Em plataformas que suportam as funções baseadas em descritores de arquivo necessárias, uma versão resistente a ataques de links simbólicos de :func:`rmtree` é usada por padrão. Em outras plataformas, a implementação :func:`rmtree` é suscetível a um ataque de link simbólico: dados o tempo e as circunstâncias apropriados, os invasores podem manipular links simbólicos no sistema de arquivos para excluir arquivos que eles não seriam capazes de acessar de outra forma. Os aplicativos podem usar o atributo de função :data:`rmtree.avoids_symlink_attacks` para determinar qual caso se aplica.

source: If *onexc* is provided, it must be a callable that accepts three parameters: *function*, *path*, and *excinfo*.
pt_br: Se *onexc* for fornecido, deve ser um chamável que aceite três parâmetros: *function*, *path*, e *excinfo*.
