Repository: python/python-docs-pt-br
Catalog: library/signal.po
Languages: pt_br

source: *mask* is a set of signal numbers (e.g. {:const:`signal.SIGINT`, :const:`signal.SIGTERM`}). Use :func:`~signal.valid_signals` for a full mask including all signals.
pt_br: *mask* é um conjunto de números de sinais (ex.: {:const:`signal.SIGINT`, :const:`signal.SIGTERM`}). Use :func:`~signal.valid_signals` para uma máscara completa, incluindo todos os sinais.

source: For example, ``signal.pthread_sigmask(signal.SIG_BLOCK, [])`` reads the signal mask of the calling thread.
pt_br: Por exemplo, ``signal.pthread_sigmask(signal.SIG_BLOCK, [])`` lê a máscara de sinal da thread de chamada.

source: :data:`SIGKILL` and :data:`SIGSTOP` cannot be blocked.
pt_br: :data:`SIGKILL` e :data:`SIGSTOP` não podem ser bloqueados.

source: See also :func:`pause`, :func:`sigpending` and :func:`sigwait`.
pt_br: Veja também :func:`pause`, :func:`sigpending` e :func:`sigwait`.

source: Sets given interval timer (one of :const:`signal.ITIMER_REAL`, :const:`signal.ITIMER_VIRTUAL` or :const:`signal.ITIMER_PROF`) specified by *which* to fire after *seconds* (float is accepted, different from :func:`alarm`) and after that every *interval* seconds (if *interval* is non-zero). The interval timer specified by *which* can be cleared by setting *seconds* to zero.
pt_br: Define o temporizador de intervalo fornecido (um dos seguintes: :const:`signal.ITIMER_REAL`, :const:`signal.ITIMER_VIRTUAL` ou :const:`signal.ITIMER_PROF`) especificado por *which* para disparar após *seconds* (float é aceito, diferente de :func:`alarm`) e, depois disso, a cada *interval* segundos (se *interval* for diferente de zero). O temporizador de intervalo especificado por *which* pode ser zerado definindo *seconds* como zero.

source: When an interval timer fires, a signal is sent to the process. The signal sent is dependent on the timer being used; :const:`signal.ITIMER_REAL` will deliver :const:`SIGALRM`, :const:`signal.ITIMER_VIRTUAL` sends :const:`SIGVTALRM`, and :const:`signal.ITIMER_PROF` will deliver :const:`SIGPROF`.
pt_br: Quando um temporizador de intervalo dispara, um sinal é enviado ao processo. O sinal enviado depende do temporizador utilizado; :const:`signal.ITIMER_REAL` enviará :const:`SIGALRM`, :const:`signal.ITIMER_VIRTUAL` enviará :const:`SIGVTALRM` e :const:`signal.ITIMER_PROF` enviará :const:`SIGPROF`.

source: The old values are returned as a tuple: (delay, interval).
pt_br: Os valores antigos são retornados como uma tupla: (atraso, intervalo).

source: Attempting to pass an invalid interval timer will cause an :exc:`ItimerError`.
pt_br: Tentar passar um intervalo de tempo inválido causará uma :exc:`ItimerError`.

source: Returns current value of a given interval timer specified by *which*.
pt_br: Retorna o valor atual de um intervalo de tempo especificado por *which*.

source: Set the wakeup file descriptor to *fd*. When a signal your program has registered a signal handler for is received, the signal number is written as a single byte into the fd. If you haven't registered a signal handler for the signals you care about, then nothing will be written to the wakeup fd. This can be used by a library to wakeup a poll or select call, allowing the signal to be fully processed.
pt_br: Define o descritor de arquivo de ativação como *fd*. Quando um sinal para o qual seu programa registrou um manipulador de sinais é recebido, o número do sinal é escrito como um único byte no fd. Se você não registrou um manipulador de sinais para os sinais de seu interesse, nada será escrito no fd de ativação. Isso pode ser usado por uma biblioteca para ativar uma chamada de poll ou seleção, permitindo que o sinal seja totalmente processado.

source: The old wakeup fd is returned (or -1 if file descriptor wakeup was not enabled). If *fd* is -1, file descriptor wakeup is disabled. If not -1, *fd* must be non-blocking. It is up to the library to remove any bytes from *fd* before calling poll or select again.
pt_br: O antigo fd de ativação é retornado (ou -1 se a ativação do descritor de arquivo não estava habilitada). Se *fd* for -1, a ativação do descritor de arquivo está desabilitada. Se não for -1, *fd* deve ser não bloqueante. Cabe à biblioteca remover quaisquer bytes de *fd* antes de chamar poll ou select novamente.

source: When threads are enabled, this function can only be called from :ref:`the main thread of the main interpreter <signals-and-threads>`; attempting to call it from other threads will cause a :exc:`ValueError` exception to be raised.
pt_br: Quando threads estão habilitadas, esta função só pode ser chamada da :ref:`thread principal do interpretador principal <signals-and-threads>`; tentar chamá-la de outras threads levantará uma exceção :exc:`ValueError`.

source: There are two common ways to use this function. In both approaches, you use the fd to wake up when a signal arrives, but then they differ in how they determine *which* signal or signals have arrived.
pt_br: Há duas maneiras comuns de usar esta função. Em ambas as abordagens, você usa o fd para despertar quando um sinal chega, mas elas diferem na forma como determinam *which* sinal ou sinais chegaram.

source: In the first approach, we read the data out of the fd's buffer, and the byte values give you the signal numbers. This is simple, but in rare cases it can run into a problem: generally the fd will have a limited amount of buffer space, and if too many signals arrive too quickly, then the buffer may become full, and some signals may be lost. If you use this approach, then you should set ``warn_on_full_buffer=True``, which will at least cause a warning to be printed to stderr when signals are lost.
pt_br: Na primeira abordagem, lemos os dados do buffer do fd, e os valores dos bytes fornecem os números dos sinais. Isso é simples, mas em casos raros pode apresentar um problema: geralmente, o fd terá um espaço de buffer limitado e, se muitos sinais chegarem muito rápido, o buffer pode ficar cheio e alguns sinais podem ser perdidos. Se você usar essa abordagem, defina ``warn_on_full_buffer=True``, o que pelo menos fará com que um aviso seja impresso no stderr quando os sinais forem perdidos.

source: In the second approach, we use the wakeup fd *only* for wakeups, and ignore the actual byte values. In this case, all we care about is whether the fd's buffer is empty or non-empty; a full buffer doesn't indicate a problem at all. If you use this approach, then you should set ``warn_on_full_buffer=False``, so that your users are not confused by spurious warning messages.
pt_br: Na segunda abordagem, usamos o fd de ativação *apenas* para ativações e ignoramos os valores de bytes reais. Nesse caso, tudo o que importa é se o buffer do fd está vazio ou não; um buffer cheio não indica nenhum problema. Se você usar essa abordagem, defina ``warn_on_full_buffer=False`` para que seus usuários não sejam confundidos por mensagens de aviso falsas.

source: On Windows, the function now also supports socket handles.
pt_br: No Windows, a função agora também suporta manipuladores de socket.

source: Added ``warn_on_full_buffer`` parameter.
pt_br: Adiciona o parâmetro ``warn_on_full_buffer``.

source: Change system call restart behaviour: if *flag* is :const:`False`, system calls will be restarted when interrupted by signal *signalnum*, otherwise system calls will be interrupted. Returns nothing.
pt_br: Altera o comportamento de reinicialização de chamadas de sistema: se *flag* for :const:`False`, as chamadas de sistema serão reiniciadas quando interrompidas pelo sinal *signalnum*; caso contrário, as chamadas de sistema serão interrompidas. Não retorna nada.

source: See the man page :manpage:`siginterrupt(3)` for further information.
pt_br: Veja a página man :manpage:`siginterrupt(3)` para mais informações.

source: Note that installing a signal handler with :func:`signal` will reset the restart behaviour to interruptible by implicitly calling :c:func:`!siginterrupt` with a true *flag* value for the given signal.
pt_br: Observe que a instalação de um manipulador de sinal com :func:`signal` redefinirá o comportamento de reinicialização para interrompível ao chamar implicitamente :c:func:`!siginterrupt` com *flag* contendo valor verdadeiro para o sinal fornecido.

source: Set the handler for signal *signalnum* to the function *handler*. *handler* can be a callable Python object taking two arguments (see below), or one of the special values :const:`signal.SIG_IGN` or :const:`signal.SIG_DFL`. The previous signal handler will be returned (see the description of :func:`getsignal` above). (See the Unix man page :manpage:`signal(2)` for further information.)
pt_br: Define o manipulador do sinal *signalnum* para a função *handler*. *handler* pode ser um objeto Python invocável que recebe dois argumentos (veja abaixo), ou um dos valores especiais :const:`signal.SIG_IGN` ou :const:`signal.SIG_DFL`. O manipulador de sinal anterior será retornado (veja a descrição de :func:`getsignal` acima). (Consulte a página man do Unix :manpage:`signal(2)` para mais informações.)

source: The *handler* is called with two arguments: the signal number and the current stack frame (``None`` or a frame object; for a description of frame objects, see the :ref:`description in the type hierarchy <frame-objects>` or see the attribute descriptions in the :mod:`inspect` module).
pt_br: O *handler* é chamado com dois argumentos: o número do sinal e o quadro de pilha atual (``None`` ou um objeto quadro; para uma descrição dos objetos quadro, consulte a :ref:`descrição na hierarquia de tipo <frame-objects>` ou consulte as descrições de atributo no módulo :mod:`inspect`).

source: On Windows, :func:`signal` can only be called with :const:`SIGABRT`, :const:`SIGFPE`, :const:`SIGILL`, :const:`SIGINT`, :const:`SIGSEGV`, :const:`SIGTERM`, or :const:`SIGBREAK`. A :exc:`ValueError` will be raised in any other case. Note that not all systems define the same set of signal names; an :exc:`AttributeError` will be raised if a signal name is not defined as ``SIG*`` module level constant.
pt_br: No Windows, :func:`signal` só pode ser chamado com :const:`SIGABRT`, :const:`SIGFPE`, :const:`SIGILL`, :const:`SIGINT`, :const:`SIGSEGV`, :const:`SIGTERM` ou :const:`SIGBREAK`. Uma exceção :exc:`ValueError` será levantada em qualquer outro caso. Observe que nem todos os sistemas definem o mesmo conjunto de nomes de sinais; uma exceção :exc:`AttributeError` será levantada se um nome de sinal não for definido como constante de nível de módulo ``SIG*``.

source: Examine the set of signals that are pending for delivery to the calling thread (i.e., the signals which have been raised while blocked). Return the set of the pending signals.
pt_br: Examine o conjunto de sinais pendentes para entrega ao thread de chamada (ou seja, os sinais que foram gerados enquanto bloqueados). Retorne o conjunto de sinais pendentes.

source: See the man page :manpage:`sigpending(2)` for further information.
pt_br: Veja a página man :manpage:`sigpending(2)` para mais informações.

source: See also :func:`pause`, :func:`pthread_sigmask` and :func:`sigwait`.
pt_br: Veja também :func:`pause`, :func:`pthread_sigmask` e :func:`sigwait`.

source: Suspend execution of the calling thread until the delivery of one of the signals specified in the signal set *sigset*. The function accepts the signal (removes it from the pending list of signals), and returns the signal number.
pt_br: Suspende a execução do thread de chamada até a entrega de um dos sinais especificados no conjunto de sinais *sigset*. A função aceita o sinal (remove-o da lista de sinais pendentes) e retorna o número do sinal.

source: See the man page :manpage:`sigwait(3)` for further information.
pt_br: Veja a página man :manpage:`sigwait(3)` para mais informações.

source: See also :func:`pause`, :func:`pthread_sigmask`, :func:`sigpending`, :func:`sigwaitinfo` and :func:`sigtimedwait`.
pt_br: Veja também :func:`pause`, :func:`pthread_sigmask`, :func:`sigpending`, :func:`sigwaitinfo` e :func:`sigtimedwait`.

source: Suspend execution of the calling thread until the delivery of one of the signals specified in the signal set *sigset*. The function accepts the signal and removes it from the pending list of signals. If one of the signals in *sigset* is already pending for the calling thread, the function will return immediately with information about that signal. The signal handler is not called for the delivered signal. The function raises an :exc:`InterruptedError` if it is interrupted by a signal that is not in *sigset*.
pt_br: Suspende a execução da thread chamadora até a entrega de um dos sinais especificados no conjunto de sinais *sigset*. A função aceita o sinal e o remove da lista de sinais pendentes. Se um dos sinais em *sigset* já estiver pendente para a thread chamadora, a função retornará imediatamente com informações sobre esse sinal. O manipulador de sinais não é chamado para o sinal entregue. A função levanta :exc:`InterruptedError` se for interrompida por um sinal que não esteja em *sigset*.

source: The return value is an object representing the data contained in the :c:type:`siginfo_t` structure, namely: :attr:`si_signo`, :attr:`si_code`, :attr:`si_errno`, :attr:`si_pid`, :attr:`si_uid`, :attr:`si_status`, :attr:`si_band`.
pt_br: O valor de retorno é um objeto que representa os dados contidos na estrutura de :c:type:`siginfo_t`, a saber: :attr:`si_signo`, :attr:`si_code`, :attr:`si_errno`, :attr:`si_pid`, :attr:`si_uid`, :attr:`si_status`, :attr:`si_band`.

source: See the man page :manpage:`sigwaitinfo(2)` for further information.
pt_br: Veja a página man :manpage:`sigwaitinfo(2)` para mais informações.

source: See also :func:`pause`, :func:`sigwait` and :func:`sigtimedwait`.
pt_br: Veja também :func:`pause`, :func:`sigwait` e :func:`sigtimedwait`.

source: The function is now retried if interrupted by a signal not in *sigset* and the signal handler does not raise an exception (see :pep:`475` for the rationale).
pt_br: A função agora é tentada novamente se interrompida por um sinal que não esteja em *sigset* e o manipulador de sinal não levanta uma exceção (veja :pep:`475` para a justificativa).

source: Like :func:`sigwaitinfo`, but takes an additional *timeout* argument specifying a timeout. If *timeout* is specified as ``0``, a poll is performed. Returns :const:`None` if a timeout occurs.
pt_br: Semelhante a :func:`sigwaitinfo`, mas recebe um argumento *timeout* adicional que especifica um tempo limite. Se *timeout* for especificado como ``0``, uma consulta será realizada. Retorna :const:`None` se ocorrer um tempo limite.

source: See the man page :manpage:`sigtimedwait(2)` for further information.
pt_br: Veja a página man :manpage:`sigtimedwait(2)` para mais informações.

source: See also :func:`pause`, :func:`sigwait` and :func:`sigwaitinfo`.
pt_br: Veja também :func:`pause`, :func:`sigwait` e :func:`sigwaitinfo`.

source: The function is now retried with the recomputed *timeout* if interrupted by a signal not in *sigset* and the signal handler does not raise an exception (see :pep:`475` for the rationale).
pt_br: A função agora é tentada novamente com o *timeout* recalculado se interrompida por um sinal que não esteja em *sigset* e o manipulador de sinal não levanta uma exceção (veja :pep:`475` para a justificativa).

source: Examples
pt_br: Exemplos

source: Here is a minimal example program. It uses the :func:`alarm` function to limit the time spent waiting to open a file; this is useful if the file is for a serial device that may not be turned on, which would normally cause the :func:`os.open` to hang indefinitely. The solution is to set a 5-second alarm before opening the file; if the operation takes too long, the alarm signal will be sent, and the handler raises an exception. ::
pt_br: Aqui está um programa de exemplo mínimo. Ele usa a função :func:`alarm` para limitar o tempo gasto esperando para abrir um arquivo; isso é útil se o arquivo for para um dispositivo serial que pode não estar ligado, o que normalmente faria com que o :func:`os.open` travasse indefinidamente. A solução é definir um alarme de 5 segundos antes de abrir o arquivo; se a operação demorar muito, o sinal de alarme será enviado e o manipulador levantará uma exceção. ::

source: import signal, os def handler(signum, frame): signame = signal.Signals(signum).name print(f'Signal handler called with signal {signame} ({signum})') raise OSError("Couldn't open device!") # Set the signal handler and a 5-second alarm signal.signal(signal.SIGALRM, handler) signal.alarm(5) # This open() may hang indefinitely fd = os.open('/dev/ttyS0', os.O_RDWR) signal.alarm(0) # Disable the alarm
pt_br: import signal, os def handler(signum, frame): signame = signal.Signals(signum).name print(f'Signal handler called with signal {signame} ({signum})') raise OSError("Couldn't open device!") # Define o manipulador de sinal e um alarme de 5 segundos signal.signal(signal.SIGALRM, handler) signal.alarm(5) # Este open() pode travar indefinidamente fd = os.open('/dev/ttyS0', os.O_RDWR) signal.alarm(0) # Desabilita o alarme

source: Note on SIGPIPE
pt_br: Nota sobre SIGPIPE

source: Piping output of your program to tools like :manpage:`head(1)` will cause a :const:`SIGPIPE` signal to be sent to your process when the receiver of its standard output closes early. This results in an exception like :code:`BrokenPipeError: [Errno 32] Broken pipe`. To handle this case, wrap your entry point to catch this exception as follows::
pt_br: Canalizar a saída do seu programa para ferramentas como :manpage:`head(1)` fará com que um sinal :const:`SIGPIPE` seja enviado ao seu processo quando o receptor da saída padrão fechar antes do tempo. Isso resulta em uma exceção como :code:`BrokenPipeError: [Errno 32] Broken pipe`. Para lidar com esse caso, envolva seu ponto de entrada para capturar essa exceção da seguinte maneira:

source: import os import sys def main(): try: # simulate large output (your code replaces this loop) for x in range(10000): print("y") # flush output here to force SIGPIPE to be triggered # while inside this try block. sys.stdout.flush() except BrokenPipeError: # Python flushes standard streams on exit; redirect remaining output # to devnull to avoid another BrokenPipeError at shutdown devnull = os.open(os.devnull, os.O_WRONLY) os.dup2(devnull, sys.stdout.fileno()) sys.exit(1) # Python exits with error code 1 on EPIPE if __name__ == '__main__': main()
pt_br: import os import sys def main(): try: # simula uma saída grande (seu código substitui este loop) for x in range(10000): print("y") # limpa a saída aqui para forçar o acionamento do SIGPIPE # enquanto estiver dentro deste bloco try. sys.stdout.flush() except BrokenPipeError: # Python libera fluxos padrão na saída; redireciona a saída restante # para devnull para evitar outro BrokenPipeError no desligamento devnull = os.open(os.devnull, os.O_WRONLY) os.dup2(devnull, sys.stdout.fileno()) sys.exit(1) # Python exits with error code 1 on EPIPE if __name__ == '__main__': main()

source: Do not set :const:`SIGPIPE`'s disposition to :const:`SIG_DFL` in order to avoid :exc:`BrokenPipeError`. Doing that would cause your program to exit unexpectedly whenever any socket connection is interrupted while your program is still writing to it.
pt_br: Não defina a disposição de :const:`SIGPIPE` como :const:`SIG_DFL` para evitar :exc:`BrokenPipeError`. Isso faria com que seu programa encerrasse inesperadamente sempre que qualquer conexão de soquete fosse interrompida enquanto o programa ainda estivesse escrevendo nele.

source: Note on Signal Handlers and Exceptions
pt_br: Nota sobre manipuladores de sinais e exceções

source: If a signal handler raises an exception, the exception will be propagated to the main thread and may be raised after any :term:`bytecode` instruction. Most notably, a :exc:`KeyboardInterrupt` may appear at any point during execution. Most Python code, including the standard library, cannot be made robust against this, and so a :exc:`KeyboardInterrupt` (or any other exception resulting from a signal handler) may on rare occasions put the program in an unexpected state.
pt_br: Se um manipulador de sinais levantar uma exceção, a exceção será propagada para a thread principal e poderá ser levantada após qualquer instrução :term:`bytecode`. Mais notavelmente, uma :exc:`KeyboardInterrupt` pode aparecer a qualquer momento durante a execução. A maioria dos códigos Python, incluindo a biblioteca padrão, não pode ser robusta contra isso, e, portanto, uma :exc:`KeyboardInterrupt` (ou qualquer outra exceção resultante de um manipulador de sinais) pode, em raras ocasiões, colocar o programa em um estado inesperado.

source: To illustrate this issue, consider the following code::
pt_br: Para ilustrar esse problema, considere o seguinte código:

source: class SpamContext: def __init__(self): self.lock = threading.Lock() def __enter__(self): # If KeyboardInterrupt occurs here, everything is fine self.lock.acquire() # If KeyboardInterrupt occurs here, __exit__ will not be called ... # KeyboardInterrupt could occur just before the function returns def __exit__(self, exc_type, exc_val, exc_tb): ... self.lock.release()
pt_br: class SpamContext: def __init__(self): self.lock = threading.Lock() def __enter__(self): # Se ocorrer KeyboardInterrupt aqui, está tudo bem self.lock.acquire() # Se KeyboardInterrupt ocorrer aqui, __exit__ não será chamado ... # KeyboardInterrupt pode ocorrer logo antes do retorno da função def __exit__(self, exc_type, exc_val, exc_tb): ... self.lock.release()

source: For many programs, especially those that merely want to exit on :exc:`KeyboardInterrupt`, this is not a problem, but applications that are complex or require high reliability should avoid raising exceptions from signal handlers. They should also avoid catching :exc:`KeyboardInterrupt` as a means of gracefully shutting down. Instead, they should install their own :const:`SIGINT` handler. Below is an example of an HTTP server that avoids :exc:`KeyboardInterrupt`::
pt_br: Para muitos programas, especialmente aqueles que simplesmente desejam encerrar em :exc:`KeyboardInterrupt`, isso não é um problema, mas aplicações complexos ou que exigem alta confiabilidade devem evitar levantar exceções de manipuladores de sinal. Eles também devem evitar capturar :exc:`KeyboardInterrupt` como forma de encerrar o programa sem problemas. Em vez disso, devem instalar seu próprio manipulador :const:`SIGINT`. Abaixo está um exemplo de um servidor HTTP que evita :exc:`KeyboardInterrupt`::
