Repository: python/python-docs-pt-br
Catalog: library/signal.po
Languages: pt_br

source: :mod:`!signal` --- Set handlers for asynchronous events
pt_br: :mod:`!signal` --- Define manipuladores para eventos assíncronos

source: **Source code:** :source:`Lib/signal.py`
pt_br: **Código-fonte:** :source:`Lib/signal.py`

source: This module provides mechanisms to use signal handlers in Python.
pt_br: Este módulo fornece mecanismos para usar manipuladores de sinal em Python.

source: General rules
pt_br: Regras gerais

source: The :func:`signal.signal` function allows defining custom handlers to be executed when a signal is received. A small number of default handlers are installed: :const:`SIGPIPE` is ignored (so write errors on pipes and sockets can be reported as ordinary Python exceptions) and :const:`SIGINT` is translated into a :exc:`KeyboardInterrupt` exception if the parent process has not changed it.
pt_br: A função :func:`signal.signal` permite definir manipuladores personalizados a serem executados quando um sinal é recebido. Um pequeno número de manipuladores padrão são instalados: :const:`SIGPIPE` é ignorado (então erros de gravação em encadeamentos e sockets podem ser relatados como exceções comuns do Python) e :const:`SIGINT` é traduzido em uma exceção :exc:`KeyboardInterrupt` se o processo pai não a tiver alterado.

source: A handler for a particular signal, once set, remains installed until it is explicitly reset (Python emulates the BSD style interface regardless of the underlying implementation), with the exception of the handler for :const:`SIGCHLD`, which follows the underlying implementation.
pt_br: Um manipulador para um sinal específico, uma vez definido, permanece instalado até ser explicitamente redefinido (o Python emula a interface de estilo BSD independentemente da implementação subjacente), com exceção do manipulador para :const:`SIGCHLD`, que segue a implementação subjacente.

source: On WebAssembly platforms, signals are emulated and therefore behave differently. Several functions and signals are not available on these platforms.
pt_br: Em plataformas WebAssembly, os sinais são emulados e, portanto, se comportam de forma diferente. Várias funções e sinais não estão disponíveis nessas plataformas.

source: Execution of Python signal handlers
pt_br: Execução de manipuladores de sinais Python

source: A Python signal handler does not get executed inside the low-level (C) signal handler. Instead, the low-level signal handler sets a flag which tells the :term:`virtual machine` to execute the corresponding Python signal handler at a later point(for example at the next :term:`bytecode` instruction). This has consequences:
pt_br: Um manipulador de sinal Python não é executado dentro do manipulador de sinal de baixo nível (C). Em vez disso, o manipulador de sinal de baixo nível define um sinalizador que diz à :term:`máquina virtual` para executar o manipulador de sinal Python correspondente em um ponto posterior (por exemplo, na próxima instrução :term:`bytecode`). Isso tem consequências:

source: It makes little sense to catch synchronous errors like :const:`SIGFPE` or :const:`SIGSEGV` that are caused by an invalid operation in C code. Python will return from the signal handler to the C code, which is likely to raise the same signal again, causing Python to apparently hang. From Python 3.3 onwards, you can use the :mod:`faulthandler` module to report on synchronous errors.
pt_br: Faz pouco sentido capturar erros síncronos como :const:`SIGFPE` ou :const:`SIGSEGV` que são causados por uma operação inválida no código C. O Python retornará do manipulador de sinais para o código C, o que provavelmente levantará o mesmo sinal novamente, fazendo com que o Python aparentemente trave. Do Python 3.3 em diante, você pode usar o módulo :mod:`faulthandler` para relatar erros síncronos.

source: A long-running calculation implemented purely in C (such as regular expression matching on a large body of text) may run uninterrupted for an arbitrary amount of time, regardless of any signals received. The Python signal handlers will be called when the calculation finishes.
pt_br: Um cálculo de longa duração implementado puramente em C (como correspondência de expressão regular em um grande corpo de texto) pode ser executado ininterruptamente por um período de tempo arbitrário, independentemente de quaisquer sinais recebidos. Os manipuladores de sinal do Python serão chamados quando o cálculo terminar.

source: If the handler raises an exception, it will be raised "out of thin air" in the main thread. See the :ref:`note below <handlers-and-exceptions>` for a discussion.
pt_br: Se o manipulador levantar uma exceção, ela será levantada "do nada" na thread principal. Veja a :ref:`nota abaixo <handlers-and-exceptions>` para uma discussão.

source: Signals and threads
pt_br: Sinais e threads

source: Python signal handlers are always executed in the main Python thread of the main interpreter, even if the signal was received in another thread. This means that signals can't be used as a means of inter-thread communication. You can use the synchronization primitives from the :mod:`threading` module instead.
pt_br: Os manipuladores de sinais Python são sempre executados na thread principal do Python do interpretador principal, mesmo se o sinal foi recebido em outra thread. Isso significa que os sinais não podem ser usados como um meio de comunicação entre threads. Você pode usar as primitivas de sincronização do módulo :mod:`threading` em vez disso.

source: Besides, only the main thread of the main interpreter is allowed to set a new signal handler.
pt_br: Além disso, somente a thread principal do interpretador principal tem permissão para definir um novo manipulador de sinal.

source: Module contents
pt_br: Conteúdo do módulo

source: signal (SIG*), handler (:const:`SIG_DFL`, :const:`SIG_IGN`) and sigmask (:const:`SIG_BLOCK`, :const:`SIG_UNBLOCK`, :const:`SIG_SETMASK`) related constants listed below were turned into :class:`enums <enum.IntEnum>` (:class:`Signals`, :class:`Handlers` and :class:`Sigmasks` respectively). :func:`getsignal`, :func:`pthread_sigmask`, :func:`sigpending` and :func:`sigwait` functions return human-readable :class:`enums <enum.IntEnum>` as :class:`Signals` objects.
pt_br: As constantes relacionadas a sinal (SIG*), manipulador (:const:`SIG_DFL`, :const:`SIG_IGN`) e sigmask (:const:`SIG_BLOCK`, :const:`SIG_UNBLOCK`, :const:`SIG_SETMASK`) listadas abaixo foram transformadas em :class:`enums <enum.IntEnum>` (:class:`Signals`, :class:`Handlers` e :class:`Sigmasks` respectivamente). As funções :func:`getsignal`, :func:`pthread_sigmask`, :func:`sigpending` e :func:`sigwait` retornam :class:`enums <enum.IntEnum>` legíveis por humanos como objetos :class:`Signals`.

source: The signal module defines three enums:
pt_br: O módulo de sinal define três enumerações:

source: :class:`enum.IntEnum` collection of SIG* constants and the CTRL_* constants.
pt_br: Coleção de :class:`enum.IntEnum` de constantes SIG* e constantes CTRL_*.

source: :class:`enum.IntEnum` collection the constants :const:`SIG_DFL` and :const:`SIG_IGN`.
pt_br: Coleção de :class:`enum.IntEnum` das constantes :const:`SIG_DFL` e :const:`SIG_IGN`.

source: :class:`enum.IntEnum` collection the constants :const:`SIG_BLOCK`, :const:`SIG_UNBLOCK` and :const:`SIG_SETMASK`.
pt_br: Coleção de :class:`enum.IntEnum` das constantes :const:`SIG_BLOCK`, :const:`SIG_UNBLOCK` e :const:`SIG_SETMASK`.

source: Availability
pt_br: Disponibilidade

source: See the man page :manpage:`sigprocmask(2)` and :manpage:`pthread_sigmask(3)` for further information.
pt_br: Veja a página man :manpage:`sigprocmask(2)` e :manpage:`pthread_sigmask(3)` para mais informações.

source: The variables defined in the :mod:`signal` module are:
pt_br: As variáveis definidas no módulo :mod:`signal` são:

source: This is one of two standard signal handling options; it will simply perform the default function for the signal. For example, on most systems the default action for :const:`SIGQUIT` is to dump core and exit, while the default action for :const:`SIGCHLD` is to simply ignore it.
pt_br: Esta é uma das duas opções de manipulação de sinal padrão; ela simplesmente executará a função padrão para o sinal. Por exemplo, na maioria dos sistemas, a ação padrão para :const:`SIGQUIT` é despejar o núcleo e sair, enquanto a ação padrão para :const:`SIGCHLD` é simplesmente ignorá-lo.

source: This is another standard signal handler, which will simply ignore the given signal.
pt_br: Este é outro manipulador de sinal padrão, que simplesmente ignorará o sinal fornecido.

source: Abort signal from :manpage:`abort(3)`.
pt_br: Sinal de abortar de :manpage:`abort(3)`.

source: Timer signal from :manpage:`alarm(2)`.
pt_br: Sinal do temporizador de :manpage:`alarm(2)`.

source: Interrupt from keyboard (CTRL + BREAK).
pt_br: Interrupção do teclado (CTRL + BREAK).

source: Bus error (bad memory access).
pt_br: Erro de barramento (acesso incorreto à memória).

source: Child process stopped or terminated.
pt_br: Processo filho interrompido ou encerrado.

source: Alias to :data:`SIGCHLD`.
pt_br: Apelido para :data:`SIGCHLD`.

source: Continue the process if it is currently stopped
pt_br: Continua o processo se ele estiver parado no momento

source: Floating-point exception. For example, division by zero.
pt_br: Exceção de ponto flutuante. Por exemplo, divisão por zero.

source: :exc:`ZeroDivisionError` is raised when the second argument of a division or modulo operation is zero.
pt_br: :exc:`ZeroDivisionError` é levatanda quando o segundo argumento de uma operação de divisão ou módulo é zero.

source: Hangup detected on controlling terminal or death of controlling process.
pt_br: Travamento detectado no terminal de controle ou morte do processo de controle.

source: Illegal instruction.
pt_br: Instrução ilegal.

source: Interrupt from keyboard (CTRL + C).
pt_br: Interrupção do teclado (CTRL + C).

source: Default action is to raise :exc:`KeyboardInterrupt`.
pt_br: A ação padrão é levantar :exc:`KeyboardInterrupt`.

source: Kill signal.
pt_br: Sinal de matar.

source: It cannot be caught, blocked, or ignored.
pt_br: Ele não pode ser capturado, bloqueado ou ignorado.

source: Broken pipe: write to pipe with no readers.
pt_br: Encadeamento quebrado: escreve no encadeamento sem leitores.

source: Default action is to ignore the signal.
pt_br: A ação padrão é ignorar o sinal.

source: Segmentation fault: invalid memory reference.
pt_br: Falha de segmentação: referência de memória inválida.

source: Stack fault on coprocessor. The Linux kernel does not raise this signal: it can only be raised in user space.
pt_br: Falha de pilha no coprocessador. O kernel Linux não levanta esse sinal: ele só pode ser emitido no espaço do usuário.

source: On architectures where the signal is available. See the man page :manpage:`signal(7)` for further information.
pt_br: Em arquiteturas onde o sinal está disponível. Veja a página man :manpage:`signal(7)` para mais informações.

source: Termination signal.
pt_br: Sinal de encerramento.

source: User-defined signal 1.
pt_br: Sinal definido pelo usuário 1.

source: User-defined signal 2.
pt_br: Sinal definido pelo usuário 2.

source: Window resize signal.
pt_br: Sinal de redimensionamento do Windows.

source: All the signal numbers are defined symbolically. For example, the hangup signal is defined as :const:`signal.SIGHUP`; the variable names are identical to the names used in C programs, as found in ``<signal.h>``. The Unix man page for ':c:func:`signal`' lists the existing signals (on some systems this is :manpage:`signal(2)`, on others the list is in :manpage:`signal(7)`). Note that not all systems define the same set of signal names; only those names defined by the system are defined by this module.
pt_br: Todos os números de sinal são definidos simbolicamente. Por exemplo, o sinal de desligamento é definido como :const:`signal.SIGHUP`; os nomes das variáveis ​​são idênticos aos usados ​​em programas C, como encontrados em ``<signal.h>``. A página man do Unix para ':c:func:`signal`' lista os sinais existentes (em alguns sistemas, é :manpage:`signal(2)`, em outros, a lista está em :manpage:`signal(7)`). Observe que nem todos os sistemas definem o mesmo conjunto de nomes de sinais; apenas os nomes definidos pelo sistema são definidos por este módulo.

source: The signal corresponding to the :kbd:`Ctrl+C` keystroke event. This signal can only be used with :func:`os.kill`.
pt_br: O sinal correspondente ao evento de pressionamento de tecla :kbd:`Ctrl+C`. Este sinal só pode ser usado com :func:`os.kill`.

source: The signal corresponding to the :kbd:`Ctrl+Break` keystroke event. This signal can only be used with :func:`os.kill`.
pt_br: O sinal correspondente ao evento de pressionamento de tecla :kbd:`Ctrl+Break`. Este sinal só pode ser usado com :func:`os.kill`.

source: One more than the number of the highest signal number. Use :func:`valid_signals` to get valid signal numbers.
pt_br: Um a mais que o número do sinal mais alto. Use :func:`valid_signals` para obter números de sinais válidos.

source: Decrements interval timer in real time, and delivers :const:`SIGALRM` upon expiration.
pt_br: Diminui o intervalo do temporizador em tempo real e entrega :const:`SIGALRM` ao expirar.

source: Decrements interval timer only when the process is executing, and delivers SIGVTALRM upon expiration.
pt_br: Diminui o intervalo do temporizador somente quando o processo está em execução e entrega SIGVTALRM após a expiração.

source: Decrements interval timer both when the process executes and when the system is executing on behalf of the process. Coupled with ITIMER_VIRTUAL, this timer is usually used to profile the time spent by the application in user and kernel space. SIGPROF is delivered upon expiration.
pt_br: Diminui o temporizador de intervalo tanto quando o processo é executado quanto quando o sistema está executando em nome do processo. Juntamente com o ITIMER_VIRTUAL, este temporizador é geralmente usado para criar um perfil do tempo gasto pelo aplicativo nos espaços do usuário e do kernel. O SIGPROF é fornecido após a expiração.

source: A possible value for the *how* parameter to :func:`pthread_sigmask` indicating that signals are to be blocked.
pt_br: Um possível valor para o parâmetro *how* para :func:`pthread_sigmask` indicando que os sinais devem ser bloqueados.

source: A possible value for the *how* parameter to :func:`pthread_sigmask` indicating that signals are to be unblocked.
pt_br: Um possível valor para o parâmetro *how* para :func:`pthread_sigmask` indicando que os sinais devem ser desbloqueados.

source: A possible value for the *how* parameter to :func:`pthread_sigmask` indicating that the signal mask is to be replaced.
pt_br: Um possível valor para o parâmetro *how* para :func:`pthread_sigmask` indicando que a máscara de sinal deve ser substituída.

source: The :mod:`signal` module defines one exception:
pt_br: O módulo :mod:`signal` define uma exceção:

source: Raised to signal an error from the underlying :func:`setitimer` or :func:`getitimer` implementation. Expect this error if an invalid interval timer or a negative time is passed to :func:`setitimer`. This error is a subtype of :exc:`OSError`.
pt_br: Levantada para sinalizar um erro da implementação subjacente de :func:`setitimer` ou :func:`getitimer`. Espere este erro se um temporizador de intervalo inválido ou um tempo negativo for passado para :func:`setitimer`. Este erro é um subtipo de :exc:`OSError`.

source: This error used to be a subtype of :exc:`IOError`, which is now an alias of :exc:`OSError`.
pt_br: Este erro costumava ser um subtipo de :exc:`IOError`, que agora é um apelido de :exc:`OSError`.

source: The :mod:`signal` module defines the following functions:
pt_br: O módulo :mod:`signal` define as seguintes funções:

source: If *time* is non-zero, this function requests that a :const:`SIGALRM` signal be sent to the process in *time* seconds. Any previously scheduled alarm is canceled (only one alarm can be scheduled at any time). The returned value is then the number of seconds before any previously set alarm was to have been delivered. If *time* is zero, no alarm is scheduled, and any scheduled alarm is canceled. If the return value is zero, no alarm is currently scheduled.
pt_br: Se *time* for diferente de zero, esta função solicita que um sinal :const:`SIGALRM` seja enviado ao processo em *time* segundos. Qualquer alarme previamente agendado será cancelado (apenas um alarme pode ser agendado por vez). O valor retornado será o número de segundos antes de qualquer alarme previamente configurado ter sido emitido. Se *time* for zero, nenhum alarme será agendado e qualquer alarme agendado será cancelado. Se o valor retornado for zero, nenhum alarme será agendado no momento.

source: See the man page :manpage:`alarm(2)` for further information.
pt_br: Veja a página man :manpage:`alarm(2)` para mais informações.

source: Return the current signal handler for the signal *signalnum*. The returned value may be a callable Python object, or one of the special values :const:`signal.SIG_IGN`, :const:`signal.SIG_DFL` or :const:`None`. Here, :const:`signal.SIG_IGN` means that the signal was previously ignored, :const:`signal.SIG_DFL` means that the default way of handling the signal was previously in use, and ``None`` means that the previous signal handler was not installed from Python.
pt_br: Retorna o manipulador de sinal atual para o sinal *signalnum*. O valor retornado pode ser um objeto Python invocável ou um dos valores especiais :const:`signal.SIG_IGN`, :const:`signal.SIG_DFL` ou :const:`None`. Aqui, :const:`signal.SIG_IGN` significa que o sinal foi ignorado anteriormente, :const:`signal.SIG_DFL` significa que a maneira padrão de manipular o sinal estava em uso anteriormente e ``None`` significa que o manipulador de sinal anterior não foi instalado a partir do Python.

source: Returns the description of signal *signalnum*, such as "Interrupt" for :const:`SIGINT`. Returns :const:`None` if *signalnum* has no description. Raises :exc:`ValueError` if *signalnum* is invalid.
pt_br: Retorna a descrição do sinal *signalnum*, como "Interrupt" para :const:`SIGINT`. Retorna :const:`None` se *signalnum* não tiver descrição. Levanta :exc:`ValueError` se *signalnum* for inválido.

source: Return the set of valid signal numbers on this platform. This can be less than ``range(1, NSIG)`` if some signals are reserved by the system for internal use.
pt_br: Retorna o conjunto de números de sinais válidos nesta plataforma. Pode ser menor que ``range(1, NSIG)`` se alguns sinais forem reservados pelo sistema para uso interno.

source: Cause the process to sleep until a signal is received; the appropriate handler will then be called. Returns nothing.
pt_br: Faz o processo hibernar até que um sinal seja recebido; o manipulador apropriado será então chamado. Não retorna nada.

source: See the man page :manpage:`signal(2)` for further information.
pt_br: Veja a página man :manpage:`signal(2)` para mais informações.

source: See also :func:`sigwait`, :func:`sigwaitinfo`, :func:`sigtimedwait` and :func:`sigpending`.
pt_br: veja também :func:`sigwait`, :func:`sigwaitinfo`, :func:`sigtimedwait` e :func:`sigpending`.

source: Sends a signal to the calling process. Returns nothing.
pt_br: Envia um sinal para o processo de chamada. Não retorna nada.

source: Send signal *sig* to the process referred to by file descriptor *pidfd*. Python does not currently support the *siginfo* parameter; it must be ``None``. The *flags* argument is provided for future extensions; no flag values are currently defined.
pt_br: Envia o sinal *sig* para o processo referenciado pelo descritor de arquivo *pidfd*. Atualmente, o Python não suporta o parâmetro *siginfo*; ele deve ser ``None``. O argumento *flags* é fornecido para futuras extensões; nenhum valor de sinalizador está definido no momento.

source: See the :manpage:`pidfd_send_signal(2)` man page for more information.
pt_br: Veja a página man :manpage:`pidfd_send_signal(2)` para mais informações.

source: Send the signal *signalnum* to the thread *thread_id*, another thread in the same process as the caller. The target thread can be executing any code (Python or not). However, if the target thread is executing the Python interpreter, the Python signal handlers will be :ref:`executed by the main thread of the main interpreter <signals-and-threads>`. Therefore, the only point of sending a signal to a particular Python thread would be to force a running system call to fail with :exc:`InterruptedError`.
pt_br: Envia o sinal *signalnum* para a thread *thread_id*, outra thread no mesmo processo que a chamadora. A thread alvo pode estar executando qualquer código (Python ou não). No entanto, se a thread alvo estiver executando o interpretador Python, os manipuladores de sinal Python serão :ref:`executados pela thread principal do interpretador principal <signals-and-threads>`. Portanto, o único objetivo de enviar um sinal para uma thread Python específica seria forçar uma chamada de sistema em execução a falhar com :exc:`InterruptedError`.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
pt_br: Utilize a :func:`threading.get_ident` ou o atributo :attr:`~threading.Thread.ident` dos objetos :class:`threading.Thread` para obter um valor adequado para *thread_id*.

source: If *signalnum* is 0, then no signal is sent, but error checking is still performed; this can be used to check if the target thread is still running.
pt_br: Se *signalnum* for 0, nenhum sinal será enviado, mas a verificação de erros ainda será realizada; isso pode ser usado para verificar se a thread de destino ainda está em execução.

source: Raises an :ref:`auditing event <auditing>` ``signal.pthread_kill`` with arguments ``thread_id``, ``signalnum``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``signal.pthread_kill`` com os argumentos ``thread_id``, ``signalnum``.

source: See the man page :manpage:`pthread_kill(3)` for further information.
pt_br: Veja a página man :manpage:`pthread_kill(3)` para mais informações.

source: See also :func:`os.kill`.
pt_br: Veja também :func:`os.kill`.

source: Fetch and/or change the signal mask of the calling thread. The signal mask is the set of signals whose delivery is currently blocked for the caller. Return the old signal mask as a set of signals.
pt_br: Busca e/ou altera a máscara de sinal da thread chamadora. A máscara de sinal é o conjunto de sinais cuja entrega está atualmente bloqueada para o chamador. Retorna a máscara de sinal antiga como um conjunto de sinais.

source: The behavior of the call is dependent on the value of *how*, as follows.
pt_br: O comportamento da chamada depende do valor de *how*, como segue.

source: :data:`SIG_BLOCK`: The set of blocked signals is the union of the current set and the *mask* argument.
pt_br: :data:`SIG_BLOCK`: O conjunto de sinais bloqueados é a união do conjunto atual e do argumento *mask*.

source: :data:`SIG_UNBLOCK`: The signals in *mask* are removed from the current set of blocked signals. It is permissible to attempt to unblock a signal which is not blocked.
pt_br: :data:`SIG_UNBLOCK`: Os sinais em *mask* são removidos do conjunto atual de sinais bloqueados. É permitido tentar desbloquear um sinal que não esteja bloqueado.

source: :data:`SIG_SETMASK`: The set of blocked signals is set to the *mask* argument.
pt_br: :data:`SIG_SETMASK`: O conjunto de sinais bloqueados é definido como o argumento *mask*.
