Repository: python/python-docs-pt-br
Catalog: library/site.po
Languages: pt_br

source: :mod:`!site` --- Site-specific configuration hook
pt_br: :mod:`!site` --- Gancho de configuração específico do site

source: **Source code:** :source:`Lib/site.py`
pt_br: **Código-fonte:** :source:`Lib/site.py`

source: **This module is automatically imported during initialization.** The automatic import can be suppressed using the interpreter's :option:`-S` option.
pt_br: **Este módulo é importado automaticamente durante a inicialização.** A importação automática pode ser suprimida usando a opção :option:`-S` do interpretador.

source: Importing this module normally appends site-specific paths to the module search path and adds :ref:`callables <site-consts>`, including :func:`help` to the built-in namespace. However, Python startup option :option:`-S` blocks this and this module can be safely imported with no automatic modifications to the module search path or additions to the builtins. To explicitly trigger the usual site-specific additions, call the :func:`main` function.
pt_br: A importação deste módulo normalmente anexa caminhos específicos do site ao caminho de pesquisa de módulos e adiciona :ref:`chamáveis <site-consts>`, incluindo :func:`help` ao espaço de nomes embutido. No entanto, a opção de inicialização do Python :option:`-S` bloqueia isso e este módulo pode ser importado com segurança sem modificações automáticas no caminho de pesquisa de módulos ou adições aos módulos embutidos. Para acionar explicitamente as adições usuais específicas do site, chame a função :func:`main`.

source: Importing the module used to trigger paths manipulation even when using :option:`-S`.
pt_br: A importação do módulo usado para acionar a manipulação de caminhos, mesmo ao usar :option:`-S`.

source: It starts by constructing up to four directories from a head and a tail part. For the head part, it uses ``sys.prefix`` and ``sys.exec_prefix``; empty heads are skipped. For the tail part, it uses the empty string and then :file:`lib/site-packages` (on Windows) or :file:`lib/python{X.Y[t]}/site-packages` (on Unix and macOS). (The optional suffix "t" indicates the :term:`free threading` build, and is appended if ``"t"`` is present in the :data:`sys.abiflags` constant.) For each of the distinct head-tail combinations, it sees if it refers to an existing directory, and if so, adds it to ``sys.path`` and also inspects the newly added path for configuration files.
pt_br: Ele começa construindo até quatro diretórios a partir de uma parte no início e uma no final. Para a parte no início, ele usa ``sys.prefix`` e ``sys.exec_prefix``; inícios vazios são ignorados. Para a parte no final, ele usa a string vazia e então :file:`lib/site-packages` (no Windows) ou :file:`lib/python{X.Y[t]}/site-packages` (no Unix e macOS). (O sufixo opcional "t" indica a construção com :term:`threads livres` e é anexado se ``"t"`` estiver presente na constante :data:`sys.abiflags`.) Para cada uma das combinações distintas início-fim, ele vê se se refere a um diretório existente e, se sim, adiciona-o a ``sys.path`` e também inspeciona o caminho recém-adicionado para arquivos de configuração.

source: Support for the "site-python" directory has been removed.
pt_br: Suporte para o diretório "site-python" foi removido.

source: On Unix, :term:`Free threading <free threading>` Python installations are identified by the "t" suffix in the version-specific directory name, such as :file:`lib/python3.13t/`.
pt_br: No Unix, as instalações do Python :term:`threads livres <free threading>` são identificadas pelo sufixo "t" no nome do diretório específico da versão, como :file:`lib/python3.13t/`.

source: :mod:`site` is no longer responsible for updating :data:`sys.prefix` and :data:`sys.exec_prefix` on :ref:`sys-path-init-virtual-environments`. This is now done during the :ref:`path initialization <sys-path-init>`. As a result, under :ref:`sys-path-init-virtual-environments`, :data:`sys.prefix` and :data:`sys.exec_prefix` no longer depend on the :mod:`site` initialization, and are therefore unaffected by :option:`-S`.
pt_br: :mod:`site` não é mais responsável por atualizar :data:`sys.prefix` e :data:`sys.exec_prefix` em :ref:`sys-path-init-virtual-environments`. Isso agora é feito durante a :ref:`inicialização do caminho <sys-path-init>`. Como resultado, em :ref:`sys-path-init-virtual-environments`, :data:`sys.prefix` e :data:`sys.exec_prefix` não dependem mais da inicialização de :mod:`site` e, portanto, não são afetados por :option:`-S`.

source: When running under a :ref:`virtual environment <sys-path-init-virtual-environments>`, the ``pyvenv.cfg`` file in :data:`sys.prefix` is checked for site-specific configurations. If the ``include-system-site-packages`` key exists and is set to ``true`` (case-insensitive), the system-level prefixes will be searched for site-packages, otherwise they won't.
pt_br: Ao executar em um :ref:`ambiente virtual <sys-path-init-virtual-environments>`, o arquivo ``pyvenv.cfg`` em :data:`sys.prefix` é verificado em busca de configurações específicas do site. Se a chave ``include-system-site-packages`` existir e estiver definida como ``true`` (sem distinção entre maiúsculas e minúsculas), os prefixos de nível de sistema serão pesquisados em busca de site-packages; caso contrário, não serão.

source: A path configuration file is a file whose name has the form :file:`{name}.pth` and exists in one of the four directories mentioned above; its contents are additional items (one per line) to be added to ``sys.path``. Non-existing items are never added to ``sys.path``, and no check is made that the item refers to a directory rather than a file. No item is added to ``sys.path`` more than once. Blank lines and lines beginning with ``#`` are skipped. Lines starting with ``import`` (followed by space or tab) are executed.
pt_br: Um arquivo de configuração de caminho é aquele cujo nome tem o formato :file:`{name}.pth` e que existe em um dos quatro diretórios mencionados acima; seu conteúdo são itens adicionais (um por linha) a serem adicionados ao ``sys.path``. Itens inexistentes nunca são adicionados ao ``sys.path`` e não é verificado se o item se refere a um diretório, e não a um arquivo. Nenhum item é adicionado ao ``sys.path`` mais de uma vez. Linhas em branco e linhas iniciadas com ``#`` são ignoradas. Linhas iniciadas com ``import`` (seguidas de espaço ou tabulação) são executadas.

source: An executable line in a :file:`.pth` file is run at every Python startup, regardless of whether a particular module is actually going to be used. Its impact should thus be kept to a minimum. The primary intended purpose of executable lines is to make the corresponding module(s) importable (load 3rd-party import hooks, adjust :envvar:`PATH` etc). Any other initialization is supposed to be done upon a module's actual import, if and when it happens. Limiting a code chunk to a single line is a deliberate measure to discourage putting anything more complex here.
pt_br: Uma linha executável em um arquivo :file:`.pth` é executada a cada inicialização do Python, independentemente de um módulo em particular ser realmente usado. Seu impacto deve, portanto, ser reduzido ao mínimo. O objetivo principal das linhas executáveis é tornar o(s) módulo(s) correspondente(s) importável (carregar ganchos de importação de terceiros, ajustar :envvar:`PATH` etc). Qualquer outra inicialização deve ser feita na importação real de um módulo, se e quando isso acontecer. Limitar um fragmento de código a uma única linha é uma medida deliberada para desencorajar colocar qualquer coisa mais complexa aqui.

source: The :file:`.pth` files are now decoded by UTF-8 at first and then by the :term:`locale encoding` if it fails.
pt_br: Os arquivos :file:`.pth` agora são decodificados primeiro por UTF-8 e depois pela :term:`codificação da localidade` se falhar.

source: For example, suppose ``sys.prefix`` and ``sys.exec_prefix`` are set to :file:`/usr/local`. The Python X.Y library is then installed in :file:`/usr/local/lib/python{X.Y}`. Suppose this has a subdirectory :file:`/usr/local/lib/python{X.Y}/site-packages` with three subsubdirectories, :file:`foo`, :file:`bar` and :file:`spam`, and two path configuration files, :file:`foo.pth` and :file:`bar.pth`. Assume :file:`foo.pth` contains the following::
pt_br: Por exemplo, suponha que ``sys.prefix`` e ``sys.exec_prefix`` sejam definidos com :file:`/usr/local`. A biblioteca Python X.Y é instalado em :file:`/usr/local/lib/python{X.Y}`. Suponha que isso tenha um subdiretório :file:`/usr/local/lib/python{X.Y}/site-packages` com três subsubdiretórios, :file:`foo`, :file:`bar` e :file:`spam`, e dois caminhos arquivos de configuração, :file:`foo.pth` e :file:`bar.pth`. Presuma que :file:`foo.pth` contém o seguinte::

source: # foo package configuration foo bar bletch
pt_br: # configuração do pacote foo foo bar bletch

source: and :file:`bar.pth` contains::
pt_br: e que :file:`bar.pth` contém::

source: # bar package configuration bar
pt_br: # configuração do pacote bar bar

source: Then the following version-specific directories are added to ``sys.path``, in this order::
pt_br: Em seguida, os seguintes diretórios específicos da versão são adicionados a ``sys.path``, nesta ordem::

source: Note that :file:`bletch` is omitted because it doesn't exist; the :file:`bar` directory precedes the :file:`foo` directory because :file:`bar.pth` comes alphabetically before :file:`foo.pth`; and :file:`spam` is omitted because it is not mentioned in either path configuration file.
pt_br: Observe que :file:`bletch` é omitido porque não existe; o diretório :file:`bar` precede o diretório :file:`foo` porque :file:`bar.pth` vem em ordem alfabética antes de :file:`foo.pth`; e :file:`spam` é omitido porque não é mencionado em nenhum dos arquivos de configuração de caminho.

source: After these path manipulations, an attempt is made to import a module named :mod:`sitecustomize`, which can perform arbitrary site-specific customizations. It is typically created by a system administrator in the site-packages directory. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'sitecustomize'``, it is silently ignored. If Python is started without output streams available, as with :file:`pythonw.exe` on Windows (which is used by default to start IDLE), attempted output from :mod:`sitecustomize` is ignored. Any other exception causes a silent and perhaps mysterious failure of the process.
pt_br: Após essas manipulações de caminho, é feita uma tentativa de importar um módulo chamado :mod:`sitecustomize`, que pode executar personalizações arbitrárias específicas do site. Ele é normalmente criado por um administrador de sistema no diretório site-packages. Se essa importação falhar com uma :exc:`ImportError` ou sua exceção de subclasse, e o atributo :attr:`~ImportError.name` da exceção for igual a ``'sitecustomize'``, ele será ignorado silenciosamente. Se o Python for iniciado sem fluxos de saída disponíveis, como com :file:`pythonw.exe` no Windows (que é usado por padrão para iniciar o IDLE), a tentativa de saída de :mod:`sitecustomize` será ignorada. Qualquer outra exceção causa uma falha silenciosa e talvez misteriosa do processo.

source: After this, an attempt is made to import a module named :mod:`usercustomize`, which can perform arbitrary user-specific customizations, if :data:`~site.ENABLE_USER_SITE` is true. This file is intended to be created in the user site-packages directory (see below), which is part of ``sys.path`` unless disabled by :option:`-s`. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'usercustomize'``, it is silently ignored.
pt_br: Depois disso, é feita uma tentativa de importar um módulo chamado :mod:`usercustomize`, que pode executar personalizações arbitrárias específicas do usuário, se :data:`~site.ENABLE_USER_SITE` for true. Este arquivo deve ser criado no diretório site-packages de usuário (veja abaixo), que faz parte de ``sys.path`` a menos que seja desabilitado por :option:`-s`. Se esta importação falhar com um :exc:`ImportError` ou sua exceção de subclasse, e o atributo :attr:`~ImportError.name` da exceção for igual a ``'usercustomize'``, ele será ignorado silenciosamente.

source: Note that for some non-Unix systems, ``sys.prefix`` and ``sys.exec_prefix`` are empty, and the path manipulations are skipped; however the import of :mod:`sitecustomize` and :mod:`usercustomize` is still attempted.
pt_br: Observe que, para alguns sistemas não Unix, ``sys.prefix`` e ``sys.exec_prefix`` estão vazios, e as manipulações de caminho são ignoradas; no entanto, a importação de :mod:`sitecustomize` e :mod:`usercustomize` ainda é tentada.

source: Readline configuration
pt_br: Configuração Readline

source: On systems that support :mod:`readline`, this module will also import and configure the :mod:`rlcompleter` module, if Python is started in :ref:`interactive mode <tut-interactive>` and without the :option:`-S` option. The default behavior is enable tab-completion and to use :file:`~/.python_history` as the history save file. To disable it, delete (or override) the :data:`sys.__interactivehook__` attribute in your :mod:`sitecustomize` or :mod:`usercustomize` module or your :envvar:`PYTHONSTARTUP` file.
pt_br: Em sistemas que oferecem suporte a :mod:`readline`, este módulo também importará e configurará o módulo :mod:`rlcompleter`, se o Python for iniciado em :ref:`modo interativo <tut-interactive>` e sem a opção :option:`-S`. O comportamento padrão é habilitar tab-completion e usar :file:`~/.python_history` como o arquivo de salvamento do histórico. Para desabilitá-lo, exclua (ou substitua) o atributo :data:`sys.__interactivehook__` no seu módulo :mod:`sitecustomize` ou :mod:`usercustomize` ou no seu arquivo :envvar:`PYTHONSTARTUP`.

source: Activation of rlcompleter and history was made automatic.
pt_br: A ativação do rlcompleter e do histórico foi feita automaticamente.

source: Module contents
pt_br: Conteúdo do módulo

source: A list of prefixes for site-packages directories.
pt_br: Uma lista de prefixos para diretórios site-package.

source: Flag showing the status of the user site-packages directory. ``True`` means that it is enabled and was added to ``sys.path``. ``False`` means that it was disabled by user request (with :option:`-s` or :envvar:`PYTHONNOUSERSITE`). ``None`` means it was disabled for security reasons (mismatch between user or group id and effective id) or by an administrator.
pt_br: Sinalizador mostrando o status do diretório site-packages do usuário. ``True`` significa que ele está habilitado e foi adicionado a ``sys.path``. ``False`` significa que ele foi desabilitado por solicitação do usuário (com :option:`-s` ou :envvar:`PYTHONNOUSERSITE`). ``None`` significa que ele foi desabilitado por motivos de segurança (incompatibilidade entre o ID do usuário ou grupo e o ID efetivo) ou por um administrador.

source: Path to the user site-packages for the running Python. Can be ``None`` if :func:`getusersitepackages` hasn't been called yet. Default value is :file:`~/.local/lib/python{X.Y}[t]/site-packages` for UNIX and non-framework macOS builds, :file:`~/Library/Python/{X.Y}/lib/python/site-packages` for macOS framework builds, and :file:`{%APPDATA%}\\Python\\Python{XY}\\site-packages` on Windows. The optional "t" indicates the free-threaded build. This directory is a site directory, which means that :file:`.pth` files in it will be processed.
pt_br: Caminho para o usuário site-packages para o Python em execução. Pode ser ``None`` se :func:`getusersitepackages` ainda não tiver sido chamado. O valor padrão é :file:`~/.local/lib/python{X.Y}[t]/site-packages` para construções UNIX e macOS não-framework, :file:`~/Library/Python/{X.Y}/lib/python/site-packages` para construções macOS framework e :file:`{%APPDATA%}\\Python\\Python{XY}\\site-packages` no Windows. O "t" opcional indica a construção com threads livres. Este diretório é um diretório de site, o que significa que os arquivos :file:`.pth` nele serão processados.

source: Path to the base directory for the user site-packages. Can be ``None`` if :func:`getuserbase` hasn't been called yet. Default value is :file:`~/.local` for UNIX and macOS non-framework builds, :file:`~/Library/Python/{X.Y}` for macOS framework builds, and :file:`{%APPDATA%}\\Python` for Windows. This value is used to compute the installation directories for scripts, data files, Python modules, etc. for the :ref:`user installation scheme <sysconfig-user-scheme>`. See also :envvar:`PYTHONUSERBASE`.
pt_br: Caminho para o diretório base para os pacotes do site do usuário. Pode ser ``None`` se :func:`getuserbase` ainda não tiver sido chamado. O valor padrão é :file:`~/.local` para construções não-framework UNIX e macOS, :file:`~/Library/Python/{X.Y}` para construções de framework macOS e :file:`{%APPDATA%}\\Python` para Windows. Este valor é usado para calcular os diretórios de instalação para scripts, arquivos de dados, módulos Python, etc. para o :ref:`esquema de instalação de usuário <sysconfig-user-scheme>`. Veja também :envvar:`PYTHONUSERBASE`.

source: Adds all the standard site-specific directories to the module search path. This function is called automatically when this module is imported, unless the Python interpreter was started with the :option:`-S` flag.
pt_br: Adiciona todos os diretórios padrão específicos do site ao caminho de pesquisa de módulos. Esta função é chamada automaticamente quando este módulo é importado, a menos que o interpretador Python tenha sido iniciado com o sinalizador :option:`-S`.

source: This function used to be called unconditionally.
pt_br: Esta função costumava ser chamada incondicionalmente.

source: Add a directory to sys.path and process its :file:`.pth` files. Typically used in :mod:`sitecustomize` or :mod:`usercustomize` (see above).
pt_br: Adiciona um diretório a sys.path e processa seus arquivos :file:`.pth`. Normalmente usado em :mod:`sitecustomize` ou :mod:`usercustomize` (veja acima).

source: Return a list containing all global site-packages directories.
pt_br: Retorna uma lista contendo todos os diretórios globais de pacotes de sites.

source: Return the path of the user base directory, :data:`USER_BASE`. If it is not initialized yet, this function will also set it, respecting :envvar:`PYTHONUSERBASE`.
pt_br: Retorna o caminho do diretório base do usuário, :data:`USER_BASE`. Se ele ainda não foi inicializado, esta função também o definirá, respeitando :envvar:`PYTHONUSERBASE`.

source: Return the path of the user-specific site-packages directory, :data:`USER_SITE`. If it is not initialized yet, this function will also set it, respecting :data:`USER_BASE`. To determine if the user-specific site-packages was added to ``sys.path`` :data:`ENABLE_USER_SITE` should be used.
pt_br: Retorna o caminho do diretório site-packages específico do usuário, :data:`USER_SITE`. Se ele ainda não foi inicializado, esta função também o definirá, respeitando :data:`USER_BASE`. Para determinar se o site-packages específico do usuário foi adicionado a ``sys.path``, :data:`ENABLE_USER_SITE` deve ser usado.

source: Command-line interface
pt_br: Interface de linha de comando

source: The :mod:`site` module also provides a way to get the user directories from the command line:
pt_br: O módulo :mod:`site` também fornece uma maneira de obter os diretórios do usuário a partir da linha de comando:

source: If it is called without arguments, it will print the contents of :data:`sys.path` on the standard output, followed by the value of :data:`USER_BASE` and whether the directory exists, then the same thing for :data:`USER_SITE`, and finally the value of :data:`ENABLE_USER_SITE`.
pt_br: Se for chamado sem argumentos, ele vai exibir o conteúdo de :data:`sys.path` na saída padrão, seguido pelo valor de :data:`USER_BASE` e se o diretório existe, depois o mesmo para :data:`USER_SITE` e, finalmente, o valor de :data:`ENABLE_USER_SITE`.

source: Print the path to the user base directory.
pt_br: Exibe o caminho para o diretório base do usuário.

source: Print the path to the user site-packages directory.
pt_br: Exibe o caminho para o diretório site-packages do usuário.

source: If both options are given, user base and user site will be printed (always in this order), separated by :data:`os.pathsep`.
pt_br: Se ambas as opções forem fornecidas, a base do usuário e o site do usuário serão exibidos (sempre nesta ordem), separados por :data:`os.pathsep`.

source: If any option is given, the script will exit with one of these values: ``0`` if the user site-packages directory is enabled, ``1`` if it was disabled by the user, ``2`` if it is disabled for security reasons or by an administrator, and a value greater than 2 if there is an error.
pt_br: Se qualquer opção for fornecida, o script sairá com um destes valores: ``0`` se o diretório site-packages do usuário estiver habilitado, ``1`` se ele foi desabilitado pelo usuário, ``2`` se ele foi desabilitado por motivos de segurança ou por um administrador, e um valor maior que 2 se houver um erro.

source: :pep:`370` -- Per user site-packages directory
pt_br: :pep:`370` -- Diretório site-packages por usuário.

source: :ref:`sys-path-init` -- The initialization of :data:`sys.path`.
pt_br: :ref:`sys-path-init` -- A inicialização de :data:`sys.path`.

source: module
pt_br: módulo

source: search
pt_br: pesquisa

source: path
pt_br: caminho

source: directory
pt_br: diretório

source: # (hash)
pt_br: # (cerquilha)

source: comment
pt_br: comentário

source: statement
pt_br: instrução

source: import
pt_br: importação

source: package
pt_br: pacote

source: configuration
pt_br: configuração

source: file
pt_br: arquivo
