Repository: python/python-docs-pt-br
Catalog: library/smtplib.po
Languages: pt_br

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. If the server does ESMTP, message size and each of the specified options will be passed to it (if the option is in the feature set the server advertises). If ``EHLO`` fails, ``HELO`` will be tried and ESMTP options suppressed.
pt_br: Якщо в цьому сеансі не було попередньої команди ``EHLO`` або ``HELO``, цей метод спочатку намагається ESMTP ``EHLO``. Якщо сервер використовує ESMTP, йому буде передано розмір повідомлення та кожен із зазначених параметрів (якщо цей параметр є в наборі функцій, який повідомляє сервер). Якщо ``EHLO`` не вдається, ``HELO`` буде спробовано, а параметри ESMTP пригнічені.

source: This method will return normally if the mail is accepted for at least one recipient. Otherwise it will raise an exception. That is, if this method does not raise an exception, then someone should get your mail. If this method does not raise an exception, it returns a dictionary, with one entry for each recipient that was refused. Each entry contains a tuple of the SMTP error code and the accompanying error message sent by the server.
pt_br: Цей метод повертатиметься нормально, якщо пошту прийнято принаймні для одного одержувача. Інакше викличе виняток. Тобто, якщо цей метод не викликає винятку, то хтось має отримати вашу пошту. Якщо цей метод не викликає винятку, він повертає словник з одним записом для кожного одержувача, якому було відмовлено. Кожен запис містить кортеж коду помилки SMTP і супровідне повідомлення про помилку, надіслане сервером.

source: If ``SMTPUTF8`` is included in *mail_options*, and the server supports it, *from_addr* and *to_addrs* may contain non-ASCII characters.
pt_br: Якщо ``SMTPUTF8`` включено в *mail_options* і сервер підтримує його, *from_addr* і *to_addrs* можуть містити символи, відмінні від ASCII.

source: This method may raise the following exceptions:
pt_br: Esse método deve levantar as seguintes exceções:

source: All recipients were refused. Nobody got the mail. The :attr:`recipients` attribute of the exception object is a dictionary with information about the refused recipients (like the one returned when at least one recipient was accepted).
pt_br: Усім одержувачам було відмовлено. Ніхто не отримав пошту. Атрибут :attr:`recipients` об’єкта винятку — це словник з інформацією про відхилених одержувачів (наприклад, той, що повертається, коли принаймні один одержувач був прийнятий).

source: The server didn't accept the *from_addr*.
pt_br: O servidor não aceita o *from_addr*.

source: The server replied with an unexpected error code (other than a refusal of a recipient).
pt_br: Сервер відповів неочікуваним кодом помилки (окрім відмови одержувача).

source: ``SMTPUTF8`` was given in the *mail_options* but is not supported by the server.
pt_br: ``SMTPUTF8`` було вказано в *mail_options*, але не підтримується сервером.

source: Unless otherwise noted, the connection will be open even after an exception is raised.
pt_br: Якщо не зазначено інше, з’єднання буде відкритим навіть після того, як виникне виняток.

source: *msg* may be a byte string.
pt_br: *msg* може бути рядком байтів.

source: ``SMTPUTF8`` support added, and :exc:`SMTPNotSupportedError` may be raised if ``SMTPUTF8`` is specified but the server does not support it.
pt_br: Додано підтримку ``SMTPUTF8``, і :exc:`SMTPNotSupportedError` може виникати, якщо ``SMTPUTF8`` зазначено, але сервер його не підтримує.

source: This is a convenience method for calling :meth:`sendmail` with the message represented by an :class:`email.message.Message` object. The arguments have the same meaning as for :meth:`sendmail`, except that *msg* is a ``Message`` object.
pt_br: Це зручний метод для виклику :meth:`sendmail` з повідомленням, представленим об’єктом :class:`email.message.Message`. Аргументи мають те саме значення, що й для :meth:`sendmail`, за винятком того, що *msg* є об’єктом ``Message``.

source: If *from_addr* is ``None`` or *to_addrs* is ``None``, ``send_message`` fills those arguments with addresses extracted from the headers of *msg* as specified in :rfc:`5322`\: *from_addr* is set to the :mailheader:`Sender` field if it is present, and otherwise to the :mailheader:`From` field. *to_addrs* combines the values (if any) of the :mailheader:`To`, :mailheader:`Cc`, and :mailheader:`Bcc` fields from *msg*. If exactly one set of :mailheader:`Resent-*` headers appear in the message, the regular headers are ignored and the :mailheader:`Resent-*` headers are used instead. If the message contains more than one set of :mailheader:`Resent-*` headers, a :exc:`ValueError` is raised, since there is no way to unambiguously detect the most recent set of :mailheader:`Resent-` headers.
pt_br: Якщо *from_addr* має значення ``None`` або *to_addrs* має значення ``None``, ``send_message`` заповнює ці аргументи адресами, отриманими із заголовків *msg*, як зазначено в :rfc:`5322`\: *from_addr* встановлюється в поле :mailheader:`Sender`, якщо воно присутнє, або в іншому випадку в поле :mailheader:`From`. *to_addrs* об’єднує значення (якщо такі є) полів :mailheader:`To`, :mailheader:`Cc` та :mailheader:`Bcc` з *повідомлення*. Якщо в повідомленні з’являється рівно один набір заголовків :mailheader:`Resent-*`, звичайні заголовки ігноруються, а замість них використовуються заголовки :mailheader:`Resent-*`. Якщо повідомлення містить більше одного набору заголовків :mailheader:`Resent-*`, виникає помилка :exc:`ValueError`, оскільки неможливо однозначно визначити останній набір заголовків :mailheader:`Resent-` .

source: Support for internationalized addresses (``SMTPUTF8``).
pt_br: Підтримка інтернаціоналізованих адрес (``SMTPUTF8``).

source: Terminate the SMTP session and close the connection. Return the result of the SMTP ``QUIT`` command.
pt_br: Припиніть сеанс SMTP і закрийте з’єднання. Повертає результат виконання команди SMTP ``QUIT``.

source: Low-level methods corresponding to the standard SMTP/ESMTP commands ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT``, and ``DATA`` are also supported. Normally these do not need to be called directly, so they are not documented here. For details, consult the module code.
pt_br: Методи низького рівня, що відповідають стандартним командам SMTP/ESMTP ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT`` і ``DATA``, також є підтримується. Зазвичай їх не потрібно викликати безпосередньо, тому вони тут не задокументовані. Для отримання додаткової інформації зверніться до коду модуля.

source: SMTP Example
pt_br: Exemplo SMTP

source: In general, you will want to use the :mod:`email` package's features to construct an email message, which you can then send via :meth:`~smtplib.SMTP.send_message`; see :ref:`email-examples`.
pt_br: Загалом, ви захочете використати функції пакета :mod:`email` для створення повідомлення електронної пошти, яке потім можна надіслати через :meth:`~smtplib.SMTP.send_message`; див. :ref:`email-examples`.

source: protocol
pt_br: protocolo
