Repository: python/python-docs-pt-br
Catalog: library/smtplib.po
Languages: pt_br

source: **Source code:** :source:`Lib/smtplib.py`
pt_br: **Código-fonte:** :source:`Lib/smtplib.py`

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: For normal use, you should only require the initialization/connect, :meth:`sendmail`, and :meth:`SMTP.quit` methods. An example is included below.
pt_br: Для звичайного використання вам знадобляться лише методи ініціалізації/підключення, :meth:`sendmail` і :meth:`SMTP.quit`. Приклад наведено нижче.

source: The :class:`SMTP` class supports the :keyword:`with` statement. When used like this, the SMTP ``QUIT`` command is issued automatically when the :keyword:`!with` statement exits. E.g.::
pt_br: Клас :class:`SMTP` підтримує оператор :keyword:`with`. При такому використанні команда SMTP ``QUIT`` виконується автоматично, коли завершується оператор :keyword:`!with`. Наприклад::

source: All commands will raise an :ref:`auditing event <auditing>` ``smtplib.SMTP.send`` with arguments ``self`` and ``data``, where ``data`` is the bytes about to be sent to the remote host.
pt_br: Усі команди викличуть :ref:`подію аудиту <auditing>` ``smtplib.SMTP.send`` з аргументами ``self`` і ``data``, де ``data`` це байти, які мають бути надіслані до віддалений хост.

source: Support for the :keyword:`with` statement was added.
pt_br: Suporte para a instrução :keyword:`with` foi adicionado.

source: The SMTPUTF8 extension (:rfc:`6531`) is now supported.
pt_br: A extensão SMTPUTF8 ( :rfc:`6531` ) é suportada agora.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket.
pt_br: Якщо параметр *timeout* дорівнює нулю, це викличе :class:`ValueError`, щоб запобігти створенню неблокуючого сокета.

source: An :class:`SMTP_SSL` instance behaves exactly the same as instances of :class:`SMTP`. :class:`SMTP_SSL` should be used for situations where SSL is required from the beginning of the connection and using :meth:`starttls` is not appropriate. If *host* is not specified, the local host is used. If *port* is zero, the standard SMTP-over-SSL port (465) is used. The optional arguments *local_hostname*, *timeout* and *source_address* have the same meaning as they do in the :class:`SMTP` class. *context*, also optional, can contain a :class:`~ssl.SSLContext` and allows configuring various aspects of the secure connection. Please read :ref:`ssl-security` for best practices.
pt_br: Екземпляр :class:`SMTP_SSL` поводиться точно так само, як екземпляри :class:`SMTP`. :class:`SMTP_SSL` слід використовувати для ситуацій, коли SSL потрібен від початку з’єднання, а використання :meth:`starttls` не підходить. Якщо *host* не вказано, використовується локальний хост. Якщо *port* дорівнює нулю, використовується стандартний порт SMTP через SSL (465). Необов’язкові аргументи *local_hostname*, *timeout* і *source_address* мають те саме значення, що й у класі :class:`SMTP`. *context*, також необов’язковий, може містити :class:`~ssl.SSLContext` і дозволяє налаштовувати різні аспекти безпечного з’єднання. Будь ласка, прочитайте :ref:`ssl-security`, щоб дізнатися про найкращі практики.

source: *context* was added.
pt_br: *context* foi adicionado.

source: The *source_address* argument was added.
pt_br: O argumento *source_address* foi adicionado.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket
pt_br: Якщо параметр *timeout* дорівнює нулю, це викличе :class:`ValueError`, щоб запобігти створенню неблокуючого сокета

source: The deprecated *keyfile* and *certfile* parameters have been removed.
pt_br: Os parâmetros depreciados *keyfile* e *certfile* foram removidos.

source: Authentication is supported, using the regular SMTP mechanism. When using a Unix socket, LMTP generally don't support or require any authentication, but your mileage might vary.
pt_br: Підтримується автентифікація за допомогою звичайного механізму SMTP. Під час використання сокета Unix LMTP зазвичай не підтримує та не вимагає жодної автентифікації, але ваш пробіг може відрізнятися.

source: The optional *timeout* parameter was added.
pt_br: O parâmetro opcional *timeout* foi adicionado.

source: A nice selection of exceptions is defined as well:
pt_br: Також визначено хороший вибір винятків:

source: Subclass of :exc:`OSError` that is the base exception class for all the other exceptions provided by this module.
pt_br: Підклас :exc:`OSError`, який є базовим класом винятків для всіх інших винятків, наданих цим модулем.

source: SMTPException became subclass of :exc:`OSError`
pt_br: SMTPException став підкласом :exc:`OSError`

source: This exception is raised when the server unexpectedly disconnects, or when an attempt is made to use the :class:`SMTP` instance before connecting it to a server.
pt_br: Цей виняток виникає, коли сервер несподівано відключається або коли робиться спроба використати екземпляр :class:`SMTP` перед підключенням до сервера.

source: Base class for all exceptions that include an SMTP error code. These exceptions are generated in some instances when the SMTP server returns an error code. The error code is stored in the :attr:`smtp_code` attribute of the error, and the :attr:`smtp_error` attribute is set to the error message.
pt_br: Базовий клас для всіх винятків, які містять код помилки SMTP. Ці винятки виникають у деяких випадках, коли сервер SMTP повертає код помилки. Код помилки зберігається в атрибуті :attr:`smtp_code` помилки, а атрибут :attr:`smtp_error` встановлюється на повідомлення про помилку.

source: Sender address refused. In addition to the attributes set by on all :exc:`SMTPResponseException` exceptions, this sets 'sender' to the string that the SMTP server refused.
pt_br: Адресу відправника відхилено. На додаток до атрибутів, встановлених для всіх винятків :exc:`SMTPResponseException`, це встановлює "відправником" рядок, який сервер SMTP відхилив.

source: All recipient addresses refused. The errors for each recipient are accessible through the attribute :attr:`recipients`, which is a dictionary of exactly the same sort as :meth:`SMTP.sendmail` returns.
pt_br: Усі адреси одержувачів відхилено. Помилки для кожного одержувача доступні через атрибут :attr:`recipients`, який є словником того самого типу, що й повертає :meth:`SMTP.sendmail`.

source: The SMTP server refused to accept the message data.
pt_br: O servidor SMTP recusou aceitar o dados da mensagem.

source: Error occurred during establishment of a connection with the server.
pt_br: Ocorreu um erro ao estabelecer uma conexão com o servidor.

source: The server refused our ``HELO`` message.
pt_br: O servidor recusou sua mensagem ``HELO``.

source: The command or option attempted is not supported by the server.
pt_br: Вибрана команда або параметр не підтримується сервером.

source: SMTP authentication went wrong. Most probably the server didn't accept the username/password combination provided.
pt_br: Автентифікація SMTP сталася неправильною. Швидше за все, сервер не прийняв надану комбінацію імені користувача та пароля.

source: :rfc:`821` - Simple Mail Transfer Protocol
pt_br: :rfc:`821` - Простий протокол передачі пошти

source: Protocol definition for SMTP. This document covers the model, operating procedure, and protocol details for SMTP.
pt_br: Визначення протоколу для SMTP. У цьому документі описано модель, операційну процедуру та деталі протоколу SMTP.

source: :rfc:`1869` - SMTP Service Extensions
pt_br: :rfc:`1869` - розширення служби SMTP

source: Definition of the ESMTP extensions for SMTP. This describes a framework for extending SMTP with new commands, supporting dynamic discovery of the commands provided by the server, and defines a few additional commands.
pt_br: Визначення розширень ESMTP для SMTP. Тут описано структуру для розширення SMTP новими командами, підтримкою динамічного виявлення команд, які надає сервер, і визначено кілька додаткових команд.

source: SMTP Objects
pt_br: Objetos SMTP

source: An :class:`SMTP` instance has the following methods:
pt_br: Екземпляр :class:`SMTP` має такі методи:

source: Set the debug output level. A value of 1 or ``True`` for *level* results in debug messages for connection and for all messages sent to and received from the server. A value of 2 for *level* results in these messages being timestamped.
pt_br: Установіть вихідний рівень налагодження. Значення 1 або ``True`` для *рівня* призводить до повідомлень про налагодження для з’єднання та для всіх повідомлень, надісланих і отриманих із сервера. Значення 2 для *рівня* призводить до того, що ці повідомлення мають мітку часу.

source: Added debuglevel 2.
pt_br: Adicionado o nível de depuração 2.

source: Send a command *cmd* to the server. The optional argument *args* is simply concatenated to the command, separated by a space.
pt_br: Надішліть на сервер команду *cmd*. Необов’язковий аргумент *args* просто об’єднується з командою, розділяючись пробілом.

source: This returns a 2-tuple composed of a numeric response code and the actual response line (multiline responses are joined into one long line.)
pt_br: Це повертає 2-кортеж, що складається з числового коду відповіді та фактичного рядка відповіді (багаторядкові відповіді об’єднуються в один довгий рядок).

source: In normal operation it should not be necessary to call this method explicitly. It is used to implement other methods and may be useful for testing private extensions.
pt_br: У нормальній роботі не потрібно явно викликати цей метод. Він використовується для реалізації інших методів і може бути корисним для тестування приватних розширень.

source: If the connection to the server is lost while waiting for the reply, :exc:`SMTPServerDisconnected` will be raised.
pt_br: Якщо з’єднання із сервером втрачено під час очікування відповіді, буде виведено :exc:`SMTPServerDisconnected`.

source: Connect to a host on a given port. The defaults are to connect to the local host at the standard SMTP port (25). If the hostname ends with a colon (``':'``) followed by a number, that suffix will be stripped off and the number interpreted as the port number to use. This method is automatically invoked by the constructor if a host is specified during instantiation. Returns a 2-tuple of the response code and message sent by the server in its connection response.
pt_br: Підключіться до хосту на заданому порту. За замовчуванням підключення до локального хосту здійснюється через стандартний порт SMTP (25). Якщо ім’я хоста закінчується двокрапкою (``':''``), після якої йде число, цей суфікс буде видалено, а число інтерпретується як номер порту для використання. Цей метод автоматично викликається конструктором, якщо під час створення екземпляра вказано хост. Повертає 2-кортеж коду відповіді та повідомлення, надіслане сервером у відповіді на підключення.

source: Raises an :ref:`auditing event <auditing>` ``smtplib.connect`` with arguments ``self``, ``host``, ``port``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``smtplib.connect`` com os argumentos ``self``, ``host``, ``port``.

source: Identify yourself to the SMTP server using ``HELO``. The hostname argument defaults to the fully qualified domain name of the local host. The message returned by the server is stored as the :attr:`helo_resp` attribute of the object.
pt_br: Ідентифікуйте себе на сервері SMTP за допомогою ``HELO``. Аргумент імені хоста за замовчуванням відповідає повному доменному імені локального хосту. Повідомлення, яке повертає сервер, зберігається як атрибут :attr:`helo_resp` об’єкта.

source: In normal operation it should not be necessary to call this method explicitly. It will be implicitly called by the :meth:`sendmail` when necessary.
pt_br: У нормальній роботі не потрібно явно викликати цей метод. За потреби його неявно викликає :meth:`sendmail`.

source: Unless you wish to use :meth:`has_extn` before sending mail, it should not be necessary to call this method explicitly. It will be implicitly called by :meth:`sendmail` when necessary.
pt_br: Якщо ви не бажаєте використовувати :meth:`has_extn` перед надсиланням пошти, не потрібно явно викликати цей метод. Його неявно викликає :meth:`sendmail`, коли це необхідно.

source: This method calls :meth:`ehlo` and/or :meth:`helo` if there has been no previous ``EHLO`` or ``HELO`` command this session. It tries ESMTP ``EHLO`` first.
pt_br: Цей метод викликає :meth:`ehlo` та/або :meth:`helo`, якщо в цьому сеансі не було попередньої команди ``EHLO`` або ``HELO``. Спочатку він пробує ESMTP ``EHLO``.

source: The server didn't reply properly to the ``HELO`` greeting.
pt_br: Сервер не відповів належним чином на привітання ``HELO``.

source: Return :const:`True` if *name* is in the set of SMTP service extensions returned by the server, :const:`False` otherwise. Case is ignored.
pt_br: Повернути :const:`True`, якщо *name* є в наборі розширень служби SMTP, які повертає сервер, :const:`False` в іншому випадку. Регістр ігнорується.

source: Check the validity of an address on this server using SMTP ``VRFY``. Returns a tuple consisting of code 250 and a full :rfc:`822` address (including human name) if the user address is valid. Otherwise returns an SMTP error code of 400 or greater and an error string.
pt_br: Перевірте дійсність адреси на цьому сервері за допомогою SMTP ``VRFY``. Повертає кортеж, що складається з коду 250 і повної адреси :rfc:`822` (включаючи ім’я людини), якщо адреса користувача дійсна. В іншому випадку повертає код помилки SMTP 400 або більше та рядок помилки.

source: Many sites disable SMTP ``VRFY`` in order to foil spammers.
pt_br: Muitos servidores desabilitam o SMTP ``VRFY`` para despistar spammers.

source: Log in on an SMTP server that requires authentication. The arguments are the username and the password to authenticate with. If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. This method will return normally if the authentication was successful, or may raise the following exceptions:
pt_br: Увійдіть на сервер SMTP, який вимагає автентифікації. Аргументами є ім’я користувача та пароль для автентифікації. Якщо в цьому сеансі не було попередньої команди ``EHLO`` або ``HELO``, цей метод спочатку намагається ESMTP ``EHLO``. Цей метод повернеться нормально, якщо автентифікація пройшла успішно, або може викликати такі винятки:

source: The server didn't accept the username/password combination.
pt_br: O servidor não aceitou a combinação de usuário/senha.

source: The ``AUTH`` command is not supported by the server.
pt_br: Команда ``AUTH`` не підтримується сервером.

source: No suitable authentication method was found.
pt_br: Відповідний метод автентифікації не знайдено.

source: Each of the authentication methods supported by :mod:`smtplib` are tried in turn if they are advertised as supported by the server. See :meth:`auth` for a list of supported authentication methods. *initial_response_ok* is passed through to :meth:`auth`.
pt_br: Кожен із методів автентифікації, які підтримує :mod:`smtplib`, пробується по черзі, якщо вони оголошуються як такі, що підтримуються сервером. Перегляньте :meth:`auth` список підтримуваних методів автентифікації. *initial_response_ok* передається до :meth:`auth`.

source: Optional keyword argument *initial_response_ok* specifies whether, for authentication methods that support it, an "initial response" as specified in :rfc:`4954` can be sent along with the ``AUTH`` command, rather than requiring a challenge/response.
pt_br: Необов’язковий аргумент ключового слова *initial_response_ok* визначає, чи для методів автентифікації, які його підтримують, "початкову відповідь", як зазначено в :rfc:`4954`, можна надіслати разом із командою ``AUTH`` замість того, щоб вимагати виклик/відповідь .

source: :exc:`SMTPNotSupportedError` may be raised, and the *initial_response_ok* parameter was added.
pt_br: :exc:`SMTPNotSupportedError` може бути викликано, і було додано параметр *initial_response_ok*.

source: Issue an ``SMTP`` ``AUTH`` command for the specified authentication *mechanism*, and handle the challenge response via *authobject*.
pt_br: Видайте команду ``SMTP`` ``AUTH`` для вказаного *механізму* автентифікації та обробіть відповідь на виклик через *authobject*.

source: *mechanism* specifies which authentication mechanism is to be used as argument to the ``AUTH`` command; the valid values are those listed in the ``auth`` element of :attr:`esmtp_features`.
pt_br: *mechanism* вказує, який механізм автентифікації використовуватиметься як аргумент для команди ``AUTH``; дійсними значеннями є ті, що вказані в елементі ``auth`` :attr:`esmtp_features`.

source: If optional keyword argument *initial_response_ok* is true, ``authobject()`` will be called first with no argument. It can return the :rfc:`4954` "initial response" ASCII ``str`` which will be encoded and sent with the ``AUTH`` command as below. If the ``authobject()`` does not support an initial response (e.g. because it requires a challenge), it should return ``None`` when called with ``challenge=None``. If *initial_response_ok* is false, then ``authobject()`` will not be called first with ``None``.
pt_br: Якщо необов’язковий аргумент ключового слова *initial_response_ok* має значення true, спочатку буде викликано ``authobject()`` без аргументу. Він може повертати :rfc:`4954` "початкову відповідь" ASCII ``str``, який буде закодовано та надіслано командою ``AUTH``, як показано нижче. Якщо ``authobject()`` не підтримує початкову відповідь (наприклад, через те, що він вимагає виклику), він повинен повернути ``None`` під час виклику ``challenge=None``. Якщо *initial_response_ok* має значення false, то ``authobject()`` не буде викликано спочатку з ``None``.

source: If the initial response check returns ``None``, or if *initial_response_ok* is false, ``authobject()`` will be called to process the server's challenge response; the *challenge* argument it is passed will be a ``bytes``. It should return ASCII ``str`` *data* that will be base64 encoded and sent to the server.
pt_br: Якщо початкова перевірка відповіді повертає ``None``, або якщо *initial_response_ok* має значення false, ``authobject()`` буде викликано для обробки відповіді на запит сервера; аргумент *challenge*, який він передає, буде ``байтом``. Він має повернути ASCII ``str`` *data*, які будуть закодовані base64 і надіслані на сервер.

source: The ``SMTP`` class provides ``authobjects`` for the ``CRAM-MD5``, ``PLAIN``, and ``LOGIN`` mechanisms; they are named ``SMTP.auth_cram_md5``, ``SMTP.auth_plain``, and ``SMTP.auth_login`` respectively. They all require that the ``user`` and ``password`` properties of the ``SMTP`` instance are set to appropriate values.
pt_br: Клас ``SMTP`` надає ``authobjects`` для механізмів ``CRAM-MD5``, ``PLAIN`` і ``LOGIN``; вони називаються ``SMTP.auth_cram_md5``, ``SMTP.auth_plain`` і ``SMTP.auth_login`` відповідно. Усі вони вимагають, щоб властивості ``користувач`` і ``пароль`` примірника ``SMTP`` були встановлені на відповідні значення.

source: User code does not normally need to call ``auth`` directly, but can instead call the :meth:`login` method, which will try each of the above mechanisms in turn, in the order listed. ``auth`` is exposed to facilitate the implementation of authentication methods not (or not yet) supported directly by :mod:`smtplib`.
pt_br: Код користувача зазвичай не потребує безпосереднього виклику ``auth``, але натомість може викликати метод :meth:`login`, який спробує по черзі кожен із наведених вище механізмів у зазначеному порядку. ``auth`` доступний для полегшення реалізації методів автентифікації, які не (або ще не підтримуються) безпосередньо :mod:`smtplib`.

source: Put the SMTP connection in TLS (Transport Layer Security) mode. All SMTP commands that follow will be encrypted. You should then call :meth:`ehlo` again.
pt_br: Переведіть SMTP-з’єднання в режим TLS (Transport Layer Security). Усі наступні команди SMTP будуть зашифровані. Потім вам слід знову викликати :meth:`ehlo`.

source: If *keyfile* and *certfile* are provided, they are used to create an :class:`ssl.SSLContext`.
pt_br: Якщо надано *keyfile* і *certfile*, вони використовуються для створення :class:`ssl.SSLContext`.

source: Optional *context* parameter is an :class:`ssl.SSLContext` object; This is an alternative to using a keyfile and a certfile and if specified both *keyfile* and *certfile* should be ``None``.
pt_br: Додатковий параметр *context* є об’єктом :class:`ssl.SSLContext`; Це альтернатива використанню файлу ключа та файлу сертифіката, і якщо вказано як *keyfile*, так і *certfile*, має бути ``None``.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first.
pt_br: Якщо в цьому сеансі не було попередньої команди ``EHLO`` або ``HELO``, цей метод спочатку намагається ESMTP ``EHLO``.

source: The server does not support the STARTTLS extension.
pt_br: O servidor não da suporte a extensão STARTTLS.

source: SSL/TLS support is not available to your Python interpreter.
pt_br: Підтримка SSL/TLS недоступна для вашого інтерпретатора Python.

source: The error raised for lack of STARTTLS support is now the :exc:`SMTPNotSupportedError` subclass instead of the base :exc:`SMTPException`.
pt_br: Помилка, викликана відсутністю підтримки STARTTLS, тепер є підкласом :exc:`SMTPNotSupportedError` замість основного :exc:`SMTPException`.

source: Send mail. The required arguments are an :rfc:`822` from-address string, a list of :rfc:`822` to-address strings (a bare string will be treated as a list with 1 address), and a message string. The caller may pass a list of ESMTP options (such as ``8bitmime``) to be used in ``MAIL FROM`` commands as *mail_options*. ESMTP options (such as ``DSN`` commands) that should be used with all ``RCPT`` commands can be passed as *rcpt_options*. (If you need to use different ESMTP options to different recipients you have to use the low-level methods such as :meth:`mail`, :meth:`rcpt` and :meth:`data` to send the message.)
pt_br: Надіслати лист. Необхідними аргументами є рядок адреси :rfc:`822`, список рядків адреси :rfc:`822` (голий рядок розглядатиметься як список з 1 адресою) і рядок повідомлення. Абонент може передати список параметрів ESMTP (наприклад, ``8bitmime``), які будуть використовуватися в командах ``MAIL FROM`` як *mail_options*. Параметри ESMTP (такі як команди ``DSN``), які слід використовувати з усіма командами ``RCPT``, можна передати як *rcpt_options*. (Якщо вам потрібно використовувати різні параметри ESMTP для різних одержувачів, ви повинні використовувати низькорівневі методи, такі як :meth:`mail`, :meth:`rcpt` і :meth:`data` для надсилання повідомлення.)

source: The *from_addr* and *to_addrs* parameters are used to construct the message envelope used by the transport agents. ``sendmail`` does not modify the message headers in any way.
pt_br: Параметри *from_addr* і *to_addrs* використовуються для створення конверта повідомлення, що використовується транспортними агентами. ``sendmail`` жодним чином не змінює заголовки повідомлень.

source: *msg* may be a string containing characters in the ASCII range, or a byte string. A string is encoded to bytes using the ascii codec, and lone ``\r`` and ``\n`` characters are converted to ``\r\n`` characters. A byte string is not modified.
pt_br: *msg* може бути рядком, що містить символи в діапазоні ASCII, або рядком байтів. Рядок кодується в байти за допомогою кодека ascii, а окремі символи ``\r`` і ``\n`` перетворюються на символи ``\r\n``. Рядок байтів не змінено.
