Repository: python/python-docs-pt-br
Catalog: library/socketserver.po
Languages: pt_br

source: :mod:`!socketserver` --- A framework for network servers
pt_br: :mod:`!socketserver` --- Um framework para servidores de rede

source: **Source code:** :source:`Lib/socketserver.py`
pt_br: **Código-fonte:** :source:`Lib/socketserver.py`

source: The :mod:`socketserver` module simplifies the task of writing network servers.
pt_br: O módulo :mod:`socketserver` simplifica a tarefa de escrever servidores de rede.

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: There are four basic concrete server classes:
pt_br: Existem quatro classes básicas de servidores concretos:

source: This uses the internet TCP protocol, which provides for continuous streams of data between the client and server. If *bind_and_activate* is true, the constructor automatically attempts to invoke :meth:`~BaseServer.server_bind` and :meth:`~BaseServer.server_activate`. The other parameters are passed to the :class:`BaseServer` base class.
pt_br: Isso usa o protocolo TCP da internet, que fornece fluxos contínuos de dados entre o cliente e o servidor. Se *bind_and_activate* for true, o construtor tenta automaticamente invocar :meth:`~BaseServer.server_bind` e :meth:`~BaseServer.server_activate`. Os outros parâmetros são passados ​​para a classe base :class:`BaseServer`.

source: This uses datagrams, which are discrete packets of information that may arrive out of order or be lost while in transit. The parameters are the same as for :class:`TCPServer`.
pt_br: Isso usa datagramas, que são pacotes discretos de informações que podem chegar fora de ordem ou ser perdidos durante o trânsito. Os parâmetros são os mesmos de :class:`TCPServer`.

source: These more infrequently used classes are similar to the TCP and UDP classes, but use Unix domain sockets; they're not available on non-Unix platforms. The parameters are the same as for :class:`TCPServer`.
pt_br: Essas classes usadas com menos frequência são semelhantes às classes TCP e UDP, mas usam soquetes de domínio Unix; elas não estão disponíveis em plataformas não Unix. Os parâmetros são os mesmos de :class:`TCPServer`.

source: These four classes process requests :dfn:`synchronously`; each request must be completed before the next request can be started. This isn't suitable if each request takes a long time to complete, because it requires a lot of computation, or because it returns a lot of data which the client is slow to process. The solution is to create a separate process or thread to handle each request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` mix-in classes can be used to support asynchronous behaviour.
pt_br: Essas quatro classes processam solicitações :dfn:`synchronously`; cada solicitação deve ser concluída antes que a próxima solicitação possa ser iniciada. Isso não é adequado se cada solicitação demorar muito para ser concluída, porque exige muita computação ou porque retorna muitos dados que o cliente demora a processar. A solução é criar um processo ou thread separado para lidar com cada solicitação; as classes misturadas :class:`ForkingMixIn` e :class:`ThreadingMixIn` podem ser usadas para oferecer suporte ao comportamento assíncrono.

source: Creating a server requires several steps. First, you must create a request handler class by subclassing the :class:`BaseRequestHandler` class and overriding its :meth:`~BaseRequestHandler.handle` method; this method will process incoming requests. Second, you must instantiate one of the server classes, passing it the server's address and the request handler class. It is recommended to use the server in a :keyword:`with` statement. Then call the :meth:`~BaseServer.handle_request` or :meth:`~BaseServer.serve_forever` method of the server object to process one or many requests. Finally, call :meth:`~BaseServer.server_close` to close the socket (unless you used a :keyword:`!with` statement).
pt_br: Criar um servidor requer várias etapas. Primeiro, você deve criar uma classe de manipulador de solicitação estendendo a classe :class:`BaseRequestHandler` e substituindo seu método :meth:`~BaseRequestHandler.handle`; esse método processará as solicitações recebidas. Segundo, você deve instanciar uma das classes de servidor, passando a ela o endereço do servidor e a classe de manipulador de solicitação. É recomendável usar o servidor em uma instrução :keyword:`with`. Em seguida, chame o método :meth:`~BaseServer.handle_request` ou :meth:`~BaseServer.serve_forever` do objeto do servidor para processar uma ou muitas solicitações. Finalmente, chame :meth:`~BaseServer.server_close` para fechar o soquete (a menos que você tenha usado uma instrução :keyword:`!with`).

source: When inheriting from :class:`ThreadingMixIn` for threaded connection behavior, you should explicitly declare how you want your threads to behave on an abrupt shutdown. The :class:`ThreadingMixIn` class defines an attribute *daemon_threads*, which indicates whether or not the server should wait for thread termination. You should set the flag explicitly if you would like threads to behave autonomously; the default is :const:`False`, meaning that Python will not exit until all threads created by :class:`ThreadingMixIn` have exited.
pt_br: Ao herdar de :class:`ThreadingMixIn` para comportamento de conexão em threads, você deve declarar explicitamente como quer que suas threads se comportem em um desligamento abrupto. A classe :class:`ThreadingMixIn` define um atributo *daemon_threads*, que indica se o servidor deve ou não esperar pelo término da thread. Você deve definir o sinalizador explicitamente se quiser que as threads se comportem de forma autônoma; o padrão é :const:`False`, o que significa que o Python não sairá até que todas as threads criadas por :class:`ThreadingMixIn` tenham sido encerradas.

source: Server classes have the same external methods and attributes, no matter what network protocol they use.
pt_br: As classes de servidor têm os mesmos métodos e atributos externos, não importa qual protocolo de rede eles usam.

source: Server Creation Notes
pt_br: Notas sobre criação do servidor

source: There are five classes in an inheritance diagram, four of which represent synchronous servers of four types::
pt_br: Existem cinco classes em um diagrama de herança, quatro das quais representam servidores síncronos de quatro tipos:

source: Note that :class:`UnixDatagramServer` derives from :class:`UDPServer`, not from :class:`UnixStreamServer` --- the only difference between an IP and a Unix server is the address family.
pt_br: Observe que :class:`UnixDatagramServer` deriva de :class:`UDPServer`, não de :class:`UnixStreamServer` --- a única diferença entre um IP e um servidor Unix é a família de endereços.

source: Forking and threading versions of each type of server can be created using these mix-in classes. For instance, :class:`ThreadingUDPServer` is created as follows::
pt_br: Versões de fork e threads de cada tipo de servidor podem ser criadas usando essas classes mix-in. Por exemplo, :class:`ThreadingUDPServer` é criado da seguinte forma::

source: The mix-in class comes first, since it overrides a method defined in :class:`UDPServer`. Setting the various attributes also changes the behavior of the underlying server mechanism.
pt_br: A classe mix-in vem primeiro, pois ela substitui um método definido em :class:`UDPServer`. Definir os vários atributos também altera o comportamento do mecanismo de servidor subjacente.

source: :class:`ForkingMixIn` and the Forking classes mentioned below are only available on POSIX platforms that support :func:`~os.fork`.
pt_br: :class:`ForkingMixIn` e as classes Forking mencionadas abaixo estão disponíveis apenas em plataformas POSIX que oferecem suporte a :func:`~os.fork`.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` waits until all child processes complete, except if :attr:`block_on_close` attribute is ``False``.
pt_br: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` aguarda até que todos os processos filho sejam concluídos, exceto se o atributo :attr:`block_on_close` for ``False``.

source: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` waits until all non-daemon threads complete, except if :attr:`block_on_close` attribute is ``False``.
pt_br: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` aguarda até que todos as threads não daemon sejam concluídos, exceto se o atributo :attr:`block_on_close` for ``False``.

source: For :class:`ThreadingMixIn` use daemonic threads by setting :data:`ThreadingMixIn.daemon_threads <daemon_threads>` to ``True`` to not wait until threads complete.
pt_br: Para :class:`ThreadingMixIn`, use threads como daemon definindo :data:`ThreadingMixIn.daemon_threads <daemon_threads>` como ``True`` para não esperar até que as threads sejam concluídas.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` and :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` now waits until all child processes and non-daemonic threads complete. Add a new :attr:`ForkingMixIn.block_on_close <block_on_close>` class attribute to opt-in for the pre-3.7 behaviour.
pt_br: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` e :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` agora esperam até que todos os processos filhos e threads não daemon sejam concluídos. Adicione um novo atributo de classe :attr:`ForkingMixIn.block_on_close <block_on_close>` para optar pelo comportamento pré-3.7.

source: These classes are pre-defined using the mix-in classes.
pt_br: Essas classes são predefinidas usando as classes mix-in.

source: The ``ForkingUnixStreamServer`` and ``ForkingUnixDatagramServer`` classes were added.
pt_br: As classes ``ForkingUnixStreamServer`` e ``ForkingUnixDatagramServer`` foram adicionadas.

source: To implement a service, you must derive a class from :class:`BaseRequestHandler` and redefine its :meth:`~BaseRequestHandler.handle` method. You can then run various versions of the service by combining one of the server classes with your request handler class. The request handler class must be different for datagram or stream services. This can be hidden by using the handler subclasses :class:`StreamRequestHandler` or :class:`DatagramRequestHandler`.
pt_br: Para implementar um serviço, você deve derivar uma classe de :class:`BaseRequestHandler` e redefinir seu método :meth:`~BaseRequestHandler.handle`. Você pode então executar várias versões do serviço combinando uma das classes de servidor com sua classe de manipulador de solicitação. A classe de manipulador de solicitação deve ser diferente para serviços de datagrama ou fluxo. Isso pode ser ocultado usando as subclasses de manipulador :class:`StreamRequestHandler` ou :class:`DatagramRequestHandler`.

source: Of course, you still have to use your head! For instance, it makes no sense to use a forking server if the service contains state in memory that can be modified by different requests, since the modifications in the child process would never reach the initial state kept in the parent process and passed to each child. In this case, you can use a threading server, but you will probably have to use locks to protect the integrity of the shared data.
pt_br: Claro, você ainda tem que usar sua cabeça! Por exemplo, não faz sentido usar um servidor de Forking se o serviço contém estado na memória que pode ser modificado por diferentes solicitações, já que as modificações no processo filho nunca atingiriam o estado inicial mantido no processo pai e passado para cada filho. Neste caso, você pode usar um servidor de Threading, mas provavelmente terá que usar travas para proteger a integridade dos dados compartilhados.

source: On the other hand, if you are building an HTTP server where all data is stored externally (for instance, in the file system), a synchronous class will essentially render the service "deaf" while one request is being handled -- which may be for a very long time if a client is slow to receive all the data it has requested. Here a threading or forking server is appropriate.
pt_br: Por outro lado, se você estiver construindo um servidor HTTP onde todos os dados são armazenados externamente (por exemplo, no sistema de arquivos), uma classe síncrona essencialmente tornará o serviço "surdo" enquanto uma solicitação estiver sendo manipulada -- o que pode ser por um tempo muito longo se um cliente for lento para receber todos os dados que solicitou. Aqui, um servidor de Threading ou Forking é apropriado.

source: In some cases, it may be appropriate to process part of a request synchronously, but to finish processing in a forked child depending on the request data. This can be implemented by using a synchronous server and doing an explicit fork in the request handler class :meth:`~BaseRequestHandler.handle` method.
pt_br: Em alguns casos, pode ser apropriado processar parte de uma solicitação de forma síncrona, mas terminar o processamento em um filho bifurcado dependendo dos dados da solicitação. Isso pode ser implementado usando um servidor síncrono e fazendo uma bifurcação explícita no método da classe do manipulador de solicitações :meth:`~BaseRequestHandler.handle`.

source: Another approach to handling multiple simultaneous requests in an environment that supports neither threads nor :func:`~os.fork` (or where these are too expensive or inappropriate for the service) is to maintain an explicit table of partially finished requests and to use :mod:`selectors` to decide which request to work on next (or whether to handle a new incoming request). This is particularly important for stream services where each client can potentially be connected for a long time (if threads or subprocesses cannot be used).
pt_br: Outra abordagem para lidar com múltiplas requisições simultâneas em um ambiente que não oferece suporte a threads nem :func:`~os.fork` (ou onde estes são muito caros ou inapropriados para o serviço) é manter uma tabela explícita de requisições parcialmente finalizadas e usar :mod:`selectors` para decidir em qual requisição trabalhar em seguida (ou se deve lidar com uma nova requisição recebida). Isto é particularmente importante para serviços de fluxo onde cada cliente pode potencialmente ficar conectado por um longo tempo (se threads ou subprocessos não puderem ser usados).

source: Server Objects
pt_br: Objetos Server

source: This is the superclass of all Server objects in the module. It defines the interface, given below, but does not implement most of the methods, which is done in subclasses. The two parameters are stored in the respective :attr:`server_address` and :attr:`RequestHandlerClass` attributes.
pt_br: Esta é a superclasse de todos os objetos Server no módulo. Ela define a interface, dada abaixo, mas não implementa a maioria dos métodos, o que é feito em subclasses. Os dois parâmetros são armazenados nos respectivos atributos :attr:`server_address` e :attr:`RequestHandlerClass`.

source: Return an integer file descriptor for the socket on which the server is listening. This function is most commonly passed to :mod:`selectors`, to allow monitoring multiple servers in the same process.
pt_br: Retorna um descritor de arquivo inteiro para o soquete no qual o servidor está escutando. Esta função é mais comumente passada para :mod:`selectors`, para permitir o monitoramento de múltiplos servidores no mesmo processo.

source: Process a single request. This function calls the following methods in order: :meth:`get_request`, :meth:`verify_request`, and :meth:`process_request`. If the user-provided :meth:`~BaseRequestHandler.handle` method of the handler class raises an exception, the server's :meth:`handle_error` method will be called. If no request is received within :attr:`timeout` seconds, :meth:`handle_timeout` will be called and :meth:`handle_request` will return.
pt_br: Processa uma única solicitação. Esta função chama os seguintes métodos em ordem: :meth:`get_request`, :meth:`verify_request` e :meth:`process_request`. Se o método :meth:`~BaseRequestHandler.handle` fornecido pelo usuário da classe manipuladora levantar uma exceção, o método :meth:`handle_error` do servidor será chamado. Se nenhuma solicitação for recebida dentro de :attr:`timeout` segundos, :meth:`handle_timeout` será chamado e :meth:`handle_request` retornará.

source: Handle requests until an explicit :meth:`shutdown` request. Poll for shutdown every *poll_interval* seconds. Ignores the :attr:`timeout` attribute. It also calls :meth:`service_actions`, which may be used by a subclass or mixin to provide actions specific to a given service. For example, the :class:`ForkingMixIn` class uses :meth:`service_actions` to clean up zombie child processes.
pt_br: Manipula solicitações até uma solicitação explícita :meth:`shutdown`. Sonda para desligamento a cada *poll_interval* segundos. Ignora o atributo :attr:`timeout`. Ele também chama :meth:`service_actions`, que pode ser usado por uma subclasse ou mixin para fornecer ações específicas para um determinado serviço. Por exemplo, a classe :class:`ForkingMixIn` usa :meth:`service_actions` para limpar processos filhos zumbis.

source: Added ``service_actions`` call to the ``serve_forever`` method.
pt_br: Adicionada chamada ``service_actions`` ao método ``serve_forever``.

source: This is called in the :meth:`serve_forever` loop. This method can be overridden by subclasses or mixin classes to perform actions specific to a given service, such as cleanup actions.
pt_br: Isso é chamado no laço :meth:`serve_forever`. Este método pode ser substituído por subclasses ou classes mixin para executar ações específicas para um determinado serviço, como ações de limpeza.

source: Tell the :meth:`serve_forever` loop to stop and wait until it does. :meth:`shutdown` must be called while :meth:`serve_forever` is running in a different thread otherwise it will deadlock.
pt_br: Diz ao laço :meth:`serve_forever` para parar e esperar até que isso aconteça. :meth:`shutdown` deve ser chamado enquanto :meth:`serve_forever` estiver em execução em um thread diferente, caso contrário, ocorrerá um impasse.

source: Clean up the server. May be overridden.
pt_br: Limpa o servidor. Pode ser substituído.

source: The family of protocols to which the server's socket belongs. Common examples are :const:`socket.AF_INET`, :const:`socket.AF_INET6`, and :const:`socket.AF_UNIX`. Subclass the TCP or UDP server classes in this module with class attribute ``address_family = AF_INET6`` set if you want IPv6 server classes.
pt_br: A família de protocolos à qual o soquete do servidor pertence. Exemplos comuns são :const:`socket.AF_INET`, :const:`socket.AF_INET6` e :const:`socket.AF_UNIX`. Subclasse as classes de servidor TCP ou UDP neste módulo com o atributo de classe ``address_family = AF_INET6`` definido se você quiser classes de servidor IPv6.

source: The user-provided request handler class; an instance of this class is created for each request.
pt_br: A classe de manipulador de solicitações fornecida pelo usuário; uma instância dessa classe é criada para cada solicitação.

source: The address on which the server is listening. The format of addresses varies depending on the protocol family; see the documentation for the :mod:`socket` module for details. For internet protocols, this is a tuple containing a string giving the address, and an integer port number: ``('127.0.0.1', 80)``, for example.
pt_br: O endereço no qual o servidor está escutando. O formato dos endereços varia dependendo da família do protocolo; veja a documentação do módulo :mod:`socket` para detalhes. Para protocolos de internet, esta é uma tupla contendo uma string dando o endereço e um número de porta inteiro: ``('127.0.0.1', 80)``, por exemplo.

source: The socket object on which the server will listen for incoming requests.
pt_br: O objeto soquete no qual o servidor ouve para solicitações recebidas.

source: The server classes support the following class variables:
pt_br: As classes de servidor oferecem suporte às seguintes variáveis ​​de classe:

source: Whether the server will allow the reuse of an address. This defaults to :const:`False`, and can be set in subclasses to change the policy.
pt_br: Se o servidor permitirá a reutilização de um endereço. O padrão é :const:`False`, e pode ser definido em subclasses para alterar a política.

source: The size of the request queue. If it takes a long time to process a single request, any requests that arrive while the server is busy are placed into a queue, up to :attr:`request_queue_size` requests. Once the queue is full, further requests from clients will get a "Connection denied" error. The default value is usually 5, but this can be overridden by subclasses.
pt_br: O tamanho da fila de requisições. Se levar muito tempo para processar uma única requisição, todas as requisições que chegarem enquanto o servidor estiver ocupado serão colocadas em uma fila, até :attr:`request_queue_size` requisições. Quando a fila estiver cheia, outras requisições de clientes receberão um erro "Conexão negada". O valor padrão é geralmente 5, mas isso pode ser substituído por subclasses.

source: The type of socket used by the server; :const:`socket.SOCK_STREAM` and :const:`socket.SOCK_DGRAM` are two common values.
pt_br: O tipo de soquete usado pelo servidor; :const:`socket.SOCK_STREAM` e :const:`socket.SOCK_DGRAM` são dois valores comuns.

source: Timeout duration, measured in seconds, or :const:`None` if no timeout is desired. If :meth:`handle_request` receives no incoming requests within the timeout period, the :meth:`handle_timeout` method is called.
pt_br: Duração do tempo limite, medida em segundos, ou :const:`None` se nenhum tempo limite for desejado. Se :meth:`handle_request` não receber nenhuma requisição de entrada dentro do período de tempo limite, o método :meth:`handle_timeout` será chamado.

source: There are various server methods that can be overridden by subclasses of base server classes like :class:`TCPServer`; these methods aren't useful to external users of the server object.
pt_br: Existem vários métodos de servidor que podem ser substituídos por subclasses de classes de servidor base, como :class:`TCPServer`; esses métodos não são úteis para usuários externos do objeto de servidor.

source: Actually processes the request by instantiating :attr:`RequestHandlerClass` and calling its :meth:`~BaseRequestHandler.handle` method.
pt_br: Na verdade, processa a solicitação instanciando :attr:`RequestHandlerClass` e chamando seu método :meth:`~BaseRequestHandler.handle`.

source: Must accept a request from the socket, and return a 2-tuple containing the *new* socket object to be used to communicate with the client, and the client's address.
pt_br: Deve aceitar uma solicitação do soquete e retornar uma tupla de 2 elementos contendo o *novo* objeto de soquete a ser usado para se comunicar com o cliente e o endereço do cliente.

source: This function is called if the :meth:`~BaseRequestHandler.handle` method of a :attr:`RequestHandlerClass` instance raises an exception. The default action is to print the traceback to standard error and continue handling further requests.
pt_br: Esta função é chamada se o método :meth:`~BaseRequestHandler.handle` de uma instância :attr:`RequestHandlerClass` levanta uma exceção. A ação padrão é exibir o traceback para erro padrão e continuar manipulando solicitações futuras.

source: Now only called for exceptions derived from the :exc:`Exception` class.
pt_br: Agora é chamada apenas para exceções derivadas da classe :exc:`Exception`.
