Repository: python/python-docs-pt-br
Catalog: library/socketserver.po
Languages: pt_br

source: This function is called when the :attr:`timeout` attribute has been set to a value other than :const:`None` and the timeout period has passed with no requests being received. The default action for forking servers is to collect the status of any child processes that have exited, while in threading servers this method does nothing.
pt_br: Esta função é chamada quando o atributo :attr:`timeout` foi definido para um valor diferente de :const:`None` e o período de timeout passou sem que nenhuma solicitação tenha sido recebida. A ação padrão para servidores de bifurcação é coletar o status de quaisquer processos filhos que tenham saído, enquanto em servidores de threading esse método não faz nada.

source: Calls :meth:`finish_request` to create an instance of the :attr:`RequestHandlerClass`. If desired, this function can create a new process or thread to handle the request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` classes do this.
pt_br: Chama :meth:`finish_request` para criar uma instância de :attr:`RequestHandlerClass`. Se desejado, esta função pode criar um novo processo ou thread para manipular a solicitação; as classes :class:`ForkingMixIn` e :class:`ThreadingMixIn` fazem isso.

source: Called by the server's constructor to activate the server. The default behavior for a TCP server just invokes :meth:`~socket.socket.listen` on the server's socket. May be overridden.
pt_br: Chamado pelo construtor do servidor para ativar o servidor. O comportamento padrão para um servidor TCP apenas invoca :meth:`~socket.socket.listen` no soquete do servidor. Pode ser substituído.

source: Called by the server's constructor to bind the socket to the desired address. May be overridden.
pt_br: Chamada pelo construtor do servidor para vincular o soquete ao endereço desejado. Pode ser substituída.

source: Must return a Boolean value; if the value is :const:`True`, the request will be processed, and if it's :const:`False`, the request will be denied. This function can be overridden to implement access controls for a server. The default implementation always returns :const:`True`.
pt_br: Deve retornar um valor booleano; se o valor for :const:`True`, a solicitação será processada, e se for :const:`False`, a solicitação será negada. Esta função pode ser substituída para implementar controles de acesso para um servidor. A implementação padrão sempre retorna :const:`True`.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`server_close`.
pt_br: Foi adicionado suporte para o protocolo :term:`gerenciador de contexto`. Sair do gerenciador de contexto é equivalente a chamar :meth:`server_close`.

source: Request Handler Objects
pt_br: Objetos manipulador de requisições

source: This is the superclass of all request handler objects. It defines the interface, given below. A concrete request handler subclass must define a new :meth:`handle` method, and can override any of the other methods. A new instance of the subclass is created for each request.
pt_br: Esta é a superclasse de todos os objetos manipulador de requisições. Ela define a interface, dada abaixo. Uma subclasse concreta do manipulador de requisições deve definir um novo método :meth:`handle` e pode substituir qualquer um dos outros métodos. Uma nova instância da subclasse é criada para cada requisição.

source: Called before the :meth:`handle` method to perform any initialization actions required. The default implementation does nothing.
pt_br: Chamada antes do método :meth:`handle` para executar quaisquer ações de inicialização necessárias. A implementação padrão não faz nada.

source: This function must do all the work required to service a request. The default implementation does nothing. Several instance attributes are available to it; the request is available as :attr:`request`; the client address as :attr:`client_address`; and the server instance as :attr:`server`, in case it needs access to per-server information.
pt_br: Esta função deve fazer todo o trabalho necessário para atender a uma solicitação. A implementação padrão não faz nada. Vários atributos de instância estão disponíveis para ela; a solicitação está disponível como :attr:`request`; o endereço do cliente como :attr:`client_address`; e a instância do servidor como :attr:`server`, caso precise de acesso a informações por servidor.

source: The type of :attr:`request` is different for datagram or stream services. For stream services, :attr:`request` is a socket object; for datagram services, :attr:`request` is a pair of string and socket.
pt_br: O tipo de :attr:`request` é diferente para serviços de datagrama ou fluxo. Para serviços de fluxo, :attr:`request` é um objeto soquete; para serviços de datagrama, :attr:`request` é um par de string e soquete.

source: Called after the :meth:`handle` method to perform any clean-up actions required. The default implementation does nothing. If :meth:`setup` raises an exception, this function will not be called.
pt_br: Chamada após o método :meth:`handle` para executar quaisquer ações de limpeza necessárias. A implementação padrão não faz nada. Se :meth:`setup` levanta uma exceção, esta função não será chamada.

source: The *new* :class:`socket.socket` object to be used to communicate with the client.
pt_br: O *novo* objeto :class:`socket.socket` a ser usado para se comunicar com o cliente.

source: Client address returned by :meth:`BaseServer.get_request`.
pt_br: Endereço do cliente retornado por :meth:`BaseServer.get_request`.

source: :class:`BaseServer` object used for handling the request.
pt_br: Objeto :class:`BaseServer` usado para manipular a solicitação.

source: These :class:`BaseRequestHandler` subclasses override the :meth:`~BaseRequestHandler.setup` and :meth:`~BaseRequestHandler.finish` methods, and provide :attr:`rfile` and :attr:`wfile` attributes.
pt_br: Essas subclasses :class:`BaseRequestHandler` substituem os métodos :meth:`~BaseRequestHandler.setup` e :meth:`~BaseRequestHandler.finish` e fornecem os atributos :attr:`rfile` e :attr:`wfile`.

source: A file object from which receives the request is read. Support the :class:`io.BufferedIOBase` readable interface.
pt_br: Um objeto arquivo do qual recebe a solicitação é lido. Oferece suporte à interface legível :class:`io.BufferedIOBase`.

source: A file object to which the reply is written. Support the :class:`io.BufferedIOBase` writable interface
pt_br: Um objeto arquivo no qual a resposta é escrita. Oferece suporte à interface gravável :class:`io.BufferedIOBase`

source: :attr:`wfile` also supports the :class:`io.BufferedIOBase` writable interface.
pt_br: :attr:`wfile` também oferece suporte à interface gravável :class:`io.BufferedIOBase`.

source: Examples
pt_br: Exemplos

source: :class:`socketserver.TCPServer` Example
pt_br: Exemplo de :class:`socketserver.TCPServer`

source: This is the server side::
pt_br: Este é o lado do servidor::

source: import socketserver class MyTCPHandler(socketserver.BaseRequestHandler): """ The request handler class for our server. It is instantiated once per connection to the server, and must override the handle() method to implement communication to the client. """ def handle(self): # self.request is the TCP socket connected to the client pieces = [b''] total = 0 while b'\n' not in pieces[-1] and total < 10_000: pieces.append(self.request.recv(2000)) total += len(pieces[-1]) self.data = b''.join(pieces) print(f"Received from {self.client_address[0]}:") print(self.data.decode("utf-8")) # just send back the same data, but upper-cased self.request.sendall(self.data.upper()) # after we return, the socket will be closed. if __name__ == "__main__": HOST, PORT = "localhost", 9999 # Create the server, binding to localhost on port 9999 with socketserver.TCPServer((HOST, PORT), MyTCPHandler) as server: # Activate the server; this will keep running until you # interrupt the program with Ctrl-C server.serve_forever()
pt_br: import socketserver class MyTCPHandler(socketserver.BaseRequestHandler): """ A classe de manipulador de solicitação para nosso servidor. Ela é instanciada uma vez por conexão com o servidor e deve substituir o método handle() para implementar a comunicação com o cliente. """ def handle(self): # self.request é o soquete TCP conectado ao cliente pieces = [b''] total = 0 while b'\n' not in pieces[-1] and total < 10_000: pieces.append(self.request.recv(2000)) total += len(pieces[-1]) self.data = b''.join(pieces) print(f"Received from {self.client_address[0]}:") print(self.data.decode("utf-8")) # só envia de volta os mesmos dados, mas em caixa alta self.request.sendall(self.data.upper()) # após retornarmos, o soquete será fechado. if __name__ == "__main__": HOST, PORT = "localhost", 9999 # Cria o servidor, ligando-o ao localhost na porta 9999 with socketserver.TCPServer((HOST, PORT), MyTCPHandler) as server: # Ativa o servidor; isso vai mantê-lo em execução até você # interromper o programa com Ctrl-C server.serve_forever()

source: An alternative request handler class that makes use of streams (file-like objects that simplify communication by providing the standard file interface)::
pt_br: Uma classe de manipulador de solicitações alternativa que faz uso de fluxos (objetos arquivo ou similar que simplificam a comunicação ao fornecer a interface de arquivo padrão)::

source: class MyTCPHandler(socketserver.StreamRequestHandler): def handle(self): # self.rfile is a file-like object created by the handler. # We can now use e.g. readline() instead of raw recv() calls. # We limit ourselves to 10000 bytes to avoid abuse by the sender. self.data = self.rfile.readline(10000).rstrip() print(f"{self.client_address[0]} wrote:") print(self.data.decode("utf-8")) # Likewise, self.wfile is a file-like object used to write back # to the client self.wfile.write(self.data.upper())
pt_br: class MyTCPHandler(socketserver.StreamRequestHandler): def handle(self): # self.rfile é um objeto arquivo ou similar criado pelo manipulador. # Agora podemos usar, por exemplo, readline() em vez de chamadas # brutas a recv(). # Nos limitamos a 10000 bytes para evitar abuso pelo remetente. self.data = self.rfile.readline(10000).rstrip() print(f"{self.client_address[0]} wrote:") print(self.data.decode("utf-8")) # Da mesma forma, self.wfile é um objeto arquivo ou similar para # escrever de volta para o cliente self.wfile.write(self.data.upper())

source: The difference is that the ``readline()`` call in the second handler will call ``recv()`` multiple times until it encounters a newline character, while the the first handler had to use a ``recv()`` loop to accumulate data until a newline itself. If it had just used a single ``recv()`` without the loop it would just have returned what has been received so far from the client. TCP is stream based: data arrives in the order it was sent, but there no correlation between client ``send()`` or ``sendall()`` calls and the number of ``recv()`` calls on the server required to receive it.
pt_br: A diferença é que a chamada ``readline()`` no segundo manipulador chamará ``recv()`` várias vezes até encontrar um caractere de nova linha, enquanto o primeiro manipulador teve que usar um laço ``recv()`` para acumular dados até uma nova linha. Se tivesse usado apenas um único ``recv()`` sem o laço, ele teria retornado apenas o que foi recebido até agora do cliente. O TCP é baseado em fluxo: os dados chegam na ordem em que foram enviados, mas não há correlação entre as chamadas ``send()`` ou ``sendall()`` do cliente e o número de chamadas ``recv()`` no servidor necessárias para recebê-los.

source: This is the client side::
pt_br: Este é o lado do cliente::

source: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # Create a socket (SOCK_STREAM means a TCP socket) with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: # Connect to server and send data sock.connect((HOST, PORT)) sock.sendall(bytes(data, "utf-8")) sock.sendall(b"\n") # Receive data from the server and shut down received = str(sock.recv(1024), "utf-8") print("Sent: ", data) print("Received:", received)
pt_br: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # Cria um soquete (SOCK_STREAM significa um soquete TCP) with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: # Conecta a um servidor e envia dados sock.connect((HOST, PORT)) sock.sendall(bytes(data, "utf-8")) sock.sendall(b"\n") # Recebe dados do servidor e desliga received = str(sock.recv(1024), "utf-8") print("Sent: ", data) print("Received:", received)

source: The output of the example should look something like this:
pt_br: A saída do exemplo deve se parecer com algo como isso:

source: Server:
pt_br: Servidor:

source: Client:
pt_br: Cliente:

source: :class:`socketserver.UDPServer` Example
pt_br: Exemplo :class:`socketserver.UDPServer`

source: import socketserver class MyUDPHandler(socketserver.BaseRequestHandler): """ This class works similar to the TCP handler class, except that self.request consists of a pair of data and client socket, and since there is no connection the client address must be given explicitly when sending data back via sendto(). """ def handle(self): data = self.request[0].strip() socket = self.request[1] print(f"{self.client_address[0]} wrote:") print(data) socket.sendto(data.upper(), self.client_address) if __name__ == "__main__": HOST, PORT = "localhost", 9999 with socketserver.UDPServer((HOST, PORT), MyUDPHandler) as server: server.serve_forever()
pt_br: import socketserver class MyUDPHandler(socketserver.BaseRequestHandler): """ Esta classe funciona de forma semelhante à classe do manipulador TCP, exceto que self.request consiste em um par de dados e soquete do cliente e, como não há conexão, o endereço do cliente deve ser fornecido explicitamente ao enviar dados de volta via sendto(). """ def handle(self): data = self.request[0].strip() socket = self.request[1] print(f"{self.client_address[0]} wrote:") print(data) socket.sendto(data.upper(), self.client_address) if __name__ == "__main__": HOST, PORT = "localhost", 9999 with socketserver.UDPServer((HOST, PORT), MyUDPHandler) as server: server.serve_forever()

source: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # SOCK_DGRAM is the socket type to use for UDP sockets sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM) # As you can see, there is no connect() call; UDP has no connections. # Instead, data is directly sent to the recipient via sendto(). sock.sendto(bytes(data + "\n", "utf-8"), (HOST, PORT)) received = str(sock.recv(1024), "utf-8") print("Sent: ", data) print("Received:", received)
pt_br: import socket import sys HOST, PORT = "localhost", 9999 data = " ".join(sys.argv[1:]) # SOCK_DGRAM é o tipo de soquete para usar para soquetes UDP sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM) # Como você pode ver, não há uma chamada connect(); UDP não tem conexão. # Em vez disso, dados são enviados diretamente para o destinatário via sendto(). sock.sendto(bytes(data + "\n", "utf-8"), (HOST, PORT)) received = str(sock.recv(1024), "utf-8") print("Sent: ", data) print("Received:", received)

source: The output of the example should look exactly like for the TCP server example.
pt_br: A saída do exemplo deve ser exatamente igual à do exemplo do servidor TCP.

source: Asynchronous Mixins
pt_br: Mixins assíncronos

source: To build asynchronous handlers, use the :class:`ThreadingMixIn` and :class:`ForkingMixIn` classes.
pt_br: Para construir manipuladores assíncronos, use as classes :class:`ThreadingMixIn` e :class:`ForkingMixIn`.

source: An example for the :class:`ThreadingMixIn` class::
pt_br: Um exemplo para a classe :class:`ThreadingMixIn`::

source: import socket import threading import socketserver class ThreadedTCPRequestHandler(socketserver.BaseRequestHandler): def handle(self): data = str(self.request.recv(1024), 'ascii') cur_thread = threading.current_thread() response = bytes("{}: {}".format(cur_thread.name, data), 'ascii') self.request.sendall(response) class ThreadedTCPServer(socketserver.ThreadingMixIn, socketserver.TCPServer): pass def client(ip, port, message): with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: sock.connect((ip, port)) sock.sendall(bytes(message, 'ascii')) response = str(sock.recv(1024), 'ascii') print("Received: {}".format(response)) if __name__ == "__main__": # Port 0 means to select an arbitrary unused port HOST, PORT = "localhost", 0 server = ThreadedTCPServer((HOST, PORT), ThreadedTCPRequestHandler) with server: ip, port = server.server_address # Start a thread with the server -- that thread will then start one # more thread for each request server_thread = threading.Thread(target=server.serve_forever) # Exit the server thread when the main thread terminates server_thread.daemon = True server_thread.start() print("Server loop running in thread:", server_thread.name) client(ip, port, "Hello World 1") client(ip, port, "Hello World 2") client(ip, port, "Hello World 3") server.shutdown()
pt_br: import socket import threading import socketserver class ThreadedTCPRequestHandler(socketserver.BaseRequestHandler): def handle(self): data = str(self.request.recv(1024), 'ascii') cur_thread = threading.current_thread() response = bytes("{}: {}".format(cur_thread.name, data), 'ascii') self.request.sendall(response) class ThreadedTCPServer(socketserver.ThreadingMixIn, socketserver.TCPServer): pass def client(ip, port, message): with socket.socket(socket.AF_INET, socket.SOCK_STREAM) as sock: sock.connect((ip, port)) sock.sendall(bytes(message, 'ascii')) response = str(sock.recv(1024), 'ascii') print("Received: {}".format(response)) if __name__ == "__main__": # Porta 0 significa selecionar uma porta não usada arbitrária HOST, PORT = "localhost", 0 server = ThreadedTCPServer((HOST, PORT), ThreadedTCPRequestHandler) with server: ip, port = server.server_address # Inicia uma thread com o servidor -- essa thread vai então # iniciar mais um thread para cada requisição server_thread = threading.Thread(target=server.serve_forever) # Sai da thread do servidor quando a thread principal é encerrada server_thread.daemon = True server_thread.start() print("Server loop running in thread:", server_thread.name) client(ip, port, "Hello World 1") client(ip, port, "Hello World 2") client(ip, port, "Hello World 3") server.shutdown()

source: The :class:`ForkingMixIn` class is used in the same way, except that the server will spawn a new process for each request. Available only on POSIX platforms that support :func:`~os.fork`.
pt_br: A classe :class:`ForkingMixIn` é usada da mesma forma, exceto que o servidor gerará um novo processo para cada solicitação. Disponível apenas em plataformas POSIX que oferecem suporte a :func:`~os.fork`.
