Repository: python/python-docs-pt-br
Catalog: library/sqlite3.po
Languages: pt_br

source: :mod:`!sqlite3` --- DB-API 2.0 interface for SQLite databases
pt_br: :mod:`!sqlite3` ---- interface DB-API 2.0 interface para bancos de dados SQLite

source: **Source code:** :source:`Lib/sqlite3/`
pt_br: **Código-fonte:** :source:`Lib/sqlite3/`

source: SQLite is a C library that provides a lightweight disk-based database that doesn't require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It's also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle.
pt_br: SQLite é uma biblioteca C que fornece um banco de dados leve baseado em disco que não requer um processo de servidor separado e permite acessar o banco de dados usando uma variante não padrão da linguagem de consulta SQL. Algumas aplicações podem usar SQLite para armazenamento interno de dados. Também é possível prototipar um aplicativo usando SQLite e, em seguida, portar o código para um banco de dados maior, como PostgreSQL ou Oracle.

source: The :mod:`!sqlite3` module was written by Gerhard Häring. It provides an SQL interface compliant with the DB-API 2.0 specification described by :pep:`249`, and requires SQLite 3.15.2 or newer.
pt_br: O módulo :mod:`!sqlite3` foi escrito por Gerhard Häring. Ele oferece uma interface SQL compatível com a especificação DB-API 2.0 descrita pela :pep:`249` e requer o SQLite 3.15.2 ou o mais recente.

source: This document includes four main sections:
pt_br: Esse documento inclui quatro seções principais:

source: :ref:`sqlite3-tutorial` teaches how to use the :mod:`!sqlite3` module.
pt_br: :ref:`sqlite3-tutorial` ensina como usar o módulo :mod:`!sqlite3`.

source: :ref:`sqlite3-reference` describes the classes and functions this module defines.
pt_br: :ref:`sqlite3-reference` descreve as classes e funções que este módulo define.

source: :ref:`sqlite3-howtos` details how to handle specific tasks.
pt_br: :ref:`sqlite3-howtos` detalha como lidar com tarefas específicas.

source: :ref:`sqlite3-explanation` provides in-depth background on transaction control.
pt_br: :ref:`sqlite3-explanation` fornece informações detalhadas sobre controle de transações.

source: The SQLite web page; the documentation describes the syntax and the available data types for the supported SQL dialect.
pt_br: A página web do SQLite; a documentação descreve a sintaxe e os tipos de dados disponíveis para o dialeto SQL suportado.

source: Tutorial, reference and examples for learning SQL syntax.
pt_br: Tutoriais, referências e exemplos para aprender a sintaxe SQL.

source: :pep:`249` - Database API Specification 2.0
pt_br: :pep:`249` - Especificação 2.0 da API de banco de dados

source: PEP written by Marc-André Lemburg.
pt_br: PEP escrita por Marc-André Lemburg.

source: In this tutorial, you will create a database of Monty Python movies using basic :mod:`!sqlite3` functionality. It assumes a fundamental understanding of database concepts, including `cursors`_ and `transactions`_.
pt_br: Neste tutorial, você criará um banco de dados de filmes do Monty Python usando a funcionalidade básica :mod:`!sqlite3`. Ele pressupõe uma compreensão fundamental dos conceitos de banco de dados, incluindo `cursores`_ e `transações`_.

source: First, we need to create a new database and open a database connection to allow :mod:`!sqlite3` to work with it. Call :func:`sqlite3.connect` to create a connection to the database :file:`tutorial.db` in the current working directory, implicitly creating it if it does not exist:
pt_br: Primeiro, precisamos criar um novo banco de dados e abrir uma conexão com o banco de dados para permitir que :mod:`!sqlite3` funcione com ele. Chame :func:`sqlite3.connect` para criar uma conexão com o banco de dados :file:`tutorial.db` no diretório de trabalho atual, criando-o implicitamente se ele não existir:

source: The returned :class:`Connection` object ``con`` represents the connection to the on-disk database.
pt_br: O objeto :class:`Connection` ``con`` retornado representa a conexão com o banco de dados em disco.

source: In order to execute SQL statements and fetch results from SQL queries, we will need to use a database cursor. Call :meth:`con.cursor() <Connection.cursor>` to create the :class:`Cursor`:
pt_br: Para executar instruções SQL e buscar resultados de consultas SQL, precisaremos usar um cursor de banco de dados. Chame :meth:`con.cursor() <Connection.cursor>` para criar o :class:`Cursor`:

source: Now that we've got a database connection and a cursor, we can create a database table ``movie`` with columns for title, release year, and review score. For simplicity, we can just use column names in the table declaration -- thanks to the `flexible typing`_ feature of SQLite, specifying the data types is optional. Execute the ``CREATE TABLE`` statement by calling :meth:`cur.execute(...) <Cursor.execute>`:
pt_br: Agora que temos uma conexão com o banco de dados e um cursor, podemos criar uma tabela de banco de dados ``movie`` com colunas para título, ano de lançamento e pontuação da revisão. Para simplificar, podemos apenas usar nomes de colunas na declaração da tabela - graças ao recurso `tipagem flexível`_ do SQLite, especificar os tipos de dados é opcional. Execute a instrução ``CREATE TABLE`` chamando :meth:`cur.execute(...) <Cursor.execute>`:

source: We can verify that the new table has been created by querying the ``sqlite_master`` table built-in to SQLite, which should now contain an entry for the ``movie`` table definition (see `The Schema Table`_ for details). Execute that query by calling :meth:`cur.execute(...) <Cursor.execute>`, assign the result to ``res``, and call :meth:`res.fetchone() <Cursor.fetchone>` to fetch the resulting row:
pt_br: Podemos verificar se a nova tabela foi criada consultando a tabela embutida ``sqlite_master`` no SQLite, que agora deve conter uma entrada para a definição da tabela ``movie`` (veja `The Schema Table`_ para detalhes). Execute essa consulta chamando :meth:`cur.execute(...) <Cursor.execute>`, atribua o resultado a ``res`` e chame :meth:`res.fetchone() <Cursor.fetchone>` para buscar a linha resultante:

source: We can see that the table has been created, as the query returns a :class:`tuple` containing the table's name. If we query ``sqlite_master`` for a non-existent table ``spam``, :meth:`!res.fetchone` will return ``None``:
pt_br: Podemos ver que a tabela foi criada, pois a consulta retorna :class:`tuple` contendo o nome da tabela. Se fizermos uma consulta ``sqlite_master`` para uma tabela inexistente ``spam``, :meth:`!res.fetchone` ela retornará ``None``:

source: Now, add two rows of data supplied as SQL literals by executing an ``INSERT`` statement, once again by calling :meth:`cur.execute(...) <Cursor.execute>`:
pt_br: Agora, adicione duas linhas de dados fornecidos como literais SQL executando uma instrução ``INSERT``, mais uma vez chamando :meth:`cur.execute(...) <Cursor.execute>`:

source: The ``INSERT`` statement implicitly opens a transaction, which needs to be committed before changes are saved in the database (see :ref:`sqlite3-controlling-transactions` for details). Call :meth:`con.commit() <Connection.commit>` on the connection object to commit the transaction:
pt_br: A instrução ``INSERT`` abre implicitamente uma transação, que precisa ser confirmada antes que as alterações sejam salvas no banco de dados (veja :ref:`sqlite3-controlling-transactions` para detalhes). Chame :meth:`con.commit() <Connection.commit>` no objeto de conexão para confirmar a transação:

source: We can verify that the data was inserted correctly by executing a ``SELECT`` query. Use the now-familiar :meth:`cur.execute(...) <Cursor.execute>` to assign the result to ``res``, and call :meth:`res.fetchall() <Cursor.fetchall>` to return all resulting rows:
pt_br: Podemos verificar que os dados foram inseridos corretamente executando uma consulta ``SELECT``. Use o já conhecido :meth:`cur.execute(...) <Cursor.execute>` para atribuir o resultado a ``res`` e chame :meth:`res.fetchall() <Cursor.fetchall>` para retornar todas as linhas resultantes.

source: The result is a :class:`list` of two :class:`!tuple`\s, one per row, each containing that row's ``score`` value.
pt_br: O resultado é uma :class:`list` de duas :class:`!tuple`\s, uma por linha, cada uma contendo o valor ``score`` dessa linha.

source: Now, insert three more rows by calling :meth:`cur.executemany(...) <Cursor.executemany>`:
pt_br: Agora, insira mais três linhas chamando :meth:`cur.executemany(...) <Cursor.executemany>`:

source: data = [ ("Monty Python Live at the Hollywood Bowl", 1982, 7.9), ("Monty Python's The Meaning of Life", 1983, 7.5), ("Monty Python's Life of Brian", 1979, 8.0), ] cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data) con.commit() # Remember to commit the transaction after executing INSERT.
pt_br: data = [ ("Monty Python Live at the Hollywood Bowl", 1982, 7.9), ("Monty Python's The Meaning of Life", 1983, 7.5), ("Monty Python's Life of Brian", 1979, 8.0), ] cur.executemany("INSERT INTO movie VALUES(?, ?, ?)", data) con.commit() # Lembre-sede executar a transação após o INSERT.

source: Notice that ``?`` placeholders are used to bind ``data`` to the query. Always use placeholders instead of :ref:`string formatting <tut-formatting>` to bind Python values to SQL statements, to avoid `SQL injection attacks`_ (see :ref:`sqlite3-placeholders` for more details).
pt_br: Observe que espaços reservados ``?`` são usados para vincular ``data`` à consulta. Sempre use espaços reservados em vez de :ref:`formatação de string <tut-formatting>` para vincular valores Python a instruções SQL, para evitar `ataques de injeção de SQL`_ (consulte :ref:`sqlite3-placeholders` para mais detalhes).

source: We can verify that the new rows were inserted by executing a ``SELECT`` query, this time iterating over the results of the query:
pt_br: Podemos verificar que as novas linhas foram inseridas executando uma consulta ``SELECT``, desta vez iterando sobre os resultados da consulta.

source: Each row is a two-item :class:`tuple` of ``(year, title)``, matching the columns selected in the query.
pt_br: Cada linha é uma :class:`tuple` de dois itens ``(year, title)``, correspondendo às colunas selecionadas na consulta.

source: Finally, verify that the database has been written to disk by calling :meth:`con.close() <Connection.close>` to close the existing connection, opening a new one, creating a new cursor, then querying the database:
pt_br: Finalmente, verifique se o banco de dados foi gravado no disco chamando :meth:`con.close() <Connection.close>` para fechar a conexão existente, abrir uma nova, criar um novo cursor e, em seguida, consultar o banco de dados.

source: You've now created an SQLite database using the :mod:`!sqlite3` module, inserted data and retrieved values from it in multiple ways.
pt_br: Você agora criou um banco de dados SQLite usando o módulo :mod:`!sqlite3`, inseriu dados e recuperou valores dele de várias maneiras.

source: :ref:`sqlite3-howtos` for further reading:
pt_br: :ref:`sqlite3-howtos` para leitura adicional:

source: :ref:`sqlite3-explanation` for in-depth background on transaction control.
pt_br: :ref:`sqlite3-explanation` para obter informações detalhadas sobre o controle de transações.

source: Reference
pt_br: Referência

source: Module functions
pt_br: Funções do módulo

source: Open a connection to an SQLite database.
pt_br: Abra uma conexão com um banco de dados SQLite.

source: Parameters
pt_br: Parâmetros

source: The path to the database file to be opened. You can pass ``":memory:"`` to create an `SQLite database existing only in memory <https://sqlite.org/inmemorydb.html>`_, and open a connection to it.
pt_br: O caminho para o arquivo do banco de dados a ser aberto. Você pode passar ``":memory:"`` para criar um banco de dados `SQLite que existirá apenas na memória <https://sqlite.org/inmemorydb.html>`_, e abrir uma conexão com ele.

source: How many seconds the connection should wait before raising an :exc:`OperationalError` when a table is locked. If another connection opens a transaction to modify a table, that table will be locked until the transaction is committed. Default five seconds.
pt_br: Quantos segundos a conexão deve aguardar antes de levantar uma exceção :exc:`OperationalError` quando uma tabela estiver bloqueada. Se outra conexão abrir uma transação para modificar uma tabela, essa tabela permanecerá bloqueada até que a transação seja confirmada. O padrão é cinco segundos.

source: Control whether and how data types not :ref:`natively supported by SQLite <sqlite3-types>` are looked up to be converted to Python types, using the converters registered with :func:`register_converter`. Set it to any combination (using ``|``, bitwise or) of :const:`PARSE_DECLTYPES` and :const:`PARSE_COLNAMES` to enable this. Column names takes precedence over declared types if both flags are set. By default (``0``), type detection is disabled.
pt_br: Контролируйте, будут ли типы данных, не :ref:`изначально поддерживаемые SQLite <sqlite3-types>`, искаться для преобразования в типы Python, используя конвертеры, зарегистрированные с помощью :func:`register_converter`. Установите его в любую комбинацию (используя ``|``, побитовое ИЛИ) :const:`PARSE_DECLTYPES` и :const:`PARSE_COLNAMES`, чтобы включить это. Имена столбцов имеют приоритет над объявленными типами, если установлены оба флага. По умолчанию (``0``) определение типа отключено.

source: Control legacy transaction handling behaviour. See :attr:`Connection.isolation_level` and :ref:`sqlite3-transaction-control-isolation-level` for more information. Can be ``"DEFERRED"`` (default), ``"EXCLUSIVE"`` or ``"IMMEDIATE"``; or ``None`` to disable opening transactions implicitly. Has no effect unless :attr:`Connection.autocommit` is set to :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL` (the default).
pt_br: Управляйте поведением обработки устаревших транзакций. См. :attr:`Connection.isolation_level` и :ref:`sqlite3-transaction-control-isolation-level` для получения дополнительной информации. Может быть ``"ОТЛОЖЕНО"`` (по умолчанию), ``"ЭКСКЛЮЗИВНО"`` или ``"НЕМЕДЛЕННО"``; или ``None``, чтобы неявно запретить открытие транзакций. Не имеет никакого эффекта, если для :attr:`Connection.autocommit` не установлено значение :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL` (по умолчанию).

source: If ``True`` (default), :exc:`ProgrammingError` will be raised if the database connection is used by a thread other than the one that created it. If ``False``, the connection may be accessed in multiple threads; write operations may need to be serialized by the user to avoid data corruption. See :attr:`threadsafety` for more information.
pt_br: Если ``True`` (по умолчанию), :exc:`ProgrammingError` будет вызвано, если соединение с базой данных используется потоком, отличным от того, который его создал. Если ``False``, доступ к соединению может осуществляться в нескольких потоках; Операции записи могут потребоваться сериализовать пользователю, чтобы избежать повреждения данных. См. :attr:`threadsafety` для получения дополнительной информации.

source: A custom subclass of :class:`Connection` to create the connection with, if not the default :class:`Connection` class.
pt_br: Пользовательский подкласс :class:`Connection` для создания соединения с классом :class:`Connection` (если не с классом по умолчанию).

source: The number of statements that :mod:`!sqlite3` should internally cache for this connection, to avoid parsing overhead. By default, 128 statements.
pt_br: Число операторов, которые :mod:`!sqlite3` должен внутренне кэшировать для этого соединения, чтобы избежать накладных расходов на анализ. По умолчанию 128 операторов.

source: If set to ``True``, *database* is interpreted as a :abbr:`URI (Uniform Resource Identifier)` with a file path and an optional query string. The scheme part *must* be ``"file:"``, and the path can be relative or absolute. The query string allows passing parameters to SQLite, enabling various :ref:`sqlite3-uri-tricks`.
pt_br: Если установлено значение True, *database* интерпретируется как :abbr:`URI (универсальный идентификатор ресурса)` с путем к файлу и дополнительной строкой запроса. Часть схемы *должна* быть ``"file:"``, а путь может быть относительным или абсолютным. Строка запроса позволяет передавать параметры в SQLite, используя различные трюки sqlite3-uri.

source: Control :pep:`249` transaction handling behaviour. See :attr:`Connection.autocommit` and :ref:`sqlite3-transaction-control-autocommit` for more information. *autocommit* currently defaults to :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL`. The default will change to ``False`` in a future Python release.
pt_br: Управляйте :pep:`249` поведением обработки транзакций. См. :attr:`Connection.autocommit` и :ref:`sqlite3-transaction-control-autocommit` для получения дополнительной информации. *autocommit* в настоящее время по умолчанию имеет значение :const:`~sqlite3.LEGACY_TRANSACTION_CONTROL`. В будущем выпуске Python значение по умолчанию изменится на «False».

source: Return type
pt_br: Тип возврата

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect`` with argument ``database``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``sqlite3.connect`` com o argumento ``database``.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.connect/handle`` with argument ``connection_handle``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``sqlite3.connect/handle`` com o argumento ``connection_handle``.

source: Added the *uri* parameter.
pt_br: Adicionado o parâmetro *uri*.

source: *database* can now also be a :term:`path-like object`, not only a string.
pt_br: *database* тепер також може бути :term:`path-like object`, а не лише рядком.

source: Added the ``sqlite3.connect/handle`` auditing event.
pt_br: Додано подію аудиту ``sqlite3.connect/handle``.

source: Added the *autocommit* parameter.
pt_br: Добавлен параметр *autocommit*.

source: Positional use of the parameters *timeout*, *detect_types*, *isolation_level*, *check_same_thread*, *factory*, *cached_statements*, and *uri* is deprecated. They will become keyword-only parameters in Python 3.15.
pt_br: Позиционное использование параметров *timeout*, *detect_types*, *isolation_level*, *check_same_thread*, *factory*, *cached_statements* и *uri* устарело. В Python 3.15 они станут параметрами только для ключевых слов.

source: Return ``True`` if the string *statement* appears to contain one or more complete SQL statements. No syntactic verification or parsing of any kind is performed, other than checking that there are no unclosed string literals and the statement is terminated by a semicolon.
pt_br: Возвращайте ``True``, если строка *оператор* содержит один или несколько полных операторов SQL. Никакая синтаксическая проверка или синтаксический анализ не выполняется, кроме проверки отсутствия незамкнутых строковых литералов и завершения оператора точкой с запятой.

source: For example:
pt_br: Por exemplo:

source: This function may be useful during command-line input to determine if the entered text seems to form a complete SQL statement, or if additional input is needed before calling :meth:`~Cursor.execute`.
pt_br: Эта функция может быть полезна во время ввода командной строки, чтобы определить, образует ли введенный текст полный оператор SQL, или требуется ли дополнительный ввод перед вызовом :meth:`~Cursor.execute`.

source: See :func:`!runsource` in :source:`Lib/sqlite3/__main__.py` for real-world use.
pt_br: См. :func:`!runsource` в :source:`Lib/sqlite3/__main__.py` для использования в реальных условиях.

source: Enable or disable callback tracebacks. By default you will not get any tracebacks in user-defined functions, aggregates, converters, authorizer callbacks etc. If you want to debug them, you can call this function with *flag* set to ``True``. Afterwards, you will get tracebacks from callbacks on :data:`sys.stderr`. Use ``False`` to disable the feature again.
pt_br: Включите или отключите обратные трассировки обратного вызова. По умолчанию вы не будете получать никаких обратных трассировок в пользовательских функциях, агрегатах, конвертерах, обратных вызовах авторизатора и т. д. Если вы хотите их отладить, вы можете вызвать эту функцию с *flag*, установленным в ``True``. После этого вы получите обратные трассировки от обратных вызовов в :data:`sys.stderr`. Используйте «False», чтобы снова отключить эту функцию.

source: Errors in user-defined function callbacks are logged as unraisable exceptions. Use an :func:`unraisable hook handler <sys.unraisablehook>` for introspection of the failed callback.
pt_br: Ошибки в обратных вызовах пользовательских функций регистрируются как невызываемые исключения. Используйте :func:`unraisable обработчик перехвата <sys.unraisablehook>` для самоанализа неудачного обратного вызова.

source: Register an *adapter* :term:`callable` to adapt the Python type *type* into an SQLite type. The adapter is called with a Python object of type *type* as its sole argument, and must return a value of a :ref:`type that SQLite natively understands <sqlite3-types>`.
pt_br: Зарегистрируйте *адаптер* :term:`callable`, чтобы адаптировать тип *type* Python к типу SQLite. Адаптер вызывается с объектом Python типа *type* в качестве единственного аргумента и должен возвращать значение типа :ref:`, который SQLite изначально понимает, <sqlite3-types>`.

source: Register the *converter* :term:`callable` to convert SQLite objects of type *typename* into a Python object of a specific type. The converter is invoked for all SQLite values of type *typename*; it is passed a :class:`bytes` object and should return an object of the desired Python type. Consult the parameter *detect_types* of :func:`connect` for information regarding how type detection works.
pt_br: Зарегистрируйте *converter* :term:`callable` для преобразования объектов SQLite типа *typename* в объект Python определенного типа. Конвертер вызывается для всех значений SQLite типа *typename*; ему передается объект :class:`bytes`, и он должен возвращать объект желаемого типа Python. Обратитесь к параметру *detect_types* функции :func:`connect` для получения информации о том, как работает определение типа.

source: Note: *typename* and the name of the type in your query are matched case-insensitively.
pt_br: Примечание. *typename* и имя типа в вашем запросе сопоставляются без учета регистра.

source: Module constants
pt_br: Constantes do módulo

source: Set :attr:`~Connection.autocommit` to this constant to select old style (pre-Python 3.12) transaction control behaviour. See :ref:`sqlite3-transaction-control-isolation-level` for more information.
pt_br: Установите для :attr:`~Connection.autocommit` эту константу, чтобы выбрать поведение управления транзакциями в старом стиле (до Python 3.12). Дополнительную информацию см. в разделе sqlite3-transaction-control-isolation-level.

source: Pass this flag value to the *detect_types* parameter of :func:`connect` to look up a converter function using the declared types for each column. The types are declared when the database table is created. :mod:`!sqlite3` will look up a converter function using the first word of the declared type as the converter dictionary key. For example:
pt_br: Передайте значение этого флага в параметр *detect_types* функции :func:`connect`, чтобы найти функцию конвертера, используя объявленные типы для каждого столбца. Типы объявляются при создании таблицы базы данных. :mod:`!sqlite3` будет искать функцию конвертера, используя первое слово объявленного типа в качестве ключа словаря конвертера. Например:
