Repository: python/python-docs-pt-br
Catalog: library/sqlite3.po
Languages: pt_br

source: Passing *progress_handler* as a keyword argument is deprecated. The parameter will become positional-only in Python 3.15.
pt_br: Передача *progress_handler* в качестве аргумента ключевого слова устарела. В Python 3.15 параметр станет только позиционным.

source: Register :term:`callable` *trace_callback* to be invoked for each SQL statement that is actually executed by the SQLite backend.
pt_br: Зарегистрируйте :term:`callable` *trace_callback*, чтобы он вызывался для каждого оператора SQL, который фактически выполняется серверной частью SQLite.

source: The only argument passed to the callback is the statement (as :class:`str`) that is being executed. The return value of the callback is ignored. Note that the backend does not only run statements passed to the :meth:`Cursor.execute` methods. Other sources include the :ref:`transaction management <sqlite3-controlling-transactions>` of the :mod:`!sqlite3` module and the execution of triggers defined in the current database.
pt_br: Единственный аргумент, передаваемый обратному вызову, — это оператор (как :class:`str`), который выполняется. Возвращаемое значение обратного вызова игнорируется. Обратите внимание, что серверная часть не только выполняет операторы, переданные методам :meth:`Cursor.execute`. Другие источники включают в себя :ref:`управление транзакциями <sqlite3-controlling-transactions>` модуля :mod:`!sqlite3` и выполнение триггеров, определенных в текущей базе данных.

source: Passing ``None`` as *trace_callback* will disable the trace callback.
pt_br: Передача None в качестве *trace_callback* отключит обратный вызов трассировки.

source: Exceptions raised in the trace callback are not propagated. As a development and debugging aid, use :meth:`~sqlite3.enable_callback_tracebacks` to enable printing tracebacks from exceptions raised in the trace callback.
pt_br: Винятки, викликані зворотним викликом трасування, не поширюються. Як допомога при розробці та налагодженні використовуйте :meth:`~sqlite3.enable_callback_tracebacks`, щоб увімкнути друк трасування з винятків, викликаних у зворотному виклику трасування.

source: Passing *trace_callback* as a keyword argument is deprecated. The parameter will become positional-only in Python 3.15.
pt_br: Передача *trace_callback* в качестве аргумента ключевого слова устарела. В Python 3.15 параметр станет только позиционным.

source: Enable the SQLite engine to load SQLite extensions from shared libraries if *enabled* is ``True``; else, disallow loading SQLite extensions. SQLite extensions can define new functions, aggregates or whole new virtual table implementations. One well-known extension is the fulltext-search extension distributed with SQLite.
pt_br: Включите механизм SQLite для загрузки расширений SQLite из общих библиотек, если *enabled* имеет значение ``True``; в противном случае запретите загрузку расширений SQLite. Расширения SQLite могут определять новые функции, агрегаты или совершенно новые реализации виртуальных таблиц. Одним из широко известных расширений является расширение полнотекстового поиска, поставляемое вместе с SQLite.

source: The :mod:`!sqlite3` module is not built with loadable extension support by default, because some platforms (notably macOS) have SQLite libraries which are compiled without this feature. To get loadable extension support, you must pass the :option:`--enable-loadable-sqlite-extensions` option to :program:`configure`.
pt_br: Модуль :mod:`!sqlite3` по умолчанию не имеет поддержки загружаемых расширений, поскольку на некоторых платформах (особенно macOS) есть библиотеки SQLite, которые компилируются без этой функции. Чтобы получить поддержку загружаемых расширений, вы должны передать параметр :option:`--enable-loadable-sqlite-extensions` в :program:`configure`.

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.enable_load_extension`` with arguments ``connection``, ``enabled``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``sqlite3.enable_load_extension`` com os argumentos ``connection``, ``enabled``.

source: Added the ``sqlite3.enable_load_extension`` auditing event.
pt_br: Додано подію аудиту sqlite3.enable_load_extension.

source: Load an SQLite extension from a shared library. Enable extension loading with :meth:`enable_load_extension` before calling this method.
pt_br: Загрузите расширение SQLite из общей библиотеки. Включите загрузку расширения с помощью :meth:`enable_load_extension` перед вызовом этого метода.

source: The path to the SQLite extension.
pt_br: Путь к расширению SQLite.

source: Entry point name. If ``None`` (the default), SQLite will come up with an entry point name of its own; see the SQLite docs `Loading an Extension`_ for details.
pt_br: Название точки входа. Если «Нет» (по умолчанию), SQLite предложит собственное имя точки входа; подробности см. в документации по SQLite «Загрузка расширения».

source: Raises an :ref:`auditing event <auditing>` ``sqlite3.load_extension`` with arguments ``connection``, ``path``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``sqlite3.load_extension`` com os argumentos ``connection``, ``path``.

source: Added the ``sqlite3.load_extension`` auditing event.
pt_br: Додано подію аудиту ``sqlite3.load_extension``.

source: Added the *entrypoint* parameter.
pt_br: Добавлен параметр *entrypoint*.

source: Return an :term:`iterator` to dump the database as SQL source code. Useful when saving an in-memory database for later restoration. Similar to the ``.dump`` command in the :program:`sqlite3` shell.
pt_br: Верните :term:`iterator`, чтобы выгрузить базу данных в виде исходного кода SQL. Полезно при сохранении базы данных в памяти для последующего восстановления. Аналогично команде ``.dump`` в оболочке :program:`sqlite3`.

source: An optional ``LIKE`` pattern for database objects to dump, e.g. ``prefix_%``. If ``None`` (the default), all database objects will be included.
pt_br: Необязательный шаблон ``LIKE`` для объектов базы данных, которые нужно выгрузить, например ``prefix_%``. Если «Нет» (по умолчанию), все объекты базы данных будут включены.

source: Added the *filter* parameter.
pt_br: Adicionado o parâmetro *filter*.

source: Create a backup of an SQLite database.
pt_br: Создайте резервную копию базы данных SQLite.

source: Works even if the database is being accessed by other clients or concurrently by the same connection.
pt_br: Работает, даже если к базе данных обращаются другие клиенты или одновременно по тому же соединению.

source: The database connection to save the backup to.
pt_br: Соединение с базой данных, в котором сохраняется резервная копия.

source: The number of pages to copy at a time. If equal to or less than ``0``, the entire database is copied in a single step. Defaults to ``-1``.
pt_br: Количество страниц, копируемых за один раз. Если оно равно или меньше «0», вся база данных копируется за один шаг. По умолчанию ``-1``.

source: If set to a :term:`callable`, it is invoked with three integer arguments for every backup iteration: the *status* of the last iteration, the *remaining* number of pages still to be copied, and the *total* number of pages. Defaults to ``None``.
pt_br: Если установлено значение :term:`callable`, он вызывается с тремя целочисленными аргументами для каждой итерации резервного копирования: *статус* последней итерации, *оставшееся* количество страниц, которые еще предстоит скопировать, и *общее* количество страниц. По умолчанию установлено значение «Нет».

source: The name of the database to back up. Either ``"main"`` (the default) for the main database, ``"temp"`` for the temporary database, or the name of a custom database as attached using the ``ATTACH DATABASE`` SQL statement.
pt_br: Имя базы данных для резервного копирования. Либо ``"main"`` (по умолчанию) для основной базы данных, ``"temp"`` для временной базы данных, либо имя пользовательской базы данных, прикрепленное с помощью оператора SQL ``ATTACH DATABASE``.

source: The number of seconds to sleep between successive attempts to back up remaining pages.
pt_br: Количество секунд ожидания между последовательными попытками резервного копирования оставшихся страниц.

source: Example 1, copy an existing database into another:
pt_br: Пример 1: копирование существующей базы данных в другую:

source: Example 2, copy an existing database into a transient copy:
pt_br: Пример 2: скопируйте существующую базу данных во временную копию:

source: Get a connection runtime limit.
pt_br: Получите ограничение времени выполнения соединения.

source: The `SQLite limit category`_ to be queried.
pt_br: `Категория ограничения SQLite`_ для запроса.

source: If *category* is not recognised by the underlying SQLite library.
pt_br: Если *категория* не распознается базовой библиотекой SQLite.

source: Example, query the maximum length of an SQL statement for :class:`Connection` ``con`` (the default is 1000000000):
pt_br: Например, запросите максимальную длину оператора SQL для :class:`Connection` ``con`` (по умолчанию — 1000000000):

source: Set a connection runtime limit. Attempts to increase a limit above its hard upper bound are silently truncated to the hard upper bound. Regardless of whether or not the limit was changed, the prior value of the limit is returned.
pt_br: Установите ограничение времени выполнения соединения. Попытки увеличить предел выше его жесткой верхней границы молча обрезаются до жесткой верхней границы. Независимо от того, был ли изменен лимит, возвращается предыдущее значение лимита.

source: The `SQLite limit category`_ to be set.
pt_br: `_ Категория ограничения SQLite`_, которую необходимо установить.

source: The value of the new limit. If negative, the current limit is unchanged.
pt_br: Значение нового лимита. Если отрицательно, то предел тока не изменяется.

source: Example, limit the number of attached databases to 1 for :class:`Connection` ``con`` (the default limit is 10):
pt_br: Например, ограничьте количество подключенных баз данных до 1 для :class:`Connection` ``con`` (ограничение по умолчанию — 10):

source: Query a boolean connection configuration option.
pt_br: Запросить логический параметр конфигурации соединения.

source: A :ref:`SQLITE_DBCONFIG code <sqlite3-dbconfig-constants>`.
pt_br: Код SQLITE_DBCONFIG <sqlite3-dbconfig-constants>.

source: Set a boolean connection configuration option.
pt_br: Установите логический параметр конфигурации соединения.

source: ``True`` if the configuration option should be enabled (default); ``False`` if it should be disabled.
pt_br: ``True``, если опция конфигурации должна быть включена (по умолчанию); ``False``, если его следует отключить.

source: Serialize a database into a :class:`bytes` object. For an ordinary on-disk database file, the serialization is just a copy of the disk file. For an in-memory database or a "temp" database, the serialization is the same sequence of bytes which would be written to disk if that database were backed up to disk.
pt_br: Сериализуйте базу данных в объект :class:`bytes`. Для обычного файла базы данных на диске сериализация представляет собой просто копию дискового файла. Для базы данных в памяти или «временной» базы данных сериализация представляет собой ту же последовательность байтов, которая была бы записана на диск, если бы эта база данных была скопирована на диск.

source: The database name to be serialized. Defaults to ``"main"``.
pt_br: Имя базы данных для сериализации. По умолчанию ``"main"``.

source: This method is only available if the underlying SQLite library has the serialize API.
pt_br: Этот метод доступен только в том случае, если базовая библиотека SQLite имеет API сериализации.

source: Deserialize a :meth:`serialized <serialize>` database into a :class:`Connection`. This method causes the database connection to disconnect from database *name*, and reopen *name* as an in-memory database based on the serialization contained in *data*.
pt_br: Десериализовать :meth:`сериализованную <serialize>` базу данных в :class:`Connection`. Этот метод приводит к отключению соединения с базой данных *name* и повторному открытию *name* как базы данных в памяти на основе сериализации, содержащейся в *data*.

source: A serialized database.
pt_br: Сериализованная база данных.

source: The database name to deserialize into. Defaults to ``"main"``.
pt_br: Имя базы данных для десериализации. По умолчанию ``"main"``.

source: If the database connection is currently involved in a read transaction or a backup operation.
pt_br: Если соединение с базой данных в данный момент участвует в транзакции чтения или операции резервного копирования.

source: If *data* does not contain a valid SQLite database.
pt_br: Если *data* не содержит действующую базу данных SQLite.

source: If :func:`len(data) <len>` is larger than ``2**63 - 1``.
pt_br: Если :func:`len(data) <len>` больше, чем ``2**63 - 1``.

source: This method is only available if the underlying SQLite library has the deserialize API.
pt_br: Этот метод доступен только в том случае, если базовая библиотека SQLite имеет API десериализации.

source: This attribute controls :pep:`249`-compliant transaction behaviour. :attr:`!autocommit` has three allowed values:
pt_br: Этот атрибут управляет поведением транзакций, совместимым с :pep:`249`. :attr:`!autocommit` имеет три допустимых значения:

source: ``False``: Select :pep:`249`-compliant transaction behaviour, implying that :mod:`!sqlite3` ensures a transaction is always open. Use :meth:`commit` and :meth:`rollback` to close transactions.
pt_br: ``False``: выберите поведение транзакции, совместимое с :pep:`249`, подразумевая, что :mod:`!sqlite3` гарантирует, что транзакция всегда открыта. Используйте :meth:`commit` и :meth:`rollback` для закрытия транзакций.

source: This is the recommended value of :attr:`!autocommit`.
pt_br: Это рекомендуемое значение :attr:`!autocommit`.

source: ``True``: Use SQLite's `autocommit mode`_. :meth:`commit` and :meth:`rollback` have no effect in this mode.
pt_br: ``True``: используйте ``режим автоматической фиксации`_ SQLite. :meth:`commit` и :meth:`rollback` не действуют в этом режиме.

source: :data:`LEGACY_TRANSACTION_CONTROL`: Pre-Python 3.12 (non-:pep:`249`-compliant) transaction control. See :attr:`isolation_level` for more details.
pt_br: :data:`LEGACY_TRANSACTION_CONTROL`: Управление транзакциями до версии Python 3.12 (не :pep:`249`-совместимой). Дополнительную информацию см. в :attr:`isolation_level`.

source: This is currently the default value of :attr:`!autocommit`.
pt_br: В настоящее время это значение по умолчанию для :attr:`!autocommit`.

source: Changing :attr:`!autocommit` to ``False`` will open a new transaction, and changing it to ``True`` will commit any pending transaction.
pt_br: Изменение :attr:`!autocommit` на ``False`` откроет новую транзакцию, а изменение его на ``True`` зафиксирует любую ожидающую транзакцию.

source: See :ref:`sqlite3-transaction-control-autocommit` for more details.
pt_br: Дополнительную информацию см. в :ref:`sqlite3-transaction-control-autocommit`.

source: The :attr:`isolation_level` attribute has no effect unless :attr:`autocommit` is :data:`LEGACY_TRANSACTION_CONTROL`.
pt_br: Атрибут :attr:`isolation_level` не имеет никакого эффекта, если :attr:`autocommit` не имеет значения :data:`LEGACY_TRANSACTION_CONTROL`.

source: This read-only attribute corresponds to the low-level SQLite `autocommit mode`_.
pt_br: Этот атрибут только для чтения соответствует низкоуровневому `режиму автоматической фиксации`_ SQLite.

source: ``True`` if a transaction is active (there are uncommitted changes), ``False`` otherwise.
pt_br: ``True``, если транзакция активна (есть незафиксированные изменения), ``False`` в противном случае.

source: Controls the :ref:`legacy transaction handling mode <sqlite3-transaction-control-isolation-level>` of :mod:`!sqlite3`. If set to ``None``, transactions are never implicitly opened. If set to one of ``"DEFERRED"``, ``"IMMEDIATE"``, or ``"EXCLUSIVE"``, corresponding to the underlying `SQLite transaction behaviour`_, :ref:`implicit transaction management <sqlite3-transaction-control-isolation-level>` is performed.
pt_br: Управляет :ref:`устаревшим режимом обработки транзакций <sqlite3-transaction-control-isolation-level>` :mod:`!sqlite3`. Если установлено значение None, транзакции никогда не открываются неявно. Если установлено одно из «ОТЛОЖЕННЫХ», «НЕМЕДЛЕННЫХ» или «ЭКСКЛЮЗИВНЫХ», соответствующих базовому «поведению транзакций SQLite», :ref:`неявное управление транзакциями <sqlite3 -transaction-control-isolation-level>` выполняется.

source: If not overridden by the *isolation_level* parameter of :func:`connect`, the default is ``""``, which is an alias for ``"DEFERRED"``.
pt_br: Если это не переопределено параметром *isolation_level* функции :func:`connect`, по умолчанию используется ``""``, который является псевдонимом для ``"DEFERRED"``.

source: Using :attr:`autocommit` to control transaction handling is recommended over using :attr:`!isolation_level`. :attr:`!isolation_level` has no effect unless :attr:`autocommit` is set to :data:`LEGACY_TRANSACTION_CONTROL` (the default).
pt_br: Использование :attr:`autocommit` для управления обработкой транзакций рекомендуется вместо использования :attr:`!isolation_level`. :attr:`!isolation_level` не имеет никакого эффекта, если для :attr:`autocommit` не установлено значение :data:`LEGACY_TRANSACTION_CONTROL` (по умолчанию).

source: The initial :attr:`~Cursor.row_factory` for :class:`Cursor` objects created from this connection. Assigning to this attribute does not affect the :attr:`!row_factory` of existing cursors belonging to this connection, only new ones. Is ``None`` by default, meaning each row is returned as a :class:`tuple`.
pt_br: Начальный :attr:`~Cursor.row_factory` для объектов :class:`Cursor`, созданных из этого соединения. Присвоение этому атрибуту не влияет на :attr:`!row_factory` существующих курсоров, принадлежащих этому соединению, а только на новые. По умолчанию имеет значение None, что означает, что каждая строка возвращается как :class:`tuple`.

source: See :ref:`sqlite3-howto-row-factory` for more details.
pt_br: Consulte :ref:`sqlite3-howto-row-factory` para mais detalhes.

source: A :term:`callable` that accepts a :class:`bytes` parameter and returns a text representation of it. The callable is invoked for SQLite values with the ``TEXT`` data type. By default, this attribute is set to :class:`str`.
pt_br: :term:`callable`, который принимает параметр :class:`bytes` и возвращает его текстовое представление. Вызываемый объект вызывается для значений SQLite с типом данных TEXT. По умолчанию для этого атрибута установлено значение :class:`str`.

source: See :ref:`sqlite3-howto-encoding` for more details.
pt_br: Consulte :ref:`sqlite3-howto-encoding` para mais detalhes.

source: Return the total number of database rows that have been modified, inserted, or deleted since the database connection was opened.
pt_br: Возвращает общее количество строк базы данных, которые были изменены, вставлены или удалены с момента открытия соединения с базой данных.

source: Cursor objects
pt_br: Курсорные объекты

source: A ``Cursor`` object represents a `database cursor`_ which is used to execute SQL statements, and manage the context of a fetch operation. Cursors are created using :meth:`Connection.cursor`, or by using any of the :ref:`connection shortcut methods <sqlite3-connection-shortcuts>`.
pt_br: Объект «Курсор» представляет собой «курсор базы данных», который используется для выполнения операторов SQL и управления контекстом операции выборки. Курсоры создаются с помощью :meth:`Connection.cursor` или с помощью любого из :ref:`методов ярлыков соединений <sqlite3-connection-shortcuts>`.

source: Cursor objects are :term:`iterators <iterator>`, meaning that if you :meth:`~Cursor.execute` a ``SELECT`` query, you can simply iterate over the cursor to fetch the resulting rows:
pt_br: Объекты курсора — это :term:`итераторы <iterator>`, что означает, что если вы :meth:`~Cursor.execute` запрос ``SELECT``, вы можете просто перебирать курсор для получения результирующих строк:

source: A :class:`Cursor` instance has the following attributes and methods.
pt_br: Екземпляр :class:`Cursor` має такі атрибути та методи.

source: Execute a single SQL statement, optionally binding Python values using :ref:`placeholders <sqlite3-placeholders>`.
pt_br: Выполните один оператор SQL, при необходимости привязав значения Python с помощью :ref:`placeholders <sqlite3-placeholders>`.

source: A single SQL statement.
pt_br: Один оператор SQL.

source: Python values to bind to placeholders in *sql*. A :class:`!dict` if named placeholders are used. A :term:`!sequence` if unnamed placeholders are used. See :ref:`sqlite3-placeholders`.
pt_br: Значения Python для привязки к заполнителям в *sql*. A :class:`!dict`, если используются именованные заполнители. A :term:`!sequence`, если используются безымянные заполнители. См. :ref:`sqlite3-placeholders`.

source: If :attr:`~Connection.autocommit` is :data:`LEGACY_TRANSACTION_CONTROL`, :attr:`~Connection.isolation_level` is not ``None``, *sql* is an ``INSERT``, ``UPDATE``, ``DELETE``, or ``REPLACE`` statement, and there is no open transaction, a transaction is implicitly opened before executing *sql*.
pt_br: Если :attr:`~Connection.autocommit` равен :data:`LEGACY_TRANSACTION_CONTROL`, :attr:`~Connection.isolation_level` не равен ``None``, *sql* — это ``INSERT``, ``UPDATE` `, ``DELETE`` или ``REPLACE`` и нет открытой транзакции, транзакция неявно открывается перед выполнением *sql*.

source: Use :meth:`executescript` to execute multiple SQL statements.
pt_br: Используйте :meth:`executescript` для выполнения нескольких операторов SQL.

source: For every item in *parameters*, repeatedly execute the :ref:`parameterized <sqlite3-placeholders>` :abbr:`DML (Data Manipulation Language)` SQL statement *sql*.
pt_br: Для каждого элемента в *parameters* повторно выполните :ref:`параметризованный <sqlite3-placeholders>` :abbr:`DML (язык манипулирования данными)` оператор SQL *sql*.

source: Uses the same implicit transaction handling as :meth:`~Cursor.execute`.
pt_br: Использует ту же неявную обработку транзакций, что и :meth:`~Cursor.execute`.

source: A single SQL DML statement.
pt_br: Один оператор SQL DML.

source: An :term:`!iterable` of parameters to bind with the placeholders in *sql*. See :ref:`sqlite3-placeholders`.
pt_br: :term:`!iterable` параметров для привязки к заполнителям в *sql*. См. :ref:`sqlite3-placeholders`.

source: Any resulting rows are discarded, including DML statements with `RETURNING clauses`_.
pt_br: Любые результирующие строки отбрасываются, включая операторы DML с предложениями RETURNING_.

source: Execute the SQL statements in *sql_script*. If the :attr:`~Connection.autocommit` is :data:`LEGACY_TRANSACTION_CONTROL` and there is a pending transaction, an implicit ``COMMIT`` statement is executed first. No other implicit transaction control is performed; any transaction control must be added to *sql_script*.
pt_br: Выполните инструкции SQL в *sql_script*. Если :attr:`~Connection.autocommit` имеет значение :data:`LEGACY_TRANSACTION_CONTROL` и имеется ожидающая транзакция, сначала выполняется неявный оператор ``COMMIT``. Никакого другого неявного контроля транзакций не выполняется; любой контроль транзакций должен быть добавлен в *sql_script*.

source: *sql_script* must be a :class:`string <str>`.
pt_br: *sql_script* должен быть :class:`string <str>`.
