Repository: python/python-docs-pt-br
Catalog: library/sqlite3.po
Languages: pt_br

source: The :meth:`~Cursor.executescript` method implicitly commits any pending transaction before execution of the given SQL script, regardless of the value of :attr:`~Connection.isolation_level`.
pt_br: O método :meth:`~Cursor.executescript` compromete implicitamente qualquer transação pendente antes da execução do script SQL fornecido, independentemente do valor de :attr:`~Connection.isolation_level`.

source: :mod:`!sqlite3` used to implicitly commit an open transaction before DDL statements. This is no longer the case.
pt_br: :mod:`!sqlite3` costumava fazer commit de forma implícita de uma transação aberta antes das instruções DDL. Este não é mais o caso.

source: The recommended way of controlling transactions is now via the :attr:`~Connection.autocommit` attribute.
pt_br: A forma recomendada de controlar transações agora é através do atributo :attr:`~Connection.autocommit`.

source: ? (question mark)
pt_br: ? (interrogação)

source: in SQL statements
pt_br: em instruções SQL

source: : (colon)
pt_br: : (dois pontos)
