Repository: python/python-docs-pt-br
Catalog: library/sqlite3.po
Languages: pt_br

source: This flag may be combined with :const:`PARSE_COLNAMES` using the ``|`` (bitwise or) operator.
pt_br: Этот флаг можно комбинировать с :const:`PARSE_COLNAMES` с помощью оператора ``|`` (побитовое или).

source: Generated fields (for example ``MAX(p)``) are returned as :class:`str`. Use :const:`!PARSE_COLNAMES` to enforce types for such queries.
pt_br: 生成的字段 (例如 ``MAX(p)``) 将作为 :class:`str` 返回。 使用 :const:`!PARSE_COLNAMES` 为这样的查询设置类型。

source: Pass this flag value to the *detect_types* parameter of :func:`connect` to look up a converter function by using the type name, parsed from the query column name, as the converter dictionary key. The query column name must be wrapped in double quotes (``"``) and the type name must be wrapped in square brackets (``[]``).
pt_br: Передайте это значение флага параметру *detect_types* :func:`connect` для поиска функции преобразователя, используя имя типа, проанализированное из имени столбца запроса, как ключ словаря преобразователя. Имя столбца запроса должно быть заключено в двойные кавычки (``"``), а имя типа должно быть заключено в квадратные скобки (``[]``).

source: This flag may be combined with :const:`PARSE_DECLTYPES` using the ``|`` (bitwise or) operator.
pt_br: Этот флаг можно комбинировать с :const:`PARSE_DECLTYPES` с помощью оператора ``|`` (побитовое или).

source: Flags that should be returned by the *authorizer_callback* :term:`callable` passed to :meth:`Connection.set_authorizer`, to indicate whether:
pt_br: Флаги, которые должны быть возвращены *authorizer_callback* :term:`callable`, переданным в :meth:`Connection.set_authorizer`, чтобы указать:

source: Access is allowed (:const:`!SQLITE_OK`),
pt_br: Доступ разрешен (:const:`!SQLITE_OK`),

source: The SQL statement should be aborted with an error (:const:`!SQLITE_DENY`)
pt_br: Выполнение оператора SQL должно быть прервано с ошибкой (:const:`!SQLITE_DENY`)

source: The column should be treated as a ``NULL`` value (:const:`!SQLITE_IGNORE`)
pt_br: Столбец следует рассматривать как значение ``NULL`` (:const:`!SQLITE_IGNORE`).

source: String constant stating the supported DB-API level. Required by the DB-API. Hard-coded to ``"2.0"``.
pt_br: Рядкова константа, що вказує підтримуваний рівень DB-API. Потрібний для DB-API. Жорстко закодований на ``"2.0"``.

source: String constant stating the type of parameter marker formatting expected by the :mod:`!sqlite3` module. Required by the DB-API. Hard-coded to ``"qmark"``.
pt_br: Строковая константа, указывающая тип форматирования маркера параметра, ожидаемый модулем :mod:`!sqlite3`. Требуется для DB-API. Жестко запрограммировано в ``"qmark"``.

source: The ``named`` DB-API parameter style is also supported.
pt_br: Также поддерживается стиль параметров DB-API ``named``.

source: Version number of the runtime SQLite library as a :class:`string <str>`.
pt_br: Номер версии библиотеки времени выполнения SQLite в виде :class:`string <str>`.

source: Version number of the runtime SQLite library as a :class:`tuple` of :class:`integers <int>`.
pt_br: Номер версии библиотеки времени выполнения SQLite в виде :class:`tuple` из :class:`integers <int>`.

source: Integer constant required by the DB-API 2.0, stating the level of thread safety the :mod:`!sqlite3` module supports. This attribute is set based on the default `threading mode <https://sqlite.org/threadsafe.html>`_ the underlying SQLite library is compiled with. The SQLite threading modes are:
pt_br: Целочисленная константа, требуемая DB-API 2.0, указывающая уровень потокобезопасности, поддерживаемый модулем :mod:`!sqlite3`. Этот атрибут устанавливается на основе `поточного режима <https://sqlite.org/threadsafe.html>`_ по умолчанию, с которым скомпилирована базовая библиотека SQLite. Режимы потоков SQLite:

source: **Single-thread**: In this mode, all mutexes are disabled and SQLite is unsafe to use in more than a single thread at once.
pt_br: **Однопоточный**: в этом режиме все мьютексы отключены, и SQLite небезопасно использовать более чем в одном потоке одновременно.

source: **Multi-thread**: In this mode, SQLite can be safely used by multiple threads provided that no single database connection is used simultaneously in two or more threads.
pt_br: **Многопоточный**: в этом режиме SQLite можно безопасно использовать в нескольких потоках при условии, что ни одно соединение с базой данных не используется одновременно в двух или более потоках.

source: **Serialized**: In serialized mode, SQLite can be safely used by multiple threads with no restriction.
pt_br: **Сериализация**: в сериализованном режиме SQLite может безопасно использоваться несколькими потоками без ограничений.

source: The mappings from SQLite threading modes to DB-API 2.0 threadsafety levels are as follows:
pt_br: Сопоставления режимов потоков SQLite с уровнями безопасности потоков DB-API 2.0 следующие:

source: SQLite threading mode
pt_br: Режим потоков SQLite

source: DB-API 2.0 meaning
pt_br: Значение DB-API 2.0

source: single-thread
pt_br: однопоточный

source: Threads may not share the module
pt_br: Потоки не могут совместно использовать модуль

source: multi-thread
pt_br: многопоточный

source: Threads may share the module, but not connections
pt_br: Потоки могут совместно использовать модуль, но не соединения.

source: serialized
pt_br: сериализованный

source: Threads may share the module, connections and cursors
pt_br: Потоки могут совместно использовать модуль, соединения и курсоры.

source: Set *threadsafety* dynamically instead of hard-coding it to ``1``.
pt_br: Устанавливайте *threadsafety* динамически, а не жестко запрограммируйте его на «1».

source: These constants are used for the :meth:`Connection.setconfig` and :meth:`~Connection.getconfig` methods.
pt_br: Эти константы используются для методов :meth:`Connection.setconfig` и :meth:`~Connection.getconfig`.

source: The availability of these constants varies depending on the version of SQLite Python was compiled with.
pt_br: Доступность этих констант зависит от версии SQLite Python, с которой был скомпилирован.

source: SQLite docs: Database Connection Configuration Options
pt_br: Документация SQLite: Параметры конфигурации подключения к базе данных

source: Connection objects
pt_br: Объекты подключения

source: Each open SQLite database is represented by a ``Connection`` object, which is created using :func:`sqlite3.connect`. Their main purpose is creating :class:`Cursor` objects, and :ref:`sqlite3-controlling-transactions`.
pt_br: Каждая открытая база данных SQLite представлена ​​объектом Connection, который создается с помощью :func:`sqlite3.connect`. Их основная цель — создание объектов :class:`Cursor` и :ref:`sqlite3-controlling-transactions`.

source: A :exc:`ResourceWarning` is emitted if :meth:`close` is not called before a :class:`!Connection` object is deleted.
pt_br: :exc:`ResourceWarning` выдается, если :meth:`close` не вызывается перед удалением объекта :class:`!Connection`.

source: An SQLite database connection has the following attributes and methods:
pt_br: Підключення до бази даних SQLite має такі атрибути та методи:

source: Create and return a :class:`Cursor` object. The cursor method accepts a single optional parameter *factory*. If supplied, this must be a :term:`callable` returning an instance of :class:`Cursor` or its subclasses.
pt_br: Создайте и верните объект :class:`Cursor`. Метод курсора принимает один необязательный параметр *factory*. Если указано, это должен быть :term:`callable`, возвращающий экземпляр :class:`Cursor` или его подклассов.

source: Open a :class:`Blob` handle to an existing :abbr:`BLOB (Binary Large OBject)`.
pt_br: Откройте дескриптор :class:`Blob` для существующего :abbr:`BLOB (большого двоичного объекта)`.

source: The name of the table where the blob is located.
pt_br: Имя таблицы, в которой находится большой двоичный объект.

source: The name of the column where the blob is located.
pt_br: Имя столбца, в котором расположен большой двоичный объект.

source: The name of the row where the blob is located.
pt_br: Имя строки, в которой находится большой двоичный объект.

source: Set to ``True`` if the blob should be opened without write permissions. Defaults to ``False``.
pt_br: Установите значение True, если большой двоичный объект должен быть открыт без разрешений на запись. По умолчанию установлено значение «False».

source: The name of the database where the blob is located. Defaults to ``"main"``.
pt_br: Имя базы данных, в которой находится большой двоичный объект. По умолчанию ``"main"``.

source: Raises
pt_br: Levanta

source: When trying to open a blob in a ``WITHOUT ROWID`` table.
pt_br: При попытке открыть большой двоичный объект в таблице БЕЗ ROWID.

source: The blob size cannot be changed using the :class:`Blob` class. Use the SQL function ``zeroblob`` to create a blob with a fixed size.
pt_br: Размер большого двоичного объекта нельзя изменить с помощью класса :class:`Blob`. Используйте функцию SQL «zeroblob», чтобы создать большой двоичный объект фиксированного размера.

source: Commit any pending transaction to the database. If :attr:`autocommit` is ``True``, or there is no open transaction, this method does nothing. If :attr:`!autocommit` is ``False``, a new transaction is implicitly opened if a pending transaction was committed by this method.
pt_br: Зафиксируйте любую ожидающую транзакцию в базе данных. Если :attr:`autocommit` имеет значение ``True`` или нет открытой транзакции, этот метод ничего не делает. Если :attr:`!autocommit` имеет значение ``False``, новая транзакция неявно открывается, если ожидающая транзакция была зафиксирована этим методом.

source: Roll back to the start of any pending transaction. If :attr:`autocommit` is ``True``, or there is no open transaction, this method does nothing. If :attr:`!autocommit` is ``False``, a new transaction is implicitly opened if a pending transaction was rolled back by this method.
pt_br: Откат к началу любой ожидающей транзакции. Если :attr:`autocommit` имеет значение ``True`` или нет открытой транзакции, этот метод ничего не делает. Если :attr:`!autocommit` имеет значение ``False``, новая транзакция неявно открывается, если ожидающая транзакция была откатана этим методом.

source: Close the database connection. If :attr:`autocommit` is ``False``, any pending transaction is implicitly rolled back. If :attr:`!autocommit` is ``True`` or :data:`LEGACY_TRANSACTION_CONTROL`, no implicit transaction control is executed. Make sure to :meth:`commit` before closing to avoid losing pending changes.
pt_br: Закройте соединение с базой данных. Если :attr:`autocommit` имеет значение ``False``, любая ожидающая транзакция неявно откатывается. Если :attr:`!autocommit` имеет значение ``True`` или :data:`LEGACY_TRANSACTION_CONTROL`, неявный контроль транзакций не выполняется. Обязательно выполните :meth:`commit` перед закрытием, чтобы не потерять ожидающие изменения.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.execute` on it with the given *sql* and *parameters*. Return the new cursor object.
pt_br: Створіть новий об’єкт :class:`Cursor` і викличте :meth:`~Cursor.execute` для нього з заданими *sql* і *параметрами*. Повернути новий об’єкт курсору.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executemany` on it with the given *sql* and *parameters*. Return the new cursor object.
pt_br: Створіть новий об’єкт :class:`Cursor` і викличте :meth:`~Cursor.executemany` для нього з заданими *sql* і *параметрами*. Повернути новий об’єкт курсору.

source: Create a new :class:`Cursor` object and call :meth:`~Cursor.executescript` on it with the given *sql_script*. Return the new cursor object.
pt_br: Створіть новий об’єкт :class:`Cursor` і викличте :meth:`~Cursor.executescript` для нього за допомогою заданого *sql_script*. Повернути новий об’єкт курсору.

source: Create or remove a user-defined SQL function.
pt_br: Создайте или удалите пользовательскую функцию SQL.

source: The name of the SQL function.
pt_br: O nome da função SQL.

source: The number of arguments the SQL function can accept. If ``-1``, it may take any number of arguments.
pt_br: Количество аргументов, которые может принять функция SQL. Если ``-1``, он может принимать любое количество аргументов.

source: A :term:`callable` that is called when the SQL function is invoked. The callable must return :ref:`a type natively supported by SQLite <sqlite3-types>`. Set to ``None`` to remove an existing SQL function.
pt_br: :term:`callable`, который вызывается при вызове функции SQL. Вызываемый объект должен возвращать :ref:`тип, изначально поддерживаемый SQLite <sqlite3-types>`. Установите значение «Нет», чтобы удалить существующую функцию SQL.

source: If ``True``, the created SQL function is marked as `deterministic <https://sqlite.org/deterministic.html>`_, which allows SQLite to perform additional optimizations.
pt_br: Если ``True``, созданная функция SQL помечается как ``детерминированная <https://sqlite.org/deterministic.html>`_, что позволяет SQLite выполнять дополнительную оптимизацию.

source: Added the *deterministic* parameter.
pt_br: Добавлен параметр *детерминированный*.

source: Example:
pt_br: Exemplo:

source: Passing *name*, *narg*, and *func* as keyword arguments is deprecated. These parameters will become positional-only in Python 3.15.
pt_br: Передача *name*, *narg* и *func* в качестве аргументов ключевых слов не рекомендуется. В Python 3.15 эти параметры станут только позиционными.

source: Create or remove a user-defined SQL aggregate function.
pt_br: Создайте или удалите определяемую пользователем агрегатную функцию SQL.

source: The name of the SQL aggregate function.
pt_br: Имя агрегатной функции SQL.

source: The number of arguments the SQL aggregate function can accept. If ``-1``, it may take any number of arguments.
pt_br: Число аргументов, которые может принять агрегатная функция SQL. Если ``-1``, он может принимать любое количество аргументов.

source: A class must implement the following methods: * ``step()``: Add a row to the aggregate. * ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`. The number of arguments that the ``step()`` method must accept is controlled by *n_arg*. Set to ``None`` to remove an existing SQL aggregate function.
pt_br: Класс должен реализовывать следующие методы: * ``step()``: добавляет строку в агрегат. * ``finalize()``: Возвращает окончательный результат агрегата как :ref:`тип, изначально поддерживаемый SQLite <sqlite3-types>`. Количество аргументов, которые должен принимать метод ``step()``, контролируется *n_arg*. Установите значение «Нет», чтобы удалить существующую агрегатную функцию SQL.

source: A class must implement the following methods:
pt_br: Uma classe deve implementar os seguintes métodos:

source: ``step()``: Add a row to the aggregate.
pt_br: ``step()``: добавьте строку в агрегат.

source: ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`.
pt_br: ``finalize()``: Возвращает окончательный результат агрегата как :ref:`тип, изначально поддерживаемый SQLite <sqlite3-types>`.

source: The number of arguments that the ``step()`` method must accept is controlled by *n_arg*.
pt_br: Количество аргументов, которые должен принимать метод ``step()``, контролируется *n_arg*.

source: Set to ``None`` to remove an existing SQL aggregate function.
pt_br: Установите значение «Нет», чтобы удалить существующую агрегатную функцию SQL.

source: Passing *name*, *n_arg*, and *aggregate_class* as keyword arguments is deprecated. These parameters will become positional-only in Python 3.15.
pt_br: Передача *name*, *n_arg* и *aggregate_class* в качестве аргументов ключевых слов устарела. В Python 3.15 эти параметры станут только позиционными.

source: Create or remove a user-defined aggregate window function.
pt_br: Создайте или удалите пользовательскую агрегатную оконную функцию.

source: The name of the SQL aggregate window function to create or remove.
pt_br: Имя агрегатной оконной функции SQL, которую необходимо создать или удалить.

source: The number of arguments the SQL aggregate window function can accept. If ``-1``, it may take any number of arguments.
pt_br: Число аргументов, которые может принять агрегатная оконная функция SQL. Если ``-1``, он может принимать любое количество аргументов.

source: A class that must implement the following methods: * ``step()``: Add a row to the current window. * ``value()``: Return the current value of the aggregate. * ``inverse()``: Remove a row from the current window. * ``finalize()``: Return the final result of the aggregate as :ref:`a type natively supported by SQLite <sqlite3-types>`. The number of arguments that the ``step()`` and ``value()`` methods must accept is controlled by *num_params*. Set to ``None`` to remove an existing SQL aggregate window function.
pt_br: Класс, который должен реализовывать следующие методы: * ``step()``: добавляет строку в текущее окно. * ``value()``: Возвращает текущее значение агрегата. * ``inverse()``: удалить строку из текущего окна. * ``finalize()``: Возвращает окончательный результат агрегата как :ref:`тип, изначально поддерживаемый SQLite <sqlite3-types>`. Количество аргументов, которые должны принимать методы ``step()`` и ``value()``, контролируется *num_params*. Установите значение «Нет», чтобы удалить существующую агрегатную оконную функцию SQL.

source: A class that must implement the following methods:
pt_br: Uma classe que deve implementar os seguintes métodos:

source: ``step()``: Add a row to the current window.
pt_br: ``step()``: добавить строку в текущее окно.

source: ``value()``: Return the current value of the aggregate.
pt_br: ``value()``: Возвращает текущее значение агрегата.

source: ``inverse()``: Remove a row from the current window.
pt_br: ``inverse()``: удалить строку из текущего окна.

source: The number of arguments that the ``step()`` and ``value()`` methods must accept is controlled by *num_params*.
pt_br: Количество аргументов, которые должны принимать методы ``step()`` и ``value()``, контролируется *num_params*.

source: Set to ``None`` to remove an existing SQL aggregate window function.
pt_br: Установите значение «Нет», чтобы удалить существующую агрегатную оконную функцию SQL.

source: If used with a version of SQLite older than 3.25.0, which does not support aggregate window functions.
pt_br: При использовании с версией SQLite старше 3.25.0, которая не поддерживает агрегатные оконные функции.

source: Create a collation named *name* using the collating function *callable*. *callable* is passed two :class:`string <str>` arguments, and it should return an :class:`integer <int>`:
pt_br: Створіть зіставлення під назвою *name* за допомогою функції зіставлення *callable*. *callable* передається два аргументи :class:`string <str>`, і він має повернути :class:`ціле число <int>`:

source: ``1`` if the first is ordered higher than the second
pt_br: ``1``, якщо перший впорядкований вище за другий

source: ``-1`` if the first is ordered lower than the second
pt_br: ``-1``, якщо перший впорядкований нижче другого

source: ``0`` if they are ordered equal
pt_br: ``0``, якщо вони в порядку рівності

source: The following example shows a reverse sorting collation:
pt_br: У наступному прикладі показано порівняння зворотного сортування:

source: Remove a collation function by setting *callable* to ``None``.
pt_br: Удалите функцию сопоставления, установив для *callable* значение «None».

source: The collation name can contain any Unicode character. Earlier, only ASCII characters were allowed.
pt_br: Имя параметра сортировки может содержать любой символ Юникода. Раньше допускались только символы ASCII.

source: Call this method from a different thread to abort any queries that might be executing on the connection. Aborted queries will raise an :exc:`OperationalError`.
pt_br: Вызовите этот метод из другого потока, чтобы прервать любые запросы, которые могут выполняться в соединении. Прерванные запросы вызовут ошибку :exc:`OperationalError`.

source: Register :term:`callable` *authorizer_callback* to be invoked for each attempt to access a column of a table in the database. The callback should return one of :const:`SQLITE_OK`, :const:`SQLITE_DENY`, or :const:`SQLITE_IGNORE` to signal how access to the column should be handled by the underlying SQLite library.
pt_br: Зарегистрируйте :term:`callable` *authorizer_callback*, чтобы он вызывался при каждой попытке доступа к столбцу таблицы в базе данных. Обратный вызов должен возвращать один из :const:`SQLITE_OK`, :const:`SQLITE_DENY` или :const:`SQLITE_IGNORE`, чтобы указать, как доступ к столбцу должен обрабатываться базовой библиотекой SQLite.

source: The first argument to the callback signifies what kind of operation is to be authorized. The second and third argument will be arguments or ``None`` depending on the first argument. The 4th argument is the name of the database ("main", "temp", etc.) if applicable. The 5th argument is the name of the inner-most trigger or view that is responsible for the access attempt or ``None`` if this access attempt is directly from input SQL code.
pt_br: Первый аргумент обратного вызова указывает, какая операция должна быть авторизована. Второй и третий аргументы будут аргументами или «Нет» в зависимости от первого аргумента. Четвертый аргумент — это имя базы данных («main», «temp» и т. д.), если применимо. Пятый аргумент — это имя самого внутреннего триггера или представления, которое отвечает за попытку доступа, или «Нет», если эта попытка доступа происходит непосредственно из входного кода SQL.

source: Please consult the SQLite documentation about the possible values for the first argument and the meaning of the second and third argument depending on the first one. All necessary constants are available in the :mod:`!sqlite3` module.
pt_br: Пожалуйста, обратитесь к документации SQLite о возможных значениях первого аргумента и значении второго и третьего аргумента в зависимости от первого. Все необходимые константы доступны в модуле :mod:`!sqlite3`.

source: Passing ``None`` as *authorizer_callback* will disable the authorizer.
pt_br: Передача None в качестве *authorizer_callback* отключит авторизатор.

source: Added support for disabling the authorizer using ``None``.
pt_br: Добавлена ​​поддержка отключения авторизатора с помощью None.

source: Passing *authorizer_callback* as a keyword argument is deprecated. The parameter will become positional-only in Python 3.15.
pt_br: Передача *authorizer_callback* в качестве аргумента ключевого слова устарела. В Python 3.15 параметр станет только позиционным.

source: Register :term:`callable` *progress_handler* to be invoked for every *n* instructions of the SQLite virtual machine. This is useful if you want to get called from SQLite during long-running operations, for example to update a GUI.
pt_br: Зарегистрируйте :term:`callable` *progress_handler*, который будет вызываться для каждой *n* инструкции виртуальной машины SQLite. Это полезно, если вы хотите, чтобы вас вызывали из SQLite во время длительных операций, например для обновления графического интерфейса.

source: If you want to clear any previously installed progress handler, call the method with ``None`` for *progress_handler*.
pt_br: Если вы хотите очистить любой ранее установленный обработчик прогресса, вызовите метод с ``None`` для *progress_handler*.

source: Returning a non-zero value from the handler function will terminate the currently executing query and cause it to raise a :exc:`DatabaseError` exception.
pt_br: Возврат ненулевого значения из функции-обработчика завершит текущий запрос и вызовет исключение :exc:`DatabaseError`.
