Repository: python/python-docs-pt-br
Catalog: library/sqlite3.po
Languages: pt_br

source: If :attr:`~Cursor.row_factory` is ``None``, return the next row query result set as a :class:`tuple`. Else, pass it to the row factory and return its result. Return ``None`` if no more data is available.
pt_br: Если :attr:`~Cursor.row_factory` имеет значение ``None``, вернуть следующий набор результатов запроса строки как :class:`tuple`. В противном случае передайте его фабрике строк и верните результат. Верните None, если данных больше нет.

source: Return the next set of rows of a query result as a :class:`list`. Return an empty list if no more rows are available.
pt_br: Возвращает следующий набор строк результата запроса в виде :class:`list`. Верните пустой список, если больше нет доступных строк.

source: The number of rows to fetch per call is specified by the *size* parameter. If *size* is not given, :attr:`arraysize` determines the number of rows to be fetched. If fewer than *size* rows are available, as many rows as are available are returned.
pt_br: Количество строк, извлекаемых за один вызов, определяется параметром *size*. Если *size* не задано, :attr:`arraysize` определяет количество извлекаемых строк. Если доступно меньше строк *size*, возвращается столько строк, сколько доступно.

source: Note there are performance considerations involved with the *size* parameter. For optimal performance, it is usually best to use the arraysize attribute. If the *size* parameter is used, then it is best for it to retain the same value from one :meth:`fetchmany` call to the next.
pt_br: Зауважте, що з параметром *size* пов’язані міркування щодо продуктивності. Для оптимальної продуктивності зазвичай найкраще використовувати атрибут arraysize. Якщо використовується параметр *size*, то найкраще, щоб він зберігав те саме значення від одного виклику :meth:`fetchmany` до наступного.

source: Return all (remaining) rows of a query result as a :class:`list`. Return an empty list if no rows are available. Note that the :attr:`arraysize` attribute can affect the performance of this operation.
pt_br: Возвращает все (оставшиеся) строки результата запроса в виде :class:`list`. Верните пустой список, если нет доступных строк. Обратите внимание, что атрибут :attr:`arraysize` может повлиять на производительность этой операции.

source: Close the cursor now (rather than whenever ``__del__`` is called).
pt_br: Закрийте курсор зараз (а не під час кожного виклику ``__del__``).

source: The cursor will be unusable from this point forward; a :exc:`ProgrammingError` exception will be raised if any operation is attempted with the cursor.
pt_br: Курсор стане непридатним для використання з цього моменту; виняток :exc:`ProgrammingError` буде викликано, якщо будь-яка операція буде виконана з курсором.

source: Required by the DB-API. Does nothing in :mod:`!sqlite3`.
pt_br: Требуется для DB-API. Ничего не делает в :mod:`!sqlite3`.

source: Read/write attribute that controls the number of rows returned by :meth:`fetchmany`. The default value is 1 which means a single row would be fetched per call.
pt_br: Атрибут читання/запису, який контролює кількість рядків, які повертає :meth:`fetchmany`. Значення за замовчуванням дорівнює 1, що означає, що за виклик буде отримано один рядок.

source: Read-only attribute that provides the SQLite database :class:`Connection` belonging to the cursor. A :class:`Cursor` object created by calling :meth:`con.cursor() <Connection.cursor>` will have a :attr:`connection` attribute that refers to *con*:
pt_br: Атрибут только для чтения, который предоставляет базу данных SQLite :class:`Connection`, принадлежащую курсору. Объект :class:`Cursor`, созданный вызовом :meth:`con.cursor() <Connection.cursor>`, будет иметь атрибут :attr:`connection`, который ссылается на *con*:

source: Read-only attribute that provides the column names of the last query. To remain compatible with the Python DB API, it returns a 7-tuple for each column where the last six items of each tuple are ``None``.
pt_br: Атрибут только для чтения, который предоставляет имена столбцов последнего запроса. Чтобы оставаться совместимым с API БД Python, он возвращает 7-кортеж для каждого столбца, где последние шесть элементов каждого кортежа имеют значение «Нет».

source: It is set for ``SELECT`` statements without any matching rows as well.
pt_br: Він також встановлений для операторів ``SELECT`` без будь-яких відповідних рядків.

source: Read-only attribute that provides the row id of the last inserted row. It is only updated after successful ``INSERT`` or ``REPLACE`` statements using the :meth:`execute` method. For other statements, after :meth:`executemany` or :meth:`executescript`, or if the insertion failed, the value of ``lastrowid`` is left unchanged. The initial value of ``lastrowid`` is ``None``.
pt_br: Атрибут только для чтения, который предоставляет идентификатор последней вставленной строки. Он обновляется только после успешных операторов INSERT или REPLACE с использованием метода :meth:`execute`. Для других операторов после :meth:`executemany` или :meth:`executescript`, или если вставка не удалась, значение ``lastrowid`` остается неизменным. Начальное значение «lastrowid» — «Нет».

source: Inserts into ``WITHOUT ROWID`` tables are not recorded.
pt_br: Вставки в таблиці ``БЕЗ ROWID`` не записуються.

source: Added support for the ``REPLACE`` statement.
pt_br: Додано підтримку оператора REPLACE.

source: Read-only attribute that provides the number of modified rows for ``INSERT``, ``UPDATE``, ``DELETE``, and ``REPLACE`` statements; is ``-1`` for other statements, including :abbr:`CTE (Common Table Expression)` queries. It is only updated by the :meth:`execute` and :meth:`executemany` methods, after the statement has run to completion. This means that any resulting rows must be fetched in order for :attr:`!rowcount` to be updated.
pt_br: Атрибут только для чтения, который предоставляет количество измененных строк для операторов INSERT, UPDATE, DELETE и REPLACE; для других операторов, включая запросы :abbr:`CTE (Common Table Expression)`, равно ``-1``. Он обновляется методами :meth:`execute` и :meth:`executemany` только после завершения выполнения оператора. Это означает, что все результирующие строки должны быть извлечены для обновления :attr:`!rowcount`.

source: Control how a row fetched from this :class:`!Cursor` is represented. If ``None``, a row is represented as a :class:`tuple`. Can be set to the included :class:`sqlite3.Row`; or a :term:`callable` that accepts two arguments, a :class:`Cursor` object and the :class:`!tuple` of row values, and returns a custom object representing an SQLite row.
pt_br: Управляйте представлением строки, полученной из этого :class:`!Cursor`. Если ``None``, строка представлена ​​как :class:`tuple`. Можно установить включенный :class:`sqlite3.Row`; или :term:`callable`, который принимает два аргумента: объект :class:`Cursor` и :class:`!tuple` значений строк, и возвращает пользовательский объект, представляющий строку SQLite.

source: Defaults to what :attr:`Connection.row_factory` was set to when the :class:`!Cursor` was created. Assigning to this attribute does not affect :attr:`Connection.row_factory` of the parent connection.
pt_br: По умолчанию установлено то, что :attr:`Connection.row_factory` было установлено при создании :class:`!Cursor`. Назначение этого атрибута не влияет на :attr:`Connection.row_factory` родительского соединения.

source: Row objects
pt_br: Строковые объекты

source: A :class:`!Row` instance serves as a highly optimized :attr:`~Connection.row_factory` for :class:`Connection` objects. It supports iteration, equality testing, :func:`len`, and :term:`mapping` access by column name and index.
pt_br: Экземпляр :class:`!Row` служит высокооптимизированной :attr:`~Connection.row_factory` для объектов :class:`Connection`. Он поддерживает итерацию, проверку на равенство, доступ :func:`len` и :term:`mapping` по имени столбца и индексу.

source: Two :class:`!Row` objects compare equal if they have identical column names and values.
pt_br: Два объекта :class:`!Row` сравниваются равными, если они имеют одинаковые имена и значения столбцов.

source: Return a :class:`list` of column names as :class:`strings <str>`. Immediately after a query, it is the first member of each tuple in :attr:`Cursor.description`.
pt_br: Верните список имен столбцов в виде :class:`strings <str>`. Сразу после запроса он становится первым членом каждого кортежа в :attr:`Cursor.description`.

source: Added support of slicing.
pt_br: Menambahkan dukungan dari pemotongan.

source: Blob objects
pt_br: Объекты BLOB-объектов

source: A :class:`Blob` instance is a :term:`file-like object` that can read and write data in an SQLite :abbr:`BLOB (Binary Large OBject)`. Call :func:`len(blob) <len>` to get the size (number of bytes) of the blob. Use indices and :term:`slices <slice>` for direct access to the blob data.
pt_br: Экземпляр :class:`Blob` — это :term:`файлоподобный объект`, который может читать и записывать данные в SQLite :abbr:`BLOB (большой двоичный объект)`. Вызовите :func:`len(blob) <len>`, чтобы получить размер (количество байтов) большого двоичного объекта. Используйте индексы и :term:`slices <slice>` для прямого доступа к данным большого двоичного объекта.

source: Use the :class:`Blob` as a :term:`context manager` to ensure that the blob handle is closed after use.
pt_br: Используйте :class:`Blob` в качестве :term:`контекстного менеджера`, чтобы гарантировать, что дескриптор BLOB-объекта будет закрыт после использования.

source: Close the blob.
pt_br: Закройте blob.

source: The blob will be unusable from this point onward. An :class:`~sqlite3.Error` (or subclass) exception will be raised if any further operation is attempted with the blob.
pt_br: С этого момента большой двоичный объект станет непригоден для использования. Исключение :class:`~sqlite3.Error` (или подкласса) будет вызвано при попытке какой-либо дальнейшей операции с большим двоичным объектом.

source: Read *length* bytes of data from the blob at the current offset position. If the end of the blob is reached, the data up to :abbr:`EOF (End of File)` will be returned. When *length* is not specified, or is negative, :meth:`~Blob.read` will read until the end of the blob.
pt_br: Считайте *длину* байтов данных из большого двоичного объекта в текущей позиции смещения. Если достигнут конец большого двоичного объекта, будут возвращены данные до :abbr:`EOF (конец файла)`. Если *длина* не указана или имеет отрицательное значение, :meth:`~Blob.read` будет читать до конца большого двоичного объекта.

source: Write *data* to the blob at the current offset. This function cannot change the blob length. Writing beyond the end of the blob will raise :exc:`ValueError`.
pt_br: Запишите *данные* в большой двоичный объект по текущему смещению. Эта функция не может изменить длину большого двоичного объекта. Запись за пределами BLOB-объекта вызовет :exc:`ValueError`.

source: Return the current access position of the blob.
pt_br: Верните текущую позицию доступа к большому двоичному объекту.

source: Set the current access position of the blob to *offset*. The *origin* argument defaults to :const:`os.SEEK_SET` (absolute blob positioning). Other values for *origin* are :const:`os.SEEK_CUR` (seek relative to the current position) and :const:`os.SEEK_END` (seek relative to the blob’s end).
pt_br: Установите текущую позицию доступа к большому двоичному объекту как *offset*. Аргумент *origin* по умолчанию имеет значение :const:`os.SEEK_SET` (абсолютное позиционирование больших двоичных объектов). Другими значениями *origin* являются :const:`os.SEEK_CUR` (поиск относительно текущей позиции) и :const:`os.SEEK_END` (поиск относительно конца большого двоичного объекта).

source: PrepareProtocol objects
pt_br: Объекты подготовки протокола

source: The PrepareProtocol type's single purpose is to act as a :pep:`246` style adaption protocol for objects that can :ref:`adapt themselves <sqlite3-conform>` to :ref:`native SQLite types <sqlite3-types>`.
pt_br: Единственная цель типа ПодготовкаПротокол — действовать как протокол адаптации стиля :pep:`246` для объектов, которые могут :ref:`адаптироваться <sqlite3-conform>` к :ref:`родным типам SQLite <sqlite3-types>`.

source: Exceptions
pt_br: Exceções

source: The exception hierarchy is defined by the DB-API 2.0 (:pep:`249`).
pt_br: Ієрархія винятків визначається DB-API 2.0 (:pep:`249`).

source: This exception is not currently raised by the :mod:`!sqlite3` module, but may be raised by applications using :mod:`!sqlite3`, for example if a user-defined function truncates data while inserting. ``Warning`` is a subclass of :exc:`Exception`.
pt_br: Это исключение в настоящее время не вызывается модулем :mod:`!sqlite3`, но может быть вызвано приложениями, использующими :mod:`!sqlite3`, например, если определяемая пользователем функция усекает данные при вставке. ``Warning`` является подклассом :exc:`Exception`.

source: The base class of the other exceptions in this module. Use this to catch all errors with one single :keyword:`except` statement. ``Error`` is a subclass of :exc:`Exception`.
pt_br: Базовий клас інших винятків у цьому модулі. Використовуйте це, щоб перехопити всі помилки за допомогою одного оператора :keyword:`except`. ``Error`` є підкласом :exc:`Exception`.

source: If the exception originated from within the SQLite library, the following two attributes are added to the exception:
pt_br: Если исключение возникло из библиотеки SQLite, к исключению добавляются следующие два атрибута:

source: The numeric error code from the `SQLite API <https://sqlite.org/rescode.html>`_
pt_br: Числовой код ошибки из `SQLite API <https://sqlite.org/rescode.html>`_

source: The symbolic name of the numeric error code from the `SQLite API <https://sqlite.org/rescode.html>`_
pt_br: Символическое имя числового кода ошибки из `SQLite API <https://sqlite.org/rescode.html>`_

source: Exception raised for misuse of the low-level SQLite C API. In other words, if this exception is raised, it probably indicates a bug in the :mod:`!sqlite3` module. ``InterfaceError`` is a subclass of :exc:`Error`.
pt_br: Исключение возникло из-за неправильного использования низкоуровневого API SQLite C. Другими словами, если это исключение возникает, это, вероятно, указывает на ошибку в модуле :mod:`!sqlite3`. ``InterfaceError`` является подклассом :exc:`Error`.

source: Exception raised for errors that are related to the database. This serves as the base exception for several types of database errors. It is only raised implicitly through the specialised subclasses. ``DatabaseError`` is a subclass of :exc:`Error`.
pt_br: Виняток створено для помилок, пов’язаних із базою даних. Це служить базовим винятком для кількох типів помилок бази даних. Він виникає лише неявно через спеціалізовані підкласи. ``DatabaseError`` є підкласом :exc:`Error`.

source: Exception raised for errors caused by problems with the processed data, like numeric values out of range, and strings which are too long. ``DataError`` is a subclass of :exc:`DatabaseError`.
pt_br: Виняток створено для помилок, спричинених проблемами з обробленими даними, як-от числові значення поза межами діапазону та надто довгі рядки. ``DataError`` є підкласом :exc:`DatabaseError`.

source: Exception raised for errors that are related to the database's operation, and not necessarily under the control of the programmer. For example, the database path is not found, or a transaction could not be processed. ``OperationalError`` is a subclass of :exc:`DatabaseError`.
pt_br: Виняток створено для помилок, які пов’язані з роботою бази даних і не обов’язково знаходяться під контролем програміста. Наприклад, шлях до бази даних не знайдено або транзакцію не вдалося обробити. ``OperationalError`` є підкласом :exc:`DatabaseError`.

source: Exception raised when the relational integrity of the database is affected, e.g. a foreign key check fails. It is a subclass of :exc:`DatabaseError`.
pt_br: Виняток виникає, коли порушується реляційна цілісність бази даних, наприклад. не вдається перевірити зовнішній ключ. Це підклас :exc:`DatabaseError`.

source: Exception raised when SQLite encounters an internal error. If this is raised, it may indicate that there is a problem with the runtime SQLite library. ``InternalError`` is a subclass of :exc:`DatabaseError`.
pt_br: Виняток виникає, коли SQLite стикається з внутрішньою помилкою. Якщо це виникає, це може означати, що існує проблема з бібліотекою SQLite під час виконання. ``InternalError`` є підкласом :exc:`DatabaseError`.

source: Exception raised for :mod:`!sqlite3` API programming errors, for example supplying the wrong number of bindings to a query, or trying to operate on a closed :class:`Connection`. ``ProgrammingError`` is a subclass of :exc:`DatabaseError`.
pt_br: Исключение возникает из-за ошибок программирования API :mod:`!sqlite3`, например, предоставления неправильного количества привязок к запросу или попытки работы с закрытым :class:`Соединением`. ``ProgrammingError`` является подклассом :exc:`DatabaseError`.

source: Exception raised in case a method or database API is not supported by the underlying SQLite library. For example, setting *deterministic* to ``True`` in :meth:`~Connection.create_function`, if the underlying SQLite library does not support deterministic functions. ``NotSupportedError`` is a subclass of :exc:`DatabaseError`.
pt_br: Исключение возникает в случае, если метод или API базы данных не поддерживается базовой библиотекой SQLite. Например, установите для параметра *deterministic* значение True в :meth:`~Connection.create_function`, если базовая библиотека SQLite не поддерживает детерминированные функции. ``NotSupportedError`` является подклассом :exc:`DatabaseError`.

source: SQLite and Python types
pt_br: SQLite dan tipe Python

source: SQLite natively supports the following types: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.
pt_br: SQLite спочатку підтримує такі типи: ``NULL``, ``INTEGER``, ``REAL``, ``TEXT``, ``BLOB``.

source: The following Python types can thus be sent to SQLite without any problem:
pt_br: Таким чином, такі типи Python можна без будь-яких проблем надсилати до SQLite:

source: Python type
pt_br: Tipo em Python

source: SQLite type
pt_br: Tipo em SQLite

source: This is how SQLite types are converted to Python types by default:
pt_br: Ось як типи SQLite перетворюються на типи Python за замовчуванням:

source: depends on :attr:`~Connection.text_factory`, :class:`str` by default
pt_br: залежить від :attr:`~Connection.text_factory`, :class:`str` за замовчуванням

source: The type system of the :mod:`!sqlite3` module is extensible in two ways: you can store additional Python types in an SQLite database via :ref:`object adapters <sqlite3-adapters>`, and you can let the :mod:`!sqlite3` module convert SQLite types to Python types via :ref:`converters <sqlite3-converters>`.
pt_br: Система типов модуля :mod:`!sqlite3` расширяется двумя способами: вы можете хранить дополнительные типы Python в базе данных SQLite через :ref:`object адаптеры <sqlite3-adapters>`, и вы можете позволить :mod Модуль :`!sqlite3` преобразует типы SQLite в типы Python с помощью :ref:`converters <sqlite3-converters>`.

source: Default adapters and converters (deprecated)
pt_br: Адаптеры и конвертеры по умолчанию (устарело)

source: The default adapters and converters are deprecated as of Python 3.12. Instead, use the :ref:`sqlite3-adapter-converter-recipes` and tailor them to your needs.
pt_br: Адаптеры и конвертеры по умолчанию устарели, начиная с Python 3.12. Вместо этого используйте sqlite3-adapter-converter-recipes и адаптируйте их к своим потребностям.

source: The deprecated default adapters and converters consist of:
pt_br: Устаревшие адаптеры и преобразователи по умолчанию состоят из:

source: An adapter for :class:`datetime.date` objects to :class:`strings <str>` in `ISO 8601`_ format.
pt_br: Адаптер для объектов :class:`datetime.date` к :class:`strings <str>` в формате `ISO 8601`_.

source: An adapter for :class:`datetime.datetime` objects to strings in ISO 8601 format.
pt_br: Адаптер для объектов :class:`datetime.datetime` к строкам в формате ISO 8601.

source: A converter for :ref:`declared <sqlite3-converters>` "date" types to :class:`datetime.date` objects.
pt_br: Конвертер для объявленных <sqlite3-converters>` типов даты в объекты :class:`datetime.date`.

source: A converter for declared "timestamp" types to :class:`datetime.datetime` objects. Fractional parts will be truncated to 6 digits (microsecond precision).
pt_br: Конвертер объявленных типов «меток времени» в объекты :class:`datetime.datetime`. Дробные части будут усечены до 6 цифр (с точностью до микросекунды).

source: The default "timestamp" converter ignores UTC offsets in the database and always returns a naive :class:`datetime.datetime` object. To preserve UTC offsets in timestamps, either leave converters disabled, or register an offset-aware converter with :func:`register_converter`.
pt_br: Конвертер "міток часу" за замовчуванням ігнорує зміщення UTC у базі даних і завжди повертає простий об’єкт :class:`datetime.datetime`. Щоб зберегти зміщення UTC у мітках часу, залиште конвертери вимкненими або зареєструйте конвертер із зсувом за допомогою :func:`register_converter`.

source: Command-line interface
pt_br: Interface de linha de comando

source: The :mod:`!sqlite3` module can be invoked as a script, using the interpreter's :option:`-m` switch, in order to provide a simple SQLite shell. The argument signature is as follows::
pt_br: Модуль :mod:`!sqlite3` можно вызвать как скрипт, используя переключатель интерпретатора :option:`-m`, чтобы обеспечить простую оболочку SQLite. Сигнатура аргумента следующая:

source: Type ``.quit`` or CTRL-D to exit the shell.
pt_br: Введите ``.quit`` или CTRL-D, чтобы выйти из оболочки.

source: Print CLI help.
pt_br: Распечатать справку CLI.

source: Print underlying SQLite library version.
pt_br: Распечатайте базовую версию библиотеки SQLite.

source: How-to guides
pt_br: Guias de como fazer

source: How to use placeholders to bind values in SQL queries
pt_br: Как использовать заполнители для привязки значений в запросах SQL

source: SQL operations usually need to use values from Python variables. However, beware of using Python's string operations to assemble queries, as they are vulnerable to `SQL injection attacks`_. For example, an attacker can simply close the single quote and inject ``OR TRUE`` to select all rows::
pt_br: В операциях SQL обычно необходимо использовать значения переменных Python. Однако остерегайтесь использования строковых операций Python для сборки запросов, поскольку они уязвимы для атак с использованием SQL-инъекций. Например, злоумышленник может просто закрыть одинарную кавычку и ввести ``OR TRUE``, чтобы выбрать все строки:

source: Instead, use the DB-API's parameter substitution. To insert a variable into a query string, use a placeholder in the string, and substitute the actual values into the query by providing them as a :class:`tuple` of values to the second argument of the cursor's :meth:`~Cursor.execute` method.
pt_br: Вместо этого используйте подстановку параметров DB-API. Чтобы вставить переменную в строку запроса, используйте заполнитель в строке и подставьте фактические значения в запрос, предоставив их в виде :class:`tuple` значений для второго аргумента :meth:`~Cursor курсора. .execute` метод.
