Repository: python/python-docs-pt-br
Catalog: library/sqlite3.po
Languages: pt_br

source: An SQL statement may use one of two kinds of placeholders: question marks (qmark style) or named placeholders (named style). For the qmark style, *parameters* must be a :term:`sequence` whose length must match the number of placeholders, or a :exc:`ProgrammingError` is raised. For the named style, *parameters* must be an instance of a :class:`dict` (or a subclass), which must contain keys for all named parameters; any extra items are ignored. Here's an example of both styles:
pt_br: В операторе SQL может использоваться один из двух типов заполнителей: вопросительные знаки (стиль qmark) или именованные заполнители (именованный стиль). Для стиля qmark *параметры* должны быть :term:`sequence`, длина которого должна соответствовать количеству заполнителей, иначе возникнет :exc:`ProgrammingError`. Для именованного стиля *parameters* должен быть экземпляром :class:`dict` (или подкласса), который должен содержать ключи для всех именованных параметров; любые дополнительные элементы игнорируются. Вот пример обоих стилей:

source: :pep:`249` numeric placeholders are *not* supported. If used, they will be interpreted as named placeholders.
pt_br: :pep:`249` числовые заполнители *не* поддерживаются. Если они используются, они будут интерпретироваться как именованные заполнители.

source: How to adapt custom Python types to SQLite values
pt_br: Как адаптировать пользовательские типы Python к значениям SQLite

source: SQLite supports only a limited set of data types natively. To store custom Python types in SQLite databases, *adapt* them to one of the :ref:`Python types SQLite natively understands <sqlite3-types>`.
pt_br: SQLite изначально поддерживает только ограниченный набор типов данных. Чтобы хранить пользовательские типы Python в базах данных SQLite, *адаптируйте* их к одному из :ref:`типов Python, SQLite изначально понимает <sqlite3-types>`.

source: There are two ways to adapt Python objects to SQLite types: letting your object adapt itself, or using an *adapter callable*. The latter will take precedence above the former. For a library that exports a custom type, it may make sense to enable that type to adapt itself. As an application developer, it may make more sense to take direct control by registering custom adapter functions.
pt_br: Есть два способа адаптировать объекты Python к типам SQLite: позволить вашему объекту адаптироваться самостоятельно или использовать *вызываемый адаптер*. Последнее будет иметь приоритет над первым. Для библиотеки, которая экспортирует пользовательский тип, возможно, имеет смысл разрешить этому типу адаптироваться. Разработчику приложений, возможно, имеет смысл взять на себя прямой контроль путем регистрации пользовательских функций адаптера.

source: How to write adaptable objects
pt_br: Как писать адаптируемые объекты

source: Suppose we have a :class:`!Point` class that represents a pair of coordinates, ``x`` and ``y``, in a Cartesian coordinate system. The coordinate pair will be stored as a text string in the database, using a semicolon to separate the coordinates. This can be implemented by adding a ``__conform__(self, protocol)`` method which returns the adapted value. The object passed to *protocol* will be of type :class:`PrepareProtocol`.
pt_br: Предположим, у нас есть класс :class:`!Point`, который представляет пару координат ``x`` и ``y`` в декартовой системе координат. Пара координат будет храниться в базе данных в виде текстовой строки с использованием точки с запятой для разделения координат. Это можно реализовать, добавив метод ``__conform__(self, протокол)``, который возвращает адаптированное значение. Объект, передаваемый в *protocol*, будет иметь тип :class:`PrepareProtocol`.

source: How to register adapter callables
pt_br: Как зарегистрировать вызываемые объекты адаптера

source: The other possibility is to create a function that converts the Python object to an SQLite-compatible type. This function can then be registered using :func:`register_adapter`.
pt_br: Другая возможность — создать функцию, которая преобразует объект Python в тип, совместимый с SQLite. Эту функцию затем можно зарегистрировать с помощью :func:`register_adapter`.

source: How to convert SQLite values to custom Python types
pt_br: Как преобразовать значения SQLite в пользовательские типы Python

source: Writing an adapter lets you convert *from* custom Python types *to* SQLite values. To be able to convert *from* SQLite values *to* custom Python types, we use *converters*.
pt_br: Написание адаптера позволяет конвертировать *из* пользовательских типов Python *в* значения SQLite. Чтобы иметь возможность конвертировать *из* значений SQLite *в* пользовательские типы Python, мы используем *конвертеры*.

source: Let's go back to the :class:`!Point` class. We stored the x and y coordinates separated via semicolons as strings in SQLite.
pt_br: Давайте вернемся к классу :class:`!Point`. Мы сохранили координаты x и y, разделенные точкой с запятой, в виде строк в SQLite.

source: First, we'll define a converter function that accepts the string as a parameter and constructs a :class:`!Point` object from it.
pt_br: Сначала мы определим функцию-конвертер, которая принимает строку в качестве параметра и создает из нее объект :class:`!Point`.

source: Converter functions are **always** passed a :class:`bytes` object, no matter the underlying SQLite data type.
pt_br: Функциям преобразователя **всегда** передается объект :class:`bytes`, независимо от базового типа данных SQLite.

source: We now need to tell :mod:`!sqlite3` when it should convert a given SQLite value. This is done when connecting to a database, using the *detect_types* parameter of :func:`connect`. There are three options:
pt_br: Теперь нам нужно сообщить :mod:`!sqlite3`, когда ему следует преобразовать данное значение SQLite. Это делается при подключении к базе данных с использованием параметра *detect_types* функции :func:`connect`. Есть три варианта:

source: Implicit: set *detect_types* to :const:`PARSE_DECLTYPES`
pt_br: Неявно: установите для *detect_types* значение :const:`PARSE_DECLTYPES`

source: Explicit: set *detect_types* to :const:`PARSE_COLNAMES`
pt_br: Явно: установите для *detect_types* значение :const:`PARSE_COLNAMES`

source: Both: set *detect_types* to ``sqlite3.PARSE_DECLTYPES | sqlite3.PARSE_COLNAMES``. Column names take precedence over declared types.
pt_br: Оба: установите для *detect_types* значение ``sqlite3.PARSE_DECLTYPES | sqlite3.PARSE_COLNAMES``. Имена столбцов имеют приоритет над объявленными типами.

source: The following example illustrates the implicit and explicit approaches:
pt_br: Следующий пример иллюстрирует неявный и явный подходы:

source: Adapter and converter recipes
pt_br: Рецепты адаптеров и преобразователей

source: This section shows recipes for common adapters and converters.
pt_br: В этом разделе показаны рецепты для распространенных адаптеров и преобразователей.

source: How to use connection shortcut methods
pt_br: Как использовать методы быстрого подключения

source: Using the :meth:`~Connection.execute`, :meth:`~Connection.executemany`, and :meth:`~Connection.executescript` methods of the :class:`Connection` class, your code can be written more concisely because you don't have to create the (often superfluous) :class:`Cursor` objects explicitly. Instead, the :class:`Cursor` objects are created implicitly and these shortcut methods return the cursor objects. This way, you can execute a ``SELECT`` statement and iterate over it directly using only a single call on the :class:`Connection` object.
pt_br: Используя методы :meth:`~Connection.execute`, :meth:`~Connection.executemany` и :meth:`~Connection.executescript` класса :class:`Connection`, ваш код можно написать более кратко. потому что вам не нужно явно создавать (часто лишние) объекты :class:`Cursor`. Вместо этого объекты :class:`Cursor` создаются неявно, и эти методы быстрого доступа возвращают объекты курсора. Таким образом, вы можете выполнить оператор ``SELECT`` и перебирать его напрямую, используя только один вызов объекта :class:`Connection`.

source: How to use the connection context manager
pt_br: Как использовать менеджер контекста соединения

source: A :class:`Connection` object can be used as a context manager that automatically commits or rolls back open transactions when leaving the body of the context manager. If the body of the :keyword:`with` statement finishes without exceptions, the transaction is committed. If this commit fails, or if the body of the ``with`` statement raises an uncaught exception, the transaction is rolled back. If :attr:`~Connection.autocommit` is ``False``, a new transaction is implicitly opened after committing or rolling back.
pt_br: Объект :class:`Connection` можно использовать в качестве контекстного менеджера, который автоматически фиксирует или откатывает открытые транзакции при выходе из тела контекстного менеджера. Если тело оператора :keyword:`with` завершается без исключений, транзакция фиксируется. Если эта фиксация не удалась или если тело оператора ``with`` вызывает неперехваченное исключение, транзакция откатывается. Если :attr:`~Connection.autocommit` имеет значение ``False``, новая транзакция неявно открывается после фиксации или отката.

source: If there is no open transaction upon leaving the body of the ``with`` statement, or if :attr:`~Connection.autocommit` is ``True``, the context manager does nothing.
pt_br: Если после выхода из тела оператора ``with`` нет открытой транзакции или если :attr:`~Connection.autocommit` имеет значение ``True``, контекстный менеджер ничего не делает.

source: The context manager neither implicitly opens a new transaction nor closes the connection. If you need a closing context manager, consider using :meth:`contextlib.closing`.
pt_br: Менеджер контекста не открывает новую транзакцию неявно и не закрывает соединение. Если вам нужен менеджер закрывающего контекста, рассмотрите возможность использования :meth:`contextlib.closing`.

source: How to work with SQLite URIs
pt_br: Как работать с URI SQLite

source: Some useful URI tricks include:
pt_br: Некоторые полезные приемы URI включают в себя:

source: Open a database in read-only mode:
pt_br: Откройте базу данных в режиме только для чтения:

source: Do not implicitly create a new database file if it does not already exist; will raise :exc:`~sqlite3.OperationalError` if unable to create a new file:
pt_br: Не создавайте неявно новый файл базы данных, если он еще не существует; вызовет :exc:`~sqlite3.OperationalError`, если не удастся создать новый файл:

source: Create a shared named in-memory database:
pt_br: Создайте общую именованную базу данных в памяти:

source: More information about this feature, including a list of parameters, can be found in the `SQLite URI documentation`_.
pt_br: Дополнительную информацию об этой функции, включая список параметров, можно найти в `документации по URI SQLite`_.

source: How to create and use row factories
pt_br: Как создавать и использовать фабрики строк

source: By default, :mod:`!sqlite3` represents each row as a :class:`tuple`. If a :class:`!tuple` does not suit your needs, you can use the :class:`sqlite3.Row` class or a custom :attr:`~Cursor.row_factory`.
pt_br: По умолчанию :mod:`!sqlite3` представляет каждую строку как :class:`tuple`. Если :class:`!tuple` не соответствует вашим потребностям, вы можете использовать класс :class:`sqlite3.Row` или собственный :attr:`~Cursor.row_factory`.

source: While :attr:`!row_factory` exists as an attribute both on the :class:`Cursor` and the :class:`Connection`, it is recommended to set :class:`Connection.row_factory`, so all cursors created from the connection will use the same row factory.
pt_br: Хотя :attr:`!row_factory` существует как атрибут как в :class:`Cursor`, так и в :class:`Connection`, рекомендуется установить :class:`Connection.row_factory`, чтобы все курсоры, созданные из соединение будет использовать ту же фабрику строк.

source: :class:`!Row` provides indexed and case-insensitive named access to columns, with minimal memory overhead and performance impact over a :class:`!tuple`. To use :class:`!Row` as a row factory, assign it to the :attr:`!row_factory` attribute:
pt_br: :class:`!Row` обеспечивает индексированный и нечувствительный к регистру именованный доступ к столбцам с минимальными затратами памяти и влиянием на производительность по сравнению с :class:`!tuple`. Чтобы использовать :class:`!Row` в качестве фабрики строк, назначьте его атрибуту :attr:`!row_factory`:

source: Queries now return :class:`!Row` objects:
pt_br: Запросы теперь возвращают объекты :class:`!Row`:

source: The ``FROM`` clause can be omitted in the ``SELECT`` statement, as in the above example. In such cases, SQLite returns a single row with columns defined by expressions, e.g. literals, with the given aliases ``expr AS alias``.
pt_br: Предложение FROM может быть опущено в операторе SELECT, как в приведенном выше примере. В таких случаях SQLite возвращает одну строку со столбцами, определенными выражениями, например литералами, с заданными псевдонимами ``expr AS alias``.

source: You can create a custom :attr:`~Cursor.row_factory` that returns each row as a :class:`dict`, with column names mapped to values:
pt_br: Вы можете создать собственный :attr:`~Cursor.row_factory`, который возвращает каждую строку как :class:`dict`, с именами столбцов, сопоставленными со значениями:

source: Using it, queries now return a :class:`!dict` instead of a :class:`!tuple`:
pt_br: Используя его, запросы теперь возвращают :class:`!dict` вместо :class:`!tuple`:

source: The following row factory returns a :term:`named tuple`:
pt_br: Следующая фабрика строк возвращает именованный кортеж:

source: :func:`!namedtuple_factory` can be used as follows:
pt_br: :func:`!namedtuple_factory` можно использовать следующим образом:

source: With some adjustments, the above recipe can be adapted to use a :class:`~dataclasses.dataclass`, or any other custom class, instead of a :class:`~collections.namedtuple`.
pt_br: С некоторыми изменениями приведенный выше рецепт можно адаптировать для использования :class:`~dataclasses.dataclass` или любого другого пользовательского класса вместо :class:`~collections.namedtuple`.

source: How to handle non-UTF-8 text encodings
pt_br: Как обрабатывать текстовые кодировки, отличные от UTF-8

source: By default, :mod:`!sqlite3` uses :class:`str` to adapt SQLite values with the ``TEXT`` data type. This works well for UTF-8 encoded text, but it might fail for other encodings and invalid UTF-8. You can use a custom :attr:`~Connection.text_factory` to handle such cases.
pt_br: По умолчанию :mod:`!sqlite3` использует :class:`str` для адаптации значений SQLite к типу данных ``TEXT``. Это хорошо работает для текста в кодировке UTF-8, но может не работать для других кодировок и недопустимого UTF-8. Для обработки таких случаев вы можете использовать собственный :attr:`~Connection.text_factory`.

source: Because of SQLite's `flexible typing`_, it is not uncommon to encounter table columns with the ``TEXT`` data type containing non-UTF-8 encodings, or even arbitrary data. To demonstrate, let's assume we have a database with ISO-8859-2 (Latin-2) encoded text, for example a table of Czech-English dictionary entries. Assuming we now have a :class:`Connection` instance :py:data:`!con` connected to this database, we can decode the Latin-2 encoded text using this :attr:`~Connection.text_factory`:
pt_br: Благодаря «гибкой типизации» SQLite нередко можно встретить столбцы таблицы с типом данных «ТЕКСТ», содержащими кодировки, отличные от UTF-8, или даже произвольные данные. Для демонстрации предположим, что у нас есть база данных с текстом в кодировке ISO-8859-2 (Latin-2), например таблица статей чешско-английского словаря. Предполагая, что теперь у нас есть экземпляр :class:`Connection` :py:data:`!con`, подключенный к этой базе данных, мы можем декодировать текст в кодировке Latin-2, используя этот :attr:`~Connection.text_factory`:

source: For invalid UTF-8 or arbitrary data in stored in ``TEXT`` table columns, you can use the following technique, borrowed from the :ref:`unicode-howto`:
pt_br: Для недопустимых UTF-8 или произвольных данных, хранящихся в столбцах таблицы ``TEXT``, вы можете использовать следующий метод, заимствованный из :ref:`unicode-howto`:

source: The :mod:`!sqlite3` module API does not support strings containing surrogates.
pt_br: API модуля :mod:`!sqlite3` не поддерживает строки, содержащие суррогаты.

source: Explanation
pt_br: Explicação

source: Transaction control
pt_br: Controle de transações

source: :mod:`!sqlite3` offers multiple methods of controlling whether, when and how database transactions are opened and closed. :ref:`sqlite3-transaction-control-autocommit` is recommended, while :ref:`sqlite3-transaction-control-isolation-level` retains the pre-Python 3.12 behaviour.
pt_br: :mod:`!sqlite3` oferece vários métodos para controlar se, quando e como as transações do banco de dados são abertas e fechadas. :ref:`sqlite3-transaction-control-autocommit` é recomendado, enquanto :ref:`sqlite3-transaction-control-isolation-level` mantém o comportamento pré-Python 3.12.

source: Transaction control via the ``autocommit`` attribute
pt_br: Controle de transações através do atributo ``autocommit``

source: The recommended way of controlling transaction behaviour is through the :attr:`Connection.autocommit` attribute, which should preferably be set using the *autocommit* parameter of :func:`connect`.
pt_br: A forma recomendada de controlar o comportamento da transação é através do atributo :attr:`Connection.autocommit`, que deve ser preferencialmente definido usando o parâmetro *autocommit* de :func:`connect`.

source: It is suggested to set *autocommit* to ``False``, which implies :pep:`249`-compliant transaction control. This means:
pt_br: É sugerido definir *autocommit* como ``False``, o que implica controle de transação compatível com a :pep:`249`. Isso significa:

source: :mod:`!sqlite3` ensures that a transaction is always open, so :func:`connect`, :meth:`Connection.commit`, and :meth:`Connection.rollback` will implicitly open a new transaction (immediately after closing the pending one, for the latter two). :mod:`!sqlite3` uses ``BEGIN DEFERRED`` statements when opening transactions.
pt_br: :mod:`!sqlite3` garante que uma transação esteja sempre aberta, então :func:`connect`, :meth:`Connection.commit` e :meth:`Connection.rollback` abrirão implicitamente uma nova transação (imediatamente após fechando a pendência, para as duas últimas). :mod:`!sqlite3` usa instruções ``BEGIN DEFERRED`` ao abrir transações.

source: Transactions should be committed explicitly using :meth:`!commit`.
pt_br: Transações devem ser executadas explicitamente usando :meth:`!commit`.

source: Transactions should be rolled back explicitly using :meth:`!rollback`.
pt_br: Transações devem ser revertidas explicitamente usando :meth:`!rollback`.

source: An implicit rollback is performed if the database is :meth:`~Connection.close`-ed with pending changes.
pt_br: Uma reversão implícita é executada se o banco de dados estiver em estado :meth:`~Connection.close` com alterações pendentes.

source: Set *autocommit* to ``True`` to enable SQLite's `autocommit mode`_. In this mode, :meth:`Connection.commit` and :meth:`Connection.rollback` have no effect. Note that SQLite's autocommit mode is distinct from the :pep:`249`-compliant :attr:`Connection.autocommit` attribute; use :attr:`Connection.in_transaction` to query the low-level SQLite autocommit mode.
pt_br: Defina *autocommit* como ``True`` para ativar o `modo autocommit`_ do SQLite. Neste modo, :meth:`Connection.commit` e :meth:`Connection.rollback` não têm efeito. Observe que o modo autocommit do SQLite é distinto do atributo :attr:`Connection.autocommit` compatível com :pep:`249`; use :attr:`Connection.in_transaction` para consultar o modo de confirmação automática do SQLite de baixo nível.

source: Set *autocommit* to :data:`LEGACY_TRANSACTION_CONTROL` to leave transaction control behaviour to the :attr:`Connection.isolation_level` attribute. See :ref:`sqlite3-transaction-control-isolation-level` for more information.
pt_br: Defina *autocommit* como :data:`LEGACY_TRANSACTION_CONTROL` para deixar o comportamento de controle de transação para o atributo :attr:`Connection.isolation_level`. Veja :ref:`sqlite3-transaction-control-isolation-level` para mais informações.

source: Transaction control via the ``isolation_level`` attribute
pt_br: Controle de transação através do atributo ``isolation_level``

source: The recommended way of controlling transactions is via the :attr:`~Connection.autocommit` attribute. See :ref:`sqlite3-transaction-control-autocommit`.
pt_br: A forma recomendada de controlar transações é através do atributo :attr:`~Connection.autocommit`. Veja :ref:`sqlite3-transaction-control-autocommit`.

source: If :attr:`Connection.autocommit` is set to :data:`LEGACY_TRANSACTION_CONTROL` (the default), transaction behaviour is controlled using the :attr:`Connection.isolation_level` attribute. Otherwise, :attr:`!isolation_level` has no effect.
pt_br: Se :attr:`Connection.autocommit` estiver definido como :data:`LEGACY_TRANSACTION_CONTROL` (o padrão), o comportamento da transação é controlado usando o atributo :attr:`Connection.isolation_level`. Caso contrário, :attr:`!isolation_level` não tem efeito.

source: If the connection attribute :attr:`~Connection.isolation_level` is not ``None``, new transactions are implicitly opened before :meth:`~Cursor.execute` and :meth:`~Cursor.executemany` executes ``INSERT``, ``UPDATE``, ``DELETE``, or ``REPLACE`` statements; for other statements, no implicit transaction handling is performed. Use the :meth:`~Connection.commit` and :meth:`~Connection.rollback` methods to respectively commit and roll back pending transactions. You can choose the underlying `SQLite transaction behaviour`_ — that is, whether and what type of ``BEGIN`` statements :mod:`!sqlite3` implicitly executes – via the :attr:`~Connection.isolation_level` attribute.
pt_br: Se o atributo de conexão :attr:`~Connection.isolation_level` não for ``None``, novas transações são abertas implicitamente antes de :meth:`~Cursor.execute` e :meth:`~Cursor.executemany` executa instruções ``INSERT``, ``UPDATE``, ``DELETE`` ou ``REPLACE``; para outras instruções, nenhuma manipulação de transação implícita é executada. Use os métodos :meth:`~Connection.commit` e :meth:`~Connection.rollback` para fazer commit e reverter respectivamente transações pendentes. Você pode escolher o `comportamento subjacente de transação do SQLite`_ -- isto é, se e que tipo de instruções ``BEGIN`` do :mod:`!sqlite3` são executadas implicitamente -- através do atributo :attr:`~Connection.isolation_level`.

source: If :attr:`~Connection.isolation_level` is set to ``None``, no transactions are implicitly opened at all. This leaves the underlying SQLite library in `autocommit mode`_, but also allows the user to perform their own transaction handling using explicit SQL statements. The underlying SQLite library autocommit mode can be queried using the :attr:`~Connection.in_transaction` attribute.
pt_br: Se :attr:`~Connection.isolation_level` estiver definido como ``None``, nenhuma transação será aberta implicitamente. Isso deixa a biblioteca SQLite subjacente no `modo autocommit`_, mas também permite que o usuário execute sua própria manipulação de transações usando instruções SQL explícitas. O modo de autocommit da biblioteca SQLite subjacente pode ser consultado usando o atributo :attr:`~Connection.in_transaction`.
