Repository: python/python-docs-pt-br
Catalog: library/statistics.po
Languages: pt_br

source: For example, demographic information may have been summarized into consecutive ten-year age groups with each group being represented by the 5-year midpoints of the intervals:
pt_br: Por exemplo, as informações demográficas podem ter sido resumidas em grupos etários consecutivos de dez anos, com cada grupo sendo representado pelos pontos médios de cinco anos dos intervalos:

source: The 50th percentile (median) is the 536th person out of the 1071 member cohort. That person is in the 30 to 40 year old age group.
pt_br: O 50º percentil (mediana) é a 536ª pessoa de 1071 membros. Essa pessoa está na faixa etária de 30 a 40 anos.

source: The regular :func:`median` function would assume that everyone in the tricenarian age group was exactly 35 years old. A more tenable assumption is that the 484 members of that age group are evenly distributed between 30 and 40. For that, we use :func:`median_grouped`:
pt_br: A função regular :func:`median` iria presumir que todos na faixa etária tricenariana tinham exatamente 35 anos. Uma suposição mais sustentável é que os 484 membros dessa faixa etária estão distribuídos uniformemente entre 30 e 40. Para isso, usamos :func:`median_grouped`:

source: The caller is responsible for making sure the data points are separated by exact multiples of *interval*. This is essential for getting a correct result. The function does not check this precondition.
pt_br: O chamador é responsável por garantir que os pontos de dados sejam separados por múltiplos exatos de *intervalo*. Isso é essencial para obter um resultado correto. A função não verifica essa pré-condição.

source: Inputs may be any numeric type that can be coerced to a float during the interpolation step.
pt_br: As entradas podem ser qualquer tipo numérico que possa ser convertido para um ponto flutuante durante a etapa de interpolação.

source: Return the single most common data point from discrete or nominal *data*. The mode (when it exists) is the most typical value and serves as a measure of central location.
pt_br: Retorna o valor mais comum dos dados discretos ou nominais em *data*. A moda (quando existe) é o valor mais típico e serve como uma medida de localização central.

source: If there are multiple modes with the same frequency, returns the first one encountered in the *data*. If the smallest or largest of those is desired instead, use ``min(multimode(data))`` or ``max(multimode(data))``. If the input *data* is empty, :exc:`StatisticsError` is raised.
pt_br: Se existirem múltiplas modas com a mesma frequência, retorna a primeira encontrada em *data*. Se ao invés disso se desejar a menor ou a maior dentre elas, use ``min(multimode(data))`` ou ``max(multimode(data))``. Se a entrada *data* é vazia, a exceção :exc:`StatisticsError` é levantada.

source: ``mode`` assumes discrete data and returns a single value. This is the standard treatment of the mode as commonly taught in schools:
pt_br: ``mode`` presume que os dados são discretos e retorna um único valor. Esse é o tratamento padrão do conceito de moda normalmente ensinado nas escolas:

source: The mode is unique in that it is the only statistic in this package that also applies to nominal (non-numeric) data:
pt_br: A moda é única no sentido que é a única medida estatística nesse módulo que também se aplica a dados nominais (não-numéricos):

source: Only hashable inputs are supported. To handle type :class:`set`, consider casting to :class:`frozenset`. To handle type :class:`list`, consider casting to :class:`tuple`. For mixed or nested inputs, consider using this slower quadratic algorithm that only depends on equality tests: ``max(data, key=data.count)``.
pt_br: Somente entradas hasheáveis são suportadas. Para manipular o tipo :class:`set`, considere fazer a conversão para :class:`frozenset`. Para manipular o tipo :class:`list`, considere fazer a conversão para :class:`tuple`. Para entradas mistas ou aninhadas, considere usar este algoritmo quadrático mais lento que depende apenas de testes de igualdade: ``max(data, key=data.count)``.

source: Now handles multimodal datasets by returning the first mode encountered. Formerly, it raised :exc:`StatisticsError` when more than one mode was found.
pt_br: Agora lida com conjunto de dados multimodais retornando a primeira moda encontrada. Anteriormente, ela levantava a exceção :exc:`StatisticsError` quando mais do que uma moda era encontrada.

source: Return a list of the most frequently occurring values in the order they were first encountered in the *data*. Will return more than one result if there are multiple modes or an empty list if the *data* is empty:
pt_br: Retorna uma lista dos valores mais frequentes na ordem em que eles foram encontrados em *data*. Irá retornar mais do que um resultado se houver múltiplas modas ou uma lista vazia se *data* for vazio.

source: Return the population standard deviation (the square root of the population variance). See :func:`pvariance` for arguments and other details.
pt_br: Retorna o desvio padrão populacional (a raiz quadrada da variância populacional). Veja os argumentos e outros detalhes em :func:`pvariance`.

source: Return the population variance of *data*, a non-empty sequence or iterable of real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
pt_br: Retorna a variância populacional de *data*, que deve ser uma sequência ou iterável não-vazio de números reais. A variância, o segundo momento estatístico a partir da média, é uma medida da variabilidade (espalhamento ou dispersão) dos dados. Uma variância grande indica que os dados são espalhados; uma variância menor indica que os dados estão agrupado em volta da média.

source: If the optional second argument *mu* is given, it should be the *population* mean of the *data*. It can also be used to compute the second moment around a point that is not the mean. If it is missing or ``None`` (the default), the arithmetic mean is automatically calculated.
pt_br: Se o segundo argumento opcional *mu* for fornecido, ele deve ser a média da *população* dos dados em *data*. Ele também pode ser usado para calcular o segundo momento em torno de um ponto que não é a média. Se estiver faltando ou for ``None`` (o padrão), a média aritmética é calculada automaticamente.

source: Use this function to calculate the variance from the entire population. To estimate the variance from a sample, the :func:`variance` function is usually a better choice.
pt_br: Use essa função para calcular a variância de toda a população. Para estimar a variância de uma amostra, a função :func:`variance` costuma ser uma escolha melhor.

source: Raises :exc:`StatisticsError` if *data* is empty.
pt_br: Levanta :exc:`StatisticsError` se *data* for vazio.

source: Examples:
pt_br: Exemplos:

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *mu* to avoid recalculation:
pt_br: Se você já calculou a média dos seus dados, você pode passar o valor no segundo argumento opcional *mu* para evitar recálculos:

source: Decimals and Fractions are supported:
pt_br: Decimais e frações são suportadas:

source: When called with the entire population, this gives the population variance σ². When called on a sample instead, this is the biased sample variance s², also known as variance with N degrees of freedom.
pt_br: Quando os dados de entrada representarem toda a população, ele retorna a variância populacional σ². Se em vez disso, amostras forem usadas, então a variância amostral enviesada s², também conhecida como variância com N graus de liberdade é retornada.

source: If you somehow know the true population mean μ, you may use this function to calculate the variance of a sample, giving the known population mean as the second argument. Provided the data points are a random sample of the population, the result will be an unbiased estimate of the population variance.
pt_br: Se de alguma forma você souber a verdadeira média populacional μ, você pode usar essa função para calcular a variância de uma amostra, fornecendo a média populacional conhecida como segundo argumento. Caso seja fornecido um conjunto de amostras aleatórias da população, o resultado será um estimador não enviesado da variância populacional.

source: Return the sample standard deviation (the square root of the sample variance). See :func:`variance` for arguments and other details.
pt_br: Retorna o desvio padrão amostral (a raiz quadrada da variância amostral). Veja :func:`variance` para argumentos e outros detalhes.

source: Return the sample variance of *data*, an iterable of at least two real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
pt_br: Retorna a variância amostral de *data*, que deve ser um iterável com pelo menos dois números reais. Variância, ou o segundo momento estatístico a partir da média, é uma medida de variabilidade (espalhamento ou dispersão) dos dados. Uma variância grande indica que os dados são espalhados, uma variância menor indica que os dados estão agrupados em volta da média.

source: If the optional second argument *xbar* is given, it should be the *sample* mean of *data*. If it is missing or ``None`` (the default), the mean is automatically calculated.
pt_br: Se o segundo argumento opcional *xbar* for dado, ele deve a média *sample* de *data*. Se ele não estiver presente ou for ``None`` (valor padrão), a média é automaticamente calculada.

source: Use this function when your data is a sample from a population. To calculate the variance from the entire population, see :func:`pvariance`.
pt_br: Use essa função quando seus dados representarem uma amostra da população. Para calcular a variância de toda população veja :func:`pvariance`.

source: Raises :exc:`StatisticsError` if *data* has fewer than two values.
pt_br: Levanta a exceção :exc:`StatisticsError` se *data* tiver menos do que dois valores.

source: If you have already calculated the sample mean of your data, you can pass it as the optional second argument *xbar* to avoid recalculation:
pt_br: Se você já calculou a média amostral dos seus dados, você pode passar o valor no segundo argumento opcional *xbar* para evitar recálculos:

source: This function does not attempt to verify that you have passed the actual mean as *xbar*. Using arbitrary values for *xbar* can lead to invalid or impossible results.
pt_br: Essa função não verifica se você passou a média verdadeira como *xbar*. Usar valores arbitrários para *xbar* pode levar a resultados inválidos ou impossíveis.

source: Decimal and Fraction values are supported:
pt_br: Decimais e frações são suportados.

source: This is the sample variance s² with Bessel's correction, also known as variance with N-1 degrees of freedom. Provided that the data points are representative (e.g. independent and identically distributed), the result should be an unbiased estimate of the true population variance.
pt_br: Essa é a variância amostral s² com a correção de Bessel, também conhecida como variância com N-1 graus de liberdade. Desde que os pontos de dados sejam representativos (por exemplo, independentes e distribuídos de forma idêntica), o resultado deve ser uma estimativa não enviesada da verdadeira variação populacional.

source: If you somehow know the actual population mean μ you should pass it to the :func:`pvariance` function as the *mu* parameter to get the variance of a sample.
pt_br: Caso você de alguma forma saiba a verdadeira média populacional μ você deveria passar para a função :func:`pvariance` como o parâmetro *mu* para obter a variância da amostra.

source: Divide *data* into *n* continuous intervals with equal probability. Returns a list of ``n - 1`` cut points separating the intervals.
pt_br: Divide *data* em *n* intervalos contínuos com igual probabilidade. Retorna uma lista de ``n - 1`` pontos de corte separando os intervalos.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate *data* into 100 equal sized groups. Raises :exc:`StatisticsError` if *n* is not least 1.
pt_br: Defina *n* como 4 para quartis (o padrão). Defina *n* como 10 para decis. Defina *n* como 100 para percentis, o que fornece os 99 pontos de corte que separam *data* em 100 grupos de tamanhos iguais. Levanta a exceção :exc:`StatisticsError` se *n* não for pelo menos 1.

source: The *data* can be any iterable containing sample data. For meaningful results, the number of data points in *data* should be larger than *n*. Raises :exc:`StatisticsError` if there is not at least one data point.
pt_br: *data* pode ser qualquer iterável contendo dados amostrais. Para resultados significativos, a quantidade de dados em *data* deve ser maior do que *n*. Levanta a exceção :exc:`StatisticsError` se não houver pelo menos um ponto de dados.

source: The cut points are linearly interpolated from the two nearest data points. For example, if a cut point falls one-third of the distance between two sample values, ``100`` and ``112``, the cut-point will evaluate to ``104``.
pt_br: Os pontos de corte são linearmente interpolados a partir dos dois pontos mais próximos. Por exemplo, se um ponto de corte cair em um terço da distância entre dois valores, ``100`` e ``112``, o ponto de corte será avaliado como ``104``.

source: The *method* for computing quantiles can be varied depending on whether the *data* includes or excludes the lowest and highest possible values from the population.
pt_br: O *method* para computar quantis pode variar dependendo se *data* incluir ou excluir os menores e maiores valores possíveis da população.

source: The default *method* is "exclusive" and is used for data sampled from a population that can have more extreme values than found in the samples. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``i / (m + 1)``. Given nine sample values, the method sorts them and assigns the following percentiles: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.
pt_br: O valor padrão do parâmetro *method* é "exclusive" e é usado para dados amostrados de uma população que pode ter valores mais extremos do que os encontrados nas amostras. A porção da população que fica abaixo do *i-ésimo* item de *m* pontos ordenados é calculada como ``i / (m + 1)``. Dados nove valores, o método os ordena e atribui a eles os seguintes percentis: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.

source: Setting the *method* to "inclusive" is used for describing population data or for samples that are known to include the most extreme values from the population. The minimum value in *data* is treated as the 0th percentile and the maximum value is treated as the 100th percentile. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``(i - 1) / (m - 1)``. Given 11 sample values, the method sorts them and assigns the following percentiles: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.
pt_br: Definimos o parâmetro *method* para "inclusive" para descrever dados da população ou para amostras que são conhecidas por incluir os valores mais extremos da população. O mínimo valor em *data* é tratado como o percentil 0 e o máximo valor é tratado como percentil 100. A porção da população que fica abaixo do *i-ésimo* item de *m* pontos ordenados é calculada como ``(i - 1) / (m - 1)``. Dados 11 valores, o método os ordena e atribui a eles os seguintes percentis: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.

source: # Decile cut points for empirically sampled data >>> data = [105, 129, 87, 86, 111, 111, 89, 81, 108, 92, 110, ... 100, 75, 105, 103, 109, 76, 119, 99, 91, 103, 129, ... 106, 101, 84, 111, 74, 87, 86, 103, 103, 106, 86, ... 111, 75, 87, 102, 121, 111, 88, 89, 101, 106, 95, ... 103, 107, 101, 81, 109, 104] >>> [round(q, 1) for q in quantiles(data, n=10)] [81.0, 86.2, 89.0, 99.4, 102.5, 103.6, 106.0, 109.8, 111.0]
pt_br: # Pontos de corte de decil para dados amostrados empiricamente >>> data = [105, 129, 87, 86, 111, 111, 89, 81, 108, 92, 110, ... 100, 75, 105, 103, 109, 76, 119, 99, 91, 103, 129, ... 106, 101, 84, 111, 74, 87, 86, 103, 103, 106, 86, ... 111, 75, 87, 102, 121, 111, 88, 89, 101, 106, 95, ... 103, 107, 101, 81, 109, 104] >>> [round(q, 1) for q in quantiles(data, n=10)] [81.0, 86.2, 89.0, 99.4, 102.5, 103.6, 106.0, 109.8, 111.0]

source: No longer raises an exception for an input with only a single data point. This allows quantile estimates to be built up one sample point at a time becoming gradually more refined with each new data point.
pt_br: Não levanta mais uma exceção para uma entrada com apenas um único ponto de dados. Isso permite que estimativas de quantil sejam construídas um ponto de amostra por vez, tornando-se gradualmente mais refinadas com cada novo ponto de dados.

source: Return the sample covariance of two inputs *x* and *y*. Covariance is a measure of the joint variability of two inputs.
pt_br: Retorna a covariância da amostra de duas entradas *x* e *y*. Covariância é uma medida da variabilidade conjunta de duas entradas.

source: Both inputs must be of the same length (no less than two), otherwise :exc:`StatisticsError` is raised.
pt_br: Ambas as entradas devem ter o mesmo comprimento (não menos que dois), caso contrário, :exc:`StatisticsError` será levantada.

source: Return the `Pearson's correlation coefficient <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ for two inputs. Pearson's correlation coefficient *r* takes values between -1 and +1. It measures the strength and direction of a linear relationship.
pt_br: Retorna o `coeficiente de correlação de Pearson <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ para duas entradas. O coeficiente de correlação de Pearson *r* assume valores entre -1 e +1. Ele mede a força e a direção de uma relação linear.

source: If *method* is "ranked", computes `Spearman's rank correlation coefficient <https://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient>`_ for two inputs. The data is replaced by ranks. Ties are averaged so that equal values receive the same rank. The resulting coefficient measures the strength of a monotonic relationship.
pt_br: Se *method* for "ranked", calcula `coeficiente de correlação de classificação de Spearman <https://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient>`_ para duas entradas. Os dados são substituídos por classificações. Os empates são calculados em média para que valores iguais recebam a mesma classificação. O coeficiente resultante mede a força de um relacionamento monotônico.

source: Spearman's correlation coefficient is appropriate for ordinal data or for continuous data that doesn't meet the linear proportion requirement for Pearson's correlation coefficient.
pt_br: O coeficiente de correlação de Spearman é apropriado para dados ordinais ou para dados contínuos que não atendem ao requisito de proporção linear para o coeficiente de correlação de Pearson.

source: Both inputs must be of the same length (no less than two), and need not to be constant, otherwise :exc:`StatisticsError` is raised.
pt_br: Ambas as entradas devem ter o mesmo comprimento (não menos que dois) e não precisam ser constantes, caso contrário, :exc:`StatisticsError` será levantada.

source: Example with `Kepler's laws of planetary motion <https://en.wikipedia.org/wiki/Kepler's_laws_of_planetary_motion>`_:
pt_br: Exemplo com `leis de Kepler do movimento planetário <https://en.wikipedia.org/wiki/Kepler's_laws_of_planetary_motion>`_:

source: >>> # Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, and Neptune >>> orbital_period = [88, 225, 365, 687, 4331, 10_756, 30_687, 60_190] # days >>> dist_from_sun = [58, 108, 150, 228, 778, 1_400, 2_900, 4_500] # million km >>> # Show that a perfect monotonic relationship exists >>> correlation(orbital_period, dist_from_sun, method='ranked') 1.0 >>> # Observe that a linear relationship is imperfect >>> round(correlation(orbital_period, dist_from_sun), 4) 0.9882 >>> # Demonstrate Kepler's third law: There is a linear correlation >>> # between the square of the orbital period and the cube of the >>> # distance from the sun. >>> period_squared = [p * p for p in orbital_period] >>> dist_cubed = [d * d * d for d in dist_from_sun] >>> round(correlation(period_squared, dist_cubed), 4) 1.0
pt_br: >>> # Mercúrio, Venus, Terra, Marte, Jupiter, Saturno, Urano e Netuno >>> orbital_period = [88, 225, 365, 687, 4331, 10_756, 30_687, 60_190] # dias >>> dist_from_sun = [58, 108, 150, 228, 778, 1_400, 2_900, 4_500] # milhões de km >>> # Mostra que existe uma perfeita relação monótona >>> correlation(orbital_period, dist_from_sun, method='ranked') 1.0 >>> # Observe que uma relação linear é imperfeita >>> round(correlation(orbital_period, dist_from_sun), 4) 0.9882 >>> # Demonstra a terceira lei de Kepler: Há uma correlação linear >>> # entre o quadrado do período orbital e o cubo da >>> # distância a partir do sol. >>> period_squared = [p * p for p in orbital_period] >>> dist_cubed = [d * d * d for d in dist_from_sun] >>> round(correlation(period_squared, dist_cubed), 4) 1.0

source: Added support for Spearman's rank correlation coefficient.
pt_br: Adicionado suporte para o coeficiente de correlação de classificação de Spearman.

source: Return the slope and intercept of `simple linear regression <https://en.wikipedia.org/wiki/Simple_linear_regression>`_ parameters estimated using ordinary least squares. Simple linear regression describes the relationship between an independent variable *x* and a dependent variable *y* in terms of this linear function:
pt_br: Retorna a inclinação e a interceptação dos parâmetros de `regressão linear simples <https://en.wikipedia.org/wiki/Simple_linear_regression>`_ estimados usando mínimos quadrados ordinários. A regressão linear simples descreve a relação entre uma variável independente *x* e uma variável dependente *y* em termos desta função linear:

source: where ``slope`` and ``intercept`` are the regression parameters that are estimated, and ``noise`` represents the variability of the data that was not explained by the linear regression (it is equal to the difference between predicted and actual values of the dependent variable).
pt_br: onde ``slope`` e ``intercept`` são os parâmetros de regressão que são estimados, e ``noise`` representa a variabilidade dos dados que não foi explicada pela regressão linear (é igual à diferença entre os valores previstos e reais da variável dependente).

source: Both inputs must be of the same length (no less than two), and the independent variable *x* cannot be constant; otherwise a :exc:`StatisticsError` is raised.
pt_br: Ambas as entradas devem ter o mesmo comprimento (não menos que dois) e a variável independente *x* não pode ser constante; caso contrário, um :exc:`StatisticsError` será levantada.

source: For example, we can use the `release dates of the Monty Python films <https://en.wikipedia.org/wiki/Monty_Python#Films>`_ to predict the cumulative number of Monty Python films that would have been produced by 2019 assuming that they had kept the pace.
pt_br: Por exemplo, podemos usar as `datas de lançamento dos filmes do Monty Python <https://en.wikipedia.org/wiki/Monty_Python#Films>`_ para prever o número cumulativo de filmes do Monty Python que teriam sido produzidos até 2019, supondo que eles tivessem mantido o ritmo.
