Repository: python/python-docs-pt-br
Catalog: library/statistics.po
Languages: pt_br

source: :mod:`!statistics` --- Mathematical statistics functions
pt_br: :mod:`!statistics` --- Funções estatísticas

source: **Source code:** :source:`Lib/statistics.py`
pt_br: **Código-fonte:** :source:`Lib/statistics.py`

source: This module provides functions for calculating mathematical statistics of numeric (:class:`~numbers.Real`-valued) data.
pt_br: Esse módulo fornece funções para o cálculo de estatísticas matemáticas de dados numéricos (para valores do tipo :class:`~numbers.Real`).

source: The module is not intended to be a competitor to third-party libraries such as `NumPy <https://numpy.org>`_, `SciPy <https://scipy.org/>`_, or proprietary full-featured statistics packages aimed at professional statisticians such as Minitab, SAS and Matlab. It is aimed at the level of graphing and scientific calculators.
pt_br: O módulo não tem a intenção de competir com bibliotecas de terceiros como `NumPy <https://numpy.org>`_, `SciPy <https://scipy.org/>`_, ou pacotes proprietários de estatísticas com todos os recursos destinados a estatísticos profissionais como Minitab, SAS e Matlab. Ela destina-se ao nível de calculadoras gráficas e científicas.

source: Unless explicitly noted, these functions support :class:`int`, :class:`float`, :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Behaviour with other types (whether in the numeric tower or not) is currently unsupported. Collections with a mix of types are also undefined and implementation-dependent. If your input data consists of mixed types, you may be able to use :func:`map` to ensure a consistent result, for example: ``map(float, input_data)``.
pt_br: A menos que seja explicitamente indicado, essas funções suportam :class:`int`, :class:`float`, :class:`~decimal.Decimal` e :class:`~fractions.Fraction`. O uso com outros tipos (sejam numéricos ou não) não é atualmente suportado. Coleções com uma mistura de tipos também são indefinidas e dependentes da implementação. Se os seus dados de entrada consistem de tipos misturados, você pode usar :func:`map` para garantir um resultado consistente, por exemplo ``map(float, dado_entrada)``.

source: Some datasets use ``NaN`` (not a number) values to represent missing data. Since NaNs have unusual comparison semantics, they cause surprising or undefined behaviors in the statistics functions that sort data or that count occurrences. The functions affected are ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()``, and ``quantiles()``. The ``NaN`` values should be stripped before calling these functions::
pt_br: Alguns conjuntos de dados usam valores ``NaN`` (não um número) para representar dados ausentes. Como os NaNs possuem semântica de comparação incomum, eles causam comportamentos surpreendentes ou indefinidos nas funções estatísticas que classificam dados ou contam ocorrências. As funções afetadas são ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()`` e ``quantiles()``. Os valores ``NaN`` devem ser removidos antes de chamar estas funções::

source: >>> from statistics import median >>> from math import isnan >>> from itertools import filterfalse >>> data = [20.7, float('NaN'),19.2, 18.3, float('NaN'), 14.4] >>> sorted(data) # This has surprising behavior [20.7, nan, 14.4, 18.3, 19.2, nan] >>> median(data) # This result is unexpected 16.35 >>> sum(map(isnan, data)) # Number of missing values 2 >>> clean = list(filterfalse(isnan, data)) # Strip NaN values >>> clean [20.7, 19.2, 18.3, 14.4] >>> sorted(clean) # Sorting now works as expected [14.4, 18.3, 19.2, 20.7] >>> median(clean) # This result is now well defined 18.75
pt_br: >>> from statistics import median >>> from math import isnan >>> from itertools import filterfalse >>> data = [20.7, float('NaN'),19.2, 18.3, float('NaN'), 14.4] >>> sorted(data) # Isso tem um comportamento surpreendente [20.7, nan, 14.4, 18.3, 19.2, nan] >>> median(data) # Este resultado é inesperado 16.35 >>> sum(map(isnan, data)) # Número de valores em falta 2 >>> clean = list(filterfalse(isnan, data)) # Remove valores NaN >>> clean [20.7, 19.2, 18.3, 14.4] >>> sorted(clean) # A classificação agora funciona como esperado [14.4, 18.3, 19.2, 20.7] >>> median(clean) # Este resultado é agora bem definido 18.75

source: Averages and measures of central location
pt_br: Médias e medidas de valor central

source: These functions calculate an average or typical value from a population or sample.
pt_br: Essas funções calculam a média ou o valor típico de uma população ou amostra.

source: Arithmetic mean ("average") of data.
pt_br: Média aritmética dos dados.

source: Fast, floating-point arithmetic mean, with optional weighting.
pt_br: Média aritmética rápida de ponto flutuante, com ponderação opcional.

source: Geometric mean of data.
pt_br: Média geométrica dos dados.

source: Harmonic mean of data.
pt_br: Média harmônica dos dados.

source: Estimate the probability density distribution of the data.
pt_br: Estima a distribuição de densidade de probabilidade dos dados.

source: Random sampling from the PDF generated by kde().
pt_br: Amostragem aleatória do PDF gerado por kde().

source: Median (middle value) of data.
pt_br: Mediana (valor do meio) dos dados.

source: Low median of data.
pt_br: Mediana inferior dos dados.

source: High median of data.
pt_br: Mediana superior dos dados.

source: Median (50th percentile) of grouped data.
pt_br: Mediana (50º percentil) dos dados agrupados.

source: Single mode (most common value) of discrete or nominal data.
pt_br: Moda (valor mais comum) de dados discretos ou nominais.

source: List of modes (most common values) of discrete or nominal data.
pt_br: Lista de modas (valores mais comuns) de dados discretos ou nominais.

source: Divide data into intervals with equal probability.
pt_br: Divide os dados em intervalos com probabilidade igual.

source: Measures of spread
pt_br: Medidas de espalhamento

source: These functions calculate a measure of how much the population or sample tends to deviate from the typical or average values.
pt_br: Essas funções calculam o quanto a população ou amostra tendem a desviar dos valores típicos ou médios.

source: Population standard deviation of data.
pt_br: Desvio padrão populacional dos dados.

source: Population variance of data.
pt_br: Variância populacional dos dados.

source: Sample standard deviation of data.
pt_br: Desvio padrão amostral dos dados.

source: Sample variance of data.
pt_br: Variância amostral dos dados.

source: Statistics for relations between two inputs
pt_br: Estatísticas para relações entre duas entradas

source: These functions calculate statistics regarding relations between two inputs.
pt_br: Essas funções calculam estatísticas sobre relações entre duas entradas.

source: Sample covariance for two variables.
pt_br: Covariância amostral para duas variáveis.

source: Pearson and Spearman's correlation coefficients.
pt_br: Coeficientes de correlação de Pearson e Spearman.

source: Slope and intercept for simple linear regression.
pt_br: Inclinação e intersecção para regressão linear simples.

source: Function details
pt_br: Detalhes das funções

source: Note: The functions do not require the data given to them to be sorted. However, for reading convenience, most of the examples show sorted sequences.
pt_br: Nota: as funções não exigem que os dados estejam ordenados. No entanto, para conveniência do leitor, a maioria dos exemplos mostrará sequências ordenadas.

source: Return the sample arithmetic mean of *data* which can be a sequence or iterable.
pt_br: Retorna a média aritmética amostral de *data* que pode ser uma sequência ou iterável.

source: The arithmetic mean is the sum of the data divided by the number of data points. It is commonly called "the average", although it is only one of many different mathematical averages. It is a measure of the central location of the data.
pt_br: A média aritmética é a soma dos dados dividida pela quantidade de dados. É comumente chamada apenas de "média", apesar de ser uma das diversas médias matemáticas. Ela representa uma medida da localização central dos dados.

source: If *data* is empty, :exc:`StatisticsError` will be raised.
pt_br: Se *data* for vazio, uma exceção do tipo :exc:`StatisticsError` será levantada.

source: Some examples of use:
pt_br: Alguns exemplos de uso:

source: The mean is strongly affected by `outliers <https://en.wikipedia.org/wiki/Outlier>`_ and is not necessarily a typical example of the data points. For a more robust, although less efficient, measure of `central tendency <https://en.wikipedia.org/wiki/Central_tendency>`_, see :func:`median`.
pt_br: A média é fortemente afetada por `outliers <https://pt.wikipedia.org/wiki/Outlier>`_ (valor atípico) e não é necessariamente um exemplo típico dos pontos de dados. Para uma medida mais robusta, embora menos eficiente, de `tendência central <https://pt.m.wikipedia.org/wiki/Tendência_central>`_, veja :func:`median`.

source: The sample mean gives an unbiased estimate of the true population mean, so that when taken on average over all the possible samples, ``mean(sample)`` converges on the true mean of the entire population. If *data* represents the entire population rather than a sample, then ``mean(data)`` is equivalent to calculating the true population mean μ.
pt_br: A média amostral fornece uma estimativa não enviesada da média populacional verdadeira, ou seja, quando a média é obtida para todas as possíveis amostras, ``mean(sample)`` converge para a média verdadeira de toda população. Se *data* representa toda população ao invés de uma amostra, então ``mean(data)`` é equivalente a calcular a verdadeira média populacional μ.

source: Convert *data* to floats and compute the arithmetic mean.
pt_br: Converte valores em *data* para ponto flutuante e calcula a média aritmética.

source: This runs faster than the :func:`mean` function and it always returns a :class:`float`. The *data* may be a sequence or iterable. If the input dataset is empty, raises a :exc:`StatisticsError`.
pt_br: Essa função executa mais rapidamente do que a função :func:`mean` e sempre retorna um :class:`float`. *data* pode ser uma sequência ou iterável. Se o conjunto de dados de entrada estiver vazio, levanta uma exceção :exc:`StatisticsError`.

source: Optional weighting is supported. For example, a professor assigns a grade for a course by weighting quizzes at 20%, homework at 20%, a midterm exam at 30%, and a final exam at 30%:
pt_br: A ponderação opcional é suportada. Por exemplo, um professor atribui uma nota para um curso ponderando questionários em 20%, trabalhos de casa em 20%, um exame de meio de período em 30% e um exame final em 30%:

source: If *weights* is supplied, it must be the same length as the *data* or a :exc:`ValueError` will be raised.
pt_br: Se *weights* for fornecido, deve ter o mesmo comprimento que *data* ou uma :exc:`ValueError` será levantada.

source: Added support for *weights*.
pt_br: Adicionado suporte a *weights*.

source: Convert *data* to floats and compute the geometric mean.
pt_br: Converte valores em *data* para ponto flutuante e calcula a média geométrica.

source: The geometric mean indicates the central tendency or typical value of the *data* using the product of the values (as opposed to the arithmetic mean which uses their sum).
pt_br: A média geométrica indica a tendência central ou valor típico de *data* usando o produto dos valores (em oposição à média aritmética que usa a soma deles).

source: Raises a :exc:`StatisticsError` if the input dataset is empty, if it contains a zero, or if it contains a negative value. The *data* may be a sequence or iterable.
pt_br: Levanta uma exceção :exc:`StatisticsError` se a entrada do conjunto de dados for vazia, contiver um zero ou um valor negativo. *data* pode ser uma sequência ou iterável.

source: No special efforts are made to achieve exact results. (However, this may change in the future.)
pt_br: Nenhum esforço especial é feito para alcançar resultados exatos. (Mas, isso pode mudar no futuro).

source: Return the harmonic mean of *data*, a sequence or iterable of real-valued numbers. If *weights* is omitted or ``None``, then equal weighting is assumed.
pt_br: Retorna a média harmônica de *data*, uma sequência ou iterável de números de valor real. Se *weights* for omitido ou ``None``, então a ponderação igual é presumida.

source: The harmonic mean is the reciprocal of the arithmetic :func:`mean` of the reciprocals of the data. For example, the harmonic mean of three values *a*, *b* and *c* will be equivalent to ``3/(1/a + 1/b + 1/c)``. If one of the values is zero, the result will be zero.
pt_br: A média harmônica é a recíproca da média arimética calculada pela função :func:`mean` dos recíprocos dos dados. Por exemplo, a média harmônica de três valores *a*, *b* e *c* será equivalente a ``3/(1/a + 1/b + 1/c)``. Se um dos valores for zero, o resultado também será zero.

source: The harmonic mean is a type of average, a measure of the central location of the data. It is often appropriate when averaging ratios or rates, for example speeds.
pt_br: A média harmônica é um tipo de média, uma medida de localização central dos dados. Ela é geralmente apropriada quando se está calculando a média de razões e taxas; por exemplo, velocidades.

source: Suppose a car travels 10 km at 40 km/hr, then another 10 km at 60 km/hr. What is the average speed?
pt_br: Suponha que um carro viaje 10 km a 40 km/h, e em seguida viaje mais 10 km a 60 km/h. Qual é a velocidade média?

source: Suppose a car travels 40 km/hr for 5 km, and when traffic clears, speeds-up to 60 km/hr for the remaining 30 km of the journey. What is the average speed?
pt_br: Suponha que um carro viaja a 40 km/h por 5 km e, quando o trânsito melhora, acelera para 60 km/h pelos 30 km restantes da viagem. Qual é a velocidade média?

source: :exc:`StatisticsError` is raised if *data* is empty, any element is less than zero, or if the weighted sum isn't positive.
pt_br: :exc:`StatisticsError` é levantada se *data* for vazio, qualquer elemento for menor que zero, ou se a soma ponderada não for positiva.

source: The current algorithm has an early-out when it encounters a zero in the input. This means that the subsequent inputs are not tested for validity. (This behavior may change in the future.)
pt_br: O algoritmo atual tem uma saída antecipada quando encontra um zero na entrada. Isso significa que as entradas subsequentes não tem a validade testada. (Esse comportamento pode mudar no futuro.)

source: `Kernel Density Estimation (KDE) <https://www.itm-conferences.org/articles/itmconf/pdf/2018/08/itmconf_sam2018_00037.pdf>`_: Create a continuous probability density function or cumulative distribution function from discrete samples.
pt_br: `Estimativa de densidade por Kernel (KDE) <https://www.itm-conferences.org/articles/itmconf/pdf/2018/08/itmconf_sam2018_00037.pdf>`_: Cria uma função de densidade de probabilidade contínua ou uma função de distribuição cumulativa a partir de amostras discretas.

source: The basic idea is to smooth the data using `a kernel function <https://en.wikipedia.org/wiki/Kernel_(statistics)>`_. to help draw inferences about a population from a sample.
pt_br: A ideia básica é suavizar os dados usando `uma função kernel <https://en.wikipedia.org/wiki/Kernel_(statistics)>`_. para ajudar a tirar inferências sobre uma população a partir de uma amostra.

source: The degree of smoothing is controlled by the scaling parameter *h* which is called the bandwidth. Smaller values emphasize local features while larger values give smoother results.
pt_br: O grau de suavização é controlado pelo parâmetro de escala *h*, que é chamado de largura de banda. Valores menores enfatizam características locais, enquanto valores maiores dão resultados mais suaves.

source: The *kernel* determines the relative weights of the sample data points. Generally, the choice of kernel shape does not matter as much as the more influential bandwidth smoothing parameter.
pt_br: O *kernel* determina os pesos relativos dos pontos de dados da amostra. Geralmente, a escolha do formato de kernel não importa tanto quanto o parâmetro de suavização de largura de banda mais influente.

source: Kernels that give some weight to every sample point include *normal* (*gauss*), *logistic*, and *sigmoid*.
pt_br: Os kernels que dão algum peso a cada ponto de amostra incluem *normal* (*gauss*), *logistic* e *sigmoid*.

source: Kernels that only give weight to sample points within the bandwidth include *rectangular* (*uniform*), *triangular*, *parabolic* (*epanechnikov*), *quartic* (*biweight*), *triweight*, and *cosine*.
pt_br: Os kernels que apenas dão peso aos pontos de amostra dentro da largura de banda incluem *rectangular* (*uniform*), *triangular*, *parabolic* (*epanechnikov*), *quartic* (*biweight*), *triweight* e *cosine*.

source: If *cumulative* is true, will return a cumulative distribution function.
pt_br: Se *cumulative* for verdadeiro, retornará uma função de distribuição cumulativa.

source: A :exc:`StatisticsError` will be raised if the *data* sequence is empty.
pt_br: Uma :exc:`StatisticsError` será levantada se a sequência de dados em *data* estiver vazia.

source: `Wikipedia has an example <https://en.wikipedia.org/wiki/Kernel_density_estimation#Example>`_ where we can use :func:`kde` to generate and plot a probability density function estimated from a small sample:
pt_br: `A Wikipédia tem um exemplo <hhttps://pt.wikipedia.org/wiki/Estimativa_de_densidade_kernel#Exemplo>`_ onde podemos usar :func:`kde` para gerar e plotar uma função de densidade de probabilidade estimada a partir de uma pequena amostra:

source: The points in ``xarr`` and ``yarr`` can be used to make a PDF plot:
pt_br: Os pontos em ``xarr`` e ``yarr`` podem ser usados para fazer um gráfico PDF:

source: Scatter plot of the estimated probability density function.
pt_br: Gráfico de dispersão da função de densidade de probabilidade estimada.

source: Return a function that makes a random selection from the estimated probability density function produced by ``kde(data, h, kernel)``.
pt_br: Retorna uma função que faz uma seleção aleatória da função de densidade de probabilidade estimada produzida por ``kde(data, h, kernel)``.

source: Providing a *seed* allows reproducible selections. In the future, the values may change slightly as more accurate kernel inverse CDF estimates are implemented. The seed may be an integer, float, str, or bytes.
pt_br: Fornecer uma *seed* permite seleções reproduzíveis. No futuro, os valores podem mudar um pouco conforme estimativas de funções de distribuição acumulada (CDF) inversas de kernel mais precisas forem implementadas. *seed* pode ser um inteiro, float, str ou bytes.

source: Continuing the example for :func:`kde`, we can use :func:`kde_random` to generate new random selections from an estimated probability density function:
pt_br: Continuando o exemplo de :func:`kde`, podemos usar :func:`kde_random` para gerar novas seleções aleatórias a partir de uma função de densidade de probabilidade estimada:

source: Return the median (middle value) of numeric data, using the common "mean of middle two" method. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
pt_br: Retorna a mediana (o valor do meio) de dados numéricos, usando o método comum de "média entre os dois do meio". Se *data* for vazio, é levantada uma exceção :exc:`StatisticsError`. *data* pode ser uma sequência ou um iterável.

source: The median is a robust measure of central location and is less affected by the presence of outliers. When the number of data points is odd, the middle data point is returned:
pt_br: A mediana é uma medida robusta de localização central e é menos afetada por valores discrepantes. Quando a quantidade de pontos de dados for ímpar, o valor de meio é retornado:

source: When the number of data points is even, the median is interpolated by taking the average of the two middle values:
pt_br: Quando o número de elementos for par, a mediana é calculada tomando-se a média entre os dois valores no meio:

source: This is suited for when your data is discrete, and you don't mind that the median may not be an actual data point.
pt_br: Isso serve quando seus dados forem discretos e você não se importa que a média possa não ser um valor que de fato ocorre nos seus dados.

source: If the data is ordinal (supports order operations) but not numeric (doesn't support addition), consider using :func:`median_low` or :func:`median_high` instead.
pt_br: Caso os dados sejam ordinais (oferecem suporte para operações de ordenação) mas não são numéricos (não oferecem suporte para adição), considere usar a função :func:`median_low` ou :func:`median_high` no lugar.

source: Return the low median of numeric data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
pt_br: Retorna a mediana inferior de dados numéricos. Se *data* for vazio, a exceção :exc:`StatisticsError` é levantada. *data* pode ser uma sequência ou um iterável.

source: The low median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the smaller of the two middle values is returned.
pt_br: A mediana inferior sempre é um membro do conjunto de dados. Quando o número de elementos for ímpar, o valor intermediário é retornado. Se houver um número par de elementos, o menor entre os dois valores centrais é retornado.

source: Use the low median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
pt_br: Use a mediana inferior caso seus dados forem discretos e você prefira que a mediana seja um valor que de fato existe nos seus dados ao invés de um valor interpolado.

source: Return the high median of data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
pt_br: Retorna a mediana superior de dados numéricos. Se *data* for vazio, a exceção :exc:`StatisticsError` é levantada. *data* pode ser uma sequência ou um iterável.

source: The high median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the larger of the two middle values is returned.
pt_br: A mediana superior sempre é um membro do conjunto de dados. Quando o número de elementos for ímpar, o valor intermediário é retornado. Se houver um número par de elementos, o maior entre os dois valores centrais é retornado.

source: Use the high median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
pt_br: Use a mediana superior caso seus dados forem discretos e você prefira que a mediana seja um valor que de fato existe nos seus dados ao invés de um valor interpolado.

source: Estimates the median for numeric data that has been `grouped or binned <https://en.wikipedia.org/wiki/Data_binning>`_ around the midpoints of consecutive, fixed-width intervals.
pt_br: Estima a mediana para dados numéricos que foram `agrupados ou "binned" <https://en.wikipedia.org/wiki/Data_binning>`_ em torno dos pontos médios de intervalos consecutivos de largura fixa.

source: The *data* can be any iterable of numeric data with each value being exactly the midpoint of a bin. At least one value must be present.
pt_br: *data* pode ser qualquer iterável de dados numéricos com cada valor sendo exatamente o ponto médio de um bin. Pelo menos um valor deve estar presente.

source: The *interval* is the width of each bin.
pt_br: *interval* é a largura de cada compartimento.
