Repository: python/python-docs-pt-br
Catalog: library/statistics.po
Languages: pt_br

source: If *proportional* is true, the independent variable *x* and the dependent variable *y* are assumed to be directly proportional. The data is fit to a line passing through the origin. Since the *intercept* will always be 0.0, the underlying linear function simplifies to:
pt_br: Se *proportional* for verdadeiro, a variável independente *x* e a variável dependente *y* são assumidas como diretamente proporcionais. Os dados são ajustados a uma linha que passa pela origem. Como o *intercept* sempre será 0,0, a função linear subjacente simplifica para:

source: Continuing the example from :func:`correlation`, we look to see how well a model based on major planets can predict the orbital distances for dwarf planets:
pt_br: Continuando o exemplo de :func:`correlation`, vamos ver o quão bem um modelo baseado em planetas principais pode prever as distâncias orbitais de planetas anões:

source: >>> model = linear_regression(period_squared, dist_cubed, proportional=True) >>> slope = model.slope >>> # Dwarf planets: Pluto, Eris, Makemake, Haumea, Ceres >>> orbital_periods = [90_560, 204_199, 111_845, 103_410, 1_680] # days >>> predicted_dist = [math.cbrt(slope * (p * p)) for p in orbital_periods] >>> list(map(round, predicted_dist)) [5912, 10166, 6806, 6459, 414] >>> [5_906, 10_152, 6_796, 6_450, 414] # actual distance in million km [5906, 10152, 6796, 6450, 414]
pt_br: >>> model = linear_regression(period_squared, dist_cubed, proportional=True) >>> slope = model.slope >>> # Planetas anões: Pluto, Eris, Makemake, Haumea, Ceres >>> orbital_periods = [90_560, 204_199, 111_845, 103_410, 1_680] # dias >>> predicted_dist = [math.cbrt(slope * (p * p)) for p in orbital_periods] >>> list(map(round, predicted_dist)) [5912, 10166, 6806, 6459, 414] >>> [5_906, 10_152, 6_796, 6_450, 414] # distância real em milhões de km [5906, 10152, 6796, 6450, 414]

source: Added support for *proportional*.
pt_br: Adicionado suporte a *proportional*.

source: Exceptions
pt_br: Exceções

source: A single exception is defined:
pt_br: Uma única exceção é definida:

source: Subclass of :exc:`ValueError` for statistics-related exceptions.
pt_br: Subclasse de :exc:`ValueError` para exceções relacionadas a estatísticas.

source: :class:`NormalDist` objects
pt_br: Objetos :class:`NormalDist`

source: :class:`NormalDist` is a tool for creating and manipulating normal distributions of a `random variable <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. It is a class that treats the mean and standard deviation of data measurements as a single entity.
pt_br: :class:`NormalDist` é uma ferramenta para criar e manipular distribuições normais de uma `variável aleatória <https://pt.wikipedia.org/wiki/Variável_aleatória>`_. É uma classe que trata a média e o desvio padrão das medições de dados como uma entidade única.

source: Normal distributions arise from the `Central Limit Theorem <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ and have a wide range of applications in statistics.
pt_br: Distribuições normais surgem do `Teorema Central do Limite <https://pt.wikipedia.org/wiki/Teorema_central_do_limite>`_ e possuem uma gama de aplicações em estatísticas.

source: Returns a new *NormalDist* object where *mu* represents the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ and *sigma* represents the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_.
pt_br: Retorna um novo objeto *NormalDist* onde *mu* representa a `média aritmética <https://pt.wikipedia.org/wiki/Média_aritmética>`_ e *sigma* representa o `desvio padrão <https://pt.wikipedia.org/wiki/Desvio_padrão>`_.

source: If *sigma* is negative, raises :exc:`StatisticsError`.
pt_br: Se *sigma* for negativo, levanta a exceção :exc:`StatisticsError`.

source: A read-only property for the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ of a normal distribution.
pt_br: Uma propriedade somente leitura para a `média aritmética <https://pt.wikipedia.org/wiki/Média_aritmética>`_ de uma distribuição normal.

source: A read-only property for the `median <https://en.wikipedia.org/wiki/Median>`_ of a normal distribution.
pt_br: Uma propriedade somente leitura para a `mediana <https://pt.wikipedia.org/wiki/Mediana_(estatística)>`_ de uma distribuição normal.

source: A read-only property for the `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ of a normal distribution.
pt_br: Uma propriedade somente leitura para a `moda <https://pt.wikipedia.org/wiki/Moda_(estatística)>`_ de uma distribuição normal.

source: A read-only property for the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_ of a normal distribution.
pt_br: Uma propriedade somente leitura para o `desvio padrão <https://pt.wikipedia.org/wiki/Desvio_padrão>`_ de uma distribuição normal.

source: A read-only property for the `variance <https://en.wikipedia.org/wiki/Variance>`_ of a normal distribution. Equal to the square of the standard deviation.
pt_br: Uma propriedade somente leitura para a `variância <https://pt.wikipedia.org/wiki/Variáncia>`_ de uma distribuição normal. Igual ao quadrado do desvio padrão.

source: Makes a normal distribution instance with *mu* and *sigma* parameters estimated from the *data* using :func:`fmean` and :func:`stdev`.
pt_br: Faz uma instância da distribuição normal com os parâmetros *mu* e *sigma* estimados a partir de *data* usando :func:`fmean` e :func:`stdev`.

source: The *data* can be any :term:`iterable` and should consist of values that can be converted to type :class:`float`. If *data* does not contain at least two elements, raises :exc:`StatisticsError` because it takes at least one point to estimate a central value and at least two points to estimate dispersion.
pt_br: *data* pode ser qualquer :term:`iterável` e deve consistir de valores que pode ser convertidos para o tipo :class:`float`. Se *data* não contém pelo menos dois elementos, levanta a exceção :exc:`StatisticsError` porque é preciso pelo menos um ponto para estimar um valor central e pelo menos dois pontos para estimar a dispersão.

source: Generates *n* random samples for a given mean and standard deviation. Returns a :class:`list` of :class:`float` values.
pt_br: Gera *n* amostras aleatórias para uma dada média e desvio padrão. Retorna uma :class:`list` de valores :class:`float`.

source: If *seed* is given, creates a new instance of the underlying random number generator. This is useful for creating reproducible results, even in a multi-threading context.
pt_br: Se o parâmetro *seed* for fornecido, cria uma nova instância do gerador de número aleatório subjacente. Isso é útil para criar resultados reproduzíveis, mesmo em um contexto multithreading.

source: Switched to a faster algorithm. To reproduce samples from previous versions, use :func:`random.seed` and :func:`random.gauss`.
pt_br: Alterado para um algoritmo mais rápido. Para reproduzir amostras de versões anteriores, use :func:`random.seed` e :func:`random.gauss`.

source: Using a `probability density function (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, compute the relative likelihood that a random variable *X* will be near the given value *x*. Mathematically, it is the limit of the ratio ``P(x <= X < x+dx) / dx`` as *dx* approaches zero.
pt_br: Usando uma `função densidade de probabilidade (fdp) <https://pt.wikipedia.org/wiki/Função_densidade>`_, calcula a probabilidade relativa que uma variável aleatória *X* estará perto do valor dado *x*. Matematicamente, é o limite da razão ``P(x <= X < x+dx) / dx`` quando *dx* se aproxima de zero.

source: The relative likelihood is computed as the probability of a sample occurring in a narrow range divided by the width of the range (hence the word "density"). Since the likelihood is relative to other points, its value can be greater than ``1.0``.
pt_br: A probabilidade relativa é calculada como a probabilidade de uma amostra ocorrer em um intervalo estreito dividida pela largura do intervalo (daí a palavra "densidade"). Como a probabilidade é relativa a outros pontos, seu valor pode ser maior que ``1.0``.

source: Using a `cumulative distribution function (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, compute the probability that a random variable *X* will be less than or equal to *x*. Mathematically, it is written ``P(X <= x)``.
pt_br: Usando uma `função distribuição acumulada (fda) <https://pt.wikipedia.org/wiki/Função_distribuição_acumulada>`_, calcula a probabilidade de que uma variável aleatória *X* seja menor ou igual a *x*. Matematicamente, é representada da seguinte maneira: ``P(X <= x)``.

source: Compute the inverse cumulative distribution function, also known as the `quantile function <https://en.wikipedia.org/wiki/Quantile_function>`_ or the `percent-point <https://web.archive.org/web/20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_ function. Mathematically, it is written ``x : P(X <= x) = p``.
pt_br: Calcula a função distribuição acumulada inversa, também conhecida como `função quantil <https://pt.wikipedia.org/wiki/Quantil>`_ ou o `função ponto percentual <https://web.archive.org/web/20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_. Matematicamente, é representada como ``x : P(X <= x) = p``.

source: Finds the value *x* of the random variable *X* such that the probability of the variable being less than or equal to that value equals the given probability *p*.
pt_br: Encontra o valor *x* da variável aleatória *X* de tal forma que a probabilidade da variável ser menor ou igual a esse valor seja igual à probabilidade dada *p*.

source: Measures the agreement between two normal probability distributions. Returns a value between 0.0 and 1.0 giving `the overlapping area for the two probability density functions <https://www.rasch.org/rmt/rmt101r.htm>`_.
pt_br: Mede a concordância entre duas distribuições de probabilidade normais. Retorna um valor entre 0,0 e 1,0 fornecendo `a área de sobreposição para as duas funções de densidade de probabilidade <https://www.rasch.org/rmt/rmt101r.htm>`_.

source: Divide the normal distribution into *n* continuous intervals with equal probability. Returns a list of (n - 1) cut points separating the intervals.
pt_br: Divide a distribuição normal em *n* intervalos contínuos com probabilidade igual. Retorna uma lista de (n - 1) pontos de corte separando os intervalos.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate the normal distribution into 100 equal sized groups.
pt_br: Defina *n* como 4 para quartis (o padrão). Defina *n* como 10 para decis. Defina *n* como 100 para percentis, o que dá os 99 pontos de corte que separam a distribuição normal em 100 grupos de tamanhos iguais.

source: Compute the `Standard Score <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_ describing *x* in terms of the number of standard deviations above or below the mean of the normal distribution: ``(x - mean) / stdev``.
pt_br: Calcula a `Pontuação Padrão (z-score) <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_ descrevendo *x* em termos do número de desvios padrão acima ou abaixo da média da distribuição normal: ``(x - mean) / stdev``.

source: Instances of :class:`NormalDist` support addition, subtraction, multiplication and division by a constant. These operations are used for translation and scaling. For example:
pt_br: Instâncias de :class:`NormalDist` suportam adição, subtração, multiplicação e divisão por uma constante. Essas operações são usadas para translação e dimensionamento. Por exemplo:

source: Dividing a constant by an instance of :class:`NormalDist` is not supported because the result wouldn't be normally distributed.
pt_br: A divisão de uma constante por uma instância de :class:`NormalDist` não é suportada porque o resultado não seria distribuído normalmente.

source: Since normal distributions arise from additive effects of independent variables, it is possible to `add and subtract two independent normally distributed random variables <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ represented as instances of :class:`NormalDist`. For example:
pt_br: Uma vez que distribuições normais surgem de efeitos aditivos de variáveis independentes, é possível `adicionar e subtrair duas variáveis aleatórias independentes normalmente distribuídas <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ representadas como instâncias de :class:`NormalDist`. Por exemplo:

source: Examples and Recipes
pt_br: Exemplos e receitas

source: Classic probability problems
pt_br: Problemas clássicos de probabilidade

source: :class:`NormalDist` readily solves classic probability problems.
pt_br: :class:`NormalDist` facilmente resolve problemas de probabilidade clássicos.

source: For example, given `historical data for SAT exams <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ showing that scores are normally distributed with a mean of 1060 and a standard deviation of 195, determine the percentage of students with test scores between 1100 and 1200, after rounding to the nearest whole number:
pt_br: Por exemplo, considerando os `dados históricos para exames SAT <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ mostrando que as pontuações são normalmente distribuídas com média de 1060 e desvio padrão de 195, determine o percentual de alunos com pontuações de teste entre 1100 e 1200, após arredondar para o número inteiro mais próximo:

source: Find the `quartiles <https://en.wikipedia.org/wiki/Quartile>`_ and `deciles <https://en.wikipedia.org/wiki/Decile>`_ for the SAT scores:
pt_br: Encontrar os `quartis <https://pt.wikipedia.org/wiki/Quartil>`_ e `decis <https://pt.wikipedia.org/wiki/Decil>`_ para as pontuações SAT:

source: Monte Carlo inputs for simulations
pt_br: Entradas de Monte Carlo para simulações

source: To estimate the distribution for a model that isn't easy to solve analytically, :class:`NormalDist` can generate input samples for a `Monte Carlo simulation <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
pt_br: Para estimar a distribuição de um modelo que não seja fácil de resolver analiticamente, :class:`NormalDist` pode gerar amostras de entrada para uma `simulação Monte Carlo <https://pt.wikipedia.org/wiki/Método_de_Monte_Carlo>`_:

source: Approximating binomial distributions
pt_br: Aproximação de distribuições binomiais

source: Normal distributions can be used to approximate `Binomial distributions <https://mathworld.wolfram.com/BinomialDistribution.html>`_ when the sample size is large and when the probability of a successful trial is near 50%.
pt_br: As distribuições normais podem ser usadas para aproximar `distribuições binomiais <https://mathworld.wolfram.com/BinomialDistribution.html>`_ quando o tamanho da amostra é grande e quando a probabilidade de um teste bem-sucedido é próximo a 50%.

source: For example, an open source conference has 750 attendees and two rooms with a 500 person capacity. There is a talk about Python and another about Ruby. In previous conferences, 65% of the attendees preferred to listen to Python talks. Assuming the population preferences haven't changed, what is the probability that the Python room will stay within its capacity limits?
pt_br: Por exemplo, uma conferência de código aberto tem 750 participantes e duas salas com capacidade para 500 pessoas. Há uma palestra sobre Python e outra sobre Ruby. Em conferências anteriores, 65% dos participantes preferiram ouvir palestras sobre Python. Supondo que as preferências da população não tenham mudado, qual é a probabilidade da sala de Python permanecer dentro de seus limites de capacidade?

source: >>> n = 750 # Sample size >>> p = 0.65 # Preference for Python >>> q = 1.0 - p # Preference for Ruby >>> k = 500 # Room capacity >>> # Approximation using the cumulative normal distribution >>> from math import sqrt >>> round(NormalDist(mu=n*p, sigma=sqrt(n*p*q)).cdf(k + 0.5), 4) 0.8402 >>> # Exact solution using the cumulative binomial distribution >>> from math import comb, fsum >>> round(fsum(comb(n, r) * p**r * q**(n-r) for r in range(k+1)), 4) 0.8402 >>> # Approximation using a simulation >>> from random import seed, binomialvariate >>> seed(8675309) >>> mean(binomialvariate(n, p) <= k for i in range(10_000)) 0.8406
pt_br: >>> n = 750 # Tamanho da amostra >>> p = 0.65 # Preferência para Python >>> q = 1.0 - p # Preferência para Ruby >>> k = 500 # Capacidade >>> # Aproximação usando a distribuição normal cumulativa >>> from math import sqrt >>> round(NormalDist(mu=n*p, sigma=sqrt(n*p*q)).cdf(k + 0.5), 4) 0.8402 >>> # Solução exata usando a distribuição binomial cumulativa >>> from math import comb, fsum >>> round(fsum(comb(n, r) * p**r * q**(n-r) for r in range(k+1)), 4) 0.8402 >>> # Aproximação usando uma simulação >>> from random import seed, binomialvariate >>> seed(8675309) >>> mean(binomialvariate(n, p) <= k for i in range(10_000)) 0.8406

source: Naive bayesian classifier
pt_br: Classificador bayesiano ingênuo

source: Normal distributions commonly arise in machine learning problems.
pt_br: Distribuições normais geralmente surgem em problemas de aprendizado de máquina.

source: Wikipedia has a `nice example of a Naive Bayesian Classifier <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>`_. The challenge is to predict a person's gender from measurements of normally distributed features including height, weight, and foot size.
pt_br: A Wikipedia tem um `bom exemplo de um Classificador Bayesiano Ingênuo <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>`_. O desafio é prever o sexo de uma pessoa a partir de medidas de características normalmente distribuídas, incluindo altura, peso e tamanho do pé.

source: We're given a training dataset with measurements for eight people. The measurements are assumed to be normally distributed, so we summarize the data with :class:`NormalDist`:
pt_br: Recebemos um conjunto de dados de treinamento com medições para oito pessoas. As medidas são consideradas normalmente distribuídas, então resumimos os dados com :class:`NormalDist`:

source: Next, we encounter a new person whose feature measurements are known but whose gender is unknown:
pt_br: Em seguida, encontramos uma nova pessoa cujas características de medidas são conhecidas, mas cujo gênero é desconhecido:

source: >>> ht = 6.0 # height >>> wt = 130 # weight >>> fs = 8 # foot size
pt_br: >>> ht = 6.0 # altura >>> wt = 130 # peso >>> fs = 8 # tamanho do pé

source: Starting with a 50% `prior probability <https://en.wikipedia.org/wiki/Prior_probability>`_ of being male or female, we compute the posterior as the prior times the product of likelihoods for the feature measurements given the gender:
pt_br: Começando com uma `probabilidade a priori <https://pt.wikipedia.org/wiki/Probabilidade_a_priori>`_ de 50% de ser homem ou mulher, calculamos a posteriori como a priori vezes o produto das probabilidade para as características de medidas dado o gênero:

source: The final prediction goes to the largest posterior. This is known as the `maximum a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ or MAP:
pt_br: A previsão final vai para a probabilidade posterior maior. Isso é conhecido como `máximo a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ ou MAP:
