Repository: python/python-docs-pt-br
Catalog: library/stringprep.po
Languages: pt_br

source: :mod:`!stringprep` --- Internet String Preparation
pt_br: :mod:`!stringprep` --- Preparação de string para internet

source: **Source code:** :source:`Lib/stringprep.py`
pt_br: **Código-fonte:** :source:`Lib/stringprep.py`

source: When identifying things (such as host names) in the internet, it is often necessary to compare such identifications for "equality". Exactly how this comparison is executed may depend on the application domain, e.g. whether it should be case-insensitive or not. It may be also necessary to restrict the possible identifications, to allow only identifications consisting of "printable" characters.
pt_br: Ao identificar coisas (como nomes de host) na internet, muitas vezes é necessário comparar tais identificações para "igualdade". Exatamente como essa comparação é executada pode depender do domínio da aplicação, por exemplo, se deve ser insensível a maiúsculas e minúsculas ou não. Também pode ser necessário restringir as possíveis identificações, para permitir apenas identificações consistindo de caracteres "imprimíveis".

source: :rfc:`3454` defines a procedure for "preparing" Unicode strings in internet protocols. Before passing strings onto the wire, they are processed with the preparation procedure, after which they have a certain normalized form. The RFC defines a set of tables, which can be combined into profiles. Each profile must define which tables it uses, and what other optional parts of the ``stringprep`` procedure are part of the profile. One example of a ``stringprep`` profile is ``nameprep``, which is used for internationalized domain names.
pt_br: :rfc:`3454` define um procedimento para "preparar" strings Unicode em protocolos de internet. Antes de passar strings para o fio, elas são processadas com o procedimento de preparação, após o qual elas têm uma certa forma normalizada. O RFC define um conjunto de tabelas, que podem ser combinadas em perfis. Cada perfil deve definir quais tabelas ele usa, e quais outras partes opcionais do procedimento ``stringprep`` são parte do perfil. Um exemplo de um perfil ``stringprep`` é ``nameprep``, que é usado para nomes de domínio internacionalizados.

source: The module :mod:`stringprep` only exposes the tables from :rfc:`3454`. As these tables would be very large to represent as dictionaries or lists, the module uses the Unicode character database internally. The module source code itself was generated using the ``mkstringprep.py`` utility.
pt_br: O módulo :mod:`stringprep` expõe apenas as tabelas do :rfc:`3454`. Como essas tabelas seriam muito grandes para representar como dicionários ou listas, o módulo usa o banco de dados de caracteres Unicode internamente. O código-fonte do módulo em si foi gerado usando o utilitário ``mkstringprep.py``.

source: As a result, these tables are exposed as functions, not as data structures. There are two kinds of tables in the RFC: sets and mappings. For a set, :mod:`stringprep` provides the "characteristic function", i.e. a function that returns ``True`` if the parameter is part of the set. For mappings, it provides the mapping function: given the key, it returns the associated value. Below is a list of all functions available in the module.
pt_br: Como resultado, essas tabelas são expostas como funções, não como estruturas de dados. Existem dois tipos de tabelas no RFC: conjuntos e mapeamentos. Para um conjunto, :mod:`stringprep` fornece a "função característica", ou seja, uma função que retorna ``True`` se o parâmetro fizer parte do conjunto. Para mapeamentos, ele fornece a função de mapeamento: dada a chave, ele retorna o valor associado. Abaixo está uma lista de todas as funções disponíveis no módulo.

source: Determine whether *code* is in tableA.1 (Unassigned code points in Unicode 3.2).
pt_br: Determina se *code* está na tabela A.1 (pontos de código não atribuídos no Unicode 3.2).

source: Determine whether *code* is in tableB.1 (Commonly mapped to nothing).
pt_br: Determina se *code* está na tabela B.1 (comumente mapeado para nada).

source: Return the mapped value for *code* according to tableB.2 (Mapping for case-folding used with NFKC).
pt_br: Retorna o valor mapeado para *code* de acordo com a tabela B.2 (mapeamento para dobramento de casos usado com NFKC).

source: Return the mapped value for *code* according to tableB.3 (Mapping for case-folding used with no normalization).
pt_br: Retorna o valor mapeado para *code* de acordo com a tabela B.3 (mapeamento para dobramento de casos usado com nenhuma normalização).

source: Determine whether *code* is in tableC.1.1 (ASCII space characters).
pt_br: Determina se *code* está na tabela C.1.1 (caracteres de espaço ASCII).

source: Determine whether *code* is in tableC.1.2 (Non-ASCII space characters).
pt_br: Determina se *code* está na tabela C.1.2 (caracteres de espaço não-ASCII).

source: Determine whether *code* is in tableC.1 (Space characters, union of C.1.1 and C.1.2).
pt_br: Determina se *code* está na tabela C.1 (caracteres de espaço, união de C.1.1 e C.1.2).

source: Determine whether *code* is in tableC.2.1 (ASCII control characters).
pt_br: Determina se *code* está na tabela C.2.1 (caracteres de controle ASCII).

source: Determine whether *code* is in tableC.2.2 (Non-ASCII control characters).
pt_br: Determina se *code* está na tabela C.2.2 (caracteres de controle não-ASCII).

source: Determine whether *code* is in tableC.2 (Control characters, union of C.2.1 and C.2.2).
pt_br: Determina se *code* está na tabela C.2 (caracteres de controle, união de C.2.1 e C.2.2).

source: Determine whether *code* is in tableC.3 (Private use).
pt_br: Determina se *code* está na tabela C.3 (uso privado).

source: Determine whether *code* is in tableC.4 (Non-character code points).
pt_br: Determina se *code* está na tabela C.4 (pontos de código não-caracteres).

source: Determine whether *code* is in tableC.5 (Surrogate codes).
pt_br: Determina se *code* está na tabela C.5 (códigos substitutos).

source: Determine whether *code* is in tableC.6 (Inappropriate for plain text).
pt_br: Determina se *code* está na tabela C.6 (inapropriado para texto simples).

source: Determine whether *code* is in tableC.7 (Inappropriate for canonical representation).
pt_br: Determina se *code* está na tabela C.7 (inapropriado para para representação canônica).

source: Determine whether *code* is in tableC.8 (Change display properties or are deprecated).
pt_br: Determina se *code* está na tabela C.8 (alteram propriedades de exibição ou estão descontinuadas).

source: Determine whether *code* is in tableC.9 (Tagging characters).
pt_br: Determina se *code* está na tabela C.9 (caracteres de tag).

source: Determine whether *code* is in tableD.1 (Characters with bidirectional property "R" or "AL").
pt_br: Determina se *code* está na tabela D.1 (Caracteres com propriedade bidirecional "R" ou "AL").

source: Determine whether *code* is in tableD.2 (Characters with bidirectional property "L").
pt_br: Determina se *code* está na tabela D.2 (Caracteres com propriedade bidirecional "L").
