Repository: python/python-docs-pt-br
Catalog: library/string.templatelib.po
Languages: pt_br

source: :mod:`!string.templatelib` --- Support for template string literals
pt_br: :mod:`!string.templatelib` --- Suporte para literais de string template

source: **Source code:** :source:`Lib/string/templatelib.py`
pt_br: **Código-fonte:** :source:`Lib/string/templatelib.py`

source: :ref:`Format strings <f-strings>`
pt_br: :ref:`Strings de formatação <f-strings>`

source: :ref:`Template string literal (t-string) syntax <t-strings>`
pt_br: :ref:`Sintaxe de literal de string template (t-string) <t-strings>`

source: Template strings
pt_br: Strings template

source: Template strings are a mechanism for custom string processing. They have the full flexibility of Python's :ref:`f-strings`, but return a :class:`Template` instance that gives access to the static and interpolated (in curly brackets) parts of a string *before* they are combined.
pt_br: Strings template são um mecanismo para processamento personalizado de strings. Elas têm toda a flexibilidade das :ref:`f-strings` do Python, mas retornam uma instância :class:`Template` que dá acesso às partes estáticas e interpoladas (entre chaves) de uma string *antes* de serem combinadas.

source: To write a t-string, use a ``'t'`` prefix instead of an ``'f'``, like so:
pt_br: Para escrever uma t-string, use um prefixo ``'t'`` em vez de ``'f'``, assim:

source: >>> pi = 3.14 >>> t't-strings are new in Python {pi!s}!' Template( strings=('t-strings are new in Python ', '!'), interpolations=(Interpolation(3.14, 'pi', 's', ''),) )
pt_br: >>> pi = 3.14 >>> t't-strings são novas no Python {pi!s}!' Template( strings=('t-strings são novas no Python ', '!'), interpolations=(Interpolation(3.14, 'pi', 's', ''),) )

source: Types
pt_br: Tipos

source: The :class:`!Template` class describes the contents of a template string. It is immutable, meaning that attributes of a template cannot be reassigned.
pt_br: A classe :class:`!Template` descreve o conteúdo de uma string template. Ela é imutável, o que significa que os atributos de um template não podem ser reatribuídos.

source: The most common way to create a :class:`!Template` instance is to use the :ref:`template string literal syntax <t-strings>`. This syntax is identical to that of :ref:`f-strings <f-strings>`, except that it uses a ``t`` prefix in place of an ``f``:
pt_br: A maneira mais comum de criar uma instância de :class:`!Template` é usar a :ref:`sintaxe de literal de string template <t-strings>`. Essa sintaxe é idêntica à de :ref:`f-strings <f-strings>`, exceto pelo fato de usar um prefixo ``t`` no lugar de um ``f``:

source: Templates are stored as sequences of literal :attr:`~Template.strings` and dynamic :attr:`~Template.interpolations`. A :attr:`~Template.values` attribute holds the values of the interpolations:
pt_br: Os templates são armazenados como sequências de literais :attr:`~Template.strings` e dinâmicos :attr:`~Template.interpolations`. Um atributo :attr:`~Template.values` contém os valores das interpolações:

source: The :attr:`!strings` tuple has one more element than :attr:`!interpolations` and :attr:`!values`; the interpolations “belong” between the strings. This may be easier to understand when tuples are aligned
pt_br: A tupla :attr:`!strings` tem um elemento a mais que :attr:`!interpolations` e :attr:`!values`; as interpolações "pertencem" às strings. Isso pode ser mais fácil de entender quando as tuplas estão alinhadas

source: Attributes
pt_br: Atributos

source: A :class:`tuple` of the static strings in the template.
pt_br: Uma :class:`tuple` das strings estáticas no template.

source: Empty strings *are* included in the tuple:
pt_br: Strings vazias *estão* incluídas na tupla:

source: The ``strings`` tuple is never empty, and always contains one more string than the ``interpolations`` and ``values`` tuples:
pt_br: A tupla ``strings`` nunca está vazia e sempre contém uma string a mais que as tuplas ``interpolations`` e ``values``:

source: A :class:`tuple` of the interpolations in the template.
pt_br: Uma :class:`tuple` das interpolações no template.

source: The ``interpolations`` tuple may be empty and always contains one fewer values than the ``strings`` tuple:
pt_br: A tupla ``interpolações`` pode estar vazia e sempre contém um valor a menos que a tupla ``strings``:

source: A tuple of all interpolated values in the template.
pt_br: Uma tupla de todos os valores interpolados no template.

source: The ``values`` tuple always has the same length as the ``interpolations`` tuple. It is always equivalent to ``tuple(i.value for i in template.interpolations)``.
pt_br: A tupla ``values`` sempre tem o mesmo comprimento que a tupla ``interpolations``. Isso sempre equivale a ``tuple(i.value for i in template.interpolations)``.

source: Methods
pt_br: Métodos

source: While literal syntax is the most common way to create a :class:`!Template`, it is also possible to create them directly using the constructor:
pt_br: Embora a sintaxe de literal seja a maneira mais comum de criar um :class:`!Template`, também é possível criá-las diretamente usando o construtor:

source: If multiple strings are passed consecutively, they will be concatenated into a single value in the :attr:`~Template.strings` attribute. For example, the following code creates a :class:`Template` with a single final string:
pt_br: Se várias strings forem passadas consecutivamente, elas serão concatenadas em um único valor no atributo :attr:`~Template.strings`. Por exemplo, o código a seguir cria uma :class:`Template` com uma única string final:

source: If multiple interpolations are passed consecutively, they will be treated as separate interpolations and an empty string will be inserted between them. For example, the following code creates a template with empty placeholders in the :attr:`~Template.strings` attribute:
pt_br: Se várias interpolações forem passadas consecutivamente, elas serão tratadas como interpolações separadas e uma string vazia será inserida entre elas. Por exemplo, o código a seguir cria um modelo com espaços reservados vazios no atributo :attr:`~Template.strings`:

source: Iterate over the template, yielding each non-empty string and :class:`Interpolation` in the correct order:
pt_br: Itera sobre o template, produzindo cada string não-vazia e :class:`Interpolation` em ordem correta.

source: Empty strings are **not** included in the iteration:
pt_br: Strings vazias *não* são incluídas na iteração:

source: Concatenate this template with another, returning a new :class:`!Template` instance:
pt_br: Concatena este template com outro, retornando uma nova instância :class:`!Template`:

source: Concatenating a :class:`!Template` and a ``str`` is **not** supported. This is because it is unclear whether the string should be treated as a static string or an interpolation. If you want to concatenate a :class:`!Template` with a string, you should either wrap the string directly in a :class:`!Template` (to treat it as a static string) or use an :class:`!Interpolation` (to treat it as dynamic):
pt_br: A concatenação de uma :class:`!Template` e uma ``str`` **não** é suportada. Isso ocorre porque não está claro se a string deve ser tratada como uma string estática ou uma interpolação. Se você quiser concatenar uma :class:`!Template` com uma string, você deve encapsular a string diretamente em uma :class:`!Template` (para tratá-la como uma string estática) ou usar uma :class:`!Interpolation` (para tratá-la como dinâmica):

source: The :class:`!Interpolation` type represents an expression inside a template string. It is immutable, meaning that attributes of an interpolation cannot be reassigned.
pt_br: O tipo :class:`!Interpolation` representa uma expressão dentro de uma string template. É imutável, o que significa que os atributos de uma interpolação não podem ser reatribuídos.

source: Interpolations support pattern matching, allowing you to match against their attributes with the :ref:`match statement <match>`:
pt_br: As interpolações oferecem suporte à correspondência de padrões, permitindo que você compare seus atributos com a :ref:`instrução match <match>`:

source: The evaluated value of the interpolation.
pt_br: O valor avaliado da interpolação.

source: For interpolations created by t-string literals, :attr:`!expression` is the expression text found inside the curly brackets (``{`` & ``}``), including any whitespace, excluding the curly brackets themselves, and ending before the first ``!``, ``:``, or ``=`` if any is present. For manually created interpolations, :attr:`!expression` is the arbitrary string provided when constructing the interpolation instance.
pt_br: Para interpolações criadas por literais de t-string, :attr:`!expression` é o texto da expressão encontrado dentro das chaves (``{`` e ``}``), incluindo quaisquer espaços em branco, excluindo as próprias chaves e terminando antes do primeiro ``!``, ``:`` ou ``=``, se houver algum. Para interpolações criadas manualmente, :attr:`!expression` é a string arbitrária fornecida ao construir a instância de interpolação.

source: We recommend using valid Python expressions or the empty string for the ``expression`` field of manually created :class:`!Interpolation` instances, although this is not enforced at runtime.
pt_br: Recomendamos usar expressões Python válidas ou a string vazia para o campo ``expression`` de instâncias :class:`!Interpolation` criadas manualmente, embora isso não seja imposto em tempo de execução.

source: The conversion to apply to the value, or ``None``.
pt_br: A conversão a ser aplicada ao valor, ou ``None``.

source: The :attr:`!conversion` is the optional conversion to apply to the value:
pt_br: O :attr:`!conversion` é a conversão opcional a ser aplicada ao valor:

source: Unlike f-strings, where conversions are applied automatically, the expected behavior with t-strings is that code that *processes* the :class:`!Template` will decide how to interpret and whether to apply the :attr:`!conversion`. For convenience, the :func:`convert` function can be used to mimic f-string conversion semantics.
pt_br: Ao contrário das f-strings, onde as conversões são aplicadas automaticamente, o comportamento esperado com t-strings é que o código que *processa* o :class:`!Template` decidirá como interpretar e se aplicará o :attr:`!conversion`. Por conveniência, a função :func:`convert` pode ser usada para imitar a semântica de conversão de f-strings.

source: The format specification to apply to the value.
pt_br: A especificação de formato a ser aplicada ao valor.

source: The :attr:`!format_spec` is an optional, arbitrary string used as the format specification to present the value:
pt_br: O :attr:`!format_spec` é uma string arbitrária opcional usada como especificação de formato para apresentar o valor:

source: Unlike f-strings, where format specifications are applied automatically via the :func:`format` protocol, the expected behavior with t-strings is that code that *processes* the interpolation will decide how to interpret and whether to apply the format specification. As a result, :attr:`!format_spec` values in interpolations can be arbitrary strings, including those that do not conform to the :func:`format` protocol.
pt_br: Ao contrário das f-strings, onde as especificações de formato são aplicadas automaticamente por meio do protocolo :func:`format`, o comportamento esperado com t-strings é que o código que *processa* a interpolação decida como interpretar e se a especificação de formato deve ser aplicada. Como resultado, os valores :attr:`!format_spec` em interpolações podem ser strings arbitrárias, incluindo aquelas que não estão em conformidade com o protocolo de :func:`format`.

source: Create a new :class:`!Interpolation` object from component parts.
pt_br: Cria um novo objeto :class:`!Interpolation` a partir de partes do componente.

source: Parameters
pt_br: Parâmetros

source: The evaluated, in-scope result of the interpolation.
pt_br: O resultado avaliado e dentro do escopo da interpolação.

source: The text of a valid Python expression, or an empty string.
pt_br: O texto de uma expressão Python válida ou uma string vazia.

source: The :ref:`conversion <formatstrings>` to be used, one of ``None``, ``'a'``, ``'r'``, or ``'s'``.
pt_br: A :ref:`conversão <formatstrings>` a ser usada, uma entre ``None``, ``'a'``, ``'r'`` ou ``'s'``.

source: An optional, arbitrary string used as the :ref:`format specification <formatspec>` to present the value.
pt_br: Uma string arbitrária opcional usada como :ref:`especificação de formato <formatspec>` para apresentar o valor.

source: Helper functions
pt_br: Funções auxiliares

source: Applies formatted string literal :ref:`conversion <formatstrings-conversion>` semantics to the given object *obj*. This is frequently useful for custom template string processing logic.
pt_br: Aplica a semântica de :ref:`conversão <formatstrings-conversion>` de literal de string formatada ao objeto *obj* fornecido. Isso é frequentemente útil para lógica de processamento de string template personalizada.

source: Three conversion flags are currently supported:
pt_br: Atualmente, há três sinalizadores de conversão suportados:

source: ``'s'`` which calls :func:`str` on the value (like ``!s``),
pt_br: ``'s'`` que chama :func:`str` no valor (como ``!s``),

source: ``'r'`` which calls :func:`repr` (like ``!r``), and
pt_br: ``'r'`` que chama :func:`repr` (como ``!r``) e

source: ``'a'`` which calls :func:`ascii` (like ``!a``).
pt_br: ``'a'`` que chama :func:`ascii` (como ``!a``).

source: If the conversion flag is ``None``, *obj* is returned unchanged.
pt_br: Se o sinalizador de conversão é ``None``, *obj* é retornado sem alterações.
