Repository: python/python-docs-pt-br
Catalog: library/symtable.po
Languages: pt_br

source: :mod:`!symtable` --- Access to the compiler's symbol tables
pt_br: :mod:`!symtable` --- Acesso a tabela de símbolos do compilador

source: **Source code:** :source:`Lib/symtable.py`
pt_br: **Código-fonte:** :source:`Lib/symtable.py`

source: Symbol tables are generated by the compiler from AST just before bytecode is generated. The symbol table is responsible for calculating the scope of every identifier in the code. :mod:`symtable` provides an interface to examine these tables.
pt_br: Таблиці символів генеруються компілятором з AST безпосередньо перед генерацією байт-коду. Таблиця символів відповідає за обчислення області кожного ідентифікатора в коді. :mod:`symtable` надає інтерфейс для перевірки цих таблиць.

source: Generating Symbol Tables
pt_br: Створення таблиць символів

source: Return the toplevel :class:`SymbolTable` for the Python source *code*. *filename* is the name of the file containing the code. *compile_type* is like the *mode* argument to :func:`compile`.
pt_br: Повертає верхній рівень :class:`SymbolTable` для вихідного *коду* Python. *filename* — це ім’я файлу, що містить код. *compile_type* схожий на аргумент *mode* для :func:`compile`.

source: Examining Symbol Tables
pt_br: Вивчення таблиць символів

source: A namespace table for a block. The constructor is not public.
pt_br: Таблиця простору імен для блоку. Конструктор не є публічним.

source: Added ``'annotation'``, ``'TypeVar bound'``, ``'type alias'``, and ``'type parameter'`` as possible return values.
pt_br: Добавлены ``'аннотация'``, ``'TypeVarbound'``, ``'псевдоним типа'`` и ``'параметр типа'`` в качестве возможных возвращаемых значений.

source: Return the table's identifier.
pt_br: Повернути ідентифікатор таблиці.

source: Return the table's name. This is the name of the class if the table is for a class, the name of the function if the table is for a function, or ``'top'`` if the table is global (:meth:`get_type` returns ``'module'``). For type parameter scopes (which are used for generic classes, functions, and type aliases), it is the name of the underlying class, function, or type alias. For type alias scopes, it is the name of the type alias. For :class:`~typing.TypeVar` bound scopes, it is the name of the ``TypeVar``.
pt_br: Верните имя таблицы. Это имя класса, если таблица предназначена для класса, имя функции, если таблица предназначена для функции, или ``'top'``, если таблица глобальная (:meth:`get_type` возвращает` `'модуль'``). Для областей параметров типа (которые используются для универсальных классов, функций и псевдонимов типов) это имя базового класса, функции или псевдонима типа. Для областей псевдонима типа это имя псевдонима типа. Для областей, связанных с :class:`~typing.TypeVar`, это имя ``TypeVar``.

source: Return the number of the first line in the block this table represents.
pt_br: Повертає номер першого рядка в блоці, який представляє ця таблиця.

source: Return ``True`` if the locals in this table can be optimized.
pt_br: Повертає ``True``, якщо локальні значення в цій таблиці можна оптимізувати.

source: Return ``True`` if the block is a nested class or function.
pt_br: Повертає ``True``, якщо блок є вкладеним класом або функцією.

source: Return ``True`` if the block has nested namespaces within it. These can be obtained with :meth:`get_children`.
pt_br: Повертає ``True``, якщо в блоці є вкладені простори імен. Їх можна отримати за допомогою :meth:`get_children`.

source: Return a view object containing the names of symbols in the table. See the :ref:`documentation of view objects <dict-views>`.
pt_br: Повертає об’єкт представлення, що містить імена символів у таблиці. Перегляньте :ref:`документацію об’єктів перегляду <dict-views>`.

source: Lookup *name* in the table and return a :class:`Symbol` instance.
pt_br: Знайдіть *name* у таблиці та поверніть екземпляр :class:`Symbol`.

source: Return a list of :class:`Symbol` instances for names in the table.
pt_br: Повертає список екземплярів :class:`Symbol` для імен у таблиці.

source: Return a list of the nested symbol tables.
pt_br: Повертає список вкладених таблиць символів.

source: A namespace for a function or method. This class inherits from :class:`SymbolTable`.
pt_br: Пространство имен для функции или метода. Этот класс наследуется от :class:`SymbolTable`.

source: Return a tuple containing names of parameters to this function.
pt_br: Повертає кортеж, що містить імена параметрів цієї функції.

source: Return a tuple containing names of locals in this function.
pt_br: Повертає кортеж, що містить імена місцевих жителів у цій функції.

source: Return a tuple containing names of globals in this function.
pt_br: Повертає кортеж, що містить імена глобалів у цій функції.

source: A namespace of a class. This class inherits from :class:`SymbolTable`.
pt_br: Пространство имен класса. Этот класс наследуется от :class:`SymbolTable`.

source: Return a tuple containing the names of method-like functions declared in the class.
pt_br: Возвращает кортеж, содержащий имена функций, подобных методам, объявленных в классе.

source: Here, the term 'method' designates *any* function defined in the class body via :keyword:`def` or :keyword:`async def`.
pt_br: Здесь термин «метод» обозначает *любую* функцию, определенную в теле класса с помощью :keyword:`def` или :keyword:`async def`.

source: Functions defined in a deeper scope (e.g., in an inner class) are not picked up by :meth:`get_methods`.
pt_br: Функции, определенные в более глубокой области видимости (например, во внутреннем классе), не подхватываются :meth:`get_methods`.

source: For example:
pt_br: Por exemplo:

source: Although ``A().f()`` raises :exc:`TypeError` at runtime, ``A.f`` is still considered as a method-like function.
pt_br: Хотя ``A().f()`` вызывает :exc:`TypeError` во время выполнения, ``Af`` по-прежнему рассматривается как функция, подобная методу.

source: An entry in a :class:`SymbolTable` corresponding to an identifier in the source. The constructor is not public.
pt_br: Запис у :class:`SymbolTable`, що відповідає ідентифікатору в джерелі. Конструктор не є публічним.

source: Return the symbol's name.
pt_br: Повернути назву символу.

source: Return ``True`` if the symbol is used in its block.
pt_br: Повертає ``True``, якщо символ використовується в його блоці.

source: Return ``True`` if the symbol is created from an import statement.
pt_br: Повертає ``True``, якщо символ створено з оператора імпорту.

source: Return ``True`` if the symbol is a parameter.
pt_br: Повертає ``True``, якщо символ є параметром.

source: Return ``True`` if the symbol is global.
pt_br: Повертає ``True``, якщо символ є глобальним.

source: Return ``True`` if the symbol is nonlocal.
pt_br: Повертає ``True``, якщо символ нелокальний.

source: Return ``True`` if the symbol is declared global with a global statement.
pt_br: Повертає ``True``, якщо символ оголошено глобальним за допомогою глобального оператора.

source: Return ``True`` if the symbol is local to its block.
pt_br: Повертає ``True``, якщо символ є локальним для свого блоку.

source: Return ``True`` if the symbol is annotated.
pt_br: Повертає ``True``, якщо символ анотований.

source: Return ``True`` if the symbol is referenced in its block, but not assigned to.
pt_br: Повертає ``True``, якщо символ є посиланням у його блоці, але не призначений.

source: Return ``True`` if the symbol is assigned to in its block.
pt_br: Повертає ``True``, якщо символу призначено в його блоці.

source: Return ``True`` if name binding introduces new namespace.
pt_br: Повертає ``True``, якщо зв’язування імен створює новий простір імен.

source: If the name is used as the target of a function or class statement, this will be true.
pt_br: Якщо ім’я використовується як ціль оператора функції чи класу, це буде вірно.

source: For example::
pt_br: Por exemplo::

source: Note that a single name can be bound to multiple objects. If the result is ``True``, the name may also be bound to other objects, like an int or list, that does not introduce a new namespace.
pt_br: Зауважте, що одне ім’я може бути прив’язане до кількох об’єктів. Якщо результат ``True``, ім'я також може бути прив'язане до інших об'єктів, таких як int або список, які не вводять новий простір імен.

source: Return a list of namespaces bound to this name.
pt_br: Повертає список просторів імен, прив’язаних до цього імені.

source: Return the namespace bound to this name. If more than one or no namespace is bound to this name, a :exc:`ValueError` is raised.
pt_br: Верните пространство имен, привязанное к этому имени. Если с этим именем связано более одного пространства имен или ни одно пространство имен, возникает ошибка :exc:`ValueError`.
