Repository: python/python-docs-pt-br
Catalog: library/sys.monitoring.po
Languages: pt_br

source: :mod:`!sys.monitoring` --- Execution event monitoring
pt_br: :mod:`!sys.monitoring` --- Monitoramento de eventos de execução

source: :mod:`sys.monitoring` is a namespace within the :mod:`sys` module, not an independent module, so there is no need to ``import sys.monitoring``, simply ``import sys`` and then use ``sys.monitoring``.
pt_br: :mod:`sys.monitoring` é um espaço de nomes dentro do módulo :mod:`sys`, não um módulo independente, então não há necessidade de importá-lo com ``import sys.monitoring``, bastando usar ``import sys`` e então usar ``sys.monitoring``.

source: This namespace provides access to the functions and constants necessary to activate and control event monitoring.
pt_br: Esse espaço de nomes fornece acesso às funções e constantes necessárias para ativar e controlar o monitoramento de eventos.

source: As programs execute, events occur that might be of interest to tools that monitor execution. The :mod:`sys.monitoring` namespace provides means to receive callbacks when events of interest occur.
pt_br: À medida que os programas são executados, ocorrem eventos que podem ser de interesse para as ferramentas que monitoram a execução. O espaço de nomes :mod:`sys.monitoring` fornece meios para receber retornos de chamada quando ocorrem eventos de interesse.

source: The monitoring API consists of three components:
pt_br: A API de monitoramento consiste em três componentes:

source: `Tool identifiers`_
pt_br: `Identificadores de ferramenta`_

source: `Events`_
pt_br: `Eventos`_

source: :ref:`Callbacks <callbacks>`
pt_br: :ref:`Funções de retorno de chamadas <callbacks>`

source: Tool identifiers
pt_br: Identificadores de ferramenta

source: A tool identifier is an integer and the associated name. Tool identifiers are used to discourage tools from interfering with each other and to allow multiple tools to operate at the same time. Currently tools are completely independent and cannot be used to monitor each other. This restriction may be lifted in the future.
pt_br: Um identificador de ferramenta é um número inteiro e o nome associado. Os identificadores de ferramenta são usados para evitar que as ferramentas interfiram umas nas outras e para permitir que várias ferramentas operem ao mesmo tempo. Atualmente, as ferramentas são totalmente independentes e não podem ser usadas para monitorar umas às outras. Essa restrição poderá ser suspensa no futuro.

source: Before registering or activating events, a tool should choose an identifier. Identifiers are integers in the range 0 to 5 inclusive.
pt_br: Antes de registrar ou ativar eventos, uma ferramenta deve escolher um identificador. Os identificadores são números inteiros no intervalo de 0 a 5, inclusive.

source: Registering and using tools
pt_br: Registro e uso de ferramentas

source: Must be called before *tool_id* can be used. *tool_id* must be in the range 0 to 5 inclusive. Raises a :exc:`ValueError` if *tool_id* is in use.
pt_br: Deve ser chamado antes que *tool_id* possa ser usado. *tool_id* deve estar no intervalo de 0 a 5, inclusive. Levanta um :exc:`ValueError` se *tool_id* estiver em uso.

source: Unregister all events and callback functions associated with *tool_id*.
pt_br: Cancela o registro de todos os eventos e funções de retorno de chamada associados a *tool_id*.

source: Should be called once a tool no longer requires *tool_id*. Will call :func:`clear_tool_id` before releasing *tool_id*.
pt_br: Deve ser chamado quando uma ferramenta não precisar mais de *tool_id*. Chamará :func:`clear_tool_id` antes de liberar *tool_id*.

source: Returns the name of the tool if *tool_id* is in use, otherwise it returns ``None``. *tool_id* must be in the range 0 to 5 inclusive.
pt_br: Retorna o nome da ferramenta se *tool_id* estiver em uso; caso contrário, retorna ``None``. *tool_id* deve estar no intervalo de 0 a 5, inclusive.

source: All IDs are treated the same by the VM with regard to events, but the following IDs are pre-defined to make co-operation of tools easier::
pt_br: Todas as IDs são tratadas da mesma forma pela VM com relação aos eventos, mas as seguintes IDs são predefinidas para facilitar a cooperação entre as ferramentas::

source: Events
pt_br: Eventos

source: The following events are supported:
pt_br: Os seguintes eventos são suportados:

source: A conditional branch goes left.
pt_br: Uma ramificação condicional vai para a esquerda.

source: It is up to the tool to determine how to present "left" and "right" branches. There is no guarantee which branch is "left" and which is "right", except that it will be consistent for the duration of the program.
pt_br: Cabe à ferramenta determinar como apresentar os ramos "esquerdo" e "direito". Não há garantia de qual ramo é "esquerdo" e qual é "direito", exceto que será consistente durante toda a duração do programa.

source: A conditional branch goes right.
pt_br: Uma ramificação condicional vai para a direita.

source: A call in Python code (event occurs before the call).
pt_br: Uma chamada no código Python (o evento ocorre antes da chamada).

source: An exception raised from any callable, except for Python functions (event occurs after the exit).
pt_br: Uma exceção levantada por qualquer chamável, exceto funções Python (o evento ocorre após a saída).

source: Return from any callable, except for Python functions (event occurs after the return).
pt_br: Retorno de qualquer chamável, exceto por funções Python (o evento ocorre após o retorno).

source: An exception is handled.
pt_br: Uma exceção é tratada.

source: A VM instruction is about to be executed.
pt_br: Uma instrução VM está prestes a ser executada.

source: An unconditional jump in the control flow graph is made.
pt_br: É feito um salto incondicional no gráfico do fluxo de controle.

source: An instruction is about to be executed that has a different line number from the preceding instruction.
pt_br: Está prestes a ser executada uma instrução que tem um número de linha diferente da instrução anterior.

source: Resumption of a Python function (for generator and coroutine functions), except for ``throw()`` calls.
pt_br: Retomada de uma função Python (para funções geradoras e de corrotina), exceto para chamadas ``throw()``.

source: Return from a Python function (occurs immediately before the return, the callee's frame will be on the stack).
pt_br: Retorno de uma função Python (ocorre imediatamente antes do retorno, o quadro do receptor estará na pilha).

source: Start of a Python function (occurs immediately after the call, the callee's frame will be on the stack)
pt_br: Início de uma função Python (ocorre imediatamente após a chamada, o quadro do receptor da chamada estará na pilha)

source: A Python function is resumed by a ``throw()`` call.
pt_br: Uma função Python é retomada por uma chamada ``throw()``.

source: Exit from a Python function during exception unwinding. This includes exceptions raised directly within the function and that are allowed to continue to propagate.
pt_br: Saída de uma função Python durante o desenrolamento de uma exceção. Isso inclui exceções levantadas diretamente na função e que podem continuar a se propagar.

source: Yield from a Python function (occurs immediately before the yield, the callee's frame will be on the stack).
pt_br: Produz de uma função Python (ocorre imediatamente antes do yield, o quadro do receptor estará na pilha).

source: An exception is raised, except those that cause a :monitoring-event:`STOP_ITERATION` event.
pt_br: Uma exceção é levantada, exceto aquelas que causam um evento :monitoring-event:`STOP_ITERATION`.

source: An exception is re-raised, for example at the end of a :keyword:`finally` block.
pt_br: Uma exceção é levantada novamente, por exemplo, no final de um bloco :keyword:`finally`.

source: An artificial :exc:`StopIteration` is raised; see `the STOP_ITERATION event`_.
pt_br: Uma exceção artificial :exc:`StopIteration` é levantada; consulte `o evento STOP_ITERATION`_.

source: More events may be added in the future.
pt_br: Mais eventos poderão ser adicionados no futuro.

source: These events are attributes of the :mod:`!sys.monitoring.events` namespace. Each event is represented as a power-of-2 integer constant. To define a set of events, simply bitwise OR the individual events together. For example, to specify both :monitoring-event:`PY_RETURN` and :monitoring-event:`PY_START` events, use the expression ``PY_RETURN | PY_START``.
pt_br: Esses eventos são atributos do espaço de nomes :mod:`!sys.monitoring.events`. Cada evento é representado como uma constante de potência de 2 inteiros. Para definir um conjunto de eventos, basta aplicar OU (OR) bit a bit nos eventos individuais juntos. Por exemplo, para especificar os eventos :monitoring-event:`PY_RETURN` e :monitoring-event:`PY_START`, use a expressão ``PY_RETURN | PY_START``.

source: An alias for ``0`` so users can do explicit comparisons like::
pt_br: Um apelido para ``0`` para que os usuários possam fazer comparações explícitas como::

source: Setting this event deactivates all events.
pt_br: Definir este evento desativa todos os eventos.

source: Local events
pt_br: Eventos locais

source: Local events are associated with normal execution of the program and happen at clearly defined locations. All local events can be disabled. The local events are:
pt_br: Os eventos locais estão associados à execução normal do programa e ocorrem em locais claramente definidos. Todos os eventos locais podem ser desativados. Os eventos locais são:

source: Deprecated event
pt_br: Evento descontinuado

source: The ``BRANCH`` event is deprecated in 3.14. Using :monitoring-event:`BRANCH_LEFT` and :monitoring-event:`BRANCH_RIGHT` events will give much better performance as they can be disabled independently.
pt_br: O evento ``BRANCH`` foi descontinuado na versão 3.14. Usar os eventos :monitoring-event:`BRANCH_LEFT` e :monitoring-event:`BRANCH_RIGHT` proporcionará um desempenho muito melhor, pois podem ser desabilitados independentemente.

source: Ancillary events
pt_br: Eventos auxiliares

source: Ancillary events can be monitored like other events, but are controlled by another event:
pt_br: Os eventos auxiliares podem ser monitorados como outros eventos, mas são controlados por outro evento:

source: The :monitoring-event:`C_RETURN` and :monitoring-event:`C_RAISE` events are controlled by the :monitoring-event:`CALL` event. :monitoring-event:`C_RETURN` and :monitoring-event:`C_RAISE` events will only be seen if the corresponding :monitoring-event:`CALL` event is being monitored.
pt_br: Os eventos :monitoring-event:`C_RETURN` e :monitoring-event:`C_RAISE` são controlados pelo evento :monitoring-event:`CALL`. Os eventos :monitoring-event:`C_RETURN` e :monitoring-event:`C_RAISE` só serão vistos se o evento :monitoring-event:`CALL` correspondente estiver sendo monitorado.

source: Other events
pt_br: Outros eventos

source: Other events are not necessarily tied to a specific location in the program and cannot be individually disabled.
pt_br: Outros eventos não estão necessariamente vinculados a um local específico no programa e não podem ser desativados individualmente.

source: The other events that can be monitored are:
pt_br: Os outros eventos que podem ser monitorados são:

source: The STOP_ITERATION event
pt_br: O evento STOP_ITERATION

source: :pep:`PEP 380 <380#use-of-stopiteration-to-return-values>` specifies that a :exc:`StopIteration` exception is raised when returning a value from a generator or coroutine. However, this is a very inefficient way to return a value, so some Python implementations, notably CPython 3.12+, do not raise an exception unless it would be visible to other code.
pt_br: :pep:`PEP 380 <380#use-of-stopiteration-to-return-values>` especifica que uma exceção :exc:`StopIteration` é levantada ao retornar um valor de um gerador ou corrotina. No entanto, essa é uma maneira muito ineficiente de retornar um valor, portanto, algumas implementações do Python, especialmente o CPython 3.12+, não levantam uma exceção, a menos que ela seja visível para outro código.

source: To allow tools to monitor for real exceptions without slowing down generators and coroutines, the :monitoring-event:`STOP_ITERATION` event is provided. :monitoring-event:`STOP_ITERATION` can be locally disabled, unlike :monitoring-event:`RAISE`.
pt_br: Para permitir que as ferramentas monitorem exceções reais sem reduzir a velocidade dos geradores e das corrotinas, o evento :monitoring-event:`STOP_ITERATION` é fornecido. O :monitoring-event:`STOP_ITERATION` pode ser desativado localmente, ao contrário do :monitoring-event:`RAISE`.

source: Note that the :monitoring-event:`STOP_ITERATION` event and the :monitoring-event:`RAISE` event for a :exc:`StopIteration` exception are equivalent, and are treated as interchangeable when generating events. Implementations will favor :monitoring-event:`STOP_ITERATION` for performance reasons, but may generate a :monitoring-event:`RAISE` event with a :exc:`StopIteration`.
pt_br: Observe que o evento :monitoring-event:`STOP_ITERATION` e o evento :monitoring-event:`RAISE` para uma exceção :exc:`StopIteration` são equivalentes e tratados como intercambiáveis ao gerar eventos. As implementações favorecerão :monitoring-event:`STOP_ITERATION` por questões de desempenho, mas podem gerar um evento :monitoring-event:`RAISE` com uma :exc:`StopIteration`.

source: Turning events on and off
pt_br: Ativação e desativação de eventos

source: In order to monitor an event, it must be turned on and a corresponding callback must be registered. Events can be turned on or off by setting the events either globally and/or for a particular code object. An event will trigger only once, even if it is turned on both globally and locally.
pt_br: Para monitorar um evento, ele deve ser ativado e uma função de retorno correspondente deve ser registrada. Os eventos podem ser ativados ou desativados definindo-os globalmente e/ou para um objeto código específico. Um evento vai acionar apenas uma vez, mesmo se ele for ligado globalmente e localmente.

source: Setting events globally
pt_br: Definir eventos globalmente

source: Events can be controlled globally by modifying the set of events being monitored.
pt_br: Os eventos podem ser controlados globalmente, modificando o conjunto de eventos que estão sendo monitorados.

source: Returns the ``int`` representing all the active events.
pt_br: Retorna o endereço ``int`` que representa todos os eventos ativos.

source: Activates all events which are set in *event_set*. Raises a :exc:`ValueError` if *tool_id* is not in use.
pt_br: Ativa todos os eventos definidos em *event_set*. Levanta um :exc:`ValueError` se *tool_id* não estiver em uso.

source: No events are active by default.
pt_br: Nenhum evento está ativo por padrão.

source: Per code object events
pt_br: Eventos por objeto código

source: Events can also be controlled on a per code object basis. The functions defined below which accept a :class:`types.CodeType` should be prepared to accept a look-alike object from functions which are not defined in Python (see :ref:`c-api-monitoring`).
pt_br: Os eventos também podem ser controlados por objeto código. As funções definidas abaixo que aceitam um :class:`types.CodeType` devem estar preparadas para aceitar um objeto semelhante de funções que não são definidas no Python (veja :ref:`c-api-monitoring`).

source: Returns all the local events for *code*
pt_br: Retorna todos os eventos locais para *code*

source: Activates all the local events for *code* which are set in *event_set*. Raises a :exc:`ValueError` if *tool_id* is not in use.
pt_br: Ativa todos os eventos locais para *code* que estão definidos em *event_set*. Levanta a :exc:`ValueError` se *tool_id* não estiver em uso.

source: Disabling events
pt_br: Desativação de eventos

source: A special value that can be returned from a callback function to disable events for the current code location.
pt_br: Um valor especial que pode ser retornado de um função de retorno função para desativar eventos para o local do código atual.

source: Local events can be disabled for a specific code location by returning :data:`sys.monitoring.DISABLE` from a callback function. This does not change which events are set, or any other code locations for the same event.
pt_br: Os eventos locais podem ser desativados para um local de código específico, retornando :data:`sys.monitoring.DISABLE` de uma função de retorno de chamada. Isso não altera quais eventos são definidos ou quaisquer outros locais de código para o mesmo evento.

source: Disabling events for specific locations is very important for high performance monitoring. For example, a program can be run under a debugger with no overhead if the debugger disables all monitoring except for a few breakpoints.
pt_br: A desativação de eventos para locais específicos é muito importante para o monitoramento de alto desempenho. Por exemplo, um programa pode ser executado em um depurador sem sobrecarga se o depurador desativar todo o monitoramento, exceto alguns pontos de interrupção.

source: Enable all the events that were disabled by :data:`sys.monitoring.DISABLE` for all tools.
pt_br: Habilita todos os eventos que foram desabilitados por :data:`sys.monitoring.DISABLE` para todas as ferramentas.

source: Registering callback functions
pt_br: Registro de funções de retorno de chamada

source: Registers the callable *func* for the *event* with the given *tool_id*
pt_br: Registra o chamável *func* para o *event* com o *tool_id* fornecido

source: If another callback was registered for the given *tool_id* and *event*, it is unregistered and returned. Otherwise :func:`register_callback` returns ``None``.
pt_br: Se outra função de retorno tiver sido registrada para o *tool_id* e o *event* fornecidos, ela será cancelada e retornada. Caso contrário, :func:`register_callback` retorna ``None``.

source: Functions can be unregistered by calling ``sys.monitoring.register_callback(tool_id, event, None)``.
pt_br: As funções podem ser canceladas chamando ``sys.monitoring.register_callback(tool_id, event, None)``.

source: Callback functions can be registered and unregistered at any time.
pt_br: As funções de retorno de chamada podem ser registradas e canceladas a qualquer momento.

source: Callbacks are called only once regardless if the event is turned on both globally and locally. As such, if an event could be turned on for both global and local events by your code then the callback needs to be written to handle either trigger.
pt_br: Os retornos de chamada são chamados apenas uma vez, independentemente de o evento estar ativado global e localmente. Portanto, se um evento puder ser ativado tanto para eventos globais quanto locais pelo seu código, o retorno de chamada precisa ser escrito para lidar com qualquer um dos gatilhos.

source: Callback function arguments
pt_br: Argumentos da função de retorno de chamada

source: A special value that is passed to a callback function to indicate that there are no arguments to the call.
pt_br: Um valor especial que é passado para uma função de retorno para indicar que não há argumento para a chamada.

source: When an active event occurs, the registered callback function is called. Callback functions returning an object other than :data:`DISABLE` will have no effect. Different events will provide the callback function with different arguments, as follows:
pt_br: Quando ocorre um evento ativo, a função de retorno de chamada registrada é chamada. Funções de retorno retornando um objeto diferente de :data:`DISABLE` vai ter nenhum efeito. Eventos diferentes fornecerão à função de retorno de chamada argumentos diferentes, como segue:

source: :monitoring-event:`PY_START` and :monitoring-event:`PY_RESUME`::
pt_br: :monitoring-event:`PY_START` e :monitoring-event:`PY_RESUME`::

source: :monitoring-event:`PY_RETURN` and :monitoring-event:`PY_YIELD`::
pt_br: :monitoring-event:`PY_RETURN` e :monitoring-event:`PY_YIELD`::

source: :monitoring-event:`CALL`, :monitoring-event:`C_RAISE` and :monitoring-event:`C_RETURN` (*arg0* can be :data:`MISSING` specifically)::
pt_br: :monitoring-event:`CALL`, :monitoring-event:`C_RAISE` e :monitoring-event:`C_RETURN` (*arg0* pode ser :data:`MISSING` especificamente)::

source: *code* represents the code object where the call is being made, while *callable* is the object that is about to be called (and thus triggered the event). If there are no arguments, *arg0* is set to :data:`sys.monitoring.MISSING`.
pt_br: *code* representa o objeto de código onde a chamada está sendo feita, enquanto *callable* é o objeto que está prestes a ser chamado (e, portanto, acionou o evento). Se não houver argumentos, *arg0* é definido como :data:`sys.monitoring.MISSING`.

source: For instance methods, *callable* will be the function object as found on the class with *arg0* set to the instance (i.e. the ``self`` argument to the method).
pt_br: Para métodos de instância, *callable* será o objeto função encontrado na classe com *arg0* definido para a instância (ou seja, o argumento ``self`` para o método).

source: :monitoring-event:`RAISE`, :monitoring-event:`RERAISE`, :monitoring-event:`EXCEPTION_HANDLED`, :monitoring-event:`PY_UNWIND`, :monitoring-event:`PY_THROW` and :monitoring-event:`STOP_ITERATION`::
pt_br: :monitoring-event:`RAISE`, :monitoring-event:`RERAISE`, :monitoring-event:`EXCEPTION_HANDLED`, :monitoring-event:`PY_UNWIND`, :monitoring-event:`PY_THROW` e :monitoring-event:`STOP_ITERATION`::

source: :monitoring-event:`BRANCH_LEFT`, :monitoring-event:`BRANCH_RIGHT` and :monitoring-event:`JUMP`::
pt_br: :monitoring-event:`BRANCH_LEFT`, :monitoring-event:`BRANCH_RIGHT` e :monitoring-event:`JUMP`::

source: Note that the *destination_offset* is where the code will next execute.
pt_br: Observe que o *destination_offset* é onde o código será executado em seguida.
