Repository: python/python-docs-pt-br
Catalog: library/sys_path_init.po
Languages: pt_br

source: The initialization of the :data:`sys.path` module search path
pt_br: A inicialização do caminho de pesquisa de módulos :data:`sys.path`

source: A module search path is initialized when Python starts. This module search path may be accessed at :data:`sys.path`.
pt_br: Um caminho de pesquisa de módulos é inicializado quando o Python é iniciado. Este caminho de pesquisa de módulos pode ser acessado em :data:`sys.path`.

source: The first entry in the module search path is the directory that contains the input script, if there is one. Otherwise, the first entry is the current directory, which is the case when executing the interactive shell, a :option:`-c` command, or :option:`-m` module.
pt_br: A primeira entrada no caminho de pesquisa de módulos é o diretório que contém o script de entrada, se houver. Caso contrário, a primeira entrada é o diretório atual, que é o caso ao executar o console interativo, um comando com :option:`-c` ou um módulo com :option:`-m`.

source: The :envvar:`PYTHONPATH` environment variable is often used to add directories to the search path. If this environment variable is found then the contents are added to the module search path.
pt_br: A variável de ambiente :envvar:`PYTHONPATH` é frequentemente usada para adicionar diretórios ao caminho de pesquisa. Se esta variável de ambiente for encontrada, o conteúdo será adicionado ao caminho de pesquisa de módulos.

source: :envvar:`PYTHONPATH` will affect all installed Python versions/environments. Be wary of setting this in your shell profile or global environment variables. The :mod:`site` module offers more nuanced techniques as mentioned below.
pt_br: :envvar:`PYTHONPATH` afetará todas as versões/ambientes Python instalados. Tenha cuidado ao definir isso em seu perfil do shell ou em variáveis de ambiente globais. O módulo :mod:`site` oferece técnicas mais diferenciadas, conforme mencionado abaixo.

source: The next items added are the directories containing standard Python modules as well as any :term:`extension module`\s that these modules depend on. Extension modules are ``.pyd`` files on Windows and ``.so`` files on other platforms. The directory with the platform-independent Python modules is called ``prefix``. The directory with the extension modules is called ``exec_prefix``.
pt_br: Os próximos itens adicionados são os diretórios contendo módulos padrão do Python, bem como quaisquer :term:`módulos de extensão <módulo de extensão>` dos quais esses módulos dependem. Módulos de extensão são arquivos ``.pyd`` no Windows e arquivos ``.so`` em outras plataformas. O diretório com os módulos Python independentes de plataforma é chamado ``prefix``. O diretório com os módulos de extensão é chamado ``exec_prefix``.

source: The :envvar:`PYTHONHOME` environment variable may be used to set the ``prefix`` and ``exec_prefix`` locations. Otherwise these directories are found by using the Python executable as a starting point and then looking for various 'landmark' files and directories. Note that any symbolic links are followed so the real Python executable location is used as the search starting point. The Python executable location is called ``home``.
pt_br: A variável de ambiente :envvar:`PYTHONHOME` pode ser usada para definir os locais ``prefix`` e ``exec_prefix``. Caso contrário, esses diretórios serão encontrados usando o executável Python como ponto de partida e, em seguida, procurando por vários arquivos e diretórios "de referência". Observe que todos os links simbólicos são seguidos para que o local real do executável do Python seja usado como ponto de partida da pesquisa. O local do executável do Python é chamado ``home``.

source: Once ``home`` is determined, the ``prefix`` directory is found by first looking for :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). On Windows the zip archive is searched for in ``home`` and on Unix the archive is expected to be in :file:`lib`. Note that the expected zip archive location is added to the module search path even if the archive does not exist. If no archive was found, Python on Windows will continue the search for ``prefix`` by looking for :file:`Lib\\os.py`. Python on Unix will look for :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). On Windows ``prefix`` and ``exec_prefix`` are the same, however on other platforms :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) is searched for and used as an anchor for ``exec_prefix``. On some platforms :file:`lib` may be :file:`lib64` or another value, see :data:`sys.platlibdir` and :envvar:`PYTHONPLATLIBDIR`.
pt_br: Uma vez que ``home`` é determinado, o diretório ``prefix`` é encontrado procurando primeiro por :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). No Windows, o arquivo zip é procurado em ``home`` e no Unix espera-se que o arquivo esteja em :file:`lib`. Observe que o local esperado do arquivo zip é adicionado ao caminho de pesquisa de módulos, mesmo que o arquivo não exista. Se nenhum arquivo for encontrado, o Python no Windows continuará a pesquisa por ``prefix`` procurando por :file:`Lib\\os.py`. Python no Unix procurará por :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). No Windows, ``prefix`` e ``exec_prefix`` são iguais, porém em outras plataformas :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) é pesquisado e usado como âncora para ``exec_prefix``. Em algumas plataformas, :file:`lib` pode ser :file:`lib64` ou outro valor, veja :data:`sys.platlibdir` e :envvar:`PYTHONPLATLIBDIR`.

source: Once found, ``prefix`` and ``exec_prefix`` are available at :data:`sys.base_prefix` and :data:`sys.base_exec_prefix` respectively.
pt_br: Uma vez encontrados, ``prefix`` e ``exec_prefix`` estão disponíveis em :data:`sys.base_prefix` e :data:`sys.base_exec_prefix`, respectivamente.

source: If :envvar:`PYTHONHOME` is not set, and a ``pyvenv.cfg`` file is found alongside the main executable, or in its parent directory, :data:`sys.prefix` and :data:`sys.exec_prefix` get set to the directory containing ``pyvenv.cfg``, otherwise they are set to the same value as :data:`sys.base_prefix` and :data:`sys.base_exec_prefix`, respectively. This is used by :ref:`sys-path-init-virtual-environments`.
pt_br: Se :envvar:`PYTHONHOME` não estiver definido e um arquivo ``pyvenv.cfg`` for encontrado ao lado do executável principal ou em seu diretório pai, :data:`sys.prefix` e :data:`sys.exec_prefix` serão definidos para o diretório que contém ``pyvenv.cfg``; caso contrário, serão definidos com o mesmo valor que :data:`sys.base_prefix` e :data:`sys.base_exec_prefix`, respectivamente. Isso é usado por :ref:`sys-path-init-virtual-environments`.

source: Finally, the :mod:`site` module is processed and :file:`site-packages` directories are added to the module search path. A common way to customize the search path is to create :mod:`sitecustomize` or :mod:`usercustomize` modules as described in the :mod:`site` module documentation.
pt_br: Finalmente, o módulo :mod:`site` é processado e os diretórios :file:`site-packages` são adicionados ao caminho de pesquisa de módulos. Uma maneira comum de personalizar o caminho de pesquisa é criar módulos :mod:`sitecustomize` ou :mod:`usercustomize` conforme descrito na documentação do módulo :mod:`site`.

source: Certain command line options may further affect path calculations. See :option:`-E`, :option:`-I`, :option:`-s` and :option:`-S` for further details.
pt_br: Certas opções de linha de comando podem afetar ainda mais os cálculos de caminho. Veja :option:`-E`, :option:`-I`, :option:`-s` e :option:`-S` para mais detalhes.

source: :data:`sys.prefix` and :data:`sys.exec_prefix` are now set to the ``pyvenv.cfg`` directory during the path initialization. This was previously done by :mod:`site`, therefore affected by :option:`-S`.
pt_br: :data:`sys.prefix` e :data:`sys.exec_prefix` agora são definidos para o diretório ``pyvenv.cfg`` durante a inicialização do caminho. Isso era feito anteriormente por :mod:`site` e, portanto, afetado por :option:`-S`.

source: Virtual Environments
pt_br: Ambientes virtuais

source: Virtual environments place a ``pyvenv.cfg`` file in their prefix, which causes :data:`sys.prefix` and :data:`sys.exec_prefix` to point to them, instead of the base installation.
pt_br: Ambientes virtuais colocam um arquivo ``pyvenv.cfg`` em seu prefixo, o que faz com que :data:`sys.prefix` e :data:`sys.exec_prefix` apontem para eles, em vez da instalação base.

source: The ``prefix`` and ``exec_prefix`` values of the base installation are available at :data:`sys.base_prefix` and :data:`sys.base_exec_prefix`.
pt_br: Os valores ``prefix`` e ``exec_prefix`` da instalação base estão disponíveis em :data:`sys.base_prefix` e :data:`sys.base_exec_prefix`.

source: As well as being used as a marker to identify virtual environments, ``pyvenv.cfg`` may also be used to configure the :mod:`site` initialization. Please refer to :mod:`site`'s :ref:`virtual environments documentation <site-virtual-environments-configuration>`.
pt_br: Além de ser usado como um marcador para identificar ambientes virtuais, ``pyvenv.cfg`` também pode ser usado para configurar a inicialização do :mod:`site`. Consulte a :ref:`documentação de ambientes virtuais <site-virtual-environments-configuration>` do :mod:`site`.

source: :envvar:`PYTHONHOME` overrides the ``pyvenv.cfg`` detection.
pt_br: :envvar:`PYTHONHOME` substitui a detecção ``pyvenv.cfg``.

source: There are other ways how "virtual environments" could be implemented, this documentation refers implementations based on the ``pyvenv.cfg`` mechanism, such as :mod:`venv`. Most virtual environment implementations follow the model set by :mod:`venv`, but there may be exotic implementations that diverge from it.
pt_br: Existem outras maneiras de implementar "ambientes virtuais". Esta documentação menciona implementações baseadas no mecanismo ``pyvenv.cfg``, como :mod:`venv`. A maioria das implementações de ambientes virtuais segue o modelo definido por :mod:`venv`, mas pode haver implementações exóticas que divergem dele.

source: _pth files
pt_br: Arquivos _pth

source: To completely override :data:`sys.path` create a ``._pth`` file with the same name as the shared library or executable (``python._pth`` or ``python311._pth``). The shared library path is always known on Windows, however it may not be available on other platforms. In the ``._pth`` file specify one line for each path to add to :data:`sys.path`. The file based on the shared library name overrides the one based on the executable, which allows paths to be restricted for any program loading the runtime if desired.
pt_br: Para substituir completamente :data:`sys.path`, crie um arquivo ``._pth`` com o mesmo nome da biblioteca compartilhada ou executável (``python._pth`` ou ``python311._pth``). O caminho da biblioteca compartilhada é sempre conhecido no Windows, mas pode não estar disponível em outras plataformas. No arquivo ``._pth``, especifique uma linha para cada caminho a ser adicionado a :data:`sys.path`. O arquivo baseado no nome da biblioteca compartilhada substitui aquele baseado no executável, o que permite que os caminhos sejam restritos para qualquer programa que carregue o tempo de execução, se desejado.

source: When the file exists, all registry and environment variables are ignored, isolated mode is enabled, and :mod:`site` is not imported unless one line in the file specifies ``import site``. Blank paths and lines starting with ``#`` are ignored. Each path may be absolute or relative to the location of the file. Import statements other than to ``site`` are not permitted, and arbitrary code cannot be specified.
pt_br: Quando o arquivo existe, todos os registros e variáveis de ambiente são ignorados, o modo isolado é ativado, e :mod:`site` não é importado a menos que uma linha do arquivo especifique ``import site``. Caminhos em branco e linhas começando com ``#`` são ignorados. Cada caminho pode ser absoluto ou relativo ao local do arquivo. Instruções de importação diferente de ``site`` não são permitidas, e código arbitrário não pode ser especificado.

source: Note that ``.pth`` files (without leading underscore) will be processed normally by the :mod:`site` module when ``import site`` has been specified.
pt_br: Note que arquivos ``.pth`` (sem o sublinhado no início) serão processados normalmente pelo módulo :mod:`site` quando ``import site`` tiver sido especificado.

source: Embedded Python
pt_br: Python embarcado

source: If Python is embedded within another application :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure can be used to initialize Python. The path specific details are described at :ref:`init-path-config`.
pt_br: Se o Python estiver incorporado em outra aplicação, :c:func:`Py_InitializeFromConfig` e a estrutura :c:type:`PyConfig` podem ser usados para inicializar o Python. Os detalhes específicos do caminho estão descritos em :ref:`init-path-config`.

source: :ref:`windows_finding_modules` for detailed Windows notes.
pt_br: :ref:`windows_finding_modules` para observações detalhadas do Windows.

source: :ref:`using-on-unix` for Unix details.
pt_br: :ref:`using-on-unix` para detalhes do Unix.
