Repository: python/python-docs-pt-br
Catalog: library/sysconfig.po
Languages: pt_br

source: :mod:`!sysconfig` --- Provide access to Python's configuration information
pt_br: :mod:`!sysconfig` --- Fornece acesso às informações de configuração do Python

source: **Source code:** :source:`Lib/sysconfig`
pt_br: **Código-fonte:** :source:`Lib/sysconfig`

source: The :mod:`sysconfig` module provides access to Python's configuration information like the list of installation paths and the configuration variables relevant for the current platform.
pt_br: O módulo :mod:`sysconfig` fornece acesso às informações de configuração do Python, como a lista de caminhos de instalação e as variáveis de configuração relevantes para a plataforma atual.

source: Configuration variables
pt_br: Variáveis de configuração

source: A Python distribution contains a :file:`Makefile` and a :file:`pyconfig.h` header file that are necessary to build both the Python binary itself and third-party C extensions compiled using ``setuptools``.
pt_br: Uma distribuição do Python contém um arquivo de cabeçalho :file:`Makefile` e :file:`pyconfig.h` que são necessários para construir o próprio binário do Python e extensões C de terceiros compiladas usando ``setuptools``.

source: :mod:`sysconfig` puts all variables found in these files in a dictionary that can be accessed using :func:`get_config_vars` or :func:`get_config_var`.
pt_br: :mod:`sysconfig` coloca todas as variáveis encontradas nestes arquivos em um dicionário que pode ser acessado usando :func:`get_config_vars` ou :func:`get_config_var`.

source: Notice that on Windows, it's a much smaller set.
pt_br: Note que no Windows, é um conjunto muito menor.

source: With no arguments, return a dictionary of all configuration variables relevant for the current platform.
pt_br: Sem argumentos, retorna um dicionário de todas as variáveis de configuração relevantes para a plataforma atual.

source: With arguments, return a list of values that result from looking up each argument in the configuration variable dictionary.
pt_br: Com argumentos, retorna uma lista de valores resultantes da pesquisa de cada argumento no dicionário de variáveis de configuração.

source: For each argument, if the value is not found, return ``None``.
pt_br: Para cada argumento, se o valor não for encontrado, retorna ``None``.

source: Return the value of a single variable *name*. Equivalent to ``get_config_vars().get(name)``.
pt_br: Retorna o valor de uma única variável *nome*. Equivalente a ``get_config_vars().get(name)``.

source: If *name* is not found, return ``None``.
pt_br: Se *name* não for encontrado, retorna ``None``.

source: Example of usage::
pt_br: Exemplo de uso::

source: Installation paths
pt_br: Caminhos de instalação

source: Python uses an installation scheme that differs depending on the platform and on the installation options. These schemes are stored in :mod:`sysconfig` under unique identifiers based on the value returned by :const:`os.name`. The schemes are used by package installers to determine where to copy files to.
pt_br: O Python usa um esquema de instalação que difere dependendo da plataforma e das opções de instalação. Esses esquemas são armazenados em :mod:`sysconfig` sob identificadores únicos baseados no valor retornado por :const:`os.name`. Os esquemas são usados por instaladores de pacote para determinar para onde copiar arquivos.

source: Python currently supports nine schemes:
pt_br: Python atualmente oferece suporte a nove esquemas:

source: *posix_prefix*: scheme for POSIX platforms like Linux or macOS. This is the default scheme used when Python or a component is installed.
pt_br: *posix_prefix*: esquema para plataformas POSIX como Linux ou macOS. Este é o esquema padrão usado quando o Python ou um componente é instalado.

source: *posix_home*: scheme for POSIX platforms, when the *home* option is used. This scheme defines paths located under a specific home prefix.
pt_br: *posix_home*: esquema para plataformas POSIX, quando a opção *home* é usada. Esse esquema define caminhos localizados sob um prefixo inicial específico.

source: *posix_user*: scheme for POSIX platforms, when the *user* option is used. This scheme defines paths located under the user's home directory (:const:`site.USER_BASE`).
pt_br: *posix_user*: esquema para plataformas POSIX, quando a opção *user* é usada. Esse esquema define caminhos localizados sob o diretório pessoal (home) do usuário (:const:`site.USER_BASE`).

source: *posix_venv*: scheme for :mod:`Python virtual environments <venv>` on POSIX platforms; by default it is the same as *posix_prefix*.
pt_br: *posix_venv*: esquema para :mod:`ambientes virtuais do Python <venv>` em plataformas POSIX; por padrão, é o mesmo que *posix_prefix*.

source: *nt*: scheme for Windows. This is the default scheme used when Python or a component is installed.
pt_br: *nt*: esquema para Windows. Este é o esquema padrão usado quando o Python ou um componente é instalado.

source: *nt_user*: scheme for Windows, when the *user* option is used.
pt_br: *nt_user*: esquema para Windows, quando utilizada a opção *user*.

source: *nt_venv*: scheme for :mod:`Python virtual environments <venv>` on Windows; by default it is the same as *nt*.
pt_br: *nt_venv*: esquema para :mod:`ambientes virtuais do Python <venv>` no Windows; por padrão, é o mesmo que *nt_prefix*.

source: *venv*: a scheme with values from either *posix_venv* or *nt_venv* depending on the platform Python runs on.
pt_br: *venv*: um esquema com valores de *posix_venv* ou *nt_venv* dependendo da plataforma em que o Python é executado.

source: *osx_framework_user*: scheme for macOS, when the *user* option is used.
pt_br: *osx_framework_user*: esquema para plataformas macOS, quando utilizada a opção *user*.

source: Each scheme is itself composed of a series of paths and each path has a unique identifier. Python currently uses eight paths:
pt_br: Cada esquema é composto por uma série de caminhos e cada caminho possui um identificador único. Python atualmente usa oito caminhos:

source: *stdlib*: directory containing the standard Python library files that are not platform-specific.
pt_br: *stdlib*: diretório que contém os arquivos da biblioteca Python padrão que não são específicos da plataforma.

source: *platstdlib*: directory containing the standard Python library files that are platform-specific.
pt_br: *platstdlib*: diretório que contém os arquivos da biblioteca Python padrão que são específicos da plataforma.

source: *platlib*: directory for site-specific, platform-specific files.
pt_br: *platlib*: diretório para arquivos específicos do site e específicos da plataforma.

source: *purelib*: directory for site-specific, non-platform-specific files ('pure' Python).
pt_br: *purelib*: diretório para arquivos específicos do site e não específicos da plataforma (Python 'pure').

source: *include*: directory for non-platform-specific header files for the Python C-API.
pt_br: *include*: diretório para arquivos de cabeçalho não específicos da plataforma para a API C do Python.

source: *platinclude*: directory for platform-specific header files for the Python C-API.
pt_br: *platinclude*: diretório para arquivos de cabeçalho específicos da plataforma para a API C do Python.

source: *scripts*: directory for script files.
pt_br: *scripts*: diretório para arquivos de script.

source: *data*: directory for data files.
pt_br: *data*: diretório para arquivos de dados.

source: User scheme
pt_br: Esquema de usuário

source: This scheme is designed to be the most convenient solution for users that don't have write permission to the global site-packages directory or don't want to install into it.
pt_br: Este esquema foi projetado para ser a solução mais conveniente para usuários que não têm permissão de escrita no diretório global de pacotes de sites ou não desejam instalar nele.

source: Files will be installed into subdirectories of :const:`site.USER_BASE` (written as :file:`{userbase}` hereafter). This scheme installs pure Python modules and extension modules in the same location (also known as :const:`site.USER_SITE`).
pt_br: Os arquivos serão instalados em subdiretórios de :const:`site.USER_BASE` (escrito como :file:`{userbase}` daqui em diante). Este esquema instala módulos Python puros e módulos de extensão no mesmo local (também conhecido como :const:`site.USER_SITE`).

source: Path
pt_br: Caminho

source: Installation directory
pt_br: Diretório de instalação

source: Home scheme
pt_br: Esquema de home

source: The idea behind the "home scheme" is that you build and maintain a personal stash of Python modules. This scheme's name is derived from the idea of a "home" directory on Unix, since it's not unusual for a Unix user to make their home directory have a layout similar to :file:`/usr/` or :file:`/usr/local/`. This scheme can be used by anyone, regardless of the operating system they are installing for.
pt_br: A ideia por trás do "esquema home" é que você construa e mantenha um estoque pessoal de módulos Python. O nome deste esquema é derivado da ideia de um diretório "home" no Unix, uma vez que não é incomum para um usuário Unix fazer seu diretório home ter um layout semelhante a :file:`/usr/` ou :file:`/usr/local/`. Este esquema pode ser usado por qualquer pessoa, independentemente do sistema operacional para o qual está instalando.

source: Prefix scheme
pt_br: Esquema de prefixo

source: The "prefix scheme" is useful when you wish to use one Python installation to perform the build/install (i.e., to run the setup script), but install modules into the third-party module directory of a different Python installation (or something that looks like a different Python installation). If this sounds a trifle unusual, it is---that's why the user and home schemes come before. However, there are at least two known cases where the prefix scheme will be useful.
pt_br: O "esquema prefixo" é útil quando você deseja usar uma instalação Python para realizar a compilação/instalação (ou seja, para executar o script de configuração), mas instalar módulos no diretório de módulo de terceiros de uma instalação Python diferente (ou algo que parece uma instalação diferente do Python). Se isso parece um pouco incomum, então é -- é por isso que os esquemas usuário e home vêm antes. No entanto, existem pelo menos dois casos conhecidos em que o esquema prefixo será útil.

source: First, consider that many Linux distributions put Python in :file:`/usr`, rather than the more traditional :file:`/usr/local`. This is entirely appropriate, since in those cases Python is part of "the system" rather than a local add-on. However, if you are installing Python modules from source, you probably want them to go in :file:`/usr/local/lib/python2.{X}` rather than :file:`/usr/lib/python2.{X}`.
pt_br: Primeiro, considere que muitas distribuições Linux colocam Python em :file:`/usr`, ao invés do mais tradicional :file:`/usr/local`. Isso é totalmente apropriado, já que, nesses casos, o Python é parte do "sistema" em vez de um complemento local. No entanto, se você estiver instalando módulos Python a partir do código-fonte, provavelmente deseja que eles entrem em :file:`/usr/local/lib/python2.{X}` em vez de :file:`/usr/lib/python2.{X}`.

source: Another possibility is a network filesystem where the name used to write to a remote directory is different from the name used to read it: for example, the Python interpreter accessed as :file:`/usr/local/bin/python` might search for modules in :file:`/usr/local/lib/python2.{X}`, but those modules would have to be installed to, say, :file:`/mnt/{@server}/export/lib/python2.{X}`.
pt_br: Outra possibilidade é um sistema de arquivos de rede onde o nome usado para escrever em um diretório remoto é diferente do nome usado para lê-lo: por exemplo, o interpretador Python acessado como :file:`/usr/local/bin/python` pode pesquisar por módulos em :file:`/usr/local/lib/python2.{X}`, mas esses módulos teriam que ser instalados em, digamos, :file:`/mnt/{@server}/export/lib/python2.{X}`.

source: Installation path functions
pt_br: Funções de caminho de instalação

source: :mod:`sysconfig` provides some functions to determine these installation paths.
pt_br: :mod:`sysconfig` fornece algumas funções para determinar esses caminhos de instalação.

source: Return a tuple containing all schemes currently supported in :mod:`sysconfig`.
pt_br: Retorna uma tupla contendo todos os esquemas atualmente suportados em :mod:`sysconfig`.

source: Return the default scheme name for the current platform.
pt_br: Retorna o nome do esquema padrão para a plataforma atual.

source: This function was previously named ``_get_default_scheme()`` and considered an implementation detail.
pt_br: Esta função era chamada de ``_get_default_scheme()`` e considerada um detalhe de implementação.

source: When Python runs from a virtual environment, the *venv* scheme is returned.
pt_br: Quando o Python é executado em um ambiente virtual, o esquema *venv* é retornado.

source: Return a preferred scheme name for an installation layout specified by *key*.
pt_br: Retorna um nome de esquema preferido para um layout de instalação especificado por *key*.

source: *key* must be either ``"prefix"``, ``"home"``, or ``"user"``.
pt_br: *key* deve ser ``"prefix"``, ``"home"`` ou ``"user"``.

source: The return value is a scheme name listed in :func:`get_scheme_names`. It can be passed to :mod:`sysconfig` functions that take a *scheme* argument, such as :func:`get_paths`.
pt_br: O valor de retorno é um nome de esquema listado em :func:`get_scheme_names`. Ele pode ser passado para as funções :mod:`sysconfig` que recebem um argumento *scheme*, como :func:`get_paths`.

source: When Python runs from a virtual environment and ``key="prefix"``, the *venv* scheme is returned.
pt_br: Quando o Python é executado em um ambiente virtual e ``key="prefix"``, o esquema *venv* é retornado.

source: Return a dict containing preferred scheme names on the current platform. Python implementers and redistributors may add their preferred schemes to the ``_INSTALL_SCHEMES`` module-level global value, and modify this function to return those scheme names, to e.g. provide different schemes for system and language package managers to use, so packages installed by either do not mix with those by the other.
pt_br: Retorna um dict contendo nomes de esquema preferidos na plataforma atual. Os implementadores e redistribuidores do Python podem adicionar seus esquemas preferidos ao valor global de nível de módulo ``_INSTALL_SCHEMES`` e modificar esta função para retornar esses nomes de esquema. Por exemplo, fornecer esquemas diferentes para os gerenciadores de pacotes de sistema e idioma usarem, de modo que os pacotes instalados por um não se misturem com os do outro.

source: End users should not use this function, but :func:`get_default_scheme` and :func:`get_preferred_scheme` instead.
pt_br: Os usuários finais não devem usar esta função, mas :func:`get_default_scheme` e :func:`get_preferred_scheme`.

source: Return a tuple containing all path names currently supported in :mod:`sysconfig`.
pt_br: Retorna uma tupla contendo todos os nomes de caminhos atualmente suportados em :mod:`sysconfig`.

source: Return an installation path corresponding to the path *name*, from the install scheme named *scheme*.
pt_br: Retorna um caminho de instalação correspondente ao caminho *name*, do esquema de instalação denominado *scheme*.

source: *name* has to be a value from the list returned by :func:`get_path_names`.
pt_br: *name* deve ser um valor da lista retornada por :func:`get_path_names`.

source: :mod:`sysconfig` stores installation paths corresponding to each path name, for each platform, with variables to be expanded. For instance the *stdlib* path for the *nt* scheme is: ``{base}/Lib``.
pt_br: :mod:`sysconfig` armazena os caminhos de instalação correspondentes a cada nome de caminho, para cada plataforma, com variáveis a serem expandidas. Por exemplo, o caminho *stdlib* para o esquema *nt* é: ``{base}/Lib``.

source: :func:`get_path` will use the variables returned by :func:`get_config_vars` to expand the path. All variables have default values for each platform so one may call this function and get the default value.
pt_br: :func:`get_path` usará as variáveis retornadas por :func:`get_config_vars` para expandir o caminho. Todas as variáveis possuem valores padrão para cada plataforma, portanto, pode-se chamar esta função e obter o valor padrão.

source: If *scheme* is provided, it must be a value from the list returned by :func:`get_scheme_names`. Otherwise, the default scheme for the current platform is used.
pt_br: Se *scheme* for fornecido, deve ser um valor da lista retornada por :func:`get_scheme_names`. Caso contrário, o esquema padrão para a plataforma atual é usado.

source: If *vars* is provided, it must be a dictionary of variables that will update the dictionary returned by :func:`get_config_vars`.
pt_br: Se *vars* for fornecido, deve ser um dicionário de variáveis que atualizará o dicionário retornado por :func:`get_config_vars`.

source: If *expand* is set to ``False``, the path will not be expanded using the variables.
pt_br: Se *expand* for definido como ``False``, o caminho não será expandido usando as variáveis.

source: If *name* is not found, raise a :exc:`KeyError`.
pt_br: Se *name* não for encontrado, levanta uma :exc:`KeyError`.

source: Return a dictionary containing all installation paths corresponding to an installation scheme. See :func:`get_path` for more information.
pt_br: Retorna um dicionário contendo todos os caminhos de instalação correspondentes a um esquema de instalação. Veja :func:`get_path` para mais informações.

source: If *scheme* is not provided, will use the default scheme for the current platform.
pt_br: Se *esquema* não for fornecido, usará o esquema padrão para a plataforma atual.

source: If *vars* is provided, it must be a dictionary of variables that will update the dictionary used to expand the paths.
pt_br: Se *vars* for fornecido, deve ser um dicionário de variáveis que atualizará o dicionário usado para expandir os caminhos.

source: If *expand* is set to false, the paths will not be expanded.
pt_br: Se *expand* for definido como falso, os caminhos não serão expandidos.

source: If *scheme* is not an existing scheme, :func:`get_paths` will raise a :exc:`KeyError`.
pt_br: Se *scheme* não for um esquema existente, :func:`get_paths` vai levantar uma :exc:`KeyError`.

source: Other functions
pt_br: Outras funções

source: Return the ``MAJOR.MINOR`` Python version number as a string. Similar to ``'%d.%d' % sys.version_info[:2]``.
pt_br: Retorna o número da versão Python ``MAJOR.MINOR`` como uma string. Semelhante a ``'%d.%d' % sys.version_info[:2]``.

source: Return a string that identifies the current platform.
pt_br: Retorna uma string que identifica a plataforma atual.

source: This is used mainly to distinguish platform-specific build directories and platform-specific built distributions. Typically includes the OS name and version and the architecture (as supplied by :func:`os.uname`), although the exact information included depends on the OS; e.g., on Linux, the kernel version isn't particularly important.
pt_br: Isso é usado principalmente para distinguir diretórios de construção específicos da plataforma e distribuições construídas específicas da plataforma. Geralmente inclui o nome e a versão do sistema operacional e a arquitetura (conforme fornecido por :func:`os.uname`), embora as informações exatas incluídas dependam do sistema operacional; por exemplo, no Linux, a versão do kernel não é particularmente importante.

source: Examples of returned values:
pt_br: Exemplos de valores retornados:

source: Windows will return one of:
pt_br: Windows vai retornar um entre:

source: win-amd64 (64-bit Windows on AMD64, aka x86_64, Intel64, and EM64T)
pt_br: win-amd64 (Windows 64 bits no AMD64, isto é, x86_64, Intel64 e EM64T)

source: win-arm64 (64-bit Windows on ARM64, aka AArch64)
pt_br: win-arm64 (Windows 64 bits no ARM64, isto é, AArch64)

source: win32 (all others - specifically, sys.platform is returned)
pt_br: win32 (todos os demais - especificamente, sys.platform é retornado)

source: macOS can return:
pt_br: macOS pode retornar:

source: For other non-POSIX platforms, currently just returns :data:`sys.platform`.
pt_br: Para outras plataformas não POSIX, é retornado apenas :data:`sys.platform`.

source: Return ``True`` if the running Python interpreter was built from source and is being run from its built location, and not from a location resulting from e.g. running ``make install`` or installing via a binary installer.
pt_br: Retorna ``True`` se o interpretador Python em execução foi construído a partir do código-fonte e está sendo executado a partir de seu local de construção, e não de um local resultante de, por exemplo, executando ``make install`` ou instalando através de um instalador binário.

source: Parse a :file:`config.h`\-style file.
pt_br: Analisa um arquivo no estilo :file:`config.h`.

source: *fp* is a file-like object pointing to the :file:`config.h`\-like file.
pt_br: *fp* é um objeto arquivo ou similar apontando para o arquivo :file:`config.h` ou similar.

source: A dictionary containing name/value pairs is returned. If an optional dictionary is passed in as the second argument, it is used instead of a new dictionary, and updated with the values read in the file.
pt_br: Um dicionário contendo pares nome/valor é retornado. Se um dicionário opcional for passado como segundo argumento, ele será usado no lugar de um novo dicionário e atualizado com os valores lidos no arquivo.

source: Return the path of :file:`pyconfig.h`.
pt_br: Retorna o caminho do :file:`pyconfig.h`.

source: Return the path of :file:`Makefile`.
pt_br: Retorna o caminho do :file:`Makefile`.

source: Command-line usage
pt_br: Uso na linha de comando

source: You can use :mod:`sysconfig` as a script with Python's *-m* option:
pt_br: Você pode usar :mod:`sysconfig` como um script com a opção *-m* do Python:

source: This call will print in the standard output the information returned by :func:`get_platform`, :func:`get_python_version`, :func:`get_path` and :func:`get_config_vars`.
pt_br: Esta chamada imprimirá na saída padrão as informações retornadas por :func:`get_platform`, :func:`get_python_version`, :func:`get_path` e :func:`get_config_vars`.

source: configuration information
pt_br: informações de configuração
