Repository: python/python-docs-pt-br
Catalog: library/tabnanny.po
Languages: pt_br

source: :mod:`!tabnanny` --- Detection of ambiguous indentation
pt_br: :mod:`!tabnanny` --- Detecção de indentação ambígua

source: **Source code:** :source:`Lib/tabnanny.py`
pt_br: **Código-fonte:** :source:`Lib/tabnanny.py`

source: For the time being this module is intended to be called as a script. However it is possible to import it into an IDE and use the function :func:`check` described below.
pt_br: Por enquanto, este módulo deve ser chamado como um script. No entanto, é possível importá-lo para um IDE e usar a função :func:`check` descrita abaixo.

source: The API provided by this module is likely to change in future releases; such changes may not be backward compatible.
pt_br: A API fornecida por este módulo provavelmente mudará em versões futuras; essas mudanças podem não ser compatíveis com versões anteriores.

source: If *file_or_dir* is a directory and not a symbolic link, then recursively descend the directory tree named by *file_or_dir*, checking all :file:`.py` files along the way. If *file_or_dir* is an ordinary Python source file, it is checked for whitespace related problems. The diagnostic messages are written to standard output using the :func:`print` function.
pt_br: Se *file_or_dir* for um diretório e não um link simbólico, desce recursivamente a árvore de diretórios nomeada por *file_or_dir*, verificando todos os arquivos :file:`.py` ao longo do caminho. Se *file_or_dir* for um arquivo-fonte comum do Python, ele será verificado quanto a problemas relacionados ao espaço em branco. As mensagens de diagnóstico são gravadas na saída padrão usando a função :func:`print`.

source: Flag indicating whether to print verbose messages. This is incremented by the ``-v`` option if called as a script.
pt_br: Sinalizador indicando se as mensagens detalhadas devem ser impressas. Isso é incrementado pela opção ``-v`` se chamado como um script.

source: Flag indicating whether to print only the filenames of files containing whitespace related problems. This is set to true by the ``-q`` option if called as a script.
pt_br: Sinalizador indicando se os nomes dos arquivos devem ser impressos apenas com problemas relacionados a espaços em branco. Isso é definido como true pela opção ``-q`` se chamado como um script.

source: Raised by :func:`process_tokens` if detecting an ambiguous indent. Captured and handled in :func:`check`.
pt_br: Levantada por :func:`process_tokens` se detectar um recuo ambíguo. Capturado e manipulado em :func:`check`.

source: This function is used by :func:`check` to process tokens generated by the :mod:`tokenize` module.
pt_br: Esta função é usada por :func:`check` para processar os tokens gerados pelo módulo :mod:`tokenize`.

source: Module :mod:`tokenize`
pt_br: Módulo :mod:`tokenize`

source: Lexical scanner for Python source code.
pt_br: Scanner léxico para código-fonte Python.
