Repository: python/python-docs-pt-br
Catalog: library/telnetlib.po
Languages: pt_br

source: :mod:`telnetlib` --- Telnet client
pt_br: :mod:`telnetlib` --- клієнт Telnet

source: **Source code:** :source:`Lib/telnetlib.py`
pt_br: **Вихідний код:** :source:`Lib/telnetlib.py`

source: The :mod:`telnetlib` module is deprecated (see :pep:`PEP 594 <594#telnetlib>` for details and alternatives).
pt_br: Модуль :mod:`telnetlib` є застарілим (перегляньте :pep:`PEP 594 <594#telnetlib>` для деталей та альтернатив).

source: The :mod:`telnetlib` module provides a :class:`Telnet` class that implements the Telnet protocol. See :rfc:`854` for details about the protocol. In addition, it provides symbolic constants for the protocol characters (see below), and for the telnet options. The symbolic names of the telnet options follow the definitions in ``arpa/telnet.h``, with the leading ``TELOPT_`` removed. For symbolic names of options which are traditionally not included in ``arpa/telnet.h``, see the module source itself.
pt_br: Модуль :mod:`telnetlib` надає клас :class:`Telnet`, який реалізує протокол Telnet. Дивіться :rfc:`854`, щоб дізнатися більше про протокол. Крім того, він надає символічні константи для символів протоколу (див. нижче) і параметрів telnet. Символічні назви параметрів telnet відповідають визначенням у ``arpa/telnet.h``, з видаленим першим ``TELOPT_``. Щоб отримати символічні назви параметрів, які традиційно не входять до ``arpa/telnet.h``, дивіться сам вихідний код модуля.

source: The symbolic constants for the telnet commands are: IAC, DONT, DO, WONT, WILL, SE (Subnegotiation End), NOP (No Operation), DM (Data Mark), BRK (Break), IP (Interrupt process), AO (Abort output), AYT (Are You There), EC (Erase Character), EL (Erase Line), GA (Go Ahead), SB (Subnegotiation Begin).
pt_br: Символьними константами для команд telnet є: IAC, DONT, DO, WONT, WILL, SE (завершення підузгодження), NOP (без операції), DM (марка даних), BRK (перерва), IP (переривання процесу), AO ( Перервати виведення), AYT (Ви там), EC (Стерти символ), EL (Стерти рядок), GA (Продовжити), SB (Початок субузгодження).

source: :class:`Telnet` represents a connection to a Telnet server. The instance is initially not connected by default; the :meth:`~Telnet.open` method must be used to establish a connection. Alternatively, the host name and optional port number can be passed to the constructor too, in which case the connection to the server will be established before the constructor returns. The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used).
pt_br: :class:`Telnet` представляє підключення до сервера Telnet. Примірник спочатку не підключений за замовчуванням; метод :meth:`~Telnet.open` необхідно використовувати для встановлення з’єднання. Крім того, ім’я хоста та необов’язковий номер порту також можна передати конструктору, і в цьому випадку з’єднання з сервером буде встановлено до повернення конструктора. Необов’язковий параметр *timeout* визначає час очікування в секундах для блокування таких операцій, як спроба підключення (якщо не вказано, буде використано глобальне налаштування часу очікування за умовчанням).

source: Do not reopen an already connected instance.
pt_br: Не відкривайте повторно вже підключений екземпляр.

source: This class has many :meth:`read_\*` methods. Note that some of them raise :exc:`EOFError` when the end of the connection is read, because they can return an empty string for other reasons. See the individual descriptions below.
pt_br: Цей клас має багато методів :meth:`read_\*`. Зауважте, що деякі з них викликають :exc:`EOFError`, коли читається кінець з’єднання, оскільки вони можуть повертати порожній рядок з інших причин. Перегляньте окремі описи нижче.

source: A :class:`Telnet` object is a context manager and can be used in a :keyword:`with` statement. When the :keyword:`!with` block ends, the :meth:`close` method is called::
pt_br: Об’єкт :class:`Telnet` є менеджером контексту і може використовуватися в операторі :keyword:`with`. Коли блок :keyword:`!with` завершується, викликається метод :meth:`close`::

source: Context manager support added
pt_br: Додано підтримку менеджера контексту

source: :rfc:`854` - Telnet Protocol Specification
pt_br: :rfc:`854` - Специфікація протоколу Telnet

source: Definition of the Telnet protocol.
pt_br: Визначення протоколу Telnet.

source: Telnet Objects
pt_br: Об'єкти Telnet

source: :class:`Telnet` instances have the following methods:
pt_br: Екземпляри :class:`Telnet` мають такі методи:

source: Read until a given byte string, *expected*, is encountered or until *timeout* seconds have passed.
pt_br: Читати, доки не буде знайдено заданий рядок байтів, *очікуваний*, або доки не мине *тайм-аут* секунд.

source: When no match is found, return whatever is available instead, possibly empty bytes. Raise :exc:`EOFError` if the connection is closed and no cooked data is available.
pt_br: Якщо збігів не знайдено, поверніть усе, що є, натомість, можливо, порожні байти. Викликайте :exc:`EOFError`, якщо з’єднання закрито і немає готових даних.

source: Read all data until EOF as bytes; block until connection closed.
pt_br: Читати всі дані до EOF як байти; блокувати, доки з'єднання не буде закрито.

source: Read at least one byte of cooked data unless EOF is hit. Return ``b''`` if EOF is hit. Block if no data is immediately available.
pt_br: Зчитувати принаймні один байт готових даних, якщо EOF не влучено. Повертає ``b''``, якщо EOF досягнуто. Блокувати, якщо дані не доступні відразу.

source: Read everything that can be without blocking in I/O (eager).
pt_br: Читати все, що можна без блокування в I/O (охоче).

source: Raise :exc:`EOFError` if connection closed and no cooked data available. Return ``b''`` if no cooked data available otherwise. Do not block unless in the midst of an IAC sequence.
pt_br: Викликати :exc:`EOFError`, якщо з’єднання закрито і немає готових даних. Повертає ``b''``, якщо в іншому випадку готові дані недоступні. Не блокуйте, якщо це не в середині послідовності IAC.

source: Read readily available data.
pt_br: Прочитайте доступні дані.

source: Process and return data already in the queues (lazy).
pt_br: Обробляти та повертати дані вже в чергах (лінь).

source: Raise :exc:`EOFError` if connection closed and no data available. Return ``b''`` if no cooked data available otherwise. Do not block unless in the midst of an IAC sequence.
pt_br: Викликати :exc:`EOFError`, якщо з’єднання закрито і дані відсутні. Повертає ``b''``, якщо в іншому випадку готові дані недоступні. Не блокуйте, якщо це не в середині послідовності IAC.

source: Return any data available in the cooked queue (very lazy).
pt_br: Повернути будь-які дані, доступні в вареній черзі (дуже лінь).

source: Raise :exc:`EOFError` if connection closed and no data available. Return ``b''`` if no cooked data available otherwise. This method never blocks.
pt_br: Викликати :exc:`EOFError`, якщо з’єднання закрито і дані відсутні. Повертає ``b''``, якщо в іншому випадку готові дані недоступні. Цей метод ніколи не блокується.

source: Return the data collected between a SB/SE pair (suboption begin/end). The callback should access these data when it was invoked with a ``SE`` command. This method never blocks.
pt_br: Повертає дані, зібрані між парою SB/SE (підпараметр початок/кінець). Зворотний виклик має отримати доступ до цих даних, коли його було викликано командою ``SE``. Цей метод ніколи не блокується.

source: Connect to a host. The optional second argument is the port number, which defaults to the standard Telnet port (23). The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used).
pt_br: Підключіться до хосту. Необов’язковим другим аргументом є номер порту, який за замовчуванням є стандартним портом Telnet (23). Необов’язковий параметр *timeout* визначає час очікування в секундах для блокування таких операцій, як спроба підключення (якщо не вказано, буде використано глобальне налаштування часу очікування за умовчанням).

source: Do not try to reopen an already connected instance.
pt_br: Не намагайтеся повторно відкрити вже підключений екземпляр.

source: Raises an :ref:`auditing event <auditing>` ``telnetlib.Telnet.open`` with arguments ``self``, ``host``, ``port``.
pt_br: Викликає :ref:`подію аудиту <auditing>` ``telnetlib.Telnet.open`` з аргументами ``self``, ``host``, ``port``.

source: Print a debug message when the debug level is ``>`` 0. If extra arguments are present, they are substituted in the message using the standard string formatting operator.
pt_br: Друкувати повідомлення налагодження, коли рівень налагодження ``>`` 0. Якщо присутні додаткові аргументи, вони замінюються в повідомленні за допомогою стандартного оператора форматування рядка.

source: Set the debug level. The higher the value of *debuglevel*, the more debug output you get (on ``sys.stdout``).
pt_br: Встановіть рівень налагодження. Чим вище значення *debuglevel*, тим більше результатів налагодження ви отримаєте (на ``sys.stdout``).

source: Close the connection.
pt_br: Fecha a conexão.

source: Return the socket object used internally.
pt_br: Повернути об’єкт сокета, який використовується внутрішньо.

source: Return the file descriptor of the socket object used internally.
pt_br: Повертає дескриптор файлу об'єкта сокета, який використовується внутрішньо.

source: Write a byte string to the socket, doubling any IAC characters. This can block if the connection is blocked. May raise :exc:`OSError` if the connection is closed.
pt_br: Запишіть рядок байтів у сокет, подвоюючи будь-які символи IAC. Це може заблокувати, якщо з’єднання заблоковано. Може викликати :exc:`OSError`, якщо з’єднання закрито.

source: Raises an :ref:`auditing event <auditing>` ``telnetlib.Telnet.write`` with arguments ``self``, ``buffer``.
pt_br: Викликає :ref:`подію аудиту <auditing>` ``telnetlib.Telnet.write`` з аргументами ``self``, ``buffer``.

source: This method used to raise :exc:`socket.error`, which is now an alias of :exc:`OSError`.
pt_br: Цей метод використовувався для виклику :exc:`socket.error`, який тепер є псевдонімом :exc:`OSError`.

source: Interaction function, emulates a very dumb Telnet client.
pt_br: Функція взаємодії, емулює дуже дурний клієнт Telnet.

source: Multithreaded version of :meth:`interact`.
pt_br: Багатопотокова версія :meth:`interact`.

source: Read until one from a list of a regular expressions matches.
pt_br: Читайте, доки не знайдеться один зі списку регулярних виразів.

source: The first argument is a list of regular expressions, either compiled (:ref:`regex objects <re-objects>`) or uncompiled (byte strings). The optional second argument is a timeout, in seconds; the default is to block indefinitely.
pt_br: Перший аргумент — це список регулярних виразів, скомпільованих (:ref:`regex-об’єкти <re-objects>`) або нескомпільованих (байтові рядки). Необов’язковим другим аргументом є час очікування в секундах; за замовчуванням блокується на невизначений термін.

source: Return a tuple of three items: the index in the list of the first regular expression that matches; the match object returned; and the bytes read up till and including the match.
pt_br: Повертає кортеж із трьох елементів: індекс у списку першого регулярного виразу, який відповідає; повернутий об'єкт відповідності; і байти читаються до збігу включно.

source: If end of file is found and no bytes were read, raise :exc:`EOFError`. Otherwise, when nothing matches, return ``(-1, None, data)`` where *data* is the bytes received so far (may be empty bytes if a timeout happened).
pt_br: Якщо кінець файлу знайдено, а байти не було прочитано, підніміть :exc:`EOFError`. Інакше, якщо нічого не збігається, повертається ``(-1, None, data)``, де *data* — отримані на даний момент байти (можуть бути порожніми байтами, якщо стався тайм-аут).

source: If a regular expression ends with a greedy match (such as ``.*``) or if more than one expression can match the same input, the results are non-deterministic, and may depend on the I/O timing.
pt_br: Якщо регулярний вираз закінчується жадібним збігом (наприклад, ``.*``) або якщо кілька виразів можуть відповідати одному вводу, результати не є детермінованими та можуть залежати від часу введення-виведення.

source: Each time a telnet option is read on the input flow, this *callback* (if set) is called with the following parameters: callback(telnet socket, command (DO/DONT/WILL/WONT), option). No other action is done afterwards by telnetlib.
pt_br: Щоразу, коли параметр telnet зчитується у вхідному потоці, цей *callback* (якщо встановлено) викликається з такими параметрами: callback(telnet socket, command (DO/DONT/WILL/WONT), option). Після цього telnetlib не виконує жодних інших дій.

source: Telnet Example
pt_br: Приклад Telnet

source: A simple example illustrating typical use::
pt_br: Простий приклад, що ілюструє типове використання:
