Repository: python/python-docs-pt-br
Catalog: library/tempfile.po
Languages: pt_br

source: :func:`mkdtemp` now always returns an absolute path, even if *dir* is relative.
pt_br: :func:`mkdtemp` теперь всегда возвращает абсолютный путь, даже если *dir* является относительным.

source: Return the name of the directory used for temporary files. This defines the default value for the *dir* argument to all functions in this module.
pt_br: Повертає назву каталогу, який використовується для тимчасових файлів. Це визначає значення за умовчанням для аргументу *dir* для всіх функцій у цьому модулі.

source: Python searches a standard list of directories to find one which the calling user can create files in. The list is:
pt_br: Python шукає стандартний список каталогів, щоб знайти той, у якому користувач, що викликає, може створювати файли. Список такий:

source: The directory named by the :envvar:`TMPDIR` environment variable.
pt_br: Каталог, названий змінною середовища :envvar:`TMPDIR`.

source: The directory named by the :envvar:`TEMP` environment variable.
pt_br: Каталог, назва якого змінна середовища :envvar:`TEMP`.

source: The directory named by the :envvar:`TMP` environment variable.
pt_br: Каталог, названий змінною середовища :envvar:`TMP`.

source: A platform-specific location:
pt_br: Uma localização específica por plataforma:

source: On Windows, the directories :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP`, and :file:`\\TMP`, in that order.
pt_br: У Windows – каталоги :file:`C:\\TEMP`, :file:`C:\\TMP`, :file:`\\TEMP` і :file:`\\TMP` у такому порядку.

source: On all other platforms, the directories :file:`/tmp`, :file:`/var/tmp`, and :file:`/usr/tmp`, in that order.
pt_br: На всіх інших платформах каталоги :file:`/tmp`, :file:`/var/tmp` і :file:`/usr/tmp` у такому порядку.

source: As a last resort, the current working directory.
pt_br: В крайньому випадку, поточний робочий каталог.

source: The result of this search is cached, see the description of :data:`tempdir` below.
pt_br: Результат цього пошуку зберігається в кеші, див. опис :data:`tempdir` нижче.

source: Always returns a str. Previously it would return any :data:`tempdir` value regardless of type so long as it was not ``None``.
pt_br: Завжди повертає str. Раніше він повертав будь-яке значення :data:`tempdir` незалежно від типу, якщо воно не було ``None``.

source: Same as :func:`gettempdir` but the return value is in bytes.
pt_br: Те саме, що :func:`gettempdir`, але повертається значення в байтах.

source: Return the filename prefix used to create temporary files. This does not contain the directory component.
pt_br: Повертає префікс імені файлу, який використовується для створення тимчасових файлів. Це не містить компонент каталогу.

source: Same as :func:`gettempprefix` but the return value is in bytes.
pt_br: Те саме, що :func:`gettempprefix`, але повертається значення в байтах.

source: The module uses a global variable to store the name of the directory used for temporary files returned by :func:`gettempdir`. It can be set directly to override the selection process, but this is discouraged. All functions in this module take a *dir* argument which can be used to specify the directory. This is the recommended approach that does not surprise other unsuspecting code by changing global API behavior.
pt_br: Модуль використовує глобальну змінну для зберігання назви каталогу, що використовується для тимчасових файлів, які повертає :func:`gettempdir`. Його можна налаштувати безпосередньо для перевизначення процесу вибору, але це не рекомендується. Усі функції в цьому модулі приймають аргумент *dir*, який можна використовувати для визначення каталогу. Це рекомендований підхід, який не дивує інший нічого не підозрюючий код, змінюючи глобальну поведінку API.

source: When set to a value other than ``None``, this variable defines the default value for the *dir* argument to the functions defined in this module, including its type, bytes or str. It cannot be a :term:`path-like object`.
pt_br: Якщо встановлено значення, відмінне від ``None``, ця змінна визначає значення за замовчуванням для аргументу *dir* для функцій, визначених у цьому модулі, включаючи його тип, bytes або str. Це не може бути :term:`path-like object`.

source: If ``tempdir`` is ``None`` (the default) at any call to any of the above functions except :func:`gettempprefix` it is initialized following the algorithm described in :func:`gettempdir`.
pt_br: Якщо ``tempdir`` має значення ``None`` (за замовчуванням) під час будь-якого виклику будь-якої з наведених вище функцій, крім :func:`gettempprefix`, вона ініціалізується відповідно до алгоритму, описаного в :func:`gettempdir`.

source: Beware that if you set ``tempdir`` to a bytes value, there is a nasty side effect: The global default return type of :func:`mkstemp` and :func:`mkdtemp` changes to bytes when no explicit ``prefix``, ``suffix``, or ``dir`` arguments of type str are supplied. Please do not write code expecting or depending on this. This awkward behavior is maintained for compatibility with the historical implementation.
pt_br: Пам’ятайте, що якщо ви встановите ``tempdir`` у значення байтів, виникне неприємний побічний ефект: глобальний тип повернення за замовчуванням :func:`mkstemp` і :func:`mkdtemp` змінюється на байти, якщо немає явного ``prefix``, ``suffix`` або ``dir`` аргументи типу str. Будь ласка, не пишіть код, очікуючи або залежно від цього. Ця незручна поведінка зберігається для сумісності з історичною реалізацією.

source: Examples
pt_br: Exemplos

source: Here are some examples of typical usage of the :mod:`tempfile` module::
pt_br: Ось декілька прикладів типового використання модуля :mod:`tempfile`::

source: Deprecated functions and variables
pt_br: Застарілі функції та змінні

source: A historical way to create temporary files was to first generate a file name with the :func:`mktemp` function and then create a file using this name. Unfortunately this is not secure, because a different process may create a file with this name in the time between the call to :func:`mktemp` and the subsequent attempt to create the file by the first process. The solution is to combine the two steps and create the file immediately. This approach is used by :func:`mkstemp` and the other functions described above.
pt_br: Історичний спосіб створення тимчасових файлів полягав у тому, щоб спочатку створити ім’я файлу за допомогою функції :func:`mktemp`, а потім створити файл із цим ім’ям. На жаль, це небезпечно, оскільки інший процес може створити файл із таким ім’ям у час між викликом :func:`mktemp` і наступною спробою створити файл першим процесом. Рішення полягає в тому, щоб поєднати два кроки та негайно створити файл. Цей підхід використовується :func:`mkstemp` та іншими функціями, описаними вище.

source: Use :func:`mkstemp` instead.
pt_br: Use :func:`mkstemp`.

source: Return an absolute pathname of a file that did not exist at the time the call is made. The *prefix*, *suffix*, and *dir* arguments are similar to those of :func:`mkstemp`, except that bytes file names, ``suffix=None`` and ``prefix=None`` are not supported.
pt_br: Повертає абсолютний шлях до файлу, який не існував на момент виклику. Аргументи *prefix*, *suffix* і *dir* подібні до аргументів :func:`mkstemp`, за винятком того, що байтові імена файлів, ``suffix=None`` і ``prefix=None`` не підтримуються .

source: Use of this function may introduce a security hole in your program. By the time you get around to doing anything with the file name it returns, someone else may have beaten you to the punch. :func:`mktemp` usage can be replaced easily with :func:`NamedTemporaryFile`, passing it the ``delete=False`` parameter::
pt_br: Використання цієї функції може створити дірку в безпеці вашої програми. До того часу, коли ви встигнете щось зробити з іменем файлу, яке він повертає, хтось інший може обігнати вас. Використання :func:`mktemp` можна легко замінити на :func:`NamedTemporaryFile`, передавши йому параметр ``delete=False``::

source: temporary
pt_br: временный

source: file name
pt_br: ім'я файлу

source: file
pt_br: arquivo
