Repository: python/python-docs-pt-br
Catalog: library/tempfile.po
Languages: pt_br

source: :mod:`!tempfile` --- Generate temporary files and directories
pt_br: :mod:`!tempfile` --- Создавать временные файлы и каталоги

source: **Source code:** :source:`Lib/tempfile.py`
pt_br: **Código-fonte:** :source:`Lib/tempfile.py`

source: This module creates temporary files and directories. It works on all supported platforms. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory`, and :class:`SpooledTemporaryFile` are high-level interfaces which provide automatic cleanup and can be used as :term:`context managers <context manager>`. :func:`mkstemp` and :func:`mkdtemp` are lower-level functions which require manual cleanup.
pt_br: Этот модуль создает временные файлы и каталоги. Он работает на всех поддерживаемых платформах. :class:`TemporaryFile`, :class:`NamedTemporaryFile`, :class:`TemporaryDirectory` и :class:`SpooledTemporaryFile` — это интерфейсы высокого уровня, которые обеспечивают автоматическую очистку и могут использоваться как :term:`менеджеры контекста <context менеджер>`. :func:`mkstemp` и :func:`mkdtemp` — это функции нижнего уровня, требующие очистки вручную.

source: All the user-callable functions and constructors take additional arguments which allow direct control over the location and name of temporary files and directories. Files names used by this module include a string of random characters which allows those files to be securely created in shared temporary directories. To maintain backward compatibility, the argument order is somewhat odd; it is recommended to use keyword arguments for clarity.
pt_br: Усі функції та конструктори, що викликаються користувачем, приймають додаткові аргументи, які дозволяють безпосередньо контролювати розташування та назву тимчасових файлів і каталогів. Імена файлів, які використовує цей модуль, включають рядок випадкових символів, що дозволяє безпечно створювати ці файли в спільних тимчасових каталогах. Щоб зберегти зворотну сумісність, порядок аргументів дещо дивний; для ясності рекомендується використовувати ключові аргументи.

source: The module defines the following user-callable items:
pt_br: Модуль визначає наступні елементи, викликані користувачем:

source: Return a :term:`file-like object` that can be used as a temporary storage area. The file is created securely, using the same rules as :func:`mkstemp`. It will be destroyed as soon as it is closed (including an implicit close when the object is garbage collected). Under Unix, the directory entry for the file is either not created at all or is removed immediately after the file is created. Other platforms do not support this; your code should not rely on a temporary file created using this function having or not having a visible name in the file system.
pt_br: Повертає :term:`file-like object`, який можна використовувати як тимчасову область зберігання. Файл створюється безпечно за тими ж правилами, що й :func:`mkstemp`. Його буде знищено, як тільки його закриють (включно з неявним закриттям, коли об’єкт збирають сміття). В Unix запис каталогу для файлу або не створюється взагалі, або видаляється одразу після створення файлу. Інші платформи не підтримують це; ваш код не повинен покладатися на тимчасовий файл, створений за допомогою цієї функції, який має або не має видимого імені у файловій системі.

source: The resulting object can be used as a :term:`context manager` (see :ref:`tempfile-examples`). On completion of the context or destruction of the file object the temporary file will be removed from the filesystem.
pt_br: Полученный объект можно использовать в качестве контекстного менеджера (см. :ref:`tempfile-examples`). По завершении контекста или уничтожения файлового объекта временный файл будет удален из файловой системы.

source: The *mode* parameter defaults to ``'w+b'`` so that the file created can be read and written without being closed. Binary mode is used so that it behaves consistently on all platforms without regard for the data that is stored. *buffering*, *encoding*, *errors* and *newline* are interpreted as for :func:`open`.
pt_br: Параметр *mode* за умовчанням має значення ``'w+b'``, щоб створений файл можна було читати та записувати без закриття. Двійковий режим використовується для того, щоб він працював узгоджено на всіх платформах, незалежно від даних, які зберігаються. *буферизація*, *кодування*, *помилки* та *новий рядок* інтерпретуються як для :func:`open`.

source: The *dir*, *prefix* and *suffix* parameters have the same meaning and defaults as with :func:`mkstemp`.
pt_br: Параметри *dir*, *prefix* і *suffix* мають те саме значення та значення за замовчуванням, що й :func:`mkstemp`.

source: The returned object is a true file object on POSIX platforms. On other platforms, it is a file-like object whose :attr:`!file` attribute is the underlying true file object.
pt_br: Повернений об’єкт є справжнім файловим об’єктом на платформах POSIX. На інших платформах це файлоподібний об’єкт, чий атрибут :attr:`!file` є справжнім файловим об’єктом.

source: The :py:const:`os.O_TMPFILE` flag is used if it is available and works (Linux-specific, requires Linux kernel 3.11 or later).
pt_br: Флаг :py:const:`os.O_TMPFILE` используется, если он доступен и работает (зависит от Linux, требуется ядро ​​Linux 3.11 или новее).

source: On platforms that are neither Posix nor Cygwin, TemporaryFile is an alias for NamedTemporaryFile.
pt_br: На платформах, які не є ні Posix, ні Cygwin, TemporaryFile є псевдонімом для NamedTemporaryFile.

source: Raises an :ref:`auditing event <auditing>` ``tempfile.mkstemp`` with argument ``fullpath``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``tempfile.mkstemp`` com o argumento ``fullpath``.

source: The :py:const:`os.O_TMPFILE` flag is now used if available.
pt_br: Флаг :py:const:`os.O_TMPFILE` теперь используется, если он доступен.

source: Added *errors* parameter.
pt_br: Parâmetro *errors* foi adicionado.

source: This function operates exactly as :func:`TemporaryFile` does, except the following differences:
pt_br: Эта функция работает точно так же, как :func:`TemporaryFile`, за исключением следующих отличий:

source: This function returns a file that is guaranteed to have a visible name in the file system.
pt_br: Эта функция возвращает файл, который гарантированно имеет видимое имя в файловой системе.

source: To manage the named file, it extends the parameters of :func:`TemporaryFile` with *delete* and *delete_on_close* parameters that determine whether and how the named file should be automatically deleted.
pt_br: Для управления именованным файлом он расширяет параметры :func:`TemporaryFile` параметрами *delete* и *delete_on_close*, которые определяют, должен ли и каким образом указанный файл быть автоматически удален.

source: The returned object is always a :term:`file-like object` whose :attr:`!file` attribute is the underlying true file object. This file-like object can be used in a :keyword:`with` statement, just like a normal file. The name of the temporary file can be retrieved from the :attr:`!name` attribute of the returned file-like object. On Unix, unlike with the :func:`TemporaryFile`, the directory entry does not get unlinked immediately after the file creation.
pt_br: Возвращаемый объект всегда является объектом, подобным файлу, атрибут которого :attr:`!file` является базовым истинным файловым объектом. Этот файлоподобный объект можно использовать в операторе :keyword:`with`, как обычный файл. Имя временного файла можно получить из атрибута :attr:`!name` возвращаемого файлового объекта. В Unix, в отличие от :func:`TemporaryFile`, запись каталога не отключается сразу после создания файла.

source: If *delete* is true (the default) and *delete_on_close* is true (the default), the file is deleted as soon as it is closed. If *delete* is true and *delete_on_close* is false, the file is deleted on context manager exit only, or else when the :term:`file-like object` is finalized. Deletion is not always guaranteed in this case (see :meth:`object.__del__`). If *delete* is false, the value of *delete_on_close* is ignored.
pt_br: Если *delete* имеет значение true (по умолчанию) и *delete_on_close* имеет значение true (по умолчанию), файл удаляется, как только он закрывается. Если *delete* имеет значение true, а *delete_on_close* имеет значение false, файл удаляется только при выходе из контекстного менеджера или в противном случае, когда завершается :term:`файлоподобный объект`. В этом случае удаление не всегда гарантируется (см. :meth:`object.__del__`). Если *delete* имеет значение false, значение *delete_on_close* игнорируется.

source: Therefore to use the name of the temporary file to reopen the file after closing it, either make sure not to delete the file upon closure (set the *delete* parameter to be false) or, in case the temporary file is created in a :keyword:`with` statement, set the *delete_on_close* parameter to be false. The latter approach is recommended as it provides assistance in automatic cleaning of the temporary file upon the context manager exit.
pt_br: Поэтому, чтобы использовать имя временного файла для повторного открытия файла после его закрытия, либо убедитесь, что файл не удален при закрытии (установите для параметра *delete* значение false), либо, в случае, если временный файл создается в файле : ключевое слово:`with` установите для параметра *delete_on_close* значение false. Последний подход рекомендуется, поскольку он обеспечивает автоматическую очистку временного файла при выходе из контекстного менеджера.

source: Opening the temporary file again by its name while it is still open works as follows:
pt_br: Повторное открытие временного файла по его имени, пока он еще открыт, работает следующим образом:

source: On POSIX the file can always be opened again.
pt_br: В POSIX файл всегда можно открыть снова.

source: On Windows, make sure that at least one of the following conditions are fulfilled:
pt_br: В Windows убедитесь, что выполнено хотя бы одно из следующих условий:

source: additional open shares delete access (e.g. by calling :func:`os.open` with the flag ``O_TEMPORARY``)
pt_br: дополнительные открытые общие ресурсы удаляют доступ (например, путем вызова :func:`os.open` с флагом ``O_TEMPORARY``)

source: *delete* is true but *delete_on_close* is false. Note, that in this case the additional opens that do not share delete access (e.g. created via builtin :func:`open`) must be closed before exiting the context manager, else the :func:`os.unlink` call on context manager exit will fail with a :exc:`PermissionError`.
pt_br: *delete* — это правда, но *delete_on_close* — это ложь. Обратите внимание, что в этом случае дополнительные открытия, которые не имеют общего доступа к удалению (например, созданные с помощью встроенного :func:`open`), должны быть закрыты перед выходом из контекстного менеджера, в противном случае вызов :func:`os.unlink` в контекстном менеджере выход завершится неудачно с ошибкой :exc:`PermissionError`.

source: On Windows, if *delete_on_close* is false, and the file is created in a directory for which the user lacks delete access, then the :func:`os.unlink` call on exit of the context manager will fail with a :exc:`PermissionError`. This cannot happen when *delete_on_close* is true because delete access is requested by the open, which fails immediately if the requested access is not granted.
pt_br: В Windows, если *delete_on_close* имеет значение false и файл создан в каталоге, для которого у пользователя нет доступа к удалению, то вызов :func:`os.unlink` при выходе из контекстного менеджера завершится с ошибкой :exc: `Ошибка разрешения`. Этого не может произойти, если *delete_on_close* истинно, поскольку доступ на удаление запрашивается при открытии, которое немедленно завершается неудачно, если запрошенный доступ не предоставлен.

source: On POSIX (only), a process that is terminated abruptly with SIGKILL cannot automatically delete any NamedTemporaryFiles it created.
pt_br: Только в POSIX процесс, который внезапно завершается с помощью SIGKILL, не может автоматически удалить любые созданные им NamedTemporaryFiles.

source: Added *delete_on_close* parameter.
pt_br: Добавлен параметр *delete_on_close*.

source: This class operates exactly as :func:`TemporaryFile` does, except that data is spooled in memory until the file size exceeds *max_size*, or until the file's :func:`~io.IOBase.fileno` method is called, at which point the contents are written to disk and operation proceeds as with :func:`TemporaryFile`.
pt_br: Этот класс работает точно так же, как :func:`TemporaryFile`, за исключением того, что данные помещаются в память до тех пор, пока размер файла не превысит *max_size*, или пока не будет вызван метод :func:`~io.IOBase.fileno`, при котором В этот момент содержимое записывается на диск, и операция продолжается как с :func:`TemporaryFile`.

source: The resulting file has one additional method, :meth:`!rollover`, which causes the file to roll over to an on-disk file regardless of its size.
pt_br: Результирующий файл имеет один дополнительный метод :meth:`!rollover`, который заставляет файл перевернуться на файл на диске независимо от его размера.

source: The returned object is a file-like object whose :attr:`!_file` attribute is either an :class:`io.BytesIO` or :class:`io.TextIOWrapper` object (depending on whether binary or text *mode* was specified) or a true file object, depending on whether :meth:`rollover` has been called. This file-like object can be used in a :keyword:`with` statement, just like a normal file.
pt_br: Возвращаемый объект представляет собой файлоподобный объект, атрибут :attr:`!_file` которого является либо объектом :class:`io.BytesIO`, либо :class:`io.TextIOWrapper` (в зависимости от того, был ли задан двоичный или текстовый режим *mode*). указан) или настоящий файловый объект, в зависимости от того, был ли вызван :meth:`rollover`. Этот файлоподобный объект можно использовать в операторе :keyword:`with`, как обычный файл.

source: the truncate method now accepts a *size* argument.
pt_br: метод truncate теперь принимает аргумент *size*.

source: Fully implements the :class:`io.BufferedIOBase` and :class:`io.TextIOBase` abstract base classes (depending on whether binary or text *mode* was specified).
pt_br: Полностью реализует абстрактные базовые классы :class:`io.BufferedIOBase` и :class:`io.TextIOBase` (в зависимости от того, был ли указан двоичный или текстовый *режим*).

source: This class securely creates a temporary directory using the same rules as :func:`mkdtemp`. The resulting object can be used as a :term:`context manager` (see :ref:`tempfile-examples`). On completion of the context or destruction of the temporary directory object, the newly created temporary directory and all its contents are removed from the filesystem.
pt_br: Этот класс безопасно создает временный каталог, используя те же правила, что и :func:`mkdtemp`. Полученный объект можно использовать в качестве контекстного менеджера (см. :ref:`tempfile-examples`). По завершении контекста или уничтожения объекта временного каталога вновь созданный временный каталог и все его содержимое удаляются из файловой системы.

source: The directory name can be retrieved from the :attr:`!name` attribute of the returned object. When the returned object is used as a :term:`context manager`, the :attr:`!name` will be assigned to the target of the :keyword:`!as` clause in the :keyword:`with` statement, if there is one.
pt_br: Имя каталога можно получить из атрибута :attr:`!name` возвращаемого объекта. Когда возвращаемый объект используется в качестве :term:`контекстного менеджера`, :attr:`!name` будет присвоено цели предложения :keyword:`!as` в операторе :keyword:`with`, если он есть.

source: The directory can be explicitly cleaned up by calling the :meth:`!cleanup` method. If *ignore_cleanup_errors* is true, any unhandled exceptions during explicit or implicit cleanup (such as a :exc:`PermissionError` removing open files on Windows) will be ignored, and the remaining removable items deleted on a "best-effort" basis. Otherwise, errors will be raised in whatever context cleanup occurs (the :meth:`!cleanup` call, exiting the context manager, when the object is garbage-collected or during interpreter shutdown).
pt_br: Каталог можно очистить явно, вызвав метод :meth:`!cleanup`. Если *ignore_cleanup_errors* имеет значение true, любые необработанные исключения во время явной или неявной очистки (например, :exc:`PermissionError` при удалении открытых файлов в Windows) будут игнорироваться, а оставшиеся съемные элементы будут удалены в порядке "максимальных усилий". В противном случае при любой очистке контекста будут возникать ошибки (вызов :meth:`!cleanup`, выход из контекстного менеджера, когда объект удаляется сборщиком мусора или во время завершения работы интерпретатора).

source: The *delete* parameter can be used to disable cleanup of the directory tree upon exiting the context. While it may seem unusual for a context manager to disable the action taken when exiting the context, it can be useful during debugging or when you need your cleanup behavior to be conditional based on other logic.
pt_br: Параметр *delete* можно использовать для отключения очистки дерева каталогов при выходе из контекста. Хотя для менеджера контекста может показаться необычным отключение действия, выполняемого при выходе из контекста, это может быть полезно во время отладки или когда вам нужно, чтобы ваше поведение очистки было условным на основе другой логики.

source: Raises an :ref:`auditing event <auditing>` ``tempfile.mkdtemp`` with argument ``fullpath``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``tempfile.mkdtemp`` com o argumento ``fullpath``.

source: Added *ignore_cleanup_errors* parameter.
pt_br: Додано параметр *ignore_cleanup_errors*.

source: Added the *delete* parameter.
pt_br: Добавлен параметр *delete*.

source: Creates a temporary file in the most secure manner possible. There are no race conditions in the file's creation, assuming that the platform properly implements the :const:`os.O_EXCL` flag for :func:`os.open`. The file is readable and writable only by the creating user ID. If the platform uses permission bits to indicate whether a file is executable, the file is executable by no one. The file descriptor is not inherited by child processes.
pt_br: Створює тимчасовий файл у максимально безпечний спосіб. Під час створення файлу немає умов змагання, припускаючи, що платформа правильно реалізує прапор :const:`os.O_EXCL` для :func:`os.open`. Файл доступний для читання та запису лише ідентифікатором користувача, який його створив. Якщо платформа використовує біти дозволу, щоб вказати, чи є файл виконуваним, цей файл ніким не виконуваний. Файловий дескриптор не успадковується дочірніми процесами.

source: Unlike :func:`TemporaryFile`, the user of :func:`mkstemp` is responsible for deleting the temporary file when done with it.
pt_br: На відміну від :func:`TemporaryFile`, користувач :func:`mkstemp` несе відповідальність за видалення тимчасового файлу після завершення роботи з ним.

source: If *suffix* is not ``None``, the file name will end with that suffix, otherwise there will be no suffix. :func:`mkstemp` does not put a dot between the file name and the suffix; if you need one, put it at the beginning of *suffix*.
pt_br: Якщо *суфікс* не ``None``, назва файлу закінчуватиметься цим суфіксом, інакше суфікса не буде. :func:`mkstemp` не ставить крапку між назвою файлу та суфіксом; якщо він вам потрібен, поставте його на початку *суфікса*.

source: If *prefix* is not ``None``, the file name will begin with that prefix; otherwise, a default prefix is used. The default is the return value of :func:`gettempprefix` or :func:`gettempprefixb`, as appropriate.
pt_br: Якщо *префікс* не є ``None``, ім'я файлу починатиметься з цього префікса; інакше використовується префікс за умовчанням. За замовчуванням повертається значення :func:`gettempprefix` або :func:`gettempprefixb`, відповідно.

source: If *dir* is not ``None``, the file will be created in that directory; otherwise, a default directory is used. The default directory is chosen from a platform-dependent list, but the user of the application can control the directory location by setting the *TMPDIR*, *TEMP* or *TMP* environment variables. There is thus no guarantee that the generated filename will have any nice properties, such as not requiring quoting when passed to external commands via ``os.popen()``.
pt_br: Якщо *dir* не ``None``, файл буде створено в цьому каталозі; інакше використовується каталог за замовчуванням. Каталог за замовчуванням вибирається зі списку, що залежить від платформи, але користувач програми може керувати розташуванням каталогу, установивши змінні середовища *TMPDIR*, *TEMP* або *TMP*. Таким чином, немає жодної гарантії, що згенероване ім’я файлу матиме якісь приємні властивості, наприклад, не вимагатиме цитування під час передачі зовнішнім командам через ``os.popen()``.

source: If any of *suffix*, *prefix*, and *dir* are not ``None``, they must be the same type. If they are bytes, the returned name will be bytes instead of str. If you want to force a bytes return value with otherwise default behavior, pass ``suffix=b''``.
pt_br: Якщо будь-які з *суфікса*, *префікса* та *dir* не є ``None``, вони мають бути одного типу. Якщо це байти, повернена назва буде байтами замість str. Якщо ви хочете примусово повернути значення байтів із поведінкою за замовчуванням, передайте ``suffix=b''``.

source: If *text* is specified and true, the file is opened in text mode. Otherwise, (the default) the file is opened in binary mode.
pt_br: Якщо вказано *текст* і встановлено значення true, файл відкривається в текстовому режимі. В іншому випадку (за замовчуванням) файл відкривається у двійковому режимі.

source: :func:`mkstemp` returns a tuple containing an OS-level handle to an open file (as would be returned by :func:`os.open`) and the absolute pathname of that file, in that order.
pt_br: :func:`mkstemp` повертає кортеж, що містить дескриптор рівня ОС до відкритого файлу (як би повернув :func:`os.open`) і абсолютний шлях до цього файлу в такому порядку.

source: *suffix*, *prefix*, and *dir* may now be supplied in bytes in order to obtain a bytes return value. Prior to this, only str was allowed. *suffix* and *prefix* now accept and default to ``None`` to cause an appropriate default value to be used.
pt_br: *suffix*, *prefix* і *dir* тепер можна вказувати в байтах, щоб отримати значення, що повертається. До цього дозволявся лише str. *Суфікс* і *префікс* тепер приймаються та за замовчуванням ``None``, щоб використовувати відповідне значення за замовчуванням.

source: The *dir* parameter now accepts a :term:`path-like object`.
pt_br: Параметр *dir* тепер приймає :term:`path-like object`.

source: Creates a temporary directory in the most secure manner possible. There are no race conditions in the directory's creation. The directory is readable, writable, and searchable only by the creating user ID.
pt_br: Створює тимчасовий каталог у найбезпечніший спосіб. У створенні каталогу немає умов гонки. Каталог доступний для читання, запису та пошуку лише за ідентифікатором користувача, який створює.

source: The user of :func:`mkdtemp` is responsible for deleting the temporary directory and its contents when done with it.
pt_br: Користувач :func:`mkdtemp` несе відповідальність за видалення тимчасового каталогу та його вмісту після завершення роботи з ним.

source: The *prefix*, *suffix*, and *dir* arguments are the same as for :func:`mkstemp`.
pt_br: Аргументи *prefix*, *suffix* і *dir* такі самі, як і для :func:`mkstemp`.

source: :func:`mkdtemp` returns the absolute pathname of the new directory.
pt_br: :func:`mkdtemp` повертає абсолютний шлях до нового каталогу.
