Repository: python/python-docs-pt-br
Catalog: library/termios.po
Languages: pt_br

source: :mod:`!termios` --- POSIX style tty control
pt_br: :mod:`!termios` --- Controle de tty no estilo POSIX

source: This module provides an interface to the POSIX calls for tty I/O control. For a complete description of these calls, see :manpage:`termios(3)` Unix manual page. It is only available for those Unix versions that support POSIX *termios* style tty I/O control configured during installation.
pt_br: Este módulo fornece uma interface para as chamadas POSIX para controle de E/S do tty. Para uma descrição completa dessas chamadas, consulte a página de manual Unix :manpage:`termios(3)`. Está disponível apenas para as versões Unix que tenham suporte ao controle de E/S de tty no estilo POSIX do *termios* configurado durante a instalação.

source: Availability
pt_br: Disponibilidade

source: All functions in this module take a file descriptor *fd* as their first argument. This can be an integer file descriptor, such as returned by ``sys.stdin.fileno()``, or a :term:`file object`, such as ``sys.stdin`` itself.
pt_br: Todas as funções neste módulo usam um descritor de arquivo *fd* como seu primeiro argumento. Pode ser um descritor de arquivo de tipo inteiro, como retornado por ``sys.stdin.fileno()``, ou um :term:`objeto arquivo <file object>`, como o próprio ``sys.stdin``.

source: This module also defines all the constants needed to work with the functions provided here; these have the same name as their counterparts in C. Please refer to your system documentation for more information on using these terminal control interfaces.
pt_br: Este módulo também define todas as constantes necessárias para trabalhar com as funções fornecidas aqui; estes têm o mesmo nome de seus equivalentes em C. Consulte a documentação do sistema para mais informações sobre o uso dessas interfaces de controle de terminal.

source: The module defines the following functions:
pt_br: O módulo define as seguintes funções:

source: Return a list containing the tty attributes for file descriptor *fd*, as follows: ``[iflag, oflag, cflag, lflag, ispeed, ospeed, cc]`` where *cc* is a list of the tty special characters (each a string of length 1, except the items with indices :const:`VMIN` and :const:`VTIME`, which are integers when these fields are defined). The interpretation of the flags and the speeds as well as the indexing in the *cc* array must be done using the symbolic constants defined in the :mod:`termios` module.
pt_br: Retorna uma lista contendo os atributos tty para o descritor de arquivo *fd*, da seguinte forma: ``[iflag, oflag, cflag, lflag, ispeed, ospeed, cc]`` onde *cc* é uma lista dos caracteres especiais do tty (cada uma string de comprimento 1, exceto os itens com índices :const:`VMIN` e :const:`VTIME`, que são números inteiros quando esses campos são definidos). A interpretação dos sinalizadores e as velocidades, bem como a indexação no vetor *cc*, devem ser feitas usando as constantes simbólicas definidas no módulo :mod:`termios`.

source: Set the tty attributes for file descriptor *fd* from the *attributes*, which is a list like the one returned by :func:`tcgetattr`. The *when* argument determines when the attributes are changed:
pt_br: Define os atributos do tty para descritor de arquivo *fd* a partir de *attributes*, que é uma lista como a retornada por :func:`tcgetattr`. O argumento *when* determina quando os atributos são alterados:

source: Change attributes immediately.
pt_br: Altera os atributos imediatamente.

source: Change attributes after transmitting all queued output.
pt_br: Altera os atributos depois de transmitir todas as saídas enfileiradas.

source: Change attributes after transmitting all queued output and discarding all queued input.
pt_br: Altera os atributos depois de transmitir todas as saídas enfileiradas e descartar todas as entradas enfileiradas.

source: Send a break on file descriptor *fd*. A zero *duration* sends a break for 0.25--0.5 seconds; a nonzero *duration* has a system dependent meaning.
pt_br: Envia uma quebra no descritor de arquivo *fd*. Uma duração zero, representada por *duration*, envia uma pausa por 0,25 a 0,5 segundos; *duration* com valor diferente de zero tem um significado dependente do sistema.

source: Wait until all output written to file descriptor *fd* has been transmitted.
pt_br: Aguarda até que toda a saída escrita no descritor de arquivo *fd* seja transmitida.

source: Discard queued data on file descriptor *fd*. The *queue* selector specifies which queue: :const:`TCIFLUSH` for the input queue, :const:`TCOFLUSH` for the output queue, or :const:`TCIOFLUSH` for both queues.
pt_br: Descarta dados na fila no descritor de arquivo *fd*. O seletor *queue* especifica qual fila: :const:`TCIFLUSH` para a fila de entrada, :const:`TCOFLUSH` para a fila de saída ou :const:`TCIOFLUSH` para as duas filas.

source: Suspend or resume input or output on file descriptor *fd*. The *action* argument can be :const:`TCOOFF` to suspend output, :const:`TCOON` to restart output, :const:`TCIOFF` to suspend input, or :const:`TCION` to restart input.
pt_br: Suspende ou retoma a entrada ou saída no descritor de arquivo *fd*. O argumento *action* pode ser :const:`TCOOFF` para suspender a saída, :const:`TCOON` para reiniciar a saída, :const:`TCIOFF` para suspender a entrada ou :const:`TCION` para reiniciar a entrada.

source: Return a tuple ``(ws_row, ws_col)`` containing the tty window size for file descriptor *fd*. Requires :const:`termios.TIOCGWINSZ` or :const:`termios.TIOCGSIZE`.
pt_br: Retorna uma tupla ``(ws_row, ws_col)`` contendo o tamanho da janela de terminal para o descritor de arquivo *fd*. Requer :const:`termios.TIOCGWINSZ` ou :const:`termios.TIOCGSIZE`.

source: Set the tty window size for file descriptor *fd* from *winsize*, which is a two-item tuple ``(ws_row, ws_col)`` like the one returned by :func:`tcgetwinsize`. Requires at least one of the pairs (:const:`termios.TIOCGWINSZ`, :const:`termios.TIOCSWINSZ`); (:const:`termios.TIOCGSIZE`, :const:`termios.TIOCSSIZE`) to be defined.
pt_br: Define o tamanho da janela de terminal para o descritor de arquivo *fd* de *winsize*, que é uma tupla de dois elementos ``(ws_row, ws_col)`` como a retornada por :func:`tcgetwinsize`. Requer pelo menos um dos pares (:const:`termios.TIOCGWINSZ`, :const:`termios.TIOCSWINSZ`); (:const:`termios.TIOCGSIZE`, :const:`termios.TIOCSSIZE`) a ser definido.

source: Module :mod:`tty`
pt_br: Módulo :mod:`tty`

source: Convenience functions for common terminal control operations.
pt_br: Funções de conveniência para operações comuns de controle de terminal.

source: Example
pt_br: Exemplo

source: Here's a function that prompts for a password with echoing turned off. Note the technique using a separate :func:`tcgetattr` call and a :keyword:`try` ... :keyword:`finally` statement to ensure that the old tty attributes are restored exactly no matter what happens::
pt_br: Aqui está uma função que solicita uma senha com o eco desativado. Observe a técnica usando uma chamada separada :func:`tcgetattr` e uma instrução :keyword:`try` ... :keyword:`finally` para garantir que os atributos tty antigos sejam restaurados exatamente, aconteça o que acontecer::

source: def getpass(prompt="Password: "): import termios, sys fd = sys.stdin.fileno() old = termios.tcgetattr(fd) new = termios.tcgetattr(fd) new[3] = new[3] & ~termios.ECHO # lflags try: termios.tcsetattr(fd, termios.TCSADRAIN, new) passwd = input(prompt) finally: termios.tcsetattr(fd, termios.TCSADRAIN, old) return passwd
pt_br: def getpass(prompt="Senha: "): import termios, sys fd = sys.stdin.fileno() old = termios.tcgetattr(fd) new = termios.tcgetattr(fd) new[3] = new[3] & ~termios.ECHO # lflags try: termios.tcsetattr(fd, termios.TCSADRAIN, new) passwd = input(prompt) finally: termios.tcsetattr(fd, termios.TCSADRAIN, old) return passwd

source: I/O control
pt_br: controle de E/S
