Repository: python/python-docs-pt-br
Catalog: library/test.po
Languages: pt_br

source: Save the signal handlers to a dictionary mapping signal numbers to the current signal handler.
pt_br: Збережіть обробники сигналів у словнику, зіставляючи номери сигналів із поточним обробником сигналів.

source: Set the signal numbers from the :meth:`save` dictionary to the saved handler.
pt_br: Установіть номери сигналів зі словника :meth:`save` для збереженого обробника.

source: Try to match a single dict with the supplied arguments.
pt_br: Tenta corresponder um único dicionário com os argumentos fornecidos.

source: Try to match a single stored value (*dv*) with a supplied value (*v*).
pt_br: Tente combinar um único valor armazenado (*dv*) com um valor fornecido (*v*).

source: :mod:`test.support.socket_helper` --- Utilities for socket tests
pt_br: :mod:`test.support.socket_helper` --- Утиліти для тестування сокетів

source: The :mod:`test.support.socket_helper` module provides support for socket tests.
pt_br: Модуль :mod:`test.support.socket_helper` забезпечує підтримку тестів сокетів.

source: Set to ``True`` if IPv6 is enabled on this host, ``False`` otherwise.
pt_br: Встановіть ``True``, якщо IPv6 увімкнено на цьому хості, ``False`` інакше.

source: Returns an unused port that should be suitable for binding. This is achieved by creating a temporary socket with the same family and type as the ``sock`` parameter (default is :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`), and binding it to the specified host address (defaults to ``0.0.0.0``) with the port set to 0, eliciting an unused ephemeral port from the OS. The temporary socket is then closed and deleted, and the ephemeral port is returned.
pt_br: Повертає невикористаний порт, який має бути придатним для зв’язування. Це досягається шляхом створення тимчасового сокета з тим самим сімейством і типом, що й параметр ``sock`` (за замовчуванням: :const:`~socket.AF_INET`, :const:`~socket.SOCK_STREAM`), і прив’язування його до указана адреса хоста (за замовчуванням ``0.0.0.0``) з портом, встановленим на 0, виявляючи невикористаний тимчасовий порт з ОС. Потім тимчасовий сокет закривається та видаляється, а тимчасовий порт повертається.

source: Either this method or :func:`bind_port` should be used for any tests where a server socket needs to be bound to a particular port for the duration of the test. Which one to use depends on whether the calling code is creating a Python socket, or if an unused port needs to be provided in a constructor or passed to an external program (i.e. the ``-accept`` argument to openssl's s_server mode). Always prefer :func:`bind_port` over :func:`find_unused_port` where possible. Using a hard coded port is discouraged since it can make multiple instances of the test impossible to run simultaneously, which is a problem for buildbots.
pt_br: Або цей метод, або :func:`bind_port` слід використовувати для будь-яких тестів, де серверний сокет потрібно прив’язати до певного порту на час тесту. Який з них використовувати залежить від того, чи код виклику створює сокет Python, чи потрібно надати невикористаний порт у конструкторі чи передати зовнішній програмі (тобто аргумент ``-accept`` для режиму s_server openssl). Завжди віддавайте перевагу :func:`bind_port` над :func:`find_unused_port`, де це можливо. Не рекомендується використовувати жорстко закодований порт, оскільки це може зробити неможливим одночасний запуск кількох екземплярів тесту, що є проблемою для buildbots.

source: Bind the socket to a free port and return the port number. Relies on ephemeral ports in order to ensure we are using an unbound port. This is important as many tests may be running simultaneously, especially in a buildbot environment. This method raises an exception if the ``sock.family`` is :const:`~socket.AF_INET` and ``sock.type`` is :const:`~socket.SOCK_STREAM`, and the socket has :const:`~socket.SO_REUSEADDR` or :const:`~socket.SO_REUSEPORT` set on it. Tests should never set these socket options for TCP/IP sockets. The only case for setting these options is testing multicasting via multiple UDP sockets.
pt_br: Прив’яжіть сокет до вільного порту та поверніть номер порту. Покладається на тимчасові порти, щоб переконатися, що ми використовуємо незв’язаний порт. Це важливо, оскільки багато тестів можуть виконуватися одночасно, особливо в середовищі buildbot. Цей метод викликає виняток, якщо ``sock.family`` має значення :const:`~socket.AF_INET` і ``sock.type`` має значення :const:`~socket.SOCK_STREAM`, і сокет має На ньому встановлено :const:`~socket.SO_REUSEADDR` або :const:`~socket.SO_REUSEPORT`. Тести ніколи не повинні встановлювати ці параметри сокетів для сокетів TCP/IP. Єдиним випадком встановлення цих параметрів є тестування багатоадресної розсилки через кілька сокетів UDP.

source: Additionally, if the :const:`~socket.SO_EXCLUSIVEADDRUSE` socket option is available (i.e. on Windows), it will be set on the socket. This will prevent anyone else from binding to our host/port for the duration of the test.
pt_br: Крім того, якщо опція сокета :const:`~socket.SO_EXCLUSIVEADDRUSE` доступна (тобто у Windows), вона буде встановлена на сокеті. Це не дозволить будь-кому іншому підключитися до нашого хосту/порту на час тестування.

source: Bind a Unix socket, raising :exc:`unittest.SkipTest` if :exc:`PermissionError` is raised.
pt_br: Привяжите сокет Unix, вызывая :exc:`unittest.SkipTest`, если :exc:`PermissionError` поднят.

source: A decorator for running tests that require a functional ``bind()`` for Unix sockets.
pt_br: Декоратор для запуску тестів, які потребують функціонального ``bind()`` для сокетів Unix.

source: A context manager that raises :exc:`~test.support.ResourceDenied` when various issues with the internet connection manifest themselves as exceptions.
pt_br: Контекстний менеджер, який викликає :exc:`~test.support.ResourceDenied`, коли різні проблеми з підключенням до Інтернету проявляються як винятки.

source: :mod:`test.support.script_helper` --- Utilities for the Python execution tests
pt_br: :mod:`test.support.script_helper` --- Утиліти для тестів виконання Python

source: The :mod:`test.support.script_helper` module provides support for Python's script execution tests.
pt_br: Модуль :mod:`test.support.script_helper` забезпечує підтримку тестів виконання сценаріїв Python.

source: Return ``True`` if ``sys.executable interpreter`` requires environment variables in order to be able to run at all.
pt_br: Повертає ``True``, якщо ``sys.executable інтерпретатор`` вимагає змінних середовища, щоб взагалі мати можливість працювати.

source: This is designed to be used with ``@unittest.skipIf()`` to annotate tests that need to use an ``assert_python*()`` function to launch an isolated mode (``-I``) or no environment mode (``-E``) sub-interpreter process.
pt_br: Це призначено для використання з ``@unittest.skipIf()`` для анотування тестів, які потребують використання функції ``assert_python*()`` для запуску ізольованого режиму (``-I``) або без середовища процес підінтерпретатора режиму (``-E``).

source: A normal build & test does not run into this situation but it can happen when trying to run the standard library test suite from an interpreter that doesn't have an obvious home with Python's current home finding logic.
pt_br: Звичайна збірка та тестування не стикаються з такою ситуацією, але це може трапитися під час спроби запустити набір тестів стандартної бібліотеки з інтерпретатора, який не має очевидної початкової точки з поточною логікою пошуку початкової точки Python.

source: Setting :envvar:`PYTHONHOME` is one way to get most of the testsuite to run in that situation. :envvar:`PYTHONPATH` or :envvar:`PYTHONUSERSITE` are other common environment variables that might impact whether or not the interpreter can start.
pt_br: Налаштування :envvar:`PYTHONHOME` є одним із способів запустити більшу частину набору тестів у цій ситуації. :envvar:`PYTHONPATH` або :envvar:`PYTHONUSERSITE` — це інші загальні змінні середовища, які можуть впливати на те, чи може запускатися інтерпретатор.

source: Set up the environment based on *env_vars* for running the interpreter in a subprocess. The values can include ``__isolated``, ``__cleanenv``, ``__cwd``, and ``TERM``.
pt_br: Налаштуйте середовище на основі *env_vars* для запуску інтерпретатора в підпроцесі. Значення можуть включати ``__isolated``, ``__cleanenv``, ``__cwd`` і ``TERM``.

source: The function no longer strips whitespaces from *stderr*.
pt_br: Ця функція більше не видаляє пробіли з *stderr*.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* succeeds (``rc == 0``) and return a ``(return code, stdout, stderr)`` tuple.
pt_br: Стверджуйте, що запуск інтерпретатора з *args* і необов’язковими змінними середовища *env_vars* успішний (``rc == 0``) і повертає кортеж ``(код повернення, stdout, stderr)``.

source: If the *__cleanenv* keyword-only parameter is set, *env_vars* is used as a fresh environment.
pt_br: Якщо встановлено параметр лише для ключового слова *__cleanenv*, *env_vars* використовується як нове середовище.

source: Python is started in isolated mode (command line option ``-I``), except if the *__isolated* keyword-only parameter is set to ``False``.
pt_br: Python запускається в ізольованому режимі (параметр командного рядка ``-I``), за винятком випадків, коли для параметра *__isolated* тільки ключове слово встановлено значення ``False``.

source: Assert that running the interpreter with *args* and optional environment variables *env_vars* fails (``rc != 0``) and return a ``(return code, stdout, stderr)`` tuple.
pt_br: Стверджуйте, що запуск інтерпретатора з *args* і необов’язковими змінними середовища *env_vars* не вдається (``rc != 0``), і повертайте кортеж ``(код повернення, stdout, stderr)``.

source: See :func:`assert_python_ok` for more options.
pt_br: Перегляньте :func:`assert_python_ok` для отримання додаткових параметрів.

source: Run a Python subprocess with the given arguments.
pt_br: Запустіть підпроцес Python із заданими аргументами.

source: *kw* is extra keyword args to pass to :func:`subprocess.Popen`. Returns a :class:`subprocess.Popen` object.
pt_br: *kw* — додаткові аргументи ключового слова, які потрібно передати в :func:`subprocess.Popen`. Повертає об’єкт :class:`subprocess.Popen`.

source: Run the given :class:`subprocess.Popen` process until completion and return stdout.
pt_br: Запустіть заданий процес :class:`subprocess.Popen` до завершення та поверніть stdout.

source: Create script containing *source* in path *script_dir* and *script_basename*. If *omit_suffix* is ``False``, append ``.py`` to the name. Return the full script path.
pt_br: Cria um script contendo *source* no caminho *script_dir* e *script_basename*. Se *omit_suffix* ``False``, acrescente ``.py`` ao nome. Retorna o caminho completo do script.

source: Create zip file at *zip_dir* and *zip_basename* with extension ``zip`` which contains the files in *script_name*. *name_in_zip* is the archive name. Return a tuple containing ``(full path, full path of archive name)``.
pt_br: Cria um arquivo zip em *zip_dir* e *zip_basename* com a extensão ``zip`` que contém os arquivos em *script_name*. *name_in_zip* é o nome do arquivo. Retorna uma tupla contendo ``(full path, full path of archive name)``.

source: Create a directory named *pkg_dir* containing an ``__init__`` file with *init_source* as its contents.
pt_br: Cria um diretório nomeado *pkg_dir* contendo um arquivo ``__init__`` com *init_source* como seus conteúdos.

source: Create a zip package directory with a path of *zip_dir* and *zip_basename* containing an empty ``__init__`` file and a file *script_basename* containing the *source*. If *compiled* is ``True``, both source files will be compiled and added to the zip package. Return a tuple of the full zip path and the archive name for the zip file.
pt_br: Створіть каталог пакетів zip із шляхом *zip_dir* і *zip_basename*, що містить порожній файл ``__init__`` і файл *script_basename*, що містить *джерело*. Якщо *compiled* має значення ``True``, обидва вихідні файли буде скомпільовано та додано до пакета zip. Повертає кортеж повного шляху до архіву та ім’я архіву для файлу.

source: :mod:`test.support.bytecode_helper` --- Support tools for testing correct bytecode generation
pt_br: :mod:`test.support.bytecode_helper` --- Ferramentas de suporte para testar a geração correta de bytecode

source: The :mod:`test.support.bytecode_helper` module provides support for testing and inspecting bytecode generation.
pt_br: Модуль :mod:`test.support.bytecode_helper` забезпечує підтримку для тестування та перевірки генерації байт-коду.

source: The module defines the following class:
pt_br: O módulo define a seguinte classe:

source: This class has custom assertion methods for inspecting bytecode.
pt_br: У цьому класі є власні методи твердження для перевірки байт-коду.

source: Return the disassembly of *co* as string.
pt_br: Повернути розбирання *co* як рядок.

source: Return instr if *opname* is found, otherwise throws :exc:`AssertionError`.
pt_br: Повертає instr, якщо *opname* знайдено, інакше видає :exc:`AssertionError`.

source: Throws :exc:`AssertionError` if *opname* is found.
pt_br: Видає :exc:`AssertionError`, якщо знайдено *opname*.

source: :mod:`test.support.threading_helper` --- Utilities for threading tests
pt_br: :mod:`test.support.threading_helper` --- Утиліти для потокових тестів

source: The :mod:`test.support.threading_helper` module provides support for threading tests.
pt_br: Модуль :mod:`test.support.threading_helper` забезпечує підтримку потокових тестів.

source: Join a *thread* within *timeout*. Raise an :exc:`AssertionError` if thread is still alive after *timeout* seconds.
pt_br: Приєднайтеся до *ланцюжка* протягом *часу очікування*. Викликати :exc:`AssertionError`, якщо потік все ще активний після *часу очікування* секунд.

source: Decorator to ensure the threads are cleaned up even if the test fails.
pt_br: Декоратор, щоб переконатися, що нитки очищені, навіть якщо тест провалиться.

source: Context manager to start *threads*, which is a sequence of threads. *unlock* is a function called after the threads are started, even if an exception was raised; an example would be :meth:`threading.Event.set`. ``start_threads`` will attempt to join the started threads upon exit.
pt_br: Менеджер контексту для запуску *потоків*, який є послідовністю потоків. *unlock* — це функція, яка викликається після запуску потоків, навіть якщо було викликано виняткову ситуацію; прикладом може бути :meth:`threading.Event.set`. ``start_threads`` спробує приєднатися до розпочатих потоків після виходу.

source: Cleanup up threads not specified in *original_values*. Designed to emit a warning if a test leaves running threads in the background.
pt_br: Очистити потоки, не вказані в *original_values*. Призначений для видачі попередження, якщо тест залишає запущені потоки у фоновому режимі.

source: Return current thread count and copy of dangling threads.
pt_br: Повертає поточну кількість потоків і копію завислих потоків.

source: Context manager to wait until all threads created in the ``with`` statement exit.
pt_br: Менеджер контексту для очікування завершення роботи всіх потоків, створених у операторі ``with``.

source: Context manager catching :class:`threading.Thread` exception using :func:`threading.excepthook`.
pt_br: Менеджер контексту перехоплює виняток :class:`threading.Thread` за допомогою :func:`threading.excepthook`.

source: Attributes set when an exception is caught:
pt_br: Атрибути, які встановлюються, коли виявляється виняток:

source: See :func:`threading.excepthook` documentation.
pt_br: Перегляньте документацію :func:`threading.excepthook`.

source: These attributes are deleted at the context manager exit.
pt_br: Ці атрибути видаляються при виході з контекстного менеджера.

source: :mod:`test.support.os_helper` --- Utilities for os tests
pt_br: :mod:`test.support.os_helper` --- Утиліти для тестування ОС

source: The :mod:`test.support.os_helper` module provides support for os tests.
pt_br: Модуль :mod:`test.support.os_helper` забезпечує підтримку тестів ОС.

source: A non-ASCII character encodable by :func:`os.fsencode`.
pt_br: Символ не-ASCII, який можна кодувати за допомогою :func:`os.fsencode`.

source: Set to :func:`os.getcwd`.
pt_br: Установіть значення :func:`os.getcwd`.

source: Set to a name that is safe to use as the name of a temporary file. Any temporary file that is created should be closed and unlinked (removed).
pt_br: Встановіть назву, яку можна безпечно використовувати як назву тимчасового файлу. Будь-який створений тимчасовий файл має бути закритий і від’єднаний (видалений).

source: Set to a filename containing the :data:`FS_NONASCII` character, if it exists. This guarantees that if the filename exists, it can be encoded and decoded with the default filesystem encoding. This allows tests that require a non-ASCII filename to be easily skipped on platforms where they can't work.
pt_br: Встановіть назву файлу, яка містить символ :data:`FS_NONASCII`, якщо він існує. Це гарантує, що якщо ім’я файлу існує, його можна закодувати та декодувати за допомогою стандартного кодування файлової системи. Це дозволяє легко пропускати тести, які вимагають імені файлу, відмінного від ASCII, на платформах, де вони не можуть працювати.

source: Set to a filename (str type) that should not be able to be encoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
pt_br: Define o nome de arquivo (tipo str) que não pode ser codificado pela codificação do sistema de arquivos no modo estrito. Ele pode ser ``None`` se não for possível gerar como um nome de arquivo.

source: Set to a filename (bytes type) that should not be able to be decoded by file system encoding in strict mode. It may be ``None`` if it's not possible to generate such a filename.
pt_br: Define o nome de arquivo (tipo str) que não pode ser codificado pela codificação do sistema de arquivos no modo estrito. Ele pode ser ``None`` se não for possível ser gerado com um nome de arquivo.

source: Set to a non-ASCII name for a temporary file.
pt_br: Define um nome não-ASCII para o arquivo temporário.

source: Class used to temporarily set or unset environment variables. Instances can be used as a context manager and have a complete dictionary interface for querying/modifying the underlying ``os.environ``. After exit from the context manager all changes to environment variables done through this instance will be rolled back.
pt_br: Клас, який використовується для тимчасового встановлення або вимкнення змінних середовища. Екземпляри можна використовувати як контекстний менеджер і мати повний інтерфейс словника для запитів/модифікації основного ``os.environ``. Після виходу з диспетчера контексту всі зміни змінних середовища, внесені через цей екземпляр, буде відкочено.

source: Added dictionary interface.
pt_br: Adicionada uma interface para dicionário.

source: Simple :term:`path-like object`. It implements the :meth:`~os.PathLike.__fspath__` method which just returns the *path* argument. If *path* is an exception, it will be raised in :meth:`!__fspath__`.
pt_br: Простой :term:`объект, похожий на путь`. Он реализует метод :meth:`~os.PathLike.__fspath__`, который просто возвращает аргумент *path*. Если *path* является исключением, оно будет создано в :meth:`!__fspath__`.

source: Temporarily set the environment variable ``envvar`` to the value of ``value``.
pt_br: Temporariamente define a variável de ambiente ``envvar`` para o valor ``value``.

source: Temporarily unset the environment variable ``envvar``.
pt_br: Desativa temporariamente a variável de ambiente ``envvar``.

source: Return ``True`` if the OS supports symbolic links, ``False`` otherwise.
pt_br: Повертає ``True``, якщо ОС підтримує символічні посилання, ``False`` інакше.

source: Return ``True`` if the OS supports xattr, ``False`` otherwise.
pt_br: Повертає ``True``, якщо ОС підтримує xattr, ``False`` інакше.

source: A context manager that temporarily changes the current working directory to *path* and yields the directory.
pt_br: Менеджер контексту, який тимчасово змінює поточний робочий каталог на *шлях* і повертає каталог.

source: If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, it issues only a warning and keeps the current working directory the same.
pt_br: Якщо *quiet* має значення ``False``, менеджер контексту створює виняток у разі помилки. В іншому випадку він видає лише попередження та зберігає поточний робочий каталог незмінним.

source: Create an empty file with *filename*. If it already exists, truncate it.
pt_br: Створіть порожній файл із *ім’ям*. Якщо він уже існує, обріжте його.

source: Count the number of open file descriptors.
pt_br: Conta o número de descritores de arquivos abertos.

source: Return ``True`` if the file system for *directory* is case-insensitive.
pt_br: Повертає ``True``, якщо файлова система для *каталогу* нечутлива до регістру.

source: Create an invalid file descriptor by opening and closing a temporary file, and returning its descriptor.
pt_br: Cria um descritor de arquivo inválido abrindo e fechando um arquivo temporário e retornando seu descritor.

source: Call :func:`os.rmdir` on *filename*. On Windows platforms, this is wrapped with a wait loop that checks for the existence of the file, which is needed due to antivirus programs that can hold files open and prevent deletion.
pt_br: Викличте :func:`os.rmdir` на *назві файлу*. На платформах Windows це обернено циклом очікування, який перевіряє існування файлу, що необхідно через антивірусні програми, які можуть утримувати файли відкритими та запобігати видаленню.

source: Call :func:`shutil.rmtree` on *path* or call :func:`os.lstat` and :func:`os.rmdir` to remove a path and its contents. As with :func:`rmdir`, on Windows platforms this is wrapped with a wait loop that checks for the existence of the files.
pt_br: Викличте :func:`shutil.rmtree` на *path* або викличте :func:`os.lstat` і :func:`os.rmdir`, щоб видалити шлях і його вміст. Як і у випадку з :func:`rmdir`, на платформах Windows це обертається циклом очікування, який перевіряє існування файлів.

source: A decorator for running tests that require support for symbolic links.
pt_br: Um decorador para executar testes que requerem suporte para links simbólicos.

source: A decorator for running tests that require support for xattr.
pt_br: Um decorador para execução de testes que requerem suporte para xattr.

source: A context manager that temporarily creates a new directory and changes the current working directory (CWD).
pt_br: Um gerenciador de contexto que cria temporariamente um novo diretório e altera o diretório de trabalho atual (CWD).

source: The context manager creates a temporary directory in the current directory with name *name* before temporarily changing the current working directory. If *name* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`.
pt_br: Менеджер контексту створює тимчасовий каталог у поточному каталозі з назвою *name* перед тим, як тимчасово змінити поточний робочий каталог. Якщо *name* має значення ``None``, тимчасовий каталог створюється за допомогою :func:`tempfile.mkdtemp`.

source: If *quiet* is ``False`` and it is not possible to create or change the CWD, an error is raised. Otherwise, only a warning is raised and the original CWD is used.
pt_br: Se *quiet* é ``False`` e ele não possibilita criar ou alterar o CWD, um erro é levantado. Por outro lado, somente um aviso surge e o CWD original é utilizado.

source: A context manager that creates a temporary directory at *path* and yields the directory.
pt_br: Um gerenciador de contexto que cria um diretório temporário no *path* e produz o diretório.
