Repository: python/python-docs-pt-br
Catalog: library/test.po
Languages: pt_br

source: If *path* is ``None``, the temporary directory is created using :func:`tempfile.mkdtemp`. If *quiet* is ``False``, the context manager raises an exception on error. Otherwise, if *path* is specified and cannot be created, only a warning is issued.
pt_br: Якщо *path* має значення ``None``, тимчасовий каталог створюється за допомогою :func:`tempfile.mkdtemp`. Якщо *quiet* має значення ``False``, менеджер контексту створює виняток у разі помилки. В іншому випадку, якщо вказано *шлях* і його неможливо створити, видається лише попередження.

source: A context manager that temporarily sets the process umask.
pt_br: Um gerenciador de contexto que temporariamente define o umask do processo.

source: Call :func:`os.unlink` on *filename*. As with :func:`rmdir`, on Windows platforms, this is wrapped with a wait loop that checks for the existence of the file.
pt_br: Виклик :func:`os.unlink` на *назві файлу*. Як і у випадку з :func:`rmdir`, на платформах Windows це обернуто циклом очікування, який перевіряє існування файлу.

source: :mod:`test.support.import_helper` --- Utilities for import tests
pt_br: :mod:`test.support.import_helper` --- Утиліти для імпортування тестів

source: The :mod:`test.support.import_helper` module provides support for import tests.
pt_br: Модуль :mod:`test.support.import_helper` забезпечує підтримку тестів імпорту.

source: Remove the module named *module_name* from ``sys.modules`` and delete any byte-compiled files of the module.
pt_br: Видаліть модуль із назвою *module_name* із ``sys.modules`` і видаліть усі скомпільовані файли модуля.

source: This function imports and returns a fresh copy of the named Python module by removing the named module from ``sys.modules`` before doing the import. Note that unlike :func:`reload`, the original module is not affected by this operation.
pt_br: Ця функція імпортує та повертає нову копію названого модуля Python, видаливши названий модуль із ``sys.modules`` перед виконанням імпорту. Зауважте, що на відміну від :func:`reload`, ця операція не впливає на вихідний модуль.

source: *fresh* is an iterable of additional module names that are also removed from the ``sys.modules`` cache before doing the import.
pt_br: *fresh* — це ітерація додаткових назв модулів, які також видаляються з кешу ``sys.modules`` перед виконанням імпорту.

source: *blocked* is an iterable of module names that are replaced with ``None`` in the module cache during the import to ensure that attempts to import them raise :exc:`ImportError`.
pt_br: *blocked* — це ітерація імен модулів, які замінюються на ``None`` у кеші модуля під час імпорту, щоб гарантувати, що спроби їх імпортувати викликають :exc:`ImportError`.

source: The named module and any modules named in the *fresh* and *blocked* parameters are saved before starting the import and then reinserted into ``sys.modules`` when the fresh import is complete.
pt_br: Названий модуль і будь-які модулі, названі в параметрах *fresh* і *blocked*, зберігаються перед початком імпорту, а потім знову вставляються в ``sys.modules``, коли новий імпорт буде завершено.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``.
pt_br: Повідомлення про застарілі модулі та пакети пригнічуються під час цього імпорту, якщо *deprecated* має значення ``True``.

source: This function will raise :exc:`ImportError` if the named module cannot be imported.
pt_br: Ця функція викличе :exc:`ImportError`, якщо вказаний модуль неможливо імпортувати.

source: This function imports and returns the named module. Unlike a normal import, this function raises :exc:`unittest.SkipTest` if the module cannot be imported.
pt_br: Ця функція імпортує та повертає названий модуль. На відміну від звичайного імпорту, ця функція викликає :exc:`unittest.SkipTest`, якщо модуль неможливо імпортувати.

source: Module and package deprecation messages are suppressed during this import if *deprecated* is ``True``. If a module is required on a platform but optional for others, set *required_on* to an iterable of platform prefixes which will be compared against :data:`sys.platform`.
pt_br: Повідомлення про застарілі модулі та пакети пригнічуються під час цього імпорту, якщо *deprecated* має значення ``True``. Якщо модуль потрібен на платформі, але необов’язковий для інших, установіть *required_on* на ітерацію префіксів платформи, які порівнюватимуться з :data:`sys.platform`.

source: Return a copy of :data:`sys.modules`.
pt_br: Retorna a cópia de :data:`sys.modules`.

source: Remove modules except for *oldmodules* and ``encodings`` in order to preserve internal cache.
pt_br: Видаліть модулі, за винятком *oldmodules* і ``encoding``, щоб зберегти внутрішній кеш.

source: Delete *name* from ``sys.modules``.
pt_br: Exclui o *name* de ``sys.modules``.

source: Move a :pep:`3147`/:pep:`488` pyc file to its legacy pyc location and return the file system path to the legacy pyc file. The *source* value is the file system path to the source file. It does not need to exist, however the PEP 3147/488 pyc file must exist.
pt_br: Перемістіть :pep:`3147`/:pep:`488` файл pyc до його застарілого розташування pyc і поверніть шлях файлової системи до застарілого pyc-файлу. Значення *source* — це шлях файлової системи до вихідного файлу. Він не обов’язково існує, однак файл PEP 3147/488 pyc має існувати.

source: A context manager to force import to return a new module reference. This is useful for testing module-level behaviors, such as the emission of a :exc:`DeprecationWarning` on import. Example usage::
pt_br: Менеджер контексту для примусового імпортування для повернення нового посилання на модуль. Це корисно для тестування поведінки на рівні модуля, наприклад виведення :exc:`DeprecationWarning` під час імпорту. Приклад використання::

source: A context manager to temporarily add directories to :data:`sys.path`.
pt_br: Менеджер контексту для тимчасового додавання каталогів до :data:`sys.path`.

source: This makes a copy of :data:`sys.path`, appends any directories given as positional arguments, then reverts :data:`sys.path` to the copied settings when the context ends.
pt_br: Це створює копію :data:`sys.path`, додає будь-які каталоги, надані як позиційні аргументи, а потім повертає :data:`sys.path` скопійовані налаштування, коли контекст закінчується.

source: Note that *all* :data:`sys.path` modifications in the body of the context manager, including replacement of the object, will be reverted at the end of the block.
pt_br: Зауважте, що *всі* :data:`sys.path` зміни в тілі контекстного менеджера, включаючи заміну об’єкта, буде скасовано в кінці блоку.

source: :mod:`test.support.warnings_helper` --- Utilities for warnings tests
pt_br: :mod:`test.support.warnings_helper` --- Утиліти для перевірки попереджень

source: The :mod:`test.support.warnings_helper` module provides support for warnings tests.
pt_br: Модуль :mod:`test.support.warnings_helper` забезпечує підтримку тестів попереджень.

source: Suppress warnings that are instances of *category*, which must be :exc:`Warning` or a subclass. Roughly equivalent to :func:`warnings.catch_warnings` with :meth:`warnings.simplefilter('ignore', category=category) <warnings.simplefilter>`. For example::
pt_br: Подавлять предупреждения, являющиеся экземплярами *category*, которые должны быть :exc:`Warning` или подклассом. Примерно эквивалентно :func:`warnings.catch_warnings` с :meth:`warnings.simplefilter('ignore', Category=category) <warnings.simplefilter>`. Например::

source: Context manager to check that no :exc:`ResourceWarning` was raised. You must remove the object which may emit :exc:`ResourceWarning` before the end of the context manager.
pt_br: Менеджер контексту для перевірки відсутності :exc:`ResourceWarning`. Ви повинні видалити об’єкт, який може видати :exc:`ResourceWarning` перед завершенням контекстного менеджера.

source: Test for syntax warning in *statement* by attempting to compile *statement*. Test also that the :exc:`SyntaxWarning` is emitted only once, and that it will be converted to a :exc:`SyntaxError` when turned into error. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the emitted :exc:`SyntaxWarning` and raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the warning and exception. If *offset* is not ``None``, compares to the offset of the exception.
pt_br: Перевірте синтаксичне попередження в *операторі*, спробувавши скомпілювати *оператор*. Перевірте також, що :exc:`SyntaxWarning` видається лише один раз, і що воно буде перетворено на :exc:`SyntaxError`, коли перетвориться на помилку. *testcase* — це екземпляр :mod:`unittest` для тесту. *errtext* — це регулярний вираз, який має відповідати рядковому представленню випущеного :exc:`SyntaxWarning` і викликаного :exc:`SyntaxError`. Якщо *lineno* не є ``None``, порівнюється з рядком попередження та винятку. Якщо *offset* не є ``None``, порівнюється зі зміщенням винятку.

source: ``check_warnings`` accepts 2-tuples of the form ``("message regexp", WarningCategory)`` as positional arguments. If one or more *filters* are provided, or if the optional keyword argument *quiet* is ``False``, it checks to make sure the warnings are as expected: each specified filter must match at least one of the warnings raised by the enclosed code or the test fails, and if any warnings are raised that do not match any of the specified filters the test fails. To disable the first of these checks, set *quiet* to ``True``.
pt_br: ``check_warnings`` приймає 2-кортежі форми ``("message regexp", WarningCategory)`` як позиційні аргументи. Якщо надано один або більше *фільтрів*, або якщо необов’язковий аргумент ключового слова *quiet* має значення ``False``, він перевіряє, щоб переконатися, що попередження відповідають очікуванням: кожен вказаний фільтр повинен відповідати принаймні одному з попереджень, викликаних вкладений код або тест не вдається, і якщо виникають попередження, які не відповідають жодному з указаних фільтрів, тест не вдається. Щоб вимкнути першу з цих перевірок, установіть *quiet* на ``True``.

source: If no arguments are specified, it defaults to::
pt_br: Se nenhum argumento é especificado, o padrão é::

source: In this case all warnings are caught and no errors are raised.
pt_br: Nesse caso, todos os avisos são capturados e nenhum erro é gerado.

source: On entry to the context manager, a :class:`WarningRecorder` instance is returned. The underlying warnings list from :func:`~warnings.catch_warnings` is available via the recorder object's :attr:`warnings` attribute. As a convenience, the attributes of the object representing the most recent warning can also be accessed directly through the recorder object (see example below). If no warning has been raised, then any of the attributes that would otherwise be expected on an object representing a warning will return ``None``.
pt_br: Після входу в контекстний менеджер повертається екземпляр :class:`WarningRecorder`. Базовий список попереджень із :func:`~warnings.catch_warnings` доступний через атрибут :attr:`warnings` об’єкта запису. Для зручності атрибути об’єкта, що представляє останнє попередження, також можна отримати безпосередньо через об’єкт запису (див. приклад нижче). Якщо попередження не було викликано, тоді будь-який з атрибутів, які в іншому випадку очікувалися б для об’єкта, що представляє попередження, поверне ``None``.

source: The recorder object also has a :meth:`reset` method, which clears the warnings list.
pt_br: Об’єкт recorder також має метод :meth:`reset`, який очищає список попереджень.

source: The context manager is designed to be used like this::
pt_br: O gerenciador de contexto é desenhado para ser utilizado dessa forma::

source: In this case if either warning was not raised, or some other warning was raised, :func:`check_warnings` would raise an error.
pt_br: No caso, se um aviso não foi levantado, ou algum outro aviso não foi levantado, :func:`check_warnings` deveria aparecer como um erro.

source: When a test needs to look more deeply into the warnings, rather than just checking whether or not they occurred, code like this can be used::
pt_br: Коли під час тестування потрібно глибше вивчити попередження, а не просто перевірити, чи вони виникли чи ні, можна використати такий код:

source: Here all warnings will be caught, and the test code tests the captured warnings directly.
pt_br: Aqui todos os avisos serão capturados e o código de teste testa os avisos diretamente capturados.

source: New optional arguments *filters* and *quiet*.
pt_br: Novos argumentos opcionais *filters* e *quiet*.

source: Class used to record warnings for unit tests. See documentation of :func:`check_warnings` above for more details.
pt_br: Клас, який використовується для запису попереджень для модульних тестів. Перегляньте документацію :func:`check_warnings` вище, щоб дізнатися більше.
