Repository: python/python-docs-pt-br
Catalog: library/test.po
Languages: pt_br

source: See :func:`busy_retry` documentation for the parameters usage.
pt_br: См. документацию :func:`busy_retry` для использования параметров.

source: Example raising an exception after SHORT_TIMEOUT seconds::
pt_br: Пример создания исключения через несколько секунд SHORT_TIMEOUT::

source: Return ``True`` if *resource* is enabled and available. The list of available resources is only set when :mod:`test.regrtest` is executing the tests.
pt_br: Повертає ``True``, якщо *ресурс* увімкнено та доступний. Список доступних ресурсів встановлюється лише тоді, коли :mod:`test.regrtest` виконує тести.

source: Return ``True`` if Python was not built with ``-O0`` or ``-Og``.
pt_br: Повертає ``True``, якщо Python не було зібрано з ``-O0`` або ``-Og``.

source: Return :const:`_testcapi.WITH_PYMALLOC`.
pt_br: Верните :const:`_testcapi.WITH_PYMALLOC`.

source: Raise :exc:`ResourceDenied` if *resource* is not available. *msg* is the argument to :exc:`ResourceDenied` if it is raised. Always returns ``True`` if called by a function whose ``__name__`` is ``'__main__'``. Used when tests are executed by :mod:`test.regrtest`.
pt_br: Підніміть :exc:`ResourceDenied`, якщо *ресурс* недоступний. *msg* є аргументом для :exc:`ResourceDenied`, якщо він викликаний. Завжди повертає ``True``, якщо викликається функцією, ``__name__`` якої є ``'__main__''``. Використовується, коли тести виконуються :mod:`test.regrtest`.

source: Return a repr of *dict* with keys sorted.
pt_br: Повертає повтор *dict* із відсортованими ключами.

source: Return the path to the file named *filename*. If no match is found *filename* is returned. This does not equal a failure since it could be the path to the file.
pt_br: Поверніть шлях до файлу з назвою *filename*. Якщо збігів не знайдено, повертається *ім’я файлу*. Це не означає помилку, оскільки це може бути шлях до файлу.

source: Setting *subdir* indicates a relative path to use to find the file rather than looking directly in the path directories.
pt_br: Параметр *subdir* вказує на відносний шлях для пошуку файлу, а не шукати безпосередньо в каталогах шляхів.

source: Set the :func:`sys.setswitchinterval` to the given *interval*. Defines a minimum interval for Android systems to prevent the system from hanging.
pt_br: Установіть :func:`sys.setswitchinterval` на заданий *інтервал*. Визначає мінімальний інтервал для систем Android, щоб запобігти зависанню системи.

source: Use this check to guard CPython's implementation-specific tests or to run them only on the implementations guarded by the arguments. This function returns ``True`` or ``False`` depending on the host platform. Example usage::
pt_br: Використовуйте цю перевірку, щоб захистити специфічні для реалізації тести CPython або запустити їх лише на реалізаціях, які захищені аргументами. Ця функція повертає ``True`` або ``False`` залежно від хост-платформи. Приклад використання::

source: Set the values for :data:`max_memuse` and :data:`real_max_memuse` for big memory tests.
pt_br: Define os valores para :data:`max_memuse` e :data:`real_max_memuse` para grandes testes de memória.

source: Store the value from *stdout*. It is meant to hold the stdout at the time the regrtest began.
pt_br: Armazena o valor de *stdout*. Destina-se a manter o stdout no momento em que o registro começou.

source: Return the original stdout set by :func:`record_original_stdout` or ``sys.stdout`` if it's not set.
pt_br: Retorna o stdout original definido por :func:`record_original_stdout` ou ``sys.stdout`` se não estiver definido.

source: Return a list of command line arguments reproducing the current settings in ``sys.flags`` and ``sys.warnoptions``.
pt_br: Retorna uma lista de argumentos de linha de comando reproduzindo as configurações em ``sys.flags`` e ``sys.warnoptions``.

source: Return a list of command line arguments reproducing the current optimization settings in ``sys.flags``.
pt_br: Retorna a lista de argumentos da linha de comando reproduzindo as configurações de otimização atuais em ``sys.flags``.

source: A context managers that temporarily replaces the named stream with :class:`io.StringIO` object.
pt_br: Um gerenciador de contexto que substitui temporariamente o fluxo nomeado pelo objeto :class:`io.StringIO`.

source: Example use with output streams::
pt_br: Exemplo do uso com fluxos de saída::

source: Example use with input stream::
pt_br: Exemplo de uso com fluxo de entrada::

source: A context manager that temporary disables :mod:`faulthandler`.
pt_br: Um gerenciador de contexto que desativa temporariamente :mod:`faulthandler`.

source: Force as many objects as possible to be collected. This is needed because timely deallocation is not guaranteed by the garbage collector. This means that ``__del__`` methods may be called later than expected and weakrefs may remain alive for longer than expected.
pt_br: Força a coleta de tantos objetos quanto possível. Isso é necessário porque a desalocação oportuna não é garantida pelo coletor de lixo. Isso significa que os métodos ``__del__`` podem ser chamados mais tarde do que o esperado e as referência fraca podem permanecer ativas por mais tempo do que o esperado.

source: A context manager that disables the garbage collector on entry. On exit, the garbage collector is restored to its prior state.
pt_br: Менеджер контексту, який вимикає збирач сміття під час входу. Після виходу збирач сміття відновлюється до попереднього стану.

source: Context manager to swap out an attribute with a new object.
pt_br: Менеджер контексту для заміни атрибута на новий об’єкт.

source: Usage::
pt_br: Uso::

source: This will set ``obj.attr`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``attr`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
pt_br: Це встановить для ``obj.attr`` значення 5 протягом блоку ``with``, відновлюючи старе значення в кінці блоку. Якщо ``attr`` не існує в ``obj``, його буде створено, а потім видалено в кінці блоку.

source: The old value (or ``None`` if it doesn't exist) will be assigned to the target of the "as" clause, if there is one.
pt_br: Старе значення (або ``None``, якщо воно не існує) буде призначено цільовому об’єкту "as", якщо воно є.

source: Context manager to swap out an item with a new object.
pt_br: Менеджер контексту для заміни елемента новим об’єктом.

source: This will set ``obj["item"]`` to 5 for the duration of the ``with`` block, restoring the old value at the end of the block. If ``item`` doesn't exist on ``obj``, it will be created and then deleted at the end of the block.
pt_br: Це встановить для ``obj["item"]`` значення 5 протягом блоку ``with``, відновлюючи старе значення в кінці блоку. Якщо ``item`` не існує в ``obj``, його буде створено, а потім видалено в кінці блоку.

source: Call the ``flush()`` method on :data:`sys.stdout` and then on :data:`sys.stderr`. It can be used to make sure that the logs order is consistent before writing into stderr.
pt_br: Вызовите метод ``flush()`` на :data:`sys.stdout`, а затем на :data:`sys.stderr`. Его можно использовать, чтобы убедиться в единообразии порядка журналов перед записью в stderr.

source: Print a warning into :data:`sys.__stderr__`. Format the message as: ``f"Warning -- {msg}"``. If *msg* is made of multiple lines, add ``"Warning -- "`` prefix to each line.
pt_br: Надрукуйте попередження в :data:`sys.__stderr__`. Відформатуйте повідомлення так: ``f"Попередження -- {msg}"``. Якщо *повідомлення* складається з кількох рядків, додайте до кожного рядка префікс "Попередження --".

source: Wait until process *pid* completes and check that the process exit code is *exitcode*.
pt_br: Зачекайте, поки процес *pid* завершиться, і переконайтеся, що код виходу процесу *exitcode*.

source: Raise an :exc:`AssertionError` if the process exit code is not equal to *exitcode*.
pt_br: Викликати :exc:`AssertionError`, якщо код виходу процесу не дорівнює *exitcode*.

source: If the process runs longer than *timeout* seconds (:data:`SHORT_TIMEOUT` by default), kill the process and raise an :exc:`AssertionError`. The timeout feature is not available on Windows.
pt_br: Якщо процес виконується довше *timeout* секунд (:data:`SHORT_TIMEOUT` за замовчуванням), завершіть процес і викликайте :exc:`AssertionError`. Функція тайм-ауту недоступна в Windows.

source: Return the size of the :c:type:`PyObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
pt_br: Повертає розмір :c:type:`PyObject`, члени структури якого визначені *fmt*. Повернене значення включає розмір заголовка об’єкта Python і вирівнювання.

source: Return the size of the :c:type:`PyVarObject` whose structure members are defined by *fmt*. The returned value includes the size of the Python object header and alignment.
pt_br: Повертає розмір :c:type:`PyVarObject`, члени структури якого визначено *fmt*. Повернене значення включає розмір заголовка об’єкта Python і вирівнювання.

source: For testcase *test*, assert that the ``sys.getsizeof`` for *o* plus the GC header size equals *size*.
pt_br: Для тестового випадку *test* переконайтеся, що ``sys.getsizeof`` для *o* плюс розмір заголовка GC дорівнює *size*.

source: A decorator to conditionally mark tests with :func:`unittest.expectedFailure`. Any use of this decorator should have an associated comment identifying the relevant tracker issue.
pt_br: Декоратор для умовного позначення тестів :func:`unittest.expectedFailure`. Будь-яке використання цього декоратора повинно мати відповідний коментар, що визначає відповідну проблему трекера.

source: A decorator that skips the decorated test on TLS certification validation failures.
pt_br: Декоратор, який пропускає декорований тест на помилки перевірки сертифікації TLS.

source: A decorator for running a function in a different locale, correctly resetting it after it has finished. *catstr* is the locale category as a string (for example ``"LC_ALL"``). The *locales* passed will be tried sequentially, and the first valid locale will be used.
pt_br: Декоратор для запуску функції в іншій локалі, правильно скидаючи її після завершення. *catstr* — це категорія локалі у вигляді рядка (наприклад, ``"LC_ALL"``). Передані *локалі* перевірятимуться послідовно, і використовуватиметься перша дійсна локаль.

source: A decorator for running a function in a specific timezone, correctly resetting it after it has finished.
pt_br: Декоратор для запуску функції в певному часовому поясі, правильно скидаючи її після завершення.

source: Decorator for the minimum version when running test on FreeBSD. If the FreeBSD version is less than the minimum, the test is skipped.
pt_br: Декоратор для мінімальної версії під час виконання тесту на FreeBSD. Якщо версія FreeBSD нижча за мінімальну, тест пропускається.

source: Decorator for the minimum version when running test on Linux. If the Linux version is less than the minimum, the test is skipped.
pt_br: Декоратор для мінімальної версії під час виконання тесту в Linux. Якщо версія Linux нижча за мінімальну, тест пропускається.

source: Decorator for the minimum version when running test on macOS. If the macOS version is less than the minimum, the test is skipped.
pt_br: Декоратор для мінімальної версії під час виконання тесту на macOS. Якщо версія macOS нижча за мінімальну, тест пропускається.

source: Decorator for skipping tests on non-IEEE 754 platforms.
pt_br: Декоратор для пропуску тестів на платформах не IEEE 754.

source: Decorator for skipping tests if :mod:`zlib` doesn't exist.
pt_br: Декоратор для пропуску тестів, якщо :mod:`zlib` не існує.

source: Decorator for skipping tests if :mod:`gzip` doesn't exist.
pt_br: Декоратор для пропуску тестів, якщо :mod:`gzip` не існує.

source: Decorator for skipping tests if :mod:`bz2` doesn't exist.
pt_br: Декоратор для пропуску тестів, якщо :mod:`bz2` не існує.

source: Decorator for skipping tests if :mod:`lzma` doesn't exist.
pt_br: Декоратор для пропуску тестів, якщо :mod:`lzma` не існує.

source: Decorator for skipping tests if *resource* is not available.
pt_br: Декоратор для пропуску тестів, якщо *ресурс* недоступний.

source: Decorator for only running the test if :data:`HAVE_DOCSTRINGS`.
pt_br: Декоратор лише для запуску тесту, якщо :data:`HAVE_DOCSTRINGS`.

source: Decorator for tests only applicable to CPython.
pt_br: Декоратор для тестів, застосовний лише до CPython.

source: Decorator for invoking :func:`check_impl_detail` on *guards*. If that returns ``False``, then uses *msg* as the reason for skipping the test.
pt_br: Декоратор для виклику :func:`check_impl_detail` на *guards*. Якщо це повертає ``False``, тоді використовується *msg* як причина для пропуску тесту.

source: Decorator to temporarily turn off tracing for the duration of the test.
pt_br: Декоратор тимчасово вимикає трасування на час тесту.

source: Decorator for tests which involve reference counting. The decorator does not run the test if it is not run by CPython. Any trace function is unset for the duration of the test to prevent unexpected refcounts caused by the trace function.
pt_br: Декоратор для тестів, які включають підрахунок посилань. Декоратор не запускає тест, якщо його не запускає CPython. Будь-яка функція трасування не налаштована на час тесту, щоб запобігти неочікуваним повторним підрахункам, викликаним функцією трасування.

source: Decorator for bigmem tests.
pt_br: Декоратор для тестів bigmem.

source: *size* is a requested size for the test (in arbitrary, test-interpreted units.) *memuse* is the number of bytes per unit for the test, or a good estimate of it. For example, a test that needs two byte buffers, of 4 GiB each, could be decorated with ``@bigmemtest(size=_4G, memuse=2)``.
pt_br: *size* — це запитуваний розмір для тесту (у довільних, інтерпретованих тестом одиницях). *memuse* — це кількість байтів на одиницю для тесту або її хороша оцінка. Наприклад, тест, який потребує двох байтових буферів, по 4 ГіБ кожен, можна прикрасити ``@bigmemtest(size=_4G, memuse=2)``.

source: The *size* argument is normally passed to the decorated test method as an extra argument. If *dry_run* is ``True``, the value passed to the test method may be less than the requested value. If *dry_run* is ``False``, it means the test doesn't support dummy runs when ``-M`` is not specified.
pt_br: Аргумент *size* зазвичай передається декорованому тестовому методу як додатковий аргумент. Якщо *dry_run* має значення ``True``, значення, передане в метод тестування, може бути меншим за запитуване значення. Якщо *dry_run* має значення ``False``, це означає, що тест не підтримує фіктивні запуски, якщо ``-M`` не вказано.

source: Decorator for tests that fill the address space.
pt_br: Decorador para testes que preeenche o espaço do endereço.

source: Test for syntax errors in *statement* by attempting to compile *statement*. *testcase* is the :mod:`unittest` instance for the test. *errtext* is the regular expression which should match the string representation of the raised :exc:`SyntaxError`. If *lineno* is not ``None``, compares to the line of the exception. If *offset* is not ``None``, compares to the offset of the exception.
pt_br: Перевірте синтаксичні помилки в *операторі*, спробувавши скомпілювати *оператор*. *testcase* — це екземпляр :mod:`unittest` для тесту. *errtext* — це регулярний вираз, який має відповідати рядковому представленню викликаної :exc:`SyntaxError`. Якщо *lineno* не є ``None``, порівнюється з рядком винятку. Якщо *offset* не є ``None``, порівнюється зі зміщенням винятку.

source: Open *url*. If open fails, raises :exc:`TestFailed`.
pt_br: Abre *url*. Se falhar em abrir, levanta :exc:`TestFailed`.

source: Use this at the end of ``test_main`` whenever sub-processes are started. This will help ensure that no extra children (zombies) stick around to hog resources and create problems when looking for refleaks.
pt_br: Використовуйте це в кінці ``test_main`` кожного разу, коли запускаються підпроцеси. Це допоможе гарантувати, що жодні зайві діти (зомбі) не залишаться, щоб витягнути ресурси та створювати проблеми під час пошуку рефлексів.

source: Get an attribute, raising :exc:`unittest.SkipTest` if :exc:`AttributeError` is raised.
pt_br: Отримати атрибут, викликаючи :exc:`unittest.SkipTest`, якщо виникає :exc:`AttributeError`.

source: Context manager catching unraisable exception using :func:`sys.unraisablehook`.
pt_br: Менеджер контексту перехоплює виняток, який неможливо викликати, використовуючи :func:`sys.unraisablehook`.

source: Storing the exception value (``cm.unraisable.exc_value``) creates a reference cycle. The reference cycle is broken explicitly when the context manager exits.
pt_br: Зберігання значення винятку (``cm.unraisable.exc_value``) створює еталонний цикл. Посилальний цикл явно розривається, коли контекстний менеджер виходить.

source: Storing the object (``cm.unraisable.object``) can resurrect it if it is set to an object which is being finalized. Exiting the context manager clears the stored object.
pt_br: Зберігання об’єкта (``cm.unraisable.object``) може воскресити його, якщо для нього встановлено об’єкт, який завершується. Вихід із менеджера контексту очищає збережений об’єкт.

source: Generic implementation of the :mod:`unittest` ``load_tests`` protocol for use in test packages. *pkg_dir* is the root directory of the package; *loader*, *standard_tests*, and *pattern* are the arguments expected by ``load_tests``. In simple cases, the test package's ``__init__.py`` can be the following::
pt_br: Загальна реалізація протоколу :mod:`unittest` ``load_tests`` для використання в тестових пакетах. *pkg_dir* — кореневий каталог пакета; *loader*, *standard_tests* і *pattern* є аргументами, які очікуються для ``load_tests``. У простих випадках тестовий пакет ``__init__.py`` може бути наступним:

source: Returns the set of attributes, functions or methods of *ref_api* not found on *other_api*, except for a defined list of items to be ignored in this check specified in *ignore*.
pt_br: Повертає набір атрибутів, функцій або методів *ref_api*, яких немає в *other_api*, за винятком визначеного списку елементів, які слід ігнорувати в цій перевірці, указаній у *ignore*.

source: By default this skips private attributes beginning with '_' but includes all magic methods, i.e. those starting and ending in '__'.
pt_br: За замовчуванням це пропускає приватні атрибути, що починаються з "_", але включає всі магічні методи, тобто ті, що починаються та закінчуються на "__".

source: Override *object_to_patch.attr_name* with *new_value*. Also add cleanup procedure to *test_instance* to restore *object_to_patch* for *attr_name*. The *attr_name* should be a valid attribute for *object_to_patch*.
pt_br: Замініть *object_to_patch.attr_name* на *new_value*. Також додайте процедуру очищення до *test_instance*, щоб відновити *object_to_patch* для *attr_name*. *attr_name* має бути дійсним атрибутом для *object_to_patch*.

source: Run *code* in subinterpreter. Raise :exc:`unittest.SkipTest` if :mod:`tracemalloc` is enabled.
pt_br: Запустіть *код* у субінтерпретаторі. Підніміть :exc:`unittest.SkipTest`, якщо :mod:`tracemalloc` увімкнено.

source: Assert instances of *cls* are deallocated after iterating.
pt_br: Екземпляри Assert *cls* звільняються після ітерації.

source: Check for the existence of the compiler executables whose names are listed in *cmd_names* or all the compiler executables when *cmd_names* is empty and return the first missing executable or ``None`` when none is found missing.
pt_br: Перевірте наявність виконуваних файлів компілятора, імена яких указано в *cmd_names*, або всіх виконуваних файлів компілятора, якщо *cmd_names* порожній, і поверніть перший відсутній виконуваний файл або ``None``, якщо жоден відсутній.

source: Assert that the ``__all__`` variable of *module* contains all public names.
pt_br: Переконайтеся, що змінна ``__all__`` *module* містить усі публічні імена.

source: The module's public names (its API) are detected automatically based on whether they match the public name convention and were defined in *module*.
pt_br: Загальнодоступні імена модуля (його API) визначаються автоматично залежно від того, чи відповідають вони загальнодоступним іменам і чи були визначені в *module*.

source: The *name_of_module* argument can specify (as a string or tuple thereof) what module(s) an API could be defined in order to be detected as a public API. One case for this is when *module* imports part of its public API from other modules, possibly a C backend (like ``csv`` and its ``_csv``).
pt_br: Аргумент *name_of_module* може вказувати (як рядок або його кортеж), який(і) модуль(и) API може бути визначений, щоб бути визначеним як публічний API. Одним із випадків цього є те, що *module* імпортує частину свого загальнодоступного API з інших модулів, можливо, серверної частини C (наприклад, ``csv`` і його ``_csv``).

source: The *not_exported* argument can be a set of names that must not be treated as part of the public API even though their names indicate otherwise.
pt_br: Аргумент *not_exported* може бути набором імен, які не можна розглядати як частину загальнодоступного API, навіть якщо їхні імена вказують на інше.

source: Example use::
pt_br: Exemplo de uso::

source: Skip tests if the :mod:`multiprocessing.synchronize` module is missing, if there is no available semaphore implementation, or if creating a lock raises an :exc:`OSError`.
pt_br: Пропустіть тести, якщо модуль :mod:`multiprocessing.synchronize` відсутній, якщо немає доступної реалізації семафора або якщо створення блокування викликає :exc:`OSError`.

source: Assert that type *tp* cannot be instantiated using *args* and *kwds*.
pt_br: Стверджуйте, що тип *tp* не може бути створений за допомогою *args* і *kwds*.

source: This function returns a context manager that will change the global :func:`sys.set_int_max_str_digits` setting for the duration of the context to allow execution of test code that needs a different limit on the number of digits when converting between an integer and string.
pt_br: Эта функция возвращает диспетчер контекста, который изменит глобальную настройку :func:`sys.set_int_max_str_digits` на время контекста, чтобы разрешить выполнение тестового кода, которому требуется другой предел количества цифр при преобразовании между целым числом и строкой.

source: The :mod:`test.support` module defines the following classes:
pt_br: Модуль :mod:`test.support` визначає такі класи:

source: A context manager used to try to prevent crash dialog popups on tests that are expected to crash a subprocess.
pt_br: Менеджер контексту, який використовується для запобігання діалоговим вікнам збою під час тестів, які, як очікується, призведуть до збою підпроцесу.

source: On Windows, it disables Windows Error Reporting dialogs using `SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>`_.
pt_br: No Windows, desativa as caixas de diálogo Relatório de Erros do Windows usando SetErrorMode <https://msdn.microsoft.com/en-us/library/windows/desktop/ms680621.aspx>_.

source: On UNIX, :func:`resource.setrlimit` is used to set :const:`resource.RLIMIT_CORE`'s soft limit to 0 to prevent coredump file creation.
pt_br: В UNIX :func:`resource.setrlimit` используется для установки мягкого ограничения :const:`resource.RLIMIT_CORE` на 0, чтобы предотвратить создание файла дампа памяти.

source: On both platforms, the old value is restored by :meth:`~object.__exit__`.
pt_br: На обеих платформах старое значение восстанавливается с помощью :meth:`~object.__exit__`.

source: Class to save and restore signal handlers registered by the Python signal handler.
pt_br: Клас для збереження та відновлення обробників сигналів, зареєстрованих обробником сигналів Python.
