Repository: python/python-docs-pt-br
Catalog: library/test.po
Languages: pt_br

source: :mod:`test` --- Regression tests package for Python
pt_br: :mod:`test` --- Pacote de Testes de Regressão do Python

source: The :mod:`test` package is meant for internal use by Python only. It is documented for the benefit of the core developers of Python. Any use of this package outside of Python's standard library is discouraged as code mentioned here can change or be removed without notice between releases of Python.
pt_br: O pacote :mod:`test` é apenas para uso interno do Python. O mesmo está sendo documentado para o benefício dos principais desenvolvedores do Python. Qualquer uso deste pacote fora da biblioteca padrão do Python é desencorajado, pois, o código mencionado aqui pode ser alterado ou removido sem aviso prévio entre as versões do Python.

source: The :mod:`test` package contains all regression tests for Python as well as the modules :mod:`test.support` and :mod:`test.regrtest`. :mod:`test.support` is used to enhance your tests while :mod:`test.regrtest` drives the testing suite.
pt_br: O pacote :mod:`test` contém todos os testes de regressão do Python, bem como os módulos :mod:`test.support` e :mod:`test.regrtest`. :mod:`test.support` é utilizado para aprimorar seus testes enquanto o :mod:`test.regrtest` direciona a suite de testes.

source: Each module in the :mod:`test` package whose name starts with ``test_`` is a testing suite for a specific module or feature. All new tests should be written using the :mod:`unittest` or :mod:`doctest` module. Some older tests are written using a "traditional" testing style that compares output printed to ``sys.stdout``; this style of test is considered deprecated.
pt_br: Cada módulo no pacote :mod:`test` cujo nome começa com ``test_`` é um conjunto de testes para um módulo ou recurso específico. Todos os novos testes devem ser escritos usando o módulo :mod:`unittest` ou :mod:`doctest`. Alguns testes mais antigos são escritos usando um estilo de teste "tradicional" que compara a saída impressa a ``sys.stdout``. Este estilo de teste foi considerado descontinuado.

source: Module :mod:`unittest`
pt_br: Módulo :mod:`unittest`

source: Writing PyUnit regression tests.
pt_br: Escrevendo testes de regressão PyUnit.

source: Module :mod:`doctest`
pt_br: Módulo :mod:`doctest`

source: Tests embedded in documentation strings.
pt_br: Testes embutidos em Strings da documentação.

source: Writing Unit Tests for the :mod:`test` package
pt_br: Escrever testes unitários para o pacote :mod:`test`

source: It is preferred that tests that use the :mod:`unittest` module follow a few guidelines. One is to name the test module by starting it with ``test_`` and end it with the name of the module being tested. The test methods in the test module should start with ``test_`` and end with a description of what the method is testing. This is needed so that the methods are recognized by the test driver as test methods. Also, no documentation string for the method should be included. A comment (such as ``# Tests function returns only True or False``) should be used to provide documentation for test methods. This is done because documentation strings get printed out if they exist and thus what test is being run is not stated.
pt_br: É preferível que os testes que usam o módulo :mod:`unittest` sigam algumas diretrizes. Uma é nomear o módulo de teste iniciando-o com ``test_`` e termine com o nome do módulo que está sendo testado. Os métodos de teste no módulo de teste deve começar com ``test_`` e terminar com uma descrição do que o método está testando. Isso é necessário para que os métodos sejam reconhecidos pelo driver de teste como métodos de teste. Além disso, na string de documentação para o método deve ser incluído. Um comentário (como os ``# Tests function returns only True or False``) deve ser usado para fornecer documentação para testar métodos. Isso é feito porque as strings de documentação são impressas se existem e, portanto, qual teste está sendo executado não é indicado.

source: A basic boilerplate is often used::
pt_br: Um boilerplate básico é muitas vezes usado::

source: This code pattern allows the testing suite to be run by :mod:`test.regrtest`, on its own as a script that supports the :mod:`unittest` CLI, or via the ``python -m unittest`` CLI.
pt_br: Este padrão de código permite que o conjunto de testes seja executado pelo :mod:`test.regrtest`, por conta própria, como um script que suporte o :mod:`unittest` CLI, ou através do ``python -m unittest`` CLI.

source: The goal for regression testing is to try to break code. This leads to a few guidelines to be followed:
pt_br: O objetivo do teste de regressão é tentar quebrar o código. Isso leva a algumas diretrizes que devemos seguir:

source: The testing suite should exercise all classes, functions, and constants. This includes not just the external API that is to be presented to the outside world but also "private" code.
pt_br: O conjunto de testes deve exercitar todas as classes, funções e constantes. Isso inclui não apenas a API externa que deve ser apresentada ao mundo exterior, mas também o código "privado".

source: Whitebox testing (examining the code being tested when the tests are being written) is preferred. Blackbox testing (testing only the published user interface) is not complete enough to make sure all boundary and edge cases are tested.
pt_br: Os testes de Whitebox (que examinam o código que está sendo testado quando os testes estão sendo gravados) são preferidos. O teste Blackbox (que testa apenas a interface do público de usuário) não é completo o suficiente para garantir que todos os casos de limite e extremos sejam testados.

source: Make sure all possible values are tested including invalid ones. This makes sure that not only all valid values are acceptable but also that improper values are handled correctly.
pt_br: Certifique-se de que todos os valores possíveis sejam testados, incluindo os inválidos. Isso garante que não apenas todos os valores válidos são aceitos, mas também, que os valores impróprios são tratados corretamente.

source: Exhaust as many code paths as possible. Test where branching occurs and thus tailor input to make sure as many different paths through the code are taken.
pt_br: Esgote o maior número possível de caminhos de código. Teste onde ocorre a ramificação e, assim, personalize a entrada para garantir que tantos caminhos diferentes pelo código sejam tomados.

source: Add an explicit test for any bugs discovered for the tested code. This will make sure that the error does not crop up again if the code is changed in the future.
pt_br: Adicione um teste explícito para quaisquer bugs descobertos ao código testado. Isso garantirá que o erro não apareça novamente se o código for alterado no futuro.

source: Make sure to clean up after your tests (such as close and remove all temporary files).
pt_br: Certifique-se de limpar após seus testes (como fechar e remover todos os arquivos temporários).

source: If a test is dependent on a specific condition of the operating system then verify the condition already exists before attempting the test.
pt_br: Se um teste depende de uma condição específica do sistema operacional, então verifica se a condição já existe antes de tentar o teste.

source: Import as few modules as possible and do it as soon as possible. This minimizes external dependencies of tests and also minimizes possible anomalous behavior from side-effects of importing a module.
pt_br: Importa o menor número de módulos possível e faça isso o mais rápido possível. Isso minimiza dependências externas de testes, e também minimiza possíveis comportamento anômalo dos efeitos colaterais da importação de um módulo.

source: Try to maximize code reuse. On occasion, tests will vary by something as small as what type of input is used. Minimize code duplication by subclassing a basic test class with a class that specifies the input::
pt_br: Tente maximizar a reutilização de código. Ocasionalmente, os testes variam em algo tão pequeno quanto o tipo de entrada é usado. Minimize a duplicação de código criando uma subclasse básica de testes com uma classe que especifica o input::

source: When using this pattern, remember that all classes that inherit from :class:`unittest.TestCase` are run as tests. The :class:`!TestFuncAcceptsSequencesMixin` class in the example above does not have any data and so can't be run by itself, thus it does not inherit from :class:`unittest.TestCase`.
pt_br: Ao usar este padrão, lembre-se que todas as classes que herdam de :class:`unittest.TestCase` são executadas como testes. A classe :class:`!TestFuncAcceptsSequencesMixin` no exemplo acima não tem nenhum dado e, portanto, não pode ser executada sozinha, portanto, ela não herda de :class:`unittest.TestCase`.

source: A book by Kent Beck on writing tests before code.
pt_br: Um livro de Kent Beck sobre escrita de testes antes do código.

source: Running tests using the command-line interface
pt_br: Executando testes usando a interface de linha de comando

source: The :mod:`test` package can be run as a script to drive Python's regression test suite, thanks to the :option:`-m` option: :program:`python -m test`. Under the hood, it uses :mod:`test.regrtest`; the call :program:`python -m test.regrtest` used in previous Python versions still works. Running the script by itself automatically starts running all regression tests in the :mod:`test` package. It does this by finding all modules in the package whose name starts with ``test_``, importing them, and executing the function :func:`test_main` if present or loading the tests via unittest.TestLoader.loadTestsFromModule if ``test_main`` does not exist. The names of tests to execute may also be passed to the script. Specifying a single regression test (:program:`python -m test test_spam`) will minimize output and only print whether the test passed or failed.
pt_br: O pacote :mod:`test` pode ser executado como um script para conduzir o conjunto de testes de regressão do Python, graças à opção :option:`-m`: :program:`python -m test`. Nos bastidores, ele usa :mod:`test.regrtest`; a chamada :program:`python -m test.regrtest` usado nas versões anteriores do Python ainda funciona. Executar o script por si só começa a executar todos os testes de regressão no pacote :mod:`test`. Ele faz isso encontrando todos os módulos no pacote cujo nome começa com ``test_``, importando-os e executando a função :func:`test_main` se presente ou carregando os testes via unittest.TestLoader.loadTestsFromModule se ``test_main`` não existir. Os nomes dos testes a serem executados também podem ser passados para o script. Especificando um teste de regressão simples (:program:`python -m test test_spam`) minimizará saiba e imprima apenas se o teste passou ou falhou.

source: Running :mod:`test` directly allows what resources are available for tests to use to be set. You do this by using the ``-u`` command-line option. Specifying ``all`` as the value for the ``-u`` option enables all possible resources: :program:`python -m test -uall`. If all but one resource is desired (a more common case), a comma-separated list of resources that are not desired may be listed after ``all``. The command :program:`python -m test -uall,-audio,-largefile` will run :mod:`test` with all resources except the ``audio`` and ``largefile`` resources. For a list of all resources and more command-line options, run :program:`python -m test -h`.
pt_br: A execução de :mod:`test` permite definir diretamente quais recursos estão disponíveis para os testes usarem. Você faz isso usando a opção de linha de comando ``-u``. Especificar ``all`` como o valor para a opção ``-u`` ativa todos os recursos possíveis: :program:`python -m test -uall`. Se todos menos um recurso for desejado (um caso mais comum), uma lista separada por vírgulas de recursos que não são desejados pode ser listada após ``all``. O comando :program:`python -m test -uall,-audio,-largefile` executará :mod:`test` com todos os recursos, exceto os recursos ``audio`` e ``largefile``. Para obter uma lista de todos os recursos e mais opções de linha de comando, execute :program:`python -m test -h`.

source: Some other ways to execute the regression tests depend on what platform the tests are being executed on. On Unix, you can run :program:`make test` at the top-level directory where Python was built. On Windows, executing :program:`rt.bat` from your :file:`PCbuild` directory will run all regression tests.
pt_br: Alguns outros meios para executar os testes de regressão dependem em qual plataforma os testes estão sendo executados. No Unix, você pode executar: programa: ' make test' no diretório de mais alto nível onde o Python foi construído. No Windows, executar: programa 'rt.bat' do seu diretório: file: 'PCbuild' executará todos os testes de regressão.

source: :mod:`test.support` --- Utilities for the Python test suite
pt_br: :mod:`test.support` --- Utilitários para o conjunto de teste do Python

source: The :mod:`test.support` module provides support for Python's regression test suite.
pt_br: O módulo :mod:`test.support` fornece suporte para a suíte de testes de regressão do Python.

source: :mod:`test.support` is not a public module. It is documented here to help Python developers write tests. The API of this module is subject to change without backwards compatibility concerns between releases.
pt_br: :mod: 'test.support' não é um módulo público. Ele está documentado aqui para ajudar desenvolvedores de Python a escreverem testes. A API desse módulo está sujeito a mudar sem problemas de compatibilidade entre as versões anteriores.

source: This module defines the following exceptions:
pt_br: Esse módulo define as seguintes exceções:

source: Exception to be raised when a test fails. This is deprecated in favor of :mod:`unittest`\ -based tests and :class:`unittest.TestCase`'s assertion methods.
pt_br: Exceção a ser levantada quando um teste falha. Isto foi descontinuado em favor dos testes baseados em :mod:`unittest` e métodos de asserção de :class:`unittest.TestCase`.

source: Subclass of :exc:`unittest.SkipTest`. Raised when a resource (such as a network connection) is not available. Raised by the :func:`requires` function.
pt_br: Subclasse de :exc:`unittest.SkipTest`. Levantada quando um recurso (como uma conexão de rede) não está disponível. Levantada pela função :func:`requires`.

source: The :mod:`test.support` module defines the following constants:
pt_br: O módulo :mod:`test.support` define as seguintes constantes:

source: ``True`` when verbose output is enabled. Should be checked when more detailed information is desired about a running test. *verbose* is set by :mod:`test.regrtest`.
pt_br: ``True`` quando a saída detalhada está habilitada. Deve ser verificado quando informações mais detalhadas são desejadas sobre um teste em execução. *verbose* é definido por :mod:`test.regrtest`.

source: ``True`` if the running interpreter is Jython.
pt_br: ``True`` se o interpretador em execução for Jython.

source: ``True`` if the system is Android.
pt_br: ``True`` se o sistema é Android.

source: Path for shell if not on Windows; otherwise ``None``.
pt_br: Caminho para o console se não estiver no Windows; por outro lado ``None``

source: Timeout in seconds for tests using a network server listening on the network local loopback interface like ``127.0.0.1``.
pt_br: Tempo limite em segundos para testes usando um servidor de rede escutando na interface de loopback local da rede como ``127.0.0.1``.

source: The timeout is long enough to prevent test failure: it takes into account that the client and the server can run in different threads or even different processes.
pt_br: O tempo limite é longo o suficiente para evitar a falha do teste: leva em consideração que o cliente e o servidor podem ser executados em diferentes threads ou mesmo processos diferentes.

source: The timeout should be long enough for :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` methods of :class:`socket.socket`.
pt_br: O tempo limite deve ser longo o suficiente para os métodos :meth:`~socket.socket.connect`, :meth:`~socket.socket.recv` e :meth:`~socket.socket.send` de :class:`socket.socket`.

source: Its default value is 5 seconds.
pt_br: Seu valor padrão é 5 segundos.

source: See also :data:`INTERNET_TIMEOUT`.
pt_br: Veja também :data:`INTERNET_TIMEOUT`.

source: Timeout in seconds for network requests going to the internet.
pt_br: Tempo limite em segundos para solicitações de rede indo para a Internet.

source: The timeout is short enough to prevent a test to wait for too long if the internet request is blocked for whatever reason.
pt_br: O tempo limite é curto o suficiente para evitar que um teste espere muito tempo se a requisição da Internet for bloqueada por qualquer motivo.

source: Usually, a timeout using :data:`INTERNET_TIMEOUT` should not mark a test as failed, but skip the test instead: see :func:`~test.support.socket_helper.transient_internet`.
pt_br: Normalmente, um tempo limite usando :data:`INTERNET_TIMEOUT` não deve marcar um teste como falhado, mas ignorá-lo: veja :func:`~test.support.socket_helper.transient_internet`.

source: Its default value is 1 minute.
pt_br: Seu valor padrão é 1 minuto.

source: See also :data:`LOOPBACK_TIMEOUT`.
pt_br: Veja também :data:`LOOPBACK_TIMEOUT`.

source: Timeout in seconds to mark a test as failed if the test takes "too long".
pt_br: Tempo limite em segundos para marcar um teste como falho se o teste demorar "muito tempo".

source: The timeout value depends on the regrtest ``--timeout`` command line option.
pt_br: O valor do tempo limite depende da opção da linha de comando regrtest ``--timeout``.

source: If a test using :data:`SHORT_TIMEOUT` starts to fail randomly on slow buildbots, use :data:`LONG_TIMEOUT` instead.
pt_br: Se um teste usando :data:`SHORT_TIMEOUT` começar a falhar aleatoriamente em buildbots lentos, use :data:`LONG_TIMEOUT`.

source: Its default value is 30 seconds.
pt_br: Seu valor padrão é 30 segundos.

source: Timeout in seconds to detect when a test hangs.
pt_br: Tempo limite em segundos para detectar quando um teste trava.

source: It is long enough to reduce the risk of test failure on the slowest Python buildbots. It should not be used to mark a test as failed if the test takes "too long". The timeout value depends on the regrtest ``--timeout`` command line option.
pt_br: É longo o suficiente para reduzir o risco de falha de teste nos buildbots Python mais lentos. Não deve ser usado para marcar um teste como reprovado se o teste demorar "muito tempo". O valor do tempo limite depende da opção de linha de comando regrtest ``--timeout``.

source: Its default value is 5 minutes.
pt_br: Seu valor padrão é 5 minutos.

source: See also :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` and :data:`SHORT_TIMEOUT`.
pt_br: Veja também :data:`LOOPBACK_TIMEOUT`, :data:`INTERNET_TIMEOUT` e :data:`SHORT_TIMEOUT`.

source: Set when tests can be skipped when they are not useful for PGO.
pt_br: Definido quando os testes podem ser ignorados quando não são úteis para PGO.

source: A constant that is likely larger than the underlying OS pipe buffer size, to make writes blocking.
pt_br: Uma constante que provavelmente é maior que o tamanho do buffer de canal do sistema operacional subjacente, para fazer o bloqueio de escritas.

source: A constant that is likely larger than the underlying OS socket buffer size, to make writes blocking.
pt_br: Uma constante que provavelmente é maior que o tamanho do buffer de soquete do sistema operacional subjacente, para fazer o bloqueio de escritas.

source: Set to the top level directory that contains :mod:`test.support`.
pt_br: Define o diretório de mais alto nível que contém :mod:`test.support`.

source: Set to the top level directory for the test package.
pt_br: Define o diretório de mais alto nível para o pacote de teste.

source: Set to the ``data`` directory within the test package.
pt_br: Define o diretório ``data`` de dentro do pacote de teste.

source: Set to :data:`sys.maxsize` for big memory tests.
pt_br: Define :data:`sys.maxsize` para grandes testes de memória.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Limited by :data:`MAX_Py_ssize_t`.
pt_br: Встановлено :func:`set_memlimit` як обмеження пам’яті для великих тестів пам’яті. Обмежено :data:`MAX_Py_ssize_t`.

source: Set by :func:`set_memlimit` as the memory limit for big memory tests. Not limited by :data:`MAX_Py_ssize_t`.
pt_br: Встановлено :func:`set_memlimit` як обмеження пам’яті для великих тестів пам’яті. Не обмежено :data:`MAX_Py_ssize_t`.

source: Set to ``True`` if Python is built without docstrings (the :c:macro:`WITH_DOC_STRINGS` macro is not defined). See the :option:`configure --without-doc-strings <--without-doc-strings>` option.
pt_br: Установіть значення ``True``, якщо Python створено без рядків документації (макрос :c:macro:`WITH_DOC_STRINGS` не визначено). Перегляньте параметр :option:`configure --without-doc-strings <--without-doc-strings>`.

source: See also the :data:`HAVE_DOCSTRINGS` variable.
pt_br: Перегляньте також змінну :data:`HAVE_DOCSTRINGS`.

source: Set to ``True`` if function docstrings are available. See the :option:`python -OO <-O>` option, which strips docstrings of functions implemented in Python.
pt_br: Установіть значення ``True``, якщо доступні рядки документації функцій. Перегляньте параметр :option:`python -OO <-O>`, який видаляє рядки документів функцій, реалізованих у Python.

source: See also the :data:`MISSING_C_DOCSTRINGS` variable.
pt_br: Перегляньте також змінну :data:`MISSING_C_DOCSTRINGS`.

source: Define the URL of a dedicated HTTP server for the network tests.
pt_br: Визначте URL-адресу виділеного HTTP-сервера для мережевих тестів.

source: Object that is equal to anything. Used to test mixed type comparison.
pt_br: Об'єкт, який дорівнює будь-чому. Використовується для перевірки порівняння змішаного типу.

source: Object that is not equal to anything (even to :data:`ALWAYS_EQ`). Used to test mixed type comparison.
pt_br: Об’єкт, який нічому не дорівнює (навіть :data:`ALWAYS_EQ`). Використовується для перевірки порівняння змішаного типу.

source: Object that is greater than anything (except itself). Used to test mixed type comparison.
pt_br: Об'єкт, який є більшим за все (крім самого себе). Використовується для перевірки порівняння змішаного типу.

source: Object that is less than anything (except itself). Used to test mixed type comparison.
pt_br: Об'єкт, який є меншим за все (крім себе). Використовується для перевірки порівняння змішаного типу.

source: The :mod:`test.support` module defines the following functions:
pt_br: O módulo :mod:`test.support` define as seguintes funções:

source: Run the loop body until ``break`` stops the loop.
pt_br: Выполняйте тело цикла до тех пор, пока ``break`` не остановит цикл.

source: After *timeout* seconds, raise an :exc:`AssertionError` if *error* is true, or just stop the loop if *error* is false.
pt_br: По истечении *таймаута* секунд выдайте :exc:`AssertionError`, если *error* истинно, или просто остановите цикл, если *error* ложно.

source: Example::
pt_br: Exemplo::

source: Example of error=False usage::
pt_br: Пример использования error=False::

source: Wait strategy that applies exponential backoff.
pt_br: Стратегия ожидания, которая применяет экспоненциальную отсрочку.

source: Run the loop body until ``break`` stops the loop. Sleep at each loop iteration, but not at the first iteration. The sleep delay is doubled at each iteration (up to *max_delay* seconds).
pt_br: Выполняйте тело цикла до тех пор, пока ``break`` не остановит цикл. Sleep на каждой итерации цикла, но не на первой итерации. Задержка сна удваивается на каждой итерации (до *max_delay* секунд).
