Repository: python/python-docs-pt-br
Catalog: library/timeit.po
Languages: pt_br

source: :mod:`!timeit` --- Measure execution time of small code snippets
pt_br: :mod:`!timeit` --- Mede o tempo de execução de pequenos trechos de código

source: **Source code:** :source:`Lib/timeit.py`
pt_br: **Código-fonte:** :source:`Lib/timeit.py`

source: This module provides a simple way to time small bits of Python code. It has both a :ref:`timeit-command-line-interface` as well as a :ref:`callable <python-interface>` one. It avoids a number of common traps for measuring execution times. See also Tim Peters' introduction to the "Algorithms" chapter in the second edition of *Python Cookbook*, published by O'Reilly.
pt_br: Este módulo fornece uma maneira simples de cronometrar pequenos trechos do código Python. Ele tem uma :ref:`timeit-command-line-interface` e um :ref:`chamável <python-interface>`. Ele evita uma série de armadilhas comuns para medir os tempos de execução de um script. Veja também o capítulo "Algorithms" de Tim Peters, na segunda edição do *Python Cookbook*, publicado pela O'Reilly.

source: Basic Examples
pt_br: Exemplos básicos

source: The following example shows how the :ref:`timeit-command-line-interface` can be used to compare three different expressions:
pt_br: O exemplo a seguir mostra como a :ref:`timeit-command-line-interface` pode ser usado para comparar três expressões diferentes:

source: This can be achieved from the :ref:`python-interface` with::
pt_br: Isso pode ser obtido da interface :ref:`python-interface` ::

source: A callable can also be passed from the :ref:`python-interface`::
pt_br: Um chamável também pode ser passado para a :ref:`python-interface`::

source: Note however that :func:`.timeit` will automatically determine the number of repetitions only when the command-line interface is used. In the :ref:`timeit-examples` section you can find more advanced examples.
pt_br: Observe, entretanto, que :func:`.timeit` determinará automaticamente o número de repetições somente quando a interface de linha de comando for usada. Na seção :ref:`timeit-examples` você encontrará exemplos mais avançados.

source: Python Interface
pt_br: Interface em Python

source: The module defines three convenience functions and a public class:
pt_br: Este módulo define três funções e uma classe pública:

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.timeit` method with *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
pt_br: Cria uma instância de :class:`Timer` com o código de *setup* e a função *timer* função para executar o método :meth:`.timeit` com o total de execuções informado em *number*. O argumento opcional *globals* especifica um espaço de nomes no qual o código será executado.

source: The optional *globals* parameter was added.
pt_br: O parâmetro opcional *globals* foi adicionado.

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.repeat` method with the given *repeat* count and *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
pt_br: Cria uma instância :class:`Timer` com a instrução fornecida, o código de *setup* e a função *timer* e para executar o método :meth:`.repeat` com o total de execuções informando em *repeat* e o *número* de execuções fornecidos. O argumento opcional *globals* especifica um espaço de nomes no qual executar o código.

source: Default value of *repeat* changed from 3 to 5.
pt_br: Valor padrão de *repetição* mudou de 3 para 5.

source: The default timer, which is always time.perf_counter(), returns float seconds. An alternative, time.perf_counter_ns, returns integer nanoseconds.
pt_br: O cronômetro padrão, que é sempre time.perf_counter(), retorna segundos com ponto flutuante. Uma alternativa, time.perf_counter_ns, retorna um inteiro em nanossegundos.

source: :func:`time.perf_counter` is now the default timer.
pt_br: :func:`time.perf_counter` é o cronômetro padrão agora.

source: Class for timing execution speed of small code snippets.
pt_br: Classe para cronometrar a velocidade de execução de pequenos trechos de código.

source: The constructor takes a statement to be timed, an additional statement used for setup, and a timer function. Both statements default to ``'pass'``; the timer function is platform-dependent (see the module doc string). *stmt* and *setup* may also contain multiple statements separated by ``;`` or newlines, as long as they don't contain multi-line string literals. The statement will by default be executed within timeit's namespace; this behavior can be controlled by passing a namespace to *globals*.
pt_br: O construtor recebe uma instrução a ser cronometrada, uma instrução adicional usada para configuração e uma função de timer. Ambas as instruções têm como padrão ``'pass'``; a função de timer é dependente da plataforma (veja a string do documento do módulo). *stmt* e *setup* também podem conter múltiplas instruções separadas por ``;`` ou novas linhas, desde que não contenham literais de string multilinhas. A instrução será, por padrão, executada dentro do espaço de nomes do *timeit*; esse comportamento pode ser controlado passando um espaço de nomes para *globals*.

source: To measure the execution time of the first statement, use the :meth:`.timeit` method. The :meth:`.repeat` and :meth:`.autorange` methods are convenience methods to call :meth:`.timeit` multiple times.
pt_br: Para medir o tempo de execução da primeira instrução use o método :meth:`.timeit`. Os métodos :meth:`.repeat` e :meth:`.autorange` são convenientes para chamar :meth:`.timeit` várias vezes.

source: The execution time of *setup* is excluded from the overall timed execution run.
pt_br: O tempo de execução de *setup* é excluído do tempo total de execução cronometrado.

source: The *stmt* and *setup* parameters can also take objects that are callable without arguments. This will embed calls to them in a timer function that will then be executed by :meth:`.timeit`. Note that the timing overhead is a little larger in this case because of the extra function calls.
pt_br: Os parâmetros *stmt* e *setup* também podem receber objetos que podem ser chamados sem argumentos. Isso incorporará chamadas a eles em uma função de timer que será executada por :meth:`.timeit`. Observe que a sobrecarga de temporização é um pouco maior neste caso por causa das chamadas de função extras.

source: Time *number* executions of the main statement. This executes the setup statement once, and then returns the time it takes to execute the main statement a number of times. The default timer returns seconds as a float. The argument is the number of times through the loop, defaulting to one million. The main statement, the setup statement and the timer function to be used are passed to the constructor.
pt_br: Mede o tempo para a quantidade *number* de execuções da instrução principal. Isso executa a instrução setup uma vez e, em seguida, retorna o tempo necessário para executar a instrução principal várias vezes. O temporizador padrão retorna segundos como um float. O argumento é o número de vezes que o laço passa, com padrão de um milhão. A instrução principal, a instrução de configuração e a função de timer a ser usada são passadas para o construtor.

source: By default, :meth:`.timeit` temporarily turns off :term:`garbage collection` during the timing. The advantage of this approach is that it makes independent timings more comparable. The disadvantage is that GC may be an important component of the performance of the function being measured. If so, GC can be re-enabled as the first statement in the *setup* string. For example::
pt_br: Por padrão, :meth:`.timeit` desativa temporariamente :term:`coleta de lixo` durante a temporização. A vantagem dessa abordagem é que ela torna temporizações independentes mais comparáveis. A desvantagem é que o GC pode ser um componente importante do desempenho da função que está sendo medida. Se for assim, o GC pode ser reativado como a primeira instrução na string *setup*. Por exemplo::

source: Automatically determine how many times to call :meth:`.timeit`.
pt_br: Determina automaticamente quantas vezes chamar :meth:`.timeit`.

source: This is a convenience function that calls :meth:`.timeit` repeatedly so that the total time >= 0.2 second, returning the eventual (number of loops, time taken for that number of loops). It calls :meth:`.timeit` with increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the time taken is at least 0.2 seconds.
pt_br: Esta é uma função de conveniência que chama :meth:`.timeit` repetidamente para que o tempo total seja >= 0,2 segundos, retornando o eventual (número de voltas, tempo gasto para esse número de voltas). Ela chama :meth:`.timeit` com números crescentes da sequência 1, 2, 5, 10, 20, 50, ... até que o tempo gasto seja de pelo menos 0,2 segundos.

source: If *callback* is given and is not ``None``, it will be called after each trial with two arguments: ``callback(number, time_taken)``.
pt_br: Se *callback* for fornecido e não for ``None``, ele será chamado após cada tentativa e tem dois argumento: ``callback(number, time_taken)``.

source: Call :meth:`.timeit` a few times.
pt_br: Chama :meth:`.timeit` algumas vezes.

source: This is a convenience function that calls the :meth:`.timeit` repeatedly, returning a list of results. The first argument specifies how many times to call :meth:`.timeit`. The second argument specifies the *number* argument for :meth:`.timeit`.
pt_br: Esse é um função de conveniência que chama o :meth:`.timeit` repetidamente e retorna uma lista de resultados. O primeiro argumento especifica quantas vezes deve chamar o :meth:`.timeit`. O segundo argumento especifica o argumento *number* para :meth:`.timeit`.

source: It's tempting to calculate mean and standard deviation from the result vector and report these. However, this is not very useful. In a typical case, the lowest value gives a lower bound for how fast your machine can run the given code snippet; higher values in the result vector are typically not caused by variability in Python's speed, but by other processes interfering with your timing accuracy. So the :func:`min` of the result is probably the only number you should be interested in. After that, you should look at the entire vector and apply common sense rather than statistics.
pt_br: É tentador calcular a média e o desvio padrão do vetor de resultados e relatá-los. No entanto, isso não é muito útil. Em um caso típico, o menor valor fornece um limite inferior para a velocidade com que sua máquina pode executar o trecho de código fornecido; valores mais altos no vetor de resultados normalmente não são causados pela variabilidade na velocidade do Python, mas por outros processos que interferem na precisão do seu tempo. Portanto, o :func:`min` do resultado é provavelmente o único número no qual você deve se interessar. Depois disso, você deve analisar o vetor inteiro e aplicar o bom senso em vez de estatística.

source: Helper to print a traceback from the timed code.
pt_br: Função auxiliar para imprimir um traceback do código cronometrado.

source: Typical use::
pt_br: Uso típico::

source: t = Timer(...) # outside the try/except try: t.timeit(...) # or t.repeat(...) except Exception: t.print_exc()
pt_br: t = Timer(...) # fora do try/except try: t.timeit(...) # ou t.repeat(...) except Exception: t.print_exc()

source: The advantage over the standard traceback is that source lines in the compiled template will be displayed. The optional *file* argument directs where the traceback is sent; it defaults to :data:`sys.stderr`.
pt_br: A vantagem em relação ao traceback padrão é que as linhas de origem no modelo compilado serão exibidas. O argumento opcional *file* direciona para onde o traceback é enviado; o padrão é :data:`sys.stderr`.

source: Command-Line Interface
pt_br: Interface de Linha de Comando

source: When called as a program from the command line, the following form is used::
pt_br: Quando chamado como um programa a partir da linha de comando, as seguintes opções estão disponíveis::

source: python -m timeit [-n N] [-r N] [-u U] [-s S] [-p] [-v] [-h] [statement ...]
pt_br: python -m timeit [-n N] [-r N] [-u U] [-s S] [-p] [-v] [-h] [instrução ...]

source: Where the following options are understood:
pt_br: As seguintes opções são permitidas

source: how many times to execute 'statement'
pt_br: Quantas vezes deve executar 'statement'

source: how many times to repeat the timer (default 5)
pt_br: Quantidade de vezes para repetir o cronômetro (o valor padrão é 5)

source: statement to be executed once initially (default ``pass``)
pt_br: instrução a ser executada apenas uma vez e quando iniciada (padrão ``pass`` )

source: measure process time, not wallclock time, using :func:`time.process_time` instead of :func:`time.perf_counter`, which is the default
pt_br: mede apenas o tempo de processamento, e não o tempo total de execução, usando :func:`time.process_time` em vez de :func:`time.perf_counter`, que é o padrão

source: specify a time unit for timer output; can select ``nsec``, ``usec``, ``msec``, or ``sec``
pt_br: especifique uma unidade de tempo para a saída do cronômetro; pode selecionar ``nsec``, ``usec``, ``msec``, ou ``sec``

source: print raw timing results; repeat for more digits precision
pt_br: imprime resultados brutos de tempo; repetir para obter mais precisão de dígitos

source: print a short usage message and exit
pt_br: imprime uma mensagem curta de uso e sai

source: A multi-line statement may be given by specifying each line as a separate statement argument; indented lines are possible by enclosing an argument in quotes and using leading spaces. Multiple :option:`-s` options are treated similarly.
pt_br: Uma instrução multilinha pode ser fornecida especificando cada linha como um argumento de instrução separado; linhas indentadas são possíveis colocando um argumento entre aspas e usando espaços à esquerda. Múltiplas opções :option:`-s` são tratadas de forma semelhante.

source: If :option:`-n` is not given, a suitable number of loops is calculated by trying increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the total time is at least 0.2 seconds.
pt_br: Se :option:`-n` não for informada, um número adequado de loops será calculado tentando adicionar números numa sequência como 1, 2, 5, 10, 20, 50, ... até que o tempo total seja de pelo menos 0,2 segundos.

source: :func:`default_timer` measurements can be affected by other programs running on the same machine, so the best thing to do when accurate timing is necessary is to repeat the timing a few times and use the best time. The :option:`-r` option is good for this; the default of 5 repetitions is probably enough in most cases. You can use :func:`time.process_time` to measure CPU time.
pt_br: As medições de :func:`default_timer` podem ser afetadas por outros programas em execução na mesma máquina, portanto, a melhor coisa a fazer quando uma cronometragem precisa é repeti-la algumas vezes e usar o melhor tempo. A opção :option:`-r` é boa para isso; o padrão de 5 repetições provavelmente é suficiente na maioria dos casos. Você pode usar :func:`time.process_time` para medir o tempo de CPU.

source: There is a certain baseline overhead associated with executing a pass statement. The code here doesn't try to hide it, but you should be aware of it. The baseline overhead can be measured by invoking the program without arguments, and it might differ between Python versions.
pt_br: Há uma certa sobrecarga padrão associada à execução de uma instrução *pass*. O código aqui não tenta ocultá-lo, mas você deve estar ciente disso. A sobrecarga padrão pode ser medida invocando pelo programa sem argumento, e pode ser diferente entre diferentes versões Python.

source: Examples
pt_br: Exemplos

source: It is possible to provide a setup statement that is executed only once at the beginning:
pt_br: É possível fornecer uma instrução de configuração que é executada apenas uma vez no início:

source: In the output, there are three fields. The loop count, which tells you how many times the statement body was run per timing loop repetition. The repetition count ('best of 5') which tells you how many times the timing loop was repeated, and finally the time the statement body took on average within the best repetition of the timing loop. That is, the time the fastest repetition took divided by the loop count.
pt_br: Na saída, existem três campos. A contagem de laços, que informa quantas vezes o corpo da instrução foi executado por repetição do laço de temporização. A contagem de repetições ('melhor de 5') que informa quantas vezes o laço de temporização foi repetido e, finalmente, o tempo que o corpo da instrução levou, em média, na melhor repetição do laço de temporização. Ou seja, o tempo necessário para a repetição mais rápida dividido pela contagem de interações.

source: The same can be done using the :class:`Timer` class and its methods::
pt_br: O mesmo pode ser feito usando a classe :class:`Timer` e seus métodos::

source: The following examples show how to time expressions that contain multiple lines. Here we compare the cost of using :func:`hasattr` vs. :keyword:`try`/:keyword:`except` to test for missing and present object attributes:
pt_br: Os exemplos a seguir mostram como cronometrar expressões que contêm várias linhas. Aqui comparamos o custo de usar :func:`hasattr` vs. :keyword:`try`/:keyword:`except` para testar atributos de objetos presentes e ausentes:

source: >>> import timeit >>> # attribute is missing >>> s = """\ ... try: ... str.__bool__ ... except AttributeError: ... pass ... """ >>> timeit.timeit(stmt=s, number=100000) 0.9138244460009446 >>> s = "if hasattr(str, '__bool__'): pass" >>> timeit.timeit(stmt=s, number=100000) 0.5829014980008651 >>> >>> # attribute is present >>> s = """\ ... try: ... int.__bool__ ... except AttributeError: ... pass ... """ >>> timeit.timeit(stmt=s, number=100000) 0.04215312199994514 >>> s = "if hasattr(int, '__bool__'): pass" >>> timeit.timeit(stmt=s, number=100000) 0.08588060699912603
pt_br: >>> import timeit >>> # atributo está em falta >>> s = """\ ... try: ... str.__bool__ ... except AttributeError: ... pass ... """ >>> timeit.timeit(stmt=s, number=100000) 0.9138244460009446 >>> s = "if hasattr(str, '__bool__'): pass" >>> timeit.timeit(stmt=s, number=100000) 0.5829014980008651 >>> >>> # atributo está presente >>> s = """\ ... try: ... int.__bool__ ... except AttributeError: ... pass ... """ >>> timeit.timeit(stmt=s, number=100000) 0.04215312199994514 >>> s = "if hasattr(int, '__bool__'): pass" >>> timeit.timeit(stmt=s, number=100000) 0.08588060699912603

source: To give the :mod:`timeit` module access to functions you define, you can pass a *setup* parameter which contains an import statement::
pt_br: Para dar ao módulo :mod:`timeit` acesso as funções que você definiu, você pode passar o parâmetro *setup*, que contém um instrução de importar::

source: Another option is to pass :func:`globals` to the *globals* parameter, which will cause the code to be executed within your current global namespace. This can be more convenient than individually specifying imports::
pt_br: Outra opção é passar :func:`globals` para o parâmetro *globals*, o que fará com que o código seja executado em seu espaço de nomes global. Isso pode ser mais conveniente do que especificar individualmente imports::

source: Performance
pt_br: Desempenho
