Repository: python/python-docs-pt-br
Catalog: library/time.po
Languages: pt_br

source: Or use ``nanosleep()`` if available (resolution: 1 nanosecond);
pt_br: Ou usa ``nanosleep()`` se disponível (resolução: 1 nanossegunda);

source: Or use ``select()`` (resolution: 1 microsecond).
pt_br: Ou usa ``select()`` (resolução: 1 microssegundo).

source: To emulate a "no-op", use :keyword:`pass` instead of ``time.sleep(0)``.
pt_br: Para emular um "no-op", use :keyword:`pass` em vez de ``time.sleep(0)``.

source: To voluntarily relinquish the CPU, specify a real-time :ref:`scheduling policy <os-scheduling-policy>` and use :func:`os.sched_yield` instead.
pt_br: Para abrir mão voluntariamente da CPU, especifique uma :ref:`política de agendamento <os-scheduling-policy>` em tempo real e use :func:`os.sched_yield` em seu lugar.

source: Raises an :ref:`auditing event <auditing>` ``time.sleep`` with argument ``secs``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``time.sleep`` com o argumento ``secs``.

source: The function now sleeps at least *secs* even if the sleep is interrupted by a signal, except if the signal handler raises an exception (see :pep:`475` for the rationale).
pt_br: A função agora pausa por pelo menos *secs* mesmo se a pausa é interrompido por um sinal, exceto se o tratador de sinal levanta uma exceção (veja :pep:`475` para a explicação).

source: On Unix, the ``clock_nanosleep()`` and ``nanosleep()`` functions are now used if available. On Windows, a waitable timer is now used.
pt_br: No Unix, as funções ``clock_nanosleep()`` e ``nanosleep()`` são agora usadas se estiverem disponíveis. No Windows, um temporizador aguardável é agora usado.

source: Raises an auditing event.
pt_br: Levanta um evento de auditoria.

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string as specified by the *format* argument. If *t* is not provided, the current time as returned by :func:`localtime` is used. *format* must be a string. :exc:`ValueError` is raised if any field in *t* is outside of the allowed range.
pt_br: Converte a tupla ou :class:`struct_time` representando um tempo como retornado por :func:`gmtime` ou :func:`localtime` para uma string como especificado pelo argumento *format*. Se *t* não é fornecido, o tempo atual como retornado pela :func:`localtime` é utilizado. *format* deve ser uma string. A exceção :exc:`ValueError` é levantada se qualquer campo em *t* está fora do intervalo permitido.

source: 0 is a legal argument for any position in the time tuple; if it is normally illegal the value is forced to a correct one.
pt_br: 0 é um argumento legal para qualquer posição na tupla de tempo; se é normalmente ilegal, o valor é formado a um valor correto.

source: The following directives can be embedded in the *format* string. They are shown without the optional field width and precision specification, and are replaced by the indicated characters in the :func:`strftime` result:
pt_br: As diretivas a seguir podem ser incorporadas na string *format*. Elas estão mostradas sem os campos de comprimento e especificação de precisão opcionais, e estão substituídos pelos caracteres indicados no resultado da :func:`strftime`:

source: Directive
pt_br: Diretiva

source: Meaning
pt_br: Significado

source: Notes
pt_br: Notas

source: Locale's abbreviated weekday name.
pt_br: Nome abreviado do dia da semana da localidade.

source: Locale's full weekday name.
pt_br: Nome completo do dia da semana da localidade.

source: Locale's abbreviated month name.
pt_br: Nome abreviado do mês da localidade.

source: Locale's full month name.
pt_br: Nome completo do mês da localidade.

source: Locale's appropriate date and time representation.
pt_br: Representação de data e hora apropriada da localidade.

source: Day of the month as a decimal number [01,31].
pt_br: Dia do mês como um número decimal [01,31].

source: Microseconds as a decimal number
pt_br: Microssegundos como um número decimal

source: Hour (24-hour clock) as a decimal number [00,23].
pt_br: Hora (relógio 24 horas) como um número decimal [00,23].

source: Hour (12-hour clock) as a decimal number [01,12].
pt_br: Hora (relógio 12 horas) como um número decimal [01,12].

source: Day of the year as a decimal number [001,366].
pt_br: Dia do ano como um número decimal [001,366].

source: Month as a decimal number [01,12].
pt_br: Mês como um número decimal [01,12].

source: Minute as a decimal number [00,59].
pt_br: Minuto como um número decimal [00,59].

source: Locale's equivalent of either AM or PM.
pt_br: Equivalente da localidade a AM ou PM.

source: Second as a decimal number [00,61].
pt_br: Segundo como um número decimal [00,61].

source: Week number of the year (Sunday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Sunday are considered to be in week 0.
pt_br: Número da semana do ano (domingo como primeiro dia da semana) como um número decimal [00,53]. Todos os dias em um ano novo que precedem o primeiro domingo são considerados como estando na semana 0.

source: Day of the week (Monday is 1; Sunday is 7) as a decimal number [1, 7].
pt_br: Dia da semana (segunda-feira é 1; domingo é 7) como um número decimal [1, 7].

source: Weekday as a decimal number [0(Sunday),6].
pt_br: Dia da semana como um número decimal [0(Domingo),6]

source: Week number of the year (Monday as the first day of the week) as a decimal number [00,53]. All days in a new year preceding the first Monday are considered to be in week 0.
pt_br: Número da semana do ano (segunda-feira como o primeiro dia da semana) como um número decimal [00,53]. Todos os dias do ano que precedem o primeiro domingo serão considerados como estando na semana 0.

source: Locale's appropriate date representation.
pt_br: Representação de data apropriada de localidade.

source: Locale's appropriate time representation.
pt_br: Representação de hora apropriada da localidade.

source: Year without century as a decimal number [00,99].
pt_br: Ano sem século como um número decimal [00,99].

source: Year with century as a decimal number.
pt_br: Ano com século como um número decimal.

source: Time zone offset indicating a positive or negative time difference from UTC/GMT of the form +HHMM or -HHMM, where H represents decimal hour digits and M represents decimal minute digits [-23:59, +23:59]. [1]_
pt_br: Deslocamento de fuso horário indicando uma diferença de tempo positiva ou negativa de UTC/GMT formatado como +HHMM ou -HHMM, onde H representa os dígitos decimais de hora e M representa os dígitos decimais de minuto [-23:59, +23:59]. [1]_

source: Time zone name (no characters if no time zone exists). Deprecated. [1]_
pt_br: Nome do fuso horário (nenhum caractere se nenhum fuso horário existe). Descontinuado. [1]_

source: ISO 8601 year (similar to ``%Y`` but follows the rules for the ISO 8601 calendar year). The year starts with the week that contains the first Thursday of the calendar year.
pt_br: Ano ISO 8601 (semelhante a ``%Y``, mas segue as regras para o ano calendário ISO 8601). O ano começa com a semana que contém a primeira quinta-feira do ano calendário.

source: ISO 8601 week number (as a decimal number [01,53]). The first week of the year is the one that contains the first Thursday of the year. Weeks start on Monday.
pt_br: Número da semana ISO 8601 (como um número decimal [01,53]). A primeira semana do ano é aquela que contém a primeira quinta-feira do ano. As semanas começam na segunda-feira.

source: A literal ``'%'`` character.
pt_br: Um caractere literal ``'%'``.

source: Notes:
pt_br: Notas:

source: The ``%f`` format directive only applies to :func:`strptime`, not to :func:`strftime`. However, see also :meth:`datetime.datetime.strptime` and :meth:`datetime.datetime.strftime` where the ``%f`` format directive :ref:`applies to microseconds <format-codes>`.
pt_br: A diretiva de formatação ``%f`` é somente aplicada para :func:`strptime`, não para :func:`strftime`. Contudo, veja também :meth:`datetime.datetime.strptime` e :meth:`datetime.datetime.strftime` onde a diretiva de formatação ``%f`` :ref:`é aplicada para microssegundos <format-codes>`.

source: When used with the :func:`strptime` function, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
pt_br: Quando utilizado com a função :func:`strptime`, a diretiva ``%p`` apenas afeta a saída do campo se a diretiva ``%I`` é utilizada para analisar a hora.

source: The range really is ``0`` to ``61``; value ``60`` is valid in timestamps representing `leap seconds`_ and value ``61`` is supported for historical reasons.
pt_br: O intervalo é realmente ``0`` até ``61``; o valor ``60`` é válido em registros de data e hora representando `segundos bissextos`_ e o valor ``61`` é suportado por razões históricas.

source: When used with the :func:`strptime` function, ``%U`` and ``%W`` are only used in calculations when the day of the week and the year are specified.
pt_br: Quando utilizado co a função :func:`strptime`, ``%U`` e ``%W`` são utilizados em cálculos apenas quando o dia da semana e ano são especificados.

source: Here is an example, a format for dates compatible with that specified in the :rfc:`2822` Internet email standard. [1]_ ::
pt_br: Veja este exemplo, um formato para datas compatível com as especificações dos padrões de e-mail :rfc:`2822`. [1]_ ::

source: Additional directives may be supported on certain platforms, but only the ones listed here have a meaning standardized by ANSI C. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation.
pt_br: Diretivas adicionais podem ser suportadas por algumas plataformas, mas apenas as listadas aqui possuem significado padronizado por ANSI C. Para ver a lista completa de códigos de formato suportados na sua plataforma, consulte a documentação :manpage:`strftime(3)`.

source: On some platforms, an optional field width and precision specification can immediately follow the initial ``'%'`` of a directive in the following order; this is also not portable. The field width is normally 2 except for ``%j`` where it is 3.
pt_br: Em algumas plataformas, um campo adicional de comprimento e especificação de precisão podem seguir imediatamente após ``'%'`` como uma diretiva da seguinte ordem; isto também não é portátil. O campo comprimento normalmente é 2 exceto para ``%j`` quando é 3.

source: Parse a string representing a time according to a format. The return value is a :class:`struct_time` as returned by :func:`gmtime` or :func:`localtime`.
pt_br: Analisa a string representando um tempo de acordo com um formato. O valor retornado é um :class:`struct_time` como retornado por :func:`gmtime` ou :func:`localtime`.

source: The *format* parameter uses the same directives as those used by :func:`strftime`; it defaults to ``"%a %b %d %H:%M:%S %Y"`` which matches the formatting returned by :func:`ctime`. If *string* cannot be parsed according to *format*, or if it has excess data after parsing, :exc:`ValueError` is raised. The default values used to fill in any missing data when more accurate values cannot be inferred are ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Both *string* and *format* must be strings.
pt_br: O parâmetro *format* utiliza as mesmas diretivas das utilizadas por :func:`strftime`; é definido por padrão para ``"%a %b %d %H:%M:%S %Y"`` que corresponde com a formatação retornada por :func:`ctime`. Se *string* não puder ser analisada de acordo com *format*, ou se possui excesso de dados após analisar, :exc:`ValueError` é levantado. Os valores padrão utilizados para preencher quaisquer dados faltantes quando valores mais precisos não puderem ser inferidos são ``(1900, 1, 1, 0, 0, 0, 0, 1, -1)``. Ambos *string* e *format* devem ser strings.

source: For example:
pt_br: Por exemplo:

source: Support for the ``%Z`` directive is based on the values contained in ``tzname`` and whether ``daylight`` is true. Because of this, it is platform-specific except for recognizing UTC and GMT which are always known (and are considered to be non-daylight savings timezones).
pt_br: Suporte para a diretiva ``%Z`` é baseado nos valores contidos em ``tzname`` e se ``daylight`` é verdade. Por causa disso, é específico de plataforma exceto por reconhecer UTC e GMT, que são sempre conhecidos (e considerados fuso horários sem horários de verão).

source: Only the directives specified in the documentation are supported. Because ``strftime()`` is implemented per platform it can sometimes offer more directives than those listed. But ``strptime()`` is independent of any platform and thus does not necessarily support all directives available that are not documented as supported.
pt_br: Apenas as diretivas especificadas na documentação são suportadas. Como ``strftime()`` é implementada por plataforma, esta pode apenas as vezes oferecer mais diretivas do que as listadas aqui. Mas ``strptime()`` é independente de quaisquer plataformas e portanto não necessariamente suporta todas as diretivas disponíveis que não estão documentadas como suportadas.

source: The type of the time value sequence returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`. It is an object with a :term:`named tuple` interface: values can be accessed by index and by attribute name. The following values are present:
pt_br: O tipo da sequência de valor de tempo retornado por :func:`gmtime`, :func:`localtime`, e :func:`strptime`. É um objeto com uma interface :term:`named tuple`: os valores podem ser acessados por um índice e por um nome de atributo. Os seguintes valores estão presentes:

source: Index
pt_br: Índice

source: Attribute
pt_br: Atributo

source: Values
pt_br: Valores

source: (for example, 1993)
pt_br: (por exemplo, 1993)

source: range [1, 12]
pt_br: intervalo [1,12]

source: range [1, 31]
pt_br: intervalo [1,31]

source: range [0, 23]
pt_br: intervalo [0,23]

source: range [0, 59]
pt_br: intervalo [0,59]

source: range [0, 61]; see :ref:`Note (2) <leap-second>` in :func:`strftime`
pt_br: intervalo [0, 61]; veja :ref:`Nota (2) <leap-second>` em :func:`strftime`

source: range [0, 6]; Monday is 0
pt_br: intervalo [0, 6]; segunda-feira é 0

source: range [1, 366]
pt_br: intervalo [1, 366]

source: 0, 1 or -1; see below
pt_br: 0, 1 ou -1; veja abaixo

source: N/A
pt_br: N/D

source: abbreviation of timezone name
pt_br: abreviação do nome do fuso horário

source: offset east of UTC in seconds
pt_br: deslocamento a leste de UTC em segundos

source: Note that unlike the C structure, the month value is a range of [1, 12], not [0, 11].
pt_br: Note que diferentemente da estrutura C, o valor do mês é um intervalo [1,12] e não [0,11].

source: In calls to :func:`mktime`, :attr:`tm_isdst` may be set to 1 when daylight savings time is in effect, and 0 when it is not. A value of -1 indicates that this is not known, and will usually result in the correct state being filled in.
pt_br: Em chamadas para :func:`mktime`, :attr:`tm_isdst` pode ser definido como 1 quando o horário de verão estiver em efeito, e 0 quando não. Um valor de -1 indica que esta informação não é conhecida, e geralmente resultará no preenchimento do estado correto.

source: When a tuple with an incorrect length is passed to a function expecting a :class:`struct_time`, or having elements of the wrong type, a :exc:`TypeError` is raised.
pt_br: Quando uma tupla com comprimento incorreto é passada para uma função que espera por um :class:`struct_time`, ou por possuir elementos do tipo errado, um :exc:`TypeError` é levantado.

source: Return the time in seconds since the epoch_ as a floating-point number. The handling of `leap seconds`_ is platform dependent. On Windows and most Unix systems, the leap seconds are not counted towards the time in seconds since the epoch_. This is commonly referred to as `Unix time <https://en.wikipedia.org/wiki/Unix_time>`_.
pt_br: Retorna o tempo em segundos desde o epoch_ como um número em ponto flutuante. A manipulação de `segundos bissextos`_ é dependente da plataforma. No Windows e na maioria dos sistemas Unix, o segundo bissexto não é contado para o tempo desde o epoch_. Isso é comumente referido como `epoch ou era Unix <https://en.wikipedia.org/wiki/Unix_time>`_.

source: Note that even though the time is always returned as a floating-point number, not all systems provide time with a better precision than 1 second. While this function normally returns non-decreasing values, it can return a lower value than a previous call if the system clock has been set back between the two calls.
pt_br: Note que mesmo o tempo sendo retornado sempre como um número em ponto flutuante, nem todos os sistemas fornecem o tempo com precisão melhor que 1 segundo. Enquanto esta função normalmente retorna valores não decrescentes, pode retornar valores menores do que os de uma chamada anterior se o relógio do sistema foi redefinido entre duas chamadas.

source: The number returned by :func:`.time` may be converted into a more common time format (i.e. year, month, day, hour, etc...) in UTC by passing it to :func:`gmtime` function or in local time by passing it to the :func:`localtime` function. In both cases a :class:`struct_time` object is returned, from which the components of the calendar date may be accessed as attributes.
pt_br: O número retornado por :func:`.time` pode ser convertido a um formato de tempo mais comum (i.e. ano, mês, dia, hora etc...) em UTC por passá-lo para a função :func:`gmtime` ou em tempo local por passar para a função :func:`localtime`. Em ambos os casos, o objeto :class:`struct_time` é retornado, por onde os componentes de data do calendário podem ser acessados ou atribuídos.

source: On Windows, call ``GetSystemTimeAsFileTime()``.
pt_br: No Windows, chama ``GetSystemTimeAsFileTime()``.

source: Call ``clock_gettime(CLOCK_REALTIME)`` if available.
pt_br: Chama ``clock_gettime(CLOCK_REALTIME)`` se disponível.

source: Otherwise, call ``gettimeofday()``.
pt_br: Caso contrário, chama ``gettimeofday()``.

source: Use :func:`time_ns` to avoid the precision loss caused by the :class:`float` type.
pt_br: Use :func:`time_ns` para evitar perda de precisão causada pelo tipo :class:`float`.

source: Similar to :func:`~time.time` but returns time as an integer number of nanoseconds since the epoch_.
pt_br: Semelhante à :func:`~time.time`, mas retorna o tempo como um número inteiro de nanossegundos desde o epoch_.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current thread. It does not include time elapsed during sleep. It is thread-specific by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls in the same thread is valid.
pt_br: Retorna o valor (em fração de segundos) da soma dos tempos de sistema e CPU de usuário para a thread atual. Não inclui o tempo decorrido durante a pausa. É específico a thread por definição. O ponto de referência do valor retornado é indefinido, então apenas a diferença dos resultados de duas chamadas é válida.

source: Use :func:`thread_time_ns` to avoid the precision loss caused by the :class:`float` type.
pt_br: Use :func:`thread_time_ns` para evitar perda de precisão causada pelo tipo :class:`float`.

source: Unix systems supporting ``CLOCK_THREAD_CPUTIME_ID``.
pt_br: Sistemas Unix possuem suporte para ``CLOCK_THREAD_CPUTIME_ID``.

source: Similar to :func:`thread_time` but return time as nanoseconds.
pt_br: Semelhante à :func:`thread_time`, mas retorna o tempo em nanossegundos.

source: Reset the time conversion rules used by the library routines. The environment variable :envvar:`TZ` specifies how this is done. It will also set the variables ``tzname`` (from the :envvar:`TZ` environment variable), ``timezone`` (non-DST seconds West of UTC), ``altzone`` (DST seconds west of UTC) and ``daylight`` (to 0 if this timezone does not have any daylight saving time rules, or to nonzero if there is a time, past, present or future when daylight saving time applies).
pt_br: Redefine as regras de conversão utilizadas pelas rotinas da biblioteca. A variável de ambiente :envvar:`TZ` especifica como isto é feito. Também irá redefinir as variáveis ``tzname`` (da variável de ambiente :envvar:`TZ`), ``timezone`` (segundos sem horário de verão a oeste de UTC), ``altzone`` (segundos com horário de verão a oeste de UTC) e ``daylight`` (para 0 se este fuso horário não possui nenhuma regra de horário de verão, ou diferente de zero se há um tempo, no presente, passado ou futuro quando o horário de verão se aplica).

source: Although in many cases, changing the :envvar:`TZ` environment variable may affect the output of functions like :func:`localtime` without calling :func:`tzset`, this behavior should not be relied on.
pt_br: Embora em vários casos, alterar a variável de sistema :envvar:`TZ` pode afetar a saída de funções como :func:`localtime` sem chamar :func:`tzset`, este comportamento não deve ser confiado.

source: The :envvar:`TZ` environment variable should contain no whitespace.
pt_br: A variável de sistema :envvar:`TZ` não deve conter espaços em branco.

source: The standard format of the :envvar:`TZ` environment variable is (whitespace added for clarity)::
pt_br: O formato padrão da variável de sistema :envvar:`TZ` é (espaços foram adicionados por motivos de clareza):

source: Where the components are:
pt_br: Onde os componentes são:

source: ``std`` and ``dst``
pt_br: ``std`` e ``dst``

source: Three or more alphanumerics giving the timezone abbreviations. These will be propagated into time.tzname
pt_br: Três ou mais alfanuméricos fornecendo a abreviação do fuso horário. Estes serão propagados para time.tzname

source: The offset has the form: ``± hh[:mm[:ss]]``. This indicates the value added the local time to arrive at UTC. If preceded by a '-', the timezone is east of the Prime Meridian; otherwise, it is west. If no offset follows dst, summer time is assumed to be one hour ahead of standard time.
pt_br: O deslocamento tem a forma: ``± hh[:mm[:ss]]``. Isso indica que o valor adicionado adicionou o horário local para chegar a UTC. Se precedido por um '-', o fuso horário está a leste do Meridiano Primário; do contrário, está a oeste. Se nenhum deslocamento segue o horário de verão, o tempo no verão é presumido como estando uma hora a frente do horário padrão.

source: Indicates when to change to and back from DST. The format of the start and end dates are one of the following:
pt_br: Indica quando mudar e voltar do Horário de Verão. O formato das datas de início e fim é um dos seguintes:

source: The Julian day *n* (1 <= *n* <= 365). Leap days are not counted, so in all years February 28 is day 59 and March 1 is day 60.
pt_br: I dia juliano *n* (1 <= *n* <= 365). Os dias bissextos não são contados, então, em todos os anos, 28 de fevereiro é o dia 59 e 1 de março é o dia 60.

source: The zero-based Julian day (0 <= *n* <= 365). Leap days are counted, and it is possible to refer to February 29.
pt_br: O dia juliano baseado em zero (0 <= *n* <= 365). Dias bissextos são contados, e é possível fazer referência a 29 de fevereiro.

source: The *d*'th day (0 <= *d* <= 6) of week *n* of month *m* of the year (1 <= *n* <= 5, 1 <= *m* <= 12, where week 5 means "the last *d* day in month *m*" which may occur in either the fourth or the fifth week). Week 1 is the first week in which the *d*'th day occurs. Day zero is a Sunday.
pt_br: O *d*-ésimo dia (0 <= *d* <= 6) da semana *n* do mês *m* do ano (1 <= *n* <= 5, 1 <= *m* <= 12, onde semana 5 significa "o último dia *d* no mês *m*" que pode ocorrer tanto na quarta como quinta semana). Semana 1 é a primeira semana na qual o *d*-ésimo dia ocorre. Dia zero é o domingo.
