Repository: python/python-docs-pt-br
Catalog: library/time.po
Languages: pt_br

source: :mod:`!time` --- Time access and conversions
pt_br: :mod:`!time` --- Acesso ao horário e conversões

source: This module provides various time-related functions. For related functionality, see also the :mod:`datetime` and :mod:`calendar` modules.
pt_br: Esse módulo provê várias funções relacionadas à tempo. Para funcionalidades relacionadas veja também os módulos :mod:`datetime` e :mod:`calendar`

source: Although this module is always available, not all functions are available on all platforms. Most of the functions defined in this module call platform C library functions with the same name. It may sometimes be helpful to consult the platform documentation, because the semantics of these functions varies among platforms.
pt_br: Apesar desse módulo sempre estar disponível, nem todas as suas funções estão disponíveis em todas as plataformas. A maioria das funções definidas nesse módulo chamam funções da biblioteca da plataforma de C com mesmo nome. Pode ser útil consultar a documentação da plataforma, pois da semântica dessas funções variam a depender da plataforma.

source: An explanation of some terminology and conventions is in order.
pt_br: A seguir, uma explicação de algumas terminologias e convenções.

source: The :dfn:`epoch` is the point where the time starts, the return value of ``time.gmtime(0)``. It is January 1, 1970, 00:00:00 (UTC) on all platforms.
pt_br: O :dfn:`era` (*epoch*) é o ponto onde o tempo começa, o valor de retorno de ``time.gmtime(0)``. É 1º de janeiro de 1970, 00:00:00 (UTC) em todas as plataformas.

source: The term :dfn:`seconds since the epoch` refers to the total number of elapsed seconds since the epoch, typically excluding `leap seconds`_. Leap seconds are excluded from this total on all POSIX-compliant platforms.
pt_br: O termo :dfn:`segundos desde a era` refere-se ao número total de segundos decorrido desde a era, tipicamente excluindo-se os `segundos bissextos`_. Segundos bissextos são excluídos desse total em todas as plataformas compatíveis com POSIX.

source: The functions in this module may not handle dates and times before the epoch_ or far in the future. The cut-off point in the future is determined by the C library; for 32-bit systems, it is typically in 2038.
pt_br: As funções desse módulo podem não conseguir tratar de datas e horários antes do epoch_ ou muito distantes no futuro. O limite no futuro é determinado pela biblioteca C; para sistemas de 32 bit, geralmente é 2038.

source: Function :func:`strptime` can parse 2-digit years when given ``%y`` format code. When 2-digit years are parsed, they are converted according to the POSIX and ISO C standards: values 69--99 are mapped to 1969--1999, and values 0--68 are mapped to 2000--2068.
pt_br: A função :func:`strptime` pode analisar anos de 2 dígitos quando é passado o código de formato ``%y``. Quando anos de 2 dígitos são analisados, eles são convertidos de acordo com os padrões POSIX e ISO C: valores 69--99 são mapeados para 1969--1999, e valores 0--68 são mapeados para 2000--2068.

source: UTC is `Coordinated Universal Time`_ and superseded `Greenwich Mean Time`_ or GMT as the basis of international timekeeping. The acronym UTC is not a mistake but conforms to an earlier, language-agnostic naming scheme for time standards such as UT0, UT1, and UT2.
pt_br: UTC é `Coordinated Universal Time`_ (em português, Horário Universal Coordenado) e substituiu o GMT ou `Greenwich Mean Time`_ (em português, Horário Médio de Greenwich) como base da cronometragem internacional. A sigla UTC não é um erro, mas está em conformidade com um esquema de nomenclatura anterior, independente de idioma, para padrões de tempo como UT0, UT1 e UT2.

source: DST is Daylight Saving Time, an adjustment of the timezone by (usually) one hour during part of the year. DST rules are magic (determined by local law) and can change from year to year. The C library has a table containing the local rules (often it is read from a system file for flexibility) and is the only source of True Wisdom in this respect.
pt_br: DST é Daylight Saving Time (Horário de Verão), um ajuste de fuso horário por (normalmente) uma hora durante parte do ano. As regras de Horário de Verão são mágicas (determinadas por leis locais) e podem mudar de ano a ano. A biblioteca C possui uma tabela contendo as regras locais (normalmente lidas de um arquivo de sistema por flexibilidade) e nesse contexto é a única fonte de Conhecimento Verdadeiro.

source: The precision of the various real-time functions may be less than suggested by the units in which their value or argument is expressed. E.g. on most Unix systems, the clock "ticks" only 50 or 100 times a second.
pt_br: A precisão de várias funções em tempo real podem ser menores do que o que pode estar sugerido pelas unidades nas quais seu valor ou argumento estão expressos. Por exemplo, na maioria dos sistemas Unix, o relógio "conta" apenas 50 ou 100 vezes por segundo.

source: On the other hand, the precision of :func:`.time` and :func:`sleep` is better than their Unix equivalents: times are expressed as floating-point numbers, :func:`.time` returns the most accurate time available (using Unix :c:func:`!gettimeofday` where available), and :func:`sleep` will accept a time with a nonzero fraction (Unix :c:func:`!select` is used to implement this, where available).
pt_br: Por outro lado, a precisão de :func:`.time` e :func:`sleep` é melhor do que suas equivalentes Unix: tempos são expressos como números em ponto flutuante, :func:`.time` retorna o tempo mais preciso disponível (utilizando :c:func:`!gettimeofday` do Unix, quando disponível) e :func:`sleep` irá aceitar qualquer tempo como uma fração não zero (:c:func:`!select` do Unix é utilizada para implementar isto, quando disponível).

source: The time value as returned by :func:`gmtime`, :func:`localtime`, and :func:`strptime`, and accepted by :func:`asctime`, :func:`mktime` and :func:`strftime`, is a sequence of 9 integers. The return values of :func:`gmtime`, :func:`localtime`, and :func:`strptime` also offer attribute names for individual fields.
pt_br: O valor de tempo conforme retornado pelas :func:`gmtime`, :func:`localtime`, e :func:`strptime`, e aceito pelas :func:`asctime`, :func:`mktime` e :func:`strftime`, é uma sequência de 9 inteiros. Os valores retornados das :func:`gmtime`, :func:`localtime`, e :func:`strptime` também oferecem nomes de atributo para campos individuais.

source: See :class:`struct_time` for a description of these objects.
pt_br: Veja :class:`struct_time` para a descrição desses objetos.

source: The :class:`struct_time` type was extended to provide the :attr:`~struct_time.tm_gmtoff` and :attr:`~struct_time.tm_zone` attributes when platform supports corresponding ``struct tm`` members.
pt_br: O tipo :class:`struct_time` foi estendido para prover os atributos :attr:`~struct_time.tm_gmtoff` e :attr:`~struct_time.tm_zone` quando a plataforma suporta os membros ``struct tm`` correspondentes

source: The :class:`struct_time` attributes :attr:`~struct_time.tm_gmtoff` and :attr:`~struct_time.tm_zone` are now available on all platforms.
pt_br: Os atributos :attr:`~struct_time.tm_gmtoff` e :attr:`~struct_time.tm_zone` da classe :class:`struct_time` estão disponíveis em todas as plataformas agora.

source: Use the following functions to convert between time representations:
pt_br: Utilize as seguintes funções para converter entre representações de tempo:

source: From
pt_br: De

source: To
pt_br: Para

source: Use
pt_br: Utilize

source: seconds since the epoch
pt_br: segundos desde a era

source: :class:`struct_time` in UTC
pt_br: :class:`struct_time` em UTC

source: :class:`struct_time` in local time
pt_br: :class:`struct_time` em tempo local

source: Functions
pt_br: Funções

source: Convert a tuple or :class:`struct_time` representing a time as returned by :func:`gmtime` or :func:`localtime` to a string of the following form: ``'Sun Jun 20 23:21:05 1993'``. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
pt_br: Converte a tupla ou :class:`struct_time` representando um tempo como retornado pela :func:`gmtime` ou :func:`localtime` para uma string com o seguinte formato: ``'Sun Jun 20 23:21:05 1993'``. O campo dia contém dois caracteres e possui espaçamento se o dia é de apenas um dígito. Por exemplo, ``'Wed Jun 9 04:26:40 1993'``.

source: If *t* is not provided, the current time as returned by :func:`localtime` is used. Locale information is not used by :func:`asctime`.
pt_br: Se *t* não é fornecido, o tempo atual como retornado por :func:`localtime` é utilizado. Informação de localidade não é utilizada por :func:`asctime`.

source: Unlike the C function of the same name, :func:`asctime` does not add a trailing newline.
pt_br: Diferentemente da função em C de mesmo nome, :func:`asctime` não adiciona uma nova linha em seguida.

source: Return the *clk_id* of the thread-specific CPU-time clock for the specified *thread_id*.
pt_br: Retorna o *clk_id* do relógio de tempo de CPU específico da thread para a *thread_id* especificada.

source: Use :func:`threading.get_ident` or the :attr:`~threading.Thread.ident` attribute of :class:`threading.Thread` objects to get a suitable value for *thread_id*.
pt_br: Utilize a :func:`threading.get_ident` ou o atributo :attr:`~threading.Thread.ident` dos objetos :class:`threading.Thread` para obter um valor adequado para *thread_id*.

source: Passing an invalid or expired *thread_id* may result in undefined behavior, such as segmentation fault.
pt_br: Passando um *thread_id* inválido ou expirado pode resultar em um comportamento indefinido, como, por exemplo, falha de segmentação.

source: Availability
pt_br: Disponibilidade

source: See the man page for :manpage:`pthread_getcpuclockid(3)` for further information.
pt_br: Veja a página man para :manpage:`pthread_getcpuclockid(3)` para mais informações.

source: Return the resolution (precision) of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
pt_br: Retorna a resolução (precisão) do relógio *clk_id* especificado. Confira :ref:`time-clock-id-constants` para uma lista de valores aceitos para *clk_id*

source: Return the time of the specified clock *clk_id*. Refer to :ref:`time-clock-id-constants` for a list of accepted values for *clk_id*.
pt_br: Retorna o tempo to relógio *clk_id* especificado. Confira :ref:`time-clock-id-constants` para uma lista de valores aceitos para *clk_id*.

source: Use :func:`clock_gettime_ns` to avoid the precision loss caused by the :class:`float` type.
pt_br: Use :func:`clock_gettime_ns` para evitar perda de precisão causada pelo tipo :class:`float`.

source: Similar to :func:`clock_gettime` but return time as nanoseconds.
pt_br: Semelhante à :func:`clock_gettime`, mas retorna o tempo em nanossegundos.

source: Set the time of the specified clock *clk_id*. Currently, :data:`CLOCK_REALTIME` is the only accepted value for *clk_id*.
pt_br: Define o tempo do relógio *clk_id* especificado. Atualmente, :data:`CLOCK_REALTIME` é o único valor aceito para *clk_id*.

source: Use :func:`clock_settime_ns` to avoid the precision loss caused by the :class:`float` type.
pt_br: Use :func:`clock_settime_ns` para evitar perda de precisão causada pelo tipo :class:`float`.

source: Similar to :func:`clock_settime` but set time with nanoseconds.
pt_br: Semelhante à :func:`clock_settime`, mas define o tempo em nanossegundos.

source: Convert a time expressed in seconds since the epoch_ to a string of a form: ``'Sun Jun 20 23:21:05 1993'`` representing local time. The day field is two characters long and is space padded if the day is a single digit, e.g.: ``'Wed Jun 9 04:26:40 1993'``.
pt_br: Converte um tempo expresso em segundos desde o epoch_ para uma string de forma: ``'Sun Jun 20 23:21:05 1993'`` representando tempo local. O campo dia tem comprimento de dois caracteres e é deslocado por um espaço se o dia tem um único dígito. Por exemplo, ``'Wed Jun 9 04:26:40 1993'``.

source: If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. ``ctime(secs)`` is equivalent to ``asctime(localtime(secs))``. Locale information is not used by :func:`ctime`.
pt_br: Se *secs* não é fornecido ou :const:`None`, o tempo atual como retornado por :func:`.time` é utilizado. ``ctime(secs)`` é equivalente a ``asctime(localtime(secs))``. Informação de localidade não é utilizada por :func:`ctime`.

source: Get information on the specified clock as a namespace object. Supported clock names and the corresponding functions to read their value are:
pt_br: Obtém informação do relógio específico como um objeto espaço de nomes. Nomes de relógios suportados e as funções correspondentes para ler seus valores são:

source: The result has the following attributes:
pt_br: O resultado tem os seguintes atributos:

source: *adjustable*: ``True`` if the clock can be changed automatically (e.g. by a NTP daemon) or manually by the system administrator, ``False`` otherwise
pt_br: *adjustable*: ``True`` se o relógio pode ser alterado automaticamente (por exemplo, por um daemon NTP) ou manualmente por um administrador do sistema, ``False`` se contrário

source: *implementation*: The name of the underlying C function used to get the clock value. Refer to :ref:`time-clock-id-constants` for possible values.
pt_br: *implementation*: O nome da função C subjacente utilizada para obter o valor do relógio. Confira :ref:`time-clock-id-constants` para valores possíveis.

source: *monotonic*: ``True`` if the clock cannot go backward, ``False`` otherwise
pt_br: *monotonic*: ``True`` se o relógio não pode retornar a valores anteriores, backward, ``False`` contrário

source: *resolution*: The resolution of the clock in seconds (:class:`float`)
pt_br: *resolution*: A resolução do relógio em segundos (:class:`float`)

source: Convert a time expressed in seconds since the epoch_ to a :class:`struct_time` in UTC in which the dst flag is always zero. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. Fractions of a second are ignored. See above for a description of the :class:`struct_time` object. See :func:`calendar.timegm` for the inverse of this function.
pt_br: Converte um tempo expresso em segundos desde o epoch_ para uma :class:`struct_time` em UTC onde o sinalizador de horário de verão é sempre zero. Se *secs* não é fornecido ou :const:`None`, o tempo atual como retornado por :func:`.time` é utilizado. Frações de segundo são ignoradas. Veja acima para uma descrição do objeto :class:`struct_time`. Veja :func:`calendar.timegm` para o inverso desta função.

source: Like :func:`gmtime` but converts to local time. If *secs* is not provided or :const:`None`, the current time as returned by :func:`.time` is used. The dst flag is set to ``1`` when DST applies to the given time.
pt_br: Como :func:`gmtime`, mas converte para o tempo local. Se *secs* não é fornecido ou :const:`None`, o tempo atual como retornado por :func:`.time` é utilizado. O sinalizador de horário de verão é definido como ``1`` quando o Horário de verão for aplicável para o tempo fornecido.

source: :func:`localtime` may raise :exc:`OverflowError`, if the timestamp is outside the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years between 1970 and 2038.
pt_br: :func:`localtime` pode levantar :exc:`OverflowError`, se o registro de data e hora estiver fora de valores suportados pelas funções :c:func:`localtime` or :c:func:`gmtime` da plataforma C, e :exc:`OSError` no caso de :c:func:`localtime` ou :c:func:`gmtime` falharem. É comum É comum que isso seja restrito a anos de 1970 a 2038.

source: This is the inverse function of :func:`localtime`. Its argument is the :class:`struct_time` or full 9-tuple (since the dst flag is needed; use ``-1`` as the dst flag if it is unknown) which expresses the time in *local* time, not UTC. It returns a floating-point number, for compatibility with :func:`.time`. If the input value cannot be represented as a valid time, either :exc:`OverflowError` or :exc:`ValueError` will be raised (which depends on whether the invalid value is caught by Python or the underlying C libraries). The earliest date for which it can generate a time is platform-dependent.
pt_br: Esta é a função inversa de :func:`localtime`. Seu argumento é a :class:`struct_time` ou uma tupla com 9 itens (sendo o sinalizador de horário de verão necessário; utilize ``-1`` como sinalizador de horário de verão quando este for desconhecido) que expressa o tempo em tempo *local*, não UTC. Retorna um número em ponto flutuante, para ter compatibilidade com :func:`.time`. Se o valor de entrada não puder ser representado como um tempo válido, ou :exc:`OverflowError` ou :exc:`ValueError` serão levantadas (o que irá depender se o valor inválido é capturado pelo Python ou por bibliotecas C subjacentes). A data mais recente para qual um tempo pode ser gerado é dependente da plataforma.

source: Return the value (in fractional seconds) of a monotonic clock, i.e. a clock that cannot go backwards. The clock is not affected by system clock updates. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
pt_br: Retorna o valor (em frações de segundos) de um relógio monotônico, i.e. um relógio que não pode voltar a valores anteriores. O relógio não é afetado por atualizações do relógio do sistema. O ponto de referência do valor retornado é indefinido, portanto apenas a diferença entre os resultados de duas chamadas é válida.

source: Clock:
pt_br: Relógio:

source: On Windows, call ``QueryPerformanceCounter()`` and ``QueryPerformanceFrequency()``.
pt_br: No Windows, chama ``QueryPerformanceCounter()`` e ``QueryPerformanceFrequency()``.

source: On macOS, call ``mach_absolute_time()`` and ``mach_timebase_info()``.
pt_br: No macOS, chama ``mach_absolute_time()`` e ``mach_timebase_info()``.

source: On HP-UX, call ``gethrtime()``.
pt_br: No HP-UX, chama ``gethrtime()``.

source: Call ``clock_gettime(CLOCK_HIGHRES)`` if available.
pt_br: Chama ``clock_gettime(CLOCK_HIGHRES)`` se disponível.

source: Otherwise, call ``clock_gettime(CLOCK_MONOTONIC)``.
pt_br: Do contrário, chama ``clock_gettime(CLOCK_MONOTONIC)``.

source: Use :func:`monotonic_ns` to avoid the precision loss caused by the :class:`float` type.
pt_br: Use :func:`monotonic_ns` para evitar perda de precisão causada pelo tipo :class:`float`.

source: The function is now always available and always system-wide.
pt_br: A função agora é sempre disponível e sempre de todo o sistema.

source: On macOS, the function is now system-wide.
pt_br: No macOS, a função agora é no âmbito do sistema.

source: Similar to :func:`monotonic`, but return time as nanoseconds.
pt_br: Semelhante à :func:`monotonic`, mas retorna tempo em nanossegundos.

source: Return the value (in fractional seconds) of a performance counter, i.e. a clock with the highest available resolution to measure a short duration. It does include time elapsed during sleep and is system-wide. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
pt_br: Retorna o valor (em frações de segundo) de um contador de desempenho, i.e. um relógio com a maior resolução disponível para medir uma duração curta. Inclui o tempo decorrido durante a pausa e é de todo o sistema. O ponto de referência é do valor retornado é indefinido, portanto apenas a diferença entre resultados de duas chamadas é válida.

source: On CPython, use the same clock as :func:`time.monotonic` and is a monotonic clock, i.e. a clock that cannot go backwards.
pt_br: No CPython, use o mesmo relógio que :func:`time.monotonic` e é um relógio monotônico, ou seja, um relógio que não pode retroceder.

source: Use :func:`perf_counter_ns` to avoid the precision loss caused by the :class:`float` type.
pt_br: Use :func:`perf_counter_ns` para evitar perda de precisão causada pelo tipo :class:`float`.

source: On Windows, the function is now system-wide.
pt_br: No Windows, a função agora é no âmbito do sistema.

source: Use the same clock as :func:`time.monotonic`.
pt_br: Usa o mesmo relógio que :func:`time.monotonic`.

source: Similar to :func:`perf_counter`, but return time as nanoseconds.
pt_br: Semelhante à :func:`perf_counter`, mas retorna o tempo em nanossegundos.

source: Return the value (in fractional seconds) of the sum of the system and user CPU time of the current process. It does not include time elapsed during sleep. It is process-wide by definition. The reference point of the returned value is undefined, so that only the difference between the results of two calls is valid.
pt_br: Retorna o valor (em frações de segundo) da soma dos tempos do sistema e CPU de usuário do processo atual. Não inclui o tempo decorrido durante a pausa. É de todo o processo por definição. O ponto de referência do valor retornado é indefinido, então apenas a diferença dos resultados de duas chamadas é válida.

source: Use :func:`process_time_ns` to avoid the precision loss caused by the :class:`float` type.
pt_br: Use :func:`process_time_ns` para evitar perda de precisão causada pelo tipo :class:`float`.

source: Similar to :func:`process_time` but return time as nanoseconds.
pt_br: Semelhante à :func:`process_time`, mas retorna o tempo em nanossegundos.

source: Suspend execution of the calling thread for the given number of seconds. The argument may be a floating-point number to indicate a more precise sleep time.
pt_br: Suspende a execução da thread de chamada por um determinado número de segundos. O argumento pode ser um número de ponto flutuante para indicar um tempo de pausa mais preciso.

source: If the sleep is interrupted by a signal and no exception is raised by the signal handler, the sleep is restarted with a recomputed timeout.
pt_br: Se a pausa for interrompida por um sinal e nenhuma exceção for levantada pelo manipulador de sinal, a pausa será reiniciada com um tempo limite recalculado.

source: The suspension time may be longer than requested by an arbitrary amount, because of the scheduling of other activity in the system.
pt_br: O tempo de suspensão pode ser maior do que o solicitado por um valor arbitrário, devido ao agendamento de outras atividades no sistema.

source: Windows implementation
pt_br: Implementação no Windows

source: On Windows, if *secs* is zero, the thread relinquishes the remainder of its time slice to any other thread that is ready to run. If there are no other threads ready to run, the function returns immediately, and the thread continues execution. On Windows 8.1 and newer the implementation uses a `high-resolution timer <https://learn.microsoft.com/windows-hardware/drivers/kernel/high-resolution-timers>`_ which provides resolution of 100 nanoseconds. If *secs* is zero, ``Sleep(0)`` is used.
pt_br: No Windows, se *secs* é zero, a thread renuncia ao restante de sua fatia de tempo para qualquer outra thread que esteja pronto para executar. Se nenhuma outra thread estiver pronta pra ser executada, a função retorna imediatamente, e a thread continua a execução. No Windows 8.1 e mais novos a implementação usa um `temporizador de alta resolução <https://learn.microsoft.com/windows-hardware/drivers/kernel/high-resolution-timers>`_ que provê uma resolução de 100 nanossegundos. Se *secs* é zero, é usado ``Sleep(0)``.

source: Unix implementation
pt_br: Implementação no Unix

source: Use ``clock_nanosleep()`` if available (resolution: 1 nanosecond);
pt_br: Usa ``clock_nanosleep()`` se disponível (resolução: 1 nanossegundo);
