Repository: python/python-docs-pt-br
Catalog: library/time.po
Languages: pt_br

source: ``time`` has the same format as ``offset`` except that no leading sign ('-' or '+') is allowed. The default, if time is not given, is 02:00:00.
pt_br: ``time`` tem o mesmo formato que ``offset``, exceto que nenhum sinal no início é permitido ('-' ou '+'). O padrão, se o tempo não é dado, é 02:00:00.

source: On many Unix systems (including \*BSD, Linux, Solaris, and Darwin), it is more convenient to use the system's zoneinfo (:manpage:`tzfile(5)`) database to specify the timezone rules. To do this, set the :envvar:`TZ` environment variable to the path of the required timezone datafile, relative to the root of the systems 'zoneinfo' timezone database, usually located at :file:`/usr/share/zoneinfo`. For example, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` or ``'Europe/Amsterdam'``. ::
pt_br: Em muitos sistemas Unix (incluindo \*BSD, Linux, Solaris, e Darwin), é mais conveniente utilizar o banco de dados de informação de fuso do sistema (:manpage:`tzfile(5)`) para especificar as regras de fuso horário. Para fazer isso, defina a variável de sistema :envvar:`TZ` ao path do arquivo de dados requerido de fuso horários, relativo à raiz do banco de dados de fuso horário 'zoneinfo' do sistema, geralmente encontrado em :file:`/usr/share/zoneinfo`. Por exemplo, ``'US/Eastern'``, ``'Australia/Melbourne'``, ``'Egypt'`` ou ``'Europe/Amsterdam'``. ::

source: Clock ID Constants
pt_br: Constantes de ID de Relógio

source: These constants are used as parameters for :func:`clock_getres` and :func:`clock_gettime`.
pt_br: Essas constantes são utilizadas como parâmetros para :func:`clock_getres` e :func:`clock_gettime`.

source: Identical to :data:`CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
pt_br: Idêntica a :data:`CLOCK_MONOTONIC`, exceto por também incluir qualquer tempo que o sistema está suspenso.

source: This allows applications to get a suspend-aware monotonic clock without having to deal with the complications of :data:`CLOCK_REALTIME`, which may have discontinuities if the time is changed using ``settimeofday()`` or similar.
pt_br: Isto permite que aplicações recebam um relógio monotônico consciente suspenso sem precisar lidar com as complicações de :data:`CLOCK_REALTIME`, que pode conter descontinuidades se o tempo é alterado utilizando ``settimeofday()`` ou algo semelhante.

source: The Solaris OS has a ``CLOCK_HIGHRES`` timer that attempts to use an optimal hardware source, and may give close to nanosecond resolution. ``CLOCK_HIGHRES`` is the nonadjustable, high-resolution clock.
pt_br: O Solaris OS possui um timer ``CLOCK_HIGHRES`` que tenta utilizar recursos otimizados do hardware, e pode fornecer resolução perto de nanossegundos. ``CLOCK_HIGHRES`` é o relógio nanoajustável de alta resolução.

source: Clock that cannot be set and represents monotonic time since some unspecified starting point.
pt_br: Relógio que não pode ser definido e representa um tempo monotônico desde um ponto de início não especificado.

source: Similar to :data:`CLOCK_MONOTONIC`, but provides access to a raw hardware-based time that is not subject to NTP adjustments.
pt_br: Semelhante à :data:`CLOCK_MONOTONIC`, mas fornece acesso a um tempo bruto baseado em hardware que não está sujeito a ajustes NTP.

source: Similar to :data:`CLOCK_MONOTONIC_RAW`, but reads a value cached by the system at context switch and hence has less accuracy.
pt_br: Semelhante a :data:`CLOCK_MONOTONIC_RAW`, mas lê um armazenado pelo sistema no gerenciador de contexto e, portanto, tem menor precisão.

source: High-resolution per-process timer from the CPU.
pt_br: Timer de alta resolução por processo no CPU.

source: `International Atomic Time <https://www.nist.gov/pml/time-and-frequency-division/nist-time-frequently-asked-questions-faq#tai>`_
pt_br: `Tempo Atômico Internacional <https://www.nist.gov/pml/time-and-frequency-division/nist-time-frequently-asked-questions-faq#tai>`_

source: The system must have a current leap second table in order for this to give the correct answer. PTP or NTP software can maintain a leap second table.
pt_br: O sistema deve ter uma tabela de segundos bissextos para que possa fornecer a resposta correta. Softwares PTP ou NTP podem manter uma tabela de segundos bissextos.

source: Thread-specific CPU-time clock.
pt_br: Relógio de tempo de CPU específico a thread.

source: Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement, both absolute and interval.
pt_br: Tempo cujo valor absoluto é o tempo que o sistema está sendo executado e não suspenso, fornecendo medidas de tempo de atividade precisas, tanto em valor absoluto quanto intervalo.

source: Clock that increments monotonically, tracking the time since an arbitrary point, unaffected by frequency or time adjustments and not incremented while the system is asleep.
pt_br: Relógio que incrementa de forma monotônica, contando o tempo desde um ponto arbitrário, não afetado pela frequência ou ajustes de tempo e não incrementado enquanto o sistema está dormindo.

source: Like :data:`CLOCK_UPTIME_RAW`, but the value is cached by the system at context switches and therefore has less accuracy.
pt_br: Semelhante a :data:`CLOCK_UPTIME_RAW`, mas o valor é armazenado pelo sistema no gerenciador de contexto e, portanto, tem menor precisão.

source: The following constant is the only parameter that can be sent to :func:`clock_settime`.
pt_br: A constante a seguir é o único parâmetro que pode ser enviado para :func:`clock_settime`.

source: System-wide real-time clock. Setting this clock requires appropriate privileges.
pt_br: Relógio em tempo real de todo o sistema. Definições deste relógio requerem privilégios apropriados.

source: Timezone Constants
pt_br: Constantes de Fuso Horário

source: The offset of the local DST timezone, in seconds west of UTC, if one is defined. This is negative if the local DST timezone is east of UTC (as in Western Europe, including the UK). Only use this if ``daylight`` is nonzero. See note below.
pt_br: O deslocamento do fuso horário DST local, em segundos a oeste de UTC, se algum for fornecido. É negativo se o fuso horário DST local está a leste de UTC (como na Europa Ocidental, incluindo o Reino Unido). Somente utilize se ``daylight`` for diferente de zero. Veja a nota abaixo.

source: Nonzero if a DST timezone is defined. See note below.
pt_br: Diferente de zero se um fuso horário DST é definido. Veja nota abaixo.

source: The offset of the local (non-DST) timezone, in seconds west of UTC (negative in most of Western Europe, positive in the US, zero in the UK). See note below.
pt_br: O deslocamento para o fuso horário local (não DST), em segundos a oeste de UTC (negativo na maior parte da Europa Ocidental, positivo nos Estados Unidos e Brasil, zero no Reino Unido). Ver nota abaixo.

source: A tuple of two strings: the first is the name of the local non-DST timezone, the second is the name of the local DST timezone. If no DST timezone is defined, the second string should not be used. See note below.
pt_br: A tupla de duas strings: A primeira é o nome do fuso horário local não DST, a segunda é o nome do fuso horário local DST. Se nenhum fuso horário DST for definido, a segunda string é usada. Veja nota abaixo.

source: For the above Timezone constants (:data:`altzone`, :data:`daylight`, :data:`timezone`, and :data:`tzname`), the value is determined by the timezone rules in effect at module load time or the last time :func:`tzset` is called and may be incorrect for times in the past. It is recommended to use the :attr:`~struct_time.tm_gmtoff` and :attr:`~struct_time.tm_zone` results from :func:`localtime` to obtain timezone information.
pt_br: Para as constantes de Fuso Horário acima (:data:`altzone`, :data:`daylight`, :data:`timezone`, e :data:`tzname`), o valor é determinado pelas regras de fuso horário em efeito no módulo de carregamento de tempo ou a última vez que :func:`tzset` é chamada e pode estar incorreto para tempos no passado. É recomendado utilizar os resultados :attr:`~struct_time.tm_gmtoff` e :attr:`~struct_time.tm_zone` da :func:`localtime` para obter informação de fuso horário.

source: Module :mod:`datetime`
pt_br: Módulo :mod:`datetime`

source: More object-oriented interface to dates and times.
pt_br: Mais interfaces orientada a objetos para datas e tempos.

source: Module :mod:`locale`
pt_br: Módulo :mod:`locale`

source: Internationalization services. The locale setting affects the interpretation of many format specifiers in :func:`strftime` and :func:`strptime`.
pt_br: Serviços de internacionalização. A configuração de localidade afeta a interpretação de muitos especificadores de formato em :func:`strftime` e :func:`strptime`.

source: Module :mod:`calendar`
pt_br: Módulo :mod:`calendar`

source: General calendar-related functions. :func:`~calendar.timegm` is the inverse of :func:`gmtime` from this module.
pt_br: Funções gerais relacionadas a calendários. :func:`~calendar.timegm` é a função inversa de :func:`gmtime` deste módulo.

source: Footnotes
pt_br: Notas de rodapé

source: The use of ``%Z`` is now deprecated, but the ``%z`` escape that expands to the preferred hour/minute offset is not supported by all ANSI C libraries. Also, a strict reading of the original 1982 :rfc:`822` standard calls for a two-digit year (``%y`` rather than ``%Y``), but practice moved to 4-digit years long before the year 2000. After that, :rfc:`822` became obsolete and the 4-digit year has been first recommended by :rfc:`1123` and then mandated by :rfc:`2822`.
pt_br: A utilização de ``%Z`` está descontinuada, mas o escape ``%z`` que expande para um deslocamento hora/minuto preferido não é suportado por todas as bibliotecas ANSI C. Além disso, a leitura do padrão original :rfc:`822` de 1982 mostra que este pede um ano com dois dígitos (``%y`` em vez de ``%Y``), mas a prática consolidou a utilização de anos com 4 dígitos mesmo antes dos anos 2000. Após isso, o :rfc:`822` tornou-se obsoleto e o ano de 4 dígitos foi primeiro recomendado por :rfc:`1123` e depois obrigatório por :rfc:`2822`.

source: epoch
pt_br: era

source: Year 2038
pt_br: Ano 2038

source: 2-digit years
pt_br: Anos de 2 dígitos

source: Coordinated Universal Time
pt_br: Tempo Universal Coordenado

source: Greenwich Mean Time
pt_br: Tempo Médio de Greenwich

source: Daylight Saving Time
pt_br: Horário de verão

source: CPU time
pt_br: tempo da CPU

source: processor time
pt_br: tempo do processador

source: % (percent)
pt_br: % (porcentagem)

source: datetime format
pt_br: datetime, formato
