Repository: python/python-docs-pt-br
Catalog: library/tkinter.po
Languages: pt_br

source: :mod:`!tkinter` --- Python interface to Tcl/Tk
pt_br: :mod:`!tkinter` --- Interface Python para Tcl/Tk

source: **Source code:** :source:`Lib/tkinter/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/tkinter/__init__.py`

source: The :mod:`tkinter` package ("Tk interface") is the standard Python interface to the Tcl/Tk GUI toolkit. Both Tk and :mod:`tkinter` are available on most Unix platforms, including macOS, as well as on Windows systems.
pt_br: O pacote :mod:`tkinter` ("Tk interface") é a interface padrão do Python e faz parte do kit de ferramentas Tcl/Tk GUI. Tanto o Tk quanto o :mod:`tkinter` estão disponíveis na maioria das plataformas Unix, incluindo macOS, bem como em sistemas Windows.

source: Running ``python -m tkinter`` from the command line should open a window demonstrating a simple Tk interface, letting you know that :mod:`tkinter` is properly installed on your system, and also showing what version of Tcl/Tk is installed, so you can read the Tcl/Tk documentation specific to that version.
pt_br: Executar ``python -m tkinter`` na linha de comando deve abrir uma janela demonstrando uma interface Tk simples, informando que :mod:`tkinter` está apropriadamente instalado em seu sistema, e também mostrando qual versão do Tcl/Tk está instalado, para que você possa ler a documentação do Tcl/Tk específica para essa versão.

source: Tkinter supports a range of Tcl/Tk versions, built either with or without thread support. The official Python binary release bundles Tcl/Tk 8.6 threaded. See the source code for the :mod:`_tkinter` module for more information about supported versions.
pt_br: Tkinter tem suporte a uma gama de versões Tcl/Tk, compiladas com ou sem suporte a thread. O lançamento oficial do binário Python agrupa Tcl/Tk 8.6 em thread. Veja o código-fonte do módulo :mod:`_tkinter` para mais informações sobre as versões suportadas.

source: Tkinter is not a thin wrapper, but adds a fair amount of its own logic to make the experience more pythonic. This documentation will concentrate on these additions and changes, and refer to the official Tcl/Tk documentation for details that are unchanged.
pt_br: O Tkinter não é um invólucro fino, mas adiciona uma boa quantidade de sua própria lógica para tornar a experiência mais pythônica. Esta documentação se concentrará nessas adições e mudanças, e consulte a documentação oficial do Tcl/Tk para detalhes que não foram alterados.

source: Tcl/Tk 8.5 (2007) introduced a modern set of themed user interface components along with a new API to use them. Both old and new APIs are still available. Most documentation you will find online still uses the old API and can be woefully outdated.
pt_br: Tcl/Tk 8.5 (2007) introduziu um conjunto moderno de componentes de interface de usuário para ser usados com a nova API. As APIs antigas e novas ainda estão disponíveis. A maioria da documentação que você encontrará online ainda usa a API antiga e pode estar desatualizada.

source: Extensive tutorial on creating user interfaces with Tkinter. Explains key concepts, and illustrates recommended approaches using the modern API.
pt_br: Um extenso tutorial sobre como criar interfaces de usuário com o Tkinter. Explica conceitos chave, e ilustra as abordagens recomendadas usando a API moderna.

source: `Tkinter 8.5 reference: a GUI for Python <https://www.tkdocs.com/shipman/>`_
pt_br: `Referência do Tkinter 8.5: uma GUI para Python <https://www.tkdocs.com/shipman/'>`_

source: Reference documentation for Tkinter 8.5 detailing available classes, methods, and options.
pt_br: Documentação de referência para Tkinter 8.5 detalhando classes, métodos e opções disponíveis.

source: Tcl/Tk Resources:
pt_br: Recursos Tcl/Tk:

source: `Tk commands <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_
pt_br: `Comandos Tk <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_

source: Comprehensive reference to each of the underlying Tcl/Tk commands used by Tkinter.
pt_br: Referência abrangente para cada um dos comandos Tcl/Tk subjacentes usados pelo Tkinter.

source: `Tcl/Tk Home Page <https://www.tcl.tk>`_
pt_br: `Tcl/Tk Website <https://www.tcl.tk>`_

source: Additional documentation, and links to Tcl/Tk core development.
pt_br: Documentação adicional e links para o desenvolvimento do core do Tcl/Tk.

source: Books:
pt_br: Livros:

source: By Mark Roseman. (ISBN 978-1999149567)
pt_br: Por Mark Roseman. (ISBN 978-1999149567)

source: `Python GUI programming with Tkinter <https://www.packtpub.com/en-us/product/python-gui-programming-with-tkinter-9781788835886>`_
pt_br: `Python GUI programming with Tkinter <https://www.packtpub.com/en-br/product/python-gui-programming-with-tkinter-9781788835886>`_

source: By Alan D. Moore. (ISBN 978-1788835886)
pt_br: por Alan D. Moore. (ISBN 978-1788835886)

source: By Mark Lutz; has excellent coverage of Tkinter. (ISBN 978-0596158101)
pt_br: Por Mark Lutz; tem uma excelente cobertura sobre o Tkinter. (ISBN 978-0596158101)

source: By John Ousterhout, inventor of Tcl/Tk, and Ken Jones; does not cover Tkinter. (ISBN 978-0321336330)
pt_br: Por John Ousterhout, criador do Tcl/Tk, e Ken Jones; não cobre o Tkinter. (ISBN 978-0321336330)

source: Architecture
pt_br: Arquitetura

source: Tcl/Tk is not a single library but rather consists of a few distinct modules, each with separate functionality and its own official documentation. Python's binary releases also ship an add-on module together with it.
pt_br: Tcl/Tk não é uma biblioteca única mas consiste em alguns módulos distintos, cada um com sua própria funcionalidade e sua própria documentação oficial. As versões binárias do Python também incluem um módulo adicional junto com ele.

source: Tcl is a dynamic interpreted programming language, just like Python. Though it can be used on its own as a general-purpose programming language, it is most commonly embedded into C applications as a scripting engine or an interface to the Tk toolkit. The Tcl library has a C interface to create and manage one or more instances of a Tcl interpreter, run Tcl commands and scripts in those instances, and add custom commands implemented in either Tcl or C. Each interpreter has an event queue, and there are facilities to send events to it and process them. Unlike Python, Tcl's execution model is designed around cooperative multitasking, and Tkinter bridges this difference (see `Threading model`_ for details).
pt_br: Tcl é uma linguagem de programação interpretada dinâmica, assim como Python. Embora possa ser usado sozinho como uma linguagem de programação de propósito geral, é mais comumente embutido em aplicativos C como um mecanismo de script ou uma interface para o kit de ferramentas Tk. A biblioteca Tcl tem uma interface C para criar e gerenciar uma ou mais instâncias de um interpretador Tcl, executar comandos e scripts Tcl nessas instâncias e adicionar comandos personalizados implementados em Tcl ou C. Cada interpretador tem uma fila de eventos, e há instalações para enviar eventos e processá-los. Ao contrário do Python, o modelo de execução do Tcl é projetado em torno da multitarefa cooperativa, e o Tkinter faz a ponte entre essa diferença (veja `Modelo de threading`_ para detalhes).

source: Tk is a `Tcl package <https://wiki.tcl-lang.org/37432>`_ implemented in C that adds custom commands to create and manipulate GUI widgets. Each :class:`Tk` object embeds its own Tcl interpreter instance with Tk loaded into it. Tk's widgets are very customizable, though at the cost of a dated appearance. Tk uses Tcl's event queue to generate and process GUI events.
pt_br: Tk é um `pacote Tcl <https://wiki.tcl-lang.org/37432>`_ implementado em C que adiciona comandos personalizados para criar e manipular widgets GUI. Cada objeto :class:`Tk` incorpora sua própria instância do interpretador Tcl com Tk carregado nele. Os widgets do Tk são muito personalizáveis, embora ao custo de uma aparência desatualizada. Tk usa a fila de eventos do Tcl para gerar e processar eventos da GUI.

source: Themed Tk (Ttk) is a newer family of Tk widgets that provide a much better appearance on different platforms than many of the classic Tk widgets. Ttk is distributed as part of Tk, starting with Tk version 8.5. Python bindings are provided in a separate module, :mod:`tkinter.ttk`.
pt_br: Themed Tk (Ttk) é uma família mais recente de widgets Tk que fornecem uma aparência muito melhor em diferentes plataformas do que muitos dos widgets Tk clássicos. O Ttk é distribuído como parte do Tk, começando com o Tk versão 8.5. As ligações Python são fornecidas em um módulo separado, :mod:`tkinter.ttk`.

source: Internally, Tk and Ttk use facilities of the underlying operating system, i.e., Xlib on Unix/X11, Cocoa on macOS, GDI on Windows.
pt_br: Internamente, Tk e Ttk usam recursos do sistema operacional, ou seja, Xlib no Unix/X11, Cocoa no macOS, GDI no Windows.

source: When your Python application uses a class in Tkinter, e.g., to create a widget, the :mod:`tkinter` module first assembles a Tcl/Tk command string. It passes that Tcl command string to an internal :mod:`_tkinter` binary module, which then calls the Tcl interpreter to evaluate it. The Tcl interpreter will then call into the Tk and/or Ttk packages, which will in turn make calls to Xlib, Cocoa, or GDI.
pt_br: Quando sua aplicação Python usa uma classe do Tkinter, por exemplo, para criar um widget, o módulo :mod:`tkinter` primeiro monta uma sequência de comando Tcl/Tk. Ele passa essa sequência de comando Tcl para um módulo binário interno :mod:`_tkinter`, que então chama o interpretador Tcl para avaliá-lo. O interpretador Tcl então chamará os pacotes Tk e/ou Ttk, que por sua vez farão chamadas para Xlib, Cocoa ou GDI.

source: Tkinter Modules
pt_br: Módulos Tkinter

source: Support for Tkinter is spread across several modules. Most applications will need the main :mod:`tkinter` module, as well as the :mod:`tkinter.ttk` module, which provides the modern themed widget set and API::
pt_br: O suporte para Tkinter está espalhado por vários módulos. A maioria dos aplicativos precisará do módulo :mod:`tkinter` principal, bem como do módulo :mod:`tkinter.ttk`, que fornece o conjunto de widgets temáticos modernos e a API::

source: Construct a toplevel Tk widget, which is usually the main window of an application, and initialize a Tcl interpreter for this widget. Each instance has its own associated Tcl interpreter.
pt_br: Construa um Tk widget de alto nível, sendo esse, geralmente, a janela principal de uma aplicação, e inicialize um interpretador Tcl para esse widget. Cada instância tem seu próprio interpretador Tcl associado.

source: The :class:`Tk` class is typically instantiated using all default values. However, the following keyword arguments are currently recognized:
pt_br: A classe :class:`Tk` normalmente é instanciada usando todos os valores padrão. No entanto, os seguintes argumentos nomeados são reconhecidos atualmente:

source: When given (as a string), sets the :envvar:`DISPLAY` environment variable. (X11 only)
pt_br: Quando fornecido (como uma string), define a variável de ambiente :envvar:`DISPLAY`. (Somente X11)

source: Name of the profile file. By default, *baseName* is derived from the program name (``sys.argv[0]``).
pt_br: Nome do arquivo de perfil. Por padrão, *baseName* é derivado do nome do programa (``sys.argv[0]``).

source: Name of the widget class. Used as a profile file and also as the name with which Tcl is invoked (*argv0* in *interp*).
pt_br: Nome da classe widget. Usado como um arquivo de perfil e também como o nome com o qual Tcl é invocado (*argv0* em *interp*).

source: If ``True``, initialize the Tk subsystem. The :func:`tkinter.Tcl() <Tcl>` function sets this to ``False``.
pt_br: Se ``True``, inicialize o subsistema Tk. A função :func:`tkinter.Tcl() <Tcl>` define isso como ``False``.

source: If ``True``, execute all X server commands synchronously, so that errors are reported immediately. Can be used for debugging. (X11 only)
pt_br: Se ``True``, execute todos os comandos do servidor X de forma síncrona, para que os erros sejam relatados imediatamente. Pode ser usado para depuração. (Somente X11)

source: Specifies the *id* of the window in which to embed the application, instead of it being created as an independent toplevel window. *id* must be specified in the same way as the value for the -use option for toplevel widgets (that is, it has a form like that returned by :meth:`winfo_id`).
pt_br: Especifica o *id* da janela na qual inserir a aplicação, em vez de criá-la como uma janela de nível superior separada. O *id* deve ser especificado da mesma forma que o valor da opção -use para widgets de nível superior (ou seja, tem um formato como o retornado por :meth:`winfo_id`).

source: Note that on some platforms this will only work correctly if *id* refers to a Tk frame or toplevel that has its -container option enabled.
pt_br: Observe que em algumas plataformas isso só funcionará corretamente se *id* se referir a um frame Tk ou nível superior que tenha sua opção -container habilitada.

source: :class:`Tk` reads and interprets profile files, named :file:`.{className}.tcl` and :file:`.{baseName}.tcl`, into the Tcl interpreter and calls :func:`exec` on the contents of :file:`.{className}.py` and :file:`.{baseName}.py`. The path for the profile files is the :envvar:`HOME` environment variable or, if that isn't defined, then :data:`os.curdir`.
pt_br: :class:`Tk` lê e interpreta os arquivos de perfil, chamados :file:`.{className}.tcl` e :file:`.{baseName}.tcl`, por meio do interpretador Tcl e chama :func:`exec` no conteúdo de :file:`.{className}.py` e :file:`.{baseName}.py`. O caminho para os arquivos de perfil encontra-se na variável de ambiente :envvar:`HOME` ou, se não estiver definida, então :data:`os.curdir`.

source: The Tk application object created by instantiating :class:`Tk`. This provides access to the Tcl interpreter. Each widget that is attached the same instance of :class:`Tk` has the same value for its :attr:`tk` attribute.
pt_br: Objeto da aplicação Tk criado ao instanciar :class:`Tk`. Isso fornece acesso ao interpretador Tcl. Cada widget anexado à mesma instância de :class:`Tk` tem o mesmo valor para o atributo :attr:`tk`.

source: The widget object that contains this widget. For :class:`Tk`, the *master* is :const:`None` because it is the main window. The terms *master* and *parent* are similar and sometimes used interchangeably as argument names; however, calling :meth:`winfo_parent` returns a string of the widget name whereas :attr:`master` returns the object. *parent*/*child* reflects the tree-like relationship while *master*/*slave* reflects the container structure.
pt_br: O objeto widget que contém este widget. Para :class:`Tk`, o *master* é :const:`None` porque é a janela principal. Os termos *master* e *parent* são semelhantes e às vezes usados alternadamente como nome de argumento; No entanto, chamar :meth:`winfo_parent` retorna uma string com o nome do widget enquanto :attr:`master` retorna o objeto. *parent*/*child* reflete a relação de árvore enquanto *master*/*slave* reflete a estrutura do contêiner.

source: The immediate descendants of this widget as a :class:`dict` with the child widget names as the keys and the child instance objects as the values.
pt_br: Descendentes diretos deste widget como um :class:`dict` com os nomes do widget filho como a chave e os objetos de instância filho como o valor.

source: The :func:`Tcl` function is a factory function which creates an object much like that created by the :class:`Tk` class, except that it does not initialize the Tk subsystem. This is most often useful when driving the Tcl interpreter in an environment where one doesn't want to create extraneous toplevel windows, or where one cannot (such as Unix/Linux systems without an X server). An object created by the :func:`Tcl` object can have a Toplevel window created (and the Tk subsystem initialized) by calling its :meth:`loadtk` method.
pt_br: A função :func:`Tcl` é uma função fábrica que cria um objeto assim como o criado pela classe :class:`Tk`, exceto por não inicializar o subsistema Tk. Isto é útil quando executando o interpretador Tcl em um ambiente onde não se quer criar janelas de alto nível externas, ou quando não se pode (como em sistemas Unix/Linux sem um servidor X). Um objeto criado pelo objeto :func:`Tcl` pode ter uma janela de alto nível criada (e o subsistema Tk inicializado) chamando o método :meth:`loadtk`.

source: The modules that provide Tk support include:
pt_br: Os módulos que fornecem suporte ao Tk incluem:

source: Main Tkinter module.
pt_br: Módulo principal Tkinter.

source: Dialog to let the user choose a color.
pt_br: Caixa de diálogo para permitir que o usuário escolha uma cor.

source: Base class for the dialogs defined in the other modules listed here.
pt_br: Classe base para os diálogos definidos nos outros módulos listados aqui.

source: Common dialogs to allow the user to specify a file to open or save.
pt_br: Diálogos comuns para permitir ao usuário especificar um arquivo para abrir ou salvar.

source: Utilities to help work with fonts.
pt_br: Utilitários para ajudar a trabalhar com fontes.

source: Access to standard Tk dialog boxes.
pt_br: Acesso às caixas de diálogo padrão do Tk.

source: Text widget with a vertical scroll bar built in.
pt_br: Componente de texto com uma barra de rolagem vertical integrada.

source: Basic dialogs and convenience functions.
pt_br: Diálogos básicos e funções de conveniência.

source: Themed widget set introduced in Tk 8.5, providing modern alternatives for many of the classic widgets in the main :mod:`tkinter` module.
pt_br: Conjunto de widgets temáticos introduzidos no Tk 8.5, fornecendo alternativas modernas para muitos dos widgets clássicos no módulo principal :mod:`tkinter`.

source: Additional modules:
pt_br: Módulos adicionais:

source: A binary module that contains the low-level interface to Tcl/Tk. It is automatically imported by the main :mod:`tkinter` module, and should never be used directly by application programmers. It is usually a shared library (or DLL), but might in some cases be statically linked with the Python interpreter.
pt_br: Um módulo binário que contém a interface de baixo nível para Tcl/Tk. Ele é importado automaticamente pelo módulo principal :mod:`tkinter` e nunca deve ser usado diretamente. Geralmente é uma biblioteca compartilhada (ou DLL), mas pode, em alguns casos, ser vinculada estaticamente ao interpretador Python.

source: Python's Integrated Development and Learning Environment (IDLE). Based on :mod:`tkinter`.
pt_br: Ambiente Integrado de Desenvolvimento e Aprendizagem do Python (IDLE). Baseado em :mod:`tkinter`.

source: Symbolic constants that can be used in place of strings when passing various parameters to Tkinter calls. Automatically imported by the main :mod:`tkinter` module.
pt_br: Constantes simbólicas que podem ser usadas no lugar de strings ao passar vários parâmetros para chamadas Tkinter. Este módulo é importado automaticamente pelo módulo principal :mod:`tkinter`.

source: (experimental) Drag-and-drop support for :mod:`tkinter`. This will become deprecated when it is replaced with the Tk DND.
pt_br: (experimental) Suporte de arrastar e soltar para :mod:`tkinter`. Será descontinuado quando for substituído pelo Tk DND.

source: Turtle graphics in a Tk window.
pt_br: Gráficos tartaruga em uma janela Tk.

source: Tkinter Life Preserver
pt_br: Preservador de vida Tkinter

source: This section is not designed to be an exhaustive tutorial on either Tk or Tkinter. For that, refer to one of the external resources noted earlier. Instead, this section provides a very quick orientation to what a Tkinter application looks like, identifies foundational Tk concepts, and explains how the Tkinter wrapper is structured.
pt_br: Esta seção não foi projetada para ser um tutorial exaustivo sobre Tk ou Tkinter. Para isso, consulte um dos recursos externos mencionados anteriormente. Em vez disso, esta seção fornece uma orientação muito rápida sobre como é uma aplicação Tkinter, identifica os conceitos fundamentais do Tk e explica como o wrapper do Tkinter é estruturado.

source: The remainder of this section will help you to identify the classes, methods, and options you'll need in your Tkinter application, and where to find more detailed documentation on them, including in the official Tcl/Tk reference manual.
pt_br: O restante desta seção ajudará a identificar as classes, métodos e opções que você precisará em uma aplicação Tkinter e onde encontrar documentação mais detalhada sobre isso, inclusive no guia de referência oficial do Tcl/Tk.

source: A Hello World Program
pt_br: Um programa Olá Mundo

source: We'll start by walking through a "Hello World" application in Tkinter. This isn't the smallest one we could write, but has enough to illustrate some key concepts you'll need to know.
pt_br: Começaremos a explorar o Tkinter através de uma simples aplicação "Hello World". Esta não é a menor aplicação que poderíamos escrever, mas tem o suficiente para ilustrar alguns conceitos-chave que você precisa saber.

source: After the imports, the next line creates an instance of the :class:`Tk` class, which initializes Tk and creates its associated Tcl interpreter. It also creates a toplevel window, known as the root window, which serves as the main window of the application.
pt_br: Após as importações, a próxima linha será criar a instância da classe :class:`Tk` que inicia Tk e cria o interpretador associado a Tcl. Ele também cria uma janela de nível superior, conhecida como janela raiz, que serve como a janela principal da aplicação.

source: The following line creates a frame widget, which in this case will contain a label and a button we'll create next. The frame is fit inside the root window.
pt_br: A linha a seguir cria um frame widget , que neste caso conterá um rótulo e um botão que criaremos a seguir. O frame se encaixa dentro da janela raiz.

source: The next line creates a label widget holding a static text string. The :meth:`grid` method is used to specify the relative layout (position) of the label within its containing frame widget, similar to how tables in HTML work.
pt_br: A próxima linha cria um rótulo widget contendo uma string de texto estático. O método :meth:`grid` é utilizado para especificar o layout relativo (posição) do rótulo dentro do frame widget, semelhante a como as tabelas em HTML funcionam.

source: A button widget is then created, and placed to the right of the label. When pressed, it will call the :meth:`destroy` method of the root window.
pt_br: Então um widget de botão é criado, e posicionado à direita do rótulo. Quando pressionado, irá chamar o método :meth:`destroy` da janela raiz.

source: Finally, the :meth:`mainloop` method puts everything on the display, and responds to user input until the program terminates.
pt_br: Por fim, o método :meth:`destroy` coloca tudo no display, e responde à entrada do usuário até que o programa termine.

source: Important Tk Concepts
pt_br: Conceitos importantes do Tk

source: Even this simple program illustrates the following key Tk concepts:
pt_br: Mesmo com este programa simples, os conceitos-chave do Tk podem ser mostrados:

source: A Tkinter user interface is made up of individual *widgets*. Each widget is represented as a Python object, instantiated from classes like :class:`ttk.Frame`, :class:`ttk.Label`, and :class:`ttk.Button`.
pt_br: A interface de usuário do Tkinter é composta de *widgets* individuais. Cada widget é representado como um objeto Python, instanciado de classes como :class:`ttk.Frame`, :class:`ttk.Label`, e :class:`ttk.Button`.

source: widget hierarchy
pt_br: hierarquia dos widgets
