Repository: python/python-docs-pt-br
Catalog: library/tkinter.po
Languages: pt_br

source: Either type of image is created through either the ``file`` or the ``data`` option (other options are available as well).
pt_br: Qualquer tipo de imagem é criado através da opção ``file`` ou ``data`` (outras opções também estão disponíveis).

source: Added the :class:`!PhotoImage` method :meth:`!copy_replace` to copy a region from one image to other image, possibly with pixel zooming and/or subsampling. Add *from_coords* parameter to :class:`!PhotoImage` methods :meth:`!copy`, :meth:`!zoom` and :meth:`!subsample`. Add *zoom* and *subsample* parameters to :class:`!PhotoImage` method :meth:`!copy`.
pt_br: Adicionado o método :meth:`!copy_replace` à classe :class:`!PhotoImage` para copiar uma região de uma imagem para outra imagem, possivelmente com ampliação e subamostragem de pixels. Adiciona parâmetro *from_coords* para os métodos :meth:`!copy`, :meth:`!zoom` e :meth:`!subsample` da classe :class:`!PhotoImage`. Adiciona parâmetros *zoom* e *subsample* para o método :meth:`!copy` da classe :class:`!PhotoImage`.

source: The image object can then be used wherever an ``image`` option is supported by some widget (e.g. labels, buttons, menus). In these cases, Tk will not keep a reference to the image. When the last Python reference to the image object is deleted, the image data is deleted as well, and Tk will display an empty box wherever the image was used.
pt_br: O objeto imagem pode então ser usado sempre que uma opção ``image`` há suporte em algum widget (por exemplo: rótulos, botões, menus). Nestes casos, o Tk não guardará uma referência à imagem. Quando a última referência Python ao objeto imagem for excluída, os dados da imagem também serão excluídos e o Tk exibirá uma caixa vazia onde quer que a imagem tenha sido usada.

source: The `Pillow <https://python-pillow.org/>`_ package adds support for formats such as BMP, JPEG, TIFF, and WebP, among others.
pt_br: O pacote `Pillow <https://python-pillow.org/>`_ adiciona suporte para formatos como BMP, JPEG, TIFF e WebP, entre outros.

source: File Handlers
pt_br: Tratadores de arquivos

source: Tk allows you to register and unregister a callback function which will be called from the Tk mainloop when I/O is possible on a file descriptor. Only one handler may be registered per file descriptor. Example code::
pt_br: O Tk permite que você registre e cancele o registro de uma função de retorno que será chamada a partir do laço central do Tk quando uma E/S for possível em um descritor de arquivo. Apenas um tratador pode ser registrado por descritor de arquivo. Código de exemplo::

source: This feature is not available on Windows.
pt_br: Este recurso não está disponível no Windows.

source: Since you don't know how many bytes are available for reading, you may not want to use the :class:`~io.BufferedIOBase` or :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read` or :meth:`~io.IOBase.readline` methods, since these will insist on reading a predefined number of bytes. For sockets, the :meth:`~socket.socket.recv` or :meth:`~socket.socket.recvfrom` methods will work fine; for other files, use raw reads or ``os.read(file.fileno(), maxbytecount)``.
pt_br: Já que você não sabe quantos bytes estão disponíveis para leitura, você pode não querer usar os métodos :meth:`~io.BufferedIOBase.read` ou :meth:`~io.IOBase.readline` de :class:`~io.BufferedIOBase` ou :class:`~io.TextIOBase`, já que eles insistirão em ler uma quantidade predefinida de bytes. Para sockets, os métodos :meth:`~socket.socket.recv` ou :meth:`~socket.socket.recvfrom` vão servir; para outros arquivos, use dados brutos ou ``os.read(file.fileno(), maxbytecount)``.

source: Registers the file handler callback function *func*. The *file* argument may either be an object with a :meth:`~io.IOBase.fileno` method (such as a file or socket object), or an integer file descriptor. The *mask* argument is an ORed combination of any of the three constants below. The callback is called as follows::
pt_br: Registra a função de retorno do tratador de arquivo *func*. O argumento *file* pode ser um objeto com um método :meth:`~io.IOBase.fileno` (como um arquivo ou objeto soquete) ou um descritor de arquivo de inteiro. O argumento *mask* é uma combinação OR de qualquer uma das três constantes abaixo. O retorno de chamada é chamado da seguinte maneira::

source: Unregisters a file handler.
pt_br: Cancela o registro de um tratador de arquivo.

source: Constants used in the *mask* arguments.
pt_br: Constantes usadas nos argumentos *mask*.

source: packing (widgets)
pt_br: empacotamento (widgets)

source: window manager (widgets)
pt_br: gerenciador de janela (widgets)

source: bind (widgets)
pt_br: ligação (widgets)

source: events (widgets)
pt_br: eventos (widgets)
