Repository: python/python-docs-pt-br
Catalog: library/tkinter.messagebox.po
Languages: pt_br

source: :mod:`!tkinter.messagebox` --- Tkinter message prompts
pt_br: :mod:`!tkinter.messagebox` --- Prompts de mensagem do Tkinter

source: **Source code:** :source:`Lib/tkinter/messagebox.py`
pt_br: **Código-fonte:** :source:`Lib/tkinter/messagebox.py`

source: The :mod:`tkinter.messagebox` module provides a template base class as well as a variety of convenience methods for commonly used configurations. The message boxes are modal and will return a subset of (``True``, ``False``, ``None``, :data:`OK`, :data:`CANCEL`, :data:`YES`, :data:`NO`) based on the user's selection. Common message box styles and layouts include but are not limited to:
pt_br: O módulo :mod:`tkinter.messagebox` provê uma classe base template e uma variedade de métodos de conveniência para as configurações mais comumente usadas. As caixas de mensagem são modais e vão retornar um conjuto de (``True``, ``False``, ``None``, :data:`OK`, :data:`CANCEL`, :data:`YES`, :data:`NO`) baseado na seleção do usuário. Estilos e formatos de janelas comuns estão incluidos, mas não estão limitados a:

source: Create a message window with an application-specified message, an icon and a set of buttons. Each of the buttons in the message window is identified by a unique symbolic name (see the *type* options).
pt_br: Criar uma janela de mensagem com uma mensagem específica da aplicação, um ícone e um conjunto de botões. Cada botão na janela é identificado com um nome simbólico único (veja as opções de "type").

source: The following options are supported:
pt_br: As seguintes opções são suportadas:

source: Specifies the function to invoke when the user closes the dialog. The name of the button clicked by the user to close the dialog is passed as argument. This is only available on macOS.
pt_br: Especifica a função que será invocada quando o usuário fecha a janela de dálogo. O nome do botão clicado pelo usuário para fechar a janela é passada como um argumento. Esta funcionalidade está disponível apenas no macOS.

source: Gives the :ref:`symbolic name <messagebox-buttons>` of the default button for this message window (:data:`OK`, :data:`CANCEL`, and so on). If this option is not specified, the first button in the dialog will be made the default.
pt_br: Fornece o :ref:`nome simbólico <messagebox-buttons>` do botão padrão para essa janela de mensagem (:data:`OK`, :data:`CANCEL`, e assim por diante). Se essa opção não for especificada, o primeiro botão da caixa de diálogo será o padrão.

source: Specifies an auxiliary message to the main message given by the *message* option. The message detail will be presented beneath the main message and, where supported by the OS, in a less emphasized font than the main message.
pt_br: Especifica uma mensagem auxiliar para a mensagem principal fornecida pela opção *message*. Esta mensagem será apresentado abaixo da mensagem principal e, quando suportado pelo sistema operacional, em uma fonte menos enfatizada do que a mensagem principal.

source: Specifies an :ref:`icon <messagebox-icons>` to display. If this option is not specified, then the :data:`INFO` icon will be displayed.
pt_br: Especifica um :ref:`icon <messagebox-icons>` a ser apresentado. Se essa opção não for especificada, o ícone :data:`INFO` será exibido.

source: Specifies the message to display in this message box. The default value is an empty string.
pt_br: Especifica a mensagem para mostrar nessa caixa de mensagem. O padrão valor é uma string vazia.

source: Makes the specified window the logical parent of the message box. The message box is displayed on top of its parent window.
pt_br: Torna a janela especificada a janela pai da caixa de mensagem. A caixa de mensagem é exibida na parte superior de sua janela pai.

source: Specifies a string to display as the title of the message box. This option is ignored on macOS, where platform guidelines forbid the use of a title on this kind of dialog.
pt_br: Especifica uma string para mostrar como o título da caixa de mensagem. Essa opção é ignorada no macOS, onde a plataforma proíbe o uso de um título nesse tipo de caixa de diálogo.

source: Arranges for a :ref:`predefined set of buttons <messagebox-types>` to be displayed.
pt_br: Organiza um :ref:`conjunto predefinido de botões <messagebox-types>` a serem mostrados.

source: Display a message window and wait for the user to select one of the buttons. Then return the symbolic name of the selected button. Keyword arguments can override options specified in the constructor.
pt_br: Mostra uma janela de mensagem e aguarda que o usuário selecione um dos botões. Em seguida, retorna o nome simbólico do botão selecionado. Argumentos nomeados pode substituir opções especificadas no construtor.

source: **Information message box**
pt_br: **Caixa de mensagem de informação**

source: Creates and displays an information message box with the specified title and message.
pt_br: Cria e exibe uma caixa de mensagem informativa com o título e a mensagem especificados.

source: **Warning message boxes**
pt_br: **Caixas de mensagem de atenção**

source: Creates and displays a warning message box with the specified title and message.
pt_br: Cria e exibe uma caixa de mensagem de alerta com o título e a mensagem especificados.

source: Creates and displays an error message box with the specified title and message.
pt_br: Cria e exibe uma caixa de mensagem de erro com o título e a mensagem especificados.

source: **Question message boxes**
pt_br: **Caixas de mensagem de dúvida**

source: Ask a question. By default shows buttons :data:`YES` and :data:`NO`. Returns the symbolic name of the selected button.
pt_br: Faz uma pergunta. Por padrão mostra os botões :data:`YES` e :data:`NO`. Retorna o nome simbólico do botão selecionado.

source: Ask if operation should proceed. Shows buttons :data:`OK` and :data:`CANCEL`. Returns ``True`` if the answer is ok and ``False`` otherwise.
pt_br: Pergunta se a operação deve prosseguir. Mostra os botões :data:`OK` e :data:`CANCEL`. Retorna ``True`` se a resposta for "OK" e ``False`` caso contrário.

source: Ask if operation should be retried. Shows buttons :data:`RETRY` and :data:`CANCEL`. Return ``True`` if the answer is yes and ``False`` otherwise.
pt_br: Pergunta se a operação deve ser tentada novamente. Mostra os botões :data:`RETRY` e :data:`CANCEL`. Retorna ``True`` se a resposta for sim e ``False`` caso contrário.

source: Ask a question. Shows buttons :data:`YES` and :data:`NO`. Returns ``True`` if the answer is yes and ``False`` otherwise.
pt_br: Faz uma pergunta. Mostra os botões :data:`YES` e :data:`NO`. Retorna ``True`` se a resposta for sim e ``False`` caso contrário.

source: Ask a question. Shows buttons :data:`YES`, :data:`NO` and :data:`CANCEL`. Return ``True`` if the answer is yes, ``None`` if cancelled, and ``False`` otherwise.
pt_br: Faz uma pergunta. Mostra os botões :data:`YES`, :data:`NO` e :data:`CANCEL`. Retorna ``True`` se a resposta for sim, ``None`` se cancelado, e ``False`` caso contrário.

source: Symbolic names of buttons:
pt_br: Nomes simbólicos dos botões:

source: Predefined sets of buttons:
pt_br: Conjunto predefinido de botões:

source: Displays three buttons whose symbolic names are :data:`ABORT`, :data:`RETRY` and :data:`IGNORE`.
pt_br: Exibe três botões cujos nomes simbólicos são :data:`ABORT`, :data:`RETRY` e :data:`IGNORE`.

source: Displays one button whose symbolic name is :data:`OK`.
pt_br: Exibe um botão cujo nome simbólico é :data:`OK`.

source: Displays two buttons whose symbolic names are :data:`OK` and :data:`CANCEL`.
pt_br: Exibe dois botões cujos nomes simbólicos são :data:`OK` e :data:`CANCEL`.

source: Displays two buttons whose symbolic names are :data:`RETRY` and :data:`CANCEL`.
pt_br: Exibe dois botões cujos nomes simbólicos são :data:`RETRY` e :data:`CANCEL`.

source: Displays two buttons whose symbolic names are :data:`YES` and :data:`NO`.
pt_br: Exibe dois botões cujos nomes simbólicos são :data:`YES` e :data:`NO`.

source: Displays three buttons whose symbolic names are :data:`YES`, :data:`NO` and :data:`CANCEL`.
pt_br: Exibe três botões cujos nomes simbólicos são :data:`YES`, :data:`NO` e :data:`CANCEL`.

source: Icon images:
pt_br: Imagens de ícones:
