Repository: python/python-docs-pt-br
Catalog: library/tkinter.po
Languages: pt_br

source: Widgets are arranged in a *hierarchy*. The label and button were contained within a frame, which in turn was contained within the root window. When creating each *child* widget, its *parent* widget is passed as the first argument to the widget constructor.
pt_br: Os widgets são organizados em uma *hierarquia*. O rótulo e botão estavam contidos em um frame, que por sua vez estava contido na janela raiz. Quando criamos um widget *filho*, seu widget *pai* é passado como primeiro argumento para o construtor do widget.

source: configuration options
pt_br: opções de configuração

source: Widgets have *configuration options*, which modify their appearance and behavior, such as the text to display in a label or button. Different classes of widgets will have different sets of options.
pt_br: Widgets possuem *opções de configuração*, que modificam sua aparência e comportamento, como o texto a ser exibido em um rótulo ou botão. Diferentes classes de widgets terão diferentes conjuntos de opções.

source: geometry management
pt_br: gerenciamento de geometria

source: Widgets aren't automatically added to the user interface when they are created. A *geometry manager* like ``grid`` controls where in the user interface they are placed.
pt_br: Os widgets não são automaticamente adicionados à interface de usuário quando eles são criados. Um *gerenciador de geometria* como ``grid`` controla onde na interface de usuário eles são colocados.

source: event loop
pt_br: loop de eventos

source: Tkinter reacts to user input, changes from your program, and even refreshes the display only when actively running an *event loop*. If your program isn't running the event loop, your user interface won't update.
pt_br: O Tkinter reage à entrada do usuário, muda de seu programa, e até mesmo atualiza a tela somente ao executar ativamente um *loop de eventos*. Se o seu programa não estiver executando o loop de eventos, sua interface de usuário não será atualizada.

source: Understanding How Tkinter Wraps Tcl/Tk
pt_br: Entendendo como Tkinter envolve Tcl/Tk

source: When your application uses Tkinter's classes and methods, internally Tkinter is assembling strings representing Tcl/Tk commands, and executing those commands in the Tcl interpreter attached to your application's :class:`Tk` instance.
pt_br: Quando a sua aplicação utiliza as classes e métodos do Tkinter, internamente o Tkinter está montando strings representando comandos Tcl/Tk e executando esses comandos no interpretador Tcl anexado à instância :class:`Tk` de sua aplicação.

source: Whether it's trying to navigate reference documentation, trying to find the right method or option, adapting some existing code, or debugging your Tkinter application, there are times that it will be useful to understand what those underlying Tcl/Tk commands look like.
pt_br: Seja tentando navegar na documentação de referência, tentando encontrar o método ou opção certa, adaptando algum código existente ou depurando seu aplicativo Tkinter, há momentos em que será útil entender como são os comandos Tcl/Tk subjacentes.

source: To illustrate, here is the Tcl/Tk equivalent of the main part of the Tkinter script above.
pt_br: Para ilustrar, aqui está o equivalente Tcl/Tk da parte principal do script Tkinter acima.

source: Tcl's syntax is similar to many shell languages, where the first word is the command to be executed, with arguments to that command following it, separated by spaces. Without getting into too many details, notice the following:
pt_br: A sintaxe do Tcl é semelhante a muitas linguagens de shell, onde a primeira palavra é o comando a ser executado, seguido de argumentos para esse comando separados por espaços. Sem entrar em muitos detalhes, observe o seguinte:

source: The commands used to create widgets (like ``ttk::frame``) correspond to widget classes in Tkinter.
pt_br: Os comandos usados para criar widgets (como ``ttk::frame``) correspondem a classes de widgets no Tkinter.

source: Tcl widget options (like ``-text``) correspond to keyword arguments in Tkinter.
pt_br: As opções de widget Tcl (como ``-text``) correspondem a argumentos nomeados no Tkinter.

source: Widgets are referred to by a *pathname* in Tcl (like ``.frm.btn``), whereas Tkinter doesn't use names but object references.
pt_br: Widgets são referenciados por um *pathname* em Tcl (like ``.frm.btn``), enquanto o Tkinter não utiliza nomes, mas referências a objetos.

source: A widget's place in the widget hierarchy is encoded in its (hierarchical) pathname, which uses a ``.`` (dot) as a path separator. The pathname for the root window is just ``.`` (dot). In Tkinter, the hierarchy is defined not by pathname but by specifying the parent widget when creating each child widget.
pt_br: O lugar de um widget na hierarquia widget é codificado em seu pathname (hierárquico), que utiliza um ``.`` (ponto) como um separador de caminho. O pathname para a janela raiz é apenas ``.`` (ponto). No Tkinter, a hierarquia é definida não pelo pathname, mas pela especificação do widget pai ao criar cada widget filho.

source: Operations which are implemented as separate *commands* in Tcl (like ``grid`` or ``destroy``) are represented as *methods* on Tkinter widget objects. As you'll see shortly, at other times Tcl uses what appear to be method calls on widget objects, which more closely mirror what would is used in Tkinter.
pt_br: Operações que são implementadas como *comandos* separados em Tcl (como ``grid`` ou ``destroy``) são representadas como *métodos* em objetos de widget Tkinter. Como você verá em breve, em outras ocasiões o Tcl usa o que parecem ser chamadas de método em objetos widget, que espelham mais de perto o que seria usado no Tkinter.

source: How do I...? What option does...?
pt_br: Como é que eu...? Que opção faz...?

source: If you're not sure how to do something in Tkinter, and you can't immediately find it in the tutorial or reference documentation you're using, there are a few strategies that can be helpful.
pt_br: Se você não tem certeza de como fazer algo no Tkinter e não consegue encontrá-lo imediatamente no tutorial ou na documentação de referência que está usando, existem algumas estratégias que podem ser úteis.

source: First, remember that the details of how individual widgets work may vary across different versions of both Tkinter and Tcl/Tk. If you're searching documentation, make sure it corresponds to the Python and Tcl/Tk versions installed on your system.
pt_br: Primeiro, lembre-se de que os detalhes de como os widgets individuais funcionam podem variar entre diferentes versões tanto do Tkinter quanto do Tcl/Tk. Se você estiver procurando por documentação, certifique-se de que corresponda às versões do Python e Tcl/Tk instaladas em seu sistema.

source: When searching for how to use an API, it helps to know the exact name of the class, option, or method that you're using. Introspection, either in an interactive Python shell or with :func:`print`, can help you identify what you need.
pt_br: Ao procurar como usar uma API, é útil saber o nome exato da classe, opção ou método que você está usando. A introspecção, seja em um console Python interativo ou com a :func:`print`, pode ajudar a identificar o que você precisa.

source: To find out what configuration options are available on any widget, call its :meth:`configure` method, which returns a dictionary containing a variety of information about each object, including its default and current values. Use :meth:`keys` to get just the names of each option.
pt_br: Para descobrir quais opções de configuração estão disponíveis em qualquer widget, chame o método :meth:`configure`, que retorna um dicionário contendo uma variedade de informações sobre cada objeto, incluindo seus valores padrão e atuais. Use :meth:`keys` para obter apenas os nomes de cada opção.

source: As most widgets have many configuration options in common, it can be useful to find out which are specific to a particular widget class. Comparing the list of options to that of a simpler widget, like a frame, is one way to do that.
pt_br: Como a maioria dos widgets tem muitas opções de configuração em comum, pode ser útil descobrir quais são específicas para uma determinada classe de widget. Comparar a lista de opções com a de um widget mais simples, como um frame, é uma maneira de fazer isso.

source: Similarly, you can find the available methods for a widget object using the standard :func:`dir` function. If you try it, you'll see there are over 200 common widget methods, so again identifying those specific to a widget class is helpful.
pt_br: Da mesma forma, você pode encontrar os métodos disponíveis para um objeto widget usando a função padrão :func:`dir`. Se você tentar, verá que existem mais de 200 métodos comuns de widget, então identificar aqueles específicos para uma classe de widget é útil.

source: Navigating the Tcl/Tk Reference Manual
pt_br: Navegando no Manual de Referência Tcl/Tk

source: As noted, the official `Tk commands <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_ reference manual (man pages) is often the most accurate description of what specific operations on widgets do. Even when you know the name of the option or method that you need, you may still have a few places to look.
pt_br: Como observado, o manual (páginas man) de referência oficial dos `comandos Tk <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_ é frequentemente a descrição mais precisa do que operações específicas em widgets fazem. Mesmo quando você sabe o nome da opção ou método que você precisa, você ainda pode ter alguns lugares para procurar.

source: While all operations in Tkinter are implemented as method calls on widget objects, you've seen that many Tcl/Tk operations appear as commands that take a widget pathname as its first parameter, followed by optional parameters, e.g.
pt_br: Enquanto todas as operações no Tkinter são implementadas como chamadas de método em objetos de widget, você viu que muitas operações Tcl/Tk aparecem como comandos que recebem um caminho de widget como seu primeiro parâmetro, seguido de parâmetros opcionais, por exemplo.

source: Others, however, look more like methods called on a widget object (in fact, when you create a widget in Tcl/Tk, it creates a Tcl command with the name of the widget pathname, with the first parameter to that command being the name of a method to call).
pt_br: Outros, no entanto, parecem mais com métodos chamados em um objeto widget (na verdade, quando você cria um widget em Tcl/Tk, ele cria um comando Tcl com o nome do caminho do widget, sendo o primeiro parâmetro desse comando o nome de um método a ser chamado).

source: In the official Tcl/Tk reference documentation, you'll find most operations that look like method calls on the man page for a specific widget (e.g., you'll find the :meth:`invoke` method on the `ttk::button <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_button.htm>`_ man page), while functions that take a widget as a parameter often have their own man page (e.g., `grid <https://www.tcl.tk/man/tcl8.6/TkCmd/grid.htm>`_).
pt_br: Na documentação oficial de referência do Tcl/Tk, você encontrará a maioria das operações que se parecem com chamadas de método na página man de um widget específico (por exemplo, você encontrará o método :meth:`invoke` na página man do `ttk::button <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_button.htm>`_), enquanto as funções que recebem um widget como parâmetro geralmente têm sua própria página man (por exemplo, `grid <https://www.tcl.tk/man/tcl8.6/TkCmd/grid.htm>`_).

source: You'll find many common options and methods in the `options <https://www.tcl.tk/man/tcl8.6/TkCmd/options.htm>`_ or `ttk::widget <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_widget.htm>`_ man pages, while others are found in the man page for a specific widget class.
pt_br: Você encontrará muitas opções e métodos comuns nas páginas man `options <https://www.tcl.tk/man/tcl8.6/TkCmd/options.htm>`_ e `ttk::widget <https://www.tcl.tk/man/tcl8.6/TkCmd/ttk_widget.htm>`_, enquanto outros são encontrados na página man para uma classe de widget específica.

source: You'll also find that many Tkinter methods have compound names, e.g., :func:`winfo_x`, :func:`winfo_height`, :func:`winfo_viewable`. You'd find documentation for all of these in the `winfo <https://www.tcl.tk/man/tcl8.6/TkCmd/winfo.htm>`_ man page.
pt_br: Você também encontrará que muitos métodos do Tkinter têm nomes compostos, por exemplo, :func:`winfo_x`, :func:`winfo_height`, :func:`winfo_viewable`. Você encontra documentação para todos eles na página man `winfo <https://www.tcl.tk/man/tcl8.6/TkCmd/winfo.htm>`_.

source: Somewhat confusingly, there are also methods on all Tkinter widgets that don't actually operate on the widget, but operate at a global scope, independent of any widget. Examples are methods for accessing the clipboard or the system bell. (They happen to be implemented as methods in the base :class:`Widget` class that all Tkinter widgets inherit from).
pt_br: De forma bem confusa, também existem métodos em todos os widgets do Tkinter que na verdade não operam no widget, mas operam em um escopo global, independente de qualquer widget. Exemplos são métodos para acessar a área de transferência ou o sinal do sistema. (Eles são implementados como métodos na classe base :class:`Widget` da qual todos os widgets do Tkinter herdam).

source: Threading model
pt_br: Modelo de threading

source: Python and Tcl/Tk have very different threading models, which :mod:`tkinter` tries to bridge. If you use threads, you may need to be aware of this.
pt_br: Python e Tcl/Tk têm modelos de threading muito diferentes, que :mod:`tkinter` tenta fazer a ponte. Se você usa threads, pode precisar estar ciente disso.

source: A Python interpreter may have many threads associated with it. In Tcl, multiple threads can be created, but each thread has a separate Tcl interpreter instance associated with it. Threads can also create more than one interpreter instance, though each interpreter instance can be used only by the one thread that created it.
pt_br: Um interpretador Python pode ter muitas threads associados a ele. Em Tcl, várias threads podem ser criadas, mas cada thread tem uma instância de interpretador Tcl separada associada a ele. Threads também podem criar mais de uma instância do interpretador, embora cada instância do interpretador possa ser usada apenas pela thread que a criou.

source: Each :class:`Tk` object created by :mod:`tkinter` contains a Tcl interpreter. It also keeps track of which thread created that interpreter. Calls to :mod:`tkinter` can be made from any Python thread. Internally, if a call comes from a thread other than the one that created the :class:`Tk` object, an event is posted to the interpreter's event queue, and when executed, the result is returned to the calling Python thread.
pt_br: Cada objeto :class:`Tk` criado por :mod:`tkinter` contém um interpretador Tcl. Ele também controla qual thread criou aquele interpretador. Chamadas para :mod:`tkinter` podem ser feitas a partir de qualquer thread do Python. Internamente, se uma chamada vier de um thread diferente daquele que criou o objeto :class:`Tk`, um evento é postado na fila de eventos do interpretador e, quando executado, o resultado é retornado ao thread de chamada do Python.

source: Tcl/Tk applications are normally event-driven, meaning that after initialization, the interpreter runs an event loop (i.e. :func:`Tk.mainloop`) and responds to events. Because it is single-threaded, event handlers must respond quickly, otherwise they will block other events from being processed. To avoid this, any long-running computations should not run in an event handler, but are either broken into smaller pieces using timers, or run in another thread. This is different from many GUI toolkits where the GUI runs in a completely separate thread from all application code including event handlers.
pt_br: As aplicações Tcl/Tk são normalmente orientadas a eventos, o que significa que após a inicialização, o interpretador executa um laço de eventos (ou seja :func:`Tk.mainloop`) e responde aos eventos. Por ser de thread única, os tratadores de eventos devem responder rapidamente, caso contrário, bloquearão o processamento de outros eventos. Para evitar isso, quaisquer cálculos de longa execução não devem ser executados em um tratador de eventos, mas são divididos em pedaços menores usando temporizadores ou executados em outra thread. Isso é diferente de muitos kits de ferramentas de GUI em que a GUI é executada em um thread completamente separado de todo o código do aplicação, incluindo tratadores de eventos.

source: If the Tcl interpreter is not running the event loop and processing events, any :mod:`tkinter` calls made from threads other than the one running the Tcl interpreter will fail.
pt_br: Se o interpretador Tcl não estiver executando o laço de eventos e processando eventos, qualquer chamada :mod:`tkinter` feita de threads diferentes daquela que está executando o interpretador do Tcl irá falhar.

source: A number of special cases exist:
pt_br: Existem vários casos especiais:

source: Tcl/Tk libraries can be built so they are not thread-aware. In this case, :mod:`tkinter` calls the library from the originating Python thread, even if this is different than the thread that created the Tcl interpreter. A global lock ensures only one call occurs at a time.
pt_br: Bibliotecas Tcl/Tk podem ser construídas de forma que não reconheçam thread. Neste caso, :mod:`tkinter` chama a biblioteca da thread originadora do Python, mesmo que seja diferente da thread que criou o interpretador Tcl. Uma trava global garante que apenas uma chamada ocorra por vez.

source: While :mod:`tkinter` allows you to create more than one instance of a :class:`Tk` object (with its own interpreter), all interpreters that are part of the same thread share a common event queue, which gets ugly fast. In practice, don't create more than one instance of :class:`Tk` at a time. Otherwise, it's best to create them in separate threads and ensure you're running a thread-aware Tcl/Tk build.
pt_br: Enquanto :mod:`tkinter` permite que você crie mais de uma instância de um objeto :class:`Tk` (com seu próprio interpretador), todos os interpretadores que fazem parte da mesma thread compartilham uma fila de eventos comum, o que fica muito rápido. Na prática, não crie mais de uma instância de :class:`Tk` por vez. Caso contrário, é melhor criá-los em threads separadas e garantir que você esteja executando uma construção Tcl/Tk com reconhecimento de thread.

source: Blocking event handlers are not the only way to prevent the Tcl interpreter from reentering the event loop. It is even possible to run multiple nested event loops or abandon the event loop entirely. If you're doing anything tricky when it comes to events or threads, be aware of these possibilities.
pt_br: Bloquear manipuladores de eventos não é a única maneira de evitar que o interpretador Tcl entre novamente no laço de eventos. É ainda possível executar vários laços de eventos aninhados ou abandonar totalmente o laço de eventos. Se você estiver fazendo algo complicado quando se trata de eventos ou threads, esteja ciente dessas possibilidades.

source: There are a few select :mod:`tkinter` functions that presently work only when called from the thread that created the Tcl interpreter.
pt_br: Existem algumas funções de seleção do :mod:`tkinter` que atualmente funcionam apenas quando chamadas a partir da thread que criou o interpretador Tcl.

source: Handy Reference
pt_br: Referência Útil

source: Setting Options
pt_br: Opções de Definição

source: Options control things like the color and border width of a widget. Options can be set in three ways:
pt_br: As opções controlam coisas como a cor e a largura da borda de um widget. As opções podem ser definidas de três maneiras:

source: At object creation time, using keyword arguments
pt_br: No momento da criação do objeto, usando argumentos nomeados

source: After object creation, treating the option name like a dictionary index
pt_br: Após a criação do objeto, tratando o nome da opção como um índice de dicionário

source: Use the config() method to update multiple attrs subsequent to object creation
pt_br: Use o método config() para atualizar vários attrs posteriores à criação do objeto

source: For a complete explanation of a given option and its behavior, see the Tk man pages for the widget in question.
pt_br: Para uma explicação completa de uma dada opção e seu comportamento, veja as páginas man do Tk para o widget em questão.

source: Note that the man pages list "STANDARD OPTIONS" and "WIDGET SPECIFIC OPTIONS" for each widget. The former is a list of options that are common to many widgets, the latter are the options that are idiosyncratic to that particular widget. The Standard Options are documented on the :manpage:`options(3)` man page.
pt_br: Note que as páginas man listam "OPÇÕES PADRÃO" e "OPÇÕES DE WIDGET ESPECÍFICO" para cada widget. A primeira é uma lista de opções que são comuns a vários widgets, e a segunda são opções que são idiossincráticas ao widget em particular. As Opções Padrão estão documentadas na página man :manpage:`options(3)`.

source: No distinction between standard and widget-specific options is made in this document. Some options don't apply to some kinds of widgets. Whether a given widget responds to a particular option depends on the class of the widget; buttons have a ``command`` option, labels do not.
pt_br: Nenhuma distinção entre as opções padrão e específicas de widget são feitas neste documento. Algumas opções não se aplicam a alguns tipos de widgets. A resposta de um dado widget a uma opção particular depende da classe do widget; botões possuem a opção ``command``, etiquetas não.

source: The options supported by a given widget are listed in that widget's man page, or can be queried at runtime by calling the :meth:`config` method without arguments, or by calling the :meth:`keys` method on that widget. The return value of these calls is a dictionary whose key is the name of the option as a string (for example, ``'relief'``) and whose values are 5-tuples.
pt_br: As opções suportadas por um dado widget estão listadas na página man daquele widget, ou podem ser consultadas no tempo de execução chamando o método :meth:`config` sem argumentos, ou chamando o método :meth:`keys` daquele widget. O valor retornado por essas chamadas é um dicionário cujas chaves são os nomes das opções como uma string (por exemplo, ``'relief'``) e cujos valores são tuplas de 5 elementos.

source: Some options, like ``bg`` are synonyms for common options with long names (``bg`` is shorthand for "background"). Passing the ``config()`` method the name of a shorthand option will return a 2-tuple, not 5-tuple. The 2-tuple passed back will contain the name of the synonym and the "real" option (such as ``('bg', 'background')``).
pt_br: Algumas opções, como ``bg`` são sinônimos para opções comuns com nomes mais longos (``bg`` é a abreviação de "background", ou plano de fundo em inglês). Passando o nome de uma opção abreviada ao método ``config()`` irá retornar uma tupla de 2 elementos, e não uma tupla de 5 elementos. A tupla de 2 elementos devolvida irá conter o nome do sinônimo e a opção "verdadeira" (como por exemplo em ``('bg', 'background')``).

source: Index
pt_br: Índice

source: Meaning
pt_br: Significado

source: Example
pt_br: Exemplo

source: option name
pt_br: nome da opção

source: option name for database lookup
pt_br: nome da opção para buscas de banco de dados

source: option class for database lookup
pt_br: classe de opção para busca de banco de dados

source: default value
pt_br: valor padrão

source: current value
pt_br: valor atual

source: Example::
pt_br: Exemplo::
