Repository: python/python-docs-pt-br
Catalog: library/tkinter.po
Languages: pt_br

source: Of course, the dictionary printed will include all the options available and their values. This is meant only as an example.
pt_br: É claro que o dicionário exibido irá incluir todas as opções disponíveis e seus valores. Isso foi apenas um exemplo.

source: The Packer
pt_br: O Empacotador

source: The packer is one of Tk's geometry-management mechanisms. Geometry managers are used to specify the relative positioning of widgets within their container - their mutual *master*. In contrast to the more cumbersome *placer* (which is used less commonly, and we do not cover here), the packer takes qualitative relationship specification - *above*, *to the left of*, *filling*, etc - and works everything out to determine the exact placement coordinates for you.
pt_br: O empacotador é um dos mecanismos de gerenciamento de geometria do Tk. Gerenciadores de geometria são utilizados para especificar as posições relativas dos widgets dentro dos seus contêineres - os seus *processos pai* mútuos. Em contraste ao mais incômodo *posicionador* (que é usado com menos frequência, e não falaremos dele aqui), o empacotador recebe a especificação de relacionamento qualitativo - *acima*, *à esquerda de*, *preenchimento*, etc. - e determina as coordenadas de posição exatas para você.

source: The size of any *master* widget is determined by the size of the "slave widgets" inside. The packer is used to control where slave widgets appear inside the master into which they are packed. You can pack widgets into frames, and frames into other frames, in order to achieve the kind of layout you desire. Additionally, the arrangement is dynamically adjusted to accommodate incremental changes to the configuration, once it is packed.
pt_br: O tamanho de qualquer widget *mestre* é determinado pelo tamanho dos "widgets escravos" internos. O empacotador é usado para controlar onde os widgets escravos aparecem dentro do mestre no qual são empacotados. Você pode empacotar widgets em quadros e quadros em outros quadros, a fim de obter o tipo de layout que deseja. Além disso, o arranjo é ajustado dinamicamente para acomodar alterações incrementais na configuração, uma vez que é empacotado.

source: Note that widgets do not appear until they have had their geometry specified with a geometry manager. It's a common early mistake to leave out the geometry specification, and then be surprised when the widget is created but nothing appears. A widget will appear only after it has had, for example, the packer's :meth:`pack` method applied to it.
pt_br: Note que os widgets não aparecem até que eles tenham sua geometria especificada pelo gerenciador de geometria. É um erro comum de iniciantes deixar a geometria de fora da especificação, então se surpreender que o widget é criado sendo que nada apareceu. O widget irá aparecer apenas quando tiver, por exemplo, o método método :meth:`pack` do empacotador aplicado a ele.

source: The pack() method can be called with keyword-option/value pairs that control where the widget is to appear within its container, and how it is to behave when the main application window is resized. Here are some examples::
pt_br: O método pack() pode ser chamado com pares de palavra reservada-opção/valor que controlam onde o widget deverá aparecer dentro do seu contêiner, e como deverá se comportar quando a janela da aplicação principal for redimensionada. Aqui estão alguns exemplos::

source: fred.pack() # defaults to side = "top" fred.pack(side="left") fred.pack(expand=1)
pt_br: fred.pack() # tem como padrão side = "top" fred.pack(side="left") fred.pack(expand=1)

source: Packer Options
pt_br: Opções do Empacotador

source: For more extensive information on the packer and the options that it can take, see the man pages and page 183 of John Ousterhout's book.
pt_br: Para uma informação mais completa do empacotador e as opções que pode receber, veja as páginas man e a página 183 do livro do John Ousterhout.

source: Anchor type. Denotes where the packer is to place each slave in its parcel.
pt_br: Tipo âncora. Denota onde o packer deverá posicionar cada ajudante em seu pacote.

source: Boolean, ``0`` or ``1``.
pt_br: Booleano, ``0`` ou ``1``.

source: Legal values: ``'x'``, ``'y'``, ``'both'``, ``'none'``.
pt_br: Valores legais: ``'x'``, ``'y'``, ``'both'``, ``'none'``.

source: ipadx and ipady
pt_br: ipadx e ipady

source: A distance - designating internal padding on each side of the slave widget.
pt_br: Uma distância - designando o deslocamento interno de cada lado do widget ajudante.

source: padx and pady
pt_br: padx e pady

source: A distance - designating external padding on each side of the slave widget.
pt_br: Uma distância - designando o deslocamento externo de cada lado do widget ajudante.

source: Legal values are: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.
pt_br: Valores legais são: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.

source: Coupling Widget Variables
pt_br: Acoplando Variáveis de Widgets

source: The current-value setting of some widgets (like text entry widgets) can be connected directly to application variables by using special options. These options are ``variable``, ``textvariable``, ``onvalue``, ``offvalue``, and ``value``. This connection works both ways: if the variable changes for any reason, the widget it's connected to will be updated to reflect the new value.
pt_br: A definição do valor atual de alguns widgets (como widgets de entrada de texto) podem ser conectadas diretamente às variáveis da aplicação utilizando métodos especiais. Estas opções são ``variable``, ``textvariable``, ``onvalue``, ``offvalue``, e ``value``. A conexão funciona por ambos os lados: Se por algum motivo a variável se altera, o widget ao qual ela está conectada irá se atualizar para refletir este novo valor.

source: Unfortunately, in the current implementation of :mod:`tkinter` it is not possible to hand over an arbitrary Python variable to a widget through a ``variable`` or ``textvariable`` option. The only kinds of variables for which this works are variables that are subclassed from a class called Variable, defined in :mod:`tkinter`.
pt_br: Infelizmente, na atual implementação do :mod:`tkinter` não é possível passar uma variável Python arbitrária para um widget por uma opção ``variable`` ou ``textvariable``. Os únicos tipos de variáveis para as quais isso funciona são variáveis que são subclasses da classe chamada Variable, definida em :mod:`tkinter`.

source: There are many useful subclasses of Variable already defined: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar`, and :class:`BooleanVar`. To read the current value of such a variable, call the :meth:`get` method on it, and to change its value you call the :meth:`!set` method. If you follow this protocol, the widget will always track the value of the variable, with no further intervention on your part.
pt_br: Há muitas subclasses de Variable úteis já definidas: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar`, e :class:`BooleanVar`. Para ler o atual valor de uma variável, chame o método :meth:`get` nelas, e para alterar o valor você deve chamar o método :meth:`!set`. Se você seguir este protocolo, o widget irá sempre acompanhar os valores da variável, sem nenhuma intervenção da sua parte.

source: For example::
pt_br: Por exemplo::

source: import tkinter as tk class App(tk.Frame): def __init__(self, master): super().__init__(master) self.pack() self.entrythingy = tk.Entry() self.entrythingy.pack() # Create the application variable. self.contents = tk.StringVar() # Set it to some value. self.contents.set("this is a variable") # Tell the entry widget to watch this variable. self.entrythingy["textvariable"] = self.contents # Define a callback for when the user hits return. # It prints the current value of the variable. self.entrythingy.bind('<Key-Return>', self.print_contents) def print_contents(self, event): print("Hi. The current entry content is:", self.contents.get()) root = tk.Tk() myapp = App(root) myapp.mainloop()
pt_br: import tkinter as tk class App(tk.Frame): def __init__(self, master): super().__init__(master) self.pack() self.entrythingy = tk.Entry() self.entrythingy.pack() # Cria a variável da aplicação. self.contents = tk.StringVar() # Define-a com algum valor. self.contents.set("this is a variable") # Fala para o widget de entrada para monitorar essa variável. self.entrythingy["textvariable"] = self.contents # Define um retorno de chamada para quando o usuário pressionar Enter. # Isso imprime o valor atual da variável. self.entrythingy.bind('<Key-Return>', self.print_contents) def print_contents(self, event): print("Hi. The current entry content is:", self.contents.get()) root = tk.Tk() myapp = App(root) myapp.mainloop()

source: The Window Manager
pt_br: O Gerenciador de Janela

source: In Tk, there is a utility command, ``wm``, for interacting with the window manager. Options to the ``wm`` command allow you to control things like titles, placement, icon bitmaps, and the like. In :mod:`tkinter`, these commands have been implemented as methods on the :class:`Wm` class. Toplevel widgets are subclassed from the :class:`Wm` class, and so can call the :class:`Wm` methods directly.
pt_br: No Tk, existe um comando utilitário, ``wm``, para interagir com o gerenciador de janelas. As opções do comando ``wm`` permitem que você controle coisas como títulos, localização, ícones bitmap, entre outros. No :mod:`tkinter`, estes comandos foram implementados como métodos da classe :class:`Wm` class. Widgets de mais alto nível são subclasses da classe :class:`Wm` e portanto podem chamar os métodos :class:`Wm` diretamente.

source: To get at the toplevel window that contains a given widget, you can often just refer to the widget's master. Of course if the widget has been packed inside of a frame, the master won't represent a toplevel window. To get at the toplevel window that contains an arbitrary widget, you can call the :meth:`_root` method. This method begins with an underscore to denote the fact that this function is part of the implementation, and not an interface to Tk functionality.
pt_br: Para chegar à janela de nível superior que contém um determinado widget, geralmente você pode apenas consultar o mestre do widget. Claro, se o widget foi compactado dentro de um quadro, o mestre não representará uma janela de nível superior. Para chegar à janela de nível superior que contém um widget arbitrário, você pode chamar o método :meth:`_root`. Este método começa com um sublinhado para denotar o fato de que esta função é parte da implementação, e não uma interface para a funcionalidade Tk.

source: Here are some examples of typical usage::
pt_br: Aqui estão alguns exemplos de uso típico::

source: import tkinter as tk class App(tk.Frame): def __init__(self, master=None): super().__init__(master) self.pack() # create the application myapp = App() # # here are method calls to the window manager class # myapp.master.title("My Do-Nothing Application") myapp.master.maxsize(1000, 400) # start the program myapp.mainloop()
pt_br: import tkinter as tk class App(tk.Frame): def __init__(self, master=None): super().__init__(master) self.pack() # Cria a aplicação myapp = App() # # aqui estão as chamadas de método para a classe do gerenciador de janelas # myapp.master.title("Meu Aplicativo Que Faz Nada") myapp.master.maxsize(1000, 400) # inicia o programa myapp.mainloop()

source: Tk Option Data Types
pt_br: Opções de Tipos de Dados do Tk

source: Legal values are points of the compass: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, ``"sw"``, ``"w"``, ``"nw"``, and also ``"center"``.
pt_br: Valores legais são os pontos cardeais: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, ``"sw"``, ``"w"``, ``"nw"``, e também ``"center"``.

source: There are eight built-in, named bitmaps: ``'error'``, ``'gray25'``, ``'gray50'``, ``'hourglass'``, ``'info'``, ``'questhead'``, ``'question'``, ``'warning'``. To specify an X bitmap filename, give the full path to the file, preceded with an ``@``, as in ``"@/usr/contrib/bitmap/gumby.bit"``.
pt_br: Há 8 bitmaps embutidos nomeados: ``'error'``, ``'gray25'``, ``'gray50'``, ``'hourglass'``, ``'info'``, ``'questhead'``, ``'question'``, ``'warning'``. Para especificar um nome de arquivo do bitmap X, passe o caminho completo do arquivo, precedido pelo caractere ``@``, como em ``"@/usr/contrib/bitmap/gumby.bit"``.

source: boolean
pt_br: booleano

source: You can pass integers 0 or 1 or the strings ``"yes"`` or ``"no"``.
pt_br: Você pode passar os inteiros 0 ou 1 ou as strings ``"yes"`` ou ``"no"``.

source: callback
pt_br: função de retorno

source: This is any Python function that takes no arguments. For example::
pt_br: Esta é uma função Python que não aceita argumentos. Por exemplo::

source: color
pt_br: cor

source: Colors can be given as the names of X colors in the rgb.txt file, or as strings representing RGB values in 4 bit: ``"#RGB"``, 8 bit: ``"#RRGGBB"``, 12 bit: ``"#RRRGGGBBB"``, or 16 bit: ``"#RRRRGGGGBBBB"`` ranges, where R,G,B here represent any legal hex digit. See page 160 of Ousterhout's book for details.
pt_br: As cores podem ser fornecidas como nomes de cores X no arquivo rgb.txt ou como strings representando valores RGB em intervalos de 4 bits: ``"#RGB"``, 8 bit: ``"#RRGGBB"``, 12 bit: ``"#RRRGGGBBB"`` ou 16 bit: ``"#RRRRGGGGBBBB"``, onde R,G,B aqui representam qualquer dígito hexadecimal legal. Veja a página 160 do livro de Ousterhout para detalhes.

source: The standard X cursor names from :file:`cursorfont.h` can be used, without the ``XC_`` prefix. For example to get a hand cursor (:const:`XC_hand2`), use the string ``"hand2"``. You can also specify a bitmap and mask file of your own. See page 179 of Ousterhout's book.
pt_br: Os nomes de cursor X padrão de :file:`cursorfont.h` podem ser usados, sem o prefixo ``XC_``. Por exemplo, para obter um cursor de mão (:const:`XC_hand2`), use a string ``"hand2"``. Você também pode especificar um bitmap e um arquivo de máscara de sua preferência. Veja a página 179 do livro de Ousterhout.

source: Screen distances can be specified in either pixels or absolute distances. Pixels are given as numbers and absolute distances as strings, with the trailing character denoting units: ``c`` for centimetres, ``i`` for inches, ``m`` for millimetres, ``p`` for printer's points. For example, 3.5 inches is expressed as ``"3.5i"``.
pt_br: As distâncias da tela podem ser especificadas em pixels ou distâncias absolutas. Pixels são dados como números e distâncias absolutas como strings, com os caracteres finais denotando unidades: ``c`` para centímetros, ``i`` para polegadas, ``m`` para milímetros, ``p`` para os pontos da impressora. Por exemplo, 3,5 polegadas é expresso como ``"3.5i"``.

source: Tk uses a list font name format, such as ``{courier 10 bold}``. Font sizes with positive numbers are measured in points; sizes with negative numbers are measured in pixels.
pt_br: Tk usa um formato de nome de fonte de lista, como ``{courier 10 bold}``. Tamanhos de fonte com números positivos são medidos em pontos; tamanhos com números negativos são medidos em pixels.

source: geometry
pt_br: geometria

source: This is a string of the form ``widthxheight``, where width and height are measured in pixels for most widgets (in characters for widgets displaying text). For example: ``fred["geometry"] = "200x100"``.
pt_br: Esta é uma string no formato ``widthxheight``, onde largura e altura são medidas em pixels para a maioria dos widgets (em caracteres para widgets que exibem texto). Por exemplo: ``fred["geometry"] = "200x100"``.

source: Legal values are the strings: ``"left"``, ``"center"``, ``"right"``, and ``"fill"``.
pt_br: Valores aceitos são as strings: ``"left"``, ``"center"``, ``"right"`` e ``"fill"``.

source: This is a string with four space-delimited elements, each of which is a legal distance (see above). For example: ``"2 3 4 5"`` and ``"3i 2i 4.5i 2i"`` and ``"3c 2c 4c 10.43c"`` are all legal regions.
pt_br: Esta é uma string com quatro elementos delimitados por espaço, cada um dos quais a uma distância legal (veja acima). Por exemplo: ``"2 3 4 5"`` e ``"3i 2i 4.5i 2i"`` e ``"3c 2c 4c 10.43c"`` são todas regiões legais.

source: Determines what the border style of a widget will be. Legal values are: ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"``, and ``"ridge"``.
pt_br: Determina qual será o estilo da borda de um widget. Os valores legais são: ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"`` e ``"ridge"``.

source: This is almost always the :meth:`!set` method of some scrollbar widget, but can be any widget method that takes a single argument.
pt_br: Este é quase sempre o método :meth:`!set` de algum widget da barra de rolagem, mas pode ser qualquer método de widget que receba um único argumento.

source: Must be one of: ``"none"``, ``"char"``, or ``"word"``.
pt_br: Deve ser um de: ``"none"``, ``"char"`` ou ``"word"``.

source: Bindings and Events
pt_br: Ligações e Eventos

source: The bind method from the widget command allows you to watch for certain events and to have a callback function trigger when that event type occurs. The form of the bind method is::
pt_br: O método de ligação do comando widget permite que você observe certos eventos e tenha um acionamento de função de retorno de chamada quando esse tipo de evento ocorrer. A forma do método de ligação é::

source: where:
pt_br: sendo que:

source: is a string that denotes the target kind of event. (See the :manpage:`bind(3tk)` man page, and page 201 of John Ousterhout's book, :title-reference:`Tcl and the Tk Toolkit (2nd edition)`, for details).
pt_br: é uma string que denota o tipo de evento de destino. (Veja a página man do :manpage:`bind(3tk)` e a página 201 do livro de John Ousterhout, :title-reference:`Tcl and the Tk Toolkit (2nd edition)`, para mais detalhes).

source: is a Python function, taking one argument, to be invoked when the event occurs. An Event instance will be passed as the argument. (Functions deployed this way are commonly known as *callbacks*.)
pt_br: é uma função Python, tendo um argumento, a ser invocada quando o evento ocorre. Uma instância de evento será passada como argumento. (As funções implantadas dessa forma são comumente conhecidas como *funções de retorno*.)

source: is optional, either ``''`` or ``'+'``. Passing an empty string denotes that this binding is to replace any other bindings that this event is associated with. Passing a ``'+'`` means that this function is to be added to the list of functions bound to this event type.
pt_br: é opcional, tanto ``''`` ou ``'+'``. Passar uma string vazia indica que essa ligação substitui todas as outras ligações às quais esse evento está associado. Passar um ``'+'`` significa que esta função deve ser adicionada à lista de funções ligadas a este tipo de evento.

source: Notice how the widget field of the event is being accessed in the ``turn_red()`` callback. This field contains the widget that caught the X event. The following table lists the other event fields you can access, and how they are denoted in Tk, which can be useful when referring to the Tk man pages.
pt_br: Observe como o campo widget do evento está sendo acessado na função de retorno ``turn_red()``. Este campo contém o widget que capturou o evento X. A tabela a seguir lista os outros campos de evento que você pode acessar e como eles são denotados no Tk, o que pode ser útil ao se referir às páginas man do Tk.

source: Tkinter Event Field
pt_br: Campo de Eventos do Tkinter

source: type
pt_br: tipo

source: The index Parameter
pt_br: O Parâmetro index

source: A number of widgets require "index" parameters to be passed. These are used to point at a specific place in a Text widget, or to particular characters in an Entry widget, or to particular menu items in a Menu widget.
pt_br: Vários widgets requerem que parâmetros de "indx" sejam passados. Eles são usados para apontar para um local específico em um widget Text, ou para caracteres específicos em um widget Entry, ou para itens de menu específicos em um widget Menu.

source: Entry widget indexes (index, view index, etc.)
pt_br: Índices de widget de entrada (índice, índice de visualização, etc.)

source: Entry widgets have options that refer to character positions in the text being displayed. You can use these :mod:`tkinter` functions to access these special points in text widgets:
pt_br: Os widgets de entrada têm opções que se referem às posições dos caracteres no texto exibido. Você pode acessar esses pontos especiais em um widget de texto usando as seguintes funções :mod:`tkinter`:

source: Text widget indexes
pt_br: Índice de widget de texto

source: The index notation for Text widgets is very rich and is best described in the Tk man pages.
pt_br: A notação de índice do widget de texto é muito rica e é melhor detalhada nas páginas do manual Tk.

source: Menu indexes (menu.invoke(), menu.entryconfig(), etc.)
pt_br: Índices de menu (menu.invoke(), menu.entryconfig(), etc.)

source: Some options and methods for menus manipulate specific menu entries. Anytime a menu index is needed for an option or a parameter, you may pass in:
pt_br: Algumas opções e métodos de menus manipulam entradas de menu específicas. Sempre que um índice de menu é necessário para uma opção ou parâmetro, você pode passar:

source: an integer which refers to the numeric position of the entry in the widget, counted from the top, starting with 0;
pt_br: um número inteiro que se refere à posição numérica da entrada no widget, contada do topo, começando com 0;

source: the string ``"active"``, which refers to the menu position that is currently under the cursor;
pt_br: a string ``"active"``, que se refere à posição do menu que está atualmente sob o cursor;

source: the string ``"last"`` which refers to the last menu item;
pt_br: a string ``"last"`` que se refere ao último item do menu;

source: An integer preceded by ``@``, as in ``@6``, where the integer is interpreted as a y pixel coordinate in the menu's coordinate system;
pt_br: Um inteiro precedido por ``@``, como em ``@6``, onde o inteiro é interpretado como uma coordenada de pixel y no sistema de coordenadas do menu;

source: the string ``"none"``, which indicates no menu entry at all, most often used with menu.activate() to deactivate all entries, and finally,
pt_br: a string ``"none"``, que indica nenhuma entrada de menu, mais frequentemente usada com menu.activate() para desativar todas as entradas e, finalmente,

source: a text string that is pattern matched against the label of the menu entry, as scanned from the top of the menu to the bottom. Note that this index type is considered after all the others, which means that matches for menu items labelled ``last``, ``active``, or ``none`` may be interpreted as the above literals, instead.
pt_br: uma string de texto cujo padrão corresponde ao rótulo da entrada do menu, conforme varrido da parte superior do menu para a parte inferior. Observe que este tipo de índice é considerado após todos os outros, o que significa que as correspondências para itens de menu rotulados como ``last``, ``active`` ou ``none`` podem ser interpretadas como os literais acima, em vez disso.

source: Images
pt_br: Imagens

source: Images of different formats can be created through the corresponding subclass of :class:`tkinter.Image`:
pt_br: Imagens de diferentes formatos podem ser criadas por meio da subclasse correspondente de :class:`tkinter.Image`:

source: :class:`BitmapImage` for images in XBM format.
pt_br: :class:`BitmapImage` para imagens no formato XBM.

source: :class:`PhotoImage` for images in PGM, PPM, GIF and PNG formats. The latter is supported starting with Tk 8.6.
pt_br: :class:`PhotoImage` para imagens nos formatos PGM, PPM, GIF e PNG. O suporte ao último foi adicionado a partir do Tk 8.6.
