Repository: python/python-docs-pt-br
Catalog: library/tkinter.font.po
Languages: pt_br

source: :mod:`!tkinter.font` --- Tkinter font wrapper
pt_br: :mod:`!tkinter.font` --- Invólucro de fontes Tkinter

source: **Source code:** :source:`Lib/tkinter/font.py`
pt_br: **Código-fonte:** :source:`Lib/tkinter/font.py`

source: The :mod:`tkinter.font` module provides the :class:`Font` class for creating and using named fonts.
pt_br: O módulo :mod:`tkinter.font` apresenta a classe :class:`Font` para criação e utilização de fontes nomeadas.

source: The different font weights and slants are:
pt_br: Os diferentes pesos e inclinações de fontes são:

source: The :class:`Font` class represents a named font. *Font* instances are given unique names and can be specified by their family, size, and style configuration. Named fonts are Tk's method of creating and identifying fonts as a single object, rather than specifying a font by its attributes with each occurrence.
pt_br: A classe :class:`Font` representa uma fonte nomeada. Instâncias *font* recebem nomes únicos e podem ser especificadas por família, tamanho e configuração de estilo. Fontes nomeadas são os métodos Tk para criação e identificação de fontes de um objeto singular, ao invés de especificar a fonte por seus atributos em cada ocorrência.

source: arguments:
pt_br: argumentos:

source: *font* - font specifier tuple (family, size, options)
pt_br: *font* - tupla de especificação da fonte (família, tamanho, opções)

source: *name* - unique font name
pt_br: *name* - nome único da fonte

source: *exists* - self points to existing named font if true
pt_br: *exists* - aponta para uma fonte nomeada existente se for verdadeiro

source: additional keyword options (ignored if *font* is specified):
pt_br: palavras reservadas opcionais (ignoradas caso *font* seja especificado):

source: *family* - font family i.e. Courier, Times
pt_br: *family* - a família da fonte e.x. Courier, Times

source: *size* - font size
pt_br: *size* - tamanho da fonte

source: If *size* is positive it is interpreted as size in points.
pt_br: Se *size* for positivo, ele é interpretado como tamanho em pontos.

source: If *size* is a negative number its absolute value is treated
pt_br: Caso *size* seja um número negativo, seu valor absoluto é tratado

source: as size in pixels.
pt_br: como tamanho em pixels.

source: *weight* - font emphasis (NORMAL, BOLD)
pt_br: *weight* - ênfase da fonte (normal,negrito)

source: *underline* - font underlining (0 - none, 1 - underline)
pt_br: *underline* - sublinhamento da fonte (0 - sem sublinhamento, 1 - sublinhado)

source: *overstrike* - font strikeout (0 - none, 1 - strikeout)
pt_br: *overstrike* - fonte riscada (0 - sem risco, 1 - letras riscadas)

source: Return the attributes of the font.
pt_br: Retorna os atributos da fonte.

source: Retrieve an attribute of the font.
pt_br: Recupera um atributo da fonte.

source: Modify attributes of the font.
pt_br: Modifica atributos da fonte.

source: Return new instance of the current font.
pt_br: Retorna uma nova instância da fonte atual.

source: Return amount of space the text would occupy on the specified display when formatted in the current font. If no display is specified then the main application window is assumed.
pt_br: Retorna a quantidade de espaço que o texto ocuparia na exibição especificada ao ser formatado na fonte atual. Caso nenhuma exibição seja especificada, a exibição presumida será a da janela principal da aplicação.

source: Return font-specific data. Options include:
pt_br: Retorna dados específicos da fonte. Opções inclusas:

source: *ascent* - distance between baseline and highest point that a
pt_br: *ascent* - distância entre a linha de base e o ponto mais alto que um

source: character of the font can occupy
pt_br: caractere da fonte pode ocupar

source: *descent* - distance between baseline and lowest point that a
pt_br: *descent* - distância entre a linha de base e o ponto mais baixo que um

source: *linespace* - minimum vertical separation necessary between any two
pt_br: *linespace* - separação vertical mínima necessária entre dois

source: characters of the font that ensures no vertical overlap between lines.
pt_br: caracteres da fonte que garante que não ocorra sobreposição entre as linhas.

source: *fixed* - 1 if font is fixed-width else 0
pt_br: *fixed* - 1 caso a fonte seja de largura fixa, 0 caso contrário

source: Return the different font families.
pt_br: Retorna as diferentes famílias de fontes.

source: Return the names of defined fonts.
pt_br: Retorna os nomes das fontes definidas.

source: Return a :class:`Font` representation of a tk named font.
pt_br: Retorna a representação :class:`Font` de uma fonte nomeada do tk.

source: The *root* parameter was added.
pt_br: O parâmetro *root* foi adicionado.
