Repository: python/python-docs-pt-br
Catalog: library/tomllib.po
Languages: pt_br

source: :mod:`!tomllib` --- Parse TOML files
pt_br: :mod:`!tomllib` --- Analisa arquivos TOML

source: **Source code:** :source:`Lib/tomllib`
pt_br: **Código-fonte:** :source:`Lib/tomllib`

source: This module provides an interface for parsing TOML 1.0.0 (Tom's Obvious Minimal Language, `https://toml.io <https://toml.io/en/>`_). This module does not support writing TOML.
pt_br: Este módulo fornece uma interface para analisar TOML 1.0.0 (Tom's Obvious Minimal Language, `https://toml.io <https://toml.io/pt/>`_). Este módulo não oferece suporte para escrever TOML.

source: The :pypi:`Tomli-W package <tomli-w>` is a TOML writer that can be used in conjunction with this module, providing a write API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
pt_br: O :pypi:`pacote Tomli-W <tomli-w>` é um editor de TOML que pode ser usado em conjunto com este módulo, fornecendo uma API de escrita familiar aos usuários da biblioteca padrão: módulos :mod:`marshal` e :mod:`pickle`.

source: The :pypi:`TOML Kit package <tomlkit>` is a style-preserving TOML library with both read and write capability. It is a recommended replacement for this module for editing already existing TOML files.
pt_br: O :pypi:`pacote TOML Kit <tomlkit>` é uma biblioteca TOML de preservação de estilo com capacidade de leitura e escrita. É uma substituição recomendada para este módulo para edição de arquivos TOML já existentes.

source: This module defines the following functions:
pt_br: Este módulo define as seguintes funções:

source: Read a TOML file. The first argument should be a readable and binary file object. Return a :class:`dict`. Convert TOML types to Python using this :ref:`conversion table <toml-to-py-table>`.
pt_br: Lê um arquivo TOML. O primeiro argumento deve ser um objeto arquivo binário e legível. Retorna um :class:`dict`. Converte tipos TOML para Python usando esta :ref:`tabela de conversão <toml-to-py-table>`.

source: *parse_float* will be called with the string of every TOML float to be decoded. By default, this is equivalent to ``float(num_str)``. This can be used to use another datatype or parser for TOML floats (e.g. :class:`decimal.Decimal`). The callable must not return a :class:`dict` or a :class:`list`, else a :exc:`ValueError` is raised.
pt_br: *parse_float* será chamado com a string de cada ponto flutuante (float) do TOML a ser decodificado. Por padrão, isso é equivalente a ``float(num_str)``. Isso pode ser usado para usar outro tipo de dados ou analisador sintático para pontos flutuantes do TOML (por exemplo, :class:`decimal.Decimal`). O chamável não deve retornar um :class:`dict` ou um :class:`list`, senão uma exceção :exc:`ValueError` é levantada.

source: A :exc:`TOMLDecodeError` will be raised on an invalid TOML document.
pt_br: Uma exceção :exc:`TOMLDecodeError` será levantada no caso de um documento TOML inválido.

source: Load TOML from a :class:`str` object. Return a :class:`dict`. Convert TOML types to Python using this :ref:`conversion table <toml-to-py-table>`. The *parse_float* argument has the same meaning as in :func:`load`.
pt_br: Carrega TOML de um objeto :class:`str`. Retorna um :class:`dict`. Converte tipos TOML para Python usando esta :ref:`tabela de conversão <toml-to-py-table>`. O argumento *parse_float* tem o mesmo significado que em :func:`load`.

source: The following exceptions are available:
pt_br: As seguintes exceções estão disponíveis:

source: Subclass of :exc:`ValueError` with the following additional attributes:
pt_br: Subclasse de :exc:`ValueError` com os seguintes atributos adicionais:

source: The unformatted error message.
pt_br: A mensagem de erro não formatada.

source: The TOML document being parsed.
pt_br: O documento TOML sendo analisado.

source: The index of *doc* where parsing failed.
pt_br: O índice de *doc* onde a análise falhou.

source: The line corresponding to *pos*.
pt_br: A linha correspondente a *pos*.

source: The column corresponding to *pos*.
pt_br: A coluna correspondente a *pos*.

source: Added the *msg*, *doc* and *pos* parameters. Added the :attr:`msg`, :attr:`doc`, :attr:`pos`, :attr:`lineno` and :attr:`colno` attributes.
pt_br: Adicionados os parâmetros *msg*, *doc* e *pos*. Adicionados os atributos :attr:`msg`, :attr:`doc`, :attr:`pos`, :attr:`lineno` e :attr:`colno`.

source: Passing free-form positional arguments is deprecated.
pt_br: A passagem de argumentos posicionais de forma livre está descontinuada.

source: Examples
pt_br: Exemplos

source: Parsing a TOML file::
pt_br: Analisando um arquivo TOML::

source: Parsing a TOML string::
pt_br: Analisando uma string TOML::

source: Conversion Table
pt_br: Tabela de conversão

source: TOML document
pt_br: documento TOML

source: integer
pt_br: inteiro

source: float
pt_br: ponto flutuante

source: float (configurable with *parse_float*)
pt_br: ponto flutuante (configurável com *parse_float*)

source: boolean
pt_br: booleano

source: offset date-time
pt_br: deslocamento de data-hora

source: datetime.datetime (``tzinfo`` attribute set to an instance of ``datetime.timezone``)
pt_br: datetime.datetime (atributo de ``tzinfo`` definido com uma instância de ``datetime.timezone``)

source: local date-time
pt_br: data-hora local

source: datetime.datetime (``tzinfo`` attribute set to ``None``)
pt_br: datetime.datetime (atributo de ``tzinfo`` definido com ``None``)

source: local date
pt_br: data local

source: local time
pt_br: hora local

source: list
pt_br: lista

source: table
pt_br: tabela

source: inline table
pt_br: tabela inline

source: array of tables
pt_br: array de tabelas

source: list of dicts
pt_br: lista de dicionários
