Repository: python/python-docs-pt-br
Catalog: library/traceback.po
Languages: pt_br

source: Construct a :class:`!StackSummary` object from a frame generator (such as is returned by :func:`~traceback.walk_stack` or :func:`~traceback.walk_tb`).
pt_br: Создайте объект :class:`!StackSummary` из генератора кадров (например, возвращаемый :func:`~traceback.walk_stack` или :func:`~traceback.walk_tb`).

source: If *limit* is supplied, only this many frames are taken from *frame_gen*. If *lookup_lines* is ``False``, the returned :class:`FrameSummary` objects will not have read their lines in yet, making the cost of creating the :class:`!StackSummary` cheaper (which may be valuable if it may not actually get formatted). If *capture_locals* is ``True`` the local variables in each :class:`!FrameSummary` are captured as object representations.
pt_br: Если указан *limit*, из *frame_gen* берется только это количество кадров. Если *lookup_lines* имеет значение False, возвращаемые объекты :class:`FrameSummary` еще не прочитают свои строки, что удешевляет стоимость создания :class:`!StackSummary` (что может быть полезно, если на самом деле может не отформатироваться). Если *capture_locals* имеет значение True, локальные переменные в каждом :class:`!FrameSummary` захватываются как представления объектов.

source: Exceptions raised from :func:`repr` on a local variable (when *capture_locals* is ``True``) are no longer propagated to the caller.
pt_br: Исключения, возникающие из :func:`repr` для локальной переменной (когда *capture_locals* имеет значение ``True``), больше не передаются вызывающей стороне.

source: Construct a :class:`!StackSummary` object from a supplied list of :class:`FrameSummary` objects or old-style list of tuples. Each tuple should be a 4-tuple with *filename*, *lineno*, *name*, *line* as the elements.
pt_br: Создайте объект :class:`!StackSummary` из предоставленного списка объектов :class:`FrameSummary` или списка кортежей старого стиля. Каждый кортеж должен состоять из четырех кортежей с элементами *filename*, *lineno*, *name*, *line*.

source: Returns a list of strings ready for printing. Each string in the resulting list corresponds to a single :ref:`frame <frame-objects>` from the stack. Each string ends in a newline; the strings may contain internal newlines as well, for those items with source text lines.
pt_br: Возвращает список строк, готовых к печати. Каждая строка в результирующем списке соответствует одному :ref:`frame <frame-objects>` из стека. Каждая строка заканчивается новой строкой; строки также могут содержать внутренние символы новой строки для элементов со строками исходного текста.

source: For long sequences of the same frame and line, the first few repetitions are shown, followed by a summary line stating the exact number of further repetitions.
pt_br: Для довгих послідовностей того самого кадру та рядка відображаються перші кілька повторів, за якими йде підсумковий рядок із зазначенням точної кількості подальших повторень.

source: Long sequences of repeated frames are now abbreviated.
pt_br: Довгі послідовності повторюваних кадрів тепер скорочуються.

source: Returns a string for printing one of the :ref:`frames <frame-objects>` involved in the stack. This method is called for each :class:`FrameSummary` object to be printed by :meth:`StackSummary.format`. If it returns ``None``, the frame is omitted from the output.
pt_br: Возвращает строку для печати одного из :ref:`frames <frame-objects>`, включенного в стек. Этот метод вызывается для каждого объекта :class:`FrameSummary`, который должен быть напечатан с помощью :meth:`StackSummary.format`. Если он возвращает None, кадр исключается из вывода.

source: :class:`!FrameSummary` Objects
pt_br: :class:`!FrameSummary` Объекты

source: A :class:`!FrameSummary` object represents a single :ref:`frame <frame-objects>` in a :ref:`traceback <traceback-objects>`.
pt_br: Объект :class:`!FrameSummary` представляет один :ref:`frame <frame-objects>` в :ref:`traceback <traceback-objects>`.

source: :class:`!FrameSummary` instances have the following attributes:
pt_br: Экземпляры :class:`!FrameSummary` имеют следующие атрибуты:

source: The filename of the source code for this frame. Equivalent to accessing :attr:`f.f_code.co_filename <codeobject.co_filename>` on a :ref:`frame object <frame-objects>` *f*.
pt_br: Имя файла исходного кода для этого кадра. Эквивалентно доступу к :attr:`f.f_code.co_filename <codeobject.co_filename>` в :ref:`frame object <frame-objects>` *f*.

source: The line number of the source code for this frame.
pt_br: Номер строки исходного кода для этого кадра.

source: Equivalent to accessing :attr:`f.f_code.co_name <codeobject.co_name>` on a :ref:`frame object <frame-objects>` *f*.
pt_br: Эквивалентно доступу к :attr:`f.f_code.co_name <codeobject.co_name>` в :ref:`frame-объекте <frame-objects>` *f*.

source: A string representing the source code for this frame, with leading and trailing whitespace stripped. If the source is not available, it is ``None``.
pt_br: Строка, представляющая исходный код для этого кадра, с удаленными начальными и конечными пробелами. Если источник недоступен, это «Нет».

source: The column number of the source code for this frame. By default, it is ``None`` and indexation starts from 0.
pt_br: 该帧源代码的列号。 在默认情况下，它将为 ``None`` 且索引号从 0 开始。

source: The last column number of the source code for this frame. By default, it is ``None`` and indexation starts from 0.
pt_br: 该帧源代码的末尾列号。 在默认情况下，它将为 ``None`` 且索引号从 0 开始。

source: Examples of Using the Module-Level Functions
pt_br: Примеры использования функций уровня модуля

source: This simple example implements a basic read-eval-print loop, similar to (but less useful than) the standard Python interactive interpreter loop. For a more complete implementation of the interpreter loop, refer to the :mod:`code` module. ::
pt_br: Цей простий приклад реалізує базовий цикл читання-оцінки-друку, подібний (але менш корисний, ніж) стандартний інтерактивний цикл інтерпретатора Python. Для більш повної реалізації циклу інтерпретатора зверніться до модуля :mod:`code`. ::

source: import sys, traceback def run_user_code(envdir): source = input(">>> ") try: exec(source, envdir) except Exception: print("Exception in user code:") print("-"*60) traceback.print_exc(file=sys.stdout) print("-"*60) envdir = {} while True: run_user_code(envdir)
pt_br: import sys, traceback def run_user_code(envdir): source = input(">>> ") try: exec(source, envdir) except Exception: print("Wyjątek w kodzie użytkownika:") print("-"*60) traceback.print_exc(file=sys.stdout) print("-"*60) envdir = {} while True: run_user_code(envdir)

source: The following example demonstrates the different ways to print and format the exception and traceback:
pt_br: У наступному прикладі демонструються різні способи друку та форматування винятку та зворотного відстеження:

source: The output for the example would look similar to this:
pt_br: Вихід для прикладу виглядатиме приблизно так:

source: The following example shows the different ways to print and format the stack::
pt_br: У наступному прикладі показано різні способи друку та форматування стосу:

source: This last example demonstrates the final few formatting functions:
pt_br: Цей останній приклад демонструє кілька останніх функцій форматування:

source: Examples of Using :class:`TracebackException`
pt_br: Примеры использования :class:`TracebackException`

source: With the helper class, we have more options::
pt_br: С вспомогательным классом у нас есть больше возможностей:

source: >>> import sys >>> from traceback import TracebackException >>> >>> def lumberjack(): ... bright_side_of_life() ... >>> def bright_side_of_life(): ... t = "bright", "side", "of", "life" ... return t[5] ... >>> try: ... lumberjack() ... except IndexError as e: ... exc = e ... >>> try: ... try: ... lumberjack() ... except: ... 1/0 ... except Exception as e: ... chained_exc = e ... >>> # limit works as with the module-level functions >>> TracebackException.from_exception(exc, limit=-2).print() Traceback (most recent call last): File "<python-input-1>", line 6, in lumberjack bright_side_of_life() ~~~~~~~~~~~~~~~~~~~^^ File "<python-input-1>", line 10, in bright_side_of_life return t[5] ~^^^ IndexError: tuple index out of range >>> # capture_locals adds local variables in frames >>> TracebackException.from_exception(exc, limit=-2, capture_locals=True).print() Traceback (most recent call last): File "<python-input-1>", line 6, in lumberjack bright_side_of_life() ~~~~~~~~~~~~~~~~~~~^^ File "<python-input-1>", line 10, in bright_side_of_life return t[5] ~^^^ t = ("bright", "side", "of", "life") IndexError: tuple index out of range >>> # The *chain* kwarg to print() controls whether chained >>> # exceptions are displayed >>> TracebackException.from_exception(chained_exc).print() Traceback (most recent call last): File "<python-input-19>", line 4, in <module> lumberjack() ~~~~~~~~~~^^ File "<python-input-8>", line 7, in lumberjack bright_side_of_life() ~~~~~~~~~~~~~~~~~~~^^ File "<python-input-8>", line 11, in bright_side_of_life return t[5] ~^^^ IndexError: tuple index out of range During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<python-input-19>", line 6, in <module> 1/0 ~^~ ZeroDivisionError: division by zero >>> TracebackException.from_exception(chained_exc).print(chain=False) Traceback (most recent call last): File "<python-input-19>", line 6, in <module> 1/0 ~^~ ZeroDivisionError: division by zero
pt_br: >>> import sys >>> from traceback import TracebackException >>> >>> def lumberjack(): ... bright_side_of_life() ... >>> def bright_side_of_life(): ... t = "bright", "side", "of", "life" ... return t[5] ... >>> try: ... lumberjack() ... except IndexError as e: ... exc = e ... >>> try: ... try: ... lumberjack() ... except: ... 1/0 ... except Exception as e: ... chained_exc = e ... >>> # limit działa tak jak z funkcjami na poziomie modułu >>> TracebackException.from_exception(exc, limit=-2).print() Traceback (most recent call last): File "<python-input-1>", line 6, in lumberjack bright_side_of_life() ~~~~~~~~~~~~~~~~~~~^^ File "<python-input-1>", line 10, in bright_side_of_life return t[5] ~^^^ IndexError: tuple index out of range >>> # capture_locals dodaje lokalne zmienne do ramek >>> TracebackException.from_exception(exc, limit=-2, capture_locals=True).print() Traceback (most recent call last): File "<python-input-1>", line 6, in lumberjack bright_side_of_life() ~~~~~~~~~~~~~~~~~~~^^ File "<python-input-1>", line 10, in bright_side_of_life return t[5] ~^^^ t = ("bright", "side", "of", "life") IndexError: tuple index out of range >>> # argument nazwany *chain* metody print() kontroluje, czy wyjątki >>> # z łańcucha są wyświetlane >>> TracebackException.from_exception(chained_exc).print() Traceback (most recent call last): File "<python-input-19>", line 4, in <module> lumberjack() ~~~~~~~~~~^^ File "<python-input-8>", line 7, in lumberjack bright_side_of_life() ~~~~~~~~~~~~~~~~~~~^^ File "<python-input-8>", line 11, in bright_side_of_life return t[5] ~^^^ IndexError: tuple index out of range During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<python-input-19>", line 6, in <module> 1/0 ~^~ ZeroDivisionError: division by zero >>> TracebackException.from_exception(chained_exc).print(chain=False) Traceback (most recent call last): File "<python-input-19>", line 6, in <module> 1/0 ~^~ ZeroDivisionError: division by zero

source: object
pt_br: objeto

source: ^ (caret)
pt_br: ^ (circunflexo)

source: marker
pt_br: маркер
