Repository: python/python-docs-pt-br
Catalog: library/trace.po
Languages: pt_br

source: :mod:`!trace` --- Trace or track Python statement execution
pt_br: :mod:`!trace` --- Rastreia ou acompanha a execução de instruções Python

source: **Source code:** :source:`Lib/trace.py`
pt_br: **Código-fonte:** :source:`Lib/trace.py`

source: The :mod:`trace` module allows you to trace program execution, generate annotated statement coverage listings, print caller/callee relationships and list functions executed during a program run. It can be used in another program or from the command line.
pt_br: O módulo :mod:`trace` permite que você rastreie a execução do programa, gere listagens de cobertura de instrução anotada, imprima relações de chamador/receptor e funções de lista executadas durante a execução de um programa. Ele pode ser usado em outro programa ou na linha de comando.

source: A popular third-party coverage tool that provides HTML output along with advanced features such as branch coverage.
pt_br: Uma popular ferramenta de cobertura de terceiros que fornece saída HTML junto com recursos avançados, como cobertura de ramificações.

source: Command-Line Usage
pt_br: Uso na linha de comando

source: The :mod:`trace` module can be invoked from the command line. It can be as simple as ::
pt_br: O módulo :mod:`trace` pode ser chamado a partir da linha de comando. Pode ser tão simples quanto::

source: python -m trace --count -C . somefile.py ...
pt_br: python -m trace --count -C . algumarquivo.py ...

source: The above will execute :file:`somefile.py` and generate annotated listings of all Python modules imported during the execution into the current directory.
pt_br: O comando acima irá executar :file:`algumarquivo.py` e gerar listagens anotadas de todos os módulos Python importados durante a execução para o diretório atual.

source: Display usage and exit.
pt_br: Exibe o modo de uso e sai.

source: Display the version of the module and exit.
pt_br: Exibe a versão do módulo e sai.

source: Added ``--module`` option that allows to run an executable module.
pt_br: Adicionada a opção ``--module`` que permite executar um módulo executável.

source: Main options
pt_br: Opções principais

source: At least one of the following options must be specified when invoking :mod:`trace`. The :option:`--listfuncs <-l>` option is mutually exclusive with the :option:`--trace <-t>` and :option:`--count <-c>` options. When :option:`--listfuncs <-l>` is provided, neither :option:`--count <-c>` nor :option:`--trace <-t>` are accepted, and vice versa.
pt_br: Pelo menos uma das seguintes opções deve ser especificada ao invocar :mod:`trace`. A opção :option:`--listfuncs <-l>` é mutuamente exclusiva com as opções :option:`--trace <-t>` e :option:`--count <-c>`. Quando :option:`--listfuncs <-l>` é fornecida, nem :option:`--count <-c>` nem :option:`--trace <-t>` são aceitas, e vice-versa.

source: Produce a set of annotated listing files upon program completion that shows how many times each statement was executed. See also :option:`--coverdir <-C>`, :option:`--file <-f>` and :option:`--no-report <-R>` below.
pt_br: Produz um conjunto de arquivos de listagem anotada após a conclusão do programa que mostra quantas vezes cada instrução foi executada. Veja também :option:`--coverdir <-C>`, :option:`--file <-f>` e :option:`--no-report <-R>` abaixo.

source: Display lines as they are executed.
pt_br: Exibe linhas como elas são executadas.

source: Display the functions executed by running the program.
pt_br: Exibe as funções executadas executando o programa.

source: Produce an annotated list from an earlier program run that used the :option:`--count <-c>` and :option:`--file <-f>` option. This does not execute any code.
pt_br: Produz uma lista anotada de uma execução de programa anterior que usava a opção :option:`--count <-c>` e :option:`--file <-f>`. Isso não executa nenhum código.

source: Display the calling relationships exposed by running the program.
pt_br: Exibe os relacionamentos de chamada expostos ao executar o programa.

source: Modifiers
pt_br: Modificadores

source: Name of a file to accumulate counts over several tracing runs. Should be used with the :option:`--count <-c>` option.
pt_br: Nome de um arquivo para acumular contagens em várias execuções de rastreamento. Deve ser usado com a opção :option:`--count <-c>`.

source: Directory where the report files go. The coverage report for ``package.module`` is written to file :file:`{dir}/{package}/{module}.cover`.
pt_br: Diretório para onde vão os arquivos de relatório. O relatório de cobertura para ``pacote.módulo`` é escrito em arquivo :file:`{dir}/{pacote}/{módulo}.cover`.

source: When generating annotated listings, mark lines which were not executed with ``>>>>>>``.
pt_br: Ao gerar listagens anotadas, marca as linhas que não foram executadas com ``>>>>>>``.

source: When using :option:`--count <-c>` or :option:`--report <-r>`, write a brief summary to stdout for each file processed.
pt_br: Ao usar :option:`--count <-c>` ou :option:`--report <-r>`, escreve um breve resumo no stdout para cada arquivo processado.

source: Do not generate annotated listings. This is useful if you intend to make several runs with :option:`--count <-c>`, and then produce a single set of annotated listings at the end.
pt_br: Não gera listagens anotadas. Isso é útil se você pretende fazer várias execuções com :option:`--count <-c>`, e então produzir um único conjunto de listagens anotadas no final.

source: Prefix each line with the time since the program started. Only used while tracing.
pt_br: Prefixa cada linha com o tempo desde o início do programa. Usado apenas durante o rastreamento.

source: Filters
pt_br: Filtros

source: These options may be repeated multiple times.
pt_br: Essas opções podem ser repetidas várias vezes.

source: Ignore each of the given module names and its submodules (if it is a package). The argument can be a list of names separated by a comma.
pt_br: Ignora cada um dos nomes de módulo fornecidos e seus submódulos (se for um pacote). O argumento pode ser uma lista de nomes separados por uma vírgula.

source: Ignore all modules and packages in the named directory and subdirectories. The argument can be a list of directories separated by :data:`os.pathsep`.
pt_br: Ignora todos os módulos e pacotes no diretório e subdiretórios nomeados. O argumento pode ser uma lista de diretórios separados por :data:`os.pathsep`.

source: Programmatic Interface
pt_br: Interface programática

source: Create an object to trace execution of a single statement or expression. All parameters are optional. *count* enables counting of line numbers. *trace* enables line execution tracing. *countfuncs* enables listing of the functions called during the run. *countcallers* enables call relationship tracking. *ignoremods* is a list of modules or packages to ignore. *ignoredirs* is a list of directories whose modules or packages should be ignored. *infile* is the name of the file from which to read stored count information. *outfile* is the name of the file in which to write updated count information. *timing* enables a timestamp relative to when tracing was started to be displayed.
pt_br: Cria um objeto para rastrear a execução de uma única instrução ou expressão. Todos os parâmetros são opcionais. *count* ativa a contagem de números de linha. *trace* ativa o rastreamento de execução de linha. *countfuncs* ativa a listagem das funções chamadas durante a execução. *countcallers* ativa o rastreamento de relacionamento de chamada. *ignoremods* é uma lista de módulos ou pacotes a serem ignorados. *ignoreirs* é uma lista de diretórios cujos módulos ou pacotes devem ser ignorados. *infile* é o nome do arquivo do qual deve ler as informações de contagem armazenadas. *outfile* é o nome do arquivo no qual deve escrever as informações de contagem atualizadas. *timing* ativa a exibição de um carimbo de data/hora relativo ao momento em que o rastreamento foi iniciado.

source: Execute the command and gather statistics from the execution with the current tracing parameters. *cmd* must be a string or code object, suitable for passing into :func:`exec`.
pt_br: Executa o comando e reúne estatísticas da execução com os parâmetros de rastreamento atuais. *cmd* deve ser uma string ou objeto código, adequado para passar para :func:`exec`.

source: Execute the command and gather statistics from the execution with the current tracing parameters, in the defined global and local environments. If not defined, *globals* and *locals* default to empty dictionaries.
pt_br: Executa o comando e reúne estatísticas da execução com os parâmetros de rastreamento atuais, nos ambientes global e local definidos. Se não for definido, *globals* e *locals* usam como padrão dicionários vazios.

source: Call *func* with the given arguments under control of the :class:`Trace` object with the current tracing parameters.
pt_br: Chama *func* com os argumentos fornecidos sob controle do objeto :class:`Trace` com os parâmetros de rastreamento atuais.

source: Return a :class:`CoverageResults` object that contains the cumulative results of all previous calls to ``run``, ``runctx`` and ``runfunc`` for the given :class:`Trace` instance. Does not reset the accumulated trace results.
pt_br: Retorna um objeto :class:`CoverageResults` que contém os resultados cumulativos de todas as chamadas anteriores para ``run``, ``runctx`` e ``runfunc`` para a instância :class:`Trace` fornecida. Não redefine os resultados de rastreamento acumulados.

source: A container for coverage results, created by :meth:`Trace.results`. Should not be created directly by the user.
pt_br: Um contêiner para resultados de cobertura, criado por :meth:`Trace.results`. Não deve ser criado diretamente pelo usuário.

source: Merge in data from another :class:`CoverageResults` object.
pt_br: Mescla dados de outro objeto :class:`CoverageResults`.

source: Write coverage results. Set *show_missing* to show lines that had no hits. Set *summary* to include in the output the coverage summary per module. *coverdir* specifies the directory into which the coverage result files will be output. If ``None``, the results for each source file are placed in its directory.
pt_br: Escreve os resultados da cobertura. Defina *show_missing* para mostrar as linhas que não tiveram ocorrências. Defina o *summary* para incluir na saída o resumo da cobertura por módulo. *coverdir* especifica o diretório no qual os arquivos de resultados de cobertura serão enviados. Se for ``None``, os resultados de cada arquivo de origem são colocados em seu diretório.

source: If *ignore_missing_files* is ``True``, coverage counts for files that no longer exist are silently ignored. Otherwise, a missing file will raise a :exc:`FileNotFoundError`.
pt_br: Se *ignore_missing_files* for ``True``, as contagens de cobertura para arquivos que não existem mais serão ignoradas silenciosamente. Caso contrário, um arquivo ausente vai levantar :exc:`FileNotFoundError`.

source: Added *ignore_missing_files* parameter.
pt_br: Adicionado o parâmetro *ignore_missing_files*.

source: A simple example demonstrating the use of the programmatic interface::
pt_br: Um exemplo simples que demonstra o uso da interface programática::

source: import sys import trace # create a Trace object, telling it what to ignore, and whether to # do tracing or line-counting or both. tracer = trace.Trace( ignoredirs=[sys.prefix, sys.exec_prefix], trace=0, count=1) # run the new command using the given tracer tracer.run('main()') # make a report, placing output in the current directory r = tracer.results() r.write_results(show_missing=True, coverdir=".")
pt_br: import sys import trace # cria um objeto Trace, dizendo a ele o que ignorar e se deve # fazer rastreamento ou contagem de linhas ou ambos. tracer = trace.Trace( ignoredirs=[sys.prefix, sys.exec_prefix], trace=0, count=1) # executa o novo comando usando o rastreador fornecido tracer.run('main()') # faz um relatório, colocando a saída no diretório atual r = tracer.results() r.write_results(show_missing=True, coverdir=".")
