Repository: python/python-docs-pt-br
Catalog: library/traceback.po
Languages: pt_br

source: :mod:`!traceback` --- Print or retrieve a stack traceback
pt_br: :mod:`!traceback` --- Imprime ou recupera um traceback da pilha

source: **Source code:** :source:`Lib/traceback.py`
pt_br: **Código-fonte:** :source:`Lib/traceback.py`

source: This module provides a standard interface to extract, format and print stack traces of Python programs. It is more flexible than the interpreter's default traceback display, and therefore makes it possible to configure certain aspects of the output. Finally, it contains a utility for capturing enough information about an exception to print it later, without the need to save a reference to the actual exception. Since exceptions can be the roots of large objects graph, this utility can significantly improve memory management.
pt_br: Этот модуль предоставляет стандартный интерфейс для извлечения, форматирования и печати трассировок стека программ Python. Он более гибок, чем отображение обратной трассировки интерпретатора по умолчанию, и, следовательно, позволяет настраивать определенные аспекты вывода. Наконец, он содержит утилиту для сбора достаточной информации об исключении для последующей печати без необходимости сохранять ссылку на фактическое исключение. Поскольку исключения могут быть корнями графа больших объектов, эта утилита может значительно улучшить управление памятью.

source: The module uses :ref:`traceback objects <traceback-objects>` --- these are objects of type :class:`types.TracebackType`, which are assigned to the :attr:`~BaseException.__traceback__` field of :class:`BaseException` instances.
pt_br: Модуль использует :ref:`объекты трассировки <traceback-objects>` --- это объекты типа :class:`types.TracebackType`, которые присваиваются полю :attr:`~BaseException.__traceback__` :class Экземпляры :`BaseException`.

source: Module :mod:`faulthandler`
pt_br: Módulo :mod:`faulthandler`

source: Used to dump Python tracebacks explicitly, on a fault, after a timeout, or on a user signal.
pt_br: Usado para despejar tracebacks (situação da pilha de execução) do Python explicitamente, em uma falha, após um tempo limite ou em um sinal do usuário.

source: Module :mod:`pdb`
pt_br: Модуль :mod:`pdb`

source: Interactive source code debugger for Python programs.
pt_br: Интерактивный отладчик исходного кода программ Python.

source: The module's API can be divided into two parts:
pt_br: API модуля можно разделить на две части:

source: Module-level functions offering basic functionality, which are useful for interactive inspection of exceptions and tracebacks.
pt_br: Функции уровня модуля, предлагающие базовую функциональность, которая полезна для интерактивной проверки исключений и обратной трассировки.

source: :class:`TracebackException` class and its helper classes :class:`StackSummary` and :class:`FrameSummary`. These offer both more flexibility in the output generated and the ability to store the information necessary for later formatting without holding references to actual exception and traceback objects.
pt_br: :class:`TracebackException` и его вспомогательные классы :class:`StackSummary` и :class:`FrameSummary`. Они обеспечивают как большую гибкость создаваемого вывода, так и возможность хранить информацию, необходимую для последующего форматирования, без хранения ссылок на фактические объекты исключений и обратной трассировки.

source: Module-Level Functions
pt_br: Funções de nível de módulo

source: Print up to *limit* stack trace entries from :ref:`traceback object <traceback-objects>` *tb* (starting from the caller's frame) if *limit* is positive. Otherwise, print the last ``abs(limit)`` entries. If *limit* is omitted or ``None``, all entries are printed. If *file* is omitted or ``None``, the output goes to :data:`sys.stderr`; otherwise it should be an open :term:`file <file object>` or :term:`file-like object` to receive the output.
pt_br: Выведите до *limit* записей трассировки стека из :ref:`traceback object <traceback-objects>` *tb* (начиная с кадра вызывающего объекта), если *limit* положителен. В противном случае выведите последние записи ``abs(limit)``. Если *limit* опущен или ``None``, печатаются все записи. Если *file* опущен или ``None``, выходные данные передаются в :data:`sys.stderr`; в противном случае это должен быть открытый :term:`file <файловый объект>` или :term:`файлоподобный объект` для получения выходных данных.

source: The meaning of the *limit* parameter is different than the meaning of :const:`sys.tracebacklimit`. A negative *limit* value corresponds to a positive value of :const:`!sys.tracebacklimit`, whereas the behaviour of a positive *limit* value cannot be achieved with :const:`!sys.tracebacklimit`.
pt_br: Значение параметра *limit* отличается от значения :const:`sys.tracebacklimit`. Отрицательное значение *limit* соответствует положительному значению :const:`!sys.tracebacklimit`, тогда как поведение положительного значения *limit* не может быть достигнуто с помощью :const:`!sys.tracebacklimit`.

source: Added negative *limit* support.
pt_br: Додано підтримку негативного *ліміту*.

source: Print exception information and stack trace entries from :ref:`traceback object <traceback-objects>` *tb* to *file*. This differs from :func:`print_tb` in the following ways:
pt_br: Распечатать информацию об исключениях и сложить записи трассировки из :ref:`traceback object <traceback-objects>` *tb* в *file*. Это отличается от :func:`print_tb` следующим образом:

source: if *tb* is not ``None``, it prints a header ``Traceback (most recent call last):``
pt_br: якщо *tb* не є ``None``, він друкує заголовок ``Traceback (останній останній виклик):``

source: it prints the exception type and *value* after the stack trace
pt_br: він друкує тип винятку та *значення* після трасування стека

source: if *type(value)* is :exc:`SyntaxError` and *value* has the appropriate format, it prints the line where the syntax error occurred with a caret indicating the approximate position of the error.
pt_br: якщо *type(value)* дорівнює :exc:`SyntaxError` і *value* має відповідний формат, він друкує рядок, у якому сталася синтаксична помилка, із кареткою, що вказує на приблизну позицію помилки.

source: Since Python 3.10, instead of passing *value* and *tb*, an exception object can be passed as the first argument. If *value* and *tb* are provided, the first argument is ignored in order to provide backwards compatibility.
pt_br: Починаючи з Python 3.10, замість передачі *value* і *tb* об’єкт винятку можна передати як перший аргумент. Якщо надано *value* і *tb*, перший аргумент ігнорується, щоб забезпечити зворотну сумісність.

source: The optional *limit* argument has the same meaning as for :func:`print_tb`. If *chain* is true (the default), then chained exceptions (the :attr:`~BaseException.__cause__` or :attr:`~BaseException.__context__` attributes of the exception) will be printed as well, like the interpreter itself does when printing an unhandled exception.
pt_br: Необязательный аргумент *limit* имеет то же значение, что и :func:`print_tb`. Если *chain* имеет значение true (по умолчанию), то связанные исключения (атрибуты исключения :attr:`~BaseException.__cause__` или :attr:`~BaseException.__context__`) также будут напечатаны, как и сам интерпретатор. делает при печати необработанного исключения.

source: The *etype* argument is ignored and inferred from the type of *value*.
pt_br: Аргумент *etype* ігнорується та виводиться з типу *value*.

source: The *etype* parameter has been renamed to *exc* and is now positional-only.
pt_br: Параметр *etype* було перейменовано на *exc* і тепер є лише позиційним.

source: This is a shorthand for ``print_exception(sys.exception(), limit=limit, file=file, chain=chain)``.
pt_br: 这是 ``print_exception(sys.exception(), limit=limit, file=file, chain=chain)`` 的快捷方式。

source: This is a shorthand for ``print_exception(sys.last_exc, limit=limit, file=file, chain=chain)``. In general it will work only after an exception has reached an interactive prompt (see :data:`sys.last_exc`).
pt_br: 这是 ``print_exception(sys.last_exc, limit=limit, file=file, chain=chain)`` 的快捷方式。 通常它将只在异常到达交互提示符之后才会起作用 (参见 :data:`sys.last_exc`)。

source: Print up to *limit* stack trace entries (starting from the invocation point) if *limit* is positive. Otherwise, print the last ``abs(limit)`` entries. If *limit* is omitted or ``None``, all entries are printed. The optional *f* argument can be used to specify an alternate :ref:`stack frame <frame-objects>` to start. The optional *file* argument has the same meaning as for :func:`print_tb`.
pt_br: Выведите до *limit* записей трассировки стека (начиная с точки вызова), если *limit* положителен. В противном случае выведите последние записи ``abs(limit)``. Если *limit* опущен или ``None``, печатаются все записи. Необязательный аргумент *f* можно использовать для указания альтернативного :ref:`фрейма стека <frame-objects>` для запуска. Необязательный аргумент *file* имеет то же значение, что и :func:`print_tb`.

source: Return a :class:`StackSummary` object representing a list of "pre-processed" stack trace entries extracted from the :ref:`traceback object <traceback-objects>` *tb*. It is useful for alternate formatting of stack traces. The optional *limit* argument has the same meaning as for :func:`print_tb`. A "pre-processed" stack trace entry is a :class:`FrameSummary` object containing attributes :attr:`~FrameSummary.filename`, :attr:`~FrameSummary.lineno`, :attr:`~FrameSummary.name`, and :attr:`~FrameSummary.line` representing the information that is usually printed for a stack trace.
pt_br: Возвращает объект :class:`StackSummary`, представляющий список «предварительно обработанных» записей трассировки стека, извлеченных из :ref:`traceback-объекта <traceback-objects>` *tb*. Это полезно для альтернативного форматирования трассировок стека. Необязательный аргумент *limit* имеет то же значение, что и :func:`print_tb`. «Предварительно обработанная» запись трассировки стека — это объект :class:`FrameSummary`, содержащий атрибуты :attr:`~FrameSummary.filename`, :attr:`~FrameSummary.lineno`, :attr:`~FrameSummary.name`, и :attr:`~FrameSummary.line`, представляющий информацию, которая обычно выводится для трассировки стека.

source: Extract the raw traceback from the current :ref:`stack frame <frame-objects>`. The return value has the same format as for :func:`extract_tb`. The optional *f* and *limit* arguments have the same meaning as for :func:`print_stack`.
pt_br: Извлеките необработанную обратную трассировку из текущего :ref:`фрейма стека <frame-objects>`. Возвращаемое значение имеет тот же формат, что и для :func:`extract_tb`. Необязательные аргументы *f* и *limit* имеют то же значение, что и :func:`print_stack`.

source: Print the list of tuples as returned by :func:`extract_tb` or :func:`extract_stack` as a formatted stack trace to the given file. If *file* is ``None``, the output is written to :data:`sys.stderr`.
pt_br: Распечатайте список кортежей, возвращенный :func:`extract_tb` или :func:`extract_stack`, как отформатированную трассировку стека для данного файла. Если *file* имеет значение ``None``, выходные данные записываются в :data:`sys.stderr`.

source: Given a list of tuples or :class:`FrameSummary` objects as returned by :func:`extract_tb` or :func:`extract_stack`, return a list of strings ready for printing. Each string in the resulting list corresponds to the item with the same index in the argument list. Each string ends in a newline; the strings may contain internal newlines as well, for those items whose source text line is not ``None``.
pt_br: За наявності списку кортежів або об’єктів :class:`FrameSummary`, які повертає :func:`extract_tb` або :func:`extract_stack`, повертає список рядків, готових до друку. Кожен рядок у результуючому списку відповідає елементу з таким же індексом у списку аргументів. Кожен рядок закінчується символом нового рядка; рядки також можуть містити внутрішні символи нового рядка для тих елементів, вихідний текстовий рядок яких не ``None``.

source: Format the exception part of a traceback using an exception value such as given by :data:`sys.last_value`. The return value is a list of strings, each ending in a newline. The list contains the exception's message, which is normally a single string; however, for :exc:`SyntaxError` exceptions, it contains several lines that (when printed) display detailed information about where the syntax error occurred. Following the message, the list contains the exception's :attr:`notes <BaseException.__notes__>`.
pt_br: Отформатируйте часть исключения в обратной трассировке, используя значение исключения, например, заданное :data:`sys.last_value`. Возвращаемое значение представляет собой список строк, каждая из которых заканчивается новой строкой. Список содержит сообщение об исключении, которое обычно представляет собой одну строку; однако, для исключений :exc:`SyntaxError`, он содержит несколько строк, которые (при печати) отображают подробную информацию о том, где произошла синтаксическая ошибка. После сообщения список содержит :attr:`notes <BaseException.__notes__>` исключения.

source: Since Python 3.10, instead of passing *value*, an exception object can be passed as the first argument. If *value* is provided, the first argument is ignored in order to provide backwards compatibility.
pt_br: Починаючи з Python 3.10, замість передачі *значення* як перший аргумент можна передати об’єкт винятку. Якщо вказано *значення*, перший аргумент ігнорується, щоб забезпечити зворотну сумісність.

source: The returned list now includes any :attr:`notes <BaseException.__notes__>` attached to the exception.
pt_br: Возвращаемый список теперь включает все :attr:`notes <BaseException.__notes__>`, прикрепленные к исключению.

source: Format a stack trace and the exception information. The arguments have the same meaning as the corresponding arguments to :func:`print_exception`. The return value is a list of strings, each ending in a newline and some containing internal newlines. When these lines are concatenated and printed, exactly the same text is printed as does :func:`print_exception`.
pt_br: Відформатуйте трасування стека та інформацію про винятки. Аргументи мають те саме значення, що й відповідні аргументи :func:`print_exception`. Повернене значення — це список рядків, кожен із яких закінчується знаком нового рядка, а деякі містять внутрішні нові рядки. Коли ці рядки об’єднуються та друкуються, друкується точно такий же текст, як і :func:`print_exception`.

source: This function's behavior and signature were modified to match :func:`print_exception`.
pt_br: Поведінку та підпис цієї функції було змінено відповідно до :func:`print_exception`.

source: This is like ``print_exc(limit)`` but returns a string instead of printing to a file.
pt_br: Це схоже на ``print_exc(limit)``, але повертає рядок замість друку у файл.

source: A shorthand for ``format_list(extract_tb(tb, limit))``.
pt_br: Скорочення для ``format_list(extract_tb(tb, limit))``.

source: A shorthand for ``format_list(extract_stack(f, limit))``.
pt_br: Скорочення для ``format_list(extract_stack(f, limit))``.

source: Clears the local variables of all the stack frames in a :ref:`traceback <traceback-objects>` *tb* by calling the :meth:`~frame.clear` method of each :ref:`frame object <frame-objects>`.
pt_br: Очищает локальные переменные всех кадров стека в :ref:`traceback <traceback-objects>` *tb* путем вызова метода :meth:`~frame.clear` каждого :ref:`frame объекта <frame-objects >`.

source: Walk a stack following :attr:`f.f_back <frame.f_back>` from the given frame, yielding the frame and line number for each frame. If *f* is ``None``, the current stack is used. This helper is used with :meth:`StackSummary.extract`.
pt_br: Пройдите по стеку после :attr:`f.f_back <frame.f_back>` из заданного кадра, получив номер кадра и номер строки для каждого кадра. Если *f* равно ``None``, используется текущий стек. Этот помощник используется с :meth:`StackSummary.extract`.

source: Walk a traceback following :attr:`~traceback.tb_next` yielding the frame and line number for each frame. This helper is used with :meth:`StackSummary.extract`.
pt_br: Выполните обратную трассировку по :attr:`~traceback.tb_next`, получив номер кадра и строки для каждого кадра. Этот помощник используется с :meth:`StackSummary.extract`.

source: :class:`!TracebackException` Objects
pt_br: :class:`!TracebackException` Объекты

source: :class:`!TracebackException` objects are created from actual exceptions to capture data for later printing. They offer a more lightweight method of storing this information by avoiding holding references to :ref:`traceback<traceback-objects>` and :ref:`frame<frame-objects>` objects. In addition, they expose more options to configure the output compared to the module-level functions described above.
pt_br: Объекты :class:`!TracebackException` создаются на основе реальных исключений для сбора данных для последующей печати. Они предлагают более легкий метод хранения этой информации, избегая хранения ссылок на объекты :ref:`traceback<traceback-objects>` и :ref:`frame<frame-objects>`. Кроме того, они предоставляют больше возможностей для настройки вывода по сравнению с функциями уровня модуля, описанными выше.

source: Capture an exception for later rendering. The meaning of *limit*, *lookup_lines* and *capture_locals* are as for the :class:`StackSummary` class.
pt_br: Захват исключения для последующего рендеринга. Значение *limit*, *lookup_lines* и *capture_locals* такое же, как и для класса :class:`StackSummary`.

source: If *compact* is true, only data that is required by :class:`!TracebackException`'s :meth:`format` method is saved in the class attributes. In particular, the :attr:`__context__` field is calculated only if :attr:`__cause__` is ``None`` and :attr:`__suppress_context__` is false.
pt_br: Если *compact* имеет значение true, в атрибутах класса сохраняются только данные, необходимые для метода :meth:`format` :class:`!TracebackException`. В частности, поле :attr:`__context__` вычисляется только в том случае, если :attr:`__cause__` имеет значение ``None`` и :attr:`__suppress_context__` имеет значение false.

source: Note that when locals are captured, they are also shown in the traceback.
pt_br: Зауважте, що коли місцеві жителі захоплені, вони також відображаються в трасуванні.

source: *max_group_width* and *max_group_depth* control the formatting of exception groups (see :exc:`BaseExceptionGroup`). The depth refers to the nesting level of the group, and the width refers to the size of a single exception group's exceptions array. The formatted output is truncated when either limit is exceeded.
pt_br: *max_group_width* и *max_group_eep* управляют форматированием групп исключений (см. :exc:`BaseExceptionGroup`). Глубина относится к уровню вложенности группы, а ширина относится к размеру массива исключений отдельной группы исключений. Форматированный вывод обрезается при превышении любого предела.

source: Added the *compact* parameter.
pt_br: Adicionado o parâmetro *compact*.

source: Added the *max_group_width* and *max_group_depth* parameters.
pt_br: Добавлены параметры *max_group_width* и *max_group_length*.

source: A :class:`!TracebackException` of the original :attr:`~BaseException.__cause__`.
pt_br: :class:`!TracebackException` исходного :attr:`~BaseException.__cause__`.

source: A :class:`!TracebackException` of the original :attr:`~BaseException.__context__`.
pt_br: :class:`!TracebackException` исходного :attr:`~BaseException.__context__`.

source: If ``self`` represents an :exc:`ExceptionGroup`, this field holds a list of :class:`!TracebackException` instances representing the nested exceptions. Otherwise it is ``None``.
pt_br: Если ``self`` представляет собой :exc:`ExceptionGroup`, это поле содержит список экземпляров :class:`!TracebackException`, представляющих вложенные исключения. В противном случае это ``Нет``.

source: The :attr:`~BaseException.__suppress_context__` value from the original exception.
pt_br: Значение :attr:`~BaseException.__suppress_context__` из исходного исключения.

source: The :attr:`~BaseException.__notes__` value from the original exception, or ``None`` if the exception does not have any notes. If it is not ``None`` is it formatted in the traceback after the exception string.
pt_br: Значение :attr:`~BaseException.__notes__` из исходного исключения или ``None``, если исключение не имеет примечаний. Если это не ``None``, оно форматируется в обратной трассировке после строки исключения.

source: A :class:`StackSummary` representing the traceback.
pt_br: :class:`StackSummary`, що представляє відстеження.

source: The class of the original traceback.
pt_br: Клас оригінального трасування.

source: For syntax errors - the file name where the error occurred.
pt_br: Для синтаксичних помилок - ім'я файлу, де сталася помилка.

source: For syntax errors - the line number where the error occurred.
pt_br: Для синтаксичних помилок - номер рядка, де сталася помилка.

source: For syntax errors - the end line number where the error occurred. Can be ``None`` if not present.
pt_br: Для синтаксических ошибок — номер конечной строки, в которой произошла ошибка. Может быть «Нет», если отсутствует.

source: For syntax errors - the text where the error occurred.
pt_br: Для синтаксичних помилок - текст, де сталася помилка.

source: For syntax errors - the offset into the text where the error occurred.
pt_br: Для синтаксичних помилок - зміщення в тексті, де сталася помилка.

source: For syntax errors - the end offset into the text where the error occurred. Can be ``None`` if not present.
pt_br: Для синтаксических ошибок — конечное смещение в тексте, где произошла ошибка. Может быть «Нет», если отсутствует.

source: For syntax errors - the compiler error message.
pt_br: Для синтаксичних помилок - повідомлення про помилку компілятора.

source: Capture an exception for later rendering. *limit*, *lookup_lines* and *capture_locals* are as for the :class:`StackSummary` class.
pt_br: Зафіксуйте виняток для подальшого рендерингу. *limit*, *lookup_lines* і *capture_locals* такі ж, як і для класу :class:`StackSummary`.

source: Print to *file* (default ``sys.stderr``) the exception information returned by :meth:`format`.
pt_br: Распечатать в *файл* (по умолчанию ``sys.stderr``) информацию об исключении, возвращаемую :meth:`format`.

source: Format the exception.
pt_br: Відформатувати виняток.

source: If *chain* is not ``True``, :attr:`__cause__` and :attr:`__context__` will not be formatted.
pt_br: Если *chain* не имеет значения True, :attr:`__cause__` и :attr:`__context__` не будут отформатированы.

source: The return value is a generator of strings, each ending in a newline and some containing internal newlines. :func:`~traceback.print_exception` is a wrapper around this method which just prints the lines to a file.
pt_br: Повернене значення є генератором рядків, кожен із яких закінчується символом нового рядка, а деякі містять внутрішні нові рядки. :func:`~traceback.print_exception` є обгорткою цього методу, яка просто друкує рядки у файл.

source: Format the exception part of the traceback.
pt_br: Відформатуйте частину винятку зворотного відстеження.

source: The return value is a generator of strings, each ending in a newline.
pt_br: Повернене значення є генератором рядків, кожен із яких закінчується символом нового рядка.

source: The exception's :attr:`notes <BaseException.__notes__>` are now included in the output.
pt_br: :attr:`notes <BaseException.__notes__>` исключения теперь включается в выходные данные.

source: :class:`!StackSummary` Objects
pt_br: :class:`!StackSummary` Объекты

source: :class:`!StackSummary` objects represent a call stack ready for formatting.
pt_br: Объекты :class:`!StackSummary` представляют собой стек вызовов, готовый к форматированию.
