Repository: python/python-docs-pt-br
Catalog: library/turtle.po
Languages: pt_br

source: :mod:`!turtle` --- Turtle graphics
pt_br: :mod:`!turtle` --- Gráficos tartaruga

source: **Source code:** :source:`Lib/turtle.py`
pt_br: **Código-fonte:** :source:`Lib/turtle.py`

source: Introduction
pt_br: Introdução

source: Turtle graphics is an implementation of `the popular geometric drawing tools introduced in Logo <https://en.wikipedia.org/wiki/Turtle_ (robot)>`_, developed by Wally Feurzeig, Seymour Papert and Cynthia Solomon in 1967.
pt_br: Gráficos tartaruga são uma implementação das `populares ferramentas de desenho geométrico introduzidas em Logo <https://pt.wikipedia.org/wiki/Logo>`_, desenvolvido por Wally Feurzeig, Seymour Papert e Cynthia Solomon em 1967.

source: Get started
pt_br: Começando

source: Imagine a robotic turtle starting at (0, 0) in the x-y plane. After an ``import turtle``, give it the command ``turtle.forward(15)``, and it moves (on-screen!) 15 pixels in the direction it is facing, drawing a line as it moves. Give it the command ``turtle.right(25)``, and it rotates in-place 25 degrees clockwise.
pt_br: Imagine uma tartaruga robótica começando em (0, 0) no plano x-y. Depois de um ``import turtle``, execute o comando ``turtle.forward(15)``, e ela moverá (na tela!) 15 pixels na direção em que está virada (para frente), desenhando uma linha à medida que se move. Execute o comando ``turtle.right(25)``, e ela fará uma rotação, de 25 graus no sentido horário, sem sair do lugar.

source: Turtle can draw intricate shapes using programs that repeat simple moves.
pt_br: A tartaruga pode desenhar formas intrincadas usando programas que repetem movimentos simples.

source: In Python, turtle graphics provides a representation of a physical "turtle" (a little robot with a pen) that draws on a sheet of paper on the floor.
pt_br: Em Python, os gráficos de tartaruga fornecem uma representação de uma "tartaruga" física (um pequeno robô com uma caneta) que desenha em uma folha de papel no chão.

source: It's an effective and well-proven way for learners to encounter programming concepts and interaction with software, as it provides instant, visible feedback. It also provides convenient access to graphical output in general.
pt_br: É uma maneira eficaz e comprovada de os alunos conhecerem os conceitos de programação e a interação com o software, pois oferece resposta instantânea e visível. Também oferece acesso conveniente a resultados gráficos em geral.

source: Turtle drawing was originally created as an educational tool, to be used by teachers in the classroom. For the programmer who needs to produce some graphical output it can be a way to do that without the overhead of introducing more complex or external libraries into their work.
pt_br: Desenho de tartaruga foi originalmente criado como uma ferramenta educacional, para ser usado por professores em sala de aula. Para a pessoa que precisa produzir algum resultado gráfico, essa pode ser uma maneira de fazer isso sem a sobrecarga de introduzir bibliotecas mais complexas ou externas em seu trabalho.

source: New users should start here. In this tutorial we'll explore some of the basics of turtle drawing.
pt_br: As pessoas recém-chegadas devem começar por aqui. Neste tutorial, exploraremos alguns dos conceitos básicos do desenho de tartarugas.

source: Starting a turtle environment
pt_br: Iniciando um ambiente da tartaruga

source: In a Python shell, import all the objects of the ``turtle`` module::
pt_br: Em um console do Python, faça a importação de todos os objetos do módulo ``turtle``::

source: If you run into a ``No module named '_tkinter'`` error, you'll have to install the :mod:`Tk interface package <tkinter>` on your system.
pt_br: Se você se deparar com a seguinte mensagem de erro ``No module named '_tkinter'``, será necessário instalar o :mod:`pacote de interface gráfica Tk <tkinter>` em seu sistema.

source: Basic drawing
pt_br: Desenho básico

source: Send the turtle forward 100 steps::
pt_br: Envie a tartaruga para frente 100 passos::

source: You should see (most likely, in a new window on your display) a line drawn by the turtle, heading East. Change the direction of the turtle, so that it turns 120 degrees left (anti-clockwise)::
pt_br: Você deverá ver (provavelmente, em uma nova janela na sua tela) uma linha desenhada pela tartaruga, em direção ao leste (→) . Mude a direção da tartaruga, de modo que ela gire 120 graus para a esquerda (sentido anti-horário)::

source: Let's continue by drawing a triangle::
pt_br: Vamos continuar desenhando um triângulo::

source: Notice how the turtle, represented by an arrow, points in different directions as you steer it.
pt_br: Observe como a tartaruga, representada por uma seta, aponta em diferentes direções à medida que você a guia.

source: Experiment with those commands, and also with ``backward()`` and ``right()``.
pt_br: Faça experiências com esses comandos e também com ``backward()`` e ``right()``.

source: Pen control
pt_br: Controle da Caneta

source: Try changing the color - for example, ``color('blue')`` - and width of the line - for example, ``width(3)`` - and then drawing again.
pt_br: Tente alterar a cor - por exemplo, ``color('blue')`` - e a largura da linha - por exemplo, ``width(3)`` - e, em seguida, desenhe novamente.

source: You can also move the turtle around without drawing, by lifting up the pen: ``up()`` before moving. To start drawing again, use ``down()``.
pt_br: Você também pode mover a tartaruga sem desenhar, levantando a caneta: ``up()`` antes de mover. Para começar a desenhar novamente, use ``down()``.

source: The turtle's position
pt_br: A posição da tartaruga

source: Send your turtle back to its starting-point (useful if it has disappeared off-screen)::
pt_br: Envie sua tartaruga de volta ao ponto de partida (útil se ela tiver desaparecido da tela)::

source: The home position is at the center of the turtle's screen. If you ever need to know them, get the turtle's x-y coordinates with::
pt_br: A posição inicial da tartaruga está no centro da tela. Se você precisar conhecê-la, obtenha as coordenadas x-y da tartaruga com::

source: Home is at ``(0, 0)``.
pt_br: A a posição inicial fica em ``(0, 0)``.

source: And after a while, it will probably help to clear the window so we can start anew::
pt_br: E, depois de um tempo, provavelmente vai querer ajudar a limpar a janela aberta para que possamos começar de novo::

source: Making algorithmic patterns
pt_br: Criação de padrões algorítmicos

source: Using loops, it's possible to build up geometric patterns::
pt_br: Usando laços de repetição, é possível construir criar padrões geométricos::

source: \ - which of course, are limited only by the imagination!
pt_br: \ - que, é claro, são limitados apenas pela imaginação!

source: Let's draw the star shape at the top of this page. We want red lines, filled in with yellow::
pt_br: Vamos desenhar o formato de estrela na parte superior da página. Queremos linhas de contorno vermelhas, com preenchimento em amarelo::

source: Just as ``up()`` and ``down()`` determine whether lines will be drawn, filling can be turned on and off::
pt_br: Assim como ``up()`` e ``down()`` determinam se as linhas serão desenhadas, o preenchimento pode ser ativado e desativado::

source: Next we'll create a loop::
pt_br: Em seguida, vamos criar um laço de repetição::

source: ``abs(pos()) < 1`` is a good way to know when the turtle is back at its home position.
pt_br: ``abs(pos()) < 1`` é uma boa maneira de saber quando a tartaruga está de volta à sua posição inicial.

source: Finally, complete the filling::
pt_br: Por fim, complete o preenchimento::

source: (Note that filling only actually takes place when you give the ``end_fill()`` command.)
pt_br: (Observe que o preenchimento só ocorre de fato quando você fornece o comando ``end_fill()`` .)

source: How to...
pt_br: Como fazer...

source: This section covers some typical turtle use-cases and approaches.
pt_br: Esta seção aborda alguns casos de uso e abordagens típicos do módulo "turtle".

source: Get started as quickly as possible
pt_br: Comece o mais rápido possível

source: One of the joys of turtle graphics is the immediate, visual feedback that's available from simple commands - it's an excellent way to introduce children to programming ideas, with a minimum of overhead (not just children, of course).
pt_br: Uma dos prazeres dos gráficos de tartaruga é o feedback visual imediato disponível a partir de comandos simples. É uma excelente maneira de apresentar ideias de programação às crianças, com um mínimo de sofrimento (não apenas às crianças, é claro).

source: The turtle module makes this possible by exposing all its basic functionality as functions, available with ``from turtle import *``. The :ref:`turtle graphics tutorial <turtle-tutorial>` covers this approach.
pt_br: O módulo tartaruga torna isso possível ao expor toda a sua funcionalidade básica como funções, disponíveis com ``from turtle import *``. O tutorial gráficos de :ref:`turtle <turtle-tutorial>` cobre essa abordagem.

source: It's worth noting that many of the turtle commands also have even more terse equivalents, such as ``fd()`` for :func:`forward`. These are especially useful when working with learners for whom typing is not a skill.
pt_br: Vale a pena observar que muitos dos comandos da tartaruga também possuem equivalentes ainda mais concisos, como usar ``fd()`` para obter o mesmo resultado de :func:`forward`. Esses comandos são especialmente úteis quando se trabalha com alunos para os quais a digitação não é uma habilidade.

source: You'll need to have the :mod:`Tk interface package <tkinter>` installed on your system for turtle graphics to work. Be warned that this is not always straightforward, so check this in advance if you're planning to use turtle graphics with a learner.
pt_br: Você precisará ter o pacote de interface :mod:`Tk <tkinter>` instalado em seu sistema para que os gráficos do módulo "turtle" funcionem. Esteja ciente de que isso nem sempre é simples, portanto, verifique isso com antecedência se estiver planejando usar os gráficos de tartaruga com um aluno.

source: Automatically begin and end filling
pt_br: Inicie e encerre o preenchimento automaticamente

source: Starting with Python 3.14, you can use the :func:`fill` :term:`context manager` instead of :func:`begin_fill` and :func:`end_fill` to automatically begin and end fill. Here is an example::
pt_br: A partir do Python 3.14, você pode usar o :term:`gerenciador de contexto` :func:`fill` em vez de :func:`begin_fill` e :func:`end_fill` para iniciar e encerrar o preenchimento automaticamente. Aqui está um exemplo:

source: The code above is equivalent to::
pt_br: O código acima equivale a::

source: Use the ``turtle`` module namespace
pt_br: Use o espaço de nomes do módulo ``turtle``

source: Using ``from turtle import *`` is convenient - but be warned that it imports a rather large collection of objects, and if you're doing anything but turtle graphics you run the risk of a name conflict (this becomes even more an issue if you're using turtle graphics in a script where other modules might be imported).
pt_br: Usar ``from turtle import *`` é conveniente, mas lembre-se de que ele importa um coleção bastante grande de objetos e, se você estiver fazendo qualquer coisa no seu código que não esteja relacionada com o módulo gráficos de tartaruga, corre o risco de um conflito de nomes de objetos (isso se torna um problema ainda maior se você estiver usando o módulo de gráficos de tartaruga em um script em que outros módulos possam ser também importados).

source: The solution is to use ``import turtle`` - ``fd()`` becomes ``turtle.fd()``, ``width()`` becomes ``turtle.width()`` and so on. (If typing "turtle" over and over again becomes tedious, use for example ``import turtle as t`` instead.)
pt_br: A solução é usar o identificador/domínio do próprio módulo ``import turtle`` sem o asterisco no final da importação - assim a chamada do objeto/função ``fd()`` torna-se ``turtle.fd()``, da mesma forma como ``width()`` torna-se ``turtle.width()`` e assim por diante. (Se digitar "turtle" várias vezes se tornar tedioso, use ``import turtle as t``, por exemplo, para fornecer um apelido mais conciso e objetivo ao identificador/domínio dentro do seu código).

source: Use turtle graphics in a script
pt_br: Use o módulo gráfico de tartaruga dentro de um script com código específico

source: It's recommended to use the ``turtle`` module namespace as described immediately above, for example::
pt_br: Recomenda-se usar o módulo ``turtle`` com uma apelido para identificador/domínio, conforme descrito acima, por exemplo::

source: Another step is also required though - as soon as the script ends, Python will also close the turtle's window. Add::
pt_br: No entanto, outra etapa também é necessária ou o Python também fechará a janela da tartaruga assim que o código acima terminar de ser executado. Adicione::

source: to the end of the script. The script will now wait to be dismissed and will not exit until it is terminated, for example by closing the turtle graphics window.
pt_br: ao final do código anterior. Assim, o código anterior agora conterá uma instrução que aguardará ser dispensado e não sairá até que seja encerrado, por exemplo, fechando a janela aberta pelo módulo gráficos da tartaruga.

source: Use object-oriented turtle graphics
pt_br: Use o módulo gráficos da tartaruga orientado a objetos

source: :ref:`Explanation of the object-oriented interface <turtle-explanation>`
pt_br: :ref:`Explicação de interface orientada a objetos <turtle-explanation>`

source: Other than for very basic introductory purposes, or for trying things out as quickly as possible, it's more usual and much more powerful to use the object-oriented approach to turtle graphics. For example, this allows multiple turtles on screen at once.
pt_br: Exceto para fins introdutórios muito básicos ou para experimentar coisas o mais rápido possível, é mais comum e muito mais eficiente usar a abordagem orientada a objetos para gráficos de tartarugas. Por exemplo, isso permite várias tartarugas na tela ao mesmo tempo.

source: In this approach, the various turtle commands are methods of objects (mostly of ``Turtle`` objects). You *can* use the object-oriented approach in the shell, but it would be more typical in a Python script.
pt_br: Nessa abordagem, os vários comandos do módulo turtle são métodos de objetos (principalmente objetos de ``Turtle``). Você *pode* usar a abordagem orientada a objetos em console, mas ela seria mais típica em um script Python.

source: The example above then becomes::
pt_br: O exemplo acima se torna então::

source: Note the last line. ``t.screen`` is an instance of the :class:`Screen` that a Turtle instance exists on; it's created automatically along with the turtle.
pt_br: Observe a última linha. ``t.screen`` é um instância da subclasse :class:`Screen` que existe numa instância da classe tartaruga ou "turtle"; ela é criada automaticamente junto com a instância de tartaruga.

source: The turtle's screen can be customised, for example::
pt_br: A tela da tartaruga pode ser personalizada, por exemplo::

source: Turtle graphics reference
pt_br: Referência Gráficos de Tartaruga

source: In the following documentation the argument list for functions is given. Methods, of course, have the additional first argument *self* which is omitted here.
pt_br: Na documentação a seguir, a lista de argumentos para funções é fornecida. Os métodos, é claro, têm o primeiro argumento adicional *self* que é omitido aqui.

source: Turtle methods
pt_br: Métodos de Turtle

source: Turtle motion
pt_br: Movimentos de Turtle

source: Move and draw
pt_br: Movimento e desenho

source: Tell Turtle's state
pt_br: Fala o estado de Turtle

source: Setting and measurement
pt_br: Configuração e Medidas

source: Drawing state
pt_br: Estado do Desenho

source: Color control
pt_br: Controle da Cor

source: Filling
pt_br: Preenchimento

source: More drawing control
pt_br: Mais sobre o Controle do Desenho

source: Turtle state
pt_br: Estado da tartaruga

source: Visibility
pt_br: Visibilidade

source: Appearance
pt_br: Aparência

source: Using events
pt_br: Eventos Utilizados

source: Special Turtle methods
pt_br: Métodos Especiais da Tartaruga

source: Methods of TurtleScreen/Screen
pt_br: Métodos de TurtleScreen/Screen

source: Window control
pt_br: Controle da Janela

source: Animation control
pt_br: Controle da animação

source: Using screen events
pt_br: Usando os eventos de tela

source: Settings and special methods
pt_br: Configurações e métodos especiais

source: Input methods
pt_br: Métodos de entrada

source: Methods specific to Screen
pt_br: Métodos específicos para Screen

source: Methods of RawTurtle/Turtle and corresponding functions
pt_br: Métodos de RawTurtle/Turtle e funções correspondentes

source: Most of the examples in this section refer to a Turtle instance called ``turtle``.
pt_br: A maioria dos exemplos desta seção referem-se a uma instância Turtle chamada ``turtle``.

source: Parameters
pt_br: Parâmetros

source: a number (integer or float)
pt_br: um número (inteiro ou ponto flutuante)

source: Move the turtle forward by the specified *distance*, in the direction the turtle is headed.
pt_br: Move a tartaruga para frente pela *distance* especificada, na direção em que a tartaruga está indo.

source: a number
pt_br: um número

source: Move the turtle backward by *distance*, opposite to the direction the turtle is headed. Do not change the turtle's heading.
pt_br: Move a tartaruga para trás por *distance*, na direção oposta à direção em que a tartaruga está indo. Não muda o rumo da tartaruga.

source: Turn turtle right by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
pt_br: Vira a tartaruga à direita por unidades de *angle*. (As unidades são por padrão graus, mas podem ser definidas através das funções :func:`degrees` e :func:`radians`.) A orientação do ângulo depende do modo tartaruga, veja :func:`mode`.

source: Turn turtle left by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
pt_br: Vira a tartaruga à esquerda por unidades de *angle*. (As unidades são por padrão graus, mas podem ser definidas através das funções :func:`degrees` e :func:`radians`.) A orientação do ângulo depende do modo tartaruga, veja :func:`mode`.

source: a number or a pair/vector of numbers
pt_br: um número ou um par/vetor de números

source: a number or ``None``
pt_br: um número ou ``None``

source: If *y* is ``None``, *x* must be a pair of coordinates or a :class:`Vec2D` (e.g. as returned by :func:`pos`).
pt_br: Se *y* for ``None``, *x* deve ser um par de coordenadas ou uma classe :class:`Vec2D` (por exemplo, como retornado pela função :func:`pos`).

source: Move turtle to an absolute position. If the pen is down, draw line. Do not change the turtle's orientation.
pt_br: Move a tartaruga para uma posição absoluta. Caso a caneta esteja virada para baixo, traça a linha. Não altera a orientação da tartaruga.

source: a boolean
pt_br: um valor booleano

source: Move turtle to an absolute position. Unlike goto(x, y), a line will not be drawn. The turtle's orientation does not change. If currently filling, the polygon(s) teleported from will be filled after leaving, and filling will begin again after teleporting. This can be disabled with fill_gap=True, which makes the imaginary line traveled during teleporting act as a fill barrier like in goto(x, y).
pt_br: Move a tartaruga para uma posição absoluta. Ao contrário de goto(x, y), uma linha não será desenhada. A orientação da tartaruga não muda. Se estiver sendo preenchido no momento, o(s) polígono(s) teletransportado(s) será(ão) preenchido(s) após sair, e o preenchimento começará novamente após o teletransporte. Isso pode ser desabilitado com fill_gap=True, o que faz com que a linha imaginária percorrida durante o teletransporte atue como uma barreira de preenchimento como em goto(x, y).

source: Set the turtle's first coordinate to *x*, leave second coordinate unchanged.
pt_br: Define a primeira coordenada da tartaruga para *x*, deixa a segunda coordenada inalterada.

source: Set the turtle's second coordinate to *y*, leave first coordinate unchanged.
pt_br: Defina a segunda coordenada da tartaruga para *y*, deixa a primeira coordenada inalterada.

source: Set the orientation of the turtle to *to_angle*. Here are some common directions in degrees:
pt_br: Define a orientação da tartaruga para *to_angle*. Aqui estão algumas direções mais comuns em graus:

source: standard mode
pt_br: modo padrão

source: logo mode
pt_br: modo logo

source: 0 - east
pt_br: 0 - leste

source: 0 - north
pt_br: 0 - norte

source: 90 - north
pt_br: 90 - norte

source: 90 - east
pt_br: 90 - leste

source: 180 - west
pt_br: 180 - oeste

source: 180 - south
pt_br: 180 - sul

source: 270 - south
pt_br: 270 - sul

source: 270 - west
pt_br: 270 - oeste

source: Move turtle to the origin -- coordinates (0,0) -- and set its heading to its start-orientation (which depends on the mode, see :func:`mode`).
pt_br: Move a tartaruga para a origem -- coordenadas (0,0) -- e define seu rumo para sua orientação inicial (que depende do modo, veja :func:`mode`).

source: a number (or ``None``)
pt_br: um número (ou ``None``)

source: an integer (or ``None``)
pt_br: um inteiro (ou ``None``)

source: Draw a circle with given *radius*. The center is *radius* units left of the turtle; *extent* -- an angle -- determines which part of the circle is drawn. If *extent* is not given, draw the entire circle. If *extent* is not a full circle, one endpoint of the arc is the current pen position. Draw the arc in counterclockwise direction if *radius* is positive, otherwise in clockwise direction. Finally the direction of the turtle is changed by the amount of *extent*.
pt_br: Desenha um círculo com dado *radius*. O centro são as unidades de *radius* à esquerda da tartaruga; *extent* -- um ângulo -- determina qual parte do círculo é desenhada. Se *extent* não for fornecida, desenha o círculo inteiro. Se *extent* não for um círculo completo, uma extremidade do arco será a posição atual da caneta. Desenha o arco no sentido anti-horário se *radius* for positivo, caso contrário, no sentido horário. Finalmente, a direção da tartaruga é alterada pela quantidade de *extent*.

source: As the circle is approximated by an inscribed regular polygon, *steps* determines the number of steps to use. If not given, it will be calculated automatically. May be used to draw regular polygons.
pt_br: Como o círculo é aproximado por um polígono regular inscrito, *steps* determina o número de passos a serem usados. Caso não seja informado, será calculado automaticamente. Pode ser usado para desenhar polígonos regulares.

source: an integer >= 1 (if given)
pt_br: um inteiro >= 1 (caso seja fornecido)

source: a colorstring or a numeric color tuple
pt_br: uma string de cores ou uma tupla de cores numéricas

source: Draw a circular dot with diameter *size*, using *color*. If *size* is not given, the maximum of pensize+4 and 2*pensize is used.
pt_br: Desenha um ponto circular com diâmetro *size*, usando *color*. Se *size* não for fornecido, o máximo de pensize+4 e 2*pensize será usado.

source: Stamp a copy of the turtle shape onto the canvas at the current turtle position. Return a stamp_id for that stamp, which can be used to delete it by calling ``clearstamp(stamp_id)``.
pt_br: Carimba uma cópia da forma da tartaruga na tela na posição atual da tartaruga. Retorna um stamp_id para esse carimbo, que pode ser usado para excluí-lo chamando ``clearstamp(stamp_id)``.
