Repository: python/python-docs-pt-br
Catalog: library/turtle.po
Languages: pt_br

source: an integer, must be return value of previous :func:`stamp` call
pt_br: um inteiro, deve ser o valor de retorno da chamada de :func:`stamp` anterior

source: Delete stamp with given *stampid*.
pt_br: Exclui o carimbo com o *stamp* fornecido.

source: Delete all or first/last *n* of turtle's stamps. If *n* is ``None``, delete all stamps, if *n* > 0 delete first *n* stamps, else if *n* < 0 delete last *n* stamps.
pt_br: Exclui todos ou o primeiro/último *n* dos selos da tartaruga. Se *n* for ``None``, exclui todos os carimbos, se *n* > 0 exclui os primeiros *n* carimbos, senão se *n* < 0 exclui os últimos *n* carimbos.

source: Undo (repeatedly) the last turtle action(s). Number of available undo actions is determined by the size of the undobuffer.
pt_br: Desfaz (repetidamente) a(s) última(s) ação(ões) da tartaruga. O número de ações de desfazer disponíveis é determinado pelo tamanho do buffer de desfazer.

source: an integer in the range 0..10 or a speedstring (see below)
pt_br: um inteiro no intervalo 0..10 ou uma string de velocidade (veja abaixo)

source: Set the turtle's speed to an integer value in the range 0..10. If no argument is given, return current speed.
pt_br: Define a velocidade da tartaruga para um valor inteiro no intervalo 0..10. Se nenhum argumento for fornecido, retorna a velocidade atual.

source: If input is a number greater than 10 or smaller than 0.5, speed is set to 0. Speedstrings are mapped to speedvalues as follows:
pt_br: Se a entrada for um número maior que 10 ou menor que 0,5, a velocidade é definida como 0. As strings de velocidade são mapeadas para valores de velocidade da seguinte forma:

source: Speeds from 1 to 10 enforce increasingly faster animation of line drawing and turtle turning.
pt_br: Velocidades de 1 a 10 tornam a animação cada vez mais rápida, tanto para o desenho da linha como para a rotação da tartaruga.

source: Attention: *speed* = 0 means that *no* animation takes place. forward/back makes turtle jump and likewise left/right make the turtle turn instantly.
pt_br: Atenção: *speed* = 0 significa que *nenhuma* animação ocorre. forward/back faz a tartaruga pular e da mesma forma para left/right faz a tartaruga girar instantaneamente.

source: Return the turtle's current location (x,y) (as a :class:`Vec2D` vector).
pt_br: Retorna a localização atual da tartaruga (x,y) (como um vetor :class:`Vec2D`).

source: a number or a pair/vector of numbers or a turtle instance
pt_br: um número ou um par/vetor de números ou uma instância de tartaruga

source: a number if *x* is a number, else ``None``
pt_br: um número caso *x* seja um número, senão ``None``

source: Return the angle between the line from turtle position to position specified by (x,y), the vector or the other turtle. This depends on the turtle's start orientation which depends on the mode - "standard"/"world" or "logo".
pt_br: Retorna o ângulo entre a linha da posição da tartaruga para a posição especificada por (x,y), o vetor ou a outra tartaruga. Isso depende da orientação inicial da tartaruga, que depende do modo - "standard"/"world" ou "logo".

source: Return the turtle's x coordinate.
pt_br: Retorna a coordenada X da tartaruga.

source: Return the turtle's y coordinate.
pt_br: Retorna a coordenada Y da tartaruga.

source: Return the turtle's current heading (value depends on the turtle mode, see :func:`mode`).
pt_br: Retorna o título atual da tartaruga (o valor depende do modo da tartaruga, veja :func:`mode`).

source: Return the distance from the turtle to (x,y), the given vector, or the given other turtle, in turtle step units.
pt_br: Retorna a distância da tartaruga para (x,y), o vetor dado, ou a outra tartaruga dada, em unidades de passo de tartaruga.

source: Settings for measurement
pt_br: Configurações de medida

source: Set angle measurement units, i.e. set number of "degrees" for a full circle. Default value is 360 degrees.
pt_br: Define as unidades de medição do ângulo, ou seja, defina o número de "graus" para um círculo completo. O valor padrão é 360 graus.

source: >>> turtle.home() >>> turtle.left(90) >>> turtle.heading() 90.0 >>> # Change angle measurement unit to grad (also known as gon, >>> # grade, or gradian and equals 1/100-th of the right angle.) >>> turtle.degrees(400.0) >>> turtle.heading() 100.0 >>> turtle.degrees(360) >>> turtle.heading() 90.0
pt_br: >>> turtle.home() >>> turtle.left(90) >>> turtle.heading() 90.0 >>> # Alterar unidade de medida de ângulo para grad (também >>> # conhecido como gon, grau ou grado e é igual a 1/100 >>> # do ângulo reto). >>> turtle.degrees(400.0) >>> turtle.heading() 100.0 >>> turtle.degrees(360) >>> turtle.heading() 90.0

source: Set the angle measurement units to radians. Equivalent to ``degrees(2*math.pi)``.
pt_br: Define as unidades de medida de ângulo para radianos. Equivalente a ``degrees(2*math.pi)``.

source: Pull the pen down -- drawing when moving.
pt_br: Desce a caneta - desenha ao se mover.

source: Pull the pen up -- no drawing when moving.
pt_br: Levanta a caneta -- sem qualquer desenho ao se mover.

source: a positive number
pt_br: um número positivo

source: Set the line thickness to *width* or return it. If resizemode is set to "auto" and turtleshape is a polygon, that polygon is drawn with the same line thickness. If no argument is given, the current pensize is returned.
pt_br: Define a espessura da linha para *width* ou retorna-a. Se resizemode estiver definido como "auto" e a forma de tartaruga for um polígono, esse polígono será desenhado com a mesma espessura de linha. Se nenhum argumento for fornecido, a espessura atual da caneta será retornada.

source: a dictionary with some or all of the below listed keys
pt_br: um dicionário com algumas ou todas as chaves listadas abaixo

source: one or more keyword-arguments with the below listed keys as keywords
pt_br: um ou mais argumentos nomeados com as chaves listadas abaixo como palavras-chave

source: Return or set the pen's attributes in a "pen-dictionary" with the following key/value pairs:
pt_br: Retorna ou define os atributos da caneta em um "dicionário da caneta" com os seguintes pares de chave/valor:

source: "pencolor": color-string or color-tuple
pt_br: "pencolor": string de cores ou tupla de cores

source: "fillcolor": color-string or color-tuple
pt_br: "fillcolor": string de cores ou tupla de cores

source: "pensize": positive number
pt_br: "pensize": número positivo

source: "speed": number in range 0..10
pt_br: "speed": número na faixa de 0..10.

source: "resizemode": "auto" or "user" or "noresize"
pt_br: "resizemode": "auto", "user" ou "noresize"

source: "stretchfactor": (positive number, positive number)
pt_br: "stretchfactor": (número positivo, número positivo)

source: "outline": positive number
pt_br: "outline": número positivo

source: "tilt": number
pt_br: "tilt": número

source: This dictionary can be used as argument for a subsequent call to :func:`pen` to restore the former pen-state. Moreover one or more of these attributes can be provided as keyword-arguments. This can be used to set several pen attributes in one statement.
pt_br: Este dicionário pode ser usado como argumento para uma chamada subsequente para :func:`pen` para restaurar o estado da caneta anterior. Além disso, um ou mais desses atributos podem ser fornecidos como argumentos nomeados. Isso pode ser usado para definir vários atributos de caneta em uma instrução.

source: Return ``True`` if pen is down, ``False`` if it's up.
pt_br: Retorna ``True`` se a caneta estiver abaixada, ``False`` se estiver levantada.

source: Return or set the pencolor.
pt_br: Retorna ou define a cor da caneta ou pencolor.

source: Four input formats are allowed:
pt_br: São permitidos quatro formatos de entrada:

source: Return the current pencolor as color specification string or as a tuple (see example). May be used as input to another color/pencolor/fillcolor call.
pt_br: Retorna a cor da caneta atual como string de especificação de cor ou como uma tupla (veja o exemplo). Pode ser usado como entrada para outra chamada color/pencolor/fillcolor.

source: Set pencolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
pt_br: Define pencolor como *colorstring*, que é uma string de especificação de cor Tk, como ``"red"``, ``"yellow"`` ou ``"#33cc8c"``.

source: Set pencolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
pt_br: Define a cor da caneta como a cor RGB representada pela tupla *r*, *g*, e *b*. Os valores de *r*, *g*, and *b* precisam estar na faixa 0..colormode, onde colormode é 1.0 ou 255 (ver :func:`colormode`).

source: Set pencolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
pt_br: Define a cor da caneta como a cor RGB representada por *r*, *g*, e *b*. Os valores de *r*, *g*, and *b* precisam estar na faixa 0..colormode.

source: If turtleshape is a polygon, the outline of that polygon is drawn with the newly set pencolor.
pt_br: Se a forma da tartaruga for um polígono, o contorno desse polígono será desenhado com a nova cor de caneta definida.

source: Return or set the fillcolor.
pt_br: Retorna ou define o fillcolor.

source: Return the current fillcolor as color specification string, possibly in tuple format (see example). May be used as input to another color/pencolor/fillcolor call.
pt_br: Retorna a cor de preenchimento atual como string, ou em formato de tupla (veja o exemplo). Pode ser usado como entrada para outra chamada color/pencolor/fillcolor.

source: Set fillcolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
pt_br: Define fillcolor como *colorstring*, que é uma especificação de cor do Tk em formato de string, como ``"red"``, ``"yellow"``, ou ``"#33cc8c"``.

source: Set fillcolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
pt_br: Define fillcolor como a cor no padrão RGB representada por tupla de *r*, *g* e *b*. Cada um de *r*, *g* e *b* deve estar no limite 0..colormode, em que colormode é 1,0 ou 255 (consulte :func:`colormode`).

source: Set fillcolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
pt_br: Define fillcolor como uma cor no formato RGB representada por *r*, *g* e *b*. Cada um dos elementos *r*, *g* e *b* devem estar no limite 0..colormode.

source: If turtleshape is a polygon, the interior of that polygon is drawn with the newly set fillcolor.
pt_br: Se turtleshape for um polígono, o interior desse polígono será desenhado com a nova cor de preenchimento definida.

source: >>> turtle.fillcolor("violet") >>> turtle.fillcolor() 'violet' >>> turtle.pencolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor((50, 193, 143)) # Integers, not floats >>> turtle.fillcolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor('#ffffff') >>> turtle.fillcolor() (255.0, 255.0, 255.0)
pt_br: >>> turtle.fillcolor("violet") >>> turtle.fillcolor() 'violet' >>> turtle.pencolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor((50, 193, 143)) # Inteiros, não pontos flutuantes >>> turtle.fillcolor() (50.0, 193.0, 143.0) >>> turtle.fillcolor('#ffffff') >>> turtle.fillcolor() (255.0, 255.0, 255.0)

source: Return or set pencolor and fillcolor.
pt_br: Retorna ou define os valores de pencolor e fillcolor.

source: Several input formats are allowed. They use 0 to 3 arguments as follows:
pt_br: Diversos formatos de entrada são permitidos. Eles usam de 0 a 3 argumentos da seguinte forma:

source: Return the current pencolor and the current fillcolor as a pair of color specification strings or tuples as returned by :func:`pencolor` and :func:`fillcolor`.
pt_br: Retorna os valores atuais de pencolor e fillcollor como um par de cores como strings ou tuplas conforme retornado por :func:`pencolor` e :func:`fillcolor`.

source: Inputs as in :func:`pencolor`, set both, fillcolor and pencolor, to the given value.
pt_br: Entradas como em :func:`pencolor`, define ambos, fillcolor e pencolor, para o valor informado.

source: Equivalent to ``pencolor(colorstring1)`` and ``fillcolor(colorstring2)`` and analogously if the other input format is used.
pt_br: Equivalente a ``pencolor(colorstring1)`` e ``fillcolor(colorstring2)`` e de forma análoga se a outra formatação de entrada for usada.

source: If turtleshape is a polygon, outline and interior of that polygon is drawn with the newly set colors.
pt_br: Se o turtleshape for um polígono, o contorno e o interior desse polígono serão desenhados com as cores recém-definidas.

source: See also: Screen method :func:`colormode`.
pt_br: Veja também: Método da tela :func:`colormode`.

source: Return fillstate (``True`` if filling, ``False`` else).
pt_br: Retorna fillstate (``True`` se estiver preenchido, ``False`` caso contrário).

source: Fill the shape drawn in the ``with turtle.fill():`` block.
pt_br: Preenche a forma desenhada no bloco ``with turtle.fill():``.

source: Using :func:`!fill` is equivalent to adding the :func:`begin_fill` before the fill-block and :func:`end_fill` after the fill-block:
pt_br: Usar :func:`!fill` equivale a adicionar :func:`begin_fill` antes do bloco de preenchimento e :func:`end_fill` depois do bloco de preenchimento:

source: To be called just before drawing a shape to be filled.
pt_br: Deve ser chamado antes de desenhar uma forma a ser preenchida.

source: Fill the shape drawn after the last call to :func:`begin_fill`.
pt_br: Preenche a forma desenhada após a última chamada para :func:`begin_fill`.

source: Whether or not overlap regions for self-intersecting polygons or multiple shapes are filled depends on the operating system graphics, type of overlap, and number of overlaps. For example, the Turtle star above may be either all yellow or have some white regions.
pt_br: O preenchimento ou não de regiões sobrepostas para polígonos que se cruzam ou formas múltiplas depende dos gráficos do sistema operacional, do tipo de sobreposição e do número de sobreposições. Por exemplo, a estrela da Tartaruga acima pode ser toda amarela ou ter algumas regiões brancas.

source: Delete the turtle's drawings from the screen, re-center the turtle and set variables to the default values.
pt_br: Remove os desenhos da tartaruga da tela, centraliza novamente a tartaruga e define as variáveis para os valores padrões.

source: Delete the turtle's drawings from the screen. Do not move turtle. State and position of the turtle as well as drawings of other turtles are not affected.
pt_br: Exclui os desenhos da tartaruga da tela e não move a tartaruga. O atual estado e posição da tartaruga, bem como os desenhos de outras tartarugas, não são afetados.

source: object to be written to the TurtleScreen
pt_br: objeto a ser escrito na TurtleScreen

source: one of the strings "left", "center" or right"
pt_br: uma das Strings "left", "center" ou right"

source: Write text - the string representation of *arg* - at the current turtle position according to *align* ("left", "center" or "right") and with the given font. If *move* is true, the pen is moved to the bottom-right corner of the text. By default, *move* is ``False``.
pt_br: Escreve o texto - a representação string de *arg* - na posição atual da tartaruga de acordo com *align* ("left", "center" ou "right") e com a fonte fornecida. Se *move* for verdadeiro, a caneta será movida para o canto inferior direito do texto. Por padrão, *move* é ``False``.

source: Make the turtle invisible. It's a good idea to do this while you're in the middle of doing some complex drawing, because hiding the turtle speeds up the drawing observably.
pt_br: Torna a tartaruga invisível. É uma boa ideia fazer isso enquanto estiver fazendo algum desenho complexo, pois ocultar a tartaruga acelera o desenho de forma visível.

source: Make the turtle visible.
pt_br: Tornar a tartaruga visível.

source: Return ``True`` if the Turtle is shown, ``False`` if it's hidden.
pt_br: Retorna ``True`` se a Tartaruga for exibida, ``False`` se estiver oculta.

source: a string which is a valid shapename
pt_br: uma string que é um shapename válido

source: Set turtle shape to shape with given *name* or, if name is not given, return name of current shape. Shape with *name* must exist in the TurtleScreen's shape dictionary. Initially there are the following polygon shapes: "arrow", "turtle", "circle", "square", "triangle", "classic". To learn about how to deal with shapes see Screen method :func:`register_shape`.
pt_br: Define a forma da tartaruga para a forma com o *nome* fornecido ou, se o nome não for fornecido, retorna nome da forma atual. A forma com *name* deve existir no dicionário TurtleScreen. Inicialmente, há as seguintes formas de polígono: "arrow" (seta), "turtle" (tartaruga), "circle" (círculo), "square" (quadrado), "triangle" (triângulo), "classic" (clássico). Para saber mais sobre como lidar com formas, consulte o método Screen :func:`register_shape` .

source: one of the strings "auto", "user", "noresize"
pt_br: uma das Strings "auto", "user", "noresize"

source: Set resizemode to one of the values: "auto", "user", "noresize". If *rmode* is not given, return current resizemode. Different resizemodes have the following effects:
pt_br: Define resizemode como um dos valores: "auto", "user", "noresize". Se *rmode* não for fornecido, retorna o modo de redimensionamento atual. Os diferentes modos de redimensionamento têm os seguintes efeitos:

source: "auto": adapts the appearance of the turtle corresponding to the value of pensize.
pt_br: "auto": adapta a aparência da tartaruga correspondente ao valor do pensize.

source: "user": adapts the appearance of the turtle according to the values of stretchfactor and outlinewidth (outline), which are set by :func:`shapesize`.
pt_br: "user": adapta a aparência da tartaruga de acordo com os valores de stretchfactor e outlinewidth (outline), que são definidos por :func:`shapesize`.

source: "noresize": no adaption of the turtle's appearance takes place.
pt_br: "noresize": não acontece nenhuma adaptação na aparência da tartaruga.

source: ``resizemode("user")`` is called by :func:`shapesize` when used with arguments.
pt_br: ``resizemode("user")`` é chamado por :func:`shapesize` quando usado com argumentos.

source: positive number
pt_br: número positivo

source: Return or set the pen's attributes x/y-stretchfactors and/or outline. Set resizemode to "user". If and only if resizemode is set to "user", the turtle will be displayed stretched according to its stretchfactors: *stretch_wid* is stretchfactor perpendicular to its orientation, *stretch_len* is stretchfactor in direction of its orientation, *outline* determines the width of the shape's outline.
pt_br: Retorna ou define os atributos x/y-stretchfactors e/ou contorno da caneta. Define o modo de redimensionamento como "usuário". Se e somente se resizemode estiver definido como "user", a tartaruga será exibida esticada de acordo com seus stretchfactors: *stretch_wid* é stretchfactor perpendicular à sua orientação, *stretch_len* é stretchfactor na direção de sua orientação, *outline* determina a largura do contorno da forma.

source: number (optional)
pt_br: número (opcional)

source: Set or return the current shearfactor. Shear the turtleshape according to the given shearfactor shear, which is the tangent of the shear angle. Do *not* change the turtle's heading (direction of movement). If shear is not given: return the current shearfactor, i. e. the tangent of the shear angle, by which lines parallel to the heading of the turtle are sheared.
pt_br: Define ou retorna o fator de shearfactor atual. Corta a forma de tartaruga de acordo com o fator de shearfactor fornecido, que é a tangente do ângulo de shearfactor. *Não* muda a direção da tartaruga (direção do movimento). Se o shearfactor não for fornecido: retorna o fator de shearfactor atual, i. Isso é. a tangente do ângulo de shearfactor, pelo qual as linhas paralelas à direção da tartaruga são cortadas.

source: Rotate the turtleshape by *angle* from its current tilt-angle, but do *not* change the turtle's heading (direction of movement).
pt_br: Gira a forma de tartaruga em um *ângulo* a partir de seu ângulo de inclinação atual, mas *não* altera o rumo da tartaruga (direção do movimento).

source: a number (optional)
pt_br: um número (opcional)

source: Set or return the current tilt-angle. If angle is given, rotate the turtleshape to point in the direction specified by angle, regardless of its current tilt-angle. Do *not* change the turtle's heading (direction of movement). If angle is not given: return the current tilt-angle, i. e. the angle between the orientation of the turtleshape and the heading of the turtle (its direction of movement).
pt_br: Define ou retorna o ângulo de inclinação atual. Se o ângulo for fornecido, gira a forma de tartaruga para apontar na direção especificada pelo ângulo, independentemente do seu ângulo de inclinação atual. *Não* muda a direção da tartaruga (direção do movimento). Se o ângulo não for fornecido: retorna o ângulo de inclinação atual, que é o ângulo entre a orientação da forma da tartaruga e a direção da tartaruga (sua direção de movimento).

source: Set or return the current transformation matrix of the turtle shape.
pt_br: Define ou retorna a matriz de transformação atual da forma da tartaruga.

source: If none of the matrix elements are given, return the transformation matrix as a tuple of 4 elements. Otherwise set the given elements and transform the turtleshape according to the matrix consisting of first row t11, t12 and second row t21, t22. The determinant t11 * t22 - t12 * t21 must not be zero, otherwise an error is raised. Modify stretchfactor, shearfactor and tiltangle according to the given matrix.
pt_br: Se nenhum dos elementos da matriz for fornecido, retorna a matriz de transformação como uma tupla de 4 elementos. Caso contrário, define os elementos fornecidos e transforma a forma da tartaruga de acordo com a matriz que consiste na primeira linha t11, t12 e na segunda linha t21, t22. O resultado de t11 * t22 - t12 * t21 não deve ser zero, caso contrário será gerado um erro. Modifica stretchfactor, shearfactor e tiltangle de acordo com a matriz fornecida.

source: Return the current shape polygon as tuple of coordinate pairs. This can be used to define a new shape or components of a compound shape.
pt_br: Retorna o polígono da forma atual como uma tupla de pares de coordenadas. Isto pode ser usado para definir uma nova forma ou componentes de uma forma composta.

source: a function with two arguments which will be called with the coordinates of the clicked point on the canvas
pt_br: um função com dois argumento que serão chamados com as coordenadas do ponto clicado na tela

source: number of the mouse-button, defaults to 1 (left mouse button)
pt_br: número do botão do mouse, o padrão é 1 (botão esquerdo do mouse)

source: ``True`` or ``False`` -- if ``True``, a new binding will be added, otherwise it will replace a former binding
pt_br: ``True`` ou ``False`` -- se ``True``, uma nova ligação será adicionada; caso contrário, ela substituirá uma ligação antiga

source: Bind *fun* to mouse-click events on this turtle. If *fun* is ``None``, existing bindings are removed. Example for the anonymous turtle, i.e. the procedural way:
pt_br: Vincula *fun* a eventos de clique do mouse nessa tartaruga. Se *fun* for ``None``, as associações existentes serão removidas. Exemplo para a tartaruga anônima, ou seja, a forma processual:
