Repository: python/python-docs-pt-br
Catalog: library/turtle.po
Languages: pt_br

source: The method :func:`!Turtle.fill` has been eliminated. The behaviour of :func:`begin_fill` and :func:`end_fill` have changed slightly: now every filling process must be completed with an ``end_fill()`` call.
pt_br: O método :func:`!Turtle.fill` foi eliminado. O comportamento de :func:`begin_fill` e :func:`end_fill` foi ligeiramente alterado: agora, todo processo de preenchimento deve ser concluído com uma chamada para ``end_fill()``.

source: A method :func:`Turtle.filling <filling>` has been added. It returns a boolean value: ``True`` if a filling process is under way, ``False`` otherwise. This behaviour corresponds to a ``fill()`` call without arguments in Python 2.6.
pt_br: Um método :func:`Turtle.filling <filling>` foi adicionado. Ela retorna um valor booleano: ``True`` se um processo de preenchimento estiver em andamento, ``False`` caso contrário. Esse comportamento corresponde a uma chamada ``fill()`` sem argumento em Python 2.6.

source: Changes since Python 3.0
pt_br: Modificações desde a versão do Python 3.0

source: The :class:`Turtle` methods :func:`shearfactor`, :func:`shapetransform` and :func:`get_shapepoly` have been added. Thus the full range of regular linear transforms is now available for transforming turtle shapes. :func:`tiltangle` has been enhanced in functionality: it now can be used to get or set the tilt angle.
pt_br: Foram adicionados a class :class:`Turtle` os métodos :func:`shearfactor` , :func:`shapetransform` e :func:`get_shapepoly`. Assim, o limite completo de transformações lineares regulares está agora disponível para transformar as formas de tartarugas. O :func:`tiltangle` foi melhorado em termos de funcionalidade: agora pode ser usado para obter ou definir o ângulo de inclinação.

source: The :class:`Screen` method :func:`onkeypress` has been added as a complement to :func:`onkey`. As the latter binds actions to the key release event, an alias: :func:`onkeyrelease` was also added for it.
pt_br: Na classe :class:`Screen`, o método :func:`onkeypress` foi adicionado como um complemento ao :func:`onkey`. Como esse último vincula ações ao liberar uma tecla pressionada, um apelido: :func:`onkeyrelease` também foi adicionado a ele.

source: The method :func:`Screen.mainloop <mainloop>` has been added, so there is no longer a need to use the standalone :func:`mainloop` function when working with :class:`Screen` and :class:`Turtle` objects.
pt_br: O método :func:`Screen.mainloop <mainloop>` foi adicionado. Não é mais necessário utilizar a função :func:`mainloop` quando estiver trabalhando com os objetos :class:`Screen` e :class:`Turtle`.

source: Two input methods have been added: :func:`Screen.textinput <textinput>` and :func:`Screen.numinput <numinput>`. These pop up input dialogs and return strings and numbers respectively.
pt_br: Dois novos métodos para informar dados foram adicionados: :func:`Screen.textinput <textinput>` e :func:`Screen.numinput <numinput>`. Estes métodos abrem caixas de diálogo para digitação e retornam strings e números, respectivamente.
