Repository: python/python-docs-pt-br
Catalog: library/turtle.po
Languages: pt_br

source: the path of the saved PostScript file
pt_br: o caminho do arquivo PostScript salvo

source: if ``False`` and there already exists a file with the given filename, then the function will raise a ``FileExistsError``. If it is ``True``, the file will be overwritten.
pt_br: Se for ``False`` e já existir um arquivo com o nome fornecido, a função levantará uma ``FileExistsError``. Se for ``True``, o arquivo será sobrescrito.

source: Set the size and position of the main window. Default values of arguments are stored in the configuration dictionary and can be changed via a :file:`turtle.cfg` file.
pt_br: Define o tamanho e a posição da janela principal. Os valores padrões dos argumentos são armazenados na configuração dicionário e podem ser alterados por meio de um arquivo :file:`turtle.cfg`.

source: if an integer, a size in pixels, if a float, a fraction of the screen; default is 50% of screen
pt_br: se for um inteiro, o tamanho em pixels; se for um float, uma fração da tela; o padrão é 50% da tela

source: if an integer, the height in pixels, if a float, a fraction of the screen; default is 75% of screen
pt_br: se for um inteiro, a altura em pixels; se for um float, uma fração da tela; o padrão é 75% da tela

source: if positive, starting position in pixels from the left edge of the screen, if negative from the right edge, if ``None``, center window horizontally
pt_br: se positivo, este parâmetro define a posição inicial em pixels a partir da borda esquerda da tela; se negativo, define a partir da borda direita; se ``None``, centraliza a janela horizontalmente

source: if positive, starting position in pixels from the top edge of the screen, if negative from the bottom edge, if ``None``, center window vertically
pt_br: se positivo, este parâmetro define a posição inicial, em pixels, a partir da borda superior da tela; se negativo, define a partir da borda inferior; se for ``None``, centraliza a janela verticalmente

source: >>> screen.setup (width=200, height=200, startx=0, starty=0) >>> # sets window to 200x200 pixels, in upper left of screen >>> screen.setup(width=.75, height=0.5, startx=None, starty=None) >>> # sets window to 75% of screen by 50% of screen and centers
pt_br: >>> screen.setup (width=200, height=200, startx=0, starty=0) >>> # define a janela para 200x200 pixels, no canto superior esquerdo da tela >>> screen.setup(width=.75, height=0.5, startx=None, starty=None) >>> # define a janela para 75% da tela por 50% da tela e centraliza

source: a string that is shown in the titlebar of the turtle graphics window
pt_br: uma string que é exibida na barra de título da janela de gráficos da tartaruga

source: Set title of turtle window to *titlestring*.
pt_br: Define o título da janela da tartaruga como *titlestring*.

source: Public classes
pt_br: Classes Públicas

source: a :class:`!tkinter.Canvas`, a :class:`ScrolledCanvas` or a :class:`TurtleScreen`
pt_br: um :class:`!tkinter.Canvas`, um :class:`ScrolledCanvas` ou um :class:`TurtleScreen`

source: Create a turtle. The turtle has all methods described above as "methods of Turtle/RawTurtle".
pt_br: Cria uma tartaruga. A tartaruga tem todos os métodos descritos acima como "métodos de Turtle/RawTurtle".

source: Subclass of RawTurtle, has the same interface but draws on a default :class:`Screen` object created automatically when needed for the first time.
pt_br: Subclasse do RawTurtle, tem a mesma interface, mas desenha em um objeto padrão :class:`Screen`, que é criado automaticamente, quando necessário, pela primeira vez.

source: a :class:`!tkinter.Canvas`
pt_br: uma :class:`!tkinter.Canvas`

source: Provides screen oriented methods like :func:`bgcolor` etc. that are described above.
pt_br: Fornece métodos orientado para a tela, como :func:`bgcolor` etc., que são descritos acima.

source: Subclass of TurtleScreen, with :ref:`four methods added <screenspecific>`.
pt_br: Subclasse do TurtleScreen, com :ref:`quatro métodos adicionados <screenspecific>`.

source: some Tkinter widget to contain the ScrolledCanvas, i.e. a Tkinter-canvas with scrollbars added
pt_br: algum widget do Tkinter para conter o ScrolledCanvas. Exemplo: um Tkinter-canvas com barras de rolagem adicionadas

source: Used by class Screen, which thus automatically provides a ScrolledCanvas as playground for the turtles.
pt_br: Usado pela classe Screen, que, portanto, fornece automaticamente um ScrolledCanvas como playground para as tartarugas.

source: one of the strings "polygon", "image", "compound"
pt_br: uma das strings "polygon", "image", "compound"

source: Data structure modeling shapes. The pair ``(type_, data)`` must follow this specification:
pt_br: Estrutura de dados para modelar a forma. O par ``(type_, data)`` deve seguir essa especificação:

source: a polygon-tuple, i.e. a tuple of pairs of coordinates
pt_br: Uma tupla com o par de coordenadas do polígono

source: an image (in this form only used internally!)
pt_br: uma imagem (nesse formato, usada apenas internamente!)

source: ``None`` (a compound shape has to be constructed using the :meth:`addcomponent` method)
pt_br: ``None`` (uma forma composta deve ser construída usando o método :meth:`addcomponent`)

source: a polygon, i.e. a tuple of pairs of numbers
pt_br: um polígono, ou seja, um tupla de pares de números

source: a color the *poly* will be filled with
pt_br: uma cor com a qual o *poly* será preenchido

source: a color for the poly's outline (if given)
pt_br: uma cor para o contorno do polígono (se fornecido)

source: Example:
pt_br: Exemplo:

source: >>> poly = ((0,0),(10,-5),(0,10),(-10,-5)) >>> s = Shape("compound") >>> s.addcomponent(poly, "red", "blue") >>> # ... add more components and then use register_shape()
pt_br: >>> poly = ((0,0),(10,-5),(0,10),(-10,-5)) >>> s = Shape("compound") >>> s.addcomponent(poly, "red", "blue") >>> # ... adicione mais componentes e então use register_shape()

source: See :ref:`compoundshapes`.
pt_br: Veja :ref:`compoundshapes`.

source: A two-dimensional vector class, used as a helper class for implementing turtle graphics. May be useful for turtle graphics programs too. Derived from tuple, so a vector is a tuple!
pt_br: Uma classe de vetor bidimensional, usada como classe auxiliar para implementar gráficos de tartaruga. Pode ser útil também para programas de gráficos de tartaruga. Derivado de uma tupla, portanto, um vetor é um tupla!

source: Provides (for *a*, *b* vectors, *k* number):
pt_br: Fornece (para vetores *a*, *b*, número *k*):

source: ``a + b`` vector addition
pt_br: ``a + b`` vetor adicional

source: ``a - b`` vector subtraction
pt_br: ``a - b`` subtração de vetor

source: ``a * b`` inner product
pt_br: ``a * b`` produto interno

source: ``k * a`` and ``a * k`` multiplication with scalar
pt_br: ``k * a`` e ``a * k`` multiplicação com escalar

source: ``abs(a)`` absolute value of a
pt_br: ``abs(a)`` valor absoluto de um

source: ``a.rotate(angle)`` rotation
pt_br: rotação ``a.rotate(angle)``

source: Explanation
pt_br: Explicação

source: A turtle object draws on a screen object, and there a number of key classes in the turtle object-oriented interface that can be used to create them and relate them to each other.
pt_br: Um objeto tartaruga é baseado em um objeto canvas, e há uma série de classes principais na interface orientada a objetos da tartaruga que podem ser usadas para criá-los e relacioná-los entre si.

source: A :class:`Turtle` instance will automatically create a :class:`Screen` instance if one is not already present.
pt_br: Uma instância da classe :class:`Turtle` cria automaticamente uma nova instância de :class:`Screen`, caso esta não esteja presente.

source: ``Turtle`` is a subclass of :class:`RawTurtle`, which *doesn't* automatically create a drawing surface - a *canvas* will need to be provided or created for it. The *canvas* can be a :class:`!tkinter.Canvas`, :class:`ScrolledCanvas` or :class:`TurtleScreen`.
pt_br: ``Turtle`` é um subclasse de :class:`RawTurtle`, que *não* cria automaticamente uma superfície de desenho - uma *tela* precisará ser fornecida ou criada para ele. A *tela* pode ser uma :class:`!tkinter.Canvas`, :class:`ScrolledCanvas` ou :class:`TurtleScreen`.

source: :class:`TurtleScreen` is the basic drawing surface for a turtle. :class:`Screen` is a subclass of ``TurtleScreen``, and includes :ref:`some additional methods <screenspecific>` for managing its appearance (including size and title) and behaviour. ``TurtleScreen``'s constructor needs a :class:`!tkinter.Canvas` or a :class:`ScrolledCanvas` as an argument.
pt_br: :class:`TurtleScreen` é a superfície de desenho básica para uma tartaruga. :class:`Screen` é uma subclasse de ``TurtleScreen`` e inclui :ref:`alguns métodos adicionais <screenspecific>` para gerenciar sua aparência (incluindo tamanho e título) e comportamento. O construtor ``TurtleScreen`` precisa de um :class:`!tkinter.Canvas` ou um :class:`ScrolledCanvas` como um argumento.

source: The functional interface for turtle graphics uses the various methods of ``Turtle`` and ``TurtleScreen``/``Screen``. Behind the scenes, a screen object is automatically created whenever a function derived from a ``Screen`` method is called. Similarly, a turtle object is automatically created whenever any of the functions derived from a Turtle method is called.
pt_br: A interface funcional para gráficos de tartaruga usa os vários métodos de ``Turtle`` e ``TurtleScreen``/``Screen``. Nos bastidores, um objeto de tela é criado automaticamente sempre que um função derivada de um método de ``Screen`` é chamado. Da mesma forma, um objeto de tartaruga é criado automaticamente sempre que qualquer uma das funções derivadas de um método de tartaruga é chamado.

source: To use multiple turtles on a screen, the object-oriented interface must be used.
pt_br: Para usar várias tartarugas em uma tela, a interface orientada a objetos deve ser usada.

source: Help and configuration
pt_br: Ajuda e Configuração

source: How to use help
pt_br: Como usar a Ajuda

source: The public methods of the Screen and Turtle classes are documented extensively via docstrings. So these can be used as online-help via the Python help facilities:
pt_br: Os métodos públicos das classes Screen e Turtle estão amplamente documentado por meio de docstrings. Eles podem ser usados como ajuda on-line por meio dos recursos de ajuda do Python:

source: When using IDLE, tooltips show the signatures and first lines of the docstrings of typed in function-/method calls.
pt_br: Ao usar o IDLE, as dicas de ferramentas mostram as assinaturas e as primeiras linhas das docstrings das chamadas de função/método digitadas.

source: Calling :func:`help` on methods or functions displays the docstrings::
pt_br: Chamar :func:`help` em métodos ou funções exibe o seguinte docstring::

source: The docstrings of the functions which are derived from methods have a modified form::
pt_br: Os docstrings de funções que são derivados do métodos têm um formato diferente::

source: These modified docstrings are created automatically together with the function definitions that are derived from the methods at import time.
pt_br: Esses docstrings modificados são criados automaticamente junto com as definições de função que são derivadas de métodos ao importar.

source: Translation of docstrings into different languages
pt_br: Tradução de docstrings em diferentes idiomas

source: There is a utility to create a dictionary the keys of which are the method names and the values of which are the docstrings of the public methods of the classes Screen and Turtle.
pt_br: Há um utilitário para criar a dicionário cujas chaves são os nomes de método e cujos valores são os docstrings dos métodos públicos das classes Screen e Turtle.

source: a string, used as filename
pt_br: uma string, usado como nome de arquivo

source: Create and write docstring-dictionary to a Python script with the given filename. This function has to be called explicitly (it is not used by the turtle graphics classes). The docstring dictionary will be written to the Python script :file:`{filename}.py`. It is intended to serve as a template for translation of the docstrings into different languages.
pt_br: Cria e escreve um dicionário de docstring em um script Python com o nome de arquivo fornecido. Esta função deve ser chamada explicitamente (ela não é usada pelas classes gráficas da tartaruga). O dicionário docstring será gravado no script Python :file:`{filename}.py`. O objetivo é servir como modelo para traduzir os documentos para diferentes idiomas.

source: If you (or your students) want to use :mod:`turtle` with online help in your native language, you have to translate the docstrings and save the resulting file as e.g. :file:`turtle_docstringdict_german.py`.
pt_br: Se você (ou seus alunos) quiserem usar o :mod:`turtle` com a ajuda on-line em seu idioma nativo, será necessário traduzir os docstrings e salvar o arquivo resultante como, por exemplo, :file:`turtle_docstringdict_german.py`.

source: If you have an appropriate entry in your :file:`turtle.cfg` file this dictionary will be read in at import time and will replace the original English docstrings.
pt_br: Se você tiver uma entrada específica em seu arquivo :file:`turtle.cfg`, esse dicionário será lido no momento do importar e substituirá as documentações originais em inglês.

source: At the time of this writing there are docstring dictionaries in German and in Italian. (Requests please to glingl@aon.at.)
pt_br: No momento da redação deste texto, há docstring dicionários em alemão e italiano. (Pedidos devem ser enviados para glingl@aon.at.)

source: How to configure Screen and Turtles
pt_br: Como configurar Screen and Turtles

source: The built-in default configuration mimics the appearance and behaviour of the old turtle module in order to retain best possible compatibility with it.
pt_br: A configuração padrão integrada imita a aparência e o comportamento do antigo módulo Turtle para manter a melhor compatibilidade possível com ele.

source: If you want to use a different configuration which better reflects the features of this module or which better fits to your needs, e.g. for use in a classroom, you can prepare a configuration file ``turtle.cfg`` which will be read at import time and modify the configuration according to its settings.
pt_br: Se quiser usar uma configuração diferente que reflita melhor o recurso deste módulo ou que se adapte melhor às suas necessidades, por exemplo, para uso em uma sala de aula, você pode criar um arquivo de configuração ``turtle.cfg`` que será lido no momento de importar e modifica a configuração de acordo com suas definições.

source: The built in configuration would correspond to the following ``turtle.cfg``:
pt_br: A configuração que definida no arquivo ``turtle.cfg``:

source: Short explanation of selected entries:
pt_br: Breve explicação das entradas selecionadas:

source: The first four lines correspond to the arguments of the :func:`Screen.setup <setup>` method.
pt_br: As quatro primeiras linhas correspondem aos argumentos do método :func:`Screen.setup <setup>`.

source: Line 5 and 6 correspond to the arguments of the method :func:`Screen.screensize <screensize>`.
pt_br: As linhas 5 e 6 correspondem a argumento do método :func:`Screen.screensize <screensize>`.

source: *shape* can be any of the built-in shapes, e.g: arrow, turtle, etc. For more info try ``help(shape)``.
pt_br: *shape* pode ser qualquer uma das formas pré-definidas, como por exemplo: seta, tartaruga, etc. Para obter mais informações, consulte ``help(shape)``.

source: If you want to use no fill color (i.e. make the turtle transparent), you have to write ``fillcolor = ""`` (but all nonempty strings must not have quotes in the cfg file).
pt_br: Se você não quiser usar nenhuma cor de preenchimento (ou seja, tornar a tartaruga transparente), você deve usar ``fillcolor = ""`` (todas as strings não vazias não devem ter aspas no arquivo cfg).

source: If you want to reflect the turtle its state, you have to use ``resizemode = auto``.
pt_br: Se você quiser refletir o estado da tartaruga, você deve usar ``resizemode = auto``.

source: If you set e.g. ``language = italian`` the docstringdict :file:`turtle_docstringdict_italian.py` will be loaded at import time (if present on the import path, e.g. in the same directory as :mod:`turtle`).
pt_br: Se você definir, por exemplo, ``language = italian``, o docstringdict :file:`turtle_docstringdict_italian.py` será carregado ao importar (se estiver presente no caminho de importação, por exemplo, no mesmo diretório que :mod:`turtle`).

source: The entries *exampleturtle* and *examplescreen* define the names of these objects as they occur in the docstrings. The transformation of method-docstrings to function-docstrings will delete these names from the docstrings.
pt_br: As entradas *exampleturtle* e *examplescreen* definem os nomes desses objetos conforme ocorrem nas docstrings. A transformação de "método-docstrings" para "função-docstrings" excluirá esses nomes dos docstrings.

source: *using_IDLE*: Set this to ``True`` if you regularly work with IDLE and its ``-n`` switch ("no subprocess"). This will prevent :func:`exitonclick` to enter the mainloop.
pt_br: *using_IDLE*: Defina isso como ``True`` se você trabalha regularmente com IDLE e sua chave ``-n`` ("sem subprocesso"). Isso impedirá que o :func:`exitonclick` entre no loop principal.

source: There can be a :file:`turtle.cfg` file in the directory where :mod:`turtle` is stored and an additional one in the current working directory. The latter will override the settings of the first one.
pt_br: Pode haver um arquivo :file:`turtle.cfg` no diretório em que o :mod:`turtle` está armazenado e um arquivo adicional no diretório de trabalho atual. O arquivo armazenado no diretório de trabalho atual tem preferência e vai substituir as configurações do primeiro.

source: The :file:`Lib/turtledemo` directory contains a :file:`turtle.cfg` file. You can study it as an example and see its effects when running the demos (preferably not from within the demo-viewer).
pt_br: O diretório :file:`Lib/turtledemo` contém um arquivo chamado :file:`turtle.cfg`. Você pode usá-lo como um exemplo e ver seus efeitos ao executar as demonstrações (de preferência, não utilize visualizador de demonstrações).

source: :mod:`turtledemo` --- Demo scripts
pt_br: :mod:`turtledemo` --- Scripts de Demonstração

source: The :mod:`turtledemo` package includes a set of demo scripts. These scripts can be run and viewed using the supplied demo viewer as follows::
pt_br: O pacote :mod:`turtledemo` inclui um conjunto de scripts de demonstração. Esses scripts podem ser executados e visualizados usando o visualizador de demonstração fornecido da seguinte forma::

source: Alternatively, you can run the demo scripts individually. For example, ::
pt_br: Como alternativa, você pode executar os scripts de demonstração individualmente. Por exemplo, ::

source: The :mod:`turtledemo` package directory contains:
pt_br: O diretório do pacote :mod:`turtledemo` contém:

source: A demo viewer :file:`__main__.py` which can be used to view the sourcecode of the scripts and run them at the same time.
pt_br: Um arquivo de exemplo :file:`__main__.py` que pode ser usado para visualizar o código-fonte dos scripts e executá-los ao mesmo tempo.

source: Multiple scripts demonstrating different features of the :mod:`turtle` module. Examples can be accessed via the Examples menu. They can also be run standalone.
pt_br: Vários scripts que demonstram diferentes recursos do módulo :mod:`turtle`. Os exemplos podem ser acessados no menu Exemplos. Eles também podem ser executados de forma isolada.

source: A :file:`turtle.cfg` file which serves as an example of how to write and use such files.
pt_br: Um arquivo :file:`turtle.cfg` que serve como exemplo de como escrever e usar esse tipo de arquivos.

source: The demo scripts are:
pt_br: Os scripts de demonstração são:

source: Name
pt_br: Nome

source: Description
pt_br: Descrição

source: Features
pt_br: Recursos

source: complex classical turtle graphics pattern
pt_br: Padrão de gráficos de tartaruga clássico complexo

source: graphs Verhulst dynamics, shows that computer's computations can generate results sometimes against the common sense expectations
pt_br: gráficos do modelo de Verhulst, mostram que os cálculos do computador podem gerar resultados às vezes contra as expectativas do bom senso

source: world coordinates
pt_br: coordenadas mundiais

source: clock
pt_br: relógio

source: analog clock showing time of your computer
pt_br: Relógio analógico que mostra o horário do seu computador

source: turtles as clock's hands, ontimer
pt_br: tartarugas como as mãos do relógio, ontimer

source: experiment with r, g, b
pt_br: experimento com r, g, b

source: Hilbert & Koch curves
pt_br: Curvas de Hilbert & Koch

source: recursion
pt_br: recursão

source: Towers of Hanoi
pt_br: Torres de Hanoi

source: Rectangular Turtles as Hanoi discs (shape, shapesize)
pt_br: Tartarugas retângulos como discos de Hanói (shape, shapesize)

source: play the classical nim game with three heaps of sticks against the computer.
pt_br: jogue o clássico jogo nim com três montes de gravetos contra o computador.

source: turtles as nimsticks, event driven (mouse, keyboard)
pt_br: tartarugas como gravetos, acionadas por eventos (mouse, teclado)

source: super minimalistic drawing program
pt_br: programa de desenho super minimalista

source: peace
pt_br: peça

source: elementary
pt_br: elementar

source: turtle: appearance and animation
pt_br: tartaruga: aparência e animação

source: aperiodic tiling with kites and darts
pt_br: ladrilhos irregulares com pipas e dardos

source: simulation of gravitational system
pt_br: simulação do sistema gravitacional

source: compound shapes, :class:`Vec2D`
pt_br: formas compostas, :class:`Vec2D`

source: a pattern from the wikipedia article on turtle graphics
pt_br: um padrão do artigo Wikipédia sobre gráficos de tartaruga

source: dancing turtles rotating pairwise in opposite direction
pt_br: tartarugas dançantes girando em pares na direção oposta

source: compound shapes, clone shapesize, tilt, get_shapepoly, update
pt_br: formas compostas, clonar o shapesize, inclinação, get_shapepoly, atualizar

source: visual demonstration of different sorting methods
pt_br: demonstração visual de diferentes tipos de métodos de ordenação

source: simple alignment, randomization
pt_br: alinhamento simples, randomização

source: a (graphical) breadth first tree (using generators)
pt_br: uma árvore (gráfica) da largura inicial (usando geradores)

source: simple design
pt_br: desenho simples

source: turtles on two canvases
pt_br: tartarugas em duas telas

source: another elementary example
pt_br: outro exemplo elementar

source: Have fun!
pt_br: Diverta-se!

source: Changes since Python 2.6
pt_br: Modificações desde a versão do Python 2.6

source: The methods :func:`Turtle.tracer <tracer>`, :func:`Turtle.window_width <window_width>` and :func:`Turtle.window_height <window_height>` have been eliminated. Methods with these names and functionality are now available only as methods of :class:`Screen`. The functions derived from these remain available. (In fact already in Python 2.6 these methods were merely duplications of the corresponding :class:`TurtleScreen`/:class:`Screen` methods.)
pt_br: O métodos :func:`Turtle.tracer <tracer>`, :func:`Turtle.window_width <window_width>` e :func:`Turtle.window_height <window_height>` foram removidos. O métodos com esses nomes e funcionalidades agora estão disponíveis apenas como métodos da classe :class:`Screen`. As funções derivadas desses métodos continuam disponíveis. (No Python 2.6 esses métodos eram duplicações dos métodos correspondentes das classes :class:`TurtleScreen`/:class:`Screen`).
