Repository: python/python-docs-pt-br
Catalog: library/types.po
Languages: pt_br

source: This function transforms a :term:`generator` function into a :term:`coroutine function` which returns a generator-based coroutine. The generator-based coroutine is still a :term:`generator iterator`, but is also considered to be a :term:`coroutine` object and is :term:`awaitable`. However, it may not necessarily implement the :meth:`~object.__await__` method.
pt_br: Esta função transforma uma função :term:`geradora <generator>` em uma :term:`função de corrotina` que retorna uma corrotina baseada em gerador. A corrotina baseada em gerador ainda é um :term:`iterador gerador`, mas também é considerada um objeto :term:`corrotina` e é :term:`aguardável`. No entanto, pode não necessariamente implementar o método :meth:`~object.__await__`.

source: If *gen_func* is a generator function, it will be modified in-place.
pt_br: Se *gen_func* for uma função geradora, ela será modificada no local.

source: If *gen_func* is not a generator function, it will be wrapped. If it returns an instance of :class:`collections.abc.Generator`, the instance will be wrapped in an *awaitable* proxy object. All other types of objects will be returned as is.
pt_br: Se *gen_func* não for uma função geradora, ela será envolta. Se ele retornar uma instância de :class:`Collections.abc.Generator`, a instância será envolvida em um objeto proxy *aguardável*. Todos os outros tipos de objetos serão retornados como estão.

source: built-in function
pt_br: função embutida
