Repository: python/python-docs-pt-br
Catalog: library/types.po
Languages: pt_br

source: :mod:`!types` --- Dynamic type creation and names for built-in types
pt_br: :mod:`!types` --- Criação de tipos dinâmicos e nomes para tipos embutidos

source: **Source code:** :source:`Lib/types.py`
pt_br: **Código-fonte:** :source:`Lib/types.py`

source: This module defines utility functions to assist in dynamic creation of new types.
pt_br: Este módulo define funções utilitárias para auxiliar na criação dinâmica de novos tipos.

source: It also defines names for some object types that are used by the standard Python interpreter, but not exposed as builtins like :class:`int` or :class:`str` are.
pt_br: Também define nomes para alguns tipos de objetos usados pelo interpretador Python padrão, mas não expostos como componentes embutidos como :class:`int` ou :class:`str` são.

source: Finally, it provides some additional type-related utility classes and functions that are not fundamental enough to be builtins.
pt_br: Por fim, fornece algumas classes e funções adicionais relacionadas ao tipo que não são fundamentais o suficiente para serem incorporadas.

source: Dynamic Type Creation
pt_br: Criação de tipos dinâmicos

source: Creates a class object dynamically using the appropriate metaclass.
pt_br: Cria um objeto de classe dinamicamente usando a metaclasse apropriada.

source: The first three arguments are the components that make up a class definition header: the class name, the base classes (in order), the keyword arguments (such as ``metaclass``).
pt_br: Os três primeiros argumentos são os componentes que compõem um cabeçalho de definição de classe: o nome da classe, as classes base (em ordem), os argumentos nomeados (como ``metaclass``).

source: The *exec_body* argument is a callback that is used to populate the freshly created class namespace. It should accept the class namespace as its sole argument and update the namespace directly with the class contents. If no callback is provided, it has the same effect as passing in ``lambda ns: None``.
pt_br: O argumento *exec_body* é um retorno de chamada usado para preencher o espaço para nome da classe recém-criado. Ele deve aceitar o espaço para nome da classe como seu único argumento e atualizar o espaço para nome diretamente com o conteúdo da classe. Se nenhum retorno de chamada for fornecido, ele terá o mesmo efeito que passar em ``lambda ns: None``.

source: Calculates the appropriate metaclass and creates the class namespace.
pt_br: Calcula a metaclasse apropriada e cria o espaço de nomes da classe.

source: The arguments are the components that make up a class definition header: the class name, the base classes (in order) and the keyword arguments (such as ``metaclass``).
pt_br: Os argumentos são os componentes que compõem um cabeçalho de definição de classe: o nome da classe, as classes base (em ordem) e os argumentos nomeados (como ``metaclass``).

source: The return value is a 3-tuple: ``metaclass, namespace, kwds``
pt_br: O valor de retorno é uma tupla de 3: ``metaclass, namespace, kwds``

source: *metaclass* is the appropriate metaclass, *namespace* is the prepared class namespace and *kwds* is an updated copy of the passed in *kwds* argument with any ``'metaclass'`` entry removed. If no *kwds* argument is passed in, this will be an empty dict.
pt_br: *metaclass* é a metaclasse apropriada, *namespace* é o espaço de nomes da classe preparada e *kwds* é uma cópia atualizada do argumento passado no *kwds* com qualquer entrada ``'metaclass'`` removida. Se nenhum argumento *kwds* for passado, este será um ditado vazio.

source: The default value for the ``namespace`` element of the returned tuple has changed. Now an insertion-order-preserving mapping is used when the metaclass does not have a ``__prepare__`` method.
pt_br: O valor padrão para o elemento ``namespace`` da tupla retornada foi alterado. Agora, um mapeamento preservando-ordem-inserção é usado quando a metaclasse não possui um método ``__prepare__``.

source: Full details of the class creation process supported by these functions
pt_br: Detalhes completos do processo de criação de classe suportado por essas funções

source: :pep:`3115` - Metaclasses in Python 3000
pt_br: :pep:`3115` - Metaclasses no Python 3000

source: Introduced the ``__prepare__`` namespace hook
pt_br: Introduzido o gancho de espaço de nomes ``__prepare__``

source: Resolve MRO entries dynamically as specified by :pep:`560`.
pt_br: Resolve entradas MRO dinamicamente, conforme especificado pela :pep:`560`.

source: This function looks for items in *bases* that are not instances of :class:`type`, and returns a tuple where each such object that has an :meth:`~object.__mro_entries__` method is replaced with an unpacked result of calling this method. If a *bases* item is an instance of :class:`type`, or it doesn't have an :meth:`!__mro_entries__` method, then it is included in the return tuple unchanged.
pt_br: Esta função procura por itens em *bases* que não sejam instâncias de :class:`type` e retorna uma tupla onde cada objeto que possui um método :meth:`~object.__mro_entries__` é substituído por um resultado desempacotado da chamada desse método. Se um item *bases* é uma instância de :class:`type`, ou não possui o método :meth:`!__mro_entries__`, ele é incluído na tupla de retorno inalterada.

source: Return the tuple of objects originally given as the bases of *cls* before the :meth:`~object.__mro_entries__` method has been called on any bases (following the mechanisms laid out in :pep:`560`). This is useful for introspecting :ref:`Generics <user-defined-generics>`.
pt_br: Retorna a tupla de objetos originalmente dados como as bases de *cls* antes do método :meth:`~object.__mro_entries__` ter sido chamado em qualquer base (seguindo os mecanismos apresentados na :pep:`560`). Isso é útil para introspecção de :ref:`Generics <user-defined-generics>`.

source: For classes that have an ``__orig_bases__`` attribute, this function returns the value of ``cls.__orig_bases__``. For classes without the ``__orig_bases__`` attribute, :attr:`cls.__bases__ <type.__bases__>` is returned.
pt_br: Para classes que possuem um atributo ``__orig_bases__``, esta função retorna o valor de ``cls.__orig_bases__``. Para classes sem o atributo ``__orig_bases__``, :attr:`cls.__bases__ <type.__bases__>` é retornado.

source: Examples::
pt_br: Exemplos::

source: :pep:`560` - Core support for typing module and generic types
pt_br: :pep:`560` - Suporte básico para módulo typing e tipos genéricos

source: Standard Interpreter Types
pt_br: Tipos padrão do interpretador

source: This module provides names for many of the types that are required to implement a Python interpreter. It deliberately avoids including some of the types that arise only incidentally during processing such as the ``listiterator`` type.
pt_br: Este módulo fornece nomes para muitos dos tipos necessários para implementar um interpretador Python. Evita deliberadamente incluir alguns dos tipos que surgem apenas incidentalmente durante o processamento, como o tipo ``listiterator``.

source: Typical use of these names is for :func:`isinstance` or :func:`issubclass` checks.
pt_br: O uso típico desses nomes é para verificações :func:`isinstance` ou :func:`issubclass`.

source: If you instantiate any of these types, note that signatures may vary between Python versions.
pt_br: Se você instanciar algum desses tipos, observe que as assinaturas podem variar entre as versões do Python.

source: Standard names are defined for the following types:
pt_br: Os nomes padrão são definidos para os seguintes tipos:

source: The type of :data:`None`.
pt_br: O tipo de :data:`None`.

source: The type of user-defined functions and functions created by :keyword:`lambda` expressions.
pt_br: O tipo de funções definidas pelo usuário e funções criadas por expressões :keyword:`lambda`.

source: Raises an :ref:`auditing event <auditing>` ``function.__new__`` with argument ``code``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``function.__new__`` com o argumento ``code``.

source: The audit event only occurs for direct instantiation of function objects, and is not raised for normal compilation.
pt_br: O evento de auditoria ocorre apenas para instanciação direta de objetos de função e não é levantado para compilação normal.

source: The type of :term:`generator`-iterator objects, created by generator functions.
pt_br: O tipo de objetos de iterador :term:`gerador`, criados pelas funções de gerador.

source: The type of :term:`coroutine` objects, created by :keyword:`async def` functions.
pt_br: O tipo de objetos de :term:`corrotina`, criado por funções de :keyword:`async def`.

source: The type of :term:`asynchronous generator`-iterator objects, created by asynchronous generator functions.
pt_br: O tipo de objetos de iterador :term:`gerador assíncrono`, criados pelas funções do gerador assíncrono.

source: The type of :ref:`code objects <code-objects>` such as returned by :func:`compile`.
pt_br: O tipo de :ref:`objetos código <code-objects>` retornados por :func:`compile`.

source: Raises an :ref:`auditing event <auditing>` ``code.__new__`` with arguments ``code``, ``filename``, ``name``, ``argcount``, ``posonlyargcount``, ``kwonlyargcount``, ``nlocals``, ``stacksize``, ``flags``.
pt_br: Levanta um ``code.__new__`` de :ref:`evento de auditoria <auditing>` com os argumentos ``code``, ``filename``, ``name``, ``argcount``, ``posonlyargcount``, ``kwonlyargcount``, ``nlocals``, ``stacksize``, ``flags``.

source: Note that the audited arguments may not match the names or positions required by the initializer. The audit event only occurs for direct instantiation of code objects, and is not raised for normal compilation.
pt_br: Observe que os argumentos auditados podem não corresponder aos nomes ou posições exigidos pelo inicializador. O evento de auditoria ocorre apenas para instanciação direta de objetos de código e não é levantado para compilação normal.

source: The type for cell objects: such objects are used as containers for a function's :term:`closure variables <closure variable>`.
pt_br: O tipo para objetos de célula: tais objetos são usados como contêineres para as :term:`variáveis de clausura <closure variable>` de uma função.

source: The type of methods of user-defined class instances.
pt_br: O tipo de método de instâncias de classe definidas pelo usuário.

source: The type of built-in functions like :func:`len` or :func:`sys.exit`, and methods of built-in classes. (Here, the term "built-in" means "written in C".)
pt_br: O tipo de funções embutidas como :func:`len` ou :func:`sys.exit`, e métodos de classes embutidas. (Aqui, o termo "embutidas" significa "escrito em C".)

source: The type of methods of some built-in data types and base classes such as :meth:`object.__init__` or :meth:`object.__lt__`.
pt_br: O tipo de método de alguns tipos de dados embutidos e classes base, como :meth:`object.__init__` ou :meth:`object.__lt__`.

source: The type of *bound* methods of some built-in data types and base classes. For example it is the type of :code:`object().__str__`.
pt_br: O tipo de métodos *vinculados* de alguns tipos de dados embutidos e classes base. Por exemplo, é o tipo de :code:`object().__str__`.

source: The type of :data:`NotImplemented`.
pt_br: O tipo de :data:`NotImplemented`.

source: The type of methods of some built-in data types such as :meth:`str.join`.
pt_br: O tipo de método de alguns tipos de dados embutidos, como :meth:`str.join`.

source: The type of *unbound* class methods of some built-in data types such as ``dict.__dict__['fromkeys']``.
pt_br: O tipo de métodos de classe *não vinculados* de alguns tipos de dados embutidos, como ``dict.__dict__['fromkeys']``.

source: The type of :term:`modules <module>`. The constructor takes the name of the module to be created and optionally its :term:`docstring`.
pt_br: O tipo de :term:`módulos <module>`. O construtor aceita o nome do módulo a ser criado e, opcionalmente, seu :term:`docstring`.

source: :ref:`Documentation on module objects <module-objects>`
pt_br: :ref:`Documentação em objetos de módulo <module-objects>`

source: Provides details on the special attributes that can be found on instances of :class:`!ModuleType`.
pt_br: Fornece detalhes sobre os atributos especiais que podem ser encontrados em instâncias de :class:`!ModuleType`.

source: Modules created using the :class:`!ModuleType` constructor are created with many of their special attributes unset or set to default values. :func:`!module_from_spec` provides a more robust way of creating :class:`!ModuleType` instances which ensures the various attributes are set appropriately.
pt_br: Módulos criados usando o construtor :class:`!ModuleType` são criados com muitos de seus atributos especiais não definidos ou definidos com valores padrão. :func:`!module_from_spec` fornece uma maneira mais robusta de criar instâncias :class:`!ModuleType`, o que garante que os vários atributos sejam definidos adequadamente.

source: The type of :data:`Ellipsis`.
pt_br: O tipo de :data:`Ellipsis`.

source: The type of :ref:`parameterized generics <types-genericalias>` such as ``list[int]``.
pt_br: O tipo dos :ref:`genéricos parametrizados <types-genericalias>` como ``list[int]``.

source: ``t_origin`` should be a non-parameterized generic class, such as ``list``, ``tuple`` or ``dict``. ``t_args`` should be a :class:`tuple` (possibly of length 1) of types which parameterize ``t_origin``::
pt_br: ``t_origin`` deve ser uma classe genérica não parametrizada, como ``list``, ``tuple`` ou ``dict``. ``t_args`` deve ser uma :class:`tuple` (possivelmente com comprimento 1) de tipos que parametrizam ``t_origin``::

source: This type can now be subclassed.
pt_br: Este tipo pode agora ter uma subclasse.

source: :ref:`Generic Alias Types<types-genericalias>`
pt_br: :ref:`Tipos Generic Alias <types-genericalias>`

source: In-depth documentation on instances of :class:`!types.GenericAlias`
pt_br: Documentação detalhada sobre instâncias de :class:`!types.GenericAlias`

source: :pep:`585` - Type Hinting Generics In Standard Collections
pt_br: :pep:`585` - Sugestão de tipo para Genéricos em coleções padrão

source: Introducing the :class:`!types.GenericAlias` class
pt_br: Apresentação da classe :class:`!types.GenericAlias`

source: The type of :ref:`union type expressions<types-union>`.
pt_br: O tipo de :ref:`expressões de tipo união <types-union>`.

source: This is now an alias for :class:`typing.Union`.
pt_br: Isso é agora um apelido para :class:`typing.Union`.

source: The type of traceback objects such as found in ``sys.exception().__traceback__``.
pt_br: O tipo de objetos traceback, como encontrados em ``sys.exception().__traceback__``.

source: See :ref:`the language reference <traceback-objects>` for details of the available attributes and operations, and guidance on creating tracebacks dynamically.
pt_br: Veja :ref:`a referência de linguagem <traceback-objects>` para detalhes dos atributos e operações disponíveis, e orientação sobre como criar tracebacks dinamicamente.

source: The type of :ref:`frame objects <frame-objects>` such as found in :attr:`tb.tb_frame <traceback.tb_frame>` if ``tb`` is a traceback object.
pt_br: O tipo de :ref:`objetos de quadro <frame-objects>` como encontrado em :attr:`tb.tb_frame <traceback.tb_frame>` se ``tb`` é um objeto traceback.

source: The type of objects defined in extension modules with ``PyGetSetDef``, such as :attr:`FrameType.f_locals <frame.f_locals>` or ``array.array.typecode``. This type is used as descriptor for object attributes; it has the same purpose as the :class:`property` type, but for classes defined in extension modules.
pt_br: O tipo de objetos definidos em módulos de extensão com ``PyGetSetDef``, como :attr:`FrameType.f_locals <frame.f_locals>` ou ``array.array.typecode``. Este tipo é usado como descritor para atributos de objeto; tem o mesmo propósito que o tipo :class:`property`, mas para classes definidas em módulos de extensão.

source: The type of objects defined in extension modules with ``PyMemberDef``, such as ``datetime.timedelta.days``. This type is used as descriptor for simple C data members which use standard conversion functions; it has the same purpose as the :class:`property` type, but for classes defined in extension modules.
pt_br: O tipo de objetos definidos em módulos de extensão com ``PyMemberDef``, como ``datetime.timedelta.days``. Este tipo é usado como descritor para membros de dados C simples que usam funções de conversão padrão; tem o mesmo propósito que o tipo :class:`property`, mas para classes definidas em módulos de extensão.

source: In addition, when a class is defined with a :attr:`~object.__slots__` attribute, then for each slot, an instance of :class:`!MemberDescriptorType` will be added as an attribute on the class. This allows the slot to appear in the class's :attr:`~type.__dict__`.
pt_br: Além disso, quando uma classe é definida com um atributo :attr:`~object.__slots__`, então para cada atributo, uma instância de :class:`!MemberDescriptorType` será adicionada como um atributo na classe. Isso permite que o atributo apareça no :attr:`~type.__dict__` da classe.

source: In other implementations of Python, this type may be identical to ``GetSetDescriptorType``.
pt_br: Em outras implementações de Python, este tipo pode ser idêntico a ``GetSetDescriptorType``.

source: Read-only proxy of a mapping. It provides a dynamic view on the mapping's entries, which means that when the mapping changes, the view reflects these changes.
pt_br: Proxy somente leitura de um mapeamento. Ele fornece uma visão dinâmica das entradas do mapeamento, o que significa que quando o mapeamento muda, a visão reflete essas mudanças.

source: Updated to support the new union (``|``) operator from :pep:`584`, which simply delegates to the underlying mapping.
pt_br: Atualizado para ter suporte ao novo operador de união (``|``) da :pep:`584`, que simplesmente delega para o mapeamento subjacente.

source: Return ``True`` if the underlying mapping has a key *key*, else ``False``.
pt_br: Retorna ``True`` se o mapeamento subjacente tiver uma chave *key*, senão ``False``.

source: Return the item of the underlying mapping with key *key*. Raises a :exc:`KeyError` if *key* is not in the underlying mapping.
pt_br: Retorna e o item do mapeamento subjacente com a chave *key*. Levanta um :exc:`KeyError` se *key* não estiver no mapeamento subjacente.

source: Return an iterator over the keys of the underlying mapping. This is a shortcut for ``iter(proxy.keys())``.
pt_br: Retorna um iterador sobre as chaves do mapeamento subjacente. Este é um atalho para ``iter(proxy.keys())``.

source: Return the number of items in the underlying mapping.
pt_br: Retorna o número de itens no mapeamento subjacente.

source: Return a shallow copy of the underlying mapping.
pt_br: Retorna uma cópia rasa do mapeamento subjacente.

source: Return the value for *key* if *key* is in the underlying mapping, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
pt_br: Retorna o valor para *key* se *key* estiver no mapeamento subjacente, caso contrário, *default*. Se *default* não for fornecido, o padrão é ``None``, de forma que este método nunca levante uma :exc:`KeyError`.

source: Return a new view of the underlying mapping's items (``(key, value)`` pairs).
pt_br: Retorna uma nova visão dos itens do mapeamento subjacente (pares ``(chave, valor)``).

source: Return a new view of the underlying mapping's keys.
pt_br: Retorna uma nova visão das chaves do mapeamento subjacente.

source: Return a new view of the underlying mapping's values.
pt_br: Retorna uma nova visão dos valores do mapeamento subjacente.

source: Return a reverse iterator over the keys of the underlying mapping.
pt_br: Retorna um iterador reverso sobre as chaves do mapeamento subjacente.

source: Return a hash of the underlying mapping.
pt_br: Retorna um hash do mapeamento subjacente.

source: The type of :ref:`capsule objects <capsules>`.
pt_br: O tipo de :ref:`objetos cápsula <capsules>`.

source: Additional Utility Classes and Functions
pt_br: Classes e funções de utilidades adicionais

source: A simple :class:`object` subclass that provides attribute access to its namespace, as well as a meaningful repr.
pt_br: Uma subclasse :class:`object` simples que fornece acesso de atributo ao seu espaço de nomes, bem como um repr significativo.

source: Unlike :class:`object`, with :class:`!SimpleNamespace` you can add and remove attributes.
pt_br: Ao contrário de :class:`object`, com :class:`!SimpleNamespace` você pode adicionar e remover atributos.

source: :py:class:`SimpleNamespace` objects may be initialized in the same way as :class:`dict`: either with keyword arguments, with a single positional argument, or with both. When initialized with keyword arguments, those are directly added to the underlying namespace. Alternatively, when initialized with a positional argument, the underlying namespace will be updated with key-value pairs from that argument (either a mapping object or an :term:`iterable` object producing key-value pairs). All such keys must be strings.
pt_br: Objetos :py:class:`SimpleNamespace` podem ser inicializados da mesma forma que :class:`dict`: ou com argumentos nomeados, com um único argumento posicional, ou com ambos. Quando inicializados com argumentos nomeados, eles são adicionados diretamente ao espaço de nomes subjacente. Alternativamente, quando inicializado com um argumento posicional, o espaço de nomes subjacente será atualizado com pares de valores-chave desse argumento (um objeto mapeamento ou um objeto :term:`iterável` produzindo pares de valores-chave). Todas essas chaves devem ser strings.

source: The type is roughly equivalent to the following code::
pt_br: O tipo é aproximadamente equivalente ao seguinte código::

source: ``SimpleNamespace`` may be useful as a replacement for ``class NS: pass``. However, for a structured record type use :func:`~collections.namedtuple` instead.
pt_br: ``SimpleNamespace`` pode ser útil como um substituto para ``class NS: pass``. No entanto, para um tipo de registro estruturado, use :func:`~collections.namedtuple`.

source: :class:`!SimpleNamespace` objects are supported by :func:`copy.replace`.
pt_br: Objetos :class:`!SimpleNamespace` são suportados por :func:`copy.replace`.

source: Attribute order in the repr changed from alphabetical to insertion (like ``dict``).
pt_br: A ordem dos atributos no repr mudou de alfabética para inserção (como no ``dict``).

source: Added support for an optional positional argument.
pt_br: Adicionado suporte para um argumento posicional opcional.

source: Route attribute access on a class to __getattr__.
pt_br: Roteia o acesso ao atributo em uma classe para __getattr__.

source: This is a descriptor, used to define attributes that act differently when accessed through an instance and through a class. Instance access remains normal, but access to an attribute through a class will be routed to the class's __getattr__ method; this is done by raising AttributeError.
pt_br: Este é um descritor, usado para definir atributos que atuam de forma diferente quando acessados por meio de uma instância e por meio de uma classe. O acesso à instância permanece normal, mas o acesso a um atributo por meio de uma classe será roteado para o método __getattr__ da classe; isso é feito levantando AttributeError.

source: This allows one to have properties active on an instance, and have virtual attributes on the class with the same name (see :class:`enum.Enum` for an example).
pt_br: Isso permite ter propriedades ativas em uma instância, e ter atributos virtuais na classe com o mesmo nome (veja :class:`enum.Enum` para um exemplo).

source: Coroutine Utility Functions
pt_br: Funções de utilidade de corrotina
