Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. Usage::
pt_br: Como introduzido na :pep:`526`, uma variável cuja anotação de tipo tem um invólucro ClassVar indica que um dado atributo deve ser usado como uma variável de classe, e que ele não deve ser definido em instâncias dessa classe. Modo de usar::

source: class Starship: stats: ClassVar[dict[str, int]] = {} # class variable damage: int = 10 # instance variable
pt_br: class Starship: stats: ClassVar[dict[str, int]] = {} # variável de classe damage: int = 10 # variável de instância

source: :data:`ClassVar` accepts only types and cannot be further subscribed.
pt_br: :data:`ClassVar` aceita apenas tipos e não pode ser subscrita posteriormente.

source: :data:`ClassVar` is not a class itself, and should not be used with :func:`isinstance` or :func:`issubclass`. :data:`ClassVar` does not change Python runtime behavior, but it can be used by third-party type checkers. For example, a type checker might flag the following code as an error::
pt_br: :data:`ClassVar` não é uma classe, e não deve ser usada com :func:`isinstance` ou :func:`issubclass`. :data:`ClassVar` não muda com o comportamento do Python em tempo de execução, mas pode ser usada por verificadores de tipos de terceiros. Por exemplo, um verificador de tipos pode sinalizar que o seguinte código é errado::

source: enterprise_d = Starship(3000) enterprise_d.stats = {} # Error, setting class variable on instance Starship.stats = {} # This is OK
pt_br: enterprise_d = Starship(3000) enterprise_d.stats = {} # Erro: atribuindo valor a variável de classe de uma instância Starship.stats = {} # Isso é OK

source: :data:`ClassVar` can now be nested in :data:`Final` and vice versa.
pt_br: :data:`ClassVar` agora pode ser aninhada em :data:`Final` e vice-versa.

source: Special typing construct to indicate final names to type checkers.
pt_br: Uma construção especial de tipagem para indicar nomes finais a verificadores de tipos

source: Final names cannot be reassigned in any scope. Final names declared in class scopes cannot be overridden in subclasses.
pt_br: Nomes finais não podem ser reatribuídos em qualquer escopo. Nomes finais declarados em escopos de classe não podem ser substituídos em subclasses.

source: MAX_SIZE: Final = 9000 MAX_SIZE += 1 # Error reported by type checker class Connection: TIMEOUT: Final[int] = 10 class FastConnector(Connection): TIMEOUT = 1 # Error reported by type checker
pt_br: MAX_SIZE: Final = 9000 MAX_SIZE += 1 # Erro reportado pelo verificador de tipos class Connection: TIMEOUT: Final[int] = 10 class FastConnector(Connection): TIMEOUT = 1 # Error reportado pelo verificador de tipos

source: There is no runtime checking of these properties. See :pep:`591` for more details.
pt_br: Não há verificação em tempo de execução dessas propriedades. Veja :pep:`591` para mais detalhes.

source: :data:`Final` can now be nested in :data:`ClassVar` and vice versa.
pt_br: :data:`Final` agora pode ser aninhada em :data:`ClassVar` e vice-versa.

source: Special typing construct to mark a :class:`TypedDict` key as required.
pt_br: Uma construção especial de tipagem para marcar uma chave de :class:`TypedDict` como necessária.

source: This is mainly useful for ``total=False`` TypedDicts. See :class:`TypedDict` and :pep:`655` for more details.
pt_br: Isso é útil principalmente para TypedDicts com ``total=False``. Veja :class:`TypedDict` e :pep:`655` para obter mais detalhes.

source: Special typing construct to mark a :class:`TypedDict` key as potentially missing.
pt_br: Uma construção especial de tipagem para marcar uma chave de :class:`TypedDict` como potencialmente ausente.

source: See :class:`TypedDict` and :pep:`655` for more details.
pt_br: Veja :class:`TypedDict` e :pep:`655` para obter mais detalhes.

source: A special typing construct to mark an item of a :class:`TypedDict` as read-only.
pt_br: Uma construção especial de tipagem para marcar um item de um :class:`TypedDict` como somente leitura.

source: class Movie(TypedDict): title: ReadOnly[str] year: int def mutate_movie(m: Movie) -> None: m["year"] = 1999 # allowed m["title"] = "The Matrix" # typechecker error
pt_br: class Movie(TypedDict): title: ReadOnly[str] year: int def mutate_movie(m: Movie) -> None: m["year"] = 1999 # permitido m["title"] = "The Matrix" # erro no verificador de tipos

source: There is no runtime checking for this property.
pt_br: Não há verificação em tempo de execução para esta propriedade.

source: See :class:`TypedDict` and :pep:`705` for more details.
pt_br: Consulte :class:`TypedDict` e :pep:`705` para obter mais detalhes.

source: Special typing form to add context-specific metadata to an annotation.
pt_br: Forma especial de tipagem para adicionar metadados específicos de contexto para uma anotação.

source: Add metadata ``x`` to a given type ``T`` by using the annotation ``Annotated[T, x]``. Metadata added using ``Annotated`` can be used by static analysis tools or at runtime. At runtime, the metadata is stored in a :attr:`!__metadata__` attribute.
pt_br: Adiciona metadados ``x`` a um determinado tipo ``T`` usando a anotação ``Annotated[T, x]``. Os metadados adicionados usando ``Annotated`` podem ser usados por ferramentas de análise estática ou em tempo de execução. Em tempo de execução, os metadados são armazenados em um atributo :attr:`!__metadata__`.

source: If a library or tool encounters an annotation ``Annotated[T, x]`` and has no special logic for the metadata, it should ignore the metadata and simply treat the annotation as ``T``. As such, ``Annotated`` can be useful for code that wants to use annotations for purposes outside Python's static typing system.
pt_br: Se uma biblioteca ou ferramenta encontrar uma anotação ``Annotated[T, x]`` e ela não tiver lógica especial para os metadados, ela deverá ignorar os metadados e simplesmente tratar a anotação como ``T``. Dessa forma, ``Annotated`` pode ser útil em códigos que desejarem usar a anotação para propósitos fora do sistema de tipagem estática do Python.

source: Using ``Annotated[T, x]`` as an annotation still allows for static typechecking of ``T``, as type checkers will simply ignore the metadata ``x``. In this way, ``Annotated`` differs from the :func:`@no_type_check <no_type_check>` decorator, which can also be used for adding annotations outside the scope of the typing system, but completely disables typechecking for a function or class.
pt_br: Usar ``Annotated[T, x]`` como um anotação ainda permite a verificação estática do tipo de ``T``, pois os verificadores de tipo simplesmente ignoram os metadados em ``x``. Dessa forma, o ``Annotated`` difere do decorador :func:`@no_type_check <no_type_check>`, que também pode ser usado para adicionar anotações fora do escopo do sistema de tipagem, mas desativa completamente a verificação de tipos para uma função ou classe.

source: The responsibility of how to interpret the metadata lies with the tool or library encountering an ``Annotated`` annotation. A tool or library encountering an ``Annotated`` type can scan through the metadata elements to determine if they are of interest (e.g., using :func:`isinstance`).
pt_br: A responsabilidade de como interpretar os metadados é da ferramenta ou da biblioteca que encontrar uma anotação ``Annotated``. Uma ferramenta ou biblioteca que encontrar um tipo ``Annotated`` poderá examinar os elementos de metadados para determinar se eles são de interesse (por exemplo, usando :func:`isinstance`).

source: Here is an example of how you might use ``Annotated`` to add metadata to type annotations if you were doing range analysis:
pt_br: Aqui está um exemplo de como você pode usar ``Annotated`` para adicionar metadados a anotações de tipos se estiver fazendo uma análise de intervalos:

source: The first argument to ``Annotated`` must be a valid type. Multiple metadata elements can be supplied as ``Annotated`` supports variadic arguments. The order of the metadata elements is preserved and matters for equality checks::
pt_br: O primeiro argumento para ``Annotated`` deve ser um tipo válido. Vários elementos de metadados podem ser fornecidos, pois ``Annotated`` suporta argumentos variádicos. A ordem dos elementos de metadados é preservada e importa para verificações de igualdade::

source: @dataclass class ctype: kind: str a1 = Annotated[int, ValueRange(3, 10), ctype("char")] a2 = Annotated[int, ctype("char"), ValueRange(3, 10)] assert a1 != a2 # Order matters
pt_br: @dataclass class ctype: kind: str a1 = Annotated[int, ValueRange(3, 10), ctype("char")] a2 = Annotated[int, ctype("char"), ValueRange(3, 10)] assert a1 != a2 # a ordem importa

source: It is up to the tool consuming the annotations to decide whether the client is allowed to add multiple metadata elements to one annotation and how to merge those annotations.
pt_br: Cabe à ferramenta que consome as anotações decidir se o cliente tem permissão de adicionar vários elementos de metadados a uma anotação e como mesclar essas anotações.

source: Nested ``Annotated`` types are flattened. The order of the metadata elements starts with the innermost annotation::
pt_br: Os tipos ``Annotated`` aninhados são achatados. A ordem dos elementos de metadados começa com a anotação mais interna::

source: However, this does not apply to ``Annotated`` types referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
pt_br: Entretanto, isso não se aplica a tipos ``Annotated`` referenciadas por meio de um apelido de tipo, para evitar forçar a avaliação da :class:`TypeAliasType` subjacente::

source: Duplicated metadata elements are not removed::
pt_br: Elementos duplicados de metadata não são removidos::

source: ``Annotated`` can be used with nested and generic aliases:
pt_br: ``Annotated`` pode ser usado com apelidos aninhados e apelidos genéricos:

source: @dataclass class MaxLen: value: int type Vec[T] = Annotated[list[tuple[T, T]], MaxLen(10)] # When used in a type annotation, a type checker will treat "V" the same as # ``Annotated[list[tuple[int, int]], MaxLen(10)]``: type V = Vec[int]
pt_br: @dataclass class MaxLen: value: int type Vec[T] = Annotated[list[tuple[T, T]], MaxLen(10)] # Quando usado em uma anotação de tipo, um verificador de tipos tratará "V" da mesma forma que # ``Annotated[list[tuple[int, int]], MaxLen(10)]``: type V = Vec[int]

source: ``Annotated`` cannot be used with an unpacked :class:`TypeVarTuple`::
pt_br: ``Annotated`` não pode ser usado com um :class:`TypeVarTuple` desempacotado::

source: type Variadic[*Ts] = Annotated[*Ts, Ann1] = Annotated[T1, T2, T3, ..., Ann1] # NOT valid
pt_br: type Variadic[*Ts] = Annotated[*Ts, Ann1] = Annotated[T1, T2, T3, ..., Ann1] # NÃO válido

source: where ``T1``, ``T2``, ... are :class:`TypeVars <TypeVar>`. This is invalid as only one type should be passed to Annotated.
pt_br: onde ``T1``, ``T2``, ... são :class:`TypeVars <TypeVar>`. Isso é inválido, pois somente um tipo deve ser passado para Annotated.

source: By default, :func:`get_type_hints` strips the metadata from annotations. Pass ``include_extras=True`` to have the metadata preserved:
pt_br: Por padrão, :func:`get_type_hints` retira os metadados de anotações. Passe ``include_extras=True`` para preservar os metadados:

source: At runtime, the metadata associated with an ``Annotated`` type can be retrieved via the :attr:`!__metadata__` attribute:
pt_br: Em tempo de execução, os metadados associados a um tipo ``Annotated`` podem ser recuperados por meio do atributo :attr:`!__metadata__`:

source: If you want to retrieve the original type wrapped by ``Annotated``, use the :attr:`!__origin__` attribute:
pt_br: Se você quiser recuperar o tipo original envolvido por ``Annotated``, use o atributo :attr:`!__origin__`:

source: Note that using :func:`get_origin` will return ``Annotated`` itself:
pt_br: Note que usar :func:`get_origin` retornará o próprio ``Annotated``:

source: :pep:`593` - Flexible function and variable annotations
pt_br: :pep:`593` - Anotações flexíveis para funções e variáveis

source: The PEP introducing ``Annotated`` to the standard library.
pt_br: A PEP que introduz ``Annotated`` à biblioteca padrão.

source: Special typing construct for marking user-defined type predicate functions.
pt_br: Uma construção especial de tipagem para marcar funções de predicado de tipo definidas pelo usuário.

source: ``TypeIs`` can be used to annotate the return type of a user-defined type predicate function. ``TypeIs`` only accepts a single type argument. At runtime, functions marked this way should return a boolean and take at least one positional argument.
pt_br: ``TypeIs`` pode ser usado para anotar o tipo de retorno de uma função de predicado de tipo definida pelo usuário. ``TypeIs`` aceita apenas um único argumento de tipo. Em tempo de execução, funções marcadas dessa forma devem retornar um booleano e receber, no mínimo, um argumento posicional.

source: ``TypeIs`` aims to benefit *type narrowing* -- a technique used by static type checkers to determine a more precise type of an expression within a program's code flow. Usually type narrowing is done by analyzing conditional code flow and applying the narrowing to a block of code. The conditional expression here is sometimes referred to as a "type predicate"::
pt_br: ``TypeIs`` visa beneficiar *estreitamento de tipo* -- uma técnica usada por verificador de tipo estático para determinar um tipo mais preciso de expressão dentro do fluxo de código de um programa. Normalmente, o estreitamento de tipo é feito por meio da análise do fluxo de código condicional e da aplicação do estreitamento a um bloquear código. A condicional expressão aqui é às vezes chamada de "predicado de tipo"::

source: def is_str(val: str | float): # "isinstance" type predicate if isinstance(val, str): # Type of ``val`` is narrowed to ``str`` ... else: # Else, type of ``val`` is narrowed to ``float``. ...
pt_br: def is_str(val: str | float): # predicado de tipos "isinstance" if isinstance(val, str): # Tipo de ``val`` é restrito a ``str`` ... else: # Senão, tipo de ``val`` é restrito a ``float``. ...

source: Sometimes it would be convenient to use a user-defined boolean function as a type predicate. Such a function should use ``TypeIs[...]`` or :data:`TypeGuard` as its return type to alert static type checkers to this intention. ``TypeIs`` usually has more intuitive behavior than ``TypeGuard``, but it cannot be used when the input and output types are incompatible (e.g., ``list[object]`` to ``list[int]``) or when the function does not return ``True`` for all instances of the narrowed type.
pt_br: Às vezes, seria conveniente usar uma função booleana definida pelo usuário como um predicado de tipo. Essa função deveria usar ``TypeIs[...]`` ou :data:`TypeGuard` como seu tipo de retorno para alertar o verificador de tipo estático sobre essa intenção. ``TypeIs`` geralmente tem um comportamento mais intuitivo do que ``TypeGuard``, mas não pode ser usado quando os tipos de entrada e saída são incompatíveis (por exemplo, de ``list[object]`` para ``list[int]``) ou quando a função não retorna ``True`` para todas as instâncias do tipo restrito.

source: Using ``-> TypeIs[NarrowedType]`` tells the static type checker that for a given function:
pt_br: Usar ``-> TypeIs[NarrowedType]`` informa ao verificador de tipo estático que, para uma determinada função:

source: The return value is a boolean.
pt_br: O valor de retorno é um booleano.

source: If the return value is ``True``, the type of its argument is the intersection of the argument's original type and ``NarrowedType``.
pt_br: Se o valor de retorno for ``True``, o tipo de seu argumento será a interseção entre o tipo original do argumento e o ``NarrowedType``.

source: If the return value is ``False``, the type of its argument is narrowed to exclude ``NarrowedType``.
pt_br: Se o valor de retorno for ``False``, o tipo de seu argumento será restrito para excluir ``NarrowedType``.

source: from typing import assert_type, final, TypeIs class Parent: pass class Child(Parent): pass @final class Unrelated: pass def is_parent(val: object) -> TypeIs[Parent]: return isinstance(val, Parent) def run(arg: Child | Unrelated): if is_parent(arg): # Type of ``arg`` is narrowed to the intersection # of ``Parent`` and ``Child``, which is equivalent to # ``Child``. assert_type(arg, Child) else: # Type of ``arg`` is narrowed to exclude ``Parent``, # so only ``Unrelated`` is left. assert_type(arg, Unrelated)
pt_br: from typing import assert_type, final, TypeIs class Parent: pass class Child(Parent): pass @final class Unrelated: pass def is_parent(val: object) -> TypeIs[Parent]: return isinstance(val, Parent) def run(arg: Child | Unrelated): if is_parent(arg): # Tipo de ``arg`` é restrito à interseção # de ``Parent`` e ``Child``, o que equivale a # ``Child``. assert_type(arg, Child) else: # Tipo de ``arg`` é restrito para excluir ``Parent``, # então sobrou o tipo ``Unrelated``. assert_type(arg, Unrelated)

source: The type inside ``TypeIs`` must be consistent with the type of the function's argument; if it is not, static type checkers will raise an error. An incorrectly written ``TypeIs`` function can lead to unsound behavior in the type system; it is the user's responsibility to write such functions in a type-safe manner.
pt_br: O tipo dentro de ``TypeIs`` deve ser consistente com o tipo do argumento da função; caso contrário, o verificador de tipo estático levantará um erro. Uma função ``TypeIs`` escrita incorretamente pode ocasionar um comportamento insensato pelo sistema de tipos; é de responsabilidade do usuário escrever tais funções de forma segura para tipos.

source: If a ``TypeIs`` function is a class or instance method, then the type in ``TypeIs`` maps to the type of the second parameter (after ``cls`` or ``self``).
pt_br: Se uma função ``TypeIs`` for um método de classe ou instância, então o tipo em ``TypeIs`` mapeia para o tipo do segundo parâmetro (depois de ``cls`` ou ``self``).

source: In short, the form ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...``, means that if ``foo(arg)`` returns ``True``, then ``arg`` is an instance of ``TypeB``, and if it returns ``False``, it is not an instance of ``TypeB``.
pt_br: Em resumo, a forma ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...``, significa que se ``foo(arg)`` retorna ``True``, então ``arg`` é um instância de ``TypeB``, e se retorna ``False``, não é um instância de ``TypeB``.

source: ``TypeIs`` also works with type variables. For more information, see :pep:`742` (Narrowing types with ``TypeIs``).
pt_br: ``TypeIs`` também funciona com variáveis de tipo. Para mais informações, consulte a :pep:`742` (Restringindo tipos com ``TypeIs``).

source: Type predicate functions are user-defined functions that return whether their argument is an instance of a particular type. ``TypeGuard`` works similarly to :data:`TypeIs`, but has subtly different effects on type checking behavior (see below).
pt_br: Funções de predicados de tipo são funções definidas pelo usuário que retornam se seu argumento é uma instância de um tipo específico. O ``TypeGuard`` funciona como :data:`TypeIs`, mas tem efeitos sutilmente diferentes sobre o comportamento da verificação de tipos (veja abaixo).

source: Using ``-> TypeGuard`` tells the static type checker that for a given function:
pt_br: Usar ``-> TypeGuard`` informa ao verificador de tipo estático que, para uma determinada função:

source: If the return value is ``True``, the type of its argument is the type inside ``TypeGuard``.
pt_br: Se o valor de retorno for ``True``, o tipo de seu argumento é o tipo dentro de ``TypeGuard``.

source: ``TypeGuard`` also works with type variables. See :pep:`647` for more details.
pt_br: ``TypeGuard`` também funciona com tipos variáveis. Consulte a :pep:`647` para obter mais detalhes.

source: def is_str_list(val: list[object]) -> TypeGuard[list[str]]: '''Determines whether all objects in the list are strings''' return all(isinstance(x, str) for x in val) def func1(val: list[object]): if is_str_list(val): # Type of ``val`` is narrowed to ``list[str]``. print(" ".join(val)) else: # Type of ``val`` remains as ``list[object]``. print("Not a list of strings!")
pt_br: def is_str_list(val: list[object]) -> TypeGuard[list[str]]: '''Determina se todos os objetos na lista são strings''' return all(isinstance(x, str) for x in val) def func1(val: list[object]): if is_str_list(val): # Tipo de ``val`` é restrito a ``list[str]``. print(" ".join(val)) else: # Tipo de ``val`` continua sendo ``list[object]``. print("Not a list of strings!")

source: ``TypeIs`` and ``TypeGuard`` differ in the following ways:
pt_br: ``TypeIs`` e ``TypeGuard`` diferem das seguintes maneiras:

source: ``TypeIs`` requires the narrowed type to be a subtype of the input type, while ``TypeGuard`` does not. The main reason is to allow for things like narrowing ``list[object]`` to ``list[str]`` even though the latter is not a subtype of the former, since ``list`` is invariant.
pt_br: ``TypeIs`` exige que o tipo restrito seja um subtipo do tipo de entrada, enquanto o ``TypeGuard``, não. O motivo principal é permitir coisas como restringir ``list[object]`` a ``list[str]``, embora este não seja um subtipo daquele, já que ``list`` é invariante.

source: When a ``TypeGuard`` function returns ``True``, type checkers narrow the type of the variable to exactly the ``TypeGuard`` type. When a ``TypeIs`` function returns ``True``, type checkers can infer a more precise type combining the previously known type of the variable with the ``TypeIs`` type. (Technically, this is known as an intersection type.)
pt_br: Quando uma função ``TypeGuard`` retorna ``True``, os verificadores de tipo restringem o tipo da variável exatamente ao tipo ``TypeGuard``. Quando uma função ``TypeIs`` retorna ``True``, os verificadores de tipo podem inferir um tipo mais preciso combinando o tipo previamente conhecido da variável com o tipo ``TypeIs``. (Tecnicamente, isso é conhecido como um tipo de interseção).

source: When a ``TypeGuard`` function returns ``False``, type checkers cannot narrow the type of the variable at all. When a ``TypeIs`` function returns ``False``, type checkers can narrow the type of the variable to exclude the ``TypeIs`` type.
pt_br: Quando uma função ``TypeGuard`` retorna ``False``, os verificadores de tipo não podem restringir o tipo da variável. Quando uma função ``TypeIs`` retorna ``False``, os verificadores de tipo podem restringir o tipo da variável para excluir o tipo ``TypeIs``.

source: Typing operator to conceptually mark an object as having been unpacked.
pt_br: Operador de tipagem para marcar conceitualmente um objeto como tendo sido desempacotado.

source: For example, using the unpack operator ``*`` on a :ref:`type variable tuple <typevartuple>` is equivalent to using ``Unpack`` to mark the type variable tuple as having been unpacked::
pt_br: Por exemplo, usar o operador de desempacotamento ``*`` em uma :ref:`tupla de tipos variáveis <typevartuple>` equivale a usar o ``Unpack`` para marcar a tupla de tipos variáveis como tendo sido desempacotada::

source: Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Effectively does: tup: tuple[Unpack[Ts]]
pt_br: Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Efetivamente faz: tup: tuple[Unpack[Ts]]
