Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: A :ref:`constrained type variable <typing-constrained-typevar>`.
pt_br: Uma :ref:`tipo variável restrito <typing-constrained-typevar>`.

source: Definition::
pt_br: Definição::

source: ``AnyStr`` is meant to be used for functions that may accept :class:`str` or :class:`bytes` arguments but cannot allow the two to mix.
pt_br: ``AnyStr`` deve ser usado para funções que podem aceitar argumentos :class:`str` ou :class:`bytes` mas não podem permitir que os dois se misturem.

source: For example::
pt_br: Por exemplo::

source: def concat(a: AnyStr, b: AnyStr) -> AnyStr: return a + b concat("foo", "bar") # OK, output has type 'str' concat(b"foo", b"bar") # OK, output has type 'bytes' concat("foo", b"bar") # Error, cannot mix str and bytes
pt_br: def concat(a: AnyStr, b: AnyStr) -> AnyStr: return a + b concat("foo", "bar") # OK: saída tem tipo 'str' concat(b"foo", b"bar") # OK: saída tem tipo 'bytes' concat("foo", b"bar") # Erro: não se mistura str com bytes

source: Note that, despite its name, ``AnyStr`` has nothing to do with the :class:`Any` type, nor does it mean "any string". In particular, ``AnyStr`` and ``str | bytes`` are different from each other and have different use cases::
pt_br: Note que, apesar do nome, ``AnyStr`` não tem nada a ver com o tipo :class:`Any`, nem significa "qualquer string". Em particular, ``AnyStr`` e ``str | bytes`` são diferentes entre si e têm casos de uso diferentes::

source: # Invalid use of AnyStr: # The type variable is used only once in the function signature, # so cannot be "solved" by the type checker def greet_bad(cond: bool) -> AnyStr: return "hi there!" if cond else b"greetings!" # The better way of annotating this function: def greet_proper(cond: bool) -> str | bytes: return "hi there!" if cond else b"greetings!"
pt_br: # Uso inválido de AnyStr: # A variável de tipo é usada somente uma vez na assinatura da função, # então não pode ser "resolvida" pelo verificador de tipo def greet_bad(cond: bool) -> AnyStr: return "hi there!" if cond else b"greetings!" # O jeito melhor de anotar esta função def greet_proper(cond: bool) -> str | bytes: return "hi there!" if cond else b"greetings!"

source: Deprecated in favor of the new :ref:`type parameter syntax <type-params>`. Use ``class A[T: (str, bytes)]: ...`` instead of importing ``AnyStr``. See :pep:`695` for more details.
pt_br: Descontinuado em favor da nova :ref:`sintaxe de parâmetro de tipo <type-params>`. Use ``class A[T: (str, bytes)]: ...`` em vez de importar ``AnyStr``. Veja a :pep:`695` para mais detalhes.

source: In Python 3.16, ``AnyStr`` will be removed from ``typing.__all__``, and deprecation warnings will be emitted at runtime when it is accessed or imported from ``typing``. ``AnyStr`` will be removed from ``typing`` in Python 3.18.
pt_br: No Python 3.16, ``AnyStr`` será removido de ``typing.__all__``, e avisos de descontinuação serão emitidos em tempo de execução quando ele for acessado ou importado de ``typing``. ``AnyStr`` será removido do ``typing`` no Python 3.18.

source: Special type that includes only literal strings.
pt_br: Tipo especial que inclui apenas strings literais.

source: Any string literal is compatible with ``LiteralString``, as is another ``LiteralString``. However, an object typed as just ``str`` is not. A string created by composing ``LiteralString``-typed objects is also acceptable as a ``LiteralString``.
pt_br: Qualquer literal de string é compatível com ``LiteralString``, assim como outro ``LiteralString``. Entretanto, um objeto digitado apenas ``str`` não é. Uma string criada pela composição de objetos do tipo ``LiteralString`` também é aceitável como uma ``LiteralString``.

source: Example:
pt_br: Exemplo:

source: def run_query(sql: LiteralString) -> None: ... def caller(arbitrary_string: str, literal_string: LiteralString) -> None: run_query("SELECT * FROM students") # OK run_query(literal_string) # OK run_query("SELECT * FROM " + literal_string) # OK run_query(arbitrary_string) # type checker error run_query( # type checker error f"SELECT * FROM students WHERE name = {arbitrary_string}" )
pt_br: def run_query(sql: LiteralString) -> None: ... def caller(arbitrary_string: str, literal_string: LiteralString) -> None: run_query("SELECT * FROM students") # OK run_query(literal_string) # OK run_query("SELECT * FROM " + literal_string) # OK run_query(arbitrary_string) # erro no verificador run_query( # erro no verificador f"SELECT * FROM students WHERE name = {arbitrary_string}" )

source: ``LiteralString`` is useful for sensitive APIs where arbitrary user-generated strings could generate problems. For example, the two cases above that generate type checker errors could be vulnerable to an SQL injection attack.
pt_br: ``LiteralString`` é útil para APIs sensíveis onde strings arbitrárias geradas pelo usuário podem gerar problemas. Por exemplo, os dois casos acima que geram erros no verificador de tipo podem ser vulneráveis a um ataque de injeção de SQL.

source: See :pep:`675` for more details.
pt_br: Veja :pep:`675` para mais detalhes.

source: :data:`!Never` and :data:`!NoReturn` represent the `bottom type <https://en.wikipedia.org/wiki/Bottom_type>`_, a type that has no members.
pt_br: :data:`!Never` e :data:`!NoReturn` representam o `tipo inferior <https://en.wikipedia.org/wiki/Bottom_type>`_, um tipo que não possui membros.

source: They can be used to indicate that a function never returns, such as :func:`sys.exit`::
pt_br: Eles podem ser usados para indicar que uma função nunca retorna, como :func:`sys.exit`::

source: from typing import Never # or NoReturn def stop() -> Never: raise RuntimeError('no way')
pt_br: from typing import Never # ou NoReturn def stop() -> Never: raise RuntimeError('no way')

source: Or to define a function that should never be called, as there are no valid arguments, such as :func:`assert_never`::
pt_br: Ou para definir uma função que nunca deve ser chamada, pois não existem argumentos válidos, como :func:`assert_never`::

source: from typing import Never # or NoReturn def never_call_me(arg: Never) -> None: pass def int_or_str(arg: int | str) -> None: never_call_me(arg) # type checker error match arg: case int(): print("It's an int") case str(): print("It's a str") case _: never_call_me(arg) # OK, arg is of type Never (or NoReturn)
pt_br: from typing import Never # or NoReturn def never_call_me(arg: Never) -> None: pass def int_or_str(arg: int | str) -> None: never_call_me(arg) # erro no verificador match arg: case int(): print("It's an int") case str(): print("It's a str") case _: never_call_me(arg) # OK, arg é do tipo Never (ou NoReturn)

source: :data:`!Never` and :data:`!NoReturn` have the same meaning in the type system and static type checkers treat both equivalently.
pt_br: :data:`!Never` e :data:`!NoReturn` têm o mesmo significado no sistema de tipos e os verificadores de tipo estático tratam ambos de forma equivalente.

source: Added :data:`NoReturn`.
pt_br: Adicionado :data:`NoReturn`.

source: Added :data:`Never`.
pt_br: Adicionado :data:`Never`.

source: Special type to represent the current enclosed class.
pt_br: Tipo especial para representar a classe atual inclusa.

source: from typing import Self, reveal_type class Foo: def return_self(self) -> Self: ... return self class SubclassOfFoo(Foo): pass reveal_type(Foo().return_self()) # Revealed type is "Foo" reveal_type(SubclassOfFoo().return_self()) # Revealed type is "SubclassOfFoo"
pt_br: from typing import Self, reveal_type class Foo: def return_self(self) -> Self: ... return self class SubclassOfFoo(Foo): pass reveal_type(Foo().return_self()) # Tipo revelado é "Foo" reveal_type(SubclassOfFoo().return_self()) # Tipo revelado é "SubclassOfFoo"

source: This annotation is semantically equivalent to the following, albeit in a more succinct fashion::
pt_br: Esta anotação é semanticamente equivalente à seguinte, embora de forma mais sucinta::

source: In general, if something returns ``self``, as in the above examples, you should use ``Self`` as the return annotation. If ``Foo.return_self`` was annotated as returning ``"Foo"``, then the type checker would infer the object returned from ``SubclassOfFoo.return_self`` as being of type ``Foo`` rather than ``SubclassOfFoo``.
pt_br: Em geral, se algo retorna ``self``, como nos exemplos acima, você deve usar ``Self`` como anotação de retorno. Se ``Foo.return_self`` foi anotado como retornando ``"Foo"``, então o verificador de tipo inferiria o objeto retornado de ``SubclassOfFoo.return_self`` como sendo do tipo ``Foo`` em vez de ``SubclassOfFoo``.

source: Other common use cases include:
pt_br: Outros casos de uso comuns incluem:

source: :class:`classmethod`\s that are used as alternative constructors and return instances of the ``cls`` parameter.
pt_br: :class:`classmethod`\s que são usados como construtores alternativos e retornam instâncias do parâmetro ``cls``.

source: Annotating an :meth:`~object.__enter__` method which returns self.
pt_br: Anotando um método :meth:`~object.__enter__` que retorna self.

source: You should not use ``Self`` as the return annotation if the method is not guaranteed to return an instance of a subclass when the class is subclassed::
pt_br: Você não deveria usar ``Self`` como a anotação de retorno se não for garantido que o método retorne uma instância de uma subclasse quando a classe for subclassificada::

source: class Eggs: # Self would be an incorrect return annotation here, # as the object returned is always an instance of Eggs, # even in subclasses def returns_eggs(self) -> "Eggs": return Eggs()
pt_br: class Eggs: # Self seria uma anotação de retorno incorreta aqui, # já que o objeto retornado sempre é instância de Eggs, # inclusive em subclasses def returns_eggs(self) -> "Eggs": return Eggs()

source: See :pep:`673` for more details.
pt_br: Veja :pep:`673` para mais detalhes.

source: Special annotation for explicitly declaring a :ref:`type alias <type-aliases>`.
pt_br: Anotações especiais para declarar explicitamente um :ref:`apelido de tipo <type-aliases>`.

source: ``TypeAlias`` is particularly useful on older Python versions for annotating aliases that make use of forward references, as it can be hard for type checkers to distinguish these from normal variable assignments:
pt_br: ``TypeAlias`` é particularmente útil em versões mais antigas do Python para anotar apelidos que fazem uso de referências futuras, pois pode ser difícil para os verificadores de tipo distingui-los das atribuições normais de variáveis:

source: from typing import Generic, TypeAlias, TypeVar T = TypeVar("T") # "Box" does not exist yet, # so we have to use quotes for the forward reference on Python <3.12. # Using ``TypeAlias`` tells the type checker that this is a type alias declaration, # not a variable assignment to a string. BoxOfStrings: TypeAlias = "Box[str]" class Box(Generic[T]): @classmethod def make_box_of_strings(cls) -> BoxOfStrings: ...
pt_br: from typing import Generic, TypeAlias, TypeVar T = TypeVar("T") # "Box" não existe ainda, # então temos que usar aspas para a referência futura em Python <3.12. # Usar ``TypeAlias`` diz ao verificador de tipo que isso é uma declaração de apelido de tipo, # e não uma atribuição de variável a string. BoxOfStrings: TypeAlias = "Box[str]" class Box(Generic[T]): @classmethod def make_box_of_strings(cls) -> BoxOfStrings: ...

source: See :pep:`613` for more details.
pt_br: Veja :pep:`613` para mais detalhes.

source: :data:`TypeAlias` is deprecated in favor of the :keyword:`type` statement, which creates instances of :class:`TypeAliasType` and which natively supports forward references. Note that while :data:`TypeAlias` and :class:`TypeAliasType` serve similar purposes and have similar names, they are distinct and the latter is not the type of the former. Removal of :data:`TypeAlias` is not currently planned, but users are encouraged to migrate to :keyword:`type` statements.
pt_br: :data:`TypeAlias` foi descontinuado em favor da instrução :keyword:`type`, que cria instâncias de :class:`TypeAliasType` e oferece suporte nativo a referências futuras. Observe que embora :data:`TypeAlias` e :class:`TypeAliasType` sirvam propósitos semelhantes e tenham nomes semelhantes, eles são distintos e o último não é o tipo do primeiro. A remoção de :data:`TypeAlias` não está planejada atualmente, mas os usuários são encorajados a migrar para instruções :keyword:`type`.

source: Special forms
pt_br: Formas especiais

source: These can be used as types in annotations. They all support subscription using ``[]``, but each has a unique syntax.
pt_br: Eles podem ser usados como tipos em anotações. Todos eles oferecem suporte a subscrição usando ``[]``, mas cada um tem uma sintaxe única.

source: Union type; ``Union[X, Y]`` is equivalent to ``X | Y`` and means either X or Y.
pt_br: Tipo de união; ``Union[X, Y]`` é equivalente a ``X | Y`` e significa X ou Y.

source: To define a union, use e.g. ``Union[int, str]`` or the shorthand ``int | str``. Using that shorthand is recommended. Details:
pt_br: Para definir uma união, use, por exemplo. ``Union[int, str]`` ou a abreviatura ``int | str``. Usar essa abreviação é recomendado. Detalhes:

source: The arguments must be types and there must be at least one.
pt_br: Os argumentos devem ser tipos e deve haver pelo menos um.

source: Unions of unions are flattened, e.g.::
pt_br: As uniões de uniões são achatadas, por exemplo::

source: However, this does not apply to unions referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
pt_br: Entretanto, isso não se aplica a uniões referenciadas por meio de um apelido de tipo, para evitar forçar a avaliação da :class:`TypeAliasType` subjacente::

source: Unions of a single argument vanish, e.g.::
pt_br: As uniões de um único argumento desaparecem, por exemplo::

source: Union[int] == int # The constructor actually returns int
pt_br: Union[int] == int # O construtor retorna um int

source: Redundant arguments are skipped, e.g.::
pt_br: Argumento redundantes são pulados, e.g.::

source: When comparing unions, the argument order is ignored, e.g.::
pt_br: Ao comparar uniões, a ordem de argumentos é ignorada. Por exemplo::

source: You cannot subclass or instantiate a ``Union``.
pt_br: Você não pode estender ou instanciar uma ``Union``

source: You cannot write ``Union[X][Y]``.
pt_br: Você não pode escrever ``Union[X][Y]``.

source: Don't remove explicit subclasses from unions at runtime.
pt_br: Não remova subclasses explícitas de uniões em tempo de execução.

source: Unions can now be written as ``X | Y``. See :ref:`union type expressions<types-union>`.
pt_br: Uniões agora podem ser escritas com ``X | Y``. Veja :ref:`expressões de união de tipos <types-union>`.

source: :class:`types.UnionType` is now an alias for :class:`Union`, and both ``Union[int, str]`` and ``int | str`` create instances of the same class. To check whether an object is a ``Union`` at runtime, use ``isinstance(obj, Union)``. For compatibility with earlier versions of Python, use ``get_origin(obj) is typing.Union or get_origin(obj) is types.UnionType``.
pt_br: :class:`types.UnionType` agora é um apelido para :class:`Union`, e tanto ``Union[int, str]`` quanto ``int | str`` criam instâncias da mesma classe. Para verificar se um objeto é um ``Union`` em tempo de execução, use ``isinstance(obj, Union)``. Para compatibilidade com versões anteriores do Python, use ``get_origin(obj) is typing.Union or get_origin(obj) is types.UnionType``.

source: ``Optional[X]`` is equivalent to ``X | None`` (or ``Union[X, None]``).
pt_br: ``Optional[X]`` equivale a ``X | None`` (ou ``Union[X, None]``).

source: Note that this is not the same concept as an optional argument, which is one that has a default. An optional argument with a default does not require the ``Optional`` qualifier on its type annotation just because it is optional. For example::
pt_br: Note que isso não é o mesmo conceito de um argumento opcional, que possui um valor por padrão. Um argumento opcional com padrão não requer o qualificador ``Optional`` em sua anotação de tipo só por ser opcional. Por exemplo::

source: On the other hand, if an explicit value of ``None`` is allowed, the use of ``Optional`` is appropriate, whether the argument is optional or not. For example::
pt_br: Por outro lado, se um valor explícito de ``None`` for permitido, o uso de ``Optional`` é apropriado, seja o argumento opcional ou não. Por exemplo::

source: Optional can now be written as ``X | None``. See :ref:`union type expressions<types-union>`.
pt_br: Optional agora pode ser escrito como ``X | None``. Veja :ref:`expressões de união de tipos<types-union>`.

source: Special form for annotating higher-order functions.
pt_br: Forma especial para anotar funções de ordem superior.

source: ``Concatenate`` can be used in conjunction with :ref:`Callable <annotating-callables>` and :class:`ParamSpec` to annotate a higher-order callable which adds, removes, or transforms parameters of another callable. Usage is in the form ``Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable]``. ``Concatenate`` is currently only valid when used as the first argument to a :ref:`Callable <annotating-callables>`. The last parameter to ``Concatenate`` must be a :class:`ParamSpec` or ellipsis (``...``).
pt_br: ``Concatenate`` pode ser usado em conjunção com :ref:`Callable <annotating-callables>` e :class:`ParamSpec` para anotar um chamável de maior ordem que adiciona, remove ou transforma parâmetros de outro chamável. Seu uso é feito na forma ``Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable]``, ``Concatenate`` atualmente só é válido quando usado como primeiro argumento de um :ref:`Callable <annotating-callables>`. O último parâmetro de ``Concatenate`` deve ser um :class:`ParamSpec` ou reticências (``...``).

source: For example, to annotate a decorator ``with_lock`` which provides a :class:`threading.Lock` to the decorated function, ``Concatenate`` can be used to indicate that ``with_lock`` expects a callable which takes in a ``Lock`` as the first argument, and returns a callable with a different type signature. In this case, the :class:`ParamSpec` indicates that the returned callable's parameter types are dependent on the parameter types of the callable being passed in::
pt_br: Por exemplo, para anotar um decorador ``with_lock`` que oferece uma instância de :class:`threading.Lock` para a função decorada, ``Concatenate`` pode ser usado para indicar que ``with_lock`` espera um chamável cujo primeiro argumento tem tipo ``Lock``, e retorna um chamável com uma assinatura de tipos diferente. Neste caso, o :class:`ParamSpec` indica que os tipos dos parâmetros do chamável retornado dependem dos tipos dos parâmetros do chamável de entrada::

source: from collections.abc import Callable from threading import Lock from typing import Concatenate # Use this lock to ensure that only one thread is executing a function # at any time. my_lock = Lock() def with_lock[**P, R](f: Callable[Concatenate[Lock, P], R]) -> Callable[P, R]: '''A type-safe decorator which provides a lock.''' def inner(*args: P.args, **kwargs: P.kwargs) -> R: # Provide the lock as the first argument. return f(my_lock, *args, **kwargs) return inner @with_lock def sum_threadsafe(lock: Lock, numbers: list[float]) -> float: '''Add a list of numbers together in a thread-safe manner.''' with lock: return sum(numbers) # We don't need to pass in the lock ourselves thanks to the decorator. sum_threadsafe([1.1, 2.2, 3.3])
pt_br: from collections.abc import Callable from threading import Lock from typing import Concatenate # Use esta trava para se certificar de que # uma única thread a executa a qualquer momento. my_lock = Lock() def with_lock[**P, R](f: Callable[Concatenate[Lock, P], R]) -> Callable[P, R]: '''Um decorador com segurança de tipos que oferece uma trava.''' def inner(*args: P.args, **kwargs: P.kwargs) -> R: # Oferece a trava como primeiro argumento. return f(my_lock, *args, **kwargs) return inner @with_lock def sum_threadsafe(lock: Lock, numbers: list[float]) -> float: '''Somatório de uma lista de números de modo seguro para threads.''' with lock: return sum(numbers) # We don't need to pass in the lock ourselves thanks to the decorator. sum_threadsafe([1.1, 2.2, 3.3])

source: :pep:`612` -- Parameter Specification Variables (the PEP which introduced ``ParamSpec`` and ``Concatenate``)
pt_br: :pep:`612` -- Variáveis de especificação de parâmetro (a PEP que introduz ``ParamSpec`` e ``Concatenate``)

source: Special typing form to define "literal types".
pt_br: Forma especial de tipagem para definir "tipos literais".

source: ``Literal`` can be used to indicate to type checkers that the annotated object has a value equivalent to one of the provided literals.
pt_br: ``Literal`` pode ser usado para indicar aos verificadores de tipo que o objeto anotado tem valor equivalente a algum dos literais oferecidos.

source: def validate_simple(data: Any) -> Literal[True]: # always returns True ... type Mode = Literal['r', 'rb', 'w', 'wb'] def open_helper(file: str, mode: Mode) -> str: ... open_helper('/some/path', 'r') # Passes type check open_helper('/other/path', 'typo') # Error in type checker
pt_br: def validate_simple(data: Any) -> Literal[True]: # sempre retorna True ... type Mode = Literal['r', 'rb', 'w', 'wb'] def open_helper(file: str, mode: Mode) -> str: ... open_helper('/some/path', 'r') # Passa verificação de tipos open_helper('/other/path', 'typo') # Erro em verificação de tipos

source: ``Literal[...]`` cannot be subclassed. At runtime, an arbitrary value is allowed as type argument to ``Literal[...]``, but type checkers may impose restrictions. See :pep:`586` for more details about literal types.
pt_br: ``Literal[...]`` não é subclasse. Em tempo de execução, permite-se um valor arbitrário como argumento de tipo para ``Literal[...]``, mas verificadores de tipo podem impor restrições. Veja :pep:`586` para mais detalhes sobre tipos literais.

source: Additional details:
pt_br: Detalhes adicionais:

source: The arguments must be literal values and there must be at least one.
pt_br: Os argumentos devem ser valores literais e deve haver pelo menos um.

source: Nested ``Literal`` types are flattened, e.g.::
pt_br: Tipos ``Literal`` aninhados são achatados, por exemplo::

source: However, this does not apply to ``Literal`` types referenced through a type alias, to avoid forcing evaluation of the underlying :class:`TypeAliasType`::
pt_br: Entretanto, isso não se aplica a tipos ``Literal`` referenciadas por meio de um apelido de tipo, para evitar forçar a avaliação da :class:`TypeAliasType` subjacente::

source: When comparing literals, the argument order is ignored, e.g.::
pt_br: Ao comparar literais, a ordem de argumentos é ignorada. Por exemplo::

source: You cannot subclass or instantiate a ``Literal``.
pt_br: Você não pode estender ou instanciar uma ``Literal``.

source: You cannot write ``Literal[X][Y]``.
pt_br: Você não pode escrever ``Literal[X][Y]``.

source: ``Literal`` now de-duplicates parameters. Equality comparisons of ``Literal`` objects are no longer order dependent. ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if one of their parameters are not :term:`hashable`.
pt_br: ``Literal`` agora remove parâmetros duplicados. Comparações de igualdade entre objetos ``Literal`` não dependem da ordem. Objetos ``Literal`` agora levantam uma exceção :exc:`TypeError` durante comparações de igualdade se um de seus parâmetros não for :term:`hasheável<hashable>`.

source: Special type construct to mark class variables.
pt_br: Uma construção especial de tipagem para marcar variáveis de classe.
