Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: In fact, ``Unpack`` can be used interchangeably with ``*`` in the context of :class:`typing.TypeVarTuple <TypeVarTuple>` and :class:`builtins.tuple <tuple>` types. You might see ``Unpack`` being used explicitly in older versions of Python, where ``*`` couldn't be used in certain places::
pt_br: Na verdade, ``Unpack`` pode ser usado de forma intercambiável com ``*`` no contexto dos tipos :class:`typing.TypeVarTuple <TypeVarTuple>` e :class:`builtins.tuple <tuple>`. Você pode ver ``Unpack`` sendo usado explicitamente em versões mais antigas do Python, onde ``*`` não podia ser usado em certos lugares::

source: # In older versions of Python, TypeVarTuple and Unpack # are located in the `typing_extensions` backports package. from typing_extensions import TypeVarTuple, Unpack Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Syntax error on Python <= 3.10! tup: tuple[Unpack[Ts]] # Semantically equivalent, and backwards-compatible
pt_br: # Em versões mais antigas do Python, TypeVarTuple e Unpack # estão localizados no pacote de backports `typing_extensions`. from typing_extensions import TypeVarTuple, Unpack Ts = TypeVarTuple('Ts') tup: tuple[*Ts] # Erro de sintaxe no Python <= 3.10! tup: tuple[Unpack[Ts]] # Semanticamente equivalente e compatível com versões anteriores

source: ``Unpack`` can also be used along with :class:`typing.TypedDict` for typing ``**kwargs`` in a function signature::
pt_br: ``Unpack`` também pode ser usado com :class:`typing.TypedDict` para a tipagem de ``**kwargs`` em uma assinatura de função::

source: from typing import TypedDict, Unpack class Movie(TypedDict): name: str year: int # This function expects two keyword arguments - `name` of type `str` # and `year` of type `int`. def foo(**kwargs: Unpack[Movie]): ...
pt_br: from typing import TypedDict, Unpack class Movie(TypedDict): name: str year: int # Esta função espera dois argumentos nomeados: `name` de tipo `str` # e `year` de tipo `int`. def foo(**kwargs: Unpack[Movie]): ...

source: See :pep:`692` for more details on using ``Unpack`` for ``**kwargs`` typing.
pt_br: Consulte :pep:`692` para obter mais detalhes sobre como usar ``Unpack`` para tipagem de ``**kwargs``.

source: Building generic types and type aliases
pt_br: Criando tipos genéricos e apelidos de tipo

source: The following classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating generic types and type aliases.
pt_br: As classes a seguir não devem ser usadas diretamente como anotações. propósito O objetivo delas é construir bloquear para criar genérico e digitar apelido.

source: These objects can be created through special syntax (:ref:`type parameter lists <type-params>` and the :keyword:`type` statement). For compatibility with Python 3.11 and earlier, they can also be created without the dedicated syntax, as documented below.
pt_br: Esses objetos podem ser criados por meio de sintaxe especial (:ref:`listas de parâmetros de tipo <type-params>` e a instrução :keyword:`type`). Para compatibilidade com Python 3.11 e versões anteriores, eles também podem ser criados sem a sintaxe dedicada, como documentado abaixo.

source: Abstract base class for generic types.
pt_br: Classe base abstrata para tipos genéricos

source: A generic type is typically declared by adding a list of type parameters after the class name::
pt_br: Normalmente, um tipo genérico é declarado adicionando-se uma lista de parâmetros de tipo após o nome da classe::

source: Such a class implicitly inherits from ``Generic``. The runtime semantics of this syntax are discussed in the :ref:`Language Reference <generic-classes>`.
pt_br: Essa classe herda implicitamente de ``Generic``. A semântica em tempo de execução dessa sintaxe é discutida na :ref:`Referência da Linguagem <generic-classes>`.

source: This class can then be used as follows::
pt_br: Esta classe pode ser utilizada como segue::

source: Here the brackets after the function name indicate a :ref:`generic function <generic-functions>`.
pt_br: Aqui os colchetes depois no nome da função indica uma :ref:`função genérica <generic-functions>`.

source: For backwards compatibility, generic classes can also be declared by explicitly inheriting from ``Generic``. In this case, the type parameters must be declared separately::
pt_br: Para manter retrocompatibilidade, as classes genéricas também podem ser declaradas herdando explicitamente de ``Generic``. Nesse caso, os parâmetros de tipo devem ser declarados separadamente::

source: Type variable.
pt_br: Tipo variável.

source: The preferred way to construct a type variable is via the dedicated syntax for :ref:`generic functions <generic-functions>`, :ref:`generic classes <generic-classes>`, and :ref:`generic type aliases <generic-type-aliases>`::
pt_br: A maneira preferida de construir um tipo variável é por meio da sintaxe dedicada para :ref:`funções genéricas <generic-functions>`, :ref:`classes genéricas <generic-classes>` e :ref:`apelidos de tipo genérico <generic-type-aliases>`::

source: class Sequence[T]: # T is a TypeVar ...
pt_br: class Sequence[T]: # T é um TypeVar ...

source: This syntax can also be used to create bounded and constrained type variables::
pt_br: Essa sintaxe também pode ser usada para criar tipos variáveis delimitados e tipos variáveis restritos::

source: class StrSequence[S: str]: # S is a TypeVar with a `str` upper bound; ... # we can say that S is "bounded by `str`" class StrOrBytesSequence[A: (str, bytes)]: # A is a TypeVar constrained to str or bytes ...
pt_br: class StrSequence[S: str]: # S é a TypeVar com como limite superior em `str`; ... # podemos dizer que S é "delimitada por `str`" class StrOrBytesSequence[A: (str, bytes)]: # A é uma TypeVar restrita a str ou bytes ...

source: However, if desired, reusable type variables can also be constructed manually, like so::
pt_br: No entanto, se desejado, tipos variáveis reutilizáveis também podem ser construídas manualmente, como:

source: T = TypeVar('T') # Can be anything S = TypeVar('S', bound=str) # Can be any subtype of str A = TypeVar('A', str, bytes) # Must be exactly str or bytes
pt_br: T = TypeVar('T') # Pode ser qualquer coisa S = TypeVar('S', bound=str) # Pode ser qualquer subtipo de str A = TypeVar('A', str, bytes) # Deve ser exatamente str ou bytes

source: Type variables exist primarily for the benefit of static type checkers. They serve as the parameters for generic types as well as for generic function and type alias definitions. See :class:`Generic` for more information on generic types. Generic functions work as follows::
pt_br: Tipos variáveis existem principalmente para o benefício de verificadores de tipo estático. Eles servem como parâmetros para tipos genéricos, bem como para definições de função genérica e apelidos de tipo. Consulte :class:`Generic` para obter mais informações sobre genérico. Funções genéricas funcionam da seguinte forma::

source: def repeat[T](x: T, n: int) -> Sequence[T]: """Return a list containing n references to x.""" return [x]*n def print_capitalized[S: str](x: S) -> S: """Print x capitalized, and return x.""" print(x.capitalize()) return x def concatenate[A: (str, bytes)](x: A, y: A) -> A: """Add two strings or bytes objects together.""" return x + y
pt_br: def repeat[T](x: T, n: int) -> Sequence[T]: """Retorna uma lista contendo n referências para x.""" return [x]*n def print_capitalized[S: str](x: S) -> S: """Exibe x capitalizado, e retorna x.""" print(x.capitalize()) return x def concatenate[A: (str, bytes)](x: A, y: A) -> A: """Concatena dois objetos string ou bytes.""" return x + y

source: Note that type variables can be *bounded*, *constrained*, or neither, but cannot be both bounded *and* constrained.
pt_br: Observe que tipos variáveis podem ser *delimitados*, *restritos*, nenhum dos dois, mas não podem ser *ambos*.

source: The variance of type variables is inferred by type checkers when they are created through the :ref:`type parameter syntax <type-params>` or when ``infer_variance=True`` is passed. Manually created type variables may be explicitly marked covariant or contravariant by passing ``covariant=True`` or ``contravariant=True``. By default, manually created type variables are invariant. See :pep:`484` and :pep:`695` for more details.
pt_br: A variância de tipos variáveis é inferida pelos verificadores de tipo quando eles são criados por meio do :ref:`sintaxe de parâmetro de tipo <type-params>` ou quando ``infer_variance=True`` é passado. Os tipos variáveis criados manualmente podem ser explicitamente marcados como covariante ou contravariantes ao passar ``covariant=True`` ou ``contravariant=True``. Por padrão, os tipos variáveis criados manualmente são invariante. Consulte :pep:`484` e :pep:`695` para obter mais detalhes.

source: Bounded type variables and constrained type variables have different semantics in several important ways. Using a *bounded* type variable means that the ``TypeVar`` will be solved using the most specific type possible::
pt_br: Tipos variáveis delimitados e tipos variáveis restritos têm semânticas diferentes de várias formas importantes. Usar um tipo variável *delimitado* significa que a ``TypeVar`` será resolvido usando o tipo mais específico possível::

source: x = print_capitalized('a string') reveal_type(x) # revealed type is str class StringSubclass(str): pass y = print_capitalized(StringSubclass('another string')) reveal_type(y) # revealed type is StringSubclass z = print_capitalized(45) # error: int is not a subtype of str
pt_br: x = print_capitalized('a string') reveal_type(x) # tipo revelado é str class StringSubclass(str): pass y = print_capitalized(StringSubclass('another string')) reveal_type(y) # tipo revelado é StringSubclass z = print_capitalized(45) # erro: int não é subtipo de str

source: The upper bound of a type variable can be a concrete type, abstract type (ABC or Protocol), or even a union of types::
pt_br: O limite superior de um tipo variável pode ser um tipo concreto, um tipo abstrato (classe base abstrata ou protocolo) ou até mesmo uma união de tipos::

source: # Can be anything with an __abs__ method def print_abs[T: SupportsAbs](arg: T) -> None: print("Absolute value:", abs(arg)) U = TypeVar('U', bound=str|bytes) # Can be any subtype of the union str|bytes V = TypeVar('V', bound=SupportsAbs) # Can be anything with an __abs__ method
pt_br: # Pode ser qualquer coisa com um método __abs__ def print_abs[T: SupportsAbs](arg: T) -> None: print("Absolute value:", abs(arg)) U = TypeVar('U', bound=str|bytes) # Pode ser qualquer subtipo com a união str | bytes V = TypeVar('V', bound=SupportsAbs) # Pode ser qualquer coisa com um método __abs__

source: Using a *constrained* type variable, however, means that the ``TypeVar`` can only ever be solved as being exactly one of the constraints given::
pt_br: Porém, usar um tipo variável *restrito* significa que a ``TypeVar`` só poderá ser resolvida como sendo exatamente uma das restrições dadas::

source: a = concatenate('one', 'two') reveal_type(a) # revealed type is str b = concatenate(StringSubclass('one'), StringSubclass('two')) reveal_type(b) # revealed type is str, despite StringSubclass being passed in c = concatenate('one', b'two') # error: type variable 'A' can be either str or bytes in a function call, but not both
pt_br: a = concatenate('one', 'two') reveal_type(a) # o tipo revelado é str b = concatenate(StringSubclass('one'), StringSubclass('two')) reveal_type(b) # o tipo revelado é str, apesar de StringSubclass ter sido passado c = concatenate('one', b'two') # erro: tipo variável 'A' pode ser str ou bytes em uma chamada de função, mas não ambos

source: At runtime, ``isinstance(x, T)`` will raise :exc:`TypeError`.
pt_br: Em tempo de execução, ``isinstance(x, T)`` levantará :exc:`TypeError`.

source: The name of the type variable.
pt_br: O nome do tipo variável.

source: Whether the type var has been explicitly marked as covariant.
pt_br: Se o tipo variável foi explicitamente marcado como covariante.

source: Whether the type var has been explicitly marked as contravariant.
pt_br: Se o tipo variável foi explicitamente marcado como contravariante.

source: Whether the type variable's variance should be inferred by type checkers.
pt_br: Se a variância de tipo variável deve ser inferida por verificadores de tipo.

source: The upper bound of the type variable, if any.
pt_br: A limite superior do tipo variável, se houver.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the bound is evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
pt_br: Para tipos variáveis criado por meio da :ref:`sintaxe de parâmetro de tipo <type-params>` , a limite é avaliado somente quando o atributo é acessado, não quando o tipo variável é criado (consulte :ref:`lazy-evaluation`).

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVar.__bound__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVar.__bound__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
pt_br: Uma :term:`função de avaliação` correspondente ao atributo :attr:`~TypeVar.__bound__`. Quando chamado diretamente, este método oferece suporte apenas ao formato :attr:`~annotationlib.Format.VALUE`, que equivale a acessar o atributo :attr:`~TypeVar.__bound__` diretamente, mas o objeto do método pode ser passado para :func:`annotationlib.call_evaluate_function` para avaliar o valor em um formato diferente.

source: A tuple containing the constraints of the type variable, if any.
pt_br: Um tupla contendo as restrições do tipo variável, se houver.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the constraints are evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
pt_br: Para tipos variáveis criado por meio da :ref:`sintaxe de parâmetro de tipo <type-params>` , a restrição é avaliada somente quando o atributo é acessado, não quando o tipo variável é criado (consulte :ref:`lazy-evaluation`).

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVar.__constraints__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVar.__constraints__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
pt_br: Uma :term:`função de avaliação` correspondente ao atributo :attr:`~TypeVar.__constraints__`. Quando chamado diretamente, este método oferece suporte apenas ao formato :attr:`~annotationlib.Format.VALUE`, que equivale a acessar o atributo :attr:`~TypeVar.__constraints__` diretamente, mas o objeto do método pode ser passado para :func:`annotationlib.call_evaluate_function` para avaliar o valor em um formato diferente.

source: The default value of the type variable, or :data:`typing.NoDefault` if it has no default.
pt_br: O padrão valor do tipo variável, ou :data:`typing.NoDefault` se ele não tiver padrão.

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVar.__default__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVar.__default__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
pt_br: Uma :term:`função de avaliação` correspondente ao atributo :attr:`~TypeVar.__default__`. Quando chamado diretamente, este método oferece suporte apenas ao formato :attr:`~annotationlib.Format.VALUE`, que equivale a acessar o atributo :attr:`~TypeVar.__default__` diretamente, mas o objeto do método pode ser passado para :func:`annotationlib.call_evaluate_function` para avaliar o valor em um formato diferente.

source: Return whether or not the type variable has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
pt_br: Retorna se o tipo variável tem ou não um valor padrão. Isso equivale a verificar se :attr:`__default__` não é o singleton :data:`typing.NoDefault`, exceto por não forçar a avaliação instantânea do valor padrão que é :ref:`avaliado preguiçosamente <lazy-evaluation>`.

source: Type variables can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`. The ``infer_variance`` parameter was added.
pt_br: Tipos variáveis agora podem ser declarados usando a :ref:`sintaxe de parâmetro de tipo <type-params>` introduzida por :pep:`695`. O parâmetro ``infer_variance`` foi adicionado.

source: Support for default values was added.
pt_br: Adiciona suporte a valores padrão.

source: Type variable tuple. A specialized form of :ref:`type variable <typevar>` that enables *variadic* generics.
pt_br: Tupla de tipo variável. Uma forma especializada de :ref:`tipo variável <typevar>` que permite genéricos *variádicos*.

source: Type variable tuples can be declared in :ref:`type parameter lists <type-params>` using a single asterisk (``*``) before the name::
pt_br: Tuplas de tipo variável podem ser declarada em :ref:`listas de parâmetros de tipo <type-params>` usando um único asterisco (``*``) antes do nome::

source: Or by explicitly invoking the ``TypeVarTuple`` constructor::
pt_br: Ou invocando o construtor ``TypeVarTuple`` explicitamente::

source: A normal type variable enables parameterization with a single type. A type variable tuple, in contrast, allows parameterization with an *arbitrary* number of types by acting like an *arbitrary* number of type variables wrapped in a tuple. For example::
pt_br: Um tipo variável normal permite a parametrização com um único tipo. Uma tupla de tipos variáveis, por outro lado, permite a parametrização com um número *arbitrário* de tipos, agindo como um número *arbitrário* de tipos variáveis envolvidos em um tupla. Por exemplo::

source: # T is bound to int, Ts is bound to () # Return value is (1,), which has type tuple[int] move_first_element_to_last(tup=(1,)) # T is bound to int, Ts is bound to (str,) # Return value is ('spam', 1), which has type tuple[str, int] move_first_element_to_last(tup=(1, 'spam')) # T is bound to int, Ts is bound to (str, float) # Return value is ('spam', 3.0, 1), which has type tuple[str, float, int] move_first_element_to_last(tup=(1, 'spam', 3.0)) # This fails to type check (and fails at runtime) # because tuple[()] is not compatible with tuple[T, *Ts] # (at least one element is required) move_first_element_to_last(tup=())
pt_br: # T é limitado a int, Ts é limitado a () # Valor retornado é (1,), que tem tipo tuple[int] move_first_element_to_last(tup=(1,)) # T é limitado a int, Ts é limitado a (str,) # Valor retornado é ('spam', 1), que tem tipo tuple[str, int] move_first_element_to_last(tup=(1, 'spam')) # T é limitado a int, Ts é limitado a (str, float) # Valor retornado é ('spam', 3.0, 1), que tem tipo tuple[str, float, int] move_first_element_to_last(tup=(1, 'spam', 3.0)) # Isso é um erro para o verificador de tipos (e falha em tempo de execução) # pois tuple[()] não é compatível com tuple[T, *Ts] # (pelo menos um elemento é necessário) move_first_element_to_last(tup=())

source: Note the use of the unpacking operator ``*`` in ``tuple[T, *Ts]``. Conceptually, you can think of ``Ts`` as a tuple of type variables ``(T1, T2, ...)``. ``tuple[T, *Ts]`` would then become ``tuple[T, *(T1, T2, ...)]``, which is equivalent to ``tuple[T, T1, T2, ...]``. (Note that in older versions of Python, you might see this written using :data:`Unpack <Unpack>` instead, as ``Unpack[Ts]``.)
pt_br: Observe o uso do operador de desempacotamento ``*`` em ``tuple[T, *Ts]``. Conceitualmente, você pode interpretar ``Ts`` como uma tupla de tipos variáveis ``(T1, T2, ...)`` . Então o tipo ``tuple[T, *Ts]`` se tornaria ``tuple[T, *(T1, T2, ...)]``, que equivale a ``tuple[T, T1, T2, ...]``. (Note que, em versões mais antigas de Python, você pode encontrar isso escrito com :data:`Unpack <Unpack>` em vez de ``Unpack[Ts]``.)

source: Type variable tuples must *always* be unpacked. This helps distinguish type variable tuples from normal type variables::
pt_br: Tuplas de tipos variáveis devem *sempre* ser desempacotadas. Isso ajuda a distinguir entre tuplas de tipos variáveis e tipos variáveis normais::

source: x: Ts # Not valid x: tuple[Ts] # Not valid x: tuple[*Ts] # The correct way to do it
pt_br: x: Ts # Inválido x: tuple[Ts] # Inválido x: tuple[*Ts] # O jeito correto

source: Type variable tuples can be used in the same contexts as normal type variables. For example, in class definitions, arguments, and return types::
pt_br: As tuplas de tipos variáveis podem ser usadas no mesmo contexto que tipos variáveis normais. Por exemplo, em argumentos, tipos de retorno e definições de classes::

source: Type variable tuples can be happily combined with normal type variables:
pt_br: As tuplas de tipos variáveis podem ser combinadas com tipos variáveis normais:

source: class Array[DType, *Shape]: # This is fine pass class Array2[*Shape, DType]: # This would also be fine pass class Height: ... class Width: ... float_array_1d: Array[float, Height] = Array() # Totally fine int_array_2d: Array[int, Height, Width] = Array() # Yup, fine too
pt_br: class Array[DType, *Shape]: # Tudo certo aqui pass class Array2[*Shape, DType]: # Tudo certo aqui também pass class Height: ... class Width: ... float_array_1d: Array[float, Height] = Array() # Totalmente certo int_array_2d: Array[int, Height, Width] = Array() # Sim, certo também

source: However, note that at most one type variable tuple may appear in a single list of type arguments or type parameters::
pt_br: No entanto, observe que no máximo uma tupla de tipos variáveis pode aparecer em uma única lista de argumentos de tipo ou parâmetros de tipo::

source: x: tuple[*Ts, *Ts] # Not valid class Array[*Shape, *Shape]: # Not valid pass
pt_br: x: tuple[*Ts, *Ts] # Inválido class Array[*Shape, *Shape]: # Inválido pass

source: Finally, an unpacked type variable tuple can be used as the type annotation of ``*args``::
pt_br: Por fim, uma tupla de tipos variáveis desempacotada pode ser usada como anotação de tipo de ``*args``::

source: In contrast to non-unpacked annotations of ``*args`` - e.g. ``*args: int``, which would specify that *all* arguments are ``int`` - ``*args: *Ts`` enables reference to the types of the *individual* arguments in ``*args``. Here, this allows us to ensure the types of the ``*args`` passed to ``call_soon`` match the types of the (positional) arguments of ``callback``.
pt_br: Ao contrário do que acontece com anotações não desempacotadas de ``*args`` - por exemplo, ``*args: int``, que especificaria que *todos* os argumentos são ``int`` -, ``*args: *Ts`` permite referenciar os tipos de cada argumento em ``*args`` *individualmente*. Isso nos permite garantir que os tipos em ``*args`` passados para ``call_soon`` correspondem aos tipos dos argumentos (posicionais) de ``callback``.

source: See :pep:`646` for more details on type variable tuples.
pt_br: Consulte a :pep:`646` para mais detalhes sobre tuplas de tipos variáveis.

source: The name of the type variable tuple.
pt_br: O nome da tupla de tipos variáveis.
