Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: :class:`collections.abc.ValuesView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.ValuesView` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Aliases to asynchronous ABCs in :mod:`collections.abc`
pt_br: Apelidos para ABCs assíncronas em :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Coroutine`.
pt_br: Apelido descontinuado de :class:`collections.abc.Coroutine`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Coroutine` and ``typing.Coroutine`` in type annotations.
pt_br: Consulte :ref:`annotating-generators-and-coroutines` para obter detalhes sobre como usar :class:`collections.abc.Coroutine` e ``typing.Coroutine`` em anotações de tipos.

source: :class:`collections.abc.Coroutine` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Coroutine` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncGenerator`.
pt_br: Apelido descontinuado de :class:`collections.abc.AsyncGenerator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.AsyncGenerator` and ``typing.AsyncGenerator`` in type annotations.
pt_br: Consulte :ref:`annotating-generators-and-coroutines` para obter detalhes sobre como usar :class:`collections.abc.AsyncGenerator` e ``typing.AsyncGenerator`` em anotações de tipos.

source: :class:`collections.abc.AsyncGenerator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.AsyncGenerator` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: The ``SendType`` parameter now has a default.
pt_br: O parâmetro ``SendType`` agora tem um valor-padrão.

source: Deprecated alias to :class:`collections.abc.AsyncIterable`.
pt_br: Apelido descontinuado de :class:`collections.abc.AsyncIterable`.

source: :class:`collections.abc.AsyncIterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.AsyncIterable` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncIterator`.
pt_br: Apelido descontinuado de :class:`collections.abc.AsyncIterator`.

source: :class:`collections.abc.AsyncIterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.AsyncIterator` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Awaitable`.
pt_br: Apelido descontinuado de :class:`collections.abc.Awaitable`.

source: :class:`collections.abc.Awaitable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Awaitable` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Aliases to other ABCs in :mod:`collections.abc`
pt_br: Apelidos para outros ABCs em :mod:`collections.abc`.

source: Deprecated alias to :class:`collections.abc.Iterable`.
pt_br: Apelido descontinuado de :class:`collections.abc.Iterable`.

source: :class:`collections.abc.Iterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Iterable` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Iterator`.
pt_br: Apelido descontinuado de :class:`collections.abc.Iterator`.

source: :class:`collections.abc.Iterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Iterator` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Callable`.
pt_br: Apelido descontinuado de :class:`collections.abc.Callable`.

source: See :ref:`annotating-callables` for details on how to use :class:`collections.abc.Callable` and ``typing.Callable`` in type annotations.
pt_br: Veja :ref:`annotating-callables` para detalhes sobre como usar :class:`collections.abc.Callable` e ``typing.Callable`` em anotações de tipo.

source: :class:`collections.abc.Callable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Callable` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Generator`.
pt_br: Apelido descontinuado de :class:`collections.abc.Generator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Generator` and ``typing.Generator`` in type annotations.
pt_br: Consulte :ref:`annotating-generators-and-coroutines` para obter detalhes sobre como usar :class:`collections.abc.Generator` e ``typing.Generator`` em anotações de tipos.

source: :class:`collections.abc.Generator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Generator` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Default values for the send and return types were added.
pt_br: Adiciona valores-padrão para os tipos de envio e retorno.

source: Deprecated alias to :class:`collections.abc.Hashable`.
pt_br: Apelido descontinuado de :class:`collections.abc.Hashable`.

source: Use :class:`collections.abc.Hashable` directly instead.
pt_br: Use :class:`collections.abc.Hashable` diretamente.

source: Deprecated alias to :class:`collections.abc.Reversible`.
pt_br: Apelido descontinuado de :class:`collections.abc.Reversible`.

source: :class:`collections.abc.Reversible` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Reversible` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sized`.
pt_br: Apelido descontinuado de :class:`collections.abc.Sized`.

source: Use :class:`collections.abc.Sized` directly instead.
pt_br: Use :class:`collections.abc.Sized` diretamente.

source: Aliases to :mod:`contextlib` ABCs
pt_br: Apelidos de ABCs da :mod:`contextlib`

source: Deprecated alias to :class:`contextlib.AbstractContextManager`.
pt_br: Apelido descontinuado de :class:`contextlib.AbstractContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__enter__` method. The optional second type parameter, ``ExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__exit__` method.
pt_br: O primeiro parâmetro de tipo, ``T_co``, representa o tipo retornado pelo método :meth:`~object.__enter__`. O segundo parâmetro opcional de tipo, ``ExitT_co``, cujo valor-padrão é ``bool | None``, representa o tipo retornado pelo método :meth:`~object.__exit__`.

source: :class:`contextlib.AbstractContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`contextlib.AbstractContextManager` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Added the optional second type parameter, ``ExitT_co``.
pt_br: Adiciona o segundo parâmetro opcional de tipo, ``ExitT_co``.

source: Deprecated alias to :class:`contextlib.AbstractAsyncContextManager`.
pt_br: Apelido descontinuado de :class:`contextlib.AbstractAsyncContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__aenter__` method. The optional second type parameter, ``AExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__aexit__` method.
pt_br: O primeiro parâmetro de tipo, ``T_co``, representa o tipo retornado pelo método :meth:`~object.__aenter__`. O segundo parâmetro opcional de tipo, ``AExitT_co``, cujo valor-padrão é ``bool | None``, representa o tipo retornado pelo método :meth:`~object.__aexit__`.

source: :class:`contextlib.AbstractAsyncContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`contextlib.AbstractAsyncContextManager` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Added the optional second type parameter, ``AExitT_co``.
pt_br: Adiciona o segundo parâmetro opcional de tipo, ``AExitT_co``.

source: Deprecation Timeline of Major Features
pt_br: Cronograma de descontinuação dos principais recursos

source: Certain features in ``typing`` are deprecated and may be removed in a future version of Python. The following table summarizes major deprecations for your convenience. This is subject to change, and not all deprecations are listed.
pt_br: Alguns recursos em ``typing`` estão descontinuados e podem ser removidos em uma versão futura de Python. A tabela a seguir resume as principais descontinuações para sua conveniência. Ela está sujeita a alterações, e nem todas as descontinuações estão listadas.

source: Feature
pt_br: Recurso

source: Deprecated in
pt_br: Descontinuado em

source: Projected removal
pt_br: Remoção planejada

source: ``typing`` versions of standard collections
pt_br: versões ``typing`` de coleções-padrão

source: Undecided (see :ref:`deprecated-aliases` for more information)
pt_br: Não definido (consulte :ref:`apelidos descontinuados <deprecated-aliases>` para mais informações)

source: Undecided
pt_br: Não definido

source: :class:`typing.Hashable` and :class:`typing.Sized`
pt_br: :class:`typing.Hashable` e :class:`typing.Sized`

source: ellipsis literal
pt_br: literal de reticências
