Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: :mod:`!typing` --- Support for type hints
pt_br: :mod:`!typing` --- Suporte para dicas de tipo

source: **Source code:** :source:`Lib/typing.py`
pt_br: **Código-fonte:** :source:`Lib/typing.py`

source: The Python runtime does not enforce function and variable type annotations. They can be used by third party tools such as :term:`type checkers <static type checker>`, IDEs, linters, etc.
pt_br: O ambiente de execução do Python não força anotações de tipos de variáveis e funções. Elas podem ser usadas por ferramentas de terceiros como :term:`verificadores de tipo <static type checker>`, IDEs, linters, etc.

source: This module provides runtime support for type hints.
pt_br: Este módulo fornece suporte em tempo de execução para dicas de tipo.

source: Consider the function below::
pt_br: Considere a função abaixo::

source: def surface_area_of_cube(edge_length: float) -> str: return f"The surface area of the cube is {6 * edge_length ** 2}."
pt_br: def surface_area_of_cube(edge_length: float) -> str: return f"A área superficial de um cubo é {6 * edge_length ** 2}."

source: The function ``surface_area_of_cube`` takes an argument expected to be an instance of :class:`float`, as indicated by the :term:`type hint` ``edge_length: float``. The function is expected to return an instance of :class:`str`, as indicated by the ``-> str`` hint.
pt_br: A função ``surface_area_of_cube`` recebe um argumento que se espera ser uma instância de :class:`float`, conforme indicado pela :term:`dica de tipo` ``edge_length: float``. Espera-se que a função retorne uma instância de :class:`str`, conforme indicado pela dica ``-> str``.

source: While type hints can be simple classes like :class:`float` or :class:`str`, they can also be more complex. The :mod:`typing` module provides a vocabulary of more advanced type hints.
pt_br: Embora as dicas de tipo possam ser classes simples como :class:`float` ou :class:`str`, elas também podem ser mais complexas. O módulo :mod:`typing` fornece um vocabulário de dicas de tipo mais avançadas.

source: New features are frequently added to the ``typing`` module. The :pypi:`typing_extensions` package provides backports of these new features to older versions of Python.
pt_br: Novos recursos são frequentemente adicionados ao módulo ``typing``. O pacote :pypi:`typing_extensions` fornece backports desses novos recursos para versões mais antigas do Python.

source: `Typing cheat sheet <https://mypy.readthedocs.io/en/stable/cheat_sheet_py3.html>`_
pt_br: `Folha de dicas sobre tipagem <https://mypy.readthedocs.io/en/stable/cheat_sheet_py3.html>`_

source: A quick overview of type hints (hosted at the mypy docs)
pt_br: Uma visão geral das dicas de tipo (hospedado por mypy docs, em inglês).

source: Type System Reference section of `the mypy docs <https://mypy.readthedocs.io/en/stable/index.html>`_
pt_br: Seção de referência do sistema de tipos da `documentação do mypy <https://mypy.readthedocs.io/en/stable/index.html>`_

source: The Python typing system is standardised via PEPs, so this reference should broadly apply to most Python type checkers. (Some parts may still be specific to mypy.)
pt_br: O sistema de tipagem do Python é padronizado pelas PEPs, portanto esta referência deve se aplicar a maioria do verificadores de tipo do Python. (Alguns trechos podem se referir especificamente ao mypy. Documento em inglês).

source: Type-checker-agnostic documentation written by the community detailing type system features, useful typing related tools and typing best practices.
pt_br: Documentação independente de verificador de tipo escrita pela comunidade, detalhando os recursos do sistema de tipo, ferramentas úteis de tipagem e melhores práticas.

source: Specification for the Python Type System
pt_br: Especificação para o sistema de tipos do Python

source: The canonical, up-to-date specification of the Python type system can be found at `Specification for the Python type system <https://typing.python.org/en/latest/spec/index.html>`_.
pt_br: A especificação canônica e atualizada do sistema de tipos Python pode ser encontrada em `Specification for the Python type system <https://typing.python.org/en/latest/spec/index.html>`_.

source: Type aliases
pt_br: Apelidos de tipo

source: A type alias is defined using the :keyword:`type` statement, which creates an instance of :class:`TypeAliasType`. In this example, ``Vector`` and ``list[float]`` will be treated equivalently by static type checkers::
pt_br: Um apelido de tipo é definido utilizando a instrução :keyword:`type`, que por sua vez cria uma instância da classe :class:`TypeAliasType`. Neste exemplo, ``Vector`` e ``list[float]`` serão tratados de maneira equivalente pelos verificadores de tipo estático::

source: type Vector = list[float] def scale(scalar: float, vector: Vector) -> Vector: return [scalar * num for num in vector] # passes type checking; a list of floats qualifies as a Vector. new_vector = scale(2.0, [1.0, -4.2, 5.4])
pt_br: type Vector = list[float] def scale(scalar: float, vector: Vector) -> Vector: return [scalar * num for num in vector] # passa na verificação de tipos; uma lista de floats é qualificada como Vector. new_vector = scale(2.0, [1.0, -4.2, 5.4])

source: Type aliases are useful for simplifying complex type signatures. For example::
pt_br: Apelidos de tipo são úteis para simplificar assinaturas de tipo complexas. Por exemplo::

source: from collections.abc import Sequence type ConnectionOptions = dict[str, str] type Address = tuple[str, int] type Server = tuple[Address, ConnectionOptions] def broadcast_message(message: str, servers: Sequence[Server]) -> None: ... # The static type checker will treat the previous type signature as # being exactly equivalent to this one. def broadcast_message( message: str, servers: Sequence[tuple[tuple[str, int], dict[str, str]]] ) -> None: ...
pt_br: from collections.abc import Sequence type ConnectionOptions = dict[str, str] type Address = tuple[str, int] type Server = tuple[Address, ConnectionOptions] def broadcast_message(message: str, servers: Sequence[Server]) -> None: ... # O verificador de tipo tratará a assinatura de tipo anterior # como exatamente equivalente à assinatura abaixo. def broadcast_message( message: str, servers: Sequence[tuple[tuple[str, int], dict[str, str]]] ) -> None: ...

source: The :keyword:`type` statement is new in Python 3.12. For backwards compatibility, type aliases can also be created through simple assignment::
pt_br: A instrução :keyword:`type` é nova no Python 3.12. Para manter retrocompatibilidade, apelidos de tipo também podem ser criados usando atribuição::

source: Or marked with :data:`TypeAlias` to make it explicit that this is a type alias, not a normal variable assignment::
pt_br: Ou marcado com :data:`TypeAlias` para tornar explícito que se trata de um apelido de tipo e não uma atribuição de variável comum::

source: Use the :class:`NewType` helper to create distinct types::
pt_br: Utilize o auxiliar :class:`NewType` para criar tipos únicos::

source: The static type checker will treat the new type as if it were a subclass of the original type. This is useful in helping catch logical errors::
pt_br: O verificador de tipo estático tratará o novo tipo como se fosse uma subclasse do tipo original. Isso é útil para ajudar a encontrar erros de lógica::

source: def get_user_name(user_id: UserId) -> str: ... # passes type checking user_a = get_user_name(UserId(42351)) # fails type checking; an int is not a UserId user_b = get_user_name(-1)
pt_br: def get_user_name(user_id: UserId) -> str: ... # passa na verificação de tipo user_a = get_user_name(UserId(42351)) # falha na verificação de tipo: um int não é um UserId user_b = get_user_name(-1)

source: You may still perform all ``int`` operations on a variable of type ``UserId``, but the result will always be of type ``int``. This lets you pass in a ``UserId`` wherever an ``int`` might be expected, but will prevent you from accidentally creating a ``UserId`` in an invalid way::
pt_br: Você ainda pode executar todas as operações ``int`` em uma variável do tipo ``UserId``, mas o resultado sempre será do tipo ``int``. Isso permite que você passe um ``UserId`` em qualquer ocasião que ``int`` possa ser esperado, mas previne que você acidentalmente crie um ``UserId`` de uma forma inválida::

source: # 'output' is of type 'int', not 'UserId' output = UserId(23413) + UserId(54341)
pt_br: # 'output' é do tipo 'int', em vez de 'UserId' output = UserId(23413) + UserId(54341)

source: Note that these checks are enforced only by the static type checker. At runtime, the statement ``Derived = NewType('Derived', Base)`` will make ``Derived`` a callable that immediately returns whatever parameter you pass it. That means the expression ``Derived(some_value)`` does not create a new class or introduce much overhead beyond that of a regular function call.
pt_br: Note que essas verificações são aplicadas apenas pelo verificador de tipo estático. Em tempo de execução, a instrução ``Derived = NewType('Derived', Base)`` irá tornar ``Derived`` um chamável que retornará imediatamente qualquer parâmetro que você passar. Isso significa que a expressão ``Derived(some_value)`` não cria uma nova classe ou introduz sobrecarga além de uma chamada regular de função.instrução

source: More precisely, the expression ``some_value is Derived(some_value)`` is always true at runtime.
pt_br: Mais precisamente, a expressão ``some_value is Derived(some_value)`` é sempre verdadeira em tempo de execução.

source: It is invalid to create a subtype of ``Derived``::
pt_br: É inválido criar um subtipo de ``Derived``::

source: from typing import NewType UserId = NewType('UserId', int) # Fails at runtime and does not pass type checking class AdminUserId(UserId): pass
pt_br: from typing import NewType UserId = NewType('UserId', int) # Falha em tempo de execução e não passa na verificação de tipos class AdminUserId(UserId): pass

source: However, it is possible to create a :class:`NewType` based on a 'derived' ``NewType``::
pt_br: No entanto, é possível criar um :class:`NewType` baseado em um 'derivado' ``NewType``::

source: and typechecking for ``ProUserId`` will work as expected.
pt_br: e a verificação de tipos para ``ProUserId`` funcionará como esperado.

source: See :pep:`484` for more details.
pt_br: Veja :pep:`484` para mais detalhes.

source: Recall that the use of a type alias declares two types to be *equivalent* to one another. Doing ``type Alias = Original`` will make the static type checker treat ``Alias`` as being *exactly equivalent* to ``Original`` in all cases. This is useful when you want to simplify complex type signatures.
pt_br: Lembre-se que o uso de um apelido de tipo declara que dois tipos serão *equivalentes* entre si. Efetuar ``type Alias = Original`` fará o verificador de tipo estático tratar ``Alias`` como sendo *exatamente equivalente* a ``Original`` em todos os casos. Isso é útil quando você deseja simplificar assinaturas de tipo complexas.

source: In contrast, ``NewType`` declares one type to be a *subtype* of another. Doing ``Derived = NewType('Derived', Original)`` will make the static type checker treat ``Derived`` as a *subclass* of ``Original``, which means a value of type ``Original`` cannot be used in places where a value of type ``Derived`` is expected. This is useful when you want to prevent logic errors with minimal runtime cost.
pt_br: Em contraste, ``NewType`` declara que um tipo será *subtipo* de outro. Efetuando ``Derived = NewType('Derived', Original)`` irá fazer o verificador de tipo estático tratar ``Derived`` como uma *subclasse* de ``Original``, o que significa que um valor do tipo ``Original`` não pode ser utilizado onde um valor do tipo ``Derived`` é esperado. Isso é útil quando você deseja evitar erros de lógica com custo mínimo de tempo de execução.

source: ``NewType`` is now a class rather than a function. As a result, there is some additional runtime cost when calling ``NewType`` over a regular function.
pt_br: ``NewType`` agora é uma classe em vez de uma função. Consequentemente, existem alguns custos em tempo de execução ao chamar ``NewType`` em vez de uma função comum.

source: The performance of calling ``NewType`` has been restored to its level in Python 3.9.
pt_br: O desempenho de chamar ``NewType`` voltou ao mesmo nível da versão Python 3.9.

source: Annotating callable objects
pt_br: Anotações de objetos chamáveis

source: Functions -- or other :term:`callable` objects -- can be annotated using :class:`collections.abc.Callable` or deprecated :data:`typing.Callable`. ``Callable[[int], str]`` signifies a function that takes a single parameter of type :class:`int` and returns a :class:`str`.
pt_br: Funções -- ou outros objetos :term:`chamáveis <callable>` -- podem ser anotados com :class:`collections.abc.Callable` ou com o tipo descontinuado :data:`typing.Callable`. ``Callable[[int], str]`` expressa uma função que recebe um único parâmetro de tipo :class:`int` e retorna uma :class:`str`.

source: For example:
pt_br: Por exemplo:

source: from collections.abc import Callable, Awaitable def feeder(get_next_item: Callable[[], str]) -> None: ... # Body def async_query(on_success: Callable[[int], None], on_error: Callable[[int, Exception], None]) -> None: ... # Body async def on_update(value: str) -> None: ... # Body callback: Callable[[str], Awaitable[None]] = on_update
pt_br: from collections.abc import Callable, Awaitable def feeder(get_next_item: Callable[[], str]) -> None: ... # Corpo def async_query(on_success: Callable[[int], None], on_error: Callable[[int, Exception], None]) -> None: ... # Corpo async def on_update(value: str) -> None: ... # Corpo callback: Callable[[str], Awaitable[None]] = on_update

source: If a literal ellipsis ``...`` is given as the argument list, it indicates that a callable with any arbitrary parameter list would be acceptable:
pt_br: Se uma reticências literal ``...`` é passada no lugar de uma lista de argumentos, ela indica que um chamável com uma lista de qualquer parâmetro arbitrário seria aceita.

source: def concat(x: str, y: str) -> str: return x + y x: Callable[..., str] x = str # OK x = concat # Also OK
pt_br: def concat(x: str, y: str) -> str: return x + y x: Callable[..., str] x = str # OK x = concat # OK também

source: ``Callable`` cannot express complex signatures such as functions that take a variadic number of arguments, :ref:`overloaded functions <overload>`, or functions that have keyword-only parameters. However, these signatures can be expressed by defining a :class:`Protocol` class with a :meth:`~object.__call__` method:
pt_br: ``Callable`` não pode representar assinaturas complexas, como funções que aceitam um número variado de argumentos, :ref:`funções sobrecarregadas <overload>`, or funções que recebem apenas parâmetros somente-nomeados. No entanto, essas assinaturas podem ser expressas ao se definir uma :class:`Protocol` com um método :meth:`~object.__call__`:

source: from collections.abc import Iterable from typing import Protocol class Combiner(Protocol): def __call__(self, *vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def batch_proc(data: Iterable[bytes], cb_results: Combiner) -> bytes: for item in data: ... def good_cb(*vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def bad_cb(*vals: bytes, maxitems: int | None) -> list[bytes]: ... batch_proc([], good_cb) # OK batch_proc([], bad_cb) # Error! Argument 2 has incompatible type because of # different name and kind in the callback
pt_br: from collections.abc import Iterable from typing import Protocol class Combiner(Protocol): def __call__(self, *vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def batch_proc(data: Iterable[bytes], cb_results: Combiner) -> bytes: for item in data: ... def good_cb(*vals: bytes, maxlen: int | None = None) -> list[bytes]: ... def bad_cb(*vals: bytes, maxitems: int | None) -> list[bytes]: ... batch_proc([], good_cb) # OK batch_proc([], bad_cb) # Erro! Argumento 2 tem tipo incompatível por ter # nome e tipo diferente do callback

source: Callables which take other callables as arguments may indicate that their parameter types are dependent on each other using :class:`ParamSpec`. Additionally, if that callable adds or removes arguments from other callables, the :data:`Concatenate` operator may be used. They take the form ``Callable[ParamSpecVariable, ReturnType]`` and ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]`` respectively.
pt_br: Chamáveis que recebem outros chamáveis como argumentos podem indicar que seus tipos de parâmetro dependem uns dos outros usando :class:`ParamSpec`. Além disso, se esse chamável adiciona ou remove argumentos de outros chamáveis, o operador :data:`Concatenate` pode ser usado. Eles assumem a forma de ``Callable[ParamSpecVariable, ReturnType]`` e ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]``, respectivamente.

source: ``Callable`` now supports :class:`ParamSpec` and :data:`Concatenate`. See :pep:`612` for more details.
pt_br: ``Callable`` agora oferece suporte a :class:`ParamSpec` e :data:`Concatenate`. Veja :pep:`612` para mais detalhes.

source: The documentation for :class:`ParamSpec` and :class:`Concatenate` provides examples of usage in ``Callable``.
pt_br: A documentação para :class:`ParamSpec` e :class:`Concatenate` contém exemplos de uso em ``Callable``.

source: Generics
pt_br: Genéricos

source: Since type information about objects kept in containers cannot be statically inferred in a generic way, many container classes in the standard library support subscription to denote the expected types of container elements.
pt_br: Como a informação de tipo sobre objetos mantidos em contêineres não pode ser inferida estaticamente de uma maneira genérica, muitas classes de contêineres na biblioteca padrão permitem usar subscrição para denotar o tipo esperado dos elementos dos contêineres.

source: from collections.abc import Mapping, Sequence class Employee: ... # Sequence[Employee] indicates that all elements in the sequence # must be instances of "Employee". # Mapping[str, str] indicates that all keys and all values in the mapping # must be strings. def notify_by_email(employees: Sequence[Employee], overrides: Mapping[str, str]) -> None: ...
pt_br: from collections.abc import Mapping, Sequence class Employee: ... # Sequence[Employee] indica que todos os elementos na sequência # devem ser instâncias de "Employee". # Mapping[str, str] indica que todas as chaves e valores no mapeamento # devem ser strings. def notify_by_email(employees: Sequence[Employee], overrides: Mapping[str, str]) -> None: ...

source: Generic functions and classes can be parameterized by using :ref:`type parameter syntax <type-params>`::
pt_br: Funções e classes genéricas podem ser parametrizadas utilizando a :ref:`sintaxe de parâmetro de tipos <type-params>`::

source: from collections.abc import Sequence def first[T](l: Sequence[T]) -> T: # Function is generic over the TypeVar "T" return l[0]
pt_br: from collections.abc import Sequence def first[T](l: Sequence[T]) -> T: # Função é genérica sobre TypeVar "T" return l[0]

source: Or by using the :class:`TypeVar` factory directly::
pt_br: Ou utilizando a fábrica :class:`TypeVar` diretamente::

source: from collections.abc import Sequence from typing import TypeVar U = TypeVar('U') # Declare type variable "U" def second(l: Sequence[U]) -> U: # Function is generic over the TypeVar "U" return l[1]
pt_br: from collections.abc import Sequence from typing import TypeVar U = TypeVar('U') # Declara tipo variável "U" def second(l: Sequence[U]) -> U: # Função é genérica sobre a TypeVar "U" return l[1]

source: Syntactic support for generics is new in Python 3.12.
pt_br: O suporte sintático para genéricos é novo no Python 3.12.

source: Annotating tuples
pt_br: Anotando tuplas

source: For most containers in Python, the typing system assumes that all elements in the container will be of the same type. For example::
pt_br: Para a maior parte dos tipos contêineres em Python, o sistema de tipagem presume que todos os elementos do contêiner são do mesmo tipo. Por exemplo::

source: from collections.abc import Mapping # Type checker will infer that all elements in ``x`` are meant to be ints x: list[int] = [] # Type checker error: ``list`` only accepts a single type argument: y: list[int, str] = [1, 'foo'] # Type checker will infer that all keys in ``z`` are meant to be strings, # and that all values in ``z`` are meant to be either strings or ints z: Mapping[str, str | int] = {}
pt_br: from collections.abc import Mapping # Verificador de tipos irá inferir que todos os elementos em ``x`` devem ser ints x: list[int] = [] # Erro no verificador: ``list`` aceita um único tipo de argumento y: list[int, str] = [1, 'foo'] # Verificador de tipos irá inferir que todas as chaves em ``z`` devem ser strings, # e todos os valores em ``z`` devem ser strings ou ints z: Mapping[str, str | int] = {}

source: :class:`list` only accepts one type argument, so a type checker would emit an error on the ``y`` assignment above. Similarly, :class:`~collections.abc.Mapping` only accepts two type arguments: the first indicates the type of the keys, and the second indicates the type of the values.
pt_br: :class:`list` aceita apenas um tipo de argumento, e assim o verificador de tipos emitirá um erro na atribuição ``y`` acima. Da mesma forma, :class:`~collections.abc.Mapping` aceita apenas dois tipos de argumento: O primeiro indica o tipo das chaves, e o segundo indica o tipo dos valores.

source: Unlike most other Python containers, however, it is common in idiomatic Python code for tuples to have elements which are not all of the same type. For this reason, tuples are special-cased in Python's typing system. :class:`tuple` accepts *any number* of type arguments::
pt_br: Ao contrário da maioria dos outros contêineres Python, é comum no código Python idiomático que as tuplas tenham elementos que não sejam todos do mesmo tipo. Por esse motivo, as tuplas têm um caso especial no sistema de tipagem do Python. :class:`tuple` aceita *qualquer quantidade* de argumentos de tipo::

source: # OK: ``x`` is assigned to a tuple of length 1 where the sole element is an int x: tuple[int] = (5,) # OK: ``y`` is assigned to a tuple of length 2; # element 1 is an int, element 2 is a str y: tuple[int, str] = (5, "foo") # Error: the type annotation indicates a tuple of length 1, # but ``z`` has been assigned to a tuple of length 3 z: tuple[int] = (1, 2, 3)
pt_br: # OK: ``x`` foi atribuída a uma tupla de comprimento 1, onde o único elemento é um int x: tuple[int] = (5,) # OK: ``y`` foi atribuída a uma tupla de comprimento 2; # o elemento 1 é um int, o elemento 2 é uma str y: tuple[int, str] = (5, "foo") # Erro: a anotação de tipo indica uma tupla de comprimento 1, # mas ``z`` foi atribuída a uma tupla de comprimento 3 z: tuple[int] = (1, 2, 3)

source: x: tuple[int, ...] = (1, 2) # These reassignments are OK: ``tuple[int, ...]`` indicates x can be of any length x = (1, 2, 3) x = () # This reassignment is an error: all elements in ``x`` must be ints x = ("foo", "bar") # ``y`` can only ever be assigned to an empty tuple y: tuple[()] = () z: tuple = ("foo", "bar") # These reassignments are OK: plain ``tuple`` is equivalent to ``tuple[Any, ...]`` z = (1, 2, 3) z = ()
pt_br: x: tuple[int, ...] = (1, 2) # Essas reatribuições são OK: ``tuple[int, ...]`` indica que x pode ter qualquer comprimento x = (1, 2, 3) x = () # Essa reatribuição é um erro: todos os elementos de ``x`` devem ser ints x = ("foo", "bar") # ``y`` só pode ser atribuída a uma tupla vazia y: tuple[()] = () z: tuple = ("foo", "bar") # Essas reatribuições são OK: o tipo ``tuple`` equivale a ``tuple[Any, ...]`` z = (1, 2, 3) z = ()
