Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: At runtime, this function prints the runtime type of its argument to :data:`sys.stderr` and returns the argument unchanged (allowing the call to be used within an expression)::
pt_br: Em tempo de execução, esta função envia o tipo de seu argumento para :data:`sys.stderr` e retorna o argumento inalterado (permitindo que a chamada seja usada em uma expressão)::

source: x = reveal_type(1) # prints "Runtime type is int" print(x) # prints "1"
pt_br: x = reveal_type(1) # exibe "Runtime type is int" print(x) # exibe "1"

source: Note that the runtime type may be different from (more or less specific than) the type statically inferred by a type checker.
pt_br: Observe que o tipo em tempo de execução pode ser diferente (mais ou menos específico) do tipo inferido estaticamente por um verificador de tipos.

source: Most type checkers support ``reveal_type()`` anywhere, even if the name is not imported from ``typing``. Importing the name from ``typing``, however, allows your code to run without runtime errors and communicates intent more clearly.
pt_br: A maioria dos verificadores de tipos dá suporte a ``reveal_type()`` em qualquer lugar, mesmo que o nome não seja importado de ``typing``. Porém, importar o nome de ``typing`` permite que o código seja executado sem erros em tempo de execução e comunica a intenção com mais clareza.

source: Decorator to mark an object as providing :func:`dataclass <dataclasses.dataclass>`-like behavior.
pt_br: Um decorador que marca um objeto como tendo comportamento similar a uma :func:`dataclass <dataclasses.dataclass>`.

source: ``dataclass_transform`` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class in a similar way to :func:`@dataclasses.dataclass <dataclasses.dataclass>`.
pt_br: ``dataclass_transform`` pode ser usado para decorar uma classe, metaclasse, ou função decoradora. A presença de ``@dataclass_transform()`` informa a um verificador de tipo estático que o objeto decorado executa "mágica" em tempo de execução que transforma uma classe de maneira semelhante a :func:`@dataclasses.dataclass <dataclasses.dataclass>`.

source: Example usage with a decorator function:
pt_br: Exemplo de uso com a função decoradora:

source: On a base class::
pt_br: Em uma classe base::

source: On a metaclass::
pt_br: Em uma metaclasse::

source: The ``CustomerModel`` classes defined above will be treated by type checkers similarly to classes created with :func:`@dataclasses.dataclass <dataclasses.dataclass>`. For example, type checkers will assume these classes have ``__init__`` methods that accept ``id`` and ``name``.
pt_br: As classes ``CustomerModel`` definidas acima serão tratadas pelos verificadores de tipos semelhantemente às classes criadas com :func:`@dataclasses.dataclass <dataclasses.dataclass>`. Por exemplo, os verificadores de tipo presumirão que essas classes têm métodos ``__init__`` que aceitam ``id`` e ``name``.

source: The decorated class, metaclass, or function may accept the following bool arguments which type checkers will assume have the same effect as they would have on the :func:`@dataclasses.dataclass<dataclasses.dataclass>` decorator: ``init``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only``, and ``slots``. It must be possible for the value of these arguments (``True`` or ``False``) to be statically evaluated.
pt_br: A classe, metaclasse, ou função decorada pode aceitar os seguintes argumentos booleanos tal que verificadores de tipo presumirão ter o mesmo efeito que teriam no decorador :func:`@dataclasses.dataclass<dataclasses.dataclass>`: ``init``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only``, e ``slots``. É necessário que o valor desses argumentos (``True`` ou ``False``) seja avaliado estaticamente.

source: The arguments to the ``dataclass_transform`` decorator can be used to customize the default behaviors of the decorated class, metaclass, or function:
pt_br: Os argumentos do decorador ``dataclass_transform`` podem ser usados para personalizar o comportamento padrão da classe, metaclasse, ou função decorada:

source: Parameters
pt_br: Parâmetros

source: Indicates whether the ``eq`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``True``.
pt_br: Indica se o parâmetro ``eq`` é presumido como ``True`` ou ``False`` se for omitido pelo chamador. O padrão é ``True``.

source: Indicates whether the ``order`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
pt_br: Indica se o parâmetro ``order`` é presumido como ``True`` ou ``False`` se for omitido pelo chamador. O padrão é ``False``.

source: Indicates whether the ``kw_only`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
pt_br: Indica se o parâmetro ``kw_only`` é presumido como ``True`` ou ``False`` se for omitido pelo chamador. O padrão é ``False``.

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``. .. versionadded:: 3.12
pt_br: Indica se o parâmetro ``frozen`` é presumido como ``True`` ou ``False`` se for omitido pelo chamador. O padrão é ``False``. Added in version 3.12

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
pt_br: Indica se o parâmetro ``frozen`` é presumido como ``True`` ou ``False`` se for omitido pelo chamador. O padrão é ``False``.

source: Specifies a static list of supported classes or functions that describe fields, similar to :func:`dataclasses.field`. Defaults to ``()``.
pt_br: Especifica uma lista estática de classes ou funções compatíveis que descrevem campos, semelhante a :func:`dataclasses.field`. O valor padrão é ``()``.

source: Arbitrary other keyword arguments are accepted in order to allow for possible future extensions.
pt_br: Outros argumentos nomeados arbitrários são aceitos para permitir possíveis futuras extensões.

source: Type checkers recognize the following optional parameters on field specifiers:
pt_br: Verificadores de tipo reconhecem os seguintes parâmetros opcionais em especificadores de campos:

source: **Recognised parameters for field specifiers**
pt_br: **Parâmetros reconhecidos para especificadores de campos**

source: Parameter name
pt_br: Nome do parâmetro

source: Description
pt_br: Descrição

source: Indicates whether the field should be included in the synthesized ``__init__`` method. If unspecified, ``init`` defaults to ``True``.
pt_br: Indica se o campo deve ser incluído no método ``__init__`` sintetizado. Se não for especificado, o valor padrão de ``init`` é ``True``.

source: Provides the default value for the field.
pt_br: Fornece o valor padrão do campo.

source: Provides a runtime callback that returns the default value for the field. If neither ``default`` nor ``default_factory`` are specified, the field is assumed to have no default value and must be provided a value when the class is instantiated.
pt_br: Fornece uma função de retorno de tempo de execução que retorna o valor padrão do campo. Se nem ``default`` nem ``default_factory`` forem especificados, o campo é presumido como sem valor padrão e deverá receber um valor quando a classe for instanciada.

source: An alias for the ``default_factory`` parameter on field specifiers.
pt_br: Um apelido para o parâmetro ``default_factory`` em especificadores de campos.

source: Indicates whether the field should be marked as keyword-only. If ``True``, the field will be keyword-only. If ``False``, it will not be keyword-only. If unspecified, the value of the ``kw_only`` parameter on the object decorated with ``dataclass_transform`` will be used, or if that is unspecified, the value of ``kw_only_default`` on ``dataclass_transform`` will be used.
pt_br: Indica se o campo deve ser marcado como somente-nomeado. Se verdadeiro, o campo será somente-nomeado. Se falso, não será somente-nomeado. Se não for especificado, será usado o valor do parâmetro ``kw_only`` do objeto decorado com ``dataclass_transform`` ou, se este não for especificado, será usado o valor de ``kw_only_default`` no ``dataclass_transform``.

source: Provides an alternative name for the field. This alternative name is used in the synthesized ``__init__`` method.
pt_br: Fornece um nome alternativo para o campo. Esse nome alternativo é usado no método ``__init__`` sintetizado.

source: At runtime, this decorator records its arguments in the ``__dataclass_transform__`` attribute on the decorated object. It has no other runtime effect.
pt_br: Em tempo de execução, esse decorador registra seu argumento no atributo ``__dataclass_transform__`` no objeto decorado. Ele não tem nenhum outro efeito em tempo de execução.

source: See :pep:`681` for more details.
pt_br: Consulte :pep:`681` para mais detalhes.

source: Decorator for creating overloaded functions and methods.
pt_br: Decorador para criar funções e métodos sobrecarregados.

source: The ``@overload`` decorator allows describing functions and methods that support multiple different combinations of argument types. A series of ``@overload``-decorated definitions must be followed by exactly one non-``@overload``-decorated definition (for the same function/method).
pt_br: O decorador ``@overload`` permite descrever funções e métodos com suporte a várias combinações de tipos de argumento. Uma sequência de definições decoradas com ``@overload`` deve preceder uma única definição não decorada por ``@overload`` (para a mesma função/método).

source: ``@overload``-decorated definitions are for the benefit of the type checker only, since they will be overwritten by the non-``@overload``-decorated definition. The non-``@overload``-decorated definition, meanwhile, will be used at runtime but should be ignored by a type checker. At runtime, calling an ``@overload``-decorated function directly will raise :exc:`NotImplementedError`.
pt_br: Definições decoradas com ``@overload`` são usadas somente para benefício do verificador de tipos, já que serão sobrescritas por definições sem decoração de ``@overload``. Enquanto isso, definições sem decoração de ``@overload`` serão usadas em tempo de execução, mas devem ser ignoradas pelo verificador de tipos. Em tempo de execução, chamar uma função decorada por ``@overload`` diretamente levantará :exc:`NotImplementedError`.

source: An example of overload that gives a more precise type than can be expressed using a union or a type variable:
pt_br: Um exemplo de sobrecarga que fornece um tipo mais preciso do que o expressar o tipo expresso por uma união ou um tipo variável:

source: @overload def process(response: None) -> None: ... @overload def process(response: int) -> tuple[int, str]: ... @overload def process(response: bytes) -> str: ... def process(response): ... # actual implementation goes here
pt_br: @overload def process(response: None) -> None: ... @overload def process(response: int) -> tuple[int, str]: ... @overload def process(response: bytes) -> str: ... def process(response): ... # a implementação real vem aqui

source: See :pep:`484` for more details and comparison with other typing semantics.
pt_br: Consulte :pep:`484` para mais detalhes e uma comparação com outras semânticas de tipagem.

source: Overloaded functions can now be introspected at runtime using :func:`get_overloads`.
pt_br: Funções sobrecarregadas agora podem ser inspecionadas em tempo de execução usando :func:`get_overloads`.

source: Return a sequence of :func:`@overload <overload>`-decorated definitions for *func*.
pt_br: Retorna uma sequência de definições de *func* decoradas com :func:`@overload <overload>`.

source: *func* is the function object for the implementation of the overloaded function. For example, given the definition of ``process`` in the documentation for :func:`@overload <overload>`, ``get_overloads(process)`` will return a sequence of three function objects for the three defined overloads. If called on a function with no overloads, ``get_overloads()`` returns an empty sequence.
pt_br: *func* é o objeto função para a implementação da função sobrecarregada. Por exemplo, dada a definição de ``process`` na documentação de :func:`@overload <overload>`, ``get_overloads(process)`` retornará uma sequência de três objetos função para as três sobrecargas definidas. Se for chamada em uma função sem sobrecargas, ``get_overloads()`` retornará uma sequência vazia.

source: ``get_overloads()`` can be used for introspecting an overloaded function at runtime.
pt_br: A função ``get_overloads()`` pode ser usada em tempo de execução para introspecção de uma função sobrecarregada.

source: Clear all registered overloads in the internal registry.
pt_br: Apaga todas as sobrecargas registradas no registro interno.

source: This can be used to reclaim the memory used by the registry.
pt_br: Isso pode ser usado para recuperar a memória usada pelo registro.

source: Decorator to indicate final methods and final classes.
pt_br: Um decorador para indicar métodos e classes finais.

source: Decorating a method with ``@final`` indicates to a type checker that the method cannot be overridden in a subclass. Decorating a class with ``@final`` indicates that it cannot be subclassed.
pt_br: Decorar um método com ``@final`` indica a um verificador de tipos que o método não pode ser substituído em uma subclasse. Decorar uma classe com ``@final`` indica que ela não pode ser herdada.

source: class Base: @final def done(self) -> None: ... class Sub(Base): def done(self) -> None: # Error reported by type checker ... @final class Leaf: ... class Other(Leaf): # Error reported by type checker ...
pt_br: class Base: @final def done(self) -> None: ... class Sub(Base): def done(self) -> None: # Erro reportado pelo verificador de tipos ... @final class Leaf: ... class Other(Leaf): # Erro reportado pelo verificador de tipos ...

source: The decorator will now attempt to set a ``__final__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__final__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as final. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
pt_br: O decorador tentará definir um atributo ``__final__`` como ``True`` no objeto decorado. Assim, uma verificação como ``if getattr(obj, "__final__", False)`` pode ser usada em tempo de execução para determinar se um objeto ``obj`` foi marcado como final. Se o objeto decorado não tem suporte a definição de atributos, o decorador retorna o objeto inalterado sem levantar uma exceção.

source: Decorator to indicate that annotations are not type hints.
pt_br: Decorador para indicar que anotações não são dicas de tipo.

source: This works as a class or function :term:`decorator`. With a class, it applies recursively to all methods and classes defined in that class (but not to methods defined in its superclasses or subclasses). Type checkers will ignore all annotations in a function or class with this decorator.
pt_br: Isso funciona como :term:`decorator` de uma classe ou função. Com uma classe, ele se aplica recursivamente a todos os métodos e classes definidos nessa classe (mas não a métodos definidos em suas superclasses ou subclasses). Os verificadores de tipos ignorarão todas as anotações em uma função ou classe com este decorador.

source: ``@no_type_check`` mutates the decorated object in place.
pt_br: ``@no_type_check`` modifica o objeto decorado internamente.

source: Decorator to give another decorator the :func:`no_type_check` effect.
pt_br: Decorador para dar a outro decorador o efeito :func:`no_type_check`.

source: This wraps the decorator with something that wraps the decorated function in :func:`no_type_check`.
pt_br: Isso envolve o decorador com algo que envolve a função decorada em :func:`no_type_check`.

source: No type checker ever added support for ``@no_type_check_decorator``. It is therefore deprecated, and will be removed in Python 3.15.
pt_br: Nenhum verificador de tipos jamais adicionou suporte para ``@no_type_check_decorator``. Portanto, ele está descontinuado e será removido no Python 3.15.

source: Decorator to indicate that a method in a subclass is intended to override a method or attribute in a superclass.
pt_br: Decorador para indicar que um método em uma subclasse deve substituir um método ou atributo em uma superclasse.

source: Type checkers should emit an error if a method decorated with ``@override`` does not, in fact, override anything. This helps prevent bugs that may occur when a base class is changed without an equivalent change to a child class.
pt_br: Os verificadores de tipo devem emitir um erro se um método decorado com ``@override`` substitui nada. Isso ajuda a evitar erros que podem ocorrer quando uma classe base muda sem uma mudança equivalente em uma classe filha.

source: class Base: def log_status(self) -> None: ... class Sub(Base): @override def log_status(self) -> None: # Okay: overrides Base.log_status ... @override def done(self) -> None: # Error reported by type checker ...
pt_br: class Base: def log_status(self) -> None: ... class Sub(Base): @override def log_status(self) -> None: # OK: substitui Base.log_status ... @override def done(self) -> None: # Erro reportado pelo verificador de tipos ...

source: There is no runtime checking of this property.
pt_br: Não há verificação desta propriedade em tempo de execução.

source: The decorator will attempt to set an ``__override__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__override__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as an override. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
pt_br: O decorador tentará definir um atributo ``__override__`` como ``True`` no objeto decorado. Assim, uma verificação como ``if getattr(obj, "__override__", False)`` poderá ser usada em tempo de execução para determinar se um objeto ``obj`` foi marcado como uma substituição. Se o objeto decorado não der suporte à atribuição de atributos, o decorador retorna o objeto inalterado sem levantar uma exceção.

source: See :pep:`698` for more details.
pt_br: Consulte :pep:`698` para obter mais detalhes.

source: Decorator to mark a class or function as unavailable at runtime.
pt_br: Decorador para marcar uma classe ou função como indisponível em tempo de execução.

source: This decorator is itself not available at runtime. It is mainly intended to mark classes that are defined in type stub files if an implementation returns an instance of a private class::
pt_br: Este decorador em si não está disponível em tempo de execução. Seu objetivo principal é marcar classes definidas em arquivos de tipo stub se uma implementação retornar uma instância de uma classe privada:

source: @type_check_only class Response: # private or not available at runtime code: int def get_header(self, name: str) -> str: ... def fetch_response() -> Response: ...
pt_br: @type_check_only class Response: # privado ou indisponível em tempo de execução code: int def get_header(self, name: str) -> str: ... def fetch_response() -> Response: ...

source: Note that returning instances of private classes is not recommended. It is usually preferable to make such classes public.
pt_br: Observe que retornar instâncias de classes privadas não é recomendado. Normalmente, é preferível tornar essas classes públicas.

source: Introspection helpers
pt_br: Auxiliares de introspecção

source: Return a dictionary containing type hints for a function, method, module or class object.
pt_br: Retorna um dicionário contendo dicas de tipo para uma função, método, módulo ou objeto classe.

source: This is often the same as ``obj.__annotations__``, but this function makes the following changes to the annotations dictionary:
pt_br: Geralmente é o mesmo que ``obj.__annotations__``, mas esta função faz as seguintes alterações no dicionário de anotações:

source: Forward references encoded as string literals or :class:`ForwardRef` objects are handled by evaluating them in *globalns*, *localns*, and (where applicable) *obj*'s :ref:`type parameter <type-params>` namespace. If *globalns* or *localns* is not given, appropriate namespace dictionaries are inferred from *obj*.
pt_br: Referências futuras codificadas como literais de string ou objetos :class:`ForwardRef` são tratados avaliando-as em *globalns*, *localns* e (quando aplicável) no espaço de nomes de :ref:`parâmetro de tipo <type-params>` de *obj*. Se *globalns* ou *localns* não forem fornecidos, os dicionários de espaço de nomes apropriados serão inferidos de *obj*.

source: ``None`` is replaced with :class:`types.NoneType`.
pt_br: ``None`` é substituído por :class:`types.NoneType`.

source: If :func:`@no_type_check <no_type_check>` has been applied to *obj*, an empty dictionary is returned.
pt_br: Se :func:`@no_type_check <no_type_check>` tiver sido aplicada a *obj*, será retornado um dicionário vazio.

source: If *obj* is a class ``C``, the function returns a dictionary that merges annotations from ``C``'s base classes with those on ``C`` directly. This is done by traversing :attr:`C.__mro__ <type.__mro__>` and iteratively combining ``__annotations__`` dictionaries. Annotations on classes appearing earlier in the :term:`method resolution order` always take precedence over annotations on classes appearing later in the method resolution order.
pt_br: Se *obj* for uma classe ``C``, a função retorna um dicionário que mescla anotações das classes base de ``C`` com as de ``C`` diretamente. Isso é feito percorrendo :attr:`C.__mro__ <type.__mro__>` e combinando iterativamente os dicionários ``__annotations__``. Anotações em classes que aparecem antes na :term:`ordem de resolução de métodos` sempre tem precedência sobre anotações em classes que aparecem depois no ordem de resolução de métodos.

source: The function recursively replaces all occurrences of ``Annotated[T, ...]`` with ``T``, unless *include_extras* is set to ``True`` (see :class:`Annotated` for more information).
pt_br: A função substitui recursivamente todas as ocorrências de ``Annotated[T, ...]`` por ``T``, a menos que *include_extras* seja definido como ``True`` (consulte :class:`Annotated` para obter mais informações).

source: See also :func:`annotationlib.get_annotations`, a lower-level function that returns annotations more directly.
pt_br: Veja também :func:`annotationlib.get_annotations`, uma função de nível inferior que retorna anotações mais diretamente.

source: This function may execute arbitrary code contained in annotations. See :ref:`annotationlib-security` for more information.
pt_br: Esta função pode executar código arbitrário contido em anotações. Consulte :ref:`annotationlib-security` para obter mais informações.
