Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: An :func:`isinstance` check against a runtime-checkable protocol can be surprisingly slow compared to an ``isinstance()`` check against a non-protocol class. Consider using alternative idioms such as :func:`hasattr` calls for structural checks in performance-sensitive code.
pt_br: uma verificação com :func:`isinstance` sobre um protocolo verificável em tempo de execução pode ser surpreendentemente lenta se comparada a uma verificação ``isinstance()`` sobre outros tipos de classe. Considere usar expressões alternativas, como chamar a função :func:`hasattr` para realizar verificações estruturais em código sensível a desempenho.

source: The internal implementation of :func:`isinstance` checks against runtime-checkable protocols now uses :func:`inspect.getattr_static` to look up attributes (previously, :func:`hasattr` was used). As a result, some objects which used to be considered instances of a runtime-checkable protocol may no longer be considered instances of that protocol on Python 3.12+, and vice versa. Most users are unlikely to be affected by this change.
pt_br: A implementação interna do :func:`isinstance` agora verifica os protocolos verificáveis em tempo de execução usando :func:`inspect.getattr_static` para procurar o atributo (anteriormente, era usado :func:`hasattr`). Como resultado, alguns objetos que costumavam ser considerados instâncias de um protoloco verifiável em tempo de execução podem não ser mais considerados instâncias desse protocolo em Python 3.12+, e vice-versa. É improvável que a maioria dos usuários seja afetada por essa alteração.

source: The members of a runtime-checkable protocol are now considered "frozen" at runtime as soon as the class has been created. Monkey-patching attributes onto a runtime-checkable protocol will still work, but will have no impact on :func:`isinstance` checks comparing objects to the protocol. See :ref:`What's new in Python 3.12 <whatsnew-typing-py312>` for more details.
pt_br: Os membros de um protocolo verificável em tempo de execução agora serão considerados "congelados" em tempo de execução assim que a classe for criada. A alteração dinâmica de atributos de um protocolo em tempo de execução ainda funcionará, mas não terá impacto nas verificações de :func:`isinstance` ao comparar objetos com o protocolo. Consulte o :ref:`O que há de novo no Python 3.12 <whatsnew-typing-py312>` para mais detalhes.

source: Special construct to add type hints to a dictionary. At runtime it is a plain :class:`dict`.
pt_br: Uma construção especial para adicionar dicas de tipo a um dicionário. Em tempo de execução, é um simples :class:`dict`.

source: ``TypedDict`` declares a dictionary type that expects all of its instances to have a certain set of keys, where each key is associated with a value of a consistent type. This expectation is not checked at runtime but is only enforced by type checkers. Usage::
pt_br: ``TypedDict`` declara um tipo dicionário que espera que todas as suas instâncias tenham um determinado conjunto de chaves, onde cada chave está associada a um valor de um tipo consistente. Essa expectativa não é verificada em tempo de execução, mas é imposta apenas por verificadores de tipos. Modo de usar::

source: class Point2D(TypedDict): x: int y: int label: str a: Point2D = {'x': 1, 'y': 2, 'label': 'good'} # OK b: Point2D = {'z': 3, 'label': 'bad'} # Fails type check assert Point2D(x=1, y=2, label='first') == dict(x=1, y=2, label='first')
pt_br: class Point2D(TypedDict): x: int y: int label: str a: Point2D = {'x': 1, 'y': 2, 'label': 'good'} # OK b: Point2D = {'z': 3, 'label': 'bad'} # Falha na verificação de tipos assert Point2D(x=1, y=2, label='first') == dict(x=1, y=2, label='first')

source: An alternative way to create a ``TypedDict`` is by using function-call syntax. The second argument must be a literal :class:`dict`::
pt_br: Um modo alternativo de criar um ``TypedDict`` é usando a sintaxe de chamada de função. O segundo argumento deve ser um :class:`dict`::

source: This functional syntax allows defining keys which are not valid :ref:`identifiers <identifiers>`, for example because they are keywords or contain hyphens, or when key names must not be :ref:`mangled <private-name-mangling>` like regular private names::
pt_br: Esta sintaxe funcional permite definirmos chaves usando :ref:`identificadores <identifiers>` inválidos, por exemplo, por serem palavras-chave ou conterem hífens, ou quando os nomes das chaves não devem ser :ref:`desconfigurados <private-name-mangling>` como nomes privados comuns::

source: # raises SyntaxError class Point2D(TypedDict): in: int # 'in' is a keyword x-y: int # name with hyphens class Definition(TypedDict): __schema: str # mangled to `_Definition__schema` # OK, functional syntax Point2D = TypedDict('Point2D', {'in': int, 'x-y': int}) Definition = TypedDict('Definition', {'__schema': str}) # not mangled
pt_br: # levanta SyntaxError class Point2D(TypedDict): in: int # 'in' é uma palavra reservada x-y: int # nome com hífen class Definition(TypedDict): __schema: str # desconfigurado para `_Definition__schema` # OK, sintaxe funcional Point2D = TypedDict('Point2D', {'in': int, 'x-y': int}) Definition = TypedDict('Definition', {'__schema': str}) # não desconfigurado

source: By default, all keys must be present in a ``TypedDict``. It is possible to mark individual keys as non-required using :data:`NotRequired`::
pt_br: Por padrão, todas as chaves devem estar presentes em um ``TypedDict``. É possível marcar chaves individuais como não-obrigatórias usando :data:`NotRequired`::

source: class Point2D(TypedDict): x: int y: int label: NotRequired[str] # Alternative syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int, 'label': NotRequired[str]})
pt_br: class Point2D(TypedDict): x: int y: int label: NotRequired[str] # Sintaxe alternativa Point2D = TypedDict('Point2D', {'x': int, 'y': int, 'label': NotRequired[str]})

source: This means that a ``Point2D`` ``TypedDict`` can have the ``label`` key omitted.
pt_br: Isso significa que um ``TypedDict`` ``Point2D`` pode ter a chave ``label`` omitida.

source: It is also possible to mark all keys as non-required by default by specifying a totality of ``False``::
pt_br: Também é possível marcar todas as chaves como não necessárias por padrão, especificando a totalidade como ``False``::

source: class Point2D(TypedDict, total=False): x: int y: int # Alternative syntax Point2D = TypedDict('Point2D', {'x': int, 'y': int}, total=False)
pt_br: class Point2D(TypedDict, total=False): x: int y: int # Sintaxe alternativa Point2D = TypedDict('Point2D', {'x': int, 'y': int}, total=False)

source: This means that a ``Point2D`` ``TypedDict`` can have any of the keys omitted. A type checker is only expected to support a literal ``False`` or ``True`` as the value of the ``total`` argument. ``True`` is the default, and makes all items defined in the class body required.
pt_br: Isso significa que um ``TypedDict`` ``Point2D`` pode ter qualquer uma de suas chaves omitidas. Espera-se que um verificador de tipos apenas permita os literais ``False`` ou ``True`` como valores do argumento ``total``. ``True`` é o padrão, e todos os itens definidos no corpo da classe tornam-se obrigatórios.

source: Individual keys of a ``total=False`` ``TypedDict`` can be marked as required using :data:`Required`::
pt_br: As chaves individuais de um ``TypedDict`` com ``total=False`` podem ser marcadas como obrigatórias usando :data:`Required`::

source: class Point2D(TypedDict, total=False): x: Required[int] y: Required[int] label: str # Alternative syntax Point2D = TypedDict('Point2D', { 'x': Required[int], 'y': Required[int], 'label': str }, total=False)
pt_br: class Point2D(TypedDict, total=False): x: Required[int] y: Required[int] label: str # Sintaxe alternativa Point2D = TypedDict('Point2D', { 'x': Required[int], 'y': Required[int], 'label': str }, total=False)

source: It is possible for a ``TypedDict`` type to inherit from one or more other ``TypedDict`` types using the class-based syntax. Usage::
pt_br: É possível que um tipo ``TypedDict`` herde de um ou mais tipos ``TypedDict`` usando a sintaxe baseada em classes. Modo de usar::

source: ``Point3D`` has three items: ``x``, ``y`` and ``z``. It is equivalent to this definition::
pt_br: ``Point3D`` tem três itens: ``x``, ``y`` e ``z``. Equivale a esta definição::

source: A ``TypedDict`` cannot inherit from a non-\ ``TypedDict`` class, except for :class:`Generic`. For example::
pt_br: Um ``TypedDict`` não pode herdar de uma classe não ``TypedDict``, exceto :class:`Generic`. Por exemplo::

source: class X(TypedDict): x: int class Y(TypedDict): y: int class Z(object): pass # A non-TypedDict class class XY(X, Y): pass # OK class XZ(X, Z): pass # raises TypeError
pt_br: class X(TypedDict): x: int class Y(TypedDict): y: int class Z(object): pass # Uma classe não TypedDict class XY(X, Y): pass # OK class XZ(X, Z): pass # levanta TypeError

source: A ``TypedDict`` can be generic::
pt_br: Um ``TypedDict`` pode ser genérico::

source: To create a generic ``TypedDict`` that is compatible with Python 3.11 or lower, inherit from :class:`Generic` explicitly:
pt_br: Para criar um ``TypedDict`` genérico que seja compatível com Python 3.11 ou inferior, herde de :class:`Generic` explicitamente:

source: A ``TypedDict`` can be introspected via annotations dicts (see :ref:`annotations-howto` for more information on annotations best practices), :attr:`__total__`, :attr:`__required_keys__`, and :attr:`__optional_keys__`.
pt_br: Um ``TypedDict`` pode ser inspecionado por meio de dicionários de anotações (consulte :ref:`annotations-howto` para obter mais informações sobre as melhores práticas de anotações), :attr:`__total__`, :attr:`__required_keys__` e :attr:`__optional_keys__`.

source: ``Point2D.__total__`` gives the value of the ``total`` argument. Example:
pt_br: ``Point2D.__total__`` fornece o valor do argumento ``total``. Exemplo:

source: This attribute reflects *only* the value of the ``total`` argument to the current ``TypedDict`` class, not whether the class is semantically total. For example, a ``TypedDict`` with ``__total__`` set to ``True`` may have keys marked with :data:`NotRequired`, or it may inherit from another ``TypedDict`` with ``total=False``. Therefore, it is generally better to use :attr:`__required_keys__` and :attr:`__optional_keys__` for introspection.
pt_br: Esse atributo reflete *apenas* o valor do argumento ``total`` para a classe ``TypedDict`` atual, e não que a classe é semanticamente total. Por exemplo, um ``TypedDict`` com ``__total__`` definido como ``True`` pode ter chaves marcadas com :data:`NotRequired`, ou pode herdar de outro ``TypedDict`` com ``total=False``. Portanto, geralmente é melhor usar :attr:`__required_keys__` e :attr:`__optional_keys__` para introspecção.

source: ``Point2D.__required_keys__`` and ``Point2D.__optional_keys__`` return :class:`frozenset` objects containing required and non-required keys, respectively.
pt_br: ``Point2D.__required_keys__`` e ``Point2D.__optional_keys__`` retornam objetos :class:`frozenset` contendo chaves obrigatórias e opcionais, respectivamente.

source: Keys marked with :data:`Required` will always appear in ``__required_keys__`` and keys marked with :data:`NotRequired` will always appear in ``__optional_keys__``.
pt_br: As chaves marcadas com :data:`Required` sempre aparecerão em ``__required_keys__`` e as chaves marcadas com :data:`NotRequired` sempre aparecerão em ``__optional_keys__``.

source: For backwards compatibility with Python 3.10 and below, it is also possible to use inheritance to declare both required and non-required keys in the same ``TypedDict`` . This is done by declaring a ``TypedDict`` with one value for the ``total`` argument and then inheriting from it in another ``TypedDict`` with a different value for ``total``:
pt_br: Para manter a retrocompatibilidade com Python 3.10 e versões anteriores, também é possível usar herança para declarar chaves obrigatórias e opcionais no mesmo ``TypedDict``. Isso é feito declarando um ``TypedDict`` com um valor para o argumento ``total`` e então herdando-a em outro ``TypedDict`` usando um valor ``total`` diferente:

source: If ``from __future__ import annotations`` is used or if annotations are given as strings, annotations are not evaluated when the ``TypedDict`` is defined. Therefore, the runtime introspection that ``__required_keys__`` and ``__optional_keys__`` rely on may not work properly, and the values of the attributes may be incorrect.
pt_br: Se ``from __future__ import annotations`` for usado ou se anotações forem fornecidas como strings, as anotações não serão avaliadas quando o ``TypedDict`` for definido. Portanto, a introspecção em tempo de execução da qual ``__required_keys__`` e ``__optional_keys__`` dependem pode não funcionar corretamente, e os valores dos atributos podem estar incorretos.

source: Support for :data:`ReadOnly` is reflected in the following attributes:
pt_br: O suporte para :data:`ReadOnly` está refletido nos seguintes atributos:

source: A :class:`frozenset` containing the names of all read-only keys. Keys are read-only if they carry the :data:`ReadOnly` qualifier.
pt_br: Um :class:`frozenset` contendo os nomes de todas as chaves somente para leitura. As chaves são somente para leitura se tiverem o qualificador :data:`ReadOnly`.

source: A :class:`frozenset` containing the names of all mutable keys. Keys are mutable if they do not carry the :data:`ReadOnly` qualifier.
pt_br: Um :class:`frozenset` contendo os nomes de todas as chaves mutáveis. As chaves são mutáveis se não tiverem o qualificador :data:`ReadOnly`.

source: See the `TypedDict <https://typing.python.org/en/latest/spec/typeddict.html#typeddict>`_ section in the typing documentation for more examples and detailed rules.
pt_br: Consulte a seção `TypedDict <https://typing.python.org/en/latest/spec/typeddict.html#typeddict>`_ na documentação de tipagem para obter mais exemplos e regras detalhadas.

source: Added support for marking individual keys as :data:`Required` or :data:`NotRequired`. See :pep:`655`.
pt_br: Adicionado suporte para marcar chaves individuais como :data:`Required` ou :data:`NotRequired`. Consulte :pep:`655`.

source: Added support for generic ``TypedDict``\ s.
pt_br: Adicionado suporte para ``TypedDict``\ s genéricos.

source: Removed support for the keyword-argument method of creating ``TypedDict``\ s.
pt_br: Removeu suporte para o método de argumento nomeado para criar ``TypedDict``\ s.

source: Support for the :data:`ReadOnly` qualifier was added.
pt_br: Adiciona suporte ao qualificador :data:`ReadOnly`.

source: When using the functional syntax to create a TypedDict class, failing to pass a value to the 'fields' parameter (``TD = TypedDict("TD")``) is deprecated. Passing ``None`` to the 'fields' parameter (``TD = TypedDict("TD", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a TypedDict class with 0 fields, use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})``.
pt_br: Ao usar a sintaxe funcional para criar uma classe TypedDict, não passar um valor para o parâmetro 'fields' (``TD = TypedDict("TD")``) está descontinuado. Passar ``None`` para o parâmetro 'fields' (``TD = TypedDict("TD", None)``) também está descontinuado. Ambos não serão permitidos em Python 3.15. Para criar uma classe TypedDict com 0 campos, use ``class TD(TypedDict): pass`` ou ``TD = TypedDict("TD", {})``.

source: Protocols
pt_br: Protocolos

source: The following protocols are provided by the :mod:`!typing` module. All are decorated with :func:`@runtime_checkable <runtime_checkable>`.
pt_br: Os protocolos a seguir são fornecidos pelo módulo :mod:`!typing`. Todos são decorados com :func:`@runtime_checkable <runtime_checkable>`.

source: An ABC with one abstract method ``__abs__`` that is covariant in its return type.
pt_br: Um ABC com um método abstrato ``__abs__`` que é covariante em seu tipo de retorno.

source: An ABC with one abstract method ``__bytes__``.
pt_br: Um ABC com um método abstrato ``__bytes__``.

source: An ABC with one abstract method ``__complex__``.
pt_br: Um ABC com um método abstrato ``__complex__``.

source: An ABC with one abstract method ``__float__``.
pt_br: Um ABC com um método abstrato ``__float__``.

source: An ABC with one abstract method ``__index__``.
pt_br: Um ABC com um método abstrato ``__index__``.

source: An ABC with one abstract method ``__int__``.
pt_br: Um ABC com um método abstrato ``__int__``.

source: An ABC with one abstract method ``__round__`` that is covariant in its return type.
pt_br: Uma ABC com um método abstrato ``__round__`` que é covariante em seu tipo de retorno.

source: ABCs and Protocols for working with I/O
pt_br: ABCs e protocolos para trabalhar com E/S

source: Generic class ``IO[AnyStr]`` and its subclasses ``TextIO(IO[str])`` and ``BinaryIO(IO[bytes])`` represent the types of I/O streams such as returned by :func:`open`. Please note that these classes are not protocols, and their interface is fairly broad.
pt_br: A classe genérica ``IO[AnyStr]`` e suas subclasses ``TextIO(IO[str])`` e ``BinaryIO(IO[bytes])`` representam os tipos de fluxos de E/S, como os retornados por :func:`open`. Note que essas classes não são protocolos e sua interface é bem ampla.

source: The protocols :class:`io.Reader` and :class:`io.Writer` offer a simpler alternative for argument types, when only the ``read()`` or ``write()`` methods are accessed, respectively::
pt_br: Os protocolos :class:`io.Reader` e :class:`io.Writer` oferecem uma alternativa mais simples para tipos de argumentos, quando apenas os métodos ``read()`` ou ``write()`` são acessados, respectivamente::

source: Also consider using :class:`collections.abc.Iterable` for iterating over the lines of an input stream::
pt_br: Considere também usar :class:`collections.abc.Iterable` para iterar sobre as linhas de um fluxo de entrada::

source: Functions and decorators
pt_br: Funções e decoradores

source: Cast a value to a type.
pt_br: Converta um valor em um tipo.

source: This returns the value unchanged. To the type checker this signals that the return value has the designated type, but at runtime we intentionally don't check anything (we want this to be as fast as possible).
pt_br: Isso retorna o valor inalterado. Para o verificador de tipos, isso indica que o valor de retorno tem o tipo designado, mas em tempo de execução não verificamos nada intencionalmente (queremos que isso seja o mais rápido possível).

source: Ask a static type checker to confirm that *val* has an inferred type of *typ*.
pt_br: Pede para um verificador de tipo estático confirmar se *val* tem tipo inferido *typ*.

source: At runtime this does nothing: it returns the first argument unchanged with no checks or side effects, no matter the actual type of the argument.
pt_br: Essa função faz nada em tempo de execução: ela retorna o primeiro argumento inalterado, sem verificações ou efeitos colaterais, independentemente do tipo real do argumento.

source: When a static type checker encounters a call to ``assert_type()``, it emits an error if the value is not of the specified type::
pt_br: Quando um verificador de tipo estático encontra uma chamada para ``assert_type()``, ele emite um erro se o valor não for do tipo especificado::

source: def greet(name: str) -> None: assert_type(name, str) # OK, inferred type of `name` is `str` assert_type(name, int) # type checker error
pt_br: def greet(name: str) -> None: assert_type(name, str) # OK, o tipo inferido de `name` é `str` assert_type(name, int) # erro no verificador de tipos

source: This function is useful for ensuring the type checker's understanding of a script is in line with the developer's intentions::
pt_br: Esse função é útil para garantir que o verificador de tipos entende um script conforme as intenções do desenvolvedor::

source: def complex_function(arg: object): # Do some complex type-narrowing logic, # after which we hope the inferred type will be `int` ... # Test whether the type checker correctly understands our function assert_type(arg, int)
pt_br: def complex_function(arg: object): # Realiza alguma lógica complexa de restrição de tipos # após a qual esperamos que o tipo seja `int` ... # Testa se o verificador de tipos entendeu nossa função corretamente assert_type(arg, int)

source: Ask a static type checker to confirm that a line of code is unreachable.
pt_br: Pede ao verificador de tipo estático para confirmar se uma linha de código é inalcançável.

source: Example::
pt_br: Exemplo::

source: def int_or_str(arg: int | str) -> None: match arg: case int(): print("It's an int") case str(): print("It's a str") case _ as unreachable: assert_never(unreachable)
pt_br: def int_or_str(arg: int | str) -> None: match arg: case int(): print("É um int") case str(): print("É um str") case _ as unreachable: assert_never(unreachable)

source: Here, the annotations allow the type checker to infer that the last case can never execute, because ``arg`` is either an :class:`int` or a :class:`str`, and both options are covered by earlier cases.
pt_br: Aqui, as anotações permitem que o verificador de tipos deduza que o último caso nunca será executado, pois ``arg`` é um :class:`int` ou uma :class:`str`, e ambas as opções são cobertas por casos anteriores.

source: If a type checker finds that a call to ``assert_never()`` is reachable, it will emit an error. For example, if the type annotation for ``arg`` was instead ``int | str | float``, the type checker would emit an error pointing out that ``unreachable`` is of type :class:`float`. For a call to ``assert_never`` to pass type checking, the inferred type of the argument passed in must be the bottom type, :data:`Never`, and nothing else.
pt_br: Se um verificador de tipos descobrir que uma chamada para ``assert_never()`` é alcançável, ele emitirá um erro. Por exemplo, se a anotação de tipo para ``arg`` fosse ``int | str | float``, o verificador de tipos emitiria um erro indicando que ``unreachable`` é do tipo :class:`float`. Para que uma chamada para ``assert_never`` passe verificação de tipos, o tipo inferido do argumento passado deve ser o tipo inferior, :data:`Never`, e nada mais.

source: At runtime, this throws an exception when called.
pt_br: Em tempo de execução, essa função levanta uma exceção quando chamada.

source: `Unreachable Code and Exhaustiveness Checking <https://typing.python.org/en/latest/guides/unreachable.html>`__ has more information about exhaustiveness checking with static typing.
pt_br: `Unreachable Code and Exhaustiveness Checking <https://tipagem.Python.org/en/latest/guides/unreachable.html>`__ tem mais informações sobre a verificação de exaustividade com tipagem estática.

source: Ask a static type checker to reveal the inferred type of an expression.
pt_br: Pede para um verificador de tipo estático revelar o tipo inferido de uma expressão.

source: When a static type checker encounters a call to this function, it emits a diagnostic with the inferred type of the argument. For example::
pt_br: Quando um verificador de tipo estático encontra uma chamada para essa função, ele emite um diagnóstico com o tipo inferido do argumento. Por exemplo::

source: x: int = 1 reveal_type(x) # Revealed type is "builtins.int"
pt_br: x: int = 1 reveal_type(x) # O tipo revelado é "builtins.int"

source: This can be useful when you want to debug how your type checker handles a particular piece of code.
pt_br: Isso pode ser útil quando você deseja depurar como o verificador de tipos lida com um determinado trecho de código.
