Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: The type of class objects
pt_br: O tipo de objetos de classe

source: A variable annotated with ``C`` may accept a value of type ``C``. In contrast, a variable annotated with ``type[C]`` (or deprecated :class:`typing.Type[C] <Type>`) may accept values that are classes themselves -- specifically, it will accept the *class object* of ``C``. For example::
pt_br: Uma variável anotada com ``C`` pode aceitar um valor de tipo ``C``. Por outro lado, uma variável anotada com ``type[C]`` (ou o tipo descontinuado :class:`typing.Type[C] <Type>`) pode aceitar valores que são as próprias classes -- mais especificamente, ela aceitará o *objeto classe* de ``C``. Por exemplo::

source: a = 3 # Has type ``int`` b = int # Has type ``type[int]`` c = type(a) # Also has type ``type[int]``
pt_br: a = 3 # Tem tipo ``int`` b = int # Tem tipo ``type[int]`` c = type(a) # Também tem tipo ``type[int]``

source: Note that ``type[C]`` is covariant::
pt_br: Observe que ``type[C]`` é covariante::

source: class User: ... class ProUser(User): ... class TeamUser(User): ... def make_new_user(user_class: type[User]) -> User: # ... return user_class() make_new_user(User) # OK make_new_user(ProUser) # Also OK: ``type[ProUser]`` is a subtype of ``type[User]`` make_new_user(TeamUser) # Still fine make_new_user(User()) # Error: expected ``type[User]`` but got ``User`` make_new_user(int) # Error: ``type[int]`` is not a subtype of ``type[User]``
pt_br: class User: ... class ProUser(User): ... class TeamUser(User): ... def make_new_user(user_class: type[User]) -> User: # ... return user_class() make_new_user(User) # OK make_new_user(ProUser) # Também OK: ``type[ProUser]`` é subtipo de ``type[User]`` make_new_user(TeamUser) # Tudo bem make_new_user(User()) # Erro: esperava-se ``type[User]`` mas retornou ``User`` make_new_user(int) # Erro: ``type[int]`` não é subtipo de ``type[User]``

source: The only legal parameters for :class:`type` are classes, :data:`Any`, :ref:`type variables <generics>`, and unions of any of these types. For example::
pt_br: Os únicos parâmetros válidos para :class:`type` são classes, :data:`Any`, :ref:`type variables <generics>` e uniões de qualquer um desses tipos. Por exemplo::

source: def new_non_team_user(user_class: type[BasicUser | ProUser]): ... new_non_team_user(BasicUser) # OK new_non_team_user(ProUser) # OK new_non_team_user(TeamUser) # Error: ``type[TeamUser]`` is not a subtype # of ``type[BasicUser | ProUser]`` new_non_team_user(User) # Also an error
pt_br: def new_non_team_user(user_class: type[BasicUser | ProUser]): ... new_non_team_user(BasicUser) # OK new_non_team_user(ProUser) # OK new_non_team_user(TeamUser) # Erro: ``type[TeamUser]`` não é subtipo # de ``type[BasicUser | ProUser]`` new_non_team_user(User) # Também é um erro

source: ``type[Any]`` is equivalent to :class:`type`, which is the root of Python's :ref:`metaclass hierarchy <metaclasses>`.
pt_br: ``type[Any]`` é equivalente a :class:`type`, que é a raiz da :ref:`hierarquia de metaclasses <metaclasses>` do Python.

source: Annotating generators and coroutines
pt_br: Anotando geradores e corrotinas

source: A generator can be annotated using the generic type :class:`Generator[YieldType, SendType, ReturnType] <collections.abc.Generator>`. For example::
pt_br: Um gerador pode ser anotado usando um tipo genérico :class:`Generator[YieldType, SendType, ReturnType] <collections.abc.Generator>`. Por exemplo::

source: Note that unlike many other generic classes in the standard library, the ``SendType`` of :class:`~collections.abc.Generator` behaves contravariantly, not covariantly or invariantly.
pt_br: Note que, diferentemente de outras classes genéricas na biblioteca padrão, o ``SendType`` da classe :class:`~collections.abc.Generator` se comporta contravariantemente, em vez de covariantemente ou invariantemente.

source: The ``SendType`` and ``ReturnType`` parameters default to :const:`!None`::
pt_br: Os parâmetros ``SendType`` e ``ReturnType`` são :const:`!None` por padrão::

source: It is also possible to set these types explicitly::
pt_br: Também é possível definir esses tipos explicitamente::

source: Simple generators that only ever yield values can also be annotated as having a return type of either :class:`Iterable[YieldType] <collections.abc.Iterable>` or :class:`Iterator[YieldType] <collections.abc.Iterator>`::
pt_br: Geradores simples que só produzem valores também podem ser anotados com tipo de retorno :class:`Iterable[YieldType] <collections.abc.Iterable>` ou :class:`Iterator[YieldType] <collections.abc.Iterator>`::

source: Async generators are handled in a similar fashion, but don't expect a ``ReturnType`` type argument (:class:`AsyncGenerator[YieldType, SendType] <collections.abc.AsyncGenerator>`). The ``SendType`` argument defaults to :const:`!None`, so the following definitions are equivalent::
pt_br: Geradores assíncronos são manipulados similarmente, mas não espere um argumento de tipo ``ReturnType`` (:class:`AsyncGenerator[YieldType, SendType] <collections.abc.AsyncGenerator>`). O argumento ``SendType`` é :const:`!None` por padrão, então as seguintes definições são equivalentes::

source: As in the synchronous case, :class:`AsyncIterable[YieldType] <collections.abc.AsyncIterable>` and :class:`AsyncIterator[YieldType] <collections.abc.AsyncIterator>` are available as well::
pt_br: Como no caso síncrono, :class:`AsyncIterable[YieldType] <collections.abc.AsyncIterable>` e :class:`AsyncIterator[YieldType] <collections.abc.AsyncIterator>` também estão disponíveis::

source: Coroutines can be annotated using :class:`Coroutine[YieldType, SendType, ReturnType] <collections.abc.Coroutine>`. Generic arguments correspond to those of :class:`~collections.abc.Generator`, for example::
pt_br: Corrotinas podem ser anotadas usando :class:`Coroutine[YieldType, SendType, ReturnType] <collections.abc.Coroutine>`. Argumentos genéricos correspondem àqueles da classe :class:`~collections.abc.Generator`, por exemplo::

source: from collections.abc import Coroutine c: Coroutine[list[str], str, int] # Some coroutine defined elsewhere x = c.send('hi') # Inferred type of 'x' is list[str] async def bar() -> None: y = await c # Inferred type of 'y' is int
pt_br: from collections.abc import Coroutine c: Coroutine[list[str], str, int] # Uma corrotina defina em outro lugar x = c.send('hi') # Tipo inferido de 'x' é list[str] async def bar() -> None: y = await c # Tipo inferido de 'y' é int

source: User-defined generic types
pt_br: Tipos genéricos definidos pelo usuário

source: A user-defined class can be defined as a generic class.
pt_br: Uma classe definida pelo usuário pode ser definida como uma classe genérica.

source: This syntax indicates that the class ``LoggedVar`` is parameterised around a single :ref:`type variable <typevar>` ``T`` . This also makes ``T`` valid as a type within the class body.
pt_br: Esta sintaxe indica que o classe ``LoggedVar`` é parametrizada em torno de uma única :ref:`type variable <typevar>` ``T``. Isso também torna ``T`` válido como um tipo dentro do corpo da classe.

source: Generic classes implicitly inherit from :class:`Generic`. For compatibility with Python 3.11 and lower, it is also possible to inherit explicitly from :class:`Generic` to indicate a generic class::
pt_br: Classes genéricas implicitamente herdar de :class:`Generic`. Para compatibilidade com Python 3.11 e versões inferiores, também é possível herdar explicitamente de :class:`Generic` para indicar uma classe genérica::

source: Generic classes have :meth:`~object.__class_getitem__` methods, meaning they can be parameterised at runtime (e.g. ``LoggedVar[int]`` below)::
pt_br: Classes genéricas têm métodos :meth:`~object.__class_getitem__`, o que significa que podem ser parametrizadas em tempo de execução (por exemplo, ``LoggedVar[int]`` abaixo)::

source: A generic type can have any number of type variables. All varieties of :class:`TypeVar` are permissible as parameters for a generic type::
pt_br: Um tipo genérico pode ter qualquer número de tipos de variáveis. Todas as variedades de :class:`TypeVar` são permitidas como parâmetros para um tipo genérico::

source: Each type variable argument to :class:`Generic` must be distinct. This is thus invalid::
pt_br: Cada tipo dos argumentos para :class:`Generic` devem ser distintos. Assim, os seguintes exemplos são inválidos::

source: from typing import TypeVar, Generic ... class Pair[M, M]: # SyntaxError ... T = TypeVar('T') class Pair(Generic[T, T]): # INVALID ...
pt_br: from typing import TypeVar, Generic ... class Pair[M, M]: # SyntaxError ... T = TypeVar('T') class Pair(Generic[T, T]): # INVÁLIDO ...

source: Generic classes can also inherit from other classes::
pt_br: Classes genéricas podem também herdar de outras classes::

source: When inheriting from generic classes, some type parameters could be fixed::
pt_br: Ao herdar das classes genérico, alguns tipos podem ser fixos::

source: In this case ``MyDict`` has a single parameter, ``T``.
pt_br: Neste caso ``MyDict`` possui um único parâmetro, ``T``.

source: Using a generic class without specifying type parameters assumes :data:`Any` for each position. In the following example, ``MyIterable`` is not generic but implicitly inherits from ``Iterable[Any]``:
pt_br: O uso de uma classe genérica sem especificar tipos pressupõe :data:`Any` para cada posição. No exemplo a seguir, ``MyIterable`` não é genérico, mas herda implicitamente de ``Iterable[Any]``:

source: from collections.abc import Iterable class MyIterable(Iterable): # Same as Iterable[Any] ...
pt_br: from collections.abc import Iterable class MyIterable(Iterable): # Igual a Iterable[Any] ...

source: User-defined generic type aliases are also supported. Examples::
pt_br: Também há suporte para tipos genéricos definidos pelo usuário. Exemplos::

source: from collections.abc import Iterable type Response[S] = Iterable[S] | int # Return type here is same as Iterable[str] | int def response(query: str) -> Response[str]: ... type Vec[T] = Iterable[tuple[T, T]] def inproduct[T: (int, float, complex)](v: Vec[T]) -> T: # Same as Iterable[tuple[T, T]] return sum(x*y for x, y in v)
pt_br: from collections.abc import Iterable type Response[S] = Iterable[S] | int # Tipo de retorno aqui é igual a Iterable[str] | int def response(query: str) -> Response[str]: ... type Vec[T] = Iterable[tuple[T, T]] def inproduct[T: (int, float, complex)](v: Vec[T]) -> T: # Igual a Iterable[tuple[T, T]] return sum(x*y for x, y in v)

source: For backward compatibility, generic type aliases can also be created through a simple assignment::
pt_br: Para manter retrocompatibilidade, os apelidos de tipos genéricos também podem ser criados usando atribuição::

source: :class:`Generic` no longer has a custom metaclass.
pt_br: :class:`Generic` não possui mais uma metaclasse personalizada.

source: Syntactic support for generics and type aliases is new in version 3.12. Previously, generic classes had to explicitly inherit from :class:`Generic` or contain a type variable in one of their bases.
pt_br: Suporte sintático para apelidos de tipo e genéricos é novo na versão 3.12. Anteriormente, as classes genéricas precisavam explicitamente herdar de :class:`Generic` ou conter um tipo de variável em uma de suas bases.

source: User-defined generics for parameter expressions are also supported via parameter specification variables in the form ``[**P]``. The behavior is consistent with type variables' described above as parameter specification variables are treated by the :mod:`!typing` module as a specialized type variable. The one exception to this is that a list of types can be used to substitute a :class:`ParamSpec`::
pt_br: Genéricos definidos pelo usuário para expressões de parâmetros também oferecem suporte por meio de variáveis de especificação de parâmetros no formato ``[**P]``. O comportamento é consistente com as variáveis de tipo descritas acima, pois as variáveis de especificação de parâmetro são tratadas pelo módulo :mod:`!typing` como uma variável de tipo especializada. A única exceção a isso é que uma lista de tipos pode ser usada para substituir um :class:`ParamSpec`::

source: >>> class Z[T, **P]: ... # T is a TypeVar; P is a ParamSpec ... >>> Z[int, [dict, float]] __main__.Z[int, [dict, float]]
pt_br: >>> class Z[T, **P]: ... # T é um TypeVar; P é um ParamSpec ... >>> Z[int, [dict, float]] __main__.Z[int, [dict, float]]

source: Classes generic over a :class:`ParamSpec` can also be created using explicit inheritance from :class:`Generic`. In this case, ``**`` is not used::
pt_br: Classes genéricas sobre um :class:`ParamSpec` também podem ser criadas usando herança explícita de :class:`Generic`. Neste caso, ``**`` não é usado::

source: Another difference between :class:`TypeVar` and :class:`ParamSpec` is that a generic with only one parameter specification variable will accept parameter lists in the forms ``X[[Type1, Type2, ...]]`` and also ``X[Type1, Type2, ...]`` for aesthetic reasons. Internally, the latter is converted to the former, so the following are equivalent::
pt_br: Outra diferença entre :class:`TypeVar` e :class:`ParamSpec` é que um genérico com apenas uma variável de especificação de parâmetro aceitará listas de parâmetros nos formatos ``X[[Type1, Type2, ...]]`` e também ``X[Type1, Type2, ...]`` por razões estéticas. Internamente, o último é convertido no primeiro, portanto são equivalentes::

source: Note that generics with :class:`ParamSpec` may not have correct ``__parameters__`` after substitution in some cases because they are intended primarily for static type checking.
pt_br: Observe que genéricos com :class:`ParamSpec` podem não ter ``__parameters__`` corretos após a substituição em alguns casos porque eles são destinados principalmente à verificação de tipo estático.

source: :class:`Generic` can now be parameterized over parameter expressions. See :class:`ParamSpec` and :pep:`612` for more details.
pt_br: :class:`Generic` agora pode ser parametrizado através de expressões de parâmetros. Veja :class:`ParamSpec` e :pep:`612` para mais detalhes.

source: A user-defined generic class can have ABCs as base classes without a metaclass conflict. Generic metaclasses are not supported. The outcome of parameterizing generics is cached, and most types in the :mod:`!typing` module are :term:`hashable` and comparable for equality.
pt_br: Uma classe genérica definida pelo usuário pode ter ABCs como classes base sem conflito de metaclasse. Não há suporte a metaclasses genéricas. O resultado da parametrização de genéricos é armazenado em cache, e a maioria dos tipos no módulo :mod:`!typing` são :term:`hasheáveis <hasheável>` e comparáveis em termos de igualdade.

source: The :data:`Any` type
pt_br: O tipo :data:`Any`

source: A special kind of type is :data:`Any`. A static type checker will treat every type as being compatible with :data:`Any` and :data:`Any` as being compatible with every type.
pt_br: Um tipo especial de tipo é :data:`Any`. Um verificador de tipo estático tratará cada tipo como sendo compatível com :data:`Any` e :data:`Any` como sendo compatível com todos os tipos.

source: This means that it is possible to perform any operation or method call on a value of type :data:`Any` and assign it to any variable::
pt_br: Isso significa que é possível realizar qualquer operação ou chamada de método sobre um valor do tipo :data:`Any` e atribuí-lo a qualquer variável::

source: from typing import Any a: Any = None a = [] # OK a = 2 # OK s: str = '' s = a # OK def foo(item: Any) -> int: # Passes type checking; 'item' could be any type, # and that type might have a 'bar' method item.bar() ...
pt_br: from typing import Any a: Any = None a = [] # OK a = 2 # OK s: str = '' s = a # OK def foo(item: Any) -> int: # Passa na verificação de tipos; 'item' pode ser qualquer tipo, # e esse tipo pode ter um método 'bar' item.bar() ...

source: Notice that no type checking is performed when assigning a value of type :data:`Any` to a more precise type. For example, the static type checker did not report an error when assigning ``a`` to ``s`` even though ``s`` was declared to be of type :class:`str` and receives an :class:`int` value at runtime!
pt_br: Observe que nenhuma verificação de tipo é realizada ao atribuir um valor do tipo :data:`Any` a um tipo mais preciso. Por exemplo, o verificador de tipo estático não relatou um erro ao atribuir ``a`` a ``s`` mesmo que ``s`` tenha sido declarado como sendo do tipo :class:`str` e receba um valor :class:`int` em tempo de execução!

source: Furthermore, all functions without a return type or parameter types will implicitly default to using :data:`Any`::
pt_br: Além disso, todas as funções sem um tipo de retorno ou tipos de parâmetro terão como padrão implicitamente o uso de :data:`Any`::

source: def legacy_parser(text): ... return data # A static type checker will treat the above # as having the same signature as: def legacy_parser(text: Any) -> Any: ... return data
pt_br: def legacy_parser(text): ... return data # Um verificador de tipo estático tratará a função acima # como tendo a mesma assinatura da função abaixo: def legacy_parser(text: Any) -> Any: ... return data

source: This behavior allows :data:`Any` to be used as an *escape hatch* when you need to mix dynamically and statically typed code.
pt_br: Este comportamento permite que :data:`Any` seja usado como uma *saída de emergência* quando você precisar misturar código tipado dinamicamente e estaticamente.

source: Contrast the behavior of :data:`Any` with the behavior of :class:`object`. Similar to :data:`Any`, every type is a subtype of :class:`object`. However, unlike :data:`Any`, the reverse is not true: :class:`object` is *not* a subtype of every other type.
pt_br: Compare o comportamento de :data:`Any` com o comportamento de :class:`object`. Semelhante a :data:`Any`, todo tipo é um subtipo de :class:`object`. No entanto, ao contrário de :data:`Any`, o inverso não é verdadeiro: :class:`object` *não* é um subtipo de qualquer outro tipo.

source: That means when the type of a value is :class:`object`, a type checker will reject almost all operations on it, and assigning it to a variable (or using it as a return value) of a more specialized type is a type error. For example::
pt_br: Isso significa que quando o tipo de um valor é :class:`object`, um verificador de tipo rejeitará quase todas as operações nele, e atribuí-lo a uma variável (ou usá-la como valor de retorno) de um tipo mais especializado é um tipo erro. Por exemplo::

source: def hash_a(item: object) -> int: # Fails type checking; an object does not have a 'magic' method. item.magic() ... def hash_b(item: Any) -> int: # Passes type checking item.magic() ... # Passes type checking, since ints and strs are subclasses of object hash_a(42) hash_a("foo") # Passes type checking, since Any is compatible with all types hash_b(42) hash_b("foo")
pt_br: def hash_a(item: object) -> int: # Falha na verificação de tipo; um 'object' não tem um método 'magic'. item.magic() ... def hash_b(item: Any) -> int: # Passa na verificação de tipo item.magic() ... # Passa na verificação de tipo, já que ints e strs são subclasses de 'object' hash_a(42) hash_a("foo") # Passa na verificação de tipo, já que Any é compatível com todos os tipos hash_b(42) hash_b("foo")

source: Use :class:`object` to indicate that a value could be any type in a typesafe manner. Use :data:`Any` to indicate that a value is dynamically typed.
pt_br: Use :class:`object` para indicar que um valor pode ser de qualquer tipo de maneira segura. Use :data:`Any` para indicar que um valor é tipado dinamicamente.

source: Nominal vs structural subtyping
pt_br: Subtipagem nominal vs estrutural

source: Initially :pep:`484` defined the Python static type system as using *nominal subtyping*. This means that a class ``A`` is allowed where a class ``B`` is expected if and only if ``A`` is a subclass of ``B``.
pt_br: Inicialmente a :pep:`484` definiu o sistema de tipos estáticos do Python como usando *subtipagem nominal*. Isto significa que uma classe ``A`` é permitida onde uma classe ``B`` é esperada se e somente se ``A`` for uma subclasse de ``B``.

source: This requirement previously also applied to abstract base classes, such as :class:`~collections.abc.Iterable`. The problem with this approach is that a class had to be explicitly marked to support them, which is unpythonic and unlike what one would normally do in idiomatic dynamically typed Python code. For example, this conforms to :pep:`484`::
pt_br: Este requisito anteriormente também se aplicava a classes base abstratas, como :class:`~collections.abc.Iterable`. O problema com essa abordagem é que uma classe teve que ser marcada explicitamente para suportá-los, o que não é pythônico e diferente do que normalmente seria feito em código Python de tipo dinamicamente idiomático. Por exemplo, isso está em conformidade com :pep:`484`::

source: :pep:`544` allows to solve this problem by allowing users to write the above code without explicit base classes in the class definition, allowing ``Bucket`` to be implicitly considered a subtype of both ``Sized`` and ``Iterable[int]`` by static type checkers. This is known as *structural subtyping* (or static duck-typing)::
pt_br: :pep:`544` permite resolver este problema permitindo que os usuários escrevam o código acima sem classes base explícitas na definição de classe, permitindo que ``Bucket`` seja implicitamente considerado um subtipo de ``Sized`` e ``Iterable[int]`` por verificador de tipo estático. Isso é conhecido como *subtipagem estrutural* (ou tipagem pato estática)::

source: from collections.abc import Iterator, Iterable class Bucket: # Note: no base classes ... def __len__(self) -> int: ... def __iter__(self) -> Iterator[int]: ... def collect(items: Iterable[int]) -> int: ... result = collect(Bucket()) # Passes type check
pt_br: from collections.abc import Iterator, Iterable class Bucket: # Nota: sem classes base ... def __len__(self) -> int: ... def __iter__(self) -> Iterator[int]: ... def collect(items: Iterable[int]) -> int: ... result = collect(Bucket()) # Passa na verificação de tipo

source: Moreover, by subclassing a special class :class:`Protocol`, a user can define new custom protocols to fully enjoy structural subtyping (see examples below).
pt_br: Além disso, ao criar uma subclasse de uma classe especial :class:`Protocol`, um usuário pode definir novos protocolos personalizados para aproveitar ao máximo a subtipagem estrutural (veja exemplos abaixo).

source: Module contents
pt_br: Conteúdo do módulo

source: The ``typing`` module defines the following classes, functions and decorators.
pt_br: O módulo ``typing`` define as seguintes classes, funções e decoracores.

source: Special typing primitives
pt_br: Tipos primitivos especiais

source: Special types
pt_br: Tipos especiais

source: These can be used as types in annotations. They do not support subscription using ``[]``.
pt_br: Eles podem ser usados como tipos em anotações. Eles não oferecem suporte a subscrição usando ``[]``.

source: Special type indicating an unconstrained type.
pt_br: Tipo especial que indica um tipo irrestrito.

source: Every type is compatible with :data:`Any`.
pt_br: Todos os tipos são compatíveis com :data:`Any`.

source: :data:`Any` is compatible with every type.
pt_br: :data:`Any` é compatível com todos os tipos.

source: :data:`Any` can now be used as a base class. This can be useful for avoiding type checker errors with classes that can duck type anywhere or are highly dynamic.
pt_br: :data:`Any` agora pode ser usado como classe base. Isso pode ser útil para evitar erros do verificador de tipo com classes que podem digitar em qualquer lugar ou são altamente dinâmicas.
