Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: If any forward references in the annotations of *obj* are not resolvable or are not valid Python code, this function will raise an exception such as :exc:`NameError`. For example, this can happen with imported :ref:`type aliases <type-aliases>` that include forward references, or with names imported under :data:`if TYPE_CHECKING <TYPE_CHECKING>`.
pt_br: Se alguma referência futura nas anotações de *obj* não for resolvível ou não for código Python válido, esta função levantará uma exceção como :exc:`NameError`. Por exemplo, isso pode acontecer com :ref:`apelidos de tipo <type-aliases>` importados que incluem referências futuras, ou com nomes importados em :data:`if TYPE_CHECKING <TYPE_CHECKING>`.

source: Added ``include_extras`` parameter as part of :pep:`593`. See the documentation on :data:`Annotated` for more information.
pt_br: Adiciona o parâmetro ``include_extras`` como parte da :pep:`593`. Consulte a documentação em :data:`Annotated` para mais informações.

source: Previously, ``Optional[t]`` was added for function and method annotations if a default value equal to ``None`` was set. Now the annotation is returned unchanged.
pt_br: Anteriormente, ``Optional[t]`` era adicionado a anotações de funções e métodos se um valor padrão igual a ``None`` fosse definido. Agora, a anotação é retornada inalterada.

source: Get the unsubscripted version of a type: for a typing object of the form ``X[Y, Z, ...]`` return ``X``.
pt_br: Obtenha o versão sem subscrição de um tipo: para um objeto cujo tipo tem a forma ``X[Y, Z, ...]``, retorna ``X`` .

source: If ``X`` is a typing-module alias for a builtin or :mod:`collections` class, it will be normalized to the original class. If ``X`` is an instance of :class:`ParamSpecArgs` or :class:`ParamSpecKwargs`, return the underlying :class:`ParamSpec`. Return ``None`` for unsupported objects.
pt_br: Se ``X`` for um apelido do módulo typing para uma classe embutida ou classe de :mod:`collections`, ele será normalizado para a classe original. Se ``X`` for uma instância de :class:`ParamSpecArgs` ou :class:`ParamSpecKwargs`, retorna o :class:`ParamSpec` subjacente. Retorna ``None`` para objetos incompatíveis.

source: Examples:
pt_br: Exemplos:

source: Get type arguments with all substitutions performed: for a typing object of the form ``X[Y, Z, ...]`` return ``(Y, Z, ...)``.
pt_br: Obtenha os argumentos de tipos com todas as substituições realizadas: para um objeto cujo tipo tem a forma ``X[Y, Z, ...]``, retorna ``(Y, Z, ...)`` .

source: If ``X`` is a union or :class:`Literal` contained in another generic type, the order of ``(Y, Z, ...)`` may be different from the order of the original arguments ``[Y, Z, ...]`` due to type caching. Return ``()`` for unsupported objects.
pt_br: Se ``X`` for uma união ou um :class:`Literal`, e estiver contido em outro tipo genérico, a ordem de ``(Y, Z, ...)`` poderá ser diferente da ordem dos argumentos originais ``[Y, Z, ...]`` devido ao armazenamento dos tipos em cache. Retorna ``()`` para objetos sem suporte.

source: Return the set of members defined in a :class:`Protocol`.
pt_br: Retorna o conjunto de membros definidos em um :class:`Protocol`.

source: Raise :exc:`TypeError` for arguments that are not Protocols.
pt_br: Levanta :exc:`TypeError` para argumentos que não são protocolos.

source: Determine if a type is a :class:`Protocol`.
pt_br: Determina se um tipo é um :class:`Protocol`.

source: Check if a type is a :class:`TypedDict`.
pt_br: Verifica se um tipo é um :class:`TypedDict`.

source: class Film(TypedDict): title: str year: int assert is_typeddict(Film) assert not is_typeddict(list | str) # TypedDict is a factory for creating typed dicts, # not a typed dict itself assert not is_typeddict(TypedDict)
pt_br: class Film(TypedDict): title: str year: int assert is_typeddict(Film) assert not is_typeddict(list | str) # TypedDict é uma fábrica para criar dicionários tipados # e não um dicionário tipado em si. assert not is_typeddict(TypedDict)

source: Class used for internal typing representation of string forward references.
pt_br: Classe usada para representação de tipagem interna de referências futuras como strings.

source: For example, ``List["SomeClass"]`` is implicitly transformed into ``List[ForwardRef("SomeClass")]``. :class:`!ForwardRef` should not be instantiated by a user, but may be used by introspection tools.
pt_br: Por exemplo, ``List["AlgumaClasse"]`` é implicitamente transformado em ``List[ForwardRef("AlgumaClasse")]``. :class:`!ForwardRef` não deve ser instanciada por um usuário, mas pode ser usada por ferramentas de introspecção.

source: :pep:`585` generic types such as ``list["SomeClass"]`` will not be implicitly transformed into ``list[ForwardRef("SomeClass")]`` and thus will not automatically resolve to ``list[SomeClass]``.
pt_br: Tipos genéricos da :pep:`585` como ``list["SomeClass"]`` não serão transformados implicitamente em ``list[ForwardRef("SomeClass")]`` e, portanto, não serão resolvidos automaticamente para ``list[SomeClass]``.

source: This is now an alias for :class:`annotationlib.ForwardRef`. Several undocumented behaviors of this class have been changed; for example, after a ``ForwardRef`` has been evaluated, the evaluated value is no longer cached.
pt_br: Este agora é um apelido para :class:`annotationlib.ForwardRef`. Vários comportamentos não documentados desta classe foram alterados; por exemplo, após a avaliação de um ``ForwardRef``, o valor avaliado não é mais armazenado em cache.

source: Evaluate an :class:`annotationlib.ForwardRef` as a :term:`type hint`.
pt_br: Avalia um :class:`annotationlib.ForwardRef` como um :term:`dica de tipo`.

source: This is similar to calling :meth:`annotationlib.ForwardRef.evaluate`, but unlike that method, :func:`!evaluate_forward_ref` also recursively evaluates forward references nested within the type hint.
pt_br: Isso é semelhante a chamar :meth:`annotationlib.ForwardRef.evaluate`, mas diferentemente desse método, :func:`!evaluate_forward_ref` também avalia recursivamente referências futuras aninhadas dentro da dica de tipo.

source: See the documentation for :meth:`annotationlib.ForwardRef.evaluate` for the meaning of the *owner*, *globals*, *locals*, *type_params*, and *format* parameters.
pt_br: Consulte a documentação de :meth:`annotationlib.ForwardRef.evaluate` para saber o significado dos parâmetros *owner*, *globals*, *locals*, *type_params* e *format*.

source: A sentinel object used to indicate that a type parameter has no default value. For example:
pt_br: Um objeto sinalizador usado para indicar que um parâmetro de tipo não possui valor-padrão. Por exemplo::

source: Constant
pt_br: Constante

source: A special constant that is assumed to be ``True`` by 3rd party static type checkers. It's ``False`` at runtime.
pt_br: Uma constante especial presumida ser ``True`` por verificadores de tipo estático de terceiros. É ``False`` em tempo de execução.

source: A module which is expensive to import, and which only contain types used for typing annotations, can be safely imported inside an ``if TYPE_CHECKING:`` block. This prevents the module from actually being imported at runtime; annotations aren't eagerly evaluated (see :pep:`649`) so using undefined symbols in annotations is harmless--as long as you don't later examine them. Your static type analysis tool will set ``TYPE_CHECKING`` to ``True`` during static type analysis, which means the module will be imported and the types will be checked properly during such analysis.
pt_br: Um módulo cuja importação é cara e que contém apenas tipos usados para anotações de tipagem pode ser importado com segurança dentro de um bloco ``if TYPE_CHECKING:``. Isso impede que o módulo seja importado em tempo de execução; anotações não são avaliadas de forma ansiosa (veja :pep:`649`), portanto, usar símbolos indefinidos em anotações é inofensivo -- desde que você não os examine posteriormente. Sua ferramenta de análise de tipos estáticos definirá ``TYPE_CHECKING`` como ``True`` durante a análise de tipos estáticos, o que significa que o módulo será importado e os tipos serão verificados corretamente durante essa análise.

source: If you occasionally need to examine type annotations at runtime which may contain undefined symbols, use :meth:`annotationlib.get_annotations` with a ``format`` parameter of :attr:`annotationlib.Format.STRING` or :attr:`annotationlib.Format.FORWARDREF` to safely retrieve the annotations without raising :exc:`NameError`.
pt_br: Se você ocasionalmente precisar examinar anotações de tipo em tempo de execução que podem conter símbolos indefinidos, use :meth:`annotationlib.get_annotations` com um parâmetro ``format`` de :attr:`annotationlib.Format.STRING` ou :attr:`annotationlib.Format.FORWARDREF` para recuperar as anotações com segurança sem levantar :exc:`NameError`.

source: Deprecated aliases
pt_br: Apelidos descontinuados

source: This module defines several deprecated aliases to pre-existing standard library classes. These were originally included in the :mod:`!typing` module in order to support parameterizing these generic classes using ``[]``. However, the aliases became redundant in Python 3.9 when the corresponding pre-existing classes were enhanced to support ``[]`` (see :pep:`585`).
pt_br: Este módulo define vários apelidos descontinuados de classes pré-existentes da biblioteca padrão. Originalmente, elas eram incluídas no módulo :mod:`!typing` para permitir a parametrização dessas classes genéricas usando ``[]``. Porém, os apelidos se tornaram redundantes no Python 3.9, quando as classes pré-existentes correspondentes passaram a dar suporte a ``[]`` (consulte a :pep:`585`).

source: The redundant types are deprecated as of Python 3.9. However, while the aliases may be removed at some point, removal of these aliases is not currently planned. As such, no deprecation warnings are currently issued by the interpreter for these aliases.
pt_br: Os tipos redundantes estão descontinuados desde Python 3.9. No entanto, enquanto os apelidos podem ser removidos em algum momento, essa remoção desses apelidos não está planejada. Assim, nenhum aviso de descontinuação será enviado pelo interpretador para esses apelidos.

source: If at some point it is decided to remove these deprecated aliases, a deprecation warning will be issued by the interpreter for at least two releases prior to removal. The aliases are guaranteed to remain in the :mod:`!typing` module without deprecation warnings until at least Python 3.14.
pt_br: Se em algum momento decidirem remover esses apelidos descontinuados, o interpretador emitirá um aviso de descontinuação por, no mínimo, duas versões de lançamento antes da remoção. Os apelidos são garantidos a permanecerem no módulo :mod:`!typing` sem avisos de descontinuação até, no mínimo, Python 3.14.

source: Type checkers are encouraged to flag uses of the deprecated types if the program they are checking targets a minimum Python version of 3.9 or newer.
pt_br: Verificadores de tipos são encorajados a sinalizar o uso de tipos descontinuados se o programa que estão verificando respeita uma versão mínima de Python 3.9 ou mais nova.

source: Aliases to built-in types
pt_br: Apelidos de tipos embutidos

source: Deprecated alias to :class:`dict`.
pt_br: Apelido descontinuado de :class:`dict`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Mapping` rather than to use :class:`dict` or :class:`!typing.Dict`.
pt_br: Note que, para anotar argumentos, prefere-se usar um tipo de coleção abstrata como :class:`~collections.abc.Mapping` em vez de :class:`dict` ou :class:`!typing.Dict`.

source: :class:`builtins.dict <dict>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`builtins.dict <dict>` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`list`.
pt_br: Apelido descontinuado de :class:`list`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Sequence` or :class:`~collections.abc.Iterable` rather than to use :class:`list` or :class:`!typing.List`.
pt_br: Note que, para anotar argumentos, é preferível usar um tipo de coleção abstrata, como :class:`~collections.abc.Sequence` ou :class:`~collections.abc.Iterable`, em vez de :class:`list` ou :class:`!typing.List`.

source: :class:`builtins.list <list>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`builtins.list <list>` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.set <set>`.
pt_br: Apelido descontinuado de :class:`builtins.set <set>`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`collections.abc.Set` rather than to use :class:`set` or :class:`typing.Set`.
pt_br: Note que, para anotar argumentos, prefere-se usar um tipo de coleção abstrata como :class:`collections.abc.Set` em vez de :class:`set` ou :class:`typing.Set`.

source: :class:`builtins.set <set>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`builtins.set <set>` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.frozenset <frozenset>`.
pt_br: Apelido descontinuado de :class:`builtins.frozenset <frozenset>`.

source: :class:`builtins.frozenset <frozenset>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`builtins.frozenset <frozenset>` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias for :class:`tuple`.
pt_br: Apelido descontinuado para :class:`tuple`.

source: :class:`tuple` and ``Tuple`` are special-cased in the type system; see :ref:`annotating-tuples` for more details.
pt_br: :class:`tuple` e ``Tuple`` são casos especiais no sistema de tipos; consulte :ref:`annotating-tuples` para obter mais detalhes.

source: :class:`builtins.tuple <tuple>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`builtins.tuple <tuple>` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`type`.
pt_br: Apelido descontinuado de :class:`type`.

source: See :ref:`type-of-class-objects` for details on using :class:`type` or ``typing.Type`` in type annotations.
pt_br: Consulte :ref:`type-of-class-objects` para obter detalhes sobre como usar :class:`type` ou ``typing.Type`` em anotações de tipos.

source: :class:`builtins.type <type>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`builtins.type <type>` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Aliases to types in :mod:`collections`
pt_br: Apelidos para tipos em :mod:`collections`

source: Deprecated alias to :class:`collections.defaultdict`.
pt_br: Apelido descontinuado de :class:`collections.defaultdict`.

source: :class:`collections.defaultdict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.defaultdict` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.OrderedDict`.
pt_br: Apelido descontinuado de :class:`collections.OrderedDict`.

source: :class:`collections.OrderedDict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.OrderedDict` agora oferece suporte a subscrição (``[]``). consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.ChainMap`.
pt_br: Apelido descontinuado de :class:`collections.ChainMap`.

source: :class:`collections.ChainMap` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.ChainMap` agora oferece suporte a subscrição (``[]``). consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.Counter`.
pt_br: Apelido descontinuado de :class:`collections.Counter`.

source: :class:`collections.Counter` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.Counter` agora oferece suporte a subscrição (``[]``). consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.deque`.
pt_br: Apelido descontinuado de :class:`collections.deque`.

source: :class:`collections.deque` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.deque` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Aliases to other concrete types
pt_br: Apelidos de outros tipos concretos

source: Deprecated aliases corresponding to the return types from :func:`re.compile` and :func:`re.match`.
pt_br: Apelidos descontinuados correspondem aos tipos de retorno de :func:`re.compile` e :func:`re.match`.

source: These types (and the corresponding functions) are generic over :data:`AnyStr`. ``Pattern`` can be specialised as ``Pattern[str]`` or ``Pattern[bytes]``; ``Match`` can be specialised as ``Match[str]`` or ``Match[bytes]``.
pt_br: Esses tipos (e as funções correspondentes) são genéricas sobre :data:`AnyStr`. ``Pattern`` pode ser especializado como ``Pattern[str]`` ou ``Pattern[bytes]``; ``Match`` pode ser especializado como ``Match[str]`` ou ``Match[bytes]``.

source: Classes ``Pattern`` and ``Match`` from :mod:`re` now support ``[]``. See :pep:`585` and :ref:`types-genericalias`.
pt_br: Classes ``Pattern`` e ``Match`` de :mod:`re` agora suporte ``[]``. Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias for :class:`str`.
pt_br: Apelido descontinuado de :class:`str`.

source: ``Text`` is provided to supply a forward compatible path for Python 2 code: in Python 2, ``Text`` is an alias for ``unicode``.
pt_br: ``Text`` é fornecida para servir como um caminho compatível com versões futuras para código em Python 2: no Python 2, ``Text`` é um apelido para ``unicode``.

source: Use ``Text`` to indicate that a value must contain a unicode string in a manner that is compatible with both Python 2 and Python 3::
pt_br: Use ``Text`` para indicar que um valor deve conter uma string unicode de forma compatível com Python 2 e Python 3::

source: Python 2 is no longer supported, and most type checkers also no longer support type checking Python 2 code. Removal of the alias is not currently planned, but users are encouraged to use :class:`str` instead of ``Text``.
pt_br: Python 2 deixou de receber suporte, e a maioria dos verificadores de tipos também não oferece suporte à verificação de tipos de código de Python 2. A remoção do apelido não está planejada no momento, mas os usuários são incentivados a usar :class:`str` em vez de ``Text``.

source: Aliases to container ABCs in :mod:`collections.abc`
pt_br: Apelidos de contêineres ABC em :mod:`collections.abc`.

source: Deprecated alias to :class:`collections.abc.Set`.
pt_br: Apelido descontinuado de :class:`collections.abc.Set`.

source: :class:`collections.abc.Set` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Set` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Collection`.
pt_br: Apelido descontinuado de :class:`collections.abc.Collection`.

source: :class:`collections.abc.Collection` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Collection` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Container`.
pt_br: Apelido descontinuado de :class:`collections.abc.Container`.

source: :class:`collections.abc.Container` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Container` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ItemsView`.
pt_br: Apelido descontinuado de :class:`collections.abc.ItemsView`.

source: :class:`collections.abc.ItemsView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.ItemsView` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.KeysView`.
pt_br: Apelido descontinuado de :class:`collections.abc.KeysView`.

source: :class:`collections.abc.KeysView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.KeysView` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Mapping`.
pt_br: Apelido descontinuado de :class:`collections.abc.Mapping`.

source: :class:`collections.abc.Mapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Mapping` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MappingView`.
pt_br: Apelido descontinuado de :class:`collections.abc.MappingView`.

source: :class:`collections.abc.MappingView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.MappingView` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableMapping`.
pt_br: Apelido descontinuado de :class:`collections.abc.MutableMapping`.

source: :class:`collections.abc.MutableMapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.MutableMapping` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSequence`.
pt_br: Apelido descontinuado de :class:`collections.abc.MutableSequence`.

source: :class:`collections.abc.MutableSequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.MutableSequence` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSet`.
pt_br: Apelido descontinuado de :class:`collections.abc.MutableSet`.

source: :class:`collections.abc.MutableSet` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.MutableSet` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sequence`.
pt_br: Apelido descontinuado de :class:`collections.abc.Sequence`.

source: :class:`collections.abc.Sequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
pt_br: :class:`collections.abc.Sequence` agora oferece suporte a subscrição (``[]``). Consulte :pep:`585` e :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ValuesView`.
pt_br: Apelido descontinuado de :class:`collections.abc.ValuesView`.
