Repository: python/python-docs-pt-br
Catalog: library/typing.po
Languages: pt_br

source: The default value of the type variable tuple, or :data:`typing.NoDefault` if it has no default.
pt_br: O valor padrão da tupla de tipos variáveis, ou :data:`typing.NoDefault` se não existir padrão.

source: An :term:`evaluate function` corresponding to the :attr:`~TypeVarTuple.__default__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~TypeVarTuple.__default__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
pt_br: Uma :term:`função de avaliação` correspondente ao atributo :attr:`~TypeVarTuple.__default__`. Quando chamado diretamente, este método oferece suporte apenas ao formato :attr:`~annotationlib.Format.VALUE`, que equivale a acessar o atributo :attr:`~TypeVarTuple.__default__` diretamente, mas o objeto do método pode ser passado para :func:`annotationlib.call_evaluate_function` para avaliar o valor em um formato diferente.

source: Return whether or not the type variable tuple has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
pt_br: Retorna se a tupla de tipos variáveis tem ou não um valor padrão. Isso equivale a verificar se :attr:`__default__` não é o singleton :data:`typing.NoDefault`, exceto por não forçar a avaliação instantânea do valor padrão que é :ref:`avaliado preguiçosamente <lazy-evaluation>`.

source: Type variable tuples can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
pt_br: Tuplas de tipos variáveis agora podem ser declaradas usando a sintaxe de :ref:`parâmetros de tipo <type-params>` introduzido pela :pep:`695`.

source: Parameter specification variable. A specialized version of :ref:`type variables <typevar>`.
pt_br: Variável de especificação de parâmetro. Uma versão especializada de :ref:`tipos variáveis <typevar>`.

source: In :ref:`type parameter lists <type-params>`, parameter specifications can be declared with two asterisks (``**``)::
pt_br: Em :ref:`listas de parâmetros de tipo <type-params>` as especificações de parâmetros podem ser declaradas com dois asteriscos (``**``)::

source: For compatibility with Python 3.11 and earlier, ``ParamSpec`` objects can also be created as follows::
pt_br: Para compatibilidade com Python 3.11 e versões anteriores, os objetos ``ParamSpec`` também podem ser criados da seguinte forma::

source: Parameter specification variables exist primarily for the benefit of static type checkers. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. They are only valid when used in ``Concatenate``, or as the first argument to ``Callable``, or as parameters for user-defined Generics. See :class:`Generic` for more information on generic types.
pt_br: Variáveis de especificação de parâmetro existem principalmente para o benefício de verificadores de tipo estático. São usadas para encaminhar os tipos de parâmetros de um chamável para outro chamável -- um padrão comumente encontrado em funções e decoradores de ordem superior. Só são válidas quando usados em ``Concatenate``, ou como o primeiro argumento para ``Callable``, ou como parâmetro para genéricos definidos pelo usuário. Consulte :class:`Generic` para obter mais informações sobre tipos genéricos.

source: For example, to add basic logging to a function, one can create a decorator ``add_logging`` to log function calls. The parameter specification variable tells the type checker that the callable passed into the decorator and the new callable returned by it have inter-dependent type parameters::
pt_br: Por exemplo, para adicionar um registro básico de eventos a uma função, é possível criar um decorador ``add_logging`` para registrar chamadas de função. A variável de especificação de parâmetro informa ao verificador de tipos que o chamável passado para o decorador e o novo chamável retornado por ele têm parâmetros de tipo interdependentes::

source: from collections.abc import Callable import logging def add_logging[T, **P](f: Callable[P, T]) -> Callable[P, T]: '''A type-safe decorator to add logging to a function.''' def inner(*args: P.args, **kwargs: P.kwargs) -> T: logging.info(f'{f.__name__} was called') return f(*args, **kwargs) return inner @add_logging def add_two(x: float, y: float) -> float: '''Add two numbers together.''' return x + y
pt_br: from collections.abc import Callable import logging def add_logging[T, **P](f: Callable[P, T]) -> Callable[P, T]: '''Um decorador com segurança de tipos que acrescenta registros de eventos (logs) a uma função.''' def inner(*args: P.args, **kwargs: P.kwargs) -> T: logging.info(f'{f.__name__} was called') return f(*args, **kwargs) return inner @add_logging def add_two(x: float, y: float) -> float: '''Soma dois números.''' return x + y

source: Without ``ParamSpec``, the simplest way to annotate this previously was to use a :class:`TypeVar` with upper bound ``Callable[..., Any]``. However this causes two problems:
pt_br: Sem o ``ParamSpec``, a maneira mais simples de anotar isso anteriormente era usar um :class:`TypeVar` com o limite superior ``Callable[..., Any]``. No entanto, isso causa dois problemas:

source: The type checker can't type check the ``inner`` function because ``*args`` and ``**kwargs`` have to be typed :data:`Any`.
pt_br: O verificador de tipos não consegue verificar a função ``inner``, porque ``*args`` e ``**kwargs`` precisam ter tipo :data:`Any`.

source: :func:`~cast` may be required in the body of the ``add_logging`` decorator when returning the ``inner`` function, or the static type checker must be told to ignore the ``return inner``.
pt_br: :func:`~cast` pode ser exigida no corpo do decorador ``add_logging`` ao retornar a função ``inner``, ou o verificador de tipo estático deverá ser instruído a ignorar o ``return inner``.

source: Since ``ParamSpec`` captures both positional and keyword parameters, ``P.args`` and ``P.kwargs`` can be used to split a ``ParamSpec`` into its components. ``P.args`` represents the tuple of positional parameters in a given call and should only be used to annotate ``*args``. ``P.kwargs`` represents the mapping of keyword parameters to their values in a given call, and should be only be used to annotate ``**kwargs``. Both attributes require the annotated parameter to be in scope. At runtime, ``P.args`` and ``P.kwargs`` are instances respectively of :class:`ParamSpecArgs` and :class:`ParamSpecKwargs`.
pt_br: Como ``ParamSpec`` captura tanto parâmetros posicionais quanto parâmetros nomeados, ``P.args`` e ``P.kwargs`` podem ser usados para dividir um ``ParamSpec`` em seus componentes. ``P.args`` representa a tupla de parâmetros posicionais em uma determinada chamada e só deve ser usada para anotar ``*args``. ``P.kwargs`` representa o mapeamento de parâmetros nomeados para seus valores em uma determinada chamada, e só deve ser usado para anotar ``**kwargs``. Ambos os atributos exigem que o parâmetro anotado esteja em escopo. Em tempo de execução, ``P.args`` e ``P.kwargs`` são instâncias, respectivamente, de :class:`ParamSpecArgs` e :class:`ParamSpecKwargs`.

source: The name of the parameter specification.
pt_br: O nome da especificação de parâmetros.

source: The default value of the parameter specification, or :data:`typing.NoDefault` if it has no default.
pt_br: O valor padrão da especificação de parâmetro, ou :data:`typing.NoDefault` se não tiver padrão.

source: An :term:`evaluate function` corresponding to the :attr:`~ParamSpec.__default__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`~ParamSpec.__default__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format.
pt_br: Uma :term:`função de avaliação` correspondente ao atributo :attr:`~ParamSpec.__default__`. Quando chamado diretamente, este método oferece suporte apenas ao formato :attr:`~annotationlib.Format.VALUE`, que equivale a acessar o atributo :attr:`~ParamSpec.__default__` diretamente, mas o objeto do método pode ser passado para :func:`annotationlib.call_evaluate_function` para avaliar o valor em um formato diferente.

source: Return whether or not the parameter specification has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
pt_br: Retorna se a especificação de parâmetros tem ou não um valor padrão. Isso equivale a verificar se :attr:`__default__` não é o singleton :data:`typing.NoDefault`, exceto por não forçar a avaliação instantânea do valor padrão que é :ref:`avaliado preguiçosamente <lazy-evaluation>`.

source: Parameter specification variables created with ``covariant=True`` or ``contravariant=True`` can be used to declare covariant or contravariant generic types. The ``bound`` argument is also accepted, similar to :class:`TypeVar`. However the actual semantics of these keywords are yet to be decided.
pt_br: Variáveis de especificação de parâmetros criadas com ``covariant=True`` ou ``contravariant=True`` podem ser usadas para declarar tipos genéricos covariantes ou contravariantes. O argumento ``bound`` também é aceito, semelhante ao :class:`TypeVar`. Porém, a semântica real dessas palavras reservadas ainda não foi decidida.

source: Parameter specifications can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
pt_br: Especificações de parâmetros agora podem ser declaradas usando a sintaxe de :ref:`parâmetros de tipo <type-params>` introduzido pela :pep:`695`.

source: Only parameter specification variables defined in global scope can be pickled.
pt_br: Somente variáveis de especificação de parâmetro definidas em escopo global podem ser serializadas com pickle.

source: Arguments and keyword arguments attributes of a :class:`ParamSpec`. The ``P.args`` attribute of a ``ParamSpec`` is an instance of ``ParamSpecArgs``, and ``P.kwargs`` is an instance of ``ParamSpecKwargs``. They are intended for runtime introspection and have no special meaning to static type checkers.
pt_br: Tipos dos argumentos e dos argumentos nomeados de um :class:`ParamSpec`. O atributo ``P.args`` de um ``ParamSpec`` é uma instância de ``ParamSpecArgs``, e o atributo ``P.kwargs`` é uma instância de ``ParamSpecKwargs``. São destinados à introspecção em tempo de execução, e não têm nenhum significado especial para o verificador de tipo estático.

source: Calling :func:`get_origin` on either of these objects will return the original ``ParamSpec``:
pt_br: Chamar :func:`get_origin` em qualquer um desses objetos retornará o ``ParamSpec`` original:

source: The type of type aliases created through the :keyword:`type` statement.
pt_br: O tipo de apelidos de tipo criados pela instrução :keyword:`type`.

source: The name of the type alias:
pt_br: O nome do apelido de tipo:

source: The module in which the type alias was defined::
pt_br: O módulo no qual o apelido de tipo foi definido::

source: The type parameters of the type alias, or an empty tuple if the alias is not generic:
pt_br: Os parâmetros de tipo do apelido de tipo, ou uma tupla vazia se o apelido não for genérico:

source: The type alias's value. This is :ref:`lazily evaluated <lazy-evaluation>`, so names used in the definition of the alias are not resolved until the ``__value__`` attribute is accessed:
pt_br: O valor do apelido de tipo. Isso é uma :ref:`avaliação preguiçosa <lazy-evaluation>`, portanto, os nomes usados na definição do apelido não são resolvidos até que o atributo ``__value__`` seja acessado:

source: An :term:`evaluate function` corresponding to the :attr:`__value__` attribute. When called directly, this method supports only the :attr:`~annotationlib.Format.VALUE` format, which is equivalent to accessing the :attr:`__value__` attribute directly, but the method object can be passed to :func:`annotationlib.call_evaluate_function` to evaluate the value in a different format:
pt_br: Uma :term:`função de avaliação` correspondente ao atributo :attr:`__value__`. Quando chamado diretamente, este método oferece suporte apenas ao formato :attr:`~annotationlib.Format.VALUE`, que equivale a acessar o atributo :attr:`__value__` diretamente, mas o objeto do método pode ser passado para :func:`annotationlib.call_evaluate_function` para avaliar o valor em um formato diferente.

source: Unpacking
pt_br: Descompactando

source: Type aliases support star unpacking using the ``*Alias`` syntax. This is equivalent to using ``Unpack[Alias]`` directly:
pt_br: Apelidos de tipo oferecem suporte a desempacotamento em estrela usando a sintaxe ``*Alias``. Isso equivale a usar ``Unpack[Alias]`` diretamente:

source: Other special directives
pt_br: Outras diretivas especiais

source: These functions and classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating and declaring types.
pt_br: Essas funções e classes não devem ser usadas diretamente como anotações. O objetivo é que sejam blocos de construção para criar e declarar tipos.

source: Typed version of :func:`collections.namedtuple`.
pt_br: Versão tipada de :func:`collections.namedtuple`.

source: Usage::
pt_br: Uso::

source: This is equivalent to::
pt_br: Isso equivale a::

source: To give a field a default value, you can assign to it in the class body::
pt_br: Para dar um valor padrão a um campo, você pode atribuir um valor a ele no corpo da classe::

source: Fields with a default value must come after any fields without a default.
pt_br: Campos com valor padrão devem vir depois de quaisquer campos sem valor padrão.

source: The resulting class has an extra attribute ``__annotations__`` giving a dict that maps the field names to the field types. (The field names are in the ``_fields`` attribute and the default values are in the ``_field_defaults`` attribute, both of which are part of the :func:`~collections.namedtuple` API.)
pt_br: A classe resultante tem um atributo extra ``__annotations__`` que fornece um dicionário que mapeia os nomes de campos para os tipos de campos. (Os nomes de campos estão no atributo ``_fields`` e os valores padrões estão no atributo ``_field_defaults``, e ambos fazem parte da API de :func:`~collections.namedtuple`.)

source: ``NamedTuple`` subclasses can also have docstrings and methods::
pt_br: Subclasses de ``NamedTuple`` também podem ter strings de documentação e métodos::

source: class Employee(NamedTuple): """Represents an employee.""" name: str id: int = 3 def __repr__(self) -> str: return f'<Employee {self.name}, id={self.id}>'
pt_br: class Employee(NamedTuple): """Representa um funcionário.""" name: str id: int = 3 def __repr__(self) -> str: return f'<Employee {self.name}, id={self.id}>'

source: ``NamedTuple`` subclasses can be generic::
pt_br: Subclasses de ``NamedTuple`` podem ser genéricas::

source: Backward-compatible usage::
pt_br: Uso retrocompatível::

source: # For creating a generic NamedTuple on Python 3.11 T = TypeVar("T") class Group(NamedTuple, Generic[T]): key: T group: list[T] # A functional syntax is also supported Employee = NamedTuple('Employee', [('name', str), ('id', int)])
pt_br: # Para criar uma NamedTuple genérica em Python 3.11 T = TypeVar("T") class Group(NamedTuple, Generic[T]): key: T group: list[T] # Também há suporte para a sintaxe funcional Employee = NamedTuple('Employee', [('name', str), ('id', int)])

source: Added support for :pep:`526` variable annotation syntax.
pt_br: Adiciona suporte à sintaxe de anotação de variáveis da :pep:`526`.

source: Added support for default values, methods, and docstrings.
pt_br: Adiciona suporte a valores padrões, métodos, e docstrings.

source: The ``_field_types`` and ``__annotations__`` attributes are now regular dictionaries instead of instances of ``OrderedDict``.
pt_br: Os atributos ``_field_types`` e ``__annotations__`` agora são dicionários regulares em vez de instâncias de ``OrderedDict``.

source: Removed the ``_field_types`` attribute in favor of the more standard ``__annotations__`` attribute which has the same information.
pt_br: Remove o atributo ``_field_types`` em favor do atributo mais padronizado ``__annotations__`` que tem as mesmas informações.

source: Added support for generic namedtuples.
pt_br: Adiciona suporte a tuplas nomeadas genéricas.

source: Using :func:`super` (and the ``__class__`` :term:`closure variable`) in methods of ``NamedTuple`` subclasses is unsupported and causes a :class:`TypeError`.
pt_br: O uso de :func:`super` (e a :term:`variável de clausura` ``__class__``) em métodos de subclasses de ``NamedTuple`` não é suportado e causa um :class:`TypeError`.

source: The undocumented keyword argument syntax for creating NamedTuple classes (``NT = NamedTuple("NT", x=int)``) is deprecated, and will be disallowed in 3.15. Use the class-based syntax or the functional syntax instead.
pt_br: A sintaxe de argumentos nomeados não documentados para criar classes NamedTuple (``NT = NamedTuple("NT", x=int)``) está descontinuado e será proibido na versão 3.15. Em vez disso, use a sintaxe baseada em classes ou a sintaxe funcional.

source: When using the functional syntax to create a NamedTuple class, failing to pass a value to the 'fields' parameter (``NT = NamedTuple("NT")``) is deprecated. Passing ``None`` to the 'fields' parameter (``NT = NamedTuple("NT", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a NamedTuple class with 0 fields, use ``class NT(NamedTuple): pass`` or ``NT = NamedTuple("NT", [])``.
pt_br: Ao usar a sintaxe funcional para criar uma classe NamedTuple, não passar um valor para o parâmetro 'fields' (``NT = NamedTuple("NT")``) está descontinuado. Passar ``None`` para o parâmetro 'fields' (``NT = NamedTuple("NT", None)``) também está descontinuado. Ambos não serão permitidos em Python 3.15. Para criar uma classe NamedTuple com 0 campos, use ``class NT(NamedTuple): pass`` ou ``NT = NamedTuple("NT", [])``.

source: Helper class to create low-overhead :ref:`distinct types <distinct>`.
pt_br: Classe auxiliar para criar :ref:`tipos únicos <distinct>` com baixo custo.

source: A ``NewType`` is considered a distinct type by a typechecker. At runtime, however, calling a ``NewType`` returns its argument unchanged.
pt_br: Um tipo ``NewType`` é considerado um tipo distinto por um verificador de tipos. Porém, em tempo de execução, chamar ``NewType`` retorna seu argumento inalterado.

source: UserId = NewType('UserId', int) # Declare the NewType "UserId" first_user = UserId(1) # "UserId" returns the argument unchanged at runtime
pt_br: UserId = NewType('UserId', int) # Declare o NewType "UserId" first_user = UserId(1) # "UserId" retorna o argumento inalterado em tempo de execução

source: The module in which the new type is defined.
pt_br: O módulo no qual o novo tipo está definido.

source: The name of the new type.
pt_br: O nome do novo tipo.

source: The type that the new type is based on.
pt_br: O tipo na qual o novo tipo é baseado.

source: ``NewType`` is now a class rather than a function.
pt_br: ``NewType`` agora é uma classe em vez de uma função.

source: Base class for protocol classes.
pt_br: Classe base para classes de protocolo.

source: Protocol classes are defined like this::
pt_br: Classes de protocolo são definidas assim::

source: Such classes are primarily used with static type checkers that recognize structural subtyping (static duck-typing), for example::
pt_br: Essas classes são usadas principalmente com verificadores de tipo estático que reconhecem a subtipagem estrutural (tipagem pato estática). Por exemplo::

source: class C: def meth(self) -> int: return 0 def func(x: Proto) -> int: return x.meth() func(C()) # Passes static type check
pt_br: class C: def meth(self) -> int: return 0 def func(x: Proto) -> int: return x.meth() func(C()) # Passa na verificação de tipos

source: See :pep:`544` for more details. Protocol classes decorated with :func:`runtime_checkable` (described later) act as simple-minded runtime protocols that check only the presence of given attributes, ignoring their type signatures. Protocol classes without this decorator cannot be used as the second argument to :func:`isinstance` or :func:`issubclass`.
pt_br: Consulte a :pep:`544` para obter mais detalhes. Classes de protocolo decoradas com :func:`runtime_checkable` (descritas posteriormente) funcionam como protocolos em tempo de execução simples, somente verificando a presença de determinados atributos, e ignorando suas assinaturas de tipo. Classes de protocolo sem este decorador não podem ser usadas como o segundo argumento para :func:`isinstance` ou :func:`issubclass`.

source: Protocol classes can be generic, for example::
pt_br: Classes de protocolo podem ser genéricas. Por exemplo::

source: In code that needs to be compatible with Python 3.11 or older, generic Protocols can be written as follows::
pt_br: Em códigos que precisam ser compatíveis com Python 3.11 ou versões anteriores, protocolos genéricos podem ser escritos da seguinte forma::

source: Mark a protocol class as a runtime protocol.
pt_br: Marca uma classe de protocolo como um protocolo de tempo de execução.

source: Such a protocol can be used with :func:`isinstance` and :func:`issubclass`. This allows a simple-minded structural check, very similar to "one trick ponies" in :mod:`collections.abc` such as :class:`~collections.abc.Iterable`. For example::
pt_br: Esse protocolo pode ser usado com :func:`isinstance` e :func:`issubclass`. Isso permite uma verificação estrutural simples, muito semelhante a "pôneis de um truque só" em :mod:`collections.abc`, como :class:`~collections.abc.Iterable`. Por exemplo::

source: This decorator raises :exc:`TypeError` when applied to a non-protocol class.
pt_br: Este decorador levanta :exc:`TypeError` quando aplicado a uma classe não-protocolo.

source: :func:`!runtime_checkable` will check only the presence of the required methods or attributes, not their type signatures or types. For example, :class:`ssl.SSLObject` is a class, therefore it passes an :func:`issubclass` check against :ref:`Callable <annotating-callables>`. However, the ``ssl.SSLObject.__init__`` method exists only to raise a :exc:`TypeError` with a more informative message, therefore making it impossible to call (instantiate) :class:`ssl.SSLObject`.
pt_br: :func:`!runtime_checkable` verificará apenas a presença dos métodos ou atributos obrigatórios, em vez de tipos ou assinaturas de tipos. Por exemplo, o :class:`ssl.SSLObject` é uma classe e, portanto, passa por uma verificação :func:`issubclass` em relação a :ref:`Callable <annotating-callables>`. No entanto, o método ``ssl.SSLObject.__init__`` existe apenas para levantar um :exc:`TypeError` com uma mensagem mais informativa, o que impossibilita chamar (instanciar) o :class:`ssl.SSLObject`.
