Repository: python/python-docs-pt-br
Catalog: library/unittest.mock.po
Languages: pt_br

source: Many of the not-very-useful (private to :class:`Mock` rather than the thing being mocked) underscore and double underscore prefixed attributes have been filtered from the result of calling :func:`dir` on a :class:`Mock`. If you dislike this behaviour you can switch it off by setting the module level switch :data:`FILTER_DIR`:
pt_br: Багато з не дуже корисних (приватних для :class:`Mock`, а не для того, що висміюється) атрибутів підкреслення та подвійного підкреслення з префіксом було відфільтровано з результату виклику :func:`dir` на :class:`Mock`. Якщо вам не подобається така поведінка, ви можете вимкнути її, встановивши перемикач рівня модуля :data:`FILTER_DIR`:

source: A helper function to create a mock to replace the use of :func:`open`. It works for :func:`open` called directly or used as a context manager.
pt_br: Допоміжна функція для створення макету замість використання :func:`open`. Це працює для :func:`open`, що викликається безпосередньо або використовується як контекстний менеджер.

source: The *mock* argument is the mock object to configure. If ``None`` (the default) then a :class:`MagicMock` will be created for you, with the API limited to methods or attributes available on standard file handles.
pt_br: Аргумент *mock* є макетним об’єктом для налаштування. Якщо ``None`` (за замовчуванням), тоді для вас буде створено :class:`MagicMock` з API, обмеженим методами чи атрибутами, доступними для стандартних дескрипторів файлів.

source: *read_data* is now reset on each call to the *mock*.
pt_br: *read_data* тепер скидається під час кожного виклику *mock*.

source: Added :meth:`~container.__iter__` to implementation so that iteration (such as in for loops) correctly consumes *read_data*.
pt_br: В реализацию добавлен :meth:`~container.__iter__`, чтобы итерация (например, в циклах for) правильно использовала *read_data*.

source: Using :func:`open` as a context manager is a great way to ensure your file handles are closed properly and is becoming common::
pt_br: Використання :func:`open` як контекстного менеджера є чудовим способом переконатися, що ваші дескриптори файлів закриті належним чином, і стає поширеним::

source: The issue is that even if you mock out the call to :func:`open` it is the *returned object* that is used as a context manager (and has :meth:`~object.__enter__` and :meth:`~object.__exit__` called).
pt_br: Проблема в том, что даже если вы имитируете вызов :func:`open`, это *возвращенный объект*, который используется в качестве контекстного менеджера (и имеет :meth:`~object.__enter__` и :meth:`~ вызывается object.__exit__`).

source: Mocking context managers with a :class:`MagicMock` is common enough and fiddly enough that a helper function is useful. ::
pt_br: Знущання над контекстними менеджерами за допомогою :class:`MagicMock` є досить поширеним і досить складним, щоб допоміжна функція була корисною. ::

source: And for reading files::
pt_br: E para ler arquivos::

source: Autospeccing
pt_br: Especificação automática

source: Before I explain how auto-speccing works, here's why it is needed.
pt_br: Перш ніж пояснювати, як працює автоматична специфікація, ось чому вона потрібна.

source: Note that this is another reason why you need integration tests as well as unit tests. Testing everything in isolation is all fine and dandy, but if you don't test how your units are "wired together" there is still lots of room for bugs that tests might have caught.
pt_br: Зауважте, що це ще одна причина, чому вам потрібні інтеграційні тести, а також модульні тести. Тестувати все ізольовано — це чудово, але якщо ви не перевірятимете, як ваші пристрої "з’єднані між собою", все ще є багато місця для помилок, які могли виявити тести.

source: The spec only applies to the mock itself, so we still have the same issue with any methods on the mock:
pt_br: Специфікація стосується лише самого макету, тому ми все ще маємо ту саму проблему з будь-якими методами на макеті:

source: Auto-speccing solves this problem. You can either pass ``autospec=True`` to :func:`patch` / :func:`patch.object` or use the :func:`create_autospec` function to create a mock with a spec. If you use the ``autospec=True`` argument to :func:`patch` then the object that is being replaced will be used as the spec object. Because the speccing is done "lazily" (the spec is created as attributes on the mock are accessed) you can use it with very complex or deeply nested objects (like modules that import modules that import modules) without a big performance hit.
pt_br: Автоматична специфікація вирішує цю проблему. Ви можете передати ``autospec=True`` в :func:`patch` / :func:`patch.object` або використати функцію :func:`create_autospec`, щоб створити макет зі специфікацією. Якщо ви використовуєте аргумент ``autospec=True`` для :func:`patch`, тоді об’єкт, який замінюється, використовуватиметься як об’єкт специфікації. Оскільки специфікація виконується "ліниво" (специфікація створюється під час доступу до атрибутів макету), ви можете використовувати її з дуже складними або глибоко вкладеними об’єктами (як-от модулі, які імпортують модулі, які імпортують модулі) без значного зниження продуктивності.

source: Here's an example of it in use::
pt_br: Aqui está um exemplo disso em uso::

source: The spec also applies to instantiated classes (i.e. the return value of specced mocks)::
pt_br: Специфікація також стосується екземплярів класів (тобто значення, що повертається specced mocks):

source: In many cases you will just be able to add ``autospec=True`` to your existing :func:`patch` calls and then be protected against bugs due to typos and api changes.
pt_br: У багатьох випадках ви просто зможете додати ``autospec=True`` до наявних викликів :func:`patch` і тоді захистити себе від помилок через помилки друку та зміни API.

source: As well as using *autospec* through :func:`patch` there is a :func:`create_autospec` for creating autospecced mocks directly:
pt_br: Окрім використання *autospec* через :func:`patch`, існує :func:`create_autospec` для безпосереднього створення автоспецованих макетів:

source: This isn't without caveats and limitations however, which is why it is not the default behaviour. In order to know what attributes are available on the spec object, autospec has to introspect (access attributes) the spec. As you traverse attributes on the mock a corresponding traversal of the original object is happening under the hood. If any of your specced objects have properties or descriptors that can trigger code execution then you may not be able to use autospec. On the other hand it is much better to design your objects so that introspection is safe [#]_.
pt_br: Однак це не без застережень і обмежень, тому це не типова поведінка. Щоб дізнатися, які атрибути доступні для об’єкта специфікації, autospec має перевірити специфікацію (отримати доступ до атрибутів). Коли ви обходите атрибути на макеті, відповідний обхід оригінального об’єкта відбувається під капотом. Якщо будь-який з ваших специфікованих об’єктів має властивості або дескриптори, які можуть ініціювати виконання коду, можливо, ви не зможете використовувати автоспец. З іншого боку, набагато краще проектувати ваші об’єкти так, щоб самоаналіз був безпечним [#]_.

source: A more serious problem is that it is common for instance attributes to be created in the :meth:`~object.__init__` method and not to exist on the class at all. *autospec* can't know about any dynamically created attributes and restricts the api to visible attributes. ::
pt_br: Более серьезная проблема заключается в том, что атрибуты экземпляра обычно создаются в методе :meth:`~object.__init__` и вообще не существуют в классе. *autospec* не может знать ни о каких динамически создаваемых атрибутах и ​​ограничивает API видимыми атрибутами. ::

source: There are a few different ways of resolving this problem. The easiest, but not necessarily the least annoying, way is to simply set the required attributes on the mock after creation. Just because *autospec* doesn't allow you to fetch attributes that don't exist on the spec it doesn't prevent you setting them::
pt_br: Існує кілька способів вирішення цієї проблеми. Найпростіший, але не обов’язково найменш дратуючий спосіб – це просто встановити необхідні атрибути на макет після створення. Просто тому, що *autospec* не дозволяє отримати атрибути, яких немає в специфікації, це не заважає вам налаштувати їх::

source: There is a more aggressive version of both *spec* and *autospec* that *does* prevent you setting non-existent attributes. This is useful if you want to ensure your code only *sets* valid attributes too, but obviously it prevents this particular scenario:
pt_br: Існує більш агресивна версія як *spec*, так і *autospec*, яка *не* запобігає встановленню неіснуючих атрибутів. Це корисно, якщо ви хочете, щоб ваш код також *встановлював* дійсні атрибути, але, очевидно, це запобігає цьому конкретному сценарію:

source: Probably the best way of solving the problem is to add class attributes as default values for instance members initialised in :meth:`~object.__init__`. Note that if you are only setting default attributes in :meth:`!__init__` then providing them via class attributes (shared between instances of course) is faster too. e.g.
pt_br: Вероятно, лучший способ решить проблему — добавить атрибуты класса в качестве значений по умолчанию для членов экземпляра, инициализированных в :meth:`~object.__init__`. Обратите внимание: если вы устанавливаете только атрибуты по умолчанию в :meth:`!__init__`, то предоставление их через атрибуты класса (конечно, общие для всех экземпляров) также происходит быстрее. например

source: This brings up another issue. It is relatively common to provide a default value of ``None`` for members that will later be an object of a different type. ``None`` would be useless as a spec because it wouldn't let you access *any* attributes or methods on it. As ``None`` is *never* going to be useful as a spec, and probably indicates a member that will normally of some other type, autospec doesn't use a spec for members that are set to ``None``. These will just be ordinary mocks (well - MagicMocks):
pt_br: Це породжує іншу проблему. Відносно поширеним є надання значення за замовчуванням ``None`` для членів, які пізніше будуть об’єктом іншого типу. ``None`` буде марним як специфікація, тому що це не дозволить вам отримати доступ до *будь-яких* атрибутів або методів на ньому. Оскільки ``None`` *ніколи* не буде корисним як специфікація, і, ймовірно, вказує на член, який зазвичай буде іншого типу, autospec не використовує специфікацію для членів, для яких встановлено ``None``. Це будуть просто звичайні макети (добре - MagicMocks):

source: If modifying your production classes to add defaults isn't to your liking then there are more options. One of these is simply to use an instance as the spec rather than the class. The other is to create a subclass of the production class and add the defaults to the subclass without affecting the production class. Both of these require you to use an alternative object as the spec. Thankfully :func:`patch` supports this - you can simply pass the alternative object as the *autospec* argument::
pt_br: Якщо вам не до вподоби модифікація виробничих класів для додавання значень за замовчуванням, тоді є більше варіантів. Одним із них є просто використання екземпляра як специфікації, а не класу. Інший полягає у створенні підкласу виробничого класу та додаванні стандартних значень до підкласу, не впливаючи на виробничий клас. Обидва вони вимагають використання альтернативного об’єкта як специфікації. На щастя, :func:`patch` підтримує це — ви можете просто передати альтернативний об’єкт як аргумент *autospec*::

source: This only applies to classes or already instantiated objects. Calling a mocked class to create a mock instance *does not* create a real instance. It is only attribute lookups - along with calls to :func:`dir` - that are done.
pt_br: Це стосується лише класів або вже створених об’єктів. Виклик фіктивного класу для створення фальшивого екземпляра *не* створює справжній екземпляр. Виконуються лише пошуки атрибутів разом із викликами :func:`dir`.

source: Sealing mocks
pt_br: Vedando mocks

source: Seal will disable the automatic creation of mocks when accessing an attribute of the mock being sealed or any of its attributes that are already mocks recursively.
pt_br: Seal вимкне автоматичне створення макетів під час доступу до атрибута макету, який запечатується, або будь-якого з його атрибутів, які вже є макетами рекурсивно.

source: If a mock instance with a name or a spec is assigned to an attribute it won't be considered in the sealing chain. This allows one to prevent seal from fixing part of the mock object. ::
pt_br: Якщо атрибуту присвоєно макет екземпляра з іменем або специфікацією, він не враховуватиметься в ланцюжку запечатування. Це дозволяє запобігти фіксації пломбою частини фіктивного об'єкта. ::

source: The order of their precedence is:
pt_br: Порядок их старшинства следующий:

source: If all three are set, mock will return the value from :attr:`~Mock.side_effect`, ignoring :attr:`~Mock.return_value` and the wrapped object altogether. If any two are set, the one with the higher precedence will return the value. Regardless of the order of which was set first, the order of precedence remains unchanged.
pt_br: Если все три установлены, макет вернет значение из :attr:`~Mock.side_effect`, полностью игнорируя :attr:`~Mock.return_value` и обернутый объект. Если установлены любые два, значение будет возвращено значение с более высоким приоритетом. Независимо от того, какой порядок был установлен первым, порядок приоритета остается неизменным.

source: As ``None`` is the default value of :attr:`~Mock.side_effect`, if you reassign its value back to ``None``, the order of precedence will be checked between :attr:`~Mock.return_value` and the wrapped object, ignoring :attr:`~Mock.side_effect`.
pt_br: Поскольку ``None`` является значением по умолчанию для :attr:`~Mock.side_effect`, если вы переназначите его значение обратно на ``None``, порядок приоритета будет проверен между :attr:`~Mock.return_value ` и обернутый объект, игнорируя :attr:`~Mock.side_effect`.

source: If the value being returned by :attr:`~Mock.side_effect` is :data:`DEFAULT`, it is ignored and the order of precedence moves to the successor to obtain the value to return.
pt_br: Если значение, возвращаемое :attr:`~Mock.side_effect`, равно :data:`DEFAULT`, оно игнорируется, и порядок приоритета перемещается к преемнику, чтобы получить возвращаемое значение.

source: When :class:`Mock` wraps an object, the default value of :attr:`~Mock.return_value` will be :data:`DEFAULT`.
pt_br: Когда :class:`Mock` оборачивает объект, значением по умолчанию :attr:`~Mock.return_value` будет :data:`DEFAULT`.

source: The order of precedence will ignore this value and it will move to the last successor which is the wrapped object.
pt_br: Порядок приоритета будет игнорировать это значение и переместится к последнему преемнику, который является обернутым объектом.

source: As the real call is being made to the wrapped object, creating an instance of this mock will return the real instance of the class. The positional arguments, if any, required by the wrapped object must be passed.
pt_br: Поскольку реальный вызов выполняется к обернутому объекту, создание экземпляра этого макета вернет реальный экземпляр класса. Должны быть переданы позиционные аргументы, если таковые имеются, необходимые для обернутого объекта.

source: But if you assign ``None`` to it, this will not be ignored as it is an explicit assignment. So, the order of precedence will not move to the wrapped object.
pt_br: Но если вы присвоите ему None, это не будет проигнорировано, поскольку это явное присвоение. Таким образом, порядок приоритета не будет перенесен на обернутый объект.

source: Even if you set all three at once when initializing the mock, the order of precedence remains the same:
pt_br: Даже если вы установите все три одновременно при инициализации макета, порядок приоритета останется прежним:

source: If :attr:`~Mock.side_effect` is exhausted, the order of precedence will not cause a value to be obtained from the successors. Instead, ``StopIteration`` exception is raised.
pt_br: Если :attr:`~Mock.side_effect` исчерпан, порядок приоритета не приведет к получению значения от наследников. Вместо этого возникает исключение StopIteration.
