Repository: python/python-docs-pt-br
Catalog: library/unittest.mock-examples.po
Languages: pt_br

source: To do this we create a mock instance as our mock backend and create a mock response object for it. To set the response as the return value for that final ``start_call`` we could do this::
pt_br: Для цього ми створюємо макет екземпляра як наш макет бекенда та створюємо для нього об’єкт імітації відповіді. Щоб встановити відповідь як значення, що повертається для цього останнього ``start_call``, ми можемо зробити так:

source: We can do that in a slightly nicer way using the :meth:`~Mock.configure_mock` method to directly set the return value for us::
pt_br: Ми можемо зробити це трохи зручнішим способом, використовуючи метод :meth:`~Mock.configure_mock`, щоб напряму встановити значення, що повертається:

source: With these we monkey patch the "mock backend" in place and can make the real call::
pt_br: За допомогою них ми, як мавпи, виправляємо "імітацію бекенда" на місці та можемо зробити справжній виклик:

source: Using :attr:`~Mock.mock_calls` we can check the chained call with a single assert. A chained call is several calls in one line of code, so there will be several entries in ``mock_calls``. We can use :meth:`call.call_list` to create this list of calls for us::
pt_br: Використовуючи :attr:`~Mock.mock_calls`, ми можемо перевірити ланцюжковий виклик за допомогою одного твердження. Зв’язаний виклик — це кілька викликів в одному рядку коду, тому в ``mock_calls`` буде кілька записів. Ми можемо використовувати :meth:`call.call_list`, щоб створити цей список дзвінків для нас::

source: Partial mocking
pt_br: Часткове глузування

source: In some tests I wanted to mock out a call to :meth:`datetime.date.today` to return a known date, but I didn't want to prevent the code under test from creating new date objects. Unfortunately :class:`datetime.date` is written in C, and so I couldn't just monkey-patch out the static :meth:`datetime.date.today` method.
pt_br: В некоторых тестах я хотел имитировать вызов :meth:`datetime.date.today` для возврата известной даты, но я не хотел препятствовать тестируемому коду создавать новые объекты даты. К сожалению, :class:`datetime.date` написан на C, и поэтому я не мог просто исправить статический :meth:`datetime.date.today` метод.

source: I found a simple way of doing this that involved effectively wrapping the date class with a mock, but passing through calls to the constructor to the real class (and returning real instances).
pt_br: Я знайшов простий спосіб зробити це, який передбачав ефективне обгортання класу дати макетом, але передачу викликів конструктору до реального класу (і повернення реальних екземплярів).

source: The :func:`patch decorator <patch>` is used here to mock out the ``date`` class in the module under test. The :attr:`~Mock.side_effect` attribute on the mock date class is then set to a lambda function that returns a real date. When the mock date class is called a real date will be constructed and returned by ``side_effect``. ::
pt_br: Декоратор :func:`patch <patch>` используется здесь для макетирования класса ``date`` в тестируемом модуле. Атрибут :attr:`~Mock.side_effect` в классе ложной даты затем устанавливается в лямбда-функцию, которая возвращает реальную дату. Когда вызывается класс ложной даты, реальная дата будет создана и возвращена ``side_effect``. ::

source: Note that we don't patch :class:`datetime.date` globally, we patch ``date`` in the module that *uses* it. See :ref:`where to patch <where-to-patch>`.
pt_br: Зверніть увагу, що ми не виправляємо :class:`datetime.date` глобально, ми виправляємо ``date`` в модулі, який *використовує* його. Дивіться :ref:`де виправити <where-to-patch>`.

source: When ``date.today()`` is called a known date is returned, but calls to the ``date(...)`` constructor still return normal dates. Without this you can find yourself having to calculate an expected result using exactly the same algorithm as the code under test, which is a classic testing anti-pattern.
pt_br: Коли викликається ``date.today()``, повертається відома дата, але виклики конструктора ``date(...)`` повертають звичайні дати. Без цього вам може знадобитися розрахувати очікуваний результат, використовуючи точно такий самий алгоритм, як і тестовий код, який є класичним тестовим антишаблоном.

source: Calls to the date constructor are recorded in the ``mock_date`` attributes (``call_count`` and friends) which may also be useful for your tests.
pt_br: Виклики конструктора дат записуються в атрибутах mock_date (call_count і friends), що також може бути корисним для ваших тестів.

source: An alternative way of dealing with mocking dates, or other builtin classes, is discussed in `this blog entry <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking-and-patching/>`_.
pt_br: Uma forma alternativa de lidar com datas de mock, ou outras classes embutidas, é discutida `nesta entrada de blog <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking-and-patching/>`_.

source: Mocking a Generator Method
pt_br: Висміювання методу генератора

source: A Python generator is a function or method that uses the :keyword:`yield` statement to return a series of values when iterated over [#]_.
pt_br: Генератор Python — це функція або метод, який використовує оператор :keyword:`yield` для повернення ряду значень під час ітерації [#]_.

source: A generator method / function is called to return the generator object. It is the generator object that is then iterated over. The protocol method for iteration is :meth:`~container.__iter__`, so we can mock this using a :class:`MagicMock`.
pt_br: Метод/функція генератора викликається для повернення об’єкта генератора. Це об’єкт генератора, який потім повторюється. Методом протоколу для ітерації є :meth:`~container.__iter__`, тому ми можемо імітувати це за допомогою :class:`MagicMock`.

source: Here's an example class with an "iter" method implemented as a generator:
pt_br: Ось приклад класу з методом "iter", реалізованим як генератор:

source: How would we mock this class, and in particular its "iter" method?
pt_br: Як би ми висміювали цей клас, і зокрема його метод "iter"?

source: To configure the values returned from the iteration (implicit in the call to :class:`list`), we need to configure the object returned by the call to ``foo.iter()``.
pt_br: Щоб налаштувати значення, що повертаються з ітерації (неявно у виклику :class:`list`), нам потрібно налаштувати об’єкт, що повертається викликом ``foo.iter()``.

source: There are also generator expressions and more `advanced uses <http://www.dabeaz.com/coroutines/index.html>`_ of generators, but we aren't concerned about them here. A very good introduction to generators and how powerful they are is: `Generator Tricks for Systems Programmers <http://www.dabeaz.com/generators/>`_.
pt_br: Існують також вирази-генератори та більш `просунуті способи використання <http://www.dabeaz.com/coroutines/index.html>`_ генераторів, але вони тут нас не хвилюють. Дуже гарний вступ до генераторів і їхньої потужності: `Трюки генераторів для системних програмістів <http://www.dabeaz.com/generators/>`_.

source: Applying the same patch to every test method
pt_br: Застосування того самого патча до кожного методу тестування

source: If you want several patches in place for multiple test methods the obvious way is to apply the patch decorators to every method. This can feel like unnecessary repetition. Instead, you can use :func:`patch` (in all its various forms) as a class decorator. This applies the patches to all test methods on the class. A test method is identified by methods whose names start with ``test``::
pt_br: Если вам нужно несколько патчей для нескольких методов тестирования, очевидный способ — применить декораторы патчей к каждому методу. Это может показаться ненужным повторением. Вместо этого вы можете использовать :func:`patch` (во всех его различных формах) в качестве декоратора класса. При этом исправления применяются ко всем методам тестирования в классе. Метод тестирования идентифицируется методами, имена которых начинаются с ``test``::

source: An alternative way of managing patches is to use the :ref:`start-and-stop`. These allow you to move the patching into your ``setUp`` and ``tearDown`` methods. ::
pt_br: Альтернативним способом керування патчами є використання :ref:`start-and-stop`. Це дозволяє вам перемістити виправлення у ваші методи ``setUp`` і ``tearDown``. ::

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the setUp then tearDown is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
pt_br: Якщо ви використовуєте цю техніку, ви повинні переконатися, що виправлення "скасовано", викликавши ``stop``. Це може бути складніше, ніж ви могли б подумати, тому що якщо виняток виникає в SetUp, tearDown не викликається. :meth:`unittest.TestCase.addCleanup` полегшує це::

source: Mocking Unbound Methods
pt_br: Висміювання незв'язаних методів

source: Whilst writing tests today I needed to patch an *unbound method* (patching the method on the class rather than on the instance). I needed self to be passed in as the first argument because I want to make asserts about which objects were calling this particular method. The issue is that you can't patch with a mock for this, because if you replace an unbound method with a mock it doesn't become a bound method when fetched from the instance, and so it doesn't get self passed in. The workaround is to patch the unbound method with a real function instead. The :func:`patch` decorator makes it so simple to patch out methods with a mock that having to create a real function becomes a nuisance.
pt_br: Сьогодні під час написання тестів мені потрібно було виправити *незв’язаний метод* (виправити метод у класі, а не в екземплярі). Мені потрібно було передати self як перший аргумент, оскільки я хочу зробити твердження про те, які об’єкти викликають цей конкретний метод. Проблема полягає в тому, що ви не можете виправити за допомогою макету для цього, тому що якщо ви заміните неприв’язаний метод на макет, він не стане зв’язаним методом під час отримання з примірника, і тому він не передається самостійно. Обхідним шляхом є заміна незв’язаного методу реальною функцією. Декоратор :func:`patch` робить так простим виправлення методів за допомогою макету, що створення справжньої функції стає незручністю.

source: If you pass ``autospec=True`` to patch then it does the patching with a *real* function object. This function object has the same signature as the one it is replacing, but delegates to a mock under the hood. You still get your mock auto-created in exactly the same way as before. What it means though, is that if you use it to patch out an unbound method on a class the mocked function will be turned into a bound method if it is fetched from an instance. It will have ``self`` passed in as the first argument, which is exactly what I wanted:
pt_br: Якщо ви передаєте ``autospec=True`` для виправлення, тоді він виконує виправлення за допомогою *реального* функціонального об’єкта. Цей функціональний об’єкт має таку саму сигнатуру, як і той, який він замінює, але делегує макет під капотом. Ви все ще автоматично створюєте свій макет точно так само, як і раніше. Однак це означає, що якщо ви використовуєте його для виправлення незв’язаного методу в класі, імітована функція буде перетворена на зв’язаний метод, якщо її буде отримано з екземпляра. Першим аргументом буде передано ``self``, а це саме те, що я хотів:

source: If we don't use ``autospec=True`` then the unbound method is patched out with a Mock instance instead, and isn't called with ``self``.
pt_br: Якщо ми не використовуємо ``autospec=True``, тоді неприв’язаний метод замість цього виправляється за допомогою екземпляра Mock і не викликається за допомогою ``self``.

source: Checking multiple calls with mock
pt_br: Перевірка кількох викликів за допомогою імітації

source: mock has a nice API for making assertions about how your mock objects are used.
pt_br: mock має гарний API для створення тверджень про те, як використовуються ваші макетні об’єкти.

source: If your mock is only being called once you can use the :meth:`~Mock.assert_called_once_with` method that also asserts that the :attr:`~Mock.call_count` is one.
pt_br: Если ваш макет вызывается только один раз, вы можете использовать метод :meth:`~Mock.assert_known_once_with`, который также утверждает, что :attr:`~Mock.call_count` является таковым.

source: Both ``assert_called_with`` and ``assert_called_once_with`` make assertions about the *most recent* call. If your mock is going to be called several times, and you want to make assertions about *all* those calls you can use :attr:`~Mock.call_args_list`:
pt_br: І ``assert_ called_with``, і ``assert_ called_once_with`` створюють твердження щодо *останнього* виклику. Якщо ваш макет буде викликано кілька разів, і ви хочете зробити твердження щодо *всіх* цих викликів, ви можете використовувати :attr:`~Mock.call_args_list`:

source: The :data:`call` helper makes it easy to make assertions about these calls. You can build up a list of expected calls and compare it to ``call_args_list``. This looks remarkably similar to the repr of the ``call_args_list``:
pt_br: Помічник :data:`call` полегшує створення тверджень щодо цих викликів. Ви можете створити список очікуваних викликів і порівняти його з ``call_args_list``. Це виглядає надзвичайно схожим на відображення ``списку викликів_аргів``:

source: Coping with mutable arguments
pt_br: Робота зі змінними аргументами

source: Another situation is rare, but can bite you, is when your mock is called with mutable arguments. ``call_args`` and ``call_args_list`` store *references* to the arguments. If the arguments are mutated by the code under test then you can no longer make assertions about what the values were when the mock was called.
pt_br: Інша ситуація рідкісна, але може вас вкусити, коли вашу імітацію викликають зі змінними аргументами. ``call_args`` і ``call_args_list`` зберігають *посилання* на аргументи. Якщо аргументи змінено кодом, що тестується, ви більше не зможете робити твердження про те, якими були значення під час виклику макету.

source: Here's some example code that shows the problem. Imagine the following functions defined in 'mymodule'::
pt_br: Ось приклад коду, який показує проблему. Уявіть собі такі функції, визначені в 'mymodule'::

source: When we try to test that ``grob`` calls ``frob`` with the correct argument look what happens::
pt_br: Коли ми намагаємося перевірити, що ``grob`` викликає ``frob`` з правильним аргументом, подивіться, що відбувається:

source: One possibility would be for mock to copy the arguments you pass in. This could then cause problems if you do assertions that rely on object identity for equality.
pt_br: Однією з можливостей було б імітаційне копіювання аргументів, які ви передаєте. Це може спричинити проблеми, якщо ви робите твердження, які покладаються на ідентичність об’єкта для рівності.

source: Here's one solution that uses the :attr:`~Mock.side_effect` functionality. If you provide a ``side_effect`` function for a mock then ``side_effect`` will be called with the same args as the mock. This gives us an opportunity to copy the arguments and store them for later assertions. In this example I'm using *another* mock to store the arguments so that I can use the mock methods for doing the assertion. Again a helper function sets this up for me. ::
pt_br: Вот одно решение, использующее функциональность :attr:`~Mock.side_effect`. Если вы предоставите функцию Side_effect для макета, то Side_effect будет вызываться с теми же аргументами, что и макет. Это дает нам возможность скопировать аргументы и сохранить их для последующих утверждений. В этом примере я использую *другой* макет для хранения аргументов, чтобы можно было использовать методы макета для выполнения утверждения. Опять же, вспомогательная функция устанавливает это для меня. ::

source: ``copy_call_args`` is called with the mock that will be called. It returns a new mock that we do the assertion on. The ``side_effect`` function makes a copy of the args and calls our ``new_mock`` with the copy.
pt_br: ``copy_call_args`` викликається з макетом, який буде викликано. Він повертає новий макет, на основі якого ми виконуємо твердження. Функція ``side_effect`` створює копію аргументів і викликає наш ``new_mock`` разом із копією.

source: If your mock is only going to be used once there is an easier way of checking arguments at the point they are called. You can simply do the checking inside a ``side_effect`` function.
pt_br: Якщо ваш макет використовуватиметься лише один раз, є простіший спосіб перевірити аргументи в момент їх виклику. Ви можете просто зробити перевірку всередині функції ``side_effect``.

source: An alternative approach is to create a subclass of :class:`Mock` or :class:`MagicMock` that copies (using :func:`copy.deepcopy`) the arguments. Here's an example implementation:
pt_br: Альтернативним підходом є створення підкласу :class:`Mock` або :class:`MagicMock`, який копіює (за допомогою :func:`copy.deepcopy`) аргументи. Ось приклад реалізації:

source: When you subclass ``Mock`` or ``MagicMock`` all dynamically created attributes, and the ``return_value`` will use your subclass automatically. That means all children of a ``CopyingMock`` will also have the type ``CopyingMock``.
pt_br: Коли ви створюєте підклас ``Mock`` або ``MagicMock``, усі динамічно створені атрибути та ``return_value`` автоматично використовуватимуть ваш підклас. Це означає, що всі нащадки ``CopyingMock`` також матимуть тип ``CopyingMock``.

source: Nesting Patches
pt_br: Патчі гніздування

source: Using patch as a context manager is nice, but if you do multiple patches you can end up with nested with statements indenting further and further to the right::
pt_br: Використовувати patch як менеджер контексту добре, але якщо ви робите кілька патчів, ви можете отримати вкладені з операторами відступи все далі й далі праворуч::

source: With unittest ``cleanup`` functions and the :ref:`start-and-stop` we can achieve the same effect without the nested indentation. A simple helper method, ``create_patch``, puts the patch in place and returns the created mock for us::
pt_br: За допомогою функцій очищення unittest і :ref:`start-and-stop` ми можемо досягти того самого ефекту без вкладеного відступу. Простий допоміжний метод, ``create_patch``, ставить патч на місце та повертає створений макет для нас::

source: Mocking a dictionary with MagicMock
pt_br: Знущання над словником за допомогою MagicMock

source: You may want to mock a dictionary, or other container object, recording all access to it whilst having it still behave like a dictionary.
pt_br: Можливо, ви захочете імітувати словник або інший об’єкт-контейнер, записуючи всі доступи до нього, водночас залишаючи його поведінку як словник.

source: We can do this with :class:`MagicMock`, which will behave like a dictionary, and using :data:`~Mock.side_effect` to delegate dictionary access to a real underlying dictionary that is under our control.
pt_br: Ми можемо зробити це за допомогою :class:`MagicMock`, який поводитиметься як словник, і за допомогою :data:`~Mock.side_effect` для делегування доступу до словника справжньому базовому словнику, який знаходиться під нашим контролем.

source: When the :meth:`~object.__getitem__` and :meth:`~object.__setitem__` methods of our ``MagicMock`` are called (normal dictionary access) then ``side_effect`` is called with the key (and in the case of ``__setitem__`` the value too). We can also control what is returned.
pt_br: Когда вызываются методы :meth:`~object.__getitem__` и :meth:`~object.__setitem__` нашего ``MagicMock`` (обычный доступ к словарю), тогда ``side_effect`` вызывается с ключом (и в в случае ``__setitem__`` значение тоже). Мы также можем контролировать то, что возвращается.

source: After the ``MagicMock`` has been used we can use attributes like :data:`~Mock.call_args_list` to assert about how the dictionary was used:
pt_br: Після використання ``MagicMock`` ми можемо використовувати такі атрибути, як :data:`~Mock.call_args_list`, щоб підтвердити, як використовувався словник:

source: An alternative to using ``MagicMock`` is to use ``Mock`` and *only* provide the magic methods you specifically want:
pt_br: Альтернативою використанню ``MagicMock`` є використання ``Mock`` і *лише* надання магічних методів, які вам потрібні:

source: A *third* option is to use ``MagicMock`` but passing in ``dict`` as the *spec* (or *spec_set*) argument so that the ``MagicMock`` created only has dictionary magic methods available:
pt_br: *Третій* варіант — використовувати ``MagicMock``, але передаючи ``dict`` як аргумент *spec* (або *spec_set*), щоб створений ``MagicMock`` мав доступні лише магічні методи словника:

source: With these side effect functions in place, the ``mock`` will behave like a normal dictionary but recording the access. It even raises a :exc:`KeyError` if you try to access a key that doesn't exist.
pt_br: З цими функціями побічних ефектів ``мокет`` поводитиметься як звичайний словник, але записуватиме доступ. Він навіть викликає :exc:`KeyError`, якщо ви намагаєтеся отримати доступ до ключа, якого не існує.

source: After it has been used you can make assertions about the access using the normal mock methods and attributes:
pt_br: Після його використання ви можете робити твердження щодо доступу за допомогою звичайних методів і атрибутів:

source: Mock subclasses and their attributes
pt_br: Макетні підкласи та їхні атрибути

source: There are various reasons why you might want to subclass :class:`Mock`. One reason might be to add helper methods. Here's a silly example:
pt_br: Існують різні причини, чому ви можете створити підклас :class:`Mock`. Однією з причин може бути додавання допоміжних методів. Ось дурний приклад:

source: The standard behaviour for ``Mock`` instances is that attributes and the return value mocks are of the same type as the mock they are accessed on. This ensures that ``Mock`` attributes are ``Mocks`` and ``MagicMock`` attributes are ``MagicMocks`` [#]_. So if you're subclassing to add helper methods then they'll also be available on the attributes and return value mock of instances of your subclass.
pt_br: Стандартна поведінка екземплярів ``Mock`` полягає в тому, що атрибути та значення, що повертаються mocks, мають той самий тип, що й макет, з якого до них здійснюється доступ. Це гарантує, що атрибути ``Mock`` є ``Mocks``, а ``MagicMock`` атрибути ``MagicMocks`` [#]_. Отже, якщо ви створюєте підкласи для додавання допоміжних методів, вони також будуть доступні в атрибутах і повертаються значеннях екземплярів вашого підкласу.

source: Sometimes this is inconvenient. For example, `one user <https://code.google.com/archive/p/mock/issues/105>`_ is subclassing mock to created a `Twisted adaptor <https://twisted.org/documents/11.0.0/api/twisted.python.components.html>`_. Having this applied to attributes too actually causes errors.
pt_br: Иногда это неудобно. Например, `один пользователь <https://code.google.com/archive/p/mock/issues/105>`_ создает подкласс подкласса для создания `Twisted адаптера <https://twisted.org/documents/11.0 .0/api/twisted.python.comComponents.html>`_. Применение этого и к атрибутам фактически приводит к ошибкам.
