Repository: python/python-docs-pt-br
Catalog: library/unittest.mock-examples.po
Languages: pt_br

source: :mod:`unittest.mock` --- getting started
pt_br: :mod:`unittest.mock` --- primeiros passos

source: Using Mock
pt_br: Usando Mock

source: Mock Patching Methods
pt_br: Métodos de aplicação de patches em Mock

source: Common uses for :class:`Mock` objects include:
pt_br: Usos comuns para objetos :class:`Mock` incluem:

source: Patching methods
pt_br: Métodos de aplicação de patches

source: Recording method calls on objects
pt_br: Método de gravação que invoca objetos

source: You might want to replace a method on an object to check that it is called with the correct arguments by another part of the system:
pt_br: Talvez você queira substituir um método em um objeto para verificar se ele foi chamado com os argumentos corretos por outra parte do sistema:

source: Once our mock has been used (``real.method`` in this example) it has methods and attributes that allow you to make assertions about how it has been used.
pt_br: Depois que nosso mock for usado (``real.method`` neste exemplo), ele terá métodos e atributos que permitem que você faça afirmações sobre como ele foi usado.

source: In most of these examples the :class:`Mock` and :class:`MagicMock` classes are interchangeable. As the ``MagicMock`` is the more capable class it makes a sensible one to use by default.
pt_br: Na maioria desses exemplos, as classes :class:`Mock` e :class:`MagicMock` são intercambiáveis. Como a ``MagicMock`` é a classe mais capaz, ela faz sentido para ser usada por padrão.

source: Once the mock has been called its :attr:`~Mock.called` attribute is set to ``True``. More importantly we can use the :meth:`~Mock.assert_called_with` or :meth:`~Mock.assert_called_once_with` method to check that it was called with the correct arguments.
pt_br: Uma vez que o mock foi chamado, seu atributo :attr:`~Mock.called` é definido como ``True``. Mais importante, podemos usar o método :meth:`~Mock.assert_called_with` ou :meth:`~Mock.assert_called_once_with` para verificar se ele foi chamado com os argumentos corretos.

source: This example tests that calling ``ProductionClass().method`` results in a call to the ``something`` method:
pt_br: Este exemplo testa se a chamada de ``ProductionClass().method`` resulta em uma chamada para o método ``something``:

source: Mock for Method Calls on an Object
pt_br: Mock de chamadas de métodos em um objeto

source: In the last example we patched a method directly on an object to check that it was called correctly. Another common use case is to pass an object into a method (or some part of the system under test) and then check that it is used in the correct way.
pt_br: No último exemplo, aplicamos um patch em um método diretamente em um objeto para verificar se ele foi chamado corretamente. Outro caso de uso comum é passar um objeto para um método (ou alguma parte do sistema em teste) e então verificar se ele é usado da maneira correta.

source: The simple ``ProductionClass`` below has a ``closer`` method. If it is called with an object then it calls ``close`` on it.
pt_br: O ``ProductionClass`` simples abaixo tem um método ``closer``. Se ele for chamado com um objeto, então ele chama ``close`` nele.

source: So to test it we need to pass in an object with a ``close`` method and check that it was called correctly.
pt_br: Então, para testá-lo, precisamos passar um objeto com um método ``close`` e verificar se ele foi chamado corretamente.

source: We don't have to do any work to provide the 'close' method on our mock. Accessing close creates it. So, if 'close' hasn't already been called then accessing it in the test will create it, but :meth:`~Mock.assert_called_with` will raise a failure exception.
pt_br: Não precisamos fazer nenhum trabalho para fornecer o método 'close' em nosso mock. Acessar close o cria. Então, se 'close' ainda não foi chamado, acessá-lo no teste o criará, mas :meth:`~Mock.assert_called_with` levantará uma exceção de falha.

source: Mocking Classes
pt_br: Знущальні класи

source: A common use case is to mock out classes instantiated by your code under test. When you patch a class, then that class is replaced with a mock. Instances are created by *calling the class*. This means you access the "mock instance" by looking at the return value of the mocked class.
pt_br: Поширений випадок використання - це макетування класів, створених вашим тестованим кодом. Коли ви виправляєте клас, цей клас замінюється макетом. Екземпляри створюються шляхом *виклику класу*. Це означає, що ви отримуєте доступ до "макетного екземпляра", дивлячись на значення, що повертається імітованим класом.

source: In the example below we have a function ``some_function`` that instantiates ``Foo`` and calls a method on it. The call to :func:`patch` replaces the class ``Foo`` with a mock. The ``Foo`` instance is the result of calling the mock, so it is configured by modifying the mock :attr:`~Mock.return_value`. ::
pt_br: У наведеному нижче прикладі ми маємо функцію ``some_function``, яка створює екземпляр ``Foo`` і викликає на ньому метод. Виклик :func:`patch` замінює клас ``Foo`` на макет. Екземпляр ``Foo`` є результатом виклику mock, тому він налаштовується шляхом модифікації mock :attr:`~Mock.return_value`. ::

source: Naming your mocks
pt_br: Nomeando os mocks

source: It can be useful to give your mocks a name. The name is shown in the repr of the mock and can be helpful when the mock appears in test failure messages. The name is also propagated to attributes or methods of the mock:
pt_br: Може бути корисно дати своїм макетам назву. Ім’я відображається у відображенні макета та може бути корисним, коли макет з’являється в повідомленнях про помилку тесту. Назва також поширюється на атрибути або методи макета:

source: Tracking all Calls
pt_br: Rastreando todas as chamadas

source: Often you want to track more than a single call to a method. The :attr:`~Mock.mock_calls` attribute records all calls to child attributes of the mock - and also to their children.
pt_br: Frequentemente você quer rastrear mais de uma chamada para um método. O atributo :attr:`~Mock.mock_calls` registra todas as chamadas para atributos filhos do mock - e também para seus filhos.

source: If you make an assertion about ``mock_calls`` and any unexpected methods have been called, then the assertion will fail. This is useful because as well as asserting that the calls you expected have been made, you are also checking that they were made in the right order and with no additional calls:
pt_br: Якщо ви робите твердження щодо ``mock_calls`` і були викликані будь-які неочікувані методи, тоді твердження не вдасться. Це корисно, оскільки ви не тільки стверджуєте, що дзвінки, які ви очікували, були здійснені, але й перевіряєте, що вони були здійснені в правильному порядку та без додаткових дзвінків:

source: You use the :data:`call` object to construct lists for comparing with ``mock_calls``:
pt_br: Ви використовуєте об’єкт :data:`call` для створення списків для порівняння з ``mock_calls``:

source: However, parameters to calls that return mocks are not recorded, which means it is not possible to track nested calls where the parameters used to create ancestors are important:
pt_br: Однак параметри викликів, які повертають імітації, не записуються, що означає, що неможливо відстежувати вкладені виклики, де важливі параметри, які використовуються для створення предків:

source: Setting Return Values and Attributes
pt_br: Налаштування повернених значень і атрибутів

source: Setting the return values on a mock object is trivially easy:
pt_br: Встановлення повернених значень для макетного об’єкта тривіально легко:

source: Of course you can do the same for methods on the mock:
pt_br: Звичайно, ви можете зробити те саме для методів на mock:

source: The return value can also be set in the constructor:
pt_br: Повернене значення також можна встановити в конструкторі:

source: If you need an attribute setting on your mock, just do it:
pt_br: Якщо вам потрібне налаштування атрибута на макеті, просто зробіть це:

source: Sometimes you want to mock up a more complex situation, like for example ``mock.connection.cursor().execute("SELECT 1")``. If we wanted this call to return a list, then we have to configure the result of the nested call.
pt_br: Іноді потрібно змакувати складнішу ситуацію, як, наприклад, ``mock.connection.cursor().execute("SELECT 1")``. Якщо ми хочемо, щоб цей виклик повертав список, ми повинні налаштувати результат вкладеного виклику.

source: We can use :data:`call` to construct the set of calls in a "chained call" like this for easy assertion afterwards:
pt_br: Ми можемо використовувати :data:`call`, щоб створити набір викликів у "ланцюжковому виклику", подібному до цього для легкого твердження згодом:

source: It is the call to ``.call_list()`` that turns our call object into a list of calls representing the chained calls.
pt_br: Саме виклик ``.call_list()`` перетворює наш об’єкт виклику на список викликів, що представляють ланцюгові виклики.

source: Raising exceptions with mocks
pt_br: Створення винятків за допомогою моків

source: A useful attribute is :attr:`~Mock.side_effect`. If you set this to an exception class or instance then the exception will be raised when the mock is called.
pt_br: Корисним атрибутом є :attr:`~Mock.side_effect`. Якщо ви встановите це як клас винятку або екземпляр, тоді виняток буде викликано під час виклику макета.

source: Side effect functions and iterables
pt_br: Функції побічних ефектів та ітерації

source: ``side_effect`` can also be set to a function or an iterable. The use case for ``side_effect`` as an iterable is where your mock is going to be called several times, and you want each call to return a different value. When you set ``side_effect`` to an iterable every call to the mock returns the next value from the iterable:
pt_br: ``side_effect`` також може бути встановлено як функція або iterable. Варіант використання ``side_effect`` як ітерації полягає в тому, що ваш макет буде викликатися кілька разів, і ви хочете, щоб кожен виклик повертав інше значення. Коли ви встановлюєте ``side_effect`` на iterable, кожен виклик mock повертає наступне значення з iterable:

source: For more advanced use cases, like dynamically varying the return values depending on what the mock is called with, ``side_effect`` can be a function. The function will be called with the same arguments as the mock. Whatever the function returns is what the call returns:
pt_br: Для більш складних випадків використання, як-от динамічне змінення повернених значень залежно від того, з чим викликається макет, ``side_effect`` може бути функцією. Функція буде викликана з тими самими аргументами, що й макет. Усе, що повертає функція, повертає виклик:

source: Mocking asynchronous iterators
pt_br: Знущання над асинхронними ітераторами

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-iterators` through ``__aiter__``. The :attr:`~Mock.return_value` attribute of ``__aiter__`` can be used to set the return values to be used for iteration.
pt_br: Починаючи з Python 3.8, ``AsyncMock`` і ``MagicMock`` підтримують імітацію :ref:`async-iterators` через ``__aiter__``. Атрибут :attr:`~Mock.return_value` ``__aiter__`` можна використовувати для встановлення повернених значень, які будуть використовуватися для ітерації.

source: Mocking asynchronous context manager
pt_br: Знущання над асинхронним контекстним менеджером

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-context-managers` through ``__aenter__`` and ``__aexit__``. By default, ``__aenter__`` and ``__aexit__`` are ``AsyncMock`` instances that return an async function.
pt_br: Починаючи з Python 3.8, ``AsyncMock`` і ``MagicMock`` підтримують імітацію :ref:`async-context-managers` через ``__aenter__`` і ``__aexit__``. За замовчуванням ``__aenter__`` і ``__aexit__`` є екземплярами ``AsyncMock``, які повертають асинхронну функцію.

source: Creating a Mock from an Existing Object
pt_br: Створення макету з існуючого об’єкта

source: One problem with over use of mocking is that it couples your tests to the implementation of your mocks rather than your real code. Suppose you have a class that implements ``some_method``. In a test for another class, you provide a mock of this object that *also* provides ``some_method``. If later you refactor the first class, so that it no longer has ``some_method`` - then your tests will continue to pass even though your code is now broken!
pt_br: Однією з проблем із надмірним використанням mocking є те, що воно поєднує ваші тести з реалізацією ваших mocks, а не з вашим реальним кодом. Припустімо, у вас є клас, який реалізує ``some_method``. У тесті для іншого класу ви надаєте макет цього об’єкта, який *також* надає ``some_method``. Якщо пізніше ви переробите перший клас, щоб він більше не мав ``some_method``, тоді ваші тести продовжуватимуть проходити, навіть якщо ваш код зараз зламаний!

source: :class:`Mock` allows you to provide an object as a specification for the mock, using the *spec* keyword argument. Accessing methods / attributes on the mock that don't exist on your specification object will immediately raise an attribute error. If you change the implementation of your specification, then tests that use that class will start failing immediately without you having to instantiate the class in those tests.
pt_br: :class:`Mock` дозволяє вам надати об’єкт як специфікацію для mock, використовуючи аргумент ключового слова *spec*. Доступ до методів/атрибутів у макеті, які не існують у вашому об’єкті специфікації, негайно призведе до помилки атрибута. Якщо ви зміните реалізацію вашої специфікації, тоді тести, які використовують цей клас, негайно почнуть виходити з ладу без необхідності створення екземпляра класу в цих тестах.

source: Using a specification also enables a smarter matching of calls made to the mock, regardless of whether some parameters were passed as positional or named arguments::
pt_br: Використання специфікації також дає змогу розумніше зіставляти виклики, зроблені для mock, незалежно від того, чи були деякі параметри передані як позиційні чи іменовані аргументи:

source: If you want this smarter matching to also work with method calls on the mock, you can use :ref:`auto-speccing <auto-speccing>`.
pt_br: Якщо ви бажаєте, щоб ця розумніша відповідність також працювала з викликами методів на mock, ви можете використовувати :ref:`auto-speccing <auto-speccing>`.

source: If you want a stronger form of specification that prevents the setting of arbitrary attributes as well as the getting of them then you can use *spec_set* instead of *spec*.
pt_br: Якщо вам потрібна сильніша форма специфікації, яка запобігає встановленню довільних атрибутів, а також їх отриманню, ви можете використовувати *spec_set* замість *spec*.

source: Using side_effect to return per file content
pt_br: Использование Side_effect для возврата содержимого файла

source: :func:`mock_open` is used to patch :func:`open` method. :attr:`~Mock.side_effect` can be used to return a new Mock object per call. This can be used to return different contents per file stored in a dictionary::
pt_br: :func:`mock_open` используется для исправления метода :func:`open`. :attr:`~Mock.side_effect` можно использовать для возврата нового объекта Mock при каждом вызове. Это можно использовать для возврата различного содержимого для каждого файла, хранящегося в словаре::

source: Patch Decorators
pt_br: Декоратори патчів

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
pt_br: Com :func:`patch`, é importante que você faça o patch de objetos no espaço de nomes onde eles são procurados. Normalmente, isso é simples, mas para um guia rápido, leia :ref:`onde fazer o patch <where-to-patch>`.

source: A common need in tests is to patch a class attribute or a module attribute, for example patching a builtin or patching a class in a module to test that it is instantiated. Modules and classes are effectively global, so patching on them has to be undone after the test or the patch will persist into other tests and cause hard to diagnose problems.
pt_br: Загальною потребою в тестах є виправлення атрибута класу або атрибута модуля, наприклад, виправлення вбудованого модуля або виправлення класу в модулі, щоб перевірити, чи створено його екземпляр. Модулі та класи фактично є глобальними, тому після тесту потрібно скасувати їх виправлення, інакше виправлення збережеться в інших тестах і спричинить проблеми, які важко діагностувати.

source: mock provides three convenient decorators for this: :func:`patch`, :func:`patch.object` and :func:`patch.dict`. ``patch`` takes a single string, of the form ``package.module.Class.attribute`` to specify the attribute you are patching. It also optionally takes a value that you want the attribute (or class or whatever) to be replaced with. 'patch.object' takes an object and the name of the attribute you would like patched, plus optionally the value to patch it with.
pt_br: mock надає для цього три зручні декоратори: :func:`patch`, :func:`patch.object` і :func:`patch.dict`. ``patch`` приймає один рядок у формі ``package.module.Class.attribute``, щоб визначити атрибут, який ви виправляєте. Він також необов’язково приймає значення, яким ви бажаєте замінити атрибут (або клас чи щось інше). 'patch.object' приймає об'єкт і ім'я атрибута, який ви бажаєте виправити, а також необов'язково значення, з яким його потрібно виправити.

source: If you are patching a module (including :mod:`builtins`) then use :func:`patch` instead of :func:`patch.object`:
pt_br: Якщо ви виправляєте модуль (включаючи :mod:`builtins`), використовуйте :func:`patch` замість :func:`patch.object`:

source: The module name can be 'dotted', in the form ``package.module`` if needed::
pt_br: Ім’я модуля може бути розділене крапкою у формі ``package.module``, якщо необхідно:

source: A nice pattern is to actually decorate test methods themselves:
pt_br: Хороший зразок — це фактично прикрасити самі методи тестування:

source: If you want to patch with a Mock, you can use :func:`patch` with only one argument (or :func:`patch.object` with two arguments). The mock will be created for you and passed into the test function / method:
pt_br: Якщо ви хочете виправити за допомогою Mock, ви можете використовувати :func:`patch` лише з одним аргументом (або :func:`patch.object` з двома аргументами). Макет буде створено для вас і передано в тестову функцію/метод:

source: You can stack up multiple patch decorators using this pattern::
pt_br: Ви можете скласти кілька декораторів патчів, використовуючи цей шаблон:

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``test_module.ClassName2`` is passed in first.
pt_br: Коли ви вкладаєте декоратори латок, макети передаються до декорованої функції в тому ж порядку, в якому вони застосовані (звичайний *Python* порядок застосування декораторів). Це означає знизу вгору, тому у наведеному вище прикладі спочатку передається макет для ``test_module.ClassName2``.

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
pt_br: Também existe :func:`patch.dict` para definir valores em um dicionário apenas durante um escopo e restaurar o dicionário ao seu estado original quando o teste termina:

source: ``patch``, ``patch.object`` and ``patch.dict`` can all be used as context managers.
pt_br: ``patch``, ``patch.object`` і ``patch.dict`` можна використовувати як контекстні менеджери.

source: Where you use :func:`patch` to create a mock for you, you can get a reference to the mock using the "as" form of the with statement:
pt_br: Там, де ви використовуєте :func:`patch` для створення макету, ви можете отримати посилання на макет за допомогою форми "as" оператора with:

source: As an alternative ``patch``, ``patch.object`` and ``patch.dict`` can be used as class decorators. When used in this way it is the same as applying the decorator individually to every method whose name starts with "test".
pt_br: Як альтернативу ``patch``, ``patch.object`` і ``patch.dict`` можна використовувати як декоратори класів. При такому використанні це те саме, що застосувати декоратор окремо до кожного методу, назва якого починається з "test".

source: Further Examples
pt_br: Подальші приклади

source: Here are some more examples for some slightly more advanced scenarios.
pt_br: Ось ще кілька прикладів для деяких трохи складніших сценаріїв.

source: Mocking chained calls
pt_br: Знущальні ланцюгові дзвінки

source: Mocking chained calls is actually straightforward with mock once you understand the :attr:`~Mock.return_value` attribute. When a mock is called for the first time, or you fetch its ``return_value`` before it has been called, a new :class:`Mock` is created.
pt_br: Висмішувати ланцюгові виклики насправді просто за допомогою mock, коли ви розумієте атрибут :attr:`~Mock.return_value`. Коли макет викликається вперше або ви отримуєте його ``return_value`` до його виклику, створюється новий :class:`Mock`.

source: This means that you can see how the object returned from a call to a mocked object has been used by interrogating the ``return_value`` mock:
pt_br: Це означає, що ви можете побачити, як об’єкт, повернутий викликом імітованого об’єкта, використовувався, запитуючи макет ``return_value``:

source: From here it is a simple step to configure and then make assertions about chained calls. Of course another alternative is writing your code in a more testable way in the first place...
pt_br: Звідси це простий крок, щоб налаштувати та зробити твердження щодо ланцюжкових викликів. Звісно, іншою альтернативою є написання коду більш придатним для перевірки способом...

source: So, suppose we have some code that looks a little bit like this:
pt_br: Отже, припустімо, що ми маємо код, який виглядає приблизно так:

source: Assuming that ``BackendProvider`` is already well tested, how do we test ``method()``? Specifically, we want to test that the code section ``# more code`` uses the response object in the correct way.
pt_br: Якщо припустити, що ``BackendProvider`` вже добре перевірено, як ми перевіримо ``method()``? Зокрема, ми хочемо перевірити, чи розділ коду ``# more code`` правильно використовує об’єкт відповіді.

source: As this chain of calls is made from an instance attribute we can monkey patch the ``backend`` attribute on a ``Something`` instance. In this particular case we are only interested in the return value from the final call to ``start_call`` so we don't have much configuration to do. Let's assume the object it returns is 'file-like', so we'll ensure that our response object uses the builtin :func:`open` as its ``spec``.
pt_br: Оскільки цей ланцюжок викликів здійснюється з атрибута екземпляра, ми можемо виправити атрибут ``backend`` на екземплярі ``Something``. У цьому конкретному випадку нас цікавить лише значення, яке повертає останній виклик ``start_call``, тому нам не потрібно робити багато налаштувань. Припустімо, що об’єкт, який він повертає, є "файлоподібним", тому ми переконаємося, що наш об’єкт відповіді використовує вбудований :func:`open` як свою ``специфікацію``.
