Repository: python/python-docs-pt-br
Catalog: library/unittest.mock.po
Languages: pt_br

source: In addition you can pass ``spec=True`` or ``spec_set=True``, which causes patch to pass in the object being mocked as the spec/spec_set object.
pt_br: Крім того, ви можете передати ``spec=True`` або ``spec_set=True``, що спричиняє передачу латки в об’єкті, який імітується, як об’єкт spec/spec_set.

source: *new_callable* allows you to specify a different class, or callable object, that will be called to create the *new* object. By default :class:`AsyncMock` is used for async functions and :class:`MagicMock` for the rest.
pt_br: *new_callable* дозволяє вказати інший клас або викликаний об’єкт, який буде викликано для створення *нового* об’єкта. За замовчуванням :class:`AsyncMock` використовується для асинхронних функцій, а :class:`MagicMock` для решти.

source: A more powerful form of *spec* is *autospec*. If you set ``autospec=True`` then the mock will be created with a spec from the object being replaced. All attributes of the mock will also have the spec of the corresponding attribute of the object being replaced. Methods and functions being mocked will have their arguments checked and will raise a :exc:`TypeError` if they are called with the wrong signature. For mocks replacing a class, their return value (the 'instance') will have the same spec as the class. See the :func:`create_autospec` function and :ref:`auto-speccing`.
pt_br: Більш потужною формою *spec* є *autospec*. Якщо ви встановите ``autospec=True``, макет буде створено зі специфікацією об’єкта, який замінюється. Усі атрибути макета також матимуть специфікацію відповідного атрибута об’єкта, який замінюється. Методи та функції, які знущаються, перевірятимуть аргументи та викличуть :exc:`TypeError`, якщо вони викликані з неправильним підписом. Для моків, які замінюють клас, їх значення, що повертається ("екземпляр") матиме ту саму специфікацію, що й клас. Перегляньте функцію :func:`create_autospec` і :ref:`auto-speccing`.

source: Instead of ``autospec=True`` you can pass ``autospec=some_object`` to use an arbitrary object as the spec instead of the one being replaced.
pt_br: Замість ``autospec=True`` ви можете передати ``autospec=some_object``, щоб використовувати довільний об’єкт як специфікацію замість того, що замінюється.

source: By default :func:`patch` will fail to replace attributes that don't exist. If you pass in ``create=True``, and the attribute doesn't exist, patch will create the attribute for you when the patched function is called, and delete it again after the patched function has exited. This is useful for writing tests against attributes that your production code creates at runtime. It is off by default because it can be dangerous. With it switched on you can write passing tests against APIs that don't actually exist!
pt_br: За замовчуванням :func:`patch` не зможе замінити атрибути, яких не існує. Якщо ви передаєте ``create=True``, а атрибут не існує, patch створить атрибут для вас під час виклику виправленої функції та видалить його знову після завершення виправленої функції. Це корисно для написання тестів щодо атрибутів, які ваш робочий код створює під час виконання. За умовчанням його вимкнено, оскільки це може бути небезпечно. Якщо його ввімкнути, ви можете писати тести проходження проти API, яких насправді не існує!

source: If you are patching builtins in a module then you don't need to pass ``create=True``, it will be added by default.
pt_br: Якщо ви виправляєте вбудовані компоненти в модулі, вам не потрібно передавати ``create=True``, він буде доданий за замовчуванням.

source: Patch can be used as a context manager, with the with statement. Here the patching applies to the indented block after the with statement. If you use "as" then the patched object will be bound to the name after the "as"; very useful if :func:`patch` is creating a mock object for you.
pt_br: Патч можна використовувати як менеджер контексту за допомогою оператора with. Тут виправлення застосовується до блоку з відступом після оператора with. Якщо ви використовуєте "as", тоді виправлений об’єкт буде прив’язаний до імені після "as"; дуже корисно, якщо :func:`patch` створює для вас макет об’єкта.

source: :func:`patch` takes arbitrary keyword arguments. These will be passed to :class:`AsyncMock` if the patched object is asynchronous, to :class:`MagicMock` otherwise or to *new_callable* if specified.
pt_br: :func:`patch` приймає довільні ключові аргументи. Вони будуть передані до :class:`AsyncMock`, якщо виправлений об’єкт є асинхронним, до :class:`MagicMock` інакше або до *new_callable*, якщо вказано.

source: ``patch.dict(...)``, ``patch.multiple(...)`` and ``patch.object(...)`` are available for alternate use-cases.
pt_br: ``patch.dict(...)``, ``patch.multiple(...)`` e ``patch.object(...)`` estão disponíveis para casos de uso alternativos.

source: :func:`patch` as function decorator, creating the mock for you and passing it into the decorated function::
pt_br: :func:`patch` як декоратор функції, створює макет для вас і передає його в декоровану функцію::

source: Patching a class replaces the class with a :class:`MagicMock` *instance*. If the class is instantiated in the code under test then it will be the :attr:`~Mock.return_value` of the mock that will be used.
pt_br: Виправлення класу замінює клас на *екземпляр* :class:`MagicMock`. Якщо екземпляр класу створено в тестованому коді, тоді використовуватиметься :attr:`~Mock.return_value` макету.

source: If the class is instantiated multiple times you could use :attr:`~Mock.side_effect` to return a new mock each time. Alternatively you can set the *return_value* to be anything you want.
pt_br: Якщо екземпляр класу створюється кілька разів, ви можете використовувати :attr:`~Mock.side_effect`, щоб щоразу повертати новий макет. Крім того, ви можете встановити *return_value* як будь-яке значення.

source: If you use *spec* or *spec_set* and :func:`patch` is replacing a *class*, then the return value of the created mock will have the same spec. ::
pt_br: Якщо ви використовуєте *spec* або *spec_set* і :func:`patch` замінює *клас*, тоді значення, що повертається створеним макетом, матиме ту саму специфікацію. ::

source: The *new_callable* argument is useful where you want to use an alternative class to the default :class:`MagicMock` for the created mock. For example, if you wanted a :class:`NonCallableMock` to be used::
pt_br: Аргумент *new_callable* корисний, якщо ви хочете використовувати клас, альтернативний типовому :class:`MagicMock` для створеного макету. Наприклад, якщо ви хочете використовувати :class:`NonCallableMock`:

source: Another use case might be to replace an object with an :class:`io.StringIO` instance::
pt_br: Іншим варіантом використання може бути заміна об’єкта екземпляром :class:`io.StringIO`::

source: When :func:`patch` is creating a mock for you, it is common that the first thing you need to do is to configure the mock. Some of that configuration can be done in the call to patch. Any arbitrary keywords you pass into the call will be used to set attributes on the created mock::
pt_br: Коли :func:`patch` створює для вас макет, зазвичай перше, що вам потрібно зробити, це налаштувати макет. Частину цієї конфігурації можна виконати під час виклику patch. Будь-які довільні ключові слова, які ви передаєте у виклик, використовуватимуться для встановлення атрибутів створеного mock::

source: As well as attributes on the created mock attributes, like the :attr:`~Mock.return_value` and :attr:`~Mock.side_effect`, of child mocks can also be configured. These aren't syntactically valid to pass in directly as keyword arguments, but a dictionary with these as keys can still be expanded into a :func:`patch` call using ``**``::
pt_br: Крім атрибутів у створених макетних атрибутах, таких як :attr:`~Mock.return_value` і :attr:`~Mock.side_effect`, дочірніх макетів також можна налаштувати. Вони не є синтаксично дійсними для безпосередньої передачі як аргументи ключового слова, але словник із ними як ключами все одно можна розгорнути у виклик :func:`patch` за допомогою ``**``::

source: By default, attempting to patch a function in a module (or a method or an attribute in a class) that does not exist will fail with :exc:`AttributeError`::
pt_br: За замовчуванням спроба виправити функцію в модулі (або метод чи атрибут у класі), який не існує, закінчиться помилкою з :exc:`AttributeError`::

source: but adding ``create=True`` in the call to :func:`patch` will make the previous example work as expected::
pt_br: але додавання ``create=True`` до виклику :func:`patch` змусить попередній приклад працювати належним чином::

source: :func:`patch` now returns an :class:`AsyncMock` if the target is an async function.
pt_br: :func:`patch` тепер повертає :class:`AsyncMock`, якщо метою є асинхронна функція.

source: patch the named member (*attribute*) on an object (*target*) with a mock object.
pt_br: заправити названий член (*атрибут*) на об’єкті (*ціль*) за допомогою макетного об’єкта.

source: :func:`patch.object` can be used as a decorator, class decorator or a context manager. Arguments *new*, *spec*, *create*, *spec_set*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. Like :func:`patch`, :func:`patch.object` takes arbitrary keyword arguments for configuring the mock object it creates.
pt_br: :func:`patch.object` можна використовувати як декоратор, декоратор класу або менеджер контексту. Аргументи *new*, *spec*, *create*, *spec_set*, *autospec* і *new_callable* мають те саме значення, що й для :func:`patch`. Подібно до :func:`patch`, :func:`patch.object` приймає довільні ключові аргументи для налаштування макетного об’єкта, який він створює.

source: When used as a class decorator :func:`patch.object` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
pt_br: При використанні як декоратора класу :func:`patch.object` враховує ``patch.TEST_PREFIX`` для вибору методів для обгортання.

source: You can either call :func:`patch.object` with three arguments or two arguments. The three argument form takes the object to be patched, the attribute name and the object to replace the attribute with.
pt_br: Ви можете викликати :func:`patch.object` з трьома або двома аргументами. Форма з трьома аргументами містить об’єкт, який потрібно виправити, ім’я атрибута та об’єкт, на який потрібно замінити атрибут.

source: When calling with the two argument form you omit the replacement object, and a mock is created for you and passed in as an extra argument to the decorated function:
pt_br: Під час виклику з формою з двома аргументами ви пропускаєте об’єкт заміни, і для вас створюється макет, який передається як додатковий аргумент до декорованої функції:

source: *spec*, *create* and the other arguments to :func:`patch.object` have the same meaning as they do for :func:`patch`.
pt_br: *spec*, *create* та інші аргументи для :func:`patch.object` мають те саме значення, що й для :func:`patch`.

source: Patch a dictionary, or dictionary like object, and restore the dictionary to its original state after the test.
pt_br: Виправте словник або об’єкт, схожий на словник, і відновіть словник до початкового стану після тесту.

source: *in_dict* can be a dictionary or a mapping like container. If it is a mapping then it must at least support getting, setting and deleting items plus iterating over keys.
pt_br: *in_dict* може бути словником або контейнером, схожим на відображення. Якщо це відображення, то воно повинно принаймні підтримувати отримання, встановлення та видалення елементів, а також ітерацію по ключах.

source: *in_dict* can also be a string specifying the name of the dictionary, which will then be fetched by importing it.
pt_br: *in_dict* також може бути рядком, що визначає назву словника, який потім буде отримано шляхом його імпорту.

source: *values* can be a dictionary of values to set in the dictionary. *values* can also be an iterable of ``(key, value)`` pairs.
pt_br: *values* може бути словником значень для встановлення в словнику. *значення* також можуть бути повторюваними парами ``(ключ, значення)``.

source: If *clear* is true then the dictionary will be cleared before the new values are set.
pt_br: Якщо *clear* має значення true, словник буде очищено перед встановленням нових значень.

source: :func:`patch.dict` can also be called with arbitrary keyword arguments to set values in the dictionary.
pt_br: :func:`patch.dict` також можна викликати з довільними ключовими аргументами для встановлення значень у словнику.

source: :func:`patch.dict` now returns the patched dictionary when used as a context manager.
pt_br: :func:`patch.dict` тепер повертає виправлений словник, коли використовується як менеджер контексту.

source: :func:`patch.dict` can be used as a context manager, decorator or class decorator:
pt_br: :func:`patch.dict` можна використовувати як контекстний менеджер, декоратор або декоратор класу:

source: When used as a class decorator :func:`patch.dict` honours ``patch.TEST_PREFIX`` (default to ``'test'``) for choosing which methods to wrap:
pt_br: Коли використовується як декоратор класу, :func:`patch.dict` враховує ``patch.TEST_PREFIX`` (за замовчуванням ``'test'``) для вибору методів для обгортання:

source: If you want to use a different prefix for your test, you can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``. For more details about how to change the value of see :ref:`test-prefix`.
pt_br: Якщо ви хочете використовувати інший префікс для свого тесту, ви можете повідомити патчерів про інший префікс, встановивши ``patch.TEST_PREFIX``. Докладніше про те, як змінити значення див. :ref:`test-prefix`.

source: :func:`patch.dict` can be used to add members to a dictionary, or simply let a test change a dictionary, and ensure the dictionary is restored when the test ends.
pt_br: :func:`patch.dict` можна використовувати для додавання членів до словника або просто дозволити тесту змінити словник і переконатися, що словник буде відновлено після завершення тесту.

source: Keywords can be used in the :func:`patch.dict` call to set values in the dictionary:
pt_br: Ключові слова можна використовувати у виклику :func:`patch.dict` для встановлення значень у словнику:

source: :func:`patch.dict` can be used with dictionary like objects that aren't actually dictionaries. At the very minimum they must support item getting, setting, deleting and either iteration or membership test. This corresponds to the magic methods :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` and either :meth:`~container.__iter__` or :meth:`~object.__contains__`.
pt_br: :func:`patch.dict` можно использовать со словарными объектами, которые на самом деле словарями не являются. Как минимум, они должны поддерживать получение, установку, удаление элементов, а также итерацию или проверку членства. Это соответствует магическим методам :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__` и либо :meth:`~container.__iter__`, либо :meth: `~object.__contains__`.

source: Perform multiple patches in a single call. It takes the object to be patched (either as an object or a string to fetch the object by importing) and keyword arguments for the patches::
pt_br: Виконайте кілька патчів за один виклик. Він приймає об’єкт, який потрібно виправити (або як об’єкт, або рядок для отримання об’єкта шляхом імпорту), а також ключові аргументи для патчів::

source: Use :data:`DEFAULT` as the value if you want :func:`patch.multiple` to create mocks for you. In this case the created mocks are passed into a decorated function by keyword, and a dictionary is returned when :func:`patch.multiple` is used as a context manager.
pt_br: Використовуйте :data:`DEFAULT` як значення, якщо ви хочете, щоб :func:`patch.multiple` створював для вас макети. У цьому випадку створені макети передаються в декоровану функцію за ключовим словом, а словник повертається, коли :func:`patch.multiple` використовується як менеджер контексту.

source: :func:`patch.multiple` can be used as a decorator, class decorator or a context manager. The arguments *spec*, *spec_set*, *create*, *autospec* and *new_callable* have the same meaning as for :func:`patch`. These arguments will be applied to *all* patches done by :func:`patch.multiple`.
pt_br: :func:`patch.multiple` можна використовувати як декоратор, декоратор класу або менеджер контексту. Аргументи *spec*, *spec_set*, *create*, *autospec* і *new_callable* мають те саме значення, що й для :func:`patch`. Ці аргументи будуть застосовані до *всіх* патчів, створених :func:`patch.multiple`.

source: When used as a class decorator :func:`patch.multiple` honours ``patch.TEST_PREFIX`` for choosing which methods to wrap.
pt_br: При використанні як декоратор класу :func:`patch.multiple` враховує ``patch.TEST_PREFIX`` для вибору методів для обгортання.

source: If you want :func:`patch.multiple` to create mocks for you, then you can use :data:`DEFAULT` as the value. If you use :func:`patch.multiple` as a decorator then the created mocks are passed into the decorated function by keyword. ::
pt_br: Якщо ви хочете, щоб :func:`patch.multiple` створював для вас макети, ви можете використовувати :data:`DEFAULT` як значення. Якщо ви використовуєте :func:`patch.multiple` як декоратор, тоді створені макети передаються в декоровану функцію за ключовим словом. ::

source: :func:`patch.multiple` can be nested with other ``patch`` decorators, but put arguments passed by keyword *after* any of the standard arguments created by :func:`patch`::
pt_br: :func:`patch.multiple` можна вкладати в інші декоратори ``patch``, але розміщувати аргументи, передані ключовим словом *після* будь-яких стандартних аргументів, створених :func:`patch`::

source: If :func:`patch.multiple` is used as a context manager, the value returned by the context manager is a dictionary where created mocks are keyed by name::
pt_br: Якщо :func:`patch.multiple` використовується як менеджер контексту, значення, яке повертає менеджер контексту, є словником, у якому створені макети вказуються за назвою::

source: patch methods: start and stop
pt_br: métodos do patch: *start* e *stop*

source: If you are using :func:`patch` to create a mock for you then it will be returned by the call to ``patcher.start``. ::
pt_br: Якщо ви використовуєте :func:`patch` для створення макету, його буде повернено викликом ``patcher.start``. ::

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the ``setUp`` then ``tearDown`` is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
pt_br: Якщо ви використовуєте цю техніку, ви повинні переконатися, що виправлення "скасовано", викликавши ``stop``. Це може бути складніше, ніж ви могли б подумати, оскільки якщо в ``setUp`` виникає виняток, ``tearDown`` не викликається. :meth:`unittest.TestCase.addCleanup` полегшує це::

source: As an added bonus you no longer need to keep a reference to the ``patcher`` object.
pt_br: Як додатковий бонус, вам більше не потрібно зберігати посилання на об’єкт ``patcher``.

source: It is also possible to stop all patches which have been started by using :func:`patch.stopall`.
pt_br: Також можна зупинити всі запущені латки за допомогою :func:`patch.stopall`.

source: Stop all active patches. Only stops patches started with ``start``.
pt_br: Зупинити всі активні патчі. Зупиняє лише патчі, розпочаті з ``start``.

source: patch builtins
pt_br: patch de embutidos

source: You can patch any builtins within a module. The following example patches builtin :func:`ord`::
pt_br: Ви можете виправляти будь-які вбудовані компоненти в модулі. Наступні приклади патчів вбудовані в :func:`ord`::

source: All of the patchers can be used as class decorators. When used in this way they wrap every test method on the class. The patchers recognise methods that start with ``'test'`` as being test methods. This is the same way that the :class:`unittest.TestLoader` finds test methods by default.
pt_br: Усі патчери можна використовувати як декоратори класів. При такому використанні вони загортають кожен тестовий метод у клас. Патчери розпізнають методи, які починаються з ``'test'``, як методи тестування. Таким же чином :class:`unittest.TestLoader` знаходить тестові методи за замовчуванням.

source: It is possible that you want to use a different prefix for your tests. You can inform the patchers of the different prefix by setting ``patch.TEST_PREFIX``::
pt_br: Можливо, ви хочете використовувати інший префікс для своїх тестів. Ви можете повідомити патчерів про інший префікс, встановивши ``patch.TEST_PREFIX``::

source: Nesting Patch Decorators
pt_br: Aninhando Decoradores Patch

source: If you want to perform multiple patches then you can simply stack up the decorators.
pt_br: Якщо ви хочете виконати кілька патчів, ви можете просто скласти декоратори.

source: You can stack up multiple patch decorators using this pattern:
pt_br: Ви можете скласти кілька декораторів патчів, використовуючи цей шаблон:

source: Note that the decorators are applied from the bottom upwards. This is the standard way that Python applies decorators. The order of the created mocks passed into your test function matches this order.
pt_br: Зверніть увагу, що декоратори наносяться знизу вгору. Це стандартний спосіб, у який Python застосовує декоратори. Порядок створених макетів, переданих у вашу тестову функцію, відповідає цьому порядку.

source: Where to patch
pt_br: Onde fazer patch

source: :func:`patch` works by (temporarily) changing the object that a *name* points to with another one. There can be many names pointing to any individual object, so for patching to work you must ensure that you patch the name used by the system under test.
pt_br: :func:`patch` працює, (тимчасово) змінюючи об’єкт, на який вказує *ім’я*, на інший. Може бути багато імен, які вказують на будь-який окремий об’єкт, тому, щоб виправлення працювало, ви повинні переконатися, що ви виправляєте ім’я, яке використовує тестована система.

source: The basic principle is that you patch where an object is *looked up*, which is not necessarily the same place as where it is defined. A couple of examples will help to clarify this.
pt_br: Основний принцип полягає в тому, що ви виправляєте там, де об’єкт *переглядається*, що не обов’язково є тим самим місцем, де він визначений. Кілька прикладів допоможуть прояснити це.

source: Imagine we have a project that we want to test with the following structure::
pt_br: Уявіть, що у нас є проект, який ми хочемо перевірити з такою структурою:

source: The key is to patch out ``SomeClass`` where it is used (or where it is looked up). In this case ``some_function`` will actually look up ``SomeClass`` in module b, where we have imported it. The patching should look like::
pt_br: Головне – виправити ``SomeClass`` там, де він використовується (або де його шукають). У цьому випадку ``some_function`` фактично шукатиме ``SomeClass`` у модулі b, куди ми його імпортували. Виправлення має виглядати:

source: However, consider the alternative scenario where instead of ``from a import SomeClass`` module b does ``import a`` and ``some_function`` uses ``a.SomeClass``. Both of these import forms are common. In this case the class we want to patch is being looked up in the module and so we have to patch ``a.SomeClass`` instead::
pt_br: Однак розглянемо альтернативний сценарій, де замість ``from a import SomeClass`` модуль b виконує ``імпорт a``, а ``some_function`` використовує ``a.SomeClass``. Обидві ці форми імпорту поширені. У цьому випадку клас, який ми хочемо виправити, шукається в модулі, тому ми повинні замість цього виправити ``a.SomeClass``::

source: Patching Descriptors and Proxy Objects
pt_br: Виправлення дескрипторів і проксі-об’єктів
