Repository: python/python-docs-pt-br
Catalog: library/unittest.mock.po
Languages: pt_br

source: Both patch_ and patch.object_ correctly patch and restore descriptors: class methods, static methods and properties. You should patch these on the *class* rather than an instance. They also work with *some* objects that proxy attribute access, like the `django settings object <https://web.archive.org/web/20200603181648/http://www.voidspace.org.uk/python/weblog/arch_d7_2010_12_04.shtml#e1198>`_.
pt_br: И patch_, и patch.object_ корректно исправляют и восстанавливают дескрипторы: методы класса, статические методы и свойства. Вам следует исправлять их в *классе*, а не в экземпляре. Они также работают с *некоторыми* объектами, которые имеют доступ к атрибутам прокси, например, с объектом настроек django <https://web.archive.org/web/20200603181648/http://www.voidspace.org.uk/python/weblog/ Arch_d7_2010_12_04.shtml#e1198>`_.

source: MagicMock and magic method support
pt_br: Підтримка MagicMock і магічного методу

source: Mocking Magic Methods
pt_br: Simulando Métodos Mágicos

source: :class:`Mock` supports mocking the Python protocol methods, also known as :term:`"magic methods" <magic method>`. This allows mock objects to replace containers or other objects that implement Python protocols.
pt_br: :class:`Mock` поддерживает имитацию методов протокола Python, также известных как :term:`"магические методы" <магический метод>`. Это позволяет макетным объектам заменять контейнеры или другие объекты, реализующие протоколы Python.

source: Because magic methods are looked up differently from normal methods [#]_, this support has been specially implemented. This means that only specific magic methods are supported. The supported list includes *almost* all of them. If there are any missing that you need please let us know.
pt_br: Оскільки магічні методи шукаються інакше, ніж звичайні методи [#]_, цю підтримку було реалізовано спеціально. Це означає, що підтримуються лише певні магічні методи. Список підтримуваних включає *майже* всі з них. Якщо вам бракує чогось, повідомте нам.

source: You mock magic methods by setting the method you are interested in to a function or a mock instance. If you are using a function then it *must* take ``self`` as the first argument [#]_.
pt_br: Ви імітуєте магічні методи, встановлюючи для методу, який вас цікавить, функцію або імітаційний екземпляр. Якщо ви використовуєте функцію, вона *має* приймати ``self`` як перший аргумент [#]_.

source: One use case for this is for mocking objects used as context managers in a :keyword:`with` statement:
pt_br: Одним із варіантів використання цього є знущання над об’єктами, що використовуються як менеджери контексту в операторі :keyword:`with`:

source: Calls to magic methods do not appear in :attr:`~Mock.method_calls`, but they are recorded in :attr:`~Mock.mock_calls`.
pt_br: Виклики магічних методів не відображаються в :attr:`~Mock.method_calls`, але вони записуються в :attr:`~Mock.mock_calls`.

source: If you use the *spec* keyword argument to create a mock then attempting to set a magic method that isn't in the spec will raise an :exc:`AttributeError`.
pt_br: Якщо ви використовуєте аргумент ключового слова *spec* для створення макета, тоді спроба встановити магічний метод, якого немає в специфікації, призведе до появи :exc:`AttributeError`.

source: The full list of supported magic methods is:
pt_br: A lista completa de métodos mágicos compatíveis é:

source: ``__hash__``, ``__sizeof__``, ``__repr__`` and ``__str__``
pt_br: ``__hash__``, ``__sizeof__``, ``__repr__`` e ``__str__``

source: ``__dir__``, ``__format__`` and ``__subclasses__``
pt_br: ``__dir__``, ``__format__`` e ``__subclasses__``

source: ``__round__``, ``__floor__``, ``__trunc__`` and ``__ceil__``
pt_br: ``__round__``, ``__floor__``, ``__trunc__`` e ``__ceil__``

source: Comparisons: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` and ``__ne__``
pt_br: Comparações: ``__lt__``, ``__gt__``, ``__le__``, ``__ge__``, ``__eq__`` e ``__ne__``

source: Container methods: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` and ``__missing__``
pt_br: Методи контейнерів: ``__getitem__``, ``__setitem__``, ``__delitem__``, ``__contains__``, ``__len__``, ``__iter__``, ``__reversed__`` і ``__missing__``

source: Context manager: ``__enter__``, ``__exit__``, ``__aenter__`` and ``__aexit__``
pt_br: Gerenciador de contexto: ``__enter__``, ``__exit__``, ``__aenter__`` e ``__aexit__``

source: Unary numeric methods: ``__neg__``, ``__pos__`` and ``__invert__``
pt_br: Métodos numéricos unários: ``__neg__``, ``__pos__`` e ``__invert__``

source: The numeric methods (including right hand and in-place variants): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__``, and ``__pow__``
pt_br: Числовые методы (включая правосторонние и локальные варианты): ``__add__``, ``__sub__``, ``__mul__``, ``__matmul__``, ``__truediv__``, ``__floordiv__``, ``__mod__``, ``__divmod__``, ``__lshift__``, ``__rshift__``, ``__and__``, ``__xor__``, ``__or__`` и ``__pow__``

source: Numeric conversion methods: ``__complex__``, ``__int__``, ``__float__`` and ``__index__``
pt_br: Métodos de conversão numérica: ``__complex__``, ``__int__``, ``__float__`` e ``__index__``

source: Descriptor methods: ``__get__``, ``__set__`` and ``__delete__``
pt_br: Métodos descritores: ``__get__``, ``__set__`` e ``__delete__``

source: Pickling: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
pt_br: Pickling: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` e ``__setstate__``

source: File system path representation: ``__fspath__``
pt_br: Представлення шляху файлової системи: ``__fspath__``

source: Asynchronous iteration methods: ``__aiter__`` and ``__anext__``
pt_br: Métodos de iteração assíncrona: ``__aiter__`` e ``__anext__``

source: Added support for :func:`os.PathLike.__fspath__`.
pt_br: Adicionado suporte para :func:`os.PathLike.__fspath__`.

source: Added support for ``__aenter__``, ``__aexit__``, ``__aiter__`` and ``__anext__``.
pt_br: Adicionado suporte para ``__aenter__``, ``__aexit__``, ``__aiter__`` e ``__anext__``.

source: The following methods exist but are *not* supported as they are either in use by mock, can't be set dynamically, or can cause problems:
pt_br: Наступні методи існують, але *не* підтримуються, оскільки вони або використовуються макетом, не можуть бути встановлені динамічно або можуть спричиняти проблеми:

source: ``__getattr__``, ``__setattr__``, ``__init__`` and ``__new__``
pt_br: ``__getattr__``, ``__setattr__``, ``__init__`` e ``__new__``

source: There are two ``MagicMock`` variants: :class:`MagicMock` and :class:`NonCallableMagicMock`.
pt_br: Existem duas variantes de ``MagicMock``: :class:`MagicMock` e :class:`NonCallableMagicMock`.

source: ``MagicMock`` is a subclass of :class:`Mock` with default implementations of most of the :term:`magic methods <magic method>`. You can use ``MagicMock`` without having to configure the magic methods yourself.
pt_br: ``MagicMock`` является подклассом :class:`Mock` с реализациями по умолчанию большинства :term:`magic методов <magic Method>`. Вы можете использовать MagicMock без необходимости самостоятельно настраивать магические методы.

source: The constructor parameters have the same meaning as for :class:`Mock`.
pt_br: Параметри конструктора мають те саме значення, що й для :class:`Mock`.

source: If you use the *spec* or *spec_set* arguments then *only* magic methods that exist in the spec will be created.
pt_br: Якщо ви використовуєте аргументи *spec* або *spec_set*, тоді будуть створені *лише* магічні методи, які існують у специфікації.

source: A non-callable version of :class:`MagicMock`.
pt_br: Uma versão não-chamável de :class:`MagicMock`.

source: The constructor parameters have the same meaning as for :class:`MagicMock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
pt_br: Параметри конструктора мають те саме значення, що й для :class:`MagicMock`, за винятком *return_value* і *side_effect*, які не мають значення для макету, який не викликається.

source: The magic methods are setup with :class:`MagicMock` objects, so you can configure them and use them in the usual way:
pt_br: Магічні методи встановлюються за допомогою об’єктів :class:`MagicMock`, тож ви можете налаштувати їх і використовувати у звичайний спосіб:

source: By default many of the protocol methods are required to return objects of a specific type. These methods are preconfigured with a default return value, so that they can be used without you having to do anything if you aren't interested in the return value. You can still *set* the return value manually if you want to change the default.
pt_br: За замовчуванням багато методів протоколу потрібні для повернення об’єктів певного типу. Ці методи попередньо налаштовані зі значенням, що повертається за замовчуванням, тому їх можна використовувати без необхідності робити будь-які дії, якщо ви не зацікавлені у значенні, що повертається. Ви все ще можете *встановити* значення, що повертається, вручну, якщо ви хочете змінити значення за замовчуванням.

source: Methods and their defaults:
pt_br: Métodos e seus padrões:

source: ``__hash__``: default hash for the mock
pt_br: ``__hash__``: hash padrão para o mock

source: ``__str__``: default str for the mock
pt_br: ``__str__``: *str* padrão para o mock

source: ``__sizeof__``: default sizeof for the mock
pt_br: ``__sizeof__``: *sizeof* padrão para o mock

source: For example:
pt_br: Por exemplo:

source: The two equality methods, :meth:`!__eq__` and :meth:`!__ne__`, are special. They do the default equality comparison on identity, using the :attr:`~Mock.side_effect` attribute, unless you change their return value to return something else::
pt_br: Два метода равенства, :meth:`!__eq__` и :meth:`!__ne__`, являются особенными. Они выполняют сравнение на равенство по умолчанию, используя атрибут :attr:`~Mock.side_effect`, если вы не измените их возвращаемое значение, чтобы оно возвращало что-то другое::

source: The return value of :meth:`MagicMock.__iter__` can be any iterable object and isn't required to be an iterator:
pt_br: Повернене значення :meth:`MagicMock.__iter__` може бути будь-яким ітерованим об’єктом і не обов’язково бути ітератором:

source: If the return value *is* an iterator, then iterating over it once will consume it and subsequent iterations will result in an empty list:
pt_br: Якщо значення, що повертається, *є* ітератором, одноразове повторення над ним споживатиме його, а наступні ітерації призведуть до порожнього списку:

source: ``MagicMock`` has all of the supported magic methods configured except for some of the obscure and obsolete ones. You can still set these up if you want.
pt_br: У ``MagicMock`` налаштовано всі підтримувані магічні методи, за винятком деяких незрозумілих і застарілих. Ви все ще можете налаштувати їх, якщо хочете.

source: Magic methods that are supported but not setup by default in ``MagicMock`` are:
pt_br: Магічні методи, які підтримуються, але не налаштовані за замовчуванням у ``MagicMock``:

source: ``__get__``, ``__set__`` and ``__delete__``
pt_br: ``__get__``, ``__set__`` e ``__delete__``

source: ``__reversed__`` and ``__missing__``
pt_br: ``__reversed__`` e ``__missing__``

source: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` and ``__setstate__``
pt_br: ``__reduce__``, ``__reduce_ex__``, ``__getinitargs__``, ``__getnewargs__``, ``__getstate__`` e ``__setstate__``

source: Magic methods *should* be looked up on the class rather than the instance. Different versions of Python are inconsistent about applying this rule. The supported protocol methods should work with all supported versions of Python.
pt_br: Чарівні методи *слід* шукати в класі, а не в екземплярі. Різні версії Python несумісні щодо застосування цього правила. Підтримувані методи протоколу мають працювати з усіма підтримуваними версіями Python.

source: The function is basically hooked up to the class, but each ``Mock`` instance is kept isolated from the others.
pt_br: Функція в основному підключена до класу, але кожен екземпляр ``Mock`` зберігається ізольованим від інших.

source: Helpers
pt_br: Ajudantes

source: The ``sentinel`` object provides a convenient way of providing unique objects for your tests.
pt_br: Об’єкт ``sentinel`` забезпечує зручний спосіб надання унікальних об’єктів для ваших тестів.

source: Attributes are created on demand when you access them by name. Accessing the same attribute will always return the same object. The objects returned have a sensible repr so that test failure messages are readable.
pt_br: Атрибути створюються на вимогу, коли ви отримуєте доступ до них за іменем. Доступ до того самого атрибуту завжди повертатиме той самий об’єкт. Повернуті об’єкти мають розумне відображення, тому повідомлення про помилку тесту можна прочитати.

source: The ``sentinel`` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`.
pt_br: Атрибути ``sentinel`` тепер зберігають свою ідентичність, коли їх :mod:`скопіюють <copy>` або :mod:`маринують <pickle>`.

source: Sometimes when testing you need to test that a specific object is passed as an argument to another method, or returned. It can be common to create named sentinel objects to test this. :data:`sentinel` provides a convenient way of creating and testing the identity of objects like this.
pt_br: Іноді під час тестування вам потрібно перевірити, чи певний об’єкт передається як аргумент до іншого методу або повертається. Для перевірки цього може бути звичайним створення іменованих дозорних об’єктів. :data:`sentinel` забезпечує зручний спосіб створення та перевірки ідентичності таких об’єктів.

source: In this example we monkey patch ``method`` to return ``sentinel.some_object``:
pt_br: У цьому прикладі ми використовуємо ``method`` для повернення ``sentinel.some_object``:

source: The :data:`DEFAULT` object is a pre-created sentinel (actually ``sentinel.DEFAULT``). It can be used by :attr:`~Mock.side_effect` functions to indicate that the normal return value should be used.
pt_br: Об’єкт :data:`DEFAULT` є попередньо створеним дозорним (насправді ``sentinel.DEFAULT``). Його можна використовувати функціями :attr:`~Mock.side_effect`, щоб вказати, що потрібно використовувати звичайне повертане значення.

source: call
pt_br: chamada

source: :func:`call` is a helper object for making simpler assertions, for comparing with :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` and :attr:`~Mock.method_calls`. :func:`call` can also be used with :meth:`~Mock.assert_has_calls`.
pt_br: :func:`call` — це допоміжний об’єкт для створення простіших тверджень, для порівняння з :attr:`~Mock.call_args`, :attr:`~Mock.call_args_list`, :attr:`~Mock.mock_calls` і :attr:`~Mock.method_calls`. :func:`call` також можна використовувати з :meth:`~Mock.assert_has_calls`.

source: For a call object that represents multiple calls, :meth:`call_list` returns a list of all the intermediate calls as well as the final call.
pt_br: Для об’єкта виклику, який представляє кілька викликів, :meth:`call_list` повертає список усіх проміжних викликів, а також остаточний виклик.

source: ``call_list`` is particularly useful for making assertions on "chained calls". A chained call is multiple calls on a single line of code. This results in multiple entries in :attr:`~Mock.mock_calls` on a mock. Manually constructing the sequence of calls can be tedious.
pt_br: ``call_list`` особливо корисний для створення тверджень щодо "ланцюжкових викликів". Зв’язаний виклик — це кілька викликів в одному рядку коду. Це призводить до кількох записів у :attr:`~Mock.mock_calls` на макеті. Побудова послідовності викликів вручну може бути виснажливою.

source: :meth:`~call.call_list` can construct the sequence of calls from the same chained call:
pt_br: :meth:`~call.call_list` може побудувати послідовність викликів з одного ланцюжкового виклику:

source: A ``call`` object is either a tuple of (positional args, keyword args) or (name, positional args, keyword args) depending on how it was constructed. When you construct them yourself this isn't particularly interesting, but the ``call`` objects that are in the :attr:`Mock.call_args`, :attr:`Mock.call_args_list` and :attr:`Mock.mock_calls` attributes can be introspected to get at the individual arguments they contain.
pt_br: Об’єкт ``виклику`` є або кортежем (позиційні аргументи, аргументи ключового слова) або (ім’я, позиційні аргументи, аргументи ключового слова) залежно від того, як він був створений. Коли ви створюєте їх самостійно, це не особливо цікаво, але об’єкти ``call``, які знаходяться в :attr:`Mock.call_args`, :attr:`Mock.call_args_list` і :attr:`Mock.mock_calls` атрибути можна перевірити, щоб отримати окремі аргументи, які вони містять.

source: The ``call`` objects in :attr:`Mock.call_args` and :attr:`Mock.call_args_list` are two-tuples of (positional args, keyword args) whereas the ``call`` objects in :attr:`Mock.mock_calls`, along with ones you construct yourself, are three-tuples of (name, positional args, keyword args).
pt_br: Об’єкти ``call`` у :attr:`Mock.call_args` і :attr:`Mock.call_args_list` є двома кортежами (позиційні аргументи, аргументи ключового слова), тоді як об’єкти ``call`` у :attr:`Mock.mock_calls` разом із тими, які ви створюєте самостійно, складаються з трьох кортежів (ім’я, позиційні аргументи, аргументи ключового слова).

source: You can use their "tupleness" to pull out the individual arguments for more complex introspection and assertions. The positional arguments are a tuple (an empty tuple if there are no positional arguments) and the keyword arguments are a dictionary:
pt_br: Ви можете використовувати їх "кортеж", щоб отримати окремі аргументи для більш складного самоаналізу та тверджень. Позиційні аргументи — це кортеж (порожній кортеж, якщо позиційних аргументів немає), а ключові аргументи — це словник:

source: Create a mock object using another object as a spec. Attributes on the mock will use the corresponding attribute on the *spec* object as their spec.
pt_br: Створіть макет об’єкта, використовуючи інший об’єкт як специфікацію. Атрибути на макеті використовуватимуть відповідний атрибут об’єкта *spec* як свою специфікацію.

source: Functions or methods being mocked will have their arguments checked to ensure that they are called with the correct signature.
pt_br: Аргументи функцій або методів, які висміюються, перевірятимуть, щоб переконатися, що вони викликаються з правильною сигнатурою.

source: If *spec_set* is ``True`` then attempting to set attributes that don't exist on the spec object will raise an :exc:`AttributeError`.
pt_br: Якщо *spec_set* має значення ``True``, тоді спроба встановити атрибути, яких не існує в об’єкті специфікації, призведе до появи :exc:`AttributeError`.

source: If a class is used as a spec then the return value of the mock (the instance of the class) will have the same spec. You can use a class as the spec for an instance object by passing ``instance=True``. The returned mock will only be callable if instances of the mock are callable.
pt_br: Якщо клас використовується як специфікація, тоді значення, що повертається mock (екземпляр класу), матиме ту саму специфікацію. Ви можете використовувати клас як специфікацію для об’єкта екземпляра, передавши ``instance=True``. Повернений макет можна буде викликати, лише якщо його екземпляри можна викликати.

source: :func:`create_autospec` also takes arbitrary keyword arguments that are passed to the constructor of the created mock.
pt_br: :func:`create_autospec` також приймає довільні ключові аргументи, які передаються конструктору створеного макету.

source: See :ref:`auto-speccing` for examples of how to use auto-speccing with :func:`create_autospec` and the *autospec* argument to :func:`patch`.
pt_br: Перегляньте :ref:`auto-speccing` для прикладів використання автоматичної специфікації з :func:`create_autospec` і аргументом *autospec* для :func:`patch`.

source: :func:`create_autospec` now returns an :class:`AsyncMock` if the target is an async function.
pt_br: :func:`create_autospec` тепер повертає :class:`AsyncMock`, якщо метою є асинхронна функція.

source: Sometimes you may need to make assertions about *some* of the arguments in a call to mock, but either not care about some of the arguments or want to pull them individually out of :attr:`~Mock.call_args` and make more complex assertions on them.
pt_br: Іноді вам може знадобитися зробити твердження щодо *деяких* аргументів у виклику mock, але ви або не дбаєте про деякі з аргументів, або хочете вилучити їх окремо з :attr:`~Mock.call_args` і зробити складнішими твердження на них.

source: To ignore certain arguments you can pass in objects that compare equal to *everything*. Calls to :meth:`~Mock.assert_called_with` and :meth:`~Mock.assert_called_once_with` will then succeed no matter what was passed in.
pt_br: Щоб ігнорувати певні аргументи, ви можете передати об’єкти, порівняння яких дорівнює *всему*. Виклики :meth:`~Mock.assert_ called_with` і :meth:`~Mock.assert_ called_once_with` будуть успішними незалежно від того, що було передано.

source: :data:`ANY` can also be used in comparisons with call lists like :attr:`~Mock.mock_calls`:
pt_br: :data:`ANY` також можна використовувати для порівняння зі списками викликів, наприклад :attr:`~Mock.mock_calls`:

source: :data:`ANY` is not limited to comparisons with call objects and so can also be used in test assertions::
pt_br: :data:`ANY` не ограничивается сравнением с объектами вызова и поэтому может также использоваться в тестовых утверждениях::

source: :data:`FILTER_DIR` is a module level variable that controls the way mock objects respond to :func:`dir`. The default is ``True``, which uses the filtering described below, to only show useful members. If you dislike this filtering, or need to switch it off for diagnostic purposes, then set ``mock.FILTER_DIR = False``.
pt_br: :data:`FILTER_DIR` — это переменная уровня модуля, которая управляет тем, как макетные объекты реагируют на :func:`dir`. По умолчанию установлено значение True, при котором используется фильтрация, описанная ниже, для отображения только полезных элементов. Если вам не нравится эта фильтрация или вам нужно отключить ее в диагностических целях, установите ``mock.FILTER_DIR = False``.

source: With filtering on, ``dir(some_mock)`` shows only useful attributes and will include any dynamically created attributes that wouldn't normally be shown. If the mock was created with a *spec* (or *autospec* of course) then all the attributes from the original are shown, even if they haven't been accessed yet:
pt_br: Якщо фільтрацію ввімкнено, ``dir(some_mock)`` показує лише корисні атрибути та включатиме будь-які динамічно створені атрибути, які зазвичай не відображаються. Якщо макет було створено за допомогою *spec* (або *autospec*, звичайно), тоді відображаються всі атрибути з оригіналу, навіть якщо до них ще не було доступу:
