Repository: python/python-docs-pt-br
Catalog: library/unittest.mock-examples.po
Languages: pt_br

source: ``Mock`` (in all its flavours) uses a method called ``_get_child_mock`` to create these "sub-mocks" for attributes and return values. You can prevent your subclass being used for attributes by overriding this method. The signature is that it takes arbitrary keyword arguments (``**kwargs``) which are then passed onto the mock constructor:
pt_br: ``Mock`` (у всіх його варіантах) використовує метод під назвою ``_get_child_mock``, щоб створити ці "під-моки" для атрибутів і повертаються значень. Ви можете запобігти використанню вашого підкласу для атрибутів, замінивши цей метод. Підпис полягає в тому, що він приймає довільні аргументи ключового слова (``**kwargs``), які потім передаються в макетний конструктор:

source: An exception to this rule are the non-callable mocks. Attributes use the callable variant because otherwise non-callable mocks couldn't have callable methods.
pt_br: Винятком із цього правила є невикликані моки. Атрибути використовують викликаючий варіант, оскільки інакше невикликані макети не могли б мати викликані методи.

source: Mocking imports with patch.dict
pt_br: Знущання над імпортом за допомогою patch.dict

source: One situation where mocking can be hard is where you have a local import inside a function. These are harder to mock because they aren't using an object from the module namespace that we can patch out.
pt_br: Одна ситуація, коли насмішка може бути важкою, це коли у вас є локальний імпорт всередині функції. Їх важче висміяти, оскільки вони не використовують об’єкт із простору імен модуля, який ми можемо виправити.

source: Generally local imports are to be avoided. They are sometimes done to prevent circular dependencies, for which there is *usually* a much better way to solve the problem (refactor the code) or to prevent "up front costs" by delaying the import. This can also be solved in better ways than an unconditional local import (store the module as a class or module attribute and only do the import on first use).
pt_br: Загалом слід уникати місцевого імпорту. Іноді їх роблять, щоб запобігти циклічним залежностям, для яких *зазвичай* існує набагато кращий спосіб вирішити проблему (рефакторити код) або запобігти "попереднім витратам" шляхом затримки імпорту. Це також можна вирішити кращим способом, ніж безумовний локальний імпорт (зберігайте модуль як клас або атрибут модуля та виконуйте імпорт лише під час першого використання).

source: That aside there is a way to use ``mock`` to affect the results of an import. Importing fetches an *object* from the :data:`sys.modules` dictionary. Note that it fetches an *object*, which need not be a module. Importing a module for the first time results in a module object being put in ``sys.modules``, so usually when you import something you get a module back. This need not be the case however.
pt_br: Помимо этого, есть способ использовать «mock», чтобы повлиять на результаты импорта. При импорте извлекается *объект* из словаря :data:`sys.modules`. Обратите внимание, что он извлекает *объект*, который не обязательно должен быть модулем. Импорт модуля в первый раз приводит к тому, что объект модуля помещается в ``sys.modules``, поэтому обычно, когда вы что-то импортируете, вы получаете модуль обратно. Однако это не обязательно так.

source: This means you can use :func:`patch.dict` to *temporarily* put a mock in place in :data:`sys.modules`. Any imports whilst this patch is active will fetch the mock. When the patch is complete (the decorated function exits, the with statement body is complete or ``patcher.stop()`` is called) then whatever was there previously will be restored safely.
pt_br: Це означає, що ви можете використовувати :func:`patch.dict`, щоб *тимчасово* розмістити макет на місці в :data:`sys.modules`. Будь-який імпорт, поки цей патч активний, отримуватиме макет. Коли виправлення завершено (декорована функція завершує роботу, тіло оператора with завершено або викликається ``patcher.stop()``), тоді все, що було раніше, буде безпечно відновлено.

source: Here's an example that mocks out the 'fooble' module.
pt_br: Ось приклад, який висміює модуль "fooble".

source: As you can see the ``import fooble`` succeeds, but on exit there is no 'fooble' left in :data:`sys.modules`.
pt_br: Як ви бачите, ``імпорт fooble`` вдається, але після виходу в :data:`sys.modules` не залишилося жодного 'fooble'.

source: This also works for the ``from module import name`` form:
pt_br: Це також працює для форми ``from module import name``:

source: With slightly more work you can also mock package imports:
pt_br: Доклавши трохи більше зусиль, ви також можете імітувати імпорт пакетів:

source: Tracking order of calls and less verbose call assertions
pt_br: Відстеження порядку викликів і менш докладні підтвердження викликів

source: The :class:`Mock` class allows you to track the *order* of method calls on your mock objects through the :attr:`~Mock.method_calls` attribute. This doesn't allow you to track the order of calls between separate mock objects, however we can use :attr:`~Mock.mock_calls` to achieve the same effect.
pt_br: Клас :class:`Mock` дозволяє вам відстежувати *порядок* викликів методів ваших фіктивних об’єктів за допомогою атрибута :attr:`~Mock.method_calls`. Це не дозволяє відстежувати порядок викликів між окремими макетними об’єктами, однак ми можемо використовувати :attr:`~Mock.mock_calls` для досягнення того самого ефекту.

source: Because mocks track calls to child mocks in ``mock_calls``, and accessing an arbitrary attribute of a mock creates a child mock, we can create our separate mocks from a parent one. Calls to those child mock will then all be recorded, in order, in the ``mock_calls`` of the parent:
pt_br: Оскільки mocks відстежують виклики дочірніх mocks у ``mock_calls``, а доступ до довільного атрибута mock створює дочірній mock, ми можемо створювати окремі моки від батьківського. Виклики цих дочірніх маніпуляцій будуть записані по порядку в ``mock_calls`` батьківського:

source: We can then assert about the calls, including the order, by comparing with the ``mock_calls`` attribute on the manager mock:
pt_br: Потім ми можемо стверджувати про виклики, включаючи порядок, порівнюючи з атрибутом ``mock_calls`` макет менеджера:

source: If ``patch`` is creating, and putting in place, your mocks then you can attach them to a manager mock using the :meth:`~Mock.attach_mock` method. After attaching calls will be recorded in ``mock_calls`` of the manager. ::
pt_br: Якщо ``patch`` створює та розміщує ваші макети, ви можете прикріпити їх до макета менеджера за допомогою методу :meth:`~Mock.attach_mock`. Після прикріплення виклики будуть записані в ``mock_calls`` менеджера. ::

source: If many calls have been made, but you're only interested in a particular sequence of them then an alternative is to use the :meth:`~Mock.assert_has_calls` method. This takes a list of calls (constructed with the :data:`call` object). If that sequence of calls are in :attr:`~Mock.mock_calls` then the assert succeeds.
pt_br: Якщо було зроблено багато викликів, але вас цікавить лише певна їх послідовність, альтернативою є використання методу :meth:`~Mock.assert_has_calls`. Це бере список викликів (створений за допомогою об’єкта :data:`call`). Якщо ця послідовність викликів міститься в :attr:`~Mock.mock_calls`, тоді твердження буде успішним.

source: Even though the chained call ``m.one().two().three()`` aren't the only calls that have been made to the mock, the assert still succeeds.
pt_br: Незважаючи на те, що зв’язаний виклик ``m.one().two().three()`` не єдиний виклик, який було зроблено для mock, твердження все одно успішне.

source: Sometimes a mock may have several calls made to it, and you are only interested in asserting about *some* of those calls. You may not even care about the order. In this case you can pass ``any_order=True`` to ``assert_has_calls``:
pt_br: Іноді макет може мати кілька звернень до нього, і ви зацікавлені лише в підтвердженні *деяких* із цих викликів. Ви можете навіть не дбати про порядок. У цьому випадку ви можете передати ``any_order=True`` до ``assert_has_calls``:

source: More complex argument matching
pt_br: Складніше зіставлення аргументів

source: Using the same basic concept as :data:`ANY` we can implement matchers to do more complex assertions on objects used as arguments to mocks.
pt_br: Використовуючи ту саму основну концепцію, що й :data:`ANY`, ми можемо реалізувати збіги для більш складних тверджень щодо об’єктів, які використовуються як аргументи для імітації.

source: Suppose we expect some object to be passed to a mock that by default compares equal based on object identity (which is the Python default for user defined classes). To use :meth:`~Mock.assert_called_with` we would need to pass in the exact same object. If we are only interested in some of the attributes of this object then we can create a matcher that will check these attributes for us.
pt_br: Припустімо, ми очікуємо, що якийсь об’єкт буде передано макету, який за замовчуванням порівнює рівність на основі ідентичності об’єкта (що є стандартним значенням Python для визначених користувачем класів). Щоб використовувати :meth:`~Mock.assert_ called_with`, нам потрібно буде передати той самий об’єкт. Якщо нас цікавлять лише деякі атрибути цього об’єкта, ми можемо створити відповідник, який перевірить ці атрибути для нас.

source: You can see in this example how a 'standard' call to ``assert_called_with`` isn't sufficient:
pt_br: У цьому прикладі ви можете побачити, як "стандартного" виклику ``assert_ called_with`` недостатньо:

source: A comparison function for our ``Foo`` class might look something like this:
pt_br: Функція порівняння для нашого класу ``Foo`` може виглядати приблизно так:

source: And a matcher object that can use comparison functions like this for its equality operation would look something like this:
pt_br: І об’єкт відповідності, який може використовувати такі функції порівняння для своєї операції рівності, виглядатиме приблизно так:

source: Putting all this together:
pt_br: Зібравши все це разом:

source: The ``Matcher`` is instantiated with our compare function and the ``Foo`` object we want to compare against. In ``assert_called_with`` the ``Matcher`` equality method will be called, which compares the object the mock was called with against the one we created our matcher with. If they match then ``assert_called_with`` passes, and if they don't an :exc:`AssertionError` is raised:
pt_br: Екземпляр ``Matcher`` створюється нашою функцією порівняння та об’єктом ``Foo``, з яким ми хочемо порівняти. У ``assert_ called_with`` буде викликаний метод рівності ``Matcher``, який порівнює об’єкт, з яким було викликано макет, з тим, з яким ми створили наш збігувач. Якщо вони збігаються, ``assert_ called_with`` пропускається, а якщо вони не збігаються, виникає :exc:`AssertionError`:

source: With a bit of tweaking you could have the comparison function raise the :exc:`AssertionError` directly and provide a more useful failure message.
pt_br: Трохи налаштувавши функцію порівняння, ви могли б безпосередньо викликати :exc:`AssertionError` і надавати більш корисне повідомлення про помилку.

source: As of version 1.5, the Python testing library `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ provides similar functionality, that may be useful here, in the form of its equality matcher (`hamcrest.library.integration.match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
pt_br: Починаючи з версії 1.5, тестова бібліотека Python `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ надає подібну функціональність, яка може бути корисною тут, у формі її відповідника рівності (`hamcrest.library.integration.match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
