Repository: python/python-docs-pt-br
Catalog: library/unittest.mock.po
Languages: pt_br

source: :mod:`unittest.mock` --- mock object library
pt_br: :mod:`unittest.mock` --- biblioteca de objeto mock

source: **Source code:** :source:`Lib/unittest/mock.py`
pt_br: **Código-fonte:** :source:`Lib/unittest/mock.py`

source: :mod:`unittest.mock` is a library for testing in Python. It allows you to replace parts of your system under test with mock objects and make assertions about how they have been used.
pt_br: :mod:`unittest.mock` é uma biblioteca para teste em Python. Que permite substituir partes do seu sistema em teste por objetos simulados e fazer afirmações sobre como elas foram usadas.

source: :mod:`unittest.mock` provides a core :class:`Mock` class removing the need to create a host of stubs throughout your test suite. After performing an action, you can make assertions about which methods / attributes were used and arguments they were called with. You can also specify return values and set needed attributes in the normal way.
pt_br: :mod:`unittest.mock` fornece uma classe core :class:`Mock` removendo a necessidade de criar uma série de stubs em todo o seu conjunto de testes. Depois de executar uma ação, você pode fazer afirmações sobre quais métodos / atributos foram usados e com quais argumentos foram chamados. Você também pode especificar valores de retorno e definir os atributos necessários da maneira normal.

source: Additionally, mock provides a :func:`patch` decorator that handles patching module and class level attributes within the scope of a test, along with :const:`sentinel` for creating unique objects. See the `quick guide`_ for some examples of how to use :class:`Mock`, :class:`MagicMock` and :func:`patch`.
pt_br: Adicionalmente, o mock fornece um decorador :func:`patch` que lida com os atributos do módulo de patch e do nível de classe no escopo de um teste, junto com :const:`sentinel` para criar objetos únicos. Veja o `guia rápido`_ para alguns exemplos de como usar :class:`Mock`, :class:`MagicMock` e :func:`patch`.

source: Mock is designed for use with :mod:`unittest` and is based on the 'action -> assertion' pattern instead of 'record -> replay' used by many mocking frameworks.
pt_br: Mock foi projetado para uso com :mod:`unittest` e é baseado no padrão 'ação -> asserção' em vez de 'gravar -> reproduzir' usado por muitas estruturas de simulação.

source: There is a backport of :mod:`unittest.mock` for earlier versions of Python, available as `mock on PyPI <https://pypi.org/project/mock>`_.
pt_br: Existe um backport de :mod:`unittest.mock` para versões anteriores do Python, disponível como `mock no PyPI <https://pypi.org/project/mock>`_.

source: Quick Guide
pt_br: Guia Rápido

source: :class:`Mock` and :class:`MagicMock` objects create all attributes and methods as you access them and store details of how they have been used. You can configure them, to specify return values or limit what attributes are available, and then make assertions about how they have been used:
pt_br: Os objetos :class:`Mock` e :class:`MagicMock` criam todos os atributos e métodos à medida que você os acessa e armazena detalhes de como eles foram usados. Você pode configurá-los, especificar valores de retorno ou limitar quais atributos estão disponíveis e, em seguida, fazer afirmações sobre como eles foram usados:

source: :attr:`side_effect` allows you to perform side effects, including raising an exception when a mock is called:
pt_br: :attr:`side_effect` permite que você execute efeitos colaterais, incluindo levantar uma exceção quando um mock é chamado:

source: Mock has many other ways you can configure it and control its behaviour. For example the *spec* argument configures the mock to take its specification from another object. Attempting to access attributes or methods on the mock that don't exist on the spec will fail with an :exc:`AttributeError`.
pt_br: O Mock tem muitas outras maneiras de configurá-lo e controlar seu comportamento. Por exemplo, o argumento *spec* configura o mock para obter sua especificação de outro objeto. Tentar acessar atributos ou métodos no mock que não existem no spec falhará com um :exc:`AttributeError`.

source: The :func:`patch` decorator / context manager makes it easy to mock classes or objects in a module under test. The object you specify will be replaced with a mock (or other object) during the test and restored when the test ends::
pt_br: O gerenciador de contexto / decorador :func:`patch` facilita a simulação de classes ou objetos em um módulo em teste. O objeto que você especificar será substituído por um mock (ou outro objeto) durante o teste e restaurado quando o teste terminar::

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``module.ClassName1`` is passed in first.
pt_br: Quando você aninha decoradores de patches, as simulações são passadas para a função decorada na mesma ordem em que foram aplicadas (a ordem normal *Python* em que os decoradores são aplicados). Isso significa de baixo para cima, portanto, no exemplo acima, a simulação para ``module.ClassName1`` é passada primeiro.

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
pt_br: Com :func:`patch`, é importante que você faça o patch de objetos no espaço de nomes onde eles são procurados. Normalmente, isso é simples, mas para um guia rápido, leia :ref:`onde fazer o patch <where-to-patch>`.

source: As well as a decorator :func:`patch` can be used as a context manager in a with statement:
pt_br: Assim como um decorador :func:`patch` pode ser usado como um gerenciador de contexto em uma instrução with:

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
pt_br: Também existe :func:`patch.dict` para definir valores em um dicionário apenas durante um escopo e restaurar o dicionário ao seu estado original quando o teste termina:

source: Mock supports the mocking of Python :ref:`magic methods <magic-methods>`. The easiest way of using magic methods is with the :class:`MagicMock` class. It allows you to do things like:
pt_br: Mock possui suporte a simulação de :ref:`métodos mágicos <magic-methods>` de Python. A maneira mais fácil de usar métodos mágicos é com a classe :class:`MagicMock`. Ele permite que você faça coisas como:

source: Mock allows you to assign functions (or other Mock instances) to magic methods and they will be called appropriately. The :class:`MagicMock` class is just a Mock variant that has all of the magic methods pre-created for you (well, all the useful ones anyway).
pt_br: Mock permite atribuir funções (ou outras instâncias do Mock) a métodos mágicos e elas serão chamadas apropriadamente. A classe :class:`MagicMock` é apenas uma variante do Mock que possui todos os métodos mágicos pré-criados para você (bem, todos os úteis de qualquer maneira).

source: The following is an example of using magic methods with the ordinary Mock class:
pt_br: A seguir, é apresentado um exemplo do uso de métodos mágicos com a classe Mock comum:

source: For ensuring that the mock objects in your tests have the same api as the objects they are replacing, you can use :ref:`auto-speccing <auto-speccing>`. Auto-speccing can be done through the *autospec* argument to patch, or the :func:`create_autospec` function. Auto-speccing creates mock objects that have the same attributes and methods as the objects they are replacing, and any functions and methods (including constructors) have the same call signature as the real object.
pt_br: Para garantir que os objetos mock em seus testes tenham a mesmo API que os objetos que eles estão substituindo, você pode usar :ref:`especificação automática <auto-speccing>`. A especificação automática pode ser feita por meio do argumento *autospec* para fazer patch ou pela função :func:`create_autospec`. A especificação automática cria objetos mock que têm os mesmos atributos e métodos que os objetos que estão substituindo, e qualquer funções e métodos (incluindo construtores) têm a mesma assinatura de chamada que o objeto real.

source: This ensures that your mocks will fail in the same way as your production code if they are used incorrectly:
pt_br: Isso garante que seus mocks falharão da mesma forma que o código de produção se forem usados incorretamente:

source: :func:`create_autospec` can also be used on classes, where it copies the signature of the ``__init__`` method, and on callable objects where it copies the signature of the ``__call__`` method.
pt_br: :func:`create_autospec` também pode ser usada com classes, onde copia a assinatura do método ``__init__``, e com objetos chamáveis onde copia a assinatura do método ``__call__``.

source: The Mock Class
pt_br: A classe Mock

source: :class:`Mock` is a flexible mock object intended to replace the use of stubs and test doubles throughout your code. Mocks are callable and create attributes as new mocks when you access them [#]_. Accessing the same attribute will always return the same mock. Mocks record how you use them, allowing you to make assertions about what your code has done to them.
pt_br: :class:`Mock` é um objeto simulado flexível destinado a substituir o uso de *stubs* e dublês de teste em todo o seu código. Os mocks são chamáveis e cria atributos como novos mocks à medida que você os acessa [#]_. Acessar o mesmo atributo sempre retorna o mesmo mock. Os mocks registram como você os utiliza, permitindo que você faça asserções sobre o que o seu código fez com eles.

source: :class:`MagicMock` is a subclass of :class:`Mock` with all the magic methods pre-created and ready to use. There are also non-callable variants, useful when you are mocking out objects that aren't callable: :class:`NonCallableMock` and :class:`NonCallableMagicMock`
pt_br: :class:`MagicMock` é uma subclasse de :class:`Mock` com todos os métodos mágicos pré-criados e prontos para uso. Existem também variantes não chamáveis, úteis quando você está simulando objetos que não são chamáveis: :class:`NonCallableMock` e :class:`NonCallableMagicMock`

source: The :func:`patch` decorators makes it easy to temporarily replace classes in a particular module with a :class:`Mock` object. By default :func:`patch` will create a :class:`MagicMock` for you. You can specify an alternative class of :class:`Mock` using the *new_callable* argument to :func:`patch`.
pt_br: Декоратори :func:`patch` дозволяють легко тимчасово замінити класи в певному модулі на об’єкт :class:`Mock`. За умовчанням :func:`patch` створить для вас :class:`MagicMock`. Ви можете вказати альтернативний клас :class:`Mock` за допомогою аргументу *new_callable* для :func:`patch`.

source: Create a new :class:`Mock` object. :class:`Mock` takes several optional arguments that specify the behaviour of the Mock object:
pt_br: Створіть новий об’єкт :class:`Mock`. :class:`Mock` приймає кілька додаткових аргументів, які визначають поведінку об’єкта Mock:

source: *spec*: This can be either a list of strings or an existing object (a class or instance) that acts as the specification for the mock object. If you pass in an object then a list of strings is formed by calling dir on the object (excluding unsupported magic attributes and methods). Accessing any attribute not in this list will raise an :exc:`AttributeError`.
pt_br: *spec*: це може бути або список рядків, або існуючий об’єкт (клас або екземпляр), який діє як специфікація для макетного об’єкта. Якщо ви передаєте об’єкт, тоді список рядків формується шляхом виклику dir для об’єкта (за винятком непідтримуваних магічних атрибутів і методів). Доступ до будь-якого атрибута, якого немає в цьому списку, викличе :exc:`AttributeError`.

source: *spec_set*: A stricter variant of *spec*. If used, attempting to *set* or get an attribute on the mock that isn't on the object passed as *spec_set* will raise an :exc:`AttributeError`.
pt_br: *spec_set*: суворіший варіант *spec*. У разі використання спроба *встановити* або отримати атрибут у макеті, якого немає в об’єкті, переданому як *spec_set*, викличе :exc:`AttributeError`.

source: *side_effect*: A function to be called whenever the Mock is called. See the :attr:`~Mock.side_effect` attribute. Useful for raising exceptions or dynamically changing return values. The function is called with the same arguments as the mock, and unless it returns :data:`DEFAULT`, the return value of this function is used as the return value.
pt_br: *side_effect*: функція, яка викликається щоразу, коли викликається Mock. Перегляньте атрибут :attr:`~Mock.side_effect`. Корисно для створення винятків або динамічної зміни повернених значень. Функція викликається з тими самими аргументами, що й макет, і якщо вона не повертає :data:`DEFAULT`, значення, що повертається цією функцією, використовується як значення, що повертається.

source: Alternatively *side_effect* can be an exception class or instance. In this case the exception will be raised when the mock is called.
pt_br: Крім того, *side_effect* може бути класом винятків або екземпляром. У цьому випадку виняток буде викликано під час виклику макета.

source: If *side_effect* is an iterable then each call to the mock will return the next value from the iterable.
pt_br: Якщо *side_effect* є iterable, тоді кожен виклик mock повертатиме наступне значення з iterable.

source: A *side_effect* can be cleared by setting it to ``None``.
pt_br: *Побічний_ефект* можна очистити, встановивши для нього значення ``None``.

source: *return_value*: The value returned when the mock is called. By default this is a new Mock (created on first access). See the :attr:`return_value` attribute.
pt_br: *return_value*: значення, що повертається під час виклику макета. За замовчуванням це новий макет (створений під час першого доступу). Перегляньте атрибут :attr:`return_value`.

source: *unsafe*: By default, accessing any attribute whose name starts with *assert*, *assret*, *asert*, *aseert* or *assrt* will raise an :exc:`AttributeError`. Passing ``unsafe=True`` will allow access to these attributes.
pt_br: *unsafe*: по умолчанию доступ к любому атрибуту, имя которого начинается с *assert*, *assret*, *asert*, *aseert* или *assrt*, вызовет ошибку :exc:`AttributeError`. Передача unsafe=True позволит получить доступ к этим атрибутам.

source: *wraps*: Item for the mock object to wrap. If *wraps* is not ``None`` then calling the Mock will pass the call through to the wrapped object (returning the real result). Attribute access on the mock will return a Mock object that wraps the corresponding attribute of the wrapped object (so attempting to access an attribute that doesn't exist will raise an :exc:`AttributeError`).
pt_br: *wraps*: Елемент для обгортання фіктивного об’єкта. Якщо *wraps* не ``None``, тоді виклик Mock передасть виклик оберненому об’єкту (повертаючи реальний результат). Доступ до атрибутів у макеті поверне об’єкт Mock, який обгортає відповідний атрибут упакованого об’єкта (тому спроба отримати доступ до атрибута, якого не існує, викличе :exc:`AttributeError`).

source: If the mock has an explicit *return_value* set then calls are not passed to the wrapped object and the *return_value* is returned instead.
pt_br: Якщо макет має явний набір *return_value*, тоді виклики не передаються до упакованого об’єкта, а замість нього повертається *return_value*.

source: *name*: If the mock has a name then it will be used in the repr of the mock. This can be useful for debugging. The name is propagated to child mocks.
pt_br: *ім’я*: якщо макет має ім’я, воно використовуватиметься у відтворенні макета. Це може бути корисним для налагодження. Ім'я поширюється на дитячі глузування.

source: Mocks can also be called with arbitrary keyword arguments. These will be used to set attributes on the mock after it is created. See the :meth:`configure_mock` method for details.
pt_br: Mocks також можна викликати з довільними ключовими аргументами. Вони використовуватимуться для встановлення атрибутів макета після його створення. Дивіться метод :meth:`configure_mock` для отримання детальної інформації.

source: Assert that the mock was called at least once.
pt_br: Afirmar que o mock foi chamado pelo menos uma vez.

source: Assert that the mock was called exactly once.
pt_br: Afirma que o mock foi chamado exatamente uma vez.

source: This method is a convenient way of asserting that the last call has been made in a particular way:
pt_br: Цей метод є зручним способом підтвердження того, що останній виклик було зроблено певним чином:

source: Assert that the mock was called exactly once and that call was with the specified arguments.
pt_br: Стверджуйте, що макет був викликаний рівно один раз і цей виклик був із зазначеними аргументами.

source: assert the mock has been called with the specified arguments.
pt_br: стверджувати, що макет був викликаний із зазначеними аргументами.

source: The assert passes if the mock has *ever* been called, unlike :meth:`assert_called_with` and :meth:`assert_called_once_with` that only pass if the call is the most recent one, and in the case of :meth:`assert_called_once_with` it must also be the only call.
pt_br: Твердження проходить, якщо макет *колись* викликався, на відміну від :meth:`assert_ called_with` і :meth:`assert_ called_once_with`, які проходять, лише якщо виклик є останнім, і у випадку :meth:`assert_ called_once_with` це також має бути єдиний виклик.

source: assert the mock has been called with the specified calls. The :attr:`mock_calls` list is checked for the calls.
pt_br: стверджувати, що макет було викликано за допомогою вказаних викликів. Список :attr:`mock_calls` перевіряється на наявність викликів.

source: If *any_order* is false then the calls must be sequential. There can be extra calls before or after the specified calls.
pt_br: Якщо *any_order* має значення false, виклики мають бути послідовними. До або після вказаних викликів можуть бути додаткові дзвінки.

source: If *any_order* is true then the calls can be in any order, but they must all appear in :attr:`mock_calls`.
pt_br: Якщо *any_order* має значення true, виклики можуть бути в будь-якому порядку, але всі вони мають відображатися в :attr:`mock_calls`.

source: Assert the mock was never called.
pt_br: Afirma que o mock nunca foi chamado.

source: The reset_mock method resets all the call attributes on a mock object:
pt_br: Метод reset_mock скидає всі атрибути виклику на макетному об’єкті:

source: Added two keyword-only arguments to the reset_mock function.
pt_br: Foram adicionados dois argumentos somente-nomeado à função reset_mock.

source: *return_value*, and :attr:`side_effect` are keyword-only arguments.
pt_br: *return_value*, e :attr:`side_effect` são argumentos somente-nomeado.

source: Add a spec to a mock. *spec* can either be an object or a list of strings. Only attributes on the *spec* can be fetched as attributes from the mock.
pt_br: Додайте специфікацію до макета. *spec* може бути або об’єктом, або списком рядків. Лише атрибути в *специфікації* можна отримати як атрибути з макета.

source: If *spec_set* is true then only attributes on the spec can be set.
pt_br: Якщо *spec_set* має значення true, можна встановити лише атрибути специфікації.

source: Attach a mock as an attribute of this one, replacing its name and parent. Calls to the attached mock will be recorded in the :attr:`method_calls` and :attr:`mock_calls` attributes of this one.
pt_br: Додайте макет як атрибут цього, замінивши його ім’я та батьківський елемент. Виклики вкладеного макету будуть записані в атрибутах :attr:`method_calls` і :attr:`mock_calls` цього.

source: Set attributes on the mock through keyword arguments.
pt_br: Define atributos no mock por meio de argumentos nomeados.

source: Attributes plus return values and side effects can be set on child mocks using standard dot notation and unpacking a dictionary in the method call:
pt_br: Атрибути плюс значення, що повертаються, і побічні ефекти можуть бути встановлені на дочірніх моделях за допомогою стандартної нотації з крапками та розпакування словника під час виклику методу:

source: The same thing can be achieved in the constructor call to mocks:
pt_br: Те саме можна досягти у виклику конструктора mocks:

source: :meth:`configure_mock` exists to make it easier to do configuration after the mock has been created.
pt_br: :meth:`configure_mock` існує, щоб полегшити налаштування після створення макету.

source: :class:`Mock` objects limit the results of ``dir(some_mock)`` to useful results. For mocks with a *spec* this includes all the permitted attributes for the mock.
pt_br: Об’єкти :class:`Mock` обмежують результати ``dir(some_mock)`` корисними результатами. Для макетів із *специфікацією* це включає всі дозволені атрибути для макету.

source: See :data:`FILTER_DIR` for what this filtering does, and how to switch it off.
pt_br: Перегляньте :data:`FILTER_DIR`, щоб дізнатися, що робить це фільтрування та як його вимкнути.

source: Create the child mocks for attributes and return value. By default child mocks will be the same type as the parent. Subclasses of Mock may want to override this to customize the way child mocks are made.
pt_br: Створіть дочірні макети для атрибутів і повертайте значення. За замовчуванням дочірні макети будуть того самого типу, що й батьківські. Підкласи Mock можуть захотіти перевизначити це, щоб налаштувати спосіб створення дочірніх моків.

source: For non-callable mocks the callable variant will be used (rather than any custom subclass).
pt_br: Для макетів, які не підлягають виклику, використовуватиметься варіант, який можна викликати (а не будь-який настроюваний підклас).

source: A boolean representing whether or not the mock object has been called:
pt_br: Логічне значення, яке вказує, чи було викликано макетний об’єкт:

source: An integer telling you how many times the mock object has been called:
pt_br: Ціле число, яке повідомляє вам, скільки разів був викликаний макетний об’єкт:

source: Set this to configure the value returned by calling the mock:
pt_br: Встановіть це, щоб налаштувати значення, що повертається викликом mock:

source: The default return value is a mock object and you can configure it in the normal way:
pt_br: Типовим значенням, що повертається, є макет об’єкта, і ви можете налаштувати його звичайним способом:

source: :attr:`return_value` can also be set in the constructor:
pt_br: :attr:`return_value` também pode ser definido no construtor:

source: This can either be a function to be called when the mock is called, an iterable or an exception (class or instance) to be raised.
pt_br: Może to być albo funkcja do wywołania, gdy wywoływany jest mock, iterable lub wyjątek (klasa lub instancja) do rzucenia.

source: If you pass in a function it will be called with same arguments as the mock and unless the function returns the :data:`DEFAULT` singleton the call to the mock will then return whatever the function returns. If the function returns :data:`DEFAULT` then the mock will return its normal value (from the :attr:`return_value`).
pt_br: Jeśli przekażesz funkcję, zostanie ona wywołana z tymi samymi argumentami co mock i dopóki funkcja nie zwróci singletona :data:`DEFAULT`, wywołanie mocka będzie zwracać cokolwiek zwraca funkcja. Jeśli funkcja zwróci :data:`DEFAULT`, to mock zwróci swoją normalną wartość (z :attr:`return_value`).
