Repository: python/python-docs-pt-br
Catalog: library/unittest.mock.po
Languages: pt_br

source: If you pass in an iterable, it is used to retrieve an iterator which must yield a value on every call. This value can either be an exception instance to be raised, or a value to be returned from the call to the mock (:data:`DEFAULT` handling is identical to the function case).
pt_br: Jeśli przekażesz iterable, zostanie on użyty do pobrania iteratora, który musi zwrócić wartość przy każdym wywołaniu. Wartość ta może być albo instancją wyjątku, która ma być rzucony, albo wartością, która ma być zwrócona z wywołania mocka (obsługa :data:`DEFAULT` jest identyczna do przypadku funkcji).

source: An example of a mock that raises an exception (to test exception handling of an API):
pt_br: Приклад макету, який викликає виняткову ситуацію (для перевірки обробки винятків API):

source: Using :attr:`side_effect` to return a sequence of values:
pt_br: Usando :attr:`side_effect` para retornar um sequência de valores:

source: Using a callable:
pt_br: Usando um chamável:

source: :attr:`side_effect` can be set in the constructor. Here's an example that adds one to the value the mock is called with and returns it:
pt_br: :attr:`side_effect` можна встановити в конструкторі. Ось приклад, який додає одиницю до значення, з яким викликається макет, і повертає його:

source: Setting :attr:`side_effect` to ``None`` clears it:
pt_br: Configuração :attr:`side_effect` para ``None`` limpa isso:

source: This is either ``None`` (if the mock hasn't been called), or the arguments that the mock was last called with. This will be in the form of a tuple: the first member, which can also be accessed through the ``args`` property, is any ordered arguments the mock was called with (or an empty tuple) and the second member, which can also be accessed through the ``kwargs`` property, is any keyword arguments (or an empty dictionary).
pt_br: Це або ``None`` (якщо макет не було викликано), або аргументи, з якими макет було викликано востаннє. Це буде у формі кортежу: перший член, до якого також можна отримати доступ через властивість ``args``, — це будь-які впорядковані аргументи, з якими було викликано макет (або порожній кортеж), а другий член, який може доступ також через властивість ``kwargs``, це будь-які ключові аргументи (або порожній словник).

source: :attr:`call_args`, along with members of the lists :attr:`call_args_list`, :attr:`method_calls` and :attr:`mock_calls` are :data:`call` objects. These are tuples, so they can be unpacked to get at the individual arguments and make more complex assertions. See :ref:`calls as tuples <calls-as-tuples>`.
pt_br: :attr:`call_args` разом із членами списків :attr:`call_args_list`, :attr:`method_calls` і :attr:`mock_calls` є об’єктами :data:`call`. Це кортежі, тому їх можна розпакувати, щоб отримати окремі аргументи та зробити складніші твердження. Перегляньте :ref:`виклики як кортежі <calls-as-tuples>`.

source: Added ``args`` and ``kwargs`` properties.
pt_br: Adicionadas propriedades ``args`` e ``kwargs``.

source: This is a list of all the calls made to the mock object in sequence (so the length of the list is the number of times it has been called). Before any calls have been made it is an empty list. The :data:`call` object can be used for conveniently constructing lists of calls to compare with :attr:`call_args_list`.
pt_br: Це список усіх послідовних викликів макетного об’єкта (тому довжина списку — це кількість викликів до нього). До здійснення будь-яких викликів це порожній список. Об’єкт :data:`call` можна використовувати для зручного створення списків викликів для порівняння з :attr:`call_args_list`.

source: Members of :attr:`call_args_list` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
pt_br: Члени :attr:`call_args_list` є об’єктами :data:`call`. Їх можна розпакувати як кортежі, щоб отримати окремі аргументи. Перегляньте :ref:`виклики як кортежі <calls-as-tuples>`.

source: As well as tracking calls to themselves, mocks also track calls to methods and attributes, and *their* methods and attributes:
pt_br: Крім відстеження викликів самих себе, mocks також відстежують виклики методів і атрибутів, а також *їх* методів і атрибутів:

source: Members of :attr:`method_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
pt_br: Члени :attr:`method_calls` є об’єктами :data:`call`. Їх можна розпакувати як кортежі, щоб отримати окремі аргументи. Перегляньте :ref:`виклики як кортежі <calls-as-tuples>`.

source: :attr:`mock_calls` records *all* calls to the mock object, its methods, magic methods *and* return value mocks.
pt_br: :attr:`mock_calls` записує *всі* виклики макетного об’єкта, його методи, чарівні методи *та* імітації значення, що повертається.

source: Members of :attr:`mock_calls` are :data:`call` objects. These can be unpacked as tuples to get at the individual arguments. See :ref:`calls as tuples <calls-as-tuples>`.
pt_br: Члени :attr:`mock_calls` є об’єктами :data:`call`. Їх можна розпакувати як кортежі, щоб отримати окремі аргументи. Перегляньте :ref:`виклики як кортежі <calls-as-tuples>`.

source: The way :attr:`mock_calls` are recorded means that where nested calls are made, the parameters of ancestor calls are not recorded and so will always compare equal:
pt_br: Спосіб запису :attr:`mock_calls` означає, що там, де здійснюються вкладені виклики, параметри викликів предків не записуються, тому порівняння завжди буде рівним:

source: A non-callable version of :class:`Mock`. The constructor parameters have the same meaning of :class:`Mock`, with the exception of *return_value* and *side_effect* which have no meaning on a non-callable mock.
pt_br: Версія :class:`Mock`, яка не викликається. Параметри конструктора мають те саме значення, що й :class:`Mock`, за винятком *return_value* і *side_effect*, які не мають значення для макету, який не викликається.

source: The :class:`Mock` classes have support for mocking magic methods. See :ref:`magic methods <magic-methods>` for the full details.
pt_br: Класи :class:`Mock` підтримують методи насміхуватої магії. Дивіться :ref:`магічні методи <magic-methods>` для повної інформації.

source: The mock classes and the :func:`patch` decorators all take arbitrary keyword arguments for configuration. For the :func:`patch` decorators the keywords are passed to the constructor of the mock being created. The keyword arguments are for configuring attributes of the mock:
pt_br: Імітаційні класи та декоратори :func:`patch` приймають довільні ключові аргументи для налаштування. Для декораторів :func:`patch` ключові слова передаються до конструктора макета, який створюється. Ключові аргументи призначені для налаштування атрибутів макета:

source: The return value and side effect of child mocks can be set in the same way, using dotted notation. As you can't use dotted names directly in a call you have to create a dictionary and unpack it using ``**``:
pt_br: Повернене значення та побічний ефект дочірніх імітацій можна встановити таким же чином, використовуючи позначення з крапками. Оскільки ви не можете використовувати імена з крапками безпосередньо у виклику, вам потрібно створити словник і розпакувати його за допомогою ``**``:

source: A callable mock which was created with a *spec* (or a *spec_set*) will introspect the specification object's signature when matching calls to the mock. Therefore, it can match the actual call's arguments regardless of whether they were passed positionally or by name::
pt_br: Викликаний макет, створений за допомогою *spec* (або *spec_set*), перевіряє підпис об’єкта специфікації під час зіставлення викликів з макетом. Таким чином, він може відповідати фактичним аргументам виклику незалежно від того, чи були вони передані позиційно чи за назвою::

source: This applies to :meth:`~Mock.assert_called_with`, :meth:`~Mock.assert_called_once_with`, :meth:`~Mock.assert_has_calls` and :meth:`~Mock.assert_any_call`. When :ref:`auto-speccing`, it will also apply to method calls on the mock object.
pt_br: Це стосується :meth:`~Mock.assert_ called_with`, :meth:`~Mock.assert_ called_once_with`, :meth:`~Mock.assert_has_calls` і :meth:`~Mock.assert_any_call`. Коли :ref:`auto-speccing`, це також застосовуватиметься до викликів методів фіктивного об’єкта.

source: Added signature introspection on specced and autospecced mock objects.
pt_br: Adicionada introspecção de assinatura em objetos mock especificados e auto-especificados.

source: A mock intended to be used as a :class:`property`, or other :term:`descriptor`, on a class. :class:`PropertyMock` provides :meth:`~object.__get__` and :meth:`~object.__set__` methods so you can specify a return value when it is fetched.
pt_br: Макет, предназначенный для использования в качестве свойства :class:`или другого :term:`дескриптора` в классе. :class:`PropertyMock` предоставляет методы :meth:`~object.__get__` и :meth:`~object.__set__`, чтобы вы могли указать возвращаемое значение при его получении.

source: Fetching a :class:`PropertyMock` instance from an object calls the mock, with no args. Setting it calls the mock with the value being set. ::
pt_br: Отримання екземпляра :class:`PropertyMock` з об’єкта викликає макет без аргументів. Його встановлення викликає макет із встановленим значенням. ::

source: Because of the way mock attributes are stored you can't directly attach a :class:`PropertyMock` to a mock object. Instead you can attach it to the mock type object::
pt_br: Через те, як зберігаються макетні атрибути, ви не можете безпосередньо прикріпити :class:`PropertyMock` до макетного об’єкта. Замість цього ви можете прикріпити його до об’єкта макетного типу::

source: An asynchronous version of :class:`MagicMock`. The :class:`AsyncMock` object will behave so the object is recognized as an async function, and the result of a call is an awaitable.
pt_br: Асинхронна версія :class:`MagicMock`. Об’єкт :class:`AsyncMock` поводитиметься таким чином, що об’єкт розпізнається як асинхронна функція, а результат виклику є очікуваним.

source: The result of ``mock()`` is an async function which will have the outcome of ``side_effect`` or ``return_value`` after it has been awaited:
pt_br: Результатом ``mock()`` є асинхронна функція, яка матиме результат ``side_effect`` або ``return_value`` після очікування:

source: if ``side_effect`` is a function, the async function will return the result of that function,
pt_br: якщо ``side_effect`` є функцією, асинхронна функція поверне результат цієї функції,

source: if ``side_effect`` is an exception, the async function will raise the exception,
pt_br: якщо ``side_effect`` є винятком, функція async викличе виняток,

source: if ``side_effect`` is an iterable, the async function will return the next value of the iterable, however, if the sequence of result is exhausted, ``StopAsyncIteration`` is raised immediately,
pt_br: якщо ``side_effect`` є ітерованим, функція async поверне наступне значення ітерованого, однак, якщо послідовність результатів вичерпана, ``StopAsyncIteration`` викликається негайно,

source: if ``side_effect`` is not defined, the async function will return the value defined by ``return_value``, hence, by default, the async function returns a new :class:`AsyncMock` object.
pt_br: якщо ``side_effect`` не визначено, функція async поверне значення, визначене ``return_value``, отже, за замовчуванням функція async повертає новий об’єкт :class:`AsyncMock`.

source: Setting the *spec* of a :class:`Mock` or :class:`MagicMock` to an async function will result in a coroutine object being returned after calling.
pt_br: Встановлення *специфікації* :class:`Mock` або :class:`MagicMock` на асинхронну функцію призведе до повернення об’єкта співпрограми після виклику.

source: Setting the *spec* of a :class:`Mock`, :class:`MagicMock`, or :class:`AsyncMock` to a class with asynchronous and synchronous functions will automatically detect the synchronous functions and set them as :class:`MagicMock` (if the parent mock is :class:`AsyncMock` or :class:`MagicMock`) or :class:`Mock` (if the parent mock is :class:`Mock`). All asynchronous functions will be :class:`AsyncMock`.
pt_br: Встановлення *специфікації* :class:`Mock`, :class:`MagicMock` або :class:`AsyncMock` для класу з асинхронними та синхронними функціями автоматично визначить синхронні функції та встановить їх як :class:`MagicMock` (якщо батьківським макетом є :class:`AsyncMock` або :class:`MagicMock`) або :class:`Mock` (якщо батьківським макетом є :class:`Mock`). Усі асинхронні функції будуть :class:`AsyncMock`.

source: Assert that the mock was awaited at least once. Note that this is separate from the object having been called, the ``await`` keyword must be used:
pt_br: Стверджуйте, що макету чекали хоча б раз. Зауважте, що це окремо від викликаного об’єкта, необхідно використовувати ключове слово ``await``:

source: Assert that the mock was awaited exactly once.
pt_br: Afirme que o mock foi aguardado exatamente uma vez.

source: Assert that the last await was with the specified arguments.
pt_br: Підтвердження того, що останнє очікування було з указаними аргументами.

source: Assert that the mock was awaited exactly once and with the specified arguments.
pt_br: Стверджуйте, що макет очікувався рівно один раз і з вказаними аргументами.

source: Assert the mock has ever been awaited with the specified arguments.
pt_br: Стверджуйте, що макет коли-небудь був очікуваний із зазначеними аргументами.

source: Assert the mock has been awaited with the specified calls. The :attr:`await_args_list` list is checked for the awaits.
pt_br: Стверджувати, що макет очікувався з указаними викликами. Список :attr:`await_args_list` перевіряється на наявність очікувань.

source: If *any_order* is false then the awaits must be sequential. There can be extra calls before or after the specified awaits.
pt_br: Якщо *any_order* має значення false, очікування мають бути послідовними. Можуть бути додаткові виклики до або після вказаних очікувань.

source: If *any_order* is true then the awaits can be in any order, but they must all appear in :attr:`await_args_list`.
pt_br: Якщо *any_order* має значення true, очікування можуть бути в будь-якому порядку, але всі вони мають відображатися в :attr:`await_args_list`.

source: Assert that the mock was never awaited.
pt_br: Afirma que o mock nunca foi aguardado.

source: See :func:`Mock.reset_mock`. Also sets :attr:`await_count` to 0, :attr:`await_args` to None, and clears the :attr:`await_args_list`.
pt_br: Перегляньте :func:`Mock.reset_mock`. Також встановлює :attr:`await_count` на 0, :attr:`await_args` на None і очищає :attr:`await_args_list`.

source: An integer keeping track of how many times the mock object has been awaited.
pt_br: Ціле число, яке відстежує, скільки разів очікувався макетний об’єкт.

source: This is either ``None`` (if the mock hasn’t been awaited), or the arguments that the mock was last awaited with. Functions the same as :attr:`Mock.call_args`.
pt_br: Це або ``None`` (якщо макет не був очікуваний), або аргументи, з якими макет було очікувано востаннє. Функціонує так само, як :attr:`Mock.call_args`.

source: This is a list of all the awaits made to the mock object in sequence (so the length of the list is the number of times it has been awaited). Before any awaits have been made it is an empty list.
pt_br: Це список усіх очікувань, зроблених для макетного об’єкта в послідовності (тому довжина списку — це кількість разів, коли його очікували). Перш ніж було зроблено будь-які очікування, це порожній список.

source: Calling
pt_br: Fazendo chamadas

source: Mock objects are callable. The call will return the value set as the :attr:`~Mock.return_value` attribute. The default return value is a new Mock object; it is created the first time the return value is accessed (either explicitly or by calling the Mock) - but it is stored and the same one returned each time.
pt_br: Фіктивні об'єкти можна викликати. Виклик поверне значення, встановлене як атрибут :attr:`~Mock.return_value`. Типовим значенням, що повертається, є новий об’єкт Mock; воно створюється під час першого доступу до значення, що повертається (явним чином або шляхом виклику Mock), але воно зберігається й кожного разу повертається те саме.

source: Calls made to the object will be recorded in the attributes like :attr:`~Mock.call_args` and :attr:`~Mock.call_args_list`.
pt_br: Виклики, здійснені до об’єкта, будуть записані в такі атрибути, як :attr:`~Mock.call_args` і :attr:`~Mock.call_args_list`.

source: The simplest way to make a mock raise an exception when called is to make :attr:`~Mock.side_effect` an exception class or instance:
pt_br: Найпростіший спосіб змусити макет викликати виняток під час виклику — це зробити :attr:`~Mock.side_effect` класом або екземпляром виключення:

source: If any members of the iterable are exceptions they will be raised instead of returned::
pt_br: Якщо будь-які члени iterable є винятками, вони будуть викликані замість повернення::

source: Deleting Attributes
pt_br: Deletando Atributos

source: Mock objects create attributes on demand. This allows them to pretend to be objects of any type.
pt_br: Макетні об’єкти створюють атрибути на вимогу. Це дозволяє їм видавати себе за об’єкти будь-якого типу.

source: You "block" attributes by deleting them. Once deleted, accessing an attribute will raise an :exc:`AttributeError`.
pt_br: Ви "блокуєте" атрибути, видаляючи їх. Після видалення доступ до атрибута викличе :exc:`AttributeError`.

source: Mock names and the name attribute
pt_br: Nomes de Mock e o atributo *name*

source: Since "name" is an argument to the :class:`Mock` constructor, if you want your mock object to have a "name" attribute you can't just pass it in at creation time. There are two alternatives. One option is to use :meth:`~Mock.configure_mock`::
pt_br: Оскільки "name" є аргументом конструктора :class:`Mock`, якщо ви хочете, щоб ваш макетний об’єкт мав атрибут "name", ви не можете просто передати його під час створення. Є дві альтернативи. Одним із варіантів є використання :meth:`~Mock.configure_mock`::

source: A simpler option is to simply set the "name" attribute after mock creation::
pt_br: Простішим варіантом є просто встановити атрибут "name" після створення макета::

source: Attaching Mocks as Attributes
pt_br: Anexando Mocks como Atributos

source: When you attach a mock as an attribute of another mock (or as the return value) it becomes a "child" of that mock. Calls to the child are recorded in the :attr:`~Mock.method_calls` and :attr:`~Mock.mock_calls` attributes of the parent. This is useful for configuring child mocks and then attaching them to the parent, or for attaching mocks to a parent that records all calls to the children and allows you to make assertions about the order of calls between mocks:
pt_br: Коли ви додаєте макет як атрибут іншого макету (або як значення, що повертається), він стає "дочірнім" для цього макету. Виклики дочірнього елемента записуються в атрибутах :attr:`~Mock.method_calls` і :attr:`~Mock.mock_calls` батьківського. Це корисно для конфігурації дочірніх імітацій, а потім прикріплення їх до батьківського, або для прикріплення імітацій до батьківського, який записує всі виклики до нащадків і дозволяє вам робити твердження щодо порядку викликів між імітаціями:

source: The exception to this is if the mock has a name. This allows you to prevent the "parenting" if for some reason you don't want it to happen.
pt_br: Винятком є випадки, коли макет має назву. Це дозволяє запобігти "батьківству", якщо з якихось причин ви цього не хочете.

source: Mocks created for you by :func:`patch` are automatically given names. To attach mocks that have names to a parent you use the :meth:`~Mock.attach_mock` method::
pt_br: Макети, створені для вас :func:`patch`, автоматично отримують імена. Щоб приєднати імена до батьківського елемента, ви використовуєте метод :meth:`~Mock.attach_mock`::

source: The only exceptions are magic methods and attributes (those that have leading and trailing double underscores). Mock doesn't create these but instead raises an :exc:`AttributeError`. This is because the interpreter will often implicitly request these methods, and gets *very* confused to get a new Mock object when it expects a magic method. If you need magic method support see :ref:`magic methods <magic-methods>`.
pt_br: Єдиний виняток становлять магічні методи та атрибути (ті, що мають на початку та в кінці подвійне підкреслення). Mock не створює їх, а натомість викликає :exc:`AttributeError`. Це пояснюється тим, що інтерпретатор часто неявно запитує ці методи і *дуже* плутається, коли отримує новий об’єкт Mock, коли очікує чарівний метод. Якщо вам потрібна підтримка магічних методів, перегляньте :ref:`магічні методи <magic-methods>`.

source: The patchers
pt_br: Os criadores de patches

source: The patch decorators are used for patching objects only within the scope of the function they decorate. They automatically handle the unpatching for you, even if exceptions are raised. All of these functions can also be used in with statements or as class decorators.
pt_br: Декоратори латок використовуються для латання об’єктів лише в межах функції, яку вони декорують. Вони автоматично виконують видалення виправлень за вас, навіть якщо виникають винятки. Усі ці функції також можна використовувати в операторах або як декоратори класів.

source: The key is to do the patching in the right namespace. See the section `where to patch`_.
pt_br: Головне — виконати виправлення у правильному просторі імен. Дивіться розділ `where to patch`_.

source: :func:`patch` acts as a function decorator, class decorator or a context manager. Inside the body of the function or with statement, the *target* is patched with a *new* object. When the function/with statement exits the patch is undone.
pt_br: :func:`patch` діє як декоратор функції, декоратор класу або менеджер контексту. Усередині тіла функції або оператора *ціль* додається до *нового* об’єкта. Коли оператор function/with завершує роботу, патч скасовується.

source: If *new* is omitted, then the target is replaced with an :class:`AsyncMock` if the patched object is an async function or a :class:`MagicMock` otherwise. If :func:`patch` is used as a decorator and *new* is omitted, the created mock is passed in as an extra argument to the decorated function. If :func:`patch` is used as a context manager the created mock is returned by the context manager.
pt_br: Якщо *new* пропущено, ціль замінюється на :class:`AsyncMock`, якщо виправлений об’єкт є асинхронною функцією, або :class:`MagicMock` інакше. Якщо :func:`patch` використовується як декоратор, а *new* опущено, створений макет передається як додатковий аргумент до декорованої функції. Якщо :func:`patch` використовується як менеджер контексту, створений макет повертається менеджером контексту.

source: *target* should be a string in the form ``'package.module.ClassName'``. The *target* is imported and the specified object replaced with the *new* object, so the *target* must be importable from the environment you are calling :func:`patch` from. The target is imported when the decorated function is executed, not at decoration time.
pt_br: *ціль* має бути рядком у формі ``'package.module.ClassName``. *Ціль* імпортується, а вказаний об’єкт замінюється на *новий* об’єкт, тому *ціль* має бути імпортованою із середовища, з якого ви викликаєте :func:`patch`. Ціль імпортується під час виконання декорованої функції, а не під час декорування.

source: The *spec* and *spec_set* keyword arguments are passed to the :class:`MagicMock` if patch is creating one for you.
pt_br: Ключові аргументи *spec* і *spec_set* передаються в :class:`MagicMock`, якщо patch створює його для вас.
