Repository: python/python-docs-pt-br
Catalog: library/urllib.error.po
Languages: pt_br

source: :mod:`!urllib.error` --- Exception classes raised by urllib.request
pt_br: :mod:`!urllib.error` --- Classes de exceção levantadas por urllib.request

source: **Source code:** :source:`Lib/urllib/error.py`
pt_br: **Código-fonte:** :source:`Lib/urllib/error.py`

source: The :mod:`urllib.error` module defines the exception classes for exceptions raised by :mod:`urllib.request`. The base exception class is :exc:`URLError`.
pt_br: O módulo :mod:`urllib.error` define as classes de exceção para exceções levantadas por :mod:`urllib.request`. A classe de exceção base é :exc:`URLError`.

source: The following exceptions are raised by :mod:`urllib.error` as appropriate:
pt_br: As seguintes exceções são levantadas por :mod:`urllib.error` conforme apropriado:

source: The handlers raise this exception (or derived exceptions) when they run into a problem. It is a subclass of :exc:`OSError`.
pt_br: Os manipuladores levantam essa exceção (ou exceções derivadas) quando encontram um problema. É uma subclasse de :exc:`OSError`.

source: The reason for this error. It can be a message string or another exception instance.
pt_br: O motivo desse erro. Pode ser uma string de mensagem ou outra instância de exceção.

source: :exc:`URLError` used to be a subtype of :exc:`IOError`, which is now an alias of :exc:`OSError`.
pt_br: :exc:`URLError` costumava ser um subtipo de :exc:`IOError`, que agora é um apelido de :exc:`OSError`.

source: Though being an exception (a subclass of :exc:`URLError`), an :exc:`HTTPError` can also function as a non-exceptional file-like return value (the same thing that :func:`~urllib.request.urlopen` returns). This is useful when handling exotic HTTP errors, such as requests for authentication.
pt_br: Embora seja uma exceção (uma subclasse de :exc:`URLError`), uma :exc:`HTTPError` também pode funcionar como um valor de retorno não excepcional do tipo arquivo (a mesma coisa que :func:`~urllib.request.urlopen` retorna). Isso é útil ao lidar com erros de HTTP exóticos, como solicitações de autenticação.

source: Contains the request URL. An alias for *filename* attribute.
pt_br: Contém a solicitação URL. Um apelido para *nome do arquivo* atributo.

source: An HTTP status code as defined in :rfc:`2616`. This numeric value corresponds to a value found in the dictionary of codes as found in :attr:`http.server.BaseHTTPRequestHandler.responses`.
pt_br: Um código de status HTTP conforme definido em :rfc:`2616`. Este valor numérico corresponde a um valor encontrado no dicionário de códigos conforme encontrado em :attr:`http.server.BaseHTTPRequestHandler.responses`.

source: This is usually a string explaining the reason for this error. An alias for *msg* attribute.
pt_br: Geralmente é uma string explicando o motivo desse erro. Um apelido para o atributo *msg*.

source: The HTTP response headers for the HTTP request that caused the :exc:`HTTPError`. An alias for *hdrs* attribute.
pt_br: Os cabeçalhos de resposta HTTP para a solicitação HTTP que causou a :exc:`HTTPError`. Um apelido para o atributo *hdrs*.

source: A file-like object where the HTTP error body can be read from.
pt_br: Um objeto arquivo ou similar no qual o corpo do HTTP erro pode ser lido.

source: This exception is raised when the :func:`~urllib.request.urlretrieve` function detects that the amount of the downloaded data is less than the expected amount (given by the *Content-Length* header).
pt_br: Esta exceção é levantada quando a função :func:`~urllib.request.urlretrieve` detecta que a quantidade de dados baixados é menor que a quantidade esperada (fornecida pelo cabeçalho *Content-Length*).

source: The downloaded (and supposedly truncated) data.
pt_br: Os dados baixados (e supostamente truncados).
