Repository: python/python-docs-pt-br
Catalog: library/urllib.robotparser.po
Languages: pt_br

source: :mod:`!urllib.robotparser` --- Parser for robots.txt
pt_br: :mod:`!urllib.robotparser` --- Analisador sintático de robots.txt

source: **Source code:** :source:`Lib/urllib/robotparser.py`
pt_br: **Código-fonte:** :source:`Lib/urllib/robotparser.py`

source: This module provides a single class, :class:`RobotFileParser`, which answers questions about whether or not a particular user agent can fetch a URL on the web site that published the :file:`robots.txt` file. For more details on the structure of :file:`robots.txt` files, see http://www.robotstxt.org/orig.html.
pt_br: Este módulo fornece uma única classe, :class:`RobotFileParser`, que responde a perguntas sobre se um agente de usuário específico pode ou não buscar uma URL no site que publicou o arquivo :file:`robots.txt`. Para mais detalhes sobre a estrutura dos arquivos :file:`robots.txt`, consulte http://www.robotstxt.org/orig.html.

source: This class provides methods to read, parse and answer questions about the :file:`robots.txt` file at *url*.
pt_br: Esta classe fornece métodos para ler, analisar e responder perguntas sobre o arquivo :file:`robots.txt` em *url*.

source: Sets the URL referring to a :file:`robots.txt` file.
pt_br: Define a URL referente a um arquivo :file:`robots.txt`.

source: Reads the :file:`robots.txt` URL and feeds it to the parser.
pt_br: Lê o URL :file:`robots.txt` e o alimenta para o analisador sintático.

source: Parses the lines argument.
pt_br: Analisa o argumento de linhas.

source: Returns ``True`` if the *useragent* is allowed to fetch the *url* according to the rules contained in the parsed :file:`robots.txt` file.
pt_br: Retorna ``True`` se o *useragent* tiver permissão para buscar a *url* de acordo com as regras contidas no arquivo :file:`robots.txt` analisado.

source: Returns the time the ``robots.txt`` file was last fetched. This is useful for long-running web spiders that need to check for new ``robots.txt`` files periodically.
pt_br: Retorna o horário em que o arquivo ``robots.txt`` foi buscado pela última vez. Isso é útil para web spiders de longa duração que precisam verificar novos arquivos ``robots.txt`` periodicamente.

source: Sets the time the ``robots.txt`` file was last fetched to the current time.
pt_br: Define a hora em que o arquivo ``robots.txt`` foi buscado pela última vez para a hora atual.

source: Returns the value of the ``Crawl-delay`` parameter from ``robots.txt`` for the *useragent* in question. If there is no such parameter or it doesn't apply to the *useragent* specified or the ``robots.txt`` entry for this parameter has invalid syntax, return ``None``.
pt_br: Retorna o valor do parâmetro ``Crawl-delay`` de ``robots.txt`` para o *useragent* em questão. Se não houver tal parâmetro ou se ele não se aplicar ao *useragent* especificado ou se a entrada ``robots.txt`` para este parâmetro tiver sintaxe inválida, retorna ``None``.

source: Returns the contents of the ``Request-rate`` parameter from ``robots.txt`` as a :term:`named tuple` ``RequestRate(requests, seconds)``. If there is no such parameter or it doesn't apply to the *useragent* specified or the ``robots.txt`` entry for this parameter has invalid syntax, return ``None``.
pt_br: Retorna o conteúdo do parâmetro ``Request-rate`` de ``robots.txt`` como uma :term:`tupla nomeada` ``RequestRate(requests, seconds)``. Se não houver tal parâmetro ou se ele não se aplicar ao *useragent* especificado ou se a entrada ``robots.txt`` para este parâmetro tiver sintaxe inválida, retorna ``None``.

source: Returns the contents of the ``Sitemap`` parameter from ``robots.txt`` in the form of a :func:`list`. If there is no such parameter or the ``robots.txt`` entry for this parameter has invalid syntax, return ``None``.
pt_br: Retorna o conteúdo do parâmetro ``Sitemap`` de ``robots.txt`` no formato de uma :func:`list`. Se não houver tal parâmetro ou a entrada ``robots.txt`` para este parâmetro tiver sintaxe inválida, retorna ``None``.

source: The following example demonstrates basic use of the :class:`RobotFileParser` class::
pt_br: O exemplo a seguir demonstra o uso básico da classe :class:`RobotFileParser`::
