Repository: python/python-docs-pt-br
Catalog: library/urllib.request.po
Languages: pt_br

source: :class:`URLopener` objects will raise an :exc:`OSError` exception if the server returns an error code.
pt_br: Об’єкти :class:`URLopener` викличуть виняток :exc:`OSError`, якщо сервер повертає код помилки.

source: Open *fullurl* using the appropriate protocol. This method sets up cache and proxy information, then calls the appropriate open method with its input arguments. If the scheme is not recognized, :meth:`open_unknown` is called. The *data* argument has the same meaning as the *data* argument of :func:`urlopen`.
pt_br: Відкрийте *fullurl* за допомогою відповідного протоколу. Цей метод налаштовує інформацію про кеш і проксі, а потім викликає відповідний відкритий метод із його вхідними аргументами. Якщо схема не розпізнається, викликається :meth:`open_unknown`. Аргумент *data* має те саме значення, що й аргумент *data* :func:`urlopen`.

source: This method always quotes *fullurl* using :func:`~urllib.parse.quote`.
pt_br: Цей метод завжди цитує *fullurl* за допомогою :func:`~urllib.parse.quote`.

source: Overridable interface to open unknown URL types.
pt_br: Перевизначений інтерфейс для відкриття невідомих типів URL.

source: Retrieves the contents of *url* and places it in *filename*. The return value is a tuple consisting of a local filename and either an :class:`email.message.Message` object containing the response headers (for remote URLs) or ``None`` (for local URLs). The caller must then open and read the contents of *filename*. If *filename* is not given and the URL refers to a local file, the input filename is returned. If the URL is non-local and *filename* is not given, the filename is the output of :func:`tempfile.mktemp` with a suffix that matches the suffix of the last path component of the input URL. If *reporthook* is given, it must be a function accepting three numeric parameters: A chunk number, the maximum size chunks are read in and the total size of the download (-1 if unknown). It will be called once at the start and after each chunk of data is read from the network. *reporthook* is ignored for local URLs.
pt_br: Отримує вміст *url* і поміщає його в *filename*. Значення, що повертається, є кортежем, що складається з імені локального файлу та об’єкта :class:`email.message.Message`, що містить заголовки відповіді (для віддалених URL-адрес) або ``None`` (для локальних URL-адрес). Потім абонент повинен відкрити та прочитати вміст *filename*. Якщо *ім’я файлу* не вказано, а URL-адреса посилається на локальний файл, повертається ім’я вхідного файлу. Якщо URL-адреса нелокальна і *filename* не вказано, ім’я файлу є результатом :func:`tempfile.mktemp` із суфіксом, який відповідає суфіксу останнього компонента шляху вхідної URL-адреси. Якщо вказано *reporthook*, це має бути функція, яка приймає три числові параметри: номер блоку, максимальний розмір фрагментів, які зчитуються, і загальний розмір завантаження (-1, якщо невідомо). Він буде викликаний один раз на початку та після кожного зчитування даних із мережі. *reporthook* ігнорується для локальних URL-адрес.

source: If the *url* uses the :file:`http:` scheme identifier, the optional *data* argument may be given to specify a ``POST`` request (normally the request type is ``GET``). The *data* argument must in standard :mimetype:`application/x-www-form-urlencoded` format; see the :func:`urllib.parse.urlencode` function.
pt_br: Якщо *url* використовує ідентифікатор схеми :file:`http:`, можна надати необов’язковий аргумент *data*, щоб визначити запит ``POST`` (зазвичай тип запиту ``GET``). Аргумент *data* має бути в стандартному форматі :mimetype:`application/x-www-form-urlencoded`; перегляньте функцію :func:`urllib.parse.urlencode`.

source: Variable that specifies the user agent of the opener object. To get :mod:`urllib` to tell servers that it is a particular user agent, set this in a subclass as a class variable or in the constructor before calling the base constructor.
pt_br: Змінна, яка вказує агента користувача об’єкта відкривача. Щоб змусити :mod:`urllib` повідомляти серверам, що це певний агент користувача, встановіть це в підкласі як змінну класу або в конструкторі перед викликом базового конструктора.

source: :class:`FancyURLopener` subclasses :class:`URLopener` providing default handling for the following HTTP response codes: 301, 302, 303, 307 and 401. For the 30x response codes listed above, the :mailheader:`Location` header is used to fetch the actual URL. For 401 response codes (authentication required), basic HTTP authentication is performed. For the 30x response codes, recursion is bounded by the value of the *maxtries* attribute, which defaults to 10.
pt_br: :class:`FancyURLopener` підкласи :class:`URLopener`, що забезпечує обробку за замовчуванням для таких кодів відповіді HTTP: 301, 302, 303, 307 і 401. Для кодів відповіді 30x, наведених вище, заголовок :mailheader:`Location` використовується для отримання фактичної URL-адреси. Для кодів відповіді 401 (потрібна автентифікація) виконується базова автентифікація HTTP. Для кодів відповіді 30x рекурсія обмежена значенням атрибута *maxtries*, яке за замовчуванням дорівнює 10.

source: According to the letter of :rfc:`2616`, 301 and 302 responses to POST requests must not be automatically redirected without confirmation by the user. In reality, browsers do allow automatic redirection of these responses, changing the POST to a GET, and :mod:`urllib` reproduces this behaviour.
pt_br: Згідно з листом :rfc:`2616`, відповіді 301 і 302 на запити POST не повинні автоматично перенаправлятися без підтвердження користувача. Насправді браузери дозволяють автоматичне перенаправлення цих відповідей, змінюючи POST на GET, і :mod:`urllib` відтворює цю поведінку.

source: The parameters to the constructor are the same as those for :class:`URLopener`.
pt_br: Параметри конструктора такі самі, як і для :class:`URLopener`.

source: When performing basic authentication, a :class:`FancyURLopener` instance calls its :meth:`prompt_user_passwd` method. The default implementation asks the users for the required information on the controlling terminal. A subclass may override this method to support more appropriate behavior if needed.
pt_br: Під час базової автентифікації екземпляр :class:`FancyURLopener` викликає свій метод :meth:`prompt_user_passwd`. Стандартна реалізація запитує у користувачів необхідну інформацію на керуючому терміналі. Підклас може замінити цей метод для підтримки більш відповідної поведінки, якщо це необхідно.

source: The :class:`FancyURLopener` class offers one additional method that should be overloaded to provide the appropriate behavior:
pt_br: Клас :class:`FancyURLopener` пропонує один додатковий метод, який слід перевантажити, щоб забезпечити належну поведінку:

source: Return information needed to authenticate the user at the given host in the specified security realm. The return value should be a tuple, ``(user, password)``, which can be used for basic authentication.
pt_br: Повернути інформацію, необхідну для автентифікації користувача на даному хості у вказаній області безпеки. Поверненим значенням має бути кортеж ``(користувач, пароль)``, який можна використовувати для базової автентифікації.

source: The implementation prompts for this information on the terminal; an application should override this method to use an appropriate interaction model in the local environment.
pt_br: Реалізація запитує цю інформацію на терміналі; програма повинна замінити цей метод, щоб використовувати відповідну модель взаємодії в локальному середовищі.

source: :mod:`urllib.request` Restrictions
pt_br: :mod:`urllib.request` Обмеження

source: Currently, only the following protocols are supported: HTTP (versions 0.9 and 1.0), FTP, local files, and data URLs.
pt_br: Наразі підтримуються лише такі протоколи: HTTP (версії 0.9 і 1.0), FTP, локальні файли та URL-адреси даних.

source: Added support for data URLs.
pt_br: Додано підтримку URL-адрес даних.

source: The caching feature of :func:`urlretrieve` has been disabled until someone finds the time to hack proper processing of Expiration time headers.
pt_br: Функцію кешування :func:`urlretrieve` вимкнено, доки хтось не знайде час зламати правильну обробку заголовків часу закінчення терміну дії.

source: There should be a function to query whether a particular URL is in the cache.
pt_br: Має бути функція для запиту, чи є певна URL-адреса в кеші.

source: For backward compatibility, if a URL appears to point to a local file but the file can't be opened, the URL is re-interpreted using the FTP protocol. This can sometimes cause confusing error messages.
pt_br: Для зворотної сумісності, якщо URL-адреса вказує на локальний файл, але файл не може бути відкритий, URL-адреса повторно інтерпретується за допомогою протоколу FTP. Іноді це може призвести до незрозумілих повідомлень про помилки.

source: The data returned by :func:`urlopen` or :func:`urlretrieve` is the raw data returned by the server. This may be binary data (such as an image), plain text or (for example) HTML. The HTTP protocol provides type information in the reply header, which can be inspected by looking at the :mailheader:`Content-Type` header. If the returned data is HTML, you can use the module :mod:`html.parser` to parse it.
pt_br: Дані, які повертає :func:`urlopen` або :func:`urlretrieve`, є необробленими даними, які повертає сервер. Це можуть бути двійкові дані (наприклад, зображення), звичайний текст або (наприклад) HTML. Протокол HTTP надає інформацію про тип у заголовку відповіді, яку можна перевірити, подивившись на заголовок :mailheader:`Content-Type`. Якщо повернуті дані є HTML, ви можете використати модуль :mod:`html.parser` для їх аналізу.

source: The code handling the FTP protocol cannot differentiate between a file and a directory. This can lead to unexpected behavior when attempting to read a URL that points to a file that is not accessible. If the URL ends in a ``/``, it is assumed to refer to a directory and will be handled accordingly. But if an attempt to read a file leads to a 550 error (meaning the URL cannot be found or is not accessible, often for permission reasons), then the path is treated as a directory in order to handle the case when a directory is specified by a URL but the trailing ``/`` has been left off. This can cause misleading results when you try to fetch a file whose read permissions make it inaccessible; the FTP code will try to read it, fail with a 550 error, and then perform a directory listing for the unreadable file. If fine-grained control is needed, consider using the :mod:`ftplib` module, subclassing :class:`FancyURLopener`, or changing *_urlopener* to meet your needs.
pt_br: Код, який обробляє протокол FTP, не може відрізнити файл від каталогу. Це може призвести до неочікуваної поведінки під час спроби прочитати URL-адресу, яка вказує на файл, до якого немає доступу. Якщо URL-адреса закінчується на ``/``, передбачається, що вона посилається на каталог і буде оброблятися відповідно. Але якщо спроба прочитати файл призводить до помилки 550 (це означає, що URL-адресу неможливо знайти або вона недоступна, часто через дозвіл), тоді шлях розглядається як каталог, щоб обробити випадок, коли вказано каталог за URL-адресою, але кінцевий символ ``/`` було пропущено. Це може призвести до оманливих результатів, коли ви намагаєтеся отримати файл, дозволи на читання якого роблять його недоступним; код FTP спробує прочитати його, зазнає помилки 550, а потім виконає перелік каталогу для нечитабельного файлу. Якщо потрібен детальний контроль, розгляньте можливість використання модуля :mod:`ftplib`, створення підкласу :class:`FancyURLopener` або зміни *_urlopener* відповідно до ваших потреб.

source: :mod:`urllib.response` --- Response classes used by urllib
pt_br: :mod:`urllib.response` --- Класи відповідей, які використовує urllib

source: The :mod:`urllib.response` module defines functions and classes which define a minimal file-like interface, including ``read()`` and ``readline()``. Functions defined by this module are used internally by the :mod:`urllib.request` module. The typical response object is a :class:`urllib.response.addinfourl` instance:
pt_br: Модуль :mod:`urllib.response` визначає функції та класи, які визначають мінімальний файлоподібний інтерфейс, включаючи ``read()`` і ``readline()``. Функції, визначені цим модулем, використовуються внутрішньо модулем :mod:`urllib.request`. Типовий об’єкт відповіді – це екземпляр :class:`urllib.response.addinfourl`:

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
pt_br: URL-адреса отриманого ресурсу, яка зазвичай використовується для визначення того, чи було переспрямовано.

source: Returns the headers of the response in the form of an :class:`~email.message.EmailMessage` instance.
pt_br: Повертає заголовки відповіді у формі екземпляра :class:`~email.message.EmailMessage`.

source: Status code returned by server.
pt_br: Код статусу, повернутий сервером.

source: Deprecated in favor of :attr:`~addinfourl.url`.
pt_br: Застаріло на користь :attr:`~addinfourl.url`.

source: Deprecated in favor of :attr:`~addinfourl.headers`.
pt_br: Застаріло на користь :attr:`~addinfourl.headers`.

source: Deprecated in favor of :attr:`~addinfourl.status`.
pt_br: Застаріло на користь :attr:`~addinfourl.status`.
