Repository: python/python-docs-pt-br
Catalog: library/urllib.request.po
Languages: pt_br

source: :mod:`urllib.request` --- Extensible library for opening URLs
pt_br: :mod:`urllib.request` --- Biblioteca extensível para abrir URLs

source: **Source code:** :source:`Lib/urllib/request.py`
pt_br: **Código-fonte:** :source:`Lib/urllib/request.py`

source: The :mod:`urllib.request` module defines functions and classes which help in opening URLs (mostly HTTP) in a complex world --- basic and digest authentication, redirections, cookies and more.
pt_br: O módulo :mod:`urllib.request` define funções e classes que ajudam a abrir URLs (principalmente HTTP) em um mundo complexo --- autenticação básica ou por digest, redirecionamentos, cookies e muito mais.

source: The `Requests package <https://requests.readthedocs.io/en/master/>`_ is recommended for a higher-level HTTP client interface.
pt_br: O `pacote Requests <https://requests.readthedocs.io/en/master/>`_ é recomendado para uma interface alto nível de cliente HTTP.

source: The :mod:`urllib.request` module defines the following functions:
pt_br: O módulo :mod:`urllib.request` define as seguintes funções:

source: Open the URL *url*, which can be either a string or a :class:`Request` object.
pt_br: Abre o URL *url*, que pode ser uma string ou um objeto :class:`Request`.

source: *data* must be an object specifying additional data to be sent to the server, or ``None`` if no such data is needed. See :class:`Request` for details.
pt_br: *data* deve ser um objeto que especifique dados adicionais a serem enviados ao servidor ou ``None``, se nenhum dado for necessário. Veja :class:`Request` para detalhes.

source: urllib.request module uses HTTP/1.1 and includes ``Connection:close`` header in its HTTP requests.
pt_br: O módulo urllib.request usa HTTP/1.1 e inclui o cabeçalho ``Connection:close`` em suas solicitações HTTP.

source: The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). This actually only works for HTTP, HTTPS and FTP connections.
pt_br: O parâmetro opcional *timeout* especifica um tempo limite em segundos para bloquear operações como a tentativa de conexão (se não for especificado, a configuração de tempo limite padrão global será usada). Na verdade, isso só funciona para conexões HTTP, HTTPS e FTP.

source: If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options. See :class:`~http.client.HTTPSConnection` for more details.
pt_br: Se *context* for especificado, deve ser uma instância de :class:`ssl.SSLContext` descrevendo as várias opções SSL. Veja :class:`~http.client.HTTPSConnection` para mais detalhes.

source: The optional *cafile* and *capath* parameters specify a set of trusted CA certificates for HTTPS requests. *cafile* should point to a single file containing a bundle of CA certificates, whereas *capath* should point to a directory of hashed certificate files. More information can be found in :meth:`ssl.SSLContext.load_verify_locations`.
pt_br: Os parâmetros opcionais *cafile* e *capath* especificam um conjunto de certificados de AC confiáveis para solicitações HTTPS. *cafile* deve apontar para um único arquivo contendo um pacote de certificados de AC, enquanto *capath* deve apontar para um diretório de arquivos de certificado em hash. Mais informações podem ser encontradas em :meth:`ssl.SSLContext.load_verify_locations`.

source: The *cadefault* parameter is ignored.
pt_br: O parâmetro *cadefault* é ignorado.

source: This function always returns an object which can work as a :term:`context manager` and has the properties *url*, *headers*, and *status*. See :class:`urllib.response.addinfourl` for more detail on these properties.
pt_br: Esta função sempre retorna um objeto que pode funcionar como um :term:`gerenciador de contexto` e tem as propriedades *url*, *headers* e *status*. Veja :class:`urllib.response.addinfourl` para mais detalhes sobre essas propriedades.

source: For HTTP and HTTPS URLs, this function returns a :class:`http.client.HTTPResponse` object slightly modified. In addition to the three new methods above, the msg attribute contains the same information as the :attr:`~http.client.HTTPResponse.reason` attribute --- the reason phrase returned by server --- instead of the response headers as it is specified in the documentation for :class:`~http.client.HTTPResponse`.
pt_br: Para URLs HTTP e HTTPS, esta função retorna um objeto :class:`http.client.HTTPResponse` ligeiramente modificado. Além dos três novos métodos acima, o atributo msg contém as mesmas informações que o atributo :attr:`~http.client.HTTPResponse.reason` --- a frase de razão retornada pelo servidor --- em vez dos cabeçalhos de resposta como é especificado na documentação para :class:`~http.client.HTTPResponse`.

source: For FTP, file, and data URLs and requests explicitly handled by legacy :class:`URLopener` and :class:`FancyURLopener` classes, this function returns a :class:`urllib.response.addinfourl` object.
pt_br: Para FTP, arquivo e URLs de dados e solicitações explicitamente tratadas pelas classes legadas :class:`URLopener` e :class:`FancyURLopener`, esta função retorna um objeto :class:`urllib.response.addinfourl`.

source: Raises :exc:`~urllib.error.URLError` on protocol errors.
pt_br: Levanta :exc:`~urllib.error.URLError` quando ocorrer erros de protocolo.

source: Note that ``None`` may be returned if no handler handles the request (though the default installed global :class:`OpenerDirector` uses :class:`UnknownHandler` to ensure this never happens).
pt_br: Observe que ``None`` pode ser retornado se nenhum manipulador lidar com a solicitação (embora a :class:`OpenerDirector` global instalada padrão use :class:`UnknownHandler` para garantir que isso nunca aconteça).

source: In addition, if proxy settings are detected (for example, when a ``*_proxy`` environment variable like :envvar:`http_proxy` is set), :class:`ProxyHandler` is default installed and makes sure the requests are handled through the proxy.
pt_br: Além disso, se as configurações de proxy forem detectadas (por exemplo, quando uma variável de ambiente ``*_proxy`` como :envvar:`http_proxy` é definida), :class:`ProxyHandler` é instalado por padrão e garante que as solicitações sejam tratadas por meio o proxy.

source: The legacy ``urllib.urlopen`` function from Python 2.6 and earlier has been discontinued; :func:`urllib.request.urlopen` corresponds to the old ``urllib2.urlopen``. Proxy handling, which was done by passing a dictionary parameter to ``urllib.urlopen``, can be obtained by using :class:`ProxyHandler` objects.
pt_br: A função legada ``urllib.urlopen`` do Python 2.6 e anteriores foi descontinuada; :func:`urllib.request.urlopen` corresponde à antiga ``urllib2.urlopen``. O tratamento de proxy, que foi feito passando um parâmetro de dicionário para ``urllib.urlopen``, pode ser obtido usando objetos :class:`ProxyHandler`.

source: Raises an :ref:`auditing event <auditing>` ``urllib.Request`` with arguments ``fullurl``, ``data``, ``headers``, ``method``.
pt_br: Levanta um :ref:`evento de auditoria <auditing>` ``urllib.Request`` com argumentos ``fullurl``, ``data``, ``headers``, ``method``.

source: The default opener raises an :ref:`auditing event <auditing>` ``urllib.Request`` with arguments ``fullurl``, ``data``, ``headers``, ``method`` taken from the request object.
pt_br: O abridor padrão levanta um :ref:`evento de auditoria<auditing>` ``urllib.Request`` com os argumentos ``fullurl``, ``data``, ``headers``, ``method`` obtidos do objeto de requisição.

source: *cafile* and *capath* were added.
pt_br: *cafile* e *capath* foram adicionados.

source: HTTPS virtual hosts are now supported if possible (that is, if :data:`ssl.HAS_SNI` is true).
pt_br: Hosts virtuais HTTPS agora são suportados, se possível (ou seja, se :data:`ssl.HAS_SNI` for verdadeiro).

source: *data* can be an iterable object.
pt_br: *data* pode ser um objeto iterável.

source: *cadefault* was added.
pt_br: *cadefault* foi adicionado.

source: *context* was added.
pt_br: *context* foi adicionado.

source: *cafile*, *capath* and *cadefault* are deprecated in favor of *context*. Please use :meth:`ssl.SSLContext.load_cert_chain` instead, or let :func:`ssl.create_default_context` select the system's trusted CA certificates for you.
pt_br: *cafile*, *capath* e *cadefault* estão descontinuados em favor de *context*. Por favor, em vez disso, utilize :meth:`ssl.SSLContext.load_cert_chain` ou deixe :func:`ssl.create_default_context` selecionar os certificados AC confiáveis do sistema para você.

source: Install an :class:`OpenerDirector` instance as the default global opener. Installing an opener is only necessary if you want urlopen to use that opener; otherwise, simply call :meth:`OpenerDirector.open` instead of :func:`~urllib.request.urlopen`. The code does not check for a real :class:`OpenerDirector`, and any class with the appropriate interface will work.
pt_br: Встановіть екземпляр :class:`OpenerDirector` як глобальний засіб відкриття за умовчанням. Встановлення відкривача необхідно, лише якщо ви хочете, щоб urlopen використовував цей відкривач; інакше просто викликайте :meth:`OpenerDirector.open` замість :func:`~urllib.request.urlopen`. Код не перевіряє справжнього :class:`OpenerDirector`, і будь-який клас із відповідним інтерфейсом працюватиме.

source: Return an :class:`OpenerDirector` instance, which chains the handlers in the order given. *handler*\s can be either instances of :class:`BaseHandler`, or subclasses of :class:`BaseHandler` (in which case it must be possible to call the constructor without any parameters). Instances of the following classes will be in front of the *handler*\s, unless the *handler*\s contain them, instances of them or subclasses of them: :class:`ProxyHandler` (if proxy settings are detected), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.
pt_br: Повертає екземпляр :class:`OpenerDirector`, який об’єднує обробники у вказаному порядку. *handler*\s можуть бути або екземплярами :class:`BaseHandler`, або підкласами :class:`BaseHandler` (у цьому випадку повинна бути можливість викликати конструктор без будь-яких параметрів). Екземпляри наступних класів будуть перед *обробниками*\s, якщо тільки *обробники*\ не містять їх, їх екземпляри або їхні підкласи: :class:`ProxyHandler` (якщо виявлено налаштування проксі), :class:`UnknownHandler`, :class:`HTTPHandler`, :class:`HTTPDefaultErrorHandler`, :class:`HTTPRedirectHandler`, :class:`FTPHandler`, :class:`FileHandler`, :class:`HTTPErrorProcessor`.

source: If the Python installation has SSL support (i.e., if the :mod:`ssl` module can be imported), :class:`HTTPSHandler` will also be added.
pt_br: Якщо встановлення Python підтримує SSL (тобто якщо модуль :mod:`ssl` можна імпортувати), :class:`HTTPSHandler` також буде додано.

source: A :class:`BaseHandler` subclass may also change its :attr:`handler_order` attribute to modify its position in the handlers list.
pt_br: Підклас :class:`BaseHandler` також може змінити свій атрибут :attr:`handler_order`, щоб змінити його позицію в списку обробників.

source: Convert the pathname *path* from the local syntax for a path to the form used in the path component of a URL. This does not produce a complete URL. The return value will already be quoted using the :func:`~urllib.parse.quote` function.
pt_br: Перетворіть назву шляху *path* із локального синтаксису шляху на форму, яка використовується в компоненті шляху URL-адреси. Це не створює повну URL-адресу. Повернене значення вже буде взято в лапки за допомогою функції :func:`~urllib.parse.quote`.

source: Convert the path component *path* from a percent-encoded URL to the local syntax for a path. This does not accept a complete URL. This function uses :func:`~urllib.parse.unquote` to decode *path*.
pt_br: Перетворіть компонент шляху *path* із URL-адреси у відсотковому кодуванні на локальний синтаксис для шляху. Це не приймає повну URL-адресу. Ця функція використовує :func:`~urllib.parse.unquote` для декодування *шляху*.

source: This helper function returns a dictionary of scheme to proxy server URL mappings. It scans the environment for variables named ``<scheme>_proxy``, in a case insensitive approach, for all operating systems first, and when it cannot find it, looks for proxy information from System Configuration for macOS and Windows Systems Registry for Windows. If both lowercase and uppercase environment variables exist (and disagree), lowercase is preferred.
pt_br: Ця допоміжна функція повертає словник схеми зіставлення URL-адрес проксі-сервера. Він сканує середовище на наявність змінних із назвою ``<scheme> _proxy``, без урахування регістру, для всіх операційних систем спочатку, а якщо не може їх знайти, шукає інформацію про проксі-сервер у системній конфігурації для macOS і системному реєстрі Windows для Windows. Якщо існують (і не узгоджуються) змінні середовища як у нижньому, так і у верхньому регістрах, перевага віддається нижньому регістру.

source: If the environment variable ``REQUEST_METHOD`` is set, which usually indicates your script is running in a CGI environment, the environment variable ``HTTP_PROXY`` (uppercase ``_PROXY``) will be ignored. This is because that variable can be injected by a client using the "Proxy:" HTTP header. If you need to use an HTTP proxy in a CGI environment, either use ``ProxyHandler`` explicitly, or make sure the variable name is in lowercase (or at least the ``_proxy`` suffix).
pt_br: Якщо встановлено змінну середовища ``REQUEST_METHOD``, що зазвичай вказує на те, що ваш сценарій працює в середовищі CGI, змінна середовища ``HTTP_PROXY`` (великий регістр ``_PROXY``) буде проігноровано. Це пояснюється тим, що ця змінна може бути введена клієнтом за допомогою HTTP-заголовка "Proxy:". Якщо вам потрібно використовувати HTTP-проксі в середовищі CGI, або явно використовуйте ``ProxyHandler``, або переконайтеся, що назва змінної написана малими літерами (або принаймні суфікс ``_proxy``).

source: The following classes are provided:
pt_br: As sequintes classes são disponibilizadas:

source: This class is an abstraction of a URL request.
pt_br: Цей клас є абстракцією URL-запиту.

source: *data* must be an object specifying additional data to send to the server, or ``None`` if no such data is needed. Currently HTTP requests are the only ones that use *data*. The supported object types include bytes, file-like objects, and iterables of bytes-like objects. If no ``Content-Length`` nor ``Transfer-Encoding`` header field has been provided, :class:`HTTPHandler` will set these headers according to the type of *data*. ``Content-Length`` will be used to send bytes objects, while ``Transfer-Encoding: chunked`` as specified in :rfc:`7230`, Section 3.3.1 will be used to send files and other iterables.
pt_br: *data* має бути об’єктом, який визначає додаткові дані для надсилання на сервер, або ``None``, якщо такі дані не потрібні. Наразі запити HTTP є єдиними, які використовують *data*. Підтримувані типи об’єктів включають байти, файлоподібні об’єкти та ітерації байтоподібних об’єктів. Якщо поля заголовка ``Content-Length`` або ``Transfer-Encoding`` не надано, :class:`HTTPHandler` встановить ці заголовки відповідно до типу *data*. ``Content-Length`` використовуватиметься для надсилання байтових об’єктів, тоді як ``Transfer-Encoding: chunked``, як зазначено в :rfc:`7230`, розділ 3.3.1, використовуватиметься для надсилання файлів та інших ітерацій.

source: For an HTTP POST request method, *data* should be a buffer in the standard :mimetype:`application/x-www-form-urlencoded` format. The :func:`urllib.parse.urlencode` function takes a mapping or sequence of 2-tuples and returns an ASCII string in this format. It should be encoded to bytes before being used as the *data* parameter.
pt_br: Для методу запиту HTTP POST *data* має бути буфером у стандартному форматі :mimetype:`application/x-www-form-urlencoded`. Функція :func:`urllib.parse.urlencode` приймає відображення або послідовність 2-кортежів і повертає рядок ASCII у цьому форматі. Перш ніж використовувати як параметр *data*, його слід закодувати в байти.

source: *headers* should be a dictionary, and will be treated as if :meth:`add_header` was called with each key and value as arguments. This is often used to "spoof" the ``User-Agent`` header value, which is used by a browser to identify itself -- some HTTP servers only allow requests coming from common browsers as opposed to scripts. For example, Mozilla Firefox may identify itself as ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, while :mod:`urllib`'s default user agent string is ``"Python-urllib/2.6"`` (on Python 2.6). All header keys are sent in camel case.
pt_br: *headers* має бути словником і розглядатиметься так, ніби було викликано :meth:`add_header` з кожним ключем і значенням як аргументами. Це часто використовується для "підробки" значення заголовка ``User-Agent``, яке використовується браузером для самоідентифікації - деякі HTTP-сервери дозволяють лише запити, що надходять із звичайних браузерів, на відміну від сценаріїв. Наприклад, Mozilla Firefox може ідентифікувати себе як ``"Mozilla/5.0 (X11; U; Linux i686) Gecko/20071127 Firefox/2.0.0.11"``, тоді як рядок агента користувача за замовчуванням :mod:`urllib` є ``"Python-urllib/2.6"`` (на Python 2.6). Усі ключі заголовка надсилаються у верблюжому футлярі.

source: An appropriate ``Content-Type`` header should be included if the *data* argument is present. If this header has not been provided and *data* is not None, ``Content-Type: application/x-www-form-urlencoded`` will be added as a default.
pt_br: Відповідний заголовок ``Content-Type`` слід включити, якщо присутній аргумент *data*. Якщо цей заголовок не було надано і *data* не є None, ``Content-Type: application/x-www-form-urlencoded`` буде додано за умовчанням.

source: The next two arguments are only of interest for correct handling of third-party HTTP cookies:
pt_br: Наступні два аргументи цікаві лише для правильної обробки сторонніх файлів cookie HTTP:

source: *origin_req_host* should be the request-host of the origin transaction, as defined by :rfc:`2965`. It defaults to ``http.cookiejar.request_host(self)``. This is the host name or IP address of the original request that was initiated by the user. For example, if the request is for an image in an HTML document, this should be the request-host of the request for the page containing the image.
pt_br: *origin_req_host* має бути хостом запиту вихідної транзакції, як визначено :rfc:`2965`. За замовчуванням ``http.cookiejar.request_host(self)``. Це ім’я хоста або IP-адреса вихідного запиту, ініційованого користувачем. Наприклад, якщо запит стосується зображення в документі HTML, це має бути хост запиту для сторінки, що містить зображення.

source: *unverifiable* should indicate whether the request is unverifiable, as defined by :rfc:`2965`. It defaults to ``False``. An unverifiable request is one whose URL the user did not have the option to approve. For example, if the request is for an image in an HTML document, and the user had no option to approve the automatic fetching of the image, this should be true.
pt_br: *unverifiable* має вказувати, чи є запит неперевіреним, як визначено :rfc:`2965`. За замовчуванням має значення ``False``. Неперевірений запит — це запит, URL-адресу якого користувач не мав можливості схвалити. Наприклад, якщо запит стосується зображення в документі HTML, і користувач не мав можливості підтвердити автоматичне отримання зображення, це має бути правдою.

source: *method* should be a string that indicates the HTTP request method that will be used (e.g. ``'HEAD'``). If provided, its value is stored in the :attr:`~Request.method` attribute and is used by :meth:`get_method()`. The default is ``'GET'`` if *data* is ``None`` or ``'POST'`` otherwise. Subclasses may indicate a different default method by setting the :attr:`~Request.method` attribute in the class itself.
pt_br: *method* має бути рядком, що вказує на метод запиту HTTP, який буде використано (наприклад, ``'HEAD'``). Якщо вказано, його значення зберігається в атрибуті :attr:`~Request.method` і використовується :meth:`get_method()`. Типовим значенням є ``'GET'``, якщо *data* має значення ``None`` або ``'POST'`` інакше. Підкласи можуть вказувати інший метод за замовчуванням, встановивши атрибут :attr:`~Request.method` у самому класі.

source: The request will not work as expected if the data object is unable to deliver its content more than once (e.g. a file or an iterable that can produce the content only once) and the request is retried for HTTP redirects or authentication. The *data* is sent to the HTTP server right away after the headers. There is no support for a 100-continue expectation in the library.
pt_br: Запит не працюватиме належним чином, якщо об’єкт даних не зможе доставити свій вміст більше одного разу (наприклад, файл або ітераційний елемент, який може створити вміст лише один раз), і запит повторюється для перенаправлення HTTP або автентифікації. *Дані* надсилаються на сервер HTTP одразу після заголовків. У бібліотеці немає підтримки очікування 100 продовжень.

source: :attr:`Request.method` argument is added to the Request class.
pt_br: Аргумент :attr:`Request.method` додається до класу Request.

source: Default :attr:`Request.method` may be indicated at the class level.
pt_br: Типовий :attr:`Request.method` може бути вказаний на рівні класу.

source: Do not raise an error if the ``Content-Length`` has not been provided and *data* is neither ``None`` nor a bytes object. Fall back to use chunked transfer encoding instead.
pt_br: Не створюйте повідомлення про помилку, якщо ``Content-Length`` не було надано, а *data* не є ні ``None``, ні об'єктом bytes. Поверніться до використання фрагментованого кодування передачі.

source: The :class:`OpenerDirector` class opens URLs via :class:`BaseHandler`\ s chained together. It manages the chaining of handlers, and recovery from errors.
pt_br: Клас :class:`OpenerDirector` відкриває URL-адреси через :class:`BaseHandler`\ об’єднані разом. Він керує ланцюжком обробників і відновленням після помилок.

source: This is the base class for all registered handlers --- and handles only the simple mechanics of registration.
pt_br: Це базовий клас для всіх зареєстрованих обробників --- і обробляє лише просту механіку реєстрації.

source: A class which defines a default handler for HTTP error responses; all responses are turned into :exc:`~urllib.error.HTTPError` exceptions.
pt_br: Клас, який визначає обробник за замовчуванням для відповідей на помилки HTTP; усі відповіді перетворюються на винятки :exc:`~urllib.error.HTTPError`.

source: A class to handle redirections.
pt_br: Uma classe para lidar com redirecionamentos.

source: A class to handle HTTP Cookies.
pt_br: Classe para lidar com Cookies HTTP.
