Repository: python/python-docs-pt-br
Catalog: library/urllib.request.po
Languages: pt_br

source: Return values and exceptions raised should be the same as those of :func:`urlopen`.
pt_br: Повернуті значення та викликані винятки мають бути такими самими, як у :func:`urlopen`.

source: *nnn* should be a three-digit HTTP error code. This method is also not defined in :class:`BaseHandler`, but will be called, if it exists, on an instance of a subclass, when an HTTP error with code *nnn* occurs.
pt_br: *nnn* має бути тризначним кодом помилки HTTP. Цей метод також не визначено в :class:`BaseHandler`, але буде викликаний, якщо він існує, на екземплярі підкласу, коли виникає помилка HTTP з кодом *nnn*.

source: Subclasses should override this method to handle specific HTTP errors.
pt_br: Підкласи повинні замінити цей метод для обробки конкретних помилок HTTP.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to pre-process requests of the given protocol.
pt_br: Цей метод *не* визначено в :class:`BaseHandler`, але підкласи повинні визначити його, якщо вони хочуть попередньо обробляти запити даного протоколу.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. The return value should be a :class:`Request` object.
pt_br: Цей метод, якщо його визначено, буде викликано батьківським :class:`OpenerDirector`. *req* буде об’єктом :class:`Request`. Поверненим значенням має бути об’єкт :class:`Request`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to post-process responses of the given protocol.
pt_br: Цей метод *не* визначено в :class:`BaseHandler`, але підкласи повинні визначити його, якщо вони хочуть постобробити відповіді заданого протоколу.

source: This method, if defined, will be called by the parent :class:`OpenerDirector`. *req* will be a :class:`Request` object. *response* will be an object implementing the same interface as the return value of :func:`urlopen`. The return value should implement the same interface as the return value of :func:`urlopen`.
pt_br: Цей метод, якщо його визначено, буде викликано батьківським :class:`OpenerDirector`. *req* буде об’єктом :class:`Request`. *response* буде об’єктом, який реалізує той самий інтерфейс, що й значення, що повертається :func:`urlopen`. Значення, що повертається, має реалізовувати той самий інтерфейс, що й значення, що повертається :func:`urlopen`.

source: HTTPRedirectHandler Objects
pt_br: Об’єкти HTTPRedirectHandler

source: Some HTTP redirections require action from this module's client code. If this is the case, :exc:`~urllib.error.HTTPError` is raised. See :rfc:`2616` for details of the precise meanings of the various redirection codes.
pt_br: Деякі перенаправлення HTTP вимагають дії від клієнтського коду цього модуля. Якщо це так, виникає :exc:`~urllib.error.HTTPError`. Див. :rfc:`2616` для детальної інформації про точні значення різних кодів перенаправлення.

source: The default implementation of this method does not strictly follow :rfc:`2616`, which says that 301 and 302 responses to ``POST`` requests must not be automatically redirected without confirmation by the user. In reality, browsers do allow automatic redirection of these responses, changing the POST to a ``GET``, and the default implementation reproduces this behavior.
pt_br: Стандартна реалізація цього методу не відповідає суворо :rfc:`2616`, яка говорить, що відповіді 301 і 302 на запити ``POST`` не повинні автоматично перенаправлятися без підтвердження користувача. Насправді браузери дозволяють автоматичне перенаправлення цих відповідей, змінюючи POST на ``GET``, і реалізація за замовчуванням відтворює цю поведінку.

source: Redirect to the ``Location:`` or ``URI:`` URL. This method is called by the parent :class:`OpenerDirector` when getting an HTTP 'moved permanently' response.
pt_br: Переспрямування на URL-адресу ``Location:`` або ``URI:``. Цей метод викликається батьківським :class:`OpenerDirector` під час отримання HTTP-відповіді "переміщено назавжди".

source: The same as :meth:`http_error_301`, but called for the 'found' response.
pt_br: Те саме, що :meth:`http_error_301`, але викликається відповідь 'знайдено'.

source: The same as :meth:`http_error_301`, but called for the 'see other' response.
pt_br: Те саме, що :meth:`http_error_301`, але викликається відповідь "переглянути інше".

source: HTTPCookieProcessor Objects
pt_br: Об’єкти HTTPCookieProcessor

source: :class:`HTTPCookieProcessor` instances have one attribute:
pt_br: Екземпляри :class:`HTTPCookieProcessor` мають один атрибут:

source: The :class:`http.cookiejar.CookieJar` in which cookies are stored.
pt_br: :class:`http.cookiejar.CookieJar`, у якому зберігаються файли cookie.

source: ProxyHandler Objects
pt_br: Об’єкти ProxyHandler

source: HTTPPasswordMgr Objects
pt_br: Об’єкти HTTPPasswordMgr

source: These methods are available on :class:`HTTPPasswordMgr` and :class:`HTTPPasswordMgrWithDefaultRealm` objects.
pt_br: Ці методи доступні в об’єктах :class:`HTTPPasswordMgr` і :class:`HTTPPasswordMgrWithDefaultRealm`.

source: *uri* can be either a single URI, or a sequence of URIs. *realm*, *user* and *passwd* must be strings. This causes ``(user, passwd)`` to be used as authentication tokens when authentication for *realm* and a super-URI of any of the given URIs is given.
pt_br: *uri* може бути або одним URI, або послідовністю URI. *realm*, *user* і *passwd* мають бути рядками. Це спричиняє використання ``(user, passwd)`` як маркерів автентифікації, коли надається автентифікація для *сфери* та супер-URI будь-якого з указаних URI.

source: Get user/password for given realm and URI, if any. This method will return ``(None, None)`` if there is no matching user/password.
pt_br: Отримайте користувача/пароль для заданої області та URI, якщо є. Цей метод поверне ``(None, None)``, якщо немає відповідного користувача/паролю.

source: For :class:`HTTPPasswordMgrWithDefaultRealm` objects, the realm ``None`` will be searched if the given *realm* has no matching user/password.
pt_br: Для об’єктів :class:`HTTPPasswordMgrWithDefaultRealm` шукатиметься область ``None``, якщо дана *сфера* не має відповідного користувача/паролю.

source: HTTPPasswordMgrWithPriorAuth Objects
pt_br: Об’єкти HTTPPasswordMgrWithPriorAuth

source: This password manager extends :class:`HTTPPasswordMgrWithDefaultRealm` to support tracking URIs for which authentication credentials should always be sent.
pt_br: Цей менеджер паролів розширює :class:`HTTPPasswordMgrWithDefaultRealm` для підтримки URI відстеження, для яких завжди слід надсилати облікові дані автентифікації.

source: *realm*, *uri*, *user*, *passwd* are as for :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* sets the initial value of the ``is_authenticated`` flag for the given URI or list of URIs. If *is_authenticated* is specified as ``True``, *realm* is ignored.
pt_br: *realm*, *uri*, *user*, *passwd* такі ж, як для :meth:`HTTPPasswordMgr.add_password`. *is_authenticated* встановлює початкове значення прапора ``is_authenticated`` для даного URI або списку URI. Якщо *is_authenticated* указано як ``True``, *realm* ігнорується.

source: Same as for :class:`HTTPPasswordMgrWithDefaultRealm` objects
pt_br: Те саме, що для об’єктів :class:`HTTPPasswordMgrWithDefaultRealm`

source: Update the ``is_authenticated`` flag for the given *uri* or list of URIs.
pt_br: Оновіть прапорець ``is_authenticated`` для заданого *uri* або списку URI.

source: Returns the current state of the ``is_authenticated`` flag for the given URI.
pt_br: Повертає поточний стан прапора ``is_authenticated`` для вказаного URI.

source: AbstractBasicAuthHandler Objects
pt_br: Об’єкти AbstractBasicAuthHandler

source: Handle an authentication request by getting a user/password pair, and re-trying the request. *authreq* should be the name of the header where the information about the realm is included in the request, *host* specifies the URL and path to authenticate for, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
pt_br: Обробіть запит на автентифікацію, отримавши пару користувач/пароль і повторивши запит. *authreq* має бути ім’ям заголовка, де інформація про область включена в запит, *host* визначає URL-адресу та шлях для автентифікації, *req* має бути (не вдалося) об’єктом :class:`Request` , а *headers* мають бути заголовками помилок.

source: *host* is either an authority (e.g. ``"python.org"``) or a URL containing an authority component (e.g. ``"http://python.org/"``). In either case, the authority must not contain a userinfo component (so, ``"python.org"`` and ``"python.org:80"`` are fine, ``"joe:password@python.org"`` is not).
pt_br: *host* — це або повноваження (наприклад, ``"python.org"``), або URL-адреса, що містить компонент повноважень (наприклад, ``"http://python.org/"``). У будь-якому випадку повноваження не повинні містити компонент userinfo (тому ``"python.org"`` і ``"python.org:80"`` підходять, ``"joe:password@python.org"`` не є).

source: HTTPBasicAuthHandler Objects
pt_br: Об’єкти HTTPBasicAuthHandler

source: Retry the request with authentication information, if available.
pt_br: Повторіть запит із інформацією для автентифікації, якщо вона доступна.

source: ProxyBasicAuthHandler Objects
pt_br: Об’єкти ProxyBasicAuthHandler

source: AbstractDigestAuthHandler Objects
pt_br: Об’єкти AbstractDigestAuthHandler

source: *authreq* should be the name of the header where the information about the realm is included in the request, *host* should be the host to authenticate to, *req* should be the (failed) :class:`Request` object, and *headers* should be the error headers.
pt_br: *authreq* має бути ім’ям заголовка, де інформація про область включена в запит, *host* має бути хостом для автентифікації, *req* має бути (не вдалося) об’єктом :class:`Request`, і *headers* повинні бути заголовками помилок.

source: HTTPDigestAuthHandler Objects
pt_br: Об’єкти HTTPDigestAuthHandler

source: ProxyDigestAuthHandler Objects
pt_br: Об’єкти ProxyDigestAuthHandler

source: HTTPHandler Objects
pt_br: Об’єкти HTTPHandler

source: Send an HTTP request, which can be either GET or POST, depending on ``req.has_data()``.
pt_br: Надішліть запит HTTP, який може бути GET або POST, залежно від ``req.has_data()``.

source: HTTPSHandler Objects
pt_br: Objetos HTTPSHandler

source: Send an HTTPS request, which can be either GET or POST, depending on ``req.has_data()``.
pt_br: Надішліть запит HTTPS, який може бути GET або POST, залежно від ``req.has_data()``.

source: FileHandler Objects
pt_br: Об’єкти FileHandler

source: Open the file locally, if there is no host name, or the host name is ``'localhost'``.
pt_br: Відкрийте файл локально, якщо немає імені хоста або ім’я хоста ``'localhost'``.

source: This method is applicable only for local hostnames. When a remote hostname is given, an :exc:`~urllib.error.URLError` is raised.
pt_br: Цей метод застосовний лише для локальних імен хостів. Коли вказано ім’я віддаленого хоста, виникає :exc:`~urllib.error.URLError`.

source: DataHandler Objects
pt_br: Об’єкти DataHandler

source: Read a data URL. This kind of URL contains the content encoded in the URL itself. The data URL syntax is specified in :rfc:`2397`. This implementation ignores white spaces in base64 encoded data URLs so the URL may be wrapped in whatever source file it comes from. But even though some browsers don't mind about a missing padding at the end of a base64 encoded data URL, this implementation will raise an :exc:`ValueError` in that case.
pt_br: Прочитайте URL-адресу даних. Цей вид URL-адреси містить вміст, закодований у самій URL-адресі. Синтаксис URL-адреси даних указано в :rfc:`2397`. Ця реалізація ігнорує пробіли в URL-адресах даних у кодуванні base64, тому URL-адресу можна загорнути в будь-який вихідний файл, з якого вона надходить. Але навіть незважаючи на те, що деякі браузери не заперечують щодо відсутності заповнення в кінці URL-адреси даних у кодуванні base64, у цьому випадку ця реалізація викличе :exc:`ValueError`.

source: FTPHandler Objects
pt_br: Об’єкти FTPHandler

source: Open the FTP file indicated by *req*. The login is always done with empty username and password.
pt_br: Відкрийте файл FTP, позначений *req*. Вхід завжди виконується з порожнім іменем користувача та паролем.

source: CacheFTPHandler Objects
pt_br: Об’єкти CacheFTPHandler

source: :class:`CacheFTPHandler` objects are :class:`FTPHandler` objects with the following additional methods:
pt_br: Об’єкти :class:`CacheFTPHandler` — це об’єкти :class:`FTPHandler` із такими додатковими методами:

source: Set timeout of connections to *t* seconds.
pt_br: Встановіть тайм-аут підключень на *t* секунд.

source: Set maximum number of cached connections to *m*.
pt_br: Установіть максимальну кількість кешованих підключень до *m*.

source: UnknownHandler Objects
pt_br: Objetos UnknownHandler

source: Raise a :exc:`~urllib.error.URLError` exception.
pt_br: Викликати виняток :exc:`~urllib.error.URLError`.

source: HTTPErrorProcessor Objects
pt_br: Об’єкти HTTPErrorProcessor

source: For 200 error codes, the response object is returned immediately.
pt_br: Для 200 кодів помилок об’єкт відповіді повертається негайно.

source: Process HTTPS error responses.
pt_br: Обробляти відповіді на помилки HTTPS.

source: The behavior is same as :meth:`http_response`.
pt_br: Поведінка така ж, як :meth:`http_response`.

source: Examples
pt_br: Exemplos

source: In addition to the examples below, more examples are given in :ref:`urllib-howto`.
pt_br: Крім наведених нижче прикладів, більше прикладів наведено в :ref:`urllib-howto`.

source: This example gets the python.org main page and displays the first 300 bytes of it. ::
pt_br: Цей приклад отримує головну сторінку python.org і відображає її перші 300 байт. ::

source: Note that urlopen returns a bytes object. This is because there is no way for urlopen to automatically determine the encoding of the byte stream it receives from the HTTP server. In general, a program will decode the returned bytes object to string once it determines or guesses the appropriate encoding.
pt_br: Зауважте, що urlopen повертає об’єкт bytes. Це тому, що urlopen не може автоматично визначати кодування потоку байтів, який він отримує від сервера HTTP. Загалом, програма декодує повернутий об’єкт bytes у рядок, як тільки вона визначить або вгадає відповідне кодування.

source: The following W3C document, https://www.w3.org/International/O-charset\ , lists the various ways in which an (X)HTML or an XML document could have specified its encoding information.
pt_br: У наступному документі W3C, https://www.w3.org/International/O-charset\, наведено перелік різних способів, якими документ (X)HTML або XML міг би вказати інформацію про кодування.

source: As the python.org website uses *utf-8* encoding as specified in its meta tag, we will use the same for decoding the bytes object. ::
pt_br: Оскільки веб-сайт python.org використовує кодування *utf-8*, як зазначено в його мета-тегу, ми будемо використовувати те саме для декодування об’єкта bytes. ::

source: It is also possible to achieve the same result without using the :term:`context manager` approach. ::
pt_br: Також можна досягти того самого результату, не використовуючи підхід :term:`context manager`. ::

source: In the following example, we are sending a data-stream to the stdin of a CGI and reading the data it returns to us. Note that this example will only work when the Python installation supports SSL. ::
pt_br: У наступному прикладі ми надсилаємо потік даних на stdin CGI та зчитуємо дані, які він повертає нам. Зауважте, що цей приклад працюватиме, лише якщо інсталяція Python підтримує SSL. ::

source: The code for the sample CGI used in the above example is::
pt_br: Код для прикладу CGI, використаного у наведеному вище прикладі, такий:

source: Here is an example of doing a ``PUT`` request using :class:`Request`::
pt_br: Ось приклад виконання запиту ``PUT`` за допомогою :class:`Request`::

source: Use of Basic HTTP Authentication::
pt_br: Використання базової автентифікації HTTP::

source: Adding HTTP headers:
pt_br: Adicionando cabeçalhos HTTP:

source: Use the *headers* argument to the :class:`Request` constructor, or::
pt_br: Використовуйте аргумент *headers* для конструктора :class:`Request` або:

source: :class:`OpenerDirector` automatically adds a :mailheader:`User-Agent` header to every :class:`Request`. To change this::
pt_br: :class:`OpenerDirector` автоматично додає заголовок :mailheader:`User-Agent` до кожного :class:`Request`. Щоб змінити це:

source: Also, remember that a few standard headers (:mailheader:`Content-Length`, :mailheader:`Content-Type` and :mailheader:`Host`) are added when the :class:`Request` is passed to :func:`urlopen` (or :meth:`OpenerDirector.open`).
pt_br: Також пам’ятайте, що кілька стандартних заголовків (:mailheader:`Content-Length`, :mailheader:`Content-Type` і :mailheader:`Host`) додаються, коли :class:`Request` передається до :func:`urlopen` (або :meth:`OpenerDirector.open`).

source: Here is an example session that uses the ``GET`` method to retrieve a URL containing parameters::
pt_br: Ось приклад сеансу, який використовує метод ``GET`` для отримання URL-адреси, що містить параметри:

source: The following example uses the ``POST`` method instead. Note that params output from urlencode is encoded to bytes before it is sent to urlopen as data::
pt_br: У наступному прикладі замість цього використовується метод ``POST``. Зауважте, що параметри, виведені з urlencode, кодуються до байтів перед тим, як надсилаються до urlopen як дані::

source: The following example uses an explicitly specified HTTP proxy, overriding environment settings::
pt_br: У наступному прикладі використовується явно вказаний проксі-сервер HTTP, який замінює налаштування середовища:

source: The following example uses no proxies at all, overriding environment settings::
pt_br: У наступному прикладі проксі-сервери взагалі не використовуються, замінюючи налаштування середовища:

source: Legacy interface
pt_br: Застарілий інтерфейс

source: The following functions and classes are ported from the Python 2 module ``urllib`` (as opposed to ``urllib2``). They might become deprecated at some point in the future.
pt_br: Наступні функції та класи перенесено з модуля Python 2 ``urllib`` (на відміну від ``urllib2``). Вони можуть стати застарілими в якийсь момент у майбутньому.

source: The second argument, if present, specifies the file location to copy to (if absent, the location will be a tempfile with a generated name). The third argument, if present, is a callable that will be called once on establishment of the network connection and once after each block read thereafter. The callable will be passed three arguments; a count of blocks transferred so far, a block size in bytes, and the total size of the file. The third argument may be ``-1`` on older FTP servers which do not return a file size in response to a retrieval request.
pt_br: Другий аргумент, якщо він присутній, визначає розташування файлу, куди потрібно скопіювати (якщо його немає, місцем буде тимчасовий файл зі згенерованою назвою). Третій аргумент, якщо він присутній, є викликом, який буде викликано один раз після встановлення мережевого з’єднання та один раз після кожного блоку, який буде прочитано в подальшому. Викликається буде передано три аргументи; кількість переданих блоків, розмір блоку в байтах і загальний розмір файлу. Третім аргументом може бути ``-1`` на старих FTP-серверах, які не повертають розмір файлу у відповідь на запит на отримання.

source: The following example illustrates the most common usage scenario::
pt_br: Наступний приклад ілюструє найпоширеніший сценарій використання:

source: If the *url* uses the :file:`http:` scheme identifier, the optional *data* argument may be given to specify a ``POST`` request (normally the request type is ``GET``). The *data* argument must be a bytes object in standard :mimetype:`application/x-www-form-urlencoded` format; see the :func:`urllib.parse.urlencode` function.
pt_br: Якщо *url* використовує ідентифікатор схеми :file:`http:`, можна надати необов’язковий аргумент *data*, щоб визначити запит ``POST`` (зазвичай тип запиту ``GET``). Аргумент *data* має бути об’єктом bytes у стандартному форматі :mimetype:`application/x-www-form-urlencoded`; перегляньте функцію :func:`urllib.parse.urlencode`.

source: The *Content-Length* is treated as a lower bound: if there's more data to read, urlretrieve reads more data, but if less data is available, it raises the exception.
pt_br: *Content-Length* розглядається як нижня межа: якщо є більше даних для читання, urlretrieve зчитує більше даних, але якщо доступних даних менше, виникає виняток.

source: If no *Content-Length* header was supplied, urlretrieve can not check the size of the data it has downloaded, and just returns it. In this case you just have to assume that the download was successful.
pt_br: Якщо заголовок *Content-Length* не надано, urlretrieve не може перевірити розмір завантажених даних і просто повертає їх. У цьому випадку ви просто повинні припустити, що завантаження пройшло успішно.

source: Cleans up temporary files that may have been left behind by previous calls to :func:`urlretrieve`.
pt_br: Очищає тимчасові файли, які могли бути залишені попередніми викликами :func:`urlretrieve`.

source: Base class for opening and reading URLs. Unless you need to support opening objects using schemes other than :file:`http:`, :file:`ftp:`, or :file:`file:`, you probably want to use :class:`FancyURLopener`.
pt_br: Базовий клас для відкриття та читання URL-адрес. Якщо вам не потрібно підтримувати відкриття об’єктів за допомогою схем, відмінних від :file:`http:`, :file:`ftp:`або :file:`file:`, можливо, ви захочете використовувати :class:`FancyURLopener`.

source: By default, the :class:`URLopener` class sends a :mailheader:`User-Agent` header of ``urllib/VVV``, where *VVV* is the :mod:`urllib` version number. Applications can define their own :mailheader:`User-Agent` header by subclassing :class:`URLopener` or :class:`FancyURLopener` and setting the class attribute :attr:`version` to an appropriate string value in the subclass definition.
pt_br: За замовчуванням клас :class:`URLopener` надсилає заголовок :mailheader:`User-Agent` ``urllib/VVV``, де *VVV* — це номер версії :mod:`urllib`. Програми можуть визначати власний заголовок :mailheader:`User-Agent`, створивши підклас :class:`URLopener` або :class:`FancyURLopener` і встановивши атрибуту класу :attr:`version` відповідне значення рядка у визначенні підкласу.

source: The optional *proxies* parameter should be a dictionary mapping scheme names to proxy URLs, where an empty dictionary turns proxies off completely. Its default value is ``None``, in which case environmental proxy settings will be used if present, as discussed in the definition of :func:`urlopen`, above.
pt_br: Необов’язковий параметр *proxies* має бути словником, що зіставляє імена схем із URL-адресами проксі, де порожній словник повністю вимикає проксі. Його значенням за замовчуванням є ``None``, у цьому випадку будуть використані параметри середовища проксі, якщо вони присутні, як обговорювалося у визначенні :func:`urlopen` вище.

source: Additional keyword parameters, collected in *x509*, may be used for authentication of the client when using the :file:`https:` scheme. The keywords *key_file* and *cert_file* are supported to provide an SSL key and certificate; both are needed to support client authentication.
pt_br: Додаткові параметри ключових слів, зібрані в *x509*, можуть використовуватися для автентифікації клієнта під час використання схеми :file:`https:`. Ключові слова *key_file* і *cert_file* підтримуються для надання ключа SSL і сертифіката; обидва потрібні для підтримки автентифікації клієнта.
