Repository: python/python-docs-pt-br
Catalog: library/urllib.request.po
Languages: pt_br

source: Cause requests to go through a proxy. If *proxies* is given, it must be a dictionary mapping protocol names to URLs of proxies. The default is to read the list of proxies from the environment variables ``<protocol>_proxy``. If no proxy environment variables are set, then in a Windows environment proxy settings are obtained from the registry's Internet Settings section, and in a macOS environment proxy information is retrieved from the System Configuration Framework.
pt_br: Змусити запити проходити через проксі. Якщо вказано *проксі*, це має бути словник, який зіставляє назви протоколів з URL-адресами проксі. За замовчуванням список проксі-серверів читається зі змінних середовища ``<protocol> _proxy``. Якщо не встановлено жодних змінних середовища проксі, у середовищі Windows параметри проксі-сервера отримуються з розділу параметрів Інтернету реєстру, а в середовищі macOS інформація проксі-сервера отримується з System Configuration Framework.

source: To disable autodetected proxy pass an empty dictionary.
pt_br: Щоб вимкнути автоматичне визначення проксі, передайте порожній словник.

source: The :envvar:`no_proxy` environment variable can be used to specify hosts which shouldn't be reached via proxy; if set, it should be a comma-separated list of hostname suffixes, optionally with ``:port`` appended, for example ``cern.ch,ncsa.uiuc.edu,some.host:8080``.
pt_br: Змінну середовища :envvar:`no_proxy` можна використовувати для визначення хостів, до яких не можна звертатися через проксі; якщо встановлено, це має бути розділений комами список суфіксів імен хостів, необов’язково з додаванням ``:port``, наприклад ``cern.ch,ncsa.uiuc.edu,some.host:8080``.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
pt_br: ``HTTP_PROXY`` será ignorado se uma variável ``REQUEST_METHOD`` estiver definida; veja a documentação em :func:`~urllib.request.getproxies`.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings.
pt_br: Зберігайте базу даних відповідностей ``(сфера, uri) -> (користувач, пароль)``.

source: Keep a database of ``(realm, uri) -> (user, password)`` mappings. A realm of ``None`` is considered a catch-all realm, which is searched if no other realm fits.
pt_br: Зберігайте базу даних відповідностей ``(сфера, uri) -> (користувач, пароль)``. Сфера ``None`` вважається всеохоплюючою областю, у якій виконується пошук, якщо жодна інша область не підходить.

source: A variant of :class:`HTTPPasswordMgrWithDefaultRealm` that also has a database of ``uri -> is_authenticated`` mappings. Can be used by a BasicAuth handler to determine when to send authentication credentials immediately instead of waiting for a ``401`` response first.
pt_br: Варіант :class:`HTTPPasswordMgrWithDefaultRealm`, який також має базу даних зіставлень ``uri -> is_authenticated``. Може використовуватися обробником BasicAuth, щоб визначити, коли надсилати облікові дані для автентифікації негайно замість очікування відповіді ``401``.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. If *passwd_mgr* also provides ``is_authenticated`` and ``update_authenticated`` methods (see :ref:`http-password-mgr-with-prior-auth`), then the handler will use the ``is_authenticated`` result for a given URI to determine whether or not to send authentication credentials with the request. If ``is_authenticated`` returns ``True`` for the URI, credentials are sent. If ``is_authenticated`` is ``False``, credentials are not sent, and then if a ``401`` response is received the request is re-sent with the authentication credentials. If authentication succeeds, ``update_authenticated`` is called to set ``is_authenticated`` ``True`` for the URI, so that subsequent requests to the URI or any of its super-URIs will automatically include the authentication credentials.
pt_br: Це клас mixin, який допомагає з автентифікацією HTTP як на віддаленому хості, так і на проксі. *password_mgr*, якщо надано, має бути чимось сумісним із :class:`HTTPPasswordMgr`; зверніться до розділу :ref:`http-password-mgr` для отримання інформації про інтерфейс, який має підтримуватися. Якщо *passwd_mgr* також надає методи ``is_authenticated`` і ``update_authenticated`` (див. :ref:`http-password-mgr-with-prior-auth`), тоді обробник використовуватиме результат ``is_authenticated`` для заданого URI, щоб визначити, чи надсилати облікові дані автентифікації разом із запитом. Якщо ``is_authenticated`` повертає ``True`` для URI, облікові дані надсилаються. Якщо ``is_authenticated`` має значення ``False``, облікові дані не надсилаються, а потім, якщо отримано відповідь ``401``, запит повторно надсилається з обліковими даними автентифікації. Якщо автентифікація проходить успішно, ``update_authenticated`` викликається, щоб встановити ``is_authenticated`` ``True`` для URI, щоб наступні запити до URI або будь-якого з його супер-URI автоматично включали облікові дані автентифікації.

source: Added ``is_authenticated`` support.
pt_br: Додано підтримку ``is_authenticated``.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. HTTPBasicAuthHandler will raise a :exc:`ValueError` when presented with a wrong Authentication scheme.
pt_br: Керувати автентифікацією на віддаленому хості. *password_mgr*, якщо його вказано, має бути сумісним із :class:`HTTPPasswordMgr`; зверніться до розділу :ref:`http-password-mgr` для отримання інформації про інтерфейс, який має підтримуватися. HTTPBasicAuthHandler викличе помилку :exc:`ValueError`, якщо надано неправильну схему автентифікації.

source: Handle authentication with the proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
pt_br: Керувати автентифікацією за допомогою проксі. *password_mgr*, якщо його вказано, має бути сумісним із :class:`HTTPPasswordMgr`; зверніться до розділу :ref:`http-password-mgr` для отримання інформації про інтерфейс, який має підтримуватися.

source: This is a mixin class that helps with HTTP authentication, both to the remote host and to a proxy. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported.
pt_br: Це клас mixin, який допомагає з автентифікацією HTTP як на віддаленому хості, так і на проксі. *password_mgr*, якщо його вказано, має бути сумісним із :class:`HTTPPasswordMgr`; зверніться до розділу :ref:`http-password-mgr` для отримання інформації про інтерфейс, який має підтримуватися.

source: Handle authentication with the remote host. *password_mgr*, if given, should be something that is compatible with :class:`HTTPPasswordMgr`; refer to section :ref:`http-password-mgr` for information on the interface that must be supported. When both Digest Authentication Handler and Basic Authentication Handler are both added, Digest Authentication is always tried first. If the Digest Authentication returns a 40x response again, it is sent to Basic Authentication handler to Handle. This Handler method will raise a :exc:`ValueError` when presented with an authentication scheme other than Digest or Basic.
pt_br: Керувати автентифікацією на віддаленому хості. *password_mgr*, якщо його вказано, має бути сумісним із :class:`HTTPPasswordMgr`; зверніться до розділу :ref:`http-password-mgr` для отримання інформації про інтерфейс, який має підтримуватися. Якщо додано як обробник дайджест-автентифікації, так і обробник базової автентифікації, дайджест-автентифікація завжди виконується першою. Якщо дайджест автентифікації знову повертає відповідь 40x, він надсилається обробнику базової автентифікації для обробки. Цей метод обробника викличе :exc:`ValueError`, коли представлено схему автентифікації, відмінну від Digest або Basic.

source: Raise :exc:`ValueError` on unsupported Authentication Scheme.
pt_br: Викликати :exc:`ValueError` на непідтримуваній схемі автентифікації.

source: A class to handle opening of HTTP URLs.
pt_br: Клас для обробки відкриття URL-адрес HTTP.

source: A class to handle opening of HTTPS URLs. *context* and *check_hostname* have the same meaning as in :class:`http.client.HTTPSConnection`.
pt_br: Клас для обробки URL-адрес HTTPS. *context* і *check_hostname* мають те саме значення, що й у :class:`http.client.HTTPSConnection`.

source: *context* and *check_hostname* were added.
pt_br: *context* і *check_hostname* були додані.

source: Open local files.
pt_br: Abre arquivos locais.

source: Open data URLs.
pt_br: Abre dados das URLs.

source: Open FTP URLs.
pt_br: Abre URLs de FTP.

source: Open FTP URLs, keeping a cache of open FTP connections to minimize delays.
pt_br: Відкриті URL-адреси FTP, зберігаючи кеш відкритих з’єднань FTP, щоб мінімізувати затримки.

source: A catch-all class to handle unknown URLs.
pt_br: Універсальний клас для обробки невідомих URL-адрес.

source: Process HTTP error responses.
pt_br: Обробляти відповіді на помилки HTTP.

source: Request Objects
pt_br: Objeto Request

source: The following methods describe :class:`Request`'s public interface, and so all may be overridden in subclasses. It also defines several public attributes that can be used by clients to inspect the parsed request.
pt_br: Наступні методи описують публічний інтерфейс :class:`Request`, тому всі вони можуть бути перевизначені в підкласах. Він також визначає кілька публічних атрибутів, які можуть використовуватися клієнтами для перевірки аналізованого запиту.

source: The original URL passed to the constructor.
pt_br: Вихідна URL-адреса передається конструктору.

source: Request.full_url is a property with setter, getter and a deleter. Getting :attr:`~Request.full_url` returns the original request URL with the fragment, if it was present.
pt_br: Request.full_url — це властивість із установником, отримувачем і видаленням. Отримання :attr:`~Request.full_url` повертає початкову URL-адресу запиту з фрагментом, якщо він був присутній.

source: The URI scheme.
pt_br: Схема URI.

source: The URI authority, typically a host, but may also contain a port separated by a colon.
pt_br: Повноваження URI, як правило, хост, але також може містити порт, розділений двокрапкою.

source: The original host for the request, without port.
pt_br: Оригінальний хост для запиту, без порту.

source: The URI path. If the :class:`Request` uses a proxy, then selector will be the full URL that is passed to the proxy.
pt_br: Шлях URI. Якщо :class:`Request` використовує проксі, тоді селектором буде повна URL-адреса, яка передається проксі.

source: The entity body for the request, or ``None`` if not specified.
pt_br: Тіло сутності для запиту або ``None``, якщо не вказано.

source: Changing value of :attr:`Request.data` now deletes "Content-Length" header if it was previously set or calculated.
pt_br: Зміна значення :attr:`Request.data` тепер видаляє заголовок "Content-Length", якщо він був раніше встановлений або обчислений.

source: boolean, indicates whether the request is unverifiable as defined by :rfc:`2965`.
pt_br: логічне значення, вказує, чи запит не можна перевірити, як визначено :rfc:`2965`.

source: The HTTP request method to use. By default its value is :const:`None`, which means that :meth:`~Request.get_method` will do its normal computation of the method to be used. Its value can be set (thus overriding the default computation in :meth:`~Request.get_method`) either by providing a default value by setting it at the class level in a :class:`Request` subclass, or by passing a value in to the :class:`Request` constructor via the *method* argument.
pt_br: Метод запиту HTTP для використання. За замовчуванням його значення :const:`None`, що означає, що :meth:`~Request.get_method` виконає звичайне обчислення методу, який буде використано. Його значення можна встановити (таким чином замінюючи обчислення за замовчуванням у :meth:`~Request.get_method`) або шляхом надання значення за замовчуванням, установивши його на рівні класу в підкласі :class:`Request`, або передавши значення у конструктор :class:`Request` через аргумент *method*.

source: A default value can now be set in subclasses; previously it could only be set via the constructor argument.
pt_br: Значення за замовчуванням тепер можна встановити в підкласах; раніше його можна було встановити лише через аргумент конструктора.

source: Return a string indicating the HTTP request method. If :attr:`Request.method` is not ``None``, return its value, otherwise return ``'GET'`` if :attr:`Request.data` is ``None``, or ``'POST'`` if it's not. This is only meaningful for HTTP requests.
pt_br: Повертає рядок із зазначенням методу запиту HTTP. Якщо :attr:`Request.method` не є ``None``, поверніть його значення, інакше поверніть ``'GET'``, якщо :attr:`Request.data` має значення ``None`` або ``' POST''``, якщо це не так. Це має значення лише для запитів HTTP.

source: get_method now looks at the value of :attr:`Request.method`.
pt_br: get_method тепер переглядає значення :attr:`Request.method`.

source: Add another header to the request. Headers are currently ignored by all handlers except HTTP handlers, where they are added to the list of headers sent to the server. Note that there cannot be more than one header with the same name, and later calls will overwrite previous calls in case the *key* collides. Currently, this is no loss of HTTP functionality, since all headers which have meaning when used more than once have a (header-specific) way of gaining the same functionality using only one header. Note that headers added using this method are also added to redirected requests.
pt_br: Додайте інший заголовок до запиту. Наразі заголовки ігноруються всіма обробниками, крім обробників HTTP, де вони додаються до списку заголовків, надісланих на сервер. Зауважте, що не може бути більше одного заголовка з однаковим іменем, і пізніші виклики перезапишуть попередні виклики, якщо *ключ* зіткнеться. Наразі це не втрачає функціональність HTTP, оскільки всі заголовки, які мають значення при повторному використанні, мають (специфічний для заголовка) спосіб отримати ту саму функціональність, використовуючи лише один заголовок. Зауважте, що заголовки, додані за допомогою цього методу, також додаються до перенаправлених запитів.

source: Add a header that will not be added to a redirected request.
pt_br: Додайте заголовок, який не буде додано до переспрямованого запиту.

source: Return whether the instance has the named header (checks both regular and unredirected).
pt_br: Повертає, чи має екземпляр названий заголовок (перевіряє як звичайний, так і неперенаправлений).

source: Remove named header from the request instance (both from regular and unredirected headers).
pt_br: Remove o cabeçalho nomeado da instância de solicitação (tanto de cabeçalhos regulares como de cabeçalhos não-redirecionados).

source: Return the URL given in the constructor.
pt_br: Повертає URL-адресу, указану в конструкторі.

source: Returns :attr:`Request.full_url`
pt_br: Повертає :attr:`Request.full_url`

source: Prepare the request by connecting to a proxy server. The *host* and *type* will replace those of the instance, and the instance's selector will be the original URL given in the constructor.
pt_br: Підготуйте запит, підключившись до проксі-сервера. *host* і *type* замінять параметри екземпляра, а селектор екземпляра буде оригінальною URL-адресою, заданою в конструкторі.

source: Return the value of the given header. If the header is not present, return the default value.
pt_br: Повертає значення заданого заголовка. Якщо заголовок відсутній, поверніть значення за замовчуванням.

source: Return a list of tuples (header_name, header_value) of the Request headers.
pt_br: Повертає список кортежів (header_name, header_value) заголовків запиту.

source: The request methods add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host and is_unverifiable that were deprecated since 3.3 have been removed.
pt_br: Методи запиту add_data, has_data, get_data, get_type, get_host, get_selector, get_origin_req_host і is_unverifiable, які були застарілими з 3.3, були видалені.

source: OpenerDirector Objects
pt_br: Об’єкти OpenerDirector

source: :class:`OpenerDirector` instances have the following methods:
pt_br: Екземпляри :class:`OpenerDirector` мають такі методи:

source: *handler* should be an instance of :class:`BaseHandler`. The following methods are searched, and added to the possible chains (note that HTTP errors are a special case). Note that, in the following, *protocol* should be replaced with the actual protocol to handle, for example :meth:`http_response` would be the HTTP protocol response handler. Also *type* should be replaced with the actual HTTP code, for example :meth:`http_error_404` would handle HTTP 404 errors.
pt_br: *handler* має бути екземпляром :class:`BaseHandler`. Наступні методи шукаються та додаються до можливих ланцюжків (зверніть увагу, що помилки HTTP є окремим випадком). Зауважте, що далі *протокол* слід замінити на фактичний протокол для обробки, наприклад, :meth:`http_response` буде обробником відповіді протоколу HTTP. Також *type* слід замінити фактичним кодом HTTP, наприклад, :meth:`http_error_404` оброблятиме помилки HTTP 404.

source: See |protocol_open|_ for more information.
pt_br: Veja |protocol_open|_ para maiores informações.

source: See |http_error_nnn|_ for more information.
pt_br: Veja |http_error_nnn|_ para maiores informações.

source: See |protocol_request|_ for more information.
pt_br: Veja |protocol_request|_ para maiores informações.

source: See |protocol_response|_ for more information.
pt_br: Veja |protocol_response|_ para maiores informações.

source: Open the given *url* (which can be a request object or a string), optionally passing the given *data*. Arguments, return values and exceptions raised are the same as those of :func:`urlopen` (which simply calls the :meth:`open` method on the currently installed global :class:`OpenerDirector`). The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). The timeout feature actually works only for HTTP, HTTPS and FTP connections.
pt_br: Відкрийте вказаний *url* (який може бути об’єктом запиту або рядком), необов’язково передаючи вказані *дані*. Аргументи, значення, що повертаються, і викликані винятки такі самі, як у :func:`urlopen` (який просто викликає метод :meth:`open` у поточному встановленому глобальному :class:`OpenerDirector`). Необов’язковий параметр *timeout* визначає час очікування в секундах для блокування таких операцій, як спроба підключення (якщо не вказано, буде використано глобальне налаштування часу очікування за умовчанням). Функція тайм-ауту фактично працює лише для з’єднань HTTP, HTTPS і FTP.

source: Return values and exceptions raised are the same as those of :func:`urlopen`.
pt_br: Повернуті значення та викликані винятки такі самі, як і для :func:`urlopen`.

source: OpenerDirector objects open URLs in three stages:
pt_br: Об’єкти OpenerDirector відкривають URL-адреси в три етапи:

source: The order in which these methods are called within each stage is determined by sorting the handler instances.
pt_br: Порядок, у якому ці методи викликаються на кожному етапі, визначається сортуванням екземплярів обробника.

source: Note that the implementation of these methods may involve calls of the parent :class:`OpenerDirector` instance's :meth:`~OpenerDirector.open` and :meth:`~OpenerDirector.error` methods.
pt_br: Зауважте, що реалізація цих методів може передбачати виклики методів :meth:`~OpenerDirector.open` і :meth:`~OpenerDirector.error` примірника батьківського :class:`OpenerDirector`.

source: BaseHandler Objects
pt_br: Об’єкти BaseHandler

source: :class:`BaseHandler` objects provide a couple of methods that are directly useful, and others that are meant to be used by derived classes. These are intended for direct use:
pt_br: Об’єкти :class:`BaseHandler` надають кілька методів, які є безпосередньо корисними, а також інші, які призначені для використання похідними класами. Вони призначені для безпосереднього використання:

source: Add a director as parent.
pt_br: Додати директора як батька.

source: Remove any parents.
pt_br: Видаліть усіх батьків.

source: The following attribute and methods should only be used by classes derived from :class:`BaseHandler`.
pt_br: Наступний атрибут і методи мають використовуватися лише класами, похідними від :class:`BaseHandler`.

source: A valid :class:`OpenerDirector`, which can be used to open using a different protocol, or handle errors.
pt_br: Дійсний :class:`OpenerDirector`, який можна використовувати для відкриття за допомогою іншого протоколу або обробки помилок.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs.
pt_br: Цей метод *не* визначено в :class:`BaseHandler`, але підкласи повинні визначити його, якщо вони хочуть перехоплювати всі URL-адреси.

source: This method will be called before any protocol-specific open method.
pt_br: Цей метод буде викликано перед будь-яким відкритим методом протоколу.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to handle URLs with the given protocol.
pt_br: Цей метод *не* визначено в :class:`BaseHandler`, але підкласи повинні визначити його, якщо вони хочуть обробляти URL-адреси за допомогою заданого протоколу.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should define it if they want to catch all URLs with no specific registered handler to open it.
pt_br: Цей метод *не* визначено в :class:`BaseHandler`, але підкласи повинні визначити його, якщо вони хочуть перехопити всі URL-адреси без спеціального зареєстрованого обробника для його відкриття.

source: This method, if implemented, will be called by the :attr:`parent` :class:`OpenerDirector`. Return values should be the same as for :meth:`default_open`.
pt_br: Цей метод, якщо він реалізований, буде викликаний :attr:`parent` :class:`OpenerDirector`. Повернуті значення мають бути такими ж, як і для :meth:`default_open`.

source: This method is *not* defined in :class:`BaseHandler`, but subclasses should override it if they intend to provide a catch-all for otherwise unhandled HTTP errors. It will be called automatically by the :class:`OpenerDirector` getting the error, and should not normally be called in other circumstances.
pt_br: Цей метод *не* визначено в :class:`BaseHandler`, але підкласи повинні перевизначати його, якщо вони мають намір надати збірку для всіх необроблених помилок HTTP. Він автоматично викликається :class:`OpenerDirector`, який отримує помилку, і зазвичай не повинен викликатися за інших обставин.

source: *req* will be a :class:`Request` object, *fp* will be a file-like object with the HTTP error body, *code* will be the three-digit code of the error, *msg* will be the user-visible explanation of the code and *hdrs* will be a mapping object with the headers of the error.
pt_br: *req* буде об’єктом :class:`Request`, *fp* буде файлоподібним об’єктом із тілом помилки HTTP, *code* буде тризначним кодом помилки, *msg* буде видиме для користувача пояснення коду та *hdrs* буде об’єктом відображення із заголовками помилки.
