Repository: python/python-docs-pt-br
Catalog: library/uu.po
Languages: pt_br

source: :mod:`uu` --- Encode and decode uuencode files
pt_br: :mod:`uu` --- Codifica e decodifica arquivos uuencode

source: **Source code:** :source:`Lib/uu.py`
pt_br: **Código-fonte:** :source:`Lib/uu.py`

source: The :mod:`uu` module is deprecated (see :pep:`PEP 594 <594#uu-and-the-uu-encoding>` for details). :mod:`base64` is a modern alternative.
pt_br: O módulo :mod:`uu` foi descontinuado (veja :pep:`PEP 594 <594#uu-and-the-uu-encoding>` para detalhes e alternativas). :mod:`base64` é uma alternativa moderna.

source: This module encodes and decodes files in uuencode format, allowing arbitrary binary data to be transferred over ASCII-only connections. Wherever a file argument is expected, the methods accept a file-like object. For backwards compatibility, a string containing a pathname is also accepted, and the corresponding file will be opened for reading and writing; the pathname ``'-'`` is understood to mean the standard input or output. However, this interface is deprecated; it's better for the caller to open the file itself, and be sure that, when required, the mode is ``'rb'`` or ``'wb'`` on Windows.
pt_br: Este módulo codifica e decodifica arquivos no formato uuencode, permitindo que dados binários arbitrários sejam transferidos por conexões somente ASCII. Sempre que um argumento de arquivo é esperado, os métodos aceitam um objeto arquivo ou similar. Para compatibilidade com versões anteriores, uma string contendo um nome de caminho também é aceita, e o arquivo correspondente será aberto para leitura e gravação; o nome do caminho ``'-'`` é entendido como a entrada ou saída padrão. No entanto, essa interface foi descontinuada; é melhor para o chamador abrir o próprio arquivo e ter certeza de que, quando necessário, o modo é ``'rb'`` ou ``'wb'`` no Windows.

source: This code was contributed by Lance Ellinghouse, and modified by Jack Jansen.
pt_br: Este código foi contribuído por Lance Ellinghouse e modificado por Jack Jansen.

source: The :mod:`uu` module defines the following functions:
pt_br: O módulo :mod:`uu` define as seguintes funções:

source: Uuencode file *in_file* into file *out_file*. The uuencoded file will have the header specifying *name* and *mode* as the defaults for the results of decoding the file. The default defaults are taken from *in_file*, or ``'-'`` and ``0o666`` respectively. If *backtick* is true, zeros are represented by ``'`'`` instead of spaces.
pt_br: Arquivo uuencode *in_file* no arquivo *out_file*. O arquivo uuencoded terá o cabeçalho especificando *name* e *mode* como os padrões para os resultados da decodificação do arquivo. Os padrões padrão são obtidos de *in_file*, ou ``'-'`` e ``0o666`` respectivamente. Se *backtick* for verdadeiro, zeros são representados por ``'`'`` ao invés de espaços.

source: Added the *backtick* parameter.
pt_br: Adicionado o parâmetro *backtick*.

source: This call decodes uuencoded file *in_file* placing the result on file *out_file*. If *out_file* is a pathname, *mode* is used to set the permission bits if the file must be created. Defaults for *out_file* and *mode* are taken from the uuencode header. However, if the file specified in the header already exists, a :exc:`uu.Error` is raised.
pt_br: Esta chamada decodifica o arquivo uuencoded *in_file* colocando o resultado no arquivo *out_file*. Se *out_file* for um nome de caminho, *mode* será usado para definir os bits de permissão se o arquivo precisar ser criado. Os padrões para *out_file* e *mode* são retirados do cabeçalho uuencode. Porém, se o arquivo especificado no cabeçalho já existir, uma :exc:`uu.Error` é levantada.

source: :func:`decode` may print a warning to standard error if the input was produced by an incorrect uuencoder and Python could recover from that error. Setting *quiet* to a true value silences this warning.
pt_br: :func:`decode` pode imprimir um aviso de erro padrão se a entrada foi produzida por um uuencoder incorreto e o Python pôde se recuperar desse erro. Definir *quiet* com um valor verdadeiro silencia este aviso.

source: Subclass of :exc:`Exception`, this can be raised by :func:`uu.decode` under various situations, such as described above, but also including a badly formatted header, or truncated input file.
pt_br: Subclasse de :exc:`Exception`, isso pode ser levantada por :func:`uu.decode` em várias situações, como descrito acima, mas também incluindo um cabeçalho mal formatado ou arquivo de entrada truncado.

source: Module :mod:`binascii`
pt_br: Módulo :mod:`binascii`

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
pt_br: Módulo de suporte contendo conversões ASCII para binário e binário para ASCII.
