Repository: python/python-docs-pt-br
Catalog: library/weakref.po
Languages: pt_br

source: :mod:`weakref` --- Weak references
pt_br: :mod:`weakref` --- Referências fracas

source: **Source code:** :source:`Lib/weakref.py`
pt_br: **Código-fonte:** :source:`Lib/weakref.py`

source: The :mod:`weakref` module allows the Python programmer to create :dfn:`weak references` to objects.
pt_br: O módulo :mod:`weakref` permite ao programador Python criar :dfn:`referências fracas` para objetos.

source: In the following, the term :dfn:`referent` means the object which is referred to by a weak reference.
pt_br: A seguir, o termo :dfn:`referente` significa o objeto ao qual é referido por uma referência fraca.

source: A weak reference to an object is not enough to keep the object alive: when the only remaining references to a referent are weak references, :term:`garbage collection` is free to destroy the referent and reuse its memory for something else. However, until the object is actually destroyed the weak reference may return the object even if there are no strong references to it.
pt_br: Uma referência fraca a um objeto não é suficiente para mantê-lo vivo: quando as únicas referências restantes a um referente são referências fracas, a :term:`coleta de lixo` está livre para destruir o referente e reutilizar sua memória para outra coisa. Entretanto, até que o objeto seja realmente destruído, a referência fraca poderá retornar o objeto mesmo que não haja referências fortes a ele.

source: A primary use for weak references is to implement caches or mappings holding large objects, where it's desired that a large object not be kept alive solely because it appears in a cache or mapping.
pt_br: Um uso principal para referências fracas é implementar caches ou mapeamentos contendo objetos grandes, onde é desejado que um objeto grande não seja mantido ativo apenas porque aparece em um cache ou mapeamento.

source: For example, if you have a number of large binary image objects, you may wish to associate a name with each. If you used a Python dictionary to map names to images, or images to names, the image objects would remain alive just because they appeared as values or keys in the dictionaries. The :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` classes supplied by the :mod:`weakref` module are an alternative, using weak references to construct mappings that don't keep objects alive solely because they appear in the mapping objects. If, for example, an image object is a value in a :class:`WeakValueDictionary`, then when the last remaining references to that image object are the weak references held by weak mappings, garbage collection can reclaim the object, and its corresponding entries in weak mappings are simply deleted.
pt_br: Por exemplo, se você tiver vários objetos de imagem binária grandes, poderá associar um nome a cada um. Se você usasse um dicionário Python para mapear nomes para imagens, ou imagens para nomes, os objetos de imagem permaneceriam vivos apenas porque apareceriam como valores ou chaves nos dicionários. As classes :class:`WeakKeyDictionary` e :class:`WeakValueDictionary` fornecidas pelo módulo :mod:`weakref` são uma alternativa, usando referências fracas para construir mapeamentos que não mantêm objetos vivos apenas porque aparecem nos objetos de mapeamento. Se, por exemplo, um objeto de imagem for um valor em um :class:`WeakValueDictionary`, então quando as últimas referências restantes a esse objeto de imagem forem as referências fracas mantidas por mapeamentos fracos, a coleta de lixo poderá recuperar o objeto e suas entradas correspondentes em mapeamentos fracos são simplesmente excluídos.

source: :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` use weak references in their implementation, setting up callback functions on the weak references that notify the weak dictionaries when a key or value has been reclaimed by garbage collection. :class:`WeakSet` implements the :class:`set` interface, but keeps weak references to its elements, just like a :class:`WeakKeyDictionary` does.
pt_br: :class:`WeakKeyDictionary` e :class:`WeakValueDictionary` usam referências fracas em sua implementação, configurando funções de retorno de chamada nas referências fracas que notificam os dicionários fracos quando uma chave ou valor foi recuperado pela coleta de lixo. :class:`WeakSet` implementa a interface :class:`set`, mas mantém referências fracas aos seus elementos, assim como :class:`WeakKeyDictionary` faz.

source: :class:`finalize` provides a straight forward way to register a cleanup function to be called when an object is garbage collected. This is simpler to use than setting up a callback function on a raw weak reference, since the module automatically ensures that the finalizer remains alive until the object is collected.
pt_br: :class:`finalize` fornece uma maneira direta de registrar uma função de limpeza a ser chamada quando um objeto é coletado como lixo. Isso é mais simples de usar do que configurar uma função de retorno de chamada em uma referência fraca não tratada, pois o módulo garante automaticamente que o finalizador permaneça ativo até que o objeto seja coletado.

source: Most programs should find that using one of these weak container types or :class:`finalize` is all they need -- it's not usually necessary to create your own weak references directly. The low-level machinery is exposed by the :mod:`weakref` module for the benefit of advanced uses.
pt_br: A maioria dos programas deve descobrir que usar um desses tipos de contêineres fracos ou :class:`finalize` é tudo que eles precisam -- geralmente não é necessário criar suas próprias referências fracas diretamente. O maquinário de baixo nível é exposto pelo módulo :mod:`weakref` para benefício de usos avançados.

source: Not all objects can be weakly referenced. Objects which support weak references include class instances, functions written in Python (but not in C), instance methods, sets, frozensets, some :term:`file objects <file object>`, :term:`generators <generator>`, type objects, sockets, arrays, deques, regular expression pattern objects, and code objects.
pt_br: Nem todos os objetos podem ser referenciados de maneira fraca. Objetos que oferecem suporte a referências fracas incluem instâncias de classe, funções escritas em Python (mas não em C), métodos de instância, conjuntos, frozensets, alguns :term:`objetos arquivos <objeto arquivo>`, :term:`geradores <gerador>`, objetos tipo, sockets, arrays, deques, objetos padrão de expressão regular e objetos código.

source: Added support for thread.lock, threading.Lock, and code objects.
pt_br: Adicionado suporte para thread.lock, threading.Lock e objetos código.

source: Several built-in types such as :class:`list` and :class:`dict` do not directly support weak references but can add support through subclassing::
pt_br: Vários tipos embutidos como :class:`list` e :class:`dict` não oferecem suporta diretamente a referências fracas, mas podem adicionar suporte através de subclasses::

source: Other built-in types such as :class:`tuple` and :class:`int` do not support weak references even when subclassed.
pt_br: Outros tipos embutidos como :class:`tuple` e :class:`int` não oferecem suporte a referências fracas mesmo em subclasses.

source: Extension types can easily be made to support weak references; see :ref:`weakref-support`.
pt_br: Os tipos de extensão podem ser facilmente criados para oferecer suporte a referências fracas; veja :ref:`weakref-support`.

source: When ``__slots__`` are defined for a given type, weak reference support is disabled unless a ``'__weakref__'`` string is also present in the sequence of strings in the ``__slots__`` declaration. See :ref:`__slots__ documentation <slots>` for details.
pt_br: Quando ``__slots__`` são definidos para um determinado tipo, o suporte a referência fraca é desativado a menos que uma string ``'__weakref__'`` também esteja presente na sequência de strings na declaração de ``__slots__``. Veja a :ref:`documentação de __slots__ <slots>` para detalhes.

source: Return a weak reference to *object*. The original object can be retrieved by calling the reference object if the referent is still alive; if the referent is no longer alive, calling the reference object will cause :const:`None` to be returned. If *callback* is provided and not :const:`None`, and the returned weakref object is still alive, the callback will be called when the object is about to be finalized; the weak reference object will be passed as the only parameter to the callback; the referent will no longer be available.
pt_br: Retorna uma referência fraca para *object*. O objeto original pode ser recuperado chamando o objeto referência se o referente ainda estiver ativo; se o referente não estiver mais ativo, chamar o objeto referência fará com que :const:`None` seja retornado. Se *callback* for fornecido e não for :const:`None`, e o objeto referência fraca retornado ainda estiver ativo, o função de retorno será chamada quando o objeto estiver prestes a ser finalizado; o objeto referência fraca será passado como único parâmetro para a função de retorno; o referente não estará mais disponível.

source: It is allowable for many weak references to be constructed for the same object. Callbacks registered for each weak reference will be called from the most recently registered callback to the oldest registered callback.
pt_br: É permitido que muitas referências fracas sejam construídas para o mesmo objeto. As funções de retorno registradas para cada referência fraca serão chamadas da função de retorno registrada mais recentemente para a função de retorno registrada mais antiga.

source: Exceptions raised by the callback will be noted on the standard error output, but cannot be propagated; they are handled in exactly the same way as exceptions raised from an object's :meth:`~object.__del__` method.
pt_br: As exceções levantadas pela função de retorno serão anotadas na saída de erro padrão, mas não poderão ser propagadas; elas são tratadas exatamente da mesma maneira que as exceções levantadas pelo método :meth:`~object.__del__` de um objeto.

source: Weak references are :term:`hashable` if the *object* is hashable. They will maintain their hash value even after the *object* was deleted. If :func:`hash` is called the first time only after the *object* was deleted, the call will raise :exc:`TypeError`.
pt_br: Referências fracas são :term:`hasheáveis <hasheável>` se o *object* for hasheável. Elas manterão seu valor de hash mesmo depois que *object* for excluído. Se :func:`hash` for chamada pela primeira vez somente após o *object* ter sido excluído, a chamada vai levantar :exc:`TypeError`.

source: Weak references support tests for equality, but not ordering. If the referents are still alive, two references have the same equality relationship as their referents (regardless of the *callback*). If either referent has been deleted, the references are equal only if the reference objects are the same object.
pt_br: Referências fracas oferecem suporte a testes de igualdade, mas não de ordenação. Se os referentes ainda estiverem vivos, duas referências terão a mesma relação de igualdade que seus referentes (independentemente do *callback*). Se um dos referentes tiver sido excluído, as referências serão iguais somente se os objetos referência forem o mesmo objeto.

source: This is a subclassable type rather than a factory function.
pt_br: Este é um tipo do qual pode ser feita subclasse em vez de uma função de fábrica.

source: This read-only attribute returns the callback currently associated to the weakref. If there is no callback or if the referent of the weakref is no longer alive then this attribute will have value ``None``.
pt_br: Este atributo somente leitura retorna a função de retorno atualmente associada à referência fraca. Se não houver função de retorno ou se o referente da referência fraca não estiver mais ativo, então este atributo terá o valor ``None``.

source: Added the :attr:`__callback__` attribute.
pt_br: Adicionado o atributo :attr:`__callback__`.

source: Return a proxy to *object* which uses a weak reference. This supports use of the proxy in most contexts instead of requiring the explicit dereferencing used with weak reference objects. The returned object will have a type of either ``ProxyType`` or ``CallableProxyType``, depending on whether *object* is callable. Proxy objects are not :term:`hashable` regardless of the referent; this avoids a number of problems related to their fundamentally mutable nature, and prevents their use as dictionary keys. *callback* is the same as the parameter of the same name to the :func:`ref` function.
pt_br: Retorna um intermediário (proxy, em inglês) para *object* que usa uma referência fraca. Isto provê suporte ao uso do intermediário na maioria dos contextos, em vez de exigir a desreferenciação explícita usada com objetos de referência fraca. O objeto retornado terá um tipo ``ProxyType`` ou ``CallableProxyType``, dependendo se *object* é chamável. Objetos intermediários não são :term:`hasheáveis <hasheável>` independentemente do referente; isso evita uma série de problemas relacionados à sua natureza fundamentalmente mutável e impede seu uso como chaves de dicionário. *callback* é igual ao parâmetro de mesmo nome da função :func:`ref`.

source: Accessing an attribute of the proxy object after the referent is garbage collected raises :exc:`ReferenceError`.
pt_br: Acessar um atributo do objeto intermediário depois que o referente é coletado como lixo levanta :exc:`ReferenceError`.

source: Extended the operator support on proxy objects to include the matrix multiplication operators ``@`` and ``@=``.
pt_br: Estendeu o suporte ao operador em objetos intermediários para incluir os operadores ``@`` e ``@=`` para multiplicação de matrizes.

source: Return the number of weak references and proxies which refer to *object*.
pt_br: Retorna o número de referências fracas e intermediários que fazem referência a *object*.

source: Return a list of all weak reference and proxy objects which refer to *object*.
pt_br: Retorna uma lista de todos os objetos intermediários e de referência fraca que fazem referência a *object*.

source: Mapping class that references keys weakly. Entries in the dictionary will be discarded when there is no longer a strong reference to the key. This can be used to associate additional data with an object owned by other parts of an application without adding attributes to those objects. This can be especially useful with objects that override attribute accesses.
pt_br: Classe de mapeamento que faz referência fraca a chaves. Entradas no dicionário serão descartadas quando não houver mais uma referência forte à chave. Isso pode ser usado para associar dados adicionais a um objeto de propriedade de outras partes de uma aplicação sem adicionar atributos a esses objetos. Isso pode ser especialmente útil com objetos que substituem acessos de atributos.

source: Note that when a key with equal value to an existing key (but not equal identity) is inserted into the dictionary, it replaces the value but does not replace the existing key. Due to this, when the reference to the original key is deleted, it also deletes the entry in the dictionary::
pt_br: Note que quando uma chave com valor igual a uma chave existente (mas não identidade igual) é inserida no dicionário, ela substitui o valor, mas não substitui a chave existente. Devido a isso, quando a referência à chave original é excluída, ela também exclui a entrada no dicionário::

source: A workaround would be to remove the key prior to reassignment::
pt_br: Uma solução alternativa seria remover a chave antes da reatribuição::

source: Added support for ``|`` and ``|=`` operators, specified in :pep:`584`.
pt_br: Adicionado suporte para os operadores ``|`` e ``|=``, especificados na :pep:`584`.

source: :class:`WeakKeyDictionary` objects have an additional method that exposes the internal references directly. The references are not guaranteed to be "live" at the time they are used, so the result of calling the references needs to be checked before being used. This can be used to avoid creating references that will cause the garbage collector to keep the keys around longer than needed.
pt_br: Objetos :class:`WeakKeyDictionary` têm um método adicional que expõe as referências internas diretamente. Não há garantia de que as referências estejam "ativas" no momento em que são usadas, então o resultado da chamada das referências precisa ser verificado antes de ser usado. Isso pode ser usado para evitar a criação de referências que farão com que o coletor de lixo mantenha as chaves por mais tempo do que o necessário.

source: Return an iterable of the weak references to the keys.
pt_br: Retorna um iterável das referências fracas às chaves.

source: Mapping class that references values weakly. Entries in the dictionary will be discarded when no strong reference to the value exists any more.
pt_br: Classe de mapeamento que faz referência fraca a valores. Entradas no dicionário serão descartadas quando nenhuma referência forte ao valor existir mais.

source: Added support for ``|`` and ``|=`` operators, as specified in :pep:`584`.
pt_br: Adicionado suporte para operadores ``|`` e ``|=``, conforme especificado na :pep:`584`.

source: :class:`WeakValueDictionary` objects have an additional method that has the same issues as the :meth:`WeakKeyDictionary.keyrefs` method.
pt_br: Os objetos :class:`WeakValueDictionary` têm um método adicional que apresenta os mesmos problemas que o método :meth:`WeakKeyDictionary.keyrefs`.

source: Return an iterable of the weak references to the values.
pt_br: Retorna um iterável das referências fracas aos valores.

source: Set class that keeps weak references to its elements. An element will be discarded when no strong reference to it exists any more.
pt_br: Define a classe que mantém referências fracas para seus elementos. Um elemento será descartado quando nenhuma referência forte a ele existir mais.

source: A custom :class:`ref` subclass which simulates a weak reference to a bound method (i.e., a method defined on a class and looked up on an instance). Since a bound method is ephemeral, a standard weak reference cannot keep hold of it. :class:`WeakMethod` has special code to recreate the bound method until either the object or the original function dies::
pt_br: Uma subclasse personalizada de :class:`ref` que simula uma referência fraca a um método vinculado (ou seja, um método definido em uma classe e pesquisado em uma instância). Como um método vinculado é efêmero, uma referência fraca padrão não pode mantê-lo. :class:`WeakMethod` tem um código especial para recriar o método vinculado até que o objeto ou a função original morra::

source: *callback* is the same as the parameter of the same name to the :func:`ref` function.
pt_br: *callback* é o mesmo que o parâmetro de mesmo nome da função :func:`ref`.

source: Return a callable finalizer object which will be called when *obj* is garbage collected. Unlike an ordinary weak reference, a finalizer will always survive until the reference object is collected, greatly simplifying lifecycle management.
pt_br: Retorna um objeto finalizador chamável que será chamado quando *obj* for coletado como lixo. Diferentemente de uma referência fraca comum, um finalizador sempre sobreviverá até que o objeto referência seja coletado, simplificando muito o gerenciamento do ciclo de vida.

source: A finalizer is considered *alive* until it is called (either explicitly or at garbage collection), and after that it is *dead*. Calling a live finalizer returns the result of evaluating ``func(*arg, **kwargs)``, whereas calling a dead finalizer returns :const:`None`.
pt_br: Um finalizador é considerado *alive* (vivo) até ser chamado (explicitamente ou na coleta de lixo), e depois disso ele é *dead* (morto). Chamar um finalizador vivo retorna o resultado da avaliação de ``func(*arg, **kwargs)``, enquanto chamar um finalizador morto retorna :const:`None`.

source: Exceptions raised by finalizer callbacks during garbage collection will be shown on the standard error output, but cannot be propagated. They are handled in the same way as exceptions raised from an object's :meth:`~object.__del__` method or a weak reference's callback.
pt_br: Exceções levantadas por funções de retorno do finalizador durante a coleta de lixo serão mostradas na saída de erro padrão, mas não podem ser propagadas. Elas são tratadas da mesma forma que exceções levantadas de um método :meth:`~object.__del__` de um objeto ou de uma função de retorno da referência fraca.

source: When the program exits, each remaining live finalizer is called unless its :attr:`atexit` attribute has been set to false. They are called in reverse order of creation.
pt_br: Quando o programa é encerrado, cada finalizador vivo restante é chamado, a menos que seu atributo :attr:`atexit` tenha sido definido como falso. Eles são chamados na ordem reversa da criação.

source: A finalizer will never invoke its callback during the later part of the :term:`interpreter shutdown` when module globals are liable to have been replaced by :const:`None`.
pt_br: Um finalizador nunca vai invocar sua função de retorno durante a parte posterior do :term:`desligamento do interpretador` quando os globais do módulo podem ter sido substituídos por :const:`None`.

source: If *self* is alive then mark it as dead and return the result of calling ``func(*args, **kwargs)``. If *self* is dead then return :const:`None`.
pt_br: Se *self* estiver vivo, marca-o como morto e retorna o resultado da chamada ``func(*args, **kwargs)``. Se *self* estiver morto, retorna :const:`None`.

source: If *self* is alive then mark it as dead and return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
pt_br: Se *self* estiver vivo, marca-o como morto e retorna a tupla ``(obj, func, args, kwargs)``. Se *self* estiver morto, retorna :const:`None`.

source: If *self* is alive then return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
pt_br: Se *self* estiver vivo, retorna a tupla ``(obj, func, args, kwargs)``. Se *self* estiver morto, retorna :const:`None`.

source: Property which is true if the finalizer is alive, false otherwise.
pt_br: Propriedade que é verdadeiro se o finalizador estiver ativo, falsa caso contrário.

source: A writable boolean property which by default is true. When the program exits, it calls all remaining live finalizers for which :attr:`.atexit` is true. They are called in reverse order of creation.
pt_br: Uma propriedade booleana gravável que por padrão é verdadeiro. Quando o programa sai, ele chama todos os finalizadores vivos restantes para os quais :attr:`.atexit` é verdadeiro. Eles são chamados na ordem reversa da criação.

source: It is important to ensure that *func*, *args* and *kwargs* do not own any references to *obj*, either directly or indirectly, since otherwise *obj* will never be garbage collected. In particular, *func* should not be a bound method of *obj*.
pt_br: É importante garantir que *func*, *args* e *kwargs* não possuam nenhuma referência a *obj*, direta ou indiretamente, pois, caso contrário, *obj* nunca será coletado como lixo. Em particular, *func* não deve ser um método vinculado de *obj*.

source: The type object for weak references objects.
pt_br: O objeto tipo para objetos referências fracas.

source: The type object for proxies of objects which are not callable.
pt_br: O tipo de objeto para intermediários de objetos que não são chamáveis.

source: The type object for proxies of callable objects.
pt_br: O objeto de tipo para intermediários de objetos chamáveis.
