Repository: python/python-docs-pt-br
Catalog: library/weakref.po
Languages: pt_br

source: Sequence containing all the type objects for proxies. This can make it simpler to test if an object is a proxy without being dependent on naming both proxy types.
pt_br: Sequência contendo todos os objetos de tipo para intermediários. Isso pode tornar mais simples testar se um objeto é um intermediário sem depender da nomeação de ambos os tipos de intermediário.

source: The proposal and rationale for this feature, including links to earlier implementations and information about similar features in other languages.
pt_br: A proposta e a justificativa para esse recurso, incluindo links para implementações anteriores e informações sobre recursos semelhantes em outras linguagens.

source: Weak Reference Objects
pt_br: Objetos referência fraca

source: Weak reference objects have no methods and no attributes besides :attr:`ref.__callback__`. A weak reference object allows the referent to be obtained, if it still exists, by calling it:
pt_br: Objetos referência fraca não têm métodos nem atributos além de :attr:`ref.__callback__`. Um objeto referência fraca permite que o referente seja obtido, se ele ainda existir, chamando-o:

source: If the referent no longer exists, calling the reference object returns :const:`None`:
pt_br: Se o referente não existir mais, chamar o objeto referência retornará :const:`None`:

source: Testing that a weak reference object is still live should be done using the expression ``ref() is not None``. Normally, application code that needs to use a reference object should follow this pattern::
pt_br: O teste de se um objeto referência fraca ainda está vivo deve ser feito usando a expressão ``ref() is not None``. Normalmente, o código da aplicação que precisa usar um objeto de referência deve seguir este padrão::

source: Using a separate test for "liveness" creates race conditions in threaded applications; another thread can cause a weak reference to become invalidated before the weak reference is called; the idiom shown above is safe in threaded applications as well as single-threaded applications.
pt_br: Usar um teste separado para "vivacidade" cria condições de corrida em aplicações que usam mais de uma thread; uma outra thread pode fazer com que uma referência fraca seja invalidada antes que a referência fraca seja chamada; o idioma mostrado acima é seguro em aplicações que usam mais de uma thread, bem como em aplicações de thread única.

source: Specialized versions of :class:`ref` objects can be created through subclassing. This is used in the implementation of the :class:`WeakValueDictionary` to reduce the memory overhead for each entry in the mapping. This may be most useful to associate additional information with a reference, but could also be used to insert additional processing on calls to retrieve the referent.
pt_br: Versões especializadas de objetos :class:`ref` podem ser criadas por meio de subclasse. Isso é usado na implementação do :class:`WeakValueDictionary` para reduzir a sobrecarga de memória para cada entrada no mapeamento. Isso pode ser mais útil para associar informações adicionais a uma referência, mas também pode ser usado para inserir processamento adicional em chamadas para recuperar o referente.

source: This example shows how a subclass of :class:`ref` can be used to store additional information about an object and affect the value that's returned when the referent is accessed::
pt_br: Este exemplo mostra como uma subclasse de :class:`ref` pode ser usada para armazenar informações adicionais sobre um objeto e afetar o valor retornado quando o referente é acessado::

source: Example
pt_br: Exemplo

source: This simple example shows how an application can use object IDs to retrieve objects that it has seen before. The IDs of the objects can then be used in other data structures without forcing the objects to remain alive, but the objects can still be retrieved by ID if they do.
pt_br: Este exemplo simples mostra como uma aplicação pode usar IDs de objeto para recuperar objetos que ele viu antes. Os IDs dos objetos podem então ser usados ​​em outras estruturas de dados sem forçar os objetos a permanecerem vivos, mas os objetos ainda podem ser recuperados por ID se o fizerem.

source: Finalizer Objects
pt_br: Objetos finalizadores

source: The main benefit of using :class:`finalize` is that it makes it simple to register a callback without needing to preserve the returned finalizer object. For instance
pt_br: O principal benefício de usar :class:`finalize` é que ele simplifica o registro de um retorno de chamada sem precisar preservar o objeto finalizador retornado. Por exemplo

source: The finalizer can be called directly as well. However the finalizer will invoke the callback at most once.
pt_br: O finalizador pode ser chamado diretamente também. No entanto, o finalizador vai invocar a função de retorno no máximo uma vez.

source: You can unregister a finalizer using its :meth:`~finalize.detach` method. This kills the finalizer and returns the arguments passed to the constructor when it was created.
pt_br: Você pode desfazer o registro de um finalizador usando seu método :meth:`~finalize.detach`. Isso elimina o finalizador e retorna os argumentos passados ​​ao construtor quando ele foi criado.

source: Unless you set the :attr:`~finalize.atexit` attribute to :const:`False`, a finalizer will be called when the program exits if it is still alive. For instance
pt_br: A menos que você defina o atributo :attr:`~finalize.atexit` como :const:`False`, um finalizador será chamado quando o programa sair se ele ainda estiver vivo. Por exemplo

source: Comparing finalizers with :meth:`~object.__del__` methods
pt_br: Comparando finalizadores com métodos :meth:`~object.__del__`

source: Suppose we want to create a class whose instances represent temporary directories. The directories should be deleted with their contents when the first of the following events occurs:
pt_br: Suponha que queremos criar uma classe cujas instâncias representam diretórios temporários. Os diretórios devem ser excluídos com seus conteúdos quando o primeiro dos seguintes eventos ocorrer:

source: the object is garbage collected,
pt_br: o objeto é um lixo coletado,

source: the object's :meth:`!remove` method is called, or
pt_br: o método :meth:`!remove` do objeto é chamado, ou

source: the program exits.
pt_br: o programa finaliza.

source: We might try to implement the class using a :meth:`~object.__del__` method as follows::
pt_br: Podemos tentar implementar a classe usando um método :meth:`~object.__del__` da seguinte maneira::

source: Starting with Python 3.4, :meth:`~object.__del__` methods no longer prevent reference cycles from being garbage collected, and module globals are no longer forced to :const:`None` during :term:`interpreter shutdown`. So this code should work without any issues on CPython.
pt_br: A partir do Python 3.4, os métodos :meth:`~object.__del__` não impedem mais que os ciclos de referência sejam coletados como lixo, e os módulos globais não são mais forçados a :const:`None` durante :term:`desligamento do interpretador`. Então, esse código deve funcionar sem problemas no CPython.

source: However, handling of :meth:`~object.__del__` methods is notoriously implementation specific, since it depends on internal details of the interpreter's garbage collector implementation.
pt_br: Entretanto, o tratamento dos métodos :meth:`~object.__del__` é notoriamente específico da implementação, pois depende de detalhes internos da implementação do coletor de lixo do interpretador.

source: A more robust alternative can be to define a finalizer which only references the specific functions and objects that it needs, rather than having access to the full state of the object::
pt_br: Uma alternativa mais robusta pode ser definir um finalizador que faça referência apenas às funções e objetos específicos de que necessita, em vez de ter acesso ao estado completo do objeto::

source: Defined like this, our finalizer only receives a reference to the details it needs to clean up the directory appropriately. If the object never gets garbage collected the finalizer will still be called at exit.
pt_br: Definido assim, nosso finalizador recebe apenas uma referência aos detalhes que ele precisa para limpar o diretório apropriadamente. Se o objeto nunca for coletado como lixo, o finalizador ainda será chamado na saída.

source: The other advantage of weakref based finalizers is that they can be used to register finalizers for classes where the definition is controlled by a third party, such as running code when a module is unloaded::
pt_br: A outra vantagem dos finalizadores baseados em referências fracas é que eles podem ser usados ​​para registrar finalizadores para classes onde a definição é controlada por terceiros, como executar código quando um módulo é descarregado::

source: If you create a finalizer object in a daemonic thread just as the program exits then there is the possibility that the finalizer does not get called at exit. However, in a daemonic thread :func:`atexit.register`, ``try: ... finally: ...`` and ``with: ...`` do not guarantee that cleanup occurs either.
pt_br: Se você criar um objeto finalizador em uma thread em um daemon assim que o programa sair, então há a possibilidade de que o finalizador não seja chamado na saída. No entanto, em um thread em um daemon :func:`atexit.register`, ``try: ... finally: ...`` e ``with: ...`` não garantem que a limpeza ocorra também.
