Repository: python/python-docs-pt-br
Catalog: library/winsound.po
Languages: pt_br

source: :mod:`!winsound` --- Sound-playing interface for Windows
pt_br: :mod:`!winsound` --- Interface de reprodução de som para o Windows

source: The :mod:`winsound` module provides access to the basic sound-playing machinery provided by Windows platforms. It includes functions and several constants.
pt_br: O módulo :mod:`winsound` fornece acesso ao mecanismo básico de reprodução de som fornecido pelas plataformas Windows. Inclui funções e várias constantes.

source: Beep the PC's speaker. The *frequency* parameter specifies frequency, in hertz, of the sound, and must be in the range 37 through 32,767. The *duration* parameter specifies the number of milliseconds the sound should last. If the system is not able to beep the speaker, :exc:`RuntimeError` is raised.
pt_br: Emite um bipe no alto-falante do PC. O parâmetro *frequency* especifica a frequência, em hertz, do som e deve estar no intervalo de 37 a 32.767. O parâmetro *duration* especifica o número de milissegundos que o som deve durar. Se o sistema não conseguir emitir um bipe no alto-falante, :exc:`RuntimeError` é levantado.

source: Call the underlying :c:func:`!PlaySound` function from the Platform API. The *sound* parameter may be a filename, a system sound alias, audio data as a :term:`bytes-like object`, or ``None``. Its interpretation depends on the value of *flags*, which can be a bitwise ORed combination of the constants described below. If the *sound* parameter is ``None``, any currently playing waveform sound is stopped. If the system indicates an error, :exc:`RuntimeError` is raised.
pt_br: Chama a função subjacente :c:func:`!PlaySound` da API da plataforma. O parâmetro *sound* pode ser um nome de arquivo, um apelido de som do sistema, dados de áudio como um :term:`objeto bytes ou similar` ou ``None``. Sua interpretação depende do valor de *flags*, que pode ser uma combinação OU bit a bit das constantes descritas abaixo. Se o parâmetro *sound* for ``None``, qualquer som de forma de onda em execução no momento será interrompido. Se o sistema indicar um erro, :exc:`RuntimeError` será levantada.

source: Call the underlying :c:func:`!MessageBeep` function from the Platform API. This plays a sound as specified in the registry. The *type* argument specifies which sound to play; possible values are ``-1``, ``MB_ICONASTERISK``, ``MB_ICONEXCLAMATION``, ``MB_ICONHAND``, ``MB_ICONQUESTION``, and ``MB_OK``, all described below. The value ``-1`` produces a "simple beep"; this is the final fallback if a sound cannot be played otherwise. If the system indicates an error, :exc:`RuntimeError` is raised.
pt_br: Chama a função subjacente :c:func:`!MessageBeep` da API da plataforma. Isso reproduz um som conforme especificado no registro. O argumento *type* especifica qual som reproduzir; os valores possíveis são ``-1``, ``MB_ICONASTERISK``, ``MB_ICONEXCLAMATION``, ``MB_ICONHAND``, ``MB_ICONQUESTION`` e ``MB_OK``, todos descritos abaixo. O valor ``-1`` produz um "bipe simples"; este é o fallback final se um som não puder ser reproduzido de outra forma. Se o sistema indicar um erro, :exc:`RuntimeError` será levantada.

source: The *sound* parameter is the name of a WAV file. Do not use with :const:`SND_ALIAS`.
pt_br: O parâmetro *sound* é o nome de um arquivo WAV. Não use com :const:`SND_ALIAS`.

source: The *sound* parameter is a sound association name from the registry. If the registry contains no such name, play the system default sound unless :const:`SND_NODEFAULT` is also specified. If no default sound is registered, raise :exc:`RuntimeError`. Do not use with :const:`SND_FILENAME`.
pt_br: O parâmetro *sound* é um nome de associação de som do registro. Se o registro não contiver tal nome, reproduza o som padrão do sistema, a menos que :const:`SND_NODEFAULT` também seja especificado. Se nenhum som padrão for registrado, levanta :exc:`RuntimeError`. Não use com :const:`SND_FILENAME`.

source: All Win32 systems support at least the following; most systems support many more:
pt_br: Todos os sistemas Win32 oferecem suporte a pelo menos o seguinte; a maioria dos sistemas oferecem suporte a muito mais:

source: :func:`PlaySound` *name*
pt_br: *name* :func:`PlaySound`

source: Corresponding Control Panel Sound name
pt_br: Nome do som correspondente no Painel de Controle

source: Asterisk
pt_br: Asterisco

source: Exclamation
pt_br: Exclamação

source: Exit Windows
pt_br: Logoff do Windows

source: Critical Stop
pt_br: Parada crítica

source: Question
pt_br: Pergunta

source: For example::
pt_br: Por exemplo::

source: import winsound # Play Windows exit sound. winsound.PlaySound("SystemExit", winsound.SND_ALIAS) # Probably play Windows default sound, if any is registered (because # "*" probably isn't the registered name of any sound). winsound.PlaySound("*", winsound.SND_ALIAS)
pt_br: import winsound # Reproduz o som de logoff do Windows. winsound.PlaySound("SystemExit", winsound.SND_ALIAS) # Provavelmente reproduz o som padrão do Windows, se algum # estiver registrado (porque "*" provavelmente não é o nome registrado # de algum som). winsound.PlaySound("*", winsound.SND_ALIAS)

source: Play the sound repeatedly. The :const:`SND_ASYNC` flag must also be used to avoid blocking. Cannot be used with :const:`SND_MEMORY`.
pt_br: Reproduz o som repetidamente. O sinalizador :const:`SND_ASYNC` também deve ser usado para evitar bloqueio. Não pode ser usado com :const:`SND_MEMORY`.

source: The *sound* parameter to :func:`PlaySound` is a memory image of a WAV file, as a :term:`bytes-like object`.
pt_br: O parâmetro *sound* para :func:`PlaySound` é uma imagem de memória de um arquivo WAV, como um :term:`objeto bytes ou similar`.

source: This module does not support playing from a memory image asynchronously, so a combination of this flag and :const:`SND_ASYNC` will raise :exc:`RuntimeError`.
pt_br: Este módulo não oferece suporte à reprodução de uma imagem de memória de forma assíncrona, portanto, uma combinação deste sinalizador e :const:`SND_ASYNC` levantará :exc:`RuntimeError`.

source: Stop playing all instances of the specified sound.
pt_br: Para de reproduzir todas as instâncias do som especificado.

source: This flag is not supported on modern Windows platforms.
pt_br: Não há suporte a este sinalizador em plataformas Windows modernas.

source: Return immediately, allowing sounds to play asynchronously.
pt_br: Retorna imediatamente, permitindo que os sons sejam reproduzidos de forma assíncrona.

source: If the specified sound cannot be found, do not play the system default sound.
pt_br: Se o som especificado não for encontrado, o som padrão do sistema não será reproduzido.

source: Do not interrupt sounds currently playing.
pt_br: Não interrompe os sons que estão sendo reproduzidos.

source: Return immediately if the sound driver is busy.
pt_br: Retorna imediatamente se o driver de som estiver ocupado.

source: The *sound* parameter is an application-specific alias in the registry. This flag can be combined with the :const:`SND_ALIAS` flag to specify an application-defined sound alias.
pt_br: O parâmetro *sound* é um apelido específico da aplicação no registro. Este sinalizador pode ser combinado com o sinalizador :const:`SND_ALIAS` para especificar um apelido de som definido pela aplicação.

source: Triggers a SoundSentry event when the sound is played.
pt_br: Aciona um evento SoundSentry quando o som é reproduzido.

source: The sound is played synchronously. This is the default behavior.
pt_br: O som é reproduzido de forma sincronizada. Este é o comportamento padrão.

source: Assign the sound to the audio session for system notification sounds.
pt_br: Atribui o som à sessão de áudio para sons de notificação do sistema.

source: Play the ``SystemDefault`` sound.
pt_br: Reproduz o som ``SystemDefault``.

source: Play the ``SystemExclamation`` sound.
pt_br: Reproduz o som ``SystemExclamation``.

source: Play the ``SystemHand`` sound.
pt_br: Reproduz o som ``SystemHand``.

source: Play the ``SystemQuestion`` sound.
pt_br: Reproduz o som ``SystemQuestion``.
