Repository: python/python-docs-pt-br
Catalog: library/xdrlib.po
Languages: pt_br

source: :mod:`xdrlib` --- Encode and decode XDR data
pt_br: :mod:`xdrlib` --- Кодування та декодування даних XDR

source: **Source code:** :source:`Lib/xdrlib.py`
pt_br: **Вихідний код:** :source:`Lib/xdrlib.py`

source: The :mod:`xdrlib` module is deprecated (see :pep:`PEP 594 <594#xdrlib>` for details).
pt_br: Модуль :mod:`xdrlib` є застарілим (докладніше див. :pep:`PEP 594 <594#xdrlib>`).

source: The :mod:`xdrlib` module supports the External Data Representation Standard as described in :rfc:`1014`, written by Sun Microsystems, Inc. June 1987. It supports most of the data types described in the RFC.
pt_br: Модуль :mod:`xdrlib` підтримує стандарт представлення зовнішніх даних, як описано в :rfc:`1014`, написаному Sun Microsystems, Inc. червень 1987 року. Він підтримує більшість типів даних, описаних у RFC.

source: The :mod:`xdrlib` module defines two classes, one for packing variables into XDR representation, and another for unpacking from XDR representation. There are also two exception classes.
pt_br: Модуль :mod:`xdrlib` визначає два класи: один для пакування змінних у представлення XDR, а інший для розпакування з представлення XDR. Є також два класи винятків.

source: :class:`Packer` is the class for packing data into XDR representation. The :class:`Packer` class is instantiated with no arguments.
pt_br: :class:`Packer` — це клас для упаковки даних у представлення XDR. Клас :class:`Packer` створюється без аргументів.

source: ``Unpacker`` is the complementary class which unpacks XDR data values from a string buffer. The input buffer is given as *data*.
pt_br: ``Unpacker`` — це додатковий клас, який розпаковує значення даних XDR із рядкового буфера. Вхідний буфер надається як *дані*.

source: :rfc:`1014` - XDR: External Data Representation Standard
pt_br: :rfc:`1014` - XDR: стандарт подання зовнішніх даних

source: This RFC defined the encoding of data which was XDR at the time this module was originally written. It has apparently been obsoleted by :rfc:`1832`.
pt_br: Цей RFC визначив кодування даних, яке було XDR на момент початкового написання цього модуля. Очевидно, він був застарілий :rfc:`1832`.

source: :rfc:`1832` - XDR: External Data Representation Standard
pt_br: :rfc:`1832` - XDR: стандарт подання зовнішніх даних

source: Newer RFC that provides a revised definition of XDR.
pt_br: Новіший RFC, який містить переглянуте визначення XDR.

source: Packer Objects
pt_br: Пакувальник об'єктів

source: :class:`Packer` instances have the following methods:
pt_br: Екземпляри :class:`Packer` мають такі методи:

source: Returns the current pack buffer as a string.
pt_br: Повертає поточний буфер пакета як рядок.

source: Resets the pack buffer to the empty string.
pt_br: Скидає буфер пакета до порожнього рядка.

source: In general, you can pack any of the most common XDR data types by calling the appropriate ``pack_type()`` method. Each method takes a single argument, the value to pack. The following simple data type packing methods are supported: :meth:`pack_uint`, :meth:`pack_int`, :meth:`pack_enum`, :meth:`pack_bool`, :meth:`pack_uhyper`, and :meth:`pack_hyper`.
pt_br: Загалом, ви можете запакувати будь-який із найпоширеніших типів даних XDR, викликавши відповідний метод ``pack_type()``. Кожен метод приймає один аргумент, значення для упаковки. Підтримуються такі прості методи пакування типів даних: :meth:`pack_uint`, :meth:`pack_int`, :meth:`pack_enum`, :meth:`pack_bool`, :meth:`pack_uhyper` і :meth:`pack_hyper`.

source: Packs the single-precision floating point number *value*.
pt_br: Пакує *значення* числа з плаваючою комою одинарної точності.

source: Packs the double-precision floating point number *value*.
pt_br: Пакує *значення* числа з плаваючою комою подвійної точності.

source: The following methods support packing strings, bytes, and opaque data:
pt_br: Наступні методи підтримують упаковку рядків, байтів і непрозорих даних:

source: Packs a fixed length string, *s*. *n* is the length of the string but it is *not* packed into the data buffer. The string is padded with null bytes if necessary to guaranteed 4 byte alignment.
pt_br: Пакує рядок фіксованої довжини, *s*. *n* — це довжина рядка, але він *не* упаковується в буфер даних. Рядок доповнюється нульовими байтами, якщо це необхідно для гарантованого вирівнювання 4 байтів.

source: Packs a fixed length opaque data stream, similarly to :meth:`pack_fstring`.
pt_br: Пакує непрозорий потік даних фіксованої довжини, подібно до :meth:`pack_fstring`.

source: Packs a variable length string, *s*. The length of the string is first packed as an unsigned integer, then the string data is packed with :meth:`pack_fstring`.
pt_br: Пакує рядок змінної довжини, *s*. Довжина рядка спочатку упаковується як ціле число без знаку, потім дані рядка упаковуються за допомогою :meth:`pack_fstring`.

source: Packs a variable length opaque data string, similarly to :meth:`pack_string`.
pt_br: Пакує непрозорий рядок даних змінної довжини, подібно до :meth:`pack_string`.

source: Packs a variable length byte stream, similarly to :meth:`pack_string`.
pt_br: Пакує потік байтів змінної довжини, подібно до :meth:`pack_string`.

source: The following methods support packing arrays and lists:
pt_br: Наступні методи підтримують пакування масивів і списків:

source: Packs a *list* of homogeneous items. This method is useful for lists with an indeterminate size; i.e. the size is not available until the entire list has been walked. For each item in the list, an unsigned integer ``1`` is packed first, followed by the data value from the list. *pack_item* is the function that is called to pack the individual item. At the end of the list, an unsigned integer ``0`` is packed.
pt_br: Пакує *список* однорідних предметів. Цей метод корисний для списків із невизначеним розміром; тобто розмір недоступний, доки не буде пройдено весь список. Для кожного елемента списку першим упаковується ціле число без знаку ``1``, а потім значення даних зі списку. *pack_item* — це функція, яка викликається для упаковки окремого елемента. У кінці списку упаковується ціле число без знаку ``0``.

source: For example, to pack a list of integers, the code might appear like this::
pt_br: Наприклад, щоб упакувати список цілих чисел, код може виглядати так:

source: Packs a fixed length list (*array*) of homogeneous items. *n* is the length of the list; it is *not* packed into the buffer, but a :exc:`ValueError` exception is raised if ``len(array)`` is not equal to *n*. As above, *pack_item* is the function used to pack each element.
pt_br: Пакує список фіксованої довжини (*масив*) однорідних елементів. *n* — довжина списку; він *не* упаковується в буфер, але виникає виняток :exc:`ValueError`, якщо ``len(array)`` не дорівнює *n*. Як і вище, *pack_item* — це функція, яка використовується для упаковки кожного елемента.

source: Packs a variable length *list* of homogeneous items. First, the length of the list is packed as an unsigned integer, then each element is packed as in :meth:`pack_farray` above.
pt_br: Пакує *список* різної довжини однорідних елементів. Спочатку довжина списку упаковується як ціле число без знаку, потім кожен елемент упаковується, як у :meth:`pack_farray` вище.

source: Unpacker Objects
pt_br: Розпаковувач об'єктів

source: The :class:`Unpacker` class offers the following methods:
pt_br: Клас :class:`Unpacker` пропонує такі методи:

source: Resets the string buffer with the given *data*.
pt_br: Скидає рядковий буфер із заданими *даними*.

source: Returns the current unpack position in the data buffer.
pt_br: Повертає поточну позицію розпакування в буфері даних.

source: Sets the data buffer unpack position to *position*. You should be careful about using :meth:`get_position` and :meth:`set_position`.
pt_br: Встановлює для позиції розпакування буфера даних значення *position*. Ви повинні бути обережними з використанням :meth:`get_position` і :meth:`set_position`.

source: Returns the current unpack data buffer as a string.
pt_br: Повертає поточний буфер розпакування даних у вигляді рядка.

source: Indicates unpack completion. Raises an :exc:`Error` exception if all of the data has not been unpacked.
pt_br: Вказує на завершення розпакування. Викликає виняток :exc:`Error`, якщо всі дані не було розпаковано.

source: In addition, every data type that can be packed with a :class:`Packer`, can be unpacked with an :class:`Unpacker`. Unpacking methods are of the form ``unpack_type()``, and take no arguments. They return the unpacked object.
pt_br: Крім того, кожен тип даних, який можна запакувати за допомогою :class:`Packer`, можна розпакувати за допомогою :class:`Unpacker`. Методи розпакування мають форму ``unpack_type()`` і не приймають аргументів. Повертають нерозпакований предмет.

source: Unpacks a single-precision floating point number.
pt_br: Розпаковує число з плаваючою комою одинарної точності.

source: Unpacks a double-precision floating point number, similarly to :meth:`unpack_float`.
pt_br: Розпаковує число з плаваючою комою подвійної точності, подібно до :meth:`unpack_float`.

source: In addition, the following methods unpack strings, bytes, and opaque data:
pt_br: Крім того, такі методи розпаковують рядки, байти та непрозорі дані:

source: Unpacks and returns a fixed length string. *n* is the number of characters expected. Padding with null bytes to guaranteed 4 byte alignment is assumed.
pt_br: Розпаковує та повертає рядок фіксованої довжини. *n* — очікувана кількість символів. Передбачається доповнення нульовими байтами до гарантованого 4-байтового вирівнювання.

source: Unpacks and returns a fixed length opaque data stream, similarly to :meth:`unpack_fstring`.
pt_br: Розпаковує та повертає непрозорий потік даних фіксованої довжини, подібно до :meth:`unpack_fstring`.

source: Unpacks and returns a variable length string. The length of the string is first unpacked as an unsigned integer, then the string data is unpacked with :meth:`unpack_fstring`.
pt_br: Розпаковує та повертає рядок змінної довжини. Довжина рядка спочатку розпаковується як ціле число без знаку, а потім дані рядка розпаковуються за допомогою :meth:`unpack_fstring`.

source: Unpacks and returns a variable length opaque data string, similarly to :meth:`unpack_string`.
pt_br: Розпаковує та повертає непрозорий рядок даних змінної довжини, подібно до :meth:`unpack_string`.

source: Unpacks and returns a variable length byte stream, similarly to :meth:`unpack_string`.
pt_br: Розпаковує та повертає потік байтів змінної довжини, подібно до :meth:`unpack_string`.

source: The following methods support unpacking arrays and lists:
pt_br: Наступні методи підтримують розпакування масивів і списків:

source: Unpacks and returns a list of homogeneous items. The list is unpacked one element at a time by first unpacking an unsigned integer flag. If the flag is ``1``, then the item is unpacked and appended to the list. A flag of ``0`` indicates the end of the list. *unpack_item* is the function that is called to unpack the items.
pt_br: Розпаковує та повертає список однорідних предметів. Список розпаковується по одному елементу за раз, спочатку розпаковуючи прапор цілого числа без знаку. Якщо прапорець ``1``, тоді елемент розпаковується та додається до списку. Прапорець ``0`` вказує на кінець списку. *unpack_item* — це функція, яка викликається для розпакування елементів.

source: Unpacks and returns (as a list) a fixed length array of homogeneous items. *n* is number of list elements to expect in the buffer. As above, *unpack_item* is the function used to unpack each element.
pt_br: Розпаковує та повертає (у вигляді списку) масив однорідних елементів фіксованої довжини. *n* — кількість елементів списку, які очікуються в буфері. Як і вище, *unpack_item* — це функція, яка використовується для розпакування кожного елемента.

source: Unpacks and returns a variable length *list* of homogeneous items. First, the length of the list is unpacked as an unsigned integer, then each element is unpacked as in :meth:`unpack_farray` above.
pt_br: Розпаковує та повертає *список* різної довжини однорідних елементів. Спочатку довжина списку розпаковується як ціле число без знаку, потім розпаковується кожен елемент, як у :meth:`unpack_farray` вище.

source: Exceptions
pt_br: Exceções

source: Exceptions in this module are coded as class instances:
pt_br: Винятки в цьому модулі кодуються як екземпляри класу:

source: The base exception class. :exc:`Error` has a single public attribute :attr:`msg` containing the description of the error.
pt_br: Базовий клас винятків. :exc:`Error` має єдиний публічний атрибут :attr:`msg`, який містить опис помилки.

source: Class derived from :exc:`Error`. Contains no additional instance variables.
pt_br: Клас, похідний від :exc:`Error`. Не містить додаткових змінних екземпляра.

source: Here is an example of how you would catch one of these exceptions::
pt_br: Ось приклад того, як ви можете зловити один із цих винятків:
