Repository: python/python-docs-pt-br
Catalog: library/xml.dom.po
Languages: pt_br

source: :mod:`xml.dom` --- The Document Object Model API
pt_br: :mod:`xml.dom` --- API об’єктної моделі документа

source: **Source code:** :source:`Lib/xml/dom/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/xml/dom/__init__.py`

source: The Document Object Model, or "DOM," is a cross-language API from the World Wide Web Consortium (W3C) for accessing and modifying XML documents. A DOM implementation presents an XML document as a tree structure, or allows client code to build such a structure from scratch. It then gives access to the structure through a set of objects which provided well-known interfaces.
pt_br: Об’єктна модель документа, або "DOM", — це міжмовний API Консорціуму Всесвітньої павутини (W3C) для доступу та зміни документів XML. Реалізація DOM представляє XML-документ як структуру дерева або дозволяє коду клієнта створювати таку структуру з нуля. Потім він надає доступ до структури через набір об’єктів, які надають добре відомі інтерфейси.

source: The DOM is extremely useful for random-access applications. SAX only allows you a view of one bit of the document at a time. If you are looking at one SAX element, you have no access to another. If you are looking at a text node, you have no access to a containing element. When you write a SAX application, you need to keep track of your program's position in the document somewhere in your own code. SAX does not do it for you. Also, if you need to look ahead in the XML document, you are just out of luck.
pt_br: DOM надзвичайно корисний для додатків із довільним доступом. SAX дозволяє переглядати лише один біт документа за раз. Якщо ви дивитеся на один елемент SAX, у вас немає доступу до іншого. Якщо ви дивитесь на текстовий вузол, ви не маєте доступу до вмісту елемента. Коли ви пишете програму SAX, вам потрібно відстежувати позицію вашої програми в документі десь у вашому власному коді. SAX не робить це за вас. Крім того, якщо вам потрібно дивитися вперед у документі XML, вам просто не пощастило.

source: Some applications are simply impossible in an event driven model with no access to a tree. Of course you could build some sort of tree yourself in SAX events, but the DOM allows you to avoid writing that code. The DOM is a standard tree representation for XML data.
pt_br: Деякі програми просто неможливі в керованій подіями моделі без доступу до дерева. Звичайно, ви можете самостійно створити якесь дерево в подіях SAX, але DOM дозволяє вам уникнути написання цього коду. DOM — це стандартне представлення дерева для даних XML.

source: The Document Object Model is being defined by the W3C in stages, or "levels" in their terminology. The Python mapping of the API is substantially based on the DOM Level 2 recommendation.
pt_br: Об’єктна модель документа визначається W3C поетапно або "рівнями" за їхньою термінологією. Відображення Python API в основному базується на рекомендації DOM рівня 2.

source: DOM applications typically start by parsing some XML into a DOM. How this is accomplished is not covered at all by DOM Level 1, and Level 2 provides only limited improvements: There is a :class:`DOMImplementation` object class which provides access to :class:`Document` creation methods, but no way to access an XML reader/parser/Document builder in an implementation-independent way. There is also no well-defined way to access these methods without an existing :class:`Document` object. In Python, each DOM implementation will provide a function :func:`getDOMImplementation`. DOM Level 3 adds a Load/Store specification, which defines an interface to the reader, but this is not yet available in the Python standard library.
pt_br: Програми DOM зазвичай починаються з аналізу деякого XML у DOM. Як це досягається, взагалі не описано в DOM рівня 1, а рівень 2 передбачає лише обмежені покращення: існує клас об’єктів :class:`DOMImplementation`, який надає доступ до методів створення :class:`Document`, але не має можливості отримати доступ до зчитувача/аналізатора XML/конструктора документів у спосіб, незалежний від реалізації. Також немає чітко визначеного способу доступу до цих методів без наявного об’єкта :class:`Document`. У Python кожна реалізація DOM надаватиме функцію :func:`getDOMImplementation`. DOM Level 3 додає специфікацію Load/Store, яка визначає інтерфейс для читача, але це ще не доступно в стандартній бібліотеці Python.

source: Once you have a DOM document object, you can access the parts of your XML document through its properties and methods. These properties are defined in the DOM specification; this portion of the reference manual describes the interpretation of the specification in Python.
pt_br: Якщо у вас є об’єкт документа DOM, ви можете отримати доступ до частин свого документа XML через його властивості та методи. Ці властивості визначені в специфікації DOM; ця частина довідкового посібника описує інтерпретацію специфікації в Python.

source: The specification provided by the W3C defines the DOM API for Java, ECMAScript, and OMG IDL. The Python mapping defined here is based in large part on the IDL version of the specification, but strict compliance is not required (though implementations are free to support the strict mapping from IDL). See section :ref:`dom-conformance` for a detailed discussion of mapping requirements.
pt_br: Специфікація, надана W3C, визначає DOM API для Java, ECMAScript і OMG IDL. Визначене тут відображення Python значною мірою базується на версії специфікації IDL, але сувора відповідність не потрібна (хоча реалізації можуть вільно підтримувати суворе відображення з IDL). Перегляньте розділ :ref:`dom-conformance` для детального обговорення вимог до відображення.

source: `Document Object Model (DOM) Level 2 Specification <https://www.w3.org/TR/2000/REC-DOM-Level-2-Core-20001113/>`_
pt_br: `Специфікація рівня 2 об’єктної моделі документа (DOM) <https://www.w3.org/TR/2000/REC-DOM-Level-2-Core-20001113/>`_

source: The W3C recommendation upon which the Python DOM API is based.
pt_br: Рекомендація W3C, на якій базується API Python DOM.

source: `Document Object Model (DOM) Level 1 Specification <https://www.w3.org/TR/REC-DOM-Level-1/>`_
pt_br: `Специфікація рівня 1 об’єктної моделі документа (DOM) <https://www.w3.org/TR/REC-DOM-Level-1/>`_

source: The W3C recommendation for the DOM supported by :mod:`xml.dom.minidom`.
pt_br: Рекомендація W3C щодо DOM, що підтримується :mod:`xml.dom.minidom`.

source: `Python Language Mapping Specification <https://www.omg.org/spec/PYTH/1.2/PDF>`_
pt_br: `Специфікація відображення мови Python <https://www.omg.org/spec/PYTH/1.2/PDF>`_

source: This specifies the mapping from OMG IDL to Python.
pt_br: Це визначає відображення з OMG IDL на Python.

source: Module Contents
pt_br: Conteúdo do módulo

source: The :mod:`xml.dom` contains the following functions:
pt_br: :mod:`xml.dom` містить такі функції:

source: Register the *factory* function with the name *name*. The factory function should return an object which implements the :class:`DOMImplementation` interface. The factory function can return the same object every time, or a new one for each call, as appropriate for the specific implementation (e.g. if that implementation supports some customization).
pt_br: Зареєструйте функцію *factory* з іменем *name*. Фабрична функція має повертати об’єкт, який реалізує інтерфейс :class:`DOMImplementation`. Фабрична функція може щоразу повертати той самий об’єкт або новий для кожного виклику, залежно від конкретної реалізації (наприклад, якщо ця реалізація підтримує певні налаштування).

source: Return a suitable DOM implementation. The *name* is either well-known, the module name of a DOM implementation, or ``None``. If it is not ``None``, imports the corresponding module and returns a :class:`DOMImplementation` object if the import succeeds. If no name is given, and if the environment variable :envvar:`PYTHON_DOM` is set, this variable is used to find the implementation.
pt_br: Поверніть відповідну реалізацію DOM. *Ім’я* є або добре відомим, ім’ям модуля реалізації DOM, або ``None``. Якщо це не ``None``, імпортує відповідний модуль і повертає об’єкт :class:`DOMImplementation`, якщо імпорт вдасться. Якщо ім’я не вказано та встановлено змінну середовища :envvar:`PYTHON_DOM`, ця змінна використовується для пошуку реалізації.

source: If name is not given, this examines the available implementations to find one with the required feature set. If no implementation can be found, raise an :exc:`ImportError`. The features list must be a sequence of ``(feature, version)`` pairs which are passed to the :meth:`hasFeature` method on available :class:`DOMImplementation` objects.
pt_br: Якщо ім’я не вказано, перевіряються доступні реалізації, щоб знайти одну з потрібним набором функцій. Якщо впровадження не знайдено, викликайте :exc:`ImportError`. Список функцій має бути послідовністю пар ``(функція, версія)``, які передаються в метод :meth:`hasFeature` доступних об’єктів :class:`DOMImplementation`.

source: Some convenience constants are also provided:
pt_br: Також надано деякі зручні константи:

source: The value used to indicate that no namespace is associated with a node in the DOM. This is typically found as the :attr:`namespaceURI` of a node, or used as the *namespaceURI* parameter to a namespaces-specific method.
pt_br: Значення, яке вказує на те, що простір імен не пов’язано з вузлом у DOM. Зазвичай це можна знайти як :attr:`namespaceURI` вузла або використовувати як параметр *namespaceURI* для методу, специфічного для просторів імен.

source: The namespace URI associated with the reserved prefix ``xml``, as defined by `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ (section 4).
pt_br: URI простору імен, пов’язаний із зарезервованим префіксом ``xml``, як визначено `Просторами імен у XML <https://www.w3.org/TR/REC-xml-names/>`_ (розділ 4).

source: The namespace URI for namespace declarations, as defined by `Document Object Model (DOM) Level 2 Core Specification <https://www.w3.org/TR/DOM-Level-2-Core/core.html>`_ (section 1.1.8).
pt_br: URI простору імен для декларацій простору імен, як визначено `Основною специфікацією рівня 2 об’єктної моделі документа (DOM) <https://www.w3.org/TR/DOM-Level-2-Core/core.html>`_ (розділ 1.1.8).

source: The URI of the XHTML namespace as defined by `XHTML 1.0: The Extensible HyperText Markup Language <https://www.w3.org/TR/xhtml1/>`_ (section 3.1.1).
pt_br: URI простору імен XHTML, як визначено `XHTML 1.0: розширювана мова розмітки гіпертексту <https://www.w3.org/TR/xhtml1/>`_ (розділ 3.1.1).

source: In addition, :mod:`xml.dom` contains a base :class:`Node` class and the DOM exception classes. The :class:`Node` class provided by this module does not implement any of the methods or attributes defined by the DOM specification; concrete DOM implementations must provide those. The :class:`Node` class provided as part of this module does provide the constants used for the :attr:`nodeType` attribute on concrete :class:`Node` objects; they are located within the class rather than at the module level to conform with the DOM specifications.
pt_br: Крім того, :mod:`xml.dom` містить базовий клас :class:`Node` і класи винятків DOM. Клас :class:`Node`, наданий цим модулем, не реалізує жодних методів або атрибутів, визначених специфікацією DOM; конкретні реалізації DOM повинні забезпечувати їх. Клас :class:`Node`, наданий як частина цього модуля, надає константи, які використовуються для атрибута :attr:`nodeType` для конкретних об’єктів :class:`Node`; вони розташовані в межах класу, а не на рівні модуля, щоб відповідати специфікаціям DOM.

source: Objects in the DOM
pt_br: Об'єкти в DOM

source: The definitive documentation for the DOM is the DOM specification from the W3C.
pt_br: Основною документацією для DOM є специфікація DOM від W3C.

source: Note that DOM attributes may also be manipulated as nodes instead of as simple strings. It is fairly rare that you must do this, however, so this usage is not yet documented.
pt_br: Зауважте, що атрибути DOM також можна використовувати як вузли, а не як прості рядки. Однак це доводиться робити досить рідко, тому таке використання ще не задокументовано.

source: Section
pt_br: Seção

source: Purpose
pt_br: Propósito

source: Interface to the underlying implementation.
pt_br: Інтерфейс базової реалізації.

source: Base interface for most objects in a document.
pt_br: Базовий інтерфейс для більшості об’єктів у документі.

source: Interface for a sequence of nodes.
pt_br: Інтерфейс для послідовності вузлів.

source: Information about the declarations needed to process a document.
pt_br: Інформація про декларації, необхідні для оформлення документа.

source: Object which represents an entire document.
pt_br: Об'єкт, який представляє весь документ.

source: Element nodes in the document hierarchy.
pt_br: Вузли елементів в ієрархії документа.

source: Attribute value nodes on element nodes.
pt_br: Вузли значення атрибута на вузлах елемента.

source: Representation of comments in the source document.
pt_br: Відображення коментарів у вихідному документі.

source: Nodes containing textual content from the document.
pt_br: Вузли, що містять текстовий вміст із документа.

source: Processing instruction representation.
pt_br: Представлення інструкцій обробки.

source: An additional section describes the exceptions defined for working with the DOM in Python.
pt_br: Додатковий розділ описує винятки, визначені для роботи з DOM у Python.

source: DOMImplementation Objects
pt_br: Об’єкти реалізації DOMI

source: The :class:`DOMImplementation` interface provides a way for applications to determine the availability of particular features in the DOM they are using. DOM Level 2 added the ability to create new :class:`Document` and :class:`DocumentType` objects using the :class:`DOMImplementation` as well.
pt_br: Інтерфейс :class:`DOMImplementation` надає програмам спосіб визначити доступність певних функцій у DOM, який вони використовують. Рівень 2 DOM також додав можливість створювати нові об’єкти :class:`Document` і :class:`DocumentType` за допомогою :class:`DOMImplementation`.

source: Return ``True`` if the feature identified by the pair of strings *feature* and *version* is implemented.
pt_br: Повертає ``True``, якщо функцію, визначену парою рядків *feature* і *version*, реалізовано.

source: Return a new :class:`Document` object (the root of the DOM), with a child :class:`Element` object having the given *namespaceUri* and *qualifiedName*. The *doctype* must be a :class:`DocumentType` object created by :meth:`createDocumentType`, or ``None``. In the Python DOM API, the first two arguments can also be ``None`` in order to indicate that no :class:`Element` child is to be created.
pt_br: Повертає новий об’єкт :class:`Document` (корінь DOM) з дочірнім об’єктом :class:`Element`, який має вказані *namespaceUri* і *qualifiedName*. *doctype* має бути об’єктом :class:`DocumentType`, створеним :meth:`createDocumentType`, або ``None``. В Python DOM API перші два аргументи також можуть бути ``None``, щоб вказати, що дочірній елемент :class:`Element` не створюватиметься.

source: Return a new :class:`DocumentType` object that encapsulates the given *qualifiedName*, *publicId*, and *systemId* strings, representing the information contained in an XML document type declaration.
pt_br: Повертає новий об’єкт :class:`DocumentType`, який інкапсулює задані рядки *qualifiedName*, *publicId* і *systemId*, що представляють інформацію, що міститься в декларації типу документа XML.

source: Node Objects
pt_br: Objetos Node

source: All of the components of an XML document are subclasses of :class:`Node`.
pt_br: Усі компоненти документа XML є підкласами :class:`Node`.

source: An integer representing the node type. Symbolic constants for the types are on the :class:`Node` object: :const:`ELEMENT_NODE`, :const:`ATTRIBUTE_NODE`, :const:`TEXT_NODE`, :const:`CDATA_SECTION_NODE`, :const:`ENTITY_NODE`, :const:`PROCESSING_INSTRUCTION_NODE`, :const:`COMMENT_NODE`, :const:`DOCUMENT_NODE`, :const:`DOCUMENT_TYPE_NODE`, :const:`NOTATION_NODE`. This is a read-only attribute.
pt_br: Ціле число, що представляє тип вузла. Символічні константи для типів знаходяться в об’єкті :class:`Node`: :const:`ELEMENT_NODE`, :const:`ATTRIBUTE_NODE`, :const:`TEXT_NODE`, :const:`CDATA_SECTION_NODE`, :const:`ENTITY_NODE` , :const:`PROCESSING_INSTRUCTION_NODE`, :const:`COMMENT_NODE`, :const:`DOCUMENT_NODE`, :const:`DOCUMENT_TYPE_NODE`, :const:`NOTATION_NODE`. Це атрибут лише для читання.

source: The parent of the current node, or ``None`` for the document node. The value is always a :class:`Node` object or ``None``. For :class:`Element` nodes, this will be the parent element, except for the root element, in which case it will be the :class:`Document` object. For :class:`Attr` nodes, this is always ``None``. This is a read-only attribute.
pt_br: Батьківський елемент поточного вузла або ``None`` для вузла документа. Значенням завжди є об’єкт :class:`Node` або ``None``. Для вузлів :class:`Element` це буде батьківський елемент, за винятком кореневого елемента, у якому випадку це буде об’єкт :class:`Document`. Для вузлів :class:`Attr` це завжди ``None``. Це атрибут лише для читання.

source: A :class:`NamedNodeMap` of attribute objects. Only elements have actual values for this; others provide ``None`` for this attribute. This is a read-only attribute.
pt_br: :class:`NamedNodeMap` об’єктів атрибутів. Тільки елементи мають фактичні значення для цього; інші надають ``None`` для цього атрибута. Це атрибут лише для читання.

source: The node that immediately precedes this one with the same parent. For instance the element with an end-tag that comes just before the *self* element's start-tag. Of course, XML documents are made up of more than just elements so the previous sibling could be text, a comment, or something else. If this node is the first child of the parent, this attribute will be ``None``. This is a read-only attribute.
pt_br: Вузол, який безпосередньо передує цьому з тим же батьківським вузлом. Наприклад, елемент із кінцевим тегом, який стоїть безпосередньо перед початковим тегом елемента *self*. Звичайно, XML-документи складаються не лише з елементів, тому попередній брат може бути текстом, коментарем або чимось іншим. Якщо цей вузол є першим дочірнім вузлом батьківського, цей атрибут матиме значення ``None``. Це атрибут лише для читання.

source: The node that immediately follows this one with the same parent. See also :attr:`previousSibling`. If this is the last child of the parent, this attribute will be ``None``. This is a read-only attribute.
pt_br: Вузол, який слідує безпосередньо за цим із тим же батьківським вузлом. Дивіться також :attr:`previousSibling`. Якщо це останній дочірній елемент батьківського елемента, цей атрибут матиме значення ``None``. Це атрибут лише для читання.

source: A list of nodes contained within this node. This is a read-only attribute.
pt_br: Список вузлів, які містяться в цьому вузлі. Це атрибут лише для читання.

source: The first child of the node, if there are any, or ``None``. This is a read-only attribute.
pt_br: Перший дочірній елемент вузла, якщо він є, або ``None``. Це атрибут лише для читання.

source: The last child of the node, if there are any, or ``None``. This is a read-only attribute.
pt_br: Останній дочірній елемент вузла, якщо він є, або ``None``. Це атрибут лише для читання.

source: The part of the :attr:`tagName` following the colon if there is one, else the entire :attr:`tagName`. The value is a string.
pt_br: Частина :attr:`tagName` після двокрапки, якщо вона є, інакше весь :attr:`tagName`. Значенням є рядок.

source: The part of the :attr:`tagName` preceding the colon if there is one, else the empty string. The value is a string, or ``None``.
pt_br: Частина :attr:`tagName` перед двокрапкою, якщо вона є, інакше порожній рядок. Значенням є рядок або ``None``.

source: The namespace associated with the element name. This will be a string or ``None``. This is a read-only attribute.
pt_br: Простір імен, пов’язаний з іменем елемента. Це буде рядок або ``None``. Це атрибут лише для читання.

source: This has a different meaning for each node type; see the DOM specification for details. You can always get the information you would get here from another property such as the :attr:`tagName` property for elements or the :attr:`name` property for attributes. For all node types, the value of this attribute will be either a string or ``None``. This is a read-only attribute.
pt_br: Це має різне значення для кожного типу вузла; подробиці див. у специфікації DOM. Ви завжди можете отримати інформацію, яку ви отримали б тут, з іншої властивості, такої як властивість :attr:`tagName` для елементів або властивість :attr:`name` для атрибутів. Для всіх типів вузлів значенням цього атрибута буде рядок або ``None``. Це атрибут лише для читання.

source: This has a different meaning for each node type; see the DOM specification for details. The situation is similar to that with :attr:`nodeName`. The value is a string or ``None``.
pt_br: Це має різне значення для кожного типу вузла; подробиці див. у специфікації DOM. Ситуація схожа на :attr:`nodeName`. Значенням є рядок або ``None``.

source: Return ``True`` if the node has any attributes.
pt_br: Повертає ``True``, якщо вузол має будь-які атрибути.

source: Return ``True`` if the node has any child nodes.
pt_br: Повертає ``True``, якщо вузол має дочірні вузли.

source: Return ``True`` if *other* refers to the same node as this node. This is especially useful for DOM implementations which use any sort of proxy architecture (because more than one object can refer to the same node).
pt_br: Повертає ``True``, якщо *other* посилається на той самий вузол, що й цей вузол. Це особливо корисно для реалізацій DOM, які використовують будь-яку архітектуру проксі (оскільки більше ніж один об’єкт може посилатися на один вузол).

source: This is based on a proposed DOM Level 3 API which is still in the "working draft" stage, but this particular interface appears uncontroversial. Changes from the W3C will not necessarily affect this method in the Python DOM interface (though any new W3C API for this would also be supported).
pt_br: Це базується на запропонованому API рівня 3 DOM, який все ще перебуває на стадії "робочої чернетки", але цей конкретний інтерфейс не викликає суперечок. Зміни від W3C не обов’язково вплинуть на цей метод в інтерфейсі Python DOM (хоча будь-який новий API W3C для цього також підтримуватиметься).

source: Add a new child node to this node at the end of the list of children, returning *newChild*. If the node was already in the tree, it is removed first.
pt_br: Додайте новий дочірній вузол до цього вузла в кінці списку дочірніх, повертаючи *newChild*. Якщо вузол уже був у дереві, його спочатку видаляють.

source: Insert a new child node before an existing child. It must be the case that *refChild* is a child of this node; if not, :exc:`ValueError` is raised. *newChild* is returned. If *refChild* is ``None``, it inserts *newChild* at the end of the children's list.
pt_br: Вставте новий дочірній вузол перед існуючим дочірнім вузлом. Має бути так, що *refChild* є дочірнім для цього вузла; якщо ні, виникає :exc:`ValueError`. *newChild* повертається. Якщо *refChild* має значення ``None``, він вставляє *newChild* у кінець списку дітей.

source: Remove a child node. *oldChild* must be a child of this node; if not, :exc:`ValueError` is raised. *oldChild* is returned on success. If *oldChild* will not be used further, its :meth:`unlink` method should be called.
pt_br: Видаліть дочірній вузол. *oldChild* має бути дочірнім для цього вузла; якщо ні, виникає :exc:`ValueError`. *oldChild* повертається в разі успіху. Якщо *oldChild* більше не використовуватиметься, слід викликати його метод :meth:`unlink`.
