Repository: python/python-docs-pt-br
Catalog: library/xml.dom.po
Languages: pt_br

source: If an attempt is made to change any object in a way that is not permitted with regard to the `Namespaces in XML <https://www.w3.org/TR/REC-xml-names/>`_ recommendation, this exception is raised.
pt_br: Якщо робиться спроба змінити будь-який об’єкт у спосіб, який заборонено щодо рекомендації `Простори імен у XML <https://www.w3.org/TR/REC-xml-names/>`_, виникає цей виняток.

source: Exception when a node does not exist in the referenced context. For example, :meth:`NamedNodeMap.removeNamedItem` will raise this if the node passed in does not exist in the map.
pt_br: Виняток, коли вузол не існує в контексті посилання. Наприклад, :meth:`NamedNodeMap.removeNamedItem` викличе це, якщо переданий вузол не існує на карті.

source: Raised when the implementation does not support the requested type of object or operation.
pt_br: Викликається, коли реалізація не підтримує потрібний тип об’єкта чи операції.

source: This is raised if data is specified for a node which does not support data.
pt_br: Це виникає, якщо дані вказані для вузла, який не підтримує дані.

source: Raised on attempts to modify an object where modifications are not allowed (such as for read-only nodes).
pt_br: Викликається під час спроб модифікувати об’єкт, де модифікації заборонені (наприклад, для вузлів лише для читання).

source: Raised when an invalid or illegal string is specified.
pt_br: Викликається, коли вказано недійсний або недопустимий рядок.

source: Raised when a node is inserted in a different document than it currently belongs to, and the implementation does not support migrating the node from one document to the other.
pt_br: Викликається, коли вузол вставляється в документ, відмінний від того, якому він наразі належить, і реалізація не підтримує переміщення вузла з одного документа в інший.

source: The exception codes defined in the DOM recommendation map to the exceptions described above according to this table:
pt_br: Коди винятків, визначені в рекомендаціях DOM, відповідають описаним вище виняткам відповідно до цієї таблиці:

source: Constant
pt_br: Constante

source: Exception
pt_br: Виняток

source: Conformance
pt_br: Відповідність

source: This section describes the conformance requirements and relationships between the Python DOM API, the W3C DOM recommendations, and the OMG IDL mapping for Python.
pt_br: У цьому розділі описано вимоги до відповідності та зв’язки між Python DOM API, рекомендаціями W3C DOM і відображенням OMG IDL для Python.

source: Type Mapping
pt_br: Відображення типу

source: The IDL types used in the DOM specification are mapped to Python types according to the following table.
pt_br: Типи IDL, які використовуються в специфікації DOM, зіставляються з типами Python відповідно до наступної таблиці.

source: IDL Type
pt_br: Tipo IDL

source: Python Type
pt_br: Tipo em Python

source: Accessor Methods
pt_br: Методи доступу

source: The mapping from OMG IDL to Python defines accessor functions for IDL ``attribute`` declarations in much the way the Java mapping does. Mapping the IDL declarations ::
pt_br: Відображення з OMG IDL на Python визначає функції доступу для оголошень ``атрибутів`` IDL майже так само, як це робить відображення Java. Відображення декларацій IDL ::

source: yields three accessor functions: a "get" method for :attr:`someValue` (:meth:`_get_someValue`), and "get" and "set" methods for :attr:`anotherValue` (:meth:`_get_anotherValue` and :meth:`_set_anotherValue`). The mapping, in particular, does not require that the IDL attributes are accessible as normal Python attributes: ``object.someValue`` is *not* required to work, and may raise an :exc:`AttributeError`.
pt_br: дає три функції доступу: метод "get" для :attr:`someValue` (:meth:`_get_someValue`) і методи "get" і "set" для :attr:`anotherValue` (:meth:`_get_anotherValue` і :meth:`_set_anotherValue`). Відображення, зокрема, не вимагає, щоб атрибути IDL були доступні як звичайні атрибути Python: ``object.someValue`` *не* обов’язковий для роботи, і може викликати :exc:`AttributeError`.

source: The Python DOM API, however, *does* require that normal attribute access work. This means that the typical surrogates generated by Python IDL compilers are not likely to work, and wrapper objects may be needed on the client if the DOM objects are accessed via CORBA. While this does require some additional consideration for CORBA DOM clients, the implementers with experience using DOM over CORBA from Python do not consider this a problem. Attributes that are declared ``readonly`` may not restrict write access in all DOM implementations.
pt_br: Однак Python DOM API *не* вимагає, щоб звичайний доступ до атрибутів працював. Це означає, що типові сурогати, згенеровані компіляторами Python IDL, навряд чи працюватимуть, і об’єкти-огортки можуть знадобитися на клієнті, якщо доступ до об’єктів DOM здійснюється через CORBA. Хоча для клієнтів CORBA DOM це вимагає додаткового розгляду, розробники з досвідом використання DOM поверх CORBA з Python не вважають це проблемою. Атрибути, оголошені лише для читання, можуть не обмежувати доступ для запису в усіх реалізаціях DOM.

source: In the Python DOM API, accessor functions are not required. If provided, they should take the form defined by the Python IDL mapping, but these methods are considered unnecessary since the attributes are accessible directly from Python. "Set" accessors should never be provided for ``readonly`` attributes.
pt_br: В Python DOM API функції доступу не потрібні. Якщо вони надані, вони мають приймати форму, визначену відображенням Python IDL, але ці методи вважаються непотрібними, оскільки атрибути доступні безпосередньо з Python. Аксесори "Set" ніколи не повинні надаватися для атрибутів "лише для читання".

source: The IDL definitions do not fully embody the requirements of the W3C DOM API, such as the notion of certain objects, such as the return value of :meth:`getElementsByTagName`, being "live". The Python DOM API does not require implementations to enforce such requirements.
pt_br: Визначення IDL не повністю втілюють вимоги W3C DOM API, такі як поняття певних об’єктів, таких як значення, що повертається :meth:`getElementsByTagName`, бути "живими". Python DOM API не вимагає реалізацій для виконання таких вимог.
