Repository: python/python-docs-pt-br
Catalog: library/xml.sax.po
Languages: pt_br

source: **Source code:** :source:`Lib/xml/sax/__init__.py`
pt_br: **Código-fonte:** :source:`Lib/xml/sax/__init__.py`

source: The :mod:`xml.sax` package provides a number of modules which implement the Simple API for XML (SAX) interface for Python. The package itself provides the SAX exceptions and the convenience functions which will be most used by users of the SAX API.
pt_br: Пакет :mod:`xml.sax` містить кілька модулів, які реалізують інтерфейс Simple API for XML (SAX) для Python. Сам пакет надає винятки SAX і зручні функції, якими найчастіше користуватимуться користувачі SAX API.

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
pt_br: Se você precisar analisar dados não confiáveis ou não autenticados, consulte :ref:`xml-security`.

source: The SAX parser no longer processes general external entities by default to increase security. Before, the parser created network connections to fetch remote files or loaded local files from the file system for DTD and entities. The feature can be enabled again with method :meth:`~xml.sax.xmlreader.XMLReader.setFeature` on the parser object and argument :data:`~xml.sax.handler.feature_external_ges`.
pt_br: Синтаксичний аналізатор SAX більше не обробляє загальні зовнішні сутності за замовчуванням для підвищення безпеки. Раніше аналізатор створював мережеві підключення для отримання віддалених файлів або завантажував локальні файли з файлової системи для DTD і об’єктів. Цю функцію можна знову ввімкнути за допомогою методу :meth:`~xml.sax.xmlreader.XMLReader.setFeature` в об’єкті аналізатора та аргументі :data:`~xml.sax.handler.feature_external_ges`.

source: The convenience functions are:
pt_br: As funções de conveniência são:

source: Create and return a SAX :class:`~xml.sax.xmlreader.XMLReader` object. The first parser found will be used. If *parser_list* is provided, it must be an iterable of strings which name modules that have a function named :func:`create_parser`. Modules listed in *parser_list* will be used before modules in the default list of parsers.
pt_br: Створіть і поверніть об’єкт SAX :class:`~xml.sax.xmlreader.XMLReader`. Буде використано перший знайдений парсер. Якщо надається *parser_list*, це має бути ітерація рядків, які іменують модулі, які мають функцію з назвою :func:`create_parser`. Модулі, перелічені в *parser_list*, використовуватимуться перед модулями в стандартному списку аналізаторів.

source: The *parser_list* argument can be any iterable, not just a list.
pt_br: Аргумент *parser_list* може бути будь-яким ітерованим, а не просто списком.

source: Create a SAX parser and use it to parse a document. The document, passed in as *filename_or_stream*, can be a filename or a file object. The *handler* parameter needs to be a SAX :class:`~handler.ContentHandler` instance. If *error_handler* is given, it must be a SAX :class:`~handler.ErrorHandler` instance; if omitted, :exc:`SAXParseException` will be raised on all errors. There is no return value; all work must be done by the *handler* passed in.
pt_br: Створіть аналізатор SAX і використовуйте його для аналізу документа. Документ, переданий як *filename_or_stream*, може бути ім’ям файлу або об’єктом файлу. Параметр *handler* має бути екземпляром SAX :class:`~handler.ContentHandler`. Якщо задано *error_handler*, це має бути екземпляр SAX :class:`~handler.ErrorHandler`; якщо опущено, :exc:`SAXParseException` буде викликано для всіх помилок. Немає значення, що повертається; усю роботу має виконувати переданий *обробник*.

source: Similar to :func:`parse`, but parses from a buffer *string* received as a parameter. *string* must be a :class:`str` instance or a :term:`bytes-like object`.
pt_br: Подібно до :func:`parse`, але аналізує з *рядка* буфера, отриманого як параметр. *рядок* має бути екземпляром :class:`str` або :term:`bytes-like object`.

source: Added support of :class:`str` instances.
pt_br: Додано підтримку екземплярів :class:`str`.

source: A typical SAX application uses three kinds of objects: readers, handlers and input sources. "Reader" in this context is another term for parser, i.e. some piece of code that reads the bytes or characters from the input source, and produces a sequence of events. The events then get distributed to the handler objects, i.e. the reader invokes a method on the handler. A SAX application must therefore obtain a reader object, create or open the input sources, create the handlers, and connect these objects all together. As the final step of preparation, the reader is called to parse the input. During parsing, methods on the handler objects are called based on structural and syntactic events from the input data.
pt_br: Типова програма SAX використовує три види об'єктів: читачі, обробники та джерела введення. У цьому контексті "зчитувач" — це ще один термін для парсера, тобто деякого фрагмента коду, який зчитує байти або символи з джерела вхідних даних і створює послідовність подій. Потім події розподіляються на об’єкти обробника, тобто читач викликає метод обробника. Таким чином, програма SAX повинна отримати об’єкт читача, створити або відкрити джерела введення, створити обробники та з’єднати ці об’єкти разом. На останньому етапі підготовки читач викликається для аналізу введених даних. Під час синтаксичного аналізу методи об’єктів-обробників викликаються на основі структурних і синтаксичних подій із вхідних даних.

source: For these objects, only the interfaces are relevant; they are normally not instantiated by the application itself. Since Python does not have an explicit notion of interface, they are formally introduced as classes, but applications may use implementations which do not inherit from the provided classes. The :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml.sax.xmlreader.AttributesNS`, and :class:`~xml.sax.xmlreader.XMLReader` interfaces are defined in the module :mod:`xml.sax.xmlreader`. The handler interfaces are defined in :mod:`xml.sax.handler`. For convenience, :class:`~xml.sax.xmlreader.InputSource` (which is often instantiated directly) and the handler classes are also available from :mod:`xml.sax`. These interfaces are described below.
pt_br: Для цих об'єктів актуальні лише інтерфейси; вони зазвичай не створюються самою програмою. Оскільки Python не має явного поняття інтерфейсу, вони формально представлені як класи, але програми можуть використовувати реалізації, які не успадковуються від наданих класів. :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml. Інтерфейси sax.xmlreader.AttributesNS` та :class:`~xml.sax.xmlreader.XMLReader` визначені в модулі :mod:`xml.sax.xmlreader`. Інтерфейси обробника визначені в :mod:`xml.sax.handler`. Для зручності :class:`~xml.sax.xmlreader.InputSource` (який часто створюється безпосередньо) і класи обробників також доступні з :mod:`xml.sax`. Ці інтерфейси описані нижче.

source: In addition to these classes, :mod:`xml.sax` provides the following exception classes.
pt_br: На додаток до цих класів, :mod:`xml.sax` надає наступні класи винятків.

source: Encapsulate an XML error or warning. This class can contain basic error or warning information from either the XML parser or the application: it can be subclassed to provide additional functionality or to add localization. Note that although the handlers defined in the :class:`~xml.sax.handler.ErrorHandler` interface receive instances of this exception, it is not required to actually raise the exception --- it is also useful as a container for information.
pt_br: Інкапсулювати помилку XML або попередження. Цей клас може містити основну інформацію про помилку або попередження від синтаксичного аналізатора XML або програми: його можна розділити на підкласи, щоб забезпечити додаткові функції або додати локалізацію. Зауважте, що незважаючи на те, що обробники, визначені в інтерфейсі :class:`~xml.sax.handler.ErrorHandler`, отримують екземпляри цього винятку, не обов’язково створювати виняток --- він також корисний як контейнер для інформації.

source: When instantiated, *msg* should be a human-readable description of the error. The optional *exception* parameter, if given, should be ``None`` or an exception that was caught by the parsing code and is being passed along as information.
pt_br: Після створення *msg* має бути зрозумілим для людини описом помилки. Необов’язковий параметр *exception*, якщо його надано, має бути ``None`` або винятком, який був перехоплений кодом аналізу та передається як інформація.

source: This is the base class for the other SAX exception classes.
pt_br: Це базовий клас для інших класів винятків SAX.

source: Subclass of :exc:`SAXException` raised on parse errors. Instances of this class are passed to the methods of the SAX :class:`~xml.sax.handler.ErrorHandler` interface to provide information about the parse error. This class supports the SAX :class:`~xml.sax.xmlreader.Locator` interface as well as the :class:`SAXException` interface.
pt_br: Підклас :exc:`SAXException` викликаний помилками аналізу. Екземпляри цього класу передаються методам інтерфейсу SAX :class:`~xml.sax.handler.ErrorHandler` для надання інформації про помилку аналізу. Цей клас підтримує інтерфейс SAX :class:`~xml.sax.xmlreader.Locator`, а також інтерфейс :class:`SAXException`.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is confronted with an unrecognized feature or property. SAX applications and extensions may use this class for similar purposes.
pt_br: Підклас :exc:`SAXException` викликається, коли SAX :class:`~xml.sax.xmlreader.XMLReader` стикається з нерозпізнаною функцією або властивістю. Програми та розширення SAX можуть використовувати цей клас для подібних цілей.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is asked to enable a feature that is not supported, or to set a property to a value that the implementation does not support. SAX applications and extensions may use this class for similar purposes.
pt_br: Підклас :exc:`SAXException` викликається, коли SAX :class:`~xml.sax.xmlreader.XMLReader` просять увімкнути функцію, яка не підтримується, або встановити для властивості значення, яке реалізація не підтримує . Програми та розширення SAX можуть використовувати цей клас для подібних цілей.

source: `SAX: The Simple API for XML <http://www.saxproject.org/>`_
pt_br: `SAX: простий API для XML <http://www.saxproject.org/>`_

source: This site is the focal point for the definition of the SAX API. It provides a Java implementation and online documentation. Links to implementations and historical information are also available.
pt_br: Цей сайт є центром для визначення SAX API. Він надає реалізацію Java та онлайн-документацію. Також доступні посилання на впровадження та історичну інформацію.

source: Module :mod:`xml.sax.handler`
pt_br: Модуль :mod:`xml.sax.handler`

source: Definitions of the interfaces for application-provided objects.
pt_br: Визначення інтерфейсів для об'єктів, що надаються програмою.

source: Module :mod:`xml.sax.saxutils`
pt_br: Модуль :mod:`xml.sax.saxutils`

source: Convenience functions for use in SAX applications.
pt_br: Функції зручності для використання в програмах SAX.

source: Module :mod:`xml.sax.xmlreader`
pt_br: Модуль :mod:`xml.sax.xmlreader`

source: Definitions of the interfaces for parser-provided objects.
pt_br: Визначення інтерфейсів для об’єктів, що надаються парсером.

source: SAXException Objects
pt_br: Об’єкти SAXException

source: The :class:`SAXException` exception class supports the following methods:
pt_br: Клас винятків :class:`SAXException` підтримує такі методи:

source: Return a human-readable message describing the error condition.
pt_br: Повернути зрозуміле для людини повідомлення з описом стану помилки.

source: Return an encapsulated exception object, or ``None``.
pt_br: Повертає інкапсульований об’єкт винятку або ``None``.
