Repository: python/python-docs-pt-br
Catalog: library/xml.etree.elementtree.po
Languages: pt_br

source: :meth:`XMLParser.feed` calls *target*\'s ``start(tag, attrs_dict)`` method for each opening tag, its ``end(tag)`` method for each closing tag, and data is processed by method ``data(data)``. For further supported callback methods, see the :class:`TreeBuilder` class. :meth:`XMLParser.close` calls *target*\'s method ``close()``. :class:`XMLParser` can be used not only for building a tree structure. This is an example of counting the maximum depth of an XML file::
pt_br: :meth:`XMLParser.feed` викликає метод *target* ``start(tag, attrs_dict)`` для кожного початкового тегу, його метод ``end(tag)`` для кожного закриваючого тегу, і дані обробляються методом ``дані(дані)``. Інші підтримувані методи зворотного виклику див. у класі :class:`TreeBuilder`. :meth:`XMLParser.close` викликає метод *target* ``close()``. :class:`XMLParser` можна використовувати не тільки для побудови деревовидної структури. Це приклад підрахунку максимальної глибини файлу XML:

source: XMLPullParser Objects
pt_br: Об’єкти XMLPullParser

source: A pull parser suitable for non-blocking applications. Its input-side API is similar to that of :class:`XMLParser`, but instead of pushing calls to a callback target, :class:`XMLPullParser` collects an internal list of parsing events and lets the user read from it. *events* is a sequence of events to report back. The supported events are the strings ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` and ``"end-ns"`` (the "ns" events are used to get detailed namespace information). If *events* is omitted, only ``"end"`` events are reported.
pt_br: Синтаксичний аналізатор, що підходить для неблокуючих програм. Його API на стороні введення схожий на API :class:`XMLParser`, але замість того, щоб надсилати виклики до цілі зворотного виклику, :class:`XMLPullParser` збирає внутрішній список подій аналізу та дозволяє користувачеві читати з нього. *події* — це послідовність подій, про які потрібно повідомити. Підтримуваними подіями є рядки ``"start"``, ``"end"``, ``"comment"``, ``"pi"``, ``"start-ns"`` і ``"end-ns"`` (події "ns" використовуються для отримання детальної інформації про простір імен). Якщо *events* опущено, повідомляються лише події ``"end"``.

source: Feed the given bytes data to the parser.
pt_br: Передайте надані дані в байтах аналізатору.

source: Signal the parser that the data stream is terminated. Unlike :meth:`XMLParser.close`, this method always returns :const:`None`. Any events not yet retrieved when the parser is closed can still be read with :meth:`read_events`.
pt_br: Сигналізуйте синтаксичному аналізатору, що потік даних завершено. На відміну від :meth:`XMLParser.close`, цей метод завжди повертає :const:`None`. Будь-які події, які ще не були отримані, коли синтаксичний аналізатор закрито, все ще можна прочитати за допомогою :meth:`read_events`.

source: Return an iterator over the events which have been encountered in the data fed to the parser. The iterator yields ``(event, elem)`` pairs, where *event* is a string representing the type of event (e.g. ``"end"``) and *elem* is the encountered :class:`Element` object, or other context value as follows.
pt_br: Повертає ітератор над подіями, які зустрічаються в даних, переданих до аналізатора. Ітератор видає пари ``(event, elem)``, де *event* — рядок, що представляє тип події (наприклад, ``"end"``), а *elem* — це знайдений об’єкт :class:`Element` або інше значення контексту, як показано нижче.

source: ``start``, ``end``: the current Element.
pt_br: ``start``, ``end``: поточний елемент.

source: ``comment``, ``pi``: the current comment / processing instruction
pt_br: ``comment``, ``pi``: поточний коментар / інструкція обробки

source: ``start-ns``: a tuple ``(prefix, uri)`` naming the declared namespace mapping.
pt_br: ``start-ns``: кортеж ``(prefix, uri)``, який іменує оголошене відображення простору імен.

source: ``end-ns``: :const:`None` (this may change in a future version)
pt_br: ``end-ns``: :const:`None` (це може змінитися в наступній версії)

source: Events provided in a previous call to :meth:`read_events` will not be yielded again. Events are consumed from the internal queue only when they are retrieved from the iterator, so multiple readers iterating in parallel over iterators obtained from :meth:`read_events` will have unpredictable results.
pt_br: Події, надані в попередньому виклику :meth:`read_events`, не будуть видані знову. Події споживаються з внутрішньої черги лише тоді, коли вони отримані з ітератора, тому кілька читачів, які паралельно повторюють ітератори, отримані з :meth:`read_events`, матимуть непередбачувані результати.

source: :class:`XMLPullParser` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
pt_br: :class:`XMLPullParser` лише гарантує, що він побачив символ ">" початкового тегу, коли він випромінює подію "start", тому атрибути визначені, але вміст атрибутів text і tail на той момент не визначено . Те саме стосується елемента діти; вони можуть бути або не бути присутніми.

source: Exceptions
pt_br: Exceções

source: XML parse error, raised by the various parsing methods in this module when parsing fails. The string representation of an instance of this exception will contain a user-friendly error message. In addition, it will have the following attributes available:
pt_br: Помилка аналізу XML, викликана різними методами аналізу в цьому модулі, коли аналіз не вдається. Рядкове представлення екземпляра цього винятку міститиме зручне повідомлення про помилку. Крім того, він матиме такі доступні атрибути:

source: A numeric error code from the expat parser. See the documentation of :mod:`xml.parsers.expat` for the list of error codes and their meanings.
pt_br: Числовий код помилки від аналізатора expat. Перегляньте документацію :mod:`xml.parsers.expat`, щоб переглянути список кодів помилок та їх значення.

source: A tuple of *line*, *column* numbers, specifying where the error occurred.
pt_br: Кортеж чисел *рядка*, *стовпця*, що вказує, де сталася помилка.

source: Footnotes
pt_br: Notas de rodapé

source: The encoding string included in XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
pt_br: Рядок кодування, включений у вивід XML, має відповідати відповідним стандартам. Наприклад, "UTF-8" дійсний, а "UTF8" – ні. Див. https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl і https://www.iana.org/assignments/character-sets/character-sets.xhtml.
