Repository: python/python-docs-pt-br
Catalog: library/xml.sax.utils.po
Languages: pt_br

source: :mod:`!xml.sax.saxutils` --- SAX Utilities
pt_br: :mod:`!xml.sax.saxutils` --- Utilitários de SAX

source: **Source code:** :source:`Lib/xml/sax/saxutils.py`
pt_br: **Código-fonte:** :source:`Lib/xml/sax/saxutils.py`

source: The module :mod:`xml.sax.saxutils` contains a number of classes and functions that are commonly useful when creating SAX applications, either in direct use, or as base classes.
pt_br: O módulo :mod:`xml.sax.saxutils` contém uma série de classes e funções que são comumente úteis ao criar aplicações SAX, seja em uso direto ou como classes base.

source: Escape ``'&'``, ``'<'``, and ``'>'`` in a string of data.
pt_br: Escapa ``'&'``, ``'<'`` e ``'>'`` em uma string de dados.

source: You can escape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. The characters ``'&'``, ``'<'`` and ``'>'`` are always escaped, even if *entities* is provided.
pt_br: Você pode escapar outras strings de dados passando um dicionário como o parâmetro opcional *entities*. As chaves e os valores devem ser strings; cada chave será substituída pelo seu valor correspondente. Os caracteres ``'&'``, ``'<'`` e ``'>'`` são sempre escapados, mesmo que *entities* seja fornecido.

source: This function should only be used to escape characters that can't be used directly in XML. Do not use this function as a general string translation function.
pt_br: Esta função deve ser usada apenas para escapar caracteres que não podem ser usados diretamente em XML. Não a utilize como uma função geral de tradução de strings.

source: Unescape ``'&amp;'``, ``'&lt;'``, and ``'&gt;'`` in a string of data.
pt_br: Remove escape de ``'&amp;'``, ``'&lt;'`` e ``'&gt;'`` em uma string de dados.

source: You can unescape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. ``'&amp'``, ``'&lt;'``, and ``'&gt;'`` are always unescaped, even if *entities* is provided.
pt_br: Você pode remover escape de outras strings de dados passando um dicionário como o parâmetro opcional *entities*. As chaves e os valores devem ser strings; cada chave será substituída pelo seu valor correspondente. ``'&amp'``, ``'&lt;'`` e ``'&gt;'`` têm sempre o escape removido, mesmo que *entities* seja fornecido.

source: Similar to :func:`escape`, but also prepares *data* to be used as an attribute value. The return value is a quoted version of *data* with any additional required replacements. :func:`quoteattr` will select a quote character based on the content of *data*, attempting to avoid encoding any quote characters in the string. If both single- and double-quote characters are already in *data*, the double-quote characters will be encoded and *data* will be wrapped in double-quotes. The resulting string can be used directly as an attribute value::
pt_br: Semelhante a :func:`escape`, mas também prepara *data* para ser usado como um valor de atributo. O valor de retorno é uma versão entre aspas de *data* com quaisquer substituições adicionais necessárias. :func:`quoteattr` selecionará um caractere de aspas com base no conteúdo de *data*, tentando evitar a codificação de quaisquer caracteres de aspas na string. Se já houver caracteres de aspas simples e duplas em *data*, os caracteres de aspas duplas serão codificados e *data* será colocado entre aspas duplas. A string resultante pode ser usada diretamente como um valor de atributo:

source: This function is useful when generating attribute values for HTML or any SGML using the reference concrete syntax.
pt_br: Esta função é útil ao gerar valores de atributos para HTML ou qualquer SGML usando a sintaxe concreta de referência.

source: This class implements the :class:`~xml.sax.handler.ContentHandler` interface by writing SAX events back into an XML document. In other words, using an :class:`XMLGenerator` as the content handler will reproduce the original document being parsed. *out* should be a file-like object which will default to *sys.stdout*. *encoding* is the encoding of the output stream which defaults to ``'iso-8859-1'``. *short_empty_elements* controls the formatting of elements that contain no content: if ``False`` (the default) they are emitted as a pair of start/end tags, if set to ``True`` they are emitted as a single self-closed tag.
pt_br: Esta classe implementa a interface :class:`~xml.sax.handler.ContentHandler` escrevendo eventos SAX de volta em um documento XML. Em outras palavras, usar um :class:`XMLGenerator` como manipulador de conteúdo reproduzirá o documento original que está sendo analisado. *out* deve ser um objeto arquivo ou similar, cujo padrão é *sys.stdout*. *encoding* é a codificação do fluxo de saída, cujo padrão é ``'iso-8859-1'``. *short_empty_elements* controla a formatação de elementos sem conteúdo: se ``False`` (o padrão), eles são emitidos como um par de tags de início/fim; se definido como ``True``, eles são emitidos como uma única tag autofechada.

source: Added the *short_empty_elements* parameter.
pt_br: Foi adicionado o parâmetro *short_empty_elements*.

source: This class is designed to sit between an :class:`~xml.sax.xmlreader.XMLReader` and the client application's event handlers. By default, it does nothing but pass requests up to the reader and events on to the handlers unmodified, but subclasses can override specific methods to modify the event stream or the configuration requests as they pass through.
pt_br: Esta classe foi projetada para ficar entre um :class:`~xml.sax.xmlreader.XMLReader` e os manipuladores de eventos da aplicação cliente. Por padrão, ela não faz nada além de passar requisições para o leitor e eventos para os manipuladores sem modificações, mas subclasses podem substituir métodos específicos para modificar o fluxo de eventos ou as requisições de configuração à medida que passam.

source: This function takes an input source and an optional base URL and returns a fully resolved :class:`~xml.sax.xmlreader.InputSource` object ready for reading. The input source can be given as a string, a file-like object, or an :class:`~xml.sax.xmlreader.InputSource` object; parsers will use this function to implement the polymorphic *source* argument to their :meth:`~xml.sax.xmlreader.XMLReader.parse` method.
pt_br: Esta função recebe uma fonte de entrada e uma URL base opcional e retorna um objeto :class:`~xml.sax.xmlreader.InputSource` totalmente resolvido, pronto para leitura. A fonte de entrada pode ser fornecida como uma string, um objeto arquivo ou similar ou um objeto :class:`~xml.sax.xmlreader.InputSource`; os analisadores usarão esta função para implementar o argumento polimórfico *source* em seu método :meth:`~xml.sax.xmlreader.XMLReader.parse`.
