Repository: python/python-docs-pt-br
Catalog: library/xml.etree.elementtree.po
Languages: pt_br

source: Comment element factory. This factory function creates a special element that will be serialized as an XML comment by the standard serializer. The comment string can be either a bytestring or a Unicode string. *text* is a string containing the comment string. Returns an element instance representing a comment.
pt_br: Фабрика елементів коментарів. Ця фабрична функція створює спеціальний елемент, який буде серіалізовано як коментар XML стандартним серіалізатором. Рядок коментаря може бути байтовим рядком або рядком Unicode. *text* – це рядок, що містить рядок коментаря. Повертає екземпляр елемента, що представляє коментар.

source: Note that :class:`XMLParser` skips over comments in the input instead of creating comment objects for them. An :class:`ElementTree` will only contain comment nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
pt_br: Зауважте, що :class:`XMLParser` пропускає коментарі у вхідних даних замість того, щоб створювати для них об’єкти коментарів. :class:`ElementTree` міститиме лише вузли коментарів, якщо вони були вставлені в дерево за допомогою одного з методів :class:`Element`.

source: Writes an element tree or element structure to sys.stdout. This function should be used for debugging only.
pt_br: Записує дерево елементів або структуру елементів у sys.stdout. Цю функцію слід використовувати лише для налагодження.

source: The exact output format is implementation dependent. In this version, it's written as an ordinary XML file.
pt_br: Точний вихідний формат залежить від реалізації. У цій версії він написаний як звичайний файл XML.

source: *elem* is an element tree or an individual element.
pt_br: *elem* — дерево елементів або окремий елемент.

source: The :func:`dump` function now preserves the attribute order specified by the user.
pt_br: Функція :func:`dump` тепер зберігає порядок атрибутів, указаний користувачем.

source: Parses an XML section from a string constant. Same as :func:`XML`. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
pt_br: Розбирає розділ XML із константи рядка. Те саме, що :func:`XML`. *текст* — це рядок, що містить дані XML. *parser* є необов’язковим екземпляром парсера. Якщо не вказано, використовується стандартний аналізатор :class:`XMLParser`. Повертає екземпляр :class:`Element`.

source: Parses an XML document from a sequence of string fragments. *sequence* is a list or other sequence containing XML data fragments. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
pt_br: Розбирає XML-документ із послідовності фрагментів рядків. *послідовність* — це список або інша послідовність, що містить фрагменти даних XML. *parser* є необов’язковим екземпляром парсера. Якщо не вказано, використовується стандартний аналізатор :class:`XMLParser`. Повертає екземпляр :class:`Element`.

source: Appends whitespace to the subtree to indent the tree visually. This can be used to generate pretty-printed XML output. *tree* can be an Element or ElementTree. *space* is the whitespace string that will be inserted for each indentation level, two space characters by default. For indenting partial subtrees inside of an already indented tree, pass the initial indentation level as *level*.
pt_br: До піддерева додає пробіли для візуального відступу дерева. Це можна використати для генерації красивого друкованого виводу XML. *дерево* може бути елементом або деревом елементів. *пробіл* — це пробільний рядок, який буде вставлено для кожного рівня відступу, два символи пробілу за замовчуванням. Для відступу часткових піддерев усередині дерева з відступами передайте початковий рівень відступу як *level*.

source: Check if an object appears to be a valid element object. *element* is an element instance. Return ``True`` if this is an element object.
pt_br: Перевірте, чи об’єкт є дійсним об’єктом елемента. *element* — екземпляр елемента. Повертає ``True``, якщо це об’єкт елемента.

source: Note that while :func:`iterparse` builds the tree incrementally, it issues blocking reads on *source* (or the file it names). As such, it's unsuitable for applications where blocking reads can't be made. For fully non-blocking parsing, see :class:`XMLPullParser`.
pt_br: Зауважте, що хоча :func:`iterparse` будує дерево поступово, він блокує читання *source* (або файлу, який він називає). Таким чином, він не підходить для додатків, де блокування зчитування неможливе. Повністю неблокуючий аналіз див. :class:`XMLPullParser`.

source: :func:`iterparse` only guarantees that it has seen the ">" character of a starting tag when it emits a "start" event, so the attributes are defined, but the contents of the text and tail attributes are undefined at that point. The same applies to the element children; they may or may not be present.
pt_br: :func:`iterparse` лише гарантує, що він побачив символ ">" початкового тегу, коли він випромінює подію "start", тому атрибути визначені, але вміст атрибутів text і tail на цьому етапі не визначено . Те саме стосується елемента діти; вони можуть бути або не бути присутніми.

source: If you need a fully populated element, look for "end" events instead.
pt_br: Якщо вам потрібен повністю заповнений елемент, шукайте події "кінець".

source: The *parser* argument.
pt_br: Аргумент *parser*.

source: The ``comment`` and ``pi`` events were added.
pt_br: Додано події ``comment`` і ``pi``.

source: Parses an XML section into an element tree. *source* is a filename or file object containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`ElementTree` instance.
pt_br: Розбирає розділ XML у дерево елементів. *джерело* — це ім’я файлу або об’єкт файлу, що містить дані XML. *parser* є необов’язковим екземпляром парсера. Якщо не вказано, використовується стандартний аналізатор :class:`XMLParser`. Повертає екземпляр :class:`ElementTree`.

source: PI element factory. This factory function creates a special element that will be serialized as an XML processing instruction. *target* is a string containing the PI target. *text* is a string containing the PI contents, if given. Returns an element instance, representing a processing instruction.
pt_br: Завод ПІ-елементів. Ця фабрична функція створює спеціальний елемент, який буде серіалізовано як інструкцію обробки XML. *target* — це рядок, що містить ціль PI. *текст* — це рядок, що містить вміст PI, якщо його вказано. Повертає екземпляр елемента, що представляє інструкцію обробки.

source: Note that :class:`XMLParser` skips over processing instructions in the input instead of creating PI objects for them. An :class:`ElementTree` will only contain processing instruction nodes if they have been inserted into to the tree using one of the :class:`Element` methods.
pt_br: Обратите внимание, что :class:`XMLParser` пропускает инструкции обработки во входных данных вместо создания для них объектов PI. :class:`ElementTree` будет содержать узлы инструкций обработки только в том случае, если они были вставлены в дерево с помощью одного из :class:`Element` методов.

source: Registers a namespace prefix. The registry is global, and any existing mapping for either the given prefix or the namespace URI will be removed. *prefix* is a namespace prefix. *uri* is a namespace uri. Tags and attributes in this namespace will be serialized with the given prefix, if at all possible.
pt_br: Реєструє префікс простору імен. Реєстр є глобальним, і будь-яке існуюче відображення для заданого префікса або URI простору імен буде видалено. *префікс* — це префікс простору імен. *uri* — це uri простору імен. Теги й атрибути в цьому просторі імен будуть серіалізовані з заданим префіксом, якщо це взагалі можливо.

source: Subelement factory. This function creates an element instance, and appends it to an existing element.
pt_br: Піделементний завод. Ця функція створює екземпляр елемента та додає його до існуючого елемента.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *parent* is the parent element. *tag* is the subelement name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments. Returns an element instance.
pt_br: Ім’я елемента, назви атрибутів і значення атрибутів можуть бути байтовими рядками або рядками Unicode. *parent* є батьківським елементом. *тег* — це назва піделемента. *attrib* — необов’язковий словник, що містить атрибути елемента. *extra* містить додаткові атрибути, надані як аргументи ключових слів. Повертає екземпляр елемента.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns an (optionally) encoded string containing the XML data.
pt_br: Створює рядкове представлення елемента XML, включаючи всі піделементи. *element* є екземпляром :class:`Element`. *кодування* [1]_ — вихідне кодування (за замовчуванням — US-ASCII). Використовуйте ``encoding="unicode"``, щоб створити рядок Юнікод (інакше буде згенеровано байтовий рядок). *method* — це ``"xml"``, ``"html"`` або ``"text"`` (за замовчуванням ``"xml"``). *xml_declaration*, *default_namespace* і *short_empty_elements* мають те саме значення, що й у :meth:`ElementTree.write`. Повертає (необов’язково) закодований рядок, що містить дані XML.

source: Added the *short_empty_elements* parameter.
pt_br: Foi adicionado o parâmetro *short_empty_elements*.

source: Added the *xml_declaration* and *default_namespace* parameters.
pt_br: Добавлены параметры *xml_declaration* и *default_namespace*.

source: The :func:`tostring` function now preserves the attribute order specified by the user.
pt_br: Функція :func:`tostring` тепер зберігає порядок атрибутів, указаний користувачем.

source: Generates a string representation of an XML element, including all subelements. *element* is an :class:`Element` instance. *encoding* [1]_ is the output encoding (default is US-ASCII). Use ``encoding="unicode"`` to generate a Unicode string (otherwise, a bytestring is generated). *method* is either ``"xml"``, ``"html"`` or ``"text"`` (default is ``"xml"``). *xml_declaration*, *default_namespace* and *short_empty_elements* has the same meaning as in :meth:`ElementTree.write`. Returns a list of (optionally) encoded strings containing the XML data. It does not guarantee any specific sequence, except that ``b"".join(tostringlist(element)) == tostring(element)``.
pt_br: Створює рядкове представлення елемента XML, включаючи всі піделементи. *element* є екземпляром :class:`Element`. *кодування* [1]_ — вихідне кодування (за замовчуванням — US-ASCII). Використовуйте ``encoding="unicode"``, щоб створити рядок Юнікод (інакше буде згенеровано байтовий рядок). *method* — це ``"xml"``, ``"html"`` або ``"text"`` (за замовчуванням ``"xml"``). *xml_declaration*, *default_namespace* і *short_empty_elements* мають те саме значення, що й у :meth:`ElementTree.write`. Повертає список (необов’язково) закодованих рядків, що містять дані XML. Це не гарантує жодної конкретної послідовності, за винятком того, що ``b"".join(tostringlist(element)) == tostring(element)``.

source: The :func:`tostringlist` function now preserves the attribute order specified by the user.
pt_br: Функція :func:`tostringlist` тепер зберігає порядок атрибутів, указаний користувачем.

source: Parses an XML section from a string constant. This function can be used to embed "XML literals" in Python code. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns an :class:`Element` instance.
pt_br: Розбирає розділ XML із константи рядка. Цю функцію можна використовувати для вбудовування "XML-літералів" у код Python. *текст* — це рядок, що містить дані XML. *parser* є необов’язковим екземпляром парсера. Якщо не вказано, використовується стандартний аналізатор :class:`XMLParser`. Повертає екземпляр :class:`Element`.

source: Parses an XML section from a string constant, and also returns a dictionary which maps from element id:s to elements. *text* is a string containing XML data. *parser* is an optional parser instance. If not given, the standard :class:`XMLParser` parser is used. Returns a tuple containing an :class:`Element` instance and a dictionary.
pt_br: Розбирає розділ XML із константи рядка, а також повертає словник, який відображає ідентифікатори елемента: елементи. *текст* — це рядок, що містить дані XML. *parser* є необов’язковим екземпляром парсера. Якщо не вказано, використовується стандартний аналізатор :class:`XMLParser`. Повертає кортеж, що містить екземпляр :class:`Element` і словник.

source: XInclude support
pt_br: XInclude підтримка

source: This module provides limited support for `XInclude directives <https://www.w3.org/TR/xinclude/>`_, via the :mod:`xml.etree.ElementInclude` helper module. This module can be used to insert subtrees and text strings into element trees, based on information in the tree.
pt_br: Цей модуль надає обмежену підтримку для `XInclude директив <https://www.w3.org/TR/xinclude/>`_ через допоміжний модуль :mod:`xml.etree.ElementInclude`. Цей модуль можна використовувати для вставки піддерев і текстових рядків у дерева елементів на основі інформації в дереві.

source: Here's an example that demonstrates use of the XInclude module. To include an XML document in the current document, use the ``{http://www.w3.org/2001/XInclude}include`` element and set the **parse** attribute to ``"xml"``, and use the **href** attribute to specify the document to include.
pt_br: Ось приклад, який демонструє використання модуля XInclude. Щоб включити XML-документ у поточний документ, використовуйте елемент ``{http://www.w3.org/2001/XInclude}include`` і встановіть атрибут **parse** на ``"xml"`` і використовуйте атрибут **href**, щоб указати документ, який потрібно включити.

source: By default, the **href** attribute is treated as a file name. You can use custom loaders to override this behaviour. Also note that the standard helper does not support XPointer syntax.
pt_br: За замовчуванням атрибут **href** розглядається як ім’я файлу. Ви можете використовувати спеціальні завантажувачі, щоб змінити цю поведінку. Також зауважте, що стандартний помічник не підтримує синтаксис XPointer.

source: To process this file, load it as usual, and pass the root element to the :mod:`xml.etree.ElementTree` module:
pt_br: Щоб обробити цей файл, завантажте його як зазвичай і передайте кореневий елемент модулю :mod:`xml.etree.ElementTree`:

source: The ElementInclude module replaces the ``{http://www.w3.org/2001/XInclude}include`` element with the root element from the **source.xml** document. The result might look something like this:
pt_br: Модуль ElementInclude замінює елемент ``{http://www.w3.org/2001/XInclude}include`` на кореневий елемент із документа **source.xml**. Результат може виглядати приблизно так:

source: If the **parse** attribute is omitted, it defaults to "xml". The href attribute is required.
pt_br: Якщо атрибут **parse** пропущено, за замовчуванням він має значення "xml". Потрібен атрибут href.

source: To include a text document, use the ``{http://www.w3.org/2001/XInclude}include`` element, and set the **parse** attribute to "text":
pt_br: Щоб включити текстовий документ, використовуйте елемент ``{http://www.w3.org/2001/XInclude}include`` і встановіть атрибут **parse** на "text":

source: The result might look something like:
pt_br: Результат може виглядати приблизно так:

source: Default loader. This default loader reads an included resource from disk. *href* is a URL. *parse* is for parse mode either "xml" or "text". *encoding* is an optional text encoding. If not given, encoding is ``utf-8``. Returns the expanded resource. If the parse mode is ``"xml"``, this is an :class:`~xml.etree.ElementTree.Element` instance. If the parse mode is ``"text"``, this is a string. If the loader fails, it can return ``None`` or raise an exception.
pt_br: Загрузчик по умолчанию. Этот загрузчик по умолчанию считывает включенный ресурс с диска. *href* — это URL-адрес. *parse* соответствует режиму анализа «xml» или «text». *encoding* — необязательная кодировка текста. Если не указано, кодировка — «utf-8». Возвращает расширенный ресурс. Если режим анализа ``"xml"``, это экземпляр :class:`~xml.etree.ElementTree.Element`. Если режим анализа ``"текст"``, это строка. Если загрузчик дает сбой, он может вернуть None или вызвать исключение.

source: This function expands XInclude directives in-place in tree pointed by *elem*. *elem* is either the root :class:`~xml.etree.ElementTree.Element` or an :class:`~xml.etree.ElementTree.ElementTree` instance to find such element. *loader* is an optional resource loader. If omitted, it defaults to :func:`default_loader`. If given, it should be a callable that implements the same interface as :func:`default_loader`. *base_url* is base URL of the original file, to resolve relative include file references. *max_depth* is the maximum number of recursive inclusions. Limited to reduce the risk of malicious content explosion. Pass ``None`` to disable the limitation.
pt_br: Эта функция расширяет директивы XInclude на месте в дереве, на которое указывает *elem*. *elem* является либо корневым экземпляром :class:`~xml.etree.ElementTree.Element`, либо экземпляром :class:`~xml.etree.ElementTree.ElementTree` для поиска такого элемента. *loader* — дополнительный загрузчик ресурсов. Если этот параметр опущен, по умолчанию используется :func:`default_loader`. Если задано, это должен быть вызываемый объект, реализующий тот же интерфейс, что и :func:`default_loader`. *base_url* — это базовый URL-адрес исходного файла для разрешения относительных ссылок на включаемые файлы. *max_глубина* — максимальное количество рекурсивных включений. Ограничено, чтобы снизить риск взрыва вредоносного контента. Передайте None, чтобы отключить ограничение.

source: Added the *base_url* and *max_depth* parameters.
pt_br: Добавлены параметры *base_url* и ​​*max_length*.

source: Element Objects
pt_br: Об'єкти елементів

source: Element class. This class defines the Element interface, and provides a reference implementation of this interface.
pt_br: Клас елемента. Цей клас визначає інтерфейс Element і забезпечує еталонну реалізацію цього інтерфейсу.

source: The element name, attribute names, and attribute values can be either bytestrings or Unicode strings. *tag* is the element name. *attrib* is an optional dictionary, containing element attributes. *extra* contains additional attributes, given as keyword arguments.
pt_br: Ім’я елемента, назви атрибутів і значення атрибутів можуть бути байтовими рядками або рядками Unicode. *тег* — це назва елемента. *attrib* — необов’язковий словник, що містить атрибути елемента. *extra* містить додаткові атрибути, надані як аргументи ключового слова.

source: A string identifying what kind of data this element represents (the element type, in other words).
pt_br: Рядок, що визначає, який тип даних представляє цей елемент (іншими словами, тип елемента).

source: These attributes can be used to hold additional data associated with the element. Their values are usually strings but may be any application-specific object. If the element is created from an XML file, the *text* attribute holds either the text between the element's start tag and its first child or end tag, or ``None``, and the *tail* attribute holds either the text between the element's end tag and the next tag, or ``None``. For the XML data
pt_br: Ці атрибути можна використовувати для зберігання додаткових даних, пов’язаних з елементом. Їх значення зазвичай є рядками, але можуть бути будь-якими об’єктами, що стосуються конкретної програми. Якщо елемент створено з файлу XML, атрибут *text* містить або текст між початковим тегом елемента та його першим дочірнім або кінцевим тегом, або ``None``, а атрибут *tail* містить або текст між кінцевий тег елемента та наступний тег або ``None``. Для даних XML

source: the *a* element has ``None`` for both *text* and *tail* attributes, the *b* element has *text* ``"1"`` and *tail* ``"4"``, the *c* element has *text* ``"2"`` and *tail* ``None``, and the *d* element has *text* ``None`` and *tail* ``"3"``.
pt_br: елемент *a* має ``None`` як для атрибутів *text*, так і для *tail*, елемент *b* має *text* ``"1"`` і *tail* ``"4"``, елемент *c* має *text* ``"2"`` і *tail* ``None``, а елемент *d* має *text* ``None`` і *tail* ``"3"``.

source: To collect the inner text of an element, see :meth:`itertext`, for example ``"".join(element.itertext())``.
pt_br: Щоб зібрати внутрішній текст елемента, перегляньте :meth:`itertext`, наприклад ``"".join(element.itertext())``.

source: Applications may store arbitrary objects in these attributes.
pt_br: Програми можуть зберігати довільні об’єкти в цих атрибутах.

source: A dictionary containing the element's attributes. Note that while the *attrib* value is always a real mutable Python dictionary, an ElementTree implementation may choose to use another internal representation, and create the dictionary only if someone asks for it. To take advantage of such implementations, use the dictionary methods below whenever possible.
pt_br: Словник, що містить атрибути елемента. Зауважте, що хоча значення *attrib* завжди є справжнім змінним словником Python, реалізація ElementTree може використовувати інше внутрішнє представлення та створювати словник, лише якщо хтось про це попросить. Щоб скористатися перевагами таких реалізацій, використовуйте наведені нижче методи словника, коли це можливо.

source: The following dictionary-like methods work on the element attributes.
pt_br: Наступні методи, подібні до словника, працюють з атрибутами елемента.

source: Resets an element. This function removes all subelements, clears all attributes, and sets the text and tail attributes to ``None``.
pt_br: Скидає елемент. Ця функція видаляє всі піделементи, очищає всі атрибути та встановлює для атрибутів text і tail значення ``None``.

source: Gets the element attribute named *key*.
pt_br: Отримує атрибут елемента з назвою *key*.

source: Returns the attribute value, or *default* if the attribute was not found.
pt_br: Повертає значення атрибута або *default*, якщо атрибут не знайдено.

source: Returns the element attributes as a sequence of (name, value) pairs. The attributes are returned in an arbitrary order.
pt_br: Повертає атрибути елемента як послідовність пар (ім’я, значення). Атрибути повертаються в довільному порядку.

source: Returns the elements attribute names as a list. The names are returned in an arbitrary order.
pt_br: Повертає назви атрибутів елементів у вигляді списку. Імена повертаються в довільному порядку.

source: Set the attribute *key* on the element to *value*.
pt_br: Установіть для атрибута *key* елемента значення *value*.

source: The following methods work on the element's children (subelements).
pt_br: Наступні методи працюють над дочірніми елементами (піделементами).
