Repository: python/python-docs-pt-br
Catalog: library/xml.po
Languages: pt_br

source: XML Processing Modules
pt_br: Módulos de Processamento de XML

source: **Source code:** :source:`Lib/xml/`
pt_br: **Código-fonte:** :source:`Lib/xml/`

source: Python's interfaces for processing XML are grouped in the ``xml`` package.
pt_br: As interfaces do Python para processar XML estão agrupadas no pacote ``xml``.

source: It is important to note that modules in the :mod:`xml` package require that there be at least one SAX-compliant XML parser available. The Expat parser is included with Python, so the :mod:`xml.parsers.expat` module will always be available.
pt_br: É importante observar que os módulos no pacote :mod:`xml` exigem que está disponível pelo menos um analisador sintático XML compatível com SAX. O analisador Expat está incluído no Python, então o módulo :mod:`xml.parsers.expat` estará sempre disponível.

source: The documentation for the :mod:`xml.dom` and :mod:`xml.sax` packages are the definition of the Python bindings for the DOM and SAX interfaces.
pt_br: A documentação para os pacotes :mod:`xml.dom` e :mod:`xml.sax` são a definição das ligações Python para as interfaces DOM e SAX.

source: The XML handling submodules are:
pt_br: Os submódulos de manipulação XML são:

source: :mod:`xml.etree.ElementTree`: the ElementTree API, a simple and lightweight XML processor
pt_br: :mod:`xml.etree.ElementTree`: a API de ElementTree, um processador XML simples e leve

source: :mod:`xml.dom`: the DOM API definition
pt_br: :mod:`xml.dom`: a definição da API de DOM

source: :mod:`xml.dom.minidom`: a minimal DOM implementation
pt_br: :mod:`xml.dom.minidom`: uma implementação mínima do DOM

source: :mod:`xml.dom.pulldom`: support for building partial DOM trees
pt_br: suporte para construir árvores parciais de DOM no :mod:`xml.dom.pulldom`

source: :mod:`xml.sax`: SAX2 base classes and convenience functions
pt_br: :mod:`xml.sax`: Classe base SAX2 e funções de conveniência

source: :mod:`xml.parsers.expat`: the Expat parser binding
pt_br: :mod:`xml.parsers.expat`: a ligação do analisador sintático Expat

source: XML vulnerabilities
pt_br: Vulnerabilidades XML

source: The XML processing modules are not secure against maliciously constructed data. An attacker can abuse XML features to carry out denial of service attacks, access local files, generate network connections to other machines, or circumvent firewalls.
pt_br: Os módulos de processamento XML não são seguros contra dados maliciosamente construídos. Um atacante pode abusar dos recursos XML para realizar ataques de negação de serviço, acessar arquivos locais, gerar conexões de rede com outras máquinas ou contornar firewalls.

source: The following table gives an overview of the known attacks and whether the various modules are vulnerable to them.
pt_br: A tabela a seguir fornece uma visão geral dos ataques conhecidos e se os vários módulos são vulneráveis a eles.

source: kind
pt_br: tipo

source: **Vulnerable** (1)
pt_br: **Vulnerável** (1)

source: Safe (5)
pt_br: Seguro (5)

source: Safe (2)
pt_br: Seguro (2)

source: Safe (3)
pt_br: Seguro (3)

source: Safe (4)
pt_br: Seguro (4)

source: Safe
pt_br: Seguro

source: **Vulnerable**
pt_br: **Vulnerável**

source: :mod:`xml.dom.minidom` doesn't expand external entities and simply returns the unexpanded entity verbatim.
pt_br: :mod:`xml.dom.minidom` não expande entidades externas e simplesmente retorna a entidade não expandida literalmente.

source: Since Python 3.7.1, external general entities are no longer processed by default.
pt_br: Desde o Python 3.7.1, entidades gerais externas não são mais processadas por padrão.

source: The `Billion Laughs`_ attack -- also known as exponential entity expansion -- uses multiple levels of nested entities. Each entity refers to another entity several times, and the final entity definition contains a small string. The exponential expansion results in several gigabytes of text and consumes lots of memory and CPU time.
pt_br: O ataque `Billion Laughs`_ (bilhões de risadas, em português) - também conhecido como "exponential entity expansion" (expansão exponencial de entidades, em português) - usa vários níveis de entidades aninhadas. Cada entidade se refere a outra entidade várias vezes, e a definição final da entidade contém uma pequena string. A expansão exponencial resulta em vários gigabytes de texto e consome muita memória e tempo de CPU.

source: Entity declarations can contain more than just text for replacement. They can also point to external resources or local files. The XML parser accesses the resource and embeds the content into the XML document.
pt_br: Declarações de entidade podem conter mais do que apenas texto para substituição. Elas também podem apontar para recursos externos ou arquivos locais. O analisador sintático XML acessa o recurso e incorpora o conteúdo no documento XML.

source: Some XML libraries like Python's :mod:`xml.dom.pulldom` retrieve document type definitions from remote or local locations. The feature has similar implications as the external entity expansion issue.
pt_br: Algumas bibliotecas XML, como a :mod:`xml.dom.pulldom` do Python, recuperam definições de tipo de documento de locais remotos ou locais. O recurso tem implicações semelhantes ao problema de expansão de entidade externa.

source: Decompression bombs (aka `ZIP bomb`_) apply to all XML libraries that can parse compressed XML streams such as gzipped HTTP streams or LZMA-compressed files. For an attacker it can reduce the amount of transmitted data by three magnitudes or more.
pt_br: "Bombas de descompressão" em uma tradução livre. Também conhecidas como `ZIP bomb`_, se aplicam a todas as bibliotecas XML que podem analisar fluxos XML comprimidos, como fluxos de HTTP compactados com gzip ou arquivos comprimidos com LZMA. Para um atacante, isso pode reduzir a quantidade de dados transmitidos em três magnitudes ou mais.

source: The documentation for `defusedxml`_ on PyPI has further information about all known attack vectors with examples and references.
pt_br: A documentação para `defusedxml`_ no PyPI tem mais informações sobre todos os vetores de ataque conhecidos, com exemplos e referências.

source: `defusedxml`_ is a pure Python package with modified subclasses of all stdlib XML parsers that prevent any potentially malicious operation. Use of this package is recommended for any server code that parses untrusted XML data. The package also ships with example exploits and extended documentation on more XML exploits such as XPath injection.
pt_br: `defusedxml`_ é um pacote Python puro com subcláusulas modificadas de todos os analisadores sintáticos XML da biblioteca padrão que impedem qualquer operação potencialmente maliciosa. O uso deste pacote é recomendado para qualquer código de servidor que analise dados XML não confiáveis. O pacote também inclui exemplos de explorações e documentação estendida sobre mais explorações XML, como injeção de XPath.
