Repository: python/python-docs-pt-br
Catalog: library/xml.dom.po
Languages: pt_br

source: Replace an existing node with a new node. It must be the case that *oldChild* is a child of this node; if not, :exc:`ValueError` is raised.
pt_br: Замініть існуючий вузол на новий. Має бути так, що *oldChild* є дочірнім для цього вузла; якщо ні, виникає :exc:`ValueError`.

source: Join adjacent text nodes so that all stretches of text are stored as single :class:`Text` instances. This simplifies processing text from a DOM tree for many applications.
pt_br: Об’єднайте сусідні текстові вузли, щоб усі фрагменти тексту зберігалися як окремі екземпляри :class:`Text`. Це спрощує обробку тексту з дерева DOM для багатьох програм.

source: Clone this node. Setting *deep* means to clone all child nodes as well. This returns the clone.
pt_br: Клонуйте цей вузол. Установка *deep* також означає клонування всіх дочірніх вузлів. Це повертає клон.

source: NodeList Objects
pt_br: Objetos NodeList

source: A :class:`NodeList` represents a sequence of nodes. These objects are used in two ways in the DOM Core recommendation: an :class:`Element` object provides one as its list of child nodes, and the :meth:`getElementsByTagName` and :meth:`getElementsByTagNameNS` methods of :class:`Node` return objects with this interface to represent query results.
pt_br: :class:`NodeList` представляє послідовність вузлів. У рекомендації DOM Core ці об’єкти використовуються двома способами: об’єкт :class:`Element` надає один як свій список дочірніх вузлів, а методи :meth:`getElementsByTagName` і :meth:`getElementsByTagNameNS` :class:`Node` повертає об’єкти з цим інтерфейсом для представлення результатів запиту.

source: The DOM Level 2 recommendation defines one method and one attribute for these objects:
pt_br: Рекомендація DOM рівня 2 визначає один метод і один атрибут для цих об’єктів:

source: Return the *i*'th item from the sequence, if there is one, or ``None``. The index *i* is not allowed to be less than zero or greater than or equal to the length of the sequence.
pt_br: Повертає *i*-й елемент із послідовності, якщо він є, або ``None``. Індекс *i* не може бути меншим за нуль або більшим або дорівнювати довжині послідовності.

source: The number of nodes in the sequence.
pt_br: Кількість вузлів у послідовності.

source: In addition, the Python DOM interface requires that some additional support is provided to allow :class:`NodeList` objects to be used as Python sequences. All :class:`NodeList` implementations must include support for :meth:`~object.__len__` and :meth:`~object.__getitem__`; this allows iteration over the :class:`NodeList` in :keyword:`for` statements and proper support for the :func:`len` built-in function.
pt_br: Крім того, для інтерфейсу DOM Python потрібна додаткова підтримка, щоб об’єкти :class:`NodeList` могли використовуватися як послідовності Python. Усі реалізації :class:`NodeList` повинні включати підтримку :meth:`~object.__len__` і :meth:`~object.__getitem__`; це дозволяє ітерацію по :class:`NodeList` в :keyword:`for` операторах і належну підтримку для :func:`len` вбудованої функції.

source: If a DOM implementation supports modification of the document, the :class:`NodeList` implementation must also support the :meth:`~object.__setitem__` and :meth:`~object.__delitem__` methods.
pt_br: Якщо реалізація DOM підтримує модифікацію документа, реалізація :class:`NodeList` також повинна підтримувати методи :meth:`~object.__setitem__` і :meth:`~object.__delitem__`.

source: DocumentType Objects
pt_br: Об’єкти DocumentType

source: Information about the notations and entities declared by a document (including the external subset if the parser uses it and can provide the information) is available from a :class:`DocumentType` object. The :class:`DocumentType` for a document is available from the :class:`Document` object's :attr:`doctype` attribute; if there is no ``DOCTYPE`` declaration for the document, the document's :attr:`doctype` attribute will be set to ``None`` instead of an instance of this interface.
pt_br: Інформація про нотації та сутності, оголошені в документі (включаючи зовнішню підмножину, якщо аналізатор використовує її та може надати інформацію), доступна з об’єкта :class:`DocumentType`. :class:`DocumentType` для документа доступний з атрибута :attr:`doctype` об’єкта :class:`Document`; якщо для документа немає оголошення ``DOCTYPE``, атрибут :attr:`doctype` документа буде встановлено на ``None`` замість екземпляра цього інтерфейсу.

source: :class:`DocumentType` is a specialization of :class:`Node`, and adds the following attributes:
pt_br: :class:`DocumentType` є спеціалізацією :class:`Node` і додає такі атрибути:

source: The public identifier for the external subset of the document type definition. This will be a string or ``None``.
pt_br: Загальнодоступний ідентифікатор для зовнішньої підмножини визначення типу документа. Це буде рядок або ``None``.

source: The system identifier for the external subset of the document type definition. This will be a URI as a string, or ``None``.
pt_br: Системний ідентифікатор для зовнішньої підмножини визначення типу документа. Це буде URI у вигляді рядка або ``None``.

source: A string giving the complete internal subset from the document. This does not include the brackets which enclose the subset. If the document has no internal subset, this should be ``None``.
pt_br: Рядок, що містить повну внутрішню частину документа. Це не включає дужки, які містять підмножину. Якщо документ не має внутрішньої підмножини, це має бути ``None``.

source: The name of the root element as given in the ``DOCTYPE`` declaration, if present.
pt_br: Ім’я кореневого елемента, указане в декларації ``DOCTYPE``, якщо воно є.

source: This is a :class:`NamedNodeMap` giving the definitions of external entities. For entity names defined more than once, only the first definition is provided (others are ignored as required by the XML recommendation). This may be ``None`` if the information is not provided by the parser, or if no entities are defined.
pt_br: Це :class:`NamedNodeMap`, що дає визначення зовнішніх сутностей. Для імен сутностей, визначених більше одного разу, надається лише перше визначення (інші ігноруються відповідно до рекомендацій XML). Це може бути ``None``, якщо інформація не надається синтаксичним аналізатором, або якщо жодні сутності не визначені.

source: This is a :class:`NamedNodeMap` giving the definitions of notations. For notation names defined more than once, only the first definition is provided (others are ignored as required by the XML recommendation). This may be ``None`` if the information is not provided by the parser, or if no notations are defined.
pt_br: Це :class:`NamedNodeMap`, що дає визначення нотацій. Для імен нотацій, визначених більше одного разу, надається лише перше визначення (інші ігноруються відповідно до рекомендацій XML). Це може бути ``None``, якщо інформація не надається синтаксичним аналізатором або якщо не визначено нотацій.

source: Document Objects
pt_br: Об'єкти документа

source: A :class:`Document` represents an entire XML document, including its constituent elements, attributes, processing instructions, comments etc. Remember that it inherits properties from :class:`Node`.
pt_br: :class:`Document` представляє весь XML-документ, включаючи його складові елементи, атрибути, інструкції з обробки, коментарі тощо. Пам’ятайте, що він успадковує властивості від :class:`Node`.

source: The one and only root element of the document.
pt_br: Єдиний кореневий елемент документа.

source: Create and return a new element node. The element is not inserted into the document when it is created. You need to explicitly insert it with one of the other methods such as :meth:`insertBefore` or :meth:`appendChild`.
pt_br: Створити та повернути новий вузол елемента. Елемент не вставляється в документ під час його створення. Вам потрібно явно вставити його за допомогою одного з інших методів, наприклад :meth:`insertBefore` або :meth:`appendChild`.

source: Create and return a new element with a namespace. The *tagName* may have a prefix. The element is not inserted into the document when it is created. You need to explicitly insert it with one of the other methods such as :meth:`insertBefore` or :meth:`appendChild`.
pt_br: Створіть і поверніть новий елемент із простором імен. *tagName* може мати префікс. Елемент не вставляється в документ під час його створення. Вам потрібно явно вставити його за допомогою одного з інших методів, наприклад :meth:`insertBefore` або :meth:`appendChild`.

source: Create and return a text node containing the data passed as a parameter. As with the other creation methods, this one does not insert the node into the tree.
pt_br: Створіть і поверніть текстовий вузол, що містить дані, передані як параметр. Як і в інших методах створення, цей не вставляє вузол у дерево.

source: Create and return a comment node containing the data passed as a parameter. As with the other creation methods, this one does not insert the node into the tree.
pt_br: Створіть і поверніть вузол коментаря, що містить дані, передані як параметр. Як і в інших методах створення, цей не вставляє вузол у дерево.

source: Create and return a processing instruction node containing the *target* and *data* passed as parameters. As with the other creation methods, this one does not insert the node into the tree.
pt_br: Створіть і поверніть вузол інструкцій обробки, що містить *target* і *data*, передані як параметри. Як і в інших методах створення, цей не вставляє вузол у дерево.

source: Create and return an attribute node. This method does not associate the attribute node with any particular element. You must use :meth:`setAttributeNode` on the appropriate :class:`Element` object to use the newly created attribute instance.
pt_br: Створення та повернення вузла атрибута. Цей метод не пов’язує вузол атрибута з будь-яким конкретним елементом. Ви повинні використовувати :meth:`setAttributeNode` у відповідному об’єкті :class:`Element`, щоб використовувати щойно створений екземпляр атрибута.

source: Create and return an attribute node with a namespace. The *tagName* may have a prefix. This method does not associate the attribute node with any particular element. You must use :meth:`setAttributeNode` on the appropriate :class:`Element` object to use the newly created attribute instance.
pt_br: Створіть і поверніть вузол атрибута з простором імен. *tagName* може мати префікс. Цей метод не пов’язує вузол атрибута з будь-яким конкретним елементом. Ви повинні використовувати :meth:`setAttributeNode` у відповідному об’єкті :class:`Element`, щоб використовувати щойно створений екземпляр атрибута.

source: Search for all descendants (direct children, children's children, etc.) with a particular element type name.
pt_br: Пошук усіх нащадків (прямих дітей, дітей дітей тощо) з певним ім’ям типу елемента.

source: Search for all descendants (direct children, children's children, etc.) with a particular namespace URI and localname. The localname is the part of the namespace after the prefix.
pt_br: Пошук усіх нащадків (прямих дітей, дітей дітей тощо) з певним URI простору імен і локальним іменем. Локальна назва - це частина простору імен після префікса.

source: Element Objects
pt_br: Об'єкти елементів

source: :class:`Element` is a subclass of :class:`Node`, so inherits all the attributes of that class.
pt_br: :class:`Element` є підкласом :class:`Node`, тому успадковує всі атрибути цього класу.

source: The element type name. In a namespace-using document it may have colons in it. The value is a string.
pt_br: Назва типу елемента. У документі, що використовує простір імен, у ньому можуть бути двокрапки. Значенням є рядок.

source: Same as equivalent method in the :class:`Document` class.
pt_br: Те саме, що еквівалентний метод у класі :class:`Document`.

source: Return ``True`` if the element has an attribute named by *name*.
pt_br: Повертає ``True``, якщо елемент має атрибут із назвою *name*.

source: Return ``True`` if the element has an attribute named by *namespaceURI* and *localName*.
pt_br: Повертає ``True``, якщо елемент має атрибут, названий *namespaceURI* і *localName*.

source: Return the value of the attribute named by *name* as a string. If no such attribute exists, an empty string is returned, as if the attribute had no value.
pt_br: Повертає значення атрибута з іменем *name* у вигляді рядка. Якщо такий атрибут не існує, повертається порожній рядок, як якщо б атрибут не мав значення.

source: Return the :class:`Attr` node for the attribute named by *attrname*.
pt_br: Повертає вузол :class:`Attr` для атрибута, названого *attrname*.

source: Return the value of the attribute named by *namespaceURI* and *localName* as a string. If no such attribute exists, an empty string is returned, as if the attribute had no value.
pt_br: Повертає значення атрибута з назвою *namespaceURI* і *localName* як рядок. Якщо такий атрибут не існує, повертається порожній рядок, як якщо б атрибут не мав значення.

source: Return an attribute value as a node, given a *namespaceURI* and *localName*.
pt_br: Повертає значення атрибута як вузол із заданим *namespaceURI* і *localName*.

source: Remove an attribute by name. If there is no matching attribute, a :exc:`NotFoundErr` is raised.
pt_br: Видалити атрибут за назвою. Якщо відповідного атрибута немає, виникає помилка :exc:`NotFoundErr`.

source: Remove and return *oldAttr* from the attribute list, if present. If *oldAttr* is not present, :exc:`NotFoundErr` is raised.
pt_br: Видаліть і поверніть *oldAttr* зі списку атрибутів, якщо він є. Якщо *oldAttr* відсутній, виникає помилка :exc:`NotFoundErr`.

source: Remove an attribute by name. Note that it uses a localName, not a qname. No exception is raised if there is no matching attribute.
pt_br: Видалити атрибут за назвою. Зверніть увагу, що він використовує localName, а не qname. Жодного винятку не виникає, якщо немає відповідного атрибута.

source: Set an attribute value from a string.
pt_br: Установіть значення атрибута з рядка.

source: Add a new attribute node to the element, replacing an existing attribute if necessary if the :attr:`name` attribute matches. If a replacement occurs, the old attribute node will be returned. If *newAttr* is already in use, :exc:`InuseAttributeErr` will be raised.
pt_br: Додайте новий вузол атрибута до елемента, замінивши існуючий атрибут, якщо необхідно, якщо атрибут :attr:`name` збігається. Якщо відбудеться заміна, буде повернено старий вузол атрибута. Якщо *newAttr* вже використовується, буде викликано :exc:`InuseAttributeErr`.

source: Add a new attribute node to the element, replacing an existing attribute if necessary if the :attr:`namespaceURI` and :attr:`localName` attributes match. If a replacement occurs, the old attribute node will be returned. If *newAttr* is already in use, :exc:`InuseAttributeErr` will be raised.
pt_br: Додайте новий вузол атрибута до елемента, замінивши існуючий атрибут, якщо необхідно, якщо атрибути :attr:`namespaceURI` і :attr:`localName` збігаються. Якщо відбудеться заміна, буде повернено старий вузол атрибута. Якщо *newAttr* вже використовується, буде викликано :exc:`InuseAttributeErr`.

source: Set an attribute value from a string, given a *namespaceURI* and a *qname*. Note that a qname is the whole attribute name. This is different than above.
pt_br: Установіть значення атрибута з рядка, заданого *namespaceURI* і *qname*. Зауважте, що qname — це повна назва атрибута. Це відрізняється від вищезазначеного.

source: Attr Objects
pt_br: Об'єкти Attr

source: :class:`Attr` inherits from :class:`Node`, so inherits all its attributes.
pt_br: :class:`Attr` успадковує :class:`Node`, тому успадковує всі його атрибути.

source: The attribute name. In a namespace-using document it may include a colon.
pt_br: Назва атрибута. У документі, що використовує простір імен, він може містити двокрапку.

source: The part of the name following the colon if there is one, else the entire name. This is a read-only attribute.
pt_br: Частина назви після двокрапки, якщо вона є, інакше повна назва. Це атрибут лише для читання.

source: The part of the name preceding the colon if there is one, else the empty string.
pt_br: Частина назви перед двокрапкою, якщо вона є, інакше порожній рядок.

source: The text value of the attribute. This is a synonym for the :attr:`nodeValue` attribute.
pt_br: Текстове значення атрибута. Це синонім атрибута :attr:`nodeValue`.

source: NamedNodeMap Objects
pt_br: Об’єкти NamedNodeMap

source: :class:`NamedNodeMap` does *not* inherit from :class:`Node`.
pt_br: :class:`NamedNodeMap` *не* успадковує :class:`Node`.

source: The length of the attribute list.
pt_br: Довжина списку атрибутів.

source: Return an attribute with a particular index. The order you get the attributes in is arbitrary but will be consistent for the life of a DOM. Each item is an attribute node. Get its value with the :attr:`value` attribute.
pt_br: Повертає атрибут із певним індексом. Порядок, у якому ви отримуєте атрибути, є довільним, але буде незмінним протягом життя DOM. Кожен елемент є вузлом атрибута. Отримайте його значення за допомогою атрибута :attr:`value`.

source: Comment Objects
pt_br: Об’єкти коментарів

source: :class:`Comment` represents a comment in the XML document. It is a subclass of :class:`Node`, but cannot have child nodes.
pt_br: :class:`Comment` представляє коментар у документі XML. Це підклас :class:`Node`, але не може мати дочірні вузли.

source: The content of the comment as a string. The attribute contains all characters between the leading ``<!-``\ ``-`` and trailing ``-``\ ``->``, but does not include them.
pt_br: Вміст коментаря у вигляді рядка. Атрибут містить усі символи між початковими ``<!-``\ ``-`` and trailing ``-``\ ``->``, але не включає їх.

source: Text and CDATASection Objects
pt_br: Текст і об’єкти CDATASection

source: The :class:`Text` interface represents text in the XML document. If the parser and DOM implementation support the DOM's XML extension, portions of the text enclosed in CDATA marked sections are stored in :class:`CDATASection` objects. These two interfaces are identical, but provide different values for the :attr:`nodeType` attribute.
pt_br: Інтерфейс :class:`Text` представляє текст у документі XML. Якщо синтаксичний аналізатор і реалізація DOM підтримують розширення XML DOM, частини тексту, укладені в розділи, позначені CDATA, зберігаються в об’єктах :class:`CDATASection`. Ці два інтерфейси ідентичні, але надають різні значення для атрибута :attr:`nodeType`.

source: These interfaces extend the :class:`Node` interface. They cannot have child nodes.
pt_br: Ці інтерфейси розширюють інтерфейс :class:`Node`. Вони не можуть мати дочірні вузли.

source: The content of the text node as a string.
pt_br: Вміст текстового вузла у вигляді рядка.

source: The use of a :class:`CDATASection` node does not indicate that the node represents a complete CDATA marked section, only that the content of the node was part of a CDATA section. A single CDATA section may be represented by more than one node in the document tree. There is no way to determine whether two adjacent :class:`CDATASection` nodes represent different CDATA marked sections.
pt_br: Використання вузла :class:`CDATASection` не означає, що вузол представляє повний розділ, позначений CDATA, лише те, що вміст вузла був частиною розділу CDATA. Один розділ CDATA може бути представлений декількома вузлами в дереві документів. Немає способу визначити, чи два суміжні вузли :class:`CDATASection` представляють різні розділи, позначені CDATA.

source: ProcessingInstruction Objects
pt_br: Objetos ProcessingInstruction

source: Represents a processing instruction in the XML document; this inherits from the :class:`Node` interface and cannot have child nodes.
pt_br: Представляє інструкцію обробки в документі XML; це успадковує інтерфейс :class:`Node` і не може мати дочірні вузли.

source: The content of the processing instruction up to the first whitespace character. This is a read-only attribute.
pt_br: Вміст інструкції обробки до першого пробілу. Це атрибут лише для читання.

source: The content of the processing instruction following the first whitespace character.
pt_br: Вміст інструкції обробки після першого пробілу.

source: Exceptions
pt_br: Exceções

source: The DOM Level 2 recommendation defines a single exception, :exc:`DOMException`, and a number of constants that allow applications to determine what sort of error occurred. :exc:`DOMException` instances carry a :attr:`code` attribute that provides the appropriate value for the specific exception.
pt_br: Рекомендація DOM рівня 2 визначає єдиний виняток, :exc:`DOMException`, і ряд констант, які дозволяють програмам визначити, який тип помилки сталася. Екземпляри :exc:`DOMException` містять атрибут :attr:`code`, який надає відповідне значення для конкретного винятку.

source: The Python DOM interface provides the constants, but also expands the set of exceptions so that a specific exception exists for each of the exception codes defined by the DOM. The implementations must raise the appropriate specific exception, each of which carries the appropriate value for the :attr:`code` attribute.
pt_br: Інтерфейс Python DOM надає константи, але також розширює набір винятків, щоб для кожного з кодів винятків, визначених DOM, існував окремий виняток. Реалізації повинні викликати відповідні специфічні винятки, кожне з яких несе відповідне значення для атрибута :attr:`code`.

source: Base exception class used for all specific DOM exceptions. This exception class cannot be directly instantiated.
pt_br: Базовий клас винятків, який використовується для всіх конкретних винятків DOM. Цей клас винятків не можна створити безпосередньо.

source: Raised when a specified range of text does not fit into a string. This is not known to be used in the Python DOM implementations, but may be received from DOM implementations not written in Python.
pt_br: Викликається, коли вказаний діапазон тексту не вміщується в рядок. Відомо, що це не використовується в реалізаціях Python DOM, але може бути отримано з реалізацій DOM, не написаних на Python.

source: Raised when an attempt is made to insert a node where the node type is not allowed.
pt_br: Викликається під час спроби вставити вузол у недозволений тип вузла.

source: Raised when an index or size parameter to a method is negative or exceeds the allowed values.
pt_br: Викликається, коли параметр індексу або розміру методу від’ємний або перевищує допустимі значення.

source: Raised when an attempt is made to insert an :class:`Attr` node that is already present elsewhere in the document.
pt_br: Викликається, коли робиться спроба вставити вузол :class:`Attr`, який уже присутній в іншому місці документа.

source: Raised if a parameter or an operation is not supported on the underlying object.
pt_br: Викликається, якщо параметр або операція не підтримується на базовому об’єкті.

source: This exception is raised when a string parameter contains a character that is not permitted in the context it's being used in by the XML 1.0 recommendation. For example, attempting to create an :class:`Element` node with a space in the element type name will cause this error to be raised.
pt_br: Цей виняток виникає, коли рядковий параметр містить символ, який заборонено в контексті, у якому він використовується рекомендацією XML 1.0. Наприклад, спроба створити вузол :class:`Element` із пробілом у назві типу елемента призведе до появи цієї помилки.

source: Raised when an attempt is made to modify the type of a node.
pt_br: Викликається під час спроби змінити тип вузла.

source: Raised when an attempt is made to use an object that is not defined or is no longer usable.
pt_br: Викликається, коли робиться спроба використати об’єкт, який не визначено або більше не можна використовувати.
