Repository: python/python-docs-pt-br
Catalog: library/xml.etree.elementtree.po
Languages: pt_br

source: :mod:`!xml.etree.ElementTree` --- The ElementTree XML API
pt_br: :mod:`!xml.etree.ElementTree` --- A API XML ElementTree

source: **Source code:** :source:`Lib/xml/etree/ElementTree.py`
pt_br: **Código-fonte:** :source:`Lib/xml/etree/ElementTree.py`

source: The :mod:`xml.etree.ElementTree` module implements a simple and efficient API for parsing and creating XML data.
pt_br: O módulo :mod:`xml.etree.ElementTree` implementa uma API simples e eficiente para análise e criação de dados XML.

source: This module will use a fast implementation whenever available.
pt_br: Este módulo usará uma implementação rápida sempre que disponível.

source: The :mod:`!xml.etree.cElementTree` module is deprecated.
pt_br: O módulo :mod:`!xml.etree.cElementTree` foi descontinuado.

source: The :mod:`xml.etree.ElementTree` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
pt_br: O módulo :mod:`xml.etree.cElementTree` não é seguro contra dados maliciosamente construídos. Se você precisa analisar dados não-confiáveis ou não-autenticados seja :ref:`xml-vulnerabilities`.

source: This is a short tutorial for using :mod:`xml.etree.ElementTree` (``ET`` in short). The goal is to demonstrate some of the building blocks and basic concepts of the module.
pt_br: Esse é um tutorial curto para usar :mod:`xml.etree.ElementTree` (``ET`` na versão resumida). O objetivo é demonstrar alguns conceitos básicos e trechos de códigos do módulo.

source: XML tree and elements
pt_br: Árvore e elementos XML

source: XML is an inherently hierarchical data format, and the most natural way to represent it is with a tree. ``ET`` has two classes for this purpose - :class:`ElementTree` represents the whole XML document as a tree, and :class:`Element` represents a single node in this tree. Interactions with the whole document (reading and writing to/from files) are usually done on the :class:`ElementTree` level. Interactions with a single XML element and its sub-elements are done on the :class:`Element` level.
pt_br: XML é um formato de dados estritamente hierárquico, e a maneira mais natural de representá-lo é como uma árvore. ``ET`` possui duas classes para esse propósito - :class:`ElementTree` representa todo o documento XML como uma árvore e :class:`Element` representa um único nó desta árvore. Interações com o documento inteiro (ler e escrever de/para arquivos) são frequentemente feitos em nível de :class:`ElementTree`. Interações com um único elemento XML e seus subelementos são feitos a nível de :class:`Element` .

source: Parsing XML
pt_br: Analisando XML

source: We'll be using the fictive :file:`country_data.xml` XML document as the sample data for this section:
pt_br: Usaremos o documento XML fictício :file:`country_data.xml` como dados de amostra para esta seção:

source: We can import this data by reading from a file::
pt_br: Nós podemos importar esses dados lendo de um arquivo::

source: Or directly from a string::
pt_br: Ou diretamente de uma string::

source: :func:`fromstring` parses XML from a string directly into an :class:`Element`, which is the root element of the parsed tree. Other parsing functions may create an :class:`ElementTree`. Check the documentation to be sure.
pt_br: :func:`fromstring` obtém o XML de uma string e armazena em um :class:`Element`, que será o elemento raiz dessa árvore. Outras funções de análise sintática podem criar um :class:`ElementTree`. Cheque a documentação para se certificar sobre qual dado será retornado.

source: As an :class:`Element`, ``root`` has a tag and a dictionary of attributes::
pt_br: Assim como um :class:`Element`, ``root`` tem uma tag e um dicionário de atributos::

source: It also has children nodes over which we can iterate::
pt_br: Ele também tem nós filhos sobre os quais nós podemos iterar::

source: Children are nested, and we can access specific child nodes by index::
pt_br: Nós filhos são os mais próximos, e nós podemos acessar nós específicos por índices::

source: Not all elements of the XML input will end up as elements of the parsed tree. Currently, this module skips over any XML comments, processing instructions, and document type declarations in the input. Nevertheless, trees built using this module's API rather than parsing from XML text can have comments and processing instructions in them; they will be included when generating XML output. A document type declaration may be accessed by passing a custom :class:`TreeBuilder` instance to the :class:`XMLParser` constructor.
pt_br: Nem todos os elementos da entrada XML acabarão como elementos da árvore analisada. Atualmente, este módulo ignora quaisquer comentários XML, instruções de processamento e declarações de tipo de documento na entrada. No entanto, árvores construídas usando a API deste módulo, em vez de serem analisadas a partir de texto XML, podem conter comentários e instruções de processamento; eles serão incluídos ao gerar a saída XML. Uma declaração de tipo de documento pode ser acessada passando uma instância personalizada :class:`TreeBuilder` para o construtor :class:`XMLParser`.

source: Pull API for non-blocking parsing
pt_br: A API de pull para análise sem bloqueio

source: Most parsing functions provided by this module require the whole document to be read at once before returning any result. It is possible to use an :class:`XMLParser` and feed data into it incrementally, but it is a push API that calls methods on a callback target, which is too low-level and inconvenient for most needs. Sometimes what the user really wants is to be able to parse XML incrementally, without blocking operations, while enjoying the convenience of fully constructed :class:`Element` objects.
pt_br: A maioria das funções de análise fornecidas por este módulo exigem que todo o documento seja lido de uma só vez antes de retornar qualquer resultado. É possível usar um :class:`XMLParser` e alimentar dados nele de forma incremental, mas é uma API de push que chama métodos em um destino da função de retorno, o que é de muito baixo nível e inconveniente para a maioria das necessidades. Às vezes, o que o usuário realmente deseja é ser capaz de analisar XML de forma incremental, sem operações bloqueantes, enquanto desfruta da conveniência de objetos :class:`Element` totalmente construídos.

source: The most powerful tool for doing this is :class:`XMLPullParser`. It does not require a blocking read to obtain the XML data, and is instead fed with data incrementally with :meth:`XMLPullParser.feed` calls. To get the parsed XML elements, call :meth:`XMLPullParser.read_events`. Here is an example::
pt_br: A ferramenta mais poderosa para fazer isso é :class:`XMLPullParser`. Ela não requer uma leitura bloqueante para obter os dados XML e, em vez disso, é alimentada com dados de forma incremental com chamadas de :meth:`XMLPullParser.feed`. Para obter os elementos XML analisados, chame :meth:`XMLPullParser.read_events`. Aqui está um exemplo::

source: The obvious use case is applications that operate in a non-blocking fashion where the XML data is being received from a socket or read incrementally from some storage device. In such cases, blocking reads are unacceptable.
pt_br: O caso de uso óbvio são aplicações que operam sem bloqueio, onde os dados XML são recebidos de um soquete ou lidos de forma incremental de algum dispositivo de armazenamento. Nesses casos, leituras bloqueantes são inaceitáveis.

source: Because it's so flexible, :class:`XMLPullParser` can be inconvenient to use for simpler use-cases. If you don't mind your application blocking on reading XML data but would still like to have incremental parsing capabilities, take a look at :func:`iterparse`. It can be useful when you're reading a large XML document and don't want to hold it wholly in memory.
pt_br: Por ser tão flexível, :class:`XMLPullParser` pode ser inconveniente de usar em casos de uso mais simples. Se você não se importa que sua aplicação bloqueie a leitura de dados XML, mas ainda assim gostaria de ter recursos de análise incremental, dê uma olhada em :func:`iterparse`. Pode ser útil quando você está lendo um documento XML grande e não deseja mantê-lo totalmente na memória.

source: Where *immediate* feedback through events is wanted, calling method :meth:`XMLPullParser.flush` can help reduce delay; please make sure to study the related security notes.
pt_br: Onde o feedback *imediato* através de eventos é desejado, chamar o método :meth:`XMLPullParser.flush` pode ajudar a reduzir o atraso; certifique-se de estudar as notas de segurança relacionadas.

source: Finding interesting elements
pt_br: Encontrando elementos interessantes

source: :class:`Element` has some useful methods that help iterate recursively over all the sub-tree below it (its children, their children, and so on). For example, :meth:`Element.iter`::
pt_br: :class:`Element` possui alguns métodos úteis que ajudam a iterar recursivamente sobre toda a subárvore abaixo dele (seus filhos, seus filhos e assim por diante). Por exemplo, :meth:`Element.iter`::

source: :meth:`Element.findall` finds only elements with a tag which are direct children of the current element. :meth:`Element.find` finds the *first* child with a particular tag, and :attr:`Element.text` accesses the element's text content. :meth:`Element.get` accesses the element's attributes::
pt_br: :meth:`Element.findall` encontra apenas elementos com uma tag que são filhos diretos do elemento atual. :meth:`Element.find` encontra o *primeiro* filho com uma tag específica, e :attr:`Element.text` acessa o conteúdo de texto do elemento. :meth:`Element.get` acessa os atributos do elemento::

source: More sophisticated specification of which elements to look for is possible by using :ref:`XPath <elementtree-xpath>`.
pt_br: Uma especificação mais sofisticada de quais elementos procurar é possível usando :ref:`XPath <elementtree-xpath>`.

source: Modifying an XML File
pt_br: Modificando um arquivo XML

source: :class:`ElementTree` provides a simple way to build XML documents and write them to files. The :meth:`ElementTree.write` method serves this purpose.
pt_br: :class:`ElementTree` fornece uma maneira simples de construir documentos XML e escrevê-los em arquivos. O método :meth:`ElementTree.write` serve para esse propósito.

source: Once created, an :class:`Element` object may be manipulated by directly changing its fields (such as :attr:`Element.text`), adding and modifying attributes (:meth:`Element.set` method), as well as adding new children (for example with :meth:`Element.append`).
pt_br: Uma vez criado, um objeto :class:`Element` pode ser manipulado alterando diretamente seus campos (como :attr:`Element.text`), adicionando e modificando atributos (método :meth:`Element.set`), bem como como adicionar novos filhos (por exemplo, com :meth:`Element.append`).

source: Let's say we want to add one to each country's rank, and add an ``updated`` attribute to the rank element::
pt_br: Digamos que queremos adicionar um à classificação de cada país e adicionar um atributo ``updated`` ao elemento de classificação::

source: Our XML now looks like this:
pt_br: Nosso XML agora se parece com isto:

source: We can remove elements using :meth:`Element.remove`. Let's say we want to remove all countries with a rank higher than 50::
pt_br: Podemos remover elementos usando :meth:`Element.remove`. Digamos que queremos remover todos os países com classificação superior a 50::

source: Note that concurrent modification while iterating can lead to problems, just like when iterating and modifying Python lists or dicts. Therefore, the example first collects all matching elements with ``root.findall()``, and only then iterates over the list of matches.
pt_br: Observe que a modificação simultânea durante a iteração pode levar a problemas, assim como ao iterar e modificar listas ou dicionários do Python. Portanto, o exemplo primeiro coleta todos os elementos correspondentes com ``root.findall()``, e só então itera sobre a lista de correspondências.

source: Building XML documents
pt_br: Construindo documentos XML

source: The :func:`SubElement` function also provides a convenient way to create new sub-elements for a given element::
pt_br: A função :func:`SubElement` também fornece uma maneira conveniente de criar novos subelementos para um determinado elemento::

source: Parsing XML with Namespaces
pt_br: Analisando XML com espaços de nomes

source: If the XML input has `namespaces <https://en.wikipedia.org/wiki/XML_namespace>`__, tags and attributes with prefixes in the form ``prefix:sometag`` get expanded to ``{uri}sometag`` where the *prefix* is replaced by the full *URI*. Also, if there is a `default namespace <https://www.w3.org/TR/xml-names/#defaulting>`__, that full URI gets prepended to all of the non-prefixed tags.
pt_br: Se a entrada XML tiver `espaços de nomes <https://en.wikipedia.org/wiki/XML_namespace>`__, tags e atributos com prefixos no formato ``prefixo:algumatag`` serão expandidos para ``{uri}algumatag`` onde *prefixo* é substituído pelo *URI* completo. Além disso, se houver um `espaço de nomes padrão <https://www.w3.org/TR/xml-names/#defaulting>`__, esse URI completo será anexado a todas as tags não prefixadas.

source: Here is an XML example that incorporates two namespaces, one with the prefix "fictional" and the other serving as the default namespace:
pt_br: Aqui está um exemplo XML que incorpora dois espaços de nomes, um com o prefixo "fictional" e outro servindo como espaço de nomes padrão:

source: One way to search and explore this XML example is to manually add the URI to every tag or attribute in the xpath of a :meth:`~Element.find` or :meth:`~Element.findall`::
pt_br: Uma maneira de pesquisar e explorar este exemplo XML é adicionar manualmente o URI a cada tag ou atributo no xpath de um :meth:`~Element.find` ou :meth:`~Element.findall`::

source: A better way to search the namespaced XML example is to create a dictionary with your own prefixes and use those in the search functions::
pt_br: A melhor maneira de pesquisar o exemplo XML com espaço de nomes é criar um dicionário com seus próprios prefixos e usá-los nas funções de pesquisa::

source: These two approaches both output::
pt_br: Essas duas abordagens resultam no seguinte::

source: XPath support
pt_br: Suporte a XPath

source: This module provides limited support for `XPath expressions <https://www.w3.org/TR/xpath>`_ for locating elements in a tree. The goal is to support a small subset of the abbreviated syntax; a full XPath engine is outside the scope of the module.
pt_br: Este módulo fornece suporte limitado para `expressões XPath <https://www.w3.org/TR/xpath>`_ para localizar elementos em uma árvore. O objetivo é oferecer suporte a um pequeno subconjunto da sintaxe abreviada; um mecanismo XPath completo está fora do escopo do módulo.

source: Example
pt_br: Exemplo

source: Here's an example that demonstrates some of the XPath capabilities of the module. We'll be using the ``countrydata`` XML document from the :ref:`Parsing XML <elementtree-parsing-xml>` section::
pt_br: Aqui está um exemplo que demonstra alguns dos recursos XPath do módulo. Estaremos usando o documento XML ``countrydata`` da seção :ref:`Analisando XML <elementtree-parsing-xml>`::

source: For XML with namespaces, use the usual qualified ``{namespace}tag`` notation::
pt_br: Para XML com espaços de nomes, use a notação qualificada usual ``{espaço-de-nomes}tag``::

source: Supported XPath syntax
pt_br: Підтримуваний синтаксис XPath

source: Syntax
pt_br: Sintaxe

source: Meaning
pt_br: Significado

source: Selects all child elements with the given tag. For example, ``spam`` selects all child elements named ``spam``, and ``spam/egg`` selects all grandchildren named ``egg`` in all children named ``spam``. ``{namespace}*`` selects all tags in the given namespace, ``{*}spam`` selects tags named ``spam`` in any (or no) namespace, and ``{}*`` only selects tags that are not in a namespace.
pt_br: Вибирає всі дочірні елементи з заданим тегом. Наприклад, ``spam`` вибирає всі дочірні елементи з іменем ``spam``, а ``spam/egg`` вибирає всіх онуків з іменем ``egg`` у всіх дочірніх елементах з іменем ``spam``. ``{namespace}*`` вибирає всі теги в заданому просторі імен, ``{*}spam`` вибирає теги з назвою ``spam`` у будь-якому просторі імен (або без нього), а ``{}*`` лише вибирає теги, які не знаходяться в просторі імен.

source: Support for star-wildcards was added.
pt_br: Додано підтримку символів підстановки зірок.

source: Selects all child elements, including comments and processing instructions. For example, ``*/egg`` selects all grandchildren named ``egg``.
pt_br: Вибирає всі дочірні елементи, включаючи коментарі та інструкції з обробки. Наприклад, ``*/egg`` вибирає всіх онуків з іменем ``egg``.

source: Selects the current node. This is mostly useful at the beginning of the path, to indicate that it's a relative path.
pt_br: Вибирає поточний вузол. Це здебільшого корисно на початку шляху, щоб вказати, що це відносний шлях.

source: Selects all subelements, on all levels beneath the current element. For example, ``.//egg`` selects all ``egg`` elements in the entire tree.
pt_br: Вибирає всі піделементи на всіх рівнях під поточним елементом. Наприклад, ``.//egg`` вибирає всі елементи ``egg`` у всьому дереві.

source: Selects the parent element. Returns ``None`` if the path attempts to reach the ancestors of the start element (the element ``find`` was called on).
pt_br: Вибирає батьківський елемент. Повертає ``None``, якщо шлях намагається досягти предків початкового елемента (був викликаний елемент ``find``).

source: Selects all elements that have the given attribute.
pt_br: Вибирає всі елементи, які мають заданий атрибут.

source: Selects all elements for which the given attribute has the given value. The value cannot contain quotes.
pt_br: Вибирає всі елементи, для яких даний атрибут має задане значення. Значення не може містити лапки.

source: Selects all elements for which the given attribute does not have the given value. The value cannot contain quotes.
pt_br: Вибирає всі елементи, для яких даний атрибут не має заданого значення. Значення не може містити лапки.

source: Selects all elements that have a child named ``tag``. Only immediate children are supported.
pt_br: Вибирає всі елементи, які мають дочірні елементи з іменем ``tag``. Утримуються лише найближчі діти.

source: Selects all elements whose complete text content, including descendants, equals the given ``text``.
pt_br: Вибирає всі елементи, повний текстовий вміст яких, включаючи нащадків, дорівнює заданому ``тексту``.

source: Selects all elements whose complete text content, including descendants, does not equal the given ``text``.
pt_br: Вибирає всі елементи, повний текстовий вміст яких, включно з нащадками, не відповідає заданому ``тексту``.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, equals the given ``text``.
pt_br: Вибирає всі елементи, які мають дочірні елементи з назвою ``tag``, повний текстовий вміст яких, включаючи нащадків, дорівнює заданому ``text``.

source: Selects all elements that have a child named ``tag`` whose complete text content, including descendants, does not equal the given ``text``.
pt_br: Вибирає всі елементи, які мають дочірні елементи з іменем ``tag``, повний текстовий вміст яких, включаючи нащадків, не збігається з заданим ``text``.

source: Selects all elements that are located at the given position. The position can be either an integer (1 is the first position), the expression ``last()`` (for the last position), or a position relative to the last position (e.g. ``last()-1``).
pt_br: Вибирає всі елементи, які розташовані на заданій позиції. Позиція може бути цілим числом (1 — перша позиція), виразом ``last()`` (для останньої позиції) або позицією відносно останньої позиції (наприклад, ``last()-1`` ).

source: Predicates (expressions within square brackets) must be preceded by a tag name, an asterisk, or another predicate. ``position`` predicates must be preceded by a tag name.
pt_br: Предикати (вирази в квадратних дужках) мають передувати назві тегу, зірочці або іншому предикату. Предикатам ``position`` має передувати ім’я тегу.

source: Reference
pt_br: Referência

source: Functions
pt_br: Funções

source: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ transformation function.
pt_br: `C14N 2.0 <https://www.w3.org/TR/xml-c14n2/>`_ функція перетворення.

source: Canonicalization is a way to normalise XML output in a way that allows byte-by-byte comparisons and digital signatures. It reduces the freedom that XML serializers have and instead generates a more constrained XML representation. The main restrictions regard the placement of namespace declarations, the ordering of attributes, and ignorable whitespace.
pt_br: Канонизация — это способ нормализации вывода XML таким образом, чтобы обеспечить побайтовое сравнение и цифровые подписи. Это уменьшает свободу, которую имеют сериализаторы XML, и вместо этого генерирует более ограниченное представление XML. Основные ограничения касаются размещения объявлений пространств имен, порядка атрибутов и игнорируемых пробелов.

source: This function takes an XML data string (*xml_data*) or a file path or file-like object (*from_file*) as input, converts it to the canonical form, and writes it out using the *out* file(-like) object, if provided, or returns it as a text string if not. The output file receives text, not bytes. It should therefore be opened in text mode with ``utf-8`` encoding.
pt_br: Ця функція приймає рядок XML-даних (*xml_data*) або шлях до файлу або файлоподібний об’єкт (*from_file*) як вхідні дані, перетворює їх у канонічну форму та записує за допомогою *out* file(-like) об’єкт, якщо він наданий, або повертає його як текстовий рядок, якщо ні. Вихідний файл отримує текст, а не байти. Тому його слід відкривати в текстовому режимі з кодуванням ``utf-8``.

source: Typical uses::
pt_br: Типове використання::

source: The configuration *options* are as follows:
pt_br: *Параметри* конфігурації такі:

source: *with_comments*: set to true to include comments (default: false)
pt_br: *with_comments*: установіть значення true, щоб включити коментарі (за замовчуванням: false)

source: *strip_text*: set to true to strip whitespace before and after text content
pt_br: *strip_text*: установіть значення true, щоб видалити пробіли перед і після текстового вмісту

source: (default: false)
pt_br: (за замовчуванням: false)

source: *rewrite_prefixes*: set to true to replace namespace prefixes by "n{number}"
pt_br: *rewrite_prefixes*: встановлено значення true, щоб замінити префікси простору імен на "n{number}"

source: *qname_aware_tags*: a set of qname aware tag names in which prefixes
pt_br: *qname_aware_tags*: набір імен тегів qname, у яких префікси

source: should be replaced in text content (default: empty)
pt_br: слід замінити в текстовому вмісті (за замовчуванням: пусто)

source: *qname_aware_attrs*: a set of qname aware attribute names in which prefixes
pt_br: *qname_aware_attrs*: набір імен атрибутів, що підтримують qname, у яких префікси

source: *exclude_attrs*: a set of attribute names that should not be serialised
pt_br: *exclude_attrs*: набір імен атрибутів, які не повинні бути серіалізовані

source: *exclude_tags*: a set of tag names that should not be serialised
pt_br: *exclude_tags*: набір імен тегів, які не повинні бути серіалізовані

source: In the option list above, "a set" refers to any collection or iterable of strings, no ordering is expected.
pt_br: У наведеному вище списку параметрів "набір" відноситься до будь-якої колекції або ітерації рядків, упорядкування не очікується.
