Repository: python/python-docs-pt-br
Catalog: library/xmlrpc.server.po
Languages: pt_br

source: :mod:`!xmlrpc.server` --- Basic XML-RPC servers
pt_br: :mod:`!xmlrpc.server` --- Servidores XML-RPC básicos

source: **Source code:** :source:`Lib/xmlrpc/server.py`
pt_br: **Código-fonte:** :source:`Lib/xmlrpc/server.py`

source: The :mod:`xmlrpc.server` module provides a basic server framework for XML-RPC servers written in Python. Servers can either be free standing, using :class:`SimpleXMLRPCServer`, or embedded in a CGI environment, using :class:`CGIXMLRPCRequestHandler`.
pt_br: O módulo :mod:`xmlrpc.server` fornece um framework básico de servidor para servidores XML-RPC escritos em Python. Os servidores podem ser independentes, usando :class:`SimpleXMLRPCServer`, ou incorporados em um ambiente CGI, usando :class:`CGIXMLRPCRequestHandler`.

source: The :mod:`xmlrpc.server` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
pt_br: O módulo :mod:`xmlrpc.server` não é seguro contra dados criados com códigos maliciosos. Se você precisar analisar dados não confiáveis ou não autenticados, consulte :ref:`xml-vulnerabilities`.

source: Availability
pt_br: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_br: Este módulo não funciona ou não está disponível em WebAssembly. Veja :ref:`wasm-availability` para mais informações.

source: Create a new server instance. This class provides methods for registration of functions that can be called by the XML-RPC protocol. The *requestHandler* parameter should be a factory for request handler instances; it defaults to :class:`SimpleXMLRPCRequestHandler`. The *addr* and *requestHandler* parameters are passed to the :class:`socketserver.TCPServer` constructor. If *logRequests* is true (the default), requests will be logged; setting this parameter to false will turn off logging. The *allow_none* and *encoding* parameters are passed on to :mod:`xmlrpc.client` and control the XML-RPC responses that will be returned from the server. The *bind_and_activate* parameter controls whether :meth:`server_bind` and :meth:`server_activate` are called immediately by the constructor; it defaults to true. Setting it to false allows code to manipulate the *allow_reuse_address* class variable before the address is bound. The *use_builtin_types* parameter is passed to the :func:`~xmlrpc.client.loads` function and controls which types are processed when date/times values or binary data are received; it defaults to false.
pt_br: Cria uma nova instância do servidor. Esta classe fornece métodos para registro de funções que podem ser chamadas pelo protocolo XML-RPC. O parâmetro *requestHandler* deve ser uma fábrica para instâncias do tratador de solicitações; o padrão é :class:`SimpleXMLRPCRequestHandler`. Os parâmetros *addr* e *requestHandler* são passados ​para o construtor :class:`socketserver.TCPServer`. Se *logRequests* for true (o padrão), as solicitações serão registradas; definir esse parâmetro como false desativará os registros. Os parâmetros *allow_none* e *encoding* são transmitidos para :mod:`xmlrpc.client` e controlam as respostas XML-RPC que serão retornadas do servidor. O parâmetro *bind_and_activate* controla se :meth:`server_bind` e :meth:`server_activate` são chamados imediatamente pelo construtor; o padrão é true. A configuração como false permite que o código manipule a variável de classe *allow_reuse_address* antes que o endereço seja vinculado. O parâmetro *use_builtin_types* é passado para a função :func:`~xmlrpc.client.loads` e controla quais tipos são processados ​quando valores de data/hora ou dados binários são recebidos; o padrão é false.

source: The *use_builtin_types* flag was added.
pt_br: O sinalizador *use_builtin_types* foi adicionado.

source: Create a new instance to handle XML-RPC requests in a CGI environment. The *allow_none* and *encoding* parameters are passed on to :mod:`xmlrpc.client` and control the XML-RPC responses that will be returned from the server. The *use_builtin_types* parameter is passed to the :func:`~xmlrpc.client.loads` function and controls which types are processed when date/times values or binary data are received; it defaults to false.
pt_br: Cria uma nova instância para manipular solicitações XML-RPC em um ambiente CGI. Os parâmetros *allow_none* e *encoding* são transmitidos para :mod:`xmlrpc.client` e controlam as respostas XML-RPC que serão retornadas do servidor. O parâmetro *use_builtin_types* é passado para a função :func:`~xmlrpc.client.loads` e controla quais tipos são processados quando valores de data/hora ou dados binários são recebidos; o padrão é false.

source: Create a new request handler instance. This request handler supports ``POST`` requests and modifies logging so that the *logRequests* parameter to the :class:`SimpleXMLRPCServer` constructor parameter is honored.
pt_br: Cria uma nova instância do manipulador de solicitações. Este manipulador de solicitação possui suporte a solicitações ``POST`` e modifica o registro para que o parâmetro *logRequests* para o construtor de :class:`SimpleXMLRPCServer` seja respeitado.

source: SimpleXMLRPCServer Objects
pt_br: Objetos de SimpleXMLRPCServer

source: The :class:`SimpleXMLRPCServer` class is based on :class:`socketserver.TCPServer` and provides a means of creating simple, stand alone XML-RPC servers.
pt_br: A classe :class:`SimpleXMLRPCServer` é baseada em :class:`socketserver.TCPServer` e fornece um meio de criar servidores XML-RPC simples e independentes.

source: Register a function that can respond to XML-RPC requests. If *name* is given, it will be the method name associated with *function*, otherwise :attr:`function.__name__` will be used. *name* is a string, and may contain characters not legal in Python identifiers, including the period character.
pt_br: Registra uma função que possa responder às solicitações XML-RPC. Se *name* for fornecido, será o nome do método associado a *function*, caso contrário, :attr:`function.__name__` será usado. *name* é uma string e pode conter caracteres ilegais para identificadores Python, incluindo o caractere de ponto.

source: This method can also be used as a decorator. When used as a decorator, *name* can only be given as a keyword argument to register *function* under *name*. If no *name* is given, :attr:`function.__name__` will be used.
pt_br: Este método também pode ser usado como um decorador. Quando usado como decorador, *name* só pode ser fornecido como argumento nomeado para registrar *function* em *name*. Se nenhum *name* for fornecido, :attr:`function.__name__` será usado.

source: :meth:`register_function` can be used as a decorator.
pt_br: :meth:`register_function` pode ser usado como um decorador.

source: Register an object which is used to expose method names which have not been registered using :meth:`register_function`. If *instance* contains a :meth:`_dispatch` method, it is called with the requested method name and the parameters from the request. Its API is ``def _dispatch(self, method, params)`` (note that *params* does not represent a variable argument list). If it calls an underlying function to perform its task, that function is called as ``func(*params)``, expanding the parameter list. The return value from :meth:`_dispatch` is returned to the client as the result. If *instance* does not have a :meth:`_dispatch` method, it is searched for an attribute matching the name of the requested method.
pt_br: Registra um objeto que é usado para expor nomes de métodos que não foram registrados usando :meth:`register_function`. Se *instance* contiver um método :meth:`_dispatch`, ele será chamado com o nome do método solicitado e os parâmetros da solicitação. Sua API é ``def _dispatch(self, method, params)`` (observe que *params* não representa uma lista de argumentos variáveis). Se ele chama uma função subjacente para executar sua tarefa, essa função é chamada como ``func(*params)``, expandindo a lista de parâmetros. O valor de retorno de :meth:`_dispatch` é retornado ao cliente como resultado. Se *instance* não possui o método :meth:`_dispatch`, é procurado por um atributo correspondente ao nome do método solicitado.

source: If the optional *allow_dotted_names* argument is true and the instance does not have a :meth:`_dispatch` method, then if the requested method name contains periods, each component of the method name is searched for individually, with the effect that a simple hierarchical search is performed. The value found from this search is then called with the parameters from the request, and the return value is passed back to the client.
pt_br: Se o argumento opcional *allow_dotted_names* for true e a instância não tiver o método :meth:`_dispatch`, e se o nome do método solicitado contiver pontos, cada componente do nome do método será pesquisado individualmente, com o efeito de que um simples pesquisa hierárquica é realizada. O valor encontrado nessa pesquisa é chamado com os parâmetros da solicitação e o valor retornado é passado de volta ao cliente.

source: Enabling the *allow_dotted_names* option allows intruders to access your module's global variables and may allow intruders to execute arbitrary code on your machine. Only use this option on a secure, closed network.
pt_br: A ativação da opção *allow_dotted_names* permite que os invasores acessem as variáveis globais do seu módulo e podem permitir que os invasores executem códigos arbitrários em sua máquina. Use esta opção apenas em uma rede fechada e segura.

source: Registers the XML-RPC introspection functions ``system.listMethods``, ``system.methodHelp`` and ``system.methodSignature``.
pt_br: Registra as funções de introspecção XML-RPC ``system.listMethods``, ``system.methodHelp`` e ``system.methodSignature``.

source: Registers the XML-RPC multicall function system.multicall.
pt_br: Registra a função de multichamada XML-RPC system.multicall.

source: An attribute value that must be a tuple listing valid path portions of the URL for receiving XML-RPC requests. Requests posted to other paths will result in a 404 "no such page" HTTP error. If this tuple is empty, all paths will be considered valid. The default value is ``('/', '/RPC2')``.
pt_br: Um valor de atributo que deve ser uma tupla listando partes do caminho válidas da URL para receber solicitações XML-RPC. Solicitações postadas em outros caminhos resultarão em um erro HTTP 404 "página inexistente". Se esta tupla estiver vazia, todos os caminhos serão considerados válidos. O valor padrão é ``('/', '/RPC2')``.

source: SimpleXMLRPCServer Example
pt_br: Exemplo de SimpleXMLRPCServer

source: Server code::
pt_br: Código do servidor::

source: from xmlrpc.server import SimpleXMLRPCServer from xmlrpc.server import SimpleXMLRPCRequestHandler # Restrict to a particular path. class RequestHandler(SimpleXMLRPCRequestHandler): rpc_paths = ('/RPC2',) # Create server with SimpleXMLRPCServer(('localhost', 8000), requestHandler=RequestHandler) as server: server.register_introspection_functions() # Register pow() function; this will use the value of # pow.__name__ as the name, which is just 'pow'. server.register_function(pow) # Register a function under a different name def adder_function(x, y): return x + y server.register_function(adder_function, 'add') # Register an instance; all the methods of the instance are # published as XML-RPC methods (in this case, just 'mul'). class MyFuncs: def mul(self, x, y): return x * y server.register_instance(MyFuncs()) # Run the server's main loop server.serve_forever()
pt_br: from xmlrpc.server import SimpleXMLRPCServer from xmlrpc.server import SimpleXMLRPCRequestHandler # Restringe a um caminho em particular. class RequestHandler(SimpleXMLRPCRequestHandler): rpc_paths = ('/RPC2',) # Cria o servidor with SimpleXMLRPCServer(('localhost', 8000), requestHandler=RequestHandler) as server: server.register_introspection_functions() # Registra uma função pow(); isso vai usar o valor de # pow.__name__ como o nome, que é apenas 'pow'. server.register_function(pow) # Registra uma função sob um nome diferente def adder_function(x, y): return x + y server.register_function(adder_function, 'add') # Registra uma instância; todos os métodos da instância # são publicados como métodos XML-RPC (neste caso, # apenas 'mul'). class MyFuncs: def mul(self, x, y): return x * y server.register_instance(MyFuncs()) # Executa o laço principal do servidor server.serve_forever()

source: The following client code will call the methods made available by the preceding server::
pt_br: O código do cliente a seguir chamará os métodos disponibilizados pelo servidor anterior::

source: import xmlrpc.client s = xmlrpc.client.ServerProxy('http://localhost:8000') print(s.pow(2,3)) # Returns 2**3 = 8 print(s.add(2,3)) # Returns 5 print(s.mul(5,2)) # Returns 5*2 = 10 # Print list of available methods print(s.system.listMethods())
pt_br: import xmlrpc.client s = xmlrpc.client.ServerProxy('http://localhost:8000') print(s.pow(2,3)) # Returns 2**3 = 8 print(s.add(2,3)) # Returns 5 print(s.mul(5,2)) # Returns 5*2 = 10 # Exibe uma lista dos métodos disponíveis print(s.system.listMethods())

source: :meth:`register_function` can also be used as a decorator. The previous server example can register functions in a decorator way::
pt_br: :meth:`register_function` também pode ser usado como um decorador. O exemplo anterior do servidor pode registrar funções com um decorador::

source: from xmlrpc.server import SimpleXMLRPCServer from xmlrpc.server import SimpleXMLRPCRequestHandler class RequestHandler(SimpleXMLRPCRequestHandler): rpc_paths = ('/RPC2',) with SimpleXMLRPCServer(('localhost', 8000), requestHandler=RequestHandler) as server: server.register_introspection_functions() # Register pow() function; this will use the value of # pow.__name__ as the name, which is just 'pow'. server.register_function(pow) # Register a function under a different name, using # register_function as a decorator. *name* can only be given # as a keyword argument. @server.register_function(name='add') def adder_function(x, y): return x + y # Register a function under function.__name__. @server.register_function def mul(x, y): return x * y server.serve_forever()
pt_br: from xmlrpc.server import SimpleXMLRPCServer from xmlrpc.server import SimpleXMLRPCRequestHandler class RequestHandler(SimpleXMLRPCRequestHandler): rpc_paths = ('/RPC2',) with SimpleXMLRPCServer(('localhost', 8000), requestHandler=RequestHandler) as server: server.register_introspection_functions() # Registra a função pow(); isso vai usar o valor de # pow.__name__ como o nome, que é apenas 'pow'. server.register_function(pow) # Registra uma função sob um nome diferente, usando # register_function como um decorador. *name* só pode # ser dado como um argumento nomeado. @server.register_function(name='add') def adder_function(x, y): return x + y # Registra uma função sob function.__name__. @server.register_function def mul(x, y): return x * y server.serve_forever()

source: The following example included in the :file:`Lib/xmlrpc/server.py` module shows a server allowing dotted names and registering a multicall function.
pt_br: O exemplo a seguir, incluído no módulo :file:`Lib/xmlrpc/server.py`, mostra um servidor que permite nomes com pontos e registra uma função de várias chamadas.

source: Enabling the *allow_dotted_names* option allows intruders to access your module's global variables and may allow intruders to execute arbitrary code on your machine. Only use this example only within a secure, closed network.
pt_br: A ativação da opção *allow_dotted_names* permite que os invasores acessem as variáveis globais do seu módulo e podem permitir que os invasores executem códigos arbitrários em sua máquina. Use este exemplo apenas em uma rede fechada e segura.

source: This ExampleService demo can be invoked from the command line::
pt_br: Esta demonstração ExampleService pode ser chamada na linha de comando::

source: The client that interacts with the above server is included in ``Lib/xmlrpc/client.py``::
pt_br: O cliente que interage com o servidor acima está incluído em ``Lib/xmlrpc/client.py``::

source: This client which interacts with the demo XMLRPC server can be invoked as::
pt_br: Este cliente que interage com o servidor XMLRPC de demonstração pode ser chamado como::

source: The :class:`CGIXMLRPCRequestHandler` class can be used to handle XML-RPC requests sent to Python CGI scripts.
pt_br: A classe :class:`CGIXMLRPCRequestHandler` pode ser usada para manipular solicitações XML-RPC enviadas para scripts CGI Python.

source: Register an object which is used to expose method names which have not been registered using :meth:`register_function`. If instance contains a :meth:`_dispatch` method, it is called with the requested method name and the parameters from the request; the return value is returned to the client as the result. If instance does not have a :meth:`_dispatch` method, it is searched for an attribute matching the name of the requested method; if the requested method name contains periods, each component of the method name is searched for individually, with the effect that a simple hierarchical search is performed. The value found from this search is then called with the parameters from the request, and the return value is passed back to the client.
pt_br: Registra um objeto que é usado para expor nomes de métodos que não foram registrados usando :meth:`register_function`. Se a instância contiver um método :meth:`_dispatch`, ela será chamada com o nome do método solicitado e os parâmetros da solicitação; o valor retornado é retornado ao cliente como resultado. Se a instância não tiver um método :meth:`_dispatch`, será procurado um atributo correspondente ao nome do método solicitado; se o nome do método solicitado contiver pontos, cada componente do nome do método será pesquisado individualmente, com o efeito de que uma pesquisa hierárquica simples é executada. O valor encontrado nessa pesquisa é chamado com os parâmetros da solicitação e o valor retornado é passado de volta ao cliente.

source: Register the XML-RPC introspection functions ``system.listMethods``, ``system.methodHelp`` and ``system.methodSignature``.
pt_br: Registra as funções de introspecção XML-RPC ``system.listMethods``, ``system.methodHelp`` e ``system.methodSignature``.

source: Register the XML-RPC multicall function ``system.multicall``.
pt_br: Registra a função de multichamada XML-RPC ``system.multicall``.

source: Handle an XML-RPC request. If *request_text* is given, it should be the POST data provided by the HTTP server, otherwise the contents of stdin will be used.
pt_br: Manipula uma solicitação XML-RPC. Se *request_text* for fornecido, devem ser os dados POST fornecidos pelo servidor HTTP, caso contrário, o conteúdo do stdin será usado.

source: Example::
pt_br: Exemplo::

source: Documenting XMLRPC server
pt_br: Documentando servidor XMLRPC

source: These classes extend the above classes to serve HTML documentation in response to HTTP GET requests. Servers can either be free standing, using :class:`DocXMLRPCServer`, or embedded in a CGI environment, using :class:`DocCGIXMLRPCRequestHandler`.
pt_br: Essas classes estendem as classes acima para servir a documentação HTML em resposta a solicitações HTTP GET. Os servidores podem ser independentes, usando :class:`DocXMLRPCServer` ou incorporados em um ambiente CGI, usando :class:`DocCGIXMLRPCRequestHandler`.

source: Create a new server instance. All parameters have the same meaning as for :class:`SimpleXMLRPCServer`; *requestHandler* defaults to :class:`DocXMLRPCRequestHandler`.
pt_br: Cria uma nova instância do servidor. Todos os parâmetros têm o mesmo significado que para :class:`SimpleXMLRPCServer`; *requestHandler* assume como padrão :class:`DocXMLRPCRequestHandler`.

source: Create a new instance to handle XML-RPC requests in a CGI environment.
pt_br: Cria uma nova instância para manipular solicitações XML-RPC em um ambiente CGI.

source: Create a new request handler instance. This request handler supports XML-RPC POST requests, documentation GET requests, and modifies logging so that the *logRequests* parameter to the :class:`DocXMLRPCServer` constructor parameter is honored.
pt_br: Cria uma nova instância do manipulador de solicitações. Este manipulador de solicitações possui suporte a solicitações POST de XML-RPC, documenta solicitações GET e modifica o registro para que o parâmetro *logRequests* no parâmetro :class:`DocXMLRPCServer` seja respeitado.

source: DocXMLRPCServer Objects
pt_br: Objetos de DocXMLRPCServer

source: The :class:`DocXMLRPCServer` class is derived from :class:`SimpleXMLRPCServer` and provides a means of creating self-documenting, stand alone XML-RPC servers. HTTP POST requests are handled as XML-RPC method calls. HTTP GET requests are handled by generating pydoc-style HTML documentation. This allows a server to provide its own web-based documentation.
pt_br: A classe :class:`DocXMLRPCServer` é derivada de :class:`SimpleXMLRPCServer` e fornece um meio de criar servidores XML-RPC autodocumentados e independentes. Solicitações HTTP POST são tratadas como chamadas de método XML-RPC. As solicitações HTTP GET são tratadas gerando documentação HTML no estilo pydoc. Isso permite que um servidor forneça sua própria documentação baseada na Web.

source: Set the title used in the generated HTML documentation. This title will be used inside the HTML "title" element.
pt_br: Define o título usado na documentação HTML gerada. Este título será usado dentro do elemento "title" do HTML.

source: Set the name used in the generated HTML documentation. This name will appear at the top of the generated documentation inside a "h1" element.
pt_br: Define o nome usado na documentação HTML gerada. Este nome aparecerá na parte superior da documentação gerada dentro de um elemento "h1".

source: Set the description used in the generated HTML documentation. This description will appear as a paragraph, below the server name, in the documentation.
pt_br: Define a descrição usada na documentação HTML gerada. Esta descrição aparecerá na documentação como um parágrafo, abaixo do nome do servidor.

source: The :class:`DocCGIXMLRPCRequestHandler` class is derived from :class:`CGIXMLRPCRequestHandler` and provides a means of creating self-documenting, XML-RPC CGI scripts. HTTP POST requests are handled as XML-RPC method calls. HTTP GET requests are handled by generating pydoc-style HTML documentation. This allows a server to provide its own web-based documentation.
pt_br: A classe :class:`DocCGIXMLRPCRequestHandler` é derivada de :class:`CGIXMLRPCRequestHandler` e fornece um meio de criar scripts CGI XML-RPC autodocumentados. Solicitações HTTP POST são tratadas como chamadas de método XML-RPC. As solicitações HTTP GET são tratadas gerando documentação HTML no estilo pydoc. Isso permite que um servidor forneça sua própria documentação baseada na web.
