Repository: python/python-docs-pt-br
Catalog: library/zipapp.po
Languages: pt_br

source: **Source code:** :source:`Lib/zipapp.py`
pt_br: **Código-fonte:** :source:`Lib/zipapp.py`

source: This module provides tools to manage the creation of zip files containing Python code, which can be :ref:`executed directly by the Python interpreter <using-on-interface-options>`. The module provides both a :ref:`zipapp-command-line-interface` and a :ref:`zipapp-python-api`.
pt_br: Este módulo fornece ferramentas para gerenciar a criação de arquivos zip contendo código Python, que pode ser :ref:`executado diretamente pelo interpretador Python <using-on-interface-options>`. O módulo fornece uma :ref:`zipapp-command-line-interface` e uma :ref:`zipapp-python-api`.

source: Basic Example
pt_br: Exemplo básico

source: The following example shows how the :ref:`zipapp-command-line-interface` can be used to create an executable archive from a directory containing Python code. When run, the archive will execute the ``main`` function from the module ``myapp`` in the archive.
pt_br: O exemplo a seguir mostra como a :ref:`zipapp-command-line-interface` pode ser usada para criar um arquivo executável a partir de um diretório contendo código Python. Quando executado, o arquivo executará a função ``main`` do módulo ``myapp`` no arquivo.

source: Command-Line Interface
pt_br: Interface de Linha de Comando

source: When called as a program from the command line, the following form is used:
pt_br: Quando chamado como um programa a partir da linha de comando, as seguintes opções estão disponíveis:

source: If *source* is a directory, this will create an archive from the contents of *source*. If *source* is a file, it should be an archive, and it will be copied to the target archive (or the contents of its shebang line will be displayed if the --info option is specified).
pt_br: Se *source* for um diretório, isso criará um arquivo a partir do conteúdo de *source*. Se *source* for um arquivo, ele deve ser um arquivo, e será copiado para o arquivo de destino (ou o conteúdo de sua linha shebang será exibido se a opção --info for especificada).

source: The following options are understood:
pt_br: As seguintes opções são compreendidas:

source: Write the output to a file named *output*. If this option is not specified, the output filename will be the same as the input *source*, with the extension ``.pyz`` added. If an explicit filename is given, it is used as is (so a ``.pyz`` extension should be included if required).
pt_br: Escreve a saída em um arquivo chamado *output*. Se essa opção não for especificada, o nome do arquivo de saída será o mesmo que o *source* de entrada, com a extensão ``.pyz`` adicionada. Se um nome de arquivo explícito for fornecido, ele será usado como está (então uma extensão ``.pyz`` deve ser incluída se necessário).

source: An output filename must be specified if the *source* is an archive (and in that case, *output* must not be the same as *source*).
pt_br: Um nome de arquivo de saída deve ser especificado se *source* for um arquivo (e nesse caso, *output* não deve ser o mesmo que *source*).

source: Add a ``#!`` line to the archive specifying *interpreter* as the command to run. Also, on POSIX, make the archive executable. The default is to write no ``#!`` line, and not make the file executable.
pt_br: Adiciona uma linha ``#!`` ao arquivo especificando *interpreter* como o comando a ser executado. Além disso, no POSIX, torne o arquivo executável. O padrão é não escrever nenhuma linha ``#!`` e não tornar o arquivo executável.

source: Write a ``__main__.py`` file to the archive that executes *mainfn*. The *mainfn* argument should have the form "pkg.mod:fn", where "pkg.mod" is a package/module in the archive, and "fn" is a callable in the given module. The ``__main__.py`` file will execute that callable.
pt_br: Escreve um arquivo ``__main__.py`` no arquivo que executa *mainfn*. O argumento *mainfn* deve ter o formato "pkg.mod:fn", onde "pkg.mod" é um pacote/módulo no arquivo, e "fn" é um chamável no módulo fornecido. O arquivo ``__main__.py`` executará esse chamável.

source: :option:`--main` cannot be specified when copying an archive.
pt_br: :option:`--main` não pode ser especificado ao copiar um arquivo.

source: Compress files with the deflate method, reducing the size of the output file. By default, files are stored uncompressed in the archive.
pt_br: Compacta arquivos com o método deflate, reduzindo o tamanho do arquivo de saída. Por padrão, os arquivos são armazenados descompactados no arquivo.

source: :option:`--compress` has no effect when copying an archive.
pt_br: :option:`--compress` não tem efeito ao copiar um arquivo.

source: Display the interpreter embedded in the archive, for diagnostic purposes. In this case, any other options are ignored and SOURCE must be an archive, not a directory.
pt_br: Exibe o interpretador incorporado no arquivo, para fins de diagnóstico. Neste caso, quaisquer outras opções são ignoradas e SOURCE deve ser um arquivo, não um diretório.

source: Print a short usage message and exit.
pt_br: Exibe uma mensagem curta de uso e sai

source: Python API
pt_br: API Python

source: The module defines two convenience functions:
pt_br: O módulo define duas funções de conveniência:

source: Create an application archive from *source*. The source can be any of the following:
pt_br: Cria um arquivo de aplicativo a partir de *source*. O source pode ser qualquer um dos seguintes:

source: The name of a directory, or a :term:`path-like object` referring to a directory, in which case a new application archive will be created from the content of that directory.
pt_br: O nome de um diretório, ou um :term:`objeto caminho ou similar` referente a um diretório, caso em que um novo arquivo de aplicação será criado a partir do conteúdo desse diretório.

source: The name of an existing application archive file, or a :term:`path-like object` referring to such a file, in which case the file is copied to the target (modifying it to reflect the value given for the *interpreter* argument). The file name should include the ``.pyz`` extension, if required.
pt_br: O nome de um arquivo de aplicação existente, ou um :term:`objeto caminho ou similar` referindo-se a tal arquivo, em cujo caso o arquivo é copiado para o alvo (modificando-o para refletir o valor dado para o argumento *interpreter*). O nome do arquivo deve incluir a extensão ``.pyz``, se necessário.

source: A file object open for reading in bytes mode. The content of the file should be an application archive, and the file object is assumed to be positioned at the start of the archive.
pt_br: Um objeto arquivo aberto para leitura no modo bytes. O conteúdo do arquivo deve ser um arquivo de aplicação, e o objeto arquivo é presumido como estando posicionado no início do arquivo.

source: The *target* argument determines where the resulting archive will be written:
pt_br: O argumento *target* determina onde o arquivo resultante será gravado:

source: If it is the name of a file, or a :term:`path-like object`, the archive will be written to that file.
pt_br: Se for o nome de um arquivo ou um :term:`objeto caminho ou similar`, o arquivo será escrito nesse arquivo.

source: If it is an open file object, the archive will be written to that file object, which must be open for writing in bytes mode.
pt_br: Se for um objeto arquivo aberto, o arquivo será escrito naquele objeto arquivo, que deve estar aberto para escrita no modo bytes.

source: If the target is omitted (or ``None``), the source must be a directory and the target will be a file with the same name as the source, with a ``.pyz`` extension added.
pt_br: Se o destino for omitido (ou ``Nenhum``), a fonte deverá ser um diretório e o destino será um arquivo com o mesmo nome da fonte, com uma extensão ``.pyz`` adicionada.

source: The *interpreter* argument specifies the name of the Python interpreter with which the archive will be executed. It is written as a "shebang" line at the start of the archive. On POSIX, this will be interpreted by the OS, and on Windows it will be handled by the Python launcher. Omitting the *interpreter* results in no shebang line being written. If an interpreter is specified, and the target is a filename, the executable bit of the target file will be set.
pt_br: O argumento *interpreter* especifica o nome do interpretador Python com o qual o arquivo será executado. Ele é escrito como uma linha "shebang" no início do arquivo. No POSIX, isso será interpretado pelo sistema operacional, e no Windows será manipulado pelo inicializador Python. Omitir o *interpreter* resulta em nenhuma linha shebang sendo escrita. Se um interpretador for especificado, e o alvo for um nome de arquivo, o bit executável do arquivo alvo será definido.

source: The *main* argument specifies the name of a callable which will be used as the main program for the archive. It can only be specified if the source is a directory, and the source does not already contain a ``__main__.py`` file. The *main* argument should take the form "pkg.module:callable" and the archive will be run by importing "pkg.module" and executing the given callable with no arguments. It is an error to omit *main* if the source is a directory and does not contain a ``__main__.py`` file, as otherwise the resulting archive would not be executable.
pt_br: O argumento *main* especifica o nome de um chamável que será usado como o programa principal para o arquivo. Ele só pode ser especificado se a fonte for um diretório, e a fonte ainda não contiver um arquivo ``__main__.py``. O argumento *main* deve ter o formato "pkg.módulo:chamável" e o arquivo será executado importando "pkg.módulo" e executando o chamável fornecido sem argumentos. É um erro omitir *main* se a fonte for um diretório e não contiver um arquivo ``__main__.py``, pois, caso contrário, o arquivo resultante não seria executável.

source: The optional *filter* argument specifies a callback function that is passed a Path object representing the path to the file being added (relative to the source directory). It should return ``True`` if the file is to be added.
pt_br: O argumento opcional *filter* especifica uma função de retorno de chamada que recebe um objeto Path representando o caminho para o arquivo que está sendo adicionado (relativo ao diretório da fonte). Ele deve retornar ``True`` se o arquivo for adicionado.

source: The optional *compressed* argument determines whether files are compressed. If set to ``True``, files in the archive are compressed with the deflate method; otherwise, files are stored uncompressed. This argument has no effect when copying an existing archive.
pt_br: O argumento opcional *compressed* determina se os arquivos são compactados. Se definido como ``True``, os arquivos no arquivo são compactados com o método deflate; caso contrário, os arquivos são armazenados descompactados. Este argumento não tem efeito ao copiar um arquivo existente.

source: If a file object is specified for *source* or *target*, it is the caller's responsibility to close it after calling create_archive.
pt_br: Se um objeto arquivo for especificado para *source* ou *target*, é responsabilidade do chamador fechá-lo após chamar create_archive.

source: When copying an existing archive, file objects supplied only need ``read`` and ``readline``, or ``write`` methods. When creating an archive from a directory, if the target is a file object it will be passed to the ``zipfile.ZipFile`` class, and must supply the methods needed by that class.
pt_br: Ao copiar um arquivo existente, os objetos arquivo fornecidos precisam apenas dos métodos ``read`` e ``readline`` ou ``write``. Ao criar um arquivo de um diretório, se o alvo for um objeto arquivo, ele será passado para a classe ``zipfile.ZipFile`` e deve fornecer os métodos necessários para essa classe.

source: Return the interpreter specified in the ``#!`` line at the start of the archive. If there is no ``#!`` line, return :const:`None`. The *archive* argument can be a filename or a file-like object open for reading in bytes mode. It is assumed to be at the start of the archive.
pt_br: Retorna o interpretador especificado na linha ``#!`` no início do arquivo. Se não houver nenhuma linha ``#!``, retorna :const:`None`. O argumento *archive* pode ser um nome de arquivo ou um objeto arquivo ou similar aberto para leitura no modo bytes. É presumido esteja no início do arquivo.

source: Examples
pt_br: Exemplos

source: Pack up a directory into an archive, and run it.
pt_br: Compacte um diretório em um arquivo e execute-o.

source: The same can be done using the :func:`create_archive` function::
pt_br: O mesmo pode ser feito usando a função :func:`create_archive`::

source: To make the application directly executable on POSIX, specify an interpreter to use.
pt_br: Para tornar o aplicativo diretamente executável no POSIX, especifique um interpretador a ser usado.

source: To replace the shebang line on an existing archive, create a modified archive using the :func:`create_archive` function::
pt_br: Para substituir a linha shebang em um arquivo existente, crie um arquivo modificado usando a função :func:`create_archive`::

source: Specifying the Interpreter
pt_br: Especificando o interpretador

source: Note that if you specify an interpreter and then distribute your application archive, you need to ensure that the interpreter used is portable. The Python launcher for Windows supports most common forms of POSIX ``#!`` line, but there are other issues to consider:
pt_br: Observe que se você especificar um interpretador e então distribuir seu arquivo de aplicação, você precisa garantir que o interpretador usado seja portátil. O inicializador Python para Windows oferece suporte às formas mais comuns da linha POSIX ``#!``, mas há outras questões a serem consideradas:

source: If you use "/usr/bin/env python" (or other forms of the "python" command, such as "/usr/bin/python"), you need to consider that your users may have either Python 2 or Python 3 as their default, and write your code to work under both versions.
pt_br: Se você usar "/usr/bin/env python" (ou outras formas do comando "python", como "/usr/bin/python"), você precisa considerar que seus usuários podem ter Python 2 ou Python 3 como padrão, e escrever seu código para funcionar em ambas as versões.

source: If you use an explicit version, for example "/usr/bin/env python3" your application will not work for users who do not have that version. (This may be what you want if you have not made your code Python 2 compatible).
pt_br: Se você usar uma versão explícita, por exemplo "/usr/bin/env python3", sua aplicação não funcionará para usuários que não tenham essa versão. (Isso pode ser o que você quer se não tiver tornado seu código compatível com Python 2).

source: There is no way to say "python X.Y or later", so be careful of using an exact version like "/usr/bin/env python3.4" as you will need to change your shebang line for users of Python 3.5, for example.
pt_br: Não há como dizer "python X.Y ou posterior", então tome cuidado ao usar uma versão exata como "/usr/bin/env python3.4", pois você precisará alterar sua linha shebang para usuários do Python 3.5, por exemplo.

source: Typically, you should use an "/usr/bin/env python2" or "/usr/bin/env python3", depending on whether your code is written for Python 2 or 3.
pt_br: Normalmente, você deve usar "/usr/bin/env python2" ou "/usr/bin/env python3", dependendo se seu código foi escrito para Python 2 ou 3.

source: Creating Standalone Applications with zipapp
pt_br: Criando aplicações autônomas com zipapp

source: Using the :mod:`zipapp` module, it is possible to create self-contained Python programs, which can be distributed to end users who only need to have a suitable version of Python installed on their system. The key to doing this is to bundle all of the application's dependencies into the archive, along with the application code.
pt_br: Usando o módulo :mod:`zipapp`, é possível criar programas Python autocontidos, que podem ser distribuídos para usuários finais que precisam apenas ter uma versão adequada do Python instalada em seu sistema. A chave para fazer isso é agrupar todas as dependências da aplicação no arquivo, junto com o código da aplicação.

source: The steps to create a standalone archive are as follows:
pt_br: As etapas para criar um arquivo autônomo são as seguintes:

source: Create your application in a directory as normal, so you have a ``myapp`` directory containing a ``__main__.py`` file, and any supporting application code.
pt_br: Crie sua aplicação em um diretório normalmente, para que você tenha um diretório ``myapp`` contendo um arquivo ``__main__.py`` e qualquer código de aplicação de suporte.

source: Install all of your application's dependencies into the ``myapp`` directory, using pip:
pt_br: Instale todas as dependências da sua aplicação no diretório ``myapp``, usando pip:

source: (this assumes you have your project requirements in a ``requirements.txt`` file - if not, you can just list the dependencies manually on the pip command line).
pt_br: (isso pressupõe que você tenha os requisitos do seu projeto em um arquivo ``requirements.txt`` - caso contrário, você pode simplesmente listar as dependências manualmente na linha de comando do pip).

source: Package the application using:
pt_br: Empacote a aplicação usando:

source: This will produce a standalone executable, which can be run on any machine with the appropriate interpreter available. See :ref:`zipapp-specifying-the-interpreter` for details. It can be shipped to users as a single file.
pt_br: Isso produzirá um executável autônomo, que pode ser executado em qualquer máquina com o interpretador apropriado disponível. Veja :ref:`zipapp-specificing-the-interpreter` para detalhes. Ele pode ser enviado aos usuários como um único arquivo.

source: On Unix, the ``myapp.pyz`` file is executable as it stands. You can rename the file to remove the ``.pyz`` extension if you prefer a "plain" command name. On Windows, the ``myapp.pyz[w]`` file is executable by virtue of the fact that the Python interpreter registers the ``.pyz`` and ``.pyzw`` file extensions when installed.
pt_br: No Unix, o arquivo ``myapp.pyz`` é executável como está. Você pode renomear o arquivo para remover a extensão ``.pyz`` se preferir um nome de comando "simples". No Windows, o arquivo ``myapp.pyz[w]`` é executável em virtude do fato de que o interpretador Python registra as extensões de arquivo ``.pyz`` e ``.pyzw`` quando instalado.

source: Caveats
pt_br: Advertência

source: If your application depends on a package that includes a C extension, that package cannot be run from a zip file (this is an OS limitation, as executable code must be present in the filesystem for the OS loader to load it). In this case, you can exclude that dependency from the zipfile, and either require your users to have it installed, or ship it alongside your zipfile and add code to your ``__main__.py`` to include the directory containing the unzipped module in ``sys.path``. In this case, you will need to make sure to ship appropriate binaries for your target architecture(s) (and potentially pick the correct version to add to ``sys.path`` at runtime, based on the user's machine).
pt_br: Se sua aplicação depende de um pacote que inclui uma extensão C, esse pacote não pode ser executado a partir de um arquivo zip (essa é uma limitação do sistema operacional, pois o código executável deve estar presente no sistema de arquivos para que o carregador do sistema operacional o carregue). Nesse caso, você pode excluir essa dependência do arquivo zip e exigir que seus usuários o tenham instalado ou enviá-lo junto com seu arquivo zip e adicionar código ao seu ``__main__.py`` para incluir o diretório que contém o módulo descompactado em ``sys.path``. Nesse caso, você precisará certificar-se de enviar binários apropriados para sua(s) arquitetura(s) de destino (e potencialmente escolher a versão correta para adicionar ao ``sys.path`` no tempo de execução, com base na máquina do usuário).

source: The Python Zip Application Archive Format
pt_br: O formato de arquivo da aplicação zip Python

source: Python has been able to execute zip files which contain a ``__main__.py`` file since version 2.6. In order to be executed by Python, an application archive simply has to be a standard zip file containing a ``__main__.py`` file which will be run as the entry point for the application. As usual for any Python script, the parent of the script (in this case the zip file) will be placed on :data:`sys.path` and thus further modules can be imported from the zip file.
pt_br: O Python tem sido capaz de executar arquivos zip que contêm um arquivo ``__main__.py`` desde a versão 2.6. Para ser executado pelo Python, um arquivo de aplicação simplesmente tem que ser um arquivo zip padrão contendo um arquivo ``__main__.py`` que será executado como o ponto de entrada para o aplicativo. Como de costume para qualquer script Python, o pai do script (neste caso, o arquivo zip) será colocado em :data:`sys.path` e, portanto, outros módulos podem ser importados do arquivo zip.

source: The zip file format allows arbitrary data to be prepended to a zip file. The zip application format uses this ability to prepend a standard POSIX "shebang" line to the file (``#!/path/to/interpreter``).
pt_br: O formato de arquivo zip permite que dados arbitrários sejam prefixados a um arquivo zip. O formato de aplicação zip usa essa habilidade para prefixar uma linha "shebang" padrão POSIX ao arquivo (``#!/caminho/para/interpretador``).

source: Formally, the Python zip application format is therefore:
pt_br: Formalmente, o formato de aplicação zip Python é:

source: Standard zipfile data, as generated by the :mod:`zipfile` module. The zipfile content *must* include a file called ``__main__.py`` (which must be in the "root" of the zipfile - i.e., it cannot be in a subdirectory). The zipfile data can be compressed or uncompressed.
pt_br: Dados padrão do zipfile, conforme gerados pelo módulo :mod:`zipfile`. O conteúdo do zipfile *deve* incluir um arquivo chamado ``__main__.py`` (que deve estar na "raiz" do zipfile - ou seja, não pode estar em um subdiretório). Os dados do zipfile podem ser compactados ou descompactados.

source: If an application archive has a shebang line, it may have the executable bit set on POSIX systems, to allow it to be executed directly.
pt_br: Se um arquivo de aplicação tiver uma linha shebang, ele poderá ter o bit executável definido em sistemas POSIX, para permitir que seja executado diretamente.

source: There is no requirement that the tools in this module are used to create application archives - the module is a convenience, but archives in the above format created by any means are acceptable to Python.
pt_br: Não há exigência de que as ferramentas neste módulo sejam usadas para criar arquivos de aplicações - o módulo é uma conveniência, mas arquivos no formato acima criados por qualquer meio são aceitáveis ​​para Python.
