Repository: python/python-docs-pt-br
Catalog: library/zipfile.po
Languages: pt_br

source: :mod:`!zipfile` --- Work with ZIP archives
pt_br: :mod:`!zipfile` --- Trabalha com arquivos ZIP

source: **Source code:** :source:`Lib/zipfile/`
pt_br: **Código-fonte:** :source:`Lib/zipfile/`

source: The ZIP file format is a common archive and compression standard. This module provides tools to create, read, write, append, and list a ZIP file. Any advanced use of this module will require an understanding of the format, as defined in `PKZIP Application Note`_.
pt_br: O formato de arquivo ZIP é um padrão de compactação e arquivamento. Este módulo fornece ferramentas para criar, ler, escrever, adicionar, e listar um arquivo ZIP. Qualquer uso avançado deste módulo vai exigir um entendimento do formato, como definido nas `Notas de Aplicação do PKZIP`_.

source: This module does not currently handle multi-disk ZIP files. It can handle ZIP files that use the ZIP64 extensions (that is ZIP files that are more than 4 GiB in size). It supports decryption of encrypted files in ZIP archives, but it currently cannot create an encrypted file. Decryption is extremely slow as it is implemented in native Python rather than C.
pt_br: Esse módulo atualmente não suporta arquivos ZIP multi-disco. Ele pode manipular arquivos ZIP que usam as extensões ZIP64 (ou seja arquivos ZIP com tamanho maior do que 4 Gb). Ele suporta descriptografia de arquivos criptografados dentro do ZIP, mas atualmente não pode criar um arquivo criptografado. A descriptografia é extremamente lenta pois é implementada em Python nativo ao invés de C.

source: The module defines the following items:
pt_br: Este módulo define os seguintes itens:

source: The error raised for bad ZIP files.
pt_br: Este erro é levantado para arquivos ZIP corrompidos.

source: Alias of :exc:`BadZipFile`, for compatibility with older Python versions.
pt_br: Alias para :exc:`BadZipFile`, para compatibilidade com versões mais antigas de Python.

source: The error raised when a ZIP file would require ZIP64 functionality but that has not been enabled.
pt_br: Este erro é levantado quando um arquivo ZIP precisa da funcionalidade ZIP64 que não está habilitada.

source: The class for reading and writing ZIP files. See section :ref:`zipfile-objects` for constructor details.
pt_br: A classe para ler e escrever arquivos ZIP. Veja a seção :ref:`zipfile-objects` para detalhes do construtor.

source: Class that implements a subset of the interface provided by :class:`pathlib.Path`, including the full :class:`importlib.resources.abc.Traversable` interface.
pt_br: Classe que implementa um subconjunto da interface fornecida por :class:`pathlib.Path`, incluindo a interface completa :class:`importlib.resources.abc.Traversable`.

source: Class for creating ZIP archives containing Python libraries.
pt_br: Classe para criar arquivos ZIP contendo bibliotecas Python.

source: Class used to represent information about a member of an archive. Instances of this class are returned by the :meth:`.getinfo` and :meth:`.infolist` methods of :class:`ZipFile` objects. Most users of the :mod:`zipfile` module will not need to create these, but only use those created by this module. *filename* should be the full name of the archive member, and *date_time* should be a tuple containing six fields which describe the time of the last modification to the file; the fields are described in section :ref:`zipinfo-objects`.
pt_br: Classe usada para representar informação sobre um membro de um archive. Instâncias desta classe são retornadas pelos métodos :meth:`.getinfo` e :meth:`.infolist` de objetos da classe :class:`ZipFile`. A maioria dos usuários do módulo :mod:`zipfile` não vai precisar criar, mas apenas usar objetos criados pelo módulo. *filename* deveria ser o caminho completo do membro do arquivo, e *date_time* deveria ser uma tupla contendo seis campos que descrevem o momento da última modificação no arquivo; os campos são descritos na seção :ref:`zipinfo-objects`.

source: A public :attr:`!compress_level` attribute has been added to expose the formerly protected :attr:`!_compresslevel`. The older protected name continues to work as a property for backwards compatibility.
pt_br: Um atributo público :attr:`!compress_level` foi adicionado para expor o :attr:`!_compresslevel` anteriormente protegido. O nome protegido mais antigo continua a funcionar como uma propriedade para compatibilidade com versões anteriores.

source: Resolve the date_time, compression attributes, and external attributes to suitable defaults as used by :meth:`ZipFile.writestr`.
pt_br: Resolve os atributos date_time, compression e external para padrões adequados, conforme usado por :meth:`ZipFile.writestr`.

source: Returns self for chaining.
pt_br: Retorna self para encadeamento.

source: Returns ``True`` if *filename* is a valid ZIP file based on its magic number, otherwise returns ``False``. *filename* may be a file or file-like object too.
pt_br: Retorna ``True`` se *filename* é um arquivo ZIP válido baseado no seu "magic number", caso contrário retorna ``False``. *filename* pode ser um arquivo ou um objeto arquivo ou similar também.

source: Support for file and file-like objects.
pt_br: Suporte para arquivo e objetos arquivo ou similares.

source: The numeric constant for an uncompressed archive member.
pt_br: Código numérico para um membro de um arquivo descompactado

source: The numeric constant for the usual ZIP compression method. This requires the :mod:`zlib` module.
pt_br: Código numérico para o método de compactação usual. Requer o módulo :mod:`zlib` .

source: The numeric constant for the BZIP2 compression method. This requires the :mod:`bz2` module.
pt_br: Código numérico para o método de compactação BZIP2. Requer o módulo :mod:`bz2`.

source: The numeric constant for the LZMA compression method. This requires the :mod:`lzma` module.
pt_br: Código numérico para o método de compactação LZMA. Requer o módulo :mod:`lzma`.

source: The ZIP file format specification has included support for bzip2 compression since 2001, and for LZMA compression since 2006. However, some tools (including older Python releases) do not support these compression methods, and may either refuse to process the ZIP file altogether, or fail to extract individual files.
pt_br: A especificação do formato ZIP incluiu suporte para compactação bzip2 desde 2001, e para compactação LZMA desde 2006. Porém, algumas ferramentas (incluindo versões mais antigas de Python) não suportam esses métodos de compactação, e podem recusar processar o arquivo ZIP como um todo, ou falhar em extrair arquivos individuais.

source: `PKZIP Application Note`_
pt_br: `Notas da Aplicação do PKZIP`_

source: Documentation on the ZIP file format by Phil Katz, the creator of the format and algorithms used.
pt_br: Documentação do formato de arquivo ZIP feita por Phil Katz, criador do formato e dos algoritmos usados.

source: `Info-ZIP Home Page <https://infozip.sourceforge.net/>`_
pt_br: `Site do Info-ZIP <https://infozip.sourceforge.net/>`_

source: Information about the Info-ZIP project's ZIP archive programs and development libraries.
pt_br: Informações sobre o programas de arquivamento e desenvolvimento de bibliotecas do projeto Info-ZIP.

source: ZipFile Objects
pt_br: Objetos ZipFile

source: Open a ZIP file, where *file* can be a path to a file (a string), a file-like object or a :term:`path-like object`.
pt_br: Abre um arquivo ZIP, onde *file* pode ser um caminho para um arquivo (uma string), um objeto arquivo ou similar, ou um :term:`objeto caminho ou similar`.

source: The *mode* parameter should be ``'r'`` to read an existing file, ``'w'`` to truncate and write a new file, ``'a'`` to append to an existing file, or ``'x'`` to exclusively create and write a new file. If *mode* is ``'x'`` and *file* refers to an existing file, a :exc:`FileExistsError` will be raised. If *mode* is ``'a'`` and *file* refers to an existing ZIP file, then additional files are added to it. If *file* does not refer to a ZIP file, then a new ZIP archive is appended to the file. This is meant for adding a ZIP archive to another file (such as :file:`python.exe`). If *mode* is ``'a'`` and the file does not exist at all, it is created. If *mode* is ``'r'`` or ``'a'``, the file should be seekable.
pt_br: O parâmetro *mode* deve ser ``'r'`` para ler um arquivo existente, ``'w'`` para truncar e gravar um novo arquivo, ``'a'`` para adicionar a um arquivo existente, ou ``'x'`` exclusivamente para criar e gravar um novo arquivo. Se o *mode* é ``'x'`` e *file* se refere a um arquivo existente, um :exc:`FileExistsError` vai ser levantado. Se o *mode* é ``'a'`` e *file* se refere a um arquivo ZIP existente, então arquivos adicionais são adicionados ao mesmo. Se *file* não se refere a um arquivo ZIP, então um novo arquivo ZIP é adicionado ao arquivo. Isso diz respeito a adicionar um arquivo ZIP a um outro arquivo (como por exemplo :file:`python.exe`). Se o *mode* é ``'a'`` e o arquivo não existe, ele será criado. Se o *mode* é ``'r'`` ou ``'a'``, o arquivo deve ser percorrível.

source: *compression* is the ZIP compression method to use when writing the archive, and should be :const:`ZIP_STORED`, :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` or :const:`ZIP_LZMA`; unrecognized values will cause :exc:`NotImplementedError` to be raised. If :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` or :const:`ZIP_LZMA` is specified but the corresponding module (:mod:`zlib`, :mod:`bz2` or :mod:`lzma`) is not available, :exc:`RuntimeError` is raised. The default is :const:`ZIP_STORED`.
pt_br: *compression* é o método de compactação ZIP para usar ao escrever o arquivo, e deve ser :const:`ZIP_STORED`, :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` ou :const:`ZIP_LZMA`; valores desconhecidos devem causar o levantamento de :exc:`NotImplementedError`. Se :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` ou :const:`ZIP_LZMA` for especificado mas o módulo correspondente (:mod:`zlib`, :mod:`bz2` ou :mod:`lzma`) não estiver disponível, é levado um :exc:`RuntimeError`. O valor padrão é :const:`ZIP_STORED`.

source: If *allowZip64* is ``True`` (the default) zipfile will create ZIP files that use the ZIP64 extensions when the zipfile is larger than 4 GiB. If it is ``false`` :mod:`zipfile` will raise an exception when the ZIP file would require ZIP64 extensions.
pt_br: Se *allowZip64* é ``True`` (valor padrão), então zipfile vai criar arquivos ZIP que usem as extensões ZIP64 quando o arquivo ZIP é maior do que 4 GiB. Se é ``false``, :mod:`zipfile` levanta uma exceção quando o arquivo ZIP precisaria das extensões ZIP64.

source: The *compresslevel* parameter controls the compression level to use when writing files to the archive. When using :const:`ZIP_STORED` or :const:`ZIP_LZMA` it has no effect. When using :const:`ZIP_DEFLATED` integers ``0`` through ``9`` are accepted (see :class:`zlib <zlib.compressobj>` for more information). When using :const:`ZIP_BZIP2` integers ``1`` through ``9`` are accepted (see :class:`bz2 <bz2.BZ2File>` for more information).
pt_br: O parâmetro *compresslevel* controla o nível de compactação para usar ao gravar no arquivo ZIP. Quando usado :const:`ZIP_STORED` ou :const:`ZIP_LZMA` não tem efeito. Quando usado :const:`ZIP_DEFLATED` inteiros de ``0`` a ``9`` são aceitos (veja :class:`zlib <zlib.compressobj>` para mais informações). Quando usado :const:`ZIP_BZIP2` inteiros de ``1`` a ``9`` são aceitos (veja :class:`bz2 <bz2.BZ2File>` para mais informações).

source: The *strict_timestamps* argument, when set to ``False``, allows to zip files older than 1980-01-01 at the cost of setting the timestamp to 1980-01-01. Similar behavior occurs with files newer than 2107-12-31, the timestamp is also set to the limit.
pt_br: O argumento *strict_timestamps*, quando definido como ``False``, permite compactar arquivos anteriores a 1980-01-01 com o custo de definir o carimbo de data/hora para 1980-01-01. Comportamento semelhante ocorre com arquivos mais recentes que 2107-12-31, o carimbo de data/hora também é definido como o limite.

source: When mode is ``'r'``, *metadata_encoding* may be set to the name of a codec, which will be used to decode metadata such as the names of members and ZIP comments.
pt_br: Quando o modo é ``'r'``, *metadata_encoding* pode ser definido como o nome de um codec, que será usado para decodificar metadados, como os nomes dos membros e comentários ZIP.

source: If the file is created with mode ``'w'``, ``'x'`` or ``'a'`` and then :meth:`closed <close>` without adding any files to the archive, the appropriate ZIP structures for an empty archive will be written to the file.
pt_br: Se o arquivo é criado com modo ``'w'``, ``'x'`` ou ``'a'`` e então :meth:`closed` sem adicionar nada ao arquivo, a estrutura própria para um arquivo vazio será escrita no arquivo.

source: ZipFile is also a context manager and therefore supports the :keyword:`with` statement. In the example, *myzip* is closed after the :keyword:`!with` statement's suite is finished---even if an exception occurs::
pt_br: ZipFile também é um gerenciador de contexto e portanto suporta a instrução :keyword:`with`. Neste exemplo, *myzip* é fechado ao final da execução da instrução :keyword:`!with` -- mesmo que ocorra uma exceção::

source: *metadata_encoding* is an instance-wide setting for the ZipFile. It is not currently possible to set this on a per-member basis.
pt_br: *metadata_encoding* é uma configuração em toda a instância para o ZipFile. Atualmente, não é possível definir isso em uma base por membro.

source: This attribute is a workaround for legacy implementations which produce archives with names in the current locale encoding or code page (mostly on Windows). According to the .ZIP standard, the encoding of metadata may be specified to be either IBM code page (default) or UTF-8 by a flag in the archive header. That flag takes precedence over *metadata_encoding*, which is a Python-specific extension.
pt_br: Este atributo é uma solução alternativa para implementações legadas que produzem arquivos com nomes na codificação da localidade atual ou página de código (principalmente no Windows). De acordo com o padrão .ZIP, a codificação dos metadados pode ser especificada como página de código IBM (padrão) ou UTF-8 por meio de um sinalizador no cabeçalho do arquivo. Esse sinalizador tem precedência sobre *metadata_encoding*, que é uma extensão específica do Python.

source: Added the ability to use :class:`ZipFile` as a context manager.
pt_br: Adicionado o uso de :class:`ZipFile` como um gerenciador de contexto.

source: Added support for :mod:`bzip2 <bz2>` and :mod:`lzma` compression.
pt_br: Adicionado suporte para compactação :mod:`bzip2 <bz2>` e :mod:`lzma`.

source: ZIP64 extensions are enabled by default.
pt_br: Extensões ZIP64 são habilitadas por padrão.

source: Added support for writing to unseekable streams. Added support for the ``'x'`` mode.
pt_br: Adicionado suporte para escrever em streams não percorríveis. Adicionado suporte ao modo ``'x'``.

source: Previously, a plain :exc:`RuntimeError` was raised for unrecognized compression values.
pt_br: Anteriormente, um simples :exc:`RuntimeError` era levantado para valores de compactação desconhecidos.

source: The *file* parameter accepts a :term:`path-like object`.
pt_br: O parâmetro *file* aceita um :term:`objeto caminho ou similar`.

source: Add the *compresslevel* parameter.
pt_br: Adicionado o parâmetro *compresslevel*.

source: The *strict_timestamps* keyword-only parameter.
pt_br: O parâmetro somente-nomeado *strict_timestamps*.

source: Added support for specifying member name encoding for reading metadata in the zipfile's directory and file headers.
pt_br: Adicionado suporte para especificar a codificação do nome do membro ao ler metadados no diretório e cabeçalhos de arquivo do arquivo zip.

source: Close the archive file. You must call :meth:`close` before exiting your program or essential records will not be written.
pt_br: Fecha o arquivo. Você deve chamar :meth:`close` antes de sair do seu programa ou registros essenciais não serão gravados.

source: Return a :class:`ZipInfo` object with information about the archive member *name*. Calling :meth:`getinfo` for a name not currently contained in the archive will raise a :exc:`KeyError`.
pt_br: Retorna um objeto :class:`ZipInfo` com informações sobre o *name* do membro do arquivo. Chamar :meth:`getinfo` para um nome não encontrado no arquivo levanta um :exc:`KeyError`.

source: Return a list containing a :class:`ZipInfo` object for each member of the archive. The objects are in the same order as their entries in the actual ZIP file on disk if an existing archive was opened.
pt_br: Retorna uma lista contendo um objeto :class:`ZipInfo` para cada membro do arquivo. Os objetos estão na mesma ordem das entradas no arquivo ZIP em disco se um arquivo existente foi aberto.

source: Return a list of archive members by name.
pt_br: Retorna uma lista de membros do arquivo por nome.

source: Access a member of the archive as a binary file-like object. *name* can be either the name of a file within the archive or a :class:`ZipInfo` object. The *mode* parameter, if included, must be ``'r'`` (the default) or ``'w'``. *pwd* is the password used to decrypt encrypted ZIP files as a :class:`bytes` object.
pt_br: Acessa um membro do arquivo como um objeto binário arquivo ou similar. *name* pode ser o nome de um arquivo membro ou um objeto :class:`ZipInfo`. O parâmetro *mode*, se informado, deve ser ``'r'`` (valor padrão) or ``'w'``. *pwd* é a senha usada para descriptografar arquivos ZIP criptografados como um objeto :class:`bytes`.

source: :meth:`~ZipFile.open` is also a context manager and therefore supports the :keyword:`with` statement::
pt_br: :meth:`~ZipFile.open` também é um gerenciador de contexto e, portanto, suporta a instrução :keyword:`with`::

source: With *mode* ``'r'`` the file-like object (``ZipExtFile``) is read-only and provides the following methods: :meth:`~io.BufferedIOBase.read`, :meth:`~io.IOBase.readline`, :meth:`~io.IOBase.readlines`, :meth:`~io.IOBase.seek`, :meth:`~io.IOBase.tell`, :meth:`~container.__iter__`, :meth:`~iterator.__next__`. These objects can operate independently of the ZipFile.
pt_br: Com *mode* ``'r'`` o objeto arquivo ou similar (``ZipExtFile``) é somente leitura e fornece os seguintes métodos: :meth:`~io.BufferedIOBase.read`, :meth:`~io.IOBase.readline`, :meth:`~io.IOBase.readlines`, :meth:`~io.IOBase.seek`, :meth:`~io.IOBase.tell`, :meth:`~container.__iter__`, :meth:`~iterator.__next__`. Esses objetos podem operar independentemente do ZipFile.

source: With ``mode='w'``, a writable file handle is returned, which supports the :meth:`~io.BufferedIOBase.write` method. While a writable file handle is open, attempting to read or write other files in the ZIP file will raise a :exc:`ValueError`.
pt_br: Com ``mode='w'``, é retornado um manipulador de arquivo, que suporta o método :meth:`~io.BufferedIOBase.write`. Quando um manipulador de arquivo modificável é aberto, tentativas de ler ou gravar outros arquivos no arquivo ZIP levanta um :exc:`ValueError`.

source: In both cases the file-like object has also attributes :attr:`!name`, which is equivalent to the name of a file within the archive, and :attr:`!mode`, which is ``'rb'`` or ``'wb'`` depending on the input mode.
pt_br: Em ambos os casos o objeto arquivo ou similar também possui atributos :attr:`!name`, que é equivalente ao nome de um arquivo dentro do arquivo, e :attr:`!mode`, que é ``'rb'`` ou ``'wb'`` dependendo do modo de entrada.

source: When writing a file, if the file size is not known in advance but may exceed 2 GiB, pass ``force_zip64=True`` to ensure that the header format is capable of supporting large files. If the file size is known in advance, construct a :class:`ZipInfo` object with :attr:`~ZipInfo.file_size` set, and use that as the *name* parameter.
pt_br: Ao gravar um arquivo, se o tamanho do arquivo não é conhecido mas pode exceder 2 GiB, passe ``force_zip64=True`` para assegurar que o formato do header é capaz de suportar arquivos grandes. Se o tamanho do arquivo é conhecido, construa um objeto :class:`ZipInfo` com :attr:`~ZipInfo.file_size` informado, então use-o como parâmetro *name*.

source: The :meth:`.open`, :meth:`read` and :meth:`extract` methods can take a filename or a :class:`ZipInfo` object. You will appreciate this when trying to read a ZIP file that contains members with duplicate names.
pt_br: Os métodos :meth:`.open`, :meth:`read` e :meth:`extract` podem receber um nome de arquivo ou um objeto :class:`ZipInfo`. Você vai gostar disso quando tentar ler um arquivo ZIP que contém membros com nomes duplicados.

source: Removed support of ``mode='U'``. Use :class:`io.TextIOWrapper` for reading compressed text files in :term:`universal newlines` mode.
pt_br: Removido suporte ao ``mode='U'``. Uso de :class:`io.TextIOWrapper` para leitura de arquivos texto compactados em modo de :term:`novas linhas universais`.

source: :meth:`ZipFile.open` can now be used to write files into the archive with the ``mode='w'`` option.
pt_br: :meth:`ZipFile.open` agora pode ser usado para escrever arquivos no aquivo compactado com a opção ``mode='w'``.

source: Calling :meth:`.open` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
pt_br: Chama :meth:`.open` em um ZipFile fechado levanta um :exc:`ValueError`. Anteriormente, um :exc:`RuntimeError` era levantado.

source: Added attributes :attr:`!name` and :attr:`!mode` for the writeable file-like object. The value of the :attr:`!mode` attribute for the readable file-like object was changed from ``'r'`` to ``'rb'``.
pt_br: Adicionados atributos :attr:`!name` e :attr:`!mode` para o objeto arquivo ou similar gravável. O valor do atributo :attr:`!mode` para o objeto arquivo ou similar legível foi alterado de ``'r'`` para ``'rb'``.

source: Extract a member from the archive to the current working directory; *member* must be its full name or a :class:`ZipInfo` object. Its file information is extracted as accurately as possible. *path* specifies a different directory to extract to. *member* can be a filename or a :class:`ZipInfo` object. *pwd* is the password used for encrypted files as a :class:`bytes` object.
pt_br: Extrai um membro do arquivo para o diretório atual; *member* deve ser o nome completo ou um objeto :class:`ZipInfo`. A informação do arquivo é extraída com maior precisão possível. *path* especifica um outro diretório em que deve ser gravado. *member* pode ser um nome de arquivo ou um objeto :class:`ZipInfo`. *pwd* é a senha usada para criptografar arquivos como um objeto :class:`bytes`.

source: Returns the normalized path created (a directory or new file).
pt_br: Retorna o caminho normalizado criado (um diretório ou novo arquivo).

source: If a member filename is an absolute path, a drive/UNC sharepoint and leading (back)slashes will be stripped, e.g.: ``///foo/bar`` becomes ``foo/bar`` on Unix, and ``C:\foo\bar`` becomes ``foo\bar`` on Windows. And all ``".."`` components in a member filename will be removed, e.g.: ``../../foo../../ba..r`` becomes ``foo../ba..r``. On Windows illegal characters (``:``, ``<``, ``>``, ``|``, ``"``, ``?``, and ``*``) replaced by underscore (``_``).
pt_br: Se um nome de arquivo membro é um caminho absoluto, o drive/UNC e (contra)barras no início serão removidos, por exemplo: ``///foo/bar`` se torna ``foo/bar`` no Unix, e ``C:\foo\bar`` vira ``foo\bar`` no Windows. E todos os componentes ``".."`` no nome de um arquivo membro serão removidos, por exemplo: ``../../foo../../ba..r`` vira ``foo../ba..r``. No Windows caracteres ilegais (``:``, ``<``, ``>``, ``|``, ``"``, ``?``, and ``*``) são substituídos por underscore (``_``).
