Repository: python/python-docs-pt-br
Catalog: library/zipfile.po
Languages: pt_br

source: Instances of the :class:`ZipInfo` class are returned by the :meth:`.getinfo` and :meth:`.infolist` methods of :class:`ZipFile` objects. Each object stores information about a single member of the ZIP archive.
pt_br: Instâncias da classe :class:`ZipInfo` são retornadas pelos métodos :meth:`.getinfo` e :meth:`.infolist` dos objetos :class:`ZipFile`. Cada objeto armazena informações sobre um único membro do arquivo ZIP.

source: There is one classmethod to make a :class:`ZipInfo` instance for a filesystem file:
pt_br: Existe um método de classe para fazer uma instância :class:`ZipInfo` para um arquivo de sistema de arquivos:

source: Construct a :class:`ZipInfo` instance for a file on the filesystem, in preparation for adding it to a zip file.
pt_br: Constrói uma instância :class:`ZipInfo` para um arquivo no sistema de arquivos, em preparação para adicioná-lo a um arquivo zip.

source: *filename* should be the path to a file or directory on the filesystem.
pt_br: *filename* deve ser o caminho para um arquivo ou diretório no sistema de arquivos.

source: If *arcname* is specified, it is used as the name within the archive. If *arcname* is not specified, the name will be the same as *filename*, but with any drive letter and leading path separators removed.
pt_br: Se *arcname* for especificado, ele será usado como o nome dentro do arquivo. Se *arcname* não for especificado, o nome será igual a *filename*, mas com qualquer letra de unidade e separadores de caminho removidos.

source: The *filename* parameter accepts a :term:`path-like object`.
pt_br: O parâmetro *filename* aceita um :term:`objeto caminho ou similar <path-like object>`.

source: Added the *strict_timestamps* keyword-only parameter.
pt_br: Adicionado o parâmetro somente-nomeado *strict_timestamps*.

source: Instances have the following methods and attributes:
pt_br: As instâncias têm os seguintes métodos e atributos:

source: Return ``True`` if this archive member is a directory.
pt_br: Retorna ``True`` se este membro do arquivo for um diretório.

source: This uses the entry's name: directories should always end with ``/``.
pt_br: Isso usa o nome da entrada: os diretórios devem sempre terminar com ``/``.

source: Name of the file in the archive.
pt_br: Nome do arquivo no pacote.

source: The time and date of the last modification to the archive member. This is a tuple of six values:
pt_br: A hora e a data da última modificação do membro do arquivo. Esta é uma tupla de seis valores:

source: Index
pt_br: Índice

source: Value
pt_br: Valor

source: Year (>= 1980)
pt_br: Ano (>= 1980)

source: Month (one-based)
pt_br: Mês (iniciado em 1)

source: Day of month (one-based)
pt_br: Dia do mês (iniciado em 1)

source: Hours (zero-based)
pt_br: Horas (iniciado em 0)

source: Minutes (zero-based)
pt_br: Minutos (base zero)

source: Seconds (zero-based)
pt_br: Segundos (iniciado em 0)

source: The ZIP file format does not support timestamps before 1980.
pt_br: O formato de arquivo ZIP não oferece suporte a carimbos de data/hora anteriores a 1980.

source: Type of compression for the archive member.
pt_br: Tipo de compressão do membro do pacote.

source: Comment for the individual archive member as a :class:`bytes` object.
pt_br: Comentário para o membro individual do pacote como um objeto :class:`bytes`.

source: Expansion field data. The `PKZIP Application Note`_ contains some comments on the internal structure of the data contained in this :class:`bytes` object.
pt_br: Dados do campo de expansão. O `PKZIP Application Note`_ contém alguns comentários sobre a estrutura interna dos dados contidos neste objeto :class:`bytes`.

source: System which created ZIP archive.
pt_br: O sistema que criou o pacote ZIP.

source: PKZIP version which created ZIP archive.
pt_br: A versão do PKZIP que criou o pacote ZIP.

source: PKZIP version needed to extract archive.
pt_br: A versão do PKZIP necessária para extrair o pacote.

source: Must be zero.
pt_br: Deve ser zero

source: ZIP flag bits.
pt_br: Bits de sinalizador do ZIP.

source: Volume number of file header.
pt_br: Número de volume do cabeçalho do arquivo.

source: Internal attributes.
pt_br: Atributos internos.

source: External file attributes.
pt_br: Atributos de arquivo externo.

source: Byte offset to the file header.
pt_br: Deslocamento de byte para o cabeçalho do arquivo.

source: CRC-32 of the uncompressed file.
pt_br: CRC-32 do arquivo não comprimido.

source: Size of the compressed data.
pt_br: Tamanho dos dados comprimidos.

source: Size of the uncompressed file.
pt_br: Tamanho do arquivo não comprimido.

source: Command-Line Interface
pt_br: Interface de Linha de Comando

source: The :mod:`zipfile` module provides a simple command-line interface to interact with ZIP archives.
pt_br: O módulo :mod:`zipfile` fornece uma interface de linha de comando simples para interagir com arquivos ZIP.

source: If you want to create a new ZIP archive, specify its name after the :option:`-c` option and then list the filename(s) that should be included:
pt_br: Se você deseja criar um novo arquivo ZIP, especifique seu nome após a opção :option:`-c` e, em seguida, liste os nomes dos arquivos que devem ser incluídos:

source: Passing a directory is also acceptable:
pt_br: Passar um diretório também é aceitável:

source: If you want to extract a ZIP archive into the specified directory, use the :option:`-e` option:
pt_br: Se você deseja extrair um arquivo ZIP para o diretório especificado, use a opção :option:`-e`:

source: For a list of the files in a ZIP archive, use the :option:`-l` option:
pt_br: Para obter uma lista dos arquivos em um arquivo ZIP, use a opção :option:`-l`:

source: Command-line options
pt_br: Opções de linha de comando

source: List files in a zipfile.
pt_br: Lista arquivos em um arquivo zip.

source: Create zipfile from source files.
pt_br: Cria um arquivo zip a partir dos arquivos fonte.

source: Extract zipfile into target directory.
pt_br: Extrai um arquivo zip para um diretório de destino.

source: Test whether the zipfile is valid or not.
pt_br: Testa se o arquivo zip é válido ou não.

source: Specify encoding of member names for :option:`-l`, :option:`-e` and :option:`-t`.
pt_br: Especifica a codificação dos nomes dos membros para :option:`-l`, :option:`-e` e :option:`-t`.

source: Decompression pitfalls
pt_br: Armadilhas de descompressão

source: The extraction in zipfile module might fail due to some pitfalls listed below.
pt_br: A extração no módulo zipfile pode falhar devido a algumas armadilhas listadas abaixo.

source: From file itself
pt_br: Do próprio arquivo

source: Decompression may fail due to incorrect password / CRC checksum / ZIP format or unsupported compression method / decryption.
pt_br: A descompactação pode falhar devido a senha / soma de verificação CRC / formato ZIP incorretos ou método de compactação / descriptografia não compatível.

source: File System limitations
pt_br: Limitações do sistema de arquivos

source: Exceeding limitations on different file systems can cause decompression failed. Such as allowable characters in the directory entries, length of the file name, length of the pathname, size of a single file, and number of files, etc.
pt_br: Exceder as limitações em sistemas de arquivos diferentes pode causar falha na descompactação. Como caracteres permitidos nas entradas do diretório, comprimento do nome do arquivo, comprimento do caminho, tamanho de um único arquivo e número de arquivos, etc.

source: Resources limitations
pt_br: Limitações de recursos

source: The lack of memory or disk volume would lead to decompression failed. For example, decompression bombs (aka `ZIP bomb`_) apply to zipfile library that can cause disk volume exhaustion.
pt_br: A falta de memória ou volume de disco levaria a uma falha de descompactação. Por exemplo, bombas de descompressão (também conhecidas como `ZIP bomb`_) aplicam-se à biblioteca de arquivos zip que podem causar o esgotamento do volume do disco.

source: Interruption
pt_br: Interrupção

source: Interruption during the decompression, such as pressing control-C or killing the decompression process may result in incomplete decompression of the archive.
pt_br: A interrupção durante a descompressão, como pressionar Control-C ou interromper o processo de descompressão pode resultar na descompressão incompleta do arquivo.

source: Default behaviors of extraction
pt_br: Comportamentos padrão da extração

source: Not knowing the default extraction behaviors can cause unexpected decompression results. For example, when extracting the same archive twice, it overwrites files without asking.
pt_br: Não saber os comportamentos de extração padrão pode causar resultados de descompressão inesperados. Por exemplo, ao extrair o mesmo arquivo duas vezes, ele sobrescreve os arquivos sem perguntar.
