Repository: python/python-docs-pt-br
Catalog: library/zipfile.po
Languages: pt_br

source: Calling :meth:`extract` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
pt_br: Chama :meth:`extract` em um ZipFile fechado levanto um :exc:`ValueError`. Anteriormente, um :exc:`RuntimeError` era levantado.

source: The *path* parameter accepts a :term:`path-like object`.
pt_br: O parâmetro *path* aceita um :term:`objeto caminho ou similar`.

source: Extract all members from the archive to the current working directory. *path* specifies a different directory to extract to. *members* is optional and must be a subset of the list returned by :meth:`namelist`. *pwd* is the password used for encrypted files as a :class:`bytes` object.
pt_br: Extrai todos os membros de um arquivo para o diretório atual. *path* especifica um diretório diferente para gravar os arquivos extraídos. *members* é opcional e deve ser um sub-conjunto da lista retornada por :meth:`namelist`. *pwd* é uma senha usada para criptografar arquivos como um objeto :class:`bytes`.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of *path*, e.g. members that have absolute filenames starting with ``"/"`` or filenames with two dots ``".."``. This module attempts to prevent that. See :meth:`extract` note.
pt_br: Nunca extrai arquivos de fontes não confiáveis sem inspeção prévia. É possível que os arquivos sejam criados fora do *path*, por exemplo membros que tem nomes absolutos de arquivos começando com ``"/"`` ou nomes com dois pontos ``".."``. Este módulo tenta prevenir isto. Veja nota em :meth:`extract`.

source: Calling :meth:`extractall` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
pt_br: Chama :meth:`extractall` em um ZipFile fechado levanta um :exc:`ValueError`. Anteriormente, um :exc:`RuntimeError` era levantado.

source: Print a table of contents for the archive to ``sys.stdout``.
pt_br: Imprime a tabela de conteúdos de um arquivo para ``sys.stdout``.

source: Set *pwd* (a :class:`bytes` object) as default password to extract encrypted files.
pt_br: Define *pwd* (um objeto :class:`bytes`) como senha padrão para extrair arquivos criptografados.

source: Return the bytes of the file *name* in the archive. *name* is the name of the file in the archive, or a :class:`ZipInfo` object. The archive must be open for read or append. *pwd* is the password used for encrypted files as a :class:`bytes` object and, if specified, overrides the default password set with :meth:`setpassword`. Calling :meth:`read` on a ZipFile that uses a compression method other than :const:`ZIP_STORED`, :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` or :const:`ZIP_LZMA` will raise a :exc:`NotImplementedError`. An error will also be raised if the corresponding compression module is not available.
pt_br: Retorna os bytes do arquivo *name* no arquivo compactado. *name* é o nome do arquivo no arquivo compactado, ou um objeto :class:`ZipInfo`. O arquivo compactado deve estar aberto para leitura ou acréscimo. *pwd* é a senha usada para arquivos criptografados como um objeto :class:`bytes` e, se especificada, vai sobrepor a senha padrão configurada com :meth:`setpassword`. Chamar :meth:`read` em um ZipFile que use um método de compactação diferente de :const:`ZIP_STORED`, :const:`ZIP_DEFLATED`, :const:`ZIP_BZIP2` ou :const:`ZIP_LZMA` levanta um :exc:`NotImplementedError`. Um erro também é levantado se o módulo de compactação correspondente não está disponível.

source: Calling :meth:`read` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
pt_br: Chama :meth:`read` em um ZipFile fechado levanta um :exc:`ValueError`. Anteriormente, um :exc:`RuntimeError` era levantado.

source: Read all the files in the archive and check their CRC's and file headers. Return the name of the first bad file, or else return ``None``.
pt_br: Lê todos os arquivos no arquivo compactado e verifica seus CRC's e cabeçalhos de arquivo. Retorna o nome do primeiro arquivo corrompido, or então retorna ``None``.

source: Calling :meth:`testzip` on a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
pt_br: Chama :meth:`testzip` em um ZipFile fechado levanta um :exc:`ValueError`. Anteriormente, um :exc:`RuntimeError` era levantado.

source: Write the file named *filename* to the archive, giving it the archive name *arcname* (by default, this will be the same as *filename*, but without a drive letter and with leading path separators removed). If given, *compress_type* overrides the value given for the *compression* parameter to the constructor for the new entry. Similarly, *compresslevel* will override the constructor if given. The archive must be open with mode ``'w'``, ``'x'`` or ``'a'``.
pt_br: Grava o arquivo chamado *filename* no arquivo compactado, dando ao arquivo compactado o nome *arcname* (por padrão, este é o mesmo de *filename*, mas sem a letra do drive e com separadores removidos do início do nome). Se informado, *compress_type* sobrescreve o valor dado ao parâmetro *compression* do construtor para a nova entrada. Da mesma forma, *compresslevel* vai sobrescrever o construtor se informado. O arquivo compactado deve ser aberto em modo ``'w'``, ``'x'`` ou ``'a'``.

source: The ZIP file standard historically did not specify a metadata encoding, but strongly recommended CP437 (the original IBM PC encoding) for interoperability. Recent versions allow use of UTF-8 (only). In this module, UTF-8 will automatically be used to write the member names if they contain any non-ASCII characters. It is not possible to write member names in any encoding other than ASCII or UTF-8.
pt_br: O padrão de arquivo ZIP historicamente não especificava uma codificação de metadados, mas recomendava fortemente o CP437 (a codificação original do PC da IBM) para interoperabilidade. Versões recentes permitem o uso de (somente) UTF-8. Neste módulo, o UTF-8 será automaticamente usado para escrever os nomes dos membros se eles contiverem caracteres não ASCII. Não é possível escrever nomes de membros em qualquer codificação que não seja ASCII ou UTF-8.

source: Archive names should be relative to the archive root, that is, they should not start with a path separator.
pt_br: Nomes de arquivo compactado devem ser relativos a raiz do mesmo, isto é, não devem começar com um separador de caminho.

source: If ``arcname`` (or ``filename``, if ``arcname`` is not given) contains a null byte, the name of the file in the archive will be truncated at the null byte.
pt_br: Se ``arcname`` (ou ``filename``, se ``arcname`` não for informado) contém um byte nulo, o nome do arquivo no arquivo compactado será truncado no byte nulo.

source: A leading slash in the filename may lead to the archive being impossible to open in some zip programs on Windows systems.
pt_br: Uma barra inicial no nome do arquivo pode fazer com que o arquivo seja impossível de abrir em alguns programas zip em sistemas Windows.

source: Calling :meth:`write` on a ZipFile created with mode ``'r'`` or a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
pt_br: Chama :meth:`write` em um ZipFile criado com modo ``'r'`` ou em um ZipFile fechado levanta um :exc:`ValueError`. Anteriormente, um :exc:`RuntimeError` era levantado

source: Write a file into the archive. The contents is *data*, which may be either a :class:`str` or a :class:`bytes` instance; if it is a :class:`str`, it is encoded as UTF-8 first. *zinfo_or_arcname* is either the file name it will be given in the archive, or a :class:`ZipInfo` instance. If it's an instance, at least the filename, date, and time must be given. If it's a name, the date and time is set to the current date and time. The archive must be opened with mode ``'w'``, ``'x'`` or ``'a'``.
pt_br: Grava um arquivo no arquivo compactado. O conteúdo é *data*, que pode ser uma instância de :class:`str` ou de :class:`bytes`; Se é uma :class:`str`, ela é encodada como UTF-8 primeiro. *zinfo_or_arcname* é o nome que será dado ao arquivo no arquivo compactado, ou uma instância de :class:`ZipInfo`. Se é uma instância, pelo menos o nome do arquivo, a data, e a hora devem ser informados. Se é um nome, a data e hora recebem a data e hora atual. O arquivo compactado deve ser aberto em modo ``'w'``, ``'x'`` ou ``'a'``.

source: If given, *compress_type* overrides the value given for the *compression* parameter to the constructor for the new entry, or in the *zinfo_or_arcname* (if that is a :class:`ZipInfo` instance). Similarly, *compresslevel* will override the constructor if given.
pt_br: Se informado, *compress_type* sobrescreve o valor do parâmetro *compression* do construtor para a nova entrada, ou no *zinfo_or_arcname* (se é uma instância de :class:`ZipInfo`). Da mesma forma, *compresslevel* vai sobrescrever o construtor se informado.

source: When passing a :class:`ZipInfo` instance as the *zinfo_or_arcname* parameter, the compression method used will be that specified in the *compress_type* member of the given :class:`ZipInfo` instance. By default, the :class:`ZipInfo` constructor sets this member to :const:`ZIP_STORED`.
pt_br: Quando é passada uma instância de :class:`ZipInfo` ou o parâmetro *zinfo_or_arcname*, o método de compactação usado será aquele especificado no *compress_type* da instância de :class:`ZipInfo`. Por padrão, o construtor da classe :class:`ZipInfo` seta este membro para :const:`ZIP_STORED`.

source: The *compress_type* argument.
pt_br: O argumento *compress_type*.

source: Calling :meth:`writestr` on a ZipFile created with mode ``'r'`` or a closed ZipFile will raise a :exc:`ValueError`. Previously, a :exc:`RuntimeError` was raised.
pt_br: Chama :meth:`writestr` em um ZipFile criado com modo ``'r'`` ou em um ZipFile fechado levanta um :exc:`ValueError`. Anteriormente, um :exc:`RuntimeError` era levantado.

source: Create a directory inside the archive. If *zinfo_or_directory* is a string, a directory is created inside the archive with the mode that is specified in the *mode* argument. If, however, *zinfo_or_directory* is a :class:`ZipInfo` instance then the *mode* argument is ignored.
pt_br: Cria um diretório dentro do arquivo. Se *zinfo_or_directory* for uma string, um diretório é criado dentro do arquivo com o modo especificado no argumento *mode*. No entanto, se *zinfo_or_directory* for uma instância :class:`ZipInfo`, o argumento *mode* é ignorado.

source: The archive must be opened with mode ``'w'``, ``'x'`` or ``'a'``.
pt_br: O arquivo deve ser aberto com o modo ``'w'``, ``'x'`` ou ``'a'``.

source: The following data attributes are also available:
pt_br: Os seguintes atributos de dados também estão disponíveis:

source: Name of the ZIP file.
pt_br: Nome do arquivo ZIP.

source: The level of debug output to use. This may be set from ``0`` (the default, no output) to ``3`` (the most output). Debugging information is written to ``sys.stdout``.
pt_br: O nível de saída de debug para usar. Pode ser setado de ``0`` (valor padrão, sem nenhuma saída) a ``3`` (com mais saída). A informação de debug é escrita em ``sys.stdout``.

source: The comment associated with the ZIP file as a :class:`bytes` object. If assigning a comment to a :class:`ZipFile` instance created with mode ``'w'``, ``'x'`` or ``'a'``, it should be no longer than 65535 bytes. Comments longer than this will be truncated.
pt_br: O comentário associado ao arquivo ZIP como um objeto :class:`bytes`. Se atribuir um comentário a uma instância :class:`ZipFile` criada com o modo ``'w'``, ``'x'`` ou ``'a'``, não deve ser maior que 65535 bytes. Comentários mais longos do que isso serão truncados.

source: The offset to the start of ZIP data from the beginning of the file. When the :class:`ZipFile` is opened in either mode ``'w'`` or ``'x'`` and the underlying file does not support ``tell()``, the value will be ``None`` instead.
pt_br: O deslocamento do início dos dados ZIP para o início do arquivo. Quando :class:`ZipFile` é aberto no modo ``'w'`` ou ``'x'`` e o arquivo subjacente não oferece suporte a ``tell()``, o valor será ``None``.

source: Path Objects
pt_br: Objetos Path

source: Construct a Path object from a ``root`` zipfile (which may be a :class:`ZipFile` instance or ``file`` suitable for passing to the :class:`ZipFile` constructor).
pt_br: Construir um objeto Path a partir de um arquivo zip ``root`` (que pode ser uma instância :class:`ZipFile` ou ``file`` adequado para passar para o construtor :class:`ZipFile`).

source: ``at`` specifies the location of this Path within the zipfile, e.g. 'dir/file.txt', 'dir/', or ''. Defaults to the empty string, indicating the root.
pt_br: ``at`` especifica a localização deste caminho dentro do arquivo zip, por exemplo, "dir/arquivo.txt", "dir/" ou "". O padrão é a string vazia, indicando a raiz.

source: The :class:`Path` class does not sanitize filenames within the ZIP archive. Unlike the :meth:`ZipFile.extract` and :meth:`ZipFile.extractall` methods, it is the caller's responsibility to validate or sanitize filenames to prevent path traversal vulnerabilities (e.g., filenames containing ".." or absolute paths). When handling untrusted archives, consider resolving filenames using :func:`os.path.abspath` and checking against the target directory with :func:`os.path.commonpath`.
pt_br: A classe :class:`Path` não sanitiza nomes de arquivos dentro do arquivo ZIP. Ao contrário dos métodos :meth:`ZipFile.extract` e :meth:`ZipFile.extractall`, é responsabilidade do chamador validar ou sanitizar nomes de arquivos para evitar vulnerabilidades de travessia de caminho (por exemplo, nomes de arquivos contendo ".." ou caminhos absolutos). Ao lidar com arquivos não confiáveis, considere resolver nomes de arquivos usando :func:`os.path.abspath` e verificar o diretório de destino com :func:`os.path.commonpath`.

source: Path objects expose the following features of :mod:`pathlib.Path` objects:
pt_br: Objetos Path expõem os seguintes recursos de objetos :mod:`pathlib.Path`:

source: Path objects are traversable using the ``/`` operator or ``joinpath``.
pt_br: Objetos Path podem ser percorridos usando o operador ``/`` ou ``joinpath``.

source: The final path component.
pt_br: O componente final do caminho.

source: Invoke :meth:`ZipFile.open` on the current path. Allows opening for read or write, text or binary through supported modes: 'r', 'w', 'rb', 'wb'. Positional and keyword arguments are passed through to :class:`io.TextIOWrapper` when opened as text and ignored otherwise. ``pwd`` is the ``pwd`` parameter to :meth:`ZipFile.open`.
pt_br: Invoca :meth:`ZipFile.open` no caminho atual. Permite a abertura para leitura ou escrita, texto ou binário através dos modos suportados: "r", "w", "rb", "wb". Argumentos posicionais e argumentos nomeados são passados para :class:`io.TextIOWrapper` quando abertos como texto e ignorados caso contrário. ``pwd`` é o parâmetro ``pwd`` para :meth:`ZipFile.open`.

source: Added support for text and binary modes for open. Default mode is now text.
pt_br: Adicionado suporte para modos de texto e binários para aberto. O modo padrão agora é texto.

source: The ``encoding`` parameter can be supplied as a positional argument without causing a :exc:`TypeError`. As it could in 3.9. Code needing to be compatible with unpatched 3.10 and 3.11 versions must pass all :class:`io.TextIOWrapper` arguments, ``encoding`` included, as keywords.
pt_br: O parâmetro ``encoding`` pode ser fornecido como um argumento posicional sem causar um :exc:`TypeError`. Como poderia em 3.9. O código que precisa ser compatível com as versões 3.10 e 3.11 não corrigidas deve passar todos os argumentos de :class:`io.TextIOWrapper`, incluindo ``encoding``, como palavras reservadas.

source: Enumerate the children of the current directory.
pt_br: Enumera os filhos do diretório atual.

source: Return ``True`` if the current context references a directory.
pt_br: Retorna ``True`` se o contexto atual fizer referência a um diretório.

source: Return ``True`` if the current context references a file.
pt_br: Retorna ``True`` se o contexto atual fizer referência a um arquivo.

source: Return ``True`` if the current context references a symbolic link.
pt_br: Retorna ``True`` se o contexto atual fizer referência a um link simbólico.

source: Previously, ``is_symlink`` would unconditionally return ``False``.
pt_br: Anteriormente, ``is_symlink`` retornava ``False`` incondicionalmente.

source: Return ``True`` if the current context references a file or directory in the zip file.
pt_br: Retorna ``True`` se o contexto atual fizer referência a um arquivo ou diretório no arquivo zip.

source: The last dot-separated portion of the final component, if any. This is commonly called the file extension.
pt_br: A última parte separada por pontos do componente final, se houver. Isso é comumente chamado de extensão de arquivo.

source: Added :data:`Path.suffix` property.
pt_br: Adicionada a propriedade :data:`Path.suffix`.

source: The final path component, without its suffix.
pt_br: O componente final do caminho, sem seu sufixo.

source: Added :data:`Path.stem` property.
pt_br: Adicionada a propriedade :data:`Path.stem`.

source: A list of the path’s suffixes, commonly called file extensions.
pt_br: Uma lista dos sufixos do caminho, comumente chamados de extensões de arquivo.

source: Added :data:`Path.suffixes` property.
pt_br: Adicionada a propriedade :data:`Path.suffixes`.

source: Read the current file as unicode text. Positional and keyword arguments are passed through to :class:`io.TextIOWrapper` (except ``buffer``, which is implied by the context).
pt_br: Leia o arquivo atual como texto Unicode. Argumentos posicionais e argumentos nomeados são passados para :class:`io.TextIOWrapper` (exceto ``buffer``, que está implícito no contexto).

source: Read the current file as bytes.
pt_br: Lê o arquivo atual como bytes.

source: Return a new Path object with each of the *other* arguments joined. The following are equivalent::
pt_br: Retorna um novo objeto Path com cada um dos *outros* argumentos unidos. Os seguintes são equivalentes::

source: Prior to 3.10, ``joinpath`` was undocumented and accepted exactly one parameter.
pt_br: Antes de 3.10, ``joinpath`` não estava documentado e aceitava exatamente um parâmetro.

source: The :pypi:`zipp` project provides backports of the latest path object functionality to older Pythons. Use ``zipp.Path`` in place of ``zipfile.Path`` for early access to changes.
pt_br: O projeto :pypi:`zipp` fornece backports da funcionalidade mais recente de objeto caminho para versões mais antigas do Pythons. Use ``zipp.Path`` internamente de ``zipfile.Path`` para acesso antecipado às alterações.

source: PyZipFile Objects
pt_br: Objetos PyZipFile

source: The :class:`PyZipFile` constructor takes the same parameters as the :class:`ZipFile` constructor, and one additional parameter, *optimize*.
pt_br: O construtor :class:`PyZipFile` usa os mesmos parâmetros que o construtor :class:`ZipFile`, e um parâmetro adicional, *otimize*.

source: Added the *optimize* parameter.
pt_br: Adicionado o parâmetro *optimize*.

source: Instances have one method in addition to those of :class:`ZipFile` objects:
pt_br: As instâncias têm um método além daqueles dos objetos :class:`ZipFile`:

source: Search for files :file:`\*.py` and add the corresponding file to the archive.
pt_br: Pesquisa por arquivos :file:`\*.py` e adiciona o arquivo correspondente ao arquivo.

source: If the *optimize* parameter to :class:`PyZipFile` was not given or ``-1``, the corresponding file is a :file:`\*.pyc` file, compiling if necessary.
pt_br: Se o parâmetro *optimize* para :class:`PyZipFile` não foi fornecido ou ``-1``, o arquivo correspondente é um arquivo :file:`\*.pyc`, compilando se necessário.

source: If the *optimize* parameter to :class:`PyZipFile` was ``0``, ``1`` or ``2``, only files with that optimization level (see :func:`compile`) are added to the archive, compiling if necessary.
pt_br: Se o parâmetro *Optimize* para :class:`PyZipFile` era ``0``, ``1`` ou ``2``, apenas arquivos com esse nível de otimização (ver :func:`compile`) são adicionados ao o arquivo, compilando se necessário.

source: If *pathname* is a file, the filename must end with :file:`.py`, and just the (corresponding :file:`\*.pyc`) file is added at the top level (no path information). If *pathname* is a file that does not end with :file:`.py`, a :exc:`RuntimeError` will be raised. If it is a directory, and the directory is not a package directory, then all the files :file:`\*.pyc` are added at the top level. If the directory is a package directory, then all :file:`\*.pyc` are added under the package name as a file path, and if any subdirectories are package directories, all of these are added recursively in sorted order.
pt_br: Se *pathname* for um arquivo, o nome do arquivo deverá terminar com :file:`.py`, e apenas o arquivo (:file:`\*.pyc` correspondente) será adicionado no nível superior (sem informações do caminho). Se *pathname* for um arquivo que não termine com :file:`.py`, um :exc:`RuntimeError` será levantado. Se for um diretório, e o diretório não for um diretório de pacotes, todos os arquivos :file:`\*.pyc` serão adicionados no nível superior. Se o diretório for um diretório de pacotes, todos :file:`\*.pyc` serão adicionados sob o nome do pacote como um caminho de arquivo e, se algum subdiretório for um diretório de pacotes, todos serão adicionados recursivamente na ordem de classificação.

source: *basename* is intended for internal use only.
pt_br: *basename* destina-se apenas a uso interno.

source: *filterfunc*, if given, must be a function taking a single string argument. It will be passed each path (including each individual full file path) before it is added to the archive. If *filterfunc* returns a false value, the path will not be added, and if it is a directory its contents will be ignored. For example, if our test files are all either in ``test`` directories or start with the string ``test_``, we can use a *filterfunc* to exclude them::
pt_br: *filterfunc*, se fornecido, deve ser uma função que recebe um único argumento de string. Cada caminho será passado (incluindo cada caminho de arquivo completo individual) antes de ser adicionado ao arquivo. Se *filterfunc* retornar um valor falso, o caminho não será adicionado e, se for um diretório, seu conteúdo será ignorado. Por exemplo, se nossos arquivos de teste estão todos nos diretórios ``test`` ou começam com a string ``test_``, podemos usar um *filterfunc* para excluí-los::

source: The :meth:`writepy` method makes archives with file names like this::
pt_br: O método :meth:`writepy` faz arquivos com nomes de arquivo como este::

source: string.pyc # Top level name test/__init__.pyc # Package directory test/testall.pyc # Module test.testall test/bogus/__init__.pyc # Subpackage directory test/bogus/myfile.pyc # Submodule test.bogus.myfile
pt_br: string.pyc # Nome de nível superior test/__init__.pyc # Diretório do pacote test/testall.pyc # Módulo test.testall test/bogus/__init__.pyc # Diretório do subpacote test/bogus/myfile.pyc # Submódulo test.bogus.myfile

source: Added the *filterfunc* parameter.
pt_br: Adicionado o parâmetro *filterfunc*.

source: The *pathname* parameter accepts a :term:`path-like object`.
pt_br: O parâmetro *pathname* aceita um :term:`objeto caminho ou similar <path-like object>`.

source: Recursion sorts directory entries.
pt_br: A recursão classifica as entradas de diretório.

source: ZipInfo Objects
pt_br: Objetos ZipInfo
