Repository: python/python-docs-pt-br
Catalog: library/zipimport.po
Languages: pt_br

source: :mod:`!zipimport` --- Import modules from Zip archives
pt_br: :mod:`!zipimport` - Importa módulos de arquivos Zip

source: **Source code:** :source:`Lib/zipimport.py`
pt_br: **Código-fonte:** :source:`Lib/zipimport.py`

source: This module adds the ability to import Python modules (:file:`\*.py`, :file:`\*.pyc`) and packages from ZIP-format archives. It is usually not needed to use the :mod:`zipimport` module explicitly; it is automatically used by the built-in :keyword:`import` mechanism for :data:`sys.path` items that are paths to ZIP archives.
pt_br: Este módulo adiciona a capacidade de importar módulos Python (:file:`\*.py`, :file:`\*.pyc`) e pacotes de arquivos em formato ZIP. Normalmente, não é necessário usar o módulo :mod:`zipimport` explicitamente; ele é usado automaticamente pelo mecanismo embutido :keyword:`import` para itens :data:`sys.path` que são caminhos para arquivos ZIP.

source: Typically, :data:`sys.path` is a list of directory names as strings. This module also allows an item of :data:`sys.path` to be a string naming a ZIP file archive. The ZIP archive can contain a subdirectory structure to support package imports, and a path within the archive can be specified to only import from a subdirectory. For example, the path :file:`example.zip/lib/` would only import from the :file:`lib/` subdirectory within the archive.
pt_br: Normalmente, :data:`sys.path` é uma lista de nomes de diretórios como strings. Este módulo também permite que um item de :data:`sys.path` seja uma string que nomeia um arquivo ZIP. O arquivo ZIP pode conter uma estrutura de subdiretório para suportar importações de pacotes, e um caminho dentro do arquivo pode ser especificado para importar apenas de um subdiretório. Por exemplo, o caminho :file:`example.zip/lib/` importaria apenas do subdiretório :file:`lib/` dentro do arquivo.

source: Any files may be present in the ZIP archive, but importers are only invoked for :file:`.py` and :file:`.pyc` files. ZIP import of dynamic modules (:file:`.pyd`, :file:`.so`) is disallowed. Note that if an archive only contains :file:`.py` files, Python will not attempt to modify the archive by adding the corresponding :file:`.pyc` file, meaning that if a ZIP archive doesn't contain :file:`.pyc` files, importing may be rather slow.
pt_br: Quaisquer arquivos podem estar presentes no arquivo ZIP, mas os importadores são invocados apenas para os arquivos :file:`.py` e :file:`.pyc`. A importação ZIP de módulos dinâmicos (:file:`.pyd`, :file:`.so`) não é permitida. Observe que, se um arquivo contiver apenas arquivos :file:`.py`, o Python não tentará modificá-lo adicionando o arquivo :file:`.pyc` correspondente, o que significa que, se um arquivo ZIP não contiver arquivos :file:`.pyc`, a importação poderá ser bastante lenta.

source: ZIP64 is supported
pt_br: ZIP64 é suportado

source: Previously, ZIP archives with an archive comment were not supported.
pt_br: Anteriormente, arquivos ZIP com um comentário de arquivo não eram suportados.

source: `PKZIP Application Note <https://pkware.cachefly.net/webdocs/casestudies/APPNOTE.TXT>`_
pt_br: `Nota da aplicação PKZIP <https://pkware.cachefly.net/webdocs/casestudies/APPNOTE.TXT>`_

source: Documentation on the ZIP file format by Phil Katz, the creator of the format and algorithms used.
pt_br: Documentação do formato de arquivo ZIP feita por Phil Katz, criador do formato e dos algoritmos usados.

source: :pep:`273` - Import Modules from Zip Archives
pt_br: :pep:`273` - Importar módulos de arquivos Zip

source: Written by James C. Ahlstrom, who also provided an implementation. Python 2.3 follows the specification in :pep:`273`, but uses an implementation written by Just van Rossum that uses the import hooks described in :pep:`302`.
pt_br: Escrito por James C. Ahlstrom, que também forneceu uma implementação. O Python 2.3 segue a especificação em :pep:`273`, mas usa uma implementação escrita por Just van Rossum que utiliza os ganchos de importação descritos em :pep:`302`.

source: :mod:`importlib` - The implementation of the import machinery
pt_br: :mod:`importlib` - A importação do maquinário de importação

source: Package providing the relevant protocols for all importers to implement.
pt_br: Pacote que fornece os protocolos relevantes para todos os importadores implementarem.

source: This module defines an exception:
pt_br: Este módulo define uma exceção:

source: Exception raised by zipimporter objects. It's a subclass of :exc:`ImportError`, so it can be caught as :exc:`ImportError`, too.
pt_br: Exceção levantada por objetos zipimporter. É uma subclasse de :exc:`ImportError`, portanto, também pode ser capturada como :exc:`ImportError`.

source: zipimporter Objects
pt_br: Objetos zipimporter

source: :class:`zipimporter` is the class for importing ZIP files.
pt_br: :class:`zipimporter` é a classe para importar arquivos ZIP.

source: Create a new zipimporter instance. *archivepath* must be a path to a ZIP file, or to a specific path within a ZIP file. For example, an *archivepath* of :file:`foo/bar.zip/lib` will look for modules in the :file:`lib` directory inside the ZIP file :file:`foo/bar.zip` (provided that it exists).
pt_br: Cria uma nova instância do zipimporter. *archivepath* deve ser um caminho para um arquivo ZIP ou para um caminho específico dentro de um arquivo ZIP. Por exemplo, um *archivepath* de :file:`foo/bar.zip/lib` procurará módulos no diretório :file:`lib` dentro do arquivo ZIP :file:`foo/bar.zip` (desde que exista).

source: :exc:`ZipImportError` is raised if *archivepath* doesn't point to a valid ZIP archive.
pt_br: :exc:`ZipImportError` é levantada se *archivepath* não apontar para um arquivo ZIP válido.

source: Methods ``find_loader()`` and ``find_module()``, deprecated in 3.10 are now removed. Use :meth:`find_spec` instead.
pt_br: Os métodos ``find_loader()`` e ``find_module()``, descontinuados na versão 3.10, foram removidos. Em vez disso, use :meth:`find_spec`.

source: Implementation of :meth:`importlib.abc.Loader.create_module` that returns :const:`None` to explicitly request the default semantics.
pt_br: Implementação de :meth:`importlib.abc.Loader.create_module` que retorna :const:`None` para solicitar explicitamente a semântica padrão.

source: Implementation of :meth:`importlib.abc.Loader.exec_module`.
pt_br: Implementação de :meth:`importlib.abc.Loader.exec_module`.

source: An implementation of :meth:`importlib.abc.PathEntryFinder.find_spec`.
pt_br: A implementação de :meth:`importlib.abc.PathEntryFinder.find_spec`.

source: Return the code object for the specified module. Raise :exc:`ZipImportError` if the module couldn't be imported.
pt_br: Retorna o objeto código para o módulo especificado. Gera :exc:`ZipImportError` se o módulo não puder ser importado.

source: Return the data associated with *pathname*. Raise :exc:`OSError` if the file wasn't found.
pt_br: Retorna os dados associados a *pathname*. Levanta :exc:`OSError` se o arquivo não for encontrado.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
pt_br: :exc:`IOError` costumava ser levantada, agora ele é um apelido para :exc:`OSError`.

source: Return the value ``__file__`` would be set to if the specified module was imported. Raise :exc:`ZipImportError` if the module couldn't be imported.
pt_br: Retorna o valor que ``__file__`` seria definido se o módulo especificado fosse importado. Levanta :exc:`ZipImportError` se o módulo não puder ser importado.

source: Return the source code for the specified module. Raise :exc:`ZipImportError` if the module couldn't be found, return :const:`None` if the archive does contain the module, but has no source for it.
pt_br: Retorna o código-fonte do módulo especificado. Levanta :exc:`ZipImportError` se o módulo não puder ser encontrado, e retorna :const:`None` se o arquivo contiver o módulo, mas não tiver o código-fonte para ele.

source: Return ``True`` if the module specified by *fullname* is a package. Raise :exc:`ZipImportError` if the module couldn't be found.
pt_br: Devolve ``True`` se o módulo especificado por *fullname* é um pacote. Levanta :exc:`ZipImportError` se o módulo não pode ser localizado.

source: Load the module specified by *fullname*. *fullname* must be the fully qualified (dotted) module name. Returns the imported module on success, raises :exc:`ZipImportError` on failure.
pt_br: Carrega o módulo especificado por *fullname*. *fullname* deve ser o nome completo (com pontos) do módulo. Retorna o módulo importado em caso de sucesso e levanta :exc:`ZipImportError` em caso de falha.

source: Use :meth:`exec_module` instead.
pt_br: Use :meth:`exec_module`.

source: Clear out the internal cache of information about files found within the ZIP archive.
pt_br: Limpa o cache interno de informações sobre arquivos encontrados no arquivo ZIP.

source: The file name of the importer's associated ZIP file, without a possible subpath.
pt_br: O nome do arquivo ZIP associado ao importador, sem um possível subcaminho.

source: The subpath within the ZIP file where modules are searched. This is the empty string for zipimporter objects which point to the root of the ZIP file.
pt_br: O subcaminho dentro do arquivo ZIP onde os módulos são pesquisados. Esta é a string vazia para objetos zipimporter que apontam para a raiz do arquivo ZIP.

source: The :attr:`archive` and :attr:`prefix` attributes, when combined with a slash, equal the original *archivepath* argument given to the :class:`zipimporter` constructor.
pt_br: Os atributos :attr:`archive` e :attr:`prefix`, quando combinados com uma barra, são iguais ao argumento original *archivepath* fornecido ao construtor da :class:`zipimporter`.

source: Examples
pt_br: Exemplos

source: Here is an example that imports a module from a ZIP archive - note that the :mod:`zipimport` module is not explicitly used.
pt_br: Aqui está um exemplo que importa um módulo de um arquivo ZIP - observe que o módulo :mod:`zipimport` não é usado explicitamente.

source: $ unzip -l example.zip Archive: example.zip Length Date Time Name -------- ---- ---- ---- 8467 11-26-02 22:30 jwzthreading.py -------- ------- 8467 1 file $ ./python Python 2.3 (#1, Aug 1 2003, 19:54:32) >>> import sys >>> sys.path.insert(0, 'example.zip') # Add .zip file to front of path >>> import jwzthreading >>> jwzthreading.__file__ 'example.zip/jwzthreading.py'
pt_br: $ unzip -l example.zip Archive: example.zip Length Date Time Name -------- ---- ---- ---- 8467 11-26-02 22:30 jwzthreading.py -------- ------- 8467 1 file $ ./python Python 2.3 (#1, Aug 1 2003, 19:54:32) >>> import sys >>> sys.path.insert(0, 'example.zip') # Adiciona arquivo .zip para a frente do caminho >>> import jwzthreading >>> jwzthreading.__file__ 'example.zip/jwzthreading.py'
