Repository: python/python-docs-pt-br
Catalog: library/zlib.po
Languages: pt_br

source: The version string of the zlib library that was used for building the module. This may be different from the zlib library actually used at runtime, which is available as :const:`ZLIB_RUNTIME_VERSION`.
pt_br: Uma string com a versão da biblioteca zlib que foi usada para construir o módulo. Isso pode ser diferente da biblioteca zlib realmente usada no tempo de execução, que está disponível como :const:`ZLIB_RUNTIME_VERSION`.

source: The version string of the zlib library actually loaded by the interpreter.
pt_br: Uma string com a versão da biblioteca zlib atualmente utilizada pelo interpretador.

source: The version string of the zlib-ng library that was used for building the module if zlib-ng was used. When present, the :data:`ZLIB_VERSION` and :data:`ZLIB_RUNTIME_VERSION` constants reflect the version of the zlib API provided by zlib-ng.
pt_br: A string de versão da biblioteca zlib-ng que foi usada para construir o módulo, caso o zlib-ng tenha sido usado. Quando presentes, as constantes :data:`ZLIB_VERSION` e :data:`ZLIB_RUNTIME_VERSION` refletem a versão da API zlib fornecida pelo zlib-ng.

source: If zlib-ng was not used to build the module, this constant will be absent.
pt_br: Se zlib-ng não foi usado para construir o módulo, esta constante estará ausente.

source: Module :mod:`gzip`
pt_br: módulo :mod:`gzip`

source: Reading and writing :program:`gzip`\ -format files.
pt_br: Leia e escreva arquivos no formato :program:`gzip`

source: The zlib library home page.
pt_br: A página inicial da biblioteca zlib.

source: The zlib manual explains the semantics and usage of the library's many functions.
pt_br: O manual da zlib explica a semântica e uso de diversas funções desta biblioteca.

source: In case gzip (de)compression is a bottleneck, the `python-isal`_ package speeds up (de)compression with a mostly compatible API.
pt_br: Caso a (des)compressão do gzip seja um gargalo, o pacote `python-isal`_ acelera a (des)compressão com uma API quase sempre compatível.

source: Cyclic Redundancy Check
pt_br: Do inglês: Cyclic Redundancy Check

source: checksum
pt_br: soma de verificação
