Repository: python/python-docs-pt-br
Catalog: library/zlib.po
Languages: pt_br

source: :mod:`!zlib` --- Compression compatible with :program:`gzip`
pt_br: :mod:`!zlib` --- Compactação compatível com :program:`gzip`

source: For applications that require data compression, the functions in this module allow compression and decompression, using the zlib library. The zlib library has its own home page at https://www.zlib.net. There are known incompatibilities between the Python module and versions of the zlib library earlier than 1.1.3; 1.1.3 has a `security vulnerability <https://zlib.net/zlib_faq.html#faq33>`_, so we recommend using 1.1.4 or later.
pt_br: Para aplicações que exigem compactação de dados, as funções deste módulo permitem a compactação e a descompactação, usando a biblioteca zlib. A biblioteca zlib tem sua própria página em https://www.zlib.net. Existem algumas incompatibilidades conhecidas entre o Python módulo e as versões da biblioteca zlib anteriores à 1.1.3; a 1.1.3 tem uma `vulnerabilidade de segurança <https://zlib.net/zlib_faq.html#faq33>`_, portanto, recomendamos o uso da 1.1.4 ou posterior.

source: zlib's functions have many options and often need to be used in a particular order. This documentation doesn't attempt to cover all of the permutations; consult the `zlib manual <https://www.zlib.net/manual.html>`_ for authoritative information.
pt_br: As funções do zlib têm muitas opções e geralmente precisam ser usadas em uma ordem específica. Esta documentação não tenta cobrir todas as permutações; consulte o `manual do zlib <https://www.zlib.net/manual.html>`_ para obter informações oficiais.

source: For reading and writing ``.gz`` files see the :mod:`gzip` module.
pt_br: Para leitura e escrita de arquivos ``.gz``, consulte o módulo :mod:`gzip`.

source: The available exception and functions in this module are:
pt_br: A exceção e as funções disponíveis neste módulo são:

source: Exception raised on compression and decompression errors.
pt_br: Exceção levantada em erros de compactação e descompactação.

source: Computes an Adler-32 checksum of *data*. (An Adler-32 checksum is almost as reliable as a CRC32 but can be computed much more quickly.) The result is an unsigned 32-bit integer. If *value* is present, it is used as the starting value of the checksum; otherwise, a default value of 1 is used. Passing in *value* allows computing a running checksum over the concatenation of several inputs. The algorithm is not cryptographically strong, and should not be used for authentication or digital signatures. Since the algorithm is designed for use as a checksum algorithm, it is not suitable for use as a general hash algorithm.
pt_br: Calcula uma soma de verificação Adler-32 de *data*. (Uma soma de verificação Adler-32 é quase tão confiável quanto uma CRC32, mas pode ser calculada muito mais rapidamente.) O resultado é um número inteiro sem sinal de 32 bits. Se *value* estiver presente, ele será usado como o valor inicial da soma de verificação; caso contrário, um valor padrão de 1 é usado. A passagem de *value* permite calcular uma soma de verificação em execução através da concatenação de várias entradas. O algoritmo não é criptograficamente forte e não deve ser usado para autenticação ou assinaturas digitais. Como o algoritmo foi projetado para uso como um algoritmo de soma de verificação, não é adequado para uso como um algoritmo de hash geral.

source: The result is always unsigned.
pt_br: O resultado é sempre sem sinal.

source: +9 to +15: The base-two logarithm of the window size, which therefore ranges between 512 and 32768. Larger values produce better compression at the expense of greater memory usage. The resulting output will include a zlib-specific header and trailer.
pt_br: +9 a +15: o logaritmo de base dois do tamanho da janela, que varia entre 512 e 32768. Valores maiores produzem melhor compactação às custas de maior uso de memória. A saída resultante incluirá um cabeçalho e uma sequência específicos para zlib.

source: −9 to −15: Uses the absolute value of *wbits* as the window size logarithm, while producing a raw output stream with no header or trailing checksum.
pt_br: -9 a -15: Usa o valor absoluto de *wbits* como o logaritmo do tamanho da janela, enquanto produz um fluxo de saída bruto sem cabeçalho ou soma de verificação à direita.

source: +25 to +31 = 16 + (9 to 15): Uses the low 4 bits of the value as the window size logarithm, while including a basic :program:`gzip` header and trailing checksum in the output.
pt_br: +25 a +31 = 16 + (9 a 15): Usa os 4 bits baixos do valor como logaritmo do tamanho da janela, incluindo um cabeçalho básico :program:`gzip` e a soma de verificação à direita na saída.

source: Raises the :exc:`error` exception if any error occurs.
pt_br: Levanta uma exceção do tipo :exc:`error`, se ocorrer algum erro.

source: *level* can now be used as a keyword parameter.
pt_br: *level* pode agora ser usado como um palavra reservada nomeada.

source: The *wbits* parameter is now available to set window bits and compression type.
pt_br: O parâmetro *wbits* agora está disponível para definir janelas de bits e tipo de compactação.

source: Returns a compression object, to be used for compressing data streams that won't fit into memory at once.
pt_br: Retorna um objeto de compactação, a ser usado para compactar fluxos de dados que não cabem na memória de uma só vez.

source: *method* is the compression algorithm. Currently, the only supported value is :const:`DEFLATED`.
pt_br: *method* é o algoritmo de compactação. Atualmente, o único valor suportado é :const:`DEFLATED`.

source: The *wbits* parameter controls the size of the history buffer (or the "window size"), and what header and trailer format will be used. It has the same meaning as `described for compress() <#compress-wbits>`__.
pt_br: O parâmetro *wbits* controla o tamanho do histórico buffer (ou o "tamanho da janela do buffer") e qual o formato do cabeçalho e do trailer serão usados. Ele tem o mesmo significado que o `descrito para compress() <#compress-wbits>`__.

source: The *memLevel* argument controls the amount of memory used for the internal compression state. Valid values range from ``1`` to ``9``. Higher values use more memory, but are faster and produce smaller output.
pt_br: O argumento *memLevel* controla a quantidade de memória usada para o estado de compactação interno. Os valores válidos variam de ``1`` a ``9``. Valores mais altos usam mais memória, mas são mais rápidos e produzem uma saída menor.

source: *zdict* is a predefined compression dictionary. This is a sequence of bytes (such as a :class:`bytes` object) containing subsequences that are expected to occur frequently in the data that is to be compressed. Those subsequences that are expected to be most common should come at the end of the dictionary.
pt_br: *zdict* é um dicionário de compactação predefinido. Esta é uma sequência de bytes (como um objeto :class:`bytes`) que contém subsequências que se espera que ocorram com frequência nos dados a serem compactados. As subsequências que se espera serem mais comuns devem aparecer no final do dicionário.

source: Added the *zdict* parameter and keyword argument support.
pt_br: Adicionado o suporte ao parâmetro e argumento nomeado *zdict*.

source: Computes a CRC (Cyclic Redundancy Check) checksum of *data*. The result is an unsigned 32-bit integer. If *value* is present, it is used as the starting value of the checksum; otherwise, a default value of 0 is used. Passing in *value* allows computing a running checksum over the concatenation of several inputs. The algorithm is not cryptographically strong, and should not be used for authentication or digital signatures. Since the algorithm is designed for use as a checksum algorithm, it is not suitable for use as a general hash algorithm.
pt_br: Calcula uma soma de verificação CRC (Cyclic Redundancy Check) de *data*. O resultado é um número inteiro sem sinal de 32 bits. Se *value* estiver presente, ele será usado como o valor inicial da soma de verificação; caso contrário, um valor padrão de 1 é usado. A passagem de *value* permite calcular uma soma de verificação em execução através da concatenação de várias entradas. O algoritmo não é criptograficamente forte e não deve ser usado para autenticação ou assinaturas digitais. Como o algoritmo foi projetado para uso como um algoritmo de soma de verificação, não é adequado para uso como um algoritmo de hash geral.

source: Decompresses the bytes in *data*, returning a bytes object containing the uncompressed data. The *wbits* parameter depends on the format of *data*, and is discussed further below. If *bufsize* is given, it is used as the initial size of the output buffer. Raises the :exc:`error` exception if any error occurs.
pt_br: Descompacta os bytes em *data*, retornando um objeto de bytes que contém os dados não compactados. O parâmetro *wbits* depende do formato de *data* e é discutido mais abaixo. Se *bufsize* for fornecido, ele será usado como o tamanho inicial do buffer de saída. Levanta a exceção :exc:`error` se ocorrer algum erro.

source: The *wbits* parameter controls the size of the history buffer (or "window size"), and what header and trailer format is expected. It is similar to the parameter for :func:`compressobj`, but accepts more ranges of values:
pt_br: O parâmetro *wbits* controla o tamanho do buffer do histórico (ou "tamanho da janela") e qual formato de cabeçalho e sequência é esperado. É semelhante ao parâmetro para :func:`compressobj`, mas aceita mais intervalos de valores:

source: +8 to +15: The base-two logarithm of the window size. The input must include a zlib header and trailer.
pt_br: +8 a +15: O logaritmo de base dois do tamanho da janela. A entrada deve incluir um cabeçalho e uma sequência de zlib.

source: 0: Automatically determine the window size from the zlib header. Only supported since zlib 1.2.3.5.
pt_br: 0: Determina automaticamente o tamanho da janela no cabeçalho zlib. Suportado apenas desde o zlib 1.2.3.5.

source: −8 to −15: Uses the absolute value of *wbits* as the window size logarithm. The input must be a raw stream with no header or trailer.
pt_br: −8 a −15: Usa o valor absoluto de *wbits* como o logaritmo do tamanho da janela. A entrada deve ser um fluxo bruto sem cabeçalho ou sequência.

source: +24 to +31 = 16 + (8 to 15): Uses the low 4 bits of the value as the window size logarithm. The input must include a gzip header and trailer.
pt_br: +24 a +31 = 16 + (8 a 15): Usa os 4 bits baixos do valor como logaritmo do tamanho da janela. A entrada deve incluir um cabeçalho e sequência de gzip.

source: +40 to +47 = 32 + (8 to 15): Uses the low 4 bits of the value as the window size logarithm, and automatically accepts either the zlib or gzip format.
pt_br: +40 a +47 = 32 + (8 a 15): Usa os 4 bits baixos do valor como logaritmo do tamanho da janela e aceita automaticamente o formato zlib ou gzip.

source: When decompressing a stream, the window size must not be smaller than the size originally used to compress the stream; using a too-small value may result in an :exc:`error` exception. The default *wbits* value corresponds to the largest window size and requires a zlib header and trailer to be included.
pt_br: Ao descompactar um fluxo, o tamanho da janela não deve ser menor que o tamanho originalmente usado para compactar o fluxo; o uso de um valor muito pequeno pode resultar em uma exceção :exc:`error`. O valor padrão *wbits* corresponde ao maior tamanho da janela e requer que um cabeçalho e uma sequência de zlib sejam incluídos.

source: *bufsize* is the initial size of the buffer used to hold decompressed data. If more space is required, the buffer size will be increased as needed, so you don't have to get this value exactly right; tuning it will only save a few calls to :c:func:`malloc`.
pt_br: *bufsize* é o tamanho inicial do buffer usado para armazenar dados descompactados. Se for necessário mais espaço, o tamanho do buffer será aumentado conforme necessário, para que você não precise obter esse valor exatamente correto; sintonizando, apenas algumas chamadas serão salvas em :c:func:`malloc`.

source: *wbits* and *bufsize* can be used as keyword arguments.
pt_br: *wbits* e *bufsize* podem ser usados como argumentos nomeados.

source: Returns a decompression object, to be used for decompressing data streams that won't fit into memory at once.
pt_br: Retorna um objeto descompactado, a ser usado para descompactar fluxos de dados que não cabem na memória de uma só vez.

source: The *wbits* parameter controls the size of the history buffer (or the "window size"), and what header and trailer format is expected. It has the same meaning as `described for decompress() <#decompress-wbits>`__.
pt_br: O parâmetro *wbits* controla o tamanho do histórico do buffer (ou o "tamanho da janela do buffer") e qual formato do cabeçalho e trailer são esperados. Ele tem o mesmo significado que o `descrito para decompress() <#decompress-wbits>`__.

source: The *zdict* parameter specifies a predefined compression dictionary. If provided, this must be the same dictionary as was used by the compressor that produced the data that is to be decompressed.
pt_br: O parâmetro *zdict* especifica uma dicionário pre-definido de compressão. Se fornecido, deve ser o mesmo dicionário usado pelo compressor que produziu os dados a serem descompactados.

source: If *zdict* is a mutable object (such as a :class:`bytearray`), you must not modify its contents between the call to :func:`decompressobj` and the first call to the decompressor's ``decompress()`` method.
pt_br: Se *zdict* for um objeto mutável (como um :class:`bytearray`), você não deve modificar seu conteúdo entre a chamada de :func:`decompressobj` e a primeira chamada para o método de descompatação ``decompress()``.

source: Added the *zdict* parameter.
pt_br: Adicionado o parâmetro *zdict*.

source: Compression objects support the following methods:
pt_br: Um objeto do tipo Compress oferece suporte aos seguintes métodos:

source: Compress *data*, returning a bytes object containing compressed data for at least part of the data in *data*. This data should be concatenated to the output produced by any preceding calls to the :meth:`compress` method. Some input may be kept in internal buffers for later processing.
pt_br: Comprime *data*, retornando um objeto de bytes que contém dados compactados para pelo menos parte dos dados em *data*. Esses dados devem ser concatenados à saída produzida por quaisquer chamadas anteriores ao método :meth:`compress`. Algumas entradas podem ser mantidas em buffers internos para processamento posterior.

source: Returns a copy of the compression object. This can be used to efficiently compress a set of data that share a common initial prefix.
pt_br: Retorna uma cópia do objeto de compactação. Isso pode ser usado para compactar com eficiência um conjunto de dados que compartilham um prefixo inicial comum.

source: Added :func:`copy.copy` and :func:`copy.deepcopy` support to compression objects.
pt_br: As funções :func:`copy.copy` e :func:`copy.deepcopy` foram adicionadas como suporte para a compressão de objetos.

source: Decompression objects support the following methods and attributes:
pt_br: Um objeto do tipo Decompress oferece suporte aos seguintes métodos:

source: A bytes object which contains any bytes past the end of the compressed data. That is, this remains ``b""`` until the last byte that contains compression data is available. If the whole bytestring turned out to contain compressed data, this is ``b""``, an empty bytes object.
pt_br: Um objeto de bytes que contém todos os bytes após o final dos dados compactados. Ou seja, ele permanece ``b""`` até que o último byte que contém dados compactados esteja disponível. Se todo o bytestring contiver dados compactados, este será ``b""``, um objeto de bytes vazio.

source: A bytes object that contains any data that was not consumed by the last :meth:`decompress` call because it exceeded the limit for the uncompressed data buffer. This data has not yet been seen by the zlib machinery, so you must feed it (possibly with further data concatenated to it) back to a subsequent :meth:`decompress` method call in order to get correct output.
pt_br: Um objeto de bytes que contém todos os dados que não foram consumidos pela última chamada :meth:`decompress` porque excederam o limite dos dados não compactados no buffer. Esses dados ainda não foram vistos pela zlib, portanto, você deve alimentá-los (possivelmente com outros dados concatenados a eles) em uma chamada subsequente para o método :meth:`decompress` e, com isso, obter a saída correta.

source: A boolean indicating whether the end of the compressed data stream has been reached.
pt_br: Um booleano indicando se o fim do fluxo de dados compactados foi alcançado.

source: This makes it possible to distinguish between a properly formed compressed stream, and an incomplete or truncated one.
pt_br: Isso permite distinguir entre um fluxo compactado formado corretamente e um fluxo incompleto ou truncado.

source: Decompress *data*, returning a bytes object containing the uncompressed data corresponding to at least part of the data in *string*. This data should be concatenated to the output produced by any preceding calls to the :meth:`decompress` method. Some of the input data may be preserved in internal buffers for later processing.
pt_br: Descompacta *data*, retornando um objeto de bytes que contém os dados não compactados correspondentes a pelo menos uma parte dos dados em *string*. Esses dados devem ser concatenados com a saída produzida por quaisquer chamadas anteriores ao método :meth:`decompress` . Alguns dos dados de entrada podem ser preservados em buffers internos para processamento posterior.

source: If the optional parameter *max_length* is non-zero then the return value will be no longer than *max_length*. This may mean that not all of the compressed input can be processed; and unconsumed data will be stored in the attribute :attr:`unconsumed_tail`. This bytestring must be passed to a subsequent call to :meth:`decompress` if decompression is to continue. If *max_length* is zero then the whole input is decompressed, and :attr:`unconsumed_tail` is empty.
pt_br: Se o parâmetro opcional *max_length* for diferente de zero, o valor retornado não será maior que *max_length*. Isso pode significar que nem toda a entrada compactada poderá ser processada, e os dados não consumidos serão armazenados no atributo :attr:`unconsumed_tail` . Esse bytestring deve ser passado para uma chamada subsequente a :meth:`decompress` se a descompressão tiver que continuar. Se *max_length* for zero, toda a entrada será descompactada e :attr:`unconsumed_tail` ficará vazio.

source: *max_length* can be used as a keyword argument.
pt_br: *max_length* pode ser usado como argumento nomeado.

source: All pending input is processed, and a bytes object containing the remaining uncompressed output is returned. After calling :meth:`flush`, the :meth:`decompress` method cannot be called again; the only realistic action is to delete the object.
pt_br: Toda a entrada que estiver pendente é processada e um objeto de bytes contendo a saída descompactada restante é retornado. Depois de chamar :meth:`flush`, o método :meth:`decompress` não pode ser chamado novamente; a única ação possível é excluir o objeto.

source: The optional parameter *length* sets the initial size of the output buffer.
pt_br: O parâmetro opcional *comprimento* define o tamanho inicial da saída do buffer.

source: Returns a copy of the decompression object. This can be used to save the state of the decompressor midway through the data stream in order to speed up random seeks into the stream at a future point.
pt_br: Retorna uma cópia do objeto de descompressão. Isso pode ser usado para salvar o estado do descompressor no meio do fluxo de dados, a fim de acelerar as buscas aleatórias no fluxo em um ponto futuro.

source: Added :func:`copy.copy` and :func:`copy.deepcopy` support to decompression objects.
pt_br: As funções :func:`copy.copy` e :func:`copy.deepcopy` foram adicionadas como suporte para a descompressão de objetos.

source: The following constants are available to configure compression and decompression behavior:
pt_br: As constantes a seguir estão disponíveis para configurar o comportamento de compactação e descompactação:

source: The deflate compression method.
pt_br: O método de compactação de deflação.

source: The maximum window size, expressed as a power of 2. For example, if :const:`!MAX_WBITS` is ``15`` it results in a window size of ``32 KiB``.
pt_br: O tamanho máximo da janela, expresso como uma potência de 2. Por exemplo, se :const:`!MAX_WBITS` for ``15``, isso resultará em um tamanho de janela de ``32 KiB``.

source: The default memory level for compression objects.
pt_br: O nível de memória padrão para objetos de compactação.

source: The default buffer size for decompression operations.
pt_br: O tamanho padrão do buffer para operações de descompactação.

source: Default compression strategy, for normal data.
pt_br: Estratégia de compactação padrão, para dados normais.

source: Compression strategy for data produced by a filter (or predictor).
pt_br: Estratégia de compactação para dados produzidos por um filtro (ou preditor).

source: Compression strategy that forces Huffman coding only.
pt_br: Estratégia de compactação que força codificação Huffman apenas.

source: Compression strategy that limits match distances to one (run-length encoding).
pt_br: Estratégia de compactação que limita distâncias de correspondência a um (codificação run-length).

source: This constant is only available if Python was compiled with zlib 1.2.0.1 or greater.
pt_br: Esta constante só estará disponível se o Python foi construído com zlib 1.2.0.1 ou superior.

source: Compression strategy that prevents the use of dynamic Huffman codes.
pt_br: Estratégia de compactação que impede o uso de códigos dinâmicos de Huffman.

source: This constant is only available if Python was compiled with zlib 1.2.2.2 or greater.
pt_br: Esta constante só estará disponível se o Python foi construído com zlib 1.2.2.2 ou superior.

source: Flush mode ``0``. No special flushing behavior.
pt_br: Modo de saída ``0``. Nenhum comportamento especial de saída.

source: Flush mode ``1``. Flush as much output as possible.
pt_br: Modo de saída ``1``. Emite o máximo de saída possível.

source: Flush mode ``2``. All output is flushed and the output is aligned to a byte boundary.
pt_br: Modo de saída ``2``. Toda saída é emitida e é alinhada a um limite de bytes.

source: Flush mode ``3``. All output is flushed and the compression state is reset.
pt_br: Modo de saída ``3``. Toda a saída é emitida e o estado de compactação é redefinido.

source: Flush mode ``4``. All pending input is processed, no more input is expected.
pt_br: Modo de saída ``4``. Toda entrada pendente é processada, nenhuma outra entrada é esperada.

source: Flush mode ``5``. A deflate block is completed and emitted.
pt_br: Modo de saída ``5``. Um bloco de deflação é concluído e emitido.

source: Flush mode ``6``, for inflate operations. Instructs inflate to return when it gets to the next deflate block boundary.
pt_br: Modo de saída ``6``, para operações de inflação. Instrui a inflação a retornar ao atingir o próximo limite do bloco de desinflação.

source: This constant is only available if Python was compiled with zlib 1.2.3.4 or greater.
pt_br: Esta constante está disponível apenas se o Python foi compilado com zlib 1.2.3.4 ou superior.

source: Information about the version of the zlib library in use is available through the following constants:
pt_br: As informações sobre o versão da biblioteca zlib em uso estão disponíveis no seguinte constantes:
