Repository: python/python-docs-pt-br
Catalog: distutils/commandref.po
Languages: pt_br

source: Command Reference
pt_br: Referência de Comando

source: Installing modules: the :command:`install` command family
pt_br: Instalando módulos modules: a família de comandos :command:`install`

source: The install command ensures that the build commands have been run and then runs the subcommands :command:`install_lib`, :command:`install_data` and :command:`install_scripts`.
pt_br: O comando de instalação garante que os comandos de compilação tenha sido executado e, então, executa os subcomandos :command:`install_lib`, :command:`install_data` e :command:`install_scripts`.

source: This command installs all data files provided with the distribution.
pt_br: Este comando instala todos os arquivos de dados fornecidos com a distribuição.

source: This command installs all (Python) scripts in the distribution.
pt_br: Este comando instala todos os scripts (Python) na distribuição.

source: Creating a source distribution: the :command:`sdist` command
pt_br: Criando uma distribuição de fontes: o comando :command:`sdist`

source: The manifest template commands are:
pt_br: Os comandos do modelo de manifesto são:

source: Command
pt_br: Comando

source: Description
pt_br: Description (descrição)

source: include all files matching any of the listed patterns
pt_br: inclui todos os arquivos que correspondem a qualquer um dos padrões listados

source: exclude all files matching any of the listed patterns
pt_br: exclui todos os arquivos que correspondem a qualquer um dos padrões listados

source: include all files under *dir* matching any of the listed patterns
pt_br: inclui todos os arquivos em *dir* que correspondam a qualquer um dos padrões listados

source: exclude all files under *dir* matching any of the listed patterns
pt_br: exclui todos os arquivos em *dir* que correspondam a qualquer um dos padrões listados

source: include all files anywhere in the source tree matching --- & any of the listed patterns
pt_br: inclui todos os arquivos em qualquer lugar na árvore de fontes correspondente --- e qualquer um dos padrões listados

source: exclude all files anywhere in the source tree matching --- & any of the listed patterns
pt_br: exclui todos os arquivos em qualquer lugar na árvore de fontes correspondente --- e qualquer um dos padrões listados

source: exclude all files under *dir*
pt_br: exclui todos os arquivos em *dir*

source: include all files under *dir*
pt_br: inclui todos os arquivos em *dir*

source: The patterns here are Unix-style "glob" patterns: ``*`` matches any sequence of regular filename characters, ``?`` matches any single regular filename character, and ``[range]`` matches any of the characters in *range* (e.g., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). The definition of "regular filename character" is platform-specific: on Unix it is anything except slash; on Windows anything except backslash or colon.
pt_br: Os padrões aqui são padrões "glob" no estilo Unix: ``*`` corresponde a qualquer sequência de caracteres regulares de nome de arquivo, ``?`` corresponde a qualquer caractere comum de nome de arquivo regular e ``[intervalo]`` corresponde a qualquer um dos caracteres em *intervalo* (por exemplo, ``az``, ``a-zA-Z``, ``a-f0-9_.``). A definição de "caractere de nome de arquivo comum" é específica da plataforma: no Unix, é qualquer coisa, exceto barra; no Windows qualquer coisa, exceto barra invertida ou dois pontos.
