Repository: python/python-docs-pt-br
Catalog: distutils/configfile.po
Languages: pt_br

source: Writing the Setup Configuration File
pt_br: Escrevendo o arquivo de configuração de instalação

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
pt_br: Este documento está sendo mantido apenas até que a documentação do ``setuptools`` em https://setuptools.readthedocs.io/en/latest/setuptools.html cubra independentemente todas as informações relevantes atualmente incluídas aqui.

source: Often, it's not possible to write down everything needed to build a distribution *a priori*: you may need to get some information from the user, or from the user's system, in order to proceed. As long as that information is fairly simple---a list of directories to search for C header files or libraries, for example---then providing a configuration file, :file:`setup.cfg`, for users to edit is a cheap and easy way to solicit it. Configuration files also let you provide default values for any command option, which the installer can then override either on the command-line or by editing the config file.
pt_br: Frequentemente, não é possível escrever tudo o que é necessário para construir uma distribuição *a priori*: você pode precisar obter algumas informações do usuário, ou do sistema do usuário, para prosseguir. Contanto que essa informação seja bastante simples -- uma lista de diretórios para pesquisar arquivos de cabeçalho C ou bibliotecas, por exemplo -- então fornecer um arquivo de configuração, :file:`setup.cfg`, para os usuários editarem é um maneira pouco custosa e fácil de solicitá-la. Os arquivos de configuração também permitem fornecer valores padrão para qualquer opção de comando, que o instalador pode então substituir na linha de comando ou editando o arquivo de configuração.

source: The setup configuration file is a useful middle-ground between the setup script---which, ideally, would be opaque to installers [#]_---and the command-line to the setup script, which is outside of your control and entirely up to the installer. In fact, :file:`setup.cfg` (and any other Distutils configuration files present on the target system) are processed after the contents of the setup script, but before the command-line. This has several useful consequences:
pt_br: O arquivo de configuração de instalação é um meio-termo útil entre o script de instalação -- que, idealmente, deveria ser utilizado sem que os instaladores se preocupem com seu conteúdo [#]_ -- e a linha de comando para o script de instalação, que está fora do seu controle e inteiramente a cargo do instalador. Na verdade, :file:`setup.cfg` (e quaisquer outros arquivos de configuração Distutils presentes no sistema de destino) são processados após o conteúdo do script de instalação, mas antes da linha de comando. Isso tem várias consequências úteis:

source: installers can override some of what you put in :file:`setup.py` by editing :file:`setup.cfg`
pt_br: os instaladores podem substituir parte do que você colocou em :file:`setup.py` editando :file:`setup.cfg`

source: you can provide non-standard defaults for options that are not easily set in :file:`setup.py`
pt_br: você pode fornecer valores iniciais fora do padrão para opções que não são facilmente definidas em :file:`setup.py`

source: installers can override anything in :file:`setup.cfg` using the command-line options to :file:`setup.py`
pt_br: os instaladores podem substituir qualquer coisa em :file:`setup.cfg` usando as opções de linha de comando para :file:`setup.py`

source: The basic syntax of the configuration file is simple:
pt_br: A sintaxe básica do arquivo de configuração é simples:

source: where *command* is one of the Distutils commands (e.g. :command:`build_py`, :command:`install`), and *option* is one of the options that command supports. Any number of options can be supplied for each command, and any number of command sections can be included in the file. Blank lines are ignored, as are comments, which run from a ``'#'`` character until the end of the line. Long option values can be split across multiple lines simply by indenting the continuation lines.
pt_br: sendo *command* um dos comandos Distutils (por exemplo :command:`build_py`, :command:`install`) e *option* uma das opções as quais o comando tem suporte. Qualquer número de opções pode ser fornecido para cada comando e qualquer número de seções de comando pode ser incluído no arquivo. As linhas em branco são ignoradas, assim como os comentários, que vão de um caractere ``'#'`` até o final da linha. Valores de opção longas podem ser divididos em várias linhas simplesmente indentando as linhas de continuação.

source: You can find out the list of options supported by a particular command with the universal :option:`!--help` option, e.g.
pt_br: Você pode descobrir a lista de opções suportadas por um comando específico com a opção universal :option:`!--help`, por exemplo.

source: Note that an option spelled :option:`!--foo-bar` on the command-line is spelled ``foo_bar`` in configuration files.
pt_br: Note que uma opção escrita :option:`!--foo-bar` na linha de comando é escrita ``foo_bar`` nos arquivos de configuração.

source: For example, say you want your extensions to be built "in-place"---that is, you have an extension :mod:`pkg.ext`, and you want the compiled extension file (:file:`ext.so` on Unix, say) to be put in the same source directory as your pure Python modules :mod:`pkg.mod1` and :mod:`pkg.mod2`. You can always use the :option:`!--inplace` option on the command-line to ensure this:
pt_br: Por exemplo, digamos que você queira que suas extensões sejam construídas "localmente" -- isto é, você tem uma extensão :mod:`pkg.ext`, e deseja o arquivo de extensão compilado (:file:`ext.so` no Unix, digamos) para serem colocados no mesmo diretório fonte de seus módulos Python puros :mod:`pkg.mod1` e :mod:`pkg.mod2`. Você sempre pode usar a opção :option:`!--inplace` na linha de comando para garantir isso:

source: But this requires that you always specify the :command:`build_ext` command explicitly, and remember to provide :option:`!--inplace`. An easier way is to "set and forget" this option, by encoding it in :file:`setup.cfg`, the configuration file for this distribution:
pt_br: Mas isso requer que você sempre especifique o comando :command:`build_ext` explicitamente, e que lembre-se de fornecer :option:`!--inplace`. Uma maneira mais fácil é "definir e esquecer" esta opção, codificando-a em :file:`setup.cfg`, o arquivo de configuração para esta distribuição:

source: This will affect all builds of this module distribution, whether or not you explicitly specify :command:`build_ext`. If you include :file:`setup.cfg` in your source distribution, it will also affect end-user builds---which is probably a bad idea for this option, since always building extensions in-place would break installation of the module distribution. In certain peculiar cases, though, modules are built right in their installation directory, so this is conceivably a useful ability. (Distributing extensions that expect to be built in their installation directory is almost always a bad idea, though.)
pt_br: Isso afetará todas as construções desta distribuição de módulo, quer você especifique explicitamente ou não :command:`build_ext`. Se você incluir um :file:`setup.cfg` em sua distribuição fonte, isso também afetará as construções do usuário final -- o que provavelmente é uma má ideia para esta opção, já que sempre construir extensões localmente interromperia a instalação da distribuição de módulo. Em certos casos peculiares, porém, os módulos são construídos diretamente em seu diretório de instalação, portanto, esta é uma capacidade útil. (Distribuir extensões que esperam ser construídas em seu diretório de instalação é quase sempre uma má ideia, no entanto.)

source: Another example: certain commands take a lot of options that don't change from run to run; for example, :command:`bdist_rpm` needs to know everything required to generate a "spec" file for creating an RPM distribution. Some of this information comes from the setup script, and some is automatically generated by the Distutils (such as the list of files installed). But some of it has to be supplied as options to :command:`bdist_rpm`, which would be very tedious to do on the command-line for every run. Hence, here is a snippet from the Distutils' own :file:`setup.cfg`:
pt_br: Outro exemplo: certos comandos aceitam muitas opções que não mudam de execução para execução; por exemplo, :command:`bdist_rpm` precisa saber tudo o que é necessário para gerar um arquivo "spec" para criar uma distribuição RPM. Algumas dessas informações vêm do script de configuração e outras são geradas automaticamente pelo Distutils (como a lista de arquivos instalados). Mas algumas delas devem ser fornecidas como opções para :command:`bdist_rpm`, o que seria muito tedioso de fazer na linha de comando para cada execução. Portanto, aqui está um trecho de código do :file:`setup.cfg` do próprio Distutils:

source: Note that the ``doc_files`` option is simply a whitespace-separated string split across multiple lines for readability.
pt_br: Note que a opção ``doc_files`` é simplesmente uma string separada por espaços em branco dividida em várias linhas para facilitar a leitura.

source: :ref:`inst-config-syntax` in "Installing Python Modules"
pt_br: :ref:`inst-config-syntax` em "Instalando Módulos Python"

source: More information on the configuration files is available in the manual for system administrators.
pt_br: Mais informações sobre os arquivos de configuração estão disponíveis no manual para administradores de sistema.

source: Footnotes
pt_br: Notas de rodapé

source: This ideal probably won't be achieved until auto-configuration is fully supported by the Distutils.
pt_br: Este ideal provavelmente não será alcançado até que a configuração automática seja totalmente suportada pelo Distutils.
