Repository: python/python-docs-pt-br
Catalog: distutils/examples.po
Languages: pt_br

source: Examples
pt_br: Exemplos

source: This chapter provides a number of basic examples to help get started with distutils. Additional information about using distutils can be found in the Distutils Cookbook.
pt_br: Este capítulo fornece vários exemplos básicos para ajudar a começar com distutils. Informações adicionais sobre o uso de distutils podem ser encontradas no Distutils Cookbook.

source: Collection of recipes showing how to achieve more control over distutils.
pt_br: Coleção de receitas mostrando como obter mais controle sobre distutils.

source: Pure Python distribution (by module)
pt_br: Distribuição Python pura (por módulo)

source: If you're just distributing a couple of modules, especially if they don't live in a particular package, you can specify them individually using the ``py_modules`` option in the setup script.
pt_br: Se você está apenas distribuindo alguns módulos, especialmente se eles não residem em um pacote específico, você pode especificá-los individualmente usando a opção ``py_modules`` no script de instalação.

source: In the simplest case, you'll have two files to worry about: a setup script and the single module you're distributing, :file:`foo.py` in this example::
pt_br: No caso mais simples, você terá dois arquivos com os quais se preocupar: um script de instalação e o único módulo que você está distribuindo :file:`foo.py` neste exemplo::

source: (In all diagrams in this section, *<root>* will refer to the distribution root directory.) A minimal setup script to describe this situation would be::
pt_br: (Em todos os diagramas desta seção, *<root>* se refere ao diretório raiz da distribuição.) Um script de instalação mínimo para descrever essa situação seria::

source: Note that the name of the distribution is specified independently with the ``name`` option, and there's no rule that says it has to be the same as the name of the sole module in the distribution (although that's probably a good convention to follow). However, the distribution name is used to generate filenames, so you should stick to letters, digits, underscores, and hyphens.
pt_br: Observe que o nome da distribuição é especificado independentemente com a opção ``name``, e não existe uma regra que diga que deve ser igual ao nome do único módulo na distribuição (embora seja provavelmente uma boa convenção a seguir ) No entanto, o nome da distribuição é usado para gerar nomes de arquivos, portanto, você deve usar letras, dígitos, sublinhados e hífenes.

source: Since ``py_modules`` is a list, you can of course specify multiple modules, eg. if you're distributing modules :mod:`foo` and :mod:`bar`, your setup might look like this::
pt_br: Como ``py_modules`` é uma lista, é claro que você pode especificar vários módulos, por exemplo. se você estiver distribuindo os módulos :mod:`foo` e :mod:`bar`, sua configuração poderá ser assim::

source: and the setup script might be ::
pt_br: e o script de configuração pode ser ::

source: You can put module source files into another directory, but if you have enough modules to do that, it's probably easier to specify modules by package rather than listing them individually.
pt_br: Você pode colocar os arquivos fonte do módulo em outro diretório, mas se você tiver módulos suficientes para fazer isso, provavelmente será mais fácil especificar módulos por pacote do que listá-los individualmente.

source: Pure Python distribution (by package)
pt_br: Distribuição Python pura (por pacote)

source: If you have more than a couple of modules to distribute, especially if they are in multiple packages, it's probably easier to specify whole packages rather than individual modules. This works even if your modules are not in a package; you can just tell the Distutils to process modules from the root package, and that works the same as any other package (except that you don't have to have an :file:`__init__.py` file).
pt_br: Se você tiver mais do que alguns módulos para distribuir, especialmente se estiverem em vários pacotes, provavelmente será mais fácil especificar pacotes inteiros do que módulos individuais. Isso funciona mesmo que seus módulos não estejam em um pacote; você pode simplesmente dizer ao Distutils para processar os módulos do pacote raiz, e isso funciona da mesma forma que em qualquer outro pacote (exceto que você não precisa ter um arquivo :file:`__init__.py`).

source: The setup script from the last example could also be written as ::
pt_br: O script de instalação do último exemplo também pode ser escrito como ::

source: (The empty string stands for the root package.)
pt_br: (A string vazia representa o pacote raiz.)

source: If those two files are moved into a subdirectory, but remain in the root package, e.g.::
pt_br: Se esses dois arquivos forem movidos para um subdiretório, mas permanecerem no pacote raiz, por exemplo::

source: then you would still specify the root package, but you have to tell the Distutils where source files in the root package live::
pt_br: você ainda especificaria o pacote raiz, mas precisará informar ao Distutils onde estão os arquivos fonte no pacote raiz::

source: More typically, though, you will want to distribute multiple modules in the same package (or in sub-packages). For example, if the :mod:`foo` and :mod:`bar` modules belong in package :mod:`foobar`, one way to layout your source tree is ::
pt_br: Mais tipicamente, porém, você deseja distribuir vários módulos no mesmo pacote (ou em subpacotes). Por exemplo, se os módulos :mod:`foo` e :mod:`bar` pertencem ao pacote :mod:`foobar`, uma maneira de fazer o layout da sua árvore de fontes é ::

source: This is in fact the default layout expected by the Distutils, and the one that requires the least work to describe in your setup script::
pt_br: Na verdade, esse é o layout padrão esperado pelo Distutils e o que exige menos trabalho para descrever no seu script de instalação::

source: If you want to put modules in directories not named for their package, then you need to use the ``package_dir`` option again. For example, if the :file:`src` directory holds modules in the :mod:`foobar` package::
pt_br: Se você quiser colocar módulos em diretórios não nomeados para o pacote, precisará usar a opção ``package_dir`` novamente. Por exemplo, se o diretório :file:`src` contiver módulos no pacote :mod:`foobar`::

source: an appropriate setup script would be ::
pt_br: um script de instalação apropriado seria ::

source: Or, you might put modules from your main package right in the distribution root::
pt_br: Ou, você pode colocar módulos do seu pacote principal diretamente na raiz da distribuição::

source: in which case your setup script would be ::
pt_br: nesse caso, seu script de instalação seria ::

source: (The empty string also stands for the current directory.)
pt_br: (A string vazia também representa o diretório atual.)

source: If you have sub-packages, they must be explicitly listed in ``packages``, but any entries in ``package_dir`` automatically extend to sub-packages. (In other words, the Distutils does *not* scan your source tree, trying to figure out which directories correspond to Python packages by looking for :file:`__init__.py` files.) Thus, if the default layout grows a sub-package::
pt_br: Se você possui subpacotes, eles devem ser listados explicitamente em ``packages``, mas qualquer entrada em ``package_dir`` se estende automaticamente aos subpacotes. (Em outras palavras, o Distutils *não* varre sua árvore de fontes, tentando descobrir quais diretórios correspondem aos pacotes Python procurando :file:`__init__.py`.) Portanto, se o layout padrão aumentar um subpacote::

source: then the corresponding setup script would be ::
pt_br: então o script de instalação correspondente seria ::

source: Single extension module
pt_br: Módulo de extensão única

source: Extension modules are specified using the ``ext_modules`` option. ``package_dir`` has no effect on where extension source files are found; it only affects the source for pure Python modules. The simplest case, a single extension module in a single C source file, is::
pt_br: Os módulos de extensão são especificados usando a opção ``ext_modules``. ``package_dir`` não afeta onde os arquivos de origem das extensões são encontrados; isso afeta apenas a fonte dos módulos Python puros. O caso mais simples, um único módulo de extensão em um único arquivo de origem C, é::

source: If the :mod:`foo` extension belongs in the root package, the setup script for this could be ::
pt_br: Se a extensão :mod:`foo` pertencer ao pacote raiz, o script de instalação para isso pode ser ::

source: If the extension actually belongs in a package, say :mod:`foopkg`, then
pt_br: Se a extensão realmente pertence a um pacote, diga :mod:`foopkg`, então

source: With exactly the same source tree layout, this extension can be put in the :mod:`foopkg` package simply by changing the name of the extension::
pt_br: Com exatamente o mesmo layout da árvore de fontes, esta extensão pode ser colocada no pacote :mod:`foopkg` simplesmente alterando o nome da extensão::

source: Checking a package
pt_br: Verificando um Pacote

source: The ``check`` command allows you to verify if your package meta-data meet the minimum requirements to build a distribution.
pt_br: O comando ``check`` permite verificar se os metadados do seu pacote atendem aos requisitos mínimos para compilar uma distribuição.

source: To run it, just call it using your :file:`setup.py` script. If something is missing, ``check`` will display a warning.
pt_br: Para executá-lo, basta chamá-lo usando o script :file:`setup.py`. Se algo estiver faltando, ``check`` exibirá um aviso.

source: Let's take an example with a simple script::
pt_br: Vamos dar um exemplo com um script simples::

source: Running the ``check`` command will display some warnings:
pt_br: A execução do comando ``check`` exibirá alguns avisos:

source: If you use the reStructuredText syntax in the ``long_description`` field and `docutils`_ is installed you can check if the syntax is fine with the ``check`` command, using the ``restructuredtext`` option.
pt_br: Se você usar a sintaxe reStructuredText no campo ``long_description`` e o `docutils`_ estiver instalado, poderá verificar se a sintaxe está correta com o comando ``check``, usando a opção ``restructuredtext``.

source: For example, if the :file:`setup.py` script is changed like this::
pt_br: Por exemplo, se o script :file:`setup.py` for alterado assim::

source: Where the long description is broken, ``check`` will be able to detect it by using the :mod:`docutils` parser:
pt_br: Onde a descrição longa está quebrada, ``check`` poderá detectá-la usando o analisador :mod:`docutils`::

source: Reading the metadata
pt_br: Lendo os metadados

source: The :func:`distutils.core.setup` function provides a command-line interface that allows you to query the metadata fields of a project through the ``setup.py`` script of a given project:
pt_br: A função :func:`distutils.core.setup` fornece uma interface de linha de comando que permite consultar os campos de metadados de um projeto através do script ``setup.py`` de um projeto fornecido:

source: This call reads the ``name`` metadata by running the :func:`distutils.core.setup` function. Although, when a source or binary distribution is created with Distutils, the metadata fields are written in a static file called :file:`PKG-INFO`. When a Distutils-based project is installed in Python, the :file:`PKG-INFO` file is copied alongside the modules and packages of the distribution under :file:`NAME-VERSION-pyX.X.egg-info`, where ``NAME`` is the name of the project, ``VERSION`` its version as defined in the Metadata, and ``pyX.X`` the major and minor version of Python like ``2.7`` or ``3.2``.
pt_br: Essa chamada lê os metadados ``name`` executando a função :func:`distutils.core.setup`. Embora, quando uma distribuição de origem ou binária é criada com o Distutils, os campos de metadados sejam gravados em um arquivo estático chamado :file:`PKG-INFO`. Quando um projeto baseado no Distutils é instalado no Python, o arquivo :file:`PKG-INFO` é copiado juntamente com os módulos e pacotes da distribuição em :file:`NOME-VERSÃO-pyX.X.egg-info`, em que ``NOME`` é o nome do projeto, ``VERSÃO`` sua versão conforme definida nos metadados e ``pyX.X`` a versão principal e secundária do Python, como ``2.7`` ou ``3.2``.

source: You can read back this static file, by using the :class:`distutils.dist.DistributionMetadata` class and its :func:`read_pkg_file` method::
pt_br: Você pode ler novamente esse arquivo estático usando a classe :class:`distutils.dist.DistributionMetadata` e seu método :func:`read_pkg_file`::

source: Notice that the class can also be instantiated with a metadata file path to loads its values::
pt_br: Observe que a classe também pode ser instanciada com um caminho de arquivo de metadados para carregar seus valores::
