Repository: python/python-docs-pt-br
Catalog: distutils/introduction.po
Languages: pt_br

source: An Introduction to Distutils
pt_br: Uma Introdução ao Distutils

source: This document covers using the Distutils to distribute your Python modules, concentrating on the role of developer/distributor: if you're looking for information on installing Python modules, you should refer to the :ref:`install-index` chapter.
pt_br: Este documento trata do uso do Distutils tornando possível a distribuição dos seus módulos Python, podendo assim, concentrar-se no seu papel de desenvolvedor/distribuidor: caso estejas procurando informações sobre a instalação de módulos Python, deverás consultar o capítulo :ref:`install-index`.

source: Concepts & Terminology
pt_br: Conceitos & Terminologias

source: Using the Distutils is quite simple, both for module developers and for users/administrators installing third-party modules. As a developer, your responsibilities (apart from writing solid, well-documented and well-tested code, of course!) are:
pt_br: Utilizar o Distutils é bastante simples, tanto para desenvolvedores de módulos quanto para usuários/administradores que instalam módulos de terceiros. Como desenvolvedor, suas responsabilidades (além de escrever um código sólido, bem documentado e bem testado, é claro!) são:

source: write a setup script (:file:`setup.py` by convention)
pt_br: escrever um script setup (:file:`setup.py` através da conversão)

source: (optional) write a setup configuration file
pt_br: (opcional) escrever um arquivo Setup de configuração

source: create a source distribution
pt_br: criando o fonte de uma distribuição

source: (optional) create one or more built (binary) distributions
pt_br: (opcional) crie uma ou mais distribuições build (binárias)

source: Each of these tasks is covered in this document.
pt_br: Cada uma dessas tarefas são tratadas neste documento.

source: Not all module developers have access to a multitude of platforms, so it's not always feasible to expect them to create a multitude of built distributions. It is hoped that a class of intermediaries, called *packagers*, will arise to address this need. Packagers will take source distributions released by module developers, build them on one or more platforms, and release the resulting built distributions. Thus, users on the most popular platforms will be able to install most popular Python module distributions in the most natural way for their platform, without having to run a single setup script or compile a line of code.
pt_br: Nem todos os desenvolvedores de módulos têm acesso a uma infinidade de plataformas, portanto, nem sempre é possível esperar que eles criem uma infinidade de distribuições construídas. Espera-se que uma classe de intermediários, chamada *empacotadores*, surja para atender a essa necessidade. Os empacotadores pegam as distribuições de código-fonte lançadas pelos desenvolvedores do módulo, as compilam em uma ou mais plataformas e lançam as distribuições compiladas resultantes. Assim, os usuários das plataformas mais populares poderão instalar as distribuições mais populares de módulos Python da maneira mais natural possível para sua plataforma, sem precisar executar um único script de configuração ou compilar uma linha de código.

source: A Simple Example
pt_br: Um Exemplo Simples

source: The setup script is usually quite simple, although since it's written in Python, there are no arbitrary limits to what you can do with it, though you should be careful about putting arbitrarily expensive operations in your setup script. Unlike, say, Autoconf-style configure scripts, the setup script may be run multiple times in the course of building and installing your module distribution.
pt_br: O script de configuração geralmente é bastante simples, embora, como esteja escrito em Python, não haja limites arbitrários para o que você pode fazer com ele, mas você deve ter cuidado ao colocar operações arbitrariamente caras em seu script de configuração. Ao contrário, digamos, dos scripts de configuração no estilo Autoconf, o script de instalação pode ser executado várias vezes no decorrer da compilação e instalação da distribuição do módulo.

source: If all you want to do is distribute a module called :mod:`foo`, contained in a file :file:`foo.py`, then your setup script can be as simple as this::
pt_br: Se tudo o que você quer fazer é distribuir um módulo chamado :mod:`foo`, contido em um arquivo :file:`foo.py`, então seu script de instalação pode ser tão simples quanto este::

source: Some observations:
pt_br: Algumas observações:

source: most information that you supply to the Distutils is supplied as keyword arguments to the :func:`setup` function
pt_br: a maioria das informações que fornecerás ao Distutils será fornecida como keyword argument pela função :func:`setup`

source: those keyword arguments fall into two categories: package metadata (name, version number) and information about what's in the package (a list of pure Python modules, in this case)
pt_br: esses argumentos nomeados se enquadram em duas categorias: metadados do pacote (nome, número da versão) e informações sobre o conteúdo do pacote (uma lista de módulos Python puros, neste caso)

source: modules are specified by module name, not filename (the same will hold true for packages and extensions)
pt_br: módulos são especificados pelo nome do módulo, não pelo nome do arquivo (o mesmo se aplica aos pacotes e extensões)

source: it's recommended that you supply a little more metadata, in particular your name, email address and a URL for the project (see section :ref:`setup-script` for an example)
pt_br: é recomendável que você forneça um pouco mais de metadados, em particular seu nome, endereço de e-mail e uma URL para o projeto (consulte a seção :ref:`setup-script` por exemplo)

source: To create a source distribution for this module, you would create a setup script, :file:`setup.py`, containing the above code, and run this command from a terminal::
pt_br: Para criar uma distribuição de fontes para este módulo, você deve criar um script de instalação, :file:`setup.py`, contendo o código acima, e executar este comando a partir de um terminal:

source: For Windows, open a command prompt window (:menuselection:`Start --> Accessories`) and change the command to::
pt_br: No Windows, abra uma janela do prompt de comando (:menuselection:`Iniciar --> Acessórios`) e altere o comando para::

source: :command:`sdist` will create an archive file (e.g., tarball on Unix, ZIP file on Windows) containing your setup script :file:`setup.py`, and your module :file:`foo.py`. The archive file will be named :file:`foo-1.0.tar.gz` (or :file:`.zip`), and will unpack into a directory :file:`foo-1.0`.
pt_br: :command:`sdist` criará um arquivo (por exemplo, tarball no Unix, arquivo ZIP no Windows) contendo seu script de instalação :file:`setup.py` e seu módulo :file:`foo.py`. O arquivo será nomeado :file:`foo-1.0.tar.gz` (ou :file:`.zip`) e será descompactado em um diretório :file:`foo-1.0`.

source: If an end-user wishes to install your :mod:`foo` module, all they have to do is download :file:`foo-1.0.tar.gz` (or :file:`.zip`), unpack it, and---from the :file:`foo-1.0` directory---run ::
pt_br: Se um usuário final deseja instalar o seu módulo :mod:`foo`, tudo o que eles precisam fazer é baixar :file:`foo-1.0.tar.gz` (ou :file:`.zip`), descompactá-lo, e --- no diretório :file:`foo-1.0` --- executar::

source: which will ultimately copy :file:`foo.py` to the appropriate directory for third-party modules in their Python installation.
pt_br: que finalmente copiará :file:`foo.py` para o diretório apropriado para módulos de terceiros em sua instalação do Python.

source: This simple example demonstrates some fundamental concepts of the Distutils. First, both developers and installers have the same basic user interface, i.e. the setup script. The difference is which Distutils *commands* they use: the :command:`sdist` command is almost exclusively for module developers, while :command:`install` is more often for installers (although most developers will want to install their own code occasionally).
pt_br: Este exemplo simples demonstra alguns conceitos fundamentais dos Distutils. Primeiro, desenvolvedores e instaladores têm a mesma interface de usuário básica, ou seja, o script de instalação. A diferença é que *comandos* do Distutils eles usam: o comando :command:`sdist` é quase exclusivamente para desenvolvedores de módulos, enquanto :command:`install` é mais frequentemente para instaladores (embora a maioria dos desenvolvedores deseje instalar ocasionalmente seu próprio código).

source: If you want to make things really easy for your users, you can create one or more built distributions for them. For instance, if you are running on a Windows machine, and want to make things easy for other Windows users, you can create an executable installer (the most appropriate type of built distribution for this platform) with the :command:`bdist_wininst` command. For example::
pt_br: Se você quiser facilitar as coisas para seus usuários, poderá criar uma ou mais distribuições criadas para eles. Por exemplo, se você estiver executando em uma máquina Windows e quiser facilitar as coisas para outros usuários do Windows, poderá criar um instalador executável (o tipo mais apropriado de distribuição integrada para esta plataforma) com o comando :command:`bdist_wininst` . Por exemplo::

source: will create an executable installer, :file:`foo-1.0.win32.exe`, in the current directory.
pt_br: irá criar um instalador executável, :file:`foo-1.0.win32.exe`, no diretório atual.

source: Other useful built distribution formats are RPM, implemented by the :command:`bdist_rpm` command, Solaris :program:`pkgtool` (:command:`bdist_pkgtool`), and HP-UX :program:`swinstall` (:command:`bdist_sdux`). For example, the following command will create an RPM file called :file:`foo-1.0.noarch.rpm`::
pt_br: Outros formatos de distribuição úteis úteis são o RPM, implementado pelo comando :command:`bdist_rpm`, :program:`pkgtool` do Solaris (:command:`bdist_pkgtool`) e :program:`swinstall` do HP-UX (:command:`bdist_sdux`). Por exemplo, o seguinte comando criará um arquivo RPM chamado :file:`foo-1.0.noarch.rpm`::

source: (The :command:`bdist_rpm` command uses the :command:`rpm` executable, therefore this has to be run on an RPM-based system such as Red Hat Linux, SuSE Linux, or Mandrake Linux.)
pt_br: (O comando :command:`bdist_rpm` usa o executável :command:`rpm`, portanto, ele deve ser executado em um sistema baseado em RPM, como Red Hat Linux, SuSE Linux ou Mandrake Linux.)

source: You can find out what distribution formats are available at any time by running ::
pt_br: Você pode descobrir quais formatos de distribuição estão disponíveis a qualquer momento executando::

source: General Python terminology
pt_br: Terminologia geral do Python

source: If you're reading this document, you probably have a good idea of what modules, extensions, and so forth are. Nevertheless, just to be sure that everyone is operating from a common starting point, we offer the following glossary of common Python terms:
pt_br: Se você está lendo este documento, provavelmente tem uma boa ideia do que são módulos, extensões e assim por diante. No entanto, apenas para ter certeza de que todos estão operando de um ponto de partida comum, oferecemos o seguinte glossário de termos comuns do Python:

source: module
pt_br: módulo

source: the basic unit of code reusability in Python: a block of code imported by some other code. Three types of modules concern us here: pure Python modules, extension modules, and packages.
pt_br: a unidade básica de reutilização de código em Python: um bloco de código importado por algum outro código. Três tipos de módulos nos preocupam aqui: módulos Python puros, módulos de extensão e pacotes.

source: pure Python module
pt_br: pure Python module (módulo Python puro)

source: a module written in Python and contained in a single :file:`.py` file (and possibly associated :file:`.pyc` files). Sometimes referred to as a "pure module."
pt_br: um módulo escrito em Python e contido em um único arquivo :file:`.py` (e possivelmente arquivos :file:`.pyc` associados). Às vezes referido como um "módulo puro".

source: extension module
pt_br: módulo de extensão

source: a module written in the low-level language of the Python implementation: C/C++ for Python, Java for Jython. Typically contained in a single dynamically loadable pre-compiled file, e.g. a shared object (:file:`.so`) file for Python extensions on Unix, a DLL (given the :file:`.pyd` extension) for Python extensions on Windows, or a Java class file for Jython extensions. (Note that currently, the Distutils only handles C/C++ extensions for Python.)
pt_br: um módulo escrito na linguagem de baixo nível da implementação Python: C/C++ para Python, Java para Jython. Normalmente contido em um único arquivo pré-compilado carregável dinamicamente, por exemplo, um arquivo de objeto compartilhado (:file:`.so`) para extensões Python no Unix, uma DLL (dada a extensão :file:`.pyd`) para extensões Python no Windows ou um arquivo de classe Java para extensões Jython. (Observe que, atualmente, o Distutils só lida com extensões C/C++ para Python.)

source: package
pt_br: pacote

source: a module that contains other modules; typically contained in a directory in the filesystem and distinguished from other directories by the presence of a file :file:`__init__.py`.
pt_br: um módulo que contém outros módulos; tipicamente contido em um diretório no sistema de arquivos e diferenciado de outros diretórios pela presença de um arquivo :file:`__init__.py`.

source: root package
pt_br: root package (pacote raiz)

source: the root of the hierarchy of packages. (This isn't really a package, since it doesn't have an :file:`__init__.py` file. But we have to call it something.) The vast majority of the standard library is in the root package, as are many small, standalone third-party modules that don't belong to a larger module collection. Unlike regular packages, modules in the root package can be found in many directories: in fact, every directory listed in ``sys.path`` contributes modules to the root package.
pt_br: a raiz da hierarquia de pacotes. (Este não é realmente um pacote, uma vez que não possui um arquivo :file:`__init__.py`. Mas temos que chamá-lo de alguma coisa.) A grande maioria da biblioteca padrão está no pacote raiz, assim como muitos módulos pequenos e independentes de terceiros que não pertencem a uma coleção de módulos maior. Ao contrário dos pacotes regulares, os módulos no pacote raiz podem ser encontrados em muitos diretórios: na verdade, cada diretório listado em ``sys.path`` contribui com módulos para o pacote raiz.

source: Distutils-specific terminology
pt_br: Terminologia específica do Distutils

source: The following terms apply more specifically to the domain of distributing Python modules using the Distutils:
pt_br: Os termos a seguir se aplicam mais especificamente ao domínio de distribuição de módulos Python usando Distutils:

source: module distribution
pt_br: module distribution (distribuição de módulo)

source: a collection of Python modules distributed together as a single downloadable resource and meant to be installed *en masse*. Examples of some well-known module distributions are NumPy, SciPy, Pillow, or mxBase. (This would be called a *package*, except that term is already taken in the Python context: a single module distribution may contain zero, one, or many Python packages.)
pt_br: uma coleção de módulos Python distribuídos juntos como um único recurso para download e devem ser instalados *em massa*. Exemplos de algumas distribuições de módulos bem conhecidas são NumPy, SciPy, Pillow ou mxBase. (Isso seria chamado de *pacote*, exceto que o termo já é usado no contexto Python: uma distribuição de módulo único pode conter zero, um ou muitos pacotes Python.)

source: pure module distribution
pt_br: pure module distribution (distribuição de módulo puro)

source: a module distribution that contains only pure Python modules and packages. Sometimes referred to as a "pure distribution."
pt_br: uma distribuição de módulo que contém apenas módulos e pacotes Python puros. Às vezes chamada de "distribuição pura".

source: non-pure module distribution
pt_br: non-pure module distribution (distribuição de módulo não pura)

source: a module distribution that contains at least one extension module. Sometimes referred to as a "non-pure distribution."
pt_br: uma distribuição de módulo que contém pelo menos um módulo de extensão. Às vezes chamada de "distribuição não pura".

source: distribution root
pt_br: distribution root (raiz da distribuição)

source: the top-level directory of your source tree (or source distribution); the directory where :file:`setup.py` exists. Generally :file:`setup.py` will be run from this directory.
pt_br: o diretório de nível superior de sua árvore de fontes (ou distribuição fonte); o diretório onde existe :file:`setup.py`. Geralmente, :file:`setup.py` será executado a partir deste diretório.
