Repository: python/python-docs-pt-br
Catalog: using/android.po
Languages: pt_br

source: Using Python on Android
pt_br: Utilizando Python no Android

source: Python on Android is unlike Python on desktop platforms. On a desktop platform, Python is generally installed as a system resource that can be used by any user of that computer. Users then interact with Python by running a :program:`python` executable and entering commands at an interactive prompt, or by running a Python script.
pt_br: Python no Android é diferente do Python em plataformas de desktop. Em uma plataforma desktop, o Python geralmente é instalado como um recurso do sistema que pode ser usado por qualquer usuário daquele computador. Os usuários então interagem com o Python executando um executável :program:`python` e inserindo comandos em um prompt interativo ou executando um script Python.

source: On Android, there is no concept of installing as a system resource. The only unit of software distribution is an "app". There is also no console where you could run a :program:`python` executable, or interact with a Python REPL.
pt_br: No Android, não existe o conceito de instalação como recurso do sistema. A única unidade de distribuição de software é uma aplicação, ou "app". Também não há console onde você possa executar um executável :program:`python` ou interagir com um REPL do Python.

source: As a result, the only way you can use Python on Android is in embedded mode – that is, by writing a native Android application, embedding a Python interpreter using ``libpython``, and invoking Python code using the :ref:`Python embedding API <embedding>`. The full Python interpreter, the standard library, and all your Python code is then packaged into your app for its own private use.
pt_br: Como resultado, a única maneira de usar Python no Andoid é no modo incorporado – ou seja, escrevendo uma aplicação Android nativo, incorporando um interpretador Python usando ``libpython`` e invocando o código Python usando :ref:`API de incorporação do Python <embedding>`. O interpretador Python completo, a biblioteca padrão e todo o seu código Python são então empacotados para sua aplicação para seu próprio uso privado.

source: The Python standard library has some notable omissions and restrictions on Android. See the :ref:`API availability guide <mobile-availability>` for details.
pt_br: A biblioteca padrão do Python tem algumas omissões e restrições notáveis no Andoid. Consulte o :ref:`guia de disponibilidade de API para Android <mobile-availability>` para obter detalhes.

source: Adding Python to an Android app
pt_br: Adicionando Python a uma aplicação Android

source: Most app developers should use one of the following tools, which will provide a much easier experience:
pt_br: A maioria dos desenvolvedores de aplicações deve usar uma das seguintes ferramentas, o que proporcionará uma experiência muito mais fácil:

source: `Briefcase <https://briefcase.readthedocs.io>`__, from the BeeWare project
pt_br: `Briefcase <https://briefcase.readthedocs.io>`__, do projeto BeeWare

source: `Buildozer <https://buildozer.readthedocs.io>`__, from the Kivy project
pt_br: `Buildozer <https://buildozer.readthedocs.io>`__, do projeto Kivy

source: If you're sure you want to do all of this manually, read on. You can use the :source:`testbed app <Android/testbed>` as a guide; each step below contains a link to the relevant file.
pt_br: Se você tem certeza de que quer fazer tudo isso manualmente, continue lendo. Você pode usar a :source:`aplicação testbed <Android/testbed>` como um guia; cada passo abaixo contém um link para o arquivo relevante.

source: Add code to your :source:`build.gradle <Android/testbed/app/build.gradle.kts>` file to copy the following items into your project. All except your own Python code can be copied from ``prefix/lib``:
pt_br: Adicione código ao seu arquivo :source:`build.gradle <Android/testbed/app/build.gradle.kts>` para copiar os seguintes itens para o seu projeto. Todos, exceto seu próprio código Python, podem ser copiados de ``prefix/lib``:

source: In your JNI libraries:
pt_br: Em suas bibliotecas JNI:

source: ``lib*_python.so`` (external libraries such as OpenSSL)
pt_br: ``lib*_python.so`` (bibliotecas externas, tal como OpenSSL)

source: In your assets:
pt_br: Em seus ativos (*assets*):

source: ``python*.*`` (the Python standard library)
pt_br: ``python*.*`` (a biblioteca padrão do Python)

source: ``python*.*/site-packages`` (your own Python code)
pt_br: ``python*.*/site-packages`` (seu próprio código Python)

source: Add code to your app to :source:`extract the assets to the filesystem <Android/testbed/app/src/main/java/org/python/testbed/MainActivity.kt>`.
pt_br: Adicione código ao seu aplicativo para :source:`extrair os ativos para o sistema de arquivos <Android/testbed/app/src/main/java/org/python/testbed/MainActivity.kt>`.

source: Add code to your app to :source:`start Python in embedded mode <Android/testbed/app/src/main/c/main_activity.c>`. This will need to be C code called via JNI.
pt_br: Adicione código a sua aplicação para :source:`iniciar o Python em modo incorporado <Android/testbed/app/src/main/c/main_activity.c>`. Isso precisará ser código C chamado via JNI.

source: Building a Python package for Android
pt_br: Construindo um pacote Python para Android

source: Python packages can be built for Android as wheels and released on PyPI. The recommended tool for doing this is `cibuildwheel <https://cibuildwheel.pypa.io/en/stable/platforms/#android>`__, which automates all the details of setting up a cross-compilation environment, building the wheel, and testing it on an emulator.
pt_br: Pacotes Python podem ser criados para Android como wheels e lançados no PyPI. A ferramenta recomendada para isso é `cibuildwheel <https://cibuildwheel.pypa.io/en/stable/platforms/#android>`__, que automatiza todos os detalhes da configuração de um ambiente de compilação cruzada, da construção da wheel e dos testes em um emulador.
