Repository: python/python-docs-pt-br
Catalog: using/configure.po
Languages: pt_br

source: Enable ThreadSanitizer data race detector, ``tsan`` (default is no).
pt_br: Habilita o detector de corrida de dados ThreadSanitizer, ``tsan`` (o padrão é não).

source: Enable building a shared Python library: ``libpython`` (default is no).
pt_br: Habilita a construção de uma biblioteca Python compartilhada: ``libpython`` (o padrão é não).

source: Do not build ``libpythonMAJOR.MINOR.a`` and do not install ``python.o`` (built and enabled by default).
pt_br: Não constrói ``libpythonMAJOR.MINOR.a`` e não instala ``python.o`` (construído e habilitado por padrão).

source: Libraries options
pt_br: Opções da biblioteca

source: Link against additional libraries (default is no).
pt_br: Vincula bibliotecas adicionais (o padrão é não).

source: Build the :mod:`!pyexpat` module using an installed ``expat`` library (default is no).
pt_br: Constrói o módulo :mod:`!pyexpat` usando uma biblioteca ``expat`` instalada (o padrão é não).

source: Build the ``_decimal`` extension module using an installed ``mpdecimal`` library, see the :mod:`decimal` module (default is yes).
pt_br: Constrói o módulo de extensão ``_decimal`` usando uma biblioteca ``mpdecimal`` instalada, veja o módulo :mod:`decimal` (o padrão é sim).

source: Default to using the installed ``mpdecimal`` library.
pt_br: O padrão é usar a biblioteca ``mpdecimal`` instalada.

source: A bundled copy of the library will no longer be selected implicitly if an installed ``mpdecimal`` library is not found. In Python 3.15 only, it can still be selected explicitly using ``--with-system-libmpdec=no`` or ``--without-system-libmpdec``.
pt_br: Uma cópia da biblioteca incluída no pacote não será mais selecionada implicitamente se uma biblioteca ``mpdecimal`` instalada não for encontrada. Somente no Python 3.15, ela ainda pode ser selecionada explicitamente usando ``--with-system-libmpdec=no`` ou ``--without-system-libmpdec``.

source: A copy of the ``mpdecimal`` library sources will no longer be distributed with Python 3.16.
pt_br: Uma cópia dos fontes da biblioteca ``mpdecimal`` não será mais distribuída com Python 3.16.

source: :option:`LIBMPDEC_CFLAGS` and :option:`LIBMPDEC_LIBS`.
pt_br: :option:`LIBMPDEC_CFLAGS` e :option:`LIBMPDEC_LIBS`.

source: Designate a backend library for the :mod:`readline` module.
pt_br: Designa uma biblioteca backend para o módulo :mod:`readline`.

source: readline: Use readline as the backend.
pt_br: readline: Usa readline como o backend.

source: editline: Use editline as the backend.
pt_br: editline: Usa editline como o backend.

source: Don't build the :mod:`readline` module (built by default).
pt_br: Não constrói o módulo :mod:`readline` (construído por padrão).

source: Don't define the ``HAVE_LIBREADLINE`` macro.
pt_br: Não define a macro ``HAVE_LIBREADLINE``.

source: Override ``libm`` math library to *STRING* (default is system-dependent).
pt_br: Substitui a biblioteca matemática ``libm`` por *STRING* (o padrão depende do sistema).

source: Override ``libc`` C library to *STRING* (default is system-dependent).
pt_br: Substitui a biblioteca C ``libc`` por *STRING* (o padrão depende do sistema).

source: Root of the OpenSSL directory.
pt_br: Raiz do diretório OpenSSL.

source: Set runtime library directory (rpath) for OpenSSL libraries:
pt_br: Define o diretório da biblioteca de tempo de execução (rpath) para bibliotecas OpenSSL:

source: ``no`` (default): don't set rpath;
pt_br: ``no`` (padrão): não define o rpath;

source: ``auto``: auto-detect rpath from :option:`--with-openssl` and ``pkg-config``;
pt_br: ``auto``: detecta automaticamente o rpath de :option:`--with-openssl` e ``pkg-config``;

source: *DIR*: set an explicit rpath.
pt_br: *DIR*: define um rpath explícito.

source: Security Options
pt_br: Opções de segurança

source: Select hash algorithm for use in ``Python/pyhash.c``:
pt_br: Seleciona o algoritmo de hash para usar em ``Python/pyhash.c``:

source: ``siphash13`` (default);
pt_br: ``siphash13`` (padrão);

source: ``siphash13`` is added and it is the new default.
pt_br: ``siphash13`` é adicionado e é o novo padrão.

source: Built-in hash modules:
pt_br: Módulos embutidos de hash

source: ``sha3`` (with shake);
pt_br: ``sha3`` (com shake);

source: Override the OpenSSL default cipher suites string:
pt_br: Substitui a string dos conjuntos de criptografia padrão do OpenSSL:

source: ``python`` (default): use Python's preferred selection;
pt_br: ``python`` (padrão): use a seleciona preferida do Python;

source: ``openssl``: leave OpenSSL's defaults untouched;
pt_br: ``openssl``: mantém inalterados os padrões do OpenSSL;

source: *STRING*: use a custom string
pt_br: *STRING*: usa uma string personalizada

source: See the :mod:`ssl` module.
pt_br: Veja o módulo :mod:`ssl`.

source: The settings ``python`` and *STRING* also set TLS 1.2 as minimum protocol version.
pt_br: As configurações ``python`` e *STRING* também definem TLS 1.2 como versão mínima do protocolo.

source: Disable compiler options that are `recommended by OpenSSF`_ for security reasons with no performance overhead. If this option is not enabled, CPython will be built based on safety compiler options with no slow down. When this option is enabled, CPython will not be built with the compiler options listed below.
pt_br: Desabilita as opções do compilador `recomendadas pela OpenSSF`_ por motivos de segurança, sem causar sobrecarga de desempenho. Se esta opção não estiver habilitada, o CPython será construído com base nas opções de segurança do compilador, sem causar lentidão. Quando esta opção estiver habilitada, o CPython não será construído com as opções do compilador listadas abaixo.

source: The following compiler options are disabled with :option:`!--disable-safety`:
pt_br: As seguintes opções do compilador são desabilitadas com :option:`!--disable-safety`:

source: `-fstack-protector-strong`_: Enable run-time checks for stack-based buffer overflows.
pt_br: `-fstack-protector-strong`_: Habilita verificações em tempo de execução para estouros de buffer baseados em pilha.

source: `-Wtrampolines`_: Enable warnings about trampolines that require executable stacks.
pt_br: `-Wtrampolines`_: Habilita avisos sobre trampolins que exigem pilhas executáveis.

source: Enable compiler options that are `recommended by OpenSSF`_ for security reasons which require overhead. If this option is not enabled, CPython will not be built based on safety compiler options which performance impact. When this option is enabled, CPython will be built with the compiler options listed below.
pt_br: Habilita as opções do compilador `recomendadas pela OpenSSF`_ por motivos de segurança, o que causa sobrecarga. Se esta opção não estiver habilitada, o CPython não será construído com base nas opções de segurança do compilador, o que impacta o desempenho. Quando esta opção estiver habilitada, o CPython será construído com as opções do compilador listadas abaixo.

source: The following compiler options are enabled with :option:`!--enable-slower-safety`:
pt_br: As seguintes opções do compilador são habilitadas com :option:`!--enable-slower-safety`:

source: `-D_FORTIFY_SOURCE=3`_: Fortify sources with compile- and run-time checks for unsafe libc usage and buffer overflows.
pt_br: `-D_FORTIFY_SOURCE=3`_: Fortalece as fontes com verificações de tempo de compilação e execução para uso inseguro de libc e estouros de buffer.

source: macOS Options
pt_br: Opções do macOS

source: See :source:`Mac/README.rst`.
pt_br: Veja :source:`Mac/README.rst`.

source: Create a universal binary build. *SDKDIR* specifies which macOS SDK should be used to perform the build (default is no).
pt_br: Cria uma construção binária universal. *SDKDIR* especifica qual SDK do macOS deve ser usado para executar a construção (o padrão é não).

source: Create a Python.framework rather than a traditional Unix install. Optional *INSTALLDIR* specifies the installation path (default is no).
pt_br: Cria um Python.framework em vez de uma instalação tradicional do Unix. O *INSTALLDIR* opcional especifica o caminho de instalação (o padrão é não).

source: Specify the kind of universal binary that should be created. This option is only valid when :option:`--enable-universalsdk` is set.
pt_br: Especifica o tipo de binário universal que deve ser criado. Esta opção só é válida quando :option:`--enable-universalsdk` está definido.

source: Options:
pt_br: Opções:

source: ``universal2`` (x86-64 and arm64);
pt_br: ``universal2`` (x86-64 e arm64);

source: ``32-bit`` (PPC and i386);
pt_br: ``32-bit`` (PPC e i386);

source: ``64-bit`` (PPC64 and x86-64);
pt_br: ``64-bit`` (PPC64 e x86-64);

source: ``3-way`` (i386, PPC and x86-64);
pt_br: ``3-way`` (i386, PPC e x86-64);

source: ``intel`` (i386 and x86-64);
pt_br: ``intel`` (i386 e x86-64);

source: ``all`` (PPC, i386, PPC64 and x86-64).
pt_br: ``all`` (PPC, i386, PPC64 e x86-64).

source: Note that values for this configuration item are *not* the same as the identifiers used for universal binary wheels on macOS. See the Python Packaging User Guide for details on the `packaging platform compatibility tags used on macOS <https://packaging.python.org/en/latest/specifications/platform-compatibility-tags/#macos>`_
pt_br: Observe que os valores para este item de configuração *não* são os mesmos que os identificadores usados para rodas binárias universais no macOS. Veja o Guia de Empacotamento do Python para detalhes sobre as `tags de compatibilidade de plataforma de empacotamento usadas no macOS <https://packaging.python.org/pt-br/latest/specifications/platform-compatibility-tags/#macos>`_

source: Specify the name for the python framework on macOS only valid when :option:`--enable-framework` is set (default: ``Python``).
pt_br: Especifica o nome do framework python no macOS válido apenas quando :option:`--enable-framework` está definido (padrão: ``Python``).

source: The Python standard library contains strings that are known to trigger automated inspection tool errors when submitted for distribution by the macOS and iOS App Stores. If enabled, this option will apply the list of patches that are known to correct app store compliance. A custom patch file can also be specified. This option is disabled by default.
pt_br: A biblioteca padrão do Python contém strings que são conhecidas por acionar erros de ferramentas de inspeção automatizadas quando enviadas para distribuição pelas App Stores do macOS e do iOS. Se ativada, esta opção aplicará a lista de patches que corrigem a conformidade da app store. Um arquivo de patch personalizado também pode ser especificado. Esta opção está desativada por padrão.

source: iOS Options
pt_br: Opções do iOS

source: See :source:`iOS/README.rst`.
pt_br: Veja :source:`iOS/README.rst`.

source: Create a Python.framework. Unlike macOS, the *INSTALLDIR* argument specifying the installation path is mandatory.
pt_br: Cria um Python.framework. Ao contrário do macOS, o argumento *INSTALLDIR* que especifica o caminho de instalação é obrigatório.

source: Specify the name for the framework (default: ``Python``).
pt_br: Especifica o nome do framework (padrão: ``Python``).

source: Cross Compiling Options
pt_br: Opções de compilação cruzada

source: Cross compiling, also known as cross building, can be used to build Python for another CPU architecture or platform. Cross compiling requires a Python interpreter for the build platform. The version of the build Python must match the version of the cross compiled host Python.
pt_br: A compilação cruzada, também conhecida como construção cruzada, pode ser usada para construir Python para outra arquitetura ou plataforma de CPU. A compilação cruzada requer um interpretador Python para a plataforma de construção. A versão do Python para construção deve corresponder à versão do Python da compilação cruzada do host.

source: configure for building on BUILD, usually guessed by :program:`config.guess`.
pt_br: configura para construir em BUILD, geralmente adivinhado por :program:`config.guess`.

source: cross-compile to build programs to run on HOST (target platform)
pt_br: faz compilação cruzada para construir programas para executar no HOST (plataforma de destino)

source: path to build ``python`` binary for cross compiling
pt_br: caminho para construir o binário ``python`` para compilação cruzada

source: An environment variable that points to a file with configure overrides.
pt_br: Uma variável de ambiente que aponta para um arquivo com substituições de configuração.

source: Example *config.site* file:
pt_br: Exemplo de arquivo *config.site*:

source: Program to run CPython for the host platform for cross-compilation.
pt_br: Programa para executar CPython para a plataforma host para compilação cruzada.

source: Cross compiling example::
pt_br: Exemplo de compilação cruzada::

source: Python Build System
pt_br: Sistema de Construção Python

source: Main files of the build system
pt_br: Arquivos principais do sistema de construção

source: :file:`Makefile.pre.in` => :file:`Makefile` (created by :file:`configure`);
pt_br: :file:`Makefile.pre.in` => :file:`Makefile` (criado por :file:`configure`);

source: :file:`pyconfig.h` (created by :file:`configure`);
pt_br: :file:`pyconfig.h` (criado por :file:`configure`);

source: :file:`Modules/Setup`: C extensions built by the Makefile using :file:`Module/makesetup` shell script;
pt_br: :file:`Modules/Setup`: Extensões C construídas pelo Makefile usando o shell script :file:`Module/makesetup`;

source: Main build steps
pt_br: Principais etapas de construção

source: C files (``.c``) are built as object files (``.o``).
pt_br: Arquivos C (``.c``) são construídos como arquivos objeto (``.o``).

source: A static ``libpython`` library (``.a``) is created from objects files.
pt_br: Uma biblioteca estática ``libpython`` (``.a``) é criada a partir de arquivos de objetos.

source: ``python.o`` and the static ``libpython`` library are linked into the final ``python`` program.
pt_br: ``python.o`` e a biblioteca estática ``libpython`` estão vinculadas ao programa final ``python``.

source: C extensions are built by the Makefile (see :file:`Modules/Setup`).
pt_br: Extensões C são construídas pelo Makefile (veja :file:`Modules/Setup`).

source: Main Makefile targets
pt_br: Alvos principais do Makefile

source: For the most part, when rebuilding after editing some code or refreshing your checkout from upstream, all you need to do is execute ``make``, which (per Make's semantics) builds the default target, the first one defined in the Makefile. By tradition (including in the CPython project) this is usually the ``all`` target. The ``configure`` script expands an ``autoconf`` variable, ``@DEF_MAKE_ALL_RULE@`` to describe precisely which targets ``make all`` will build. The three choices are:
pt_br: Na maioria das vezes, ao reconstruir após editar algum código ou atualizar seu checkout do upstream, tudo que você precisa fazer é executar ``make``, que (pela semântica do Make) constrói o alvo padrão, o primeiro definido no Makefile. Por tradição (inclusive no projeto CPython) este é geralmente o alvo ``all``. O script ``configure`` expande uma variável ``autoconf``, ``@DEF_MAKE_ALL_RULE@`` para descrever precisamente quais alvos ``make all`` serão construídos. As três opções são:

source: ``profile-opt`` (configured with ``--enable-optimizations``)
pt_br: ``profile-opt`` (configurado com ``--enable-optimizations``)

source: ``build_wasm`` (chosen if the host platform matches ``wasm32-wasi*`` or ``wasm32-emscripten``)
pt_br: ``build_wasm`` (escolhido se a plataforma host corresponder a ``wasm32-wasi*`` ou ``wasm32-emscripten``)

source: ``build_all`` (configured without explicitly using either of the others)
pt_br: ``build_all`` (configurado sem usar explicitamente nenhum dos outros)

source: Depending on the most recent source file changes, Make will rebuild any targets (object files and executables) deemed out-of-date, including running ``configure`` again if necessary. Source/target dependencies are many and maintained manually however, so Make sometimes doesn't have all the information necessary to correctly detect all targets which need to be rebuilt. Depending on which targets aren't rebuilt, you might experience a number of problems. If you have build or test problems which you can't otherwise explain, ``make clean && make`` should work around most dependency problems, at the expense of longer build times.
pt_br: Dependendo das alterações mais recentes no arquivo fonte, o Make irá reconstruir quaisquer alvos (arquivos objetos e executáveis) considerados desatualizados, incluindo executar ``configure`` novamente se necessário. As dependências de origem/alvo são muitas e mantidas manualmente, portanto, às vezes, o Make não tem todas as informações necessárias para detectar corretamente todos os alvos que precisam ser reconstruídos. Dependendo de quais destinos não são reconstruídos, você poderá enfrentar vários problemas. Se você tiver problemas de construção ou teste que você não pode explicar de outra forma, ``make clean && make`` deve resolver a maioria dos problemas de dependência, às custas de tempos de construção mais longos.

source: Build the ``python`` program, but don't build the standard library extension modules. This generates a file named ``platform`` which contains a single line describing the details of the build platform, e.g., ``macosx-14.3-arm64-3.12`` or ``linux-x86_64-3.13``.
pt_br: Constrói o programa ``python``, mas não constrói os módulos de extensão da biblioteca padrão. Isto gera um arquivo chamado ``platform`` que contém uma única linha descrevendo os detalhes da plataforma de construção, por exemplo, ``macosx-14.3-arm64-3.12`` ou ``linux-x86_64-3.13``.

source: Build Python using profile-guided optimization (PGO). You can use the configure :option:`--enable-optimizations` option to make this the default target of the ``make`` command (``make all`` or just ``make``).
pt_br: Constrói Python usando otimização guiada por perfil (PGO). Você pode usar a opção :option:`--enable-optimizations` do configure para tornar este o alvo padrão do comando ``make`` (``make all`` ou apenas ``make``).

source: Remove built files.
pt_br: Remove arquivos construídos.

source: In addition to the work done by ``make clean``, remove files created by the configure script. ``configure`` will have to be run before building again. [#]_
pt_br: Além do trabalho feito por ``make clean``, remove os arquivos criados pelo script configure. ``configure`` terá que ser executado antes de construir novamente. [#]_

source: Build the ``all`` target and install Python.
pt_br: Constrói o alvo ``all`` e instala o Python.

source: Build the ``all`` target and run the Python test suite with the ``--fast-ci`` option without GUI tests. Variables:
pt_br: Constrói o alvo ``all`` e execute o conjunto de testes Python com a opção ``--fast-ci`` sem testes de GUI. Variáveis:

source: ``TESTOPTS``: additional regrtest command-line options.
pt_br: ``TESTOPTS``: opções adicionais de linha de comando regrtest.

source: ``TESTPYTHONOPTS``: additional Python command-line options.
pt_br: ``TESTPYTHONOPTS``: opções adicionais de linha de comando do Python.

source: ``TESTTIMEOUT``: timeout in seconds (default: 10 minutes).
pt_br: ``TESTTIMEOUT``: tempo limite em segundos (padrão: 10 minutos).

source: This is similar to ``make test``, but uses the ``-ugui`` to also run GUI tests.
pt_br: Isso é semelhante ao ``make test``, mas usa ``-ugui`` para também executar testes de GUI.

source: This is similar to ``make test``, but uses the ``--slow-ci`` option and default timeout of 20 minutes, instead of ``--fast-ci`` option.
pt_br: Isto é semelhante ao ``make test``, mas usa a opção ``--slow-ci`` e o tempo limite padrão de 20 minutos, em vez da opção ``--fast-ci``.

source: Regenerate (almost) all generated files. These include (but are not limited to) bytecode cases, and parser generator file. ``make regen-stdlib-module-names`` and ``autoconf`` must be run separately for the remaining `generated files <#generated-files>`_.
pt_br: Gera novamente (quase) todos os arquivos gerados. Isso inclui (mas não está limitado a) casos de bytecode e arquivo gerador de analisador sintático. ``make regen-stdlib-module-names`` e ``autoconf`` devem ser executados separadamente para os restantes `arquivos gerados <#generated-files>`_.

source: C extensions
pt_br: Extensões C

source: Some C extensions are built as built-in modules, like the ``sys`` module. They are built with the ``Py_BUILD_CORE_BUILTIN`` macro defined. Built-in modules have no ``__file__`` attribute:
pt_br: Algumas extensões C são construídas como módulos embutidos, como o módulo ``sys``. Eles são construídos com a macro ``Py_BUILD_CORE_BUILTIN`` definida. Módulos embutidos não possuem nenhum atributo ``__file__``:

source: Other C extensions are built as dynamic libraries, like the ``_asyncio`` module. They are built with the ``Py_BUILD_CORE_MODULE`` macro defined. Example on Linux x86-64:
pt_br: Outras extensões C são construídas como bibliotecas dinâmicas, como o módulo ``_asyncio``. Eles são construídos com a macro ``Py_BUILD_CORE_MODULE`` definida. Exemplo no Linux x86-64:

source: :file:`Modules/Setup` is used to generate Makefile targets to build C extensions. At the beginning of the files, C extensions are built as built-in modules. Extensions defined after the ``*shared*`` marker are built as dynamic libraries.
pt_br: :file:`Modules/Setup` é usado para gerar alvos Makefile para construir extensões C. No início dos arquivos, as extensões C são construídas como módulos embutidos. Extensões definidas após o marcador ``*shared*`` são construídas como bibliotecas dinâmicas.

source: The :c:macro:`!PyAPI_FUNC()`, :c:macro:`!PyAPI_DATA()` and :c:macro:`PyMODINIT_FUNC` macros of :file:`Include/exports.h` are defined differently depending if the ``Py_BUILD_CORE_MODULE`` macro is defined:
pt_br: As macros :c:macro:`!PyAPI_FUNC()`, :c:macro:`!PyAPI_DATA()` e :c:macro:`PyMODINIT_FUNC` de :file:`Include/exports.h` são definidas de forma diferente dependendo se a macro ``Py_BUILD_CORE_MODULE`` está definida:

source: Use ``Py_EXPORTED_SYMBOL`` if the ``Py_BUILD_CORE_MODULE`` is defined
pt_br: Usa ``Py_EXPORTED_SYMBOL`` se ``Py_BUILD_CORE_MODULE`` estiver definido

source: Use ``Py_IMPORTED_SYMBOL`` otherwise.
pt_br: Do contrário, usa ``Py_IMPORTED_SYMBOL``.

source: If the ``Py_BUILD_CORE_BUILTIN`` macro is used by mistake on a C extension built as a shared library, its :samp:`PyInit_{xxx}()` function is not exported, causing an :exc:`ImportError` on import.
pt_br: Se a macro ``Py_BUILD_CORE_BUILTIN`` for usada por engano em uma extensão C construída como uma biblioteca compartilhada, sua função :samp:`PyInit_{xxx}()` não será exportada, causando um :exc:`ImportError` na importação.

source: Compiler and linker flags
pt_br: Sinalizadores do compilador e do vinculador

source: Options set by the ``./configure`` script and environment variables and used by ``Makefile``.
pt_br: Opções definidas pelo script ``./configure`` e variáveis de ambiente e usadas por ``Makefile``.

source: Preprocessor flags
pt_br: Sinalizadores do pré-processador

source: Value of :envvar:`CPPFLAGS` variable passed to the ``./configure`` script.
pt_br: Valor da variável :envvar:`CPPFLAGS` passado para o script ``./configure``.

source: (Objective) C/C++ preprocessor flags, e.g. :samp:`-I{include_dir}` if you have headers in a nonstandard directory *include_dir*.
pt_br: Sinalizadores de pré-processador C++ / (Objective) C, p.ex. :samp:`-I{include_dir}` se você tiver cabeçalhos em um diretório não padrão *include_dir*.
