Repository: python/python-docs-pt-br
Catalog: using/configure.po
Languages: pt_br

source: C compiler and linker flags to link Python to ``libbz2``, used by :mod:`bz2` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para vincular Python a ``libbz2``, usados pelo módulo :mod:`bz2`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libncurses`` or ``libncursesw``, used by :mod:`curses` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libncurses`` ou ``libncursesw``, usados pelo módulo :mod:`curses`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``gdbm``.
pt_br: Sinalizadores de compilador C e vinculador para ``gdbm``.

source: C compiler and linker flags for ``libedit``, used by :mod:`readline` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libedit``, usados pelo módulo :mod:`readline`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libffi``, used by :mod:`ctypes` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libffi``, usados pelo módulo :mod:`ctypes`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libmpdec``, used by :mod:`decimal` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libmpdec``, usados pelo módulo :mod:`decimal`, substituindo ``pkg-config``.

source: These environment variables have no effect unless :option:`--with-system-libmpdec` is specified.
pt_br: Estas variáveis de ambiente não têm efeito a menos que :option:`--with-system-libmpdec` seja especificado.

source: C compiler and linker flags for ``liblzma``, used by :mod:`lzma` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``liblzma``, usados pelo módulo :mod:`lzma`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libreadline``, used by :mod:`readline` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libreadline``, usados pelo módulo :mod:`readline`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libsqlite3``, used by :mod:`sqlite3` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libsqlite3``, usados pelo módulo :mod:`sqlite3`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libuuid``, used by :mod:`uuid` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libuuid``, usados pelo módulo :mod:`uuid`, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libzstd``, used by :mod:`compression.zstd` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e ligador para ``libzstd``, usados pelo módulo :mod:`compression.zstd`, substituindo ``pkg-config``.

source: C compiler and linker flags for PANEL, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para PANEL, substituindo ``pkg-config``.

source: C compiler and linker flags for ``libpanel`` or ``libpanelw``, used by :mod:`curses.panel` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libpanel`` ou ``libpanelw``, usados pelo módulo :mod:`curses.panel`, substituindo ``pkg-config``.

source: C compiler and linker flags for TCLTK, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para TCLTK, substituindo ``pkg-config``.;

source: C compiler and linker flags for ``libzlib``, used by :mod:`gzip` module, overriding ``pkg-config``.
pt_br: Sinalizadores de compilador C e vinculador para ``libzlib``, usados pelo módulo :mod:`gzip`, substituindo ``pkg-config``.

source: WebAssembly Options
pt_br: Opções de WebAssembly

source: Turn on dynamic linking support for WASM.
pt_br: Ativa o suporte de vinculação dinâmica para WASM.

source: Dynamic linking enables ``dlopen``. File size of the executable increases due to limited dead code elimination and additional features.
pt_br: A vinculação dinâmica permite ``dlopen``. O tamanho do arquivo executável aumenta devido à eliminação limitada de código morto e recursos adicionais.

source: Turn on pthreads support for WASM.
pt_br: Ativa o suporte a pthreads para WASM.

source: Install Options
pt_br: Opções de instalação

source: Install architecture-independent files in PREFIX. On Unix, it defaults to :file:`/usr/local`.
pt_br: Instala arquivos independentes de arquitetura em PREFIX. No Unix, o padrão é :file:`/usr/local`.

source: This value can be retrieved at runtime using :data:`sys.prefix`.
pt_br: Este valor pode ser recuperado em tempo de execução usando :data:`sys.prefix`.

source: As an example, one can use ``--prefix="$HOME/.local/"`` to install a Python in its home directory.
pt_br: Como exemplo, pode-se usar ``--prefix="$HOME/.local/"`` para instalar um Python em seu diretório pessoal (home).

source: Install architecture-dependent files in EPREFIX, defaults to :option:`--prefix`.
pt_br: Instala arquivos dependentes de arquitetura no EPREFIX, o padrão é :option:`--prefix`.

source: This value can be retrieved at runtime using :data:`sys.exec_prefix`.
pt_br: Este valor pode ser recuperado em tempo de execução usando :data:`sys.exec_prefix`.

source: Don't build nor install test modules, like the :mod:`test` package or the :mod:`!_testcapi` extension module (built and installed by default).
pt_br: Não constrói nem instala módulos de teste, como o pacote :mod:`test` ou o módulo de extensão :mod:`!_testcapi` (construído e instalado por padrão).

source: Select the :mod:`ensurepip` command run on Python installation:
pt_br: Seleciona o comando :mod:`ensurepip` executado na instalação do Python:

source: ``upgrade`` (default): run ``python -m ensurepip --altinstall --upgrade`` command.
pt_br: ``upgrade`` (padrão): executa o comando ``python -m ensurepip --altinstall --upgrade``.

source: ``install``: run ``python -m ensurepip --altinstall`` command;
pt_br: ``install``: executa o comando ``python -m ensurepip --altinstall``;

source: ``no``: don't run ensurepip;
pt_br: ``no``: não executa ensurepip;

source: Performance options
pt_br: Opções de desempenho

source: Configuring Python using ``--enable-optimizations --with-lto`` (PGO + LTO) is recommended for best performance. The experimental ``--enable-bolt`` flag can also be used to improve performance.
pt_br: Configurar o Python usando ``--enable-optimizations --with-lto`` (PGO + LTO) é o recomendado para melhor desempenho. O sinalizador experimental ``--enable-bolt`` também pode ser usado para melhorar o desempenho.

source: Enable Profile Guided Optimization (PGO) using :envvar:`PROFILE_TASK` (disabled by default).
pt_br: Habilita a otimização guiada por perfil (PGO, do inglês Profile Guided Optimization) usando :envvar:`PROFILE_TASK` (desabilitado por padrão).

source: The C compiler Clang requires ``llvm-profdata`` program for PGO. On macOS, GCC also requires it: GCC is just an alias to Clang on macOS.
pt_br: O compilador C Clang requer o programa ``llvm-profdata`` para PGO. No macOS, o GCC também exige: o GCC é apenas um apelido para o Clang no macOS.

source: Disable also semantic interposition in libpython if ``--enable-shared`` and GCC is used: add ``-fno-semantic-interposition`` to the compiler and linker flags.
pt_br: Desabilita também a interposição semântica no libpython se ``--enable-shared`` e GCC forem usados: adiciona ``-fno-semantic-interposition`` aos sinalizadores do compilador e do vinculador.

source: During the build, you may encounter compiler warnings about profile data not being available for some source files. These warnings are harmless, as only a subset of the code is exercised during profile data acquisition. To disable these warnings on Clang, manually suppress them by adding ``-Wno-profile-instr-unprofiled`` to :envvar:`CFLAGS`.
pt_br: Durante a construção, você poderá encontrar avisos do compilador sobre a indisponibilidade de dados de perfil para alguns arquivos fonte. Esses avisos são inofensivos, pois apenas um subconjunto do código é exercido durante a aquisição de dados de perfil. Para desativar esses avisos no Clang, suprima-os manualmente adicionando ``-Wno-profile-instr-unprofiled`` a :envvar:`CFLAGS`.

source: Use ``-fno-semantic-interposition`` on GCC.
pt_br: Usa ``-fno-semantic-interposition`` no GCC.

source: Environment variable used in the Makefile: Python command line arguments for the PGO generation task.
pt_br: Variável de ambiente usada no Makefile: argumentos de linha de comando do Python para a tarefa de geração de PGO.

source: Default: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.
pt_br: Padrão: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.

source: Task failure is no longer ignored silently.
pt_br: A falha da tarefa não é mais ignorada silenciosamente.

source: Enable Link Time Optimization (LTO) in any build (disabled by default).
pt_br: Habilita o otimização em tempo de vinculação (LTO, do inglês Link Time Optimization) em qualquer construção (desabilitado por padrão).

source: The C compiler Clang requires ``llvm-ar`` for LTO (``ar`` on macOS), as well as an LTO-aware linker (``ld.gold`` or ``lld``).
pt_br: O compilador C Clang requer ``llvm-ar`` para LTO (``ar`` no macOS), bem como um vinculador compatível com LTO (``ld.gold`` ou ``lld``).

source: To use ThinLTO feature, use ``--with-lto=thin`` on Clang.
pt_br: Para usar o recurso ThinLTO, use ``--with-lto=thin`` no Clang.

source: Use ThinLTO as the default optimization policy on Clang if the compiler accepts the flag.
pt_br: Usa ThinLTO como política de otimização padrão no Clang se o compilador aceitar o sinalizador.

source: Enable usage of the `BOLT post-link binary optimizer <https://github.com/llvm/llvm-project/tree/main/bolt>`_ (disabled by default).
pt_br: Habilita o uso do `otimizador binário pós-vinculação BOLT <https://github.com/llvm/llvm-project/tree/main/bolt>`_ (desabilitado por padrão).

source: BOLT is part of the LLVM project but is not always included in their binary distributions. This flag requires that ``llvm-bolt`` and ``merge-fdata`` are available.
pt_br: BOLT faz parte do projeto LLVM, mas nem sempre está incluído em suas distribuições binárias. Este sinalizador requer que ``llvm-bolt`` e ``merge-fdata`` estejam disponíveis.

source: BOLT is still a fairly new project so this flag should be considered experimental for now. Because this tool operates on machine code its success is dependent on a combination of the build environment + the other optimization configure args + the CPU architecture, and not all combinations are supported. BOLT versions before LLVM 16 are known to crash BOLT under some scenarios. Use of LLVM 16 or newer for BOLT optimization is strongly encouraged.
pt_br: BOLT ainda é um projeto relativamente novo, então este sinalizador deve ser considerado experimental por enquanto. Como esta ferramenta opera em código de máquina, seu sucesso depende de uma combinação do ambiente de construção + os outros argumentos de configuração de otimização + a arquitetura da CPU, e nem todas as combinações são suportadas. Versões do BOLT anteriores ao LLVM 16 são conhecidas por travar o BOLT em alguns cenários. O uso do LLVM 16 ou mais recente para otimização do BOLT é fortemente incentivado.

source: The :envvar:`!BOLT_INSTRUMENT_FLAGS` and :envvar:`!BOLT_APPLY_FLAGS` :program:`configure` variables can be defined to override the default set of arguments for :program:`llvm-bolt` to instrument and apply BOLT data to binaries, respectively.
pt_br: As variáveis :envvar:`!BOLT_INSTRUMENT_FLAGS` e :envvar:`!BOLT_APPLY_FLAGS` do :program:`configure` podem ser definidas para substituir o conjunto padrão de argumentos para :program:`llvm-bolt` para instrumentar e aplicar dados BOLT aos binários , respectivamente.

source: Arguments to ``llvm-bolt`` when creating a `BOLT optimized binary <https://github.com/facebookarchive/BOLT>`_.
pt_br: Argumentos para ``llvm-bolt`` ao criar um `binário otimizado com BOLT <https://github.com/facebookarchive/BOLT>`_.

source: Arguments to ``llvm-bolt`` when instrumenting binaries.
pt_br: Argumentos para ``llvm-bolt`` ao instrumentar binários.

source: Enable computed gotos in evaluation loop (enabled by default on supported compilers).
pt_br: Habilita "gotos" computados no laço de avaliação (habilitado por padrão em compiladores suportados).

source: Enable interpreters using tail calls in CPython. If enabled, enabling PGO (:option:`--enable-optimizations`) is highly recommended. This option specifically requires a C compiler with proper tail call support, and the `preserve_none <https://clang.llvm.org/docs/AttributeReference.html#preserve-none>`_ calling convention. For example, Clang 19 and newer supports this feature.
pt_br: Habilita interpretadores usando chamadas de cauda no CPython. Se habilitado, é altamente recomendável habilitar PGO (:option:`--enable-optimizations`). Esta opção requer especificamente um compilador C com suporte adequado a chamadas de cauda e a convenção de chamada `preserve_none <https://clang.llvm.org/docs/AttributeReference.html#preserve-none>`_. Por exemplo, o Clang 19 e versões mais recentes oferecem suporte a esse recurso.

source: Disable the fast :ref:`mimalloc <mimalloc>` allocator (enabled by default).
pt_br: Desativa o alocador rápido :ref:`mimalloc <mimalloc>` (habilitado por padrão).

source: See also :envvar:`PYTHONMALLOC` environment variable.
pt_br: Veja também a variável de ambiente :envvar:`PYTHONMALLOC`.

source: Disable the specialized Python memory allocator :ref:`pymalloc <pymalloc>` (enabled by default).
pt_br: Desabilita o alocador de memória especializado do Python :ref:`pymalloc <pymalloc>` (habilitado por padrão).

source: Disable static documentation strings to reduce the memory footprint (enabled by default). Documentation strings defined in Python are not affected.
pt_br: Desabilita as strings de documentação estática para reduzir o consumo de memória (habilitado por padrão). As strings de documentação definidas em Python não são afetadas.

source: Don't define the ``WITH_DOC_STRINGS`` macro.
pt_br: Não define a macro ``WITH_DOC_STRINGS``.

source: See the ``PyDoc_STRVAR()`` macro.
pt_br: Veja a macro ``PyDoc_STRVAR()``.

source: Enable C-level code profiling with ``gprof`` (disabled by default).
pt_br: Habilita o perfil de código a nível C com ``gprof`` (desabilitado por padrão).

source: Add ``-fstrict-overflow`` to the C compiler flags (by default we add ``-fno-strict-overflow`` instead).
pt_br: Adiciona ``-fstrict-overflow`` aos sinalizadores do compilador C (por padrão adicionamos ``-fno-strict-overflow``).

source: Deactivate remote debugging support described in :pep:`768` (enabled by default). When this flag is provided the code that allows the interpreter to schedule the execution of a Python file in a separate process as described in :pep:`768` is not compiled. This includes both the functionality to schedule code to be executed and the functionality to receive code to be executed.
pt_br: Desativa o suporte à depuração remota descrito na :pep:`768` (habilitado por padrão). Quando este sinalizador é fornecido, o código que permite ao interpretador agendar a execução de um arquivo Python em um processo separado, conforme descrito na :pep:`768`, não é compilado. Isso inclui tanto a funcionalidade de agendar a execução do código quanto a funcionalidade de receber a execução do código.

source: This macro is defined by default, unless Python is configured with :option:`--without-remote-debug`.
pt_br: Esta macro é definida por padrão, a menos que o Python esteja configurado com :option:`--without-remote-debug`.

source: Note that even if the macro is defined, remote debugging may not be available (for example, on an incompatible platform).
pt_br: Observe que, mesmo que a macro esteja definida, a depuração remota pode não estar disponível (por exemplo, em uma plataforma incompatível).

source: Python Debug Build
pt_br: Compilação de depuração do Python

source: A debug build is Python built with the :option:`--with-pydebug` configure option.
pt_br: Uma compilação de depuração é Python compilada com a opção de configuração :option:`--with-pydebug`.

source: Effects of a debug build:
pt_br: Efeitos de uma compilação de depuração:

source: Display all warnings by default: the list of default warning filters is empty in the :mod:`warnings` module.
pt_br: Exibe todos os avisos por padrão: a lista de filtros de aviso padrão está vazia no módulo :mod:`warnings`.

source: Add ``d`` to :data:`sys.abiflags`.
pt_br: Adiciona ``d`` a :data:`sys.abiflags`.

source: Add :func:`!sys.gettotalrefcount` function.
pt_br: Adiciona a função :func:`!sys.gettotalrefcount`.

source: Add :option:`-X showrefcount <-X>` command line option.
pt_br: Adiciona a opção de linha de comando :option:`-X showrefcount <-X>`.

source: Add :option:`-d` command line option and :envvar:`PYTHONDEBUG` environment variable to debug the parser.
pt_br: Adiciona a opção de linha de comando :option:`-d` e a variável de ambiente :envvar:`PYTHONDEBUG` para depurar o analisador sintático.

source: Add support for the ``__lltrace__`` variable: enable low-level tracing in the bytecode evaluation loop if the variable is defined.
pt_br: Adiciona suporte para a variável ``__lltrace__``: habilita o rastreamento de baixo nível no laço de avaliação de bytecode se a variável estiver definida.

source: Install :ref:`debug hooks on memory allocators <default-memory-allocators>` to detect buffer overflow and other memory errors.
pt_br: Instala :ref:`ganchos de depuração nos alocadores de memória <default-memory-allocators>` para detectar estouro de buffer e outros erros de memória.

source: Define ``Py_DEBUG`` and ``Py_REF_DEBUG`` macros.
pt_br: Define as macros ``Py_DEBUG`` e ``Py_REF_DEBUG``.

source: Add runtime checks: code surrounded by ``#ifdef Py_DEBUG`` and ``#endif``. Enable ``assert(...)`` and ``_PyObject_ASSERT(...)`` assertions: don't set the ``NDEBUG`` macro (see also the :option:`--with-assertions` configure option). Main runtime checks:
pt_br: Adiciona verificações de tempo de execução: código cercado por ``#ifdef Py_DEBUG`` e ``#endif``. Habilita as asserções ``assert(...)`` e ``_PyObject_ASSERT(...)``: não define a macro ``NDEBUG`` (veja também a configuração :option:`--with-assertions` opção). Principais verificações de tempo de execução:

source: Add sanity checks on the function arguments.
pt_br: Adiciona verificações de sanidade nos argumentos da função.

source: Unicode and int objects are created with their memory filled with a pattern to detect usage of uninitialized objects.
pt_br: Objetos Unicode e int são criados com sua memória preenchida com um padrão para detectar o uso de objetos não inicializados.

source: Ensure that functions which can clear or replace the current exception are not called with an exception raised.
pt_br: Garante que as funções que podem limpar ou substituir a exceção atual não sejam chamadas com uma exceção levantada.

source: Check that deallocator functions don't change the current exception.
pt_br: Verifica se as funções desalocadoras não alteram a exceção atual.

source: The garbage collector (:func:`gc.collect` function) runs some basic checks on objects consistency.
pt_br: O coletor de lixo (função :func:`gc.collect`) executa algumas verificações básicas na consistência dos objetos.

source: The :c:macro:`!Py_SAFE_DOWNCAST()` macro checks for integer underflow and overflow when downcasting from wide types to narrow types.
pt_br: A macro :c:macro:`!Py_SAFE_DOWNCAST()` verifica o underflow e o overflow de inteiros ao fazer o downcast de tipos largos para tipos estreitos.

source: See also the :ref:`Python Development Mode <devmode>` and the :option:`--with-trace-refs` configure option.
pt_br: Veja também o :ref:`Modo de Desenvolvimento do Python <devmode>` e a opção de configuração :option:`--with-trace-refs`.

source: Release builds and debug builds are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro (see the :option:`--with-trace-refs` option).
pt_br: Construções de lançamento e construções de depuração agora são compatíveis com ABI: definir a macro ``Py_DEBUG`` não implica mais na macro ``Py_TRACE_REFS`` (consulte a opção :option:`--with-trace-refs`).

source: Debug options
pt_br: Opções de depuração

source: :ref:`Build Python in debug mode <debug-build>`: define the ``Py_DEBUG`` macro (disabled by default).
pt_br: :ref:`Construção de depuração do Python <debug-build>`: define a macro ``Py_DEBUG`` (desabilitada por padrão).

source: Enable tracing references for debugging purpose (disabled by default).
pt_br: Habilita referências de rastreamento para fins de depuração (desabilitado por padrão).

source: Define the ``Py_TRACE_REFS`` macro.
pt_br: Define a macro ``Py_TRACE_REFS``.

source: Add :func:`sys.getobjects` function.
pt_br: Adiciona a função :func:`sys.getobjects`.

source: Add :envvar:`PYTHONDUMPREFS` environment variable.
pt_br: Adiciona a variável de ambiente :envvar:`PYTHONDUMPREFS`.

source: The :envvar:`PYTHONDUMPREFS` environment variable can be used to dump objects and reference counts still alive at Python exit.
pt_br: A variável de ambiente :envvar:`PYTHONDUMPREFS` pode ser usada para despejar objetos e contagens de referências ainda ativas na saída do Python.

source: :ref:`Statically allocated objects <static-types>` are not traced.
pt_br: :ref:`Objetos alocados estaticamente <static-types>` não são rastreados.

source: This build is now ABI compatible with release build and :ref:`debug build <debug-build>`.
pt_br: Esta construção agora é compatibilidade de ABI com a construção de lançamento e :ref:`construção de depuração <debug-build>`.

source: Build with C assertions enabled (default is no): ``assert(...);`` and ``_PyObject_ASSERT(...);``.
pt_br: Constrói com asserções C habilitadas (o padrão é não): ``assert(...);`` e ``_PyObject_ASSERT(...);``.

source: If set, the ``NDEBUG`` macro is not defined in the :envvar:`OPT` compiler variable.
pt_br: Se definido, a macro ``NDEBUG`` não é definida na variável do compilador :envvar:`OPT`.

source: See also the :option:`--with-pydebug` option (:ref:`debug build <debug-build>`) which also enables assertions.
pt_br: Veja também a opção :option:`--with-pydebug` (:ref:`construção de depuração <debug-build>`) que também habilita asserções.

source: Enable Valgrind support (default is no).
pt_br: Habilita suporte ao Valgrind (o padrão é não).

source: Enable DTrace support (default is no).
pt_br: Habilita suporte ao DTrace (o padrão é não).

source: See :ref:`Instrumenting CPython with DTrace and SystemTap <instrumentation>`.
pt_br: Veja :ref:`Instrumentando o CPython com DTrace e SystemTap <instrumentation>`.

source: Enable AddressSanitizer memory error detector, ``asan`` (default is no). To improve ASan detection capabilities you may also want to combine this with :option:`--without-pymalloc` to disable the specialized small-object allocator whose allocations are not tracked by ASan.
pt_br: Habilita o detector de erros de memória AddressSanitizer, ``asan`` (o padrão é não). Para melhorar os recursos de detecção do ASan, você também pode combinar isso com :option:`--without-pymalloc` para desabilitar o alocador especializado de pequenos objetos cujas alocações não são rastreadas pelo ASan.

source: Enable MemorySanitizer allocation error detector, ``msan`` (default is no).
pt_br: Habilita o detector de erros de alocação do MemorySanitizer, ``msan`` (o padrão é não).

source: Enable UndefinedBehaviorSanitizer undefined behaviour detector, ``ubsan`` (default is no).
pt_br: Habilita o detector de comportamento indefinido UndefinedBehaviorSanitizer, ``ubsan`` (o padrão é não).
