Repository: python/python-docs-pt-br
Catalog: using/configure.po
Languages: pt_br

source: Both :envvar:`CPPFLAGS` and :envvar:`LDFLAGS` need to contain the shell's value to be able to build extension modules using the directories specified in the environment variables.
pt_br: Tanto :envvar:`CPPFLAGS` quanto :envvar:`LDFLAGS` precisam conter o valor do shell para poder construir módulos de extensão usando os diretórios especificados nas variáveis de ambiente.

source: Extra preprocessor flags added for building the interpreter object files.
pt_br: Sinalizadores extras de pré-processador adicionados para construir os arquivos de objeto do interpretador.

source: Default: ``$(BASECPPFLAGS) -I. -I$(srcdir)/Include $(CONFIGURE_CPPFLAGS) $(CPPFLAGS)``.
pt_br: Padrão: ``$(BASECPPFLAGS) -I. -I$(srcdir)/Include $(CONFIGURE_CPPFLAGS) $(CPPFLAGS)``.

source: Compiler flags
pt_br: Sinalizadores do compilador

source: Example: ``gcc -pthread``.
pt_br: Exemplo: ``gcc -pthread``.

source: C++ compiler command.
pt_br: Comando do compilador C++.

source: Example: ``g++ -pthread``.
pt_br: Exemplo: ``g++ -pthread``.

source: :envvar:`CFLAGS_NODIST` is used for building the interpreter and stdlib C extensions. Use it when a compiler flag should *not* be part of :envvar:`CFLAGS` once Python is installed (:gh:`65320`).
pt_br: :envvar:`CFLAGS_NODIST` é usado para construir o interpretador e extensões C da stdlib. Use-o quando um sinalizador do compilador *não* deve fazer parte de :envvar:`CFLAGS` depois que o Python estiver instalado (:gh:`65320`).

source: In particular, :envvar:`CFLAGS` should not contain:
pt_br: Em particular, :envvar:`CFLAGS` não deve conter:

source: the compiler flag ``-I`` (for setting the search path for include files). The ``-I`` flags are processed from left to right, and any flags in :envvar:`CFLAGS` would take precedence over user- and package-supplied ``-I`` flags.
pt_br: o sinalizador do compilador ``-I`` (para definir o caminho de pesquisa para arquivos incluídos). Os sinalizadores ``-I`` são processadas da esquerda para a direita, e quaisquer sinalizadores em :envvar:`CFLAGS` terão precedência sobre os sinalizadores ``-I`` fornecidos pelo usuário e pelo pacote.

source: hardening flags such as ``-Werror`` because distributions cannot control whether packages installed by users conform to such heightened standards.
pt_br: sinalizadores de segurança como ``-Werror`` porque as distribuições não podem controlar se os pacotes instalados pelos usuários estão em conformidade com esses padrões elevados.

source: Options passed to the :mod:`compileall` command line when building PYC files in ``make install``. Default: ``-j0``.
pt_br: Opções passadas para a linha de comando :mod:`compileall` ao construir arquivos PYC em ``make install``. Padrão: ``-j0``.

source: Extra C compiler flags.
pt_br: Sinalizadores extra do compilador C.

source: Value of :envvar:`CFLAGS` variable passed to the ``./configure`` script.
pt_br: Valor da variável :envvar:`CFLAGS` passado para o script ``./configure``.

source: Value of :envvar:`CFLAGS_NODIST` variable passed to the ``./configure`` script.
pt_br: Valor da variável :envvar:`CFLAGS_NODIST` passado para o script ``./configure``.

source: Base compiler flags.
pt_br: Sinalizadores base do compilador.

source: Optimization flags.
pt_br: Sinalizadores de otimização.

source: Strict or non-strict aliasing flags used to compile ``Python/dtoa.c``.
pt_br: Sinalizadores de alias estritos ou não estritos usados para compilar ``Python/dtoa.c``.

source: Compiler flags used to build a shared library.
pt_br: Sinalizadores de compilador usados para construir uma biblioteca compartilhada.

source: For example, ``-fPIC`` is used on Linux and on BSD.
pt_br: Por exemplo, ``-fPIC`` é usado no Linux e no BSD.

source: Extra C flags added for building the interpreter object files.
pt_br: Sinalizadores extras de C adicionados para construir os arquivos de objeto do interpretador.

source: Default: ``$(CCSHARED)`` when :option:`--enable-shared` is used, or an empty string otherwise.
pt_br: Padrão: ``$(CCSHARED)`` quando :option:`--enable-shared` é usado, ou uma string vazia caso contrário.

source: Default: ``$(BASECFLAGS) $(OPT) $(CONFIGURE_CFLAGS) $(CFLAGS) $(EXTRA_CFLAGS)``.
pt_br: Padrão: ``$(BASECFLAGS) $(OPT) $(CONFIGURE_CFLAGS) $(CFLAGS) $(EXTRA_CFLAGS)``.

source: Default: ``$(CONFIGURE_CFLAGS_NODIST) $(CFLAGS_NODIST) -I$(srcdir)/Include/internal``.
pt_br: Padrão: ``$(CONFIGURE_CFLAGS_NODIST) $(CFLAGS_NODIST) -I$(srcdir)/Include/internal``.

source: C flags used for building the interpreter object files.
pt_br: Sinalizadores do C usados para construir os arquivos de objeto do interpretador.

source: Default: ``$(PY_CFLAGS) $(PY_CFLAGS_NODIST) $(PY_CPPFLAGS) $(CFLAGSFORSHARED)``.
pt_br: Padrão: ``$(PY_CFLAGS) $(PY_CFLAGS_NODIST) $(PY_CPPFLAGS) $(CFLAGSFORSHARED)``.

source: Default: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE``.
pt_br: Padrão: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE``.

source: Compiler flags to build a standard library extension module as a built-in module, like the :mod:`posix` module.
pt_br: Sinalizadores do compilador para construir um módulo de extensão de biblioteca padrão como um módulo embutido, como o módulo :mod:`posix`.

source: Default: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE_BUILTIN``.
pt_br: Padrão: ``$(PY_STDMODULE_CFLAGS) -DPy_BUILD_CORE_BUILTIN``.

source: Purify command. Purify is a memory debugger program.
pt_br: Comando de Purify. Purify é um programa depurador de memória.

source: Default: empty string (not used).
pt_br: Padrão: string vazia (não usada).

source: Linker flags
pt_br: Sinalizadores do vinculador

source: Linker command used to build programs like ``python`` and ``_testembed``.
pt_br: Comando do vinculador usado para construir programas como ``python`` e ``_testembed``.

source: Default: ``$(PURIFY) $(CC)``.
pt_br: Padrão: ``$(PURIFY) $(CC)``.

source: Value of :envvar:`LDFLAGS` variable passed to the ``./configure`` script.
pt_br: Valor da variável :envvar:`LDFLAGS` passado para o script ``./configure``.

source: Avoid assigning :envvar:`CFLAGS`, :envvar:`LDFLAGS`, etc. so users can use them on the command line to append to these values without stomping the pre-set values.
pt_br: Evite atribuir :envvar:`CFLAGS`, :envvar:`LDFLAGS`, etc. para que os usuários possam usá-los na linha de comando para anexar a esses valores sem pisotear os valores predefinidos.

source: :envvar:`LDFLAGS_NODIST` is used in the same manner as :envvar:`CFLAGS_NODIST`. Use it when a linker flag should *not* be part of :envvar:`LDFLAGS` once Python is installed (:gh:`65320`).
pt_br: :envvar:`LDFLAGS_NODIST` é usado da mesma maneira que :envvar:`CFLAGS_NODIST`. Use-o quando um sinalizador de vinculador *não* fizer parte de :envvar:`LDFLAGS` depois que o Python estiver instalado (:gh:`65320`).

source: In particular, :envvar:`LDFLAGS` should not contain:
pt_br: Em particular, :envvar:`LDFLAGS` não deve conter:

source: the compiler flag ``-L`` (for setting the search path for libraries). The ``-L`` flags are processed from left to right, and any flags in :envvar:`LDFLAGS` would take precedence over user- and package-supplied ``-L`` flags.
pt_br: o sinalizador do compilador ``-L`` (para definir o caminho de pesquisa para arquivos incluídos). Os sinalizadores ``-L`` são processadas da esquerda para a direita, e quaisquer sinalizadores em :envvar:`LDFLAGS` terão precedência sobre os sinalizadores ``-L`` fornecidos pelo usuário e pelo pacote.

source: Value of :envvar:`LDFLAGS_NODIST` variable passed to the ``./configure`` script.
pt_br: Valor da variável :envvar:`LDFLAGS_NODIST` passado para o script ``./configure``.

source: Linker flags, e.g. :samp:`-L{lib_dir}` if you have libraries in a nonstandard directory *lib_dir*.
pt_br: Sinalizadores do vinculador, p.ex. :samp:`-L{lib_dir}`, se você tiver bibliotecas em um diretório não padrão *lib_dir*.

source: Linker flags to pass libraries to the linker when linking the Python executable.
pt_br: Sinalizadores do vinculador para passar bibliotecas para o vinculador ao vincular o executável Python.

source: Example: ``-lrt``.
pt_br: Exemplo: ``-lrt``.

source: Command to build a shared library.
pt_br: Comando para construir uma biblioteca compartilhada.

source: Default: ``@LDSHARED@ $(PY_LDFLAGS)``.
pt_br: Padrão: ``@LDSHARED@ $(PY_LDFLAGS)``.

source: Command to build ``libpython`` shared library.
pt_br: Comando para construir a biblioteca compartilhada ``libpython``.

source: Default: ``@BLDSHARED@ $(PY_CORE_LDFLAGS)``.
pt_br: Padrão: ``@BLDSHARED@ $(PY_CORE_LDFLAGS)``.

source: Default: ``$(CONFIGURE_LDFLAGS) $(LDFLAGS)``.
pt_br: Padrão: ``$(CONFIGURE_LDFLAGS) $(LDFLAGS)``.

source: Default: ``$(CONFIGURE_LDFLAGS_NODIST) $(LDFLAGS_NODIST)``.
pt_br: Padrão: ``$(CONFIGURE_LDFLAGS_NODIST) $(LDFLAGS_NODIST)``.

source: Linker flags used for building the interpreter object files.
pt_br: Sinalizadores de vinculador usados para construir os arquivos de objeto do interpretador.

source: Footnotes
pt_br: Notas de rodapé

source: ``git clean -fdx`` is an even more extreme way to "clean" your checkout. It removes all files not known to Git. When bug hunting using ``git bisect``, this is `recommended between probes <https://github.com/python/cpython/issues/114505#issuecomment-1907021718>`_ to guarantee a completely clean build. **Use with care**, as it will delete all files not checked into Git, including your new, uncommitted work.
pt_br: ``git clean -fdx`` é uma maneira ainda mais extrema de "limpar" seu checkout. Ele remove todos os arquivos não conhecidos pelo Git. Ao procurar bugs usando ``git bisect``, isso é `recomendado entre testes <https://github.com/python/cpython/issues/114505#issuecomment-1907021718>`_ para garantir uma construção completamente limpa. **Use com cuidado**, pois isso excluirá todos os arquivos não registrados no Git, incluindo seu trabalho novo e não confirmado.
