Repository: python/python-docs-pt-br
Catalog: using/configure.po
Languages: pt_br

source: Configure Python
pt_br: Configurando o Python

source: Build Requirements
pt_br: Requisitos de construção

source: To build CPython, you will need:
pt_br: Para construir o CPython, você precisará de:

source: A `C11 <https://en.cppreference.com/w/c/11>`_ compiler. `Optional C11 features <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ are not required.
pt_br: Um compilador `C11 <https://en.cppreference.com/w/c/11>`_. Não são necessários `recursos opcionais do C11 <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_.

source: On Windows, Microsoft Visual Studio 2017 or later is required.
pt_br: No Windows, é necessário o Microsoft Visual Studio 2017 ou posterior.

source: Support for `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ floating-point numbers and `floating-point Not-a-Number (NaN) <https://en.wikipedia.org/wiki/NaN#Floating_point>`_.
pt_br: Suporte para números de ponto flutuante do `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ e `Not-a-Number (NaN) de ponto flutuante <https://en.wikipedia.org/wiki/NaN#Floating_point>`_.

source: Support for threads.
pt_br: Suporte a threads.

source: On Windows, Visual Studio 2015 or later is now required.
pt_br: No Windows, o Visual Studio 2015 ou posterior agora é obrigatório.

source: Selected C99 features, like ``<stdint.h>`` and ``static inline`` functions, are now required.
pt_br: Alguns recurso do C99, como as funções ``<stdint.h>`` e ``static inline``, agora são obrigatórios.

source: Thread support is now required.
pt_br: Suporte a threads agora é obrigatório.

source: C11 compiler, IEEE 754 and NaN support are now required. On Windows, Visual Studio 2017 or later is required.
pt_br: Compilador C11, suporte a IEEE 754 e NaN agora são necessários. No Windows, é necessário o Visual Studio 2017 ou posterior.

source: See also :pep:`7` "Style Guide for C Code" and :pep:`11` "CPython platform support".
pt_br: Veja também :pep:`7` "Guia de estilo para código C" e :pep:`11` "Suporte do CPython a plataformas".

source: Requirements for optional modules
pt_br: Requisitos para módulos opcionais

source: Some :term:`optional modules <optional module>` of the standard library require third-party libraries installed for development (for example, header files must be available).
pt_br: Alguns :term:`módulos opcionais <optional module>` da biblioteca padrão exigem que bibliotecas de terceiros estejam instaladas para o desenvolvimento (por exemplo, os arquivos de cabeçalho devem estar disponíveis).

source: Missing requirements are reported in the ``configure`` output. Modules that are missing due to missing dependencies are listed near the end of the ``make`` output, sometimes using an internal name, for example, ``_ctypes`` for :mod:`ctypes` module.
pt_br: Requisitos ausentes são relatados na saída do comando ``configure``. Módulos que estão faltando devido a dependências ausentes são listados perto do final da saída do comando ``make``, às vezes usando um nome interno, por exemplo, ``_ctypes`` para o módulo :mod:`ctypes`.

source: If you distribute a CPython interpreter without optional modules, it's best practice to advise users, who generally expect that standard library modules are available.
pt_br: Se você distribuir um interpretador do CPython sem módulos opcionais, é uma boa prática avisar os usuários, que geralmente esperam que os módulos da biblioteca padrão estejam disponíveis.

source: Dependencies to build optional modules are:
pt_br: As dependências para construir módulos opcionais são:

source: Dependency
pt_br: Dependência

source: Minimum version
pt_br: Versão mínima

source: Python module
pt_br: Módulo Python

source: 3.3.0 recommended
pt_br: 3.3.0 recomendada

source: `libreadline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ or `libedit <https://www.thrysoee.dk/editline/>`_ [2]_
pt_br: `libreadline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ ou `libedit <https://www.thrysoee.dk/editline/>`_ [2]_

source: 3.0.18 recommended
pt_br: 3.0.18 recomendada

source: (1.1.1 minimum)
pt_br: (1.1.1 mínima)

source: If *libmpdec* is not available, the :mod:`decimal` module will use a pure-Python implementation. See :option:`--with-system-libmpdec` for details.
pt_br: Se a biblioteca *libmpdec* não estiver disponível, o módulo :mod:`decimal` usará uma implementação em Python puro. Consulte :option:`--with-system-libmpdec` para obter detalhes.

source: See :option:`--with-readline` for choosing the backend for the :mod:`readline` module.
pt_br: Consulte :option:`--with-readline` para escolher o backend do módulo :mod:`readline`.

source: The :mod:`uuid` module uses ``_uuid`` to generate "safe" UUIDs. See the module documentation for details.
pt_br: O módulo :mod:`uuid` usa ``_uuid`` para gerar UUIDs "seguros". Consulte a documentação do módulo para obter detalhes.

source: The :mod:`curses` module requires the ``libncurses`` or ``libncursesw`` library. The :mod:`curses.panel` module additionally requires the ``libpanel`` or ``libpanelw`` library.
pt_br: O módulo :mod:`curses` requer a biblioteca ``libncurses`` ou ``libncursesw``. O módulo :mod:`curses.panel` requer adicionalmente a biblioteca ``libpanel`` ou ``libpanelw``.

source: If OpenSSL is not available, the :mod:`hashlib` module will use bundled implementations of several hash functions. See :option:`--with-builtin-hashlib-hashes` for *forcing* usage of OpenSSL.
pt_br: Caso o OpenSSL não esteja disponível, o módulo :mod:`hashlib` utilizará implementações integradas de diversas funções de hash. Consulte a :option:`--with-builtin-hashlib-hashes` para *forçar* o uso do OpenSSL.

source: Note that the table does not include all optional modules; in particular, platform-specific modules like :mod:`winreg` are not listed here.
pt_br: Note que a tabela não inclui todos os módulos opcionais; em particular, módulos específicos da plataforma, como :mod:`winreg`, não estão listados aqui.

source: The `devguide <https://devguide.python.org/getting-started/setup-building/#install-dependencies>`_ includes a full list of dependencies required to build all modules and instructions on how to install them on common platforms.
pt_br: O `devguide <https://devguide.python.org/getting-started/setup-building/#install-dependencies>`_ inclui uma lista completa das dependências necessárias para construir todos os módulos e instruções sobre como instalá-las em plataformas comuns.

source: :option:`--with-system-expat` allows building with an external `libexpat <https://libexpat.github.io/>`_ library.
pt_br: A :option:`--with-system-expat` permite a construir com uma biblioteca externa `libexpat <https://libexpat.github.io/>`_.

source: Tcl/Tk version 8.3.1 is now required for :mod:`tkinter`.
pt_br: Tcl/Tk versão 8.3.1 agora é obrigatório para :mod:`tkinter`.

source: Tcl/Tk version 8.4 is now required for :mod:`tkinter`.
pt_br: Tcl/Tk versão 8.4 agora é obrigatório para :mod:`tkinter`.

source: OpenSSL 1.0.2 is now required for :mod:`hashlib` and :mod:`ssl`.
pt_br: OpenSSL 1.0.2 agora é obrigatório para :mod:`hashlib` e :mod:`ssl`.

source: OpenSSL 1.1.1 is now required for :mod:`hashlib` and :mod:`ssl`. SQLite 3.7.15 is now required for :mod:`sqlite3`.
pt_br: OpenSSL 1.1.1 agora é obrigatório para :mod:`hashlib` e :mod:`ssl`. SQLite 3.7.15 agora é obrigatório para :mod:`sqlite3`.

source: Tcl/Tk version 8.5.12 is now required for :mod:`tkinter`.
pt_br: Tcl/Tk versão 8.5.12 agora é obrigatório para :mod:`tkinter`.

source: SQLite 3.15.2 is now required for :mod:`sqlite3`.
pt_br: SQLite 3.15.2 agora é obrigatório para :mod:`sqlite3`.

source: Generated files
pt_br: Arquivos gerados

source: To reduce build dependencies, Python source code contains multiple generated files. Commands to regenerate all generated files::
pt_br: Para reduzir as dependências de construção, o código-fonte do Python contém vários arquivos gerados. Comandos para regenerar todos os arquivos gerados::

source: The ``Makefile.pre.in`` file documents generated files, their inputs, and tools used to regenerate them. Search for ``regen-*`` make targets.
pt_br: O arquivo ``Makefile.pre.in`` documenta os arquivos gerados, suas entradas e ferramentas usadas para regenerá-los. Procure por alvos ``regen-*`` de make.

source: configure script
pt_br: Script configure

source: The ``make regen-configure`` command regenerates the ``aclocal.m4`` file and the ``configure`` script using the ``Tools/build/regen-configure.sh`` shell script which uses an Ubuntu container to get the same tools versions and have a reproducible output.
pt_br: O comando ``make regen-configure`` regera o arquivo ``aclocal.m4`` e o script ``configure`` usando o shell script ``Tools/build/regen-configure.sh``, o qual usa um contêiner Ubuntu para obter as mesmas versões de ferramentas e ter uma saída reproduzível.

source: The container is optional, the following command can be run locally::
pt_br: O contêiner é opcional, o seguinte comando pode ser executado localmente::

source: The generated files can change depending on the exact versions of the tools used. The container that CPython uses has `Autoconf <https://gnu.org/software/autoconf>`_ 2.72, ``aclocal`` from `Automake <https://www.gnu.org/software/automake>`_ 1.16.5, and `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ 1.8.1.
pt_br: Os arquivos gerados podem variar dependendo das versões exatas das ferramentas utilizadas. O contêiner usado pelo CPython possui o `Autoconf <https://gnu.org/software/autoconf>`_ 2.72, o ``aclocal`` do `Automake <https://www.gnu.org/software/automake>`_ 1.16.5 e o `pkg-config <https://www.freedesktop.org/wiki/Software/pkg-config/>`_ 1.8.1.

source: Autoconf 2.71 and aclocal 1.16.5 and are now used to regenerate :file:`configure`.
pt_br: O Autoconf 2.71 e o aclocal 1.16.5 agora são usados para regenerar o arquivo :file:`configure`.

source: Autoconf 2.72 is now used to regenerate :file:`configure`.
pt_br: O Autoconf 2.72 agora é usado para regenerar o arquivo :file:`configure`.

source: Configure Options
pt_br: Opções de configuração

source: List all :file:`configure` script options using::
pt_br: Liste todas as opções do :file:`configure` usando::

source: See also the :file:`Misc/SpecialBuilds.txt` in the Python source distribution.
pt_br: Veja também o :file:`Misc/SpecialBuilds.txt` na distribuição de código-fonte do Python.

source: General Options
pt_br: Opções gerais

source: Support loadable extensions in the :mod:`!_sqlite` extension module (default is no) of the :mod:`sqlite3` module.
pt_br: Suporte a extensões carregáveis no módulo de extensão :mod:`!_sqlite` (o padrão é não) do módulo :mod:`sqlite3`.

source: See the :meth:`sqlite3.Connection.enable_load_extension` method of the :mod:`sqlite3` module.
pt_br: Veja o método :meth:`sqlite3.Connection.enable_load_extension` do módulo :mod:`sqlite3`.

source: Disable IPv6 support (enabled by default if supported), see the :mod:`socket` module.
pt_br: Desabilita suporte a IPv6 (habilitado por padrão se houver suporte), veja o módulo :mod:`socket`.

source: Define the size in bits of Python :class:`int` digits: 15 or 30 bits.
pt_br: Define o tamanho em bits dos dígitos de :class:`int` do Python: 15 ou 30 bits.

source: By default, the digit size is 30.
pt_br: Por padrão, o tamanho dos dígitos é 30.

source: Define the ``PYLONG_BITS_IN_DIGIT`` to ``15`` or ``30``.
pt_br: Define o ``PYLONG_BITS_IN_DIGIT`` para ``15`` ou ``30``.

source: See :data:`sys.int_info.bits_per_digit <sys.int_info>`.
pt_br: Veja :data:`sys.int_info.bits_per_digit <sys.int_info>`.

source: Set the Python executable suffix to *SUFFIX*.
pt_br: Define o sufixo do executável do Python para *SUFFIX*.

source: The default suffix is ``.exe`` on Windows and macOS (``python.exe`` executable), ``.js`` on Emscripten node, ``.html`` on Emscripten browser, ``.wasm`` on WASI, and an empty string on other platforms (``python`` executable).
pt_br: O sufixo padrão é ``.exe`` no Windows e macOS (executável ``python.exe``), ``.js`` em nó Emscripten, ``.html`` em navegador Emscripten, ``.wasm`` em WASI e uma string vazia em outras plataformas (executável ``python``).

source: The default suffix on WASM platform is one of ``.js``, ``.html`` or ``.wasm``.
pt_br: O sufixo padrão na plataforma WASM é um entre ``.js``, ``.html`` ou ``.wasm``

source: Select the default time zone search path for :const:`zoneinfo.TZPATH`. See the :ref:`Compile-time configuration <zoneinfo_data_compile_time_config>` of the :mod:`zoneinfo` module.
pt_br: Seleciona o caminho de pesquisa de fuso horário padrão para :const:`zoneinfo.TZPATH`. Veja a :ref:`Configuração de tempo de compilação <zoneinfo_data_compile_time_config>` do módulo :mod:`zoneinfo`.

source: Default: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``.
pt_br: Padrão: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``.

source: See :data:`os.pathsep` path separator.
pt_br: Veja o separador de caminhos :data:`os.pathsep`.

source: Build the ``_decimal`` extension module using a thread-local context rather than a coroutine-local context (default), see the :mod:`decimal` module.
pt_br: Constrói o módulo de extensão ``_decimal`` usando um contexto local de thread ao invés de um contexto local de corrotina (padrão), veja o módulo :mod:`decimal`.

source: See :const:`decimal.HAVE_CONTEXTVAR` and the :mod:`contextvars` module.
pt_br: Veja :const:`decimal.HAVE_CONTEXTVAR` e o módulo :mod:`contextvars`.

source: Override order to check db backends for the :mod:`dbm` module
pt_br: Substitui a ordem de verificação de backends de banco de dados para o módulo :mod:`dbm`

source: A valid value is a colon (``:``) separated string with the backend names:
pt_br: Um valor válido é uma string separada por dois pontos (``:``) com os nomes de backend:

source: Disable C locale coercion to a UTF-8 based locale (enabled by default).
pt_br: Desabilita a coerção de localidade C para uma localidade baseada em UTF-8 (ativada por padrão).

source: Don't define the ``PY_COERCE_C_LOCALE`` macro.
pt_br: Não define a macro ``PY_COERCE_C_LOCALE``.

source: See :envvar:`PYTHONCOERCECLOCALE` and the :pep:`538`.
pt_br: Consulte :envvar:`PYTHONCOERCECLOCALE` e a :pep:`538`.

source: Python library directory name (default is ``lib``).
pt_br: Nome do diretório da biblioteca Python (o padrão é ``lib``).

source: Fedora and SuSE use ``lib64`` on 64-bit platforms.
pt_br: Fedora e SuSE usam ``lib64`` em plataformas de 64 bits.

source: See :data:`sys.platlibdir`.
pt_br: Veja :data:`sys.platlibdir`.

source: Directory of wheel packages used by the :mod:`ensurepip` module (none by default).
pt_br: Diretório de pacotes de wheel usados pelo módulo :mod:`ensurepip` (nenhum por padrão).

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the :mod:`!ensurepip._bundled` package.
pt_br: Algumas políticas de empacotamento de distribuição do Linux recomendam contra o empacotamento de dependências. Por exemplo, o Fedora instala pacotes wheel no diretório ``/usr/share/python-wheels/`` e não instala o pacote :mod:`!ensurepip._bundled`.

source: Whether configure should use :program:`pkg-config` to detect build dependencies.
pt_br: Se o configure deve usar :program:`pkg-config` para detectar dependências de construção.

source: ``check`` (default): :program:`pkg-config` is optional
pt_br: ``check`` (padrão): :program:`pkg-config` é opcional

source: ``yes``: :program:`pkg-config` is mandatory
pt_br: ``yes``: :program:`pkg-config` é obrigatório

source: ``no``: configure does not use :program:`pkg-config` even when present
pt_br: ``no``: configure não usa :program:`pkg-config` mesmo quando presente

source: Turn on internal Python performance statistics gathering.
pt_br: Ativa a coleta de estatísticas internas de desempenho do Python.

source: By default, statistics gathering is off. Use ``python3 -X pystats`` command or set ``PYTHONSTATS=1`` environment variable to turn on statistics gathering at Python startup.
pt_br: Por padrão, a coleta de estatísticas está desativada. Use o comando ``python3 -X pystats`` ou defina a variável de ambiente ``PYTHONSTATS=1`` para ativar a coleta de estatísticas na inicialização do Python.

source: At Python exit, dump statistics if statistics gathering was on and not cleared.
pt_br: Na saída do Python, despeja as estatísticas se a coleta de estatísticas estiver ativada e não apagada.

source: Effects:
pt_br: Efeitos:

source: Add :option:`-X pystats <-X>` command line option.
pt_br: Adiciona a opção de linha de comando :option:`-X pystats <-X>`.

source: Add :envvar:`!PYTHONSTATS` environment variable.
pt_br: Adiciona a variável de ambiente :envvar:`!PYTHONSTATS`.

source: Define the ``Py_STATS`` macro.
pt_br: Define a macro ``Py_STATS``.

source: Add functions to the :mod:`sys` module:
pt_br: Adiciona funções ao módulo :mod:`sys`:

source: :func:`!sys._stats_on`: Turns on statistics gathering.
pt_br: :func:`!sys._stats_on`: Ativa a coleta de estatísticas.

source: :func:`!sys._stats_off`: Turns off statistics gathering.
pt_br: :func:`!sys._stats_off`: Desativa a coleta de estatísticas.

source: :func:`!sys._stats_clear`: Clears the statistics.
pt_br: :func:`!sys._stats_clear`: Apaga as estatísticas.

source: :func:`!sys._stats_dump`: Dump statistics to file, and clears the statistics.
pt_br: :func:`!sys._stats_dump`: Despeja as estatísticas no arquivo e apaga as estatísticas.

source: The statistics will be dumped to a arbitrary (probably unique) file in ``/tmp/py_stats/`` (Unix) or ``C:\temp\py_stats\`` (Windows). If that directory does not exist, results will be printed on stderr.
pt_br: As estatísticas serão despejadas em um arquivo arbitrário (provavelmente único) em ``/tmp/py_stats/`` (Unix) ou ``C:\temp\py_stats\`` (Windows). Se aquele diretório não existir, os resultados serão enviados para stderr.

source: Use ``Tools/scripts/summarize_stats.py`` to read the stats.
pt_br: Use ``Tools/scripts/summarize_stats.py`` para ler as estatísticas.

source: Statistics:
pt_br: Estatísticas:

source: Opcode:
pt_br: Código de operação:

source: Specialization: success, failure, hit, deferred, miss, deopt, failures;
pt_br: Especialização: sucesso, fracasso, acerto, adiado, erro, deopt, falhas;

source: Execution count;
pt_br: Contagem de execuções;

source: Pair count.
pt_br: Contagem em pares.

source: Call:
pt_br: Chamada:

source: Inlined Python calls;
pt_br: Chamadas Python em linha;

source: PyEval calls;
pt_br: Chamadas a PyEval;

source: Frames pushed;
pt_br: Quadros enviados;

source: Frame object created;
pt_br: Objetos quadro criados;

source: Eval calls: vector, generator, legacy, function VECTORCALL, build class, slot, function "ex", API, method.
pt_br: Chamadas de Eval: vetor, gerador, legado, função VECTORCALL, classe de construção, slot, função "ex", API, método.

source: Object:
pt_br: Objeto:

source: incref and decref;
pt_br: incref e decref;

source: interpreter incref and decref;
pt_br: incref e decref do interpretador;

source: allocations: all, 512 bytes, 4 kiB, big;
pt_br: alocações: tudo, 512 bytes, 4 kiB, big;

source: free;
pt_br: memória livre;

source: to/from free lists;
pt_br: listas de memória livre para/de;

source: dictionary materialized/dematerialized;
pt_br: Dicionário materializado/desmaterializado;

source: type cache;
pt_br: cache de tipo;

source: optimization attempts;
pt_br: tentativas de otimização;

source: optimization traces created/executed;
pt_br: rastros de otimização criados/executados;

source: uops executed.
pt_br: uops executados.

source: Garbage collector:
pt_br: Coletor de lixo:

source: Garbage collections;
pt_br: Coletas de lixo;

source: Objects visited;
pt_br: Objetos visitados;

source: Objects collected.
pt_br: Objetos coletados.

source: Enables support for running Python without the :term:`global interpreter lock` (GIL): free threading build.
pt_br: Habilita suporte para execução de Python sem a :term:`trava global do interpretador` (GIL): construção com threads livres.

source: Defines the ``Py_GIL_DISABLED`` macro and adds ``"t"`` to :data:`sys.abiflags`.
pt_br: Define a macro ``Py_GIL_DISABLED`` e adiciona ``"t"`` a :data:`sys.abiflags`.

source: See :ref:`whatsnew313-free-threaded-cpython` for more detail.
pt_br: Veja :ref:`whatsnew313-free-threaded-cpython` para mais detalhes.

source: Indicate how to integrate the :ref:`experimental just-in-time compiler <whatsnew314-jit-compiler>`.
pt_br: Indica como integrar o :ref:`compilador just-in-time experimental <whatsnew314-jit-compiler>`.

source: ``no``: Don't build the JIT.
pt_br: ``no``: não constrói o JIT;

source: ``yes``: Enable the JIT. To disable it at runtime, set the environment variable :envvar:`PYTHON_JIT=0 <PYTHON_JIT>`.
pt_br: ``yes``: habilita o JIT. Para desabilitá-lo em tempo de execução, defina a variável de ambiente :envvar:`PYTHON_JIT=0 <PYTHON_JIT>`.

source: ``yes-off``: Build the JIT, but disable it by default. To enable it at runtime, set the environment variable :envvar:`PYTHON_JIT=1 <PYTHON_JIT>`.
pt_br: ``yes-off``: constrói o JIT, mas desabilita-o por padrão. Para habilitá-lo em tempo de execução, defina a variável de ambiente :envvar:`PYTHON_JIT=1 <PYTHON_JIT>`.

source: ``interpreter``: Enable the "JIT interpreter" (only useful for those debugging the JIT itself). To disable it at runtime, set the environment variable :envvar:`PYTHON_JIT=0 <PYTHON_JIT>`.
pt_br: ``interpreter``: Habilita o "interpretador JIT" (útil apenas para quem está depurando o próprio JIT). Para desabilitá-lo em tempo de execução, defina a variável de ambiente :envvar:`PYTHON_JIT=0 <PYTHON_JIT>`.

source: ``--enable-experimental-jit=no`` is the default behavior if the option is not provided, and ``--enable-experimental-jit`` is shorthand for ``--enable-experimental-jit=yes``. See :file:`Tools/jit/README.md` for more information, including how to install the necessary build-time dependencies.
pt_br: ``--enable-experimental-jit=no`` é o comportamento padrão se a opção não for fornecida, e ``--enable-experimental-jit`` é uma abreviação de ``--enable-experimental-jit=yes``. Consulte :file:`Tools/jit/README.md` para mais informações, incluindo como instalar as dependências necessárias em tempo de construção.

source: When building CPython with JIT enabled, ensure that your system has Python 3.11 or later installed.
pt_br: Ao construir o CPython com o JIT habilitado, certifique-se de que seu sistema tenha o Python 3.11 ou posterior instalado.

source: Path to ``pkg-config`` utility.
pt_br: Caminho para o utilitário ``pkg-config``.

source: ``pkg-config`` options.
pt_br: Opções do ``pkg-config``.

source: C compiler options
pt_br: Opções do compilador C

source: C compiler command.
pt_br: Comando do compilador C.

source: C compiler flags.
pt_br: Sinalizadores do compilador C.

source: C preprocessor command.
pt_br: Comando do pré-processador C.

source: C preprocessor flags, e.g. :samp:`-I{include_dir}`.
pt_br: Sinalizadores do pré-processador C, p.ex., :samp:`-I{include_dir}`.

source: Linker options
pt_br: Opções da ligação

source: Linker flags, e.g. :samp:`-L{library_directory}`.
pt_br: Sinalizadores do vinculador. p.ex., :samp:`-L{library_directory}`.

source: Libraries to pass to the linker, e.g. :samp:`-l{library}`.
pt_br: Bibliotecas para passar para o vinculador, p.ex. :samp:`-l{library}`.

source: Name for machine-dependent library files.
pt_br: Nome para arquivos de biblioteca dependentes de máquina.

source: Options for third-party dependencies
pt_br: Opções para dependências de terceiros
