Repository: python/python-docs-pt-br
Catalog: using/mac.po
Languages: pt_br

source: For this release, the **Shell profile updater** package and the :file:`Update Shell Profile.command` in |usemac_applications_folder_version| do not support the free-threaded package.
pt_br: Neste lançamento, o pacote **Shell profile updater** e o comando :file:`Update Shell Profile.command` em |usemac_applications_folder_version| não dão suporte ao pacote de threads livres.

source: The free-threaded build and the traditional build have separate search paths and separate :file:`site-packages` directories so, by default, if you need a package available in both builds, it may need to be installed in both. The free-threaded package will install a separate instance of :program:`pip` for use with |usemac_python_x_dot_y_t_literal|.
pt_br: A compilação com threads livres e a compilação tradicional têm caminhos de pesquisa separados e diretórios :file:`site-packages` separados, portanto, por padrão, se você precisar de um pacote disponível em ambas compilações, talvez seja necessário instalá-lo em ambos. O pacote com threads livres instalará uma instância separada do :program:`pip` para uso com o |usemac_python_x_dot_y_t_literal|.

source: To install a package using :command:`pip` without a :command:`venv`:
pt_br: Para instalar um pacote usando :command:`pip` sem um :command:`venv`:

source: When working with multiple Python environments, it is usually safest and easiest to :ref:`create and use virtual environments <tut-venv>`. This can avoid possible command name conflicts and confusion about which Python is in use:
pt_br: Ao trabalhar com vários ambientes Python, geralmente é mais seguro e mais fácil :ref:`criar e usar ambientes virtuais <tut-venv>`. Isso pode tanto evitar possíveis conflitos de comandos, quanto evitar a confusão sobre qual Python está sendo usado:

source: then :command:`activate`.
pt_br: e, em seguida, :command:`activate`.

source: To run a free-threaded version of IDLE:
pt_br: Para executar uma versão do IDLE com threads livres:

source: The interpreters in both builds respond to the same :ref:`PYTHON environment variables <using-on-envvars>` which may have unexpected results, for example, if you have ``PYTHONPATH`` set in a shell profile. If necessary, there are :ref:`command line options <using-on-interface-options>` like ``-E`` to ignore these environment variables.
pt_br: Os intérpretes em ambos as compilações respondem às mesmas variáveis de ambiente :ref:`PYTHON <using-on-envvars>`, o que pode gerar resultados inesperados, por exemplo, se você tiver ``PYTHONPATH`` definido em um perfil de console. Se necessário, há :ref:`opções de linha de comando <using-on-interface-options>` como ``-E`` para ignorar essas variáveis de ambiente.

source: The free-threaded build links to the third-party shared libraries, such as ``OpenSSL`` and ``Tk``, installed in the traditional framework. This means that both builds also share one set of trust certificates as installed by the :command:`Install Certificates.command` script, thus it only needs to be run once.
pt_br: A compilação com threads livres é ligada às bibliotecas compartilhadas de terceiros, como ``OpenSSL`` e ``Tk``, instaladas no framework tradicional. Isso significa que ambas as compilações também compartilham um conjunto de certificados, como instalados pelo script :command:`Install Certificates.command`, portanto, ele só precisa ser executado uma vez.

source: If you cannot depend on the link in ``/usr/local/bin`` pointing to the ``python.org`` free-threaded |usemac_python_x_dot_y_t_literal| (for example, if you want to install your own version there or some other distribution does), you can explicitly set your shell ``PATH`` environment variable to include the ``PythonT`` framework ``bin`` directory:
pt_br: Se você não puder depender do link em ``/usr/local/bin`` apontando para |usemac_python_x_dot_y_t_literal| com threads livres do ``python.org`` (por exemplo, se quiser instalar sua própria versão lá ou se alguma outra distribuição instalá-lo lá), você poderá definir explicitamente sua variável de ambiente de console ``PATH`` para incluir o diretório da framework ``PythonT`` ``bin``:

source: The traditional framework installation by default does something similar, except for :file:`Python.framework`. Be aware that having both framework ``bin`` directories in ``PATH`` can lead to confusion if there are duplicate names like ``python3.13`` in both; which one is actually used depends on the order they appear in ``PATH``. The ``which python3.x`` or ``which python3.xt`` commands can show which path is being used. Using virtual environments can help avoid such ambiguities. Another option might be to create a shell :command:`alias` to the desired interpreter, like:
pt_br: A instalação tradicional do framework por padrão faz algo semelhante, exceto pelo arquivo :file:`Python.framework`. Observe que ter dois diretórios ``bin`` do framework em ``PATH`` pode gerar confusão se houver nomes duplicados, como ``python3.13``, em ambos; qual deles é realmente usado depende da ordem em que aparecem em ``PATH``. Os comandos ``which python3.x`` ou ``which python3.xt`` pode mostrar qual caminho está sendo usado. Usar ambientes virtuais pode ajudar a evitar essas ambiguidades. Outra opção pode ser criar um :command:`alias` no console para o interpretador desejado, como:

source: Installing using the command line
pt_br: Instalação usando a linha de comando

source: If you want to use automation to install the ``python.org`` installer package (rather than by using the familiar macOS :program:`Installer` GUI app), the macOS command line :command:`installer` utility lets you select non-default options, too. If you are not familiar with :command:`installer`, it can be somewhat cryptic (see :command:`man installer` for more information). As an example, the following shell snippet shows one way to do it, using the ``3.13.0b2`` release and selecting the free-threaded interpreter option:
pt_br: Se você quiser usar automação para instalar o pacote de instalação ``python.org`` (em vez de usar o aplicativo GUI :program:`Installer` do macOS), o utilitário para linha de comando :command:`installer` permite que você selecione opções que não sejam do padrão. Se você não estiver familiarizado com o :command:`installer`, ele pode ser um tanto enigmático (consulte: command:`man installer` para obter mais informações). Como exemplo, o seguinte trecho de console mostra uma maneira de fazer isso, usando a versão ``3.13.0b2`` e selecionando a opção de interpretador com threads livres:

source: RELEASE="python-3.13.0b2-macos11.pkg" # download installer pkg curl -O https://www.python.org/ftp/python/3.13.0/${RELEASE} # create installer choicechanges to customize the install: # enable the PythonTFramework-3.13 package # while accepting the other defaults (install all other packages) cat > ./choicechanges.plist <<EOF <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"> <plist version="1.0"> <array> <dict> <key>attributeSetting</key> <integer>1</integer> <key>choiceAttribute</key> <string>selected</string> <key>choiceIdentifier</key> <string>org.python.Python.PythonTFramework-3.13</string> </dict> </array> </plist> EOF sudo installer -pkg ./${RELEASE} -applyChoiceChangesXML ./choicechanges.plist -target /
pt_br: RELEASE="python-3.13.0b2-macos11.pkg" # baixa o pkg do instalador curl -O https://www.python.org/ftp/python/3.13.0/${RELEASE} # cria o choicechanges do instalador para personalizar a instalação: # habilita o pacote PythonTFramework-3.13 # enquanto aceita outros padrões (instala todos os outros apcotes) cat > ./choicechanges.plist <<EOF <?xml version="1.0" encoding="UTF-8"?> <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"> <plist version="1.0"> <array> <dict> <key>attributeSetting</key> <integer>1</integer> <key>choiceAttribute</key> <string>selected</string> <key>choiceIdentifier</key> <string>org.python.Python.PythonTFramework-3.13</string> </dict> </array> </plist> EOF sudo installer -pkg ./${RELEASE} -applyChoiceChangesXML ./choicechanges.plist -target /

source: You can then test that both installer builds are now available with something like:
pt_br: Você pode então testar que ambas as compilações de instaladores estão disponíveis com algo como:

source: $ # test that the free-threaded interpreter was installed if the Unix Command Tools package was enabled $ /usr/local/bin/python3.13t -VV Python 3.13.0b2 experimental free-threading build (v3.13.0b2:3a83b172af, Jun 5 2024, 12:57:31) [Clang 15.0.0 (clang-1500.3.9.4)] $ # and the traditional interpreter $ /usr/local/bin/python3.13 -VV Python 3.13.0b2 (v3.13.0b2:3a83b172af, Jun 5 2024, 12:50:24) [Clang 15.0.0 (clang-1500.3.9.4)] $ # test that they are also available without the prefix if /usr/local/bin is on $PATH $ python3.13t -VV Python 3.13.0b2 experimental free-threading build (v3.13.0b2:3a83b172af, Jun 5 2024, 12:57:31) [Clang 15.0.0 (clang-1500.3.9.4)] $ python3.13 -VV Python 3.13.0b2 (v3.13.0b2:3a83b172af, Jun 5 2024, 12:50:24) [Clang 15.0.0 (clang-1500.3.9.4)]
pt_br: $ # teste que o interpretador com threads livres foi instalado se o pacote Unix Command Tools foi habilitado $ /usr/local/bin/python3.13t -VV Python 3.13.0b2 experimental free-threading build (v3.13.0b2:3a83b172af, Jun 5 2024, 12:57:31) [Clang 15.0.0 (clang-1500.3.9.4)] $ # e o interpretador tradicional $ /usr/local/bin/python3.13 -VV Python 3.13.0b2 (v3.13.0b2:3a83b172af, Jun 5 2024, 12:50:24) [Clang 15.0.0 (clang-1500.3.9.4)] $ # teste que também eles estão disponíveis sem o prefixo se /usr/local/bin estiver no $PATH $ python3.13t -VV Python 3.13.0b2 experimental free-threading build (v3.13.0b2:3a83b172af, Jun 5 2024, 12:57:31) [Clang 15.0.0 (clang-1500.3.9.4)] $ python3.13 -VV Python 3.13.0b2 (v3.13.0b2:3a83b172af, Jun 5 2024, 12:50:24) [Clang 15.0.0 (clang-1500.3.9.4)]

source: Current ``python.org`` installers only install to fixed locations like :file:`/Library/Frameworks/`, :file:`/Applications`, and :file:`/usr/local/bin`. You cannot use the :command:`installer` ``-domain`` option to install to other locations.
pt_br: Os instaladores atuais do ``python.org`` só instalam em locais fixos, como :file:`/Library/Frameworks/`, :file:`/Applications` e :file:`/usr/local/bin`. Não é possível usar a opção ``-domain`` do :command:`installer` para instalar em outros locais.

source: Distributing Python Applications
pt_br: Distribuindo aplicações Python

source: A range of tools exist for converting your Python code into a standalone distributable application:
pt_br: Existe uma variedade de ferramentas para converter seu código Python em uma aplicação distribuível independente:

source: :pypi:`py2app`: Supports creating macOS ``.app`` bundles from a Python project.
pt_br: :pypi:`py2app`: Oferece suporte à criação de pacotes ``.app`` do macOS a partir de um projeto Python.

source: `Briefcase <https://briefcase.readthedocs.io>`_: Part of the `BeeWare Project <https://beeware.org>`_; a cross-platform packaging tool that supports creation of ``.app`` bundles on macOS, as well as managing signing and notarization.
pt_br: `Briefcase <https://briefcase.readthedocs.io>`_: Parte do `BeeWare Project <https://beeware.org>`_; uma ferramenta de empacotamento multiplataforma que permite criar *bundles* ``.app`` no macOS, além de gerenciar assinaturas digitais e a notarização.

source: `PyInstaller <https://pyinstaller.org/>`_: A cross-platform packaging tool that creates a single file or folder as a distributable artifact.
pt_br: `PyInstaller <https://pyinstaller.org/>`_: Uma ferramenta de empacotamento multiplataforma que cria um único arquivo ou pasta como um artefato distribuível.

source: App Store Compliance
pt_br: Conformidade com a App Store

source: Apps submitted for distribution through the macOS App Store must pass Apple's app review process. This process includes a set of automated validation rules that inspect the submitted application bundle for problematic code.
pt_br: As aplicações enviadas para distribuição pela macOS App Store devem passar pelo processo de revisão de aplicativos da Apple. Esse processo inclui um conjunto de regras de validação automatizadas que inspecionam o pacote de aplicativos enviado em busca de código problemático.

source: The Python standard library contains some code that is known to violate these automated rules. While these violations appear to be false positives, Apple's review rules cannot be challenged. Therefore, it is necessary to modify the Python standard library for an app to pass App Store review.
pt_br: A biblioteca padrão do Python contém alguns códigos que violam essas regras automatizadas. Embora essas violações pareçam ser falsos positivos, as regras de revisão da Apple não podem ser contestadas. Portanto, é necessário modificar a biblioteca padrão do Python para que uma aplicação passe na revisão da App Store.

source: The Python source tree contains :source:`a patch file <Mac/Resources/app-store-compliance.patch>` that will remove all code that is known to cause issues with the App Store review process. This patch is applied automatically when CPython is configured with the :option:`--with-app-store-compliance` option.
pt_br: A árvore de fontes do Python contém :source:`um arquivo de patch <Mac/Resources/app-store-compliance.patch>` que removerá todo o código que é conhecido por causar problemas no processo de revisão da App Store. Este patch é aplicado automaticamente quando o CPython é configurado com a opção :option:`--with-app-store-compliance`.

source: This patch is not normally required to use CPython on a Mac; nor is it required if you are distributing an app *outside* the macOS App Store. It is *only* required if you are using the macOS App Store as a distribution channel.
pt_br: Este patch normalmente não é necessário para usar o CPython em um Mac; nem é necessário se você estiver distribuindo uma aplicação *fora* da App Store do macOS. É necessário *apenas* se você estiver usando a App Store do macOS como canal de distribuição.

source: Other Resources
pt_br: Outros recursos

source: The `python.org Help page <https://www.python.org/about/help/>`_ has links to many useful resources. The `Pythonmac-SIG mailing list <https://www.python.org/community/sigs/current/pythonmac-sig/>`_ is another support resource specifically for Python users and developers on the Mac.
pt_br: A `página de ajuda do python.org <https://www.python.org/about/help/>`_ contém links para vários recursos úteis. A `lista de discussão Pythonmac-SIG <https://www.python.org/community/sigs/current/pythonmac-sig/>`_ é outro recurso específico de suporte para usuários e desenvolvedores de Python no Mac.
