Repository: python/python-docs-pt-br
Catalog: using/mac.po
Languages: pt_br

source: Using Python on macOS
pt_br: Usando Python em macOS

source: This document aims to give an overview of macOS-specific behavior you should know about to get started with Python on Mac computers. Python on a Mac running macOS is very similar to Python on other Unix-derived platforms, but there are some differences in installation and some features.
pt_br: Este documento tem o objetivo de fornecer uma visão geral dos comportamentos específicos do macOS que você deve conhecer para começar a usar o Python em computadores Mac. O Python em um Mac com macOS é muito semelhante ao Python em outras plataformas derivadas do Unix, mas há algumas diferenças na instalação e alguns recursos.

source: There are various ways to obtain and install Python for macOS. Pre-built versions of the most recent versions of Python are available from a number of distributors. Much of this document describes use of the Pythons provided by the CPython release team for download from the `python.org website <https://www.python.org/downloads/>`_. See :ref:`alternative_bundles` for some other options.
pt_br: Há várias maneiras de obter e instalar o Python para macOS. Versões pré-construídas das versões mais recentes do Python estão disponíveis em vários distribuidores. Grande parte deste documento descreve o uso dos Pythons fornecidos pela equipe de lançamento do CPython, disponíveis para download no site `python.org <https://www.python.org/downloads/>`_. Consulte :ref:`alternative_bundles` para conhecer outras opções.

source: Using Python for macOS from ``python.org``
pt_br: Usando Python para macOS do ``python.org``

source: Installation steps
pt_br: Etapas de instalação

source: For `current Python versions <https://www.python.org/downloads/>`_ (other than those in ``security`` status), the release team produces a **Python for macOS** installer package for each new release. A list of available installers is available `here <https://www.python.org/downloads/macos/>`_. We recommend using the most recent supported Python version where possible. Current installers provide a `universal2 binary <https://en.wikipedia.org/wiki/Universal_binary>`_ build of Python which runs natively on all Macs (Apple Silicon and Intel) that are supported by a wide range of macOS versions, currently typically from at least **macOS 10.13 High Sierra** on.
pt_br: Para `as versões atuais de Python <https://www.python.org/downloads/>`_ (exceto as com status ``security``), a equipe de lançamento produz um pacote de instalação **Python para macOS** em cada novo lançamento. Uma lista dos instaladores disponíveis está disponível `aqui <https://www.python.org/downloads/macos/>`_. Recomendamos usar a versão suportada mais recente de Python sempre que possível. Os instaladores atuais fornecem uma versão de Python como `binário universal 2 <https://pt.wikipedia.org/wiki/Bin%C3%A1rio_universal>`_ que é executado nativamente em todos os Macs (Apple Silicon e Intel) compatíveis com uma ampla gama de versões do macOS, atualmente do **macOS 10.13 High Sierra** em diante.

source: The downloaded file is a standard macOS installer package file (``.pkg``). File integrity information (checksum, size, sigstore signature, etc) for each file is included on the release download page. Installer packages and their contents are signed and notarized with ``Python Software Foundation`` Apple Developer ID certificates to meet `macOS Gatekeeper requirements <https://support.apple.com/en-us/102445>`_.
pt_br: O arquivo baixado é um arquivo padrão do instalador de pacotes do macOS (``.pkg``). As informações de integridade do arquivo (soma de verificação, tamanho, assinatura de Sigstore, etc.) de cada arquivo estão inclusas na página de download dos lançamentos. Os pacotes de instalação e seus conteúdos são assinados e autenticados com certificados Apple Developer ID ``Python Software Foundation`` para atender aos `requisitos do macOS Gatekeeper <https://support.apple.com/en-us/102445>`_.

source: For a default installation, double-click on the downloaded installer package file. This should launch the standard macOS Installer app and display the first of several installer windows steps.
pt_br: Para uma instalação padrão, clique duas vezes no arquivo instalador de pacotes baixado. Isso deverá abrir o aplicativo padrão de instalação do macOS e exibir o primeiro de vários passos de instalação.

source: Clicking on the **Continue** button brings up the **Read Me** for this installer. Besides other important information, the **Read Me** documents which Python version is going to be installed and on what versions of macOS it is supported. You may need to scroll through to read the whole file. By default, this **Read Me** will also be installed in |usemac_applications_folder_version| and available to read anytime.
pt_br: Ao clicar no botão **Continuar**, é exibido o **Read Me** desse instalador. Além de outras informações importantes, o **Read Me** documenta qual versão de Python será instalada e em quais versões do macOS ele é compatível. Talvez você precise rolar a tela para ler o arquivo inteiro. Por padrão, esse **Read Me** também será instalado em |usemac_applications_folder_version| e estará disponível para leitura a qualquer momento.

source: Clicking on **Continue** proceeds to display the license for Python and for other included software. You will then need to **Agree** to the license terms before proceeding to the next step. This license file will also be installed and available to be read later.
pt_br: Ao clicar em **Continuar**, o instalador exibe a licença do Python e de outros softwares incluídos. Você precisará **Concordar** com os termos da licença antes de prosseguir para a próxima etapa. Esse arquivo de licença também será instalado e estará disponível para leitura a qualquer momento.

source: After the license terms are accepted, the next step is the **Installation Type** display. For most uses, the standard set of installation operations is appropriate.
pt_br: Após aceitar os termos da licença, a próxima etapa será a tela **Tipo de instalação**. Para a maioria dos usos, o conjunto padrão de operações de instalação é adequado.

source: By pressing the **Customize** button, you can choose to omit or select certain package components of the installer. Click on each package name to see a description of what it installs. To also install support for the optional experimental free-threaded feature, see :ref:`install-freethreaded-macos`.
pt_br: Ao pressionar o botão **Personalizar**, você pode optar por omitir ou selecionar determinados componentes de pacote do instalador. Clique em cada nome de pacote para ver uma descrição do que ele instala. Para também instalar o suporte para o recurso experimental opcional de threads livres, consulte :ref:`install-freethreaded-macos`.

source: In either case, clicking **Install** will begin the install process by asking permission to install new software. A macOS user name with ``Administrator`` privilege is needed as the installed Python will be available to all users of the Mac.
pt_br: Em ambos os casos, clicar em **Instalar** iniciará o processo de instalação solicitando a permissão para instalar um novo software. É necessário um nome de usuário do macOS com privilégio de ``Administrador``, pois o Python instalado estará disponível para todos os usuários do Mac.

source: When the installation is complete, the **Summary** window will appear.
pt_br: Quando a instalação for concluída, a janela **Resumo** será exibida.

source: Double-click on the :command:`Install Certificates.command` icon or file in the |usemac_applications_folder_version| window to complete the installation.
pt_br: Clique duas vezes no ícone ou arquivo :command:`Install Certificates.command` na janela |usemac_applications_folder_version| para concluir a instalação.

source: This will open a temporary :program:`Terminal` shell window that will use the new Python to download and install SSL root certificates for its use.
pt_br: Isso abrirá uma janela temporária do console :program:`Terminal` que usará o novo Python para baixar e instalar certificados raiz SSL para seu uso.

source: If ``Successfully installed certifi`` and ``update complete`` appears in the terminal window, the installation is complete. Close this terminal window and the installer window.
pt_br: Se ``Successfully installed certifi`` e ``update complete`` aparecerem na janela do terminal, a instalação estará concluída. Feche essa janela do terminal e a janela do instalador.

source: A default install will include:
pt_br: Uma instalação do padrão incluirá:

source: A |usemac_applications_folder_name| folder in your :file:`Applications` folder. In here you find :program:`IDLE`, the development environment that is a standard part of official Python distributions; and :program:`Python Launcher`, which handles double-clicking Python scripts from the macOS `Finder <https://support.apple.com/en-us/HT201732>`_.
pt_br: Uma pasta |usemac_applications_folder_name| em sua pasta :file:`Applications`. Aqui você encontra o :program:`IDLE`, o ambiente de desenvolvimento que é parte das distribuições oficiais do Python; e o :program:`Python Launcher`, que executa scripts Python quando são clicados duas vezes dentro do `Finder <https://support.apple.com/en-us/HT201732>`_ .

source: A framework :file:`/Library/Frameworks/Python.framework`, which includes the Python executable and libraries. The installer adds this location to your shell path. To uninstall Python, you can remove these three things. Symlinks to the Python executable are placed in :file:`/usr/local/bin/`.
pt_br: Uma framework :file:`/Library/Frameworks/Python.framework`, que inclui o executável Python e suas bibliotecas. O instalador adiciona esse local ao seu *path* do console. Para desinstalar o Python, você pode remover esses três itens. É um link simbólico para o executável Python armazenado na pasta :file:`/usr/local/bin/`.

source: Recent versions of macOS include a :command:`python3` command in :file:`/usr/bin/python3` that links to a usually older and incomplete version of Python provided by and for use by the Apple development tools, :program:`Xcode` or the :program:`Command Line Tools for Xcode`. You should never modify or attempt to delete this installation, as it is Apple-controlled and is used by Apple-provided or third-party software. If you choose to install a newer Python version from ``python.org``, you will have two different but functional Python installations on your computer that can co-exist. The default installer options should ensure that its :command:`python3` will be used instead of the system :command:`python3`.
pt_br: As versões recentes do macOS incluem um comando :command:`python3` em :file:`/usr/bin/python3` que aponta para uma versão geralmente mais antiga e incompleta de Python fornecida por e para uso pelas ferramentas de desenvolvimento da Apple, :program:`Xcode` ou o :program:`Command Line Tools for Xcode`. Você nunca deve modificar ou tentar excluir essa instalação por ser controlada pela Apple e é usada por softwares da Apple ou de terceiros. Se você optar por instalar uma versão mais recente do Python a partir de ``python.org``, você terá duas instalações diferentes, mas funcionais, de Python no computador que podem coexistir. As opções do instalador padrão devem garantir que o comando :command:`python3` seja usado em vez do :command:`python3` do sistema.

source: How to run a Python script
pt_br: Como executar um script Python

source: There are two ways to invoke the Python interpreter. If you are familiar with using a Unix shell in a terminal window, you can invoke |usemac_python_x_dot_y_literal| or ``python3`` optionally followed by one or more command line options (described in :ref:`using-on-general`). The Python tutorial also has a useful section on :ref:`using Python interactively from a shell <tut-interac>`.
pt_br: Há duas maneiras de invocar o interpretador Python. Se você estiver familiarizado com o uso de um console Unix em terminal, você pode invocar |usemac_python_x_dot_y_literal| ou ``python3``, opcionalmente seguido por uma ou mais opções da linha de comando (descritas em :ref:`using-on-general`). O tutorial de Python também tem uma seção útil sobre o :ref:`uso interativo do Python a partir de um console <tut-interac>`.

source: You can also invoke the interpreter through an integrated development environment. :ref:`idle` is a basic editor and interpreter environment which is included with the standard distribution of Python. :program:`IDLE` includes a Help menu that allows you to access Python documentation. If you are completely new to Python, you can read the tutorial introduction in that document.
pt_br: Você também pode invocar o interpretador por um ambiente de desenvolvimento integrado (IDE). O :ref:`idle` é um editor e ambiente de desenvolvimento básico incluído com a distribuição padrão de Python. :program:`IDLE` inclui um menu Ajuda que te permite acessar a documentação de Python. Se você for completamente iniciante em Python, você pode ler o tutorial de introdução na documentação.

source: There are many other editors and IDEs available, see :ref:`editors` for more information.
pt_br: Há muitos outros editores e IDEs disponíveis. Consulte :ref:`editors` para mais informações.

source: To run a Python script file from the terminal window, you can invoke the interpreter with the name of the script file:
pt_br: Para executar um script Python na janela do terminal, você pode invocar o interpretador com o nome do arquivo de script:

source: To run your script from the Finder, you can either:
pt_br: Para executar seu script a partir do Finder, você pode:

source: Drag it to :program:`Python Launcher`.
pt_br: Arrastá-lo para o :program:`Python Launcher`.

source: Select :program:`Python Launcher` as the default application to open your script (or any ``.py`` script) through the Finder Info window and double-click it. :program:`Python Launcher` has various preferences to control how your script is launched. Option-dragging allows you to change these for one invocation, or use its ``Preferences`` menu to change things globally.
pt_br: Selecione :program:`Python Launcher` como a aplicação padrão para abrir seu script (ou qualquer script ``.py``) na janela de informações Finder Info, e clique duas vezes nele. O :program:`Python Launcher` tem várias preferências para controlar como o script é iniciado. Você pode arrastar opções para alterá-las por uma invocação, ou usar o menu ``Preferências`` para alterar configurações globalmente.

source: Be aware that running the script directly from the macOS Finder might produce different results than when running from a terminal window as the script will not be run in the usual shell environment including any setting of environment variables in shell profiles. And, as with any other script or program, be certain of what you are about to run.
pt_br: Saiba que executar o script diretamente do Finder pode produzir resultados diferentes daqueles obtidos em uma janela de terminal, pois o script não será executado no ambiente normal do console, incluindo qualquer configuração de variáveis de ambiente nos perfis do console. E, como em qualquer outro script ou programa, certifique-se do que está prestes a executar.

source: Alternative Distributions
pt_br: Distribuições alternativas

source: Besides the standard ``python.org`` for macOS installer, there are third-party distributions for macOS that may include additional functionality. Some popular distributions and their key features:
pt_br: Além do instalador padrão do ``python.org`` para macOS, existem distribuições de terceiros para macOS que podem incluir funcionalidades adicionais. Algumas distribuições populares e seus recursos-chave são:

source: Installer with multi-platform compatibility, documentation
pt_br: Instalador com compatibilidade multiplataforma, documentação

source: Popular scientific modules (such as numpy, scipy, and pandas) and the ``conda`` package manager.
pt_br: Módulos científicos populares (como numpy, scipy e pandas) e o gerenciador de pacotes ``conda``.

source: Package manager for macOS including multiple versions of Python and many third-party Python-based packages (including numpy, scipy, and pandas).
pt_br: Gerenciador de pacotes para macOS que inclui várias versões do Python e muitos pacotes Python de terceiros (incluindo numpy, scipy e pandas).

source: Another package manager for macOS including multiple versions of Python and many third-party Python-based packages. May include pre-built versions of Python and many packages for older versions of macOS.
pt_br: Outro gerenciador de pacotes para macOS, incluindo várias versões de Python e muitos pacotes Python de terceiros. Pode incluir versões pré-construídas do Python e muitos pacotes para versões mais antigas do macOS.

source: Note that distributions might not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
pt_br: Note que distribuições podem não incluir versões mais recentes de Python ou de outras bibliotecas, e não são mantidas ou providas pela equipe do Python.

source: Installing Additional Python Packages
pt_br: Instalando pacotes adicionais ao python

source: Refer to the `Python Packaging User Guide`_ for more information.
pt_br: Consulte o `Guia de Usuário para Empacotamento de Python`_ para mais informações.

source: GUI Programming
pt_br: Programação de GUI

source: There are several options for building GUI applications on the Mac with Python.
pt_br: Existem várias opções para criar aplicações GUI no Mac com Python.

source: The standard Python GUI toolkit is :mod:`tkinter`, based on the cross-platform Tk toolkit (https://www.tcl.tk). A macOS-native version of Tk is included with the installer.
pt_br: O kit de ferramentas GUI padrão de Python é o módulo :mod:`tkinter`, baseado no kit de ferramentas multiplataforma Tk (https://www.tcl.tk). Uma versão nativa do Tk para macOS está incluída no instalador.

source: *PyObjC* is a Python binding to Apple's Objective-C/Cocoa framework. Information on PyObjC is available from :pypi:`pyobjc`.
pt_br: *O PyObjC* é uma ligação em Python para o Objective-C/Cocoa da Apple framework. Informações sobre o PyObjC estão disponíveis em :pypi:`pyobjc`.

source: A number of alternative macOS GUI toolkits are available including:
pt_br: Há vários kits de ferramentas GUI alternativas disponíveis para o macOS, incluindo:

source: `PySide <https://www.qt.io/qt-for-python>`_: Official Python bindings to the `Qt GUI toolkit <https://wiki.qt.io/Qt_for_Python>`_.
pt_br: `PySide <https://www.qt.io/qt-for-python>`_: Ligações oficiais em Python ao kit de ferramentas `Qt GUI <https://wiki.qt.io/Qt_for_Python>`_ .

source: `PyQt <https://riverbankcomputing.com/software/pyqt/>`_: Alternative Python bindings to Qt.
pt_br: `PyQt <https://riverbankcomputing.com/software/pyqt/>`_: Ligações alternativas em Python ao Qt.

source: `Kivy <https://kivy.org>`_: A cross-platform GUI toolkit that supports desktop and mobile platforms.
pt_br: `Kivy <https://kivy.org>`_: Um kit de ferramentas GUI multiplataforma que dá suporte a plataformas de desktop e dispositivos móveis.

source: `Toga <https://toga.readthedocs.io>`_: Part of the `BeeWare Project <https://beeware.org>`_; supports desktop, mobile, web and console apps.
pt_br: `Toga <https://toga.readthedocs.io>`_: Parte do `BeeWare Project <https://beeware.org>`_; dá suporte a aplicativos para desktop, dispositivos móveis, Web e console.

source: `wxPython <https://wxpython.org>`_: A cross-platform toolkit that supports desktop operating systems.
pt_br: `wxPython <https://wxpython.org>`_: Um kit de ferramentas multiplataforma que dá suporte a sistemas operacionais desktop.

source: Advanced Topics
pt_br: Tópicos Avançados

source: Installing Free-threaded Binaries
pt_br: Instalando binários com threads livres

source: Everything described in this section is considered experimental, and should be expected to change in future releases.
pt_br: Tudo descrito nesta seção é considerado experimental e espera-se que mude em lançamentos futuros.

source: The ``python.org`` :ref:`Python for macOS <getting-and-installing-macpython>` installer package can optionally install an additional build of Python |usemac_x_dot_y| that supports :pep:`703`, the experimental free-threading feature (running with the :term:`global interpreter lock` disabled). Check the release page on ``python.org`` for possible updated information.
pt_br: O pacote de instalação do :ref:`Python para macOS <getting-and-installing-macpython>` em ``python.org`` pode, opcionalmente, instalar uma compilação adicional do Python |usemac_x_dot_y| que dá suporte à :pep:`703`, o recurso experimental de threads livres (executado com o :term:`trava global do interpretador` desativado). Verifique a página de lançamento em ``python.org`` para obter informações atualizadas.

source: Because this feature is still considered experimental, the support for it is not installed by default. It is packaged as a separate install option, available by clicking the **Customize** button on the **Installation Type** step of the installer as described above.
pt_br: Como esse recurso ainda é considerado experimental, seu suporte não é instalado por padrão. Ele é empacotado como uma opção de instalação separada, disponível clicando no botão **Personalizar** na etapa **Tipo de instalação** do instalador, como descrito acima.

source: If the box next to the **Free-threaded Python** package name is checked, a separate :file:`PythonT.framework` will also be installed alongside the normal :file:`Python.framework` in :file:`/Library/Frameworks`. This configuration allows a free-threaded Python |usemac_x_dot_y| build to co-exist on your system with a traditional (GIL only) Python |usemac_x_dot_y| build with minimal risk while installing or testing. This installation layout is itself experimental and is subject to change in future releases.
pt_br: Se a caixa ao lado do nome **Free-Threaded Python** for marcada, um arquivo :file:`PythonT.framework` também será instalado junto ao arquivo :file:`Python.framework` em :file:`/Library/Frameworks`. Essa configuração permite que a compilação de Python |usemac_x_dot_y| com threads livres coexista no seu sistema com a compilação de Python |usemac_x_dot_y| tradicional (com GIL) com risco mínimo durante instalação ou testagem. Esse layout de instalação é experimental, e sujeito a mudanças em lançamentos futuros.

source: Known cautions and limitations:
pt_br: Precauções e limitações conhecidas:

source: The **UNIX command-line tools** package, which is selected by default, will install links in :file:`/usr/local/bin` for |usemac_python_x_dot_y_t_literal|, the free-threaded interpreter, and |usemac_python_x_dot_y_t_literal_config|, a configuration utility which may be useful for package builders. Since :file:`/usr/local/bin` is typically included in your shell ``PATH``, in most cases no changes to your ``PATH`` environment variables should be needed to use |usemac_python_x_dot_y_t_literal|.
pt_br: O pacote **Unix command-line tools**, que é selecionado por padrão, instalará links em :file:`/usr/local/bin` para |usemac_python_x_dot_y_t_literal|, o interpretador com threads livres e |usemac_python_x_dot_y_t_literal_config|, um utilitário de configuração que pode ser útil para criadores de pacote. Como :file:`/usr/local/bin` é normalmente incluído em seu ``PATH`` do console, geralmente não é necessário alterar as variáveis de ambiente do ``PATH`` para usar o |usemac_python_x_dot_y_t_literal|.
