Repository: python/python-docs-pt-br
Catalog: using/windows.po
Languages: pt_br

source: If no version qualifiers are found in a command, the environment variable :envvar:`!PY_PYTHON` can be set to specify the default version qualifier. If it is not set, the default is "3". The variable can specify any value that may be passed on the command line, such as "3", "3.7", "3.7-32" or "3.7-64". (Note that the "-64" option is only available with the launcher included with Python 3.7 or newer.)
pt_br: Se nenhum qualificador de versão é encontrado em um comando, a variável de ambiente :envvar:`!PY_PYTHON` pode ser definida para especificar o qualificador de versão padrão. Se ela não está definida, o padrão é "3". A variável pode especificar qualquer valor que pode ser passado para a linha de comando, como "3", "3.7", "3.7-32" ou "3.7-64". (Note que a opção "-64" está disponível apenas com o inicializador incluso no Python 3.7 ou mais recente.)

source: If no minor version qualifiers are found, the environment variable ``PY_PYTHON{major}`` (where ``{major}`` is the current major version qualifier as determined above) can be set to specify the full version. If no such option is found, the launcher will enumerate the installed Python versions and use the latest minor release found for the major version, which is likely, although not guaranteed, to be the most recently installed version in that family.
pt_br: Se nenhum qualificador de versão menor é encontrado, a variável de ambiente ``PY_PYTHON{major}`` (onde ``{major}`` é o qualificador da versão maior atual, como determinado acima) pode ser definida para especificar a versão completa. Se nenhuma opção é encontrada, o inicializador irá enumerar as versões do Python instaladas e usar a última versão menor encontrada como versão maior, o que é provavelmente, ainda que não garantido, a versão instalada mais recentemente naquela família.

source: On 64-bit Windows with both 32-bit and 64-bit implementations of the same (major.minor) Python version installed, the 64-bit version will always be preferred. This will be true for both 32-bit and 64-bit implementations of the launcher - a 32-bit launcher will prefer to execute a 64-bit Python installation of the specified version if available. This is so the behavior of the launcher can be predicted knowing only what versions are installed on the PC and without regard to the order in which they were installed (i.e., without knowing whether a 32 or 64-bit version of Python and corresponding launcher was installed last). As noted above, an optional "-32" or "-64" suffix can be used on a version specifier to change this behaviour.
pt_br: Em um Windows 64-bit com ambas as implementações de 32-bit e 64-bit da mesma (maior.menor) versão do Python instaladas, a versão 64-bit sempre será preferida. Isso será verdadeiro para ambas as implementações de 32-bit e 64-bit do inicializador - um inicializador 32-bit irá preferir executar uma instalação 64-bit do Python da versão especificada, se disponível. Isso é para que o comportamento do inicializador possa ser previsto sabendo apenas quais versões estão instaladas no PC e sem considerar a ordem com que elas foram instaladas (isto é, sem saber se a última a ser instalada foi a versão 32 ou 64-bit do Python e do instalador correspondente). Como observado acima, um sufixo opcional "-32" ou "-64" pode ser usado como especificador de versão para mudar esse comportamento.

source: Examples:
pt_br: Exemplos:

source: If no relevant options are set, the commands ``python`` and ``python2`` will use the latest Python 2.x version installed and the command ``python3`` will use the latest Python 3.x installed.
pt_br: Se nenhuma opção relevante for definida, os comandos ``python`` e ``python2`` irão usar a última versão instalada do Python 2.x e o comando ``python3`` irá usar o último Python 3.x instalado.

source: The command ``python3.7`` will not consult any options at all as the versions are fully specified.
pt_br: O comando ``python3.7`` não vai consultar nenhuma opção já que as versões estão completamente especificadas.

source: If ``PY_PYTHON=3``, the commands ``python`` and ``python3`` will both use the latest installed Python 3 version.
pt_br: Se ``PY_PYTHON=3``, os comandos ``python`` e ``python3`` irão ambos usar a última versão do Python 3 instalada.

source: If ``PY_PYTHON=3.7-32``, the command ``python`` will use the 32-bit implementation of 3.7 whereas the command ``python3`` will use the latest installed Python (PY_PYTHON was not considered at all as a major version was specified.)
pt_br: Se ``PY_PYTHON=3.7-32``, o comando ``python`` irá usar a implementação 32 bits do 3.7 enquanto o comando ``python3`` irá usar o último Python instalado (PY_PYTHON não foi considerado porque uma versão maior foi especificada).

source: If ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7``, the commands ``python`` and ``python3`` will both use specifically 3.7
pt_br: Se ``PY_PYTHON=3`` e ``PY_PYTHON3=3.7``, os comandos ``python`` e ``python3`` irão ambos usar especificamente 3.7

source: In addition to environment variables, the same settings can be configured in the .INI file used by the launcher. The section in the INI file is called ``[defaults]`` and the key name will be the same as the environment variables without the leading ``PY_`` prefix (and note that the key names in the INI file are case insensitive.) The contents of an environment variable will override things specified in the INI file.
pt_br: Em adição às variáveis de ambiente, as mesmas configurações podem ser feitas no arquivo .INI usado pelo inicializador. A seção nos arquivos INI é chamada ``[defaults]`` e o nome da chave será o mesmo que as variáveis de ambiente sem o prefixo ``PY_`` (e observe que os nomes das chaves no arquivo INI não diferem maiúsculas e minúsculas). Os conteúdos de uma variável de ambiente irão sobrescrever coisas especificadas em um arquivo INI.

source: For example:
pt_br: Por exemplo:

source: Setting ``PY_PYTHON=3.7`` is equivalent to the INI file containing:
pt_br: Configurar ``PY_PYTHON=3.7`` é o equivalente ao arquivo INI contendo:

source: Setting ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7`` is equivalent to the INI file containing:
pt_br: Configurar ``PY_PYTHON=3`` e ``PY_PYTHON3=3.7`` é o equivalente ao arquivo INI contendo:

source: Diagnostics
pt_br: Diagnósticos

source: If an environment variable :envvar:`!PYLAUNCHER_DEBUG` is set (to any value), the launcher will print diagnostic information to stderr (i.e. to the console). While this information manages to be simultaneously verbose *and* terse, it should allow you to see what versions of Python were located, why a particular version was chosen and the exact command-line used to execute the target Python. It is primarily intended for testing and debugging.
pt_br: Se uma variável de ambiente :envvar:`!PYLAUNCHER_DEBUG` é configurada (para qualquer valor), o inicializador irá exibir a informação de diagnóstico do stderr (isto é, no console). Enquanto essa informação consegue ser simultaneamente verbosa *e* concisa, ela deve permitir que você veja quais versões do Python foram localizadas, porquê uma versão particular foi escolhida e qual linha de comando exatamente foi usada para executar o Python alvo. Destina-se principalmente para testes e depuração.

source: Dry run
pt_br: Teste de simulação

source: If an environment variable :envvar:`!PYLAUNCHER_DRYRUN` is set (to any value), the launcher will output the command it would have run, but will not actually launch Python. This may be useful for tools that want to use the launcher to detect and then launch Python directly. Note that the command written to standard output is always encoded using UTF-8, and may not render correctly in the console.
pt_br: Se uma variável de ambiente :envvar:`!PYLAUNCHER_DRYRUN` for definida (para qualquer valor), o inicializador emitirá o comando que ele teria executado, mas não iniciará o Python de fato. Isso pode ser útil para ferramentas que desejam usar o inicializador para detectar e então iniciar o Python diretamente. Observe que o comando escrito na saída padrão é sempre codificado usando UTF-8 e pode não ser renderizado corretamente no console.

source: Install on demand
pt_br: Instalar sob demanda

source: If an environment variable :envvar:`!PYLAUNCHER_ALLOW_INSTALL` is set (to any value), and the requested Python version is not installed but is available on the Microsoft Store, the launcher will attempt to install it. This may require user interaction to complete, and you may need to run the command again.
pt_br: Se uma variável de ambiente :envvar:`!PYLAUNCHER_ALLOW_INSTALL` for definida (para qualquer valor), e a versão do Python solicitada não estiver instalada, mas estiver disponível na Microsoft Store, o inicializador tentará instalá-la. Isso pode exigir interação do usuário para ser concluído, e você pode precisar executar o comando novamente.

source: An additional :envvar:`!PYLAUNCHER_ALWAYS_INSTALL` variable causes the launcher to always try to install Python, even if it is detected. This is mainly intended for testing (and should be used with :envvar:`!PYLAUNCHER_DRYRUN`).
pt_br: Uma variável adicional :envvar:`!PYLAUNCHER_ALWAYS_INSTALL` faz com que o inicializador sempre tente instalar o Python, mesmo se for detectado. Isso é destinado principalmente para teste (e deve ser usado com :envvar:`!PYLAUNCHER_DRYRUN`).

source: Return codes
pt_br: Códigos de retorno

source: The following exit codes may be returned by the Python launcher. Unfortunately, there is no way to distinguish these from the exit code of Python itself.
pt_br: Os seguintes códigos de saída podem ser retornados pelo inicializador do Python. Infelizmente, não há como distingui-los do código de saída do próprio Python.

source: The names of codes are as used in the sources, and are only for reference. There is no way to access or resolve them apart from reading this page. Entries are listed in alphabetical order of names.
pt_br: Os nomes dos códigos são como usados nas fontes e são apenas para referência. Não há como acessá-los ou resolvê-los além de ler esta página. As entradas são listadas em ordem alfabética de nomes.

source: Value
pt_br: Valor

source: A :file:`pyvenv.cfg` was found but is corrupt.
pt_br: Um :file:`pyvenv.cfg` foi encontrado, mas está corrompido.

source: Failed to launch Python.
pt_br: Falha ao iniciar o Python.

source: An install was started, but the command will need to be re-run after it completes.
pt_br: Uma instalação foi iniciada, mas o comando precisará ser executado novamente após sua conclusão.

source: Unexpected error. Please report a bug.
pt_br: Erro inesperado. Por favor, relate um bug.

source: Unable to obtain command line from the operating system.
pt_br: Não é possível obter a linha de comando do sistema operacional.

source: Unable to locate the requested version.
pt_br: Não foi possível localizar a versão solicitada.

source: A :file:`pyvenv.cfg` was required but not found.
pt_br: Um :file:`pyvenv.cfg` era necessário, mas não foi encontrado.
