Repository: python/python-docs-pt-br
Catalog: using/windows.po
Languages: pt_br

source: These will ensure that the files in a system-wide installation will not take precedence over the copy of the standard library bundled with your application. Otherwise, your users may experience problems using your application. Note that the first suggestion is the best, as the others may still be susceptible to non-standard paths in the registry and user site-packages.
pt_br: Isso irá garantir que seus arquivos em uma instalação global no sistema não terão precedência sobre uma cópia da biblioteca padrão empacotada com a sua aplicação. Caso contrário, seus usuários podem experienciar problemas usando sua aplicação. Note que a primeira sugestão é a melhor, pois as outras podem ainda estar suscetíveis a caminhos não-padrão no registro e no site-packages do usuário.

source: Add ``._pth`` file support and removes ``applocal`` option from ``pyvenv.cfg``.
pt_br: Adiciona suporte a arquivos ``._pth`` e remove a opção ``applocal`` do ``pyvenv.cfg``.

source: Add :file:`python{XX}.zip` as a potential landmark when directly adjacent to the executable.
pt_br: Adiciona :file:`python{XX}.zip` como uma possível referência quando diretamente adjacente ao executável.

source: Modules specified in the registry under ``Modules`` (not ``PythonPath``) may be imported by :class:`importlib.machinery.WindowsRegistryFinder`. This finder is enabled on Windows in 3.6.0 and earlier, but may need to be explicitly added to :data:`sys.meta_path` in the future.
pt_br: Módulos especificados no registro sob ``Modules`` (não ``PythonPath``) podem ser importados por :class:`importlib.machinery.WindowsRegistryFinder`. Este localizador está ativo no Windows no 3.6.0 e anteriores, mas pode precisar ser explicitamente adicionado ao :data:`sys.meta_path` no futuro.

source: Additional modules
pt_br: Módulos adicionais

source: Even though Python aims to be portable among all platforms, there are features that are unique to Windows. A couple of modules, both in the standard library and external, and snippets exist to use these features.
pt_br: Mesmo que o Python tenha como objetivo ser portável através de todas as plataformas, existem recursos que são únicos para o Windows. Alguns módulos, em ambas as bibliotecas padrão e externa, e trechos de código existem para usar esses recursos.

source: The Windows-specific standard modules are documented in :ref:`mswin-specific-services`.
pt_br: Os módulos padrão específicos para Windows estão documentados em :ref:`mswin-specific-services`.

source: The :pypi:`PyWin32` module by Mark Hammond is a collection of modules for advanced Windows-specific support. This includes utilities for:
pt_br: O módulo :pypi:`PyWin32` de Mark Hammond é uma coleção de módulos para suporte avançado específico para Windows. Isso inclui utilitários para:

source: Win32 API calls
pt_br: Chamadas à API Win32

source: Registry
pt_br: Registro

source: Event log
pt_br: Log de Eventos

source: `Microsoft Foundation Classes <https://learn.microsoft.com/cpp/mfc/mfc-desktop-applications>`_ (MFC) user interfaces
pt_br: Interfaces de usuário `Microsoft Foundation Classes <https://learn.microsoft.com/cpp/mfc/mfc-desktop-applications>`_ (MFC)

source: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ is a sample MFC application shipped with PyWin32. It is an embeddable IDE with a built-in debugger.
pt_br: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ é uma aplicação MFC de exemplo enviada com o PyWin32. É uma IDE embutível com um depurador embutido.

source: by Tim Golden
pt_br: por Tim Golden

source: `Python and COM <https://www.boddie.org.uk/python/COM.html>`_
pt_br: `Python e COM <https://www.boddie.org.uk/python/COM.html>`_

source: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ wraps Python scripts into executable Windows programs (:file:`{*}.exe` files). When you have done this, you can distribute your application without requiring your users to install Python.
pt_br: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ encapsula scripts Python em programas executáveis do Windows (arquivos :file:`{*}.exe`). Quando você tiver feito isso, você pode distribuir sua aplicação sem solicitar que os seus usuários instalem o Python.

source: Compiling Python on Windows
pt_br: Compilando Python no Windows

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `checkout <https://devguide.python.org/setup/#get-the-source-code>`_.
pt_br: Se você quer compilar o CPython por conta própria, a primeira coisa que você precisa ter é a `fonte <https://www.python.org/downloads/source/>`_. Você pode fazer o download tanto da fonte da última versão quanto pegar um novo `checkout <https://devguide.python.org/setup/#get-the-source-code>`_.

source: The source tree contains a build solution and project files for Microsoft Visual Studio, which is the compiler used to build the official Python releases. These files are in the :file:`PCbuild` directory.
pt_br: A árvore de fontes contém uma solução de construção e arquivos de projeto para o Microsoft Visual Studio, que é o compilador usado para construir as versões do Python oficiais. Esses arquivos estão no diretório :file:`PCbuild`.

source: Check :file:`PCbuild/readme.txt` for general information on the build process.
pt_br: Confira o :file:`PCbuild/readme.txt` para informações gerais sobre o processo de construção.

source: For extension modules, consult :ref:`building-on-windows`.
pt_br: Para módulos de extensão, consulte :ref:`building-on-windows`.

source: The full installer (deprecated)
pt_br: O instalador completo (descontinuado)

source: This installer is deprecated since 3.14 and will not be produced for Python 3.16 or later. See :ref:`pymanager` for the modern installer.
pt_br: Este instalador está descontinuado desde a versão 3.14 e não será produzido para Python 3.16 ou posterior. Consulte :ref:`pymanager` para obter o instalador moderno.

source: Installation steps
pt_br: Etapas de instalação

source: Four Python |version| installers are available for download - two each for the 32-bit and 64-bit versions of the interpreter. The *web installer* is a small initial download, and it will automatically download the required components as necessary. The *offline installer* includes the components necessary for a default installation and only requires an internet connection for optional features. See :ref:`install-layout-option` for other ways to avoid downloading during installation.
pt_br: Quatro instaladores Python |version| estão disponíveis para download - dois de cada para as versões 32-bit e 64-bit do interpretador. O *instalador web* é um download inicial menor, e ele irá automaticamente fazer o download dos componentes solicitados na medida do necessário. O *instalador offline* inclui os componentes necessários para uma instalação padrão e requer apenas uma conexão de internet para recursos opcionais. Veja :ref:`install-layout-option` para outras formas de evitar o download durante a instalação.

source: After starting the installer, one of two options may be selected:
pt_br: Após iniciar o instalador, uma de duas opções deve ser selecionada:

source: If you select "Install Now":
pt_br: Se você selecionar "Install Now":

source: You will *not* need to be an administrator (unless a system update for the C Runtime Library is required or you install the :ref:`launcher` for all users)
pt_br: Você *não* precisará ser um administrador (a menos que uma atualização de sistema para a Biblioteca em Tempo de Execução C seja necessária ou que você instale o :ref:`launcher` para todos os usuários)

source: Python will be installed into your user directory
pt_br: Python será instalado dentro do seu diretório de usuário

source: The :ref:`launcher` will be installed according to the option at the bottom of the first page
pt_br: O :ref:`launcher` será instalado de acordo com a opção ao final da primeira página

source: The standard library, test suite, launcher and pip will be installed
pt_br: A biblioteca padrão, a suíte de testes, o inicializador e o pip serão instalados

source: If selected, the install directory will be added to your :envvar:`PATH`
pt_br: Se selecionado, o diretório de instalação será adicionado no seu :envvar:`PATH`

source: Shortcuts will only be visible for the current user
pt_br: Atalhos serão visíveis apenas para o usuário atual

source: Selecting "Customize installation" will allow you to select the features to install, the installation location and other options or post-install actions. To install debugging symbols or binaries, you will need to use this option.
pt_br: Selecionando "Customize installation" irá permitir que você selecione os recursos a serem instalados, o local da instalação e outras opções ou ações pós-instalação. Para instalar símbolos de depuração ou binários, você precisará usar essa opção.

source: To perform an all-users installation, you should select "Customize installation". In this case:
pt_br: Para realizar uma instalação para todos os usuários, você deve selecionar "Customize installation". Neste caso:

source: You may be required to provide administrative credentials or approval
pt_br: Você pode ser solicitado a providenciar credenciais administrativas ou aprovação

source: Python will be installed into the Program Files directory
pt_br: Python será instalado dentro do diretório Program Files (Arquivos de Programa)

source: The :ref:`launcher` will be installed into the Windows directory
pt_br: O :ref:`launcher` será instalado dentro do diretório Windows

source: Optional features may be selected during installation
pt_br: Recursos opcionais podem ser selecionados durante a instalação

source: The standard library can be pre-compiled to bytecode
pt_br: A biblioteca padrão pode ser pré-compilada em bytecode

source: If selected, the install directory will be added to the system :envvar:`PATH`
pt_br: Se selecionado, o diretório de instalação será adicionado ao :envvar:`PATH` do sistema

source: Shortcuts are available for all users
pt_br: Atalhos estão disponíveis para todos os usuários

source: In the latest versions of Windows, this limitation can be expanded to approximately 32,000 characters. Your administrator will need to activate the "Enable Win32 long paths" group policy, or set ``LongPathsEnabled`` to ``1`` in the registry key ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.
pt_br: Nas últimas versões do Windows, essa limitação pode ser expandida para aproximadamente 32.000 caracteres. Seu administrador irá precisar ativar a política de grupo "Enable Win32 long paths", ou definir ``LongPathsEnabled`` para ``1`` na chave de registro ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.

source: After changing the above option, no further configuration is required.
pt_br: Após alterar a opção acima, nenhuma configuração adicional é necessária.

source: Support for long paths was enabled in Python.
pt_br: Suporte para caminhos longos foi ativado no Python.

source: Installing without UI
pt_br: Instalando sem UI

source: All of the options available in the installer UI can also be specified from the command line, allowing scripted installers to replicate an installation on many machines without user interaction. These options may also be set without suppressing the UI in order to change some of the defaults.
pt_br: Todas as opções disponíveis na IU do instalador também podem ser especificadas a partir da linha de comando, permitindo que instaladores por script repliquem uma instalação em várias máquinas sem interação do usuário. Essas opções também podem ser definidas sem suprimir a IU para alterar alguns dos padrões.

source: The following options (found by executing the installer with ``/?``) can be passed into the installer:
pt_br: As seguintes opções (encontradas executando o instalador com ``/?``) podem ser passadas para o instalador:

source: Name
pt_br: Nome

source: to display progress without requiring user interaction
pt_br: para exibir o progresso sem exigir interação do usuário

source: to install/uninstall without displaying any UI
pt_br: para instalar/desinstalar sem exibir nenhuma UI

source: to prevent user customization
pt_br: para evitar a personalização do usuário

source: to remove Python (without confirmation)
pt_br: para remover o Python (sem exigir confirmação)

source: /layout [directory]
pt_br: /layout [diretório]

source: to pre-download all components
pt_br: para pré-baixar todos os componentes

source: /log [filename]
pt_br: /log [nome-de-arquivo]

source: to specify log files location
pt_br: para especificar a localização dos arquivos de log

source: All other options are passed as ``name=value``, where the value is usually ``0`` to disable a feature, ``1`` to enable a feature, or a path. The full list of available options is shown below.
pt_br: Todas as outras opções são passadas como ``name=value``, onde o valor é usualmente ``0`` para desabilitar o recurso, ``1`` para ativar o recurso, ou um caminho. A lista completa de opções disponíveis é mostrada abaixo.

source: Default
pt_br: Default (padrão)

source: InstallAllUsers
pt_br: InstallAllUsers (Instalar para Todos usuários)

source: Perform a system-wide installation.
pt_br: Execute uma instalação em todo o sistema.

source: TargetDir
pt_br: TargetDir (Diretório Alvo)

source: The installation directory
pt_br: O diretório de instalação

source: Selected based on InstallAllUsers
pt_br: Selecionado com base em "Instalar para Todos os Usuários"

source: DefaultAllUsersTargetDir
pt_br: DefaultAllUsersTargetDir (Diretório de Destino Padrão para Todos os usuários)

source: The default installation directory for all-user installs
pt_br: O diretório de instalação padrão para instalações de todos os usuários

source: DefaultJustForMeTargetDir
pt_br: DefaultJustForMeTargetDir (Diretório Alvo Padrão Apenas Para Mim)

source: The default install directory for just-for-me installs
pt_br: O diretório de instalação padrão para instalações just-for-me

source: :file:`%LocalAppData%\\\ Programs\\Python\\\ PythonXY` or :file:`%LocalAppData%\\\ Programs\\Python\\\ PythonXY-32` or :file:`%LocalAppData%\\\ Programs\\Python\\\ PythonXY-64`
pt_br: :file:`%LocalAppData%\\\ Programs\\Python\\\ PythonXY` ou :file:`%LocalAppData%\\\ Programs\\Python\\\ PythonXY-32` ou :file:`%LocalAppData%\\\ Programs\\Python\\\ PythonXY-64`

source: DefaultCustomTargetDir
pt_br: DefaultCustomTargetDir (Diretório de destino personalizado padrão)

source: The default custom install directory displayed in the UI
pt_br: Diretório de instalação personalizado padrão exibido na interface do usuário

source: (empty)
pt_br: (vazio)

source: AssociateFiles
pt_br: AssociateFiles (Arquivos Associados)

source: Create file associations if the launcher is also installed.
pt_br: Criar associações de arquivos se o launcher também estiver instalado.

source: CompileAll
pt_br: CompileAll (Compilar Tudo)

source: Compile all ``.py`` files to ``.pyc``.
pt_br: Compile todos os arquivos ``.py`` para ``.pyc``.

source: PrependPath
pt_br: PrependPath (path a ser percorrido)

source: Prepend install and Scripts directories to :envvar:`PATH` and add ``.PY`` to :envvar:`PATHEXT`
pt_br: Anexa os diretórios de instalação e Scripts ao início de :envvar:`PATH` e adiciona ``.PY`` a :envvar:`PATHEXT`

source: Append install and Scripts directories to :envvar:`PATH` and add ``.PY`` to :envvar:`PATHEXT`
pt_br: Anexa os diretórios de instalação e Scripts ao final de :envvar:`PATH` e adiciona ``.PY`` a :envvar:`PATHEXT`

source: Shortcuts
pt_br: Shortcuts (atalhos)

source: Create shortcuts for the interpreter, documentation and IDLE if installed.
pt_br: Crie atalhos para o interpretador, documentação e IDLE se instalado.

source: Install Python manual
pt_br: Install Python manual (Instalação Manual do Python)

source: Include_debug
pt_br: Include_debug (Incluir o Modo de Depuração)

source: Install debug binaries
pt_br: Instalar binários de Depuração

source: Install developer headers and libraries. Omitting this may lead to an unusable installation.
pt_br: Instala cabeçalhos e bibliotecas do desenvolvedor. Omitir isso pode levar a uma instalação inutilizável.

source: Install :file:`python.exe` and related files. Omitting this may lead to an unusable installation.
pt_br: Instala :file:`python.exe` e arquivos relacionados. Omitir isso pode levar a uma instalação inutilizável.

source: Install :ref:`launcher`.
pt_br: Instalar :ref:`launcher`.

source: Installs the launcher for all users. Also requires ``Include_launcher`` to be set to 1
pt_br: Instala o iniciador para todos os usuários. Também requer ``Include_launcher`` para ser definido como 1

source: Install standard library and extension modules. Omitting this may lead to an unusable installation.
pt_br: Instala a biblioteca padrão e os módulos de extensão. Omitir isso pode levar a uma instalação inutilizável.

source: Install bundled pip and setuptools
pt_br: Instale o pacote pip e setuptools

source: Install debugging symbols (``*.pdb``)
pt_br: Instala símbolos de depuração (``*.pdb``)

source: Install Tcl/Tk support and IDLE
pt_br: Instale o suporte Tcl/Tk e o IDLE

source: Install standard library test suite
pt_br: Instalar o conjunto de testes da biblioteca padrão

source: Install utility scripts
pt_br: Instalar scripts com utilitários

source: Only installs the launcher. This will override most other options.
pt_br: Instala apenas o launcher. Isso substituirá a maioria das outras opções.

source: Disable most install UI
pt_br: Desativar a maioria das UIs de instalação

source: A custom message to display when the simplified install UI is used.
pt_br: Uma mensagem personalizada para exibir quando a IU de instalação simplificada é usada.

source: For example, to silently install a default, system-wide Python installation, you could use the following command (from an elevated command prompt)::
pt_br: Por exemplo, para instalar silenciosamente uma instalação de Python padrão e em todo o sistema, você pode usar o seguinte comando (a partir de um terminal de comando autorizado)::

source: To allow users to easily install a personal copy of Python without the test suite, you could provide a shortcut with the following command. This will display a simplified initial page and disallow customization::
pt_br: Para permitir que usuários instalem facilmente uma cópia do Python sem a suíte de testes, você pode fornecer um atalho com o seguinte comando. Isso irá exibir uma página inicial simplificado e bloquear a personalização::

source: (Note that omitting the launcher also omits file associations, and is only recommended for per-user installs when there is also a system-wide installation that included the launcher.)
pt_br: (Observe que omitir o inicializador também omite associações de arquivos, e só é recomendado para instalações por usuários quando também existe uma instalação por todo o sistema que inclui o inicializador.)

source: The options listed above can also be provided in a file named ``unattend.xml`` alongside the executable. This file specifies a list of options and values. When a value is provided as an attribute, it will be converted to a number if possible. Values provided as element text are always left as strings. This example file sets the same options as the previous example:
pt_br: As opções listadas acima também podem ser fornecidas em um arquivo chamado ``unattend.xml`` juntamente com o executável. Esse arquivo especifica uma lista de opções e valores. Quando um valor é fornecido como um atributo, ele será convertido para um número se possível. Valores fornecidos como elementos de texto são sempre deixados como strings. Esse arquivo de exemplo define as mesmas opções que o exemplo anterior:

source: Installing without downloading
pt_br: Instalando sem download

source: As some features of Python are not included in the initial installer download, selecting those features may require an internet connection. To avoid this need, all possible components may be downloaded on-demand to create a complete *layout* that will no longer require an internet connection regardless of the selected features. Note that this download may be bigger than required, but where a large number of installations are going to be performed it is very useful to have a locally cached copy.
pt_br: Como alguns recursos do Python não estão inclusos no download inicial do instalador, selecionar esses recursos pode exigir uma conexão com a internet. Para evitar isso, todos os possíveis componentes podem ser baixados sob demanda para criar um *layout* completo que não irá precisar de uma conexão de internet independentemente dos recursos selecionados. Note que este download pode ser maior que o necessário, mas onde um grande número de instalações serão realizadas é bem útil ter uma cópia em cache local.

source: Execute the following command from Command Prompt to download all possible required files. Remember to substitute ``python-3.9.0.exe`` for the actual name of your installer, and to create layouts in their own directories to avoid collisions between files with the same name.
pt_br: Execute o seguinte comando a partir do Prompt de Comando para fazer o download de todos os possíveis arquivos necessários. Lembre-se de substituir ``python-3.9.0.exe`` pelo nome real do seu instalador, e de criar layouts nos respectivos diretórios para evitar colisão entre arquivos com o mesmo nome.

source: python-3.9.0.exe /layout [optional target directory]
pt_br: python-3.9.0.exe /layout [diretório alvo opcional]

source: You may also specify the ``/quiet`` option to hide the progress display.
pt_br: Você também pode especificar a opção ``/quiet`` para esconder o acompanhamento de progresso.

source: Modifying an install
pt_br: Modificando uma instalação

source: Once Python has been installed, you can add or remove features through the Programs and Features tool that is part of Windows. Select the Python entry and choose "Uninstall/Change" to open the installer in maintenance mode.
pt_br: Uma vez que o Python foi instalado, você pode adicionar ou remover recursos através da ferramenta Programas e Recursos que é parte do Windows. Selecione o registro do Python e escolha "Uninstall/Change" para abrir o instalador no modo de manutenção.

source: "Modify" allows you to add or remove features by modifying the checkboxes - unchanged checkboxes will not install or remove anything. Some options cannot be changed in this mode, such as the install directory; to modify these, you will need to remove and then reinstall Python completely.
pt_br: "Modify" permite que você adicione ou remova recursos modificando as caixas de entrada - caixas de entrada não modificadas não irão instalar ou remover nada. Algumas opções não podem ser modificadas dessa forma, como o diretório de instalação; para modificá-las, você precisará remover e então reinstalar o Python completamente.

source: "Repair" will verify all the files that should be installed using the current settings and replace any that have been removed or modified.
pt_br: "Repair" irá verificar todos os arquivos que devem ser instalados usando as configurações atuais e substituir qualquer um que tiver sido removido ou modificado.

source: "Uninstall" will remove Python entirely, with the exception of the :ref:`launcher`, which has its own entry in Programs and Features.
pt_br: "Uninstall" irá remover o Python completamente, com a exceção do :ref:`launcher`, que tem seu próprio registro nos Programas e Recursos.
