Repository: python/python-docs-pt-br
Catalog: using/windows.po
Languages: pt_br

source: To download the Python install manager and install on another machine, the following WinGet command will download the required files from the Store to your Downloads directory (add ``-d <location>`` to customize the output location). This also generates a YAML file that appears to be unnecessary, as the downloaded MSIX can be installed by launching or using the commands below.
pt_br: Para baixar o gerenciador de instalação do Python e instalá-lo em outra máquina, o seguinte comando WinGet baixará os arquivos necessários da Loja para o seu diretório de Downloads (adicione ``-d <local>`` para personalizar o local de saída). Isso também gera um arquivo YAML que parece desnecessário, pois o MSIX baixado pode ser instalado iniciando ou usando os comandos abaixo.

source: To programmatically install or uninstall an MSIX using only PowerShell, the `Add-AppxPackage`_ and `Remove-AppxPackage`_ PowerShell cmdlets are recommended:
pt_br: Para instalar ou desinstalar programaticamente um MSIX usando apenas o PowerShell, os cmdlets `Add-AppxPackage`_ e `Remove-AppxPackage`_ do PowerShell são recomendados:

source: The latest release can be downloaded and installed by Windows by passing the AppInstaller file to the Add-AppxPackage command. This installs using the MSIX on python.org, and is only recommended for cases where installing via the Store (interactively or using WinGet) is not possible.
pt_br: A versão mais recente pode ser baixada e instalada pelo Windows passando o arquivo AppInstaller para o comando Add-AppxPackage. A instalação é feita usando o MSIX em python.org e é recomendada apenas para casos em que a instalação pela Loja (interativamente ou usando o WinGet) não é possível.

source: Other tools and APIs may also be used to provision an MSIX package for all users on a machine, but Python does not consider this a supported scenario. We suggest looking into the PowerShell `Add-AppxProvisionedPackage`_ cmdlet, the native Windows `PackageManager`_ class, or the documentation and support for your deployment tool.
pt_br: Outras ferramentas e APIs também podem ser usadas para provisionar um pacote MSIX para todos os usuários em uma máquina, mas o Python não considera esse cenário compatível. Sugerimos consultar o cmdlet `Add-AppxProvisionedPackage`_ do PowerShell, a classe nativa `PackageManager`_ do Windows ou a documentação e o suporte da sua ferramenta de implantação.

source: Regardless of the install method, users will still need to install their own copies of Python itself, as there is no way to trigger those installs without being a logged in user. When using the MSIX, the latest version of Python will be available for all users to install without network access.
pt_br: Independentemente do método de instalação, os usuários ainda precisarão instalar suas próprias cópias do Python, pois não há como acionar essas instalações sem ser um usuário logado. Ao usar o MSIX, a versão mais recente do Python estará disponível para todos os usuários instalarem sem acesso à rede.

source: Note that the MSIX downloadable from the Store and from the Python website are subtly different and cannot be installed at the same time. Wherever possible, we suggest using the above WinGet commands to download the package from the Store to reduce the risk of setting up conflicting installs. There are no licensing restrictions on the Python install manager that would prevent using the Store package in this way.
pt_br: Observe que o MSIX disponível para download na Loja e no site do Python são ligeiramente diferentes e não podem ser instalados ao mesmo tempo. Sempre que possível, sugerimos usar os comandos WinGet acima para baixar o pacote da Loja, a fim de reduzir o risco de instalação conflitante. Não há restrições de licenciamento para o gerenciador de instalação do Python que impeçam o uso do pacote da Loja dessa forma.

source: Administrative configuration
pt_br: Configuração administrativa

source: There are a number of options that may be useful for administrators to override configuration of the Python install manager. These can be used to provide local caching, disable certain shortcut types, override bundled content. All of the above configuration options may be set, as well as those below.
pt_br: Há diversas opções que podem ser úteis para administradores substituírem a configuração do gerenciador de instalação do Python. Elas podem ser usadas para fornecer cache local, desabilitar certos tipos de atalhos e substituir conteúdo agrupado. Todas as opções de configuração acima podem ser definidas, assim como as abaixo.

source: Configuration options may be overridden in the registry by setting values under :file:`HKEY_LOCAL_MACHINE\\Software\\Policies\\Python\\PyManager`, where the value name matches the configuration key and the value type is ``REG_SZ``. Note that this key can itself be customized, but only by modifying the core config file distributed with the Python install manager. We recommend, however, that registry values are used only to set ``base_config`` to a JSON file containing the full set of overrides. Registry key overrides will replace any other configured setting, while ``base_config`` allows users to further modify settings they may need.
pt_br: As opções de configuração podem ser substituídas no registro definindo valores em :file:`HKEY_LOCAL_MACHINE\\Software\\Policies\\Python\\PyManager`, onde o nome do valor corresponde à chave de configuração e o tipo de valor é ``REG_SZ``. Observe que essa chave pode ser personalizada, mas somente modificando o arquivo de configuração principal distribuído com o gerenciador de instalação do Python. Recomendamos, no entanto, que os valores do registro sejam usados apenas para definir ``base_config`` como um arquivo JSON contendo o conjunto completo de substituições. As substituições de chave do registro substituirão qualquer outra configuração configurada, enquanto ``base_config`` permite que os usuários modifiquem ainda mais as configurações necessárias.

source: Note that most settings with environment variables support those variables because their default setting specifies the variable. If you override them, the environment variable will no longer work, unless you override it with another one. For example, the default value of ``confirm`` is literally ``%PYTHON_MANAGER_CONFIRM%``, which will resolve the variable at load time. If you override the value to ``yes``, then the environment variable will no longer be used. If you override the value to ``%CONFIRM%``, then that environment variable will be used instead.
pt_br: Observe que a maioria das configurações com variáveis de ambiente oferece suporte a essas variáveis porque a configuração padrão especifica a variável. Se você as substituir, a variável de ambiente não funcionará mais, a menos que você a substitua por outra. Por exemplo, o valor padrão de ``confirm`` é literalmente ``%PYTHON_MANAGER_CONFIRM%``, o que resolverá a variável no momento do carregamento. Se você substituir o valor para ``yes``, a variável de ambiente não será mais usada. Se você substituir o valor para ``%CONFIRM%``, essa variável de ambiente será usada.

source: Configuration settings that are paths are interpreted as relative to the directory containing the configuration file that specified them.
pt_br: As definições de configuração que são caminhos são interpretadas como relativas ao diretório que contém o arquivo de configuração que as especificou.

source: Administrative configuration options
pt_br: Opções de configuração administrativa

source: The highest priority configuration file to read. Note that only the built-in configuration file and the registry can modify this setting.
pt_br: O arquivo de configuração de maior prioridade para leitura. Observe que somente o arquivo de configuração embutido e o registro podem modificar essa configuração.

source: The second configuration file to read.
pt_br: O segundo arquivo de configuração a ser lido.

source: The third configuration file to read.
pt_br: O terceiro arquivo de configuração a ser lido.

source: Registry location to check for overrides. Note that only the built-in configuration file can modify this setting.
pt_br: Local do registro para verificar se há substituições. Observe que somente o arquivo de configuração embutido pode modificar esta configuração.

source: Read-only directory containing locally cached files.
pt_br: Diretório somente leitura contendo arquivos armazenados em cache localmente.

source: Path or URL to an index to consult when the main index cannot be accessed.
pt_br: Caminho ou URL para um índice a ser consultado quando o índice principal não puder ser acessado.

source: Comma-separated list of shortcut kinds to allow (e.g. ``"pep514,start"``). Enabled shortcuts may still be disabled by ``disable_shortcut_kinds``.
pt_br: Lista separada por vírgulas de tipos de atalhos permitidos (por exemplo, ``"pep514,start"``). Atalhos habilitados ainda podem ser desabilitados por ``disable_shortcut_kinds``.

source: Comma-separated list of shortcut kinds to exclude (e.g. ``"pep514,start"``). Disabled shortcuts are not reactivated by ``enable_shortcut_kinds``.
pt_br: Lista separada por vírgulas de tipos de atalhos a serem excluídos (por exemplo, ``"pep514,start"``). Atalhos desabilitados não são reativados por ``enable_shortcut_kinds``.

source: Registry location to read and write PEP 514 entries into. By default, :file:`HKEY_CURRENT_USER\\Software\\Python`.
pt_br: Local do registro para leitura e gravação de entradas da PEP 514. Por padrão, :file:`HKEY_CURRENT_USER\\Software\\Python`.

source: Start menu folder to write shortcuts into. By default, ``Python``. This path is relative to the user's Programs folder.
pt_br: Pasta do menu Iniciar para gravar atalhos. Por padrão, ``Python``. Este caminho é relativo à pasta Programas do usuário.

source: Path to the active virtual environment. By default, this is ``%VIRTUAL_ENV%``, but may be set empty to disable venv detection.
pt_br: Caminho para o ambiente virtual ativo. Por padrão, é ``%VIRTUAL_ENV%``, mas pode ser definido como vazio para desabilitar a detecção de venv.

source: True to suppress visible warnings when a shebang launches an application other than a Python runtime.
pt_br: Verdadeiro para suprimir avisos visíveis quando um shebang executa uma aplicação que não seja um ambiente de execução Python.

source: Installing free-threaded binaries
pt_br: Instalando binários com threads livres

source: Pre-built distributions of the free-threaded build are available by installing tags with the ``t`` suffix.
pt_br: Distribuições pré-construídas da construção com threads livres estão disponíveis instalando tags com o sufixo ``t``.

source: This will install and register as normal. If you have no other runtimes installed, then ``python`` will launch this one. Otherwise, you will need to use ``py -V:3.14t ...`` or, if you have added the global aliases directory to your :envvar:`PATH` environment variable, the ``python3.14t.exe`` commands.
pt_br: Isso vai instalar e registrar como de costume. Se você não tiver outro ambiente de execução instalado, ``python`` iniciará este. Caso contrário, você precisará usar ``py -V:3.14t ...`` ou, se tiver adicionado o diretório global de apelidos à sua variável de ambiente :envvar:`PATH`, o comando ``python3.14t.exe``.

source: Troubleshooting
pt_br: Solução de problemas

source: If your Python install manager does not seem to be working correctly, please work through these tests and fixes to see if it helps. If not, please report an issue at `our bug tracker <https://github.com/python/cpython/issues>`_, including any relevant log files (written to your :file:`%TEMP%` directory by default).
pt_br: Se o seu gerenciador de instalação do Python não estiver funcionando corretamente, execute estes testes e correções para ver se ajuda. Caso contrário, relate o problema em `nosso rastreador de bugs <https://github.com/python/cpython/issues>`_, incluindo quaisquer arquivos de log relevantes (gravados no seu diretório :file:`%TEMP%` por padrão).

source: Symptom
pt_br: Sintoma

source: Things to try
pt_br: Coisas pra tentar

source: ``python`` gives me a "command not found" error or opens the Store app when I type it in my terminal.
pt_br: ``python`` retorna um erro "comando não encontrado" ou abre o aplicativo Store quando eu o digito no meu terminal.

source: Did you :ref:`install the Python install manager <pymanager>`?
pt_br: Você :ref:`instalou o gerenciador de instalação do Python <pymanager>`?

source: Click Start, open "Manage app execution aliases", and check that the aliases for "Python (default)" are enabled. If they already are, try disabling and re-enabling to refresh the command. The "Python (default windowed)" and "Python install manager" commands may also need refreshing.
pt_br: Clique em Iniciar, abra "Gerenciar aliases de execução de aplicativo" e verifique se os apelidos (aliases) para "Python (default)" estão ativados. Se já estiverem, tente desativá-los e ativá-los novamente para atualizar o comando. Os comandos "Python (windowed)" e "Python install manager" também podem precisar ser atualizados.

source: Check that the ``py`` and ``pymanager`` commands work.
pt_br: Verifique se os comandos ``py`` e ``pymanager`` funcionam.

source: ``py`` gives me a "command not found" error when I type it in my terminal.
pt_br: ``py`` me dá um erro "comando não encontrado" quando eu digito no meu terminal.

source: ``py`` gives me a "can't open file" error when I type commands in my terminal.
pt_br: ``py`` me dá um erro "não é possível abrir o arquivo" quando digito comandos no meu terminal.

source: This usually means you have the legacy launcher installed and it has priority over the Python install manager. To remove, click Start, open "Installed apps", search for "Python launcher" and uninstall it.
pt_br: Isso geralmente significa que você tem o inicializador legado instalado e ele tem prioridade sobre o gerenciador de instalação do Python. Para remover, clique em Iniciar, abra "Aplicativos instalados", procure por "Python launcher" e desinstale-o.

source: ``python`` doesn't launch the same runtime as ``py``
pt_br: ``python`` não inicia o mesmo ambiente de execução que ``py``

source: Click Start, open "Installed apps", look for any existing Python runtimes, and either remove them or Modify and disable the :envvar:`PATH` options.
pt_br: Clique em Iniciar, abra "Aplicativos instalados", procure por qualquer ambiente de execução do Python existente e remova-o ou modifique e desative as opções de :envvar:`PATH`.

source: Click Start, open "Manage app execution aliases", and check that your ``python.exe`` alias is set to "Python (default)"
pt_br: Clique em Iniciar, abra "Gerenciar aliases de execução de aplicativo" e verifique se o apelido ``python.exe`` está definido como "Python (default)"

source: ``python`` and ``py`` don't launch the runtime I expect
pt_br: ``python`` e ``py`` não iniciam o ambiente de execução que eu esperava

source: Check your :envvar:`PYTHON_MANAGER_DEFAULT` environment variable or ``default_tag`` configuration. The ``py list`` command will show your default based on these settings.
pt_br: Verifique a variável de ambiente :envvar:`PYTHON_MANAGER_DEFAULT` ou a configuração ``default_tag``. O comando ``py list`` mostrará o padrão com base nessas configurações.

source: Installs that are managed by the Python install manager will be chosen ahead of unmanaged installs. Use ``py install`` to install the runtime you expect, or configure your default tag.
pt_br: As instalações gerenciadas pelo gerenciador de instalação do Python serão escolhidas antes das instalações não gerenciadas. Use ``py install`` para instalar o ambiente de execução que você espera ou configure sua tag padrão.

source: Prerelease and experimental installs that are not managed by the Python install manager may be chosen ahead of stable releases. Configure your default tag or uninstall the prerelease runtime and reinstall using ``py install``.
pt_br: As instalações de pré-lançamento e experimentais que não são gerenciadas pelo gerenciador de instalação Python podem ser escolhidas antes das instalações estáveis. Configure sua tag padrão ou desinstale a versão do ambiente de execução de pré-lançamento e reinstale usando ``py install``.

source: ``pythonw`` or ``pyw`` don't launch the same runtime as ``python`` or ``py``
pt_br: ``pythonw`` ou ``pyw`` não iniciam o mesmo ambiente de execução que ``python`` ou ``py``

source: Click Start, open "Manage app execution aliases", and check that your ``pythonw.exe`` and ``pyw.exe`` aliases are consistent with your others.
pt_br: Clique em Iniciar, abra "Gerenciar aliases de execução de aplicativo" e verifique se seus apelidos ``pythonw.exe`` e ``pyw.exe`` são consistentes com os outros.

source: ``pip`` gives me a "command not found" error when I type it in my terminal.
pt_br: ``pip`` me dá um erro "comando não encontrado" quando eu digito no meu terminal.

source: Have you activated a virtual environment? Run the ``.venv\Scripts\activate`` script in your terminal to activate.
pt_br: Você ativou um ambiente virtual? Execute o script ``.venv\Scripts\activate`` no seu terminal para ativá-lo.

source: The package may be available but missing the generated executable. We recommend using the ``python -m pip`` command instead, or alternatively the ``python -m pip install --force pip`` command will recreate the executables and show you the path to add to :envvar:`PATH`. These scripts are separated for each runtime, and so you may need to add multiple paths.
pt_br: O pacote pode estar disponível, mas sem o executável gerado. Recomendamos usar o comando ``python -m pip`` ou, alternativamente, ``python -m pip install --force pip`` recriará os executáveis e mostrará o caminho a ser adicionado ao :envvar:`PATH`. Esses scripts são separados para cada ambiente de execução e, portanto, talvez seja necessário adicionar vários caminhos.

source: The embeddable package
pt_br: O pacote embutível

source: The embedded distribution is a ZIP file containing a minimal Python environment. It is intended for acting as part of another application, rather than being directly accessed by end-users.
pt_br: A distribuição embutida é um arquivo ZIP contendo um ambiente Python mínimo. Ela foi criada para atuar como parte de outra aplicação, ao invés de ser diretamente acessada por usuários finais.

source: To install an embedded distribution, we recommend using ``py install`` with the ``--target`` option:
pt_br: Para instalar uma distribuição incorporada, recomendamos usar o comando ``py install`` com a opção ``--target``:

source: When extracted, the embedded distribution is (almost) fully isolated from the user's system, including environment variables, system registry settings, and installed packages. The standard library is included as pre-compiled and optimized ``.pyc`` files in a ZIP, and ``python3.dll``, ``python313.dll``, ``python.exe`` and ``pythonw.exe`` are all provided. Tcl/tk (including all dependents, such as Idle), pip and the Python documentation are not included.
pt_br: Quando extraída, a distribuição embutida é (quase) completamente isolada do sistema do usuário, incluindo variáveis de ambiente, configurações de registro de sistema, e pacotes instalados. A biblioteca padrão está inclusa como arquivos ``.pyc`` pré-compilados e otimizados em um ZIP, e ``python3.dll``, ``python313.dll``, ``python.exe`` e ``pythonw.exe`` estão todos disponíveis. Tcl/tk (incluindo todas as dependências, como a Idle), pip e a documentação do Python não estão inclusos.

source: A default ``._pth`` file is included, which further restricts the default search paths (as described below in :ref:`windows_finding_modules`). This file is intended for embedders to modify as necessary.
pt_br: Um arquivo ``._pth`` padrão está incluído, o qual restringe ainda mais os caminhos de pesquisa padrão (conforme descrito abaixo em :ref:`windows_finding_modules`). Este arquivo destina-se a ser modificado por desenvolvedores que o incorporam, conforme necessário.

source: Third-party packages should be installed by the application installer alongside the embedded distribution. Using pip to manage dependencies as for a regular Python installation is not supported with this distribution, though with some care it may be possible to include and use pip for automatic updates. In general, third-party packages should be treated as part of the application ("vendoring") so that the developer can ensure compatibility with newer versions before providing updates to users.
pt_br: Pacotes de terceiros devem ser instalados pelo instalador da aplicação juntamente com a distribuição embutida. Usar o pip para gerenciar as dependências como em uma instalação regular do Python não é suportado nessa distribuição, apesar de que com algum cuidado pode ser possível incluir e usar o pip para atualizações automáticas. Em geral, pacotes de terceiros devem ser tratados como parte da aplicação ("vendoring") para que o desenvolvedor consiga garantir compatibilidade com versões mais recentes antes de fornecer atualizações para os usuários.

source: The two recommended use cases for this distribution are described below.
pt_br: Os dois casos de uso recomendados para essa distribuição são descritos abaixo.

source: Python application
pt_br: Aplicação Python

source: An application written in Python does not necessarily require users to be aware of that fact. The embedded distribution may be used in this case to include a private version of Python in an install package. Depending on how transparent it should be (or conversely, how professional it should appear), there are two options.
pt_br: Uma aplicação escrita em Python não requer necessariamente que os usuários estejam cientes deste fato. A distribuição embutida pode ser usada neste caso para incluir uma versão privada do pacote de instalação do Python. Dependendo de quão transparente deve ser (ou pelo contrário, quão profissional deve parecer), existem duas opções.

source: Using a specialized executable as a launcher requires some coding, but provides the most transparent experience for users. With a customized launcher, there are no obvious indications that the program is running on Python: icons can be customized, company and version information can be specified, and file associations behave properly. In most cases, a custom launcher should simply be able to call ``Py_Main`` with a hard-coded command line.
pt_br: Usar um executável especializado como inicializador requer um pouco de código, mas fornece a experiência mais transparente para os usuários. Com um inicializador personalizado, não existem indicações óbvias que o programa está rodando em Python: ícones podem ser personalizados, informações da empresa e versão podem ser especificadas, e associações de arquivo se comportam de forma apropriada. Na maioria dos casos, um inicializador personalizado deve simplesmente ser capaz de chamar ``Py_Main`` com uma linha de comando predefinida (hard-coded).

source: The simpler approach is to provide a batch file or generated shortcut that directly calls the ``python.exe`` or ``pythonw.exe`` with the required command-line arguments. In this case, the application will appear to be Python and not its actual name, and users may have trouble distinguishing it from other running Python processes or file associations.
pt_br: A abordagem mais simples é fornecer um arquivo batch ou um atalho gerado que chama diretamente o ``python.exe`` ou ``pythonw.exe`` com os argumentos de linha de comando necessários. Neste caso, a aplicação irá aparecer como Python e não seu nome real, e os usuários podem ter problemas em distinguir ela de outros processos ou associações de arquivo em Python.
