Repository: python/python-docs-pt-br
Catalog: using/windows.po
Languages: pt_br

source: To install pre-built binaries with free-threading enabled (see :pep:`703`), you should select "Customize installation". The second page of options includes the "Download free-threaded binaries" checkbox.
pt_br: Para instalar binários pré-construídos com recurso de threads livres habilitado (veja :pep:`703`), você deve selecionar "Customize installation" (Instalação personalizada). A segunda página de opções inclui a caixa de seleção "Download free-threaded binaries" (Baixar binários de threads livres).

source: Selecting this option will download and install additional binaries to the same location as the main Python install. The main executable is called ``python3.13t.exe``, and other binaries either receive a ``t`` suffix or a full ABI suffix. Python source files and bundled third-party dependencies are shared with the main install.
pt_br: Selecionar esta opção fará o download e instalará binários adicionais no mesmo local da instalação principal do Python. O executável principal é chamado ``python3.13t.exe``, e outros binários recebem um sufixo ``t`` ou um sufixo ABI completo. Arquivos de origem do Python e dependências de terceiros empacotadas são compartilhadas com a instalação principal.

source: The free-threaded version is registered as a regular Python install with the tag ``3.13t`` (with a ``-32`` or ``-arm64`` suffix as normal for those platforms). This allows tools to discover it, and for the :ref:`launcher` to support ``py.exe -3.13t``. Note that the launcher will interpret ``py.exe -3`` (or a ``python3`` shebang) as "the latest 3.x install", which will prefer the free-threaded binaries over the regular ones, while ``py.exe -3.13`` will not. If you use the short style of option, you may prefer to not install the free-threaded binaries at this time.
pt_br: A versão com threads livres é registrada como uma instalação regular do Python com a tag ``3.13t`` (com um sufixo ``-32`` ou ``-arm64`` como normal para essas plataformas). Isso permite que as ferramentas o descubram e que o :ref:`launcher` ofereça suporte a ``py.exe -3.13t``. Observe que o inicializador interpretará ``py.exe -3`` (ou um shebang ``python3``) como "a instalação 3.x mais recente", que preferirá os binários com threads livres aos normais, enquanto ``py.exe -3.13`` não. Se você usar o estilo curto da opção, talvez prefira não instalar os binários com threads livres neste momento.

source: To specify the install option at the command line, use ``Include_freethreaded=1``. See :ref:`install-layout-option` for instructions on pre-emptively downloading the additional binaries for offline install. The options to include debug symbols and binaries also apply to the free-threaded builds.
pt_br: Para especificar a opção de instalação na linha de comando, use ``Include_freethreaded=1``. Veja :ref:`install-layout-option` para instruções sobre como baixar preventivamente os binários adicionais para instalação offline. As opções para incluir símbolos de depuração e binários também se aplicam às construções com threads livres.

source: Free-threaded binaries are also available :ref:`on nuget.org <windows-nuget>`.
pt_br: Binários com threads livres também estão disponíveis :ref:`em nuget.org <windows-nuget>`.

source: Python launcher for Windows (deprecated)
pt_br: Inicializador Python para Windows (descontinuado)

source: The launcher and this documentation have been superseded by the Python Install Manager described above. This is preserved temporarily for historical interest.
pt_br: O inicializador e esta documentação foram substituídos pelo gerenciador de instalação do Python descrito acima. Este documento é mantido temporariamente por razões históricas.

source: The Python launcher for Windows is a utility which aids in locating and executing of different Python versions. It allows scripts (or the command-line) to indicate a preference for a specific Python version, and will locate and execute that version.
pt_br: O inicializador Python para Windows é um utilitário que auxilia na localização e execução de diferentes versões do Python. Ele permite que scripts (ou a linha de comando) indiquem uma preferência por uma versão do Python específica, e irá localizar e executar essa versão.

source: Unlike the :envvar:`PATH` variable, the launcher will correctly select the most appropriate version of Python. It will prefer per-user installations over system-wide ones, and orders by language version rather than using the most recently installed version.
pt_br: Ao contrário da variável :envvar:`PATH`, o inicializador irá corretamente selecionar a versão mais apropriada do Python. Ele irá preferir instalações por usuário ao invés de instalações globais no sistema, e ordenará por versão da linguagem ao invés de usar a versão instalada mais recentemente.

source: The launcher was originally specified in :pep:`397`.
pt_br: O inicializador foi originalmente especificado na :pep:`397`.

source: Getting started
pt_br: Começando

source: From the command-line
pt_br: Pela linha de comando

source: System-wide installations of Python 3.3 and later will put the launcher on your :envvar:`PATH`. The launcher is compatible with all available versions of Python, so it does not matter which version is installed. To check that the launcher is available, execute the following command in Command Prompt::
pt_br: Instalações globais no sistema do Python 3.3 ou posterior irão colocar o inicializador no seu :envvar:`PATH`. O inicializador é compatível com todas as versões disponíveis do Python, então não importa qual versão está instalada. Para verificar se o inicializador está disponível, execute o seguinte comando no Prompt de Comando::

source: You should find that the latest version of Python you have installed is started - it can be exited as normal, and any additional command-line arguments specified will be sent directly to Python.
pt_br: Você deve perceber que a última versão do Python que você tem é iniciada - ela pode ser fechada normalmente, e qualquer argumento da linha de comando adicional especificado será enviado diretamente para o Python.

source: If you have multiple versions of Python installed (e.g., 3.7 and |version|) you will have noticed that Python |version| was started - to launch Python 3.7, try the command::
pt_br: Se você tem múltiplas versões do Python instaladas (por exemplo, 3.7 e |version|) você deve ter notado que o Python |version| foi iniciado -- para iniciar o Python 3.7, use o comando::

source: If you want the latest version of Python 2 you have installed, try the command::
pt_br: Se você quer a versão mais recente do Python 2 que você tem instalada, tente o comando::

source: If you see the following error, you do not have the launcher installed::
pt_br: Se você ver o seguinte erro, você não tem o inicializador instalado::

source: The command::
pt_br: O comando::

source: displays the currently installed version(s) of Python.
pt_br: exibe a(s) versão(ões) atualmente instalada(s) do Python.

source: The ``-x.y`` argument is the short form of the ``-V:Company/Tag`` argument, which allows selecting a specific Python runtime, including those that may have come from somewhere other than python.org. Any runtime registered by following :pep:`514` will be discoverable. The ``--list`` command lists all available runtimes using the ``-V:`` format.
pt_br: O argumento ``-x.y`` é a forma abreviada do argumento ``-V:Empresa/Tag``, que permite selecionar um ambiente de execução Python específico, incluindo aqueles que podem ter vindo de algum lugar diferente de python.org. Qualquer ambiente de execução registrado seguindo a :pep:`514` será detectável. O comando ``--list`` lista todos os ambientes de execução disponíveis usando o formato ``-V:``.

source: When using the ``-V:`` argument, specifying the Company will limit selection to runtimes from that provider, while specifying only the Tag will select from all providers. Note that omitting the slash implies a tag::
pt_br: Ao usar o argumento ``-V:``, especificar a Empresa limitará a seleção aos ambientes de execução desse provedor, enquanto especificar apenas a Tag selecionará de todos os provedores. Observe que omitir a barra implica uma tag::

source: # Select any '3.*' tagged runtime py -V:3 # Select any 'PythonCore' released runtime py -V:PythonCore/ # Select PythonCore's latest Python 3 runtime py -V:PythonCore/3
pt_br: # Seleciona qualquer ambiente de execução sinalizado como '3.*' py -V:3 # Seleciona qualquer ambiente de execução lançado como 'PythonCore' py -V:PythonCore/ # Seleciona o ambiente de execução Python 3 mais recente de PythonCore py -V:PythonCore/3

source: The short form of the argument (``-3``) only ever selects from core Python releases, and not other distributions. However, the longer form (``-V:3``) will select from any.
pt_br: A forma abreviada do argumento (``-3``) só seleciona a partir de versões principais do Python, e não de outras distribuições. No entanto, a forma mais longa (``-V:3``) selecionará qualquer um.

source: The Company is matched on the full string, case-insensitive. The Tag is matched on either the full string, or a prefix, provided the next character is a dot or a hyphen. This allows ``-V:3.1`` to match ``3.1-32``, but not ``3.10``. Tags are sorted using numerical ordering (``3.10`` is newer than ``3.1``), but are compared using text (``-V:3.01`` does not match ``3.1``).
pt_br: A Empresa é correspondida na string completa, sem distinção entre maiúsculas e minúsculas. A Tag corresponde a uma string completa ou a um prefixo, desde que o próximo caractere seja um ponto ou um hífen. Isso permite que ``-V:3.1`` corresponda a ``3.1-32``, mas não a ``3.10``. As tags são classificadas usando ordenação numérica (``3.10`` é mais recente que ``3.1``), mas são comparadas usando texto (``-V:3.01`` não corresponde a ``3.1``).

source: Virtual environments
pt_br: Ambientes virtuais

source: If the launcher is run with no explicit Python version specification, and a virtual environment (created with the standard library :mod:`venv` module or the external ``virtualenv`` tool) active, the launcher will run the virtual environment's interpreter rather than the global one. To run the global interpreter, either deactivate the virtual environment, or explicitly specify the global Python version.
pt_br: Se o inicializador é executado sem versão explícita do Python especificada, e um ambiente virtual (criado com o módulo da biblioteca padrão :mod:`venv` ou da ferramenta externa ``virtualenv``) está ativo, o inicializador irá executar o interpretador do ambiente virtual ao invés do global. Para executar o interpretador global, ou desative o ambiente virtual, ou explicitamente especifique a versão global do Python.

source: From a script
pt_br: Por um script

source: Let's create a test Python script - create a file called ``hello.py`` with the following contents
pt_br: Vamos criar um script teste de Python - crie um arquivo chamado ``hello.py`` com os seguintes conteúdos:

source: #! python import sys sys.stdout.write("hello from Python %s\n" % (sys.version,))
pt_br: #! python import sys sys.stdout.write("olá do Python %s\n" % (sys.version,))

source: From the directory in which hello.py lives, execute the command::
pt_br: A partir do diretório onde hello.py está, execute o comando::

source: You should notice the version number of your latest Python 2.x installation is printed. Now try changing the first line to be:
pt_br: Você deve notar que o número da versão da sua instalação mais recente do Python 2.x é exibido. Agora tente mudar a primeira linha para ser:

source: Re-executing the command should now print the latest Python 3.x information. As with the above command-line examples, you can specify a more explicit version qualifier. Assuming you have Python 3.7 installed, try changing the first line to ``#! python3.7`` and you should find the 3.7 version information printed.
pt_br: Re-executar o comando agora deve exibir informações da última versão do Python 3.x. Como nos exemplos da linha de comando acima, você pode especificar um qualificador de versão mais explícito. Presumindo que você tem o Python 3.7 instalado, tente mudar a primeira linha para ``#! python3.7`` e você deve ver as informações da versão 3.7 sendo exibidas.

source: Note that unlike interactive use, a bare "python" will use the latest version of Python 2.x that you have installed. This is for backward compatibility and for compatibility with Unix, where the command ``python`` typically refers to Python 2.
pt_br: Note que diferentemente do uso interativo, um simples "python" irá usar a última versão do Python 2.x que você tem instalada. Isso é para retrocompatibilidade e para compatibilidade com Unix, onde o comando ``python`` tipicamente se refere ao Python 2.

source: From file associations
pt_br: Por associação de arquivos

source: The launcher should have been associated with Python files (i.e. ``.py``, ``.pyw``, ``.pyc`` files) when it was installed. This means that when you double-click on one of these files from Windows explorer the launcher will be used, and therefore you can use the same facilities described above to have the script specify the version which should be used.
pt_br: O inicializador deve ter sido associado com arquivos Python (isto é, arquivos ``.py``, ``.pyw``, ``.pyc``) quando foi instalado. Isso significa que quando você clica duas vezes em um desses arquivos a partir do Explorador de Arquivos do Windows o inicializador será usado, e assim você pode usar as mesmas facilidades descritas acima para que o script especifique qual versão deve ser usada.

source: The key benefit of this is that a single launcher can support multiple Python versions at the same time depending on the contents of the first line.
pt_br: O benefício chave disso é que um único inicializador pode suportar múltiplas versões do Python ao mesmo tempo dependendo dos conteúdos da primeira linha.

source: If the first line of a script file starts with ``#!``, it is known as a "shebang" line. Linux and other Unix like operating systems have native support for such lines and they are commonly used on such systems to indicate how a script should be executed. This launcher allows the same facilities to be used with Python scripts on Windows and the examples above demonstrate their use.
pt_br: Se a primeira linha de um arquivo de script começa com ``#!``, ela é conhecida como linha "shebang". Linux e outros tipos de sistemas operacionais Unix têm suporte nativo para essas linhas e elas são comumente usadas nesses sistemas para indicar como um script deve ser executado. Esse inicializador permite que as mesmas facilidades sejam usadas com scripts Python no Windows e os exemplos acima demonstram seu uso.

source: To allow shebang lines in Python scripts to be portable between Unix and Windows, this launcher supports a number of 'virtual' commands to specify which interpreter to use. The supported virtual commands are:
pt_br: Para permitir que linhas shebang em scripts Python sejam portáveis entre Unix e Windows, este inicializador suporta um número de comandos 'virtuais' para especificar qual interpretador deve ser usado. Os comandos virtuais suportados são:

source: Any of the above virtual commands can be suffixed with an explicit version (either just the major version, or the major and minor version). Furthermore the 32-bit version can be requested by adding "-32" after the minor version. I.e. ``/usr/bin/python3.7-32`` will request usage of the 32-bit Python 3.7. If a virtual environment is active, the version will be ignored and the environment will be used.
pt_br: Qualquer um dos comandos virtuais acima pode ser sufixado com uma versão explícita (ou apenas a maior versão, ou a maior e a menor versão). Além disso, a versão de 32 bits pode ser solicitada adicionando "-32" após a menor versão. Isto é, ``/usr/bin/python3.7-32`` irá solicitar o uso do python 3.7 32-bit. Se um ambiente virtual estiver ativo, a versão será ignorada e o ambiente será usado.

source: Beginning with python launcher 3.7 it is possible to request 64-bit version by the "-64" suffix. Furthermore it is possible to specify a major and architecture without minor (i.e. ``/usr/bin/python3-64``).
pt_br: A partir do inicializador do python 3.7 é possível solicitar a versão 64-bit adicionando o sufixo "-64". Além disso é possível especificar uma versão maior e arquitetura sem a menor (isto é, ``/usr/bin/python3-64``).

source: The "-64" suffix is deprecated, and now implies "any architecture that is not provably i386/32-bit". To request a specific environment, use the new :samp:`-V:{TAG}` argument with the complete tag.
pt_br: O sufixo "-64" foi descontinuado e agora implica "qualquer arquitetura que não seja comprovadamente i386/32 bits". Para solicitar um ambiente específico, use o novo argumento :samp:`-V:{TAG}` com a tag completa.

source: Virtual commands referencing ``python`` now prefer an active virtual environment rather than searching :envvar:`PATH`. This handles cases where the shebang specifies ``/usr/bin/env python3`` but :file:`python3.exe` is not present in the active environment.
pt_br: Comandos virtuais que referenciam ``python`` agora preferem um ambiente virtual ativo em vez de pesquisar :envvar:`PATH`. Isso lida com casos em que o shebang especifica ``/usr/bin/env python3``, mas :file:`python3.exe` não está presente no ambiente ativo.

source: The ``/usr/bin/env`` form of shebang line has one further special property. Before looking for installed Python interpreters, this form will search the executable :envvar:`PATH` for a Python executable matching the name provided as the first argument. This corresponds to the behaviour of the Unix ``env`` program, which performs a :envvar:`PATH` search. If an executable matching the first argument after the ``env`` command cannot be found, but the argument starts with ``python``, it will be handled as described for the other virtual commands. The environment variable :envvar:`!PYLAUNCHER_NO_SEARCH_PATH` may be set (to any value) to skip this search of :envvar:`PATH`.
pt_br: A forma ``/usr/bin/env`` da linha shebang tem mais uma propriedade especial. Antes de procurar por interpretadores Python instalados, este formulário pesquisará o executável :envvar:`PATH` por um executável Python correspondente ao nome fornecido como o primeiro argumento. Isso corresponde ao comportamento do programa Unix ``env``, que executa uma pesquisa :envvar:`PATH`. Se um executável correspondente ao primeiro argumento após o comando ``env`` não puder ser encontrado, mas o argumento começar com ``python``, ele será tratado conforme descrito para os outros comandos virtuais. A variável de ambiente :envvar:`!PYLAUNCHER_NO_SEARCH_PATH` pode ser definida (para qualquer valor) para ignorar esta pesquisa de :envvar:`PATH`.

source: Shebang lines that do not match any of these patterns are looked up in the ``[commands]`` section of the launcher's :ref:`.INI file <launcher-ini>`. This may be used to handle certain commands in a way that makes sense for your system. The name of the command must be a single argument (no spaces in the shebang executable), and the value substituted is the full path to the executable (additional arguments specified in the .INI will be quoted as part of the filename).
pt_br: As linhas Shebang que não correspondem a nenhum desses padrões são procuradas na seção ``[commands]`` do arquivo :ref:`.INI <launcher-ini>` do lançador. Isso pode ser usado para lidar com certos comandos de uma maneira que faça sentido para o seu sistema. O nome do comando deve ser um único argumento (sem espaços no executável shebang) e o valor substituído é o caminho completo para o executável (argumentos adicionais especificados no .INI serão citados como parte do nome do arquivo).

source: Any commands not found in the .INI file are treated as **Windows** executable paths that are absolute or relative to the directory containing the script file. This is a convenience for Windows-only scripts, such as those generated by an installer, since the behavior is not compatible with Unix-style shells. These paths may be quoted, and may include multiple arguments, after which the path to the script and any additional arguments will be appended.
pt_br: Quaisquer comandos não encontrados no arquivo .INI são tratados como caminhos executáveis do **Windows** que são absolutos ou relativos ao diretório que contém o arquivo de script. Isso é uma conveniência para scripts somente do Windows, como aqueles gerados por um instalador, pois o comportamento não é compatível com shells de estilo Unix. Esses caminhos podem ser citados e podem incluir vários argumentos, após os quais o caminho para o script e quaisquer argumentos adicionais serão anexados.

source: Arguments in shebang lines
pt_br: Argumentos em linhas shebang

source: The shebang lines can also specify additional options to be passed to the Python interpreter. For example, if you have a shebang line:
pt_br: As linhas shebang também podem especificar opções adicionais a serem passadas ao interpretador Python. Por exemplo, se você tem uma linha shebang:

source: Then Python will be started with the ``-v`` option
pt_br: O Python será iniciado com a opção ``-v``

source: Customization
pt_br: Personalização

source: Customization via INI files
pt_br: Personalização via arquivos INI

source: Two .ini files will be searched by the launcher - ``py.ini`` in the current user's application data directory (``%LOCALAPPDATA%`` or ``$env:LocalAppData``) and ``py.ini`` in the same directory as the launcher. The same .ini files are used for both the 'console' version of the launcher (i.e. py.exe) and for the 'windows' version (i.e. pyw.exe).
pt_br: Dois arquivos .ini serão pesquisados pelo inicializador - ``py.ini`` no diretório de dados de aplicações do usuário atual (``%LOCALAPPDATA%`` ou ``$env:LocalAppData``) e ``py.ini`` no mesmo diretório que o inicializador. Os mesmos arquivos .ini são usados para ambas a versão 'console' do inicializador (isto é, py.exe) e a versão 'windows' (isto é, pyw.exe).

source: Customization specified in the "application directory" will have precedence over the one next to the executable, so a user, who may not have write access to the .ini file next to the launcher, can override commands in that global .ini file.
pt_br: Personalização especificada no "diretório da aplicação" terão precedência sobre àquela especificada junto do executável, portanto um usuário, que pode não ter acesso de escrita ao arquivo .ini junto do inicializador, pode sobrescrever comandos naquele arquivo .ini global.

source: Customizing default Python versions
pt_br: Personalizando versões padrão do Python

source: In some cases, a version qualifier can be included in a command to dictate which version of Python will be used by the command. A version qualifier starts with a major version number and can optionally be followed by a period ('.') and a minor version specifier. Furthermore it is possible to specify if a 32 or 64 bit implementation shall be requested by adding "-32" or "-64".
pt_br: Em alguns casos, um qualificador de versão pode ser incluído em um comando para ditar qual versão do Python deve ser usada pelo comando. Um qualificador de versão começa com um número maior de versão e pode opcionalmente ser seguido por um ponto ('.') e uma especificação de versão menor. Além disso, é possível especificar se uma implementação de 32 ou 64 bit deve ser solicitada adicionando "-32" ou "-64".

source: For example, a shebang line of ``#!python`` has no version qualifier, while ``#!python3`` has a version qualifier which specifies only a major version.
pt_br: Por exemplo, uma linha shebang ``#!python`` não tem qualificador de versão, enquanto ``#!python3`` tem um qualificador de versão que especifica apenas uma versão maior.
