Repository: python/python-docs-pt-br
Catalog: using/windows.po
Languages: pt_br

source: Passing ``--force`` will ignore any cached files and remove any existing install to replace it with the specified one.
pt_br: Passar ``--force`` ignorará quaisquer arquivos em cache e removerá qualquer instalação existente para substituí-la pela especificada.

source: Passing ``--update`` will replace existing installs if the new version is newer. Otherwise, they will be left. If no tags are provided with ``--update``, all installs managed by the Python install manager will be updated if newer versions are available. Updates will remove any modifications made to the install, including globally installed packages, but virtual environments will continue to work.
pt_br: Passar ``--update`` substituirá as instalações existentes se a nova versão for mais recente. Caso contrário, elas serão mantidas. Se nenhuma tag for fornecida com ``--update``, todas as instalações gerenciadas pelo gerenciador de instalação do Python serão atualizadas se versões mais recentes estiverem disponíveis. As atualizações removerão quaisquer modificações feitas na instalação, incluindo pacotes instalados globalmente, mas os ambientes virtuais continuarão funcionando.

source: Passing ``--dry-run`` will generate output and logs, but will not modify any installs.
pt_br: Passar ``--dry-run`` gerará saída e logs, mas não modificará nenhuma instalação.

source: In addition to the above options, the ``--target`` option will extract the runtime to the specified directory instead of doing a normal install. This is useful for embedding runtimes into larger applications.
pt_br: Além das opções acima, a opção ``--target`` extrairá o ambiente de execução para o diretório especificado em vez de realizar uma instalação normal. Isso é útil para incorporar ambientes de aplicação em aplicações maiores.

source: Offline installs
pt_br: Instalações offline

source: To perform offline installs of Python, you will need to first create an offline index on a machine that has network access.
pt_br: Para executar instalações offline do Python, você precisará primeiro criar um índice offline em uma máquina que tenha acesso à rede.

source: The ``--download=<PATH>`` option will download the packages for the listed tags and create a directory containing them and an ``index.json`` file suitable for later installation. This entire directory can be moved to the offline machine and used to install one or more of the bundled runtimes:
pt_br: A opção ``--download=<PATH>`` baixará os pacotes para as tags listadas e criará um diretório contendo-os e um arquivo ``index.json`` adequado para instalação posterior. Todo esse diretório pode ser movido para a máquina offline e usado para instalar um ou mais dos ambientes de execução incluídos:

source: The Python install manager can be installed by downloading its installer and moving it to another machine before installing.
pt_br: O gerenciador de instalação do Python pode ser instalado baixando seu instalador e movendo-o para outra máquina antes da instalação.

source: Alternatively, the ZIP files in an offline index directory can simply be transferred to another machine and extracted. This will not register the install in any way, and so it must be launched by directly referencing the executables in the extracted directory, but it is sometimes a preferable approach in cases where installing the Python install manager is not possible or convenient.
pt_br: Como alternativa, os arquivos ZIP em um diretório de índice offline podem ser simplesmente transferidos para outra máquina e extraídos. Isso não registrará a instalação de forma alguma e, portanto, ela deve ser iniciada referenciando diretamente os executáveis no diretório extraído, mas às vezes é uma abordagem preferível em casos em que a instalação do gerenciador de instalação do Python não é possível ou conveniente.

source: In this way, Python runtimes can be installed and managed on a machine without access to the internet.
pt_br: Dessa forma, os ambientes de execução do Python podem ser instalados e gerenciados em uma máquina sem acesso à internet.

source: Uninstalling runtimes
pt_br: Desinstalando ambientes de execução

source: Runtimes may be removed using the ``py uninstall`` command. One or more tags must be specified. Ranges are not supported here.
pt_br: Ambientes de execução pode ser removidos com o uso do comando ``py uninstall``. Uma ou mais tags devem ser especificadas. Não há suporte para intervalos aqui.

source: The ``--yes`` option bypasses the confirmation prompt before uninstalling.
pt_br: A opção ``--yes`` ignora o prompt de confirmação antes da desinstalação.

source: Instead of passing tags individually, the ``--purge`` option may be specified. This will remove all runtimes managed by the Python install manager, including cleaning up the Start menu, registry, and any download caches. Runtimes that were not installed by the Python install manager will not be impacted, and neither will manually created configuration files.
pt_br: Em vez de passar as tags individualmente, a opção ``--purge`` pode ser especificada. Isso removerá todos os ambientes de execução gerenciados pelo gerenciador de instalação do Python, incluindo a limpeza do menu Iniciar, do registro e de quaisquer caches de download. Ambientes de execução que não foram instalados pelo gerenciador de instalação do Python não serão afetados, nem os arquivos de configuração criados manualmente.

source: The Python install manager can be uninstalled through the Windows "Installed apps" settings page. This does not remove any runtimes, and they will still be usable, though the global ``python`` and ``py`` commands will be removed. Reinstalling the Python install manager will allow you to manage these runtimes again. To completely clean up all Python runtimes, run with ``--purge`` before uninstalling the Python install manager.
pt_br: O gerenciador de instalação do Python pode ser desinstalado por meio da página de configurações "Aplicativos instalados" do Windows. Isso não remove nenhum ambiente de execução, e eles ainda poderão ser usados, embora o ``python`` global e o comando ``py`` sejam removidos. A reinstalação do gerenciador de instalação do Python permitirá que você gerencie esses ambientes de execução novamente. Para limpar completamente todos os ambientes de execução do Python, execute o ``--purge`` antes de desinstalar o gerenciador de instalação do Python.

source: Configuration
pt_br: Configuração

source: Python install manager is configured with a hierarchy of configuration files, environment variables, command-line options, and registry settings. In general, configuration files have the ability to configure everything, including the location of other configuration files, while registry settings are administrator-only and will override configuration files. Command-line options override all other settings, but not every option is available.
pt_br: O gerenciador de instalação do Python é configurado com uma hierarquia de arquivos de configuração, variáveis de ambiente, opções de linha de comando e configurações de registro. Em geral, os arquivos de configuração têm a capacidade de configurar tudo, incluindo a localização de outros arquivos de configuração, enquanto as configurações de registro são exclusivas do administrador e substituem os arquivos de configuração. As opções de linha de comando substituem todas as outras configurações, mas nem todas as opções estão disponíveis.

source: This section will describe the defaults, but be aware that modified or overridden installs may resolve settings differently.
pt_br: Esta seção descreverá os padrões, mas esteja ciente de que instalações modificadas ou substituídas podem resolver as configurações de maneira diferente.

source: A global configuration file may be configured by an administrator, and would be read first. The user configuration file is stored at :file:`%AppData%\\Python\\pymanager.json` (by default) and is read next, overwriting any settings from earlier files. An additional configuration file may be specified as the ``PYTHON_MANAGER_CONFIG`` environment variable or the ``--config`` command line option (but not both).
pt_br: Um arquivo de configuração global pode ser configurado por um administrador e seria lido primeiro. O arquivo de configuração do usuário é armazenado em :file:`%AppData%\\Python\\pymanager.json` (por padrão) e é lido em seguida, substituindo quaisquer configurações de arquivos anteriores. Um arquivo de configuração adicional pode ser especificado como a variável de ambiente ``PYTHON_MANAGER_CONFIG`` ou a opção de linha de comando ``--config`` (mas não ambos).

source: The following settings are those that are considered likely to be modified in normal use. Later sections list those that are intended for administrative customization.
pt_br: As configurações a seguir são aquelas que provavelmente serão modificadas em uso normal. As seções posteriores listam aquelas destinadas à personalização administrativa.

source: Standard configuration options
pt_br: Opções de configuração padrão

source: Config Key
pt_br: Chave de configuração

source: Environment Variable
pt_br: Variável de ambiente

source: Description
pt_br: Descrição

source: The preferred default version to launch or install. By default, this is interpreted as the most recent non-prerelease version from the CPython team.
pt_br: A versão padrão preferida para iniciar ou instalar. Por padrão, esta é interpretada como a versão mais recente, não pré-lançada, da equipe do CPython.

source: The preferred default platform to launch or install. This is treated as a suffix to the specified tag, such that ``py -V:3.14`` would prefer an install for ``3.14-64`` if it exists (and ``default_platform`` is ``-64``), but will use ``3.14`` if no tagged install exists.
pt_br: A plataforma padrão preferida para iniciar ou instalar. Isso é tratado como um sufixo para a tag especificada, de modo que ``py -V:3.14`` prefere uma instalação para ``3.14-64`` se existir (e ``default_platform`` for ``-64``), mas usará ``3.14`` se não houver nenhuma instalação marcada.

source: The location where log files are written. By default, :file:`%TEMP%`.
pt_br: O local onde os arquivos de log são gravados. Por padrão, :file:`%TEMP%`.

source: True to allow automatic installs when specifying a particular runtime to launch. By default, true.
pt_br: Verdadeiro para permitir instalações automáticas ao especificar um ambiente de execução específico para iniciar. Por padrão, verdadeiro.

source: True to allow listing and launching runtimes that were not installed by the Python install manager, or false to exclude them. By default, true.
pt_br: Verdadeiro para permitir a listagem e a execução de ambientes que não foram instalados pelo gerenciador de instalação do Python, ou falso para excluí-los. Por padrão, verdadeiro.

source: True to allow shebangs in ``.py`` files to launch applications other than Python runtimes, or false to prevent it. By default, true.
pt_br: Verdadeiro para permitir que shebangs em arquivos ``.py`` iniciem aplicação que não sejam ambientes de execução do Python, ou falso para evitar isso. Por padrão, verdadeiro.

source: Set the default level of output (0-50). By default, 20. Lower values produce more output. The environment variables are boolean, and may produce additional output during startup that is later suppressed by other configuration.
pt_br: Define o nível padrão de saída (0-50). O padrão é 20. Valores mais baixos produzem mais saída. As variáveis de ambiente são booleanas e podem produzir saída adicional durante a inicialização, que é posteriormente suprimida por outra configuração.

source: True to confirm certain actions before taking them (such as uninstall), or false to skip the confirmation. By default, true.
pt_br: ``True`` para confirmar certas ações antes de executá-las (como desinstalar) ou ``False`` para ignorar a confirmação. Por padrão, ``True``.

source: Override the index feed to obtain new installs from.
pt_br: Substitui o feed de índice para obter novas instalações.

source: Specify the default format used by the ``py list`` command. By default, ``table``.
pt_br: Especifica o formato padrão usado pelo comando ``py list``. Por padrão, ``table``.

source: (none)
pt_br: (nenhuma)

source: Specify the root directory that runtimes will be installed into. If you change this setting, previously installed runtimes will not be usable unless you move them to the new location.
pt_br: Especifica o diretório raiz onde os ambientes de execução serão instalados. Se você alterar essa configuração, os ambientes de execução instalados anteriormente não poderão ser usados, a menos que você os mova para o novo local.

source: Specify the directory where global commands (such as ``python3.14.exe``) are stored. This directory should be added to your :envvar:`PATH` to make the commands available from your terminal.
pt_br: Especifica o diretório onde os comandos globais (como ``python3.14.exe``) estão armazenados. Este diretório deve ser adicionado à sua variável de ambiente :envvar:`PATH` para que os comandos estejam disponíveis no seu terminal.

source: Specify the directory where downloaded files are stored. This directory is a temporary cache, and can be cleaned up from time to time.
pt_br: Especifica o diretório onde os arquivos baixados serão armazenados. Este diretório é um cache temporário e pode ser limpo periodicamente.

source: Dotted names should be nested inside JSON objects, for example, ``list.format`` would be specified as ``{"list": {"format": "table"}}``.
pt_br: Nomes pontilhados devem ser aninhados dentro de objetos JSON, por exemplo, ``list.format`` seria especificado como ``{"list": {"format": "table"}}``.

source: Shebang lines
pt_br: Linhas shebang

source: If the first line of a script file starts with ``#!``, it is known as a "shebang" line. Linux and other Unix like operating systems have native support for such lines and they are commonly used on such systems to indicate how a script should be executed. The ``python`` and ``py`` commands allow the same facilities to be used with Python scripts on Windows.
pt_br: Se a primeira linha de um arquivo de script começar com ``#!``, ela é conhecida como uma linha "shebang". Linux e outros sistemas operacionais semelhantes ao Unix têm suporte nativo para essas linhas, que são comumente usadas nesses sistemas para indicar como um script deve ser executado. Os comandos ``python`` e ``py`` permitem que os mesmos recursos sejam usados com scripts Python no Windows.

source: To allow shebang lines in Python scripts to be portable between Unix and Windows, a number of 'virtual' commands are supported to specify which interpreter to use. The supported virtual commands are:
pt_br: Para permitir que as linhas shebang em scripts Python sejam portáveis entre Unix e Windows, vários comandos "virtuais" são suportados para especificar qual interpretador usar. Os comandos virtuais suportados são:

source: For example, if the first line of your script starts with
pt_br: Por exemplo, se a primeira linha do seu script começa com

source: The default Python or an active virtual environment will be located and used. As many Python scripts written to work on Unix will already have this line, you should find these scripts can be used by the launcher without modification. If you are writing a new script on Windows which you hope will be useful on Unix, you should use one of the shebang lines starting with ``/usr``.
pt_br: O Python padrão ou um ambiente virtual ativo será localizado e utilizado. Como muitos scripts Python escritos para funcionar no Unix já terão essa linha, você deve perceber que esses scripts podem ser usados pelo inicializador sem modificação. Se você está escrevendo um novo script no Windows que você espera que seja útil no Unix, você deve usar uma dessas linhas shebang começando com ``/usr``.

source: Any of the above virtual commands can have ``<ALIAS>`` replaced by an alias from an installed runtime. That is, any command generated in the global aliases directory (which you may have added to your :envvar:`PATH` environment variable) can be used in a shebang, even if it is not on your :envvar:`PATH`. This allows the use of shebangs like ``/usr/bin/python3.12`` to select a particular runtime.
pt_br: Qualquer um dos comandos virtuais acima pode ter o ``<ALIAS>`` substituído por um apelido de um ambiente de execução instalado. Ou seja, qualquer comando gerado no diretório global de apelidos (que você pode ter adicionado à sua variável de ambiente :envvar:`PATH`) pode ser usado em uma shebang, mesmo que não esteja no seu :envvar:`PATH`. Isso permite o uso de shebangs como ``/usr/bin/python3.12`` para selecionar um determinado ambiente de execução.

source: If no runtimes are installed, or if automatic installation is enabled, the requested runtime will be installed if necessary. See :ref:`pymanager-config` for information about configuration settings.
pt_br: Se nenhum ambiente de execução estiver instalado ou se a instalação automática estiver ativada, o ambiente de execução solicitado será instalado, se necessário. Consulte :ref:`pymanager-config` para obter informações sobre as definições de configuração.

source: The ``/usr/bin/env`` form of shebang line will also search the :envvar:`PATH` environment variable for unrecognized commands. This corresponds to the behaviour of the Unix ``env`` program, which performs the same search, but prefers launching known Python commands. A warning may be displayed when searching for arbitrary executables, and this search may be disabled by the ``shebang_can_run_anything`` configuration option.
pt_br: A forma ``/usr/bin/env`` da linha shebang também pesquisará a variável de ambiente :envvar:`PATH` em busca de comandos não reconhecidos. Isso corresponde ao comportamento do programa ``env`` do Unix, que realiza a mesma busca, mas prefere executar comandos Python conhecidos. Um aviso pode ser exibido ao pesquisar executáveis arbitrários, e essa busca pode ser desabilitada pela opção de configuração ``shebang_can_run_anything``.

source: Shebang lines that do not match any of patterns are treated as *Windows* executable paths that are absolute or relative to the directory containing the script file. This is a convenience for Windows-only scripts, such as those generated by an installer, since the behavior is not compatible with Unix-style shells. These paths may be quoted, and may include multiple arguments, after which the path to the script and any additional arguments will be appended. This functionality may be disabled by the ``shebang_can_run_anything`` configuration option.
pt_br: As linhas Shebang que não correspondem a nenhum dos padrões são tratadas como caminhos executáveis do *Windows* que são absolutos ou relativos ao diretório que contém o arquivo de script Isso é uma conveniência para scripts exclusivos do Windows, como aqueles gerados por um instalador, pois o comportamento não é compatível com shells de estilo Unix. Esses caminhos podem ser citados e podem incluir vários argumentos, após os quais o caminho para o script e quaisquer argumentos adicionais serão anexados.

source: Advanced installation
pt_br: Instalação avançada

source: For situations where an MSIX cannot be installed, such as some older administrative distribution platforms, there is an MSI available from the python.org downloads page. This MSI has no user interface, and can only perform per-machine installs to its default location in Program Files. It will attempt to modify the system :envvar:`PATH` environment variable to include this install location, but be sure to validate this on your configuration.
pt_br: Para situações em que um MSIX não pode ser instalado, como em algumas plataformas de distribuição administrativa mais antigas, há um MSI disponível na página de downloads do python.org. Este MSI não possui interface de usuário e só pode executar instalações por máquina em seu local padrão em Arquivos de Programas. Ele tentará modificar a variável de ambiente do sistema :envvar:`PATH` para incluir este local de instalação, mas certifique-se de validar isso em sua configuração.

source: Windows Server 2019 is the only version of Windows that CPython supports that does not support MSIX. For Windows Server 2019, you should use the MSI.
pt_br: O Windows Server 2019 é a única versão do Windows compatível com o CPython que não oferece suporte a MSIX. Para o Windows Server 2019, você deve usar o MSI.

source: Be aware that the MSI package does not bundle any runtimes, and so is not suitable for installs into offline environments without also creating an offline install index. See :ref:`pymanager-offline` and :ref:`pymanager-admin-config` for information on handling these scenarios.
pt_br: Esteja ciente que o pacote MSI não inclui nenhum ambiente de execução e, portanto, não é adequado para instalações em ambientes off-line sem criar também um indíce para instalação off-line. Consulte :ref:`pymanager-offline` e :ref:`pymanager-admin-config` para obter informações sobre como lidar com esses cenários.

source: Runtimes installed by the MSI are shared with those installed by the MSIX, and are all per-user only. The Python install manager does not support installing runtimes per-machine. To emulate a per-machine install, you can use ``py install --target=<shared location>`` as administrator and add your own system-wide modifications to :envvar:`PATH`, the registry, or the Start menu.
pt_br: Ambientes de execução instalados pelo MSI são compartilhados com os instalados pelo MSIX e são todos apenas por usuário. O gerenciador de instalação do Python não permite a instalação de ambientes de execução por máquina. Para emular uma instalação por máquina, você pode usar o ``py install --target=<shared location>`` como administrador e adicionar suas próprias modificações em todo o sistema ao :envvar:`PATH`, ao registro ou ao menu Iniciar.

source: When the MSIX is installed, but commands are not available in the :envvar:`PATH` environment variable, they can be found under :file:`%LocalAppData%\\Microsoft\\WindowsApps\\PythonSoftwareFoundation.PythonManager_3847v3x7pw1km` or :file:`%LocalAppData%\\Microsoft\\WindowsApps\\PythonSoftwareFoundation.PythonManager_qbz5n2kfra8p0`, depending on whether it was installed from python.org or through the Windows Store. Attempting to run the executable directly from Program Files is not recommended.
pt_br: Quando o MSIX é instalado, mas os comandos não estão disponíveis na variável de ambiente :envvar:`PATH`, eles podem ser encontrados em :file:`%LocalAppData%\\Microsoft\\WindowsApps\\PythonSoftwareFoundation.PythonManager_3847v3x7pw1km` ou :file:`%LocalAppData%\\Microsoft\\WindowsApps\\PythonSoftwareFoundation.PythonManager_qbz5n2kfra8p0`, dependendo se foi instalado a partir do python.org ou da Windows Store. Não é recomendável tentar executar o executável diretamente dos Arquivos de Programas.

source: To programmatically install the Python install manager, it is easiest to use WinGet, which is included with all supported versions of Windows:
pt_br: Para instalar programaticamente o gerenciador de instalação do Python, é mais fácil usar o WinGet, que está incluído em todas as versões suportadas do Windows:

source: $> winget install 9NQ7512CXL7T -e --accept-package-agreements --disable-interactivity # Optionally run the configuration checker and accept all changes $> py install --configure -y
pt_br: $> winget install 9NQ7512CXL7T -e --accept-package-agreements --disable-interactivity # Opcionalmente execute o verificador de configuraçao e aceite todas as alterações $> py install --configure -y
