Repository: python/python-docs-pt-br
Catalog: using/windows.po
Languages: pt_br

source: With the latter approach, packages should be installed as directories alongside the Python executable to ensure they are available on the path. With the specialized launcher, packages can be located in other locations as there is an opportunity to specify the search path before launching the application.
pt_br: Com a abordagem anterior, pacotes devem ser instalados como diretórios juntamente do executável do Python para garantir que estarão disponíveis no caminho do ambiente. Com o instalador especializado, pacotes podem ser armazenados em outras localidades já que há uma oportunidade de especificar o caminho de busca antes de executar a aplicação.

source: Embedding Python
pt_br: Incorporando Python

source: Applications written in native code often require some form of scripting language, and the embedded Python distribution can be used for this purpose. In general, the majority of the application is in native code, and some part will either invoke ``python.exe`` or directly use ``python3.dll``. For either case, extracting the embedded distribution to a subdirectory of the application installation is sufficient to provide a loadable Python interpreter.
pt_br: Aplicações escritas em código nativo frequentemente precisam de alguma forma de linguagem de script, e a distribuição embutida do Python pode ser usada para esse propósito. Em geral, a maior parte da aplicação é em código nativo, e uma parte irá ou invocar ``python.exe`` ou usar diretamente ``python3.dll``. Para ambos os casos, extrair a distribuição embutida em um subdiretório da instalação da aplicação é suficiente para providenciar um interpretador Python carregável.

source: As with the application use, packages can be installed to any location as there is an opportunity to specify search paths before initializing the interpreter. Otherwise, there is no fundamental differences between using the embedded distribution and a regular installation.
pt_br: Para uso da aplicação, pacotes podem ser instalados em qualquer local já que há uma oportunidade de especificar caminhos de busca antes de inicializar o interpretador. De outra forma, não existem diferenças fundamentais entre usar a distribuição embutida ou a instalação regular.

source: The nuget.org packages
pt_br: Os pacotes nuget.org

source: The nuget.org package is a reduced size Python environment intended for use on continuous integration and build systems that do not have a system-wide install of Python. While nuget is "the package manager for .NET", it also works perfectly fine for packages containing build-time tools.
pt_br: O pacote nuget.org é um ambiente Python de tamanho reduzido criado para uso em integração contínua e construção de sistemas que não precisam de uma instalação de Python por todo o sistema da máquina. Enquanto nuget é o "gerenciador de pacotes para .NET", ele também funciona perfeitamente bem para pacotes contendo ferramentas em tempo de construção.

source: Visit `nuget.org <https://www.nuget.org/>`_ for the most up-to-date information on using nuget. What follows is a summary that is sufficient for Python developers.
pt_br: Visite `nuget.org <https://www.nuget.org/>`_ para informações mais atualizadas sobre utilização do nuget. A seguir está um sumário que é suficiente para desenvolvedores Python.

source: The ``nuget.exe`` command line tool may be downloaded directly from ``https://aka.ms/nugetclidl``, for example, using curl or PowerShell. With the tool, the latest version of Python for 64-bit or 32-bit machines is installed using::
pt_br: A ferramenta de linha de comando ``nuget.exe`` pode ser baixada diretamente de ``https://aka.ms/nugetclidl``, por exemplo, usando o curl ou PowerShell. Com a ferramenta, a versão mais recente do Python para máquinas 64-bit ou 32-bit é instalada usando::

source: To select a particular version, add a ``-Version 3.x.y``. The output directory may be changed from ``.``, and the package will be installed into a subdirectory. By default, the subdirectory is named the same as the package, and without the ``-ExcludeVersion`` option this name will include the specific version installed. Inside the subdirectory is a ``tools`` directory that contains the Python installation:
pt_br: Para selecionar uma versão específica, adicione ``-Version 3.x.y``. O diretório de saída pode ser mudado de ``.``, e o pacote será instalado em um subdiretório. Por padrão, o subdiretório é nomeado igual ao pacote, e sem a opção ``-ExcludeVersion`` esse nome irá incluir a versão específica instalada. Dentro do subdiretório está um diretório ``tools`` que contém a instalação do Python:

source: # Without -ExcludeVersion > .\python.3.5.2\tools\python.exe -V Python 3.5.2 # With -ExcludeVersion > .\python\tools\python.exe -V Python 3.5.2
pt_br: # Sem -ExcludeVersion > .\python.3.5.2\tools\python.exe -V Python 3.5.2 # Com -ExcludeVersion > .\python\tools\python.exe -V Python 3.5.2

source: In general, nuget packages are not upgradeable, and newer versions should be installed side-by-side and referenced using the full path. Alternatively, delete the package directory manually and install it again. Many CI systems will do this automatically if they do not preserve files between builds.
pt_br: Em geral, pacotes nuget não são atualizáveis, e novas versões devem ser instaladas lado-a-lado e referenciadas usando o caminho completo. Alternativamente, delete o diretório do pacote manualmente e instale novamente. Muitos sistemas CI irão fazer isso automaticamente se eles não preservam arquivos entre construções de projetos.

source: Alongside the ``tools`` directory is a ``build\native`` directory. This contains a MSBuild properties file ``python.props`` that can be used in a C++ project to reference the Python install. Including the settings will automatically use the headers and import libraries in your build.
pt_br: Juntamente com o diretório ``tools`` está o diretório ``build\native``. Ele contém um arquivo de propriedades MSBuild ``python.props`` que pode ser usado em um projeto C++ para referenciar a instalação do Python. Incluir as configurações irá automaticamente usar os cabeçalhos e importar as bibliotecas na sua construção de projeto.

source: The package information pages on nuget.org are `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ for the 64-bit version, `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ for the 32-bit version, and `www.nuget.org/packages/pythonarm64 <https://www.nuget.org/packages/pythonarm64>`_ for the ARM64 version
pt_br: As páginas de informação dos pacotes em nuget.org são `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ para a versão 64 bits, `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ para a versão 32 bits e `www.nuget.org/packages/pythonarm64 <https://www.nuget.org/packages/pythonarm64>`_ para a versão ARM64

source: Free-threaded packages
pt_br: Pacotes com threads livres

source: Packages containing free-threaded binaries are named `python-freethreaded <https://www.nuget.org/packages/python-freethreaded>`_ for the 64-bit version, `pythonx86-freethreaded <https://www.nuget.org/packages/pythonx86-freethreaded>`_ for the 32-bit version, and `pythonarm64-freethreaded <https://www.nuget.org/packages/pythonarm64-freethreaded>`_ for the ARM64 version. These packages contain both the ``python3.13t.exe`` and ``python.exe`` entry points, both of which run free threaded.
pt_br: Pacotes contendo binários com threads livres são chamados `python-freethreaded <https://www.nuget.org/packages/python-freethreaded>`_ para a versão de 64 bits, `pythonx86-freethreaded <https://www.nuget.org/packages/pythonx86-freethreaded>`_ para a versão de 32 bits e `pythonarm64-freethreaded <https://www.nuget.org/packages/pythonarm64-freethreaded>`_ para a versão ARM64. Esses dois pacotes contêm os pontos de entrada ``python3.13t.exe`` e ``python.exe``, os quais são executados com threads livres.

source: Alternative bundles
pt_br: Pacotes Alternativos

source: Besides the standard CPython distribution, there are modified packages including additional functionality. The following is a list of popular versions and their key features:
pt_br: À parte da distribuição padrão CPython, existem pacotes modificados incluindo funcionalidades adicionais. A seguir está uma lista de versões populares e seus recursos chave:

source: Installer with multi-platform compatibility, documentation, PyWin32
pt_br: Instalador com compatibilidade multi-plataforma, documentação, PyWin32

source: Popular scientific modules (such as numpy, scipy and pandas) and the ``conda`` package manager.
pt_br: Módulos científicos populares (como o numpy, scipy e pandas) e o gerenciador de pacotes ``conda``.

source: "The Next Generation Python Environment and Package Manager".
pt_br: "A próxima geração de ambiente Python e gerenciador de pacotes".

source: Previously Enthought provided Canopy, but it `reached end of life in 2016 <https://support.enthought.com/hc/en-us/articles/360038600051-Canopy-GUI-end-of-life-transition-to-the-Enthought-Deployment-Manager-EDM-and-Visual-Studio-Code>`_.
pt_br: Anteriormente, a Enthought fornecia Canopy, mas este `chegou ao fim de vida em 2016 <https://support.enthought.com/hc/en-us/articles/360038600051-Canopy-GUI-end-of-life-transition-to-the-Enthought-Deployment-Manager-EDM-and-Visual-Studio-Code>`_.

source: Windows-specific distribution with prebuilt scientific packages and tools for building packages.
pt_br: Distribuição específica do Windows com pacotes científicos pré-construídos e ferramentas para construir pacotes.

source: Note that these packages may not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
pt_br: Note que esses pacotes podem não incluir as últimas versões do Python ou outras bibliotecas, e não são mantidos ou suportados pelo time do núcleo do Python.

source: Supported Windows versions
pt_br: Versões do Windows suportadas

source: As specified in :pep:`11`, a Python release only supports a Windows platform while Microsoft considers the platform under extended support. This means that Python |version| supports Windows 10 and newer. If you require Windows 7 support, please install Python 3.8. If you require Windows 8.1 support, please install Python 3.12.
pt_br: Como especificado na :pep:`11`, uma versão Python suporta apenas uma plataforma Windows enquanto a Microsoft considera a plataforma sob suporte estendido. Isso significa que o Python |version| suporta Windows 10 ou superiores. Se você precisa de suporte ao Windows 7, por favor instale o Python 3.8. Se você precisa de suporte ao Windows 8.1, por favor instale o Python 3.12.

source: Removing the MAX_PATH limitation
pt_br: Removendo a limitação de MAX_PATH

source: Windows historically has limited path lengths to 260 characters. This meant that paths longer than this would not resolve and errors would result.
pt_br: O Windows historicamente tem limitado os comprimentos dos caminhos de arquivos em 260 caracteres. Isso significava que caminhos maiores que isso não seriam resolvidos e resultariam em erros.

source: In the latest versions of Windows, this limitation can be expanded to over 32,000 characters. Your administrator will need to activate the "Enable Win32 long paths" group policy, or set ``LongPathsEnabled`` to ``1`` in the registry key ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.
pt_br: Nas últimas versões do Windows, essa limitação pode ser expandida para mais de 32.000 caracteres. Seu administrador irá precisar ativar a política de grupo "Enable Win32 long paths", ou definir ``LongPathsEnabled`` para ``1`` na chave de registro ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.

source: This allows the :func:`open` function, the :mod:`os` module and most other path functionality to accept and return paths longer than 260 characters.
pt_br: Isso permite que a função :func:`open`, o módulo :mod:`os` e a maior parte das outras funcionalidades de caminho aceitem e retornem caminhos maiores que 260 caracteres quando usando strings.

source: After changing the above option and rebooting, no further configuration is required.
pt_br: Após alterar a opção acima e reiniciar, nenhuma configuração adicional é necessária.

source: UTF-8 mode
pt_br: Modo UTF-8

source: Windows still uses legacy encodings for the system encoding (the ANSI Code Page). Python uses it for the default encoding of text files (e.g. :func:`locale.getencoding`).
pt_br: O Windows ainda usa codificações legadas para a codificação do sistema (a Página de Código ANSI). O Python usa-o para a codificação padrão de arquivos de texto (por exemplo, :func:`locale.getencoding`).

source: This may cause issues because UTF-8 is widely used on the internet and most Unix systems, including WSL (Windows Subsystem for Linux).
pt_br: Isso pode causar problemas, porque o UTF-8 é amplamente usado na Internet e na maioria dos sistemas Unix, incluindo o WSL (Subsistema Windows para Linux).

source: You can use the :ref:`Python UTF-8 Mode <utf8-mode>` to change the default text encoding to UTF-8. You can enable the :ref:`Python UTF-8 Mode <utf8-mode>` via the ``-X utf8`` command line option, or the ``PYTHONUTF8=1`` environment variable. See :envvar:`PYTHONUTF8` for enabling UTF-8 mode, and :ref:`setting-envvars` for how to modify environment variables.
pt_br: Você pode usar o :ref:`Modo UTF-8 do Python <utf8-mode>` para alterar a codificação de texto padrão para UTF-8. Você pode habilitar :ref:`Modo UTF-8 do Python <utf8-mode>` através da opção de linha de comando ``-X utf8`` ou da variável de ambiente ``PYTHONUTF8=1``. Veja :envvar:`PYTHONUTF8` para habilitar o modo UTF-8, e :ref:`setting-envvars` para saber como modificar variáveis de ambiente.

source: When the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, you can still use the system encoding (the ANSI Code Page) via the "mbcs" codec.
pt_br: Quando o :ref:`Modo UTF-8 do Python <utf8-mode>` está habilitado, você ainda pode usar a codificação do sistema (a página de código ANSI) através do codec "mbcs".

source: Note that adding ``PYTHONUTF8=1`` to the default environment variables will affect all Python 3.7+ applications on your system. If you have any Python 3.7+ applications which rely on the legacy system encoding, it is recommended to set the environment variable temporarily or use the ``-X utf8`` command line option.
pt_br: Observe que adicionar ``PYTHONUTF8=1`` às variáveis de ambiente padrão afetará todas as aplicações Python 3.7+ em seu sistema. Se você tiver aplicações Python 3.7+ que dependem da codificação do sistema legado, é recomendável definir a variável de ambiente temporariamente ou usar a opção de linha de comando ``-X utf8``.

source: Even when UTF-8 mode is disabled, Python uses UTF-8 by default on Windows for:
pt_br: Mesmo quando o modo UTF-8 está desativado, o Python usa o UTF-8 por padrão no Windows para:

source: Console I/O including standard I/O (see :pep:`528` for details).
pt_br: E/S do console, incluindo E/S padrão (consulte :pep:`528` para detalhes).

source: The :term:`filesystem encoding <filesystem encoding and error handler>` (see :pep:`529` for details).
pt_br: A :term:`codificação do sistema de arquivos <filesystem encoding and error handler>` (veja a :pep:`529` para detalhes).

source: Finding modules
pt_br: Encontrando módulos

source: These notes supplement the description at :ref:`sys-path-init` with detailed Windows notes.
pt_br: Estas notas complementam a descrição em :ref:`sys-path-init` com notas detalhadas do Windows.

source: When no ``._pth`` file is found, this is how :data:`sys.path` is populated on Windows:
pt_br: Quando nenhum arquivo ``._pth`` é encontrado, assim é como :data:`sys.path` é populado no Windows:

source: An empty entry is added at the start, which corresponds to the current directory.
pt_br: Uma entrada em branco é adicionada ao início, que corresponde ao diretório atual.

source: If the environment variable :envvar:`PYTHONPATH` exists, as described in :ref:`using-on-envvars`, its entries are added next. Note that on Windows, paths in this variable must be separated by semicolons, to distinguish them from the colon used in drive identifiers (``C:\`` etc.).
pt_br: Se a variável de ambiente :envvar:`PYTHONPATH` existe, como descrito em :ref:`using-on-envvars`, suas entradas são adicionadas em seguida. Note que no Windows, caminhos nessa variável devem ser separados por ponto e vírgula, para distinguir eles dos dois pontos usados nos identificadores de drivers (``C:\`` etc.).

source: Additional "application paths" can be added in the registry as subkeys of :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` under both the ``HKEY_CURRENT_USER`` and ``HKEY_LOCAL_MACHINE`` hives. Subkeys which have semicolon-delimited path strings as their default value will cause each path to be added to :data:`sys.path`. (Note that all known installers only use HKLM, so HKCU is typically empty.)
pt_br: "Caminhos da aplicação" adicionais podem ser adicionados ao registro como subchaves de :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` sob ambas ``HKEY_CURRENT_USER`` e ``HKEY_LOCAL_MACHINE``. Subchaves que possuem string de caminhos delimitados por ponto e vírgula como seu valor padrão farão com que cada caminho seja adicionado ao :data:`sys.path`. (Note que todos os instaladores conhecidos usam apenas HKLM, portanto HKCU está tipicamente vazio.)

source: If the environment variable :envvar:`PYTHONHOME` is set, it is assumed as "Python Home". Otherwise, the path of the main Python executable is used to locate a "landmark file" (either ``Lib\os.py`` or ``pythonXY.zip``) to deduce the "Python Home". If a Python home is found, the relevant sub-directories added to :data:`sys.path` (``Lib``, ``plat-win``, etc) are based on that folder. Otherwise, the core Python path is constructed from the PythonPath stored in the registry.
pt_br: Se a variável de ambiente :envvar:`PYTHONHOME` está definida, ela é presumida como "Python Home". Caso contrário, o caminho do principal executável do Python é usado para localizar um "arquivo de referência" (ou ``Lib\os.py`` ou ``pythonXY.zip``) para deduzir o "Python Home". Se um Python Home é encontrado, os subdiretórios relevantes adicionados ao :data:`sys.path` (``Lib``, ``plat-win``, etc) são baseados naquela pasta. Se não, o caminho núcleo do Python é construído a partir do PythonPath armazenado no registro.

source: If the Python Home cannot be located, no :envvar:`PYTHONPATH` is specified in the environment, and no registry entries can be found, a default path with relative entries is used (e.g. ``.\Lib;.\plat-win``, etc).
pt_br: Se o Python Home não puder ser localizado, nenhum :envvar:`PYTHONPATH` está especificado no ambiente, e nenhuma entrada de registro pôde ser encontrada, um caminho padrão com entradas relativas é usado (por exemplo, ``.\Lib;.\plat-win``, etc).

source: If a ``pyvenv.cfg`` file is found alongside the main executable or in the directory one level above the executable, the following variations apply:
pt_br: Se um arquivo ``pyvenv.cfg`` for encontrado juntamente com o principal executável ou no diretório um nível acima do executável, as seguintes variações se aplicam:

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing the home location.
pt_br: Se ``home`` é um caminho absoluto e :envvar:`PYTHONHOME` não está definido, o caminho é usado ao invés do caminho ao principal executável quando deduzindo a localização do Home.

source: The end result of all this is:
pt_br: O resultado final de tudo isso é:

source: When running :file:`python.exe`, or any other .exe in the main Python directory (either an installed version, or directly from the PCbuild directory), the core path is deduced, and the core paths in the registry are ignored. Other "application paths" in the registry are always read.
pt_br: Quando executando :file:`python.exe`, ou qualquer outro .exe no diretório principal do Python (ou uma versão instalada, ou diretamente do diretório PCbuild), o caminho núcleo é deduzido, e os caminhos núcleo no registro são ignorados. Outros "caminhos da aplicação" no registro são sempre lidos.

source: When Python is hosted in another .exe (different directory, embedded via COM, etc), the "Python Home" will not be deduced, so the core path from the registry is used. Other "application paths" in the registry are always read.
pt_br: Quando Python é hospedado em outro .exe (diretório diferente, embutido via COM, etc), o "Python Home" não será deduzido, então o caminho núcleo do registro é usado. Outros "caminhos da aplicação" no registro sempre são lidos.

source: If Python can't find its home and there are no registry value (frozen .exe, some very strange installation setup) you get a path with some default, but relative, paths.
pt_br: Se o Python não puder encontrar seu Home e não existem valores no registro (.exe imutáveis, algumas configurações de instalação bem estranhas) você recebe um caminho com alguns caminhos padrão, porém relativos.

source: For those who want to bundle Python into their application or distribution, the following advice will prevent conflicts with other installations:
pt_br: Para aqueles que querem empacotar o Python em suas aplicações ou distribuições, o seguinte conselho irá prevenir conflitos com outras instalações:

source: Include a ``._pth`` file alongside your executable containing the directories to include. This will ignore paths listed in the registry and environment variables, and also ignore :mod:`site` unless ``import site`` is listed.
pt_br: Inclua um arquivo ``._pth`` juntamente do executável contendo os diretórios a serem incluídos. Isso irá ignorar caminhos listados no registro e variáveis de ambiente, e também ignorar :mod:`sites` a não ser que ``import site`` seja listado.

source: If you are loading :file:`python3.dll` or :file:`python37.dll` in your own executable, explicitly set :c:member:`PyConfig.module_search_paths` before :c:func:`Py_InitializeFromConfig`.
pt_br: Se você estiver carregando :file:`python3.dll` ou :file:`python37.dll` em seu próprio executável, defina explicitamente :c:member:`PyConfig.module_search_paths` antes de :c:func:`Py_InitializeFromConfig`.

source: Clear and/or overwrite :envvar:`PYTHONPATH` and set :envvar:`PYTHONHOME` before launching :file:`python.exe` from your application.
pt_br: Limpe e/ou sobrescreva :envvar:`PYTHONPATH` e defina :envvar:`PYTHONHOME` antes de iniciar o :file:`python.exe` a partir da sua aplicação.

source: If you cannot use the previous suggestions (for example, you are a distribution that allows people to run :file:`python.exe` directly), ensure that the landmark file (:file:`Lib\\os.py`) exists in your install directory. (Note that it will not be detected inside a ZIP file, but a correctly named ZIP file will be detected instead.)
pt_br: Se você não puder usar as sugestões anteriores (por exemplo, você é uma distribuição que permite que as pessoas executem o arquivo :file:`python.exe` diretamente), certifique-se de que o arquivo de referência (:file:`Lib\\os.py`) existe no seu diretório de instalação. (Note que ele não será detectado dentro de um arquivo ZIP, mas um arquivo ZIP corretamente nomeado será detectado ao invés disso.)
