Repository: python/python-docs-pt-br
Catalog: using/windows.po
Languages: pt_br

source: Using Python on Windows
pt_br: Utilizando Python no Windows

source: This document aims to give an overview of Windows-specific behaviour you should know about when using Python on Microsoft Windows.
pt_br: Este documento pretende dar uma visão geral do comportamento específico do Windows que você deve conhecer quando fores utilizar o Python no sistema operacional Microsoft Windows.

source: Unlike most Unix systems and services, Windows does not include a system supported installation of Python. Instead, Python can be obtained from a number of distributors, including directly from the CPython team. Each Python distribution will have its own benefits and drawbacks, however, consistency with other tools you are using is generally a worthwhile benefit. Before committing to the process described here, we recommend investigating your existing tools to see if they can provide Python directly.
pt_br: Ao contrário da maioria dos sistemas e serviços Unix, o Windows não inclui uma instalação do Python com suporte no sistema. Em vez disso, o Python pode ser obtido de diversos distribuidores, inclusive diretamente da equipe do CPython. Cada distribuição do Python terá suas próprias vantagens e desvantagens; no entanto, a consistência com outras ferramentas que você usa geralmente é um benefício valioso. Antes de se comprometer com o processo descrito aqui, recomendamos verificar suas ferramentas existentes para ver se elas podem fornecer Python diretamente.

source: To obtain Python from the CPython team, use the Python Install Manager. This is a standalone tool that makes Python available as global commands on your Windows machine, integrates with the system, and supports updates over time. You can download the Python Install Manager from `python.org/downloads`_ or through the `Microsoft Store app`_.
pt_br: Para obter o Python da equipe do CPython, use o Python Install Manager (gerenciador de instalação do Python). Esta é uma ferramenta autônoma que disponibiliza o Python como comandos globais na sua máquina Windows, integra-se ao sistema e suporta atualizações ao longo do tempo. Você pode baixar o Python Install Manager. em `python.org/downloads`_ ou pelo `aplicativo da Microsoft Store`_.

source: Once you have installed the Python Install Manager, the global ``python`` command can be used from any terminal to launch your current latest version of Python. This version may change over time as you add or remove different versions, and the ``py list`` command will show which is current.
pt_br: Após instalar o Python Install Manager, o comando global ``python`` pode ser usado em qualquer terminal para iniciar a versão mais recente do Python. Essa versão pode mudar com o tempo, conforme você adiciona ou remove versões diferentes, e o comando ``py list`` mostrará qual é a atual.

source: In general, we recommend that you create a :ref:`virtual environment <tut-venv>` for each project and run ``<env>\Scripts\Activate`` in your terminal to use it. This provides isolation between projects, consistency over time, and ensures that additional commands added by packages are also available in your session. Create a virtual environment using ``python -m venv <env path>``.
pt_br: Em geral, recomendamos que você crie um :ref:`ambiente virtual <tut-venv>` para cada projeto e execute ``<env>\Scripts\Activate`` no seu terminal para usá-lo. Isso proporciona isolamento entre projetos, consistência ao longo do tempo e garante que comandos adicionais adicionados por pacotes também estejam disponíveis na sua sessão. Crie um ambiente virtual usando ``python -m venv <caminho do ambiente>``.

source: If the ``python`` or ``py`` commands do not seem to be working, please see the :ref:`Troubleshooting <pymanager-troubleshoot>` section below. There are sometimes additional manual steps required to configure your PC.
pt_br: Se os comandos ``python`` ou ``py`` não estiverem funcionando, consulte a seção :ref:`Solução de problemas <pymanager-troubleshoot>` abaixo. Às vezes, são necessárias etapas manuais adicionais para configurar seu PC.

source: Apart from using the Python install manager, Python can also be obtained as NuGet packages. See :ref:`windows-nuget` below for more information on these packages.
pt_br: Além de usar o gerenciador de instalação do Python, o Python também pode ser obtido como pacotes NuGet. Veja :ref:`windows-nuget` abaixo para mais informações sobre esses pacotes.

source: The embeddable distros are minimal packages of Python suitable for embedding into larger applications. They can be installed using the Python install manager. See :ref:`windows-embeddable` below for more information on these packages.
pt_br: As distribuições incorporáveis são pacotes mínimos do Python adequados para incorporação em aplicações maiores. Elas podem ser instaladas usando o gerenciador de instalação do Python. Consulte :ref:`windows-embeddable` abaixo para obter mais informações sobre esses pacotes.

source: Python install manager
pt_br: Gerenciador de instalação do Python

source: Installation
pt_br: Instalação

source: The Python install manager can be installed from the `Microsoft Store app`_ or downloaded and installed from `python.org/downloads`_. The two versions are identical.
pt_br: O gerenciador de instalação do Python pode ser instalado a partir da `aplicação da Microsoft Store`_ ou baixado e instalado de `python.org/downloads`_. As duas versões são idênticas.

source: To install through the Store, simply click "Install". After it has completed, open a terminal and type ``python`` to get started.
pt_br: Para instalar pela Store, basta clicar em "Install". Após a conclusão, abra um terminal e digite ``python`` para começar.

source: To install the file downloaded from python.org, either double-click and select "Install", or run ``Add-AppxPackage <path to MSIX>`` in Windows Powershell.
pt_br: Para instalar o arquivo baixado de python.org, clique duas vezes e selecione "Install" ou execute ``Add-AppxPackage <caminho para MSIX>`` no Windows Powershell.

source: After installation, the ``python``, ``py``, and ``pymanager`` commands should be available. If you have existing installations of Python, or you have modified your :envvar:`PATH` variable, you may need to remove them or undo the modifications. See :ref:`pymanager-troubleshoot` for more help with fixing non-working commands.
pt_br: Após a instalação, os comandos ``python``, ``py`` e ``pymanager`` devem estar disponíveis. Se você já possui instalações do Python ou modificou a variável :envvar:`PATH`, pode ser necessário removê-las ou desfazer as modificações. Consulte :ref:`pymanager-troubleshoot` para obter mais ajuda sobre como corrigir comandos que não funcionam.

source: When you first install a runtime, you will likely be prompted to add a directory to your :envvar:`PATH`. This is optional, if you prefer to use the ``py`` command, but is offered for those who prefer the full range of aliases (such as ``python3.14.exe``) to be available. The directory will be :file:`%LocalAppData%\\Python\\bin` by default, but may be customized by an administrator. Click Start and search for "Edit environment variables for your account" for the system settings page to add the path.
pt_br: Ao instalar um ambiente de execução pela primeira vez, você provavelmente será solicitado a adicionar um diretório ao seu :envvar:`PATH`. Isso é opcional se você preferir usar o comando ``py``, mas é oferecido para aqueles que preferem que todos os apelidos (como ``python3.14.exe``) estejam disponíveis. O diretório será :file:`%LocalAppData%\\Python\\bin` por padrão, mas pode ser personalizado por um administrador. Clique em Iniciar e pesquise "Editar as variáveis de ambiente para sua conta" na página de configurações do sistema para adicionar o caminho.

source: Each Python runtime you install will have its own directory for scripts. These also need to be added to :envvar:`PATH` if you want to use them.
pt_br: Cada ambiente de execução do Python que você instalar terá seu próprio diretório para scripts. Estes também precisam ser adicionados a :envvar:`PATH` se você quiser usá-los.

source: The Python install manager will be automatically updated to new releases. This does not affect any installs of Python runtimes. Uninstalling the Python install manager does not uninstall any Python runtimes.
pt_br: O gerenciador de instalação do Python será atualizado automaticamente para novas versões. Isso não afeta nenhuma instalação de ambientes de execução do Python. Desinstalar o gerenciador de instalação do Python não desinstala nenhum ambiente de execução do Python.

source: If you are not able to install an MSIX in your context, for example, you are using automated deployment software that does not support it, or are targeting Windows Server 2019, please see :ref:`pymanager-advancedinstall` below for more information.
pt_br: Se você não conseguir instalar um MSIX no seu contexto, por exemplo, se estiver usando um software de implantação automatizada que não oferece suporte a isso ou se estiver mirando o Windows Server 2019, consulte :ref:`pymanager-advancedinstall` abaixo para obter mais informações.

source: Basic use
pt_br: Uso básico

source: The recommended command for launching Python is ``python``, which will either launch the version requested by the script being launched, an active virtual environment, or the default installed version, which will be the latest stable release unless configured otherwise. If no version is specifically requested and no runtimes are installed at all, the current latest release will be installed automatically.
pt_br: O comando recomendado para iniciar o Python é ``python``, que iniciará a versão solicitada pelo script em execução, um ambiente virtual ativo ou a versão padrão instalada, que será a versão estável mais recente, a menos que configurado de outra forma. Se nenhuma versão for solicitada especificamente e nenhum ambiente de execução estiver instalado, a versão mais recente será instalada automaticamente.

source: For all scenarios involving multiple runtime versions, the recommended command is ``py``. This may be used anywhere in place of ``python`` or the older ``py.exe`` launcher. By default, ``py`` matches the behaviour of ``python``, but also allows command line options to select a specific version as well as subcommands to manage installations. These are detailed below.
pt_br: Para todos os cenários que envolvem múltiplas versões de ambientes de execução do antigo inicializador ``py.exe``. Por padrão, ``py`` corresponde ao comportamento de ``python``, mas também permite opções de linha de comando para selecionar uma versão específica, bem como subcomandos para gerenciar instalações. Estes são detalhados abaixo.

source: Because the ``py`` command may already be taken by the previous version, there is also an unambiguous ``pymanager`` command. Scripted installs that are intending to use Python install manager should consider using ``pymanager``, due to the lower chance of encountering a conflict with existing installs. The only difference between the two commands is when running without any arguments: ``py`` will install and launch your default interpreter, while ``pymanager`` will display help (``pymanager exec ...`` provides equivalent behaviour to ``py ...``).
pt_br: Como o comando ``py`` pode já estar sendo executado pela versão anterior, há também um comando ``pymanager`` inequívoco. Instalações com script que pretendem usar o gerenciador de instalação Python devem considerar o uso de ``pymanager``, devido à menor chance de conflito com instalações existentes. A única diferença entre os dois comandos é que, quando executados sem argumentos, ``py`` instalará e iniciará seu interpretador padrão, enquanto ``pymanager`` exibirá ajuda (``pymanager exec ...`` oferece comportamento equivalente a ``py ...``).

source: Each of these commands also has a windowed version that avoids creating a console window. These are ``pyw``, ``pythonw`` and ``pymanagerw``. A ``python3`` command is also included that mimics the ``python`` command. It is intended to catch accidental uses of the typical POSIX command on Windows, but is not meant to be widely used or recommended.
pt_br: Cada um desses comandos também possui uma versão em janela que evita a criação de uma janela de console. São eles ``pyw``, ``pythonw`` e ``pymanagerw``. Um comando ``python3`` também está incluído, imitando o comando ``python``. Ele visa detectar usos acidentais do comando POSIX típico no Windows, mas não se destina a ser amplamente utilizado ou recomendado.

source: To launch your default runtime, run ``python`` or ``py`` with the arguments you want to be passed to the runtime (such as script files or the module to launch):
pt_br: Para iniciar seu ambiente de execução padrão, execute ``python`` ou ``py`` com os argumentos que você deseja passar para o ambiente de execução (como arquivos de script ou o módulo a ser iniciado):

source: $> py ... $> python my-script.py ... $> py -m this ...
pt_br: $> py ... $> python meu-script.py ... $> py -m this ...

source: The default runtime can be overridden with the :envvar:`PYTHON_MANAGER_DEFAULT` environment variable, or a configuration file. See :ref:`pymanager-config` for information about configuration settings.
pt_br: O ambiente de execução padrão pode ser substituído pela variável de ambiente :envvar:`PYTHON_MANAGER_DEFAULT` ou por um arquivo de configuração. Consulte :ref:`pymanager-config` para obter informações sobre as configurações.

source: To launch a specific runtime, the ``py`` command accepts a ``-V:<TAG>`` option. This option must be specified before any others. The tag is part or all of the identifier for the runtime; for those from the CPython team, it looks like the version, potentially with the platform. For compatibility, the ``V:`` may be omitted in cases where the tag refers to an official release and starts with ``3``.
pt_br: Para iniciar um ambiente de execução específico, o comando ``py`` aceita a opção ``-V:<TAG>``. Esta opção deve ser especificada antes de quaisquer outras. A tag é parte ou todo o identificador do ambiente; para aqueles da equipe do CPython, parece a versão, potencialmente com a plataforma. Para compatibilidade, o ``V:`` pode ser omitido nos casos em que a tag se refere a uma versão oficial e começa com ``3``.

source: Runtimes from other distributors may require the *company* to be included as well. This should be separated from the tag by a slash, and may be a prefix. Specifying the company is optional when it is ``PythonCore``, and specifying the tag is optional (but not the slash) when you want the latest release from a specific company.
pt_br: Ambientes de execução de outros distribuidores podem exigir a inclusão da *company* também. Esta deve ser separada da tag por uma barra e pode ser um prefixo. Especificar a empresa é opcional quando se trata de ``PythonCore``, e especificar a tag é opcional (mas não a barra) quando se deseja a versão mais recente de uma empresa específica.

source: $> py -V:Distributor\1.0 ... $> py -V:distrib/ ...
pt_br: $> py -V:Distribuidor\1.0 ... $> py -V:distrib/ ...

source: If no version is specified, but a script file is passed, the script will be inspected for a *shebang line*. This is a special format for the first line in a file that allows overriding the command. See :ref:`pymanager-shebang` for more information. When there is no shebang line, or it cannot be resolved, the script will be launched with the default runtime.
pt_br: Se nenhuma versão for especificada, mas um arquivo de script for passado, o script será inspecionado em busca de uma *linha de shebang*. Este é um formato especial para a primeira linha de um arquivo que permite a substituição do comando. Consulte :ref:`pymanager-shebang` para obter mais informações. Quando não houver uma linha shebang ou o problema não puder ser resolvido, o script será iniciado com o ambiente de execução padrão.

source: If you are running in an active virtual environment, have not requested a particular version, and there is no shebang line, the default runtime will be that virtual environment. In this scenario, the ``python`` command was likely already overridden and none of these checks occurred. However, this behaviour ensures that the ``py`` command can be used interchangeably.
pt_br: Se você estiver executando em um ambiente virtual ativo, não tiver solicitado uma versão específica e não houver uma linha shebang, o ambiente de execução padrão será o ambiente virtual em questão. Nesse cenário, o comando ``python`` provavelmente já foi substituído e nenhuma dessas verificações ocorreu. No entanto, esse comportamento garante que o comando ``py`` possa ser usado de forma intercambiável.

source: When you launch either ``python`` or ``py`` but do not have any runtimes installed, and the requested version is the default, it will be installed automatically and then launched. Otherwise, the requested version will be installed if automatic installation is configured (most likely by setting ``PYTHON_MANAGER_AUTOMATIC_INSTALL`` to ``true``), or if the ``py exec`` or ``pymanager exec`` forms of the command were used.
pt_br: Ao iniciar ``python`` ou ``py``, mas não tiver nenhum ambiente de execução instalado, e a versão solicitada for a padrão, ele será instalado automaticamente e, em seguida, executado. Caso contrário, a versão solicitada será instalada se a instalação automática estiver configurada (provavelmente definindo ``PYTHON_MANAGER_AUTOMATIC_INSTALL`` como ``true``) ou se as formas ``py exec`` ou ``pymanager exec`` do comando tiverem sido utilizadas.

source: Command help
pt_br: Comando help

source: The ``py help`` command will display the full list of supported commands, along with their options. Any command may be passed the ``-?`` option to display its help, or its name passed to ``py help``.
pt_br: O comando ``py help`` exibirá a lista completa de comandos suportados, juntamente com suas opções. Qualquer comando pode receber a opção ``-?`` para exibir sua ajuda, ou seu nome pode ser passado para ``py help``.

source: All commands support some common options, which will be shown by ``py help``. These options must be specified after any subcommand. Specifying ``-v`` or ``--verbose`` will increase the amount of output shown, and ``-vv`` will increase it further for debugging purposes. Passing ``-q`` or ``--quiet`` will reduce output, and ``-qq`` will reduce it further.
pt_br: Todos os comandos oferecem suporte a algumas opções comuns, que serão exibidas por ``py help``. Essas opções devem ser especificadas após qualquer subcomando. Especificar ``-v`` ou ``--verbose`` aumentará a quantidade de saída exibida, e ``-vv`` aumentará ainda mais para fins de depuração. Passar ``-q`` ou ``--quiet`` reduzirá a saída, e ``-qq`` a reduzirá ainda mais.

source: The ``--config=<PATH>`` option allows specifying a configuration file to override multiple settings at once. See :ref:`pymanager-config` below for more information about these files.
pt_br: A opção ``--config=<PATH>`` permite especificar um arquivo de configuração para substituir várias configurações simultaneamente. Consulte :ref:`pymanager-config` abaixo para obter mais informações sobre esses arquivos.

source: Listing runtimes
pt_br: Listando ambientes de execução

source: The list of installed runtimes can be seen using ``py list``. A filter may be added in the form of one or more tags (with or without company specifier), and each may include a ``<``, ``<=``, ``>=`` or ``>`` prefix to restrict to a range.
pt_br: A lista de ambientes de execução instalados pode ser visualizada usando ``py list``. Um filtro pode ser adicionado na forma de uma ou mais tags (com ou sem especificador de empresa), e cada uma pode incluir um prefixo ``<``, ``<=``, ``>=`` ou ``>`` para restringir a um intervalo.

source: A range of formats are supported, and can be passed as the ``--format=<FMT>`` or ``-f <FMT>`` option. Formats include ``table`` (a user friendly table view), ``csv`` (comma-separated table), ``json`` (a single JSON blob), ``jsonl`` (one JSON blob per result), ``exe`` (just the executable path), ``prefix`` (just the prefix path).
pt_br: Vários formatos são suportados e podem ser passados como a opção ``--format=<FMT>`` ou ``-f <FMT>``. Os formatos incluem ``table`` (uma visualização de tabela amigável), ``csv`` (tabela separada por vírgulas), ``json`` (um único blob JSON), ``jsonl`` (um blob JSON por resultado), ``exe`` (apenas o caminho do executável), ``prefix`` (apenas o caminho do prefixo).

source: The ``--one`` or ``-1`` option only displays a single result. If the default runtime is included, it will be the one. Otherwise, the "best" result is shown ("best" is deliberately vaguely defined, but will usually be the most recent version). The result shown by ``py list --one <TAG>`` will match the runtime that would be launched by ``py -V:<TAG>``.
pt_br: A opção ``--one`` ou ``-1`` exibe apenas um único resultado. Se o ambiente de execução padrão estiver incluído, será ele. Caso contrário, o "melhor" resultado será exibido ("melhor" é definido de forma deliberadamente vaga, mas geralmente será a versão mais recente). O resultado exibido por ``py list --one <TAG>`` corresponderá ao ambiente de execução que seria iniciado por ``py -V:<TAG>``.

source: The ``--only-managed`` option excludes results that were not installed by the Python install manager. This is useful when determining which runtimes may be updated or uninstalled through the ``py`` command.
pt_br: A opção ``--only-managed`` exclui resultados que não foram instalados pelo gerenciador de instalação do Python. Isso é útil para determinar quais ambientes de execução podem ser atualizados ou desinstalados por meio do comando ``py``.

source: The ``--online`` option is short for passing ``--source=<URL>`` with the default source. Passing either of these options will search the online index for runtimes that can be installed. The result shown by ``py list --online --one <TAG>`` will match the runtime that would be installed by ``py install <TAG>``.
pt_br: A opção ``--online`` é uma abreviação de ``--source=<URL>`` com a fonte padrão. Passar qualquer uma dessas opções pesquisará no índice online os ambientes de execução que podem ser instalados. O resultado exibido por ``py list --online --one <TAG>`` corresponderá ao ambiente de execução que seria instalado por ``py install <TAG>``.

source: For compatibility with the old launcher, the ``--list``, ``--list-paths``, ``-0`` and ``-0p`` commands (e.g. ``py -0p``) are retained. They do not allow additional options, and will produce legacy formatted output.
pt_br: Para compatibilidade com o inicializador antigo, os comandos ``--list``, ``--list-paths``, ``-0`` e ``-0p`` (por exemplo, ``py -0p``) foram mantidos. Eles não permitem opções adicionais e produzirão uma saída com o formato antigo.

source: Installing runtimes
pt_br: Instalando ambientes de execução

source: New runtime versions may be added using ``py install``. One or more tags may be specified, and the special tag ``default`` may be used to select the default. Ranges are not supported for installation.
pt_br: Novas versões de ambientes de execução podem ser adicionadas usando ``py install``. Uma ou mais tags podem ser especificadas, e a tag especial ``default`` pode ser usada para selecionar o padrão. Intervalos não são suportados para instalação.

source: The ``--source=<URL>`` option allows overriding the online index that is used to obtain runtimes. This may be used with an offline index, as shown in :ref:`pymanager-offline`.
pt_br: A opção ``--source=<URL>`` permite substituir o índice online usado para obter ambientes de execução. Isso pode ser usado com um índice offline, como mostrado em :ref:`pymanager-offline`.
