Repository: python/python-docs-pt-br
Catalog: howto/argparse-optparse.po
Languages: pt_br

source: Migrating ``optparse`` code to ``argparse``
pt_br: Migrando código ``optparse`` para ``argparse``

source: The :mod:`argparse` module offers several higher level features not natively provided by the :mod:`optparse` module, including:
pt_br: O módulo :mod:`argparse` oferece vários recursos de nível mais alto não fornecidos nativamente pelo módulo :mod:`optparse`, incluindo:

source: Handling positional arguments.
pt_br: Tratando argumentos posicionais.

source: Supporting subcommands.
pt_br: Prover suporte a subcomandos.

source: Allowing alternative option prefixes like ``+`` and ``/``.
pt_br: Permitir prefixos alternativos de opções como ``+`` e ``/``.

source: Handling zero-or-more and one-or-more style arguments.
pt_br: Manipular argumentos de estilo "zero ou mais" e "um ou mais".

source: Producing more informative usage messages.
pt_br: Produzir mensagens de uso mais informativas.

source: Providing a much simpler interface for custom ``type`` and ``action``.
pt_br: Fornecer uma interface muito mais simples para ``type`` e ``action`` personalizados.

source: Originally, the :mod:`argparse` module attempted to maintain compatibility with :mod:`optparse`. However, the fundamental design differences between supporting declarative command line option processing (while leaving positional argument processing to application code), and supporting both named options and positional arguments in the declarative interface mean that the API has diverged from that of ``optparse`` over time.
pt_br: Originalmente, o módulo :mod:`argparse` tentou manter a compatibilidade com :mod:`optparse`. No entanto, as diferenças fundamentais de design entre suportar o processamento de opções de linha de comando declarativas (enquanto deixa o processamento de argumentos posicionais para o código da aplicação) e suportar opções nomeadas e argumentos posicionais na interface declarativa significam que a API divergiu daquela de ``optparse`` ao longo do tempo.

source: As described in :ref:`choosing-an-argument-parser`, applications that are currently using :mod:`optparse` and are happy with the way it works can just continue to use ``optparse``.
pt_br: Conforme descrito em :ref:`choosing-an-argument-parser`, as aplicações que atualmente usam :mod:`optparse` e estão satisfeitos com a forma como ele funciona podem continuar usando ``optparse``.

source: Application developers that are considering migrating should also review the list of intrinsic behavioural differences described in that section before deciding whether or not migration is desirable.
pt_br: Os desenvolvedores de aplicações que estão pensando em migrar também devem revisar a lista de diferenças comportamentais intrínsecas descritas nessa seção antes de decidir se a migração é desejável ou não.

source: For applications that do choose to migrate from :mod:`optparse` to :mod:`argparse`, the following suggestions should be helpful:
pt_br: Para aplicações que optam por migrar de :mod:`optparse` para :mod:`argparse`, as seguintes sugestões devem ser úteis:

source: Replace all :meth:`optparse.OptionParser.add_option` calls with :meth:`ArgumentParser.add_argument` calls.
pt_br: Substituir todas as chamadas de :meth:`optparse.OptionParser.add_option` por chamadas de :meth:`ArgumentParser.add_argument`.

source: Replace ``(options, args) = parser.parse_args()`` with ``args = parser.parse_args()`` and add additional :meth:`ArgumentParser.add_argument` calls for the positional arguments. Keep in mind that what was previously called ``options``, now in the :mod:`argparse` context is called ``args``.
pt_br: Substituir ``(options, args) = parser.parse_args()`` por ``args = parser.parse_args()`` e adicionar chamadas adicionais a :meth:`ArgumentParser.add_argument` para os argumentos posicionais. Tenha em mente que o que anteriormente era chamado de ``options``, agora no contexto do :mod:`argparse` é chamado de ``args``.

source: Replace :meth:`optparse.OptionParser.disable_interspersed_args` by using :meth:`~ArgumentParser.parse_intermixed_args` instead of :meth:`~ArgumentParser.parse_args`.
pt_br: Substituir :meth:`optparse.OptionParser.disable_interspersed_args` usando :meth:`~ArgumentParser.parse_intermixed_args` em vez de :meth:`~ArgumentParser.parse_args`.

source: Replace callback actions and the ``callback_*`` keyword arguments with ``type`` or ``action`` arguments.
pt_br: Substituir ações de função de retorno e argumentos nomeados ``callback_*`` por argumentos ``type`` ou ``action``.

source: Replace string names for ``type`` keyword arguments with the corresponding type objects (e.g. int, float, complex, etc).
pt_br: Substituir nomes de strings para argumentos nomeados ``type`` pelos objetos de tipo correspondentes (por exemplo, int, float, complex, etc).

source: Replace :class:`optparse.Values` with :class:`Namespace` and :exc:`optparse.OptionError` and :exc:`optparse.OptionValueError` with :exc:`ArgumentError`.
pt_br: Substituir :class:`optparse.Values` por :class:`Namespace` e :exc:`optparse.OptionError` e :exc:`optparse.OptionValueError` por :exc:`ArgumentError`.

source: Replace strings with implicit arguments such as ``%default`` or ``%prog`` with the standard Python syntax to use dictionaries to format strings, that is, ``%(default)s`` and ``%(prog)s``.
pt_br: Substituir strings com argumentos implícitos tal como ``%default`` ou ``%prog`` pela sintaxe padrão do Python para usar dicionários para formatar strings, ou seja, ``%(default)s`` e ``%(prog)s``.

source: Replace the OptionParser constructor ``version`` argument with a call to ``parser.add_argument('--version', action='version', version='<the version>')``.
pt_br: Substituir o argumento ``version`` do construtor do OptionParser por uma chamada a ``parser.add_argument('--version', action='version', version='<the version>')``.
