Repository: python/python-docs-pt-br
Catalog: howto/argparse.po
Languages: pt_br

source: Argparse Tutorial
pt_br: Tutorial de Argparse

source: author
pt_br: autor

source: This tutorial is intended to be a gentle introduction to :mod:`argparse`, the recommended command-line parsing module in the Python standard library.
pt_br: Este tutorial pretende ser uma introdução gentil ao :mod:`argparse` --- o módulo recomendado na biblioteca padrão do Python para fazer a análise de linha de comando.

source: The standard library includes two other libraries directly related to command-line parameter processing: the lower level :mod:`optparse` module (which may require more code to configure for a given application, but also allows an application to request behaviors that ``argparse`` doesn't support), and the very low level :mod:`getopt` (which specifically serves as an equivalent to the :c:func:`!getopt` family of functions available to C programmers). While neither of those modules is covered directly in this guide, many of the core concepts in ``argparse`` first originated in ``optparse``, so some aspects of this tutorial will also be relevant to ``optparse`` users.
pt_br: A biblioteca padrão inclui duas outras bibliotecas diretamente relacionadas ao processamento de parâmetros de linha de comando: o módulo de nível inferior :mod:`optparse` (que pode exigir mais código para configurar uma determinada aplicação, mas também permite que uma aplicação solicite comportamentos que ``argparse`` não suporta), e o nível muito baixo :mod:`getopt` (que serve especificamente como um equivalente à família de funções :c:func:`!getopt` disponível para programadores C). Embora nenhum desses módulos seja abordado diretamente neste guia, muitos dos conceitos principais em ``argparse`` se originaram primeiro em ``optparse``, então alguns aspectos deste tutorial também serão relevantes para usuários de ``optparse``.

source: Concepts
pt_br: Conceitos

source: Let's show the sort of functionality that we are going to explore in this introductory tutorial by making use of the :command:`ls` command:
pt_br: Demonstraremos o tipo de funcionalidade que vamos explorar neste tutorial introdutório fazendo uso do comando :command:`ls`:

source: $ ls cpython devguide prog.py pypy rm-unused-function.patch $ ls pypy ctypes_configure demo dotviewer include lib_pypy lib-python ... $ ls -l total 20 drwxr-xr-x 19 wena wena 4096 Feb 18 18:51 cpython drwxr-xr-x 4 wena wena 4096 Feb 8 12:04 devguide -rwxr-xr-x 1 wena wena 535 Feb 19 00:05 prog.py drwxr-xr-x 14 wena wena 4096 Feb 7 00:59 pypy -rw-r--r-- 1 wena wena 741 Feb 18 01:01 rm-unused-function.patch $ ls --help Usage: ls [OPTION]... [FILE]... List information about the FILEs (the current directory by default). Sort entries alphabetically if none of -cftuvSUX nor --sort is specified. ...
pt_br: $ ls cpython devguide prog.py pypy rm-unused-function.patch $ ls pypy ctypes_configure demo dotviewer include lib_pypy lib-python ... $ ls -l total 20 drwxr-xr-x 19 wena wena 4096 Feb 18 18:51 cpython drwxr-xr-x 4 wena wena 4096 Feb 8 12:04 devguide -rwxr-xr-x 1 wena wena 535 Feb 19 00:05 prog.py drwxr-xr-x 14 wena wena 4096 Feb 7 00:59 pypy -rw-r--r-- 1 wena wena 741 Feb 18 01:01 rm-unused-function.patch $ ls --help Uso: ls [OPÇÃO]... [ARQUIVO]... Lista informações sobre os ARQUIVOs (no diretório atual por padrão). Lista as entradas em ordem alfabética se não for usada nenhuma opção -cftuvSUX nem --sort.. ...

source: A few concepts we can learn from the four commands:
pt_br: Alguns conceitos que podemos aprender a partir destes quatro comandos:

source: The :command:`ls` command is useful when run without any options at all. It defaults to displaying the contents of the current directory.
pt_br: O comando :command:`ls` é útil quando usado sem nenhuma opção. Por padrão, ele mostra o conteúdo do diretório atual.

source: If we want beyond what it provides by default, we tell it a bit more. In this case, we want it to display a different directory, ``pypy``. What we did is specify what is known as a positional argument. It's named so because the program should know what to do with the value, solely based on where it appears on the command line. This concept is more relevant to a command like :command:`cp`, whose most basic usage is ``cp SRC DEST``. The first position is *what you want copied,* and the second position is *where you want it copied to*.
pt_br: Se quisermos além do que ele fornece por padrão, contamos um pouco mais. Neste caso, queremos que ele exiba um diretório diferente, ``pypy``. O que fizemos foi especificar o que é conhecido como argumento posicional. Ele é chamado assim porque o programa deve saber o que fazer com o valor, apenas com base em onde ele aparece na linha de comando. Este conceito é mais relevante para um comando como :command:`cp`, cujo uso mais básico é ``cp SRC DEST``. A primeira posição é *o que você deseja copiar* e a segunda posição é *para onde você deseja copiar*.

source: Now, say we want to change behaviour of the program. In our example, we display more info for each file instead of just showing the file names. The ``-l`` in that case is known as an optional argument.
pt_br: Agora, digamos que queremos mudar o comportamento do programa. Em nosso exemplo, exibimos mais informações para cada arquivo em vez de apenas mostrar os nomes dos arquivos. O ``-l`` nesse caso é conhecido como um argumento opcional.

source: That's a snippet of the help text. It's very useful in that you can come across a program you have never used before, and can figure out how it works simply by reading its help text.
pt_br: Esse é um trecho do texto de ajuda. É muito útil que possas encontrar um programa que nunca usastes antes e poder descobrir como o mesmo funciona simplesmente lendo o seu texto de ajuda.

source: The basics
pt_br: O básico

source: Let us start with a very simple example which does (almost) nothing::
pt_br: Comecemos com um exemplo muito simples que irá fazer (quase) nada::

source: Following is a result of running the code:
pt_br: A seguir, temos o resultado da execução do código:

source: Here is what is happening:
pt_br: Eis aqui o que está acontecendo:

source: Running the script without any options results in nothing displayed to stdout. Not so useful.
pt_br: Executar o script sem qualquer opção resultará que nada será exibido em stdout. Isso não é útil.

source: The second one starts to display the usefulness of the :mod:`argparse` module. We have done almost nothing, but already we get a nice help message.
pt_br: O segundo começa a exibir as utilidades do módulo :mod:`argparse`. Não fizemos quase nada, mas já recebemos uma boa mensagem de ajuda.

source: The ``--help`` option, which can also be shortened to ``-h``, is the only option we get for free (i.e. no need to specify it). Specifying anything else results in an error. But even then, we do get a useful usage message, also for free.
pt_br: A opção ``--help``, que também pode ser encurtada para ``-h``, é a única opção que obtemos livremente (ou seja, não é necessário determiná-la). Determinar qualquer outra coisa resulta num erro. Mas mesmo assim, recebemos uma mensagem de uso bastante útil, também de graça.

source: Introducing Positional arguments
pt_br: Apresentando os argumentos posicionais

source: An example::
pt_br: Um exemplo::

source: And running the code:
pt_br: E executando o código:

source: Here is what's happening:
pt_br: Aqui está o que acontecerá:

source: We've added the :meth:`~ArgumentParser.add_argument` method, which is what we use to specify which command-line options the program is willing to accept. In this case, I've named it ``echo`` so that it's in line with its function.
pt_br: Nós adicionamos o método :meth:`~ArgumentParser.add_argument`, cujo o mesmo usamos para especificar quais opções de linha de comando o programa está disposto a aceitar. Neste caso, eu o nomeei ``echo`` para que ele esteja de acordo com sua função.

source: Calling our program now requires us to specify an option.
pt_br: Chamar o nosso programa neste momento, requer a especificação de uma opção.

source: The :meth:`~ArgumentParser.parse_args` method actually returns some data from the options specified, in this case, ``echo``.
pt_br: O método :meth:`~ArgumentParser.parse_args` realmente retorna alguns dados das opções especificadas, neste caso, ``echo``.

source: The variable is some form of 'magic' that :mod:`argparse` performs for free (i.e. no need to specify which variable that value is stored in). You will also notice that its name matches the string argument given to the method, ``echo``.
pt_br: A variável é uma forma de "mágica" que :mod:`argparse` executa de brinde (ou seja, não é necessário especificar em qual variável esse valor é armazenado). Você também notará que seu nome corresponde ao argumento string dado ao método, ``echo``.

source: Note however that, although the help display looks nice and all, it currently is not as helpful as it can be. For example we see that we got ``echo`` as a positional argument, but we don't know what it does, other than by guessing or by reading the source code. So, let's make it a bit more useful::
pt_br: Observe, no entanto, que, embora a tela de ajuda pareça boa e tudo, atualmente não é tão útil quanto poderia ser. Por exemplo, vemos que temos ``echo`` como um argumento posicional, mas não sabemos o que ele faz, além de adivinhar ou ler o código-fonte. Então, vamos torná-lo um pouco mais útil::

source: And we get:
pt_br: E, iremos obter:

source: Now, how about doing something even more useful::
pt_br: Agora, que tal fazer algo ainda mais útil::

source: That didn't go so well. That's because :mod:`argparse` treats the options we give it as strings, unless we tell it otherwise. So, let's tell :mod:`argparse` to treat that input as an integer::
pt_br: Isso não correu tão bem. Isso porque :mod:`argparse` trata as opções que damos a ele como strings, a menos que digamos o contrário. Então, vamos dizer ao :mod:`argparse` para tratar essa entrada como um inteiro::

source: That went well. The program now even helpfully quits on bad illegal input before proceeding.
pt_br: Correu bem. O programa agora até fecha com ajuda de entrada ilegal ruim antes de prosseguir.

source: Introducing Optional arguments
pt_br: Apresentando os argumentos opcionais

source: So far we have been playing with positional arguments. Let us have a look on how to add optional ones::
pt_br: Até agora, jogamos com argumentos posicionais. Vamos dar uma olhada em como adicionar opcionais::

source: And the output:
pt_br: E a saída:

source: The program is written so as to display something when ``--verbosity`` is specified and display nothing when not.
pt_br: O programa é escrito de forma a exibir algo quando ``--verbosity`` é especificado e não exibir nada quando não for.

source: To show that the option is actually optional, there is no error when running the program without it. Note that by default, if an optional argument isn't used, the relevant variable, in this case ``args.verbosity``, is given ``None`` as a value, which is the reason it fails the truth test of the :keyword:`if` statement.
pt_br: Para mostrar que a opção é realmente opcional, não há erro ao executar o programa sem ela. Observe que, por padrão, se um argumento opcional não for usado, a variável relevante, neste caso ``args.verbosity``, recebe ``None`` como valor, razão pela qual falha no teste de verdade da instrução :keyword:`if`.

source: The help message is a bit different.
pt_br: A mensagem de ajuda é um pouco diferente.

source: When using the ``--verbosity`` option, one must also specify some value, any value.
pt_br: Ao usar a opção ``--verbosity``, deve-se também especificar algum valor, qualquer valor.

source: The above example accepts arbitrary integer values for ``--verbosity``, but for our simple program, only two values are actually useful, ``True`` or ``False``. Let's modify the code accordingly::
pt_br: O exemplo acima aceita valores inteiros arbitrários para ``--verbosity``, mas para nosso programa simples, apenas dois valores são realmente úteis, ``True`` ou ``False``. Vamos modificar o código de acordo::

source: The option is now more of a flag than something that requires a value. We even changed the name of the option to match that idea. Note that we now specify a new keyword, ``action``, and give it the value ``"store_true"``. This means that, if the option is specified, assign the value ``True`` to ``args.verbose``. Not specifying it implies ``False``.
pt_br: A opção agora é mais um sinalizador do que algo que requer um valor. Até mudamos o nome da opção para corresponder a essa ideia. Observe que agora especificamos uma nova palavra reservada, ``action``, e damos a ela o valor ``"store_true"``. Isso significa que, se a opção for especificada, atribui o valor ``True`` para ``args.verbose``. Não especificá-la implica em ``False``.

source: It complains when you specify a value, in true spirit of what flags actually are.
pt_br: Ele reclama quando você especifica um valor, no verdadeiro espírito do que os sinalizadores realmente são.

source: Notice the different help text.
pt_br: Observe o texto de ajuda diferente.

source: Short options
pt_br: Opções curtas

source: If you are familiar with command line usage, you will notice that I haven't yet touched on the topic of short versions of the options. It's quite simple::
pt_br: Se você estiver familiarizado com o uso da linha de comando, notará que ainda não toquei no tópico das versões curtas das opções. É bem simples::

source: And here goes:
pt_br: E aqui vai:

source: Note that the new ability is also reflected in the help text.
pt_br: Observe que a nova habilidade também é refletida no texto de ajuda.

source: Combining Positional and Optional arguments
pt_br: Combinando argumentos posicionais e opcionais

source: Our program keeps growing in complexity::
pt_br: Nosso programa continua crescendo em complexidade::

source: And now the output:
pt_br: E agora a saída:

source: We've brought back a positional argument, hence the complaint.
pt_br: Trouxemos de volta um argumento posicional, daí a reclamação.

source: Note that the order does not matter.
pt_br: Observe que a ordem não importa.

source: How about we give this program of ours back the ability to have multiple verbosity values, and actually get to use them::
pt_br: Que tal devolvermos a este nosso programa a capacidade de ter vários valores de verbosidade e realmente usá-los::

source: These all look good except the last one, which exposes a bug in our program. Let's fix it by restricting the values the ``--verbosity`` option can accept::
pt_br: Todos eles parecem bons, exceto o último, que expõe um bug em nosso programa. Vamos corrigi-lo restringindo os valores que a opção ``--verbosity`` pode aceitar::

source: Note that the change also reflects both in the error message as well as the help string.
pt_br: Observe que a alteração também reflete tanto na mensagem de erro quanto na string de ajuda.

source: Now, let's use a different approach of playing with verbosity, which is pretty common. It also matches the way the CPython executable handles its own verbosity argument (check the output of ``python --help``)::
pt_br: Agora, vamos usar uma abordagem diferente de brincar com a verbosidade, que é bastante comum. Ele também corresponde à maneira como o executável do CPython trata seu próprio argumento de verbosidade (verifique a saída de ``python --help``)::

source: We have introduced another action, "count", to count the number of occurrences of specific options.
pt_br: Introduzimos outra ação, "contar", para contar o número de ocorrências de opções específicas.

source: Yes, it's now more of a flag (similar to ``action="store_true"``) in the previous version of our script. That should explain the complaint.
pt_br: Sim, agora é mais um sinalizador (semelhante a ``action="store_true"``) na versão anterior do nosso script. Isso deve explicar a reclamação.

source: It also behaves similar to "store_true" action.
pt_br: Ele também se comporta de maneira semelhante à ação "store_true".

source: Now here's a demonstration of what the "count" action gives. You've probably seen this sort of usage before.
pt_br: Agora aqui está uma demonstração do que a ação "contar" oferece. Você provavelmente já viu esse tipo de uso antes.

source: And if you don't specify the ``-v`` flag, that flag is considered to have ``None`` value.
pt_br: E se você não especificar o sinalizador ``-v``, esse sinalizador será considerado como tendo valor ``None``.

source: As should be expected, specifying the long form of the flag, we should get the same output.
pt_br: Como deve ser esperado, especificando a forma longa do sinalizador, devemos obter a mesma saída.

source: Sadly, our help output isn't very informative on the new ability our script has acquired, but that can always be fixed by improving the documentation for our script (e.g. via the ``help`` keyword argument).
pt_br: Infelizmente, nossa saída de ajuda não é muito informativa sobre a nova habilidade que nosso script adquiriu, mas isso sempre pode ser corrigido melhorando a documentação de nosso script (por exemplo, através do argumento nomeado ``help``).

source: That last output exposes a bug in our program.
pt_br: Essa última saída expõe um bug em nosso programa.

source: Let's fix::
pt_br: Vamos corrigir::

source: And this is what it gives:
pt_br: E isso aqui é o mesmo retorna:

source: First output went well, and fixes the bug we had before. That is, we want any value >= 2 to be as verbose as possible.
pt_br: A primeira saída correu bem e corrige o bug que tínhamos antes. Ou seja, queremos que qualquer valor >= 2 seja o mais detalhado possível.

source: Third output not so good.
pt_br: A terceira saída não está tão boa.

source: Let's fix that bug::
pt_br: Vamos corrigir esse bug::

source: We've just introduced yet another keyword, ``default``. We've set it to ``0`` in order to make it comparable to the other int values. Remember that by default, if an optional argument isn't specified, it gets the ``None`` value, and that cannot be compared to an int value (hence the :exc:`TypeError` exception).
pt_br: Acabamos de introduzir outra palavra reservada, ``default``. Nós o configuramos como ``0`` para torná-lo comparável aos outros valores int. Lembre-se que por padrão, se um argumento opcional não for especificado, ele obtém o valor ``None``, e isso não pode ser comparado a um valor int (daí a exceção :exc:`TypeError`).

source: And:
pt_br: E:

source: You can go quite far just with what we've learned so far, and we have only scratched the surface. The :mod:`argparse` module is very powerful, and we'll explore a bit more of it before we end this tutorial.
pt_br: Você pode ir muito longe apenas com o que aprendemos até agora, e nós apenas arranhamos a superfície. O módulo :mod:`argparse` é muito poderoso, e vamos explorar um pouco mais antes de terminar este tutorial.

source: Getting a little more advanced
pt_br: Avançando um pouco mais

source: What if we wanted to expand our tiny program to perform other powers, not just squares::
pt_br: E se quiséssemos expandir nosso pequeno programa, ampliando seu potencial::

source: Output:
pt_br: Saída:

source: Notice that so far we've been using verbosity level to *change* the text that gets displayed. The following example instead uses verbosity level to display *more* text instead::
pt_br: Observe que até agora estamos usando o nível de verbosidade para *alterar* o texto que é exibido. O exemplo a seguir usa o nível de verbosidade para exibir *mais* texto::

source: Specifying ambiguous arguments
pt_br: Especificando argumentos ambíguos

source: When there is ambiguity in deciding whether an argument is positional or for an argument, ``--`` can be used to tell :meth:`~ArgumentParser.parse_args` that everything after that is a positional argument::
pt_br: Quando há ambiguidade em decidir se um argumento é posicional ou para um argumento, ``--`` pode ser usado para dizer :meth:`~ArgumentParser.parse_args` que tudo depois disso é um argumento posicional::

source: Conflicting options
pt_br: Opções conflitantes

source: So far, we have been working with two methods of an :class:`argparse.ArgumentParser` instance. Let's introduce a third one, :meth:`~ArgumentParser.add_mutually_exclusive_group`. It allows for us to specify options that conflict with each other. Let's also change the rest of the program so that the new functionality makes more sense: we'll introduce the ``--quiet`` option, which will be the opposite of the ``--verbose`` one::
pt_br: Até agora, trabalhamos com dois métodos de uma instância :class:`argparse.ArgumentParser`. Vamos apresentar um terceiro, :meth:`~ArgumentParser.add_mutually_exclusive_group`. Ele nos permite especificar opções que entram em conflito umas com as outras. Vamos também alterar o resto do programa para que a nova funcionalidade faça mais sentido: vamos introduzir a opção ``--quiet``, que será o oposto da opção ``--verbose``::

source: Our program is now simpler, and we've lost some functionality for the sake of demonstration. Anyways, here's the output:
pt_br: Nosso programa agora está mais simples e perdemos algumas funcionalidades para demonstração. De qualquer forma, aqui está a saída:

source: That should be easy to follow. I've added that last output so you can see the sort of flexibility you get, i.e. mixing long form options with short form ones.
pt_br: Isso deve ser fácil de seguir. Eu adicionei essa última saída para que você possa ver o tipo de flexibilidade que obtém, ou seja, misturar opções de formato longo com formatos curtos.

source: Before we conclude, you probably want to tell your users the main purpose of your program, just in case they don't know::
pt_br: Antes de concluirmos, você provavelmente quer dizer aos seus usuários o propósito principal do seu programa, caso eles não saibam::

source: Note that slight difference in the usage text. Note the ``[-v | -q]``, which tells us that we can either use ``-v`` or ``-q``, but not both at the same time:
pt_br: Observe essa pequena diferença no texto de uso. Observe o ``[-v | -q]``, que nos diz que podemos usar ``-v`` ou ``-q``, mas não ambos ao mesmo tempo:

source: How to translate the argparse output
pt_br: Como traduzir a saída do argparse

source: The output of the :mod:`argparse` module such as its help text and error messages are all made translatable using the :mod:`gettext` module. This allows applications to easily localize messages produced by :mod:`argparse`. See also :ref:`i18n-howto`.
pt_br: A saída do módulo :mod:`argparse`, como seu texto de ajuda e mensagens de erro, são todos traduzidos usando o módulo :mod:`gettext`. Isso permite que os aplicativos localizem facilmente as mensagens produzidas por :mod:`argparse`. Veja também :ref:`i18n-howto`.

source: For instance, in this :mod:`argparse` output:
pt_br: Por exemplo, nesta saída :mod:`argparse`:

source: The strings ``usage:``, ``positional arguments:``, ``options:`` and ``show this help message and exit`` are all translatable.
pt_br: As strings ``usage:``, ``positional arguments:``, ``options:`` e ``show this help message and exit`` são todos traduzíveis.

source: In order to translate these strings, they must first be extracted into a ``.po`` file. For example, using `Babel <https://babel.pocoo.org/>`__, run this command:
pt_br: Para traduzir essas strings, elas devem primeiro ser extraídas em um arquivo ``.po``. Por exemplo, usando `Babel <https://babel.pocoo.org/>`__, execute este comando:
