Repository: python/python-docs-pt-br
Catalog: howto/argparse.po
Languages: pt_br

source: This command will extract all translatable strings from the :mod:`argparse` module and output them into a file named ``messages.po``. This command assumes that your Python installation is in ``/usr/lib``.
pt_br: Este comando extrairá todas as strings traduzíveis do módulo :mod:`argparse` e as enviará para um arquivo chamado ``messages.po``. Este comando presume que sua instalação do Python está em ``/usr/lib``.

source: You can find out the location of the :mod:`argparse` module on your system using this script::
pt_br: Você pode descobrir a localização do módulo :mod:`argparse` em seu sistema usando este script::

source: Once the messages in the ``.po`` file are translated and the translations are installed using :mod:`gettext`, :mod:`argparse` will be able to display the translated messages.
pt_br: Uma vez que as mensagens no arquivo ``.po`` sejam traduzidas e as traduções instaladas usando :mod:`gettext`, :mod:`argparse` será capaz de exibir as mensagens traduzidas.

source: To translate your own strings in the :mod:`argparse` output, use :mod:`gettext`.
pt_br: Para traduzir suas próprias strings na saída :mod:`argparse`, use :mod:`gettext`.

source: Custom type converters
pt_br: Conversores de tipo personalizados

source: The :mod:`argparse` module allows you to specify custom type converters for your command-line arguments. This allows you to modify user input before it's stored in the :class:`argparse.Namespace`. This can be useful when you need to pre-process the input before it is used in your program.
pt_br: O módulo :mod:`argparse` permite que você especifique conversores de tipo personalizados para seus argumentos de linha de comando. Isso permite modificar a entrada de usuário antes de armazená-la na :class:`argparse.Namespace`. Isso pode ser útil quando você precisa pré-processar a entrada antes dela ser usada em seu programa.

source: When using a custom type converter, you can use any callable that takes a single string argument (the argument value) and returns the converted value. However, if you need to handle more complex scenarios, you can use a custom action class with the **action** parameter instead.
pt_br: Ao usar um conversor de tipo personalizado, você pode usar qualquer chamável que recebe uma única string como argumento (o valor do argumento) e retorna o valor convertido. Porém, se você precisa tratar de cenários mais complexos, você pode usar uma classe de ação personalizada com o parâmetro **action**.

source: For example, let's say you want to handle arguments with different prefixes and process them accordingly::
pt_br: Por exemplo, digamos que vcoê deseja tratar de argumentos com diferentes prefixos e processá-los adequadamente::

source: $ python prog.py -a value1 +a value2 Namespace(a=[('-', 'value1'), ('+', 'value2')])
pt_br: $ python prog.py -a valor1 +a valor2 Namespace(a=[('-', 'valor1'), ('+', 'valor2')])

source: In this example, we:
pt_br: Neste exemplos, nós:

source: Created a parser with custom prefix characters using the ``prefix_chars`` parameter.
pt_br: Criamos um analisador sintático com caracteres de prefixo personalizado usando parâmetro ``prefix_chars``.

source: Defined two arguments, ``-a`` and ``+a``, which used the ``type`` parameter to create custom type converters to store the value in a tuple with the prefix.
pt_br: Definimos dois argumentos, ``-a`` e ``+a``, que usaram o parâmetro ``type`` para criar conversores de tipo personalizados para armazenar o valor em uma tupla com o prefixo.

source: Without the custom type converters, the arguments would have treated the ``-a`` and ``+a`` as the same argument, which would have been undesirable. By using custom type converters, we were able to differentiate between the two arguments.
pt_br: Sem os conversores de tipo personalizados, os argumentos tratariam ``-a`` e ``+a`` como o mesmo argumento, o que não era o desejado. Ao usar conversores de tipo personalizados, conseguimos diferenciar entre dois argumentos.

source: Conclusion
pt_br: Conclusão

source: The :mod:`argparse` module offers a lot more than shown here. Its docs are quite detailed and thorough, and full of examples. Having gone through this tutorial, you should easily digest them without feeling overwhelmed.
pt_br: O módulo :mod:`argparse` oferece muito mais do que o mostrado aqui. Sua documentação é bastante detalhada e completo, e cheia de exemplos. Tendo passado por este tutorial, você deve digeri-la facilmente sem se sentir sobrecarregado.
