Repository: python/python-docs-pt-br
Catalog: howto/clinic.po
Languages: pt_br

source: All arguments to Argument Clinic converters are keyword-only. All Argument Clinic converters accept the following arguments:
pt_br: Усі аргументи для конвертерів Argument Clinic є лише ключовими словами. Усі конвертери Argument Clinic приймають такі аргументи:

source: The default value for this parameter when defined in C. Specifically, this will be the initializer for the variable declared in the "parse function". See :ref:`the section on default values <default_values>` for how to use this. Specified as a string.
pt_br: Значення за замовчуванням для цього параметра, коли його визначено в C. Зокрема, це буде ініціалізатор для змінної, оголошеної у "функції аналізу". Перегляньте :ref:`розділ про значення за замовчуванням <default_values>`, щоб дізнатися, як це використовувати. Задається як рядок.

source: The annotation value for this parameter. Not currently supported, because :pep:`8` mandates that the Python library may not use annotations.
pt_br: Значення анотації для цього параметра. Наразі не підтримується, оскільки :pep:`8` забороняє бібліотеці Python використовувати анотації.

source: In addition, some converters accept additional arguments. Here is a list of these arguments, along with their meanings:
pt_br: Крім того, деякі конвертери приймають додаткові аргументи. Ось список цих аргументів разом із їхнім значенням:

source: A set of Python types (and possibly pseudo-types); this restricts the allowable Python argument to values of these types. (This is not a general-purpose facility; as a rule it only supports specific lists of types as shown in the legacy converter table.)
pt_br: Набір типів Python (і, можливо, псевдотипів); це обмежує дозволений аргумент Python значеннями цих типів. (Це засіб не є універсальним; як правило, він підтримує лише певні списки типів, як показано в таблиці застарілого конвертера.)

source: To accept ``None``, add ``NoneType`` to this set.
pt_br: Щоб прийняти ``None``, додайте ``NoneType`` до цього набору.

source: Only supported for unsigned integers. The native integer value of this Python argument will be written to the parameter without any range checking, even for negative values.
pt_br: Підтримується лише для цілих чисел без знаку. Власне ціле значення цього аргументу Python буде записано в параметр без будь-якої перевірки діапазону, навіть для від’ємних значень.

source: Only supported by the ``object`` converter. Specifies the name of a :ref:`C "converter function" <o_ampersand>` to use to convert this object to a native type.
pt_br: Підтримується лише конвертером ``object``. Вказує ім’я :ref:`C "функції конвертера" <o_ampersand>` для перетворення цього об’єкта на рідний тип.

source: Only supported for strings. Specifies the encoding to use when converting this string from a Python str (Unicode) value into a C ``char *`` value.
pt_br: Підтримується лише для рядків. Визначає кодування для використання під час перетворення цього рядка зі значення Python str (Unicode) у значення C ``char *``.

source: Only supported for the ``object`` converter. Requires that the Python value be a subclass of a Python type, as expressed in C.
pt_br: Підтримується лише для конвертера ``object``. Вимагає, щоб значення Python було підкласом типу Python, як виражено в C.

source: Only supported for the ``object`` and ``self`` converters. Specifies the C type that will be used to declare the variable. Default value is ``"PyObject *"``.
pt_br: Підтримується лише для конвертерів ``object`` і ``self``. Визначає тип C, який використовуватиметься для оголошення змінної. Значення за замовчуванням – ``"PyObject *"``.

source: Only supported for strings. If true, embedded NUL bytes (``'\\0'``) are permitted inside the value. The length of the string will be passed in to the impl function, just after the string parameter, as a parameter named ``<parameter_name>_length``.
pt_br: Підтримується лише для рядків. Якщо встановлено значення true, вбудовані байти NUL (``'\\0'``) дозволені всередині значення. Довжину рядка буде передано у функцію impl одразу після параметра string як параметр із назвою ``<parameter_name> _length``.

source: Please note, not every possible combination of arguments will work. Usually these arguments are implemented by specific ``PyArg_ParseTuple`` *format units*, with specific behavior. For example, currently you cannot call ``unsigned_short`` without also specifying ``bitwise=True``. Although it's perfectly reasonable to think this would work, these semantics don't map to any existing format unit. So Argument Clinic doesn't support it. (Or, at least, not yet.)
pt_br: Зауважте, що не кожна можлива комбінація аргументів буде працювати. Зазвичай ці аргументи реалізуються спеціальними ``PyArg_ParseTuple`` *одиницями формату* з певною поведінкою. Наприклад, зараз ви не можете викликати ``unsigned_short``, не вказавши також ``bitwise=True``. Хоча це цілком розумно вважати, що це спрацює, ця семантика не відображається на жодну існуючу одиницю формату. Тому клініка "Аргумент" не підтримує. (Або, принаймні, ще ні.)

source: Below is a table showing the mapping of legacy converters into real Argument Clinic converters. On the left is the legacy converter, on the right is the text you'd replace it with.
pt_br: Нижче наведено таблицю, яка показує відображення застарілих конвертерів у справжні конвертери Argument Clinic. Ліворуч — застарілий конвертер, праворуч — текст, яким його потрібно замінити.

source: As an example, here's our sample ``pickle.Pickler.dump`` using the proper converter::
pt_br: Як приклад, ось наш зразок ``pickle.Pickler.dump`` з використанням належного конвертера::

source: One advantage of real converters is that they're more flexible than legacy converters. For example, the ``unsigned_int`` converter (and all the ``unsigned_`` converters) can be specified without ``bitwise=True``. Their default behavior performs range checking on the value, and they won't accept negative numbers. You just can't do that with a legacy converter!
pt_br: Однією з переваг справжніх конвертерів є те, що вони більш гнучкі, ніж застарілі конвертери. Наприклад, конвертер ``unsigned_int`` (і всі ``unsigned_`` перетворювачі) можна вказати без ``bitwise=True``. Їх поведінка за умовчанням виконує перевірку діапазону значення, і вони не приймають від’ємні числа. Ви просто не можете зробити це за допомогою застарілого конвертера!

source: Argument Clinic will show you all the converters it has available. For each converter it'll show you all the parameters it accepts, along with the default value for each parameter. Just run ``Tools/clinic/clinic.py --converters`` to see the full list.
pt_br: Argument Clinic покаже вам усі доступні конвертери. Для кожного конвертера буде показано всі параметри, які він приймає, а також значення за замовчуванням для кожного параметра. Просто запустіть ``Tools/clinic/clinic.py --converters``, щоб переглянути повний список.

source: When using the ``Py_buffer`` converter (or the ``'s*'``, ``'w*'``, ``'*y'``, or ``'z*'`` legacy converters), you *must* not call :c:func:`PyBuffer_Release` on the provided buffer. Argument Clinic generates code that does it for you (in the parsing function).
pt_br: При використанні конвертера ``Py_buffer`` (або ``'s*'``, ``'w*'``, ``'*y'`` або ``'z*'`` застарілих конвертерів ), ви *не повинні* викликати :c:func:`PyBuffer_Release` у наданому буфері. Argument Clinic генерує код, який робить це за вас (у функції аналізу).

source: Advanced converters
pt_br: Розширені конвертери

source: Remember those format units you skipped for your first time because they were advanced? Here's how to handle those too.
pt_br: Пам’ятаєте ті форматні одиниці, які ви пропустили вперше, оскільки вони були просунутими? Ось як впоратися з ними.

source: The trick is, all those format units take arguments—either conversion functions, or types, or strings specifying an encoding. (But "legacy converters" don't support arguments. That's why we skipped them for your first function.) The argument you specified to the format unit is now an argument to the converter; this argument is either ``converter`` (for ``O&``), ``subclass_of`` (for ``O!``), or ``encoding`` (for all the format units that start with ``e``).
pt_br: Хитрість полягає в тому, що всі ці одиниці формату приймають аргументи — або функції перетворення, або типи, або рядки, що визначають кодування. (Але "застарілі конвертери" не підтримують аргументи. Ось чому ми пропустили їх для вашої першої функції.) Аргумент, який ви вказали для одиниці формату, тепер є аргументом для конвертера; цей аргумент або ``конвертер`` (для ``O&``), ``subclass_of`` (для ``O!``), або ``encoding`` (для всіх одиниць формату, які починаються з ``e``).

source: When using ``subclass_of``, you may also want to use the other custom argument for ``object()``: ``type``, which lets you set the type actually used for the parameter. For example, if you want to ensure that the object is a subclass of ``PyUnicode_Type``, you probably want to use the converter ``object(type='PyUnicodeObject *', subclass_of='&PyUnicode_Type')``.
pt_br: Використовуючи ``subclass_of``, ви також можете використати інший спеціальний аргумент для ``object()``: ``type``, який дозволяє встановити тип, який фактично використовується для параметра. Наприклад, якщо ви хочете переконатися, що об’єкт є підкласом ``PyUnicode_Type``, можливо, ви захочете використати конвертер ``object(type='PyUnicodeObject *', subclass_of='&PyUnicode_Type')``.

source: One possible problem with using Argument Clinic: it takes away some possible flexibility for the format units starting with ``e``. When writing a ``PyArg_Parse`` call by hand, you could theoretically decide at runtime what encoding string to pass in to :c:func:`PyArg_ParseTuple`. But now this string must be hard-coded at Argument-Clinic-preprocessing-time. This limitation is deliberate; it made supporting this format unit much easier, and may allow for future optimizations. This restriction doesn't seem unreasonable; CPython itself always passes in static hard-coded encoding strings for parameters whose format units start with ``e``.
pt_br: Одна з можливих проблем із використанням Argument Clinic: це позбавляє можливої гнучкості одиниць формату, що починаються з ``e``. Під час написання виклику ``PyArg_Parse`` вручну, ви теоретично можете вирішити під час виконання, який рядок кодування передати в :c:func:`PyArg_ParseTuple`. Але тепер цей рядок має бути жорстко закодований під час попередньої обробки аргументів-клініки. Це обмеження є навмисним; це значно полегшило підтримку цього блоку формату та, можливо, дозволить оптимізувати його в майбутньому. Це обмеження не здається безпідставним; Сам CPython завжди передає статичні жорстко закодовані рядки для параметрів, одиниці формату яких починаються з ``e``.

source: Parameter default values
pt_br: Значення параметрів за замовчуванням

source: Default values for parameters can be any of a number of values. At their simplest, they can be string, int, or float literals:
pt_br: Значення за замовчуванням для параметрів можуть бути будь-якими з кількох значень. У найпростішому вигляді вони можуть бути рядковими, цілими або плаваючими літералами:

source: They can also use any of Python's built-in constants:
pt_br: Вони також можуть використовувати будь-які вбудовані константи Python:

source: There's also special support for a default value of ``NULL``, and for simple expressions, documented in the following sections.
pt_br: Існує також спеціальна підтримка значення за замовчуванням ``NULL`` і простих виразів, задокументованих у наступних розділах.

source: The ``NULL`` default value
pt_br: Значення за замовчуванням ``NULL``

source: For string and object parameters, you can set them to ``None`` to indicate that there's no default. However, that means the C variable will be initialized to ``Py_None``. For convenience's sakes, there's a special value called ``NULL`` for just this reason: from Python's perspective it behaves like a default value of ``None``, but the C variable is initialized with ``NULL``.
pt_br: Для параметрів рядка та об’єкта ви можете встановити для них значення ``None``, щоб вказати, що за замовчуванням немає. Однак це означає, що змінна C буде ініціалізована як ``Py_None``. Для зручності існує спеціальне значення під назвою ``NULL`` саме з цієї причини: з точки зору Python воно поводиться як значення за замовчуванням ``None``, але змінна C ініціалізується ``NULL``.

source: Expressions specified as default values
pt_br: Вирази, указані як значення за замовчуванням

source: The default value for a parameter can be more than just a literal value. It can be an entire expression, using math operators and looking up attributes on objects. However, this support isn't exactly simple, because of some non-obvious semantics.
pt_br: Значення за замовчуванням для параметра може бути не просто літеральним значенням. Це може бути цілий вираз із використанням математичних операторів і пошуком атрибутів об’єктів. Однак ця підтримка не зовсім проста через деяку неочевидну семантику.

source: Consider the following example:
pt_br: Розглянемо такий приклад:

source: ``sys.maxsize`` can have different values on different platforms. Therefore Argument Clinic can't simply evaluate that expression locally and hard-code it in C. So it stores the default in such a way that it will get evaluated at runtime, when the user asks for the function's signature.
pt_br: ``sys.maxsize`` може мати різні значення на різних платформах. Тому Argument Clinic не може просто оцінити цей вираз локально та жорстко закодувати його в C. Тому він зберігає значення за замовчуванням таким чином, що воно буде оцінено під час виконання, коли користувач запитує підпис функції.

source: What namespace is available when the expression is evaluated? It's evaluated in the context of the module the builtin came from. So, if your module has an attribute called "``max_widgets``", you may simply use it:
pt_br: Який простір імен доступний під час обчислення виразу? Він оцінюється в контексті модуля, з якого походить вбудований модуль. Отже, якщо ваш модуль має атрибут під назвою "``max_widgets``, ви можете просто використовувати його:

source: If the symbol isn't found in the current module, it fails over to looking in ``sys.modules``. That's how it can find ``sys.maxsize`` for example. (Since you don't know in advance what modules the user will load into their interpreter, it's best to restrict yourself to modules that are preloaded by Python itself.)
pt_br: Якщо символ не знайдено в поточному модулі, він переходить до пошуку в ``sys.modules``. Ось як він може знайти, наприклад, ``sys.maxsize``. (Оскільки ви заздалегідь не знаєте, які модулі користувач завантажить у свій інтерпретатор, найкраще обмежитися модулями, попередньо завантаженими самим Python.)

source: Evaluating default values only at runtime means Argument Clinic can't compute the correct equivalent C default value. So you need to tell it explicitly. When you use an expression, you must also specify the equivalent expression in C, using the ``c_default`` parameter to the converter:
pt_br: Оцінка значень за замовчуванням лише під час виконання означає, що Argument Clinic не може обчислити правильне еквівалентне значення за замовчуванням C. Тому вам потрібно сказати це прямо. Коли ви використовуєте вираз, ви також повинні вказати еквівалентний вираз у C, використовуючи параметр ``c_default`` для конвертера:

source: Another complication: Argument Clinic can't know in advance whether or not the expression you supply is valid. It parses it to make sure it looks legal, but it can't *actually* know. You must be very careful when using expressions to specify values that are guaranteed to be valid at runtime!
pt_br: Інша складність: Argument Clinic не може заздалегідь знати, чи дійсний вираз, який ви надаєте. Він аналізує його, щоб переконатися, що він виглядає законним, але він не може *насправді* знати. Ви повинні бути дуже обережними, використовуючи вирази для визначення значень, які гарантовано будуть дійсними під час виконання!

source: Finally, because expressions must be representable as static C values, there are many restrictions on legal expressions. Here's a list of Python features you're not permitted to use:
pt_br: Нарешті, оскільки вирази повинні бути представлені як статичні значення C, існує багато обмежень на юридичні вирази. Ось список функцій Python, які вам заборонено використовувати:

source: Function calls.
pt_br: Виклики функцій.

source: Inline if statements (``3 if foo else 5``).
pt_br: Вбудовані оператори if (``3 if foo else 5``).

source: Automatic sequence unpacking (``*[1, 2, 3]``).
pt_br: Автоматичне розпакування послідовності (``*[1, 2, 3]``).

source: List/set/dict comprehensions and generator expressions.
pt_br: Розуміння списку/набору/диктів і вирази генератора.

source: Tuple/list/set/dict literals.
pt_br: Літерали кортеж/список/набір/дикт.

source: Using a return converter
pt_br: Використання зворотного перетворювача

source: By default the impl function Argument Clinic generates for you returns ``PyObject *``. But your C function often computes some C type, then converts it into the ``PyObject *`` at the last moment. Argument Clinic handles converting your inputs from Python types into native C types—why not have it convert your return value from a native C type into a Python type too?
pt_br: За замовчуванням функція impl Argument Clinic генерує для вас повернення ``PyObject *``. Але ваша функція C часто обчислює певний тип C, а потім в останній момент перетворює його на ``PyObject *``. Argument Clinic перетворює ваші вхідні дані з типів Python у власні типи C — чому б їй не перетворити ваше повертане значення з рідного типу C у тип Python?

source: That's what a "return converter" does. It changes your impl function to return some C type, then adds code to the generated (non-impl) function to handle converting that value into the appropriate ``PyObject *``.
pt_br: Ось що робить "конвертер повернення". Він змінює вашу функцію impl, щоб повернути деякий тип C, а потім додає код до згенерованої (не impl) функції для обробки перетворення цього значення у відповідний ``PyObject *``.

source: The syntax for return converters is similar to that of parameter converters. You specify the return converter like it was a return annotation on the function itself. Return converters behave much the same as parameter converters; they take arguments, the arguments are all keyword-only, and if you're not changing any of the default arguments you can omit the parentheses.
pt_br: Синтаксис конвертерів повернення подібний до синтаксису конвертерів параметрів. Ви вказуєте конвертер повернення так, ніби це анотація повернення до самої функції. Перетворювачі повернення поводяться майже так само, як перетворювачі параметрів; вони приймають аргументи, усі аргументи є лише ключовими словами, і якщо ви не змінюєте жоден із стандартних аргументів, ви можете опустити дужки.

source: (If you use both ``"as"`` *and* a return converter for your function, the ``"as"`` should come before the return converter.)
pt_br: (Якщо ви використовуєте як ``"as"`` *, так і* перетворювач повернення для вашої функції, ``"as"`` має стояти перед перетворювачем повернення.)

source: There's one additional complication when using return converters: how do you indicate an error has occurred? Normally, a function returns a valid (non-``NULL``) pointer for success, and ``NULL`` for failure. But if you use an integer return converter, all integers are valid. How can Argument Clinic detect an error? Its solution: each return converter implicitly looks for a special value that indicates an error. If you return that value, and an error has been set (``PyErr_Occurred()`` returns a true value), then the generated code will propagate the error. Otherwise it will encode the value you return like normal.
pt_br: Є одна додаткова складність під час використання конвертерів повернення: як вказати, що сталася помилка? Зазвичай функція повертає дійсний (не ``NULL``) вказівник для успіху та ``NULL`` для помилки. Але якщо ви використовуєте конвертер повернення цілих чисел, усі цілі числа є дійсними. Як Клініка Аргумент може виявити помилку? Його рішення: кожен конвертер повернення неявно шукає спеціальне значення, яке вказує на помилку. Якщо ви повертаєте це значення, і було встановлено помилку (``PyErr_Occurred()`` повертає справжнє значення), тоді згенерований код поширить помилку. В іншому випадку він кодуватиме значення, яке ви повертаєте, як зазвичай.

source: Currently Argument Clinic supports only a few return converters:
pt_br: Наразі Argument Clinic підтримує лише кілька конвертерів повернення:

source: None of these take parameters. For the first three, return -1 to indicate error. For ``DecodeFSDefault``, the return type is ``const char *``; return a ``NULL`` pointer to indicate an error.
pt_br: Жоден із них не приймає параметрів. Для перших трьох поверніть -1, щоб вказати помилку. Для ``DecodeFSDefault`` типом повернення є ``const char *``; повертає вказівник ``NULL`` для вказівки на помилку.

source: (There's also an experimental ``NoneType`` converter, which lets you return ``Py_None`` on success or ``NULL`` on failure, without having to increment the reference count on ``Py_None``. I'm not sure it adds enough clarity to be worth using.)
pt_br: (Існує також експериментальний конвертер ``NoneType``, який дозволяє повертати ``Py_None`` у разі успіху або ``NULL`` у разі невдачі, без необхідності збільшення кількості посилань на ``Py_None``. Я не впевнений, що це додає достатньо ясності, щоб його було варто використовувати.)

source: To see all the return converters Argument Clinic supports, along with their parameters (if any), just run ``Tools/clinic/clinic.py --converters`` for the full list.
pt_br: Щоб побачити всі конвертери повернення, які підтримує Argument Clinic, разом із їхніми параметрами (якщо такі є), просто запустіть ``Tools/clinic/clinic.py --converters`` для повного списку.

source: Cloning existing functions
pt_br: Клонування існуючих функцій

source: If you have a number of functions that look similar, you may be able to use Clinic's "clone" feature. When you clone an existing function, you reuse:
pt_br: Якщо у вас є декілька функцій, які виглядають схожими, ви можете скористатися функцією "клонування" Clinic. Коли ви клонуєте наявну функцію, ви повторно використовуєте:

source: its parameters, including
pt_br: його параметри, в т.ч

source: their names,
pt_br: їхні імена,

source: their converters, with all parameters,
pt_br: їхні конвертери з усіма параметрами,

source: their default values,
pt_br: їхні значення за замовчуванням,

source: their per-parameter docstrings,
pt_br: їхні рядки документації для кожного параметра,

source: their *kind* (whether they're positional only, positional or keyword, or keyword only), and
pt_br: їх *вид* (незалежно від того, чи є вони лише позиційними, позиційними чи ключовими словами чи лише ключовими словами) та

source: its return converter.
pt_br: його зворотний перетворювач.

source: The only thing not copied from the original function is its docstring; the syntax allows you to specify a new docstring.
pt_br: Єдине, що не скопійовано з оригінальної функції, це її рядок документації; синтаксис дозволяє вказати новий рядок документації.

source: Here's the syntax for cloning a function::
pt_br: Ось синтаксис для клонування функції::

source: (The functions can be in different modules or classes. I wrote ``module.class`` in the sample just to illustrate that you must use the full path to *both* functions.)
pt_br: (Функції можуть бути в різних модулях або класах. Я написав ``module.class`` у прикладі, щоб проілюструвати, що ви повинні використовувати повний шлях до *обох* функцій.)
