Repository: python/python-docs-pt-br
Catalog: howto/clinic.po
Languages: pt_br

source: Here's how to add a per-parameter docstring. The first line of the per-parameter docstring must be indented further than the parameter definition. The left margin of this first line establishes the left margin for the whole per-parameter docstring; all the text you write will be outdented by this amount. You can write as much text as you like, across multiple lines if you wish.
pt_br: Ось як додати рядок документації для кожного параметра. Перший рядок рядка документації для кожного параметра повинен мати відступ далі, ніж визначення параметра. Ліве поле цього першого рядка встановлює ліве поле для всього рядка документації для кожного параметра; весь написаний вами текст буде зменшено на цю величину. Ви можете написати скільки завгодно тексту в кілька рядків, якщо хочете.

source: Save and close the file, then run ``Tools/clinic/clinic.py`` on it. With luck everything worked---your block now has output, and a ``.c.h`` file has been generated! Reopen the file in your text editor to see::
pt_br: Збережіть і закрийте файл, а потім запустіть над ним ``Tools/clinic/clinic.py``. Якщо пощастило, все спрацювало --- ваш блок тепер має вихід, і файл ``.c.h`` було згенеровано! Знову відкрийте файл у текстовому редакторі, щоб побачити::

source: Obviously, if Argument Clinic didn't produce any output, it's because it found an error in your input. Keep fixing your errors and retrying until Argument Clinic processes your file without complaint.
pt_br: Очевидно, якщо Argument Clinic не дає жодних результатів, це тому, що вона знайшла помилку у вашому введенні. Продовжуйте виправляти свої помилки та повторювати спроби, доки Argument Clinic не обробить ваш файл без скарг.

source: For readability, most of the glue code has been generated to a ``.c.h`` file. You'll need to include that in your original ``.c`` file, typically right after the clinic module block::
pt_br: Для зручності читання більшу частину з’єднувального коду було згенеровано у файлі ``.c.h``. Вам потрібно буде включити це у вихідний файл ``.c``, як правило, одразу після блоку модуля клініки::

source: Double-check that the argument-parsing code Argument Clinic generated looks basically the same as the existing code.
pt_br: Двічі перевірте, чи згенерований Argument Clinic код розбору аргументів виглядає так само, як і існуючий код.

source: First, ensure both places use the same argument-parsing function. The existing code must call either :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords`; ensure that the code generated by Argument Clinic calls the *exact* same function.
pt_br: По-перше, переконайтеся, що обидва місця використовують ту саму функцію розбору аргументів. Існуючий код має викликати :c:func:`PyArg_ParseTuple` або :c:func:`PyArg_ParseTupleAndKeywords`; переконайтеся, що код, згенерований Argument Clinic, викликає *точно* ту саму функцію.

source: Second, the format string passed in to :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords` should be *exactly* the same as the hand-written one in the existing function, up to the colon or semi-colon.
pt_br: По-друге, рядок формату, переданий у :c:func:`PyArg_ParseTuple` або :c:func:`PyArg_ParseTupleAndKeywords`, має бути *точно* таким самим, як написаний від руки в існуючій функції, до двокрапки або напів- товста кишка.

source: (Argument Clinic always generates its format strings with a ``:`` followed by the name of the function. If the existing code's format string ends with ``;``, to provide usage help, this change is harmless—don't worry about it.)
pt_br: (Argument Clinic завжди генерує рядки формату з символом ``:``, за яким слідує назва функції. Якщо рядок формату існуючого коду закінчується на ``;``, щоб надати довідку щодо використання, ця зміна нешкідлива — не хвилюйся про це.)

source: Third, for parameters whose format units require two arguments (like a length variable, or an encoding string, or a pointer to a conversion function), ensure that the second argument is *exactly* the same between the two invocations.
pt_br: По-третє, для параметрів, одиниці формату яких вимагають два аргументи (наприклад, змінна довжини, або рядок кодування, або покажчик на функцію перетворення), переконайтеся, що другий аргумент *точно* однаковий між двома викликами.

source: Fourth, inside the output portion of the block you'll find a preprocessor macro defining the appropriate static :c:type:`PyMethodDef` structure for this builtin::
pt_br: По-четверте, у вихідній частині блоку ви знайдете макрос препроцесора, що визначає відповідну статичну структуру :c:type:`PyMethodDef` для цього вбудованого::

source: This static structure should be *exactly* the same as the existing static :c:type:`PyMethodDef` structure for this builtin.
pt_br: Ця статична структура має бути *точно* такою ж, як існуюча статична структура :c:type:`PyMethodDef` для цієї вбудованої програми.

source: If any of these items differ in *any way*, adjust your Argument Clinic function specification and rerun ``Tools/clinic/clinic.py`` until they *are* the same.
pt_br: Якщо будь-який із цих елементів *будь-яким чином* відрізняється, налаштуйте специфікацію функції Argument Clinic і повторно запускайте ``Tools/clinic/clinic.py``, доки вони *не стануть* однаковими.

source: Notice that the last line of its output is the declaration of your "impl" function. This is where the builtin's implementation goes. Delete the existing prototype of the function you're modifying, but leave the opening curly brace. Now delete its argument parsing code and the declarations of all the variables it dumps the arguments into. Notice how the Python arguments are now arguments to this impl function; if the implementation used different names for these variables, fix it.
pt_br: Зверніть увагу, що останній рядок його виводу є оголошенням вашої функції "impl". Ось де реалізується вбудована програма. Видаліть наявний прототип функції, яку ви змінюєте, але залиште відкриваючу фігурну дужку. Тепер видаліть його код розбору аргументів і оголошення всіх змінних, у які він виводить аргументи. Зверніть увагу, що аргументи Python тепер є аргументами для цієї функції impl; якщо реалізація використовувала різні імена для цих змінних, виправте це.

source: Let's reiterate, just because it's kind of weird. Your code should now look like this::
pt_br: Давайте повторимо, просто тому, що це трохи дивно. Тепер ваш код має виглядати так:

source: Argument Clinic generated the checksum line and the function prototype just above it. You should write the opening (and closing) curly braces for the function, and the implementation inside.
pt_br: Argument Clinic згенерувала рядок контрольної суми та прототип функції прямо над ним. Ви повинні записати відкриваючі (і закриваючі) фігурні дужки для функції та реалізацію всередині.

source: Remember the macro with the :c:type:`PyMethodDef` structure for this function? Find the existing :c:type:`PyMethodDef` structure for this function and replace it with a reference to the macro. (If the builtin is at module scope, this will probably be very near the end of the file; if the builtin is a class method, this will probably be below but relatively near to the implementation.)
pt_br: Пам’ятаєте макрос зі структурою :c:type:`PyMethodDef` для цієї функції? Знайдіть наявну структуру :c:type:`PyMethodDef` для цієї функції та замініть її посиланням на макрос. (Якщо вбудований модуль знаходиться в області видимості модуля, це, ймовірно, буде дуже близько до кінця файлу; якщо вбудований модуль є методом класу, це, ймовірно, буде нижче, але відносно близько до реалізації.)

source: Note that the body of the macro contains a trailing comma. So when you replace the existing static :c:type:`PyMethodDef` structure with the macro, *don't* add a comma to the end.
pt_br: Зауважте, що тіло макросу містить кінцеву кому. Отже, коли ви замінюєте існуючу статичну структуру :c:type:`PyMethodDef` на макрос, *не* додавайте кому в кінці.

source: Well, except for one difference: ``inspect.signature()`` run on your function should now provide a valid signature!
pt_br: Ну, за винятком однієї відмінності: ``inspect.signature()``, запущений у вашій функції, тепер має надати дійсний підпис!

source: Congratulations, you've ported your first function to work with Argument Clinic!
pt_br: Вітаємо, ви перенесли свою першу функцію для роботи з Argument Clinic!

source: Advanced Topics
pt_br: Tópicos Avançados

source: Now that you've had some experience working with Argument Clinic, it's time for some advanced topics.
pt_br: Тепер, коли ви маєте певний досвід роботи з Argument Clinic, настав час для деяких складних тем.

source: Symbolic default values
pt_br: Символічні значення за замовчуванням

source: The default value you provide for a parameter can't be any arbitrary expression. Currently the following are explicitly supported:
pt_br: Значення за умовчанням, яке ви надаєте для параметра, не може бути довільним виразом. Наразі явно підтримуються:

source: Numeric constants (integer and float)
pt_br: Числові константи (цілі чи з плаваючою точкою)

source: String constants
pt_br: Constantes de strings

source: ``True``, ``False``, and ``None``
pt_br: ``True``, ``False`` і ``None``

source: Simple symbolic constants like ``sys.maxsize``, which must start with the name of the module
pt_br: Прості символічні константи, такі як ``sys.maxsize``, які мають починатися з назви модуля

source: In case you're curious, this is implemented in ``from_builtin()`` in ``Lib/inspect.py``.
pt_br: Якщол вам цікаво, то це імплементовано у ``from_builtin()`` в ``Lib/inspect.py``.

source: (In the future, this may need to get even more elaborate, to allow full expressions like ``CONSTANT - 1``.)
pt_br: (У майбутньому це може бути ще більш детальним, щоб дозволити повні вирази, такі як ``CONSTANT - 1``.)

source: Renaming the C functions and variables generated by Argument Clinic
pt_br: Перейменування функцій і змінних C, згенерованих Argument Clinic

source: Argument Clinic automatically names the functions it generates for you. Occasionally this may cause a problem, if the generated name collides with the name of an existing C function. There's an easy solution: override the names used for the C functions. Just add the keyword ``"as"`` to your function declaration line, followed by the function name you wish to use. Argument Clinic will use that function name for the base (generated) function, then add ``"_impl"`` to the end and use that for the name of the impl function.
pt_br: Argument Clinic автоматично називає функції, які генерує для вас. Іноді це може спричинити проблему, якщо згенерована назва збігається з назвою існуючої функції C. Є просте рішення: замініть імена, які використовуються для функцій C. Просто додайте ключове слово ``"as"`` до рядка оголошення функції, а потім назву функції, яку ви бажаєте використовувати. Argument Clinic використовуватиме це ім’я функції для базової (згенерованої) функції, а потім додаватиме ``"_impl"`` у кінець і використовуватиме його як назву функції impl.

source: For example, if we wanted to rename the C function names generated for ``pickle.Pickler.dump``, it'd look like this::
pt_br: Наприклад, якби ми хотіли перейменувати назви функцій C, згенеровані для ``pickle.Pickler.dump``, це виглядало б так:

source: The base function would now be named ``pickler_dumper()``, and the impl function would now be named ``pickler_dumper_impl()``.
pt_br: Базова функція тепер матиме назву ``pickler_dumper()``, а функція impl — ``pickler_dumper_impl()``.

source: Similarly, you may have a problem where you want to give a parameter a specific Python name, but that name may be inconvenient in C. Argument Clinic allows you to give a parameter different names in Python and in C, using the same ``"as"`` syntax::
pt_br: Подібним чином у вас може виникнути проблема, коли ви бажаєте дати параметру конкретне ім’я Python, але це ім’я може бути незручним у C. Argument Clinic дозволяє вам давати різні імена параметрам у Python і C, використовуючи той самий "``" як"`` синтаксис::

source: Here, the name used in Python (in the signature and the ``keywords`` array) would be ``file``, but the C variable would be named ``file_obj``.
pt_br: Тут ім’я, яке використовується в Python (у підписі та масиві ``keywords``), буде ``file``, але змінна C матиме назву ``file_obj``.

source: You can use this to rename the ``self`` parameter too!
pt_br: Ви також можете використовувати це, щоб перейменувати параметр ``self``!

source: Converting functions using PyArg_UnpackTuple
pt_br: Перетворення функцій за допомогою PyArg_UnpackTuple

source: To convert a function parsing its arguments with :c:func:`PyArg_UnpackTuple`, simply write out all the arguments, specifying each as an ``object``. You may specify the ``type`` argument to cast the type as appropriate. All arguments should be marked positional-only (add a ``/`` on a line by itself after the last argument).
pt_br: Щоб перетворити функцію, що аналізує свої аргументи за допомогою :c:func:`PyArg_UnpackTuple`, просто запишіть усі аргументи, вказавши кожен як ``object``. Ви можете вказати аргумент ``type``, щоб привести тип до відповідності. Усі аргументи мають бути позначені лише позиційними (додайте ``/`` в окремому рядку після останнього аргументу).

source: Currently the generated code will use :c:func:`PyArg_ParseTuple`, but this will change soon.
pt_br: Наразі згенерований код використовуватиме :c:func:`PyArg_ParseTuple`, але незабаром це зміниться.

source: Optional Groups
pt_br: Додаткові групи

source: Some legacy functions have a tricky approach to parsing their arguments: they count the number of positional arguments, then use a ``switch`` statement to call one of several different :c:func:`PyArg_ParseTuple` calls depending on how many positional arguments there are. (These functions cannot accept keyword-only arguments.) This approach was used to simulate optional arguments back before :c:func:`PyArg_ParseTupleAndKeywords` was created.
pt_br: Деякі застарілі функції мають хитрий підхід до аналізу своїх аргументів: вони підраховують кількість позиційних аргументів, а потім використовують оператор ``switch`` для виклику одного з кількох різних викликів :c:func:`PyArg_ParseTuple` залежно від кількості позиційних аргументів там є. (Ці функції не можуть приймати лише ключові слова.) Цей підхід використовувався для симуляції необов’язкових аргументів ще до створення :c:func:`PyArg_ParseTupleAndKeywords`.

source: While functions using this approach can often be converted to use :c:func:`PyArg_ParseTupleAndKeywords`, optional arguments, and default values, it's not always possible. Some of these legacy functions have behaviors :c:func:`PyArg_ParseTupleAndKeywords` doesn't directly support. The most obvious example is the builtin function ``range()``, which has an optional argument on the *left* side of its required argument! Another example is ``curses.window.addch()``, which has a group of two arguments that must always be specified together. (The arguments are called ``x`` and ``y``; if you call the function passing in ``x``, you must also pass in ``y``—and if you don't pass in ``x`` you may not pass in ``y`` either.)
pt_br: Хоча функції, які використовують цей підхід, часто можна перетворити на використання :c:func:`PyArg_ParseTupleAndKeywords`, необов’язкових аргументів і значень за замовчуванням, це не завжди можливо. Деякі з цих застарілих функцій мають поведінку, яку :c:func:`PyArg_ParseTupleAndKeywords` безпосередньо не підтримує. Найбільш очевидним прикладом є вбудована функція ``range()``, яка має необов’язковий аргумент у *лівій* частині обов’язкового аргументу! Іншим прикладом є ``curses.window.addch()``, який має групу з двох аргументів, які завжди повинні вказуватися разом. (Аргументи називаються ``x`` і ``y``; якщо ви викликаєте функцію, передаючи ``x``, ви також повинні передати ``y``—а якщо ви не передаєте `` `x`` також не можна передавати в ``y``.)

source: In any case, the goal of Argument Clinic is to support argument parsing for all existing CPython builtins without changing their semantics. Therefore Argument Clinic supports this alternate approach to parsing, using what are called *optional groups*. Optional groups are groups of arguments that must all be passed in together. They can be to the left or the right of the required arguments. They can *only* be used with positional-only parameters.
pt_br: У будь-якому випадку, метою Argument Clinic є підтримка аналізу аргументів для всіх існуючих вбудованих модулів CPython без зміни їх семантики. Тому Argument Clinic підтримує цей альтернативний підхід до аналізу, використовуючи так звані *додаткові групи*. Необов’язкові групи — це групи аргументів, які потрібно передати разом. Вони можуть бути ліворуч або праворуч від необхідних аргументів. Їх можна використовувати *лише* з позиційними параметрами.

source: Optional groups are *only* intended for use when converting functions that make multiple calls to :c:func:`PyArg_ParseTuple`! Functions that use *any* other approach for parsing arguments should *almost never* be converted to Argument Clinic using optional groups. Functions using optional groups currently cannot have accurate signatures in Python, because Python just doesn't understand the concept. Please avoid using optional groups wherever possible.
pt_br: Необов’язкові групи призначені *лише* для використання під час перетворення функцій, які здійснюють кілька викликів у :c:func:`PyArg_ParseTuple`! Функції, які використовують *будь-який* інший підхід для аналізу аргументів, *майже ніколи* не повинні перетворюватися на клініку аргументів за допомогою додаткових груп. Функції, які використовують додаткові групи, наразі не можуть мати точні підписи в Python, оскільки Python просто не розуміє концепції. Будь ласка, уникайте використання додаткових груп, де це можливо.

source: To specify an optional group, add a ``[`` on a line by itself before the parameters you wish to group together, and a ``]`` on a line by itself after these parameters. As an example, here's how ``curses.window.addch`` uses optional groups to make the first two parameters and the last parameter optional::
pt_br: Щоб указати необов’язкову групу, додайте ``[`` в окремому рядку перед параметрами, які ви хочете згрупувати разом, і ``]`` в окремому рядку після цих параметрів. Як приклад, ось як ``curses.window.addch`` використовує необов’язкові групи, щоб зробити перші два параметри та останній параметр необов’язковими::

source: Notes:
pt_br: Notas:

source: For every optional group, one additional parameter will be passed into the impl function representing the group. The parameter will be an int named ``group_{direction}_{number}``, where ``{direction}`` is either ``right`` or ``left`` depending on whether the group is before or after the required parameters, and ``{number}`` is a monotonically increasing number (starting at 1) indicating how far away the group is from the required parameters. When the impl is called, this parameter will be set to zero if this group was unused, and set to non-zero if this group was used. (By used or unused, I mean whether or not the parameters received arguments in this invocation.)
pt_br: Для кожної необов’язкової групи один додатковий параметр буде передано у функцію impl, що представляє групу. Параметром буде int з іменем ``group_{direction}_{number}``, де ``{direction}`` є або ``праворуч``, або ``ліворуч`` залежно від того, яка група знаходиться до чи після необхідні параметри, а {number} — монотонно зростаюче число (починаючи з 1), яке вказує на те, наскільки далека група від необхідних параметрів. Під час виклику impl цей параметр буде встановлено на нуль, якщо ця група не використовувалася, і на відмінне від нуля, якщо ця група використовувалася. (Під "використаним" чи "невикористаним" я маю на увазі, чи отримали параметри аргументи під час цього виклику.)

source: If there are no required arguments, the optional groups will behave as if they're to the right of the required arguments.
pt_br: Якщо обов’язкових аргументів немає, необов’язкові групи поводитимуться так, ніби вони розташовані праворуч від обов’язкових аргументів.

source: In the case of ambiguity, the argument parsing code favors parameters on the left (before the required parameters).
pt_br: У разі неоднозначності код аналізу аргументу надає перевагу параметрам зліва (перед потрібними параметрами).

source: Optional groups can only contain positional-only parameters.
pt_br: Додаткові групи можуть містити лише позиційні параметри.

source: Optional groups are *only* intended for legacy code. Please do not use optional groups for new code.
pt_br: Додаткові групи призначені *тільки* для застарілого коду. Будь ласка, не використовуйте додаткові групи для нового коду.

source: Using real Argument Clinic converters, instead of "legacy converters"
pt_br: Використання реальних конвертерів Argument Clinic замість "застарілих конвертерів"

source: To save time, and to minimize how much you need to learn to achieve your first port to Argument Clinic, the walkthrough above tells you to use "legacy converters". "Legacy converters" are a convenience, designed explicitly to make porting existing code to Argument Clinic easier. And to be clear, their use is acceptable when porting code for Python 3.4.
pt_br: Щоб заощадити час і звести до мінімуму те, що вам потрібно навчитися, щоб досягти першого перенесення на Argument Clinic, наведене вище керівництво рекомендує вам використовувати "застарілі конвертери". "Застарілі конвертери" — це зручність, розроблена спеціально для полегшення перенесення існуючого коду на Argument Clinic. Щоб було зрозуміло, їхнє використання прийнятне під час портування коду для Python 3.4.

source: However, in the long term we probably want all our blocks to use Argument Clinic's real syntax for converters. Why? A couple reasons:
pt_br: Однак у довгостроковій перспективі ми, ймовірно, хочемо, щоб усі наші блоки використовували реальний синтаксис Argument Clinic для конвертерів. чому Пара причин:

source: The proper converters are far easier to read and clearer in their intent.
pt_br: Належні конвертери набагато легше читати, і їхні наміри зрозуміліші.

source: There are some format units that are unsupported as "legacy converters", because they require arguments, and the legacy converter syntax doesn't support specifying arguments.
pt_br: Є деякі одиниці формату, які не підтримуються як "застарілі конвертери", оскільки вони потребують аргументів, а синтаксис застарілого конвертера не підтримує визначення аргументів.

source: In the future we may have a new argument parsing library that isn't restricted to what :c:func:`PyArg_ParseTuple` supports; this flexibility won't be available to parameters using legacy converters.
pt_br: У майбутньому ми можемо мати нову бібліотеку аналізу аргументів, яка не обмежується тим, що підтримує :c:func:`PyArg_ParseTuple`; ця гнучкість не буде доступна для параметрів, які використовують застарілі конвертери.

source: Therefore, if you don't mind a little extra effort, please use the normal converters instead of legacy converters.
pt_br: Тому, якщо ви не проти трохи додаткових зусиль, використовуйте звичайні конвертери замість застарілих конвертерів.

source: In a nutshell, the syntax for Argument Clinic (non-legacy) converters looks like a Python function call. However, if there are no explicit arguments to the function (all functions take their default values), you may omit the parentheses. Thus ``bool`` and ``bool()`` are exactly the same converters.
pt_br: У двох словах, синтаксис для конвертерів Argument Clinic (не застарілих) виглядає як виклик функції Python. Однак, якщо для функції немає явних аргументів (усі функції приймають значення за замовчуванням), ви можете опустити дужки. Таким чином, ``bool`` і ``bool()`` є абсолютно однаковими перетворювачами.
