Repository: python/python-docs-pt-br
Catalog: howto/clinic.po
Languages: pt_br

source: Also, the function you are cloning from must have been previously defined in the current file.
pt_br: Крім того, функція, з якої ви клонуєте, має бути попередньо визначена в поточному файлі.

source: Calling Python code
pt_br: Виклик коду Python

source: The rest of the advanced topics require you to write Python code which lives inside your C file and modifies Argument Clinic's runtime state. This is simple: you simply define a Python block.
pt_br: Решта розширених тем вимагає від вас написання коду Python, який міститься у вашому файлі C і змінює стан виконання Argument Clinic. Це просто: ви просто визначаєте блок Python.

source: A Python block uses different delimiter lines than an Argument Clinic function block. It looks like this::
pt_br: Блок Python використовує інші розділові лінії, ніж функціональний блок Argument Clinic. Це виглядає так::

source: All the code inside the Python block is executed at the time it's parsed. All text written to stdout inside the block is redirected into the "output" after the block.
pt_br: Увесь код у блоці Python виконується під час його аналізу. Увесь текст, записаний у stdout всередині блоку, перенаправляється у "вихід" після блоку.

source: As an example, here's a Python block that adds a static integer variable to the C code::
pt_br: Як приклад, ось блок Python, який додає статичну цілочисельну змінну до коду C::

source: Using a "self converter"
pt_br: Usando um "auto conversor"

source: Argument Clinic automatically adds a "self" parameter for you using a default converter. It automatically sets the ``type`` of this parameter to the "pointer to an instance" you specified when you declared the type. However, you can override Argument Clinic's converter and specify one yourself. Just add your own ``self`` parameter as the first parameter in a block, and ensure that its converter is an instance of ``self_converter`` or a subclass thereof.
pt_br: Argument Clinic автоматично додає для вас параметр "self" за допомогою конвертера за замовчуванням. Він автоматично встановлює ``тип`` цього параметра на "вказівник на екземпляр", який ви вказали під час оголошення типу. Однак ви можете замінити конвертер Argument Clinic і вказати його самостійно. Просто додайте свій власний параметр ``self`` як перший параметр у блоці та переконайтеся, що його конвертер є екземпляром ``self_converter`` або його підкласом.

source: What's the point? This lets you override the type of ``self``, or give it a different default name.
pt_br: В чому справа? Це дає змогу змінити тип ``self`` або дати йому іншу назву за умовчанням.

source: How do you specify the custom type you want to cast ``self`` to? If you only have one or two functions with the same type for ``self``, you can directly use Argument Clinic's existing ``self`` converter, passing in the type you want to use as the ``type`` parameter::
pt_br: Як вказати настроюваний тип, до якого потрібно привести ``self``? Якщо у вас є лише одна чи дві функції з однаковим типом для ``self``, ви можете напряму використати наявний ``self`` конвертер Argument Clinic, передаючи тип, який ви хочете використовувати як параметр ``type``: :

source: On the other hand, if you have a lot of functions that will use the same type for ``self``, it's best to create your own converter, subclassing ``self_converter`` but overwriting the ``type`` member::
pt_br: З іншого боку, якщо у вас є багато функцій, які використовуватимуть той самий тип для ``self``, найкраще створити власний конвертер, створивши підклас ``self_converter``, але перезаписавши член ``type``::

source: Writing a custom converter
pt_br: Написання спеціального конвертера

source: As we hinted at in the previous section... you can write your own converters! A converter is simply a Python class that inherits from ``CConverter``. The main purpose of a custom converter is if you have a parameter using the ``O&`` format unit—parsing this parameter means calling a :c:func:`PyArg_ParseTuple` "converter function".
pt_br: Як ми натякали в попередньому розділі... ви можете писати власні конвертери! Конвертер — це просто клас Python, який успадковує ``CConverter``. Основна мета спеціального конвертера полягає в тому, що якщо у вас є параметр, який використовує одиницю формату ``O&``, аналіз цього параметра означає виклик :c:func:`PyArg_ParseTuple` "функції конвертера".

source: Your converter class should be named ``*something*_converter``. If the name follows this convention, then your converter class will be automatically registered with Argument Clinic; its name will be the name of your class with the ``_converter`` suffix stripped off. (This is accomplished with a metaclass.)
pt_br: Ваш клас конвертера повинен мати назву ``*something*_converter``. Якщо назва відповідає цій умові, ваш клас конвертера буде автоматично зареєстровано в Argument Clinic; його назва буде назвою вашого класу з видаленим суфіксом ``_converter``. (Це досягається за допомогою метакласу.)

source: You shouldn't subclass ``CConverter.__init__``. Instead, you should write a ``converter_init()`` function. ``converter_init()`` always accepts a ``self`` parameter; after that, all additional parameters *must* be keyword-only. Any arguments passed in to the converter in Argument Clinic will be passed along to your ``converter_init()``.
pt_br: Ви не повинні створювати підклас ``CConverter.__init__``. Натомість вам слід написати функцію ``converter_init()``. ``converter_init()`` завжди приймає параметр ``self``; після цього всі додаткові параметри *мають* бути лише ключовими словами. Будь-які аргументи, передані конвертеру в Argument Clinic, будуть передані вашому ``converter_init()``.

source: There are some additional members of ``CConverter`` you may wish to specify in your subclass. Here's the current list:
pt_br: Є деякі додаткові члени ``CConverter``, які ви можете вказати у своєму підкласі. Ось поточний список:

source: The C type to use for this variable. ``type`` should be a Python string specifying the type, e.g. ``int``. If this is a pointer type, the type string should end with ``' *'``.
pt_br: Тип C для цієї змінної. ``type`` має бути рядком Python із зазначенням типу, напр. ``int``. Якщо це тип вказівника, рядок типу має закінчуватися на ``' *'``.

source: The Python default value for this parameter, as a Python value. Or the magic value ``unspecified`` if there is no default.
pt_br: Стандартне значення Python для цього параметра як значення Python. Або магічне значення ``unspecified``, якщо немає значення за умовчанням.

source: ``default`` as it should appear in Python code, as a string. Or ``None`` if there is no default.
pt_br: ``default``, як воно має відображатися в коді Python, як рядок. Або ``None``, якщо за замовчуванням немає.

source: ``default`` as it should appear in C code, as a string. Or ``None`` if there is no default.
pt_br: ``default``, як воно має відображатися в коді C, як рядок. Або ``None``, якщо за замовчуванням немає.

source: The name of the C converter function, as a string.
pt_br: Назва функції конвертера C у вигляді рядка.

source: A boolean value. If true, Argument Clinic will add a ``&`` in front of the name of the variable when passing it into the impl function.
pt_br: Логічне значення. Якщо значення true, Argument Clinic додасть ``&`` перед іменем змінної під час передачі її у функцію impl.

source: A boolean value. If true, Argument Clinic will add a ``&`` in front of the name of the variable when passing it into :c:func:`PyArg_ParseTuple`.
pt_br: Логічне значення. Якщо істина, Argument Clinic додасть ``&`` перед іменем змінної під час передачі її в :c:func:`PyArg_ParseTuple`.

source: Here's the simplest example of a custom converter, from ``Modules/zlibmodule.c``::
pt_br: Ось найпростіший приклад спеціального конвертера з ``Modules/zlibmodule.c``::

source: This block adds a converter to Argument Clinic named ``ssize_t``. Parameters declared as ``ssize_t`` will be declared as type :c:type:`Py_ssize_t`, and will be parsed by the ``'O&'`` format unit, which will call the ``ssize_t_converter`` converter function. ``ssize_t`` variables automatically support default values.
pt_br: Цей блок додає конвертер до клініки аргументів під назвою ``ssize_t``. Параметри, оголошені як ``ssize_t``, будуть оголошені як тип :c:type:`Py_ssize_t` і аналізуватимуться блоком формату ``'O&''``, який викличе функцію конвертера ``ssize_t_converter``. Змінні ``ssize_t`` автоматично підтримують значення за замовчуванням.

source: More sophisticated custom converters can insert custom C code to handle initialization and cleanup. You can see more examples of custom converters in the CPython source tree; grep the C files for the string ``CConverter``.
pt_br: Більш складні користувацькі конвертери можуть вставляти власний код C для обробки ініціалізації та очищення. Ви можете побачити більше прикладів користувацьких конвертерів у дереві вихідних кодів CPython; grep файли C для рядка ``CConverter``.

source: Writing a custom return converter
pt_br: Написання спеціального конвертера повернення

source: Writing a custom return converter is much like writing a custom converter. Except it's somewhat simpler, because return converters are themselves much simpler.
pt_br: Написання спеціального конвертера повернення схоже на написання спеціального конвертера. За винятком того, що це дещо простіше, тому що зворотні перетворювачі самі по собі набагато простіші.

source: Return converters must subclass ``CReturnConverter``. There are no examples yet of custom return converters, because they are not widely used yet. If you wish to write your own return converter, please read ``Tools/clinic/clinic.py``, specifically the implementation of ``CReturnConverter`` and all its subclasses.
pt_br: Перетворювачі повернення мають бути підкласом ``CReturnConverter``. Ще немає прикладів користувальницьких конвертерів повернення, оскільки вони ще не широко використовуються. Якщо ви бажаєте написати власний конвертер повернення, прочитайте ``Tools/clinic/clinic.py``, зокрема реалізацію ``CReturnConverter`` та всі його підкласи.

source: METH_O and METH_NOARGS
pt_br: METH_O та METH_NOARGS

source: To convert a function using ``METH_O``, make sure the function's single argument is using the ``object`` converter, and mark the arguments as positional-only::
pt_br: Щоб перетворити функцію за допомогою ``METH_O``, переконайтеся, що єдиний аргумент функції використовує конвертер ``object``, і позначте аргументи як позиційні:

source: To convert a function using ``METH_NOARGS``, just don't specify any arguments.
pt_br: Щоб перетворити функцію за допомогою ``METH_NOARGS``, просто не вказуйте жодних аргументів.

source: You can still use a self converter, a return converter, and specify a ``type`` argument to the object converter for ``METH_O``.
pt_br: Ви все ще можете використовувати самоконвертер, конвертер повернення та вказати аргумент ``type`` для конвертера об’єктів для ``METH_O``.

source: tp_new and tp_init functions
pt_br: функції tp_new і tp_init

source: You can convert ``tp_new`` and ``tp_init`` functions. Just name them ``__new__`` or ``__init__`` as appropriate. Notes:
pt_br: Ви можете конвертувати функції ``tp_new`` і ``tp_init``. Просто назвіть їх ``__new__`` або ``__init__`` відповідно. Примітки:

source: The function name generated for ``__new__`` doesn't end in ``__new__`` like it would by default. It's just the name of the class, converted into a valid C identifier.
pt_br: Назва функції, створена для ``__new__``, не закінчується на ``__new__``, як це було б за замовчуванням. Це просто назва класу, перетворена на дійсний ідентифікатор C.

source: No ``PyMethodDef`` ``#define`` is generated for these functions.
pt_br: Для цих функцій не генерується ``PyMethodDef`` ``#define``.

source: ``__init__`` functions return ``int``, not ``PyObject *``.
pt_br: Функції ``__init__`` повертають ``int``, а не ``PyObject *``.

source: Use the docstring as the class docstring.
pt_br: Використовуйте рядок документації як рядок документації класу.

source: Although ``__new__`` and ``__init__`` functions must always accept both the ``args`` and ``kwargs`` objects, when converting you may specify any signature for these functions that you like. (If your function doesn't support keywords, the parsing function generated will throw an exception if it receives any.)
pt_br: Хоча функції ``__new__`` і ``__init__`` завжди повинні приймати об’єкти ``args`` і ``kwargs``, під час перетворення ви можете вказати будь-який підпис для цих функцій, який вам подобається. (Якщо ваша функція не підтримує ключові слова, згенерована функція синтаксичного аналізу викличе виняток, якщо вона отримає їх.)

source: Changing and redirecting Clinic's output
pt_br: Зміна та перенаправлення виходу клініки

source: It can be inconvenient to have Clinic's output interspersed with your conventional hand-edited C code. Luckily, Clinic is configurable: you can buffer up its output for printing later (or earlier!), or write its output to a separate file. You can also add a prefix or suffix to every line of Clinic's generated output.
pt_br: Це може бути незручно, щоб вихід Clinic перемежовувався з вашим звичайним редагованим вручну кодом C. На щастя, Clinic можна налаштувати: ви можете буферизувати його вихід для друку пізніше (чи раніше!) або записати його вихід в окремий файл. Ви також можете додати префікс або суфікс до кожного рядка результату, створеного Clinic.

source: While changing Clinic's output in this manner can be a boon to readability, it may result in Clinic code using types before they are defined, or your code attempting to use Clinic-generated code before it is defined. These problems can be easily solved by rearranging the declarations in your file, or moving where Clinic's generated code goes. (This is why the default behavior of Clinic is to output everything into the current block; while many people consider this hampers readability, it will never require rearranging your code to fix definition-before-use problems.)
pt_br: Хоча зміна вихідних даних Clinic таким чином може сприяти читабельності, це може призвести до того, що код Clinic використовує типи до того, як вони будуть визначені, або ваш код намагатиметься використати згенерований Clinic код до того, як він буде визначений. Ці проблеми можна легко вирішити, переставивши декларації у вашому файлі або перемістивши код, згенерований клінікою. (Ось чому поведінка Clinic за замовчуванням полягає у виведенні всього в поточний блок; хоча багато людей вважають, що це заважає читабельності, це ніколи не вимагатиме перевпорядкування вашого коду, щоб виправити проблеми визначення перед використанням.)

source: Let's start with defining some terminology:
pt_br: Почнемо з визначення термінології:

source: *field*
pt_br: *поле*

source: A field, in this context, is a subsection of Clinic's output. For example, the ``#define`` for the ``PyMethodDef`` structure is a field, called ``methoddef_define``. Clinic has seven different fields it can output per function definition:
pt_br: У цьому контексті поле є підрозділом результату клініки. Наприклад, ``#define`` для структури ``PyMethodDef`` є полем під назвою ``methoddef_define``. Клініка має сім різних полів, які вона може виводити за визначенням функції:

source: All the names are of the form ``"<a>_<b>"``, where ``"<a>"`` is the semantic object represented (the parsing function, the impl function, the docstring, or the methoddef structure) and ``"<b>"`` represents what kind of statement the field is. Field names that end in ``"_prototype"`` represent forward declarations of that thing, without the actual body/data of the thing; field names that end in ``"_definition"`` represent the actual definition of the thing, with the body/data of the thing. (``"methoddef"`` is special, it's the only one that ends with ``"_define"``, representing that it's a preprocessor #define.)
pt_br: Усі назви мають форму ``"<a>_<b>"``, де ``"<a>"`` є представленим семантичним об’єктом (функція аналізу, функція impl, рядок документа або структура methoddef) і ``"<b>"`` представляє тип оператора поля. Назви полів, які закінчуються на ``"_prototype"``, представляють прямі оголошення цієї речі без фактичного тіла/даних речі; назви полів, які закінчуються на ``"_definition"`` представляють фактичне визначення речі разом із тілом/даними речі. (``"methoddef"`` є особливим, він єдиний, який закінчується на ``"_define"``, вказуючи, що це препроцесор #define.)

source: *destination*
pt_br: *пункт призначення*

source: A destination is a place Clinic can write output to. There are five built-in destinations:
pt_br: Пункт призначення – це місце, куди клініка може писати вихідні дані. Є п’ять вбудованих пунктів призначення:

source: The default destination: printed in the output section of the current Clinic block.
pt_br: Призначення за замовчуванням: друкується в розділі виводу поточного блоку Clinic.

source: A text buffer where you can save text for later. Text sent here is appended to the end of any existing text. It's an error to have any text left in the buffer when Clinic finishes processing a file.
pt_br: Текстовий буфер, де ви можете зберегти текст на потім. Надісланий тут текст додається в кінці будь-якого наявного тексту. Це помилка, коли будь-який текст залишився в буфері, коли клініка завершує обробку файлу.

source: A separate "clinic file" that will be created automatically by Clinic. The filename chosen for the file is ``{basename}.clinic{extension}``, where ``basename`` and ``extension`` were assigned the output from ``os.path.splitext()`` run on the current file. (Example: the ``file`` destination for ``_pickle.c`` would be written to ``_pickle.clinic.c``.)
pt_br: Окремий "файл клініки", який буде створено Клінікою автоматично. Для файлу вибрано ім’я ``{basename}.clinic{extension}``, де ``basename`` і ``extension`` було призначено результат ``os.path.splitext()``, що виконується на поточний файл. (Приклад: місце призначення ``file`` для ``_pickle.c`` буде записано в ``_pickle.clinic.c``.)

source: **Important: When using a** ``file`` **destination, you** *must check in* **the generated file!**
pt_br: **Важливо: використовуючи** ``файл`` **призначення, ви** *повинні перевірити* **згенерований файл!**

source: A buffer like ``buffer``. However, a two-pass buffer can only be dumped once, and it prints out all text sent to it during all processing, even from Clinic blocks *after* the dumping point.
pt_br: Буфер, як ``buffer``. Однак двопрохідний буфер можна скинути лише один раз, і він друкує весь текст, надісланий до нього під час усієї обробки, навіть із блоків Clinic *після* точки скидання.

source: The text is suppressed—thrown away.
pt_br: Текст приховується — викидається.

source: Clinic defines five new directives that let you reconfigure its output.
pt_br: Клініка визначає п’ять нових директив, які дозволяють переналаштувати її вихід.

source: The first new directive is ``dump``:
pt_br: Першою новою директивою є ``dump``:

source: This dumps the current contents of the named destination into the output of the current block, and empties it. This only works with ``buffer`` and ``two-pass`` destinations.
pt_br: Це скидає поточний вміст названого пункту призначення у вихід поточного блоку та очищає його. Це працює лише з призначеннями ``буфер`` і ``двопрохідний``.

source: The second new directive is ``output``. The most basic form of ``output`` is like this:
pt_br: Другою новою директивою є ``вихід``. Основна форма "виводу" така:

source: This tells Clinic to output *field* to *destination*. ``output`` also supports a special meta-destination, called ``everything``, which tells Clinic to output *all* fields to that *destination*.
pt_br: Це повідомляє Клініці виводити *поле* в *адресат*. ``вивід`` також підтримує спеціальний мета-адресат, який називається ``все``, який повідомляє Clinic виводити *всі* поля в цей *адресат*.

source: ``output`` has a number of other functions:
pt_br: ``вивід`` має ряд інших функцій:

source: ``output push`` and ``output pop`` allow you to push and pop configurations on an internal configuration stack, so that you can temporarily modify the output configuration, then easily restore the previous configuration. Simply push before your change to save the current configuration, then pop when you wish to restore the previous configuration.
pt_br: ``output push`` і ``output pop`` дозволяють вам надсилати та витягувати конфігурації у внутрішній стек конфігурації, щоб ви могли тимчасово змінити вихідну конфігурацію, а потім легко відновити попередню конфігурацію. Просто натисніть перед внесенням змін, щоб зберегти поточну конфігурацію, а потім натисніть, коли захочете відновити попередню конфігурацію.

source: ``output preset`` sets Clinic's output to one of several built-in preset configurations, as follows:
pt_br: ``output preset`` встановлює вихід клініки на одну з кількох вбудованих попередньо встановлених конфігурацій, як показано нижче:

source: Clinic's original starting configuration. Writes everything immediately after the input block.
pt_br: Оригінальна стартова конфігурація клініки. Пише все відразу після блоку введення.

source: Suppress the ``parser_prototype`` and ``docstring_prototype``, write everything else to ``block``.
pt_br: Приховати ``parser_prototype`` і ``docstring_prototype``, записати все інше в ``block``.

source: Designed to write everything to the "clinic file" that it can. You then ``#include`` this file near the top of your file. You may need to rearrange your file to make this work, though usually this just means creating forward declarations for various ``typedef`` and ``PyTypeObject`` definitions.
pt_br: Призначений для запису в "картотеку клініки" всього, що може. Потім ви ``#include`` цей файл у верхній частині вашого файлу. Можливо, вам знадобиться перевпорядкувати файл, щоб це запрацювало, хоча зазвичай це означає лише створення попередніх декларацій для різних визначень ``typedef`` і ``PyTypeObject``.

source: Suppress the ``parser_prototype`` and ``docstring_prototype``, write the ``impl_definition`` to ``block``, and write everything else to ``file``.
pt_br: Приховати ``parser_prototype`` і ``docstring_prototype``, записати ``impl_definition`` до ``block``, а все інше записати до ``file``.

source: The default filename is ``"{dirname}/clinic/{basename}.h"``.
pt_br: Назва файлу за замовчуванням – ``"{dirname}/clinic/{basename}.h"``.

source: Save up most of the output from Clinic, to be written into your file near the end. For Python files implementing modules or builtin types, it's recommended that you dump the buffer just above the static structures for your module or builtin type; these are normally very near the end. Using ``buffer`` may require even more editing than ``file``, if your file has static ``PyMethodDef`` arrays defined in the middle of the file.
pt_br: Збережіть більшу частину вихідних даних Clinic, щоб записати їх у ваш файл ближче до кінця. Для файлів Python, що реалізують модулі або вбудовані типи, рекомендується створювати дамп буфера безпосередньо над статичними структурами для вашого модуля або вбудованого типу; зазвичай вони дуже близькі до кінця. Використання ``buffer`` може вимагати навіть більше редагування, ніж ``file``, якщо ваш файл має статичні масиви ``PyMethodDef``, визначені в середині файлу.

source: Suppress the ``parser_prototype``, ``impl_prototype``, and ``docstring_prototype``, write the ``impl_definition`` to ``block``, and write everything else to ``file``.
pt_br: Приховати ``parser_prototype``, ``impl_prototype`` і ``docstring_prototype``, записати ``impl_definition`` до ``block``, а все інше записати до ``file``.
