Repository: python/python-docs-pt-br
Catalog: howto/clinic.po
Languages: pt_br

source: Similar to the ``buffer`` preset, but writes forward declarations to the ``two-pass`` buffer, and definitions to the ``buffer``. This is similar to the ``buffer`` preset, but may require less editing than ``buffer``. Dump the ``two-pass`` buffer near the top of your file, and dump the ``buffer`` near the end just like you would when using the ``buffer`` preset.
pt_br: Подібно до попереднього налаштування ``buffer``, але записує прямі оголошення в ``двопрохідний`` буфер, а визначення в ``buffer``. Це подібно до попереднього налаштування ``buffer``, але може потребувати менше редагування, ніж ``buffer``. Вивантажте буфер ``двох проходів`` у верхній частині вашого файлу, а ``буфер`` ближче до кінця так само, як при використанні попереднього налаштування ``буфер``.

source: Suppresses the ``impl_prototype``, write the ``impl_definition`` to ``block``, write ``docstring_prototype``, ``methoddef_define``, and ``parser_prototype`` to ``two-pass``, write everything else to ``buffer``.
pt_br: Пригнічує ``impl_prototype``, записує ``impl_definition`` у ``block``, записує ``docstring_prototype``, ``methoddef_define`` і ``parser_prototype`` у ``two-pass``, записати все інше в ``buffer``.

source: Similar to the ``buffer`` preset, but writes more things to ``block``, only writing the really big chunks of generated code to ``buffer``. This avoids the definition-before-use problem of ``buffer`` completely, at the small cost of having slightly more stuff in the block's output. Dump the ``buffer`` near the end, just like you would when using the ``buffer`` preset.
pt_br: Подібно до попереднього налаштування ``buffer``, але записує більше речей у ``block``, записуючи лише дійсно великі фрагменти згенерованого коду до ``buffer``. Це повністю уникає проблеми визначення перед використанням ``буфера`` за невелику ціну наявності трохи більше речей у виводі блоку. Вивантажте ``buffer`` ближче до кінця, так само, як і при використанні попереднього налаштування ``buffer``.

source: Suppresses the ``impl_prototype``, write the ``docstring_definition`` and ``parser_definition`` to ``buffer``, write everything else to ``block``.
pt_br: Пригнічує ``impl_prototype``, записує ``docstring_definition`` і ``parser_definition`` до ``buffer``, записує все інше до ``block``.

source: The third new directive is ``destination``:
pt_br: Третя нова директива – ``destination``:

source: This performs an operation on the destination named ``name``.
pt_br: Це виконує операцію над призначенням під назвою ``name``.

source: There are two defined subcommands: ``new`` and ``clear``.
pt_br: Існує дві визначені підкоманди: ``new`` і ``clear``.

source: The ``new`` subcommand works like this:
pt_br: Підкоманда ``new`` працює так:

source: This creates a new destination with name ``<name>`` and type ``<type>``.
pt_br: Це створює новий пункт призначення з назвою ``<name>`` і типом ``<type>``.

source: There are five destination types:
pt_br: Є п'ять типів призначення:

source: Throws the text away.
pt_br: Викидає текст.

source: Writes the text to the current block. This is what Clinic originally did.
pt_br: Записує текст у поточний блок. Це те, що клініка спочатку робила.

source: A simple text buffer, like the "buffer" builtin destination above.
pt_br: Простий текстовий буфер, подібний до вбудованого призначення "buffer" вище.

source: A text file. The file destination takes an extra argument, a template to use for building the filename, like so:
pt_br: Текстовий файл. Місце призначення файлу приймає додатковий аргумент, шаблон для створення імені файлу, наприклад:

source: destination <name> new <type> <file_template>
pt_br: призначення <name> новий <type> <file_template>

source: The template can use three strings internally that will be replaced by bits of the filename:
pt_br: Шаблон може використовувати три внутрішні рядки, які будуть замінені бітами імені файлу:

source: The full path to the file, including directory and full filename.
pt_br: Повний шлях до файлу, включаючи каталог і повну назву файлу.

source: The name of the directory the file is in.
pt_br: Назва каталогу, у якому знаходиться файл.

source: Just the name of the file, not including the directory.
pt_br: Просто ім’я файлу, не враховуючи каталог.

source: Basename with the extension clipped off (everything up to but not including the last '.').
pt_br: Базове ім’я з обрізаним розширенням (усе до останнього ".").

source: The last '.' and everything after it. If the basename does not contain a period, this will be the empty string.
pt_br: Останній '.' і все після нього. Якщо базове ім’я не містить крапки, це буде порожній рядок.

source: If there are no periods in the filename, {basename} and {filename} are the same, and {extension} is empty. "{basename}{extension}" is always exactly the same as "{filename}"."
pt_br: Якщо в назві файлу немає крапок, {basename} і {filename} однакові, а {extension} порожній. "{basename}{extension}" завжди точно збігається з "{filename}"."

source: A two-pass buffer, like the "two-pass" builtin destination above.
pt_br: Двопрохідний буфер, як і "двопрохідний" вбудований пункт призначення вище.

source: The ``clear`` subcommand works like this:
pt_br: Підкоманда ``clear`` працює так:

source: It removes all the accumulated text up to this point in the destination. (I don't know what you'd need this for, but I thought maybe it'd be useful while someone's experimenting.)
pt_br: Він видаляє весь накопичений текст до цієї точки призначення. (Я не знаю, для чого вам це знадобиться, але я подумав, що, можливо, це буде корисно, коли хтось експериментуватиме.)

source: The fourth new directive is ``set``:
pt_br: Четверта нова директива — ``set``:

source: ``set`` lets you set two internal variables in Clinic. ``line_prefix`` is a string that will be prepended to every line of Clinic's output; ``line_suffix`` is a string that will be appended to every line of Clinic's output.
pt_br: ``set`` дозволяє встановити дві внутрішні змінні в Clinic. ``line_prefix`` - це рядок, який додаватиметься до кожного рядка виводу Clinic; ``line_suffix`` – це рядок, який буде додано до кожного рядка виводу Clinic.

source: Both of these support two format strings:
pt_br: Обидва вони підтримують два рядки формату:

source: ``{block comment start}``
pt_br: ``{заблокувати початок коментаря}``

source: Turns into the string ``/*``, the start-comment text sequence for C files.
pt_br: Перетворюється на рядок ``/*``, текстову послідовність початку коментаря для файлів C.

source: Turns into the string ``*/``, the end-comment text sequence for C files.
pt_br: Перетворюється на рядок ``*/``, послідовність тексту кінцевого коментаря для файлів C.

source: The final new directive is one you shouldn't need to use directly, called ``preserve``:
pt_br: Остання нова директива, яку вам не потрібно використовувати безпосередньо, називається ``preserve``:

source: This tells Clinic that the current contents of the output should be kept, unmodified. This is used internally by Clinic when dumping output into ``file`` files; wrapping it in a Clinic block lets Clinic use its existing checksum functionality to ensure the file was not modified by hand before it gets overwritten.
pt_br: Це повідомляє Клініці, що поточний вміст вихідних даних слід зберегти без змін. Це використовується клінікою внутрішньо під час створення дампу виведених даних у файли ``file``; загортання його в блок Clinic дозволяє Clinic використовувати наявну функцію контрольної суми, щоб переконатися, що файл не було змінено вручну, перш ніж його буде перезаписано.

source: The #ifdef trick
pt_br: O truque de #ifdef

source: If you're converting a function that isn't available on all platforms, there's a trick you can use to make life a little easier. The existing code probably looks like this::
pt_br: Якщо ви перетворюєте функцію, яка доступна не на всіх платформах, є хитрість, за допомогою якої ви можете трохи полегшити життя. Наявний код, ймовірно, виглядає так::

source: And then in the ``PyMethodDef`` structure at the bottom the existing code will have:
pt_br: А потім у нижній структурі ``PyMethodDef`` наявний код матиме:

source: In this scenario, you should enclose the body of your impl function inside the ``#ifdef``, like so::
pt_br: У цьому сценарії ви повинні вкласти тіло вашої функції impl у ``#ifdef``, ось так:

source: Then, remove those three lines from the ``PyMethodDef`` structure, replacing them with the macro Argument Clinic generated:
pt_br: Потім видаліть ці три рядки зі структури ``PyMethodDef``, замінивши їх згенерованим макросом Argument Clinic:

source: (You can find the real name for this macro inside the generated code. Or you can calculate it yourself: it's the name of your function as defined on the first line of your block, but with periods changed to underscores, uppercased, and ``"_METHODDEF"`` added to the end.)
pt_br: (Ви можете знайти справжню назву цього макросу в створеному коді. Або ви можете обчислити її самостійно: це назва вашої функції, як визначено в першому рядку вашого блоку, але з крапками, зміненими на підкреслення, верхній регістр і ``"_METHODDEF"`` додано в кінець.)

source: Perhaps you're wondering: what if ``HAVE_FUNCTIONNAME`` isn't defined? The ``MODULE_FUNCTIONNAME_METHODDEF`` macro won't be defined either!
pt_br: Можливо, вам цікаво: а що, якщо ``HAVE_FUNCTIONNAME`` не визначено? Макрос ``MODULE_FUNCTIONNAME_METHODDEF`` також не буде визначено!

source: Here's where Argument Clinic gets very clever. It actually detects that the Argument Clinic block might be deactivated by the ``#ifdef``. When that happens, it generates a little extra code that looks like this::
pt_br: Ось де Argument Clinic стає дуже розумною. Він фактично виявляє, що блок аргументів може бути дезактивований ``#ifdef``. Коли це відбувається, створюється додатковий код, який виглядає так:

source: That means the macro always works. If the function is defined, this turns into the correct structure, including the trailing comma. If the function is undefined, this turns into nothing.
pt_br: Це означає, що макрос працює завжди. Якщо функцію визначено, вона перетворюється на правильну структуру, включаючи кінцеву кому. Якщо функція не визначена, це перетворюється на ніщо.

source: However, this causes one ticklish problem: where should Argument Clinic put this extra code when using the "block" output preset? It can't go in the output block, because that could be deactivated by the ``#ifdef``. (That's the whole point!)
pt_br: Однак це спричиняє одну лоскотну проблему: куди Argument Clinic має розмістити цей додатковий код, коли використовується пресет виведення "блок"? Він не може перейти до блоку виведення, тому що це може бути дезактивовано ``#ifdef``. (У цьому вся суть!)

source: In this situation, Argument Clinic writes the extra code to the "buffer" destination. This may mean that you get a complaint from Argument Clinic:
pt_br: У цій ситуації Argument Clinic записує додатковий код до місця призначення "буфера". Це може означати, що ви отримали скаргу від клініки Аргумент:

source: When this happens, just open your file, find the ``dump buffer`` block that Argument Clinic added to your file (it'll be at the very bottom), then move it above the ``PyMethodDef`` structure where that macro is used.
pt_br: Коли це станеться, просто відкрийте файл, знайдіть блок ``буфера дампа``, який Argument Clinic додав до вашого файлу (він буде в самому низу), а потім перемістіть його над структурою ``PyMethodDef``, де цей макрос використовується.

source: Using Argument Clinic in Python files
pt_br: Використання клініки аргументів у файлах Python

source: It's actually possible to use Argument Clinic to preprocess Python files. There's no point to using Argument Clinic blocks, of course, as the output wouldn't make any sense to the Python interpreter. But using Argument Clinic to run Python blocks lets you use Python as a Python preprocessor!
pt_br: Насправді можна використовувати Argument Clinic для попередньої обробки файлів Python. Звичайно, немає сенсу використовувати блоки Argument Clinic, оскільки вихідні дані не матимуть сенсу для інтерпретатора Python. Але використання Argument Clinic для запуску блоків Python дозволяє використовувати Python як препроцесор Python!

source: Since Python comments are different from C comments, Argument Clinic blocks embedded in Python files look slightly different. They look like this:
pt_br: Оскільки коментарі Python відрізняються від коментарів C, блоки Argument Clinic, вбудовані у файли Python, виглядають дещо інакше. Вони виглядають так:
