Repository: python/python-docs-pt-br
Catalog: howto/clinic.po
Languages: pt_br

source: Argument Clinic How-To
pt_br: How-To - Clínica de Argumento

source: author
pt_br: autor

source: Abstract
pt_br: Resumo

source: Argument Clinic is a preprocessor for CPython C files. Its purpose is to automate all the boilerplate involved with writing argument parsing code for "builtins". This document shows you how to convert your first C function to work with Argument Clinic, and then introduces some advanced topics on Argument Clinic usage.
pt_br: Argument Clinic є препроцесором для файлів CPython C. Його метою є автоматизація всього шаблонного коду, пов’язаного з написанням коду аналізу аргументів для "builtins". У цьому документі показано, як перетворити вашу першу функцію C для роботи з Argument Clinic, а потім представлені деякі додаткові теми щодо використання Argument Clinic.

source: Currently Argument Clinic is considered internal-only for CPython. Its use is not supported for files outside CPython, and no guarantees are made regarding backwards compatibility for future versions. In other words: if you maintain an external C extension for CPython, you're welcome to experiment with Argument Clinic in your own code. But the version of Argument Clinic that ships with the next version of CPython *could* be totally incompatible and break all your code.
pt_br: Наразі Argument Clinic вважається лише внутрішнім для CPython. Його використання не підтримується для файлів за межами CPython, і не надається жодних гарантій щодо зворотної сумісності для майбутніх версій. Іншими словами: якщо ви підтримуєте зовнішнє розширення C для CPython, ви можете експериментувати з Argument Clinic у своєму власному коді. Але версія Argument Clinic, яка постачається з наступною версією CPython *може* бути абсолютно несумісною та порушити весь ваш код.

source: The Goals Of Argument Clinic
pt_br: Цілі клініки аргументів

source: Argument Clinic's primary goal is to take over responsibility for all argument parsing code inside CPython. This means that, when you convert a function to work with Argument Clinic, that function should no longer do any of its own argument parsing—the code generated by Argument Clinic should be a "black box" to you, where CPython calls in at the top, and your code gets called at the bottom, with ``PyObject *args`` (and maybe ``PyObject *kwargs``) magically converted into the C variables and types you need.
pt_br: Головна мета Argument Clinic — взяти на себе відповідальність за весь код аналізу аргументів у CPython. Це означає, що коли ви перетворюєте функцію для роботи з Argument Clinic, ця функція більше не повинна виконувати власний розбір аргументів — код, згенерований Argument Clinic, має бути для вас "чорним ящиком", куди CPython звертається до зверху, а ваш код викликається внизу, за допомогою ``PyObject *args`` (і, можливо, ``PyObject *kwargs``), чарівним чином перетворених у потрібні вам змінні C і типи.

source: In order for Argument Clinic to accomplish its primary goal, it must be easy to use. Currently, working with CPython's argument parsing library is a chore, requiring maintaining redundant information in a surprising number of places. When you use Argument Clinic, you don't have to repeat yourself.
pt_br: Щоб Argument Clinic міг досягти своєї основної мети, він має бути простим у використанні. Наразі робота з бібліотекою аналізу аргументів CPython є клопіткою, що потребує збереження надлишкової інформації у неймовірній кількості місць. Коли ви використовуєте Argument Clinic, вам не потрібно повторюватися.

source: Obviously, no one would want to use Argument Clinic unless it's solving their problem—and without creating new problems of its own. So it's paramount that Argument Clinic generate correct code. It'd be nice if the code was faster, too, but at the very least it should not introduce a major speed regression. (Eventually Argument Clinic *should* make a major speedup possible—we could rewrite its code generator to produce tailor-made argument parsing code, rather than calling the general-purpose CPython argument parsing library. That would make for the fastest argument parsing possible!)
pt_br: Очевидно, що ніхто не захоче використовувати Argument Clinic, якщо вона не вирішить їхню проблему — і не створює нових власних проблем. Тому надзвичайно важливо, щоб Argument Clinic створила правильний код. Було б непогано, якби код також був швидшим, але принаймні це не повинно вводити значної регресії швидкості. (Врешті-решт Argument Clinic *має* зробити можливим значне прискорення — ми могли б переписати його генератор коду, щоб створювати індивідуальний код аналізу аргументів, а не викликати бібліотеку аналізу аргументів загального призначення CPython. Це забезпечить найшвидший із можливих аналіз аргументів! )

source: Additionally, Argument Clinic must be flexible enough to work with any approach to argument parsing. Python has some functions with some very strange parsing behaviors; Argument Clinic's goal is to support all of them.
pt_br: Крім того, Argument Clinic має бути досить гнучким, щоб працювати з будь-яким підходом до аналізу аргументів. У Python є деякі функції з дуже дивною поведінкою аналізу; Мета клініки "Аргумент" — підтримати їх усіх.

source: Finally, the original motivation for Argument Clinic was to provide introspection "signatures" for CPython builtins. It used to be, the introspection query functions would throw an exception if you passed in a builtin. With Argument Clinic, that's a thing of the past!
pt_br: Нарешті, початковою мотивацією для Argument Clinic було надання "підписів" самоаналізу для вбудованих модулів CPython. Раніше функції запиту самоаналізу видавали виняток, якщо ви передавали вбудований. З клінікою "Аргумент" це залишилося в минулому!

source: One idea you should keep in mind, as you work with Argument Clinic: the more information you give it, the better job it'll be able to do. Argument Clinic is admittedly relatively simple right now. But as it evolves it will get more sophisticated, and it should be able to do many interesting and smart things with all the information you give it.
pt_br: Працюючи з Argument Clinic, вам слід пам’ятати одну ідею: чим більше інформації ви їй надасте, тим краще вона зможе виконувати роботу. Правда, клініка Аргумент зараз відносно проста. Але в міру розвитку він ставатиме складнішим і зможе робити багато цікавих і розумних речей з усією інформацією, яку ви йому надаєте.

source: Basic Concepts And Usage
pt_br: Konsep Dasar dan Penggunaan

source: Argument Clinic ships with CPython; you'll find it in ``Tools/clinic/clinic.py``. If you run that script, specifying a C file as an argument:
pt_br: Argument Clinic поставляється з CPython; ви знайдете його в ``Tools/clinic/clinic.py``. Якщо ви запустите цей сценарій, вказавши файл C як аргумент:

source: Argument Clinic will scan over the file looking for lines that look exactly like this:
pt_br: Argument Clinic сканує файл, шукаючи рядки, які виглядають саме так:

source: When it finds one, it reads everything up to a line that looks exactly like this:
pt_br: Коли він знаходить його, він читає все до рядка, який виглядає саме так:

source: Everything in between these two lines is input for Argument Clinic. All of these lines, including the beginning and ending comment lines, are collectively called an Argument Clinic "block".
pt_br: Все, що знаходиться між цими двома рядками, є вхідними для Argument Clinic. Усі ці рядки, включно з початковим і кінцевим рядками коментарів, разом називаються "блоком аргументації".

source: When Argument Clinic parses one of these blocks, it generates output. This output is rewritten into the C file immediately after the block, followed by a comment containing a checksum. The Argument Clinic block now looks like this:
pt_br: Коли Argument Clinic аналізує один із цих блоків, він генерує вихідні дані. Цей вивід переписується у файл C відразу після блоку, після чого йде коментар, що містить контрольну суму. Блок "Клініка аргументів" тепер виглядає так:

source: If you run Argument Clinic on the same file a second time, Argument Clinic will discard the old output and write out the new output with a fresh checksum line. However, if the input hasn't changed, the output won't change either.
pt_br: Якщо ви запустите Argument Clinic для того самого файлу вдруге, Argument Clinic відхилить старий вихід і випише новий вихід із свіжим рядком контрольної суми. Однак, якщо вхід не змінився, вихід також не зміниться.

source: You should never modify the output portion of an Argument Clinic block. Instead, change the input until it produces the output you want. (That's the purpose of the checksum—to detect if someone changed the output, as these edits would be lost the next time Argument Clinic writes out fresh output.)
pt_br: Ви ніколи не повинні змінювати вихідну частину блоку Argument Clinic. Натомість змінюйте вхідні дані, доки вони не отримають бажаний результат. (Це мета контрольної суми — виявити, чи хтось змінив вихідні дані, оскільки ці редагування буде втрачено наступного разу, коли Argument Clinic виведе новий вихід.)

source: For the sake of clarity, here's the terminology we'll use with Argument Clinic:
pt_br: Для ясності ось термінологія, яку ми будемо використовувати з Argument Clinic:

source: The first line of the comment (``/*[clinic input]``) is the *start line*.
pt_br: Перший рядок коментаря (``/*[clinic input]``) є *початковим рядком*.

source: The last line of the initial comment (``[clinic start generated code]*/``) is the *end line*.
pt_br: Останній рядок початкового коментаря (``[генерований код початку клініки]*/``) є *кінцевим рядком*.

source: The last line (``/*[clinic end generated code: checksum=...]*/``) is the *checksum line*.
pt_br: Останній рядок (``/*[код, згенерований клінікою: контрольна сума=...]*/``) — це *рядок контрольної суми*.

source: In between the start line and the end line is the *input*.
pt_br: Між початковим і кінцевим рядками знаходиться *вхід*.

source: In between the end line and the checksum line is the *output*.
pt_br: Між кінцевим рядком і рядком контрольної суми знаходиться *вихід*.

source: All the text collectively, from the start line to the checksum line inclusively, is the *block*. (A block that hasn't been successfully processed by Argument Clinic yet doesn't have output or a checksum line, but it's still considered a block.)
pt_br: Увесь текст разом, від початкового рядка до рядка контрольної суми включно, є *блоком*. (Блок, який не було успішно оброблено Argument Clinic, ще не має виводу чи рядка контрольної суми, але все одно вважається блоком.)

source: Converting Your First Function
pt_br: Перетворення вашої першої функції

source: The best way to get a sense of how Argument Clinic works is to convert a function to work with it. Here, then, are the bare minimum steps you'd need to follow to convert a function to work with Argument Clinic. Note that for code you plan to check in to CPython, you really should take the conversion farther, using some of the advanced concepts you'll see later on in the document (like "return converters" and "self converters"). But we'll keep it simple for this walkthrough so you can learn.
pt_br: Найкращий спосіб зрозуміти, як працює Argument Clinic, — це перетворити функцію для роботи з нею. Отже, ось мінімальні кроки, які вам потрібно виконати, щоб перетворити функцію на роботу з Argument Clinic. Зауважте, що для коду, який ви плануєте зареєструвати в CPython, вам справді слід продовжити процес перетворення, використовуючи деякі розширені концепції, які ви побачите пізніше в цьому документі (наприклад, "перетворювачі повернення" та "перетворювачі самостійно"). Але ми зробимо його простим для цього покрокового керівництва, щоб ви могли навчитися.

source: Let's dive in!
pt_br: Давайте зануримося!

source: Make sure you're working with a freshly updated checkout of the CPython trunk.
pt_br: Переконайтеся, що ви працюєте зі щойно оновленою перевіркою магістралі CPython.

source: Find a Python builtin that calls either :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords`, and hasn't been converted to work with Argument Clinic yet. For my example I'm using ``_pickle.Pickler.dump()``.
pt_br: Знайдіть вбудований Python, який викликає або :c:func:`PyArg_ParseTuple`, або :c:func:`PyArg_ParseTupleAndKeywords`, і ще не перетворений для роботи з Argument Clinic. Для свого прикладу я використовую ``_pickle.Pickler.dump()``.

source: If the call to the ``PyArg_Parse`` function uses any of the following format units:
pt_br: Якщо виклик функції ``PyArg_Parse`` використовує будь-яку з наступних одиниць формату:

source: or if it has multiple calls to :c:func:`PyArg_ParseTuple`, you should choose a different function. Argument Clinic *does* support all of these scenarios. But these are advanced topics—let's do something simpler for your first function.
pt_br: або якщо він має декілька викликів :c:func:`PyArg_ParseTuple`, вам слід вибрати іншу функцію. Клініка Аргумент *підтримує* всі ці сценарії. Але це складні теми — давайте зробимо щось простіше для вашої першої функції.

source: Also, if the function has multiple calls to :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_ParseTupleAndKeywords` where it supports different types for the same argument, or if the function uses something besides PyArg_Parse functions to parse its arguments, it probably isn't suitable for conversion to Argument Clinic. Argument Clinic doesn't support generic functions or polymorphic parameters.
pt_br: Крім того, якщо функція має кілька викликів :c:func:`PyArg_ParseTuple` або :c:func:`PyArg_ParseTupleAndKeywords`, де вона підтримує різні типи для одного аргументу, або якщо функція використовує щось окрім функцій PyArg_Parse для аналізу своїх аргументів, він, ймовірно, не підходить для перетворення на Argument Clinic. Argument Clinic не підтримує загальні функції чи поліморфні параметри.

source: Add the following boilerplate above the function, creating our block::
pt_br: Додайте наступний шаблон над функцією, створивши наш блок::

source: Cut the docstring and paste it in between the ``[clinic]`` lines, removing all the junk that makes it a properly quoted C string. When you're done you should have just the text, based at the left margin, with no line wider than 80 characters. (Argument Clinic will preserve indents inside the docstring.)
pt_br: Виріжте рядок документації та вставте його між рядками ``[clinic]``, видаливши весь непотріб, який робить його правильним рядком C у лапках. Коли ви закінчите, у вас має бути лише текст, розташований на лівому полі, без рядка ширше 80 символів. (Argument Clinic збереже відступи всередині рядка документації.)

source: If the old docstring had a first line that looked like a function signature, throw that line away. (The docstring doesn't need it anymore—when you use ``help()`` on your builtin in the future, the first line will be built automatically based on the function's signature.)
pt_br: Якщо старий рядок документації мав перший рядок, який виглядав як підпис функції, викиньте цей рядок. (Документаційному рядку він більше не потрібен — коли ви в майбутньому використовуєте ``help()`` у своїй вбудованій системі, перший рядок буде створено автоматично на основі сигнатури функції.)

source: Sample::
pt_br: Contoh::

source: If your docstring doesn't have a "summary" line, Argument Clinic will complain. So let's make sure it has one. The "summary" line should be a paragraph consisting of a single 80-column line at the beginning of the docstring.
pt_br: Якщо у вашому рядку документів немає рядка "резюме", Argument Clinic поскаржиться. Тож давайте переконаємося, що він є. Рядок "резюме" має бути абзацом, що складається з одного рядка з 80 стовпців на початку рядка документа.

source: (Our example docstring consists solely of a summary line, so the sample code doesn't have to change for this step.)
pt_br: (Наш приклад рядка документації складається лише з підсумкового рядка, тому зразок коду не потрібно змінювати для цього кроку.)

source: Above the docstring, enter the name of the function, followed by a blank line. This should be the Python name of the function, and should be the full dotted path to the function—it should start with the name of the module, include any sub-modules, and if the function is a method on a class it should include the class name too.
pt_br: Над рядком документації введіть назву функції та порожній рядок. Це має бути ім’я Python функції та має бути повний пунктирний шлях до функції — він має починатися з назви модуля, включати будь-які підмодулі, а якщо функція є методом у класі, вона має включати також ім'я класу.

source: If this is the first time that module or class has been used with Argument Clinic in this C file, you must declare the module and/or class. Proper Argument Clinic hygiene prefers declaring these in a separate block somewhere near the top of the C file, in the same way that include files and statics go at the top. (In our sample code we'll just show the two blocks next to each other.)
pt_br: Якщо це перший раз, коли модуль або клас використовується з Argument Clinic у цьому файлі C, ви повинні оголосити модуль та/або клас. Правильний аргумент Клініка гігієни вважає за краще оголошувати їх в окремому блоці десь у верхній частині файлу C, так само, як файли включення та статика йдуть у верхній частині. (У нашому прикладі коду ми просто покажемо два блоки поруч один з одним.)

source: The name of the class and module should be the same as the one seen by Python. Check the name defined in the :c:type:`PyModuleDef` or :c:type:`PyTypeObject` as appropriate.
pt_br: Ім’я класу та модуля має збігатися з тим, яке бачить Python. Перевірте назву, визначену в :c:type:`PyModuleDef` або :c:type:`PyTypeObject` відповідно.

source: When you declare a class, you must also specify two aspects of its type in C: the type declaration you'd use for a pointer to an instance of this class, and a pointer to the :c:type:`PyTypeObject` for this class.
pt_br: Коли ви оголошуєте клас, ви також повинні вказати два аспекти його типу в C: оголошення типу, яке ви б використовували для вказівника на екземпляр цього класу, і вказівник на :c:type:`PyTypeObject` для цього клас.

source: Declare each of the parameters to the function. Each parameter should get its own line. All the parameter lines should be indented from the function name and the docstring.
pt_br: Оголошіть кожен із параметрів функції. Для кожного параметра має бути окремий рядок. Усі рядки параметрів повинні мати відступ від назви функції та рядка документації.

source: The general form of these parameter lines is as follows:
pt_br: Bentuk umum baris parameter adalah sebagai berikut:

source: If the parameter has a default value, add that after the converter:
pt_br: Якщо параметр має значення за замовчуванням, додайте його після конвертера:

source: Argument Clinic's support for "default values" is quite sophisticated; please see :ref:`the section below on default values <default_values>` for more information.
pt_br: Підтримка "значення за замовчуванням" у Argument Clinic досить складна; див. :ref:`розділ нижче про значення за замовчуванням <default_values>` для отримання додаткової інформації.

source: Add a blank line below the parameters.
pt_br: Додайте порожній рядок під параметрами.

source: What's a "converter"? It establishes both the type of the variable used in C, and the method to convert the Python value into a C value at runtime. For now you're going to use what's called a "legacy converter"—a convenience syntax intended to make porting old code into Argument Clinic easier.
pt_br: Що таке "конвертер"? Він визначає як тип змінної, що використовується в C, так і метод перетворення значення Python у значення C під час виконання. Наразі ви використовуватимете так званий "застарілий конвертер" — зручний синтаксис, призначений для полегшення перенесення старого коду в Argument Clinic.

source: For each parameter, copy the "format unit" for that parameter from the ``PyArg_Parse()`` format argument and specify *that* as its converter, as a quoted string. ("format unit" is the formal name for the one-to-three character substring of the ``format`` parameter that tells the argument parsing function what the type of the variable is and how to convert it. For more on format units please see :ref:`arg-parsing`.)
pt_br: Для кожного параметра скопіюйте "одиницю формату" для цього параметра з аргументу формату ``PyArg_Parse()`` і вкажіть *that* як його конвертер, як рядок у лапках. ("одиниця формату" — це формальна назва підрядка від одного до трьох символів параметра ``format``, який повідомляє функції аналізу аргументу, який тип змінної та як її перетворити. Докладніше про одиниці формату див. :ref:`arg-parsing`.)

source: For multicharacter format units like ``z#``, use the entire two-or-three character string.
pt_br: Для одиниць багатосимвольного формату, таких як ``z#``, використовуйте весь рядок із двох або трьох символів.

source: If your function has ``|`` in the format string, meaning some parameters have default values, you can ignore it. Argument Clinic infers which parameters are optional based on whether or not they have default values.
pt_br: Якщо ваша функція має ``|`` у рядку формату, тобто деякі параметри мають значення за замовчуванням, ви можете ігнорувати це. Argument Clinic визначає, які параметри є необов’язковими, залежно від того, чи мають вони значення за замовчуванням.

source: If your function has ``$`` in the format string, meaning it takes keyword-only arguments, specify ``*`` on a line by itself before the first keyword-only argument, indented the same as the parameter lines.
pt_br: Якщо у вашій функції є ``$`` у рядку формату, тобто вона приймає лише ключові аргументи, вкажіть ``*`` в окремому рядку перед першим ключовим аргументом із таким же відступом, як і рядки параметрів.

source: (``_pickle.Pickler.dump`` has neither, so our sample is unchanged.)
pt_br: (``_pickle.Pickler.dump`` не має жодного, тому наш зразок не змінився.)

source: If the existing C function calls :c:func:`PyArg_ParseTuple` (as opposed to :c:func:`PyArg_ParseTupleAndKeywords`), then all its arguments are positional-only.
pt_br: Якщо наявна функція C викликає :c:func:`PyArg_ParseTuple` (на відміну від :c:func:`PyArg_ParseTupleAndKeywords`), тоді всі її аргументи є лише позиційними.

source: To mark all parameters as positional-only in Argument Clinic, add a ``/`` on a line by itself after the last parameter, indented the same as the parameter lines.
pt_br: Щоб позначити всі параметри як позиційні лише в Argument Clinic, додайте ``/`` в окремому рядку після останнього параметра з таким же відступом, як і рядки параметрів.

source: Currently this is all-or-nothing; either all parameters are positional-only, or none of them are. (In the future Argument Clinic may relax this restriction.)
pt_br: Наразі це все або нічого; або всі параметри є лише позиційними, або жоден із них. (У майбутньому Argument Clinic може послабити це обмеження.)

source: It's helpful to write a per-parameter docstring for each parameter. But per-parameter docstrings are optional; you can skip this step if you prefer.
pt_br: Корисно написати рядок документації для кожного параметра. Але рядки документації для кожного параметра необов’язкові; ви можете пропустити цей крок, якщо хочете.
