Repository: python/python-docs-pt-br
Catalog: howto/free-threading-python.po
Languages: pt_br

source: Python support for free threading
pt_br: Suporte do Python para threads livres

source: Starting with the 3.13 release, CPython has support for a build of Python called :term:`free threading` where the :term:`global interpreter lock` (GIL) is disabled. Free-threaded execution allows for full utilization of the available processing power by running threads in parallel on available CPU cores. While not all software will benefit from this automatically, programs designed with threading in mind will run faster on multi-core hardware.
pt_br: A partir da versão 3.13, o CPython tem suporte para uma compilação do Python chamada :term:`threads livres` (em inglês, free threading), onde a :term:`trava global do interpretador` (GIL) está desabilitada. A execução com threads livres permite a utilização total do poder de processamento disponível, executando threads em paralelo nos núcleos de CPU disponíveis. Embora nem todos os softwares se beneficiem disso automaticamente, os programas projetados com uso de threads em mente serão executados mais rapidamente em hardware com vários núcleos.

source: The free-threaded mode is working and continues to be improved, but there is some additional overhead in single-threaded workloads compared to the regular build. Additionally, third-party packages, in particular ones with an :term:`extension module`, may not be ready for use in a free-threaded build, and will re-enable the :term:`GIL`.
pt_br: O modo com threads livres está funcionando e continua sendo aprimorado, mas há alguma sobrecarga adicional em cargas de trabalho de thread única em comparação com a construção regular. Além disso, pacotes de terceiros, em particular aqueles com um :term:`módulo de extensão`, podem não estar prontos para uso em uma construção com threads livres e reativarão a :term:`GIL`.

source: This document describes the implications of free threading for Python code. See :ref:`freethreading-extensions-howto` for information on how to write C extensions that support the free-threaded build.
pt_br: Este documento descreve as implicações de threads livres para o código Python. Veja :ref:`freethreading-extensions-howto` para informações sobre como escrever extensões C que oferecem suporte à construção com threads livres.

source: :pep:`703` – Making the Global Interpreter Lock Optional in CPython for an overall description of free-threaded Python.
pt_br: :pep:`703` – Tornando a trava global do interpretador opcional no CPython para uma descrição geral do Python com threads livres.

source: Installation
pt_br: Instalação

source: Starting with Python 3.13, the official macOS and Windows installers optionally support installing free-threaded Python binaries. The installers are available at https://www.python.org/downloads/.
pt_br: A partir do Python 3.13, os instaladores oficiais do macOS e do Windows oferecem suporte opcional à instalação de binários Python com threads livres. Os instaladores estão disponíveis em https://www.python.org/downloads/.

source: For information on other platforms, see the `Installing a Free-Threaded Python <https://py-free-threading.github.io/installing-cpython/>`_, a community-maintained installation guide for installing free-threaded Python.
pt_br: Para obter informações sobre outras plataformas, consulte `Instalando um Python com threads livres <https://py-free-threading.github.io/installing_cpython/>`_, um guia de instalação mantido pela comunidade para instalar o Python com threads livres.

source: When building CPython from source, the :option:`--disable-gil` configure option should be used to build a free-threaded Python interpreter.
pt_br: Ao construir o CPython a partir do código-fonte, a opção de configuração :option:`--disable-gil` deve ser usada para construir um interpretador Python com threads livres.

source: Identifying free-threaded Python
pt_br: Identificando um Python com threads livres

source: To check if the current interpreter supports free-threading, :option:`python -VV <-V>` and :data:`sys.version` contain "free-threading build". The new :func:`sys._is_gil_enabled` function can be used to check whether the GIL is actually disabled in the running process.
pt_br: Para verificar se o interpretador atual oferece suporte a threads livres, :option:`python -VV <-V>` e :data:`sys.version` contêm "free-threading build". A nova função :func:`sys._is_gil_enabled` pode ser usada para verificar se a GIL está realmente desabilitada no processo em execução.

source: The ``sysconfig.get_config_var("Py_GIL_DISABLED")`` configuration variable can be used to determine whether the build supports free threading. If the variable is set to ``1``, then the build supports free threading. This is the recommended mechanism for decisions related to the build configuration.
pt_br: A variável de configuração ``sysconfig.get_config_var("Py_GIL_DISABLED")`` pode ser usada para determinar se a compilação tem suporte a threads livres. Se a variável for definida como ``1``, a compilação tem suporte a threads livres. Este é o mecanismo recomendado para decisões relacionadas à configuração da construção.

source: The global interpreter lock in free-threaded Python
pt_br: A trava global do interpretador no Python com threads livres

source: Free-threaded builds of CPython support optionally running with the GIL enabled at runtime using the environment variable :envvar:`PYTHON_GIL` or the command-line option :option:`-X gil`.
pt_br: Construções com threads livres do CPython oferecem suporte a opcionalmente executar com a GIL habilitada em tempo de execução usando a variável de ambiente :envvar:`PYTHON_GIL` ou a opção de linha de comando :option:`-X gil`.

source: The GIL may also automatically be enabled when importing a C-API extension module that is not explicitly marked as supporting free threading. A warning will be printed in this case.
pt_br: A GIL também pode ser habilitada automaticamente ao importar um módulo de extensão da API C que não esteja explicitamente marcado como oferecendo suporte a threads livres. Um aviso será impresso neste caso.

source: In addition to individual package documentation, the following websites track the status of popular packages support for free threading:
pt_br: Além da documentação de pacotes individuais, os seguintes sites rastreiam o status do suporte de pacotes populares para threads livres:

source: Thread safety
pt_br: Segurança nas threads

source: The free-threaded build of CPython aims to provide similar thread-safety behavior at the Python level to the default GIL-enabled build. Built-in types like :class:`dict`, :class:`list`, and :class:`set` use internal locks to protect against concurrent modifications in ways that behave similarly to the GIL. However, Python has not historically guaranteed specific behavior for concurrent modifications to these built-in types, so this should be treated as a description of the current implementation, not a guarantee of current or future behavior.
pt_br: A construção com threads livres do CPython visa fornecer comportamento de segurança às threads semelhante no nível do Python à construção padrão com GIL habilitada. Tipos embutidos como :class:`dict`, :class:`list` e :class:`set` usam travas internas para proteger contra modificações simultâneas de maneiras que se comportam de forma semelhante à GIL. No entanto, o Python não garantiu historicamente um comportamento específico para modificações simultâneas a esses tipos embutidos, portanto, isso deve ser tratado como uma descrição da implementação atual, não uma garantia de comportamento atual ou futuro.

source: It's recommended to use the :class:`threading.Lock` or other synchronization primitives instead of relying on the internal locks of built-in types, when possible.
pt_br: É recomendável usar :class:`threading.Lock` ou outras primitivas de sincronização em vez de depender de travas internas de tipos embutidos, quando possível.

source: Known limitations
pt_br: Limitações conhecidas

source: This section describes known limitations of the free-threaded CPython build.
pt_br: Esta seção descreve as limitações conhecidas da construção do Python com threads livres.

source: Immortalization
pt_br: Imortalização

source: The free-threaded build of the 3.13 release makes some objects :term:`immortal`. Immortal objects are not deallocated and have reference counts that are never modified. This is done to avoid reference count contention that would prevent efficient multi-threaded scaling.
pt_br: A construção com threads livres da versão 3.13 torna alguns objetos :term:`imortais <imortal>`. Objetos imortais não são desalocados e têm contagens de referência que nunca são modificadas. Isso é feito para evitar contenção de contagem de referências que impediria o dimensionamento multithread eficiente.

source: An object will be made immortal when a new thread is started for the first time after the main thread is running. The following objects are immortalized:
pt_br: Um objeto será tornado imortal quando um novo thread for iniciado pela primeira vez após o thread principal estar em execução. Os seguintes objetos são imortalizados:

source: :ref:`function <user-defined-funcs>` objects declared at the module level
pt_br: objetos :ref:`função <user-defined-funcs>` declarados no nível de módulo

source: :ref:`method <instance-methods>` descriptors
pt_br: descritores de :ref:`métodos <instance-methods>`

source: :ref:`code <code-objects>` objects
pt_br: objetos :ref:`código <code-objects>`

source: :term:`module` objects and their dictionaries
pt_br: objetos :term:`módulo` e seus dicionários

source: :ref:`classes <classes>` (type objects)
pt_br: :ref:`classes <classes>` (objetos de tipo)

source: Because immortal objects are never deallocated, applications that create many objects of these types may see increased memory usage under Python 3.13. This has been addressed in the 3.14 release, where the aforementioned objects use deferred reference counting to avoid reference count contention.
pt_br: Como objetos imortais nunca são desalocados, aplicações que criam muitos objetos desses tipos podem ver aumento no uso de memória no Python 3.13. Isso foi corrigido na versão 3.14, na qual os objetos mencionados utilizam contagem de referências diferida para evitar contenção de contagem de referências.

source: Additionally, numeric and string literals in the code as well as strings returned by :func:`sys.intern` are also immortalized in the 3.13 release. This behavior is part of the 3.14 release as well and it is expected to remain in future free-threaded builds.
pt_br: Além disso, literais numéricos e literal de string no código, bem como strings retornadas por :func:`sys.intern` também são imortalizados na versão 3.13. Este comportamento é parte da versão 3.14 também e é esperado permaneça em futuras construções com threads livres.

source: Frame objects
pt_br: Objetos quadro

source: It is not safe to access :ref:`frame <frame-objects>` objects from other threads and doing so may cause your program to crash . This means that :func:`sys._current_frames` is generally not safe to use in a free-threaded build. Functions like :func:`inspect.currentframe` and :func:`sys._getframe` are generally safe as long as the resulting frame object is not passed to another thread.
pt_br: Não é seguro acessar objetos :ref:`quadro <frame-objects>` de outros threads e fazer isso pode fazer com que seu programa trave. Isso significa que :func:`sys._current_frames` geralmente não é seguro para uso em uma construção com threads livres. Funções como :func:`inspect.currentframe` e :func:`sys._getframe` são geralmente seguras, desde que o objeto quadro resultante não seja passado para outro thread.

source: Iterators
pt_br: Iteradores

source: Sharing the same iterator object between multiple threads is generally not safe and threads may see duplicate or missing elements when iterating or crash the interpreter.
pt_br: Compartilhar o mesmo objeto iterador entre vários threads geralmente não é seguro e os threads podem ver elementos duplicados ou ausentes ao iterar ou travar o interpretador.

source: Single-threaded performance
pt_br: Desempenho com thread única

source: The free-threaded build has additional overhead when executing Python code compared to the default GIL-enabled build. In 3.13, this overhead is about 40% on the `pyperformance <https://pyperformance.readthedocs.io/>`_ suite. Programs that spend most of their time in C extensions or I/O will see less of an impact. The largest impact is because the specializing adaptive interpreter (:pep:`659`) is disabled in the free-threaded build.
pt_br: A construção com threads livres tem sobrecarga adicional ao executar código Python em comparação com a construção padrão com GIL habilitada. Na versão 3.13, essa sobrecarga é de cerca de 40% no conjunto de ferramentas `pyperformance <https://pyperformance.readthedocs.io/>`_. Programas que passam a maior parte do tempo em extensões C ou E/S verão menos impacto. O maior impacto é porque o interpretador adaptativo especializado (:pep:`659`) está desabilitado na construção com threads livres.

source: The specializing adaptive interpreter has been re-enabled in a thread-safe way in the 3.14 release. The performance penalty on single-threaded code in free-threaded mode is now roughly 5-10%, depending on the platform and C compiler used.
pt_br: O interpretador adaptativo especializado foi reativado de forma segura para thread na versão 3.14. A perda de desempenho em código de thread única no modo threads livres agora é de aproximadamente 5 a 10%, dependendo da plataforma e do compilador C utilizado.

source: Behavioral changes
pt_br: Mudanças comportamentais

source: This section describes CPython behavioural changes with the free-threaded build.
pt_br: Esta seção descreve as mudanças comportamentais do CPython com a construção com threads livres.

source: Context variables
pt_br: Variáveis de contexto

source: In the free-threaded build, the flag :data:`~sys.flags.thread_inherit_context` is set to true by default which causes threads created with :class:`threading.Thread` to start with a copy of the :class:`~contextvars.Context()` of the caller of :meth:`~threading.Thread.start`. In the default GIL-enabled build, the flag defaults to false so threads start with an empty :class:`~contextvars.Context()`.
pt_br: Na construção com threads livres, o sinalizador :data:`~sys.flags.thread_inherit_context` é definido como true por padrão, o que faz com que threads criadas com :class:`threading.Thread` iniciem com uma cópia de :class:`~contextvars.Context()` do chamador de :meth:`~threading.Thread.start`. Na construção padrão com GIL habilitada, o sinalizador é definido como false por padrão, então as threads iniciam com um :class:`~contextvars.Context()` vazio.

source: Warning filters
pt_br: Filtros de aviso

source: In the free-threaded build, the flag :data:`~sys.flags.context_aware_warnings` is set to true by default. In the default GIL-enabled build, the flag defaults to false. If the flag is true then the :class:`warnings.catch_warnings` context manager uses a context variable for warning filters. If the flag is false then :class:`~warnings.catch_warnings` modifies the global filters list, which is not thread-safe. See the :mod:`warnings` module for more details.
pt_br: Na construção com threads livres, o sinalizador :data:`~sys.flags.context_aware_warnings` é definido como verdadeiro por padrão. Na construção com GIL habilitada, o sinalizador é definido como falso por padrão. Se o sinalizador for verdadeiro, o gerenciador de contexto :class:`warnings.catch_warnings` usa uma variável de contexto para filtros de aviso. Se o sinalizador for falso, :class:`~warnings.catch_warnings` modifica a lista de filtros globais, o que não é seguro para thread. Consulte o módulo :mod:`warnings` para obter mais detalhes.
