Repository: python/python-docs-pt-br
Catalog: howto/instrumentation.po
Languages: pt_br

source: Instrumenting CPython with DTrace and SystemTap
pt_br: Instrumentando o CPython com DTrace e SystemTap

source: author
pt_br: autor

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
pt_br: DTrace e SystemTap são ferramentas de monitoramento, cada uma fornecendo uma maneira de inspecionar o que os processos em um sistema de computador estão fazendo. Ambas usam linguagens específicas de domínio, permitindo que um usuário escreva scripts que:

source: filter which processes are to be observed
pt_br: filtrar quais processos devem ser observados

source: gather data from the processes of interest
pt_br: coletem dados dos processos de interesse

source: generate reports on the data
pt_br: gerem relatórios sobre os dados

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
pt_br: A partir do Python 3.6, o CPython pode ser criado com "marcadores" incorporados, também conhecidos como "sondas" (*probes*), que podem ser observados por um script DTrace ou SystemTap, facilitando o monitoramento do que os processos CPython em um sistema estão fazendo.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
pt_br: Os marcadores DTrace são detalhes de implementação do interpretador CPython. Não há garantias sobre a compatibilidade de sondas entre versões do CPython. Os scripts DTrace podem parar de funcionar ou funcionar incorretamente sem aviso ao alterar as versões do CPython.

source: Enabling the static markers
pt_br: Habilitando os marcadores estáticos

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
pt_br: O macOS vem com suporte embutido para DTrace. No Linux, para construir o CPython com os marcadores incorporados para SystemTap, as ferramentas de desenvolvimento SystemTap devem ser instaladas.

source: On a Linux machine, this can be done via::
pt_br: Em uma máquina Linux, isso pode ser feito via:

source: or::
pt_br: ou::

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
pt_br: O CPython deve então ser :option:`configurado com a opção --with-dtrace <--with-dtrace>`:

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
pt_br: No macOS, você pode listar as sondas DTrace disponíveis executando um processo Python em segundo plano e listando todas as sondas disponibilizadas pelo provedor Python::

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
pt_br: No Linux, você pode verificar se os marcadores estáticos do SystemTap estão presentes no binário compilado, observando se ele contém uma seção ".note.stapsdt".

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
pt_br: Se você construiu o Python como uma biblioteca compartilhada (com a opção de configuração :option:`--enable-shared`), você precisa procurar dentro da biblioteca compartilhada. Por exemplo::

source: Sufficiently modern readelf can print the metadata::
pt_br: Um readelf moderno o suficiente pode exibir os metadados::

source: The above metadata contains information for SystemTap describing how it can patch strategically placed machine code instructions to enable the tracing hooks used by a SystemTap script.
pt_br: Os metadados acima contêm informações sobre o SystemTap descrevendo como ele pode corrigir instruções de código de máquina estrategicamente posicionadas para habilitar os ganchos de rastreamento usados ​por um script do SystemTap.

source: Static DTrace probes
pt_br: Sondas estáticas do DTtrace

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
pt_br: O script DTrace de exemplo a seguir pode ser usado para mostrar a hierarquia de chamada/retorno de um script Python, rastreando apenas dentro da invocação de uma função chamada "start". Em outras palavras, invocações de função em tempo de importação não serão listadas:

source: It can be invoked like this::
pt_br: Pode ser invocado assim::

source: The output looks like this:
pt_br: O resultado deve ser algo assim:

source: Static SystemTap markers
pt_br: Marcadores estáticos do SystemTap

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
pt_br: A maneira de baixo nível de usar a integração do SystemTap é usar os marcadores estáticos diretamente. Isso requer que você declare explicitamente o arquivo binário que os contém.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
pt_br: Por exemplo, este script SystemTap pode ser usado para mostrar a hierarquia de chamada/retorno de um script Python:

source: where the columns are:
pt_br: sendo as colunas:

source: time in microseconds since start of script
pt_br: tempo em microssegundos desde o início do script

source: name of executable
pt_br: nome do executável

source: PID of process
pt_br: PID do processo

source: and the remainder indicates the call/return hierarchy as the script executes.
pt_br: e o restante indica a hierarquia de chamada/retorno conforme o script é executado.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
pt_br: Para uma construção com :option:`--enable-shared` do CPython, os marcadores estão contidos na biblioteca compartilhada libpython, e o caminho pontilhado da sonda precisa refletir isso. Por exemplo, esta linha do exemplo acima:

source: should instead read:
pt_br: deve ler-se em vez disso:

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
pt_br: (presumindo uma :ref:`construção de depuração <debug-build>` do CPython 3.6)

source: Available static markers
pt_br: Marcadores estáticos disponíveis

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
pt_br: Este marcador indica que a execução de uma função Python começou. Ele é acionado somente para funções Python puro (bytecode).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
pt_br: O nome do arquivo, o nome da função e o número da linha são fornecidos de volta ao script de rastreamento como argumentos posicionais, que devem ser acessados ​usando ``$arg1``, ``$arg2``, ``$arg3``:

source: ``$arg1`` : ``(const char *)`` filename, accessible using ``user_string($arg1)``
pt_br: ``$arg1`` : nome de arquivo como ``(const char *)``, acessível usando ``user_string($arg1)``

source: ``$arg2`` : ``(const char *)`` function name, accessible using ``user_string($arg2)``
pt_br: ``$arg2`` : nome da função como ``(const char *)``, acessível usando ``user_string($arg2)``

source: ``$arg3`` : ``int`` line number
pt_br: ``$arg3`` : número da linha como ``int``

source: This marker is the converse of :c:func:`!function__entry`, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
pt_br: Este marcador é o inverso de :c:func:`!function__entry`, e indica que a execução de uma função Python terminou (seja via ``return``, ou via uma exceção). Ele é acionado somente para funções Python puro (bytecode).

source: The arguments are the same as for :c:func:`!function__entry`
pt_br: Os argumentos são os mesmos de :c:func:`!function__entry`

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
pt_br: Este marcador indica que uma linha Python está prestes a ser executada. É o equivalente ao rastreamento linha por linha com um perfilador Python. Ele não é acionado dentro de funções C.

source: The arguments are the same as for :c:func:`!function__entry`.
pt_br: Os argumentos são os mesmos de :c:func:`!function__entry`.

source: Fires when the Python interpreter starts a garbage collection cycle. ``arg0`` is the generation to scan, like :func:`gc.collect`.
pt_br: Dispara quando o interpretador Python inicia um ciclo de coleta de lixo. ``arg0`` é a geração a ser percurrida, como :func:`gc.collect`.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
pt_br: Dispara quando o interpretador Python termina um ciclo de coleta de lixo. ``arg0`` é o número de objetos coletados.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
pt_br: Dispara antes de :mod:`importlib` tentar encontrar e carregar o módulo. ``arg0`` é o nome do módulo.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
pt_br: Dispara após a função find_and_load do :mod:`importlib` ser chamada. ``arg0`` é o nome do módulo, ``arg1`` indica se o módulo foi carregado com sucesso.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
pt_br: Dispara quando :func:`sys.audit` ou :c:func:`PySys_Audit` é chamada. ``arg0`` é o nome do evento como string C, ``arg1`` é um ponteiro :c:type:`PyObject` para um objeto tupla.

source: SystemTap Tapsets
pt_br: Tapsets de SystemTap

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
pt_br: A maneira mais avançada de usar a integração do SystemTap é usar um "tapset": o equivalente do SystemTap a uma biblioteca, que oculta alguns dos detalhes de nível inferior dos marcadores estáticos.

source: Here is a tapset file, based on a non-shared build of CPython:
pt_br: Aqui está um arquivo tapset, baseado em uma construção não compartilhada do CPython:

source: /* Provide a higher-level wrapping around the function__entry and function__return markers: \*/ probe python.function.entry = process("python").mark("function__entry") { filename = user_string($arg1); funcname = user_string($arg2); lineno = $arg3; frameptr = $arg4 } probe python.function.return = process("python").mark("function__return") { filename = user_string($arg1); funcname = user_string($arg2); lineno = $arg3; frameptr = $arg4 }
pt_br: /* Fornece um envólucro de mais alto nível em volta dos marcadores function__entry e function__return: \*/ probe python.function.entry = process("python").mark("function__entry") { filename = user_string($arg1); funcname = user_string($arg2); lineno = $arg3; frameptr = $arg4 } probe python.function.return = process("python").mark("function__return") { filename = user_string($arg1); funcname = user_string($arg2); lineno = $arg3; frameptr = $arg4 }

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
pt_br: Se este arquivo for instalado no diretório de tapsets do SystemTap (por exemplo, ``/usr/share/systemtap/tapset``), estes pontos de sondagem adicionais ficarão disponíveis:

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
pt_br: Este ponto de sondagem indica que a execução de uma função Python começou. Ele é acionado somente para funções Python puro (bytecode).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
pt_br: Este ponto de sondagem é o inverso de ``python.function.return``, e indica que a execução de uma função Python terminou (seja via ``return``, ou via uma exceção). Ele é acionado somente para funções Python puro (bytecode).

source: Examples
pt_br: Exemplos

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
pt_br: Este script SystemTap usa o tapset acima para implementar de forma mais limpa o exemplo dado acima de rastreamento da hierarquia de chamada de função Python, sem precisar na diretamente

source: The following script uses the tapset above to provide a top-like view of all running CPython code, showing the top 20 most frequently entered bytecode frames, each second, across the whole system:
pt_br: O script a seguir usa o tapset acima para fornecer uma visão geral de todo o código CPython em execução, mostrando os 20 quadros de bytecode mais frequentemente inseridos, a cada segundo, em todo o sistema:
