Repository: python/python-docs-pt-br
Catalog: howto/ipaddress.po
Languages: pt_br

source: An introduction to the ipaddress module
pt_br: Uma introdução ao módulo ipaddress

source: author
pt_br: autor

source: Overview
pt_br: Visão Geral

source: This document aims to provide a gentle introduction to the :mod:`ipaddress` module. It is aimed primarily at users that aren't already familiar with IP networking terminology, but may also be useful to network engineers wanting an overview of how :mod:`ipaddress` represents IP network addressing concepts.
pt_br: Este documento tem como objetivo prover uma suave introdução ao módulo :mod:`ipaddress`. Ele é direcionado primeiramente para usuários que ainda não são familiarizados com a terminologia de rede IP, mas também pode ser útil para engenheiros de rede que querem uma visão geral de como :mod:`ipaddress` representa os conceitos de endereçamento de rede IP.

source: Creating Address/Network/Interface objects
pt_br: Criando objetos de Endereço/Rede/Interface

source: Since :mod:`ipaddress` is a module for inspecting and manipulating IP addresses, the first thing you'll want to do is create some objects. You can use :mod:`ipaddress` to create objects from strings and integers.
pt_br: Como :mod:`ipaddress` é um módulo para inspecionar e manipular endereços IP, a primeira coisa que você deseja fazer é criar alguns objetos. Você pode usar :mod:`ipaddress` para criar objetos a partir de strings e inteiros.

source: A Note on IP Versions
pt_br: Uma observação sobre versões do IP

source: For readers that aren't particularly familiar with IP addressing, it's important to know that the Internet Protocol (IP) is currently in the process of moving from version 4 of the protocol to version 6. This transition is occurring largely because version 4 of the protocol doesn't provide enough addresses to handle the needs of the whole world, especially given the increasing number of devices with direct connections to the internet.
pt_br: Para leitores que não estão particularmente familiarizados com o endereçamento IP, é importante saber que o Protocolo de Internet (IP) está atualmente em processo de mudança da versão 4 do protocolo para a versão 6. Esta transição está ocorrendo em grande parte porque a versão 4 do protocolo não fornece endereços suficientes para atender às necessidades do mundo inteiro, principalmente devido ao crescente número de dispositivos com conexões diretas à Internet.

source: Explaining the details of the differences between the two versions of the protocol is beyond the scope of this introduction, but readers need to at least be aware that these two versions exist, and it will sometimes be necessary to force the use of one version or the other.
pt_br: Explicar os detalhes das diferenças entre as duas versões do protocolo está além do escopo desta introdução, mas os leitores precisam pelo menos estar cientes de que essas duas versões existem, e às vezes será necessário forçar o uso de uma versão ou do outro.

source: IP Host Addresses
pt_br: Endereços IP de host

source: Addresses, often referred to as "host addresses" are the most basic unit when working with IP addressing. The simplest way to create addresses is to use the :func:`ipaddress.ip_address` factory function, which automatically determines whether to create an IPv4 or IPv6 address based on the passed in value:
pt_br: Os endereços, muitas vezes chamados de “endereços de host”, são a unidade mais básica ao trabalhar com endereçamento IP. A maneira mais simples de criar endereços é usar a função de fábrica :func:`ipaddress.ip_address`, que determina automaticamente se deve ser criado um endereço IPv4 ou IPv6 com base no valor passado:

source: Addresses can also be created directly from integers. Values that will fit within 32 bits are assumed to be IPv4 addresses::
pt_br: Os endereços também podem ser criados diretamente a partir de números inteiros. Os valores que cabem em 32 bits são considerados endereços IPv4::

source: To force the use of IPv4 or IPv6 addresses, the relevant classes can be invoked directly. This is particularly useful to force creation of IPv6 addresses for small integers::
pt_br: Para forçar o uso de endereços IPv4 ou IPv6, as classes relevantes podem ser invocadas diretamente. Isto é particularmente útil para forçar a criação de endereços IPv6 para números inteiros pequenos:

source: Defining Networks
pt_br: Definindo redes

source: Host addresses are usually grouped together into IP networks, so :mod:`ipaddress` provides a way to create, inspect and manipulate network definitions. IP network objects are constructed from strings that define the range of host addresses that are part of that network. The simplest form for that information is a "network address/network prefix" pair, where the prefix defines the number of leading bits that are compared to determine whether or not an address is part of the network and the network address defines the expected value of those bits.
pt_br: Endereços de host geralmente são agrupados em redes IP, então :mod:`ipaddress` fornece uma maneira de criar, inspecionar e manipular definições de rede. Os objetos de rede IP são construídos a partir de strings que definem o intervalo de endereços de host que fazem parte dessa rede. A forma mais simples para essa informação é um par de "endereço de rede/prefixo de rede", onde o prefixo define o número de bits iniciais que são comparados para determinar se um endereço faz ou não parte da rede e o endereço de rede define o valor esperado daqueles bits.

source: As for addresses, a factory function is provided that determines the correct IP version automatically::
pt_br: Quanto aos endereços, é fornecida uma função de fábrica que determina automaticamente a versão correta do IP:

source: Network objects cannot have any host bits set. The practical effect of this is that ``192.0.2.1/24`` does not describe a network. Such definitions are referred to as interface objects since the ip-on-a-network notation is commonly used to describe network interfaces of a computer on a given network and are described further in the next section.
pt_br: Os objetos de rede não podem ter nenhum bit de host definido. O efeito prático disso é que ``192.0.2.1/24`` não descreve uma rede. Tais definições são chamadas de objetos interface, uma vez que a notação "ip-em-uma-rede" é comumente usada para descrever interfaces de rede de um computador em uma determinada rede e é descrita mais detalhadamente na próxima seção.

source: By default, attempting to create a network object with host bits set will result in :exc:`ValueError` being raised. To request that the additional bits instead be coerced to zero, the flag ``strict=False`` can be passed to the constructor::
pt_br: Por padrão, tentar criar um objeto rede com bits de host definidos resultará na exceção :exc:`ValueError` ser levantada. Para solicitar que os bits adicionais sejam forçados a zero, o sinalizador ``strict=False`` pode ser passada para o construtor::

source: While the string form offers significantly more flexibility, networks can also be defined with integers, just like host addresses. In this case, the network is considered to contain only the single address identified by the integer, so the network prefix includes the entire network address::
pt_br: Embora o formato string ofereça significativamente mais flexibilidade, as redes também podem ser definidas com números inteiros, assim como os endereços de host. Neste caso, considera-se que a rede contém apenas o endereço único identificado pelo número inteiro, portanto o prefixo da rede inclui todo o endereço da rede::

source: As with addresses, creation of a particular kind of network can be forced by calling the class constructor directly instead of using the factory function.
pt_br: Tal como acontece com os endereços, a criação de um tipo específico de rede pode ser forçada chamando diretamente o construtor da classe em vez de usar a função de fábrica.

source: Host Interfaces
pt_br: Interfaces do host

source: As mentioned just above, if you need to describe an address on a particular network, neither the address nor the network classes are sufficient. Notation like ``192.0.2.1/24`` is commonly used by network engineers and the people who write tools for firewalls and routers as shorthand for "the host ``192.0.2.1`` on the network ``192.0.2.0/24``", Accordingly, :mod:`ipaddress` provides a set of hybrid classes that associate an address with a particular network. The interface for creation is identical to that for defining network objects, except that the address portion isn't constrained to being a network address.
pt_br: Conforme mencionado acima, se você precisar descrever um endereço em uma rede específica, nem o endereço nem as classes de rede serão suficientes. Notação como ``192.0.2.1/24`` é comumente usada por engenheiros de rede e pessoas que escrevem ferramentas para firewalls e roteadores como uma abreviação para "o host ``192.0.2.1`` na rede ``192.0.2.0/24``", Consequentemente, :mod:`ipaddress` fornece um conjunto de classes híbridas que associam um endereço a uma rede específica. A interface para criação é idêntica àquela para definição de objetos de rede, exceto que a parte do endereço não está restrita a ser um endereço de rede.

source: Integer inputs are accepted (as with networks), and use of a particular IP version can be forced by calling the relevant constructor directly.
pt_br: Entradas de inteiros são aceitas (como acontece com redes), e o uso de uma versão IP específica pode ser forçado chamando diretamente o construtor relevante.

source: Inspecting Address/Network/Interface Objects
pt_br: Inspecionando objetos endereço/rede/interface

source: You've gone to the trouble of creating an IPv(4|6)(Address|Network|Interface) object, so you probably want to get information about it. :mod:`ipaddress` tries to make doing this easy and intuitive.
pt_br: Você se deu ao trabalho de criar um objeto IPv(4|6)(Address|Network|Interface) e provavelmente deseja obter informações sobre ele. :mod:`ipaddress` tenta tornar isso fácil e intuitivo.

source: Extracting the IP version::
pt_br: Extraindo a versão do IP::

source: Obtaining the network from an interface::
pt_br: Obtendo a rede de uma interface::

source: Finding out how many individual addresses are in a network::
pt_br: Descobrindo quantos endereços individuais estão em uma rede::

source: Iterating through the "usable" addresses on a network::
pt_br: Iterando através dos endereços "utilizáveis" em uma rede::

source: Obtaining the netmask (i.e. set bits corresponding to the network prefix) or the hostmask (any bits that are not part of the netmask):
pt_br: Obtendo a máscara de rede (ou seja, definir bits correspondentes ao prefixo da rede) ou a máscara de host (qualquer bit que não faça parte da máscara de rede):

source: Exploding or compressing the address::
pt_br: Explodindo ou compactando o endereço::

source: While IPv4 doesn't support explosion or compression, the associated objects still provide the relevant properties so that version neutral code can easily ensure the most concise or most verbose form is used for IPv6 addresses while still correctly handling IPv4 addresses.
pt_br: Embora o IPv4 não tenha suporte a explosão ou compactação, os objetos associados ainda fornecem as propriedades relevantes para que o código de versão neutra possa facilmente garantir que o formato mais conciso ou mais detalhado seja usado para endereços IPv6, ao mesmo tempo que manipula corretamente os endereços IPv4.

source: Networks as lists of Addresses
pt_br: Redes como listas de Addresses

source: It's sometimes useful to treat networks as lists. This means it is possible to index them like this::
pt_br: Às vezes é útil tratar redes como listas. Isso significa que é possível indexá-las assim::

source: It also means that network objects lend themselves to using the list membership test syntax like this::
pt_br: Isso também significa que os objetos de rede se prestam ao uso da sintaxe de teste de pertinência de lista como esta:

source: if address in network: # do something
pt_br: if endereço in rede: # faz algo

source: Containment testing is done efficiently based on the network prefix::
pt_br: O teste de contenção é feito de forma eficiente com base no prefixo de rede::

source: Comparisons
pt_br: Comparações

source: :mod:`ipaddress` provides some simple, hopefully intuitive ways to compare objects, where it makes sense::
pt_br: :mod:`ipaddress` fornece algumas maneiras simples e, esperançosamente, intuitivas de comparar objetos, onde faz sentido::

source: A :exc:`TypeError` exception is raised if you try to compare objects of different versions or different types.
pt_br: Uma exceção :exc:`TypeError` é levantada se você tentar comparar objetos de versões ou tipos diferentes.

source: Using IP Addresses with other modules
pt_br: Usando endereços IP com outros módulos

source: Other modules that use IP addresses (such as :mod:`socket`) usually won't accept objects from this module directly. Instead, they must be coerced to an integer or string that the other module will accept::
pt_br: Outros módulos que usam endereços IP (como :mod:`socket`) geralmente não aceitam objetos deste módulo diretamente. Em vez disso, eles devem ser convertidos para um inteiro ou string que o outro módulo aceitará::

source: Getting more detail when instance creation fails
pt_br: Obtendo mais detalhes quando a criação da instância falha

source: When creating address/network/interface objects using the version-agnostic factory functions, any errors will be reported as :exc:`ValueError` with a generic error message that simply says the passed in value was not recognized as an object of that type. The lack of a specific error is because it's necessary to know whether the value is *supposed* to be IPv4 or IPv6 in order to provide more detail on why it has been rejected.
pt_br: Ao criar objetos de endereço/rede/interface usando as funções de fábrica agnósticas de versão, quaisquer erros serão relatados como :exc:`ValueError` com uma mensagem de erro genérica que simplesmente diz que o valor passado não foi reconhecido como um objeto daquele tipo. A falta de um erro específico é porque é necessário saber se o valor *supõe* ser IPv4 ou IPv6 para fornecer mais detalhes sobre o motivo de sua rejeição.

source: To support use cases where it is useful to have access to this additional detail, the individual class constructors actually raise the :exc:`ValueError` subclasses :exc:`ipaddress.AddressValueError` and :exc:`ipaddress.NetmaskValueError` to indicate exactly which part of the definition failed to parse correctly.
pt_br: Para dar suporte a casos de uso em que é útil ter acesso a esse detalhe adicional, os construtores de classe individuais na verdade geram as subclasses :exc:`ValueError` :exc:`ipaddress.AddressValueError` e :exc:`ipaddress.NetmaskValueError` para indicar exatamente qual parte da definição falhou ao ser analisada corretamente.

source: The error messages are significantly more detailed when using the class constructors directly. For example::
pt_br: As mensagens de erro são significativamente mais detalhadas ao usar os construtores de classe diretamente. Por exemplo::

source: However, both of the module specific exceptions have :exc:`ValueError` as their parent class, so if you're not concerned with the particular type of error, you can still write code like the following::
pt_br: Entretanto, ambas as exceções específicas do módulo têm :exc:`ValueError` como classe pai, então se você não estiver preocupado com o tipo específico de erro, você ainda pode escrever código como o seguinte::

source: try: network = ipaddress.IPv4Network(address) except ValueError: print('address/netmask is invalid for IPv4:', address)
pt_br: try: network = ipaddress.IPv4Network(address) except ValueError: print('endereço/máscara de rede é inválida para IPv4:', address)
