Repository: python/python-docs-pt-br
Catalog: howto/logging-cookbook.po
Languages: pt_br

source: For logging to work interoperably between any third-party libraries and your code, decisions about formatting need to be made at the level of the individual logging call. This opens up a couple of ways in which alternative formatting styles can be accommodated.
pt_br: Щоб журналювання працювало сумісно між будь-якими сторонніми бібліотеками та вашим кодом, рішення щодо форматування потрібно приймати на рівні окремого виклику журналювання. Це відкриває кілька способів використання альтернативних стилів форматування.

source: Using LogRecord factories
pt_br: Використання фабрик LogRecord

source: In Python 3.2, along with the :class:`~logging.Formatter` changes mentioned above, the logging package gained the ability to allow users to set their own :class:`LogRecord` subclasses, using the :func:`setLogRecordFactory` function. You can use this to set your own subclass of :class:`LogRecord`, which does the Right Thing by overriding the :meth:`~LogRecord.getMessage` method. The base class implementation of this method is where the ``msg % args`` formatting happens, and where you can substitute your alternate formatting; however, you should be careful to support all formatting styles and allow %-formatting as the default, to ensure interoperability with other code. Care should also be taken to call ``str(self.msg)``, just as the base implementation does.
pt_br: У Python 3.2 разом зі змінами :class:`~logging.Formatter`, згаданими вище, пакет журналювання отримав можливість дозволяти користувачам встановлювати власні підкласи :class:`LogRecord` за допомогою функції :func:`setLogRecordFactory` . Ви можете використовувати це, щоб установити власний підклас :class:`LogRecord`, який робить правильні речі, замінюючи метод :meth:`~LogRecord.getMessage`. Реалізація базового класу цього методу є місцем, де відбувається форматування ``msg % args``, і де ви можете замінити своє альтернативне форматування; однак ви повинні бути обережними, щоб підтримувати всі стилі форматування та дозволити %-formatting як типовий, щоб забезпечити взаємодію з іншим кодом. Слід також подбати про те, щоб викликати ``str(self.msg)``, як це робить базова реалізація.

source: Refer to the reference documentation on :func:`setLogRecordFactory` and :class:`LogRecord` for more information.
pt_br: Зверніться до довідкової документації щодо :func:`setLogRecordFactory` і :class:`LogRecord` для отримання додаткової інформації.

source: Using custom message objects
pt_br: Використання настроюваних об’єктів повідомлення

source: There is another, perhaps simpler way that you can use {}- and $- formatting to construct your individual log messages. You may recall (from :ref:`arbitrary-object-messages`) that when logging you can use an arbitrary object as a message format string, and that the logging package will call :func:`str` on that object to get the actual format string. Consider the following two classes::
pt_br: Існує інший, можливо, простіший спосіб використання форматування {}- і $- для створення індивідуальних повідомлень журналу. Ви можете пам’ятати (з :ref:`arbitrary-object-messages`), що під час журналювання ви можете використовувати довільний об’єкт як рядок формату повідомлення, і що пакет журналювання викличе :func:`str` для цього об’єкта, щоб отримати рядок фактичного формату. Розглянемо наступні два класи:

source: Either of these can be used in place of a format string, to allow {}- or $-formatting to be used to build the actual "message" part which appears in the formatted log output in place of “%(message)s” or “{message}” or “$message”. If you find it a little unwieldy to use the class names whenever you want to log something, you can make it more palatable if you use an alias such as ``M`` or ``_`` for the message (or perhaps ``__``, if you are using ``_`` for localization).
pt_br: Будь-яке з них можна використовувати замість рядка формату, щоб дозволити використовувати {}- або $-форматування для створення фактичної частини "повідомлення", яка з’являється у відформатованому журналі замість "%(message)s" або "{message". }" або "$message". Якщо вам здається трохи громіздким використовувати імена класів, коли ви хочете щось зареєструвати, ви можете зробити це більш приємним, якщо використаєте псевдонім, наприклад ``M`` або ``_`` для повідомлення (або, можливо ``__``, якщо ви використовуєте ``_`` для локалізації).

source: Examples of this approach are given below. Firstly, formatting with :meth:`str.format`::
pt_br: Приклади цього підходу наведені нижче. По-перше, форматування за допомогою :meth:`str.format`::

source: Secondly, formatting with :class:`string.Template`::
pt_br: По-друге, форматування за допомогою :class:`string.Template`::

source: One thing to note is that you pay no significant performance penalty with this approach: the actual formatting happens not when you make the logging call, but when (and if) the logged message is actually about to be output to a log by a handler. So the only slightly unusual thing which might trip you up is that the parentheses go around the format string and the arguments, not just the format string. That’s because the __ notation is just syntax sugar for a constructor call to one of the :samp:`{XXX}Message` classes shown above.
pt_br: Следует отметить одну вещь: при таком подходе вы не платите значительного снижения производительности: фактическое форматирование происходит не тогда, когда вы делаете вызов журнала, а когда (и если) зарегистрированное сообщение действительно собирается быть выведено в журнал обработчиком. Итак, единственная немного необычная вещь, которая может вас сбить с толку, это то, что круглые скобки заключают в себя строку формата и аргументы, а не только строку формата. Это потому, что нотация __ — это всего лишь синтаксический сахар для вызова конструктора одного из классов :samp:`{XXX}Message`, показанных выше.

source: Configuring filters with :func:`dictConfig`
pt_br: Налаштування фільтрів за допомогою :func:`dictConfig`

source: You *can* configure filters using :func:`~logging.config.dictConfig`, though it might not be obvious at first glance how to do it (hence this recipe). Since :class:`~logging.Filter` is the only filter class included in the standard library, and it is unlikely to cater to many requirements (it's only there as a base class), you will typically need to define your own :class:`~logging.Filter` subclass with an overridden :meth:`~logging.Filter.filter` method. To do this, specify the ``()`` key in the configuration dictionary for the filter, specifying a callable which will be used to create the filter (a class is the most obvious, but you can provide any callable which returns a :class:`~logging.Filter` instance). Here is a complete example::
pt_br: Ви *можете* налаштувати фільтри за допомогою :func:`~logging.config.dictConfig`, хоча на перший погляд може бути неочевидно, як це зробити (тому цей рецепт). Оскільки :class:`~logging.Filter` є єдиним класом фільтра, включеним у стандартну бібліотеку, і він навряд чи задовольнить багато вимог (він існує лише як базовий клас), вам зазвичай потрібно буде визначити свій власний Підклас :class:`~logging.Filter` із перевизначеним методом :meth:`~logging.Filter.filter`. Для цього вкажіть ключ ``()`` у словнику конфігурації для фільтра, вказавши виклик, який буде використовуватися для створення фільтра (клас є найбільш очевидним, але ви можете надати будь-який виклик, який повертає :class:`~logging.Filter` екземпляр). Ось повний приклад::

source: This example shows how you can pass configuration data to the callable which constructs the instance, in the form of keyword parameters. When run, the above script will print:
pt_br: У цьому прикладі показано, як ви можете передати дані конфігурації викликаному, який створює екземпляр, у формі параметрів ключових слів. Під час запуску наведений вище сценарій надрукує:

source: changed: hello
pt_br: изменено: привет

source: which shows that the filter is working as configured.
pt_br: який показує, що фільтр працює, як налаштовано.

source: A couple of extra points to note:
pt_br: Кілька додаткових моментів, на які варто звернути увагу:

source: If you can't refer to the callable directly in the configuration (e.g. if it lives in a different module, and you can't import it directly where the configuration dictionary is), you can use the form ``ext://...`` as described in :ref:`logging-config-dict-externalobj`. For example, you could have used the text ``'ext://__main__.MyFilter'`` instead of ``MyFilter`` in the above example.
pt_br: Якщо ви не можете звернутися до викликаного безпосередньо в конфігурації (наприклад, якщо він живе в іншому модулі, і ви не можете імпортувати його безпосередньо туди, де знаходиться словник конфігурації), ви можете використовувати форму ``ext://. ..``, як описано в :ref:`logging-config-dict-externalobj`. Наприклад, у наведеному вище прикладі ви могли використати текст ``'ext://__main__.MyFilter`` замість ``MyFilter``.

source: As well as for filters, this technique can also be used to configure custom handlers and formatters. See :ref:`logging-config-dict-userdef` for more information on how logging supports using user-defined objects in its configuration, and see the other cookbook recipe :ref:`custom-handlers` above.
pt_br: Як і для фільтрів, цю техніку також можна використовувати для налаштування нестандартних обробників і форматувальників. Перегляньте :ref:`logging-config-dict-userdef`, щоб дізнатися більше про те, як ведення журналу підтримує використання визначених користувачем об’єктів у своїй конфігурації, і перегляньте інший рецепт кулінарної книги :ref:`custom-handlers` вище.

source: Customized exception formatting
pt_br: Індивідуальне форматування винятків

source: There might be times when you want to do customized exception formatting - for argument's sake, let's say you want exactly one line per logged event, even when exception information is present. You can do this with a custom formatter class, as shown in the following example::
pt_br: Можуть бути випадки, коли ви захочете зробити налаштоване форматування винятків - заради аргументу, припустімо, що вам потрібен рівно один рядок на зареєстровану подію, навіть якщо присутня інформація про винятки. Ви можете зробити це за допомогою спеціального класу форматера, як показано в наступному прикладі:

source: When run, this produces a file with exactly two lines:
pt_br: Під час запуску створюється файл із рівно двома рядками:

source: While the above treatment is simplistic, it points the way to how exception information can be formatted to your liking. The :mod:`traceback` module may be helpful for more specialized needs.
pt_br: Хоча описане вище лікування є спрощеним, воно вказує шлях до того, як інформацію про винятки можна відформатувати на свій смак. Модуль :mod:`traceback` може бути корисним для більш спеціалізованих потреб.

source: Speaking logging messages
pt_br: Озвучення повідомлень журналу

source: There might be situations when it is desirable to have logging messages rendered in an audible rather than a visible format. This is easy to do if you have text-to-speech (TTS) functionality available in your system, even if it doesn't have a Python binding. Most TTS systems have a command line program you can run, and this can be invoked from a handler using :mod:`subprocess`. It's assumed here that TTS command line programs won't expect to interact with users or take a long time to complete, and that the frequency of logged messages will be not so high as to swamp the user with messages, and that it's acceptable to have the messages spoken one at a time rather than concurrently, The example implementation below waits for one message to be spoken before the next is processed, and this might cause other handlers to be kept waiting. Here is a short example showing the approach, which assumes that the ``espeak`` TTS package is available::
pt_br: Можуть бути ситуації, коли бажано, щоб повідомлення журналу відтворювалися в звуковому, а не у видимому форматі. Це легко зробити, якщо у вашій системі доступна функція перетворення тексту в мову (TTS), навіть якщо вона не має прив’язки Python. Більшість систем TTS мають програму командного рядка, яку можна запустити, і її можна викликати з обробника за допомогою :mod:`subprocess`. Тут передбачається, що програми командного рядка TTS не будуть взаємодіяти з користувачами або займати багато часу для виконання, і що частота зареєстрованих повідомлень не буде настільки високою, щоб завалювати користувача повідомленнями, і що прийнятно мати повідомлення промовляються по одному, а не одночасно. Приклад реалізації нижче очікує, поки одне повідомлення буде озвучено перед обробкою наступного, і це може спричинити очікування інших обробників. Ось короткий приклад, який демонструє підхід, який передбачає наявність пакета TTS ``espeak``::

source: When run, this script should say "Hello" and then "Goodbye" in a female voice.
pt_br: Під час запуску цей скрипт має сказати "Привіт", а потім "До побачення" жіночим голосом.

source: The above approach can, of course, be adapted to other TTS systems and even other systems altogether which can process messages via external programs run from a command line.
pt_br: Наведений вище підхід, звичайно, можна адаптувати до інших систем TTS і навіть до інших систем взагалі, які можуть обробляти повідомлення через зовнішні програми, що запускаються з командного рядка.

source: Buffering logging messages and outputting them conditionally
pt_br: Буферизація повідомлень журналу та їх умовне виведення

source: There might be situations where you want to log messages in a temporary area and only output them if a certain condition occurs. For example, you may want to start logging debug events in a function, and if the function completes without errors, you don't want to clutter the log with the collected debug information, but if there is an error, you want all the debug information to be output as well as the error.
pt_br: Можуть виникнути ситуації, коли потрібно реєструвати повідомлення у тимчасовій області та виводити їх лише у разі виникнення певної умови. Наприклад, ви можете почати реєструвати події налагодження у функції, і якщо функція завершиться без помилок, ви не хочете захаращувати журнал зібраною інформацією про налагодження, але якщо є помилка, ви хочете, щоб усі налагодження інформацію, яку потрібно вивести, а також помилку.

source: Here is an example which shows how you could do this using a decorator for your functions where you want logging to behave this way. It makes use of the :class:`logging.handlers.MemoryHandler`, which allows buffering of logged events until some condition occurs, at which point the buffered events are ``flushed`` - passed to another handler (the ``target`` handler) for processing. By default, the ``MemoryHandler`` flushed when its buffer gets filled up or an event whose level is greater than or equal to a specified threshold is seen. You can use this recipe with a more specialised subclass of ``MemoryHandler`` if you want custom flushing behavior.
pt_br: Ось приклад, який показує, як ви можете зробити це за допомогою декоратора для ваших функцій, де ви хочете, щоб журналювання поводилося таким чином. Він використовує :class:`logging.handlers.MemoryHandler`, який дозволяє буферизувати зареєстровані події, доки не відбудеться певна умова, після чого буферизовані події ``скидаються`` і передаються іншому обробнику (``ціль`` обробник) для обробки. За замовчуванням ``MemoryHandler`` очищується, коли його буфер заповнюється або спостерігається подія, рівень якої перевищує або дорівнює вказаному порогу. Ви можете використовувати цей рецепт із більш спеціалізованим підкласом ``MemoryHandler``, якщо вам потрібна спеціальна поведінка очищення.

source: The example script has a simple function, ``foo``, which just cycles through all the logging levels, writing to ``sys.stderr`` to say what level it's about to log at, and then actually logging a message at that level. You can pass a parameter to ``foo`` which, if true, will log at ERROR and CRITICAL levels - otherwise, it only logs at DEBUG, INFO and WARNING levels.
pt_br: Приклад сценарію має просту функцію, ``foo``, яка просто циклічно перебирає всі рівні журналювання, записуючи в ``sys.stderr``, щоб сказати, на якому рівні він збирається зареєструватися, а потім фактично записує повідомлення на цьому рівень. Ви можете передати параметр у ``foo``, який, якщо істина, буде реєструватися на рівнях ПОМИЛКА та КРИТИЧНИЙ - інакше він реєструватиме лише на рівнях НАЛАШТУВАННЯ, ІНФОРМАЦІЇ та ПОПЕРЕДЖЕННЯ.

source: The script just arranges to decorate ``foo`` with a decorator which will do the conditional logging that's required. The decorator takes a logger as a parameter and attaches a memory handler for the duration of the call to the decorated function. The decorator can be additionally parameterised using a target handler, a level at which flushing should occur, and a capacity for the buffer (number of records buffered). These default to a :class:`~logging.StreamHandler` which writes to ``sys.stderr``, ``logging.ERROR`` and ``100`` respectively.
pt_br: Сценарій лише організовує декорування ``foo`` за допомогою декоратора, який виконуватиме необхідне умовне журналювання. Декоратор приймає реєстратор як параметр і приєднує обробник пам’яті на час виклику декорованої функції. Декоратор може бути додатково параметризований за допомогою цільового обробника, рівня, на якому має відбуватися очищення, і ємності для буфера (кількість записів, буферизованих). За умовчанням це :class:`~logging.StreamHandler`, який записує в ``sys.stderr``, ``logging.ERROR`` і ``100`` відповідно.

source: Here's the script::
pt_br: Ось сценарій::

source: When this script is run, the following output should be observed:
pt_br: Під час виконання цього сценарію має спостерігатися такий результат:

source: As you can see, actual logging output only occurs when an event is logged whose severity is ERROR or greater, but in that case, any previous events at lower severities are also logged.
pt_br: Як ви можете бачити, фактичний вихід журналу відбувається лише тоді, коли реєструється подія, серйозність якої дорівнює ПОМИЛКІ або вище, але в цьому випадку також реєструються будь-які попередні події з нижчим рівнем серйозності.

source: You can of course use the conventional means of decoration::
pt_br: Ви, звичайно, можете використовувати звичайні засоби декору:

source: Sending logging messages to email, with buffering
pt_br: Отправка сообщений журнала на электронную почту с буферизацией

source: To illustrate how you can send log messages via email, so that a set number of messages are sent per email, you can subclass :class:`~logging.handlers.BufferingHandler`. In the following example, which you can adapt to suit your specific needs, a simple test harness is provided which allows you to run the script with command line arguments specifying what you typically need to send things via SMTP. (Run the downloaded script with the ``-h`` argument to see the required and optional arguments.)
pt_br: Чтобы проиллюстрировать, как вы можете отправлять сообщения журнала по электронной почте, чтобы определенное количество сообщений отправлялось по электронной почте, вы можете создать подкласс :class:`~logging.handlers.BufferingHandler`. В следующем примере, который вы можете адаптировать в соответствии со своими конкретными потребностями, представлена ​​простая тестовая программа, которая позволяет запускать сценарий с аргументами командной строки, определяющими, что вам обычно нужно для отправки данных через SMTP. (Запустите загруженный скрипт с аргументом ``-h``, чтобы увидеть обязательные и необязательные аргументы.)

source: If you run this script and your SMTP server is correctly set up, you should find that it sends eleven emails to the addressee you specify. The first ten emails will each have ten log messages, and the eleventh will have two messages. That makes up 102 messages as specified in the script.
pt_br: Если вы запустите этот сценарий и ваш SMTP-сервер настроен правильно, вы обнаружите, что он отправляет одиннадцать электронных писем указанному вами адресату. Первые десять электронных писем будут содержать по десять сообщений журнала, а одиннадцатое — по два сообщения. Это составляет 102 сообщения, как указано в сценарии.

source: Formatting times using UTC (GMT) via configuration
pt_br: Форматування часу за допомогою UTC (GMT) через налаштування

source: Sometimes you want to format times using UTC, which can be done using a class such as ``UTCFormatter``, shown below::
pt_br: Иногда вам нужно отформатировать время с использованием UTC, что можно сделать с помощью такого класса, как UTCFormatter, показанного ниже:

source: and you can then use the ``UTCFormatter`` in your code instead of :class:`~logging.Formatter`. If you want to do that via configuration, you can use the :func:`~logging.config.dictConfig` API with an approach illustrated by the following complete example::
pt_br: і тоді ви можете використовувати ``UTCFormatter`` у своєму коді замість :class:`~logging.Formatter`. Якщо ви хочете зробити це за допомогою конфігурації, ви можете використовувати :func:`~logging.config.dictConfig` API з підходом, проілюстрованим таким повним прикладом:

source: When this script is run, it should print something like:
pt_br: Коли цей сценарій запускається, він має надрукувати щось на кшталт:

source: showing how the time is formatted both as local time and UTC, one for each handler.
pt_br: показує, як час форматується як місцевий час, так і UTC, по одному для кожного обробника.

source: Using a context manager for selective logging
pt_br: Використання контекстного менеджера для вибіркового журналювання

source: There are times when it would be useful to temporarily change the logging configuration and revert it back after doing something. For this, a context manager is the most obvious way of saving and restoring the logging context. Here is a simple example of such a context manager, which allows you to optionally change the logging level and add a logging handler purely in the scope of the context manager::
pt_br: Бувають випадки, коли було б корисно тимчасово змінити конфігурацію журналювання та повернути її назад після певних дій. Для цього менеджер контексту є найбільш очевидним способом збереження та відновлення контексту журналювання. Ось простий приклад такого менеджера контексту, який дозволяє вам за бажанням змінити рівень журналювання та додати обробник журналювання виключно в межах контекстного менеджера::

source: If you specify a level value, the logger's level is set to that value in the scope of the with block covered by the context manager. If you specify a handler, it is added to the logger on entry to the block and removed on exit from the block. You can also ask the manager to close the handler for you on block exit - you could do this if you don't need the handler any more.
pt_br: Якщо ви вказуєте значення рівня, рівень реєстратора встановлюється на це значення в області блоку with, охопленого менеджером контексту. Якщо ви вкажете обробник, він додається до реєстратора під час входу до блоку та видаляється під час виходу з блоку. Ви також можете попросити менеджера закрити обробник для вас після виходу з блоку - ви можете зробити це, якщо вам більше не потрібен обробник.

source: To illustrate how it works, we can add the following block of code to the above::
pt_br: Щоб проілюструвати, як це працює, ми можемо додати наступний блок коду до наведеного вище:
