Repository: python/python-docs-pt-br
Catalog: howto/logging.po
Languages: pt_br

source: Note that the class names referenced in config files need to be either relative to the logging module, or absolute values which can be resolved using normal import mechanisms. Thus, you could use either :class:`~logging.handlers.WatchedFileHandler` (relative to the logging module) or ``mypackage.mymodule.MyHandler`` (for a class defined in package ``mypackage`` and module ``mymodule``, where ``mypackage`` is available on the Python import path).
pt_br: Зауважте, що назви класів, на які посилаються у конфігураційних файлах, мають бути або відносними до модуля журналювання, або абсолютними значеннями, які можна вирішити за допомогою звичайних механізмів імпорту. Таким чином, ви можете використовувати :class:`~logging.handlers.WatchedFileHandler` (щодо модуля журналювання) або ``mypackage.mymodule.MyHandler`` (для класу, визначеного в пакунку ``mypackage`` і модулі ``mymodule``, де ``mypackage`` доступний на шляху імпорту Python).

source: In Python 3.2, a new means of configuring logging has been introduced, using dictionaries to hold configuration information. This provides a superset of the functionality of the config-file-based approach outlined above, and is the recommended configuration method for new applications and deployments. Because a Python dictionary is used to hold configuration information, and since you can populate that dictionary using different means, you have more options for configuration. For example, you can use a configuration file in JSON format, or, if you have access to YAML processing functionality, a file in YAML format, to populate the configuration dictionary. Or, of course, you can construct the dictionary in Python code, receive it in pickled form over a socket, or use whatever approach makes sense for your application.
pt_br: У Python 3.2 було введено новий засіб конфігурації журналювання, використовуючи словники для зберігання конфігураційної інформації. Це забезпечує надмножину функціональних можливостей підходу на основі конфігураційного файлу, описаного вище, і є рекомендованим методом конфігурації для нових програм і розгортань. Оскільки словник Python використовується для зберігання конфігураційної інформації, і оскільки ви можете заповнювати цей словник різними засобами, у вас є більше можливостей для конфігурації. Наприклад, ви можете використовувати файл конфігурації у форматі JSON або, якщо у вас є доступ до функцій обробки YAML, файл у форматі YAML, щоб заповнити словник конфігурації. Або, звісно, ви можете побудувати словник у коді Python, отримати його в маринованому вигляді через сокет або використати будь-який підхід, який має сенс для вашої програми.

source: Here's an example of the same configuration as above, in YAML format for the new dictionary-based approach:
pt_br: Ось приклад тієї ж конфігурації, що й вище, у форматі YAML для нового підходу на основі словника:

source: For more information about logging using a dictionary, see :ref:`logging-config-api`.
pt_br: Для отримання додаткової інформації про журналювання за допомогою словника див. :ref:`logging-config-api`.

source: What happens if no configuration is provided
pt_br: O que acontece se nenhuma configuração é fornecida

source: If no logging configuration is provided, it is possible to have a situation where a logging event needs to be output, but no handlers can be found to output the event.
pt_br: Если конфигурация ведения журнала не указана, возможна ситуация, когда необходимо вывести событие журнала, но не удается найти обработчики для вывода этого события.

source: The event is output using a 'handler of last resort', stored in :data:`lastResort`. This internal handler is not associated with any logger, and acts like a :class:`~logging.StreamHandler` which writes the event description message to the current value of ``sys.stderr`` (therefore respecting any redirections which may be in effect). No formatting is done on the message - just the bare event description message is printed. The handler's level is set to ``WARNING``, so all events at this and greater severities will be output.
pt_br: Событие выводится с использованием «обработчика последней инстанции», хранящегося в :data:`lastResort`. Этот внутренний обработчик не связан ни с каким регистратором и действует как :class:`~logging.StreamHandler`, который записывает сообщение с описанием события в текущее значение ``sys.stderr`` (следовательно, с учетом любых перенаправлений, которые могут быть в эффект). В сообщении не выполняется форматирование — печатается только сообщение с описанием события. Уровень обработчика установлен на «ПРЕДУПРЕЖДЕНИЕ», поэтому будут выводиться все события этой и более серьезной важности.

source: For versions of Python prior to 3.2, the behaviour is as follows:
pt_br: Para versões do Python anteriores à 3.2, o comportamento é o seguinte:

source: If :data:`raiseExceptions` is ``False`` (production mode), the event is silently dropped.
pt_br: Если :data:`raiseExceptions` имеет значение ``False`` (рабочий режим), событие автоматически удаляется.

source: If :data:`raiseExceptions` is ``True`` (development mode), a message 'No handlers could be found for logger X.Y.Z' is printed once.
pt_br: Если :data:`raiseExceptions` имеет значение ``True`` (режим разработки), сообщение «Не удалось найти обработчики для регистратора XYZ» выводится один раз.

source: To obtain the pre-3.2 behaviour, :data:`lastResort` can be set to ``None``.
pt_br: Чтобы получить поведение версии до версии 3.2, для :data:`lastResort` можно установить значение ``None``.

source: Configuring Logging for a Library
pt_br: Налаштування журналювання для бібліотеки

source: When developing a library which uses logging, you should take care to document how the library uses logging - for example, the names of loggers used. Some consideration also needs to be given to its logging configuration. If the using application does not use logging, and library code makes logging calls, then (as described in the previous section) events of severity ``WARNING`` and greater will be printed to ``sys.stderr``. This is regarded as the best default behaviour.
pt_br: Розробляючи бібліотеку, яка використовує журналювання, ви повинні подбати про документування того, як бібліотека використовує журналювання - наприклад, імена використовуваних журналів. Певну увагу також слід приділити його конфігурації журналювання. Якщо програма, що використовує, не використовує журналювання, а код бібліотеки здійснює виклики журналювання, тоді (як описано в попередньому розділі) події серйозності ``ПОПЕРЕДЖЕННЯ`` і вище будуть надруковані в ``sys.stderr``. Це вважається найкращою поведінкою за умовчанням.

source: If for some reason you *don't* want these messages printed in the absence of any logging configuration, you can attach a do-nothing handler to the top-level logger for your library. This avoids the message being printed, since a handler will always be found for the library's events: it just doesn't produce any output. If the library user configures logging for application use, presumably that configuration will add some handlers, and if levels are suitably configured then logging calls made in library code will send output to those handlers, as normal.
pt_br: Якщо з якоїсь причини ви *не* хочете, щоб ці повідомлення друкувались за відсутності будь-якої конфігурації журналювання, ви можете приєднати обробник нічого не робити до реєстратора верхнього рівня для вашої бібліотеки. Це дозволяє уникнути друку повідомлення, оскільки для подій бібліотеки завжди буде знайдено обробник: він просто не створює жодних виводів. Якщо користувач бібліотеки налаштовує журналювання для використання програмою, імовірно, ця конфігурація додасть деякі обробники, і якщо рівні налаштовано відповідним чином, виклики журналювання, зроблені в коді бібліотеки, надсилатимуть вихідні дані цим обробникам, як зазвичай.

source: A do-nothing handler is included in the logging package: :class:`~logging.NullHandler` (since Python 3.1). An instance of this handler could be added to the top-level logger of the logging namespace used by the library (*if* you want to prevent your library's logged events being output to ``sys.stderr`` in the absence of logging configuration). If all logging by a library *foo* is done using loggers with names matching 'foo.x', 'foo.x.y', etc. then the code::
pt_br: Обробник нічого не робиться включено в пакет журналювання: :class:`~logging.NullHandler` (починаючи з Python 3.1). Екземпляр цього обробника можна додати до реєстратора верхнього рівня простору імен журналювання, який використовується бібліотекою (*якщо* ви хочете запобігти виведенню зареєстрованих у бібліотеці подій у ``sys.stderr`` за відсутності конфігурації журналювання ). Якщо все журналювання бібліотекою *foo* здійснюється за допомогою реєстраторів з іменами, що відповідають "foo.x", "foo.x.y" тощо, тоді код::

source: should have the desired effect. If an organisation produces a number of libraries, then the logger name specified can be 'orgname.foo' rather than just 'foo'.
pt_br: має мати бажаний ефект. Якщо організація виробляє декілька бібліотек, то ім’я реєстратора може бути "orgname.foo", а не просто "foo".

source: It is strongly advised that you *do not log to the root logger* in your library. Instead, use a logger with a unique and easily identifiable name, such as the ``__name__`` for your library's top-level package or module. Logging to the root logger will make it difficult or impossible for the application developer to configure the logging verbosity or handlers of your library as they wish.
pt_br: Настоятельно рекомендуется *не входить в корневой регистратор* вашей библиотеки. Вместо этого используйте средство ведения журнала с уникальным и легко идентифицируемым именем, например ``__name__`` для пакета или модуля верхнего уровня вашей библиотеки. Ведение журнала в корневом регистраторе затруднит или сделает невозможным для разработчика приложения настройку подробностей журналирования или обработчиков вашей библиотеки по своему усмотрению.

source: It is strongly advised that you *do not add any handlers other than* :class:`~logging.NullHandler` *to your library's loggers*. This is because the configuration of handlers is the prerogative of the application developer who uses your library. The application developer knows their target audience and what handlers are most appropriate for their application: if you add handlers 'under the hood', you might well interfere with their ability to carry out unit tests and deliver logs which suit their requirements.
pt_br: Настійно рекомендується *не додавати жодних обробників, окрім* :class:`~logging.NullHandler` *до реєстраторів вашої бібліотеки*. Це пояснюється тим, що конфігурація обробників є прерогативою розробника програми, який використовує вашу бібліотеку. Розробник програми знає свою цільову аудиторію та знає, які обробники найбільше підходять для їхньої програми: якщо ви додасте обробники "під капотом", ви цілком можете втрутитися в їх здатність виконувати модульні тести та доставляти журнали, які відповідають їхнім вимогам.

source: Logging Levels
pt_br: Níveis de Logging

source: The numeric values of logging levels are given in the following table. These are primarily of interest if you want to define your own levels, and need them to have specific values relative to the predefined levels. If you define a level with the same numeric value, it overwrites the predefined value; the predefined name is lost.
pt_br: Os valores númericos dos níveis de logging estão listados na tabela abaixo. Eles são principalmente de interesse se você quiser definir seus próprios níveis, e precisa deles para definir seus valores específicos relativos aos níveis predefinidos. Se você define um nível com o mesmo valor númerico, ele sobreescreve o valor predefinido; o nome predefinido é perdido.

source: Numeric value
pt_br: Valor numérico

source: Levels can also be associated with loggers, being set either by the developer or through loading a saved logging configuration. When a logging method is called on a logger, the logger compares its own level with the level associated with the method call. If the logger's level is higher than the method call's, no logging message is actually generated. This is the basic mechanism controlling the verbosity of logging output.
pt_br: Рівні також можуть бути пов’язані з реєстраторами, які встановлюються розробником або через завантаження збереженої конфігурації журналювання. Коли в реєстраторі викликається метод ведення журналу, реєстратор порівнює свій власний рівень із рівнем, пов’язаним із викликом методу. Якщо рівень реєстратора вищий, ніж виклик методу, повідомлення журналу фактично не генерується. Це основний механізм, який контролює докладність вихідних даних журналу.

source: Logging messages are encoded as instances of the :class:`~logging.LogRecord` class. When a logger decides to actually log an event, a :class:`~logging.LogRecord` instance is created from the logging message.
pt_br: Повідомлення журналу кодуються як екземпляри класу :class:`~logging.LogRecord`. Коли реєстратор вирішує фактично зареєструвати подію, екземпляр :class:`~logging.LogRecord` створюється з повідомлення журналу.

source: Logging messages are subjected to a dispatch mechanism through the use of :dfn:`handlers`, which are instances of subclasses of the :class:`Handler` class. Handlers are responsible for ensuring that a logged message (in the form of a :class:`LogRecord`) ends up in a particular location (or set of locations) which is useful for the target audience for that message (such as end users, support desk staff, system administrators, developers). Handlers are passed :class:`LogRecord` instances intended for particular destinations. Each logger can have zero, one or more handlers associated with it (via the :meth:`~Logger.addHandler` method of :class:`Logger`). In addition to any handlers directly associated with a logger, *all handlers associated with all ancestors of the logger* are called to dispatch the message (unless the *propagate* flag for a logger is set to a false value, at which point the passing to ancestor handlers stops).
pt_br: Повідомлення журналювання підлягають механізму відправлення за допомогою :dfn:`handlers`, які є екземплярами підкласів класу :class:`Handler`. Обробники відповідають за те, щоб зареєстроване повідомлення (у формі :class:`LogRecord`) потрапляло в певне місце (або набір місць), яке є корисним для цільової аудиторії цього повідомлення (наприклад, кінцевих користувачів, співробітники служби підтримки, системні адміністратори, розробники). Обробники передають екземпляри :class:`LogRecord`, призначені для певних місць призначення. Кожен реєстратор може мати нуль, один або більше пов’язаних з ним обробників (через метод :meth:`~Logger.addHandler` :class:`Logger`). На додаток до будь-яких обробників, безпосередньо пов’язаних із реєстратором, *усі обробники, пов’язані з усіма предками реєстратора* викликаються для надсилання повідомлення (якщо прапор *розповсюдження* для реєстратора не має значення false, після чого передача до обробників предків зупиняється).

source: Just as for loggers, handlers can have levels associated with them. A handler's level acts as a filter in the same way as a logger's level does. If a handler decides to actually dispatch an event, the :meth:`~Handler.emit` method is used to send the message to its destination. Most user-defined subclasses of :class:`Handler` will need to override this :meth:`~Handler.emit`.
pt_br: Як і для реєстраторів, обробники можуть мати пов’язані з ними рівні. Рівень обробника діє як фільтр так само, як і рівень реєстратора. Якщо обробник вирішує фактично відправити подію, метод :meth:`~Handler.emit` використовується для надсилання повідомлення до місця призначення. Більшість визначених користувачем підкласів :class:`Handler` повинні замінити цей :meth:`~Handler.emit`.

source: Custom Levels
pt_br: Спеціальні рівні

source: Defining your own levels is possible, but should not be necessary, as the existing levels have been chosen on the basis of practical experience. However, if you are convinced that you need custom levels, great care should be exercised when doing this, and it is possibly *a very bad idea to define custom levels if you are developing a library*. That's because if multiple library authors all define their own custom levels, there is a chance that the logging output from such multiple libraries used together will be difficult for the using developer to control and/or interpret, because a given numeric value might mean different things for different libraries.
pt_br: Визначення власних рівнів можливо, але це не обов’язково, оскільки існуючі рівні було обрано на основі практичного досвіду. Однак, якщо ви впевнені, що вам потрібні користувацькі рівні, слід бути дуже обережним, роблячи це, і це, можливо, *дуже погана ідея визначати користувацькі рівні, якщо ви розробляєте бібліотеку*. Це тому, що якщо кілька авторів бібліотек визначають власні власні рівні, існує ймовірність того, що вихід журналу з таких кількох бібліотек, які використовуються разом, розробнику буде важко контролювати та/або інтерпретувати, оскільки дане числове значення може означати різні речі для різних бібліотек.

source: Useful Handlers
pt_br: Корисні обробники

source: In addition to the base :class:`Handler` class, many useful subclasses are provided:
pt_br: Em adição à classe base :class:`Handler`, muitas subclasses úteis são fornecidas:

source: :class:`StreamHandler` instances send messages to streams (file-like objects).
pt_br: Екземпляри :class:`StreamHandler` надсилають повідомлення до потоків (файлоподібних об’єктів).

source: :class:`FileHandler` instances send messages to disk files.
pt_br: Екземпляри :class:`FileHandler` надсилають повідомлення до файлів на диску.

source: :class:`~handlers.BaseRotatingHandler` is the base class for handlers that rotate log files at a certain point. It is not meant to be instantiated directly. Instead, use :class:`~handlers.RotatingFileHandler` or :class:`~handlers.TimedRotatingFileHandler`.
pt_br: :class:`~handlers.BaseRotatingHandler` — це базовий клас для обробників, які обертають файли журналів у певний момент. Він не призначений для безпосереднього створення екземпляра. Замість цього використовуйте :class:`~handlers.RotatingFileHandler` або :class:`~handlers.TimedRotatingFileHandler`.

source: :class:`~handlers.RotatingFileHandler` instances send messages to disk files, with support for maximum log file sizes and log file rotation.
pt_br: Екземпляри :class:`~handlers.RotatingFileHandler` надсилають повідомлення до файлів на диску з підтримкою максимального розміру файлу журналу та ротації файлів журналу.

source: :class:`~handlers.TimedRotatingFileHandler` instances send messages to disk files, rotating the log file at certain timed intervals.
pt_br: :class:`~handlers.TimedRotatingFileHandler` екземпляри надсилають повідомлення до дискових файлів, чергуючи файл журналу через певні проміжки часу.

source: :class:`~handlers.SocketHandler` instances send messages to TCP/IP sockets. Since 3.4, Unix domain sockets are also supported.
pt_br: Екземпляри :class:`~handlers.SocketHandler` надсилають повідомлення до сокетів TCP/IP. Починаючи з версії 3.4, також підтримуються доменні сокети Unix.

source: :class:`~handlers.DatagramHandler` instances send messages to UDP sockets. Since 3.4, Unix domain sockets are also supported.
pt_br: Екземпляри :class:`~handlers.DatagramHandler` надсилають повідомлення до UDP-сокетів. Починаючи з версії 3.4, також підтримуються доменні сокети Unix.

source: :class:`~handlers.SMTPHandler` instances send messages to a designated email address.
pt_br: Екземпляри :class:`~handlers.SMTPHandler` надсилають повідомлення на вказану електронну адресу.

source: :class:`~handlers.SysLogHandler` instances send messages to a Unix syslog daemon, possibly on a remote machine.
pt_br: Екземпляри :class:`~handlers.SysLogHandler` надсилають повідомлення до демона системного журналу Unix, можливо, на віддаленій машині.

source: :class:`~handlers.NTEventLogHandler` instances send messages to a Windows NT/2000/XP event log.
pt_br: Екземпляри :class:`~handlers.NTEventLogHandler` надсилають повідомлення до журналу подій Windows NT/2000/XP.

source: :class:`~handlers.MemoryHandler` instances send messages to a buffer in memory, which is flushed whenever specific criteria are met.
pt_br: Екземпляри :class:`~handlers.MemoryHandler` надсилають повідомлення до буфера в пам’яті, який очищається щоразу, коли виконуються певні критерії.

source: :class:`~handlers.HTTPHandler` instances send messages to an HTTP server using either ``GET`` or ``POST`` semantics.
pt_br: Екземпляри :class:`~handlers.HTTPHandler` надсилають повідомлення на сервер HTTP, використовуючи семантику ``GET`` або ``POST``.

source: :class:`~handlers.WatchedFileHandler` instances watch the file they are logging to. If the file changes, it is closed and reopened using the file name. This handler is only useful on Unix-like systems; Windows does not support the underlying mechanism used.
pt_br: Екземпляри :class:`~handlers.WatchedFileHandler` спостерігають за файлом, до якого вони входять. Якщо файл змінюється, він закривається та знову відкривається з використанням імені файлу. Цей обробник корисний лише в Unix-подібних системах; Windows не підтримує використовуваний основний механізм.

source: :class:`~handlers.QueueHandler` instances send messages to a queue, such as those implemented in the :mod:`queue` or :mod:`multiprocessing` modules.
pt_br: Екземпляри :class:`~handlers.QueueHandler` надсилають повідомлення до черги, як-от реалізовані в модулях :mod:`queue` або :mod:`multiprocessing`.

source: :class:`NullHandler` instances do nothing with error messages. They are used by library developers who want to use logging, but want to avoid the 'No handlers could be found for logger *XXX*' message which can be displayed if the library user has not configured logging. See :ref:`library-config` for more information.
pt_br: Экземпляры :class:`NullHandler` ничего не делают с сообщениями об ошибках. Они используются разработчиками библиотек, которые хотят использовать ведение журнала, но хотят избежать сообщения «Не удалось найти обработчики для средства ведения журнала *XXX*», которое может отображаться, если пользователь библиотеки не настроил ведение журнала. Дополнительную информацию смотрите в :ref:`library-config`.

source: The :class:`NullHandler` class.
pt_br: A classe :class:`NullHandler`.

source: The :class:`~handlers.QueueHandler` class.
pt_br: A classe :class:`~handlers.QueueHandler`.

source: The :class:`NullHandler`, :class:`StreamHandler` and :class:`FileHandler` classes are defined in the core logging package. The other handlers are defined in a sub-module, :mod:`logging.handlers`. (There is also another sub-module, :mod:`logging.config`, for configuration functionality.)
pt_br: Класи :class:`NullHandler`, :class:`StreamHandler` і :class:`FileHandler` визначені в базовому пакеті журналювання. Інші обробники визначені в підмодулі :mod:`logging.handlers`. (Існує також інший підмодуль, :mod:`logging.config`, для функціональних можливостей налаштування.)

source: Logged messages are formatted for presentation through instances of the :class:`Formatter` class. They are initialized with a format string suitable for use with the % operator and a dictionary.
pt_br: Зареєстровані повідомлення форматуються для представлення через екземпляри класу :class:`Formatter`. Вони ініціалізуються рядком формату, придатним для використання з оператором % і словником.
