Repository: python/python-docs-pt-br
Catalog: howto/logging-cookbook.po
Languages: pt_br

source: Alternatively, you can use a ``Queue`` and a :class:`QueueHandler` to send all logging events to one of the processes in your multi-process application. The following example script demonstrates how you can do this; in the example a separate listener process listens for events sent by other processes and logs them according to its own logging configuration. Although the example only demonstrates one way of doing it (for example, you may want to use a listener thread rather than a separate listener process -- the implementation would be analogous) it does allow for completely different logging configurations for the listener and the other processes in your application, and can be used as the basis for code meeting your own specific requirements::
pt_br: Крім того, ви можете використовувати ``Queue`` і :class:`QueueHandler`, щоб надсилати всі події журналювання до одного з процесів у вашій багатопроцесовій програмі. Наступний приклад сценарію демонструє, як це можна зробити; у прикладі окремий процес слухача прослуховує події, надіслані іншими процесами, і реєструє їх відповідно до власної конфігурації журналювання. Хоча приклад демонструє лише один спосіб зробити це (наприклад, ви можете використовувати потік слухача, а не окремий процес слухача — реалізація буде аналогічною), він дозволяє абсолютно різні конфігурації журналювання для слухача та інших процеси у вашій програмі та можуть бути використані як основа для коду, який відповідає вашим власним вимогам:

source: A variant of the above script keeps the logging in the main process, in a separate thread::
pt_br: Варіант наведеного вище сценарію зберігає журнали в основному процесі в окремому потоці:

source: import logging import logging.config import logging.handlers from multiprocessing import Process, Queue import random import threading import time def logger_thread(q): while True: record = q.get() if record is None: break logger = logging.getLogger(record.name) logger.handle(record) def worker_process(q): qh = logging.handlers.QueueHandler(q) root = logging.getLogger() root.setLevel(logging.DEBUG) root.addHandler(qh) levels = [logging.DEBUG, logging.INFO, logging.WARNING, logging.ERROR, logging.CRITICAL] loggers = ['foo', 'foo.bar', 'foo.bar.baz', 'spam', 'spam.ham', 'spam.ham.eggs'] for i in range(100): lvl = random.choice(levels) logger = logging.getLogger(random.choice(loggers)) logger.log(lvl, 'Message no. %d', i) if __name__ == '__main__': q = Queue() d = { 'version': 1, 'formatters': { 'detailed': { 'class': 'logging.Formatter', 'format': '%(asctime)s %(name)-15s %(levelname)-8s %(processName)-10s %(message)s' } }, 'handlers': { 'console': { 'class': 'logging.StreamHandler', 'level': 'INFO', }, 'file': { 'class': 'logging.FileHandler', 'filename': 'mplog.log', 'mode': 'w', 'formatter': 'detailed', }, 'foofile': { 'class': 'logging.FileHandler', 'filename': 'mplog-foo.log', 'mode': 'w', 'formatter': 'detailed', }, 'errors': { 'class': 'logging.FileHandler', 'filename': 'mplog-errors.log', 'mode': 'w', 'level': 'ERROR', 'formatter': 'detailed', }, }, 'loggers': { 'foo': { 'handlers': ['foofile'] } }, 'root': { 'level': 'DEBUG', 'handlers': ['console', 'file', 'errors'] }, } workers = [] for i in range(5): wp = Process(target=worker_process, name='worker %d' % (i + 1), args=(q,)) workers.append(wp) wp.start() logging.config.dictConfig(d) lp = threading.Thread(target=logger_thread, args=(q,)) lp.start() # At this point, the main process could do some useful work of its own # Once it's done that, it can wait for the workers to terminate... for wp in workers: wp.join() # And now tell the logging thread to finish up, too q.put(None) lp.join()
pt_br: import logging import logging.config import logging.handlers from multiprocessing import Process, Queue import random import threading import time def logger_thread(q): while True: record = q.get() if record is None: break logger = logging.getLogger(record.name) logger.handle(record) def worker_process(q): qh = logging.handlers.QueueHandler(q) root = logging.getLogger() root.setLevel(logging.DEBUG) root.addHandler(qh) levels = [logging.DEBUG, logging.INFO, logging.WARNING, logging.ERROR, logging.CRITICAL] loggers = ['foo', 'foo.bar', 'foo.bar.baz', 'spam', 'spam.ham', 'spam.ham.eggs'] for i in range(100): lvl = random.choice(levels) logger = logging.getLogger(random.choice(loggers)) logger.log(lvl, 'Message no. %d', i) if __name__ == '__main__': q = Queue() d = { 'version': 1, 'formatters': { 'detailed': { 'class': 'logging.Formatter', 'format': '%(asctime)s %(name)-15s %(levelname)-8s %(processName)-10s %(message)s' } }, 'handlers': { 'console': { 'class': 'logging.StreamHandler', 'level': 'INFO', }, 'file': { 'class': 'logging.FileHandler', 'filename': 'mplog.log', 'mode': 'w', 'formatter': 'detailed', }, 'foofile': { 'class': 'logging.FileHandler', 'filename': 'mplog-foo.log', 'mode': 'w', 'formatter': 'detailed', }, 'errors': { 'class': 'logging.FileHandler', 'filename': 'mplog-errors.log', 'mode': 'w', 'level': 'ERROR', 'formatter': 'detailed', }, }, 'loggers': { 'foo': { 'handlers': ['foofile'] } }, 'root': { 'level': 'DEBUG', 'handlers': ['console', 'file', 'errors'] }, } workers = [] for i in range(5): wp = Process(target=worker_process, name='worker %d' % (i + 1), args=(q,)) workers.append(wp) wp.start() logging.config.dictConfig(d) lp = threading.Thread(target=logger_thread, args=(q,)) lp.start() # W tym momencie główny proces mógłby wykonać jakąś pożyteczną pracę samodzielnie # Gdy już to zrobi, może poczekać, aż pracownicy zakończą pracę... for wp in workers: wp.join() # A teraz powiedz wątkowi rejestrującemu, żeby zakończył działanie q.put(None) lp.join()

source: This variant shows how you can e.g. apply configuration for particular loggers - e.g. the ``foo`` logger has a special handler which stores all events in the ``foo`` subsystem in a file ``mplog-foo.log``. This will be used by the logging machinery in the main process (even though the logging events are generated in the worker processes) to direct the messages to the appropriate destinations.
pt_br: Цей варіант показує, як ви можете напр. застосувати конфігурацію для певних реєстраторів - напр. Логер ``foo`` має спеціальний обробник, який зберігає всі події в підсистемі ``foo`` у файлі ``mplog-foo.log``. Це використовуватиметься механізмом реєстрації в основному процесі (навіть якщо події журналювання генеруються в робочих процесах), щоб спрямувати повідомлення до відповідних адресатів.

source: Using concurrent.futures.ProcessPoolExecutor
pt_br: Використання concurrent.futures.ProcessPoolExecutor

source: If you want to use :class:`concurrent.futures.ProcessPoolExecutor` to start your worker processes, you need to create the queue slightly differently. Instead of
pt_br: Якщо ви хочете використовувати :class:`concurrent.futures.ProcessPoolExecutor` для запуску ваших робочих процесів, вам потрібно створити чергу трохи інакше. Замість

source: you should use
pt_br: ви повинні використовувати

source: and you can then replace the worker creation from this::
pt_br: а потім ви можете замінити робоче створення з цього::

source: to this (remembering to first import :mod:`concurrent.futures`)::
pt_br: до цього (не забувши спочатку імпортувати :mod:`concurrent.futures`)::

source: Deploying Web applications using Gunicorn and uWSGI
pt_br: Розгортання веб-додатків за допомогою Gunicorn і uWSGI

source: When deploying Web applications using `Gunicorn <https://gunicorn.org/>`_ or `uWSGI <https://uwsgi-docs.readthedocs.io/en/latest/>`_ (or similar), multiple worker processes are created to handle client requests. In such environments, avoid creating file-based handlers directly in your web application. Instead, use a :class:`SocketHandler` to log from the web application to a listener in a separate process. This can be set up using a process management tool such as Supervisor - see `Running a logging socket listener in production`_ for more details.
pt_br: Під час розгортання веб-програм за допомогою `Gunicorn <https://gunicorn.org/>`_ або `uWSGI <https://uwsgi-docs.readthedocs.io/en/latest/>`_ (або подібних), для обробки запитів клієнтів створюється кілька робочих процесів. У таких середовищах уникайте створення обробників на основі файлів безпосередньо у вашій веб-програмі. Замість цього використовуйте :class:`SocketHandler`, щоб увійти з веб-програми до слухача в окремому процесі. Це можна налаштувати за допомогою інструменту керування процесами, такого як Supervisor - див. `Running a logging socket listener in production`_ для отримання додаткової інформації.

source: Using file rotation
pt_br: Використання ротації файлів

source: Sometimes you want to let a log file grow to a certain size, then open a new file and log to that. You may want to keep a certain number of these files, and when that many files have been created, rotate the files so that the number of files and the size of the files both remain bounded. For this usage pattern, the logging package provides a :class:`RotatingFileHandler`::
pt_br: Иногда вам нужно позволить файлу журнала вырасти до определенного размера, а затем открыть новый файл и войти в него. Возможно, вы захотите сохранить определенное количество этих файлов, а когда будет создано такое количество файлов, поверните их так, чтобы количество файлов и размер файлов оставались ограниченными. Для этого шаблона использования пакет журналирования предоставляет :class:`RotatingFileHandler`::

source: The result should be 6 separate files, each with part of the log history for the application:
pt_br: У результаті повинно вийти 6 окремих файлів, кожен з яких містить частину журналу журналу програми:

source: The most current file is always :file:`logging_rotatingfile_example.out`, and each time it reaches the size limit it is renamed with the suffix ``.1``. Each of the existing backup files is renamed to increment the suffix (``.1`` becomes ``.2``, etc.) and the ``.6`` file is erased.
pt_br: Найновішим файлом завжди є :file:`logging_rotatingfile_example.out`, і кожного разу, коли він досягає ліміту розміру, він перейменовується з суфіксом ``.1``. Кожен із наявних файлів резервної копії перейменовується, щоб збільшити суфікс (``.1`` стає ``.2`` тощо), а файл ``.6`` видаляється.

source: Obviously this example sets the log length much too small as an extreme example. You would want to set *maxBytes* to an appropriate value.
pt_br: Очевидно, що цей приклад встановлює занадто малу довжину журналу як екстремальний приклад. Вам потрібно встановити відповідне значення *maxBytes*.

source: Use of alternative formatting styles
pt_br: Використання альтернативних стилів форматування

source: When logging was added to the Python standard library, the only way of formatting messages with variable content was to use the %-formatting method. Since then, Python has gained two new formatting approaches: :class:`string.Template` (added in Python 2.4) and :meth:`str.format` (added in Python 2.6).
pt_br: Коли журналювання було додано до стандартної бібліотеки Python, єдиним способом форматування повідомлень зі змінним вмістом було використання методу %-formatting. Відтоді Python отримав два нові підходи до форматування: :class:`string.Template` (доданий у Python 2.4) і :meth:`str.format` (доданий у Python 2.6).

source: Logging (as of 3.2) provides improved support for these two additional formatting styles. The :class:`Formatter` class been enhanced to take an additional, optional keyword parameter named ``style``. This defaults to ``'%'``, but other possible values are ``'{'`` and ``'$'``, which correspond to the other two formatting styles. Backwards compatibility is maintained by default (as you would expect), but by explicitly specifying a style parameter, you get the ability to specify format strings which work with :meth:`str.format` or :class:`string.Template`. Here's an example console session to show the possibilities:
pt_br: Журналування (станом на 3.2) забезпечує покращену підтримку цих двох додаткових стилів форматування. Клас :class:`Formatter` було вдосконалено, щоб прийняти додатковий необов’язковий параметр ключового слова під назвою ``style``. За замовчуванням це ``'%'``, але інші можливі значення ``'{'`` і ``'$'``, які відповідають двом іншим стилям форматування. Зворотна сумісність підтримується за замовчуванням (як і слід було очікувати), але, явно вказавши параметр стилю, ви отримуєте можливість вказати рядки формату, які працюють із :meth:`str.format` або :class:`string.Template`. Ось приклад сеансу консолі, щоб показати можливості:

source: Note that the formatting of logging messages for final output to logs is completely independent of how an individual logging message is constructed. That can still use %-formatting, as shown here::
pt_br: Зверніть увагу, що форматування повідомлень журналу для остаточного виведення в журнали повністю не залежить від того, як побудовано окреме повідомлення журналу. Це все ще може використовувати %-formatting, як показано тут::

source: Logging calls (``logger.debug()``, ``logger.info()`` etc.) only take positional parameters for the actual logging message itself, with keyword parameters used only for determining options for how to handle the actual logging call (e.g. the ``exc_info`` keyword parameter to indicate that traceback information should be logged, or the ``extra`` keyword parameter to indicate additional contextual information to be added to the log). So you cannot directly make logging calls using :meth:`str.format` or :class:`string.Template` syntax, because internally the logging package uses %-formatting to merge the format string and the variable arguments. There would be no changing this while preserving backward compatibility, since all logging calls which are out there in existing code will be using %-format strings.
pt_br: Виклики журналювання (``logger.debug()``, ``logger.info()`` тощо) приймають лише позиційні параметри для самого фактичного повідомлення журналу, а параметри ключових слів використовуються лише для визначення варіантів обробки фактичного виклик журналювання (наприклад, параметр ключового слова ``exc_info``, щоб вказати, що слід реєструвати інформацію відстеження, або параметр ключового слова ``extra``, щоб вказати додаткову контекстну інформацію, яку потрібно додати до журналу). Таким чином, ви не можете безпосередньо здійснювати виклики журналювання за допомогою синтаксису :meth:`str.format` або :class:`string.Template`, тому що внутрішньо пакет журналювання використовує %-formatting для об’єднання рядка формату та змінних аргументів. Це не змінюватиметься, зберігаючи зворотну сумісність, оскільки всі виклики журналювання, які присутні в існуючому коді, використовуватимуть рядки %-format.

source: There is, however, a way that you can use {}- and $- formatting to construct your individual log messages. Recall that for a message you can use an arbitrary object as a message format string, and that the logging package will call ``str()`` on that object to get the actual format string. Consider the following two classes::
pt_br: Однак існує спосіб, за допомогою якого ви можете використовувати форматування {}- і $- для створення ваших індивідуальних повідомлень журналу. Згадайте, що для повідомлення ви можете використовувати довільний об’єкт як рядок формату повідомлення, і що пакет журналювання викличе ``str()`` для цього об’єкта, щоб отримати фактичний рядок формату. Розглянемо наступні два класи:

source: Either of these can be used in place of a format string, to allow {}- or $-formatting to be used to build the actual "message" part which appears in the formatted log output in place of "%(message)s" or "{message}" or "$message". It's a little unwieldy to use the class names whenever you want to log something, but it's quite palatable if you use an alias such as __ (double underscore --- not to be confused with _, the single underscore used as a synonym/alias for :func:`gettext.gettext` or its brethren).
pt_br: Будь-який із них можна використовувати замість рядка формату, щоб дозволити використовувати {}- або $-форматування для побудови фактичної частини "повідомлення", яка з’являється у відформатованому журналі замість "%(message)s" або "{message". }" або "$message". Трохи громіздко використовувати назви класів, коли ви хочете щось зареєструвати, але це цілком приємно, якщо ви використовуєте псевдонім, наприклад __ (подвійне підкреслення --- не плутати з _, єдине підкреслення, яке використовується як синонім/псевдонім для :func:`gettext.gettext` або його братів).

source: The above classes are not included in Python, though they're easy enough to copy and paste into your own code. They can be used as follows (assuming that they're declared in a module called ``wherever``):
pt_br: Наведені вище класи не включені в Python, хоча їх достатньо легко скопіювати та вставити у свій власний код. Їх можна використовувати наступним чином (за умови, що вони оголошені в модулі під назвою ``wherever``):

source: While the above examples use ``print()`` to show how the formatting works, you would of course use ``logger.debug()`` or similar to actually log using this approach.
pt_br: У той час як у наведених вище прикладах використовується ``print()``, щоб показати, як працює форматування, ви, звичайно, скористаєтеся ``logger.debug()`` або подібним, щоб справді вести журнал за допомогою цього підходу.

source: One thing to note is that you pay no significant performance penalty with this approach: the actual formatting happens not when you make the logging call, but when (and if) the logged message is actually about to be output to a log by a handler. So the only slightly unusual thing which might trip you up is that the parentheses go around the format string and the arguments, not just the format string. That's because the __ notation is just syntax sugar for a constructor call to one of the :samp:`{XXX}Message` classes.
pt_br: Следует отметить одну вещь: при таком подходе вы не платите значительного снижения производительности: фактическое форматирование происходит не тогда, когда вы делаете вызов журнала, а когда (и если) зарегистрированное сообщение действительно собирается быть выведено в журнал обработчиком. Итак, единственная немного необычная вещь, которая может вас сбить с толку, это то, что круглые скобки заключают в себя строку формата и аргументы, а не только строку формата. Это потому, что обозначение __ — это всего лишь синтаксический сахар для вызова конструктора одного из классов :samp:`{XXX}Message`.

source: If you prefer, you can use a :class:`LoggerAdapter` to achieve a similar effect to the above, as in the following example::
pt_br: Якщо ви віддаєте перевагу, ви можете використовувати :class:`LoggerAdapter`, щоб досягти ефекту, подібного до наведеного вище, як у наступному прикладі::

source: The above script should log the message ``Hello, world!`` when run with Python 3.8 or later.
pt_br: Приведенный выше сценарий должен регистрировать сообщение «Hello, world!» при запуске с Python 3.8 или более поздней версии.

source: Customizing ``LogRecord``
pt_br: Personalizando o ``LogRecord``

source: Every logging event is represented by a :class:`LogRecord` instance. When an event is logged and not filtered out by a logger's level, a :class:`LogRecord` is created, populated with information about the event and then passed to the handlers for that logger (and its ancestors, up to and including the logger where further propagation up the hierarchy is disabled). Before Python 3.2, there were only two places where this creation was done:
pt_br: Кожна подія журналювання представлена екземпляром :class:`LogRecord`. Коли подія реєструється і не відфільтровується на рівні реєстратора, створюється :class:`LogRecord`, заповнюється інформацією про подію, а потім передається обробникам цього реєстратора (і його предків, аж до реєстратора включно). де подальше поширення вгору по ієрархії вимкнено). До Python 3.2 існувало лише два місця, де це було зроблено:

source: :meth:`Logger.makeRecord`, which is called in the normal process of logging an event. This invoked :class:`LogRecord` directly to create an instance.
pt_br: :meth:`Logger.makeRecord`, який викликається в звичайному процесі реєстрації події. Це безпосередньо викликало :class:`LogRecord` для створення екземпляра.

source: :func:`makeLogRecord`, which is called with a dictionary containing attributes to be added to the LogRecord. This is typically invoked when a suitable dictionary has been received over the network (e.g. in pickle form via a :class:`~handlers.SocketHandler`, or in JSON form via an :class:`~handlers.HTTPHandler`).
pt_br: :func:`makeLogRecord`, який викликається зі словником, що містить атрибути, які потрібно додати до LogRecord. Це зазвичай викликається, коли через мережу отримано відповідний словник (наприклад, у формі pickle через :class:`~handlers.SocketHandler` або у формі JSON через :class:`~handlers.HTTPHandler`).

source: This has usually meant that if you need to do anything special with a :class:`LogRecord`, you've had to do one of the following.
pt_br: Зазвичай це означало, що якщо вам потрібно зробити щось особливе з :class:`LogRecord`, ви повинні зробити одну з наступних дій.

source: Create your own :class:`Logger` subclass, which overrides :meth:`Logger.makeRecord`, and set it using :func:`~logging.setLoggerClass` before any loggers that you care about are instantiated.
pt_br: Створіть свій власний підклас :class:`Logger`, який замінює :meth:`Logger.makeRecord`, і встановіть його за допомогою :func:`~logging.setLoggerClass` перед створенням будь-яких реєстраторів, які вас цікавлять.

source: Add a :class:`Filter` to a logger or handler, which does the necessary special manipulation you need when its :meth:`~Filter.filter` method is called.
pt_br: Додайте :class:`Filter` до реєстратора або обробника, який виконує необхідні спеціальні маніпуляції, які вам потрібні, коли викликається його метод :meth:`~Filter.filter`.

source: The first approach would be a little unwieldy in the scenario where (say) several different libraries wanted to do different things. Each would attempt to set its own :class:`Logger` subclass, and the one which did this last would win.
pt_br: Перший підхід був би трохи громіздким у сценарії, коли (скажімо) кілька різних бібліотек хотіли б робити різні речі. Кожен намагатиметься встановити власний підклас :class:`Logger`, і виграє той, хто зробить це останнім.

source: The second approach works reasonably well for many cases, but does not allow you to e.g. use a specialized subclass of :class:`LogRecord`. Library developers can set a suitable filter on their loggers, but they would have to remember to do this every time they introduced a new logger (which they would do simply by adding new packages or modules and doing ::
pt_br: Другий підхід працює досить добре для багатьох випадків, але не дозволяє вам, наприклад, використовувати спеціалізований підклас :class:`LogRecord`. Розробники бібліотек можуть встановити відповідний фільтр для своїх реєстраторів, але вони повинні пам’ятати про це щоразу, коли вводять новий реєстратор (що вони робили б, просто додаючи нові пакунки чи модулі та виконуючи:
