Repository: python/python-docs-pt-br
Catalog: howto/logging-cookbook.po
Languages: pt_br

source: First run the server, and then the client. On the client side, nothing is printed on the console; on the server side, you should see something like:
pt_br: Спочатку запустіть сервер, а потім клієнт. На стороні клієнта на консолі нічого не друкується; на стороні сервера ви повинні побачити щось на кшталт:

source: Note that there are some security issues with pickle in some scenarios. If these affect you, you can use an alternative serialization scheme by overriding the :meth:`~SocketHandler.makePickle` method and implementing your alternative there, as well as adapting the above script to use your alternative serialization.
pt_br: Обратите внимание, что в некоторых сценариях при использовании Pickle возникают некоторые проблемы с безопасностью. Если это вас затрагивает, вы можете использовать альтернативную схему сериализации, переопределив метод :meth:`~SocketHandler.makePickle` и реализовав там свою альтернативу, а также адаптировав приведенный выше сценарий для использования вашей альтернативной сериализации.

source: Running a logging socket listener in production
pt_br: Запуск прослуховувача сокетів журналювання у виробництві

source: To run a logging listener in production, you may need to use a process-management tool such as `Supervisor <http://supervisord.org/>`_. `Here is a Gist <socket-listener-gist_>`__ which provides the bare-bones files to run the above functionality using Supervisor. It consists of the following files:
pt_br: Чтобы запустить прослушиватель журналов в рабочей среде, вам может потребоваться использовать инструмент управления процессами, например `Supervisor <http://supervisord.org/>`_. `Вот Gist <socket-listener-gist_>`__, который предоставляет базовые файлы для запуска вышеуказанных функций с помощью Supervisor. Он состоит из следующих файлов:

source: File
pt_br: Arquivo

source: Purpose
pt_br: Propósito

source: A Bash script to prepare the environment for testing
pt_br: Скрипт Bash для подготовки среды к тестированию.

source: The Supervisor configuration file, which has entries for the listener and a multi-process web application
pt_br: Файл конфигурации Supervisor, содержащий записи для прослушивателя и многопроцессного веб-приложения.

source: A Bash script to ensure that Supervisor is running with the above configuration
pt_br: Сценарий Bash, гарантирующий, что Supervisor работает с указанной выше конфигурацией.

source: The socket listener program which receives log events and records them to a file
pt_br: Программа-прослушиватель сокетов, которая получает события журнала и записывает их в файл.

source: A simple web application which performs logging via a socket connected to the listener
pt_br: Простое веб-приложение, которое выполняет журналирование через сокет, подключенный к прослушивателю.

source: A JSON configuration file for the web application
pt_br: Файл конфигурации JSON для веб-приложения.

source: A Python script to exercise the web application
pt_br: Скрипт Python для работы с веб-приложением.

source: The web application uses `Gunicorn <https://gunicorn.org/>`_, which is a popular web application server that starts multiple worker processes to handle requests. This example setup shows how the workers can write to the same log file without conflicting with one another --- they all go through the socket listener.
pt_br: Веб-приложение использует `Gunicorn <https://gunicorn.org/>`_, популярный сервер веб-приложений, который запускает несколько рабочих процессов для обработки запросов. В этом примере настройки показано, как рабочие могут писать в один и тот же файл журнала, не конфликтуя друг с другом — все они проходят через прослушиватель сокетов.

source: To test these files, do the following in a POSIX environment:
pt_br: Чтобы протестировать эти файлы, выполните следующие действия в среде POSIX:

source: Download `the Gist <socket-listener-gist_>`__ as a ZIP archive using the :guilabel:`Download ZIP` button.
pt_br: Загрузите `the Gist <socket-listener-gist_>`__ в виде ZIP-архива, используя кнопку :guilabel:`Загрузить ZIP`.

source: Unzip the above files from the archive into a scratch directory.
pt_br: Разархивируйте указанные выше файлы из архива в временный каталог.

source: In the scratch directory, run ``bash prepare.sh`` to get things ready. This creates a :file:`run` subdirectory to contain Supervisor-related and log files, and a :file:`venv` subdirectory to contain a virtual environment into which ``bottle``, ``gunicorn`` and ``supervisor`` are installed.
pt_br: В рабочем каталоге запустите bashprepree.sh, чтобы все было готово. При этом создается подкаталог :file:`run` для хранения файлов журналов и файлов, связанных с Supervisor, а также подкаталог :file:`venv` для хранения виртуальной среды, в которой находятся ``bottle``, ``gunicorn`` и ``supervisor'. `` установлены.

source: Run ``bash ensure_app.sh`` to ensure that Supervisor is running with the above configuration.
pt_br: Запустите bash Sure_app.sh, чтобы убедиться, что Supervisor работает с указанной выше конфигурацией.

source: Run ``venv/bin/python client.py`` to exercise the web application, which will lead to records being written to the log.
pt_br: Запустите ``venv/bin/python client.py``, чтобы протестировать веб-приложение, что приведет к записи записей в журнал.

source: Inspect the log files in the :file:`run` subdirectory. You should see the most recent log lines in files matching the pattern :file:`app.log*`. They won't be in any particular order, since they have been handled concurrently by different worker processes in a non-deterministic way.
pt_br: Проверьте файлы журналов в подкаталоге :file:`run`. Вы должны увидеть самые последние строки журнала в файлах, соответствующих шаблону :file:`app.log*`. Они не будут располагаться в каком-то определенном порядке, поскольку они обрабатывались одновременно разными рабочими процессами недетерминированным образом.

source: You can shut down the listener and the web application by running ``venv/bin/supervisorctl -c supervisor.conf shutdown``.
pt_br: Вы можете закрыть прослушиватель и веб-приложение, запустив ``venv/bin/supervisorctl -c Supervisor.conf Shutdown``.

source: You may need to tweak the configuration files in the unlikely event that the configured ports clash with something else in your test environment.
pt_br: Возможно, вам придется настроить файлы конфигурации в том маловероятном случае, если настроенные порты будут конфликтовать с чем-то еще в вашей тестовой среде.

source: The default configuration uses a TCP socket on port 9020. You can use a Unix Domain socket instead of a TCP socket by doing the following:
pt_br: 默认配置使用一个 9020 端口上的 TCP 套接字。 你可以通过以下方式改用 Unix 域套接字代替 TCP 套接字：

source: In :file:`listener.json`, add a ``socket`` key with the path to the domain socket you want to use. If this key is present, the listener listens on the corresponding domain socket and not on a TCP socket (the ``port`` key is ignored).
pt_br: В: Файл: `Слушатель.json`, добавьте клавишу` `` socket`` с путем к розетку домена, который вы хотите использовать. Если этот ключ присутствует, слушатель прослушивает в соответствующем доменном розетке, а не в розетке TCP (ключ `` port`` игнорируется).

source: In :file:`webapp.json`, change the socket handler configuration dictionary so that the ``host`` value is the path to the domain socket, and set the ``port`` value to ``null``.
pt_br: 在 :file:`webapp.json` 中，修改套接字处理器配置字典以使 ``host`` 值为该域套接字的路径，并将 ``port`` 值设为 ``null``。

source: Adding contextual information to your logging output
pt_br: Додавання контекстної інформації до вихідних даних журналу

source: Sometimes you want logging output to contain contextual information in addition to the parameters passed to the logging call. For example, in a networked application, it may be desirable to log client-specific information in the log (e.g. remote client's username, or IP address). Although you could use the *extra* parameter to achieve this, it's not always convenient to pass the information in this way. While it might be tempting to create :class:`Logger` instances on a per-connection basis, this is not a good idea because these instances are not garbage collected. While this is not a problem in practice, when the number of :class:`Logger` instances is dependent on the level of granularity you want to use in logging an application, it could be hard to manage if the number of :class:`Logger` instances becomes effectively unbounded.
pt_br: Іноді потрібно, щоб вихід журналу містив контекстну інформацію на додаток до параметрів, переданих до виклику журналу. Наприклад, у мережевій програмі може бути бажаним реєструвати інформацію про клієнта в журналі (наприклад, ім’я користувача віддаленого клієнта або IP-адресу). Хоча для цього можна використовувати параметр *extra*, не завжди зручно передавати інформацію таким чином. Хоча може виникнути спокуса створити екземпляри :class:`Logger` для кожного з’єднання, це не дуже гарна ідея, оскільки ці екземпляри не збираються для сміття. Хоча це не є проблемою на практиці, коли кількість екземплярів :class:`Logger` залежить від рівня деталізації, який ви хочете використовувати для реєстрації програми, може бути важко керувати кількістю :class:`Екземпляри Logger` стають фактично необмеженими.

source: Using LoggerAdapters to impart contextual information
pt_br: Використання LoggerAdapters для передачі контекстної інформації

source: An easy way in which you can pass contextual information to be output along with logging event information is to use the :class:`LoggerAdapter` class. This class is designed to look like a :class:`Logger`, so that you can call :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth:`exception`, :meth:`critical` and :meth:`log`. These methods have the same signatures as their counterparts in :class:`Logger`, so you can use the two types of instances interchangeably.
pt_br: Простий спосіб, за допомогою якого ви можете передати контекстну інформацію для виведення разом із інформацією про подію журналювання, полягає у використанні класу :class:`LoggerAdapter`. Цей клас розроблено так, щоб виглядати як :class:`Logger`, щоб ви могли викликати :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth:`exception`, :meth:`critical` і :meth:`log`. Ці методи мають ті самі сигнатури, що й їхні аналоги в :class:`Logger`, тому ви можете використовувати обидва типи екземплярів як взаємозамінні.

source: When you create an instance of :class:`LoggerAdapter`, you pass it a :class:`Logger` instance and a dict-like object which contains your contextual information. When you call one of the logging methods on an instance of :class:`LoggerAdapter`, it delegates the call to the underlying instance of :class:`Logger` passed to its constructor, and arranges to pass the contextual information in the delegated call. Here's a snippet from the code of :class:`LoggerAdapter`::
pt_br: Коли ви створюєте екземпляр :class:`LoggerAdapter`, ви передаєте йому екземпляр :class:`Logger` і dict-подібний об’єкт, який містить вашу контекстну інформацію. Коли ви викликаєте один із методів журналювання в екземплярі :class:`LoggerAdapter`, він делегує виклик базовому екземпляру :class:`Logger`, який передається його конструктору, і організовує передачу контекстної інформації в делегованому виклику . Ось фрагмент коду :class:`LoggerAdapter`::

source: The :meth:`~LoggerAdapter.process` method of :class:`LoggerAdapter` is where the contextual information is added to the logging output. It's passed the message and keyword arguments of the logging call, and it passes back (potentially) modified versions of these to use in the call to the underlying logger. The default implementation of this method leaves the message alone, but inserts an 'extra' key in the keyword argument whose value is the dict-like object passed to the constructor. Of course, if you had passed an 'extra' keyword argument in the call to the adapter, it will be silently overwritten.
pt_br: У методі :meth:`~LoggerAdapter.process` :class:`LoggerAdapter` контекстна інформація додається до результатів журналювання. Він передає аргументи повідомлення та ключове слово виклику журналювання, а також повертає (потенційно) модифіковані версії їх для використання у виклику базовому реєстратору. Реалізація цього методу за замовчуванням залишає повідомлення в спокої, але вставляє "додатковий" ключ в аргумент ключового слова, значенням якого є dict-подібний об’єкт, переданий конструктору. Звичайно, якщо ви передали "додатковий" аргумент ключового слова під час виклику адаптера, він буде мовчки перезаписаний.

source: The advantage of using 'extra' is that the values in the dict-like object are merged into the :class:`LogRecord` instance's __dict__, allowing you to use customized strings with your :class:`Formatter` instances which know about the keys of the dict-like object. If you need a different method, e.g. if you want to prepend or append the contextual information to the message string, you just need to subclass :class:`LoggerAdapter` and override :meth:`~LoggerAdapter.process` to do what you need. Here is a simple example::
pt_br: Перевага використання "extra" полягає в тому, що значення в dict-подібному об’єкті об’єднуються в __dict__ екземпляра :class:`LogRecord`, що дозволяє вам використовувати налаштовані рядки з вашими екземплярами :class:`Formatter`, які знають про ключі диктоподібного об’єкта. Якщо вам потрібен інший метод, напр. якщо ви хочете передати або додати контекстну інформацію до рядка повідомлення, вам просто потрібно створити підклас :class:`LoggerAdapter` і перевизначити :meth:`~LoggerAdapter.process`, щоб зробити те, що вам потрібно. Ось простий приклад::

source: which you can use like this::
pt_br: який можна використовувати таким чином::

source: Then any events that you log to the adapter will have the value of ``some_conn_id`` prepended to the log messages.
pt_br: Тоді будь-які події, які ви реєструєте в адаптері, матимуть значення ``some_conn_id`` до повідомлень журналу.

source: Using objects other than dicts to pass contextual information
pt_br: Використання об’єктів, відмінних від dicts, для передачі контекстної інформації

source: You don't need to pass an actual dict to a :class:`LoggerAdapter` - you could pass an instance of a class which implements ``__getitem__`` and ``__iter__`` so that it looks like a dict to logging. This would be useful if you want to generate values dynamically (whereas the values in a dict would be constant).
pt_br: Вам не потрібно передавати фактичний dict до :class:`LoggerAdapter` - ви можете передати примірник класу, який реалізує ``__getitem__`` і ``__iter__``, щоб він виглядав як dict для журналювання. Це буде корисно, якщо ви хочете генерувати значення динамічно (тоді як значення в dict будуть постійними).

source: Using Filters to impart contextual information
pt_br: Використання фільтрів для передачі контекстної інформації

source: You can also add contextual information to log output using a user-defined :class:`Filter`. ``Filter`` instances are allowed to modify the ``LogRecords`` passed to them, including adding additional attributes which can then be output using a suitable format string, or if needed a custom :class:`Formatter`.
pt_br: Ви також можете додати контекстну інформацію до виведення журналу за допомогою визначеного користувачем :class:`Filter`. Екземплярам ``Filter`` дозволено змінювати ``LogRecords``, передані їм, включаючи додавання додаткових атрибутів, які потім можуть бути виведені за допомогою рядка відповідного формату або, якщо необхідно, спеціального :class:`Formatter`.

source: For example in a web application, the request being processed (or at least, the interesting parts of it) can be stored in a threadlocal (:class:`threading.local`) variable, and then accessed from a ``Filter`` to add, say, information from the request - say, the remote IP address and remote user's username - to the ``LogRecord``, using the attribute names 'ip' and 'user' as in the ``LoggerAdapter`` example above. In that case, the same format string can be used to get similar output to that shown above. Here's an example script::
pt_br: Наприклад, у веб-додатку запит, який обробляється (або, принаймні, його цікаві частини) можна зберегти у змінній threadlocal (:class:`threading.local`), а потім отримати доступ із ``Фільтра`` щоб додати, скажімо, інформацію із запиту - скажімо, віддалену IP-адресу та ім'я користувача віддаленого користувача - до ``LogRecord``, використовуючи імена атрибутів 'ip' і 'user', як у прикладі ``LoggerAdapter`` вище . У цьому випадку можна використати той самий рядок формату, щоб отримати вихід, схожий на показаний вище. Ось приклад сценарію::

source: which, when run, produces something like:
pt_br: який під час запуску створює щось на зразок:

source: Use of ``contextvars``
pt_br: Использование ``contextvars``

source: Since Python 3.7, the :mod:`contextvars` module has provided context-local storage which works for both :mod:`threading` and :mod:`asyncio` processing needs. This type of storage may thus be generally preferable to thread-locals. The following example shows how, in a multi-threaded environment, logs can populated with contextual information such as, for example, request attributes handled by web applications.
pt_br: Начиная с Python 3.7, модуль :mod:`contextvars` предоставляет контекстно-локальное хранилище, которое подходит как для обработки :mod:`threading`, так и для :mod:`asyncio`. Таким образом, этот тип хранилища может быть предпочтительнее локальных потоков. В следующем примере показано, как в многопоточной среде журналы могут заполняться контекстной информацией, такой как, например, атрибуты запроса, обрабатываемые веб-приложениями.

source: For the purposes of illustration, say that you have different web applications, each independent of the other but running in the same Python process and using a library common to them. How can each of these applications have their own log, where all logging messages from the library (and other request processing code) are directed to the appropriate application's log file, while including in the log additional contextual information such as client IP, HTTP request method and client username?
pt_br: В качестве иллюстрации предположим, что у вас есть разные веб-приложения, каждое из которых независимо от другого, но выполняются в одном и том же процессе Python и используют общую для них библиотеку. Как каждое из этих приложений может иметь свой собственный журнал, где все сообщения журнала из библиотеки (и другой код обработки запросов) направляются в файл журнала соответствующего приложения, при этом в журнал включается дополнительная контекстная информация, такая как IP-адрес клиента, метод HTTP-запроса и имя пользователя клиента?

source: Let's assume that the library can be simulated by the following code:
pt_br: Предположим, что библиотеку можно смоделировать с помощью следующего кода:

source: We can simulate the multiple web applications by means of two simple classes, ``Request`` and ``WebApp``. These simulate how real threaded web applications work - each request is handled by a thread:
pt_br: Мы можем моделировать несколько веб-приложений с помощью двух простых классов: Request и WebApp. Они имитируют работу реальных многопоточных веб-приложений — каждый запрос обрабатывается потоком:

source: If you run the above, you should find that roughly half the requests go into :file:`app1.log` and the rest into :file:`app2.log`, and the all the requests are logged to :file:`app.log`. Each webapp-specific log will contain only log entries for only that webapp, and the request information will be displayed consistently in the log (i.e. the information in each dummy request will always appear together in a log line). This is illustrated by the following shell output:
pt_br: Если вы запустите вышеописанное, вы обнаружите, что примерно половина запросов поступает в :file:`app1.log`, а остальные - в :file:`app2.log`, и все запросы записываются в :file:`app .log`. Каждый журнал конкретного веб-приложения будет содержать только записи журнала только для этого веб-приложения, а информация о запросе будет последовательно отображаться в журнале (т. е. информация в каждом фиктивном запросе всегда будет отображаться вместе в строке журнала). Это иллюстрируется следующим выводом оболочки:

source: Imparting contextual information in handlers
pt_br: Передача контекстной информации в обработчики

source: Each :class:`~Handler` has its own chain of filters. If you want to add contextual information to a :class:`LogRecord` without leaking it to other handlers, you can use a filter that returns a new :class:`~LogRecord` instead of modifying it in-place, as shown in the following script::
pt_br: Каждый :class:`~Handler` имеет свою собственную цепочку фильтров. Если вы хотите добавить контекстную информацию в :class:`LogRecord`, не передавая ее другим обработчикам, вы можете использовать фильтр, который возвращает новый :class:`~LogRecord` вместо его модификации на месте, как показано на рисунке следующий скрипт::

source: Logging to a single file from multiple processes
pt_br: Реєстрація в один файл з кількох процесів

source: Although logging is thread-safe, and logging to a single file from multiple threads in a single process *is* supported, logging to a single file from *multiple processes* is *not* supported, because there is no standard way to serialize access to a single file across multiple processes in Python. If you need to log to a single file from multiple processes, one way of doing this is to have all the processes log to a :class:`~handlers.SocketHandler`, and have a separate process which implements a socket server which reads from the socket and logs to file. (If you prefer, you can dedicate one thread in one of the existing processes to perform this function.) :ref:`This section <network-logging>` documents this approach in more detail and includes a working socket receiver which can be used as a starting point for you to adapt in your own applications.
pt_br: Хоча ведення журналу є потокобезпечним і *підтримується* журналювання в один файл із кількох потоків в одному процесі, журналювання в один файл із *кількох процесів *не* підтримується, оскільки немає стандартного способу серіалізації доступу в один файл через кілька процесів у Python. Якщо вам потрібно ввійти до одного файлу з кількох процесів, один із способів зробити це — зареєструвати всі процеси в :class:`~handlers.SocketHandler` і мати окремий процес, який реалізує сервер сокетів, який читає з сокет і журнали в файл. (Якщо ви віддаєте перевагу, ви можете виділити один потік в одному з існуючих процесів для виконання цієї функції.) :ref:`Цей розділ <network-logging>` документує цей підхід більш детально та містить робочий приймач сокетів, який можна використовувати як відправну точку для адаптації у власних програмах.
