Repository: python/python-docs-pt-br
Catalog: howto/logging-cookbook.po
Languages: pt_br

source: at module level). It's probably one too many things to think about. Developers could also add the filter to a :class:`~logging.NullHandler` attached to their top-level logger, but this would not be invoked if an application developer attached a handler to a lower-level library logger --- so output from that handler would not reflect the intentions of the library developer.
pt_br: на рівні модуля). Ймовірно, це занадто багато речей, про які варто думати. Розробники також можуть додати фільтр до :class:`~logging.NullHandler`, прикріпленого до їхнього реєстратора верхнього рівня, але це не буде викликано, якщо розробник програми приєднає обробник до реєстратора бібліотеки нижчого рівня --- тому виведіть з цього обробника не відображатиме намірів розробника бібліотеки.

source: In Python 3.2 and later, :class:`~logging.LogRecord` creation is done through a factory, which you can specify. The factory is just a callable you can set with :func:`~logging.setLogRecordFactory`, and interrogate with :func:`~logging.getLogRecordFactory`. The factory is invoked with the same signature as the :class:`~logging.LogRecord` constructor, as :class:`LogRecord` is the default setting for the factory.
pt_br: У Python 3.2 і пізніших версіях створення :class:`~logging.LogRecord` здійснюється через фабрику, яку ви можете вказати. Фабрика — це просто виклик, який можна встановити за допомогою :func:`~logging.setLogRecordFactory` і запитати за допомогою :func:`~logging.getLogRecordFactory`. Фабрика викликається з тим самим підписом, що й конструктор :class:`~logging.LogRecord`, оскільки :class:`LogRecord` є параметром за замовчуванням для фабрики.

source: This approach allows a custom factory to control all aspects of LogRecord creation. For example, you could return a subclass, or just add some additional attributes to the record once created, using a pattern similar to this::
pt_br: Цей підхід дозволяє спеціальній фабрикі контролювати всі аспекти створення LogRecord. Наприклад, ви можете повернути підклас або просто додати деякі додаткові атрибути до створеного запису, використовуючи шаблон, подібний до цього:

source: This pattern allows different libraries to chain factories together, and as long as they don't overwrite each other's attributes or unintentionally overwrite the attributes provided as standard, there should be no surprises. However, it should be borne in mind that each link in the chain adds run-time overhead to all logging operations, and the technique should only be used when the use of a :class:`Filter` does not provide the desired result.
pt_br: Цей шаблон дозволяє різним бібліотекам об’єднувати фабрики разом, і якщо вони не перезаписують атрибути одна одної або ненавмисно перезаписують атрибути, надані як стандартні, не повинно бути сюрпризів. Однак слід мати на увазі, що кожна ланка в ланцюжку додає накладні витрати на час виконання для всіх операцій журналювання, і цю техніку слід використовувати лише тоді, коли використання :class:`Filter` не забезпечує бажаного результату.

source: Subclassing QueueHandler and QueueListener- a ZeroMQ example
pt_br: Создание подклассов QueueHandler и QueueListener — пример ZeroMQ

source: Subclass ``QueueHandler``
pt_br: Подкласс ``QueueHandler``

source: You can use a :class:`QueueHandler` subclass to send messages to other kinds of queues, for example a ZeroMQ 'publish' socket. In the example below,the socket is created separately and passed to the handler (as its 'queue')::
pt_br: Ви можете використовувати підклас :class:`QueueHandler` для надсилання повідомлень в інші типи черг, наприклад, сокет ZeroMQ 'publish'. У наведеному нижче прикладі сокет створюється окремо та передається обробнику (як його "черга"):

source: Of course there are other ways of organizing this, for example passing in the data needed by the handler to create the socket::
pt_br: Звичайно, існують інші способи організації цього, наприклад, передача даних, необхідних обробнику для створення сокета::

source: Subclass ``QueueListener``
pt_br: Подкласс ``QueueListener``

source: You can also subclass :class:`QueueListener` to get messages from other kinds of queues, for example a ZeroMQ 'subscribe' socket. Here's an example::
pt_br: Ви також можете створити підклас :class:`QueueListener`, щоб отримувати повідомлення з інших типів черг, наприклад, сокет ZeroMQ 'subscribe'. Ось приклад::

source: Subclassing QueueHandler and QueueListener- a ``pynng`` example
pt_br: Создание подклассов QueueHandler и QueueListener — пример ``pyng``

source: In a similar way to the above section, we can implement a listener and handler using :pypi:`pynng`, which is a Python binding to `NNG <https://nng.nanomsg.org/>`_, billed as a spiritual successor to ZeroMQ. The following snippets illustrate -- you can test them in an environment which has ``pynng`` installed. Just for variety, we present the listener first.
pt_br: Аналогично предыдущему разделу мы можем реализовать прослушиватель и обработчик, используя :pypi:`pynng`, который представляет собой привязку Python к `NNG <https://nng.nanomsg.org/>`_, позиционируемую как духовный преемник ZeroMQ. Следующие фрагменты иллюстрируют - вы можете протестировать их в среде, где установлен ``pyng``. Для разнообразия сначала представляем слушателя.

source: You can run the above two snippets in separate command shells. If we run the listener in one shell and run the sender in two separate shells, we should see something like the following. In the first sender shell:
pt_br: Вы можете запустить два приведенных выше фрагмента в отдельных командных оболочках. Если мы запустим прослушиватель в одной оболочке, а отправитель — в двух отдельных оболочках, мы должны увидеть что-то вроде следующего. В первой оболочке отправителя:

source: In the second sender shell:
pt_br: Во второй оболочке отправителя:

source: In the listener shell:
pt_br: В оболочке слушателя:

source: As you can see, the logging from the two sender processes is interleaved in the listener's output.
pt_br: Как видите, журналирование двух процессов-отправителей чередуется с выходными данными прослушивателя.

source: An example dictionary-based configuration
pt_br: Приклад конфігурації на основі словника

source: Below is an example of a logging configuration dictionary - it's taken from the `documentation on the Django project <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_. This dictionary is passed to :func:`~config.dictConfig` to put the configuration into effect::
pt_br: Нижче наведено приклад словника конфігурації журналювання — його взято з `документації проекту Django <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_. Цей словник передається до :func:`~config.dictConfig` для введення в дію конфігурації::

source: For more information about this configuration, you can see the `relevant section <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_ of the Django documentation.
pt_br: Для отримання додаткової інформації про цю конфігурацію ви можете переглянути `відповідний розділ <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_ документації Django.

source: Using a rotator and namer to customize log rotation processing
pt_br: Використання ротатора та іменника для налаштування обробки ротації журналу

source: An example of how you can define a namer and rotator is given in the following runnable script, which shows gzip compression of the log file::
pt_br: Пример того, как вы можете определить имя и ротатор, приведен в следующем исполняемом скрипте, который показывает сжатие файла журнала gzip:

source: After running this, you will see six new files, five of which are compressed:
pt_br: После запуска вы увидите шесть новых файлов, пять из которых сжаты:

source: A more elaborate multiprocessing example
pt_br: Більш складний приклад багатопроцесорної обробки

source: The following working example shows how logging can be used with multiprocessing using configuration files. The configurations are fairly simple, but serve to illustrate how more complex ones could be implemented in a real multiprocessing scenario.
pt_br: Наступний робочий приклад показує, як журналювання можна використовувати з багатопроцесорною обробкою за допомогою файлів конфігурації. Конфігурації досить прості, але служать для ілюстрації того, як більш складні можуть бути реалізовані в реальному багатопроцесорному сценарії.

source: In the example, the main process spawns a listener process and some worker processes. Each of the main process, the listener and the workers have three separate configurations (the workers all share the same configuration). We can see logging in the main process, how the workers log to a QueueHandler and how the listener implements a QueueListener and a more complex logging configuration, and arranges to dispatch events received via the queue to the handlers specified in the configuration. Note that these configurations are purely illustrative, but you should be able to adapt this example to your own scenario.
pt_br: У прикладі головний процес породжує процес слухача та деякі робочі процеси. Кожен із основного процесу, слухача та робочих має три окремі конфігурації (усі робочі мають однакову конфігурацію). Ми можемо побачити реєстрацію в основному процесі, як працівники входять до QueueHandler і як слухач реалізує QueueListener і більш складну конфігурацію журналювання, а також організовує відправку подій, отриманих через чергу, до обробників, указаних у конфігурації. Зауважте, що ці конфігурації є суто ілюстративними, але ви зможете адаптувати цей приклад до власного сценарію.

source: Here's the script - the docstrings and the comments hopefully explain how it works::
pt_br: Ось сценарій - рядки документації та коментарі, сподіваюся, пояснюють, як це працює::

source: Inserting a BOM into messages sent to a SysLogHandler
pt_br: Вставлення BOM у повідомлення, надіслані до SysLogHandler

source: :rfc:`5424` requires that a Unicode message be sent to a syslog daemon as a set of bytes which have the following structure: an optional pure-ASCII component, followed by a UTF-8 Byte Order Mark (BOM), followed by Unicode encoded using UTF-8. (See the :rfc:`relevant section of the specification <5424#section-6>`.)
pt_br: :rfc:`5424` вимагає, щоб повідомлення Unicode надсилалося до демона системного журналу як набір байтів із такою структурою: необов’язковий чистий ASCII-компонент, за яким слідує UTF-8 Byte Order Mark (BOM), за яким слідує Юнікод, закодований за допомогою UTF-8. (Див. :rfc:`відповідний розділ специфікації <5424#section-6>`.)

source: In Python 3.1, code was added to :class:`~logging.handlers.SysLogHandler` to insert a BOM into the message, but unfortunately, it was implemented incorrectly, with the BOM appearing at the beginning of the message and hence not allowing any pure-ASCII component to appear before it.
pt_br: У Python 3.1 до :class:`~logging.handlers.SysLogHandler` було додано код для вставлення BOM у повідомлення, але, на жаль, він був реалізований неправильно, оскільки BOM з’являвся на початку повідомлення, а отже, не дозволяв будь-які компонент pure-ASCII, який з’явиться перед ним.

source: As this behaviour is broken, the incorrect BOM insertion code is being removed from Python 3.2.4 and later. However, it is not being replaced, and if you want to produce :rfc:`5424`-compliant messages which include a BOM, an optional pure-ASCII sequence before it and arbitrary Unicode after it, encoded using UTF-8, then you need to do the following:
pt_br: Оскільки ця поведінка порушена, неправильний код вставки BOM видаляється з Python 3.2.4 і пізніших версій. Однак його не буде замінено, і якщо ви хочете створювати повідомлення, сумісні з :rfc:`5424`, які включають специфікацію матеріалів, необов’язкову чисту послідовність ASCII перед нею та довільний код Unicode після неї, закодований за допомогою UTF-8, тоді ви потрібно зробити наступне:

source: Attach a :class:`~logging.Formatter` instance to your :class:`~logging.handlers.SysLogHandler` instance, with a format string such as::
pt_br: Приєднайте екземпляр :class:`~logging.Formatter` до вашого екземпляра :class:`~logging.handlers.SysLogHandler` із рядком форматування, наприклад:

source: 'ASCII section\ufeffUnicode section'
pt_br: 'Раздел ASCII\ufeffРаздел Unicode'

source: The Unicode code point U+FEFF, when encoded using UTF-8, will be encoded as a UTF-8 BOM -- the byte-string ``b'\xef\xbb\xbf'``.
pt_br: Кодова точка Юнікоду U+FEFF, коли вона кодується за допомогою UTF-8, буде закодована як UTF-8 BOM -- рядок байтів ``b'\xef\xbb\xbf``.

source: Replace the ASCII section with whatever placeholders you like, but make sure that the data that appears in there after substitution is always ASCII (that way, it will remain unchanged after UTF-8 encoding).
pt_br: Замініть розділ ASCII будь-якими заповнювачами, але переконайтеся, що дані, які з’являються в ньому після заміни, завжди мають ASCII (таким чином вони залишаться незмінними після кодування UTF-8).

source: Replace the Unicode section with whatever placeholders you like; if the data which appears there after substitution contains characters outside the ASCII range, that's fine -- it will be encoded using UTF-8.
pt_br: Замініть розділ Unicode будь-якими заповнювачами; якщо дані, які з’являються там після заміни, містять символи поза діапазоном ASCII, це нормально – вони будуть закодовані за допомогою UTF-8.

source: The formatted message *will* be encoded using UTF-8 encoding by ``SysLogHandler``. If you follow the above rules, you should be able to produce :rfc:`5424`-compliant messages. If you don't, logging may not complain, but your messages will not be RFC 5424-compliant, and your syslog daemon may complain.
pt_br: Відформатоване повідомлення *буде* закодовано за допомогою кодування UTF-8 за допомогою ``SysLogHandler``. Якщо ви дотримуєтеся наведених вище правил, ви зможете створювати :rfc:`5424`-сумісні повідомлення. Якщо ви цього не зробите, журналювання може не скаржитися, але ваші повідомлення не будуть сумісними з RFC 5424, і ваш демон системного журналу може скаржитися.

source: Implementing structured logging
pt_br: Впровадження структурованого журналювання

source: Although most logging messages are intended for reading by humans, and thus not readily machine-parseable, there might be circumstances where you want to output messages in a structured format which *is* capable of being parsed by a program (without needing complex regular expressions to parse the log message). This is straightforward to achieve using the logging package. There are a number of ways in which this could be achieved, but the following is a simple approach which uses JSON to serialise the event in a machine-parseable manner::
pt_br: Незважаючи на те, що більшість повідомлень журналу призначені для читання людьми, і тому їх не легко аналізувати машиною, можуть виникнути обставини, коли ви захочете вивести повідомлення у структурованому форматі, який *може* проаналізувати програма (без потреби у складних регулярних виразах). щоб проаналізувати повідомлення журналу). Це легко досягти за допомогою пакета журналювання. Існує кілька способів, за допомогою яких цього можна досягти, але нижче наведено простий підхід, який використовує JSON для серіалізації події машинним способом:

source: If the above script is run, it prints:
pt_br: Якщо наведений вище сценарій запущено, він друкує:

source: Note that the order of items might be different according to the version of Python used.
pt_br: Зауважте, що порядок елементів може відрізнятися залежно від версії Python, що використовується.

source: If you need more specialised processing, you can use a custom JSON encoder, as in the following complete example::
pt_br: Якщо вам потрібна більш спеціалізована обробка, ви можете використовувати спеціальний кодер JSON, як у наступному повному прикладі:

source: When the above script is run, it prints:
pt_br: Коли наведений вище сценарій виконується, він друкує:

source: Customizing handlers with :func:`dictConfig`
pt_br: Налаштування обробників за допомогою :func:`dictConfig`

source: There are times when you want to customize logging handlers in particular ways, and if you use :func:`dictConfig` you may be able to do this without subclassing. As an example, consider that you may want to set the ownership of a log file. On POSIX, this is easily done using :func:`shutil.chown`, but the file handlers in the stdlib don't offer built-in support. You can customize handler creation using a plain function such as::
pt_br: Бувають випадки, коли ви хочете налаштувати обробники журналу певним чином, і якщо ви використовуєте :func:`dictConfig`, ви можете зробити це без підкласів. Як приклад, подумайте, що ви можете встановити право власності на файл журналу. У POSIX це легко зробити за допомогою :func:`shutil.chown`, але обробники файлів у stdlib не пропонують вбудованої підтримки. Ви можете налаштувати створення обробника за допомогою простої функції, такої як:

source: You can then specify, in a logging configuration passed to :func:`dictConfig`, that a logging handler be created by calling this function::
pt_br: Потім ви можете вказати в конфігурації журналювання, переданій у :func:`dictConfig`, щоб обробник журналювання було створено шляхом виклику цієї функції::

source: In this example I am setting the ownership using the ``pulse`` user and group, just for the purposes of illustration. Putting it together into a working script, ``chowntest.py``::
pt_br: У цьому прикладі я встановлюю право власності за допомогою користувача та групи ``pulse`` лише для ілюстрації. Об’єднавши це в робочий сценарій, ``chowntest.py``::

source: To run this, you will probably need to run as ``root``:
pt_br: Щоб запустити це, вам, ймовірно, потрібно буде запустити як ``root``:

source: Note that this example uses Python 3.3 because that's where :func:`shutil.chown` makes an appearance. This approach should work with any Python version that supports :func:`dictConfig` - namely, Python 2.7, 3.2 or later. With pre-3.3 versions, you would need to implement the actual ownership change using e.g. :func:`os.chown`.
pt_br: Зверніть увагу, що в цьому прикладі використовується Python 3.3, тому що саме там з’являється :func:`shutil.chown`. Цей підхід має працювати з будь-якою версією Python, яка підтримує :func:`dictConfig`, а саме з Python 2.7, 3.2 або новішою. У версіях до 3.3 вам потрібно було б реалізувати фактичну зміну власності, використовуючи, наприклад, :func:`os.chown`.

source: In practice, the handler-creating function may be in a utility module somewhere in your project. Instead of the line in the configuration::
pt_br: На практиці функція створення обробника може бути десь у службовому модулі вашого проекту. Замість рядка в конфігурації::

source: you could use e.g.::
pt_br: ви можете використовувати, наприклад::

source: where ``project.util`` can be replaced with the actual name of the package where the function resides. In the above working script, using ``'ext://__main__.owned_file_handler'`` should work. Here, the actual callable is resolved by :func:`dictConfig` from the ``ext://`` specification.
pt_br: де ``project.util`` можна замінити фактичною назвою пакета, де знаходиться функція. У наведеному вище робочому сценарії використання ``'ext://__main__.owned_file_handler`` має працювати. Тут фактичний виклик визначається за допомогою :func:`dictConfig` із специфікації ``ext://``.

source: This example hopefully also points the way to how you could implement other types of file change - e.g. setting specific POSIX permission bits - in the same way, using :func:`os.chmod`.
pt_br: Сподіваємось, цей приклад також вказує шлях до того, як ви можете реалізувати інші типи змін файлів - наприклад. встановлення певних бітів дозволу POSIX - таким же чином, за допомогою :func:`os.chmod`.

source: Of course, the approach could also be extended to types of handler other than a :class:`~logging.FileHandler` - for example, one of the rotating file handlers, or a different type of handler altogether.
pt_br: Звичайно, цей підхід також можна розширити до типів обробників, відмінних від :class:`~logging.FileHandler` - наприклад, одного з обробників файлів, що обертаються, або зовсім іншого типу обробника.

source: Using particular formatting styles throughout your application
pt_br: Використання певних стилів форматування у вашій програмі

source: In Python 3.2, the :class:`~logging.Formatter` gained a ``style`` keyword parameter which, while defaulting to ``%`` for backward compatibility, allowed the specification of ``{`` or ``$`` to support the formatting approaches supported by :meth:`str.format` and :class:`string.Template`. Note that this governs the formatting of logging messages for final output to logs, and is completely orthogonal to how an individual logging message is constructed.
pt_br: У Python 3.2 :class:`~logging.Formatter` отримав параметр ключового слова ``style``, який, незважаючи на значення за умовчанням ``%`` для зворотної сумісності, дозволяв специфікацію ``{`` або ``$`` для підтримки підходів до форматування, які підтримуються :meth:`str.format` і :class:`string.Template`. Зауважте, що це керує форматуванням повідомлень журналу для остаточного виведення в журнали та повністю ортогонально до того, як будується окреме повідомлення журналу.

source: Logging calls (:meth:`~Logger.debug`, :meth:`~Logger.info` etc.) only take positional parameters for the actual logging message itself, with keyword parameters used only for determining options for how to handle the logging call (e.g. the ``exc_info`` keyword parameter to indicate that traceback information should be logged, or the ``extra`` keyword parameter to indicate additional contextual information to be added to the log). So you cannot directly make logging calls using :meth:`str.format` or :class:`string.Template` syntax, because internally the logging package uses %-formatting to merge the format string and the variable arguments. There would be no changing this while preserving backward compatibility, since all logging calls which are out there in existing code will be using %-format strings.
pt_br: Вызовы ведения журнала (:meth:`~Logger.debug`, :meth:`~Logger.info` и т. д.) принимают только позиционные параметры для самого фактического сообщения журнала, а параметры ключевых слов используются только для определения вариантов обработки журнала. вызов (например, параметр ключевого слова ``exc_info``, чтобы указать, что информация трассировки должна быть зарегистрирована, или параметр ключевого слова ``extra``, чтобы указать дополнительную контекстную информацию, которая должна быть добавлена ​​в журнал). Таким образом, вы не можете напрямую выполнять вызовы журналирования, используя синтаксис :meth:`str.format` или :class:`string.Template`, поскольку внутри пакета журналирования используется %-f форматирование для объединения строки формата и аргументов переменной. Это не будет изменено при сохранении обратной совместимости, поскольку все вызовы журналирования, которые есть в существующем коде, будут использовать %-f форматировать строки.

source: There have been suggestions to associate format styles with specific loggers, but that approach also runs into backward compatibility problems because any existing code could be using a given logger name and using %-formatting.
pt_br: Були пропозиції пов’язати стилі формату з певними реєстраторами, але такий підхід також стикається з проблемами зворотної сумісності, оскільки будь-який існуючий код може використовувати дане ім’я реєстратора та використовувати %-formatting.
