Repository: python/python-docs-pt-br
Catalog: howto/logging.po
Languages: pt_br

source: For formatting multiple messages in a batch, instances of :class:`BufferingFormatter` can be used. In addition to the format string (which is applied to each message in the batch), there is provision for header and trailer format strings.
pt_br: Для форматирования нескольких сообщений в пакете можно использовать экземпляры :class:`BufferingFormatter`. В дополнение к строке формата (которая применяется к каждому сообщению в пакете) предусмотрены строки формата заголовка и концевика.

source: When filtering based on logger level and/or handler level is not enough, instances of :class:`Filter` can be added to both :class:`Logger` and :class:`Handler` instances (through their :meth:`~Handler.addFilter` method). Before deciding to process a message further, both loggers and handlers consult all their filters for permission. If any filter returns a false value, the message is not processed further.
pt_br: Якщо фільтрації на основі рівня реєстратора та/або рівня обробника недостатньо, екземпляри :class:`Filter` можна додати до екземплярів :class:`Logger` і :class:`Handler` (через їх метод :meth:`~Handler.addFilter`). Перш ніж вирішити продовжити обробку повідомлення, і реєстратори, і обробники звертаються до всіх своїх фільтрів для отримання дозволу. Якщо будь-який фільтр повертає хибне значення, повідомлення не обробляється далі.

source: The basic :class:`Filter` functionality allows filtering by specific logger name. If this feature is used, messages sent to the named logger and its children are allowed through the filter, and all others dropped.
pt_br: Основна функція :class:`Filter` дозволяє фільтрувати за певним іменем реєстратора. Якщо використовується ця функція, повідомлення, надіслані до названого реєстратора та його дочірніх елементів, пропускаються через фільтр, а всі інші відкидаються.

source: Exceptions raised during logging
pt_br: Exceções levantadas durante logging

source: The logging package is designed to swallow exceptions which occur while logging in production. This is so that errors which occur while handling logging events - such as logging misconfiguration, network or other similar errors - do not cause the application using logging to terminate prematurely.
pt_br: Пакет журналювання призначений для ковтання винятків, які виникають під час входу в робочу систему. Це зроблено для того, щоб помилки, які виникають під час обробки подій журналювання (наприклад, неправильна конфігурація журналу, мережа чи інші подібні помилки), не призвели до передчасного завершення програми, яка використовує журналювання.

source: :class:`SystemExit` and :class:`KeyboardInterrupt` exceptions are never swallowed. Other exceptions which occur during the :meth:`~Handler.emit` method of a :class:`Handler` subclass are passed to its :meth:`~Handler.handleError` method.
pt_br: Винятки :class:`SystemExit` і :class:`KeyboardInterrupt` ніколи не проковтуються. Інші винятки, які виникають під час методу :meth:`~Handler.emit` підкласу :class:`Handler`, передаються до його методу :meth:`~Handler.handleError`.

source: The default implementation of :meth:`~Handler.handleError` in :class:`Handler` checks to see if a module-level variable, :data:`raiseExceptions`, is set. If set, a traceback is printed to :data:`sys.stderr`. If not set, the exception is swallowed.
pt_br: Стандартна реалізація :meth:`~Handler.handleError` в :class:`Handler` перевіряє, чи встановлено змінну рівня модуля, :data:`raiseExceptions`. Якщо встановлено, зворотне відстеження друкується в :data:`sys.stderr`. Якщо не встановлено, виняток проковтується.

source: The default value of :data:`raiseExceptions` is ``True``. This is because during development, you typically want to be notified of any exceptions that occur. It's advised that you set :data:`raiseExceptions` to ``False`` for production usage.
pt_br: Значенням за замовчуванням :data:`raiseExceptions` є ``True``. Це пояснюється тим, що під час розробки ви зазвичай хочете отримувати сповіщення про будь-які винятки, які трапляються. Радимо встановити :data:`raiseExceptions` на ``False`` для використання у робочому режимі.

source: Using arbitrary objects as messages
pt_br: Usando objetos arbitrários como mensagens

source: In the preceding sections and examples, it has been assumed that the message passed when logging the event is a string. However, this is not the only possibility. You can pass an arbitrary object as a message, and its :meth:`~object.__str__` method will be called when the logging system needs to convert it to a string representation. In fact, if you want to, you can avoid computing a string representation altogether - for example, the :class:`~handlers.SocketHandler` emits an event by pickling it and sending it over the wire.
pt_br: У попередніх розділах і прикладах передбачалося, що повідомлення, передане під час реєстрації події, є рядком. Однак це не єдина можливість. Ви можете передати довільний об’єкт як повідомлення, і його метод :meth:`~object.__str__` буде викликано, коли системі журналювання потрібно перетворити його на представлення рядка. Насправді, якщо ви хочете, ви можете взагалі уникнути обчислення представлення рядка - наприклад, :class:`~handlers.SocketHandler` випромінює подію, вибираючи її та надсилаючи по дроту.

source: Optimization
pt_br: Optimização

source: Formatting of message arguments is deferred until it cannot be avoided. However, computing the arguments passed to the logging method can also be expensive, and you may want to avoid doing it if the logger will just throw away your event. To decide what to do, you can call the :meth:`~Logger.isEnabledFor` method which takes a level argument and returns true if the event would be created by the Logger for that level of call. You can write code like this::
pt_br: Форматування аргументів повідомлення відкладено, доки його не можна уникнути. Однак обчислення аргументів, переданих до методу журналювання, також може бути дорогим, і ви можете уникнути цього, якщо реєстратор просто відкине вашу подію. Щоб вирішити, що робити, ви можете викликати метод :meth:`~Logger.isEnabledFor`, який приймає аргумент рівня та повертає значення true, якщо подію буде створено реєстратором для цього рівня виклику. Ви можете написати такий код:

source: so that if the logger's threshold is set above ``DEBUG``, the calls to ``expensive_func1`` and ``expensive_func2`` are never made.
pt_br: так что если порог регистратора установлен выше DEBUG, вызовы expensive_func1 иexpensive_func2 никогда не выполняются.

source: In some cases, :meth:`~Logger.isEnabledFor` can itself be more expensive than you'd like (e.g. for deeply nested loggers where an explicit level is only set high up in the logger hierarchy). In such cases (or if you want to avoid calling a method in tight loops), you can cache the result of a call to :meth:`~Logger.isEnabledFor` in a local or instance variable, and use that instead of calling the method each time. Such a cached value would only need to be recomputed when the logging configuration changes dynamically while the application is running (which is not all that common).
pt_br: У деяких випадках :meth:`~Logger.isEnabledFor` сам по собі може бути дорожчим, ніж вам хотілося б (наприклад, для глибоко вкладених реєстраторів, де явний рівень встановлюється лише високо в ієрархії реєстратора). У таких випадках (або якщо ви хочете уникнути виклику методу в жорстких циклах), ви можете кешувати результат виклику :meth:`~Logger.isEnabledFor` у локальній змінній чи змінній екземпляра та використовувати це замість виклику метод кожного разу. Таке кешоване значення потрібно було б повторно обчислити лише тоді, коли конфігурація журналювання динамічно змінюється під час роботи програми (що не так вже й часто).

source: There are other optimizations which can be made for specific applications which need more precise control over what logging information is collected. Here's a list of things you can do to avoid processing during logging which you don't need:
pt_br: Існують інші оптимізації, які можна зробити для конкретних програм, які потребують більш точного контролю над тим, яка інформація журналу збирається. Ось список речей, які ви можете зробити, щоб уникнути обробки під час журналювання, яка вам не потрібна:

source: What you don't want to collect
pt_br: O que você não quer coletar

source: How to avoid collecting it
pt_br: Як уникнути його збору

source: Information about where calls were made from.
pt_br: Інформація про те, звідки дзвонили.

source: Set ``logging._srcfile`` to ``None``. This avoids calling :func:`sys._getframe`, which may help to speed up your code in environments like PyPy (which can't speed up code that uses :func:`sys._getframe`).
pt_br: Встановіть для ``logging._srcfile`` значення ``None``. Це дозволяє уникнути виклику :func:`sys._getframe`, що може допомогти пришвидшити ваш код у таких середовищах, як PyPy (який не може прискорити код, який використовує :func:`sys._getframe`).

source: Threading information.
pt_br: Інформація про потоки.

source: Set ``logging.logThreads`` to ``False``.
pt_br: Встановіть для ``logging.logThreads`` значення ``False``.

source: Current process ID (:func:`os.getpid`)
pt_br: Ідентифікатор поточного процесу (:func:`os.getpid`)

source: Set ``logging.logProcesses`` to ``False``.
pt_br: Встановіть для ``logging.logProcesses`` значення ``False``.

source: Current process name when using ``multiprocessing`` to manage multiple processes.
pt_br: Поточне ім’я процесу, якщо для керування кількома процесами використовується ``багатопроцесорна обробка``.

source: Set ``logging.logMultiprocessing`` to ``False``.
pt_br: Встановіть для ``logging.logMultiprocessing`` значення ``False``.

source: Current :class:`asyncio.Task` name when using ``asyncio``.
pt_br: Текущее имя :class:`asyncio.Task` при использовании ``asyncio``.

source: Set ``logging.logAsyncioTasks`` to ``False``.
pt_br: Установите для logging.logAsyncioTasks значение False.

source: Also note that the core logging module only includes the basic handlers. If you don't import :mod:`logging.handlers` and :mod:`logging.config`, they won't take up any memory.
pt_br: Також зауважте, що основний модуль журналювання включає лише основні обробники. Якщо ви не імпортуєте :mod:`logging.handlers` і :mod:`logging.config`, вони не займатимуть жодної пам’яті.

source: Other resources
pt_br: Outros recursos

source: Module :mod:`logging`
pt_br: Módulo :mod:`logging`

source: API reference for the logging module.
pt_br: Referência da API para o módulo de logging.

source: Module :mod:`logging.config`
pt_br: Módulo :mod:`logging.config`

source: Configuration API for the logging module.
pt_br: API de configuração para o módulo logging.

source: Module :mod:`logging.handlers`
pt_br: Módulo :mod:`logging.handlers`

source: Useful handlers included with the logging module.
pt_br: Tratadores úteis incluídos no módulo logging.

source: :ref:`A logging cookbook <logging-cookbook>`
pt_br: :ref:`Um livro de receitas do logging <logging-cookbook>`
