Repository: python/python-docs-pt-br
Catalog: howto/logging.po
Languages: pt_br

source: Logging HOWTO
pt_br: Logging

source: Author
pt_br: Autor

source: This page contains tutorial information. For links to reference information and a logging cookbook, please see :ref:`tutorial-ref-links`.
pt_br: Essa página contém informações relativas a tutoriais. Para links de informações de referência e logging cookbook, por favor veja :ref:`tutorial-ref-links`.

source: Basic Logging Tutorial
pt_br: Tutorial Básico de Logging

source: Logging is a means of tracking events that happen when some software runs. The software's developer adds logging calls to their code to indicate that certain events have occurred. An event is described by a descriptive message which can optionally contain variable data (i.e. data that is potentially different for each occurrence of the event). Events also have an importance which the developer ascribes to the event; the importance can also be called the *level* or *severity*.
pt_br: Logging é uma maneira de rastrear eventos que acontecem quando algum software executa. O desenvolvedor de software adiciona chamadas de logging no código para indicar que determinado evento ocorreu. Um evento é descrito por uma mensagem descritiva que pode opcionalmente conter o dado de uma variável (ex.: dado que é potencialmente diferente pra cada ocorrência do evento). Eventos também tem um peso que o desenvolvedor atribui para o evento; o peso pode também ser chamada de *níveis* ou *severidade*.

source: When to use logging
pt_br: Quando usar logging

source: You can access logging functionality by creating a logger via ``logger = getLogger(__name__)``, and then calling the logger's :meth:`~Logger.debug`, :meth:`~Logger.info`, :meth:`~Logger.warning`, :meth:`~Logger.error` and :meth:`~Logger.critical` methods. To determine when to use logging, and to see which logger methods to use when, see the table below. It states, for each of a set of common tasks, the best tool to use for that task.
pt_br: Você pode acessar a funcionalidade de logs criando um logger via ``logger = getLogger(__name__)`` e, em seguida, chamar os métodos :meth:`~Logger.debug`, :meth:`~Logger.info`, :meth:`~Logger.warning`, :meth:`~Logger.error` e :meth:`~Logger.critical`. Para determinar quando usar logging e ver quais métodos de logger utilizar e quando, consulte a tabela abaixo. Ele indica, para cada conjunto de tarefas comuns, a melhor ferramenta a ser usada para essa tarefa.

source: Task you want to perform
pt_br: Tarefa que você quer performar

source: The best tool for the task
pt_br: A melhor ferramenta para a tarefa

source: Display console output for ordinary usage of a command line script or program
pt_br: Exibir saída do console para uso ordinário de um script de linha de comando ou programa.

source: Report events that occur during normal operation of a program (e.g. for status monitoring or fault investigation)
pt_br: Relata eventos que podem ocorrer durante a operação normal de um programa (ex: para monitoramento do status ou investigação de falha)

source: A logger's :meth:`~Logger.info` (or :meth:`~Logger.debug` method for very detailed output for diagnostic purposes)
pt_br: O método :meth:`~Logger.info` de um logger (ou :meth:`~Logger.debug` para saída muito detalhada para fins de diagnóstico)

source: Issue a warning regarding a particular runtime event
pt_br: Emite um aviso sobre um evento de tempo de execução específico

source: :func:`warnings.warn` in library code if the issue is avoidable and the client application should be modified to eliminate the warning
pt_br: :func:`warnings.warn` na biblioteca de código se o problema é evitável e a aplicação cliente deve ser modificada para eliminar o alerta.

source: A logger's :meth:`~Logger.warning` method if there is nothing the client application can do about the situation, but the event should still be noted
pt_br: O método :meth:`~Logger.warning` de um logger se não houver nada que a aplicação cliente possa fazer sobre a situação, mas o evento ainda deve ser registrado

source: Report an error regarding a particular runtime event
pt_br: Relata um erro sobre um evento de tempo de execução específico

source: Raise an exception
pt_br: Levantando uma exceção

source: Report suppression of an error without raising an exception (e.g. error handler in a long-running server process)
pt_br: Relatar supressão de um erro sem levantar uma exceção (ex: manipulador de erros em um processo de servidor em longa execução)

source: A logger's :meth:`~Logger.error`, :meth:`~Logger.exception` or :meth:`~Logger.critical` method as appropriate for the specific error and application domain
pt_br: Um método :meth:`~Logger.error`, :meth:`~Logger.exception` ou :meth:`~Logger.critical` do logger, conforme apropriado para o erro específico e domínio da aplicação

source: The logger methods are named after the level or severity of the events they are used to track. The standard levels and their applicability are described below (in increasing order of severity):
pt_br: Os métodos de logger são nomeados de acordo com o nível ou severidade dos eventos que eles são usados para rastrear. Os níveis padrão e sua aplicabilidade são descritos abaixo (em ordem crescente de severidade):

source: Level
pt_br: Nível

source: When it's used
pt_br: Quando é usado

source: Detailed information, typically of interest only when diagnosing problems.
pt_br: Informação detalhada, tipicamente de interesse apenas quando diagnosticando problemas.

source: Confirmation that things are working as expected.
pt_br: Confirmação de que as coisas estão funcionando como esperado.

source: An indication that something unexpected happened, or indicative of some problem in the near future (e.g. 'disk space low'). The software is still working as expected.
pt_br: Uma indicação que algo inesperado aconteceu, ou um indicativo que algum problema em um futuro próximo (ex.: 'pouco espaço em disco'). O software está ainda funcionando como esperado.

source: Due to a more serious problem, the software has not been able to perform some function.
pt_br: Por conta de um problema mais grave, o software não conseguiu executar alguma função.

source: A serious error, indicating that the program itself may be unable to continue running.
pt_br: Um erro grave, indicando que o programa pode não conseguir continuar rodando.

source: The default level is ``WARNING``, which means that only events of this level and above will be tracked, unless the logging package is configured to do otherwise.
pt_br: O nível padrão é ``WARNING``, que significa que só eventos deste nível e acima serão rastreados, a não ser que o pacote logging esteja configurado para fazer de outra forma.

source: Events that are tracked can be handled in different ways. The simplest way of handling tracked events is to print them to the console. Another common way is to write them to a disk file.
pt_br: Eventos que são rastreados podem ser tratados de diferentes formas. O jeito mais simples de lidar com eventos rastreados é exibi-los no console. Outra maneira comum é gravá-los em um arquivo de disco.

source: A simple example
pt_br: Um exemplo simples

source: A very simple example is::
pt_br: Um exemplo bastante simples é::

source: import logging logging.warning('Watch out!') # will print a message to the console logging.info('I told you so') # will not print anything
pt_br: import logging logging.warning('Watch out!') # imprimirá uma mensagem no console logging.info('I told you so') # não imprimirá nada

source: If you type these lines into a script and run it, you'll see:
pt_br: Se você digitar essas linhas no script e executá-lo, você verá:

source: printed out on the console. The ``INFO`` message doesn't appear because the default level is ``WARNING``. The printed message includes the indication of the level and the description of the event provided in the logging call, i.e. 'Watch out!'. The actual output can be formatted quite flexibly if you need that; formatting options will also be explained later.
pt_br: impresso no console. A mensagem ``INFO`` não aparece porque o nível padrão é ``WARNING``. A mensagem impressa inclui a indicação do nível e a descrição do evento fornecido na chamada de registro, ou seja, 'Watch out!'. A saída real pode ser formatada de maneira bastante flexível, se necessário; as opções de formatação também serão explicadas mais tarde.

source: Notice that in this example, we use functions directly on the ``logging`` module, like ``logging.debug``, rather than creating a logger and calling functions on it. These functions operation on the root logger, but can be useful as they will call :func:`~logging.basicConfig` for you if it has not been called yet, like in this example. In larger programs you'll usually want to control the logging configuration explicitly however - so for that reason as well as others, it's better to create loggers and call their methods.
pt_br: Observe que neste exemplo, usamos funções diretamente no módulo ``logging``, como ``logging.debug``, ao invés de criar um logger e chamar funções nele. Essas funções operam no logger raiz, mas podem ser úteis, pois chamarão :func:`~logging.basicConfig` para você se ele ainda não tiver sido chamado, como neste exemplo. Em programas maiores, você geralmente desejará controlar explicitamente a configuração de logging, no entanto - então, por esse motivo, assim como por outros, é melhor criar loggers e chamar seus métodos.

source: Logging to a file
pt_br: Logging em um arquivo

source: A very common situation is that of recording logging events in a file, so let's look at that next. Be sure to try the following in a newly started Python interpreter, and don't just continue from the session described above::
pt_br: Uma situação muito comum é a de registrar eventos de log em um arquivo, então vamos dar uma olhada nisso a seguir. Certifique-se de tentar o seguinte em um interpretador Python recém-iniciado, e não continue apenas a partir da sessão descrita acima::

source: The *encoding* argument was added. In earlier Python versions, or if not specified, the encoding used is the default value used by :func:`open`. While not shown in the above example, an *errors* argument can also now be passed, which determines how encoding errors are handled. For available values and the default, see the documentation for :func:`open`.
pt_br: Додано аргумент *кодування*. У попередніх версіях Python або, якщо не вказано, використовувалося кодування за замовчуванням, яке використовується :func:`open`. Хоча це не показано в наведеному вище прикладі, тепер також можна передати аргумент *errors*, який визначає, як обробляються помилки кодування. Доступні значення та типові значення дивіться в документації для :func:`open`.

source: And now if we open the file and look at what we have, we should find the log messages:
pt_br: E agora se nós abrirmos o arquivo e olharmos o que temos, deveremos encontrar essas mensagens de log:

source: This example also shows how you can set the logging level which acts as the threshold for tracking. In this case, because we set the threshold to ``DEBUG``, all of the messages were printed.
pt_br: Este exemplo também mostra como você pode configurar o nível do logging que age como um limiar para o rastreamento. Neste caso, por causa que definimos o limiar como ``DEBUG``, todas as mensagens foram exibidas.

source: If you want to set the logging level from a command-line option such as:
pt_br: Se você quer definir o nível de logging a partir de uma opção da linha de comando como:

source: and you have the value of the parameter passed for ``--log`` in some variable *loglevel*, you can use::
pt_br: e você tem o valor do parâmetro passado pelo ``--log`` em alguma variável *loglevel*, você pode usar::

source: to get the value which you'll pass to :func:`basicConfig` via the *level* argument. You may want to error check any user input value, perhaps as in the following example::
pt_br: para obter o valor que você passará para a :func:`basicConfig` via o *level* argumento. Você pode querer verificar qualquer erros introduzidos pelo usuário, talvez como no exemplo a seguir::

source: The call to :func:`basicConfig` should come *before* any calls to a logger's methods such as :meth:`~Logger.debug`, :meth:`~Logger.info`, etc. Otherwise, that logging event may not be handled in the desired manner.
pt_br: Вызов :func:`basicConfig` должен происходить *перед* любыми вызовами методов регистратора, таких как :meth:`~Logger.debug`, :meth:`~Logger.info` и т. д. В противном случае это событие регистрации может не обрабатываться желаемым образом.

source: If you run the above script several times, the messages from successive runs are appended to the file *example.log*. If you want each run to start afresh, not remembering the messages from earlier runs, you can specify the *filemode* argument, by changing the call in the above example to::
pt_br: Se você executar o script acima diversas vezes, as mensagens das sucessivas execuções serão acrescentadas ao arquivo *example.log*. Se você quer que cada execução seja iniciada novamente, não guardando as mensagens das execuções anteriores, você pode especificar o *filemode* argumento, mudando a chamada no exemplo acima::

source: The output will be the same as before, but the log file is no longer appended to, so the messages from earlier runs are lost.
pt_br: A saída será a mesma de antes, mas o arquivo de log não será mais incrementado, desta forma as mensagens de execuções anteriores serão perdidas.

source: Logging variable data
pt_br: Logging dados de uma variável

source: To log variable data, use a format string for the event description message and append the variable data as arguments. For example::
pt_br: Para logar o dado de uma variável, use o formato string para a mensagem descritiva do evento e adicione a variável como argumento. Exemplo::

source: will display:
pt_br: exibirá:

source: WARNING:root:Look before you leap!
pt_br: ВНИМАНИЕ:root: Посмотрите, прежде чем прыгать!

source: As you can see, merging of variable data into the event description message uses the old, %-style of string formatting. This is for backwards compatibility: the logging package pre-dates newer formatting options such as :meth:`str.format` and :class:`string.Template`. These newer formatting options *are* supported, but exploring them is outside the scope of this tutorial: see :ref:`formatting-styles` for more information.
pt_br: Como você pode ver, para combinar uma variável de dados na mensagem descritiva do evento usamos o velho, %-s estilo de formatação de string. Isto é usado para garantir compatibilidade com as versões anteriores: o pacote logging pré-data novas opções de formatação como :meth:`str.format` e :class:`string.Template`. Estas novas opções de formatação são suportadas, mas explorá-las esta fora do escopo deste tutorial: veja :ref:`formatting-styles` para mais informações.

source: Changing the format of displayed messages
pt_br: Alterar o formato das mensagens exibidas

source: To change the format which is used to display messages, you need to specify the format you want to use::
pt_br: Para mudar o formato usado para exibir mensagens, você precisa especificar o formato que quer usar::

source: which would print:
pt_br: que vai exibir:

source: Notice that the 'root' which appeared in earlier examples has disappeared. For a full set of things that can appear in format strings, you can refer to the documentation for :ref:`logrecord-attributes`, but for simple usage, you just need the *levelname* (severity), *message* (event description, including variable data) and perhaps to display when the event occurred. This is described in the next section.
pt_br: Note que a palavra 'root' que apareceu nos exemplos anteriores desapareceu. Para todas as configurações que possam aparecer na formatação de strings, você pode consultar a documentação :ref:`logrecord-attributes`, mas para uso simples, você só precisa do *levelname* (severidade), *message* (descrição do evento, incluindo a variável com dados) e talvez exibir quando o evento ocorreu. Isto esta descrito na próxima seção.

source: Displaying the date/time in messages
pt_br: Exibindo data/hora em mensagens

source: To display the date and time of an event, you would place '%(asctime)s' in your format string::
pt_br: Para exibir a data e hora de um evento, você pode colocar '%(asctime)s' no seu formato string::

source: which should print something like this:
pt_br: que deve exibir algo assim:

source: 2010-12-12 11:41:42,612 is when this event was logged.
pt_br: 2010-12-12 11:41:42,612 - это время, когда это событие было зарегистрировано.

source: The default format for date/time display (shown above) is like ISO8601 or :rfc:`3339`. If you need more control over the formatting of the date/time, provide a *datefmt* argument to ``basicConfig``, as in this example::
pt_br: O formato padrão para data/hora (mostrado abaixo) é como a ISO8601 ou :rfc:`3339`. Se você precisa de mais controle sobre a formatação de data/hora, informe o *datefmt* argumento para ``basicConfig``, como neste exemplo::

source: which would display something like this:
pt_br: que deve exibir algo assim:

source: 12/12/2010 11:46:36 AM is when this event was logged.
pt_br: 12.12.2010 11:46:36 — это время, когда было зарегистрировано это событие.

source: The format of the *datefmt* argument is the same as supported by :func:`time.strftime`.
pt_br: O formato do argumento *datefmt* é o mesmo suportado por :func:`time.strftime`.

source: Next Steps
pt_br: Próximos Passos

source: That concludes the basic tutorial. It should be enough to get you up and running with logging. There's a lot more that the logging package offers, but to get the best out of it, you'll need to invest a little more of your time in reading the following sections. If you're ready for that, grab some of your favourite beverage and carry on.
pt_br: Concluímos aqui o tutorial básico. Isto deve ser o bastante para você começar a trabalhar com logging. Existe muito mais que o pacote de logging pode oferecer, mas para ter o melhor disto, você precisará investir um pouco mais do seu tempo lendo as próximas seções. Se você está pronto para isso, pegue sua bebida favorita e continue.

source: If your logging needs are simple, then use the above examples to incorporate logging into your own scripts, and if you run into problems or don't understand something, please post a question on the comp.lang.python Usenet group (available at https://groups.google.com/g/comp.lang.python) and you should receive help before too long.
pt_br: Если ваши потребности в ведении журналов просты, используйте приведенные выше примеры, чтобы включить ведение журнала в свои собственные сценарии, а если у вас возникнут проблемы или вы что-то не понимаете, задайте вопрос в группе usenet comp.lang.python (доступно по адресу https). ://groups.google.com/g/comp.lang.python), и вскоре вы получите помощь.

source: Still here? You can carry on reading the next few sections, which provide a slightly more advanced/in-depth tutorial than the basic one above. After that, you can take a look at the :ref:`logging-cookbook`.
pt_br: Ainda por aqui? Você pode continuar lendo as seções seguintes, que tem um tutorial mais avançado que o básico acima. Depois disso, você pode dar uma olhada no :ref:`logging-cookbook`.

source: Advanced Logging Tutorial
pt_br: Tutorial Avançado do Logging

source: The logging library takes a modular approach and offers several categories of components: loggers, handlers, filters, and formatters.
pt_br: A biblioteca de logging tem uma abordagem modular e oferece algumas categorias de componentes: loggers, handlers, filters, e formatters.

source: Loggers expose the interface that application code directly uses.
pt_br: Loggers expõem a interface que o código da aplicação usa diretamente.

source: Handlers send the log records (created by loggers) to the appropriate destination.
pt_br: Handlers enviam os registros do evento (criados por loggers) aos destinos apropriados.

source: Filters provide a finer grained facility for determining which log records to output.
pt_br: Filters fornecem uma facilidade granular para determinar quais registros de eventos enviar à saída.

source: Formatters specify the layout of log records in the final output.
pt_br: Formatters especificam o layout dos registros de eventos na saída final.

source: Log event information is passed between loggers, handlers, filters and formatters in a :class:`LogRecord` instance.
pt_br: Uma informação de um evento de log é passada entre loggers, handlers, filters e formatters em uma instância de uma :class:`LogRecord`

source: Logging is performed by calling methods on instances of the :class:`Logger` class (hereafter called :dfn:`loggers`). Each instance has a name, and they are conceptually arranged in a namespace hierarchy using dots (periods) as separators. For example, a logger named 'scan' is the parent of loggers 'scan.text', 'scan.html' and 'scan.pdf'. Logger names can be anything you want, and indicate the area of an application in which a logged message originates.
pt_br: Logging é executada chamando métodos nas instâncias da :class:`Logger` classe, também chamado de :dfn:`loggers`. Cada instância tem um nome, e eles são conceitualmente organizados em uma hierarquia de espaço de nomes usando pontos como separadores. Por exemplo, um logger nomeado com 'scan' é o pai do logger 'scan.text', 'scan.html' e 'scan.pdf'. Você pode nomear o logger do jeito que preferir, e indicar a área de uma aplicação em que uma mensagem de log origina.

source: A good convention to use when naming loggers is to use a module-level logger, in each module which uses logging, named as follows::
pt_br: Uma boa convenção para usar quando nomear loggers é usar um módulo-nível logger, em cada módulo que usa o logging, nomeado como sugerido abaixo::

source: This means that logger names track the package/module hierarchy, and it's intuitively obvious where events are logged just from the logger name.
pt_br: Isto significa que o nome de um logger rastreia a hierarquia do pacote/módulo, e isto é obviamente intuitivo onde os eventos estão sendo registrados apenas pelo nome do logger.

source: The root of the hierarchy of loggers is called the root logger. That's the logger used by the functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`, which just call the same-named method of the root logger. The functions and the methods have the same signatures. The root logger's name is printed as 'root' in the logged output.
pt_br: Корінь ієрархії реєстраторів називається кореневим реєстратором. Це реєстратор, який використовують функції :func:`debug`, :func:`info`, :func:`warning`, :func:`error` і :func:`critical`, які просто викликають одноіменний метод кореневого реєстратора. Функції та методи мають однакові сигнатури. Ім'я кореневого реєстратора друкується як 'root' у зареєстрованих результатах.
