Repository: python/python-docs-pt-br
Catalog: howto/logging-cookbook.po
Languages: pt_br

source: Logging Cookbook
pt_br: Livro de receitas do logging

source: Author
pt_br: Autor

source: This page contains a number of recipes related to logging, which have been found useful in the past. For links to tutorial and reference information, please see :ref:`cookbook-ref-links`.
pt_br: Esta página contém uma série de receitas relacionadas ao registro de eventos, que foram considerados úteis no passado. Para obter links para tutoriais e outras referências, veja :ref:`cookbook-ref-links`

source: Using logging in multiple modules
pt_br: Usando logging em vários módulos

source: Multiple calls to ``logging.getLogger('someLogger')`` return a reference to the same logger object. This is true not only within the same module, but also across modules as long as it is in the same Python interpreter process. It is true for references to the same object; additionally, application code can define and configure a parent logger in one module and create (but not configure) a child logger in a separate module, and all logger calls to the child will pass up to the parent. Here is a main module::
pt_br: Várias chamadas para ``logging.getLogger('someLogger')`` retorna a referência para o mesmo objeto logger. Isso é verdadeiro não apenas dentro do mesmo módulo, mas também entre módulo, desde que esteja no mesmo processo do interpretador Python. Isso é verdadeiro para referências do mesmo objeto; além disso, o código da aplicação pode definir e configurar um logger pai em um módulo e criar (mas não configurar) um logger filho em um módulo separado, e todas as chamadas de logger para o filho passarão para o pai. Aqui está um módulo principal::

source: import logging import auxiliary_module # create logger with 'spam_application' logger = logging.getLogger('spam_application') logger.setLevel(logging.DEBUG) # create file handler which logs even debug messages fh = logging.FileHandler('spam.log') fh.setLevel(logging.DEBUG) # create console handler with a higher log level ch = logging.StreamHandler() ch.setLevel(logging.ERROR) # create formatter and add it to the handlers formatter = logging.Formatter('%(asctime)s - %(name)s - %(levelname)s - %(message)s') fh.setFormatter(formatter) ch.setFormatter(formatter) # add the handlers to the logger logger.addHandler(fh) logger.addHandler(ch) logger.info('creating an instance of auxiliary_module.Auxiliary') a = auxiliary_module.Auxiliary() logger.info('created an instance of auxiliary_module.Auxiliary') logger.info('calling auxiliary_module.Auxiliary.do_something') a.do_something() logger.info('finished auxiliary_module.Auxiliary.do_something') logger.info('calling auxiliary_module.some_function()') auxiliary_module.some_function() logger.info('done with auxiliary_module.some_function()')
pt_br: import logging import auxiliary_module # cria objeto logger com 'spam_application' logger = logging.getLogger('spam_application') logger.setLevel(logging.DEBUG) # cria manipulador de arquivo que registra até mesmo mensagens de debug fh = logging.FileHandler('spam.log') fh.setLevel(logging.DEBUG) # cria manipulador de console com um nível de registro mais alto ch = logging.StreamHandler() ch.setLevel(logging.ERROR) # cria formatador e adiciona aos manipuladores formatter = logging.Formatter('%(asctime)s - %(name)s - %(levelname)s - %(message)s') fh.setFormatter(formatter) ch.setFormatter(formatter) # adiciona os manipuladores ao logger logger.addHandler(fh) logger.addHandler(ch) logger.info('creating an instance of auxiliary_module.Auxiliary') a = auxiliary_module.Auxiliary() logger.info('created an instance of auxiliary_module.Auxiliary') logger.info('calling auxiliary_module.Auxiliary.do_something') a.do_something() logger.info('finished auxiliary_module.Auxiliary.do_something') logger.info('calling auxiliary_module.some_function()') auxiliary_module.some_function() logger.info('done with auxiliary_module.some_function()')

source: Here is the auxiliary module::
pt_br: Aqui está o módulo auxiliar::

source: import logging # create logger module_logger = logging.getLogger('spam_application.auxiliary') class Auxiliary: def __init__(self): self.logger = logging.getLogger('spam_application.auxiliary.Auxiliary') self.logger.info('creating an instance of Auxiliary') def do_something(self): self.logger.info('doing something') a = 1 + 1 self.logger.info('done doing something') def some_function(): module_logger.info('received a call to "some_function"')
pt_br: import logging # cria logger module_logger = logging.getLogger('spam_application.auxiliary') class Auxiliary: def __init__(self): self.logger = logging.getLogger('spam_application.auxiliary.Auxiliary') self.logger.info('creating an instance of Auxiliary') def do_something(self): self.logger.info('doing something') a = 1 + 1 self.logger.info('done doing something') def some_function(): module_logger.info('received a call to "some_function"')

source: The output looks like this:
pt_br: O resultado deve ser algo assim:

source: Logging from multiple threads
pt_br: Registro de eventos de várias threads

source: Logging from multiple threads requires no special effort. The following example shows logging from the main (initial) thread and another thread::
pt_br: O registro de eventos de várias threads não requer nenhum esforço especial. O exemplo a seguir mostra o registro de eventos da thread principal (inicial) thread e de outra thread::

source: When run, the script should print something like the following:
pt_br: Quando executado, o script deve exibir algo como o seguinte:

source: This shows the logging output interspersed as one might expect. This approach works for more threads than shown here, of course.
pt_br: Isso mostra a saída de registro intercalada, como seria de se esperar. Essa abordagem funciona para mais thread do que o mostrado aqui, é claro.

source: Multiple handlers and formatters
pt_br: Múltiplos manipuladores e formatadores

source: Loggers are plain Python objects. The :meth:`~Logger.addHandler` method has no minimum or maximum quota for the number of handlers you may add. Sometimes it will be beneficial for an application to log all messages of all severities to a text file while simultaneously logging errors or above to the console. To set this up, simply configure the appropriate handlers. The logging calls in the application code will remain unchanged. Here is a slight modification to the previous simple module-based configuration example::
pt_br: Registradores (loggers) são objetos Python simples. O método :meth:`~Logger.addHandler` não tem cota mínima ou máxima para o número de manipuladores que podem ser adicionados. Às vezes, é vantajoso para um aplicação registrar todas as mensagens de todas as gravidades em um arquivo texto e, ao mesmo tempo, registrar erro ou superior no console. Para definir isso, basta configurar os manipuladores apropriados. As chamadas de registro no código da aplicação permanecerão inalteradas. Aqui está uma pequena modificação no exemplo anterior de configuração simples baseada em módulo::

source: import logging logger = logging.getLogger('simple_example') logger.setLevel(logging.DEBUG) # create file handler which logs even debug messages fh = logging.FileHandler('spam.log') fh.setLevel(logging.DEBUG) # create console handler with a higher log level ch = logging.StreamHandler() ch.setLevel(logging.ERROR) # create formatter and add it to the handlers formatter = logging.Formatter('%(asctime)s - %(name)s - %(levelname)s - %(message)s') ch.setFormatter(formatter) fh.setFormatter(formatter) # add the handlers to logger logger.addHandler(ch) logger.addHandler(fh) # 'application' code logger.debug('debug message') logger.info('info message') logger.warning('warn message') logger.error('error message') logger.critical('critical message')
pt_br: import logging logger = logging.getLogger('simple_example') logger.setLevel(logging.DEBUG) # cria manipulador de arquivo que regitra até mensagens de depuração fh = logging.FileHandler('spam.log') fh.setLevel(logging.DEBUG) # cria manipulador de console com um nível de gravidade mais alto ch = logging.StreamHandler() ch.setLevel(logging.ERROR) # cria formatador e adiciona-o ao manipulador formatter = logging.Formatter('%(asctime)s - %(name)s - %(levelname)s - %(message)s') ch.setFormatter(formatter) fh.setFormatter(formatter) # adiciona os manipuladores ao registrador logger.addHandler(ch) logger.addHandler(fh) # código da 'aplicação' logger.debug('debug message') logger.info('info message') logger.warning('warn message') logger.error('error message') logger.critical('critical message')

source: Notice that the 'application' code does not care about multiple handlers. All that changed was the addition and configuration of a new handler named *fh*.
pt_br: Observe que o código da 'aplicação' não se preocupa com vários manipuladores. Tudo o que mudou foi a adição e a configuração de um novo manipulador nomeado *fh*.

source: The ability to create new handlers with higher- or lower-severity filters can be very helpful when writing and testing an application. Instead of using many ``print`` statements for debugging, use ``logger.debug``: Unlike the print statements, which you will have to delete or comment out later, the logger.debug statements can remain intact in the source code and remain dormant until you need them again. At that time, the only change that needs to happen is to modify the severity level of the logger and/or handler to debug.
pt_br: A capacidade de criar novos manipuladores com filtros de severidade superiores ou inferiores pode ser muito útil ao escrever e testar um aplicação. Em vez de usar muitas instruções instrução para depuração, use ``logger.debug``: diferentemente da instrução print, que você terá de excluir ou comentar posteriormente, a instrução logger.debug pode permanecer intacta no código-fonte e ficar inativo até que você precise dela novamente. Nesse momento, a única alteração que precisa ser feita é modificar o nível de severidade do registrador e/ou manipulador para depuração.

source: Logging to multiple destinations
pt_br: Реєстрація в кількох пунктах призначення

source: Let's say you want to log to console and file with different message formats and in differing circumstances. Say you want to log messages with levels of DEBUG and higher to file, and those messages at level INFO and higher to the console. Let's also assume that the file should contain timestamps, but the console messages should not. Here's how you can achieve this::
pt_br: Припустімо, ви хочете увійти в консоль і файл із різними форматами повідомлень і за різних обставин. Скажімо, ви хочете реєструвати повідомлення з рівнями DEBUG і вище у файл, а ці повідомлення рівня INFO і вище — на консоль. Давайте також припустимо, що файл повинен містити мітки часу, але повідомлення консолі не повинні. Ось як ви можете цього досягти:

source: When you run this, on the console you will see
pt_br: Коли ви запустите це, на консолі ви побачите

source: and in the file you will see something like
pt_br: і у файлі ви побачите щось на зразок

source: As you can see, the DEBUG message only shows up in the file. The other messages are sent to both destinations.
pt_br: Як бачите, повідомлення DEBUG відображається лише у файлі. Інші повідомлення надсилаються в обидва адресати.

source: This example uses console and file handlers, but you can use any number and combination of handlers you choose.
pt_br: У цьому прикладі використовуються обробники консолі та файлів, але ви можете використовувати будь-яку кількість і комбінацію обробників на свій вибір.

source: Note that the above choice of log filename ``/tmp/myapp.log`` implies use of a standard location for temporary files on POSIX systems. On Windows, you may need to choose a different directory name for the log - just ensure that the directory exists and that you have the permissions to create and update files in it.
pt_br: Обратите внимание, что приведенный выше выбор имени файла журнала ``/tmp/myapp.log`` подразумевает использование стандартного местоположения для временных файлов в системах POSIX. В Windows вам может потребоваться выбрать другое имя каталога для журнала — просто убедитесь, что каталог существует и что у вас есть разрешения на создание и обновление файлов в нем.

source: Custom handling of levels
pt_br: Пользовательская обработка уровней

source: Sometimes, you might want to do something slightly different from the standard handling of levels in handlers, where all levels above a threshold get processed by a handler. To do this, you need to use filters. Let's look at a scenario where you want to arrange things as follows:
pt_br: Иногда вам может потребоваться сделать что-то немного отличное от стандартной обработки уровней в обработчиках, где все уровни выше порогового значения обрабатываются обработчиком. Для этого нужно использовать фильтры. Давайте рассмотрим сценарий, в котором вы хотите организовать все следующим образом:

source: Send messages of severity ``INFO`` and ``WARNING`` to ``sys.stdout``
pt_br: Отправлять сообщения серьезности ``INFO`` и ``WARNING`` в ``sys.stdout``.

source: Send messages of severity ``ERROR`` and above to ``sys.stderr``
pt_br: Отправлять сообщения уровня серьезности ``ERROR`` и выше в ``sys.stderr``.

source: Send messages of severity ``DEBUG`` and above to file ``app.log``
pt_br: Отправлять сообщения уровня серьезности ``DEBUG`` и выше в файл ``app.log``.

source: Suppose you configure logging with the following JSON:
pt_br: Предположим, вы настраиваете ведение журнала с помощью следующего JSON:

source: and changing the section on the ``stdout`` handler to add it:
pt_br: и изменив раздел обработчика ``stdout``, чтобы добавить его:

source: A filter is just a function, so we can define the ``filter_maker`` (a factory function) as follows:
pt_br: Фильтр — это просто функция, поэтому мы можем определить «filter_maker» (фабричную функцию) следующим образом:

source: This converts the string argument passed in to a numeric level, and returns a function which only returns ``True`` if the level of the passed in record is at or below the specified level. Note that in this example I have defined the ``filter_maker`` in a test script ``main.py`` that I run from the command line, so its module will be ``__main__`` - hence the ``__main__.filter_maker`` in the filter configuration. You will need to change that if you define it in a different module.
pt_br: Это преобразует переданный строковый аргумент в числовой уровень и возвращает функцию, которая возвращает ``True`` только в том случае, если уровень переданной записи находится на указанном уровне или ниже. Обратите внимание, что в этом примере я определил ``filter_maker`` в тестовом скрипте ``main.py``, который запускаю из командной строки, поэтому его модулем будет ``__main__`` - отсюда и ``__main__". filter_maker`` в конфигурации фильтра. Вам нужно будет изменить это, если вы определите его в другом модуле.

source: With the filter added, we can run ``main.py``, which in full is:
pt_br: Добавив фильтр, мы можем запустить ``main.py``, который полностью будет выглядеть так:

source: And after running it like this:
pt_br: И после запуска вот так:

source: We can see the results are as expected:
pt_br: Мы видим, что результаты соответствуют ожиданиям:

source: Configuration server example
pt_br: Приклад конфігурації сервера

source: Here is an example of a module using the logging configuration server::
pt_br: Ось приклад модуля, який використовує сервер конфігурації журналу:

source: And here is a script that takes a filename and sends that file to the server, properly preceded with the binary-encoded length, as the new logging configuration::
pt_br: А ось сценарій, який приймає ім’я файлу та надсилає цей файл на сервер, належним чином передуючи довжиною у двійковому кодуванні, як нову конфігурацію журналювання::

source: Dealing with handlers that block
pt_br: Робота з обробниками, які блокують

source: Sometimes you have to get your logging handlers to do their work without blocking the thread you're logging from. This is common in web applications, though of course it also occurs in other scenarios.
pt_br: Іноді вам потрібно змусити обробників журналу виконувати свою роботу, не блокуючи потік, з якого ви входите. Це поширене явище у веб-додатках, хоча, звичайно, трапляється й в інших сценаріях.

source: A common culprit which demonstrates sluggish behaviour is the :class:`SMTPHandler`: sending emails can take a long time, for a number of reasons outside the developer's control (for example, a poorly performing mail or network infrastructure). But almost any network-based handler can block: Even a :class:`SocketHandler` operation may do a DNS query under the hood which is too slow (and this query can be deep in the socket library code, below the Python layer, and outside your control).
pt_br: Поширеним винуватцем млявої поведінки є :class:`SMTPHandler`: надсилання електронних листів може тривати багато часу через ряд причин, які не залежать від розробника (наприклад, погана робота пошти чи мережевої інфраструктури). Але майже будь-який мережевий обробник може заблокувати: навіть операція :class:`SocketHandler` може виконати DNS-запит під капотом, який надто повільний (і цей запит може бути глибоко в коді бібліотеки сокетів, нижче рівня Python, і поза вашим контролем).

source: One solution is to use a two-part approach. For the first part, attach only a :class:`QueueHandler` to those loggers which are accessed from performance-critical threads. They simply write to their queue, which can be sized to a large enough capacity or initialized with no upper bound to their size. The write to the queue will typically be accepted quickly, though you will probably need to catch the :exc:`queue.Full` exception as a precaution in your code. If you are a library developer who has performance-critical threads in their code, be sure to document this (together with a suggestion to attach only ``QueueHandlers`` to your loggers) for the benefit of other developers who will use your code.
pt_br: Одним із рішень є використання підходу з двох частин. Для першої частини додайте лише :class:`QueueHandler` до тих реєстраторів, доступ до яких здійснюється з критичних для продуктивності потоків. Вони просто записують у свою чергу, розмір якої може бути достатньо великим або ініціалізований без верхньої межі їхнього розміру. Запис до черги, як правило, швидко приймається, хоча вам, ймовірно, потрібно буде перехопити виняток :exc:`queue.Full` як запобіжний захід у вашому коді. Якщо ви розробник бібліотеки, у коді якого є критично важливі для продуктивності потоки, обов’язково задокументуйте це (разом із пропозицією приєднати лише ``QueueHandlers`` до ваших реєстраторів) на користь інших розробників, які використовуватимуть ваш код.

source: The second part of the solution is :class:`QueueListener`, which has been designed as the counterpart to :class:`QueueHandler`. A :class:`QueueListener` is very simple: it's passed a queue and some handlers, and it fires up an internal thread which listens to its queue for LogRecords sent from ``QueueHandlers`` (or any other source of ``LogRecords``, for that matter). The ``LogRecords`` are removed from the queue and passed to the handlers for processing.
pt_br: Другою частиною рішення є :class:`QueueListener`, який був розроблений як відповідник :class:`QueueHandler`. :class:`QueueListener` дуже простий: він передає чергу та деякі обробники, і запускає внутрішній потік, який прослуховує свою чергу для LogRecords, надісланих з ``QueueHandlers`` (або будь-якого іншого джерела ``LogRecords``, як на те пішло). ``LogRecords`` видаляються з черги та передаються обробникам для обробки.

source: The advantage of having a separate :class:`QueueListener` class is that you can use the same instance to service multiple ``QueueHandlers``. This is more resource-friendly than, say, having threaded versions of the existing handler classes, which would eat up one thread per handler for no particular benefit.
pt_br: Перевага наявності окремого класу :class:`QueueListener` полягає в тому, що ви можете використовувати один екземпляр для обслуговування кількох ``QueueHandler``. Це більш дружньо до ресурсів, ніж, скажімо, мати багатопотокові версії існуючих класів обробників, які з’їдають один потік на обробник без особливої користі.

source: An example of using these two classes follows (imports omitted)::
pt_br: Нижче наведено приклад використання цих двох класів (імпорт опущено):

source: which, when run, will produce:
pt_br: який під час запуску вироблятиме:

source: Although the earlier discussion wasn't specifically talking about async code, but rather about slow logging handlers, it should be noted that when logging from async code, network and even file handlers could lead to problems (blocking the event loop) because some logging is done from :mod:`asyncio` internals. It might be best, if any async code is used in an application, to use the above approach for logging, so that any blocking code runs only in the ``QueueListener`` thread.
pt_br: Хотя в предыдущем обсуждении конкретно говорилось не об асинхронном коде, а скорее об обработчиках медленного журналирования, следует отметить, что при журналировании из асинхронного кода сетевые и даже файловые обработчики могут привести к проблемам (блокировке цикла событий), поскольку некоторые журналы сделано из внутренних компонентов :mod:`asyncio`. Если в приложении используется какой-либо асинхронный код, возможно, лучше всего использовать описанный выше подход для журналирования, чтобы любой код блокировки выполнялся только в потоке QueueListener.

source: Prior to Python 3.5, the :class:`QueueListener` always passed every message received from the queue to every handler it was initialized with. (This was because it was assumed that level filtering was all done on the other side, where the queue is filled.) From 3.5 onwards, this behaviour can be changed by passing a keyword argument ``respect_handler_level=True`` to the listener's constructor. When this is done, the listener compares the level of each message with the handler's level, and only passes a message to a handler if it's appropriate to do so.
pt_br: До Python 3.5 :class:`QueueListener` завжди передавав кожне повідомлення, отримане з черги, кожному обробнику, яким він був ініціалізований. (Це сталося тому, що передбачалося, що фільтрація рівня виконується з іншого боку, де заповнюється черга.) Починаючи з версії 3.5 і далі цю поведінку можна змінити, передавши аргумент ключового слова ``respect_handler_level=True`` конструктору слухача . Коли це зроблено, слухач порівнює рівень кожного повідомлення з рівнем обробника та передає повідомлення обробнику, лише якщо це доречно.

source: Sending and receiving logging events across a network
pt_br: Надсилання та отримання журнальних подій через мережу

source: Let's say you want to send logging events across a network, and handle them at the receiving end. A simple way of doing this is attaching a :class:`SocketHandler` instance to the root logger at the sending end::
pt_br: Припустімо, ви хочете надіслати події журналювання через мережу та обробити їх на приймаючому кінці. Простий спосіб зробити це — приєднати екземпляр :class:`SocketHandler` до кореневого реєстратора на стороні надсилання::

source: At the receiving end, you can set up a receiver using the :mod:`socketserver` module. Here is a basic working example::
pt_br: На стороні приймача ви можете налаштувати приймача за допомогою модуля :mod:`socketserver`. Ось базовий робочий приклад:
