Repository: python/python-docs-pt-br
Catalog: howto/logging-cookbook.po
Languages: pt_br

source: We initially set the logger's level to ``INFO``, so message #1 appears and message #2 doesn't. We then change the level to ``DEBUG`` temporarily in the following ``with`` block, and so message #3 appears. After the block exits, the logger's level is restored to ``INFO`` and so message #4 doesn't appear. In the next ``with`` block, we set the level to ``DEBUG`` again but also add a handler writing to ``sys.stdout``. Thus, message #5 appears twice on the console (once via ``stderr`` and once via ``stdout``). After the ``with`` statement's completion, the status is as it was before so message #6 appears (like message #1) whereas message #7 doesn't (just like message #2).
pt_br: Спочатку ми встановили рівень реєстратора на ``INFO``, тому повідомлення №1 з’являється, а повідомлення №2 ні. Потім ми тимчасово змінюємо рівень на ``DEBUG`` у наступному блоці ``with``, і тому з'являється повідомлення №3. Після виходу з блоку рівень реєстратора відновлюється до ``INFO``, тому повідомлення №4 не з’являється. У наступному блоці ``with`` ми знову встановлюємо рівень ``DEBUG``, але також додаємо запис обробника в ``sys.stdout``. Таким чином, повідомлення №5 з’являється двічі на консолі (один раз через ``stderr`` і один раз через ``stdout``). Після завершення оператора ``with`` статус залишається таким же, як і раніше, тому повідомлення №6 з’являється (як повідомлення №1), тоді як повідомлення №7 ні (так само, як повідомлення №2).

source: If we run the resulting script, the result is as follows:
pt_br: Якщо ми запустимо отриманий сценарій, результат буде таким:

source: If we run it again, but pipe ``stderr`` to ``/dev/null``, we see the following, which is the only message written to ``stdout``:
pt_br: Якщо ми запустимо його знову, але передаємо ``stderr`` до ``/dev/null``, ми побачимо наступне, яке є єдиним повідомленням, яке записується в ``stdout``:

source: Once again, but piping ``stdout`` to ``/dev/null``, we get:
pt_br: Ще раз, але передаючи ``stdout`` до ``/dev/null``, ми отримуємо:

source: In this case, the message #5 printed to ``stdout`` doesn't appear, as expected.
pt_br: У цьому випадку повідомлення №5, надруковане в ``stdout``, не з'являється, як очікувалося.

source: Of course, the approach described here can be generalised, for example to attach logging filters temporarily. Note that the above code works in Python 2 as well as Python 3.
pt_br: Звичайно, описаний тут підхід можна узагальнити, наприклад, тимчасово приєднати фільтри журналювання. Зверніть увагу, що наведений вище код працює як у Python 2, так і в Python 3.

source: A CLI application starter template
pt_br: Початковий шаблон програми CLI

source: Here's an example which shows how you can:
pt_br: Ось приклад, який показує, як можна:

source: Use a logging level based on command-line arguments
pt_br: Використовуйте рівень журналювання на основі аргументів командного рядка

source: Dispatch to multiple subcommands in separate files, all logging at the same level in a consistent way
pt_br: Відправлення до кількох підкоманд в окремих файлах, усі журнали на одному рівні узгоджено

source: Make use of simple, minimal configuration
pt_br: Використовуйте просту мінімальну конфігурацію

source: Suppose we have a command-line application whose job is to stop, start or restart some services. This could be organised for the purposes of illustration as a file ``app.py`` that is the main script for the application, with individual commands implemented in ``start.py``, ``stop.py`` and ``restart.py``. Suppose further that we want to control the verbosity of the application via a command-line argument, defaulting to ``logging.INFO``. Here's one way that ``app.py`` could be written::
pt_br: Припустімо, що у нас є програма командного рядка, завданням якої є зупинка, запуск або перезапуск деяких служб. Для ілюстрації це можна організувати як файл ``app.py``, який є основним сценарієм для програми, з окремими командами, реалізованими в ``start.py``, ``stop.py`` і ``restart.py``. Припустимо далі, що ми хочемо контролювати докладність програми за допомогою аргументу командного рядка, за замовчуванням ``logging.INFO``. Ось один із способів написання ``app.py``:

source: And the ``start``, ``stop`` and ``restart`` commands can be implemented in separate modules, like so for starting::
pt_br: А команди ``start``, ``stop`` і ``restart`` можна реалізувати в окремих модулях, наприклад, для запуску::

source: and thus for stopping::
pt_br: і, таким чином, для зупинки::

source: and similarly for restarting::
pt_br: і аналогічно для перезапуску::

source: If we run this application with the default log level, we get output like this:
pt_br: Якщо ми запустимо цю програму з рівнем журналу за замовчуванням, ми отримаємо такий результат:

source: The first word is the logging level, and the second word is the module or package name of the place where the event was logged.
pt_br: Перше слово — це рівень журналювання, а друге — ім’я модуля або пакета місця, де було зареєстровано подію.

source: If we change the logging level, then we can change the information sent to the log. For example, if we want more information:
pt_br: Якщо ми змінимо рівень журналювання, ми зможемо змінити інформацію, яка надсилається до журналу. Наприклад, якщо нам потрібна додаткова інформація:

source: And if we want less:
pt_br: А якщо ми хочемо менше:

source: In this case, the commands don't print anything to the console, since nothing at ``WARNING`` level or above is logged by them.
pt_br: У цьому випадку команди нічого не друкують на консолі, оскільки вони нічого не реєструють на рівні ``ПОПЕРЕДЖЕННЯ`` або вище.

source: A Qt GUI for logging
pt_br: Графічний інтерфейс Qt для журналювання

source: A question that comes up from time to time is about how to log to a GUI application. The `Qt <https://www.qt.io/>`_ framework is a popular cross-platform UI framework with Python bindings using :pypi:`PySide2` or :pypi:`PyQt5` libraries.
pt_br: Время от времени возникает вопрос о том, как войти в приложение с графическим интерфейсом. Фреймворк `Qt <https://www.qt.io/>`_ — это популярный кроссплатформенный фреймворк пользовательского интерфейса с привязками Python, использующими библиотеки :pypi:`PySide2` или :pypi:`PyQt5`.

source: The following example shows how to log to a Qt GUI. This introduces a simple ``QtHandler`` class which takes a callable, which should be a slot in the main thread that does GUI updates. A worker thread is also created to show how you can log to the GUI from both the UI itself (via a button for manual logging) as well as a worker thread doing work in the background (here, just logging messages at random levels with random short delays in between).
pt_br: У наступному прикладі показано, як увійти до Qt GUI. Це представляє простий клас ``QtHandler``, який приймає callable, який має бути слотом у головному потоці, який виконує оновлення GUI. Робочий потік також створюється, щоб показати, як ви можете входити в графічний інтерфейс як з самого інтерфейсу користувача (за допомогою кнопки для ручного журналювання), так і з робочого потоку, який виконує роботу у фоновому режимі (тут просто реєструє повідомлення на випадкових рівнях з довільним короткі затримки між ними).

source: The worker thread is implemented using Qt's ``QThread`` class rather than the :mod:`threading` module, as there are circumstances where one has to use ``QThread``, which offers better integration with other ``Qt`` components.
pt_br: Робочий потік реалізовано за допомогою класу ``QThread`` Qt, а не модуля :mod:`threading`, оскільки є обставини, коли потрібно використовувати ``QThread``, який забезпечує кращу інтеграцію з іншим ``Qt`` компоненти.

source: The code should work with recent releases of any of ``PySide6``, ``PyQt6``, ``PySide2`` or ``PyQt5``. You should be able to adapt the approach to earlier versions of Qt. Please refer to the comments in the code snippet for more detailed information.
pt_br: Код должен работать с последними выпусками любого из PySide6, PyQt6, PySide2 или PyQt5. Вы сможете адаптировать этот подход к более ранним версиям Qt. Для получения более подробной информации обратитесь к комментариям во фрагменте кода.

source: Logging to syslog with RFC5424 support
pt_br: Вхід до системного журналу з підтримкою RFC5424

source: Although :rfc:`5424` dates from 2009, most syslog servers are configured by default to use the older :rfc:`3164`, which hails from 2001. When ``logging`` was added to Python in 2003, it supported the earlier (and only existing) protocol at the time. Since RFC5424 came out, as there has not been widespread deployment of it in syslog servers, the :class:`~logging.handlers.SysLogHandler` functionality has not been updated.
pt_br: Хотя :rfc:`5424` датируется 2009 годом, большинство серверов системного журнала по умолчанию настроены на использование более старого :rfc:`3164`, который родом из 2001 года. Когда в 2003 году в Python было добавлено :rfc:`3164`, оно поддерживало более ранний (и единственный существовавший на тот момент) протокол. С момента выхода RFC5424, поскольку он не получил широкого распространения на серверах системного журнала, функциональность :class:`~logging.handlers.SysLogHandler` не обновлялась.

source: RFC 5424 contains some useful features such as support for structured data, and if you need to be able to log to a syslog server with support for it, you can do so with a subclassed handler which looks something like this::
pt_br: RFC 5424 містить деякі корисні функції, такі як підтримка структурованих даних, і якщо вам потрібно мати можливість увійти на сервер системного журналу з його підтримкою, ви можете зробити це за допомогою обробника підкласів, який виглядає приблизно так:

source: You'll need to be familiar with RFC 5424 to fully understand the above code, and it may be that you have slightly different needs (e.g. for how you pass structural data to the log). Nevertheless, the above should be adaptable to your speciric needs. With the above handler, you'd pass structured data using something like this::
pt_br: Вам потрібно буде ознайомитися з RFC 5424, щоб повністю зрозуміти наведений вище код, і можливо, у вас є дещо інші потреби (наприклад, щодо того, як ви передаєте структурні дані в журнал). Тим не менш, наведене вище має адаптуватися до ваших конкретних потреб. За допомогою наведеного вище обробника ви передаєте структуровані дані, використовуючи щось на зразок цього::

source: How to treat a logger like an output stream
pt_br: Как относиться к регистратору как к выходному потоку

source: Sometimes, you need to interface to a third-party API which expects a file-like object to write to, but you want to direct the API's output to a logger. You can do this using a class which wraps a logger with a file-like API. Here's a short script illustrating such a class:
pt_br: Иногда вам необходимо подключиться к стороннему API, который ожидает записи в файлоподобный объект, но вы хотите направить выходные данные API в регистратор. Вы можете сделать это, используя класс, который обертывает регистратор файловым API. Вот короткий скрипт, иллюстрирующий такой класс:

source: When this script is run, it prints
pt_br: Когда этот скрипт запускается, он печатает

source: INFO:demo:An INFO message DEBUG:demo:A DEBUG message
pt_br: INFO:demo:Информационное сообщение DEBUG:demo:Сообщение DEBUG

source: You could also use ``LoggerWriter`` to redirect ``sys.stdout`` and ``sys.stderr`` by doing something like this:
pt_br: Вы также можете использовать LoggerWriter для перенаправления sys.stdout и sys.stderr, выполнив что-то вроде этого:

source: You should do this *after* configuring logging for your needs. In the above example, the :func:`~logging.basicConfig` call does this (using the ``sys.stderr`` value *before* it is overwritten by a ``LoggerWriter`` instance). Then, you'd get this kind of result:
pt_br: Вы должны сделать это *после* настройки ведения журнала для своих нужд. В приведенном выше примере это делает вызов :func:`~logging.basicConfig` (используя значение ``sys.stderr`` *до* того, как оно будет перезаписано экземпляром ``LoggerWriter``). Тогда вы получите такой результат:

source: Of course, the examples above show output according to the format used by :func:`~logging.basicConfig`, but you can use a different formatter when you configure logging.
pt_br: Конечно, приведенные выше примеры показывают вывод в соответствии с форматом, используемым :func:`~logging.basicConfig`, но при настройке ведения журнала вы можете использовать другой форматтер.

source: Note that with the above scheme, you are somewhat at the mercy of buffering and the sequence of write calls which you are intercepting. For example, with the definition of ``LoggerWriter`` above, if you have the snippet
pt_br: Обратите внимание, что в приведенной выше схеме вы в некоторой степени зависите от буферизации и последовательности вызовов записи, которые вы перехватываете. Например, с определением ``LoggerWriter`` выше, если у вас есть фрагмент

source: then running the script results in
pt_br: затем запуск скрипта приводит к

source: As you can see, this output isn't ideal. That's because the underlying code which writes to ``sys.stderr`` makes multiple writes, each of which results in a separate logged line (for example, the last three lines above). To get around this problem, you need to buffer things and only output log lines when newlines are seen. Let's use a slightly better implementation of ``LoggerWriter``:
pt_br: Как видите, этот результат не идеален. Это связано с тем, что базовый код, который записывает в ``sys.stderr``, выполняет несколько операций записи, каждая из которых приводит к отдельной записываемой строке (например, последние три строки выше). Чтобы обойти эту проблему, вам нужно буферизовать данные и выводить строки журнала только при появлении новых строк. Давайте воспользуемся немного лучшей реализацией LoggerWriter:

source: This just buffers up stuff until a newline is seen, and then logs complete lines. With this approach, you get better output:
pt_br: Это просто буферизует данные до тех пор, пока не появится новая строка, а затем записывает полные строки. При таком подходе вы получите лучший результат:

source: Patterns to avoid
pt_br: Шаблони, яких слід уникати

source: Although the preceding sections have described ways of doing things you might need to do or deal with, it is worth mentioning some usage patterns which are *unhelpful*, and which should therefore be avoided in most cases. The following sections are in no particular order.
pt_br: Незважаючи на те, що в попередніх розділах описано способи виконання речей, які вам можуть знадобитися, варто згадати деякі шаблони використання, які є *некорисними* і яких у більшості випадків слід уникати. Наступні розділи не мають певного порядку.

source: Opening the same log file multiple times
pt_br: Відкриття одного файлу журналу кілька разів

source: On Windows, you will generally not be able to open the same file multiple times as this will lead to a "file is in use by another process" error. However, on POSIX platforms you'll not get any errors if you open the same file multiple times. This could be done accidentally, for example by:
pt_br: У Windows зазвичай ви не зможете відкрити один і той же файл кілька разів, оскільки це призведе до помилки "файл використовується іншим процесом". Однак на платформах POSIX ви не отримаєте жодних помилок, якщо відкриєте той самий файл кілька разів. Це може бути зроблено випадково, наприклад:

source: Adding a file handler more than once which references the same file (e.g. by a copy/paste/forget-to-change error).
pt_br: Додавання обробника файлів більше одного разу, який посилається на той самий файл (наприклад, через помилку копіювання/вставлення/забути змінити).

source: Opening two files that look different, as they have different names, but are the same because one is a symbolic link to the other.
pt_br: Відкриття двох файлів, які виглядають по-різному, оскільки мають різні назви, але однакові, оскільки один є символічним посиланням на інший.

source: Forking a process, following which both parent and child have a reference to the same file. This might be through use of the :mod:`multiprocessing` module, for example.
pt_br: Розгалуження процесу, після якого і батьківський, і дочірній елементи мають посилання на той самий файл. Це може бути, наприклад, через використання модуля :mod:`multiprocessing`.

source: Opening a file multiple times might *appear* to work most of the time, but can lead to a number of problems in practice:
pt_br: Багаторазове відкриття файлу може *видаватись* більшу частину часу ефективним, але на практиці це може призвести до ряду проблем:

source: Logging output can be garbled because multiple threads or processes try to write to the same file. Although logging guards against concurrent use of the same handler instance by multiple threads, there is no such protection if concurrent writes are attempted by two different threads using two different handler instances which happen to point to the same file.
pt_br: Вихід журналу може бути спотвореним, оскільки кілька потоків або процесів намагаються записати в той самий файл. Хоча журналювання захищає від одночасного використання одного екземпляра обробника кількома потоками, такого захисту немає, якщо одночасний запис намагаються виконати два різні потоки, використовуючи два різні екземпляри обробника, які випадково вказують на той самий файл.

source: An attempt to delete a file (e.g. during file rotation) silently fails, because there is another reference pointing to it. This can lead to confusion and wasted debugging time - log entries end up in unexpected places, or are lost altogether. Or a file that was supposed to be moved remains in place, and grows in size unexpectedly despite size-based rotation being supposedly in place.
pt_br: Попытка удалить файл (например, во время ротации файла) терпит неудачу, поскольку на него указывает другая ссылка. Это может привести к путанице и потере времени на отладку — записи журнала оказываются в неожиданных местах или вообще теряются. Или файл, который должен был быть перемещен, остается на месте и неожиданно увеличивается в размере, несмотря на предположительное вращение на основе размера.

source: Use the techniques outlined in :ref:`multiple-processes` to circumvent such issues.
pt_br: Використовуйте методи, описані в :ref:`multiple-processes`, щоб уникнути таких проблем.

source: Using loggers as attributes in a class or passing them as parameters
pt_br: Використання реєстраторів як атрибутів у класі або передача їх як параметрів

source: While there might be unusual cases where you'll need to do this, in general there is no point because loggers are singletons. Code can always access a given logger instance by name using ``logging.getLogger(name)``, so passing instances around and holding them as instance attributes is pointless. Note that in other languages such as Java and C#, loggers are often static class attributes. However, this pattern doesn't make sense in Python, where the module (and not the class) is the unit of software decomposition.
pt_br: Хоча можуть бути незвичайні випадки, коли вам знадобиться це зробити, загалом це не має сенсу, оскільки реєстратори є одиночними. Код завжди може отримати доступ до певного екземпляра реєстратора за назвою за допомогою ``logging.getLogger(name)``, тому передавати екземпляри та зберігати їх як атрибути екземпляра безглуздо. Зверніть увагу, що в інших мовах, таких як Java і C#, реєстратори часто є статичними атрибутами класу. Однак цей шаблон не має сенсу в Python, де модуль (а не клас) є одиницею декомпозиції програмного забезпечення.

source: Adding handlers other than :class:`~logging.NullHandler` to a logger in a library
pt_br: Добавление обработчиков, отличных от :class:`~logging.NullHandler`, в регистратор в библиотеке.

source: Configuring logging by adding handlers, formatters and filters is the responsibility of the application developer, not the library developer. If you are maintaining a library, ensure that you don't add handlers to any of your loggers other than a :class:`~logging.NullHandler` instance.
pt_br: Налаштування журналювання шляхом додавання обробників, засобів форматування та фільтрів є відповідальністю розробника програми, а не розробника бібліотеки. Якщо ви підтримуєте бібліотеку, переконайтеся, що ви не додаєте обробники до жодного з ваших журналів, крім екземпляра :class:`~logging.NullHandler`.

source: Creating a lot of loggers
pt_br: Створення великої кількості журналів

source: Loggers are singletons that are never freed during a script execution, and so creating lots of loggers will use up memory which can't then be freed. Rather than create a logger per e.g. file processed or network connection made, use the :ref:`existing mechanisms <context-info>` for passing contextual information into your logs and restrict the loggers created to those describing areas within your application (generally modules, but occasionally slightly more fine-grained than that).
pt_br: Реєстратори — це одиночні елементи, які ніколи не звільняються під час виконання сценарію, тому створення великої кількості реєстраторів буде використовувати пам’ять, яку потім не можна звільнити. Замість створення реєстратора, наприклад, оброблено файл або встановлено мережеве з’єднання, скористайтеся :ref:`існуючими механізмами <context-info>` для передачі контекстної інформації у ваші журнали та обмежте реєстратори, створені тими, що описують області у вашій програмі (зазвичай модулі, але іноді трохи більш дрібнозернисті, ніж це) .

source: Other resources
pt_br: Outros recursos

source: Module :mod:`logging`
pt_br: Módulo :mod:`logging`

source: API reference for the logging module.
pt_br: Referência da API para o módulo de logging.

source: Module :mod:`logging.config`
pt_br: Módulo :mod:`logging.config`

source: Configuration API for the logging module.
pt_br: API de configuração para o módulo logging.

source: Module :mod:`logging.handlers`
pt_br: Módulo :mod:`logging.handlers`

source: Useful handlers included with the logging module.
pt_br: Tratadores úteis incluídos no módulo logging.

source: :ref:`Basic Tutorial <logging-basic-tutorial>`
pt_br: :ref:`Tutorial básico <logging-basic-tutorial>`

source: :ref:`Advanced Tutorial <logging-advanced-tutorial>`
pt_br: :ref:`Tutorial avançado <logging-advanced-tutorial>`
