Repository: python/python-docs-pt-br
Catalog: howto/logging.po
Languages: pt_br

source: It is, of course, possible to log messages to different destinations. Support is included in the package for writing log messages to files, HTTP GET/POST locations, email via SMTP, generic sockets, queues, or OS-specific logging mechanisms such as syslog or the Windows NT event log. Destinations are served by :dfn:`handler` classes. You can create your own log destination class if you have special requirements not met by any of the built-in handler classes.
pt_br: Звичайно, можна записувати повідомлення до різних адресатів. У пакет включено підтримку для запису повідомлень журналу у файли, розташування HTTP GET/POST, електронну пошту через SMTP, загальні сокети, черги або специфічні для ОС механізми журналювання, такі як syslog або журнал подій Windows NT. Пункти призначення обслуговуються класами :dfn:`handler`. Ви можете створити власний клас призначення журналу, якщо у вас є особливі вимоги, яких не задовольняє жоден із вбудованих класів обробки.

source: By default, no destination is set for any logging messages. You can specify a destination (such as console or file) by using :func:`basicConfig` as in the tutorial examples. If you call the functions :func:`debug`, :func:`info`, :func:`warning`, :func:`error` and :func:`critical`, they will check to see if no destination is set; and if one is not set, they will set a destination of the console (``sys.stderr``) and a default format for the displayed message before delegating to the root logger to do the actual message output.
pt_br: За замовчуванням адресат не встановлено для будь-яких повідомлень журналу. Ви можете вказати призначення (наприклад, консоль або файл) за допомогою :func:`basicConfig`, як у прикладах підручника. Якщо ви викликаєте функції :func:`debug`, :func:`info`, :func:`warning`, :func:`error` і :func:`critical`, вони перевірять, чи не встановлено місце призначення ; і якщо його не встановлено, вони встановлять призначення консолі (``sys.stderr``) і формат за замовчуванням для відображеного повідомлення перед делегуванням кореневому реєстратору для фактичного виведення повідомлення.

source: The default format set by :func:`basicConfig` for messages is:
pt_br: O formato padrão definido por :func:`basicConfig` para mensagens é:

source: You can change this by passing a format string to :func:`basicConfig` with the *format* keyword argument. For all options regarding how a format string is constructed, see :ref:`formatter-objects`.
pt_br: Ви можете змінити це, передавши рядок формату в :func:`basicConfig` з ключовим аргументом *format*. Щоб дізнатися про всі варіанти створення рядка формату, перегляньте :ref:`formatter-objects`.

source: Logging Flow
pt_br: Fluxo de Logging

source: The flow of log event information in loggers and handlers is illustrated in the following diagram.
pt_br: O fluxo dos eventos de log em loggers e handlers é ilustrado no diagrama a seguir.

source: Loggers
pt_br: Registradores

source: :class:`Logger` objects have a threefold job. First, they expose several methods to application code so that applications can log messages at runtime. Second, logger objects determine which log messages to act upon based upon severity (the default filtering facility) or filter objects. Third, logger objects pass along relevant log messages to all interested log handlers.
pt_br: Об’єкти :class:`Logger` виконують потрійну роботу. По-перше, вони надають кілька методів коду програми, щоб програми могли реєструвати повідомлення під час виконання. По-друге, об’єкти реєстратора визначають, з якими повідомленнями журналу діяти, залежно від серйозності (засоби фільтрації за замовчуванням) або об’єктів фільтрації. По-третє, об’єкти журналу передають відповідні повідомлення журналу всім зацікавленим обробникам журналів.

source: The most widely used methods on logger objects fall into two categories: configuration and message sending.
pt_br: Os métodos mais usados em objetos logger se enquadram em duas categorias: configuração e envio de mensagem.

source: These are the most common configuration methods:
pt_br: Esses são os métodos de configuração mais comuns:

source: :meth:`Logger.setLevel` specifies the lowest-severity log message a logger will handle, where debug is the lowest built-in severity level and critical is the highest built-in severity. For example, if the severity level is INFO, the logger will handle only INFO, WARNING, ERROR, and CRITICAL messages and will ignore DEBUG messages.
pt_br: :meth:`Logger.setLevel` визначає повідомлення журналу з найнижчим рівнем серйозності, яке обробить реєстратор, де debug — найнижчий вбудований рівень серйозності, а критичний — найвищий вбудований рівень серйозності. Наприклад, якщо рівень серйозності INFO, реєстратор оброблятиме лише повідомлення INFO, WARNING, ERROR і CRITICAL і ігноруватиме повідомлення DEBUG.

source: :meth:`Logger.addHandler` and :meth:`Logger.removeHandler` add and remove handler objects from the logger object. Handlers are covered in more detail in :ref:`handler-basic`.
pt_br: :meth:`Logger.addHandler` і :meth:`Logger.removeHandler` додають і видаляють об’єкти обробки з об’єкта реєстратора. Обробники описані більш детально в :ref:`handler-basic`.

source: :meth:`Logger.addFilter` and :meth:`Logger.removeFilter` add and remove filter objects from the logger object. Filters are covered in more detail in :ref:`filter`.
pt_br: :meth:`Logger.addFilter` і :meth:`Logger.removeFilter` додають і видаляють об’єкти фільтрів з об’єкта реєстратора. Фільтри описані більш детально в :ref:`filter`.

source: You don't need to always call these methods on every logger you create. See the last two paragraphs in this section.
pt_br: Você não precisa sempre invocar esses métodos em cada logger que criar. Veja os últimos dois paragrafos nessa seção.

source: With the logger object configured, the following methods create log messages:
pt_br: Com o objeto logger configurado, os seguintes métodos criam mensagens de log:

source: :meth:`Logger.debug`, :meth:`Logger.info`, :meth:`Logger.warning`, :meth:`Logger.error`, and :meth:`Logger.critical` all create log records with a message and a level that corresponds to their respective method names. The message is actually a format string, which may contain the standard string substitution syntax of ``%s``, ``%d``, ``%f``, and so on. The rest of their arguments is a list of objects that correspond with the substitution fields in the message. With regard to ``**kwargs``, the logging methods care only about a keyword of ``exc_info`` and use it to determine whether to log exception information.
pt_br: :meth:`Logger.debug`, :meth:`Logger.info`, :meth:`Logger.warning`, :meth:`Logger.error` і :meth:`Logger.critical` створюють записи журналу з повідомлення та рівень, що відповідає їх відповідним назвам методів. Повідомлення фактично є рядком формату, який може містити стандартний синтаксис заміни рядка ``%s``, ``%d``, ``%f`` і так далі. Решта аргументів — це список об’єктів, які відповідають полям підстановки в повідомленні. Щодо ``**kwargs``, методи журналювання дбають лише про ключове слово ``exc_info`` і використовують його, щоб визначити, чи потрібно реєструвати інформацію про винятки.

source: :meth:`Logger.exception` creates a log message similar to :meth:`Logger.error`. The difference is that :meth:`Logger.exception` dumps a stack trace along with it. Call this method only from an exception handler.
pt_br: :meth:`Logger.exception` створює повідомлення журналу, подібне до :meth:`Logger.error`. Різниця полягає в тому, що :meth:`Logger.exception` виводить трасування стека разом із ним. Викликайте цей метод лише з обробника винятків.

source: :meth:`Logger.log` takes a log level as an explicit argument. This is a little more verbose for logging messages than using the log level convenience methods listed above, but this is how to log at custom log levels.
pt_br: :meth:`Logger.log` приймає рівень журналу як явний аргумент. Це трохи докладніше для реєстрації повідомлень, ніж використання зручних методів на рівні журналу, перелічених вище, але це те, як реєструвати на спеціальних рівнях журналу.

source: :func:`getLogger` returns a reference to a logger instance with the specified name if it is provided, or ``root`` if not. The names are period-separated hierarchical structures. Multiple calls to :func:`getLogger` with the same name will return a reference to the same logger object. Loggers that are further down in the hierarchical list are children of loggers higher up in the list. For example, given a logger with a name of ``foo``, loggers with names of ``foo.bar``, ``foo.bar.baz``, and ``foo.bam`` are all descendants of ``foo``.
pt_br: :func:`getLogger` повертає посилання на екземпляр журналу з указаним іменем, якщо воно надано, або ``root``, якщо ні. Назви є ієрархічними структурами, розділеними на періоди. Кілька викликів :func:`getLogger` з однаковою назвою повертатимуть посилання на той самий об’єкт журналу. Реєстратори, розташовані нижче в ієрархічному списку, є нащадками реєстраторів, розташованих вище в списку. Наприклад, якщо задано реєстратор із іменем ``foo``, усі реєстратори з іменами ``foo.bar``, ``foo.bar.baz`` і ``foo.bam`` є нащадками ``фу``.

source: Loggers have a concept of *effective level*. If a level is not explicitly set on a logger, the level of its parent is used instead as its effective level. If the parent has no explicit level set, *its* parent is examined, and so on - all ancestors are searched until an explicitly set level is found. The root logger always has an explicit level set (``WARNING`` by default). When deciding whether to process an event, the effective level of the logger is used to determine whether the event is passed to the logger's handlers.
pt_br: Лісоруби мають поняття *ефективного рівня*. Якщо рівень не встановлено явно в реєстраторі, рівень його батьківського елемента використовується замість цього як ефективний рівень. Якщо батьківський елемент не має явно встановленого рівня, перевіряється *його* батьківський елемент, і так далі - шукаються всі предки, доки не буде знайдено явно встановлений рівень. Кореневий реєстратор завжди має чітко встановлений рівень (``ПОПЕРЕДЖЕННЯ`` за замовчуванням). При прийнятті рішення про обробку події ефективний рівень реєстратора використовується для визначення того, чи подія передається обробникам реєстратора.

source: Child loggers propagate messages up to the handlers associated with their ancestor loggers. Because of this, it is unnecessary to define and configure handlers for all the loggers an application uses. It is sufficient to configure handlers for a top-level logger and create child loggers as needed. (You can, however, turn off propagation by setting the *propagate* attribute of a logger to ``False``.)
pt_br: Дочірні реєстратори поширюють повідомлення до обробників, пов’язаних із їхніми попередніми реєстраторами. Через це немає необхідності визначати та налаштовувати обробники для всіх реєстраторів, які використовує програма. Достатньо налаштувати обробники для реєстратора верхнього рівня та створити дочірні реєстратори за потреби. (Проте ви можете вимкнути розповсюдження, встановивши для атрибута *propagate* реєстратора значення ``False``.)

source: Handlers
pt_br: Manipuladores

source: :class:`~logging.Handler` objects are responsible for dispatching the appropriate log messages (based on the log messages' severity) to the handler's specified destination. :class:`Logger` objects can add zero or more handler objects to themselves with an :meth:`~Logger.addHandler` method. As an example scenario, an application may want to send all log messages to a log file, all log messages of error or higher to stdout, and all messages of critical to an email address. This scenario requires three individual handlers where each handler is responsible for sending messages of a specific severity to a specific location.
pt_br: Об’єкти :class:`~logging.Handler` відповідають за надсилання відповідних повідомлень журналу (залежно від серйозності повідомлень журналу) до вказаного призначення обробника. Об’єкти :class:`Logger` можуть додавати до себе нуль або більше об’єктів обробки за допомогою методу :meth:`~Logger.addHandler`. Як приклад сценарію, програма може захотіти надіслати всі повідомлення журналу до файлу журналу, усі повідомлення журналу про помилку або вище до stdout, а всі критичні повідомлення на адресу електронної пошти. Цей сценарій потребує трьох окремих обробників, де кожен обробник відповідає за надсилання повідомлень певного рівня серйозності в певне місце.

source: The standard library includes quite a few handler types (see :ref:`useful-handlers`); the tutorials use mainly :class:`StreamHandler` and :class:`FileHandler` in its examples.
pt_br: A biblioteca padrão possui alguns tipos de handler (veja :ref:`useful-handlers`); os tutoriais usam principalmente :class:`StreamHandler` e :class:`FileHandler` nos seus exemplos.

source: There are very few methods in a handler for application developers to concern themselves with. The only handler methods that seem relevant for application developers who are using the built-in handler objects (that is, not creating custom handlers) are the following configuration methods:
pt_br: У обробнику дуже мало методів, якими можуть зайнятися розробники програм. Єдиними методами обробки, які здаються актуальними для розробників додатків, які використовують вбудовані об’єкти обробки (тобто не створюють спеціальні обробники), є такі методи конфігурації:

source: The :meth:`~Handler.setLevel` method, just as in logger objects, specifies the lowest severity that will be dispatched to the appropriate destination. Why are there two :meth:`~Handler.setLevel` methods? The level set in the logger determines which severity of messages it will pass to its handlers. The level set in each handler determines which messages that handler will send on.
pt_br: Метод :meth:`~Handler.setLevel`, как и в объектах регистратора, определяет наименьшую серьезность, которая будет отправлена ​​в соответствующий пункт назначения. Почему существует два метода :meth:`~Handler.setLevel`? Уровень, установленный в средстве ведения журнала, определяет, какую серьезность сообщений он будет передавать своим обработчикам. Уровень, установленный в каждом обработчике, определяет, какие сообщения будет отправлять этот обработчик.

source: :meth:`~Handler.setFormatter` selects a Formatter object for this handler to use.
pt_br: :meth:`~Handler.setFormatter` вибирає об’єкт Formatter для використання цим обробником.

source: :meth:`~Handler.addFilter` and :meth:`~Handler.removeFilter` respectively configure and deconfigure filter objects on handlers.
pt_br: :meth:`~Handler.addFilter` і :meth:`~Handler.removeFilter` відповідно налаштовують і деконфігурують об’єкти фільтрів на обробниках.

source: Application code should not directly instantiate and use instances of :class:`Handler`. Instead, the :class:`Handler` class is a base class that defines the interface that all handlers should have and establishes some default behavior that child classes can use (or override).
pt_br: Код програми не повинен безпосередньо створювати та використовувати екземпляри :class:`Handler`. Натомість клас :class:`Handler` є базовим класом, який визначає інтерфейс, який повинні мати всі обробники, і встановлює певну поведінку за замовчуванням, яку дочірні класи можуть використовувати (або замінювати).

source: Formatters
pt_br: Formatadores

source: Formatter objects configure the final order, structure, and contents of the log message. Unlike the base :class:`logging.Handler` class, application code may instantiate formatter classes, although you could likely subclass the formatter if your application needs special behavior. The constructor takes three optional arguments -- a message format string, a date format string and a style indicator.
pt_br: Об’єкти форматувальника налаштовують остаточний порядок, структуру та вміст повідомлення журналу. На відміну від базового класу :class:`logging.Handler`, код програми може створювати екземпляри класів форматера, хоча ви, ймовірно, можете створити підкласи форматера, якщо ваша програма потребує особливої поведінки. Конструктор приймає три необов'язкові аргументи - рядок формату повідомлення, рядок формату дати та індикатор стилю.

source: If there is no message format string, the default is to use the raw message. If there is no date format string, the default date format is:
pt_br: Якщо рядок формату повідомлення відсутній, за умовчанням використовується необроблене повідомлення. Якщо рядок формату дати відсутній, стандартний формат дати:

source: with the milliseconds tacked on at the end. The ``style`` is one of ``'%'``, ``'{'``, or ``'$'``. If one of these is not specified, then ``'%'`` will be used.
pt_br: с добавлением миллисекунд в конце. ``стиль`` может быть одним из ``'%'``, ``'{'`` или ``'$'``. Если один из них не указан, будет использоваться ``'%'``.

source: If the ``style`` is ``'%'``, the message format string uses ``%(<dictionary key>)s`` styled string substitution; the possible keys are documented in :ref:`logrecord-attributes`. If the style is ``'{'``, the message format string is assumed to be compatible with :meth:`str.format` (using keyword arguments), while if the style is ``'$'`` then the message format string should conform to what is expected by :meth:`string.Template.substitute`.
pt_br: Если ``стиль`` равен ``'%'``, строка формата сообщения использует подстановку строки в стиле ``%(<ключ словаря>)s``; возможные ключи описаны в :ref:`logrecord-attributes`. Если стиль ``'{'``, предполагается, что строка формата сообщения совместима с :meth:`str.format` (с использованием аргументов ключевого слова), а если стиль ``'$'``, то Строка формата сообщения должна соответствовать ожидаемому :meth:`string.Template.substitute`.

source: Added the ``style`` parameter.
pt_br: Adicionado o parâmetro ``style``.

source: The following message format string will log the time in a human-readable format, the severity of the message, and the contents of the message, in that order::
pt_br: A string de formato a seguir vai escrever o tempo em um formato légivel para humanos, a severidade da mensagem, e o conteúdo da mensagem, nessa ordem::

source: Formatters use a user-configurable function to convert the creation time of a record to a tuple. By default, :func:`time.localtime` is used; to change this for a particular formatter instance, set the ``converter`` attribute of the instance to a function with the same signature as :func:`time.localtime` or :func:`time.gmtime`. To change it for all formatters, for example if you want all logging times to be shown in GMT, set the ``converter`` attribute in the Formatter class (to ``time.gmtime`` for GMT display).
pt_br: Форматери використовують настроювану користувачем функцію для перетворення часу створення запису в кортеж. За замовчуванням використовується :func:`time.localtime`; щоб змінити це для певного екземпляра форматера, установіть атрибут ``converter`` екземпляра на функцію з тим самим підписом, що й :func:`time.localtime` або :func:`time.gmtime`. Щоб змінити його для всіх засобів форматування, наприклад, якщо ви хочете, щоб усі часи журналювання відображалися за GMT, установіть атрибут ``converter`` у класі Formatter (на ``time.gmtime`` для відображення GMT).

source: Configuring Logging
pt_br: Configurando Logging

source: Programmers can configure logging in three ways:
pt_br: Programadores podem configurar logging de três formas:

source: Creating loggers, handlers, and formatters explicitly using Python code that calls the configuration methods listed above.
pt_br: Створення реєстраторів, обробників і форматувальників явно за допомогою коду Python, який викликає перелічені вище методи конфігурації.

source: Creating a logging config file and reading it using the :func:`fileConfig` function.
pt_br: Створення файлу конфігурації журналу та його читання за допомогою функції :func:`fileConfig`.

source: Creating a dictionary of configuration information and passing it to the :func:`dictConfig` function.
pt_br: Створення словника конфігураційної інформації та передача його функції :func:`dictConfig`.

source: For the reference documentation on the last two options, see :ref:`logging-config-api`. The following example configures a very simple logger, a console handler, and a simple formatter using Python code::
pt_br: Довідкову документацію щодо останніх двох параметрів див. :ref:`logging-config-api`. У наступному прикладі налаштовується дуже простий реєстратор, обробник консолі та простий засіб форматування за допомогою коду Python::

source: Running this module from the command line produces the following output:
pt_br: Запуск цього модуля з командного рядка дає такий результат:

source: The following Python module creates a logger, handler, and formatter nearly identical to those in the example listed above, with the only difference being the names of the objects::
pt_br: Наступний модуль Python створює реєстратор, обробник і форматування, майже ідентичні тим, що в наведеному вище прикладі, з тією лише різницею, як імена об’єктів:

source: Here is the logging.conf file:
pt_br: Aqui está o arquivo logging.conf:

source: The output is nearly identical to that of the non-config-file-based example:
pt_br: Результат майже ідентичний прикладу без конфігураційного файлу:

source: You can see that the config file approach has a few advantages over the Python code approach, mainly separation of configuration and code and the ability of noncoders to easily modify the logging properties.
pt_br: Ви бачите, що підхід із конфігураційним файлом має кілька переваг перед підходом до коду Python, головним чином розділення конфігурації та коду та можливість некодерів легко змінювати властивості журналювання.

source: The :func:`fileConfig` function takes a default parameter, ``disable_existing_loggers``, which defaults to ``True`` for reasons of backward compatibility. This may or may not be what you want, since it will cause any non-root loggers existing before the :func:`fileConfig` call to be disabled unless they (or an ancestor) are explicitly named in the configuration. Please refer to the reference documentation for more information, and specify ``False`` for this parameter if you wish.
pt_br: Функція :func:`fileConfig` приймає параметр за замовчуванням, ``disable_existing_loggers``, який за умовчанням має значення ``True`` з причин зворотної сумісності. Це може бути або не те, що ви хочете, оскільки це призведе до вимкнення будь-яких некореневих реєстраторів, які існують до виклику :func:`fileConfig`, якщо вони (або предок) явно не вказані в конфігурації. Будь ласка, зверніться до довідкової документації для отримання додаткової інформації та вкажіть ``False`` для цього параметра, якщо хочете.

source: The dictionary passed to :func:`dictConfig` can also specify a Boolean value with key ``disable_existing_loggers``, which if not specified explicitly in the dictionary also defaults to being interpreted as ``True``. This leads to the logger-disabling behaviour described above, which may not be what you want - in which case, provide the key explicitly with a value of ``False``.
pt_br: Словник, переданий у :func:`dictConfig`, також може вказати логічне значення з ключем ``disable_existing_loggers``, яке, якщо не вказано явно в словнику, також за умовчанням інтерпретується як ``True``. Це призводить до поведінки вимкнення реєстратора, описаної вище, яка може не відповідати вашим побажанням - у такому випадку вкажіть ключ явно зі значенням ``False``.
