Repository: python/python-docs-pt-br
Catalog: howto/mro.po
Languages: pt_br

source: The Python 2.3 Method Resolution Order
pt_br: A Ordem de Resolução de Métodos do Python 2.3

source: This is a historical document, provided as an appendix to the official documentation. The Method Resolution Order discussed here was *introduced* in Python 2.3, but it is still used in later versions -- including Python 3.
pt_br: Este é um documento histórico, fornecido como apêndice à documentação oficial. A ordem de resolução de métodos discutida aqui foi *introduzida* no Python 2.3, mas ainda é usada em versões posteriores -- incluindo o Python 3.

source: By `Michele Simionato <https://www.phyast.pitt.edu/~micheles/>`__.
pt_br: por `Michele Simionato <https://www.phyast.pitt.edu/~micheles/>`__.

source: Abstract
pt_br: Resumo

source: *This document is intended for Python programmers who want to understand the C3 Method Resolution Order used in Python 2.3. Although it is not intended for newbies, it is quite pedagogical with many worked out examples. I am not aware of other publicly available documents with the same scope, therefore it should be useful.*
pt_br: *Este documento é destinado a programadores Python que desejam entender a ordem de resolução de métodos C3 usada no Python 2.3. Embora não seja destinado a iniciantes, é bastante pedagógico com muitos exemplos elaborados. Não tenho conhecimento de outros documentos publicamente disponíveis com o mesmo escopo, portanto devem ser úteis.*

source: Disclaimer:
pt_br: Aviso:

source: *I donate this document to the Python Software Foundation, under the Python 2.3 license. As usual in these circumstances, I warn the reader that what follows* should *be correct, but I don't give any warranty. Use it at your own risk and peril!*
pt_br: *Eu doo este documento para a Python Software Foundation, sob a licença Python 2.3. Como de costume nestas circunstâncias, aviso o leitor que o que se segue* deve *estar correto, mas não dou nenhuma garantia. Use-o por sua própria conta e risco!*

source: Acknowledgments:
pt_br: Reconhecimentos:

source: *All the people of the Python mailing list who sent me their support. Paul Foley who pointed out various imprecisions and made me to add the part on local precedence ordering. David Goodger for help with the formatting in reStructuredText. David Mertz for help with the editing. Finally, Guido van Rossum who enthusiastically added this document to the official Python 2.3 home-page.*
pt_br: *Todas as pessoas da lista de discussão do Python que me enviaram seu apoio. Paul Foley, que apontou várias imprecisões e me fez acrescentar a parte sobre ordem de precedência local. David Goodger pela ajuda com a formatação em reStructuredText. David Mertz pela ajuda com a edição. Finalmente, Guido van Rossum que adicionou com entusiasmo este documento à página inicial oficial do Python 2.3.*

source: The beginning
pt_br: O início

source: Everything started with a post by Samuele Pedroni to the Python development mailing list [#]_. In his post, Samuele showed that the Python 2.2 method resolution order is not monotonic and he proposed to replace it with the C3 method resolution order. Guido agreed with his arguments and therefore now Python 2.3 uses C3. The C3 method itself has nothing to do with Python, since it was invented by people working on Dylan and it is described in a paper intended for lispers [#]_. The present paper gives a (hopefully) readable discussion of the C3 algorithm for Pythonistas who want to understand the reasons for the change.
pt_br: Tudo começou com uma postagem de Samuele Pedroni na lista de discussão de desenvolvimento Python [#]_. Em sua postagem, Samuele mostrou que a ordem de resolução de métodos do Python 2.2 não é monotônica e propôs substituí-la pela ordem de resolução de métodos C3. Guido concordou com seus argumentos e, portanto, agora o Python 2.3 usa C3. O método C3 em si não tem nada a ver com Python, pois foi inventado por pessoas que trabalharam em Dylan e está descrito em um artigo destinado a lispers [#]_. O presente artigo fornece uma discussão (espero) legível do algoritmo C3 para Pythonistas que desejam entender os motivos da mudança.

source: First of all, let me point out that what I am going to say only applies to the *new style classes* introduced in Python 2.2: *classic classes* maintain their old method resolution order, depth first and then left to right. Therefore, there is no breaking of old code for classic classes; and even if in principle there could be breaking of code for Python 2.2 new style classes, in practice the cases in which the C3 resolution order differs from the Python 2.2 method resolution order are so rare that no real breaking of code is expected. Therefore:
pt_br: Primeiro de tudo, deixe-me salientar que o que vou dizer se aplica apenas às *classes no novo estilo* introduzidas no Python 2.2: *classes clássicas* mantêm sua antiga ordem de resolução de métodos, profundidade primeiro e depois da esquerda para a direita. Portanto, não há quebra de código antigo para classes clássicas; e mesmo que em princípio pudesse haver quebra de código para novas classes de estilo do Python 2.2, na prática os casos em que a ordem de resolução C3 difere da ordem de resolução de métodos do Python 2.2 são tão raros que nenhuma quebra real de código é esperada. Portanto:

source: *Don't be scared!*
pt_br: *Não tenha medo!*

source: Moreover, unless you make strong use of multiple inheritance and you have non-trivial hierarchies, you don't need to understand the C3 algorithm, and you can easily skip this paper. On the other hand, if you really want to know how multiple inheritance works, then this paper is for you. The good news is that things are not as complicated as you might expect.
pt_br: Além disso, a menos que você faça uso intenso de herança múltipla e tenha hierarquias não triviais, você não precisa entender o algoritmo C3 e pode facilmente pular este artigo. Por outro lado, se você realmente deseja saber como funciona a herança múltipla, este artigo é para você. A boa notícia é que as coisas não são tão complicadas quanto você imagina.

source: Let me begin with some basic definitions.
pt_br: Deixe-me começar com algumas definições básicas.

source: Given a class C in a complicated multiple inheritance hierarchy, it is a non-trivial task to specify the order in which methods are overridden, i.e. to specify the order of the ancestors of C.
pt_br: Dada uma classe C em uma complicada hierarquia de herança múltipla, não é uma tarefa trivial especificar a ordem na qual os métodos são substituídos, ou seja, especificar a ordem dos ancestrais de C.

source: The list of the ancestors of a class C, including the class itself, ordered from the nearest ancestor to the furthest, is called the class precedence list or the *linearization* of C.
pt_br: A lista dos ancestrais de uma classe C, incluindo a própria classe, ordenada do ancestral mais próximo ao mais distante, é chamada de lista de precedência de classe ou *linearização* de C.

source: The *Method Resolution Order* (MRO) is the set of rules that construct the linearization. In the Python literature, the idiom "the MRO of C" is also used as a synonymous for the linearization of the class C.
pt_br: A *Ordem de Resolução de Métodos* (em inglês Method Resolution Order, MRO) é o conjunto de regras que constroem a linearização. Na literatura Python, a expressão "a MRO de C" também é usada como sinônimo de linearização da classe C.

source: For instance, in the case of single inheritance hierarchy, if C is a subclass of C1, and C1 is a subclass of C2, then the linearization of C is simply the list [C, C1 , C2]. However, with multiple inheritance hierarchies, the construction of the linearization is more cumbersome, since it is more difficult to construct a linearization that respects *local precedence ordering* and *monotonicity*.
pt_br: Por exemplo, no caso de hierarquia de herança única, se C é uma subclasse de C1 e C1 é uma subclasse de C2, então a linearização de C é simplesmente a lista [C, C1, C2]. No entanto, com múltiplas hierarquias de herança, a construção da linearização é mais complicada, pois é mais difícil construir uma linearização que respeite a *ordem de precedência local* e a *monotonicidade*.

source: I will discuss the local precedence ordering later, but I can give the definition of monotonicity here. A MRO is monotonic when the following is true: *if C1 precedes C2 in the linearization of C, then C1 precedes C2 in the linearization of any subclass of C*. Otherwise, the innocuous operation of deriving a new class could change the resolution order of methods, potentially introducing very subtle bugs. Examples where this happens will be shown later.
pt_br: Discutirei a ordem de precedência local mais tarde, mas posso dar aqui a definição de monotonicidade. Uma MRO é monotônico quando o seguinte é verdadeiro: *se C1 precede C2 na linearização de C, então C1 precede C2 na linearização de qualquer subclasse de C*. Caso contrário, a operação inócua de derivar uma nova classe poderia alterar a ordem de resolução dos métodos, potencialmente introduzindo bugs muito sutis. Exemplos onde isso acontece serão mostrados posteriormente.

source: Not all classes admit a linearization. There are cases, in complicated hierarchies, where it is not possible to derive a class such that its linearization respects all the desired properties.
pt_br: Nem todas as classes admitem uma linearização. Existem casos, em hierarquias complicadas, em que não é possível derivar uma classe tal que a sua linearização respeite todas as propriedades desejadas.

source: Here I give an example of this situation. Consider the hierarchy
pt_br: Aqui dou um exemplo desta situação. Considere a hierarquia

source: which can be represented with the following inheritance graph, where I have denoted with O the ``object`` class, which is the beginning of any hierarchy for new style classes:
pt_br: que pode ser representada com o seguinte grafo de herança, onde denotamos com O a classe ``object``, que é o início de qualquer hierarquia para classes de novo estilo:

source: In this case, it is not possible to derive a new class C from A and B, since X precedes Y in A, but Y precedes X in B, therefore the method resolution order would be ambiguous in C.
pt_br: Neste caso, não é possível derivar uma nova classe C de A e B, pois X precede Y em A, mas Y precede X em B, portanto a ordem de resolução de métodos seria ambígua em C.

source: Python 2.3 raises an exception in this situation (TypeError: MRO conflict among bases Y, X) forbidding the naive programmer from creating ambiguous hierarchies. Python 2.2 instead does not raise an exception, but chooses an *ad hoc* ordering (CABXYO in this case).
pt_br: Python 2.3 levanta uma exceção nesta situação (TypeError: MRO conflict among bases Y, X) proibindo o programador ingênuo de criar hierarquias ambíguas. Em vez disso, o Python 2.2 não levanta uma exceção, mas escolhe uma ordem *ad hoc* (CABXYO neste caso).

source: The C3 Method Resolution Order
pt_br: A ordem de resolução de métodos C3

source: Let me introduce a few simple notations which will be useful for the following discussion. I will use the shortcut notation::
pt_br: Deixe-me apresentar algumas notações simples que serão úteis para a discussão a seguir. Usarei a notação de atalho::

source: to indicate the list of classes [C1, C2, ... , CN].
pt_br: para indicar a lista de classes [C1, C2, ... , CN].

source: The *head* of the list is its first element::
pt_br: *head* da lista é o seu primeiro elemento::

source: whereas the *tail* is the rest of the list::
pt_br: enquanto *tail* é o resto da lista::

source: I shall also use the notation::
pt_br: Também usarei a notação::

source: to denote the sum of the lists [C] + [C1, C2, ... ,CN].
pt_br: para denotar a soma das listas [C] + [C1, C2, ..., CN].

source: Now I can explain how the MRO works in Python 2.3.
pt_br: Agora posso explicar como funciona a MRO no Python 2.3.

source: Consider a class C in a multiple inheritance hierarchy, with C inheriting from the base classes B1, B2, ... , BN. We want to compute the linearization L[C] of the class C. The rule is the following:
pt_br: Considere uma classe C em uma hierarquia de herança múltipla, com C herdando das classes base B1, B2, ..., BN. Queremos calcular a linearização L[C] da classe C. A regra é a seguinte:

source: *the linearization of C is the sum of C plus the merge of the linearizations of the parents and the list of the parents.*
pt_br: *a linearização de C é a soma de C mais a mesclagem das linearizações dos pais e da lista dos pais.*

source: In symbolic notation::
pt_br: Em notação simbólica::

source: In particular, if C is the ``object`` class, which has no parents, the linearization is trivial::
pt_br: Em particular, se C é a classe ``object``, que não tem pais, a linearização é trivial::

source: However, in general one has to compute the merge according to the following prescription:
pt_br: Contudo, em geral, deve-se calcular a mesclagem de acordo com a seguinte prescrição:

source: *take the head of the first list, i.e L[B1][0]; if this head is not in the tail of any of the other lists, then add it to the linearization of C and remove it from the lists in the merge, otherwise look at the head of the next list and take it, if it is a good head. Then repeat the operation until all the class are removed or it is impossible to find good heads. In this case, it is impossible to construct the merge, Python 2.3 will refuse to create the class C and will raise an exception.*
pt_br: *considere o topo da primeira lista, ou seja, L[B1][0]; se esse head não estiver no final de nenhuma das outras listas, então adicione-o à linearização de C e remova-o das listas na mesclagem, caso contrário olhe para o head da próxima lista e pegue-o, se for um bom head. Em seguida, repita a operação até que todas as classes sejam removidas ou seja impossível encontrar boas cabeças. Neste caso, é impossível construir a mesclagem, o Python 2.3 se recusará a criar a classe C e vai levantar uma exceção.*

source: This prescription ensures that the merge operation *preserves* the ordering, if the ordering can be preserved. On the other hand, if the order cannot be preserved (as in the example of serious order disagreement discussed above) then the merge cannot be computed.
pt_br: Esta prescrição garante que a operação de mesclagem *preserva* a ordem, se a ordem puder ser preservada. Por outro lado, se a ordem não puder ser preservada (como no exemplo de desacordo sério sobre ordem discutido acima), então a mesclagem não poderá ser calculada.

source: The computation of the merge is trivial if C has only one parent (single inheritance); in this case::
pt_br: O cálculo da mesclagem é trivial se C tiver apenas um pai (herança única); nesse caso::

source: However, in the case of multiple inheritance things are more cumbersome and I don't expect you can understand the rule without a couple of examples ;-)
pt_br: No entanto, no caso de herança múltipla, as coisas são mais complicadas e não espero que você consiga entender a regra sem alguns exemplos ;-)

source: Examples
pt_br: Exemplos

source: First example. Consider the following hierarchy:
pt_br: Primeiro exemplo. Considere a seguinte hierarquia:

source: In this case the inheritance graph can be drawn as:
pt_br: Neste caso, o grafo de herança pode ser desenhado como:

source: 6 --- Level 3 | O | (more general) / --- \ / | \ | / | \ | / | \ | --- --- --- | Level 2 3 | D | 4| E | | F | 5 | --- --- --- | \ \ _ / | | \ / \ _ | | \ / \ | | --- --- | Level 1 1 | B | | C | 2 | --- --- | \ / | \ / \ / --- Level 0 0 | A | (more specialized) ---
pt_br: 6 --- Nível 3 | O | (mais geral) / --- \ / | \ | / | \ | / | \ | --- --- --- | Nível 2 3 | D | 4| E | | F | 5 | --- --- --- | \ \ _ / | | \ / \ _ | | \ / \ | | --- --- | Nível 1 1 | B | | C | 2 | --- --- | \ / | \ / \ / --- Nível 0 0 | A | (mais especializada) ---

source: The linearizations of O,D,E and F are trivial::
pt_br: As linearizações de O,D,E e F são triviais::

source: The linearization of B can be computed as::
pt_br: A linearização de B pode ser calculada como::

source: We see that D is a good head, therefore we take it and we are reduced to compute ``merge(O,EO,E)``. Now O is not a good head, since it is in the tail of the sequence EO. In this case the rule says that we have to skip to the next sequence. Then we see that E is a good head; we take it and we are reduced to compute ``merge(O,O)`` which gives O. Therefore::
pt_br: Vemos que D é um bom *head*, portanto pegamos ele e ficamos reduzidos a calcular ``merge(O,EO,E)``. Agora O não é um bom *head*, pois está no *tail* da sequência EO. Neste caso a regra diz que temos que pular para a próxima sequência. Então vemos que E é um bom *head*; nós pegamos isso e somos reduzidos a calcular ``merge(O,O)`` que dá O. Portanto::

source: Using the same procedure one finds::
pt_br: Usando o mesmo procedimento encontra-se::

source: Now we can compute::
pt_br: Agora podemos calcular::

source: In this example, the linearization is ordered in a pretty nice way according to the inheritance level, in the sense that lower levels (i.e. more specialized classes) have higher precedence (see the inheritance graph). However, this is not the general case.
pt_br: Neste exemplo, a linearização é ordenada de maneira bastante agradável de acordo com o nível de herança, no sentido de que níveis mais baixos (ou seja, classes mais especializadas) têm precedência mais alta (veja o grafo de herança). No entanto, este não é o caso geral.

source: I leave as an exercise for the reader to compute the linearization for my second example:
pt_br: Deixo como exercício para o leitor calcular a linearização do meu segundo exemplo:

source: The only difference with the previous example is the change B(D,E) --> B(E,D); however even such a little modification completely changes the ordering of the hierarchy:
pt_br: A única diferença com o exemplo anterior é a mudança B(D,E) --> B(E,D); no entanto, mesmo uma pequena modificação muda completamente a ordem da hierarquia:

source: 6 --- Level 3 | O | / --- \ / | \ / | \ / | \ --- --- --- Level 2 2 | E | 4 | D | | F | 5 --- --- --- \ / \ / \ / \ / \ / \ / --- --- Level 1 1 | B | | C | 3 --- --- \ / \ / --- Level 0 0 | A | ---
pt_br: 6 --- Nível 3 | O | / --- \ / | \ / | \ / | \ --- --- --- Nível 2 2 | E | 4 | D | | F | 5 --- --- --- \ / \ / \ / \ / \ / \ / --- --- Nível 1 1 | B | | C | 3 --- --- \ / \ / --- Nível 0 0 | A | ---

source: Notice that the class E, which is in the second level of the hierarchy, precedes the class C, which is in the first level of the hierarchy, i.e. E is more specialized than C, even if it is in a higher level.
pt_br: Observe que a classe E, que está no segundo nível da hierarquia, precede a classe C, que está no primeiro nível da hierarquia, ou seja, E é mais especializado que C, mesmo que esteja em um nível mais alto.

source: A lazy programmer can obtain the MRO directly from Python 2.2, since in this case it coincides with the Python 2.3 linearization. It is enough to invoke the :meth:`~type.mro` method of class A:
pt_br: Um programador preguiçoso pode obter a MRO diretamente do Python 2.2, pois neste caso ela coincide com a linearização do Python 2.3. Basta invocar o método :meth:`~type.mro` da classe A:

source: Finally, let me consider the example discussed in the first section, involving a serious order disagreement. In this case, it is straightforward to compute the linearizations of O, X, Y, A and B:
pt_br: Finalmente, deixe-me considerar o exemplo discutido na primeira seção, envolvendo um sério desacordo de ordem. Neste caso, é simples calcular as linearizações de O, X, Y, A e B:

source: However, it is impossible to compute the linearization for a class C that inherits from A and B::
pt_br: Porém, é impossível calcular a linearização para uma classe C que herda de A e B::

source: At this point we cannot merge the lists XYO and YXO, since X is in the tail of YXO whereas Y is in the tail of XYO: therefore there are no good heads and the C3 algorithm stops. Python 2.3 raises an error and refuses to create the class C.
pt_br: Neste ponto não podemos mesclar as listas XYO e YXO, uma vez que X está no *tail* de YXO enquanto Y está no *tail* de XYO: portanto não há bons *head* e o algoritmo C3 para. Python 2.3 levanta um erro e se recusa a criar a classe C.

source: Bad Method Resolution Orders
pt_br: Ordens de resolução de métodos ruins

source: A MRO is *bad* when it breaks such fundamental properties as local precedence ordering and monotonicity. In this section, I will show that both the MRO for classic classes and the MRO for new style classes in Python 2.2 are bad.
pt_br: Uma MRO é *ruim* quando quebra propriedades fundamentais como ordem de precedência local e monotonicidade. Nesta seção, mostrarei que tanto a MRO para classes clássicas quanto a MRO para classes de novo estilo em Python 2.2 são ruins.

source: It is easier to start with the local precedence ordering. Consider the following example:
pt_br: É mais fácil começar com a ordem de precedência local. Considere o seguinte exemplo:

source: with inheritance diagram
pt_br: com diagrama de herança

source: O | (buy spam) F | \ | E (buy eggs) | / G (buy eggs or spam ?)
pt_br: O | (comprar spam) F | \ | E (comprar ovos) | / G (comprar ovos ou spam ?)

source: We see that class G inherits from F and E, with F *before* E: therefore we would expect the attribute *G.remember2buy* to be inherited by *F.remember2buy* and not by *E.remember2buy*: nevertheless Python 2.2 gives
pt_br: Vemos que a classe G herda de F e E, com F *antes* de E: portanto, esperaríamos que o atributo *G.remember2buy* fosse herdado por *F.remember2buy* e não por *E.remember2buy*: no entanto, Python 2.2 dá

source: This is a breaking of local precedence ordering since the order in the local precedence list, i.e. the list of the parents of G, is not preserved in the Python 2.2 linearization of G::
pt_br: Isto é uma quebra da ordem de precedência local, uma vez que a ordem na lista de precedência local, ou seja, a lista dos pais de G, não é preservada na linearização de G em Python 2.2::

source: L[G,P22]= G E F object # F *follows* E
pt_br: L[G,P22]= G E F object # F *segue* E

source: One could argue that the reason why F follows E in the Python 2.2 linearization is that F is less specialized than E, since F is the superclass of E; nevertheless the breaking of local precedence ordering is quite non-intuitive and error prone. This is particularly true since it is a different from old style classes:
pt_br: Pode-se argumentar que a razão pela qual F segue E na linearização do Python 2.2 é que F é menos especializado que E, uma vez que F é a superclasse de E; no entanto, a quebra da ordem de precedência local é bastante não intuitiva e sujeita a erros. Isto é particularmente verdadeiro porque é diferente das classes de estilo antigo:

source: In this case the MRO is GFEF and the local precedence ordering is preserved.
pt_br: Neste caso a MRO é GFEF e a ordem de precedência local é preservada.

source: As a general rule, hierarchies such as the previous one should be avoided, since it is unclear if F should override E or vice-versa. Python 2.3 solves the ambiguity by raising an exception in the creation of class G, effectively stopping the programmer from generating ambiguous hierarchies. The reason for that is that the C3 algorithm fails when the merge::
pt_br: Como regra geral, hierarquias como a anterior devem ser evitadas, uma vez que não está claro se F deve substituir E ou vice-versa. O Python 2.3 resolve a ambiguidade levantando uma exceção na criação da classe G, impedindo efetivamente o programador de gerar hierarquias ambíguas. A razão para isso é que o algoritmo C3 falha quando a mesclagem::
