Repository: python/python-docs-pt-br
Catalog: howto/perf_profiling.po
Languages: pt_br

source: Python support for the Linux ``perf`` profiler
pt_br: Suporte do Python ao perfilador ``perf`` do Linux

source: author
pt_br: autor

source: `The Linux perf profiler <https://perf.wiki.kernel.org>`_ is a very powerful tool that allows you to profile and obtain information about the performance of your application. ``perf`` also has a very vibrant ecosystem of tools that aid with the analysis of the data that it produces.
pt_br: `O perfilador perf do Linux <https://perf.wiki.kernel.org>`_ é uma ferramenta muito poderosa que permite criar perfis e obter informações sobre o desempenho da sua aplicação. ``perf`` também possui um ecossistema muito vibrante de ferramentas que auxiliam na análise dos dados que produz.

source: The main problem with using the ``perf`` profiler with Python applications is that ``perf`` only gets information about native symbols, that is, the names of functions and procedures written in C. This means that the names and file names of Python functions in your code will not appear in the output of ``perf``.
pt_br: O principal problema de usar o perfilador ``perf`` com aplicações Python é que ``perf`` apenas obtém informações sobre símbolos nativos, ou seja, os nomes de funções e procedimentos escritos em C. Isso significa que os nomes de funções Python e seus nomes de arquivos em seu código não aparecerão na saída de ``perf``.

source: Since Python 3.12, the interpreter can run in a special mode that allows Python functions to appear in the output of the ``perf`` profiler. When this mode is enabled, the interpreter will interpose a small piece of code compiled on the fly before the execution of every Python function and it will teach ``perf`` the relationship between this piece of code and the associated Python function using :doc:`perf map files <../c-api/perfmaps>`.
pt_br: Desde o Python 3.12, o interpretador pode ser executado em um modo especial que permite que funções do Python apareçam na saída do criador de perfilador ``perf``. Quando este modo está habilitado, o interpretador interporá um pequeno pedaço de código compilado instantaneamente antes da execução de cada função Python e ensinará ``perf`` a relação entre este pedaço de código e a função Python associada usando :doc:`arquivos de mapa perf <../c-api/perfmaps>`.

source: Support for the ``perf`` profiler is currently only available for Linux on select architectures. Check the output of the ``configure`` build step or check the output of ``python -m sysconfig | grep HAVE_PERF_TRAMPOLINE`` to see if your system is supported.
pt_br: O suporte para o perfilador ``perf`` está atualmente disponível apenas para Linux em arquiteturas selecionadas. Verifique a saída da etapa de construção ``configure`` ou verifique a saída de ``python -m sysconfig | grep HAVE_PERF_TRAMPOLINE`` para ver se o seu sistema é compatível.

source: For example, consider the following script:
pt_br: Por exemplo, considere o seguinte script:

source: We can run ``perf`` to sample CPU stack traces at 9999 hertz::
pt_br: Podemos executar ``perf`` para obter amostras de rastreamentos de pilha da CPU em 9999 hertz::

source: $ perf record -F 9999 -g -o perf.data python my_script.py
pt_br: $ perf record -F 9999 -g -o perf.data python meu_script.py

source: Then we can use ``perf report`` to analyze the data:
pt_br: Então podemos usar ``perf report`` para analisar os dados:

source: As you can see, the Python functions are not shown in the output, only ``_PyEval_EvalFrameDefault`` (the function that evaluates the Python bytecode) shows up. Unfortunately that's not very useful because all Python functions use the same C function to evaluate bytecode so we cannot know which Python function corresponds to which bytecode-evaluating function.
pt_br: Como você pode ver, as funções Python não são mostradas na saída, apenas ``_PyEval_EvalFrameDefault`` (a função que avalia o bytecode Python) aparece. Infelizmente isso não é muito útil porque todas as funções Python usam a mesma função C para avaliar bytecode, portanto não podemos saber qual função Python corresponde a qual função de avaliação de bytecode.

source: Instead, if we run the same experiment with ``perf`` support enabled we get:
pt_br: Em vez disso, se executarmos o mesmo experimento com o suporte ``perf`` ativado, obteremos:

source: How to enable ``perf`` profiling support
pt_br: Como habilitar o suporte a perfilação com ``perf``

source: ``perf`` profiling support can be enabled either from the start using the environment variable :envvar:`PYTHONPERFSUPPORT` or the :option:`-X perf <-X>` option, or dynamically using :func:`sys.activate_stack_trampoline` and :func:`sys.deactivate_stack_trampoline`.
pt_br: O suporte à perfilação com ``perf`` pode ser habilitado desde o início usando a variável de ambiente :envvar:`PYTHONPERFSUPPORT` ou a opção :option:`-X perf <-X>`, ou dinamicamente usando :func:`sys.activate_stack_trampoline` e :func:`sys.deactivate_stack_trampoline`.

source: The :mod:`!sys` functions take precedence over the :option:`!-X` option, the :option:`!-X` option takes precedence over the environment variable.
pt_br: As funções :mod:`!sys` têm precedência sobre a opção :option:`!-X`, a opção :option:`!-X` tem precedência sobre a variável de ambiente.

source: Example, using the environment variable::
pt_br: Exemplo usando a variável de ambiente::

source: $ PYTHONPERFSUPPORT=1 perf record -F 9999 -g -o perf.data python my_script.py $ perf report -g -i perf.data
pt_br: $ PYTHONPERFSUPPORT=1 perf record -F 9999 -g -o perf.data python meu_script.py $ perf report -g -i perf.data

source: Example, using the :option:`!-X` option::
pt_br: Exemplo usando a opção :option:`!-X`::

source: $ perf record -F 9999 -g -o perf.data python -X perf my_script.py $ perf report -g -i perf.data
pt_br: $ perf record -F 9999 -g -o perf.data python -X perf meu_script.py $ perf report -g -i perf.data

source: Example, using the :mod:`sys` APIs in file :file:`example.py`:
pt_br: Exemplo usando as APIs de :mod:`sys` em :file:`example.py`:

source: ...then::
pt_br: ... então::

source: How to obtain the best results
pt_br: Como obter os melhores resultados

source: For best results, Python should be compiled with ``CFLAGS="-fno-omit-frame-pointer -mno-omit-leaf-frame-pointer"`` as this allows profilers to unwind using only the frame pointer and not on DWARF debug information. This is because as the code that is interposed to allow ``perf`` support is dynamically generated it doesn't have any DWARF debugging information available.
pt_br: Para melhores resultados, Python deve ser compilado com ``CFLAGS="-fno-omit-frame-pointer -mno-omit-leaf-frame-pointer"``, pois isso permite que os perfiladores façam o desenrolamento de pilha (ou *stack unwinding*) usando apenas o ponteiro de quadro e não no DWARF informações de depuração. Isso ocorre porque como o código interposto para permitir o suporte ``perf`` é gerado dinamicamente, ele não possui nenhuma informação de depuração DWARF disponível.

source: You can check if your system has been compiled with this flag by running::
pt_br: Você pode verificar se o seu sistema foi compilado com este sinalizador executando::

source: If you don't see any output it means that your interpreter has not been compiled with frame pointers and therefore it may not be able to show Python functions in the output of ``perf``.
pt_br: Se você não vir nenhuma saída, significa que seu interpretador não foi compilado com ponteiros de quadro e, portanto, pode não ser capaz de mostrar funções Python na saída de ``perf``.

source: How to work without frame pointers
pt_br: Como trabalhar sem ponteiros de quadro

source: If you are working with a Python interpreter that has been compiled without frame pointers, you can still use the ``perf`` profiler, but the overhead will be a bit higher because Python needs to generate unwinding information for every Python function call on the fly. Additionally, ``perf`` will take more time to process the data because it will need to use the DWARF debugging information to unwind the stack and this is a slow process.
pt_br: Se você estiver trabalhando com um interpretador Python que foi compilado sem ponteiros de quadro, você ainda pode usar o perfilador ``perf``, mas a sobrecarga será um pouco maior porque o Python precisa gerar informações de desenrolamento para cada chamada de função Python em tempo real. Além disso, ``perf`` levará mais tempo para processar os dados porque precisará usar as informações de depuração DWARF para desenrolar a pilha e este é um processo lento.

source: To enable this mode, you can use the environment variable :envvar:`PYTHON_PERF_JIT_SUPPORT` or the :option:`-X perf_jit <-X>` option, which will enable the JIT mode for the ``perf`` profiler.
pt_br: Para habilitar esse modo, você pode usar a variável de ambiente :envvar:`PYTHON_PERF_JIT_SUPPORT` ou a opção :option:`-X perf_jit <-X>`, que habilitará o modo JIT para o perfilador ``perf``.

source: Due to a bug in the ``perf`` tool, only ``perf`` versions higher than v6.8 will work with the JIT mode. The fix was also backported to the v6.7.2 version of the tool.
pt_br: Devido a um bug na ferramenta ``perf``, apenas versões ``perf`` superiores à v6.8 funcionarão com o modo JIT. A correção também foi portada para a versão v6.7.2 da ferramenta.

source: Note that when checking the version of the ``perf`` tool (which can be done by running ``perf version``) you must take into account that some distros add some custom version numbers including a ``-`` character. This means that ``perf 6.7-3`` is not necessarily ``perf 6.7.3``.
pt_br: Note que ao verificar a versão da ferramenta ``perf`` (o que pode ser feito executando ``perf version``) você deve levar em conta que algumas distros adicionam alguns números de versão personalizados, incluindo um caractere ``-``. Isso significa que ``perf 6.7-3`` não é necessariamente ``perf 6.7.3``.

source: When using the perf JIT mode, you need an extra step before you can run ``perf report``. You need to call the ``perf inject`` command to inject the JIT information into the ``perf.data`` file.::
pt_br: Ao usar o modo JIT do perf, você precisa de uma etapa extra antes de poder executar ``perf report``. Você precisa chamar o comando ``perf inject`` para injetar as informações JIT no arquivo ``perf.data``.::

source: $ perf record -F 9999 -g -k 1 --call-graph dwarf -o perf.data python -Xperf_jit my_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf report -g -i perf.jit.data
pt_br: $ perf record -F 9999 -g -k 1 --call-graph dwarf -o perf.data python -Xperf_jit meu_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf report -g -i perf.jit.data

source: or using the environment variable::
pt_br: ou usando a variável de ambiente::

source: $ PYTHON_PERF_JIT_SUPPORT=1 perf record -F 9999 -g --call-graph dwarf -o perf.data python my_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf report -g -i perf.jit.data
pt_br: $ PYTHON_PERF_JIT_SUPPORT=1 perf record -F 9999 -g --call-graph dwarf -o perf.data python meu_script.py $ perf inject -i perf.data --jit --output perf.jit.data $ perf report -g -i perf.jit.data

source: ``perf inject --jit`` command will read ``perf.data``, automatically pick up the perf dump file that Python creates (in ``/tmp/perf-$PID.dump``), and then create ``perf.jit.data`` which merges all the JIT information together. It should also create a lot of ``jitted-XXXX-N.so`` files in the current directory which are ELF images for all the JIT trampolines that were created by Python.
pt_br: O comando ``perf inject --jit`` lerá ``perf.data``, pegará automaticamente o arquivo de dump perf que o Python cria (em ``/tmp/perf-$PID.dump``) e, em seguida, criará ``perf.jit.data`` que mescla todas as informações JIT. Ele também deve criar muitos arquivos ``jitted-XXXX-N.so`` no diretório atual, que são imagens ELF para todos os trampolins JIT que foram criados pelo Python.

source: When using ``--call-graph dwarf``, the ``perf`` tool will take snapshots of the stack of the process being profiled and save the information in the ``perf.data`` file. By default, the size of the stack dump is 8192 bytes, but you can change the size by passing it after a comma like ``--call-graph dwarf,16384``.
pt_br: Ao usar ``--call-graph dwarf``, a ferramenta ``perf`` fará snapshots da pilha do processo que está sendo perfilado e salvará as informações no arquivo ``perf.data``. Por padrão, o tamanho do dump da pilha é de 8192 bytes, mas você pode alterar o tamanho passando-o após uma vírgula, como ``--call-graph dwarf,16384``.

source: The size of the stack dump is important because if the size is too small ``perf`` will not be able to unwind the stack and the output will be incomplete. On the other hand, if the size is too big, then ``perf`` won't be able to sample the process as frequently as it would like as the overhead will be higher.
pt_br: O tamanho do dump da pilha é importante porque, se for muito pequeno, o ``perf`` não conseguirá desfazer o descompasso da pilha e a saída será incompleta. Por outro lado, se for muito grande, o ``perf`` não conseguirá amostrar o processo com a frequência desejada, pois a sobrecarga será maior.

source: The stack size is particularly important when profiling Python code compiled with low optimization levels (like ``-O0``), as these builds tend to have larger stack frames. If you are compiling Python with ``-O0`` and not seeing Python functions in your profiling output, try increasing the stack dump size to 65528 bytes (the maximum)::
pt_br: O tamanho da pilha é particularmente importante ao criar perfis de código Python compilado com níveis de otimização baixos (como ``-O0``), pois essas construções tendem a ter quadros de pilha maiores. Se você estiver compilando Python com ``-O0`` e não estiver vendo funções Python na saída do perfil, tente aumentar o tamanho do despejo de pilha para 65528 bytes (o máximo):

source: $ perf record -F 9999 -g -k 1 --call-graph dwarf,65528 -o perf.data python -Xperf_jit my_script.py
pt_br: $ perf record -F 9999 -g -k 1 --call-graph dwarf,65528 -o perf.data python -Xperf_jit meu_script.py

source: Different compilation flags can significantly impact stack sizes:
pt_br: Diferentes sinalizadores de compilação podem impactar significativamente os tamanhos de pilha:

source: Builds with ``-O0`` typically have much larger stack frames than those with ``-O1`` or higher
pt_br: Construções com ``-O0`` geralmente têm quadros de pilha muito maiores do que aquelas com ``-O1`` ou superior

source: Adding optimizations (``-O1``, ``-O2``, etc.) typically reduces stack size
pt_br: Adiciona otimizações (``-O1``, ``-O2``, etc.) normalmente reduz o tamanho da pilha

source: Frame pointers (``-fno-omit-frame-pointer``) generally provide more reliable stack unwinding
pt_br: Os ponteiros de quadro (``-fno-omit-frame-pointer``) geralmente fornecem um desenrolamento de pilha mais confiável
