Repository: python/python-docs-pt-br
Catalog: howto/remote_debugging.po
Languages: pt_br

source: Remote debugging attachment protocol
pt_br: Protocolo de anexação de depuração remota

source: This section describes the low-level protocol that enables external tools to inject and execute a Python script within a running CPython process.
pt_br: Esta seção descreve o protocolo de baixo nível que permite que ferramentas externas injetem e executem um script Python dentro de um processo CPython em execução.

source: This mechanism forms the basis of the :func:`sys.remote_exec` function, which instructs a remote Python process to execute a ``.py`` file. However, this section does not document the usage of that function. Instead, it provides a detailed explanation of the underlying protocol, which takes as input the ``pid`` of a target Python process and the path to a Python source file to be executed. This information supports independent reimplementation of the protocol, regardless of programming language.
pt_br: Este mecanismo forma a base da função :func:`sys.remote_exec`, que instrui um processo Python remoto a executar um arquivo ``.py``. No entanto, esta seção não documenta o uso dessa função. Em vez disso, fornece uma explicação detalhada do protocolo subjacente, que recebe como entrada o ``pid`` de um processo Python de destino e o caminho para um arquivo-fonte Python a ser executado. Essas informações permitem a reimplementação independente do protocolo, independentemente da linguagem de programação.

source: The execution of the injected script depends on the interpreter reaching a safe evaluation point. As a result, execution may be delayed depending on the runtime state of the target process.
pt_br: A execução do script injetado depende de o interpretador atingir um ponto de avaliação seguro. Como resultado, a execução pode ser atrasada dependendo do estado de execução do processo de destino.

source: Once injected, the script is executed by the interpreter within the target process the next time a safe evaluation point is reached. This approach enables remote execution capabilities without modifying the behavior or structure of the running Python application.
pt_br: Uma vez injetado, o script é executado pelo interpretador dentro do processo de destino na próxima vez que um ponto de avaliação seguro for atingido. Essa abordagem permite recursos de execução remota sem modificar o comportamento ou a estrutura da aplicação Python em execução.

source: Subsequent sections provide a step-by-step description of the protocol, including techniques for locating interpreter structures in memory, safely accessing internal fields, and triggering code execution. Platform-specific variations are noted where applicable, and example implementations are included to clarify each operation.
pt_br: As seções subsequentes fornecem uma descrição passo a passo do protocolo, incluindo técnicas para localizar estruturas do interpretador na memória, acessar campos internos com segurança e disparar a execução de código. Variações específicas da plataforma são indicadas quando aplicável, e exemplos de implementação são incluídos para esclarecer cada operação.

source: Locating the PyRuntime structure
pt_br: Localizando a estrutura de PyRuntime

source: CPython places the ``PyRuntime`` structure in a dedicated binary section to help external tools find it at runtime. The name and format of this section vary by platform. For example, ``.PyRuntime`` is used on ELF systems, and ``__DATA,__PyRuntime`` is used on macOS. Tools can find the offset of this structure by examining the binary on disk.
pt_br: O CPython coloca a estrutura ``PyRuntime`` em uma seção binária dedicada para ajudar ferramentas externas a encontrá-la em tempo de execução. O nome e o formato desta seção variam de acordo com a plataforma. Por exemplo, ``.PyRuntime`` é usado em sistemas ELF, e ``__DATA,__PyRuntime`` é usado no macOS. As ferramentas podem encontrar o deslocamento desta estrutura examinando o binário no disco.

source: The ``PyRuntime`` structure contains CPython’s global interpreter state and provides access to other internal data, including the list of interpreters, thread states, and debugger support fields.
pt_br: A estrutura ``PyRuntime`` contém o estado global do interpretador do CPython e fornece acesso a outros dados internos, incluindo a lista de interpretadores, estados de thread e campos de suporte do depurador.

source: To work with a remote Python process, a debugger must first find the memory address of the ``PyRuntime`` structure in the target process. This address can’t be hardcoded or calculated from a symbol name, because it depends on where the operating system loaded the binary.
pt_br: Para trabalhar com um processo Python remoto, um depurador precisa primeiro encontrar o endereço de memória da estrutura ``PyRuntime`` no processo de destino. Este endereço não pode ser codificado ou calculado a partir de um nome de símbolo, pois depende de onde o sistema operacional carregou o binário.

source: The method for finding ``PyRuntime`` depends on the platform, but the steps are the same in general:
pt_br: O método para encontrar ``PyRuntime`` depende da plataforma, mas os passos são os mesmos em geral:

source: Find the base address where the Python binary or shared library was loaded in the target process.
pt_br: Encontrar o endereço base onde o binário Python ou a biblioteca compartilhada foi carregada no processo de destino.

source: Use the on-disk binary to locate the offset of the ``.PyRuntime`` section.
pt_br: Usar o binário no disco para localizar o deslocamento da seção ``.PyRuntime``.

source: Add the section offset to the base address to compute the address in memory.
pt_br: Adicionar o deslocamento da seção ao endereço base para calcular o endereço na memória.

source: The sections below explain how to do this on each supported platform and include example code.
pt_br: As seções abaixo explicam como fazer isso em cada plataforma suportada e incluem código de exemplo.

source: To find the ``PyRuntime`` structure on Linux:
pt_br: Para encontrar a estrutura de ``PyRuntime`` no Linux:

source: Read the process’s memory map (for example, ``/proc/<pid>/maps``) to find the address where the Python executable or ``libpython`` was loaded.
pt_br: Lê o mapa de memória do processo (por exemplo, ``/proc/<pid>/maps``) para encontrar o endereço onde o executável Python ou ``libpython`` foi carregado.

source: Parse the ELF section headers in the binary to get the offset of the ``.PyRuntime`` section.
pt_br: Analise os cabeçalhos da seção ELF no binário para obter o deslocamento da seção ``.PyRuntime``.

source: Add that offset to the base address from step 1 to get the memory address of ``PyRuntime``.
pt_br: Adicione esse deslocamento ao endereço base da etapa 1 para obter o endereço de memória de ``PyRuntime``.

source: The following is an example implementation::
pt_br: A seguir está um exemplo de implementação::

source: def find_py_runtime_linux(pid: int) -> int: # Step 1: Try to find the Python executable in memory binary_path, base_address = find_mapped_binary( pid, name_contains="python" ) # Step 2: Fallback to shared library if executable is not found if binary_path is None: binary_path, base_address = find_mapped_binary( pid, name_contains="libpython" ) # Step 3: Parse ELF headers to get .PyRuntime section offset section_offset = parse_elf_section_offset( binary_path, ".PyRuntime" ) # Step 4: Compute PyRuntime address in memory return base_address + section_offset
pt_br: def find_py_runtime_linux(pid: int) -> int: # Etapa 1: tenta encontrar o executável Python na memória binary_path, base_address = find_mapped_binary( pid, name_contains="python" ) # Etapa 2: recorre à biblioteca compartilhada se não encontrar o executável if binary_path is None: binary_path, base_address = find_mapped_binary( pid, name_contains="libpython" ) # Etapa 3: analisa os cabeçalhos ELF para obter o deslocamento da seção .PyRuntime section_offset = parse_elf_section_offset( binary_path, ".PyRuntime" ) # Etapa 4: calcula o endereço de PyRuntime na memória return base_address + section_offset

source: On Linux systems, there are two main approaches to read memory from another process. The first is through the ``/proc`` filesystem, specifically by reading from ``/proc/[pid]/mem`` which provides direct access to the process's memory. This requires appropriate permissions - either being the same user as the target process or having root access. The second approach is using the ``process_vm_readv()`` system call which provides a more efficient way to copy memory between processes. While ptrace's ``PTRACE_PEEKTEXT`` operation can also be used to read memory, it is significantly slower as it only reads one word at a time and requires multiple context switches between the tracer and tracee processes.
pt_br: Em sistemas Linux, existem duas abordagens principais para ler memória de outro processo. A primeira é através do sistema de arquivos ``/proc``, especificamente lendo de ``/proc/[pid]/mem``, que fornece acesso direto à memória do processo. Isso requer permissões apropriadas – seja o mesmo usuário do processo alvo ou ter acesso root. A segunda abordagem é usar a chamada de sistema ``process_vm_readv()``, que fornece uma maneira mais eficiente de copiar memória entre processos. Embora a operação ``PTRACE_PEEKTEXT`` do ptrace também possa ser usada para ler memória, ela é significativamente mais lenta, pois lê apenas uma palavra por vez e requer múltiplas trocas de contexto entre os processos rastreador e rastreado.

source: For parsing ELF sections, the process involves reading and interpreting the ELF file format structures from the binary file on disk. The ELF header contains a pointer to the section header table. Each section header contains metadata about a section including its name (stored in a separate string table), offset, and size. To find a specific section like .PyRuntime, you need to walk through these headers and match the section name. The section header then provides the offset where that section exists in the file, which can be used to calculate its runtime address when the binary is loaded into memory.
pt_br: Para analisar seções ELF, o processo envolve a leitura e a interpretação das estruturas do formato de arquivo ELF do arquivo binário em disco. O cabeçalho ELF contém um ponteiro para a tabela de cabeçalhos de seção. Cada cabeçalho de seção contém metadados sobre uma seção, incluindo seu nome (armazenado em uma tabela de strings separada), deslocamento e tamanho. Para encontrar uma seção específica, como .PyRuntime, você precisa percorrer esses cabeçalhos e encontrar o nome da seção. O cabeçalho de seção então fornece o deslocamento onde essa seção existe no arquivo, que pode ser usado para calcular seu endereço de tempo de execução quando o binário é carregado na memória.

source: You can read more about the ELF file format in the `ELF specification <https://en.wikipedia.org/wiki/Executable_and_Linkable_Format>`_.
pt_br: Você pode ler mais sobre o formato de arquivo ELF na `especificação do ELF <https://en.wikipedia.org/wiki/Executable_and_Linkable_Format>`_.

source: To find the ``PyRuntime`` structure on macOS:
pt_br: Para encontrar a estrutura de ``PyRuntime`` no macOS:

source: Call ``task_for_pid()`` to get the ``mach_port_t`` task port for the target process. This handle is needed to read memory using APIs like ``mach_vm_read_overwrite`` and ``mach_vm_region``.
pt_br: Chame ``task_for_pid()`` para obter a porta da tarefa ``mach_port_t`` para o processo de destino. Este identificador é necessário para ler memória usando APIs como ``mach_vm_read_overwrite`` e ``mach_vm_region``.

source: Scan the memory regions to find the one containing the Python executable or ``libpython``.
pt_br: Examine as regiões da memória para encontrar aquela que contém o executável Python ou ``libpython``.

source: Load the binary file from disk and parse the Mach-O headers to find the section named ``PyRuntime`` in the ``__DATA`` segment. On macOS, symbol names are automatically prefixed with an underscore, so the ``PyRuntime`` symbol appears as ``_PyRuntime`` in the symbol table, but the section name is not affected.
pt_br: Carregue o arquivo binário do disco e analise os cabeçalhos do Mach-O para encontrar a seção chamada ``PyRuntime`` no segmento ``__DATA``. No macOS, os nomes dos símbolos são prefixados automaticamente com um sublinhado, de modo que o símbolo ``PyRuntime`` aparece como ``_PyRuntime`` na tabela de símbolos, mas o nome da seção não é afetado.

source: def find_py_runtime_macos(pid: int) -> int: # Step 1: Get access to the process's memory handle = get_memory_access_handle(pid) # Step 2: Try to find the Python executable in memory binary_path, base_address = find_mapped_binary( handle, name_contains="python" ) # Step 3: Fallback to libpython if the executable is not found if binary_path is None: binary_path, base_address = find_mapped_binary( handle, name_contains="libpython" ) # Step 4: Parse Mach-O headers to get __DATA,__PyRuntime section offset section_offset = parse_macho_section_offset( binary_path, "__DATA", "__PyRuntime" ) # Step 5: Compute the PyRuntime address in memory return base_address + section_offset
pt_br: def find_py_runtime_macos(pid: int) -> int: # Etapa 1: obtém acesso à memória do processo handle = get_memory_access_handle(pid) # Etapa 2: tenta encontrar o executável Python na memória binary_path, base_address = find_mapped_binary( handle, name_contains="python" ) # Etapa 2: recorre à biblioteca compartilhada se não encontrar o executável if binary_path is None: binary_path, base_address = find_mapped_binary( handle, name_contains="libpython" ) # Etapa 4: analisa os cabeçalhos Mach-O para obter o deslocamento da seção __DATA,__PyRuntime section_offset = parse_macho_section_offset( binary_path, "__DATA", "__PyRuntime" ) # Etapa 5: calcula o endereço de PyRuntime na memória return base_address + section_offset

source: On macOS, accessing another process's memory requires using Mach-O specific APIs and file formats. The first step is obtaining a ``task_port`` handle via ``task_for_pid()``, which provides access to the target process's memory space. This handle enables memory operations through APIs like ``mach_vm_read_overwrite()``.
pt_br: No macOS, acessar a memória de outro processo requer o uso de APIs e formatos de arquivo específicos do Mach-O. O primeiro passo é obter um identificador ``task_port`` via ``task_for_pid()``, que fornece acesso ao espaço de memória do processo de destino. Esse identificador permite operações de memória por meio de APIs como ``mach_vm_read_overwrite()``.

source: The process memory can be examined using ``mach_vm_region()`` to scan through the virtual memory space, while ``proc_regionfilename()`` helps identify which binary files are loaded at each memory region. When the Python binary or library is found, its Mach-O headers need to be parsed to locate the ``PyRuntime`` structure.
pt_br: A memória do processo pode ser examinada usando ``mach_vm_region()`` para varrer o espaço da memória virtual, enquanto ``proc_regionfilename()`` ajuda a identificar quais arquivos binários são carregados em cada região da memória. Quando o binário ou biblioteca Python é encontrado, seus cabeçalhos Mach-O precisam ser analisados para localizar a estrutura ``PyRuntime``.

source: The Mach-O format organizes code and data into segments and sections. The ``PyRuntime`` structure lives in a section named ``__PyRuntime`` within the ``__DATA`` segment. The actual runtime address calculation involves finding the ``__TEXT`` segment which serves as the binary's base address, then locating the ``__DATA`` segment containing our target section. The final address is computed by combining the base address with the appropriate section offsets from the Mach-O headers.
pt_br: O formato Mach-O organiza código e dados em segmentos e seções. A estrutura ``PyRuntime`` reside em uma seção chamada ``__PyRuntime`` dentro do segmento ``__DATA``. O cálculo do endereço de tempo de execução envolve encontrar o segmento ``__TEXT``, que serve como endereço base do binário, e então localizar o segmento ``__DATA`` que contém nossa seção de destino. O endereço final é calculado combinando o endereço base com os deslocamentos de seção apropriados dos cabeçalhos do Mach-O.

source: Note that accessing another process's memory on macOS typically requires elevated privileges - either root access or special security entitlements granted to the debugging process.
pt_br: Observe que acessar a memória de outro processo no macOS normalmente requer privilégios elevados — acesso root ou direitos de segurança especiais concedidos ao processo de depuração.

source: To find the ``PyRuntime`` structure on Windows:
pt_br: Para encontrar a estrutura de ``PyRuntime`` no Windows:

source: Use the ToolHelp API to enumerate all modules loaded in the target process. This is done using functions such as `CreateToolhelp32Snapshot <https://learn.microsoft.com/en-us/windows/win32/api/tlhelp32/nf-tlhelp32-createtoolhelp32snapshot>`_, `Module32First <https://learn.microsoft.com/en-us/windows/win32/api/tlhelp32/nf-tlhelp32-module32first>`_, and `Module32Next <https://learn.microsoft.com/en-us/windows/win32/api/tlhelp32/nf-tlhelp32-module32next>`_.
pt_br: Use a API ToolHelp para enumerar todos os módulos carregados no processo de destino. Isso é feito usando funções como `CreateToolhelp32Snapshot <https://learn.microsoft.com/pt-br/windows/win32/api/tlhelp32/nf-tlhelp32-createtoolhelp32snapshot>`_, `Module32First <https://learn.microsoft.com/pt-br/windows/win32/api/tlhelp32/nf-tlhelp32-module32first>`_ e `Module32Next <https://learn.microsoft.com/pt-br/windows/win32/api/tlhelp32/nf-tlhelp32-module32next>`_.

source: Identify the module corresponding to :file:`python.exe` or :file:`python{XY}.dll`, where ``X`` and ``Y`` are the major and minor version numbers of the Python version, and record its base address.
pt_br: Identifique o módulo correspondente a :file:`python.exe` ou :file:`python{XY}.dll`, onde ``X`` e ``Y`` são os números de versão principal e secundária do Python, e registre seu endereço base.

source: Locate the ``PyRuntim`` section. Due to the PE format's 8-character limit on section names (defined as ``IMAGE_SIZEOF_SHORT_NAME``), the original name ``PyRuntime`` is truncated. This section contains the ``PyRuntime`` structure.
pt_br: Localize a seção ``PyRuntim``. Devido ao limite de 8 caracteres do formato PE para nomes de seção (definido como ``IMAGE_SIZEOF_SHORT_NAME``), o nome original ``PyRuntime`` está truncado. Esta seção contém a estrutura ``PyRuntime``.

source: Retrieve the section’s relative virtual address (RVA) and add it to the base address of the module.
pt_br: Recupere o endereço virtual relativo (RVA) da seção e adicione-o ao endereço base do módulo.

source: def find_py_runtime_windows(pid: int) -> int: # Step 1: Try to find the Python executable in memory binary_path, base_address = find_loaded_module( pid, name_contains="python" ) # Step 2: Fallback to shared pythonXY.dll if the executable is not # found if binary_path is None: binary_path, base_address = find_loaded_module( pid, name_contains="python3" ) # Step 3: Parse PE section headers to get the RVA of the PyRuntime # section. The section name appears as "PyRuntim" due to the # 8-character limit defined by the PE format (IMAGE_SIZEOF_SHORT_NAME). section_rva = parse_pe_section_offset(binary_path, "PyRuntim") # Step 4: Compute PyRuntime address in memory return base_address + section_rva
pt_br: def find_py_runtime_windows(pid: int) -> int: # Etapa 1: tenta encontrar o executável Python na memória binary_path, base_address = find_loaded_module( pid, name_contains="python" ) # Etapa 2: recorre à pythonXY.dll compartilhada se não encontrar # o executável if binary_path is None: binary_path, base_address = find_loaded_module( pid, name_contains="python3" ) # Etapa 3: analisa os cabeçalhos da seção PE para obter o RVA # da seção .PyRuntime. O nome da seção aparece como "PyRuntim" # devido ao limite de 8 caracteres definido pelo formato PE # (IMAGE_SIZEOF_SHORT_NAME). section_rva = parse_pe_section_offset(binary_path, "PyRuntim") # Etapa 4: calcula o endereço de PyRuntime na memória return base_address + section_rva

source: On Windows, accessing another process's memory requires using the Windows API functions like ``CreateToolhelp32Snapshot()`` and ``Module32First()/Module32Next()`` to enumerate loaded modules. The ``OpenProcess()`` function provides a handle to access the target process's memory space, enabling memory operations through ``ReadProcessMemory()``.
pt_br: No Windows, acessar a memória de outro processo requer o uso de funções da API do Windows, como ``CreateToolhelp32Snapshot()`` e ``Module32First()/Module32Next()``, para enumerar os módulos carregados. A função ``OpenProcess()`` fornece um identificador para acessar o espaço de memória do processo de destino, permitindo operações de memória por meio de ``ReadProcessMemory()``.

source: The process memory can be examined by enumerating loaded modules to find the Python binary or DLL. When found, its PE headers need to be parsed to locate the ``PyRuntime`` structure.
pt_br: A memória do processo pode ser examinada enumerando os módulos carregados para encontrar o binário ou DLL Python. Quando encontrados, seus cabeçalhos PE precisam ser analisados para localizar a estrutura ``PyRuntime``.

source: The PE format organizes code and data into sections. The ``PyRuntime`` structure lives in a section named "PyRuntim" (truncated from "PyRuntime" due to PE's 8-character name limit). The actual runtime address calculation involves finding the module's base address from the module entry, then locating our target section in the PE headers. The final address is computed by combining the base address with the section's virtual address from the PE section headers.
pt_br: O formato PE organiza código e dados em seções. A estrutura de ``PyRuntime`` reside em uma seção chamada "PyRuntim" (truncado de "PyRuntime" devido ao limite de 8 caracteres para nomes do PE). O cálculo do endereço de tempo de execução envolve encontrar o endereço base do módulo a partir da entrada do módulo e, em seguida, localizar nossa seção de destino nos cabeçalhos do PE. O endereço final é calculado combinando o endereço base com o endereço virtual da seção, a partir dos cabeçalhos da seção do PE.

source: Note that accessing another process's memory on Windows typically requires appropriate privileges - either administrative access or the ``SeDebugPrivilege`` privilege granted to the debugging process.
pt_br: Observe que acessar a memória de outro processo no Windows normalmente requer privilégios apropriados — acesso administrativo ou o privilégio de ``SeDebugPrivilege`` concedidos ao processo de depuração.

source: Reading _Py_DebugOffsets
pt_br: Lendo _Py_DebugOffsets

source: Once the address of the ``PyRuntime`` structure has been determined, the next step is to read the ``_Py_DebugOffsets`` structure located at the beginning of the ``PyRuntime`` block.
pt_br: Depois que o endereço da estrutura ``PyRuntime`` for determinado, o próximo passo é ler a estrutura ``_Py_DebugOffsets`` localizada no início do bloco ``PyRuntime``.

source: This structure provides version-specific field offsets that are needed to safely read interpreter and thread state memory. These offsets vary between CPython versions and must be checked before use to ensure they are compatible.
pt_br: Esta estrutura fornece deslocamentos de campo específicos da versão, necessários para ler com segurança a memória de estado de thread e do interpretador. Esses deslocamentos variam entre as versões do CPython e devem ser verificados antes do uso para garantir sua compatibilidade.
