Repository: python/python-docs-pt-br
Catalog: howto/remote_debugging.po
Languages: pt_br

source: To read and check the debug offsets, follow these steps:
pt_br: Para ler e verificar os deslocamentos de depuração, siga estas etapas:

source: Read memory from the target process starting at the ``PyRuntime`` address, covering the same number of bytes as the ``_Py_DebugOffsets`` structure. This structure is located at the very start of the ``PyRuntime`` memory block. Its layout is defined in CPython’s internal headers and stays the same within a given minor version, but may change in major versions.
pt_br: Lê a memória do processo de destino, começando no endereço ``PyRuntime``, cobrindo o mesmo número de bytes que a estrutura ``_Py_DebugOffsets``. Essa estrutura está localizada no início do bloco de memória ``PyRuntime``. Seu layout é definido nos cabeçalhos internos do CPython e permanece o mesmo em uma determinada versão secundária, mas pode mudar em versões principais.

source: Check that the structure contains valid data:
pt_br: Verifica se a estrutura contém dados válidos:

source: The ``cookie`` field must match the expected debug marker.
pt_br: O campo ``cookie`` deve corresponder ao marcador de depuração esperado.

source: The ``version`` field must match the version of the Python interpreter used by the debugger.
pt_br: O campo ``version`` deve corresponder à versão do interpretador Python usado pelo depurador.

source: If either the debugger or the target process is using a pre-release version (for example, an alpha, beta, or release candidate), the versions must match exactly.
pt_br: Se o depurador ou o processo de destino estiver usando uma versão de pré-lançamento (por exemplo, uma versão alfa, beta ou candidata a lançamento), as versões deverão corresponder exatamente.

source: The ``free_threaded`` field must have the same value in both the debugger and the target process.
pt_br: O campo ``free_threaded`` deve ter o mesmo valor no depurador e no processo de destino.

source: If the structure is valid, the offsets it contains can be used to locate fields in memory. If any check fails, the debugger should stop the operation to avoid reading memory in the wrong format.
pt_br: Se a estrutura for válida, os deslocamentos que ela contém podem ser usados para localizar campos na memória. Se alguma verificação falhar, o depurador deve interromper a operação para evitar a leitura da memória no formato errado.

source: The following is an example implementation that reads and checks ``_Py_DebugOffsets``::
pt_br: A seguir está um exemplo de implementação que lê e verifica ``_Py_DebugOffsets``::

source: def read_debug_offsets(pid: int, py_runtime_addr: int) -> DebugOffsets: # Step 1: Read memory from the target process at the PyRuntime address data = read_process_memory( pid, address=py_runtime_addr, size=DEBUG_OFFSETS_SIZE ) # Step 2: Deserialize the raw bytes into a _Py_DebugOffsets structure debug_offsets = parse_debug_offsets(data) # Step 3: Validate the contents of the structure if debug_offsets.cookie != EXPECTED_COOKIE: raise RuntimeError("Invalid or missing debug cookie") if debug_offsets.version != LOCAL_PYTHON_VERSION: raise RuntimeError( "Mismatch between caller and target Python versions" ) if debug_offsets.free_threaded != LOCAL_FREE_THREADED: raise RuntimeError("Mismatch in free-threaded configuration") return debug_offsets
pt_br: def read_debug_offsets(pid: int, py_runtime_addr: int) -> DebugOffsets: # Etapa 1: lê a memória do processo de destino no endereço PyRuntime data = read_process_memory( pid, address=py_runtime_addr, size=DEBUG_OFFSETS_SIZE ) # Etapa 2: desserializa os bytes brutos em uma estrutura _Py_DebugOffsets debug_offsets = parse_debug_offsets(data) # Etapa 3: valida o conteúdo da estrutura if debug_offsets.cookie != EXPECTED_COOKIE: raise RuntimeError("Invalid or missing debug cookie") if debug_offsets.version != LOCAL_PYTHON_VERSION: raise RuntimeError( "Mismatch between caller and target Python versions" ) if debug_offsets.free_threaded != LOCAL_FREE_THREADED: raise RuntimeError("Mismatch in free-threaded configuration") return debug_offsets

source: **Process suspension recommended**
pt_br: **Suspensão de processo recomendada**

source: To avoid race conditions and ensure memory consistency, it is strongly recommended that the target process be suspended before performing any operations that read or write internal interpreter state. The Python runtime may concurrently mutate interpreter data structures—such as creating or destroying threads—during normal execution. This can result in invalid memory reads or writes.
pt_br: Para evitar condições de corrida e garantir a consistência da memória, é altamente recomendável suspender o processo de destino antes de executar qualquer operação que leia ou grave o estado interno do interpretador. O tempo de execução do Python pode, simultaneamente, alterar as estruturas de dados do interpretador — como criar ou destruir threads — durante a execução normal. Isso pode resultar em leituras ou gravações de memória inválidas.

source: A debugger may suspend execution by attaching to the process with ``ptrace`` or by sending a ``SIGSTOP`` signal. Execution should only be resumed after debugger-side memory operations are complete.
pt_br: Um depurador pode suspender a execução anexando-se ao processo com ``ptrace`` ou enviando um sinal ``SIGSTOP``. A execução só deve ser retomada após a conclusão das operações de memória do lado do depurador.

source: Some tools, such as profilers or sampling-based debuggers, may operate on a running process without suspension. In such cases, tools must be explicitly designed to handle partially updated or inconsistent memory. For most debugger implementations, suspending the process remains the safest and most robust approach.
pt_br: Algumas ferramentas, como perfiladores ou depuradores baseados em amostragem, podem operar em um processo em execução sem suspensão. Nesses casos, as ferramentas devem ser explicitamente projetadas para lidar com memória parcialmente atualizada ou inconsistente. Para a maioria das implementações de depuradores, suspender o processo continua sendo a abordagem mais segura e robusta.

source: Locating the interpreter and thread state
pt_br: Localizando o estado de thread e do interpretador

source: Before code can be injected and executed in a remote Python process, the debugger must choose a thread in which to schedule execution. This is necessary because the control fields used to perform remote code injection are located in the ``_PyRemoteDebuggerSupport`` structure, which is embedded in a ``PyThreadState`` object. These fields are modified by the debugger to request execution of injected scripts.
pt_br: Antes que o código possa ser injetado e executado em um processo Python remoto, o depurador deve escolher uma thread para agendar a execução. Isso é necessário porque os campos de controle usados para realizar a injeção remota de código estão localizados na estrutura ``_PyRemoteDebuggerSupport``, que está incorporada em um objeto ``PyThreadState``. Esses campos são modificados pelo depurador para solicitar a execução dos scripts injetados.

source: The ``PyThreadState`` structure represents a thread running inside a Python interpreter. It maintains the thread’s evaluation context and contains the fields required for debugger coordination. Locating a valid ``PyThreadState`` is therefore a key prerequisite for triggering execution remotely.
pt_br: A estrutura ``PyThreadState`` representa uma thread em execução dentro de um interpretador Python. Ela mantém o contexto de avaliação da thread e contém os campos necessários para a coordenação do depurador. Localizar um ``PyThreadState`` válido é, portanto, um pré-requisito essencial para acionar a execução remotamente.

source: A thread is typically selected based on its role or ID. In most cases, the main thread is used, but some tools may target a specific thread by its native thread ID. Once the target thread is chosen, the debugger must locate both the interpreter and the associated thread state structures in memory.
pt_br: Uma thread é normalmente selecionada com base em sua função ou ID. Na maioria dos casos, a thread principal é usada, mas algumas ferramentas podem direcionar uma thread específica por seu ID nativo. Uma vez escolhida a thread de destino, o depurador deve localizar o interpretador e as estruturas de estado de thread associadas na memória.

source: The relevant internal structures are defined as follows:
pt_br: As estruturas internas relevantes são definidas da seguinte forma:

source: ``PyInterpreterState`` represents an isolated Python interpreter instance. Each interpreter maintains its own set of imported modules, built-in state, and thread state list. Although most Python applications use a single interpreter, CPython supports multiple interpreters in the same process.
pt_br: ``PyInterpreterState`` representa uma instância isolada de um interpretador Python. Cada interpretador mantém seu próprio conjunto de módulos importados, estado embutido e lista de estados de thread. Embora a maioria das aplicações Python use um único interpretador, o CPython oferece suporte a múltiplos interpretadores no mesmo processo.

source: ``PyThreadState`` represents a thread running within an interpreter. It contains execution state and the control fields used by the debugger.
pt_br: ``PyThreadState`` representa uma thread em execução dentro de um interpretador. Ele contém o estado de execução e os campos de controle usados pelo depurador.

source: To locate a thread:
pt_br: Para localizar uma thread:

source: Use the offset ``runtime_state.interpreters_head`` to obtain the address of the first interpreter in the ``PyRuntime`` structure. This is the entry point to the linked list of active interpreters.
pt_br: Use o offset ``runtime_state.interpreters_head`` para obter o endereço do primeiro interpretador na estrutura ``PyRuntime``. Este é o ponto de entrada para a lista vinculada de interpretadores ativos.

source: Use the offset ``interpreter_state.threads_main`` to access the main thread state associated with the selected interpreter. This is typically the most reliable thread to target.
pt_br: Use o deslocamento ``interpreter_state.threads_main`` para acessar o estado da thread principal associada ao interpretador selecionado. Normalmente, esta é a thread mais confiável para ser alvo.

source: The following is an example implementation that locates the main thread state::
pt_br: A seguir está um exemplo de implementação que localiza o estado da thread principal:

source: def find_main_thread_state( pid: int, py_runtime_addr: int, debug_offsets: DebugOffsets, ) -> int: # Step 1: Read interpreters_head from PyRuntime interp_head_ptr = ( py_runtime_addr + debug_offsets.runtime_state.interpreters_head ) interp_addr = read_pointer(pid, interp_head_ptr) if interp_addr == 0: raise RuntimeError("No interpreter found in the target process") # Step 2: Read the threads_main pointer from the interpreter threads_main_ptr = ( interp_addr + debug_offsets.interpreter_state.threads_main ) thread_state_addr = read_pointer(pid, threads_main_ptr) if thread_state_addr == 0: raise RuntimeError("Main thread state is not available") return thread_state_addr
pt_br: def find_main_thread_state( pid: int, py_runtime_addr: int, debug_offsets: DebugOffsets, ) -> int: # Etapa 1: lê interpreters_head do PyRuntime interp_head_ptr = ( py_runtime_addr + debug_offsets.runtime_state.interpreters_head ) interp_addr = read_pointer(pid, interp_head_ptr) if interp_addr == 0: raise RuntimeError("No interpreter found in the target process") # Etapa 2: lê o ponteiro threads_main do interpretador threads_main_ptr = ( interp_addr + debug_offsets.interpreter_state.threads_main ) thread_state_addr = read_pointer(pid, threads_main_ptr) if thread_state_addr == 0: raise RuntimeError("Main thread state is not available") return thread_state_addr

source: The following example demonstrates how to locate a thread by its native thread ID::
pt_br: O exemplo a seguir demonstra como localizar uma thread pelo seu ID de thread nativo:

source: def find_thread_by_id( pid: int, interp_addr: int, debug_offsets: DebugOffsets, target_tid: int, ) -> int: # Start at threads_head and walk the linked list thread_ptr = read_pointer( pid, interp_addr + debug_offsets.interpreter_state.threads_head ) while thread_ptr: native_tid_ptr = ( thread_ptr + debug_offsets.thread_state.native_thread_id ) native_tid = read_int(pid, native_tid_ptr) if native_tid == target_tid: return thread_ptr thread_ptr = read_pointer( pid, thread_ptr + debug_offsets.thread_state.next ) raise RuntimeError("Thread with the given ID was not found")
pt_br: def find_thread_by_id( pid: int, interp_addr: int, debug_offsets: DebugOffsets, target_tid: int, ) -> int: # Começa em threads_head e percorre a lista vinculada thread_ptr = read_pointer( pid, interp_addr + debug_offsets.interpreter_state.threads_head ) while thread_ptr: native_tid_ptr = ( thread_ptr + debug_offsets.thread_state.native_thread_id ) native_tid = read_int(pid, native_tid_ptr) if native_tid == target_tid: return thread_ptr thread_ptr = read_pointer( pid, thread_ptr + debug_offsets.thread_state.next ) raise RuntimeError("Thread with the given ID was not found")

source: Once a valid thread state has been located, the debugger can proceed with modifying its control fields and scheduling execution, as described in the next section.
pt_br: Depois que um estado de thread válido for localizado, o depurador pode prosseguir com a modificação de seus campos de controle e agendar a execução, conforme descrito na próxima seção.

source: Writing control information
pt_br: Escrevendo informações de controle

source: Once a valid ``PyThreadState`` structure has been identified, the debugger may modify control fields within it to schedule the execution of a specified Python script. These control fields are checked periodically by the interpreter, and when set correctly, they trigger the execution of remote code at a safe point in the evaluation loop.
pt_br: Uma vez identificada uma estrutura ``PyThreadState`` válida, o depurador pode modificar campos de controle dentro dela para agendar a execução de um script Python especificado. Esses campos de controle são verificados periodicamente pelo interpretador e, quando definidos corretamente, acionam a execução do código remoto em um ponto seguro no laço de avaliação.

source: Each ``PyThreadState`` contains a ``_PyRemoteDebuggerSupport`` structure used for communication between the debugger and the interpreter. The locations of its fields are defined by the ``_Py_DebugOffsets`` structure and include the following:
pt_br: Cada ``PyThreadState`` contém uma estrutura ``_PyRemoteDebuggerSupport`` usada para comunicação entre o depurador e o interpretador. As localizações de seus campos são definidas pela estrutura ``_Py_DebugOffsets`` e incluem o seguinte:

source: To complete the injection, the debugger must perform the following steps:
pt_br: Para concluir a injeção, o depurador deve executar as seguintes etapas:

source: Write the full script path into the ``debugger_script_path`` buffer.
pt_br: Escreve o caminho completo do script no buffer ``debugger_script_path``.

source: Set ``debugger_pending_call`` to ``1``.
pt_br: Define ``debugger_pending_call`` com ``1``.

source: Read the current value of ``eval_breaker``, set bit 5 (``_PY_EVAL_PLEASE_STOP_BIT``), and write the updated value back. This signals the interpreter to check for debugger activity.
pt_br: Lê o valor atual de ``eval_breaker``, define o bit 5 (``_PY_EVAL_PLEASE_STOP_BIT``) e grava o valor atualizado de volta. Isso sinaliza ao interpretador para verificar a atividade do depurador.

source: def inject_script( pid: int, thread_state_addr: int, debug_offsets: DebugOffsets, script_path: str ) -> None: # Compute the base offset of _PyRemoteDebuggerSupport support_base = ( thread_state_addr + debug_offsets.debugger_support.remote_debugger_support ) # Step 1: Write the script path into debugger_script_path script_path_ptr = ( support_base + debug_offsets.debugger_support.debugger_script_path ) write_string(pid, script_path_ptr, script_path) # Step 2: Set debugger_pending_call to 1 pending_ptr = ( support_base + debug_offsets.debugger_support.debugger_pending_call ) write_int(pid, pending_ptr, 1) # Step 3: Set _PY_EVAL_PLEASE_STOP_BIT (bit 5, value 1 << 5) in # eval_breaker eval_breaker_ptr = ( thread_state_addr + debug_offsets.debugger_support.eval_breaker ) breaker = read_int(pid, eval_breaker_ptr) breaker |= (1 << 5) write_int(pid, eval_breaker_ptr, breaker)
pt_br: def inject_script( pid: int, thread_state_addr: int, debug_offsets: DebugOffsets, script_path: str ) -> None: # Calcula o deslocamento base de _PyRemoteDebuggerSupport support_base = ( thread_state_addr + debug_offsets.debugger_support.remote_debugger_support ) # Etapa 1: Escreve o caminho do script em debugger_script_path script_path_ptr = ( support_base + debug_offsets.debugger_support.debugger_script_path ) write_string(pid, script_path_ptr, script_path) # Etapa 2: Define debugger_pending_call com 1 pending_ptr = ( support_base + debug_offsets.debugger_support.debugger_pending_call ) write_int(pid, pending_ptr, 1) # Etapa 3: Define _PY_EVAL_PLEASE_STOP_BIT (bit 5, valor 1 << 5) # em eval_breaker eval_breaker_ptr = ( thread_state_addr + debug_offsets.debugger_support.eval_breaker ) breaker = read_int(pid, eval_breaker_ptr) breaker |= (1 << 5) write_int(pid, eval_breaker_ptr, breaker)

source: Once these fields are set, the debugger may resume the process (if it was suspended). The interpreter will process the request at the next safe evaluation point, load the script from disk, and execute it.
pt_br: Após a configuração desses campos, o depurador pode retomar o processo (caso tenha sido suspenso). O interpretador processará a solicitação no próximo ponto de avaliação seguro, carregará o script do disco e o executará.

source: It is the responsibility of the debugger to ensure that the script file remains present and accessible to the target process during execution.
pt_br: É responsabilidade do depurador garantir que o arquivo de script permaneça presente e acessível ao processo de destino durante a execução.

source: Script execution is asynchronous. The script file cannot be deleted immediately after injection. The debugger should wait until the injected script has produced an observable effect before removing the file. This effect depends on what the script is designed to do. For example, a debugger might wait until the remote process connects back to a socket before removing the script. Once such an effect is observed, it is safe to assume the file is no longer needed.
pt_br: A execução do script é assíncrona. O arquivo de script não pode ser excluído imediatamente após a injeção. O depurador deve aguardar até que o script injetado produza um efeito observável antes de remover o arquivo. Esse efeito depende do objetivo do script. Por exemplo, um depurador pode aguardar até que o processo remoto se conecte novamente a um soquete antes de remover o script. Uma vez observado esse efeito, é seguro presumir que o arquivo não é mais necessário.

source: Summary
pt_br: Resumo

source: To inject and execute a Python script in a remote process:
pt_br: Para injetar e executar um script Python em um processo remoto:

source: Locate the ``PyRuntime`` structure in the target process’s memory.
pt_br: Localize a estrutura ``PyRuntime`` na memória do processo de destino.

source: Read and validate the ``_Py_DebugOffsets`` structure at the beginning of ``PyRuntime``.
pt_br: Lê e valida a estrutura ``_Py_DebugOffsets`` no início de ``PyRuntime``.

source: Use the offsets to locate a valid ``PyThreadState``.
pt_br: Usa os deslocamentos para localizar um ``PyThreadState`` válido.

source: Write the path to a Python script into ``debugger_script_path``.
pt_br: Escreve o caminho para um script Python em ``debugger_script_path``.

source: Set the ``debugger_pending_call`` flag to ``1``.
pt_br: Define o sinalizador ``debugger_pending_call`` com ``1``.

source: Set ``_PY_EVAL_PLEASE_STOP_BIT`` in the ``eval_breaker`` field.
pt_br: Define ``_PY_EVAL_PLEASE_STOP_BIT`` no campo ``eval_breaker``.

source: Resume the process (if suspended). The script will execute at the next safe evaluation point.
pt_br: Retoma o processo (se suspenso). O script será executado no próximo ponto de avaliação seguro.
