Repository: python/python-docs-pt-br
Catalog: howto/sockets.po
Languages: pt_br

source: Socket Programming HOWTO
pt_br: Programação de Soquetes

source: Author
pt_br: Autor

source: Abstract
pt_br: Resumo

source: Sockets are used nearly everywhere, but are one of the most severely misunderstood technologies around. This is a 10,000 foot overview of sockets. It's not really a tutorial - you'll still have work to do in getting things operational. It doesn't cover the fine points (and there are a lot of them), but I hope it will give you enough background to begin using them decently.
pt_br: Os soquetes são usados em quase todos os lugares, mas são uma das tecnologias mais mal compreendidas. Esta é uma visão geral contendo 10.000 pontos a respeitos dos soquetes. Não é realmente um tutorial - ainda terás o trabalho para tornar tudo operacionais. Não abrange os pontos finos (e há muitos deles), mas espero que lhe dê uma base suficiente para começar a utilizar de maneira correta.

source: Sockets
pt_br: Soquetes

source: I'm only going to talk about INET (i.e. IPv4) sockets, but they account for at least 99% of the sockets in use. And I'll only talk about STREAM (i.e. TCP) sockets - unless you really know what you're doing (in which case this HOWTO isn't for you!), you'll get better behavior and performance from a STREAM socket than anything else. I will try to clear up the mystery of what a socket is, as well as some hints on how to work with blocking and non-blocking sockets. But I'll start by talking about blocking sockets. You'll need to know how they work before dealing with non-blocking sockets.
pt_br: Só trataremos dos soquetes INET (ou seja, IPv4), no entanto, os mesmos representam ao menos 99% dos soquetes que estão atualmente em uso. Só estudaremos os soquetes STREAM (ou seja, TCP) - a menos que você realmente saiba o que está fazendo (nesse caso, este documento não é para você!), terás um melhor conhecimento sobre o comportamento e o desempenho dos soquetes STREAM do que qualquer outra coisa. Tentarei aclarar o mistério sobre o que realmente é um soquete, bem como, apresentarei dicas de como trabalhar com soquetes bloqueantes e os não bloqueantes. Começaremos o estudo falando da razão pela qual bloquear um soquete. Precisas saber como os mesmos (os soquetes bloqueantes) antes de estudar os não bloqueantes

source: Part of the trouble with understanding these things is that "socket" can mean a number of subtly different things, depending on context. So first, let's make a distinction between a "client" socket - an endpoint of a conversation, and a "server" socket, which is more like a switchboard operator. The client application (your browser, for example) uses "client" sockets exclusively; the web server it's talking to uses both "server" sockets and "client" sockets.
pt_br: Parte do problema em compreender o funcionamento se dá pelo fato de que o "soquete" pode ter significados que são sutilmente diferentes, dependendo do contexto. Então, primeiro, vamos fazer uma distinção entre um soquete "cliente" - o ponto final de uma conversa e um soquete "servidor", que mais parece como um operador de painel. O aplicativo Cliente (seu navegador, por exemplo) usa soquetes "cliente" exclusivos; O servidor Web com o qual conversamos faz uso de soquetes "servidor" e soquetes de "cliente".

source: History
pt_br: História

source: Of the various forms of :abbr:`IPC (Inter Process Communication)`, sockets are by far the most popular. On any given platform, there are likely to be other forms of IPC that are faster, but for cross-platform communication, sockets are about the only game in town.
pt_br: Das várias formas de :abbr:`IPC (Inter Process Communication)`, os soquetes são, de longe, os mais populares. Em qualquer plataforma, muito provável existirão outras formas de IPC que sejam mais rápidas, porém, para a comunicação entre plataformas, os soquetes são sobre o único jogo na cidade.

source: They were invented in Berkeley as part of the BSD flavor of Unix. They spread like wildfire with the internet. With good reason --- the combination of sockets with INET makes talking to arbitrary machines around the world unbelievably easy (at least compared to other schemes).
pt_br: Вони були винайдені в Берклі як частина різновиду BSD Unix. Вони поширюються з Інтернетом як лісова пожежа. З поважною причиною --- поєднання сокетів з INET робить спілкування з довільними машинами по всьому світу неймовірно легким (принаймні порівняно з іншими схемами).

source: Creating a Socket
pt_br: Criando um Soquete

source: Roughly speaking, when you clicked on the link that brought you to this page, your browser did something like the following::
pt_br: De forma geral, quando clicastes no link que te trouxe até esta página (documentação do Python), o que o teu navegador fez, foi o seguinte::

source: When the ``connect`` completes, the socket ``s`` can be used to send in a request for the text of the page. The same socket will read the reply, and then be destroyed. That's right, destroyed. Client sockets are normally only used for one exchange (or a small set of sequential exchanges).
pt_br: Quando a ``connect`` (conexão) foi estabelecida, o soquete ``s`` pode ser utilizado para enviar uma solicitação de texto para a página. O mesmo soquete é que irá ler a resposta e, em seguida, o mesmo será destruído. Isso mesmo, será destruído. Os soquetes de Clientes normalmente são usados apenas numa única transação (troca) (ou um pequeno conjunto sequencial de transações).

source: What happens in the web server is a bit more complex. First, the web server creates a "server socket"::
pt_br: O que acontece no lado do servidor Web é um pouco mais complexo. Primeiro, o Servidor Web cria um "soquete tipo servidor"::

source: A couple things to notice: we used ``socket.gethostname()`` so that the socket would be visible to the outside world. If we had used ``s.bind(('localhost', 80))`` or ``s.bind(('127.0.0.1', 80))`` we would still have a "server" socket, but one that was only visible within the same machine. ``s.bind(('', 80))`` specifies that the socket is reachable by any address the machine happens to have.
pt_br: Algumas coisas que deves observar: usamos ``socket.gethostname()`` para que o soquete esteja visível ao mundo exterior. Se tivéssemos usado ``s.bind(('localhost', 80))`` ou ``s.bind(('127.0.0.1', 80))`` ainda teríamos um soquete do tipo "servidor", mas o mesmo só estaria visível dentro do computador em que está sendo executado. ``s.bind(('', 80))`` determina que o soquete estará acessível por qualquer computador que possuas o endereço IP do computador.

source: A second thing to note: low number ports are usually reserved for "well known" services (HTTP, SNMP etc). If you're playing around, use a nice high number (4 digits).
pt_br: Uma segunda coisa que precisas observar é: as portas baixas, normalmente estão reservadas para serviços "bem conhecidos", tais como (HTTP, SNMP etc). Caso estejas brincando, utilize um número alto (números contendo 4 dígitos).

source: Finally, the argument to ``listen`` tells the socket library that we want it to queue up as many as 5 connect requests (the normal max) before refusing outside connections. If the rest of the code is written properly, that should be plenty.
pt_br: Por fim, o argumento "listen" diz à biblioteca de soquetes que queremos enfileirar no máximo 5 requisições de conexão (normalmente o máximo) antes de recusar começar a recusar conexões externas. Caso o resto do código esteja escrito corretamente, isso deverá ser o suficiente.

source: Now that we have a "server" socket, listening on port 80, we can enter the mainloop of the web server::
pt_br: Agora que temos um soquete tipo "servidor", que está ouvindo a porta 80, podemos entrar no laço de repetição principal do servidor web::

source: There's actually 3 general ways in which this loop could work - dispatching a thread to handle ``clientsocket``, create a new process to handle ``clientsocket``, or restructure this app to use non-blocking sockets, and multiplex between our "server" socket and any active ``clientsocket``\ s using ``select``. More about that later. The important thing to understand now is this: this is *all* a "server" socket does. It doesn't send any data. It doesn't receive any data. It just produces "client" sockets. Each ``clientsocket`` is created in response to some *other* "client" socket doing a ``connect()`` to the host and port we're bound to. As soon as we've created that ``clientsocket``, we go back to listening for more connections. The two "clients" are free to chat it up - they are using some dynamically allocated port which will be recycled when the conversation ends.
pt_br: Na verdade, existem 3 formas gerais nas quais este loop pode ser implementado - despachando um handle que lide com o ``clientsocket``, criando um novo processo que funcione com o ``clientsocket``, ou reestruture o aplicativo para trabalhar com soquetes não bloqueáveis e multiplexar entre os nossos soquetes tipo "servidor" e qualquer ``cliente`` ativo que faça uso do ``select``. Trataremos mais sobre isso posteriormente. O importante que temos que saber neste momento é isso: isso é *tudo* o que um soquete tipo "Servidor" irá fazer. O mesmo não enviar quaisquer dado. Não recebe dados. Apenas produz soquetes "cliente". Cada ``clientsocket`` será criado em resposta a algum *outro* soquete "cliente" que fará uma ``connect()`` ao um determinado host numa determinada porta que estamos vinculados. Será dessa forma que criamos aquele "cliente", voltaremos a ouvir mais conexões. Os dois "clientes" são livres para conversar - eles estão usando uma porta alocada dinamicamente que será descartada quando a conversa terminar.

source: If you need fast IPC between two processes on one machine, you should look into pipes or shared memory. If you do decide to use AF_INET sockets, bind the "server" socket to ``'localhost'``. On most platforms, this will take a shortcut around a couple of layers of network code and be quite a bit faster.
pt_br: Se precisas que o IPC seja rápido entre dois processos numa máquina, deverás procurar por pipes ou compartilhamento de memória. Se decidires usar os soquetes AF_INET, vincule o soquete "servidor" a ``'localhost'```. Na maioria das plataformas, isso levará um atalho em torno de algumas camadas de código de rede e funcionará um pouco mais rápido.

source: The :mod:`multiprocessing` integrates cross-platform IPC into a higher-level API.
pt_br: A módulo :mod:`multiprocessing` faz a integração do IPC de forma multiplataforma numa API de nível mais alto.

source: Using a Socket
pt_br: Usando um Soquete

source: The first thing to note, is that the web browser's "client" socket and the web server's "client" socket are identical beasts. That is, this is a "peer to peer" conversation. Or to put it another way, *as the designer, you will have to decide what the rules of etiquette are for a conversation*. Normally, the ``connect``\ ing socket starts the conversation, by sending in a request, or perhaps a signon. But that's a design decision - it's not a rule of sockets.
pt_br: A primeira coisa que precisamos observar, é que o soquete "cliente" do navegador e o soquete "cliente" do servidor Web são "animais" idênticos. Ou seja, esta é uma conversa "peer to peer". Ou, em outras palavras, *como designer, terás que decidir quais são as regras da etiqueta para uma conversa*. Normalmente, o soquete ``connect``\ ando inicia a conversa, enviando uma solicitação ou talvez um sinal. Mas essa é uma decisão de design - não é uma regra de soquetes.

source: Now there are two sets of verbs to use for communication. You can use ``send`` and ``recv``, or you can transform your client socket into a file-like beast and use ``read`` and ``write``. The latter is the way Java presents its sockets. I'm not going to talk about it here, except to warn you that you need to use ``flush`` on sockets. These are buffered "files", and a common mistake is to ``write`` something, and then ``read`` for a reply. Without a ``flush`` in there, you may wait forever for the reply, because the request may still be in your output buffer.
pt_br: Agora, há dois conjuntos de verbos que podemos usar na comunicação. Podemos usar ``send`` e ``recv``, ou podemos transformar o seu soquete cliente numa "besta" semelhante a um arquivo e usar ``read`` e ``write``. O último é o modo como Java apresenta seus soquetes. Não tratarei disso aqui, exceto para avisar que precisas usar o ``flush`` com soquetes. Estes são "arquivos" em buffer e um erro comum é "escrever" algo e, em seguida, "ler" uma resposta. Sem que haja um ``flush`` lá dentro, poderás esperar eternamente pela resposta, porque o pedido ainda poderá estar no buffer de saída.

source: Now we come to the major stumbling block of sockets - ``send`` and ``recv`` operate on the network buffers. They do not necessarily handle all the bytes you hand them (or expect from them), because their major focus is handling the network buffers. In general, they return when the associated network buffers have been filled (``send``) or emptied (``recv``). They then tell you how many bytes they handled. It is *your* responsibility to call them again until your message has been completely dealt with.
pt_br: Agora, chegamos ao principal obstáculo no uso dos soquetes - ``send`` e ``recv`` operam nos buffers de rede. Eles não lidam necessariamente com todos os bytes que você os entrega (ou esperam deles), porque o foco principal deles é lidar com os buffers de rede. Em geral, os mesmos retornam quando os buffers de rede associados foram preenchidos (``send``) ou esvaziados (``recv``). Eles então lhe dizem quantos bytes eles trataram. É *sua* responsabilidade chamá-los novamente até que a sua mensagem tenha sido completamente tratada.

source: When a ``recv`` returns 0 bytes, it means the other side has closed (or is in the process of closing) the connection. You will not receive any more data on this connection. Ever. You may be able to send data successfully; I'll talk more about this later.
pt_br: Quando um ``recv`` retornar 0 bytes, significa que o outro lado finalizou a conexão (ou está no processo de fechamento) da conexão. Não receberás mais dados nesta conexão. Pra sempre. Poderás enviar dados com sucesso; Falaremos mais sobre isso posteriormente.

source: A protocol like HTTP uses a socket for only one transfer. The client sends a request, then reads a reply. That's it. The socket is discarded. This means that a client can detect the end of the reply by receiving 0 bytes.
pt_br: Um protocolo como o HTTP utiliza um soquete para apenas uma transferência. O cliente envia uma solicitação e depois lê uma resposta. É isso aí. O soquete é descartado. Isso significa que um cliente pode detectar o final da resposta ao receber 0 bytes.

source: But if you plan to reuse your socket for further transfers, you need to realize that *there is no* :abbr:`EOT (End of Transfer)` *on a socket.* I repeat: if a socket ``send`` or ``recv`` returns after handling 0 bytes, the connection has been broken. If the connection has *not* been broken, you may wait on a ``recv`` forever, because the socket will *not* tell you that there's nothing more to read (for now). Now if you think about that a bit, you'll come to realize a fundamental truth of sockets: *messages must either be fixed length* (yuck), *or be delimited* (shrug), *or indicate how long they are* (much better), *or end by shutting down the connection*. The choice is entirely yours, (but some ways are righter than others).
pt_br: Але якщо ви плануєте повторно використовувати свій сокет для подальших передач, ви повинні розуміти, що *немає* :abbr:`EOT (End of Transfer)` *у сокеті*. Я повторюю: якщо сокет ``надсилає`` або ``recv`` повертає після обробки 0 байт, з'єднання було розірвано. Якщо з’єднання *не* розірвано, ви можете чекати ``recv`` вічно, тому що сокет *не* скаже вам, що більше нічого читати (наразі). Тепер, якщо ви трохи подумаєте про це, ви зрозумієте фундаментальну істину сокетів: *повідомлення мають бути фіксованої довжини* (фу), *або бути розділеними* (знизати плечима), *або вказати їхню довжину* (набагато краще), *або закінчити, вимкнувши з’єднання*. Вибір виключно за вами (але деякі шляхи правильніші за інші).

source: Assuming you don't want to end the connection, the simplest solution is a fixed length message::
pt_br: Dengan asumsi Anda tidak ingin mengakhiri koneksi, solusi paling sederhana adalah pesan dengan panjang tetap::

source: The sending code here is usable for almost any messaging scheme - in Python you send strings, and you can use ``len()`` to determine its length (even if it has embedded ``\0`` characters). It's mostly the receiving code that gets more complex. (And in C, it's not much worse, except you can't use ``strlen`` if the message has embedded ``\0``\ s.)
pt_br: Код надсилання тут можна використовувати майже для будь-якої схеми обміну повідомленнями - у Python ви надсилаєте рядки, і ви можете використовувати ``len()``, щоб визначити його довжину (навіть якщо він містить символи ``\0``). Здебільшого код отримання стає складнішим. (У C це не набагато гірше, за винятком того, що ви не можете використовувати ``strlen``, якщо повідомлення містить ``\0``\ s.)

source: The easiest enhancement is to make the first character of the message an indicator of message type, and have the type determine the length. Now you have two ``recv``\ s - the first to get (at least) that first character so you can look up the length, and the second in a loop to get the rest. If you decide to go the delimited route, you'll be receiving in some arbitrary chunk size, (4096 or 8192 is frequently a good match for network buffer sizes), and scanning what you've received for a delimiter.
pt_br: Найпростішим удосконаленням є зробити перший символ повідомлення індикатором типу повідомлення, а тип визначати довжину. Тепер у вас є два ``recv``\ - перший, щоб отримати (принаймні) перший символ, щоб ви могли переглянути довжину, а другий у циклі, щоб отримати решту. Якщо ви вирішите скористатися розмежованим маршрутом, ви отримуватимете довільний розмір фрагмента (4096 або 8192 часто добре підходить для розмірів мережевого буфера) і скануватимете отримане як роздільник.

source: One complication to be aware of: if your conversational protocol allows multiple messages to be sent back to back (without some kind of reply), and you pass ``recv`` an arbitrary chunk size, you may end up reading the start of a following message. You'll need to put that aside and hold onto it, until it's needed.
pt_br: Uma complicação a ter em conta: se o seu protocolo de conversa permitir que várias mensagens sejam enviadas de volta para trás (sem algum tipo de resposta) e você passar ``recv`` um tamanho arbitrário de bloco, você pode acabar lendo o início de uma mensagem seguinte. Você precisará deixar isso de lado e segurá-lo até que seja necessário.

source: Prefixing the message with its length (say, as 5 numeric characters) gets more complex, because (believe it or not), you may not get all 5 characters in one ``recv``. In playing around, you'll get away with it; but in high network loads, your code will very quickly break unless you use two ``recv`` loops - the first to determine the length, the second to get the data part of the message. Nasty. This is also when you'll discover that ``send`` does not always manage to get rid of everything in one pass. And despite having read this, you will eventually get bit by it!
pt_br: Додавання до повідомлення довжини (скажімо, 5 цифрових символів) стає складнішим, оскільки (вірте чи ні), ви можете не отримати всі 5 символів в одному ``recv``. Граючись, ви вийдете з рук; але за високого навантаження на мережу ваш код дуже швидко зламається, якщо ви не використовуєте два цикли ``recv`` - перший для визначення довжини, другий для отримання частини даних повідомлення. Огидно. Тут також ви побачите, що ``send`` не завжди вдається позбутися всього за один прохід. І, незважаючи на те, що ви прочитали це, ви зрештою розчулитесь!

source: In the interests of space, building your character, (and preserving my competitive position), these enhancements are left as an exercise for the reader. Lets move on to cleaning up.
pt_br: Untuk kepentingan ruang, membangun karakter Anda, (dan mempertahankan posisi kompetitif saya), peningkatan ini dibiarkan sebagai latihan bagi pembaca. Mari kita lanjutkan ke pembersihan.

source: Binary Data
pt_br: Dados Binários

source: It is perfectly possible to send binary data over a socket. The major problem is that not all machines use the same formats for binary data. For example, `network byte order <https://en.wikipedia.org/wiki/Endianness#Networking>`_ is big-endian, with the most significant byte first, so a 16 bit integer with the value ``1`` would be the two hex bytes ``00 01``. However, most common processors (x86/AMD64, ARM, RISC-V), are little-endian, with the least significant byte first - that same ``1`` would be ``01 00``.
pt_br: Цілком можливо надсилати двійкові дані через сокет. Основна проблема полягає в тому, що не всі машини використовують однакові формати для двійкових даних. Наприклад, `мережевий порядок байтів <https://en.wikipedia.org/wiki/Endianness#Networking>`_ є старшим байтом, із старшим байтом першим, тому 16-бітове ціле число зі значенням ``1`` буде двома шістнадцятковими байтами ``00 01``. Однак більшість поширених процесорів (x86/AMD64, ARM, RISC-V) мають байт від маленького байта з молодшим байтом першим - той самий ``1`` буде ``01 00``.

source: Socket libraries have calls for converting 16 and 32 bit integers - ``ntohl, htonl, ntohs, htons`` where "n" means *network* and "h" means *host*, "s" means *short* and "l" means *long*. Where network order is host order, these do nothing, but where the machine is byte-reversed, these swap the bytes around appropriately.
pt_br: Бібліотеки сокетів містять виклики для перетворення 16- та 32-розрядних цілих чисел — ``ntohl, htonl, ntohs, htons``, де "n" означає *мережа*, а "h" означає *host*, "s" означає *short* і "l". " означає *довгий*. Там, де мережевий порядок є порядком хостів, вони нічого не роблять, але там, де машина реверсована, байти міняються місцями належним чином.

source: In these days of 64-bit machines, the ASCII representation of binary data is frequently smaller than the binary representation. That's because a surprising amount of the time, most integers have the value 0, or maybe 1. The string ``"0"`` would be two bytes, while a full 64-bit integer would be 8. Of course, this doesn't fit well with fixed-length messages. Decisions, decisions.
pt_br: У наші дні 64-розрядних машин представлення двійкових даних у форматі ASCII часто менше, ніж у двійковому. Це тому, що на диво більшість цілих чисел мають значення 0 або, можливо, 1. Рядок ``"0"`` складатиметься з двох байтів, тоді як повне 64-розрядне ціле число буде 8. Звичайно, це не не підходить для повідомлень фіксованої довжини. Рішення, рішення.

source: Disconnecting
pt_br: Desconectando
