Repository: python/python-docs-pt-br
Catalog: howto/sockets.po
Languages: pt_br

source: Strictly speaking, you're supposed to use ``shutdown`` on a socket before you ``close`` it. The ``shutdown`` is an advisory to the socket at the other end. Depending on the argument you pass it, it can mean "I'm not going to send anymore, but I'll still listen", or "I'm not listening, good riddance!". Most socket libraries, however, are so used to programmers neglecting to use this piece of etiquette that normally a ``close`` is the same as ``shutdown(); close()``. So in most situations, an explicit ``shutdown`` is not needed.
pt_br: Власне кажучи, ви повинні використовувати ``shutdown`` для сокета перед тим, як ``закрити`` його. ``вимкнення`` є порадою для розетки на іншому кінці. Залежно від аргументу, який ви передаєте, це може означати "Я більше не надсилаю, але я все одно вислухаю", або "Я не слухаю, ну добре!". Однак більшість бібліотек сокетів настільки звикли до того, що програмісти нехтують використанням цього правила етикету, що зазвичай ``close`` є таким самим, як ``shutdown(); close()``. Тож у більшості ситуацій явне ``вимкнення`` не потрібне.

source: One way to use ``shutdown`` effectively is in an HTTP-like exchange. The client sends a request and then does a ``shutdown(1)``. This tells the server "This client is done sending, but can still receive." The server can detect "EOF" by a receive of 0 bytes. It can assume it has the complete request. The server sends a reply. If the ``send`` completes successfully then, indeed, the client was still receiving.
pt_br: Один із способів ефективного використання ``shutdown`` - це HTTP-подібний обмін. Клієнт надсилає запит, а потім виконує ``shutdown(1)``. Це повідомляє серверу: "Цей клієнт завершив надсилання, але все ще може отримувати". Сервер може виявити "EOF" за отриманням 0 байтів. Він може вважати, що має повний запит. Сервер надсилає відповідь. Якщо ``надсилання`` завершилося успішно, тоді клієнт справді все ще отримував.

source: Python takes the automatic shutdown a step further, and says that when a socket is garbage collected, it will automatically do a ``close`` if it's needed. But relying on this is a very bad habit. If your socket just disappears without doing a ``close``, the socket at the other end may hang indefinitely, thinking you're just being slow. *Please* ``close`` your sockets when you're done.
pt_br: Python робить автоматичне завершення роботи на крок далі, і каже, що коли сокет збирає сміття, він автоматично виконає ``закриття``, якщо це необхідно. Але покладатися на це – дуже погана звичка. Якщо ваш сокет просто зникне, не виконавши ``закриття``, сокет на іншому кінці може зависнути нескінченно, вважаючи, що ви просто повільні. *Будь ласка* ``закрийте`` свої сокети, коли закінчите.

source: When Sockets Die
pt_br: Quando o Soquete Morre

source: Probably the worst thing about using blocking sockets is what happens when the other side comes down hard (without doing a ``close``). Your socket is likely to hang. TCP is a reliable protocol, and it will wait a long, long time before giving up on a connection. If you're using threads, the entire thread is essentially dead. There's not much you can do about it. As long as you aren't doing something dumb, like holding a lock while doing a blocking read, the thread isn't really consuming much in the way of resources. Do *not* try to kill the thread - part of the reason that threads are more efficient than processes is that they avoid the overhead associated with the automatic recycling of resources. In other words, if you do manage to kill the thread, your whole process is likely to be screwed up.
pt_br: Ймовірно, найгірше у використанні блокування сокетів – це те, що відбувається, коли інша сторона сильно опускається (без виконання ``закриття``). Ваша розетка, швидше за все, зависла. TCP є надійним протоколом, і він чекатиме дуже довго, перш ніж відмовитися від з’єднання. Якщо ви використовуєте потоки, весь потік фактично мертвий. З цим мало що можна зробити. Поки ви не робите щось дурне, наприклад, утримуєте блокування під час виконання блокуючого читання, потік насправді не споживає багато ресурсів. *Не* намагайтеся припинити потік – одна з причин того, що потоки ефективніші за процеси, полягає в тому, що вони уникають накладних витрат, пов’язаних з автоматичною переробкою ресурсів. Іншими словами, якщо вам таки вдасться припинити потік, весь ваш процес, швидше за все, буде зіпсовано.

source: Non-blocking Sockets
pt_br: Soquetes não-bloqueantes

source: If you've understood the preceding, you already know most of what you need to know about the mechanics of using sockets. You'll still use the same calls, in much the same ways. It's just that, if you do it right, your app will be almost inside-out.
pt_br: Якщо ви зрозуміли попереднє, ви вже знаєте більшість того, що вам потрібно знати про механізми використання розеток. Ви й надалі використовуватимете ті самі дзвінки майже тими самими способами. Просто якщо ви зробите це правильно, ваш додаток буде майже навиворіт.

source: In Python, you use ``socket.setblocking(False)`` to make it non-blocking. In C, it's more complex, (for one thing, you'll need to choose between the BSD flavor ``O_NONBLOCK`` and the almost indistinguishable POSIX flavor ``O_NDELAY``, which is completely different from ``TCP_NODELAY``), but it's the exact same idea. You do this after creating the socket, but before using it. (Actually, if you're nuts, you can switch back and forth.)
pt_br: У Python ви використовуєте ``socket.setblocking(False)``, щоб зробити його неблокуючим. У C це складніше (з одного боку, вам потрібно буде вибирати між варіантом BSD ``O_NONBLOCK`` і майже невідмітним варіантом POSIX ``O_NDELAY``, який повністю відрізняється від ``TCP_NODELAY``) , але це та сама ідея. Ви робите це після створення сокета, але перед його використанням. (Насправді, якщо ви божевільні, ви можете перемикатися вперед і назад.)

source: The major mechanical difference is that ``send``, ``recv``, ``connect`` and ``accept`` can return without having done anything. You have (of course) a number of choices. You can check return code and error codes and generally drive yourself crazy. If you don't believe me, try it sometime. Your app will grow large, buggy and suck CPU. So let's skip the brain-dead solutions and do it right.
pt_br: A principal diferença mecânica é que ``send``, ``recv``, ``connect`` e ``accept`` podem retornar sem terem feito nada. Terás (claro) uma série de escolhas. Poderás verificar o código de retorno e os códigos de erro que geralmente nos deixam loucos. Se não acreditas em mim, tente alguma vez. Seu aplicativo vai crescendo, buggy e sugam CPU. Então, vamos ignorar as soluções mortas no cérebro e fazê-lo direito.

source: Use ``select``.
pt_br: Utilize ``select``.

source: In C, coding ``select`` is fairly complex. In Python, it's a piece of cake, but it's close enough to the C version that if you understand ``select`` in Python, you'll have little trouble with it in C::
pt_br: Di C, pengkodean ``select`` cukup kompleks. Dengan Python, ini sangat mudah, tetapi cukup dekat dengan versi C sehingga jika Anda memahami ``select`` dengan Python, Anda akan mengalami sedikit masalah dengan itu di C::

source: You pass ``select`` three lists: the first contains all sockets that you might want to try reading; the second all the sockets you might want to try writing to, and the last (normally left empty) those that you want to check for errors. You should note that a socket can go into more than one list. The ``select`` call is blocking, but you can give it a timeout. This is generally a sensible thing to do - give it a nice long timeout (say a minute) unless you have good reason to do otherwise.
pt_br: Ви передаєте ``select`` три списки: перший містить усі сокети, які ви можете спробувати прочитати; другий – усі сокети, до яких ви можете спробувати записати, а останній (зазвичай залишають порожнім) ті, які ви хочете перевірити на наявність помилок. Зверніть увагу, що сокет може входити до кількох списків. Виклик ``select`` блокується, але ви можете дати йому тайм-аут. Загалом це розумна річ — дайте гарний довгий тайм-аут (скажімо, хвилину), якщо у вас немає вагомих причин для цього.

source: In return, you will get three lists. They contain the sockets that are actually readable, writable and in error. Each of these lists is a subset (possibly empty) of the corresponding list you passed in.
pt_br: Sebagai gantinya, Anda akan mendapatkan tiga daftar. Mereka berisi soket yang sebenarnya dapat dibaca, ditulis dan dalam kesalahan. Setiap daftar ini adalah subset (mungkin kosong) dari daftar terkait yang Anda berikan.

source: If a socket is in the output readable list, you can be as-close-to-certain-as-we-ever-get-in-this-business that a ``recv`` on that socket will return *something*. Same idea for the writable list. You'll be able to send *something*. Maybe not all you want to, but *something* is better than nothing. (Actually, any reasonably healthy socket will return as writable - it just means outbound network buffer space is available.)
pt_br: Якщо сокет є у вихідному списку доступних для читання, ви можете бути настільки ж близькі до впевненості, що ``recv`` для цього сокета поверне *щось*. Така сама ідея для списку доступного для запису. Ви зможете надіслати *щось*. Можливо, не все, що ви хочете, але *щось* краще, ніж нічого. (Насправді, будь-який досить справний сокет повернеться як доступний для запису - це просто означає, що вихідний мережевий буфер доступний.)

source: If you have a "server" socket, put it in the potential_readers list. If it comes out in the readable list, your ``accept`` will (almost certainly) work. If you have created a new socket to ``connect`` to someone else, put it in the potential_writers list. If it shows up in the writable list, you have a decent chance that it has connected.
pt_br: Якщо у вас є "серверний" сокет, додайте його до списку potencial_readers. Якщо він з’явиться у списку доступних для читання, ваш ``accept`` (майже напевно) спрацює. Якщо ви створили новий сокет для ``з’єднання`` з кимось іншим, додайте його до списку potencijal_writers. Якщо він відображається у списку доступних для запису, у вас є пристойний шанс, що він підключився.

source: Actually, ``select`` can be handy even with blocking sockets. It's one way of determining whether you will block - the socket returns as readable when there's something in the buffers. However, this still doesn't help with the problem of determining whether the other end is done, or just busy with something else.
pt_br: Фактично, ``select`` може бути зручним навіть з блокуванням сокетів. Це один із способів визначити, чи будете ви блокувати – сокет повертається як читабельний, коли щось є в буферах. Однак це все ще не допомагає вирішити проблему визначення того, чи інший кінець готовий, чи він просто зайнятий чимось іншим.

source: **Portability alert**: On Unix, ``select`` works both with the sockets and files. Don't try this on Windows. On Windows, ``select`` works with sockets only. Also note that in C, many of the more advanced socket options are done differently on Windows. In fact, on Windows I usually use threads (which work very, very well) with my sockets.
pt_br: **Попередження про переносимість**: в Unix ``select`` працює як з сокетами, так і з файлами. Не пробуйте це на Windows. У Windows ``select`` працює лише з сокетами. Також зауважте, що в C багато розширені параметри сокетів виконуються інакше у Windows. Фактично, у Windows я зазвичай використовую потоки (які дуже, дуже добре працюють) зі своїми сокетами.
