Repository: python/python-docs-pt-br
Catalog: howto/sorting.po
Languages: pt_br

source: Sorting HOW TO
pt_br: HowTo - Ordenação

source: Author
pt_br: Autor

source: Andrew Dalke and Raymond Hettinger
pt_br: Andrew Dalke e Raymond Hettinger

source: Release
pt_br: Versão

source: Python lists have a built-in :meth:`list.sort` method that modifies the list in-place. There is also a :func:`sorted` built-in function that builds a new sorted list from an iterable.
pt_br: As listas em Python possuem um método embutido :meth:`list.sort` que modifica a lista em si. Há também a função embutida :func:`sorted` que constrói uma nova lista ordenada à partir de um iterável.

source: In this document, we explore the various techniques for sorting data using Python.
pt_br: Neste documento, exploramos várias técnicas para ordenar dados utilizando Python.

source: Sorting Basics
pt_br: Básico de Ordenação

source: A simple ascending sort is very easy: just call the :func:`sorted` function. It returns a new sorted list::
pt_br: Uma simples ordenação ascendente é muito fácil: apenas chame a função :func:`sorted`. Isso retornará uma nova lista ordenada::

source: You can also use the :meth:`list.sort` method. It modifies the list in-place (and returns ``None`` to avoid confusion). Usually it's less convenient than :func:`sorted` - but if you don't need the original list, it's slightly more efficient.
pt_br: Você também pode utilizar o método :meth:`list.sort`. Isso modifica a lista em si (e retorna ``None`` para evitar confusão). Usualmente este método é menos conveniente que a função :func:`sorted` - mas se você não precisará da lista original, esta maneira é levemente mais eficiente.

source: Another difference is that the :meth:`list.sort` method is only defined for lists. In contrast, the :func:`sorted` function accepts any iterable.
pt_br: Outra diferença é que o método :meth:`list.sort` é aplicável apenas às listas. Em contrapartida, a função :func:`sorted` aceita qualquer iterável.

source: Key Functions
pt_br: Funções Chave

source: Both :meth:`list.sort` and :func:`sorted` have a *key* parameter to specify a function (or other callable) to be called on each list element prior to making comparisons.
pt_br: Tanto o método :meth:`list.sort` quanto a função :func:`sorted` possuem um parâmetro *key* que especifica uma função (ou outro chamável) a ser chamada para cada elemento da lista antes de ser realizada a comparação.

source: For example, here's a case-insensitive string comparison:
pt_br: Por exemplo, aqui há uma comparação case-insensitive de strings.

source: The value of the *key* parameter should be a function (or other callable) that takes a single argument and returns a key to use for sorting purposes. This technique is fast because the key function is called exactly once for each input record.
pt_br: O valor do parâmetro *key* deve ser uma função (ou outro chamável) que recebe um único argumento e retorna uma chave à ser utilizada com o propósito de ordenação. Esta técnica é rápida porque a função chave é chamada exatamente uma vez para cada entrada de registro.

source: A common pattern is to sort complex objects using some of the object's indices as keys. For example:
pt_br: Uma padrão comum é ordenar objetos complexos utilizando algum índice do objeto como chave. Por exemplo:

source: The same technique works for objects with named attributes. For example:
pt_br: A mesma técnica funciona com objetos que possuem atributos nomeados. Por exemplo:

source: Operator Module Functions
pt_br: Funções do Módulo Operator

source: The key-function patterns shown above are very common, so Python provides convenience functions to make accessor functions easier and faster. The :mod:`operator` module has :func:`~operator.itemgetter`, :func:`~operator.attrgetter`, and a :func:`~operator.methodcaller` function.
pt_br: O padrão de chave-função mostrado acima é muito comum, por isso, Python provê funções convenientes para tornar as funções de acesso mais fáceis e rápidas. O módulo :mod:`operator` tem as funções :func:`~operator.itemgetter`, :func:`~operator.attrgetter`, e :func:`~operator.methodcaller`

source: Using those functions, the above examples become simpler and faster:
pt_br: Usando estas funções, os exemplos acima se tornam mais simples e mais rápidos:

source: The operator module functions allow multiple levels of sorting. For example, to sort by *grade* then by *age*:
pt_br: As funções do módulo operator permite múltiplos níveis de ordenação. Por exemplo, ordenar por *grade* e então por *age*:

source: Ascending and Descending
pt_br: Ascendente e Descendente

source: Both :meth:`list.sort` and :func:`sorted` accept a *reverse* parameter with a boolean value. This is used to flag descending sorts. For example, to get the student data in reverse *age* order:
pt_br: Tanto o método :meth:`list.sort` quanto a função :func:`sorted` aceitam um valor booleano para o parâmetro *reverse*. Essa flag é utilizada para ordenações descendentes. Por exemplo, para retornar os dados de estudantes pela ordem inversa de *age*:

source: Sort Stability and Complex Sorts
pt_br: Estabilidade de Ordenação e Ordenações Complexas

source: Sorts are guaranteed to be `stable <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_\. That means that when multiple records have the same key, their original order is preserved.
pt_br: Ordenações são garantidas de serem `estáveis <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_\. Isso significa que quando múltiplos registros possuem a mesma chave, eles terão sua ordem original preservada.

source: Notice how the two records for *blue* retain their original order so that ``('blue', 1)`` is guaranteed to precede ``('blue', 2)``.
pt_br: Observe como os dois registros de *blue* permanecem em sua ordem original de forma que ``('blue',1)`` é garantido de preceder ``('blue',2)``.

source: This wonderful property lets you build complex sorts in a series of sorting steps. For example, to sort the student data by descending *grade* and then ascending *age*, do the *age* sort first and then sort again using *grade*:
pt_br: Esta maravilhosa propriedade permite que você construa ordenações complexas em uma série de passos de ordenação. Por exemplo, para ordenar os registros de estudante por ordem descendente de *grade* e então ascendente de *age*, primeiro ordene *age* e depois ordene novamente utilizando *grade*:

source: This can be abstracted out into a wrapper function that can take a list and tuples of field and order to sort them on multiple passes.
pt_br: Isso pode ser abstrato no caso das funções encapsuladoras que podem receber uma lista e uma tupla com o campos e então ordená-los em múltiplos passos.

source: The `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ algorithm used in Python does multiple sorts efficiently because it can take advantage of any ordering already present in a dataset.
pt_br: O algoritmo `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ utilizado no Python realiza múltiplas ordenações de maneira eficiente, pois se aproveita de qualquer ordenação já presente no conjunto de dados.

source: The Old Way Using Decorate-Sort-Undecorate
pt_br: A velha maneira utilizando Decorate-Sort-Undecorate

source: This idiom is called Decorate-Sort-Undecorate after its three steps:
pt_br: Esse item idiomático, chamado de Decorate-Sort-Undecorate, é realizado em três passos:

source: First, the initial list is decorated with new values that control the sort order.
pt_br: Primeiro, a lista inicial é decorada com novos valores que controlarão a ordem em que ocorrerá a ordenação

source: Second, the decorated list is sorted.
pt_br: Segundo, a lista decorada é ordenada.

source: Finally, the decorations are removed, creating a list that contains only the initial values in the new order.
pt_br: Finalmente, os valores decorados são removidos, criando uma lista que contém apenas os valores iniciais na nova ordenação.

source: For example, to sort the student data by *grade* using the DSU approach:
pt_br: Por exemplo, para ordenar os dados dos estudantes por *grade* usando a abordagem DSU:

source: This idiom works because tuples are compared lexicographically; the first items are compared; if they are the same then the second items are compared, and so on.
pt_br: Esse padrão idiomático funciona porque tuplas são comparadas lexicograficamente; os primeiros itens são comparados; se eles são semelhantes, então os segundos itens são comparados e assim sucessivamente.

source: It is not strictly necessary in all cases to include the index *i* in the decorated list, but including it gives two benefits:
pt_br: Não é estritamente necessário incluir o índice *i* em todos os casos de listas decoradas, mas fazer assim traz dois benefícios:

source: The sort is stable -- if two items have the same key, their order will be preserved in the sorted list.
pt_br: A ordenação é estável - se dois itens tem a mesma chave, suas ordens serão preservadas na lista ordenada

source: The original items do not have to be comparable because the ordering of the decorated tuples will be determined by at most the first two items. So for example the original list could contain complex numbers which cannot be sorted directly.
pt_br: Os itens originais não precisarão ser comparados porque a ordenação de tuplas decoradas será determinada por no máximo os primeiros dois itens. Então, por exemplo, a lista original poderia conter números complexos que não poderão ser ordenados diretamente.

source: Another name for this idiom is `Schwartzian transform <https://en.wikipedia.org/wiki/Schwartzian_transform>`_\, after Randal L. Schwartz, who popularized it among Perl programmers.
pt_br: Outro nome para este padrão idiomático é `Schwartzian transform <https://en.wikipedia.org/wiki/Schwartzian_transform>`_ de Randal L. Schwartz, que popularizou isto entre os programadores Perl.

source: Now that Python sorting provides key-functions, this technique is not often needed.
pt_br: Agora que a ordenação do Python prevê funções-chave, essa técnica não se faz mais necessária.

source: The Old Way Using the *cmp* Parameter
pt_br: O método antigo utilizando o parâmetro *cmp*

source: Many constructs given in this HOWTO assume Python 2.4 or later. Before that, there was no :func:`sorted` builtin and :meth:`list.sort` took no keyword arguments. Instead, all of the Py2.x versions supported a *cmp* parameter to handle user specified comparison functions.
pt_br: Muitos construtores apresentados neste HOWTO assumem o uso do Python 2.4 ou superior. Antes disso, não havia a função embutida :func:`sorted` e o método :meth:`list.sort` não recebia os argumentos nomeados. Apesar disso, todas as versões do Py2.x suportam o parâmetro *cmp* para lidar com a função de comparação especificada pelo usuário.

source: In Py3.0, the *cmp* parameter was removed entirely (as part of a larger effort to simplify and unify the language, eliminating the conflict between rich comparisons and the :meth:`__cmp__` magic method).
pt_br: No Py3.0, o parâmetro *cmp* foi removido totalmente (como parte de um grande esforço para simplificar e unificar a linguagem, eliminando o conflito entre comparações enriquecidas e o método mágico :meth:`__cmp__`)

source: In Py2.x, sort allowed an optional function which can be called for doing the comparisons. That function should take two arguments to be compared and then return a negative value for less-than, return zero if they are equal, or return a positive value for greater-than. For example, we can do:
pt_br: No Py2.x, ordenação permite uma função opcional que pode ser invocada para fazer comparações. Esta função pode receber dois argumentos para serem comparados e retorna um valor negativo para o menor-que, retorna zero se eles são iguais, ou retorna um valor positivo para o maior-que. Por exemplo, podemos fazer:

source: Or you can reverse the order of comparison with:
pt_br: Ou podemos inverter a ordem de comparação com:

source: When porting code from Python 2.x to 3.x, the situation can arise when you have the user supplying a comparison function and you need to convert that to a key function. The following wrapper makes that easy to do::
pt_br: Quando migrando o código do Python 2.x para o 3.x, pode surgir a situação em que há o usuário suprindo a função de comparação e é necessário converter isso em uma função chave. O seguinte empacotamento torna isso fácil de fazer::

source: To convert to a key function, just wrap the old comparison function:
pt_br: Para converter a função chave, apenas empacote a velha função de comparação:

source: In Python 3.2, the :func:`functools.cmp_to_key` function was added to the :mod:`functools` module in the standard library.
pt_br: No Python 3.2, a função :func:`functools.cmp_to_key` foi adicionada ao módulo :mod:`functools` na biblioteca padrão.

source: Odd and Ends
pt_br: Ímpares e extremidades

source: For locale aware sorting, use :func:`locale.strxfrm` for a key function or :func:`locale.strcoll` for a comparison function.
pt_br: Para ordenação com reconhecimento de localidade, use :func:`locale.strxfrm` para uma função chave ou :func:`locale.strcoll` para uma função de comparação.

source: The *reverse* parameter still maintains sort stability (so that records with equal keys retain the original order). Interestingly, that effect can be simulated without the parameter by using the builtin :func:`reversed` function twice:
pt_br: O parâmetro *reverse* ainda mantém a estabilidade da ordenação (para que os registros com chaves iguais mantenham a ordem original). Curiosamente, esse efeito pode ser simulado sem o parâmetro usando a função embutida :func:`reversed` duas vezes:

source: The sort routines are guaranteed to use :meth:`__lt__` when making comparisons between two objects. So, it is easy to add a standard sort order to a class by defining an :meth:`__lt__` method::
pt_br: As rotinas de ordenação são garantidas para usar :meth:`__lt__` ao fazer comparações entre dois objetos. Portanto, é fácil adicionar uma ordem de ordenação padrão a uma classe, definindo um método :meth:`__lt__`::

source: Key functions need not depend directly on the objects being sorted. A key function can also access external resources. For instance, if the student grades are stored in a dictionary, they can be used to sort a separate list of student names:
pt_br: As funções principais não precisam depender diretamente dos objetos que estão sendo ordenados. Uma função chave também pode acessar recursos externos. Por exemplo, se as notas dos alunos estiverem armazenadas em um dicionário, elas poderão ser usadas para ordenar uma lista separada de nomes de alunos:
