Repository: python/python-docs-pt-br
Catalog: howto/timerfd.po
Languages: pt_br

source: timer file descriptor HOWTO
pt_br: Descritor de arquivo de temporizador

source: Release
pt_br: Versão

source: This HOWTO discusses Python's support for the linux timer file descriptor.
pt_br: Este documento discute o suporte do Python para o descritor de arquivo de temporizador do Linux.

source: Examples
pt_br: Exemplos

source: The following example shows how to use a timer file descriptor to execute a function twice a second:
pt_br: O exemplo a seguir mostra como usar um descritor de arquivo de temporizador para executar uma função duas vezes por segundo:

source: # Practical scripts should use really use a non-blocking timer, # we use a blocking timer here for simplicity. import os, time # Create the timer file descriptor fd = os.timerfd_create(time.CLOCK_REALTIME) # Start the timer in 1 second, with an interval of half a second os.timerfd_settime(fd, initial=1, interval=0.5) try: # Process timer events four times. for _ in range(4): # read() will block until the timer expires _ = os.read(fd, 8) print("Timer expired") finally: # Remember to close the timer file descriptor! os.close(fd)
pt_br: # Scripts práticos devem realmente usar um timer sem bloqueio. # Usamos um timer com bloqueio aqui para simplificar. import os, time # Cria um descritor de arquivo de temporizador fd = os.timerfd_create(time.CLOCK_REALTIME) # Inicia o temporizador em 1 segundo, com um intervalo de meio segundo os.timerfd_settime(fd, initial=1, interval=0.5) try: # Processa eventos do temporizador quatro vezes. for _ in range(4): # read() ser bloqueado até o temporizador expirar _ = os.read(fd, 8) print("Timer expired") finally: # Lembre-se de fechar o descritor de arquivo de temporizador! os.close(fd)

source: To avoid the precision loss caused by the :class:`float` type, timer file descriptors allow specifying initial expiration and interval in integer nanoseconds with ``_ns`` variants of the functions.
pt_br: Para evitar a perda de precisão causada pelo tipo :class:`float`, os descritores de arquivos de temporizador permitem especificar a expiração inicial e o intervalo em nanossegundos inteiros com variantes ``_ns`` das funções.

source: This example shows how :func:`~select.epoll` can be used with timer file descriptors to wait until the file descriptor is ready for reading:
pt_br: Este exemplo mostra como :func:`~select.epoll` pode ser usado com descritores de arquivo de temporizador para esperar até que o descritor de arquivo esteja pronto para leitura:

source: import os, time, select, socket, sys # Create an epoll object ep = select.epoll() # In this example, use loopback address to send "stop" command to the server. # # $ telnet 127.0.0.1 1234 # Trying 127.0.0.1... # Connected to 127.0.0.1. # Escape character is '^]'. # stop # Connection closed by foreign host. # sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM) sock.bind(("127.0.0.1", 1234)) sock.setblocking(False) sock.listen(1) ep.register(sock, select.EPOLLIN) # Create timer file descriptors in non-blocking mode. num = 3 fds = [] for _ in range(num): fd = os.timerfd_create(time.CLOCK_REALTIME, flags=os.TFD_NONBLOCK) fds.append(fd) # Register the timer file descriptor for read events ep.register(fd, select.EPOLLIN) # Start the timer with os.timerfd_settime_ns() in nanoseconds. # Timer 1 fires every 0.25 seconds; timer 2 every 0.5 seconds; etc for i, fd in enumerate(fds, start=1): one_sec_in_nsec = 10**9 i = i * one_sec_in_nsec os.timerfd_settime_ns(fd, initial=i//4, interval=i//4) timeout = 3 try: conn = None is_active = True while is_active: # Wait for the timer to expire for 3 seconds. # epoll.poll() returns a list of (fd, event) pairs. # fd is a file descriptor. # sock and conn[=returned value of socket.accept()] are socket objects, not file descriptors. # So use sock.fileno() and conn.fileno() to get the file descriptors. events = ep.poll(timeout) # If more than one timer file descriptors are ready for reading at once, # epoll.poll() returns a list of (fd, event) pairs. # # In this example settings, # 1st timer fires every 0.25 seconds in 0.25 seconds. (0.25, 0.5, 0.75, 1.0, ...) # 2nd timer every 0.5 seconds in 0.5 seconds. (0.5, 1.0, 1.5, 2.0, ...) # 3rd timer every 0.75 seconds in 0.75 seconds. (0.75, 1.5, 2.25, 3.0, ...) # # In 0.25 seconds, only 1st timer fires. # In 0.5 seconds, 1st timer and 2nd timer fires at once. # In 0.75 seconds, 1st timer and 3rd timer fires at once. # In 1.5 seconds, 1st timer, 2nd timer and 3rd timer fires at once. # # If a timer file descriptor is signaled more than once since # the last os.read() call, os.read() returns the number of signaled # as host order of class bytes. print(f"Signaled events={events}") for fd, event in events: if event & select.EPOLLIN: if fd == sock.fileno(): # Check if there is a connection request. print(f"Accepting connection {fd}") conn, addr = sock.accept() conn.setblocking(False) print(f"Accepted connection {conn} from {addr}") ep.register(conn, select.EPOLLIN) elif conn and fd == conn.fileno(): # Check if there is data to read. print(f"Reading data {fd}") data = conn.recv(1024) if data: # You should catch UnicodeDecodeError exception for safety. cmd = data.decode() if cmd.startswith("stop"): print(f"Stopping server") is_active = False else: print(f"Unknown command: {cmd}") else: # No more data, close connection print(f"Closing connection {fd}") ep.unregister(conn) conn.close() conn = None elif fd in fds: print(f"Reading timer {fd}") count = int.from_bytes(os.read(fd, 8), byteorder=sys.byteorder) print(f"Timer {fds.index(fd) + 1} expired {count} times") else: print(f"Unknown file descriptor {fd}") finally: for fd in fds: ep.unregister(fd) os.close(fd) ep.close()
pt_br: import os, time, select, socket, sys # Cria um objeto epoll ep = select.epoll() # Neste exemplo, usa o endereço de loopback para enviar o comando "stop" ao servidor. # # $ telnet 127.0.0.1 1234 # Trying 127.0.0.1... # Connected to 127.0.0.1. # Escape character is '^]'. # stop # Connection closed by foreign host. # sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM) sock.bind(("127.0.0.1", 1234)) sock.setblocking(False) sock.listen(1) ep.register(sock, select.EPOLLIN) # Cria descritores de arquivo de temporizador no modo não bloqueante. num = 3 fds = [] for _ in range(num): fd = os.timerfd_create(time.CLOCK_REALTIME, flags=os.TFD_NONBLOCK) fds.append(fd) # Registra o descritor de arquivo do temporizador para eventos de leitura ep.register(fd, select.EPOLLIN) # Inicia o temporizador com os.timerfd_settime_ns() em nanossegundos. # O temporizador 1 dispara a cada 0,25 segundos; o timer 2 a cada 0,5 segundos; etc. for i, fd in enumerate(fds, start=1): one_sec_in_nsec = 10**9 i = i * one_sec_in_nsec os.timerfd_settime_ns(fd, initial=i//4, interval=i//4) timeout = 3 try: conn = None is_active = True while is_active: # Aguarda o temporizador expirar por 3 segundos. # epoll.poll() retorna uma lista de pares (fd, event). # fd é um descritor de arquivo. # sock e conn[=valor retornado de socket.accept()] são objetos de socket, não descritores de arquivo. # Então use sock.fileno() e conn.fileno() para obter os descritores de arquivo. events = ep.poll(timeout) # Se mais de um descritor de arquivo de timer estiver pronto para leitura ao mesmo tempo, # epoll.poll() retorna uma lista de pares (fd, event). # # Neste exemplo de configurações, # O 1º temporizador dispara a cada 0,25 segundos em 0,25 segundos. (0,25, 0,5, 0,75, 1,0, ...) # O 2º temporizador dispara a cada 0,5 segundos em 0,5 segundos. (0,5, 1,0, 1,5, 2,0, ...) # O 3º temporizador dispara a cada 0,75 segundos em 0,75 segundos. (0,75, 1,5, 2,25, 3,0, ...) # # Em 0,25 segundos, apenas o 1º temporizador dispara. # Em 0,5 segundos, o 1º temporizador e o 2º temporizador disparam ao mesmo tempo. # Em 0,75 segundos, o 1º temporizador e o 3º temporizador disparam ao mesmo tempo. # Em 1,5 segundos, o 1º temporizador, o 2º temporizador e o 3º temporizador disparam ao mesmo tempo. # # Se um descritor de arquivo de temporizador for sinalizado mais de uma vez desde # a última chamada de os.read(), os.read() retornará o número de sinalizados # como ordem de host de bytes de classe. print(f"Signaled events={events}") for fd, event in events: if event & select.EPOLLIN: if fd == sock.fileno(): # Verifica se há uma requisição de conexão. print(f"Accepting connection {fd}") conn, addr = sock.accept() conn.setblocking(False) print(f"Accepted connection {conn} from {addr}") ep.register(conn, select.EPOLLIN) elif conn and fd == conn.fileno(): # Verifica se há dados para ler. print(f"Reading data {fd}") data = conn.recv(1024) if data: # Você deveria capturar exceção UnicodeDecodeError por segurança. cmd = data.decode() if cmd.startswith("stop"): print(f"Stopping server") is_active = False else: print(f"Unknown command: {cmd}") else: # Acabaram os dados, fecha a conexão print(f"Closing connection {fd}") ep.unregister(conn) conn.close() conn = None elif fd in fds: print(f"Reading timer {fd}") count = int.from_bytes(os.read(fd, 8), byteorder=sys.byteorder) print(f"Timer {fds.index(fd) + 1} expired {count} times") else: print(f"Unknown file descriptor {fd}") finally: for fd in fds: ep.unregister(fd) os.close(fd) ep.close()

source: This example shows how :func:`~select.select` can be used with timer file descriptors to wait until the file descriptor is ready for reading:
pt_br: Este exemplo mostra como :func:`~select.select` pode ser usado com descritores de arquivo de temporizador para esperar até que o descritor de arquivo esteja pronto para leitura:

source: import os, time, select, socket, sys # In this example, use loopback address to send "stop" command to the server. # # $ telnet 127.0.0.1 1234 # Trying 127.0.0.1... # Connected to 127.0.0.1. # Escape character is '^]'. # stop # Connection closed by foreign host. # sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM) sock.bind(("127.0.0.1", 1234)) sock.setblocking(False) sock.listen(1) # Create timer file descriptors in non-blocking mode. num = 3 fds = [os.timerfd_create(time.CLOCK_REALTIME, flags=os.TFD_NONBLOCK) for _ in range(num)] select_fds = fds + [sock] # Start the timers with os.timerfd_settime() in seconds. # Timer 1 fires every 0.25 seconds; timer 2 every 0.5 seconds; etc for i, fd in enumerate(fds, start=1): os.timerfd_settime(fd, initial=i/4, interval=i/4) timeout = 3 try: conn = None is_active = True while is_active: # Wait for the timer to expire for 3 seconds. # select.select() returns a list of file descriptors or objects. rfd, wfd, xfd = select.select(select_fds, select_fds, select_fds, timeout) for fd in rfd: if fd == sock: # Check if there is a connection request. print(f"Accepting connection {fd}") conn, addr = sock.accept() conn.setblocking(False) print(f"Accepted connection {conn} from {addr}") select_fds.append(conn) elif conn and fd == conn: # Check if there is data to read. print(f"Reading data {fd}") data = conn.recv(1024) if data: # You should catch UnicodeDecodeError exception for safety. cmd = data.decode() if cmd.startswith("stop"): print(f"Stopping server") is_active = False else: print(f"Unknown command: {cmd}") else: # No more data, close connection print(f"Closing connection {fd}") select_fds.remove(conn) conn.close() conn = None elif fd in fds: print(f"Reading timer {fd}") count = int.from_bytes(os.read(fd, 8), byteorder=sys.byteorder) print(f"Timer {fds.index(fd) + 1} expired {count} times") else: print(f"Unknown file descriptor {fd}") finally: for fd in fds: os.close(fd) sock.close() sock = None
pt_br: import os, time, select, socket, sys # Neste exemplo, usa o endereço de loopback para enviar o comando "stop" ao servidor. # # $ telnet 127.0.0.1 1234 # Trying 127.0.0.1... # Connected to 127.0.0.1. # Escape character is '^]'. # stop # Connection closed by foreign host. # sock = socket.socket(socket.AF_INET, socket.SOCK_STREAM) sock.bind(("127.0.0.1", 1234)) sock.setblocking(False) sock.listen(1) # Cria descritores de arquivo de temporizador no modo não bloqueante. num = 3 fds = [os.timerfd_create(time.CLOCK_REALTIME, flags=os.TFD_NONBLOCK) for _ in range(num)] select_fds = fds + [sock] # Inicia o temporizador com os.timerfd_settime() em segundos. # O temporizador 1 dispara a cada 0,25 segundos; o timer 2 a cada 0,5 segundos; etc. for i, fd in enumerate(fds, start=1): os.timerfd_settime(fd, initial=i/4, interval=i/4) timeout = 3 try: conn = None is_active = True while is_active: # Aguarda o temporizador expirar por 3 segundos. # select.select() retorna uma lista de objetos ou descritores de arquivos. rfd, wfd, xfd = select.select(select_fds, select_fds, select_fds, timeout) for fd in rfd: if fd == sock: # Verifica se há uma requisição de conexão. print(f"Accepting connection {fd}") conn, addr = sock.accept() conn.setblocking(False) print(f"Accepted connection {conn} from {addr}") select_fds.append(conn) elif conn and fd == conn: # Verifica se há dados para ler. print(f"Reading data {fd}") data = conn.recv(1024) if data: # Você deveria capturar exceção UnicodeDecodeError por segurança. cmd = data.decode() if cmd.startswith("stop"): print(f"Stopping server") is_active = False else: print(f"Unknown command: {cmd}") else: # Acabaram os dados, fecha a conexão print(f"Closing connection {fd}") select_fds.remove(conn) conn.close() conn = None elif fd in fds: print(f"Reading timer {fd}") count = int.from_bytes(os.read(fd, 8), byteorder=sys.byteorder) print(f"Timer {fds.index(fd) + 1} expired {count} times") else: print(f"Unknown file descriptor {fd}") finally: for fd in fds: os.close(fd) sock.close() sock = None
