Repository: python/python-docs-pt-br
Catalog: howto/urllib2.po
Languages: pt_br

source: HOWTO Fetch Internet Resources Using The urllib Package
pt_br: Como buscar recursos da Internet usando o pacote urllib

source: Author
pt_br: Autor

source: Introduction
pt_br: Introdução

source: You may also find useful the following article on fetching web resources with Python:
pt_br: Você também pode achar útil o seguinte artigo na busca de recursos da web com Python:

source: `Basic Authentication <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`_
pt_br: `Autenticação Básica <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`_

source: A tutorial on *Basic Authentication*, with examples in Python.
pt_br: Um tutorial sobre *Autenticação Básica*, com exemplos em Python.

source: **urllib.request** is a Python module for fetching URLs (Uniform Resource Locators). It offers a very simple interface, in the form of the *urlopen* function. This is capable of fetching URLs using a variety of different protocols. It also offers a slightly more complex interface for handling common situations - like basic authentication, cookies, proxies and so on. These are provided by objects called handlers and openers.
pt_br: **urllib.request** é um modulo Python para buscar URLs (Uniform Resource Locators). Ele oferece uma interface muito simples, na forma da função *urlopen*. Este é capaz de buscar URLs usando uma variedade de diferentes protocolos. Ele também oferece uma interface um pouco mais complexa para lidar com situações comuns - como autenticação básica, cookies, proxies e assim por diante. Estes são fornecidos por objetos chamados handlers (manipuladores) e openers (abridores).

source: urllib.request supports fetching URLs for many "URL schemes" (identified by the string before the ``":"`` in URL - for example ``"ftp"`` is the URL scheme of ``"ftp://python.org/"``) using their associated network protocols (e.g. FTP, HTTP). This tutorial focuses on the most common case, HTTP.
pt_br: urllib.request suporta o acesso a URLs por meio de vários "esquemas de URL" (identificados pela string antes de ``":"`` na URL - por exemplo ``"ftp"`` é o esquema de URL em ``"ftp://python.org/"``) usando o protocolo de rede associado a ele (como FTP e HTTP). Este tutorial foca no caso mais comum, HTTP.

source: For straightforward situations *urlopen* is very easy to use. But as soon as you encounter errors or non-trivial cases when opening HTTP URLs, you will need some understanding of the HyperText Transfer Protocol. The most comprehensive and authoritative reference to HTTP is :rfc:`2616`. This is a technical document and not intended to be easy to read. This HOWTO aims to illustrate using *urllib*, with enough detail about HTTP to help you through. It is not intended to replace the :mod:`urllib.request` docs, but is supplementary to them.
pt_br: Para situações simples "urlopen" é muito fácil de usar. Mas assim que você se depara com erros ou casos não triviais ao abrir URLs HTTP, você vai precisar entender um pouco mais do HyperText Transfer Protocol. A literatura de referência mais reconhecida e compreensível para o HTTP é :rfc:`2616`. Ela é um documento técnico e não foi feita para ser fácil de ler. Este documento busca ilustrar o uso de *urllib* com detalhes suficientes sobre HTTP para te permitir seguir adiante. Ele não tem a intenção de substituir a documentação do :mod:`urllib.request`, mas é suplementar a ela.

source: Fetching URLs
pt_br: Acessando URLs

source: The simplest way to use urllib.request is as follows::
pt_br: O modo mais simples de usar urllib.request é o seguinte::

source: If you wish to retrieve a resource via URL and store it in a temporary location, you can do so via the :func:`shutil.copyfileobj` and :func:`tempfile.NamedTemporaryFile` functions::
pt_br: Se você deseja obter um recurso via URL e guardá-lo em uma localização temporária, você pode fazê-lo com as funções :func:`shutil.copyfileobj` e :func:`tempfile.NamedTemporaryFile`::

source: Many uses of urllib will be that simple (note that instead of an 'http:' URL we could have used a URL starting with 'ftp:', 'file:', etc.). However, it's the purpose of this tutorial to explain the more complicated cases, concentrating on HTTP.
pt_br: Muitos usos de urllib são simples assim (repare que ao invés de uma URL 'http:' nós poderíamos ter usado uma string URL começando com 'ftp:', 'file:', etc.).. No entanto, o propósito deste tutorial é explicar casos mais complicados, concentrando em HTTP.

source: HTTP is based on requests and responses - the client makes requests and servers send responses. urllib.request mirrors this with a ``Request`` object which represents the HTTP request you are making. In its simplest form you create a Request object that specifies the URL you want to fetch. Calling ``urlopen`` with this Request object returns a response object for the URL requested. This response is a file-like object, which means you can for example call ``.read()`` on the response::
pt_br: HTTP é baseado em solicitações (requests) e respostas (responses) - o cliente faz solicitações e os servidores mandam respostas. urllib.request espelha isto com um objeto ``Request`` que representa a solicitação HTTP que você está fazendo. Na sua forma mais simples, você cria um objeto Request que especifica a URL que você quer acessar. Chamar ``urlopen`` com este objeto Request retorna um objeto de resposta para a URL solicitada. Essa resposta é um objeto arquivo ou similar, o que significa que você pode, por exemplo, chamar ``.read()`` na resposta::

source: Note that urllib.request makes use of the same Request interface to handle all URL schemes. For example, you can make an FTP request like so::
pt_br: Note que urllib.request usa a mesma interface Request para tratar todos os esquemas URL. Por exemplo, você pode fazer uma solicitação FTP da seguinte forma::

source: In the case of HTTP, there are two extra things that Request objects allow you to do: First, you can pass data to be sent to the server. Second, you can pass extra information ("metadata") *about* the data or about the request itself, to the server - this information is sent as HTTP "headers". Let's look at each of these in turn.
pt_br: No caso do HTTP, há duas coisas extras que os objetos Request permitem que você faça: primeiro, você pode passar dados a serem enviados ao servidor. Segundo, você pode passar informações extras ("metadados") *sobre* os dados ou sobre a própria solicitação para o servidor — essas informações são enviadas como "cabeçalhos" HTTP. Vamos analisar cada um deles separadamente.

source: Data
pt_br: Dados

source: Sometimes you want to send data to a URL (often the URL will refer to a CGI (Common Gateway Interface) script or other web application). With HTTP, this is often done using what's known as a **POST** request. This is often what your browser does when you submit a HTML form that you filled in on the web. Not all POSTs have to come from forms: you can use a POST to transmit arbitrary data to your own application. In the common case of HTML forms, the data needs to be encoded in a standard way, and then passed to the Request object as the ``data`` argument. The encoding is done using a function from the :mod:`urllib.parse` library. ::
pt_br: Às vezes, você deseja enviar dados para uma URL (geralmente a URL se refere a um script CGI (Common Gateway Interface) ou outra aplicação web). Com HTTP, isso geralmente é feito usando o que é conhecido como uma solicitação **POST**. Isso geralmente é o que seu navegador faz quando você envia um formulário HTML preenchido na web. Nem todos os POSTs precisam vir de formulários: você pode usar um POST para transmitir dados arbitrários para sua própria aplicação. No caso comum de formulários HTML, os dados precisam ser codificados de forma padrão e, em seguida, passados para o objeto Request como o argumento ``data``. A codificação é feita usando uma função da biblioteca :mod:`urllib.parse`. ::

source: Note that other encodings are sometimes required (e.g. for file upload from HTML forms - see `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ for more details).
pt_br: Observe que outras codificações às vezes são necessárias (por exemplo, para envio de arquivos de formulários HTML - consulte `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ para mais detalhes).

source: If you do not pass the ``data`` argument, urllib uses a **GET** request. One way in which GET and POST requests differ is that POST requests often have "side-effects": they change the state of the system in some way (for example by placing an order with the website for a hundredweight of tinned spam to be delivered to your door). Though the HTTP standard makes it clear that POSTs are intended to *always* cause side-effects, and GET requests *never* to cause side-effects, nothing prevents a GET request from having side-effects, nor a POST requests from having no side-effects. Data can also be passed in an HTTP GET request by encoding it in the URL itself.
pt_br: Se você não passar o argumento ``data``, o urllib usará uma requisição **GET**. Uma diferença entre requisições GET e POST é que as requisições POST frequentemente têm "efeitos colaterais": elas alteram o estado do sistema de alguma forma (por exemplo, ao fazer um pedido ao site para que cem libras de spam enlatado sejam entregues em sua porta). Embora o padrão HTTP deixe claro que os POSTs devem *sempre* causar efeitos colaterais, e as requisições GET *nunca* causar efeitos colaterais, nada impede que uma requisição GET tenha efeitos colaterais, nem que uma requisição POST não tenha efeitos colaterais. Dados também podem ser passados em uma requisição HTTP GET codificando-os na própria URL.

source: This is done as follows::
pt_br: Isso é feito como abaixo::

source: >>> import urllib.request >>> import urllib.parse >>> data = {} >>> data['name'] = 'Somebody Here' >>> data['location'] = 'Northampton' >>> data['language'] = 'Python' >>> url_values = urllib.parse.urlencode(data) >>> print(url_values) # The order may differ from below. name=Somebody+Here&language=Python&location=Northampton >>> url = 'http://www.example.com/example.cgi' >>> full_url = url + '?' + url_values >>> data = urllib.request.urlopen(full_url)
pt_br: >>> import urllib.request >>> import urllib.parse >>> data = {} >>> data['name'] = 'Alguem Aqui' >>> data['location'] = 'Northampton' >>> data['language'] = 'Python' >>> url_values = urllib.parse.urlencode(data) >>> print(url_values) # A ordem pode ser diferente da abaixo. name=Alguem+Aqui&language=Python&location=Northampton >>> url = 'http://www.example.com/example.cgi' >>> full_url = url + '?' + url_values >>> data = urllib.request.urlopen(full_url)

source: Notice that the full URL is created by adding a ``?`` to the URL, followed by the encoded values.
pt_br: Observe que o URL completo é criado adicionando um ``?`` ao URL, seguido pelos valores codificados.

source: Headers
pt_br: Cabeçalhos

source: We'll discuss here one particular HTTP header, to illustrate how to add headers to your HTTP request.
pt_br: Discutiremos aqui um cabeçalho HTTP específico para ilustrar como adicionar cabeçalhos à sua solicitação HTTP.

source: Some websites [#]_ dislike being browsed by programs, or send different versions to different browsers [#]_. By default urllib identifies itself as ``Python-urllib/x.y`` (where ``x`` and ``y`` are the major and minor version numbers of the Python release, e.g. ``Python-urllib/2.5``), which may confuse the site, or just plain not work. The way a browser identifies itself is through the ``User-Agent`` header [#]_. When you create a Request object you can pass a dictionary of headers in. The following example makes the same request as above, but identifies itself as a version of Internet Explorer [#]_. ::
pt_br: Alguns sites [#]_ não gostam de ser navegados por programas ou enviam versões diferentes para navegadores diferentes [#]_. Por padrão, urllib se identifica como ``Python-urllib/x.y`` (onde ``x`` e ``y`` são os números de versão principal e secundária da versão do Python, por exemplo, ``Python-urllib/2.5``), o que pode confundir o site ou simplesmente não funcionar. A forma como um navegador se identifica é através do cabeçalho ``User-Agent`` [#]_. Ao criar um objeto Request, você pode passar um dicionário de cabeçalhos. O exemplo a seguir faz a mesma solicitação acima, mas se identifica como uma versão do Internet Explorer [#]_. ::

source: The response also has two useful methods. See the section on `info and geturl`_ which comes after we have a look at what happens when things go wrong.
pt_br: A resposta também possui dois métodos úteis. Veja a seção sobre `info e geturl`_, que vem depois de analisarmos o que acontece quando as coisas dão errado.

source: Handling Exceptions
pt_br: Tratamento de exceções

source: *urlopen* raises :exc:`~urllib.error.URLError` when it cannot handle a response (though as usual with Python APIs, built-in exceptions such as :exc:`ValueError`, :exc:`TypeError` etc. may also be raised).
pt_br: *urlopen* levanta :exc:`~urllib.error.URLError` quando não consegue tratar uma resposta (embora, como de costume com APIs Python, exceções embutidas como :exc:`ValueError`, :exc:`TypeError` etc. também possam ser levantadas).

source: :exc:`~urllib.error.HTTPError` is the subclass of :exc:`~urllib.error.URLError` raised in the specific case of HTTP URLs.
pt_br: :exc:`~urllib.error.HTTPError` é a subclasse de :exc:`~urllib.error.URLError` levantada no caso específico de URLs HTTP.

source: The exception classes are exported from the :mod:`urllib.error` module.
pt_br: As classes de exceção são exportadas do módulo :mod:`urllib.error`.

source: Often, URLError is raised because there is no network connection (no route to the specified server), or the specified server doesn't exist. In this case, the exception raised will have a 'reason' attribute, which is a tuple containing an error code and a text error message.
pt_br: Frequentemente, URLError é levantada porque não há conexão de rede (nenhuma rota para o servidor especificado) ou o servidor especificado não existe. Nesse caso, a exceção gerada terá um atributo "reason", que é uma tupla contendo um código de erro e uma mensagem de erro em texto.

source: e.g. ::
pt_br: Por exemplo ::

source: Every HTTP response from the server contains a numeric "status code". Sometimes the status code indicates that the server is unable to fulfil the request. The default handlers will handle some of these responses for you (for example, if the response is a "redirection" that requests the client fetch the document from a different URL, urllib will handle that for you). For those it can't handle, urlopen will raise an :exc:`~urllib.error.HTTPError`. Typical errors include '404' (page not found), '403' (request forbidden), and '401' (authentication required).
pt_br: Cada resposta HTTP do servidor contém um "código de status" numérico. Às vezes, o código de status indica que o servidor não consegue atender à solicitação. Os manipuladores padrão lidarão com algumas dessas respostas para você (por exemplo, se a resposta for um "redirecionamento" que solicita que o cliente busque o documento de uma URL diferente, o urllib cuidará disso para você). Para aquelas que ele não consegue tratar, o urlopen lançará um :exc:`~urllib.error.HTTPError`. Erros típicos incluem '404' (página não encontrada), '403' (solicitação proibida) e '401' (autenticação necessária).

source: See section 10 of :rfc:`2616` for a reference on all the HTTP error codes.
pt_br: Veja a seção 10 de :rfc:`2616` para uma referência sobre todos os códigos de erro HTTP.

source: The :exc:`~urllib.error.HTTPError` instance raised will have an integer 'code' attribute, which corresponds to the error sent by the server.
pt_br: A instância :exc:`~urllib.error.HTTPError` levantada terá um atributo inteiro 'code', que corresponde ao erro enviado pelo servidor.

source: Error Codes
pt_br: Códigos de erro

source: Because the default handlers handle redirects (codes in the 300 range), and codes in the 100--299 range indicate success, you will usually only see error codes in the 400--599 range.
pt_br: Como os tratadores padrão controlam redirecionamentos (códigos no intervalo 300) e códigos no intervalo 100-299 indicam sucesso, normalmente você verá apenas códigos de erro no intervalo 400-599.

source: :attr:`http.server.BaseHTTPRequestHandler.responses` is a useful dictionary of response codes that shows all the response codes used by :rfc:`2616`. An excerpt from the dictionary is shown below ::
pt_br: :attr:`http.server.BaseHTTPRequestHandler.responses` é um dicionário útil de códigos de resposta que mostra todos os códigos de resposta usados por :rfc:`2616`. Um trecho do dicionário é mostrado abaixo ::

source: When an error is raised the server responds by returning an HTTP error code *and* an error page. You can use the :exc:`~urllib.error.HTTPError` instance as a response on the page returned. This means that as well as the code attribute, it also has read, geturl, and info, methods as returned by the ``urllib.response`` module::
pt_br: Quando um erro é levantado, o servidor responde retornando um código de erro HTTP *e* uma página de erro. Você pode usar a instância :exc:`~urllib.error.HTTPError` como resposta na página retornada. Isso significa que, além do atributo code, ela também possui os métodos read, geturl e info, conforme retornados pelo módulo ``urllib.response``::

source: Wrapping it Up
pt_br: Resumindo

source: So if you want to be prepared for :exc:`~urllib.error.HTTPError` *or* :exc:`~urllib.error.URLError` there are two basic approaches. I prefer the second approach.
pt_br: Então, se você quiser se preparar para :exc:`~urllib.error.HTTPError` *ou* :exc:`~urllib.error.URLError`, existem duas abordagens básicas. Eu prefiro a segunda.

source: Number 1
pt_br: Número 1

source: from urllib.request import Request, urlopen from urllib.error import URLError, HTTPError req = Request(someurl) try: response = urlopen(req) except HTTPError as e: print('The server couldn\'t fulfill the request.') print('Error code: ', e.code) except URLError as e: print('We failed to reach a server.') print('Reason: ', e.reason) else: # everything is fine
pt_br: from urllib.request import Request, urlopen from urllib.error import URLError, HTTPError req = Request(someurl) try: response = urlopen(req) except HTTPError as e: print('The server couldn\'t fulfill the request.') print('Error code: ', e.code) except URLError as e: print('We failed to reach a server.') print('Reason: ', e.reason) else: # tudo certo

source: The ``except HTTPError`` *must* come first, otherwise ``except URLError`` will *also* catch an :exc:`~urllib.error.HTTPError`.
pt_br: O ``except HTTPError`` *deve* vir primeiro, caso contrário, ``except URLError`` *também* capturará uma :exc:`~urllib.error.HTTPError`.

source: Number 2
pt_br: Número 2

source: from urllib.request import Request, urlopen from urllib.error import URLError req = Request(someurl) try: response = urlopen(req) except URLError as e: if hasattr(e, 'reason'): print('We failed to reach a server.') print('Reason: ', e.reason) elif hasattr(e, 'code'): print('The server couldn\'t fulfill the request.') print('Error code: ', e.code) else: # everything is fine
pt_br: from urllib.request import Request, urlopen from urllib.error import URLError req = Request(someurl) try: response = urlopen(req) except URLError as e: if hasattr(e, 'reason'): print('We failed to reach a server.') print('Reason: ', e.reason) elif hasattr(e, 'code'): print('The server couldn\'t fulfill the request.') print('Error code: ', e.code) else: # tudo certo

source: info and geturl
pt_br: info e geturl

source: The response returned by urlopen (or the :exc:`~urllib.error.HTTPError` instance) has two useful methods :meth:`!info` and :meth:`!geturl` and is defined in the module :mod:`urllib.response`.
pt_br: A resposta retornada por urlopen (ou a instância :exc:`~urllib.error.HTTPError`) tem dois métodos úteis :meth:`!info` e :meth:`!geturl` e é definida no módulo :mod:`urllib.response`.

source: **geturl** - this returns the real URL of the page fetched. This is useful because ``urlopen`` (or the opener object used) may have followed a redirect. The URL of the page fetched may not be the same as the URL requested.
pt_br: **geturl** - Isso retorna a URL real da página recuperada. Isso é útil porque ``urlopen`` (ou o objeto de abertura utilizado) pode ter seguido um redirecionamento. A URL da página recuperada pode não ser a mesma que a URL solicitada.

source: **info** - this returns a dictionary-like object that describes the page fetched, particularly the headers sent by the server. It is currently an :class:`http.client.HTTPMessage` instance.
pt_br: **info** - Isso retorna um objeto semelhante a um dicionário que descreve a página recuperada, particularmente os cabeçalhos enviados pelo servidor. Atualmente, é uma instância de :class:`http.client.HTTPMessage`.

source: Typical headers include 'Content-length', 'Content-type', and so on. See the `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ for a useful listing of HTTP headers with brief explanations of their meaning and use.
pt_br: Cabeçalhos típicos incluem 'Content-length', 'Content-type' e assim por diante. Consulte a "Referência rápida para cabeçalhos HTTP <https://jkorpela.fi/http.html>" para obter uma lista útil de cabeçalhos HTTP com breves explicações sobre seu significado e uso.

source: Openers and Handlers
pt_br: Abridores e tratadores

source: When you fetch a URL you use an opener (an instance of the perhaps confusingly named :class:`urllib.request.OpenerDirector`). Normally we have been using the default opener - via ``urlopen`` - but you can create custom openers. Openers use handlers. All the "heavy lifting" is done by the handlers. Each handler knows how to open URLs for a particular URL scheme (http, ftp, etc.), or how to handle an aspect of URL opening, for example HTTP redirections or HTTP cookies.
pt_br: Ao buscar uma URL, você usa um abridor (uma instância do talvez confuso nome :class:`urllib.request.OpenerDirector`). Normalmente, usamos o abridor padrão - via ``urlopen`` -, mas você pode criar abridores personalizados. Os abridores usam manipuladores. Todo o "trabalho pesado" é feito pelos manipuladores. Cada manipulador sabe como abrir URLs para um esquema de URL específico (http, ftp, etc.) ou como lidar com um aspecto da abertura de URL, por exemplo, redirecionamentos HTTP ou cookies HTTP.

source: You will want to create openers if you want to fetch URLs with specific handlers installed, for example to get an opener that handles cookies, or to get an opener that does not handle redirections.
pt_br: Você vai querer criar abridores se quiser buscar URLs com manipuladores específicos instalados, por exemplo, para obter um abridor que manipule cookies ou para obter um abridor que não manipule redirecionamentos.

source: To create an opener, instantiate an ``OpenerDirector``, and then call ``.add_handler(some_handler_instance)`` repeatedly.
pt_br: Para criar um abridor, instancie um ``OpenerDirector`` e então chame ``.add_handler(some_handler_instance)`` repetidamente.
