Repository: python/python-docs-pt-br
Catalog: howto/urllib2.po
Languages: pt_br

source: Alternatively, you can use ``build_opener``, which is a convenience function for creating opener objects with a single function call. ``build_opener`` adds several handlers by default, but provides a quick way to add more and/or override the default handlers.
pt_br: Como alternativa, você pode usar ``build_opener``, que é uma função conveniente para criar objetos de abertura com uma única chamada de função. ``build_opener`` adiciona vários tratadores por padrão, mas fornece uma maneira rápida de adicionar mais e/ou substituir os tratadores padrão.

source: Other sorts of handlers you might want to can handle proxies, authentication, and other common but slightly specialised situations.
pt_br: Outros tipos de manipuladores que você pode querer podem lidar com proxies, autenticação e outras situações comuns, mas um pouco especializadas.

source: ``install_opener`` can be used to make an ``opener`` object the (global) default opener. This means that calls to ``urlopen`` will use the opener you have installed.
pt_br: ``install_opener`` pode ser usado para tornar um objeto ``opener`` o abridor padrão (global). Isso significa que chamadas para ``urlopen`` usarão o abridor que você instalou.

source: Opener objects have an ``open`` method, which can be called directly to fetch urls in the same way as the ``urlopen`` function: there's no need to call ``install_opener``, except as a convenience.
pt_br: Objetos abridores têm um método ``open``, que pode ser chamado diretamente para buscar URLs da mesma forma que a função ``urlopen``: não há necessidade de chamar ``install_opener``, exceto por conveniência.

source: Basic Authentication
pt_br: Autenticação básica

source: To illustrate creating and installing a handler we will use the ``HTTPBasicAuthHandler``. For a more detailed discussion of this subject -- including an explanation of how Basic Authentication works - see the `Basic Authentication Tutorial <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.
pt_br: Para ilustrar a criação e instalação de um manipulador, usaremos o ``HTTPBasicAuthHandler``. Para uma discussão mais detalhada sobre este assunto — incluindo uma explicação de como funciona a autenticação básica — consulte este `tutorial de autenticação básica <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.

source: When authentication is required, the server sends a header (as well as the 401 error code) requesting authentication. This specifies the authentication scheme and a 'realm'. The header looks like: ``WWW-Authenticate: SCHEME realm="REALM"``.
pt_br: Quando a autenticação é necessária, o servidor envia um cabeçalho (e o código de erro 401) solicitando autenticação. Isso especifica o esquema de autenticação e um "domínio". O cabeçalho se parece com: ``WWW-Authenticate: SCHEME realm="REALM"``.

source: e.g.
pt_br: Por exemplo:

source: The client should then retry the request with the appropriate name and password for the realm included as a header in the request. This is 'basic authentication'. In order to simplify this process we can create an instance of ``HTTPBasicAuthHandler`` and an opener to use this handler.
pt_br: O cliente deve então tentar a solicitação novamente com o nome e a senha apropriados para o domínio incluídos como cabeçalho na solicitação. Isso é "autenticação básica". Para simplificar esse processo, podemos criar uma instância de ``HTTPBasicAuthHandler`` e um opener para usar esse manipulador.

source: The ``HTTPBasicAuthHandler`` uses an object called a password manager to handle the mapping of URLs and realms to passwords and usernames. If you know what the realm is (from the authentication header sent by the server), then you can use a ``HTTPPasswordMgr``. Frequently one doesn't care what the realm is. In that case, it is convenient to use ``HTTPPasswordMgrWithDefaultRealm``. This allows you to specify a default username and password for a URL. This will be supplied in the absence of you providing an alternative combination for a specific realm. We indicate this by providing ``None`` as the realm argument to the ``add_password`` method.
pt_br: O ``HTTPBasicAuthHandler`` usa um objeto chamado gerenciador de senhas para manipular o mapeamento de URLs e domínios para senhas e nomes de usuário. Se você souber qual é o domínio (a partir do cabeçalho de autenticação enviado pelo servidor), poderá usar um ``HTTPPasswordMgr``. Frequentemente, não importa qual seja o domínio. Nesse caso, é conveniente usar ``HTTPPasswordMgrWithDefaultRealm``. Isso permite que você especifique um nome de usuário e uma senha padrão para uma URL. Isso será fornecido caso você não forneça uma combinação alternativa para um domínio específico. Indicamos isso fornecendo ``None`` como argumento de domínio para o método ``add_password``.

source: The top-level URL is the first URL that requires authentication. URLs "deeper" than the URL you pass to .add_password() will also match. ::
pt_br: A URL de nível superior é a primeira URL que requer autenticação. URLs "mais profundas" que a URL que você passa para .add_password() também corresponderão. ::

source: # create a password manager password_mgr = urllib.request.HTTPPasswordMgrWithDefaultRealm() # Add the username and password. # If we knew the realm, we could use it instead of None. top_level_url = "http://example.com/foo/" password_mgr.add_password(None, top_level_url, username, password) handler = urllib.request.HTTPBasicAuthHandler(password_mgr) # create "opener" (OpenerDirector instance) opener = urllib.request.build_opener(handler) # use the opener to fetch a URL opener.open(a_url) # Install the opener. # Now all calls to urllib.request.urlopen use our opener. urllib.request.install_opener(opener)
pt_br: # cria um gerenciador de senhas password_mgr = urllib.request.HTTPPasswordMgrWithDefaultRealm() # Adiciona o nome de usuário e senha. # Se soubéssemos o realm, poderíamos usá-lo em vez de None. top_level_url = "http://example.com/foo/" password_mgr.add_password(None, top_level_url, username, password) handler = urllib.request.HTTPBasicAuthHandler(password_mgr) # cria um "opener" (OpenerDirector instance) opener = urllib.request.build_opener(handler) # usa o opener para obter uma URL opener.open(a_url) # Instala o opener. # Agora, todas as chamadas a urllib.request.urlopen usam nosso opener. urllib.request.install_opener(opener)

source: In the above example we only supplied our ``HTTPBasicAuthHandler`` to ``build_opener``. By default openers have the handlers for normal situations -- ``ProxyHandler`` (if a proxy setting such as an :envvar:`!http_proxy` environment variable is set), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.
pt_br: No exemplo acima, fornecemos apenas nosso ``HTTPBasicAuthHandler`` para ``build_opener``. Por padrão, os "openers" possuem os manipuladores para situações normais: ``ProxyHandler`` (se uma configuração de proxy, como uma variável de ambiente :envvar:`!http_proxy`, estiver definida), ``UnknownHandler``, ``HTTPHandler``, ``HTTPDefaultErrorHandler``, ``HTTPRedirectHandler``, ``FTPHandler``, ``FileHandler``, ``DataHandler``, ``HTTPErrorProcessor``.

source: ``top_level_url`` is in fact *either* a full URL (including the 'http:' scheme component and the hostname and optionally the port number) e.g. ``"http://example.com/"`` *or* an "authority" (i.e. the hostname, optionally including the port number) e.g. ``"example.com"`` or ``"example.com:8080"`` (the latter example includes a port number). The authority, if present, must NOT contain the "userinfo" component - for example ``"joe:password@example.com"`` is not correct.
pt_br: ``top_level_url`` é, na verdade, *ou* uma URL completa (incluindo o componente do esquema 'http:', o nome do host e, opcionalmente, o número da porta), por exemplo, ``"http://example.com/"``, *ou* uma "autoridade" (ou seja, o nome do host, incluindo, opcionalmente, o número da porta), por exemplo, ``"example.com"`` ou ``"example.com:8080"`` (este último exemplo inclui um número de porta). A autoridade, se presente, NÃO deve conter o componente "userinfo" - por exemplo, ``"joe:senha@example.com"`` não está correto.

source: **urllib** will auto-detect your proxy settings and use those. This is through the ``ProxyHandler``, which is part of the normal handler chain when a proxy setting is detected. Normally that's a good thing, but there are occasions when it may not be helpful [#]_. One way to do this is to setup our own ``ProxyHandler``, with no proxies defined. This is done using similar steps to setting up a `Basic Authentication`_ handler: ::
pt_br: **urllib** detectará automaticamente suas configurações de proxy e as utilizará. Isso ocorre por meio do ``ProxyHandler``, que faz parte da cadeia de manipuladores normal quando uma configuração de proxy é detectada. Normalmente, isso é bom, mas há ocasiões em que pode não ser útil [#]_. Uma maneira de fazer isso é configurar nosso próprio ``ProxyHandler``, sem proxies definidos. Isso é feito seguindo etapas semelhantes à configuração de um manipulador de `autenticação básica`_: ::

source: Currently ``urllib.request`` *does not* support fetching of ``https`` locations through a proxy. However, this can be enabled by extending urllib.request as shown in the recipe [#]_.
pt_br: Atualmente, ``urllib.request`` *não* oferece suporte à busca de locais ``https`` por meio de um proxy. No entanto, isso pode ser habilitado estendendo urllib.request, conforme mostrado na receita [#]_.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
pt_br: ``HTTP_PROXY`` será ignorado se uma variável ``REQUEST_METHOD`` estiver definida; veja a documentação em :func:`~urllib.request.getproxies`.

source: Sockets and Layers
pt_br: Socekts e camadas

source: The Python support for fetching resources from the web is layered. urllib uses the :mod:`http.client` library, which in turn uses the socket library.
pt_br: O suporte do Python para buscar recursos web é em camadas. urllib usa a biblioteca :mod:`http.client`, que por sua vez usa a biblioteca de sockets.

source: As of Python 2.3 you can specify how long a socket should wait for a response before timing out. This can be useful in applications which have to fetch web pages. By default the socket module has *no timeout* and can hang. Currently, the socket timeout is not exposed at the http.client or urllib.request levels. However, you can set the default timeout globally for all sockets using ::
pt_br: A partir do Python 2.3, você pode especificar quanto tempo um soquete deve aguardar por uma resposta antes de atingir o tempo limite. Isso pode ser útil em aplicações que precisam buscar páginas web. Por padrão, o módulo socket *não tem tempo limite* e pode travar. Atualmente, o tempo limite do soquete não é exposto nos níveis http.client ou urllib.request. No entanto, você pode definir o tempo limite padrão globalmente para todos os soquetes usando ::

source: import socket import urllib.request # timeout in seconds timeout = 10 socket.setdefaulttimeout(timeout) # this call to urllib.request.urlopen now uses the default timeout # we have set in the socket module req = urllib.request.Request('http://www.voidspace.org.uk') response = urllib.request.urlopen(req)
pt_br: import socket import urllib.request # tempo limite em secungos timeout = 10 socket.setdefaulttimeout(timeout) # isso chamada a urllib.request.urlopen agora usa o tempo limite padrão # que nós definidos no módulo socket req = urllib.request.Request('http://www.voidspace.org.uk') response = urllib.request.urlopen(req)

source: Footnotes
pt_br: Notas de rodapé

source: This document was reviewed and revised by John Lee.
pt_br: Este documento foi revisado e revisado por John Lee.

source: Google for example.
pt_br: Google, por exemplo.

source: Browser sniffing is a very bad practice for website design - building sites using web standards is much more sensible. Unfortunately a lot of sites still send different versions to different browsers.
pt_br: A detecção de navegadores é uma prática muito ruim para o design de sites; construir sites usando padrões web é muito mais sensato. Infelizmente, muitos sites ainda enviam versões diferentes para navegadores diferentes.

source: The user agent for MSIE 6 is *'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*
pt_br: O user agent para MSIE 6 é *'Mozilla/4.0 (compatível; MSIE 6.0; Windows NT 5.1; SV1; .NET CLR 1.1.4322)'*

source: For details of more HTTP request headers, see `Quick Reference to HTTP Headers`_.
pt_br: Para obter detalhes sobre mais cabeçalhos de solicitação HTTP, consulte `Referência rápida para cabeçalhos HTTP`_.

source: In my case I have to use a proxy to access the internet at work. If you attempt to fetch *localhost* URLs through this proxy it blocks them. IE is set to use the proxy, which urllib picks up on. In order to test scripts with a localhost server, I have to prevent urllib from using the proxy.
pt_br: No meu caso, preciso usar um proxy para acessar a internet no trabalho. Se você tentar buscar URLs *localhost* por meio desse proxy, ele as bloqueia. O IE está configurado para usar o proxy, que o urllib detecta. Para testar scripts com um servidor localhost, preciso impedir que o urllib use o proxy.

source: urllib opener for SSL proxy (CONNECT method): `ASPN Cookbook Recipe <https://code.activestate.com/recipes/456195-urrlib2-opener-for-ssl-proxy-connect-method/>`_.
pt_br: Abridor urllib para proxy SSL (método CONNECT): `Receita do livro de receitas ASPN <https://code.activestate.com/recipes/456195-urrlib2-opener-for-ssl-proxy-connect-method/>`_.
