Repository: python/python-docs-pt-br
Catalog: c-api/arg.po
Languages: pt_br

source: Convert a Python integer to a C :c:expr:`unsigned int`, without overflow checking.
pt_br: Converte um inteiro Python para um :c:expr:`unsigned int` do C, sem verificação de estouro.

source: Convert a Python integer to a C :c:expr:`long int`.
pt_br: Converte um inteiro Python para um :c:expr:`long int` do C.

source: Convert a Python integer to a C :c:expr:`unsigned long` without overflow checking.
pt_br: Converte um inteiro Python para um :c:expr:`unsigned long` do C sem verificação de estouro.

source: Use :meth:`~object.__index__` if available.
pt_br: Usa :meth:`~object.__index__`, se disponível.

source: ``L`` (:class:`int`) [long long]
pt_br: ``L`` (:class:`int`) [longo longo]

source: Convert a Python integer to a C :c:expr:`long long`.
pt_br: Converte um inteiro Python para um :c:expr:`long long` do C.

source: Convert a Python integer to a C :c:expr:`unsigned long long` without overflow checking.
pt_br: Converte um inteiro Python para um :c:expr:`unsigned long long` do C sem verificação de estouro.

source: Convert a Python integer to a C :c:type:`Py_ssize_t`.
pt_br: Converte um inteiro Python para um :c:type:`Py_ssize_t` do C.

source: ``c`` (:class:`bytes` or :class:`bytearray` of length 1) [char]
pt_br: ``c`` (:class:`bytes` ou :class:`bytearray` de comprimento 1) [char]

source: Convert a Python byte, represented as a :class:`bytes` or :class:`bytearray` object of length 1, to a C :c:expr:`char`.
pt_br: Converte um byte Python, representado com um objeto :class:`byte` ou :class:`bytearray` de comprimento 1, para um :c:expr:`char` do C.

source: Allow :class:`bytearray` objects.
pt_br: Permite objetos :class:`bytearray`.

source: ``C`` (:class:`str` of length 1) [int]
pt_br: ``C`` (:class:`str` de comprimento 1) [int]

source: Convert a Python character, represented as a :class:`str` object of length 1, to a C :c:expr:`int`.
pt_br: Converte um caractere Python, representado como uma :class:`str` objeto de comprimento 1, para um :c:expr:`int` do C

source: Convert a Python floating-point number to a C :c:expr:`float`.
pt_br: Converte um número de ponto flutuante Python para um :c:expr:`float` do C.

source: Convert a Python floating-point number to a C :c:expr:`double`.
pt_br: Converte um número de ponto flutuante Python para um :c:expr:`double` do C.

source: Convert a Python complex number to a C :c:type:`Py_complex` structure.
pt_br: Converte um número complexo Python para uma estrutura C :c:type:`Py_complex`

source: Other objects
pt_br: Outros objetos

source: ``O`` (object) [PyObject \*]
pt_br: ``O`` (objeto) [PyObject\*]

source: Store a Python object (without any conversion) in a C object pointer. The C program thus receives the actual object that was passed. A new :term:`strong reference` to the object is not created (i.e. its reference count is not increased). The pointer stored is not ``NULL``.
pt_br: Armazena um objeto Python (sem qualquer conversão) em um ponteiro de objeto C. O programa C então recebe o objeto real que foi passado. Uma nova :term:`referência forte` ao objeto não é criado (isto é sua contagem de referências não é aumentada). O ponteiro armazenado não é ``NULL``.

source: ``O!`` (object) [*typeobject*, PyObject \*]
pt_br: ``O!`` (objeto) [*typeobject*, PyObject \*]

source: Store a Python object in a C object pointer. This is similar to ``O``, but takes two C arguments: the first is the address of a Python type object, the second is the address of the C variable (of type :c:expr:`PyObject*`) into which the object pointer is stored. If the Python object does not have the required type, :exc:`TypeError` is raised.
pt_br: Armazena um objeto Python em um ponteiro de objeto C. Isso é similar a ``O``, mas usa dois argumentos C: o primeiro é o endereço de um objeto do tipo Python, o segundo é um endereço da variável C (de tipo :c:expr:`PyObject*`) no qual o ponteiro do objeto está armazenado. Se o objeto Python não tiver o tipo necessário, :exc:`TypeError` é levantada.

source: ``O&`` (object) [*converter*, *address*]
pt_br: ``O&`` (objeto) [*converter*, *address*]

source: Convert a Python object to a C variable through a *converter* function. This takes two arguments: the first is a function, the second is the address of a C variable (of arbitrary type), converted to :c:expr:`void *`. The *converter* function in turn is called as follows::
pt_br: Converte um objeto Python em uma variável C através de uma função *converter*. Isso leva dois argumentos: o primeiro é a função, o segundo é o endereço da variável C (de tipo arbitrário), convertendo para :c:expr:`void*`. A função *converter* por sua vez, é chamada da seguinte maneira::

source: where *object* is the Python object to be converted and *address* is the :c:expr:`void*` argument that was passed to the ``PyArg_Parse*`` function. The returned *status* should be ``1`` for a successful conversion and ``0`` if the conversion has failed. When the conversion fails, the *converter* function should raise an exception and leave the content of *address* unmodified.
pt_br: onde *object* é o objeto Python a ser convertido e *address* é o argumento :c:expr:`void*` que foi passado para a função ``PyArg_Parse*``. O *status* retornado deve ser ``1`` para uma conversão bem-sucedida e ``0`` se a conversão falhar. Quando a conversão falha, a função *converter* deve levantar uma exceção e deixar o conteúdo de *address* inalterado.

source: If the *converter* returns :c:macro:`!Py_CLEANUP_SUPPORTED`, it may get called a second time if the argument parsing eventually fails, giving the converter a chance to release any memory that it had already allocated. In this second call, the *object* parameter will be ``NULL``; *address* will have the same value as in the original call.
pt_br: Se o *converter* retornar :c:macro:`!Py_CLEANUP_SUPPORTED`, ele poderá ser chamado uma segunda vez se a análise do argumento eventualmente falhar, dando ao conversor a chance de liberar qualquer memória que já havia alocado. Nesta segunda chamada, o parâmetro *object* será ``NULL``; *address* terá o mesmo valor que na chamada original.

source: Examples of converters: :c:func:`PyUnicode_FSConverter` and :c:func:`PyUnicode_FSDecoder`.
pt_br: Exemplos de conversores: :c:func:`PyUnicode_FSConverter` e :c:func:`PyUnicode_FSDecoder`.

source: :c:macro:`!Py_CLEANUP_SUPPORTED` was added.
pt_br: :c:macro:`!Py_CLEANUP_SUPPORTED` foi adicionado.

source: Tests the value passed in for truth (a boolean **p**\ redicate) and converts the result to its equivalent C true/false integer value. Sets the int to ``1`` if the expression was true and ``0`` if it was false. This accepts any valid Python value. See :ref:`truth` for more information about how Python tests values for truth.
pt_br: Testa o valor transmitido para a verdade (um booleano **p**\ redicado) e converte o resultado em seu valor inteiro C verdadeiro/falso equivalente. Define o int como ``1`` se a expressão for verdadeira e ``0`` se for falsa. Isso aceita qualquer valor válido do Python. Veja :ref:`truth` para obter mais informações sobre como o Python testa valores para a verdade.

source: ``(items)`` (sequence) [*matching-items*]
pt_br: ``(items)`` (sequência) [*itens-correspondentes*]

source: The object must be a Python sequence (except :class:`str`, :class:`bytes` or :class:`bytearray`) whose length is the number of format units in *items*. The C arguments must correspond to the individual format units in *items*. Format units for sequences may be nested.
pt_br: O objeto deve ser uma sequência Python (exceto :class:`str`, :class:`bytes` ou :class:`bytearray`) cujo comprimento é o número de unidades de formato em *itens*. Os argumentos C devem corresponder às unidades de formato individuais em *itens*. As unidades de formato para sequências podem ser aninhadas.

source: If *items* contains format units which store a :ref:`borrowed buffer <c-arg-borrowed-buffer>` (``s``, ``s#``, ``z``, ``z#``, ``y``, or ``y#``) or a :term:`borrowed reference` (``S``, ``Y``, ``U``, ``O``, or ``O!``), the object must be a Python tuple. The *converter* for the ``O&`` format unit in *items* must not store a borrowed buffer or a borrowed reference.
pt_br: Se *items* contiver unidades de formato que armazenam um :ref:`buffer emprestado <c-arg-borrowed-buffer>` (``s``, ``s#``, ``z``, ``z#``, ``y`` ou ``y#``) ou uma :term:`referência emprestada` (``S``, ``Y``, ``U``, ``O`` ou ``O!``), o objeto deve ser uma tupla Python. O *conversor* para a unidade de formato ``O&`` em *items* não deve armazenar um buffer emprestado ou uma referência emprestada.

source: :class:`str` and :class:`bytearray` objects no longer accepted as a sequence.
pt_br: Objetos :class:`str` e :class:`bytearray` não são mais aceitos como sequência.

source: Non-tuple sequences are deprecated if *items* contains format units which store a borrowed buffer or a borrowed reference.
pt_br: Sequências não-tuplas serão descontinuadas se *items* contiver unidades de formato que armazenem um buffer emprestado ou uma referência emprestada.

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
pt_br: Alguns outros caracteres possuem significados na string de formatação. Isso pode não ocorrer dentro de parênteses aninhados. Eles são:

source: Indicates that the remaining arguments in the Python argument list are optional. The C variables corresponding to optional arguments should be initialized to their default value --- when an optional argument is not specified, :c:func:`PyArg_ParseTuple` does not touch the contents of the corresponding C variable(s).
pt_br: Indica que os argumentos restantes na lista de argumentos do Python são opcionais. As variáveis C correspondentes a argumentos opcionais devem ser inicializadas para seus valores padrão --- quando um argumento opcional não é especificado, :c:func:`PyArg_ParseTuple` não toca no conteúdo da(s) variável(eis) C correspondente(s).

source: :c:func:`PyArg_ParseTupleAndKeywords` only: Indicates that the remaining arguments in the Python argument list are keyword-only. Currently, all keyword-only arguments must also be optional arguments, so ``|`` must always be specified before ``$`` in the format string.
pt_br: :c:func:`PyArg_ParseTupleAndKeywords` apenas: Indica que os argumentos restantes na lista de argumentos do Python são somente-nomeados. Atualmente, todos os argumentos somente-nomeados devem ser também argumentos opcionais, então ``|`` deve sempre ser especificado antes de ``$`` na string de formatação.

source: The list of format units ends here; the string after the colon is used as the function name in error messages (the "associated value" of the exception that :c:func:`PyArg_ParseTuple` raises).
pt_br: A lista de unidades de formatação acaba aqui; a string após os dois pontos é usada como o nome da função nas mensagens de erro (o "valor associado" da exceção que :c:func:`PyArg_ParseTuple` levanta).

source: The list of format units ends here; the string after the semicolon is used as the error message *instead* of the default error message. ``:`` and ``;`` mutually exclude each other.
pt_br: A lista de unidades de formatação acaba aqui; a string após o ponto e vírgula é usada como a mensagem de erro *ao invés* da mensagem de erro padrão. ``:`` e ``;`` se excluem mutuamente.

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not release them (i.e. do not decrement their reference count)!
pt_br: Note que quaisquer referências a objeto Python que são fornecidas ao chamador são referências *emprestadas*; não libera-as (isto é, não decremente a contagem de referências delas)!

source: Additional arguments passed to these functions must be addresses of variables whose type is determined by the format string; these are used to store values from the input tuple. There are a few cases, as described in the list of format units above, where these parameters are used as input values; they should match what is specified for the corresponding format unit in that case.
pt_br: Argumentos adicionais passados para essas funções devem ser endereços de variáveis cujo tipo é determinado pela string de formatação; estes são usados para armazenar valores vindos da tupla de entrada. Existem alguns casos, como descrito na lista de unidades de formatação acima, onde esses parâmetros são usados como valores de entrada; eles devem concordar com o que é especificado para a unidade de formatação correspondente nesse caso.

source: For the conversion to succeed, the *arg* object must match the format and the format must be exhausted. On success, the ``PyArg_Parse*`` functions return true, otherwise they return false and raise an appropriate exception. When the ``PyArg_Parse*`` functions fail due to conversion failure in one of the format units, the variables at the addresses corresponding to that and the following format units are left untouched.
pt_br: Para a conversão funcionar, o objeto *arg* deve corresponder ao formato e o formato deve estar completo. Em caso de sucesso, as funções ``PyArg_Parse*`` retornam verdadeiro, caso contrário retornam falso e levantam uma exceção apropriada. Quando as funções ``PyArg_Parse*`` falham devido a uma falha de conversão em uma das unidades de formatação, as variáveis nos endereços correspondentes àquela unidade e às unidades de formatação seguintes são deixadas intocadas.

source: API Functions
pt_br: Funções da API

source: Parse the parameters of a function that takes only positional parameters into local variables. Returns true on success; on failure, it returns false and raises the appropriate exception.
pt_br: Analisa os parâmetros de uma função que recebe apenas parâmetros posicionais em variáveis locais. Retorna verdadeiro em caso de sucesso; em caso de falha, retorna falso e levanta a exceção apropriada.

source: Identical to :c:func:`PyArg_ParseTuple`, except that it accepts a va_list rather than a variable number of arguments.
pt_br: Idêntico a :c:func:`PyArg_ParseTuple`, exceto que aceita uma va_list ao invés de um número variável de argumentos.

source: Parse the parameters of a function that takes both positional and keyword parameters into local variables. The *keywords* argument is a ``NULL``-terminated array of keyword parameter names specified as null-terminated ASCII or UTF-8 encoded C strings. Empty names denote :ref:`positional-only parameters <positional-only_parameter>`. Returns true on success; on failure, it returns false and raises the appropriate exception.
pt_br: Analisa os parâmetros de uma função que aceita tanto parâmetros posicionais quando parâmetros nomeados e os converte em variáveis locais. O argumento *keywords* é um array terminado em ``NULL`` de nomes de parâmetros nomeados especificados como strings C codificadas em ASCII ou UTF-8 e terminadas com nulo. Nomes vazios representam :ref:`parâmetros somente-posicional <positional-only_parameter>`. Retorna verdadeiro em caso de sucesso; em caso de falha, retorna falso e levanta a exceção apropriada.

source: The *keywords* parameter declaration is :c:expr:`char * const *` in C and :c:expr:`const char * const *` in C++. This can be overridden with the :c:macro:`PY_CXX_CONST` macro.
pt_br: A declaração do parâmetro *keywords* é :c:expr:`char * const *` em C e :c:expr:`const char * const *` em C++. Isso pode ser substituído com a macro :c:macro:`PY_CXX_CONST`.

source: Added support for :ref:`positional-only parameters <positional-only_parameter>`.
pt_br: Adicionado suporte para :ref:`positional-only parameters <positional-only_parameter>`.

source: The *keywords* parameter has now type :c:expr:`char * const *` in C and :c:expr:`const char * const *` in C++, instead of :c:expr:`char **`. Added support for non-ASCII keyword parameter names.
pt_br: O parâmetro *keywords* é agora do tipo :c:expr:`char * const *` em C e :c:expr:`const char * const *` em C++, no lugar de :c:expr:`char **`. Adicionado suporte para nomes de parâmetros nomeados não-ASCII.

source: Identical to :c:func:`PyArg_ParseTupleAndKeywords`, except that it accepts a va_list rather than a variable number of arguments.
pt_br: Idêntico a :c:func:`PyArg_ParseTupleAndKeywords`, exceto que aceita uma va_list ao invés de um número variável de argumentos.

source: Ensure that the keys in the keywords argument dictionary are strings. This is only needed if :c:func:`PyArg_ParseTupleAndKeywords` is not used, since the latter already does this check.
pt_br: Garante que as chaves no dicionário de argumento de palavras reservadas são strings. Isso só é necessário se :c:func:`PyArg_ParseTupleAndKeywords` não é usado, já que o último já faz essa checagem.

source: Parse the parameter of a function that takes a single positional parameter into a local variable. Returns true on success; on failure, it returns false and raises the appropriate exception.
pt_br: Analisa o parâmetro de uma função que recebe um único parâmetro posicional e o converte em uma variável local. Retorna verdadeiro em caso de sucesso; em caso de falha, retorna falso e levanta a exceção apropriada.

source: Example::
pt_br: Exemplo::

source: // Function using METH_O calling convention static PyObject* my_function(PyObject *module, PyObject *arg) { int value; if (!PyArg_Parse(arg, "i:my_function", &value)) { return NULL; } // ... use value ... }
pt_br: // Função usando a convenção de chamada ao método METH_O static PyObject* my_function(PyObject *module, PyObject *arg) { int value; if (!PyArg_Parse(arg, "i:my_function", &value)) { return NULL; } // ... usar valor ... }

source: A simpler form of parameter retrieval which does not use a format string to specify the types of the arguments. Functions which use this method to retrieve their parameters should be declared as :c:macro:`METH_VARARGS` in function or method tables. The tuple containing the actual parameters should be passed as *args*; it must actually be a tuple. The length of the tuple must be at least *min* and no more than *max*; *min* and *max* may be equal. Additional arguments must be passed to the function, each of which should be a pointer to a :c:expr:`PyObject*` variable; these will be filled in with the values from *args*; they will contain :term:`borrowed references <borrowed reference>`. The variables which correspond to optional parameters not given by *args* will not be filled in; these should be initialized by the caller. This function returns true on success and false if *args* is not a tuple or contains the wrong number of elements; an exception will be set if there was a failure.
pt_br: Uma forma mais simples de recuperação de parâmetro que não usa uma string de formato para especificar os tipos de argumentos. Funções que usam este método para recuperar seus parâmetros devem ser declaradas como :c:macro:`METH_VARARGS` em tabelas de função ou método. A tupla contendo os parâmetros reais deve ser passada como *args*; deve realmente ser uma tupla. O comprimento da tupla deve ser de pelo menos *min* e não mais do que *max*; *min* e *max* podem ser iguais. Argumentos adicionais devem ser passados para a função, cada um dos quais deve ser um ponteiro para uma variável :c:expr:`PyObject*`; eles serão preenchidos com os valores de *args*; eles conterão :term:`referências emprestadas <borrowed reference>`. As variáveis que correspondem a parâmetros opcionais não fornecidos por *args* não serão preenchidas; estes devem ser inicializados pelo chamador. Esta função retorna verdadeiro em caso de sucesso e falso se *args* não for uma tupla ou contiver o número incorreto de elementos; uma exceção será definida se houver uma falha.

source: This is an example of the use of this function, taken from the sources for the :mod:`!_weakref` helper module for weak references::
pt_br: Este é um exemplo do uso dessa função, tirado das fontes do módulo auxiliar para referências fracas :mod:`!_weakref`::

source: The call to :c:func:`PyArg_UnpackTuple` in this example is entirely equivalent to this call to :c:func:`PyArg_ParseTuple`::
pt_br: A chamada à :c:func:`PyArg_UnpackTuple` neste exemplo é inteiramente equivalente à chamada para :c:func:`PyArg_ParseTuple`::

source: The value to be inserted, if any, before :c:expr:`char * const *` in the *keywords* parameter declaration of :c:func:`PyArg_ParseTupleAndKeywords` and :c:func:`PyArg_VaParseTupleAndKeywords`. Default empty for C and ``const`` for C++ (:c:expr:`const char * const *`). To override, define it to the desired value before including :file:`Python.h`.
pt_br: O valor para ser inserido, se houver, antes de :c:expr:`char * const *` na declaração do parâmetro *keywords* das funções :c:func:`PyArg_ParseTupleAndKeywords` e :c:func:`PyArg_VaParseTupleAndKeywords`. Por padrão, é vazio para C e ``const`` for C++ (:c:expr:`const char * const *`). Para substituir, defina o valor desejado antes de incluir :file:`Python.h`.

source: Building values
pt_br: Construindo valores

source: Create a new value based on a format string similar to those accepted by the ``PyArg_Parse*`` family of functions and a sequence of values. Returns the value or ``NULL`` in the case of an error; an exception will be raised if ``NULL`` is returned.
pt_br: Cria um novo valor baseado em uma string de formatação similar àquelas aceitas pela família de funções ``PyArg_Parse*`` e uma sequência de valores. Retorna o valor ou ``NULL`` em caso de erro; uma exceção será levantada se ``NULL`` for retornado.

source: :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
pt_br: :c:func:`Py_BuildValue` não constrói sempre uma tupla. Ela constrói uma tupla apenas se a sua string de formatação contém duas ou mais unidades de formatação. Se a string de formatação estiver vazia, ela retorna ``None``; se ela contém exatamente uma unidade de formatação, ela retorna qualquer que seja o objeto que for descrito pela unidade de formatação. Para forçar ela a retornar uma tupla de tamanho 0 ou um, use parênteses na string de formatação.

source: When memory buffers are passed as parameters to supply data to build objects, as for the ``s`` and ``s#`` formats, the required data is copied. Buffers provided by the caller are never referenced by the objects created by :c:func:`Py_BuildValue`. In other words, if your code invokes :c:func:`malloc` and passes the allocated memory to :c:func:`Py_BuildValue`, your code is responsible for calling :c:func:`free` for that memory once :c:func:`Py_BuildValue` returns.
pt_br: Quando buffers de memória são passados como parâmetros para fornecer dados para construir objetos, como nos formatos ``s`` e ``s#``, os dados necessários são copiados. Buffers fornecidos pelo chamador nunca são referenciados pelos objetos criados por :c:func:`Py_BuildValue`. Em outras palavras, se o seu código invoca :c:func:`malloc` e passa a memória alocada para :c:func:`Py_BuildValue`, seu código é responsável por chamar :c:func:`free` para aquela memória uma vez que :c:func:`Py_BuildValue` tiver retornado.

source: In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that the format unit will return; and the entry in [square] brackets is the type of the C value(s) to be passed.
pt_br: Na descrição a seguir, a forma entre aspas é a unidade de formatação; a entrada em parênteses (arredondado) é o tipo do objeto Python que a unidade de formatação irá retornar; e a entrada em colchetes [quadrado] é o tipo do(s) valor(es) C a ser(em) passado(s).
