Repository: python/python-docs-pt-br
Catalog: c-api/arg.po
Languages: pt_br

source: Parsing arguments and building values
pt_br: Análise de argumentos e construção de valores

source: These functions are useful when creating your own extension functions and methods. Additional information and examples are available in :ref:`extending-index`.
pt_br: Essas funções são úteis ao criar suas próprias funções e métodos de extensão. Informações adicionais e exemplos estão disponíveis em :ref:`extending-index`.

source: The first three of these functions described, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, and :c:func:`PyArg_Parse`, all use *format strings* which are used to tell the function about the expected arguments. The format strings use the same syntax for each of these functions.
pt_br: As três primeiras funções descritas, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, e :c:func:`PyArg_Parse`, todas usam a *string de formatação* que informam à função sobre os argumentos esperados. As strings de formato usam a mesma sintaxe para cada uma dessas funções.

source: Parsing arguments
pt_br: Análise de argumentos

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
pt_br: Uma string de formato consiste em zero ou mais "unidades de formato". Uma unidade de formato descreve um objeto Python; geralmente é um único caractere ou uma sequência entre parênteses de unidades de formato. Com algumas poucas exceções, uma unidade de formato que não é uma sequência entre parênteses normalmente corresponde a um único argumento de endereço para essas funções. Na descrição a seguir, a forma citada é a unidade de formato; a entrada em parênteses ( ) é o tipo de objeto Python que corresponde à unidade de formato; e a entrada em colchetes [ ] é o tipo da variável(s) C cujo endereço deve ser passado.

source: Strings and buffers
pt_br: Strings e buffers

source: On Python 3.12 and older, the macro :c:macro:`!PY_SSIZE_T_CLEAN` must be defined before including :file:`Python.h` to use all ``#`` variants of formats (``s#``, ``y#``, etc.) explained below. This is not necessary on Python 3.13 and later.
pt_br: No Python 3.12 e anteriores, a macro :c:macro:`!PY_SSIZE_T_CLEAN` deve ser definida antes da inclusão de :file:`Python.h` para usar todas as variantes no formato ``#`` (``s#``, ``y#``, etc.) explicadas abaixo. Isso não é necessário no Python 3.13 e posteriores.

source: These formats allow accessing an object as a contiguous chunk of memory. You don't have to provide raw storage for the returned unicode or bytes area.
pt_br: Esses formatos permitem acessar um objeto como um pedaço contíguo de memória. Você não precisa fornecer armazenamento bruto para a área de unicode ou bytes retornada.

source: Unless otherwise stated, buffers are not NUL-terminated.
pt_br: Salvo indicação em contrário, os buffers não são terminados em NUL.

source: There are three ways strings and buffers can be converted to C:
pt_br: Existem três maneiras pelas quais strings e buffers podem ser convertidos em C:

source: Formats such as ``y*`` and ``s*`` fill a :c:type:`Py_buffer` structure. This locks the underlying buffer so that the caller can subsequently use the buffer even inside a :c:type:`Py_BEGIN_ALLOW_THREADS` block without the risk of mutable data being resized or destroyed. As a result, **you have to call** :c:func:`PyBuffer_Release` after you have finished processing the data (or in any early abort case).
pt_br: Formatos como ``y*`` e ``s*`` estão dentro de uma estrutura :c:type:`Py_buffer`. Isso bloqueia o buffer subjacente para que o chamador possa posteriormente usar o buffer, mesmo dentro de um bloco :c:type:`Py_BEGIN_ALLOW_THREADS` sem que haja o risco de que dados mutáveis sejam redimensionados ou destruídos. Dessa forma, **você precisa chamar** :c:func:`PyBuffer_Release` depois de ter concluído o processamento de dados (ou em qualquer caso de interrupção precoce).

source: The ``es``, ``es#``, ``et`` and ``et#`` formats allocate the result buffer. **You have to call** :c:func:`PyMem_Free` after you have finished processing the data (or in any early abort case).
pt_br: Os formatos ``es``, ``es#``, ``et`` e ``et#`` alocam o buffer resultante. **Você precisa chamar** :c:func:`PyMem_Free` depois de ter concluído o processamento de dados (ou em qualquer caso de interrupção precoce).

source: Other formats take a :class:`str` or a read-only :term:`bytes-like object`, such as :class:`bytes`, and provide a ``const char *`` pointer to its buffer. In this case the buffer is "borrowed": it is managed by the corresponding Python object, and shares the lifetime of this object. You won't have to release any memory yourself.
pt_br: Outros formatos usam um :class:`str` ou um :term:`objeto bytes ou similar` somente leitura, como :class:`bytes`, e fornecem um ponteiro ``const char *`` para seu buffer. Nesse caso, o buffer é "emprestado": ele é gerenciado pelo objeto Python correspondente e compartilha o tempo de vida desse objeto. Você mesmo não precisará liberar nenhuma memória.

source: To ensure that the underlying buffer may be safely borrowed, the object's :c:member:`PyBufferProcs.bf_releasebuffer` field must be ``NULL``. This disallows common mutable objects such as :class:`bytearray`, but also some read-only objects such as :class:`memoryview` of :class:`bytes`.
pt_br: Para garantir que o buffer subjacente possa ser emprestado com segurança, o campo :c:member:`PyBufferProcs.bf_releasebuffer` do objeto deve ser ``NULL``. Isso não permite objetos mutáveis comuns, como :class:`bytearray`, mas também alguns objetos somente leitura, como :class:`memoryview` ou :class:`bytes`.

source: Besides this ``bf_releasebuffer`` requirement, there is no check to verify whether the input object is immutable (e.g. whether it would honor a request for a writable buffer, or whether another thread can mutate the data).
pt_br: Além desse requisito ``bf_releasebuffer``, não há nenhuma verificação para saber se o objeto de entrada é imutável (por exemplo, se ele atenderia a uma solicitação de um buffer gravável ou se outro thread pode alterar os dados).

source: Convert a Unicode object to a C pointer to a character string. A pointer to an existing string is stored in the character pointer variable whose address you pass. The C string is NUL-terminated. The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised. Unicode objects are converted to C strings using ``'utf-8'`` encoding. If this conversion fails, a :exc:`UnicodeError` is raised.
pt_br: Converte um objeto Unicode para um ponteiro em C para uma string. Um ponteiro para uma string existente é armazenado na variável do ponteiro do caractere cujo o endereço que você está passando. A string em C é terminada em NULO. A string no Python não deve conter pontos de código nulo embutidos; se isso acontecer, uma exceção :exc:`ValueError` é levantada. Objetos Unicode são convertidos para strings em C usando a codificação ``'utf-8'``. Se essa conversão falhar, uma exceção :exc:`UnicodeError` é levantada.

source: This format does not accept :term:`bytes-like objects <bytes-like object>`. If you want to accept filesystem paths and convert them to C character strings, it is preferable to use the ``O&`` format with :c:func:`PyUnicode_FSConverter` as *converter*.
pt_br: Esse formato não aceita :term:`objetos bytes ou similares <bytes-like object>`. Se você quer aceitar caminhos de sistema de arquivos e convertê-los para strings de caracteres em C, é preferível que use o formato ``O&`` com :c:func:`PyUnicode_FSConverter` como *conversor*.

source: Previously, :exc:`TypeError` was raised when embedded null code points were encountered in the Python string.
pt_br: Anteriormente, a exceção :exc:`TypeError` era levantada quando pontos de código nulo embutidos em string Python eram encontrados.

source: ``s*`` (:class:`str` or :term:`bytes-like object`) [Py_buffer]
pt_br: ``s*`` (:class:`str` ou :term:`objeto bytes ou similar`) [Py_buffer]

source: This format accepts Unicode objects as well as bytes-like objects. It fills a :c:type:`Py_buffer` structure provided by the caller. In this case the resulting C string may contain embedded NUL bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
pt_br: Esse formato aceita tanto objetos Unicode quanto objetos bytes ou similares. Preenche uma estrutura :c:type:`Py_buffer` fornecida pelo chamador. Nesse caso, a string em C resultante pode conter bytes NUL embutidos. Objetos Unicode são convertidos para strings em C usando codificação ``'utf-8'``.

source: ``s#`` (:class:`str`, read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
pt_br: ``s#`` (:class:`str`, :term:`objeto bytes ou similar <bytes-like object>` somente leitura) [const char \*, :c:type:`Py_ssize_t`]

source: Like ``s*``, except that it provides a :ref:`borrowed buffer <c-arg-borrowed-buffer>`. The result is stored into two C variables, the first one a pointer to a C string, the second one its length. The string may contain embedded null bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
pt_br: Como ``s*``, exceto que não fornece um :ref:`buffer emprestado <c-arg-borrowed-buffer>`. O resultado é armazenado em duas variáveis em C, a primeira é um ponteiro para uma string em C, a segunda é o tamanho. A string pode conter bytes nulos embutidos. Objetos Unicode são convertidos para strings em C usando codificação ``'utf-8'``.

source: ``z`` (:class:`str` or ``None``) [const char \*]
pt_br: ``z`` (:class:`str` ou ``None``) [const char \*]

source: ``z*`` (:class:`str`, :term:`bytes-like object` or ``None``) [Py_buffer]
pt_br: ``z*`` (:class:`str`, :term:`objeto bytes ou similar` ou ``None``) [Py_buffer]

source: ``z#`` (:class:`str`, read-only :term:`bytes-like object` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
pt_br: ``z#`` (:class:`str`, :term:`objeto bytes ou similar` somente leitura ou ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: ``y`` (read-only :term:`bytes-like object`) [const char \*]
pt_br: ``y`` (:term:`objeto bytes ou similar` somente leitura) [const char \*]

source: This format converts a bytes-like object to a C pointer to a :ref:`borrowed <c-arg-borrowed-buffer>` character string; it does not accept Unicode objects. The bytes buffer must not contain embedded null bytes; if it does, a :exc:`ValueError` exception is raised.
pt_br: Este formato converte um objeto bytes ou similar para um ponteiro C para uma string de caracteres :ref:`emprestada <c-arg-borrowed-buffer>`; não aceita objetos Unicode. O buffer de bytes não pode conter bytes nulos embutidos; se isso ocorrer uma exceção :exc:`ValueError` será levantada.

source: Previously, :exc:`TypeError` was raised when embedded null bytes were encountered in the bytes buffer.
pt_br: Anteriormente, a exceção :exc:`TypeError` era levantada quando pontos de código nulo embutidos em string Python eram encontrados no buffer de bytes.

source: ``y*`` (:term:`bytes-like object`) [Py_buffer]
pt_br: ``y*`` (:term:`objeto bytes ou similar`) [Py_buffer]

source: This variant on ``s*`` doesn't accept Unicode objects, only bytes-like objects. **This is the recommended way to accept binary data.**
pt_br: Esta variante em ``s*`` não aceita objetos unicode, apenas objetos bytes ou similares. **Esta é a maneira recomendada para aceitar dados binários.**

source: ``y#`` (read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
pt_br: ``y#`` (:term:`objeto bytes ou similar` somente leitura) [const char \*, :c:type:`Py_ssize_t`]

source: This variant on ``s#`` doesn't accept Unicode objects, only bytes-like objects.
pt_br: Esta variação de ``s#`` não aceita objetos Unicode, apenas objetos bytes ou similares.

source: Requires that the Python object is a :class:`bytes` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a bytes object. The C variable may also be declared as :c:expr:`PyObject*`.
pt_br: Exige que o objeto Python seja um objeto :class:`bytes`, sem tentar nenhuma conversão. Levanta :exc:`TypeError` se o objeto não for um objeto byte. A variável C pode ser declarada como :c:expr:`PyObject*`.

source: Requires that the Python object is a :class:`bytearray` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a :class:`bytearray` object. The C variable may also be declared as :c:expr:`PyObject*`.
pt_br: Exige que o objeto Python seja um objeto :class:`bytearray`, sem aceitar qualquer conversão. Levanta :exc:`TypeError` se o objeto não é um objeto :class:`bytearray`. A variável C apenas pode ser declarada como :c:expr:`PyObject*`.

source: Requires that the Python object is a Unicode object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a Unicode object. The C variable may also be declared as :c:expr:`PyObject*`.
pt_br: Exige que o objeto python seja um objeto Unicode, sem tentar alguma conversão. Levanta :exc:`TypeError` se o objeto não for um objeto Unicode. A variável C deve ser declarada como :c:expr:`PyObject*`.

source: ``w*`` (read-write :term:`bytes-like object`) [Py_buffer]
pt_br: ``w*`` (:term:`objeto bytes ou similar` de leitura e escrita) [Py_buffer]

source: This format accepts any object which implements the read-write buffer interface. It fills a :c:type:`Py_buffer` structure provided by the caller. The buffer may contain embedded null bytes. The caller have to call :c:func:`PyBuffer_Release` when it is done with the buffer.
pt_br: Este formato aceita qualquer objeto que implemente a interface do buffer de leitura e escrita. Ele preenche uma estrutura :c:type:`Py_buffer` fornecida pelo chamador. O buffer pode conter bytes nulos incorporados. O chamador deve chamar :c:func:`PyBuffer_Release` quando isso for feito com o buffer.

source: This variant on ``s`` is used for encoding Unicode into a character buffer. It only works for encoded data without embedded NUL bytes.
pt_br: Esta variante em ``s`` é utilizada para codificação do Unicode em um buffer de caracteres. Ele só funciona para dados codificados sem NUL bytes incorporados.

source: This format requires two arguments. The first is only used as input, and must be a :c:expr:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:expr:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument.
pt_br: Este formato exige dois argumentos. O primeiro é usado apenas como entrada e deve ser a :c:expr:`const char*` que aponta para o nome de uma codificação como uma string terminada em NUL ou ``NULL``, nesse caso a codificação ``'utf-8'`` é usada. Uma exceção é levantada se a codificação nomeada não for conhecida pelo Python. O segundo argumento deve ser um :c:expr:`char**`; o valor do ponteiro a que ele faz referência será definido como um buffer com o conteúdo do texto do argumento. O texto será codificado na codificação especificada pelo primeiro argumento.

source: :c:func:`PyArg_ParseTuple` will allocate a buffer of the needed size, copy the encoded data into this buffer and adjust *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after use.
pt_br: :c:func:`PyArg_ParseTuple` alocará um buffer do tamanho necessário, copiará os dados codificados nesse buffer e ajustará *\*buffer* para referenciar o armazenamento recém-alocado. O chamador é responsável por chamar :c:func:`PyMem_Free` para liberar o buffer alocado após o uso.

source: ``et`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer]
pt_br: ``et`` (:class:`str`, :class:`bytes` ou :class:`bytearray`) [const char \*encoding, char \*\*buffer]

source: Same as ``es`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
pt_br: O mesmo que ``es``, exceto que os objetos strings de bytes são passados sem os recodificar. Em vez disso, a implementação presume que o objeto string de bytes usa a codificação passada como parâmetro.

source: This variant on ``s#`` is used for encoding Unicode into a character buffer. Unlike the ``es`` format, this variant allows input data which contains NUL characters.
pt_br: Essa variante em ``s#`` é usada para codificar Unicode em um buffer de caracteres. Diferente do formato ``es``, essa variante permite a entrada de dados que contêm caracteres NUL.

source: It requires three arguments. The first is only used as input, and must be a :c:expr:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:expr:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument. The third argument must be a pointer to an integer; the referenced integer will be set to the number of bytes in the output buffer.
pt_br: Exige três argumentos. O primeiro é usado apenas como entrada e deve ser a :c:expr:`const char*` que aponta para o nome de uma codificação como uma string terminada em NUL ou ``NULL``, nesse caso a codificação ``'utf-8'`` é usada. Uma exceção será gerada se a codificação nomeada não for conhecida pelo Python. O segundo argumento deve ser um :c:expr:`char**`; o valor do ponteiro a que ele faz referência será definido como um buffer com o conteúdo do texto do argumento. O texto será codificado na codificação especificada pelo primeiro argumento. O terceiro argumento deve ser um ponteiro para um número inteiro; o número inteiro referenciado será definido como o número de bytes no buffer de saída.

source: There are two modes of operation:
pt_br: Há dois modos de operação:

source: If *\*buffer* points a ``NULL`` pointer, the function will allocate a buffer of the needed size, copy the encoded data into this buffer and set *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after usage.
pt_br: Se *\*buffer* apontar um ponteiro ``NULL``, a função irá alocar um buffer do tamanho necessário, copiar os dados codificados para dentro desse buffer e configurar *\*buffer* para referenciar o novo armazenamento alocado. O chamador é responsável por chamar :c:func:`PyMem_Free` para liberar o buffer alocado após o uso.

source: If *\*buffer* points to a non-``NULL`` pointer (an already allocated buffer), :c:func:`PyArg_ParseTuple` will use this location as the buffer and interpret the initial value of *\*buffer_length* as the buffer size. It will then copy the encoded data into the buffer and NUL-terminate it. If the buffer is not large enough, a :exc:`ValueError` will be set.
pt_br: Se *\*buffer* apontar para um ponteiro que não seja ``NULL`` (um buffer já alocado), :c:func:`PyArg_ParseTuple` irá usar essa localização como buffer e interpretar o valor inicial de *\*buffer_length* como sendo o tamanho do buffer. Depois ela vai copiar os dados codificados para dentro do buffer e terminá-lo com NUL. Se o buffer não for suficientemente grande, um :exc:`ValueError` será definido.

source: In both cases, *\*buffer_length* is set to the length of the encoded data without the trailing NUL byte.
pt_br: Em ambos os casos, o *\*buffer_length* é definido como o comprimento dos dados codificados sem o byte NUL à direita.

source: ``et#`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]
pt_br: ``et#`` (:class:`str`, :class:`bytes` ou :class:`bytearray`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]

source: Same as ``es#`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
pt_br: O mesmo que ``es#``, exceto que os objetos strings de bytes são passados sem que sejam recodificados. Em vez disso, a implementação presume que o objeto string de bytes usa a codificação passada como parâmetro.

source: ``u``, ``u#``, ``Z``, and ``Z#`` are removed because they used a legacy ``Py_UNICODE*`` representation.
pt_br: ``u``, ``u#``, ``Z`` e ``Z#`` foram removidos porque usavam uma representação herdada de ``Py_UNICODE*``.

source: Numbers
pt_br: Números

source: These formats allow representing Python numbers or single characters as C numbers. Formats that require :class:`int`, :class:`float` or :class:`complex` can also use the corresponding special methods :meth:`~object.__index__`, :meth:`~object.__float__` or :meth:`~object.__complex__` to convert the Python object to the required type.
pt_br: Esses formatos permitem representar números Python ou caracteres únicos como números C. Formatos que exigem :class:`int`, :class:`float` ou :class:`complex` também podem usar os métodos especiais correspondentes :meth:`~object.__index__`, :meth:`~object.__float__` ou :meth:`~object.__complex__` para converter o objeto Python para o tipo necessário.

source: For signed integer formats, :exc:`OverflowError` is raised if the value is out of range for the C type. For unsigned integer formats, no range checking is done --- the most significant bits are silently truncated when the receiving field is too small to receive the value.
pt_br: Para formatos inteiros com sinal, :exc:`OverflowError` é levantada se o valor estiver fora do intervalo para o tipo C. Para formatos inteiros não assinados, nenhuma verificação de intervalo é feita --- os bits mais significativos são silenciosamente truncados quando o campo de recebimento é muito pequeno para receber o valor.

source: Convert a nonnegative Python integer to an unsigned tiny integer, stored in a C :c:expr:`unsigned char`.
pt_br: Converte um inteiro Python não negativo em um inteiro pequeno sem sinal (unsigned tiny integer), armazenado em um :c:expr:`unsigned char` do C.

source: Convert a Python integer to a tiny integer without overflow checking, stored in a C :c:expr:`unsigned char`.
pt_br: Converte um inteiro Python para um inteiro pequeno (tiny integer) sem verificação de estouro, armazenado em um :c:expr:`unsigned char` do C.

source: Convert a Python integer to a C :c:expr:`short int`.
pt_br: Converte um inteiro Python para um :c:expr:`short int` do C.

source: Convert a Python integer to a C :c:expr:`unsigned short int`, without overflow checking.
pt_br: Converte um inteiro Python para um :c:expr:`unsigned short int` do C, sem verificação de estouro.

source: Convert a Python integer to a plain C :c:expr:`int`.
pt_br: Converte um inteiro Python para um :c:expr:`int` simples do C.
