Repository: python/python-docs-pt-br
Catalog: c-api/arg.po
Languages: pt_br

source: The characters space, tab, colon and comma are ignored in format strings (but not within format units such as ``s#``). This can be used to make long format strings a tad more readable.
pt_br: Os caracteres de espaço, tab, dois pontos e vírgula são ignorados em strings de formatação (mas não dentro de unidades de formatação como ``s#``). Isso pode ser usado para tornar strings de formatação longas um pouco mais legíveis.

source: ``s`` (:class:`str` or ``None``) [const char \*]
pt_br: ``s`` (:class:`str` ou ``None``) [const char \*]

source: Convert a null-terminated C string to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, ``None`` is used.
pt_br: Converte uma string C terminada em NULL em um objeto Python :class:`str` usando codificação ``'utf-8'``. Se o ponteiro da string C é ``NULL``, ``None`` é usado.

source: ``s#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
pt_br: ``s#`` (:class:`str` ou ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Convert a C string and its length to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, the length is ignored and ``None`` is returned.
pt_br: Converte uma string C e seu comprimento em um objeto Python :class:`str` usando a codificação ``'utf-8'``. Se o ponteiro da string C é ``NULL``, o comprimento é ignorado e ``None`` é retornado.

source: This converts a C string to a Python :class:`bytes` object. If the C string pointer is ``NULL``, ``None`` is returned.
pt_br: Isso converte uma string C para um objeto Python :class:`bytes`. Se o ponteiro da string C é ``NULL``, ``None`` é retornado.

source: This converts a C string and its lengths to a Python object. If the C string pointer is ``NULL``, ``None`` is returned.
pt_br: Isso converte uma string C e seu comprimento para um objeto Python. Se o ponteiro da string C é ``NULL``, ``None`` é retornado.

source: Same as ``s``.
pt_br: O mesmo de ``s``.

source: ``z#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
pt_br: ``z#`` (:class:`str` ou ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Same as ``s#``.
pt_br: O mesmo de ``s#``.

source: Convert a null-terminated :c:type:`wchar_t` buffer of Unicode (UTF-16 or UCS-4) data to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, ``None`` is returned.
pt_br: Converte um buffer terminado por null :c:type:`wchar_t` de dados Unicode (UTF-16 ou UCS-4) para um objeto Python Unicode. Se o ponteiro do buffer Unicode é ``NULL``, ``None`` é retornado.

source: Convert a Unicode (UTF-16 or UCS-4) data buffer and its length to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, the length is ignored and ``None`` is returned.
pt_br: Converte um buffer de dados Unicode (UTF-17 ou UCS-4) e seu comprimento em um objeto Python Unicode. Se o ponteiro do buffer Unicode é ``NULL``, o comprimento é ignorado e ``None`` é retornado.

source: ``U`` (:class:`str` or ``None``) [const char \*]
pt_br: ``U`` (:class:`str` ou ``None``) [const char \*]

source: ``U#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
pt_br: ``U#`` (:class:`str` ou ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Convert a plain C :c:expr:`int` to a Python integer object.
pt_br: Converte um simples :c:expr:`int` do C em um objeto inteiro do Python.

source: Convert a plain C :c:expr:`char` to a Python integer object.
pt_br: Converte um simples :c:expr:`char` do C em um objeto inteiro do Python.

source: Convert a plain C :c:expr:`short int` to a Python integer object.
pt_br: Converte um simples :c:expr:`short int` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`long int` to a Python integer object.
pt_br: Converte um :c:expr:`long int` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`unsigned char` to a Python integer object.
pt_br: Converte um :c:expr:`unsigned char` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`unsigned short int` to a Python integer object.
pt_br: Converte um :c:expr:`unsigned short int` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`unsigned int` to a Python integer object.
pt_br: Converte um :c:expr:`unsigned int` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`unsigned long` to a Python integer object.
pt_br: Converte um :c:expr:`unsigned long` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`long long` to a Python integer object.
pt_br: Converte um :c:expr:`long long` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`unsigned long long` to a Python integer object.
pt_br: Converte um :c:expr:`unsigned long long` do C em um objeto inteiro do Python.

source: Convert a C :c:type:`Py_ssize_t` to a Python integer.
pt_br: Converte um :c:type:`Py_ssize_t` do C em um objeto inteiro do Python.

source: Convert a C :c:expr:`int` to a Python :class:`bool` object.
pt_br: Converte um :c:expr:`int` C para um objeto :class:`bool` Python.

source: Be aware that this format requires an ``int`` argument. Unlike most other contexts in C, variadic arguments are not coerced to a suitable type automatically. You can convert another type (for example, a pointer or a float) to a suitable ``int`` value using ``(x) ? 1 : 0`` or ``!!x``.
pt_br: Esteja ciente de que este formato requer um argumento ``int``. Ao contrário da maioria dos outros contextos em C, argumentos variádicos não são convertidos automaticamente para um tipo adequado. Você pode converter outro tipo (por exemplo, um ponteiro ou um float) para um valor ``int`` adequado usando ``(x) ? 1 : 0`` ou ``!!x``.

source: ``c`` (:class:`bytes` of length 1) [char]
pt_br: ``c`` (:class:`bytes` de comprimento 1) [char]

source: Convert a C :c:expr:`int` representing a byte to a Python :class:`bytes` object of length 1.
pt_br: Converte um :c:expr:`int` representando um byte do C em um objeto :class:`bytes` de comprimento 1 do Python.

source: Convert a C :c:expr:`int` representing a character to Python :class:`str` object of length 1.
pt_br: Converte um :c:expr:`int` representando um caractere do C em um objeto :class:`str` de comprimento 1 do Python.

source: Convert a C :c:expr:`double` to a Python floating-point number.
pt_br: Converte um :c:expr:`double` do C em um número ponto flutuante do Python.

source: Convert a C :c:expr:`float` to a Python floating-point number.
pt_br: Converte um :c:expr:`float` do C em um número ponto flutuante do Python.

source: Convert a C :c:type:`Py_complex` structure to a Python complex number.
pt_br: Converte uma estrutura :c:type:`Py_complex` do C em um número complexo do Python.

source: Pass a Python object untouched but create a new :term:`strong reference` to it (i.e. its reference count is incremented by one). If the object passed in is a ``NULL`` pointer, it is assumed that this was caused because the call producing the argument found an error and set an exception. Therefore, :c:func:`Py_BuildValue` will return ``NULL`` but won't raise an exception. If no exception has been raised yet, :exc:`SystemError` is set.
pt_br: Passa um objeto Python intocado, mas cria uma nova :term:`referência forte` a ele (isto é, sua contagem de referências é incrementada por um). Se o objeto passado é um ponteiro ``NULL``, presume-se que isso foi causado porque a chamada que produziu o argumento encontrou um erro e definiu uma exceção. Portanto, :c:func:`Py_BuildValue` irá retornar ``NULL`` mas não irá levantar uma exceção. Se nenhuma exceção foi levantada ainda, :exc:`SystemError` é definida.

source: ``S`` (object) [PyObject \*]
pt_br: ``S`` (objeto) [PyObject \*]

source: Same as ``O``.
pt_br: O mesmo que ``O``.

source: ``N`` (object) [PyObject \*]
pt_br: ``N`` (objeto) [PyObject \*]

source: Same as ``O``, except it doesn't create a new :term:`strong reference`. Useful when the object is created by a call to an object constructor in the argument list.
pt_br: O mesmo que ``O``, exceto que não cria uma nova :term:`referência forte`. Útil quando o objeto é criado por uma chamada a um construtor de objeto na lista de argumento.

source: ``O&`` (object) [*converter*, *anything*]
pt_br: ``O&`` (objeto) [*converter*, *anything*]

source: Convert *anything* to a Python object through a *converter* function. The function is called with *anything* (which should be compatible with :c:expr:`void*`) as its argument and should return a "new" Python object, or ``NULL`` if an error occurred.
pt_br: Converte *anything* para um objeto Python através de uma função *converter*. A função é chamada com *anything* (que deve ser compatível com o :c:expr:`void*`) como argumento e deve retornar um "novo" objeto Python, ou ``NULL`` se um erro ocorreu.

source: Convert a sequence of C values to a Python tuple with the same number of items.
pt_br: Converte uma sequência de valores C para uma tupla Python com o mesmo número de itens.

source: Convert a sequence of C values to a Python list with the same number of items.
pt_br: Converte uma sequência de valores C para uma lista Python com o mesmo número de itens.

source: Convert a sequence of C values to a Python dictionary. Each pair of consecutive C values adds one item to the dictionary, serving as key and value, respectively.
pt_br: Converte uma sequência de valores C para um dicionário Python. Cada par de valores consecutivos do C adiciona um item ao dicionário, servindo como chave e valor, respectivamente.

source: If there is an error in the format string, the :exc:`SystemError` exception is set and ``NULL`` returned.
pt_br: Se existir um erro na string de formatação, a exceção :exc:`SystemError` é definida e ``NULL`` é retornado.

source: Identical to :c:func:`Py_BuildValue`, except that it accepts a va_list rather than a variable number of arguments.
pt_br: Idêntico a :c:func:`Py_BuildValue`, exceto que aceita uma va_list ao invés de um número variável de argumentos.
