Repository: python/python-docs-pt-br
Catalog: c-api/buffer.po
Languages: pt_br

source: Buffer Protocol
pt_br: Protocolo de Buffer

source: Certain objects available in Python wrap access to an underlying memory array or *buffer*. Such objects include the built-in :class:`bytes` and :class:`bytearray`, and some extension types like :class:`array.array`. Third-party libraries may define their own types for special purposes, such as image processing or numeric analysis.
pt_br: Certos objetos disponíveis no Python envolvem o acesso a um vetor ou *buffer* de memória subjacente. Esses objetos incluem as :class:`bytes` e :class:`bytearray` embutidas, e alguns tipos de extensão como :class:`array.array`. As bibliotecas de terceiros podem definir seus próprios tipos para fins especiais, como processamento de imagem ou análise numérica.

source: While each of these types have their own semantics, they share the common characteristic of being backed by a possibly large memory buffer. It is then desirable, in some situations, to access that buffer directly and without intermediate copying.
pt_br: Embora cada um desses tipos tenha sua própria semântica, eles compartilham a característica comum de serem suportados por um buffer de memória possivelmente grande. É desejável, em algumas situações, acessar esse buffer diretamente e sem cópia intermediária.

source: Python provides such a facility at the C and Python level in the form of the :ref:`buffer protocol <bufferobjects>`. This protocol has two sides:
pt_br: Python fornece essa facilidade no nível C e Python sob a forma de :ref:`protocolo de buffer <bufferobjects>`. Este protocolo tem dois lados:

source: on the producer side, a type can export a "buffer interface" which allows objects of that type to expose information about their underlying buffer. This interface is described in the section :ref:`buffer-structs`; for Python see :ref:`python-buffer-protocol`.
pt_br: do lado do produtor, um tipo pode exportar uma "interface de buffer" que permite que objetos desse tipo exponham informações sobre o buffer subjacente. Esta interface é descrita na seção :ref:`buffer-structs`; para Python, consulte :ref:`python-buffer-protocol`.

source: on the consumer side, several means are available to obtain a pointer to the raw underlying data of an object (for example a method parameter). For Python see :class:`memoryview`.
pt_br: do lado do consumidor, vários meios estão disponíveis para obter o ponteiro para os dados subjacentes de um objeto (por exemplo, um parâmetro de método). Para Python, consulte :ref:`python-buffer-protocol`.

source: Simple objects such as :class:`bytes` and :class:`bytearray` expose their underlying buffer in byte-oriented form. Other forms are possible; for example, the elements exposed by an :class:`array.array` can be multi-byte values.
pt_br: Objetos simples como :class:`bytes` e :class:`bytearray` expõem seu buffer subjacente em uma forma orientada a byte. Outras formas são possíveis; por exemplo, os elementos expostos por uma :class:`array.array` podem ser valores de vários bytes.

source: An example consumer of the buffer interface is the :meth:`~io.BufferedIOBase.write` method of file objects: any object that can export a series of bytes through the buffer interface can be written to a file. While :meth:`!write` only needs read-only access to the internal contents of the object passed to it, other methods such as :meth:`~io.BufferedIOBase.readinto` need write access to the contents of their argument. The buffer interface allows objects to selectively allow or reject exporting of read-write and read-only buffers.
pt_br: Um exemplo de interface de um consumidor de buffer é o método :meth:`~io.BufferedIOBase.write` de objetos arquivo: qualquer objeto que possa exportar uma série de bytes por meio da interface de buffer pode ser gravado em um arquivo. Enquanto o :meth:`!write` precisa apenas de acesso de somente leitura ao conteúdo interno do objeto passado, outros métodos, como :meth:`~io.BufferedIOBase.readinto`, precisam de acesso de somente escrita ao conteúdo interno. A interface de buffer permite que o objetos possam permitir ou rejeitar a exportação para buffers de leitura e escrita ou somente leitura.

source: There are two ways for a consumer of the buffer interface to acquire a buffer over a target object:
pt_br: Existem duas maneiras para um consumidor da interface de buffer adquirir um buffer em um objeto alvo:

source: call :c:func:`PyObject_GetBuffer` with the right parameters;
pt_br: chamada de :c:func:`PyObject_GetBuffer` com os parâmetros certos;

source: call :c:func:`PyArg_ParseTuple` (or one of its siblings) with one of the ``y*``, ``w*`` or ``s*`` :ref:`format codes <arg-parsing>`.
pt_br: chamada de :c:func:`PyArg_ParseTuple` (ou um dos seus irmãos) com um dos :ref:`códigos de formatação <arg-parsing>` ``y*``, ``w*`` ou ``s*``.

source: In both cases, :c:func:`PyBuffer_Release` must be called when the buffer isn't needed anymore. Failure to do so could lead to various issues such as resource leaks.
pt_br: Em ambos os casos, :c:func:`PyBuffer_Release` deve ser chamado quando o buffer não é mais necessário. A falta de tal pode levar a várias questões, tais como vazamentos de recursos.

source: The buffer protocol is now accessible in Python, see :ref:`python-buffer-protocol` and :class:`memoryview`.
pt_br: O protocolo de buffer agora está acessível em Python, veja :ref:`python-buffer-protocol` e :class:`memoryview`.

source: Buffer structure
pt_br: Estrutura de Buffer

source: Buffer structures (or simply "buffers") are useful as a way to expose the binary data from another object to the Python programmer. They can also be used as a zero-copy slicing mechanism. Using their ability to reference a block of memory, it is possible to expose any data to the Python programmer quite easily. The memory could be a large, constant array in a C extension, it could be a raw block of memory for manipulation before passing to an operating system library, or it could be used to pass around structured data in its native, in-memory format.
pt_br: As estruturas de buffer (ou simplesmente "buffers") são úteis como uma maneira de expor os dados binários de outro objeto para o programador Python. Eles também podem ser usados como um mecanismo de cópia silenciosa. Usando sua capacidade de fazer referência a um bloco de memória, é possível expor facilmente qualquer dado ao programador Python. A memória pode ser uma matriz grande e constante em uma extensão C, pode ser um bloco bruto de memória para manipulação antes de passar para uma biblioteca do sistema operacional, ou pode ser usado para transmitir dados estruturados no formato nativo e formato de memória.

source: Contrary to most data types exposed by the Python interpreter, buffers are not :c:type:`PyObject` pointers but rather simple C structures. This allows them to be created and copied very simply. When a generic wrapper around a buffer is needed, a :ref:`memoryview <memoryview-objects>` object can be created.
pt_br: Ao contrário da maioria dos tipos de dados expostos pelo interpretador Python, os buffers não são ponteiros :c:type:`PyObject` mas sim estruturas C simples. Isso permite que eles sejam criados e copiados de forma muito simples. Quando um invólucro genérico em torno de um buffer é necessário, um objeto :ref:`memoryview <memoryview-objects>` pode ser criado.

source: For short instructions how to write an exporting object, see :ref:`Buffer Object Structures <buffer-structs>`. For obtaining a buffer, see :c:func:`PyObject_GetBuffer`.
pt_br: Para obter instruções curtas sobre como escrever um objeto exportador, consulte :ref:`Buffer Object Structures <buffer-structs>`. Para obter um buffer, veja :c:func:`PyObject_GetBuffer`.

source: A pointer to the start of the logical structure described by the buffer fields. This can be any location within the underlying physical memory block of the exporter. For example, with negative :c:member:`~Py_buffer.strides` the value may point to the end of the memory block.
pt_br: Um ponteiro para o início da estrutura lógica descrita pelos campos do buffer. Este pode ser qualquer local dentro do bloco de memória física subjacente do exportador. Por exemplo, com negativo :c:member:`~Py_buffer.strides` o valor pode apontar para o final do bloco de memória.

source: For :term:`contiguous` arrays, the value points to the beginning of the memory block.
pt_br: Para vetores :term:`contíguos <contiguous>`, o valor aponta para o início do bloco de memória.

source: A new reference to the exporting object. The reference is owned by the consumer and automatically released (i.e. reference count decremented) and set to ``NULL`` by :c:func:`PyBuffer_Release`. The field is the equivalent of the return value of any standard C-API function.
pt_br: Uma nova referência ao objeto sendo exporta. A referência pertence ao consumidor e é automaticamente liberada (por exemplo, a contagem de referências é decrementada) e é atribuída para ``NULL`` por :c:func:`PyBuffer_Release`. O campo é equivalmente ao valor de retorno de qualquer função do padrão C-API.

source: As a special case, for *temporary* buffers that are wrapped by :c:func:`PyMemoryView_FromBuffer` or :c:func:`PyBuffer_FillInfo` this field is ``NULL``. In general, exporting objects MUST NOT use this scheme.
pt_br: Como um caso especial, para buffers *temporários* que são encapsulados por :c:func:`PyMemoryView_FromBuffer` ou :c:func:`PyBuffer_FillInfo` esse campo é ``NULL``. Em geral, objetos exportadores NÃO DEVEM usar esse esquema.

source: ``product(shape) * itemsize``. For contiguous arrays, this is the length of the underlying memory block. For non-contiguous arrays, it is the length that the logical structure would have if it were copied to a contiguous representation.
pt_br: ``product(shape) * itemsize``. Para matrizes contíguas, este é o comprimento do bloco de memória subjacente. Para matrizes não contíguas, é o comprimento que a estrutura lógica teria se fosse copiado para uma representação contígua.

source: Accessing ``((char *)buf)[0] up to ((char *)buf)[len-1]`` is only valid if the buffer has been obtained by a request that guarantees contiguity. In most cases such a request will be :c:macro:`PyBUF_SIMPLE` or :c:macro:`PyBUF_WRITABLE`.
pt_br: Acessando ``((char *)buf)[0] up to ((char *)buf)[len-1]`` só é válido se o buffer tiver sido obtido por uma solicitação que garanta a contiguidade. Na maioria dos casos, esse pedido será :c:macro:`PyBUF_SIMPLE` ou :c:macro:`PyBUF_WRITABLE`.

source: An indicator of whether the buffer is read-only. This field is controlled by the :c:macro:`PyBUF_WRITABLE` flag.
pt_br: Um indicador de se o buffer é somente leitura. Este campo é controlado pelo sinalizador :c:macro:`PyBUF_WRITABLE`.

source: Item size in bytes of a single element. Same as the value of :func:`struct.calcsize` called on non-``NULL`` :c:member:`~Py_buffer.format` values.
pt_br: O tamanho do item em bytes de um único elemento. O mesmo que o valor de :func:`struct.calcsize` chamado em valores não ``NULL`` de :c:member:`~Py_buffer.format`.

source: Important exception: If a consumer requests a buffer without the :c:macro:`PyBUF_FORMAT` flag, :c:member:`~Py_buffer.format` will be set to ``NULL``, but :c:member:`~Py_buffer.itemsize` still has the value for the original format.
pt_br: Exceção importante: Se um consumidor requisita um buffer sem sinalizador :c:macro:`PyBUF_FORMAT`, :c:member:`~Py_buffer.format` será definido como ``NULL``, mas :c:member:`~Py_buffer.itemsize` ainda terá seu valor para o formato original.

source: If :c:member:`~Py_buffer.shape` is present, the equality ``product(shape) * itemsize == len`` still holds and the consumer can use :c:member:`~Py_buffer.itemsize` to navigate the buffer.
pt_br: Se :c:member:`~Py_buffer.shape` está presente, a igualdade ``product(shape) * itemsize == len`` ainda é válida e o usuário pode usar :c:member:`~Py_buffer.itemsize` para navegar o buffer.

source: If :c:member:`~Py_buffer.shape` is ``NULL`` as a result of a :c:macro:`PyBUF_SIMPLE` or a :c:macro:`PyBUF_WRITABLE` request, the consumer must disregard :c:member:`~Py_buffer.itemsize` and assume ``itemsize == 1``.
pt_br: Se :c:member:`~Py_buffer.shape` é ``NULL`` como resultado de uma :c:macro:`PyBUF_SIMPLE` ou uma requisição :c:macro:`PyBUF_WRITABLE`, o consumidor deve ignorar :c:member:`~Py_buffer.itemsize` e presumir ``itemsize == 1``.

source: A *NULL* terminated string in :mod:`struct` module style syntax describing the contents of a single item. If this is ``NULL``, ``"B"`` (unsigned bytes) is assumed.
pt_br: Uma string terminada por *NULL* no estilo de sintaxe de módulo :mod:`struct` descrevendo os conteúdos de um único item. Se isso é ``NULL``, ``"B"`` (unsigned bytes) é presumido.

source: This field is controlled by the :c:macro:`PyBUF_FORMAT` flag.
pt_br: Este campo é controlado pelo sinalizador :c:macro:`PyBUF_FORMAT`.

source: The number of dimensions the memory represents as an n-dimensional array. If it is ``0``, :c:member:`~Py_buffer.buf` points to a single item representing a scalar. In this case, :c:member:`~Py_buffer.shape`, :c:member:`~Py_buffer.strides` and :c:member:`~Py_buffer.suboffsets` MUST be ``NULL``. The maximum number of dimensions is given by :c:macro:`PyBUF_MAX_NDIM`.
pt_br: O número de dimensões de memória representado como um array n-dimensional. Se for ``0``, :c:member:`~Py_buffer.buf` aponta para um único elemento representando um escalar. Neste caso, :c:member:`~Py_buffer.shape`, :c:member:`~Py_buffer.strides` e :c:member:`~Py_buffer.suboffsets` DEVEM ser ``NULL``. O número máximo de dimensões é dado por :c:macro:`PyBUF_MAX_NDIM`.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim` indicating the shape of the memory as an n-dimensional array. Note that ``shape[0] * ... * shape[ndim-1] * itemsize`` MUST be equal to :c:member:`~Py_buffer.len`.
pt_br: Uma matriz de :c:type:`Py_ssize_t` do comprimento :c:member:`~Py_buffer.ndim` indicando a forma da memória como uma matriz n-dimensional. Observe que a forma ``shape[0] * ... * shape[ndim-1] * itemsize`` DEVE ser igual a :c:member:`~Py_buffer.len`.

source: Shape values are restricted to ``shape[n] >= 0``. The case ``shape[n] == 0`` requires special attention. See `complex arrays`_ for further information.
pt_br: Os valores da forma são restritos a ``shape[n] >= 0``. The case ``shape[n] == 0`` requer atenção especial. Veja `complex arrays`_ para mais informações.

source: The shape array is read-only for the consumer.
pt_br: A forma de acesso a matriz é de somente leitura para o usuário.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim` giving the number of bytes to skip to get to a new element in each dimension.
pt_br: Um vetor de :c:type:`Py_ssize_t` de comprimento :c:member:`~Py_buffer.ndim` dando o número de bytes para saltar para obter um novo elemento em cada dimensão.

source: Stride values can be any integer. For regular arrays, strides are usually positive, but a consumer MUST be able to handle the case ``strides[n] <= 0``. See `complex arrays`_ for further information.
pt_br: Os valores de Stride podem ser qualquer número inteiro. Para arrays regulares, os passos são geralmente positivos, mas um consumidor DEVE ser capaz de lidar com o caso ``strides[n] <= 0``. Veja `complex arrays`_ para mais informações.

source: The strides array is read-only for the consumer.
pt_br: A matriz de passos é somente leitura para o consumidor.

source: An array of :c:type:`Py_ssize_t` of length :c:member:`~Py_buffer.ndim`. If ``suboffsets[n] >= 0``, the values stored along the nth dimension are pointers and the suboffset value dictates how many bytes to add to each pointer after de-referencing. A suboffset value that is negative indicates that no de-referencing should occur (striding in a contiguous memory block).
pt_br: Uma matriz de :c:type:`Py_ssize_t` de comprimento :c:member:`~Py_buffer.ndim`. Se ``suboffsets[n] >= 0``, os valores armazenados ao longo da n-ésima dimensão são ponteiros e o valor suboffset determina quantos bytes para adicionar a cada ponteiro após desreferenciar. Um valor de suboffset que é negativo indica que não deve ocorrer desreferenciação (caminhando em um bloco de memória contíguo).

source: If all suboffsets are negative (i.e. no de-referencing is needed), then this field must be ``NULL`` (the default value).
pt_br: Se todos os subconjuntos forem negativos (ou seja, não é necessário fazer referência), então este campo deve ser ``NULL`` (o valor padrão).

source: This type of array representation is used by the Python Imaging Library (PIL). See `complex arrays`_ for further information how to access elements of such an array.
pt_br: Esse tipo de representação de matriz é usado pela Python Imaging Library (PIL). Veja `complex arrays`_ para obter mais informações sobre como acessar elementos dessa matriz.a matriz.

source: The suboffsets array is read-only for the consumer.
pt_br: A matriz de subconjuntos é somente leitura para o consumidor.

source: This is for use internally by the exporting object. For example, this might be re-cast as an integer by the exporter and used to store flags about whether or not the shape, strides, and suboffsets arrays must be freed when the buffer is released. The consumer MUST NOT alter this value.
pt_br: Isso é para uso interno pelo objeto exportador. Por exemplo, isso pode ser re-moldado como um número inteiro pelo exportador e usado para armazenar bandeiras sobre se os conjuntos de forma, passos e suboffsets devem ou não ser liberados quando o buffer é liberado. O consumidor NÃO DEVE alterar esse valor.

source: Constants:
pt_br: Constantes:

source: The maximum number of dimensions the memory represents. Exporters MUST respect this limit, consumers of multi-dimensional buffers SHOULD be able to handle up to :c:macro:`!PyBUF_MAX_NDIM` dimensions. Currently set to 64.
pt_br: O número máximo de dimensões que a memória representa. Exportadores DEVEM respeitar esse limite, consumidores de buffers multi-dimensionais DEVEM ser capazes de liader com até :c:macro:`!PyBUF_MAX_NDIM` dimensões. Atualmente definido como 64.

source: Buffer request types
pt_br: Tipos de solicitação do buffer

source: Buffers are usually obtained by sending a buffer request to an exporting object via :c:func:`PyObject_GetBuffer`. Since the complexity of the logical structure of the memory can vary drastically, the consumer uses the *flags* argument to specify the exact buffer type it can handle.
pt_br: Os buffers geralmente são obtidos enviando uma solicitação de buffer para um objeto exportador via :c:func:`PyObject_GetBuffer`. Uma vez que a complexidade da estrutura lógica da memória pode variar drasticamente, o consumidor usa o argumento *flags* para especificar o tipo de buffer exato que pode manipular.

source: All :c:type:`Py_buffer` fields are unambiguously defined by the request type.
pt_br: Todos os campos :c:type:`Py_buffer` são definidos de forma não-ambígua pelo tipo de requisição.

source: request-independent fields
pt_br: campos independentes do pedido

source: The following fields are not influenced by *flags* and must always be filled in with the correct values: :c:member:`~Py_buffer.obj`, :c:member:`~Py_buffer.buf`, :c:member:`~Py_buffer.len`, :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`.
pt_br: Os seguintes campos não são influenciados por *flags* e devem sempre ser preenchidos com os valores corretos: :c:member:`~Py_buffer.obj`, :c:member:`~Py_buffer.buf`, :c:member:`~Py_buffer.len`, :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`.

source: readonly, format
pt_br: apenas em formato

source: Controls the :c:member:`~Py_buffer.readonly` field. If set, the exporter MUST provide a writable buffer or else report failure. Otherwise, the exporter MAY provide either a read-only or writable buffer, but the choice MUST be consistent for all consumers. For example, :c:expr:`PyBUF_SIMPLE | PyBUF_WRITABLE` can be used to request a simple writable buffer.
pt_br: Controla o campo :c:member:`~Py_buffer.readonly` . Se configurado, o exportador DEVE fornecer um buffer gravável ou então relatar falha. Do contrário, o exportador PODE fornecer um buffer somente leitura ou um buffer gravável , mas a escolha DEVE ser consistente para todos os consumidores. Por exemplo, :c:expr:`PyBUF_SIMPLE | PyBUF_WRITABLE` pode ser usado para requisitar um buffer simples gravável.

source: Controls the :c:member:`~Py_buffer.format` field. If set, this field MUST be filled in correctly. Otherwise, this field MUST be ``NULL``.
pt_br: Controla o campo :c:member:`~Py_buffer.format`. Se configurado, este campo DEVE ser preenchido corretamente. Caso contrário, este campo DEVE ser ``NULL``.

source: :c:macro:`PyBUF_WRITABLE` can be \|'d to any of the flags in the next section. Since :c:macro:`PyBUF_SIMPLE` is defined as 0, :c:macro:`PyBUF_WRITABLE` can be used as a stand-alone flag to request a simple writable buffer.
pt_br: ::c:macro:`PyBUF_WRITABLE` pode ser \|'d para qualquer um dos sinalizadores na próxima seção. Uma vez que :c:macro:`PyBUF_WRITABLE` é definido como 0, :c:macro:`PyBUF_WRITABLE` pode ser usado como uma bandeira autônoma para solicitar um buffer simples gravável.

source: :c:macro:`PyBUF_FORMAT` must be \|'d to any of the flags except :c:macro:`PyBUF_SIMPLE`, because the latter already implies format ``B`` (unsigned bytes). :c:macro:`!PyBUF_FORMAT` cannot be used on its own.
pt_br: :c:macro:`PyBUF_FORMAT` deve ser \|'d para qualquer um dos sinalizadores exceto :c:macro:`PyBUF_SIMPLE`, uma vez que este já indica que o formato ``B`` (unsigned bytes). :c:macro:`!PyBUF_FORMAT` não pode ser utilizado sozinho.

source: shape, strides, suboffsets
pt_br: forma, avanços, suboffsets

source: The flags that control the logical structure of the memory are listed in decreasing order of complexity. Note that each flag contains all bits of the flags below it.
pt_br: As bandeiras que controlam a estrutura lógica da memória estão listadas em ordem decrescente de complexidade. Observe que cada bandeira contém todos os bits das bandeiras abaixo.

source: Request
pt_br: Solicitação

source: shape
pt_br: Forma

source: strides
pt_br: Avanços

source: suboffsets
pt_br: subconjuntos

source: yes
pt_br: sim

source: if needed
pt_br: se necessário

source: contiguity requests
pt_br: requisições contíguas

source: C or Fortran :term:`contiguity <contiguous>` can be explicitly requested, with and without stride information. Without stride information, the buffer must be C-contiguous.
pt_br: :term:`contiguity <contiguous>` do C ou Fortran podem ser explicitamente solicitadas, com ou sem informação de avanço. Sem informação de avanço, o buffer deve ser C-contíguo.

source: C or F
pt_br: C ou F

source: compound requests
pt_br: requisições compostas

source: All possible requests are fully defined by some combination of the flags in the previous section. For convenience, the buffer protocol provides frequently used combinations as single flags.
pt_br: Todas as requisições possíveis foram completamente definidas por alguma combinação dos sinalizadores na seção anterior. Por conveniência, o protocolo do buffer fornece combinações frequentemente utilizadas como sinalizadores únicos.

source: In the following table *U* stands for undefined contiguity. The consumer would have to call :c:func:`PyBuffer_IsContiguous` to determine contiguity.
pt_br: Na seguinte tabela *U* significa contiguidade indefinida. O consumidor deve chamar :c:func:`PyBuffer_IsContiguous` para determinar a contiguidade.

source: format
pt_br: formato

source: 1 or 0
pt_br: 1 ou 0

source: Complex arrays
pt_br: Vetores Complexos

source: NumPy-style: shape and strides
pt_br: Estilo NumPy: forma e avanços
