Repository: python/python-docs-pt-br
Catalog: c-api/buffer.po
Languages: pt_br

source: The logical structure of NumPy-style arrays is defined by :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`, :c:member:`~Py_buffer.shape` and :c:member:`~Py_buffer.strides`.
pt_br: A estrutura lógica de vetores do estilo NumPy é definida por :c:member:`~Py_buffer.itemsize`, :c:member:`~Py_buffer.ndim`, :c:member:`~Py_buffer.shape` e :c:member:`~Py_buffer.strides`.

source: If ``ndim == 0``, the memory location pointed to by :c:member:`~Py_buffer.buf` is interpreted as a scalar of size :c:member:`~Py_buffer.itemsize`. In that case, both :c:member:`~Py_buffer.shape` and :c:member:`~Py_buffer.strides` are ``NULL``.
pt_br: Se ``ndim == 0``, a localização da memória apontada para :c:member:`~Py_buffer.buf` é interpretada como um escalar de tamanho :c:member:`~Py_buffer.itemsize`. Nesse caso, ambos :c:member:`~Py_buffer.shape` e :c:member:`~Py_buffer.strides` são ``NULL``.

source: If :c:member:`~Py_buffer.strides` is ``NULL``, the array is interpreted as a standard n-dimensional C-array. Otherwise, the consumer must access an n-dimensional array as follows:
pt_br: Se :c:member:`~Py_buffer.strides` é ``NULL``, o vetor é interpretado como um vetor C n-dimensional padrão. Caso contrário, o consumidor deve acessar um vetor n-dimensional como a seguir:

source: As noted above, :c:member:`~Py_buffer.buf` can point to any location within the actual memory block. An exporter can check the validity of a buffer with this function:
pt_br: Como notado acima, :c:member:`~Py_buffer.buf` pode apontar para qualquer localização dentro do bloco de memória em si. Um exportador pode verificar a validade de um buffer com essa função:

source: def verify_structure(memlen, itemsize, ndim, shape, strides, offset): """Verify that the parameters represent a valid array within the bounds of the allocated memory: char *mem: start of the physical memory block memlen: length of the physical memory block offset: (char *)buf - mem """ if offset % itemsize: return False if offset < 0 or offset+itemsize > memlen: return False if any(v % itemsize for v in strides): return False if ndim <= 0: return ndim == 0 and not shape and not strides if 0 in shape: return True imin = sum(strides[j]*(shape[j]-1) for j in range(ndim) if strides[j] <= 0) imax = sum(strides[j]*(shape[j]-1) for j in range(ndim) if strides[j] > 0) return 0 <= offset+imin and offset+imax+itemsize <= memlen
pt_br: def verify_structure(memlen, itemsize, ndim, shape, strides, offset): """Verifica se os parâmetros representa um vetor válido dentro dos limites da memória alocada: char *mem: início do bloco de memória física memlen: comprimento do bloco de memória física offset: (char *)buf - mem """ if offset % itemsize: return False if offset < 0 or offset+itemsize > memlen: return False if any(v % itemsize for v in strides): return False if ndim <= 0: return ndim == 0 and not shape and not strides if 0 in shape: return True imin = sum(strides[j]*(shape[j]-1) for j in range(ndim) if strides[j] <= 0) imax = sum(strides[j]*(shape[j]-1) for j in range(ndim) if strides[j] > 0) return 0 <= offset+imin and offset+imax+itemsize <= memlen

source: PIL-style: shape, strides and suboffsets
pt_br: Estilo-PIL: forma, avanços e suboffsets

source: In addition to the regular items, PIL-style arrays can contain pointers that must be followed in order to get to the next element in a dimension. For example, the regular three-dimensional C-array ``char v[2][2][3]`` can also be viewed as an array of 2 pointers to 2 two-dimensional arrays: ``char (*v[2])[2][3]``. In suboffsets representation, those two pointers can be embedded at the start of :c:member:`~Py_buffer.buf`, pointing to two ``char x[2][3]`` arrays that can be located anywhere in memory.
pt_br: Além dos itens normais, uma matriz em estilo PIL pode conter ponteiros que devem ser seguidos para se obter o próximo elemento em uma dimensão. Por exemplo, a matriz tridimensional em C ``char v[2][2][3]`` também pode ser vista como um vetor de 2 ponteiros para duas matrizes bidimensionais: ``char (*v[2])[2][3]``. Na representação por suboffsets, esses dois ponteiros podem ser embutidos no início de :c:member:`~Py_buffer.buf`, apontando para duas matrizes ``char x[2][3]`` que podem estar localizadas em qualquer lugar na memória.

source: Here is a function that returns a pointer to the element in an N-D array pointed to by an N-dimensional index when there are both non-``NULL`` strides and suboffsets::
pt_br: Esta é uma função que retorna um ponteiro para o elemento em uma matriz N-D apontada por um índice N-dimensional onde existem ambos passos e subconjuntos não-``NULL``::

source: Buffer-related functions
pt_br: Funções relacionadas ao Buffer

source: Return ``1`` if *obj* supports the buffer interface otherwise ``0``. When ``1`` is returned, it doesn't guarantee that :c:func:`PyObject_GetBuffer` will succeed. This function always succeeds.
pt_br: Retorna ``1`` se *obj* oferece suporte à interface de buffer, se não, ``0``. Quando ``1`` é retornado, isso não garante que :c:func:`PyObject_GetBuffer` será bem sucedida. Esta função é sempre bem sucedida.

source: Send a request to *exporter* to fill in *view* as specified by *flags*. If the exporter cannot provide a buffer of the exact type, it MUST raise :exc:`BufferError`, set ``view->obj`` to ``NULL`` and return ``-1``.
pt_br: Envia uma requisição ao *exporter* para preencher a *view* conforme especificado por *flags*. Se o exporter não conseguir prover um buffer do tipo especificado, ele DEVE levantar :exc:`BufferError`, definir ``view->obj`` para ``NULL`` e retornar ``-1``.

source: On success, fill in *view*, set ``view->obj`` to a new reference to *exporter* and return 0. In the case of chained buffer providers that redirect requests to a single object, ``view->obj`` MAY refer to this object instead of *exporter* (See :ref:`Buffer Object Structures <buffer-structs>`).
pt_br: Em caso de sucesso, preenche *view*, define ``view->obj`` para uma nova referência para *exporter* e retorna 0. No caso de provedores de buffer encadeados que redirecionam requisições para um único objeto, ``view->obj`` DEVE se referir a este objeto em vez de *exporter* (Veja :ref:`Buffer Object Structures <buffer-structs>`).

source: Successful calls to :c:func:`PyObject_GetBuffer` must be paired with calls to :c:func:`PyBuffer_Release`, similar to :c:func:`malloc` and :c:func:`free`. Thus, after the consumer is done with the buffer, :c:func:`PyBuffer_Release` must be called exactly once.
pt_br: Chamadas bem sucedidas para :c:func:`PyObject_GetBuffer` devem ser emparelhadas a chamadas para :c:func:`PyBuffer_Release`, similar para :c:func:`malloc` e :c:func:`free`. Assim, após o consumidor terminar com o buffer, :c:func:`PyBuffer_Release` deve ser chamado exatamente uma vez.

source: Release the buffer *view* and release the :term:`strong reference` (i.e. decrement the reference count) to the view's supporting object, ``view->obj``. This function MUST be called when the buffer is no longer being used, otherwise reference leaks may occur.
pt_br: Libera o buffer de *view* e libera o :term:`strong reference` (por exemplo, decrementa o contador de referências) para o objeto de suporte da view, ``view->obj``. Esta função DEVE ser chamada quando o buffer não estiver mais sendo usado, ou o vazamento de referências pode acontecer.

source: It is an error to call this function on a buffer that was not obtained via :c:func:`PyObject_GetBuffer`.
pt_br: É um erro chamar essa função em um buffer que não foi obtido via :c:func:`PyObject_GetBuffer`.

source: Return the implied :c:member:`~Py_buffer.itemsize` from :c:member:`~Py_buffer.format`. On error, raise an exception and return -1.
pt_br: Retorna o :c:member:`~Py_buffer.itemsize` implícito de :c:member:`~Py_buffer.format`. Em erro, levantar e exceção e retornar -1.

source: Return ``1`` if the memory defined by the *view* is C-style (*order* is ``'C'``) or Fortran-style (*order* is ``'F'``) :term:`contiguous` or either one (*order* is ``'A'``). Return ``0`` otherwise. This function always succeeds.
pt_br: Retorna ``1`` se a memória definida pela *view* é :term:`contígua <contíguo>` no estilo C (*order* é ``'C'``) ou no estilo Fortran (*order* é ``'F'``) ou qualquer outra (*order* é ``'A'``). Retorna ``0`` caso contrário. Essa função é sempre bem sucedida.

source: Get the memory area pointed to by the *indices* inside the given *view*. *indices* must point to an array of ``view->ndim`` indices.
pt_br: Recebe a área de memória apontada pelos *indices* dentro da *view* dada. *indices* deve apontar para um array de ``view->ndim`` índices.

source: Copy contiguous *len* bytes from *buf* to *view*. *fort* can be ``'C'`` or ``'F'`` (for C-style or Fortran-style ordering). ``0`` is returned on success, ``-1`` on error.
pt_br: Copia *len* bytes contíguos de *buf* para *view*. *fort* pode ser ``'C'`` ou ``'F'`` (para ordenação estilo C ou estilo Fortran). Retorna ``0`` em caso de sucesso e ``-1`` em caso de erro.

source: Copy *len* bytes from *src* to its contiguous representation in *buf*. *order* can be ``'C'`` or ``'F'`` or ``'A'`` (for C-style or Fortran-style ordering or either one). ``0`` is returned on success, ``-1`` on error.
pt_br: Copia *len* bytes de *src* para sua representação contígua em *buf*. *order* pode ser ``'C'`` ou ``'F'`` ou ``'A'`` (para ordenação estilo C, Fortran ou qualquer uma). O retorno é ``0`` em caso de sucesso e ``-1`` em caso de falha.

source: This function fails if *len* != *src->len*.
pt_br: Esta função falha se *len* != *src->len*.

source: Copy data from *src* to *dest* buffer. Can convert between C-style and or Fortran-style buffers.
pt_br: Copia os dados do buffer *src* para o buffer *dest*. Pode converter entre buffers de estilo C e/ou estilo Fortran.

source: ``0`` is returned on success, ``-1`` on error.
pt_br: ``0`` é retornado em caso de sucesso, ``-1`` em caso de erro.

source: Fill the *strides* array with byte-strides of a :term:`contiguous` (C-style if *order* is ``'C'`` or Fortran-style if *order* is ``'F'``) array of the given shape with the given number of bytes per element.
pt_br: Preenche o array *strides* com byte-strides de um array :term:`contíguo` (estilo C se *order* é ``'C'`` ou estilo Fortran se *order* for ``'F'``) da forma dada com o número dado de bytes por elemento.

source: Handle buffer requests for an exporter that wants to expose *buf* of size *len* with writability set according to *readonly*. *buf* is interpreted as a sequence of unsigned bytes.
pt_br: Manipula requisições de buffer para um exportador que quer expor *buf* de tamanho *len* com capacidade de escrita definida de acordo com *readonly*. *buf* é interpretada como uma sequência de bytes sem sinal.

source: The *flags* argument indicates the request type. This function always fills in *view* as specified by flags, unless *buf* has been designated as read-only and :c:macro:`PyBUF_WRITABLE` is set in *flags*.
pt_br: O argumento *flags* indica o tipo de requisição. Esta função sempre preenche *view* como especificado por *flags*, a não ser que *buf* seja designado como somente leitura e :c:macro:`PyBUF_WRITABLE` esteja definido em *flags*.

source: On success, set ``view->obj`` to a new reference to *exporter* and return 0. Otherwise, raise :exc:`BufferError`, set ``view->obj`` to ``NULL`` and return ``-1``;
pt_br: Em caso de sucesso, defina ``view->obj`` como um novo referência para *exporter* e retorna 0. Caso contrário, levante :exc:`BufferError` , defina ``view->obj`` para ``NULL`` e retorne ``-1`` ;

source: If this function is used as part of a :ref:`getbufferproc <buffer-structs>`, *exporter* MUST be set to the exporting object and *flags* must be passed unmodified. Otherwise, *exporter* MUST be ``NULL``.
pt_br: Se esta função é usada como parte de um :ref:`getbufferproc<buffer-structs>`, *exporter* DEVE ser definida para o objeto de exportação e *flags* deve ser passado sem modificações. Caso contrário, *exporter* DEVE ser ``NULL``.

source: buffer protocol
pt_br: protocolo de buffer

source: buffer interface
pt_br: interface de buffer

source: (see buffer protocol)
pt_br: (veja o protocolo de buffer)

source: buffer object
pt_br: objeto buffer

source: PyBufferProcs (C type)
pt_br: PyBufferProcs (tipo C)

source: contiguous
pt_br: contíguo

source: C-contiguous
pt_br: contíguo C

source: Fortran contiguous
pt_br: contíguo Fortran
