Repository: python/python-docs-pt-br
Catalog: c-api/bytearray.po
Languages: pt_br

source: Byte Array Objects
pt_br: Objetos Byte Array

source: This subtype of :c:type:`PyObject` represents a Python bytearray object.
pt_br: Esse subtipo de :c:type:`PyObject` representa um objeto Python bytearray.

source: This instance of :c:type:`PyTypeObject` represents the Python bytearray type; it is the same object as :class:`bytearray` in the Python layer.
pt_br: Essa instância de :c:type:`PyTypeObject` representa um tipo Python bytearray; é o mesmo objeto que o :class:`bytearray` na camada Python.

source: Type check macros
pt_br: Macros para verificação de tipo

source: Return true if the object *o* is a bytearray object or an instance of a subtype of the bytearray type.
pt_br: Retorna verdadeiro se o objeto *o* for um objeto bytearray ou se for uma instância de um subtipo do tipo bytearray.

source: Return true if the object *o* is a bytearray object, but not an instance of a subtype of the bytearray type.
pt_br: Retorna verdadeiro se o objeto *o* for um objeto bytearray, mas não for uma instância de um subtipo do tipo bytearray.

source: Direct API functions
pt_br: Funções diretas da API

source: Return a new bytearray object from any object, *o*, that implements the :ref:`buffer protocol <bufferobjects>`.
pt_br: Retorna um novo objeto bytearray, *o*, que implementa o :ref:`buffer protocol<bufferobjects>`.

source: Create a new bytearray object from *string* and its length, *len*. On failure, ``NULL`` is returned.
pt_br: Cria um novo objeto bytearray a partir de *string* e seu comprimento, *len*. Em caso de falha, ``NULL`` é retornado.

source: Concat bytearrays *a* and *b* and return a new bytearray with the result.
pt_br: Concatena os bytearrays *a* e *b* e retorna um novo bytearray com o resultado.

source: Return the size of *bytearray* after checking for a ``NULL`` pointer.
pt_br: Retorna o tamanho de *bytearray* após verificar se há um ponteiro ``NULL``.

source: Return the contents of *bytearray* as a char array after checking for a ``NULL`` pointer. The returned array always has an extra null byte appended.
pt_br: Retorna o conteúdo de *bytearray* como uma matriz de caracteres após verificar um ponteiro ``NULL``. A matriz retornada sempre tem um byte nulo extra acrescentado.

source: Resize the internal buffer of *bytearray* to *len*.
pt_br: Redimensiona o buffer interno de *bytearray* para o tamanho *len*.

source: These macros trade safety for speed and they don't check pointers.
pt_br: Estas macros trocam segurança por velocidade e não verificam os ponteiros.

source: Macro version of :c:func:`PyByteArray_AsString`.
pt_br: Versão macro de :c:func:`PyByteArray_AsString`.

source: Macro version of :c:func:`PyByteArray_Size`.
pt_br: Versão macro de :c:func:`PyByteArray_Size`.
