Repository: python/python-docs-pt-br
Catalog: c-api/bytes.po
Languages: pt_br

source: Bytes Objects
pt_br: Objetos Bytes

source: These functions raise :exc:`TypeError` when expecting a bytes parameter and are called with a non-bytes parameter.
pt_br: Estas funções geram :exc:`TypeError` quando chamadas sem o parâmetro do tupo bytes esperado.

source: This subtype of :c:type:`PyObject` represents a Python bytes object.
pt_br: Esta é uma instância de :c:type:`PyObject` representando o tipo Python: bytes

source: This instance of :c:type:`PyTypeObject` represents the Python bytes type; it is the same object as :class:`bytes` in the Python layer.
pt_br: Esta instância de: c: tipo: `PyTypeObject` representa o tipo de bytes Python; é o mesmo objeto que: classe: `bytes` na camada de Python.

source: Return true if the object *o* is a bytes object or an instance of a subtype of the bytes type.
pt_br: Retorna verdadeiro se o objeto *o* for um objeto do tipo byte ou uma instância de um subtipo do tipo bytes.

source: Return true if the object *o* is a bytes object, but not an instance of a subtype of the bytes type.
pt_br: Retorna verdadeiro se o objeto *o* for um objeto de bytes, mas não uma instância de um subtipo do tipo de bytes.

source: Return a new bytes object with a copy of the string *v* as value on success, and ``NULL`` on failure. The parameter *v* must not be ``NULL``; it will not be checked.
pt_br: Retorna um novo objeto de bytes com uma cópia da string *v* como valor em caso de sucesso e ``NULL`` em caso de falha. O parâmetro *v* não deve ser ``NULL`` e isso não será verificado.

source: Return a new bytes object with a copy of the string *v* as value and length *len* on success, and ``NULL`` on failure. If *v* is ``NULL``, the contents of the bytes object are uninitialized.
pt_br: Retorna um novo objeto de bytes com uma cópia da string *v* como valor e comprimento *len* em caso de sucesso e ``NULL`` em caso de falha. Se *v* for ``NULL``, o conteúdo do objeto bytes não será inicializado.

source: Take a C :c:func:`printf`\ -style *format* string and a variable number of arguments, calculate the size of the resulting Python bytes object and return a bytes object with the values formatted into it. The variable arguments must be C types and must correspond exactly to the format characters in the *format* string. The following format characters are allowed:
pt_br: Tome uma seqüência C :c:func:`printf`\ -style *format* variáveis de números e caracteres são os argumentos, calcule o tamanho do objeto de bytes Python resultante e devolva um objeto bytes com os valores formatados nela. Os argumentos da variável devem ser tipos C e devem corresponder exatamente aos caracteres de formato na seqüência * format *. Os seguintes formatos são permitidos:

source: Format Characters
pt_br: Caracteres Formatados

source: Type
pt_br: Tipo

source: Comment
pt_br: Comentário

source: The literal % character.
pt_br: O caractere literal %.

source: A single byte, represented as a C int.
pt_br: Um único byte, representado como um C int.

source: Equivalent to ``printf("%d")``. [1]_
pt_br: Equivalente a ``printf("%d")``. [1]_

source: Equivalent to ``printf("%u")``. [1]_
pt_br: Equivalente a ``printf("%u")``. [1]_

source: long
pt_br: extenso, comprido

source: Equivalent to ``printf("%ld")``. [1]_
pt_br: Equivalente a ``printf("%ld")``. [1]_

source: Equivalent to ``printf("%lu")``. [1]_
pt_br: Equivalente a ``printf("%lu")``. [1]_

source: Py_ssize_t
pt_br: Py_stamanho_t

source: Equivalent to ``printf("%zd")``. [1]_
pt_br: Equivalente a ``printf("%zd")``. [1]_

source: size_t
pt_br: tamanho_t

source: Equivalent to ``printf("%zu")``. [1]_
pt_br: Equivalente a ``printf("%zu")``. [1]_

source: Equivalent to ``printf("%i")``. [1]_
pt_br: Equivalente a ``printf("%i")``. [1]_

source: Equivalent to ``printf("%x")``. [1]_
pt_br: Equivalente a ``printf("%x")``. [1]_

source: A null-terminated C character array.
pt_br: Uma matriz de caracteres C com terminação nula.

source: The hex representation of a C pointer. Mostly equivalent to ``printf("%p")`` except that it is guaranteed to start with the literal ``0x`` regardless of what the platform's ``printf`` yields.
pt_br: A representação hexadecimal de um ponteiro C. Principalmente equivalente a ``printf("%p")`` exceto que é garantido que comece com o literal ``0x`` independentemente do que o ``printf`` da plataforma ceda.

source: An unrecognized format character causes all the rest of the format string to be copied as-is to the result object, and any extra arguments discarded.
pt_br: Um caractere de formato não reconhecido faz com que todo o resto da sequência de formato seja copiado como é para o objeto resultante e todos os argumentos extras sejam descartados.

source: For integer specifiers (d, u, ld, lu, zd, zu, i, x): the 0-conversion flag has effect even when a precision is given.
pt_br: Para especificadores de números inteiros (d, u, ld, lu, zd, zu, i, x): a opção de conversão 0 tem efeito mesmo quando uma precisão é fornecida.

source: Identical to :c:func:`PyBytes_FromFormat` except that it takes exactly two arguments.
pt_br: Idêntico a :c:func:`PyBytes_FromFormat` exceto que é preciso exatamente dois argumentos.

source: Return the bytes representation of object *o* that implements the buffer protocol.
pt_br: Retorna a representação de bytes do objeto *o* que implementa o protocolo de buffer.

source: Return the length of the bytes in bytes object *o*.
pt_br: Retornar o comprimento dos bytes em bytes objeto *o*.

source: Macro form of :c:func:`PyBytes_Size` but without error checking.
pt_br: Forma macro de :c:func:`PyBytes_Size` mas sem verificação de erro.

source: Return a pointer to the contents of *o*. The pointer refers to the internal buffer of *o*, which consists of ``len(o) + 1`` bytes. The last byte in the buffer is always null, regardless of whether there are any other null bytes. The data must not be modified in any way, unless the object was just created using ``PyBytes_FromStringAndSize(NULL, size)``. It must not be deallocated. If *o* is not a bytes object at all, :c:func:`PyBytes_AsString` returns ``NULL`` and raises :exc:`TypeError`.
pt_br: Retorna um ponteiro para o conteúdo de *o*. O ponteiro se refere ao buffer interno de *o*, que consiste em ``len(o) + 1`` bytes. O último byte no buffer é sempre nulo, independentemente de haver outros bytes nulos. Os dados não devem ser modificados de forma alguma, a menos que o objeto tenha sido criado usando ``PyBytes_FromStringAndSize(NULL, size)``. Não deve ser desalocado. Se *o* não é um objeto de bytes, :c:func:`PyBytes_AsString` retorna ``NULL`` e levanta :exc:`TypeError`.

source: Macro form of :c:func:`PyBytes_AsString` but without error checking.
pt_br: Forma macro de: c: func: `PyBytes_AsString` mas sem verificação de erro.

source: Return the null-terminated contents of the object *obj* through the output variables *buffer* and *length*.
pt_br: Retornar os conteúdos terminados nulos do objeto *obj* através das variáveis de saída * buffer* e *length*.

source: If *length* is ``NULL``, the bytes object may not contain embedded null bytes; if it does, the function returns ``-1`` and a :exc:`ValueError` is raised.
pt_br: Se *length* for ``NULL``, o objeto bytes não poderá conter bytes nulos incorporados; se isso acontecer, a função retornará ``-1`` e a :exc:`ValueError` será levantado.

source: The buffer refers to an internal buffer of *obj*, which includes an additional null byte at the end (not counted in *length*). The data must not be modified in any way, unless the object was just created using ``PyBytes_FromStringAndSize(NULL, size)``. It must not be deallocated. If *obj* is not a bytes object at all, :c:func:`PyBytes_AsStringAndSize` returns ``-1`` and raises :exc:`TypeError`.
pt_br: O buffer refere-se a um buffer interno de *obj *, que inclui um byte nulo adicional no final (não contado em *comprimento*). Os dados não devem ser modificados de forma alguma, a menos que o objeto tenha sido criado apenas usando ``PyBytes_FromStringAndSize(NULL, size)``. Não deve ser desalinhado. Se *obj* não é um objeto bytes, c: func: `PyBytes_AsStringAndSize` retorna ``-1`` e eleva: exc:` TypeError`.

source: Previously, :exc:`TypeError` was raised when embedded null bytes were encountered in the bytes object.
pt_br: Anteriormente: exc: `TypeError` foi criado quando os bytes nulos incorporados foram encontrados no objeto bytes.

source: Create a new bytes object in *\*bytes* containing the contents of *newpart* appended to *bytes*; the caller will own the new reference. The reference to the old value of *bytes* will be stolen. If the new object cannot be created, the old reference to *bytes* will still be discarded and the value of *\*bytes* will be set to ``NULL``; the appropriate exception will be set.
pt_br: Cria um novo objeto de bytes em *\*bytes* contendo o conteúdo de *newpart* anexado a *bytes*; o invocador será o proprietário da nova referência. A referência ao valor antigo de *bytes* será roubada. Se o novo objeto não puder ser criado, a antiga referência a *bytes* ainda será descartada e o valor de *\*bytes* será definido como ``NULL``; a exceção apropriada será definida.

source: Create a new bytes object in *\*bytes* containing the contents of *newpart* appended to *bytes*. This version decrements the reference count of *newpart*.
pt_br: Crie um novo objeto bytes em *\*bytes* contendo o conteúdo de *newpart* anexado a *bytes*. Esta versão diminui a contagem de *newpart*.

source: A way to resize a bytes object even though it is "immutable". Only use this to build up a brand new bytes object; don't use this if the bytes may already be known in other parts of the code. It is an error to call this function if the refcount on the input bytes object is not one. Pass the address of an existing bytes object as an lvalue (it may be written into), and the new size desired. On success, *\*bytes* holds the resized bytes object and ``0`` is returned; the address in *\*bytes* may differ from its input value. If the reallocation fails, the original bytes object at *\*bytes* is deallocated, *\*bytes* is set to ``NULL``, :exc:`MemoryError` is set, and ``-1`` is returned.
pt_br: Uma maneira de redimensionar um objeto de bytes, mesmo que seja "imutável". Use isso apenas para criar um novo objeto de bytes; não use isso se os bytes já puderem ser conhecidos em outras partes do código. É um erro invocar essa função se o refcount no objeto de bytes de entrada não for um. Passe o endereço de um objeto de bytes existente como um lvalue (pode ser gravado) e o novo tamanho desejado. Em caso de sucesso, *\*bytes* mantém o objeto de bytes redimensionados e ``0`` é retornado; o endereço em *\*bytes* pode diferir do seu valor de entrada. Se a realocação falhar, o objeto de bytes originais em *\*bytes* é desalocado, *\*bytes* é definido como ``NULL``, :exc:`MemoryError` é definido e ``-1`` é retornado.
