Repository: python/python-docs-pt-br
Catalog: c-api/call.po
Languages: pt_br

source: Call Protocol
pt_br: Protocolo de chamada

source: CPython supports two different calling protocols: *tp_call* and vectorcall.
pt_br: O CPython permite dois protocolos de chamada: *tp_call* e vectorcall.

source: The *tp_call* Protocol
pt_br: O protocolo *tp_call*

source: Instances of classes that set :c:member:`~PyTypeObject.tp_call` are callable. The signature of the slot is::
pt_br: Instâncias de classe que definem :c:member:`~PyTypeObject.tp_call` são chamáveis. A assinatura do slot é::

source: A call is made using a tuple for the positional arguments and a dict for the keyword arguments, similarly to ``callable(*args, **kwargs)`` in Python code. *args* must be non-NULL (use an empty tuple if there are no arguments) but *kwargs* may be *NULL* if there are no keyword arguments.
pt_br: Uma chamada é feita usando uma tupla para os argumentos posicionais e um dicionário para os argumentos nomeados, similar a ``callable(*args, **kwargs)`` no Python. *args* não pode ser nulo (utilize uma tupla vazia se não houver argumentos), mas *kwargs* pode ser *NULL* se não houver argumentos nomeados.

source: This convention is not only used by *tp_call*: :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_init` also pass arguments this way.
pt_br: Esta convenção não é somente usada por *tp_call*: :c:member:`~PyTypeObject.tp_new` e :c:member:`~PyTypeObject.tp_init` também passam argumento dessa forma.

source: To call an object, use :c:func:`PyObject_Call` or another :ref:`call API <capi-call>`.
pt_br: Para chamar um objeto, use :c:func:`PyObject_Call` ou outra :ref:`call API <capi-call>`.

source: The Vectorcall Protocol
pt_br: O protocolo vectorcall

source: The vectorcall protocol was introduced in :pep:`590` as an additional protocol for making calls more efficient.
pt_br: O protocolo vectorcall foi introduzido pela :pep:`590` como um protocolo adicional para tornar invocações mais eficientes.

source: As rule of thumb, CPython will prefer the vectorcall for internal calls if the callable supports it. However, this is not a hard rule. Additionally, some third-party extensions use *tp_call* directly (rather than using :c:func:`PyObject_Call`). Therefore, a class supporting vectorcall must also implement :c:member:`~PyTypeObject.tp_call`. Moreover, the callable must behave the same regardless of which protocol is used. The recommended way to achieve this is by setting :c:member:`~PyTypeObject.tp_call` to :c:func:`PyVectorcall_Call`. This bears repeating:
pt_br: Como regra de bolso. CPython vai preferir o vectorcall para invocações internas se o chamável suportar. Entretanto, isso não é uma regra rígida. Ademais, alguma extensões de terceiros usam diretamente *tp_call* (em vez de utilizar :c:func:`PyObject_Call`). Portanto, uma classe que suporta vectorcall precisa também implementar :c:member:`~PyTypeObject.tp_call`. Além disso, o chamável precisa se comportar da mesma forma independe de qual protocolo é utilizado. A forma recomendada de alcançar isso é definindo :c:member:`~PyTypeObject.tp_call` para :c:func:`PyVectorcall_Call`. Vale a pena repetir:

source: A class supporting vectorcall **must** also implement :c:member:`~PyTypeObject.tp_call` with the same semantics.
pt_br: Uma classe que suporte vectorcall também **precisa** implementar :c:member:`~PyTypeObject.tp_call` com a mesma semântica.

source: A class should not implement vectorcall if that would be slower than *tp_call*. For example, if the callee needs to convert the arguments to an args tuple and kwargs dict anyway, then there is no point in implementing vectorcall.
pt_br: Uma classe não deve implementar vectorcall se for mais lento que *tp_call*. Por exemplo, se o chamador precisa converter os argumentos para uma tupla args e um dicionário kwargs de qualquer forma, então não é necessário implementar vectorcall.

source: Classes can implement the vectorcall protocol by enabling the :const:`Py_TPFLAGS_HAVE_VECTORCALL` flag and setting :c:member:`~PyTypeObject.tp_vectorcall_offset` to the offset inside the object structure where a *vectorcallfunc* appears. This is a pointer to a function with the following signature:
pt_br: Classes podem implementar o protocolo de chamada de vetor ativando a flag :const:`Py_TPFLAGS_HAVE_VECTORCALL` e configurando :c:member:`~PyTypeObject.tp_vectorcall_offset` para o offset dentro da estrutura do objeto onde uma *vectorcallfunc* aparece. Este é um ponteiro para uma função com a seguinte assinatura:

source: *callable* is the object being called.
pt_br: *callable* é o objeto sendo chamado.

source: *args* is a C array consisting of the positional arguments followed by the
pt_br: *args* é um array C formado pelos argumentos posicionais seguidos de

source: values of the keyword arguments. This can be *NULL* if there are no arguments.
pt_br: valores dos argumentos nomeados. Este pode ser *NULL* se não existirem argumentos.

source: *nargsf* is the number of positional arguments plus possibly the
pt_br: *nargsf* é o número de argumentos posicionais somado á possível

source: :const:`PY_VECTORCALL_ARGUMENTS_OFFSET` flag. To get the actual number of positional arguments from *nargsf*, use :c:func:`PyVectorcall_NARGS`.
pt_br: Sinalizador :const:`PY_VECTORCALL_ARGUMENTS_OFFSET`. Para obter o número real de argumentos posicionais de *nargsf*, use :c:func:`PyVectorcall_NARGS`.

source: *kwnames* is a tuple containing the names of the keyword arguments;
pt_br: *kwnames* é uma tupla contendo os nomes dos argumentos nomeados;

source: in other words, the keys of the kwargs dict. These names must be strings (instances of ``str`` or a subclass) and they must be unique. If there are no keyword arguments, then *kwnames* can instead be *NULL*.
pt_br: em outras palavras, as chaves do dicionário kwargs. Estes nomes devem ser strings (instâncias de ``str`` ou uma subclasse) e eles devem ser únicos. Se não existem argumentos nomeados, então *kwnames* deve então ser *NULL*.

source: If this flag is set in a vectorcall *nargsf* argument, the callee is allowed to temporarily change ``args[-1]``. In other words, *args* points to argument 1 (not 0) in the allocated vector. The callee must restore the value of ``args[-1]`` before returning.
pt_br: Se esse sinalizador é definido em um argumento *nargsf* do vectorcall, deve ser permitido ao chamado temporariamente mudar ``args[-1]``. Em outras palavras, *args* aponta para o argumento 1 (não 0) no vetor alocado. O chamado deve restaurar o valor de ``args[-1]`` antes de retornar.

source: For :c:func:`PyObject_VectorcallMethod`, this flag means instead that ``args[0]`` may be changed.
pt_br: Para :c:func:`PyObject_VectorcallMethod`, este sinalizador significa que ``args[0]`` pode ser alterado.

source: Whenever they can do so cheaply (without additional allocation), callers are encouraged to use :const:`PY_VECTORCALL_ARGUMENTS_OFFSET`. Doing so will allow callables such as bound methods to make their onward calls (which include a prepended *self* argument) very efficiently.
pt_br: Sempre que podem realizar a um custo tão baixo (sem alocações adicionais), invocadores são encorajados a usar :const:`PY_VECTORCALL_ARGUMENTS_OFFSET`. Isso permitirá invocados como métodos vinculados a instâncias fazerem suas próprias invocações (o que inclui um argumento *self*) muito eficientemente.

source: To call an object that implements vectorcall, use a :ref:`call API <capi-call>` function as with any other callable. :c:func:`PyObject_Vectorcall` will usually be most efficient.
pt_br: Para invocar um objeto que implementa vectorcall, utilize a função :ref:`call API <capi-call>` como qualquer outra invocável. :c:func:`PyObject_Vectorcall` será normalmente mais eficiente.

source: In CPython 3.8, the vectorcall API and related functions were available provisionally under names with a leading underscore: ``_PyObject_Vectorcall``, ``_Py_TPFLAGS_HAVE_VECTORCALL``, ``_PyObject_VectorcallMethod``, ``_PyVectorcall_Function``, ``_PyObject_CallOneArg``, ``_PyObject_CallMethodNoArgs``, ``_PyObject_CallMethodOneArg``. Additionally, ``PyObject_VectorcallDict`` was available as ``_PyObject_FastCallDict``. The old names are still defined as aliases of the new, non-underscored names.
pt_br: No CPython 3.8, a API vectorcall e funções relacionadas estavam disponíveis provisoriamente sob nomes com um sublinhado inicial: ``_PyObject_Vectorcall``, ``_Py_TPFLAGS_HAVE_VECTORCALL``, ``_PyObject_VectorcallMethod``, ``_PyVectorcall_Function``, ``_PyObject_CallOneArg``, ``_PyObject_CallMethodNoArgs``, ``_PyObject_CallMethodOneArg``. Além disso, ``PyObject_VectorcallDict`` estava disponível como ``_PyObject_FastCallDict``. Os nomes antigos ainda estão definidos como apelidos para os novos nomes sem o sublinhado.

source: Recursion Control
pt_br: Controle de recursão

source: When using *tp_call*, callees do not need to worry about :ref:`recursion <recursion>`: CPython uses :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` for calls made using *tp_call*.
pt_br: Quando utilizando *tp_call*, invocadores não precisam se preocupar sobre :ref:`recursão <recursion>`: CPython usa :c:func:`Py_EnterRecursiveCall` e :c:func:`Py_LeaveRecursiveCall` para chamadas utilizando *tp_call*.

source: For efficiency, this is not the case for calls done using vectorcall: the callee should use *Py_EnterRecursiveCall* and *Py_LeaveRecursiveCall* if needed.
pt_br: Por questão de eficiência, este não é o caso de chamadas utilizando o vectorcall: o que chama deve utilizar *Py_EnterRecursiveCall* e *Py_LeaveRecursiveCall* se necessário.

source: Vectorcall Support API
pt_br: API de suporte à chamada de vetores

source: Given a vectorcall *nargsf* argument, return the actual number of arguments. Currently equivalent to::
pt_br: Dado um argumento de chamada de vetor *nargsf*, retorna o número real de argumentos. Atualmente equivalente a::

source: However, the function ``PyVectorcall_NARGS`` should be used to allow for future extensions.
pt_br: Entretanto, a função ``PyVectorcall_NARGS`` deve ser usada para permitir para futuras extensões.

source: This function is not part of the :ref:`limited API <stable>`.
pt_br: Esta função não é parte da :ref:`limited API <stable>`.

source: If *op* does not support the vectorcall protocol (either because the type does not or because the specific instance does not), return *NULL*. Otherwise, return the vectorcall function pointer stored in *op*. This function never raises an exception.
pt_br: Se *op* não suporta o protocolo de chamada de vetor (seja porque o tipo ou a instância específica não suportam), retorne *NULL*. Se não, retorne o ponteiro da função chamada de vetor armazenado em *op*. Esta função nunca levanta uma exceção.

source: This is mostly useful to check whether or not *op* supports vectorcall, which can be done by checking ``PyVectorcall_Function(op) != NULL``.
pt_br: É mais útil checar se *op* suporta ou não chamada de vetor, o que pode ser feito checando ``PyVectorcall_Function(op) != NULL``.

source: Call *callable*'s :c:type:`vectorcallfunc` with positional and keyword arguments given in a tuple and dict, respectively.
pt_br: Chama o :c:type:`vectorcallfunc` de *callable* com argumentos posicionais e nomeados dados em uma tupla e dicionário, respectivamente.

source: This is a specialized function, intended to be put in the :c:member:`~PyTypeObject.tp_call` slot or be used in an implementation of ``tp_call``. It does not check the :const:`Py_TPFLAGS_HAVE_VECTORCALL` flag and it does not fall back to ``tp_call``.
pt_br: Esta é uma função especializada, feita para ser colocada no slot :c:member:`~PyTypeObject.tp_call` ou usada em uma implementação de ``tp_call``. Ela não checa a flag :const:`Py_TPFLAGS_HAVE_VECTORCALL` e não retorna para ``tp_call``.

source: Object Calling API
pt_br: API de chamada de objetos

source: Various functions are available for calling a Python object. Each converts its arguments to a convention supported by the called object – either *tp_call* or vectorcall. In order to do as little conversion as possible, pick one that best fits the format of data you have available.
pt_br: Várias funções estão disponíveis para chamar um objeto Python. Cada uma converte seus argumentos para uma convenção suportada pelo objeto chamado – seja *tp_call* ou chamada de vetor. Para fazer o mínimo possível de conversões, escolha um que melhor se adapte ao formato de dados que você tem disponível.

source: The following table summarizes the available functions; please see individual documentation for details.
pt_br: A tabela a seguir resume as funções disponíveis; por favor, veja a documentação individual para detalhes.

source: Function
pt_br: Função

source: callable
pt_br: chamável

source: tuple
pt_br: tupla

source: 1 object
pt_br: 1 objeto

source: tuple/``NULL``
pt_br: tupla/``NULL``

source: format
pt_br: formato

source: variadic
pt_br: variádica

source: obj + name
pt_br: obj + nome

source: arg + name
pt_br: arg + nome

source: Call a callable Python object *callable*, with arguments given by the tuple *args*, and named arguments given by the dictionary *kwargs*.
pt_br: Chama um objeto Python chamável de *callable*, com argumentos dados pela tupla *args*, e argumentos nomeados dados pelo dicionário *kwargs*.

source: *args* must not be *NULL*; use an empty tuple if no arguments are needed. If no named arguments are needed, *kwargs* can be *NULL*.
pt_br: *args* não deve ser *NULL*; use uma tupla vazia se não precisar de argumentos. Se nenhum argumento nomeado é necessário, *kwargs* pode ser *NULL*.

source: Return the result of the call on success, or raise an exception and return *NULL* on failure.
pt_br: Retorna o resultado da chamada em sucesso, ou levanta uma exceção e retorna *NULL* em caso de falha.

source: This is the equivalent of the Python expression: ``callable(*args, **kwargs)``.
pt_br: Esse é o equivalente da expressão Python: ``callable(*args, **kwargs)``.

source: Call a callable Python object *callable* without any arguments. It is the most efficient way to call a callable Python object without any argument.
pt_br: Chama um objeto Python chamável de *callable* sem nenhum argumento. É o jeito mais eficiente de chamar um objeto Python sem nenhum argumento.

source: Call a callable Python object *callable* with exactly 1 positional argument *arg* and no keyword arguments.
pt_br: Chama um objeto Python chamável de *callable* com exatamente 1 argumento posicional *arg* e nenhum argumento nomeado.

source: Call a callable Python object *callable*, with arguments given by the tuple *args*. If no arguments are needed, then *args* can be *NULL*.
pt_br: Chama um objeto Python chamável de *callable* com argumentos dados pela tupla *args*. Se nenhum argumento é necessário, *args* pode ser *NULL*.

source: This is the equivalent of the Python expression: ``callable(*args)``.
pt_br: Este é o equivalente da expressão Python: ``callable(*args)``.

source: Call a callable Python object *callable*, with a variable number of C arguments. The C arguments are described using a :c:func:`Py_BuildValue` style format string. The format can be *NULL*, indicating that no arguments are provided.
pt_br: Chama um objeto Python chamável de *callable*, com um número variável de argumentos C. Os argumentos C são descritos usando uma string de estilo no formato :c:func:`Py_BuildValue`. O formato pode ser *NULL*, indicando que nenhum argumento foi provido.

source: Note that if you only pass :c:type:`PyObject *` args, :c:func:`PyObject_CallFunctionObjArgs` is a faster alternative.
pt_br: Observe que se você passar apenas argumentos :c:type:`PyObject *` , :c:func:`PyObject_CallFunctionObjArgs` é uma alternativa mais rápida.

source: The type of *format* was changed from ``char *``.
pt_br: O tipo de *format* foi mudado de ``char *``.

source: Call the method named *name* of object *obj* with a variable number of C arguments. The C arguments are described by a :c:func:`Py_BuildValue` format string that should produce a tuple.
pt_br: Chama o método chamado *name* do objeto *obj* com um número variável de argumentos C. Os argumentos C são descritos com uma string de formato :c:func:`Py_BuildValue` que deve produzir uma tupla.

source: The format can be *NULL*, indicating that no arguments are provided.
pt_br: O formato pode ser *NULL*, indicado que nenhum argumento foi provido.

source: This is the equivalent of the Python expression: ``obj.name(arg1, arg2, ...)``.
pt_br: Este é o equivalente da expressão Python: ``obj.name(arg1, arg2, ...)``.

source: Note that if you only pass :c:type:`PyObject *` args, :c:func:`PyObject_CallMethodObjArgs` is a faster alternative.
pt_br: Note que é uma alternativa mais rápida se você só passar :c:type:`PyObject *` args, :c:func:`PyObject_CallMethodObjArgs`.

source: The types of *name* and *format* were changed from ``char *``.
pt_br: Os tipos de *name* e *format* foram mudados de ``char *``.

source: Call a callable Python object *callable*, with a variable number of :c:type:`PyObject *` arguments. The arguments are provided as a variable number of parameters followed by *NULL*.
pt_br: Chamar um objeto python chamável *callable*, com um numero variável de argumentos :c:type:`PyObject *`. Os argumentos são fornecidos como um numero de parametros variáveis seguidos por *NULL*.

source: This is the equivalent of the Python expression: ``callable(arg1, arg2, ...)``.
pt_br: Este é o equivalente da expressão Python: ``callable(arg1, arg2, ...)``.

source: Call a method of the Python object *obj*, where the name of the method is given as a Python string object in *name*. It is called with a variable number of :c:type:`PyObject *` arguments. The arguments are provided as a variable number of parameters followed by *NULL*.
pt_br: Chamar um método do objeto python *obj*, onde o nome do método é dado como um objeto string *name*. Ele é chamado com um numero variável de argumentos :c:type:`PyObject *`. Os argumentos são fornecidos como um numero variável de parametros seguidos por *NULL*.

source: Call a method of the Python object *obj* without arguments, where the name of the method is given as a Python string object in *name*.
pt_br: Chama um método do objeto Python *obj* sem argumentos, onde o nome do método é fornecido como um objeto string do Python em *name*.

source: Call a method of the Python object *obj* with a single positional argument *arg*, where the name of the method is given as a Python string object in *name*.
pt_br: Chama um método do objeto Python *obj* com um argumento posicional *arg*, onde o nome do método é fornecido como um objeto string do Python em *name*.

source: Call a callable Python object *callable*. The arguments are the same as for :c:type:`vectorcallfunc`. If *callable* supports vectorcall_, this directly calls the vectorcall function stored in *callable*.
pt_br: Chama um objeto Python chamável *callable*. Os argumentos são os mesmos de :c:type:`vectorcallfunc`. Se *callable* tiver suporte a vectorcall_, isso chamará diretamente a função vectorcall armazenada em *callable*.

source: Call *callable* with positional arguments passed exactly as in the vectorcall_ protocol, but with keyword arguments passed as a dictionary *kwdict*. The *args* array contains only the positional arguments.
pt_br: Chama *callable* com argumentos posicionais passados exatamente como no protocolo vectorcall_, mas com argumentos nomeados passados como um dicionário *kwdict*. O array *args* contém apenas os argumentos posicionais.

source: Regardless of which protocol is used internally, a conversion of arguments needs to be done. Therefore, this function should only be used if the caller already has a dictionary ready to use for the keyword arguments, but not a tuple for the positional arguments.
pt_br: Independentemente de qual protocolo é usado internamente, uma conversão de argumentos precisa ser feita. Portanto, esta função só deve ser usada se o chamador já tiver um dicionário pronto para usar para os argumentos nomeados, mas não uma tupla para os argumentos posicionais.

source: Call a method using the vectorcall calling convention. The name of the method is given as a Python string *name*. The object whose method is called is *args[0]*, and the *args* array starting at *args[1]* represents the arguments of the call. There must be at least one positional argument. *nargsf* is the number of positional arguments including *args[0]*, plus :const:`PY_VECTORCALL_ARGUMENTS_OFFSET` if the value of ``args[0]`` may temporarily be changed. Keyword arguments can be passed just like in :c:func:`PyObject_Vectorcall`.
pt_br: Chama um método usando a convenção de chamada vectorcall. O nome do método é dado como uma string Python *name*. O objeto cujo método é chamado é *args[0]*, e o array *args* começando em *args[1]* representa os argumentos da chamada. Deve haver pelo menos um argumento posicional. *nargsf* é o número de argumentos posicionais incluindo *args[0]*, mais :const:`PY_VECTORCALL_ARGUMENTS_OFFSET` se o valor de ``args[0]`` puder ser alterado temporariamente. Argumentos nomeados podem ser passados como em :c:func:`PyObject_Vectorcall`.

source: If the object has the :const:`Py_TPFLAGS_METHOD_DESCRIPTOR` feature, this will call the unbound method object with the full *args* vector as arguments.
pt_br: Se o objeto tem a feature :const:`Py_TPFLAGS_METHOD_DESCRIPTOR`, isso irá chamar o objeto de método não vinculado com o vetor *args* inteiro como argumentos.

source: Call Support API
pt_br: API de suporte a chamadas

source: Determine if the object *o* is callable. Return ``1`` if the object is callable and ``0`` otherwise. This function always succeeds.
pt_br: Determine se o objeto *o* é chamável. Devolva ``1`` se o objeto é chamável e ``0`` caso contrário. Esta função sempre tem êxito.
