Repository: python/python-docs-pt-br
Catalog: c-api/capsule.po
Languages: pt_br

source: Refer to :ref:`using-capsules` for more information on using these objects.
pt_br: Consulte :ref:`using-capsules` para obter mais informações sobre o uso desses objetos.

source: This subtype of :c:type:`PyObject` represents an opaque value, useful for C extension modules which need to pass an opaque value (as a :c:expr:`void*` pointer) through Python code to other C code. It is often used to make a C function pointer defined in one module available to other modules, so the regular import mechanism can be used to access C APIs defined in dynamically loaded modules.
pt_br: Este subtipo de :c:type:`PyObject` representa um valor opaco, útil para módulos de extensão C que precisam passar um valor opaco (como ponteiro :c:expr:`void*`) através do código Python para outro código C . É frequentemente usado para disponibilizar um ponteiro de função C definido em um módulo para outros módulos, para que o mecanismo de importação regular possa ser usado para acessar APIs C definidas em módulos carregados dinamicamente.

source: The type of a destructor callback for a capsule. Defined as::
pt_br: O tipo de um retorno de chamada destruidor para uma cápsula. Definido como::

source: See :c:func:`PyCapsule_New` for the semantics of PyCapsule_Destructor callbacks.
pt_br: Veja :c:func:`PyCapsule_New` para a semântica dos retornos de chamada PyCapsule_Destructor.

source: Return true if its argument is a :c:type:`PyCapsule`. This function always succeeds.
pt_br: Retorna true se seu argumento é um :c:type:`PyCapsule`. Esta função sempre tem sucesso.

source: Create a :c:type:`PyCapsule` encapsulating the *pointer*. The *pointer* argument may not be ``NULL``.
pt_br: Cria um :c:type:`PyCapsule` que encapsula o *ponteiro*. O argumento *pointer* pode não ser ``NULL``.

source: On failure, set an exception and return ``NULL``.
pt_br: Em caso de falha, define uma exceção e retorna ``NULL``.

source: The *name* string may either be ``NULL`` or a pointer to a valid C string. If non-``NULL``, this string must outlive the capsule. (Though it is permitted to free it inside the *destructor*.)
pt_br: A string *name* pode ser ``NULL`` ou um ponteiro para uma string C válida. Se não for ``NULL``, essa string deverá sobreviver à cápsula. (Embora seja permitido liberá-lo dentro do *descructor*.)

source: If the *destructor* argument is not ``NULL``, it will be called with the capsule as its argument when it is destroyed.
pt_br: Se o argumento *destructor* não for ``NULL``, ele será chamado com a cápsula como argumento quando for destruído.

source: If this capsule will be stored as an attribute of a module, the *name* should be specified as ``modulename.attributename``. This will enable other modules to import the capsule using :c:func:`PyCapsule_Import`.
pt_br: Se esta cápsula for armazenada como um atributo de um módulo, o *name* deve ser especificado como ``modulename.attributename``. Isso permitirá que outros módulos importem a cápsula usando :c:func:`PyCapsule_Import`.

source: Retrieve the *pointer* stored in the capsule. On failure, set an exception and return ``NULL``.
pt_br: Recupera o *pointer* armazenado na cápsula. Em caso de falha, define uma exceção e retorna ``NULL``.

source: The *name* parameter must compare exactly to the name stored in the capsule. If the name stored in the capsule is ``NULL``, the *name* passed in must also be ``NULL``. Python uses the C function :c:func:`!strcmp` to compare capsule names.
pt_br: O parâmetro *name* deve ser comparado exatamente com o nome armazenado na cápsula. Se o nome armazenado na cápsula for ``NULL``, o *name* passado também deve ser ``NULL``. Python usa a função C :c:func:`!strcmp` para comparar nomes de cápsulas.

source: Return the current destructor stored in the capsule. On failure, set an exception and return ``NULL``.
pt_br: Retorna o destruidor atual armazenado na cápsula. Em caso de falha, define uma exceção e retorna ``NULL``.

source: It is legal for a capsule to have a ``NULL`` destructor. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
pt_br: É legal para uma cápsula ter um destruidor ``NULL``. Isso torna um código de retorno ``NULL`` um tanto ambíguo; use :c:func:`PyCapsule_IsValid` ou :c:func:`PyErr_Occurred` para desambiguar.

source: Return the current context stored in the capsule. On failure, set an exception and return ``NULL``.
pt_br: Retorna o contexto atual armazenado na cápsula. Em caso de falha, define uma exceção e retorna ``NULL``.

source: It is legal for a capsule to have a ``NULL`` context. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
pt_br: É legal para uma cápsula ter um contexto ``NULL``. Isso torna um código de retorno ``NULL`` um tanto ambíguo; use :c:func:`PyCapsule_IsValid` ou :c:func:`PyErr_Occurred` para desambiguar.

source: Return the current name stored in the capsule. On failure, set an exception and return ``NULL``.
pt_br: Retorna o nome atual armazenado na cápsula. Em caso de falha, define uma exceção e retorna ``NULL``.

source: It is legal for a capsule to have a ``NULL`` name. This makes a ``NULL`` return code somewhat ambiguous; use :c:func:`PyCapsule_IsValid` or :c:func:`PyErr_Occurred` to disambiguate.
pt_br: É legal para uma cápsula ter um nome ``NULL``. Isso torna um código de retorno ``NULL`` um tanto ambíguo; use :c:func:`PyCapsule_IsValid` ou :c:func:`PyErr_Occurred` para desambiguar.

source: Import a pointer to a C object from a capsule attribute in a module. The *name* parameter should specify the full name to the attribute, as in ``module.attribute``. The *name* stored in the capsule must match this string exactly.
pt_br: Importa um ponteiro para um objeto C de um atributo de cápsula em um módulo. O parâmetro *name* deve especificar o nome completo do atributo, como em ``module.attribute``. O *name* armazenado na cápsula deve corresponder exatamente a essa string.

source: This function splits *name* on the ``.`` character, and imports the first element. It then processes further elements using attribute lookups.
pt_br: Esta função divide *name* no caractere ``.`` e importa o primeiro elemento. Em seguida, processa os elementos seguintes usando pesquisas de atributos.

source: Return the capsule's internal *pointer* on success. On failure, set an exception and return ``NULL``.
pt_br: Retorna o ponteiro interno *pointer* da cápsula com sucesso. Em caso de falha, define uma exceção e retorna ``NULL``.

source: If *name* points to an attribute of some submodule or subpackage, this submodule or subpackage must be previously imported using other means (for example, by using :c:func:`PyImport_ImportModule`) for the attribute lookups to succeed.
pt_br: Se *name* apontar para um atributo de algum submódulo ou subpacote, esse submódulo ou subpacote deverá ser importado previamente usando outros meios (por exemplo, usando :c:func:`PyImport_ImportModule`) para que as pesquisas de atributos sejam bem-sucedidas.

source: *no_block* has no effect anymore.
pt_br: *no_block* não tem mais efeito.

source: Determines whether or not *capsule* is a valid capsule. A valid capsule is non-``NULL``, passes :c:func:`PyCapsule_CheckExact`, has a non-``NULL`` pointer stored in it, and its internal name matches the *name* parameter. (See :c:func:`PyCapsule_GetPointer` for information on how capsule names are compared.)
pt_br: Determina se *capsule* é ou não uma cápsula válida. Uma cápsula válida é diferente de ``NULL``, passa :c:func:`PyCapsule_CheckExact`, possui um ponteiro diferente de ``NULL`` armazenado e seu nome interno corresponde ao parâmetro *name*. (Consulte :c:func:`PyCapsule_GetPointer` para obter informações sobre como os nomes das cápsulas são comparados.)

source: In other words, if :c:func:`PyCapsule_IsValid` returns a true value, calls to any of the accessors (any function starting with ``PyCapsule_Get``) are guaranteed to succeed.
pt_br: Em outras palavras, se :c:func:`PyCapsule_IsValid` retornar um valor verdadeiro, as chamadas para qualquer um dos acessadores (qualquer função que comece com ``PyCapsule_Get``) terão êxito garantido.

source: Return a nonzero value if the object is valid and matches the name passed in. Return ``0`` otherwise. This function will not fail.
pt_br: Retorna um valor diferente de zero se o objeto for válido e corresponder ao nome passado. Retorna ``0`` caso contrário. Esta função não falhará.

source: Set the context pointer inside *capsule* to *context*.
pt_br: Define o ponteiro de contexto dentro de *capsule* para *context*.

source: Return ``0`` on success. Return nonzero and set an exception on failure.
pt_br: Retorna ``0`` em caso de sucesso. Retorna diferente de zero e define uma exceção em caso de falha.

source: Set the destructor inside *capsule* to *destructor*.
pt_br: Define o destrutor dentro de *capsule* para *destructor*.

source: Set the name inside *capsule* to *name*. If non-``NULL``, the name must outlive the capsule. If the previous *name* stored in the capsule was not ``NULL``, no attempt is made to free it.
pt_br: Define o nome dentro de *capsule* como *name*. Se não for ``NULL``, o nome deve sobreviver à cápsula. Se o *name* anterior armazenado na cápsula não era ``NULL``, nenhuma tentativa será feita para liberá-lo.

source: Set the void pointer inside *capsule* to *pointer*. The pointer may not be ``NULL``.
pt_br: Define o ponteiro nulo dentro de *capsule* para *pointer*. O ponteiro não pode ser ``NULL``.

source: object
pt_br: objeto

source: Capsule
pt_br: Cápsula
