Repository: python/python-docs-pt-br
Catalog: c-api/cell.po
Languages: pt_br

source: Cell Objects
pt_br: Objeto Célula

source: "Cell" objects are used to implement variables referenced by multiple scopes. For each such variable, a cell object is created to store the value; the local variables of each stack frame that references the value contains a reference to the cells from outer scopes which also use that variable. When the value is accessed, the value contained in the cell is used instead of the cell object itself. This de-referencing of the cell object requires support from the generated byte-code; these are not automatically de-referenced when accessed. Cell objects are not likely to be useful elsewhere.
pt_br: Objetos "Cell" são usados ​​para implementar variáveis ​​referenciadas por múltiplos escopos. Para cada variável, um objeto de célula é criado para armazenar o valor; as variáveis ​​locais de cada quadro de pilha que referencia o valor contém uma referência para as células de escopos externos que também usam essa variável. Quando o valor é acessado, o valor contido na célula é usado em vez do próprio objeto da célula. Essa des-referência do objeto da célula requer suporte do código de bytes gerado; estes não são automaticamente desprezados quando acessados. Objetos de células provavelmente não serão úteis em outro lugar.

source: The C structure used for cell objects.
pt_br: A estrutura C usada para objetos de célula.

source: The type object corresponding to cell objects.
pt_br: O objeto de tipo correspondente aos objetos de célula.

source: Return true if *ob* is a cell object; *ob* must not be ``NULL``.
pt_br: Retorna true se *ob* for um objeto de célula; *ob* não deve ser ``NULL``.

source: Create and return a new cell object containing the value *ob*. The parameter may be ``NULL``.
pt_br: Cria e retorna um novo objeto de célula contendo o valor *ob*. O parâmetro pode ser ``NULL``.

source: Return the contents of the cell *cell*.
pt_br: Retorna o conteúdo da célula * cell *.

source: Return the contents of the cell *cell*, but without checking that *cell* is non-``NULL`` and a cell object.
pt_br: Retorna o conteúdo da célula *cell*, mas sem verificar se *cell* não é ``NULL`` e um objeto de célula.

source: Set the contents of the cell object *cell* to *value*. This releases the reference to any current content of the cell. *value* may be ``NULL``. *cell* must be non-``NULL``; if it is not a cell object, ``-1`` will be returned. On success, ``0`` will be returned.
pt_br: Define o conteúdo do objeto da célula *cell* como *value*. Isso libera a referência a qualquer conteúdo atual da célula. *value* pode ser ``NULL``. *cell* não pode ser ``NULL``; se não for um objeto de célula, ``-1`` será retornado. Em caso de sucesso, ``0`` será retornado.

source: Sets the value of the cell object *cell* to *value*. No reference counts are adjusted, and no checks are made for safety; *cell* must be non-``NULL`` and must be a cell object.
pt_br: Define o valor do objeto da célula *cell* como *value*. Nenhuma contagem de referência é ajustada e nenhuma verificação é feita quanto à segurança; *cell* não pode ser ``NULL`` e deve ser um objeto de célula.
