Repository: python/python-docs-pt-br
Catalog: c-api/code.po
Languages: pt_br

source: Code Objects
pt_br: Objetos código

source: Code objects are a low-level detail of the CPython implementation. Each one represents a chunk of executable code that hasn't yet been bound into a function.
pt_br: Os objetos código são um detalhe de baixo nível da implementação do CPython. Cada um representa um pedaço de código executável que ainda não foi vinculado a uma função.

source: The C structure of the objects used to describe code objects. The fields of this type are subject to change at any time.
pt_br: A estrutura C dos objetos usados para descrever objetos código. Os campos deste tipo estão sujeitos a alterações a qualquer momento.

source: This is an instance of :c:type:`PyTypeObject` representing the Python :ref:`code object <code-objects>`.
pt_br: Esta é uma instância de :c:type:`PyTypeObject` representando o :ref:`objeto código <code-objects>` Python.

source: Return true if *co* is a :ref:`code object <code-objects>`. This function always succeeds.
pt_br: Retorna verdadeiro se *co* for um :ref:`objeto código <code-objects>`. Esta função sempre tem sucesso.

source: Return the number of :term:`free (closure) variables <closure variable>` in a code object.
pt_br: Retorna o número de :term:`variáveis livres (de clausura) <closure variable>` em um objeto código.

source: Return the position of the first :term:`free (closure) variable <closure variable>` in a code object.
pt_br: Retorna a posição da primeira :term:`variável livre (de clausura) <closure variable>` em um objeto código.

source: Renamed from ``PyCode_GetFirstFree`` as part of :ref:`unstable-c-api`. The old name is deprecated, but will remain available until the signature changes again.
pt_br: Renomeado de ``PyCode_GetFirstFree`` como parte da :ref:`unstable-c-api`. O nome antigo foi descontinuado, mas continuará disponível até que a assinatura mude novamente.

source: Return a new code object. If you need a dummy code object to create a frame, use :c:func:`PyCode_NewEmpty` instead.
pt_br: Devolve um novo objeto código. Se precisar de um objeto código vazio para criar um quadro, use :c:func:`PyCode_NewEmpty`

source: Since the definition of the bytecode changes often, calling :c:func:`PyUnstable_Code_New` directly can bind you to a precise Python version.
pt_br: Como a definição de bytecode muda constantemente, chamar :c:func:`PyUnstable_Code_New` diretamente pode vinculá-lo a uma versão de Python específica.

source: The many arguments of this function are inter-dependent in complex ways, meaning that subtle changes to values are likely to result in incorrect execution or VM crashes. Use this function only with extreme care.
pt_br: Os vários argumentos desta função são inter-dependentes de maneiras complexas, significando que mesmo alterações discretas de valor tem chances de resultar em execução incorreta ou erros fatais de VM. Tenha extremo cuidado ao usar esta função.

source: Added ``qualname`` and ``exceptiontable`` parameters.
pt_br: Adicionou os parâmetros ``qualname`` e ``exceptiontable``

source: Renamed from ``PyCode_New`` as part of :ref:`unstable-c-api`. The old name is deprecated, but will remain available until the signature changes again.
pt_br: Renomeado de ``PyCode_New`` como parte da :ref:`unstable-c-api`. O nome antigo foi descontinuado, mas continuará disponível até que a assinatura mude novamente.

source: Similar to :c:func:`PyUnstable_Code_New`, but with an extra "posonlyargcount" for positional-only arguments. The same caveats that apply to ``PyUnstable_Code_New`` also apply to this function.
pt_br: Similar a :c:func:`PyUnstable_Code_New`, mas com um "posonlyargcount" extra para argumentos somente-posicionais. As mesmas ressalvas que se aplicam a ``PyUnstable_Code_New`` também se aplicam a essa função.

source: as ``PyCode_NewWithPosOnlyArgs``
pt_br: Como ``PyCode_NewWithPosOnlyArgs``

source: Added ``qualname`` and ``exceptiontable`` parameters.
pt_br: Adicionados os parâmetros ``qualname`` e ``exceptiontable``

source: Renamed to ``PyUnstable_Code_NewWithPosOnlyArgs``. The old name is deprecated, but will remain available until the signature changes again.
pt_br: Renomeado para ``PyUnstable_Code_NewWithPosOnlyArgs``. O nome antigo foi descontinuado, mas continuará disponível até que a assinatura mude novamente.

source: Return a new empty code object with the specified filename, function name, and first line number. The resulting code object will raise an ``Exception`` if executed.
pt_br: Retorna um novo objeto código vazio com o nome de arquivo, nome da função e número da primeira linha especificados. O objeto código resultante irá levantar uma ``Exception`` se executado.

source: Return the line number of the instruction that occurs on or before ``byte_offset`` and ends after it. If you just need the line number of a frame, use :c:func:`PyFrame_GetLineNumber` instead.
pt_br: Retorna o número da linha da instrução que ocorre em ou antes de ``byte_offset`` e termina depois disso. Se você só precisa do número da linha de um quadro, use :c:func:`PyFrame_GetLineNumber`.

source: For efficiently iterating over the line numbers in a code object, use :pep:`the API described in PEP 626 <0626#out-of-process-debuggers-and-profilers>`.
pt_br: Para iterar eficientemente sobre os números de linha em um objeto código, use :pep:`a API descrita na PEP 626 <0626#out-of-process-debuggers-and-profilers>` .

source: Sets the passed ``int`` pointers to the source code line and column numbers for the instruction at ``byte_offset``. Sets the value to ``0`` when information is not available for any particular element.
pt_br: Define os ponteiros ``int`` passados para a linha do código-fonte e os números da coluna para a instrução em ``byte_offset``. Define o valor como ``0`` quando as informações não estão disponíveis para nenhum elemento em particular.

source: Returns ``1`` if the function succeeds and 0 otherwise.
pt_br: Retorna ``1`` se a função for bem-sucedida e 0 caso contrário.

source: Equivalent to the Python code ``getattr(co, 'co_code')``. Returns a strong reference to a :c:type:`PyBytesObject` representing the bytecode in a code object. On error, ``NULL`` is returned and an exception is raised.
pt_br: Equivalente ao código Python ``getattr(co, 'co_code')``. Retorna uma referência forte a um :c:type:`PyBytesObject` representando o bytecode em um objeto código. Em caso de erro, ``NULL`` é retornado e uma exceção é levantada.

source: This ``PyBytesObject`` may be created on-demand by the interpreter and does not necessarily represent the bytecode actually executed by CPython. The primary use case for this function is debuggers and profilers.
pt_br: Este ``PyBytesObject`` pode ser criado sob demanda pelo interpretador e não representa necessariamente o bytecode realmente executado pelo CPython. O caso de uso primário para esta função são depuradores e criadores de perfil.

source: Equivalent to the Python code ``getattr(co, 'co_varnames')``. Returns a new reference to a :c:type:`PyTupleObject` containing the names of the local variables. On error, ``NULL`` is returned and an exception is raised.
pt_br: Equivalente ao código Python ``getattr(co, 'co_varnames')``. Retorna uma nova referência a um :c:type:`PyTupleObject` contendo os nomes das variáveis locais. Em caso de erro, ``NULL`` é retornado e uma exceção é levantada.

source: Equivalent to the Python code ``getattr(co, 'co_cellvars')``. Returns a new reference to a :c:type:`PyTupleObject` containing the names of the local variables that are referenced by nested functions. On error, ``NULL`` is returned and an exception is raised.
pt_br: Equivalente ao código Python ``getattr(co, 'co_cellvars')``. Retorna uma nova referência a um :c:type:`PyTupleObject` contendo os nomes das variáveis locais referenciadas por funções aninhadas. Em caso de erro, ``NULL`` é retornado e uma exceção é levantada.

source: Equivalent to the Python code ``getattr(co, 'co_freevars')``. Returns a new reference to a :c:type:`PyTupleObject` containing the names of the :term:`free (closure) variables <closure variable>`. On error, ``NULL`` is returned and an exception is raised.
pt_br: Equivalente ao código Python ``getattr(co, 'co_freevars')``. Retorna uma nova referência a um :c:type:`PyTupleObject` contendo os nomes das :term:`variáveis livres (de clausura) <closure variable>`. Em caso de erro, ``NULL`` é retornado e uma exceção é levantada.

source: Register *callback* as a code object watcher for the current interpreter. Return an ID which may be passed to :c:func:`PyCode_ClearWatcher`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
pt_br: Registra *callback* como um observador do objeto código para o interpretador atual. Devolve um ID que pode ser passado para :c:func:`PyCode_ClearWatcher`. Em caso de erro (por exemplo, não há IDs de observadores disponíveis), devolve ``-1`` e define uma exceção.

source: Clear watcher identified by *watcher_id* previously returned from :c:func:`PyCode_AddWatcher` for the current interpreter. Return ``0`` on success, or ``-1`` and set an exception on error (e.g. if the given *watcher_id* was never registered.)
pt_br: Libera o observador identificado por *watcher_id* anteriormente retornado por :c:func:`PyCode_AddWatcher` para o interpretador atual. Retorna ``0`` em caso de sucesso ou ``-1`` em caso de erro e levanta uma exceção (ex., se o *watcher_id* dado não foi registrado.)

source: Enumeration of possible code object watcher events: - ``PY_CODE_EVENT_CREATE`` - ``PY_CODE_EVENT_DESTROY``
pt_br: Enumeração dos possíveis eventos de observador do objeto código: ``PY_CODE_EVENT_CREATE`` - ``PY_CODE_EVENT_DESTROY``

source: Type of a code object watcher callback function.
pt_br: Tipo de uma função de callback de observador de objeto código.

source: If *event* is ``PY_CODE_EVENT_CREATE``, then the callback is invoked after *co* has been fully initialized. Otherwise, the callback is invoked before the destruction of *co* takes place, so the prior state of *co* can be inspected.
pt_br: Se *evento* é ``PY_CODE_EVENT_CREATE``, então a função de retorno é invocada após *co* ter sido completamente inicializado. Senão, a função de retorno é invocada antes que a destruição de *co* ocorra, para que o estado anterior de *co* possa ser inspecionado.

source: If *event* is ``PY_CODE_EVENT_DESTROY``, taking a reference in the callback to the about-to-be-destroyed code object will resurrect it and prevent it from being freed at this time. When the resurrected object is destroyed later, any watcher callbacks active at that time will be called again.
pt_br: Se *evento* for ``PY_CODE_EVENT_DESTROY``, obter uma referência para a função de retorno do objeto-a-ser-destruído irá reativá-lo e impedirá que o objeto seja liberado. Quando o objeto reativado é posteriormente destruído, qualquer observador de funções de retorno ativos naquele momento serão chamados novamente.

source: Users of this API should not rely on internal runtime implementation details. Such details may include, but are not limited to, the exact order and timing of creation and destruction of code objects. While changes in these details may result in differences observable by watchers (including whether a callback is invoked or not), it does not change the semantics of the Python code being executed.
pt_br: Usuários desta API não devem depender de detalhes internos de implementação em tempo de execução. Tais detalhes podem incluir, mas não estão limitados a: o ordem e o momento exatos da criação e destruição de objetos código. Enquanto alterações nestes detalhes podem resultar em diferenças que são visíveis para os observadores (incluindo se uma função de retorno é chamada ou não), isso não muda a semântica do código Python executado.

source: If the callback sets an exception, it must return ``-1``; this exception will be printed as an unraisable exception using :c:func:`PyErr_WriteUnraisable`. Otherwise it should return ``0``.
pt_br: Se a função de retorno definir uma exceção, ela deverá retornar ``-1``; essa exceção será impressa como uma exceção não reprovável usando :c:func:`PyErr_WriteUnraisable`. Caso contrário, deverá retornar ``0``.

source: There may already be a pending exception set on entry to the callback. In this case, the callback should return ``0`` with the same exception still set. This means the callback may not call any other API that can set an exception unless it saves and clears the exception state first, and restores it before returning.
pt_br: É possível que já exista uma exceção pendente definida na entrada da função de retorno. Nesse caso, a função de retorno deve retornar ``0`` com a mesma exceção ainda definida. Isso significa que a função de retorno não pode chamar nenhuma outra API que possa definir uma exceção, a menos que salve e limpe o estado da exceção primeiro e o restaure antes de retornar.

source: Code Object Flags
pt_br: Sinalizadores de objetos código

source: Code objects contain a bit-field of flags, which can be retrieved as the :attr:`~codeobject.co_flags` Python attribute (for example using :c:func:`PyObject_GetAttrString`), and set using a *flags* argument to :c:func:`PyUnstable_Code_New` and similar functions.
pt_br: Objetos código contêm um campo de bits de sinalizadores, que podem ser recuperados como o atributo Python :attr:`~codeobject.co_flags` (por exemplo, usando :c:func:`PyObject_GetAttrString`) e definidos usando um argumento *flags* para :c:func:`PyUnstable_Code_New` e funções semelhantes.

source: Flags whose names start with ``CO_FUTURE_`` correspond to features normally selectable by :ref:`future statements <future>`. These flags can be used in :c:member:`PyCompilerFlags.cf_flags`. Note that many ``CO_FUTURE_`` flags are mandatory in current versions of Python, and setting them has no effect.
pt_br: Os sinalizadores cujos nomes começam com ``CO_FUTURE_`` correspondem a recursos normalmente selecionáveis por :ref:`instruções future <future>`. Esses sinalizadores podem ser usados em :c:member:`PyCompilerFlags.cf_flags`. Observe que muitos sinalizadores ``CO_FUTURE_`` são obrigatórios nas versões atuais do Python, e defini-los não tem efeito.

source: The following flags are available. For their meaning, see the linked documentation of their Python equivalents.
pt_br: Os seguintes sinalizador estão disponíveis. Para saber o significado delas, consulte a documentação vinculada de seus equivalentes em Python.

source: Flag
pt_br: Sinalizador

source: Meaning
pt_br: Significado

source: no effect (:py:data:`__future__.division`)
pt_br: sem efeito (:py:data:`__future__.division`)

source: no effect (:py:data:`__future__.absolute_import`)
pt_br: sem efeito (:py:data:`__future__.absolute_import`)

source: no effect (:py:data:`__future__.with_statement`)
pt_br: sem efeito (:py:data:`__future__.with_statement`)

source: no effect (:py:data:`__future__.print_function`)
pt_br: sem efeito (:py:data:`__future__.print_function`)

source: no effect (:py:data:`__future__.unicode_literals`)
pt_br: sem efeito (:py:data:`__future__.unicode_literals`)

source: no effect (:py:data:`__future__.generator_stop`)
pt_br: sem efeito (:py:data:`__future__.generator_stop`)

source: Extra information
pt_br: Informação adicional

source: To support low-level extensions to frame evaluation, such as external just-in-time compilers, it is possible to attach arbitrary extra data to code objects.
pt_br: Para oferece suporte a extensões de baixo nível de avaliação de quadro (frame), tais como compiladores "just-in-time", é possível anexar dados arbitrários adicionais a objetos código.

source: These functions are part of the unstable C API tier: this functionality is a CPython implementation detail, and the API may change without deprecation warnings.
pt_br: Estas funções são parte da camada instável da API C: Essa funcionalidade é um detalhe de implementação do CPython, e a API pode mudar sem avisos de descontinuidade.

source: Return a new opaque index value used to adding data to code objects.
pt_br: Retorna um novo e opaco valor de índice usado para adicionar dados a objetos código.

source: You generally call this function once (per interpreter) and use the result with ``PyCode_GetExtra`` and ``PyCode_SetExtra`` to manipulate data on individual code objects.
pt_br: Geralmente, você chama esta função apenas uma vez (por interpretador) e usa o resultado com ``PyCode_GetExtra`` e ``PyCode_SetExtra`` para manipular dados em objetos código individuais.

source: If *free* is not ``NULL``: when a code object is deallocated, *free* will be called on non-``NULL`` data stored under the new index. Use :c:func:`Py_DecRef` when storing :c:type:`PyObject`.
pt_br: Se *free* não for ``NULL``: quando o objeto código é desalocado, *free* será chamado em dados não-``NULL`` armazenados sob o novo índice. Use :c:func:`Py_DecRef` quando armazenar :c:type:`PyObject`.

source: as ``_PyEval_RequestCodeExtraIndex``
pt_br: como ``_PyEval_RequestCodeExtraIndex``

source: Renamed to ``PyUnstable_Eval_RequestCodeExtraIndex``. The old private name is deprecated, but will be available until the API changes.
pt_br: Renomeado para ``PyUnstable_Eval_RequestCodeExtraIndex``. O nome antigo nome privado foi descontinuado, mas continuará disponível até a mudança da API.

source: Set *extra* to the extra data stored under the given index. Return 0 on success. Set an exception and return -1 on failure.
pt_br: Define *extra* para os dados adicionais armazenados sob o novo índice dado. Retorna 0 em caso de sucesso. Define uma exceção e retorna -1 em caso de erro.

source: If no data was set under the index, set *extra* to ``NULL`` and return 0 without setting an exception.
pt_br: Se nenhum dado foi determinado sob o índice, define *extra* como ``NULL`` e retorna 0 sem definir nenhuma exceção.

source: as ``_PyCode_GetExtra``
pt_br: como ``_PyCode_GetExtra``

source: Renamed to ``PyUnstable_Code_GetExtra``. The old private name is deprecated, but will be available until the API changes.
pt_br: Renomeado para ``PyUnstable_Code_GetExtra``. O nome antigo privado foi descontinuado, mas continuará disponível até a mudança da API.

source: Set the extra data stored under the given index to *extra*. Return 0 on success. Set an exception and return -1 on failure.
pt_br: Define os dados extras armazenados sob o índice dado a *extra*. Retorna 0 em caso de sucesso. Define uma exceção e retorna -1 em caso de erro.

source: as ``_PyCode_SetExtra``
pt_br: como ``_PyCode_SetExtra``

source: Renamed to ``PyUnstable_Code_SetExtra``. The old private name is deprecated, but will be available until the API changes.
pt_br: Renomeado para ``PyUnstable_Code_SetExtra``. O nome antigo privado foi descontinuado, mas continuará disponível até a mudança da API.

source: object
pt_br: objeto

source: code
pt_br: código

source: code object
pt_br: objeto código

source: PyCode_New (C function)
pt_br: PyCode_New (função C)

source: PyCode_NewWithPosOnlyArgs (C function)
pt_br: PyCode_NewWithPosOnlyArgs (função C)

source: _PyEval_RequestCodeExtraIndex (C function)
pt_br: _PyEval_RequestCodeExtraIndex (função C)

source: _PyCode_GetExtra (C function)
pt_br: _PyCode_GetExtra (função C)

source: _PyCode_SetExtra (C function)
pt_br: _PyCode_SetExtra (função C)
