Repository: python/python-docs-pt-br
Catalog: c-api/conversion.po
Languages: pt_br

source: String conversion and formatting
pt_br: Conversão e formação de strings

source: Functions for number conversion and formatted string output.
pt_br: Funções para conversão de números e saída formatada de strings.

source: Output not more than *size* bytes to *str* according to the format string *format* and the extra arguments. See the Unix man page :manpage:`snprintf(3)`.
pt_br: Saída não superior a *size* bytes para *str* de acordo com a string de formato *format* e os argumentos extras. Veja a página man do Unix :manpage:`snprintf(3)`.

source: Output not more than *size* bytes to *str* according to the format string *format* and the variable argument list *va*. Unix man page :manpage:`vsnprintf(3)`.
pt_br: Saída não superior a *size* bytes para *str* de acordo com o string de formato *format* e a variável argumento de lista *va*. Página man do Unix :manpage:`vsnprintf(3)`.

source: :c:func:`PyOS_snprintf` and :c:func:`PyOS_vsnprintf` wrap the Standard C library functions :c:func:`snprintf` and :c:func:`vsnprintf`. Their purpose is to guarantee consistent behavior in corner cases, which the Standard C functions do not.
pt_br: :c:func:`PyOS_snprintf` e :c:func:`PyOS_vsnprintf` envolvem as funções :c:func:`snprintf` e :c:func:`vsnprintf` da biblioteca Standard C. Seu objetivo é garantir um comportamento consistente em casos extremos, o que as funções do Standard C não garantem.

source: The wrappers ensure that ``str[size-1]`` is always ``'\0'`` upon return. They never write more than *size* bytes (including the trailing ``'\0'``) into str. Both functions require that ``str != NULL``, ``size > 0``, ``format != NULL`` and ``size < INT_MAX``. Note that this means there is no equivalent to the C99 ``n = snprintf(NULL, 0, ...)`` which would determine the necessary buffer size.
pt_br: Os invólucros garantem que ``str[size-1]`` seja sempre ``'\0'`` no retorno. Eles nunca escrevem mais do que *size* bytes (incluindo o ``'\0'`` ao final) em str. Ambas as funções exigem que ``str != NULL``, ``size > 0``, ``format != NULL`` e ``size < INT_MAX``. Note que isso significa que não há equivalente ao ``n = snprintf(NULL, 0, ...)`` do C99 que determinaria o tamanho de buffer necessário.

source: The return value (*rv*) for these functions should be interpreted as follows:
pt_br: O valor de retorno (*rv*) para essas funções deve ser interpretado da seguinte forma:

source: When ``0 <= rv < size``, the output conversion was successful and *rv* characters were written to *str* (excluding the trailing ``'\0'`` byte at ``str[rv]``).
pt_br: Quando ``0 <= rv < size``, a conversão de saída foi bem-sucedida e os caracteres de *rv* foram escritos em *str* (excluindo o ``'\0'`` byte em ``str[rv]``).

source: When ``rv >= size``, the output conversion was truncated and a buffer with ``rv + 1`` bytes would have been needed to succeed. ``str[size-1]`` is ``'\0'`` in this case.
pt_br: Quando ``rv >= size``, a conversão de saída foi truncada e um buffer com ``rv + 1`` bytes teria sido necessário para ter sucesso. ``str[size-1]`` é ``'\0'`` neste caso.

source: The following functions provide locale-independent string to number conversions.
pt_br: As funções a seguir fornecem strings independentes de localidade para conversões de números.

source: Convert the initial part of the string in ``str`` to an :c:expr:`unsigned long` value according to the given ``base``, which must be between ``2`` and ``36`` inclusive, or be the special value ``0``.
pt_br: Converte a parte inicial da string em ``str`` para um valor :c:expr:`unsigned long` de acordo com a ``base`` fornecida, que deve estar entre ``2`` e ``36`` inclusive, ou ser o valor especial ``0``.

source: Leading white space and case of characters are ignored. If ``base`` is zero it looks for a leading ``0b``, ``0o`` or ``0x`` to tell which base. If these are absent it defaults to ``10``. Base must be 0 or between 2 and 36 (inclusive). If ``ptr`` is non-``NULL`` it will contain a pointer to the end of the scan.
pt_br: Espaços em branco iniciais e diferenciação entre caracteres maiúsculos e minúsculos são ignorados. Se ``base`` for zero, procura um ``0b``, ``0o`` ou ``0x`` inicial para informar qual base. Se estes estiverem ausentes, o padrão é ``10``. Base deve ser 0 ou entre 2 e 36 (inclusive). Se ``ptr`` não for ``NULL``, conterá um ponteiro para o fim da varredura.

source: If the converted value falls out of range of corresponding return type, range error occurs (:c:data:`errno` is set to :c:macro:`!ERANGE`) and :c:macro:`!ULONG_MAX` is returned. If no conversion can be performed, ``0`` is returned.
pt_br: Se o valor convertido ficar fora do intervalo do tipo de retorno correspondente, ocorrerá um erro de intervalo (:c:data:`errno` é definido como :c:macro:`!ERANGE`) e :c:macro:`!ULONG_MAX` será retornado. Se nenhuma conversão puder ser realizada, ``0`` será retornado.

source: See also the Unix man page :manpage:`strtoul(3)`.
pt_br: Veja também a página man do Unix :manpage:`strtoul(3)`.

source: Convert the initial part of the string in ``str`` to an :c:expr:`long` value according to the given ``base``, which must be between ``2`` and ``36`` inclusive, or be the special value ``0``.
pt_br: Converte a parte inicial da string em ``str`` para um valor :c:expr:`long` de acordo com a ``base`` fornecida, que deve estar entre ``2`` e ``36`` inclusive, ou ser o valor especial ``0``.

source: Same as :c:func:`PyOS_strtoul`, but return a :c:expr:`long` value instead and :c:macro:`LONG_MAX` on overflows.
pt_br: O mesmo que :c:func:`PyOS_strtoul`, mas retorna um valor :c:expr:`long` e :c:macro:`LONG_MAX` em caso de estouro.

source: See also the Unix man page :manpage:`strtol(3)`.
pt_br: Veja também a página man do Unix :manpage:`strtol(3)`.

source: Convert a string ``s`` to a :c:expr:`double`, raising a Python exception on failure. The set of accepted strings corresponds to the set of strings accepted by Python's :func:`float` constructor, except that ``s`` must not have leading or trailing whitespace. The conversion is independent of the current locale.
pt_br: Converte uma string ``s`` em :c:expr:`double`, levantando uma exceção Python em caso de falha. O conjunto de strings aceitas corresponde ao conjunto de strings aceito pelo construtor :func:`float` do Python, exceto que ``s`` não deve ter espaços em branco à esquerda ou à direita. A conversão é independente da localidade atual.

source: If ``endptr`` is ``NULL``, convert the whole string. Raise :exc:`ValueError` and return ``-1.0`` if the string is not a valid representation of a floating-point number.
pt_br: Se ``endptr`` for ``NULL``, converte a string inteira. Levanta :exc:`ValueError` e retorna ``-1.0`` se a string não for uma representação válida de um número de ponto flutuante.

source: If endptr is not ``NULL``, convert as much of the string as possible and set ``*endptr`` to point to the first unconverted character. If no initial segment of the string is the valid representation of a floating-point number, set ``*endptr`` to point to the beginning of the string, raise ValueError, and return ``-1.0``.
pt_br: Se endptr não for ``NULL``, converte o máximo possível da string e define ``*endptr`` para apontar para o primeiro caractere não convertido. Se nenhum segmento inicial da string for a representação válida de um número de ponto flutuante, define ``*endptr`` para apontar para o início da string, levanta ValueError e retorna ``-1.0``.

source: If ``s`` represents a value that is too large to store in a float (for example, ``"1e500"`` is such a string on many platforms) then if ``overflow_exception`` is ``NULL`` return ``Py_INFINITY`` (with an appropriate sign) and don't set any exception. Otherwise, ``overflow_exception`` must point to a Python exception object; raise that exception and return ``-1.0``. In both cases, set ``*endptr`` to point to the first character after the converted value.
pt_br: Se ``s`` representa um valor que é muito grande para armazenar em um ponto flutuante (por exemplo, ``"1e500"`` é uma string assim em muitas plataformas), então se ``overflow_exception`` for ``NULL`` retorna ``Py_INFINITY`` (com um sinal apropriado) e não define nenhuma exceção. Caso contrário, ``overflow_exception`` deve apontar para um objeto de exceção Python; levanta essa exceção e retorna ``-1.0``. Em ambos os casos, define ``*endptr`` para apontar para o primeiro caractere após o valor convertido.

source: If any other error occurs during the conversion (for example an out-of-memory error), set the appropriate Python exception and return ``-1.0``.
pt_br: Se qualquer outro erro ocorrer durante a conversão (por exemplo, um erro de falta de memória), define a exceção Python apropriada e retorna ``-1.0``.

source: Convert a :c:expr:`double` *val* to a string using supplied *format_code*, *precision*, and *flags*.
pt_br: Converte um *val* :c:expr:`double` para uma string usando *format_code*, *precision* e *flags* fornecidos.

source: *format_code* must be one of ``'e'``, ``'E'``, ``'f'``, ``'F'``, ``'g'``, ``'G'`` or ``'r'``. For ``'r'``, the supplied *precision* must be 0 and is ignored. The ``'r'`` format code specifies the standard :func:`repr` format.
pt_br: *format_code* deve ser um entre ``'e'``, ``'E'``, ``'f'``, ``'F'``, ``'g'``, ``'G'`` ou ``'r'``. Para ``'r'``, a precisão *precision* fornecida deve ser 0 e é ignorada. O código de formato ``'r'`` especifica o formato padrão de :func:`repr`.

source: *flags* can be zero or more of the values ``Py_DTSF_SIGN``, ``Py_DTSF_ADD_DOT_0``, or ``Py_DTSF_ALT``, or-ed together:
pt_br: *flags* pode ser zero ou mais de valores ``Py_DTSF_SIGN``, ``Py_DTSF_ADD_DOT_0`` ou ``Py_DTSF_ALT``, alternados por operador lógico OU:

source: ``Py_DTSF_SIGN`` means to always precede the returned string with a sign character, even if *val* is non-negative.
pt_br: ``Py_DTSF_SIGN`` significa sempre preceder a string retornada com um caractere de sinal, mesmo se *val* não for negativo.

source: ``Py_DTSF_ADD_DOT_0`` means to ensure that the returned string will not look like an integer.
pt_br: ``Py_DTSF_ADD_DOT_0`` significa garantir que a string retornada não se pareça com um inteiro.

source: ``Py_DTSF_ALT`` means to apply "alternate" formatting rules. See the documentation for the :c:func:`PyOS_snprintf` ``'#'`` specifier for details.
pt_br: ``Py_DTSF_ALT`` significa aplicar regras de formatação "alternativas". Veja a documentação para o especificador ``'#'`` de :c:func:`PyOS_snprintf` para detalhes.

source: If *ptype* is non-``NULL``, then the value it points to will be set to one of ``Py_DTST_FINITE``, ``Py_DTST_INFINITE``, or ``Py_DTST_NAN``, signifying that *val* is a finite number, an infinite number, or not a number, respectively.
pt_br: Se *type* não for ``NULL``, então o valor para o qual ele aponta será definido como um dos ``Py_DTST_FINITE``, ``Py_DTST_INFINITE`` ou ``Py_DTST_NAN``, significando que *val* é um número finito, um número infinito ou não um número, respectivamente.

source: The return value is a pointer to *buffer* with the converted string or ``NULL`` if the conversion failed. The caller is responsible for freeing the returned string by calling :c:func:`PyMem_Free`.
pt_br: O valor de retorno é um ponteiro para *buffer* com a string convertida ou ``NULL`` se a conversão falhou. O chamador é responsável por liberar a string retornada chamando :c:func:`PyMem_Free`.

source: Case insensitive comparison of strings. The function works almost identically to :c:func:`!strcmp` except that it ignores the case.
pt_br: Comparação de strings sem diferença entre maiúsculas e minúsculas. A função funciona quase de forma idêntica a :c:func:`!strcmp` exceto que ignora a diferença entre maiúsculas e minúsculas.

source: Case insensitive comparison of strings. The function works almost identically to :c:func:`!strncmp` except that it ignores the case.
pt_br: Comparação de strings sem diferença entre maiúsculas e minúsculas. A função funciona quase de forma idêntica a :c:func:`!strncmp` exceto que ignora a diferença entre maiúsculas e minúsculas.
