Repository: python/python-docs-pt-br
Catalog: c-api/curses.po
Languages: pt_br

source: Curses C API
pt_br: API C de curses

source: :mod:`curses` exposes a small C interface for extension modules. Consumers must include the header file :file:`py_curses.h` (which is not included by default by :file:`Python.h`) and :c:func:`import_curses` must be invoked, usually as part of the module initialisation function, to populate :c:var:`PyCurses_API`.
pt_br: :mod:`curses` expõe uma pequena interface C para módulos de extensão. Os usuários devem incluir o arquivo de cabeçalho :file:`py_curses.h` (que não é incluído por padrão em :file:`Python.h`) e :c:func:`import_curses` deve ser invocada, geralmente como parte da função de inicialização do módulo, para popular :c:var:`PyCurses_API`.

source: Neither the C API nor the pure Python :mod:`curses` module are compatible with subinterpreters.
pt_br: Nem a API C nem o módulo :mod:`curses` do Python puro são compatíveis com subinterpretadores.

source: Import the curses C API. The macro does not need a semi-colon to be called.
pt_br: Importa a API C do curses. A macro não precisa de ponto e vírgula para ser chamada.

source: On success, populate the :c:var:`PyCurses_API` pointer.
pt_br: Em caso de sucesso, popula o ponteiro :c:var:`PyCurses_API`.

source: On failure, set :c:var:`PyCurses_API` to NULL and set an exception. The caller must check if an error occurred via :c:func:`PyErr_Occurred`:
pt_br: Em caso de falha, define :c:var:`PyCurses_API` como NULL e levanta uma exceção. O chamador deve verificar se ocorreu um erro através de :c:func:`PyErr_Occurred`:

source: import_curses(); // semi-colon is optional but recommended if (PyErr_Occurred()) { /* cleanup */ }
pt_br: import_curses(); // O ponto e vírgula é opcional, mas recomendado. if (PyErr_Occurred()) { /* cleanup */ }

source: Dynamically allocated object containing the curses C API. This variable is only available once :c:macro:`import_curses` succeeds.
pt_br: Objeto alocado dinamicamente contendo a API C do curses. Esta variável só estará disponível após a execução bem-sucedida da macro :c:macro:`import_curses`.

source: ``PyCurses_API[0]`` corresponds to :c:data:`PyCursesWindow_Type`.
pt_br: ``PyCurses_API[0]`` corresponde a :c:data:`PyCursesWindow_Type`.

source: ``PyCurses_API[1]``, ``PyCurses_API[2]``, and ``PyCurses_API[3]`` are pointers to predicate functions of type ``int (*)(void)``.
pt_br: ``PyCurses_API[1]``, ``PyCurses_API[2]`` e ``PyCurses_API[3]`` são ponteiros para funções predicativas do tipo ``int (*)(void)``.

source: When called, these predicates return whether :func:`curses.setupterm`, :func:`curses.initscr`, and :func:`curses.start_color` have been called respectively.
pt_br: Quando chamados, esses predicados retornam se :func:`curses.setupterm`, :func:`curses.initscr` e :func:`curses.start_color` foram chamados, respectivamente.

source: See also the convenience macros :c:macro:`PyCursesSetupTermCalled`, :c:macro:`PyCursesInitialised`, and :c:macro:`PyCursesInitialisedColor`.
pt_br: Veja também as macros de conveniência :c:macro:`PyCursesSetupTermCalled`, :c:macro:`PyCursesInitialised` e :c:macro:`PyCursesInitialisedColor`.

source: The number of entries in this structure is subject to changes. Consider using :c:macro:`PyCurses_API_pointers` to check if new fields are available or not.
pt_br: O número de entradas nesta estrutura está sujeito a alterações. Considere usar :c:macro:`PyCurses_API_pointers` para verificar se novos campos estão disponíveis.

source: The number of accessible fields (``4``) in :c:var:`PyCurses_API`. This number is incremented whenever new fields are added.
pt_br: O número de campos acessíveis (``4``) em :c:var:`PyCurses_API`. Esse número é incrementado sempre que novos campos são adicionados.

source: The :ref:`heap type <heap-types>` corresponding to :class:`curses.window`.
pt_br: O :ref:`tipo de heap <heap-types>` correspondente a :class:`curses.window`.

source: Return true if *op* is a :class:`curses.window` instance, false otherwise.
pt_br: Retorna verdadeiro se *op* for uma instância de :class:`curses.window`, falso caso contrário.

source: The following macros are convenience macros expanding into C statements. In particular, they can only be used as ``macro;`` or ``macro``, but not ``macro()`` or ``macro();``.
pt_br: As macros a seguir são macros de conveniência que se expandem em instruções C. Em particular, elas só podem ser usadas como ``macro;`` ou ``macro``, mas não como ``macro()`` ou ``macro();``.

source: Macro checking if :func:`curses.setupterm` has been called.
pt_br: Macro que verifica se :func:`curses.setupterm` foi chamada.

source: The macro expansion is roughly equivalent to:
pt_br: A expansão de macro é aproximadamente equivalente a:

source: Macro checking if :func:`curses.initscr` has been called.
pt_br: Macro que verifica se :func:`curses.initscr` foi chamada.

source: Macro checking if :func:`curses.start_color` has been called.
pt_br: Macro que verifica se :func:`curses.start_color` foi chamada.

source: Internal data
pt_br: Dados internos

source: The following objects are exposed by the C API but should be considered internal-only.
pt_br: Os seguintes objetos são expostos pela API C, mas devem ser considerados apenas para uso interno.

source: Name of the curses capsule to pass to :c:func:`PyCapsule_Import`.
pt_br: Nome da cápsula do curses a ser passada para :c:func:`PyCapsule_Import`.

source: Internal usage only. Use :c:macro:`import_curses` instead.
pt_br: Uso interno apenas. Use :c:macro:`import_curses` em vez disso.
