Repository: python/python-docs-pt-br
Catalog: c-api/datetime.po
Languages: pt_br

source: DateTime Objects
pt_br: Objetos DateTime

source: Various date and time objects are supplied by the :mod:`datetime` module. Before using any of these functions, the header file :file:`datetime.h` must be included in your source (note that this is not included by :file:`Python.h`), and the macro :c:macro:`PyDateTime_IMPORT` must be invoked, usually as part of the module initialisation function. The macro puts a pointer to a C structure into a static variable, :c:data:`PyDateTimeAPI`, that is used by the following macros.
pt_br: Vários objetos de data e hora são fornecidos pelo módulo :mod:`datetime`. Antes de usar qualquer uma dessas funções, o arquivo de cabeçalho :file:`datetime.h` deve ser incluído na sua fonte (observe que isso não é incluído por :file:`Python.h`) e a macro :c:macro:`PyDateTime_IMPORT` deve ser chamada, geralmente como parte da função de inicialização do módulo. A macro coloca um ponteiro para uma estrutura C em uma variável estática, :c:data:`PyDateTimeAPI`, usada pelas macros a seguir.

source: Import the datetime C API.
pt_br: Importa a API C de datetime.

source: On success, populate the :c:var:`PyDateTimeAPI` pointer. On failure, set :c:var:`PyDateTimeAPI` to ``NULL`` and set an exception. The caller must check if an error occurred via :c:func:`PyErr_Occurred`:
pt_br: Em caso de sucesso, preenche o ponteiro :c:var:`PyDateTimeAPI`. Em caso de falha, define :c:var:`PyDateTimeAPI` como ``NULL`` e lança uma exceção. O chamador deve verificar se ocorreu um erro através de :c:func:`PyErr_Occurred`:

source: PyDateTime_IMPORT; if (PyErr_Occurred()) { /* cleanup */ }
pt_br: PyDateTime_IMPORT; if (PyErr_Occurred()) { /* limpeza */ }

source: This is not compatible with subinterpreters.
pt_br: Isso não é compatível com subinterpretadores.

source: Structure containing the fields for the datetime C API.
pt_br: Estrutura contendo os campos para a API C de datetime.

source: The fields of this structure are private and subject to change.
pt_br: Os campos desta estrutura são privados e sujeitos a alterações.

source: Do not use this directly; prefer ``PyDateTime_*`` APIs instead.
pt_br: Não use isto diretamente; prefira as APIs ``PyDateTime_*``.

source: Dynamically allocated object containing the datetime C API.
pt_br: Objeto alocado dinamicamente contendo a API C de datetime.

source: This variable is only available once :c:macro:`PyDateTime_IMPORT` succeeds.
pt_br: Esta variável só estará disponível após a execução bem-sucedida de :c:macro:`PyDateTime_IMPORT`.

source: This subtype of :c:type:`PyObject` represents a Python date object.
pt_br: Esta é uma instância de :c:type:`PyObject` representando o objeto data do Python.

source: This subtype of :c:type:`PyObject` represents a Python datetime object.
pt_br: Esta é uma instância de :c:type:`PyObject` representando o objeto datetime do Python.

source: This subtype of :c:type:`PyObject` represents a Python time object.
pt_br: Esta é uma instância de :c:type:`PyObject` representando o objeto hora do Python.

source: This subtype of :c:type:`PyObject` represents the difference between two datetime values.
pt_br: Esta é uma instância de :c:type:`PyObject` representando a diferença entre dois valores de datetime.

source: This instance of :c:type:`PyTypeObject` represents the Python date type; it is the same object as :class:`datetime.date` in the Python layer.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo data do Python; é o mesmo objeto que :class:`datetime.date` na camada de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python datetime type; it is the same object as :class:`datetime.datetime` in the Python layer.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo datetime do Python; é o mesmo objeto que :class:`datetime.datetime` na camada de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python time type; it is the same object as :class:`datetime.time` in the Python layer.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo hora do Python; é o mesmo objeto que :class:`datetime.time` na camada de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python type for the difference between two datetime values; it is the same object as :class:`datetime.timedelta` in the Python layer.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo Python para a diferença entre dois valores de datetime; é o mesmo objeto que :class:`datetime.timedelta` na camada de Python.

source: This instance of :c:type:`PyTypeObject` represents the Python time zone info type; it is the same object as :class:`datetime.tzinfo` in the Python layer.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo fuso horário do Python; é o mesmo objeto que :class:`datetime.tzinfo` na camada de Python.

source: Macro for access to the UTC singleton:
pt_br: Macro para acesso ao singleton UTC:

source: Returns the time zone singleton representing UTC, the same object as :attr:`datetime.timezone.utc`.
pt_br: Retorna um singleton do fuso horário representando o UTC, o mesmo objeto que :attr:`datetime.timezone.utc`.

source: Type-check macros:
pt_br: Macros de verificação de tipo:

source: Return true if *ob* is of type :c:data:`PyDateTime_DateType` or a subtype of :c:data:`!PyDateTime_DateType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_DateType` ou um subtipo de :c:data:`!PyDateTime_DateType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_DateType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_DateType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_DateTimeType` or a subtype of :c:data:`!PyDateTime_DateTimeType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* é do tipo :c:data:`PyDateTime_DateTimeType` ou um subtipo de :c:data:`!PyDateTime_DateTimeType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_DateTimeType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_DateTimeType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_TimeType` or a subtype of :c:data:`!PyDateTime_TimeType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* é do tipo :c:data:`PyDateTime_TimeType` ou um subtipo de :c:data:`!PyDateTime_TimeType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_TimeType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_TimeType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_DeltaType` or a subtype of :c:data:`!PyDateTime_DeltaType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_DeltaType` ou um subtipo de :c:data:`!PyDateTime_DeltaType`. *ob* não pode ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_DeltaType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_DeltaType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_TZInfoType` or a subtype of :c:data:`!PyDateTime_TZInfoType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_TZInfoType` ou um subtipo de :c:data:`!PyDateTime_TZInfoType`. *ob* não pode ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob* is of type :c:data:`PyDateTime_TZInfoType`. *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for do tipo :c:data:`PyDateTime_TZInfoType`. *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Macros to create objects:
pt_br: Macros para criar objetos:

source: Return a :class:`datetime.date` object with the specified year, month and day.
pt_br: Retorna um objeto :class:`datetime.date` com o ano, mês e dia especificados.

source: Return a :class:`datetime.datetime` object with the specified year, month, day, hour, minute, second and microsecond.
pt_br: Retorna um objeto :class:`datetime.datetime` com o ano, mês, dia, hora, minuto, segundo, microssegundo especificados.

source: Return a :class:`datetime.datetime` object with the specified year, month, day, hour, minute, second, microsecond and fold.
pt_br: Retorna um objeto :class:`datetime.datetime` com o ano, mês, dia, hora, minuto, segundo, microssegundo e a dobra especificados.

source: Return a :class:`datetime.time` object with the specified hour, minute, second and microsecond.
pt_br: Retorna um objeto :class:`datetime.time` com a hora, minuto, segundo e microssegundo especificados.

source: Return a :class:`datetime.time` object with the specified hour, minute, second, microsecond and fold.
pt_br: Retorna um objeto :class:`datetime.time` com a hora, minuto, segundo, microssegundo e a dobra especificados.

source: Return a :class:`datetime.timedelta` object representing the given number of days, seconds and microseconds. Normalization is performed so that the resulting number of microseconds and seconds lie in the ranges documented for :class:`datetime.timedelta` objects.
pt_br: Retorna um objeto :class:`datetime.timedelta` representando o número especificado de dias, segundos e microssegundos. A normalização é realizada para que o número resultante de microssegundos e segundos esteja nos intervalos documentados para objetos de :class:`datetime.timedelta`.

source: Return a :class:`datetime.timezone` object with an unnamed fixed offset represented by the *offset* argument.
pt_br: Retorna um objeto :class:`datetime.timezone` com um deslocamento fixo sem nome representado pelo argumento *offset*.

source: Return a :class:`datetime.timezone` object with a fixed offset represented by the *offset* argument and with tzname *name*.
pt_br: Retorna um objeto :class:`datetime.timezone` com um deslocamento fixo representado pelo argumento *offset* e com tzname *name*.

source: Macros to extract fields from date objects. The argument must be an instance of :c:type:`PyDateTime_Date`, including subclasses (such as :c:type:`PyDateTime_DateTime`). The argument must not be ``NULL``, and the type is not checked:
pt_br: Macros para extrair campos de objetos *date*. O argumento deve ser uma instância de :c:type:`PyDateTime_Date`, inclusive subclasses (como :c:type:`PyDateTime_DateTime`). O argumento não deve ser ``NULL``, e o tipo não é verificado:

source: Return the year, as a positive int.
pt_br: Retorna o ano, como um inteiro positivo.

source: Return the month, as an int from 1 through 12.
pt_br: Retorna o mês, como um inteiro de 1 a 12.

source: Return the day, as an int from 1 through 31.
pt_br: Retorna o dia, como um inteiro de 1 a 31.

source: Macros to extract fields from datetime objects. The argument must be an instance of :c:type:`PyDateTime_DateTime`, including subclasses. The argument must not be ``NULL``, and the type is not checked:
pt_br: Macros para extrair campos de objetos *datetime*. O argumento deve ser uma instância de :c:type:`PyDateTime_DateTime`, inclusive subclasses. O argumento não deve ser ``NULL``, e o tipo não é verificado:

source: Return the hour, as an int from 0 through 23.
pt_br: Retorna a hora, como um inteiro de 0 a 23.

source: Return the minute, as an int from 0 through 59.
pt_br: Retorna o minuto, como um inteiro de 0 a 59.

source: Return the second, as an int from 0 through 59.
pt_br: Retorna o segundo, como um inteiro de 0 a 59.

source: Return the microsecond, as an int from 0 through 999999.
pt_br: Retorna o microssegundo, como um inteiro de 0 a 999999.

source: Return the fold, as an int from 0 through 1.
pt_br: Retorna a dobra, como um inteiro de 0 a 1.

source: Return the tzinfo (which may be ``None``).
pt_br: Retorna o tzinfo (que pode ser ``None``).

source: Macros to extract fields from time objects. The argument must be an instance of :c:type:`PyDateTime_Time`, including subclasses. The argument must not be ``NULL``, and the type is not checked:
pt_br: Macros para extrair campos de objetos *time*. O argumento deve ser uma instância de :c:type:`PyDateTime_Time`, inclusive subclasses. O argumento não deve ser ``NULL``, e o tipo não é verificado:

source: Macros to extract fields from time delta objects. The argument must be an instance of :c:type:`PyDateTime_Delta`, including subclasses. The argument must not be ``NULL``, and the type is not checked:
pt_br: Macros para extrair campos de objetos *time delta*. O argumento deve ser uma instância de :c:type:`PyDateTime_Delta`, inclusive subclasses. O argumento não deve ser ``NULL``, e o tipo não é verificado:

source: Return the number of days, as an int from -999999999 to 999999999.
pt_br: Retorna o número de dias, como um inteiro de -999999999 a 999999999.

source: Return the number of seconds, as an int from 0 through 86399.
pt_br: Retorna o número de segundos, como um inteiro de 0 a 86399.

source: Return the number of microseconds, as an int from 0 through 999999.
pt_br: Retorna o número de microssegundos, como um inteiro de 0 a 999999.

source: Macros for the convenience of modules implementing the DB API:
pt_br: Macros para a conveniência de módulos implementando a API de DB:

source: Create and return a new :class:`datetime.datetime` object given an argument tuple suitable for passing to :meth:`datetime.datetime.fromtimestamp`.
pt_br: Cria e retorna um novo objeto :class:`datetime.datetime` dado uma tupla de argumentos que possa ser passada ao método :meth:`datetime.datetime.fromtimestamp`.

source: Create and return a new :class:`datetime.date` object given an argument tuple suitable for passing to :meth:`datetime.date.fromtimestamp`.
pt_br: Cria e retorna um novo objeto :class:`datetime.date` dado uma tupla de argumentos que possa ser passada ao método :meth:`datetime.date.fromtimestamp`.

source: Internal data
pt_br: Dados internos

source: The following symbols are exposed by the C API but should be considered internal-only.
pt_br: Os seguintes símbolos são expostos pela API C, mas devem ser considerados apenas para uso interno.

source: Name of the datetime capsule to pass to :c:func:`PyCapsule_Import`.
pt_br: Nome da cápsula de datetime a ser passada para :c:func:`PyCapsule_Import`.

source: Internal usage only. Use :c:macro:`PyDateTime_IMPORT` instead.
pt_br: Uso interno apenas. Use :c:macro:`PyDateTime_IMPORT` em vez disso.
