Repository: python/python-docs-pt-br
Catalog: c-api/descriptor.po
Languages: pt_br

source: Descriptor Objects
pt_br: Objetos descritores

source: "Descriptors" are objects that describe some attribute of an object. They are found in the dictionary of type objects.
pt_br: "Descritores" são objetos que descrevem algum atributo de um objeto. Eles são encontrados no dicionário de objetos de tipo.

source: The type object for the built-in descriptor types.
pt_br: O tipo de objeto para os tipos de descritores embutidos.

source: Return non-zero if the descriptor object *descr* describes a data attribute, or ``0`` if it describes a method. *descr* must be a descriptor object; there is no error checking.
pt_br: Retorna não-zero se o objeto descritor *descr* descrevem um atributo de dados, ou ``0`` se os mesmos descrevem um método. *descr* deve ser um objeto descritor; não há verificação de erros.

source: Built-in descriptors
pt_br: Descritores embutidos

source: The type object for super objects. This is the same object as :class:`super` in the Python layer.
pt_br: O objeto de tipo para superobjetos. Este é o mesmo objeto que :class:`super` na camada Python.

source: The type of class method objects. This is the same object as :class:`classmethod` in the Python layer.
pt_br: O tipo de objeto de método de classe. Este é o mesmo objeto que :class:`classmethod` na camada Python.

source: Create a new :class:`classmethod` object wrapping *callable*. *callable* must be a callable object and must not be ``NULL``.
pt_br: Cria um novo objeto :class:`classmethod` que envolve *callable*. *callable* deve ser um objeto chamável e não deve ser ``NULL``.

source: On success, this function returns a :term:`strong reference` to a new class method descriptor. On failure, this function returns ``NULL`` with an exception set.
pt_br: Em caso de sucesso, esta função retorna uma :term:`referência forte` a um novo descritor de método de classe. Em caso de falha, esta função retorna ``NULL`` com uma exceção definida.

source: The type of static method objects. This is the same object as :class:`staticmethod` in the Python layer.
pt_br: O tipo de objeto de método estático. Este é o mesmo objeto que :class:`staticmethod` na camada Python.

source: Create a new :class:`staticmethod` object wrapping *callable*. *callable* must be a callable object and must not be ``NULL``.
pt_br: Cria um novo objeto :class:`staticmethod` que envolve *callable*. *callable* deve ser um objeto chamável e não deve ser ``NULL``.

source: On success, this function returns a :term:`strong reference` to a new static method descriptor. On failure, this function returns ``NULL`` with an exception set.
pt_br: Em caso de sucesso, esta função retorna uma :term:`referência forte` a um novo descritor de método estático. Em caso de falha, esta função retorna ``NULL`` com uma exceção definida.
