Repository: python/python-docs-pt-br
Catalog: c-api/dict.po
Languages: pt_br

source: There may already be a pending exception set on entry to the callback. In this case, the callback should return ``0`` with the same exception still set. This means the callback may not call any other API that can set an exception unless it saves and clears the exception state first, and restores it before returning.
pt_br: É possível que já exista uma exceção pendente definida na entrada da função de retorno. Nesse caso, a função de retorno deve retornar ``0`` com a mesma exceção ainda definida. Isso significa que a função de retorno não pode chamar nenhuma outra API que possa definir uma exceção, a menos que salve e limpe o estado da exceção primeiro e o restaure antes de retornar.

source: object
pt_br: objeto

source: dictionary
pt_br: dicionário

source: built-in function
pt_br: função embutida
