Repository: python/python-docs-pt-br
Catalog: c-api/dict.po
Languages: pt_br

source: Dictionary Objects
pt_br: Objetos dicionários

source: This subtype of :c:type:`PyObject` represents a Python dictionary object.
pt_br: Este subtipo do :c:type:`PyObject` representa um objeto dicionário Python.

source: This instance of :c:type:`PyTypeObject` represents the Python dictionary type. This is the same object as :class:`dict` in the Python layer.
pt_br: Esta instância do :c:type:`PyTypeObject` representa o tipo do dicionário Python. Este é o mesmo objeto :class:`dict` na camada do Python.

source: Return true if *p* is a dict object or an instance of a subtype of the dict type. This function always succeeds.
pt_br: Retorna verdadeiro se *p* é um objeto dicionário ou uma instância de um subtipo do tipo dicionário. Esta função sempre tem sucesso.

source: Return true if *p* is a dict object, but not an instance of a subtype of the dict type. This function always succeeds.
pt_br: Retorna verdadeiro se *p* é um objeto dicionário, mas não uma instância de um subtipo do tipo dicionário. Esta função sempre tem sucesso.

source: Return a new empty dictionary, or ``NULL`` on failure.
pt_br: Retorna um novo dicionário vazio ou ``NULL`` em caso de falha.

source: Return a :class:`types.MappingProxyType` object for a mapping which enforces read-only behavior. This is normally used to create a view to prevent modification of the dictionary for non-dynamic class types.
pt_br: Retorna um objeto :class:`types.MappingProxyType` para um mapeamento que reforça o comportamento somente leitura. Isso normalmente é usado para criar uma visão para evitar a modificação do dicionário para tipos de classes não dinâmicas.

source: Empty an existing dictionary of all key-value pairs.
pt_br: Esvazia um dicionário existente de todos os pares chave-valor.

source: This is the same as :c:func:`PyDict_Contains`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_br: É o mesmo que :c:func:`PyDict_Contains`, mas *key* é especificada como uma string de bytes :c:expr:`const char*` codificada em UTF-8, em vez de um :c:expr:`PyObject*`.

source: Return a new dictionary that contains the same key-value pairs as *p*.
pt_br: Retorna um novo dicionário que contém o mesmo chave-valor como *p*.

source: Insert *val* into the dictionary *p* with a key of *key*. *key* must be :term:`hashable`; if it isn't, :exc:`TypeError` will be raised. Return ``0`` on success or ``-1`` on failure. This function *does not* steal a reference to *val*.
pt_br: Insere *val* no dicionário *p* com a tecla *key*. *key* deve ser :term:`hasheável <hashable>`; se não for, :exc:`TypeError` será levantada. Retorna ``0`` em caso de sucesso ou ``-1`` em caso de falha. Esta função *não* rouba uma referência a *val*.

source: This is the same as :c:func:`PyDict_SetItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_br: É o mesmo que :c:func:`PyDict_SetItem`, mas *key* é especificada como uma string de bytes :c:expr:`const char*` codificada em UTF-8, em vez de um :c:expr:`PyObject*`.

source: Remove the entry in dictionary *p* with key *key*. *key* must be :term:`hashable`; if it isn't, :exc:`TypeError` is raised. If *key* is not in the dictionary, :exc:`KeyError` is raised. Return ``0`` on success or ``-1`` on failure.
pt_br: Remove a entrada no dicionário *p* com a chave *key*. *key* deve ser :term:`hasheável`; se não for, :exc:`TypeError` é levantada. Se *key* não estiver no dicionário, :exc:`KeyError` é levantada. Retorna ``0`` em caso de sucesso ou ``-1`` em caso de falha.

source: This is the same as :c:func:`PyDict_DelItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_br: É o mesmo que :c:func:`PyDict_DelItem`, mas *key* é especificada como uma string de bytes :c:expr:`const char*` codificada em UTF-8, em vez de um :c:expr:`PyObject*`.

source: Return a new :term:`strong reference` to the object from dictionary *p* which has a key *key*:
pt_br: Retorna uma nova :term:`referência forte` para o objeto dicionário *p* que possui uma chave *key*:

source: If the key is present, set *\*result* to a new :term:`strong reference` to the value and return ``1``.
pt_br: Se a chave estiver presente, define *\*result* como uma nova :term:`referência forte` para o valor e retorna ``1``.

source: If the key is missing, set *\*result* to ``NULL`` and return ``0``.
pt_br: Se a chave estiver ausente, define *\*result* como ``NULL`` e retorna ``0``.

source: On error, raise an exception and return ``-1``.
pt_br: Em caso de erro, levanta uma exceção e retorna ``-1``.

source: See also the :c:func:`PyObject_GetItem` function.
pt_br: Veja também a função :c:func:`PyObject_GetItem`.

source: Return a :term:`borrowed reference` to the object from dictionary *p* which has a key *key*. Return ``NULL`` if the key *key* is missing *without* setting an exception.
pt_br: Retorna um :term:`referência emprestada` para o objeto do dicionário *p* que possui uma chave *key*. Retorna ``NULL`` se a chave *key* não estiver presente, mas *sem* definir uma exceção.

source: Exceptions that occur while this calls :meth:`~object.__hash__` and :meth:`~object.__eq__` methods are silently ignored. Prefer the :c:func:`PyDict_GetItemWithError` function instead.
pt_br: Exceções que ocorrem ao chamar os métodos :meth:`~object.__hash__` e :meth:`~object.__eq__` são ignoradas silenciosamente. Ao invés disso, use a função :c:func:`PyDict_GetItemWithError`.

source: Calling this API without an :term:`attached thread state` had been allowed for historical reason. It is no longer allowed.
pt_br: Chamar esta API sem um :term:`estado de thread anexado` era permitido por motivos históricos. Não é mais permitido.

source: Variant of :c:func:`PyDict_GetItem` that does not suppress exceptions. Return ``NULL`` **with** an exception set if an exception occurred. Return ``NULL`` **without** an exception set if the key wasn't present.
pt_br: Variante de :c:func:`PyDict_GetItem` que não suprime exceções. Retorna ``NULL`` **com** uma exceção definida se uma exceção ocorreu. Retorna ``NULL`` ** sem ** uma exceção definida se a chave não estiver presente.

source: This is the same as :c:func:`PyDict_GetItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_br: É o mesmo que :c:func:`PyDict_GetItem`, mas *key* é especificada como uma string de bytes :c:expr:`const char*` codificada em UTF-8, em vez de um :c:expr:`PyObject*`.

source: Exceptions that occur while this calls :meth:`~object.__hash__` and :meth:`~object.__eq__` methods or while creating the temporary :class:`str` object are silently ignored. Prefer using the :c:func:`PyDict_GetItemWithError` function with your own :c:func:`PyUnicode_FromString` *key* instead.
pt_br: Exceções que ocorrem ao chamar os métodos :meth:`~object.__hash__` e :meth:`~object.__eq__` ou ao criar objetos temporários da classe :class:`str` são ignoradas silenciosamente. Ao invés disso, prefira usar a função :c:func:`PyDict_GetItemWithError` com sua própria *key* de :c:func:`PyUnicode_FromString`.

source: Similar to :c:func:`PyDict_GetItemRef`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_br: Similar a :c:func:`PyDict_GetItemRef`, mas *key* é especificada como uma string de bytes :c:expr:`const char*` codificada em UTF-8, em vez de um :c:expr:`PyObject*`.

source: This is the same as the Python-level :meth:`dict.setdefault`. If present, it returns the value corresponding to *key* from the dictionary *p*. If the key is not in the dict, it is inserted with value *defaultobj* and *defaultobj* is returned. This function evaluates the hash function of *key* only once, instead of evaluating it independently for the lookup and the insertion.
pt_br: Isso é o mesmo que o :meth:`dict.setdefault` de nível Python. Se presente, ele retorna o valor correspondente a *key* do dicionário *p*. Se a chave não estiver no dict, ela será inserida com o valor *defaultobj* e *defaultobj* será retornado. Esta função avalia a função hash de *key* apenas uma vez, em vez de avaliá-la independentemente para a pesquisa e a inserção.

source: Inserts *default_value* into the dictionary *p* with a key of *key* if the key is not already present in the dictionary. If *result* is not ``NULL``, then *\*result* is set to a :term:`strong reference` to either *default_value*, if the key was not present, or the existing value, if *key* was already present in the dictionary. Returns ``1`` if the key was present and *default_value* was not inserted, or ``0`` if the key was not present and *default_value* was inserted. On failure, returns ``-1``, sets an exception, and sets ``*result`` to ``NULL``.
pt_br: Insere *default_value* no dicionário *p* com uma chave *key* se a chave ainda não estiver presente no dicionário. Se *result* não for ``NULL``, então *\*result* é definido como uma :term:`referência forte` para *default_value*, se a chave não estiver presente, ou para o valor existente, se *key* já estava presente no dicionário. Retorna ``1`` se a chave estava presente e *default_value* não foi inserido, ou ``0`` se a chave não estava presente e *default_value* foi inserido. Em caso de falha, retorna ``-1``, define uma exceção e define ``*result`` como ``NULL``.

source: For clarity: if you have a strong reference to *default_value* before calling this function, then after it returns, you hold a strong reference to both *default_value* and *\*result* (if it's not ``NULL``). These may refer to the same object: in that case you hold two separate references to it.
pt_br: Para maior clareza: se você tiver uma referência forte para *default_value* antes de chamar esta função, então depois que ela retornar, você terá uma referência forte para *default_value* e *\*result* (se não for ``NULL``). Estes podem referir-se ao mesmo objeto: nesse caso você mantém duas referências separadas para ele.

source: If the key is present, set *\*result* to a new reference to the removed value if *result* is not ``NULL``, and return ``1``.
pt_br: Se a chave estiver presente, define *\*result* como uma nova referência para o valor se *result* não for ``NULL`` e retorna ``1``.

source: If the key is missing, set *\*result* to ``NULL`` if *result* is not ``NULL``, and return ``0``.
pt_br: Se a chave estiver ausente, define *\*result* como ``NULL`` se *result* não for ``NULL`` e retorna ``0``.

source: Similar to :c:func:`PyDict_Pop`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
pt_br: Similar a :c:func:`PyDict_Pop`, mas *key* é especificada como uma string de bytes :c:expr:`const char*` codificada em UTF-8, em vez de um :c:expr:`PyObject*`.

source: Return a :c:type:`PyListObject` containing all the items from the dictionary.
pt_br: Retorna um :c:type:`PyListObject` contendo todos os itens do dicionário.

source: Return a :c:type:`PyListObject` containing all the keys from the dictionary.
pt_br: Retorna um :c:type:`PyListObject` contendo todas as chaves do dicionário.

source: Return a :c:type:`PyListObject` containing all the values from the dictionary *p*.
pt_br: Retorna um :c:type:`PyListObject` contendo todos os valores do dicionário *p*.

source: Return the number of items in the dictionary. This is equivalent to ``len(p)`` on a dictionary.
pt_br: Retorna o número de itens no dicionário. Isso é equivalente a ``len(p)`` em um dicionário.

source: Iterate over all key-value pairs in the dictionary *p*. The :c:type:`Py_ssize_t` referred to by *ppos* must be initialized to ``0`` prior to the first call to this function to start the iteration; the function returns true for each pair in the dictionary, and false once all pairs have been reported. The parameters *pkey* and *pvalue* should either point to :c:expr:`PyObject*` variables that will be filled in with each key and value, respectively, or may be ``NULL``. Any references returned through them are borrowed. *ppos* should not be altered during iteration. Its value represents offsets within the internal dictionary structure, and since the structure is sparse, the offsets are not consecutive.
pt_br: Itera todos os pares de valores-chave no dicionário *p*. O :c:type:`Py_ssize_t` referido por *ppos* deve ser inicializado para ``0`` antes da primeira chamada para esta função para iniciar a iteração; a função retorna true para cada par no dicionário e false quando todos os pares forem relatados. Os parâmetros *pkey* e *pvalue* devem apontar para variáveis de :c:expr:`PyObject*` que serão preenchidas com cada chave e valor, respectivamente, ou podem ser ``NULL``. Todas as referências retornadas por meio deles são emprestadas. *ppos* não deve ser alterado durante a iteração. Seu valor representa deslocamentos dentro da estrutura do dicionário interno e, como a estrutura é esparsa, os deslocamentos não são consecutivos.

source: For example::
pt_br: Por exemplo::

source: PyObject *key, *value; Py_ssize_t pos = 0; while (PyDict_Next(self->dict, &pos, &key, &value)) { /* do something interesting with the values... */ ... }
pt_br: PyObject *key, *value; Py_ssize_t pos = 0; while (PyDict_Next(self->dict, &pos, &key, &value)) { /* fazer algo de interessante com os valores... */ ... }

source: The dictionary *p* should not be mutated during iteration. It is safe to modify the values of the keys as you iterate over the dictionary, but only so long as the set of keys does not change. For example::
pt_br: O dicionário *p* não deve sofrer mutação durante a iteração. É seguro modificar os valores das chaves à medida que você itera no dicionário, mas apenas enquanto o conjunto de chaves não mudar. Por exemplo::

source: The function is not thread-safe in the :term:`free-threaded <free threading>` build without external synchronization. You can use :c:macro:`Py_BEGIN_CRITICAL_SECTION` to lock the dictionary while iterating over it::
pt_br: A função não é segura para thread na construção com :term:`threads livres <free threading>` sem sincronização externa. Você pode usar :c:macro:`Py_BEGIN_CRITICAL_SECTION` para travar o dicionário enquanto itera sobre ele::

source: On the free-threaded build, this function can be used safely inside a critical section. However, the references returned for *pkey* and *pvalue* are :term:`borrowed <borrowed reference>` and are only valid while the critical section is held. If you need to use these objects outside the critical section or when the critical section can be suspended, create a :term:`strong reference <strong reference>` (for example, using :c:func:`Py_NewRef`).
pt_br: Na construção com threads livres, esta função pode ser usada com segurança dentro de uma seção crítica. No entanto, as referências retornadas para *pkey* e *pvalue* são :term:`emprestadas <borrowed reference>` e só são válidas enquanto a seção crítica é mantida. Se precisar usar esses objetos fora da seção crítica ou quando a seção crítica puder ser suspensa, crie uma :term:`referência forte <strong reference>` (por exemplo, usando :c:func:`Py_NewRef`).

source: Iterate over mapping object *b* adding key-value pairs to dictionary *a*. *b* may be a dictionary, or any object supporting :c:func:`PyMapping_Keys` and :c:func:`PyObject_GetItem`. If *override* is true, existing pairs in *a* will be replaced if a matching key is found in *b*, otherwise pairs will only be added if there is not a matching key in *a*. Return ``0`` on success or ``-1`` if an exception was raised.
pt_br: Itera sobre o objeto de mapeamento *b* adicionando pares de valores-chave ao dicionário *a*. *b* pode ser um dicionário, ou qualquer objeto que suporte :c:func:`PyMapping_Keys` e :c:func:`PyObject_GetItem`. Se *override* for verdadeiro, os pares existentes em *a* serão substituídos se uma chave correspondente for encontrada em *b*, caso contrário, os pares serão adicionados apenas se não houver uma chave correspondente em *a*. Retorna ``0`` em caso de sucesso ou ``-1`` se uma exceção foi levantada.

source: This is the same as ``PyDict_Merge(a, b, 1)`` in C, and is similar to ``a.update(b)`` in Python except that :c:func:`PyDict_Update` doesn't fall back to the iterating over a sequence of key value pairs if the second argument has no "keys" attribute. Return ``0`` on success or ``-1`` if an exception was raised.
pt_br: É o mesmo que ``PyDict_Merge(a, b, 1)`` em C, e é semelhante a ``a.update(b)`` em Python, exceto que :c:func:`PyDict_Update` não cai na iteração em uma sequência de pares de valores de chave se o segundo argumento não tiver o atributo "keys". Retorna ``0`` em caso de sucesso ou ``-1`` se uma exceção foi levantada.

source: Update or merge into dictionary *a*, from the key-value pairs in *seq2*. *seq2* must be an iterable object producing iterable objects of length 2, viewed as key-value pairs. In case of duplicate keys, the last wins if *override* is true, else the first wins. Return ``0`` on success or ``-1`` if an exception was raised. Equivalent Python (except for the return value)::
pt_br: Atualiza ou mescla no dicionário *a*, a partir dos pares de chave-valor em *seq2*. *seq2* deve ser um objeto iterável produzindo objetos iteráveis de comprimento 2, vistos como pares chave-valor. No caso de chaves duplicadas, a última vence se *override* for verdadeiro, caso contrário, a primeira vence. Retorne ``0`` em caso de sucesso ou ``-1`` se uma exceção foi levantada. Python equivalente (exceto para o valor de retorno)::

source: Register *callback* as a dictionary watcher. Return a non-negative integer id which must be passed to future calls to :c:func:`PyDict_Watch`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
pt_br: Registra *callback* como um observador de dicionário. Retorna um ID inteiro não negativo que deve ser passado para futuras chamadas a :c:func:`PyDict_Watch`. Em caso de erro (por exemplo, não há mais IDs de observador disponíveis), retorna ``-1`` e define uma exceção.

source: Clear watcher identified by *watcher_id* previously returned from :c:func:`PyDict_AddWatcher`. Return ``0`` on success, ``-1`` on error (e.g. if the given *watcher_id* was never registered.)
pt_br: Limpa o observador identificado por *watcher_id* retornado anteriormente de :c:func:`PyDict_AddWatcher`. Retorna ``0`` em caso de sucesso, ``-1`` em caso de erro (por exemplo, se o *watcher_id* fornecido nunca foi registrado).

source: Mark dictionary *dict* as watched. The callback granted *watcher_id* by :c:func:`PyDict_AddWatcher` will be called when *dict* is modified or deallocated. Return ``0`` on success or ``-1`` on error.
pt_br: Marca o dicionário *dict* como observado. A função de retorno concedida a *watcher_id* por :c:func:`PyDict_AddWatcher` será chamada quando *dict* for modificado ou desalocado. Retorna ``0`` em caso de sucesso ou ``-1`` em caso de erro.

source: Mark dictionary *dict* as no longer watched. The callback granted *watcher_id* by :c:func:`PyDict_AddWatcher` will no longer be called when *dict* is modified or deallocated. The dict must previously have been watched by this watcher. Return ``0`` on success or ``-1`` on error.
pt_br: Marca o dicionário *dict* como não mais observado. A função de retorno concedida a *watcher_id* por :c:func:`PyDict_AddWatcher` será chamada quando *dict* for modificado ou desalocado. O dicionário deve ter sido observado anteriormente por este observador. Retorna ``0`` em caso de sucesso ou ``-1`` em caso de erro.

source: Enumeration of possible dictionary watcher events: ``PyDict_EVENT_ADDED``, ``PyDict_EVENT_MODIFIED``, ``PyDict_EVENT_DELETED``, ``PyDict_EVENT_CLONED``, ``PyDict_EVENT_CLEARED``, or ``PyDict_EVENT_DEALLOCATED``.
pt_br: Enumeração de possíveis eventos de observador de dicionário: ``PyDict_EVENT_ADDED``, ``PyDict_EVENT_MODIFIED``, ``PyDict_EVENT_DELETED``, ``PyDict_EVENT_CLONED``, ``PyDict_EVENT_CLEARED`` ou ``PyDict_EVENT_DEALLOCATED``.

source: Type of a dict watcher callback function.
pt_br: Tipo de uma função de retorno de chamada de observador de dicionário.

source: If *event* is ``PyDict_EVENT_CLEARED`` or ``PyDict_EVENT_DEALLOCATED``, both *key* and *new_value* will be ``NULL``. If *event* is ``PyDict_EVENT_ADDED`` or ``PyDict_EVENT_MODIFIED``, *new_value* will be the new value for *key*. If *event* is ``PyDict_EVENT_DELETED``, *key* is being deleted from the dictionary and *new_value* will be ``NULL``.
pt_br: Se *event* for ``PyDict_EVENT_CLEARED`` ou ``PyDict_EVENT_DEALLOCATED``, tanto *key* quanto *new_value* serão ``NULL``. Se *event* for ``PyDict_EVENT_ADDED`` ou ``PyDict_EVENT_MODIFIED``, *new_value* será o novo valor de *key*. Se *event* for ``PyDict_EVENT_DELETED``, *key* estará sendo excluída do dicionário e *new_value* será ``NULL``.

source: ``PyDict_EVENT_CLONED`` occurs when *dict* was previously empty and another dict is merged into it. To maintain efficiency of this operation, per-key ``PyDict_EVENT_ADDED`` events are not issued in this case; instead a single ``PyDict_EVENT_CLONED`` is issued, and *key* will be the source dictionary.
pt_br: ``PyDict_EVENT_CLONED`` ocorre quando *dict* estava anteriormente vazio e outro dict é mesclado a ele. Para manter a eficiência dessa operação, os eventos ``PyDict_EVENT_ADDED`` por chave não são emitidos nesse caso; em vez disso, um único ``PyDict_EVENT_CLONED`` é emitido e *key* será o dicionário de origem.

source: The callback may inspect but must not modify *dict*; doing so could have unpredictable effects, including infinite recursion. Do not trigger Python code execution in the callback, as it could modify the dict as a side effect.
pt_br: A função de retorno pode inspecionar, mas não deve modificar o *dict*; isso pode ter efeitos imprevisíveis, inclusive recursão infinita. Não acione a execução do código Python na função de retorno, pois isso poderia modificar o dict como um efeito colateral.

source: If *event* is ``PyDict_EVENT_DEALLOCATED``, taking a new reference in the callback to the about-to-be-destroyed dictionary will resurrect it and prevent it from being freed at this time. When the resurrected object is destroyed later, any watcher callbacks active at that time will be called again.
pt_br: Se *event* for ``PyDict_EVENT_DEALLOCATED``, a obtenção de uma nova referência na função de retorno para o dicionário prestes a ser destruído o ressuscitará e impedirá que ele seja liberado nesse momento. Quando o objeto ressuscitado for destruído mais tarde, quaisquer funções de retorno do observador ativos naquele momento serão chamados novamente.

source: Callbacks occur before the notified modification to *dict* takes place, so the prior state of *dict* can be inspected.
pt_br: As funções de retorno ocorrem antes que a modificação notificada no *dict* ocorra, de modo que o estado anterior do *dict* possa ser inspecionado.

source: If the callback sets an exception, it must return ``-1``; this exception will be printed as an unraisable exception using :c:func:`PyErr_WriteUnraisable`. Otherwise it should return ``0``.
pt_br: Se a função de retorno definir uma exceção, ela deverá retornar ``-1``; essa exceção será impressa como uma exceção não reprovável usando :c:func:`PyErr_WriteUnraisable`. Caso contrário, deverá retornar ``0``.
