Repository: python/python-docs-pt-br
Catalog: c-api/extension-modules.po
Languages: pt_br

source: Defining extension modules
pt_br: Definindo módulos de extensão

source: A C extension for CPython is a shared library (for example, a ``.so`` file on Linux, ``.pyd`` DLL on Windows), which is loadable into the Python process (for example, it is compiled with compatible compiler settings), and which exports an :ref:`initialization function <extension-export-hook>`.
pt_br: Uma extensão C para CPython é uma biblioteca compartilhada (por exemplo, um arquivo ``.so`` no Linux, uma DLL ``.pyd`` no Windows), que pode ser carregada no processo Python (por exemplo, ela é compilada com configurações de compilador compatíveis) e que exporta uma :ref:`função de inicialização <extension-export-hook>`.

source: To be importable by default (that is, by :py:class:`importlib.machinery.ExtensionFileLoader`), the shared library must be available on :py:attr:`sys.path`, and must be named after the module name plus an extension listed in :py:attr:`importlib.machinery.EXTENSION_SUFFIXES`.
pt_br: Para ser importável por padrão (ou seja, por :py:class:`importlib.machinery.ExtensionFileLoader`), a biblioteca compartilhada deve estar disponível em :py:attr:`sys.path` e deve ser nomeada após o nome do módulo mais uma extensão listada em :py:attr:`importlib.machinery.EXTENSION_SUFFIXES`.

source: Building, packaging and distributing extension modules is best done with third-party tools, and is out of scope of this document. One suitable tool is Setuptools, whose documentation can be found at https://setuptools.pypa.io/en/latest/setuptools.html.
pt_br: A construção, o empacotamento e a distribuição de módulos de extensão são melhor realizados com ferramentas de terceiros e estão fora do escopo deste documento. Uma ferramenta adequada é o Setuptools, cuja documentação pode ser encontrada em https://setuptools.pypa.io/en/latest/setuptools.html.

source: Normally, the initialization function returns a module definition initialized using :c:func:`PyModuleDef_Init`. This allows splitting the creation process into several phases:
pt_br: Normalmente, a função de inicialização retorna uma definição de módulo inicializada usando :c:func:`PyModuleDef_Init`. Isso permite dividir o processo de criação em várias fases:

source: Before any substantial code is executed, Python can determine which capabilities the module supports, and it can adjust the environment or refuse loading an incompatible extension.
pt_br: Antes que qualquer código substancial seja executado, o Python pode determinar quais recursos o módulo oferece suporte e pode ajustar o ambiente ou se recusar a carregar uma extensão incompatível.

source: By default, Python itself creates the module object -- that is, it does the equivalent of :py:meth:`object.__new__` for classes. It also sets initial attributes like :attr:`~module.__package__` and :attr:`~module.__loader__`.
pt_br: Por padrão, o próprio Python cria o objeto módulo — ou seja, faz o equivalente a :py:meth:`object.__new__` para classes. Ele também define atributos iniciais como :attr:`~module.__package__` e :attr:`~module.__loader__`.

source: Afterwards, the module object is initialized using extension-specific code -- the equivalent of :py:meth:`~object.__init__` on classes.
pt_br: Depois, o objeto do módulo é inicializado usando código específico da extensão — o equivalente a :py:meth:`~object.__init__` em classes.

source: This is called *multi-phase initialization* to distinguish it from the legacy (but still supported) *single-phase initialization* scheme, where the initialization function returns a fully constructed module. See the :ref:`single-phase-initialization section below <single-phase-initialization>` for details.
pt_br: Isso é chamado de *inicialização multifásica* para diferenciá-lo do esquema legado (mas ainda suportado) de *inicialização monofásica*, em que a função de inicialização retorna um módulo totalmente construído. Consulte a seção :ref:`inicialização monofásica abaixo <single-phase-initialization>` para obter detalhes.

source: Added support for multi-phase initialization (:pep:`489`).
pt_br: Adicionado suporte para inicialização multifásica (:pep:`489`).

source: Multiple module instances
pt_br: Várias instâncias de módulo

source: By default, extension modules are not singletons. For example, if the :py:attr:`sys.modules` entry is removed and the module is re-imported, a new module object is created, and typically populated with fresh method and type objects. The old module is subject to normal garbage collection. This mirrors the behavior of pure-Python modules.
pt_br: Por padrão, módulos de extensão não são singletons. Por exemplo, se a entrada :py:attr:`sys.modules` for removida e o módulo for reimportado, um novo objeto de módulo será criado e normalmente preenchido com novos métodos e tipos de objetos. O módulo antigo está sujeito à coleta de lixo normal. Isso reflete o comportamento dos módulos Python puros.

source: Additional module instances may be created in :ref:`sub-interpreters <sub-interpreter-support>` or after Python runtime reinitialization (:c:func:`Py_Finalize` and :c:func:`Py_Initialize`). In these cases, sharing Python objects between module instances would likely cause crashes or undefined behavior.
pt_br: Instâncias adicionais do módulo podem ser criadas em :ref:`subinterpretadores <sub-interpreter-support>` ou após a reinicialização do tempo de execução do Python (:c:func:`Py_Finalize` e :c:func:`Py_Initialize`). Nesses casos, compartilhar objetos Python entre instâncias do módulo provavelmente causaria travamentos ou comportamento indefinido.

source: To avoid such issues, each instance of an extension module should be *isolated*: changes to one instance should not implicitly affect the others, and all state owned by the module, including references to Python objects, should be specific to a particular module instance. See :ref:`isolating-extensions-howto` for more details and a practical guide.
pt_br: Para evitar tais problemas, cada instância de um módulo de extensão deve ser *isolada*: alterações em uma instância não devem afetar implicitamente as outras, e todos os estados pertencentes ao módulo, incluindo referências a objetos Python, devem ser específicos de uma instância específica do módulo. Consulte :ref:`isolating-extensions-howto` para obter mais detalhes e um guia prático.

source: A simpler way to avoid these issues is :ref:`raising an error on repeated initialization <isolating-extensions-optout>`.
pt_br: Uma maneira mais simples de evitar esses problemas é :ref:`levantar um erro na inicialização repetida <isolating-extensions-optout>`.

source: All modules are expected to support :ref:`sub-interpreters <sub-interpreter-support>`, or otherwise explicitly signal a lack of support. This is usually achieved by isolation or blocking repeated initialization, as above. A module may also be limited to the main interpreter using the :c:data:`Py_mod_multiple_interpreters` slot.
pt_br: Espera-se que todos os módulos ofereçam suporte a :ref:`subinterpretador <sub-interpreter-support>`, ou então sinalizem explicitamente a falta de suporte. Isso geralmente é obtido por isolamento ou bloqueio de inicializações repetidas, como acima. Um módulo também pode ser limitado ao interpretador principal usando o slot :c:data:`Py_mod_multiple_interpreters`.

source: Initialization function
pt_br: Função de inicialização

source: The initialization function defined by an extension module has the following signature:
pt_br: A função de inicialização definida por um módulo de extensão tem a seguinte assinatura:

source: Its name should be :samp:`PyInit_{<name>}`, with ``<name>`` replaced by the name of the module.
pt_br: Seu nome deve ser :samp:`PyInit_{<nome>}`, com ``<nome>`` substituído pelo nome do módulo.

source: For modules with ASCII-only names, the function must instead be named :samp:`PyInit_{<name>}`, with ``<name>`` replaced by the name of the module. When using :ref:`multi-phase-initialization`, non-ASCII module names are allowed. In this case, the initialization function name is :samp:`PyInitU_{<name>}`, with ``<name>`` encoded using Python's *punycode* encoding with hyphens replaced by underscores. In Python:
pt_br: Para módulos com nomes com somente ASCII, a função deve ser nomeada :samp:`PyInit_{<nome>}`, com ``<nome>`` substituído pelo nome do módulo. Ao usar :ref:`multi-phase-initialization`, nomes de módulos não ASCII são permitidos. Neste caso, o nome da função de inicialização é :samp:`PyInitU_{<nome>}`, com ``<nome>`` codificado usando a codificação *punycode* do Python com hífenes substituídos por sublinhados. Em Python::

source: def initfunc_name(name): try: suffix = b'_' + name.encode('ascii') except UnicodeEncodeError: suffix = b'U_' + name.encode('punycode').replace(b'-', b'_') return b'PyInit' + suffix
pt_br: def nome_func_iniciadora(nome): try: sufixo = b'_' + nome.encode('ascii') except UnicodeEncodeError: sufixo = b'U_' + nome.encode('punycode').replace(b'-', b'_') return b'PyInit' + sufixo

source: It is recommended to define the initialization function using a helper macro:
pt_br: É recomendável definir a função de inicialização usando uma macro auxiliar:

source: Declare an extension module initialization function. This macro:
pt_br: Declara uma função de inicialização do módulo de extensão. Esta macro:

source: specifies the :c:expr:`PyObject*` return type,
pt_br: especifica o tipo de retorno :c:expr:`PyObject*`,

source: adds any special linkage declarations required by the platform, and
pt_br: adiciona quaisquer declarações de vinculação especiais exigidas pela plataforma e

source: for C++, declares the function as ``extern "C"``.
pt_br: para C++, declara a função como ``extern "C"``.

source: For example, a module called ``spam`` would be defined like this::
pt_br: Por exemplo, um módulo chamado ``spam`` seria definido assim::

source: It is possible to export multiple modules from a single shared library by defining multiple initialization functions. However, importing them requires using symbolic links or a custom importer, because by default only the function corresponding to the filename is found. See the `Multiple modules in one library <https://peps.python.org/pep-0489/#multiple-modules-in-one-library>`__ section in :pep:`489` for details.
pt_br: É possível exportar vários módulos de uma única biblioteca compartilhada, definindo várias funções de inicialização. No entanto, importá-los requer o uso de links simbólicos ou um importador personalizado, porque por padrão apenas a função correspondente ao nome do arquivo é encontrada. Veja a seção `Multiple modules in one library <https://peps.python.org/pep-0489/#multiple-modules-in-one-library>`__ na :pep:`489` para detalhes.

source: The initialization function is typically the only non-\ ``static`` item defined in the module's C source.
pt_br: A função de inicialização normalmente é o único item não ``static`` definido no código-fonte C do módulo.

source: Multi-phase initialization
pt_br: Inicialização multifásica

source: Normally, the :ref:`initialization function <extension-export-hook>` (``PyInit_modulename``) returns a :c:type:`PyModuleDef` instance with non-``NULL`` :c:member:`~PyModuleDef.m_slots`. Before it is returned, the ``PyModuleDef`` instance must be initialized using the following function:
pt_br: Normalmente, a :ref:`função de inicialização <extension-export-hook>` (``PyInit_modulename``) retorna uma instância de :c:type:`PyModuleDef` com :c:member:`~PyModuleDef.m_slots` não ``NULL``. Antes de ser retornada, a instância ``PyModuleDef`` deve ser inicializada usando a seguinte função:

source: Ensure a module definition is a properly initialized Python object that correctly reports its type and a reference count.
pt_br: Garante que uma definição de módulo é um objeto Python devidamente inicializado que reporta corretamente seu tipo e uma contagem de referências.

source: Return *def* cast to ``PyObject*``, or ``NULL`` if an error occurred.
pt_br: Retorna *def* convertido para ``PyObject*``, ou ``NULL`` se ocorrer um erro.

source: Calling this function is required for :ref:`multi-phase-initialization`. It should not be used in other contexts.
pt_br: A chamada desta função é necessária para :ref:`multi-phase-initialization`. Ela não deve ser usada em outros contextos.

source: Note that Python assumes that ``PyModuleDef`` structures are statically allocated. This function may return either a new reference or a borrowed one; this reference must not be released.
pt_br: Observe que o Python assume que as estruturas ``PyModuleDef`` são alocadas estaticamente. Esta função pode retornar uma nova referência ou uma referência emprestada; esta referência não deve ser liberada.

source: Legacy single-phase initialization
pt_br: Inicialização monofásica legada

source: Single-phase initialization is a legacy mechanism to initialize extension modules, with known drawbacks and design flaws. Extension module authors are encouraged to use multi-phase initialization instead.
pt_br: A inicialização monofásica é um mecanismo legado para inicializar módulos de extensão, com desvantagens e falhas de projeto conhecidas. Os autores de módulos de extensão são incentivados a utilizar a inicialização multifásica.

source: In single-phase initialization, the :ref:`initialization function <extension-export-hook>` (``PyInit_modulename``) should create, populate and return a module object. This is typically done using :c:func:`PyModule_Create` and functions like :c:func:`PyModule_AddObjectRef`.
pt_br: Na inicialização monofásica, a :ref:`função de inicialização <extension-export-hook>` (``PyInit_modulename``) deve criar, preencher e retornar um objeto de módulo. Isso normalmente é feito usando :c:func:`PyModule_Create` e funções como :c:func:`PyModule_AddObjectRef`.

source: Single-phase initialization differs from the :ref:`default <multi-phase-initialization>` in the following ways:
pt_br: A inicialização monofásica difere do :ref:`padrão <multi-phase-initialization>` nas seguintes maneiras:

source: Single-phase modules are, or rather *contain*, “singletons”.
pt_br: Módulos monofásicos são, ou melhor, *contêm*, “singletons”.

source: When the module is first initialized, Python saves the contents of the module's ``__dict__`` (that is, typically, the module's functions and types).
pt_br: Quando o módulo é inicializado pela primeira vez, o Python salva o conteúdo do ``__dict__`` do módulo (ou seja, normalmente, as funções e os tipos do módulo).

source: For subsequent imports, Python does not call the initialization function again. Instead, it creates a new module object with a new ``__dict__``, and copies the saved contents to it. For example, given a single-phase module ``_testsinglephase`` [#testsinglephase]_ that defines a function ``sum`` and an exception class ``error``:
pt_br: Para importações subsequentes, o Python não chama a função de inicialização novamente. Em vez disso, ele cria um novo objeto de módulo com um novo ``__dict__`` e copia o conteúdo salvo para ele. Por exemplo, dado um módulo monofásico ``_testsinglephase`` [#testsinglephase]_ que define uma função ``sum`` e uma classe de exceção ``error``:

source: The exact behavior should be considered a CPython implementation detail.
pt_br: O comportamento exato deve ser considerado um detalhe da implementação do CPython.

source: To work around the fact that ``PyInit_modulename`` does not take a *spec* argument, some state of the import machinery is saved and applied to the first suitable module created during the ``PyInit_modulename`` call. Specifically, when a sub-module is imported, this mechanism prepends the parent package name to the name of the module.
pt_br: Para contornar o fato de que ``PyInit_modulename`` não aceita um argumento *spec*, parte do estado do mecanismo de importação é salvo e aplicado ao primeiro módulo adequado criado durante a chamada ``PyInit_modulename``. Especificamente, quando um submódulo é importado, esse mecanismo adiciona o nome do pacote pai ao nome do módulo.

source: A single-phase ``PyInit_modulename`` function should create “its” module object as soon as possible, before any other module objects can be created.
pt_br: Uma função monofásica ``PyInit_modulename`` deve criar “seu” objeto de módulo o mais rápido possível, antes que qualquer outro objeto de módulo possa ser criado.

source: Non-ASCII module names (``PyInitU_modulename``) are not supported.
pt_br: Nomes de módulos não ASCII (``PyInitU_modulename``) não são suportados.

source: Single-phase modules support module lookup functions like :c:func:`PyState_FindModule`.
pt_br: Módulos monofásicos oferecem suporte a funções de pesquisa de módulos como :c:func:`PyState_FindModule`.

source: ``_testsinglephase`` is an internal module used in CPython's self-test suite; your installation may or may not include it.
pt_br: ``_testsinglephase`` é um módulo interno usado no conjunto de autotestes do CPython; sua instalação pode ou não incluí-lo.
