Repository: python/python-docs-pt-br
Catalog: c-api/float.po
Languages: pt_br

source: Floating-Point Objects
pt_br: Objetos de ponto flutuante

source: This subtype of :c:type:`PyObject` represents a Python floating-point object.
pt_br: Este subtipo de :c:type:`PyObject` representa um objeto de ponto flutuante do Python.

source: This instance of :c:type:`PyTypeObject` represents the Python floating-point type. This is the same object as :class:`float` in the Python layer.
pt_br: Esta instância do :c:type:`PyTypeObject` representa o tipo de ponto flutuante do Python. Este é o mesmo objeto :class:`float` na camada do Python.

source: Return true if its argument is a :c:type:`PyFloatObject` or a subtype of :c:type:`PyFloatObject`. This function always succeeds.
pt_br: Retorna true se seu argumento é um :c:type:`PyFloatObject` ou um subtipo de :c:type:`PyFloatObject`. Esta função sempre tem sucesso.

source: Return true if its argument is a :c:type:`PyFloatObject`, but not a subtype of :c:type:`PyFloatObject`. This function always succeeds.
pt_br: Retorna true se seu argumento é um :c:type:`PyFloatObject`, mas um subtipo de :c:type:`PyFloatObject`. Esta função sempre tem sucesso.

source: Create a :c:type:`PyFloatObject` object based on the string value in *str*, or ``NULL`` on failure.
pt_br: Cria um objeto :c:type:`PyFloatObject` baseado em uma string de valor "str" ou ``NULL`` em falha.

source: Create a :c:type:`PyFloatObject` object from *v*, or ``NULL`` on failure.
pt_br: Cria um objeto :c:type:`PyFloatObject` de *v* ou ``NULL`` em falha.

source: Return a C :c:expr:`double` representation of the contents of *pyfloat*. If *pyfloat* is not a Python floating-point object but has a :meth:`~object.__float__` method, this method will first be called to convert *pyfloat* into a float. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`. This method returns ``-1.0`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
pt_br: Retorna uma representação C :c:expr:`double` do conteúdo de *pyfloat*. Se *pyfloat* não é um objeto de ponto flutuante do Python, mas possui o método :meth:`~object.__float__`, esse método será chamado primeiro para converter *pyfloat* em um ponto flutuante. Se :meth:`!__float__` não estiver definido, será usado :meth:`__index__`. Este método retorna ``-1.0`` em caso de falha, portanto, deve-se chamar :c:func:`PyErr_Occurred` para verificar se há erros.

source: Use :meth:`~object.__index__` if available.
pt_br: Usa :meth:`~object.__index__`, se disponível.

source: Return a C :c:expr:`double` representation of the contents of *pyfloat*, but without error checking.
pt_br: Retorna uma representação C :c:expr:`double` do conteúdo de *pyfloat*, mas sem verificação de erro.

source: Return a structseq instance which contains information about the precision, minimum and maximum values of a float. It's a thin wrapper around the header file :file:`float.h`.
pt_br: Retorna uma instância de structseq que contém informações sobre a precisão, os valores mínimo e máximo de um ponto flutuante. É um invólucro fino em torno do arquivo de cabeçalho :file:`float.h`.

source: Return the maximum representable finite float *DBL_MAX* as C :c:expr:`double`.
pt_br: Retorna o ponto flutuante finito máximo representável *DBL_MAX* como :c:expr:`double` do C.

source: Return the minimum normalized positive float *DBL_MIN* as C :c:expr:`double`.
pt_br: Retorna o ponto flutuante positivo mínimo normalizado *DBL_MIN* como :c:expr:`double` do C.

source: This macro expands a to constant expression of type :c:expr:`double`, that represents the positive infinity.
pt_br: Esta macro expande uma expressão constante do tipo :c:expr:`double`, que representa o infinito positivo.

source: On most platforms, this is equivalent to the :c:macro:`!INFINITY` macro from the C11 standard ``<math.h>`` header.
pt_br: Na maioria das plataformas, isso equivale à macro :c:macro:`!INFINITY` do cabeçalho ``<math.h>`` do padrão C11.

source: This macro expands a to constant expression of type :c:expr:`double`, that represents a quiet not-a-number (qNaN) value.
pt_br: Esta macro expande uma expressão constante do tipo :c:expr:`double`, que representa um valor não um número quieto (qNaN).

source: On most platforms, this is equivalent to the :c:macro:`!NAN` macro from the C11 standard ``<math.h>`` header.
pt_br: Na maioria das plataformas, isso equivale à macro :c:macro:`!NAN` do cabeçalho ``<math.h>`` do padrão C11.

source: Equivalent to :c:macro:`!INFINITY`.
pt_br: Equivalente a :c:macro:`!INFINITY`.

source: The macro is :term:`soft deprecated`.
pt_br: A macro está :term:`suavemente descontinuada <suavemente descontinuado>`.

source: The definition (accurate for a :c:expr:`double` type) of the :data:`math.e` constant.
pt_br: A definição (precisa para um tipo :c:expr:`double`) da constante :data:`math.e`.

source: High precision (long double) definition of :data:`~math.e` constant.
pt_br: Definição de alta precisão (long double) da constante :data:`~math.e`.

source: The definition (accurate for a :c:expr:`double` type) of the :data:`math.pi` constant.
pt_br: A definição (precisa para um tipo :c:expr:`double`) da constante :data:`math.pi`.

source: High precision (long double) definition of :data:`~math.pi` constant.
pt_br: Definição de alta precisão (long double) da constante :data:`~math.pi`.

source: The definition (accurate for a :c:expr:`double` type) of the :data:`math.tau` constant.
pt_br: A definição (precisa para um tipo :c:expr:`double`) da constante :data:`math.tau`.

source: Return :data:`math.nan` from a function.
pt_br: Retorna :data:`math.nan` de uma função.

source: On most platforms, this is equivalent to ``return PyFloat_FromDouble(NAN)``.
pt_br: Na maioria das plataformas, isso equivale a ``return PyFloat_FromDouble(NAN)``.

source: Return :data:`math.inf` or :data:`-math.inf <math.inf>` from a function, depending on the sign of *sign*.
pt_br: Retorna :data:`math.inf` ou :data:`-math.inf <math.inf>` de uma função, dependendo do sinal de *sign*.

source: On most platforms, this is equivalent to the following::
pt_br: Na maioria das plataformas, isso equivale ao seguinte::

source: Return ``1`` if the given floating-point number *X* is finite, that is, it is normal, subnormal or zero, but not infinite or NaN. Return ``0`` otherwise.
pt_br: Retorna ``1`` se o número de ponto flutuante *X* fornecido for finito, ou seja, for normal, subnormal ou zero, mas não infinito ou NaN. Caso contrário, retorna ``0``.

source: The macro is :term:`soft deprecated`. Use :c:macro:`!isfinite` instead.
pt_br: A macro está :term:`suavemente descontinuada <suavemente descontinuado>`. Use :c:macro:`!isfinite` em vez disso.

source: Return ``1`` if the given floating-point number *X* is positive or negative infinity. Return ``0`` otherwise.
pt_br: Retorna ``1`` se o número de ponto flutuante *X* fornecido for infinito positivo ou negativo. Caso contrário, retorna ``0``.

source: The macro is :term:`soft deprecated`. Use :c:macro:`!isinf` instead.
pt_br: A macro está :term:`suavemente descontinuada <suavemente descontinuado>`. Use :c:macro:`!isinf` em vez disso.

source: Return ``1`` if the given floating-point number *X* is a not-a-number (NaN) value. Return ``0`` otherwise.
pt_br: Retorna ``1`` se o número de ponto flutuante fornecido *X* for um valor não numérico (NaN). Caso contrário, retorna ``0``.

source: The macro is :term:`soft deprecated`. Use :c:macro:`!isnan` instead.
pt_br: A macro está :term:`suavemente descontinuada <suavemente descontinuado>`. Use :c:macro:`!isnan` em vez disso.

source: Pack and Unpack functions
pt_br: As funções Pack e Unpack

source: The pack and unpack functions provide an efficient platform-independent way to store floating-point values as byte strings. The Pack routines produce a bytes string from a C :c:expr:`double`, and the Unpack routines produce a C :c:expr:`double` from such a bytes string. The suffix (2, 4 or 8) specifies the number of bytes in the bytes string.
pt_br: As funções de empacotamento e desempacotamento, pack e unpack respectivamente, fornecem uma maneira eficiente e independente de plataforma de armazenar valores de ponto flutuante como strings de bytes. As rotinas de Pack produzem uma string de bytes a partir de um C :c:expr:`double`, e as rotinas de Unpack produzem um C :c:expr:`double` a partir dessa string de bytes. O sufixo (2, 4 ou 8) especifica o número de bytes na string de bytes.

source: On platforms that appear to use IEEE 754 formats these functions work by copying bits. On other platforms, the 2-byte format is identical to the IEEE 754 binary16 half-precision format, the 4-byte format (32-bit) is identical to the IEEE 754 binary32 single precision format, and the 8-byte format to the IEEE 754 binary64 double precision format, although the packing of INFs and NaNs (if such things exist on the platform) isn't handled correctly, and attempting to unpack a bytes string containing an IEEE INF or NaN will raise an exception.
pt_br: Em plataformas que parecem usar o formato IEEE 754, essas funções funcionam copiando bits. Em outras plataformas, o formato de 2 bytes é idêntico ao formato de meia precisão binário 16 do IEEE 754, o formato de 4 bytes (32 bits) é idêntico ao formato de precisão simples binário 32 do IEEE 754 e o formato de 8 bytes ao formato de precisão dupla binário 64 do IEEE 754, embora o empacotamento de INFs e NaNs (se tais recursos existirem na plataforma) não seja tratado corretamente, e tentar desempacotar uma string de bytes contendo um INF ou NaN do IEEE levantará uma exceção.

source: Note that NaNs type may not be preserved on IEEE platforms (signaling NaN become quiet NaN), for example on x86 systems in 32-bit mode.
pt_br: Observe que o tipo NaNs pode não ser preservado em plataformas IEEE (NaN sinalizantes tornam-se silenciosos), por exemplo, em sistemas x86 no modo de 32 bits.

source: On non-IEEE platforms with more precision, or larger dynamic range, than IEEE 754 supports, not all values can be packed; on non-IEEE platforms with less precision, or smaller dynamic range, not all values can be unpacked. What happens in such cases is partly accidental (alas).
pt_br: Em plataformas que não aderem IEEE com maior precisão ou maior alcance dinâmico do que o suportado pelo IEEE 754, nem todos os valores podem ser empacotados; em plataformas que não aderem IEEE com menor precisão ou menor alcance dinâmico, nem todos os valores podem ser desempacotados. O que acontece nesses casos é em parte acidental (infelizmente).

source: Pack functions
pt_br: Funções Pack

source: The pack routines write 2, 4 or 8 bytes, starting at *p*. *le* is an :c:expr:`int` argument, non-zero if you want the bytes string in little-endian format (exponent last, at ``p+1``, ``p+3``, or ``p+6`` ``p+7``), zero if you want big-endian format (exponent first, at *p*). The :c:macro:`PY_BIG_ENDIAN` constant can be used to use the native endian: it is equal to ``1`` on big endian processor, or ``0`` on little endian processor.
pt_br: As rotinas de empacotamento gravam 2, 4 ou 8 bytes, começando em *p*. *le* é um argumento :c:expr:`int`, diferente de zero se você quiser a sequência de bytes no formato little-endian (expoente por último, em ``p+1``, ``p+3`` ou ``p+6`` ``p+7``), zero se você quiser o formato big-endian (expoente primeiro, em *p*). A constante :c:macro:`PY_BIG_ENDIAN` pode ser usada para usar o endian nativo: é igual a ``1`` em processadores big-endian ou ``0`` em processadores little-endian.

source: Return value: ``0`` if all is OK, ``-1`` if error (and an exception is set, most likely :exc:`OverflowError`).
pt_br: Valor de retorno: ``0`` se tudo estiver OK, ``-1`` se houver erro (e uma exceção for definida, provavelmente :exc:`OverflowError`).

source: There are two problems on non-IEEE platforms:
pt_br: Existem dois problemas em plataformas não IEEE:

source: What this does is undefined if *x* is a NaN or infinity.
pt_br: O que isso faz é indefinido se *x* é um NaN ou infinito.

source: ``-0.0`` and ``+0.0`` produce the same bytes string.
pt_br: ``-0.0`` e ``+0.0`` produzem a mesma sequência de bytes.

source: Pack a C double as the IEEE 754 binary16 half-precision format.
pt_br: Empacota um C duplo como o formato de meia precisão binário16 IEEE 754.

source: Pack a C double as the IEEE 754 binary32 single precision format.
pt_br: Empacota um C duplo como o formato de precisão simples binário32 IEEE 754.

source: Pack a C double as the IEEE 754 binary64 double precision format.
pt_br: Empacota um C duplo como o formato de precisão dupla binária 64 IEEE 754.

source: Unpack functions
pt_br: Funções de Unpack

source: The unpack routines read 2, 4 or 8 bytes, starting at *p*. *le* is an :c:expr:`int` argument, non-zero if the bytes string is in little-endian format (exponent last, at ``p+1``, ``p+3`` or ``p+6`` and ``p+7``), zero if big-endian (exponent first, at *p*). The :c:macro:`PY_BIG_ENDIAN` constant can be used to use the native endian: it is equal to ``1`` on big endian processor, or ``0`` on little endian processor.
pt_br: As rotinas de desempacotamento leem 2, 4 ou 8 bytes, começando em *p*. *le* é um argumento :c:expr:`int`, diferente de zero se a sequência de bytes estiver no formato little-endian (expoente por último, em ``p+1``, ``p+3`` ou ``p+6`` e ``p+7``), zero se big-endian (expoente primeiro, em *p*). A constante :c:macro:`PY_BIG_ENDIAN` pode ser usada para usar o endian nativo: é igual a ``1`` em processadores big-endian ou ``0`` em processadores little-endian.

source: Return value: The unpacked double. On error, this is ``-1.0`` and :c:func:`PyErr_Occurred` is true (and an exception is set, most likely :exc:`OverflowError`).
pt_br: Valor de retorno: O double descompactado. Em caso de erro, é ``-1.0`` e :c:func:`PyErr_Occurred` é verdadeiro (e uma exceção é definida, provavelmente :exc:`OverflowError`).

source: Note that on a non-IEEE platform this will refuse to unpack a bytes string that represents a NaN or infinity.
pt_br: Observe que em uma plataforma que não adere IEEE isso se recusará a descompactar uma sequência de bytes que representa um NaN ou infinito.

source: Unpack the IEEE 754 binary16 half-precision format as a C double.
pt_br: Descompacta o formato de meia precisão IEEE 754 binary16 como um double C.

source: Unpack the IEEE 754 binary32 single precision format as a C double.
pt_br: Descompacta o formato IEEE 754 binary32 de precisão simples como um C double.

source: Unpack the IEEE 754 binary64 double precision format as a C double.
pt_br: Descompacta o formato IEEE 754 binary64 de precisão dupla como um C double.

source: object
pt_br: objeto

source: floating-point
pt_br: ponto flutuante
