Repository: python/python-docs-pt-br
Catalog: c-api/gen.po
Languages: pt_br

source: Generator Objects
pt_br: Objetos Geradores

source: Generator objects are what Python uses to implement generator iterators. They are normally created by iterating over a function that yields values, rather than explicitly calling :c:func:`PyGen_New` or :c:func:`PyGen_NewWithQualName`.
pt_br: Objetos geradores são o que o Python usa para implementar iteradores geradores. Eles são normalmente criados por iteração sobre uma função que produz valores, em vez de invocar explicitamente :c:func:`PyGen_New` ou :c:func:`PyGen_NewWithQualName`.

source: The C structure used for generator objects.
pt_br: A estrutura C usada para objetos geradores.

source: The type object corresponding to generator objects.
pt_br: O objeto de tipo correspondendo a objetos geradores.

source: Return true if *ob* is a generator object; *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se *ob* for um objeto gerador; *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return true if *ob*'s type is :c:type:`PyGen_Type`; *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna verdadeiro se o tipo do *ob* é :c:type:`PyGen_Type`; *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Create and return a new generator object based on the *frame* object. A reference to *frame* is stolen by this function. The argument must not be ``NULL``.
pt_br: Cria e retorna um novo objeto gerador com base no objeto *frame*. Uma referência a *quadro* é roubada por esta função. O argumento não deve ser ``NULL``.

source: Create and return a new generator object based on the *frame* object, with ``__name__`` and ``__qualname__`` set to *name* and *qualname*. A reference to *frame* is stolen by this function. The *frame* argument must not be ``NULL``.
pt_br: Cria e retorna um novo objeto gerador com base no objeto *frame*, com ``__name__`` e ``__qualname__`` definidos como *name* e *qualname*. Uma referência a *frame* é roubada por esta função. O argumento *frame* não deve ser ``NULL``.

source: Return a new :term:`strong reference` to the code object wrapped by *gen*. This function always succeeds.
pt_br: Retorna uma nova :term:`referência forte` ao objeto de código encapsulado por *gen*. Esta função sempre tem sucesso.

source: Asynchronous Generator Objects
pt_br: Objetos geradores assíncronos

source: The type object corresponding to asynchronous generator objects. This is available as :class:`types.AsyncGeneratorType` in the Python layer.
pt_br: O objeto de tipo correspondente aos objetos geradores assíncronos. Está disponível como :class:`types.AsyncGeneratorType` na camada Python.

source: Create a new asynchronous generator wrapping *frame*, with ``__name__`` and ``__qualname__`` set to *name* and *qualname*. *frame* is stolen by this function and must not be ``NULL``.
pt_br: Cria um novo gerador assíncrono que encapsule *frame*, com ``__name__`` e ``__qualname__`` definidos como *name* e *qualname*. *frame* é apropriado por esta função e não deve ser ``NULL``.

source: On success, this function returns a :term:`strong reference` to the new asynchronous generator. On failure, this function returns ``NULL`` with an exception set.
pt_br: Em caso de sucesso, esta função retorna uma :term:`referência forte` ao novo gerador assíncrono. Em caso de falha, esta função retorna ``NULL`` com uma exceção definida.

source: Return true if *op* is an asynchronous generator object, false otherwise. This function always succeeds.
pt_br: Retorna verdadeiro se *op* for um objeto gerador assíncrono, falso caso contrário. Esta função sempre tem sucesso.
