Repository: python/python-docs-pt-br
Catalog: c-api/import.po
Languages: pt_br

source: Importing Modules
pt_br: Importando módulos

source: This function is a deprecated alias of :c:func:`PyImport_ImportModule`.
pt_br: Esta função é um alias descontinuado de :c:func:`PyImport_ImportModule`.

source: This function used to fail immediately when the import lock was held by another thread. In Python 3.3 though, the locking scheme switched to per-module locks for most purposes, so this function's special behaviour isn't needed anymore.
pt_br: Essa função falhava em alguns casos, quando a trava de importação era mantida por outra thread. No Python 3.3, no entanto, o esquema de trava mudou passando a ser de travas por módulo na maior parte, dessa forma, o comportamento especial dessa função não é mais necessário.

source: Import a module. This is best described by referring to the built-in Python function :func:`__import__`.
pt_br: Importa um módulo. Isso é melhor descrito referindo-se à função embutida do Python :func:`__import__`.

source: The return value is a new reference to the imported module or top-level package, or ``NULL`` with an exception set on failure. Like for :func:`__import__`, the return value when a submodule of a package was requested is normally the top-level package, unless a non-empty *fromlist* was given.
pt_br: O valor de retorno é uma nova referência ao módulo importado ou pacote de nível superior, ou ``NULL`` com uma exceção definida em caso de falha. Como para :func:`__import__`, o valor de retorno quando um submódulo de um pacote é solicitado é normalmente o pacote de nível superior, a menos que um *fromlist* não vazio seja fornecido.

source: Failing imports remove incomplete module objects, like with :c:func:`PyImport_ImportModule`.
pt_br: As importações com falhas removem objetos incompletos do módulo, como em :c:func:`PyImport_ImportModule`.

source: Import a module. This is best described by referring to the built-in Python function :func:`__import__`, as the standard :func:`__import__` function calls this function directly.
pt_br: Importa um módulo. Isso é melhor descrito referindo-se à função embutida do Python :func:`__import__`, já que a função padrão :func:`__import__` chama essa função diretamente.

source: Similar to :c:func:`PyImport_ImportModuleLevelObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
pt_br: Semelhante para :c:func:`PyImport_ImportModuleLevelObject`, mas o nome é uma string codificada em UTF-8 de um objeto Unicode.

source: Negative values for *level* are no longer accepted.
pt_br: Valores negativos para *level* não são mais aceitos.

source: This is a higher-level interface that calls the current "import hook function" (with an explicit *level* of 0, meaning absolute import). It invokes the :func:`__import__` function from the ``__builtins__`` of the current globals. This means that the import is done using whatever import hooks are installed in the current environment.
pt_br: Essa é uma interface de alto nível que chama a atual "função auxiliar de importação" (com um *level* explícito de 0, significando importação absoluta). Invoca a função :func:`__import__` a partir de ``__builtins__`` da global atual. Isso significa que a importação é feita usando quaisquer extras de importação instalados no ambiente atual.

source: This function always uses absolute imports.
pt_br: Esta função sempre usa importações absolutas.

source: Reload a module. Return a new reference to the reloaded module, or ``NULL`` with an exception set on failure (the module still exists in this case).
pt_br: Recarrega um módulo. Retorna uma nova referência para o módulo recarregado, ou ``NULL`` com uma exceção definida em caso de falha (o módulo ainda existe neste caso).

source: Return the module object corresponding to a module name. The *name* argument may be of the form ``package.module``. First check the modules dictionary if there's one there, and if not, create a new one and insert it in the modules dictionary. Return ``NULL`` with an exception set on failure.
pt_br: Retorna o objeto módulo correspondente a um nome de módulo. O argumento *name* pode ter a forma ``package.module``. Primeiro verifica o dicionário de módulos se houver algum, caso contrário, cria um novo e insere-o no dicionário de módulos. Retorna ``NULL`` com uma exceção definida em caso de falha.

source: This function does not load or import the module; if the module wasn't already loaded, you will get an empty module object. Use :c:func:`PyImport_ImportModule` or one of its variants to import a module. Package structures implied by a dotted name for *name* are not created if not already present.
pt_br: Esta função não carrega ou importa o módulo; se o módulo não foi carregado, você receberá um objeto de módulo vazio. Use :c:func:`PyImport_ImportModule` ou uma de suas variações para importar um módulo. Estruturas de pacotes implícitos por um nome pontilhado para a *name* não são criados se não estiverem presentes.

source: Similar to :c:func:`PyImport_AddModuleObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
pt_br: Semelhante para :c:func:`PyImport_AddModuleObject`, mas o nome é uma string codifica em UTF-8 em vez de um objeto Unicode.

source: This function will reload the module if it was already imported. See :c:func:`PyImport_ReloadModule` for the intended way to reload a module.
pt_br: Esta função recarregará o módulo se este já tiver sido importado. Veja :c:func:`PyImport_ReloadModule` para forma desejada de recarregar um módulo.

source: If *name* points to a dotted name of the form ``package.module``, any package structures not already created will still not be created.
pt_br: Se *name* apontar para um nome pontilhado no formato de ``package.module``, quaisquer estruturas de pacote ainda não criadas ainda não serão criadas.

source: See also :c:func:`PyImport_ExecCodeModuleEx` and :c:func:`PyImport_ExecCodeModuleWithPathnames`.
pt_br: Veja também :c:func:`PyImport_ExecCodeModuleEx` e :c:func:`PyImport_ExecCodeModuleWithPathnames`.

source: Like :c:func:`PyImport_ExecCodeModule`, but the :attr:`__file__` attribute of the module object is set to *pathname* if it is non-``NULL``.
pt_br: Como :c:func:`PyImport_ExecCodeModule`, mas o atributo :attr:`__file__` do objeto módulo é definido como *pathname* se não for ``NULL``.

source: See also :c:func:`PyImport_ExecCodeModuleWithPathnames`.
pt_br: Veja também :c:func:`PyImport_ExecCodeModuleWithPathnames`.

source: Like :c:func:`PyImport_ExecCodeModuleEx`, but the :attr:`__cached__` attribute of the module object is set to *cpathname* if it is non-``NULL``. Of the three functions, this is the preferred one to use.
pt_br: Como :c:func:`PyImport_ExecCodeModuleEx`, mas o atributo :attr:`__cached__` do objeto módulo é definido como *cpathname* se não for ``NULL``. Das três funções, esta é a preferida para usar.

source: Like :c:func:`PyImport_ExecCodeModuleObject`, but *name*, *pathname* and *cpathname* are UTF-8 encoded strings. Attempts are also made to figure out what the value for *pathname* should be from *cpathname* if the former is set to ``NULL``.
pt_br: Como :c:func:`PyImport_ExecCodeModuleObject`, mas *name*, *pathname* e *cpathname* são strings codificadas em UTF-8. Também são feitas tentativas para descobrir qual valor para *pathname* deve ser de *cpathname* se o primeiro estiver definido como ``NULL``.

source: Return the magic number for Python bytecode files (a.k.a. :file:`.pyc` file). The magic number should be present in the first four bytes of the bytecode file, in little-endian byte order. Returns ``-1`` on error.
pt_br: Retorna o número mágico para arquivos de bytecode Python (também conhecido como arquivo :file:`.pyc`). O número mágico deve estar presente nos primeiros quatro bytes do arquivo bytecode, na ordem de bytes little-endian. Retorna ``-1`` em caso de erro.

source: Return value of ``-1`` upon failure.
pt_br: Retorna o valor de ``-1`` no caso de falha.

source: Return the magic tag string for :pep:`3147` format Python bytecode file names. Keep in mind that the value at ``sys.implementation.cache_tag`` is authoritative and should be used instead of this function.
pt_br: Retorna a string de tag mágica para nomes de arquivo de bytecode Python no formato de :pep:`3147`. Tenha em mente que o valor em ``sys.implementation.cache_tag`` é autoritativo e deve ser usado no lugar desta função.

source: Return the dictionary used for the module administration (a.k.a. ``sys.modules``). Note that this is a per-interpreter variable.
pt_br: Retorna o dicionário usado para a administração do módulo (também conhecido como ``sys.modules``). Observe que esta é uma variável por interpretador.

source: Return the already imported module with the given name. If the module has not been imported yet then returns ``NULL`` but does not set an error. Returns ``NULL`` and sets an error if the lookup failed.
pt_br: Retorna o módulo já importado com o nome fornecido. Se o módulo ainda não foi importado, retorna ``NULL``, mas não define um erro. Retorna ``NULL`` e define um erro se a pesquisa falhar.

source: Load a frozen module named *name*. Return ``1`` for success, ``0`` if the module is not found, and ``-1`` with an exception set if the initialization failed. To access the imported module on a successful load, use :c:func:`PyImport_ImportModule`. (Note the misnomer --- this function would reload the module if it was already imported.)
pt_br: Carrega um módulo congelado chamado *name*. Retorna ``1`` para sucesso, ``0`` se o módulo não for encontrado e ``-1`` com uma exceção definida se a inicialização falhar. Para acessar o módulo importado em um carregamento bem-sucedido, use :c:func:`PyImport_ImportModule`. (Observe o nome incorreto --- esta função recarregaria o módulo se ele já tivesse sido importado.)

source: The ``__file__`` attribute is no longer set on the module.
pt_br: O atributo ``__file__`` não está mais definido no módulo.

source: Similar to :c:func:`PyImport_ImportFrozenModuleObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
pt_br: Semelhante a :c:func:`PyImport_ImportFrozenModuleObject`, mas o nome é uma string codificada em UTF-8 em vez de um objeto Unicode.

source: This is the structure type definition for frozen module descriptors, as generated by the :program:`freeze` utility (see :file:`Tools/freeze/` in the Python source distribution). Its definition, found in :file:`Include/import.h`, is::
pt_br: Esta é a definição do tipo de estrutura para descritores de módulo congelados, conforme gerado pelo utilitário :program:`freeze` (veja :file:`Tools/freeze/` na distribuição fonte do Python). Sua definição, encontrada em :file:`Include/import.h`, é::

source: The new ``is_package`` field indicates whether the module is a package or not. This replaces setting the ``size`` field to a negative value.
pt_br: O novo campo ``is_package`` indica se o módulo é um pacote ou não. Isso substitui a configuração do campo ``size`` para um valor negativo.

source: This pointer is initialized to point to an array of :c:struct:`_frozen` records, terminated by one whose members are all ``NULL`` or zero. When a frozen module is imported, it is searched in this table. Third-party code could play tricks with this to provide a dynamically created collection of frozen modules.
pt_br: Este ponteiro é inicializado para apontar para um vetor de registros de :c:struct:`_frozen`, terminado por um cujos membros são todos ``NULL`` ou zero. Quando um módulo congelado é importado, ele é pesquisado nesta tabela. O código de terceiros pode fazer truques com isso para fornecer uma coleção criada dinamicamente de módulos congelados.

source: Add a single module to the existing table of built-in modules. This is a convenience wrapper around :c:func:`PyImport_ExtendInittab`, returning ``-1`` if the table could not be extended. The new module can be imported by the name *name*, and uses the function *initfunc* as the initialization function called on the first attempted import. This should be called before :c:func:`Py_Initialize`.
pt_br: Adiciona um único módulo à tabela existente de módulos embutidos. Este é um invólucro prático em torno de :c:func:`PyImport_ExtendInittab`, retornando ``-1`` se a tabela não puder ser estendida. O novo módulo pode ser importado pelo nome *name* e usa a função *initfunc* como a função de inicialização chamada na primeira tentativa de importação. Deve ser chamado antes de :c:func:`Py_Initialize`.

source: If Python is initialized multiple times, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` must be called before each Python initialization.
pt_br: Se Python é inicializado várias vezes, :c:func:`PyImport_AppendInittab` ou :c:func:`PyImport_ExtendInittab` devem ser chamados antes de cada inicialização do Python.

source: built-in function
pt_br: função embutida
