Repository: python/python-docs-pt-br
Catalog: c-api/init_config.po
Languages: pt_br

source: Python Initialization Configuration
pt_br: Configuração de Inicialização do Python

source: Python can be initialized with :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure. It can be preinitialized with :c:func:`Py_PreInitialize` and the :c:type:`PyPreConfig` structure.
pt_br: Python pode ser inicializado com :c:func:`Py_InitializeFromConfig` e a estrutura :c:type:`PyConfig`. Pode ser pré-inicializado com :c:func:`Py_PreInitialize` e a estrutura :c:type:`PyPreConfig`.

source: There are two kinds of configuration:
pt_br: Existem dois tipos de configuração:

source: The :ref:`Python Configuration <init-python-config>` can be used to build a customized Python which behaves as the regular Python. For example, environment variables and command line arguments are used to configure Python.
pt_br: A :ref:`Python Configuration <init-python-config>` pode ser usada para construir um Python personalizado que se comporta como um Python comum. Por exemplo, variáveis de ambiente e argumento de linha de comando são usados para configurar Python.

source: The :ref:`Isolated Configuration <init-isolated-conf>` can be used to embed Python into an application. It isolates Python from the system. For example, environment variables are ignored, the LC_CTYPE locale is left unchanged and no signal handler is registered.
pt_br: A :ref:`Configuração isolada <init-isolated-conf>` pode ser usada para incorporar Python em uma aplicação. Isso isola Python de um sistema. Por exemplo, variáveis de ambiente são ignoradas, a variável local LC_CTYPE fica inalterada e nenhum manipulador de sinal é registrado.

source: The :c:func:`Py_RunMain` function can be used to write a customized Python program.
pt_br: A função :c:func:`Py_RunMain` pode ser usada para escrever um programa Python personalizado.

source: See also :ref:`Initialization, Finalization, and Threads <initialization>`.
pt_br: Veja também :ref:`Inicialização, Finalização e Threads <initialization>`.

source: :pep:`587` "Python Initialization Configuration".
pt_br: :pep:`587` "Configuração da inicialização do Python".

source: Example
pt_br: Exemplo

source: Example of customized Python always running in isolated mode::
pt_br: Exemplo de Python personalizado sendo executado sempre em um modo isolado:

source: List of ``wchar_t*`` strings.
pt_br: Lista de strings ``wchar_t*``.

source: If *length* is non-zero, *items* must be non-``NULL`` and all strings must be non-``NULL``.
pt_br: Se *length* é diferente de zero, *items* deve ser diferente de ``NULL`` e todas as strings devem ser diferentes de ``NULL``.

source: Methods:
pt_br: Métodos:

source: Append *item* to *list*.
pt_br: Anexa *item* a *list*.

source: Python must be preinitialized to call this function.
pt_br: Python deve ser inicializado previamente antes de chamar essa função.

source: Insert *item* into *list* at *index*.
pt_br: Insere *item* na *list* na posição *index*.

source: If *index* is greater than or equal to *list* length, append *item* to *list*.
pt_br: Se *index* for maior ou igual ao comprimento da *list*, anexa o *item* a *list*.

source: *index* must be greater than or equal to ``0``.
pt_br: *index* deve ser maior que ou igual a ``0``.

source: Structure fields:
pt_br: Campos de estrutura:

source: List length.
pt_br: Comprimento da lista.

source: List items.
pt_br: Itens da lista.

source: Structure to store an initialization function status: success, error or exit.
pt_br: Estrutura para armazenar o status de uma função de inicialização: sucesso, erro ou saída.

source: For an error, it can store the C function name which created the error.
pt_br: Para um erro, ela pode armazenar o nome da função C que criou o erro.

source: Exit code. Argument passed to ``exit()``.
pt_br: Código de saída. Argumento passado para ``exit()``.

source: Error message.
pt_br: Mensagem de erro.

source: Name of the function which created an error, can be ``NULL``.
pt_br: Nome da função que criou um erro. Pode ser ``NULL``.

source: Functions to create a status:
pt_br: Funções para criar um status:

source: Success.
pt_br: Sucesso.

source: Initialization error with a message.
pt_br: Erro de inicialização com uma mensagem.

source: *err_msg* must not be ``NULL``.
pt_br: *err_msg* não deve ser ``NULL``.

source: Memory allocation failure (out of memory).
pt_br: Falha de alocação de memória (sem memória).

source: Exit Python with the specified exit code.
pt_br: Sai do Python com o código de saída especificado.

source: Functions to handle a status:
pt_br: Funções para manipular um status:

source: Is the status an error or an exit? If true, the exception must be handled; by calling :c:func:`Py_ExitStatusException` for example.
pt_br: O status é um erro ou uma saída? Se verdadeiro, a exceção deve ser tratada; chamando :c:func:`Py_ExitStatusException`, por exemplo.

source: Is the result an error?
pt_br: O resultado é um erro?

source: Is the result an exit?
pt_br: O resultado é uma saída?

source: Call ``exit(exitcode)`` if *status* is an exit. Print the error message and exit with a non-zero exit code if *status* is an error. Must only be called if ``PyStatus_Exception(status)`` is non-zero.
pt_br: Chama ``exit(exitcode)`` se *status* for uma saída. Exibe a mensagem de erro e sai com um código de saída diferente de zero se *status* for um erro. Deve ser chamado apenas se ``PyStatus_Exception(status)`` for diferente de zero.

source: Internally, Python uses macros which set ``PyStatus.func``, whereas functions to create a status set ``func`` to ``NULL``.
pt_br: Internamente, Python usa macros que definem ``PyStatus.func``, enquanto funções para criar um status definem ``func`` para ``NULL``.

source: Example::
pt_br: Exemplo::

source: Structure used to preinitialize Python.
pt_br: Estrutura usada para pré-inicializar o Python.

source: Function to initialize a preconfiguration:
pt_br: A função para inicializar uma pré-configuração:

source: Initialize the preconfiguration with :ref:`Python Configuration <init-python-config>`.
pt_br: Inicializa a pré-configuração com :ref:`Configuração do Python <init-python-config>`.

source: Initialize the preconfiguration with :ref:`Isolated Configuration <init-isolated-conf>`.
pt_br: Inicializa a pré-configuração com :ref:`Configuração isolada <init-isolated-conf>`.

source: Name of the Python memory allocators:
pt_br: Nome de alocadores de memória em Python:

source: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): don't change memory allocators (use defaults).
pt_br: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): não altera os alocadores de memória (usa o padrão).

source: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:`default memory allocators <default-memory-allocators>`.
pt_br: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:`alocadores de memória padrão <default-memory-allocators>`.

source: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`default memory allocators <default-memory-allocators>` with :ref:`debug hooks <pymem-debug-hooks>`.
pt_br: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`alocadores de memória padrão <default-memory-allocators>` com :ref:`ganchos de depuração <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): use ``malloc()`` of the C library.
pt_br: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): usa ``malloc()`` da biblioteca C.

source: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): force usage of ``malloc()`` with :ref:`debug hooks <pymem-debug-hooks>`.
pt_br: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): força uso de ``malloc()`` com :ref:`ganchos de depuração <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`Python pymalloc memory allocator <pymalloc>`.
pt_br: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`alocador de memória do Python pymalloc <pymalloc>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Python pymalloc memory allocator <pymalloc>` with :ref:`debug hooks <pymem-debug-hooks>`.
pt_br: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`alocador de memória deo Python pymalloc <pymalloc>` com :ref:`ganchos de depuração <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` and ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-pymalloc <--without-pymalloc>`.
pt_br: ``PYMEM_ALLOCATOR_PYMALLOC`` e ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` não são suportados se o Python estiver :option:`configurado usando --without-pymalloc <--without-pymalloc>`.

source: See :ref:`Memory Management <memory>`.
pt_br: Veja :ref:`Gerenciamento de memória <memory>`.

source: Default: ``PYMEM_ALLOCATOR_NOT_SET``.
pt_br: Padrão: ``PYMEM_ALLOCATOR_NOT_SET``.

source: Set the LC_CTYPE locale to the user preferred locale.
pt_br: Define a localidade LC_CTYPE para a localidade preferida do usuário.

source: If equals to ``0``, set :c:member:`~PyPreConfig.coerce_c_locale` and :c:member:`~PyPreConfig.coerce_c_locale_warn` members to ``0``.
pt_br: Se igual a ``0``, define os membros :c:member:`~PyPreConfig.coerce_c_locale` e :c:member:`~PyPreConfig.coerce_c_locale_warn` para ``0``.

source: See the :term:`locale encoding`.
pt_br: Veja a :term:`codificação da localidade`.

source: Default: ``1`` in Python config, ``0`` in isolated config.
pt_br: Padrão: ``1`` na configuração do Python, ``0`` na configuração isolada.

source: If equals to ``2``, coerce the C locale.
pt_br: Se igual a ``2``, força a localidade para C.

source: If equals to ``1``, read the LC_CTYPE locale to decide if it should be coerced.
pt_br: Se for igual a ``1``, lê a localidade LC_CTYPE para decidir se deve ser forçado.

source: Default: ``-1`` in Python config, ``0`` in isolated config.
pt_br: Padrão: ``-1`` na configuração do Python, ``0`` na configuração isolada.

source: If non-zero, emit a warning if the C locale is coerced.
pt_br: Se diferente de zero, emite um aviso se a localidade C for forçada.

source: :ref:`Python Development Mode <devmode>`: see :c:member:`PyConfig.dev_mode`.
pt_br: :ref:`Modo de desenvolvimento do Python <devmode>`: veja :c:member:`PyConfig.dev_mode`.

source: Default: ``-1`` in Python mode, ``0`` in isolated mode.
pt_br: Padrão: ``-1`` no modo do Python, ``0`` no modo isolado.

source: Isolated mode: see :c:member:`PyConfig.isolated`.
pt_br: Modo isolado: veja :c:member:`PyConfig.isolated`.

source: Default: ``0`` in Python mode, ``1`` in isolated mode.
pt_br: Padrão: ``0`` no modo do Python, ``1`` no modo isolado.

source: If non-zero:
pt_br: Se não zero:

source: Set :c:member:`PyPreConfig.utf8_mode` to ``0``,
pt_br: Define :c:member:`PyPreConfig.utf8_mode` para ``0``,

source: Set :c:member:`PyConfig.filesystem_encoding` to ``"mbcs"``,
pt_br: Define :c:member:`PyConfig.filesystem_encoding` para ``"mbcs"``,

source: Set :c:member:`PyConfig.filesystem_errors` to ``"replace"``.
pt_br: Define :c:member:`PyConfig.filesystem_errors` para ``"replace"``.

source: Initialized the from :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable value.
pt_br: Inicializado a partir do valor da variável de ambiente :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.

source: Only available on Windows. ``#ifdef MS_WINDOWS`` macro can be used for Windows specific code.
pt_br: Disponível apenas no Windows. A macro ``#ifdef MS_WINDOWS`` pode ser usada para código específico do Windows.

source: Default: ``0``.
pt_br: Padrão: ``0``.

source: If non-zero, :c:func:`Py_PreInitializeFromArgs` and :c:func:`Py_PreInitializeFromBytesArgs` parse their ``argv`` argument the same way the regular Python parses command line arguments: see :ref:`Command Line Arguments <using-on-cmdline>`.
pt_br: Se diferente de zero, :c:func:`Py_PreInitializeFromArgs` e :c:func:`Py_PreInitializeFromBytesArgs` analisam seu argumento ``argv`` da mesma forma que o Python regular analisa argumentos de linha de comando: veja :ref:`Argumentos de linha de comando <using-on-cmdline>`.

source: Use :ref:`environment variables <using-on-envvars>`? See :c:member:`PyConfig.use_environment`.
pt_br: Usar :ref:`variáveis de ambiente <using-on-envvars>`? Veja :c:member:`PyConfig.use_environment`.

source: Default: ``1`` in Python config and ``0`` in isolated config.
pt_br: Padrão: ``1`` na configuração do Python e ``0`` na configuração isolada.

source: If non-zero, enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_br: Se não zero, habilita o :ref:`modo UTF-8 do Python <utf8-mode>`.

source: Set to ``0`` or ``1`` by the :option:`-X utf8 <-X>` command line option and the :envvar:`PYTHONUTF8` environment variable.
pt_br: Define para ``0`` ou ``1`` pela opção de linha de comando :option:`-X utf8 <-X>` e a variável de ambiente :envvar:`PYTHONUTF8`.

source: Also set to ``1`` if the ``LC_CTYPE`` locale is ``C`` or ``POSIX``.
pt_br: Também define como ``1`` se a localidade ``LC_CTYPE`` for ``C`` ou ``POSIX``.

source: Default: ``-1`` in Python config and ``0`` in isolated config.
pt_br: Padrão: ``-1`` na configuração do Python e ``0`` na configuração isolada.

source: Preinitialize Python with PyPreConfig
pt_br: Pré-inicializar Python com PyPreConfig

source: The preinitialization of Python:
pt_br: A pré-inicialização do Python:

source: Set the Python memory allocators (:c:member:`PyPreConfig.allocator`)
pt_br: Define os alocadores de memória Python (:c:member:`PyPreConfig.allocator`)

source: Configure the LC_CTYPE locale (:term:`locale encoding`)
pt_br: Configura a localidade LC_CTYPE (:term:`codificação da localidade`)

source: Set the :ref:`Python UTF-8 Mode <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)
pt_br: Define o :ref:`Modo UTF-8 do Python <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)

source: The current preconfiguration (``PyPreConfig`` type) is stored in ``_PyRuntime.preconfig``.
pt_br: A pré-configuração atual (tipo ``PyPreConfig``) é armazenada em ``_PyRuntime.preconfig``.

source: Functions to preinitialize Python:
pt_br: Funções para pré-inicializar Python:

source: Preinitialize Python from *preconfig* preconfiguration.
pt_br: Pré-inicializa o Python a partir da pré-configuração *preconfig*.

source: *preconfig* must not be ``NULL``.
pt_br: *preconfig* não pode ser ``NULL``..

source: Parse *argv* command line arguments (bytes strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
pt_br: Analisa argumentos de linha de comando *argv* (strings de bytes) se :c:member:`~PyPreConfig.parse_argv` de *preconfig* for diferente de zero.

source: Parse *argv* command line arguments (wide strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
pt_br: Analisa argumentos de linha de comando *argv* (strings largas) se :c:member:`~PyPreConfig.parse_argv` de *preconfig* for diferente de zero.

source: The caller is responsible to handle exceptions (error or exit) using :c:func:`PyStatus_Exception` and :c:func:`Py_ExitStatusException`.
pt_br: O chamador é responsável por manipular exceções (erro ou saída) usando :c:func:`PyStatus_Exception` e :c:func:`Py_ExitStatusException`.

source: For :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), if Python is initialized with command line arguments, the command line arguments must also be passed to preinitialize Python, since they have an effect on the pre-configuration like encodings. For example, the :option:`-X utf8 <-X>` command line option enables the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_br: Para :ref:`configuração do Python <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), se o Python for inicializado com argumentos de linha de comando, os argumentos de linha de comando também devem ser passados para pré-inicializar o Python, pois eles têm um efeito na pré-configuração como codificações. Por exemplo, a opção de linha de comando :option:`-X utf8 <-X>` habilita o :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: ``PyMem_SetAllocator()`` can be called after :c:func:`Py_PreInitialize` and before :c:func:`Py_InitializeFromConfig` to install a custom memory allocator. It can be called before :c:func:`Py_PreInitialize` if :c:member:`PyPreConfig.allocator` is set to ``PYMEM_ALLOCATOR_NOT_SET``.
pt_br: ``PyMem_SetAllocator()`` pode ser chamado depois de :c:func:`Py_PreInitialize` e antes de :c:func:`Py_InitializeFromConfig` para instalar um alocador de memória personalizado. Ele pode ser chamado antes de :c:func:`Py_PreInitialize` se :c:member:`PyPreConfig.allocator` estiver definido como ``PYMEM_ALLOCATOR_NOT_SET``.

source: Python memory allocation functions like :c:func:`PyMem_RawMalloc` must not be used before the Python preinitialization, whereas calling directly ``malloc()`` and ``free()`` is always safe. :c:func:`Py_DecodeLocale` must not be called before the Python preinitialization.
pt_br: Funções de alocação de memória do Python como :c:func:`PyMem_RawMalloc` não devem ser usadas antes da pré-inicialização do Python, enquanto chamar diretamente ``malloc()`` e ``free()`` é sempre seguro. :c:func:`Py_DecodeLocale` não deve ser chamado antes da pré-inicialização do Python.

source: Example using the preinitialization to enable the :ref:`Python UTF-8 Mode <utf8-mode>`::
pt_br: Exemplo usando a pré-inicialização para habilitar o :ref:`modo UTF-8 do Python <utf8-mode>`.

source: Structure containing most parameters to configure Python.
pt_br: Estrutura contendo a maioria dos parâmetros para configurar o Python.

source: When done, the :c:func:`PyConfig_Clear` function must be used to release the configuration memory.
pt_br: Ao terminar, a função :c:func:`PyConfig_Clear` deve ser usada para liberar a memória de configuração.

source: Structure methods:
pt_br: Методи будови:

source: Initialize configuration with the :ref:`Python Configuration <init-python-config>`.
pt_br: Ініціалізуйте конфігурацію за допомогою :ref:`Налаштування Python <init-python-config>`.

source: Initialize configuration with the :ref:`Isolated Configuration <init-isolated-conf>`.
pt_br: Ініціалізуйте конфігурацію за допомогою :ref:`ізольованої конфігурації <init-isolated-conf>`.

source: Copy the wide character string *str* into ``*config_str``.
pt_br: Скопіюйте широкий символьний рядок *str* у ``*config_str``.

source: :ref:`Preinitialize Python <c-preinit>` if needed.
pt_br: :ref:`Попередньо ініціалізуйте Python <c-preinit>`, якщо потрібно.

source: Decode *str* using :c:func:`Py_DecodeLocale` and set the result into ``*config_str``.
pt_br: Декодуйте *str* за допомогою :c:func:`Py_DecodeLocale` і встановіть результат у ``*config_str``.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of wide character strings.
pt_br: Установіть аргументи командного рядка (:c:member:`~PyConfig.argv` член *config*) зі списку *argv* рядків широких символів.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of bytes strings. Decode bytes using :c:func:`Py_DecodeLocale`.
pt_br: Установіть аргументи командного рядка (:c:member:`~PyConfig.argv` член *config*) зі списку *argv* рядків байтів. Декодуйте байти за допомогою :c:func:`Py_DecodeLocale`.

source: Set the list of wide strings *list* to *length* and *items*.
pt_br: Установіть для списку широких рядків *list* значення *length* і *items*.

source: Read all Python configuration.
pt_br: Прочитайте всю конфігурацію Python.

source: Fields which are already initialized are left unchanged.
pt_br: Поля, які вже ініціалізовані, залишаються без змін.

source: Fields for :ref:`path configuration <init-path-config>` are no longer calculated or modified when calling this function, as of Python 3.11.
pt_br: Поля для :ref:`path Configuration <init-path-config>` больше не вычисляются и не изменяются при вызове этой функции, начиная с Python 3.11.

source: The :c:member:`PyConfig.argv` arguments are now only parsed once, :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed, and arguments are only parsed if :c:member:`PyConfig.parse_argv` equals ``1``.
pt_br: Аргументи :c:member:`PyConfig.argv` тепер аналізуються лише один раз, :c:member:`PyConfig.parse_argv` встановлюється на ``2`` після аналізу аргументів, і аргументи аналізуються, лише якщо :c:member:`PyConfig.parse_argv` дорівнює ``1``.

source: :c:func:`PyConfig_Read` no longer calculates all paths, and so fields listed under :ref:`Python Path Configuration <init-path-config>` may no longer be updated until :c:func:`Py_InitializeFromConfig` is called.
pt_br: :c:func:`PyConfig_Read` больше не вычисляет все пути, поэтому поля, перечисленные в :ref:`Python Path Configuration <init-path-config>`, больше не могут обновляться до тех пор, пока не будет вызвана :c:func:`Py_InitializeFromConfig` .

source: Release configuration memory.
pt_br: Звільніть конфігураційну пам'ять.

source: Most ``PyConfig`` methods :ref:`preinitialize Python <c-preinit>` if needed. In that case, the Python preinitialization configuration (:c:type:`PyPreConfig`) in based on the :c:type:`PyConfig`. If configuration fields which are in common with :c:type:`PyPreConfig` are tuned, they must be set before calling a :c:type:`PyConfig` method:
pt_br: Більшість методів ``PyConfig`` :ref:`за необхідності попередньо ініціалізують Python <c-preinit>`. У цьому випадку конфігурація попередньої ініціалізації Python (:c:type:`PyPreConfig`) базується на :c:type:`PyConfig`. Якщо поля конфігурації, які є спільними з :c:type:`PyPreConfig`, налаштовано, їх потрібно встановити перед викликом методу :c:type:`PyConfig`:

source: Moreover, if :c:func:`PyConfig_SetArgv` or :c:func:`PyConfig_SetBytesArgv` is used, this method must be called before other methods, since the preinitialization configuration depends on command line arguments (if :c:member:`~PyConfig.parse_argv` is non-zero).
pt_br: Более того, если используется :c:func:`PyConfig_SetArgv` или :c:func:`PyConfig_SetBytesArgv`, этот метод необходимо вызывать перед другими методами, поскольку конфигурация предварительной инициализации зависит от аргументов командной строки (если :c:member:`~ PyConfig.parse_argv` не равен нулю).

source: The caller of these methods is responsible to handle exceptions (error or exit) using ``PyStatus_Exception()`` and ``Py_ExitStatusException()``.
pt_br: Виклик цих методів відповідає за обробку винятків (помилка або вихід) за допомогою ``PyStatus_Exception()`` і ``Py_ExitStatusException()``.

source: Command line arguments: :data:`sys.argv`.
pt_br: Аргументи командного рядка: :data:`sys.argv`.

source: Set :c:member:`~PyConfig.parse_argv` to ``1`` to parse :c:member:`~PyConfig.argv` the same way the regular Python parses Python command line arguments and then to strip Python arguments from :c:member:`~PyConfig.argv`.
pt_br: Установіть для :c:member:`~PyConfig.parse_argv` значення ``1``, щоб аналізувати :c:member:`~PyConfig.argv` так само, як звичайний Python аналізує аргументи командного рядка Python, а потім видаляти аргументи Python з :c:member:`~PyConfig.argv`.

source: If :c:member:`~PyConfig.argv` is empty, an empty string is added to ensure that :data:`sys.argv` always exists and is never empty.
pt_br: Якщо :c:member:`~PyConfig.argv` порожній, додається порожній рядок, щоб гарантувати, що :data:`sys.argv` завжди існує і ніколи не буде порожнім.

source: Default: ``NULL``.
pt_br: Padrão: ``NULL``.

source: See also the :c:member:`~PyConfig.orig_argv` member.
pt_br: Дивіться також елемент :c:member:`~PyConfig.orig_argv`.

source: If equals to zero, ``Py_RunMain()`` prepends a potentially unsafe path to :data:`sys.path` at startup:
pt_br: Если равно нулю, Py_RunMain() добавляет потенциально небезопасный путь к :data:`sys.path` при запуске:

source: If :c:member:`argv[0] <PyConfig.argv>` is equal to ``L"-m"`` (``python -m module``), prepend the current working directory.
pt_br: Если :c:member:`argv[0] <PyConfig.argv>` равен ``L"-m"`` (``python -m модуль``), добавьте текущий рабочий каталог.
