Repository: python/python-docs-pt-br
Catalog: c-api/init_config.po
Languages: pt_br

source: If running a script (``python script.py``), prepend the script's directory. If it's a symbolic link, resolve symbolic links.
pt_br: Если вы запускаете скрипт (``python script.py``), добавьте каталог скрипта. Если это символическая ссылка, разрешите символические ссылки.

source: Otherwise (``python -c code`` and ``python``), prepend an empty string, which means the current working directory.
pt_br: В противном случае (``python -c code`` и ``python``) добавьте пустую строку, которая означает текущий рабочий каталог.

source: Set to ``1`` by the :option:`-P` command line option and the :envvar:`PYTHONSAFEPATH` environment variable.
pt_br: Устанавливается в ``1`` опцией командной строки :option:`-P` и переменной среды :envvar:`PYTHONSAFEPATH`.

source: Default: ``0`` in Python config, ``1`` in isolated config.
pt_br: По умолчанию: ``0`` в конфигурации Python, ``1`` в изолированной конфигурации.

source: Part of the :ref:`Python Path Configuration <init-path-config>` output.
pt_br: Частина виведення :ref:`Налаштування шляху Python <init-path-config>`.

source: Python base executable: :data:`sys._base_executable`.
pt_br: Базовий виконуваний файл Python: :data:`sys._base_executable`.

source: Set by the :envvar:`__PYVENV_LAUNCHER__` environment variable.
pt_br: Встановлюється змінною середовища :envvar:`__PYVENV_LAUNCHER__`.

source: Set from :c:member:`PyConfig.executable` if ``NULL``.
pt_br: Установити з :c:member:`PyConfig.executable`, якщо ``NULL``.

source: If equals to ``0`` and :c:member:`~PyConfig.configure_c_stdio` is non-zero, disable buffering on the C streams stdout and stderr.
pt_br: Если равно ``0`` и :c:member:`~PyConfig.configure_c_stdio` не равно нулю, отключите буферизацию в потоках C stdout и stderr.

source: Set to ``0`` by the :option:`-u` command line option and the :envvar:`PYTHONUNBUFFERED` environment variable.
pt_br: Устанавливается в ``0`` с помощью опции командной строки :option:`-u` и переменной среды :envvar:`PYTHONUNBUFFERED`.

source: stdin is always opened in buffered mode.
pt_br: stdin завжди відкривається в режимі буферизації.

source: Default: ``1``.
pt_br: Padrão: ``1``.

source: If equals to ``1``, issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str`, or comparing :class:`bytes` with :class:`int`.
pt_br: Если равно ``1``, выдать предупреждение при сравнении :class:`bytes` или :class:`bytearray` с :class:`str` или при сравнении :class:`bytes` с :class:`int` .

source: If equal or greater to ``2``, raise a :exc:`BytesWarning` exception in these cases.
pt_br: Если оно равно или больше ``2``, в этих случаях вызовите исключение :exc:`BytesWarning`.

source: Incremented by the :option:`-b` command line option.
pt_br: Збільшується параметром командного рядка :option:`-b`.

source: If non-zero, emit a :exc:`EncodingWarning` warning when :class:`io.TextIOWrapper` uses its default encoding. See :ref:`io-encoding-warning` for details.
pt_br: Якщо не нуль, видавати попередження :exc:`EncodingWarning`, коли :class:`io.TextIOWrapper` використовує кодування за замовчуванням. Дивіться :ref:`io-encoding-warning` для деталей.

source: If equals to ``0``, disables the inclusion of the end line and column mappings in code objects. Also disables traceback printing carets to specific error locations.
pt_br: Если равно «0», отключает включение сопоставлений конечной строки и столбца в объекты кода. Также отключает обратную печать курсоров для определенных мест ошибок.

source: Set to ``0`` by the :envvar:`PYTHONNODEBUGRANGES` environment variable and by the :option:`-X no_debug_ranges <-X>` command line option.
pt_br: Устанавливается в ``0`` переменной среды :envvar:`PYTHONNODEBUGRANGES` и параметром командной строки :option:`-X no_debug_ranges <-X>`.

source: Control the validation behavior of hash-based ``.pyc`` files: value of the :option:`--check-hash-based-pycs` command line option.
pt_br: Керуйте поведінкою перевірки файлів ``.pyc`` на основі хешу: значення параметра командного рядка :option:`--check-hash-based-pycs`.

source: Valid values:
pt_br: Valores válidos:

source: ``L"always"``: Hash the source file for invalidation regardless of value of the 'check_source' flag.
pt_br: ``L"always"``: хеш вихідного файлу для визнання недійсним незалежно від значення позначки 'check_source'.

source: ``L"never"``: Assume that hash-based pycs always are valid.
pt_br: ``L"never"``: припустимо, що pics на основі хешу завжди дійсні.

source: ``L"default"``: The 'check_source' flag in hash-based pycs determines invalidation.
pt_br: ``L"default"``: прапор 'check_source' у pycs на основі хешу визначає недійсність.

source: Default: ``L"default"``.
pt_br: Domyślny: ``L"default"``.

source: See also :pep:`552` "Deterministic pycs".
pt_br: Дивіться також :pep:`552` "Детерміновані фото".

source: If non-zero, configure C standard streams:
pt_br: Якщо не нуль, налаштуйте стандартні потоки C:

source: On Windows, set the binary mode (``O_BINARY``) on stdin, stdout and stderr.
pt_br: У Windows установіть бінарний режим (``O_BINARY``) для stdin, stdout і stderr.

source: If :c:member:`~PyConfig.buffered_stdio` equals zero, disable buffering of stdin, stdout and stderr streams.
pt_br: Якщо :c:member:`~PyConfig.buffered_stdio` дорівнює нулю, вимкніть буферизацію потоків stdin, stdout і stderr.

source: If :c:member:`~PyConfig.interactive` is non-zero, enable stream buffering on stdin and stdout (only stdout on Windows).
pt_br: Якщо :c:member:`~PyConfig.interactive` не дорівнює нулю, увімкніть буферизацію потоку на stdin і stdout (лише stdout у Windows).

source: If non-zero, enable the :ref:`Python Development Mode <devmode>`.
pt_br: Якщо не нуль, увімкніть :ref:`Режим розробки Python <devmode>`.

source: Set to ``1`` by the :option:`-X dev <-X>` option and the :envvar:`PYTHONDEVMODE` environment variable.
pt_br: Устанавливается в ``1`` опцией :option:`-X dev <-X>` и переменной среды :envvar:`PYTHONDEVMODE`.

source: Dump Python references?
pt_br: Скинути посилання на Python?

source: If non-zero, dump all objects which are still alive at exit.
pt_br: Якщо значення відмінне від нуля, скинути всі об’єкти, які ще живі при виході.

source: Set to ``1`` by the :envvar:`PYTHONDUMPREFS` environment variable.
pt_br: Установіть значення ``1`` за допомогою змінної середовища :envvar:`PYTHONDUMPREFS`.

source: Need a special build of Python with the ``Py_TRACE_REFS`` macro defined: see the :option:`configure --with-trace-refs option <--with-trace-refs>`.
pt_br: Потрібна спеціальна збірка Python із визначеним макросом ``Py_TRACE_REFS``: перегляньте параметр :option:`configure --with-trace-refs <--with-trace-refs>`.

source: The site-specific directory prefix where the platform-dependent Python files are installed: :data:`sys.exec_prefix`.
pt_br: Префікс каталогу сайту, де встановлено файли Python, залежні від платформи: :data:`sys.exec_prefix`.

source: The absolute path of the executable binary for the Python interpreter: :data:`sys.executable`.
pt_br: Абсолютний шлях виконуваного двійкового файлу для інтерпретатора Python: :data:`sys.executable`.

source: Enable faulthandler?
pt_br: Увімкнути обробник помилок?

source: If non-zero, call :func:`faulthandler.enable` at startup.
pt_br: Якщо не нуль, викликати :func:`faulthandler.enable` під час запуску.

source: Set to ``1`` by :option:`-X faulthandler <-X>` and the :envvar:`PYTHONFAULTHANDLER` environment variable.
pt_br: Установіть значення ``1`` за допомогою :option:`-X faulthandler <-X>` і змінної середовища :envvar:`PYTHONFAULTHANDLER`.

source: :term:`Filesystem encoding <filesystem encoding and error handler>`: :func:`sys.getfilesystemencoding`.
pt_br: :term:`Кодування файлової системи <filesystem encoding and error handler>`: :func:`sys.getfilesystemencoding`.

source: On macOS, Android and VxWorks: use ``"utf-8"`` by default.
pt_br: У macOS, Android і VxWorks: використовуйте ``"utf-8"`` за умовчанням.

source: On Windows: use ``"utf-8"`` by default, or ``"mbcs"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
pt_br: У Windows: використовуйте ``"utf-8"`` за замовчуванням або ``"mbcs"``, якщо :c:member:`~PyPreConfig.legacy_windows_fs_encoding` :c:type:`PyPreConfig` не дорівнює нулю.

source: Default encoding on other platforms:
pt_br: Стандартне кодування на інших платформах:

source: ``"utf-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
pt_br: ``"utf-8"``, якщо :c:member:`PyPreConfig.utf8_mode` не нульовий.

source: ``"ascii"`` if Python detects that ``nl_langinfo(CODESET)`` announces the ASCII encoding, whereas the ``mbstowcs()`` function decodes from a different encoding (usually Latin1).
pt_br: ``"ascii"``, якщо Python виявляє, що ``nl_langinfo(CODESET)`` повідомляє про кодування ASCII, тоді як функція ``mbstowcs()`` декодує з іншого кодування (зазвичай Latin1).

source: ``"utf-8"`` if ``nl_langinfo(CODESET)`` returns an empty string.
pt_br: ``"utf-8"``, якщо ``nl_langinfo(CODESET)`` повертає порожній рядок.

source: Otherwise, use the :term:`locale encoding`: ``nl_langinfo(CODESET)`` result.
pt_br: В іншому випадку використовуйте результат :term:`locale encoding`: ``nl_langinfo(CODESET)``.

source: At Python startup, the encoding name is normalized to the Python codec name. For example, ``"ANSI_X3.4-1968"`` is replaced with ``"ascii"``.
pt_br: Під час запуску Python назва кодування нормалізується до назви кодека Python. Наприклад, ``"ANSI_X3.4-1968"`` замінюється на ``"ascii"``.

source: See also the :c:member:`~PyConfig.filesystem_errors` member.
pt_br: Дивіться також елемент :c:member:`~PyConfig.filesystem_errors`.

source: :term:`Filesystem error handler <filesystem encoding and error handler>`: :func:`sys.getfilesystemencodeerrors`.
pt_br: :term:`Обробник помилок файлової системи <filesystem encoding and error handler>`: :func:`sys.getfilesystemencodeerrors`.

source: On Windows: use ``"surrogatepass"`` by default, or ``"replace"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
pt_br: У Windows: використовуйте ``"surrogatepass"`` за замовчуванням або ``"replace"``, якщо :c:member:`~PyPreConfig.legacy_windows_fs_encoding` :c:type:`PyPreConfig` не дорівнює нулю.

source: On other platforms: use ``"surrogateescape"`` by default.
pt_br: На інших платформах: використовуйте ``"surrogateescape"`` за умовчанням.

source: Supported error handlers:
pt_br: Підтримувані засоби обробки помилок:

source: ``"surrogatepass"`` (only supported with the UTF-8 encoding)
pt_br: ``"surrogatepass"`` (підтримується лише з кодуванням UTF-8)

source: See also the :c:member:`~PyConfig.filesystem_encoding` member.
pt_br: Дивіться також елемент :c:member:`~PyConfig.filesystem_encoding`.

source: Randomized hash function seed.
pt_br: Рандомізоване початкове значення хеш-функції.

source: If :c:member:`~PyConfig.use_hash_seed` is zero, a seed is chosen randomly at Python startup, and :c:member:`~PyConfig.hash_seed` is ignored.
pt_br: Якщо :c:member:`~PyConfig.use_hash_seed` дорівнює нулю, початкове значення вибирається випадковим чином під час запуску Python, а :c:member:`~PyConfig.hash_seed` ігнорується.

source: Set by the :envvar:`PYTHONHASHSEED` environment variable.
pt_br: Встановлюється змінною середовища :envvar:`PYTHONHASHSEED`.

source: Default *use_hash_seed* value: ``-1`` in Python mode, ``0`` in isolated mode.
pt_br: Значення *use_hash_seed* за замовчуванням: ``-1`` у режимі Python, ``0`` в ізольованому режимі.

source: Python home directory.
pt_br: Домашній каталог Python.

source: If :c:func:`Py_SetPythonHome` has been called, use its argument if it is not ``NULL``.
pt_br: Якщо було викликано :c:func:`Py_SetPythonHome`, використовуйте його аргумент, якщо він не ``NULL``.

source: Set by the :envvar:`PYTHONHOME` environment variable.
pt_br: Встановлюється змінною середовища :envvar:`PYTHONHOME`.

source: Part of the :ref:`Python Path Configuration <init-path-config>` input.
pt_br: Частина вхідних даних :ref:`Налаштування шляху Python <init-path-config>`.

source: If non-zero, profile import time.
pt_br: Якщо не нуль, час імпорту профілю.

source: Set the ``1`` by the :option:`-X importtime <-X>` option and the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable.
pt_br: Установіть ``1`` за допомогою параметра :option:`-X importtime <-X>` і змінної середовища :envvar:`PYTHONPROFILEIMPORTTIME`.

source: Enter interactive mode after executing a script or a command.
pt_br: Увійти в інтерактивний режим після виконання сценарію або команди.

source: If greater than ``0``, enable inspect: when a script is passed as first argument or the -c option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal.
pt_br: Если больше ``0``, включите проверку: когда сценарий передается в качестве первого аргумента или используется опция -c, войдите в интерактивный режим после выполнения сценария или команды, даже если :data:`sys.stdin` выполняет не похоже на терминал.

source: Incremented by the :option:`-i` command line option. Set to ``1`` if the :envvar:`PYTHONINSPECT` environment variable is non-empty.
pt_br: Збільшується параметром командного рядка :option:`-i`. Установіть значення ``1``, якщо змінна середовища :envvar:`PYTHONINSPECT` не порожня.

source: Install Python signal handlers?
pt_br: Установити обробники сигналів Python?

source: Default: ``1`` in Python mode, ``0`` in isolated mode.
pt_br: Типове значення: ``1`` в режимі Python, ``0`` в ізольованому режимі.

source: If greater than ``0``, enable the interactive mode (REPL).
pt_br: Если больше ``0``, включите интерактивный режим (REPL).

source: Incremented by the :option:`-i` command line option.
pt_br: Збільшується параметром командного рядка :option:`-i`.

source: If greater than ``0``, enable isolated mode:
pt_br: Если больше «0», включите изолированный режим:

source: Set :c:member:`~PyConfig.use_environment` to ``0``.
pt_br: Установите для :c:member:`~PyConfig.use_environment` значение ``0``.

source: Set :c:member:`~PyConfig.user_site_directory` to ``0``: don't add the user site directory to :data:`sys.path`.
pt_br: Установите для :c:member:`~PyConfig.user_site_directory` значение ``0``: не добавляйте каталог сайта пользователя в :data:`sys.path`.

source: Python REPL doesn't import :mod:`readline` nor enable default readline configuration on interactive prompts.
pt_br: Python REPL не імпортує :mod:`readline` і не вмикає стандартну конфігурацію readline в інтерактивних підказках.

source: Set to ``1`` by the :option:`-I` command line option.
pt_br: Устанавливается в ``1`` опцией командной строки :option:`-I`.

source: See also :c:member:`PyPreConfig.isolated`.
pt_br: Veja também :c:member:`PyPreConfig.isolated`.

source: If non-zero, use :class:`io.FileIO` instead of :class:`!io._WindowsConsoleIO` for :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr`.
pt_br: Если ненулевое значение, используйте :class:`io.FileIO` вместо :class:`!io._WindowsConsoleIO` для :data:`sys.stdin`, :data:`sys.stdout` и :data:`sys. stderr`.

source: Set to ``1`` if the :envvar:`PYTHONLEGACYWINDOWSSTDIO` environment variable is set to a non-empty string.
pt_br: Definida como ``1`` se a variável de ambiente :envvar:`PYTHONLEGACYWINDOWSSTDIO` estiver definida como uma string não vazia.

source: See also the :pep:`528` (Change Windows console encoding to UTF-8).
pt_br: Дивіться також :pep:`528` (Змінити кодування консолі Windows на UTF-8).

source: If non-zero, dump statistics on :ref:`Python pymalloc memory allocator <pymalloc>` at exit.
pt_br: Якщо значення відмінне від нуля, вивести статистику на :ref:`Python pymalloc memory allocator <pymalloc>` при виході.

source: Set to ``1`` by the :envvar:`PYTHONMALLOCSTATS` environment variable.
pt_br: Установіть значення ``1`` за допомогою змінної середовища :envvar:`PYTHONMALLOCSTATS`.

source: The option is ignored if Python is :option:`configured using the --without-pymalloc option <--without-pymalloc>`.
pt_br: Параметр ігнорується, якщо Python :option:`налаштовано за допомогою параметра --without-pymalloc <--without-pymalloc>`.

source: Platform library directory name: :data:`sys.platlibdir`.
pt_br: Назва каталогу бібліотеки платформи: :data:`sys.platlibdir`.

source: Set by the :envvar:`PYTHONPLATLIBDIR` environment variable.
pt_br: Встановлюється змінною середовища :envvar:`PYTHONPLATLIBDIR`.

source: Default: value of the ``PLATLIBDIR`` macro which is set by the :option:`configure --with-platlibdir option <--with-platlibdir>` (default: ``"lib"``, or ``"DLLs"`` on Windows).
pt_br: По умолчанию: значение макроса ``PLATLIBDIR``, которое задается опцией :option:`configure --with-platlibdir <--with-platlibdir>` (по умолчанию: ``"lib"`` или ``" DLL"`` в Windows).

source: This macro is now used on Windows to locate the standard library extension modules, typically under ``DLLs``. However, for compatibility, note that this value is ignored for any non-standard layouts, including in-tree builds and virtual environments.
pt_br: Этот макрос теперь используется в Windows для поиска модулей расширения стандартной библиотеки, обычно в разделе «DLL». Однако в целях совместимости обратите внимание, что это значение игнорируется для любых нестандартных макетов, включая сборки в дереве и виртуальные среды.

source: Module search paths (:data:`sys.path`) as a string separated by ``DELIM`` (:data:`os.pathsep`).
pt_br: Пути поиска модулей (:data:`sys.path`) в виде строки, разделенной ``DELIM`` (:data:`os.pathsep`).

source: Set by the :envvar:`PYTHONPATH` environment variable.
pt_br: Встановлюється змінною середовища :envvar:`PYTHONPATH`.

source: Module search paths: :data:`sys.path`.
pt_br: Шляхи пошуку модуля: :data:`sys.path`.

source: If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:func:`Py_InitializeFromConfig` will replace :c:member:`~PyConfig.module_search_paths` and sets :c:member:`~PyConfig.module_search_paths_set` to ``1``.
pt_br: Если :c:member:`~PyConfig.module_search_paths_set` равен ``0``, :c:func:`Py_InitializeFromConfig` заменит :c:member:`~PyConfig.module_search_paths` и установит :c:member:` ~PyConfig.module_search_paths_set для ``1``.

source: Default: empty list (``module_search_paths``) and ``0`` (``module_search_paths_set``).
pt_br: За замовчуванням: порожній список (``module_search_paths``) і ``0`` (``module_search_paths_set``).

source: Compilation optimization level:
pt_br: Рівень оптимізації компіляції:

source: ``0``: Peephole optimizer, set ``__debug__`` to ``True``.
pt_br: ``0``: оптимізатор Peephole, встановіть ``__debug__`` на ``True``.

source: ``1``: Level 0, remove assertions, set ``__debug__`` to ``False``.
pt_br: ``1``: Рівень 0, видалити твердження, встановити ``__debug__`` на ``False``.

source: ``2``: Level 1, strip docstrings.
pt_br: ``2``: Рівень 1, рядки документації.

source: Incremented by the :option:`-O` command line option. Set to the :envvar:`PYTHONOPTIMIZE` environment variable value.
pt_br: Збільшується параметром командного рядка :option:`-O`. Установіть значення змінної середовища :envvar:`PYTHONOPTIMIZE`.

source: The list of the original command line arguments passed to the Python executable: :data:`sys.orig_argv`.
pt_br: Список вихідних аргументів командного рядка, переданих у виконуваний файл Python: :data:`sys.orig_argv`.

source: If :c:member:`~PyConfig.orig_argv` list is empty and :c:member:`~PyConfig.argv` is not a list only containing an empty string, :c:func:`PyConfig_Read` copies :c:member:`~PyConfig.argv` into :c:member:`~PyConfig.orig_argv` before modifying :c:member:`~PyConfig.argv` (if :c:member:`~PyConfig.parse_argv` is non-zero).
pt_br: Якщо список :c:member:`~PyConfig.orig_argv` порожній і :c:member:`~PyConfig.argv` не є списком, який містить лише порожній рядок, :c:func:`PyConfig_Read` копіює :c:member:`~PyConfig.argv` в :c:member:`~PyConfig.orig_argv` перед зміною :c:member:`~PyConfig.argv` (якщо :c:member:`~PyConfig.parse_argv` не дорівнює нулю) .

source: See also the :c:member:`~PyConfig.argv` member and the :c:func:`Py_GetArgcArgv` function.
pt_br: Дивіться також член :c:member:`~PyConfig.argv` і функцію :c:func:`Py_GetArgcArgv`.

source: Default: empty list.
pt_br: Padrão: lista vazia.

source: Parse command line arguments?
pt_br: Розібрати аргументи командного рядка?

source: If equals to ``1``, parse :c:member:`~PyConfig.argv` the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and strip Python arguments from :c:member:`~PyConfig.argv`.
pt_br: Якщо дорівнює ``1``, аналізувати :c:member:`~PyConfig.argv` так само, як звичайний Python аналізує :ref:`аргументи командного рядка <using-on-cmdline>`, і видаляти аргументи Python з :c:member:`~PyConfig.argv`.

source: The :c:member:`PyConfig.argv` arguments are now only parsed if :c:member:`PyConfig.parse_argv` equals to ``1``.
pt_br: Аргументи :c:member:`PyConfig.argv` тепер аналізуються, лише якщо :c:member:`PyConfig.parse_argv` дорівнює ``1``.

source: Parser debug mode. If greater than ``0``, turn on parser debugging output (for expert only, depending on compilation options).
pt_br: Режим отладки парсера. Если больше ``0``, включите вывод отладки синтаксического анализатора (только для экспертов, в зависимости от параметров компиляции).

source: Incremented by the :option:`-d` command line option. Set to the :envvar:`PYTHONDEBUG` environment variable value.
pt_br: Збільшується параметром командного рядка :option:`-d`. Установіть значення змінної середовища :envvar:`PYTHONDEBUG`.

source: If non-zero, calculation of path configuration is allowed to log warnings into ``stderr``. If equals to ``0``, suppress these warnings.
pt_br: Если значение не равно нулю, разрешен расчет конфигурации пути для регистрации предупреждений в stderr. Если равно ``0``, подавить эти предупреждения.

source: Now also applies on Windows.
pt_br: Теперь также применяется в Windows.

source: The site-specific directory prefix where the platform independent Python files are installed: :data:`sys.prefix`.
pt_br: Префікс каталогу сайту, де встановлено незалежні від платформи файли Python: :data:`sys.prefix`.

source: Program name used to initialize :c:member:`~PyConfig.executable` and in early error messages during Python initialization.
pt_br: Ім’я програми, що використовується для ініціалізації :c:member:`~PyConfig.executable` і в ранніх повідомленнях про помилки під час ініціалізації Python.

source: If :func:`Py_SetProgramName` has been called, use its argument.
pt_br: Якщо було викликано :func:`Py_SetProgramName`, використовуйте його аргумент.

source: On macOS, use :envvar:`PYTHONEXECUTABLE` environment variable if set.
pt_br: У macOS використовуйте змінну середовища :envvar:`PYTHONEXECUTABLE`, якщо встановлено.

source: If the ``WITH_NEXT_FRAMEWORK`` macro is defined, use :envvar:`__PYVENV_LAUNCHER__` environment variable if set.
pt_br: Якщо визначено макрос ``WITH_NEXT_FRAMEWORK``, використовуйте змінну середовища :envvar:`__PYVENV_LAUNCHER__`, якщо встановлено.

source: Use ``argv[0]`` of :c:member:`~PyConfig.argv` if available and non-empty.
pt_br: Використовуйте ``argv[0]`` :c:member:`~PyConfig.argv`, якщо доступний і не є порожнім.

source: Otherwise, use ``L"python"`` on Windows, or ``L"python3"`` on other platforms.
pt_br: В іншому випадку використовуйте ``L"python"`` у Windows або ``L"python3"`` на інших платформах.

source: Directory where cached ``.pyc`` files are written: :data:`sys.pycache_prefix`.
pt_br: Каталог, де записуються кешовані файли ``.pyc``: :data:`sys.pycache_prefix`.

source: Set by the :option:`-X pycache_prefix=PATH <-X>` command line option and the :envvar:`PYTHONPYCACHEPREFIX` environment variable.
pt_br: Встановлюється параметром командного рядка :option:`-X pycache_prefix=PATH <-X>` і змінною середовища :envvar:`PYTHONPYCACHEPREFIX`.
