Repository: python/python-docs-pt-br
Catalog: c-api/init_config.po
Languages: pt_br

source: Finish :mod:`sys` module initialization (ex: create :data:`sys.stdout` and :data:`sys.path`);
pt_br: Завершити ініціалізацію модуля :mod:`sys` (наприклад, створити :data:`sys.stdout` і :data:`sys.path`);

source: Enable optional features like :mod:`faulthandler` and :mod:`tracemalloc`;
pt_br: Увімкнути додаткові функції, такі як :mod:`faulthandler` і :mod:`tracemalloc`;

source: Import the :mod:`site` module;
pt_br: Імпортуйте модуль :mod:`site`;

source: Private provisional API:
pt_br: Приватний тимчасовий API:

source: :c:member:`PyConfig._init_main`: if set to ``0``, :c:func:`Py_InitializeFromConfig` stops at the "Core" initialization phase.
pt_br: :c:member:`PyConfig._init_main`: если установлено значение ``0``, :c:func:`Py_InitializeFromConfig` останавливается на этапе инициализации "Ядро".

source: Move to the "Main" initialization phase, finish the Python initialization.
pt_br: Перейдіть до фази ініціалізації "Main", завершіть ініціалізацію Python.

source: No module is imported during the "Core" phase and the ``importlib`` module is not configured: the :ref:`Path Configuration <init-path-config>` is only applied during the "Main" phase. It may allow to customize Python in Python to override or tune the :ref:`Path Configuration <init-path-config>`, maybe install a custom :data:`sys.meta_path` importer or an import hook, etc.
pt_br: Жоден модуль не імпортується під час фази "Core", а модуль ``importlib`` не налаштовано: :ref:`Конфігурація шляху <init-path-config>` застосовується лише під час фази "Main". Це може дозволити налаштувати Python у Python, щоб перевизначити або налаштувати :ref:`Конфігурацію шляху <init-path-config>`, можливо, встановити спеціальний імпортер :data:`sys.meta_path` або хук імпорту тощо.

source: The "Core" phase is not properly defined: what should be and what should not be available at this phase is not specified yet. The API is marked as private and provisional: the API can be modified or even be removed anytime until a proper public API is designed.
pt_br: Фаза "Core" не визначена належним чином: що має бути, а що не має бути доступним на цій фазі, ще не визначено. API позначено як приватний і тимчасовий: API можна змінити або навіть видалити в будь-який час, доки не буде розроблено відповідний публічний API.

source: Example running Python code between "Core" and "Main" initialization phases::
pt_br: Приклад виконання коду Python між фазами ініціалізації "Core" і "Main"::
