Repository: python/python-docs-pt-br
Catalog: c-api/init_config.po
Languages: pt_br

source: If ``NULL``, :data:`sys.pycache_prefix` is set to ``None``.
pt_br: Якщо ``NULL``, :data:`sys.pycache_prefix` має значення ``None``.

source: Quiet mode. If greater than ``0``, don't display the copyright and version at Python startup in interactive mode.
pt_br: Тихий режим. Если больше ``0``, не отображайте авторские права и версию при запуске Python в интерактивном режиме.

source: Incremented by the :option:`-q` command line option.
pt_br: Збільшується параметром командного рядка :option:`-q`.

source: Value of the :option:`-c` command line option.
pt_br: Значення параметра командного рядка :option:`-c`.

source: Used by :c:func:`Py_RunMain`.
pt_br: Використовується :c:func:`Py_RunMain`.

source: Filename passed on the command line: trailing command line argument without :option:`-c` or :option:`-m`. It is used by the :c:func:`Py_RunMain` function.
pt_br: Имя файла, передаваемое в командной строке: завершающий аргумент командной строки без :option:`-c` или :option:`-m`. Он используется функцией :c:func:`Py_RunMain`.

source: For example, it is set to ``script.py`` by the ``python3 script.py arg`` command line.
pt_br: Например, для него установлено значение ``script.py`` в командной строке ``python3 script.py arg``.

source: See also the :c:member:`PyConfig.skip_source_first_line` option.
pt_br: См. также параметр :c:member:`PyConfig.skip_source_first_line`.

source: Value of the :option:`-m` command line option.
pt_br: Значення параметра командного рядка :option:`-m`.

source: Set to ``1`` by :option:`-X showrefcount <-X>` command line option.
pt_br: Установите значение ``1`` с помощью опции командной строки :option:`-X showrefcount <-X>`.

source: Need a :ref:`debug build of Python <debug-build>` (the ``Py_REF_DEBUG`` macro must be defined).
pt_br: Потрібна :ref:`налагоджувальна збірка Python <debug-build>` (повинен бути визначений макрос ``Py_REF_DEBUG``).

source: Import the :mod:`site` module at startup?
pt_br: Імпортувати модуль :mod:`site` під час запуску?

source: If equal to zero, disable the import of the module site and the site-dependent manipulations of :data:`sys.path` that it entails.
pt_br: Якщо дорівнює нулю, вимкніть імпорт сайту модуля та залежні від сайту маніпуляції :data:`sys.path`, які він тягне за собою.

source: Also disable these manipulations if the :mod:`site` module is explicitly imported later (call :func:`site.main` if you want them to be triggered).
pt_br: Також вимкніть ці маніпуляції, якщо модуль :mod:`site` буде явно імпортовано пізніше (викличте :func:`site.main`, якщо ви хочете, щоб вони були активовані).

source: Set to ``0`` by the :option:`-S` command line option.
pt_br: Установіть ``0`` за допомогою параметра командного рядка :option:`-S`.

source: :data:`sys.flags.no_site <sys.flags>` is set to the inverted value of :c:member:`~PyConfig.site_import`.
pt_br: :data:`sys.flags.no_site <sys.flags>` имеет инвертированное значение :c:member:`~PyConfig.site_import`.

source: If non-zero, skip the first line of the :c:member:`PyConfig.run_filename` source.
pt_br: Якщо значення не нульове, пропустіть перший рядок джерела :c:member:`PyConfig.run_filename`.

source: It allows the usage of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
pt_br: Це дозволяє використовувати не-Unix форми ``#!cmd``. Це призначено лише для спеціального злому DOS.

source: Set to ``1`` by the :option:`-x` command line option.
pt_br: Установіть значення ``1`` за допомогою параметра командного рядка :option:`-x`.

source: Encoding and encoding errors of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` (but :data:`sys.stderr` always uses ``"backslashreplace"`` error handler).
pt_br: Кодування та помилки кодування :data:`sys.stdin`, :data:`sys.stdout` і :data:`sys.stderr` (але :data:`sys.stderr` завжди використовує ``"backslashreplace"`` обробник помилок).

source: If :c:func:`Py_SetStandardStreamEncoding` has been called, use its *error* and *errors* arguments if they are not ``NULL``.
pt_br: Якщо було викликано :c:func:`Py_SetStandardStreamEncoding`, використовуйте його аргументи *error* і *errors*, якщо вони не є ``NULL``.

source: Use the :envvar:`PYTHONIOENCODING` environment variable if it is non-empty.
pt_br: Використовуйте змінну середовища :envvar:`PYTHONIOENCODING`, якщо вона непорожня.

source: Default encoding:
pt_br: Codificação padrão:

source: ``"UTF-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
pt_br: ``"UTF-8"``, якщо :c:member:`PyPreConfig.utf8_mode` не нульовий.

source: Otherwise, use the :term:`locale encoding`.
pt_br: В іншому випадку використовуйте :term:`locale encoding`.

source: Default error handler:
pt_br: Tratador de erros padrão:

source: On Windows: use ``"surrogateescape"``.
pt_br: У Windows: використовуйте ``"surrogateescape"``.

source: ``"surrogateescape"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero, or if the LC_CTYPE locale is "C" or "POSIX".
pt_br: ``"surrogateescape"``, якщо :c:member:`PyPreConfig.utf8_mode` не нульовий, або якщо LC_CTYPE локаль "C" або "POSIX".

source: ``"strict"`` otherwise.
pt_br: ``"строгий"`` інакше.

source: Enable tracemalloc?
pt_br: Увімкнути tracemalloc?

source: If non-zero, call :func:`tracemalloc.start` at startup.
pt_br: Якщо не нуль, викликати :func:`tracemalloc.start` під час запуску.

source: Set by :option:`-X tracemalloc=N <-X>` command line option and by the :envvar:`PYTHONTRACEMALLOC` environment variable.
pt_br: Встановлюється параметром командного рядка :option:`-X tracemalloc=N <-X>` і змінною середовища :envvar:`PYTHONTRACEMALLOC`.

source: Use :ref:`environment variables <using-on-envvars>`?
pt_br: Використовувати :ref:`змінні середовища <using-on-envvars>`?

source: If equals to zero, ignore the :ref:`environment variables <using-on-envvars>`.
pt_br: Якщо дорівнює нулю, ігноруйте :ref:`змінні середовища <using-on-envvars>`.

source: Set to ``0`` by the :option:`-E` environment variable.
pt_br: Устанавливается в ``0`` переменной среды :option:`-E`.

source: If non-zero, add the user site directory to :data:`sys.path`.
pt_br: Якщо значення не нульове, додайте каталог сайту користувача до :data:`sys.path`.

source: Set to ``0`` by the :option:`-s` and :option:`-I` command line options.
pt_br: Установіть значення ``0`` за допомогою параметрів командного рядка :option:`-s` і :option:`-I`.

source: Set to ``0`` by the :envvar:`PYTHONNOUSERSITE` environment variable.
pt_br: Установлено значення ``0`` за допомогою змінної середовища :envvar:`PYTHONNOUSERSITE`.

source: Verbose mode. If greater than ``0``, print a message each time a module is imported, showing the place (filename or built-in module) from which it is loaded.
pt_br: Подробный режим. Если больше ``0``, каждый раз при импорте модуля выводить сообщение с указанием места (имя файла или встроенный модуль), из которого он загружен.

source: Incremented by the :option:`-v` command line option.
pt_br: Збільшується параметром командного рядка :option:`-v`.

source: Options of the :mod:`warnings` module to build warnings filters, lowest to highest priority: :data:`sys.warnoptions`.
pt_br: Параметри модуля :mod:`warnings` для створення фільтрів попереджень, від найнижчого до найвищого пріоритету: :data:`sys.warnoptions`.

source: The :mod:`warnings` module adds :data:`sys.warnoptions` in the reverse order: the last :c:member:`PyConfig.warnoptions` item becomes the first item of :data:`warnings.filters` which is checked first (highest priority).
pt_br: Модуль :mod:`warnings` додає :data:`sys.warnoptions` у зворотному порядку: останній елемент :c:member:`PyConfig.warnoptions` стає першим елементом :data:`warnings.filters`, який є перевіряється першим (найвищий пріоритет).

source: The :option:`-W` command line options adds its value to :c:member:`~PyConfig.warnoptions`, it can be used multiple times.
pt_br: Параметр командного рядка :option:`-W` додає значення до :c:member:`~PyConfig.warnoptions`, тому його можна використовувати кілька разів.

source: The :envvar:`PYTHONWARNINGS` environment variable can also be used to add warning options. Multiple options can be specified, separated by commas (``,``).
pt_br: Змінну середовища :envvar:`PYTHONWARNINGS` також можна використовувати для додавання параметрів попередження. Можна вказати декілька параметрів, розділених комами (``,``).

source: If equal to ``0``, Python won't try to write ``.pyc`` files on the import of source modules.
pt_br: Если значение равно «0», Python не будет пытаться записывать файлы «.pyc» при импорте исходных модулей.

source: Set to ``0`` by the :option:`-B` command line option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable.
pt_br: Установіть значення ``0`` за допомогою параметра командного рядка :option:`-B` і змінної середовища :envvar:`PYTHONDONTWRITEBYTECODE`.

source: :data:`sys.dont_write_bytecode` is initialized to the inverted value of :c:member:`~PyConfig.write_bytecode`.
pt_br: :data:`sys.dont_write_bytecode` ініціалізується інвертованим значенням :c:member:`~PyConfig.write_bytecode`.

source: Values of the :option:`-X` command line options: :data:`sys._xoptions`.
pt_br: Значення параметрів командного рядка :option:`-X`: :data:`sys._xoptions`.

source: If :c:member:`~PyConfig.parse_argv` is non-zero, :c:member:`~PyConfig.argv` arguments are parsed the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and Python arguments are stripped from :c:member:`~PyConfig.argv`.
pt_br: Якщо :c:member:`~PyConfig.parse_argv` не дорівнює нулю, аргументи :c:member:`~PyConfig.argv` аналізуються так само, як звичайний Python аналізує :ref:`аргументи командного рядка <using-on-cmdline>`, і Python аргументи видаляються з :c:member:`~PyConfig.argv`.

source: The :c:member:`~PyConfig.xoptions` options are parsed to set other options: see the :option:`-X` command line option.
pt_br: Параметри :c:member:`~PyConfig.xoptions` аналізуються, щоб встановити інші параметри: дивіться параметр командного рядка :option:`-X`.

source: The ``show_alloc_count`` field has been removed.
pt_br: Поле ``show_alloc_count`` видалено.

source: Initialization with PyConfig
pt_br: Ініціалізація за допомогою PyConfig

source: Function to initialize Python:
pt_br: Функція для ініціалізації Python:

source: Initialize Python from *config* configuration.
pt_br: Ініціалізація Python із конфігурації *config*.

source: If :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` are used, they must be set or called after Python preinitialization and before the Python initialization. If Python is initialized multiple times, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` must be called before each Python initialization.
pt_br: Якщо :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` або :c:func:`PyImport_ExtendInittab` використовуються, їх потрібно встановити або викликати після попередньої ініціалізації Python та перед ініціалізацією Python. Якщо Python ініціалізовано кілька разів, перед кожною ініціалізацією Python потрібно викликати :c:func:`PyImport_AppendInittab` або :c:func:`PyImport_ExtendInittab`.

source: The current configuration (``PyConfig`` type) is stored in ``PyInterpreterState.config``.
pt_br: Поточна конфігурація (тип ``PyConfig``) зберігається в ``PyInterpreterState.config``.

source: Example setting the program name::
pt_br: Приклад налаштування імені програми::

source: More complete example modifying the default configuration, read the configuration, and then override some parameters. Note that since 3.11, many parameters are not calculated until initialization, and so values cannot be read from the configuration structure. Any values set before initialize is called will be left unchanged by initialization::
pt_br: Более полный пример изменения конфигурации по умолчанию, чтения конфигурации и последующего переопределения некоторых параметров. Обратите внимание, что начиная с версии 3.11 многие параметры не рассчитываются до инициализации, поэтому значения невозможно прочитать из структуры конфигурации. Любые значения, установленные до вызова инициализации, останутся неизменными при инициализации::

source: Isolated Configuration
pt_br: Ізольована конфігурація

source: :c:func:`PyPreConfig_InitIsolatedConfig` and :c:func:`PyConfig_InitIsolatedConfig` functions create a configuration to isolate Python from the system. For example, to embed Python into an application.
pt_br: Функції :c:func:`PyPreConfig_InitIsolatedConfig` і :c:func:`PyConfig_InitIsolatedConfig` створюють конфігурацію для ізоляції Python від системи. Наприклад, щоб вбудувати Python у програму.

source: This configuration ignores global configuration variables, environment variables, command line arguments (:c:member:`PyConfig.argv` is not parsed) and user site directory. The C standard streams (ex: ``stdout``) and the LC_CTYPE locale are left unchanged. Signal handlers are not installed.
pt_br: Ця конфігурація ігнорує глобальні змінні конфігурації, змінні середовища, аргументи командного рядка (:c:member:`PyConfig.argv` не аналізується) і каталог сайту користувача. Стандартні потоки C (наприклад: ``stdout``) і локаль LC_CTYPE залишаються без змін. Обробники сигналів не встановлені.

source: Configuration files are still used with this configuration to determine paths that are unspecified. Ensure :c:member:`PyConfig.home` is specified to avoid computing the default path configuration.
pt_br: Файлы конфигурации по-прежнему используются с этой конфигурацией для определения неуказанных путей. Убедитесь, что указан :c:member:`PyConfig.home`, чтобы избежать вычисления конфигурации пути по умолчанию.

source: Python Configuration
pt_br: Configuração do Python

source: :c:func:`PyPreConfig_InitPythonConfig` and :c:func:`PyConfig_InitPythonConfig` functions create a configuration to build a customized Python which behaves as the regular Python.
pt_br: Функції :c:func:`PyPreConfig_InitPythonConfig` і :c:func:`PyConfig_InitPythonConfig` створюють конфігурацію для створення налаштованого Python, який веде себе як звичайний Python.

source: Environments variables and command line arguments are used to configure Python, whereas global configuration variables are ignored.
pt_br: Для налаштування Python використовуються змінні середовища та аргументи командного рядка, тоді як глобальні змінні конфігурації ігноруються.

source: This function enables C locale coercion (:pep:`538`) and :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) depending on the LC_CTYPE locale, :envvar:`PYTHONUTF8` and :envvar:`PYTHONCOERCECLOCALE` environment variables.
pt_br: Ця функція вмикає примусове налаштування локалі C (:pep:`538`) і :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) залежно від локалі LC_CTYPE, :envvar:`PYTHONUTF8` і Змінні середовища :envvar:`PYTHONCOERCECLOCALE`.

source: Python Path Configuration
pt_br: Конфігурація шляху Python

source: :c:type:`PyConfig` contains multiple fields for the path configuration:
pt_br: :c:type:`PyConfig` містить кілька полів для конфігурації шляху:

source: Path configuration inputs:
pt_br: Вхідні дані конфігурації шляху:

source: current working directory: to get absolute paths
pt_br: поточний робочий каталог: щоб отримати абсолютні шляхи

source: ``PATH`` environment variable to get the program full path (from :c:member:`PyConfig.program_name`)
pt_br: Змінна середовища ``PATH``, щоб отримати повний шлях до програми (з :c:member:`PyConfig.program_name`)

source: ``__PYVENV_LAUNCHER__`` environment variable
pt_br: Змінна середовища ``__PYVENV_LAUNCHER__``

source: (Windows only) Application paths in the registry under "Software\Python\PythonCore\X.Y\PythonPath" of HKEY_CURRENT_USER and HKEY_LOCAL_MACHINE (where X.Y is the Python version).
pt_br: (Лише для Windows) Шляхи програм у реєстрі в розділі "Software\Python\PythonCore\X.Y\PythonPath" HKEY_CURRENT_USER і HKEY_LOCAL_MACHINE (де X.Y — версія Python).

source: Path configuration output fields:
pt_br: Поля виведення конфігурації шляху:

source: If at least one "output field" is not set, Python calculates the path configuration to fill unset fields. If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:member:`~PyConfig.module_search_paths` is overridden and :c:member:`~PyConfig.module_search_paths_set` is set to ``1``.
pt_br: Если хотя бы одно «поле вывода» не установлено, Python вычисляет конфигурацию пути для заполнения неустановленных полей. Если :c:member:`~PyConfig.module_search_paths_set` равен ``0``, :c:member:`~PyConfig.module_search_paths` переопределяется, а :c:member:`~PyConfig.module_search_paths_set` имеет значение `` `1``.

source: It is possible to completely ignore the function calculating the default path configuration by setting explicitly all path configuration output fields listed above. A string is considered as set even if it is non-empty. ``module_search_paths`` is considered as set if ``module_search_paths_set`` is set to ``1``. In this case, ``module_search_paths`` will be used without modification.
pt_br: Можно полностью игнорировать функцию расчета конфигурации пути по умолчанию, явно задав все поля вывода конфигурации пути, перечисленные выше. Строка считается установленной, даже если она не пуста. ``module_search_paths`` считается установленным, если ``module_search_paths_set`` установлен в ``1``. В этом случае module_search_paths будет использоваться без изменений.

source: Set :c:member:`~PyConfig.pathconfig_warnings` to ``0`` to suppress warnings when calculating the path configuration (Unix only, Windows does not log any warning).
pt_br: Установите для :c:member:`~PyConfig.pathconfig_warnings` значение ``0``, чтобы подавить предупреждения при вычислении конфигурации пути (только для Unix, Windows не регистрирует никаких предупреждений).

source: If :c:member:`~PyConfig.base_prefix` or :c:member:`~PyConfig.base_exec_prefix` fields are not set, they inherit their value from :c:member:`~PyConfig.prefix` and :c:member:`~PyConfig.exec_prefix` respectively.
pt_br: Якщо поля :c:member:`~PyConfig.base_prefix` або :c:member:`~PyConfig.base_exec_prefix` не встановлені, вони успадковують свої значення від :c:member:`~PyConfig.prefix` і :c:member:`~PyConfig.exec_prefix` відповідно.

source: :c:func:`Py_RunMain` and :c:func:`Py_Main` modify :data:`sys.path`:
pt_br: :c:func:`Py_RunMain` і :c:func:`Py_Main` змінюють :data:`sys.path`:

source: If :c:member:`~PyConfig.run_filename` is set and is a directory which contains a ``__main__.py`` script, prepend :c:member:`~PyConfig.run_filename` to :data:`sys.path`.
pt_br: Якщо :c:member:`~PyConfig.run_filename` встановлено і це каталог, який містить сценарій ``__main__.py``, додайте :c:member:`~PyConfig.run_filename` до :data:`sys.path`.

source: If :c:member:`~PyConfig.isolated` is zero:
pt_br: Якщо :c:member:`~PyConfig.isolated` дорівнює нулю:

source: If :c:member:`~PyConfig.run_module` is set, prepend the current directory to :data:`sys.path`. Do nothing if the current directory cannot be read.
pt_br: Якщо встановлено :c:member:`~PyConfig.run_module`, додайте поточний каталог до :data:`sys.path`. Нічого не робити, якщо поточний каталог неможливо прочитати.

source: If :c:member:`~PyConfig.run_filename` is set, prepend the directory of the filename to :data:`sys.path`.
pt_br: Якщо встановлено :c:member:`~PyConfig.run_filename`, додайте каталог імені файлу перед :data:`sys.path`.

source: Otherwise, prepend an empty string to :data:`sys.path`.
pt_br: В іншому випадку додайте порожній рядок до :data:`sys.path`.

source: If :c:member:`~PyConfig.site_import` is non-zero, :data:`sys.path` can be modified by the :mod:`site` module. If :c:member:`~PyConfig.user_site_directory` is non-zero and the user's site-package directory exists, the :mod:`site` module appends the user's site-package directory to :data:`sys.path`.
pt_br: Якщо :c:member:`~PyConfig.site_import` не дорівнює нулю, :data:`sys.path` можна змінити за допомогою модуля :mod:`site`. Якщо :c:member:`~PyConfig.user_site_directory` не дорівнює нулю, а каталог пакетів сайту користувача існує, модуль :mod:`site` додає каталог пакетів сайту користувача до :data:`sys.path`.

source: The following configuration files are used by the path configuration:
pt_br: У конфігурації шляху використовуються такі файли конфігурації:

source: ``._pth`` file (ex: ``python._pth``)
pt_br: Файл ``._pth`` (например: ``python._pth``)

source: ``pybuilddir.txt`` (Unix only)
pt_br: ``pybuilddir.txt`` (лише Unix)

source: If a ``._pth`` file is present:
pt_br: Если присутствует файл ``._pth``:

source: Set :c:member:`~PyConfig.isolated` to ``1``.
pt_br: Установите для :c:member:`~PyConfig.isolated` значение ``1``.

source: Set :c:member:`~PyConfig.site_import` to ``0``.
pt_br: Установите для :c:member:`~PyConfig.site_import` значение ``0``.

source: Set :c:member:`~PyConfig.safe_path` to ``1``.
pt_br: Установите для :c:member:`~PyConfig.safe_path` значение ``1``.

source: The ``__PYVENV_LAUNCHER__`` environment variable is used to set :c:member:`PyConfig.base_executable`
pt_br: Змінна середовища ``__PYVENV_LAUNCHER__`` використовується для встановлення :c:member:`PyConfig.base_executable`

source: Execute the command (:c:member:`PyConfig.run_command`), the script (:c:member:`PyConfig.run_filename`) or the module (:c:member:`PyConfig.run_module`) specified on the command line or in the configuration.
pt_br: Виконайте команду (:c:member:`PyConfig.run_command`), сценарій (:c:member:`PyConfig.run_filename`) або модуль (:c:member:`PyConfig.run_module`), указані в командному рядку або в конфігурації.

source: By default and when if :option:`-i` option is used, run the REPL.
pt_br: За замовчуванням і якщо використовується параметр :option:`-i`, запустіть REPL.

source: Finally, finalizes Python and returns an exit status that can be passed to the ``exit()`` function.
pt_br: Нарешті завершує Python і повертає статус виходу, який можна передати функції ``exit()``.

source: See :ref:`Python Configuration <init-python-config>` for an example of customized Python always running in isolated mode using :c:func:`Py_RunMain`.
pt_br: Перегляньте :ref:`Налаштування Python <init-python-config>` для прикладу налаштованого Python, який завжди працює в ізольованому режимі за допомогою :c:func:`Py_RunMain`.

source: Get the original command line arguments, before Python modified them.
pt_br: Отримайте оригінальні аргументи командного рядка до того, як Python їх змінив.

source: See also :c:member:`PyConfig.orig_argv` member.
pt_br: Дивіться також член :c:member:`PyConfig.orig_argv`.

source: Multi-Phase Initialization Private Provisional API
pt_br: Приватний тимчасовий API багатофазної ініціалізації

source: This section is a private provisional API introducing multi-phase initialization, the core feature of :pep:`432`:
pt_br: Цей розділ є приватним тимчасовим API, який представляє багатофазову ініціалізацію, основну функцію :pep:`432`:

source: "Core" initialization phase, "bare minimum Python":
pt_br: Фаза ініціалізації "Core", "мінімум Python":

source: Builtin types;
pt_br: Вбудовані типи;

source: Builtin exceptions;
pt_br: Вбудовані винятки;

source: Builtin and frozen modules;
pt_br: Вбудовані та заморожені модулі;

source: The :mod:`sys` module is only partially initialized (ex: :data:`sys.path` doesn't exist yet).
pt_br: Модуль :mod:`sys` ініціалізовано лише частково (наприклад: :data:`sys.path` ще не існує).

source: "Main" initialization phase, Python is fully initialized:
pt_br: "Основна" фаза ініціалізації, Python повністю ініціалізовано:

source: Install and configure :mod:`importlib`;
pt_br: Встановити та налаштувати :mod:`importlib`;

source: Apply the :ref:`Path Configuration <init-path-config>`;
pt_br: Застосуйте :ref:`Конфігурацію шляху <init-path-config>`;

source: Install signal handlers;
pt_br: встановити обробники сигналів;
