Repository: python/python-docs-pt-br
Catalog: c-api/intro.po
Languages: pt_br

source: Introduction
pt_br: Introdução

source: The Application Programmer's Interface to Python gives C and C++ programmers access to the Python interpreter at a variety of levels. The API is equally usable from C++, but for brevity it is generally referred to as the Python/C API. There are two fundamentally different reasons for using the Python/C API. The first reason is to write *extension modules* for specific purposes; these are C modules that extend the Python interpreter. This is probably the most common use. The second reason is to use Python as a component in a larger application; this technique is generally referred to as :dfn:`embedding` Python in an application.
pt_br: A Interface de Programação de Aplicações (API) para Python fornece aos programadores C e C++ acesso ao interpretador Python em uma variedade de níveis. A API pode ser usada igualmente em C++, mas, para abreviar, geralmente é chamada de API Python/C. Existem dois motivos fundamentalmente diferentes para usar a API Python/C. A primeira razão é escrever *módulos de extensão* para propósitos específicos; esses são módulos C que estendem o interpretador Python. Este é provavelmente o uso mais comum. O segundo motivo é usar Python como um componente em uma aplicação maior; esta técnica é geralmente referida como :dfn:`incorporação` Python em uma aplicação.

source: Writing an extension module is a relatively well-understood process, where a "cookbook" approach works well. There are several tools that automate the process to some extent. While people have embedded Python in other applications since its early existence, the process of embedding Python is less straightforward than writing an extension.
pt_br: Escrever um módulo de extensão é um processo relativamente bem compreendido, no qual uma abordagem de "livro de receitas" funciona bem. Existem várias ferramentas que automatizam o processo até certo ponto. Embora as pessoas tenham incorporado o Python em outras aplicações desde sua existência inicial, o processo de incorporação do Python é menos direto do que escrever uma extensão.

source: Many API functions are useful independent of whether you're embedding or extending Python; moreover, most applications that embed Python will need to provide a custom extension as well, so it's probably a good idea to become familiar with writing an extension before attempting to embed Python in a real application.
pt_br: Muitas funções da API são úteis independentemente de você estar incorporando ou estendendo o Python; além disso, a maioria das aplicações que incorporam Python também precisará fornecer uma extensão customizada, portanto, é provavelmente uma boa ideia se familiarizar com a escrita de uma extensão antes de tentar incorporar Python em uma aplicação real.

source: Language version compatibility
pt_br: Compatibilidade com a versão da linguagem

source: Python's C API is compatible with C11 and C++11 versions of C and C++.
pt_br: A API C do Python é compatível com as versões C11 e C++11 do C e C++.

source: This is a lower limit: the C API does not require features from later C/C++ versions. You do *not* need to enable your compiler's "c11 mode".
pt_br: Este é um limite inferior: a API C não requer recursos de versões posteriores de C/C++. Você *não* precisa habilitar o "modo c11" do seu compilador.

source: Coding standards
pt_br: Padrões de codificação

source: If you're writing C code for inclusion in CPython, you **must** follow the guidelines and standards defined in :PEP:`7`. These guidelines apply regardless of the version of Python you are contributing to. Following these conventions is not necessary for your own third party extension modules, unless you eventually expect to contribute them to Python.
pt_br: Se você estiver escrevendo código C para inclusão no CPython, **deve** seguir as diretrizes e padrões definidos na :PEP:`7`. Essas diretrizes se aplicam independentemente da versão do Python com a qual você está contribuindo. Seguir essas convenções não é necessário para seus próprios módulos de extensão de terceiros, a menos que você eventualmente espere contribuí-los para o Python.

source: Include Files
pt_br: Arquivos de inclusão

source: All function, type and macro definitions needed to use the Python/C API are included in your code by the following line::
pt_br: Todas as definições de função, tipo e macro necessárias para usar a API Python/C estão incluídas em seu código pela seguinte linha::

source: This implies inclusion of the following standard headers: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, ``<assert.h>`` and ``<stdlib.h>`` (if available).
pt_br: Isso implica a inclusão dos seguintes cabeçalhos padrão: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, ``<assert.h>`` e ``<stdlib.h>`` (se disponível).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
pt_br: Uma vez que Python pode definir algumas definições de pré-processador que afetam os cabeçalhos padrão em alguns sistemas, você *deve* incluir :file:`Python.h` antes de quaisquer cabeçalhos padrão serem incluídos.

source: It is recommended to always define ``PY_SSIZE_T_CLEAN`` before including ``Python.h``. See :ref:`arg-parsing` for a description of this macro.
pt_br: É recomendável sempre definir ``PY_SSIZE_T_CLEAN`` antes de incluir ``Python.h``. Veja :ref:`arg-parsing` para uma descrição desta macro.

source: All user visible names defined by Python.h (except those defined by the included standard headers) have one of the prefixes ``Py`` or ``_Py``. Names beginning with ``_Py`` are for internal use by the Python implementation and should not be used by extension writers. Structure member names do not have a reserved prefix.
pt_br: Todos os nomes visíveis ao usuário definidos por Python.h (exceto aqueles definidos pelos cabeçalhos padrão incluídos) têm um dos prefixos ``Py`` ou ``_Py``. Nomes começando com ``_Py`` são para uso interno pela implementação Python e não devem ser usados por escritores de extensão. Os nomes dos membros da estrutura não têm um prefixo reservado.

source: User code should never define names that begin with ``Py`` or ``_Py``. This confuses the reader, and jeopardizes the portability of the user code to future Python versions, which may define additional names beginning with one of these prefixes.
pt_br: O código do usuário nunca deve definir nomes que começam com ``Py`` ou ``_Py``. Isso confunde o leitor e coloca em risco a portabilidade do código do usuário para versões futuras do Python, que podem definir nomes adicionais começando com um desses prefixos.

source: The header files are typically installed with Python. On Unix, these are located in the directories :file:`{prefix}/include/pythonversion/` and :file:`{exec_prefix}/include/pythonversion/`, where :option:`prefix <--prefix>` and :option:`exec_prefix <--exec-prefix>` are defined by the corresponding parameters to Python's :program:`configure` script and *version* is ``'%d.%d' % sys.version_info[:2]``. On Windows, the headers are installed in :file:`{prefix}/include`, where ``prefix`` is the installation directory specified to the installer.
pt_br: Os arquivos de cabeçalho são normalmente instalados com Python. No Unix, eles estão localizados nos diretórios :file:`{prefix}/include/pythonversion/` e :file:`{exec_prefix}/include/pythonversion/`, onde :option:`prefix <--prefix>` e :option:`exec_prefix <--exec-prefix>` são definidos pelos parâmetros correspondentes ao script :program:`configure` e *version* do Python é ``'%d.%d' % sys.version_info[:2]``. No Windows, os cabeçalhos são instalados em :file:`{prefix}/include`, onde ``prefix`` é o diretório de instalação especificado para o instalador.

source: To include the headers, place both directories (if different) on your compiler's search path for includes. Do *not* place the parent directories on the search path and then use ``#include <pythonX.Y/Python.h>``; this will break on multi-platform builds since the platform independent headers under :option:`prefix <--prefix>` include the platform specific headers from :option:`exec_prefix <--exec-prefix>`.
pt_br: Para incluir os cabeçalhos, coloque os dois diretórios (se diferentes) no caminho de pesquisa do compilador para as inclusões. *Não* coloque os diretórios pais no caminho de busca e então use ``#include <pythonX.Y/Python.h>``; isto irá quebrar em compilações multiplataforma, uma vez que os cabeçalhos independentes da plataforma em :option:`prefix <--prefix>` incluem os cabeçalhos específicos da plataforma de :option:`exec_prefix <--exec-prefix>`.

source: C++ users should note that although the API is defined entirely using C, the header files properly declare the entry points to be ``extern "C"``. As a result, there is no need to do anything special to use the API from C++.
pt_br: Os usuários de C++ devem notar que embora a API seja definida inteiramente usando C, os arquivos de cabeçalho declaram apropriadamente os pontos de entrada como ``extern "C"``. Como resultado, não há necessidade de fazer nada especial para usar a API do C++.

source: Useful macros
pt_br: Macros úteis

source: Several useful macros are defined in the Python header files. Many are defined closer to where they are useful (for example, :c:macro:`Py_RETURN_NONE`, :c:macro:`PyMODINIT_FUNC`). Others of a more general utility are defined here. This is not necessarily a complete listing.
pt_br: Diversas macros úteis são definidas nos arquivos de cabeçalho do Python. Muitas são definidas mais próximas de onde são úteis (por exemplo, :c:macro:`Py_RETURN_NONE`, :c:macro:`PyMODINIT_FUNC`). Outras de utilidade mais geral são definidas aqui. Esta não é necessariamente uma lista completa.

source: Return the absolute value of ``x``.
pt_br: Retorna o valor absoluto de ``x``.

source: If the result cannot be represented (for example, if ``x`` has :c:macro:`!INT_MIN` value for :c:expr:`int` type), the behavior is undefined.
pt_br: Se o resultado não puder ser representado (por exemplo, se ``x`` tiver o valor :c:macro:`!INT_MIN` para o tipo :c:expr:`int`), o comportamento é indefinido.

source: Ask the compiler to always inline a static inline function. The compiler can ignore it and decide to not inline the function.
pt_br: Pede ao compilador para sempre embutir uma função em linha estática. O compilador pode ignorá-lo e decide não inserir a função.

source: It can be used to inline performance critical static inline functions when building Python in debug mode with function inlining disabled. For example, MSC disables function inlining when building in debug mode.
pt_br: Ele pode ser usado para inserir funções em linha estáticas críticas de desempenho ao compilar Python no modo de depuração com função de inserir em linha desabilitada. Por exemplo, o MSC desabilita a função de inserir em linha ao compilar no modo de depuração.

source: Marking blindly a static inline function with Py_ALWAYS_INLINE can result in worse performances (due to increased code size for example). The compiler is usually smarter than the developer for the cost/benefit analysis.
pt_br: Marcar cegamente uma função em linha estática com Py_ALWAYS_INLINE pode resultar em desempenhos piores (devido ao aumento do tamanho do código, por exemplo). O compilador geralmente é mais inteligente que o desenvolvedor para a análise de custo/benefício.

source: If Python is :ref:`built in debug mode <debug-build>` (if the :c:macro:`Py_DEBUG` macro is defined), the :c:macro:`Py_ALWAYS_INLINE` macro does nothing.
pt_br: Se o Python tiver sido :ref:`compilado em modo de depuração <debug-build>` (se a macro :c:macro:`Py_DEBUG` estiver definida), a macro :c:macro:`Py_ALWAYS_INLINE` não fará nada.

source: It must be specified before the function return type. Usage::
pt_br: Deve ser especificado antes do tipo de retorno da função. Uso::

source: Argument must be a character or an integer in the range [-128, 127] or [0, 255]. This macro returns ``c`` cast to an ``unsigned char``.
pt_br: O argumento deve ser um caractere ou um número inteiro no intervalo [-128, 127] ou [0, 255]. Esta macro retorna ``c`` convertido em um ``unsigned char``.

source: Use this for deprecated declarations. The macro must be placed before the symbol name.
pt_br: Use isso para declarações descontinuadas. A macro deve ser colocada antes do nome do símbolo.

source: Example::
pt_br: Exemplo::

source: MSVC support was added.
pt_br: Suporte a MSVC foi adicionado.

source: Like ``getenv(s)``, but returns ``NULL`` if :option:`-E` was passed on the command line (see :c:member:`PyConfig.use_environment`).
pt_br: Como ``getenv(s)``, mas retorna ``NULL`` se a opção :option:`-E` foi passada na linha de comando (veja :c:member:`PyConfig.use_environment`).

source: Declare a function returning the specified *type* using a fast-calling qualifier for functions that are local to the current file. Semantically, this is equivalent to ``static type``.
pt_br: Declara uma função que retorne o *type* especificado usando um qualificador de chamada rápida para funções locais ao arquivo atual. Semanticamente, isso equivale a ``static type``.

source: Equivalent to :c:macro:`Py_LOCAL` but additionally requests the function be inlined.
pt_br: Equivalente a :c:macro:`Py_LOCAL`, mas que também exige que a função seja inserida localmente.

source: Return the maximum value between ``x`` and ``y``.
pt_br: Retorna o valor máximo entre ``x`` e ``y``.

source: Return the size of a structure (``type``) ``member`` in bytes.
pt_br: Retorna o tamanho do ``member`` de uma estrutura (``type``) em bytes.

source: This is a :term:`soft deprecated` alias to :c:func:`!memcpy`. Use :c:func:`!memcpy` directly instead.
pt_br: Este é um apelido :term:`suavemente descontinuado` para :c:func:`!memcpy`. Usa :c:func:`!memcpy` diretamente.

source: The macro is :term:`soft deprecated`.
pt_br: A macro está :term:`suavemente descontinuada <suavemente descontinuado>`.

source: Return the minimum value between ``x`` and ``y``.
pt_br: Retorna o valor mínimo entre ``x`` e ``y``.

source: Disable inlining on a function. For example, it reduces the C stack consumption: useful on LTO+PGO builds which heavily inline code (see :issue:`33720`).
pt_br: Desabilita a inserção em linha em uma função. Por exemplo, isso reduz o consumo da pilha C: útil em compilações LTO+PGO que faz uso intenso de inserção em linha de código (veja :issue:`33720`).

source: Usage::
pt_br: Uso::

source: Convert ``x`` to a C string. E.g. ``Py_STRINGIFY(123)`` returns ``"123"``.
pt_br: Converte ``x`` para uma string C. Por exemplo, ``Py_STRINGIFY(123)`` retorna ``"123"``.

source: Use this when you have a code path that cannot be reached by design. For example, in the ``default:`` clause in a ``switch`` statement for which all possible values are covered in ``case`` statements. Use this in places where you might be tempted to put an ``assert(0)`` or ``abort()`` call.
pt_br: Use isso quando você tiver um caminho de código que não pode ser alcançado por design. Por exemplo, na cláusula ``default:`` em uma instrução ``switch`` para a qual todos os valores possíveis são incluídos nas instruções ``case``. Use isto em lugares onde você pode ficar tentado a colocar uma chamada ``assert(0)`` ou ``abort()``.

source: In release mode, the macro helps the compiler to optimize the code, and avoids a warning about unreachable code. For example, the macro is implemented with ``__builtin_unreachable()`` on GCC in release mode.
pt_br: No modo de lançamento, a macro ajuda o compilador a otimizar o código e evita um aviso sobre código inacessível. Por exemplo, a macro é implementada com ``__builtin_unreachable()`` no GCC em modo de lançamento.

source: A use for ``Py_UNREACHABLE()`` is following a call a function that never returns but that is not declared :c:macro:`_Py_NO_RETURN`.
pt_br: Um uso para ``Py_UNREACHABLE()`` é seguir uma chamada de uma função que nunca retorna, mas que não é declarada com :c:macro:`_Py_NO_RETURN`.

source: If a code path is very unlikely code but can be reached under exceptional case, this macro must not be used. For example, under low memory condition or if a system call returns a value out of the expected range. In this case, it's better to report the error to the caller. If the error cannot be reported to caller, :c:func:`Py_FatalError` can be used.
pt_br: Se um caminho de código for um código muito improvável, mas puder ser alcançado em casos excepcionais, esta macro não deve ser usada. Por exemplo, sob condição de pouca memória ou se uma chamada de sistema retornar um valor fora do intervalo esperado. Nesse caso, é melhor relatar o erro ao chamador. Se o erro não puder ser reportado ao chamador, :c:func:`Py_FatalError` pode ser usada.

source: Use this for unused arguments in a function definition to silence compiler warnings. Example: ``int func(int a, int Py_UNUSED(b)) { return a; }``.
pt_br: Use isso para argumentos não usados em uma definição de função para silenciar avisos do compilador. Exemplo: ``int func(int a, int Py_UNUSED(b)) { return a; }``.

source: Asserts a compile-time condition *cond*, as a statement. The build will fail if the condition is false or cannot be evaluated at compile time.
pt_br: Realiza asserção de uma condição de tempo de compilação *cond*, como uma instrução. A construção falhará se a condição for falsa ou não puder ser avaliada em tempo de compilação.

source: For example::
pt_br: Por exemplo::

source: Asserts a compile-time condition *cond*, as an expression that evaluates to ``0``. The build will fail if the condition is false or cannot be evaluated at compile time.
pt_br: Realiza asserção de uma condição de tempo de compilação *cond*, como uma expressão que é avaliada com ``0``. A construção falhará se a condição for falsa ou não puder ser avaliada em tempo de compilação.

source: Creates a variable with name *name* that can be used in docstrings. If Python is built without docstrings, the value will be empty.
pt_br: Cria uma variável com o nome *name* que pode ser usada em docstrings. Se o Python for construído sem docstrings, o valor estará vazio.

source: Use :c:macro:`PyDoc_STRVAR` for docstrings to support building Python without docstrings, as specified in :pep:`7`.
pt_br: Use :c:macro:`PyDoc_STRVAR` para docstrings para ter suporte à compilação do Python sem docstrings, conforme especificado em :pep:`7`.

source: PyDoc_STRVAR(pop_doc, "Remove and return the rightmost element."); static PyMethodDef deque_methods[] = { // ... {"pop", (PyCFunction)deque_pop, METH_NOARGS, pop_doc}, // ... }
pt_br: PyDoc_STRVAR(pop_doc, "Remove e retorna o elemento mais à direita."); static PyMethodDef deque_methods[] = { // ... {"pop", (PyCFunction)deque_pop, METH_NOARGS, pop_doc}, // ... }

source: Creates a docstring for the given input string or an empty string if docstrings are disabled.
pt_br: Cria uma docstring para a string de entrada fornecida ou uma string vazia se docstrings estiverem desabilitadas.

source: Use :c:macro:`PyDoc_STR` in specifying docstrings to support building Python without docstrings, as specified in :pep:`7`.
pt_br: Use :c:macro:`PyDoc_STR` ao especificar docstrings para ter suporte à compilação do Python sem docstrings, conforme especificado em :pep:`7`.

source: static PyMethodDef pysqlite_row_methods[] = { {"keys", (PyCFunction)pysqlite_row_keys, METH_NOARGS, PyDoc_STR("Returns the keys of the row.")}, {NULL, NULL} };
pt_br: static PyMethodDef pysqlite_row_methods[] = { {"keys", (PyCFunction)pysqlite_row_keys, METH_NOARGS, PyDoc_STR("Retorna as chaves da linha.")}, {NULL, NULL} };

source: Declares a static character array variable with the given name *name*.
pt_br: Declara uma variável estática de vetor de caracteres com o nome fornecido *name*.

source: Objects, Types and Reference Counts
pt_br: Objetos, tipos e contagens de referências

source: Most Python/C API functions have one or more arguments as well as a return value of type :c:expr:`PyObject*`. This type is a pointer to an opaque data type representing an arbitrary Python object. Since all Python object types are treated the same way by the Python language in most situations (e.g., assignments, scope rules, and argument passing), it is only fitting that they should be represented by a single C type. Almost all Python objects live on the heap: you never declare an automatic or static variable of type :c:type:`PyObject`, only pointer variables of type :c:expr:`PyObject*` can be declared. The sole exception are the type objects; since these must never be deallocated, they are typically static :c:type:`PyTypeObject` objects.
pt_br: A maioria das funções da API Python/C tem um ou mais argumentos, bem como um valor de retorno do tipo :c:expr:`PyObject*`. Este tipo é um ponteiro para um tipo de dados opaco que representa um objeto Python arbitrário. Como todos os tipos de objeto Python são tratados da mesma maneira pela linguagem Python na maioria das situações (por exemplo, atribuições, regras de escopo e passagem de argumento), é adequado que eles sejam representados por um único tipo C. Quase todos os objetos Python vivem na pilha: você nunca declara uma variável automática ou estática do tipo :c:type:`PyObject`, variáveis de apenas ponteiro do tipo :c:expr:`PyObject*` podem ser declaradas. A única exceção são os objetos de tipo; uma vez que estes nunca devem ser desalocados, eles são normalmente objetos estáticos :c:type:`PyTypeObject`.

source: All Python objects (even Python integers) have a :dfn:`type` and a :dfn:`reference count`. An object's type determines what kind of object it is (e.g., an integer, a list, or a user-defined function; there are many more as explained in :ref:`types`). For each of the well-known types there is a macro to check whether an object is of that type; for instance, ``PyList_Check(a)`` is true if (and only if) the object pointed to by *a* is a Python list.
pt_br: Todos os objetos Python (mesmo inteiros Python) têm um :dfn:`tipo` e uma :dfn:`contagem de referências`. O tipo de um objeto determina que tipo de objeto ele é (por exemplo, um número inteiro, uma lista ou uma função definida pelo usuário; existem muitos mais, conforme explicado em :ref:`types`). Para cada um dos tipos conhecidos, há uma macro para verificar se um objeto é desse tipo; por exemplo, ``PyList_Check(a)`` é verdadeiro se (e somente se) o objeto apontado por *a* for uma lista Python.

source: Reference Counts
pt_br: Contagens de referências
