Repository: python/python-docs-pt-br
Catalog: c-api/intro.po
Languages: pt_br

source: For C programmers, however, error checking always has to be explicit. All functions in the Python/C API can raise exceptions, unless an explicit claim is made otherwise in a function's documentation. In general, when a function encounters an error, it sets an exception, discards any object references that it owns, and returns an error indicator. If not documented otherwise, this indicator is either ``NULL`` or ``-1``, depending on the function's return type. A few functions return a Boolean true/false result, with false indicating an error. Very few functions return no explicit error indicator or have an ambiguous return value, and require explicit testing for errors with :c:func:`PyErr_Occurred`. These exceptions are always explicitly documented.
pt_br: Para programadores C, entretanto, a verificação de erros sempre deve ser explícita. Todas as funções na API Python/C podem levantar exceções, a menos que uma declaração explícita seja feita de outra forma na documentação de uma função. Em geral, quando uma função encontra um erro, ela define uma exceção, descarta todas as referências de objeto de sua propriedade e retorna um indicador de erro. Se não for documentado de outra forma, este indicador é ``NULL`` ou ``-1``, dependendo do tipo de retorno da função. Algumas funções retornam um resultado booleano verdadeiro/falso, com falso indicando um erro. Muito poucas funções não retornam nenhum indicador de erro explícito ou têm um valor de retorno ambíguo e requerem teste explícito para erros com :c:func:`PyErr_Occurred`. Essas exceções são sempre documentadas explicitamente.

source: Exception state is maintained in per-thread storage (this is equivalent to using global storage in an unthreaded application). A thread can be in one of two states: an exception has occurred, or not. The function :c:func:`PyErr_Occurred` can be used to check for this: it returns a borrowed reference to the exception type object when an exception has occurred, and ``NULL`` otherwise. There are a number of functions to set the exception state: :c:func:`PyErr_SetString` is the most common (though not the most general) function to set the exception state, and :c:func:`PyErr_Clear` clears the exception state.
pt_br: O estado de exceção é mantido no armazenamento por thread (isso é equivalente a usar o armazenamento global em uma aplicação sem thread). Uma thread pode estar em um de dois estados: ocorreu uma exceção ou não. A função :c:func:`PyErr_Occurred` pode ser usada para verificar isso: ela retorna uma referência emprestada ao objeto do tipo de exceção quando uma exceção ocorreu, e ``NULL`` caso contrário. Existem várias funções para definir o estado de exceção: :c:func:`PyErr_SetString` é a função mais comum (embora não a mais geral) para definir o estado de exceção, e :c:func:`PyErr_Clear` limpa o estado da exceção.

source: The full exception state consists of three objects (all of which can be ``NULL``): the exception type, the corresponding exception value, and the traceback. These have the same meanings as the Python result of ``sys.exc_info()``; however, they are not the same: the Python objects represent the last exception being handled by a Python :keyword:`try` ... :keyword:`except` statement, while the C level exception state only exists while an exception is being passed on between C functions until it reaches the Python bytecode interpreter's main loop, which takes care of transferring it to ``sys.exc_info()`` and friends.
pt_br: O estado de exceção completo consiste em três objetos (todos os quais podem ser ``NULL``): o tipo de exceção, o valor de exceção correspondente e o traceback. Eles têm os mesmos significados que o resultado no Python de ``sys.exc_info()``; no entanto, eles não são os mesmos: os objetos Python representam a última exceção sendo tratada por uma instrução Python :keyword:`try` ... :keyword:`except`, enquanto o estado de exceção de nível C só existe enquanto uma exceção está sendo transmitido entre funções C até atingir o laço de repetição principal do interpretador de bytecode Python, que se encarrega de transferi-lo para ``sys.exc_info()`` e amigos.

source: Note that starting with Python 1.5, the preferred, thread-safe way to access the exception state from Python code is to call the function :func:`sys.exc_info`, which returns the per-thread exception state for Python code. Also, the semantics of both ways to access the exception state have changed so that a function which catches an exception will save and restore its thread's exception state so as to preserve the exception state of its caller. This prevents common bugs in exception handling code caused by an innocent-looking function overwriting the exception being handled; it also reduces the often unwanted lifetime extension for objects that are referenced by the stack frames in the traceback.
pt_br: Observe que a partir do Python 1.5, a maneira preferida e segura para thread para acessar o estado de exceção do código Python é chamar a função :func:`sys.exc_info`, que retorna o estado de exceção por thread para o código Python. Além disso, a semântica de ambas as maneiras de acessar o estado de exceção mudou, de modo que uma função que captura uma exceção salvará e restaurará o estado de exceção de seu segmento de modo a preservar o estado de exceção de seu chamador. Isso evita bugs comuns no código de tratamento de exceções causados por uma função aparentemente inocente sobrescrevendo a exceção sendo tratada; também reduz a extensão da vida útil frequentemente indesejada para objetos que são referenciados pelos quadros de pilha no traceback.

source: As a general principle, a function that calls another function to perform some task should check whether the called function raised an exception, and if so, pass the exception state on to its caller. It should discard any object references that it owns, and return an error indicator, but it should *not* set another exception --- that would overwrite the exception that was just raised, and lose important information about the exact cause of the error.
pt_br: Como princípio geral, uma função que chama outra função para realizar alguma tarefa deve verificar se a função chamada levantou uma exceção e, em caso afirmativo, passar o estado da exceção para seu chamador. Ele deve descartar todas as referências de objeto que possui e retornar um indicador de erro, mas *não* deve definir outra exceção --- que sobrescreveria a exceção que acabou de ser gerada e perderia informações importantes sobre a causa exata do erro.

source: A simple example of detecting exceptions and passing them on is shown in the :c:func:`!sum_sequence` example above. It so happens that this example doesn't need to clean up any owned references when it detects an error. The following example function shows some error cleanup. First, to remind you why you like Python, we show the equivalent Python code::
pt_br: Um exemplo simples de detecção de exceções e transmiti-las é mostrado no exemplo :c:func:`!sum_sequence` acima. Acontece que este exemplo não precisa limpar nenhuma referência de propriedade quando detecta um erro. A função de exemplo a seguir mostra alguma limpeza de erro. Primeiro, para lembrar por que você gosta de Python, mostramos o código Python equivalente::

source: Here is the corresponding C code, in all its glory::
pt_br: Aqui está o código C correspondente, em toda sua glória::

source: int incr_item(PyObject *dict, PyObject *key) { /* Objects all initialized to NULL for Py_XDECREF */ PyObject *item = NULL, *const_one = NULL, *incremented_item = NULL; int rv = -1; /* Return value initialized to -1 (failure) */ item = PyObject_GetItem(dict, key); if (item == NULL) { /* Handle KeyError only: */ if (!PyErr_ExceptionMatches(PyExc_KeyError)) goto error; /* Clear the error and use zero: */ PyErr_Clear(); item = PyLong_FromLong(0L); if (item == NULL) goto error; } const_one = PyLong_FromLong(1L); if (const_one == NULL) goto error; incremented_item = PyNumber_Add(item, const_one); if (incremented_item == NULL) goto error; if (PyObject_SetItem(dict, key, incremented_item) < 0) goto error; rv = 0; /* Success */ /* Continue with cleanup code */ error: /* Cleanup code, shared by success and failure path */ /* Use Py_XDECREF() to ignore NULL references */ Py_XDECREF(item); Py_XDECREF(const_one); Py_XDECREF(incremented_item); return rv; /* -1 for error, 0 for success */ }
pt_br: int incr_item(PyObject *dict, PyObject *key) { /* Objetos todos inicializados para NULL para Py_XDECREF */ PyObject *item = NULL, *const_one = NULL, *incremented_item = NULL; int rv = -1; /* Retorna valor inicializado para -1 (falha) */ item = PyObject_GetItem(dict, key); if (item == NULL) { /* Trata de KeyError apenas: */ if (!PyErr_ExceptionMatches(PyExc_KeyError)) goto error; /* Limpa o erro e usa zero: */ PyErr_Clear(); item = PyLong_FromLong(0L); if (item == NULL) goto error; } const_one = PyLong_FromLong(1L); if (const_one == NULL) goto error; incremented_item = PyNumber_Add(item, const_one); if (incremented_item == NULL) goto error; if (PyObject_SetItem(dict, key, incremented_item) < 0) goto error; rv = 0; /* Success */ /* Continua com o código de limpeza */ error: /* Código de limpeza, compartilhado pelo caminho sucesso e falha */ /* Usa Py_XDECREF() para ignorar referências NULL */ Py_XDECREF(item); Py_XDECREF(const_one); Py_XDECREF(incremented_item); return rv; /* -1 para erro, 0 para sucesso */ }

source: This example represents an endorsed use of the ``goto`` statement in C! It illustrates the use of :c:func:`PyErr_ExceptionMatches` and :c:func:`PyErr_Clear` to handle specific exceptions, and the use of :c:func:`Py_XDECREF` to dispose of owned references that may be ``NULL`` (note the ``'X'`` in the name; :c:func:`Py_DECREF` would crash when confronted with a ``NULL`` reference). It is important that the variables used to hold owned references are initialized to ``NULL`` for this to work; likewise, the proposed return value is initialized to ``-1`` (failure) and only set to success after the final call made is successful.
pt_br: Este exemplo representa um uso endossado da instrução ``goto`` em C! Ele ilustra o uso de :c:func:`PyErr_ExceptionMatches` e :c:func:`PyErr_Clear` para lidar com exceções específicas, e o uso de :c:func:`Py_XDECREF` para descartar referências de propriedade que podem ser ``NULL`` (observe o ``'X'`` no nome; :c:func:`Py_DECREF` travaria quando confrontado com uma referência ``NULL``). É importante que as variáveis usadas para manter as referências de propriedade sejam inicializadas com ``NULL`` para que isso funcione; da mesma forma, o valor de retorno proposto é inicializado para ``-1`` (falha) e apenas definido para sucesso após a chamada final feita ser bem sucedida.

source: Embedding Python
pt_br: Incorporando Python

source: The one important task that only embedders (as opposed to extension writers) of the Python interpreter have to worry about is the initialization, and possibly the finalization, of the Python interpreter. Most functionality of the interpreter can only be used after the interpreter has been initialized.
pt_br: A única tarefa importante com a qual apenas os incorporadores (em oposição aos escritores de extensão) do interpretador Python precisam se preocupar é a inicialização e, possivelmente, a finalização do interpretador Python. A maior parte da funcionalidade do interpretador só pode ser usada após a inicialização do interpretador.

source: The basic initialization function is :c:func:`Py_Initialize`. This initializes the table of loaded modules, and creates the fundamental modules :mod:`builtins`, :mod:`__main__`, and :mod:`sys`. It also initializes the module search path (``sys.path``).
pt_br: A função de inicialização básica é :c:func:`Py_Initialize`. Isso inicializa a tabela de módulos carregados e cria os módulos fundamentais :mod:`builtins`, :mod:`__main__` e :mod:`sys`. Ela também inicializa o caminho de pesquisa de módulos (``sys.path``).

source: :c:func:`Py_Initialize` does not set the "script argument list" (``sys.argv``). If this variable is needed by Python code that will be executed later, setting :c:member:`PyConfig.argv` and :c:member:`PyConfig.parse_argv` must be set: see :ref:`Python Initialization Configuration <init-config>`.
pt_br: :c:func:`Py_Initialize` não define a "lista de argumentos de script" (``sys.argv``). Se esta variável for necessária para o código Python que será executado posteriormente, :c:member:`PyConfig.argv` e :c:member:`PyConfig.parse_argv` devem estar definidas; veja :ref:`Configuração de inicialização do Python <init-config>`.

source: On most systems (in particular, on Unix and Windows, although the details are slightly different), :c:func:`Py_Initialize` calculates the module search path based upon its best guess for the location of the standard Python interpreter executable, assuming that the Python library is found in a fixed location relative to the Python interpreter executable. In particular, it looks for a directory named :file:`lib/python{X.Y}` relative to the parent directory where the executable named :file:`python` is found on the shell command search path (the environment variable :envvar:`PATH`).
pt_br: Na maioria dos sistemas (em particular, no Unix e no Windows, embora os detalhes sejam ligeiramente diferentes), :c:func:`Py_Initialize` calcula o caminho de pesquisa de módulos com base em sua melhor estimativa para a localização do executável do interpretador Python padrão, presumindo que a biblioteca Python é encontrada em um local fixo em relação ao executável do interpretador Python. Em particular, ele procura por um diretório chamado :file:`lib/python{X.Y}` relativo ao diretório pai onde o executável chamado :file:`python` é encontrado no caminho de pesquisa de comandos do shell (a variável de ambiente :envvar:`PATH`).

source: For instance, if the Python executable is found in :file:`/usr/local/bin/python`, it will assume that the libraries are in :file:`/usr/local/lib/python{X.Y}`. (In fact, this particular path is also the "fallback" location, used when no executable file named :file:`python` is found along :envvar:`PATH`.) The user can override this behavior by setting the environment variable :envvar:`PYTHONHOME`, or insert additional directories in front of the standard path by setting :envvar:`PYTHONPATH`.
pt_br: Por exemplo, se o executável Python for encontrado em :file:`/usr/local/bin/python`, ele presumirá que as bibliotecas estão em :file:`/usr/local/lib/python{X.Y}`. (Na verdade, este caminho particular também é o local reserva, usado quando nenhum arquivo executável chamado :file:`python` é encontrado ao longo de :envvar:`PATH`.) O usuário pode substituir este comportamento definindo a variável de ambiente :envvar:`PYTHONHOME`, ou insira diretórios adicionais na frente do caminho padrão definindo :envvar:`PYTHONPATH`.

source: The embedding application can steer the search by setting :c:member:`PyConfig.program_name` *before* calling :c:func:`Py_InitializeFromConfig`. Note that :envvar:`PYTHONHOME` still overrides this and :envvar:`PYTHONPATH` is still inserted in front of the standard path. An application that requires total control has to provide its own implementation of :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, and :c:func:`Py_GetProgramFullPath` (all defined in :file:`Modules/getpath.c`).
pt_br: A aplicação de incorporação pode orientar a pesquisa definindo :c:member:`PyConfig.program_name` *antes* de chamar :c:func:`Py_InitializeFromConfig`. Observe que :envvar:`PYTHONHOME` ainda substitui isso e :envvar:`PYTHONPATH` ainda é inserido na frente do caminho padrão. Uma aplicação que requer controle total deve fornecer sua própria implementação de :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix` e :c:func:`Py_GetProgramFullPath` (todas definidas em :file:`Modules/getpath.c`).

source: Sometimes, it is desirable to "uninitialize" Python. For instance, the application may want to start over (make another call to :c:func:`Py_Initialize`) or the application is simply done with its use of Python and wants to free memory allocated by Python. This can be accomplished by calling :c:func:`Py_FinalizeEx`. The function :c:func:`Py_IsInitialized` returns true if Python is currently in the initialized state. More information about these functions is given in a later chapter. Notice that :c:func:`Py_FinalizeEx` does *not* free all memory allocated by the Python interpreter, e.g. memory allocated by extension modules currently cannot be released.
pt_br: Às vezes, é desejável "desinicializar" o Python. Por exemplo, a aplicação pode querer iniciar novamente (fazer outra chamada para :c:func:`Py_Initialize`) ou a aplicação simplesmente termina com o uso de Python e deseja liberar memória alocada pelo Python. Isso pode ser feito chamando :c:func:`Py_FinalizeEx`. A função :c:func:`Py_IsInitialized` retorna verdadeiro se o Python está atualmente no estado inicializado. Mais informações sobre essas funções são fornecidas em um capítulo posterior. Observe que :c:func:`Py_FinalizeEx` *não* libera toda a memória alocada pelo interpretador Python, por exemplo, a memória alocada por módulos de extensão atualmente não pode ser liberada.

source: Debugging Builds
pt_br: Compilações de depuração

source: Python can be built with several macros to enable extra checks of the interpreter and extension modules. These checks tend to add a large amount of overhead to the runtime so they are not enabled by default.
pt_br: Python pode ser compilado com várias macros para permitir verificações extras do interpretador e módulos de extensão. Essas verificações tendem a adicionar uma grande quantidade de sobrecarga ao tempo de execução, portanto, não são habilitadas por padrão.

source: A full list of the various types of debugging builds is in the file :file:`Misc/SpecialBuilds.txt` in the Python source distribution. Builds are available that support tracing of reference counts, debugging the memory allocator, or low-level profiling of the main interpreter loop. Only the most frequently used builds will be described in the remainder of this section.
pt_br: Uma lista completa dos vários tipos de compilações de depuração está no arquivo :file:`Misc/SpecialBuilds.txt` na distribuição do código-fonte do Python. Estão disponíveis compilações que oferecem suporte ao rastreamento de contagens de referências, depuração do alocador de memória ou criação de perfil de baixo nível do laço do interpretador principal. Apenas as compilações usadas com mais frequência serão descritas no restante desta seção.

source: Compiling the interpreter with the :c:macro:`!Py_DEBUG` macro defined produces what is generally meant by :ref:`a debug build of Python <debug-build>`. :c:macro:`!Py_DEBUG` is enabled in the Unix build by adding :option:`--with-pydebug` to the :file:`./configure` command. It is also implied by the presence of the not-Python-specific :c:macro:`!_DEBUG` macro. When :c:macro:`!Py_DEBUG` is enabled in the Unix build, compiler optimization is disabled.
pt_br: Compilar o interpretador com a macro :c:macro:`!Py_DEBUG` definida produz o que geralmente se entende por :ref:`uma construção de depuração do Python <debug-build>`. :c:macro:`!Py_DEBUG` é habilitada na construção Unix adicionando :option:`--with-pydebug` ao comando :file:`./configure`. Também está implícito na presença da macro não específica do Python :c:macro:`!_DEBUG`. Quando :c:macro:`!Py_DEBUG` está habilitado na construção do Unix, a otimização do compilador é desabilitada.

source: In addition to the reference count debugging described below, extra checks are performed, see :ref:`Python Debug Build <debug-build>`.
pt_br: Além da depuração de contagem de referências descrita abaixo, verificações extras são realizadas, consulte :ref:`Compilação de Depuração do Python <debug-build>`.

source: Defining :c:macro:`Py_TRACE_REFS` enables reference tracing (see the :option:`configure --with-trace-refs option <--with-trace-refs>`). When defined, a circular doubly linked list of active objects is maintained by adding two extra fields to every :c:type:`PyObject`. Total allocations are tracked as well. Upon exit, all existing references are printed. (In interactive mode this happens after every statement run by the interpreter.)
pt_br: Definir :c:macro:`Py_TRACE_REFS` habilita o rastreamento de referência (veja a opção :option:`opção --with-trace-refs de configure <--with-trace-refs>`). Quando definida, uma lista circular duplamente vinculada de objetos ativos é mantida adicionando dois campos extras a cada :c:type:`PyObject`. As alocações totais também são rastreadas. Ao sair, todas as referências existentes são impressas. (No modo interativo, isso acontece após cada instrução executada pelo interpretador.)

source: Please refer to :file:`Misc/SpecialBuilds.txt` in the Python source distribution for more detailed information.
pt_br: Consulte :file:`Misc/SpecialBuilds.txt` na distribuição do código-fonte Python para informações mais detalhadas.

source: Recommended third party tools
pt_br: Ferramentas de terceiros recomendadas

source: The following third party tools offer both simpler and more sophisticated approaches to creating C, C++ and Rust extensions for Python:
pt_br: As seguintes ferramentas de terceiros oferecem abordagens mais simples e mais sofisticadas para criar extensões C, C++ e Rust para Python:

source: Using tools such as these can help avoid writing code that is tightly bound to a particular version of CPython, avoid reference counting errors, and focus more on your own code than on using the CPython API. In general, new versions of Python can be supported by updating the tool, and your code will often use newer and more efficient APIs automatically. Some tools also support compiling for other implementations of Python from a single set of sources.
pt_br: O uso de ferramentas como essas pode ajudar a evitar a criação de código estritamente vinculado a uma versão específica do CPython, evitar erros de contagem de referências e focar mais no seu próprio código do que em usar a API do CPython. Em geral, novas versões do Python podem ser suportadas atualizando a ferramenta, e seu código frequentemente usará APIs mais novas e eficientes automaticamente. Algumas ferramentas também oferecem suporte à compilação para outras implementações do Python a partir de um único conjunto de fontes.

source: These projects are not supported by the same people who maintain Python, and issues need to be raised with the projects directly. Remember to check that the project is still maintained and supported, as the list above may become outdated.
pt_br: Esses projetos não são suportados pelas mesmas pessoas que mantêm o Python, e quaisquer problemas precisam ser relatados diretamente aos projetos. Lembre-se de verificar se o projeto ainda é mantido e tem suporte, pois a lista acima pode ficar desatualizada.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/guides/packaging-binary-extensions/>`_
pt_br: `Guia do Usuário de Empacotamento do Python: Extensões Binárias <https://packaging.python.org/guides/packaging-binary-extensions/>`_

source: The Python Packaging User Guide not only covers several available tools that simplify the creation of binary extensions, but also discusses the various reasons why creating an extension module may be desirable in the first place.
pt_br: O Guia do Usuário de Empacotamento do Python não abrange apenas várias ferramentas disponíveis que simplificam a criação de extensões binárias, mas também discute os vários motivos pelos quais a criação de um módulo de extensão pode ser desejável em primeiro lugar.

source: object
pt_br: objeto

source: type
pt_br: tipo

source: Py_INCREF (C function)
pt_br: Py_INCREF (função C)
