Repository: python/python-docs-pt-br
Catalog: c-api/intro.po
Languages: pt_br

source: Py_DECREF (C function)
pt_br: Py_DECREF (função C)

source: PyList_SetItem (C function)
pt_br: PyList_SetItem (função C)

source: PyTuple_SetItem (C function)
pt_br: PyTuple_SetItem (função C)

source: PyList_GetItem (C function)
pt_br: PyList_GetItem (função C)

source: PySequence_GetItem (C function)
pt_br: PySequence_GetItem (função C)

source: PyErr_Occurred (C function)
pt_br: PyErr_Occurred (função C)

source: PyErr_SetString (C function)
pt_br: PyErr_SetString (função C)

source: PyErr_Clear (C function)
pt_br: PyErr_Clear (função C)

source: exc_info (in module sys)
pt_br: exc_info (no módulo sys)

source: PyErr_ExceptionMatches (C function)
pt_br: PyErr_ExceptionMatches (função C)

source: Py_XDECREF (C function)
pt_br: Py_XDECREF (função C)

source: Py_Initialize (C function)
pt_br: Py_Initialize (função C)

source: module
pt_br: módulo

source: search
pt_br: pesquisa

source: path
pt_br: caminho

source: path (in module sys)
pt_br: path (no módulo sys)

source: Py_GetPath (C function)
pt_br: Py_GetPath (função C)

source: Py_GetPrefix (C function)
pt_br: Py_GetPrefix (função C)

source: Py_GetExecPrefix (C function)
pt_br: Py_GetExecPrefix (função C)

source: Py_GetProgramFullPath (C function)
pt_br: Py_GetProgramFullPath (função C)

source: Py_IsInitialized (C function)
pt_br: Py_IsInitialized (função C)
