Repository: python/python-docs-pt-br
Catalog: c-api/intro.po
Languages: pt_br

source: The reference count is important because today's computers have a finite (and often severely limited) memory size; it counts how many different places there are that have a :term:`strong reference` to an object. Such a place could be another object, or a global (or static) C variable, or a local variable in some C function. When the last :term:`strong reference` to an object is released (i.e. its reference count becomes zero), the object is deallocated. If it contains references to other objects, those references are released. Those other objects may be deallocated in turn, if there are no more references to them, and so on. (There's an obvious problem with objects that reference each other here; for now, the solution is "don't do that.")
pt_br: A contagem de referências é importante porque os computadores atuais têm um tamanho de memória finito (e frequentemente severamente limitado); ela conta quantos lugares diferentes existem que possuem uma :term:`referência forte` a um objeto. Tal lugar pode ser outro objeto, ou uma variável C global (ou estática), ou uma variável local em alguma função C. Quando a última :term:`referência forte` a um objeto é liberada (ou seja, sua contagem de referências se torna zero), o objeto é desalocado. Se ele contiver referências a outros objetos, essas referências são liberadas. Esses outros objetos podem ser desalocados por sua vez, se não houver mais referências a eles, e assim por diante. (Há um problema óbvio com objetos que referenciam uns aos outros aqui; por enquanto, a solução é "não faça isso".)

source: Reference counts are always manipulated explicitly. The normal way is to use the macro :c:func:`Py_INCREF` to take a new reference to an object (i.e. increment its reference count by one), and :c:func:`Py_DECREF` to release that reference (i.e. decrement the reference count by one). The :c:func:`Py_DECREF` macro is considerably more complex than the incref one, since it must check whether the reference count becomes zero and then cause the object's deallocator to be called. The deallocator is a function pointer contained in the object's type structure. The type-specific deallocator takes care of releasing references for other objects contained in the object if this is a compound object type, such as a list, as well as performing any additional finalization that's needed. There's no chance that the reference count can overflow; at least as many bits are used to hold the reference count as there are distinct memory locations in virtual memory (assuming ``sizeof(Py_ssize_t) >= sizeof(void*)``). Thus, the reference count increment is a simple operation.
pt_br: Contagens de referências são sempre manipuladas explicitamente. A maneira normal é usar a macro :c:func:`Py_INCREF` para obter uma nova referência a um objeto (ou seja, incrementar sua contagem de referências em um), e :c:func:`Py_DECREF` para liberar essa referência (ou seja, decrementar a contagem de referências em um). A macro :c:func:`Py_DECREF` é consideravelmente mais complexa do que a incref, pois deve verificar se a contagem de referências se torna zero e, em seguida, fazer com que o desalocador do objeto seja chamado. O desalocador é um ponteiro para função contido na estrutura de tipo do objeto. O desalocador específico do tipo cuida da liberação de referências para outros objetos contidos no objeto se este for um tipo de objeto composto, como uma lista, bem como de executar qualquer finalização adicional necessária. Não há chance de a contagem de referências transbordar; pelo menos tantos bits são usados para armazenar a contagem de referência quantos forem os locais de memória distintos na memória virtual (presumindo ``sizeof(Py_ssize_t) >= sizeof(void*)``). Portanto, o incremento da contagem de referências é uma operação simples.

source: It is not necessary to hold a :term:`strong reference` (i.e. increment the reference count) for every local variable that contains a pointer to an object. In theory, the object's reference count goes up by one when the variable is made to point to it and it goes down by one when the variable goes out of scope. However, these two cancel each other out, so at the end the reference count hasn't changed. The only real reason to use the reference count is to prevent the object from being deallocated as long as our variable is pointing to it. If we know that there is at least one other reference to the object that lives at least as long as our variable, there is no need to take a new :term:`strong reference` (i.e. increment the reference count) temporarily. An important situation where this arises is in objects that are passed as arguments to C functions in an extension module that are called from Python; the call mechanism guarantees to hold a reference to every argument for the duration of the call.
pt_br: Não é necessário manter uma :term:`referência forte` (ou seja, incrementar a contagem de referências) para cada variável local que contém um ponteiro para um objeto. Em teoria, a contagem de referências do objeto aumenta em um quando a variável é feita para apontar para ele e diminui em um quando a variável sai do escopo. No entanto, esses dois se cancelam, portanto, no final, a contagem de referências não mudou. A única razão real para usar a contagem de referências é evitar que o objeto seja desalocado enquanto nossa variável estiver apontando para ele. Se sabemos que existe pelo menos uma outra referência ao objeto que vive pelo menos tanto quanto nossa variável, não há necessidade de tomar uma nova :term:`referência forte` (ou seja, incrementar a contagem de referências) temporariamente. Uma situação importante em que isso ocorre é em objetos que são passados como argumentos para funções C em um módulo de extensão que são chamados de Python; o mecanismo de chamada garante manter uma referência a todos os argumentos durante a chamada.

source: However, a common pitfall is to extract an object from a list and hold on to it for a while without taking a new reference. Some other operation might conceivably remove the object from the list, releasing that reference, and possibly deallocating it. The real danger is that innocent-looking operations may invoke arbitrary Python code which could do this; there is a code path which allows control to flow back to the user from a :c:func:`Py_DECREF`, so almost any operation is potentially dangerous.
pt_br: No entanto, uma armadilha comum é extrair um objeto de uma lista e mantê-lo por um tempo, sem tomar uma nova referência. Alguma outra operação poderia remover o objeto da lista, liberando essa referência e possivelmente desalocando-o. O perigo real é que operações aparentemente inocentes podem invocar código Python arbitrário que poderia fazer isso; existe um caminho de código que permite que o controle flua de volta para o usuário a partir de um :c:func:`Py_DECREF`, então quase qualquer operação é potencialmente perigosa.

source: A safe approach is to always use the generic operations (functions whose name begins with ``PyObject_``, ``PyNumber_``, ``PySequence_`` or ``PyMapping_``). These operations always create a new :term:`strong reference` (i.e. increment the reference count) of the object they return. This leaves the caller with the responsibility to call :c:func:`Py_DECREF` when they are done with the result; this soon becomes second nature.
pt_br: Uma abordagem segura é sempre usar as operações genéricas (funções cujo nome começa com ``PyObject_``, ``PyNumber_``, ``PySequence_`` ou ``PyMapping_``). Essas operações sempre criam uma nova :term:`referência forte` (ou seja, incrementam a contagem de referências) do objeto que retornam. Isso deixa o chamador com a responsabilidade de chamar :c:func:`Py_DECREF` quando terminar com o resultado; isso logo se torna uma segunda natureza.

source: Reference Count Details
pt_br: Detalhes da contagem de referências

source: The reference count behavior of functions in the Python/C API is best explained in terms of *ownership of references*. Ownership pertains to references, never to objects (objects are not owned: they are always shared). "Owning a reference" means being responsible for calling Py_DECREF on it when the reference is no longer needed. Ownership can also be transferred, meaning that the code that receives ownership of the reference then becomes responsible for eventually releasing it by calling :c:func:`Py_DECREF` or :c:func:`Py_XDECREF` when it's no longer needed---or passing on this responsibility (usually to its caller). When a function passes ownership of a reference on to its caller, the caller is said to receive a *new* reference. When no ownership is transferred, the caller is said to *borrow* the reference. Nothing needs to be done for a :term:`borrowed reference`.
pt_br: O comportamento da contagem de referências de funções na API C/Python é melhor explicado em termos de *propriedade de referências*. A propriedade pertence às referências, nunca aos objetos (os objetos não são possuídos: eles são sempre compartilhados). "Possuir uma referência" significa ser responsável por chamar Py_DECREF nela quando a referência não for mais necessária. A propriedade também pode ser transferida, o que significa que o código que recebe a propriedade da referência torna-se responsável por eventualmente efetuar um liberando ela chamando :c:func:`Py_DECREF` ou :c:func:`Py_XDECREF` quando não é mais necessário -- ou passando essa responsabilidade (geralmente para o responsável pela chamada). Quando uma função passa a propriedade de uma referência para seu chamador, diz-se que o chamador recebe uma *nova* referência. Quando nenhuma propriedade é transferida, diz-se que o chamador *toma emprestado* a referência. Nada precisa ser feito para uma :term:`referência emprestada`.

source: Conversely, when a calling function passes in a reference to an object, there are two possibilities: the function *steals* a reference to the object, or it does not. *Stealing a reference* means that when you pass a reference to a function, that function assumes that it now owns that reference, and you are not responsible for it any longer.
pt_br: Por outro lado, quando uma função de chamada passa uma referência a um objeto, há duas possibilidades: a função *rouba* uma referência ao objeto, ou não. *Roubar uma referência* significa que quando você passa uma referência para uma função, essa função presume que agora ela possui essa referência e você não é mais responsável por ela.

source: Few functions steal references; the two notable exceptions are :c:func:`PyList_SetItem` and :c:func:`PyTuple_SetItem`, which steal a reference to the item (but not to the tuple or list into which the item is put!). These functions were designed to steal a reference because of a common idiom for populating a tuple or list with newly created objects; for example, the code to create the tuple ``(1, 2, "three")`` could look like this (forgetting about error handling for the moment; a better way to code this is shown below)::
pt_br: Poucas funções roubam referências; as duas exceções notáveis são :c:func:`PyList_SetItem` e :c:func:`PyTuple_SetItem`, que roubam uma referência para o item (mas não para a tupla ou lista na qual o item é colocado!). Essas funções foram projetadas para roubar uma referência devido a um idioma comum para preencher uma tupla ou lista com objetos recém-criados; por exemplo, o código para criar a tupla ``(1, 2, "three")`` pode ser parecido com isto (esquecendo o tratamento de erros por enquanto; uma maneira melhor de codificar isso é mostrada abaixo)::

source: PyObject *t; t = PyTuple_New(3); PyTuple_SetItem(t, 0, PyLong_FromLong(1L)); PyTuple_SetItem(t, 1, PyLong_FromLong(2L)); PyTuple_SetItem(t, 2, PyUnicode_FromString("three"));
pt_br: PyObject *t; t = PyTuple_New(3); PyTuple_SetItem(t, 0, PyLong_FromLong(1L)); PyTuple_SetItem(t, 1, PyLong_FromLong(2L)); PyTuple_SetItem(t, 2, PyUnicode_FromString("três"));

source: Here, :c:func:`PyLong_FromLong` returns a new reference which is immediately stolen by :c:func:`PyTuple_SetItem`. When you want to keep using an object although the reference to it will be stolen, use :c:func:`Py_INCREF` to grab another reference before calling the reference-stealing function.
pt_br: Aqui, :c:func:`PyLong_FromLong` retorna uma nova referência que é imediatamente roubada por :c:func:`PyTuple_SetItem`. Quando você quiser continuar usando um objeto, embora a referência a ele seja roubada, use :c:func:`Py_INCREF` para obter outra referência antes de chamar a função de roubo de referência.

source: Incidentally, :c:func:`PyTuple_SetItem` is the *only* way to set tuple items; :c:func:`PySequence_SetItem` and :c:func:`PyObject_SetItem` refuse to do this since tuples are an immutable data type. You should only use :c:func:`PyTuple_SetItem` for tuples that you are creating yourself.
pt_br: A propósito, :c:func:`PyTuple_SetItem` é a *única* maneira de definir itens de tupla; :c:func:`PySequence_SetItem` e :c:func:`PyObject_SetItem` se recusam a fazer isso, pois tuplas são um tipo de dados imutável. Você só deve usar :c:func:`PyTuple_SetItem` para tuplas que você mesmo está criando.

source: Equivalent code for populating a list can be written using :c:func:`PyList_New` and :c:func:`PyList_SetItem`.
pt_br: O código equivalente para preencher uma lista pode ser escrita usando :c:func:`PyList_New` e :c:func:`PyList_SetItem`.

source: However, in practice, you will rarely use these ways of creating and populating a tuple or list. There's a generic function, :c:func:`Py_BuildValue`, that can create most common objects from C values, directed by a :dfn:`format string`. For example, the above two blocks of code could be replaced by the following (which also takes care of the error checking)::
pt_br: No entanto, na prática, você raramente usará essas maneiras de criar e preencher uma tupla ou lista. Existe uma função genérica, :c:func:`Py_BuildValue`, que pode criar objetos mais comuns a partir de valores C, dirigidos por uma :dfn:`string de formato`. Por exemplo, os dois blocos de código acima podem ser substituídos pelos seguintes (que também cuidam da verificação de erros)::

source: PyObject *tuple, *list; tuple = Py_BuildValue("(iis)", 1, 2, "three"); list = Py_BuildValue("[iis]", 1, 2, "three");
pt_br: PyObject *tuple, *list; tuple = Py_BuildValue("(iis)", 1, 2, "três"); list = Py_BuildValue("[iis]", 1, 2, "três");

source: It is much more common to use :c:func:`PyObject_SetItem` and friends with items whose references you are only borrowing, like arguments that were passed in to the function you are writing. In that case, their behaviour regarding references is much saner, since you don't have to take a new reference just so you can give that reference away ("have it be stolen"). For example, this function sets all items of a list (actually, any mutable sequence) to a given item::
pt_br: É muito mais comum usar :c:func:`PyObject_SetItem` e amigos com itens cujas referências você está apenas pegando emprestado, como argumentos que foram passados para a função que você está escrevendo. Nesse caso, o comportamento deles em relação às referências é muito mais são, já que você não precisa tomar uma nova referência só para poder doá-la ("mande-a ser roubada"). Por exemplo, esta função define todos os itens de uma lista (na verdade, qualquer sequência mutável) para um determinado item::

source: The situation is slightly different for function return values. While passing a reference to most functions does not change your ownership responsibilities for that reference, many functions that return a reference to an object give you ownership of the reference. The reason is simple: in many cases, the returned object is created on the fly, and the reference you get is the only reference to the object. Therefore, the generic functions that return object references, like :c:func:`PyObject_GetItem` and :c:func:`PySequence_GetItem`, always return a new reference (the caller becomes the owner of the reference).
pt_br: A situação é ligeiramente diferente para os valores de retorno da função. Embora passar uma referência para a maioria das funções não altere suas responsabilidades de propriedade para aquela referência, muitas funções que retornam uma referência a um objeto fornecem a propriedade da referência. O motivo é simples: em muitos casos, o objeto retornado é criado instantaneamente e a referência que você obtém é a única referência ao objeto. Portanto, as funções genéricas que retornam referências a objetos, como :c:func:`PyObject_GetItem` e :c:func:`PySequence_GetItem`, sempre retornam uma nova referência (o chamador torna-se o dono da referência).

source: It is important to realize that whether you own a reference returned by a function depends on which function you call only --- *the plumage* (the type of the object passed as an argument to the function) *doesn't enter into it!* Thus, if you extract an item from a list using :c:func:`PyList_GetItem`, you don't own the reference --- but if you obtain the same item from the same list using :c:func:`PySequence_GetItem` (which happens to take exactly the same arguments), you do own a reference to the returned object.
pt_br: É importante perceber que se você possui uma referência retornada por uma função depende de qual função você chama apenas --- *a plumagem* (o tipo do objeto passado como um argumento para a função) *não entra nela!* Assim, se você extrair um item de uma lista usando :c:func:`PyList_GetItem`, você não possui a referência --- mas se obtiver o mesmo item da mesma lista usando :c:func:`PySequence_GetItem` (que leva exatamente os mesmos argumentos), você possui uma referência ao objeto retornado.

source: Here is an example of how you could write a function that computes the sum of the items in a list of integers; once using :c:func:`PyList_GetItem`, and once using :c:func:`PySequence_GetItem`. ::
pt_br: Aqui está um exemplo de como você poderia escrever uma função que calcula a soma dos itens em uma lista de inteiros; uma vez usando :c:func:`PyList_GetItem`, e uma vez usando :c:func:`PySequence_GetItem`. ::

source: long sum_list(PyObject *list) { Py_ssize_t i, n; long total = 0, value; PyObject *item; n = PyList_Size(list); if (n < 0) return -1; /* Not a list */ for (i = 0; i < n; i++) { item = PyList_GetItem(list, i); /* Can't fail */ if (!PyLong_Check(item)) continue; /* Skip non-integers */ value = PyLong_AsLong(item); if (value == -1 && PyErr_Occurred()) /* Integer too big to fit in a C long, bail out */ return -1; total += value; } return total; }
pt_br: long sum_list(PyObject *list) { Py_ssize_t i, n; long total = 0, value; PyObject *item; n = PyList_Size(list); if (n < 0) return -1; /* Não é uma lista */ for (i = 0; i < n; i++) { item = PyList_GetItem(list, i); /* Não pode falhar */ if (!PyLong_Check(item)) continue; /* Ignora não-inteiros */ value = PyLong_AsLong(item); if (value == -1 && PyErr_Occurred()) /* Inteiro muito grande para caber em um C longo, sai */ return -1; total += value; } return total; }

source: long sum_sequence(PyObject *sequence) { Py_ssize_t i, n; long total = 0, value; PyObject *item; n = PySequence_Length(sequence); if (n < 0) return -1; /* Has no length */ for (i = 0; i < n; i++) { item = PySequence_GetItem(sequence, i); if (item == NULL) return -1; /* Not a sequence, or other failure */ if (PyLong_Check(item)) { value = PyLong_AsLong(item); Py_DECREF(item); if (value == -1 && PyErr_Occurred()) /* Integer too big to fit in a C long, bail out */ return -1; total += value; } else { Py_DECREF(item); /* Discard reference ownership */ } } return total; }
pt_br: long sum_sequence(PyObject *sequence) { Py_ssize_t i, n; long total = 0, value; PyObject *item; n = PySequence_Length(sequence); if (n < 0) return -1; /* Não tem comprimento */ for (i = 0; i < n; i++) { item = PySequence_GetItem(sequence, i); if (item == NULL) return -1; /* Não é uma sequência ou outra falha */ if (PyLong_Check(item)) { value = PyLong_AsLong(item); Py_DECREF(item); if (value == -1 && PyErr_Occurred()) /* Inteiro muito grande para caber em um C longo, sai */ return -1; total += value; } else { Py_DECREF(item); /* Descartar propriedade de referência */ } } return total; }

source: Types
pt_br: Tipos

source: There are few other data types that play a significant role in the Python/C API; most are simple C types such as :c:expr:`int`, :c:expr:`long`, :c:expr:`double` and :c:expr:`char*`. A few structure types are used to describe static tables used to list the functions exported by a module or the data attributes of a new object type, and another is used to describe the value of a complex number. These will be discussed together with the functions that use them.
pt_br: Existem alguns outros tipos de dados que desempenham um papel significativo na API Python/C; a maioria são tipos C simples, como :c:expr:`int`, :c:expr:`long`, :c:expr:`double` e :c:expr:`char*`. Alguns tipos de estrutura são usados para descrever tabelas estáticas usadas para listar as funções exportadas por um módulo ou os atributos de dados de um novo tipo de objeto, e outro é usado para descrever o valor de um número complexo. Eles serão discutidos junto com as funções que os utilizam.

source: A signed integral type such that ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 doesn't define such a thing directly (size_t is an unsigned integral type). See :pep:`353` for details. ``PY_SSIZE_T_MAX`` is the largest positive value of type :c:type:`Py_ssize_t`.
pt_br: Um tipo integral assinado tal que ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 não define tal coisa diretamente (size_t é um tipo integral não assinado). Veja :pep:`353` para mais detalhes. ``PY_SSIZE_T_MAX`` é o maior valor positivo do tipo :c:type:`Py_ssize_t`.

source: Exceptions
pt_br: Exceções

source: The Python programmer only needs to deal with exceptions if specific error handling is required; unhandled exceptions are automatically propagated to the caller, then to the caller's caller, and so on, until they reach the top-level interpreter, where they are reported to the user accompanied by a stack traceback.
pt_br: O programador Python só precisa lidar com exceções se o tratamento de erros específico for necessário; as exceções não tratadas são propagadas automaticamente para o chamador, depois para o chamador e assim por diante, até chegarem ao interpretador de nível superior, onde são relatadas ao usuário acompanhadas por um traceback (situação da pilha de execução).
