Repository: python/python-docs-pt-br
Catalog: c-api/lifecycle.po
Languages: pt_br

source: Same as :c:func:`PyObject_CallFinalizer` but meant to be called at the beginning of the object's destructor (:c:member:`~PyTypeObject.tp_dealloc`). There must not be any references to the object. If the object's finalizer resurrects the object, this function returns -1; no further destruction should happen. Otherwise, this function returns 0 and destruction can continue normally.
pt_br: O mesmo que :c:func:`PyObject_CallFinalizer`, mas deve ser chamado no início do destrutor do objeto (:c:member:`~PyTypeObject.tp_dealloc`). Não deve haver nenhuma referência ao objeto. Se o finalizador do objeto ressuscitar o objeto, esta função retornará -1; nenhuma outra destruição deverá ocorrer. Caso contrário, esta função retornará 0 e a destruição pode continuar normalmente.

source: :c:member:`~PyTypeObject.tp_dealloc` for example code.
pt_br: :c:member:`~PyTypeObject.tp_dealloc` para código de exemplo.
