Repository: python/python-docs-pt-br
Catalog: c-api/list.po
Languages: pt_br

source: List Objects
pt_br: Objeto List

source: This subtype of :c:type:`PyObject` represents a Python list object.
pt_br: Este subtipo de :c:type:`PyObject` representa um objeto de lista Python.

source: This instance of :c:type:`PyTypeObject` represents the Python list type. This is the same object as :class:`list` in the Python layer.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo de lista Python. Este é o mesmo objeto que :class:`list` na camada Python.

source: Return true if *p* is a list object or an instance of a subtype of the list type. This function always succeeds.
pt_br: Retorna verdadeiro se *p* é um objeto lista ou uma instância de um subtipo do tipo lista. Esta função sempre tem sucesso.

source: Return true if *p* is a list object, but not an instance of a subtype of the list type. This function always succeeds.
pt_br: Retorna verdadeiro se *p* é um objeto lista, mas não uma instância de um subtipo do tipo lista. Esta função sempre tem sucesso.

source: Return a new list of length *len* on success, or ``NULL`` on failure.
pt_br: Retorna uma nova lista de comprimento *len* em caso de sucesso, ou ``NULL`` em caso de falha.

source: If *len* is greater than zero, the returned list object's items are set to ``NULL``. Thus you cannot use abstract API functions such as :c:func:`PySequence_SetItem` or expose the object to Python code before setting all items to a real object with :c:func:`PyList_SetItem` or :c:func:`PyList_SET_ITEM()`. The following APIs are safe APIs before the list is fully initialized: :c:func:`PyList_SetItem()` and :c:func:`PyList_SET_ITEM()`.
pt_br: Se *len* for maior que zero, os itens do objeto da lista retornada são definidos como ``NULL``. Portanto, você não pode usar funções API abstratas, como :c:func:`PySequence_SetItem` ou expor o objeto ao código Python antes de definir todos os itens para um objeto real com :c:func:`PyList_SetItem` ou :c:func:`PyList_SET_ITEM()`. As seguintes APIs são seguras desde que antes as listas tenham sido inicializadas: :c:func:`PyList_SetItem()` e :c:func:`PyList_SET_ITEM()`.

source: Return the length of the list object in *list*; this is equivalent to ``len(list)`` on a list object.
pt_br: Retorna o comprimento do objeto de lista em *list*; isto é equivalente a ``len(list)`` em um objeto lista.

source: Similar to :c:func:`PyList_Size`, but without error checking.
pt_br: Similar a :c:func:`PyList_Size`, mas sem verificação de erro.

source: Return the object at position *index* in the list pointed to by *list*. The position must be non-negative; indexing from the end of the list is not supported. If *index* is out of bounds (:code:`<0 or >=len(list)`), return ``NULL`` and set an :exc:`IndexError` exception.
pt_br: Retorna o objeto na posição *index* na lista apontada por *list*. A posição deve ser não negativa; não há suporte à indexação do final da lista. Se *index* estiver fora dos limites (:code:`<0 or >=len(list)`), retorna ``NULL`` e levanta uma exceção :exc:`IndexError`.

source: Like :c:func:`PyList_GetItemRef`, but returns a :term:`borrowed reference` instead of a :term:`strong reference`.
pt_br: Como :c:func:`PyList_GetItemRef`, mas retorna uma :term:`referência emprestada` em vez de uma :term:`referência forte`.

source: Similar to :c:func:`PyList_GetItem`, but without error checking.
pt_br: Similar a :c:func:`PyList_GetItem`, mas sem verificação de erro.

source: Set the item at index *index* in list to *item*. Return ``0`` on success. If *index* is out of bounds, return ``-1`` and set an :exc:`IndexError` exception.
pt_br: Define o item no índice *index* na lista como *item*. Retorna ``0`` em caso de sucesso. Se *index* estiver fora dos limites, retorna ``-1`` e levanta uma exceção :exc:`IndexError`.

source: This function "steals" a reference to *item* and discards a reference to an item already in the list at the affected position.
pt_br: Esta função "rouba" uma referência para o *item* e descarta uma referência para um item já presente na lista na posição afetada.

source: Macro form of :c:func:`PyList_SetItem` without error checking. This is normally only used to fill in new lists where there is no previous content.
pt_br: Forma macro de :c:func:`PyList_SetItem` sem verificação de erro. Este é normalmente usado apenas para preencher novas listas onde não há conteúdo anterior.

source: Bounds checking is performed as an assertion if Python is built in :ref:`debug mode <debug-build>` or :option:`with assertions <--with-assertions>`.
pt_br: A verificação de limites é realizada como uma asserção se o Python for construído em :ref:`modo de depuração <debug-build>` ou :option:`com asserções <--with-assertions>`.

source: This macro "steals" a reference to *item*, and, unlike :c:func:`PyList_SetItem`, does *not* discard a reference to any item that is being replaced; any reference in *list* at position *i* will be leaked.
pt_br: Esta macro "rouba" uma referência para o *item* e, ao contrário de :c:func:`PyList_SetItem`, *não* descarta uma referência para nenhum item que esteja sendo substituído; qualquer referência em *list* será perdida.

source: Insert the item *item* into list *list* in front of index *index*. Return ``0`` if successful; return ``-1`` and set an exception if unsuccessful. Analogous to ``list.insert(index, item)``.
pt_br: Insere o item *item* na lista *list* na frente do índice *index*. Retorna ``0`` se for bem-sucedido; retorna ``-1`` e levanta uma exceção se malsucedido. Análogo a ``list.insert(index, item)``.

source: Append the object *item* at the end of list *list*. Return ``0`` if successful; return ``-1`` and set an exception if unsuccessful. Analogous to ``list.append(item)``.
pt_br: Adiciona o item *item* ao final da lista *list*. Retorna ``0`` se for bem-sucedido; retorna ``-1`` e levanta uma exceção se malsucedido. Análogo a ``list.insert(index, item)``.

source: Return a list of the objects in *list* containing the objects *between* *low* and *high*. Return ``NULL`` and set an exception if unsuccessful. Analogous to ``list[low:high]``. Indexing from the end of the list is not supported.
pt_br: Retorna uma lista dos objetos em *list* contendo os objetos *entre* *low* e *alto*. Retorne ``NULL`` e levanta uma exceção se malsucedido. Análogo a ``list[low:high]``. Não há suporte à indexação do final da lista.

source: Set the slice of *list* between *low* and *high* to the contents of *itemlist*. Analogous to ``list[low:high] = itemlist``. The *itemlist* may be ``NULL``, indicating the assignment of an empty list (slice deletion). Return ``0`` on success, ``-1`` on failure. Indexing from the end of the list is not supported.
pt_br: Define a fatia de *list* entre *low* e *high* para o conteúdo de *itemlist*. Análogo a ``list[low:high] = itemlist``. *itemlist* pode ser ``NULL``, indicando a atribuição de uma lista vazia (exclusão de fatia). Retorna ``0`` em caso de sucesso, ``-1`` em caso de falha. Não há suporte à indexação do final da lista.

source: Extend *list* with the contents of *iterable*. This is the same as ``PyList_SetSlice(list, PY_SSIZE_T_MAX, PY_SSIZE_T_MAX, iterable)`` and analogous to ``list.extend(iterable)`` or ``list += iterable``.
pt_br: Estende *list* com o conteúdo de *iterable*. Isto é o mesmo que ``PyList_SetSlice(list, PY_SSIZE_T_MAX, PY_SSIZE_T_MAX, iterable)`` e análogo a ``list.extend(iterable)`` ou ``list += iterable``.

source: Raise an exception and return ``-1`` if *list* is not a :class:`list` object. Return 0 on success.
pt_br: Levanta uma exceção e retorna ``-1`` se *list* não for um objeto :class:`list`. Retorna 0 em caso de sucesso.

source: Remove all items from *list*. This is the same as ``PyList_SetSlice(list, 0, PY_SSIZE_T_MAX, NULL)`` and analogous to ``list.clear()`` or ``del list[:]``.
pt_br: Remove todos os itens da *lista*. Isto é o mesmo que ``PyList_SetSlice(list, 0, PY_SSIZE_T_MAX, NULL)`` e análogo a ``list.clear()`` ou ``del list[:]``.

source: Raise an exception and return ``-1`` if *list* is not a :class:`list` object. Return 0 on success.
pt_br: Levanta uma exceção e retorna ``-1`` se *list* não for um objeto :class:`list`. Retorna 0 em caso de sucesso.

source: Sort the items of *list* in place. Return ``0`` on success, ``-1`` on failure. This is equivalent to ``list.sort()``.
pt_br: Ordena os itens de *list* no mesmo lugar. Retorna ``0`` em caso de sucesso, e ``-1`` em caso de falha. Isso é o equivalente de ``list.sort()``.

source: Reverse the items of *list* in place. Return ``0`` on success, ``-1`` on failure. This is the equivalent of ``list.reverse()``.
pt_br: Inverte os itens de *list* no mesmo lugar. Retorna ``0`` em caso de sucesso, e ``-1`` em caso de falha. Isso é o equivalente de ``list.reverse()``.

source: Return a new tuple object containing the contents of *list*; equivalent to ``tuple(list)``.
pt_br: Retorna um novo objeto tupla contendo os conteúdos de *list*; equivale a ``tuple(list)``.

source: object
pt_br: objeto

source: list
pt_br: lista

source: built-in function
pt_br: função embutida

source: tuple
pt_br: tupla
