Repository: python/python-docs-pt-br
Catalog: c-api/marshal.po
Languages: pt_br

source: Data marshalling support
pt_br: Suporte a *marshalling* de dados

source: These routines allow C code to work with serialized objects using the same data format as the :mod:`marshal` module. There are functions to write data into the serialization format, and additional functions that can be used to read the data back. Files used to store marshalled data must be opened in binary mode.
pt_br: Essas rotinas permitem que o código C trabalhe com objetos serializados usando o mesmo formato de dados que o módulo :mod:`marshal`. Existem funções para gravar dados no formato de serialização e funções adicionais que podem ser usadas para ler os dados novamente. Os arquivos usados para armazenar dados empacotados devem ser abertos no modo binário.

source: Numeric values are stored with the least significant byte first.
pt_br: Os valores numéricos são armazenados primeiro com o byte menos significativo.

source: The module supports two versions of the data format: version 0 is the historical version, version 1 shares interned strings in the file, and upon unmarshalling. Version 2 uses a binary format for floating-point numbers. ``Py_MARSHAL_VERSION`` indicates the current file format (currently 2).
pt_br: O módulo oferece suporte a duas versões do formato de dados: a versão 0 é a versão histórica, a versão 1 compartilha strings internas no arquivo e após a desserialização. A versão 2 usa um formato binário para números de ponto flutuante. ``Py_MARSHAL_VERSION`` indica o formato do arquivo atual (atualmente 2).

source: Marshal a :c:expr:`long` integer, *value*, to *file*. This will only write the least-significant 32 bits of *value*; regardless of the size of the native :c:expr:`long` type. *version* indicates the file format.
pt_br: Aplica *marshalling* em um inteiro :c:expr:`long`, *value*, para *file*. Isso escreverá apenas os 32 bits menos significativos de *value*; independentemente do tamanho do tipo nativo :c:expr:`long`. *version* indica o formato do arquivo.

source: This function can fail, in which case it sets the error indicator. Use :c:func:`PyErr_Occurred` to check for that.
pt_br: Esta função pode falhar, caso em que define o indicador de erro. Use :c:func:`PyErr_Occurred` para verificar isso.

source: Marshal a Python object, *value*, to *file*. *version* indicates the file format.
pt_br: Aplica *marshalling* em um objeto Python, *value*, para *file*. *version* indica o formato do arquivo.

source: Return a bytes object containing the marshalled representation of *value*. *version* indicates the file format.
pt_br: Retorna um objeto de bytes que contém a representação pós-*marshalling* de *value*. *version* indica o formato do arquivo.

source: The following functions allow marshalled values to be read back in.
pt_br: As seguintes funções permitem que os valores pós-*marshalling* sejam lidos novamente.

source: Return a C :c:expr:`long` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 32-bit value can be read in using this function, regardless of the native size of :c:expr:`long`.
pt_br: Retorna um :c:expr:`long` C do fluxo de dados em um :c:expr:`FILE*` aberto para leitura. Somente um valor de 32 bits pode ser lido usando essa função, independentemente do tamanho nativo de :c:expr:`long`.

source: On error, sets the appropriate exception (:exc:`EOFError`) and returns ``-1``.
pt_br: Em caso de erro, define a exceção apropriada (:exc:`EOFError`) e retorna ``-1``.

source: Return a C :c:expr:`short` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 16-bit value can be read in using this function, regardless of the native size of :c:expr:`short`.
pt_br: Retorna um :c:expr:`short` C do fluxo de dados em um :c:expr:`FILE*` aberto para leitura. Somente um valor de 16 bits pode ser lido usando essa função, independentemente do tamanho nativo de :c:expr:`short`.

source: Return a Python object from the data stream in a :c:expr:`FILE*` opened for reading.
pt_br: Retorna um objeto Python do fluxo de dados em um :c:expr:`FILE*` aberto para leitura.

source: On error, sets the appropriate exception (:exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`) and returns ``NULL``.
pt_br: Em caso de erro, define a exceção apropriada (:exc:`EOFError`, :exc:`ValueError` ou :exc:`TypeError`) e retorna ``NULL``.

source: Return a Python object from the data stream in a :c:expr:`FILE*` opened for reading. Unlike :c:func:`PyMarshal_ReadObjectFromFile`, this function assumes that no further objects will be read from the file, allowing it to aggressively load file data into memory so that the de-serialization can operate from data in memory rather than reading a byte at a time from the file. Only use these variant if you are certain that you won't be reading anything else from the file.
pt_br: Retorna um objeto Python do fluxo de dados em um :c:expr:`FILE*` aberto para leitura. Diferentemente de :c:func:`PyMarshal_ReadObjectFromFile`, essa função presume que nenhum objeto adicional será lido do arquivo, permitindo que ela carregue agressivamente os dados do arquivo na memória, para que a desserialização possa operar a partir de dados na memória em vez de ler um byte por vez do arquivo. Use essas variantes apenas se tiver certeza de que não estará lendo mais nada do arquivo.

source: Return a Python object from the data stream in a byte buffer containing *len* bytes pointed to by *data*.
pt_br: Retorna um objeto Python do fluxo de dados em um buffer de bytes contendo *len* bytes apontados por *data*.
