Repository: python/python-docs-pt-br
Catalog: c-api/memoryview.po
Languages: pt_br

source: MemoryView objects
pt_br: Objetos MemoryView

source: A :class:`memoryview` object exposes the C level :ref:`buffer interface <bufferobjects>` as a Python object which can then be passed around like any other object.
pt_br: Um objeto :class:`memoryview` expõe a :ref:`interface de buffer <bufferobjects>` a nível de C como um objeto Python que pode ser passado como qualquer outro objeto.

source: Create a memoryview object from an object that provides the buffer interface. If *obj* supports writable buffer exports, the memoryview object will be read/write, otherwise it may be either read-only or read/write at the discretion of the exporter.
pt_br: Cria um objeto memoryview a partir de um objeto que fornece a interface do buffer. Se *obj* tiver suporte a exportações de buffer graváveis, o objeto memoryview será de leitura/gravação; caso contrário, poderá ser somente leitura ou leitura/gravação, a critério do exportador.

source: Flag to request a readonly buffer.
pt_br: Sinalizador para solicitar um buffer de somente leitura.

source: Flag to request a writable buffer.
pt_br: Sinalizador para solicitar um buffer gravável.

source: Create a memoryview object using *mem* as the underlying buffer. *flags* can be one of :c:macro:`PyBUF_READ` or :c:macro:`PyBUF_WRITE`.
pt_br: Cria um objeto memoryview usando *mem* como o buffer subjacente. *flags* pode ser um dos seguintes :c:macro:`PyBUF_READ` ou :c:macro:`PyBUF_WRITE`.

source: Create a memoryview object wrapping the given buffer structure *view*. For simple byte buffers, :c:func:`PyMemoryView_FromMemory` is the preferred function.
pt_br: Cria um objeto de memoryview envolvendo a estrutura de buffer *view* fornecida. Para buffers de bytes simples, :c:func:`PyMemoryView_FromMemory` é a função preferida.

source: Create a memoryview object to a :term:`contiguous` chunk of memory (in either 'C' or 'F'ortran *order*) from an object that defines the buffer interface. If memory is contiguous, the memoryview object points to the original memory. Otherwise, a copy is made and the memoryview points to a new bytes object.
pt_br: Cria um objeto memoryview para um pedaço :term:`contíguo <contiguous>` de memória (na ordem 'C' ou 'F'ortran, representada por *order*) a partir de um objeto que define a interface do buffer. Se a memória for contígua, o objeto memoryview apontará para a memória original. Caso contrário, é feita uma cópia e a visualização da memória aponta para um novo objeto bytes.

source: *buffertype* can be one of :c:macro:`PyBUF_READ` or :c:macro:`PyBUF_WRITE`.
pt_br: *buffertype* pode ser um entre :c:macro:`PyBUF_READ` ou :c:macro:`PyBUF_WRITE`.

source: Return true if the object *obj* is a memoryview object. It is not currently allowed to create subclasses of :class:`memoryview`. This function always succeeds.
pt_br: Retorna true se o objeto *obj* for um objeto memoryview. Atualmente, não é permitido criar subclasses de :class:`memoryview`. Esta função sempre tem sucesso.

source: Return a pointer to the memoryview's private copy of the exporter's buffer. *mview* **must** be a memoryview instance; this macro doesn't check its type, you must do it yourself or you will risk crashes.
pt_br: Retorna um ponteiro para a cópia privada da memória do buffer do exportador. *mview* **deve** ser uma instância de memoryview; Se essa macro não verificar seu tipo, faça você mesmo ou corre o risco de travar.

source: Return either a pointer to the exporting object that the memoryview is based on or ``NULL`` if the memoryview has been created by one of the functions :c:func:`PyMemoryView_FromMemory` or :c:func:`PyMemoryView_FromBuffer`. *mview* **must** be a memoryview instance.
pt_br: Retorna um ponteiro para o objeto de exportação no qual a memória é baseada ou ``NULL`` se a memória tiver sido criada por uma das funções :c:func:`PyMemoryView_FromMemory` ou :c:func:`PyMemoryView_FromBuffer`. *mview* **deve** ser uma instância de memoryview.

source: object
pt_br: objeto
