Repository: python/python-docs-pt-br
Catalog: c-api/module.po
Languages: pt_br

source: Add a string constant to *module* as *name*. This convenience function can be used from the module's initialization function. The string *value* must be ``NULL``-terminated. Return ``-1`` on error, ``0`` on success.
pt_br: Додайте рядкову константу до *module* як *name*. Цю зручну функцію можна використовувати з функції ініціалізації модуля. Рядок *значення* має завершуватися ``NULL``. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.

source: Add an int constant to *module*. The name and the value are taken from *macro*. For example ``PyModule_AddIntMacro(module, AF_INET)`` adds the int constant *AF_INET* with the value of *AF_INET* to *module*. Return ``-1`` on error, ``0`` on success.
pt_br: Додайте константу int до *module*. Ім'я та значення взято з *макросу*. Наприклад, ``PyModule_AddIntMacro(module, AF_INET)`` додає константу int *AF_INET* зі значенням *AF_INET* до *module*. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.

source: Add a string constant to *module*.
pt_br: Додайте рядкову константу до *module*.

source: Add a type object to *module*. The type object is finalized by calling internally :c:func:`PyType_Ready`. The name of the type object is taken from the last component of :c:member:`~PyTypeObject.tp_name` after dot. Return ``-1`` on error, ``0`` on success.
pt_br: Додайте об’єкт типу до *module*. Об’єкт типу завершується внутрішнім викликом :c:func:`PyType_Ready`. Ім’я об’єкта типу береться з останнього компонента :c:member:`~PyTypeObject.tp_name` після крапки. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.

source: Module lookup
pt_br: Pesquisa por módulos

source: Single-phase initialization creates singleton modules that can be looked up in the context of the current interpreter. This allows the module object to be retrieved later with only a reference to the module definition.
pt_br: Однофазова ініціалізація створює однотонні модулі, які можна шукати в контексті поточного інтерпретатора. Це дозволяє пізніше отримати об’єкт модуля лише з посиланням на визначення модуля.

source: These functions will not work on modules created using multi-phase initialization, since multiple such modules can be created from a single definition.
pt_br: Ці функції не працюватимуть на модулях, створених за допомогою багатофазної ініціалізації, оскільки кілька таких модулів можна створити з одного визначення.

source: Returns the module object that was created from *def* for the current interpreter. This method requires that the module object has been attached to the interpreter state with :c:func:`PyState_AddModule` beforehand. In case the corresponding module object is not found or has not been attached to the interpreter state yet, it returns ``NULL``.
pt_br: Повертає об’єкт модуля, який було створено з *def* для поточного інтерпретатора. Цей метод вимагає, щоб об’єкт модуля був прикріплений до стану інтерпретатора за допомогою :c:func:`PyState_AddModule` заздалегідь. Якщо відповідний об’єкт модуля не знайдено або ще не приєднано до стану інтерпретатора, він повертає ``NULL``.

source: Attaches the module object passed to the function to the interpreter state. This allows the module object to be accessible via :c:func:`PyState_FindModule`.
pt_br: Приєднує об’єкт модуля, переданий у функцію, до стану інтерпретатора. Це дозволяє об’єкту модуля бути доступним через :c:func:`PyState_FindModule`.

source: Only effective on modules created using single-phase initialization.
pt_br: Діє лише для модулів, створених за допомогою однофазної ініціалізації.

source: Python calls ``PyState_AddModule`` automatically after importing a module, so it is unnecessary (but harmless) to call it from module initialization code. An explicit call is needed only if the module's own init code subsequently calls ``PyState_FindModule``. The function is mainly intended for implementing alternative import mechanisms (either by calling it directly, or by referring to its implementation for details of the required state updates).
pt_br: Python автоматично викликає ``PyState_AddModule`` після імпортування модуля, тому непотрібно (але нешкідливо) викликати його з коду ініціалізації модуля. Явний виклик потрібен, лише якщо власний код ініціалізації модуля згодом викликає ``PyState_FindModule``. Ця функція в основному призначена для впровадження альтернативних механізмів імпорту (або через її прямий виклик, або шляхом посилання на її реалізацію для отримання деталей необхідних оновлень стану).

source: The caller must hold the GIL.
pt_br: Абонент повинен тримати GIL.

source: Return 0 on success or -1 on failure.
pt_br: Повертає 0 у разі успіху або -1 у разі невдачі.

source: Removes the module object created from *def* from the interpreter state. Return 0 on success or -1 on failure.
pt_br: Видаляє об’єкт модуля, створений з *def*, зі стану інтерпретатора. Повертає 0 у разі успіху або -1 у разі невдачі.
