Repository: python/python-docs-pt-br
Catalog: c-api/module.po
Languages: pt_br

source: Module Objects
pt_br: Objetos do Módulo

source: This instance of :c:type:`PyTypeObject` represents the Python module type. This is exposed to Python programs as ``types.ModuleType``.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo de módulo Python. Isso é exposto a programas Python como ``types.ModuleType``.

source: Return true if *p* is a module object, or a subtype of a module object. This function always succeeds.
pt_br: Retorna true se *p* for um objeto de módulo ou um subtipo de um objeto de módulo. Esta função sempre é bem-sucedida.

source: Return true if *p* is a module object, but not a subtype of :c:data:`PyModule_Type`. This function always succeeds.
pt_br: Retorna true se *p* for um objeto de módulo, mas não um subtipo de :c:data:`PyModule_Type`. Essa função é sempre bem-sucedida.

source: Return a new module object with the :attr:`__name__` attribute set to *name*. The module's :attr:`__name__`, :attr:`__doc__`, :attr:`__package__`, and :attr:`__loader__` attributes are filled in (all but :attr:`__name__` are set to ``None``); the caller is responsible for providing a :attr:`__file__` attribute.
pt_br: Retorna um novo objeto de módulo com o atributo :attr:`__name__` definido como *name*. Os atributos de módulo :attr:`__name__`, :attr:`__doc__`, :attr:`__package__` e :attr:`__loader__` são preenchidos (todos exceto :attr:`__name__` são definidos como ``None``); O chamador é responsásvel por providenciar um atributo :attr:`__file__`.

source: :attr:`__package__` and :attr:`__loader__` are set to ``None``.
pt_br: :attr:`__package__` e :attr:`__loader__` são definidos como ``None``.

source: Similar to :c:func:`PyModule_NewObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
pt_br: Semelhante a :c:func:`PyModule_NewObject`, mas o nome é uma string codificada em UTF-8 em vez de um objeto Unicode.

source: Return the dictionary object that implements *module*'s namespace; this object is the same as the :attr:`~object.__dict__` attribute of the module object. If *module* is not a module object (or a subtype of a module object), :exc:`SystemError` is raised and ``NULL`` is returned.
pt_br: Retorna o objeto dicionário que implementa o espaço de nomes de *module*; este objeto é o mesmo que o atributo :attr:`~object.__dict__` do objeto de módulo. Se *module* não for um objeto de módulo (ou um subtipo de um objeto de módulo), :exc:`SystemError` é levantada e ``NULL`` é retornado.

source: It is recommended extensions use other ``PyModule_*`` and ``PyObject_*`` functions rather than directly manipulate a module's :attr:`~object.__dict__`.
pt_br: É recomendado que as extensões usem outras funções ``PyModule_*`` e ``PyObject_*`` em vez de manipular diretamente o :attr:`~object.__dict__` de um módulo.

source: Return *module*'s :attr:`__name__` value. If the module does not provide one, or if it is not a string, :exc:`SystemError` is raised and ``NULL`` is returned.
pt_br: Retorna o valor :attr:`__name__` do *módulo*. Se o módulo não fornecer um, ou se não for uma string, :exc:`SystemError` é levantada e ``NULL`` é retornado.

source: Similar to :c:func:`PyModule_GetNameObject` but return the name encoded to ``'utf-8'``.
pt_br: Semelhante a :c:func:`PyModule_GetNameObject` mas retorna o nome codificado em ``'utf-8'``

source: Return the "state" of the module, that is, a pointer to the block of memory allocated at module creation time, or ``NULL``. See :c:member:`PyModuleDef.m_size`.
pt_br: Retorna o "estado" do módulo, ou seja, um ponteiro para o bloco de memória alocado no momento de criação do módulo, ou ``NULL``. Ver :c:member:`PyModuleDef.m_size`.

source: Return a pointer to the :c:type:`PyModuleDef` struct from which the module was created, or ``NULL`` if the module wasn't created from a definition.
pt_br: Retorna um ponteiro para a estrutura :c:type:`PyModuleDef` da qual o módulo foi criado, ou ``NULL`` se o módulo não foi criado de uma definição.

source: Return the name of the file from which *module* was loaded using *module*'s :attr:`__file__` attribute. If this is not defined, or if it is not a unicode string, raise :exc:`SystemError` and return ``NULL``; otherwise return a reference to a Unicode object.
pt_br: Retorna o nome do arquivo do qual o *módulo* foi carregado usando o atributo :attr:`__file__` do *módulo*. Se não estiver definido, ou se não for uma string unicode, levanta :exc:`SystemError` e retorna ``NULL``; Caso contrário, retorna uma referência a um objeto Unicode.

source: Similar to :c:func:`PyModule_GetFilenameObject` but return the filename encoded to 'utf-8'.
pt_br: Semelhante a :c:func:`PyModule_GetFilenameObject` mas retorna o nome do arquivo codificado em 'utf-8'.

source: Initializing C modules
pt_br: Inicializando módulos C

source: Modules objects are usually created from extension modules (shared libraries which export an initialization function), or compiled-in modules (where the initialization function is added using :c:func:`PyImport_AppendInittab`). See :ref:`building` or :ref:`extending-with-embedding` for details.
pt_br: Objetos de módulos são geralmente criados a partir de módulos de extensão (bibliotecas compartilhadas que exportam uma função de inicialização), ou módulos compilados (onde a função de inicialização é adicionada usando :c:func:`PyImport_AppendInittab`). Ver :ref:`building` ou :ref:`extending-with-embedding` para mais detalhes.

source: The initialization function can either pass a module definition instance to :c:func:`PyModule_Create`, and return the resulting module object, or request "multi-phase initialization" by returning the definition struct itself.
pt_br: A função de inicialização pode passar uma instância de definição de módulo para :c:func:`PyModule_Create` e retornar o objeto de módulo resultante ou solicitar "inicialização multifásica" retornando a própria estrutura de definição.

source: The module definition struct, which holds all information needed to create a module object. There is usually only one statically initialized variable of this type for each module.
pt_br: A estrutura de definição de módulo, que contém todas as informações necessária para criar um objeto de módulo. Geralmente, há apenas uma variável inicializada estaticamente desse tipo para cada módulo.

source: Name for the new module.
pt_br: Nome para o novo módulo.

source: Docstring for the module; usually a docstring variable created with :c:macro:`PyDoc_STRVAR` is used.
pt_br: Docstring para o módulo; geralmente uma variável docstring criada com :c:macro:`PyDoc_STRVAR` é usada.

source: Module state may be kept in a per-module memory area that can be retrieved with :c:func:`PyModule_GetState`, rather than in static globals. This makes modules safe for use in multiple sub-interpreters.
pt_br: O estado do módulo pode ser mantido em uma área de memória por módulo que pode ser recuperada com :c:func:`PyModule_GetState`, em vez de em globais estáticos. Isso torna os módulos seguros para uso em vários subinterpretadores.

source: Setting ``m_size`` to ``-1`` means that the module does not support sub-interpreters, because it has global state.
pt_br: Definir ``m_size`` como ``-1`` significa que o módulo não oferece suporte a subinterpretadores, porque ele tem estado global.

source: Setting it to a non-negative value means that the module can be re-initialized and specifies the additional amount of memory it requires for its state. Non-negative ``m_size`` is required for multi-phase initialization.
pt_br: Defini-lo como um valor não negativo significa que o módulo pode ser reinicializado e especifica a quantidade adicional de memória necessária para seu estado. ``m_size`` não negativo é necessário para inicialização multifásica.

source: See :PEP:`3121` for more details.
pt_br: Ver :PEP:`3121` para mais detalhes.

source: A pointer to a table of module-level functions, described by :c:type:`PyMethodDef` values. Can be ``NULL`` if no functions are present.
pt_br: Um ponteiro para uma tabela de funções de nível de módulo, descritas por valores :c:type:`PyMethodDef`. Pode ser ``NULL`` se nenhuma função estiver presente.

source: An array of slot definitions for multi-phase initialization, terminated by a ``{0, NULL}`` entry. When using single-phase initialization, *m_slots* must be ``NULL``.
pt_br: Uma matriz de definições de slot para inicialização multifásica, terminada por uma entrada ``{0, NULL}``. Ao usar inicialização monofásica, *m_slots* deve ser ``NULL``.

source: Prior to version 3.5, this member was always set to ``NULL``, and was defined as:
pt_br: Antes da versão 3.5, esse membro era sempre definido como ``NULL`` e era definido como:

source: A traversal function to call during GC traversal of the module object, or ``NULL`` if not needed.
pt_br: Uma função de travessia para chamar durante a travessia do GC do objeto do módulo, ou ``NULL`` se não for necessário.

source: No longer called before the module state is allocated.
pt_br: Não é mais chamado antes que o estado do módulo seja alocado.

source: A clear function to call during GC clearing of the module object, or ``NULL`` if not needed.
pt_br: Uma função de limpeza para chamar durante a limpeza do GC do objeto do módulo, ou ``NULL`` se não for necessário.

source: Like :c:member:`PyTypeObject.tp_clear`, this function is not *always* called before a module is deallocated. For example, when reference counting is enough to determine that an object is no longer used, the cyclic garbage collector is not involved and :c:member:`~PyModuleDef.m_free` is called directly.
pt_br: Assim como :c:member:`PyTypeObject.tp_clear`, esta função não é *sempre* chamada antes de um módulo ser desalocado. Por exemplo, quando a contagem de referências é suficiente para determinar que um objeto não é mais usado, o coletor de lixo cíclico não é envolvido e :c:member:`~PyModuleDef.m_free` é chamado diretamente.

source: A function to call during deallocation of the module object, or ``NULL`` if not needed.
pt_br: Uma função para ser chamada durante a desalocação do objeto do módulo, ou ``NULL`` se não for necessário.

source: Single-phase initialization
pt_br: inicialização de fase única

source: The module initialization function may create and return the module object directly. This is referred to as "single-phase initialization", and uses one of the following two module creation functions:
pt_br: A função de inicialização do módulo pode criar e retornar o objeto do módulo diretamente. Isso é chamado de "inicialização de fase única" e usa uma das duas funções de criação de módulo a seguir:

source: Create a new module object, given the definition in *def*, assuming the API version *module_api_version*. If that version does not match the version of the running interpreter, a :exc:`RuntimeWarning` is emitted.
pt_br: Створіть новий об’єкт модуля, враховуючи визначення в *def*, припускаючи версію API *module_api_version*. Якщо ця версія не збігається з версією запущеного інтерпретатора, видається :exc:`RuntimeWarning`.

source: Most uses of this function should be using :c:func:`PyModule_Create` instead; only use this if you are sure you need it.
pt_br: A maioria dos usos dessa função deve ser feita com :c:func:`PyModule_Create`; use-o apenas se tiver certeza de que precisa.

source: Before it is returned from in the initialization function, the resulting module object is typically populated using functions like :c:func:`PyModule_AddObjectRef`.
pt_br: Перед поверненням у функції ініціалізації результуючий об’єкт модуля зазвичай заповнюється за допомогою таких функцій, як :c:func:`PyModule_AddObjectRef`.

source: Multi-phase initialization
pt_br: Inicialização multifásica

source: All modules created using multi-phase initialization are expected to support :ref:`sub-interpreters <sub-interpreter-support>`. Making sure multiple modules are independent is typically enough to achieve this.
pt_br: Очікується, що всі модулі, створені за допомогою багатофазної ініціалізації, підтримуватимуть :ref:`sub-інтерпретатори <sub-interpreter-support>`. Переконавшись, що декілька модулів є незалежними, як правило, достатньо, щоб досягти цього.

source: To request multi-phase initialization, the initialization function (PyInit_modulename) returns a :c:type:`PyModuleDef` instance with non-empty :c:member:`~PyModuleDef.m_slots`. Before it is returned, the ``PyModuleDef`` instance must be initialized with the following function:
pt_br: Для запиту багатофазної ініціалізації функція ініціалізації (PyInit_modulename) повертає екземпляр :c:type:`PyModuleDef` з непорожнім :c:member:`~PyModuleDef.m_slots`. Перш ніж його буде повернуто, примірник ``PyModuleDef`` має бути ініціалізований такою функцією:

source: Ensures a module definition is a properly initialized Python object that correctly reports its type and reference count.
pt_br: Garante que uma definição de módulo é um objeto Python devidamente inicializado que reporta corretamente seu tipo e contagem de referências.

source: Returns *def* cast to ``PyObject*``, or ``NULL`` if an error occurred.
pt_br: Повертає *def* приведення до ``PyObject*`` або ``NULL``, якщо сталася помилка.

source: The *m_slots* member of the module definition must point to an array of ``PyModuleDef_Slot`` structures:
pt_br: Член *m_slots* у визначенні модуля має вказувати на масив структур ``PyModuleDef_Slot``:

source: A slot ID, chosen from the available values explained below.
pt_br: Um ID de lot, escolhido a partir dos valores disponíveis explicados abaixo.

source: Value of the slot, whose meaning depends on the slot ID.
pt_br: Valor do slot, cujo significado depende do ID do slot.

source: The *m_slots* array must be terminated by a slot with id 0.
pt_br: Масив *m_slots* повинен закінчуватися слотом з ідентифікатором 0.

source: The available slot types are:
pt_br: Os tipos de slot disponíveis são:

source: Specifies a function that is called to create the module object itself. The *value* pointer of this slot must point to a function of the signature:
pt_br: Визначає функцію, яка викликається для створення самого об’єкта модуля. Покажчик *значення* цього слота має вказувати на функцію підпису:

source: The function receives a :py:class:`~importlib.machinery.ModuleSpec` instance, as defined in :PEP:`451`, and the module definition. It should return a new module object, or set an error and return ``NULL``.
pt_br: Функція отримує екземпляр :py:class:`~importlib.machinery.ModuleSpec`, як визначено в :PEP:`451`, і визначення модуля. Він має повернути новий об’єкт модуля або встановити помилку та повернути ``NULL``.

source: This function should be kept minimal. In particular, it should not call arbitrary Python code, as trying to import the same module again may result in an infinite loop.
pt_br: Ця функція повинна бути мінімальною. Зокрема, він не повинен викликати довільний код Python, оскільки повторна спроба імпортувати той самий модуль може призвести до нескінченного циклу.

source: Multiple ``Py_mod_create`` slots may not be specified in one module definition.
pt_br: Múltiplos slots ``Py_mod_create`` podem não estar especificados em uma definição de módulo.

source: If ``Py_mod_create`` is not specified, the import machinery will create a normal module object using :c:func:`PyModule_New`. The name is taken from *spec*, not the definition, to allow extension modules to dynamically adjust to their place in the module hierarchy and be imported under different names through symlinks, all while sharing a single module definition.
pt_br: Якщо ``Py_mod_create`` не вказано, механізм імпорту створить звичайний об’єкт модуля за допомогою :c:func:`PyModule_New`. Ім’я взято з *spec*, а не з визначення, щоб дозволити модулям розширення динамічно адаптуватися до свого місця в ієрархії модулів і імпортуватися під різними іменами за допомогою символічних посилань, водночас користуючись єдиним визначенням модуля.

source: There is no requirement for the returned object to be an instance of :c:type:`PyModule_Type`. Any type can be used, as long as it supports setting and getting import-related attributes. However, only ``PyModule_Type`` instances may be returned if the ``PyModuleDef`` has non-``NULL`` ``m_traverse``, ``m_clear``, ``m_free``; non-zero ``m_size``; or slots other than ``Py_mod_create``.
pt_br: Немає вимоги, щоб повернутий об’єкт був екземпляром :c:type:`PyModule_Type`. Можна використовувати будь-який тип, якщо він підтримує встановлення та отримання пов’язаних з імпортом атрибутів. Однак лише екземпляри ``PyModule_Type`` можуть повертатися, якщо ``PyModuleDef`` має не-``NULL`` ``m_traverse``, ``m_clear``, ``m_free``; ненульовий ``m_size``; або слоти, відмінні від ``Py_mod_create``.

source: Specifies a function that is called to *execute* the module. This is equivalent to executing the code of a Python module: typically, this function adds classes and constants to the module. The signature of the function is:
pt_br: Визначає функцію, яка викликається для *виконання* модуля. Це еквівалентно виконанню коду модуля Python: зазвичай ця функція додає класи та константи до модуля. Сигнатура функції:

source: If multiple ``Py_mod_exec`` slots are specified, they are processed in the order they appear in the *m_slots* array.
pt_br: Se vários slots ``Py_mod_exec`` forem especificados, eles serão processados na ordem em que aparecem no vetor *m_slots*.

source: See :PEP:`489` for more details on multi-phase initialization.
pt_br: Ver :PEP:`489` para obter mais detalhes sobre a inicialização multifásica.

source: Low-level module creation functions
pt_br: Funções de criação de módulo de baixo nível

source: The following functions are called under the hood when using multi-phase initialization. They can be used directly, for example when creating module objects dynamically. Note that both ``PyModule_FromDefAndSpec`` and ``PyModule_ExecDef`` must be called to fully initialize a module.
pt_br: Наступні функції викликаються під капотом під час використання багатофазної ініціалізації. Їх можна використовувати безпосередньо, наприклад, при динамічному створенні об’єктів модуля. Зауважте, що для повної ініціалізації модуля необхідно викликати як ``PyModule_FromDefAndSpec``, так і ``PyModule_ExecDef``.

source: Create a new module object, given the definition in *def* and the ModuleSpec *spec*, assuming the API version *module_api_version*. If that version does not match the version of the running interpreter, a :exc:`RuntimeWarning` is emitted.
pt_br: Создайте новый объект модуля, учитывая определение в *def* и ModuleSpec *spec*, предполагая версию API *module_api_version*. Если эта версия не соответствует версии работающего интерпретатора, выдается :exc:`RuntimeWarning`.

source: Most uses of this function should be using :c:func:`PyModule_FromDefAndSpec` instead; only use this if you are sure you need it.
pt_br: У більшості випадків використання цієї функції має використовувати :c:func:`PyModule_FromDefAndSpec`; використовуйте це, лише якщо ви впевнені, що це вам потрібно.

source: Process any execution slots (:c:data:`Py_mod_exec`) given in *def*.
pt_br: Обробити будь-які слоти виконання (:c:data:`Py_mod_exec`), указані в *def*.

source: Set the docstring for *module* to *docstring*. This function is called automatically when creating a module from ``PyModuleDef``, using either ``PyModule_Create`` or ``PyModule_FromDefAndSpec``.
pt_br: Встановіть рядок документації для *module* на *string*. Ця функція викликається автоматично під час створення модуля з ``PyModuleDef`` за допомогою ``PyModule_Create`` або ``PyModule_FromDefAndSpec``.

source: Add the functions from the ``NULL`` terminated *functions* array to *module*. Refer to the :c:type:`PyMethodDef` documentation for details on individual entries (due to the lack of a shared module namespace, module level "functions" implemented in C typically receive the module as their first parameter, making them similar to instance methods on Python classes). This function is called automatically when creating a module from ``PyModuleDef``, using either ``PyModule_Create`` or ``PyModule_FromDefAndSpec``.
pt_br: Додайте функції з масиву *functions* із закінченням ``NULL`` до *module*. Зверніться до документації :c:type:`PyMethodDef`, щоб дізнатися більше про окремі записи (через відсутність спільного простору імен модуля "функції" рівня модуля, реалізовані в C, зазвичай отримують модуль як свій перший параметр, що робить їх схожими на екземпляр методи на класах Python). Ця функція викликається автоматично під час створення модуля з ``PyModuleDef`` за допомогою ``PyModule_Create`` або ``PyModule_FromDefAndSpec``.

source: Support functions
pt_br: Допоміжні функції

source: The module initialization function (if using single phase initialization) or a function called from a module execution slot (if using multi-phase initialization), can use the following functions to help initialize the module state:
pt_br: Функція ініціалізації модуля (якщо використовується однофазна ініціалізація) або функція, що викликається зі слота виконання модуля (якщо використовується багатофазова ініціалізація), може використовувати такі функції, щоб допомогти ініціалізувати стан модуля:

source: Add an object to *module* as *name*. This is a convenience function which can be used from the module's initialization function.
pt_br: Додайте об’єкт до *модуля* як *ім’я*. Це зручна функція, яку можна використовувати з функції ініціалізації модуля.

source: On success, return ``0``. On error, raise an exception and return ``-1``.
pt_br: У разі успіху поверніть ``0``. У разі помилки викликає виняток і повертає ``-1``.

source: Return ``NULL`` if *value* is ``NULL``. It must be called with an exception raised in this case.
pt_br: Повертає ``NULL``, якщо *значення* дорівнює ``NULL``. У цьому випадку його потрібно викликати з винятком.

source: Example usage::
pt_br: Exemplo de uso::

source: The example can also be written without checking explicitly if *obj* is ``NULL``::
pt_br: O exemplo também pode ser escrito sem verificar explicitamente se *obj* é ``NULL``::

source: Note that ``Py_XDECREF()`` should be used instead of ``Py_DECREF()`` in this case, since *obj* can be ``NULL``.
pt_br: Зверніть увагу, що в цьому випадку слід використовувати ``Py_XDECREF()`` замість ``Py_DECREF()``, оскільки *obj* може бути ``NULL``.

source: Similar to :c:func:`PyModule_AddObjectRef`, but steals a reference to *value* on success (if it returns ``0``).
pt_br: Подібно до :c:func:`PyModule_AddObjectRef`, але в разі успіху викрадає посилання на *value* (якщо повертає ``0``).

source: The new :c:func:`PyModule_AddObjectRef` function is recommended, since it is easy to introduce reference leaks by misusing the :c:func:`PyModule_AddObject` function.
pt_br: Рекомендовано використовувати нову функцію :c:func:`PyModule_AddObjectRef`, оскільки внаслідок неправильного використання функції :c:func:`PyModule_AddObject` легко створити витоки посилань.

source: Unlike other functions that steal references, ``PyModule_AddObject()`` only releases the reference to *value* **on success**.
pt_br: В отличие от других функций, которые крадут ссылки, PyModule_AddObject() освобождает ссылку на *value* только **в случае успеха**.

source: This means that its return value must be checked, and calling code must :c:func:`Py_DECREF` *value* manually on error.
pt_br: Це означає, що його повертане значення має бути перевірено, а код виклику повинен :c:func:`Py_DECREF` *значення* вручну у разі помилки.

source: Add an integer constant to *module* as *name*. This convenience function can be used from the module's initialization function. Return ``-1`` on error, ``0`` on success.
pt_br: Додайте цілу константу до *module* як *name*. Цю зручну функцію можна використовувати з функції ініціалізації модуля. Повертає ``-1`` у разі помилки, ``0`` у разі успіху.
