Repository: python/python-docs-pt-br
Catalog: c-api/monitoring.po
Languages: pt_br

source: Monitoring C API
pt_br: API C de monitoramento

source: Added in version 3.13.
pt_br: Adicionada na versão 3.13.

source: An extension may need to interact with the event monitoring system. Subscribing to events and registering callbacks can be done via the Python API exposed in :mod:`sys.monitoring`.
pt_br: Uma extensão pode precisar interagir com o sistema de monitoramento de eventos. É possível registrar funções de retorno e se inscrever para receber eventos através da API Python exposta em :mod:`sys.monitoring`.

source: Generating Execution Events
pt_br: Gerando eventos de execução

source: The functions below make it possible for an extension to fire monitoring events as it emulates the execution of Python code. Each of these functions accepts a ``PyMonitoringState`` struct which contains concise information about the activation state of events, as well as the event arguments, which include a ``PyObject*`` representing the code object, the instruction offset and sometimes additional, event-specific arguments (see :mod:`sys.monitoring` for details about the signatures of the different event callbacks). The ``codelike`` argument should be an instance of :class:`types.CodeType` or of a type that emulates it.
pt_br: As funções abaixo permitem que extensões dispararem eventos de monitoramento emulando a execução de código Python. Cada uma dessas funções recebe uma estrutura ``PyMonitoringState`` que contém informação concisa sobre o estado de ativação de eventos, bem como os argumentos dos eventos, que incluem um ``PyObject*`` representando o objeto de código, a posição da instrução no bytecode, e, em alguns casos, argumentos adicionais específicos para o evento (veja :mod:`sys.monitoring` para detalhes sobre as assinaturas das funções de retorno de diferentes eventos). O argumento ``codelike`` deve ser uma instância da classe :class:`types.CodeType` ou de um tipo que a emule.

source: The VM disables tracing when firing an event, so there is no need for user code to do that.
pt_br: A VM desabilita o rastreamento quando dispara um evento, de forma que não há necessidade do código do usuário fazer isso.

source: Monitoring functions should not be called with an exception set, except those listed below as working with the current exception.
pt_br: Funções de monitoramento não devem ser chamadas com uma exceção definida, exceto as marcadas abaixo como funções que trabalham com a exceção atual.

source: Representation of the state of an event type. It is allocated by the user while its contents are maintained by the monitoring API functions described below.
pt_br: Representação do estado de um tipo de evento. Alocada pelo usuário, enquanto o seu conteúdo é mantido pelas funções da API de monitoramento descritas abaixo.

source: All of the functions below return 0 on success and -1 (with an exception set) on error.
pt_br: Todas as funções abaixo retornam 0 para indicar sucesso e -1 (com uma exceção definida) para indicar erro.

source: See :mod:`sys.monitoring` for descriptions of the events.
pt_br: Veja :mod:`sys.monitoring` para descrições dos eventos.

source: Fire a ``PY_START`` event.
pt_br: Dispara um evento ``PY_START``.

source: Fire a ``PY_RESUME`` event.
pt_br: Dispara um evento ``PY_RESUME``.

source: Fire a ``PY_RETURN`` event.
pt_br: Dispara um evento ``PY_RETURN``.

source: Fire a ``PY_YIELD`` event.
pt_br: Dispara um evento ``PY_YIELD``.

source: Fire a ``CALL`` event.
pt_br: Dispara um evento ``CALL``.

source: Fire a ``LINE`` event.
pt_br: Dispara um evento ``LINE``.

source: Fire a ``JUMP`` event.
pt_br: Dispara um evento ``JUMP``.

source: Fire a ``C_RETURN`` event.
pt_br: Dispara um evento ``C_RETURN``.

source: Fire a ``PY_THROW`` event with the current exception (as returned by :c:func:`PyErr_GetRaisedException`).
pt_br: Dispara um evento ``PY_THROW`` com a exceção atual (conforme retornada por :c:func:`PyErr_GetRaisedException`).

source: Fire a ``RAISE`` event with the current exception (as returned by :c:func:`PyErr_GetRaisedException`).
pt_br: Dispara um evento ``RAISE`` com a exceção atual (conforme retornada por :c:func:`PyErr_GetRaisedException`).

source: Fire a ``C_RAISE`` event with the current exception (as returned by :c:func:`PyErr_GetRaisedException`).
pt_br: Dispara um evento ``C_RAISE`` com a exceção atual (conforme retornada por :c:func:`PyErr_GetRaisedException`).

source: Fire a ``RERAISE`` event with the current exception (as returned by :c:func:`PyErr_GetRaisedException`).
pt_br: Dispara um evento ``RERAISE`` com a exceção atual (conforme retornada por :c:func:`PyErr_GetRaisedException`).

source: Fire an ``EXCEPTION_HANDLED`` event with the current exception (as returned by :c:func:`PyErr_GetRaisedException`).
pt_br: Dispara um evento ``EXCEPTION_HANDLED`` com a exceção atual (conforme retornada por :c:func:`PyErr_GetRaisedException`).

source: Fire a ``PY_UNWIND`` event with the current exception (as returned by :c:func:`PyErr_GetRaisedException`).
pt_br: Dispara um evento ``PY_UNWIND`` com a exceção atual (conforme retornada por :c:func:`PyErr_GetRaisedException`).

source: Fire a ``STOP_ITERATION`` event. If ``value`` is an instance of :exc:`StopIteration`, it is used. Otherwise, a new :exc:`StopIteration` instance is created with ``value`` as its argument.
pt_br: Dispara um evento ``STOP_ITERATION``. Se ``value`` for uma instância de :exc:`StopIteration`, ele é usado. Caso contrário, uma nova instância de :exc:`StopIteration` é criada com ``value`` como o argumento.

source: Managing the Monitoring State
pt_br: Gerenciando o Estado de um Monitoramento

source: Monitoring states can be managed with the help of monitoring scopes. A scope would typically correspond to a python function.
pt_br: Estados de monitoramento podem ser gerenciados com a ajuda de escopos de monitoramento. Um escopo corresponderia tipicamente a um função python.

source: Enter a monitored scope. ``event_types`` is an array of the event IDs for events that may be fired from the scope. For example, the ID of a ``PY_START`` event is the value ``PY_MONITORING_EVENT_PY_START``, which is numerically equal to the base-2 logarithm of ``sys.monitoring.events.PY_START``. ``state_array`` is an array with a monitoring state entry for each event in ``event_types``, it is allocated by the user but populated by :c:func:`!PyMonitoring_EnterScope` with information about the activation state of the event. The size of ``event_types`` (and hence also of ``state_array``) is given in ``length``.
pt_br: Insere um escopo monitorado. ``event_types`` é um vetor de IDs de eventos para eventos que podem ser disparados do escopo. Por exemplo, a ID de um evento ``PY_START`` é o valor ``PY_MONITORING_EVENT_PY_START``, que é numericamente igual ao logaritmo de base 2 de ``sys.monitoring.events.PY_START``. ``state_array`` é um vetor com uma entrada de estado de monitoramento para cada evento em ``event_types``, é alocado pelo usuário, mas preenchido por :c:func:`!PyMonitoring_EnterScope` com informações sobre o estado de ativação do evento. O tamanho de ``event_types`` (e, portanto, também de ``state_array``) é fornecido em ``length``.

source: The ``version`` argument is a pointer to a value which should be allocated by the user together with ``state_array`` and initialized to 0, and then set only by :c:func:`!PyMonitoring_EnterScope` itself. It allows this function to determine whether event states have changed since the previous call, and to return quickly if they have not.
pt_br: O argumento ``version`` é um ponteiro para um valor que deve ser alocado pelo usuário junto com ``state_array`` e inicializado como 0, e então definido somente pelo próprio :c:func:`!PyMonitoring_EnterScope`. Ele permite que esta função determine se os estados de eventos mudaram desde a chamada anterior, e retorne rapidamente se não mudaram.

source: The scopes referred to here are lexical scopes: a function, class or method. :c:func:`!PyMonitoring_EnterScope` should be called whenever the lexical scope is entered. Scopes can be reentered, reusing the same *state_array* and *version*, in situations like when emulating a recursive Python function. When a code-like's execution is paused, such as when emulating a generator, the scope needs to be exited and re-entered.
pt_br: Os escopos mencionados aqui são escopos lexicais: uma função, classe ou método. :c:func:`!PyMonitoring_EnterScope` deve ser chamada sempre que o escopo lexical for inserido. Os escopos podem ser inseridos novamente, reutilizando o mesmo *state_array* e *version*, em situações como ao emular uma função Python recursiva. Quando a execução de um código semelhante é pausada, como ao emular um gerador, o escopo precisa ser encerrado e inserido novamente.

source: The macros for *event_types* are:
pt_br: As macros para *event_types* são:

source: Event
pt_br: Evento

source: Exit the last scope that was entered with :c:func:`!PyMonitoring_EnterScope`.
pt_br: Sai do último escopo no qual se entrou com :c:func:`!PyMonitoring_EnterScope`.

source: Return true if the event corresponding to the event ID *ev* is a :ref:`local event <monitoring-event-local>`.
pt_br: Retorna verdadeiro se o evento correspondente ao ID do evento *ev* for um :ref:`evento local <monitoring-event-local>`.

source: This function is :term:`soft deprecated`.
pt_br: Esta função está :term:`suavemente descontinuada <suavemente descontinuado>`.
