Repository: python/python-docs-pt-br
Catalog: c-api/picklebuffer.po
Languages: pt_br

source: Pickle buffer objects
pt_br: Objetos buffer serializados com pickle

source: A :class:`pickle.PickleBuffer` object wraps a :ref:`buffer-providing object <bufferobjects>` for out-of-band data transfer with the :mod:`pickle` module.
pt_br: Um objeto :class:`pickle.PickleBuffer` encapsula um :ref:`objeto provedor de buffer <bufferobjects>` para transferência de dados fora de banda com o módulo :mod:`pickle`.

source: This instance of :c:type:`PyTypeObject` represents the Python pickle buffer type. This is the same object as :class:`pickle.PickleBuffer` in the Python layer.
pt_br: Esta instância de :c:type:`PyTypeObject` representa o tipo de buffer serializado com pickle do Python. Este é o mesmo objeto que :class:`pickle.PickleBuffer` na camada Python.

source: Return true if *op* is a pickle buffer instance. This function always succeeds.
pt_br: Retorna verdadeiro se *op* for uma instância de buffer serializado com pickle. Esta função sempre tem sucesso.

source: Create a pickle buffer from the object *obj*.
pt_br: Cria um buffer serializado com pickle a partir do objeto *obj*.

source: This function will fail if *obj* doesn't support the :ref:`buffer protocol <bufferobjects>`.
pt_br: Esta função falhará se *obj* não oferecer suporte ao :ref:`protocolo de buffer <bufferobjects>`.

source: On success, return a new pickle buffer instance. On failure, set an exception and return ``NULL``.
pt_br: Em caso de sucesso, retorna uma nova instância de buffer serializado com pickle. Em caso de falha, define uma exceção e retorna ``NULL``.

source: Analogous to calling :class:`pickle.PickleBuffer` with *obj* in Python.
pt_br: Análogo a chamar :class:`pickle.PickleBuffer` com *obj* em Python.

source: Get a pointer to the underlying :c:type:`Py_buffer` that the pickle buffer wraps.
pt_br: Obtém um ponteiro para o :c:type:`Py_buffer` subjacente que o buffer serializado com pickle encapsula.

source: The returned pointer is valid as long as *picklebuf* is alive and has not been released. The caller must not modify or free the returned :c:type:`Py_buffer`. If the pickle buffer has been released, raise :exc:`ValueError`.
pt_br: O ponteiro retornado é válido enquanto *picklebuf* estiver ativo e não tiver sido liberado. O chamador não deve modificar ou liberar o :c:type:`Py_buffer` retornado. Se o buffer serializado com pickle tiver sido liberado, levanta uma exceção :exc:`ValueError`.

source: On success, return a pointer to the buffer view. On failure, set an exception and return ``NULL``.
pt_br: Em caso de sucesso, retorna um ponteiro para a visualização do buffer. Em caso de falha, define uma exceção e retorna ``NULL``.

source: Release the underlying buffer held by the pickle buffer.
pt_br: Libera o buffer subjacente mantido pelo buffer serializado com pickle.

source: Return ``0`` on success. On failure, set an exception and return ``-1``.
pt_br: Retorna ``0`` em caso de sucesso. Em caso de falha, define uma exceção e retorna ``-1``.

source: Analogous to calling :meth:`pickle.PickleBuffer.release` in Python.
pt_br: Análogo a chamar :meth:`pickle.PickleBuffer.release` em Python.

source: object
pt_br: objeto
