Repository: python/python-docs-pt-br
Catalog: c-api/reflection.po
Languages: pt_br

source: Reflection
pt_br: Reflexão

source: Use :c:func:`PyEval_GetFrameBuiltins` instead.
pt_br: Use :c:func:`PyEval_GetFrameBuiltins`.

source: Return a dictionary of the builtins in the current execution frame, or the interpreter of the thread state if no frame is currently executing.
pt_br: Retorna um dicionário dos componentes embutidos no quadro de execução atual ou o interpretador do estado da thread, se nenhum quadro estiver em execução no momento.

source: Use either :c:func:`PyEval_GetFrameLocals` to obtain the same behaviour as calling :func:`locals` in Python code, or else call :c:func:`PyFrame_GetLocals` on the result of :c:func:`PyEval_GetFrame` to access the :attr:`~frame.f_locals` attribute of the currently executing frame.
pt_br: Use :c:func:`PyEval_GetFrameLocals` para obter o mesmo comportamento que chamar :func:`locals` no código Python, ou então chame :c:func:`PyFrame_GetLocals` no resultado de :c:func:`PyEval_GetFrame` para acessar o atributo :attr:`~frame.f_locals` do quadro atualmente em execução.

source: Return a mapping providing access to the local variables in the current execution frame, or ``NULL`` if no frame is currently executing.
pt_br: Retorna um mapeamento fornecendo acesso às variáveis locais no quadro de execução atual ou ``NULL`` se nenhum quadro estiver sendo executado no momento.

source: Refer to :func:`locals` for details of the mapping returned at different scopes.
pt_br: Consulte :func:`locals` para detalhes do mapeamento retornado em diferentes escopos.

source: As this function returns a :term:`borrowed reference`, the dictionary returned for :term:`optimized scopes <optimized scope>` is cached on the frame object and will remain alive as long as the frame object does. Unlike :c:func:`PyEval_GetFrameLocals` and :func:`locals`, subsequent calls to this function in the same frame will update the contents of the cached dictionary to reflect changes in the state of the local variables rather than returning a new snapshot.
pt_br: Como esta função retorna uma :term:`referência emprestada`, o dicionário retornado para :term:`escopos otimizados <optimized scope>` é armazenado em cache no objeto frame e permanecerá ativo enquanto o objeto frame o fizer. Ao contrário de :c:func:`PyEval_GetFrameLocals` e :func:`locals`, chamadas subsequentes para esta função no mesmo quadro atualizarão o conteúdo do dicionário em cache para refletir as mudanças no estado das variáveis ​locais em vez de retornar um novo snapshot.

source: As part of :pep:`667`, :c:func:`PyFrame_GetLocals`, :func:`locals`, and :attr:`FrameType.f_locals <frame.f_locals>` no longer make use of the shared cache dictionary. Refer to the :ref:`What's New entry <whatsnew313-locals-semantics>` for additional details.
pt_br: Como parte da :pep:`667`, :c:func:`PyFrame_GetLocals`, :func:`locals` e :attr:`FrameType.f_locals <frame.f_locals>` não fazem mais uso do dicionário de cache compartilhado. Consulte a :ref:`entrada de O Que Há de Novo <whatsnew313-locals-semantics>` para detalhes adicionais.

source: Use :c:func:`PyEval_GetFrameGlobals` instead.
pt_br: Use :c:func:`PyEval_GetFrameGlobals`.

source: Return a dictionary of the global variables in the current execution frame, or ``NULL`` if no frame is currently executing.
pt_br: Retorna um dicionário das variáveis globais no quadro de execução atual ou ``NULL`` se nenhum quadro estiver sendo executado no momento.

source: Return the current thread state's frame, which is ``NULL`` if no frame is currently executing.
pt_br: Retorna o quadro do estado atual da thread, que é ``NULL`` se nenhum quadro estiver em execução no momento.

source: See also :c:func:`PyThreadState_GetFrame`.
pt_br: Veja também :c:func:`PyThreadState_GetFrame`.

source: Return a dictionary of the local variables in the current execution frame, or ``NULL`` if no frame is currently executing. Equivalent to calling :func:`locals` in Python code.
pt_br: Retorna um dicionário das variáveis locais no quadro de execução atual ou ``NULL`` se nenhum quadro estiver sendo executado no momento. Equivalente a chamar :func:`locals` em código Python.

source: To access :attr:`~frame.f_locals` on the current frame without making an independent snapshot in :term:`optimized scopes <optimized scope>`, call :c:func:`PyFrame_GetLocals` on the result of :c:func:`PyEval_GetFrame`.
pt_br: Para acessar :attr:`~frame.f_locals` no quadro atual sem fazer um snapshot independente em :term:`escopos otimizados <optimized scope>`, chame :c:func:`PyFrame_GetLocals` no resultado de :c:func:`PyEval_GetFrame`.

source: Return a dictionary of the global variables in the current execution frame, or ``NULL`` if no frame is currently executing. Equivalent to calling :func:`globals` in Python code.
pt_br: Retorna um dicionário das variáveis globais no quadro de execução atual ou ``NULL`` se nenhum quadro estiver sendo executado no momento. Equivalente a chamar :func:`globals` em código Python.

source: Return the name of *func* if it is a function, class or instance object, else the name of *func*\s type.
pt_br: Retorna o nome de *func* se for uma função, classe ou objeto de instância, senão o nome do tipo da *func*.

source: Return a description string, depending on the type of *func*. Return values include "()" for functions and methods, " constructor", " instance", and " object". Concatenated with the result of :c:func:`PyEval_GetFuncName`, the result will be a description of *func*.
pt_br: Retorna uma sequência de caracteres de descrição, dependendo do tipo de *func*. Os valores de retorno incluem "()" para funções e métodos, " constructor", " instance" e " object".. Concatenado com o resultado de :c:func:`PyEval_GetFuncName`, o resultado será uma descrição de *func*.
