Repository: python/python-docs-pt-br
Catalog: c-api/slice.po
Languages: pt_br

source: Slice Objects
pt_br: Objetos Slice

source: The type object for slice objects. This is the same as :class:`slice` in the Python layer.
pt_br: Tipo de objeto para objetos fatia. Isso é o mesmo que :class:`slice` na camada Python.

source: Return true if *ob* is a slice object; *ob* must not be ``NULL``. This function always succeeds.
pt_br: Retorna true se *ob* for um objeto fatia; *ob* não deve ser ``NULL``. Esta função sempre tem sucesso.

source: Return a new slice object with the given values. The *start*, *stop*, and *step* parameters are used as the values of the slice object attributes of the same names. Any of the values may be ``NULL``, in which case the ``None`` will be used for the corresponding attribute.
pt_br: Retorna um novo objeto fatia com os valores fornecidos. Os parâmetros *start*, *stop* e *step* são usados como os valores dos atributos do objeto fatia com os mesmos nomes. Qualquer um dos valores pode ser ``NULL``, caso em que ``None`` será usado para o atributo correspondente.

source: Return ``NULL`` with an exception set if the new object could not be allocated.
pt_br: Retorna ``NULL`` com uma exceção definida se o novo objeto não puder ser alocado.

source: Retrieve the start, stop and step indices from the slice object *slice*, assuming a sequence of length *length*. Treats indices greater than *length* as errors.
pt_br: Recupera os índices de início, parada e intermediário do objeto fatia *slice*, presumindo uma sequência de comprimento *length*. Trata índices maiores que *length* como erros.

source: Returns ``0`` on success and ``-1`` on error with no exception set (unless one of the indices was not ``None`` and failed to be converted to an integer, in which case ``-1`` is returned with an exception set).
pt_br: Retorna ``0`` em caso de sucesso e ``-1`` em caso de erro sem exceção definida (a menos que um dos índices não fosse ``None`` e falhou ao ser convertido para um inteiro, neste caso ``-1`` é retornado com uma exceção definida).

source: You probably do not want to use this function.
pt_br: Você provavelmente não deseja usar esta função.

source: The parameter type for the *slice* parameter was ``PySliceObject*`` before.
pt_br: O tipo de parâmetro para o parâmetro *slice* era antes de ``PySliceObject*``.

source: Usable replacement for :c:func:`PySlice_GetIndices`. Retrieve the start, stop, and step indices from the slice object *slice* assuming a sequence of length *length*, and store the length of the slice in *slicelength*. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
pt_br: Substituição utilizável para :c:func:`PySlice_GetIndices`. Recupera os índices de início, parada e intermediário do objeto fatia *slice* presumindo uma sequência de comprimento *length* e armazena o comprimento da fatia em *slicelength*. Índices fora dos limites são cortados de maneira consistente com o tratamento de fatias normais.

source: Return ``0`` on success and ``-1`` on error with an exception set.
pt_br: Retorna ``0`` em caso de sucesso e ``-1`` em caso de erro com uma exceção definida.

source: This function is considered not safe for resizable sequences. Its invocation should be replaced by a combination of :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` where ::
pt_br: Esta função não é considerada segura para sequências redimensionáveis. Sua invocação deve ser substituída por uma combinação de :c:func:`PySlice_Unpack` e :c:func:`PySlice_AdjustIndices` sendo ::

source: if (PySlice_GetIndicesEx(slice, length, &start, &stop, &step, &slicelength) < 0) { // return error }
pt_br: if (PySlice_GetIndicesEx(slice, length, &start, &stop, &step, &slicelength) < 0) { // retorna erro }

source: is replaced by ::
pt_br: substituído por ::

source: if (PySlice_Unpack(slice, &start, &stop, &step) < 0) { // return error } slicelength = PySlice_AdjustIndices(length, &start, &stop, step);
pt_br: if (PySlice_Unpack(slice, &start, &stop, &step) < 0) { // retorna erro } slicelength = PySlice_AdjustIndices(length, &start, &stop, step);

source: If ``Py_LIMITED_API`` is not set or set to the value between ``0x03050400`` and ``0x03060000`` (not including) or ``0x03060100`` or higher :c:func:`!PySlice_GetIndicesEx` is implemented as a macro using :c:func:`!PySlice_Unpack` and :c:func:`!PySlice_AdjustIndices`. Arguments *start*, *stop* and *step* are evaluated more than once.
pt_br: Se ``Py_LIMITED_API`` não estiver definido ou estiver definido com um valor entre ``0x03050400`` e ``0x03060000`` (não incluso) ou ``0x03060100`` ou mais alto, :c:func:`!PySlice_GetIndicesEx` é implementado como uma macro usando :c:func:`!PySlice_Unpack` e :c:func:`!PySlice_AdjustIndices`. Os argumentos *start*, *stop* e *step* são avaliados mais de uma vez.

source: If ``Py_LIMITED_API`` is set to the value less than ``0x03050400`` or between ``0x03060000`` and ``0x03060100`` (not including) :c:func:`!PySlice_GetIndicesEx` is a deprecated function.
pt_br: Se ``Py_LIMITED_API`` estiver definido para um valor menor que ``0x03050400`` ou entre ``0x03060000`` e ``0x03060100`` (não incluso), :c:func:`!PySlice_GetIndicesEx` é uma função descontinuada.

source: Extract the start, stop and step data members from a slice object as C integers. Silently reduce values larger than ``PY_SSIZE_T_MAX`` to ``PY_SSIZE_T_MAX``, silently boost the start and stop values less than ``PY_SSIZE_T_MIN`` to ``PY_SSIZE_T_MIN``, and silently boost the step values less than ``-PY_SSIZE_T_MAX`` to ``-PY_SSIZE_T_MAX``.
pt_br: Extrai os membros de dados de início, parada e intermediário de um objeto fatia como C inteiros. Reduz silenciosamente os valores maiores do que ``PY_SSIZE_T_MAX`` para ``PY_SSIZE_T_MAX``, aumenta silenciosamente os valores de início e parada menores que ``PY_SSIZE_T_MIN`` para ``PY_SSIZE_T_MIN``, e silenciosamente aumenta os valores de intermediário menores que ``-PY_SSIZE_T_MAX`` para ``-PY_SSIZE_T_MAX``.

source: Return ``-1`` with an exception set on error, ``0`` on success.
pt_br: Retorna ``-1`` com uma exceção definida em caso de erro, ``0`` em caso de sucesso.

source: Adjust start/end slice indices assuming a sequence of the specified length. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
pt_br: Ajusta os índices de fatias inicial/final presumindo uma sequência do comprimento especificado. Índices fora dos limites são cortados de maneira consistente com o tratamento de fatias normais.

source: Return the length of the slice. Always successful. Doesn't call Python code.
pt_br: Retorna o comprimento da fatia. Sempre bem-sucedido. Não chama o código Python.

source: Ellipsis Object
pt_br: Objeto Ellipsis

source: The type of Python :const:`Ellipsis` object. Same as :class:`types.EllipsisType` in the Python layer.
pt_br: O tipo do objeto Python :const:`Ellipsis`. O mesmo que :class:`types.EllipsisType` na camada Python.

source: The Python ``Ellipsis`` object. This object has no methods. Like :c:data:`Py_None`, it is an :term:`immortal` singleton object.
pt_br: O objeto Python ``Ellipsis``. Este objeto não tem métodos. Como :c:data:`Py_None`, é um objeto singleton :term:`imortal`.

source: :c:data:`Py_Ellipsis` is immortal.
pt_br: :c:data:`Py_Ellipsis` é imortal.
