Repository: python/python-docs-pt-br
Catalog: c-api/sys.po
Languages: pt_br

source: The *userData* pointer is passed into the hook function. Since hook functions may be called from different runtimes, this pointer should not refer directly to Python state.
pt_br: O ponteiro *userData* é passado para a função de gancho. Como as funções de gancho podem ser chamadas de diferentes tempos de execução, esse ponteiro não deve se referir diretamente ao estado do Python.

source: This function is safe to call before :c:func:`Py_Initialize`. When called after runtime initialization, existing audit hooks are notified and may silently abort the operation by raising an error subclassed from :class:`Exception` (other errors will not be silenced).
pt_br: Esta função pode ser chamada com segurança antes de :c:func:`Py_Initialize`. Quando chamada após a inicialização em tempo de execução, os ganchos de auditoria existentes são notificados e podem abortar silenciosamente a operação, levantando um erro da classe :class:`Exception` (outros erros não serão silenciados).

source: The hook function is always called with an :term:`attached thread state` by the Python interpreter that raised the event.
pt_br: A função de gancho é sempre chamada com um :term:`estado de thread anexado` pelo interpretador Python que levantou o evento.

source: See :pep:`578` for a detailed description of auditing. Functions in the runtime and standard library that raise events are listed in the :ref:`audit events table <audit-events>`. Details are in each function's documentation.
pt_br: Consulte a :pep:`578` para uma descrição detalhada da auditoria. As funções no ambiente de execução e na biblioteca padrão que levantam eventos estão listadas na :ref:`tabela de eventos de auditoria <audit-events>`. Os detalhes estão na documentação de cada função.

source: If the interpreter is initialized, this function raises an auditing event ``sys.addaudithook`` with no arguments. If any existing hooks raise an exception derived from :class:`Exception`, the new hook will not be added and the exception is cleared. As a result, callers cannot assume that their hook has been added unless they control all existing hooks.
pt_br: Se o interpretador estiver inicializado, esta função levanta um evento de auditoria ``sys.addaudithook`` sem argumentos. Se algum gancho existente levantar uma exceção derivada de :class:`Exception`, o novo gancho não será adicionado e a exceção será tratada. Consequentemente, os chamadores não podem presumir que seu gancho foi adicionado, a menos que controlem todos os ganchos existentes.

source: The type of the hook function. *event* is the C string event argument passed to :c:func:`PySys_Audit` or :c:func:`PySys_AuditTuple`. *args* is guaranteed to be a :c:type:`PyTupleObject`. *userData* is the argument passed to PySys_AddAuditHook().
pt_br: O tipo da função de gancho. *event* é o argumento de evento em string C passado para :c:func:`PySys_Audit` ou :c:func:`PySys_AuditTuple`. *args* tem a garantia de ser um :c:type:`PyTupleObject`. *userData* é o argumento passado para PySys_AddAuditHook().

source: Process Control
pt_br: Controle de processos

source: Print a fatal error message and kill the process. No cleanup is performed. This function should only be invoked when a condition is detected that would make it dangerous to continue using the Python interpreter; e.g., when the object administration appears to be corrupted. On Unix, the standard C library function :c:func:`!abort` is called which will attempt to produce a :file:`core` file.
pt_br: Exibe uma mensagem de erro fatal e encerra forçadamente o processo. Nenhuma limpeza é realizada. Esta função só deve ser invocada quando uma condição for detectada que torne perigoso continuar usando o interpretador Python; por exemplo, quando a administração de objetos parecer estar corrompida. No Unix, a função da biblioteca padrão C :c:func:`!abort` é chamada, que tentará produzir um arquivo :file:`core`.

source: The ``Py_FatalError()`` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined.
pt_br: A função ``Py_FatalError()`` é substituída por uma macro que registra automaticamente o nome da função atual, a menos que a macro ``Py_LIMITED_API`` esteja definida.

source: Log the function name automatically.
pt_br: Registra o nome da função automaticamente.

source: Exit the current process. This calls :c:func:`Py_FinalizeEx` and then calls the standard C library function ``exit(status)``. If :c:func:`Py_FinalizeEx` indicates an error, the exit status is set to 120.
pt_br: Encerra o processo atual. Isso chama :c:func:`Py_FinalizeEx` e, em seguida, chama a função da biblioteca padrão C ``exit(status)``. Se :c:func:`Py_FinalizeEx` indicar um erro, o código de status de saída será definido como 120.

source: Errors from finalization no longer ignored.
pt_br: Erros da finalização não são mais ignorados.

source: Register a cleanup function to be called by :c:func:`Py_FinalizeEx`. The cleanup function will be called with no arguments and should return no value. At most 32 cleanup functions can be registered. When the registration is successful, :c:func:`Py_AtExit` returns ``0``; on failure, it returns ``-1``. The cleanup function registered last is called first. Each cleanup function will be called at most once. Since Python's internal finalization will have completed before the cleanup function, no Python APIs should be called by *func*.
pt_br: Registra uma função de limpeza para ser chamada por :c:func:`Py_FinalizeEx`. A função de limpeza será chamada sem argumentos e não deve retornar nenhum valor. No máximo 32 funções de limpeza podem ser registradas. Quando o registro for bem-sucedido, :c:func:`Py_AtExit` retorna ``0``; em caso de falha, retorna ``-1``. A última função de limpeza registrada é chamada primeiro. Cada função de limpeza será chamada no máximo uma vez. Como a finalização interna do Python terá sido concluída antes da função de limpeza, nenhuma API do Python deve ser chamada por *func*.

source: :c:func:`PyUnstable_AtExit` for passing a ``void *data`` argument.
pt_br: :c:func:`PyUnstable_AtExit` para passar um argumento ``void *data``.

source: USE_STACKCHECK (C macro)
pt_br: USE_STACKCHECK (macro C)

source: abort (C function)
pt_br: abort (função C)

source: Py_FinalizeEx (C function)
pt_br: Py_FinalizeEx (função C)

source: exit (C function)
pt_br: exit (função C)

source: cleanup functions
pt_br: funções de limpeza
