Repository: python/python-docs-pt-br
Catalog: c-api/sys.po
Languages: pt_br

source: Operating System Utilities
pt_br: Utilitários do sistema operacional

source: Return the file system representation for *path*. If the object is a :class:`str` or :class:`bytes` object, then a new :term:`strong reference` is returned. If the object implements the :class:`os.PathLike` interface, then :meth:`~os.PathLike.__fspath__` is returned as long as it is a :class:`str` or :class:`bytes` object. Otherwise :exc:`TypeError` is raised and ``NULL`` is returned.
pt_br: Retorna a representação do sistema de arquivos para *path*. Se o objeto for um objeto :class:`str` ou :class:`bytes`, então uma nova :term:`referência forte` é retornada. Se o objeto implementa a interface :class:`os.PathLike`, então :meth:`~os.PathLike.__fspath__` é retornado desde que seja um objeto :class:`str` ou :class:`bytes`. Caso contrário, :exc:`TypeError` é levantada e ``NULL`` é retornado.

source: Return true (nonzero) if the standard I/O file *fp* with name *filename* is deemed interactive. This is the case for files for which ``isatty(fileno(fp))`` is true. If the :c:member:`PyConfig.interactive` is non-zero, this function also returns true if the *filename* pointer is ``NULL`` or if the name is equal to one of the strings ``'<stdin>'`` or ``'???'``.
pt_br: Retorna verdadeiro (não zero) se o arquivo padrão de E/S *fp* com o nome *filename* for considerado interativo. Este é o caso dos arquivos para os quais ``isatty(fileno(fp))`` é verdade. Se :c:member:`PyConfig.interactive` for não zero, esta função também retorna true se o ponteiro *filename* for ``NULL`` ou se o nome for igual a uma das strings ``'<stdin>'`` ou ``'???'``.

source: This function must not be called before Python is initialized.
pt_br: Esta função não deve ser chamada antes da inicialização do Python.

source: Function to prepare some internal state before a process fork. This should be called before calling :c:func:`fork` or any similar function that clones the current process. Only available on systems where :c:func:`fork` is defined.
pt_br: Função para preparar algum estado interno antes de ser feito um fork do processo. Isso deve ser chamado antes de chamar :c:func:`fork` ou qualquer função semelhante que clone o processo atual. Disponível apenas em sistemas onde :c:func:`fork` é definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_BeforeFork()``.
pt_br: A chamada C :c:func:`fork` só deve ser feita a partir da :ref:`thread "main" <fork-and-threads>` (do :ref:`interpretador "main" <sub-interpreter-support>`). O mesmo vale para ``PyOS_BeforeFork()``.

source: Function to update some internal state after a process fork. This should be called from the parent process after calling :c:func:`fork` or any similar function that clones the current process, regardless of whether process cloning was successful. Only available on systems where :c:func:`fork` is defined.
pt_br: Função para atualizar algum estado interno depois de ser feito um fork do processo. Isso deve ser chamado a partir do processo pai depois de chamar :c:func:`fork` ou qualquer função semelhante que clone o processo atual, independentemente da clonagem do processo ter sido bem-sucedida ou não. Disponível apenas em sistemas onde :c:func:`fork` é definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Parent()``.
pt_br: A chamada C :c:func:`fork` só deve ser feita a partir da :ref:`thread "main" <fork-and-threads>` (do :ref:`interpretador "main" <sub-interpreter-support>`). O mesmo vale para ``PyOS_AfterFork_Parent()``.

source: Function to update internal interpreter state after a process fork. This must be called from the child process after calling :c:func:`fork`, or any similar function that clones the current process, if there is any chance the process will call back into the Python interpreter. Only available on systems where :c:func:`fork` is defined.
pt_br: Função para atualizar o estado interno do interpretador depois de ser feito um fork do processo. Isso deve ser chamado a partir do processo filho depois de chamar :c:func:`fork` ou qualquer função semelhante que clone o processo atual, se houver alguma chance do processo ter uma chamada de retorno para o interpretador Python. Disponível apenas em sistemas onde :c:func:`fork` é definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Child()``.
pt_br: A chamada C :c:func:`fork` só deve ser feita a partir da :ref:`thread "main" <fork-and-threads>` (do :ref:`interpretador "main" <sub-interpreter-support>`). O mesmo vale para ``PyOS_AfterFork_Child()``.

source: :func:`os.register_at_fork` allows registering custom Python functions to be called by :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
pt_br: :func:`os.register_at_fork` permite registrar funções personalizadas do Python para serem chamadas por :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` e :c:func:`PyOS_AfterFork_Child`.

source: Function to update some internal state after a process fork; this should be called in the new process if the Python interpreter will continue to be used. If a new executable is loaded into the new process, this function does not need to be called.
pt_br: Função para atualizar algum estado interno após ser feito um fork de processo; isso deve ser chamado no novo processo se o interpretador do Python continuar a ser usado. Se um novo executável é carregado no novo processo, esta função não precisa ser chamada.

source: This function is superseded by :c:func:`PyOS_AfterFork_Child()`.
pt_br: Esta função foi sucedida por :c:func:`PyOS_AfterFork_Child()`.

source: Return true when the interpreter runs out of stack space. This is a reliable check, but is only available when :c:macro:`!USE_STACKCHECK` is defined (currently on certain versions of Windows using the Microsoft Visual C++ compiler). :c:macro:`!USE_STACKCHECK` will be defined automatically; you should never change the definition in your own code.
pt_br: Retorna verdadeiro quando o interpretador fica sem espaço na pilha. Esta é uma verificação confiável, mas só está disponível quando :c:macro:`!USE_STACKCHECK` é definido (atualmente em certas versões do Windows usando o compilador Microsoft Visual C++). :c:macro:`!USE_STACKCHECK` será definido automaticamente; você nunca deve alterar a definição em seu próprio código.

source: Return the current signal handler for signal *i*. This is a thin wrapper around either :c:func:`!sigaction` or :c:func:`!signal`. Do not call those functions directly!
pt_br: Retorna o manipulador de sinal atual para o sinal *i*. Este é um invólucro fino em torno de :c:func:`!sigaction` ou :c:func:`!signal`. Não chame essas funções diretamente!

source: Set the signal handler for signal *i* to be *h*; return the old signal handler. This is a thin wrapper around either :c:func:`!sigaction` or :c:func:`!signal`. Do not call those functions directly!
pt_br: Define o manipulador de sinal para o sinal *i* como *h*; retornar o manipulador de sinal antigo. Este é um invólucro fino em torno de :c:func:`!sigaction` ou :c:func:`!signal`. Não chame essas funções diretamente!

source: Check if a :c:macro:`!SIGINT` signal has been received.
pt_br: Verifica se um sinal :c:macro:`!SIGINT` foi recebido.

source: Returns ``1`` if a :c:macro:`!SIGINT` has occurred and clears the signal flag, or ``0`` otherwise.
pt_br: Retorna ``1`` se um :c:macro:`!SIGINT` ocorreu e limpa o sinalizador de sinal, ou ``0`` caso contrário.

source: In most cases, you should prefer :c:func:`PyErr_CheckSignals` over this function. :c:func:`!PyErr_CheckSignals` invokes the appropriate signal handlers for all pending signals, allowing Python code to handle the signal properly. This function only detects :c:macro:`!SIGINT` and does not invoke any Python signal handlers.
pt_br: Na maioria dos casos, você deve preferir :c:func:`PyErr_CheckSignals` em vez desta função. :c:func:`!PyErr_CheckSignals` invoca os manipuladores de sinal apropriados para todos os sinais pendentes, permitindo que o código Python lide com o sinal corretamente. Esta função detecta apenas :c:macro:`!SIGINT` e não invoca nenhum manipulador de sinal do Python.

source: This function is async-signal-safe and this function cannot fail. The caller must hold an :term:`attached thread state`.
pt_br: Esta função é segura para sinais de async e não pode falhar. O chamador deve manter um :term:`estado de thread anexado`.

source: This function should not be called directly: use the :c:type:`PyConfig` API with the :c:func:`PyConfig_SetBytesString` function which ensures that :ref:`Python is preinitialized <c-preinit>`.
pt_br: Esta função não deve ser chamada diretamente: use a API :c:type:`PyConfig` com a função :c:func:`PyConfig_SetBytesString` que garante que :ref:`Python esteja pré-inicializado <c-preinit>`.

source: This function must not be called before :ref:`Python is preinitialized <c-preinit>` and so that the LC_CTYPE locale is properly configured: see the :c:func:`Py_PreInitialize` function.
pt_br: Esta função não deve ser chamada antes de :ref:`Python estar pré-inicializado <c-preinit>` e para que a localidade LC_CTYPE seja configurada corretamente: consulte a função :c:func:`Py_PreInitialize`.

source: Decode a byte string from the :term:`filesystem encoding and error handler`. If the error handler is :ref:`surrogateescape error handler <surrogateescape>`, undecodable bytes are decoded as characters in range U+DC80..U+DCFF; and if a byte sequence can be decoded as a surrogate character, the bytes are escaped using the surrogateescape error handler instead of decoding them.
pt_br: Decodifica uma string de bytes do :term:`tratador de erros e codificação do sistema de arquivos`. Se o tratador de erros for o :ref:`tratador de errors surrogateescape <surrogateescape>`, bytes não decodificáveis são decodificados como caracteres no intervalo U+DC80..U+DCFF; e se uma string de bytes puder ser decodificada como um caractere substituto, os bytes são escapados usando o tratador de erros surrogateescape em vez de decodificá-los.

source: Return a pointer to a newly allocated wide character string, use :c:func:`PyMem_RawFree` to free the memory. If size is not ``NULL``, write the number of wide characters excluding the null character into ``*size``
pt_br: Retorna um ponteiro para uma string de caracteres largos recém-alocada, usa :c:func:`PyMem_RawFree` para liberar a memória. Se o tamanho não for ``NULL``, escreve o número de caracteres largos excluindo o caractere nulo em ``*size``

source: Return ``NULL`` on decoding error or memory allocation error. If *size* is not ``NULL``, ``*size`` is set to ``(size_t)-1`` on memory error or set to ``(size_t)-2`` on decoding error.
pt_br: Retorna ``NULL`` em erro de decodificação ou erro de alocação de memória. Se *size* não for ``NULL``, ``*size`` é definido como ``(size_t)-1`` em erro de memória ou definido como ``(size_t)-2`` em erro de decodificação.

source: The :term:`filesystem encoding and error handler` are selected by :c:func:`PyConfig_Read`: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
pt_br: :term:`tratador de erros e codificação do sistema de arquivos` são selecionados por :c:func:`PyConfig_Read`: veja os membros :c:member:`~PyConfig.filesystem_encoding` e :c:member:`~PyConfig.filesystem_errors` de :c:type:`PyConfig`.

source: Decoding errors should never happen, unless there is a bug in the C library.
pt_br: Erros de decodificação nunca devem acontecer, a menos que haja um bug na biblioteca C.

source: Use the :c:func:`Py_EncodeLocale` function to encode the character string back to a byte string.
pt_br: Use a função :c:func:`Py_EncodeLocale` para codificar a string de caracteres de volta para uma string de bytes.

source: The :c:func:`PyUnicode_DecodeFSDefaultAndSize` and :c:func:`PyUnicode_DecodeLocaleAndSize` functions.
pt_br: As funções :c:func:`PyUnicode_DecodeFSDefaultAndSize` e :c:func:`PyUnicode_DecodeLocaleAndSize`.

source: The function now uses the UTF-8 encoding in the :ref:`Python UTF-8 Mode <utf8-mode>`.
pt_br: A função agora usa a codificação UTF-8 no :ref:`Modo UTF-8 do Python <utf8-mode>`.

source: The function now uses the UTF-8 encoding on Windows if :c:member:`PyPreConfig.legacy_windows_fs_encoding` is zero;
pt_br: A função agora usa a codificação UTF-8 no Windows se :c:member:`PyPreConfig.legacy_windows_fs_encoding` for zero;

source: Encode a wide character string to the :term:`filesystem encoding and error handler`. If the error handler is :ref:`surrogateescape error handler <surrogateescape>`, surrogate characters in the range U+DC80..U+DCFF are converted to bytes 0x80..0xFF.
pt_br: Codifica uma string de caracteres largos para o :term:`tratador de erros e codificação do sistema de arquivos`. Se o tratador de erros for um :ref:`tratador de erros substituto <surrogateescape>`, os caracteres substitutos no intervalo U+DC80..U+DCFF são convertidos em bytes 0x80..0xFF.

source: Return a pointer to a newly allocated byte string, use :c:func:`PyMem_Free` to free the memory. Return ``NULL`` on encoding error or memory allocation error.
pt_br: Retorna um ponteiro para uma string de bytes recém-alocada; use :c:func:`PyMem_Free` para liberar a memória. Retorna ``NULL`` em caso de erro de codificação ou de erro de alocação de memória.

source: If error_pos is not ``NULL``, ``*error_pos`` is set to ``(size_t)-1`` on success, or set to the index of the invalid character on encoding error.
pt_br: Se error_pos não for ``NULL``, ``*error_pos`` será definido como ``(size_t)-1`` em caso de sucesso, ou definido como o índice do caractere inválido em caso de erro de codificação.

source: Use the :c:func:`Py_DecodeLocale` function to decode the bytes string back to a wide character string.
pt_br: Use a função :c:func:`Py_DecodeLocale` para decodificar a string de bytes de volta para uma string de caracteres largos.

source: The :c:func:`PyUnicode_EncodeFSDefault` and :c:func:`PyUnicode_EncodeLocale` functions.
pt_br: As funções :c:func:`PyUnicode_EncodeFSDefault` e :c:func:`PyUnicode_EncodeLocale`.

source: The function now uses the UTF-8 encoding on Windows if :c:member:`PyPreConfig.legacy_windows_fs_encoding` is zero.
pt_br: A função agora usa a codificação UTF-8 no Windows se :c:member:`PyPreConfig.legacy_windows_fs_encoding` for zero.

source: Similar to :c:func:`!fopen`, but *path* is a Python object and an exception is set on error.
pt_br: Semelhante a :c:func:`!fopen`, mas *path* é um objeto Python e uma exceção é definida em caso de erro.

source: *path* must be a :class:`str` object, a :class:`bytes` object, or a :term:`path-like object`.
pt_br: *path* deve ser um objeto :class:`str`, um objeto :class:`bytes` ou um :term:`objeto caminho ou similar`.

source: On success, return the new file pointer. On error, set an exception and return ``NULL``.
pt_br: Em caso de sucesso, retorna um novo ponteiro para arquivo. Em caso de erro, define uma exceção e retorna ``NULL``.

source: The file must be closed by :c:func:`Py_fclose` rather than calling directly :c:func:`!fclose`.
pt_br: O arquivo deve ser fechado por :c:func:`Py_fclose` em vez de chamar diretamente :c:func:`!fclose`.

source: The file descriptor is created non-inheritable (:pep:`446`).
pt_br: O descritor de arquivo é criado não herdável (:pep:`446`).

source: The caller must have an :term:`attached thread state`.
pt_br: O chamador deve ter um :term:`estado de thread anexado`.

source: Close a file that was opened by :c:func:`Py_fopen`.
pt_br: Feche um arquivo que foi aberto por :c:func:`Py_fopen`.

source: On success, return ``0``. On error, return ``EOF`` and ``errno`` is set to indicate the error. In either case, any further access (including another call to :c:func:`Py_fclose`) to the stream results in undefined behavior.
pt_br: Em caso de sucesso, retorna ``0``. Em caso de erro, retorna ``EOF`` e ``errno`` é definido para indicar o erro. Em ambos os casos, qualquer acesso subsequente (incluindo outra chamada a :c:func:`Py_fclose`) ao fluxo resulta em comportamento indefinido.

source: System Functions
pt_br: Funções de sistema

source: These are utility functions that make functionality from the :mod:`sys` module accessible to C code. They all work with the current interpreter thread's :mod:`sys` module's dict, which is contained in the internal thread state structure.
pt_br: Essas são funções utilitárias que tornam a funcionalidade do módulo :mod:`sys` acessível ao código C. Todas elas funcionam com o dicionário do módulo :mod:`sys` da thread do interpretador atual, que está contido na estrutura interna do estado de thread.

source: Return the object *name* from the :mod:`sys` module or ``NULL`` if it does not exist, without setting an exception.
pt_br: Retorna o objeto *name* do módulo :mod:`sys` ou ``NULL`` se ele não existir, sem lançar uma exceção.

source: Set *name* in the :mod:`sys` module to *v* unless *v* is ``NULL``, in which case *name* is deleted from the sys module. Returns ``0`` on success, ``-1`` on error.
pt_br: Define *name* no módulo :mod:`sys` como *v*, a menos que *v* seja ``NULL``, caso em que *name* é excluído do módulo sys. Retorna ``0`` em caso de sucesso e ``-1`` em caso de erro.

source: Reset :data:`sys.warnoptions` to an empty list. This function may be called prior to :c:func:`Py_Initialize`.
pt_br: Redefine :data:`sys.warnoptions` para uma lista vazia. Esta função pode ser chamada antes de :c:func:`Py_Initialize`.

source: Clear :data:`sys.warnoptions` and :data:`!warnings.filters` instead.
pt_br: Limpe :data:`sys.warnoptions` e :data:`!warnings.filters` em vez disso.

source: Write the output string described by *format* to :data:`sys.stdout`. No exceptions are raised, even if truncation occurs (see below).
pt_br: Escreve a string de saída descrita por *format* em :data:`sys.stdout`. Nenhuma exceção será levantada, mesmo que ocorra truncamento (veja abaixo).

source: *format* should limit the total size of the formatted output string to 1000 bytes or less -- after 1000 bytes, the output string is truncated. In particular, this means that no unrestricted "%s" formats should occur; these should be limited using "%.<N>s" where <N> is a decimal number calculated so that <N> plus the maximum size of other formatted text does not exceed 1000 bytes. Also watch out for "%f", which can print hundreds of digits for very large numbers.
pt_br: *format* deve limitar o tamanho total da string de saída formatada a 1000 bytes ou menos -- após 1000 bytes, a string de saída é truncada. Em particular, isso significa que não devem ocorrer formatos "%s" irrestritos; estes devem ser limitados usando "%.1s", onde 2 é um número decimal calculado de forma que 3 mais o tamanho máximo de outros textos formatados não exceda 1000 bytes. Também fique atento a "%f", que pode exibir centenas de dígitos para números muito grandes.

source: If a problem occurs, or :data:`sys.stdout` is unset, the formatted message is written to the real (C level) *stdout*.
pt_br: Se ocorrer um problema, ou se :data:`sys.stdout` não estiver definido, a mensagem formatada será escrita na saída padrão (nível C) *stdout*.

source: As :c:func:`PySys_WriteStdout`, but write to :data:`sys.stderr` or *stderr* instead.
pt_br: Como :c:func:`PySys_WriteStdout`, mas escreve em :data:`sys.stderr` ou *stderr* em vez disso.

source: Function similar to PySys_WriteStdout() but format the message using :c:func:`PyUnicode_FromFormatV` and don't truncate the message to an arbitrary length.
pt_br: Função semelhante a PySys_WriteStdout(), mas formata a mensagem usando :c:func:`PyUnicode_FromFormatV` e não trunca a mensagem para um comprimento arbitrário.

source: As :c:func:`PySys_FormatStdout`, but write to :data:`sys.stderr` or *stderr* instead.
pt_br: Como :c:func:`PySys_FormatStdout`, mas escreve em :data:`sys.stderr` ou *stderr* em vez disso.

source: Return the current dictionary of :option:`-X` options, similarly to :data:`sys._xoptions`. On error, ``NULL`` is returned and an exception is set.
pt_br: Retorna o dicionário atual de opções :option:`-X`, de forma semelhante a :data:`sys._xoptions`. Em caso de erro, retorna ``NULL`` e uma exceção é definida.

source: Raise an auditing event with any active hooks. Return zero for success and non-zero with an exception set on failure.
pt_br: Levanta um evento de auditoria com todos os ganchos ativos. Retorna zero em caso de sucesso e um valor diferente de zero com uma exceção definida em caso de falha.

source: The *event* string argument must not be *NULL*.
pt_br: O argumento de string *event* não pode ser *NULL*.

source: If any hooks have been added, *format* and other arguments will be used to construct a tuple to pass. Apart from ``N``, the same format characters as used in :c:func:`Py_BuildValue` are available. If the built value is not a tuple, it will be added into a single-element tuple.
pt_br: Se algum gancho tiver sido adicionado, o argumento *format* e outros serão usados para construir uma tupla a ser passada. Além de ``N``, os mesmos caracteres de formatação usados em :c:func:`Py_BuildValue` estão disponíveis. Se o valor construído não for uma tupla, ele será adicionado a uma tupla de um único elemento.

source: The ``N`` format option must not be used. It consumes a reference, but since there is no way to know whether arguments to this function will be consumed, using it may cause reference leaks.
pt_br: A opção de formato ``N`` não deve ser usada. Ela consome uma referência, mas como não há como saber se os argumentos dessa função serão consumidos, usá-la pode causar vazamentos de referência.

source: Note that ``#`` format characters should always be treated as :c:type:`Py_ssize_t`, regardless of whether ``PY_SSIZE_T_CLEAN`` was defined.
pt_br: Observe que os caracteres de formato ``#`` devem sempre ser tratados como :c:type:`Py_ssize_t`, independentemente de ``PY_SSIZE_T_CLEAN`` ter sido definido.

source: :func:`sys.audit` performs the same function from Python code.
pt_br: :func:`sys.audit` executa a mesma função a partir do código Python.

source: See also :c:func:`PySys_AuditTuple`.
pt_br: Veja também :c:func:`PySys_AuditTuple`.

source: Require :c:type:`Py_ssize_t` for ``#`` format characters. Previously, an unavoidable deprecation warning was raised.
pt_br: É necessário o tipo :c:type:`Py_ssize_t` para caracteres de formato ``#``. Anteriormente, um aviso de descontinuação era levantado.

source: Similar to :c:func:`PySys_Audit`, but pass arguments as a Python object. *args* must be a :class:`tuple`. To pass no arguments, *args* can be *NULL*.
pt_br: Semelhante a :c:func:`PySys_Audit`, mas passa argumentos como um objeto Python. *args* deve ser uma :class:`tuple`. Para não passar argumentos, *args* pode ser *NULL*.

source: Append the callable *hook* to the list of active auditing hooks. Return zero on success and non-zero on failure. If the runtime has been initialized, also set an error on failure. Hooks added through this API are called for all interpreters created by the runtime.
pt_br: Adiciona o *gancho* chamável à lista de ganchos de auditoria ativos. Retorna zero em caso de sucesso e um valor diferente de zero em caso de falha. Se o ambiente de execução já tiver sido inicializado, também define um erro em caso de falha. Os ganchos adicionados por meio desta API são chamados para todos os interpretadores criados pelo ambiente de execução.
