Repository: python/python-docs-pt-br
Catalog: c-api/time.po
Languages: pt_br

source: PyTime C API
pt_br: API C PyTime

source: The clock C API provides access to system clocks. It is similar to the Python :mod:`time` module.
pt_br: A API C de relógios provê acesso a relógios do sistema. Ela é similar ao módulo Python :mod:`time`.

source: For C API related to the :mod:`datetime` module, see :ref:`datetimeobjects`.
pt_br: Para uma API C relacionada ao módulo :mod:`datetime`, veja :ref:`datetimeobjects`.

source: Types
pt_br: Tipos

source: A timestamp or duration in nanoseconds, represented as a signed 64-bit integer.
pt_br: Um registro de data e hora ou uma duração em nanossegundos, representados como um inteiro de 64 bits com sinal.

source: The reference point for timestamps depends on the clock used. For example, :c:func:`PyTime_Time` returns timestamps relative to the UNIX epoch.
pt_br: O ponto de referência para registros de data e hora depende do relógio usado. Por exemplo, :c:func:`PyTime_Time` retorna registros relativos à época UNIX.

source: The supported range is around [-292.3 years; +292.3 years]. Using the Unix epoch (January 1st, 1970) as reference, the supported date range is around [1677-09-21; 2262-04-11]. The exact limits are exposed as constants:
pt_br: É suportada uma amplitude em torno de [-292.3 anos; +292.3 anos]. Usando o início da época UNIX (1º de Janeiro de 1970) como referência, a gama de datas suportadas é em torno de [1677-09-21; 2262-04-11]. Os limites exatos são expostos como constantes:

source: Minimum value of :c:type:`PyTime_t`.
pt_br: Valor mínimo de :c:type:`PyTime_t`.

source: Maximum value of :c:type:`PyTime_t`.
pt_br: Valor máximo de :c:type:`PyTime_t`.

source: Clock Functions
pt_br: Funções de relógio

source: The following functions take a pointer to a :c:expr:`PyTime_t` that they set to the value of a particular clock. Details of each clock are given in the documentation of the corresponding Python function.
pt_br: As funções a seguir aceitam um ponteiro para :c:expr:`PyTime_t` ao qual elas atribuem o valor de um determinado relógio. Detalhes de cada relógio estão disponíveis nas documentações das funções Python correspondentes.

source: The functions return ``0`` on success, or ``-1`` (with an exception set) on failure.
pt_br: As funções retornam ``0`` em caso de sucesso, ou ``-1`` (com uma exceção definida) em caso de falha.

source: On integer overflow, they set the :c:data:`PyExc_OverflowError` exception and set ``*result`` to the value clamped to the ``[PyTime_MIN; PyTime_MAX]`` range. (On current systems, integer overflows are likely caused by misconfigured system time.)
pt_br: Em caso de estouro de inteiros, elas definem a exceção :c:data:`PyExc_OverflowError` e definem ``*result`` como o valor limitado ao intervalo ``[PyTime_MIN; PyTime_MAX]``. (Em sistemas atuais, estouros de inteiros são provavelmente causados por uma má configuração do tempo do sistema).

source: As any other C API (unless otherwise specified), the functions must be called with an :term:`attached thread state`.
pt_br: Como qualquer outra API C (se não especificado o contrário), as funções devem ser chamadas com um :term:`estado de thread anexado`.

source: Read the monotonic clock. See :func:`time.monotonic` for important details on this clock.
pt_br: Lê o relógio monótono. Veja :func:`time.monotonic` para detalhes importantes sobre este relógio.

source: Read the performance counter. See :func:`time.perf_counter` for important details on this clock.
pt_br: Lê o contador de desempenho. Veja :func:`time.perf_counter` para detalhes importantes sobre este relógio.

source: Read the “wall clock” time. See :func:`time.time` for details important on this clock.
pt_br: Lê o "relógio de parede". Veja :func:`time.time` para detalhes importantes sobre este relógio.

source: Raw Clock Functions
pt_br: Funções de relógio brutas

source: Similar to clock functions, but don't set an exception on error and don't require the caller to have an :term:`attached thread state`.
pt_br: Similar às funções de relógio, mas não definem uma exceção em condições de erro, e não requerem que o chamador tenha um :term:`estado de thread anexado`.

source: On success, the functions return ``0``.
pt_br: Em caso de sucesso, as funções retornam ``0``.

source: On failure, they set ``*result`` to ``0`` and return ``-1``, *without* setting an exception. To get the cause of the error, :term:`attach <attached thread state>` a :term:`thread state`, and call the regular (non-``Raw``) function. Note that the regular function may succeed after the ``Raw`` one failed.
pt_br: Em caso de falha, elas definem ``*result`` como ``0`` e retornam ``-1``, *sem* definir uma exceção. Para acessar a causa do erro, :term:`anexe <attached thread state>` um :term:`estado de thread` e chame a função regular (sem o sufixo ``Raw``). Observe que a função regular pode ser bem-sucedida mesmo após o ``Raw`` falhar.

source: Similar to :c:func:`PyTime_Monotonic`, but don't set an exception on error and don't require an :term:`attached thread state`.
pt_br: Similar a :c:func:`PyTime_Monotonic`, mas não define uma exceção em caso de erro, e não exige um :term:`estado de thread anexado`.

source: Similar to :c:func:`PyTime_PerfCounter`, but don't set an exception on error and don't require an :term:`attached thread state`.
pt_br: Similar a :c:func:`PyTime_PerfCounter`, mas não define uma exceção em caso de erro e não requer um :term:`estado de thread anexado`.

source: Similar to :c:func:`PyTime_Time`, but don't set an exception on error and don't require an :term:`attached thread state`.
pt_br: Similar a :c:func:`PyTime_Time`, mas não define uma exceção em caso de erro e não requer um :term:`estado de thread anexado`.

source: Conversion functions
pt_br: Funções de conversão

source: Convert a timestamp to a number of seconds as a C :c:expr:`double`.
pt_br: Converte um registro de data e hora para uma quantidade de segundos como um :c:expr:`double` C.

source: The function cannot fail, but note that :c:expr:`double` has limited accuracy for large values.
pt_br: Esta função nunca falha, mas note que :c:expr:`double` tem acurácia limitada para valores grandes.
