Repository: python/python-docs-pt-br
Catalog: c-api/veryhigh.po
Languages: pt_br

source: The Very High Level Layer
pt_br: A camada de nível muito alto

source: The functions in this chapter will let you execute Python source code given in a file or a buffer, but they will not let you interact in a more detailed way with the interpreter.
pt_br: As funções neste capítulo permitirão que você execute um código-fonte Python fornecido em um arquivo ou buffer, mas não permitirão que você interaja de forma mais detalhada com o interpretador.

source: Several of these functions accept a start symbol from the grammar as a parameter. The available start symbols are :c:data:`Py_eval_input`, :c:data:`Py_file_input`, and :c:data:`Py_single_input`. These are described following the functions which accept them as parameters.
pt_br: Várias dessas funções aceitam um símbolo de início da gramática como parâmetro. Os símbolos de início disponíveis são :c:data:`Py_eval_input`, :c:data:`Py_file_input` e :c:data:`Py_single_input`. Eles são descritos seguindo as funções que os aceitam como parâmetros.

source: Note also that several of these functions take :c:expr:`FILE*` parameters. One particular issue which needs to be handled carefully is that the :c:type:`FILE` structure for different C libraries can be different and incompatible. Under Windows (at least), it is possible for dynamically linked extensions to actually use different libraries, so care should be taken that :c:expr:`FILE*` parameters are only passed to these functions if it is certain that they were created by the same library that the Python runtime is using.
pt_br: Note também que várias dessas funções aceitam parâmetros :c:expr:`FILE*`. Um problema específico que precisa ser tratado com cuidado é que a estrutura :c:type:`FILE` para diferentes bibliotecas C pode ser diferente e incompatível. No Windows (pelo menos), é possível que extensões vinculadas dinamicamente usem bibliotecas diferentes, então deve-se tomar cuidado para que os parâmetros :c:expr:`FILE*` sejam passados para essas funções somente se for certo que elas foram criadas pela mesma biblioteca que o tempo de execução do Python está usando.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_AnyFileExFlags` abaixo, deixando *closeit* definido como ``0`` e *flags* definido como ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving the *closeit* argument set to ``0``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_AnyFileExFlags` abaixo, deixando o argumento *closeit* definido como ``0``.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving the *flags* argument set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_AnyFileExFlags` abaixo, deixando o argumento *flags* definido como ``NULL``.

source: If *fp* refers to a file associated with an interactive device (console or terminal input or Unix pseudo-terminal), return the value of :c:func:`PyRun_InteractiveLoop`, otherwise return the result of :c:func:`PyRun_SimpleFile`. *filename* is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`). If *filename* is ``NULL``, this function uses ``"???"`` as the filename. If *closeit* is true, the file is closed before ``PyRun_SimpleFileExFlags()`` returns.
pt_br: Se *fp* se referir a um arquivo associado a um dispositivo interativo (entrada de console ou terminal ou pseudo-terminal Unix), retorna o valor de :c:func:`PyRun_InteractiveLoop`, caso contrário, retorna o resultado de :c:func:`PyRun_SimpleFile`. *filename* é decodificado da codificação do sistema de arquivos (:func:`sys.getfilesystemencoding`). Se *filename* for ``NULL``, esta função usa ``"???"`` como o nome do arquivo. Se *closeit* for verdadeiro, o arquivo será fechado antes de ``PyRun_SimpleFileExFlags()`` retornar.

source: This is a simplified interface to :c:func:`PyRun_SimpleStringFlags` below, leaving the :c:struct:`PyCompilerFlags`\* argument set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_SimpleStringFlags` abaixo, deixando o argumento :c:struct:`PyCompilerFlags`\* definido como ``NULL``.

source: Executes the Python source code from *command* in the :mod:`__main__` module according to the *flags* argument. If :mod:`__main__` does not already exist, it is created. Returns ``0`` on success or ``-1`` if an exception was raised. If there was an error, there is no way to get the exception information. For the meaning of *flags*, see below.
pt_br: Executa o código-fonte Python de *command* no módulo :mod:`__main__` de acordo com o argumento *flags*. Se :mod:`__main__` ainda não existir, ele será criado. Retorna ``0`` em caso de sucesso ou ``-1`` se uma exceção foi gerada. Se houve um erro, não há como obter as informações da exceção. Para o significado de *flags*, veja abaixo.

source: Note that if an otherwise unhandled :exc:`SystemExit` is raised, this function will not return ``-1``, but exit the process, as long as :c:member:`PyConfig.inspect` is zero.
pt_br: Observe que se uma exceção :exc:`SystemExit` não tratada for levantada, esta função não retornará ``-1``, mas sairá do processo, desde que :c:member:`PyConfig.inspect` seja zero.

source: This is a simplified interface to :c:func:`PyRun_SimpleFileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_SimpleFileExFlags` abaixo, deixando *closeit* definido como ``0`` e *flags* definido como ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_SimpleFileExFlags` below, leaving *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_SimpleFileExFlags` abaixo, deixando o *flags* definido como ``NULL``.

source: Similar to :c:func:`PyRun_SimpleStringFlags`, but the Python source code is read from *fp* instead of an in-memory string. *filename* should be the name of the file, it is decoded from :term:`filesystem encoding and error handler`. If *closeit* is true, the file is closed before ``PyRun_SimpleFileExFlags()`` returns.
pt_br: Semelhante a :c:func:`PyRun_SimpleStringFlags`, mas o código-fonte Python é lido de *fp* em vez de uma string na memória. *filename* deve ser o nome do arquivo, ele é decodificado a partir do :term:`tratador de erros e codificação do sistema de arquivos`. Se *closeit* for true, o arquivo será fechado antes que ``PyRun_SimpleFileExFlags()`` retorne.

source: On Windows, *fp* should be opened as binary mode (e.g. ``fopen(filename, "rb")``). Otherwise, Python may not handle script file with LF line ending correctly.
pt_br: No Windows, *fp* deve ser aberto como modo binário (por exemplo, ``fopen(filename, "rb")``). Caso contrário, o Python pode não manipular corretamente o arquivo de script com final de linha LF.

source: This is a simplified interface to :c:func:`PyRun_InteractiveOneFlags` below, leaving *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_InteractiveOneFlags` abaixo, deixando *flags* definido como ``NULL``.

source: Read and execute a single statement from a file associated with an interactive device according to the *flags* argument. The user will be prompted using ``sys.ps1`` and ``sys.ps2``. *filename* is decoded from the :term:`filesystem encoding and error handler`.
pt_br: Lê e executa uma única instrução de um arquivo associado a um dispositivo interativo de acordo com o argumento *flags*. O usuário será solicitado usando ``sys.ps1`` e ``sys.ps2``. *filename* é decodificado a partir do :term:`tratador de erros e codificação do sistema de arquivos`.

source: Returns ``0`` when the input was executed successfully, ``-1`` if there was an exception, or an error code from the :file:`errcode.h` include file distributed as part of Python if there was a parse error. (Note that :file:`errcode.h` is not included by :file:`Python.h`, so must be included specifically if needed.)
pt_br: Retorna ``0`` quando a entrada foi executada com sucesso, ``-1`` se houve uma exceção ou um código de erro do arquivo de inclusão :file:`errcode.h` distribuído como parte do Python se houve um erro de análise. (Observe que :file:`errcode.h` não é incluído por :file:`Python.h`, então deve ser incluído especificamente se necessário.)

source: This is a simplified interface to :c:func:`PyRun_InteractiveLoopFlags` below, leaving *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_InteractiveLoopFlags` abaixo, deixando *flags* definido como ``NULL``.

source: Read and execute statements from a file associated with an interactive device until EOF is reached. The user will be prompted using ``sys.ps1`` and ``sys.ps2``. *filename* is decoded from the :term:`filesystem encoding and error handler`. Returns ``0`` at EOF or a negative number upon failure.
pt_br: Lê e executa instruções de um arquivo associado a um dispositivo interativo até que o EOF seja atingido. O usuário será consultado usando ``sys.ps1`` e ``sys.ps2``. *filename* é decodificado a partir do :term:`tratador de erros e codificação do sistema de arquivos`. Retorna ``0`` no EOF ou um número negativo em caso de falha.

source: Can be set to point to a function with the prototype ``int func(void)``. The function will be called when Python's interpreter prompt is about to become idle and wait for user input from the terminal. The return value is ignored. Overriding this hook can be used to integrate the interpreter's prompt with other event loops, as done in :file:`Modules/_tkinter.c` in the Python source code.
pt_br: Pode ser definido para apontar para uma função com o protótipo ``int func(void)``. A função será chamada quando o prompt do interpretador do Python estiver prestes a ficar ocioso e aguardar a entrada do usuário no terminal. O valor de retorno é ignorado. A substituição deste hook pode ser usada para integrar o prompt do interpretador com outros laços de eventos, como feito em :file:`Modules/_tkinter.c` no código-fonte do Python.

source: This function is only called from the :ref:`main interpreter <sub-interpreter-support>`.
pt_br: Esta função só é chamada pelo :ref:`interpretador principal <sub-interpreter-support>`.

source: Can be set to point to a function with the prototype ``char *func(FILE *stdin, FILE *stdout, char *prompt)``, overriding the default function used to read a single line of input at the interpreter's prompt. The function is expected to output the string *prompt* if it's not ``NULL``, and then read a line of input from the provided standard input file, returning the resulting string. For example, The :mod:`readline` module sets this hook to provide line-editing and tab-completion features.
pt_br: Pode ser definido para apontar para uma função com o protótipo ``char *func(FILE *stdin, FILE *stdout, char *prompt)``, substituindo a função padrão usada para ler uma única linha de entrada no prompt do interpretador. Espera-se que a função produza a string *prompt* se não for ``NULL`` e, em seguida, leia uma linha de entrada do arquivo de entrada padrão fornecido, retornando a string resultante. Por exemplo, o módulo :mod:`readline` define este gancho para fornecer recursos de edição de linha e preenchimento de tabulação.

source: The result must be a string allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, or ``NULL`` if an error occurred.
pt_br: O resultado deve ser uma string alocada por :c:func:`PyMem_RawMalloc` ou :c:func:`PyMem_RawRealloc`, ou ``NULL`` se ocorrer um erro.

source: The result must be allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, instead of being allocated by :c:func:`PyMem_Malloc` or :c:func:`PyMem_Realloc`.
pt_br: O resultado deve ser alocado por :c:func:`PyMem_RawMalloc` ou :c:func:`PyMem_RawRealloc`, em vez de ser alocado por :c:func:`PyMem_Malloc` ou :c:func:`PyMem_Realloc`.

source: This is a simplified interface to :c:func:`PyRun_StringFlags` below, leaving *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_StringFlags` abaixo, deixando *flags* definido como ``NULL``.

source: Execute Python source code from *str* in the context specified by the objects *globals* and *locals* with the compiler flags specified by *flags*. *globals* must be a dictionary; *locals* can be any object that implements the mapping protocol. The parameter *start* specifies the start symbol and must one of the following: :c:data:`Py_eval_input`, :c:data:`Py_file_input`, or :c:data:`Py_single_input`.
pt_br: Executa o código-fonte Python de *str* no contexto especificado pelos objetos *globals* e *locals* com os sinalizadores do compilador especificados por *flags*. *globals* deve ser um dicionário; *locals* pode ser qualquer objeto que implemente o protocolo de mapeamento. O parâmetro *start* especifica o símbolo inicial e deve ser um dos seguintes: :c:data:`Py_eval_input`, :c:data:`Py_file_input` ou :c:data:`Py_single_input`.

source: Returns the result of executing the code as a Python object, or ``NULL`` if an exception was raised.
pt_br: Retorna o resultado da execução do código como um objeto Python, ou ``NULL`` se uma exceção foi levantada.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_FileExFlags` abaixo, deixando *closeit* definido como ``0`` e *flags* definido como ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_FileExFlags` abaixo, deixando *flags* definido como ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *closeit* set to ``0``.
pt_br: Esta é uma interface simplificada para :c:func:`PyRun_FileExFlags` abaixo, deixando *closeit* definido como ``0``.

source: Similar to :c:func:`PyRun_StringFlags`, but the Python source code is read from *fp* instead of an in-memory string. *filename* should be the name of the file, it is decoded from the :term:`filesystem encoding and error handler`. If *closeit* is true, the file is closed before :c:func:`PyRun_FileExFlags` returns.
pt_br: Semelhante a :c:func:`PyRun_StringFlags`, mas o código-fonte Python é lido de *fp* em vez de uma string na memória. *filename* deve ser o nome do arquivo, ele é decodificado a partir do :term:`tratador de erros e codificação do sistema de arquivos`. Se *closeit* for true, o arquivo será fechado antes que :c:func:`PyRun_FileExFlags` retorne.

source: This is a simplified interface to :c:func:`Py_CompileStringFlags` below, leaving *flags* set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`Py_CompileStringFlags` abaixo, deixando *flags* definido como ``NULL``.

source: This is a simplified interface to :c:func:`Py_CompileStringExFlags` below, with *optimize* set to ``-1``.
pt_br: Esta é uma interface simplificada para :c:func:`Py_CompileStringExFlags` abaixo, com *optimize* definido como ``-1``.

source: Parse and compile the Python source code in *str*, returning the resulting code object. The start symbol is given by *start*; this can be used to constrain the code which can be compiled and should be :c:data:`Py_eval_input`, :c:data:`Py_file_input`, or :c:data:`Py_single_input`. The filename specified by *filename* is used to construct the code object and may appear in tracebacks or :exc:`SyntaxError` exception messages. This returns ``NULL`` if the code cannot be parsed or compiled.
pt_br: Analisa e compila o código-fonte Python em *str*, retornando o objeto de código resultante. O símbolo inicial é fornecido por *start*; isso pode ser usado para restringir o código que pode ser compilado e deve ser :c:data:`Py_eval_input`, :c:data:`Py_file_input` ou :c:data:`Py_single_input`. O nome do arquivo especificado por *filename* é usado para construir o objeto de código e pode aparecer em tracebacks ou mensagens de exceção :exc:`SyntaxError`. Isso retorna ``NULL`` se o código não puder ser analisado ou compilado.

source: The integer *optimize* specifies the optimization level of the compiler; a value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
pt_br: O inteiro *optimize* especifica o nível de otimização do compilador; um valor de ``-1`` seleciona o nível de otimização do interpretador dado pela opção :option:`-O`. Níveis explícitos são ``0`` (nenhuma otimização; ``__debug__`` é verdadeiro), ``1`` (instruções ``assert`` são removidas, ``__debug__`` é falso) ou ``2`` (strings de documentação também são removidas).

source: Like :c:func:`Py_CompileStringObject`, but *filename* is a byte string decoded from the :term:`filesystem encoding and error handler`.
pt_br: Como :c:func:`Py_CompileStringObject`, mas *filename* é uma string de bytes decodificada a partir do :term:`tratador de erros e codificação do sistema de arquivos`.

source: This is a simplified interface to :c:func:`PyEval_EvalCodeEx`, with just the code object, and global and local variables. The other arguments are set to ``NULL``.
pt_br: Esta é uma interface simplificada para :c:func:`PyEval_EvalCodeEx`, com apenas o objeto código e variáveis locais e globais. Os outros argumentos são definidos como ``NULL``.

source: Evaluate a precompiled code object, given a particular environment for its evaluation. This environment consists of a dictionary of global variables, a mapping object of local variables, arrays of arguments, keywords and defaults, a dictionary of default values for :ref:`keyword-only <keyword-only_parameter>` arguments and a closure tuple of cells.
pt_br: Avalia um objeto código pré-compilado, dado um ambiente particular para sua avaliação. Este ambiente consiste em um dicionário de variáveis globais, um objeto mapeamento de variáveis locais, vetores de argumentos, nomeados e padrões, um dicionário de valores padrões para argumentos :ref:`somente-nomeados <keyword-only_parameter>` e uma tupla de clausura de células.

source: Evaluate an execution frame. This is a simplified interface to :c:func:`PyEval_EvalFrameEx`, for backward compatibility.
pt_br: Avalia um quadro de execução. Esta é uma interface simplificada para :c:func:`PyEval_EvalFrameEx`, para retrocompatibilidade.

source: This is the main, unvarnished function of Python interpretation. The code object associated with the execution frame *f* is executed, interpreting bytecode and executing calls as needed. The additional *throwflag* parameter can mostly be ignored - if true, then it causes an exception to immediately be thrown; this is used for the :meth:`~generator.throw` methods of generator objects.
pt_br: Esta é a função principal e sem retoques da interpretação Python. O objeto código associado ao quadro de execução *f* é executado, interpretando bytecode e executando chamadas conforme necessário. O parâmetro adicional *throwflag* pode ser ignorado na maioria das vezes - se verdadeiro, ele faz com que uma exceção seja levantada imediatamente; isso é usado para os métodos :meth:`~generator.throw` de objetos geradores.

source: This function now includes a debug assertion to help ensure that it does not silently discard an active exception.
pt_br: Essa função agora inclui uma asserção de depuração para ajudar a garantir que ela não descarte silenciosamente uma exceção ativa.

source: This function changes the flags of the current evaluation frame, and returns true on success, false on failure.
pt_br: Esta função altera os sinalizadores do quadro de avaliação atual e retorna verdadeiro em caso de sucesso e falso em caso de falha.

source: The start symbol from the Python grammar for isolated expressions; for use with :c:func:`Py_CompileString`.
pt_br: O símbolo inicial da gramática Python para expressões isoladas; para uso com :c:func:`Py_CompileString`.

source: The start symbol from the Python grammar for sequences of statements as read from a file or other source; for use with :c:func:`Py_CompileString`. This is the symbol to use when compiling arbitrarily long Python source code.
pt_br: O símbolo de início da gramática Python para sequências de instruções conforme lidas de um arquivo ou outra fonte; para uso com :c:func:`Py_CompileString`. Este é o símbolo a ser usado ao compilar código-fonte Python arbitrariamente longo.

source: The start symbol from the Python grammar for a single statement; for use with :c:func:`Py_CompileString`. This is the symbol used for the interactive interpreter loop.
pt_br: O símbolo de início da gramática Python para uma única declaração; para uso com :c:func:`Py_CompileString`. Este é o símbolo usado para o laço do interpretador interativo.

source: This is the structure used to hold compiler flags. In cases where code is only being compiled, it is passed as ``int flags``, and in cases where code is being executed, it is passed as ``PyCompilerFlags *flags``. In this case, ``from __future__ import`` can modify *flags*.
pt_br: Esta é a estrutura usada para manter os sinalizadores do compilador. Em casos onde o código está apenas sendo compilado, ele é passado como ``int flags``, e em casos onde o código está sendo executado, ele é passado como ``PyCompilerFlags *flags``. Neste caso, ``from __future__ import`` pode modificar *flags*.

source: Whenever ``PyCompilerFlags *flags`` is ``NULL``, :c:member:`~PyCompilerFlags.cf_flags` is treated as equal to ``0``, and any modification due to ``from __future__ import`` is discarded.
pt_br: Sempre que ``PyCompilerFlags *flags`` for ``NULL``, :c:member:`~PyCompilerFlags.cf_flags` é tratado como igual a ``0``, e qualquer modificação devido a ``from __future__ import`` é descartada.

source: Compiler flags.
pt_br: Sinalizadores do compilador.

source: *cf_feature_version* is the minor Python version. It should be initialized to ``PY_MINOR_VERSION``.
pt_br: *cf_feature_version* é a versão secundária do Python. Deve ser inicializada como ``PY_MINOR_VERSION``.

source: The field is ignored by default, it is used if and only if ``PyCF_ONLY_AST`` flag is set in :c:member:`~PyCompilerFlags.cf_flags`.
pt_br: O campo é ignorado por padrão, ele é usado se e somente se o sinalizador ``PyCF_ONLY_AST`` estiver definido em :c:member:`~PyCompilerFlags.cf_flags`.

source: Added *cf_feature_version* field.
pt_br: Adicionado campo *cf_feature_version*.

source: The available compiler flags are accessible as macros:
pt_br: Os sinalizadores do compilador disponíveis são acessíveis como macros:

source: See :ref:`compiler flags <ast-compiler-flags>` in documentation of the :py:mod:`!ast` Python module, which exports these constants under the same names.
pt_br: Veja :ref:`sinalizadores do compilador <ast-compiler-flags>` na documentação do módulo Python :py:mod:`!ast`, que exporta essas constantes com os mesmos nomes.

source: The "``PyCF``" flags above can be combined with "``CO_FUTURE``" flags such as :c:macro:`CO_FUTURE_ANNOTATIONS` to enable features normally selectable using :ref:`future statements <future>`. See :ref:`c_codeobject_flags` for a complete list.
pt_br: Os sinalizadores "``PyCF``" acima podem ser combinados com sinalizadores "``CO_FUTURE``", como :c:macro:`CO_FUTURE_ANNOTATIONS`, para habilitar recursos normalmente selecionáveis usando :ref:`instruções future <future>`. Consulte :ref:`c_codeobject_flags` para obter uma lista completa.

source: Py_CompileString (C function)
pt_br: Py_CompileString (função C)
