Repository: python/python-docs-pt-br
Catalog: c-api/weakref.po
Languages: pt_br

source: Weak Reference Objects
pt_br: Objetos referência fraca

source: Python supports *weak references* as first-class objects. There are two specific object types which directly implement weak references. The first is a simple reference object, and the second acts as a proxy for the original object as much as it can.
pt_br: O Python oferece suporte a *referências fracas* como objetos de primeira classe. Existem dois tipos de objetos específicos que implementam diretamente referências fracas. O primeiro é um objeto de referência simples, e o segundo atua como um intermediário ao objeto original tanto quanto ele pode.

source: Return non-zero if *ob* is either a reference or proxy object. This function always succeeds.
pt_br: Retorna não zero se *ob* for um objeto referência ou um objeto intermediário. Esta função sempre tem sucesso.

source: Return non-zero if *ob* is a proxy object. This function always succeeds.
pt_br: Retorna não zero se *ob* for um objeto intermediário. Esta função sempre tem sucesso.

source: Return a weak reference object for the object *ob*. This will always return a new reference, but is not guaranteed to create a new object; an existing reference object may be returned. The second parameter, *callback*, can be a callable object that receives notification when *ob* is garbage collected; it should accept a single parameter, which will be the weak reference object itself. *callback* may also be ``None`` or ``NULL``. If *ob* is not a weakly referenceable object, or if *callback* is not callable, ``None``, or ``NULL``, this will return ``NULL`` and raise :exc:`TypeError`.
pt_br: Retorna um objeto de referência fraco para o objeto *ob*. Isso sempre retornará uma nova referência, mas não é garantido para criar um novo objeto; um objeto de referência existente pode ser retornado. O segundo parâmetro, *callback*, pode ser um objeto chamável que recebe notificação quando *ob* for lixo coletado; ele deve aceitar um único parâmetro, que será o objeto de referência fraco propriamente dito. *callback* também pode ser ``None`` ou ``NULL``. Se *ob* não for um objeto fracamente referenciável, ou se *callback* não for um chamável, ``None``, ou ``NULL``, isso retornará ``NULL`` e levantará a :exc:`TypeError`.

source: Return a weak reference proxy object for the object *ob*. This will always return a new reference, but is not guaranteed to create a new object; an existing proxy object may be returned. The second parameter, *callback*, can be a callable object that receives notification when *ob* is garbage collected; it should accept a single parameter, which will be the weak reference object itself. *callback* may also be ``None`` or ``NULL``. If *ob* is not a weakly referenceable object, or if *callback* is not callable, ``None``, or ``NULL``, this will return ``NULL`` and raise :exc:`TypeError`.
pt_br: Retorna um objeto de proxy de referência fraca para o objeto *ob*. Isso sempre retornará uma nova referência, mas não é garantido para criar um novo objeto; um objeto de proxy existente pode ser retornado. O segundo parâmetro, *callback*, pode ser um objeto chamável que recebe notificação quando *ob* for lixo coletado; ele deve aceitar um único parâmetro, que será o objeto de referência fraco propriamente dito. *callback* também pode ser ``None`` ou ``NULL``. Se *ob* não for um objeto referência fraca, ou se *callback* não for um chamável, ``None``, ou ``NULL``, isso retornará ``NULL`` e levantará a :exc:`TypeError`.

source: Get a :term:`strong reference` to the referenced object from a weak reference, *ref*, into *\*pobj*.
pt_br: Obtém uma :term:`referência forte` para o objeto referenciado a partir de uma referência fraca, *ref*, em *\*pobj*.

source: On success, set *\*pobj* to a new :term:`strong reference` to the referenced object and return 1.
pt_br: Em caso de sucesso, define *\*pobj* como uma nova :term:`referência forte` para o objeto referenciado e retorna 1.

source: If the reference is dead, set *\*pobj* to ``NULL`` and return 0.
pt_br: Se a referência estiver quebrada, define *\*pobj* como ``NULL`` e retorna 0.

source: On error, raise an exception and return -1.
pt_br: Em caso de erro, levanta uma exceção e retorna -1.

source: Return a :term:`borrowed reference` to the referenced object from a weak reference, *ref*. If the referent is no longer live, returns ``Py_None``.
pt_br: Retorna uma :term:`referência emprestada` ao objeto referenciado a partir de uma referência fraca, *ref*. Se o referente não estiver mais em tempo real, retorna ``Py_None``.

source: This function returns a :term:`borrowed reference` to the referenced object. This means that you should always call :c:func:`Py_INCREF` on the object except when it cannot be destroyed before the last usage of the borrowed reference.
pt_br: Esta função retorna uma :term:`referência emprestada` para o objeto referenciado. Isso significa que você deve sempre chamar :c:func:`Py_INCREF` no objeto, exceto quando ele não puder ser destruído antes do último uso da referência emprestada.

source: Use :c:func:`PyWeakref_GetRef` instead.
pt_br: Usa :c:func:`PyWeakref_GetRef`.

source: Similar to :c:func:`PyWeakref_GetObject`, but does no error checking.
pt_br: Semelhante a :c:func:`PyWeakref_GetObject`, mas não verifica erros.

source: Test if the weak reference *ref* is dead. Returns 1 if the reference is dead, 0 if it is alive, and -1 with an error set if *ref* is not a weak reference object.
pt_br: Testa se a referência fraca *ref* está inativa. Retorna 1 se a referência estiver inativa, 0 se estiver ativa e -1 com um erro definido se *ref* não for um objeto referência fraca.

source: This function is called by the :c:member:`~PyTypeObject.tp_dealloc` handler to clear weak references.
pt_br: Esta função é chamada pelo tratador :c:member:`~PyTypeObject.tp_dealloc` para limpar referências fracas.

source: This iterates through the weak references for *object* and calls callbacks for those references which have one. It returns when all callbacks have been attempted.
pt_br: Isso itera pelas referências fracas para *object* e chama retornos de chamada para as referências que possuem um. Ele retorna quando todos os retornos de chamada foram tentados.

source: Clears the weakrefs for *object* without calling the callbacks.
pt_br: Limpa as referências fracas para *object* sem chamar as funções de retorno

source: This function is called by the :c:member:`~PyTypeObject.tp_dealloc` handler for types with finalizers (i.e., :meth:`~object.__del__`). The handler for those objects first calls :c:func:`PyObject_ClearWeakRefs` to clear weakrefs and call their callbacks, then the finalizer, and finally this function to clear any weakrefs that may have been created by the finalizer.
pt_br: Esta função é chamada pelo manipulador :c:member:`~PyTypeObject.tp_dealloc` para tipos com finalizadores (por exemplo, :meth:`~object.__del__`). O manipulador para esses objetos primeiro chama :c:func:`PyObject_ClearWeakRefs` para limpar referências fracas e chamar suas funções de retorno, depois o finalizador e, finalmente, esta função para limpar quaisquer referências fracas que possam ter sido criadas pelo finalizador.

source: In most circumstances, it's more appropriate to use :c:func:`PyObject_ClearWeakRefs` to clear weakrefs instead of this function.
pt_br: Na maioria das circunstâncias, é mais apropriado usar :c:func:`PyObject_ClearWeakRefs` para limpar referências fracas em vez desta função.
